{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16581",
  "eid" : "26d771b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778574411,
  "textBody" : "Johnny Lee Bench (born December 7, 1947) is an American former professional baseball catcher who played in the Major Leagues for the Cincinnati Reds from 1967 to 1983 and is a member of the National Baseball Hall of Fame. Bench is a 14-time All-Star selection and a two-time National League Most Valuable Player. He was a key member of the Big Red Machine that won six division titles, four National League pennants, and two World Series championships.[http://entertainment.howstuffworks.com/johnny-bench-hof.htm http://entertainment.howstuffworks.com] ESPN has called him the greatest catcher in baseball history.\n\nMajor League Baseball career\n\n1960s\n\nBench played baseball and basketball and was class valedictorian at Binger-Oney High School in Binger, Oklahoma. He is one-eighth Choctaw. His father told him that the fastest route to becoming a major leaguer was as a catcher. Bench was drafted 36th overall by the Cincinnati Reds in the second round of the 1965 amateur draft, playing for the minor-league Buffalo Bisons in the 1966 and 1967 seasons before being called up to the Reds in August 1967. He hit only .163, but impressed many people with his defense and strong throwing arm, among them Hall of Famer Ted Williams. Williams signed a baseball for him and predicted that the young catcher would be \"a Hall of Famer for sure!\" Williams' prophecy became fact 22 years later in 1989 when Bench was elected to the Hall of Fame.\n\nDuring a spring training game in 1968, Bench was catching for eight-year veteran right-hander Jim Maloney. Maloney was once a hard thrower, but by this time injuries had dramatically reduced the speed of his fastball. Maloney insisted on repeatedly \"shaking off\" his younger catcher by throwing fastballs instead of the breaking balls that Bench had called for. An exasperated Bench bluntly told Maloney, \"Your fastball's not popping\". Maloney replied with an epithet. To prove to Maloney that his fastball wasn't effective anymore, Bench called for a fastball, and after Maloney released the ball, Bench dropped his catcher's mitt and comfortably caught the fastball barehanded. Bench was the Reds' catcher on April 30, 1969 when Maloney pitched a no hitter against the Houston Astros.\n\nAt age 20 in 1968, Bench impressed many people during his first full season. He won the National League Rookie of the Year Award and batted .275 with 15 home runs and 82 RBIs. This marked the first time that the award had been won by a catcher. He also won the 1968 National League Gold Glove Award for catchers, which was the first time that the award had been won by a rookie. He made 102 assists in 1968, which marked the first time in 23 years that a catcher had more than 100 assists in a season.\n\nDuring the 1960s, Bench also served in the United States Army Reserve as a member of the 478th Engineer Battalion, which was based across the Ohio River from Cincinnati at Fort Thomas, Kentucky.  This unit included several of his teammates, among them Pete Rose.  In the winter of 1970–1971 he was part of Bob Hope's USO Tour of Vietnam.\n\n1970s\n\nThe year 1970 was Bench's finest statistical season. At age 22, he became the youngest player to win the National League Most Valuable Player Award. He hit .293, led the National League with 45 home runs and a franchise-record 148 runs batted in as the Reds won the NL West Division. The Reds swept the Pittsburgh Pirates in the National League Championship Series, but lost to the Baltimore Orioles in five games in the World Series.\n\nBench had another strong year in 1972, winning the MVP Award for a second time. He led the National League in home runs (40) and RBI (125) to help propel the Reds to another National League West Division title and won the NL pennant in the deciding fifth game over the Pittsburgh Pirates. One of his most dramatic home runs was likely his ninth-inning, lead off, opposite field home run in that fifth NLCS game. The solo shot tied the game at three; the Reds won later in the inning on a wild pitch, 4–3. It was hailed after the game as \"one of the great clutch home runs of all time.\" However, the Reds lost the World Series to a strong Oakland Athletics team in seven games.\n\nAfter the 1972 season, Bench had a growth removed from his lung; he remained productive, but never again hit forty home runs in a season. In 1973, Bench hit 25 home runs and 104 RBI and helped the Reds rally from a 10½-game deficit to the Los Angeles Dodgers in early July to lead the majors with 99 wins and claim another NL West Division crown. In the NLCS, Cincinnati met a New York Mets team that won the NL East with an unimpressive  record, 16½ games behind the Reds. But the Mets boasted three of the better starting pitchers in the NL, future Hall of Famer Tom Seaver, Jerry Koosman, and Jon Matlack. Bench's bottom of the ninth-inning home run off Seaver in the first game propelled the Reds to victory, but Seaver would get the best of the Reds and Bench in the deciding Game 5, winning  to put the Mets into the World Series.[http://www.baseball-reference.com/leagues/NL/1973.shtml 1973 National League Team Statistics and Standings] won the series in five games win advance to the World Series against the Oakland A's.\n\nIn 1974, Bench led the league with 129 RBI and scored 108 runs, becoming only the fourth catcher in major league history with 100 or more runs and RBI in the same season. The Reds won the second-most games in the majors (98) but lost the West Division to the Los Angeles Dodgers. In 1975, the Reds finally broke through in the post season. Bench contributed 28 home runs and 110 RBI. Cincinnati swept the Pirates in three games to win the NLCS, and defeated the Boston Red Sox in a memorable seven-game World Series.\n\nBench struggled with ailing shoulders in 1976,\n and had one of his least productive years, with only 16 home runs and 74 RBIs. He finished with an excellent postseason, starting with a 4-for-12 (.333) performance in the NLCS sweep over the Philadelphia Phillies. The World Series provided a head-to-head match-up with the Yankees' all-star catcher, Thurman Munson. Bench rose to the occasion, hitting .533 with two home runs, while Munson also hit well, with a .529 average. The Reds won in a four-game sweep and Bench was named the Series' MVP. At the post-World Series press conference, Reds manager Sparky Anderson was asked by a journalist to compare Munson with his catcher. Anderson replied, \"I don't want to embarrass any other catcher by comparing him to Johnny Bench.\"\nAll Roads Lead to October (chapter 10) by Maury Allen, St. Martin's Press 2000 \n\nBench bounced back in 1977 to hit 31 home runs and 109 RBIs but the Dodgers won two straight NL pennants. The Reds reached the postseason just once more in his career, in 1979, but were swept in three straight in the NLCS by the Pittsburgh Pirates.\n\n1980s\n\nFor the last three seasons of his career, Bench caught only 13 games and played mostly first base or third base. The Cincinnati Reds proclaimed Saturday, September 17, 1983, \"Johnny Bench Night\" at Riverfront Stadium, in which he hit his 389th and final home run, a line drive to left in the third inning before a record crowd. He retired at the end of the season at age 35.\n\nMLB career statistics\n\nBench had 2,048 hits for a .267 career batting average with 389 home runs and 1,376 RBI during his 17-year Major League career, all spent with the Reds. He retired as the career home run leader for catchers, a record which stood until surpassed by Carlton Fisk and the current record holder, Mike Piazza. Bench still holds the Major League record for the most grand slam home runs by a catcher with 10. In his career, Bench earned 10 Gold Gloves, was named to the National League All-Star team 14 times, and won two Most Valuable Player Awards. He led the National League three times in caught stealing percentage and ended his career with a .991 fielding percentage. He caught 118 shutouts during his career, ranking him 12th all-time among major league catchers. Bench also won such awards as the Lou Gehrig Award (1975), the Babe Ruth Award (1976), and the Hutch Award (1981).\n\nBench popularized the hinged catcher's mitt, first introduced by Randy Hundley of the Chicago Cubs. He began using the mitt after a stint on the disabled list in 1966 for a thumb injury on his throwing hand. The mitt allowed Bench to tuck his throwing arm safely to the side when receiving the pitch. By the turn of the decade, the hinged mitt became standard catchers' equipment. Having huge hands (a famous photograph features him holding seven baseballs in his right hand), Bench also tended to block breaking balls in the dirt by scooping them with one hand instead of the more common and fundamentally proper way: dropping to both knees and blocking the ball using the chest protector to keep the ball in front.\n\nHonors and post-career activities\n\nBench was elected to the National Baseball Hall of Fame in Cooperstown, New York, in 1989 alongside Carl Yastrzemski. He was elected in his first year of eligibility, and appeared on 96% of the ballots, the third-highest percentage at that time. Three years earlier, Bench had been inducted into the Cincinnati Reds Hall of Fame in 1986 and his uniform #5 was retired by the team. He is currently on the Board of Directors for the Cincinnati Reds Hall of Fame. In 1989, he became the first individual baseball player to appear on a Wheaties box, a cereal he ate as a child.\n\nFor a time in the 1980s Bench was a commercial spokesman for Krylon paint, featuring a memorable catchphrase: \"I'm Johnny Bench, and this is Johnny Bench's bench.\" \n\nIn 1985, Bench starred as Joe Boyd/Joe Hardy in a Cincinnati stage production of the musical Damn Yankees, which also included Gwen Verdon and Gary Sandy. He also hosted the television series The Baseball Bunch from 1982 to 1985. A cast of boys and girls from the Tucson, Arizona, area would learn the game of baseball from Bench and other current and retired greats. The Chicken provided comic relief and former Los Angeles Dodgers manager Tommy Lasorda appeared as \"The Dugout Wizard.\"\n\nIn 1986, Bench and Don Drysdale did the backup contests or ABC's Sunday afternoon baseball telecasts (Al Michaels and Jim Palmer were the primary commentating crew). Keith Jackson, usually working with Tim McCarver did the #2 Monday night games. Bench took a week off in June (with Steve Busby filling in), and also worked one game with Michaels as the networks switched the announcer pairings. While Drysdale worked the All-Star Game in Houston as an interviewer he did not resurface until the playoffs. Bench simply disappeared, ultimately going to CBS Radio to help Brent Musburger call that year's National League Championship Series. Bench would later serve as color commentator CBS Radio's World Series coverage alongside Jack Buck and later Vin Scully from 1989-1993.\n\nAfter turning 50, Bench was a part-time professional golfer and played in several events on the Senior PGA Tour. He has a home at the Mission Hills-Gary Player Course in Rancho Mirage, California.\n\nIn 1999, Bench ranked Number 16 on The Sporting News list of the 100 Greatest Baseball Players. He was the highest-ranking catcher. Bench was also elected to the Major League Baseball All-Century Team as the top vote-receiving catcher. As part of the Golden Anniversary of the Rawlings Gold Glove Award, Bench was selected to the All-Time Rawlings Gold Glove Team.\n\nStarting with the 2000 college baseball season, the best collegiate catcher annually receives the Johnny Bench Award.  Notable winners include Buster Posey of Florida State University, Kelly Shoppach of Baylor University, Ryan Garko of Stanford University, and Kurt Suzuki of Cal State Fullerton.\n\nIn 2008, Bench co-wrote the book Catch Every Ball: How to Handle Life's Pitches with Paul Daugherty, published by Orange Frazer Press.  An autobiography published in 1979 called Catch You Later was co-authored with William Brashler. Bench has also broadcast games on television and radio, and is an avid golfer, having played in several Champions Tour tournaments.\n\nIn a September 2008 interview with Heidi Watney of the New England Sports Network, Johnny Bench, who was watching a Cleveland Indians/Boston Red Sox game at Fenway Park, did an impression of late Chicago Cubs announcer Harry Caray after Red Sox third baseman Kevin Youkilis, a native of Cincinnati, made a tough play. While knuckleballer Tim Wakefield was on the mound for the Red Sox, he related a story that then-Reds manager Sparky Anderson told him that he was thinking of trading for knuckleballer Phil Niekro. Bench replied that Anderson had better trade for Niekro's catcher, too.\n\nOn September 17, 2011, the Cincinnati Reds unveiled a statue of Bench at the entrance way of the Reds Hall of Fame at Great American Ball Park. The larger-than-life bronze statue by Tom Tsuchiya, shows Bench in the act of throwing out a base runner. Bench called the unveiling of his statue, his \"greatest moment.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Johnny Bench" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16581" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Johnny Lee Bench (born December 7, 1947) is an American former professional baseball catcher who played in the Major Leagues for the Cincinnati Reds from 1967 to 1983 and is a member of the National Baseball Hall of Fame. Bench is a 14-time All-Star selection and a two-time National League Most Valuable Player. He was a key member of the Big Red Machine that won six division titles, four National League pennants, and two World Series championships.[http://entertainment.howstuffworks.com/johnny-bench-hof.htm http://entertainment.howstuffworks.com] ESPN has called him the greatest catcher in baseball history.\n\nMajor League Baseball career\n\n1960s\n\nBench played baseball and basketball and was class valedictorian at Binger-Oney High School in Binger, Oklahoma. He is one-eighth Choctaw. His father told him that the fastest route to becoming a major leaguer was as a catcher. Bench was drafted 36th overall by the Cincinnati Reds in the second round of the 1965 amateur draft, playing for the minor-league Buffalo Bisons in the 1966 and 1967 seasons before being called up to the Reds in August 1967. He hit only .163, but impressed many people with his defense and strong throwing arm, among them Hall of Famer Ted Williams. Williams signed a baseball for him and predicted that the young catcher would be \"a Hall of Famer for sure!\" Williams' prophecy became fact 22 years later in 1989 when Bench was elected to the Hall of Fame.\n\nDuring a spring training game in 1968, Bench was catching for eight-year veteran right-hander Jim Maloney. Maloney was once a hard thrower, but by this time injuries had dramatically reduced the speed of his fastball. Maloney insisted on repeatedly \"shaking off\" his younger catcher by throwing fastballs instead of the breaking balls that Bench had called for. An exasperated Bench bluntly told Maloney, \"Your fastball's not popping\". Maloney replied with an epithet. To prove to Maloney that his fastball wasn't effective anymore, Bench called for a fastball, and after Maloney released the ball, Bench dropped his catcher's mitt and comfortably caught the fastball barehanded. Bench was the Reds' catcher on April 30, 1969 when Maloney pitched a no hitter against the Houston Astros.\n\nAt age 20 in 1968, Bench impressed many people during his first full season. He won the National League Rookie of the Year Award and batted .275 with 15 home runs and 82 RBIs. This marked the first time that the award had been won by a catcher. He also won the 1968 National League Gold Glove Award for catchers, which was the first time that the award had been won by a rookie. He made 102 assists in 1968, which marked the first time in 23 years that a catcher had more than 100 assists in a season.\n\nDuring the 1960s, Bench also served in the United States Army Reserve as a member of the 478th Engineer Battalion, which was based across the Ohio River from Cincinnati at Fort Thomas, Kentucky.  This unit included several of his teammates, among them Pete Rose.  In the winter of 1970–1971 he was part of Bob Hope's USO Tour of Vietnam.\n\n1970s\n\nThe year 1970 was Bench's finest statistical season. At age 22, he became the youngest player to win the National League Most Valuable Player Award. He hit .293, led the National League with 45 home runs and a franchise-record 148 runs batted in as the Reds won the NL West Division. The Reds swept the Pittsburgh Pirates in the National League Championship Series, but lost to the Baltimore Orioles in five games in the World Series.\n\nBench had another strong year in 1972, winning the MVP Award for a second time. He led the National League in home runs (40) and RBI (125) to help propel the Reds to another National League West Division title and won the NL pennant in the deciding fifth game over the Pittsburgh Pirates. One of his most dramatic home runs was likely his ninth-inning, lead off, opposite field home run in that fifth NLCS game. The solo shot tied the game at three; the Reds won later in the inning on a wild pitch, 4–3. It was hailed after the game as \"one of the great clutch home runs of all time.\" However, the Reds lost the World Series to a strong Oakland Athletics team in seven games.\n\nAfter the 1972 season, Bench had a growth removed from his lung; he remained productive, but never again hit forty home runs in a season. In 1973, Bench hit 25 home runs and 104 RBI and helped the Reds rally from a 10½-game deficit to the Los Angeles Dodgers in early July to lead the majors with 99 wins and claim another NL West Division crown. In the NLCS, Cincinnati met a New York Mets team that won the NL East with an unimpressive  record, 16½ games behind the Reds. But the Mets boasted three of the better starting pitchers in the NL, future Hall of Famer Tom Seaver, Jerry Koosman, and Jon Matlack. Bench's bottom of the ninth-inning home run off Seaver in the first game propelled the Reds to victory, but Seaver would get the best of the Reds and Bench in the deciding Game 5, winning  to put the Mets into the World Series.[http://www.baseball-reference.com/leagues/NL/1973.shtml 1973 National League Team Statistics and Standings] won the series in five games win advance to the World Series against the Oakland A's.\n\nIn 1974, Bench led the league with 129 RBI and scored 108 runs, becoming only the fourth catcher in major league history with 100 or more runs and RBI in the same season. The Reds won the second-most games in the majors (98) but lost the West Division to the Los Angeles Dodgers. In 1975, the Reds finally broke through in the post season. Bench contributed 28 home runs and 110 RBI. Cincinnati swept the Pirates in three games to win the NLCS, and defeated the Boston Red Sox in a memorable seven-game World Series.\n\nBench struggled with ailing shoulders in 1976,\n and had one of his least productive years, with only 16 home runs and 74 RBIs. He finished with an excellent postseason, starting with a 4-for-12 (.333) performance in the NLCS sweep over the Philadelphia Phillies. The World Series provided a head-to-head match-up with the Yankees' all-star catcher, Thurman Munson. Bench rose to the occasion, hitting .533 with two home runs, while Munson also hit well, with a .529 average. The Reds won in a four-game sweep and Bench was named the Series' MVP. At the post-World Series press conference, Reds manager Sparky Anderson was asked by a journalist to compare Munson with his catcher. Anderson replied, \"I don't want to embarrass any other catcher by comparing him to Johnny Bench.\"\nAll Roads Lead to October (chapter 10) by Maury Allen, St. Martin's Press 2000 \n\nBench bounced back in 1977 to hit 31 home runs and 109 RBIs but the Dodgers won two straight NL pennants. The Reds reached the postseason just once more in his career, in 1979, but were swept in three straight in the NLCS by the Pittsburgh Pirates.\n\n1980s\n\nFor the last three seasons of his career, Bench caught only 13 games and played mostly first base or third base. The Cincinnati Reds proclaimed Saturday, September 17, 1983, \"Johnny Bench Night\" at Riverfront Stadium, in which he hit his 389th and final home run, a line drive to left in the third inning before a record crowd. He retired at the end of the season at age 35.\n\nMLB career statistics\n\nBench had 2,048 hits for a .267 career batting average with 389 home runs and 1,376 RBI during his 17-year Major League career, all spent with the Reds. He retired as the career home run leader for catchers, a record which stood until surpassed by Carlton Fisk and the current record holder, Mike Piazza. Bench still holds the Major League record for the most grand slam home runs by a catcher with 10. In his career, Bench earned 10 Gold Gloves, was named to the National League All-Star team 14 times, and won two Most Valuable Player Awards. He led the National League three times in caught stealing percentage and ended his career with a .991 fielding percentage. He caught 118 shutouts during his career, ranking him 12th all-time among major league catchers. Bench also won such awards as the Lou Gehrig Award (1975), the Babe Ruth Award (1976), and the Hutch Award (1981).\n\nBench popularized the hinged catcher's mitt, first introduced by Randy Hundley of the Chicago Cubs. He began using the mitt after a stint on the disabled list in 1966 for a thumb injury on his throwing hand. The mitt allowed Bench to tuck his throwing arm safely to the side when receiving the pitch. By the turn of the decade, the hinged mitt became standard catchers' equipment. Having huge hands (a famous photograph features him holding seven baseballs in his right hand), Bench also tended to block breaking balls in the dirt by scooping them with one hand instead of the more common and fundamentally proper way: dropping to both knees and blocking the ball using the chest protector to keep the ball in front.\n\nHonors and post-career activities\n\nBench was elected to the National Baseball Hall of Fame in Cooperstown, New York, in 1989 alongside Carl Yastrzemski. He was elected in his first year of eligibility, and appeared on 96% of the ballots, the third-highest percentage at that time. Three years earlier, Bench had been inducted into the Cincinnati Reds Hall of Fame in 1986 and his uniform #5 was retired by the team. He is currently on the Board of Directors for the Cincinnati Reds Hall of Fame. In 1989, he became the first individual baseball player to appear on a Wheaties box, a cereal he ate as a child.\n\nFor a time in the 1980s Bench was a commercial spokesman for Krylon paint, featuring a memorable catchphrase: \"I'm Johnny Bench, and this is Johnny Bench's bench.\" \n\nIn 1985, Bench starred as Joe Boyd/Joe Hardy in a Cincinnati stage production of the musical Damn Yankees, which also included Gwen Verdon and Gary Sandy. He also hosted the television series The Baseball Bunch from 1982 to 1985. A cast of boys and girls from the Tucson, Arizona, area would learn the game of baseball from Bench and other current and retired greats. The Chicken provided comic relief and former Los Angeles Dodgers manager Tommy Lasorda appeared as \"The Dugout Wizard.\"\n\nIn 1986, Bench and Don Drysdale did the backup contests or ABC's Sunday afternoon baseball telecasts (Al Michaels and Jim Palmer were the primary commentating crew). Keith Jackson, usually working with Tim McCarver did the #2 Monday night games. Bench took a week off in June (with Steve Busby filling in), and also worked one game with Michaels as the networks switched the announcer pairings. While Drysdale worked the All-Star Game in Houston as an interviewer he did not resurface until the playoffs. Bench simply disappeared, ultimately going to CBS Radio to help Brent Musburger call that year's National League Championship Series. Bench would later serve as color commentator CBS Radio's World Series coverage alongside Jack Buck and later Vin Scully from 1989-1993.\n\nAfter turning 50, Bench was a part-time professional golfer and played in several events on the Senior PGA Tour. He has a home at the Mission Hills-Gary Player Course in Rancho Mirage, California.\n\nIn 1999, Bench ranked Number 16 on The Sporting News list of the 100 Greatest Baseball Players. He was the highest-ranking catcher. Bench was also elected to the Major League Baseball All-Century Team as the top vote-receiving catcher. As part of the Golden Anniversary of the Rawlings Gold Glove Award, Bench was selected to the All-Time Rawlings Gold Glove Team.\n\nStarting with the 2000 college baseball season, the best collegiate catcher annually receives the Johnny Bench Award.  Notable winners include Buster Posey of Florida State University, Kelly Shoppach of Baylor University, Ryan Garko of Stanford University, and Kurt Suzuki of Cal State Fullerton.\n\nIn 2008, Bench co-wrote the book Catch Every Ball: How to Handle Life's Pitches with Paul Daugherty, published by Orange Frazer Press.  An autobiography published in 1979 called Catch You Later was co-authored with William Brashler. Bench has also broadcast games on television and radio, and is an avid golfer, having played in several Champions Tour tournaments.\n\nIn a September 2008 interview with Heidi Watney of the New England Sports Network, Johnny Bench, who was watching a Cleveland Indians/Boston Red Sox game at Fenway Park, did an impression of late Chicago Cubs announcer Harry Caray after Red Sox third baseman Kevin Youkilis, a native of Cincinnati, made a tough play. While knuckleballer Tim Wakefield was on the mound for the Red Sox, he related a story that then-Reds manager Sparky Anderson told him that he was thinking of trading for knuckleballer Phil Niekro. Bench replied that Anderson had better trade for Niekro's catcher, too.\n\nOn September 17, 2011, the Cincinnati Reds unveiled a statue of Bench at the entrance way of the Reds Hall of Fame at Great American Ball Park. The larger-than-life bronze statue by Tom Tsuchiya, shows Bench in the act of throwing out a base runner. Bench called the unveiling of his statue, his \"greatest moment.\". Johnny Bench. http://en.wikipedia.org/?curid=16581."
  }
}
