{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18906",
  "eid" : "35ff24d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778599837,
  "textBody" : "Microfluidics deals with the behaviour, precise control and manipulation of fluids that are geometrically constrained to a small, typically sub-millimeter, scale. It is a multidisciplinary field at the intersection of engineering, physics, chemistry, biochemistry, nanotechnology, and biotechnology, with practical applications in the design of systems in which low volumes of fluids are processed to achieve multiplexing, automation, and high-throughput screening. Microfluidics emerged in the beginning of the 1980s and is used in the development of inkjet printheads, DNA chips, lab-on-a-chip technology, micro-propulsion, and micro-thermal technologies.\n\nTypically, micro means one of the following features:\n* small volumes (μL, nL, pL, fL)\n* small size\n* low energy consumption\n* effects of the microdomain\n\nTypically fluids are moved, mixed, separated or otherwise processed. Numerous applications employ passive fluid control techniques like capillary forces. In some applications, external actuation means are additionally used for a directed transport of the media. Examples are rotary drives applying centrifugal forces for the fluid transport on the passive chips. Active microfluidics refers to the defined manipulation of the working fluid by active (micro) components such as micropumps or microvalves. Micropumps supply fluids in a continuous manner or are used for dosing. Microvalves determine the flow direction or the mode of movement of pumped liquids. Often processes which are normally carried out in a lab are miniaturised on a single chip in order to enhance efficiency and mobility as well as reducing sample and reagent volumes.\n\nMicroscale behaviour of fluids\n\nThe behaviour of fluids at the microscale can differ from \"macrofluidic\" behaviour in that factors such as surface tension, energy dissipation, and fluidic resistance start to dominate the system. Microfluidics studies how these behaviours change, and how they can be worked around, or exploited for new uses.S.C.Terry, J.H.Jerman and J.B.Angell:A Gas Chromatographic Air Analyzer Fabricated on a Silicon Wafer, IEEE Trans.Electron Devices, ED-26,12(1979)1880-1886.\n\nAt small scales (channel size of around 100 nanometers to 500 micrometers) some interesting and sometimes unintuitive properties appear. In particular, the Reynolds number (which compares the effect of the momentum of a fluid to the effect of viscosity) can become very low. A key consequence is co-flowing fluids do not necessarily mix in the traditional sense, as flow becomes laminar rather than turbulent; molecular transport between them must often be through diffusion.\n\nHigh specificity of chemical and physical properties (concentration, pH, temperature, shear force, etc.) can also be ensured resulting in more uniform reaction conditions and higher grade products in single and multi-step reactions.\n\nKey application areas\n\nMicrofluidic structures include micropneumatic systems, i.e. microsystems for the handling of off-chip fluids (liquid pumps, gas valves, etc.), and microfluidic structures for the on-chip handling of nanoliter (nl) and picoliter (pl) volumes.  To date, the most successful commercial application of microfluidics is the inkjet printhead. Additionally, advances in microfluidic manufacturing allow the devices to be produced in low-cost plasticsRyan S. Pawell, David W. Inglis, Tracie J. Barber, and Robert A. Taylor, [https://www.researchgate.net/publication/256487052_Manufacturing_and_wetting_low-cost_microfluidic_cell_separation_devices Manufacturing and wetting low-cost microfluidic cell separation devices], Biomicrofluidics 7, 056501 (2013);  and part quality may be verified automatically.[https://link.springer.com/article/10.1007/s10404-014-1464-1?sa_campaign\nemail/event/articleAuthor/onlineFirst Automating microfluidic part verification - Online First - Springer]\n\nAdvances in microfluidics technology are revolutionizing molecular biology procedures for enzymatic analysis (e.g.,  glucose and lactate assays), DNA analysis (e.g., polymerase chain reaction and high-throughput sequencing), and proteomics. The basic idea of microfluidic biochips is to integrate assay operations such as detection, as well as sample pre-treatment and sample preparation on one chip.\n\nAn emerging application area for biochips is clinical pathology, especially the immediate point-of-care diagnosis of diseases. In addition, microfluidics-based devices, capable of continuous sampling and real-time testing of air/water samples for biochemical toxins and other dangerous pathogens, can serve as an always-on \"bio-smoke alarm\" for early warning.\n\nMicrofluidic technology has led to the creation of powerful tools for biologists to control the complete cellular environment, leading to new questions and discoveries. Many diverse advantages of this technology for microbiology are listed below:\n* General single cell studies including growth \n* Cellular aging: microfluidic devices such as the \"mother machine\" allow tracking of thousands of individual cells for many generations until they die.\n* Microenvironmental control: ranging from mechanical environment  to chemical environment \n* Precise spatiotemporal concentration gradients by incorporating multiple chemical inputs to a single device \n* Force measurements of adherent cells or confined chromosomes: objects trapped in a microfluidic device can be directly manipulated using optical tweezers or other force-generating methods \n* Confining cells and exerting controlled forces by coupling with external force-generation methods such as Stokes flow, optical tweezer, or controlled deformation of the PDMS device Choi, J.W., Rosset, S., Niklaus, M., Adleman, J.R., Shea, H., Psaltis, D. \"3-dimensional electrode patterning within a microfluidic channel using a metal ion implantation\", Lab on a Chip 10, 738-788, 2010. [http://www.sciencedirect.com/science/article/B82X8-4Y34G8D-1/2/ea1d82f514b29565b6802589be564c8c \"Nano today 2010\"]\n* Fast and precise temperature control [http://pubs.rsc.org/en/content/articlelanding/2011/lc/c0lc00222d \"Lab on a Chip 2011\"][http://www.cherrybiotech.com/ \"CherryTemp temperature control system on chip\"]\n* Electric field integration \n* Plant on a chip and plant tissue culture \n* Antibiotic resistance: microfluidic devices can be used as heterogeneous environments for microorganisms. In a heterogeneous environment, it is easier for a microorganism to evolve. This can be useful for testing the acceleration of evolution of a microorganism / for testing the development of antibiotic resistance.\n\nSome of these areas are further elaborated in the sections below.\n\nContinuous-flow microfluidics\n\nThese technologies are based on the manipulation of continuous liquid flow through microfabricated channels. Actuation of liquid flow is implemented either by external pressure sources, external mechanical pumps, integrated mechanical micropumps, or by combinations of capillary forces and electrokinetic mechanisms.[http://www.cytonix.com/fluid%20transistor.html fluid transistor]   Continuous-flow microfluidic operation is the mainstream approach because it is easy to implement and less sensitive to protein fouling problems. Continuous-flow devices are adequate for many well-defined and simple biochemical applications, and for certain tasks such as chemical separation, but they are less suitable for tasks requiring a high degree of flexibility or fluid manipulations. These closed-channel systems are inherently difficult to integrate and scale because the parameters that govern flow field vary along the flow path making the fluid flow at any one location dependent on the properties of the entire system. Permanently etched microstructures also lead to limited reconfigurability and poor fault tolerance capability.\n\nProcess monitoring capabilities in continuous-flow systems can be achieved with highly sensitive microfluidic flow sensors based on MEMS technology which offers resolutions down to the nanoliter range.\n\nDroplet-based microfluidics\n\nDroplet-based microfluidics is a subcategory of microfluidics in contrast with continuous microfluidics; droplet-based microfluidics manipulates discrete volumes of fluids in immiscible phases with low Reynolds number and laminar flow regimes. Interest in droplet-based microfluidics systems has been growing substantially in past decades. Microdroplets allow for handling miniature volumes (μl to fl) of fluids conveniently, provide better mixing, encapsulation, sorting, and sensing, and suit high throughput experiments.Venkat Chokkalingam, Jurjen Tel, Florian Wimmers, Xin Liu, Sergey Semenov, Julian Thiele, Carl G. Figdor, Wilhelm T.S. Huck, Probing cellular heterogeneity in cytokine-secreting immune cells using droplet-based microfluidics, Lab on a Chip, 13, 4740-4744, 2013, DOI: 10.1039/C3LC50945A, http://pubs.rsc.org/en/content/articlelanding/2013/lc/c3lc50945a#!divAbstract Exploiting the benefits of droplet-based microfluidics efficiently requires a deep understanding of droplet generation  to perform various logical operations such as droplet motion, droplet sorting, droplet merging, and droplet breakup.\n\nDigital microfluidics\n\nAlternatives to the above closed-channel continuous-flow systems include novel open structures, where discrete, independently controllable droplets\nare manipulated on a substrate using electrowetting. Following the analogy of digital microelectronics, this approach is referred to as digital microfluidics. Le Pesant et al. pioneered the use of electrocapillary forces to move droplets on a digital track.Le Pesant et al., Electrodes for a device operating by electrically controlled fluid displacement, U.S. Pat. No. 4,569,575, Feb. 11, 1986. The \"fluid transistor\" pioneered by Cytonix[http://www.nsf.gov/awardsearch/piSearch.do;jsessionidD05E82394F781CBA17DB0C5AC8E3C0B8?SearchType\npiSearch&page1&QueryText\n&PIFirstNamejames&PILastName\nbrown&PIInstitutioncytonix&PIState\nMD&PIZip&PICountry\nUS&RestrictExpiredon&Search\nSearch#results NSF Award Search: Advanced Search Results] also played a role. The technology was subsequently commercialised by Duke University. By using discrete unit-volume droplets,  a microfluidic function can be reduced to a set of repeated basic operations, i.e., moving one unit of fluid over one unit of distance. This \"digitisation\" method facilitates the use of a hierarchical and cell-based approach for microfluidic biochip design. Therefore, digital microfluidics offers a flexible and scalable system architecture as well as high fault-tolerance capability. Moreover, because each droplet can be controlled independently, these systems also have dynamic reconfigurability, whereby groups of unit cells in a microfluidic array can be reconfigured to change their functionality during the concurrent execution of a set of bioassays. Although droplets are manipulated in confined microfluidic channels, since the control on droplets is not independent, it should not be confused as \"digital microfluidics\". One common actuation method for digital microfluidics is electrowetting-on-dielectric (EWOD). Many lab-on-a-chip applications have been demonstrated within the digital microfluidics paradigm using electrowetting. However, recently other techniques for droplet manipulation have also been demonstrated using surface acoustic waves, optoelectrowetting, mechanical actuation,J. Shemesh, A. Bransky, M. Khoury, S. Levenberg,\"[http://www.springerlink.com/content/e845tl2176r57117/ Advanced microfluidic droplet manipulation based on piezoelectric actuation]\" Biomedical Microdevices , 2010.    etc.\n\nDNA chips (microarrays)\n\nEarly biochips were based on the idea of a DNA microarray, e.g., the GeneChip DNAarray from Affymetrix, which is a piece of glass, plastic or silicon substrate, on which pieces of DNA (probes) are affixed in a microscopic array. Similar to a DNA microarray, a protein array is a miniature array where a multitude of different capture agents, most frequently monoclonal antibodies, are deposited on a chip surface; they are used to determine the presence and/or amount of proteins in biological samples, e.g., blood. A drawback of DNA and protein arrays is that they are neither reconfigurable nor scalable after manufacture. Digital microfluidics has been described as a means for carrying out Digital PCR.\n\nMolecular biology\n\nIn addition to microarrays, biochips have been designed for two-dimensional electrophoresis, transcriptome analysis, and PCR amplification. Other applications include various electrophoresis and liquid chromatography applications for proteins and DNA, cell separation, in particular, blood cell separation, protein analysis, cell manipulation and analysis including cell viability analysis  and microorganism capturing.\n\nEvolutionary biology\n\nBy combining microfluidics with landscape ecology and nanofluidics, a nano/micro fabricated fluidic landscape can be constructed by building local patches of bacterial habitat and connecting them by dispersal corridors. The resulting landscapes can be used as physical implementations of an adaptive landscape,  by generating a spatial mosaic of patches of opportunity distributed in space and time. The patchy nature of these fluidic landscapes allows for the study of adapting bacterial cells in a metapopulation system. The evolutionary ecology of these bacterial systems in these synthetic ecosystems allows for using biophysics to address questions in evolutionary biology.\n\nCell behavior\n\nThe ability to create precise and carefully controlled chemoattractant gradients makes microfluidics the ideal tool to study motility, chemotaxis and the ability to evolve / develop resistance to antibiotics in small populations of microorganisms and in a short period of time. These microorganisms including bacteria  and the broad range of organisms that form the marine microbial loop, responsible for regulating much of the oceans' biogeochemistry.\n\nMicrofluidics has also greatly aided the study of durotaxis by facilitating the creation of durotactic (stiffness) gradients.\n\nCellular biophysics\n\nBy rectifying the motion of individual swimming bacteria,  microfluidic structures can be used to extract mechanical motion from a population of motile bacterial cells.  This way, bacteria-powered rotors can be built.\n\nOptics\n\nThe merger of microfluidics and optics is typical known as optofluidics. Examples of optofluidic devices are tunable microlens arraysLiquid micro-lens array activated by selective electrowetting on lithium niobate substrates S. Grilli, L. Miccio, V. Vespini, A. Finizio, S. De Nicola, and P. Ferraro Optics Express 16, 8084-8093 (2008).  P. Ferraro, L. Miccio, S. Grilli, A. Finizio, S. De Nicola, and V. Vespini, \"Manipulating Thin Liquid Films for Tunable Microlens Arrays,\" Optics & Photonics News 19, 34-34 (2008) http://www.opticsinfobase.org/abstract.cfm?URI=OPN-19-12-34 and optofluidic microscopes.\n\nMicrofluidic flow enables fast sample throughput, automated imaging of large sample populations, as well as 3D capabilities.Flow-scanning optical tomography N. C. Pégard, M. L. Toth, M. Driscoll, and   J. W. Fleischer Lab Chip, (2014),14, 4447-4450 [http://pubs.rsc.org/en/Content/ArticleLanding/2014/LC/c4lc00701h#!divAbstract]N. C. Pégard and J. W. Fleischer, Journal of Biomedical Optics 18 040503 (2013)[http://www.opticsinfobase.org/abstract.cfm?URI=BIOMED-2012-BM4B.4] or superresolution.C-H. Lu, N. C. Pégard and J. W. Fleischer, 2013, Applied Physics Letters, 102 161115 (2013)[http://link.aip.org/link/?APPLAB/102/161115/1] \n\nAcoustic droplet ejection (ADE)\n\nAcoustic droplet ejection uses a pulse of ultrasound to move low volumes of fluids (typically nanoliters or picoliters) without any physical contact. This technology focuses acoustic energy into a fluid sample in order to eject droplets as small as a millionth of a millionth of a litre (picoliter = 10−12 litre). ADE technology is a very gentle process, and it can be used to transfer proteins, high molecular weight DNA and live cells without damage or loss of viability. This feature makes the technology suitable for a wide variety of applications including proteomics and cell-based assays.\n\nFuel cells\n\nMicrofluidic fuel cells can use laminar flow to separate the fuel and its oxidant to control the interaction of the two fluids without a physical barrier as would be required in conventional fuel cells.[http://microfluidics.stanford.edu/fuel_cells.htm Water Management in PEM Fuel Cells]   [http://www.aps.org/publications/apsnews/200505/fuel.cfm Building a Better Fuel Cell Using Microfluidics][https://web.archive.org/web/20080305215325/http://www.me.mtu.edu/mnit/ Fuel Cell Initiative at MnIT Microfluidics Laboratory]\n\nFuture directions\n\n* On-chip characterization:\n* Microfluidics in the classroom: On-chip acid-base titrations",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Microfluidics" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18906" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Microfluidics deals with the behaviour, precise control and manipulation of fluids that are geometrically constrained to a small, typically sub-millimeter, scale. It is a multidisciplinary field at the intersection of engineering, physics, chemistry, biochemistry, nanotechnology, and biotechnology, with practical applications in the design of systems in which low volumes of fluids are processed to achieve multiplexing, automation, and high-throughput screening. Microfluidics emerged in the beginning of the 1980s and is used in the development of inkjet printheads, DNA chips, lab-on-a-chip technology, micro-propulsion, and micro-thermal technologies.\n\nTypically, micro means one of the following features:\n* small volumes (μL, nL, pL, fL)\n* small size\n* low energy consumption\n* effects of the microdomain\n\nTypically fluids are moved, mixed, separated or otherwise processed. Numerous applications employ passive fluid control techniques like capillary forces. In some applications, external actuation means are additionally used for a directed transport of the media. Examples are rotary drives applying centrifugal forces for the fluid transport on the passive chips. Active microfluidics refers to the defined manipulation of the working fluid by active (micro) components such as micropumps or microvalves. Micropumps supply fluids in a continuous manner or are used for dosing. Microvalves determine the flow direction or the mode of movement of pumped liquids. Often processes which are normally carried out in a lab are miniaturised on a single chip in order to enhance efficiency and mobility as well as reducing sample and reagent volumes.\n\nMicroscale behaviour of fluids\n\nThe behaviour of fluids at the microscale can differ from \"macrofluidic\" behaviour in that factors such as surface tension, energy dissipation, and fluidic resistance start to dominate the system. Microfluidics studies how these behaviours change, and how they can be worked around, or exploited for new uses.S.C.Terry, J.H.Jerman and J.B.Angell:A Gas Chromatographic Air Analyzer Fabricated on a Silicon Wafer, IEEE Trans.Electron Devices, ED-26,12(1979)1880-1886.\n\nAt small scales (channel size of around 100 nanometers to 500 micrometers) some interesting and sometimes unintuitive properties appear. In particular, the Reynolds number (which compares the effect of the momentum of a fluid to the effect of viscosity) can become very low. A key consequence is co-flowing fluids do not necessarily mix in the traditional sense, as flow becomes laminar rather than turbulent; molecular transport between them must often be through diffusion.\n\nHigh specificity of chemical and physical properties (concentration, pH, temperature, shear force, etc.) can also be ensured resulting in more uniform reaction conditions and higher grade products in single and multi-step reactions.\n\nKey application areas\n\nMicrofluidic structures include micropneumatic systems, i.e. microsystems for the handling of off-chip fluids (liquid pumps, gas valves, etc.), and microfluidic structures for the on-chip handling of nanoliter (nl) and picoliter (pl) volumes.  To date, the most successful commercial application of microfluidics is the inkjet printhead. Additionally, advances in microfluidic manufacturing allow the devices to be produced in low-cost plasticsRyan S. Pawell, David W. Inglis, Tracie J. Barber, and Robert A. Taylor, [https://www.researchgate.net/publication/256487052_Manufacturing_and_wetting_low-cost_microfluidic_cell_separation_devices Manufacturing and wetting low-cost microfluidic cell separation devices], Biomicrofluidics 7, 056501 (2013);  and part quality may be verified automatically.[https://link.springer.com/article/10.1007/s10404-014-1464-1?sa_campaign\nemail/event/articleAuthor/onlineFirst Automating microfluidic part verification - Online First - Springer]\n\nAdvances in microfluidics technology are revolutionizing molecular biology procedures for enzymatic analysis (e.g.,  glucose and lactate assays), DNA analysis (e.g., polymerase chain reaction and high-throughput sequencing), and proteomics. The basic idea of microfluidic biochips is to integrate assay operations such as detection, as well as sample pre-treatment and sample preparation on one chip.\n\nAn emerging application area for biochips is clinical pathology, especially the immediate point-of-care diagnosis of diseases. In addition, microfluidics-based devices, capable of continuous sampling and real-time testing of air/water samples for biochemical toxins and other dangerous pathogens, can serve as an always-on \"bio-smoke alarm\" for early warning.\n\nMicrofluidic technology has led to the creation of powerful tools for biologists to control the complete cellular environment, leading to new questions and discoveries. Many diverse advantages of this technology for microbiology are listed below:\n* General single cell studies including growth \n* Cellular aging: microfluidic devices such as the \"mother machine\" allow tracking of thousands of individual cells for many generations until they die.\n* Microenvironmental control: ranging from mechanical environment  to chemical environment \n* Precise spatiotemporal concentration gradients by incorporating multiple chemical inputs to a single device \n* Force measurements of adherent cells or confined chromosomes: objects trapped in a microfluidic device can be directly manipulated using optical tweezers or other force-generating methods \n* Confining cells and exerting controlled forces by coupling with external force-generation methods such as Stokes flow, optical tweezer, or controlled deformation of the PDMS device Choi, J.W., Rosset, S., Niklaus, M., Adleman, J.R., Shea, H., Psaltis, D. \"3-dimensional electrode patterning within a microfluidic channel using a metal ion implantation\", Lab on a Chip 10, 738-788, 2010. [http://www.sciencedirect.com/science/article/B82X8-4Y34G8D-1/2/ea1d82f514b29565b6802589be564c8c \"Nano today 2010\"]\n* Fast and precise temperature control [http://pubs.rsc.org/en/content/articlelanding/2011/lc/c0lc00222d \"Lab on a Chip 2011\"][http://www.cherrybiotech.com/ \"CherryTemp temperature control system on chip\"]\n* Electric field integration \n* Plant on a chip and plant tissue culture \n* Antibiotic resistance: microfluidic devices can be used as heterogeneous environments for microorganisms. In a heterogeneous environment, it is easier for a microorganism to evolve. This can be useful for testing the acceleration of evolution of a microorganism / for testing the development of antibiotic resistance.\n\nSome of these areas are further elaborated in the sections below.\n\nContinuous-flow microfluidics\n\nThese technologies are based on the manipulation of continuous liquid flow through microfabricated channels. Actuation of liquid flow is implemented either by external pressure sources, external mechanical pumps, integrated mechanical micropumps, or by combinations of capillary forces and electrokinetic mechanisms.[http://www.cytonix.com/fluid%20transistor.html fluid transistor]   Continuous-flow microfluidic operation is the mainstream approach because it is easy to implement and less sensitive to protein fouling problems. Continuous-flow devices are adequate for many well-defined and simple biochemical applications, and for certain tasks such as chemical separation, but they are less suitable for tasks requiring a high degree of flexibility or fluid manipulations. These closed-channel systems are inherently difficult to integrate and scale because the parameters that govern flow field vary along the flow path making the fluid flow at any one location dependent on the properties of the entire system. Permanently etched microstructures also lead to limited reconfigurability and poor fault tolerance capability.\n\nProcess monitoring capabilities in continuous-flow systems can be achieved with highly sensitive microfluidic flow sensors based on MEMS technology which offers resolutions down to the nanoliter range.\n\nDroplet-based microfluidics\n\nDroplet-based microfluidics is a subcategory of microfluidics in contrast with continuous microfluidics; droplet-based microfluidics manipulates discrete volumes of fluids in immiscible phases with low Reynolds number and laminar flow regimes. Interest in droplet-based microfluidics systems has been growing substantially in past decades. Microdroplets allow for handling miniature volumes (μl to fl) of fluids conveniently, provide better mixing, encapsulation, sorting, and sensing, and suit high throughput experiments.Venkat Chokkalingam, Jurjen Tel, Florian Wimmers, Xin Liu, Sergey Semenov, Julian Thiele, Carl G. Figdor, Wilhelm T.S. Huck, Probing cellular heterogeneity in cytokine-secreting immune cells using droplet-based microfluidics, Lab on a Chip, 13, 4740-4744, 2013, DOI: 10.1039/C3LC50945A, http://pubs.rsc.org/en/content/articlelanding/2013/lc/c3lc50945a#!divAbstract Exploiting the benefits of droplet-based microfluidics efficiently requires a deep understanding of droplet generation  to perform various logical operations such as droplet motion, droplet sorting, droplet merging, and droplet breakup.\n\nDigital microfluidics\n\nAlternatives to the above closed-channel continuous-flow systems include novel open structures, where discrete, independently controllable droplets\nare manipulated on a substrate using electrowetting. Following the analogy of digital microelectronics, this approach is referred to as digital microfluidics. Le Pesant et al. pioneered the use of electrocapillary forces to move droplets on a digital track.Le Pesant et al., Electrodes for a device operating by electrically controlled fluid displacement, U.S. Pat. No. 4,569,575, Feb. 11, 1986. The \"fluid transistor\" pioneered by Cytonix[http://www.nsf.gov/awardsearch/piSearch.do;jsessionidD05E82394F781CBA17DB0C5AC8E3C0B8?SearchType\npiSearch&page1&QueryText\n&PIFirstNamejames&PILastName\nbrown&PIInstitutioncytonix&PIState\nMD&PIZip&PICountry\nUS&RestrictExpiredon&Search\nSearch#results NSF Award Search: Advanced Search Results] also played a role. The technology was subsequently commercialised by Duke University. By using discrete unit-volume droplets,  a microfluidic function can be reduced to a set of repeated basic operations, i.e., moving one unit of fluid over one unit of distance. This \"digitisation\" method facilitates the use of a hierarchical and cell-based approach for microfluidic biochip design. Therefore, digital microfluidics offers a flexible and scalable system architecture as well as high fault-tolerance capability. Moreover, because each droplet can be controlled independently, these systems also have dynamic reconfigurability, whereby groups of unit cells in a microfluidic array can be reconfigured to change their functionality during the concurrent execution of a set of bioassays. Although droplets are manipulated in confined microfluidic channels, since the control on droplets is not independent, it should not be confused as \"digital microfluidics\". One common actuation method for digital microfluidics is electrowetting-on-dielectric (EWOD). Many lab-on-a-chip applications have been demonstrated within the digital microfluidics paradigm using electrowetting. However, recently other techniques for droplet manipulation have also been demonstrated using surface acoustic waves, optoelectrowetting, mechanical actuation,J. Shemesh, A. Bransky, M. Khoury, S. Levenberg,\"[http://www.springerlink.com/content/e845tl2176r57117/ Advanced microfluidic droplet manipulation based on piezoelectric actuation]\" Biomedical Microdevices , 2010.    etc.\n\nDNA chips (microarrays)\n\nEarly biochips were based on the idea of a DNA microarray, e.g., the GeneChip DNAarray from Affymetrix, which is a piece of glass, plastic or silicon substrate, on which pieces of DNA (probes) are affixed in a microscopic array. Similar to a DNA microarray, a protein array is a miniature array where a multitude of different capture agents, most frequently monoclonal antibodies, are deposited on a chip surface; they are used to determine the presence and/or amount of proteins in biological samples, e.g., blood. A drawback of DNA and protein arrays is that they are neither reconfigurable nor scalable after manufacture. Digital microfluidics has been described as a means for carrying out Digital PCR.\n\nMolecular biology\n\nIn addition to microarrays, biochips have been designed for two-dimensional electrophoresis, transcriptome analysis, and PCR amplification. Other applications include various electrophoresis and liquid chromatography applications for proteins and DNA, cell separation, in particular, blood cell separation, protein analysis, cell manipulation and analysis including cell viability analysis  and microorganism capturing.\n\nEvolutionary biology\n\nBy combining microfluidics with landscape ecology and nanofluidics, a nano/micro fabricated fluidic landscape can be constructed by building local patches of bacterial habitat and connecting them by dispersal corridors. The resulting landscapes can be used as physical implementations of an adaptive landscape,  by generating a spatial mosaic of patches of opportunity distributed in space and time. The patchy nature of these fluidic landscapes allows for the study of adapting bacterial cells in a metapopulation system. The evolutionary ecology of these bacterial systems in these synthetic ecosystems allows for using biophysics to address questions in evolutionary biology.\n\nCell behavior\n\nThe ability to create precise and carefully controlled chemoattractant gradients makes microfluidics the ideal tool to study motility, chemotaxis and the ability to evolve / develop resistance to antibiotics in small populations of microorganisms and in a short period of time. These microorganisms including bacteria  and the broad range of organisms that form the marine microbial loop, responsible for regulating much of the oceans' biogeochemistry.\n\nMicrofluidics has also greatly aided the study of durotaxis by facilitating the creation of durotactic (stiffness) gradients.\n\nCellular biophysics\n\nBy rectifying the motion of individual swimming bacteria,  microfluidic structures can be used to extract mechanical motion from a population of motile bacterial cells.  This way, bacteria-powered rotors can be built.\n\nOptics\n\nThe merger of microfluidics and optics is typical known as optofluidics. Examples of optofluidic devices are tunable microlens arraysLiquid micro-lens array activated by selective electrowetting on lithium niobate substrates S. Grilli, L. Miccio, V. Vespini, A. Finizio, S. De Nicola, and P. Ferraro Optics Express 16, 8084-8093 (2008).  P. Ferraro, L. Miccio, S. Grilli, A. Finizio, S. De Nicola, and V. Vespini, \"Manipulating Thin Liquid Films for Tunable Microlens Arrays,\" Optics & Photonics News 19, 34-34 (2008) http://www.opticsinfobase.org/abstract.cfm?URI=OPN-19-12-34 and optofluidic microscopes.\n\nMicrofluidic flow enables fast sample throughput, automated imaging of large sample populations, as well as 3D capabilities.Flow-scanning optical tomography N. C. Pégard, M. L. Toth, M. Driscoll, and   J. W. Fleischer Lab Chip, (2014),14, 4447-4450 [http://pubs.rsc.org/en/Content/ArticleLanding/2014/LC/c4lc00701h#!divAbstract]N. C. Pégard and J. W. Fleischer, Journal of Biomedical Optics 18 040503 (2013)[http://www.opticsinfobase.org/abstract.cfm?URI=BIOMED-2012-BM4B.4] or superresolution.C-H. Lu, N. C. Pégard and J. W. Fleischer, 2013, Applied Physics Letters, 102 161115 (2013)[http://link.aip.org/link/?APPLAB/102/161115/1] \n\nAcoustic droplet ejection (ADE)\n\nAcoustic droplet ejection uses a pulse of ultrasound to move low volumes of fluids (typically nanoliters or picoliters) without any physical contact. This technology focuses acoustic energy into a fluid sample in order to eject droplets as small as a millionth of a millionth of a litre (picoliter = 10−12 litre). ADE technology is a very gentle process, and it can be used to transfer proteins, high molecular weight DNA and live cells without damage or loss of viability. This feature makes the technology suitable for a wide variety of applications including proteomics and cell-based assays.\n\nFuel cells\n\nMicrofluidic fuel cells can use laminar flow to separate the fuel and its oxidant to control the interaction of the two fluids without a physical barrier as would be required in conventional fuel cells.[http://microfluidics.stanford.edu/fuel_cells.htm Water Management in PEM Fuel Cells]   [http://www.aps.org/publications/apsnews/200505/fuel.cfm Building a Better Fuel Cell Using Microfluidics][https://web.archive.org/web/20080305215325/http://www.me.mtu.edu/mnit/ Fuel Cell Initiative at MnIT Microfluidics Laboratory]\n\nFuture directions\n\n* On-chip characterization:\n* Microfluidics in the classroom: On-chip acid-base titrations. Microfluidics. http://en.wikipedia.org/?curid=18906."
  }
}
