{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6985",
  "eid" : "df1deed0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778454077,
  "textBody" : "Chlorophyll (also chlorophyl) is any of several related green pigments found in cyanobacteria and the chloroplasts of algae and plants. Its name is derived from the Greek words χλωρός, chloros (\"green\") and φύλλον, phyllon (\"leaf\"). Chlorophyll is essential in photosynthesis, allowing plants to absorb energy from light.\n\nChlorophylls absorb light most strongly in the blue portion of the electromagnetic spectrum as well as the red portion. Conversely, it is a poor absorber of green and near-green portions of the spectrum, which it reflects, producing the green color of chlorophyll-containing tissues. Two types of chlorophyll exist in the photosystems of green plants: chlorophyll a and b.\n\nHistory\n\nChlorophyll was first isolated and named by Joseph Bienaimé Caventou and Pierre Joseph Pelletier in 1817.See:\n* \n*  Pelletier and Caventou (1817) [https://archive.org/stream/journaldepharma22unkngoog#page/n444/mode/2up \"Notice sur la matière verte des feuilles\"] (Notice on the green material in leaves), Journal de Pharmacie, 3 : 486-491. On p. 490, the authors propose a new name for chlorophyll. From p. 490: \"Nous n'avons aucun droit pour nommer une substance connue depuis long-temps, et à l'histoire de laquelle nous n'avons ajouté que quelques faits ; cependant nous proposerons, sans y mettre aucune importance, le nom de chlorophyle, de chloros, couleur, et φυλλον, feuille : ce nom indiquerait le rôle qu'elle joue dans la nature.\"  (We have no right to name a substance [that has been] known for a long time, and to whose story we have added only a few facts ; however, we will propose, without giving it any importance, the name chlorophyll, from chloros, color, and φυλλον, leaf :  this name would indicate the role that it plays in nature.)\nThe presence of magnesium in chlorophyll was discovered in 1906,Willstätter, Richard (1906) [http://babel.hathitrust.org/cgi/pt?iduva.x002455980;view\n1up;seq436 \"Zur Kenntniss der Zusammensetzung des Chlorophylls\"] ([Contribution] to the knowledge of the composition of chlorophyll), Annalen der Chemie, 350 : 48-82. From p. 49: \"Das Hauptproduct der alkalischen Hydrolyse bilden tiefgrüne Alkalisalze. In ihnen liegen complexe Magnesiumverbindungen vor, die das Metall in einer gegen Alkali auch bei hoher Temperatur merkwürdig widerstandsfähigen Bindung enthalten.\" (Deep green alkali salts form the main product of alkali hydrolysis. In them, complex magnesium compounds are present, which contain the metal in a bond that's extraordinarily resistant to alkali even at high temperature.) and was the first time that magnesium had been detected in living tissue.\n\nAfter initial work done by German chemist Richard Willstätter spanning from 1905 to 1915, the general structure of chlorophyll a was elucidated by Hans Fischer in 1940. By 1960, when most of the stereochemistry of chlorophyll a was known, Robert Burns Woodward published a total synthesis of the molecule.\n In 1967, the last remaining stereochemical elucidation was completed by Ian Fleming, and in 1990 Woodward and co-authors published an updated synthesis. Chlorophyll f was announced to be present in cyanobacteria and other oxygenic microorganisms that form stromatolites in 2010;Jabr, Ferris (August 19, 2010) [http://www.scientificamerican.com/article.cfm?id=new-form-chlorophyll A New Form of Chlorophyll?]. Scientific American. Retrieved on 2012-04-15.[https://www.newscientist.com/article/dn19338-infrared-chlorophyll-could-boost-solar-cells.html Infrared chlorophyll could boost solar cells]. New Scientist. August 19, 2010. Retrieved on 2012-04-15. a molecular formula of C55H70O6N4Mg and a structure of (2-formyl)-chlorophyll a were deduced based on NMR, optical and mass spectra.\n\nPhotosynthesis\n\nChlorophyll is vital for photosynthesis, which allows plants to absorb energy from light.\n\nChlorophyll molecules are arranged in and around photosystems that are embedded in the thylakoid membranes of chloroplasts. In these complexes, chlorophyll serves three functions. The function of the vast majority of chlorophyll (up to several hundred molecules per photosystem) is to absorb light.  Having done so, these same centers execute their second function: the transfer of that light energy by resonance energy transfer to a specific chlorophyll pair in the reaction center of the photosystems.  This pair effects the final function of chlorophylls, charge separation, leading to biosynthesis.\nThe two currently accepted photosystem units are photosystem II and photosystem I, which have their own distinct reaction centres, named P680 and P700, respectively. These centres are named after the wavelength (in nanometers) of their red-peak absorption maximum. The identity, function and spectral properties of the types of chlorophyll in each photosystem are distinct and determined by each other and the protein structure surrounding them. Once extracted from the protein into a solvent (such as acetone or methanol),\n\n these chlorophyll pigments can be separated into chlorophyll a and chlorophyll b.\n\nThe function of the reaction center of chlorophyll is to absorb light energy and transfer it to other parts of the photosystem. The absorbed energy of the photon is transferred to an electron in a process called charge separation. The removal of the electron from the chlorophyll is an oxidation reaction. The chlorophyll donates the high energy electron to a series of molecular intermediates called an electron transport chain. The charged reaction center of chlorophyll (P680+) is then reduced back to its ground state by accepting an electron stripped from water. The electron that reduces P680+ ultimately comes from the oxidation of water into O2 and H+ through several intermediates. This reaction is how photosynthetic organisms such as plants produce O2 gas, and is the source for practically all the O2 in Earth's atmosphere. Photosystem I typically works in series with Photosystem II; thus the P700+ of Photosystem I is usually reduced as it accepts the electron, via many intermediates in the thylakoid membrane, by electrons coming, ultimately, from Photosystem II. Electron transfer reactions in the thylakoid membranes are complex, however, and the source of electrons used to reduce P700+ can vary.\n\nThe electron flow produced by the reaction center chlorophyll pigments is used to pump H+ ions across the thylakoid membrane, setting up a chemiosmotic potential used mainly in the production of ATP (stored chemical energy) or to reduce NADP+ to NADPH. NADPH is a universal agent used to reduce CO2 into sugars as well as other biosynthetic reactions.\n\nReaction center chlorophyll–protein complexes are capable of directly absorbing light and performing charge separation events without the assistance of other chlorophyll pigments, but the probability of that happening under a given light intensity is small. Thus, the other chlorophylls in the photosystem and antenna pigment proteins all cooperatively absorb and funnel light energy to the reaction center. Besides chlorophyll a, there are other pigments, called accessory pigments, which occur in these pigment–protein antenna complexes.\n\nChemical structure\n\nChlorophylls are numerous types, but all are defined by the presence of a fifth ring beyond the four pyrrole-like rings.  Most chlorophylls are classified as chlorins, which are reduced relatives to porphyrins (found in hemoglobin).  They share a common biosynthetic pathway as porphyrins, including the precursor uroporphyrinogen III.  Unlike hemes, which feature iron at the center of the tetrapyrrole ring, chlorophylls bind  magnesium. For the structures depicted in this article, some of the ligands attached to the Mg2+ center are omitted for clarity. The chlorin ring can have various side chains, usually including a long phytol chain. The most widely distributed form in terrestrial plants is chlorophyll a.\n\nThe structures of chlorophylls are summarized below:\n\nWhen leaves degreen in the process of plant senescence, chlorophyll is converted to a group of colourless tetrapyrroles known as nonfluorescent chlorophyll catabolites (NCC's) with the general structure:\n\nThese compounds have also been identified in several ripening fruits.\n\nMeasurement of chlorophyll content\n\nMeasurement of the absorption of light is complicated by the solvent used to extract the chlorophyll from plant material, which affects the values obtained,\n*In diethyl ether, chlorophyll a has approximate absorbance maxima of 430 nm and 662 nm, while chlorophyll b has approximate maxima of 453 nm and 642 nm.Gross, Jeana (1991). Pigments in vegetables: chlorophylls and carotenoids. Van Nostrand Reinhold, .\n*The absorption peaks of chlorophyll a are at 465 nm and 665 nm. Chlorophyll a fluoresces at 673 nm (maximum) and 726 nm. The peak molar absorption coefficient of chlorophyll a exceeds 105 M−1 cm−1, which is among the highest for small-molecule organic compounds.\n*In 90% acetone-water, the peak absorption wavelengths of chlorophyll a are 430 nm and 664 nm; peaks for chlorophyll b are 460 nm and 647 nm; peaks for chlorophyll c1 are 442 nm and 630 nm; peaks for chlorophyll c2 are 444 nm and 630 nm; peaks for chlorophyll d are 401 nm, 455 nm and 696 nm.\n\nBy measuring the absorption of light in the red and far red regions, it is possible to estimate the concentration of chlorophyll within a leaf.\n\nRatio fluorescence emission can be used to measure chlorophyll content. By exciting chlorophyll “a” fluorescence at a lower wavelength, the ratio of chlorophyll fluorescence emission at 705 nm +/- 10 nm and 735 nm +/-10 nm can provide a linear relationship of chlorophyll content when compared to chemical testing. The ratio F735/F700 provided a correlation value of r2 0.96 compared to chemical testing in the range from 41 mg m−2 up to 675 mg m−2. Gitelson also developed a formula for direct readout of chlorophyll content in mg m−2. The formula provided a reliable method of measuring chlorophyll content from 41 mg m−2 up to 675 mg m−2 with a correlation r2 value of 0.95.Gitelson A. A., Buschmann C., Lichtenthaler H. K. (1999) “The Chlorophyll Fluorescence Ratio F735/F700 as an Accurate Measure of Chlorophyll Content in Plants” Remote Sens. Enviro. 69:296-302 (1999)\n\nBiosynthesis\n\nIn plants, chlorophyll may be synthesized from succinyl-CoA and glycine, although the immediate precursor to chlorophyll a and b is protochlorophyllide. In Angiosperm plants, the last step, the conversion of protochlorophyllide to chlorophyll, is light-dependent and such plants are pale (etiolated) if grown in darkness. Non-vascular plants and green algae have an additional light-independent enzyme and grow green even in darkness.\n\nChlorophyll itself is bound to proteins and can transfer the absorbed energy in the required direction. Protochlorophyllide occurs mostly in the free form and, under light conditions, acts as a photosensitizer, forming highly toxic free radicals. Hence, plants need an efficient mechanism of regulating the amount of chlorophyll precursor. In angiosperms, this is done at the step of aminolevulinic acid (ALA), one of the intermediate compounds in the biosynthesis pathway. Plants that are fed by ALA accumulate high and toxic levels of protochlorophyllide; so do the mutants with the damaged regulatory system.\n\nChlorosis is a condition in which leaves produce insufficient chlorophyll, turning them yellow. Chlorosis can be caused by a nutrient deficiency of iron — called iron chlorosis — or by a shortage of magnesium or nitrogen. Soil pH sometimes plays a role in nutrient-caused chlorosis; many plants are adapted to grow in soils with specific pH levels and their ability to absorb nutrients from the soil can be dependent on this.\n Chlorosis can also be caused by pathogens including viruses, bacteria and fungal infections, or sap-sucking insects.\n\nComplementary light absorbance of anthocyanins with chlorophylls \n\nAnthocyanins are other plant pigments. The absorbance pattern responsible for the red color of anthocyanins may be complementary to that of green chlorophyll in photosynthetically active tissues such as young Quercus coccifera leaves. It may protect the leaves from attacks by plant eaters that may be attracted by green color.\n\nDistribution\n\nThe chlorophyll maps show milligrams of chlorophyll per cubic meter of seawater each month. Places where chlorophyll amounts were very low, indicating very low numbers of phytoplankton, are blue. Places where chlorophyll concentrations were high, meaning many phytoplankton were growing, are yellow. The observations come from the Moderate Resolution Imaging Spectroradiometer (MODIS) on NASA's Aqua satellite. Land is dark gray, and places where MODIS could not collect data because of sea ice, polar darkness, or clouds are light gray.The highest chlorophyll concentrations, where tiny surface-dwelling ocean plants are thriving, are in cold polar waters or in places where ocean currents bring cold water to the surface, such as around the equator and along the shores of continents. It is not the cold water itself that stimulates the phytoplankton. Instead, the cool temperatures are often a sign that the water has welled up to the surface from deeper in the ocean, carrying nutrients that have built up over time. In polar waters, nutrients accumulate in surface waters during the dark winter months when plants cannot grow. When sunlight returns in the spring and summer, the plants flourish in high concentrations.[http://earthobservatory.nasa.gov/GlobalMaps/view.php?d1=MY1DMM_CHLORA Chlorophyll : Global Maps]. Earthobservatory.nasa.gov. Retrieved on 2014-02-02.\n\nCulinary use \n\nChlorophyll is registered as a food additive (colorant), and its E number is E140. Chefs use chlorophyll to color a variety of foods and beverages green, such as pasta and absinthe.\n Chlorophyll is not soluble in water, and it is first mixed with a small quantity of vegetable oil to obtain the desired solution.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Chlorophyll" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6985" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Chlorophyll (also chlorophyl) is any of several related green pigments found in cyanobacteria and the chloroplasts of algae and plants. Its name is derived from the Greek words χλωρός, chloros (\"green\") and φύλλον, phyllon (\"leaf\"). Chlorophyll is essential in photosynthesis, allowing plants to absorb energy from light.\n\nChlorophylls absorb light most strongly in the blue portion of the electromagnetic spectrum as well as the red portion. Conversely, it is a poor absorber of green and near-green portions of the spectrum, which it reflects, producing the green color of chlorophyll-containing tissues. Two types of chlorophyll exist in the photosystems of green plants: chlorophyll a and b.\n\nHistory\n\nChlorophyll was first isolated and named by Joseph Bienaimé Caventou and Pierre Joseph Pelletier in 1817.See:\n* \n*  Pelletier and Caventou (1817) [https://archive.org/stream/journaldepharma22unkngoog#page/n444/mode/2up \"Notice sur la matière verte des feuilles\"] (Notice on the green material in leaves), Journal de Pharmacie, 3 : 486-491. On p. 490, the authors propose a new name for chlorophyll. From p. 490: \"Nous n'avons aucun droit pour nommer une substance connue depuis long-temps, et à l'histoire de laquelle nous n'avons ajouté que quelques faits ; cependant nous proposerons, sans y mettre aucune importance, le nom de chlorophyle, de chloros, couleur, et φυλλον, feuille : ce nom indiquerait le rôle qu'elle joue dans la nature.\"  (We have no right to name a substance [that has been] known for a long time, and to whose story we have added only a few facts ; however, we will propose, without giving it any importance, the name chlorophyll, from chloros, color, and φυλλον, leaf :  this name would indicate the role that it plays in nature.)\nThe presence of magnesium in chlorophyll was discovered in 1906,Willstätter, Richard (1906) [http://babel.hathitrust.org/cgi/pt?iduva.x002455980;view\n1up;seq436 \"Zur Kenntniss der Zusammensetzung des Chlorophylls\"] ([Contribution] to the knowledge of the composition of chlorophyll), Annalen der Chemie, 350 : 48-82. From p. 49: \"Das Hauptproduct der alkalischen Hydrolyse bilden tiefgrüne Alkalisalze. In ihnen liegen complexe Magnesiumverbindungen vor, die das Metall in einer gegen Alkali auch bei hoher Temperatur merkwürdig widerstandsfähigen Bindung enthalten.\" (Deep green alkali salts form the main product of alkali hydrolysis. In them, complex magnesium compounds are present, which contain the metal in a bond that's extraordinarily resistant to alkali even at high temperature.) and was the first time that magnesium had been detected in living tissue.\n\nAfter initial work done by German chemist Richard Willstätter spanning from 1905 to 1915, the general structure of chlorophyll a was elucidated by Hans Fischer in 1940. By 1960, when most of the stereochemistry of chlorophyll a was known, Robert Burns Woodward published a total synthesis of the molecule.\n In 1967, the last remaining stereochemical elucidation was completed by Ian Fleming, and in 1990 Woodward and co-authors published an updated synthesis. Chlorophyll f was announced to be present in cyanobacteria and other oxygenic microorganisms that form stromatolites in 2010;Jabr, Ferris (August 19, 2010) [http://www.scientificamerican.com/article.cfm?id=new-form-chlorophyll A New Form of Chlorophyll?]. Scientific American. Retrieved on 2012-04-15.[https://www.newscientist.com/article/dn19338-infrared-chlorophyll-could-boost-solar-cells.html Infrared chlorophyll could boost solar cells]. New Scientist. August 19, 2010. Retrieved on 2012-04-15. a molecular formula of C55H70O6N4Mg and a structure of (2-formyl)-chlorophyll a were deduced based on NMR, optical and mass spectra.\n\nPhotosynthesis\n\nChlorophyll is vital for photosynthesis, which allows plants to absorb energy from light.\n\nChlorophyll molecules are arranged in and around photosystems that are embedded in the thylakoid membranes of chloroplasts. In these complexes, chlorophyll serves three functions. The function of the vast majority of chlorophyll (up to several hundred molecules per photosystem) is to absorb light.  Having done so, these same centers execute their second function: the transfer of that light energy by resonance energy transfer to a specific chlorophyll pair in the reaction center of the photosystems.  This pair effects the final function of chlorophylls, charge separation, leading to biosynthesis.\nThe two currently accepted photosystem units are photosystem II and photosystem I, which have their own distinct reaction centres, named P680 and P700, respectively. These centres are named after the wavelength (in nanometers) of their red-peak absorption maximum. The identity, function and spectral properties of the types of chlorophyll in each photosystem are distinct and determined by each other and the protein structure surrounding them. Once extracted from the protein into a solvent (such as acetone or methanol),\n\n these chlorophyll pigments can be separated into chlorophyll a and chlorophyll b.\n\nThe function of the reaction center of chlorophyll is to absorb light energy and transfer it to other parts of the photosystem. The absorbed energy of the photon is transferred to an electron in a process called charge separation. The removal of the electron from the chlorophyll is an oxidation reaction. The chlorophyll donates the high energy electron to a series of molecular intermediates called an electron transport chain. The charged reaction center of chlorophyll (P680+) is then reduced back to its ground state by accepting an electron stripped from water. The electron that reduces P680+ ultimately comes from the oxidation of water into O2 and H+ through several intermediates. This reaction is how photosynthetic organisms such as plants produce O2 gas, and is the source for practically all the O2 in Earth's atmosphere. Photosystem I typically works in series with Photosystem II; thus the P700+ of Photosystem I is usually reduced as it accepts the electron, via many intermediates in the thylakoid membrane, by electrons coming, ultimately, from Photosystem II. Electron transfer reactions in the thylakoid membranes are complex, however, and the source of electrons used to reduce P700+ can vary.\n\nThe electron flow produced by the reaction center chlorophyll pigments is used to pump H+ ions across the thylakoid membrane, setting up a chemiosmotic potential used mainly in the production of ATP (stored chemical energy) or to reduce NADP+ to NADPH. NADPH is a universal agent used to reduce CO2 into sugars as well as other biosynthetic reactions.\n\nReaction center chlorophyll–protein complexes are capable of directly absorbing light and performing charge separation events without the assistance of other chlorophyll pigments, but the probability of that happening under a given light intensity is small. Thus, the other chlorophylls in the photosystem and antenna pigment proteins all cooperatively absorb and funnel light energy to the reaction center. Besides chlorophyll a, there are other pigments, called accessory pigments, which occur in these pigment–protein antenna complexes.\n\nChemical structure\n\nChlorophylls are numerous types, but all are defined by the presence of a fifth ring beyond the four pyrrole-like rings.  Most chlorophylls are classified as chlorins, which are reduced relatives to porphyrins (found in hemoglobin).  They share a common biosynthetic pathway as porphyrins, including the precursor uroporphyrinogen III.  Unlike hemes, which feature iron at the center of the tetrapyrrole ring, chlorophylls bind  magnesium. For the structures depicted in this article, some of the ligands attached to the Mg2+ center are omitted for clarity. The chlorin ring can have various side chains, usually including a long phytol chain. The most widely distributed form in terrestrial plants is chlorophyll a.\n\nThe structures of chlorophylls are summarized below:\n\nWhen leaves degreen in the process of plant senescence, chlorophyll is converted to a group of colourless tetrapyrroles known as nonfluorescent chlorophyll catabolites (NCC's) with the general structure:\n\nThese compounds have also been identified in several ripening fruits.\n\nMeasurement of chlorophyll content\n\nMeasurement of the absorption of light is complicated by the solvent used to extract the chlorophyll from plant material, which affects the values obtained,\n*In diethyl ether, chlorophyll a has approximate absorbance maxima of 430 nm and 662 nm, while chlorophyll b has approximate maxima of 453 nm and 642 nm.Gross, Jeana (1991). Pigments in vegetables: chlorophylls and carotenoids. Van Nostrand Reinhold, .\n*The absorption peaks of chlorophyll a are at 465 nm and 665 nm. Chlorophyll a fluoresces at 673 nm (maximum) and 726 nm. The peak molar absorption coefficient of chlorophyll a exceeds 105 M−1 cm−1, which is among the highest for small-molecule organic compounds.\n*In 90% acetone-water, the peak absorption wavelengths of chlorophyll a are 430 nm and 664 nm; peaks for chlorophyll b are 460 nm and 647 nm; peaks for chlorophyll c1 are 442 nm and 630 nm; peaks for chlorophyll c2 are 444 nm and 630 nm; peaks for chlorophyll d are 401 nm, 455 nm and 696 nm.\n\nBy measuring the absorption of light in the red and far red regions, it is possible to estimate the concentration of chlorophyll within a leaf.\n\nRatio fluorescence emission can be used to measure chlorophyll content. By exciting chlorophyll “a” fluorescence at a lower wavelength, the ratio of chlorophyll fluorescence emission at 705 nm +/- 10 nm and 735 nm +/-10 nm can provide a linear relationship of chlorophyll content when compared to chemical testing. The ratio F735/F700 provided a correlation value of r2 0.96 compared to chemical testing in the range from 41 mg m−2 up to 675 mg m−2. Gitelson also developed a formula for direct readout of chlorophyll content in mg m−2. The formula provided a reliable method of measuring chlorophyll content from 41 mg m−2 up to 675 mg m−2 with a correlation r2 value of 0.95.Gitelson A. A., Buschmann C., Lichtenthaler H. K. (1999) “The Chlorophyll Fluorescence Ratio F735/F700 as an Accurate Measure of Chlorophyll Content in Plants” Remote Sens. Enviro. 69:296-302 (1999)\n\nBiosynthesis\n\nIn plants, chlorophyll may be synthesized from succinyl-CoA and glycine, although the immediate precursor to chlorophyll a and b is protochlorophyllide. In Angiosperm plants, the last step, the conversion of protochlorophyllide to chlorophyll, is light-dependent and such plants are pale (etiolated) if grown in darkness. Non-vascular plants and green algae have an additional light-independent enzyme and grow green even in darkness.\n\nChlorophyll itself is bound to proteins and can transfer the absorbed energy in the required direction. Protochlorophyllide occurs mostly in the free form and, under light conditions, acts as a photosensitizer, forming highly toxic free radicals. Hence, plants need an efficient mechanism of regulating the amount of chlorophyll precursor. In angiosperms, this is done at the step of aminolevulinic acid (ALA), one of the intermediate compounds in the biosynthesis pathway. Plants that are fed by ALA accumulate high and toxic levels of protochlorophyllide; so do the mutants with the damaged regulatory system.\n\nChlorosis is a condition in which leaves produce insufficient chlorophyll, turning them yellow. Chlorosis can be caused by a nutrient deficiency of iron — called iron chlorosis — or by a shortage of magnesium or nitrogen. Soil pH sometimes plays a role in nutrient-caused chlorosis; many plants are adapted to grow in soils with specific pH levels and their ability to absorb nutrients from the soil can be dependent on this.\n Chlorosis can also be caused by pathogens including viruses, bacteria and fungal infections, or sap-sucking insects.\n\nComplementary light absorbance of anthocyanins with chlorophylls \n\nAnthocyanins are other plant pigments. The absorbance pattern responsible for the red color of anthocyanins may be complementary to that of green chlorophyll in photosynthetically active tissues such as young Quercus coccifera leaves. It may protect the leaves from attacks by plant eaters that may be attracted by green color.\n\nDistribution\n\nThe chlorophyll maps show milligrams of chlorophyll per cubic meter of seawater each month. Places where chlorophyll amounts were very low, indicating very low numbers of phytoplankton, are blue. Places where chlorophyll concentrations were high, meaning many phytoplankton were growing, are yellow. The observations come from the Moderate Resolution Imaging Spectroradiometer (MODIS) on NASA's Aqua satellite. Land is dark gray, and places where MODIS could not collect data because of sea ice, polar darkness, or clouds are light gray.The highest chlorophyll concentrations, where tiny surface-dwelling ocean plants are thriving, are in cold polar waters or in places where ocean currents bring cold water to the surface, such as around the equator and along the shores of continents. It is not the cold water itself that stimulates the phytoplankton. Instead, the cool temperatures are often a sign that the water has welled up to the surface from deeper in the ocean, carrying nutrients that have built up over time. In polar waters, nutrients accumulate in surface waters during the dark winter months when plants cannot grow. When sunlight returns in the spring and summer, the plants flourish in high concentrations.[http://earthobservatory.nasa.gov/GlobalMaps/view.php?d1=MY1DMM_CHLORA Chlorophyll : Global Maps]. Earthobservatory.nasa.gov. Retrieved on 2014-02-02.\n\nCulinary use \n\nChlorophyll is registered as a food additive (colorant), and its E number is E140. Chefs use chlorophyll to color a variety of foods and beverages green, such as pasta and absinthe.\n Chlorophyll is not soluble in water, and it is first mixed with a small quantity of vegetable oil to obtain the desired solution. Chlorophyll. http://en.wikipedia.org/?curid=6985."
  }
}
