{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7461",
  "eid" : "e1ae0f90-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778458377,
  "textBody" : "A clipper was a very fast sailing ship of the middle third of the 19th century, generally either a schooner or a brigantine. The original Baltimore clippers were schooners. They had multiple types of sail plans but the most common was three masts and a square rig. They were generally narrow for their length, small by later 19th century standards, could carry limited bulk freight, and had a large total sail area. Clipper ships were mostly constructed in British and American shipyards, though France, Brazil, the Netherlands and other nations also produced some. Clippers sailed all over the world, primarily on the trade routes between the United Kingdom and its colonies in the east, in trans-Atlantic trade, and on the New York-to-San Francisco route round Cape Horn during the California Gold Rush. Dutch clippers were built beginning in the 1850s for the tea trade and passenger service to Java.\n\nThe boom years of the clipper ship era began in 1843 as a result of a growing demand for a more rapid delivery of tea from China. It continued under the stimulating influence of the discovery of gold in California and Australia in 1848 and 1851, and ended with the opening of the Suez Canal in 1869.\n\nOrigin and usage of \"clipper\"\n\nThe term \"clipper\" most likely derives from the verb \"clip\", which in former times meant, among other things, to run or fly swiftly. Dryden, the English poet, used the word \"clip\" to describe the swift flight of a falcon in the 17th century when he said \"And, with her eagerness the quarry missed, Straight flies at check, and clips it down the wind.\" The ships appeared to clip along the ocean water. The term \"clip\" became synonymous with \"speed\" and was also applied to fast horses and sailing ships. \"To clip it,\" and \"going at a good clip,\" are familiar expressions to this day.\n\nWhile the first application of the term \"clipper\" in a nautical sense is by no means certain, it seems to have had an American origin when applied to the Baltimore clippers of the late 18th century. When these vessels of a new model were built, which were intended to \"clip\" over the waves rather than plough through them, the improved type of craft became known as \"clippers\" because of their speed.\n\nIn England the nautical term \"clipper\" appeared a little later. The Oxford English Dictionary says its earliest quotation for \"clipper\" is from 1830. This does not mean, however, that little British opium clippers from prior to 1830 were not called \"opium clippers\" just as they are today. Carl C. Cutler reports the first newspaper appearance was in 1835, and by then the term was apparently familiar. An undated painting of the British Water Witch built in 1831 is labeled OPIUM CLIPPER \"WATER WITCH\" so the term had at least passed into common usage during the time that this ship sailed.\n\nThere is no single definition of the characteristics of a clipper ship, but mariner and author Alan Villiers describes them as follows:To sailors, three things made a ship a clipper.  She must be sharp-lined, built for speed.  She must be tall-sparred and carry the utmost spread of canvas.  And she must use that sail, day and night, fair weather and foul.Villiers (1962), p. 216  Optimized for speed, they were too fine-lined to carry much cargo.  Clippers typically carried extra sails such as skysails and moonrakers on the masts, and studdingsails on booms extending out from the hull or yards,Villiers (1962), frontispiece and p.220 which required extra sailors to handle them.Villiers (1962), p. 216, 220  In conditions where other ships would shorten sail, clippers drove on, heeling so much that their lee rails were in the water.Villiers (1962), pp. 217, 218\n\nA clipper is often confused with a windjammer, but they are two completely different types of ship. Clippers were optimized for speed only and carrying highly priced cargo in small quantities, such as tea, spices or opium; a windjammer is a large sailing ship which, although it carries a large sail area, is optimized, by contrast, for cargo capacity, ease of handling and carrying low priced bulk cargo, such as grain, fertilizers or lumber. Whereas clippers had very short lifespans—most were scrapped after only two decades of service—windjammers could have fifty or more years of service life, and several windjammers are still today in use as school ships.\n\nHistory\n\nThe first ships to which the term \"clipper\" seems to have been applied were the Baltimore clippers. Baltimore clippers were topsail schooners developed in the Chesapeake Bay before the American Revolution, and which reached their zenith between 1795 and 1815.  They were small, rarely exceeding 200 tons OM, and modelled after French luggers.The Clipper Ship Era, Clarke, Arthur H., 1912 Some were lightly armed in the War of 1812, sailing under Letters of Marque and Reprisal, when the type—exemplified by Chasseur, launched at Fells Point, Baltimore in 1814—became known for her incredible speed; the deep draft enabled the Baltimore clipper to sail close to the wind.Villiers 1973. Clippers, running the British blockade of Baltimore, came to be recognized for speed rather than cargo space.\n\nSpeed was also required for the Chinese opium trade between England, India and China. Small, sharp-bowed British vessels were the result. An early example, which is today known as an opium clipper, was Transit of 1819. She was followed by many more.\n\nMeanwhile, Baltimore Clippers still continued to be built, and were built specifically for the China opium trade running opium between India and China, a trade that only became unprofitable for American shipowners in 1849.\n\nAnn McKim is generally known as the original clipper ship. She was built in Baltimore in 1833 and was the first attempt at building a larger swift vessel in the United States. Ann McKim 494 tons OM, was built on the enlarged lines of a Baltimore clipper, with sharply raked stem, counter stern and square rig. She was built in Baltimore in 1833 by the Kennard & Williamson shipyard.Dear, I.C.B., & Kemp, Peter, eds. Oxford Companion to Ships and the Sea (Oxford University Press, 2005).Website [http://www.bruzelius.info/Nautica/Ships/Clippers/Ann_McKim(1833).html \"Ann McKim\" -details, at bruzelius.info] Accessed 30 March 2009. Although Ann McKim was the first large clipper ship ever constructed, it cannot be said that she founded the clipper ship era, or even that she directly influenced shipbuilders, since no other ship was built like her; but she may have suggested the clipper design in vessels of ship rig. She did, however, influence the building of Rainbow in 1845, the first extreme clipper ship.\n\nIn Aberdeen, Scotland, the shipbuilders Alexander Hall and Sons developed the \"Aberdeen\" clipper bow in the late 1830s: the first was Scottish Maid launched in 1839. Scottish Maid, 150 tons OM, was the first British clipper ship. \"Scottish Maid was intended for the Aberdeen-London trade, where speed was crucial to compete with steamships. The Hall brothers tested various hulls in a water tank and found the clipper design most effective. The design was influenced by tonnage regulations. Tonnage measured a ship's cargo capacity and was used to calculate tax and harbour dues. The new 1836 regulations measured depth and breadth with length measured at half midship depth. Extra length above this level was tax-free and became a feature of clippers. Scottish Maid proved swift and reliable and the design was widely copied.\" The earliest British clipper ships were built for trade amongst the British Isles. Then followed the vast clipper trade of tea, opium, spices and other goods from the Far East to Europe, and the ships became known as \"tea clippers\".\n\nFrom 1839, larger American clipper ships started to be built beginning with Akbar, 650 tons OM, in 1839, and including the 1844-built Houqua, 581 tons OM. These larger vessels were built predominantly for use in the China tea trade and known as \"tea clippers\". Smaller clipper vessels also continued to be built predominantly for the China opium trade and known as \"opium clippers\" such as the 1842-built Ariel, 100 tons OM.\n\nThen in 1845 Rainbow, 757 tons OM, the first extreme clipper was launched in New York. These American clippers were larger vessels designed to sacrifice cargo capacity for speed. They had a bow lengthened above the water, a drawing out and sharpening of the forward body, and the greatest breadth further aft. Extreme clippers were built in the period 1845 to 1855. \n\nFrom 1851 or earlier another type of clipper ship was also being built in American shipyards, the medium clipper. \nIn the mid-1800s, shipbuilders in Medford, Massachusetts began building the medium clipper ship. They “quietly evolved a new type (of ship) of about 450 tons burden which, handled by eighteen officers and men, would carry half as much freight as a British-Indianman of 1500 tons with a crew of 125, and sail half again as fast.” Most owners wanted ships that could do all kinds of work and the “finest type” then being built was the Medford or Merrimac East Indianman. An example would be the Columbiana built in Medford in 1837, or Jotham Stetson’s ship the Rajah, 531 tons, 140 feet long which was constructed in the previous year. As Admiral Morison points out, ships built in Medford by the firms of J.O. Curtis, Hayden & Cudworth, S. Lapham “have more fast California passages to their credit, considering the number they built, than those of any other place.” That is quite a record.[http://www.medfordhistorical.org/medford-history/about-medford/medford-built-sailing-ships/ Medford Historical Society & Museum:Medford-Built Sailing Ships, at medfordhistorical.org] Accessed 19 October 2017\n\nIn 1851, shipbuilders in Medford, Massachusetts built the Antelope.  Often called the Antelope of Boston to distinguish it from other ships of the same name, this vessel is sometimes called one of the first medium clipper ships.  A ship-design journalist noted that \"the design of her model was to combine large stowage capacity with good sailing qualities.\"Boston Daily Atlas, November 29, 1851  The Antelope was relatively flat-floored and had only an 8-inch dead rise at half floor.\n\nThe medium clipper, though still very fast, had comparatively more allowance for cargo. After 1854 extreme clippers were replaced in American shipbuilding yards by medium clippers.\n\nThe Flying Cloud was a clipper ship that set the world's sailing record for the fastest passage between New York and San Francisco, 89 days 8 hours. She held this record for over 100 years, from 1854 to 1989.[1]  Flying Cloud was the most famous of the clippers built by Donald McKay. She was known for her extremely close race with the Hornet in 1853; for having a woman navigator, Eleanor Creesy, wife of Josiah Perkins Creesy, who skippered the Flying Cloud on two record-setting voyages from New York to San Francisco; and for sailing in the Australia and timber trades.\n\nClipper ships largely ceased being built in American shipyards in 1859 when, unlike the earlier boom years, only 4 clipper ships were built. That is except for a small number built in the 1860s.  The last American clipper ship was \"the Pilgrim\" launched in 1873 from the shipyards of Medford, Massachusetts, built by Joshua T. Foster.  Among ship owners of the day, “Medford-built” came to mean the best.\n\nDuring the time from 1859 British clipper ships continued to be built. Earlier British clipper ships had become known as extreme clippers, and were considered to be \"as sharp as the American\" built ships. From 1859 a new design was developed for British clipper ships that was nothing like the American clippers. These ships built from 1859 continued to be called extreme clippers. The new design had a sleek graceful appearance, less sheer, less freeboard, lower bulwarks, and smaller breadth. They were built for the China tea trade and began with Falcon in 1859,  and finished with the last ships built in 1870. It is estimated that 25 to 30 of these ships were built, and no more than 4–5 per year. The earlier ships were made from wood, though some were made from iron, just as some British clippers had been made from iron prior to 1859. In 1863 the first tea clippers of composite construction were brought out, combining the best of both worlds. Composite clippers had the strength of iron spars with wooden hulls, and copper sheathing could be added to prevent the fouling that occurred on iron hulls.\n\nAfter 1869 with the opening of the Suez Canal that greatly advantaged steam vessels (see below, \"Decline\"), the tea trade then collapsed for clippers. From the late 1860s-early 1870s the clipper trade increasingly focused on trade and the carrying of immigrants between England and Australia and New Zealand, a trade that had begun earlier with the Australian Gold Rush in the 1850s. British-built clipper ships were used for this trade, as were many American-built ships which were sold to British owners. Even in the 1880s, sailing ships were still the main carriers of cargoes to and from Australia and New Zealand. Eventually, however, even this trade became unprofitable, and the aging clipper fleet became unseaworthy.\n\nChina clippers and the apogee of sail \n\nAmong the most notable clippers were the China clippers, also called Tea clippers or Opium clippers, designed to ply the trade routes between Europe and the East Indies. The last example of these still in reasonable condition was Cutty Sark, preserved in dry dock at Greenwich, United Kingdom. Damaged by fire on 21 May 2007 while undergoing conservation, the ship was permanently elevated three meters above the dry dock floor in 2010 as part of a plan for long-term preservation.\n\nBefore the early 18th century, the East India Company paid for its tea mainly in silver. However, when the Chinese Emperor chose to embargo European manufactured commodities and demand payment for all Chinese goods in silver, the price rose, restricting free trade. The East India Company began to manufacture a product that was desired by the Chinese as much as tea was by the British: opium. This had a significant influence on both India and China. Opium was also imported into Britain and was not prohibited because it was thought to be medically beneficial. Laudanum, which was made from opium was also used as a pain killer, to induce sleep and to suppress anxiety. The famous literary opium addicts Thomas De Quincey, Samuel Taylor Coleridge and Wilkie Collins also took it for its pleasurable effects. The Limehouse area in London was notorious for its opium dens, many of which catered for Chinese sailors as well as English addicts.\n\nClippers were built for seasonal trades such as tea, where an early cargo was more valuable, or for passenger routes. One passenger ship survives, the City of Adelaide designed by William Pile of Sunderland. The fast ships were ideally suited to low-volume, high-profit goods, such as tea, opium, spices, people, and mail. The return could be spectacular. The Challenger returned from Shanghai with \"the most valuable cargo of tea and silk ever to be laden in one bottom\". Competition among the clippers was public and fierce, with their times recorded in the newspapers. The ships had short-expected lifetimes and rarely outlasted two decades of use before they were broken up for salvage. Given their speed and maneuverability, clippers frequently mounted cannon or carronades and were used for piracy, privateering, smuggling, or interdiction service.\n\nThe last China clippers were acknowledged as the fastest sail vessels. When fully rigged and riding a tradewind, they had peak average speeds over 16 kn. The Great Tea Race of 1866 showcased their speed.  China clippers are also the fastest commercial sailing vessels ever made. Their speeds have been exceeded many times by modern yachts, but never by a commercial sail vessel. Only the fastest windjammers could attain similar speeds.\n\nThe 24h record of the Champion of the Seas wasn't broken until 1984 (by a multihull), or 2001 (by another monohull).\n\nDecline\n\nDecline in the use of clippers started with the economic slump following the Panic of 1857 and continued with the gradual introduction of the steamship. Although clippers could be much faster than early steamships, they depended on the vagaries of the wind, while steamers could keep to a schedule. The steam clipper was developed around this time, and had auxiliary steam engines which could be used in the absence of wind. An example was Royal Charter, built in 1857 and wrecked on the coast of Anglesey in 1859. The final blow was the Suez Canal, opened in 1869, which provided a great shortcut for steamships between Europe and Asia, but was difficult for sailing ships to use. With the absence of the tea trade, some clippers began operating in the wool trade, between Britain and Australia.\n\nSurviving ships \n\nAlthough many clipper ships were built in the mid-19th century, Cutty Sark was, perhaps until recently, the only intact survivor. Other surviving examples of clippers of the era are less well preserved, for example the oldest surviving clipper City of Adelaide' (a.k.a. S.V. Carrick).\n\nFalls of Clyde is a well-preserved example of a more conservatively designed, slower contemporary of the clippers, which was built for general freight in 1878.\n\nClipper ship sailing cards\n\nDepartures of clipper ships, mostly from New York and Boston to San Francisco, were advertised by clipper ship sailing cards.  These cards, slightly larger than today’s postcards, were produced by letterpress and wood engraving on coated card stock.  Most clipper cards were printed in the 1850s and 1860s, and represented the first pronounced use of color in American advertising art.\n\nRelatively few (perhaps 3,500) cards survive today.  With their stunning appearance, rarity, and importance as artifacts of nautical, Western, and printing history, clipper cards are highly prized by both private collectors and institutions.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Clipper" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7461" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A clipper was a very fast sailing ship of the middle third of the 19th century, generally either a schooner or a brigantine. The original Baltimore clippers were schooners. They had multiple types of sail plans but the most common was three masts and a square rig. They were generally narrow for their length, small by later 19th century standards, could carry limited bulk freight, and had a large total sail area. Clipper ships were mostly constructed in British and American shipyards, though France, Brazil, the Netherlands and other nations also produced some. Clippers sailed all over the world, primarily on the trade routes between the United Kingdom and its colonies in the east, in trans-Atlantic trade, and on the New York-to-San Francisco route round Cape Horn during the California Gold Rush. Dutch clippers were built beginning in the 1850s for the tea trade and passenger service to Java.\n\nThe boom years of the clipper ship era began in 1843 as a result of a growing demand for a more rapid delivery of tea from China. It continued under the stimulating influence of the discovery of gold in California and Australia in 1848 and 1851, and ended with the opening of the Suez Canal in 1869.\n\nOrigin and usage of \"clipper\"\n\nThe term \"clipper\" most likely derives from the verb \"clip\", which in former times meant, among other things, to run or fly swiftly. Dryden, the English poet, used the word \"clip\" to describe the swift flight of a falcon in the 17th century when he said \"And, with her eagerness the quarry missed, Straight flies at check, and clips it down the wind.\" The ships appeared to clip along the ocean water. The term \"clip\" became synonymous with \"speed\" and was also applied to fast horses and sailing ships. \"To clip it,\" and \"going at a good clip,\" are familiar expressions to this day.\n\nWhile the first application of the term \"clipper\" in a nautical sense is by no means certain, it seems to have had an American origin when applied to the Baltimore clippers of the late 18th century. When these vessels of a new model were built, which were intended to \"clip\" over the waves rather than plough through them, the improved type of craft became known as \"clippers\" because of their speed.\n\nIn England the nautical term \"clipper\" appeared a little later. The Oxford English Dictionary says its earliest quotation for \"clipper\" is from 1830. This does not mean, however, that little British opium clippers from prior to 1830 were not called \"opium clippers\" just as they are today. Carl C. Cutler reports the first newspaper appearance was in 1835, and by then the term was apparently familiar. An undated painting of the British Water Witch built in 1831 is labeled OPIUM CLIPPER \"WATER WITCH\" so the term had at least passed into common usage during the time that this ship sailed.\n\nThere is no single definition of the characteristics of a clipper ship, but mariner and author Alan Villiers describes them as follows:To sailors, three things made a ship a clipper.  She must be sharp-lined, built for speed.  She must be tall-sparred and carry the utmost spread of canvas.  And she must use that sail, day and night, fair weather and foul.Villiers (1962), p. 216  Optimized for speed, they were too fine-lined to carry much cargo.  Clippers typically carried extra sails such as skysails and moonrakers on the masts, and studdingsails on booms extending out from the hull or yards,Villiers (1962), frontispiece and p.220 which required extra sailors to handle them.Villiers (1962), p. 216, 220  In conditions where other ships would shorten sail, clippers drove on, heeling so much that their lee rails were in the water.Villiers (1962), pp. 217, 218\n\nA clipper is often confused with a windjammer, but they are two completely different types of ship. Clippers were optimized for speed only and carrying highly priced cargo in small quantities, such as tea, spices or opium; a windjammer is a large sailing ship which, although it carries a large sail area, is optimized, by contrast, for cargo capacity, ease of handling and carrying low priced bulk cargo, such as grain, fertilizers or lumber. Whereas clippers had very short lifespans—most were scrapped after only two decades of service—windjammers could have fifty or more years of service life, and several windjammers are still today in use as school ships.\n\nHistory\n\nThe first ships to which the term \"clipper\" seems to have been applied were the Baltimore clippers. Baltimore clippers were topsail schooners developed in the Chesapeake Bay before the American Revolution, and which reached their zenith between 1795 and 1815.  They were small, rarely exceeding 200 tons OM, and modelled after French luggers.The Clipper Ship Era, Clarke, Arthur H., 1912 Some were lightly armed in the War of 1812, sailing under Letters of Marque and Reprisal, when the type—exemplified by Chasseur, launched at Fells Point, Baltimore in 1814—became known for her incredible speed; the deep draft enabled the Baltimore clipper to sail close to the wind.Villiers 1973. Clippers, running the British blockade of Baltimore, came to be recognized for speed rather than cargo space.\n\nSpeed was also required for the Chinese opium trade between England, India and China. Small, sharp-bowed British vessels were the result. An early example, which is today known as an opium clipper, was Transit of 1819. She was followed by many more.\n\nMeanwhile, Baltimore Clippers still continued to be built, and were built specifically for the China opium trade running opium between India and China, a trade that only became unprofitable for American shipowners in 1849.\n\nAnn McKim is generally known as the original clipper ship. She was built in Baltimore in 1833 and was the first attempt at building a larger swift vessel in the United States. Ann McKim 494 tons OM, was built on the enlarged lines of a Baltimore clipper, with sharply raked stem, counter stern and square rig. She was built in Baltimore in 1833 by the Kennard & Williamson shipyard.Dear, I.C.B., & Kemp, Peter, eds. Oxford Companion to Ships and the Sea (Oxford University Press, 2005).Website [http://www.bruzelius.info/Nautica/Ships/Clippers/Ann_McKim(1833).html \"Ann McKim\" -details, at bruzelius.info] Accessed 30 March 2009. Although Ann McKim was the first large clipper ship ever constructed, it cannot be said that she founded the clipper ship era, or even that she directly influenced shipbuilders, since no other ship was built like her; but she may have suggested the clipper design in vessels of ship rig. She did, however, influence the building of Rainbow in 1845, the first extreme clipper ship.\n\nIn Aberdeen, Scotland, the shipbuilders Alexander Hall and Sons developed the \"Aberdeen\" clipper bow in the late 1830s: the first was Scottish Maid launched in 1839. Scottish Maid, 150 tons OM, was the first British clipper ship. \"Scottish Maid was intended for the Aberdeen-London trade, where speed was crucial to compete with steamships. The Hall brothers tested various hulls in a water tank and found the clipper design most effective. The design was influenced by tonnage regulations. Tonnage measured a ship's cargo capacity and was used to calculate tax and harbour dues. The new 1836 regulations measured depth and breadth with length measured at half midship depth. Extra length above this level was tax-free and became a feature of clippers. Scottish Maid proved swift and reliable and the design was widely copied.\" The earliest British clipper ships were built for trade amongst the British Isles. Then followed the vast clipper trade of tea, opium, spices and other goods from the Far East to Europe, and the ships became known as \"tea clippers\".\n\nFrom 1839, larger American clipper ships started to be built beginning with Akbar, 650 tons OM, in 1839, and including the 1844-built Houqua, 581 tons OM. These larger vessels were built predominantly for use in the China tea trade and known as \"tea clippers\". Smaller clipper vessels also continued to be built predominantly for the China opium trade and known as \"opium clippers\" such as the 1842-built Ariel, 100 tons OM.\n\nThen in 1845 Rainbow, 757 tons OM, the first extreme clipper was launched in New York. These American clippers were larger vessels designed to sacrifice cargo capacity for speed. They had a bow lengthened above the water, a drawing out and sharpening of the forward body, and the greatest breadth further aft. Extreme clippers were built in the period 1845 to 1855. \n\nFrom 1851 or earlier another type of clipper ship was also being built in American shipyards, the medium clipper. \nIn the mid-1800s, shipbuilders in Medford, Massachusetts began building the medium clipper ship. They “quietly evolved a new type (of ship) of about 450 tons burden which, handled by eighteen officers and men, would carry half as much freight as a British-Indianman of 1500 tons with a crew of 125, and sail half again as fast.” Most owners wanted ships that could do all kinds of work and the “finest type” then being built was the Medford or Merrimac East Indianman. An example would be the Columbiana built in Medford in 1837, or Jotham Stetson’s ship the Rajah, 531 tons, 140 feet long which was constructed in the previous year. As Admiral Morison points out, ships built in Medford by the firms of J.O. Curtis, Hayden & Cudworth, S. Lapham “have more fast California passages to their credit, considering the number they built, than those of any other place.” That is quite a record.[http://www.medfordhistorical.org/medford-history/about-medford/medford-built-sailing-ships/ Medford Historical Society & Museum:Medford-Built Sailing Ships, at medfordhistorical.org] Accessed 19 October 2017\n\nIn 1851, shipbuilders in Medford, Massachusetts built the Antelope.  Often called the Antelope of Boston to distinguish it from other ships of the same name, this vessel is sometimes called one of the first medium clipper ships.  A ship-design journalist noted that \"the design of her model was to combine large stowage capacity with good sailing qualities.\"Boston Daily Atlas, November 29, 1851  The Antelope was relatively flat-floored and had only an 8-inch dead rise at half floor.\n\nThe medium clipper, though still very fast, had comparatively more allowance for cargo. After 1854 extreme clippers were replaced in American shipbuilding yards by medium clippers.\n\nThe Flying Cloud was a clipper ship that set the world's sailing record for the fastest passage between New York and San Francisco, 89 days 8 hours. She held this record for over 100 years, from 1854 to 1989.[1]  Flying Cloud was the most famous of the clippers built by Donald McKay. She was known for her extremely close race with the Hornet in 1853; for having a woman navigator, Eleanor Creesy, wife of Josiah Perkins Creesy, who skippered the Flying Cloud on two record-setting voyages from New York to San Francisco; and for sailing in the Australia and timber trades.\n\nClipper ships largely ceased being built in American shipyards in 1859 when, unlike the earlier boom years, only 4 clipper ships were built. That is except for a small number built in the 1860s.  The last American clipper ship was \"the Pilgrim\" launched in 1873 from the shipyards of Medford, Massachusetts, built by Joshua T. Foster.  Among ship owners of the day, “Medford-built” came to mean the best.\n\nDuring the time from 1859 British clipper ships continued to be built. Earlier British clipper ships had become known as extreme clippers, and were considered to be \"as sharp as the American\" built ships. From 1859 a new design was developed for British clipper ships that was nothing like the American clippers. These ships built from 1859 continued to be called extreme clippers. The new design had a sleek graceful appearance, less sheer, less freeboard, lower bulwarks, and smaller breadth. They were built for the China tea trade and began with Falcon in 1859,  and finished with the last ships built in 1870. It is estimated that 25 to 30 of these ships were built, and no more than 4–5 per year. The earlier ships were made from wood, though some were made from iron, just as some British clippers had been made from iron prior to 1859. In 1863 the first tea clippers of composite construction were brought out, combining the best of both worlds. Composite clippers had the strength of iron spars with wooden hulls, and copper sheathing could be added to prevent the fouling that occurred on iron hulls.\n\nAfter 1869 with the opening of the Suez Canal that greatly advantaged steam vessels (see below, \"Decline\"), the tea trade then collapsed for clippers. From the late 1860s-early 1870s the clipper trade increasingly focused on trade and the carrying of immigrants between England and Australia and New Zealand, a trade that had begun earlier with the Australian Gold Rush in the 1850s. British-built clipper ships were used for this trade, as were many American-built ships which were sold to British owners. Even in the 1880s, sailing ships were still the main carriers of cargoes to and from Australia and New Zealand. Eventually, however, even this trade became unprofitable, and the aging clipper fleet became unseaworthy.\n\nChina clippers and the apogee of sail \n\nAmong the most notable clippers were the China clippers, also called Tea clippers or Opium clippers, designed to ply the trade routes between Europe and the East Indies. The last example of these still in reasonable condition was Cutty Sark, preserved in dry dock at Greenwich, United Kingdom. Damaged by fire on 21 May 2007 while undergoing conservation, the ship was permanently elevated three meters above the dry dock floor in 2010 as part of a plan for long-term preservation.\n\nBefore the early 18th century, the East India Company paid for its tea mainly in silver. However, when the Chinese Emperor chose to embargo European manufactured commodities and demand payment for all Chinese goods in silver, the price rose, restricting free trade. The East India Company began to manufacture a product that was desired by the Chinese as much as tea was by the British: opium. This had a significant influence on both India and China. Opium was also imported into Britain and was not prohibited because it was thought to be medically beneficial. Laudanum, which was made from opium was also used as a pain killer, to induce sleep and to suppress anxiety. The famous literary opium addicts Thomas De Quincey, Samuel Taylor Coleridge and Wilkie Collins also took it for its pleasurable effects. The Limehouse area in London was notorious for its opium dens, many of which catered for Chinese sailors as well as English addicts.\n\nClippers were built for seasonal trades such as tea, where an early cargo was more valuable, or for passenger routes. One passenger ship survives, the City of Adelaide designed by William Pile of Sunderland. The fast ships were ideally suited to low-volume, high-profit goods, such as tea, opium, spices, people, and mail. The return could be spectacular. The Challenger returned from Shanghai with \"the most valuable cargo of tea and silk ever to be laden in one bottom\". Competition among the clippers was public and fierce, with their times recorded in the newspapers. The ships had short-expected lifetimes and rarely outlasted two decades of use before they were broken up for salvage. Given their speed and maneuverability, clippers frequently mounted cannon or carronades and were used for piracy, privateering, smuggling, or interdiction service.\n\nThe last China clippers were acknowledged as the fastest sail vessels. When fully rigged and riding a tradewind, they had peak average speeds over 16 kn. The Great Tea Race of 1866 showcased their speed.  China clippers are also the fastest commercial sailing vessels ever made. Their speeds have been exceeded many times by modern yachts, but never by a commercial sail vessel. Only the fastest windjammers could attain similar speeds.\n\nThe 24h record of the Champion of the Seas wasn't broken until 1984 (by a multihull), or 2001 (by another monohull).\n\nDecline\n\nDecline in the use of clippers started with the economic slump following the Panic of 1857 and continued with the gradual introduction of the steamship. Although clippers could be much faster than early steamships, they depended on the vagaries of the wind, while steamers could keep to a schedule. The steam clipper was developed around this time, and had auxiliary steam engines which could be used in the absence of wind. An example was Royal Charter, built in 1857 and wrecked on the coast of Anglesey in 1859. The final blow was the Suez Canal, opened in 1869, which provided a great shortcut for steamships between Europe and Asia, but was difficult for sailing ships to use. With the absence of the tea trade, some clippers began operating in the wool trade, between Britain and Australia.\n\nSurviving ships \n\nAlthough many clipper ships were built in the mid-19th century, Cutty Sark was, perhaps until recently, the only intact survivor. Other surviving examples of clippers of the era are less well preserved, for example the oldest surviving clipper City of Adelaide' (a.k.a. S.V. Carrick).\n\nFalls of Clyde is a well-preserved example of a more conservatively designed, slower contemporary of the clippers, which was built for general freight in 1878.\n\nClipper ship sailing cards\n\nDepartures of clipper ships, mostly from New York and Boston to San Francisco, were advertised by clipper ship sailing cards.  These cards, slightly larger than today’s postcards, were produced by letterpress and wood engraving on coated card stock.  Most clipper cards were printed in the 1850s and 1860s, and represented the first pronounced use of color in American advertising art.\n\nRelatively few (perhaps 3,500) cards survive today.  With their stunning appearance, rarity, and importance as artifacts of nautical, Western, and printing history, clipper cards are highly prized by both private collectors and institutions. Clipper. http://en.wikipedia.org/?curid=7461."
  }
}
