{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15809",
  "eid" : "1ed286d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778560957,
  "textBody" : "Events\n\n*48 BC – Battle of Dyrrhachium: Julius Caesar barely avoids a catastrophic defeat by Pompey in Macedonia.\n* 138 – Emperor Hadrian dies of heart failure at Baiae; he is buried at Rome in the Tomb of Hadrian beside his late wife, Vibia Sabina.\n* 645 – Isshi Incident: Prince Naka-no-Ōe and Fujiwara no Kamatari assassinate Soga no Iruka during a coup d'état at the imperial palace.\n* 988 – The Norse King Glúniairn recognises Máel Sechnaill mac Domnaill, High King of Ireland, and agrees to pay taxes and accept Brehon Law; the event is considered to be the founding of the city of Dublin.\n*1086 – King Canute IV of Denmark is killed by rebellious peasants.\n*1212 – The most severe of several early fires of London burns most of the city to the ground.\n*1460 – Richard Neville, 16th Earl of Warwick, defeats the king's Lancastrian forces and takes King Henry VI prisoner in the Battle of Northampton.\n*1499 – The Portuguese explorer Nicolau Coelho returns to Lisbon after discovering the sea route to India as a companion of Vasco da Gama.\n*1512 – The Spanish conquest of Iberian Navarre commences with the capture of Goizueta.\n*1519 – Zhu Chenhao declares the Ming dynasty's Zhengde Emperor a usurper, beginning the Prince of Ning rebellion, and leads his army north in an attempt to capture Nanjing.  \n*1553 – Lady Jane Grey takes the throne of England.\n*1584 – William I of Orange is assassinated in his home in Delft, Holland, by Balthasar Gérard.\n*1645 – English Civil War: The Battle of Langport takes place.\n*1778 – American Revolution: Louis XVI of France declares war on the Kingdom of Great Britain.\n*1789 – Alexander Mackenzie reaches the Mackenzie River delta.\n*1806 – The Vellore Mutiny is the first instance of a mutiny by Indian sepoys against the British East India Company.\n*1821 – The United States takes possession of its newly bought territory of Florida from Spain.\n*1832 – U.S. President Andrew Jackson vetoes a bill that would re-charter the Second Bank of the United States.\n*1850 – U.S. President Millard Fillmore is sworn in, a day after becoming President upon Zachary Taylor's death. \n*1869 – Gävle, Sweden, is largely destroyed in a fire; 80% of its 10,000 residents are left homeless.\n*1877 – The then-villa of Mayagüez, Puerto Rico, formally receives its city charter from the Royal Crown of Spain.\n*1882 – War of the Pacific: Chile suffers its last military defeat in the Battle of La Concepción when a garrison of 77 men is annihilated by a 1,300-strong Peruvian force, many of them armed with spears.\n*1890 – Wyoming is admitted as the 44th U.S. state.\n*1913 – The temperature in Death Valley, California, hits 134 °F, the highest temperature ever to be recorded on Earth.\n*1921 – Belfast's Bloody Sunday: Sixteen people are killed and 161 houses destroyed during rioting and gun battles in Belfast, Northern Ireland.\n*1925 – Meher Baba begins his silence of 44 years. His followers observe Silence Day on this date in commemoration.\n*  1925   – Scopes Trial: In Dayton, Tennessee, the so-called \"Monkey Trial\" begins of John T. Scopes, a young high school science teacher accused of teaching evolution in violation of the Butler Act.\n*1927 – Kevin O'Higgins TD, Vice-President of the Executive Council of the Irish Free State is assassinated by the IRA.\n*1938 – Howard Hughes sets a new record by completing a 91-hour airplane flight around the world.\n*1940 – World War II: The Vichy government is established in France.\n*1941 – Jedwabne pogrom: Massacre of Polish Jews living in and near the village of Jedwabne.\n*1942 – Diplomatic relations between the Netherlands and the Soviet Union are established.\n*  1942   – World War II: An American pilot spots a downed, intact Mitsubishi A6M Zero on Akutan Island (the \"Akutan Zero\") that the US Navy uses to learn the aircraft's flight characteristics.\n*1943 – World War II: Operation Husky begins in Sicily.\n*1947 – Muhammad Ali Jinnah is recommended as the first Governor-General of Pakistan by the British Prime Minister, Clement Attlee.\n*1951 – Korean War: Armistice negotiations begin at Kaesong.\n*1962 – Telstar, the world's first communications satellite, is launched into orbit.\n*1966 – The Chicago Freedom Movement, led by Martin Luther King, Jr., holds a rally at Soldier Field in Chicago. As many as 60,000 people attend. \n*1973 – The Bahamas gain full independence within the Commonwealth of Nations.\n*  1973   – National Assembly of Pakistan passes a resolution on the recognition of Bangladesh.\n*1976 – Four mercenaries (one American and three British) are executed in Angola following the Luanda Trial.\n*1978 – ABC World News Tonight premieres on ABC.\n*  1978   – President Moktar Ould Daddah of Mauritania is ousted in a bloodless coup d'état.\n*1985 – The Greenpeace vessel Rainbow Warrior is bombed and sunk in Auckland harbour by French DGSE agents, killing Fernando Pereira.\n*  1985   – An Aeroflot Tupolev Tu-154 stalls and crashes near Uchkuduk, Uzbekistan (then part of the Soviet Union), killing all 200 people on board in the USSR's worst-ever airline disaster.\n*1991 – The South African cricket team is readmitted into the International Cricket Council following the end of Apartheid.\n*  1991   – Boris Yeltsin takes office as the first elected President of Russia.\n*1992 – In Miami, former Panamanian leader Manuel Noriega is sentenced to 40 years in prison for drug and racketeering violations.\n*1997 – In London, scientists report the findings of the DNA analysis of a Neanderthal skeleton which supports the \"out of Africa theory\" of human evolution, placing an \"African Eve\" at 100,000 to 200,000 years ago.\n*  1997   – Miguel Ángel Blanco, a member of Partido Popular (Spain), is kidnapped (and later murdered) in the Basque city of Ermua by ETA members, sparking widespread protests.\n*1998 – Catholic Church sexual abuse cases: The Diocese of Dallas agrees to pay $23.4 million to nine former altar boys who claimed they were sexually abused by Rudolph Kos, a former priest.\n*2000 – EADS, the world's second-largest aerospace group is formed by the merger of Aérospatiale-Matra, DASA, and CASA.\n*2002 – At a Sotheby's auction, Peter Paul Rubens' painting The Massacre of the Innocents is sold for £49.5 million (US$76.2 million) to Lord Thomson.\n*2005 – Hurricane Dennis slams into the Florida Panhandle, causing billions of dollars in damage.\n*2007 – Erden Eruç begins the first solo human-powered circumnavigation of the world.\n*2008 – Former Macedonian Interior Minister Ljube Boškoski is acquitted of all war-crimes charges by a United Nations Tribunal.\n*2011 – Russian cruise ship Bulgaria sinks in Volga near Syukeyevo, Tatarstan, causing 122 deaths.\n*2017 - Iraqi Civil War: Mosul is declared fully liberated from the Islamic State of Iraq and the Levant.\n\nBirths\n\n*1419 – Emperor Go-Hanazono of Japan (d. 1471)\n*1451 – James III of Scotland (d. 1488)\n*1501 – Cho Shik, Korean poet and scholar (d. 1572)\n*1509 – John Calvin, French pastor and theologian (d. 1564)\n*1515 – Francisco de Toledo, Viceroy of Peru (d. 1582)\n*1517 – Odet de Coligny, French cardinal (d. 1571)\n*1533 – Antonio Possevino, Italian diplomat (d. 1611)\n*1592 – Pierre d'Hozier, French genealogist and historian (d. 1660)\n*1614 – Arthur Annesley, 1st Earl of Anglesey, Irish-English politician (d. 1686)\n*1625 – Jean Herauld Gourville, French adventurer (d. 1703)\n*1638 – David Teniers III, Flemish painter (d. 1685)\n*1666 – John Ernest Grabe, German theologian and academic (d. 1711)\n*1682 – Roger Cotes, English mathematician and astronomer (d. 1716)\n*1723 – William Blackstone, English lawyer, judge, and politician (d. 1780)\n*1724 – Eva Ekeblad, Swedish noble and agronomist (d. 1786)\n*1792 – George M. Dallas, American lawyer and politician, 11th Vice President of the United States (d. 1864)\n*1802 – Robert Chambers, Scottish geologist and publisher, co-founded Chambers Harrap (d. 1871)\n*1804 – Emma Smith, American religious leader (d. 1879)\n*1809 – Friedrich August von Quenstedt, German geologist and palaeontologist (d. 1889)\n*1823 – Louis-Napoléon Casault, Canadian lawyer, judge, and politician (d. 1908)\n*1830 – Camille Pissarro, Danish-French painter (d. 1903)\n*1832 – Alvan Graham Clark, American astronomer (d. 1897)\n*1834 – James Abbott McNeill Whistler, American-English painter and illustrator (d. 1903)\n*1835 – Henryk Wieniawski, Polish violinist and composer (d. 1880)\n*1839 – Adolphus Busch, German brewer, co-founded Anheuser-Busch (d. 1913)\n*1856 – Nikola Tesla, Serbian-American physicist and engineer (d. 1943)\n*1864 – Austin Chapman, Australian businessman and politician, 4th Australian Minister for Defence (d. 1926)\n*1867 – Prince Maximilian of Baden (d. 1929)\n*1871 – Marcel Proust, French novelist, critic, and essayist (d. 1922)\n*1874 – Sergey Konenkov, Russian sculptor (d. 1971)\n*1875 – Mary McLeod Bethune, American educator and activist (d. 1955)\n*1877 – Ernst Bresslau, German zoologist (d. 1935)\n*1878 – Otto Freundlich, German painter and sculptor (d. 1943)\n*1882 – Ima Hogg, American society leader, philanthropist, patron and collector of the arts (d. 1975)\n*1883 – Johannes Blaskowitz, German general (d. 1948)\n*  1883   – Hugo Raudsepp, Estonian playwright and politician (d. 1952)\n*1888 – Giorgio de Chirico, Greek-Italian painter and set designer (d. 1978)\n*  1888   – Toyohiko Kagawa, Japanese evangelist, author, and activist (d. 1960)\n*1891 – Edith Quimby, American medical researcher and physicist (d. 1982)\n*1894 – Jimmy McHugh, American composer (d. 1969)\n*1895 – Carl Orff, German composer and educator (d. 1982)\n*1896 – Thérèse Casgrain, Canadian politician (d. 1981)\n*1897 – Legs Diamond, American gangster (d. 1931)\n*  1897   – Karl Plagge, German general and engineer (d. 1957)\n*1898 – Renée Björling, Swedish actress (d. 1975) \n*1899 – John Gilbert, American actor, director, and screenwriter (d. 1936)\n*  1899   – Heiri Suter, Swiss cyclist (d. 1978)\n*1900 – Mitchell Parish, Lithuanian-American songwriter (d. 1993)\n*  1900   – Sampson Sievers, Russian monk and mystic (d. 1979)\n*1902 – Kurt Alder, German chemist and academic, Nobel Prize laureate (d. 1958)\n*  1902   – Nicolás Guillén, Cuban poet, journalist, and activist (d. 1989)\n*1903 – Werner Best, German SS officer and jurist (d. 1989)\n*  1903   – John Wyndham, English soldier and author (d. 1969)\n*1904 – Lili Damita, French-American actress (d. 1994)\n*1905 – Mildred Benson, American journalist and author (d. 2002)\n*  1905   – Thomas Gomez, American actor (d. 1971)\n*  1905   – Wolfram Sievers, German physician (d. 1948)\n*1907 – Blind Boy Fuller, American singer and guitarist (d. 1941)\n*1909 – Donald Sinclair, English lieutenant and businessman (d. 1981)\n*1911 – Terry-Thomas, English comedian and character actor (d. 1990)\n*  1911   – Cootie Williams, American trumpeter and bandleader (d. 1985) \n*1913 – Salvador Espriu, Spanish author, poet, and playwright (d. 1985)\n*1914 – Joe Shuster, Canadian-American illustrator, co-created Superman (d. 1992)\n*  1914   – Rempo Urip, Indonesian film director\n*1916 – Judith Jasmin, Canadian journalist (d. 1972)\n*1917 – Hugh Alexander, American baseball player and scout (d. 2000)\n*  1917   – Reg Smythe, English cartoonist (d. 1998)\n*1918 – James Aldridge, Australian-English journalist and author (d. 2015)\n*  1918   – Chuck Stevens, American major baseball\n*  1918   – Frank L. Lambert, Professor Emeritus of Chemistry at Occidental College\n*  1918   – Fred Wacker, American race driver and engineer (d. 1998)\n*1919 – Pierre Gamarra, French author, poet, and critic (d. 2009)\n*  1919   – Ian Wallace, English actor and singer (d. 2009)\n*1920 – David Brinkley, American journalist (d. 2003)\n*  1920   – Owen Chamberlain, American physicist and academic, Nobel Prize laureate (d. 2006)\n*  1920   – Cyril Grant, English footballer (d. 2002)\n*1921 – Harvey Ball, American illustrator, created the Smiley (d. 2001)\n*  1921   – Jeff Donnell, American actress (d. 1988)\n*  1921   – John K. Singlaub, U.S Army Major General\n*  1921   – Eunice Kennedy Shriver, American activist, co-founded the Special Olympics (d. 2009)\n*1922 – Jean Kerr, American author and playwright (d. 2003)\n*  1922   – Herb McKenley, Jamaican sprinter (d. 2007)\n*  1922   – Jake LaMotta, American boxer and actor (d. 2017)\n*1923 – John Bradley, American soldier (d. 1994)\n*  1923   – Suzanne Cloutier, Canadian actress and producer (d. 2003)\n*  1923   – G. A. Kulkarni, Indian author and academic (d. 1987)\n*1924 – Johnny Bach, American basketball player and coach (d. 2016)\n*  1924   – Bobo Brazil, American wrestler (d. 1998)\n*1925 – Mahathir Mohamad, Malaysian physician and politician, 4th Prime Minister of Malaysia \n*1926 – Carleton Carpenter, American actor, magician, songwriter, and novelist\n*  1926   – Fred Gwynne, American actor (d. 1993)\n*1927 – Grigory Barenblatt, Russian mathematician and academic\n*  1927   – David Dinkins, American soldier and politician, 106th Mayor of New York City\n*  1927   – William Smithers, American actor\n*1928 – Don Bolles, American investigative reporter (d. 1976)\n*  1928   – Bernard Buffet, French painter and illustrator (d. 1999)\n*  1928   – Alejandro de Tomaso, Argentinian-Italian race car driver and businessman, founded De Tomaso (d. 2003)\n*  1928   – Moshe Greenberg, American-Israeli rabbi and scholar (d. 2010)\n*  1928   – John Glenn, American baseball player\n*1929 – Winnie Ewing, Scottish lawyer and politician\n*  1929   – George Clayton Johnson, American author and screenwriter (d. 2015)\n*  1929   – Moe Norman, Canadian golfer (d. 2004)\n*  1929   – José Vicente Rangel, Venezuelan politician; 21st Vice President of Venezuela\n*1930 – Josephine Veasey, English soprano and actress\n*1931 – Nick Adams, American actor and screenwriter (d. 1968)\n*  1931   – Jerry Herman, American composer and songwriter\n*  1931   – Julian May, American author\n*  1931   – Alice Munro, Canadian short story writer, Nobel Prize laureate\n*1932 – Carlo Maria Abate, Italian race car driver\n*  1932   – Neile Adams, Filipino-American actress, singer and dancer \n*1933 – Jumpin' Gene Simmons, American rockabilly singer-songwriter (d. 2006)\n*  1933   – C.K. Yang, Taiwanese decathlete and pole vaulter (d. 2007)\n*1934 – Jerry Nelson, American puppeteer and voice actor (d. 2012)\n*1935 – Tura Satana, American actress and dancer (d. 2011)\n*  1935   – Wilson Tuckey, Australian politician\n*  1935   – Wilson Whineray, New Zealand rugby player and businessman (d. 2012)\n*1936 – Herbert Boyer, American businessman, co-founded Genentech\n*  1936   – Tunne Kelam, Estonian journalist and politician\n*1937 – Edwards Barham, American farmer and politician (d. 2014)\n*  1937   – Gun Svensson, Swedish politician\n*1938 – Paul Andreu, French architect\n*  1938   – Lee Morgan, American trumpet player and composer (d. 1972)\n*1939 – Phil Kelly, Irish-English footballer and manager (d. 2012)\n*  1939   – Ahmet Taner Kışlalı, Turkish political scientist, journalist and educator (d. 1999)\n*1939 – Mavis Staples, American singer \n*1940 – Meghnad Desai, Baron Desai, Indian-English economist and politician\n*  1940   – Helen Donath, American soprano and actress\n*  1940   – Brian Priestley, English pianist and composer \n*  1940   – Keith Stackpole, Australian cricketer\n*1941 – Jake Eberts, Canadian film producer (d. 2012)\n*  1941   – David G. Hartwell, American anthologist, author, and critic (d. 2016)\n*  1941   – Robert Pine, American actor and director\n*  1941   – Ian Whitcomb, English singer-songwriter, producer, and actor\n*1942 – Ronnie James Dio, American singer-songwriter and producer (d. 2010)\n*  1942   – Pyotr Klimuk, Belarusian general, pilot, and astronaut \n*  1942   – Sixto Rodriguez, American singer-songwriter and guitarist\n*  1942   – Lopo do Nascimento, Angolan politician; 1st Prime Minister of Angola\n*1943 – Arthur Ashe, American tennis player and journalist (d. 1993)\n*  1943   – Inonge Mbikusita-Lewanika, Zambian politician\n*  1943   – Jerry Miller, American singer-songwriter and guitarist \n*1944 – Mick Grant, English racing motorcyclist\n*  1944   – Norman Hammond, English archaeologist and academic\n*1945 – Ron Glass, American actor (d. 2016)\n*  1945   – Hal McRae, American baseball player and manager\n*  1945   – John Motson, English sportscaster\n*  1945   – Jean-Marie Poiré, French director, producer, and screenwriter\n*  1945   – Virginia Wade, English tennis player and sportscaster\n*1946 – Jean-Pierre Jarier, French racing driver\n*1946 － Chin Han, Taiwanese actor\n*1947 – Arlo Guthrie, American singer-songwriter, producer, and actor\n*1948 – Ronnie Cutrone, American painter (d. 2013)\n*  1948   – Chico Resch, Canadian ice hockey player and sportscaster\n*  1948   – Natalya Sedykh, Russian figure skater, ballet dancer, actor\n*1949 – Anna Czerwińska, Polish mountaineer and author\n*  1949   – Sunil Gavaskar, Indian cricketer and sportscaster\n*  1949   – Greg Kihn, American singer-songwriter and guitarist \n*  1949   – John Whitehead, American singer-songwriter and producer (d. 2004)\n*1950 – Tony Baldry, English colonel, lawyer, and politician, British Minister of State for Agriculture\n*  1950   – Prokopis Pavlopoulos, President of Greece, Greek lawyer and politician, Greek Minister for the Interior\n*1951 – Cheryl Wheeler, American singer-songwriter and guitarist \n*1952 – Kim Mitchell, Canadian singer-songwriter and guitarist \n*  1952   – Peter van Heemst, Dutch politician\n*1953 – Rik Emmett, Canadian singer-songwriter, guitarist, and producer \n*1954 – Tommy Bowden, American football player and coach\n*  1954   – Andre Dawson, American baseball player\n*  1954   – Neil Tennant, English singer-songwriter and keyboard player \n*1955 – Nic Dakin, English educator and politician\n*1956 – Tom McClintock, American lawyer and politician\n*1957 – Derry Grehan, Canadian rock guitarist and songwriter (Honeymoon Suite) \n*1958 – Béla Fleck, American banjo player and songwriter\n*  1958   – Fiona Shaw, Irish actress and director\n*1959 – Ellen Kuras, American director and cinematographer\n*  1959   – Sandy West, American singer-songwriter and drummer (d. 2006)\n*  1961 － Jacky Cheung, Hong Kong singer, film actor\n*1963 – Ian Lougher, Welsh motorcycle racer\n*1964 – Martin Laurendeau, Canadian tennis player and coach\n*  1964   – Urban Meyer, American football player and coach\n*  1964   – Wilfried Peeters, Belgian cyclist\n*1965 – Scott McCarron, American golfer\n*  1965   – Ken Mellons, American singer-songwriter and guitarist \n*1966 – Clive Efford, English politician\n*  1966   – Johnny Grunge, American wrestler (d. 2006)\n*  1966   – Christian Stangl, Austrian skier and mountaineer\n*  1966   – Anna Bråkenhielm, Swedish business executive\n*1967 – Rebekah Del Rio, American singer-songwriter\n*  1967   – Gillian Tett, English journalist and author\n*  1967   – John Yoo, South Korean-American lawyer, author, and educator \n*1969 – Marty Cordova, American baseball player\n*  1969   – Gale Harold, American actor\n*1970 – Gary LeVox, American singer-songwriter \n*  1970   – Jason Orange, English singer-songwriter and dancer \n*1971 – Adam Foote, Canadian ice hockey player\n*  1971   – Gregory Goodridge, Barbadian footballer and coach\n*1972 – Peter Serafinowicz, English actor\n*  1972   – Sofía Vergara, Colombian-American actress and producer\n*  1972   – Tilo Wolff, German-Swiss singer-songwriter, pianist, and producer \n*1974 – Imelda May, Irish singer-songwriter, musician, and producer\n*1975 – Andrew Firestone, American businessman\n*  1975   – Brendan Gaughan, American race car driver\n*  1975   – Alain Nasreddine, Canadian ice hockey player and coach\n*  1975   – Stefán Karl Stefánsson, Icelandic actor\n*  1975   – Richard Westbrook, English race car driver\n*1976 – Edmílson, Brazilian footballer\n*  1976   – Elijah Blue Allman, American singer and guitarist \n*  1976   – Ludovic Giuly, French footballer\n*  1976   – Adrian Grenier, American actor, producer, and screenwriter\n*  1976   – Brendon Lade, Australian footballer and coach\n*  1976   – Lars Ricken, German footballer\n*1977 – Chiwetel Ejiofor, English actor \n*1979 – Mvondo Atangana, Cameroon footballer\n*1979 － Gong Yoo, Korean actor\n*1980 – Alejandro Millán, Mexican singer-songwriter and keyboard player \n*  1980   – Adam Petty, American race car driver (d. 2000)\n*  1980   – Claudia Leitte, Brazilian singer-songwriter\n*  1980   – James Rolfe, American actor, director, and producer\n*  1980   – Jessica Simpson, American singer-songwriter, actress, and fashion designer\n*1981 – Aleksandar Tunchev, Bulgarian footballer\n*1982 – Alex Arrowsmith, American guitarist and producer \n*  1982   – Juliya Chernetsky, Ukrainian-American television host\n*  1982   – Sebastian Mila, Polish footballer\n*  1982   – Jeffrey Walker, Australian actor and director \n*1983 – Giuseppe De Feudis, Italian footballer\n*  1983   – Matthew Egan, Australian footballer\n*  1983   – Gabi, Spanish footballer\n*  1983 － Kim Hee-chul, Korean entertainer, member of Super Junior\n*  1983   – Joelson José Inácio, Brazilian footballer\n*  1983   – Doug Kramer, Filipino basketball player\n*  1983   – Anthony Watmough, Australian rugby player\n*1984 – Nikolaos Mitrou, Greek footballer\n*1985 – Park Chu-young, South Korean footballer\n*  1985   – B. J. Crombeen, American ice hockey player\n*  1985   – Mario Gómez, German footballer\n*1988 – Antonio Brown, American football player\n*  1988   – Heather Hemmens, American actress, director, and producer\n*  1988   – Sarah Walker, New Zealand BMX rider\n*1990 – Adam Reynolds, Australian rugby league player\n*  1990   – Chiyonokuni Toshiki, Japanese sumo wrestler\n*1991 – Daishōmaru Shōgo, Japanese sumo wrestler\n*2001 – Isabela Moner, American actress\n\nDeaths\n\n* 138 – Hadrian, Roman emperor (b. 76)\n* 645 – Soga no Iruka, Japanese politician\n* 649 – Tai Zong, Chinese emperor (b. 598)\n* 772 – Amalberga of Temse, Frankish noblewoman\n* 831 – Zubaidah bint Ja`far, Abbasid Princess\n* 994 – Leopold I, margrave of Austria\n*1086 – Canute IV, king of Denmark (b. 1043)\n*1103 – Eric I, king of Denmark (b. 1060)\n*1290 – Ladislaus IV, king of Hungaria (b. 1262)\n*1460 – Humphrey Stafford, 1st Duke of Buckingham, English commander and politician, Lord High Constable of England (b. 1402)\n*  1460   – John Talbot, 2nd Earl of Shrewsbury, English nobleman (b. c. 1413)\n*1461 – Thomas, king of Bosnia (b. 1411)\n*1473 – James II, king of Cyprus\n*1480 – René of Anjou, French nobleman (b. 1400)\n*1510 – Catherine Cornaro, queen of Cyprus (b. 1454)\n*1559 – Henry II, king of France (b. 1519)\n*1584 – William I, Dutch nobleman (b. 1533)\n*1590 – Charles II, archduke of Austria (b. 1540)\n*1594 – Paolo Bellasio, Italian organist and composer (b. 1554)\n*1603 – Joan Terès i Borrull, Spanish archbishop and academic (b. 1538)\n*1621 – Charles Bonaventure de Longueval, French commander (b. 1571)\n*1653 – Gabriel Naudé, French librarian and scholar (b. 1600)\n*1680 – Louis Moréri, French priest and scholar (b. 1643)\n*1683 – François Eudes de Mézeray, French historian and author (b. 1610)\n*1686 – John Fell, English bishop and academic (b. 1625)\n*1776 – Richard Peters, English lawyer and minister (b. 1704)\n*1794 – Gaspard de Bernard de Marigny, French general (d. 1754)\n*1806 – George Stubbs, English painter and academic (b. 1724)\n*1851 – Louis Daguerre, French photographer and physicist, invented the daguerreotype (b. 1787)\n*1863 – Clement Clarke Moore, American author and educator (b. 1779)\n*1881 – Georg Hermann Nicolai, German architect and academic (b. 1812)\n*1884 – Paul Morphy, American chess player (b. 1837)\n*1908 – Phoebe Knapp, American organist and composer (b. 1839)\n*1915 – Hendrik Willem Mesdag, Dutch painter (b. 1831)\n*1920 – John Fisher, 1st Baron Fisher, British admiral (b. 1841)\n*1929 – Ève Lavallière, French actress (b. 1866) \n*1941 – Jelly Roll Morton, American pianist, composer, and bandleader (b. 1890)\n*1950 – Richard Maury, American-Argentinian engineer (b. 1882)\n*1952 – Rued Langgaard, Danish organist and composer (b. 1893)\n*1954 – Calogero Vizzini, Italian mob boss (b. 1877)\n*1956 – Joe Giard, American baseball player (b. 1898)\n*1960 – Sæbjørn Buttedahl, Norwegian actor and sculptor (b. 1876)\n*1962 – Yehuda Leib Maimon, Israeli rabbi and politician (b. 1875)\n*1963 – Teddy Wakelam, English rugby player and sportscaster (b. 1893)\n*1970 – Bjarni Benediktsson, Icelandic academic and politician, 13th Prime Minister of Iceland (b. 1908)\n*1971 – Laurent Dauthuille, French boxer (b. 1924)\n*  1971   – George Kenner, German-American painter and illustrator (b. 1888)\n*1972 – Lovie Austin, American pianist, composer, and bandleader (b. 1887)\n*1978 – John D. Rockefeller III, American businessman and philanthropist, founded the Asia Society (b. 1906)\n*1979 – Arthur Fiedler, American conductor (b. 1894)\n*1980 – Joseph Krumgold, American author and screenwriter (b. 1908)\n*1985 – Fernando Pereira, Dutch photographer (b. 1950)\n*1986 – Tadeusz Piotrowski, Polish mountaineer and author (b. 1940)\n*1987 – John Hammond, American record producer, critic, and activist (b. 1910)\n*1989 – Mel Blanc, American voice actor (b. 1908)\n*1993 – Ruth Krauss, American author and poet (b. 1901)\n*  1993   – Sam Rolfe, American screenwriter and producer (b. 1924)\n*1995 – Mehmet Ali Aybar, Turkish lawyer and politician (b. 1908)\n*1996 – Eno Raud, Estonian author (b. 1928)\n*2000 – Vakkom Majeed, Indian journalist and politician (b. 1909)\n*2002 – Jean-Pierre Côté, Canadian politician, 23rd Lieutenant Governor of Quebec (b. 1926)\n*  2002   – Evangelos Florakis, Greek general (b. 1943)\n*  2002   – Laurence Janifer, American author (b. 1933)\n*2003 – Winston Graham, English author (b. 1908)\n*  2003   – Hartley Shawcross, Baron Shawcross, German-English lawyer and politician, Attorney General for England and Wales (b. 1902)\n*2004 – Pati Behrs, Russian-American ballerina and actress (b. 1922)\n*2005 – A. J. Quinnell, English author (b. 1940)\n*2006 – Shamil Basayev, Chechen terrorist rebel leader (b. 1965)\n*2007 – Doug Marlette, American cartoonist and author (b. 1949)\n*2008 – Hiroaki Aoki, Japanese-American wrestler and businessman, founded Benihana (b. 1938)\n*  2008   – Mike Souchak, American golfer (b. 1927)\n*2011 – Pierrette Alarie, Canadian soprano and educator (b. 1921)\n*  2011   – Roland Petit, French dancer and choreographer (b. 1924)\n*2012 – Dolphy, Filipino actor, singer, and producer (b. 1928)\n*  2012   – Peter Kyros, American lawyer and politician (b. 1925)\n*  2012   – Berthe Meijer, German-Dutch journalist and author (b. 1938) \n*  2012   – Fritz Langanke, German lieutenant (b. 1919)\n*  2012   – Viktor Suslin, Russian-German composer (b. 1942)\n*2013 – Philip Caldwell, American businessman (b. 1920)\n*  2013   – Józef Gara, Polish poet and linguist (b. 1929)\n*  2013   – Concha García Campoy, Spanish journalist (b. 1958)\n*  2013   – Caroline Duby Glassman, American lawyer and jurist (b. 1922)\n*  2013   – Ku Ok-hee, South Korean golfer (b. 1956)\n*  2013   – Gokulananda Mahapatra, Indian author and academic (b. 1922)\n*2014 – Robert C. Broomfield, American lawyer and judge (b. 1933)\n*  2014   – Juozas Kazickas, Lithuanian-American businessman and philanthropist (b. 1918)\n*  2014   – Paul G. Risser, American ecologist and academic (b. 1939)\n*  2014   – Zohra Sehgal, Indian actress, dancer, and choreographer (b. 1912)\n*  2014   – Gloria Schweigerdt, American baseball player (b. 1934)\n*2015 – Roger Rees, Welsh-American actor and director (b. 1944)\n*  2015   – Omar Sharif, Egyptian actor (b. 1932)\n*  2015   – Jon Vickers, Canadian tenor (b. 1926)\n*2016 – Katharina Focke, German politician (b. 1922)\n\nHolidays and observances\n\n* Armed Forces Day (Mauritania)\n* Christian feast day:\n** Amalberga of Maubeuge  \n** Canute IV of Denmark\n** Rufina and Secunda\n** Veronica Giuliani\n** Seven Brothers\n** July 10 (Eastern Orthodox liturgics)\n* Independence Day (Bahamas), celebrates the independence of the Bahamas from the United Kingdom in 1973.\n* Nikola Tesla Day\n* Silence Day (Followers of Meher Baba)\n* Statehood Day (Wyoming)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "July 10" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15809" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*48 BC – Battle of Dyrrhachium: Julius Caesar barely avoids a catastrophic defeat by Pompey in Macedonia.\n* 138 – Emperor Hadrian dies of heart failure at Baiae; he is buried at Rome in the Tomb of Hadrian beside his late wife, Vibia Sabina.\n* 645 – Isshi Incident: Prince Naka-no-Ōe and Fujiwara no Kamatari assassinate Soga no Iruka during a coup d'état at the imperial palace.\n* 988 – The Norse King Glúniairn recognises Máel Sechnaill mac Domnaill, High King of Ireland, and agrees to pay taxes and accept Brehon Law; the event is considered to be the founding of the city of Dublin.\n*1086 – King Canute IV of Denmark is killed by rebellious peasants.\n*1212 – The most severe of several early fires of London burns most of the city to the ground.\n*1460 – Richard Neville, 16th Earl of Warwick, defeats the king's Lancastrian forces and takes King Henry VI prisoner in the Battle of Northampton.\n*1499 – The Portuguese explorer Nicolau Coelho returns to Lisbon after discovering the sea route to India as a companion of Vasco da Gama.\n*1512 – The Spanish conquest of Iberian Navarre commences with the capture of Goizueta.\n*1519 – Zhu Chenhao declares the Ming dynasty's Zhengde Emperor a usurper, beginning the Prince of Ning rebellion, and leads his army north in an attempt to capture Nanjing.  \n*1553 – Lady Jane Grey takes the throne of England.\n*1584 – William I of Orange is assassinated in his home in Delft, Holland, by Balthasar Gérard.\n*1645 – English Civil War: The Battle of Langport takes place.\n*1778 – American Revolution: Louis XVI of France declares war on the Kingdom of Great Britain.\n*1789 – Alexander Mackenzie reaches the Mackenzie River delta.\n*1806 – The Vellore Mutiny is the first instance of a mutiny by Indian sepoys against the British East India Company.\n*1821 – The United States takes possession of its newly bought territory of Florida from Spain.\n*1832 – U.S. President Andrew Jackson vetoes a bill that would re-charter the Second Bank of the United States.\n*1850 – U.S. President Millard Fillmore is sworn in, a day after becoming President upon Zachary Taylor's death. \n*1869 – Gävle, Sweden, is largely destroyed in a fire; 80% of its 10,000 residents are left homeless.\n*1877 – The then-villa of Mayagüez, Puerto Rico, formally receives its city charter from the Royal Crown of Spain.\n*1882 – War of the Pacific: Chile suffers its last military defeat in the Battle of La Concepción when a garrison of 77 men is annihilated by a 1,300-strong Peruvian force, many of them armed with spears.\n*1890 – Wyoming is admitted as the 44th U.S. state.\n*1913 – The temperature in Death Valley, California, hits 134 °F, the highest temperature ever to be recorded on Earth.\n*1921 – Belfast's Bloody Sunday: Sixteen people are killed and 161 houses destroyed during rioting and gun battles in Belfast, Northern Ireland.\n*1925 – Meher Baba begins his silence of 44 years. His followers observe Silence Day on this date in commemoration.\n*  1925   – Scopes Trial: In Dayton, Tennessee, the so-called \"Monkey Trial\" begins of John T. Scopes, a young high school science teacher accused of teaching evolution in violation of the Butler Act.\n*1927 – Kevin O'Higgins TD, Vice-President of the Executive Council of the Irish Free State is assassinated by the IRA.\n*1938 – Howard Hughes sets a new record by completing a 91-hour airplane flight around the world.\n*1940 – World War II: The Vichy government is established in France.\n*1941 – Jedwabne pogrom: Massacre of Polish Jews living in and near the village of Jedwabne.\n*1942 – Diplomatic relations between the Netherlands and the Soviet Union are established.\n*  1942   – World War II: An American pilot spots a downed, intact Mitsubishi A6M Zero on Akutan Island (the \"Akutan Zero\") that the US Navy uses to learn the aircraft's flight characteristics.\n*1943 – World War II: Operation Husky begins in Sicily.\n*1947 – Muhammad Ali Jinnah is recommended as the first Governor-General of Pakistan by the British Prime Minister, Clement Attlee.\n*1951 – Korean War: Armistice negotiations begin at Kaesong.\n*1962 – Telstar, the world's first communications satellite, is launched into orbit.\n*1966 – The Chicago Freedom Movement, led by Martin Luther King, Jr., holds a rally at Soldier Field in Chicago. As many as 60,000 people attend. \n*1973 – The Bahamas gain full independence within the Commonwealth of Nations.\n*  1973   – National Assembly of Pakistan passes a resolution on the recognition of Bangladesh.\n*1976 – Four mercenaries (one American and three British) are executed in Angola following the Luanda Trial.\n*1978 – ABC World News Tonight premieres on ABC.\n*  1978   – President Moktar Ould Daddah of Mauritania is ousted in a bloodless coup d'état.\n*1985 – The Greenpeace vessel Rainbow Warrior is bombed and sunk in Auckland harbour by French DGSE agents, killing Fernando Pereira.\n*  1985   – An Aeroflot Tupolev Tu-154 stalls and crashes near Uchkuduk, Uzbekistan (then part of the Soviet Union), killing all 200 people on board in the USSR's worst-ever airline disaster.\n*1991 – The South African cricket team is readmitted into the International Cricket Council following the end of Apartheid.\n*  1991   – Boris Yeltsin takes office as the first elected President of Russia.\n*1992 – In Miami, former Panamanian leader Manuel Noriega is sentenced to 40 years in prison for drug and racketeering violations.\n*1997 – In London, scientists report the findings of the DNA analysis of a Neanderthal skeleton which supports the \"out of Africa theory\" of human evolution, placing an \"African Eve\" at 100,000 to 200,000 years ago.\n*  1997   – Miguel Ángel Blanco, a member of Partido Popular (Spain), is kidnapped (and later murdered) in the Basque city of Ermua by ETA members, sparking widespread protests.\n*1998 – Catholic Church sexual abuse cases: The Diocese of Dallas agrees to pay $23.4 million to nine former altar boys who claimed they were sexually abused by Rudolph Kos, a former priest.\n*2000 – EADS, the world's second-largest aerospace group is formed by the merger of Aérospatiale-Matra, DASA, and CASA.\n*2002 – At a Sotheby's auction, Peter Paul Rubens' painting The Massacre of the Innocents is sold for £49.5 million (US$76.2 million) to Lord Thomson.\n*2005 – Hurricane Dennis slams into the Florida Panhandle, causing billions of dollars in damage.\n*2007 – Erden Eruç begins the first solo human-powered circumnavigation of the world.\n*2008 – Former Macedonian Interior Minister Ljube Boškoski is acquitted of all war-crimes charges by a United Nations Tribunal.\n*2011 – Russian cruise ship Bulgaria sinks in Volga near Syukeyevo, Tatarstan, causing 122 deaths.\n*2017 - Iraqi Civil War: Mosul is declared fully liberated from the Islamic State of Iraq and the Levant.\n\nBirths\n\n*1419 – Emperor Go-Hanazono of Japan (d. 1471)\n*1451 – James III of Scotland (d. 1488)\n*1501 – Cho Shik, Korean poet and scholar (d. 1572)\n*1509 – John Calvin, French pastor and theologian (d. 1564)\n*1515 – Francisco de Toledo, Viceroy of Peru (d. 1582)\n*1517 – Odet de Coligny, French cardinal (d. 1571)\n*1533 – Antonio Possevino, Italian diplomat (d. 1611)\n*1592 – Pierre d'Hozier, French genealogist and historian (d. 1660)\n*1614 – Arthur Annesley, 1st Earl of Anglesey, Irish-English politician (d. 1686)\n*1625 – Jean Herauld Gourville, French adventurer (d. 1703)\n*1638 – David Teniers III, Flemish painter (d. 1685)\n*1666 – John Ernest Grabe, German theologian and academic (d. 1711)\n*1682 – Roger Cotes, English mathematician and astronomer (d. 1716)\n*1723 – William Blackstone, English lawyer, judge, and politician (d. 1780)\n*1724 – Eva Ekeblad, Swedish noble and agronomist (d. 1786)\n*1792 – George M. Dallas, American lawyer and politician, 11th Vice President of the United States (d. 1864)\n*1802 – Robert Chambers, Scottish geologist and publisher, co-founded Chambers Harrap (d. 1871)\n*1804 – Emma Smith, American religious leader (d. 1879)\n*1809 – Friedrich August von Quenstedt, German geologist and palaeontologist (d. 1889)\n*1823 – Louis-Napoléon Casault, Canadian lawyer, judge, and politician (d. 1908)\n*1830 – Camille Pissarro, Danish-French painter (d. 1903)\n*1832 – Alvan Graham Clark, American astronomer (d. 1897)\n*1834 – James Abbott McNeill Whistler, American-English painter and illustrator (d. 1903)\n*1835 – Henryk Wieniawski, Polish violinist and composer (d. 1880)\n*1839 – Adolphus Busch, German brewer, co-founded Anheuser-Busch (d. 1913)\n*1856 – Nikola Tesla, Serbian-American physicist and engineer (d. 1943)\n*1864 – Austin Chapman, Australian businessman and politician, 4th Australian Minister for Defence (d. 1926)\n*1867 – Prince Maximilian of Baden (d. 1929)\n*1871 – Marcel Proust, French novelist, critic, and essayist (d. 1922)\n*1874 – Sergey Konenkov, Russian sculptor (d. 1971)\n*1875 – Mary McLeod Bethune, American educator and activist (d. 1955)\n*1877 – Ernst Bresslau, German zoologist (d. 1935)\n*1878 – Otto Freundlich, German painter and sculptor (d. 1943)\n*1882 – Ima Hogg, American society leader, philanthropist, patron and collector of the arts (d. 1975)\n*1883 – Johannes Blaskowitz, German general (d. 1948)\n*  1883   – Hugo Raudsepp, Estonian playwright and politician (d. 1952)\n*1888 – Giorgio de Chirico, Greek-Italian painter and set designer (d. 1978)\n*  1888   – Toyohiko Kagawa, Japanese evangelist, author, and activist (d. 1960)\n*1891 – Edith Quimby, American medical researcher and physicist (d. 1982)\n*1894 – Jimmy McHugh, American composer (d. 1969)\n*1895 – Carl Orff, German composer and educator (d. 1982)\n*1896 – Thérèse Casgrain, Canadian politician (d. 1981)\n*1897 – Legs Diamond, American gangster (d. 1931)\n*  1897   – Karl Plagge, German general and engineer (d. 1957)\n*1898 – Renée Björling, Swedish actress (d. 1975) \n*1899 – John Gilbert, American actor, director, and screenwriter (d. 1936)\n*  1899   – Heiri Suter, Swiss cyclist (d. 1978)\n*1900 – Mitchell Parish, Lithuanian-American songwriter (d. 1993)\n*  1900   – Sampson Sievers, Russian monk and mystic (d. 1979)\n*1902 – Kurt Alder, German chemist and academic, Nobel Prize laureate (d. 1958)\n*  1902   – Nicolás Guillén, Cuban poet, journalist, and activist (d. 1989)\n*1903 – Werner Best, German SS officer and jurist (d. 1989)\n*  1903   – John Wyndham, English soldier and author (d. 1969)\n*1904 – Lili Damita, French-American actress (d. 1994)\n*1905 – Mildred Benson, American journalist and author (d. 2002)\n*  1905   – Thomas Gomez, American actor (d. 1971)\n*  1905   – Wolfram Sievers, German physician (d. 1948)\n*1907 – Blind Boy Fuller, American singer and guitarist (d. 1941)\n*1909 – Donald Sinclair, English lieutenant and businessman (d. 1981)\n*1911 – Terry-Thomas, English comedian and character actor (d. 1990)\n*  1911   – Cootie Williams, American trumpeter and bandleader (d. 1985) \n*1913 – Salvador Espriu, Spanish author, poet, and playwright (d. 1985)\n*1914 – Joe Shuster, Canadian-American illustrator, co-created Superman (d. 1992)\n*  1914   – Rempo Urip, Indonesian film director\n*1916 – Judith Jasmin, Canadian journalist (d. 1972)\n*1917 – Hugh Alexander, American baseball player and scout (d. 2000)\n*  1917   – Reg Smythe, English cartoonist (d. 1998)\n*1918 – James Aldridge, Australian-English journalist and author (d. 2015)\n*  1918   – Chuck Stevens, American major baseball\n*  1918   – Frank L. Lambert, Professor Emeritus of Chemistry at Occidental College\n*  1918   – Fred Wacker, American race driver and engineer (d. 1998)\n*1919 – Pierre Gamarra, French author, poet, and critic (d. 2009)\n*  1919   – Ian Wallace, English actor and singer (d. 2009)\n*1920 – David Brinkley, American journalist (d. 2003)\n*  1920   – Owen Chamberlain, American physicist and academic, Nobel Prize laureate (d. 2006)\n*  1920   – Cyril Grant, English footballer (d. 2002)\n*1921 – Harvey Ball, American illustrator, created the Smiley (d. 2001)\n*  1921   – Jeff Donnell, American actress (d. 1988)\n*  1921   – John K. Singlaub, U.S Army Major General\n*  1921   – Eunice Kennedy Shriver, American activist, co-founded the Special Olympics (d. 2009)\n*1922 – Jean Kerr, American author and playwright (d. 2003)\n*  1922   – Herb McKenley, Jamaican sprinter (d. 2007)\n*  1922   – Jake LaMotta, American boxer and actor (d. 2017)\n*1923 – John Bradley, American soldier (d. 1994)\n*  1923   – Suzanne Cloutier, Canadian actress and producer (d. 2003)\n*  1923   – G. A. Kulkarni, Indian author and academic (d. 1987)\n*1924 – Johnny Bach, American basketball player and coach (d. 2016)\n*  1924   – Bobo Brazil, American wrestler (d. 1998)\n*1925 – Mahathir Mohamad, Malaysian physician and politician, 4th Prime Minister of Malaysia \n*1926 – Carleton Carpenter, American actor, magician, songwriter, and novelist\n*  1926   – Fred Gwynne, American actor (d. 1993)\n*1927 – Grigory Barenblatt, Russian mathematician and academic\n*  1927   – David Dinkins, American soldier and politician, 106th Mayor of New York City\n*  1927   – William Smithers, American actor\n*1928 – Don Bolles, American investigative reporter (d. 1976)\n*  1928   – Bernard Buffet, French painter and illustrator (d. 1999)\n*  1928   – Alejandro de Tomaso, Argentinian-Italian race car driver and businessman, founded De Tomaso (d. 2003)\n*  1928   – Moshe Greenberg, American-Israeli rabbi and scholar (d. 2010)\n*  1928   – John Glenn, American baseball player\n*1929 – Winnie Ewing, Scottish lawyer and politician\n*  1929   – George Clayton Johnson, American author and screenwriter (d. 2015)\n*  1929   – Moe Norman, Canadian golfer (d. 2004)\n*  1929   – José Vicente Rangel, Venezuelan politician; 21st Vice President of Venezuela\n*1930 – Josephine Veasey, English soprano and actress\n*1931 – Nick Adams, American actor and screenwriter (d. 1968)\n*  1931   – Jerry Herman, American composer and songwriter\n*  1931   – Julian May, American author\n*  1931   – Alice Munro, Canadian short story writer, Nobel Prize laureate\n*1932 – Carlo Maria Abate, Italian race car driver\n*  1932   – Neile Adams, Filipino-American actress, singer and dancer \n*1933 – Jumpin' Gene Simmons, American rockabilly singer-songwriter (d. 2006)\n*  1933   – C.K. Yang, Taiwanese decathlete and pole vaulter (d. 2007)\n*1934 – Jerry Nelson, American puppeteer and voice actor (d. 2012)\n*1935 – Tura Satana, American actress and dancer (d. 2011)\n*  1935   – Wilson Tuckey, Australian politician\n*  1935   – Wilson Whineray, New Zealand rugby player and businessman (d. 2012)\n*1936 – Herbert Boyer, American businessman, co-founded Genentech\n*  1936   – Tunne Kelam, Estonian journalist and politician\n*1937 – Edwards Barham, American farmer and politician (d. 2014)\n*  1937   – Gun Svensson, Swedish politician\n*1938 – Paul Andreu, French architect\n*  1938   – Lee Morgan, American trumpet player and composer (d. 1972)\n*1939 – Phil Kelly, Irish-English footballer and manager (d. 2012)\n*  1939   – Ahmet Taner Kışlalı, Turkish political scientist, journalist and educator (d. 1999)\n*1939 – Mavis Staples, American singer \n*1940 – Meghnad Desai, Baron Desai, Indian-English economist and politician\n*  1940   – Helen Donath, American soprano and actress\n*  1940   – Brian Priestley, English pianist and composer \n*  1940   – Keith Stackpole, Australian cricketer\n*1941 – Jake Eberts, Canadian film producer (d. 2012)\n*  1941   – David G. Hartwell, American anthologist, author, and critic (d. 2016)\n*  1941   – Robert Pine, American actor and director\n*  1941   – Ian Whitcomb, English singer-songwriter, producer, and actor\n*1942 – Ronnie James Dio, American singer-songwriter and producer (d. 2010)\n*  1942   – Pyotr Klimuk, Belarusian general, pilot, and astronaut \n*  1942   – Sixto Rodriguez, American singer-songwriter and guitarist\n*  1942   – Lopo do Nascimento, Angolan politician; 1st Prime Minister of Angola\n*1943 – Arthur Ashe, American tennis player and journalist (d. 1993)\n*  1943   – Inonge Mbikusita-Lewanika, Zambian politician\n*  1943   – Jerry Miller, American singer-songwriter and guitarist \n*1944 – Mick Grant, English racing motorcyclist\n*  1944   – Norman Hammond, English archaeologist and academic\n*1945 – Ron Glass, American actor (d. 2016)\n*  1945   – Hal McRae, American baseball player and manager\n*  1945   – John Motson, English sportscaster\n*  1945   – Jean-Marie Poiré, French director, producer, and screenwriter\n*  1945   – Virginia Wade, English tennis player and sportscaster\n*1946 – Jean-Pierre Jarier, French racing driver\n*1946 － Chin Han, Taiwanese actor\n*1947 – Arlo Guthrie, American singer-songwriter, producer, and actor\n*1948 – Ronnie Cutrone, American painter (d. 2013)\n*  1948   – Chico Resch, Canadian ice hockey player and sportscaster\n*  1948   – Natalya Sedykh, Russian figure skater, ballet dancer, actor\n*1949 – Anna Czerwińska, Polish mountaineer and author\n*  1949   – Sunil Gavaskar, Indian cricketer and sportscaster\n*  1949   – Greg Kihn, American singer-songwriter and guitarist \n*  1949   – John Whitehead, American singer-songwriter and producer (d. 2004)\n*1950 – Tony Baldry, English colonel, lawyer, and politician, British Minister of State for Agriculture\n*  1950   – Prokopis Pavlopoulos, President of Greece, Greek lawyer and politician, Greek Minister for the Interior\n*1951 – Cheryl Wheeler, American singer-songwriter and guitarist \n*1952 – Kim Mitchell, Canadian singer-songwriter and guitarist \n*  1952   – Peter van Heemst, Dutch politician\n*1953 – Rik Emmett, Canadian singer-songwriter, guitarist, and producer \n*1954 – Tommy Bowden, American football player and coach\n*  1954   – Andre Dawson, American baseball player\n*  1954   – Neil Tennant, English singer-songwriter and keyboard player \n*1955 – Nic Dakin, English educator and politician\n*1956 – Tom McClintock, American lawyer and politician\n*1957 – Derry Grehan, Canadian rock guitarist and songwriter (Honeymoon Suite) \n*1958 – Béla Fleck, American banjo player and songwriter\n*  1958   – Fiona Shaw, Irish actress and director\n*1959 – Ellen Kuras, American director and cinematographer\n*  1959   – Sandy West, American singer-songwriter and drummer (d. 2006)\n*  1961 － Jacky Cheung, Hong Kong singer, film actor\n*1963 – Ian Lougher, Welsh motorcycle racer\n*1964 – Martin Laurendeau, Canadian tennis player and coach\n*  1964   – Urban Meyer, American football player and coach\n*  1964   – Wilfried Peeters, Belgian cyclist\n*1965 – Scott McCarron, American golfer\n*  1965   – Ken Mellons, American singer-songwriter and guitarist \n*1966 – Clive Efford, English politician\n*  1966   – Johnny Grunge, American wrestler (d. 2006)\n*  1966   – Christian Stangl, Austrian skier and mountaineer\n*  1966   – Anna Bråkenhielm, Swedish business executive\n*1967 – Rebekah Del Rio, American singer-songwriter\n*  1967   – Gillian Tett, English journalist and author\n*  1967   – John Yoo, South Korean-American lawyer, author, and educator \n*1969 – Marty Cordova, American baseball player\n*  1969   – Gale Harold, American actor\n*1970 – Gary LeVox, American singer-songwriter \n*  1970   – Jason Orange, English singer-songwriter and dancer \n*1971 – Adam Foote, Canadian ice hockey player\n*  1971   – Gregory Goodridge, Barbadian footballer and coach\n*1972 – Peter Serafinowicz, English actor\n*  1972   – Sofía Vergara, Colombian-American actress and producer\n*  1972   – Tilo Wolff, German-Swiss singer-songwriter, pianist, and producer \n*1974 – Imelda May, Irish singer-songwriter, musician, and producer\n*1975 – Andrew Firestone, American businessman\n*  1975   – Brendan Gaughan, American race car driver\n*  1975   – Alain Nasreddine, Canadian ice hockey player and coach\n*  1975   – Stefán Karl Stefánsson, Icelandic actor\n*  1975   – Richard Westbrook, English race car driver\n*1976 – Edmílson, Brazilian footballer\n*  1976   – Elijah Blue Allman, American singer and guitarist \n*  1976   – Ludovic Giuly, French footballer\n*  1976   – Adrian Grenier, American actor, producer, and screenwriter\n*  1976   – Brendon Lade, Australian footballer and coach\n*  1976   – Lars Ricken, German footballer\n*1977 – Chiwetel Ejiofor, English actor \n*1979 – Mvondo Atangana, Cameroon footballer\n*1979 － Gong Yoo, Korean actor\n*1980 – Alejandro Millán, Mexican singer-songwriter and keyboard player \n*  1980   – Adam Petty, American race car driver (d. 2000)\n*  1980   – Claudia Leitte, Brazilian singer-songwriter\n*  1980   – James Rolfe, American actor, director, and producer\n*  1980   – Jessica Simpson, American singer-songwriter, actress, and fashion designer\n*1981 – Aleksandar Tunchev, Bulgarian footballer\n*1982 – Alex Arrowsmith, American guitarist and producer \n*  1982   – Juliya Chernetsky, Ukrainian-American television host\n*  1982   – Sebastian Mila, Polish footballer\n*  1982   – Jeffrey Walker, Australian actor and director \n*1983 – Giuseppe De Feudis, Italian footballer\n*  1983   – Matthew Egan, Australian footballer\n*  1983   – Gabi, Spanish footballer\n*  1983 － Kim Hee-chul, Korean entertainer, member of Super Junior\n*  1983   – Joelson José Inácio, Brazilian footballer\n*  1983   – Doug Kramer, Filipino basketball player\n*  1983   – Anthony Watmough, Australian rugby player\n*1984 – Nikolaos Mitrou, Greek footballer\n*1985 – Park Chu-young, South Korean footballer\n*  1985   – B. J. Crombeen, American ice hockey player\n*  1985   – Mario Gómez, German footballer\n*1988 – Antonio Brown, American football player\n*  1988   – Heather Hemmens, American actress, director, and producer\n*  1988   – Sarah Walker, New Zealand BMX rider\n*1990 – Adam Reynolds, Australian rugby league player\n*  1990   – Chiyonokuni Toshiki, Japanese sumo wrestler\n*1991 – Daishōmaru Shōgo, Japanese sumo wrestler\n*2001 – Isabela Moner, American actress\n\nDeaths\n\n* 138 – Hadrian, Roman emperor (b. 76)\n* 645 – Soga no Iruka, Japanese politician\n* 649 – Tai Zong, Chinese emperor (b. 598)\n* 772 – Amalberga of Temse, Frankish noblewoman\n* 831 – Zubaidah bint Ja`far, Abbasid Princess\n* 994 – Leopold I, margrave of Austria\n*1086 – Canute IV, king of Denmark (b. 1043)\n*1103 – Eric I, king of Denmark (b. 1060)\n*1290 – Ladislaus IV, king of Hungaria (b. 1262)\n*1460 – Humphrey Stafford, 1st Duke of Buckingham, English commander and politician, Lord High Constable of England (b. 1402)\n*  1460   – John Talbot, 2nd Earl of Shrewsbury, English nobleman (b. c. 1413)\n*1461 – Thomas, king of Bosnia (b. 1411)\n*1473 – James II, king of Cyprus\n*1480 – René of Anjou, French nobleman (b. 1400)\n*1510 – Catherine Cornaro, queen of Cyprus (b. 1454)\n*1559 – Henry II, king of France (b. 1519)\n*1584 – William I, Dutch nobleman (b. 1533)\n*1590 – Charles II, archduke of Austria (b. 1540)\n*1594 – Paolo Bellasio, Italian organist and composer (b. 1554)\n*1603 – Joan Terès i Borrull, Spanish archbishop and academic (b. 1538)\n*1621 – Charles Bonaventure de Longueval, French commander (b. 1571)\n*1653 – Gabriel Naudé, French librarian and scholar (b. 1600)\n*1680 – Louis Moréri, French priest and scholar (b. 1643)\n*1683 – François Eudes de Mézeray, French historian and author (b. 1610)\n*1686 – John Fell, English bishop and academic (b. 1625)\n*1776 – Richard Peters, English lawyer and minister (b. 1704)\n*1794 – Gaspard de Bernard de Marigny, French general (d. 1754)\n*1806 – George Stubbs, English painter and academic (b. 1724)\n*1851 – Louis Daguerre, French photographer and physicist, invented the daguerreotype (b. 1787)\n*1863 – Clement Clarke Moore, American author and educator (b. 1779)\n*1881 – Georg Hermann Nicolai, German architect and academic (b. 1812)\n*1884 – Paul Morphy, American chess player (b. 1837)\n*1908 – Phoebe Knapp, American organist and composer (b. 1839)\n*1915 – Hendrik Willem Mesdag, Dutch painter (b. 1831)\n*1920 – John Fisher, 1st Baron Fisher, British admiral (b. 1841)\n*1929 – Ève Lavallière, French actress (b. 1866) \n*1941 – Jelly Roll Morton, American pianist, composer, and bandleader (b. 1890)\n*1950 – Richard Maury, American-Argentinian engineer (b. 1882)\n*1952 – Rued Langgaard, Danish organist and composer (b. 1893)\n*1954 – Calogero Vizzini, Italian mob boss (b. 1877)\n*1956 – Joe Giard, American baseball player (b. 1898)\n*1960 – Sæbjørn Buttedahl, Norwegian actor and sculptor (b. 1876)\n*1962 – Yehuda Leib Maimon, Israeli rabbi and politician (b. 1875)\n*1963 – Teddy Wakelam, English rugby player and sportscaster (b. 1893)\n*1970 – Bjarni Benediktsson, Icelandic academic and politician, 13th Prime Minister of Iceland (b. 1908)\n*1971 – Laurent Dauthuille, French boxer (b. 1924)\n*  1971   – George Kenner, German-American painter and illustrator (b. 1888)\n*1972 – Lovie Austin, American pianist, composer, and bandleader (b. 1887)\n*1978 – John D. Rockefeller III, American businessman and philanthropist, founded the Asia Society (b. 1906)\n*1979 – Arthur Fiedler, American conductor (b. 1894)\n*1980 – Joseph Krumgold, American author and screenwriter (b. 1908)\n*1985 – Fernando Pereira, Dutch photographer (b. 1950)\n*1986 – Tadeusz Piotrowski, Polish mountaineer and author (b. 1940)\n*1987 – John Hammond, American record producer, critic, and activist (b. 1910)\n*1989 – Mel Blanc, American voice actor (b. 1908)\n*1993 – Ruth Krauss, American author and poet (b. 1901)\n*  1993   – Sam Rolfe, American screenwriter and producer (b. 1924)\n*1995 – Mehmet Ali Aybar, Turkish lawyer and politician (b. 1908)\n*1996 – Eno Raud, Estonian author (b. 1928)\n*2000 – Vakkom Majeed, Indian journalist and politician (b. 1909)\n*2002 – Jean-Pierre Côté, Canadian politician, 23rd Lieutenant Governor of Quebec (b. 1926)\n*  2002   – Evangelos Florakis, Greek general (b. 1943)\n*  2002   – Laurence Janifer, American author (b. 1933)\n*2003 – Winston Graham, English author (b. 1908)\n*  2003   – Hartley Shawcross, Baron Shawcross, German-English lawyer and politician, Attorney General for England and Wales (b. 1902)\n*2004 – Pati Behrs, Russian-American ballerina and actress (b. 1922)\n*2005 – A. J. Quinnell, English author (b. 1940)\n*2006 – Shamil Basayev, Chechen terrorist rebel leader (b. 1965)\n*2007 – Doug Marlette, American cartoonist and author (b. 1949)\n*2008 – Hiroaki Aoki, Japanese-American wrestler and businessman, founded Benihana (b. 1938)\n*  2008   – Mike Souchak, American golfer (b. 1927)\n*2011 – Pierrette Alarie, Canadian soprano and educator (b. 1921)\n*  2011   – Roland Petit, French dancer and choreographer (b. 1924)\n*2012 – Dolphy, Filipino actor, singer, and producer (b. 1928)\n*  2012   – Peter Kyros, American lawyer and politician (b. 1925)\n*  2012   – Berthe Meijer, German-Dutch journalist and author (b. 1938) \n*  2012   – Fritz Langanke, German lieutenant (b. 1919)\n*  2012   – Viktor Suslin, Russian-German composer (b. 1942)\n*2013 – Philip Caldwell, American businessman (b. 1920)\n*  2013   – Józef Gara, Polish poet and linguist (b. 1929)\n*  2013   – Concha García Campoy, Spanish journalist (b. 1958)\n*  2013   – Caroline Duby Glassman, American lawyer and jurist (b. 1922)\n*  2013   – Ku Ok-hee, South Korean golfer (b. 1956)\n*  2013   – Gokulananda Mahapatra, Indian author and academic (b. 1922)\n*2014 – Robert C. Broomfield, American lawyer and judge (b. 1933)\n*  2014   – Juozas Kazickas, Lithuanian-American businessman and philanthropist (b. 1918)\n*  2014   – Paul G. Risser, American ecologist and academic (b. 1939)\n*  2014   – Zohra Sehgal, Indian actress, dancer, and choreographer (b. 1912)\n*  2014   – Gloria Schweigerdt, American baseball player (b. 1934)\n*2015 – Roger Rees, Welsh-American actor and director (b. 1944)\n*  2015   – Omar Sharif, Egyptian actor (b. 1932)\n*  2015   – Jon Vickers, Canadian tenor (b. 1926)\n*2016 – Katharina Focke, German politician (b. 1922)\n\nHolidays and observances\n\n* Armed Forces Day (Mauritania)\n* Christian feast day:\n** Amalberga of Maubeuge  \n** Canute IV of Denmark\n** Rufina and Secunda\n** Veronica Giuliani\n** Seven Brothers\n** July 10 (Eastern Orthodox liturgics)\n* Independence Day (Bahamas), celebrates the independence of the Bahamas from the United Kingdom in 1973.\n* Nikola Tesla Day\n* Silence Day (Followers of Meher Baba)\n* Statehood Day (Wyoming). July 10. http://en.wikipedia.org/?curid=15809."
  }
}
