{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18490",
  "eid" : "332e9fb0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778595115,
  "textBody" : "Larissa () is the capital and largest city of the Thessaly region, the fifth-most populous in Greece and capital of the Larissa regional unit. It is a principal agricultural centre and a national transport hub, linked by road and rail with the port of Volos, the cities of Thessaloniki and Athens. Larissa, within its municipality, has 162,591 inhabitants, while the regional unit of Larissa reached a population of 284,325 (in 2011).  The urban area of the city, although mostly contained within the Larissa municipality, also includes the communities of Giannouli, Platykampos, Nikaia, Terpsithea and several other suburban settlements, bringing the wider urban area population of the city to about 174,012 inhabitants and extends over an area of .\n\nLegend has it that Achilles was born here. Hippocrates, the \"Father of Medicine\", died here. Today, Larissa is an important commercial, agricultural and industrial centre of Greece.\n\nGeography\n\nThere are a number of highways including E75 and the main railway from Athens to Thessaloniki (Salonika) crossing through Thessaly. The region is directly linked to the rest of Europe through the International Airport of Central Greece located in Nea Anchialos a short distance from Larissa. Larissa lies on the river Pineios.\n\nThe municipality Larissa has an area of , the municipal unit Larissa has an area of , and the community Larissa has an area of .\n\nThe Larissa Chasma, a deep gash in the surface of Dione, a natural satellite of Saturn, was named after Larissa.\n\nClimate \n\nThe climate of Larissa is transitional. The winter is cold and wet, and some snowstorms may occur. The summer is hot, and temperatures of 40 °C may occur. Thunderstorms or heavy rain may cause agricultural damage. Larissa receives 450 mm of rain per year.\n\nMythology\n\nAccording to Greek mythology it is said that the city was founded by Acrisius, who was killed accidentally by his grandson, Perseus.Stephanus Byzantius, s.v. There lived Peleus, the hero beloved by the gods, and his son Achilles.\n\nIn mythology, the nymph Larissa was a daughter of the primordial man Pelasgus.Pausanias, 2.24.1\n\nThe city of Larissa is mentioned in Book II of Iliad by Homer:\n\nHippothous led the tribes of Pelasgian spearsmen, who dwelt in fertile Larissa- Hippothous,and Pylaeus of the race of Mars, two sons of the Pelasgian Lethus, son of Teutamus.Hippothous led the tribes of Pelasgian spearsmen, who dwelt in fertile Larissa- Hippothous, and Pylaeus of the race of Mars, two sons of the Pelasgian Lethus, son of Teutamus. [http://classics.mit.edu/Homer/iliad.2.ii.html]\n\nIn this paragraph, Homer shows that the Pelasgians, Trojan allies, used to live in the city of Larissa. It is likely that this city of Larissa was different to the city that was the birthplace of Achilles.  The Larissa that features as a Trojan ally in the Iliad was likely to be located in the Troad, on the other side of the Aegean Sea.\n\nHistory\n\nAntiquity\n\nTraces of Paleolithic human settlement have been recovered from the area, but it was peripheral to areas of advanced culture.Curtis Runnels and Tjeerd H. van Andel. \"The Lower and Middle Paleolithic of Thessaly, Greece\" Journal of Field Archaeology 20.3 (Autumn 1993:299–317) summarises the survey carried out in June 1991. The area around Larissa was extremely fruitful; it was agriculturally important and in antiquity was known for its horses.\n\nThe name Larissa (Λάρισα Lárīsa) is in origin a Pelasgian (pre-Greek) word for \"fortress\". There were many ancient Greek cities with this name.\nThe name of Thessalian Larissa is first recorded in connection with the aristocratic Aleuadai family.\"The city and the plain around it were settled in prehistoric times, and its name must be early, but it is first mentioned in connection with the(Richard Stillwell, William L. MacDonald, Marian Holland McAllister, eds., The Princeton Encyclopedia of Classical Sites (Princeton University Press) 1976, 's.v. \"Larissa, or Larisa, or Pelasgis, Thessaly\").\n\nLarissa is thought to be where the famous Greek physician Hippocrates and the famous philosopher Gorgias of Leontini died.\n\nWhen Larissa ceased minting the federal coins it shared with other Thessalian towns and adopted its own coinage in the late 5th century BC, it chose local types for its coins. The obverse depicted the nymph of the local spring,  Larissa, for whom the town was named; probably the choice was inspired by the famous coins of Kimon depicting the Syracusan nymph Arethusa. The reverse depicted a horse in various poses. The horse was an appropriate symbol of Thessaly, a land of plains, which was well known for its horses. Usually there is a male figure; he should perhaps be seen as the eponymous hero of the Thessalians, Thessalos, who is probably also to be identified on many of the earlier, federal coins of Thessaly.\n\nLarissa, sometimes written Larisa on ancient coins and inscriptions, is near the site of the Homeric Argissa. It appears in early times, when Thessaly was mainly governed by a few aristocratic families, as an important city under the rule of the Aleuadae, whose authority extended over the whole district of Pelasgiotis. This powerful family possessed for many generations before 369 BC the privilege of furnishing the tagus, the local term for the strategos of the combined Thessalian forces. The principal rivals of the Aleuadae were the Scopadae of Crannon, the remains of which are about 14 miles south west.\n\nLarissa was indeed the birthplace of Meno, who thus became, along with Xenophon and a few others, one of the generals leading several thousands Greeks from various places, in the ill-fated expedition of 401 (retold in Xenophon's Anabasis) meant to help Cyrus the Younger, son of Darius II, king of Persia, overthrow his elder brother Artaxerxes II and take over the throne of Persia (Meno is featured in Plato's dialogue bearing his name, in which Socrates uses the example of \"the way to Larissa\" to help explain Meno the difference between true opinion and science (Meno, 97a–c) ; this \"way to Larissa\" might well be on the part of Socrates an attempt to call to Meno's mind a \"way home\", understood as the way toward one's true and \"eternal\" home reached only at death, that each man is supposed to seek in his life).\n\nThe constitution of the town was democratic, which explains why it sided with Athens in the Peloponnesian War. In the neighbourhood of Larissa was celebrated a festival which recalled the Roman Saturnalia, and at which the slaves were waited on by their masters. As the chief city of ancient Thessaly, Larissa was taken by the Thebans and later directly annexed by Philip II of Macedon in 344. It remained under Macedonian control afterwards, except for a brief period when Demetrius Poliorcetes captured it in 302 BC.\n\nIt was in Larissa that Philip V of Macedon signed in 197 BC a treaty with the Romans after his defeat at the Battle of Cynoscephalae, and it was there also that Antiochus III the Great, won a great victory in 192 BC. In 196 BC Larissa became an ally of Rome and was the headquarters of the Thessalian League.\n\nLarissa is frequently mentioned in connection with the Roman civil wars which preceded the establishment of the Roman Empire and Pompey sought refuge there after the defeat of Pharsalus.\n\nMiddle Ages and Ottoman period\n\nLarissa was sacked by the Ostrogoths in the late 5th century, and rebuilt under the Byzantine emperor Justinian I.\n\nIn the 8th century, the city became the metropolis of the theme of Hellas. The city was captured in 986 by Tsar Samuel of Bulgaria, who carried off the relics of its patron saint, Saint Achilleios, to Prespa. It was again unsuccessfully besieged by the Italo-Normans under Bohemond I in 1082/3.\n\nAfter the Fourth Crusade, the King of Thessalonica, Boniface of Montferrat, gave the city to Lombard barons, but they launched a rebellion in 1209 that had to be subdued by the Latin Emperor Henry of Flanders himself. The city was recovered by Epirus soon after.\n\nIt was conquered by the Ottoman Empire in 1386/87 and again in the 1390s, but only came under permanent Ottoman control in 1423, by Turahan Bey. Under Ottoman rule, the city was known as Yeni-şehir i-Fenari, \"new citadel\". As the chief town and military base of Ottoman Thessaly, Larissa was a predominantly Muslim city. During Ottoman rule the administration of the Metropolis of Larissa was transferred to nearby Trikala where it remained until 1734, when Metropolitan Iakovos II returned the see from Trikala to Larisa and established the present-day metropolis of Larissa and Tyrnavos.\n\nThe town was noted for its trade fair in the 17th and 18th centuries, while the seat of the pasha of Thessaly was also transferred there in 1770. The city remained in Ottoman hands until Thessaly became part of the independent Kingdom of Greece in 1881, except for a period where Ottoman forces re-occupied it during the Greco-Turkish War of 1897.\n\nIn the 19th century, there was a small village in the outskirts of town very unusually inhabited by Africans from Sudan, a curious remnant of the forces collected by Ali Pasha. In the 19th century, the town produced leather, cotton, silk and tobacco. Fevers and agues were prevalent owing to bad drainage and the overflowing of the river; and the death rate was higher than the birth rate. It was also renowned for the minarets of its mosques (four of which were still in use in the early part of the 20th century) and the Muslim burial grounds.\n\nModern Greek era\n\nLarissa was the headquarters of Hursid Pasha during the Greek War of Independence. In 1881, the city, along with the rest of Thessaly, was incorporated into the Kingdom of Greece. A considerable portion of the Turkish population emigrated into the Ottoman Empire at that point. During the Greco-Turkish War of 1897, the city was the headquarters of Greek Crown Prince Constantine. The flight of the Greek army from here to Farsala took place on April 23, 1897. Turkish troops entered the city two days later. After a treaty for peace was signed, they withdrew and Larissa remained permanently in Greece. This was followed by a further exodus of Turks in 1898.\n\nDuring the Axis Occupation of the country, the Jewish community of the city (dated back to 2nd BC, see Romaniotes) suffered heavy losses. Today in the city there is a Holocaust memorial and a synagogue.\n\nLarissa Nowadays \n\nToday Larissa is the fifth largest Greek city with many squares, taverns and cafes. It has three public hospitals with one being military hospital. It hosts the Hellenic Air Force Headquarters and NATO Headquarters in Greece. It has a School of Medicine and the School of Biochemistry – Biotechnology the third largest in the country Institute of Technology. It occupies the first place among Greek cities into green coverage rate per square-metre urban space. It also has two public libraries and three museums.http://www.larissa-dimos.gr/\n\nEcclesiastical history\n\nChristianity penetrated early to Larissa, though its first bishop is recorded only in 325 at the Council of Nicaea. St. Achillius of the 4th century, is celebrated for his miracles. Le QuienOriens Christianus II, 103–112. cites twenty-nine bishops from the fourth to the 18th centuries; the most famous is Jeremias II, who occupied the see until 733, when the Emperor Leo III the Isaurian transferred it from the jurisdiction of the Pope of Rome to the Patriarchate of Constantinople. In the first years of the 10th century it had ten suffragan sees;Heinrich Gelzer, \"Ungedruckte. . .Texte der Notitiae episcopatuum\", Munich, 1900, 557. subsequently the number increased and about the year 1175 under the Emperor Manuel I Comnenus, it reached twenty-eight.Parthey, Hieroclis Synecdemus, Berlin, 1866, 120. At the close of the 15th century, under the Turkish domination, there were only ten suffragan sees,Gelzer, op. cit., 635. which gradually grew less and finally disappeared.\n\nLarissa is an Orthodox Metropolis of the Church of Greece. It was briefly a Latin archbishopric in the early 13th century, and remains a Latin Metropolitan (top-ranking) titular see of the Roman Catholic Church, which must not be confused with the Latin episcopal (low-ranking) titular see Larissa in Syria.\n\nAdministration\n\nThe municipality Larissa was formed at the 2011 local government reform by the merger of the following 3 former municipalities, that became municipal units:[http://www.kedke.gr/uploads2010/FEKB129211082010_kallikratis.pdf Kallikratis law] Greece Ministry of Interior \n*Giannouli\n*Koilada\n*Larissa\n\nDistricts \n\nThe municipal unit of Larissa is divided into four city-districts or municipal communities (29 city areas) plus 2 suburban communities (Amphithea and Koulourion). The municipality includes also the Community of Terpsithèa (with the suburban community of Argyssa).\n\n1st Municipal District\n(pop. 26,035)\n# Papastàvrou\n# Saint Athanàsios\n# Alkazàr\n# Hippocrates-Pèra\n# Potamòpolis\n# Philippòpolis\n# Livadàki\n# Saint Thomas\n# Saint Paraskevi-Mezourlo\n# Neàpolis\n\n2nd Municipal District\n(pop. 41,816)\n# Saint Achellios\n# Saint Nikòlaos\n# Ambelòkipoi\n# Saints Sarànta\n# Saint Konstantinos\n# Stathmòs\n\n3rd Municipal District\n(pop. 30,121)\n# Lachanòkipoi\n# Nèa Smyrne-Kamynia\n# Kalyvia-Saint Marina\n# Saint Geòrgios\n# Anatoli\n# Koulouri\n# Amphithèa\n\n4th Municipal District\n(pop. 26,814)\n# Charavgi-Toumba-OKE\n# Pyrovolikà-Pharos\n# Avèrof-Sèkfo\n# Nèa Politia\n# Epiròtika\n# Anthoupolis\n# Neràida\n# Kàmpos\n\nCommunity of Terpsithèa\n(pop. 1,290)\n# Terpsithèa\n# Argyssa\n\nFrom 1 January 2011, in accordance with the Kallikratis Plan (new administrative division of Greece), the new municipality of Larissa includes also the former municipalities of Giannouli and Koilada.\n\nProvince\n\nThe province of Larissa () was one of the provinces of the Larissa Prefecture. Its territory corresponded with that of the current municipalities Larissa (except the municipal unit Giannouli) and Tempi (except the municipal units Gonnoi and Kato Olympos).    It was abolished in 2006.\n\nCulture\n\n*[http://www.larissa-dimos.gr/new/index.asp?pid3&sub\n3 Municipal Odeon of Larissa]\n*[https://web.archive.org/web/20130917175417/http://www.nea-acropoli-larisas.gr/larisamylospappa Mylos of Pappa Theatre]\n*[http://www.thessaliko-theatre.gr/ Thessalian Theatre – Municipal Theatre of Larissa]\n\nArchaeological sites\n\n*[http://www.larissa-theatre.com Ancient Theatre A']\n*[https://web.archive.org/web/20091027012423/http://geocities.com/cgbarbus/ Fortress Hill]\n*Ancient Theatre B'\n*[http://sites.google.com/site/meiosisstudio/Home/projects/funerary-monument-of-hippocrates-in-larissa Hippokrates Monument]\n\nCuisine\n\nLocal specialities:\n\n*Batzina\n*Kelaidi (Κελαηδί)\n*Kreatopita\n*Loukanikopita\n*Melintzanopita\n*Tyropita\n\nMuseums\n\n*[http://odysseus.culture.gr/h/1/eh151.jsp?obj_id=3452 Diachronic Museum of Larissa]\n*[https://web.archive.org/web/20080202093010/http://www.larissa-dimos.gr/larissa/npdd/pinako.shtm Municipal Gallery of Larissa – G.I. Katsigras Museum]\n*[https://web.archive.org/web/20080117122916/http://www.larissa-dimos.gr/larissa/city/laografiko_mouseio.shtm Historical & Folklore Museum of Larissa]\n*Veterinary Military Museum of Larissa\n*Museum of Folklore Society of Larissa\n\nMedia\n\n*TV: Thessalian Radio Television (TRT), Astra TV\n*Press: Eleftheria (newspaper)\n\nTransport\n\nLarissa sits in the middle of the plain of Thessaly, with connections to Motorway A1 and national roads EO3 and EO6.\n*Larissa's Urban Bus System\n*Larissa's Interurban System\n*Larissa Central Railway Station at \n*Mezourlo Freight Railway station at \n*Larissa Airport\n*Larissa Tram (planned)\n\nClose destinations \n\nThe city is in close proximity of many interesting destinations in the region (Mount Olympus, Mount Kissavos, Meteora, Lake Plastira, Pilio, etc.) suitable for daily trips.\n\nSports\n\nThe local football club AEL 1964 FC currently participates in Superleague Greece. The team became Greek champion in 1988 and won the Greek Cup in 1985 and 2007. These titles place AEL among the five most important football clubs in Greece. AEL hosts its home games in the newbuild AEL FC Arena since November 2010, a UEFA 3-star-rated football ground.\nOther important sport venues are the National Sport Center of Larissa (EAK Larissas), which includes the Alcazar Stadium and the Neapoli Indoor Hall.\n\nThe National Sports Center of Larissa can accommodate a number of sports and events (football, basketball, wrestling, swimming, boxing, martial arts, handball, water polo, etc.), while the Sports Hall has hosted important athletic events (the World Youth Championship, the Women's Euroleague Final Four, the Greek Cup Final Four, martial arts events, et.c.) and it is also used for cultural events, such as dance festivals.\n\nHistorical population\n\nNotable people\n\nAncient\n\n*Achilles (mythology)\n*Achillius of Larissa (270–330), patron saint of the city\n*Hippokrates of Kos (460 BC–370 BC), physician, worked and died in Larissa\n*Larissa, mythological nymph from Thessaly\n*Medius (4th century BC), friend of Alexander the Great\n*Philinna (4th century BC), dancer, mother of Philip III Arrhidaeus\n*Philo (1st century BC), philosopher\n\nModern\n\n*Giorgakis Olympios (1772–1821), armatolos\n*Konstantinos Koumas (1777-1836), scholar\n*Theoklitos Farmakidis (1784–1860), scholar, figure of the Modern Greek Enlightenment\n*Moshe Pesach (1869-1955), rabbi\n*Achilleas Tzartzanos (1873–1946), linguist, philologist\n*George Seremetis (1879–1950), lawyer, mayor of Thessaloniki\n*Sotiris Skipis (1881–1952), poet\n*Agenor Asteriades (1898-1977), painter\n*M. Karagatsis (1908–1960), novelist, journalist\n*Eleni Zafeiriou (1916–2004), actress\n*Antonis Vratsanos (1919–2008), resistance figure during WWII\n*Takis Tloupas (1920–2003), photographer\n*Kostas Gousgounis (1931–), porn actor\n*Athena Tacha (1936–), artist\n*Georgios Souflias (1941–), politician\n*Petros Efthimiou (1950–), politician\n*Konstantinos Tzanakoulis (1950–), politician\n*Lakis Lazopoulos (1956–), actor, comedian, script author & director\n*Thanasis Papakonstantinou (1959–), poet, songwriter, singer, musician\n*Kosmas Stratos (1959–), 100m sprinter\n*Georgios Mitsibonas (1962–1997), footballer\n*Vassilis Karapialis (1965–), footballer\n*Ekaterini Voggoli (1970–), discus thrower\n*Dimitris Andrikopoulos (1971–), composer\n*Alexis Georgoulis (1974–), actor\n*Yannis Goumas (1975–), footballer\n*Dimosthenis Dikoudis (1977–), basketball player\n*Nestoras Kommatos (1977–), basketball player\n*Fani Halkia (1979–), hurdler\n*Dimitris Spanoulis (1979–), basketball player\n*Theofanis Gekas (1980–), footballer\n*Vangelis Moras (1981–), footballer\n*Vassilis Spanoulis (1982–), basketball player\n*Giorgos Tsiaras (1982–), basketball player\n*Kostas Chalkias (1974–), footballer\n*Thanasis Deligiannis (1983–), composer\n*Apostolis Totsikas (1983–), actor\n*Vasilios Koutsianikoulis (1988–), footballer\n\nInternational relations\n\nTwin towns — sister cities\n\nLarissa is twinned with:",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Larissa" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18490" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Larissa () is the capital and largest city of the Thessaly region, the fifth-most populous in Greece and capital of the Larissa regional unit. It is a principal agricultural centre and a national transport hub, linked by road and rail with the port of Volos, the cities of Thessaloniki and Athens. Larissa, within its municipality, has 162,591 inhabitants, while the regional unit of Larissa reached a population of 284,325 (in 2011).  The urban area of the city, although mostly contained within the Larissa municipality, also includes the communities of Giannouli, Platykampos, Nikaia, Terpsithea and several other suburban settlements, bringing the wider urban area population of the city to about 174,012 inhabitants and extends over an area of .\n\nLegend has it that Achilles was born here. Hippocrates, the \"Father of Medicine\", died here. Today, Larissa is an important commercial, agricultural and industrial centre of Greece.\n\nGeography\n\nThere are a number of highways including E75 and the main railway from Athens to Thessaloniki (Salonika) crossing through Thessaly. The region is directly linked to the rest of Europe through the International Airport of Central Greece located in Nea Anchialos a short distance from Larissa. Larissa lies on the river Pineios.\n\nThe municipality Larissa has an area of , the municipal unit Larissa has an area of , and the community Larissa has an area of .\n\nThe Larissa Chasma, a deep gash in the surface of Dione, a natural satellite of Saturn, was named after Larissa.\n\nClimate \n\nThe climate of Larissa is transitional. The winter is cold and wet, and some snowstorms may occur. The summer is hot, and temperatures of 40 °C may occur. Thunderstorms or heavy rain may cause agricultural damage. Larissa receives 450 mm of rain per year.\n\nMythology\n\nAccording to Greek mythology it is said that the city was founded by Acrisius, who was killed accidentally by his grandson, Perseus.Stephanus Byzantius, s.v. There lived Peleus, the hero beloved by the gods, and his son Achilles.\n\nIn mythology, the nymph Larissa was a daughter of the primordial man Pelasgus.Pausanias, 2.24.1\n\nThe city of Larissa is mentioned in Book II of Iliad by Homer:\n\nHippothous led the tribes of Pelasgian spearsmen, who dwelt in fertile Larissa- Hippothous,and Pylaeus of the race of Mars, two sons of the Pelasgian Lethus, son of Teutamus.Hippothous led the tribes of Pelasgian spearsmen, who dwelt in fertile Larissa- Hippothous, and Pylaeus of the race of Mars, two sons of the Pelasgian Lethus, son of Teutamus. [http://classics.mit.edu/Homer/iliad.2.ii.html]\n\nIn this paragraph, Homer shows that the Pelasgians, Trojan allies, used to live in the city of Larissa. It is likely that this city of Larissa was different to the city that was the birthplace of Achilles.  The Larissa that features as a Trojan ally in the Iliad was likely to be located in the Troad, on the other side of the Aegean Sea.\n\nHistory\n\nAntiquity\n\nTraces of Paleolithic human settlement have been recovered from the area, but it was peripheral to areas of advanced culture.Curtis Runnels and Tjeerd H. van Andel. \"The Lower and Middle Paleolithic of Thessaly, Greece\" Journal of Field Archaeology 20.3 (Autumn 1993:299–317) summarises the survey carried out in June 1991. The area around Larissa was extremely fruitful; it was agriculturally important and in antiquity was known for its horses.\n\nThe name Larissa (Λάρισα Lárīsa) is in origin a Pelasgian (pre-Greek) word for \"fortress\". There were many ancient Greek cities with this name.\nThe name of Thessalian Larissa is first recorded in connection with the aristocratic Aleuadai family.\"The city and the plain around it were settled in prehistoric times, and its name must be early, but it is first mentioned in connection with the(Richard Stillwell, William L. MacDonald, Marian Holland McAllister, eds., The Princeton Encyclopedia of Classical Sites (Princeton University Press) 1976, 's.v. \"Larissa, or Larisa, or Pelasgis, Thessaly\").\n\nLarissa is thought to be where the famous Greek physician Hippocrates and the famous philosopher Gorgias of Leontini died.\n\nWhen Larissa ceased minting the federal coins it shared with other Thessalian towns and adopted its own coinage in the late 5th century BC, it chose local types for its coins. The obverse depicted the nymph of the local spring,  Larissa, for whom the town was named; probably the choice was inspired by the famous coins of Kimon depicting the Syracusan nymph Arethusa. The reverse depicted a horse in various poses. The horse was an appropriate symbol of Thessaly, a land of plains, which was well known for its horses. Usually there is a male figure; he should perhaps be seen as the eponymous hero of the Thessalians, Thessalos, who is probably also to be identified on many of the earlier, federal coins of Thessaly.\n\nLarissa, sometimes written Larisa on ancient coins and inscriptions, is near the site of the Homeric Argissa. It appears in early times, when Thessaly was mainly governed by a few aristocratic families, as an important city under the rule of the Aleuadae, whose authority extended over the whole district of Pelasgiotis. This powerful family possessed for many generations before 369 BC the privilege of furnishing the tagus, the local term for the strategos of the combined Thessalian forces. The principal rivals of the Aleuadae were the Scopadae of Crannon, the remains of which are about 14 miles south west.\n\nLarissa was indeed the birthplace of Meno, who thus became, along with Xenophon and a few others, one of the generals leading several thousands Greeks from various places, in the ill-fated expedition of 401 (retold in Xenophon's Anabasis) meant to help Cyrus the Younger, son of Darius II, king of Persia, overthrow his elder brother Artaxerxes II and take over the throne of Persia (Meno is featured in Plato's dialogue bearing his name, in which Socrates uses the example of \"the way to Larissa\" to help explain Meno the difference between true opinion and science (Meno, 97a–c) ; this \"way to Larissa\" might well be on the part of Socrates an attempt to call to Meno's mind a \"way home\", understood as the way toward one's true and \"eternal\" home reached only at death, that each man is supposed to seek in his life).\n\nThe constitution of the town was democratic, which explains why it sided with Athens in the Peloponnesian War. In the neighbourhood of Larissa was celebrated a festival which recalled the Roman Saturnalia, and at which the slaves were waited on by their masters. As the chief city of ancient Thessaly, Larissa was taken by the Thebans and later directly annexed by Philip II of Macedon in 344. It remained under Macedonian control afterwards, except for a brief period when Demetrius Poliorcetes captured it in 302 BC.\n\nIt was in Larissa that Philip V of Macedon signed in 197 BC a treaty with the Romans after his defeat at the Battle of Cynoscephalae, and it was there also that Antiochus III the Great, won a great victory in 192 BC. In 196 BC Larissa became an ally of Rome and was the headquarters of the Thessalian League.\n\nLarissa is frequently mentioned in connection with the Roman civil wars which preceded the establishment of the Roman Empire and Pompey sought refuge there after the defeat of Pharsalus.\n\nMiddle Ages and Ottoman period\n\nLarissa was sacked by the Ostrogoths in the late 5th century, and rebuilt under the Byzantine emperor Justinian I.\n\nIn the 8th century, the city became the metropolis of the theme of Hellas. The city was captured in 986 by Tsar Samuel of Bulgaria, who carried off the relics of its patron saint, Saint Achilleios, to Prespa. It was again unsuccessfully besieged by the Italo-Normans under Bohemond I in 1082/3.\n\nAfter the Fourth Crusade, the King of Thessalonica, Boniface of Montferrat, gave the city to Lombard barons, but they launched a rebellion in 1209 that had to be subdued by the Latin Emperor Henry of Flanders himself. The city was recovered by Epirus soon after.\n\nIt was conquered by the Ottoman Empire in 1386/87 and again in the 1390s, but only came under permanent Ottoman control in 1423, by Turahan Bey. Under Ottoman rule, the city was known as Yeni-şehir i-Fenari, \"new citadel\". As the chief town and military base of Ottoman Thessaly, Larissa was a predominantly Muslim city. During Ottoman rule the administration of the Metropolis of Larissa was transferred to nearby Trikala where it remained until 1734, when Metropolitan Iakovos II returned the see from Trikala to Larisa and established the present-day metropolis of Larissa and Tyrnavos.\n\nThe town was noted for its trade fair in the 17th and 18th centuries, while the seat of the pasha of Thessaly was also transferred there in 1770. The city remained in Ottoman hands until Thessaly became part of the independent Kingdom of Greece in 1881, except for a period where Ottoman forces re-occupied it during the Greco-Turkish War of 1897.\n\nIn the 19th century, there was a small village in the outskirts of town very unusually inhabited by Africans from Sudan, a curious remnant of the forces collected by Ali Pasha. In the 19th century, the town produced leather, cotton, silk and tobacco. Fevers and agues were prevalent owing to bad drainage and the overflowing of the river; and the death rate was higher than the birth rate. It was also renowned for the minarets of its mosques (four of which were still in use in the early part of the 20th century) and the Muslim burial grounds.\n\nModern Greek era\n\nLarissa was the headquarters of Hursid Pasha during the Greek War of Independence. In 1881, the city, along with the rest of Thessaly, was incorporated into the Kingdom of Greece. A considerable portion of the Turkish population emigrated into the Ottoman Empire at that point. During the Greco-Turkish War of 1897, the city was the headquarters of Greek Crown Prince Constantine. The flight of the Greek army from here to Farsala took place on April 23, 1897. Turkish troops entered the city two days later. After a treaty for peace was signed, they withdrew and Larissa remained permanently in Greece. This was followed by a further exodus of Turks in 1898.\n\nDuring the Axis Occupation of the country, the Jewish community of the city (dated back to 2nd BC, see Romaniotes) suffered heavy losses. Today in the city there is a Holocaust memorial and a synagogue.\n\nLarissa Nowadays \n\nToday Larissa is the fifth largest Greek city with many squares, taverns and cafes. It has three public hospitals with one being military hospital. It hosts the Hellenic Air Force Headquarters and NATO Headquarters in Greece. It has a School of Medicine and the School of Biochemistry – Biotechnology the third largest in the country Institute of Technology. It occupies the first place among Greek cities into green coverage rate per square-metre urban space. It also has two public libraries and three museums.http://www.larissa-dimos.gr/\n\nEcclesiastical history\n\nChristianity penetrated early to Larissa, though its first bishop is recorded only in 325 at the Council of Nicaea. St. Achillius of the 4th century, is celebrated for his miracles. Le QuienOriens Christianus II, 103–112. cites twenty-nine bishops from the fourth to the 18th centuries; the most famous is Jeremias II, who occupied the see until 733, when the Emperor Leo III the Isaurian transferred it from the jurisdiction of the Pope of Rome to the Patriarchate of Constantinople. In the first years of the 10th century it had ten suffragan sees;Heinrich Gelzer, \"Ungedruckte. . .Texte der Notitiae episcopatuum\", Munich, 1900, 557. subsequently the number increased and about the year 1175 under the Emperor Manuel I Comnenus, it reached twenty-eight.Parthey, Hieroclis Synecdemus, Berlin, 1866, 120. At the close of the 15th century, under the Turkish domination, there were only ten suffragan sees,Gelzer, op. cit., 635. which gradually grew less and finally disappeared.\n\nLarissa is an Orthodox Metropolis of the Church of Greece. It was briefly a Latin archbishopric in the early 13th century, and remains a Latin Metropolitan (top-ranking) titular see of the Roman Catholic Church, which must not be confused with the Latin episcopal (low-ranking) titular see Larissa in Syria.\n\nAdministration\n\nThe municipality Larissa was formed at the 2011 local government reform by the merger of the following 3 former municipalities, that became municipal units:[http://www.kedke.gr/uploads2010/FEKB129211082010_kallikratis.pdf Kallikratis law] Greece Ministry of Interior \n*Giannouli\n*Koilada\n*Larissa\n\nDistricts \n\nThe municipal unit of Larissa is divided into four city-districts or municipal communities (29 city areas) plus 2 suburban communities (Amphithea and Koulourion). The municipality includes also the Community of Terpsithèa (with the suburban community of Argyssa).\n\n1st Municipal District\n(pop. 26,035)\n# Papastàvrou\n# Saint Athanàsios\n# Alkazàr\n# Hippocrates-Pèra\n# Potamòpolis\n# Philippòpolis\n# Livadàki\n# Saint Thomas\n# Saint Paraskevi-Mezourlo\n# Neàpolis\n\n2nd Municipal District\n(pop. 41,816)\n# Saint Achellios\n# Saint Nikòlaos\n# Ambelòkipoi\n# Saints Sarànta\n# Saint Konstantinos\n# Stathmòs\n\n3rd Municipal District\n(pop. 30,121)\n# Lachanòkipoi\n# Nèa Smyrne-Kamynia\n# Kalyvia-Saint Marina\n# Saint Geòrgios\n# Anatoli\n# Koulouri\n# Amphithèa\n\n4th Municipal District\n(pop. 26,814)\n# Charavgi-Toumba-OKE\n# Pyrovolikà-Pharos\n# Avèrof-Sèkfo\n# Nèa Politia\n# Epiròtika\n# Anthoupolis\n# Neràida\n# Kàmpos\n\nCommunity of Terpsithèa\n(pop. 1,290)\n# Terpsithèa\n# Argyssa\n\nFrom 1 January 2011, in accordance with the Kallikratis Plan (new administrative division of Greece), the new municipality of Larissa includes also the former municipalities of Giannouli and Koilada.\n\nProvince\n\nThe province of Larissa () was one of the provinces of the Larissa Prefecture. Its territory corresponded with that of the current municipalities Larissa (except the municipal unit Giannouli) and Tempi (except the municipal units Gonnoi and Kato Olympos).    It was abolished in 2006.\n\nCulture\n\n*[http://www.larissa-dimos.gr/new/index.asp?pid3&sub\n3 Municipal Odeon of Larissa]\n*[https://web.archive.org/web/20130917175417/http://www.nea-acropoli-larisas.gr/larisamylospappa Mylos of Pappa Theatre]\n*[http://www.thessaliko-theatre.gr/ Thessalian Theatre – Municipal Theatre of Larissa]\n\nArchaeological sites\n\n*[http://www.larissa-theatre.com Ancient Theatre A']\n*[https://web.archive.org/web/20091027012423/http://geocities.com/cgbarbus/ Fortress Hill]\n*Ancient Theatre B'\n*[http://sites.google.com/site/meiosisstudio/Home/projects/funerary-monument-of-hippocrates-in-larissa Hippokrates Monument]\n\nCuisine\n\nLocal specialities:\n\n*Batzina\n*Kelaidi (Κελαηδί)\n*Kreatopita\n*Loukanikopita\n*Melintzanopita\n*Tyropita\n\nMuseums\n\n*[http://odysseus.culture.gr/h/1/eh151.jsp?obj_id=3452 Diachronic Museum of Larissa]\n*[https://web.archive.org/web/20080202093010/http://www.larissa-dimos.gr/larissa/npdd/pinako.shtm Municipal Gallery of Larissa – G.I. Katsigras Museum]\n*[https://web.archive.org/web/20080117122916/http://www.larissa-dimos.gr/larissa/city/laografiko_mouseio.shtm Historical & Folklore Museum of Larissa]\n*Veterinary Military Museum of Larissa\n*Museum of Folklore Society of Larissa\n\nMedia\n\n*TV: Thessalian Radio Television (TRT), Astra TV\n*Press: Eleftheria (newspaper)\n\nTransport\n\nLarissa sits in the middle of the plain of Thessaly, with connections to Motorway A1 and national roads EO3 and EO6.\n*Larissa's Urban Bus System\n*Larissa's Interurban System\n*Larissa Central Railway Station at \n*Mezourlo Freight Railway station at \n*Larissa Airport\n*Larissa Tram (planned)\n\nClose destinations \n\nThe city is in close proximity of many interesting destinations in the region (Mount Olympus, Mount Kissavos, Meteora, Lake Plastira, Pilio, etc.) suitable for daily trips.\n\nSports\n\nThe local football club AEL 1964 FC currently participates in Superleague Greece. The team became Greek champion in 1988 and won the Greek Cup in 1985 and 2007. These titles place AEL among the five most important football clubs in Greece. AEL hosts its home games in the newbuild AEL FC Arena since November 2010, a UEFA 3-star-rated football ground.\nOther important sport venues are the National Sport Center of Larissa (EAK Larissas), which includes the Alcazar Stadium and the Neapoli Indoor Hall.\n\nThe National Sports Center of Larissa can accommodate a number of sports and events (football, basketball, wrestling, swimming, boxing, martial arts, handball, water polo, etc.), while the Sports Hall has hosted important athletic events (the World Youth Championship, the Women's Euroleague Final Four, the Greek Cup Final Four, martial arts events, et.c.) and it is also used for cultural events, such as dance festivals.\n\nHistorical population\n\nNotable people\n\nAncient\n\n*Achilles (mythology)\n*Achillius of Larissa (270–330), patron saint of the city\n*Hippokrates of Kos (460 BC–370 BC), physician, worked and died in Larissa\n*Larissa, mythological nymph from Thessaly\n*Medius (4th century BC), friend of Alexander the Great\n*Philinna (4th century BC), dancer, mother of Philip III Arrhidaeus\n*Philo (1st century BC), philosopher\n\nModern\n\n*Giorgakis Olympios (1772–1821), armatolos\n*Konstantinos Koumas (1777-1836), scholar\n*Theoklitos Farmakidis (1784–1860), scholar, figure of the Modern Greek Enlightenment\n*Moshe Pesach (1869-1955), rabbi\n*Achilleas Tzartzanos (1873–1946), linguist, philologist\n*George Seremetis (1879–1950), lawyer, mayor of Thessaloniki\n*Sotiris Skipis (1881–1952), poet\n*Agenor Asteriades (1898-1977), painter\n*M. Karagatsis (1908–1960), novelist, journalist\n*Eleni Zafeiriou (1916–2004), actress\n*Antonis Vratsanos (1919–2008), resistance figure during WWII\n*Takis Tloupas (1920–2003), photographer\n*Kostas Gousgounis (1931–), porn actor\n*Athena Tacha (1936–), artist\n*Georgios Souflias (1941–), politician\n*Petros Efthimiou (1950–), politician\n*Konstantinos Tzanakoulis (1950–), politician\n*Lakis Lazopoulos (1956–), actor, comedian, script author & director\n*Thanasis Papakonstantinou (1959–), poet, songwriter, singer, musician\n*Kosmas Stratos (1959–), 100m sprinter\n*Georgios Mitsibonas (1962–1997), footballer\n*Vassilis Karapialis (1965–), footballer\n*Ekaterini Voggoli (1970–), discus thrower\n*Dimitris Andrikopoulos (1971–), composer\n*Alexis Georgoulis (1974–), actor\n*Yannis Goumas (1975–), footballer\n*Dimosthenis Dikoudis (1977–), basketball player\n*Nestoras Kommatos (1977–), basketball player\n*Fani Halkia (1979–), hurdler\n*Dimitris Spanoulis (1979–), basketball player\n*Theofanis Gekas (1980–), footballer\n*Vangelis Moras (1981–), footballer\n*Vassilis Spanoulis (1982–), basketball player\n*Giorgos Tsiaras (1982–), basketball player\n*Kostas Chalkias (1974–), footballer\n*Thanasis Deligiannis (1983–), composer\n*Apostolis Totsikas (1983–), actor\n*Vasilios Koutsianikoulis (1988–), footballer\n\nInternational relations\n\nTwin towns — sister cities\n\nLarissa is twinned with:. Larissa. http://en.wikipedia.org/?curid=18490."
  }
}
