{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2425",
  "eid" : "c043adb0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778402315,
  "textBody" : "Muhi-ud-Din Muhammad () (3 November 1618 – 3 March 1707), commonly known by the sobriquet Aurangzeb ( \"Ornament of the Throne\") or by his regnal title Alamgir ( \"Conqueror of the World\"), was the sixth, and widely considered the last effective Mughal emperor. His reign lasted for 49 years from 1658 until his death in 1707.\n\nAurangzeb was a notable expansionist and during his reign, the Mughal Empire reached its greatest extent, ruling over nearly all of the Indian subcontinent. During his lifetime, victories in the south expanded the Mughal Empire to 4 million square kilometres, and he ruled over a population estimated to be over 158 million subjects, with an annual yearly revenue of $450 million (more than ten times that of his contemporary Louis XIV of France), or £38,624,680 (2,879,469,894 rupees) in 1690.http://www.fampeople.com/cat-aurangzebConnections, A World History, Volume 1: World history, World history by CTI Reviews Under his reign, India surpassed China once again to become the world's largest economy, worth over $90 billion, nearly a quarter of world GDP in 1700.Maddison, Angus (2003): [https://books.google.com/books?idrHJGz3HiJbcC&pg\nPA259 Development Centre Studies The World Economy Historical Statistics: Historical Statistics], OECD Publishing, , pages 259–261\n\nAurangzeb has been subject to controversy and criticism for his policies that abandoned his predecessors' legacy of pluralism and religious tolerance, citing his introduction of the Jizya tax, destruction of Hindu temples, and execution of the ninth Sikh guru, Guru Tegh Bahadur. Abraham Eraly (2000), Emperors of the Peacock Throne: The Saga of the Great Mughals, Penguin Books, , pages 398–399. According to Abraham Eraly, \"in 1670, all temples around Ujjain were destroyed\" and later \"300 temples were destroyed in and around Chitor, Udaipur and Jaipur\" among other Hindu temples destroyed elsewhere in campaigns through 1705.Avari writes, \"Aurangzeb's religious policy caused friction between him and the ninth Sikh guru, Tegh Bahadur. In both Punjab and Kashmir the Sikh leader was roused to action by Aurangzeb's excessively zealous Islamic policies. Seized and taken to Delhi, he was called upon by Aurangzeb to embrace Islam and, on refusal, was tortured for five days and then beheaded in November 1675. Two of the ten Sikh gurus thus died as martyrs at the hands of the Mughals. (Avari (2013), page 155) while a minority of historians question this, arguing that his destruction of temples has been exaggerated, and noting that he also built temples, also destroyed Islamic mosques, paid for the maintenance of temples, employed significantly more Hindus in his imperial bureaucracy than his predecessors did, and opposed bigotry against Hindus and Shia Muslims.\n\nIt was at the end of his reign that the downfall of the Mughal Empire began. Rebellions and wars eventually led to the exhaustion of the imperial Mughal treasury and army. He was a strong-handed authoritarian ruler, and following his death the expansionary period of the Mughal Empire came to an end. Nevertheless, the contiguous territory of the Mughal Empire still remained intact more or less until the reign of Muhammad Shah.\n\nEarly life\n\nAurangzeb was born on 3 November 1618, in Dahod, Gujarat. He was the third son and sixth child of Shah Jahan and Mumtaz Mahal. In June 1626, after an unsuccessful rebellion by his father, Aurangzeb and his brother Dara Shukoh were kept as hostages under their grandparents' (Nur Jahan and Jahangir) Lahore court. On 26 February 1628, Shah Jahan was officially declared the Mughal Emperor, and Aurangzeb returned to live with his parents at Agra Fort, where Aurangzeb received his formal education in Arabic and Persian. His daily allowance was fixed at Rs. 500, which he spent on religious education and the study of history.\n\nOn 28 May 1633, Aurangzeb escaped death when a powerful war elephant stampeded through the Mughal Imperial encampment. He rode against the elephant and struck its trunk with a lance, and successfully defended himself from being crushed. Aurangzeb's valour was appreciated by his father who conferred him the title of Bahadur (Brave) and had him weighed in gold and presented gifts worth Rs. 200,000. This event was celebrated in Persian and Urdu verses, and Aurangzeb said:\n\nEarly military campaigns and administration\n\nBundela War\n\nAurangzeb was nominally in charge of the force sent to Bundelkhand with the intent of subduing the rebellious ruler of Orchha, Jhujhar Singh, who had attacked another territory in defiance of Shah Jahan's policy and was refusing to atone for his actions. By arrangement, Aurangzeb stayed in the rear, away from the fighting, and took the advice of his generals as the Mughal Army gathered and commenced the Siege of Orchha in 1635.The campaign was successful and Singh was removed from power.\n\nViceroy of the Deccan\n\nAurangzeb was appointed viceroy of the Deccan in 1636. After Shah Jahan's vassals had been devastated by the alarming expansion of Ahmednagar during the reign of the Nizam Shahi boy-prince Murtaza Shah III, the emperor dispatched Aurangzeb, who in 1636 brought the Nizam Shahi dynasty to an end.George Michell and Mark Zebrowski, Architecture and Art of the Deccan Sultanates, (Cambridge University Press, 1999), 12. In 1637, Aurangzeb married the Safavid princess Dilras Banu Begum, posthumously known as Rabia-ud-Daurani. She was his first wife and chief consort as well as his favourite. He also had an infatuation with a slave girl, Hira Bai, whose death at a young age greatly affected him. In his old age, he was under the charms of his concubine, Udaipuri Bai. The latter had formerly been a companion to Dara Shikoh. In the same year, 1637, Aurangzeb was placed in charge of annexing the small Rajput kingdom of Baglana, which he did with ease.\n\nIn 1644, Aurangzeb's sister, Jahanara, was burned when the chemicals in her perfume were ignited by a nearby lamp while in Agra. This event precipitated a family crisis with political consequences. Aurangzeb suffered his father's displeasure by not returning to Agra immediately but rather three weeks later. Shah Jahan had been nursing Jahanara back to health in that time and thousands of vassals had arrived in Agra to pay their respects. Shah Jahan was outraged to see Aurangzeb enter the interior palace compound in military attire and immediately dismissed him from his position of viceroy of the Deccan; Aurangzeb was also no longer allowed to use red tents or to associate himself with the official military standard of the Mughal emperor. Other sources tell us that Aurangzeb was dismissed from his position because Aurangzeb left the life of luxury and became a Faqir.Ahmad, Fazl. Heroes of Islam. Lahore: Sh. Muhammad Ashraff, 1993. Print.\n\nIn 1645, he was barred from the court for seven months and mentioned his grief to fellow Mughal commanders. Thereafter, Shah Jahan appointed him governor of Gujarat where he served well and was rewarded for bringing stability.\n\nIn 1647, Shah Jahan moved Aurangzeb from Gujarat to be governor of Balkh, replacing a younger son, Murad Baksh, who had proved ineffective there. The area was under attack from Uzbek and Turkmen tribes. Whilst the Mughal artillery and muskets were a formidable force, so too were the skirmishing skills of their opponents. The two sides were in stalemate and Aurangzeb discovered that his army could not live off the land, which was devastated by war. With the onset of winter, he and his father had to make a largely unsatisfactory deal with the Uzbeks, giving away territory in exchange for nominal recognition of Mughal sovereignty. The Mughal force suffered still further with attacks by Uzbeks and other tribesmen as it retreated through snow to Kabul. By the end of this two-year campaign, into which Aurangzeb had been plunged at a late stage, a vast sum of money had been expended for little gain.\n\nFurther inauspicious military involvements followed, as Aurangzeb was appointed governor of Multan and Sindh. His efforts in 1649 and 1652 to dislodge the Safavids at Kandahar, which they had recently retaken after a decade of Mughal control, both ended in failure as winter approached. The logistical problems of supplying an army at the extremity of the empire, combined with the poor quality of armaments and the intransigence of the opposition have been cited by John Richards as the reasons for failure, and a third attempt in 1653, led by Dara Shikoh, met with the same outcome.\n\nAurangzeb became viceroy of the Deccan again after he was replaced by Dara Shikoh in the attempt to recapture Kandahar. Aurangzeb regretted this and harboured feelings that Shikoh had manipulated the situation to serve his own ends. Aurangbad's two jagirs (land grants) were moved there as a consequence of his return and, because the Deccan was a relatively impoverished area, this caused him to lose out financially. So poor was the area that grants were required from Malwa and Gujarat in order to maintain the administration and the situation caused ill-feeling between father and son. Shah Jahan insisted that things could be improved if Aurangzeb made efforts to develop cultivation. Aurangzeb appointed Murshid Quli Khan to extend to the Deccan the zabt revenue system used in northern India. Murshid Quli Khan organised a survey of agricultural land and a tax assessment on what it produced. To increase revenue, Murshid Quli Khan granted loans for seed, livestock, and irrigation infrastructure. The Deccan returned to prosperity, but too slowly to satisfy the emperor.\n\nAurangzeb proposed to resolve the situation by attacking the dynastic occupants of Golconda (the Qutb Shahis) and Bijapur (the Adil Shahis). As an adjunct to resolving the financial difficulties, the proposal would also extend Mughal influence by accruing more lands. Again, he was to feel that Dara had exerted influence on his father: believing that he was on the verge of victory in both instances, Aurangzeb was frustrated that Shah Jahan chose then to settle for negotiations with the opposing forces rather than pushing for complete victory.\n\nWar of Succession\n\nThe four sons of Shah Jahan all held governorships during their father's reign. The emperor favoured the eldest, Dara Shukoh. This had caused resentment among the younger three, who sought at various times to strengthen alliances between themselves and against Dara. There was no Mughal tradition of primogeniture, the systematic passing of rule, upon an emperor's death, to his eldest son. Instead it was customary for sons to overthrow their father and for brothers to war to the death among themselves. Historian Satish Chandra says that \"In the ultimate resort, connections among the powerful military leaders, and military strength and capacity [were] the real arbiters\". The contest for power was primarily between Dara Shikoh and Aurangzeb because, although all four sons had demonstrated competence in their official roles, it was around these two that the supporting cast of officials and other influential people mostly circulated. There were ideological differences — Dara was an intellectual and a religious liberal in the mould of Akbar, while Aurangzeb was much more conservative — but, as historians Barbara D. Metcalf and Thomas R. Metcalf say, \"To focus on divergent philosophies neglects the fact that Dara was a poor general and leader. It also ignores the fact that factional lines in the succession dispute were not, by and large, shaped by ideology.\" Marc Gaborieau, professor of Indian studies at l'École des Hautes Études en Sciences Sociales, explains that \"The loyalties of [officials and their armed contingents] seem to have been motivated more by their own interests, the closeness of the family relation and above all the charisma of the pretenders than by ideological divides.\" Muslims and Hindus did not divide along religious lines in their support for one pretender or the other nor, according to Chandra, is there much evidence to support the belief that Jahanara and other members of the royal family were split in their support. Jahanara, certainly, interceded at various times on behalf of all of the princes and was well-regarded by Aurangzeb even though she shared the religious outlook of Dara.\n\nIn 1656, a general under Qutb Shahi dynasty named Musa Khan led an army of 12,000 Musketeers to attack Aurangzeb, and later on the same campaign Aurangzeb in turn rode against an army consisting 8,000 horsemen and 20,000 Karnataka Musketeers\n\nHaving made clear that he wanted Dara to succeed him, Shah Jahan became ill with stranguary in 1657 and was closeted under the care of his favourite son in the newly built city of Shahjahanabad (Old Delhi). Rumours of the death of Shah Jahan abounded and the younger sons were concerned that Dara might be hiding it for Machiavellian reasons. Thus, they took action: Shah Shuja In Bengal, where he had been governor since 1637, Prince Muhammad Shuja crowned himself King at RajMahal, and brought his cavalry, artillery and river flotilla upriver towards Agra. Near Varanasi his forces confronted a defending army sent from Delhi under the command of Prince Sulaiman Shukoh, son of Dara Shukoh, and Raja Jai Singhwhile Murad did the same in his governorship of Gujarat and Aurangzeb did so in the Deccan. It is not known whether these preparations were made in the mistaken belief that the rumours of death were true or whether the challengers were just taking advantage of the situation.\n\nAfter regaining some of his health, Shah Jahan moved to Agra and Dara urged him to send forces to challenge Shah Shuja and Murad, who had declared themselves rulers in their respective territories. While Shah Shuja was defeated at Banares in February 1658, the army sent to deal with Murad discovered to their surprise that he and Aurangzeb had combined their forces, the two brothers having agreed to partition the empire once they had gained control of it. The two armies clashed at Dharmat in April 1658, with Aurangzeb being the victor. Shuja was being chased through Bihar and the victory of Aurangzeb proved this to be a poor decision by Dara Shikoh, who now had a defeated force on one front and a successful force unnecessarily pre-occupied on another. Realising that his recalled Bihar forces would not arrive at Agra in time to resist the emboldened Aurangzeb's advance, Dara scrambled to form alliances in order but found that Aurangzeb had already courted key potential candidates. When Dara's disparate, hastily concocted army clashed with Aurangzeb's well-disciplined, battle-hardened force at the Battle of Samugarh in late May, neither Dara's men nor his generalship were any match for Aurangzeb. Dara had also become over-confident in his own abilities and, by ignoring advice not to lead in battle while his father was alive, he cemented the idea that he had usurped the throne. \"After the defeat of Dara, Shah Jahan was imprisoned in the fort of Agra where he spent eight long years under the care of his favourite daughter Jahanara.\"\n\nAurangzeb then broke his arrangement with Murad Baksh, which probably had been his intention all along. Instead of looking to partition the empire between himself and Murad, he had his brother arrested and imprisoned at Gwalior Fort. Murad was executed on 4 December 1661, ostensibly for the murder of the diwan of Gujarat some time earlier. The allegation was encouraged by Aurangzeb, who caused the diwan's son to seek retribution for the death under the principles of Sharia law. Meanwhile, Dara gathered his forces, and moved to the Punjab. The army sent against Shuja was trapped in the east, its generals Jai Singh and Dilir Khan submitted to Aurangzeb, but Dara's son, Suleiman Shikoh, escaped. Aurangzeb offered Shah Shuja the governorship of Bengal. This move had the effect of isolating Dara Shikoh and causing more troops to defect to Aurangzeb. Shah Shuja, who had declared himself emperor in Bengal began to annex more territory and this prompted Aurangzeb to march from Punjab with a new and large army that fought during the Battle of Khajwa, where Shah Shuja and his chain-mail armoured war elephants were routed by the forces loyal to Aurangzeb. Shah Shuja then fled to Arakan (in present-day Burma), where he was executed by the local rulers.The Cambridge History of India (1922), vol. IV, p. 481.\n\nWith Shuja and Murad disposed of, and with his father immured in Agra, Aurangzeb pursued Dara Shikoh, chasing him across the north-western bounds of the empire. Aurangzeb claimed that Dara was no longer a Muslim and accused him of poisoning the Mughal Grand Vizier Saadullah Khan. After a series of battles, defeats and retreats, Dara was betrayed by one of his generals, who arrested and bound him. In 1658, Aurangzeb arranged his formal coronation in Delhi.\n\nOn 10 August 1659, Dara was executed on grounds of apostasy and his head was sent to Shahjahan.  Having secured his position, Aurangzeb confined his frail father at the Agra Fort but did not mistreat him. Shah Jahan was cared for by Jahanara and died in 1666.\n\nReign\n\nBureaucracy\n\nAurangzeb's imperial bureaucracy employed significantly more Hindus than that of his predecessors. Between 1679 and 1707, the number of Hindu officials in the Mughal administration rose by half, many of them Marathas and Rajputs. His increasing employment of Hindus and Shia Muslims was deemed controversial at the time, with several of his fellow Sunni Muslim officials petitioning against it, which he rejected, and responded, \"What connection have earthly affairs with religion? And what right have administrative works to meddle with bigotry? 'For you is your religion and for me is mine.'\" He insisted on employment based on ability rather than religion.\n\nUnder Aurangzeb's reign, Hindus rose to represent 31.6% of Mughal nobility, the highest in the Mughal era. This was largely due to a substantial influx of Marathas, who played a key role in his successful Deccan campaign. During his time, the number of Hindu Mansabdars increased from 22% to over 31% in the Mughal administration, as he needed them to continue his fight in the Deccan. However, one of his Rajput nobles, Jaswant Singh of Jodhpur, Hindu ruler of Jodhpur, “destroyed mosques and built idol-temples in their stead” around 1658–1659, according to Aurangzeb. Despite this, relationships did not turn sour between the two, as they worked together for the next two decades up until Singh's death in the late 1670s.\n\nEstablishment of Islamic law\n\nHistorian Katherine Brown has noted that \"The very name of Aurangzeb seems to act in the popular imagination as a signifier of politico-religious bigotry and repression, regardless of historical accuracy.\" The subject has also resonated in modern times with popularly accepted claims that he intended to destroy the Bamiyan Buddhas. As a political and religious conservative, Aurangzeb chose not to follow the secular religious viewpoints of his predecessors after his ascension. Shah Jahan had already moved away from the liberalism of Akbar, although in a token manner rather than with the intent of suppressing Hinduism, and Aurangzeb took the change still further. Though the approach to faith of Akbar, Jahangir and Shah Jahan was more syncretic than Babur, the founder of the empire, Aurangzeb's position is not so obvious. His emphasis on sharia competed, or was directly in conflict, with his insistence that zawabit or secular decrees could supersede sharia. Despite claims of sweeping edicts and policies, contradictory accounts exist. He sought to codify Hanafi law by the work of several hundred jurists, called Fatawa-e-Alamgiri. It is possible the War of Succession and continued incursions combined with Shah Jahan's spending made cultural expenditure impossible.\n\nAs emperor, Aurangzeb banned the drinking of alcohol, gambling, castration, servitude, eunuchs, music, nautch and narcotics in the Mughal Empire. He learnt that at Sindh, Multan, Thatta and particularly at Varanasi, the Hindu Brahmins attracted large numbers of indigenous local Muslims to their discourses. He ordered the Subahdars of these provinces to demolish the schools and the temples of non-Muslims. Aurangzeb also ordered Subahdars to punish Muslims who dressed like non-Muslims. The executions of the antinomian Sufi mystic Sarmad Kashani and the ninth Sikh Guru Tegh Bahadur bear testimony to Aurangzeb's religious policy; the former was beheaded on multiple accounts of heresy, the latter, according to Sikhs, because he objected to Aurangzeb's forced conversions.\n\nTaxation policy\n\nHe imposed Jizya, a military tax on non-Muslims who were not fighting for Mughal Empire in his second decade on ruling in the year 1679.http://www.sscnet.ucla.edu/southasia/History/Mughals/Aurang3.html Further, Aurangzeb levied discriminatory taxes on Hindu merchants at the rate of 5% as against 2.5% on Muslim  merchants. He ordered to dismiss Hindu quanungos and patwaris from revenue administration.[https://books.google.co.in/books?id\nFduG_t2sxwMC&pgPA190&lpg\nPA190&dqAurangzeb+levied+taxes+on+Hindu+merchants&source\nbl&otsoB7CXi8_jU&sig\n0j_ngj7f-EG9pS7wRGcTcC5kCOw&hlen&sa\nX&ved0CE4Q6AEwCWoVChMIp8vfk-nLyAIVC3KOCh2JHQYM#v\nonepage&qAurangzeb%20levied%20taxes%20on%20Hindu%20merchants&f\nfalse Islam in South Asia: A Short History By Jamal Malik][https://books.google.co.in/books?idLXkGCAAAQBAJ&pg\nPA462&lpgPA462&dq\naurangzeb+on+taxing+hindu+merchants&sourcebl&ots\nIFubGUGbKA&sigvEMFDfbdHy0-Ncrc3Zh-ugSGobM&hl\nen&saX&ved\n0CCsQ6AEwAmoVChMIgJC4_efLyAIVzxuOCh2p-wyF#vonepage&q\naurangzeb%20on%20taxing%20hindu%20merchants&ffalse Encyclopedia of World Trade: From Ancient Times to the Present][https://books.google.co.in/books?id\nsxhAtCflwOMC&pgPA260&lpg\nPA260&dqaurangzeb+on+dismissing+hindu+officials&source\nbl&otsUILXXYHenD&sig\nP0p47pC-lRLhfsXl94jWP0oplSM&hlen&sa\nX&ved0CBsQ6AEwADgKahUKEwjHhcyT6cvIAhWKGY4KHWOjAss#v\nonepage&qaurangzeb%20on%20dismissing%20hindu%20officials&f\nfalse A Comprehensive History of Medieval India: Twelfth to the Mid-Eighteenth Century By Farooqui Salma Ahmed][https://books.google.co.in/books?id8wC52sA8CtwC&pg\nPA225&lpgPA225&dq\naurangzeb+on+dismissing+hindu+officials&sourcebl&ots\nGO1zXnDCuB&sigNJiu3GqiNiUxSDoON8LR43UQLow&hl\nen&saX&ved\n0CEsQ6AEwCTgKahUKEwjHhcyT6cvIAhWKGY4KHWOjAss#vonepage&q\naurangzeb%20on%20dismissing%20hindu%20officials&ffalse The Human Journey: A Concise Introduction to World History By Kevin Reilly] However, he also employed many Hindus as Jizya tax collectors.\n\nThe introduction of Jizya in 1679 was a response to several events shortly before its introduction: the great Rajput rebellion of 1678, the Maratha alliance with the Shia Golconda, and the Mughal expansion into the Deccan. However, the contemporary historian Khafi Khan (died 1733), whose family had served Aurangzeb, noted that Jizya could not be levied and remained largely a tax on paper only.\n\nPolicy on temples and mosques\n\nDuring his reign, Aurangzeb ordered the destruction of many temples and some mosques. For example, he ordered the destruction of Vishvanath Temple at Varanasi for being a centre of conspiracy against the state, and he ordered the destruction of the Jama Masjid at Golkunda after finding out that its ruler had built the mosque in order to hide revenues from the state. Aurangzeb also ordered a rescue raid on a temple, in order to rescue a Rajasthan minister's female family members who went there on a pilgrimage.\n\nAurangzeb displayed a particular animus towards Hindus and their temples. In his the first volume of his Pulitzer Prize winning book series, historian Will Durant  Durant, Will 1935, p.475.  stated the following:\n\nAurangzeb thought of changing the name of Hindu's one of the holiest city Benaras to Muhammadabad. Among the Hindu temples he demolished were three of the most sacred, the Kashi Vishwanath temple, Kesava Deo temple, and Somnath temple, and built large mosques in their place. In 1679, he ordered destruction of several prominent temples that had become associated with his enemies: these included the temples of Khandela, Udaipur, Chittor and Jodhpur. The historian Richard Eaton argues that the overall understanding of temples to be flawed. As early as the sixth century, temples became vital political landmarks as well as religious ones. He writes that, not only was temple desecration widely practised and accepted, it was a necessary part of political struggle.\n\nOther scholars point out that Aurangzeb also built many temples, Ian Copland says that he built more temples than he destroyed. However, scholars like Ram Puniyani states that Aurangzeb was not always fanatically anti-Hindu, and kept changing his policies depending on the needs of the situation. He banned the construction of new temples, but permitted the repair and maintenance of existing temples. He also made generous donations of jagirs to several temples to win the sympathies of his Hindu subjects. There are several firmans (orders) in his name, supporting temples and gurudwaras, including Mahakaleshwar temple of Ujjain, Balaji temple of Chitrakoot, Umananda Temple of Guwahati and the Shatrunjaya Jain temples.\n\nExecution of opponents\n\nThe first prominent execution during the long reign of Aurangzeb started with that of his brother Prince Dara Shikoh, who was accused of being influenced by Hinduism although some sources argue it was done for political reasons.Gerald James Larson, India's Agony Over Religion, (State University of New York Press, 1995), 111. Aurangzeb had his allied brother Prince Murad Baksh held for murder, judged and then executed.The Cambridge Shorter History of India, Vol. II, ed. H.H. Dodwell, (Cambridge University Press, 1934), 416. Aurangzeb is accused of poisoning his imprisoned nephew Sulaiman Shikoh.Vincent Arthur Smith, The Oxford History of India: From the Earliest Times to the End of 1911, (Clarendon Press, 1920), 412.\n\nIn 1689, the second Maratha Chhatrapati (King) Sambhaji was brutally executed by Aurangzeb. In a sham trial, he was found guilty of murder and violence, atrocitiesBurton Stein, A History of India, ed. David Arnold, (Blackwell Publishers, 1998), 179.[https://books.google.com/books?idQY4zdTDwMAQC&pg\nPA179&lpgPA179&dq\nmaratha+plunder+and+rape&sourcebl&ots\nWij6vczClO&siglHeJImObqEnvWZ5RanmKfwrhcDE&hl\nen&saX&ei\n6R1JU_GVJpOj8AXUjYCgBg&ved0CEMQ6AEwBQ#v\nonepage&qmaratha%20plunder%20and%20rape&f\nfalse] against the Muslims of Burhanpur and Bahadurpur in Berar by Marathas under his command.John F. Richards, The Mughal Empire, (Cambridge University Press, 1995), 223. \n\nIn 1675 the Sikh leader Guru Tegh Bahadur was arrested on orders by Aurangzeb, found guilty of blasphemy by a Qadi's court and executed.Hardip Singh Syan, Sikh Militancy in the Seventeenth Century: Religious Violence in Mughal and Early Modern India, (I.B. Tauris, 2012), 130–131.\n\nThe 32nd Da'i al-Mutlaq (Absolute Missionary) of the Dawoodi Bohra sect of Musta'lī Islam Syedna Qutubkhan Qutubuddin was executed by Aurangzeb, then governor of Gujarat, for heresy; on 27 Jumadil Akhir 1056 AH/ 1648 AD), Ahmedabad, India.\n\nFile:Tulapur arch.jpg|In the year 1689, according to Mughal accounts, Sambhaji was put on trial, found guilty of atrocitiesBurton Stein, A History of India, ed. David Arnold, (Blackwell Publishers, 1998), 179.[https://books.google.com/books?idQY4zdTDwMAQC&pg\nPA179&lpgPA179&dq\nmaratha+plunder+and+rape&sourcebl&ots\nWij6vczClO&siglHeJImObqEnvWZ5RanmKfwrhcDE&hl\nen&saX&ei\n6R1JU_GVJpOj8AXUjYCgBg&ved0CEMQ6AEwBQ#v\nonepage&qmaratha%20plunder%20and%20rape&f\nfalse] and executed.\nFile:Gurdwara Rakabganj Sahib, Delhi.jpg|Guru Tegh Bahadur was publicly executed in 1675 on the orders of Aurangzeb in Delhi[http://www.allaboutSikhs.com/Sikh-Guru-Ji'/Sri-Guru-Tegh-Bhadur-Sahib-Ji.html#12 A Gateway to Sikhism | Sri Guru Tegh Bhadur Sahib - A Gateway to Sikhism]\nFile:Indian - Single Leaf of Shah Sarmad and Prince Dara Shikoh - Walters W912.jpg|Sarmad Kashani, a Jewish convert to Islam and Sufi mystic was accused of heresy and executed.David Cook, Martyrdom in Islam, (Cambridge University Press, 2007), 80.\n\nExpansion of the Mughal Empire\n\nSoon after seizing the throne, Aurangzeb began advancements against the unruly Sultan of Bijapur and during 1657, the Mughals are known to have used rockets during the Siege of Bidar, against Sidi Marjan. Aurangzeb's forces discharged rockets and grenades while scaling the walls, and Sidi Marjan himself was mortally wounded after a rocket struck his large gunpowder depot. After twenty-seven days of hard fighting, Bidar was captured by the Mughals.\n\nIn 1663, during his visit to Ladakh, Aurangzeb established direct control over that part of the empire and loyal subjects such as Deldan Namgyal agreed to pledge tribute and loyalty. Deldan Namgyal is also known to have constructed a Grand Mosque in Leh, which he dedicated to Mughal rule.\n\nIn 1664, Aurangzeb appointed Shaista Khan subedar (governor) of Bengal. Shaista Khan eliminated Portuguese and Arakanese pirates from the region, and in 1666 recaptured the port of Chittagong from the Arakanese king, Sanda Thudhamma. Chittagong remained a key port throughout Mughal rule.\n\nIn 1685, Aurangzeb dispatched his son, Muhammad Azam Shah, with a force of nearly 50,000 men to capture Bijapur Fort and defeat Sikandar Adil Shah (the ruler of Bijapur) who refused to be a vassal. The Mughals could not make any advancements upon Bijapur Fort mainly because of the superior usage of cannon batteries on both sides. Outraged by the stalemate Aurangzeb himself arrived on 4 September 1686 and commanded the Siege of Bijapur; after eight days of fighting, the Mughals were victorious.\n\nOnly one remaining ruler, Abul Hasan Qutb Shah (the Qutbshahi ruler of Golconda), refused to surrender. He and his servicemen fortified themselves at Golconda and fiercely protected the Kollur Mine, which was then probably the world's most productive diamond mine, and an important economic asset. In 1687, Aurangzeb led his grand Mughal army against the Deccan Qutbshahi fortress during the Siege of Golconda. The Qutbshahis had constructed massive fortifications throughout successive generations on a granite hill over 400 ft high with an enormous eight-mile long wall enclosing the city. The main gates of Golconda had the ability to repulse any war elephant attack. Although the Qutbshahis maintained the impregnability of their walls, at night Aurangzeb and his infantry erected complex scaffolding that allowed them to scale the high walls. During the eight-month siege the Mughals faced many hardships including the death of their experienced commander Kilich Khan Bahadur. Eventually, Aurangzeb and his forces managed to penetrate the walls by capturing a gate, and their entry into the fort led Abul Hasan Qutb Shah to surrender peacefully.\n\nMilitary equipment\n\nMughal cannon making skills advanced during the 17th century. One of the most impressive Mughal cannons is known as the Zafarbaksh, which is a very rare composite cannon, that required skills in both wrought-iron forge welding and bronze-casting technologies and the in-depth knowledge of the qualities of both metals.\n\nAurangzeb military entourage consisted of 16 cannons including the Azdaha Paikar (which, was capable of firing a 33.5 kg ordnance) and Fateh Rahber (20 feet long with Persian and Arabic inscriptions).\n\nThe Ibrahim Rauza was also a famed cannon, which was well known for its multi-barrels. François Bernier, the personal physician to Aurangzeb, observed versatile Mughal gun-carriages each drawn by two horses.\n\nDespite these innovations, most soldiers used bows and arrows, the quality of sword manufacture was so poor that they preferred to use ones imported from England, and the operation of the cannons was entrusted not to Mughals but to European gunners. Other weapons used during the period included rockets, cauldrons of boiling oil, muskets and manjaniqs (stone-throwing catapults).\n\nInfantry who were later called Sepoy and who specialised in siege and artillery emerged during the reign of Aurangzeb[https://books.google.co.id/books?idSrdiVPsFRYIC&pg\nPA174&dqsepoy+aurangzeb&hl\nen&saX&ei\nmJLOVMz5Lc7c8AWXsYCACg&redir_escy#v\nonepage&qsepoy%20aurangzeb&f\nfalse Naukar, Rajput, and Sepoy: The Ethnohistory of the Military Labour Market of Hindustan; Dirk H. A. Kolff; Cambridge University Press, 2002] \n\nFile:Daulatabad fort N-MH-A50-3.JPG|Daulatabad cannon\nFile:Kalak Bangadi,Janjira Fort.jpg|Kalak Bangadi cannon.\nFile:Daulatabad cannon1.jpg|one of the Daulatabad cannons\nFile:Kilkila cannon.jpg|Kilkila cannon\nFile:Aurangabad - Daulatabad Fort (69).JPG|Aurangabad cannon\n\nWar elephants\n\nIn 1703, the Mughal commander at Coromandel, Daud Khan Panni spent 10,500 coins to purchase 30 to 50 war elephants from Ceylon.\n\nArt and Culture\n\nAurangzeb was known to be of a more austere nature than his predecessors. Being religious he encouraged Islamic calligraphy. His reign also saw the building of the Lahore  badshahi Mosque, and Bibi ka Maqbara  in Aurangabad for his wife Rabia-ud-Daurani.\n\nCalligraphy\n\nThe Mughal Emperor Aurangzeb is known to have patronised works of Islamic Calligraphy during his reign particularly Syed Ali Tabrizi.\n\nFile:Quatrain on the Virtue of Patience WDL6844.png|Quatrain on the Virtue of Patience by Muhammad Muhsin Lahuri.\nFile:Spousal Advice WDL6832.png|Spousal Advice, by Abdallah Lahuri.\nFile:Ruba'i of Ḥāfiẓ WDL6860.png|Works of Hafez, by Abdallah Lahuri.\nFile:Ruba'i of Ḥāfiẓ WDL6857.png|Works of Hafez, by Muhammad Tahir Lahuri.\n\nArchitecture\n\nUnlike his father, Aurangzeb was not much interested in architecture. Aurangzeb constructed a small marble mosque known as the Moti Masjid (Pearl Mosque) in the Red Fort complex in Delhi. He ordered the construction of the Badshahi Mosque in Lahore. He also constructed a mosque on Benares. The mosque he constructed in Srinagar is still the largest in Kashmir. The structure of Bibi Ka Maqbara in Aurangabad, which now is a historical monument was constructed by the sons of Aurangzeb in remembrance of their mother. The inspiration came from Taj mahal as is quite visible from its architecture.\n\nFile:Badshahi Mosque July 1 2005 pic32 by Ali Imran (1).jpg|17th century Badshahi Masjid built by Aurangzeb in Lahore.\nFile:Great Mosque of Aurungzebe and Adjoining Ghats.jpg|Great Mosque of Aurungzeb and the adjoining Ghats.\nFile:Syed Abdul Rahim Shah Bukhari.jpg|Tomb of Sufi saint, Syed Abdul Rahim Shah Bukhari constructed by Aurangzeb.\n\nTextiles\n\nThe textile industry in the Mughal Empire emerged very firmly during the reign of the Mughal Emperor Aurangzeb and was particularly well noted by Francois Bernier, a French physician of the Mughal Emperor. Francois Bernier writes how Karkanahs, or workshops for the artisans, particularly in textiles flourished by \"employing hundreds of embroiderers, who were superintended by a master\". He further writes how \"Artisans manufacture of silk, fine brocade, and other fine muslins, of which are made turbans, robes of gold flowers, and tunics worn by females, so delicately fine as to wear out in one night, and cost even more if they were well embroidered with fine needlework\".\n\nHe also explains the different techniques employed to produce such complicated textiles such as Himru (whose name is Persian for \"brocade\"), Paithani (whose pattern is identical on both sides), Mushru (satin weave) and how Kalamkari, in which fabrics are painted or block-printed, was a technique that originally came from Persia. Francois Bernier provided some of the first, impressive descriptions of the designs and the soft, delicate texture of Pashmina Shawls also known as Kani, which were very valued for their warmth and comfort among the Mughals, and how these textiles and shawls eventually began to find their way to France and England.\n\nFile:Caspar David Friedrich - Frau mit Umschlagtuch (1804).jpg|Shawls manufactured in the Mughal Empire had highly influenced other cultures around the world.\nFile:Muslim-shawl-makers-kashmir1867.jpg|Shawl makers in the Mughal Empire.\nFile:Floorspread LACMA M.79.9.6 (1 of 3).jpg|Mughal imperial carpet\n\nForeign relations\n\nAs soon as he became emperor, Aurangzeb sent some of the finest ornate gifts such as carpets, lamps, tiles and others to the Islamic shrines at Mecca and Medina. He also ordered the construction of very large ships in Surat that would transport these gifts and even pilgrims to the Hijaz. These annual expeditions organised by Aurangzeb were led by Mir Aziz Badakhshi who died in Mecca of natural causes but managed to deliver more than 45,000 silver coins and several thousand Kaftans of honour.\n\nRelations with the Uzbek\n\nSubhan Quli, Balkh's Uzbek ruler was the first to recognise him in 1658 and requested for a general alliance, he worked alongside the new Mughal Emperor since 1647, when Aurangzeb was the Subedar of Balkh.\n\nRelations with the Safavid dynasty\n\nAurangzeb received the embassy of Abbas II of Persia in 1660 and returned them with gifts. However relations between the Mughal Empire and the Safavid dynasty were tense because the Persians attacked the Mughal army positioned near Kandahar. Aurangzeb prepared his armies in the Indus River Basin for a counteroffensive, but Abbas II's death in 1666 caused Aurangzeb to end all hostilities. Aurangzeb's rebellious son, Sultan Muhammad Akbar, sought refuge with Suleiman I of Persia, who had rescued him from the Imam of Musqat and later refused to assist him in any military adventures against Aurangzeb.\n\nRelations with the French\n\nIn 1667, the French East India Company ambassadors Le Gouz and Bebert presented Louis XIV of France's letter which urged the protection of French merchants from various rebels in the Deccan. In response to the letter Aurangzeb issued a Firman allowing the French to open a factory in Surat.\n\nFile:Pomp and Ceremony of the March of the Great Mogol.jpg|March of the Great Mughal (Aurangzeb)\nFile:Voyage de Francois Bernier by Paul Maret 1710.jpg|François Bernier, was a French physician and traveller, who for 12 years was the personal physician of Aurangzeb. He described his experiences in Travels in the Mughal Empire.\nFile:Indostan - a Map of India by Vincenzo Coronelli, Venice 1692.jpg|Map of the Mughal Empire by Vincenzo Coronelli (1650–1718) of Venice, who served as Royal Geographer to Louis XIV of France.\nFile:1652 Sanson Map of India - Geographicus - India-sanson-1652.jpg|French map of the Deccan.\n\nRelations with the Sultanate of Maldives\n\nIn the 1660s, the Sultan of the Maldives, Ibrahim Iskandar I, requested help from Aurangzeb's representative, the Faujdar of Balasore. The sultan was concerned about the impact of Dutch and English trading ships but the powers of Aurangzeb did not extend to the seas, the Maldives were not under his governance and nothing came of the request.\n\nRelations with the Ottoman Empire\n\nIn 1688, the desperate Ottoman Sultan Suleiman II urgently requested for assistance against the rapidly advancing Austrians, during the Ottoman–Habsburg War. However, Aurangzeb and his forces were heavily engaged in the Deccan Wars against the Marathas to commit any formal assistance to their Ottoman allies.\n\nRelations with the English\n\nIn 1686, the English East India Company, which had unsuccessfully tried to obtain a firman, an imperial directive that would grant England regular trading privileges throughout the Mughal empire, initiated the so-called Child's War. This hostility against the empire ended in disaster for the English, particularly when Aurangzeb dispatched a strong fleet from Janjira commanded by the Sidi Yaqub and manned by Mappila loyal to Ali Raja Ali II and Abyssinian sailors firmly blockaded Bombay in 1689. In 1690, the company sent envoys to Aurangzeb's camp to plead for a pardon. The company's envoys had to prostrate themselves before the emperor, pay a large indemnity, and promise better behaviour in the future.\n\nIn September 1695, English pirate Henry Every perpetrated one of the most profitable pirate raids in history with his capture of a Grand Mughal convoy near Surat. The Indian ships had been returning home from their annual pilgrimage to Mecca when the pirates struck, capturing the Ganj-i-Sawai, reportedly the greatest ship in the Muslim fleet, and its escorts in the process. When news of the piracy reached the mainland, a livid Aurangzeb nearly ordered an armed attack against the English-governed city of Bombay, though he finally agreed to compromise after the East India Company promised to pay financial reparations, estimated at £600,000 by the Mughal authorities. Meanwhile, Aurangzeb shut down four of the East India Company's factories, imprisoned the workers and captains (who were nearly lynched by a rioting mob), and threatened to put an end to all English trading in India until Every was captured. The Privy Council and East India Company offered a massive bounty for Every's apprehension, leading to the first worldwide manhunt in recorded history. However, Every successfully eluded capture.\n\nIn 1702, Aurangzeb sent Daud Khan Panni, the Mughal Empire's Subhedar of the Carnatic region, to besiege and blockade Fort St. George for more than three months. The governor of the fort Thomas Pitt was instructed by the English East India Company to sue for peace.\n\nAdministrative reforms\n\nRevenue\n\nAurangzeb's exchequer raised a record £100 million in annual revenue through various sources like taxes, customs and land revenue, et al. from 24 provinces. He had an annual yearly revenue of $450 million, more than ten times that of his contemporary Louis XIV of France.\n\nCoins\n\nFile:035Aur1.jpg|Half rupee\nFile:Silver Rupee of Aurangazeb AH1096.jpg|Rupee coin showing full name\nFile:047aur13.jpg|Rupee with square area\nFile:074aur-12.JPG|A copper dam of Aurangzeb\n\nAurangzeb felt that verses from the Quran should not be stamped on coins, as done in former times, because they were constantly touched by the hands and feet of people. His coins had the name of the mint city and the year of issue on one face, and, the following couplet on other:\n\nRebellions\n\nBy 1700, the Marathas attacked the Mughal provinces from the Deccan and secessionist agendas from the Rajputs, Hindu Jats, Pashtuns and Sikhs  rebelled against  the Mughal Empire's administrative and economic systems.\n* In 1669, the Hindu Jat peasants of Bharatpur around Mathura rebelled and created Bharatpur state but were defeated.\n* In 1659, Shivaji, launched a surprise attack on the Mughal Viceroy Shaista Khan and, while waging war against Aurangzeb. Shivaji and his forces attacked the Deccan, Janjira and Surat and tried to gain control of vast territories. In 1689 Aurangzeb's armies captured Shivaji's son  Sambhaji  and executed him after he had sacked Burhanpur. But, the Marathas continued the fight and it actually started the terminal decline of his empire.\n* In 1679, the Rathore clan under the command of Durgadas Rathore rebelled when Aurangzeb didn't give permission to make the young Rathore prince the king and took direct command of Jodhpur. This incident caused great unrest among the Hindu Rajput rulers under Aurangzeb and led to many rebellions in Rajputana.\n* In 1672, the Satnami, a sect concentrated in an area near Delhi, under the leadership of Bhirbhan, took over the administration of Narnaul, but they were eventually crushed upon Aurangzeb's personal intervention with very few escaping alive.\n* In 1671, the Battle of Saraighat was fought in the easternmost regions of the Mughal Empire against the Ahom Kingdom. The Mughals led by Mir Jumla II and Shaista Khan attacked and were defeated by the Ahoms.\n* Maharaja Chhatrasal was a medieval Indian warrior from Bundela Rajput clan, who fought against the Mughal Emperor Aurangzeb, and established his own kingdom in Bundelkhand, becoming a Maharaja of Panna.Bhagavānadāsa Gupta, Contemporary Sources of the Mediaeval and Modern History of Bundelkhand (1531–1857), vol. 1 (1999). .\n\nJat rebellion\n\nIn 1669,  Hindu Jats began to organise a rebellion that is believed to have been caused by Aurangzeb's imposition of Jizya (a form of organised religious taxation). The Jats were led by Gokula, a rebel landholder from Tilpat. By the year 1670 20,000 Jat rebels were quelled and the Mughal Army took control of Tilpat, Gokula's personal fortune amounted to 93,000 gold coins and hundreds of thousands of silver coins.\n\nGokula was caught and executed. But the Jats continued to terrorise the Mughals. Raja Ram Jat, in order to avenge his father Gokula's death, plundered Akbar's tomb of its gold, silver and fine carpets, opened Akbar's grave and dragged Akbar's bones and burned them in retaliation.Vīrasiṃha, 2006, [https://books.google.com.sg/books?isbn\n8188629529 \"The Jats: Their Role & Contribution to the Socio-economic Life and Polity of North & North-west India, Volume 2\"], University of Michigan, Page 100-102.Edward James Rap;son, Sir Wolseley Haig and Sir Richard, 1937, [https://books.google.com.sg/books?id\nyoI8AAAAIAAJ \"The Cambridge History of India\"], Cambridge University Press, Volume 4, pp.305.Waldemar Hansen, 1986, [https://books.google.com.sg/books?isbn\n812080225X \"The Peacock Throne: The Drama of Mogul India\"], Page 454.Reddy, 2005, [https://books.google.com.sg/books?isbn\n0070604479 \"General Studies History for UPSC\"], Tata McGraw-Hill, Page B-46.Catherine Blanshard Asher, Catherine Ella Blanshard Asher, 1992, [https://books.google.com.sg/books?isbn\n0521267285 \"Architecture of Mughal India – Part 1\"], Cambridge university Press, Volume 4, Page 108. Jats also shot off the tops of the minarets on the gateway to Akbar's Tomb and melted down two silver doors from the Taj Mahal.Lucy Peck,  2011, [https://books.google.com.sg/books?id\nZtFbBAAAQBAJ&pgPT44&dq\njats+melted+down+two+silver+doors&hlen&sa\nX&ved0ahUKEwiO-fHvk9DXAhXIwI8KHVWMAogQ6AEIJTAA#v\nonepage&qjats%20melted%20down%20two%20silver%20doors&f\nfalse The Architectural Heritage], INTACH.Sir Harry Hamilton Johnston, Leslie Haden Guest, 1937, [https://books.google.com.sg/books?id\nSvkqAAAAIAAJ The World of To-day: The Marvels of Nature and the Creations of Man], Volume 2, p. 510Ernest Binfield Havell, 1904, [https://books.google.com.sg/books?id\nAmgLAAAAIAAJ&qjats+melted+down+two+silver+doors&dq\njats+melted+down+two+silver+doors&hlen&sa\nX&ved0ahUKEwiO-fHvk9DXAhXIwI8KHVWMAogQ6AEIMDAC A Handbook to Agra and the Taj: Sikandra, Fatehpur-Sikri and the Neighbourhood], p. ci.Frederic Courtland Penfield, 1907, [https://books.google.com.sg/books?id7X9Q_rOFzZIC&q\njats+melted+down+two+silver+doors&dqjats+melted+down+two+silver+doors&hl\nen&saX&ved\n0ahUKEwiO-fHvk9DXAhXIwI8KHVWMAogQ6AEIPTAF East of Suez Ceylon, India, China, and Japan], p. 179. However, Jats later established their independent state of Bharatpur.\n\nMughal–Maratha Wars\n\nIn 1657, while Aurangzeb attacked Golconda and Bijapur in the Deccan, the Hindu Maratha warrior aristocrat, Shivaji, used guerrilla tactics to take control of three Adil Shahi forts formerly under his father's command. With these victories, Shivaji assumed de facto leadership of many independent Maratha clans. The Marathas harried the flanks of the warring Adil Shahis and Mughals, gaining weapons, forts, and territory. Shivaji's small and ill-equipped army survived an all out Adil Shahi attack, and Shivaji personally killed the Adil Shahi general, Afzal Khan. With this event, the Marathas transformed into a powerful military force, capturing more and more Adil Shahi and Mughal territories. Shivaji went on to neutralise Mughal power in the region.\n\nIn 1659, Aurangzeb sent his trusted general and maternal uncle Shaista Khan, the Wali in Golconda to recover forts lost to the Maratha rebels. Shaista Khan drove into Maratha territory and took up residence in Pune. But in a daring raid on the governor's palace in Pune during a midnight wedding celebration, led by Shivaji himself, the Marathas killed Shaista Khan's son and Shivaji maimed Shaista Khan by cutting off three fingers of his hand. Shaista Khan, however, survived and was re-appointed the administrator of Bengal going on to become a key commander in the war against the Ahoms.\n\nShivaji captured forts belonging to both Mughals and Bijapur. At last Aurangzeb ordered the armament of the Daulatabad Fort with two bombards (the Daulatabad Fort was later used as a Mughal bastion during the Deccan Wars). Aurangzeb also sent his general Raja Jai Singh of Amber, a Hindu Rajput, to attack the Marathas. Jai Singh won the fort of Purandar after fierce battle in which the Maratha commander Murarbaji fell. Foreseeing defeat, Shivaji agreed for a truce and a meeting with Aurangzeb at Delhi. Jai Singh also promised Shivaji his safety, placing him under the care of his own son, the future Raja Ram Singh I. However, circumstances at the Mughal court were beyond the control of the Raja, and when Shivaji and his son Sambhaji went to Agra to meet Aurangzeb, they were placed under house arrest, from which they managed to effect a daring escape.\n\nShivaji returned to the Deccan, and crowned himself Chhatrapati or the ruler of the Maratha Kingdom in 1674. While Aurangzeb continued to send troops against him, Shivaji expanded Maratha control throughout the Deccan until his death in 1680. Shivaji was succeeded by his son, Sambhaji. Militarily and politically, Mughal efforts to control the Deccan continued to fail.\n\nOn the other hand, Aurangzeb's third son Akbar left the Mughal court along with a few Muslim Mansabdar supporters and joined Muslim rebels in the Deccan. Aurangzeb in response moved his court to Aurangabad and took over command of the Deccan campaign. The rebels were defeated and Akbar fled south to seek  refuge with Sambhaji, Shivaji's successor. More battles ensued, and Akbar fled to Persia and never returned.\n\nIn 1689, Aurangzeb's forces captured  and executed Sambhaji. His successor Rajaram, later Rajaram's widow Tarabai and their Maratha forces fought individual battles against the forces of the Mughal Empire. Territory changed hands repeatedly during the years (1689–1707)  of interminable warfare . As there was no central authority among the Marathas, Aurangzeb was forced to contest every inch of territory, at great cost in lives and money. Even as Aurangzeb drove west, deep into Maratha territory – notably conquering Satara — the Marathas expanded their attacks further into Mughal lands – Malwa, Hyderabad and Jinji in Tamil Nadu. Aurangzeb waged continuous war in the Deccan for more than two decades with no resolution. He thus lost about a fifth of his army fighting rebellions led by the Marathas in Deccan India. He travelled a long distance to the Deccan to conquer the Marathas and eventually died at the age of 90, still fighting the Marathas.\n\nAurangzeb's shift from conventional warfare to anti-insurgency in the Deccan region shifted the paradigm of Mughal military thought. There were conflicts between Marathas and Mughals in Pune, Jinji, Malwa and Vadodara. The Mughal Empire's port city of Surat was sacked twice by the Marathas during the reign of Aurangzeb and the valuable port was in ruins. \nMatthew White estimates that about 2.5 million of Aurangzeb's army were killed during the Mughal–Maratha Wars (100,000 annually during a quarter-century), while 2 million civilians in war-torn lands died due to drought, plague and famine. \n\nFile:A portrait probably made by a Mughal artist, in the Deccan, during Aurangzeb's military campaigns there.jpg|A Mughal trooper in the Deccan.\nFile:Bhavanidas. The Emperor Aurangzeb Carried on a Palanquin ca. 1705–20 Metripolitan Museum of Art..jpg|Aurangzeb leads his final expedition (1705), leading an army of 500,000 troops.\nFile:Prince with rifle.jpg|Mughal-era aristocrat armed with a matchlock musket.\n\nAhom campaign\n\nWhile Aurangzeb and his brother Shah Shuja had been fighting against each other, the Hindu rulers of Kuch Behar and Assam took advantage of the disturbed conditions in the Mughal Empire, had invaded imperial dominions. For three years they were not attacked, but in 1660 Mir Jumla II, the viceroy of Bengal, was ordered to recover the lost territories.\n\nThe Mughals set out in November 1661, and within weeks occupied the capital of Kuch Behar after a few fierce skirmishes. The Kuch Behar was annexed, and the Mughal Army reorganised and began to retake their territories in Assam. Mir Jumla II's forces captured Pandu, Guwahati, and Kajali practically unopposed. In February 1662, Mir Jumla II initiated the Siege of Simalugarh and after the Mughal cannon breached the fortifications, the Ahoms abandoned the fort and escaped. Mir Jumla II then proceeded towards Garhgaon the capital of the Ahom kingdom, which was reached on 17 March 1662, although the ruler Raja Sutamla fled and the victorious Mughals captured 100 elephants, about 300,000 coins of silver, 8000 shields, 1000 ships, and 173 massive stores of rice.\n\nLater that year in December 1663, the aged Mir Jumla II died on his way back to Dacca of natural causes, but skirmishes continued between the Mughals and Ahoms after the rise of Chakradhwaj Singha, who refused to pay further indemnity to the Mughals and during the wars that continued the Mughals suffered great hardships. Munnawar Khan emerged as a leading figure and is known to have supplied food to vulnerable Mughal forces in the region near Mathurapur. Although the Mughals under the command of Syed Firoz Khan the Faujdar at Guwahati were overrun by two Ahom armies in the year 1667, but they continued to hold and maintain presence along their the eastern territories even after the Battle of Saraighat in the year 1671.\n\nThe Battle of Saraighat was fought in 1671 between the Mughal empire (led by the Kachwaha king, Raja Ramsingh I), and the Ahom Kingdom (led by Lachit Borphukan) on the Brahmaputra river at Saraighat, now in Guwahati. Although much weaker, the Ahom Army defeated the Mughal Army by brilliant uses of the terrain, clever diplomatic negotiations to buy time, guerrilla tactics, psychological warfare, military intelligence and by exploiting the sole weakness of the Mughal forces—its navy.\n\nThe Battle of Saraighat was the last battle in the last major attempt by the Mughals to extend their empire into Assam. Though the Mughals managed to regain Guwahati briefly after a later Borphukan deserted it, the Ahoms wrested control in the Battle of Itakhuli in 1682 and maintained it till the end of their rule.Sarkar, J. N. (1992), \"Chapter VIII Assam-Mughal Relations\", in Barpujari, H. K., The Comprehensive History of Assam 2, Guwahati: Assam Publication Board, pp. 148–256\n\nSatnami opposition\n\nIn May 1672, the Satnami sect obeying the commandments of an \"old toothless woman\" (according to Mughal accounts) organised a massive revolt in the agricultural heartlands of the Mughal Empire. The Satnamis were known to have shaved off their heads and even eyebrows and had temples in many regions of Northern India. They began a large-scale rebellion 75 miles southwest of Delhi.\n\nThe Satnamis believed they were invulnerable to Mughal bullets and believed they could multiply in any region they entered. The Satnamis initiated their march upon Delhi and overran small-scale Mughal infantry units.\n\nAurangzeb responded by organising a Mughal army of 10,000 troops and artillery, and dispatched detachments of his own personal Mughal imperial guards to carry out several tasks. To boost Mughal morale, Aurangzeb wrote Islamic prayers, made amulets, and drew designs that would become emblems in the Mughal Army. This rebellion would have a serious aftermath effect on the Punjab.\n\nSikh opposition\n\nEarly in Aurangzeb's reign, various insurgent groups of Sikhs engaged Mughal troops in increasingly bloody battles. The ninth Sikh Guru, Guru Tegh Bahadur, like his predecessors was opposed to conversion of the local population as he considered it wrong. According to Sikh sources, approached by Kashmiri Pandits to help them retain their faith and avoid forced religious conversions, Guru Tegh Bahadur took on Aurangzeb. The emperor perceived the rising popularity of the Guru as a threat to his sovereignty and in 1670 had him executed, which infuriated the Sikhs. In response, Guru Tegh Bahadur's son and successor, Guru Gobind Singh, further militarised his followers, starting with the establishment of Khalsa in 1699, eight years before Aurangzeb's death.  In 1705, Guru Gobind Singh sent a letter entitled Zafarnamah to Aurangzeb. This drew attention to Aurangzeb's cruelty and how he had betrayed Islam. The letter caused him much distress and remorse. Guru Gobind Singh's formation of Khalsa in 1699 led to the establishment of the Sikh Confederacy and later Sikh Empire.\n\nPashtun opposition\n\nThe Pashtun revolt in 1672 under the leadership of the warrior poet Khushal Khan Khattak of Kabul, was triggered when soldiers under the orders of the Mughal Governor Amir Khan allegedly molested women of the Pashtun tribes in modern-day Kunar Province of Afghanistan. The Safi tribes retaliated against the soldiers. This attack provoked a reprisal, which triggered a general revolt of most of tribes. Attempting to reassert his authority, Amir Khan led a large Mughal Army to the Khyber Pass, where the army was surrounded by tribesmen and routed, with only four men, including the Governor, managing to escape.\n\nAfter that the revolt spread, with the Mughals suffering a near total collapse of their authority in the  Pashtun belt. The closure of the important Attock-Kabul trade route along the Grand Trunk road was particularly disastrous. By 1674, the situation had deteriorated to a point where Aurangzeb camped at Attock to personally take charge. Switching to diplomacy and bribery along with force of arms, the Mughals eventually split the rebels and partially suppressed the revolt, although they never managed to wield effective authority outside the main trade route.\n\nDeath and legacy\n\nBy 1689, almost all of Southern India was a part of the Mughal Empire and after the conquest of Golconda, Mughal victories in the south expanded the Mughal Empire to 4 million square kilometres, with a population estimated to be over 158 million. But this supremacy was short-lived. Jos Gommans, Professor of Colonial and Global History at the University of Leiden, says that \"... the highpoint of imperial centralisation under emperor Aurangzeb coincided with the start of the imperial downfall.\"\n\nUnlike his predecessors, Aurangzeb considered the royal treasury to be held in trust for the citizens of his empire. He made caps and copied the Quran to earn money for his use,.Dasgupta, K., 1975. How Learned Were the Mughals: Reflections on Muslim Libraries in India. The Journal of Library History (1974–1987), 10(3), pp.241–254.Qadir, K.B.S.S.A., 1936. The Cultural Influences of Islam in India. Journal of the Royal Society of Arts, pp.228–241. Aurangzeb constructed a small marble mosque known as the Moti Masjid (Pearl Mosque) in the Red Fort complex in Delhi. However, his constant warfare, especially with the Marathas, drove his empire to the brink of bankruptcy just as much as the wasteful personal spending and opulence of his predecessors.\n\nThe Indologist Stanley Wolpert, emeritus professor at UCLA, says that:\n\nEven when ill and dying, Aurangzeb made sure that the populace knew he was still alive, for if they had thought otherwise then the turmoil of another war of succession was likely. He died in Ahmednagar on 20 February 1707 at the age of 88, having outlived many of his children. His modest open-air grave in Khuldabad expresses his deep devotion to his Islamic beliefs. It is sited in the courtyard of the shrine of the Sufi saint Shaikh Burhan-u'd-din Gharib, who was a disciple of Nizamuddin Auliya of Delhi.\n\nBrown writes that after his death, \"a string of weak emperors, wars of succession, and coups by noblemen heralded the irrevocable weakening of Mughal power\". She notes that the populist but \"fairly old-fashioned\" explanation for the decline is that there was a reaction to Aurangzeb's oppression. Aurangzeb's son, Bahadur Shah I, succeeded him and the empire, both because of Aurangzeb's over-extension and because of Bahadur Shah's weak military and leadership qualities, entered a period of terminal decline. Immediately after Bahadur Shah occupied the throne, the Maratha Empire – which Aurangzeb had held at bay, inflicting high human and monetary costs even on his own empire – consolidated and launched effective invasions of Mughal territory, seizing power from the weak emperor. Within decades of Aurangzeb's death, the Mughal Emperor had little power beyond the walls of Delhi.\n\nAurangweb's religious zeal exacted a heavy price both to himself and his nation. Will Durant states:Will Durant, p.475\n\nDuring British rule of India, a road in Delhi was named Aurangzeb road. In November 2014, it was renamed to Dr APJ Abdul Kalam Road. \n\nCriticism\n\nHis critics argue that his ruthless and vindictive religious bigotry made him unsuitable to rule the mixed population of his empire and policies of persecution of Shias, Sufis and non-Muslims to impose practices of orthodox Islamic state, such as imposition of sharia and jizya religious tax on non-Muslims, doubling of custom duties on Hindus while abolishing it for Muslims, executions of Muslims and non-Muslims, destruction of temples, forbidding construction and repairs of some temples, which they argue led to numerous rebellions.Kenneth Pletcher, 2010, [https://books.google.com.sg/books?id\nhdmcAAAAQBAJ&pgPA183&dq\naurangzeb+policies+of+religious+persecution+led+to+numerous+rebellions,&hlen&sa\nX&ved0ahUKEwjSlNvy_87XAhWHYo8KHfd3B4wQ6AEISTAI#v\nonepage&qaurangzeb%20policies%20of%20religious%20persecution%20led%20to%20numerous%20rebellions%2C&f\nfalse \"The History of India.\"], Britannica Educational Publishing, p. 183]Paul Joseph, 2016, [https://books.google.com.sg/books?id\nidw0DQAAQBAJ&pgPA433&dq\naurangzeb+policies+of+religious+persecution+led+to+numerous+rebellions,&hlen&sa\nX&ved0ahUKEwjSlNvy_87XAhWHYo8KHfd3B4wQ6AEIPDAF#v\nonepage&qaurangzeb%20policies%20of%20religious%20persecution%20led%20to%20numerous%20rebellions%2C&f\nfalse \"The SAGE Encyclopedia of War: Social Science Perspectives.\"], SAGE Publications, p. 432-433.Marie Cruz Gabriel, 1996, [https://books.google.com.sg/books?idCiklIzcTIYUC&pg\nRA1-PA71&dqaurangzeb+policies+of+religious+persecution+led+to+numerous+rebellions,&hl\nen&saX&ved\n0ahUKEwjSlNvy_87XAhWHYo8KHfd3B4wQ6AEITzAJ#vonepage&q\naurangzeb%20policies%20of%20religious%20persecution%20led%20to%20numerous%20rebellions%2C&ffalse \"A Silence in the City and Other Stories.\"], Orient Longman Publishing, p. 71]Craig A. Lockard, 2014,[https://books.google.com.sg/books?id\nDLQeSBLpUwsC&pgPA77&lpg\nPA77&dqSansani+fort+jat&source\nbl&otsKJzEoLMFob&sig\nJoJXcu4DvHMswllb60TgATnF_SU&hlen&sa\nX&ved0ahUKEwjNsMjV_c7XAhUHrI8KHfAlA7cQ6AEIJTAA#v\nonepage&qSansani%20fort%20jat&f\nfalse \"Societies, Networks, and Transitions, Volume II: Since 1450: A global history.\"], Cengage, p.415]G. N. Moin Shakir and Sarma Festschrift, 1989, [https://books.google.com.sg/books?id\nx_gQAQAAIAAJ \"Religion State And Politics In India.\"], p. 47]Jiu-Hwa L. Upshur, Janice J. Terry, Jim Holoka, 2011, [https://books.google.com.sg/books?id\nmBo-2D0TKUcC&pgPA527&dq\naurangzeb+policies+of+religious+persecution+led+to+numerous+rebellions,&hlen&sa\nX&ved0ahUKEwjQ6cK9is_XAhUJMY8KHdoKCKQ4ChDoAQg3MAQ#v\nonepage&qaurangzeb%20policies%20of%20religious%20persecution%20led%20to%20numerous%20rebellions%2C&f\nfalse \"Cengage Advantage Books: World History.\"], Wadsworth Cengage,p. 527.Amy Chua, 2009, [https://books.google.com.sg/books?isbn\n0307472450 \"Day of Empire: How Hyperpowers Rise to Global Dominance—and Why They Fall.\"], Anchor Books, p. 189. G. N. Moin Shakir and Sarma Festschrift argue that he often used political opposition as pretext for religious persecution, and that, as a result, Jats, Marathas, Sikhs, Satnamis and Pashtuns all rose against him.Ashvini Agrawal, 1983, [https://books.google.com.sg/books?isbn\n8120823265 \"Studies in Mughal History.\"], p. 15], He also fought and eventually lost wars with the Ahom kingdom.\n\nFull title\n\nAurangzeb's full imperial title was:\n\nAl-Sultan al-Azam wal Khaqan al-Mukarram Hazrat Abul Muzaffar Muhy-ud-Din Muhammad Aurangzeb Bahadur Alamgir I,\nBadshah Ghazi, \nShahanshah-e-Sultanat-ul-Hindiya Wal Mughaliya.\n\nIn literature \n\nAurangzeb has prominently featured in the following books\n* 19?? – Hindi fiction novel by Acharya Chatursen Shastri\n* 1970 – Shahenshah (), the Marathi fictional biography by N S Inamdar\n* 2017 – Shahenshah – The Life of Aurangzeb, the English translation by Vikrant Pande of the 1970 Marathi fictional biography by N S Inamdar",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Aurangzeb" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2425" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Muhi-ud-Din Muhammad () (3 November 1618 – 3 March 1707), commonly known by the sobriquet Aurangzeb ( \"Ornament of the Throne\") or by his regnal title Alamgir ( \"Conqueror of the World\"), was the sixth, and widely considered the last effective Mughal emperor. His reign lasted for 49 years from 1658 until his death in 1707.\n\nAurangzeb was a notable expansionist and during his reign, the Mughal Empire reached its greatest extent, ruling over nearly all of the Indian subcontinent. During his lifetime, victories in the south expanded the Mughal Empire to 4 million square kilometres, and he ruled over a population estimated to be over 158 million subjects, with an annual yearly revenue of $450 million (more than ten times that of his contemporary Louis XIV of France), or £38,624,680 (2,879,469,894 rupees) in 1690.http://www.fampeople.com/cat-aurangzebConnections, A World History, Volume 1: World history, World history by CTI Reviews Under his reign, India surpassed China once again to become the world's largest economy, worth over $90 billion, nearly a quarter of world GDP in 1700.Maddison, Angus (2003): [https://books.google.com/books?idrHJGz3HiJbcC&pg\nPA259 Development Centre Studies The World Economy Historical Statistics: Historical Statistics], OECD Publishing, , pages 259–261\n\nAurangzeb has been subject to controversy and criticism for his policies that abandoned his predecessors' legacy of pluralism and religious tolerance, citing his introduction of the Jizya tax, destruction of Hindu temples, and execution of the ninth Sikh guru, Guru Tegh Bahadur. Abraham Eraly (2000), Emperors of the Peacock Throne: The Saga of the Great Mughals, Penguin Books, , pages 398–399. According to Abraham Eraly, \"in 1670, all temples around Ujjain were destroyed\" and later \"300 temples were destroyed in and around Chitor, Udaipur and Jaipur\" among other Hindu temples destroyed elsewhere in campaigns through 1705.Avari writes, \"Aurangzeb's religious policy caused friction between him and the ninth Sikh guru, Tegh Bahadur. In both Punjab and Kashmir the Sikh leader was roused to action by Aurangzeb's excessively zealous Islamic policies. Seized and taken to Delhi, he was called upon by Aurangzeb to embrace Islam and, on refusal, was tortured for five days and then beheaded in November 1675. Two of the ten Sikh gurus thus died as martyrs at the hands of the Mughals. (Avari (2013), page 155) while a minority of historians question this, arguing that his destruction of temples has been exaggerated, and noting that he also built temples, also destroyed Islamic mosques, paid for the maintenance of temples, employed significantly more Hindus in his imperial bureaucracy than his predecessors did, and opposed bigotry against Hindus and Shia Muslims.\n\nIt was at the end of his reign that the downfall of the Mughal Empire began. Rebellions and wars eventually led to the exhaustion of the imperial Mughal treasury and army. He was a strong-handed authoritarian ruler, and following his death the expansionary period of the Mughal Empire came to an end. Nevertheless, the contiguous territory of the Mughal Empire still remained intact more or less until the reign of Muhammad Shah.\n\nEarly life\n\nAurangzeb was born on 3 November 1618, in Dahod, Gujarat. He was the third son and sixth child of Shah Jahan and Mumtaz Mahal. In June 1626, after an unsuccessful rebellion by his father, Aurangzeb and his brother Dara Shukoh were kept as hostages under their grandparents' (Nur Jahan and Jahangir) Lahore court. On 26 February 1628, Shah Jahan was officially declared the Mughal Emperor, and Aurangzeb returned to live with his parents at Agra Fort, where Aurangzeb received his formal education in Arabic and Persian. His daily allowance was fixed at Rs. 500, which he spent on religious education and the study of history.\n\nOn 28 May 1633, Aurangzeb escaped death when a powerful war elephant stampeded through the Mughal Imperial encampment. He rode against the elephant and struck its trunk with a lance, and successfully defended himself from being crushed. Aurangzeb's valour was appreciated by his father who conferred him the title of Bahadur (Brave) and had him weighed in gold and presented gifts worth Rs. 200,000. This event was celebrated in Persian and Urdu verses, and Aurangzeb said:\n\nEarly military campaigns and administration\n\nBundela War\n\nAurangzeb was nominally in charge of the force sent to Bundelkhand with the intent of subduing the rebellious ruler of Orchha, Jhujhar Singh, who had attacked another territory in defiance of Shah Jahan's policy and was refusing to atone for his actions. By arrangement, Aurangzeb stayed in the rear, away from the fighting, and took the advice of his generals as the Mughal Army gathered and commenced the Siege of Orchha in 1635.The campaign was successful and Singh was removed from power.\n\nViceroy of the Deccan\n\nAurangzeb was appointed viceroy of the Deccan in 1636. After Shah Jahan's vassals had been devastated by the alarming expansion of Ahmednagar during the reign of the Nizam Shahi boy-prince Murtaza Shah III, the emperor dispatched Aurangzeb, who in 1636 brought the Nizam Shahi dynasty to an end.George Michell and Mark Zebrowski, Architecture and Art of the Deccan Sultanates, (Cambridge University Press, 1999), 12. In 1637, Aurangzeb married the Safavid princess Dilras Banu Begum, posthumously known as Rabia-ud-Daurani. She was his first wife and chief consort as well as his favourite. He also had an infatuation with a slave girl, Hira Bai, whose death at a young age greatly affected him. In his old age, he was under the charms of his concubine, Udaipuri Bai. The latter had formerly been a companion to Dara Shikoh. In the same year, 1637, Aurangzeb was placed in charge of annexing the small Rajput kingdom of Baglana, which he did with ease.\n\nIn 1644, Aurangzeb's sister, Jahanara, was burned when the chemicals in her perfume were ignited by a nearby lamp while in Agra. This event precipitated a family crisis with political consequences. Aurangzeb suffered his father's displeasure by not returning to Agra immediately but rather three weeks later. Shah Jahan had been nursing Jahanara back to health in that time and thousands of vassals had arrived in Agra to pay their respects. Shah Jahan was outraged to see Aurangzeb enter the interior palace compound in military attire and immediately dismissed him from his position of viceroy of the Deccan; Aurangzeb was also no longer allowed to use red tents or to associate himself with the official military standard of the Mughal emperor. Other sources tell us that Aurangzeb was dismissed from his position because Aurangzeb left the life of luxury and became a Faqir.Ahmad, Fazl. Heroes of Islam. Lahore: Sh. Muhammad Ashraff, 1993. Print.\n\nIn 1645, he was barred from the court for seven months and mentioned his grief to fellow Mughal commanders. Thereafter, Shah Jahan appointed him governor of Gujarat where he served well and was rewarded for bringing stability.\n\nIn 1647, Shah Jahan moved Aurangzeb from Gujarat to be governor of Balkh, replacing a younger son, Murad Baksh, who had proved ineffective there. The area was under attack from Uzbek and Turkmen tribes. Whilst the Mughal artillery and muskets were a formidable force, so too were the skirmishing skills of their opponents. The two sides were in stalemate and Aurangzeb discovered that his army could not live off the land, which was devastated by war. With the onset of winter, he and his father had to make a largely unsatisfactory deal with the Uzbeks, giving away territory in exchange for nominal recognition of Mughal sovereignty. The Mughal force suffered still further with attacks by Uzbeks and other tribesmen as it retreated through snow to Kabul. By the end of this two-year campaign, into which Aurangzeb had been plunged at a late stage, a vast sum of money had been expended for little gain.\n\nFurther inauspicious military involvements followed, as Aurangzeb was appointed governor of Multan and Sindh. His efforts in 1649 and 1652 to dislodge the Safavids at Kandahar, which they had recently retaken after a decade of Mughal control, both ended in failure as winter approached. The logistical problems of supplying an army at the extremity of the empire, combined with the poor quality of armaments and the intransigence of the opposition have been cited by John Richards as the reasons for failure, and a third attempt in 1653, led by Dara Shikoh, met with the same outcome.\n\nAurangzeb became viceroy of the Deccan again after he was replaced by Dara Shikoh in the attempt to recapture Kandahar. Aurangzeb regretted this and harboured feelings that Shikoh had manipulated the situation to serve his own ends. Aurangbad's two jagirs (land grants) were moved there as a consequence of his return and, because the Deccan was a relatively impoverished area, this caused him to lose out financially. So poor was the area that grants were required from Malwa and Gujarat in order to maintain the administration and the situation caused ill-feeling between father and son. Shah Jahan insisted that things could be improved if Aurangzeb made efforts to develop cultivation. Aurangzeb appointed Murshid Quli Khan to extend to the Deccan the zabt revenue system used in northern India. Murshid Quli Khan organised a survey of agricultural land and a tax assessment on what it produced. To increase revenue, Murshid Quli Khan granted loans for seed, livestock, and irrigation infrastructure. The Deccan returned to prosperity, but too slowly to satisfy the emperor.\n\nAurangzeb proposed to resolve the situation by attacking the dynastic occupants of Golconda (the Qutb Shahis) and Bijapur (the Adil Shahis). As an adjunct to resolving the financial difficulties, the proposal would also extend Mughal influence by accruing more lands. Again, he was to feel that Dara had exerted influence on his father: believing that he was on the verge of victory in both instances, Aurangzeb was frustrated that Shah Jahan chose then to settle for negotiations with the opposing forces rather than pushing for complete victory.\n\nWar of Succession\n\nThe four sons of Shah Jahan all held governorships during their father's reign. The emperor favoured the eldest, Dara Shukoh. This had caused resentment among the younger three, who sought at various times to strengthen alliances between themselves and against Dara. There was no Mughal tradition of primogeniture, the systematic passing of rule, upon an emperor's death, to his eldest son. Instead it was customary for sons to overthrow their father and for brothers to war to the death among themselves. Historian Satish Chandra says that \"In the ultimate resort, connections among the powerful military leaders, and military strength and capacity [were] the real arbiters\". The contest for power was primarily between Dara Shikoh and Aurangzeb because, although all four sons had demonstrated competence in their official roles, it was around these two that the supporting cast of officials and other influential people mostly circulated. There were ideological differences — Dara was an intellectual and a religious liberal in the mould of Akbar, while Aurangzeb was much more conservative — but, as historians Barbara D. Metcalf and Thomas R. Metcalf say, \"To focus on divergent philosophies neglects the fact that Dara was a poor general and leader. It also ignores the fact that factional lines in the succession dispute were not, by and large, shaped by ideology.\" Marc Gaborieau, professor of Indian studies at l'École des Hautes Études en Sciences Sociales, explains that \"The loyalties of [officials and their armed contingents] seem to have been motivated more by their own interests, the closeness of the family relation and above all the charisma of the pretenders than by ideological divides.\" Muslims and Hindus did not divide along religious lines in their support for one pretender or the other nor, according to Chandra, is there much evidence to support the belief that Jahanara and other members of the royal family were split in their support. Jahanara, certainly, interceded at various times on behalf of all of the princes and was well-regarded by Aurangzeb even though she shared the religious outlook of Dara.\n\nIn 1656, a general under Qutb Shahi dynasty named Musa Khan led an army of 12,000 Musketeers to attack Aurangzeb, and later on the same campaign Aurangzeb in turn rode against an army consisting 8,000 horsemen and 20,000 Karnataka Musketeers\n\nHaving made clear that he wanted Dara to succeed him, Shah Jahan became ill with stranguary in 1657 and was closeted under the care of his favourite son in the newly built city of Shahjahanabad (Old Delhi). Rumours of the death of Shah Jahan abounded and the younger sons were concerned that Dara might be hiding it for Machiavellian reasons. Thus, they took action: Shah Shuja In Bengal, where he had been governor since 1637, Prince Muhammad Shuja crowned himself King at RajMahal, and brought his cavalry, artillery and river flotilla upriver towards Agra. Near Varanasi his forces confronted a defending army sent from Delhi under the command of Prince Sulaiman Shukoh, son of Dara Shukoh, and Raja Jai Singhwhile Murad did the same in his governorship of Gujarat and Aurangzeb did so in the Deccan. It is not known whether these preparations were made in the mistaken belief that the rumours of death were true or whether the challengers were just taking advantage of the situation.\n\nAfter regaining some of his health, Shah Jahan moved to Agra and Dara urged him to send forces to challenge Shah Shuja and Murad, who had declared themselves rulers in their respective territories. While Shah Shuja was defeated at Banares in February 1658, the army sent to deal with Murad discovered to their surprise that he and Aurangzeb had combined their forces, the two brothers having agreed to partition the empire once they had gained control of it. The two armies clashed at Dharmat in April 1658, with Aurangzeb being the victor. Shuja was being chased through Bihar and the victory of Aurangzeb proved this to be a poor decision by Dara Shikoh, who now had a defeated force on one front and a successful force unnecessarily pre-occupied on another. Realising that his recalled Bihar forces would not arrive at Agra in time to resist the emboldened Aurangzeb's advance, Dara scrambled to form alliances in order but found that Aurangzeb had already courted key potential candidates. When Dara's disparate, hastily concocted army clashed with Aurangzeb's well-disciplined, battle-hardened force at the Battle of Samugarh in late May, neither Dara's men nor his generalship were any match for Aurangzeb. Dara had also become over-confident in his own abilities and, by ignoring advice not to lead in battle while his father was alive, he cemented the idea that he had usurped the throne. \"After the defeat of Dara, Shah Jahan was imprisoned in the fort of Agra where he spent eight long years under the care of his favourite daughter Jahanara.\"\n\nAurangzeb then broke his arrangement with Murad Baksh, which probably had been his intention all along. Instead of looking to partition the empire between himself and Murad, he had his brother arrested and imprisoned at Gwalior Fort. Murad was executed on 4 December 1661, ostensibly for the murder of the diwan of Gujarat some time earlier. The allegation was encouraged by Aurangzeb, who caused the diwan's son to seek retribution for the death under the principles of Sharia law. Meanwhile, Dara gathered his forces, and moved to the Punjab. The army sent against Shuja was trapped in the east, its generals Jai Singh and Dilir Khan submitted to Aurangzeb, but Dara's son, Suleiman Shikoh, escaped. Aurangzeb offered Shah Shuja the governorship of Bengal. This move had the effect of isolating Dara Shikoh and causing more troops to defect to Aurangzeb. Shah Shuja, who had declared himself emperor in Bengal began to annex more territory and this prompted Aurangzeb to march from Punjab with a new and large army that fought during the Battle of Khajwa, where Shah Shuja and his chain-mail armoured war elephants were routed by the forces loyal to Aurangzeb. Shah Shuja then fled to Arakan (in present-day Burma), where he was executed by the local rulers.The Cambridge History of India (1922), vol. IV, p. 481.\n\nWith Shuja and Murad disposed of, and with his father immured in Agra, Aurangzeb pursued Dara Shikoh, chasing him across the north-western bounds of the empire. Aurangzeb claimed that Dara was no longer a Muslim and accused him of poisoning the Mughal Grand Vizier Saadullah Khan. After a series of battles, defeats and retreats, Dara was betrayed by one of his generals, who arrested and bound him. In 1658, Aurangzeb arranged his formal coronation in Delhi.\n\nOn 10 August 1659, Dara was executed on grounds of apostasy and his head was sent to Shahjahan.  Having secured his position, Aurangzeb confined his frail father at the Agra Fort but did not mistreat him. Shah Jahan was cared for by Jahanara and died in 1666.\n\nReign\n\nBureaucracy\n\nAurangzeb's imperial bureaucracy employed significantly more Hindus than that of his predecessors. Between 1679 and 1707, the number of Hindu officials in the Mughal administration rose by half, many of them Marathas and Rajputs. His increasing employment of Hindus and Shia Muslims was deemed controversial at the time, with several of his fellow Sunni Muslim officials petitioning against it, which he rejected, and responded, \"What connection have earthly affairs with religion? And what right have administrative works to meddle with bigotry? 'For you is your religion and for me is mine.'\" He insisted on employment based on ability rather than religion.\n\nUnder Aurangzeb's reign, Hindus rose to represent 31.6% of Mughal nobility, the highest in the Mughal era. This was largely due to a substantial influx of Marathas, who played a key role in his successful Deccan campaign. During his time, the number of Hindu Mansabdars increased from 22% to over 31% in the Mughal administration, as he needed them to continue his fight in the Deccan. However, one of his Rajput nobles, Jaswant Singh of Jodhpur, Hindu ruler of Jodhpur, “destroyed mosques and built idol-temples in their stead” around 1658–1659, according to Aurangzeb. Despite this, relationships did not turn sour between the two, as they worked together for the next two decades up until Singh's death in the late 1670s.\n\nEstablishment of Islamic law\n\nHistorian Katherine Brown has noted that \"The very name of Aurangzeb seems to act in the popular imagination as a signifier of politico-religious bigotry and repression, regardless of historical accuracy.\" The subject has also resonated in modern times with popularly accepted claims that he intended to destroy the Bamiyan Buddhas. As a political and religious conservative, Aurangzeb chose not to follow the secular religious viewpoints of his predecessors after his ascension. Shah Jahan had already moved away from the liberalism of Akbar, although in a token manner rather than with the intent of suppressing Hinduism, and Aurangzeb took the change still further. Though the approach to faith of Akbar, Jahangir and Shah Jahan was more syncretic than Babur, the founder of the empire, Aurangzeb's position is not so obvious. His emphasis on sharia competed, or was directly in conflict, with his insistence that zawabit or secular decrees could supersede sharia. Despite claims of sweeping edicts and policies, contradictory accounts exist. He sought to codify Hanafi law by the work of several hundred jurists, called Fatawa-e-Alamgiri. It is possible the War of Succession and continued incursions combined with Shah Jahan's spending made cultural expenditure impossible.\n\nAs emperor, Aurangzeb banned the drinking of alcohol, gambling, castration, servitude, eunuchs, music, nautch and narcotics in the Mughal Empire. He learnt that at Sindh, Multan, Thatta and particularly at Varanasi, the Hindu Brahmins attracted large numbers of indigenous local Muslims to their discourses. He ordered the Subahdars of these provinces to demolish the schools and the temples of non-Muslims. Aurangzeb also ordered Subahdars to punish Muslims who dressed like non-Muslims. The executions of the antinomian Sufi mystic Sarmad Kashani and the ninth Sikh Guru Tegh Bahadur bear testimony to Aurangzeb's religious policy; the former was beheaded on multiple accounts of heresy, the latter, according to Sikhs, because he objected to Aurangzeb's forced conversions.\n\nTaxation policy\n\nHe imposed Jizya, a military tax on non-Muslims who were not fighting for Mughal Empire in his second decade on ruling in the year 1679.http://www.sscnet.ucla.edu/southasia/History/Mughals/Aurang3.html Further, Aurangzeb levied discriminatory taxes on Hindu merchants at the rate of 5% as against 2.5% on Muslim  merchants. He ordered to dismiss Hindu quanungos and patwaris from revenue administration.[https://books.google.co.in/books?id\nFduG_t2sxwMC&pgPA190&lpg\nPA190&dqAurangzeb+levied+taxes+on+Hindu+merchants&source\nbl&otsoB7CXi8_jU&sig\n0j_ngj7f-EG9pS7wRGcTcC5kCOw&hlen&sa\nX&ved0CE4Q6AEwCWoVChMIp8vfk-nLyAIVC3KOCh2JHQYM#v\nonepage&qAurangzeb%20levied%20taxes%20on%20Hindu%20merchants&f\nfalse Islam in South Asia: A Short History By Jamal Malik][https://books.google.co.in/books?idLXkGCAAAQBAJ&pg\nPA462&lpgPA462&dq\naurangzeb+on+taxing+hindu+merchants&sourcebl&ots\nIFubGUGbKA&sigvEMFDfbdHy0-Ncrc3Zh-ugSGobM&hl\nen&saX&ved\n0CCsQ6AEwAmoVChMIgJC4_efLyAIVzxuOCh2p-wyF#vonepage&q\naurangzeb%20on%20taxing%20hindu%20merchants&ffalse Encyclopedia of World Trade: From Ancient Times to the Present][https://books.google.co.in/books?id\nsxhAtCflwOMC&pgPA260&lpg\nPA260&dqaurangzeb+on+dismissing+hindu+officials&source\nbl&otsUILXXYHenD&sig\nP0p47pC-lRLhfsXl94jWP0oplSM&hlen&sa\nX&ved0CBsQ6AEwADgKahUKEwjHhcyT6cvIAhWKGY4KHWOjAss#v\nonepage&qaurangzeb%20on%20dismissing%20hindu%20officials&f\nfalse A Comprehensive History of Medieval India: Twelfth to the Mid-Eighteenth Century By Farooqui Salma Ahmed][https://books.google.co.in/books?id8wC52sA8CtwC&pg\nPA225&lpgPA225&dq\naurangzeb+on+dismissing+hindu+officials&sourcebl&ots\nGO1zXnDCuB&sigNJiu3GqiNiUxSDoON8LR43UQLow&hl\nen&saX&ved\n0CEsQ6AEwCTgKahUKEwjHhcyT6cvIAhWKGY4KHWOjAss#vonepage&q\naurangzeb%20on%20dismissing%20hindu%20officials&ffalse The Human Journey: A Concise Introduction to World History By Kevin Reilly] However, he also employed many Hindus as Jizya tax collectors.\n\nThe introduction of Jizya in 1679 was a response to several events shortly before its introduction: the great Rajput rebellion of 1678, the Maratha alliance with the Shia Golconda, and the Mughal expansion into the Deccan. However, the contemporary historian Khafi Khan (died 1733), whose family had served Aurangzeb, noted that Jizya could not be levied and remained largely a tax on paper only.\n\nPolicy on temples and mosques\n\nDuring his reign, Aurangzeb ordered the destruction of many temples and some mosques. For example, he ordered the destruction of Vishvanath Temple at Varanasi for being a centre of conspiracy against the state, and he ordered the destruction of the Jama Masjid at Golkunda after finding out that its ruler had built the mosque in order to hide revenues from the state. Aurangzeb also ordered a rescue raid on a temple, in order to rescue a Rajasthan minister's female family members who went there on a pilgrimage.\n\nAurangzeb displayed a particular animus towards Hindus and their temples. In his the first volume of his Pulitzer Prize winning book series, historian Will Durant  Durant, Will 1935, p.475.  stated the following:\n\nAurangzeb thought of changing the name of Hindu's one of the holiest city Benaras to Muhammadabad. Among the Hindu temples he demolished were three of the most sacred, the Kashi Vishwanath temple, Kesava Deo temple, and Somnath temple, and built large mosques in their place. In 1679, he ordered destruction of several prominent temples that had become associated with his enemies: these included the temples of Khandela, Udaipur, Chittor and Jodhpur. The historian Richard Eaton argues that the overall understanding of temples to be flawed. As early as the sixth century, temples became vital political landmarks as well as religious ones. He writes that, not only was temple desecration widely practised and accepted, it was a necessary part of political struggle.\n\nOther scholars point out that Aurangzeb also built many temples, Ian Copland says that he built more temples than he destroyed. However, scholars like Ram Puniyani states that Aurangzeb was not always fanatically anti-Hindu, and kept changing his policies depending on the needs of the situation. He banned the construction of new temples, but permitted the repair and maintenance of existing temples. He also made generous donations of jagirs to several temples to win the sympathies of his Hindu subjects. There are several firmans (orders) in his name, supporting temples and gurudwaras, including Mahakaleshwar temple of Ujjain, Balaji temple of Chitrakoot, Umananda Temple of Guwahati and the Shatrunjaya Jain temples.\n\nExecution of opponents\n\nThe first prominent execution during the long reign of Aurangzeb started with that of his brother Prince Dara Shikoh, who was accused of being influenced by Hinduism although some sources argue it was done for political reasons.Gerald James Larson, India's Agony Over Religion, (State University of New York Press, 1995), 111. Aurangzeb had his allied brother Prince Murad Baksh held for murder, judged and then executed.The Cambridge Shorter History of India, Vol. II, ed. H.H. Dodwell, (Cambridge University Press, 1934), 416. Aurangzeb is accused of poisoning his imprisoned nephew Sulaiman Shikoh.Vincent Arthur Smith, The Oxford History of India: From the Earliest Times to the End of 1911, (Clarendon Press, 1920), 412.\n\nIn 1689, the second Maratha Chhatrapati (King) Sambhaji was brutally executed by Aurangzeb. In a sham trial, he was found guilty of murder and violence, atrocitiesBurton Stein, A History of India, ed. David Arnold, (Blackwell Publishers, 1998), 179.[https://books.google.com/books?idQY4zdTDwMAQC&pg\nPA179&lpgPA179&dq\nmaratha+plunder+and+rape&sourcebl&ots\nWij6vczClO&siglHeJImObqEnvWZ5RanmKfwrhcDE&hl\nen&saX&ei\n6R1JU_GVJpOj8AXUjYCgBg&ved0CEMQ6AEwBQ#v\nonepage&qmaratha%20plunder%20and%20rape&f\nfalse] against the Muslims of Burhanpur and Bahadurpur in Berar by Marathas under his command.John F. Richards, The Mughal Empire, (Cambridge University Press, 1995), 223. \n\nIn 1675 the Sikh leader Guru Tegh Bahadur was arrested on orders by Aurangzeb, found guilty of blasphemy by a Qadi's court and executed.Hardip Singh Syan, Sikh Militancy in the Seventeenth Century: Religious Violence in Mughal and Early Modern India, (I.B. Tauris, 2012), 130–131.\n\nThe 32nd Da'i al-Mutlaq (Absolute Missionary) of the Dawoodi Bohra sect of Musta'lī Islam Syedna Qutubkhan Qutubuddin was executed by Aurangzeb, then governor of Gujarat, for heresy; on 27 Jumadil Akhir 1056 AH/ 1648 AD), Ahmedabad, India.\n\nFile:Tulapur arch.jpg|In the year 1689, according to Mughal accounts, Sambhaji was put on trial, found guilty of atrocitiesBurton Stein, A History of India, ed. David Arnold, (Blackwell Publishers, 1998), 179.[https://books.google.com/books?idQY4zdTDwMAQC&pg\nPA179&lpgPA179&dq\nmaratha+plunder+and+rape&sourcebl&ots\nWij6vczClO&siglHeJImObqEnvWZ5RanmKfwrhcDE&hl\nen&saX&ei\n6R1JU_GVJpOj8AXUjYCgBg&ved0CEMQ6AEwBQ#v\nonepage&qmaratha%20plunder%20and%20rape&f\nfalse] and executed.\nFile:Gurdwara Rakabganj Sahib, Delhi.jpg|Guru Tegh Bahadur was publicly executed in 1675 on the orders of Aurangzeb in Delhi[http://www.allaboutSikhs.com/Sikh-Guru-Ji'/Sri-Guru-Tegh-Bhadur-Sahib-Ji.html#12 A Gateway to Sikhism | Sri Guru Tegh Bhadur Sahib - A Gateway to Sikhism]\nFile:Indian - Single Leaf of Shah Sarmad and Prince Dara Shikoh - Walters W912.jpg|Sarmad Kashani, a Jewish convert to Islam and Sufi mystic was accused of heresy and executed.David Cook, Martyrdom in Islam, (Cambridge University Press, 2007), 80.\n\nExpansion of the Mughal Empire\n\nSoon after seizing the throne, Aurangzeb began advancements against the unruly Sultan of Bijapur and during 1657, the Mughals are known to have used rockets during the Siege of Bidar, against Sidi Marjan. Aurangzeb's forces discharged rockets and grenades while scaling the walls, and Sidi Marjan himself was mortally wounded after a rocket struck his large gunpowder depot. After twenty-seven days of hard fighting, Bidar was captured by the Mughals.\n\nIn 1663, during his visit to Ladakh, Aurangzeb established direct control over that part of the empire and loyal subjects such as Deldan Namgyal agreed to pledge tribute and loyalty. Deldan Namgyal is also known to have constructed a Grand Mosque in Leh, which he dedicated to Mughal rule.\n\nIn 1664, Aurangzeb appointed Shaista Khan subedar (governor) of Bengal. Shaista Khan eliminated Portuguese and Arakanese pirates from the region, and in 1666 recaptured the port of Chittagong from the Arakanese king, Sanda Thudhamma. Chittagong remained a key port throughout Mughal rule.\n\nIn 1685, Aurangzeb dispatched his son, Muhammad Azam Shah, with a force of nearly 50,000 men to capture Bijapur Fort and defeat Sikandar Adil Shah (the ruler of Bijapur) who refused to be a vassal. The Mughals could not make any advancements upon Bijapur Fort mainly because of the superior usage of cannon batteries on both sides. Outraged by the stalemate Aurangzeb himself arrived on 4 September 1686 and commanded the Siege of Bijapur; after eight days of fighting, the Mughals were victorious.\n\nOnly one remaining ruler, Abul Hasan Qutb Shah (the Qutbshahi ruler of Golconda), refused to surrender. He and his servicemen fortified themselves at Golconda and fiercely protected the Kollur Mine, which was then probably the world's most productive diamond mine, and an important economic asset. In 1687, Aurangzeb led his grand Mughal army against the Deccan Qutbshahi fortress during the Siege of Golconda. The Qutbshahis had constructed massive fortifications throughout successive generations on a granite hill over 400 ft high with an enormous eight-mile long wall enclosing the city. The main gates of Golconda had the ability to repulse any war elephant attack. Although the Qutbshahis maintained the impregnability of their walls, at night Aurangzeb and his infantry erected complex scaffolding that allowed them to scale the high walls. During the eight-month siege the Mughals faced many hardships including the death of their experienced commander Kilich Khan Bahadur. Eventually, Aurangzeb and his forces managed to penetrate the walls by capturing a gate, and their entry into the fort led Abul Hasan Qutb Shah to surrender peacefully.\n\nMilitary equipment\n\nMughal cannon making skills advanced during the 17th century. One of the most impressive Mughal cannons is known as the Zafarbaksh, which is a very rare composite cannon, that required skills in both wrought-iron forge welding and bronze-casting technologies and the in-depth knowledge of the qualities of both metals.\n\nAurangzeb military entourage consisted of 16 cannons including the Azdaha Paikar (which, was capable of firing a 33.5 kg ordnance) and Fateh Rahber (20 feet long with Persian and Arabic inscriptions).\n\nThe Ibrahim Rauza was also a famed cannon, which was well known for its multi-barrels. François Bernier, the personal physician to Aurangzeb, observed versatile Mughal gun-carriages each drawn by two horses.\n\nDespite these innovations, most soldiers used bows and arrows, the quality of sword manufacture was so poor that they preferred to use ones imported from England, and the operation of the cannons was entrusted not to Mughals but to European gunners. Other weapons used during the period included rockets, cauldrons of boiling oil, muskets and manjaniqs (stone-throwing catapults).\n\nInfantry who were later called Sepoy and who specialised in siege and artillery emerged during the reign of Aurangzeb[https://books.google.co.id/books?idSrdiVPsFRYIC&pg\nPA174&dqsepoy+aurangzeb&hl\nen&saX&ei\nmJLOVMz5Lc7c8AWXsYCACg&redir_escy#v\nonepage&qsepoy%20aurangzeb&f\nfalse Naukar, Rajput, and Sepoy: The Ethnohistory of the Military Labour Market of Hindustan; Dirk H. A. Kolff; Cambridge University Press, 2002] \n\nFile:Daulatabad fort N-MH-A50-3.JPG|Daulatabad cannon\nFile:Kalak Bangadi,Janjira Fort.jpg|Kalak Bangadi cannon.\nFile:Daulatabad cannon1.jpg|one of the Daulatabad cannons\nFile:Kilkila cannon.jpg|Kilkila cannon\nFile:Aurangabad - Daulatabad Fort (69).JPG|Aurangabad cannon\n\nWar elephants\n\nIn 1703, the Mughal commander at Coromandel, Daud Khan Panni spent 10,500 coins to purchase 30 to 50 war elephants from Ceylon.\n\nArt and Culture\n\nAurangzeb was known to be of a more austere nature than his predecessors. Being religious he encouraged Islamic calligraphy. His reign also saw the building of the Lahore  badshahi Mosque, and Bibi ka Maqbara  in Aurangabad for his wife Rabia-ud-Daurani.\n\nCalligraphy\n\nThe Mughal Emperor Aurangzeb is known to have patronised works of Islamic Calligraphy during his reign particularly Syed Ali Tabrizi.\n\nFile:Quatrain on the Virtue of Patience WDL6844.png|Quatrain on the Virtue of Patience by Muhammad Muhsin Lahuri.\nFile:Spousal Advice WDL6832.png|Spousal Advice, by Abdallah Lahuri.\nFile:Ruba'i of Ḥāfiẓ WDL6860.png|Works of Hafez, by Abdallah Lahuri.\nFile:Ruba'i of Ḥāfiẓ WDL6857.png|Works of Hafez, by Muhammad Tahir Lahuri.\n\nArchitecture\n\nUnlike his father, Aurangzeb was not much interested in architecture. Aurangzeb constructed a small marble mosque known as the Moti Masjid (Pearl Mosque) in the Red Fort complex in Delhi. He ordered the construction of the Badshahi Mosque in Lahore. He also constructed a mosque on Benares. The mosque he constructed in Srinagar is still the largest in Kashmir. The structure of Bibi Ka Maqbara in Aurangabad, which now is a historical monument was constructed by the sons of Aurangzeb in remembrance of their mother. The inspiration came from Taj mahal as is quite visible from its architecture.\n\nFile:Badshahi Mosque July 1 2005 pic32 by Ali Imran (1).jpg|17th century Badshahi Masjid built by Aurangzeb in Lahore.\nFile:Great Mosque of Aurungzebe and Adjoining Ghats.jpg|Great Mosque of Aurungzeb and the adjoining Ghats.\nFile:Syed Abdul Rahim Shah Bukhari.jpg|Tomb of Sufi saint, Syed Abdul Rahim Shah Bukhari constructed by Aurangzeb.\n\nTextiles\n\nThe textile industry in the Mughal Empire emerged very firmly during the reign of the Mughal Emperor Aurangzeb and was particularly well noted by Francois Bernier, a French physician of the Mughal Emperor. Francois Bernier writes how Karkanahs, or workshops for the artisans, particularly in textiles flourished by \"employing hundreds of embroiderers, who were superintended by a master\". He further writes how \"Artisans manufacture of silk, fine brocade, and other fine muslins, of which are made turbans, robes of gold flowers, and tunics worn by females, so delicately fine as to wear out in one night, and cost even more if they were well embroidered with fine needlework\".\n\nHe also explains the different techniques employed to produce such complicated textiles such as Himru (whose name is Persian for \"brocade\"), Paithani (whose pattern is identical on both sides), Mushru (satin weave) and how Kalamkari, in which fabrics are painted or block-printed, was a technique that originally came from Persia. Francois Bernier provided some of the first, impressive descriptions of the designs and the soft, delicate texture of Pashmina Shawls also known as Kani, which were very valued for their warmth and comfort among the Mughals, and how these textiles and shawls eventually began to find their way to France and England.\n\nFile:Caspar David Friedrich - Frau mit Umschlagtuch (1804).jpg|Shawls manufactured in the Mughal Empire had highly influenced other cultures around the world.\nFile:Muslim-shawl-makers-kashmir1867.jpg|Shawl makers in the Mughal Empire.\nFile:Floorspread LACMA M.79.9.6 (1 of 3).jpg|Mughal imperial carpet\n\nForeign relations\n\nAs soon as he became emperor, Aurangzeb sent some of the finest ornate gifts such as carpets, lamps, tiles and others to the Islamic shrines at Mecca and Medina. He also ordered the construction of very large ships in Surat that would transport these gifts and even pilgrims to the Hijaz. These annual expeditions organised by Aurangzeb were led by Mir Aziz Badakhshi who died in Mecca of natural causes but managed to deliver more than 45,000 silver coins and several thousand Kaftans of honour.\n\nRelations with the Uzbek\n\nSubhan Quli, Balkh's Uzbek ruler was the first to recognise him in 1658 and requested for a general alliance, he worked alongside the new Mughal Emperor since 1647, when Aurangzeb was the Subedar of Balkh.\n\nRelations with the Safavid dynasty\n\nAurangzeb received the embassy of Abbas II of Persia in 1660 and returned them with gifts. However relations between the Mughal Empire and the Safavid dynasty were tense because the Persians attacked the Mughal army positioned near Kandahar. Aurangzeb prepared his armies in the Indus River Basin for a counteroffensive, but Abbas II's death in 1666 caused Aurangzeb to end all hostilities. Aurangzeb's rebellious son, Sultan Muhammad Akbar, sought refuge with Suleiman I of Persia, who had rescued him from the Imam of Musqat and later refused to assist him in any military adventures against Aurangzeb.\n\nRelations with the French\n\nIn 1667, the French East India Company ambassadors Le Gouz and Bebert presented Louis XIV of France's letter which urged the protection of French merchants from various rebels in the Deccan. In response to the letter Aurangzeb issued a Firman allowing the French to open a factory in Surat.\n\nFile:Pomp and Ceremony of the March of the Great Mogol.jpg|March of the Great Mughal (Aurangzeb)\nFile:Voyage de Francois Bernier by Paul Maret 1710.jpg|François Bernier, was a French physician and traveller, who for 12 years was the personal physician of Aurangzeb. He described his experiences in Travels in the Mughal Empire.\nFile:Indostan - a Map of India by Vincenzo Coronelli, Venice 1692.jpg|Map of the Mughal Empire by Vincenzo Coronelli (1650–1718) of Venice, who served as Royal Geographer to Louis XIV of France.\nFile:1652 Sanson Map of India - Geographicus - India-sanson-1652.jpg|French map of the Deccan.\n\nRelations with the Sultanate of Maldives\n\nIn the 1660s, the Sultan of the Maldives, Ibrahim Iskandar I, requested help from Aurangzeb's representative, the Faujdar of Balasore. The sultan was concerned about the impact of Dutch and English trading ships but the powers of Aurangzeb did not extend to the seas, the Maldives were not under his governance and nothing came of the request.\n\nRelations with the Ottoman Empire\n\nIn 1688, the desperate Ottoman Sultan Suleiman II urgently requested for assistance against the rapidly advancing Austrians, during the Ottoman–Habsburg War. However, Aurangzeb and his forces were heavily engaged in the Deccan Wars against the Marathas to commit any formal assistance to their Ottoman allies.\n\nRelations with the English\n\nIn 1686, the English East India Company, which had unsuccessfully tried to obtain a firman, an imperial directive that would grant England regular trading privileges throughout the Mughal empire, initiated the so-called Child's War. This hostility against the empire ended in disaster for the English, particularly when Aurangzeb dispatched a strong fleet from Janjira commanded by the Sidi Yaqub and manned by Mappila loyal to Ali Raja Ali II and Abyssinian sailors firmly blockaded Bombay in 1689. In 1690, the company sent envoys to Aurangzeb's camp to plead for a pardon. The company's envoys had to prostrate themselves before the emperor, pay a large indemnity, and promise better behaviour in the future.\n\nIn September 1695, English pirate Henry Every perpetrated one of the most profitable pirate raids in history with his capture of a Grand Mughal convoy near Surat. The Indian ships had been returning home from their annual pilgrimage to Mecca when the pirates struck, capturing the Ganj-i-Sawai, reportedly the greatest ship in the Muslim fleet, and its escorts in the process. When news of the piracy reached the mainland, a livid Aurangzeb nearly ordered an armed attack against the English-governed city of Bombay, though he finally agreed to compromise after the East India Company promised to pay financial reparations, estimated at £600,000 by the Mughal authorities. Meanwhile, Aurangzeb shut down four of the East India Company's factories, imprisoned the workers and captains (who were nearly lynched by a rioting mob), and threatened to put an end to all English trading in India until Every was captured. The Privy Council and East India Company offered a massive bounty for Every's apprehension, leading to the first worldwide manhunt in recorded history. However, Every successfully eluded capture.\n\nIn 1702, Aurangzeb sent Daud Khan Panni, the Mughal Empire's Subhedar of the Carnatic region, to besiege and blockade Fort St. George for more than three months. The governor of the fort Thomas Pitt was instructed by the English East India Company to sue for peace.\n\nAdministrative reforms\n\nRevenue\n\nAurangzeb's exchequer raised a record £100 million in annual revenue through various sources like taxes, customs and land revenue, et al. from 24 provinces. He had an annual yearly revenue of $450 million, more than ten times that of his contemporary Louis XIV of France.\n\nCoins\n\nFile:035Aur1.jpg|Half rupee\nFile:Silver Rupee of Aurangazeb AH1096.jpg|Rupee coin showing full name\nFile:047aur13.jpg|Rupee with square area\nFile:074aur-12.JPG|A copper dam of Aurangzeb\n\nAurangzeb felt that verses from the Quran should not be stamped on coins, as done in former times, because they were constantly touched by the hands and feet of people. His coins had the name of the mint city and the year of issue on one face, and, the following couplet on other:\n\nRebellions\n\nBy 1700, the Marathas attacked the Mughal provinces from the Deccan and secessionist agendas from the Rajputs, Hindu Jats, Pashtuns and Sikhs  rebelled against  the Mughal Empire's administrative and economic systems.\n* In 1669, the Hindu Jat peasants of Bharatpur around Mathura rebelled and created Bharatpur state but were defeated.\n* In 1659, Shivaji, launched a surprise attack on the Mughal Viceroy Shaista Khan and, while waging war against Aurangzeb. Shivaji and his forces attacked the Deccan, Janjira and Surat and tried to gain control of vast territories. In 1689 Aurangzeb's armies captured Shivaji's son  Sambhaji  and executed him after he had sacked Burhanpur. But, the Marathas continued the fight and it actually started the terminal decline of his empire.\n* In 1679, the Rathore clan under the command of Durgadas Rathore rebelled when Aurangzeb didn't give permission to make the young Rathore prince the king and took direct command of Jodhpur. This incident caused great unrest among the Hindu Rajput rulers under Aurangzeb and led to many rebellions in Rajputana.\n* In 1672, the Satnami, a sect concentrated in an area near Delhi, under the leadership of Bhirbhan, took over the administration of Narnaul, but they were eventually crushed upon Aurangzeb's personal intervention with very few escaping alive.\n* In 1671, the Battle of Saraighat was fought in the easternmost regions of the Mughal Empire against the Ahom Kingdom. The Mughals led by Mir Jumla II and Shaista Khan attacked and were defeated by the Ahoms.\n* Maharaja Chhatrasal was a medieval Indian warrior from Bundela Rajput clan, who fought against the Mughal Emperor Aurangzeb, and established his own kingdom in Bundelkhand, becoming a Maharaja of Panna.Bhagavānadāsa Gupta, Contemporary Sources of the Mediaeval and Modern History of Bundelkhand (1531–1857), vol. 1 (1999). .\n\nJat rebellion\n\nIn 1669,  Hindu Jats began to organise a rebellion that is believed to have been caused by Aurangzeb's imposition of Jizya (a form of organised religious taxation). The Jats were led by Gokula, a rebel landholder from Tilpat. By the year 1670 20,000 Jat rebels were quelled and the Mughal Army took control of Tilpat, Gokula's personal fortune amounted to 93,000 gold coins and hundreds of thousands of silver coins.\n\nGokula was caught and executed. But the Jats continued to terrorise the Mughals. Raja Ram Jat, in order to avenge his father Gokula's death, plundered Akbar's tomb of its gold, silver and fine carpets, opened Akbar's grave and dragged Akbar's bones and burned them in retaliation.Vīrasiṃha, 2006, [https://books.google.com.sg/books?isbn\n8188629529 \"The Jats: Their Role & Contribution to the Socio-economic Life and Polity of North & North-west India, Volume 2\"], University of Michigan, Page 100-102.Edward James Rap;son, Sir Wolseley Haig and Sir Richard, 1937, [https://books.google.com.sg/books?id\nyoI8AAAAIAAJ \"The Cambridge History of India\"], Cambridge University Press, Volume 4, pp.305.Waldemar Hansen, 1986, [https://books.google.com.sg/books?isbn\n812080225X \"The Peacock Throne: The Drama of Mogul India\"], Page 454.Reddy, 2005, [https://books.google.com.sg/books?isbn\n0070604479 \"General Studies History for UPSC\"], Tata McGraw-Hill, Page B-46.Catherine Blanshard Asher, Catherine Ella Blanshard Asher, 1992, [https://books.google.com.sg/books?isbn\n0521267285 \"Architecture of Mughal India – Part 1\"], Cambridge university Press, Volume 4, Page 108. Jats also shot off the tops of the minarets on the gateway to Akbar's Tomb and melted down two silver doors from the Taj Mahal.Lucy Peck,  2011, [https://books.google.com.sg/books?id\nZtFbBAAAQBAJ&pgPT44&dq\njats+melted+down+two+silver+doors&hlen&sa\nX&ved0ahUKEwiO-fHvk9DXAhXIwI8KHVWMAogQ6AEIJTAA#v\nonepage&qjats%20melted%20down%20two%20silver%20doors&f\nfalse The Architectural Heritage], INTACH.Sir Harry Hamilton Johnston, Leslie Haden Guest, 1937, [https://books.google.com.sg/books?id\nSvkqAAAAIAAJ The World of To-day: The Marvels of Nature and the Creations of Man], Volume 2, p. 510Ernest Binfield Havell, 1904, [https://books.google.com.sg/books?id\nAmgLAAAAIAAJ&qjats+melted+down+two+silver+doors&dq\njats+melted+down+two+silver+doors&hlen&sa\nX&ved0ahUKEwiO-fHvk9DXAhXIwI8KHVWMAogQ6AEIMDAC A Handbook to Agra and the Taj: Sikandra, Fatehpur-Sikri and the Neighbourhood], p. ci.Frederic Courtland Penfield, 1907, [https://books.google.com.sg/books?id7X9Q_rOFzZIC&q\njats+melted+down+two+silver+doors&dqjats+melted+down+two+silver+doors&hl\nen&saX&ved\n0ahUKEwiO-fHvk9DXAhXIwI8KHVWMAogQ6AEIPTAF East of Suez Ceylon, India, China, and Japan], p. 179. However, Jats later established their independent state of Bharatpur.\n\nMughal–Maratha Wars\n\nIn 1657, while Aurangzeb attacked Golconda and Bijapur in the Deccan, the Hindu Maratha warrior aristocrat, Shivaji, used guerrilla tactics to take control of three Adil Shahi forts formerly under his father's command. With these victories, Shivaji assumed de facto leadership of many independent Maratha clans. The Marathas harried the flanks of the warring Adil Shahis and Mughals, gaining weapons, forts, and territory. Shivaji's small and ill-equipped army survived an all out Adil Shahi attack, and Shivaji personally killed the Adil Shahi general, Afzal Khan. With this event, the Marathas transformed into a powerful military force, capturing more and more Adil Shahi and Mughal territories. Shivaji went on to neutralise Mughal power in the region.\n\nIn 1659, Aurangzeb sent his trusted general and maternal uncle Shaista Khan, the Wali in Golconda to recover forts lost to the Maratha rebels. Shaista Khan drove into Maratha territory and took up residence in Pune. But in a daring raid on the governor's palace in Pune during a midnight wedding celebration, led by Shivaji himself, the Marathas killed Shaista Khan's son and Shivaji maimed Shaista Khan by cutting off three fingers of his hand. Shaista Khan, however, survived and was re-appointed the administrator of Bengal going on to become a key commander in the war against the Ahoms.\n\nShivaji captured forts belonging to both Mughals and Bijapur. At last Aurangzeb ordered the armament of the Daulatabad Fort with two bombards (the Daulatabad Fort was later used as a Mughal bastion during the Deccan Wars). Aurangzeb also sent his general Raja Jai Singh of Amber, a Hindu Rajput, to attack the Marathas. Jai Singh won the fort of Purandar after fierce battle in which the Maratha commander Murarbaji fell. Foreseeing defeat, Shivaji agreed for a truce and a meeting with Aurangzeb at Delhi. Jai Singh also promised Shivaji his safety, placing him under the care of his own son, the future Raja Ram Singh I. However, circumstances at the Mughal court were beyond the control of the Raja, and when Shivaji and his son Sambhaji went to Agra to meet Aurangzeb, they were placed under house arrest, from which they managed to effect a daring escape.\n\nShivaji returned to the Deccan, and crowned himself Chhatrapati or the ruler of the Maratha Kingdom in 1674. While Aurangzeb continued to send troops against him, Shivaji expanded Maratha control throughout the Deccan until his death in 1680. Shivaji was succeeded by his son, Sambhaji. Militarily and politically, Mughal efforts to control the Deccan continued to fail.\n\nOn the other hand, Aurangzeb's third son Akbar left the Mughal court along with a few Muslim Mansabdar supporters and joined Muslim rebels in the Deccan. Aurangzeb in response moved his court to Aurangabad and took over command of the Deccan campaign. The rebels were defeated and Akbar fled south to seek  refuge with Sambhaji, Shivaji's successor. More battles ensued, and Akbar fled to Persia and never returned.\n\nIn 1689, Aurangzeb's forces captured  and executed Sambhaji. His successor Rajaram, later Rajaram's widow Tarabai and their Maratha forces fought individual battles against the forces of the Mughal Empire. Territory changed hands repeatedly during the years (1689–1707)  of interminable warfare . As there was no central authority among the Marathas, Aurangzeb was forced to contest every inch of territory, at great cost in lives and money. Even as Aurangzeb drove west, deep into Maratha territory – notably conquering Satara — the Marathas expanded their attacks further into Mughal lands – Malwa, Hyderabad and Jinji in Tamil Nadu. Aurangzeb waged continuous war in the Deccan for more than two decades with no resolution. He thus lost about a fifth of his army fighting rebellions led by the Marathas in Deccan India. He travelled a long distance to the Deccan to conquer the Marathas and eventually died at the age of 90, still fighting the Marathas.\n\nAurangzeb's shift from conventional warfare to anti-insurgency in the Deccan region shifted the paradigm of Mughal military thought. There were conflicts between Marathas and Mughals in Pune, Jinji, Malwa and Vadodara. The Mughal Empire's port city of Surat was sacked twice by the Marathas during the reign of Aurangzeb and the valuable port was in ruins. \nMatthew White estimates that about 2.5 million of Aurangzeb's army were killed during the Mughal–Maratha Wars (100,000 annually during a quarter-century), while 2 million civilians in war-torn lands died due to drought, plague and famine. \n\nFile:A portrait probably made by a Mughal artist, in the Deccan, during Aurangzeb's military campaigns there.jpg|A Mughal trooper in the Deccan.\nFile:Bhavanidas. The Emperor Aurangzeb Carried on a Palanquin ca. 1705–20 Metripolitan Museum of Art..jpg|Aurangzeb leads his final expedition (1705), leading an army of 500,000 troops.\nFile:Prince with rifle.jpg|Mughal-era aristocrat armed with a matchlock musket.\n\nAhom campaign\n\nWhile Aurangzeb and his brother Shah Shuja had been fighting against each other, the Hindu rulers of Kuch Behar and Assam took advantage of the disturbed conditions in the Mughal Empire, had invaded imperial dominions. For three years they were not attacked, but in 1660 Mir Jumla II, the viceroy of Bengal, was ordered to recover the lost territories.\n\nThe Mughals set out in November 1661, and within weeks occupied the capital of Kuch Behar after a few fierce skirmishes. The Kuch Behar was annexed, and the Mughal Army reorganised and began to retake their territories in Assam. Mir Jumla II's forces captured Pandu, Guwahati, and Kajali practically unopposed. In February 1662, Mir Jumla II initiated the Siege of Simalugarh and after the Mughal cannon breached the fortifications, the Ahoms abandoned the fort and escaped. Mir Jumla II then proceeded towards Garhgaon the capital of the Ahom kingdom, which was reached on 17 March 1662, although the ruler Raja Sutamla fled and the victorious Mughals captured 100 elephants, about 300,000 coins of silver, 8000 shields, 1000 ships, and 173 massive stores of rice.\n\nLater that year in December 1663, the aged Mir Jumla II died on his way back to Dacca of natural causes, but skirmishes continued between the Mughals and Ahoms after the rise of Chakradhwaj Singha, who refused to pay further indemnity to the Mughals and during the wars that continued the Mughals suffered great hardships. Munnawar Khan emerged as a leading figure and is known to have supplied food to vulnerable Mughal forces in the region near Mathurapur. Although the Mughals under the command of Syed Firoz Khan the Faujdar at Guwahati were overrun by two Ahom armies in the year 1667, but they continued to hold and maintain presence along their the eastern territories even after the Battle of Saraighat in the year 1671.\n\nThe Battle of Saraighat was fought in 1671 between the Mughal empire (led by the Kachwaha king, Raja Ramsingh I), and the Ahom Kingdom (led by Lachit Borphukan) on the Brahmaputra river at Saraighat, now in Guwahati. Although much weaker, the Ahom Army defeated the Mughal Army by brilliant uses of the terrain, clever diplomatic negotiations to buy time, guerrilla tactics, psychological warfare, military intelligence and by exploiting the sole weakness of the Mughal forces—its navy.\n\nThe Battle of Saraighat was the last battle in the last major attempt by the Mughals to extend their empire into Assam. Though the Mughals managed to regain Guwahati briefly after a later Borphukan deserted it, the Ahoms wrested control in the Battle of Itakhuli in 1682 and maintained it till the end of their rule.Sarkar, J. N. (1992), \"Chapter VIII Assam-Mughal Relations\", in Barpujari, H. K., The Comprehensive History of Assam 2, Guwahati: Assam Publication Board, pp. 148–256\n\nSatnami opposition\n\nIn May 1672, the Satnami sect obeying the commandments of an \"old toothless woman\" (according to Mughal accounts) organised a massive revolt in the agricultural heartlands of the Mughal Empire. The Satnamis were known to have shaved off their heads and even eyebrows and had temples in many regions of Northern India. They began a large-scale rebellion 75 miles southwest of Delhi.\n\nThe Satnamis believed they were invulnerable to Mughal bullets and believed they could multiply in any region they entered. The Satnamis initiated their march upon Delhi and overran small-scale Mughal infantry units.\n\nAurangzeb responded by organising a Mughal army of 10,000 troops and artillery, and dispatched detachments of his own personal Mughal imperial guards to carry out several tasks. To boost Mughal morale, Aurangzeb wrote Islamic prayers, made amulets, and drew designs that would become emblems in the Mughal Army. This rebellion would have a serious aftermath effect on the Punjab.\n\nSikh opposition\n\nEarly in Aurangzeb's reign, various insurgent groups of Sikhs engaged Mughal troops in increasingly bloody battles. The ninth Sikh Guru, Guru Tegh Bahadur, like his predecessors was opposed to conversion of the local population as he considered it wrong. According to Sikh sources, approached by Kashmiri Pandits to help them retain their faith and avoid forced religious conversions, Guru Tegh Bahadur took on Aurangzeb. The emperor perceived the rising popularity of the Guru as a threat to his sovereignty and in 1670 had him executed, which infuriated the Sikhs. In response, Guru Tegh Bahadur's son and successor, Guru Gobind Singh, further militarised his followers, starting with the establishment of Khalsa in 1699, eight years before Aurangzeb's death.  In 1705, Guru Gobind Singh sent a letter entitled Zafarnamah to Aurangzeb. This drew attention to Aurangzeb's cruelty and how he had betrayed Islam. The letter caused him much distress and remorse. Guru Gobind Singh's formation of Khalsa in 1699 led to the establishment of the Sikh Confederacy and later Sikh Empire.\n\nPashtun opposition\n\nThe Pashtun revolt in 1672 under the leadership of the warrior poet Khushal Khan Khattak of Kabul, was triggered when soldiers under the orders of the Mughal Governor Amir Khan allegedly molested women of the Pashtun tribes in modern-day Kunar Province of Afghanistan. The Safi tribes retaliated against the soldiers. This attack provoked a reprisal, which triggered a general revolt of most of tribes. Attempting to reassert his authority, Amir Khan led a large Mughal Army to the Khyber Pass, where the army was surrounded by tribesmen and routed, with only four men, including the Governor, managing to escape.\n\nAfter that the revolt spread, with the Mughals suffering a near total collapse of their authority in the  Pashtun belt. The closure of the important Attock-Kabul trade route along the Grand Trunk road was particularly disastrous. By 1674, the situation had deteriorated to a point where Aurangzeb camped at Attock to personally take charge. Switching to diplomacy and bribery along with force of arms, the Mughals eventually split the rebels and partially suppressed the revolt, although they never managed to wield effective authority outside the main trade route.\n\nDeath and legacy\n\nBy 1689, almost all of Southern India was a part of the Mughal Empire and after the conquest of Golconda, Mughal victories in the south expanded the Mughal Empire to 4 million square kilometres, with a population estimated to be over 158 million. But this supremacy was short-lived. Jos Gommans, Professor of Colonial and Global History at the University of Leiden, says that \"... the highpoint of imperial centralisation under emperor Aurangzeb coincided with the start of the imperial downfall.\"\n\nUnlike his predecessors, Aurangzeb considered the royal treasury to be held in trust for the citizens of his empire. He made caps and copied the Quran to earn money for his use,.Dasgupta, K., 1975. How Learned Were the Mughals: Reflections on Muslim Libraries in India. The Journal of Library History (1974–1987), 10(3), pp.241–254.Qadir, K.B.S.S.A., 1936. The Cultural Influences of Islam in India. Journal of the Royal Society of Arts, pp.228–241. Aurangzeb constructed a small marble mosque known as the Moti Masjid (Pearl Mosque) in the Red Fort complex in Delhi. However, his constant warfare, especially with the Marathas, drove his empire to the brink of bankruptcy just as much as the wasteful personal spending and opulence of his predecessors.\n\nThe Indologist Stanley Wolpert, emeritus professor at UCLA, says that:\n\nEven when ill and dying, Aurangzeb made sure that the populace knew he was still alive, for if they had thought otherwise then the turmoil of another war of succession was likely. He died in Ahmednagar on 20 February 1707 at the age of 88, having outlived many of his children. His modest open-air grave in Khuldabad expresses his deep devotion to his Islamic beliefs. It is sited in the courtyard of the shrine of the Sufi saint Shaikh Burhan-u'd-din Gharib, who was a disciple of Nizamuddin Auliya of Delhi.\n\nBrown writes that after his death, \"a string of weak emperors, wars of succession, and coups by noblemen heralded the irrevocable weakening of Mughal power\". She notes that the populist but \"fairly old-fashioned\" explanation for the decline is that there was a reaction to Aurangzeb's oppression. Aurangzeb's son, Bahadur Shah I, succeeded him and the empire, both because of Aurangzeb's over-extension and because of Bahadur Shah's weak military and leadership qualities, entered a period of terminal decline. Immediately after Bahadur Shah occupied the throne, the Maratha Empire – which Aurangzeb had held at bay, inflicting high human and monetary costs even on his own empire – consolidated and launched effective invasions of Mughal territory, seizing power from the weak emperor. Within decades of Aurangzeb's death, the Mughal Emperor had little power beyond the walls of Delhi.\n\nAurangweb's religious zeal exacted a heavy price both to himself and his nation. Will Durant states:Will Durant, p.475\n\nDuring British rule of India, a road in Delhi was named Aurangzeb road. In November 2014, it was renamed to Dr APJ Abdul Kalam Road. \n\nCriticism\n\nHis critics argue that his ruthless and vindictive religious bigotry made him unsuitable to rule the mixed population of his empire and policies of persecution of Shias, Sufis and non-Muslims to impose practices of orthodox Islamic state, such as imposition of sharia and jizya religious tax on non-Muslims, doubling of custom duties on Hindus while abolishing it for Muslims, executions of Muslims and non-Muslims, destruction of temples, forbidding construction and repairs of some temples, which they argue led to numerous rebellions.Kenneth Pletcher, 2010, [https://books.google.com.sg/books?id\nhdmcAAAAQBAJ&pgPA183&dq\naurangzeb+policies+of+religious+persecution+led+to+numerous+rebellions,&hlen&sa\nX&ved0ahUKEwjSlNvy_87XAhWHYo8KHfd3B4wQ6AEISTAI#v\nonepage&qaurangzeb%20policies%20of%20religious%20persecution%20led%20to%20numerous%20rebellions%2C&f\nfalse \"The History of India.\"], Britannica Educational Publishing, p. 183]Paul Joseph, 2016, [https://books.google.com.sg/books?id\nidw0DQAAQBAJ&pgPA433&dq\naurangzeb+policies+of+religious+persecution+led+to+numerous+rebellions,&hlen&sa\nX&ved0ahUKEwjSlNvy_87XAhWHYo8KHfd3B4wQ6AEIPDAF#v\nonepage&qaurangzeb%20policies%20of%20religious%20persecution%20led%20to%20numerous%20rebellions%2C&f\nfalse \"The SAGE Encyclopedia of War: Social Science Perspectives.\"], SAGE Publications, p. 432-433.Marie Cruz Gabriel, 1996, [https://books.google.com.sg/books?idCiklIzcTIYUC&pg\nRA1-PA71&dqaurangzeb+policies+of+religious+persecution+led+to+numerous+rebellions,&hl\nen&saX&ved\n0ahUKEwjSlNvy_87XAhWHYo8KHfd3B4wQ6AEITzAJ#vonepage&q\naurangzeb%20policies%20of%20religious%20persecution%20led%20to%20numerous%20rebellions%2C&ffalse \"A Silence in the City and Other Stories.\"], Orient Longman Publishing, p. 71]Craig A. Lockard, 2014,[https://books.google.com.sg/books?id\nDLQeSBLpUwsC&pgPA77&lpg\nPA77&dqSansani+fort+jat&source\nbl&otsKJzEoLMFob&sig\nJoJXcu4DvHMswllb60TgATnF_SU&hlen&sa\nX&ved0ahUKEwjNsMjV_c7XAhUHrI8KHfAlA7cQ6AEIJTAA#v\nonepage&qSansani%20fort%20jat&f\nfalse \"Societies, Networks, and Transitions, Volume II: Since 1450: A global history.\"], Cengage, p.415]G. N. Moin Shakir and Sarma Festschrift, 1989, [https://books.google.com.sg/books?id\nx_gQAQAAIAAJ \"Religion State And Politics In India.\"], p. 47]Jiu-Hwa L. Upshur, Janice J. Terry, Jim Holoka, 2011, [https://books.google.com.sg/books?id\nmBo-2D0TKUcC&pgPA527&dq\naurangzeb+policies+of+religious+persecution+led+to+numerous+rebellions,&hlen&sa\nX&ved0ahUKEwjQ6cK9is_XAhUJMY8KHdoKCKQ4ChDoAQg3MAQ#v\nonepage&qaurangzeb%20policies%20of%20religious%20persecution%20led%20to%20numerous%20rebellions%2C&f\nfalse \"Cengage Advantage Books: World History.\"], Wadsworth Cengage,p. 527.Amy Chua, 2009, [https://books.google.com.sg/books?isbn\n0307472450 \"Day of Empire: How Hyperpowers Rise to Global Dominance—and Why They Fall.\"], Anchor Books, p. 189. G. N. Moin Shakir and Sarma Festschrift argue that he often used political opposition as pretext for religious persecution, and that, as a result, Jats, Marathas, Sikhs, Satnamis and Pashtuns all rose against him.Ashvini Agrawal, 1983, [https://books.google.com.sg/books?isbn\n8120823265 \"Studies in Mughal History.\"], p. 15], He also fought and eventually lost wars with the Ahom kingdom.\n\nFull title\n\nAurangzeb's full imperial title was:\n\nAl-Sultan al-Azam wal Khaqan al-Mukarram Hazrat Abul Muzaffar Muhy-ud-Din Muhammad Aurangzeb Bahadur Alamgir I,\nBadshah Ghazi, \nShahanshah-e-Sultanat-ul-Hindiya Wal Mughaliya.\n\nIn literature \n\nAurangzeb has prominently featured in the following books\n* 19?? – Hindi fiction novel by Acharya Chatursen Shastri\n* 1970 – Shahenshah (), the Marathi fictional biography by N S Inamdar\n* 2017 – Shahenshah – The Life of Aurangzeb, the English translation by Vikrant Pande of the 1970 Marathi fictional biography by N S Inamdar. Aurangzeb. http://en.wikipedia.org/?curid=2425."
  }
}
