{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13523",
  "eid" : "0a5c5640-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778526628,
  "textBody" : "Home Improvement is an American television sitcom starring Tim Allen  that aired on ABC from September 17, 1991, to May 25, 1999, with a total of 204 half-hour episodes spanning over eight seasons. The series was created by Matt Williams, Carmen Finestra, and David McFadzean. In the 1990s, it was one of the most watched sitcoms in the American market, winning many awards. The series launched Tim Allen's acting career and was the start of the television career of Pamela Anderson, who was part of the recurring cast for the first two seasons.\n\nShow background \n\nBased on the stand-up comedy of Tim Allen, Home Improvement made its debut on ABC on September 17, 1991, and was one of the highest-rated sitcoms for almost the entire decade. It went to No. 1 in the ratings during the 1993–1994 season; the same year Allen had the No. 1 book (Don't Stand Too Close to a Naked Man) and movie (The Santa Clause).\n\nBeginning in season 2, Home Improvement began each episode with a cold open, which features the show's logo during the teaser. From season 4 until the end of the series in 1999, an anthropomorphic version of the logo was used in different types of animation.\n\nPlot details and storylines \n\nTaylor family \n\nThe series centers on the Taylor family, which consists of Tim (Tim Allen), his wife Jill (Patricia Richardson) and their three children: the oldest child, Brad (Zachery Ty Bryan), the middle child, Randy (Jonathan Taylor Thomas) and youngest child, Mark (Taran Noah Smith). The Taylors live in suburban Detroit, and have a neighbor named Wilson (Earl Hindman) who is often the go-to guy for solving the Taylors' problems.\n\nTim is a stereotypical American male, who loves power tools, cars, and sports. In particular, he is an avid fan of local Detroit teams. In numerous instances, Tim wears Lions, Pistons, Red Wings, and Tigers clothing, and many plots revolve around the teams. He is a former salesman for the fictional Binford Tool company, and is very much a cocky, overambitious, accident-prone know-it-all. Witty but flippant, Tim jokes around a lot, even at inappropriate times, much to the dismay of his wife. However, Tim can sometimes be serious when necessary. Jill, Tim's wife, is loving and sophisticated, but not exempt from dumb moves herself. In later seasons she returns to college to study psychology. Family life is boisterous for the Taylors with the two oldest children, Brad and Randy, tormenting the much younger Mark, all while continually testing and pestering each other. Such play happened especially throughout the first three seasons, and was revisited only occasionally until Jonathan Taylor Thomas left at the beginning of the eighth season. During the show's final season, Brad and Mark became much closer due to Randy's absence.\n\nBrad, popular and athletic, was often the moving factor, who engaged before thinking, a tendency which regularly landed him in trouble. Randy, a year younger, was the comedian of the pack, known for his quick-thinking, wisecracks, and smart mouth. He had more common sense than Brad but was not immune to trouble. Mark was somewhat of a mama's boy, though later in the series (in the seventh season) he grew into a teenage outcast who dressed in black clothing.  Meanwhile, Brad became interested in cars like his father and took up soccer. Randy joined the school drama club, and later the school newspaper; in the eighth season, he left for Costa Rica.\n\nIn early seasons, Wilson was always seen standing on the other side of Tim's backyard fence as the two engaged in conversation, usually with Wilson offering sage advice as Tim grappled with his problems.  In later seasons, a running joke developed in which more and more creative means were used to prevent Wilson's face below the eyes from ever being seen by the audience.  Also in later seasons, Wilson's full name was revealed to be Wilson W. Wilson, Jr.\n\nTool Time \n\nEach episode includes Tim's own Binford-sponsored home improvement show, called Tool Time, a \"meta-program,\" or show-within-a-show. In hosting this show, Tim is joined by his friend and mild-mannered assistant Al Borland (Richard Karn), and a \"Tool Time girl\"—first Lisa (Pamela Anderson) and later Heidi (Debbe Dunning)—whose main duty is to introduce the pair at the beginning of the show with the line \"Does everybody know what time it is?\" The Tool Time girl also assists Tim and Al during the show by bringing them tools.\n\nAlthough revealed to be an excellent salesman and TV personality, Tim is spectacularly accident prone as a handyman, often causing massive disasters on and off the set, to the consternation of his co-workers and family. Many Tool Time viewers assume that the accidents on the show are done on purpose, to demonstrate the consequences of using tools improperly. Many of Tim's accidents are caused by his devices being used in an unorthodox or overpowered manner, designed to illustrate his mantra \"More power!\". This popular catchphrase would not be uttered after Home Improvements seventh season, until Tim's last line in the series finale, which are the last two words ever spoken.\n\nTool Time was conceived as a parody of the PBS home-improvement show This Old House.  Tim and Al are caricatures of the two principal cast members of This Old House, host Bob Vila and master carpenter Norm Abram. Al Borland has a beard and always wears plaid shirts when taping an episode, reflecting Norm Abram's appearance on This Old House. Bob Vila appeared as a guest star on several episodes of Home Improvement, while Tim Allen and Pamela Anderson both appeared on Bob Vila's show Home Again.\n\nThe Tool Time theme music, an early 1960s-style saxophone-dominated instrumental rock tune, was sometimes used as the closing theme music for Home Improvement, especially when behind the credits were running the blooper scenes that took place during the taping of a Tool Time segment.\n\nMichigan college and university wear \n\nThroughout the show, Tim Taylor would often be wearing sweatshirts or T-shirts from various Michigan based college and universities. These were usually sent by the schools to the show for him to wear during an episode. Because Allen considered Michigan his home state, the rule was that only Michigan schools would get the free advertising.\n\nTheme music \n\nThe theme music for Home Improvement was composed by Dan Foliart. The theme song is unique for its sampling of power tools, most notably an electric drill and jackhammer, which is heard during theme song. Tim's grunting was also sampled for the theme song. The flute and organ parts of the theme music were also used. From Season 7 until the end of the series, a remixed version of the theme song was used.\n\nAwards, nominations, and other reception \n\nHome Improvement received numerous awards and nominations in its 8-season run. Notable awards and nominations include: Golden Globe Awards, Primetime Emmy Awards, Kids' Choice Awards, Young Artist Awards, YoungStar Awards, ASCAP Award, and many others.\n\nWatchMojo.com ranked Home Improvement as the #9 TV sitcom from the 1990s. The character with most honors was Wilson, who was ranked as the #6 unseen TV character and as the #3 TV neighbor. Binford made it to the #10 fictional brand. The video game Home Improvement: Power Tool Pursuit! was ranked as the #5 worst game based on a TV series. On Metacritic, the first season holds a score of 64 out of 100, based on 18 critics and the second season holds a score of 75 out of 100, based on 5 critics, both indicating \"generally favorable reviews\".\n\nProduction \n\nDevelopment and early recasts \n\nHome Improvement had been in the works between Tim Allen and the writing/producing team of Carmen Finestra, David McFadzean and Matt Williams since the summer of 1990. Originally, the project's proposed title was Hammer Time, both a play on the catchphrase made popular by artist MC Hammer and the name of the fictional fix-it show within the series, which was also called Hammer Time. By the time ABC committed to the project in early 1991, Allen and his team had already changed the title to Home Improvement. The show hosted by Tim Taylor in the shooting script for Home Improvement was still called Hammer Time when the first pilot with Frances Fisher was filmed in April 1991. The catalyst for the series' name change was to represent the aspect of fixing problems within the family and home life, as well as the use of mechanics and tools. Once the second phase of the pilot was produced, with all the actors that made the final cut into the series (including Patricia Richardson), Tim Taylor's Hammer Time became Tool Time.\n\nThe first filmed pilot was produced in April 1991, with Frances Fisher playing Jill Taylor. Fisher, primarily known as a dramatic actress, was well qualified for the co-starring role but was viewed by the studio audience as not being comedic enough, and too serious in her line delivery. The producers tried to work with Fisher on adapting to the situation comedy setting, but shortly after the pilot wrapped post-production, they decided to recast her.\n\nBefore the first pilot was shot, actor John Bedford Lloyd was in the running for one of two roles; that of Tim's Tool Time assistant (originally named \"Glen\") and the role of Wilson. Bedford Lloyd eventually got the part of Wilson, but his agent later made claims that the actor was unaware that most of his scenes would require his face to be partially hidden behind a fence. For this reason, the crew received news just one day prior to taping the first pilot that Bedford-Lloyd had dropped out. Casting immediately contacted the other actor considered for the role, Earl Hindman.\n\nStephen Tobolowsky was tapped to play the Tool Time co-host, Glen. However, he was still busy with a movie that was in the middle of production at the time the first pilot was to be shot. Therefore, the producers set out to cast an alternate character that would stand in as Tim's co-host for the pilot, or for however many episodes were required until Tobolowsky was available. The casting department auditioned Richard Karn, for what would be his first major appearance on a TV sitcom; the character of Al Borland was created from there. After the first few episodes completed with Patricia Richardson as Jill, Tobolowsky was still tied up with his other commitments, and Karn found himself in his role permanently when Tobolowsky decided he would have no time to do a series. Thus, the character of Glen never came into being.\n\nCasting changes \n\nPamela Anderson \n\nIn the first two years of the show, Pamela Anderson played the part of Tim's Tool Girl, Lisa, on Tool Time, but left the show to focus on her role on the syndicated series Baywatch. Her last episode as a series regular was \"The Great Race\", which aired on May 19, 1993. Tim's new assistant, Heidi, played by Debbe Dunning, replaced Anderson as the Tool Time Girl for the following third season, starting with \"Maybe Baby\", which aired on September 15, 1993. Anderson did reprise the role of Lisa on the sixth-season finale episode \"The Kiss and the Kiss-Off\", which aired on May 20, 1997.\n\nDeparture of Jonathan Taylor Thomas \n\nIn the show's eighth season, the middle child Randy left for an environmental study program in Costa Rica in the episode \"Adios\", which aired on September 29, 1998. This was done because Jonathan Taylor Thomas reportedly wanted to take time off to focus on academics. His last appearance on Home Improvement was the eighth and final season's Christmas episode \"Home for the Holidays\", which aired on December 8, 1998.  He did not return to the show for the series finale, aired in May 1999, only appearing in archived footage. He was shooting the film Speedway Junky for release that summer. His character was not replaced.\n\nPost-series events \n\nTim Allen, Richard Karn, Casey Sander, and Debbe Dunning had a reunion in a television special named Tim Allen Presents: A User's Guide to Home Improvement in 2003 (a terminally ill Earl Hindman did voice-overs, befitting his never-seen persona of Wilson). Allen presented his own favorite clips from the show, insider's tips, personal reflections and a question and answer session with the live audience. The special is included on the season 8 DVD set.\n\nOn August 3, 2011, in Pacific Palisades, California, the surviving main cast members reunited for Entertainment Weekly magazine, including Jonathan Taylor Thomas, whom the cast had not seen since 1998.\n\nRichard Karn guest starred in two episodes of Tim Allen's 2010s ABC sitcom Last Man Standing in 2013. Jonathan Taylor Thomas has also appeared on Last Man Standing,[http://www.people.com/people/article/0,,20683622,00.html Jonathan Taylor Thomas and Tim Allen Reunite on Last Man Standing] Retrieved March 20, 2013 and has directed episodes of the series.\n\nIn 2015, Patricia Richardson guest starred on Last Man Standing in the episode \"Helen Potts\", playing the episode's titular character. Jonathan Taylor Thomas made a cameo in the episode, playing Richardson's son.\n\nOn May 5, 2015, Hollywood Life reported that Tim Allen and Richard Karn had admitted talking about getting back together as a cast for a Home Improvement reboot or reunion show. Karn was quoted saying \"There is always a chance, absolutely. Would I be on board? Yeah I think so! I would love to see what the story lines could be, it could be very funny!\"\n\nCast \n\nMain cast \n\nRecurring characters \n\nSpecial guests and cameos \n\n*Many special guests made cameo appearances on Tool Time. These guests included race car drivers Johnny Rutherford, Robby Gordon, Mario and Michael Andretti, Al Unser, Sr./Jr./III, actress and model Jenny McCarthy (the season 8 episode \"Young at Heart\"), country artist Alan Jackson (the season 5 episode \"When Harry Kept Delores\"), golfer Payne Stewart (the season 7 episode \"Futile Attraction\") and comedian Drew Carey (the season 6 episode \"Totally Tool Time\", although not playing himself).\n*Numerous NASA astronauts appeared on the series, the most notable being Ken Bowersox, who made three separate appearances, once in the third season, once in the fifth and once in the seventh.\n*Former Denver Broncos quarterback John Elway, then Detroit Pistons star Grant Hill (the season 7 episode \"Believe It or Not\"), former boxers Evander Holyfield (the season 3 episode \"Eve of Construction\") and George Foreman (the season 1 episode \"Unchained Malady\"), and former President Jimmy Carter all appeared on the series. Carter made an appearance during season three episode \"Eve of Construction\", which focused on Habitat for Humanity.\n*Isiah Thomas appears as himself at the end of the season three episode \"Aisle See You in My Dreams\".\n*Jay Leno appears with his car collection in the fourth-season episode \"Brother, Can You Spare a Hot Rod?\" In which he plays a staff member of \"Papa Mia\" the pizza guy. \"If he's not there in 30 minutes, you should have given better directions\" He also appeared four years later in the episode \"Home Alone\" in a dream sequence about Tim's book, saying \"Instead of getting a literary genius like Tim Taylor, we're stuck with Jack Nicholson and Marlon Brando.\" Leeza Gibbons and Oprah Winfrey also guest-starred in the episode playing themselves on their respective talk shows talking about Tim's book (and how he has not written it).\n*Bob Vila also appeared on several episodes, with Tim seeing him as a rival (he appears in Season One's \"What About Bob?\"  Season Two's \"The Great Race,\" Season Three's \"The Great Race II,\" Season Four's \"Tool Time After Dark,\" with recycled Tool Time footage from earlier episodes, and Season Six's \"Insult to Injury\" in a dream sequence about Vila winning the consecutive home renovation show appearance record; Vila wasn't played by himself, and instead played by a stunt-double for a one-shot cameo).\n*The Beach Boys appeared in the Season 6 episode \"The Karate Kid Returns\" as Wilson's cousins.  (Then-Beach Boys Carl Wilson and Mike Love were real-life cousins.)\n*Tom Wopat, best known as Luke Duke from the TV Series The Dukes of Hazzard, appears early on in Season 7 as Ian, to whom Jill feels romantically attracted after meeting him in a gym and who puts in granite countertops (albeit halfway) in the Taylor's kitchen.\n*A then-unknown Dave Chappelle and Jim Breuer guest-starred in the Season 4 episode \"Talk to Me\".  This episode set the stage for the Home Improvement spin-off Buddies, which was Chappelle's first television series.  The series premiered in March 1996 and lasted five episodes, though 13 were produced.\n*Other famous guests include Drake Bell in the third-season episode \"Swing Time\", Jack Elam, and Ernest Borgnine, who both appeared in the first-season episode \"Birds of a Feather Flock to Taylor.\"\n*Dan Aykroyd makes a guest appearance as a blues-loving minister in the episode \"Losing My Religion\" during the seventh season, the character he was currently playing at the time in the series Soul Man, a series that was also created by the creators of Home Improvement that lasted two seasons. Aykroyd helps Tim understand Tim's son Randy's decision to no longer go to church after he starts volunteering at a hospice.\n*Robert Picardo made two appearances on the show as Tim's neighbor, Joe \"The Meat Man\" Morton. He appeared in \"A Sew, Sew Evening,\" and \"Blow-Up,\" both early on in the third season.  It was explained by Joe's wife Marie (Mariangela Pino) in the fifth-season episode \"Jill's Surprise Party\" that he had left her for a younger woman who worked at his plant (Picardo was no longer available after being cast as The Doctor on Star Trek: Voyager).\n*Rodney Dangerfield and Alex Rocco appeared together in the 1997 Thanksgiving episode in which they both appeared in a luxury box at the Pontiac Silverdome.\n*Magicians Penn and Teller also appeared in one of the episodes of the final season, opening for Tool Time by performing tricks with Tim.\n*Actress Michelle Williams played Jessica Lutz, a girl that Brad was going on a date with in Season 4, 3 years before she became famous as Jen Lindley on the series Dawson's Creek.\n*Jazz/crossover vocal group The Manhattan Transfer (Tim Hauser, Janis Siegel, Alan Paul, Cheryl Bentyne) appeared as themselves in season 2, an episode entitled \"I'm Scheming of a White Christmas.\"\n\nEpisodes \n\nNielsen ratings \n\nThe series finale became the fifth highest-rated series finale television program of the 1990s and the ninth overall series finale ever presented on a single network in television history, watched by 35.5 percent of the households sampled in America, and 21.6 percent of television viewers.\n\nSyndication \n\nIn the United States, Home Improvement began airing in broadcast syndication in September 1995, distributed via Buena Vista Television (now Disney-ABC Domestic Television) and continued to be syndicated until 2007; in a manner similar to Seinfeld and The Simpsons after they began airing in broadcast syndication, episodes of Home Improvement were not aired in order of their production code number or original airdate. It has previously aired on cable television via TBS from 2002 to 2013, and WGN America from 2002 to 2007.  It also aired on Nick at Nite from September 3, 2007 to October 2009 and again on Monday mornings only starting on September 27, 2010, and aired on TV Land from January 4, 2010 to 2013. The show aired on The Hallmark Channel from September 3, 2013 until January 2014. As of January 8, 2016, The Hallmark Channel airs Home Improvement Monday through Friday at 2 p.m. ET until 6 p.m. ET\n\nSince 1995, due to its popularity, reruns began airing on The Disney Channel, Channel 4 and ABC1 in the UK. Originally, Home Improvement was aired on Channel 4 and then later the Disney Channel; however, in 2005, it began broadcasting on ABC1. On September 26, 2007, ABC1 ceased transmissions and no official announcement was made as to which channels would be broadcasting ABC1's previous programming. Although the show stopped airing in the UK due to ABC1 ceasing transmission on September 26, on July 28, 2008 it restarted from the pilot episode on Virgin 1. However, it was announced that Virgin 1 (now Channel One) would close on January 31, 2011, and no announcement has been made regarding which channel the show will be moved to.\n\nIn Canada, it previously aired on CTV from beginning to the ending (1991–1999), CMT and YTV. In Germany and Austria, Home Improvement has been shown in dubbing under the title Hör mal wer da hämmert (\"Listen who's hammering\"). It ran on ARD (1993–1995), RTL (1996–2006), RTL II (1999–2000, 2007–2012), VOX (2004–2006), Super RTL (2008–2009), and reruns are currently shown on the private channels RTL Nitro and in Austria on ATV. It was also shown on M-Net on South African television, and reruns are showing throughout 2007 on the M-Net Series channel, available to DStv users. It is previously airing on TV Land at 2AM ET. In New Zealand, reruns of the show also currently play on the free-to-air channel Prime Television. In 2011, Asian Network Star World started telecasting the show in place of The Simpsons.\n\nAt the present time, reruns are aired internationally on the Seven Network and 111 Hits in Australia, Sab TV Disney Channel in India and HITS in South East Asia, Hong Kong and Taiwan.\n\nOn September 29, 2017, Home Improvement became available for streaming on Hulu along with fellow Disney-ABC properties Dinosaurs and Boy Meets World, in addition to fellow ABC programs Family Matters, Full House, Hangin' with Mr. Cooper, Perfect Strangers and Step by Step.\n\nDVD releases \n\nWalt Disney Studios Home Entertainment has released all eight seasons on DVD in Region 1, 2 and 4. Season 8 has the \"Backstage Pass\" (which immediately followed \"The Long and Winding Road, Part III\") and the reunion show on the fourth disc of the set.\n\nOn May 10, 2011, Walt Disney Studios released a complete series box set entitled Home Improvement: 20th Anniversary Complete Collection on DVD in Region 1. The 25-disc collection features all 204 episodes of the series as well as all special features contained on the previously released season sets; it is encased in special collectible packaging, a Home Improvement toolbox with a Binford \"All-In-One Tool\" tape measure.\n\nDVD notes \n\nThe Region 1 DVDs are on three discs (with the exception of the final season set, which has four discs), whereas the Region 2 DVDs are presented across four discs, but in Germany the fourth to seventh seasons are also three disc sets.  The Region 2 packaging and programme menus for Season 1 vary compared to the Region 1 releases. The Season 3 menus in Region 1 are in widescreen, but 4:3 in Region 2. The Region 1 releases of Seasons 2 and 3 consist of (deliberate) \"holes\" in the outer packaging—these do not exist in the Region 2 releases; in fact, the Season 3 outer packaging is physically printed where the hole would be in the Region 1 packaging.\n\nIt has been mentioned on review sites about the lack of episode commentaries and bonus features on the DVDs (except unaired blooper reels).  In an interview on About.com, Tim Allen stated that it was a done deal that the DVDs would not contain interviews or episode commentaries. Whether this was before or after someone at Disney ordered the three commentaries available on the Season 1 DVDs is unknown.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Home Improvement (TV series)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13523" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Home Improvement is an American television sitcom starring Tim Allen  that aired on ABC from September 17, 1991, to May 25, 1999, with a total of 204 half-hour episodes spanning over eight seasons. The series was created by Matt Williams, Carmen Finestra, and David McFadzean. In the 1990s, it was one of the most watched sitcoms in the American market, winning many awards. The series launched Tim Allen's acting career and was the start of the television career of Pamela Anderson, who was part of the recurring cast for the first two seasons.\n\nShow background \n\nBased on the stand-up comedy of Tim Allen, Home Improvement made its debut on ABC on September 17, 1991, and was one of the highest-rated sitcoms for almost the entire decade. It went to No. 1 in the ratings during the 1993–1994 season; the same year Allen had the No. 1 book (Don't Stand Too Close to a Naked Man) and movie (The Santa Clause).\n\nBeginning in season 2, Home Improvement began each episode with a cold open, which features the show's logo during the teaser. From season 4 until the end of the series in 1999, an anthropomorphic version of the logo was used in different types of animation.\n\nPlot details and storylines \n\nTaylor family \n\nThe series centers on the Taylor family, which consists of Tim (Tim Allen), his wife Jill (Patricia Richardson) and their three children: the oldest child, Brad (Zachery Ty Bryan), the middle child, Randy (Jonathan Taylor Thomas) and youngest child, Mark (Taran Noah Smith). The Taylors live in suburban Detroit, and have a neighbor named Wilson (Earl Hindman) who is often the go-to guy for solving the Taylors' problems.\n\nTim is a stereotypical American male, who loves power tools, cars, and sports. In particular, he is an avid fan of local Detroit teams. In numerous instances, Tim wears Lions, Pistons, Red Wings, and Tigers clothing, and many plots revolve around the teams. He is a former salesman for the fictional Binford Tool company, and is very much a cocky, overambitious, accident-prone know-it-all. Witty but flippant, Tim jokes around a lot, even at inappropriate times, much to the dismay of his wife. However, Tim can sometimes be serious when necessary. Jill, Tim's wife, is loving and sophisticated, but not exempt from dumb moves herself. In later seasons she returns to college to study psychology. Family life is boisterous for the Taylors with the two oldest children, Brad and Randy, tormenting the much younger Mark, all while continually testing and pestering each other. Such play happened especially throughout the first three seasons, and was revisited only occasionally until Jonathan Taylor Thomas left at the beginning of the eighth season. During the show's final season, Brad and Mark became much closer due to Randy's absence.\n\nBrad, popular and athletic, was often the moving factor, who engaged before thinking, a tendency which regularly landed him in trouble. Randy, a year younger, was the comedian of the pack, known for his quick-thinking, wisecracks, and smart mouth. He had more common sense than Brad but was not immune to trouble. Mark was somewhat of a mama's boy, though later in the series (in the seventh season) he grew into a teenage outcast who dressed in black clothing.  Meanwhile, Brad became interested in cars like his father and took up soccer. Randy joined the school drama club, and later the school newspaper; in the eighth season, he left for Costa Rica.\n\nIn early seasons, Wilson was always seen standing on the other side of Tim's backyard fence as the two engaged in conversation, usually with Wilson offering sage advice as Tim grappled with his problems.  In later seasons, a running joke developed in which more and more creative means were used to prevent Wilson's face below the eyes from ever being seen by the audience.  Also in later seasons, Wilson's full name was revealed to be Wilson W. Wilson, Jr.\n\nTool Time \n\nEach episode includes Tim's own Binford-sponsored home improvement show, called Tool Time, a \"meta-program,\" or show-within-a-show. In hosting this show, Tim is joined by his friend and mild-mannered assistant Al Borland (Richard Karn), and a \"Tool Time girl\"—first Lisa (Pamela Anderson) and later Heidi (Debbe Dunning)—whose main duty is to introduce the pair at the beginning of the show with the line \"Does everybody know what time it is?\" The Tool Time girl also assists Tim and Al during the show by bringing them tools.\n\nAlthough revealed to be an excellent salesman and TV personality, Tim is spectacularly accident prone as a handyman, often causing massive disasters on and off the set, to the consternation of his co-workers and family. Many Tool Time viewers assume that the accidents on the show are done on purpose, to demonstrate the consequences of using tools improperly. Many of Tim's accidents are caused by his devices being used in an unorthodox or overpowered manner, designed to illustrate his mantra \"More power!\". This popular catchphrase would not be uttered after Home Improvements seventh season, until Tim's last line in the series finale, which are the last two words ever spoken.\n\nTool Time was conceived as a parody of the PBS home-improvement show This Old House.  Tim and Al are caricatures of the two principal cast members of This Old House, host Bob Vila and master carpenter Norm Abram. Al Borland has a beard and always wears plaid shirts when taping an episode, reflecting Norm Abram's appearance on This Old House. Bob Vila appeared as a guest star on several episodes of Home Improvement, while Tim Allen and Pamela Anderson both appeared on Bob Vila's show Home Again.\n\nThe Tool Time theme music, an early 1960s-style saxophone-dominated instrumental rock tune, was sometimes used as the closing theme music for Home Improvement, especially when behind the credits were running the blooper scenes that took place during the taping of a Tool Time segment.\n\nMichigan college and university wear \n\nThroughout the show, Tim Taylor would often be wearing sweatshirts or T-shirts from various Michigan based college and universities. These were usually sent by the schools to the show for him to wear during an episode. Because Allen considered Michigan his home state, the rule was that only Michigan schools would get the free advertising.\n\nTheme music \n\nThe theme music for Home Improvement was composed by Dan Foliart. The theme song is unique for its sampling of power tools, most notably an electric drill and jackhammer, which is heard during theme song. Tim's grunting was also sampled for the theme song. The flute and organ parts of the theme music were also used. From Season 7 until the end of the series, a remixed version of the theme song was used.\n\nAwards, nominations, and other reception \n\nHome Improvement received numerous awards and nominations in its 8-season run. Notable awards and nominations include: Golden Globe Awards, Primetime Emmy Awards, Kids' Choice Awards, Young Artist Awards, YoungStar Awards, ASCAP Award, and many others.\n\nWatchMojo.com ranked Home Improvement as the #9 TV sitcom from the 1990s. The character with most honors was Wilson, who was ranked as the #6 unseen TV character and as the #3 TV neighbor. Binford made it to the #10 fictional brand. The video game Home Improvement: Power Tool Pursuit! was ranked as the #5 worst game based on a TV series. On Metacritic, the first season holds a score of 64 out of 100, based on 18 critics and the second season holds a score of 75 out of 100, based on 5 critics, both indicating \"generally favorable reviews\".\n\nProduction \n\nDevelopment and early recasts \n\nHome Improvement had been in the works between Tim Allen and the writing/producing team of Carmen Finestra, David McFadzean and Matt Williams since the summer of 1990. Originally, the project's proposed title was Hammer Time, both a play on the catchphrase made popular by artist MC Hammer and the name of the fictional fix-it show within the series, which was also called Hammer Time. By the time ABC committed to the project in early 1991, Allen and his team had already changed the title to Home Improvement. The show hosted by Tim Taylor in the shooting script for Home Improvement was still called Hammer Time when the first pilot with Frances Fisher was filmed in April 1991. The catalyst for the series' name change was to represent the aspect of fixing problems within the family and home life, as well as the use of mechanics and tools. Once the second phase of the pilot was produced, with all the actors that made the final cut into the series (including Patricia Richardson), Tim Taylor's Hammer Time became Tool Time.\n\nThe first filmed pilot was produced in April 1991, with Frances Fisher playing Jill Taylor. Fisher, primarily known as a dramatic actress, was well qualified for the co-starring role but was viewed by the studio audience as not being comedic enough, and too serious in her line delivery. The producers tried to work with Fisher on adapting to the situation comedy setting, but shortly after the pilot wrapped post-production, they decided to recast her.\n\nBefore the first pilot was shot, actor John Bedford Lloyd was in the running for one of two roles; that of Tim's Tool Time assistant (originally named \"Glen\") and the role of Wilson. Bedford Lloyd eventually got the part of Wilson, but his agent later made claims that the actor was unaware that most of his scenes would require his face to be partially hidden behind a fence. For this reason, the crew received news just one day prior to taping the first pilot that Bedford-Lloyd had dropped out. Casting immediately contacted the other actor considered for the role, Earl Hindman.\n\nStephen Tobolowsky was tapped to play the Tool Time co-host, Glen. However, he was still busy with a movie that was in the middle of production at the time the first pilot was to be shot. Therefore, the producers set out to cast an alternate character that would stand in as Tim's co-host for the pilot, or for however many episodes were required until Tobolowsky was available. The casting department auditioned Richard Karn, for what would be his first major appearance on a TV sitcom; the character of Al Borland was created from there. After the first few episodes completed with Patricia Richardson as Jill, Tobolowsky was still tied up with his other commitments, and Karn found himself in his role permanently when Tobolowsky decided he would have no time to do a series. Thus, the character of Glen never came into being.\n\nCasting changes \n\nPamela Anderson \n\nIn the first two years of the show, Pamela Anderson played the part of Tim's Tool Girl, Lisa, on Tool Time, but left the show to focus on her role on the syndicated series Baywatch. Her last episode as a series regular was \"The Great Race\", which aired on May 19, 1993. Tim's new assistant, Heidi, played by Debbe Dunning, replaced Anderson as the Tool Time Girl for the following third season, starting with \"Maybe Baby\", which aired on September 15, 1993. Anderson did reprise the role of Lisa on the sixth-season finale episode \"The Kiss and the Kiss-Off\", which aired on May 20, 1997.\n\nDeparture of Jonathan Taylor Thomas \n\nIn the show's eighth season, the middle child Randy left for an environmental study program in Costa Rica in the episode \"Adios\", which aired on September 29, 1998. This was done because Jonathan Taylor Thomas reportedly wanted to take time off to focus on academics. His last appearance on Home Improvement was the eighth and final season's Christmas episode \"Home for the Holidays\", which aired on December 8, 1998.  He did not return to the show for the series finale, aired in May 1999, only appearing in archived footage. He was shooting the film Speedway Junky for release that summer. His character was not replaced.\n\nPost-series events \n\nTim Allen, Richard Karn, Casey Sander, and Debbe Dunning had a reunion in a television special named Tim Allen Presents: A User's Guide to Home Improvement in 2003 (a terminally ill Earl Hindman did voice-overs, befitting his never-seen persona of Wilson). Allen presented his own favorite clips from the show, insider's tips, personal reflections and a question and answer session with the live audience. The special is included on the season 8 DVD set.\n\nOn August 3, 2011, in Pacific Palisades, California, the surviving main cast members reunited for Entertainment Weekly magazine, including Jonathan Taylor Thomas, whom the cast had not seen since 1998.\n\nRichard Karn guest starred in two episodes of Tim Allen's 2010s ABC sitcom Last Man Standing in 2013. Jonathan Taylor Thomas has also appeared on Last Man Standing,[http://www.people.com/people/article/0,,20683622,00.html Jonathan Taylor Thomas and Tim Allen Reunite on Last Man Standing] Retrieved March 20, 2013 and has directed episodes of the series.\n\nIn 2015, Patricia Richardson guest starred on Last Man Standing in the episode \"Helen Potts\", playing the episode's titular character. Jonathan Taylor Thomas made a cameo in the episode, playing Richardson's son.\n\nOn May 5, 2015, Hollywood Life reported that Tim Allen and Richard Karn had admitted talking about getting back together as a cast for a Home Improvement reboot or reunion show. Karn was quoted saying \"There is always a chance, absolutely. Would I be on board? Yeah I think so! I would love to see what the story lines could be, it could be very funny!\"\n\nCast \n\nMain cast \n\nRecurring characters \n\nSpecial guests and cameos \n\n*Many special guests made cameo appearances on Tool Time. These guests included race car drivers Johnny Rutherford, Robby Gordon, Mario and Michael Andretti, Al Unser, Sr./Jr./III, actress and model Jenny McCarthy (the season 8 episode \"Young at Heart\"), country artist Alan Jackson (the season 5 episode \"When Harry Kept Delores\"), golfer Payne Stewart (the season 7 episode \"Futile Attraction\") and comedian Drew Carey (the season 6 episode \"Totally Tool Time\", although not playing himself).\n*Numerous NASA astronauts appeared on the series, the most notable being Ken Bowersox, who made three separate appearances, once in the third season, once in the fifth and once in the seventh.\n*Former Denver Broncos quarterback John Elway, then Detroit Pistons star Grant Hill (the season 7 episode \"Believe It or Not\"), former boxers Evander Holyfield (the season 3 episode \"Eve of Construction\") and George Foreman (the season 1 episode \"Unchained Malady\"), and former President Jimmy Carter all appeared on the series. Carter made an appearance during season three episode \"Eve of Construction\", which focused on Habitat for Humanity.\n*Isiah Thomas appears as himself at the end of the season three episode \"Aisle See You in My Dreams\".\n*Jay Leno appears with his car collection in the fourth-season episode \"Brother, Can You Spare a Hot Rod?\" In which he plays a staff member of \"Papa Mia\" the pizza guy. \"If he's not there in 30 minutes, you should have given better directions\" He also appeared four years later in the episode \"Home Alone\" in a dream sequence about Tim's book, saying \"Instead of getting a literary genius like Tim Taylor, we're stuck with Jack Nicholson and Marlon Brando.\" Leeza Gibbons and Oprah Winfrey also guest-starred in the episode playing themselves on their respective talk shows talking about Tim's book (and how he has not written it).\n*Bob Vila also appeared on several episodes, with Tim seeing him as a rival (he appears in Season One's \"What About Bob?\"  Season Two's \"The Great Race,\" Season Three's \"The Great Race II,\" Season Four's \"Tool Time After Dark,\" with recycled Tool Time footage from earlier episodes, and Season Six's \"Insult to Injury\" in a dream sequence about Vila winning the consecutive home renovation show appearance record; Vila wasn't played by himself, and instead played by a stunt-double for a one-shot cameo).\n*The Beach Boys appeared in the Season 6 episode \"The Karate Kid Returns\" as Wilson's cousins.  (Then-Beach Boys Carl Wilson and Mike Love were real-life cousins.)\n*Tom Wopat, best known as Luke Duke from the TV Series The Dukes of Hazzard, appears early on in Season 7 as Ian, to whom Jill feels romantically attracted after meeting him in a gym and who puts in granite countertops (albeit halfway) in the Taylor's kitchen.\n*A then-unknown Dave Chappelle and Jim Breuer guest-starred in the Season 4 episode \"Talk to Me\".  This episode set the stage for the Home Improvement spin-off Buddies, which was Chappelle's first television series.  The series premiered in March 1996 and lasted five episodes, though 13 were produced.\n*Other famous guests include Drake Bell in the third-season episode \"Swing Time\", Jack Elam, and Ernest Borgnine, who both appeared in the first-season episode \"Birds of a Feather Flock to Taylor.\"\n*Dan Aykroyd makes a guest appearance as a blues-loving minister in the episode \"Losing My Religion\" during the seventh season, the character he was currently playing at the time in the series Soul Man, a series that was also created by the creators of Home Improvement that lasted two seasons. Aykroyd helps Tim understand Tim's son Randy's decision to no longer go to church after he starts volunteering at a hospice.\n*Robert Picardo made two appearances on the show as Tim's neighbor, Joe \"The Meat Man\" Morton. He appeared in \"A Sew, Sew Evening,\" and \"Blow-Up,\" both early on in the third season.  It was explained by Joe's wife Marie (Mariangela Pino) in the fifth-season episode \"Jill's Surprise Party\" that he had left her for a younger woman who worked at his plant (Picardo was no longer available after being cast as The Doctor on Star Trek: Voyager).\n*Rodney Dangerfield and Alex Rocco appeared together in the 1997 Thanksgiving episode in which they both appeared in a luxury box at the Pontiac Silverdome.\n*Magicians Penn and Teller also appeared in one of the episodes of the final season, opening for Tool Time by performing tricks with Tim.\n*Actress Michelle Williams played Jessica Lutz, a girl that Brad was going on a date with in Season 4, 3 years before she became famous as Jen Lindley on the series Dawson's Creek.\n*Jazz/crossover vocal group The Manhattan Transfer (Tim Hauser, Janis Siegel, Alan Paul, Cheryl Bentyne) appeared as themselves in season 2, an episode entitled \"I'm Scheming of a White Christmas.\"\n\nEpisodes \n\nNielsen ratings \n\nThe series finale became the fifth highest-rated series finale television program of the 1990s and the ninth overall series finale ever presented on a single network in television history, watched by 35.5 percent of the households sampled in America, and 21.6 percent of television viewers.\n\nSyndication \n\nIn the United States, Home Improvement began airing in broadcast syndication in September 1995, distributed via Buena Vista Television (now Disney-ABC Domestic Television) and continued to be syndicated until 2007; in a manner similar to Seinfeld and The Simpsons after they began airing in broadcast syndication, episodes of Home Improvement were not aired in order of their production code number or original airdate. It has previously aired on cable television via TBS from 2002 to 2013, and WGN America from 2002 to 2007.  It also aired on Nick at Nite from September 3, 2007 to October 2009 and again on Monday mornings only starting on September 27, 2010, and aired on TV Land from January 4, 2010 to 2013. The show aired on The Hallmark Channel from September 3, 2013 until January 2014. As of January 8, 2016, The Hallmark Channel airs Home Improvement Monday through Friday at 2 p.m. ET until 6 p.m. ET\n\nSince 1995, due to its popularity, reruns began airing on The Disney Channel, Channel 4 and ABC1 in the UK. Originally, Home Improvement was aired on Channel 4 and then later the Disney Channel; however, in 2005, it began broadcasting on ABC1. On September 26, 2007, ABC1 ceased transmissions and no official announcement was made as to which channels would be broadcasting ABC1's previous programming. Although the show stopped airing in the UK due to ABC1 ceasing transmission on September 26, on July 28, 2008 it restarted from the pilot episode on Virgin 1. However, it was announced that Virgin 1 (now Channel One) would close on January 31, 2011, and no announcement has been made regarding which channel the show will be moved to.\n\nIn Canada, it previously aired on CTV from beginning to the ending (1991–1999), CMT and YTV. In Germany and Austria, Home Improvement has been shown in dubbing under the title Hör mal wer da hämmert (\"Listen who's hammering\"). It ran on ARD (1993–1995), RTL (1996–2006), RTL II (1999–2000, 2007–2012), VOX (2004–2006), Super RTL (2008–2009), and reruns are currently shown on the private channels RTL Nitro and in Austria on ATV. It was also shown on M-Net on South African television, and reruns are showing throughout 2007 on the M-Net Series channel, available to DStv users. It is previously airing on TV Land at 2AM ET. In New Zealand, reruns of the show also currently play on the free-to-air channel Prime Television. In 2011, Asian Network Star World started telecasting the show in place of The Simpsons.\n\nAt the present time, reruns are aired internationally on the Seven Network and 111 Hits in Australia, Sab TV Disney Channel in India and HITS in South East Asia, Hong Kong and Taiwan.\n\nOn September 29, 2017, Home Improvement became available for streaming on Hulu along with fellow Disney-ABC properties Dinosaurs and Boy Meets World, in addition to fellow ABC programs Family Matters, Full House, Hangin' with Mr. Cooper, Perfect Strangers and Step by Step.\n\nDVD releases \n\nWalt Disney Studios Home Entertainment has released all eight seasons on DVD in Region 1, 2 and 4. Season 8 has the \"Backstage Pass\" (which immediately followed \"The Long and Winding Road, Part III\") and the reunion show on the fourth disc of the set.\n\nOn May 10, 2011, Walt Disney Studios released a complete series box set entitled Home Improvement: 20th Anniversary Complete Collection on DVD in Region 1. The 25-disc collection features all 204 episodes of the series as well as all special features contained on the previously released season sets; it is encased in special collectible packaging, a Home Improvement toolbox with a Binford \"All-In-One Tool\" tape measure.\n\nDVD notes \n\nThe Region 1 DVDs are on three discs (with the exception of the final season set, which has four discs), whereas the Region 2 DVDs are presented across four discs, but in Germany the fourth to seventh seasons are also three disc sets.  The Region 2 packaging and programme menus for Season 1 vary compared to the Region 1 releases. The Season 3 menus in Region 1 are in widescreen, but 4:3 in Region 2. The Region 1 releases of Seasons 2 and 3 consist of (deliberate) \"holes\" in the outer packaging—these do not exist in the Region 2 releases; in fact, the Season 3 outer packaging is physically printed where the hole would be in the Region 1 packaging.\n\nIt has been mentioned on review sites about the lack of episode commentaries and bonus features on the DVDs (except unaired blooper reels).  In an interview on About.com, Tim Allen stated that it was a done deal that the DVDs would not contain interviews or episode commentaries. Whether this was before or after someone at Disney ordered the three commentaries available on the Season 1 DVDs is unknown. Home Improvement (TV series). http://en.wikipedia.org/?curid=13523."
  }
}
