{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19635",
  "eid" : "3c8fe640-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778610852,
  "textBody" : "In the Roman calendar, March 15 was known as the Ides of March.\n\nEvents\n\n*474 BC – Roman consul Gnaeus Manlius Vulso celebrates an ovation for concluding the war against Veii and securing a forty years' truce. \n*44 BC – Julius Caesar, Dictator of the Roman Republic, is stabbed to death by Marcus Junius Brutus, Gaius Cassius Longinus, Decimus Junius Brutus, and several other Roman senators on the Ides of March.\n* 220 – Cao Cao, Chinese warlord and penultimate Chancellor of the Han dynasty passes away.\n* 280 – Sun Hao of Eastern Wu surrenders to Sima Yan which began the Jin dynasty.\n* 351 – Constantius II elevates his cousin Gallus to Caesar, and puts him in charge of the Eastern part of the Roman Empire.\n* 493 – Odoacer, the first barbarian King of Italy after the fall of the Western Roman Empire, is slain by Theoderic the Great, king of the Ostrogoths, while the two kings were feasting together.\n* 856 – Michael III, emperor of the Byzantine Empire, overthrows the regency of his mother, empress Theodora (wife of Theophilos) with support of the Byzantine nobility.\n* 933 – After a ten-year truce, German King Henry the Fowler defeats a Hungarian army at the Battle of Riade near the Unstrut river.\n*1147 – Conquest of Santarém: The forces of Afonso I of Portugal capture Santarém.\n*1311 – Battle of Halmyros: The Catalan Company defeats Walter V, Count of Brienne to take control of the Duchy of Athens, a Crusader state in Greece.\n*1493 – Christopher Columbus returns to Spain after his first trip to the Americas.\n*1564 – Mughal Emperor Akbar abolishes \"jizya\" (per capita tax).\n*1672 – Charles II of England issues the Royal Declaration of Indulgence.\n*1781 – American Revolutionary War: Battle of Guilford Court House: Near present-day Greensboro, North Carolina, 1,900 British troops under General Charles Cornwallis defeat a mixed American force numbering 4,400 in a Pyrrhic victory.\n*1783 – In an emotional speech in Newburgh, New York, George Washington asks his officers not to support the Newburgh Conspiracy. The plea is successful and the threatened coup d'état never takes place.\n*1819 – French physicist Augustin-Jean Fresnel wins a contest at the Académie des Sciences in Paris by proving that light behaves like a wave. The Fresnel integrals, still used to calculate wave patterns, silence skeptics who had backed the particle theory of Isaac Newton.\n*1820 – Maine becomes the 23rd U.S. state.\n*1848 – A revolution breaks out in Hungary. The Habsburg rulers are compelled to meet the demands of the Reform party.\n*1864 – American Civil War: The Red River Campaign: U.S. Navy fleet arrives at Alexandria, Louisiana.\n*1874 – France and Viet Nam sign the Second Treaty of Saigon, further recognizing the full sovereignty of France over Cochinchina.\n*1875 – Archbishop of New York John McCloskey is named the first cardinal in the United States.\n*1877 – First ever official cricket test match is played: Australia vs England at the MCG Stadium, in Melbourne, Australia.\n*1888 – Start of the Anglo-Tibetan War of 1888.\n*1906 – Rolls-Royce Limited is incorporated.\n*1916 – United States President Woodrow Wilson sends 4,800 United States troops over the U.S.–Mexico border to pursue Pancho Villa.\n*1917 – Tsar Nicholas II of Russia abdicates the Russian throne ending the 304-year Romanov dynasty.\n*1921 – Talaat Pasha, former Grand Vizir of the Ottoman Empire and chief architect of the Armenian Genocide is assassinated in Berlin by a 23-year-old Armenian, Soghomon Tehlirian. \n*1922 – After Egypt gains nominal independence from the United Kingdom, Fuad I becomes King of Egypt.\n*1926 – The dictator Theodoros Pangalos is elected President of Greece without opposition.\n*1927 – The first Women's Boat Race between the University of Oxford and the University of Cambridge takes place on The Isis in Oxford.\n*1931 –  explodes off Newfoundland, killing 27 of the 147 on board.\n*1933 – Austrian Chancellor Engelbert Dollfuss keeps members of the National Council from convening, starting the Austrofascist dictatorship.\n*1939 – Carpatho-Ukraine declares itself an independent republic, but is annexed by Hungary the next day.\n*1941 – Philippine Airlines, the flag carrier of the Philippines takes its first flight between Manila (from Nielson Field) to Baguio City with a Beechcraft Model 18 making the airline the first and oldest commercial airline in Asia operating under its original name.\n*1943 – World War II: Third Battle of Kharkov: The Germans retake the city of Kharkov from the Soviet armies in bitter street fighting.\n*1945 – World War II: Soviet forces begin an offensive to push Germans from Upper Silesia.\n*1951 – Iranian oil industry is nationalized. \n*1952 – In Cilaos, Réunion, 1870 mm (73 inches) of rain falls in a 24-hour period, setting a new world record (March 15 through March 16).\n*1961 – At the 1961 Commonwealth Prime Ministers' Conference, South Africa announces that it will withdraw from the Commonwealth when the South African Constitution of 1961 comes into effect.\n*1965 – President Lyndon B. Johnson, responding to the Selma crisis, tells U.S. Congress \"We shall overcome\" while advocating the Voting Rights Act.\n*1978 – Somalia and Ethiopia signed a truce to end the Ethio-Somali War.\n*1985 – The first Internet domain name is registered (symbolics.com).\n*1986 – Collapse of Hotel New World: Thirty-three people die when the Hotel New World in Singapore collapses.\n*1990 – Mikhail Gorbachev is elected as the first President of the Soviet Union.\n*1991 – Cold War: The Treaty on the Final Settlement with Respect to Germany comes into effect, granting full sovereignty to the Federal Republic of Germany.\n*2008 – Stockpiles of obsolete ammunition explode at an ex-military ammunition depot in the village of Gërdec, Albania, killing 26 people. To date, no other tragedy has caused more deaths in post-World War II Albania. \n*2011 – Beginning of the Syrian Civil War.\n\nBirths\n\n* 270 – Saint Nicholas, Greek bishop and saint (d. 343)\n*1097 – Fujiwara no Tadamichi, Japanese noble (died 1164)\n*1275 – Margaret of England, Duchess of Brabant (d. 1333)\n*1407 – Jacob, Margrave of Baden-Baden (d. 1453)\n*1444 – Francesco Gonzaga, Catholic cardinal (d. 1483)\n*1493 – Anne de Montmorency, French captain and diplomat (d. 1567)\n*1513 – Hedwig Jagiellon, Electress of Brandenburg (d. 1573)\n*1582 – Daniel Featley, English theologian and controversialist (d. 1645)\n*  1582   – Deodat del Monte, Flemish painter and architect (d. 1644)\n*1584 – Philip, Duke of Schleswig-Holstein-Sonderburg-Glücksburg (d. 1663)\n*1591 – Alexandre de Rhodes, French missionary and lexicographer (d. 1660)\n*1611 – Jan Fyt, Flemish painter (d. 1661)\n*1638 – Shunzhi Emperor of China (d. 1661)\n*1666 – George Bähr, German architect, designed the Dresden Frauenkirche (d. 1738)\n*1754 – Archibald Menzies, Scottish surgeon and botanist (d. 1842)\n*1767 – Andrew Jackson, American general, judge, and politician, 7th President of the United States (d. 1845)\n*1779 – William Lamb, 2nd Viscount Melbourne, English politician, Prime Minister of the United Kingdom (d. 1848)\n*1791 – Charles Knight, English author and publisher (d. 1873)\n*1809 – Joseph Jenkins Roberts, American-Liberian historian and politician, 1st President of Liberia (d. 1876)\n*  1809   – Karl Josef von Hefele, German bishop and theologian (d. 1893)\n*1813 – John Snow, English physician and epidemiologist (d. 1858)\n*1818 – Mariano Álvarez, Filipino general and politician (d. 1924)\n*1821 – Johann Josef Loschmidt, Austrian physicist and chemist (d. 1895)\n*  1821   – William Milligan, Scottish theologian, author, and educator (d. 1892)\n*1824 – Jules Chevalier, French priest, founded the Missionaries of the Sacred Heart (d. 1907)\n*1830 – Paul Heyse, German author, poet, and playwright, Nobel Prize laureate (d. 1914)\n*  1830   – Élisée Reclus, French geographer and academic (d. 1905)\n*1831 – Saint Daniele Comboni, Italian missionary and saint (d. 1881)\n*1835 – John Henry Kagi, American lawyer and activist (d. 1859)\n*  1835   – Eduard Strauss, Austrian composer and conductor (d. 1916)\n*1838 – Karl Davydov, Russian cellist, composer, and conductor (d. 1889)\n*1851 – John Sebastian Little, American lawyer and politician, 21st Governor of Arkansas (d. 1916)\n*  1851   – William Mitchell Ramsay, Scottish archaeologist and scholar (d. 1939)\n*1852 – Augusta, Lady Gregory, Anglo-Irish landowner,  playwright, and translator (d. 1932)\n*1854 – Emil von Behring, German physiologist and physician, Nobel Prize laureate (d. 1917)\n*1857 – Christian Michelsen, Norwegian businessman and politician, 1st Prime Minister of Norway (d. 1925)\n*1858 – Liberty Hyde Bailey, American botanist and academic, co-founded the American Society for Horticultural Science (d. 1954)\n*1860 – Waldemar Haffkine, Russian-Swiss bacteriologist and microbiologist (d. 1930)\n*1864 – Johan Halvorsen, Norwegian violinist, composer, and conductor (Oslo Philharmonic) (d. 1935)\n*1866 – Matthew Charlton, Australian miner and politician (d. 1948)\n*  1866   – Johan Vaaler, Norwegian inventor, invented the Paper clip (d. 1910)\n*1869 – Stanisław Wojciechowski, Polish scholar and politician, 2nd President of the Republic of Poland (d. 1953)\n*1874 – Eugène Fiset, Canadian physician, general, and politician, 18th Lieutenant Governor of Quebec (d. 1951)\n*  1874   – Harold L. Ickes, American journalist and politician, 32nd United States Secretary of the Interior (d. 1952)\n*1878 – Reza Shah, Iranian king (d. 1944)\n*1886 – Wladimir Burliuk, Ukrainian-Greek painter and illustrator (d. 1917)\n*1887 – Marjorie Merriweather Post, American businesswoman and philanthropist, founded General Foods (d. 1973)\n*  1887   – Lütfi Kırdar, Turkish physician and politician, Turkish Minister of Health (d. 1961)\n*1890 – Boris Delaunay, Russian mathematician and mountaineer (d. 1980)\n*1892 – James Basevi Ord, Mexican-American colonel (d. 1938)\n*1897 – Jackson Scholz, American runner (d. 1986)\n*1900 – Gilberto Freyre, Brazilian sociologist, anthropologist, historian and writer (d. 1987)\n*1904 – George Brent, Irish-American actor (d. 1979)\n*  1904   – J. Pat O'Malley, English-American actor (d. 1985)\n*1905 – Berthold Schenk Graf von Stauffenberg, German lawyer and judge (d. 1944)\n*1907 – Zarah Leander, Swedish actress and singer (d. 1981)\n*1909 – Jaroslava Muchová Syllabová, Czech painter (d. 1986)\n*1911 – Lightnin' Hopkins, American blues singer-songwriter and guitarist (d. 1982)\n*1912 – Louis Paul Boon, Flemish journalist and author (d. 1979)\n*1913 – Macdonald Carey, American actor (d. 1994)\n*  1913   – Jack Fairman, English race car driver (d. 2002)\n*1916 – Frank Coghlan, Jr., American actor and pilot (d. 2009)\n*  1916   – Fadil Hoxha, Kosovar commander and politician, 2nd President of Kosovo (d. 2001)\n*  1916   – Harry James, American trumpet player, bandleader, and actor (d. 1983)\n*1918 – Richard Ellmann, American author and critic (d. 1987)\n*  1918   – Punch Imlach, Canadian ice hockey player, coach, and manager (d. 1987)\n*1919 – Lawrence Tierney, American actor (d. 2002)\n*1920 – E. Donnall Thomas, American physician and academic, Nobel Prize laureate (d. 2012)\n*1921 – Madelyn Pugh, American television writer and producer (d. 2011)\n*1923 – Charles Wheeler, German-English soldier and journalist (d. 2008)\n*1924 – Irina Nikolaevna Levchenko, Russian tank commander (d. 1973)\n*1926 – Ben Johnston, American composer and academic\n*  1926   – Norm Van Brocklin, American football player and coach (d. 1983)\n*1927 – Christian Marquand, French actor, director, and screenwriter (d. 2000)\n*  1927   – Carl Smith, American singer-songwriter and guitarist (d. 2010)\n*1928 – Bob Wilber, American clarinet player and saxophonist\n*1930 – Zhores Alferov, Belarusian-Russian physicist and academic, Nobel Prize laureate\n*  1930   – Martin Karplus, Austrian-American chemist and academic, Nobel Prize laureate\n*  1930   – Kostas Nestoridis, Greek footballer and manager\n*1931 – David Hayes, American sculptor and academic (d. 2013)\n*1932 – Alan Bean, American captain, pilot, and astronaut\n*  1932   – Arif Mardin, Turkish-American record producer (d. 2006)\n*1933 – Ruth Bader Ginsburg, American lawyer and judge\n*  1933   – Philippe de Broca, French actor, director, and screenwriter (d. 2004)\n*1934 – Richard Layard, Baron Layard, English economist and academic\n*  1934   – Kanshi Ram, Indian politician (d. 2006)\n*1935 – David Andrews, Irish politician, 21st Minister of Foreign Affairs for Ireland\n*  1935   – Judd Hirsch, American actor\n*  1935   – Jimmy Swaggart, American pastor and television host\n*  1935   – Leonid Yengibarov, Russian-Armenian clown and boxer (d. 1972)\n*1936 – Howard Greenfield, American songwriter (d. 1986)\n*1937 – Marcus Raichle, American neurologist and physiologist\n*  1937   – Valentin Rasputin, Russian environmentalist and author (d. 2015)\n*1938 – Charles Lloyd, American saxophonist and flute player\n*1939 – Ted Kaufman, American engineer and politician\n*  1939   – Robert Nye, English author, poet, and playwright (d. 2016)\n*1940 – Frank Dobson, English politician, Secretary of State for Health\n*1941 – Mike Love, American singer-songwriter and musician\n*1943 – David Cronenberg, Canadian actor, director, and screenwriter\n*  1943   – Lynda La Plante, English actress, screenwriter, and author\n*  1943   – Michael Scott-Joynt, English bishop (d. 2014)\n*  1943   – Sly Stone, American singer-songwriter, musician, and producer\n*1944 – Chi Cheng, Taiwanese runner and politician\n*  1944   – Jacques Doillon, French director and screenwriter\n*  1944   – Francis Mankiewicz, Canadian director, producer, and screenwriter (d. 1993)\n*1945 – A. K. Faezul Huq, Bangladeshi lawyer and politician (d. 2007)\n*  1945   – Mark J. Green, American lawyer and politician\n*1946 – Bobby Bonds, American baseball player and coach (d. 2003)\n*  1946   – Howard E. Scott, American funk/rock guitarist and songwriter \n*1948 – Kate Bornstein, American author and activist\n*  1948   – Sérgio Vieira de Mello, Brazilian diplomat (d. 2003)\n*1950 – Jørgen Olsen, Danish singer-songwriter\n*  1950   – Kurt Koch, Swiss cardinal\n*1951 – David Alton, Baron Alton of Liverpool, English educator and politician\n*1952 – Howard Devoto, English singer-songwriter \n*  1952   – Philip Green, English businessman\n*  1952   – Howard Koh, American physician and politician, 14th United States Assistant Secretary for Health\n*1953 – Richard Bruton, Irish economist and politician, Minister for Jobs, Enterprise and Innovation\n*  1953   – Heather Graham Pozzessere, American author\n*  1953   – Kumba Ialá, Bissau-Guinean educator and politician, President of Guinea-Bissau (d. 2014)\n*1954 – Massimo Bubola, Italian singer-songwriter, guitarist, and producer\n*  1954   – Isobel Buchanan, Scottish soprano and actress\n*  1954   – Bob Budiansky, American author and illustrator\n*  1954   – Henry Marsh, American runner and businessman, co-founded MonaVie\n*1955 – Mohsin Khan, Pakistani cricketer\n*  1955   – Dee Snider, American singer-songwriter and actor \n*1956 – Clay Matthews, Jr., American football player and coach\n*1957 – Joaquim de Almeida, Portuguese-American actor\n*  1957   – Víctor Muñoz, Spanish footballer and manager\n*  1957   – David Silverman, American animator, director, and screenwriter\n*1958 – Anne Davies, English television presenter and newsreader\n*1959 – Harold Baines, American baseball player and coach\n*  1959   – Renny Harlin, Finnish director and producer\n*  1959   – Lisa Holton, American journalist and author\n*1960 – Mike Pagliarulo, American baseball player and coach\n*  1960   – Phil Walsh, Australian rules footballer and coach (d. 2015)\n*1961 – Terry Cummings, American basketball player and singer\n*  1961   – Craig Ludwig, American ice hockey player and coach\n*1962 – Terence Trent D'Arby, American singer-songwriter\n*1963 – Bret Michaels, American singer-songwriter, guitarist, and actor \n*1964 – Davide Pinato, Italian footballer\n*  1964   – Rockwell, American singer-songwriter and musician\n*1965 – Sunetra Gupta, Indian epidemiologist, author, and academic\n*  1965   – Robyn Malcolm, New Zealand actress\n*1968 – Mark McGrath, American singer-songwriter and television host \n*  1968   – Terje Riis-Johansen, Norwegian politician, Norwegian Minister of Petroleum and Energy\n*  1968   – Sabrina Salerno, Italian singer-songwriter\n*1969 – Rona Ambrose, Canadian journalist and politician, 8th Canadian Minister of Health\n*  1969   – Gianluca Festa, Italian footballer and coach\n*  1969   – Kim Raver, American actress\n*1970 – Christine Anu, Australian singer\n*  1970   – Naka Drotske, South African rugby player \n*  1970   – Derek Parra, American speed skater and coach\n*1971 – Penny Lancaster, English model and photographer\n*  1971   – Joanne Wise, English long jumper\n*1972 – Mark Hoppus, American singer-songwriter, bass player, and producer \n*  1972   – Mike Tomlin, American football player and coach\n*1973 – Robin Hunicke, American video game designer and producer\n*  1973   – Lee Jung-jae, South Korean model and actor\n*  1973   – Masayuki Naruse, Japanese wrestler and mixed martial artist\n*1974 – Robert Fick, American baseball player\n*1975 – will.i.am, American rapper, producer, and actor \n*  1975   – Eva Longoria, American actress and producer\n*  1975   – Veselin Topalov, Bulgarian chess player\n*  1975   – Darcy Tucker, Canadian ice hockey player\n*1976 – Katherine Brooks, American director, producer, and screenwriter\n*1977 – Joe Hahn, American DJ, producer, and director (Linkin Park)\n*  1977   – Brian Tee, Japanese-American actor, producer, and screenwriter\n*1979 – Kyle Mills, New Zealand cricketer\n*  1979   – Kevin Youkilis, American baseball player and scout\n*1980 – Freddie Bynum, American baseball player\n*  1980   – Eric Grothe, Jr. Australian rugby league player and guitarist\n*  1980   – Claudiney Ramos, Brazilian footballer (d. 2013)\n*1981 – Young Buck, American rapper, producer, and actor \n*  1981   – Mikael Forssell, German-Finnish footballer\n*  1981   – Veronica Maggio, Swedish singer-songwriter\n*1982 – Emily Dunn, American actress and dancer\n*  1982   – Wilson Kipsang Kiprotich, Kenyan runner\n*1983 – Umut Bulut, Turkish footballer\n*  1983   – Ben Hilfenhaus, Australian cricketer\n*  1983   – Kostas Kaimakoglou, Greek basketball player\n*  1983   – Daryl Murphy, Irish footballer\n*1984 – Olivier Jean, Canadian speed skater\n*  1984   – Wilson Aparecido Xavier Júnior, Brazilian footballer\n*  1984   – Kostas Vasileiadis, Greek basketball player\n* 1984    – Malin Buska, Swedish actress\n*1985 – Antti Autti, Finnish snowboarder\n*  1985   – Tom Chilton, English race car driver\n*  1985   – Curtis Davies, English footballer\n*  1985   – Javier Garrido, Spanish footballer\n*  1985   – Jon Jay, American baseball player\n*  1985   – Kellan Lutz, American model and actor\n*1987 – Eric Decker, American football player\n*1988 – Éver Guzmán, Mexican footballer\n*  1988   – James Reimer, Canadian ice hockey player\n*  1988   – Jolo Revilla, Filipino actor and politician\n*  1988   – Alexander Sims, English race car driver\n*1989 – Sam Baldock, English footballer\n*  1989   – Bryce Gibbs, Australian footballer\n*  1989   – Sandro Raniere, Brazilian footballer\n*  1989   – Adrien Silva, Portuguese footballer\n*1990 – Siobhan Magnus, American singer-songwriter\n*1991 – Tavon Austin, American football player\n*  1991   – Kurt Baptiste, Australian rugby league player\n*  1991   – Xavier Henry, American basketball player\n*  1991   – Kevin Müller, German footballer\n*  1991   – Naren Weiss, American actor and playwright \n*1993 – Alia Bhatt, British actress and singer\n*  1993   – Michael Fulmer, American baseball player\n*  1993   – Paul Pogba, French footballer\n*  1993   – Alyssa Reid, Canadian singer-songwriter and guitarist\n*  1993   – Mark Scheifele, Canadian ice hockey player\n*2000 – Kristian Kostov, Russian/Bulgarian singer-songwriter\n\nDeaths\n\n* 44 BC – Julius Caesar, Roman general and statesman (b. 100 BC)\n* 220 – Cao Cao, Chinese general, warlord and statesman (b. 155)\n* 493 – Odoacer, first king of Italy after the fall of the Western Roman Empire (b. 433)\n* 752 – Pope Zachary\n* 963 – Romanos II, Byzantine emperor (b. 938)\n*1086 – Richilde, Countess of Hainaut, Flemish consort and regent (b. c. 1018) \n*1124 – Ernulf, Bishop of Rochester (b. c. 1040)\n*1190 – Isabella of Hainault, queen of Philip II of France (b. 1170)\n*1311 – Walter V, Count of Brienne (b. 1275)\n*  1311   – Thomas III d'Autremencourt, Lord of Salona, Marshal of Achaea\n*  1311   – Albert Pallavicini, Margrave of Bodonitza\n*  1311   – George I Ghisi, Triarch of Euboea, Baron of Chalandritsa, Lord of Tinos, Mykonos, Serifos and Keos\n*1327 – Albert of Schwarzburg\n*1536 – Pargalı Ibrahim Pasha, Ottoman politician, 35th Grand Vizier of the Ottoman Empire (b. 1493)\n*1644 – Countess Louise Juliana of Nassau (b. 1576)\n*1657 – David Pardo, Dutch rabbi and scholar (b. 1591)\n*1673 – Salvator Rosa, Italian painter and poet (b. 1615)\n*1711 – Eusebio Kino, Italian priest and missionary (b. 1645)\n*1820 – Clement Mary Hofbauer, Austrian priest and saint (b. 1751)\n*1842 – Luigi Cherubini, Italian composer and theorist (b. 1760)\n*1849 – Giuseppe Caspar Mezzofanti, Italian cardinal and linguist (b. 1774)\n*1891 – Joseph Bazalgette, English engineer and academic (b. 1819)\n*1897 – James Joseph Sylvester, English mathematician and academic (b. 1814)\n*1898 – Henry Bessemer, English engineer and businessman (b. 1813)\n*1921 – Talaat Pasha, Ottoman politician, 281st Grand Vizier of the Ottoman Empire (b. 1874)\n*1933 – Gustavo Jiménez, Peruvian colonel and politician, 73rd President of Peru (b. 1886)\n*1937 – H. P. Lovecraft, American short story writer, editor, and novelist (b. 1890)\n*1938 – Nikolai Bukharin, Russian journalist and politician (b. 1888)\n*1939 – Luis Barceló, Spanish colonel (b. 1896)\n*1941 – Alexej von Jawlensky, Russian-German painter (b. 1864)\n*1944 – Otto von Below, Prussian general (b. 1857)\n*1951 – John S. Paraskevopoulos, Greek-South African astronomer and academic (b. 1889)\n*1959 – Lester Young, American saxophonist and clarinet player (b. 1909)\n*1962 – Arthur Compton, American physicist and academic, Nobel Prize laureate (b. 1892)\n*1966 – Abe Saperstein, American basketball player and coach (b. 1902)\n*1969 – Miles Malleson, English actor and screenwriter (b. 1888)\n*  1969   – Musashiyama Takeshi, Japanese sumo wrestler, the 33rd Yokozuna (b. 1909)\n*1970 – Tarjei Vesaas, Norwegian author and poet (b. 1897)\n*1971 – Jean-Pierre Monseré, Belgian cyclist (b. 1948)\n*1972 – Aleksandr Ivanovich Laktionov, Russian painter and educator (b. 1910)\n*1975 – Aristotle Onassis, Greek-Argentinian businessman (b. 1900)\n*1981 – René Clair, French director and screenwriter (b. 1898)\n*1983 – Coloman Braun-Bogdan, Romanian footballer and manager (b. 1905)\n*  1983   – Rebecca West, English author and critic (b. 1892)\n*1985 – Radha Krishna Choudhary, Indian historian and author (b. 1921)\n*1987 – Douglas Abbott, Canadian lawyer and politician, 10th Canadian Minister of National Defence (b. 1899)\n*1988 – Dmitri Polyakov, Ukrainian general and spy (b. 1926)\n*1989 – Muhammad Jameel Didi, Maldivian poet and politician (b. 1915)\n*1990 – Farzad Bazoft, Iranian-English journalist (b. 1958)\n*  1990   – Tom Harmon, American football player and sportscaster (b. 1919)\n*1991 – Bud Freeman, American saxophonist, composer, and bandleader (b. 1906)\n*1997 – Gail Davis, American actress (b. 1925)\n*  1997   – Victor Vasarely, Hungarian-French painter (b. 1906)\n*1998 – Benjamin Spock, American pediatrician and author (b. 1903)\n*1999 – Guy D'Artois, Canadian soldier (b. 1917)\n*2001 – Gaetano Cozzi, Italian historian and academic (b. 1922)\n*  2001   – Ann Sothern, American actress and singer (b. 1909)\n*2003 – Thora Hird, English actress (b. 1911)\n*2004 – Bill Pickering, New Zealand-American scientist and engineer (b. 1910)\n*  2004   – John Pople, English-American chemist and academic, Nobel Prize laureate (b. 1925)\n*2005 – Bob Bellear, Australian engineer and judge (b. 1944)\n*  2005   – Otar Korkia, Georgian basketball player and coach (b. 1923)\n*2006 – Georgios Rallis, Greek lieutenant and politician, 173rd Prime Minister of Greece (b. 1918)\n*  2006   – Red Storey, Canadian football player and referee (b. 1918)\n*2007 – Bowie Kuhn, American lawyer and businessman (b. 1926)\n*  2007   – Stuart Rosenberg, American director and producer (b. 1927)\n*2008 – Mikey Dread, Jamaican singer-songwriter and producer (b. 1954)\n*  2008   – Vytautas Kernagis, Lithuanian singer-songwriter and actor (b. 1951)\n*  2008   – G. David Low, American astronaut and engineer (b. 1956)\n*2009 – Ron Silver, American actor, director, and producer (b. 1946)\n*2011 – Nate Dogg, American rapper (b. 1969)\n*2012 – Mervyn Davies, Welsh rugby player (b. 1946)\n*  2012   – Eb Gaines, American businessman and diplomat (b. 1927)\n*  2012   – Bernardino González Ruíz, Panamanian physician and politician, President of Panama (b. 1911)\n*  2012   – Fran Matera, American illustrator (b. 1924)\n*  2012   – Dave Philley, American baseball player and manager (b. 1920)\n*2013 – James Bonk, American chemist and academic (b. 1931)\n*  2013   – Booth Gardner, American businessman and politician, 19th Governor of Washington (b. 1936)\n*  2013   – Hardrock Gunter, American singer-songwriter and guitarist (b. 1925)\n*  2013   – Shannon Larratt, Canadian publisher, founded BMEzine (b. 1973)\n*  2013   – Masamichi Noro, Japanese-French martial artist, founded Kinomichi (b. 1935)\n*  2013   – Kallam Anji Reddy, Indian engineer and businessman, founded Dr. Reddy's Laboratories (b. 1940)\n*2014 – David Brenner, American comedian, actor, and author (b. 1936)\n*  2014   – Bo Callaway, American soldier and politician, 11th United States Secretary of the Army (b. 1927)\n*  2014   – Clarissa Dickson Wright, English chef, author, and television personality (b. 1947)\n*  2014   – Everett L. Fullam, American priest and scholar (b. 1930)\n*  2014   – Cees Veerman, Dutch singer-songwriter and guitarist (b. 1943)\n*2015 – Robert Clatworthy, English sculptor and educator (b. 1928)\n*  2015   – Narayan Desai, Indian author and activist (b. 1924)\n*  2015   – Sally Forrest, American actress and dancer (b. 1928)\n*  2015   – Curtis Gans, American political scientist and author (b. 1937)\n*2016 – Sylvia Anderson, English voice actress and producer (b. 1927)\n*  2016   – Asa Briggs, English historian and academic (b. 1921)\n*  2016   – Seru Rabeni, Fijian rugby player (b. 1978)\n\nHolidays and observances\n\n* Christian feast day:\n** Clemens Maria Hofbauer\n** Leocritia\n** Longinus\n** Louise de Marillac\n** Raymond of Fitero\n** March 15 (Eastern Orthodox liturgics)\n* Constitution Day (Belarus)\n* Earliest day on which Palm Sunday can fall, while April 18 is the latest; celebrated on the sixth Sunday of Lent (Christianity)\n* Hōnen Matsuri (Japan)\n* International Day Against Police Brutality \n* J. J. Roberts' Birthday (Liberia)\n* National Day, celebrating the Hungarian Revolution of 1848 (Hungary)\n* World Consumer Rights Day \n* World Contact Day\n* World Day of Muslim Culture, Peace, Dialogue and Film \n* Youth Day (Palau)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "March 15" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19635" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In the Roman calendar, March 15 was known as the Ides of March.\n\nEvents\n\n*474 BC – Roman consul Gnaeus Manlius Vulso celebrates an ovation for concluding the war against Veii and securing a forty years' truce. \n*44 BC – Julius Caesar, Dictator of the Roman Republic, is stabbed to death by Marcus Junius Brutus, Gaius Cassius Longinus, Decimus Junius Brutus, and several other Roman senators on the Ides of March.\n* 220 – Cao Cao, Chinese warlord and penultimate Chancellor of the Han dynasty passes away.\n* 280 – Sun Hao of Eastern Wu surrenders to Sima Yan which began the Jin dynasty.\n* 351 – Constantius II elevates his cousin Gallus to Caesar, and puts him in charge of the Eastern part of the Roman Empire.\n* 493 – Odoacer, the first barbarian King of Italy after the fall of the Western Roman Empire, is slain by Theoderic the Great, king of the Ostrogoths, while the two kings were feasting together.\n* 856 – Michael III, emperor of the Byzantine Empire, overthrows the regency of his mother, empress Theodora (wife of Theophilos) with support of the Byzantine nobility.\n* 933 – After a ten-year truce, German King Henry the Fowler defeats a Hungarian army at the Battle of Riade near the Unstrut river.\n*1147 – Conquest of Santarém: The forces of Afonso I of Portugal capture Santarém.\n*1311 – Battle of Halmyros: The Catalan Company defeats Walter V, Count of Brienne to take control of the Duchy of Athens, a Crusader state in Greece.\n*1493 – Christopher Columbus returns to Spain after his first trip to the Americas.\n*1564 – Mughal Emperor Akbar abolishes \"jizya\" (per capita tax).\n*1672 – Charles II of England issues the Royal Declaration of Indulgence.\n*1781 – American Revolutionary War: Battle of Guilford Court House: Near present-day Greensboro, North Carolina, 1,900 British troops under General Charles Cornwallis defeat a mixed American force numbering 4,400 in a Pyrrhic victory.\n*1783 – In an emotional speech in Newburgh, New York, George Washington asks his officers not to support the Newburgh Conspiracy. The plea is successful and the threatened coup d'état never takes place.\n*1819 – French physicist Augustin-Jean Fresnel wins a contest at the Académie des Sciences in Paris by proving that light behaves like a wave. The Fresnel integrals, still used to calculate wave patterns, silence skeptics who had backed the particle theory of Isaac Newton.\n*1820 – Maine becomes the 23rd U.S. state.\n*1848 – A revolution breaks out in Hungary. The Habsburg rulers are compelled to meet the demands of the Reform party.\n*1864 – American Civil War: The Red River Campaign: U.S. Navy fleet arrives at Alexandria, Louisiana.\n*1874 – France and Viet Nam sign the Second Treaty of Saigon, further recognizing the full sovereignty of France over Cochinchina.\n*1875 – Archbishop of New York John McCloskey is named the first cardinal in the United States.\n*1877 – First ever official cricket test match is played: Australia vs England at the MCG Stadium, in Melbourne, Australia.\n*1888 – Start of the Anglo-Tibetan War of 1888.\n*1906 – Rolls-Royce Limited is incorporated.\n*1916 – United States President Woodrow Wilson sends 4,800 United States troops over the U.S.–Mexico border to pursue Pancho Villa.\n*1917 – Tsar Nicholas II of Russia abdicates the Russian throne ending the 304-year Romanov dynasty.\n*1921 – Talaat Pasha, former Grand Vizir of the Ottoman Empire and chief architect of the Armenian Genocide is assassinated in Berlin by a 23-year-old Armenian, Soghomon Tehlirian. \n*1922 – After Egypt gains nominal independence from the United Kingdom, Fuad I becomes King of Egypt.\n*1926 – The dictator Theodoros Pangalos is elected President of Greece without opposition.\n*1927 – The first Women's Boat Race between the University of Oxford and the University of Cambridge takes place on The Isis in Oxford.\n*1931 –  explodes off Newfoundland, killing 27 of the 147 on board.\n*1933 – Austrian Chancellor Engelbert Dollfuss keeps members of the National Council from convening, starting the Austrofascist dictatorship.\n*1939 – Carpatho-Ukraine declares itself an independent republic, but is annexed by Hungary the next day.\n*1941 – Philippine Airlines, the flag carrier of the Philippines takes its first flight between Manila (from Nielson Field) to Baguio City with a Beechcraft Model 18 making the airline the first and oldest commercial airline in Asia operating under its original name.\n*1943 – World War II: Third Battle of Kharkov: The Germans retake the city of Kharkov from the Soviet armies in bitter street fighting.\n*1945 – World War II: Soviet forces begin an offensive to push Germans from Upper Silesia.\n*1951 – Iranian oil industry is nationalized. \n*1952 – In Cilaos, Réunion, 1870 mm (73 inches) of rain falls in a 24-hour period, setting a new world record (March 15 through March 16).\n*1961 – At the 1961 Commonwealth Prime Ministers' Conference, South Africa announces that it will withdraw from the Commonwealth when the South African Constitution of 1961 comes into effect.\n*1965 – President Lyndon B. Johnson, responding to the Selma crisis, tells U.S. Congress \"We shall overcome\" while advocating the Voting Rights Act.\n*1978 – Somalia and Ethiopia signed a truce to end the Ethio-Somali War.\n*1985 – The first Internet domain name is registered (symbolics.com).\n*1986 – Collapse of Hotel New World: Thirty-three people die when the Hotel New World in Singapore collapses.\n*1990 – Mikhail Gorbachev is elected as the first President of the Soviet Union.\n*1991 – Cold War: The Treaty on the Final Settlement with Respect to Germany comes into effect, granting full sovereignty to the Federal Republic of Germany.\n*2008 – Stockpiles of obsolete ammunition explode at an ex-military ammunition depot in the village of Gërdec, Albania, killing 26 people. To date, no other tragedy has caused more deaths in post-World War II Albania. \n*2011 – Beginning of the Syrian Civil War.\n\nBirths\n\n* 270 – Saint Nicholas, Greek bishop and saint (d. 343)\n*1097 – Fujiwara no Tadamichi, Japanese noble (died 1164)\n*1275 – Margaret of England, Duchess of Brabant (d. 1333)\n*1407 – Jacob, Margrave of Baden-Baden (d. 1453)\n*1444 – Francesco Gonzaga, Catholic cardinal (d. 1483)\n*1493 – Anne de Montmorency, French captain and diplomat (d. 1567)\n*1513 – Hedwig Jagiellon, Electress of Brandenburg (d. 1573)\n*1582 – Daniel Featley, English theologian and controversialist (d. 1645)\n*  1582   – Deodat del Monte, Flemish painter and architect (d. 1644)\n*1584 – Philip, Duke of Schleswig-Holstein-Sonderburg-Glücksburg (d. 1663)\n*1591 – Alexandre de Rhodes, French missionary and lexicographer (d. 1660)\n*1611 – Jan Fyt, Flemish painter (d. 1661)\n*1638 – Shunzhi Emperor of China (d. 1661)\n*1666 – George Bähr, German architect, designed the Dresden Frauenkirche (d. 1738)\n*1754 – Archibald Menzies, Scottish surgeon and botanist (d. 1842)\n*1767 – Andrew Jackson, American general, judge, and politician, 7th President of the United States (d. 1845)\n*1779 – William Lamb, 2nd Viscount Melbourne, English politician, Prime Minister of the United Kingdom (d. 1848)\n*1791 – Charles Knight, English author and publisher (d. 1873)\n*1809 – Joseph Jenkins Roberts, American-Liberian historian and politician, 1st President of Liberia (d. 1876)\n*  1809   – Karl Josef von Hefele, German bishop and theologian (d. 1893)\n*1813 – John Snow, English physician and epidemiologist (d. 1858)\n*1818 – Mariano Álvarez, Filipino general and politician (d. 1924)\n*1821 – Johann Josef Loschmidt, Austrian physicist and chemist (d. 1895)\n*  1821   – William Milligan, Scottish theologian, author, and educator (d. 1892)\n*1824 – Jules Chevalier, French priest, founded the Missionaries of the Sacred Heart (d. 1907)\n*1830 – Paul Heyse, German author, poet, and playwright, Nobel Prize laureate (d. 1914)\n*  1830   – Élisée Reclus, French geographer and academic (d. 1905)\n*1831 – Saint Daniele Comboni, Italian missionary and saint (d. 1881)\n*1835 – John Henry Kagi, American lawyer and activist (d. 1859)\n*  1835   – Eduard Strauss, Austrian composer and conductor (d. 1916)\n*1838 – Karl Davydov, Russian cellist, composer, and conductor (d. 1889)\n*1851 – John Sebastian Little, American lawyer and politician, 21st Governor of Arkansas (d. 1916)\n*  1851   – William Mitchell Ramsay, Scottish archaeologist and scholar (d. 1939)\n*1852 – Augusta, Lady Gregory, Anglo-Irish landowner,  playwright, and translator (d. 1932)\n*1854 – Emil von Behring, German physiologist and physician, Nobel Prize laureate (d. 1917)\n*1857 – Christian Michelsen, Norwegian businessman and politician, 1st Prime Minister of Norway (d. 1925)\n*1858 – Liberty Hyde Bailey, American botanist and academic, co-founded the American Society for Horticultural Science (d. 1954)\n*1860 – Waldemar Haffkine, Russian-Swiss bacteriologist and microbiologist (d. 1930)\n*1864 – Johan Halvorsen, Norwegian violinist, composer, and conductor (Oslo Philharmonic) (d. 1935)\n*1866 – Matthew Charlton, Australian miner and politician (d. 1948)\n*  1866   – Johan Vaaler, Norwegian inventor, invented the Paper clip (d. 1910)\n*1869 – Stanisław Wojciechowski, Polish scholar and politician, 2nd President of the Republic of Poland (d. 1953)\n*1874 – Eugène Fiset, Canadian physician, general, and politician, 18th Lieutenant Governor of Quebec (d. 1951)\n*  1874   – Harold L. Ickes, American journalist and politician, 32nd United States Secretary of the Interior (d. 1952)\n*1878 – Reza Shah, Iranian king (d. 1944)\n*1886 – Wladimir Burliuk, Ukrainian-Greek painter and illustrator (d. 1917)\n*1887 – Marjorie Merriweather Post, American businesswoman and philanthropist, founded General Foods (d. 1973)\n*  1887   – Lütfi Kırdar, Turkish physician and politician, Turkish Minister of Health (d. 1961)\n*1890 – Boris Delaunay, Russian mathematician and mountaineer (d. 1980)\n*1892 – James Basevi Ord, Mexican-American colonel (d. 1938)\n*1897 – Jackson Scholz, American runner (d. 1986)\n*1900 – Gilberto Freyre, Brazilian sociologist, anthropologist, historian and writer (d. 1987)\n*1904 – George Brent, Irish-American actor (d. 1979)\n*  1904   – J. Pat O'Malley, English-American actor (d. 1985)\n*1905 – Berthold Schenk Graf von Stauffenberg, German lawyer and judge (d. 1944)\n*1907 – Zarah Leander, Swedish actress and singer (d. 1981)\n*1909 – Jaroslava Muchová Syllabová, Czech painter (d. 1986)\n*1911 – Lightnin' Hopkins, American blues singer-songwriter and guitarist (d. 1982)\n*1912 – Louis Paul Boon, Flemish journalist and author (d. 1979)\n*1913 – Macdonald Carey, American actor (d. 1994)\n*  1913   – Jack Fairman, English race car driver (d. 2002)\n*1916 – Frank Coghlan, Jr., American actor and pilot (d. 2009)\n*  1916   – Fadil Hoxha, Kosovar commander and politician, 2nd President of Kosovo (d. 2001)\n*  1916   – Harry James, American trumpet player, bandleader, and actor (d. 1983)\n*1918 – Richard Ellmann, American author and critic (d. 1987)\n*  1918   – Punch Imlach, Canadian ice hockey player, coach, and manager (d. 1987)\n*1919 – Lawrence Tierney, American actor (d. 2002)\n*1920 – E. Donnall Thomas, American physician and academic, Nobel Prize laureate (d. 2012)\n*1921 – Madelyn Pugh, American television writer and producer (d. 2011)\n*1923 – Charles Wheeler, German-English soldier and journalist (d. 2008)\n*1924 – Irina Nikolaevna Levchenko, Russian tank commander (d. 1973)\n*1926 – Ben Johnston, American composer and academic\n*  1926   – Norm Van Brocklin, American football player and coach (d. 1983)\n*1927 – Christian Marquand, French actor, director, and screenwriter (d. 2000)\n*  1927   – Carl Smith, American singer-songwriter and guitarist (d. 2010)\n*1928 – Bob Wilber, American clarinet player and saxophonist\n*1930 – Zhores Alferov, Belarusian-Russian physicist and academic, Nobel Prize laureate\n*  1930   – Martin Karplus, Austrian-American chemist and academic, Nobel Prize laureate\n*  1930   – Kostas Nestoridis, Greek footballer and manager\n*1931 – David Hayes, American sculptor and academic (d. 2013)\n*1932 – Alan Bean, American captain, pilot, and astronaut\n*  1932   – Arif Mardin, Turkish-American record producer (d. 2006)\n*1933 – Ruth Bader Ginsburg, American lawyer and judge\n*  1933   – Philippe de Broca, French actor, director, and screenwriter (d. 2004)\n*1934 – Richard Layard, Baron Layard, English economist and academic\n*  1934   – Kanshi Ram, Indian politician (d. 2006)\n*1935 – David Andrews, Irish politician, 21st Minister of Foreign Affairs for Ireland\n*  1935   – Judd Hirsch, American actor\n*  1935   – Jimmy Swaggart, American pastor and television host\n*  1935   – Leonid Yengibarov, Russian-Armenian clown and boxer (d. 1972)\n*1936 – Howard Greenfield, American songwriter (d. 1986)\n*1937 – Marcus Raichle, American neurologist and physiologist\n*  1937   – Valentin Rasputin, Russian environmentalist and author (d. 2015)\n*1938 – Charles Lloyd, American saxophonist and flute player\n*1939 – Ted Kaufman, American engineer and politician\n*  1939   – Robert Nye, English author, poet, and playwright (d. 2016)\n*1940 – Frank Dobson, English politician, Secretary of State for Health\n*1941 – Mike Love, American singer-songwriter and musician\n*1943 – David Cronenberg, Canadian actor, director, and screenwriter\n*  1943   – Lynda La Plante, English actress, screenwriter, and author\n*  1943   – Michael Scott-Joynt, English bishop (d. 2014)\n*  1943   – Sly Stone, American singer-songwriter, musician, and producer\n*1944 – Chi Cheng, Taiwanese runner and politician\n*  1944   – Jacques Doillon, French director and screenwriter\n*  1944   – Francis Mankiewicz, Canadian director, producer, and screenwriter (d. 1993)\n*1945 – A. K. Faezul Huq, Bangladeshi lawyer and politician (d. 2007)\n*  1945   – Mark J. Green, American lawyer and politician\n*1946 – Bobby Bonds, American baseball player and coach (d. 2003)\n*  1946   – Howard E. Scott, American funk/rock guitarist and songwriter \n*1948 – Kate Bornstein, American author and activist\n*  1948   – Sérgio Vieira de Mello, Brazilian diplomat (d. 2003)\n*1950 – Jørgen Olsen, Danish singer-songwriter\n*  1950   – Kurt Koch, Swiss cardinal\n*1951 – David Alton, Baron Alton of Liverpool, English educator and politician\n*1952 – Howard Devoto, English singer-songwriter \n*  1952   – Philip Green, English businessman\n*  1952   – Howard Koh, American physician and politician, 14th United States Assistant Secretary for Health\n*1953 – Richard Bruton, Irish economist and politician, Minister for Jobs, Enterprise and Innovation\n*  1953   – Heather Graham Pozzessere, American author\n*  1953   – Kumba Ialá, Bissau-Guinean educator and politician, President of Guinea-Bissau (d. 2014)\n*1954 – Massimo Bubola, Italian singer-songwriter, guitarist, and producer\n*  1954   – Isobel Buchanan, Scottish soprano and actress\n*  1954   – Bob Budiansky, American author and illustrator\n*  1954   – Henry Marsh, American runner and businessman, co-founded MonaVie\n*1955 – Mohsin Khan, Pakistani cricketer\n*  1955   – Dee Snider, American singer-songwriter and actor \n*1956 – Clay Matthews, Jr., American football player and coach\n*1957 – Joaquim de Almeida, Portuguese-American actor\n*  1957   – Víctor Muñoz, Spanish footballer and manager\n*  1957   – David Silverman, American animator, director, and screenwriter\n*1958 – Anne Davies, English television presenter and newsreader\n*1959 – Harold Baines, American baseball player and coach\n*  1959   – Renny Harlin, Finnish director and producer\n*  1959   – Lisa Holton, American journalist and author\n*1960 – Mike Pagliarulo, American baseball player and coach\n*  1960   – Phil Walsh, Australian rules footballer and coach (d. 2015)\n*1961 – Terry Cummings, American basketball player and singer\n*  1961   – Craig Ludwig, American ice hockey player and coach\n*1962 – Terence Trent D'Arby, American singer-songwriter\n*1963 – Bret Michaels, American singer-songwriter, guitarist, and actor \n*1964 – Davide Pinato, Italian footballer\n*  1964   – Rockwell, American singer-songwriter and musician\n*1965 – Sunetra Gupta, Indian epidemiologist, author, and academic\n*  1965   – Robyn Malcolm, New Zealand actress\n*1968 – Mark McGrath, American singer-songwriter and television host \n*  1968   – Terje Riis-Johansen, Norwegian politician, Norwegian Minister of Petroleum and Energy\n*  1968   – Sabrina Salerno, Italian singer-songwriter\n*1969 – Rona Ambrose, Canadian journalist and politician, 8th Canadian Minister of Health\n*  1969   – Gianluca Festa, Italian footballer and coach\n*  1969   – Kim Raver, American actress\n*1970 – Christine Anu, Australian singer\n*  1970   – Naka Drotske, South African rugby player \n*  1970   – Derek Parra, American speed skater and coach\n*1971 – Penny Lancaster, English model and photographer\n*  1971   – Joanne Wise, English long jumper\n*1972 – Mark Hoppus, American singer-songwriter, bass player, and producer \n*  1972   – Mike Tomlin, American football player and coach\n*1973 – Robin Hunicke, American video game designer and producer\n*  1973   – Lee Jung-jae, South Korean model and actor\n*  1973   – Masayuki Naruse, Japanese wrestler and mixed martial artist\n*1974 – Robert Fick, American baseball player\n*1975 – will.i.am, American rapper, producer, and actor \n*  1975   – Eva Longoria, American actress and producer\n*  1975   – Veselin Topalov, Bulgarian chess player\n*  1975   – Darcy Tucker, Canadian ice hockey player\n*1976 – Katherine Brooks, American director, producer, and screenwriter\n*1977 – Joe Hahn, American DJ, producer, and director (Linkin Park)\n*  1977   – Brian Tee, Japanese-American actor, producer, and screenwriter\n*1979 – Kyle Mills, New Zealand cricketer\n*  1979   – Kevin Youkilis, American baseball player and scout\n*1980 – Freddie Bynum, American baseball player\n*  1980   – Eric Grothe, Jr. Australian rugby league player and guitarist\n*  1980   – Claudiney Ramos, Brazilian footballer (d. 2013)\n*1981 – Young Buck, American rapper, producer, and actor \n*  1981   – Mikael Forssell, German-Finnish footballer\n*  1981   – Veronica Maggio, Swedish singer-songwriter\n*1982 – Emily Dunn, American actress and dancer\n*  1982   – Wilson Kipsang Kiprotich, Kenyan runner\n*1983 – Umut Bulut, Turkish footballer\n*  1983   – Ben Hilfenhaus, Australian cricketer\n*  1983   – Kostas Kaimakoglou, Greek basketball player\n*  1983   – Daryl Murphy, Irish footballer\n*1984 – Olivier Jean, Canadian speed skater\n*  1984   – Wilson Aparecido Xavier Júnior, Brazilian footballer\n*  1984   – Kostas Vasileiadis, Greek basketball player\n* 1984    – Malin Buska, Swedish actress\n*1985 – Antti Autti, Finnish snowboarder\n*  1985   – Tom Chilton, English race car driver\n*  1985   – Curtis Davies, English footballer\n*  1985   – Javier Garrido, Spanish footballer\n*  1985   – Jon Jay, American baseball player\n*  1985   – Kellan Lutz, American model and actor\n*1987 – Eric Decker, American football player\n*1988 – Éver Guzmán, Mexican footballer\n*  1988   – James Reimer, Canadian ice hockey player\n*  1988   – Jolo Revilla, Filipino actor and politician\n*  1988   – Alexander Sims, English race car driver\n*1989 – Sam Baldock, English footballer\n*  1989   – Bryce Gibbs, Australian footballer\n*  1989   – Sandro Raniere, Brazilian footballer\n*  1989   – Adrien Silva, Portuguese footballer\n*1990 – Siobhan Magnus, American singer-songwriter\n*1991 – Tavon Austin, American football player\n*  1991   – Kurt Baptiste, Australian rugby league player\n*  1991   – Xavier Henry, American basketball player\n*  1991   – Kevin Müller, German footballer\n*  1991   – Naren Weiss, American actor and playwright \n*1993 – Alia Bhatt, British actress and singer\n*  1993   – Michael Fulmer, American baseball player\n*  1993   – Paul Pogba, French footballer\n*  1993   – Alyssa Reid, Canadian singer-songwriter and guitarist\n*  1993   – Mark Scheifele, Canadian ice hockey player\n*2000 – Kristian Kostov, Russian/Bulgarian singer-songwriter\n\nDeaths\n\n* 44 BC – Julius Caesar, Roman general and statesman (b. 100 BC)\n* 220 – Cao Cao, Chinese general, warlord and statesman (b. 155)\n* 493 – Odoacer, first king of Italy after the fall of the Western Roman Empire (b. 433)\n* 752 – Pope Zachary\n* 963 – Romanos II, Byzantine emperor (b. 938)\n*1086 – Richilde, Countess of Hainaut, Flemish consort and regent (b. c. 1018) \n*1124 – Ernulf, Bishop of Rochester (b. c. 1040)\n*1190 – Isabella of Hainault, queen of Philip II of France (b. 1170)\n*1311 – Walter V, Count of Brienne (b. 1275)\n*  1311   – Thomas III d'Autremencourt, Lord of Salona, Marshal of Achaea\n*  1311   – Albert Pallavicini, Margrave of Bodonitza\n*  1311   – George I Ghisi, Triarch of Euboea, Baron of Chalandritsa, Lord of Tinos, Mykonos, Serifos and Keos\n*1327 – Albert of Schwarzburg\n*1536 – Pargalı Ibrahim Pasha, Ottoman politician, 35th Grand Vizier of the Ottoman Empire (b. 1493)\n*1644 – Countess Louise Juliana of Nassau (b. 1576)\n*1657 – David Pardo, Dutch rabbi and scholar (b. 1591)\n*1673 – Salvator Rosa, Italian painter and poet (b. 1615)\n*1711 – Eusebio Kino, Italian priest and missionary (b. 1645)\n*1820 – Clement Mary Hofbauer, Austrian priest and saint (b. 1751)\n*1842 – Luigi Cherubini, Italian composer and theorist (b. 1760)\n*1849 – Giuseppe Caspar Mezzofanti, Italian cardinal and linguist (b. 1774)\n*1891 – Joseph Bazalgette, English engineer and academic (b. 1819)\n*1897 – James Joseph Sylvester, English mathematician and academic (b. 1814)\n*1898 – Henry Bessemer, English engineer and businessman (b. 1813)\n*1921 – Talaat Pasha, Ottoman politician, 281st Grand Vizier of the Ottoman Empire (b. 1874)\n*1933 – Gustavo Jiménez, Peruvian colonel and politician, 73rd President of Peru (b. 1886)\n*1937 – H. P. Lovecraft, American short story writer, editor, and novelist (b. 1890)\n*1938 – Nikolai Bukharin, Russian journalist and politician (b. 1888)\n*1939 – Luis Barceló, Spanish colonel (b. 1896)\n*1941 – Alexej von Jawlensky, Russian-German painter (b. 1864)\n*1944 – Otto von Below, Prussian general (b. 1857)\n*1951 – John S. Paraskevopoulos, Greek-South African astronomer and academic (b. 1889)\n*1959 – Lester Young, American saxophonist and clarinet player (b. 1909)\n*1962 – Arthur Compton, American physicist and academic, Nobel Prize laureate (b. 1892)\n*1966 – Abe Saperstein, American basketball player and coach (b. 1902)\n*1969 – Miles Malleson, English actor and screenwriter (b. 1888)\n*  1969   – Musashiyama Takeshi, Japanese sumo wrestler, the 33rd Yokozuna (b. 1909)\n*1970 – Tarjei Vesaas, Norwegian author and poet (b. 1897)\n*1971 – Jean-Pierre Monseré, Belgian cyclist (b. 1948)\n*1972 – Aleksandr Ivanovich Laktionov, Russian painter and educator (b. 1910)\n*1975 – Aristotle Onassis, Greek-Argentinian businessman (b. 1900)\n*1981 – René Clair, French director and screenwriter (b. 1898)\n*1983 – Coloman Braun-Bogdan, Romanian footballer and manager (b. 1905)\n*  1983   – Rebecca West, English author and critic (b. 1892)\n*1985 – Radha Krishna Choudhary, Indian historian and author (b. 1921)\n*1987 – Douglas Abbott, Canadian lawyer and politician, 10th Canadian Minister of National Defence (b. 1899)\n*1988 – Dmitri Polyakov, Ukrainian general and spy (b. 1926)\n*1989 – Muhammad Jameel Didi, Maldivian poet and politician (b. 1915)\n*1990 – Farzad Bazoft, Iranian-English journalist (b. 1958)\n*  1990   – Tom Harmon, American football player and sportscaster (b. 1919)\n*1991 – Bud Freeman, American saxophonist, composer, and bandleader (b. 1906)\n*1997 – Gail Davis, American actress (b. 1925)\n*  1997   – Victor Vasarely, Hungarian-French painter (b. 1906)\n*1998 – Benjamin Spock, American pediatrician and author (b. 1903)\n*1999 – Guy D'Artois, Canadian soldier (b. 1917)\n*2001 – Gaetano Cozzi, Italian historian and academic (b. 1922)\n*  2001   – Ann Sothern, American actress and singer (b. 1909)\n*2003 – Thora Hird, English actress (b. 1911)\n*2004 – Bill Pickering, New Zealand-American scientist and engineer (b. 1910)\n*  2004   – John Pople, English-American chemist and academic, Nobel Prize laureate (b. 1925)\n*2005 – Bob Bellear, Australian engineer and judge (b. 1944)\n*  2005   – Otar Korkia, Georgian basketball player and coach (b. 1923)\n*2006 – Georgios Rallis, Greek lieutenant and politician, 173rd Prime Minister of Greece (b. 1918)\n*  2006   – Red Storey, Canadian football player and referee (b. 1918)\n*2007 – Bowie Kuhn, American lawyer and businessman (b. 1926)\n*  2007   – Stuart Rosenberg, American director and producer (b. 1927)\n*2008 – Mikey Dread, Jamaican singer-songwriter and producer (b. 1954)\n*  2008   – Vytautas Kernagis, Lithuanian singer-songwriter and actor (b. 1951)\n*  2008   – G. David Low, American astronaut and engineer (b. 1956)\n*2009 – Ron Silver, American actor, director, and producer (b. 1946)\n*2011 – Nate Dogg, American rapper (b. 1969)\n*2012 – Mervyn Davies, Welsh rugby player (b. 1946)\n*  2012   – Eb Gaines, American businessman and diplomat (b. 1927)\n*  2012   – Bernardino González Ruíz, Panamanian physician and politician, President of Panama (b. 1911)\n*  2012   – Fran Matera, American illustrator (b. 1924)\n*  2012   – Dave Philley, American baseball player and manager (b. 1920)\n*2013 – James Bonk, American chemist and academic (b. 1931)\n*  2013   – Booth Gardner, American businessman and politician, 19th Governor of Washington (b. 1936)\n*  2013   – Hardrock Gunter, American singer-songwriter and guitarist (b. 1925)\n*  2013   – Shannon Larratt, Canadian publisher, founded BMEzine (b. 1973)\n*  2013   – Masamichi Noro, Japanese-French martial artist, founded Kinomichi (b. 1935)\n*  2013   – Kallam Anji Reddy, Indian engineer and businessman, founded Dr. Reddy's Laboratories (b. 1940)\n*2014 – David Brenner, American comedian, actor, and author (b. 1936)\n*  2014   – Bo Callaway, American soldier and politician, 11th United States Secretary of the Army (b. 1927)\n*  2014   – Clarissa Dickson Wright, English chef, author, and television personality (b. 1947)\n*  2014   – Everett L. Fullam, American priest and scholar (b. 1930)\n*  2014   – Cees Veerman, Dutch singer-songwriter and guitarist (b. 1943)\n*2015 – Robert Clatworthy, English sculptor and educator (b. 1928)\n*  2015   – Narayan Desai, Indian author and activist (b. 1924)\n*  2015   – Sally Forrest, American actress and dancer (b. 1928)\n*  2015   – Curtis Gans, American political scientist and author (b. 1937)\n*2016 – Sylvia Anderson, English voice actress and producer (b. 1927)\n*  2016   – Asa Briggs, English historian and academic (b. 1921)\n*  2016   – Seru Rabeni, Fijian rugby player (b. 1978)\n\nHolidays and observances\n\n* Christian feast day:\n** Clemens Maria Hofbauer\n** Leocritia\n** Longinus\n** Louise de Marillac\n** Raymond of Fitero\n** March 15 (Eastern Orthodox liturgics)\n* Constitution Day (Belarus)\n* Earliest day on which Palm Sunday can fall, while April 18 is the latest; celebrated on the sixth Sunday of Lent (Christianity)\n* Hōnen Matsuri (Japan)\n* International Day Against Police Brutality \n* J. J. Roberts' Birthday (Liberia)\n* National Day, celebrating the Hungarian Revolution of 1848 (Hungary)\n* World Consumer Rights Day \n* World Contact Day\n* World Day of Muslim Culture, Peace, Dialogue and Film \n* Youth Day (Palau). March 15. http://en.wikipedia.org/?curid=19635."
  }
}
