{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10193",
  "eid" : "f4635640-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778489764,
  "textBody" : "Enter the Dragon is a 1973 Hong Kong-American martial arts action film, directed by Robert Clouse, and starring Bruce Lee, John Saxon, and Jim Kelly.  This was Bruce Lee's final film appearance before his death on 20 July 1973 at age 32. The film was first released on 26 July 1973 in Hong Kong, six days after Lee's death.\n\nOften considered one of the greatest martial arts films of all time, in 2004 the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".\n\nPlot\n\nLee (Bruce Lee), a highly skilled Shaolin martial artist from Hong Kong, is approached by Braithwaite, a British intelligence agent investigating suspected crime lord Han (Shih Kien).  Lee is persuaded to attend a high-profile martial arts competition on Han's private island in order to gather evidence that will prove Han's involvement in drug trafficking and prostitution. Shortly before his departure, Lee also learns that his sister's killer, O'Hara (Robert Wall), is working as Han's bodyguard on the island.  Also fighting in the competition are indebted gambling addict Roper (John Saxon) and fellow Vietnam war veteran Williams (Jim Kelly). \n\nAt the end of the first day, Han gives strict orders to the competitors not to leave their rooms. Lee makes contact with undercover operative Mei Ling (Betty Chung), and sneaks into Han's compound looking for evidence. He is discovered by several guards, but manages to escape. The next morning, Han has the guards publicly killed by chief guard Bolo (Bolo Yeung) for failing him.  After the execution, Lee faces O'Hara in the competition and after an emotional battle ends up killing him.  With the day's competition over, Han confronts Williams – who had also left his room the previous night to exercise – initially thinking him the intruder, and beats him to death when he refuses to cooperate. Han then reveals the scale of his drug operation to Roper in the hope that he will join his organization. He also implicitly threatens to imprison Roper, along with all the other martial artists who competed in Han's tournament in the past, if Roper refuses. Despite being initially intrigued, Roper refuses after learning of Williams' fate.\n\nLee sneaks out again that night and manages to send a message to Braithwaite, but is finally captured after a protracted battle with the guards. The next morning Han arranges for Roper to fight Lee, but Roper refuses. As punishment, he is forced to fight Bolo instead but manages to overpower and kill him after a grueling encounter.  Enraged by the unexpected victory, Han commands his remaining men to kill Lee and Roper. Facing insurmountable odds, they are soon aided by the island's prisoners, who had been freed by Mei Ling. Han escapes, pursued by Lee, who finally corners him in a hidden mirror room. The mirrors give Han an advantage, but Lee breaks all the room's mirrors to reveal Han's location, and eventually kills him. Lee returns to the main battle, which is now over. A bruised and bloodied Roper sits victorious while the military finally arrive to take control of the island.\n\nCast\n\n* Bruce Lee as Lee\n* John Saxon as Roper\n* Jim Kelly as Williams\n* Ahna Capri as Tania\n* Shih Kien as Han (voice dubbed by Keye Luke)\n* Robert Wall as O'Hara (as Bob Wall)\n* Angela Mao as Su Lin, Lee's sister (as Angela Mao Ying) \n* Betty Chung as Mei Ling\n* Geoffrey Weeks as Braithwaite\n* Bolo Yeung as Bolo (as Yang Sze)\n* Peter Archer as Parsons\n* Ho Lee Yan as Old Man \n* Marlene Clark as Secretary\n* Allan Kent as Golfer\n* William Keller as L.A. Cop\n* Mickey Caruso as L.A. Cop\n* Pat E. Johnson as Hood\n* Darnell Garcia as Hood\n* Mike Bissell as Hood\n* Jackie Chan as Han's henchman\n* Sammo Hung as Shaolin fighter\n* Roy Chiao as Shaolin Abbott\n* Paul Heller as Radio Operator\n* Lam Ching Ying\n* Tony Liu as Tournament fighter\n* Alan Chui Chung-San as Tournament fighter\n* Yuen Biao as Tournament fighter\n* Yuen Wah as Tournament fighter\n* Hidy Ochiai\n* Wei Tung as Lao\n* Tadashi Yamashita\n* Mars as Guard\n* Mang Hoi as Ship's mate\n\nHistorical themes \n\nDecolonization \n\nThe end of World War II set decolonization into motion around the world. Many territories formed new states and claimed independence from European rule, attempting to put an end to colonialism. During colonialism, Asia, as well as other countries across the globe, were exploited for their labor and raw materials. In some instances, the inhabitants of these lands were treated brutally and divided up by the European power. After retaliation, Europe lost most of its territories or let them slip away, and the newly independent nations came to fruition in the 1950s and 1960s.\n\nMany historians and film critics have explored the connection between martial arts films and decolonization. Many believe that decolonization was a major theme in many martial arts movies, as the \"kung fu craze\" started booming only a few decades after independence had been won. Some say it was the foundation of the films. Others argue that it was actually Bruce Lee who \"opened up an allegorical link with the mass movement toward decolonization\". The theory is that when analyzing a martial arts film in the context of decolonization, the fight scenes represent the conflict between imperialism and the popular resistance. The antagonist, Han, is the imperialist, while the hero, Bruce Lee, is the revolutionary. Most of these Kung Fu films end with the defeat of villain against all odds, which represents liberation. So, these films are meant to offer their audience a powerful narrative of liberation.\n\nContext \n\nBlaxploitation and martial arts \n\nThe film was arguably the first to combine martial arts films with the Blaxploitation genre. Jim Kelly is thought to have portrayed the first Blaxploitation character that appeared in a martial arts movie. He would later go on to be one of the Blaxploitation genre's biggest stars. The success of the film, and the large black audience it attracted, caused other films to start incorporating these Blaxploitation characters more and more. Thus, the mingling of the genres was created.\n\nMarketing \n\nThe film was heavily advertised in the United States before its release. The budget for advertising was over $1,000,000. It was unlike any promotional campaign that had been seen before, and was extremely comprehensive. In order to advertise the film, the studio offered free Karate classes, produced thousands of illustrated flip books, comic books, posters, photographs, and organized dozens of news releases, interviews, and public appearances for the stars. Esquire, The Wall Street Journal, Time, and Newsweek all wrote stories on the film.\n\nSoundtrack \n\nThe soundtrack to the film was composed by Lalo Schifrin, who was also the composer for Mission: Impossible. He composed the score by sampling sounds from China, Korea, and Japan. The soundtrack was a huge success as well, selling over 500,000 copies. It earned a gold record.\n\nProduction \n\nThe scene in which Lee states that his style was the style of \"Fighting Without Fighting\" and then lures Parsons into boarding a dinghy is based upon a famous anecdote involving the 16th century samurai Tsukahara Bokuden.\n\nJackie Chan appears as a guard during the underground lair battle scene and gets his neck snapped by Lee. He also performed several stunts for the film, including the scene where Lee's character quickly climbs a rooftop at night. However, Yuen Wah was Lee's main stunt double for the film.\n\nSammo Hung appears in the movie in a brief fight scene against Lee during the opening of the film.\n\nThe title of the screenplay was originally Blood and Steel.\n\nEnter The Dragon was filmed without sound. All of the dialogue and effects were dubbed in during post-production.\n\nMusic\n\nArgentinian musician Lalo Schifrin composed the film's musical score. While Schifrin was widely known at the time for his jazz scores, he also incorporated funk and traditional film score elements into the film's soundtrack.\n\nReception\n\nBox office\n\nIn 1973, Enter the Dragon grossed an estimated $21,483,063 in North America, on a tight budget of $850,000.Variety says the film earned $4.25 million in North American rentals in 1973. See \"Big Rental Films of 1973\", Variety, 9 January 1974 p 19  It was one of the most successful films of 1973.\n\nIn Hong Kong, the film grossed HK$3,307,536—huge business for the time, but substantially less than Lee's Fist of Fury and Way of the Dragon. In India, the movie opened to full houses.\n\nWorldwide, the film grossed $90 million,https://editorial.rottentomatoes.com/article/bruce-lees-enter-the-dragon-to-be-remade/ including $65 million outside of the United States.http://www.worldwideboxoffice.com/movie.cgi?title\nEnter%20the%20Dragon&year=1973\n\nCritical response\n\nThe film was well received by critics and is regarded by many as one of the best films of 1973. Critics have referred to Enter the Dragon as \"a low-rent James Bond thriller\",[http://movies.tvguide.com/enter-the-dragon/review/113986 Enter the Dragon, TV Guide Movie Review.] TV Guide. Retrieved 28 September 2012.The Fourth Virgin Film Guide by James Pallot and the editors of Cinebooks, published by Virgin Books, 1995 a \"remake of Dr. No\" with elements of Fu Manchu.Hong Kong Action Cinema by Bey Logan, published by Titan Books, 1995 J.C. Maçek III of PopMatters wrote, \"Of course the real showcase here is the obvious star here, Bruce Lee, whose performance as an actor and a fighter are the most enhanced by the perfect sound and video transfer. While Kelly was a famous martial artist and a surprisingly good actor and Saxon was a famous actor and a surprisingly good martial artist, Lee proves to be a master of both fields.\"\n\nMany additional acclaimed newspapers and magazines reviewed the film as well. Variety complimented multiple aspects of the film, claiming that film was overall \"rich in the atmosphere\", the music score was \"a strong asset\" and the photography as interesting. Additionally, The New York Times gave the film a rave review. The review stated \"The picture is expertly made and well-meshed; it moves like lightning and brims with color. It is also the most savagely murderous and numbing hand-hacker (not a gun in it) you will ever see anywhere.\"\n\nThe film currently holds a 95% approval rating on the review aggregate website Rotten Tomatoes, with 43 reviews counted and an average rating of 7.8/10. In 2004, the film was deemed \"culturally significant\" by the Library of Congress and selected for preservation in the National Film Registry.\n\nThe film also ranks No. 474 on Empire magazine's 2008 list of The 500 Greatest Movies of All Time.\n\nLegacy\n\nThe film has been parodied and referenced in places such as the 1976 film The Pink Panther Strikes Again, the satirical publication The Onion, the Japanese game-show Takeshi's Castle, and the 1977 John Landis comedy anthology film Kentucky Fried Movie (in its lengthy \"A Fistful of Yen\" sequence, basically a comedic, note for note remake of Dragon) and also in the film Balls of Fury. It was also parodied on television in That '70s Show during the episode \"Jackie Moves On\" with regular character Fez taking on the Bruce Lee role. Several clips from the film are comically used during the theatre scene in The Last Dragon.\n\nIn August 2007, the now defunct Warner Independent Pictures announced that television producer Kurt Sutter would be remaking the film as a noir-style thriller entitled Awaken the Dragon with Korean singer-actor Rain starring. It was announced in September 2014 that Spike Lee will work on the remake. In March 2015, Brett Ratner revealed that he wanted to make the remake.\n\nThe little-known 1985 Nintendo arcade game  Arm Wrestling contain voice leftovers from the film, as well as their original counterparts.\n\nThe popular video game Mortal Kombat borrows multiple plot elements from Enter The Dragon.\n\nThe popular 1980s martial arts video game Double Dragon features two enemies named Roper and Williams, a reference to the two characters Roper and Williams from Enter The Dragon.\n\nHome video releases\n\nDVD\n\nUniverse (Hong Kong)\n* Aspect ratio: Widescreen (2:35:1) letterboxed\n* Sound: Cantonese (Dolby Digital 5.1), Mandarin (Dolby Digital 5.1)\n* Subtitles: Traditional, Simplified Chinese, English, Japanese, Korean, Indonesian, Malaysian, Thai, Vietnamese\n* Supplements: Trailer, trailers for Way of the Dragon, The Big Boss, Game of Death, Legacy of Rage, star files\n* All regions, NTSC\n\nFortune Star – Bruce Lee Ultimate DVD Collection (Hong Kong)\n* Aspect ratio: Widescreen (2:35:1) anamorphic\n* Sound: Cantonese (DTS 5.1), Cantonese (Dolby Digital 5.1), Cantonese (Dolby Digital 2.0 Mono), Mandarin (DTS 5.1), Mandarin (Dolby Digital 5.1)\n* Subtitles: Traditional, Simplified Chinese, English\n* Supplements: Original trailer, new trailer, still photos, slideshow of photos, celebrity interviews, unseen footage, Game of Death outtakes, Enter the Dragon alternate opening, 32-page booklet\n* Region 3, NTSC\n\nZoke Culture (China)\n* Aspect ratio: Widescreen (2:40:1) anamorphic\n* Sound: English (DTS 5.1), English (Dolby Digital 5.1), Cantonese (Dolby Digital 2.0 Stereo), Mandarin (Dolby Digital 2.0 Stereo)\n* Subtitles: Traditional, Simplified Chinese, English, Japanese, Korean, Spanish, Portuguese, Indonesian, French\n* Supplements: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, \"Blood and Steel: Making of Enter the Dragon\", \"Bruce Lee: In His Own Words\", Linda Lee Cadwell interview gallery, \"original\" 1973 making-of featurette, \"Backyard Workout with Bruce Lee\"\n* All regions, NTSC\n\nWarner – 30th Anniversary Special Edition (America)\n* Aspect ratio: Widescreen (2:35:1) anamorphic\n* Sound: English (Dolby Digital 5.1), English (Dolby Digital 2.0 Mono)\n* Subtitles: English, Spanish, French\n* Supplements: Disc 1: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, \"Blood and Steel: Making of Enter the Dragon\", \"Bruce Lee: In His Own Words\", Linda Lee Cadwell interview gallery, \"Location: Hong Kong with Enter the Dragon\" original 1973 documentary, \"Backyard Workout With Bruce Lee\" Disc 2: \"Curse of the Dragon\" feature-length documentary, \"Bruce Lee: A Warrior's Journey\" feature-length documentary, theatrical trailers, TV spots\n* Region 1, NTSC\n\nWarner – 25th Anniversary Special Edition (America)\n* Aspect ratio: Widescreen (2:35:1) anamorphic\n* Sound: English (Dolby Digital 5.1)\n* Subtitles: English, Spanish, French\n* Supplements: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, Isolated music score, an all-new introduction and interview with Linda Lee Cadwell, \"Location: Hong Kong with Enter the Dragon\" original 1973 documentary, \"Backyard Workout with Bruce\", \"Bruce Lee In His Own Words\", theatrical trailers, TV spots, cast and crew biographies, \"Significance of Belts in Martial Arts\" notes, \"Heir to the Throne\" – Jackie Chan notes, retrospective of Hong Kong martial arts films notes and stills, behind-the-scenes notes, reel recommendations – 16 movies\n* Region 1, NTSC\n\nWarner – Limited Edition (United Kingdom)\n* Aspect ratio: Widescreen (2:35:1) anamorphic\n* Sound: English (Dolby Digital 5.1)\n* Subtitles: English\n* Supplements: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, isolated music score, an all-new introduction and interview with Linda Lee Cadwell, \"Location: Hong Kong with Enter the Dragon\" original 1973 documentary, \"Backyard Workout with Bruce\", \"Bruce Lee: In His Own Words\", theatrical trailers, TV spots, cast and crew biographies, 10 exclusive Enter the Dragon postcards, 8 reproductions of original lobby cards, reproduction of the original press brochure\n* Region 2, PAL\n\nBlu-ray\n\nKam & Ronson (Hong Kong)\n* Aspect ratio: Widescreen (2:35:1)\n* Sound: Cantonese (DTS-HD Master Audio 7.1), Cantonese (Dolby True HD 7.1), Mandarin (Dolby Digital EX 6.1), Thai (Dolby Digital EX 6.1)\n* Subtitles: Traditional Chinese, English, Thai\n* Supplements: \"Alternate opening credits\", trailer, photo gallery\n* Region A\n\nWarner (North America and South America)\n* Aspect ratio: Widescreen (2:40:1)\n* Sound: English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 1.0 Mono), Portuguese (Dolby Digital 1.0 Mono)\n* Subtitles: English, Spanish, French, Portuguese\n* Supplements: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, \"Blood and Steel: Making of Enter the Dragon\", \"Bruce Lee: In His Own Words\", Linda Lee Cadwell interview gallery, \"Location: Hong Kong with Enter the Dragon\" original 1973 documentary, \"Backyard Workout with Bruce Lee\", \"Curse of the Dragon\" feature-length documentary, \"Bruce Lee: A Warrior's Journey\" feature-length documentary, theatrical trailers, TV spots\n* All regions\n\nWarner (40th Anniversary Edition – Remastered)\n* Aspect ratio: Widescreen (2:40:1)\n* Sound: English (DTS-HD Master Audio 5.1), French (Dolby Digital Mono), German (Dolby Digital Mono), Italian (Dolby Digital Mono), Japanese (Dolby Digital Mono), Japanese (Dolby Digital 2.0), Spanish (Dolby Digital Mono), Spanish (Dolby Digital 2.0), Polish (Dolby Digital 2.0), Russian (Dolby Digital 5.1)\n* Subtitles: English, Spanish, French, Portuguese, Japanese, German, Italian, Greek, Korean, Polish, Romanian, Russian, Serbian, Turkish\n* Supplements: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, \"No Way As Way\", \"Wing Chun\", \"Return to Han's Island\", \"Blood and Steel: Making of Enter the Dragon\", \"Bruce Lee: In His Own Words\", Linda Lee Cadwell interview gallery, \"Location: Hong Kong with Enter the Dragon\" original 1973 documentary, \"Backyard Workout with Bruce Lee\", \"Curse of the Dragon\" feature-length documentary, theatrical trailers, TV spots\n* All regions",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Enter the Dragon" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10193" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Enter the Dragon is a 1973 Hong Kong-American martial arts action film, directed by Robert Clouse, and starring Bruce Lee, John Saxon, and Jim Kelly.  This was Bruce Lee's final film appearance before his death on 20 July 1973 at age 32. The film was first released on 26 July 1973 in Hong Kong, six days after Lee's death.\n\nOften considered one of the greatest martial arts films of all time, in 2004 the film was selected for preservation in the United States National Film Registry by the Library of Congress as being \"culturally, historically, or aesthetically significant\".\n\nPlot\n\nLee (Bruce Lee), a highly skilled Shaolin martial artist from Hong Kong, is approached by Braithwaite, a British intelligence agent investigating suspected crime lord Han (Shih Kien).  Lee is persuaded to attend a high-profile martial arts competition on Han's private island in order to gather evidence that will prove Han's involvement in drug trafficking and prostitution. Shortly before his departure, Lee also learns that his sister's killer, O'Hara (Robert Wall), is working as Han's bodyguard on the island.  Also fighting in the competition are indebted gambling addict Roper (John Saxon) and fellow Vietnam war veteran Williams (Jim Kelly). \n\nAt the end of the first day, Han gives strict orders to the competitors not to leave their rooms. Lee makes contact with undercover operative Mei Ling (Betty Chung), and sneaks into Han's compound looking for evidence. He is discovered by several guards, but manages to escape. The next morning, Han has the guards publicly killed by chief guard Bolo (Bolo Yeung) for failing him.  After the execution, Lee faces O'Hara in the competition and after an emotional battle ends up killing him.  With the day's competition over, Han confronts Williams – who had also left his room the previous night to exercise – initially thinking him the intruder, and beats him to death when he refuses to cooperate. Han then reveals the scale of his drug operation to Roper in the hope that he will join his organization. He also implicitly threatens to imprison Roper, along with all the other martial artists who competed in Han's tournament in the past, if Roper refuses. Despite being initially intrigued, Roper refuses after learning of Williams' fate.\n\nLee sneaks out again that night and manages to send a message to Braithwaite, but is finally captured after a protracted battle with the guards. The next morning Han arranges for Roper to fight Lee, but Roper refuses. As punishment, he is forced to fight Bolo instead but manages to overpower and kill him after a grueling encounter.  Enraged by the unexpected victory, Han commands his remaining men to kill Lee and Roper. Facing insurmountable odds, they are soon aided by the island's prisoners, who had been freed by Mei Ling. Han escapes, pursued by Lee, who finally corners him in a hidden mirror room. The mirrors give Han an advantage, but Lee breaks all the room's mirrors to reveal Han's location, and eventually kills him. Lee returns to the main battle, which is now over. A bruised and bloodied Roper sits victorious while the military finally arrive to take control of the island.\n\nCast\n\n* Bruce Lee as Lee\n* John Saxon as Roper\n* Jim Kelly as Williams\n* Ahna Capri as Tania\n* Shih Kien as Han (voice dubbed by Keye Luke)\n* Robert Wall as O'Hara (as Bob Wall)\n* Angela Mao as Su Lin, Lee's sister (as Angela Mao Ying) \n* Betty Chung as Mei Ling\n* Geoffrey Weeks as Braithwaite\n* Bolo Yeung as Bolo (as Yang Sze)\n* Peter Archer as Parsons\n* Ho Lee Yan as Old Man \n* Marlene Clark as Secretary\n* Allan Kent as Golfer\n* William Keller as L.A. Cop\n* Mickey Caruso as L.A. Cop\n* Pat E. Johnson as Hood\n* Darnell Garcia as Hood\n* Mike Bissell as Hood\n* Jackie Chan as Han's henchman\n* Sammo Hung as Shaolin fighter\n* Roy Chiao as Shaolin Abbott\n* Paul Heller as Radio Operator\n* Lam Ching Ying\n* Tony Liu as Tournament fighter\n* Alan Chui Chung-San as Tournament fighter\n* Yuen Biao as Tournament fighter\n* Yuen Wah as Tournament fighter\n* Hidy Ochiai\n* Wei Tung as Lao\n* Tadashi Yamashita\n* Mars as Guard\n* Mang Hoi as Ship's mate\n\nHistorical themes \n\nDecolonization \n\nThe end of World War II set decolonization into motion around the world. Many territories formed new states and claimed independence from European rule, attempting to put an end to colonialism. During colonialism, Asia, as well as other countries across the globe, were exploited for their labor and raw materials. In some instances, the inhabitants of these lands were treated brutally and divided up by the European power. After retaliation, Europe lost most of its territories or let them slip away, and the newly independent nations came to fruition in the 1950s and 1960s.\n\nMany historians and film critics have explored the connection between martial arts films and decolonization. Many believe that decolonization was a major theme in many martial arts movies, as the \"kung fu craze\" started booming only a few decades after independence had been won. Some say it was the foundation of the films. Others argue that it was actually Bruce Lee who \"opened up an allegorical link with the mass movement toward decolonization\". The theory is that when analyzing a martial arts film in the context of decolonization, the fight scenes represent the conflict between imperialism and the popular resistance. The antagonist, Han, is the imperialist, while the hero, Bruce Lee, is the revolutionary. Most of these Kung Fu films end with the defeat of villain against all odds, which represents liberation. So, these films are meant to offer their audience a powerful narrative of liberation.\n\nContext \n\nBlaxploitation and martial arts \n\nThe film was arguably the first to combine martial arts films with the Blaxploitation genre. Jim Kelly is thought to have portrayed the first Blaxploitation character that appeared in a martial arts movie. He would later go on to be one of the Blaxploitation genre's biggest stars. The success of the film, and the large black audience it attracted, caused other films to start incorporating these Blaxploitation characters more and more. Thus, the mingling of the genres was created.\n\nMarketing \n\nThe film was heavily advertised in the United States before its release. The budget for advertising was over $1,000,000. It was unlike any promotional campaign that had been seen before, and was extremely comprehensive. In order to advertise the film, the studio offered free Karate classes, produced thousands of illustrated flip books, comic books, posters, photographs, and organized dozens of news releases, interviews, and public appearances for the stars. Esquire, The Wall Street Journal, Time, and Newsweek all wrote stories on the film.\n\nSoundtrack \n\nThe soundtrack to the film was composed by Lalo Schifrin, who was also the composer for Mission: Impossible. He composed the score by sampling sounds from China, Korea, and Japan. The soundtrack was a huge success as well, selling over 500,000 copies. It earned a gold record.\n\nProduction \n\nThe scene in which Lee states that his style was the style of \"Fighting Without Fighting\" and then lures Parsons into boarding a dinghy is based upon a famous anecdote involving the 16th century samurai Tsukahara Bokuden.\n\nJackie Chan appears as a guard during the underground lair battle scene and gets his neck snapped by Lee. He also performed several stunts for the film, including the scene where Lee's character quickly climbs a rooftop at night. However, Yuen Wah was Lee's main stunt double for the film.\n\nSammo Hung appears in the movie in a brief fight scene against Lee during the opening of the film.\n\nThe title of the screenplay was originally Blood and Steel.\n\nEnter The Dragon was filmed without sound. All of the dialogue and effects were dubbed in during post-production.\n\nMusic\n\nArgentinian musician Lalo Schifrin composed the film's musical score. While Schifrin was widely known at the time for his jazz scores, he also incorporated funk and traditional film score elements into the film's soundtrack.\n\nReception\n\nBox office\n\nIn 1973, Enter the Dragon grossed an estimated $21,483,063 in North America, on a tight budget of $850,000.Variety says the film earned $4.25 million in North American rentals in 1973. See \"Big Rental Films of 1973\", Variety, 9 January 1974 p 19  It was one of the most successful films of 1973.\n\nIn Hong Kong, the film grossed HK$3,307,536—huge business for the time, but substantially less than Lee's Fist of Fury and Way of the Dragon. In India, the movie opened to full houses.\n\nWorldwide, the film grossed $90 million,https://editorial.rottentomatoes.com/article/bruce-lees-enter-the-dragon-to-be-remade/ including $65 million outside of the United States.http://www.worldwideboxoffice.com/movie.cgi?title\nEnter%20the%20Dragon&year=1973\n\nCritical response\n\nThe film was well received by critics and is regarded by many as one of the best films of 1973. Critics have referred to Enter the Dragon as \"a low-rent James Bond thriller\",[http://movies.tvguide.com/enter-the-dragon/review/113986 Enter the Dragon, TV Guide Movie Review.] TV Guide. Retrieved 28 September 2012.The Fourth Virgin Film Guide by James Pallot and the editors of Cinebooks, published by Virgin Books, 1995 a \"remake of Dr. No\" with elements of Fu Manchu.Hong Kong Action Cinema by Bey Logan, published by Titan Books, 1995 J.C. Maçek III of PopMatters wrote, \"Of course the real showcase here is the obvious star here, Bruce Lee, whose performance as an actor and a fighter are the most enhanced by the perfect sound and video transfer. While Kelly was a famous martial artist and a surprisingly good actor and Saxon was a famous actor and a surprisingly good martial artist, Lee proves to be a master of both fields.\"\n\nMany additional acclaimed newspapers and magazines reviewed the film as well. Variety complimented multiple aspects of the film, claiming that film was overall \"rich in the atmosphere\", the music score was \"a strong asset\" and the photography as interesting. Additionally, The New York Times gave the film a rave review. The review stated \"The picture is expertly made and well-meshed; it moves like lightning and brims with color. It is also the most savagely murderous and numbing hand-hacker (not a gun in it) you will ever see anywhere.\"\n\nThe film currently holds a 95% approval rating on the review aggregate website Rotten Tomatoes, with 43 reviews counted and an average rating of 7.8/10. In 2004, the film was deemed \"culturally significant\" by the Library of Congress and selected for preservation in the National Film Registry.\n\nThe film also ranks No. 474 on Empire magazine's 2008 list of The 500 Greatest Movies of All Time.\n\nLegacy\n\nThe film has been parodied and referenced in places such as the 1976 film The Pink Panther Strikes Again, the satirical publication The Onion, the Japanese game-show Takeshi's Castle, and the 1977 John Landis comedy anthology film Kentucky Fried Movie (in its lengthy \"A Fistful of Yen\" sequence, basically a comedic, note for note remake of Dragon) and also in the film Balls of Fury. It was also parodied on television in That '70s Show during the episode \"Jackie Moves On\" with regular character Fez taking on the Bruce Lee role. Several clips from the film are comically used during the theatre scene in The Last Dragon.\n\nIn August 2007, the now defunct Warner Independent Pictures announced that television producer Kurt Sutter would be remaking the film as a noir-style thriller entitled Awaken the Dragon with Korean singer-actor Rain starring. It was announced in September 2014 that Spike Lee will work on the remake. In March 2015, Brett Ratner revealed that he wanted to make the remake.\n\nThe little-known 1985 Nintendo arcade game  Arm Wrestling contain voice leftovers from the film, as well as their original counterparts.\n\nThe popular video game Mortal Kombat borrows multiple plot elements from Enter The Dragon.\n\nThe popular 1980s martial arts video game Double Dragon features two enemies named Roper and Williams, a reference to the two characters Roper and Williams from Enter The Dragon.\n\nHome video releases\n\nDVD\n\nUniverse (Hong Kong)\n* Aspect ratio: Widescreen (2:35:1) letterboxed\n* Sound: Cantonese (Dolby Digital 5.1), Mandarin (Dolby Digital 5.1)\n* Subtitles: Traditional, Simplified Chinese, English, Japanese, Korean, Indonesian, Malaysian, Thai, Vietnamese\n* Supplements: Trailer, trailers for Way of the Dragon, The Big Boss, Game of Death, Legacy of Rage, star files\n* All regions, NTSC\n\nFortune Star – Bruce Lee Ultimate DVD Collection (Hong Kong)\n* Aspect ratio: Widescreen (2:35:1) anamorphic\n* Sound: Cantonese (DTS 5.1), Cantonese (Dolby Digital 5.1), Cantonese (Dolby Digital 2.0 Mono), Mandarin (DTS 5.1), Mandarin (Dolby Digital 5.1)\n* Subtitles: Traditional, Simplified Chinese, English\n* Supplements: Original trailer, new trailer, still photos, slideshow of photos, celebrity interviews, unseen footage, Game of Death outtakes, Enter the Dragon alternate opening, 32-page booklet\n* Region 3, NTSC\n\nZoke Culture (China)\n* Aspect ratio: Widescreen (2:40:1) anamorphic\n* Sound: English (DTS 5.1), English (Dolby Digital 5.1), Cantonese (Dolby Digital 2.0 Stereo), Mandarin (Dolby Digital 2.0 Stereo)\n* Subtitles: Traditional, Simplified Chinese, English, Japanese, Korean, Spanish, Portuguese, Indonesian, French\n* Supplements: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, \"Blood and Steel: Making of Enter the Dragon\", \"Bruce Lee: In His Own Words\", Linda Lee Cadwell interview gallery, \"original\" 1973 making-of featurette, \"Backyard Workout with Bruce Lee\"\n* All regions, NTSC\n\nWarner – 30th Anniversary Special Edition (America)\n* Aspect ratio: Widescreen (2:35:1) anamorphic\n* Sound: English (Dolby Digital 5.1), English (Dolby Digital 2.0 Mono)\n* Subtitles: English, Spanish, French\n* Supplements: Disc 1: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, \"Blood and Steel: Making of Enter the Dragon\", \"Bruce Lee: In His Own Words\", Linda Lee Cadwell interview gallery, \"Location: Hong Kong with Enter the Dragon\" original 1973 documentary, \"Backyard Workout With Bruce Lee\" Disc 2: \"Curse of the Dragon\" feature-length documentary, \"Bruce Lee: A Warrior's Journey\" feature-length documentary, theatrical trailers, TV spots\n* Region 1, NTSC\n\nWarner – 25th Anniversary Special Edition (America)\n* Aspect ratio: Widescreen (2:35:1) anamorphic\n* Sound: English (Dolby Digital 5.1)\n* Subtitles: English, Spanish, French\n* Supplements: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, Isolated music score, an all-new introduction and interview with Linda Lee Cadwell, \"Location: Hong Kong with Enter the Dragon\" original 1973 documentary, \"Backyard Workout with Bruce\", \"Bruce Lee In His Own Words\", theatrical trailers, TV spots, cast and crew biographies, \"Significance of Belts in Martial Arts\" notes, \"Heir to the Throne\" – Jackie Chan notes, retrospective of Hong Kong martial arts films notes and stills, behind-the-scenes notes, reel recommendations – 16 movies\n* Region 1, NTSC\n\nWarner – Limited Edition (United Kingdom)\n* Aspect ratio: Widescreen (2:35:1) anamorphic\n* Sound: English (Dolby Digital 5.1)\n* Subtitles: English\n* Supplements: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, isolated music score, an all-new introduction and interview with Linda Lee Cadwell, \"Location: Hong Kong with Enter the Dragon\" original 1973 documentary, \"Backyard Workout with Bruce\", \"Bruce Lee: In His Own Words\", theatrical trailers, TV spots, cast and crew biographies, 10 exclusive Enter the Dragon postcards, 8 reproductions of original lobby cards, reproduction of the original press brochure\n* Region 2, PAL\n\nBlu-ray\n\nKam & Ronson (Hong Kong)\n* Aspect ratio: Widescreen (2:35:1)\n* Sound: Cantonese (DTS-HD Master Audio 7.1), Cantonese (Dolby True HD 7.1), Mandarin (Dolby Digital EX 6.1), Thai (Dolby Digital EX 6.1)\n* Subtitles: Traditional Chinese, English, Thai\n* Supplements: \"Alternate opening credits\", trailer, photo gallery\n* Region A\n\nWarner (North America and South America)\n* Aspect ratio: Widescreen (2:40:1)\n* Sound: English (Dolby Digital 5.1), Spanish (Dolby Digital 2.0 Surround), French (Dolby Digital 1.0 Mono), Portuguese (Dolby Digital 1.0 Mono)\n* Subtitles: English, Spanish, French, Portuguese\n* Supplements: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, \"Blood and Steel: Making of Enter the Dragon\", \"Bruce Lee: In His Own Words\", Linda Lee Cadwell interview gallery, \"Location: Hong Kong with Enter the Dragon\" original 1973 documentary, \"Backyard Workout with Bruce Lee\", \"Curse of the Dragon\" feature-length documentary, \"Bruce Lee: A Warrior's Journey\" feature-length documentary, theatrical trailers, TV spots\n* All regions\n\nWarner (40th Anniversary Edition – Remastered)\n* Aspect ratio: Widescreen (2:40:1)\n* Sound: English (DTS-HD Master Audio 5.1), French (Dolby Digital Mono), German (Dolby Digital Mono), Italian (Dolby Digital Mono), Japanese (Dolby Digital Mono), Japanese (Dolby Digital 2.0), Spanish (Dolby Digital Mono), Spanish (Dolby Digital 2.0), Polish (Dolby Digital 2.0), Russian (Dolby Digital 5.1)\n* Subtitles: English, Spanish, French, Portuguese, Japanese, German, Italian, Greek, Korean, Polish, Romanian, Russian, Serbian, Turkish\n* Supplements: Audio commentary by producer Paul M. Heller and screenwriter Michael Allin, \"No Way As Way\", \"Wing Chun\", \"Return to Han's Island\", \"Blood and Steel: Making of Enter the Dragon\", \"Bruce Lee: In His Own Words\", Linda Lee Cadwell interview gallery, \"Location: Hong Kong with Enter the Dragon\" original 1973 documentary, \"Backyard Workout with Bruce Lee\", \"Curse of the Dragon\" feature-length documentary, theatrical trailers, TV spots\n* All regions. Enter the Dragon. http://en.wikipedia.org/?curid=10193."
  }
}
