{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11547",
  "eid" : "fc686830-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778503219,
  "textBody" : "is a Japanese reading aid, consisting of smaller kana, or syllabic characters, printed next to a kanji (ideographic character) or other character to indicate its pronunciation. It is one type of ruby text. Furigana is also known as  or  in Japanese. In modern Japanese, it is mostly used to gloss rare kanji, to clarify rare, nonstandard or ambiguous kanji readings, or in children's or learners' materials. Before the post-World War II script reforms, it was more widespread.\n\nFurigana is most often written in hiragana, though katakana, alphabet letters or other kanji can also be used in certain special cases. In vertical text, tategaki, the furigana is placed to the right of the line of text; in horizontal text, yokogaki, it is placed above the line of text, as illustrated below.\n\nor\n\nThese examples spell the word kanji, which is made up of two kanji characters: 漢 (kan, written in hiragana as かん), and 字 (ji, written in hiragana as じ).\n\nAppearance\n\nFurigana may be added by character, in which case the furigana characters that correspond to a kanji are centered over that kanji; or by word or phrase, in which case the entire furigana word is centered over several kanji characters, even if the kanji do not represent equal shares of the kana needed to write them. The latter method is more common, especially since some words in Japanese have unique pronunciations (jukujikun) that are not related to readings of any of the characters the word is written with.\n\nFurigana fonts are generally sized so that two kana characters fit naturally over one kanji; when more kana are required, this is resolved either by adjusting the furigana by using a condensed font (narrowing the kana), or by adjusting the kanji by intercharacter spacing (adding spaces around the kanji). In case an isolated kanji character has a long reading—for example  (where  reads , tazusa)—the furigana may instead spill over into the space next to the neighboring kana characters, without condensing or changing spacing. Three-kana readings are not uncommon, particularly due to yōon with a long vowel, such as ; five kana are required for  and , the longest of any character in the Joyo kanji. Very long readings also occur for certain kanji or symbols which have a gairaigo reading; the word \"centimeter\" is generally written as \"cm\" (with two half-width characters, so occupying one space) and has the seven-kana reading  (senchimētoru) (it can also be written as the kanji , though this is very rare); another common example is \"%\" (the percent sign), which has the five kana reading  (pāsento). These cause severe spacing problems due to length and these words being used as units (hence closely associated to the preceding figure).\n\nWhen it is necessary to distinguish between native Japanese kun'yomi and Chinese-derived on'yomi pronunciations, for example in Kanji dictionaries, the Japanese pronunciations are written in hiragana, and the Chinese pronunciations are written in katakana. However, this distinction is really only important in dictionaries and other reference works. In ordinary prose, the script chosen will usually be hiragana. The one general exception to this is modern Chinese place names, personal names, and (occasionally) food names—these will often be written with kanji, and katakana used for the furigana; in more casual writing these are simply written in katakana, as borrowed words. Occasionally this style is also used for loanwords from other languages (especially English). For example, the kanji 一角獣 (literally \"one horn beast\") might be glossed with katakana ユニコーン, yunikōn, to show the pronunciation of the loanword \"unicorn\", which is unrelated to the normal reading of the kanji. Generally, though, such loanwords are just written in straight katakana.\n\nThe distinction between regular kana and the smaller character forms, which are used in regular orthography to mark such things as gemination and palatalization, is often not made in furigana: for example, the usual hiragana spelling of the word  (kyakka) is , but in furigana it might be written . This was especially common in old-fashioned movable type printing when smaller fonts were not available. Nowadays, with computer-based printing systems, this occurs less frequently.\n\nUsage\n\nFurigana are most commonly used in works for children, who may not have sufficiently advanced reading skills to recognize the kanji, but can understand the word when written phonetically in hiragana. Because children learn hiragana before katakana, in books for very young children, there are hiragana furigana next to the katakana characters. It is common to use furigana on all kanji characters in works for young children. This is called  in Japanese.\n\nNumeric characters used for counting (e.g. 二/２ ni-hon \"two long things\"; ２つめ futatsume \"second\"; 二/２ dai-ni maki \"chapter 2\"; ２ページ ni-pēji \"page 2\"; etc.) are usually not tagged with furigana. Numeric words in established compounds (e.g.  ippo \"step\"), however, may be.\n\nMany children's, shōnen and shōjo manga use furigana (however, rarely on numerals). Shōnen and shōjo manga tend to have furigana for all non-numeric characters, while children manga, such as Doraemon, may also ignore furigana on elementary-grade kanji. Seinen and josei manga ignores furigana most of the time, even on the names of the characters if they're common names. There are also books with a phonetic guide (mainly in hiragana but sometimes in romaji) for Japanese learners, which may be bilingual or Japanese only. These are popular with foreigners wishing to master Japanese faster and enjoy reading Japanese short stories, novels or articles.\n\nFurigana unrelated to the kanji they're assigned to are quite often used to convey certain effects, rather than to denote a phonetic guide, especially in manga, anime and games. For example, the word wikt:悪夢| \"nightmare\" may be assigned with しんじつ shinjitsu \"truth\" rather than its true reading, あくむ akumu, to convey the meaning of \"nightmarish truth\". Some authors may even use furigana that means the opposite of what the base text does to reinforce an effect, such as the complicated relationship between characters. For example, wikt:親友| shin'yū \"close friend\" may be tagged with ライバル raibaru \"rival\", to mean \"you're my rival, but also my friend\"; or conversely, wikt:好敵手| kōtekishu \"eternal rival\" may be tagged with とも tomo \"friend\".\n\nSome manga make use of the furigana renditions of foreign words (especially obscure ones) as the intended reading of a term, and the more familiar kanji for the meaning of such a term. For example,   may be assigned with ブラック・マジック Burakku Majikku, the rendition of the English \"Black Magic\", to convey a foreign, exotic feel; ステーション sutēshon on 駅 eki \"station\"; ハニームーン hanīmūn on wikt:新婚旅行| shinkon ryokō \"honeymoon\". This is sometimes done conversely, for example, by using キッス kissu \"kiss\", the more familiar term, as furigana to convey meaning, and  bēze \"baiser\", the exotic term, as base text.\n\nSometimes, ruby text does not even serve as furigana, but as mere glosses (meaning notes) for obscure terms; for example, wikt:リリック| ririkku may be tagged with 歌詞 kashi \"lyrics\" for clarification rather than for phonetic guidance.\n\nSome websites and tools exist which provide a phonetic guide for Japanese web pages (in hiragana, romaji or kiriji); these are popular with both Japanese children and foreign Japanese learners.\n\nIn works aimed at adult Japanese speakers, furigana may be used on a word written in uncommon kanji; in the mass media, they are generally used on words containing non-Jōyō kanji.\n\nFurigana commonly appear alongside kanji names and their romanizations on signs for railway stations, even if the pronunciation of the kanji is commonly known. Furigana also appear often on maps to show the pronunciation of unusual place names.\n\nBefore the war, youths might arguably have been almost illiterate if not for furigana.\n\nNames\n\nJapanese names are usually written in kanji. Because there are many possible readings for kanji names, including special name-only readings called nanori, furigana are often used to give the readings of names. On Japanese official forms, where the name is to be written, there is  always an adjacent column for the name to be written in furigana. Usually katakana is preferred.\n\nFurigana may also be used for foreign names written in kanji. Chinese and Korean names are the most common examples: Chinese names are usually pronounced with Japanese readings and the pronunciation written in hiragana, while Korean names are usually pronounced with Korean readings and the pronunciation written in katakana. Furigana may also be necessary in the rare case where names are transliterated into kanji from other languages (e.g. soccer star Ruy Ramos and politician Marutei Tsurunen.)\n\nLanguage learning\n\nKanji and kanji compounds are often presented with furigana in Japanese language textbooks for non-native speakers.\n\nFurigana are also often used in foreign language textbooks for Japanese learners to indicate pronunciation. The words are written in the original foreign script, such as hangul for Korean, and furigana is used to indicate the pronunciation. According to Ministry of Education guidelines, and the opinions of educators, the use of Japanese furigana should be avoided in English teaching due to the differences in pronunciation between English and Japanese. For instance, the word \"birthdate\" might be glossed in furigana as 「バースデイト」 (bāsudeito), which corresponds to an imperfect pronunciation.\n\nPunning and double meaning\n\nSome writers use furigana to represent slang pronunciations, particularly those that would become hard to understand without the kanji to provide their meaning.\n\nAnother use is to write the kanji for something which had been previously referenced, but write furigana for  () or  (), meaning \"that\". This means that the actual word used was \"that\", but the kanji clarify for the reader what \"that\" refers to.\n\nIn karaoke it is extremely common for furigana to be placed on the song lyrics. The song lyrics are often written in kanji pronounced quite differently from the furigana. The furigana version is used for pronunciation.\n\nAlso, because the kanji represent meaning while the furigana represent sound, one can combine the two to create puns or indicate meanings of foreign words. One might write the kanji for \"blue\", but use katakana to write the pronunciation of the English word \"blue\"; this may be done, for example, in Japanese subtitles on foreign films, where it can help associate the written Japanese with the sounds actually being spoken by the actors, or it may be used in a translation of a work of fiction to enable the translator to preserve the original sound of a proper name (such as \"Firebolt\" in the Harry Potter series) in furigana, while simultaneously indicating its meaning with kanji. A similar practice is used in native fiction to clarify extended meanings. For example, in a work of science fiction, some astronaut could use the word , furusato, meaning \"my hometown\", when referring to planet Earth. To clarify that for the reader, the word furusato (hometown) might be written in hiragana over the kanji for chikyuu (Earth).\n\nOther Japanese reading aids\n\nOkurigana\n\nOkurigana are kana that appear inline at normal size following kanji stems, typically to complete and to inflect adjectives and verbs. In this use they may also help to disambiguate kanji with multiple readings; for example,  (, agaru) vs.  (, noboru). Unlike furigana, the use of okurigana is a mandatory part of the written language.\n\nKunten\n\nIn the written style known as kanbun, which is the Japanese approximation of Classical Chinese, small marks called kunten are sometimes added as reading aids. Unlike furigana, which indicate pronunciation, kunten indicate Japanese grammatical structures absent from the kanbun, as well as showing how words should be reordered to fit Japanese sentence structure.\n\nFurikanji\n\nFurigana are sometimes also used to indicate meaning, rather than pronunciation. Over the foreign text, smaller sized Japanese words, in kana or kanji, corresponding to the meaning of the foreign words, effectively translate it in place. While rare now, some late 19th–early 20th century authors used kanji as furigana for loanwords written in katakana. This usage is called  in Japanese, since furigana implies the use of kana.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Furigana" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11547" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "is a Japanese reading aid, consisting of smaller kana, or syllabic characters, printed next to a kanji (ideographic character) or other character to indicate its pronunciation. It is one type of ruby text. Furigana is also known as  or  in Japanese. In modern Japanese, it is mostly used to gloss rare kanji, to clarify rare, nonstandard or ambiguous kanji readings, or in children's or learners' materials. Before the post-World War II script reforms, it was more widespread.\n\nFurigana is most often written in hiragana, though katakana, alphabet letters or other kanji can also be used in certain special cases. In vertical text, tategaki, the furigana is placed to the right of the line of text; in horizontal text, yokogaki, it is placed above the line of text, as illustrated below.\n\nor\n\nThese examples spell the word kanji, which is made up of two kanji characters: 漢 (kan, written in hiragana as かん), and 字 (ji, written in hiragana as じ).\n\nAppearance\n\nFurigana may be added by character, in which case the furigana characters that correspond to a kanji are centered over that kanji; or by word or phrase, in which case the entire furigana word is centered over several kanji characters, even if the kanji do not represent equal shares of the kana needed to write them. The latter method is more common, especially since some words in Japanese have unique pronunciations (jukujikun) that are not related to readings of any of the characters the word is written with.\n\nFurigana fonts are generally sized so that two kana characters fit naturally over one kanji; when more kana are required, this is resolved either by adjusting the furigana by using a condensed font (narrowing the kana), or by adjusting the kanji by intercharacter spacing (adding spaces around the kanji). In case an isolated kanji character has a long reading—for example  (where  reads , tazusa)—the furigana may instead spill over into the space next to the neighboring kana characters, without condensing or changing spacing. Three-kana readings are not uncommon, particularly due to yōon with a long vowel, such as ; five kana are required for  and , the longest of any character in the Joyo kanji. Very long readings also occur for certain kanji or symbols which have a gairaigo reading; the word \"centimeter\" is generally written as \"cm\" (with two half-width characters, so occupying one space) and has the seven-kana reading  (senchimētoru) (it can also be written as the kanji , though this is very rare); another common example is \"%\" (the percent sign), which has the five kana reading  (pāsento). These cause severe spacing problems due to length and these words being used as units (hence closely associated to the preceding figure).\n\nWhen it is necessary to distinguish between native Japanese kun'yomi and Chinese-derived on'yomi pronunciations, for example in Kanji dictionaries, the Japanese pronunciations are written in hiragana, and the Chinese pronunciations are written in katakana. However, this distinction is really only important in dictionaries and other reference works. In ordinary prose, the script chosen will usually be hiragana. The one general exception to this is modern Chinese place names, personal names, and (occasionally) food names—these will often be written with kanji, and katakana used for the furigana; in more casual writing these are simply written in katakana, as borrowed words. Occasionally this style is also used for loanwords from other languages (especially English). For example, the kanji 一角獣 (literally \"one horn beast\") might be glossed with katakana ユニコーン, yunikōn, to show the pronunciation of the loanword \"unicorn\", which is unrelated to the normal reading of the kanji. Generally, though, such loanwords are just written in straight katakana.\n\nThe distinction between regular kana and the smaller character forms, which are used in regular orthography to mark such things as gemination and palatalization, is often not made in furigana: for example, the usual hiragana spelling of the word  (kyakka) is , but in furigana it might be written . This was especially common in old-fashioned movable type printing when smaller fonts were not available. Nowadays, with computer-based printing systems, this occurs less frequently.\n\nUsage\n\nFurigana are most commonly used in works for children, who may not have sufficiently advanced reading skills to recognize the kanji, but can understand the word when written phonetically in hiragana. Because children learn hiragana before katakana, in books for very young children, there are hiragana furigana next to the katakana characters. It is common to use furigana on all kanji characters in works for young children. This is called  in Japanese.\n\nNumeric characters used for counting (e.g. 二/２ ni-hon \"two long things\"; ２つめ futatsume \"second\"; 二/２ dai-ni maki \"chapter 2\"; ２ページ ni-pēji \"page 2\"; etc.) are usually not tagged with furigana. Numeric words in established compounds (e.g.  ippo \"step\"), however, may be.\n\nMany children's, shōnen and shōjo manga use furigana (however, rarely on numerals). Shōnen and shōjo manga tend to have furigana for all non-numeric characters, while children manga, such as Doraemon, may also ignore furigana on elementary-grade kanji. Seinen and josei manga ignores furigana most of the time, even on the names of the characters if they're common names. There are also books with a phonetic guide (mainly in hiragana but sometimes in romaji) for Japanese learners, which may be bilingual or Japanese only. These are popular with foreigners wishing to master Japanese faster and enjoy reading Japanese short stories, novels or articles.\n\nFurigana unrelated to the kanji they're assigned to are quite often used to convey certain effects, rather than to denote a phonetic guide, especially in manga, anime and games. For example, the word wikt:悪夢| \"nightmare\" may be assigned with しんじつ shinjitsu \"truth\" rather than its true reading, あくむ akumu, to convey the meaning of \"nightmarish truth\". Some authors may even use furigana that means the opposite of what the base text does to reinforce an effect, such as the complicated relationship between characters. For example, wikt:親友| shin'yū \"close friend\" may be tagged with ライバル raibaru \"rival\", to mean \"you're my rival, but also my friend\"; or conversely, wikt:好敵手| kōtekishu \"eternal rival\" may be tagged with とも tomo \"friend\".\n\nSome manga make use of the furigana renditions of foreign words (especially obscure ones) as the intended reading of a term, and the more familiar kanji for the meaning of such a term. For example,   may be assigned with ブラック・マジック Burakku Majikku, the rendition of the English \"Black Magic\", to convey a foreign, exotic feel; ステーション sutēshon on 駅 eki \"station\"; ハニームーン hanīmūn on wikt:新婚旅行| shinkon ryokō \"honeymoon\". This is sometimes done conversely, for example, by using キッス kissu \"kiss\", the more familiar term, as furigana to convey meaning, and  bēze \"baiser\", the exotic term, as base text.\n\nSometimes, ruby text does not even serve as furigana, but as mere glosses (meaning notes) for obscure terms; for example, wikt:リリック| ririkku may be tagged with 歌詞 kashi \"lyrics\" for clarification rather than for phonetic guidance.\n\nSome websites and tools exist which provide a phonetic guide for Japanese web pages (in hiragana, romaji or kiriji); these are popular with both Japanese children and foreign Japanese learners.\n\nIn works aimed at adult Japanese speakers, furigana may be used on a word written in uncommon kanji; in the mass media, they are generally used on words containing non-Jōyō kanji.\n\nFurigana commonly appear alongside kanji names and their romanizations on signs for railway stations, even if the pronunciation of the kanji is commonly known. Furigana also appear often on maps to show the pronunciation of unusual place names.\n\nBefore the war, youths might arguably have been almost illiterate if not for furigana.\n\nNames\n\nJapanese names are usually written in kanji. Because there are many possible readings for kanji names, including special name-only readings called nanori, furigana are often used to give the readings of names. On Japanese official forms, where the name is to be written, there is  always an adjacent column for the name to be written in furigana. Usually katakana is preferred.\n\nFurigana may also be used for foreign names written in kanji. Chinese and Korean names are the most common examples: Chinese names are usually pronounced with Japanese readings and the pronunciation written in hiragana, while Korean names are usually pronounced with Korean readings and the pronunciation written in katakana. Furigana may also be necessary in the rare case where names are transliterated into kanji from other languages (e.g. soccer star Ruy Ramos and politician Marutei Tsurunen.)\n\nLanguage learning\n\nKanji and kanji compounds are often presented with furigana in Japanese language textbooks for non-native speakers.\n\nFurigana are also often used in foreign language textbooks for Japanese learners to indicate pronunciation. The words are written in the original foreign script, such as hangul for Korean, and furigana is used to indicate the pronunciation. According to Ministry of Education guidelines, and the opinions of educators, the use of Japanese furigana should be avoided in English teaching due to the differences in pronunciation between English and Japanese. For instance, the word \"birthdate\" might be glossed in furigana as 「バースデイト」 (bāsudeito), which corresponds to an imperfect pronunciation.\n\nPunning and double meaning\n\nSome writers use furigana to represent slang pronunciations, particularly those that would become hard to understand without the kanji to provide their meaning.\n\nAnother use is to write the kanji for something which had been previously referenced, but write furigana for  () or  (), meaning \"that\". This means that the actual word used was \"that\", but the kanji clarify for the reader what \"that\" refers to.\n\nIn karaoke it is extremely common for furigana to be placed on the song lyrics. The song lyrics are often written in kanji pronounced quite differently from the furigana. The furigana version is used for pronunciation.\n\nAlso, because the kanji represent meaning while the furigana represent sound, one can combine the two to create puns or indicate meanings of foreign words. One might write the kanji for \"blue\", but use katakana to write the pronunciation of the English word \"blue\"; this may be done, for example, in Japanese subtitles on foreign films, where it can help associate the written Japanese with the sounds actually being spoken by the actors, or it may be used in a translation of a work of fiction to enable the translator to preserve the original sound of a proper name (such as \"Firebolt\" in the Harry Potter series) in furigana, while simultaneously indicating its meaning with kanji. A similar practice is used in native fiction to clarify extended meanings. For example, in a work of science fiction, some astronaut could use the word , furusato, meaning \"my hometown\", when referring to planet Earth. To clarify that for the reader, the word furusato (hometown) might be written in hiragana over the kanji for chikyuu (Earth).\n\nOther Japanese reading aids\n\nOkurigana\n\nOkurigana are kana that appear inline at normal size following kanji stems, typically to complete and to inflect adjectives and verbs. In this use they may also help to disambiguate kanji with multiple readings; for example,  (, agaru) vs.  (, noboru). Unlike furigana, the use of okurigana is a mandatory part of the written language.\n\nKunten\n\nIn the written style known as kanbun, which is the Japanese approximation of Classical Chinese, small marks called kunten are sometimes added as reading aids. Unlike furigana, which indicate pronunciation, kunten indicate Japanese grammatical structures absent from the kanbun, as well as showing how words should be reordered to fit Japanese sentence structure.\n\nFurikanji\n\nFurigana are sometimes also used to indicate meaning, rather than pronunciation. Over the foreign text, smaller sized Japanese words, in kana or kanji, corresponding to the meaning of the foreign words, effectively translate it in place. While rare now, some late 19th–early 20th century authors used kanji as furigana for loanwords written in katakana. This usage is called  in Japanese, since furigana implies the use of kana. Furigana. http://en.wikipedia.org/?curid=11547."
  }
}
