{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6731",
  "eid" : "dd573890-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778451097,
  "textBody" : "The Boeing C-17 Globemaster III is a large military transport aircraft. It was developed for the United States Air Force (USAF) from the 1980s to the early 1990s by McDonnell Douglas. The C-17 carries forward the name of two previous piston-engined military cargo aircraft, the Douglas C-74 Globemaster and the Douglas C-124 Globemaster II. The C-17 commonly performs tactical and strategic airlift missions, transporting troops and cargo throughout the world; additional roles include medical evacuation and airdrop duties. It was designed to replace the Lockheed C-141 Starlifter, and also fulfill some of the duties of the Lockheed C-5 Galaxy, freeing the C-5 fleet for outsize cargo.\n\nBoeing, which merged with McDonnell Douglas in 1997, continued to manufacture C-17s for export customers following the end of deliveries to the U.S. Air Force. Aside from the United States, the C-17 is in service with the United Kingdom, Australia, Canada, Qatar, United Arab Emirates, NATO Heavy Airlift Wing, India, and Kuwait. The final C-17 was completed at the Long Beach, California plant and flown on 29 November 2015.\n\nDevelopment\n\nBackground and design phase\n\nIn the 1970s, the U.S. Air Force began looking for a replacement for its Lockheed C-130 Hercules tactical cargo aircraft.[https://pqasb.pqarchiver.com/djreprints/access/72923084.html?dids72923084:72923084&FMT\nABS&FMTSABS:AI&type\nhistoric&dateNov+13%2C+1972&author\n&pubWall+Street+Journal&desc\nAir+Force+Lets+Advanced+STOL+Prototype+Work&pqatlgoogle \"Air Force Lets Advanced STOL Prototype Work.\"] Wall Street Journal, 13 November 1972.  The Advanced Medium STOL Transport (AMST) competition was held, with Boeing proposing the YC-14, and McDonnell Douglas proposing the YC-15.Miles, Marvin. [https://pqasb.pqarchiver.com/latimes/access/660687842.html?dids\n660687842:660687842&FMTABS&FMTS\nABS:AI&typehistoric&date\nNov+11%2C+1972&author&pub\nLos+Angeles+Times&descMcDonnell%2C+Boeing+to+Compete+for+Lockheed+C-130+Successor&pqatl\ngoogle \"McDonnell, Boeing to Compete for Lockheed C-130 Successor.\"] Los Angeles Times, 11 November 1972.  Though both entrants exceeded specified requirements, the AMST competition was canceled before a winner was selected. The Air Force started the C-X program in November 1979 to develop a larger AMST with longer range to augment its strategic airlift.Kennedy 2004, pp. 3–20, 24.\n\nBy 1980, the USAF found itself with a large fleet of aging C-141 Starlifter cargo aircraft. Compounding matters, USAF needed increased strategic airlift capabilities to fulfill its rapid-deployment airlift requirements. The USAF set mission requirements and released a request for proposals (RFP) for C-X in October 1980. McDonnell Douglas elected to develop a new aircraft based on the YC-15, under Program Manager Joe Van Dyke. Boeing bid an enlarged three-engine version of its AMST YC-14. Lockheed submitted two designs, a C-5-based design and an enlarged C-141 design. On 28 August 1981, McDonnell Douglas was chosen to build its proposed aircraft, then designated C-17. Compared to the YC-15, the new aircraft differed in having swept wings, increased size, and more powerful engines.Norton 2001, pp. 12–13.  This would allow it to perform the work done by the C-141, and to fulfill some of the duties of the Lockheed C-5 Galaxy, freeing the C-5 fleet for outsize cargo.\n\nAlternative proposals were pursued to fill airlift needs after the C-X contest. These were lengthening of C-141As into C-141Bs, ordering more C-5s, continued purchases of KC-10s, and expansion of the Civil Reserve Air Fleet. Limited budgets reduced program funding, requiring a delay of four years. During this time contracts were awarded for preliminary design work and for the completion of engine certification.  In December 1985, a full-scale development contract was awarded, under Program Manager Bob Clepper. [https://pqasb.pqarchiver.com/newsday/access/98482212.html?dids\n98482212:98482212&FMTABS&FMTS\nABS:FT&typecurrent&date\nJan+03%2C+1986&authorThe+Los+Angeles+Times&pub\nNewsday+(Combined+editions)&descDouglas+Wins+%243.4B+Pact+to+Build+C-17&pqatl\ngoogle  \"Douglas Wins $3.4B Pact to Build C-17.\"] Los Angeles Times, 3 January 1986.  At this time, first flight was planned for 1990.Norton 2001, pp. 13, 15.  The Air Force had formed a requirement for 210 aircraft.Kennedy 2004, pp. 70, 81–83.\n\nDevelopment problems and limited funding caused delays in the late 1980s.Kennedy, Betty Raab. [http://rtoc.ida.org/rtoc/open/briefings_articles/kennednd.pdf \"Historical Realities of C-17 Program Pose Challenge for Future Acquisitions.\"]  Institute for Defense Analyses, December 1999.  Criticisms were made of the developing aircraft and questions were raised about more cost-effective alternatives during this time.Fuller, Richard L. [https://pqasb.pqarchiver.com/chicagotribune/access/24563333.html?dids24563333:24563333&FMT\nABS&FMTSABS:FT&type\ncurrent&dateSep+09%2C+1989&author\nCol.+Richard+L.+Fuller%2C+Director+of+public+affairs%2C+United+States+Air+Force.&pubChicago+Tribune+(pre-1997+Fulltext)&desc\nMore+load+for+the+buck+with+C-17&pqatlgoogle \"More load for the buck with C-17.\"] Chicago Tribune, 9 September 1989.Sanford, Robert. [http://nl.newsbank.com/nl-search/we/Archives?p_product\nSL&p_themesl&p_action\nsearch&p_maxdocs200&p_topdoc\n1&p_text_direct-00EB04C1540E361A8&p_field_direct-0\ndocument_id&p_perpage10&p_sort\nYMD_date:D&s_trackvalGooglePM \"McDonnell Plugs Away on C-17.\"] St. Louis Post-Dispatch, 3 April 1989.  In April 1990, Secretary of Defense Dick Cheney reduced the order from 210 to 120 aircraft.Brenner, Eliot. [https://news.google.com/newspapers?nid\n799&dat19900426&id\nGJVTAAAAIBAJ&sjidFogDAAAAIBAJ&pg\n6880,2683844 \"Cheney cuts back on Air Force programs.\"] Bryan Times, 26 April 1990.  The maiden flight of the C-17 took place on 15 September 1991 from the McDonnell Douglas's plant in Long Beach, California, about a year behind schedule.[https://www.nytimes.com/1991/09/17/us/c-17-s-first-flight-smoother-than-debate.html \"C-17's First Flight Smoother Than Debate.\"] The New York Times, 17 September 1991. The first aircraft (T-1) and five more production models (P1-P5) participated in extensive flight testing and evaluation at Edwards Air Force Base.[http://opencrs.com/document/RL30685 \"RL30685, Military Airlift: C-17 Aircraft Program.\"] Congressional Research Service, 5 June 2007.  Two complete airframes were built for static and repeated load testing.Norton 2001, pp. 25–26, 28.\n\nDevelopment difficulties\n\nA static test of the C-17 wing in October 1992 resulted in the wing failing at 128% of design limit load, which was below the 150% requirement. Both wings buckled rear to the front and failures occurred in stringers, spars and ribs.[http://www.dodig.mil/Audit/Audit2/93-159.pdf \"Technical Assessment Report; C-17 Wing Structural Integrity.\"] Department of Defense, 24 August 1993. Retrieved: 23 August 2011. Some $100 million were spent to redesign the wing structure; the wing failed at 145% during a second test in September 1993.[http://community.seattletimes.nwsource.com/archive/?date19930914&slug\n1721000 \"C-17 Wing Fails Again; Probe Is Sought.\"] Seattle Times, 14 September 1993. Retrieved: 23 August 2011. A careful review of the test data, however, showed that the wing was not loaded correctly and did indeed meet the requirement.[http://documents.blackvault.com/documents/dod/readingroom/5/767.pdf \"Findings, Conclusions and Recommendations of the Executive Independent Review Team.\"] US Government Executive Independent Review Team via blackvault.com, 12 December 1993. Retrieved: 23 August 2011.  The C-17 received the \"Globemaster III\" name in early 1993. In late 1993, the Department of Defense gave the contractor two years to solve production and cost overrun problems or face termination of the contract after the delivery of the 40th aircraft.Evans, David. [https://pqasb.pqarchiver.com/chicagotribune/access/24383613.html?dids\n24383613:24383613&FMTABS&FMTS\nABS:FT&typecurrent&date\nMar+29%2C+1993&authorDavid+Evans%2C+Chicago+Tribune.&pub\nChicago+Tribune+(pre-1997+Fulltext)&descPentagon+to+Air+Force%3A+C-17+flunks&pqatl\ngoogle \"Pentagon to Air Force: C-17 flunks.\"] Chicago Tribune, 29 March 1993.  By accepting the 1993 terms, McDonnell Douglas incurred a loss of nearly US$1.5 billion on the development phase of the program.\n\nIn April 1994, the C-17 program remained over budget, and did not meet weight, fuel burn, payload and range specifications. It failed several key criteria during airworthiness evaluation tests.[http://community.seattletimes.nwsource.com/archive/?date19910528&slug\n1285732 \"Air Force Letter To Douglas Spells Out 75 Defects For C-17.\"] Los Angeles Times, 28 May 1991.[http://nl.newsbank.com/nl-search/we/Archives?p_productLB&p_theme\nlb&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n0EAE8F93D6E54ED8&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM \"C-17 fails engine start test.\"] Press-Telegram, 12 April 1994.[http://nl.newsbank.com/nl-search/we/Archives?p_productCO&s_site\ncharlotte&p_multiCO&p_theme\nrealcities&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n0EB6CC1343F2E14F&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM \"Parts Orders for C-17 far too high, GAO says.\"] Charlotte Observer, 16 March 1994. Technical problems were found with the mission software, landing gear, and other areas.[http://archive.gao.gov/t2pbat3/151473.pdf \"The C-17 Proposed Settlement and Program Update.\"] United States General Accounting Office,  28 April 1994. In May 1994, it was proposed to cut production to as few as 32 aircraft; these cuts were later rescinded.Kreisher, Otto. [https://pqasb.pqarchiver.com/sandiego/access/1242506621.html?dids1242506621:1242506621&FMT\nABS&FMTSABS:FT&type\ncurrent&dateMay+25%2C+1994&author\nOTTO+KREISHER&pubThe+San+Diego+Union+-+Tribune&desc\nHouse+rescinds+cuts+in+C-17+program+%7C+Vote+may+help+thousands+retain+jobs+in+Long+Beach&pqatlgoogle \"House rescinds cuts in C-17 program.\"] San Diego Union, 25 May 1994. A July 1994 GAO document revealed that Air Force and DoD studies from 1986 and 1991 stated the C-17 could use 6,400 more runways outside the U.S. than the C-5; it was discovered that these studies only considered runway dimensions, but not runway strength or Load Classification Numbers (LCN). The C-5 has a lower LCN, but the USAF classifies both in the same broad Load Classification Group. When considering runway dimensions and load ratings, the C-17's worldwide runway advantage over the C-5 shrank from 6,400 to 911 airfields.[http://archive.gao.gov/t2pbat3/152088.pdf \"Comparison of C-5 and C-17 Airfield Availability.\"] United States General Accounting Office, July 1994. The C-17's ability to use low quality, austere airfields was not considered.\n\nA January 1995 GAO report stated that the USAF originally planned to order 210 C-17s at a cost of $41.8 billion, and that the 120 aircraft on order were to cost $39.5 billion based on a 1992 estimate.[http://www.gao.gov/archive/1995/ns95026.pdf \"C-17 Aircraft – Cost and Performance Issues.\"] United States General Accounting Office, January 1995.  In March 1994, the U.S. Army decided it did not need the 60000 lb low-altitude parachute extraction system (LAPES) delivery with the C-17 and that the C-130's 42000 lb capability was sufficient. C-17 testing was limited to this lower weight. Airflow issues prevented the C-17 from meeting airdrop requirements. A February 1997 GAO report revealed that a C-17 with a full payload could not land on 3000 ft wet runways; simulations suggested a distance of 5000 ft was required.[http://www.gao.gov/archive/1997/ns97050.pdf \"C-17 Globemaster – Support of Operation Joint Endeavor.\"] United States General Accounting Office, February 1997. The YC-15 was transferred to AMARC to be made flightworthy again for further flight tests for the C-17 program in March 1997.Bonny et al. 2006, p. 65. In 1995, most of the problems had been reportedly resolved.[http://www.afa.org/media/press/windall.asp \"Air Force Secretary Says Modernization, C-17 on Track.\"]  Air Force magazine, 19 September 1995.[http://nl.newsbank.com/nl-search/we/Archives?p_productLB&p_theme\nlb&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n0EAE901FCF584869&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM \"Future Brightens for C-17 Program.\"] Press-Telegram, 31 March 1995. The first C-17 squadron was declared operational by the USAF in January 1995.[http://nl.newsbank.com/nl-search/we/Archives?p_productSL&p_theme\nsl&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n0EB082E680DBFA28&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM \"Air Force fills Squadron of C-17s .\"] Associated Press, 18 January 1995.\n\nProduction and deliveries\n\nIn 1996, DoD ordered another 80 aircraft for a total of 120.Kilian, Michael. [https://pqasb.pqarchiver.com/chicagotribune/access/17166359.html?dids17166359:17166359&FMT\nABS&FMTSABS:FT&type\ncurrent&dateJun+01%2C+1996&author\nMichael+Kilian%2C+Washington+Bureau.&pubChicago+Tribune+(pre-1997+Fulltext)&desc\nIN+RECORD+PROCUREMENT+U.S.+ORDERS+80+C-17S+PLANE+DEAL+GOOD+FOR+2%2C000+JOBS+IN+CALIFORNIA&pqatlgoogle \"In Record Procurement U.S. Orders 80 C17s – Plane Good Deal for 2,000 jobs in California.\"] Chicago Tribune, 1 July 1996. In 1997 McDonnell Douglas merged with its former competitor, Boeing. In April 1999, Boeing proposed to cut the price of the C-17 if the Air Force bought 60 more,Wallace, James. [http://www.highbeam.com/doc/1G1-64094695.html \"Boeing to cut price of C-17 if Air Force buys 60 more.\"] Seattle Post, 2 April 1999. and in August 2002, the order was increased to 180 aircraft.[https://www.nytimes.com/2002/08/16/business/9.7-billion-us-deal-for-boeing-c-17-s.html \"$9.7 Billion U.S. Deal for Boeing C-17's.\"] The New York Times, 16 August 2002. In 2007, 190 C-17s were on order for the USAF.[http://www.boeing.com/defense-space/military/c17/c17news.html \"Boeing Company Funds Extension.\"] Boeing, 9 July 2008. On 6 February 2009, Boeing was awarded a $2.95 billion contract for 15 additional aircraft, increasing the total USAF C-17 fleet to 205 and extending production from August 2009 to August 2010.Trimble, Stephen. [http://www.flightglobal.com/articles/2009/02/10/322315/usaf-signs-deals-for-15-more-c-17s-upgraded-c-5ms.html \"Boeing in $3bn air force contract.\"] Flight International, 10 February 2009. On 6 April 2009, U.S. Secretary of Defense Robert Gates stated that there would be no more C-17s ordered beyond the 205 planned.Cole, August and Yochi J. Dreazen. \"Pentagon Pushes Weapon Cuts.\" The Wall Street Journal, 7 April 2009, p. 1. However, on 12 June 2009, the House Armed Services Air and Land Forces Subcommittee added a further 17 C-17s.Kreisher, Otto. [http://www.govexec.com/dailyfed/0609/061209cdpm1.htm \"House panel reverses cuts in aircraft programs.\"] Congress Daily, 12 June 2009.\n\nIn 2010, Boeing reduced the C-17 production rate to 10 aircraft per year from a high of 16 per year. This was due to dwindling orders and to extend the life of the production line while additional international orders were sought. The workforce was reduced by approximately 1,100 through 2012, and a second shift at the Long Beach assembly plant was also eliminated.Vivanco, Fernando and Jerry Drelling. [http://boeing.mediaroom.com/index.php?s43&item\n1588 \"Boeing C-17 Program Enters 2nd Phase of Production Rate and Work Force Reductions.\"] Boeing Press Release, 20 January 2011. By April 2011, 230 production C-17s had been delivered, including 210 to the USAF.Hoyle, Craig. [http://www.flightglobal.com/articles/2011/04/19/355726/australia-to-get-fifth-c-17-in-august.html \"Australia to get fifth C-17 in August.\"] Flightglobal, 19 April 2011. The C-17 prototype \"T-1\" was retired in 2012 after being used by the USAF for testing and development.Sanchez, Senior Airman Stacy. [http://www.edwards.af.mil/news/story.asp?id=123090905 \"Edwards T-1 reaches 1,000 flight milestone.\"]  95th Air Base Wing Public Affairs, 20 March 2008.  In January 2010, the USAF announced the end of Boeing's performance-based logistics contracts to maintain the aircraft.[http://www.flightglobal.com/articles/2010/05/18/341939/why-is-usaf-bringing-maintenance-in-house.html \"Why is USAF bringing maintenance in-house?\"] flightglobal.com, 18 May 2005. Retrieved: 18 August 2011. On 19 June 2012, the USAF ordered its 224th and final C-17, as a replacement for an aircraft that crashed in Alaska in July 2010.Miller, Seth and Michael C. Sirak. [http://www.airforce-magazine.com/DRArchive/Pages/2012/June%202012/June%2020%202012/EndoftheLine.aspx \"Likely End of the Line for The Air Force C-17 Production.\"] Air Force Magazine, 20 June 2012.\n\nIn September 2013, Boeing announced that C-17 production was starting to close down. In October 2014, the main wing spar of the 279th and last aircraft was completed; this C-17  was delivered in 2015, after which Boeing will close the Long Beach plant.The World, Aviation Week and Space Technology, August 4, 2014, p.10 Production of spare components shall continue until at least 2017. The C-17 is projected to be in service for several decades.[http://www.chicagotribune.com/business/breaking/la-fi-boeing-long-beach-20130919-story.html#page1 \"Boeing to shut C-17 plant in Long Beach\"] Chicago Tribune, 18 September 2013.[http://www.militarytimes.com/article/20130918/NEWS04/309180036/Boeing-end-C-17-production-2015 \"Boeing to end C-17 production in 2015\"]. Militarytimes.com, 18 September 2013. In February 2014, Boeing was engaged in sales talks with \"five or six\" countries for the remaining 15 C-17s, \"two to four\" of which are not current operators,[http://www.flightglobal.com/news/articles/singapore-boeing-confident-of-placing-unsold-c-17s-395826/ \"Boeing confident of placing unsold C-17s\"]. Flightglobal.com, 11 February 2014. and Boeing decided to build 10 aircraft without confirmed buyers in anticipation of future purchases. , five aircraft found buyers, including two for the Middle East, two for Australia and one for Canada.\n\nIn May 2015, the Wall Street Journal reported that Boeing expected to book a charge of under $100 million and cut 3,000 positions associated with the C-17 program. Teal Group analyst Richard Aboulafia suggested that Airbus' lower cost A400M Atlas has taken international sales away from the C-17.Shukla, Tarun. \"A forlorn end to California's aviation glory\". Wall Street Journal, 6 May 2015, pp. B1-2.\n\nSources: C-17 Globemaster III Pocket Guide,\"C-17 Globemaster III Pocket Guide\", The Boeing Company, Long Beach, CA, June 2010 Boeing IDS Major Deliveries[http://www.boeing.com/bds/deliveries.html \"BDS Major Deliveries (current year).\"]  Boeing, March 2014. Retrieved: 5 April 2014.\n\nDesign\n\nThe C-17 is 174 ft long and has a wingspan of about 170 ft. It can airlift cargo fairly close to a battle area. The size and weight of U.S. mechanized firepower and equipment have grown in recent decades from increased air mobility requirements, particularly for large or heavy non-palletized outsize cargo.\n\nThe C-17 is powered by four Pratt & Whitney F117-PW-100 turbofan engines, which are based on the commercial Pratt and Whitney PW2040 used on the Boeing 757. Each engine is rated at  of thrust. The engine's thrust reversers direct engine exhaust air upwards and forward, reducing the chances of foreign object damage by ingestion of runway debris, and providing enough reverse thrust to back the aircraft up on the ground while taxiing. The thrust reversers can also be used in flight at idle-reverse for added drag in maximum-rate descents. In vortex surfing tests performed by C-17s, up to 10% fuel savings were reported.Drinnon, Roger. [http://www.af.mil/news/story.asp?id=123321609 \"'Vortex surfing' could be revolutionary.\"]  U.S. Air Force, 11 October 2012. Retrieved: 23 November 2012.\n\nFor cargo operations the C-17 requires a crew of three: pilot, copilot, and loadmaster. The cargo compartment is 88 ft long by 18 ft wide by 12 ft high. The cargo floor has rollers for palletized cargo but it can be flipped to provide a flat floor suitable for vehicles and other rolling stock. Cargo is loaded through a large aft ramp that accommodates rolling stock, such as a 69-ton (63-metric ton) M1 Abrams main battle tank, other armored vehicles, trucks, and trailers, along with palletized cargo.\n\nMaximum payload of the C-17 is , and its maximum takeoff weight is . With a payload of  and an initial cruise altitude of , the C-17 has an unrefueled range of about  on the first 71 aircraft, and  on all subsequent extended-range models that include a sealed center wing bay as a fuel tank. Boeing informally calls these aircraft the C-17 ER.[http://www.boeing.com/commercial/airports/arff/arffc17.pdf \"C-17/C-17 ER Flammable Material Locations.\"]  Boeing, 1 May 2005. The C-17's cruise speed is about 450 kn (Mach 0.74). It is designed to airdrop 102 paratroopers and their equipment.[http://www.af.mil/AboutUs/FactSheets/Display/tabid/224/Article/104523/c-17-globemaster-iii.aspx \"C-17 fact sheet.\"] US Air Force. Retrieved 4 September 2013. The U.S. Army's canceled Ground Combat Vehicle was to be transported by the C-17.\n\nThe C-17 is designed to operate from runways as short as  and as narrow as 90 ft. In addition, the C-17 can operate from unpaved, unimproved runways (although with greater chance of damage to the aircraft). The thrust reversers can be used to move the aircraft backwards and reverse direction on narrow taxiways using a three- (or more) point turn. The plane is designed for 20 man-hours of maintenance per flight hour, and a 74% mission availability rate.\n\nOperational history\n\nUnited States Air Force\n\nThe first production C-17 was delivered to Charleston Air Force Base, South Carolina, on 14 July 1993. The first C-17 squadron, the 17th Airlift Squadron, became operationally ready on 17 January 1995.Norton 2001, pp. 94–95. The C-17 has broken 22 records for oversized payloads.[http://www.boeing.com/news/releases/2001/q4/nr_011128n.htm \"Boeing C-17 Globemaster III Claims 13 World Records.\"]  Boeing, 28 November 2001. The C-17 was awarded U.S. aviation's most prestigious award, the Collier Trophy, in 1994.[http://www.naa.aero/html/awards/index.cfm?cmsid\n150 \"Collier Trophy, 1990–1999 winners.\"] National Aeronautic Association. Retrieved: 1 April 2010. A Congressional report on operations in Kosovo and Operation Allied Force noted \"One of the great success stories...was the performance of the Air Force's C-17A\"Department of Defense 2000, p. 39. The C-17 flew half of the strategic airlift missions in the operation, the type could use small airfields, easing operations; rapid turnaround times also led to efficient utilization.Department of Defense 2000, p. 40.\n\nOn March 26, 2003, nearly 1,000 U.S. service members were parachuted into the Kurdish-controlled area of northern Iraq during Operation Northern Delay in support of Operation Iraqi Freedom.  This was the first combat insertion of paratroopers using the C-17.\n\nIn 2006, eight C-17s were delivered to March Joint Air Reserve Base, California; controlled by the Air Force Reserve Command (AFRC), assigned to the 452d Air Mobility Wing; and subsequently assigned to AMC's 436th Airlift Wing and its AFRC \"associate\" unit, the 512th Airlift Wing, at Dover Air Force Base, Delaware, supplementing the Lockheed C-5 Galaxy. The Mississippi Air National Guard, 172 Airlift Group received their first C-17 in 2006.  The only Guard Unit to receive sequential serial number aircraft. The Mississippi Air Guard currently operates 8 C-17 aircraft.  In 2011, the New York Air National Guard's 105th Airlift Wing at Stewart Air National Guard Base, New York, transitioned from the C-5 to the C-17.[http://www.105aw.ang.af.mil/history/index.asp \"105th Airlift Wing, New York Air National Guard – History\"] . Retrieved 3 March 2014.\n\nC-17s delivered military goods and humanitarian aid during Operation Enduring Freedom in Afghanistan and Operation Iraqi Freedom in Iraq as well as humanitarian missions in the immediate aftermath of the 2010 Haiti earthquake, the 2011 Sindh floods delivering thousands of food rations, tons of medical and emergency supplies. On 26 March 2003, 15 USAF C-17s participated in the biggest combat airdrop since the United States invasion of Panama in December 1989: the night-time airdrop of 1,000 paratroopers from the 173rd Airborne Brigade occurred over Bashur, Iraq. The airdrop of paratroopers were followed by C-17s ferrying M1 Abrams, M2 Bradleys, M113s and artillery.Anderson, Jon R. [http://www.stripes.com/news/1st-id-task-force-s-tanks-deployed-to-northern-iraq-1.4187 \"1st ID task force's tanks deployed to northern Iraq.\"] Stars and Stripes, 10 April 2003. Retrieved: 8 June 2011. USAF C-17s have also been used to assist allies in their airlift requirements, including Canadian vehicles to Afghanistan in 2003 and Australian forces during the Australian-led military deployment to East Timor in 2006. In 2006, USAF C-17s flew 15 Canadian Leopard C2 tanks from Kyrgyzstan into Kandahar in support of NATO's Afghanistan mission. In 2013, five USAF C-17s supported French operations in Mali, operating with other nations' C-17s (RAF, NATO and RCAF deployed a single C-17 each).\n\nA C-17 accompanies the President of the United States on his visits to both domestic and foreign arrangements, consultations, and meetings. The C-17 is used to transport the Presidential Limousine and security detachments.[http://nl.newsbank.com/nl-search/we/Archives?p_productNewsLibrary&p_multi\nAPAB&d_placeAPAB&p_theme\nnewslibrary2&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n10526128375A9604&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM \"New Mexico Airport runway damaged by President's Cargo Plane.\"] Associated Press, 1 September 2004. There have been several occasions when a C-17 has been used to transport the President himself, temporarily gaining the Air Force One call sign while doing so.[http://nl.newsbank.com/nl-search/we/Archives?p_productPD&s_site\ntwincities&p_multiSP&p_theme\nrealcities&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n0EDCB9D2E176DD80&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM  \"C-17 proves its worth in Bosnian Supply effort.\"] St Paul Pioneer, 16 February 1996.\n\nThere was debate over follow-on C-17 orders, Air Force having requested line shutdown while Congress attempted to reinstate production. In FY2007, the Air Force requested $1.6 billion in response to \"excessive combat use\" on the C-17 fleet.Fulghum, D., A. Butler and D. Barrie. [http://awin.aviationweek.com/ArticlesStory.aspx?id\nb9a164fd-807b-4404-8224-f386cc54691f\"Boeing's C-17 wins against EADS' A400.\"] Aviation Week & Space Technology, 13 March 2006, p. 43. In 2008, USAF General Arthur Lichte, Commander of Air Mobility Command, indicated before a House of Representatives subcommittee on air and land forces a need to extend production to another 15 aircraft to increase the total to 205. Pending the delivery of the results of two studies in 2009, Lichte observed that the production line may remain open for further C-17s to satisfy airlift requirements.Trimble, Stephen. [http://www.flightglobal.com/articles/2008/04/04/222723/usaf-reveals-c-17-cracks-and-dispute-on-production-future.html \"USAF reveals C-17 cracks and dispute on production future.\"] Flightglobal.com, 4 April 2008. The USAF eventually decided to cap its C-17 fleet at 223 aircraft; its final delivery was on 12 September 2013.Mai, Pat. [http://www.ocregister.com/articles/boeing-524848-force-air.html \"Air Force to receive its last C-17 today\"] \"OrangeCountRegister.com,12 September 2013.\n\nRoyal Air Force\n\nBoeing has marketed the C-17 to many European nations including Belgium, Germany, France, Italy, Spain and the United Kingdom. The Royal Air Force (RAF) has established an aim of having interoperability and some weapons and capabilities commonality with the USAF. The 1998 Strategic Defence Review identified a requirement for a strategic airlifter. The Short-Term Strategic Airlift (STSA) competition commenced in September of that year, however tendering was canceled in August 1999 with some bids identified by ministers as too expensive, including the Boeing/BAe C-17 bid, and others unsuitable.O'Connell, Dominic. \"Political clash haunts MoD deal decision.\" The Business (Sunday Business Group), 5 December 1999. The project continued, with the C-17 seen as the favorite. In the light of Airbus A400M delays, the UK Secretary of State for Defence, Geoff Hoon, announced in May 2000 that the RAF would lease four C-17s at an annual cost of £100 million from Boeing for an initial seven years with an optional two-year extension. The RAF had the option to buy or return the aircraft to Boeing. The UK committed to upgrading its C-17s in line with the USAF so that if they were returned, the USAF could adopt them. The lease agreement restricted the operational use of the C-17s, meaning that the RAF could not use them for para-drop, airdrop, rough field, low-level operations and air to air refuelling.\n\nThe first C-17 was delivered to the RAF at Boeing's Long Beach facility on 17 May 2001 and flown to RAF Brize Norton by a crew from No. 99 Squadron. The RAF's fourth C-17 was delivered on 24 August 2001. The RAF aircraft were some of the first to take advantage of the new center wing fuel tank found in Block 13 aircraft. In RAF service, the C-17 has not been given an official service name and designation (for example, C-130J referred to as Hercules C4 or C5), but is referred to simply as the C-17 or \"C-17A Globemaster\".\n\nThe RAF declared itself delighted with the C-17. Although the Globemaster fleet was to be a fallback for the A400M, the Ministry of Defence (MoD) announced on 21 July 2004 that they had elected to buy their four C-17s at the end of the lease,[http://www.flightglobal.com/news/articles/review-turns-up-the-heat-on-eurofighter-186087/ \"Review turns up the heat on eurofighter\"]. Flight International, 22 July 2004. even though the A400M appeared to be closer to production. The C-17 gives the RAF strategic capabilities that it would not wish to lose, for example a maximum payload of  compared to the A400M's . The C-17's capabilities allow the RAF to use it as an airborne hospital for medical evacuation missions.\"[http://www.channel4.com/programmes/the-air-hospital The Air Hospital]\" Channel 4, 25 March 2010. Retrieved: 10 October 2012.\n\nAnother C-17 was ordered in August 2006, and delivered on 22 February 2008. The four leased C-17s were to be purchased later in 2008.Hoyle, Craig. [http://www.flightglobal.com/articles/2008/04/07/222815/pictures-uk-receives-fifth-c-17-as-raf-fleet-passes-40000-flight.html \"UK receives fifth C-17, as RAF fleet passes 40,000 flight hours.\"] FlightGlobal.com, 14 April 2008. Because of fears that the A400M may suffer further delays, the MoD announced in 2006 that it planned to acquire three more C-17s, for a total of eight, with delivery in 2009–2010. On 26 July 2007, Defence Secretary Des Browne announced that the MoD intended to order a sixth C-17 to boost operations in Iraq and Afghanistan.[http://www.mod.uk/DefenceInternet/DefenceNews/EquipmentAndLogistics/BrownePurchaseOfExtraC17WillsignificantlyBoostUkMilitaryOperations.htm \"Browne: Purchase of extra C-17 will 'significantly boost' UK military operations.\"] UK Ministry of Defence, 27 July 2007.  On 3 December 2007, the MoD announced a contract for a sixth C-17,[http://www.mod.uk/DefenceInternet/DefenceNews/EquipmentAndLogistics/RafGetsSixthC17Globemaster.htm \"RAF gets sixth C-17 Globemaster.\"] UK Ministry of Defence, 4 December 2007. which was received on 11 June 2008.[http://www.boeing.com/news/releases/2008/q2/080611c_nr.html \"Boeing delivers 6th C-17 to Royal Air Force.\"]  Boeing, 11 June 2008.\n\nOn 18 December 2009, Boeing confirmed that the RAF had ordered a seventh C-17,[http://www.airforcesmonthly.com/view_news.asp?ID1298 \"RAF to get 7th C-17.\"]  AirForces Monthly, 18 December 2009.Drelling, Jerry and Madonna Walsh. [http://boeing.mediaroom.com/index.php?s43&item\n1000 \"Royal Air Force to Acquire 7th Boeing C-17 Globemaster III.\"] Boeing, 17 December 2009. which was delivered on 16 November 2010.Drelling, Jerry and Madonna Walsh. [http://boeing.mediaroom.com/index.php?s\n43&item=1523 \"Boeing delivers UK Royal Air Force's 7th C-17 Globemaster III.\"]  Boeing, 16 November 2010.  The UK announced the purchase of its eighth C-17 in February 2012.Hoyle, Craig. [http://www.flightglobal.com/news/articles/uk-to-buy-eighth-c-17-transport-367960/ \"UK to buy eighth C-17 transport\"]. Flight International, 8 February 2012. The RAF showed interest in buying a ninth C-17 in November 2013.[http://www.defensenews.com/article/20131124/DEFREG01/311240001/UK-Shows-Interest-Buying-Another-C-17 \"UK Shows Interest in Buying Another C-17\"] DefenseNews 24 November 2013.\n\nOn 13 January 2013, the RAF deployed two C-17s of No. 99 Squadron from RAF Brize Norton to the French Évreux Air Base. The aircraft transported French armored vehicles to the Malian capital of Bamako during the French Intervention in Mali. In June 2015, an RAF C-17 was used to medically evacuate four victims of the 2015 Sousse attacks from Tunisia.\n\nRoyal Australian Air Force\n\nThe Royal Australian Air Force (RAAF) began investigating an acquisition of heavy lift aircraft for strategic transport in 2005.McLaughlin 2008, pp. 40–41. In late 2005 the then Minister for Defence Robert Hill stated that such aircraft were being considered due to the limited availability of strategic airlift aircraft from partner nations and air freight companies. The C-17 was considered to be favored over the A400M as it was a \"proven aircraft\" and in production. One major RAAF requirement was the ability to airlift the Army's M1 Abrams tanks; another requirement was immediate delivery. Though unstated, commonality with the USAF and the United Kingdom's RAF was also considered advantageous. RAAF aircraft were ordered directly from the USAF production run and are identical to American C-17 even in paint scheme, the only difference being the national markings. This allowed delivery to commence within nine months of commitment to the program.\"Stock Standard\". Aviation Week & Space Technology, 11 December 2006.\n\nOn 2 March 2006, the Australian government announced the purchase of three aircraft and one option with an entry into service date of 2006. In July 2006 a fixed price contract was awarded to Boeing to deliver four C-17s for  ().[http://www.defenseindustrydaily.com/australia-to-spend-up-to-15-bn-on-4-c17s-updated-01971/ \"Heavy Lifting Down Under: Australia Buys C-17s.\"] Defense Industry Daily, 27 November 2012. Australia also signed a US$80.7M contract to join the global 'virtual fleet' C-17 sustainment programMcLaughlin 2008, p. 42. and the RAAF's C-17s will receive the same upgrades as the USAF's fleet.McLaughlin 2008, p. 46.\n\nThe Royal Australian Air Force took delivery of its first C-17 in a ceremony at Boeing's plant at Long Beach, California on 28 November 2006.[http://www.boeing.com/defense-space/military/c17/news/2006/q4/061128b_nr.html \"Boeing delivers Royal Australian Air Force's First C-17.\"] Boeing,  28 November 2010. Retrieved: 13 August 2010. Several days later the aircraft flew from Hickam Air Force Base, Hawaii to Defence Establishment Fairbairn, Canberra, arriving on 4 December 2006. The aircraft was formally accepted in a ceremony at Fairbairn shortly after arrival.[http://www.defence.gov.au/minister/49tpl.cfm?CurrentId=6212 \"First C-17 arrives in Australia.\"] Australian Government: The Hon. Dr Brendan Nelson, Minister for Defence, 4 December 2006.  The second aircraft was delivered to the RAAF on 11 May 2007 and the third was delivered on 18 December 2007. The fourth Australian C-17 was delivered on 19 January 2008.[http://www.tamilsydney.com/content/view/1133/1/ \"Air Force's C-17 fleet delivered on time, on budget.\"] The Hon. Greg Combet MP, Parliamentary Secretary for Defence Procurement, 18 January 2008. Retrieved: 1 July 2011. All the Australian C-17s are operated by No. 36 Squadron and are based at RAAF Base Amberley in Queensland.[https://web.archive.org/web/20080329050815/http://www.raaf.gov.au/aircraft/globemaster.htm \"C-17 Globemaster heavy transport.\"] Royal Australian Air Force, 29 March 2008.\n\nOn 18 April 2011, Boeing announced that Australia had signed an agreement with the U.S. government to acquire a fifth C-17 due to an increased demand for humanitarian and disaster relief missions.[http://boeing.mediaroom.com/index.php?s43&item\n1709 \"Boeing, Australia Announce Order for 5th C-17 Globemaster III.\"] Boeing Press Release, 18 April 2011. The aircraft was delivered to the RAAF on 14 September 2011.[http://australianaviation.com.au/2011/09/fifth-raaf-c-17-delivered/ \"Fifth RAAF C-17 delivered.\"]  Australian Aviation, 23 September 2011. Retrieved: 15 September 2011. On 23 September 2011, Australian Minister for Defence Materiel Jason Clare announced that the government was seeking information from the U.S. about the price and delivery schedule for a sixth Globemaster.Clare, Jason. [http://www.minister.defence.gov.au/2011/09/23/minister-for-defence-materiel-sixth-c-17a-globemaster-iii-–-letter-of-request/ \"Sixth C-17A Globemaster III – Letter of Request.\"] Department of Defence. Retrieved: 23 September 2011. In November 2011, Australia requested a sixth C-17 through the U.S. Foreign Military Sales program; it was ordered in June 2012, and was delivered on 1 November 2012.[http://www.minister.defence.gov.au/2012/03/19/minister-for-defence-and-minister-for-defence-materiel-joint-media-release-purchase-of-additional-c17/ \"Purchase of additional C17.\"]  Minister for Defence and Minister for Defence Materiel – joint media release, 20 March 2012.[http://www.defenseindustrydaily.com/australia-to-spend-up-to-15-bn-on-4-c17s-updated-01971/ \"Heavy Lifting Down Under: Australia Buys C-17s.\"] defenseindustrydaily.com, 20 June 2012. Retrieved: 10 July 2012.\n\nAustralia's C-17s have supported ADF operations around the world, including supporting Air Combat Group training deployments to the U.S., transporting Royal Australian Navy Sea Hawk helicopters and making fortnightly supply missions to Australian forces in Iraq and Afghanistan. The C-17s have also carried humanitarian supplies to Papua New Guinea during Operation Papua New Guinea Assist in 2007, supplies and South African Puma helicopters to Burma in 2008 following Cyclone Nargis,McLaughlin 2008, p. 45. relief supplies to Samoa following the 2009 earthquake, aid packages around Queensland following the 2010–2011 floods and Cyclone Yasi, and rescue teams and equipment to New Zealand following the February 2011 Christchurch earthquake, and equipment after the 2011 Tōhoku earthquake and tsunami from Western Australia to Japan. In July 2014, an Australian C-17 transported several bodies of victims of Malaysia Airlines Flight 17 from Ukraine to the Netherlands.\n\nIn August 2014, Defence Minister David Johnston announced the intention to purchase one or two additional C-17s.  On 3 October 2014, Johnston announced the government's approval to buy two C-17s at a total cost of  (). The United States Congress approved the sale under the Foreign Military Sales program.[http://www.news.com.au/technology/design/abbott-government-to-spend-500-million-on-two-new-boeing-c17-heavylift-transport-jets/story-fnpjxnlk-1227078035546 Abbott Government to spend $500 million on two new Boeing C-17 heavy-lift transport jets]. Retrieved on 12 October 2014.[http://www.flightglobal.com/news/articles/australia-to-buy-up-to-four-more-c-17s-404418/ Australia to buy up to four more C-17s]. Retrieved on 12 October 2014.   Prime Minister Tony Abbott confirmed in April 2015 that two additional aircraft are to be ordered, with both delivered by November 4, 2015; these are to add to the six C-17s it has .\n\nRoyal Canadian Air Force\n\nThe Canadian Forces has had a long-standing need for strategic airlift for humanitarian and military operations around the world. It had followed a pattern similar to the German Air Force in leasing Antonovs and Ilyushins for many of its needs, including deploying the Disaster Assistance Response Team (DART) to tsunami-stricken Sri Lanka in 2005. The Canadian Forces was forced to rely entirely on leased An-124 Ruslan for a Canadian Army deployment to Haiti in 2003. A combination of leased Ruslans, Ilyushins and USAF C-17s was also used to move heavy equipment into Afghanistan. In 2002, the Canadian Forces Future Strategic Airlifter Project began to study alternatives, including long-term leasing arrangements.Whelan, Peter. [http://ploughshares.ca/pl_publications/strategic-lift-capacity-for-canada/ \"Strategic lift capacity for Canada.\"] The Ploughshares Monitor, Volume 26, Issue 2, Summer 2005.\n\nOn 5 July 2006, the Canadian government issued a notice that it intended to negotiate directly with Boeing to procure four airlifters for the Canadian Forces Air Command (Royal Canadian Air Force after August 2011).[http://www.merx.com/English/SUPPLIER_Menu.Asp?WCEShow&TAB\n1&State7&id\nPW-%24SSC-004-13706&hcodelZi0smL%2fmio4eGxwwqDpfg%3d%3d Airlift Capability Project – Strategic ACP-S – ACAN] MERX Website – Government of Canada On 1 February 2007, Canada awarded a contract for four C-17s with delivery beginning in August 2007.[http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20070202/oconnor_plane_070202/20070202?hub\nCanada \"O'Connor announces military plane purchase\".] CTV.ca, 2 February 2007. Like Australia, Canada was granted airframes originally slated for the U.S. Air Force, to accelerate delivery.Wastnage, J. [http://www.flightglobal.com/articles/2007/02/05/211969/canada-gets-usaf-slots-for-august-delivery-after-signing-for-four-boeing-c-17s-in-20-year-c4bn.html \"Canada gets USAF slots for August delivery after signing for four Boeing C-17s in 20-year C$4bn deal, settles provincial workshare squabble.\"] Flight International, 5 February 2007. Retrieved: 1 July 2011.\n\nOn 23 July 2007, the first Canadian C-17 made its initial flight.[http://boeingnews.web.boeing.com/archive/07_07/072507/070725a_c17_p2.html \"Canada One C-17 makes first flight.\"] Boeing, 25 July 2007. It was turned over to Canada on 8 August,[http://www.boeing.com/defense-space/military/c17/news/2007/q3/070808c_nr.html \"Boeing delivers Canada's First C-17.\"] Boeing, 8 August 2007. and participated at the Abbotsford International Airshow on 11 August prior to arriving at its new home base at 8 Wing, CFB Trenton, Ontario on 12 August.[http://www.airforce.forces.gc.ca/site/newsroom/news_e.asp?id4120 \"First CC-177 Globemaster III Receives Patriotic and Enthusiastic Welcome.\"]  Department of National Defence. Retrieved: 2 August 2012. Its first operational mission was delivery of disaster relief to Jamaica following Hurricane Dean.[http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20070824/globemaster_070824/20070824?hub\nCanada \"New military aircraft leaves on aid mission.\"] Cnews.com, 24 August 2007. The second C-17 arrived at 8 Wing, CFB Trenton on 18 October 2007. The last of the initial four aircraft was delivered in April 2008.[http://www.airforce.forces.gc.ca/site/newsroom/news_e.asp?cat\n114&id=5802 \"Canada takes delivery of final CC-177.\"]  Canadian Forces, 3 April 2008. The official Canadian designation is CC-177 Globemaster III.[http://www.rcaf-arc.forces.gc.ca/v2/equip/cc177/index-eng.asp \"Aircraft – CC-177 Globemaster III.\"]  Royal Canadian Air Force, 15 January 2010. The aircraft are assigned to 429 Transport Squadron based at CFB Trenton.\n\nOn 14 April 2010, a Canadian C-17 landed for the first time at CFS Alert, the world's most northerly airport.[http://www.airforce.forces.gc.ca/v2/nr-sp/index-eng.asp?id=10443 \"Top of the world welcomes CC-177 Globemaster III.\"]  airforce.forces.gc.ca. Retrieved: 18 August 2011. Canadian Globemasters have been deployed in support of numerous humanitarian and military missions worldwide, including Operation Hestia after the earthquake in Haiti, providing airlift as part of Operation Mobile and support to the Canadian mission in Afghanistan. After Typhoon Haiyan hit the Philippines in 2013, Canadian C-17s established an air bridge between the two nations, deploying Canada's DART Team and delivering humanitarian supplies and equipment. In 2014, they supported Operation Reassurance and Operation Impact.\n\nOn 19 December 2014, it was reported that Canada's Defence Department intended to purchase one more C-17. On 30 March 2015, Canada's fifth C-17 arrived at CFB Trenton.\n\nStrategic Airlift Capability program\n\nAt the 2006 Farnborough Airshow, a number of NATO member nations signed a letter of intent to jointly purchase and operate several C-17s within the Strategic Airlift Capability (SAC). SAC members are Bulgaria, Estonia, Hungary, Lithuania, the Netherlands, Norway, Poland, Romania, Slovenia, the U.S., along with two Partnership for Peace countries Finland and Sweden as of 2010.[http://www.nato.int/issues/strategic-lift-air-sac/index.html \"Strategic Airlift Capability: A key capability for the Alliance.\"] NATO. Retrieved: 1 April 2010.  The purchase was for two C-17s, and a third was contributed by the U.S. On 14 July 2009, Boeing delivered the first C-17 under the SAC program. The second and third C-17s were delivered in September and October 2009.Hoyle, Craig. [http://www.flightglobal.com/articles/2009/07/15/329668/pictures-boeing-delivers-first-c-17-for-nato-led-heavy-airlift-wing.html \"Boeing delivers first C-17 for NATO-led Heavy Airlift Wing.\"]  Flight International, 15 July 2009.Drelling, Jerry and Eszter Ungar.[http://boeing.mediaroom.com/index.php?s43&item\n870 \"3rd Boeing C-17 Joins 12-Nation Strategic Airlift Capability Initiative.\"] Boeing, 7 October 2009.\n\nThe SAC C-17s are based at Pápa Air Base, Hungary. The Heavy Airlift Wing is hosted by Hungary, which acts as the flag nation.[http://www.heavyairliftwing.org/background \"Background.\"] Heavy Airlift Wing. Retrieved: 2 August 2012.  The aircraft are manned in similar fashion as the NATO E-3 AWACS aircraft.[http://www.e3a.nato.int/ \"NATP Airborne Early Warning & Control Force: E-3A Component.\"] NATO. Retrieved: 1 April 2010.  The C-17 flight crew are multi-national, but each mission is assigned to an individual member nation based on the SAC's annual flight hour share agreement. The NATO Airlift Management Programme Office (NAMPO) provides management and support for the Heavy Airlift Wing. NAMPO is a part of the NATO Support Agency (NSPA). In September 2014, Boeing stated that the three C-17s supporting SAC missions had achieved a readiness rate of nearly 94 percent over the last five years and supported over 1,000 missions.\n\nIndian Air Force\n\nIn June 2009, the Indian Air Force (IAF) selected the C-17 for its Very Heavy Lift Transport Aircraft requirement to replace several types of transport aircraft.[https://www.reuters.com/article/2009/06/16/us-airshow-boeing-c17-sb-idUSTRE55F3TC20090616 \"Boeing says C-17 orders to extend line.\"] Reuters, 16 June 2009. Retrieved: 1 July 2011. In January 2010, India requested 10 C-17s through the U.S.'s Foreign Military Sales program,Mathews, Neelam. [http://www.aviationweek.com/aw/generic/story.jsp?id\nnews/awx/2010/01/08/awx_01_08_2010_p0-195411.xml&headlineIndia%20Requests%20Boeing%20C-17s&channel\ndefense \"India Requests Boeing C-17s.\"] Aviation Week, 8 January 2010. the sale was approved by Congress in June 2010.[http://www.sify.com/news/us-congress-clears-c-17-sale-for-india-news-international-kgcnOdacjcb.html \"US Congress clears C-17 sale for India.\"] Deccan Chronicle, 18 August 2011. On 23 June 2010, the Indian Air Force successfully test-landed a USAF C-17 at the Gaggal Airport, India to complete the IAF's C-17 trials.[http://www.janes.com/news/defence/jdw/jdw100705_1_n.shtml \"IAF completes C-17 test-flight.\"] Jane's Information Group, 5 July 2010. In February 2011, the IAF and Boeing agreed terms for the order of 10 C-17s[http://articles.economictimes.indiatimes.com/2011-03-17/news/29138728_1_il-76-iaf-chief-marshal-pv-naik \"IAF finalises order for 10 C-17 strategic airlifters.\"] The Times of India, 17 March 2011. Retrieved: 1 July 2011. with an option for six more; the US$4.1 billion order was approved by the Indian Cabinet Committee on Security on 6 June 2011.Prasad, K.V. [http://www.hindu.com/2011/06/07/stories/2011060765092000.htm \"India to buy C-17 heavy-lift transport aircraft from U.S.\"] The Hindu, 7 June 2011. Retrieved: 7 June 2011.[http://www.livemint.com/Companies/6uAPJaguKDn2s1jpL6gAUN/India8217s-4-bn-order-to-support-jobs-at-Boeing8217s.html \"India's $4-Bn Order To Support Jobs At Boeing.\"] BusinessWeek, 7 June 2011. Deliveries began in June 2013 and were to continue to 2014.[http://pib.nic.in/newsite/erelease.aspx?relid78432 \"Purchase of Transport Aircraft.\"] pib.nic.in, 12 December 2011. Retrieved: 2 August 2012. In 2012, the IAF reportedly finalized plans to buy six more C-17s in its five-year plan for 2017–2022.[http://economictimes.indiatimes.com/news/economy/policy/india-to-buy-more-than-16-c-17-airlifters/articleshow/8850290.cms \"India to buy more than 16 C-17 airlifters.\"] Economictimes.indiatimes.com. Retrieved: 2 August 2012.  However, this option is no longer available since C-17 production ended in 2015.\n\nThe aircraft provides strategic airlift and the ability to deploy special forces, such as during national emergencies.Knowles, Victoria. [http://www.armedforces-int.com/news/c-17-globemaster-for-indian-air-force.html \"C-17 Globemaster for Indian Air Force.\"] Armed Forces International, 1 August 2012. They are operated in diverse terrain – from Himalayan air bases in North India at 13000 ft to Indian Ocean bases in South India. The C-17s are based at Hindon Air Force Station and are operated by No. 81 Squadron IAF Skylords.[http://articles.economictimes.indiatimes.com/2011-07-10/news/29758116_1_american-defence-major-boeing-indian-air-force-iaf Indian Air Force IAF.\"] India Times, 10 July 2010. The first C-17 was delivered in January 2013 for testing and training;[http://www.defensenews.com/article/20130124/DEFREG03/301240018/1st-C-17-Airlifter-8216-Delivered-8217-Indian-Officials \"1st C-17 Airlifter ‘Delivered’ to Indian Officials\"]. Defense News, 24 January 2013. it was officially accepted on 11 June 2013.[http://boeing.mediaroom.com/index.php?s\n43&item2697 \"Boeing Transfers 1st C-17 to Indian Air Force\"]. Boeing, 11 June 2013. The second C-17 was delivered on 23 July 2013 and put into service immediately. IAF Chief of Air Staff Norman AK Browne called the Globemaster III \"a major component in the IAF's modernization drive\" while taking delivery of the aircraft at Boeing's Long Beach factory. On 2 September 2013, the Skylords squadron with three C-17s officially entered IAF service.[http://www.armedforces-int.com/news/c-17-globemaster-iii-joins-indian-air-force.html \"C-17 Globemaster III Joins Indian Air Force\"]. Armedforces-Int.com, 2 September 2013\n\nThe Skylords regularly fly missions within India, such as to high-altitude bases at Leh and Thoise. The IAF first used the C-17 to transport an infantry battalion's equipment to Port Blair on Andaman Islands on 1 July 2013. Foreign deployments to date include Tajikistan in August 2013, and Rwanda to support Indian peacekeepers. One C-17 was used for transporting relief materials during Cyclone Phailin. The fifth aircraft was received in November 2013. The sixth aircraft was received in July 2014.\n\nIn June 2017, the U.S. Department of State approved the potential sale of one C-17 to India under a proposed $366 million U.S. Foreign Military Sale that includes spare parts and support.  This aircraft was the last C-17 produced.  The sale, if finalized, would increase the Indian Air Force's fleet to 11 C-17s.\n\nQatar \n\nBoeing delivered Qatar's first C-17 on 11 August 2009 and the second on 10 September 2009 for the Qatar Emiri Air Force.Drelling, Jerry and Lorenzo Cortes. [http://boeing.mediaroom.com/index.php?s43&item\n832 \"Boeing Delivers Qatar's 2nd C-17 Globemaster III.\"] Boeing, 10 September 2009. Qatar received its third C-17 in 2012, and fourth C-17 was received on 10 December 2012. In June 2013, the New York Times reported that Qatar was allegedly using its C-17s to ship weapons from Libya to the Syrian opposition during the civil war via Turkey.  On 15 June 2015, it was announced at the Paris Airshow that Qatar agreed to order four additional C-17s from the five remaining \"white tail\" C-17s to double Qatar's C-17 fleet.\n\nUnited Arab Emirates \n\nIn February 2009, the United Arab Emirates Air Force agreed to purchase four C-17s.Trimble, Stephen. [http://www.flightglobal.com/articles/2009/02/25/323068/uae-strengthens-airlift-capacity-with-c-130j-c-17-deals.html \"UAE strengthens airlift capacity with C-130J, C-17 deals.\"] Flight International, 25 February 2009. In January 2010, a contract was signed for six C-17s.[http://boeing.mediaroom.com/index.php?s43&item\n1019 \"Boeing, United Arab Emirates Announce Order for 6 C-17s\"]. Boeing, 6 January 2010. In May 2011, the first C-17 was handed over and the last of the six was received in June 2012.[http://www.flightglobal.com/articles/2011/05/11/356496/pictures-uae-receives-first-c-17-transport.html \"UAE receives first C-17 transport.\"] flightglobal.com, 11 May 2011.[http://boeing.mediaroom.com/index.php?s43&item\n2300 \"Boeing Delivers UAE Air Force and Air Defence's 6th C-17.\"] Boeing, 20 June 2012.\n\nOthers and potential operators  \n\nKuwait requested the purchase of one C-17 in September 2010 and a second in April 2013 through the U.S.'s Foreign Military Sales (FMS) program.[http://www.dsca.mil/major-arms-sales/kuwait-c-17-globemaster-iii \"Kuwait – C-17 GLOBEMASTER III.\"] U.S. Defense Security Cooperation Agency, 17 April 2013. The nation ordered two C-17s; the first was delivered on 13 February 2014.[http://boeing.mediaroom.com/Boeing-Delivers-Kuwait-Air-Force-s-1st-C-17-Globemaster-III \"Boeing Delivers Kuwait Air Force’s 1st C-17 Globemaster III\"]. Boeing, 13 February 2014.\n\nThe United States Antarctic Program uses C-17s through the United States Air Force for transportation from Christchurch to McMurdo Station, generally shuttling scientific equipment, food and water, and scientific personnel. The New York Air National Guard also operates Lockheed HC-130 aircraft for further transportation.\n\nIn 2015 New Zealand Defence Force was considering the purchase of two C-17s for the Royal New Zealand Air Force at an estimated cost of $600 million to replace its aging C-130s. However, the New Zealand Government eventually decided not to acquire any Globemasters.\n\nVariants\n\n*C-17A: Initial military airlifter version.\n*C-17A \"ER\": Unofficial name for C-17As with extended range due to the addition of the center wing tank. This upgrade was incorporated in production beginning in 2001 with Block 13 aircraft.Norton 2001, p. 93.\n*C-17B: A proposed tactical airlifter version with double-slotted flaps, an additional main landing gear on the center fuselage, more powerful engines, and other systems for shorter landing and take-off distances.Trimble, Stephen. [https://www.flightglobal.com/news/articles/boeing-offers-c-17b-as-piecemeal-upgrade-314814/ \"Boeing offers C-17B as piecemeal upgrade.\"] Flight International, 19 August 2008. Boeing offered the C-17B to the U.S. military in 2007 for carrying the Army's Future Combat Systems (FCS) vehicles and other equipment.Trimble, Stephen. [http://www.flightglobal.com/articles/2007/10/16/218272/boeing-offers-c-17b-to-us-army.html \"Boeing offers C-17B to US Army.\"] Flight International, 16 October 2007.\n*MD-17: Proposed variant for civilian operators,Sillia, George. [http://www.boeing.com/news/releases/1997/news_release_970828n.html \"MD-17 Receives FAA Certification.\"]  Boeing, 28 August 1997. later redesignated as BC-17 after 1997 merger.Saling, Bob. [http://www.boeing.com/news/releases/2000/news_release_000928a.html \"Boeing Is Undisputed Leader In Providing Air Cargo Capacity (Boeing proposes BC-17X).\"]  Boeing 28 September 2000.\n\nOperators\n\n;\n* Royal Australian Air Force – 8 C-17A ERs in service.\n** No. 36 Squadron[http://www.defence.gov.au/news/raafnews/editions/4804/topstories/story02.htm \"Master plan for C-17s.\"]  Air Force News, Volume 48, No. 4, 23 March 2006.\n;\n* Royal Canadian Air Force – 5 CC-177 (C-17A ER) aircraft in use.\n** 429 Transport Squadron, CFB Trenton[http://www.forces.gc.ca/site/newsroom/view_news_e.asp?id=2389 \"Canada's New Government Re-Establishes Squadron to Support C-17 Aircraft.\"]  Canadian Department of National Defence, 18 July 2007. \n;\n* Indian Air Force – 10 C-17sTNT News. [http://thenortheasttoday.com/indian-air-force-warrior-sentinels-c-17-globemaster/ \"Indian Air Force Warrior Sentinels: C-17 Globemaster\"] The North East Today, 28 April 2015. Retrieved: 9 June 2015.\n** No. 81 Squadron IAFSkylords, Hindon AFS\n; NATO\n* NATO Strategic Airlift Capability Heavy Airlift Wing – 3 C-17s in service,[http://boeing.mediaroom.com/index.php?s43&item\n764 \"Multinational Alliance's 1st Boeing C-17 Joins Heavy Airlift Wing in Hungary.\"] Boeing,  27 July 2009. including 1 C-17 contributed by the USAF.[http://boeing.mediaroom.com/index.php?s43&item\n870 \"3rd Boeing C-17 Joins 12-Nation Strategic Airlift Capability Initiative.\"] Boeing, 7 October 2009. and based at Pápa Air Base, Hungary.\n;\n* Kuwait Air Force – 2 C-17s\n;\n*Qatari Emiri Air Force – 4 C-17As in use 4 on order[http://boeing.mediaroom.com/2015-06-15-Boeing-Qatar-Confirm-Purchase-of-Four-C-17s \"Boeing, Qatar Confirm Purchase of Four C-17s.\"] Boeing, 15 June 2015.\n;\n*United Arab Emirates Air Force – 6 C-17As in service 2 on order[http://worlddefencenews.blogspot.co.uk/2015/02/united-arab-emirates-announce-purchase.html \"United Arab Emirates announce purchase of two C-17 airlifters and nine AW139 helicopters.\"] World Defence News, 26 February 2015.\n;\n* Royal Air Force – 8 C-17A ERsWall, Robert. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channeldefense&id\nnews/asd/2012/02/09/05.xml&headline=U.K.%20Adds%20Eighth%20C-17 \"Aerospace Daily and Defense Report: U.K. Adds Eighth C-17.\"] Aviation Week, 9 February 2012. Retrieved: 10 February 2012.\n** No. 99 Squadron, RAF Brize Norton\n\n;\n\nUnited States Air Force- 213 C-17s in service total (187 Active, 12 Air National Guard, 14 Air Force Reserve)\n\nAir Mobility Command\n*60th Air Mobility Wing – Travis AFB, California\n:21st Airlift Squadron\n*62d Airlift Wing – McChord AFB, Washington\n:4th Airlift Squadron\n:7th Airlift Squadron\n:8th Airlift Squadron\n*305th Air Mobility Wing – McGuire AFB, New Jersey\n:6th Airlift Squadron\n*385th Air Expeditionary Group – Al Udeid Air Base, Qatar\n:816th Expeditionary Airlift Squadron \n*436th Airlift Wing – Dover AFB, Delaware\n:3d Airlift Squadron\n*437th Airlift Wing – Charleston AFB, South Carolina\n:14th Airlift Squadron\n:15th Airlift Squadron\n:16th Airlift Squadron\nPacific Air Forces\n*3d Wing – Elmendorf AFB, Alaska\n:517th Airlift Squadron (Associate)\n*15th Wing – Hickam AFB, Hawaii\n:535th Airlift Squadron\nAir Education and Training Command\n*97th Air Mobility Wing – Altus AFB, Oklahoma\n:58th Airlift Squadron\nAir Force Materiel Command\n*412th Test Wing – Edwards AFB, California\n:418th Flight Test Squadron\nAir Force Reserve Command\n*315th Airlift Wing (Associate) – Charleston AFB, South Carolina\n:300th Airlift Squadron\n:317th Airlift Squadron\n:701st Airlift Squadron\n*349th Air Mobility Wing (Associate) – Travis AFB, California\n:301st Airlift Squadron\n*445th Airlift Wing – Wright-Patterson AFB, Ohio\n:89th Airlift Squadron\n*446th Airlift Wing (Associate) – McChord AFB, Washington\n:97th Airlift Squadron\n:313th Airlift Squadron\n:728th Airlift Squadron\n*452d Air Mobility Wing – March ARB, California\n:729th Airlift Squadron\n*507th Air Refueling Wing – Tinker AFB, Oklahoma\n:730th Air Mobility Training Squadron (Altus AFB)\n*512th Airlift Wing (Associate) – Dover AFB, Delaware\n:326th Airlift Squadron\n*514th Air Mobility Wing (Associate) – McGuire AFB, New Jersey\n:732d Airlift Squadron\nAir National Guard\n*105th Airlift Wing – Stewart ANGB, New York\n:137th Airlift Squadron\n*154th Wing – Hickam AFB, Hawaii\n:204th Airlift Squadron (Associate)\n*164th Airlift Wing – Memphis, Tennessee\n:155th Airlift Squadron\n*167th Airlift Wing – Martinsburg, West Virginia\n:167th Airlift Squadron\n*172d Airlift Wing – Jackson, Mississippi\n:183d Airlift Squadron\n*176th Wing – Elmendorf AFB, Alaska\n:144th Airlift Squadron\n\nAccidents and notable incidents \n\n* On 10 September 1998, a U.S. Air Force C-17 (AF Serial No.96-0006) delivered Keiko the whale to Vestmannaeyjar, Iceland, a 3800 ft runway, and suffered a landing gear failure during landing. There were no injuries, but the aircraft received major damage to the landing gear. After receiving temporary repairs, the C-17 was flown to another city in Iceland for further repairs.[http://www.mcchordairmuseum.org/REV%20B%20OUR%20HISTORY%20%20NAME%20C-17%2096-0006%20SP%20OF%20BERLIN.htm \"C-17A S/N 96-0006.\"] McChord Air Museum. Retrieved: 2 August 2012.[https://archive.is/20120529185612/http://findarticles.com/p/articles/mi_6712/is_24_203/ai_n28736153/ \"C-17 Accident During Whale Lift Due To Design Flaw.\"] findarticles.com. Retrieved: 2 August 2012.\n* On 10 December 2003, a U.S. Air Force C-17 (AF Serial No. 98-0057) was hit by a surface-to-air missile after take-off from Baghdad, Iraq. One engine was disabled and the aircraft returned for a safe landing.[http://aviation-safety.net/database/record.php?id=20031209-0 \"Information on 98-0057 incident.\"] Aviation-Safety.net. Retrieved: 2 August 2012. The aircraft was repaired and returned to service.[http://www.airliners.net/open.file/0614580/M/ \"C-17, tail 98-0057 image from 2004.\"] airliners.net. Retrieved: 2 August 2012.\n* On 6 August 2005, a U.S. Air Force C-17 (AF Serial No. 01-0196) ran off the runway at Bagram Air Base in Afghanistan while attempting to land, destroying the aircraft's nose and main landing gear.[http://www.defendamerica.mil/articles/aug2005/a080905wm5.html \"Bagram Runway Reopens After C-17 Incident.\"]  DefendAmerica News Article. Retrieved: 2 August 2012. It took two months to make the aircraft flightworthy. The aircraft was flown to Boeing's Long Beach facility by a test pilot, as the temporary repairs imposed performance limitations.[http://www.boeing.com/news/frontiers/archive/2006/february/i_ids1.html \"The Big Fix.\"] Boeing Frontiers Online, February 2006. In October 2006, the aircraft returned to service after receiving repairs.\n* On 30 January 2009, a U.S. Air Force C-17 (AF Serial No. 96-0002 – \"Spirit of the Air Force\") made a gear-up landing at Bagram Air Base.[http://www.af.mil/news/story.asp?id=123133880 \"Bagram Air Base runway recovery.\"] US Air Force, 4 February 2009.  The C-17 was ferried from Bagram AB, making several stops along the way, to Boeing's Long Beach plant for extensive repairs. The USAF Aircraft Accident Investigation Board concluded the cause was the crew's failure to lower the landing gear, having not followed the pre-landing checklist.\n* On 28 July 2010, a U.S. Air Force C-17 (AF Serial No. 00-0173 – \"Spirit of the Aleutians\") crashed at Elmendorf Air Force Base, Alaska, while practicing for the 2010 Arctic Thunder Air Show, killing all four aboard.[http://www.pacaf.af.mil/shared/media/document/AFD-101214-048.pdf USAF Aircraft Accident Investigation Board Report for Incident of 28 July 2010] , retrieved 8 July 2017.[http://www.cbsnews.com/news/four-dead-in-alaska-air-force-base-crash \"Four Dead in Alaska Air Force Base Crash.\"]  CBS News, 29 July 2010.  The C-17 crashed near a railroad, disrupting rail operations.[http://www.adn.com/2010/07/29/1387215/fatal-c-17-crash-also-damaged.html \"Arctic Thunder to continue after 4 died.\"]  adn.com, 30 July 2010.  A military investigative report determined that a stall caused by pilot error led to the crash.[http://www.cnn.com/2010/US/12/11/alaska.plane.crash/ \"Pilot error cause of Alaska cargo plane crash, report concludes.\"] CNN, 11 December 2010. Retrieved: 1 July 2011. This is the only fatal C-17 crash and its only hull-loss incident.\n* On 23 January 2012, a U.S. Air Force C-17 (AF Serial No. 07-7189), assigned to the 437th Airlift Wing, Joint Base Charleston, South Carolina, landed on runway 34R at Forward Operating Base Shank, Afghanistan; however, the pilot and copilot did not realize their required stopping distance was longer than the runway and were unable to stop before departing the prepared surface. The C-17 struck an embankment, and came to rest approximately 700 feet from the end of runway.  The aircraft sustained major structural damage but no injuries were reported. After 9 months of repairs to make the C-17 airworthy, it departed FOB Shank for Boeing's factory at Long Beach, California. After another 22 months of overhauls, totaling $69.4 million, the aircraft returned to service.\n\nSpecifications (C-17)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Boeing C-17 Globemaster III" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6731" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Boeing C-17 Globemaster III is a large military transport aircraft. It was developed for the United States Air Force (USAF) from the 1980s to the early 1990s by McDonnell Douglas. The C-17 carries forward the name of two previous piston-engined military cargo aircraft, the Douglas C-74 Globemaster and the Douglas C-124 Globemaster II. The C-17 commonly performs tactical and strategic airlift missions, transporting troops and cargo throughout the world; additional roles include medical evacuation and airdrop duties. It was designed to replace the Lockheed C-141 Starlifter, and also fulfill some of the duties of the Lockheed C-5 Galaxy, freeing the C-5 fleet for outsize cargo.\n\nBoeing, which merged with McDonnell Douglas in 1997, continued to manufacture C-17s for export customers following the end of deliveries to the U.S. Air Force. Aside from the United States, the C-17 is in service with the United Kingdom, Australia, Canada, Qatar, United Arab Emirates, NATO Heavy Airlift Wing, India, and Kuwait. The final C-17 was completed at the Long Beach, California plant and flown on 29 November 2015.\n\nDevelopment\n\nBackground and design phase\n\nIn the 1970s, the U.S. Air Force began looking for a replacement for its Lockheed C-130 Hercules tactical cargo aircraft.[https://pqasb.pqarchiver.com/djreprints/access/72923084.html?dids72923084:72923084&FMT\nABS&FMTSABS:AI&type\nhistoric&dateNov+13%2C+1972&author\n&pubWall+Street+Journal&desc\nAir+Force+Lets+Advanced+STOL+Prototype+Work&pqatlgoogle \"Air Force Lets Advanced STOL Prototype Work.\"] Wall Street Journal, 13 November 1972.  The Advanced Medium STOL Transport (AMST) competition was held, with Boeing proposing the YC-14, and McDonnell Douglas proposing the YC-15.Miles, Marvin. [https://pqasb.pqarchiver.com/latimes/access/660687842.html?dids\n660687842:660687842&FMTABS&FMTS\nABS:AI&typehistoric&date\nNov+11%2C+1972&author&pub\nLos+Angeles+Times&descMcDonnell%2C+Boeing+to+Compete+for+Lockheed+C-130+Successor&pqatl\ngoogle \"McDonnell, Boeing to Compete for Lockheed C-130 Successor.\"] Los Angeles Times, 11 November 1972.  Though both entrants exceeded specified requirements, the AMST competition was canceled before a winner was selected. The Air Force started the C-X program in November 1979 to develop a larger AMST with longer range to augment its strategic airlift.Kennedy 2004, pp. 3–20, 24.\n\nBy 1980, the USAF found itself with a large fleet of aging C-141 Starlifter cargo aircraft. Compounding matters, USAF needed increased strategic airlift capabilities to fulfill its rapid-deployment airlift requirements. The USAF set mission requirements and released a request for proposals (RFP) for C-X in October 1980. McDonnell Douglas elected to develop a new aircraft based on the YC-15, under Program Manager Joe Van Dyke. Boeing bid an enlarged three-engine version of its AMST YC-14. Lockheed submitted two designs, a C-5-based design and an enlarged C-141 design. On 28 August 1981, McDonnell Douglas was chosen to build its proposed aircraft, then designated C-17. Compared to the YC-15, the new aircraft differed in having swept wings, increased size, and more powerful engines.Norton 2001, pp. 12–13.  This would allow it to perform the work done by the C-141, and to fulfill some of the duties of the Lockheed C-5 Galaxy, freeing the C-5 fleet for outsize cargo.\n\nAlternative proposals were pursued to fill airlift needs after the C-X contest. These were lengthening of C-141As into C-141Bs, ordering more C-5s, continued purchases of KC-10s, and expansion of the Civil Reserve Air Fleet. Limited budgets reduced program funding, requiring a delay of four years. During this time contracts were awarded for preliminary design work and for the completion of engine certification.  In December 1985, a full-scale development contract was awarded, under Program Manager Bob Clepper. [https://pqasb.pqarchiver.com/newsday/access/98482212.html?dids\n98482212:98482212&FMTABS&FMTS\nABS:FT&typecurrent&date\nJan+03%2C+1986&authorThe+Los+Angeles+Times&pub\nNewsday+(Combined+editions)&descDouglas+Wins+%243.4B+Pact+to+Build+C-17&pqatl\ngoogle  \"Douglas Wins $3.4B Pact to Build C-17.\"] Los Angeles Times, 3 January 1986.  At this time, first flight was planned for 1990.Norton 2001, pp. 13, 15.  The Air Force had formed a requirement for 210 aircraft.Kennedy 2004, pp. 70, 81–83.\n\nDevelopment problems and limited funding caused delays in the late 1980s.Kennedy, Betty Raab. [http://rtoc.ida.org/rtoc/open/briefings_articles/kennednd.pdf \"Historical Realities of C-17 Program Pose Challenge for Future Acquisitions.\"]  Institute for Defense Analyses, December 1999.  Criticisms were made of the developing aircraft and questions were raised about more cost-effective alternatives during this time.Fuller, Richard L. [https://pqasb.pqarchiver.com/chicagotribune/access/24563333.html?dids24563333:24563333&FMT\nABS&FMTSABS:FT&type\ncurrent&dateSep+09%2C+1989&author\nCol.+Richard+L.+Fuller%2C+Director+of+public+affairs%2C+United+States+Air+Force.&pubChicago+Tribune+(pre-1997+Fulltext)&desc\nMore+load+for+the+buck+with+C-17&pqatlgoogle \"More load for the buck with C-17.\"] Chicago Tribune, 9 September 1989.Sanford, Robert. [http://nl.newsbank.com/nl-search/we/Archives?p_product\nSL&p_themesl&p_action\nsearch&p_maxdocs200&p_topdoc\n1&p_text_direct-00EB04C1540E361A8&p_field_direct-0\ndocument_id&p_perpage10&p_sort\nYMD_date:D&s_trackvalGooglePM \"McDonnell Plugs Away on C-17.\"] St. Louis Post-Dispatch, 3 April 1989.  In April 1990, Secretary of Defense Dick Cheney reduced the order from 210 to 120 aircraft.Brenner, Eliot. [https://news.google.com/newspapers?nid\n799&dat19900426&id\nGJVTAAAAIBAJ&sjidFogDAAAAIBAJ&pg\n6880,2683844 \"Cheney cuts back on Air Force programs.\"] Bryan Times, 26 April 1990.  The maiden flight of the C-17 took place on 15 September 1991 from the McDonnell Douglas's plant in Long Beach, California, about a year behind schedule.[https://www.nytimes.com/1991/09/17/us/c-17-s-first-flight-smoother-than-debate.html \"C-17's First Flight Smoother Than Debate.\"] The New York Times, 17 September 1991. The first aircraft (T-1) and five more production models (P1-P5) participated in extensive flight testing and evaluation at Edwards Air Force Base.[http://opencrs.com/document/RL30685 \"RL30685, Military Airlift: C-17 Aircraft Program.\"] Congressional Research Service, 5 June 2007.  Two complete airframes were built for static and repeated load testing.Norton 2001, pp. 25–26, 28.\n\nDevelopment difficulties\n\nA static test of the C-17 wing in October 1992 resulted in the wing failing at 128% of design limit load, which was below the 150% requirement. Both wings buckled rear to the front and failures occurred in stringers, spars and ribs.[http://www.dodig.mil/Audit/Audit2/93-159.pdf \"Technical Assessment Report; C-17 Wing Structural Integrity.\"] Department of Defense, 24 August 1993. Retrieved: 23 August 2011. Some $100 million were spent to redesign the wing structure; the wing failed at 145% during a second test in September 1993.[http://community.seattletimes.nwsource.com/archive/?date19930914&slug\n1721000 \"C-17 Wing Fails Again; Probe Is Sought.\"] Seattle Times, 14 September 1993. Retrieved: 23 August 2011. A careful review of the test data, however, showed that the wing was not loaded correctly and did indeed meet the requirement.[http://documents.blackvault.com/documents/dod/readingroom/5/767.pdf \"Findings, Conclusions and Recommendations of the Executive Independent Review Team.\"] US Government Executive Independent Review Team via blackvault.com, 12 December 1993. Retrieved: 23 August 2011.  The C-17 received the \"Globemaster III\" name in early 1993. In late 1993, the Department of Defense gave the contractor two years to solve production and cost overrun problems or face termination of the contract after the delivery of the 40th aircraft.Evans, David. [https://pqasb.pqarchiver.com/chicagotribune/access/24383613.html?dids\n24383613:24383613&FMTABS&FMTS\nABS:FT&typecurrent&date\nMar+29%2C+1993&authorDavid+Evans%2C+Chicago+Tribune.&pub\nChicago+Tribune+(pre-1997+Fulltext)&descPentagon+to+Air+Force%3A+C-17+flunks&pqatl\ngoogle \"Pentagon to Air Force: C-17 flunks.\"] Chicago Tribune, 29 March 1993.  By accepting the 1993 terms, McDonnell Douglas incurred a loss of nearly US$1.5 billion on the development phase of the program.\n\nIn April 1994, the C-17 program remained over budget, and did not meet weight, fuel burn, payload and range specifications. It failed several key criteria during airworthiness evaluation tests.[http://community.seattletimes.nwsource.com/archive/?date19910528&slug\n1285732 \"Air Force Letter To Douglas Spells Out 75 Defects For C-17.\"] Los Angeles Times, 28 May 1991.[http://nl.newsbank.com/nl-search/we/Archives?p_productLB&p_theme\nlb&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n0EAE8F93D6E54ED8&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM \"C-17 fails engine start test.\"] Press-Telegram, 12 April 1994.[http://nl.newsbank.com/nl-search/we/Archives?p_productCO&s_site\ncharlotte&p_multiCO&p_theme\nrealcities&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n0EB6CC1343F2E14F&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM \"Parts Orders for C-17 far too high, GAO says.\"] Charlotte Observer, 16 March 1994. Technical problems were found with the mission software, landing gear, and other areas.[http://archive.gao.gov/t2pbat3/151473.pdf \"The C-17 Proposed Settlement and Program Update.\"] United States General Accounting Office,  28 April 1994. In May 1994, it was proposed to cut production to as few as 32 aircraft; these cuts were later rescinded.Kreisher, Otto. [https://pqasb.pqarchiver.com/sandiego/access/1242506621.html?dids1242506621:1242506621&FMT\nABS&FMTSABS:FT&type\ncurrent&dateMay+25%2C+1994&author\nOTTO+KREISHER&pubThe+San+Diego+Union+-+Tribune&desc\nHouse+rescinds+cuts+in+C-17+program+%7C+Vote+may+help+thousands+retain+jobs+in+Long+Beach&pqatlgoogle \"House rescinds cuts in C-17 program.\"] San Diego Union, 25 May 1994. A July 1994 GAO document revealed that Air Force and DoD studies from 1986 and 1991 stated the C-17 could use 6,400 more runways outside the U.S. than the C-5; it was discovered that these studies only considered runway dimensions, but not runway strength or Load Classification Numbers (LCN). The C-5 has a lower LCN, but the USAF classifies both in the same broad Load Classification Group. When considering runway dimensions and load ratings, the C-17's worldwide runway advantage over the C-5 shrank from 6,400 to 911 airfields.[http://archive.gao.gov/t2pbat3/152088.pdf \"Comparison of C-5 and C-17 Airfield Availability.\"] United States General Accounting Office, July 1994. The C-17's ability to use low quality, austere airfields was not considered.\n\nA January 1995 GAO report stated that the USAF originally planned to order 210 C-17s at a cost of $41.8 billion, and that the 120 aircraft on order were to cost $39.5 billion based on a 1992 estimate.[http://www.gao.gov/archive/1995/ns95026.pdf \"C-17 Aircraft – Cost and Performance Issues.\"] United States General Accounting Office, January 1995.  In March 1994, the U.S. Army decided it did not need the 60000 lb low-altitude parachute extraction system (LAPES) delivery with the C-17 and that the C-130's 42000 lb capability was sufficient. C-17 testing was limited to this lower weight. Airflow issues prevented the C-17 from meeting airdrop requirements. A February 1997 GAO report revealed that a C-17 with a full payload could not land on 3000 ft wet runways; simulations suggested a distance of 5000 ft was required.[http://www.gao.gov/archive/1997/ns97050.pdf \"C-17 Globemaster – Support of Operation Joint Endeavor.\"] United States General Accounting Office, February 1997. The YC-15 was transferred to AMARC to be made flightworthy again for further flight tests for the C-17 program in March 1997.Bonny et al. 2006, p. 65. In 1995, most of the problems had been reportedly resolved.[http://www.afa.org/media/press/windall.asp \"Air Force Secretary Says Modernization, C-17 on Track.\"]  Air Force magazine, 19 September 1995.[http://nl.newsbank.com/nl-search/we/Archives?p_productLB&p_theme\nlb&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n0EAE901FCF584869&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM \"Future Brightens for C-17 Program.\"] Press-Telegram, 31 March 1995. The first C-17 squadron was declared operational by the USAF in January 1995.[http://nl.newsbank.com/nl-search/we/Archives?p_productSL&p_theme\nsl&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n0EB082E680DBFA28&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM \"Air Force fills Squadron of C-17s .\"] Associated Press, 18 January 1995.\n\nProduction and deliveries\n\nIn 1996, DoD ordered another 80 aircraft for a total of 120.Kilian, Michael. [https://pqasb.pqarchiver.com/chicagotribune/access/17166359.html?dids17166359:17166359&FMT\nABS&FMTSABS:FT&type\ncurrent&dateJun+01%2C+1996&author\nMichael+Kilian%2C+Washington+Bureau.&pubChicago+Tribune+(pre-1997+Fulltext)&desc\nIN+RECORD+PROCUREMENT+U.S.+ORDERS+80+C-17S+PLANE+DEAL+GOOD+FOR+2%2C000+JOBS+IN+CALIFORNIA&pqatlgoogle \"In Record Procurement U.S. Orders 80 C17s – Plane Good Deal for 2,000 jobs in California.\"] Chicago Tribune, 1 July 1996. In 1997 McDonnell Douglas merged with its former competitor, Boeing. In April 1999, Boeing proposed to cut the price of the C-17 if the Air Force bought 60 more,Wallace, James. [http://www.highbeam.com/doc/1G1-64094695.html \"Boeing to cut price of C-17 if Air Force buys 60 more.\"] Seattle Post, 2 April 1999. and in August 2002, the order was increased to 180 aircraft.[https://www.nytimes.com/2002/08/16/business/9.7-billion-us-deal-for-boeing-c-17-s.html \"$9.7 Billion U.S. Deal for Boeing C-17's.\"] The New York Times, 16 August 2002. In 2007, 190 C-17s were on order for the USAF.[http://www.boeing.com/defense-space/military/c17/c17news.html \"Boeing Company Funds Extension.\"] Boeing, 9 July 2008. On 6 February 2009, Boeing was awarded a $2.95 billion contract for 15 additional aircraft, increasing the total USAF C-17 fleet to 205 and extending production from August 2009 to August 2010.Trimble, Stephen. [http://www.flightglobal.com/articles/2009/02/10/322315/usaf-signs-deals-for-15-more-c-17s-upgraded-c-5ms.html \"Boeing in $3bn air force contract.\"] Flight International, 10 February 2009. On 6 April 2009, U.S. Secretary of Defense Robert Gates stated that there would be no more C-17s ordered beyond the 205 planned.Cole, August and Yochi J. Dreazen. \"Pentagon Pushes Weapon Cuts.\" The Wall Street Journal, 7 April 2009, p. 1. However, on 12 June 2009, the House Armed Services Air and Land Forces Subcommittee added a further 17 C-17s.Kreisher, Otto. [http://www.govexec.com/dailyfed/0609/061209cdpm1.htm \"House panel reverses cuts in aircraft programs.\"] Congress Daily, 12 June 2009.\n\nIn 2010, Boeing reduced the C-17 production rate to 10 aircraft per year from a high of 16 per year. This was due to dwindling orders and to extend the life of the production line while additional international orders were sought. The workforce was reduced by approximately 1,100 through 2012, and a second shift at the Long Beach assembly plant was also eliminated.Vivanco, Fernando and Jerry Drelling. [http://boeing.mediaroom.com/index.php?s43&item\n1588 \"Boeing C-17 Program Enters 2nd Phase of Production Rate and Work Force Reductions.\"] Boeing Press Release, 20 January 2011. By April 2011, 230 production C-17s had been delivered, including 210 to the USAF.Hoyle, Craig. [http://www.flightglobal.com/articles/2011/04/19/355726/australia-to-get-fifth-c-17-in-august.html \"Australia to get fifth C-17 in August.\"] Flightglobal, 19 April 2011. The C-17 prototype \"T-1\" was retired in 2012 after being used by the USAF for testing and development.Sanchez, Senior Airman Stacy. [http://www.edwards.af.mil/news/story.asp?id=123090905 \"Edwards T-1 reaches 1,000 flight milestone.\"]  95th Air Base Wing Public Affairs, 20 March 2008.  In January 2010, the USAF announced the end of Boeing's performance-based logistics contracts to maintain the aircraft.[http://www.flightglobal.com/articles/2010/05/18/341939/why-is-usaf-bringing-maintenance-in-house.html \"Why is USAF bringing maintenance in-house?\"] flightglobal.com, 18 May 2005. Retrieved: 18 August 2011. On 19 June 2012, the USAF ordered its 224th and final C-17, as a replacement for an aircraft that crashed in Alaska in July 2010.Miller, Seth and Michael C. Sirak. [http://www.airforce-magazine.com/DRArchive/Pages/2012/June%202012/June%2020%202012/EndoftheLine.aspx \"Likely End of the Line for The Air Force C-17 Production.\"] Air Force Magazine, 20 June 2012.\n\nIn September 2013, Boeing announced that C-17 production was starting to close down. In October 2014, the main wing spar of the 279th and last aircraft was completed; this C-17  was delivered in 2015, after which Boeing will close the Long Beach plant.The World, Aviation Week and Space Technology, August 4, 2014, p.10 Production of spare components shall continue until at least 2017. The C-17 is projected to be in service for several decades.[http://www.chicagotribune.com/business/breaking/la-fi-boeing-long-beach-20130919-story.html#page1 \"Boeing to shut C-17 plant in Long Beach\"] Chicago Tribune, 18 September 2013.[http://www.militarytimes.com/article/20130918/NEWS04/309180036/Boeing-end-C-17-production-2015 \"Boeing to end C-17 production in 2015\"]. Militarytimes.com, 18 September 2013. In February 2014, Boeing was engaged in sales talks with \"five or six\" countries for the remaining 15 C-17s, \"two to four\" of which are not current operators,[http://www.flightglobal.com/news/articles/singapore-boeing-confident-of-placing-unsold-c-17s-395826/ \"Boeing confident of placing unsold C-17s\"]. Flightglobal.com, 11 February 2014. and Boeing decided to build 10 aircraft without confirmed buyers in anticipation of future purchases. , five aircraft found buyers, including two for the Middle East, two for Australia and one for Canada.\n\nIn May 2015, the Wall Street Journal reported that Boeing expected to book a charge of under $100 million and cut 3,000 positions associated with the C-17 program. Teal Group analyst Richard Aboulafia suggested that Airbus' lower cost A400M Atlas has taken international sales away from the C-17.Shukla, Tarun. \"A forlorn end to California's aviation glory\". Wall Street Journal, 6 May 2015, pp. B1-2.\n\nSources: C-17 Globemaster III Pocket Guide,\"C-17 Globemaster III Pocket Guide\", The Boeing Company, Long Beach, CA, June 2010 Boeing IDS Major Deliveries[http://www.boeing.com/bds/deliveries.html \"BDS Major Deliveries (current year).\"]  Boeing, March 2014. Retrieved: 5 April 2014.\n\nDesign\n\nThe C-17 is 174 ft long and has a wingspan of about 170 ft. It can airlift cargo fairly close to a battle area. The size and weight of U.S. mechanized firepower and equipment have grown in recent decades from increased air mobility requirements, particularly for large or heavy non-palletized outsize cargo.\n\nThe C-17 is powered by four Pratt & Whitney F117-PW-100 turbofan engines, which are based on the commercial Pratt and Whitney PW2040 used on the Boeing 757. Each engine is rated at  of thrust. The engine's thrust reversers direct engine exhaust air upwards and forward, reducing the chances of foreign object damage by ingestion of runway debris, and providing enough reverse thrust to back the aircraft up on the ground while taxiing. The thrust reversers can also be used in flight at idle-reverse for added drag in maximum-rate descents. In vortex surfing tests performed by C-17s, up to 10% fuel savings were reported.Drinnon, Roger. [http://www.af.mil/news/story.asp?id=123321609 \"'Vortex surfing' could be revolutionary.\"]  U.S. Air Force, 11 October 2012. Retrieved: 23 November 2012.\n\nFor cargo operations the C-17 requires a crew of three: pilot, copilot, and loadmaster. The cargo compartment is 88 ft long by 18 ft wide by 12 ft high. The cargo floor has rollers for palletized cargo but it can be flipped to provide a flat floor suitable for vehicles and other rolling stock. Cargo is loaded through a large aft ramp that accommodates rolling stock, such as a 69-ton (63-metric ton) M1 Abrams main battle tank, other armored vehicles, trucks, and trailers, along with palletized cargo.\n\nMaximum payload of the C-17 is , and its maximum takeoff weight is . With a payload of  and an initial cruise altitude of , the C-17 has an unrefueled range of about  on the first 71 aircraft, and  on all subsequent extended-range models that include a sealed center wing bay as a fuel tank. Boeing informally calls these aircraft the C-17 ER.[http://www.boeing.com/commercial/airports/arff/arffc17.pdf \"C-17/C-17 ER Flammable Material Locations.\"]  Boeing, 1 May 2005. The C-17's cruise speed is about 450 kn (Mach 0.74). It is designed to airdrop 102 paratroopers and their equipment.[http://www.af.mil/AboutUs/FactSheets/Display/tabid/224/Article/104523/c-17-globemaster-iii.aspx \"C-17 fact sheet.\"] US Air Force. Retrieved 4 September 2013. The U.S. Army's canceled Ground Combat Vehicle was to be transported by the C-17.\n\nThe C-17 is designed to operate from runways as short as  and as narrow as 90 ft. In addition, the C-17 can operate from unpaved, unimproved runways (although with greater chance of damage to the aircraft). The thrust reversers can be used to move the aircraft backwards and reverse direction on narrow taxiways using a three- (or more) point turn. The plane is designed for 20 man-hours of maintenance per flight hour, and a 74% mission availability rate.\n\nOperational history\n\nUnited States Air Force\n\nThe first production C-17 was delivered to Charleston Air Force Base, South Carolina, on 14 July 1993. The first C-17 squadron, the 17th Airlift Squadron, became operationally ready on 17 January 1995.Norton 2001, pp. 94–95. The C-17 has broken 22 records for oversized payloads.[http://www.boeing.com/news/releases/2001/q4/nr_011128n.htm \"Boeing C-17 Globemaster III Claims 13 World Records.\"]  Boeing, 28 November 2001. The C-17 was awarded U.S. aviation's most prestigious award, the Collier Trophy, in 1994.[http://www.naa.aero/html/awards/index.cfm?cmsid\n150 \"Collier Trophy, 1990–1999 winners.\"] National Aeronautic Association. Retrieved: 1 April 2010. A Congressional report on operations in Kosovo and Operation Allied Force noted \"One of the great success stories...was the performance of the Air Force's C-17A\"Department of Defense 2000, p. 39. The C-17 flew half of the strategic airlift missions in the operation, the type could use small airfields, easing operations; rapid turnaround times also led to efficient utilization.Department of Defense 2000, p. 40.\n\nOn March 26, 2003, nearly 1,000 U.S. service members were parachuted into the Kurdish-controlled area of northern Iraq during Operation Northern Delay in support of Operation Iraqi Freedom.  This was the first combat insertion of paratroopers using the C-17.\n\nIn 2006, eight C-17s were delivered to March Joint Air Reserve Base, California; controlled by the Air Force Reserve Command (AFRC), assigned to the 452d Air Mobility Wing; and subsequently assigned to AMC's 436th Airlift Wing and its AFRC \"associate\" unit, the 512th Airlift Wing, at Dover Air Force Base, Delaware, supplementing the Lockheed C-5 Galaxy. The Mississippi Air National Guard, 172 Airlift Group received their first C-17 in 2006.  The only Guard Unit to receive sequential serial number aircraft. The Mississippi Air Guard currently operates 8 C-17 aircraft.  In 2011, the New York Air National Guard's 105th Airlift Wing at Stewart Air National Guard Base, New York, transitioned from the C-5 to the C-17.[http://www.105aw.ang.af.mil/history/index.asp \"105th Airlift Wing, New York Air National Guard – History\"] . Retrieved 3 March 2014.\n\nC-17s delivered military goods and humanitarian aid during Operation Enduring Freedom in Afghanistan and Operation Iraqi Freedom in Iraq as well as humanitarian missions in the immediate aftermath of the 2010 Haiti earthquake, the 2011 Sindh floods delivering thousands of food rations, tons of medical and emergency supplies. On 26 March 2003, 15 USAF C-17s participated in the biggest combat airdrop since the United States invasion of Panama in December 1989: the night-time airdrop of 1,000 paratroopers from the 173rd Airborne Brigade occurred over Bashur, Iraq. The airdrop of paratroopers were followed by C-17s ferrying M1 Abrams, M2 Bradleys, M113s and artillery.Anderson, Jon R. [http://www.stripes.com/news/1st-id-task-force-s-tanks-deployed-to-northern-iraq-1.4187 \"1st ID task force's tanks deployed to northern Iraq.\"] Stars and Stripes, 10 April 2003. Retrieved: 8 June 2011. USAF C-17s have also been used to assist allies in their airlift requirements, including Canadian vehicles to Afghanistan in 2003 and Australian forces during the Australian-led military deployment to East Timor in 2006. In 2006, USAF C-17s flew 15 Canadian Leopard C2 tanks from Kyrgyzstan into Kandahar in support of NATO's Afghanistan mission. In 2013, five USAF C-17s supported French operations in Mali, operating with other nations' C-17s (RAF, NATO and RCAF deployed a single C-17 each).\n\nA C-17 accompanies the President of the United States on his visits to both domestic and foreign arrangements, consultations, and meetings. The C-17 is used to transport the Presidential Limousine and security detachments.[http://nl.newsbank.com/nl-search/we/Archives?p_productNewsLibrary&p_multi\nAPAB&d_placeAPAB&p_theme\nnewslibrary2&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n10526128375A9604&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM \"New Mexico Airport runway damaged by President's Cargo Plane.\"] Associated Press, 1 September 2004. There have been several occasions when a C-17 has been used to transport the President himself, temporarily gaining the Air Force One call sign while doing so.[http://nl.newsbank.com/nl-search/we/Archives?p_productPD&s_site\ntwincities&p_multiSP&p_theme\nrealcities&p_actionsearch&p_maxdocs\n200&p_topdoc1&p_text_direct-0\n0EDCB9D2E176DD80&p_field_direct-0document_id&p_perpage\n10&p_sortYMD_date:D&s_trackval\nGooglePM  \"C-17 proves its worth in Bosnian Supply effort.\"] St Paul Pioneer, 16 February 1996.\n\nThere was debate over follow-on C-17 orders, Air Force having requested line shutdown while Congress attempted to reinstate production. In FY2007, the Air Force requested $1.6 billion in response to \"excessive combat use\" on the C-17 fleet.Fulghum, D., A. Butler and D. Barrie. [http://awin.aviationweek.com/ArticlesStory.aspx?id\nb9a164fd-807b-4404-8224-f386cc54691f\"Boeing's C-17 wins against EADS' A400.\"] Aviation Week & Space Technology, 13 March 2006, p. 43. In 2008, USAF General Arthur Lichte, Commander of Air Mobility Command, indicated before a House of Representatives subcommittee on air and land forces a need to extend production to another 15 aircraft to increase the total to 205. Pending the delivery of the results of two studies in 2009, Lichte observed that the production line may remain open for further C-17s to satisfy airlift requirements.Trimble, Stephen. [http://www.flightglobal.com/articles/2008/04/04/222723/usaf-reveals-c-17-cracks-and-dispute-on-production-future.html \"USAF reveals C-17 cracks and dispute on production future.\"] Flightglobal.com, 4 April 2008. The USAF eventually decided to cap its C-17 fleet at 223 aircraft; its final delivery was on 12 September 2013.Mai, Pat. [http://www.ocregister.com/articles/boeing-524848-force-air.html \"Air Force to receive its last C-17 today\"] \"OrangeCountRegister.com,12 September 2013.\n\nRoyal Air Force\n\nBoeing has marketed the C-17 to many European nations including Belgium, Germany, France, Italy, Spain and the United Kingdom. The Royal Air Force (RAF) has established an aim of having interoperability and some weapons and capabilities commonality with the USAF. The 1998 Strategic Defence Review identified a requirement for a strategic airlifter. The Short-Term Strategic Airlift (STSA) competition commenced in September of that year, however tendering was canceled in August 1999 with some bids identified by ministers as too expensive, including the Boeing/BAe C-17 bid, and others unsuitable.O'Connell, Dominic. \"Political clash haunts MoD deal decision.\" The Business (Sunday Business Group), 5 December 1999. The project continued, with the C-17 seen as the favorite. In the light of Airbus A400M delays, the UK Secretary of State for Defence, Geoff Hoon, announced in May 2000 that the RAF would lease four C-17s at an annual cost of £100 million from Boeing for an initial seven years with an optional two-year extension. The RAF had the option to buy or return the aircraft to Boeing. The UK committed to upgrading its C-17s in line with the USAF so that if they were returned, the USAF could adopt them. The lease agreement restricted the operational use of the C-17s, meaning that the RAF could not use them for para-drop, airdrop, rough field, low-level operations and air to air refuelling.\n\nThe first C-17 was delivered to the RAF at Boeing's Long Beach facility on 17 May 2001 and flown to RAF Brize Norton by a crew from No. 99 Squadron. The RAF's fourth C-17 was delivered on 24 August 2001. The RAF aircraft were some of the first to take advantage of the new center wing fuel tank found in Block 13 aircraft. In RAF service, the C-17 has not been given an official service name and designation (for example, C-130J referred to as Hercules C4 or C5), but is referred to simply as the C-17 or \"C-17A Globemaster\".\n\nThe RAF declared itself delighted with the C-17. Although the Globemaster fleet was to be a fallback for the A400M, the Ministry of Defence (MoD) announced on 21 July 2004 that they had elected to buy their four C-17s at the end of the lease,[http://www.flightglobal.com/news/articles/review-turns-up-the-heat-on-eurofighter-186087/ \"Review turns up the heat on eurofighter\"]. Flight International, 22 July 2004. even though the A400M appeared to be closer to production. The C-17 gives the RAF strategic capabilities that it would not wish to lose, for example a maximum payload of  compared to the A400M's . The C-17's capabilities allow the RAF to use it as an airborne hospital for medical evacuation missions.\"[http://www.channel4.com/programmes/the-air-hospital The Air Hospital]\" Channel 4, 25 March 2010. Retrieved: 10 October 2012.\n\nAnother C-17 was ordered in August 2006, and delivered on 22 February 2008. The four leased C-17s were to be purchased later in 2008.Hoyle, Craig. [http://www.flightglobal.com/articles/2008/04/07/222815/pictures-uk-receives-fifth-c-17-as-raf-fleet-passes-40000-flight.html \"UK receives fifth C-17, as RAF fleet passes 40,000 flight hours.\"] FlightGlobal.com, 14 April 2008. Because of fears that the A400M may suffer further delays, the MoD announced in 2006 that it planned to acquire three more C-17s, for a total of eight, with delivery in 2009–2010. On 26 July 2007, Defence Secretary Des Browne announced that the MoD intended to order a sixth C-17 to boost operations in Iraq and Afghanistan.[http://www.mod.uk/DefenceInternet/DefenceNews/EquipmentAndLogistics/BrownePurchaseOfExtraC17WillsignificantlyBoostUkMilitaryOperations.htm \"Browne: Purchase of extra C-17 will 'significantly boost' UK military operations.\"] UK Ministry of Defence, 27 July 2007.  On 3 December 2007, the MoD announced a contract for a sixth C-17,[http://www.mod.uk/DefenceInternet/DefenceNews/EquipmentAndLogistics/RafGetsSixthC17Globemaster.htm \"RAF gets sixth C-17 Globemaster.\"] UK Ministry of Defence, 4 December 2007. which was received on 11 June 2008.[http://www.boeing.com/news/releases/2008/q2/080611c_nr.html \"Boeing delivers 6th C-17 to Royal Air Force.\"]  Boeing, 11 June 2008.\n\nOn 18 December 2009, Boeing confirmed that the RAF had ordered a seventh C-17,[http://www.airforcesmonthly.com/view_news.asp?ID1298 \"RAF to get 7th C-17.\"]  AirForces Monthly, 18 December 2009.Drelling, Jerry and Madonna Walsh. [http://boeing.mediaroom.com/index.php?s43&item\n1000 \"Royal Air Force to Acquire 7th Boeing C-17 Globemaster III.\"] Boeing, 17 December 2009. which was delivered on 16 November 2010.Drelling, Jerry and Madonna Walsh. [http://boeing.mediaroom.com/index.php?s\n43&item=1523 \"Boeing delivers UK Royal Air Force's 7th C-17 Globemaster III.\"]  Boeing, 16 November 2010.  The UK announced the purchase of its eighth C-17 in February 2012.Hoyle, Craig. [http://www.flightglobal.com/news/articles/uk-to-buy-eighth-c-17-transport-367960/ \"UK to buy eighth C-17 transport\"]. Flight International, 8 February 2012. The RAF showed interest in buying a ninth C-17 in November 2013.[http://www.defensenews.com/article/20131124/DEFREG01/311240001/UK-Shows-Interest-Buying-Another-C-17 \"UK Shows Interest in Buying Another C-17\"] DefenseNews 24 November 2013.\n\nOn 13 January 2013, the RAF deployed two C-17s of No. 99 Squadron from RAF Brize Norton to the French Évreux Air Base. The aircraft transported French armored vehicles to the Malian capital of Bamako during the French Intervention in Mali. In June 2015, an RAF C-17 was used to medically evacuate four victims of the 2015 Sousse attacks from Tunisia.\n\nRoyal Australian Air Force\n\nThe Royal Australian Air Force (RAAF) began investigating an acquisition of heavy lift aircraft for strategic transport in 2005.McLaughlin 2008, pp. 40–41. In late 2005 the then Minister for Defence Robert Hill stated that such aircraft were being considered due to the limited availability of strategic airlift aircraft from partner nations and air freight companies. The C-17 was considered to be favored over the A400M as it was a \"proven aircraft\" and in production. One major RAAF requirement was the ability to airlift the Army's M1 Abrams tanks; another requirement was immediate delivery. Though unstated, commonality with the USAF and the United Kingdom's RAF was also considered advantageous. RAAF aircraft were ordered directly from the USAF production run and are identical to American C-17 even in paint scheme, the only difference being the national markings. This allowed delivery to commence within nine months of commitment to the program.\"Stock Standard\". Aviation Week & Space Technology, 11 December 2006.\n\nOn 2 March 2006, the Australian government announced the purchase of three aircraft and one option with an entry into service date of 2006. In July 2006 a fixed price contract was awarded to Boeing to deliver four C-17s for  ().[http://www.defenseindustrydaily.com/australia-to-spend-up-to-15-bn-on-4-c17s-updated-01971/ \"Heavy Lifting Down Under: Australia Buys C-17s.\"] Defense Industry Daily, 27 November 2012. Australia also signed a US$80.7M contract to join the global 'virtual fleet' C-17 sustainment programMcLaughlin 2008, p. 42. and the RAAF's C-17s will receive the same upgrades as the USAF's fleet.McLaughlin 2008, p. 46.\n\nThe Royal Australian Air Force took delivery of its first C-17 in a ceremony at Boeing's plant at Long Beach, California on 28 November 2006.[http://www.boeing.com/defense-space/military/c17/news/2006/q4/061128b_nr.html \"Boeing delivers Royal Australian Air Force's First C-17.\"] Boeing,  28 November 2010. Retrieved: 13 August 2010. Several days later the aircraft flew from Hickam Air Force Base, Hawaii to Defence Establishment Fairbairn, Canberra, arriving on 4 December 2006. The aircraft was formally accepted in a ceremony at Fairbairn shortly after arrival.[http://www.defence.gov.au/minister/49tpl.cfm?CurrentId=6212 \"First C-17 arrives in Australia.\"] Australian Government: The Hon. Dr Brendan Nelson, Minister for Defence, 4 December 2006.  The second aircraft was delivered to the RAAF on 11 May 2007 and the third was delivered on 18 December 2007. The fourth Australian C-17 was delivered on 19 January 2008.[http://www.tamilsydney.com/content/view/1133/1/ \"Air Force's C-17 fleet delivered on time, on budget.\"] The Hon. Greg Combet MP, Parliamentary Secretary for Defence Procurement, 18 January 2008. Retrieved: 1 July 2011. All the Australian C-17s are operated by No. 36 Squadron and are based at RAAF Base Amberley in Queensland.[https://web.archive.org/web/20080329050815/http://www.raaf.gov.au/aircraft/globemaster.htm \"C-17 Globemaster heavy transport.\"] Royal Australian Air Force, 29 March 2008.\n\nOn 18 April 2011, Boeing announced that Australia had signed an agreement with the U.S. government to acquire a fifth C-17 due to an increased demand for humanitarian and disaster relief missions.[http://boeing.mediaroom.com/index.php?s43&item\n1709 \"Boeing, Australia Announce Order for 5th C-17 Globemaster III.\"] Boeing Press Release, 18 April 2011. The aircraft was delivered to the RAAF on 14 September 2011.[http://australianaviation.com.au/2011/09/fifth-raaf-c-17-delivered/ \"Fifth RAAF C-17 delivered.\"]  Australian Aviation, 23 September 2011. Retrieved: 15 September 2011. On 23 September 2011, Australian Minister for Defence Materiel Jason Clare announced that the government was seeking information from the U.S. about the price and delivery schedule for a sixth Globemaster.Clare, Jason. [http://www.minister.defence.gov.au/2011/09/23/minister-for-defence-materiel-sixth-c-17a-globemaster-iii-–-letter-of-request/ \"Sixth C-17A Globemaster III – Letter of Request.\"] Department of Defence. Retrieved: 23 September 2011. In November 2011, Australia requested a sixth C-17 through the U.S. Foreign Military Sales program; it was ordered in June 2012, and was delivered on 1 November 2012.[http://www.minister.defence.gov.au/2012/03/19/minister-for-defence-and-minister-for-defence-materiel-joint-media-release-purchase-of-additional-c17/ \"Purchase of additional C17.\"]  Minister for Defence and Minister for Defence Materiel – joint media release, 20 March 2012.[http://www.defenseindustrydaily.com/australia-to-spend-up-to-15-bn-on-4-c17s-updated-01971/ \"Heavy Lifting Down Under: Australia Buys C-17s.\"] defenseindustrydaily.com, 20 June 2012. Retrieved: 10 July 2012.\n\nAustralia's C-17s have supported ADF operations around the world, including supporting Air Combat Group training deployments to the U.S., transporting Royal Australian Navy Sea Hawk helicopters and making fortnightly supply missions to Australian forces in Iraq and Afghanistan. The C-17s have also carried humanitarian supplies to Papua New Guinea during Operation Papua New Guinea Assist in 2007, supplies and South African Puma helicopters to Burma in 2008 following Cyclone Nargis,McLaughlin 2008, p. 45. relief supplies to Samoa following the 2009 earthquake, aid packages around Queensland following the 2010–2011 floods and Cyclone Yasi, and rescue teams and equipment to New Zealand following the February 2011 Christchurch earthquake, and equipment after the 2011 Tōhoku earthquake and tsunami from Western Australia to Japan. In July 2014, an Australian C-17 transported several bodies of victims of Malaysia Airlines Flight 17 from Ukraine to the Netherlands.\n\nIn August 2014, Defence Minister David Johnston announced the intention to purchase one or two additional C-17s.  On 3 October 2014, Johnston announced the government's approval to buy two C-17s at a total cost of  (). The United States Congress approved the sale under the Foreign Military Sales program.[http://www.news.com.au/technology/design/abbott-government-to-spend-500-million-on-two-new-boeing-c17-heavylift-transport-jets/story-fnpjxnlk-1227078035546 Abbott Government to spend $500 million on two new Boeing C-17 heavy-lift transport jets]. Retrieved on 12 October 2014.[http://www.flightglobal.com/news/articles/australia-to-buy-up-to-four-more-c-17s-404418/ Australia to buy up to four more C-17s]. Retrieved on 12 October 2014.   Prime Minister Tony Abbott confirmed in April 2015 that two additional aircraft are to be ordered, with both delivered by November 4, 2015; these are to add to the six C-17s it has .\n\nRoyal Canadian Air Force\n\nThe Canadian Forces has had a long-standing need for strategic airlift for humanitarian and military operations around the world. It had followed a pattern similar to the German Air Force in leasing Antonovs and Ilyushins for many of its needs, including deploying the Disaster Assistance Response Team (DART) to tsunami-stricken Sri Lanka in 2005. The Canadian Forces was forced to rely entirely on leased An-124 Ruslan for a Canadian Army deployment to Haiti in 2003. A combination of leased Ruslans, Ilyushins and USAF C-17s was also used to move heavy equipment into Afghanistan. In 2002, the Canadian Forces Future Strategic Airlifter Project began to study alternatives, including long-term leasing arrangements.Whelan, Peter. [http://ploughshares.ca/pl_publications/strategic-lift-capacity-for-canada/ \"Strategic lift capacity for Canada.\"] The Ploughshares Monitor, Volume 26, Issue 2, Summer 2005.\n\nOn 5 July 2006, the Canadian government issued a notice that it intended to negotiate directly with Boeing to procure four airlifters for the Canadian Forces Air Command (Royal Canadian Air Force after August 2011).[http://www.merx.com/English/SUPPLIER_Menu.Asp?WCEShow&TAB\n1&State7&id\nPW-%24SSC-004-13706&hcodelZi0smL%2fmio4eGxwwqDpfg%3d%3d Airlift Capability Project – Strategic ACP-S – ACAN] MERX Website – Government of Canada On 1 February 2007, Canada awarded a contract for four C-17s with delivery beginning in August 2007.[http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20070202/oconnor_plane_070202/20070202?hub\nCanada \"O'Connor announces military plane purchase\".] CTV.ca, 2 February 2007. Like Australia, Canada was granted airframes originally slated for the U.S. Air Force, to accelerate delivery.Wastnage, J. [http://www.flightglobal.com/articles/2007/02/05/211969/canada-gets-usaf-slots-for-august-delivery-after-signing-for-four-boeing-c-17s-in-20-year-c4bn.html \"Canada gets USAF slots for August delivery after signing for four Boeing C-17s in 20-year C$4bn deal, settles provincial workshare squabble.\"] Flight International, 5 February 2007. Retrieved: 1 July 2011.\n\nOn 23 July 2007, the first Canadian C-17 made its initial flight.[http://boeingnews.web.boeing.com/archive/07_07/072507/070725a_c17_p2.html \"Canada One C-17 makes first flight.\"] Boeing, 25 July 2007. It was turned over to Canada on 8 August,[http://www.boeing.com/defense-space/military/c17/news/2007/q3/070808c_nr.html \"Boeing delivers Canada's First C-17.\"] Boeing, 8 August 2007. and participated at the Abbotsford International Airshow on 11 August prior to arriving at its new home base at 8 Wing, CFB Trenton, Ontario on 12 August.[http://www.airforce.forces.gc.ca/site/newsroom/news_e.asp?id4120 \"First CC-177 Globemaster III Receives Patriotic and Enthusiastic Welcome.\"]  Department of National Defence. Retrieved: 2 August 2012. Its first operational mission was delivery of disaster relief to Jamaica following Hurricane Dean.[http://www.ctv.ca/servlet/ArticleNews/story/CTVNews/20070824/globemaster_070824/20070824?hub\nCanada \"New military aircraft leaves on aid mission.\"] Cnews.com, 24 August 2007. The second C-17 arrived at 8 Wing, CFB Trenton on 18 October 2007. The last of the initial four aircraft was delivered in April 2008.[http://www.airforce.forces.gc.ca/site/newsroom/news_e.asp?cat\n114&id=5802 \"Canada takes delivery of final CC-177.\"]  Canadian Forces, 3 April 2008. The official Canadian designation is CC-177 Globemaster III.[http://www.rcaf-arc.forces.gc.ca/v2/equip/cc177/index-eng.asp \"Aircraft – CC-177 Globemaster III.\"]  Royal Canadian Air Force, 15 January 2010. The aircraft are assigned to 429 Transport Squadron based at CFB Trenton.\n\nOn 14 April 2010, a Canadian C-17 landed for the first time at CFS Alert, the world's most northerly airport.[http://www.airforce.forces.gc.ca/v2/nr-sp/index-eng.asp?id=10443 \"Top of the world welcomes CC-177 Globemaster III.\"]  airforce.forces.gc.ca. Retrieved: 18 August 2011. Canadian Globemasters have been deployed in support of numerous humanitarian and military missions worldwide, including Operation Hestia after the earthquake in Haiti, providing airlift as part of Operation Mobile and support to the Canadian mission in Afghanistan. After Typhoon Haiyan hit the Philippines in 2013, Canadian C-17s established an air bridge between the two nations, deploying Canada's DART Team and delivering humanitarian supplies and equipment. In 2014, they supported Operation Reassurance and Operation Impact.\n\nOn 19 December 2014, it was reported that Canada's Defence Department intended to purchase one more C-17. On 30 March 2015, Canada's fifth C-17 arrived at CFB Trenton.\n\nStrategic Airlift Capability program\n\nAt the 2006 Farnborough Airshow, a number of NATO member nations signed a letter of intent to jointly purchase and operate several C-17s within the Strategic Airlift Capability (SAC). SAC members are Bulgaria, Estonia, Hungary, Lithuania, the Netherlands, Norway, Poland, Romania, Slovenia, the U.S., along with two Partnership for Peace countries Finland and Sweden as of 2010.[http://www.nato.int/issues/strategic-lift-air-sac/index.html \"Strategic Airlift Capability: A key capability for the Alliance.\"] NATO. Retrieved: 1 April 2010.  The purchase was for two C-17s, and a third was contributed by the U.S. On 14 July 2009, Boeing delivered the first C-17 under the SAC program. The second and third C-17s were delivered in September and October 2009.Hoyle, Craig. [http://www.flightglobal.com/articles/2009/07/15/329668/pictures-boeing-delivers-first-c-17-for-nato-led-heavy-airlift-wing.html \"Boeing delivers first C-17 for NATO-led Heavy Airlift Wing.\"]  Flight International, 15 July 2009.Drelling, Jerry and Eszter Ungar.[http://boeing.mediaroom.com/index.php?s43&item\n870 \"3rd Boeing C-17 Joins 12-Nation Strategic Airlift Capability Initiative.\"] Boeing, 7 October 2009.\n\nThe SAC C-17s are based at Pápa Air Base, Hungary. The Heavy Airlift Wing is hosted by Hungary, which acts as the flag nation.[http://www.heavyairliftwing.org/background \"Background.\"] Heavy Airlift Wing. Retrieved: 2 August 2012.  The aircraft are manned in similar fashion as the NATO E-3 AWACS aircraft.[http://www.e3a.nato.int/ \"NATP Airborne Early Warning & Control Force: E-3A Component.\"] NATO. Retrieved: 1 April 2010.  The C-17 flight crew are multi-national, but each mission is assigned to an individual member nation based on the SAC's annual flight hour share agreement. The NATO Airlift Management Programme Office (NAMPO) provides management and support for the Heavy Airlift Wing. NAMPO is a part of the NATO Support Agency (NSPA). In September 2014, Boeing stated that the three C-17s supporting SAC missions had achieved a readiness rate of nearly 94 percent over the last five years and supported over 1,000 missions.\n\nIndian Air Force\n\nIn June 2009, the Indian Air Force (IAF) selected the C-17 for its Very Heavy Lift Transport Aircraft requirement to replace several types of transport aircraft.[https://www.reuters.com/article/2009/06/16/us-airshow-boeing-c17-sb-idUSTRE55F3TC20090616 \"Boeing says C-17 orders to extend line.\"] Reuters, 16 June 2009. Retrieved: 1 July 2011. In January 2010, India requested 10 C-17s through the U.S.'s Foreign Military Sales program,Mathews, Neelam. [http://www.aviationweek.com/aw/generic/story.jsp?id\nnews/awx/2010/01/08/awx_01_08_2010_p0-195411.xml&headlineIndia%20Requests%20Boeing%20C-17s&channel\ndefense \"India Requests Boeing C-17s.\"] Aviation Week, 8 January 2010. the sale was approved by Congress in June 2010.[http://www.sify.com/news/us-congress-clears-c-17-sale-for-india-news-international-kgcnOdacjcb.html \"US Congress clears C-17 sale for India.\"] Deccan Chronicle, 18 August 2011. On 23 June 2010, the Indian Air Force successfully test-landed a USAF C-17 at the Gaggal Airport, India to complete the IAF's C-17 trials.[http://www.janes.com/news/defence/jdw/jdw100705_1_n.shtml \"IAF completes C-17 test-flight.\"] Jane's Information Group, 5 July 2010. In February 2011, the IAF and Boeing agreed terms for the order of 10 C-17s[http://articles.economictimes.indiatimes.com/2011-03-17/news/29138728_1_il-76-iaf-chief-marshal-pv-naik \"IAF finalises order for 10 C-17 strategic airlifters.\"] The Times of India, 17 March 2011. Retrieved: 1 July 2011. with an option for six more; the US$4.1 billion order was approved by the Indian Cabinet Committee on Security on 6 June 2011.Prasad, K.V. [http://www.hindu.com/2011/06/07/stories/2011060765092000.htm \"India to buy C-17 heavy-lift transport aircraft from U.S.\"] The Hindu, 7 June 2011. Retrieved: 7 June 2011.[http://www.livemint.com/Companies/6uAPJaguKDn2s1jpL6gAUN/India8217s-4-bn-order-to-support-jobs-at-Boeing8217s.html \"India's $4-Bn Order To Support Jobs At Boeing.\"] BusinessWeek, 7 June 2011. Deliveries began in June 2013 and were to continue to 2014.[http://pib.nic.in/newsite/erelease.aspx?relid78432 \"Purchase of Transport Aircraft.\"] pib.nic.in, 12 December 2011. Retrieved: 2 August 2012. In 2012, the IAF reportedly finalized plans to buy six more C-17s in its five-year plan for 2017–2022.[http://economictimes.indiatimes.com/news/economy/policy/india-to-buy-more-than-16-c-17-airlifters/articleshow/8850290.cms \"India to buy more than 16 C-17 airlifters.\"] Economictimes.indiatimes.com. Retrieved: 2 August 2012.  However, this option is no longer available since C-17 production ended in 2015.\n\nThe aircraft provides strategic airlift and the ability to deploy special forces, such as during national emergencies.Knowles, Victoria. [http://www.armedforces-int.com/news/c-17-globemaster-for-indian-air-force.html \"C-17 Globemaster for Indian Air Force.\"] Armed Forces International, 1 August 2012. They are operated in diverse terrain – from Himalayan air bases in North India at 13000 ft to Indian Ocean bases in South India. The C-17s are based at Hindon Air Force Station and are operated by No. 81 Squadron IAF Skylords.[http://articles.economictimes.indiatimes.com/2011-07-10/news/29758116_1_american-defence-major-boeing-indian-air-force-iaf Indian Air Force IAF.\"] India Times, 10 July 2010. The first C-17 was delivered in January 2013 for testing and training;[http://www.defensenews.com/article/20130124/DEFREG03/301240018/1st-C-17-Airlifter-8216-Delivered-8217-Indian-Officials \"1st C-17 Airlifter ‘Delivered’ to Indian Officials\"]. Defense News, 24 January 2013. it was officially accepted on 11 June 2013.[http://boeing.mediaroom.com/index.php?s\n43&item2697 \"Boeing Transfers 1st C-17 to Indian Air Force\"]. Boeing, 11 June 2013. The second C-17 was delivered on 23 July 2013 and put into service immediately. IAF Chief of Air Staff Norman AK Browne called the Globemaster III \"a major component in the IAF's modernization drive\" while taking delivery of the aircraft at Boeing's Long Beach factory. On 2 September 2013, the Skylords squadron with three C-17s officially entered IAF service.[http://www.armedforces-int.com/news/c-17-globemaster-iii-joins-indian-air-force.html \"C-17 Globemaster III Joins Indian Air Force\"]. Armedforces-Int.com, 2 September 2013\n\nThe Skylords regularly fly missions within India, such as to high-altitude bases at Leh and Thoise. The IAF first used the C-17 to transport an infantry battalion's equipment to Port Blair on Andaman Islands on 1 July 2013. Foreign deployments to date include Tajikistan in August 2013, and Rwanda to support Indian peacekeepers. One C-17 was used for transporting relief materials during Cyclone Phailin. The fifth aircraft was received in November 2013. The sixth aircraft was received in July 2014.\n\nIn June 2017, the U.S. Department of State approved the potential sale of one C-17 to India under a proposed $366 million U.S. Foreign Military Sale that includes spare parts and support.  This aircraft was the last C-17 produced.  The sale, if finalized, would increase the Indian Air Force's fleet to 11 C-17s.\n\nQatar \n\nBoeing delivered Qatar's first C-17 on 11 August 2009 and the second on 10 September 2009 for the Qatar Emiri Air Force.Drelling, Jerry and Lorenzo Cortes. [http://boeing.mediaroom.com/index.php?s43&item\n832 \"Boeing Delivers Qatar's 2nd C-17 Globemaster III.\"] Boeing, 10 September 2009. Qatar received its third C-17 in 2012, and fourth C-17 was received on 10 December 2012. In June 2013, the New York Times reported that Qatar was allegedly using its C-17s to ship weapons from Libya to the Syrian opposition during the civil war via Turkey.  On 15 June 2015, it was announced at the Paris Airshow that Qatar agreed to order four additional C-17s from the five remaining \"white tail\" C-17s to double Qatar's C-17 fleet.\n\nUnited Arab Emirates \n\nIn February 2009, the United Arab Emirates Air Force agreed to purchase four C-17s.Trimble, Stephen. [http://www.flightglobal.com/articles/2009/02/25/323068/uae-strengthens-airlift-capacity-with-c-130j-c-17-deals.html \"UAE strengthens airlift capacity with C-130J, C-17 deals.\"] Flight International, 25 February 2009. In January 2010, a contract was signed for six C-17s.[http://boeing.mediaroom.com/index.php?s43&item\n1019 \"Boeing, United Arab Emirates Announce Order for 6 C-17s\"]. Boeing, 6 January 2010. In May 2011, the first C-17 was handed over and the last of the six was received in June 2012.[http://www.flightglobal.com/articles/2011/05/11/356496/pictures-uae-receives-first-c-17-transport.html \"UAE receives first C-17 transport.\"] flightglobal.com, 11 May 2011.[http://boeing.mediaroom.com/index.php?s43&item\n2300 \"Boeing Delivers UAE Air Force and Air Defence's 6th C-17.\"] Boeing, 20 June 2012.\n\nOthers and potential operators  \n\nKuwait requested the purchase of one C-17 in September 2010 and a second in April 2013 through the U.S.'s Foreign Military Sales (FMS) program.[http://www.dsca.mil/major-arms-sales/kuwait-c-17-globemaster-iii \"Kuwait – C-17 GLOBEMASTER III.\"] U.S. Defense Security Cooperation Agency, 17 April 2013. The nation ordered two C-17s; the first was delivered on 13 February 2014.[http://boeing.mediaroom.com/Boeing-Delivers-Kuwait-Air-Force-s-1st-C-17-Globemaster-III \"Boeing Delivers Kuwait Air Force’s 1st C-17 Globemaster III\"]. Boeing, 13 February 2014.\n\nThe United States Antarctic Program uses C-17s through the United States Air Force for transportation from Christchurch to McMurdo Station, generally shuttling scientific equipment, food and water, and scientific personnel. The New York Air National Guard also operates Lockheed HC-130 aircraft for further transportation.\n\nIn 2015 New Zealand Defence Force was considering the purchase of two C-17s for the Royal New Zealand Air Force at an estimated cost of $600 million to replace its aging C-130s. However, the New Zealand Government eventually decided not to acquire any Globemasters.\n\nVariants\n\n*C-17A: Initial military airlifter version.\n*C-17A \"ER\": Unofficial name for C-17As with extended range due to the addition of the center wing tank. This upgrade was incorporated in production beginning in 2001 with Block 13 aircraft.Norton 2001, p. 93.\n*C-17B: A proposed tactical airlifter version with double-slotted flaps, an additional main landing gear on the center fuselage, more powerful engines, and other systems for shorter landing and take-off distances.Trimble, Stephen. [https://www.flightglobal.com/news/articles/boeing-offers-c-17b-as-piecemeal-upgrade-314814/ \"Boeing offers C-17B as piecemeal upgrade.\"] Flight International, 19 August 2008. Boeing offered the C-17B to the U.S. military in 2007 for carrying the Army's Future Combat Systems (FCS) vehicles and other equipment.Trimble, Stephen. [http://www.flightglobal.com/articles/2007/10/16/218272/boeing-offers-c-17b-to-us-army.html \"Boeing offers C-17B to US Army.\"] Flight International, 16 October 2007.\n*MD-17: Proposed variant for civilian operators,Sillia, George. [http://www.boeing.com/news/releases/1997/news_release_970828n.html \"MD-17 Receives FAA Certification.\"]  Boeing, 28 August 1997. later redesignated as BC-17 after 1997 merger.Saling, Bob. [http://www.boeing.com/news/releases/2000/news_release_000928a.html \"Boeing Is Undisputed Leader In Providing Air Cargo Capacity (Boeing proposes BC-17X).\"]  Boeing 28 September 2000.\n\nOperators\n\n;\n* Royal Australian Air Force – 8 C-17A ERs in service.\n** No. 36 Squadron[http://www.defence.gov.au/news/raafnews/editions/4804/topstories/story02.htm \"Master plan for C-17s.\"]  Air Force News, Volume 48, No. 4, 23 March 2006.\n;\n* Royal Canadian Air Force – 5 CC-177 (C-17A ER) aircraft in use.\n** 429 Transport Squadron, CFB Trenton[http://www.forces.gc.ca/site/newsroom/view_news_e.asp?id=2389 \"Canada's New Government Re-Establishes Squadron to Support C-17 Aircraft.\"]  Canadian Department of National Defence, 18 July 2007. \n;\n* Indian Air Force – 10 C-17sTNT News. [http://thenortheasttoday.com/indian-air-force-warrior-sentinels-c-17-globemaster/ \"Indian Air Force Warrior Sentinels: C-17 Globemaster\"] The North East Today, 28 April 2015. Retrieved: 9 June 2015.\n** No. 81 Squadron IAFSkylords, Hindon AFS\n; NATO\n* NATO Strategic Airlift Capability Heavy Airlift Wing – 3 C-17s in service,[http://boeing.mediaroom.com/index.php?s43&item\n764 \"Multinational Alliance's 1st Boeing C-17 Joins Heavy Airlift Wing in Hungary.\"] Boeing,  27 July 2009. including 1 C-17 contributed by the USAF.[http://boeing.mediaroom.com/index.php?s43&item\n870 \"3rd Boeing C-17 Joins 12-Nation Strategic Airlift Capability Initiative.\"] Boeing, 7 October 2009. and based at Pápa Air Base, Hungary.\n;\n* Kuwait Air Force – 2 C-17s\n;\n*Qatari Emiri Air Force – 4 C-17As in use 4 on order[http://boeing.mediaroom.com/2015-06-15-Boeing-Qatar-Confirm-Purchase-of-Four-C-17s \"Boeing, Qatar Confirm Purchase of Four C-17s.\"] Boeing, 15 June 2015.\n;\n*United Arab Emirates Air Force – 6 C-17As in service 2 on order[http://worlddefencenews.blogspot.co.uk/2015/02/united-arab-emirates-announce-purchase.html \"United Arab Emirates announce purchase of two C-17 airlifters and nine AW139 helicopters.\"] World Defence News, 26 February 2015.\n;\n* Royal Air Force – 8 C-17A ERsWall, Robert. [http://www.aviationweek.com/aw/generic/story_channel.jsp?channeldefense&id\nnews/asd/2012/02/09/05.xml&headline=U.K.%20Adds%20Eighth%20C-17 \"Aerospace Daily and Defense Report: U.K. Adds Eighth C-17.\"] Aviation Week, 9 February 2012. Retrieved: 10 February 2012.\n** No. 99 Squadron, RAF Brize Norton\n\n;\n\nUnited States Air Force- 213 C-17s in service total (187 Active, 12 Air National Guard, 14 Air Force Reserve)\n\nAir Mobility Command\n*60th Air Mobility Wing – Travis AFB, California\n:21st Airlift Squadron\n*62d Airlift Wing – McChord AFB, Washington\n:4th Airlift Squadron\n:7th Airlift Squadron\n:8th Airlift Squadron\n*305th Air Mobility Wing – McGuire AFB, New Jersey\n:6th Airlift Squadron\n*385th Air Expeditionary Group – Al Udeid Air Base, Qatar\n:816th Expeditionary Airlift Squadron \n*436th Airlift Wing – Dover AFB, Delaware\n:3d Airlift Squadron\n*437th Airlift Wing – Charleston AFB, South Carolina\n:14th Airlift Squadron\n:15th Airlift Squadron\n:16th Airlift Squadron\nPacific Air Forces\n*3d Wing – Elmendorf AFB, Alaska\n:517th Airlift Squadron (Associate)\n*15th Wing – Hickam AFB, Hawaii\n:535th Airlift Squadron\nAir Education and Training Command\n*97th Air Mobility Wing – Altus AFB, Oklahoma\n:58th Airlift Squadron\nAir Force Materiel Command\n*412th Test Wing – Edwards AFB, California\n:418th Flight Test Squadron\nAir Force Reserve Command\n*315th Airlift Wing (Associate) – Charleston AFB, South Carolina\n:300th Airlift Squadron\n:317th Airlift Squadron\n:701st Airlift Squadron\n*349th Air Mobility Wing (Associate) – Travis AFB, California\n:301st Airlift Squadron\n*445th Airlift Wing – Wright-Patterson AFB, Ohio\n:89th Airlift Squadron\n*446th Airlift Wing (Associate) – McChord AFB, Washington\n:97th Airlift Squadron\n:313th Airlift Squadron\n:728th Airlift Squadron\n*452d Air Mobility Wing – March ARB, California\n:729th Airlift Squadron\n*507th Air Refueling Wing – Tinker AFB, Oklahoma\n:730th Air Mobility Training Squadron (Altus AFB)\n*512th Airlift Wing (Associate) – Dover AFB, Delaware\n:326th Airlift Squadron\n*514th Air Mobility Wing (Associate) – McGuire AFB, New Jersey\n:732d Airlift Squadron\nAir National Guard\n*105th Airlift Wing – Stewart ANGB, New York\n:137th Airlift Squadron\n*154th Wing – Hickam AFB, Hawaii\n:204th Airlift Squadron (Associate)\n*164th Airlift Wing – Memphis, Tennessee\n:155th Airlift Squadron\n*167th Airlift Wing – Martinsburg, West Virginia\n:167th Airlift Squadron\n*172d Airlift Wing – Jackson, Mississippi\n:183d Airlift Squadron\n*176th Wing – Elmendorf AFB, Alaska\n:144th Airlift Squadron\n\nAccidents and notable incidents \n\n* On 10 September 1998, a U.S. Air Force C-17 (AF Serial No.96-0006) delivered Keiko the whale to Vestmannaeyjar, Iceland, a 3800 ft runway, and suffered a landing gear failure during landing. There were no injuries, but the aircraft received major damage to the landing gear. After receiving temporary repairs, the C-17 was flown to another city in Iceland for further repairs.[http://www.mcchordairmuseum.org/REV%20B%20OUR%20HISTORY%20%20NAME%20C-17%2096-0006%20SP%20OF%20BERLIN.htm \"C-17A S/N 96-0006.\"] McChord Air Museum. Retrieved: 2 August 2012.[https://archive.is/20120529185612/http://findarticles.com/p/articles/mi_6712/is_24_203/ai_n28736153/ \"C-17 Accident During Whale Lift Due To Design Flaw.\"] findarticles.com. Retrieved: 2 August 2012.\n* On 10 December 2003, a U.S. Air Force C-17 (AF Serial No. 98-0057) was hit by a surface-to-air missile after take-off from Baghdad, Iraq. One engine was disabled and the aircraft returned for a safe landing.[http://aviation-safety.net/database/record.php?id=20031209-0 \"Information on 98-0057 incident.\"] Aviation-Safety.net. Retrieved: 2 August 2012. The aircraft was repaired and returned to service.[http://www.airliners.net/open.file/0614580/M/ \"C-17, tail 98-0057 image from 2004.\"] airliners.net. Retrieved: 2 August 2012.\n* On 6 August 2005, a U.S. Air Force C-17 (AF Serial No. 01-0196) ran off the runway at Bagram Air Base in Afghanistan while attempting to land, destroying the aircraft's nose and main landing gear.[http://www.defendamerica.mil/articles/aug2005/a080905wm5.html \"Bagram Runway Reopens After C-17 Incident.\"]  DefendAmerica News Article. Retrieved: 2 August 2012. It took two months to make the aircraft flightworthy. The aircraft was flown to Boeing's Long Beach facility by a test pilot, as the temporary repairs imposed performance limitations.[http://www.boeing.com/news/frontiers/archive/2006/february/i_ids1.html \"The Big Fix.\"] Boeing Frontiers Online, February 2006. In October 2006, the aircraft returned to service after receiving repairs.\n* On 30 January 2009, a U.S. Air Force C-17 (AF Serial No. 96-0002 – \"Spirit of the Air Force\") made a gear-up landing at Bagram Air Base.[http://www.af.mil/news/story.asp?id=123133880 \"Bagram Air Base runway recovery.\"] US Air Force, 4 February 2009.  The C-17 was ferried from Bagram AB, making several stops along the way, to Boeing's Long Beach plant for extensive repairs. The USAF Aircraft Accident Investigation Board concluded the cause was the crew's failure to lower the landing gear, having not followed the pre-landing checklist.\n* On 28 July 2010, a U.S. Air Force C-17 (AF Serial No. 00-0173 – \"Spirit of the Aleutians\") crashed at Elmendorf Air Force Base, Alaska, while practicing for the 2010 Arctic Thunder Air Show, killing all four aboard.[http://www.pacaf.af.mil/shared/media/document/AFD-101214-048.pdf USAF Aircraft Accident Investigation Board Report for Incident of 28 July 2010] , retrieved 8 July 2017.[http://www.cbsnews.com/news/four-dead-in-alaska-air-force-base-crash \"Four Dead in Alaska Air Force Base Crash.\"]  CBS News, 29 July 2010.  The C-17 crashed near a railroad, disrupting rail operations.[http://www.adn.com/2010/07/29/1387215/fatal-c-17-crash-also-damaged.html \"Arctic Thunder to continue after 4 died.\"]  adn.com, 30 July 2010.  A military investigative report determined that a stall caused by pilot error led to the crash.[http://www.cnn.com/2010/US/12/11/alaska.plane.crash/ \"Pilot error cause of Alaska cargo plane crash, report concludes.\"] CNN, 11 December 2010. Retrieved: 1 July 2011. This is the only fatal C-17 crash and its only hull-loss incident.\n* On 23 January 2012, a U.S. Air Force C-17 (AF Serial No. 07-7189), assigned to the 437th Airlift Wing, Joint Base Charleston, South Carolina, landed on runway 34R at Forward Operating Base Shank, Afghanistan; however, the pilot and copilot did not realize their required stopping distance was longer than the runway and were unable to stop before departing the prepared surface. The C-17 struck an embankment, and came to rest approximately 700 feet from the end of runway.  The aircraft sustained major structural damage but no injuries were reported. After 9 months of repairs to make the C-17 airworthy, it departed FOB Shank for Boeing's factory at Long Beach, California. After another 22 months of overhauls, totaling $69.4 million, the aircraft returned to service.\n\nSpecifications (C-17). Boeing C-17 Globemaster III. http://en.wikipedia.org/?curid=6731."
  }
}
