{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9824",
  "eid" : "f2370060-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778486118,
  "textBody" : "Edna St. Vincent Millay (February 22, 1892 – October 19, 1950) was an American poet and playwright.Obituary Variety, October 25, 1950. She received the Pulitzer Prize for Poetry in 1923, the third woman to win the award for poetry,[http://www.pulitzer.org/prize-winners-by-category/224 Pulitzer site] and was also known for her feminist activism. She used the pseudonym Nancy Boyd for her prose work. The poet Richard Wilbur asserted, \"She wrote some of the best sonnets of the century.\"Millay, Edna St. Vincent. Selected Poems. Harper Collins, 1991\n\nEarly life\n\nMillay was born in Rockland, Maine, to Cora Lounella Buzelle, a nurse, and Henry Tolman Millay, a schoolteacher who would later become a superintendent of schools.  Her middle name derives from St. Vincent's Hospital in New York, where her uncle's life had been saved just before her birth. The family's house was \"between the mountains and the sea where baskets of apples and drying herbs on the porch mingled their scents with those of the neighboring pine woods.\" In 1904, Cora officially divorced Millay's father for financial irresponsibility, but they had already been separated for some years. Cora and her three daughters, Edna (who called herself \"Vincent\"), Norma Lounella (born 1893), and Kathleen Kalloch (born 1896), moved from town to town, living in poverty. Cora travelled with a trunk full of classic literature, including Shakespeare and Milton, which she read to her children. The family settled in a small house on the property of Cora's aunt in Camden, Maine, where Millay would write the first of the poems that would bring her literary fame.\n\nThe three sisters were independent and spoke their minds, which did not always sit well with the authority figures in their lives. Millay's grade school principal, offended by her frank attitudes, refused to call her Vincent. Instead, he called her by any woman's name that started with a V. At Camden High School, Millay began developing her literary talents, starting at the school's literary magazine, The Megunticook.  At 14 she won the St. Nicholas Gold Badge for poetry, and by 15, she had published her poetry in the popular children's magazine St. Nicholas, the Camden Herald, and the high-profile anthology Current Literature. While at school, she had several relationships with women, including Edith Wynne Matthison, who would go on to become an actress in silent films.[http://www.poets.org/poet.php/prmPID/160 Millay biography from the Academy of American Poets]\n\nMillay entered Vassar College in 1913 when she was 21 years old, later than usual. She had relationships with several fellow students during her time there and kept scrapbooks including drafts of plays written during the period.Brinkman, B. \"Modern American Archives and Scrapbook Modernism.\" The Cambridge Companion to Modern American Poetry (2015):\n\nNew York City\n\nAfter her graduation from Vassar in 1917, Millay moved to New York City. She lived in a number of places in Greenwich Village, including a house owned by the Cherry Lane Theatre and 75½ Bedford Street, renowned for being the narrowest in New York City.Wetzsteon, Ross. 2002. Republic of Dreams: Greenwich Village, the American Bohemia, 1910-1960. New York: Simon & Schuster. p. 283  The critic Floyd Dell wrote that the red-haired and beautiful Millay was \"a frivolous young woman, with a brand-new pair of dancing slippers and a mouth like a valentine.\"  Millay described her life in New York as \"very, very poor and very, very merry.\" While establishing her career as a poet, Millay initially worked with the Provincetown Players on Macdougal Street and the Theatre Guild. In 1924 Millay and others founded the Cherry Lane Theater \"to continue the staging of experimental drama.\"Delaney, Edmund T. 1968. New York's Greenwich Village. Barre, Mass: Barre Publishers. p. 112 Magazine articles under a pseudonym also helped support her early days in the village.\n\nCounted among Millay's close friends were the writers Witter Bynner, Arthur Davison Ficke, and Susan Glaspell, as well as Floyd Dell and the critic Edmund Wilson, both of whom proposed marriage to her and were refused.\n\nCareer\n\nMillay's fame began in 1912 when she entered her poem \"Renascence\" in a poetry contest in The Lyric Year.  The poem was widely considered the best submission and when it was ultimately awarded fourth place, it created a scandal which brought Millay publicity. The first-place winner Orrick Johns was among those who felt that \"Renascence\" was the best poem, and stated that \"the award was as much an embarrassment to me as a triumph\".  A second-prize winner offered Millay his $250 prize money.  In the immediate aftermath of the Lyric Year controversy, wealthy arts patron Caroline B. Dow heard Millay reciting her poetry and playing the piano at the Whitehall Inn in Camden, Maine, and was so impressed that she offered to pay for Millay's education at Vassar College.\n\nHer 1920 collection A Few Figs From Thistles drew controversy for its exploration of female sexuality and feminism.Millay, Edna St. Vincent. [http://www2.hn.psu.edu/faculty/jmanis/esv-millay/figs-thistles.pdf A few Figs from Thistles]  In 1919 she wrote the anti-war play Aria da Capo which starred her sister Norma Millay at the Provincetown Playhouse in New York City. Millay won the Pulitzer Prize for Poetry in 1923 for \"The Ballad of the Harp-Weaver\";Millay, Edna St. Vincent,  [http://digital.library.upenn.edu/women/millay/ballad/ballad.html \"The Ballad of the Harp-Weaver\"] she was the third woman to win the poetry prize, after Sara Teasdale (1918) and Margaret Widdemer (1919)..\n\nIn January 1921, she went to Paris, where she met and befriended the sculptor Thelma Wood.\n\nIn 1923 she married 43-year-old Eugen Jan Boissevain (1880–1949), the widower of the labor lawyer and war correspondent Inez Milholland, a political icon Millay had met during her time at Vassar. A self-proclaimed feminist, Boissevain supported her career and took primary care of domestic responsibilities. Both Millay and Boissevain had other lovers throughout their twenty-six-year marriage. For Millay, a significant such relationship was with the poet George Dillon. She met Dillon at one of her readings at the University of Chicago in 1928 where he was a student. He was fourteen years her junior, and the relationship inspired the sonnets in the collection Fatal Interview (published 1931).\n\nIn 1925, Boissevain and Millay bought Steepletop near Austerlitz, New York, which had been a 635 acre blueberry farm. The couple built a barn (from a Sears Roebuck kit), and then a writing cabin and a tennis court. Millay grew her own vegetables in a small garden. The couple later bought Ragged Island in Casco Bay, Maine, as a summer retreat.\n\nDuring the first world war Millay had been a dedicated and active pacifist; however, from 1940 she supported the Allied Forces, writing in celebration of the war effort and later working with Writers' War Board to create propaganda, including poetry.[http://vcencyclopedia.vassar.edu/alumni/edna-st-vincent-millay.html \"Edna St. Vincent Millay\"] Vassar Encyclopaedia, Vassar College Her reputation in poetry circles was damaged by her war work. Merle Rubin noted: \"She seems to have caught more flak from the literary critics for supporting democracy than Ezra Pound did for championing fascism.\"  In The New York Times, Millay mourned the Czechoslovak city of Lidice, the site of a Nazi massacre:\n\nThe whole world holds in its arms today\nThe murdered village of Lidice, \nLike the murdered body of a little child.\n\nIn 1943 Millay was the sixth person and the second woman to be awarded the Frost Medal for her lifetime contribution to American poetry.\n\nBoissevain died in 1949 of lung cancer, and Millay lived alone for the last year of her life.\n\nDeath and legacy\n\nMillay died at her home on October 19, 1950. She had fallen down stairs and was found approximately eight hours after her death. Her physician reported that she had suffered a heart attack following a coronary occlusion..  She was 58 years old. She is buried alongside her husband at Millay Colony for the Arts, Austerlitz, New York.Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 (Kindle Location 32422). McFarland & Company, Inc., Publishers. Kindle Edition.\n\nMillay's sister Norma and her husband, the painter and actor Charles Frederick Ellis, moved to Steepletop after Millay's death. In 1973, they established Millay Colony for the Arts on the seven acres around the house and barn.  After the death of her husband in 1976, Norma continued to run the program until her death in 1986.\n\nAt 17, the poet Mary Oliver visited Steepletop and became a close friend of Norma. Oliver eventually lived there for seven years and helped to organize Millay's papers.. Mary Oliver herself went on to become a Pulitzer Prize-winning poet, greatly inspired by Millay's work.[http://www.poetryfoundation.org/archive/poet.html?id=5130 Poetry Foundation Oliver biography]. Accessed 2010-09-07 In 2006, the state of New York paid $1.69 million to acquire 230 acre of Steepletop, with the intention to add the land to a nearby state forest preserve. The proceeds of the sale were to be used by the Edna St. Vincent Millay Society to restore the farmhouse and grounds and turn it into a museum. The museum has been open to the public since summer 2010, and guided tours of Steepletop and Millay's gardens are available from the end of May through the middle of October. Parts of the grounds of Steepletop, including the Millay Poetry Trail that leads to her grave, are now open to the public year-round.\n\nDetails of Millay's life were compiled by biographer Nancy Milford in the book titled Savage Beauty: The Life of Edna St Vincent Millay, published in 2001. Milford was sought out by Millay's only living connection at the time, her sister Norma Millay Ellis, and was chosen for her previous, successful biography Zelda. Milford would then go on to edit and write an introduction for a collection of Millay's poems called The Selected Poetry of Edna St. Vincent Millay.\n\nIn 2015, she was named by Equality Forum as one of their 31 Icons of the 2015 LGBT History Month.\n\nWorks\n\nMillay wrote five verse dramas early in her career, including Two Slatterns and a King and The Lamp and the Bell, a poem written for Vassar College about love between women. She was commissioned by the Metropolitan Opera House to write a libretto for an opera composed by Deems Taylor. The result, The King's Henchman, drew on the Anglo-Saxon Chronicle's account of Eadgar, King of Wessex, and was described as the most effectively and artistically wrought American opera ever to reach the stage. Within three weeks, her publishers had run through four editions of the book.\n\nHer pacifist verse drama Aria da Capo, a one-act play written for the Provincetown Players, is often anthologized.  It aired live as an episode of Academy Theatre in 1949 on NBC.\n\n\"Euclid alone has looked on Beauty bare\" (1922)  is an homage to the geometry of Euclid.Sinclair, N. et al. (2006). Mathematics and the Aesthetic. New York: Springer. p. 111. \"Renascence\"Millay, Edna St. Vincent. [http://www.bartleby.com/131/1.html \"Renascence\"] and \"The Ballad of the Harp-Weaver\"Millay, Edna St. Vincent. [http://www.americanpoems.com/poets/ednamillay/7356 \"The Ballad of the Harp-Weaver\"] are often considered her finest poems. On her death, The New York Times described her as \"an idol of the younger generation during the glorious early days of Greenwich Village [...] One of the greatest American poets of her time.\" Thomas Hardy said that America had two great attractions: the skyscraper and the poetry of Edna St. Vincent Millay.\n\nPublications\n\nThe following comprises works published during her lifetime:\n\nPoetry collections\n\n*  (title poem first published under name E. Vincent Millay in The Lyric Year, 1912; collection includes God's World), M. Kennerley, 1917. reprinted, Books for Libraries Press, 1972.\n* A Few Figs From Thistles: Poems and Four Sonnets, F. Shay, 1920, 2nd [enlarged] , \n*  (poems; includes Spring, Ode to Silence, and The Beanstalk); reprinted, Harper, 1935\n* The Ballad of the Harp-Weaver, F. Shay, 1922, reprinted as The Harp-Weaver, in The Harp-Weaver, and Other Poems (includes The Concert, Euclid Alone has Looked on Beauty Bare, and Sonnets from an Ungrafted Tree), Harper, 1923.\n* Poems, M. Secker, 1923.\n* (Under pseudonym Nancy Boyd) Distressing Dialogues, preface by Edna St. Vincent Millay, Harper, 1924.\n*  (includes The Buck in the Snow [also see below] and On Hearing a Symphony of Beethoven).\n*Fatal Interview (sonnets), Harper, 1931.\n*Wine from These Grapes (poems; includes Epitaph for the Race of Man and In the Grave No Flower), Harper, 1934.\n* (Translator with George Dillon; and author of introduction) Charles Baudelaire, Flowers of Evil, Harper, 1936.\n*Conversation at Midnight (narrative poem), Harper, 1937.\n*Huntsman, What Quarry? (poems), Harper, 1939.\n*There Are No Islands, Any More: Lines Written in Passion and in Deep Concern for England, France, and My Own Country, Harper, 1940.\n*Make Bright the Arrows: 1940 Notebook (poems), Harper, 1940.\n*Collected Sonnets of Edna St. Vincent Millay, Harper & Brothers, 1941.\n*The Murder of Lidice (poem), Harper, 1942.\n*Second April [and] The Buck in the Snow, introduction by William Rose Benét, Harper, 1950.\n*Mine the Harvest, A Collection of New Poem, Edited by her sister, Norma Millay, and posthumously published by Harper & Brothers, 1954 (This collection consists of the poems that Edna St. Vincent Millay was preparing at the time of her death).\n*Love is Not All, Engeler Urs Editor, 2008.\n\nPlays\n\n* (And director) Aria da capo (one-act play in verse; first produced in Greenwich Village, NY, December 5, 1919), M. Kennerley, 1921 (also see below).\n* The Lamp and the Bell (five-act play; first produced June 18, 1921), F. Shay, 1921 (also see below).\n* Two Slatterns and a King: A Moral Interlude (play), Stewart Kidd, 1921.\n* Three Plays (contains Two Slatterns and a King, Aria da capo, and The Lamp and the Bell), Harper, 1926.\n* (Author of libretto) The King's Henchman (three-act play; first produced in New York, February 17, 1927), Harper, 1927.\n* The Princess Marries the Page (one-act play), Harper, 1932.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Edna St. Vincent Millay" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9824" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Edna St. Vincent Millay (February 22, 1892 – October 19, 1950) was an American poet and playwright.Obituary Variety, October 25, 1950. She received the Pulitzer Prize for Poetry in 1923, the third woman to win the award for poetry,[http://www.pulitzer.org/prize-winners-by-category/224 Pulitzer site] and was also known for her feminist activism. She used the pseudonym Nancy Boyd for her prose work. The poet Richard Wilbur asserted, \"She wrote some of the best sonnets of the century.\"Millay, Edna St. Vincent. Selected Poems. Harper Collins, 1991\n\nEarly life\n\nMillay was born in Rockland, Maine, to Cora Lounella Buzelle, a nurse, and Henry Tolman Millay, a schoolteacher who would later become a superintendent of schools.  Her middle name derives from St. Vincent's Hospital in New York, where her uncle's life had been saved just before her birth. The family's house was \"between the mountains and the sea where baskets of apples and drying herbs on the porch mingled their scents with those of the neighboring pine woods.\" In 1904, Cora officially divorced Millay's father for financial irresponsibility, but they had already been separated for some years. Cora and her three daughters, Edna (who called herself \"Vincent\"), Norma Lounella (born 1893), and Kathleen Kalloch (born 1896), moved from town to town, living in poverty. Cora travelled with a trunk full of classic literature, including Shakespeare and Milton, which she read to her children. The family settled in a small house on the property of Cora's aunt in Camden, Maine, where Millay would write the first of the poems that would bring her literary fame.\n\nThe three sisters were independent and spoke their minds, which did not always sit well with the authority figures in their lives. Millay's grade school principal, offended by her frank attitudes, refused to call her Vincent. Instead, he called her by any woman's name that started with a V. At Camden High School, Millay began developing her literary talents, starting at the school's literary magazine, The Megunticook.  At 14 she won the St. Nicholas Gold Badge for poetry, and by 15, she had published her poetry in the popular children's magazine St. Nicholas, the Camden Herald, and the high-profile anthology Current Literature. While at school, she had several relationships with women, including Edith Wynne Matthison, who would go on to become an actress in silent films.[http://www.poets.org/poet.php/prmPID/160 Millay biography from the Academy of American Poets]\n\nMillay entered Vassar College in 1913 when she was 21 years old, later than usual. She had relationships with several fellow students during her time there and kept scrapbooks including drafts of plays written during the period.Brinkman, B. \"Modern American Archives and Scrapbook Modernism.\" The Cambridge Companion to Modern American Poetry (2015):\n\nNew York City\n\nAfter her graduation from Vassar in 1917, Millay moved to New York City. She lived in a number of places in Greenwich Village, including a house owned by the Cherry Lane Theatre and 75½ Bedford Street, renowned for being the narrowest in New York City.Wetzsteon, Ross. 2002. Republic of Dreams: Greenwich Village, the American Bohemia, 1910-1960. New York: Simon & Schuster. p. 283  The critic Floyd Dell wrote that the red-haired and beautiful Millay was \"a frivolous young woman, with a brand-new pair of dancing slippers and a mouth like a valentine.\"  Millay described her life in New York as \"very, very poor and very, very merry.\" While establishing her career as a poet, Millay initially worked with the Provincetown Players on Macdougal Street and the Theatre Guild. In 1924 Millay and others founded the Cherry Lane Theater \"to continue the staging of experimental drama.\"Delaney, Edmund T. 1968. New York's Greenwich Village. Barre, Mass: Barre Publishers. p. 112 Magazine articles under a pseudonym also helped support her early days in the village.\n\nCounted among Millay's close friends were the writers Witter Bynner, Arthur Davison Ficke, and Susan Glaspell, as well as Floyd Dell and the critic Edmund Wilson, both of whom proposed marriage to her and were refused.\n\nCareer\n\nMillay's fame began in 1912 when she entered her poem \"Renascence\" in a poetry contest in The Lyric Year.  The poem was widely considered the best submission and when it was ultimately awarded fourth place, it created a scandal which brought Millay publicity. The first-place winner Orrick Johns was among those who felt that \"Renascence\" was the best poem, and stated that \"the award was as much an embarrassment to me as a triumph\".  A second-prize winner offered Millay his $250 prize money.  In the immediate aftermath of the Lyric Year controversy, wealthy arts patron Caroline B. Dow heard Millay reciting her poetry and playing the piano at the Whitehall Inn in Camden, Maine, and was so impressed that she offered to pay for Millay's education at Vassar College.\n\nHer 1920 collection A Few Figs From Thistles drew controversy for its exploration of female sexuality and feminism.Millay, Edna St. Vincent. [http://www2.hn.psu.edu/faculty/jmanis/esv-millay/figs-thistles.pdf A few Figs from Thistles]  In 1919 she wrote the anti-war play Aria da Capo which starred her sister Norma Millay at the Provincetown Playhouse in New York City. Millay won the Pulitzer Prize for Poetry in 1923 for \"The Ballad of the Harp-Weaver\";Millay, Edna St. Vincent,  [http://digital.library.upenn.edu/women/millay/ballad/ballad.html \"The Ballad of the Harp-Weaver\"] she was the third woman to win the poetry prize, after Sara Teasdale (1918) and Margaret Widdemer (1919)..\n\nIn January 1921, she went to Paris, where she met and befriended the sculptor Thelma Wood.\n\nIn 1923 she married 43-year-old Eugen Jan Boissevain (1880–1949), the widower of the labor lawyer and war correspondent Inez Milholland, a political icon Millay had met during her time at Vassar. A self-proclaimed feminist, Boissevain supported her career and took primary care of domestic responsibilities. Both Millay and Boissevain had other lovers throughout their twenty-six-year marriage. For Millay, a significant such relationship was with the poet George Dillon. She met Dillon at one of her readings at the University of Chicago in 1928 where he was a student. He was fourteen years her junior, and the relationship inspired the sonnets in the collection Fatal Interview (published 1931).\n\nIn 1925, Boissevain and Millay bought Steepletop near Austerlitz, New York, which had been a 635 acre blueberry farm. The couple built a barn (from a Sears Roebuck kit), and then a writing cabin and a tennis court. Millay grew her own vegetables in a small garden. The couple later bought Ragged Island in Casco Bay, Maine, as a summer retreat.\n\nDuring the first world war Millay had been a dedicated and active pacifist; however, from 1940 she supported the Allied Forces, writing in celebration of the war effort and later working with Writers' War Board to create propaganda, including poetry.[http://vcencyclopedia.vassar.edu/alumni/edna-st-vincent-millay.html \"Edna St. Vincent Millay\"] Vassar Encyclopaedia, Vassar College Her reputation in poetry circles was damaged by her war work. Merle Rubin noted: \"She seems to have caught more flak from the literary critics for supporting democracy than Ezra Pound did for championing fascism.\"  In The New York Times, Millay mourned the Czechoslovak city of Lidice, the site of a Nazi massacre:\n\nThe whole world holds in its arms today\nThe murdered village of Lidice, \nLike the murdered body of a little child.\n\nIn 1943 Millay was the sixth person and the second woman to be awarded the Frost Medal for her lifetime contribution to American poetry.\n\nBoissevain died in 1949 of lung cancer, and Millay lived alone for the last year of her life.\n\nDeath and legacy\n\nMillay died at her home on October 19, 1950. She had fallen down stairs and was found approximately eight hours after her death. Her physician reported that she had suffered a heart attack following a coronary occlusion..  She was 58 years old. She is buried alongside her husband at Millay Colony for the Arts, Austerlitz, New York.Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 (Kindle Location 32422). McFarland & Company, Inc., Publishers. Kindle Edition.\n\nMillay's sister Norma and her husband, the painter and actor Charles Frederick Ellis, moved to Steepletop after Millay's death. In 1973, they established Millay Colony for the Arts on the seven acres around the house and barn.  After the death of her husband in 1976, Norma continued to run the program until her death in 1986.\n\nAt 17, the poet Mary Oliver visited Steepletop and became a close friend of Norma. Oliver eventually lived there for seven years and helped to organize Millay's papers.. Mary Oliver herself went on to become a Pulitzer Prize-winning poet, greatly inspired by Millay's work.[http://www.poetryfoundation.org/archive/poet.html?id=5130 Poetry Foundation Oliver biography]. Accessed 2010-09-07 In 2006, the state of New York paid $1.69 million to acquire 230 acre of Steepletop, with the intention to add the land to a nearby state forest preserve. The proceeds of the sale were to be used by the Edna St. Vincent Millay Society to restore the farmhouse and grounds and turn it into a museum. The museum has been open to the public since summer 2010, and guided tours of Steepletop and Millay's gardens are available from the end of May through the middle of October. Parts of the grounds of Steepletop, including the Millay Poetry Trail that leads to her grave, are now open to the public year-round.\n\nDetails of Millay's life were compiled by biographer Nancy Milford in the book titled Savage Beauty: The Life of Edna St Vincent Millay, published in 2001. Milford was sought out by Millay's only living connection at the time, her sister Norma Millay Ellis, and was chosen for her previous, successful biography Zelda. Milford would then go on to edit and write an introduction for a collection of Millay's poems called The Selected Poetry of Edna St. Vincent Millay.\n\nIn 2015, she was named by Equality Forum as one of their 31 Icons of the 2015 LGBT History Month.\n\nWorks\n\nMillay wrote five verse dramas early in her career, including Two Slatterns and a King and The Lamp and the Bell, a poem written for Vassar College about love between women. She was commissioned by the Metropolitan Opera House to write a libretto for an opera composed by Deems Taylor. The result, The King's Henchman, drew on the Anglo-Saxon Chronicle's account of Eadgar, King of Wessex, and was described as the most effectively and artistically wrought American opera ever to reach the stage. Within three weeks, her publishers had run through four editions of the book.\n\nHer pacifist verse drama Aria da Capo, a one-act play written for the Provincetown Players, is often anthologized.  It aired live as an episode of Academy Theatre in 1949 on NBC.\n\n\"Euclid alone has looked on Beauty bare\" (1922)  is an homage to the geometry of Euclid.Sinclair, N. et al. (2006). Mathematics and the Aesthetic. New York: Springer. p. 111. \"Renascence\"Millay, Edna St. Vincent. [http://www.bartleby.com/131/1.html \"Renascence\"] and \"The Ballad of the Harp-Weaver\"Millay, Edna St. Vincent. [http://www.americanpoems.com/poets/ednamillay/7356 \"The Ballad of the Harp-Weaver\"] are often considered her finest poems. On her death, The New York Times described her as \"an idol of the younger generation during the glorious early days of Greenwich Village [...] One of the greatest American poets of her time.\" Thomas Hardy said that America had two great attractions: the skyscraper and the poetry of Edna St. Vincent Millay.\n\nPublications\n\nThe following comprises works published during her lifetime:\n\nPoetry collections\n\n*  (title poem first published under name E. Vincent Millay in The Lyric Year, 1912; collection includes God's World), M. Kennerley, 1917. reprinted, Books for Libraries Press, 1972.\n* A Few Figs From Thistles: Poems and Four Sonnets, F. Shay, 1920, 2nd [enlarged] , \n*  (poems; includes Spring, Ode to Silence, and The Beanstalk); reprinted, Harper, 1935\n* The Ballad of the Harp-Weaver, F. Shay, 1922, reprinted as The Harp-Weaver, in The Harp-Weaver, and Other Poems (includes The Concert, Euclid Alone has Looked on Beauty Bare, and Sonnets from an Ungrafted Tree), Harper, 1923.\n* Poems, M. Secker, 1923.\n* (Under pseudonym Nancy Boyd) Distressing Dialogues, preface by Edna St. Vincent Millay, Harper, 1924.\n*  (includes The Buck in the Snow [also see below] and On Hearing a Symphony of Beethoven).\n*Fatal Interview (sonnets), Harper, 1931.\n*Wine from These Grapes (poems; includes Epitaph for the Race of Man and In the Grave No Flower), Harper, 1934.\n* (Translator with George Dillon; and author of introduction) Charles Baudelaire, Flowers of Evil, Harper, 1936.\n*Conversation at Midnight (narrative poem), Harper, 1937.\n*Huntsman, What Quarry? (poems), Harper, 1939.\n*There Are No Islands, Any More: Lines Written in Passion and in Deep Concern for England, France, and My Own Country, Harper, 1940.\n*Make Bright the Arrows: 1940 Notebook (poems), Harper, 1940.\n*Collected Sonnets of Edna St. Vincent Millay, Harper & Brothers, 1941.\n*The Murder of Lidice (poem), Harper, 1942.\n*Second April [and] The Buck in the Snow, introduction by William Rose Benét, Harper, 1950.\n*Mine the Harvest, A Collection of New Poem, Edited by her sister, Norma Millay, and posthumously published by Harper & Brothers, 1954 (This collection consists of the poems that Edna St. Vincent Millay was preparing at the time of her death).\n*Love is Not All, Engeler Urs Editor, 2008.\n\nPlays\n\n* (And director) Aria da capo (one-act play in verse; first produced in Greenwich Village, NY, December 5, 1919), M. Kennerley, 1921 (also see below).\n* The Lamp and the Bell (five-act play; first produced June 18, 1921), F. Shay, 1921 (also see below).\n* Two Slatterns and a King: A Moral Interlude (play), Stewart Kidd, 1921.\n* Three Plays (contains Two Slatterns and a King, Aria da capo, and The Lamp and the Bell), Harper, 1926.\n* (Author of libretto) The King's Henchman (three-act play; first produced in New York, February 17, 1927), Harper, 1927.\n* The Princess Marries the Page (one-act play), Harper, 1932. Edna St. Vincent Millay. http://en.wikipedia.org/?curid=9824."
  }
}
