{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12065",
  "eid" : "ffbd5f90-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778508809,
  "textBody" : "The Georgian Armed Forces () is the name of the unified armed forces of Georgia. The Georgian military is a defence force consisting of the Georgian Land Forces, Georgian Special Forces and a paramilitary organization, the Georgian National Guard. The national defense policy aims, based on the Constitution of Georgia, are to guarantee the preservation of the independence and sovereignty of the state and the integrity of its land area, territorial waters and airspace and its constitutional order. The armed forces of Georgia are under the authority of the Georgian Ministry of Defense. The Georgian Armed Forces is not to be confused with the American Civil War army known as the Army of Georgia\n\nThe Armed Forces were established in early 1917 from former Russian Imperial Army units on Georgian soil, irregular militias and Georgian personnel returning from World War I. Armed Forces consisted of the Regular Army and Peoples Guard in 1918-1921. On March 23, 1994, Georgia was one of the first former Soviet Republics to join the NATO Partnership for Peace program. Among the partners, Georgia was the first country that was able to submit the special documentation (May 2004) and on October 29, 2004 the North Atlantic Council approved the first Individual Partnership Action Plan (IPAP) for Georgia.\n\nHistory\n\nThe Georgia Train and Equip Program (GTEP) training was conducted using U.S. Special Operations Forces and U.S. Marine Corps forces from May 2002 to May 2004. During this time approximately 2,600 Georgian soldiers, including a headquarters staff element and 5 tactical units, received training. Another assistance program, the Georgia Security and Stability Operations Program (Georgia SSOP), was launched in January 2005 as a continuation of the (GTEP) of 2002-2004. Georgian contingents were involved in the Kosovo Force and continue to participate in the operations in Iraq and Afghanistan.\n\nThe GAF have been extensively reformed in the recent years to meet Georgia’s aspirations to join NATO and for better response to the existing challenges such as the ongoing tensions in the unresolved separatist conflict areas in Abkhazia and South Ossetia as well as to the threats of global terrorism. Georgia also views a large-scale foreign invasion and the spillover of conflicts from Russia’s North Caucasus as the worst potential near- and long-term scenarios, respectively.The Strategic Defense Review (2007), p. 77.\n\nOn August 8, 2008 the Georgian military conducted an operation in Georgia's breakaway region South Ossetia (see 2008 South Ossetia War). The operation led to an armed conflict with forces from the Russian Federation and resulted in the defeat and expulsion of Georgian forces from South Ossetia and Abkhazia. Following the military operations, Russia recognized independence of the regions, declared a decade ago.\n\nThe military budget of Georgia increased more than 50 times over the period from 2002 (US$18 mln.) to 2007 (US$780 mln.), reaching over 7% of Georgia's GDP. The military budget was then\ndoubled to the end of 2008 and currently since February 2009, counts 660 mln lari (US$366 mln.)\n\n21st century \n\nIn August 2008, following a series of fierce clashes in South Ossetia, Georgia attempted to take the separatist territory by force. In the resulting military conflict with Russia, Georgia was driven out of South Ossetia and Abkhazia, and lost parts of its military capabilities. According to Defence Minister Davit Kezerashvili, Georgia lost $400 million of material worth. Russian forces confiscated a total of 1,728 firearms. Out of its original 200 T-72 tanks, more than 35 were lost, including 24 that were captured intact. A total of 50 pieces of military equipment were captured, and some others destroyed. Parts of Georgia's relatively modern artillery and anti-aircraft units were captured and later destroyed. Russian forces sank four Georgian naval vessels in the port of Poti, a coast guard gunboat in a naval skirmish, and hauled away nine rigid-hull inflatable boats. The Georgian Air Force lost two L-29 jet trainers, one AN-2 airplane, and four helicopters, all destroyed on the ground. Despite these mostly non combat losses, President Mikheil Saakashvili claimed that Georgia had lost less than 5% of its military hardware, contradicting figures from the Georgian military itself.https://www.webcitation.org/5jZjEpcOy?url=http://www.jamestown.org/single/?no_cache%3D1%26tx_ttnews%5Btt_news%5D%3D33974\n\nReconstruction \n\nGeorgia immediately began a process of re-armament after the war. The conflict was immediately followed by a very quick replenishment program of the gaps in the single GAF arms components with an additional massive re-equipment and modernization program. Two Georgian naval vessels sunk in Poti were raised and returned to service, although one had to undergo repairs.  although their heaviest armaments were 25-30mm cannons. The Georgian Navy's remaining operational naval units were merged into the Georgian Coast Guard, which received training in search and seizure tactics from the United States. Ukraine delivered munitions and artillery systems to Georgia in September 2008,[http://www.rt.com/Top_News/2008-11-03/Ukraine-continues-to-arm-georgia_.html ]  and later supplied Georgia with 12 T-84 and 25 T-72 tanks, three BTR-80 armored personnel carriers, sixty portable air defence missiles, munitions for rocket launchers, and anti-tank guided missiles.[http://www.rt.com/Top_News/2009-10-08/ukraine-arms-trade-georgia.html ]  Ukraine continued to supply shipments of arms to Georgia, and announced that it would only stop if the United Nations Security Council imposed an arms embargo. Israel supplied Georgia with firearms after the war. The United States also delivered some amounts of arms and light military equipment to Georgia after the war, and trained Georgian personnel. Israel sold Georgia numerous Unmanned aerial vehicles, and supplied Georgia with two helicopters.  The United States also trained Georgian soldiers to be deployed in Afghanistan. Georgia also rebuilt its damaged military bases. In August 2010, Georgia was reported to be spending 30 times more on its military budget than on economic development. By late 2010 the Georgian military had reached a strength greater than pre-war levels and, after completing the reforms, decisively reduced military spending. Since 2010 Georgia started to produce its own line of armoured fighting vehicles, small arms, artillery systems and unmanned aerial vehicles.\n\n2014 NATO summit in Wales \n\nThe most recent major reforms started in late 2013 and have been expanded by the NATO Wales summit resolution of 2014. NATO officially announced the complete support of the country's efforts in establishing the efficient military force that is required to defend the country against any regional threats and agreed on delivering high end sophisticated defense capabilities and boosting the overall quality of the GAF. The package also includes a group of NATO experts monitoring the process in order to control and ensure its successful implementation for the given time period. Further a large training center for joint military drills will be constructed. NATO did not state that it would directly arm the GAF but fully assist in acquiring requested military hardware and that it would lift the general arms embargo on Georgia that was in effect since 2008. After the last major conflict with Russia, Georgia repeatedly was denied the delivery of modern anti-air and anti-tank weapons and other heavy equipment despite heavy shortage on said weapons and numerous demands and harsh criticism from both the former and current ruling parties.\n\nAlmost immediately after the summit US defense secretary Chuck Hagel announced during his visit to Georgia that the US will start providing long requested UH-60 Blackhawk helicopters which is an arrangement reportedly outside the NATO package. Russia reacted very critical to the plan of building an international training center in Georgia claiming it would bring instability to the region. The statement was denied by NATO reminding that Georgia is a PFP member and already provides similar capabilities such as an alpine warfare school for NATO and partner nations.http://www.nato.int/cps/en/natohq/topics_38988.htm\n\nAlternative to MAP \n\nDespite knowing that there wouldn't be any newcomers announced during the Wales summit, the Georgian government was confident that their country would at least receive the Membership Action Plan, which is the primary precondition for aspirant nations to become NATO member. Instead of the MAP Georgia was offered an alternative route which got accepted by the country's officials yet was met with very mixed reception. The new level of cooperation brings Georgia onto the list of special NATO partners together with Sweden and four other countries.\n\nOrganization \n\nThe overall strength of the GAF in 2013 was 43,475, including 37,825 active duty personnel, 1,940 civilians in educations sphere, 533 in health insurance and 3,177 for supply duties. The Georgian legislation (17 December 2010) had established that the strength of the armed forces should not exceed 37,000 up to the year 2011. Recruitment and size have been increased since 2008. Limitations do not extend to the state of war, military reserve and temporary staff of the Defence Ministry of Georgia. [http://www.parliament.ge/index.php?lang_idGEO&sec_id\n69&kan_detdet&kan_id\n4576 საქართველოს სამხედრო ძალების რაოდენობის დამტკიცების შესახებ]. Parliament of Georgia. December 17, 2010. Accessed April 12, 2011 Currently there are 37,000 active personnel. The number is to be maintained in 2017 as well.\n\n*Georgian Land Forces\n*National Guard of Georgia\n\nThe Land Forces form the largest component of the GAF responsible for providing land defence against any threat to the nation’s sovereignty and territorial integrity, supporting Border Police in border protection and civil authorities in counter-terrorist operations as well as providing units for NATO-led and coalition operations abroad. They are organized into infantry brigades, artillery and other supporting capacities operating at a battalion level.The Strategic Defense Review (2007), p. 74.\n\nThe Special Force Brigade is responsible for conducting special reconnaissance, unconventional warfare and counter-terrorism operations. The Georgian National Guard organizes and trains reservists in the peacetime and mobilizes them during a crisis or wartime.\n\nIn addition there is the Army Logistics Provision Command and the Military Training and Education Command, which supervises the Sachkhere Mountain Training School.\n\nGround arms \n\nThe structure of the Georgian Land Forces is based on brigade and battalion-sized military units. The main force consists of four infantry, two artillery, one air defence brigades and several independent battalions. Georgian brigades have a total manpower of 3,000 each excluding non-combat personnel. The overall strength of the land forces in 2013 was 37,825 (excluding active reserve), from which 21 were high-ranking officers, 6,166 officers and sergeants, 28,477 corporals and privates, 125 cadets and 388 civilians. Accordingly, to NATO structures and higher standards reached the brigades were downsized to optimal as well as the 5th brigade disbanded, also to increase the percentage of spending on arms acquirement, which was previously 2%, to 6% of the military budget. The goal is to reach at least 15% until 2020. The ground forces are equipped with a variety of weapons and vehicles. Special forces operate independently under MOD direction.\n\nThe Georgian Land Force consists of following primary combat formations (incomplete):\n\nRegular Forces \n\n* HQ, Land Forces Command (Tbilisi)\n** Central Command Point\n* Operational Command East\n** 1st Infantry Brigade (Tbilisi)\n*** 11th Telavi Light Infantry Battalion\n*** 12th Light Infantry Battalion (12th Commando) \n***13th \"Shavnabada\" Light Infantry Battalion \n** 4th Mechanised Infantry Brigade (Vaziani)\n***41st Mechanised Infantry Battalion\n***42nd Mechanised Infantry Battalion\n*** 43rd Mechanised Infantry Battalion\n** 1st Artillery Brigade (Vaziani)\n** Engineering Brigade\n* Operational Command West\n** 2nd Infantry Brigade (Senaki)See also http://desantura.ru/veteran/521/\n***21st Light Infantry Battalion\n***22nd Light Infantry Battalion\n*** 23rd Light Infantry Battalion\n** 3rd Infantry Brigade (The Mamelukes) (Kutaisi)\n*** 31st Light Infantry Battalion\n*** 32nd Light Infantry Battalion\n*** 33rd Light Infantry Battalion\n**  2nd Artillery Brigade (Khoni)\n** Separate Engineering Battalion\n** Medical company\n* Aviation and Air-defense Command\n** Aviation Brigade\n** Air-Defense Brigade (Kutaisi)\n** Transport Battalion\n** Logistic Battalion\n\nIndependent Units\n\n* Engineer Brigade\n* Reconnaissance Battalion (Kobuleti)\n* Medical Battalion (Saguramo)\n* Signal Battalion\n* Logistic Battalion\n\nIn 2011 the Georgian high command decided to divide its military forces into two main operational units; the Eastern-and Western Operational Groups. The aim was to create two independently acting military districts which would consist of forces in accordance to the strategic value of their deployment areas yet being balanced in their type of equipment. In case of war each group will be able to coordinate its operations independently from high command, having its own logistical and administrative reserves.\n\nSpecial Forces \n\n*  GSOF\n** Operational Headquarters (Tbilisi)\n*** Special Forces Group\n**** Naval Special Warfare Group\n*** Mountain-Reconnaissance Battalion / Ranger Battalion\n*** SOF Support/Maintenance Battalion\n*** Special Forces Training Center\n\nGeorgian Special Forces are subordinated under the MOD Special Operations Main Division to a brigade-level command structure. Each formation is split into several sub-divisions which are allocated on different Georgian regions, cities and strategically important areas. Most units are composed of veterans of past conflicts including the Soviet Invasion of Afghanistan, the wars in Georgia and the insurgency in Chechnya. Some soldiers served in former Soviet Army formations in Russia and the Ukraine.\n\nSince 2001, Georgia has intensified the training of its elite forces in cooperation with American, French, British, Israeli and other countries' special services. Georgian commandos participated in the Iraq War from 2003 until the complete withdrawal of the Georgian contingent in 2008 due to an escalation of hostilities in South Ossetia. According to independent accounts, a number of Georgian operatives were also deployed prior in Afghanistan to aide US Special Forces in hunting down Taliban leaders. Georgian officials have stated that a group of servicemen were deployed in Afghanistan for medical purposes.\n\nArmy Air Section (former Air Force) \n\nThe Strategic Defence Review in 2007 described the Air Force consists of aviation and air defence assets and provides security to Georgia’s airspace.\n\nThe Georgian Air Force was merged into the Army in 2010, and was renamed the Army Air Section, undergoing massive reorganization and restructuring. The additional operative section of the Georgian Land Forces currently consists of an unknown amount of planes, transport helicopters, gunships and 3,000 Personnel. The Georgian Air Force lost two helicopters and a number of transport and trainer aircraft on ground during the 2008 South Ossetia War,\n\nTwo major airfields are located near Tbilisi at Alekseevka and Marneuli.\n\nGeorgian Coast Guard (Former Naval Force) \n\nIn 2007 the Strategic Defence Review said the Georgian Navy protects Georgia’s territorial waters and contributes to the collective maritime defence in the Black Sea region.\n\nThe Georgian Navy was abolished in 2009 and was incorporated into the Coast Guard, which is not structurally part of the Georgian Armed Forces, but rather it is a subunit of the Border Guard of Georgia, which is under the control of Ministry of Internal Affairs of Georgia.  The Coast Guard of Georgia is responsible for maintenance of the sovereignty of the country and for protection of internal territorial waters and economic zones. The headquarters and a principal Coast Guard base are located at the Black Sea port of Poti.\n\nThe other, smaller Coast Guard base is in Batumi. Besides the naval force, the navy also includes a Special Counter-terrorist Detachment force. Georgia is also one of the founding members and a participant of the Black Sea Naval Co-operation Task Group. Before the war with Russia, the Georgian navy had 19 naval vessels. 4 of them were sunk during the conflict, and nine rigid-hull inflatables were captured by Russia. The Georgians raised and returned to service two of the sunken vessels, and partially replaced their losses with Turkish-built patrol/fast attack boats. Their heaviest armaments are 25−30mm cannons. However, no Georgian navy vessels are armed with ship-to-ship missiles.\n\nNational Guard of Georgia \n\nThe National Guard of Georgia was established on December 20, 1990 and was manned mainly by volunteers. It represents the first Georgian armed formation, which became the base of the foundation for modern Georgian Armed Forces. The Guard actively participated in the conflicts that occurred in Georgian territory (Samachablo, Abkhazia).\n\nThe National Guard used to consist of 20,554 personnel, but has now been reduced to 550. The main missions of the National Guard are:\n\n#Support civil government in crisis situations (natural, technological, ecological);\n#Register mobilization resources, study and deliver;\n#Convene, select and man of citizens on the basis of the agreement, for the units, subunits and bases of the Armed Forces;\n#Provide ceremonial activity support;\n#Assisting in training the Reserve Forces.\n\nArmy Reserve and Territorial Defence Forces \n\nThe Army Reserve is a professional reserve force consisting of former regular army personnel only. Due to the amount of experience, the Reserve personnel would be set-in for replacement of losses in the ranks of regular formations and will if needed also operate in the vanguard of a combined mechanized group or an infantry assault.\n\nThe Territorial Defence Forces were established for immediate readiness of the population in crisis events, such as war. Its main goals would be the fortification and defence of all populated and strategically important areas as well as providing quick aid or security for evacuation operations in case of natural catastrophes.\n\nOther than the active army reserve which consists of only ex military personnel, the Territorial Defence Forces are rather sparsely prepared for complex military operations. It instead provides more comfort for the regular forces in case of war. By acting as additional logistical arm and leaving the actual combat to them. With the land forces and reserve army engaged in direct action the Defence Force's most important task would be to construct trenches, bunkers and obstacles around strategically important areas and position themselves on systematically formed defensive lines. The number of conscripts does not exceed 140,000 and is reasonably large, as it is in the strategy's intention to use any possible geographical advantage over the enemy, when professionalism is compensated by that factor.\n\nThe TDF reservist is comparably poorly equipped for modern warfare. The number of combat, protection gear and supplies will be most likely limited in the event of war. The Territorial Defence Force consists of ordinary citizens of all occupations who undertake training in the basics of modern warfare. The weapons trained on are mainly of soviet origin and abandoned material used formerly by the regular army, including tanks. Such weapons are the AK series assault rifes and rocket propelled launchers RPG-7.\n\nCommissioned officers \n\nInternational cooperation \n\nGeorgian Armed Forces have been participating in peacekeeping missions (the Balkans, Persian Gulf) since 1999.\n\nUnits participating in peacekeeping missions are manned by professional soldiers, the duration of the mission is six months and participation is voluntary. The readiness assessment criteria are, as follows: health condition, physical fitness, professional skills and experience.\n\nPeacekeeping missions \n\nAbout 200 Georgian troops were deployed in the Kosovo (KFOR) in 1999-2008, 70 were deployed in Iraq (OIF) in 2003 and 50 in Afghanistan in 2004 (ISAF). From 2004 in Iraq were 300 Georgian troops. From 2005 approximately 850 troops were serving under Coalition Command (OIF and UNAMI). On July 2007 Georgia sent an extra 1,400 troops to Iraq; that brought the total number of troops in Iraq to 2,000. About 300 of these troops were assigned to Taskforce Petro and stationed at COP Cleary outside the town of Wahida near Salman Pak, Iraq. On August 8, 2008 Georgia announced it will withdraw 1,000 troops from Iraq due to rising hostilities with Russia. Their preparedness and training skills are evaluated on highest level by international experts. The entire Iraq contingent has been airlifted back to Georgia.\n\nHence, owing to participation in international peacekeeping missions the military members are able to obtain practical experience and to show readiness to cooperate with NATO and with other partner countries' forces.\n\nCurrently there are more than 1,570 Georgian combat troops  deployed in Helmand, Afghanistan where Georgia has thus far suffered 22 deaths and over a hundred injuries.[http://civil.ge/eng/article.php?id=23895 Tenth Georgia Soldier Killed in Afghanistan] Retrieved: September 1, 2011 In September 2012, Georgia stated that it would continue its contributions in Afghanistan following the 2014 NATO withdrawal.[http://www.armyrecognition.com/september_2012_new_army_military_defence_industry/georgia_will_continue_its_contribution_for_nato_mission_in_afghanistan_in_post-2014_period_1009122.html Georgia keeps helping Afghanistan] - Armyrecognition.com, September 10, 2012\nIn November 2012, Georgia had doubled the number of troops deployed to fight with Nato-led forces in Afghanistan to over 1,500. Georgia has 1,570 troops serving there, making the small Caucasus country of 4.5 million people the largest non-Nato contributor to the Afghanistan mission.\n\nSince 2014 Georgia has also contributed 140 troops to the EUFOR RCA peacekeeping mission in the Central African Republic.\n\nCommanders \n\nCommander in Chiefs of the Democratic Republic of Georgia (1918–1921)\n\n* Giorgi Kvinitadze, May 26, 1918 – December 13, 1920\n* Ilia Odishelidze, December 13, 1920 – February 16, 1921\n* Giorgi Kvinitadze, February 16, 1921 – March 17, 1921\n\nChiefs of General Staff of the Georgian Armed Forces (From 1991)\n\n* Jemal Kutateladze, August, 1991 – December, 1991\n* Avtandil Tskitishvili, January, 1992 – December, 1993\n* Guram Nikolaishvili, December, 1993 – June, 1994\n* Nodar Tatarashvili, June, 1994 – June, 1996\n* Zurab Meparishvili, June, 1996 – May, 1998\n\n* Joni Pirtskhalaishvili, May, 1998 – September, 2003\n* Givi Iukuridze, February, 2004 – August 25, 2004\n* Vakhtang Kapanadze, August 25, 2004 – February 18, 2005\n* Levan Nikoleishvili, February 18, 2005 – November 2, 2006\n* Zaza Gogava, November 2, 2006 – November 4, 2008\n\nChiefs of Joint Staff of the Georgian Armed Forces \n\n* Vladimer Chachibaia, November 4, 2008 – March 5, 2009\n* Devi Chankotadze, March 5, 2009 – October 8, 2012\n* Giorgi Kalandadze, October 8, 2012 – November 11, 2012\n* Vakhtang Kapanadze (In office), November 11, 2012 – December 4, 2012\n* Irakli Dzneladze, December 4, 2012 – November 22, 2013\n\nChiefs of General Staff of the Georgian Armed Forces \n\n* Vakhtang Kapanadze, November 22, 2013 – November 22, 2016\n* Vladimer Chachibaia, November 22, 2016 –\n\nMilitary Industry \n\nGeorgia has a long history of weapon production tracing back to ancient times. More recent developments however have their roots in the Soviet Union. In 1941 Georgia became one of the most important Soviet weapon manufacturing countries during the Second World War. It was responsible for providing the Soviet Army with all types of aircraft and ammunition. Tbilisi Aircraft Manufacturing's role didn't change after the war. Up until 1990 Georgia was constantly producing various types of fighter aircraft, most notably the Su-25 since it was produced almost exclusively in Georgia, unmanned areal vehicles, missiles, satellite components and orbital satellites. The company lost most of its functionality and production capability when the Soviet Union dissolved, yet was not abandoned. In the late 1990s Georgia's JSC RMP and later the newly established Ministry of Defence section DELTA started to work on the development of ballistic equipment using their own ingredients. The advanced research unit had successfully developed a variety of personal protection gear, such as bomb disposal suits and level I-IV body armour using classified mixtures of domestic resource. But these projects never went beyond some prototypes, mainly due to poor attention and financing from the government.\n\nWith foreign support primarily from the United States since 2005, Georgia became able to start building a solid industrial base for the military. From 2001 to 2007, Delta experimented with unmanned aerial vehicles and modified parts for helicopters and Su-25 aircraft until it got involved in the modification of Georgia's T-72 tank fleet. In 2009-10, with enough experience and expertise and the assistance of designer Zviad Tsikolia, Delta created its first prototype of an armored personnel carrier, the Didgori. Early tests were highly successful so that its first production line started already in 2011.  Two versions would initially serve in the armed forces in 2012, followed by different modifications from 2013 on . The Lazika is Delta's attempt to manufacture a suitable modular infantry fighting vehicle created for multiple tasks. While still under development, some Lazikas are already in active service. Delta considers the Lazika as one of the best vehicles of its class bearing armour technology similar to that of Israel. The remotely operated systems are locally produced as well. Due to \"misdirected financing\" and heavy interfering of former government officials, project Lazika was temporarily cancelled in late 2012, also due to \"sabotage\" and shortcomings in its armour research, but then later continued in early 2013 when a newly elected government took charge. As of 2007 Georgia is domestically producing uniforms for its military personnel. However early products were of cheap quality and such shortcomings were corrected not earlier than 2012. Since then only high quality fabricates are licensed for use. Other main production lines include various types of artillery systems such as MLRS, mortars and corresponding ammunition; anti tank weapons and devices; full uniform sets, ceremonial and for all service branches, those are boots, hats, assault vests, puches and backpacks etc. New kind of ballistic vests and helmets are being developed and produced for military service since 2013. The Georgian production bears techniques based on know-how from aero-space research which methodics differ slightly yet significantly from foreign analogues. Among the first units to use these new items, is the peacekeeping contingent currently stationed in the Central African Republic.\n\nBases",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Georgian Armed Forces" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12065" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Georgian Armed Forces () is the name of the unified armed forces of Georgia. The Georgian military is a defence force consisting of the Georgian Land Forces, Georgian Special Forces and a paramilitary organization, the Georgian National Guard. The national defense policy aims, based on the Constitution of Georgia, are to guarantee the preservation of the independence and sovereignty of the state and the integrity of its land area, territorial waters and airspace and its constitutional order. The armed forces of Georgia are under the authority of the Georgian Ministry of Defense. The Georgian Armed Forces is not to be confused with the American Civil War army known as the Army of Georgia\n\nThe Armed Forces were established in early 1917 from former Russian Imperial Army units on Georgian soil, irregular militias and Georgian personnel returning from World War I. Armed Forces consisted of the Regular Army and Peoples Guard in 1918-1921. On March 23, 1994, Georgia was one of the first former Soviet Republics to join the NATO Partnership for Peace program. Among the partners, Georgia was the first country that was able to submit the special documentation (May 2004) and on October 29, 2004 the North Atlantic Council approved the first Individual Partnership Action Plan (IPAP) for Georgia.\n\nHistory\n\nThe Georgia Train and Equip Program (GTEP) training was conducted using U.S. Special Operations Forces and U.S. Marine Corps forces from May 2002 to May 2004. During this time approximately 2,600 Georgian soldiers, including a headquarters staff element and 5 tactical units, received training. Another assistance program, the Georgia Security and Stability Operations Program (Georgia SSOP), was launched in January 2005 as a continuation of the (GTEP) of 2002-2004. Georgian contingents were involved in the Kosovo Force and continue to participate in the operations in Iraq and Afghanistan.\n\nThe GAF have been extensively reformed in the recent years to meet Georgia’s aspirations to join NATO and for better response to the existing challenges such as the ongoing tensions in the unresolved separatist conflict areas in Abkhazia and South Ossetia as well as to the threats of global terrorism. Georgia also views a large-scale foreign invasion and the spillover of conflicts from Russia’s North Caucasus as the worst potential near- and long-term scenarios, respectively.The Strategic Defense Review (2007), p. 77.\n\nOn August 8, 2008 the Georgian military conducted an operation in Georgia's breakaway region South Ossetia (see 2008 South Ossetia War). The operation led to an armed conflict with forces from the Russian Federation and resulted in the defeat and expulsion of Georgian forces from South Ossetia and Abkhazia. Following the military operations, Russia recognized independence of the regions, declared a decade ago.\n\nThe military budget of Georgia increased more than 50 times over the period from 2002 (US$18 mln.) to 2007 (US$780 mln.), reaching over 7% of Georgia's GDP. The military budget was then\ndoubled to the end of 2008 and currently since February 2009, counts 660 mln lari (US$366 mln.)\n\n21st century \n\nIn August 2008, following a series of fierce clashes in South Ossetia, Georgia attempted to take the separatist territory by force. In the resulting military conflict with Russia, Georgia was driven out of South Ossetia and Abkhazia, and lost parts of its military capabilities. According to Defence Minister Davit Kezerashvili, Georgia lost $400 million of material worth. Russian forces confiscated a total of 1,728 firearms. Out of its original 200 T-72 tanks, more than 35 were lost, including 24 that were captured intact. A total of 50 pieces of military equipment were captured, and some others destroyed. Parts of Georgia's relatively modern artillery and anti-aircraft units were captured and later destroyed. Russian forces sank four Georgian naval vessels in the port of Poti, a coast guard gunboat in a naval skirmish, and hauled away nine rigid-hull inflatable boats. The Georgian Air Force lost two L-29 jet trainers, one AN-2 airplane, and four helicopters, all destroyed on the ground. Despite these mostly non combat losses, President Mikheil Saakashvili claimed that Georgia had lost less than 5% of its military hardware, contradicting figures from the Georgian military itself.https://www.webcitation.org/5jZjEpcOy?url=http://www.jamestown.org/single/?no_cache%3D1%26tx_ttnews%5Btt_news%5D%3D33974\n\nReconstruction \n\nGeorgia immediately began a process of re-armament after the war. The conflict was immediately followed by a very quick replenishment program of the gaps in the single GAF arms components with an additional massive re-equipment and modernization program. Two Georgian naval vessels sunk in Poti were raised and returned to service, although one had to undergo repairs.  although their heaviest armaments were 25-30mm cannons. The Georgian Navy's remaining operational naval units were merged into the Georgian Coast Guard, which received training in search and seizure tactics from the United States. Ukraine delivered munitions and artillery systems to Georgia in September 2008,[http://www.rt.com/Top_News/2008-11-03/Ukraine-continues-to-arm-georgia_.html ]  and later supplied Georgia with 12 T-84 and 25 T-72 tanks, three BTR-80 armored personnel carriers, sixty portable air defence missiles, munitions for rocket launchers, and anti-tank guided missiles.[http://www.rt.com/Top_News/2009-10-08/ukraine-arms-trade-georgia.html ]  Ukraine continued to supply shipments of arms to Georgia, and announced that it would only stop if the United Nations Security Council imposed an arms embargo. Israel supplied Georgia with firearms after the war. The United States also delivered some amounts of arms and light military equipment to Georgia after the war, and trained Georgian personnel. Israel sold Georgia numerous Unmanned aerial vehicles, and supplied Georgia with two helicopters.  The United States also trained Georgian soldiers to be deployed in Afghanistan. Georgia also rebuilt its damaged military bases. In August 2010, Georgia was reported to be spending 30 times more on its military budget than on economic development. By late 2010 the Georgian military had reached a strength greater than pre-war levels and, after completing the reforms, decisively reduced military spending. Since 2010 Georgia started to produce its own line of armoured fighting vehicles, small arms, artillery systems and unmanned aerial vehicles.\n\n2014 NATO summit in Wales \n\nThe most recent major reforms started in late 2013 and have been expanded by the NATO Wales summit resolution of 2014. NATO officially announced the complete support of the country's efforts in establishing the efficient military force that is required to defend the country against any regional threats and agreed on delivering high end sophisticated defense capabilities and boosting the overall quality of the GAF. The package also includes a group of NATO experts monitoring the process in order to control and ensure its successful implementation for the given time period. Further a large training center for joint military drills will be constructed. NATO did not state that it would directly arm the GAF but fully assist in acquiring requested military hardware and that it would lift the general arms embargo on Georgia that was in effect since 2008. After the last major conflict with Russia, Georgia repeatedly was denied the delivery of modern anti-air and anti-tank weapons and other heavy equipment despite heavy shortage on said weapons and numerous demands and harsh criticism from both the former and current ruling parties.\n\nAlmost immediately after the summit US defense secretary Chuck Hagel announced during his visit to Georgia that the US will start providing long requested UH-60 Blackhawk helicopters which is an arrangement reportedly outside the NATO package. Russia reacted very critical to the plan of building an international training center in Georgia claiming it would bring instability to the region. The statement was denied by NATO reminding that Georgia is a PFP member and already provides similar capabilities such as an alpine warfare school for NATO and partner nations.http://www.nato.int/cps/en/natohq/topics_38988.htm\n\nAlternative to MAP \n\nDespite knowing that there wouldn't be any newcomers announced during the Wales summit, the Georgian government was confident that their country would at least receive the Membership Action Plan, which is the primary precondition for aspirant nations to become NATO member. Instead of the MAP Georgia was offered an alternative route which got accepted by the country's officials yet was met with very mixed reception. The new level of cooperation brings Georgia onto the list of special NATO partners together with Sweden and four other countries.\n\nOrganization \n\nThe overall strength of the GAF in 2013 was 43,475, including 37,825 active duty personnel, 1,940 civilians in educations sphere, 533 in health insurance and 3,177 for supply duties. The Georgian legislation (17 December 2010) had established that the strength of the armed forces should not exceed 37,000 up to the year 2011. Recruitment and size have been increased since 2008. Limitations do not extend to the state of war, military reserve and temporary staff of the Defence Ministry of Georgia. [http://www.parliament.ge/index.php?lang_idGEO&sec_id\n69&kan_detdet&kan_id\n4576 საქართველოს სამხედრო ძალების რაოდენობის დამტკიცების შესახებ]. Parliament of Georgia. December 17, 2010. Accessed April 12, 2011 Currently there are 37,000 active personnel. The number is to be maintained in 2017 as well.\n\n*Georgian Land Forces\n*National Guard of Georgia\n\nThe Land Forces form the largest component of the GAF responsible for providing land defence against any threat to the nation’s sovereignty and territorial integrity, supporting Border Police in border protection and civil authorities in counter-terrorist operations as well as providing units for NATO-led and coalition operations abroad. They are organized into infantry brigades, artillery and other supporting capacities operating at a battalion level.The Strategic Defense Review (2007), p. 74.\n\nThe Special Force Brigade is responsible for conducting special reconnaissance, unconventional warfare and counter-terrorism operations. The Georgian National Guard organizes and trains reservists in the peacetime and mobilizes them during a crisis or wartime.\n\nIn addition there is the Army Logistics Provision Command and the Military Training and Education Command, which supervises the Sachkhere Mountain Training School.\n\nGround arms \n\nThe structure of the Georgian Land Forces is based on brigade and battalion-sized military units. The main force consists of four infantry, two artillery, one air defence brigades and several independent battalions. Georgian brigades have a total manpower of 3,000 each excluding non-combat personnel. The overall strength of the land forces in 2013 was 37,825 (excluding active reserve), from which 21 were high-ranking officers, 6,166 officers and sergeants, 28,477 corporals and privates, 125 cadets and 388 civilians. Accordingly, to NATO structures and higher standards reached the brigades were downsized to optimal as well as the 5th brigade disbanded, also to increase the percentage of spending on arms acquirement, which was previously 2%, to 6% of the military budget. The goal is to reach at least 15% until 2020. The ground forces are equipped with a variety of weapons and vehicles. Special forces operate independently under MOD direction.\n\nThe Georgian Land Force consists of following primary combat formations (incomplete):\n\nRegular Forces \n\n* HQ, Land Forces Command (Tbilisi)\n** Central Command Point\n* Operational Command East\n** 1st Infantry Brigade (Tbilisi)\n*** 11th Telavi Light Infantry Battalion\n*** 12th Light Infantry Battalion (12th Commando) \n***13th \"Shavnabada\" Light Infantry Battalion \n** 4th Mechanised Infantry Brigade (Vaziani)\n***41st Mechanised Infantry Battalion\n***42nd Mechanised Infantry Battalion\n*** 43rd Mechanised Infantry Battalion\n** 1st Artillery Brigade (Vaziani)\n** Engineering Brigade\n* Operational Command West\n** 2nd Infantry Brigade (Senaki)See also http://desantura.ru/veteran/521/\n***21st Light Infantry Battalion\n***22nd Light Infantry Battalion\n*** 23rd Light Infantry Battalion\n** 3rd Infantry Brigade (The Mamelukes) (Kutaisi)\n*** 31st Light Infantry Battalion\n*** 32nd Light Infantry Battalion\n*** 33rd Light Infantry Battalion\n**  2nd Artillery Brigade (Khoni)\n** Separate Engineering Battalion\n** Medical company\n* Aviation and Air-defense Command\n** Aviation Brigade\n** Air-Defense Brigade (Kutaisi)\n** Transport Battalion\n** Logistic Battalion\n\nIndependent Units\n\n* Engineer Brigade\n* Reconnaissance Battalion (Kobuleti)\n* Medical Battalion (Saguramo)\n* Signal Battalion\n* Logistic Battalion\n\nIn 2011 the Georgian high command decided to divide its military forces into two main operational units; the Eastern-and Western Operational Groups. The aim was to create two independently acting military districts which would consist of forces in accordance to the strategic value of their deployment areas yet being balanced in their type of equipment. In case of war each group will be able to coordinate its operations independently from high command, having its own logistical and administrative reserves.\n\nSpecial Forces \n\n*  GSOF\n** Operational Headquarters (Tbilisi)\n*** Special Forces Group\n**** Naval Special Warfare Group\n*** Mountain-Reconnaissance Battalion / Ranger Battalion\n*** SOF Support/Maintenance Battalion\n*** Special Forces Training Center\n\nGeorgian Special Forces are subordinated under the MOD Special Operations Main Division to a brigade-level command structure. Each formation is split into several sub-divisions which are allocated on different Georgian regions, cities and strategically important areas. Most units are composed of veterans of past conflicts including the Soviet Invasion of Afghanistan, the wars in Georgia and the insurgency in Chechnya. Some soldiers served in former Soviet Army formations in Russia and the Ukraine.\n\nSince 2001, Georgia has intensified the training of its elite forces in cooperation with American, French, British, Israeli and other countries' special services. Georgian commandos participated in the Iraq War from 2003 until the complete withdrawal of the Georgian contingent in 2008 due to an escalation of hostilities in South Ossetia. According to independent accounts, a number of Georgian operatives were also deployed prior in Afghanistan to aide US Special Forces in hunting down Taliban leaders. Georgian officials have stated that a group of servicemen were deployed in Afghanistan for medical purposes.\n\nArmy Air Section (former Air Force) \n\nThe Strategic Defence Review in 2007 described the Air Force consists of aviation and air defence assets and provides security to Georgia’s airspace.\n\nThe Georgian Air Force was merged into the Army in 2010, and was renamed the Army Air Section, undergoing massive reorganization and restructuring. The additional operative section of the Georgian Land Forces currently consists of an unknown amount of planes, transport helicopters, gunships and 3,000 Personnel. The Georgian Air Force lost two helicopters and a number of transport and trainer aircraft on ground during the 2008 South Ossetia War,\n\nTwo major airfields are located near Tbilisi at Alekseevka and Marneuli.\n\nGeorgian Coast Guard (Former Naval Force) \n\nIn 2007 the Strategic Defence Review said the Georgian Navy protects Georgia’s territorial waters and contributes to the collective maritime defence in the Black Sea region.\n\nThe Georgian Navy was abolished in 2009 and was incorporated into the Coast Guard, which is not structurally part of the Georgian Armed Forces, but rather it is a subunit of the Border Guard of Georgia, which is under the control of Ministry of Internal Affairs of Georgia.  The Coast Guard of Georgia is responsible for maintenance of the sovereignty of the country and for protection of internal territorial waters and economic zones. The headquarters and a principal Coast Guard base are located at the Black Sea port of Poti.\n\nThe other, smaller Coast Guard base is in Batumi. Besides the naval force, the navy also includes a Special Counter-terrorist Detachment force. Georgia is also one of the founding members and a participant of the Black Sea Naval Co-operation Task Group. Before the war with Russia, the Georgian navy had 19 naval vessels. 4 of them were sunk during the conflict, and nine rigid-hull inflatables were captured by Russia. The Georgians raised and returned to service two of the sunken vessels, and partially replaced their losses with Turkish-built patrol/fast attack boats. Their heaviest armaments are 25−30mm cannons. However, no Georgian navy vessels are armed with ship-to-ship missiles.\n\nNational Guard of Georgia \n\nThe National Guard of Georgia was established on December 20, 1990 and was manned mainly by volunteers. It represents the first Georgian armed formation, which became the base of the foundation for modern Georgian Armed Forces. The Guard actively participated in the conflicts that occurred in Georgian territory (Samachablo, Abkhazia).\n\nThe National Guard used to consist of 20,554 personnel, but has now been reduced to 550. The main missions of the National Guard are:\n\n#Support civil government in crisis situations (natural, technological, ecological);\n#Register mobilization resources, study and deliver;\n#Convene, select and man of citizens on the basis of the agreement, for the units, subunits and bases of the Armed Forces;\n#Provide ceremonial activity support;\n#Assisting in training the Reserve Forces.\n\nArmy Reserve and Territorial Defence Forces \n\nThe Army Reserve is a professional reserve force consisting of former regular army personnel only. Due to the amount of experience, the Reserve personnel would be set-in for replacement of losses in the ranks of regular formations and will if needed also operate in the vanguard of a combined mechanized group or an infantry assault.\n\nThe Territorial Defence Forces were established for immediate readiness of the population in crisis events, such as war. Its main goals would be the fortification and defence of all populated and strategically important areas as well as providing quick aid or security for evacuation operations in case of natural catastrophes.\n\nOther than the active army reserve which consists of only ex military personnel, the Territorial Defence Forces are rather sparsely prepared for complex military operations. It instead provides more comfort for the regular forces in case of war. By acting as additional logistical arm and leaving the actual combat to them. With the land forces and reserve army engaged in direct action the Defence Force's most important task would be to construct trenches, bunkers and obstacles around strategically important areas and position themselves on systematically formed defensive lines. The number of conscripts does not exceed 140,000 and is reasonably large, as it is in the strategy's intention to use any possible geographical advantage over the enemy, when professionalism is compensated by that factor.\n\nThe TDF reservist is comparably poorly equipped for modern warfare. The number of combat, protection gear and supplies will be most likely limited in the event of war. The Territorial Defence Force consists of ordinary citizens of all occupations who undertake training in the basics of modern warfare. The weapons trained on are mainly of soviet origin and abandoned material used formerly by the regular army, including tanks. Such weapons are the AK series assault rifes and rocket propelled launchers RPG-7.\n\nCommissioned officers \n\nInternational cooperation \n\nGeorgian Armed Forces have been participating in peacekeeping missions (the Balkans, Persian Gulf) since 1999.\n\nUnits participating in peacekeeping missions are manned by professional soldiers, the duration of the mission is six months and participation is voluntary. The readiness assessment criteria are, as follows: health condition, physical fitness, professional skills and experience.\n\nPeacekeeping missions \n\nAbout 200 Georgian troops were deployed in the Kosovo (KFOR) in 1999-2008, 70 were deployed in Iraq (OIF) in 2003 and 50 in Afghanistan in 2004 (ISAF). From 2004 in Iraq were 300 Georgian troops. From 2005 approximately 850 troops were serving under Coalition Command (OIF and UNAMI). On July 2007 Georgia sent an extra 1,400 troops to Iraq; that brought the total number of troops in Iraq to 2,000. About 300 of these troops were assigned to Taskforce Petro and stationed at COP Cleary outside the town of Wahida near Salman Pak, Iraq. On August 8, 2008 Georgia announced it will withdraw 1,000 troops from Iraq due to rising hostilities with Russia. Their preparedness and training skills are evaluated on highest level by international experts. The entire Iraq contingent has been airlifted back to Georgia.\n\nHence, owing to participation in international peacekeeping missions the military members are able to obtain practical experience and to show readiness to cooperate with NATO and with other partner countries' forces.\n\nCurrently there are more than 1,570 Georgian combat troops  deployed in Helmand, Afghanistan where Georgia has thus far suffered 22 deaths and over a hundred injuries.[http://civil.ge/eng/article.php?id=23895 Tenth Georgia Soldier Killed in Afghanistan] Retrieved: September 1, 2011 In September 2012, Georgia stated that it would continue its contributions in Afghanistan following the 2014 NATO withdrawal.[http://www.armyrecognition.com/september_2012_new_army_military_defence_industry/georgia_will_continue_its_contribution_for_nato_mission_in_afghanistan_in_post-2014_period_1009122.html Georgia keeps helping Afghanistan] - Armyrecognition.com, September 10, 2012\nIn November 2012, Georgia had doubled the number of troops deployed to fight with Nato-led forces in Afghanistan to over 1,500. Georgia has 1,570 troops serving there, making the small Caucasus country of 4.5 million people the largest non-Nato contributor to the Afghanistan mission.\n\nSince 2014 Georgia has also contributed 140 troops to the EUFOR RCA peacekeeping mission in the Central African Republic.\n\nCommanders \n\nCommander in Chiefs of the Democratic Republic of Georgia (1918–1921)\n\n* Giorgi Kvinitadze, May 26, 1918 – December 13, 1920\n* Ilia Odishelidze, December 13, 1920 – February 16, 1921\n* Giorgi Kvinitadze, February 16, 1921 – March 17, 1921\n\nChiefs of General Staff of the Georgian Armed Forces (From 1991)\n\n* Jemal Kutateladze, August, 1991 – December, 1991\n* Avtandil Tskitishvili, January, 1992 – December, 1993\n* Guram Nikolaishvili, December, 1993 – June, 1994\n* Nodar Tatarashvili, June, 1994 – June, 1996\n* Zurab Meparishvili, June, 1996 – May, 1998\n\n* Joni Pirtskhalaishvili, May, 1998 – September, 2003\n* Givi Iukuridze, February, 2004 – August 25, 2004\n* Vakhtang Kapanadze, August 25, 2004 – February 18, 2005\n* Levan Nikoleishvili, February 18, 2005 – November 2, 2006\n* Zaza Gogava, November 2, 2006 – November 4, 2008\n\nChiefs of Joint Staff of the Georgian Armed Forces \n\n* Vladimer Chachibaia, November 4, 2008 – March 5, 2009\n* Devi Chankotadze, March 5, 2009 – October 8, 2012\n* Giorgi Kalandadze, October 8, 2012 – November 11, 2012\n* Vakhtang Kapanadze (In office), November 11, 2012 – December 4, 2012\n* Irakli Dzneladze, December 4, 2012 – November 22, 2013\n\nChiefs of General Staff of the Georgian Armed Forces \n\n* Vakhtang Kapanadze, November 22, 2013 – November 22, 2016\n* Vladimer Chachibaia, November 22, 2016 –\n\nMilitary Industry \n\nGeorgia has a long history of weapon production tracing back to ancient times. More recent developments however have their roots in the Soviet Union. In 1941 Georgia became one of the most important Soviet weapon manufacturing countries during the Second World War. It was responsible for providing the Soviet Army with all types of aircraft and ammunition. Tbilisi Aircraft Manufacturing's role didn't change after the war. Up until 1990 Georgia was constantly producing various types of fighter aircraft, most notably the Su-25 since it was produced almost exclusively in Georgia, unmanned areal vehicles, missiles, satellite components and orbital satellites. The company lost most of its functionality and production capability when the Soviet Union dissolved, yet was not abandoned. In the late 1990s Georgia's JSC RMP and later the newly established Ministry of Defence section DELTA started to work on the development of ballistic equipment using their own ingredients. The advanced research unit had successfully developed a variety of personal protection gear, such as bomb disposal suits and level I-IV body armour using classified mixtures of domestic resource. But these projects never went beyond some prototypes, mainly due to poor attention and financing from the government.\n\nWith foreign support primarily from the United States since 2005, Georgia became able to start building a solid industrial base for the military. From 2001 to 2007, Delta experimented with unmanned aerial vehicles and modified parts for helicopters and Su-25 aircraft until it got involved in the modification of Georgia's T-72 tank fleet. In 2009-10, with enough experience and expertise and the assistance of designer Zviad Tsikolia, Delta created its first prototype of an armored personnel carrier, the Didgori. Early tests were highly successful so that its first production line started already in 2011.  Two versions would initially serve in the armed forces in 2012, followed by different modifications from 2013 on . The Lazika is Delta's attempt to manufacture a suitable modular infantry fighting vehicle created for multiple tasks. While still under development, some Lazikas are already in active service. Delta considers the Lazika as one of the best vehicles of its class bearing armour technology similar to that of Israel. The remotely operated systems are locally produced as well. Due to \"misdirected financing\" and heavy interfering of former government officials, project Lazika was temporarily cancelled in late 2012, also due to \"sabotage\" and shortcomings in its armour research, but then later continued in early 2013 when a newly elected government took charge. As of 2007 Georgia is domestically producing uniforms for its military personnel. However early products were of cheap quality and such shortcomings were corrected not earlier than 2012. Since then only high quality fabricates are licensed for use. Other main production lines include various types of artillery systems such as MLRS, mortars and corresponding ammunition; anti tank weapons and devices; full uniform sets, ceremonial and for all service branches, those are boots, hats, assault vests, puches and backpacks etc. New kind of ballistic vests and helmets are being developed and produced for military service since 2013. The Georgian production bears techniques based on know-how from aero-space research which methodics differ slightly yet significantly from foreign analogues. Among the first units to use these new items, is the peacekeeping contingent currently stationed in the Central African Republic.\n\nBases. Georgian Armed Forces. http://en.wikipedia.org/?curid=12065."
  }
}
