{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=888",
  "eid" : "a83e8a00-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778362017,
  "textBody" : "Alfred Elton van Vogt  (; April 26, 1912 – January 26, 2000) was a Canadian-born science fiction author.  He is regarded as one of the most popular, influential and complex practitioners of the mid-twentieth century, the genre's so-called Golden Age.\"Although [van Vogt] catered for the pulps, he intensified the emotional impact and complexity of the stories they would bear[.]\" \n\nEarly life and writings\n\nVan Vogt was born on a farm in Edenburg (a Russian Mennonite community east of Gretna, Manitoba, Canada). Until age four, van Vogt and his family spoke only a dialect of Low German at home.Panshin, Alexei [http://www.panshin.com/articles/vanvogt/vanvogt1.html \"Man Beyond Man. The Early Stories of A. E. van Vogt\" (page 1)]. Retrieved August 29, 2010. Van Vogt's father, a lawyer, moved his family several times. His son found these moves difficult, remarking in later life:\n\nVan Vogt began his writing career with stories true confession style pulp magazines such as True Story. He decided to switch to writing science fiction, which he enjoye.Elliot, Jeffery: \"An Interview with A. E. Van Vogt\", Science Fiction Review #23, 1977. Available online http://www.angelfire.com/art/megathink/vanvogt/vanvogt_interview.html Retrieved on August 29, 2010 He was inspired by the August 1938 issue of Astounding Science Fiction, which he picked up at a newsstand. John W. Campbell's novelette \"Who Goes There?\" (later adapted into The Thing from Another World and The Thing) inspired van Vogt to write \"Vault of the Beast\", which he submitted to that same magazine. Campbell, who edited Astounding (and had written the story under a pseudonym), sent van Vogt a ]rejection letter, but one which encouraged van Vogt to try again. Van Vogt sent another story, entitled \"Black Destroyer,\" which was accepted. A revised version of \"Vault of the Beast\" would be published in 1940.\n\nVan Vogt's first SF publication was inspired by The Voyage of the Beagle by Charles Darwin.Drake, H. L., A. E. van Vogt: Science Fantasy's Icon, Booklocker.com Inc., 2001, page 36. \"The Black Destroyer\" was published in July 1939 by John W. Campbell in Astounding Science Fiction, the centennial year of Darwin's journal. It featured a fierce, carnivorous alien, the coeurl, stalking the crew of an exploration spaceship. \"Discord in Scarlet\" was his second story to be published, also appearing as the cover story.[http://www.icshi.net/worlds/voyageof.htm \"The Voyage of the Space Beagle\"] (cover images for numerous editions and adaptations of \"The Black Destroyer\" and its series). The Weird Worlds of A. E. van Vogt. Magnus Axelsson (pre-2000 to 2009). Now hosted by icshi.net. Retrieved April 4, 2013. It was accompanied by interior illustrations created by Frank Kramer and Paul Orban. Panshin, Alexei (1994). [http://www.icshi.net/worlds/intoslan.htm \"Introduction to Slan\"]. Connecticut: The Easton Press. Quote: \"His first published SF story was \"Black Destroyer\" in the July 1939 Astounding. Not only was \"Black Destroyer\" pictured on the cover of the magazine, but it would be recognized as one of the most significant stories published in Astounding that year\". (Van Vogt and Kramer thus debuted in the issue of Astounding that is sometimes identified as the start of the Golden Age of Science Fiction.For example, Peter Nicholls () says \"The beginning of Campbell's particular Golden Age of SF can be pinpointed as the summer of 1939\" and goes on to begin the discussion with the July 1939 issue. Lester del Rey () comments that \"July was the turning point\".) The former story served as the inspiration for multiple science fiction movies. In 1950, the two were combined with two other stories as a fix-up novel, The Voyage of the Space Beagle (Simon & Schuster), which was published in at least five European languages by 1955. Positing the need for exobiologists who will appreciate the differences between the inhabitants of other planets and ourselves, it stresses the importance of the civilian rather than military in exploration of other cultures.\n\nVan Vogt's first completed novel, and one of his most famous, is Slan (Arkham House, 1946), which Campbell serialized in Astounding September to December 1940. Using what became one of van Vogt's recurring themes, it told the story of a 9-year-old superman living in a world in which his kind are slain by Homo sapiens.\n\nOthers saw van Vogt's talent and stardom from his first story, and in 1941, van Vogt decided to become a full-time writer, quitting his job at the Canadian Department of National Defence. Prolific for a few years, van Vogt wrote many short stories. In the 1950s, many of them were retrospectively patched together into novels, or \"fixups\" as he called them, a term that entered the vocabulary of science-fiction criticism. When the original stories were related (e.g., The War against the Rull) this was often successful. When not (e.g., Quest for the Future) the disparate stories thrown together generally made for a less coherent plot.\n\nPost-war life and work\n\nIn 1944, van Vogt moved to Hollywood, where his writing took on new dimensions after World War II. He was always interested in the idea of all-encompassing systems of knowledge (akin to modern meta-systems)—the characters in his very first story used a system called \"Nexialism\" to analyze the alien's behavior, and he became interested in the general semantics of Alfred Korzybski.\n\nHe subsequently wrote three novels merging these overarching themes, The World of Null-A and The Pawns of Null-A in the late 1940s, and Null-A Three in the early 1980s. Null-A, or non-Aristotelian logic, refers to the capacity for, and practice of, using intuitive, inductive reasoning (compare fuzzy logic), rather than reflexive, or conditioned, deductive reasoning.\n\nVan Vogt was profoundly affected by revelations of totalitarian police states that emerged after World War II. He wrote a mainstream novel that he set in Communist China, The Violent Man (1962); he said that to research this book he had read 100 books about China. Into this book he incorporated his view of \"the violent male type\", which he described as a \"man who had to be right\", a man who \"instantly attracts women\" and who he said were the men who \"run the world\".\n\nAt the same time, in his fiction, van Vogt was consistently sympathetic to absolute monarchy as a form of government. This was the case, for instance, in the Weapon Shop series, the Mixed Men series, and in single stories such as \"Heir Apparent\" (1945), whose protagonist was described as a \"benevolent dictator\".\n\nVan Vogt systematized his writing method, using scenes of 800 words or so where a new complication was added or something resolved. Several of his stories hinge on temporal conundra, a favorite theme. He stated that he acquired many of his writing techniques from three books: Narrative Technique by Thomas Uzzell, The Only Two Ways to Write a Story by John Gallishaw, and Twenty Problems of the Fiction Writer by Gallishaw.\n\nHe also claimed many of his ideas came from dreams; throughout his writing life he arranged to be awakened every 90 minutes during his sleep period so he could write down his dreams.Platt, Charles, [http://www.icshi.net/worlds/Plattprofile.htm \"A. E. van Vogt – A Profile\"]. From Who Writes Science Fiction? (London: Savoy Books, 1980); Dream Makers: The Uncommon People Who Write Science Fiction (Berkeley Books, 1980).\n\nVan Vogt published perhaps his most famous story, \"Enchanted Village\", in the July 1950 issue of Other Worlds Science Stories. It was reprinted in over 20 collections or anthologies, and appeared many times in translation.http://www.isfdb.org/cgi-bin/title.cgi?56655 Retrieved 10 March 2017\n\nIn 1950, van Vogt was briefly appointed as head of L. Ron Hubbard's Dianetics operation in California. Dianetics was the secular precursor to Hubbard's Church of Scientology. The operation went broke nine months later, but never went bankrupt, due to van Vogt's arrangements with creditors. Van Vogt and his wife opened their own Dianetics centre, partly financed by his writings, until he \"signed off\" around 1961. At the time of his interview with Charles Platt, van Vogt was still president of the Californian Association of Dianetic Auditors.\n\nIn 1951, he published The Weapon Shops of Isher. In the same decade, van Vogt also produced collections and  fixups such as The Mixed Men (1952), The War Against the Rull (1959), and the two \"Clane\" novels, Empire of the Atom (1957) and The Wizard of Linn (1962), which were inspired (like Asimov's Foundation series) by Roman imperial history, specifically the reign of Claudius.  His later novels included fixups such as The Beast (also known as Moonbeast) (1963), Rogue Ship (1965), Quest for the Future (1970) and Supermind (1977); expanded short stories such as The Darkness on Diamondia (1972) and Future Glitter (also known as Tyranopolis; 1973); original novels such as Children of Tomorrow (1970), The Battle of Forever (1971) and The Anarchistic Colossus (1977); plus sequels to his classic works, many of which were promised, but only one of which appeared, Null-A Three (1984; originally published in French). Several later books were original in Europe, and at least one novel only ever appeared in Italian.\n\nOn January 26, 2000, van Vogt died in Los Angeles, United States from Alzheimer's disease, survived by his second wife, the former Lydia Bereginsky.\n\nCritical reception\n\nCritical opinion about the quality of van Vogt's work is sharply divided. An early and articulate critic was Damon Knight. In a 1945Van Vogt, A E (1970).  Introduction to The World Of Null-A (London: Sphere Science Fiction, 1976), p. viii chapter-long essay reprinted in In Search of Wonder, entitled \"Cosmic Jerrybuilder: A. E. van Vogt\", Knight described van Vogt as \"no giant; he is a pygmy who has learned to operate an overgrown typewriter\". Knight described The World of Null-A as \"one of the worst allegedly adult science fiction stories ever published\". Concerning van Vogt's writing, Knight said:\n\nAbout Empire of the Atom Knight wrote:\n\nKnight also expressed misgivings about van Vogt's politics. He noted that van Vogt's stories almost invariably present absolute monarchy in a favorable light. In 1974, Knight retraced some of his criticism after finding out about Vogt's working methods about writing down his dreams:\n\nKnight's criticism greatly damaged van Vogt's reputation. On the other hand, when science fiction author Philip K. Dick was asked [http://www.philipkdick.com/media_vertex.html \"Vertex Interviews Philip K. Dick\"] . Vertex, Vol. 1, no. 6, February 1974. which science fiction writers had influenced his work the most, he replied:\n\nDick also defended van Vogt against Damon Knight’s criticisms:\n\nIn a review of Transfinite: The Essential A.E. van Vogt, science fiction writer Paul Di Filippo said:\n\nIn The John W. Campbell Letters, Campbell says, \"The son-of-a-gun gets hold of you in the first paragraph, ties a knot around you, and keeps it tied in every paragraph thereafter—including the ultimate last one\".\n\nHarlan Ellison (who had begun reading van Vogt as a teenager)Ellison, Harlan (June 1999), [http://www.sfrevu.com/ISSUES/2000/ARTICLES/20000128-03.htm \"Van is Here, But Van is Gone\"]. Introduction to Futures Past: The Best Short Fiction of A.E. van Vogt (Kilimanjaro Corp., 1999). Reprinted in \"A. E. van Vogt, 1912-2000\" (SFRevu 2001-01-28). Retrieved 2001-08-31. Quote: \"Van is still with us, as I write this, in June of 1999, slightly less than fifty years since I first encountered van Vogt prose in a January 1950 issue of Startling Stories ...\" wrote, \"Van was the first writer to shine light on the restricted ways in which I had been taught to view the universe and the human condition\".\n\nWriting in 1984, David Hartwell said:\n\nThe literary critic Leslie A. Fiedler said something similar:\n\nAmerican literary critic Fredric Jameson says of van Vogt:\n\nVan Vogt still has his critics. For example, Darrell Schweitzer writing to The New York Review of Science Fiction in 1999Schweitzer, Darrell (1999), \"Letters of Comment\", The New York Review of Science Fiction, May 1999, Number 129, Vol. 11, No. 9. quoted a passage from the original van Vogt novelette \"The Mixed Men\", which he was then reading, and remarked:\n\nRecognition\n\nIn 1946, van Vogt and his first wife, Edna Mayne Hull, were Guests of Honor at the fourth World Science Fiction Convention.\n\nIn 1980, van Vogt received a \"Casper Award\" (precursor to the Canadian Prix Aurora Awards) for Lifetime Achievement.\n\nThe Science Fiction Writers of America named him its 14th Grand Master in 1995 (presented 1996). Great controversy within SFWA accompanied its long wait in bestowing its highest honor (limited to living writers, no more than one annually). Writing an obituary of van Vogt, Robert J. Sawyer, a fellow Canadian writer of science fiction remarked:\n\nIt is generally held that the \"damnable SFWA politics\" concerns Damon Knight, the founder of the SFWA, who abhorred van Vogt's style and politics and thoroughly demolished his literary reputation in the 1950s.Hartwell, David: \"The Way We Were: A. E. van Vogt, 1912-2000\", The New York Review of Science Fiction, March 2000, Number 139, Vol. 12, No. 7, page 24.\n\nHarlan Ellison was more explicit in 1999 introduction to Futures Past: The Best Short Fiction of A. E. van Vogt:\n\nIn 1996, van Vogt received a Special Award from the World Science Fiction Convention \"for six decades of golden age science fiction\". That same year, the Science Fiction and Fantasy Hall of Fame inducted him in its inaugural class of two deceased and two living persons, along with writer Jack Williamson (also living) and editors Hugo Gernsback and John W. Campbell.\n\nThe works of van Vogt were translated into French by the surrealist Boris Vian (The World of Null-A as Le Monde des Å in 1958), and van Vogt's works were \"viewed as great literature of the surrealist school\".Watson, Ian (1999), \"Science Fiction, Surrealism, and Shamanism\", The New York Review of Science Fiction, June 1999, Number 130, Vol. 11, No. 10, page 9. In addition, Slan was published in French, translated by Jean Rosenthal, under the title À la poursuite des Slans, as part of the paperback series 'Editions J'ai Lu: Romans-Texte Integral' in 1973, this edition also listing the following works by van Vogt as having been published in French as part of this series: Le Monde des Å, La faune de l'espace, Les joueurs du Å, L'empire de l'atome, Le sorcier de Linn, Les armureries d'Isher, Les fabricants d'armes, and Le livre de Ptath.À la poursuite des Slans, A. E. Van Vogt, Editions J'ai Lu, 31, rue de Tournon, Paris-VIe, 1973\n\nWorks\n\nNovels\n\n* Slan (1946) (originally serialized)\n* The Weapon Makers (1947) (serialized 1943, revised 1952) (also published as One Against Eternity (1964))\n* The Book of Ptath (1947) (in Unknown Worlds, 1947) (also published asTwo Hundred Million A.D. [1964] and Ptath [1976])\n* The World of Null-A (1948) (revised from 1945 serial, revised again 1970)\n* The House That Stood Still (1950), also published as The Mating Cry and The Undercover Aliens. The sexual interludes added by Van Vogt to The Mating Cry for its Galaxy Beacon edition have been retained in many later editions.)\n* The Voyage of the Space Beagle (1950) (\"fix-up\" from short fiction)\n* The Weapon Shops of Isher (1951) (\"fix-up\" from short story)\n* The Mixed Men (1952), also published as Mission to the Stars [fix up]\n* The Universe Maker (1953) (expanded 1950 story, 'The Shadow Men')\n* Planets for Sale (1954), with Edna Mayne Hull [from short fiction]\n* The Pawns of Null-A (1956), also published as The Players of Null-A\n* The Mind Cage (1957) [expanded from short work \"The Great Judge\", 1948]\n* Empire of the Atom (1957) [fix-up]\n* Siege of the Unseen (1959) [as 'The Chronicler' (1946)] [also published as The Three Eyes of Evil]\n* The War Against the Rull (1959) [fix0up]\n* Earth's Last Fortress (1960), first stand-alone publication, previously entitled Recruiting Station and Masters of Time\n* The Wizard of Linn (1962) (serializ, 1950)\n* The Violent Man (1962, political thriller rather than science fiction)\n* The Beast (1963, fix-up, also published as Moonbeast')\n* Rogue Ship (1965) [fix-up]\n* The Winged Man (1966), with Edna Mayne Hull\n* The Changeling (1967) stand-alone publication of stories first published in 1942 and 1944 in Astounding Stories\n* The Silkie (1969, from short stories]\n* Children of Tomorrow (1970)\n* Quest for the Future (1970, fix-up)\n* The Battle of Forever (1971)\n* The Darkness on Diamondia (1972) (expanded from a short story)\n* Future Glitter (1973, also published as Tyranopolis)\n* The Man with a Thousand Names (1974)\n* The Secret Galactics (1974, also published as Earth Factor X)\n* Supermind (1977, from short stories; including a collaboration with James H. Schmitz and Edna Mayne Hull]\n* The Anarchistic Colossus (1977)\n* The Enchanted Village (1979, chapbook)\n* Renaissance (1979)\n* Cosmic Encounter (1979)\n* Computerworld (1983, also published as Computer Eye)\n* Null-A Three (1984)\n* To Conquer Kiber (1985, unpublisheddin English; published in French as A la conquête de Kiber and in Romanian as Cucerirea Kiberului\n* Slan Hunter by Kevin W. Anderson (2007, utilizing an unfinished draft by van Vogt)\nNotes\n\nPrimary dates list first publication in book form.\n\nCollections\n\n* Out of the Unknown (1948), with Edna Mayne Hull\n* Masters of Time (1950) (a.k.a. Recruiting Station) [also includes The Changeling, both works were later published separately]\n* Triad (1951) omnibus of The World of Null A, The Voyage of the Space Beagle, Slan.\n* Away and Beyond (1952) (abridged in paperback in 1959; abridged (differently) in paperback in 1963)\n* Destination: Universe! (1952)\n* The Twisted Men (1964)\n* Monsters (1965) (later as SF Monsters (1967)) abridged as The Blal (1976)\n* A Van Vogt Omnibus (1967), omnibus of Planets for Sale (with Edna Mayne Hull), The Beast, The Book of Ptath\n* The Far Out Worlds of Van Vogt (1968)\n* The Sea Thing and Other Stories (1970) (expanded from Out of the Unknown by adding an original story by Hull; later abridged in paperback as Out of the Unknown by removing 2 of the stories)\n* M33 in Andromeda (1971)\n* More Than Superhuman (1971)\n* The Proxy Intelligence and Other Mind Benders, ), with Edna Mayne Hull (1971), revised as The Gryb (1976)\n* Van Vogt Omnibus 2 (1971), omnibus of The Mind Cage, The Winged Man (with Edna Mayne Hull), Slan.\n* The Book of Van Vogt (1972), also published as Lost: Fifty Suns (1979)\n* The Three Eyes of Evil Including Earth's Last Fortress (1973)\n* The Best of A. E. van Vogt (1974) later split into 2 volumes\n* The Worlds of A. E. van Vogt (1974) (expanded from The Far Out Worlds of Van Vogt by adding 3 stories)\n* The Best of A. E. van Vogt (1976) [differs to 1974 edition]\n* Away and Beyond (1977)\n* Pendulum (1978) (almost all original stories and articles)\n* Futures Past: The Best Short Fiction of A.E. Van Vogt (1999)\n* Transfinite: The Essential A.E. van Vogt (2002)\n* Transgalactic (2006)\n\nNonfiction\n\n* The Hypnotism Handbook (1956, Griffin Publishing Company, with Charles Edward Cooke)\n* The Money Personality (1972, Parker Publishing Company Inc., West Nyack, NY, )\n* Reflections of A. E. Van Vogt: The Autobiography of a Science Fiction Giant (1979, Fictioneer Books Ltd., Lakemont, GA)\n* A Report on the Violent Male (1992, Paupers' Press, UK, )",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "A. E. van Vogt" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=888" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Alfred Elton van Vogt  (; April 26, 1912 – January 26, 2000) was a Canadian-born science fiction author.  He is regarded as one of the most popular, influential and complex practitioners of the mid-twentieth century, the genre's so-called Golden Age.\"Although [van Vogt] catered for the pulps, he intensified the emotional impact and complexity of the stories they would bear[.]\" \n\nEarly life and writings\n\nVan Vogt was born on a farm in Edenburg (a Russian Mennonite community east of Gretna, Manitoba, Canada). Until age four, van Vogt and his family spoke only a dialect of Low German at home.Panshin, Alexei [http://www.panshin.com/articles/vanvogt/vanvogt1.html \"Man Beyond Man. The Early Stories of A. E. van Vogt\" (page 1)]. Retrieved August 29, 2010. Van Vogt's father, a lawyer, moved his family several times. His son found these moves difficult, remarking in later life:\n\nVan Vogt began his writing career with stories true confession style pulp magazines such as True Story. He decided to switch to writing science fiction, which he enjoye.Elliot, Jeffery: \"An Interview with A. E. Van Vogt\", Science Fiction Review #23, 1977. Available online http://www.angelfire.com/art/megathink/vanvogt/vanvogt_interview.html Retrieved on August 29, 2010 He was inspired by the August 1938 issue of Astounding Science Fiction, which he picked up at a newsstand. John W. Campbell's novelette \"Who Goes There?\" (later adapted into The Thing from Another World and The Thing) inspired van Vogt to write \"Vault of the Beast\", which he submitted to that same magazine. Campbell, who edited Astounding (and had written the story under a pseudonym), sent van Vogt a ]rejection letter, but one which encouraged van Vogt to try again. Van Vogt sent another story, entitled \"Black Destroyer,\" which was accepted. A revised version of \"Vault of the Beast\" would be published in 1940.\n\nVan Vogt's first SF publication was inspired by The Voyage of the Beagle by Charles Darwin.Drake, H. L., A. E. van Vogt: Science Fantasy's Icon, Booklocker.com Inc., 2001, page 36. \"The Black Destroyer\" was published in July 1939 by John W. Campbell in Astounding Science Fiction, the centennial year of Darwin's journal. It featured a fierce, carnivorous alien, the coeurl, stalking the crew of an exploration spaceship. \"Discord in Scarlet\" was his second story to be published, also appearing as the cover story.[http://www.icshi.net/worlds/voyageof.htm \"The Voyage of the Space Beagle\"] (cover images for numerous editions and adaptations of \"The Black Destroyer\" and its series). The Weird Worlds of A. E. van Vogt. Magnus Axelsson (pre-2000 to 2009). Now hosted by icshi.net. Retrieved April 4, 2013. It was accompanied by interior illustrations created by Frank Kramer and Paul Orban. Panshin, Alexei (1994). [http://www.icshi.net/worlds/intoslan.htm \"Introduction to Slan\"]. Connecticut: The Easton Press. Quote: \"His first published SF story was \"Black Destroyer\" in the July 1939 Astounding. Not only was \"Black Destroyer\" pictured on the cover of the magazine, but it would be recognized as one of the most significant stories published in Astounding that year\". (Van Vogt and Kramer thus debuted in the issue of Astounding that is sometimes identified as the start of the Golden Age of Science Fiction.For example, Peter Nicholls () says \"The beginning of Campbell's particular Golden Age of SF can be pinpointed as the summer of 1939\" and goes on to begin the discussion with the July 1939 issue. Lester del Rey () comments that \"July was the turning point\".) The former story served as the inspiration for multiple science fiction movies. In 1950, the two were combined with two other stories as a fix-up novel, The Voyage of the Space Beagle (Simon & Schuster), which was published in at least five European languages by 1955. Positing the need for exobiologists who will appreciate the differences between the inhabitants of other planets and ourselves, it stresses the importance of the civilian rather than military in exploration of other cultures.\n\nVan Vogt's first completed novel, and one of his most famous, is Slan (Arkham House, 1946), which Campbell serialized in Astounding September to December 1940. Using what became one of van Vogt's recurring themes, it told the story of a 9-year-old superman living in a world in which his kind are slain by Homo sapiens.\n\nOthers saw van Vogt's talent and stardom from his first story, and in 1941, van Vogt decided to become a full-time writer, quitting his job at the Canadian Department of National Defence. Prolific for a few years, van Vogt wrote many short stories. In the 1950s, many of them were retrospectively patched together into novels, or \"fixups\" as he called them, a term that entered the vocabulary of science-fiction criticism. When the original stories were related (e.g., The War against the Rull) this was often successful. When not (e.g., Quest for the Future) the disparate stories thrown together generally made for a less coherent plot.\n\nPost-war life and work\n\nIn 1944, van Vogt moved to Hollywood, where his writing took on new dimensions after World War II. He was always interested in the idea of all-encompassing systems of knowledge (akin to modern meta-systems)—the characters in his very first story used a system called \"Nexialism\" to analyze the alien's behavior, and he became interested in the general semantics of Alfred Korzybski.\n\nHe subsequently wrote three novels merging these overarching themes, The World of Null-A and The Pawns of Null-A in the late 1940s, and Null-A Three in the early 1980s. Null-A, or non-Aristotelian logic, refers to the capacity for, and practice of, using intuitive, inductive reasoning (compare fuzzy logic), rather than reflexive, or conditioned, deductive reasoning.\n\nVan Vogt was profoundly affected by revelations of totalitarian police states that emerged after World War II. He wrote a mainstream novel that he set in Communist China, The Violent Man (1962); he said that to research this book he had read 100 books about China. Into this book he incorporated his view of \"the violent male type\", which he described as a \"man who had to be right\", a man who \"instantly attracts women\" and who he said were the men who \"run the world\".\n\nAt the same time, in his fiction, van Vogt was consistently sympathetic to absolute monarchy as a form of government. This was the case, for instance, in the Weapon Shop series, the Mixed Men series, and in single stories such as \"Heir Apparent\" (1945), whose protagonist was described as a \"benevolent dictator\".\n\nVan Vogt systematized his writing method, using scenes of 800 words or so where a new complication was added or something resolved. Several of his stories hinge on temporal conundra, a favorite theme. He stated that he acquired many of his writing techniques from three books: Narrative Technique by Thomas Uzzell, The Only Two Ways to Write a Story by John Gallishaw, and Twenty Problems of the Fiction Writer by Gallishaw.\n\nHe also claimed many of his ideas came from dreams; throughout his writing life he arranged to be awakened every 90 minutes during his sleep period so he could write down his dreams.Platt, Charles, [http://www.icshi.net/worlds/Plattprofile.htm \"A. E. van Vogt – A Profile\"]. From Who Writes Science Fiction? (London: Savoy Books, 1980); Dream Makers: The Uncommon People Who Write Science Fiction (Berkeley Books, 1980).\n\nVan Vogt published perhaps his most famous story, \"Enchanted Village\", in the July 1950 issue of Other Worlds Science Stories. It was reprinted in over 20 collections or anthologies, and appeared many times in translation.http://www.isfdb.org/cgi-bin/title.cgi?56655 Retrieved 10 March 2017\n\nIn 1950, van Vogt was briefly appointed as head of L. Ron Hubbard's Dianetics operation in California. Dianetics was the secular precursor to Hubbard's Church of Scientology. The operation went broke nine months later, but never went bankrupt, due to van Vogt's arrangements with creditors. Van Vogt and his wife opened their own Dianetics centre, partly financed by his writings, until he \"signed off\" around 1961. At the time of his interview with Charles Platt, van Vogt was still president of the Californian Association of Dianetic Auditors.\n\nIn 1951, he published The Weapon Shops of Isher. In the same decade, van Vogt also produced collections and  fixups such as The Mixed Men (1952), The War Against the Rull (1959), and the two \"Clane\" novels, Empire of the Atom (1957) and The Wizard of Linn (1962), which were inspired (like Asimov's Foundation series) by Roman imperial history, specifically the reign of Claudius.  His later novels included fixups such as The Beast (also known as Moonbeast) (1963), Rogue Ship (1965), Quest for the Future (1970) and Supermind (1977); expanded short stories such as The Darkness on Diamondia (1972) and Future Glitter (also known as Tyranopolis; 1973); original novels such as Children of Tomorrow (1970), The Battle of Forever (1971) and The Anarchistic Colossus (1977); plus sequels to his classic works, many of which were promised, but only one of which appeared, Null-A Three (1984; originally published in French). Several later books were original in Europe, and at least one novel only ever appeared in Italian.\n\nOn January 26, 2000, van Vogt died in Los Angeles, United States from Alzheimer's disease, survived by his second wife, the former Lydia Bereginsky.\n\nCritical reception\n\nCritical opinion about the quality of van Vogt's work is sharply divided. An early and articulate critic was Damon Knight. In a 1945Van Vogt, A E (1970).  Introduction to The World Of Null-A (London: Sphere Science Fiction, 1976), p. viii chapter-long essay reprinted in In Search of Wonder, entitled \"Cosmic Jerrybuilder: A. E. van Vogt\", Knight described van Vogt as \"no giant; he is a pygmy who has learned to operate an overgrown typewriter\". Knight described The World of Null-A as \"one of the worst allegedly adult science fiction stories ever published\". Concerning van Vogt's writing, Knight said:\n\nAbout Empire of the Atom Knight wrote:\n\nKnight also expressed misgivings about van Vogt's politics. He noted that van Vogt's stories almost invariably present absolute monarchy in a favorable light. In 1974, Knight retraced some of his criticism after finding out about Vogt's working methods about writing down his dreams:\n\nKnight's criticism greatly damaged van Vogt's reputation. On the other hand, when science fiction author Philip K. Dick was asked [http://www.philipkdick.com/media_vertex.html \"Vertex Interviews Philip K. Dick\"] . Vertex, Vol. 1, no. 6, February 1974. which science fiction writers had influenced his work the most, he replied:\n\nDick also defended van Vogt against Damon Knight’s criticisms:\n\nIn a review of Transfinite: The Essential A.E. van Vogt, science fiction writer Paul Di Filippo said:\n\nIn The John W. Campbell Letters, Campbell says, \"The son-of-a-gun gets hold of you in the first paragraph, ties a knot around you, and keeps it tied in every paragraph thereafter—including the ultimate last one\".\n\nHarlan Ellison (who had begun reading van Vogt as a teenager)Ellison, Harlan (June 1999), [http://www.sfrevu.com/ISSUES/2000/ARTICLES/20000128-03.htm \"Van is Here, But Van is Gone\"]. Introduction to Futures Past: The Best Short Fiction of A.E. van Vogt (Kilimanjaro Corp., 1999). Reprinted in \"A. E. van Vogt, 1912-2000\" (SFRevu 2001-01-28). Retrieved 2001-08-31. Quote: \"Van is still with us, as I write this, in June of 1999, slightly less than fifty years since I first encountered van Vogt prose in a January 1950 issue of Startling Stories ...\" wrote, \"Van was the first writer to shine light on the restricted ways in which I had been taught to view the universe and the human condition\".\n\nWriting in 1984, David Hartwell said:\n\nThe literary critic Leslie A. Fiedler said something similar:\n\nAmerican literary critic Fredric Jameson says of van Vogt:\n\nVan Vogt still has his critics. For example, Darrell Schweitzer writing to The New York Review of Science Fiction in 1999Schweitzer, Darrell (1999), \"Letters of Comment\", The New York Review of Science Fiction, May 1999, Number 129, Vol. 11, No. 9. quoted a passage from the original van Vogt novelette \"The Mixed Men\", which he was then reading, and remarked:\n\nRecognition\n\nIn 1946, van Vogt and his first wife, Edna Mayne Hull, were Guests of Honor at the fourth World Science Fiction Convention.\n\nIn 1980, van Vogt received a \"Casper Award\" (precursor to the Canadian Prix Aurora Awards) for Lifetime Achievement.\n\nThe Science Fiction Writers of America named him its 14th Grand Master in 1995 (presented 1996). Great controversy within SFWA accompanied its long wait in bestowing its highest honor (limited to living writers, no more than one annually). Writing an obituary of van Vogt, Robert J. Sawyer, a fellow Canadian writer of science fiction remarked:\n\nIt is generally held that the \"damnable SFWA politics\" concerns Damon Knight, the founder of the SFWA, who abhorred van Vogt's style and politics and thoroughly demolished his literary reputation in the 1950s.Hartwell, David: \"The Way We Were: A. E. van Vogt, 1912-2000\", The New York Review of Science Fiction, March 2000, Number 139, Vol. 12, No. 7, page 24.\n\nHarlan Ellison was more explicit in 1999 introduction to Futures Past: The Best Short Fiction of A. E. van Vogt:\n\nIn 1996, van Vogt received a Special Award from the World Science Fiction Convention \"for six decades of golden age science fiction\". That same year, the Science Fiction and Fantasy Hall of Fame inducted him in its inaugural class of two deceased and two living persons, along with writer Jack Williamson (also living) and editors Hugo Gernsback and John W. Campbell.\n\nThe works of van Vogt were translated into French by the surrealist Boris Vian (The World of Null-A as Le Monde des Å in 1958), and van Vogt's works were \"viewed as great literature of the surrealist school\".Watson, Ian (1999), \"Science Fiction, Surrealism, and Shamanism\", The New York Review of Science Fiction, June 1999, Number 130, Vol. 11, No. 10, page 9. In addition, Slan was published in French, translated by Jean Rosenthal, under the title À la poursuite des Slans, as part of the paperback series 'Editions J'ai Lu: Romans-Texte Integral' in 1973, this edition also listing the following works by van Vogt as having been published in French as part of this series: Le Monde des Å, La faune de l'espace, Les joueurs du Å, L'empire de l'atome, Le sorcier de Linn, Les armureries d'Isher, Les fabricants d'armes, and Le livre de Ptath.À la poursuite des Slans, A. E. Van Vogt, Editions J'ai Lu, 31, rue de Tournon, Paris-VIe, 1973\n\nWorks\n\nNovels\n\n* Slan (1946) (originally serialized)\n* The Weapon Makers (1947) (serialized 1943, revised 1952) (also published as One Against Eternity (1964))\n* The Book of Ptath (1947) (in Unknown Worlds, 1947) (also published asTwo Hundred Million A.D. [1964] and Ptath [1976])\n* The World of Null-A (1948) (revised from 1945 serial, revised again 1970)\n* The House That Stood Still (1950), also published as The Mating Cry and The Undercover Aliens. The sexual interludes added by Van Vogt to The Mating Cry for its Galaxy Beacon edition have been retained in many later editions.)\n* The Voyage of the Space Beagle (1950) (\"fix-up\" from short fiction)\n* The Weapon Shops of Isher (1951) (\"fix-up\" from short story)\n* The Mixed Men (1952), also published as Mission to the Stars [fix up]\n* The Universe Maker (1953) (expanded 1950 story, 'The Shadow Men')\n* Planets for Sale (1954), with Edna Mayne Hull [from short fiction]\n* The Pawns of Null-A (1956), also published as The Players of Null-A\n* The Mind Cage (1957) [expanded from short work \"The Great Judge\", 1948]\n* Empire of the Atom (1957) [fix-up]\n* Siege of the Unseen (1959) [as 'The Chronicler' (1946)] [also published as The Three Eyes of Evil]\n* The War Against the Rull (1959) [fix0up]\n* Earth's Last Fortress (1960), first stand-alone publication, previously entitled Recruiting Station and Masters of Time\n* The Wizard of Linn (1962) (serializ, 1950)\n* The Violent Man (1962, political thriller rather than science fiction)\n* The Beast (1963, fix-up, also published as Moonbeast')\n* Rogue Ship (1965) [fix-up]\n* The Winged Man (1966), with Edna Mayne Hull\n* The Changeling (1967) stand-alone publication of stories first published in 1942 and 1944 in Astounding Stories\n* The Silkie (1969, from short stories]\n* Children of Tomorrow (1970)\n* Quest for the Future (1970, fix-up)\n* The Battle of Forever (1971)\n* The Darkness on Diamondia (1972) (expanded from a short story)\n* Future Glitter (1973, also published as Tyranopolis)\n* The Man with a Thousand Names (1974)\n* The Secret Galactics (1974, also published as Earth Factor X)\n* Supermind (1977, from short stories; including a collaboration with James H. Schmitz and Edna Mayne Hull]\n* The Anarchistic Colossus (1977)\n* The Enchanted Village (1979, chapbook)\n* Renaissance (1979)\n* Cosmic Encounter (1979)\n* Computerworld (1983, also published as Computer Eye)\n* Null-A Three (1984)\n* To Conquer Kiber (1985, unpublisheddin English; published in French as A la conquête de Kiber and in Romanian as Cucerirea Kiberului\n* Slan Hunter by Kevin W. Anderson (2007, utilizing an unfinished draft by van Vogt)\nNotes\n\nPrimary dates list first publication in book form.\n\nCollections\n\n* Out of the Unknown (1948), with Edna Mayne Hull\n* Masters of Time (1950) (a.k.a. Recruiting Station) [also includes The Changeling, both works were later published separately]\n* Triad (1951) omnibus of The World of Null A, The Voyage of the Space Beagle, Slan.\n* Away and Beyond (1952) (abridged in paperback in 1959; abridged (differently) in paperback in 1963)\n* Destination: Universe! (1952)\n* The Twisted Men (1964)\n* Monsters (1965) (later as SF Monsters (1967)) abridged as The Blal (1976)\n* A Van Vogt Omnibus (1967), omnibus of Planets for Sale (with Edna Mayne Hull), The Beast, The Book of Ptath\n* The Far Out Worlds of Van Vogt (1968)\n* The Sea Thing and Other Stories (1970) (expanded from Out of the Unknown by adding an original story by Hull; later abridged in paperback as Out of the Unknown by removing 2 of the stories)\n* M33 in Andromeda (1971)\n* More Than Superhuman (1971)\n* The Proxy Intelligence and Other Mind Benders, ), with Edna Mayne Hull (1971), revised as The Gryb (1976)\n* Van Vogt Omnibus 2 (1971), omnibus of The Mind Cage, The Winged Man (with Edna Mayne Hull), Slan.\n* The Book of Van Vogt (1972), also published as Lost: Fifty Suns (1979)\n* The Three Eyes of Evil Including Earth's Last Fortress (1973)\n* The Best of A. E. van Vogt (1974) later split into 2 volumes\n* The Worlds of A. E. van Vogt (1974) (expanded from The Far Out Worlds of Van Vogt by adding 3 stories)\n* The Best of A. E. van Vogt (1976) [differs to 1974 edition]\n* Away and Beyond (1977)\n* Pendulum (1978) (almost all original stories and articles)\n* Futures Past: The Best Short Fiction of A.E. Van Vogt (1999)\n* Transfinite: The Essential A.E. van Vogt (2002)\n* Transgalactic (2006)\n\nNonfiction\n\n* The Hypnotism Handbook (1956, Griffin Publishing Company, with Charles Edward Cooke)\n* The Money Personality (1972, Parker Publishing Company Inc., West Nyack, NY, )\n* Reflections of A. E. Van Vogt: The Autobiography of a Science Fiction Giant (1979, Fictioneer Books Ltd., Lakemont, GA)\n* A Report on the Violent Male (1992, Paupers' Press, UK, ). A. E. van Vogt. http://en.wikipedia.org/?curid=888."
  }
}
