{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15596",
  "eid" : "1d409c30-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778558323,
  "textBody" : "John Ray (29 November 1627 – 17 January 1705) was an English naturalist widely regarded as one of the earliest of the English parson-naturalists.Armstrong, 2000. p. 2 Until 1670, he wrote his name as John Wray. From then on, he used 'Ray', after \"having ascertained that such had been the practice of his family before him\".Gunther, Robert W.T. 1928. Further Correspondence of John Ray. Ray Society, London. p. 16\n\nHe published important works on botany, zoology, and natural theology. His classification of plants in his Historia Plantarum, was an important step towards modern taxonomy. Ray rejected the system of dichotomous division by which species were classified according to a pre-conceived, either/or type system , and instead classified plants according to similarities and differences that emerged from observation. He was the first to give a biological definition of the term species.Historia plantarum generalis, in the volume published in 1686, Tome I, Libr. I, Chap. XX, page 40 (Quoted in Mayr, Ernst. 1982. The growth of biological thought: diversity, evolution, and inheritance. Cambridge, Mass.: Belknap Press: 256)\n\nLife \n\nEarly life \n\nJohn Ray was born in the village of Black Notley in Essex. He is said to have been born in the smithy, his father having been the village blacksmith. He was sent at the age of sixteen to Cambridge University: studying at Trinity College. His tutor at Trinity was James Duport, and his intimate friend and fellow-pupil the celebrated Isaac Barrow. Ray was chosen minor fellow of Trinity in 1649, and later major fellow. He held many college offices, becoming successively lecturer in Greek (1651), mathematics (1653), and humanity (1655), praelector (1657), junior dean (1657), and college steward (1659 and 1660); and according to the habit of the time, he was accustomed to preach in his college chapel and also at Great St Mary's, long before he took holy orders on 23 December 1660. Among these sermons were his discourses on The wisdom of God manifested in the works of the creation,[https://books.google.com/books?iddxkHAAAAQAAJ&printsec\nfrontcover The wisdom of God manifested in the works of the Creation], Google Books and Deluge and Dissolution of the World. Ray was also highly regarded as a tutor and he communicated his own passion for natural history to several pupils. It has been generally asserted that Willughby was Ray's pupil at Cambridge, but what little evidence exists on the matter is rather against this supposition. \n\nLater life and family \n\nAfter leaving Cambridge in 1662 he spent some time travelling both in Britain and the continent. In 1673, Ray married Margaret Oakley of Launton; in 1676 he went to Middleton Hall near Tamworth, and in 1677 to Falborne (or Faulkbourne) Hall in Essex. Finally, in 1679, he removed to his birthplace at Black Notley, where he afterwards remained. His life there was quiet and uneventful, although he had poor health, including chronic sores. Ray kept writing books and corresponded widely on scientific matters. He lived, in spite of his infirmities, to the age of seventy-seven, dying at Black Notley. He is buried in the churchyard of St Peter and St Paul where there is a memorial to him.\n\nWork \n\nAt Cambridge, Ray spent much of his time in the study of natural history, a subject which would occupy him for most of his life. When Ray found himself unable to subscribe as required by the ‘Bartholomew Act’ of 1662 he, along with 13 other college fellows, resigned his fellowship on 24 August 1662 rather than swear to the declaration that the Solemn League and Covenant was not binding on those who had taken it.  Tobias Smollett quoted the reasoning given in the biography of Ray by William Derham:\n\"The reason of his refusal was not (says his biographer) as some have imagined, his having taken the solemn league and covenant; for that he never did, and often declared that he ever thought it an unlawful oath: but he said he could not say, for those that had taken the oath, that no obligation lay upon them, but feared there might.\"Tobias George Smollett (1761) The Critical review, or, Annals of literature, Volume 11 [https://books.google.com/books?idZoRHAAAAYAAJ&pg\nPA93&lpg=PA93 pp. 92–93]\nHis religious views were generally in accord with those imposed under the restoration of Charles II of England, and (though technically a nonconformist) he continued as a layman in the Established Church of England.\n\nFrom this time onwards he seems to have depended chiefly on the bounty of his pupil Francis Willughby, who made Ray his constant companion while he lived. Willughby arranged that after his death, Ray would have 6 shillings a year for educating Willughby's two sons.\n\nIn the spring of 1663 Ray started together with Willughby and two other pupils (Philip Skippon and Nathaniel Bacon) on a tour through Europe, from which he returned in March 1666, parting from Willughby at Montpellier, whence the latter continued his journey into Spain. He had previously in three different journeys (1658, 1661, 1662) travelled through the greater part of Great Britain, and selections from his private notes of these journeys were edited by George Scott in 1760, under the title of Mr Ray's Itineraries. Ray himself published an account of his foreign travel in 1673, entitled Observations topographical, moral, and physiological, made on a Journey through part of the Low Countries, Germany, Italy, and France. From this tour Ray and Willughby returned laden with collections, on which they meant to base complete systematic descriptions of the animal and vegetable kingdoms. Willughby undertook the former part, but, dying in 1672, left only an ornithology and ichthyology for Ray to edit; while Ray used the botanical collections for the groundwork of his Methodus plantarum nova (1682), and his great Historia generalis plantarum (3 vols., 1686, 1688, 1704). The plants gathered on his British tours had already been described in his Catalogus plantarum Angliae (1670), which formed the basis for later English floras.\n\nIn 1667 Ray was elected Fellow of the Royal Society, and in 1669 he and Willughby published a paper on Experiments concerning the Motion of Sap in Trees. In 1671, he presented the research of Francis Jessop on formic acid to the Royal Society.\n\nIn the 1690s, he published three volumes on religion—the most popular being The Wisdom of God Manifested in the Works of the Creation (1691), an essay describing evidence that all in nature and space is God's creation as in Bible is affirmed. In this volume, he moved on from the naming and cataloguing of species like his successor Carl Linnaeus. Instead, Ray considered species' lives and how nature worked as a whole, giving facts that are arguments for God's will expressed in His creation of all 'visible and invisible' (Colossians 1:16).\nRay gave an early description of dendrochronology, explaining for the ash tree how to find its age from its tree-rings.Armstrong, 2000. p. 47\n\nRay's definition of species \n\nRay was the first person to produce a biological definition of species, in his 1686 History of plants:\n\n\"... no surer criterion for determining species has occurred to me than the distinguishing features that perpetuate themselves in propagation from seed. Thus, no matter what variations occur in the individuals or the species, if they spring from the seed of one and the same plant, they are accidental variations and not such as to distinguish a species... Animals likewise that differ specifically preserve their distinct species permanently; one species never springs from the seed of another nor vice versa\".Mayr Growth of biological thought p256; original was Ray, History of Plants. 1686, trans E. Silk.\n\nSystem of classification \n\nAs outlined in his Historia Plantarum (1685–1703):\n* Herbae (Herbaceous plants)\n** Imperfectae (Cryptogams)\n** Perfectae (Seed plants)\n*** Monocotyledons\n*** Dicotyledons\n* Arborae (Trees)\n*** Monocotyledons\n*** Dicotyledons\n\nPublications \n\nRay published about 23 works, depending on how they are counted. The biological works were usually in Latin, the rest in English.Keynes, Sir Geoffrey [1951] 1976. John Ray, 1627–1705: a bibliography 1660–1970. Van Heusden, Amsterdam. His first publication, while at Cambridge, was the Catalogus plantarum circa Cantabrigiam nascentium (1660), followed by many works, botanical, zoological, theological and literary.\n\nList of selected publications \n\n*1660: Catalogus plantarum circa Cantabrigiam nascentium (Catalogue of Cambridge plants)\n*1668: Tables of plants.\n* \n*1670: Collection of English proverbs.\n*1673: Observations in the Low Countries and Catalogue of plants not native to England.\n*1674: Collection of English words not generally used.\n*, in \n*1675: Trilingual dictionary, or nomenclator classicus.\n*1676: [https://www.biodiversitylibrary.org/item/129443#page/7/mode/1up  Willughby's Ornithologia].\n* \n** [https://web.archive.org/web/20080820060520/http://montgomery.cas.muohio.edu/nimissa/research/methodus%20folder/methoduspreliminary.html English translation by Stephen Nimis]\n*1686: History of fishes.\n*1686–1704: Historia plantarum species [History of plants]. London:Clark 3 vols;\n** [https://books.google.com/books?idfCCbsb0ySy0C Vol 1 1686], [https://books.google.com/books?id\n01xl8Eu-LnwC Vol 2 1688], [https://books.google.com/books?id=ojSSrVW3OrcC Vol 3 1704] (in Latin)\n* \n** 2nd ed 1696\n*1691: [http://www.jri.org.uk/ray/wisdom/ The wisdom of God Manifested in the Works of the Creation 7th ed.] 2nd ed 1692, 3rd ed 1701, 4th ed 1704, 7th ed 1717\n*1692: [http://lhldigital.lindahall.org/cdm/ref/collection/earththeory/id/15962 Miscellaneous discourses concerning the dissolution and changes of the world]\n*1693: [https://www.biodiversitylibrary.org/item/91492 Synopsis of animals and reptiles].\n*1693: Collection of travels.\n*1694: Collection of European plants.\n*1695: Plants of each county. (Camden's Britannia)\n* \n** [https://web.archive.org/web/20080827204643/http://montgomery.cas.muohio.edu/nimissa/research/dissertatio/diss.html English translation by Stephen Nimis]\n*1700: A persuasive to a holy life.\n* \n\n;Posthumous \n\n*1705. Method and history of insects\n*1713:  [http://gdz.sub.uni-goettingen.de/dms/load/toc/?PID=PPN383878012 Synopsis methodica avium & piscium: opus posthumum (Synopsis of birds and fishes), in Latin. William Innys, London] vol. 1: Avium vol. 2: Piscium \n*1713 [http://lhldigital.lindahall.org/cdm/ref/collection/earththeory/id/9107 Three Physico-theological discourses]\n* \n** [http://www.raysociety.org.uk/publications/general-and-historical/synopsis-methodica-stirpum-britannicarum-john-ray/ Facsimile edition 1973, Ray Society, London. With introduction by William T. Stearn. ]\n** Fourth edition 1760\n\nLibraries holding Ray's works \n\nIncluding the various editions, there are 172 works of Ray, of which most are rare. The only libraries with substantial holdings are all in England.p153 The list in order of holdings is:\n\nThe British Library, Euston, London. Holds over 80 of the editions.\nThe Bodleian Library, University of Oxford.\nThe University of Cambridge Library.\nLibrary of Trinity College Cambridge.\nThe Natural History Museum Library, South Kensington, London.\nThe John Rylands Library, University of Manchester, Deansgate, Manchester\n\nLegacy\n\nRay's biographer, Charles Raven, commented that \"Ray sweeps away the litter of mythology and fable... and always insists upon accuracy of observation and description and the testing of every new discovery\".p10 Ray's works were directly influential on the development of taxonomy by Carl Linnaeus.\n\nThe Ray Society, named after John Ray, was founded in 1844. It is a scientific text publication society and registered charity, based at the Natural History Museum, London, which exists to publish books on natural history, with particular (but not exclusive) reference to the flora and fauna of the British Isles. As of 2017, the Society had published 179 volumes. \n\nThe John Ray Society (a separate organisation) is the Natural Sciences Society at St Catharine's College, Cambridge. It organises a programme of events of interest to science students in the college. \n\nIn 1986, to mark the 300th anniversary of the publication of Ray's Historia Plantarum, there was a celebration of Ray's legacy in Braintree, Essex. A \"John Ray Gallery\" was opened in the Braintree Museum.\n\nThe John Ray Initiative (JRI) is an educational charity that seeks to reconcile scientific and Christian understandings of the environment. It was formed in 1997 in response to the global environmental crisis and the challenges of sustainable development and environmental stewardship. John Ray's writings proclaimed God as creator whose wisdom is \"manifest in the works of creation\", and as redeemer of all things. JRI aims to teach appreciation of nature, increase awareness of the state of the global environment, and to promote a Christian understanding of environmental issues.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "John Ray" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15596" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "John Ray (29 November 1627 – 17 January 1705) was an English naturalist widely regarded as one of the earliest of the English parson-naturalists.Armstrong, 2000. p. 2 Until 1670, he wrote his name as John Wray. From then on, he used 'Ray', after \"having ascertained that such had been the practice of his family before him\".Gunther, Robert W.T. 1928. Further Correspondence of John Ray. Ray Society, London. p. 16\n\nHe published important works on botany, zoology, and natural theology. His classification of plants in his Historia Plantarum, was an important step towards modern taxonomy. Ray rejected the system of dichotomous division by which species were classified according to a pre-conceived, either/or type system , and instead classified plants according to similarities and differences that emerged from observation. He was the first to give a biological definition of the term species.Historia plantarum generalis, in the volume published in 1686, Tome I, Libr. I, Chap. XX, page 40 (Quoted in Mayr, Ernst. 1982. The growth of biological thought: diversity, evolution, and inheritance. Cambridge, Mass.: Belknap Press: 256)\n\nLife \n\nEarly life \n\nJohn Ray was born in the village of Black Notley in Essex. He is said to have been born in the smithy, his father having been the village blacksmith. He was sent at the age of sixteen to Cambridge University: studying at Trinity College. His tutor at Trinity was James Duport, and his intimate friend and fellow-pupil the celebrated Isaac Barrow. Ray was chosen minor fellow of Trinity in 1649, and later major fellow. He held many college offices, becoming successively lecturer in Greek (1651), mathematics (1653), and humanity (1655), praelector (1657), junior dean (1657), and college steward (1659 and 1660); and according to the habit of the time, he was accustomed to preach in his college chapel and also at Great St Mary's, long before he took holy orders on 23 December 1660. Among these sermons were his discourses on The wisdom of God manifested in the works of the creation,[https://books.google.com/books?iddxkHAAAAQAAJ&printsec\nfrontcover The wisdom of God manifested in the works of the Creation], Google Books and Deluge and Dissolution of the World. Ray was also highly regarded as a tutor and he communicated his own passion for natural history to several pupils. It has been generally asserted that Willughby was Ray's pupil at Cambridge, but what little evidence exists on the matter is rather against this supposition. \n\nLater life and family \n\nAfter leaving Cambridge in 1662 he spent some time travelling both in Britain and the continent. In 1673, Ray married Margaret Oakley of Launton; in 1676 he went to Middleton Hall near Tamworth, and in 1677 to Falborne (or Faulkbourne) Hall in Essex. Finally, in 1679, he removed to his birthplace at Black Notley, where he afterwards remained. His life there was quiet and uneventful, although he had poor health, including chronic sores. Ray kept writing books and corresponded widely on scientific matters. He lived, in spite of his infirmities, to the age of seventy-seven, dying at Black Notley. He is buried in the churchyard of St Peter and St Paul where there is a memorial to him.\n\nWork \n\nAt Cambridge, Ray spent much of his time in the study of natural history, a subject which would occupy him for most of his life. When Ray found himself unable to subscribe as required by the ‘Bartholomew Act’ of 1662 he, along with 13 other college fellows, resigned his fellowship on 24 August 1662 rather than swear to the declaration that the Solemn League and Covenant was not binding on those who had taken it.  Tobias Smollett quoted the reasoning given in the biography of Ray by William Derham:\n\"The reason of his refusal was not (says his biographer) as some have imagined, his having taken the solemn league and covenant; for that he never did, and often declared that he ever thought it an unlawful oath: but he said he could not say, for those that had taken the oath, that no obligation lay upon them, but feared there might.\"Tobias George Smollett (1761) The Critical review, or, Annals of literature, Volume 11 [https://books.google.com/books?idZoRHAAAAYAAJ&pg\nPA93&lpg=PA93 pp. 92–93]\nHis religious views were generally in accord with those imposed under the restoration of Charles II of England, and (though technically a nonconformist) he continued as a layman in the Established Church of England.\n\nFrom this time onwards he seems to have depended chiefly on the bounty of his pupil Francis Willughby, who made Ray his constant companion while he lived. Willughby arranged that after his death, Ray would have 6 shillings a year for educating Willughby's two sons.\n\nIn the spring of 1663 Ray started together with Willughby and two other pupils (Philip Skippon and Nathaniel Bacon) on a tour through Europe, from which he returned in March 1666, parting from Willughby at Montpellier, whence the latter continued his journey into Spain. He had previously in three different journeys (1658, 1661, 1662) travelled through the greater part of Great Britain, and selections from his private notes of these journeys were edited by George Scott in 1760, under the title of Mr Ray's Itineraries. Ray himself published an account of his foreign travel in 1673, entitled Observations topographical, moral, and physiological, made on a Journey through part of the Low Countries, Germany, Italy, and France. From this tour Ray and Willughby returned laden with collections, on which they meant to base complete systematic descriptions of the animal and vegetable kingdoms. Willughby undertook the former part, but, dying in 1672, left only an ornithology and ichthyology for Ray to edit; while Ray used the botanical collections for the groundwork of his Methodus plantarum nova (1682), and his great Historia generalis plantarum (3 vols., 1686, 1688, 1704). The plants gathered on his British tours had already been described in his Catalogus plantarum Angliae (1670), which formed the basis for later English floras.\n\nIn 1667 Ray was elected Fellow of the Royal Society, and in 1669 he and Willughby published a paper on Experiments concerning the Motion of Sap in Trees. In 1671, he presented the research of Francis Jessop on formic acid to the Royal Society.\n\nIn the 1690s, he published three volumes on religion—the most popular being The Wisdom of God Manifested in the Works of the Creation (1691), an essay describing evidence that all in nature and space is God's creation as in Bible is affirmed. In this volume, he moved on from the naming and cataloguing of species like his successor Carl Linnaeus. Instead, Ray considered species' lives and how nature worked as a whole, giving facts that are arguments for God's will expressed in His creation of all 'visible and invisible' (Colossians 1:16).\nRay gave an early description of dendrochronology, explaining for the ash tree how to find its age from its tree-rings.Armstrong, 2000. p. 47\n\nRay's definition of species \n\nRay was the first person to produce a biological definition of species, in his 1686 History of plants:\n\n\"... no surer criterion for determining species has occurred to me than the distinguishing features that perpetuate themselves in propagation from seed. Thus, no matter what variations occur in the individuals or the species, if they spring from the seed of one and the same plant, they are accidental variations and not such as to distinguish a species... Animals likewise that differ specifically preserve their distinct species permanently; one species never springs from the seed of another nor vice versa\".Mayr Growth of biological thought p256; original was Ray, History of Plants. 1686, trans E. Silk.\n\nSystem of classification \n\nAs outlined in his Historia Plantarum (1685–1703):\n* Herbae (Herbaceous plants)\n** Imperfectae (Cryptogams)\n** Perfectae (Seed plants)\n*** Monocotyledons\n*** Dicotyledons\n* Arborae (Trees)\n*** Monocotyledons\n*** Dicotyledons\n\nPublications \n\nRay published about 23 works, depending on how they are counted. The biological works were usually in Latin, the rest in English.Keynes, Sir Geoffrey [1951] 1976. John Ray, 1627–1705: a bibliography 1660–1970. Van Heusden, Amsterdam. His first publication, while at Cambridge, was the Catalogus plantarum circa Cantabrigiam nascentium (1660), followed by many works, botanical, zoological, theological and literary.\n\nList of selected publications \n\n*1660: Catalogus plantarum circa Cantabrigiam nascentium (Catalogue of Cambridge plants)\n*1668: Tables of plants.\n* \n*1670: Collection of English proverbs.\n*1673: Observations in the Low Countries and Catalogue of plants not native to England.\n*1674: Collection of English words not generally used.\n*, in \n*1675: Trilingual dictionary, or nomenclator classicus.\n*1676: [https://www.biodiversitylibrary.org/item/129443#page/7/mode/1up  Willughby's Ornithologia].\n* \n** [https://web.archive.org/web/20080820060520/http://montgomery.cas.muohio.edu/nimissa/research/methodus%20folder/methoduspreliminary.html English translation by Stephen Nimis]\n*1686: History of fishes.\n*1686–1704: Historia plantarum species [History of plants]. London:Clark 3 vols;\n** [https://books.google.com/books?idfCCbsb0ySy0C Vol 1 1686], [https://books.google.com/books?id\n01xl8Eu-LnwC Vol 2 1688], [https://books.google.com/books?id=ojSSrVW3OrcC Vol 3 1704] (in Latin)\n* \n** 2nd ed 1696\n*1691: [http://www.jri.org.uk/ray/wisdom/ The wisdom of God Manifested in the Works of the Creation 7th ed.] 2nd ed 1692, 3rd ed 1701, 4th ed 1704, 7th ed 1717\n*1692: [http://lhldigital.lindahall.org/cdm/ref/collection/earththeory/id/15962 Miscellaneous discourses concerning the dissolution and changes of the world]\n*1693: [https://www.biodiversitylibrary.org/item/91492 Synopsis of animals and reptiles].\n*1693: Collection of travels.\n*1694: Collection of European plants.\n*1695: Plants of each county. (Camden's Britannia)\n* \n** [https://web.archive.org/web/20080827204643/http://montgomery.cas.muohio.edu/nimissa/research/dissertatio/diss.html English translation by Stephen Nimis]\n*1700: A persuasive to a holy life.\n* \n\n;Posthumous \n\n*1705. Method and history of insects\n*1713:  [http://gdz.sub.uni-goettingen.de/dms/load/toc/?PID=PPN383878012 Synopsis methodica avium & piscium: opus posthumum (Synopsis of birds and fishes), in Latin. William Innys, London] vol. 1: Avium vol. 2: Piscium \n*1713 [http://lhldigital.lindahall.org/cdm/ref/collection/earththeory/id/9107 Three Physico-theological discourses]\n* \n** [http://www.raysociety.org.uk/publications/general-and-historical/synopsis-methodica-stirpum-britannicarum-john-ray/ Facsimile edition 1973, Ray Society, London. With introduction by William T. Stearn. ]\n** Fourth edition 1760\n\nLibraries holding Ray's works \n\nIncluding the various editions, there are 172 works of Ray, of which most are rare. The only libraries with substantial holdings are all in England.p153 The list in order of holdings is:\n\nThe British Library, Euston, London. Holds over 80 of the editions.\nThe Bodleian Library, University of Oxford.\nThe University of Cambridge Library.\nLibrary of Trinity College Cambridge.\nThe Natural History Museum Library, South Kensington, London.\nThe John Rylands Library, University of Manchester, Deansgate, Manchester\n\nLegacy\n\nRay's biographer, Charles Raven, commented that \"Ray sweeps away the litter of mythology and fable... and always insists upon accuracy of observation and description and the testing of every new discovery\".p10 Ray's works were directly influential on the development of taxonomy by Carl Linnaeus.\n\nThe Ray Society, named after John Ray, was founded in 1844. It is a scientific text publication society and registered charity, based at the Natural History Museum, London, which exists to publish books on natural history, with particular (but not exclusive) reference to the flora and fauna of the British Isles. As of 2017, the Society had published 179 volumes. \n\nThe John Ray Society (a separate organisation) is the Natural Sciences Society at St Catharine's College, Cambridge. It organises a programme of events of interest to science students in the college. \n\nIn 1986, to mark the 300th anniversary of the publication of Ray's Historia Plantarum, there was a celebration of Ray's legacy in Braintree, Essex. A \"John Ray Gallery\" was opened in the Braintree Museum.\n\nThe John Ray Initiative (JRI) is an educational charity that seeks to reconcile scientific and Christian understandings of the environment. It was formed in 1997 in response to the global environmental crisis and the challenges of sustainable development and environmental stewardship. John Ray's writings proclaimed God as creator whose wisdom is \"manifest in the works of creation\", and as redeemer of all things. JRI aims to teach appreciation of nature, increase awareness of the state of the global environment, and to promote a Christian understanding of environmental issues. John Ray. http://en.wikipedia.org/?curid=15596."
  }
}
