{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18819",
  "eid" : "34be1950-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778597733,
  "textBody" : "Microeconomics (from Greek prefix mikro- meaning \"small\") is a branch of economics that studies the behavior of individuals and firms in making decisions regarding the allocation of scarce resources and the interactions among these individuals and firms.\n\nOne goal of microeconomics is to analyze the market mechanisms that establish relative prices among goods and services and allocate limited resources among alternative uses. Microeconomics shows conditions under which free markets lead to desirable allocations. It also analyzes market failure, where markets fail to produce efficient results.\n\nMicroeconomics stands in contrast to macroeconomics, which involves \"the sum total of economic activity, dealing with the issues of growth, inflation, and unemployment and with national policies relating to these issues\". Microeconomics also deals with the effects of economic policies (such as changing taxation levels) on the aforementioned aspects of the economy. Particularly in the wake of the Lucas critique, much of modern macroeconomic theory has been built upon microfoundations—i.e. based upon basic assumptions about micro-level behavior.\n\nAssumptions and definitions\n\nMicroeconomic theory typically begins with the study of a single rational and utility maximizing individual. To economists, rationality means an individual possesses stable preferences that are both complete and transitive. The technical assumption that preference relations are continuous is needed to ensure the existence of a utility function. Although microeconomic theory can continue without this assumption, it would make comparative statics impossible since there is no guarantee that the resulting utility function would be differentiable.\n\nMicroeconomic theory progresses by defining a competitive budget set which is a subset of the consumption set. It is at this point that economists make The technical assumption that preferences are locally non-satiated. Without the assumption of LNS (local non-satiation) there is no guarantee that a rational individual would maximize utility. With the necessary tools and assumptions in place the utility maximization problem (UMP) is developed.\n\nThe utility maximization problem is the heart of consumer theory. The utility maximization problem attempts to explain the action axiom by imposing rationality axioms on consumer preferences and then mathematically modeling and analyzing the consequences. The utility maximization problem serves not only as the mathematical foundation of consumer theory but as a metaphysical explanation of it as well. That is, the utility maximization problem is used by economists to not only explain what or how individuals make choices but why individuals make choices as well.\n\nThe utility maximization problem is a constrained optimization problem in which an individual seeks to maximize utility subject to a budget constraint. Economists use the extreme value theorem to guarantee that a solution to the utility maximization problem exists. That is, since the budget constraint is both bounded and closed, a solution to the utility maximization problem exists. Economists call the solution to the utility maximization problem a Walrasian demand function or correspondence.\n\nThe utility maximization problem has so far been developed by taking consumer tastes (i.e. consumer utility) as the primitive. However, an alternative way to develop microeconomic theory is by taking consumer choice as the primitive. This model of microeconomic theory is referred to as revealed preference theory.\n\nThe theory of supply and demand usually assumes that markets are perfectly competitive. This implies that there are many buyers and sellers in the market and none of them have the capacity to significantly influence prices of goods and services. In many real-life transactions, the assumption fails because some individual buyers or sellers have the ability to influence prices. Quite often, a sophisticated analysis is required to understand the demand-supply equation of a good model. However, the theory works well in situations meeting these assumptions.\n\nMainstream economics does not assume a priori that markets are preferable to other forms of social organization. In fact, much analysis is devoted to cases where market failures lead to resource allocation that is suboptimal and creates deadweight loss. A classic example of suboptimal resource allocation is that of a public good. In such cases, economists may attempt to find policies that avoid waste, either directly by government control, indirectly by regulation that induces market participants to act in a manner consistent with optimal welfare, or by creating \"missing markets\" to enable efficient trading where none had previously existed.\n\nThis is studied in the field of collective action and public choice theory. \"Optimal welfare\" usually takes on a Paretian norm, which is a mathematical application of the Kaldor–Hicks method.  This can diverge from the Utilitarian goal of maximizing utility because it does not consider the distribution of goods between people. Market failure in positive economics (microeconomics) is limited in implications without mixing the belief of the economist and their theory.\n\nThe demand for various commodities by individuals is generally thought of as the outcome of a utility-maximizing process, with each individual trying to maximize their own utility under a budget constraint and a given consumption set.\n\nBasic microeconomic concepts\n\nThe study of microeconomics involves several \"key\" areas:\n\nDemand, supply, and equilibrium\n\nSupply and demand is an economic model of price determination in a perfectly competitive market. It concludes that in a perfectly competitive market with no externalities, per unit taxes, or price controls, the unit price for a particular good is the price at which the quantity demanded by consumers equals the quantity supplied by producers. This price results in a stable economic equilibrium.\n\nMeasurement of elasticities\n\nElasticity is the measurement of how responsive an economic variable is to a change in another variable. Elasticity can be quantified as the ratio of the percentage change in one variable to the percentage change in another variable, when the later variable has a causal influence on the former. It is a tool for measuring the responsiveness of a variable, or of the function that determines it, to changes in causative variables in unitless ways. Frequently used elasticities include price elasticity of demand, price elasticity of supply, income elasticity of demand, elasticity of substitution or constant elasticity of substitution between factors of production and elasticity of intertemporal substitution.\n\nConsumer demand theory\n\nConsumer demand theory relates preferences for the consumption of both goods and services to the consumption expenditures; ultimately, this relationship between preferences and consumption expenditures is used to relate preferences to consumer demand curves. The link between personal preferences, consumption and the demand curve is one of the most closely studied relations in economics. It is a way of analyzing how consumers may achieve equilibrium between preferences and expenditures by maximizing utility subject to consumer budget constraints.\n\nTheory of production\n\nProduction theory is the study of production, or the economic process of converting inputs into outputs. Production uses resources to create a good or service that is suitable for use, gift-giving in a gift economy, or exchange in a market economy. This can include manufacturing, storing, shipping, and packaging. Some economists define production broadly as all economic activity other than consumption. They see every commercial activity other than the final purchase as some form of production.\n\nCosts of production\n\nThe cost-of-production theory of value states that the price of an object or condition is determined by the sum of the cost of the resources that went into making it. The cost can comprise any of the factors of production: labour, capital, land. Technology can be viewed either as a form of fixed capital (e.g.\nplant) or circulating capital (e.g.\nintermediate goods).\n\nOpportunity cost\n\nThe economic idea of opportunity cost is closely related to the idea of time constraints. You can do only one thing at a time, which means that, inevitably, you’re always giving up other things.\n\nThe opportunity cost of any activity is the value of the next-best alternative thing you may have done instead. Opportunity cost depends only on the value of the next-best alternative. It doesn’t matter whether you have 5 alternatives or 5,000.\n\nOpportunity costs can tell you when not to do something as well as when to do something. For example, you may like waffles, but you like chocolate even more. If someone offers you only waffles, you’re going to take it. But if you’re offered waffles or chocolate, you’re going to take the chocolate. The opportunity cost of eating waffles is sacrificing the chance to eat chocolate. Because the cost of not eating the chocolate is higher than the benefits of eating the waffles, it makes no sense to choose waffles. Of course, if you choose chocolate, you’re still faced with the opportunity cost of giving up having waffles. But you’re willing to do that because the waffle's opportunity cost is lower than the benefits of the chocolate. Opportunity costs are unavoidable constraints on behaviour because you have to decide what’s best and give up the next-best alternative.\n\nMarket structure\n\nThe market structure can have several types of interacting market systems. \nDifferent forms of markets are a feature of capitalism, and advocates of socialism often criticize markets and aim to substitute markets with economic planning to varying degrees. Competition is the regulatory mechanism of the market system.\n\nSome examples of markets:\n* commodity markets\n* insurance markets\n* bond markets\n* energy markets\n* flea markets\n* debt markets\n* stock markets\n* online auctions\n* media exchange markets\n* real-estate market.\n\nPerfect competition\n\nPerfect competition is a situation in which numerous small firms producing identical products compete against each other in a given industry. Perfect competition leads to firms producing the socially optimal output level at the minimum possible cost per unit. Firms in perfect competition are \"price takers\" (they do not have enough market power to profitably increase the price of their goods or services). A good example would be that of digital marketplaces, such as eBay, on which many different sellers sell similar products to many different buyers.\n\nImperfect competition\n\nIn economic theory, imperfect competition is a type of market structure showing some but not all features of competitive markets.\n\nMonopolistic competition\n\nMonopolistic competition is a situation in which many firms with slightly different products compete. Production costs are above what may be achieved by perfectly competitive firms, but society benefits from the product differentiation. Examples of industries with market structures similar to monopolistic competition include restaurants, cereal, clothing, shoes, and service industries in large cities.\n\nMonopoly\n\nA monopoly (from Greek monos μόνος (alone or single) + polein πωλεῖν (to sell)) is a market structure in which a market or industry is dominated by a single supplier of a particular good or service. Because monopolies have no competition they tend to sell goods and services at a higher price and produce below the socially optimal output level. Although not all monopolies are a bad thing, especially in industries where multiple firms would result in more problems than benefits (i.e. natural monopolies).\n\n* Natural monopoly: A monopoly in an industry where one producer can produce output at a lower cost than many small producers.\n\nOligopoly\n\nAn oligopoly is a market structure in which a market or industry is dominated by a small number of firms (oligopolists).  Oligopolies can create the incentive for firms to engage in collusion and form cartels that reduce competition leading to higher prices for consumers and less overall market output.http://www.ftc.gov/bc/edu/pubs/consumer/general/zgen01.shtm Alternatively, oligopolies can be fiercely competitive and engage in flamboyant advertising campaigns.\n\n* Duopoly: A special case of an oligopoly, with only two firms. Game theory can elucidate behavior in duopolies and oligopolies.\n\nMonopsony\n\nA monopsony is a market where there is only one buyer and many sellers.\n\nOligopsony\n\nAn oligopsony is a market where there are a few buyers and many sellers.\n\nGame theory\n\nGame theory is a major method used in mathematical economics and business for modeling competing behaviors of interacting agents. The term \"game\" here implies the study of any strategic interaction between people. Applications include a wide array of economic phenomena and approaches, such as auctions, bargaining, mergers & acquisitions pricing, fair division, duopolies, oligopolies, social network formation, agent-based computational economics, general equilibrium, mechanism design, and voting systems, and across such broad areas as experimental economics, behavioral economics, information economics, industrial organization, and political economy.\n\nLabor economics\n\nLabor economics seeks to understand the functioning and dynamics of the markets for wage labor. Labor markets function through the interaction of workers and employers. Labor economics looks at the suppliers of labor services (workers), the demands of labor services (employers), and attempts to understand the resulting pattern of wages, employment, and income.  In economics, labor  is a measure of the work done by human beings. It is conventionally contrasted with such other factors of production as land and capital. There are theories which have developed a concept called human capital (referring to the skills that workers possess, not necessarily their actual work), although there are also counter posing macro-economic system theories that think human capital is a contradiction in terms.\n\nWelfare economics\n\nWelfare economics is a branch of economics that uses microeconomics techniques to evaluate well-being from allocation of productive factors as to desirability and economic efficiency within an economy, often relative to competitive general equilibrium.Deardorff's Glossary of International Economics (2006). [http://www-personal.umich.edu/~alandear/glossary/w.html#WelfareEconomics \"Welfare economics.\"] It analyzes social welfare, however measured, in terms of economic activities of the individuals that compose the theoretical society considered.  Accordingly, individuals, with associated economic activities, are the basic units for aggregating to social welfare, whether of a group, a community, or a society, and there is no \"social welfare\" apart from the \"welfare\" associated with its individual units.\n\nEconomics of information\n\nInformation economics or the economics of information is a branch of microeconomic theory that studies how information and information systems affect an economy and economic decisions.  Information has special characteristics.  It is easy to create but hard to trust. It is easy to spread but hard to control.  It influences many decisions. These special characteristics (as compared with other types of goods) complicate many standard economic theories.• Beth Allen, 1990. \"Information as an Economic Commodity,\" American Economic Review, 80(2),  pp. [https://www.jstor.org/pss/2006582 268]–273.  • Kenneth J. Arrow, 1999. \"Information and the Organization of Industry,\" ch. 1, in Graciela Chichilnisky Markets, Information, and Uncertainty. Cambridge University Press, pp. [https://books.google.com/books?idm6PLCb18RrsC&pg\nPA20&lpgPA20&dq\nfalse 20–21].   • _____, 1996. \"The Economics of Information: An Exposition,\" Empirica, 23(2), pp. [http://www.springerlink.com/content/pr7683r221m35x42/ 119]–128.   • _____, 1984. Collected Papers of Kenneth J. Arrow, v. 4, The Economics of Information. [http://www.hup.harvard.edu/catalog.php?isbn9780674137639 Description] and chapter-preview [https://books.google.com/books?id\nZYIiFsrT0dcC&printsecfind&pg\nPP9onepage&q&f\nfalse#vonepage&q&f\nfalse links.]   • Jean-Jacques Laffont, 1989. The Economics of Uncertainty and Information, MIT Press. [http://mitpress.mit.edu/catalog/item/default.asp?ttype2&tid\n7640 Description]  and chapter-preview [https://books.google.com/books/p/harvard?id7r484x3HVu4C&printsec\nfind&pgPR5\n#vonepage&q&f\nfalse links].\n\nApplied\n\nApplied microeconomics includes a range of specialized areas of study, many of which draw on methods from other fields. Industrial organization examines topics such as the entry and exit of firms, innovation, and the role of trademarks. Labor economics examines wages, employment, and labor market dynamics. Financial economics examines topics such as the structure of optimal portfolios, the rate of return to capital, econometric analysis of security returns, and corporate financial behavior. Public economics examines the design of government tax and expenditure policies and economic effects of these policies (e.g., social insurance programs). Political economy examines the role of political institutions in determining policy outcomes. Health economics examines the organization of health care systems, including the role of the health care workforce and health insurance programs. Education economics examines the organization of education provision and its implication for efficiency and equity, including the effects of education on productivity. Urban economics, which examines the challenges faced by cities, such as sprawl, air and water pollution, traffic congestion, and poverty, draws on the fields of urban geography and sociology. Law and economics applies microeconomic principles to the selection and enforcement of competing legal regimes and their relative efficiencies. Economic history examines the evolution of the economy and economic institutions, using methods and techniques from the fields of economics, history, geography, sociology, psychology, and political science.\n\nHistory\n\nThe difference between microeconomics and macroeconomics was introduced in 1933 by Ragnar Frisch.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Microeconomics" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18819" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Microeconomics (from Greek prefix mikro- meaning \"small\") is a branch of economics that studies the behavior of individuals and firms in making decisions regarding the allocation of scarce resources and the interactions among these individuals and firms.\n\nOne goal of microeconomics is to analyze the market mechanisms that establish relative prices among goods and services and allocate limited resources among alternative uses. Microeconomics shows conditions under which free markets lead to desirable allocations. It also analyzes market failure, where markets fail to produce efficient results.\n\nMicroeconomics stands in contrast to macroeconomics, which involves \"the sum total of economic activity, dealing with the issues of growth, inflation, and unemployment and with national policies relating to these issues\". Microeconomics also deals with the effects of economic policies (such as changing taxation levels) on the aforementioned aspects of the economy. Particularly in the wake of the Lucas critique, much of modern macroeconomic theory has been built upon microfoundations—i.e. based upon basic assumptions about micro-level behavior.\n\nAssumptions and definitions\n\nMicroeconomic theory typically begins with the study of a single rational and utility maximizing individual. To economists, rationality means an individual possesses stable preferences that are both complete and transitive. The technical assumption that preference relations are continuous is needed to ensure the existence of a utility function. Although microeconomic theory can continue without this assumption, it would make comparative statics impossible since there is no guarantee that the resulting utility function would be differentiable.\n\nMicroeconomic theory progresses by defining a competitive budget set which is a subset of the consumption set. It is at this point that economists make The technical assumption that preferences are locally non-satiated. Without the assumption of LNS (local non-satiation) there is no guarantee that a rational individual would maximize utility. With the necessary tools and assumptions in place the utility maximization problem (UMP) is developed.\n\nThe utility maximization problem is the heart of consumer theory. The utility maximization problem attempts to explain the action axiom by imposing rationality axioms on consumer preferences and then mathematically modeling and analyzing the consequences. The utility maximization problem serves not only as the mathematical foundation of consumer theory but as a metaphysical explanation of it as well. That is, the utility maximization problem is used by economists to not only explain what or how individuals make choices but why individuals make choices as well.\n\nThe utility maximization problem is a constrained optimization problem in which an individual seeks to maximize utility subject to a budget constraint. Economists use the extreme value theorem to guarantee that a solution to the utility maximization problem exists. That is, since the budget constraint is both bounded and closed, a solution to the utility maximization problem exists. Economists call the solution to the utility maximization problem a Walrasian demand function or correspondence.\n\nThe utility maximization problem has so far been developed by taking consumer tastes (i.e. consumer utility) as the primitive. However, an alternative way to develop microeconomic theory is by taking consumer choice as the primitive. This model of microeconomic theory is referred to as revealed preference theory.\n\nThe theory of supply and demand usually assumes that markets are perfectly competitive. This implies that there are many buyers and sellers in the market and none of them have the capacity to significantly influence prices of goods and services. In many real-life transactions, the assumption fails because some individual buyers or sellers have the ability to influence prices. Quite often, a sophisticated analysis is required to understand the demand-supply equation of a good model. However, the theory works well in situations meeting these assumptions.\n\nMainstream economics does not assume a priori that markets are preferable to other forms of social organization. In fact, much analysis is devoted to cases where market failures lead to resource allocation that is suboptimal and creates deadweight loss. A classic example of suboptimal resource allocation is that of a public good. In such cases, economists may attempt to find policies that avoid waste, either directly by government control, indirectly by regulation that induces market participants to act in a manner consistent with optimal welfare, or by creating \"missing markets\" to enable efficient trading where none had previously existed.\n\nThis is studied in the field of collective action and public choice theory. \"Optimal welfare\" usually takes on a Paretian norm, which is a mathematical application of the Kaldor–Hicks method.  This can diverge from the Utilitarian goal of maximizing utility because it does not consider the distribution of goods between people. Market failure in positive economics (microeconomics) is limited in implications without mixing the belief of the economist and their theory.\n\nThe demand for various commodities by individuals is generally thought of as the outcome of a utility-maximizing process, with each individual trying to maximize their own utility under a budget constraint and a given consumption set.\n\nBasic microeconomic concepts\n\nThe study of microeconomics involves several \"key\" areas:\n\nDemand, supply, and equilibrium\n\nSupply and demand is an economic model of price determination in a perfectly competitive market. It concludes that in a perfectly competitive market with no externalities, per unit taxes, or price controls, the unit price for a particular good is the price at which the quantity demanded by consumers equals the quantity supplied by producers. This price results in a stable economic equilibrium.\n\nMeasurement of elasticities\n\nElasticity is the measurement of how responsive an economic variable is to a change in another variable. Elasticity can be quantified as the ratio of the percentage change in one variable to the percentage change in another variable, when the later variable has a causal influence on the former. It is a tool for measuring the responsiveness of a variable, or of the function that determines it, to changes in causative variables in unitless ways. Frequently used elasticities include price elasticity of demand, price elasticity of supply, income elasticity of demand, elasticity of substitution or constant elasticity of substitution between factors of production and elasticity of intertemporal substitution.\n\nConsumer demand theory\n\nConsumer demand theory relates preferences for the consumption of both goods and services to the consumption expenditures; ultimately, this relationship between preferences and consumption expenditures is used to relate preferences to consumer demand curves. The link between personal preferences, consumption and the demand curve is one of the most closely studied relations in economics. It is a way of analyzing how consumers may achieve equilibrium between preferences and expenditures by maximizing utility subject to consumer budget constraints.\n\nTheory of production\n\nProduction theory is the study of production, or the economic process of converting inputs into outputs. Production uses resources to create a good or service that is suitable for use, gift-giving in a gift economy, or exchange in a market economy. This can include manufacturing, storing, shipping, and packaging. Some economists define production broadly as all economic activity other than consumption. They see every commercial activity other than the final purchase as some form of production.\n\nCosts of production\n\nThe cost-of-production theory of value states that the price of an object or condition is determined by the sum of the cost of the resources that went into making it. The cost can comprise any of the factors of production: labour, capital, land. Technology can be viewed either as a form of fixed capital (e.g.\nplant) or circulating capital (e.g.\nintermediate goods).\n\nOpportunity cost\n\nThe economic idea of opportunity cost is closely related to the idea of time constraints. You can do only one thing at a time, which means that, inevitably, you’re always giving up other things.\n\nThe opportunity cost of any activity is the value of the next-best alternative thing you may have done instead. Opportunity cost depends only on the value of the next-best alternative. It doesn’t matter whether you have 5 alternatives or 5,000.\n\nOpportunity costs can tell you when not to do something as well as when to do something. For example, you may like waffles, but you like chocolate even more. If someone offers you only waffles, you’re going to take it. But if you’re offered waffles or chocolate, you’re going to take the chocolate. The opportunity cost of eating waffles is sacrificing the chance to eat chocolate. Because the cost of not eating the chocolate is higher than the benefits of eating the waffles, it makes no sense to choose waffles. Of course, if you choose chocolate, you’re still faced with the opportunity cost of giving up having waffles. But you’re willing to do that because the waffle's opportunity cost is lower than the benefits of the chocolate. Opportunity costs are unavoidable constraints on behaviour because you have to decide what’s best and give up the next-best alternative.\n\nMarket structure\n\nThe market structure can have several types of interacting market systems. \nDifferent forms of markets are a feature of capitalism, and advocates of socialism often criticize markets and aim to substitute markets with economic planning to varying degrees. Competition is the regulatory mechanism of the market system.\n\nSome examples of markets:\n* commodity markets\n* insurance markets\n* bond markets\n* energy markets\n* flea markets\n* debt markets\n* stock markets\n* online auctions\n* media exchange markets\n* real-estate market.\n\nPerfect competition\n\nPerfect competition is a situation in which numerous small firms producing identical products compete against each other in a given industry. Perfect competition leads to firms producing the socially optimal output level at the minimum possible cost per unit. Firms in perfect competition are \"price takers\" (they do not have enough market power to profitably increase the price of their goods or services). A good example would be that of digital marketplaces, such as eBay, on which many different sellers sell similar products to many different buyers.\n\nImperfect competition\n\nIn economic theory, imperfect competition is a type of market structure showing some but not all features of competitive markets.\n\nMonopolistic competition\n\nMonopolistic competition is a situation in which many firms with slightly different products compete. Production costs are above what may be achieved by perfectly competitive firms, but society benefits from the product differentiation. Examples of industries with market structures similar to monopolistic competition include restaurants, cereal, clothing, shoes, and service industries in large cities.\n\nMonopoly\n\nA monopoly (from Greek monos μόνος (alone or single) + polein πωλεῖν (to sell)) is a market structure in which a market or industry is dominated by a single supplier of a particular good or service. Because monopolies have no competition they tend to sell goods and services at a higher price and produce below the socially optimal output level. Although not all monopolies are a bad thing, especially in industries where multiple firms would result in more problems than benefits (i.e. natural monopolies).\n\n* Natural monopoly: A monopoly in an industry where one producer can produce output at a lower cost than many small producers.\n\nOligopoly\n\nAn oligopoly is a market structure in which a market or industry is dominated by a small number of firms (oligopolists).  Oligopolies can create the incentive for firms to engage in collusion and form cartels that reduce competition leading to higher prices for consumers and less overall market output.http://www.ftc.gov/bc/edu/pubs/consumer/general/zgen01.shtm Alternatively, oligopolies can be fiercely competitive and engage in flamboyant advertising campaigns.\n\n* Duopoly: A special case of an oligopoly, with only two firms. Game theory can elucidate behavior in duopolies and oligopolies.\n\nMonopsony\n\nA monopsony is a market where there is only one buyer and many sellers.\n\nOligopsony\n\nAn oligopsony is a market where there are a few buyers and many sellers.\n\nGame theory\n\nGame theory is a major method used in mathematical economics and business for modeling competing behaviors of interacting agents. The term \"game\" here implies the study of any strategic interaction between people. Applications include a wide array of economic phenomena and approaches, such as auctions, bargaining, mergers & acquisitions pricing, fair division, duopolies, oligopolies, social network formation, agent-based computational economics, general equilibrium, mechanism design, and voting systems, and across such broad areas as experimental economics, behavioral economics, information economics, industrial organization, and political economy.\n\nLabor economics\n\nLabor economics seeks to understand the functioning and dynamics of the markets for wage labor. Labor markets function through the interaction of workers and employers. Labor economics looks at the suppliers of labor services (workers), the demands of labor services (employers), and attempts to understand the resulting pattern of wages, employment, and income.  In economics, labor  is a measure of the work done by human beings. It is conventionally contrasted with such other factors of production as land and capital. There are theories which have developed a concept called human capital (referring to the skills that workers possess, not necessarily their actual work), although there are also counter posing macro-economic system theories that think human capital is a contradiction in terms.\n\nWelfare economics\n\nWelfare economics is a branch of economics that uses microeconomics techniques to evaluate well-being from allocation of productive factors as to desirability and economic efficiency within an economy, often relative to competitive general equilibrium.Deardorff's Glossary of International Economics (2006). [http://www-personal.umich.edu/~alandear/glossary/w.html#WelfareEconomics \"Welfare economics.\"] It analyzes social welfare, however measured, in terms of economic activities of the individuals that compose the theoretical society considered.  Accordingly, individuals, with associated economic activities, are the basic units for aggregating to social welfare, whether of a group, a community, or a society, and there is no \"social welfare\" apart from the \"welfare\" associated with its individual units.\n\nEconomics of information\n\nInformation economics or the economics of information is a branch of microeconomic theory that studies how information and information systems affect an economy and economic decisions.  Information has special characteristics.  It is easy to create but hard to trust. It is easy to spread but hard to control.  It influences many decisions. These special characteristics (as compared with other types of goods) complicate many standard economic theories.• Beth Allen, 1990. \"Information as an Economic Commodity,\" American Economic Review, 80(2),  pp. [https://www.jstor.org/pss/2006582 268]–273.  • Kenneth J. Arrow, 1999. \"Information and the Organization of Industry,\" ch. 1, in Graciela Chichilnisky Markets, Information, and Uncertainty. Cambridge University Press, pp. [https://books.google.com/books?idm6PLCb18RrsC&pg\nPA20&lpgPA20&dq\nfalse 20–21].   • _____, 1996. \"The Economics of Information: An Exposition,\" Empirica, 23(2), pp. [http://www.springerlink.com/content/pr7683r221m35x42/ 119]–128.   • _____, 1984. Collected Papers of Kenneth J. Arrow, v. 4, The Economics of Information. [http://www.hup.harvard.edu/catalog.php?isbn9780674137639 Description] and chapter-preview [https://books.google.com/books?id\nZYIiFsrT0dcC&printsecfind&pg\nPP9onepage&q&f\nfalse#vonepage&q&f\nfalse links.]   • Jean-Jacques Laffont, 1989. The Economics of Uncertainty and Information, MIT Press. [http://mitpress.mit.edu/catalog/item/default.asp?ttype2&tid\n7640 Description]  and chapter-preview [https://books.google.com/books/p/harvard?id7r484x3HVu4C&printsec\nfind&pgPR5\n#vonepage&q&f\nfalse links].\n\nApplied\n\nApplied microeconomics includes a range of specialized areas of study, many of which draw on methods from other fields. Industrial organization examines topics such as the entry and exit of firms, innovation, and the role of trademarks. Labor economics examines wages, employment, and labor market dynamics. Financial economics examines topics such as the structure of optimal portfolios, the rate of return to capital, econometric analysis of security returns, and corporate financial behavior. Public economics examines the design of government tax and expenditure policies and economic effects of these policies (e.g., social insurance programs). Political economy examines the role of political institutions in determining policy outcomes. Health economics examines the organization of health care systems, including the role of the health care workforce and health insurance programs. Education economics examines the organization of education provision and its implication for efficiency and equity, including the effects of education on productivity. Urban economics, which examines the challenges faced by cities, such as sprawl, air and water pollution, traffic congestion, and poverty, draws on the fields of urban geography and sociology. Law and economics applies microeconomic principles to the selection and enforcement of competing legal regimes and their relative efficiencies. Economic history examines the evolution of the economy and economic institutions, using methods and techniques from the fields of economics, history, geography, sociology, psychology, and political science.\n\nHistory\n\nThe difference between microeconomics and macroeconomics was introduced in 1933 by Ragnar Frisch. Microeconomics. http://en.wikipedia.org/?curid=18819."
  }
}
