{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18057",
  "eid" : "30826b70-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778590631,
  "textBody" : "Louise Erdrich (born Karen Louise Erdrich, June 7, 1954) is an American author, writer of novels, poetry, and children's books featuring Native American characters and settings. She is an enrolled member of the Turtle Mountain Band of Chippewa Indians, a band of the Anishinaabe (also known as Ojibwe and Chippewa).\n\nErdrich is widely acclaimed as one of the most significant writers of the second wave of the Native American Renaissance. In 2009, her novel The Plague of Doves was a finalist for the Pulitzer Prize for Fiction and also received an Anisfield-Wolf Book Award.[http://www.anisfield-wolf.org/winners/winners-by-year/ The Anisfield-Wolf Book Awards -  Winners by Year] In November 2012, she received the National Book Award for Fiction for her novel The Round House. She was awarded the Library of Congress Prize for American Fiction at the National Book Festival in September, 2015. She was married to author Michael Dorris and the two collaborated on a number of works.\n\nShe is also the owner of Birchbark Books, a small independent bookstore in Minneapolis that focuses on Native American literature and the Native community in the Twin Cities.\n\nEarly and personal life\n\nErdrich was born on June 7, 1954, in Little Falls, Minnesota. She was the oldest of seven children born to Ralph Erdrich, a German-American, and Rita (née Gourneau), a Chippewa Indian (of half Ojibwe and half French blood). Both parents taught at a boarding school in Wahpeton, North Dakota, set up by the Bureau of Indian Affairs, and Erdrich's maternal grandfather, Patrick Gourneau, served as tribal chairman for the Turtle Mountain Band of Chippewa Indians for many years. While Erdrich was a child, her father paid her a nickel for every story she wrote. Her sister Heidi is a poet who also lives in Minnesota and publishes under the name Heid E. Erdrich. Another sister, Lise Erdrich, has written children's books and collections of fiction and essays.\n\nErdrich attended Dartmouth College from 1972 to 1976.h She was a part of the first class of women admitted to the college and earned an A.B. in English. During her freshman year, Erdrich met her future husband and collaborator, Michael Dorris, an anthropologist, writer, and then-director of the new Native American Studies program. While attending Dorris’ class, she began to look into her own ancestry, which birthed her inspiration for her literary work, such as poems, short stories, and novels.\n\nIn 1978, Erdrich enrolled in a Master of Arts program at Johns Hopkins University in Baltimore, Maryland. Nearly a year later, she had earned the Master of Arts in the Writing Seminars in 1979. Erdrich later published some of the poems and stories she wrote while in the M.A. program, and she later returned to Dartmouth as a writer-in-residence.\n\nErdrich remained in contact with Dorris. He attended one of her poetry readings, became impressed with her work, and then developed an interest in working with Erdrich. Although Erdrich and Dorris were on two different sides of the world, Erdrich in Boston and Dorris in New Zealand for field research, the two began to collaborate on short stories. One short story that involved this collaborative work, \"The World’s Greatest Fisherman\", won $5,000 in the Nelson Algren fiction competition. Erdrich and Dorris then expanded the story into the novel Love Medicine (1984), which won the National Book Critics Circle Award for Fiction. Around the same time as their collaborative success, Dorris left New Zealand, and upon returning, Erdrich and Dorris' literary partnership led them to a romantic relationship. They married in 1981, and raised three adopted children and three biological children until their separation in 1995 and Dorris' suicide in 1997. Following Dorris' suicide, Erdrich released The Antelope Wife (1998).\n\nDuring the publication of Love Medicine, Erdrich produced her first collection of poems, Jacklight (1984), which highlights the struggles between Native and non-Native cultures as well as commemorates and celebrates family, ties of kinship, autobiographical meditations, monologues, and love poetry, and incorporates an influence of Ojibwe myths and legends. Erdrich continued to write poems, which have been included in her collections. However, although her poetry is well known, Erdrich remains best known as a novelist, having written a dozen award-winning and best-selling novels.\n\nAlthough many of Erdrich’s works are influenced by her Native American heritage, her novel The Master Butchers Singing Club (2003) also included a focus on the European side of her ancestry. The novel includes stories of a World War I veteran that took place in a small North Dakota town. The novel went on to become a finalist for the National Book Award.\n\nIn addition to fiction and poetry, Erdrich has published non-fiction. The Blue Jay’s Dance (1995) includes the timeline of her pregnancy and birth of her first child, and Books and Islands in Ojibwe Country traces her travels in northern Minnesota and Ontario's lakes following the birth of her last daughter.\n\nShe returned to Dartmouth in 2009 to receive an honorary Doctorate of Letters and to deliver the commencement address.\n\nErdrich and her two sisters have hosted writers' workshops on the Turtle Mountain Indian Reservation in North Dakota.\n\nWhen asked in an interview if writing is a lonely life for her Erdrich replied, \"Strangely, I think it is. I am surrounded by an abundance of family and friends and yet I am alone with the writing. And that is perfect.\" Erdrich currently lives in Minnesota.\n\nWork\n\nHer heritage from both parents is influential in her life and prominent in her work.[http://www.poetryfoundation.org/bio/louise-erdrich]\n\nIn 1979 she wrote \"The World's Greatest Fisherman\", a short story about June Kashpaw, a divorced Ojibwe woman whose death by hypothermia brought her relatives home to a fictional North Dakota reservation for her funeral. It won the Nelson Algren Short Fiction prize and eventually became the first chapter of her debut novel, Love Medicine, published by Holt, Rinehart, and Winston in 1984.\n\nLove Medicine won the 1984 National Book Critics Circle Award. It has also been featured on the National Advanced Placement Test for Literature. Erdrich followed Love Medicine with The Beet Queen (1986), which continued her technique of using multiple narrators and expanded the fictional reservation universe of Love Medicine to include the nearby town of Argus, North Dakota.  The action of the novel takes place mostly before World War II.  Leslie Marmon Silko  accused Erdrich's The Beet Queen of being more concerned with postmodern technique than with the political struggles of Native peoples.Susan Castillo \"Postmodernism, Native American Literature, and the Real: The Silko-Erdrich Controversy\" in Notes from the Periphery: Marginality in North American Literature and Culture New York: Peter Lang, 1995. 179-190.\n\nTracks (1988) goes back to the early 20th century at the formation of the reservation and introduces the trickster figure of Nanapush, who owes a clear debt to Nanabozho.There are many studies of the trickster figure in Erdrich's novels: A recent study that makes the connection between Nanabozho and Nanpush is \"The Trickster and World Maintenance: An Anishinaabe Reading of Louise Erdrich's Tracks\" by Lawrence W. Gross [http://onCampus.richmond.edu/faculty/ASAIL/SAIL2/173.html] Tracks shows early clashes between traditional ways and the Roman Catholic Church. The Bingo Palace (1994), set in the 1980s,  describes the  effects of a casino and a factory on the reservation community.  Tales of Burning Love (1997) finishes the story of Sister Leopolda, a recurring character from all the previous books, and introduces a new set of white people into the reservation universe.\n\t \nThe Antelope Wife (1998), Erdrich's first novel after her divorce from Dorris, was the first of her novels to be set outside the continuity of the previous books.Lorena Laura Stookey, Louise Erdrich: A Critical Companion, Greenwood Publishing Group, 1999 ,  She subsequently returned to the reservation and nearby towns, and has published five novels since 1998 dealing with events in that fictional area. Among these are The Last Report on the Miracles at Little No Horse (2001) and The Master Butchers Singing Club (2003), a macabre mystery that again draws on Erdrich's Native American and German-American heritage. Both novels have geographic and character connections with The Beet Queen.  In 2009, Erdrich's novel The Plague of Doves was named a finalist for the Pulitzer Prize in Fiction. The narrative focuses on the historical lynching of four Native people wrongly accused of murdering a Caucasian family, and the effect of this injustice on the current generations. \n\t \t\nErdrich's complexly interwoven series of novels have drawn comparisons with William Faulkner's Yoknapatawpha novels.  Like Faulkner's, Erdrich's successive novels created multiple narratives in the same fictional area and combined the tapestry of local history with current themes and modern consciousness.See, e.g., Powell's Books (book review), Christian Science Monitor, August 2, 2004\n\nBirchbark Books\n\nThe bookstore hosts literary readings and other events, including the release of each of Erdrich's new works as well as the works and careers of other writers, particularly local Native writers. Erdrich and her staff consider Birchbark Books to be a “teaching bookstore”. In addition to books, the store sells Native art and traditional medicines, and Native American jewelry. A small nonprofit publisher founded by Erdrich and her sister, Wiigwaas Press, is affiliated with the store.\n\nAwards\n\n*1983 Pushcart Prize in Poetry\n*1984 National Book Critics Circle Award for Fiction, for Love Medicine\n*1985 Guggenheim Fellowship in Creative Arts\n*1987 O. Henry Award, for the short story \"Fleur\" (published in Esquire, August 1986)\n*1999 World Fantasy Award, for The Antelope Wife\n*2000 Lifetime Achievement Award from the Native Writers' Circle of the Americas\n*2005 Associate Poet Laureate of North Dakota\n*2006 Scott O'Dell Award for Historical Fiction, for the children's book \"The Game of Silence\"[http://www.scottodell.com/pages/ScottO'DellAwardforHistoricalFiction.aspx]   \n*2007 Honorary Doctorate from the University of North Dakota; refused by Erdrich because of her opposition to the university's North Dakota Fighting Sioux mascot\n*2009 Honorary Doctorate (Doctor of Letters) from Dartmouth College\n*2009 [https://www.kenyonreview.org/programs/kenyon-review-award-for-literary-achievement/louise-erdrich/ Kenyon Review Award for Literary Achievement]\n*2009 Anisfield-Wolf Book Award, for Plague of Doves \n*2012 National Book Award for Fiction for The Round House\n*2013 Rough Rider Award \n*2014 Dayton Literary Peace Prize, Richard C. Holbrooke Distinguished Achievement Award\n*2014 PEN/Saul Bellow Award for Achievement in American Fiction\n*2015 Library of Congress Prize for American Fiction\n*2016 National Book Critics Circle Award for Fiction, for LaRose\n\nWorks\n\nNovels\n\nBirchbark House series\n\n# The Birchbark House (1999)\n# The Game of Silence (2005)\n# The Porcupine Year (2008)\n# Chickadee (2012)\n# Makoons (2016)\n\nLove Medicine Series\n\n# Love Medicine (1984)\n# Tracks (1988)\n# The Bingo Palace (1994)\n# Tales of Burning Love (1997)\n# * The Last Report on the Miracles at Little No Horse (2001)\n# * Four Souls (2004)\n# The Painted Drum (2005)\n\nJustice Trilogy\n\n* The Plague of Doves (Harper, 2008)\n* The Round House (2012)\n* LaRose (2016)\n\nStandalone novels\n\n* The Beet Queen (1986)\n* The Crown of Columbus [coauthored with Michael Dorris] (1991)\n* The Antelope Wife (1998)\n* The Master Butchers Singing Club (2003)\n* Shadow Tag (Harper, 2010)\n* Future Home of the Living God (2017)\n\nStory collections\n\n* The Red Convertible: Collected and New Stories 1978-2008 (2009)\n\nChildren's literature\n\n* Grandmother's Pigeon (1996)\n* The Birchbark House (1999)\n* The Range Eternal (2002)\n* The Game of Silence (2005)\n* The Porcupine Year (2008)\n* Chickadee (2012)\n* Makoons (2016)\n\nPoetry\n\n* Jacklight (1984)\n* Baptism of Desire (1989)\n* Original Fire: Selected and New Poems (2003)\n\nNon-fiction\n\n* Route Two [coauthored with Michael Dorris] (1990)\n* The Blue Jay's Dance: A Birthyear (1995)\n* Books and Islands in Ojibwe Country (2003)\n\nAs editor or contributor\n\n* The Broken Cord by Michael Dorris (Foreword) (1989)\n* The Best American Short Stories 1993 (Editor, with Katrina Kenison) (1993)\n* Ghost Fishing: An Eco-Justice Poetry Anthology (Contributing poet, edited by Melissa Tuckey) (University of Georgia Press, 2018)\n\nInterviews\n\n* Conversations with Louise Erdrich and Michael Dorris, ed.  Allan Chavkin and Nancy Feyl Chavkin (Mississippi UP, 1994)\n* [http://www.theparisreview.org/interviews/6055/the-art-of-fiction-no-208-louise-erdrich Louise Erdrich, The Art of Fiction No. 208] Interview with Louise Erdrich by Lisa Halliday in The Paris Review\n\nEssays\n\n* Two Languages in Mind, But Just One in the Heart (2000)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Louise Erdrich" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18057" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Louise Erdrich (born Karen Louise Erdrich, June 7, 1954) is an American author, writer of novels, poetry, and children's books featuring Native American characters and settings. She is an enrolled member of the Turtle Mountain Band of Chippewa Indians, a band of the Anishinaabe (also known as Ojibwe and Chippewa).\n\nErdrich is widely acclaimed as one of the most significant writers of the second wave of the Native American Renaissance. In 2009, her novel The Plague of Doves was a finalist for the Pulitzer Prize for Fiction and also received an Anisfield-Wolf Book Award.[http://www.anisfield-wolf.org/winners/winners-by-year/ The Anisfield-Wolf Book Awards -  Winners by Year] In November 2012, she received the National Book Award for Fiction for her novel The Round House. She was awarded the Library of Congress Prize for American Fiction at the National Book Festival in September, 2015. She was married to author Michael Dorris and the two collaborated on a number of works.\n\nShe is also the owner of Birchbark Books, a small independent bookstore in Minneapolis that focuses on Native American literature and the Native community in the Twin Cities.\n\nEarly and personal life\n\nErdrich was born on June 7, 1954, in Little Falls, Minnesota. She was the oldest of seven children born to Ralph Erdrich, a German-American, and Rita (née Gourneau), a Chippewa Indian (of half Ojibwe and half French blood). Both parents taught at a boarding school in Wahpeton, North Dakota, set up by the Bureau of Indian Affairs, and Erdrich's maternal grandfather, Patrick Gourneau, served as tribal chairman for the Turtle Mountain Band of Chippewa Indians for many years. While Erdrich was a child, her father paid her a nickel for every story she wrote. Her sister Heidi is a poet who also lives in Minnesota and publishes under the name Heid E. Erdrich. Another sister, Lise Erdrich, has written children's books and collections of fiction and essays.\n\nErdrich attended Dartmouth College from 1972 to 1976.h She was a part of the first class of women admitted to the college and earned an A.B. in English. During her freshman year, Erdrich met her future husband and collaborator, Michael Dorris, an anthropologist, writer, and then-director of the new Native American Studies program. While attending Dorris’ class, she began to look into her own ancestry, which birthed her inspiration for her literary work, such as poems, short stories, and novels.\n\nIn 1978, Erdrich enrolled in a Master of Arts program at Johns Hopkins University in Baltimore, Maryland. Nearly a year later, she had earned the Master of Arts in the Writing Seminars in 1979. Erdrich later published some of the poems and stories she wrote while in the M.A. program, and she later returned to Dartmouth as a writer-in-residence.\n\nErdrich remained in contact with Dorris. He attended one of her poetry readings, became impressed with her work, and then developed an interest in working with Erdrich. Although Erdrich and Dorris were on two different sides of the world, Erdrich in Boston and Dorris in New Zealand for field research, the two began to collaborate on short stories. One short story that involved this collaborative work, \"The World’s Greatest Fisherman\", won $5,000 in the Nelson Algren fiction competition. Erdrich and Dorris then expanded the story into the novel Love Medicine (1984), which won the National Book Critics Circle Award for Fiction. Around the same time as their collaborative success, Dorris left New Zealand, and upon returning, Erdrich and Dorris' literary partnership led them to a romantic relationship. They married in 1981, and raised three adopted children and three biological children until their separation in 1995 and Dorris' suicide in 1997. Following Dorris' suicide, Erdrich released The Antelope Wife (1998).\n\nDuring the publication of Love Medicine, Erdrich produced her first collection of poems, Jacklight (1984), which highlights the struggles between Native and non-Native cultures as well as commemorates and celebrates family, ties of kinship, autobiographical meditations, monologues, and love poetry, and incorporates an influence of Ojibwe myths and legends. Erdrich continued to write poems, which have been included in her collections. However, although her poetry is well known, Erdrich remains best known as a novelist, having written a dozen award-winning and best-selling novels.\n\nAlthough many of Erdrich’s works are influenced by her Native American heritage, her novel The Master Butchers Singing Club (2003) also included a focus on the European side of her ancestry. The novel includes stories of a World War I veteran that took place in a small North Dakota town. The novel went on to become a finalist for the National Book Award.\n\nIn addition to fiction and poetry, Erdrich has published non-fiction. The Blue Jay’s Dance (1995) includes the timeline of her pregnancy and birth of her first child, and Books and Islands in Ojibwe Country traces her travels in northern Minnesota and Ontario's lakes following the birth of her last daughter.\n\nShe returned to Dartmouth in 2009 to receive an honorary Doctorate of Letters and to deliver the commencement address.\n\nErdrich and her two sisters have hosted writers' workshops on the Turtle Mountain Indian Reservation in North Dakota.\n\nWhen asked in an interview if writing is a lonely life for her Erdrich replied, \"Strangely, I think it is. I am surrounded by an abundance of family and friends and yet I am alone with the writing. And that is perfect.\" Erdrich currently lives in Minnesota.\n\nWork\n\nHer heritage from both parents is influential in her life and prominent in her work.[http://www.poetryfoundation.org/bio/louise-erdrich]\n\nIn 1979 she wrote \"The World's Greatest Fisherman\", a short story about June Kashpaw, a divorced Ojibwe woman whose death by hypothermia brought her relatives home to a fictional North Dakota reservation for her funeral. It won the Nelson Algren Short Fiction prize and eventually became the first chapter of her debut novel, Love Medicine, published by Holt, Rinehart, and Winston in 1984.\n\nLove Medicine won the 1984 National Book Critics Circle Award. It has also been featured on the National Advanced Placement Test for Literature. Erdrich followed Love Medicine with The Beet Queen (1986), which continued her technique of using multiple narrators and expanded the fictional reservation universe of Love Medicine to include the nearby town of Argus, North Dakota.  The action of the novel takes place mostly before World War II.  Leslie Marmon Silko  accused Erdrich's The Beet Queen of being more concerned with postmodern technique than with the political struggles of Native peoples.Susan Castillo \"Postmodernism, Native American Literature, and the Real: The Silko-Erdrich Controversy\" in Notes from the Periphery: Marginality in North American Literature and Culture New York: Peter Lang, 1995. 179-190.\n\nTracks (1988) goes back to the early 20th century at the formation of the reservation and introduces the trickster figure of Nanapush, who owes a clear debt to Nanabozho.There are many studies of the trickster figure in Erdrich's novels: A recent study that makes the connection between Nanabozho and Nanpush is \"The Trickster and World Maintenance: An Anishinaabe Reading of Louise Erdrich's Tracks\" by Lawrence W. Gross [http://onCampus.richmond.edu/faculty/ASAIL/SAIL2/173.html] Tracks shows early clashes between traditional ways and the Roman Catholic Church. The Bingo Palace (1994), set in the 1980s,  describes the  effects of a casino and a factory on the reservation community.  Tales of Burning Love (1997) finishes the story of Sister Leopolda, a recurring character from all the previous books, and introduces a new set of white people into the reservation universe.\n\t \nThe Antelope Wife (1998), Erdrich's first novel after her divorce from Dorris, was the first of her novels to be set outside the continuity of the previous books.Lorena Laura Stookey, Louise Erdrich: A Critical Companion, Greenwood Publishing Group, 1999 ,  She subsequently returned to the reservation and nearby towns, and has published five novels since 1998 dealing with events in that fictional area. Among these are The Last Report on the Miracles at Little No Horse (2001) and The Master Butchers Singing Club (2003), a macabre mystery that again draws on Erdrich's Native American and German-American heritage. Both novels have geographic and character connections with The Beet Queen.  In 2009, Erdrich's novel The Plague of Doves was named a finalist for the Pulitzer Prize in Fiction. The narrative focuses on the historical lynching of four Native people wrongly accused of murdering a Caucasian family, and the effect of this injustice on the current generations. \n\t \t\nErdrich's complexly interwoven series of novels have drawn comparisons with William Faulkner's Yoknapatawpha novels.  Like Faulkner's, Erdrich's successive novels created multiple narratives in the same fictional area and combined the tapestry of local history with current themes and modern consciousness.See, e.g., Powell's Books (book review), Christian Science Monitor, August 2, 2004\n\nBirchbark Books\n\nThe bookstore hosts literary readings and other events, including the release of each of Erdrich's new works as well as the works and careers of other writers, particularly local Native writers. Erdrich and her staff consider Birchbark Books to be a “teaching bookstore”. In addition to books, the store sells Native art and traditional medicines, and Native American jewelry. A small nonprofit publisher founded by Erdrich and her sister, Wiigwaas Press, is affiliated with the store.\n\nAwards\n\n*1983 Pushcart Prize in Poetry\n*1984 National Book Critics Circle Award for Fiction, for Love Medicine\n*1985 Guggenheim Fellowship in Creative Arts\n*1987 O. Henry Award, for the short story \"Fleur\" (published in Esquire, August 1986)\n*1999 World Fantasy Award, for The Antelope Wife\n*2000 Lifetime Achievement Award from the Native Writers' Circle of the Americas\n*2005 Associate Poet Laureate of North Dakota\n*2006 Scott O'Dell Award for Historical Fiction, for the children's book \"The Game of Silence\"[http://www.scottodell.com/pages/ScottO'DellAwardforHistoricalFiction.aspx]   \n*2007 Honorary Doctorate from the University of North Dakota; refused by Erdrich because of her opposition to the university's North Dakota Fighting Sioux mascot\n*2009 Honorary Doctorate (Doctor of Letters) from Dartmouth College\n*2009 [https://www.kenyonreview.org/programs/kenyon-review-award-for-literary-achievement/louise-erdrich/ Kenyon Review Award for Literary Achievement]\n*2009 Anisfield-Wolf Book Award, for Plague of Doves \n*2012 National Book Award for Fiction for The Round House\n*2013 Rough Rider Award \n*2014 Dayton Literary Peace Prize, Richard C. Holbrooke Distinguished Achievement Award\n*2014 PEN/Saul Bellow Award for Achievement in American Fiction\n*2015 Library of Congress Prize for American Fiction\n*2016 National Book Critics Circle Award for Fiction, for LaRose\n\nWorks\n\nNovels\n\nBirchbark House series\n\n# The Birchbark House (1999)\n# The Game of Silence (2005)\n# The Porcupine Year (2008)\n# Chickadee (2012)\n# Makoons (2016)\n\nLove Medicine Series\n\n# Love Medicine (1984)\n# Tracks (1988)\n# The Bingo Palace (1994)\n# Tales of Burning Love (1997)\n# * The Last Report on the Miracles at Little No Horse (2001)\n# * Four Souls (2004)\n# The Painted Drum (2005)\n\nJustice Trilogy\n\n* The Plague of Doves (Harper, 2008)\n* The Round House (2012)\n* LaRose (2016)\n\nStandalone novels\n\n* The Beet Queen (1986)\n* The Crown of Columbus [coauthored with Michael Dorris] (1991)\n* The Antelope Wife (1998)\n* The Master Butchers Singing Club (2003)\n* Shadow Tag (Harper, 2010)\n* Future Home of the Living God (2017)\n\nStory collections\n\n* The Red Convertible: Collected and New Stories 1978-2008 (2009)\n\nChildren's literature\n\n* Grandmother's Pigeon (1996)\n* The Birchbark House (1999)\n* The Range Eternal (2002)\n* The Game of Silence (2005)\n* The Porcupine Year (2008)\n* Chickadee (2012)\n* Makoons (2016)\n\nPoetry\n\n* Jacklight (1984)\n* Baptism of Desire (1989)\n* Original Fire: Selected and New Poems (2003)\n\nNon-fiction\n\n* Route Two [coauthored with Michael Dorris] (1990)\n* The Blue Jay's Dance: A Birthyear (1995)\n* Books and Islands in Ojibwe Country (2003)\n\nAs editor or contributor\n\n* The Broken Cord by Michael Dorris (Foreword) (1989)\n* The Best American Short Stories 1993 (Editor, with Katrina Kenison) (1993)\n* Ghost Fishing: An Eco-Justice Poetry Anthology (Contributing poet, edited by Melissa Tuckey) (University of Georgia Press, 2018)\n\nInterviews\n\n* Conversations with Louise Erdrich and Michael Dorris, ed.  Allan Chavkin and Nancy Feyl Chavkin (Mississippi UP, 1994)\n* [http://www.theparisreview.org/interviews/6055/the-art-of-fiction-no-208-louise-erdrich Louise Erdrich, The Art of Fiction No. 208] Interview with Louise Erdrich by Lisa Halliday in The Paris Review\n\nEssays\n\n* Two Languages in Mind, But Just One in the Heart (2000). Louise Erdrich. http://en.wikipedia.org/?curid=18057."
  }
}
