{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10883",
  "eid" : "f84376a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778496266,
  "textBody" : "A free-trade area is the region encompassing a trade bloc whose member countries have signed a free-trade agreement (FTA). Such agreements involve cooperation between at least two countries to reduce trade barriers import quotas and tariffs and to increase trade of goods and services with each other.\nIf people are also free to move between the countries, in addition to a free-trade agreement, it would also be considered an open border. It can be considered the second stage of economic integration.\n\nDescription\n\nUnlike a customs union (the third stage of economic integration), members of a free trade area do not have a common external tariff, which means they have different quotas and customs taxes, as well as other policies with respect to non-members. To avoid tariff evasion (through re-exportation) the countries use the system of certification of origin most commonly called rules of origin, where there is a  requirement for the minimum extent of local material inputs and local transformations adding value to the goods. Only goods that meet these minimum requirements are entitled to the special treatment envisioned by the free trade area provisions.\n\n\"Cumulation\" is the relationship between different FTAs regarding the rules of origin sometimes different FTAs supplement each other, in other cases there is no cross-cumulation between the FTAs. A free-trade area is a result of a free-trade agreement (a form of trade pact) between two or more countries. Free-trade areas and agreements (FTAs) are cascadable to some degree if some countries sign agreements to form a free-trade area and choose to negotiate together (either as a trade bloc or as a forum of individual members of their FTA) another free-trade agreement with another country (or countries) then the new FTA will consist of the old FTA plus the new country (or countries).\n\nWithin an industrialized country there are usually few if any significant barriers to the easy exchange of goods and services between parts of that country.  For example, there are usually no trade tariffs or import quotas; there are usually no delays as goods pass from one part of the country to another (other than those that distance imposes); there are usually no differences of taxation and regulation. Between countries, on the other hand, many of these barriers to the easy exchange of goods often do occur.  It is commonplace for there to be import duties of one kind or another (as goods enter a country) and the levels of sales tax and regulation often vary by country.\n\nThe aim of a free-trade area is to reduce barriers to exchange so that trade can grow as a result of specialisation, division of labour, and most importantly via comparative advantage. The theory of comparative advantage argues that in an unrestricted marketplace (in equilibrium) each source of production will tend to specialize in that activity where it has comparative (rather than absolute) advantage. The theory argues that the net result will be an increase in income and ultimately wealth and well-being for everyone in the free-trade area. The theory refers only to aggregate wealth and says nothing about the distribution of wealth; in fact there may be significant losers, in particular among the recently protected industries with a comparative disadvantage. The overall gains from trade can be used to compensate for the effects of reduced trade barriers by appropriate inter-party transfers.\n\nLists of free-trade areas\n\n* List of bilateral free trade agreements\n* List of multilateral free trade agreements\n* Free trade areas in Europe\n\nEvery customs union, trade common market, economic union, customs and monetary union and economic and monetary union also has a free-trade area, but these are each listed in their own articles only.\n\nQualifying for a free-trade agreement\n\n* \"De Minimis\" states that a finished good will not be disqualified from preferential treatment if the non-originating content of that finished good is 7% or less of the transaction value of the good on an FOB basis (or its weight, depending on the type of good). \n* \"Regional Value Content\" is a calculated percentage of the value of the product that represents its North American content \n* \"Tariff Shift\" is a substantial transformation that takes place in a NAFTA country A finished good must qualify under one of these rules to be eligible for free trade under NAFTA. This is just one example of a qualification for a free-trade agreement. If a certificate of origin is present from a supplier demonstrating that the good originated in a country under the associated free trade agreement, no further calculations are needed. When qualifying products for an FTA, the use of an automated system allows importers to stay up-to-date on international compliance regulations, as well as solicit suppliers via the web instead of manually. A functional solution should also perform the required calculations for the associated FTA during the Bill of Material (BOM) analysis, ensuring correct eligibility.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Free-trade area" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10883" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A free-trade area is the region encompassing a trade bloc whose member countries have signed a free-trade agreement (FTA). Such agreements involve cooperation between at least two countries to reduce trade barriers import quotas and tariffs and to increase trade of goods and services with each other.\nIf people are also free to move between the countries, in addition to a free-trade agreement, it would also be considered an open border. It can be considered the second stage of economic integration.\n\nDescription\n\nUnlike a customs union (the third stage of economic integration), members of a free trade area do not have a common external tariff, which means they have different quotas and customs taxes, as well as other policies with respect to non-members. To avoid tariff evasion (through re-exportation) the countries use the system of certification of origin most commonly called rules of origin, where there is a  requirement for the minimum extent of local material inputs and local transformations adding value to the goods. Only goods that meet these minimum requirements are entitled to the special treatment envisioned by the free trade area provisions.\n\n\"Cumulation\" is the relationship between different FTAs regarding the rules of origin sometimes different FTAs supplement each other, in other cases there is no cross-cumulation between the FTAs. A free-trade area is a result of a free-trade agreement (a form of trade pact) between two or more countries. Free-trade areas and agreements (FTAs) are cascadable to some degree if some countries sign agreements to form a free-trade area and choose to negotiate together (either as a trade bloc or as a forum of individual members of their FTA) another free-trade agreement with another country (or countries) then the new FTA will consist of the old FTA plus the new country (or countries).\n\nWithin an industrialized country there are usually few if any significant barriers to the easy exchange of goods and services between parts of that country.  For example, there are usually no trade tariffs or import quotas; there are usually no delays as goods pass from one part of the country to another (other than those that distance imposes); there are usually no differences of taxation and regulation. Between countries, on the other hand, many of these barriers to the easy exchange of goods often do occur.  It is commonplace for there to be import duties of one kind or another (as goods enter a country) and the levels of sales tax and regulation often vary by country.\n\nThe aim of a free-trade area is to reduce barriers to exchange so that trade can grow as a result of specialisation, division of labour, and most importantly via comparative advantage. The theory of comparative advantage argues that in an unrestricted marketplace (in equilibrium) each source of production will tend to specialize in that activity where it has comparative (rather than absolute) advantage. The theory argues that the net result will be an increase in income and ultimately wealth and well-being for everyone in the free-trade area. The theory refers only to aggregate wealth and says nothing about the distribution of wealth; in fact there may be significant losers, in particular among the recently protected industries with a comparative disadvantage. The overall gains from trade can be used to compensate for the effects of reduced trade barriers by appropriate inter-party transfers.\n\nLists of free-trade areas\n\n* List of bilateral free trade agreements\n* List of multilateral free trade agreements\n* Free trade areas in Europe\n\nEvery customs union, trade common market, economic union, customs and monetary union and economic and monetary union also has a free-trade area, but these are each listed in their own articles only.\n\nQualifying for a free-trade agreement\n\n* \"De Minimis\" states that a finished good will not be disqualified from preferential treatment if the non-originating content of that finished good is 7% or less of the transaction value of the good on an FOB basis (or its weight, depending on the type of good). \n* \"Regional Value Content\" is a calculated percentage of the value of the product that represents its North American content \n* \"Tariff Shift\" is a substantial transformation that takes place in a NAFTA country A finished good must qualify under one of these rules to be eligible for free trade under NAFTA. This is just one example of a qualification for a free-trade agreement. If a certificate of origin is present from a supplier demonstrating that the good originated in a country under the associated free trade agreement, no further calculations are needed. When qualifying products for an FTA, the use of an automated system allows importers to stay up-to-date on international compliance regulations, as well as solicit suppliers via the web instead of manually. A functional solution should also perform the required calculations for the associated FTA during the Bill of Material (BOM) analysis, ensuring correct eligibility. Free-trade area. http://en.wikipedia.org/?curid=10883."
  }
}
