{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19048",
  "eid" : "3775e650-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778602293,
  "textBody" : "Mass is both a property of a physical body and a measure of its resistance to acceleration (a change in its state of motion) when a net force is applied.http://dictionary.reference.com/browse/mass It also determines the strength of its mutual gravitational attraction to other bodies.  The basic SI unit of mass is the kilogram (kg).\n\nIn physics, mass is not the same as weight, even though mass is often determined by measuring the object's weight using a spring scale, rather than balance scale comparing it directly with known masses. An object on the Moon would weigh less than it does on Earth because of the lower gravity, but it would still have the same mass. This is because weight is a force, while mass is the property that (along with gravity) determines the strength of this force.\n\nIn Newtonian physics, mass can be generalized as the amount of matter in an object. However, at very high speeds, special relativity states that the kinetic energy of its motion becomes a significant additional source of mass. Thus, any stationary body having mass has an equivalent amount of energy, and all forms of energy resist acceleration by a force and have gravitational attraction. In modern physics, matter is not a fundamental concept because its definition has proven elusive.\n\nThere are several distinct phenomena which can be used to measure mass. Although some theorists have speculated that some of these phenomena could be independent of each other, current experiments have found no difference in results regardless of how it is measured:\n* Inertial mass measures an object's resistance to being accelerated by a force (represented by the relationship ).\n* Active gravitational mass measures the gravitational force exerted by an object.\n* Passive gravitational mass measures the gravitational force exerted on an object in a known gravitational field.\n\nThe mass of an object determines its acceleration in the presence of an applied force. The inertia and the inertial mass describe the same properties of physical bodies at the qualitative and quantitative level respectively, by other words, the mass quantitatively describes the inertia.  According to Newton's second law of motion, if a body of fixed mass m is subjected to a single force F, its acceleration a is given by F/m. A body's mass also determines the degree to which it generates or is affected by a gravitational field. If a first body of mass mA is placed at a distance r (center of mass to center of mass) from a second body of mass mB, each body is subject to an attractive force , where  is the \"universal gravitational constant\". This is sometimes referred to as gravitational mass.When a distinction is necessary, M is used to denote the active gravitational mass and m the passive gravitational mass. Repeated experiments since the 17th century have demonstrated that inertial and gravitational mass are identical; since 1915, this observation has been entailed a priori in the equivalence principle of general relativity.\n\nUnits of mass \n\nThe standard International System of Units (SI) unit of mass is the kilogram (kg). The kilogram is 1000 grams (g), first defined in 1795 as one cubic decimeter of water at the melting point of ice. Then in 1889, the kilogram was redefined as the mass of the international prototype kilogram, and as such is independent of the meter, or the properties of water. However, the mass of the international prototype and its identical national copies have been found to be drifting over time. It is expected that the re-definition of the kilogram and several other units will change on May 20, 2019, following a final vote by the CGPM in November 2018. The new definition will use only invariant quantities of nature: the speed of light, the caesium hyperfine frequency, and the Planck constant.\n\nOther units are accepted for use in SI:\n* the tonne (t) (or \"metric ton\") is equal to 1000 kg.\n* the electronvolt (eV) is a unit of energy, but because of the mass–energy equivalence it can easily be converted to a unit of mass, and is often used like one. In this context, the mass has units of eV/c2 (where c is the speed of light). The electronvolt and its multiples, such as the MeV (megaelectronvolt), are commonly used in particle physics.\n* the atomic mass unit (u) is 1/12 of the mass of a carbon-12 atom, approximately .Since the Avogadro constant NA is defined as the number of atoms in 12 g of carbon-12, it follows that 1 u is exactly 1/(103NA) kg. The atomic mass unit is convenient for expressing the masses of atoms and molecules.\n\nOutside the SI system, other units of mass include:\n* the slug (sl) is an Imperial unit of mass (about 14.6 kg).\n* the pound (lb) is a unit of both mass and force, used mainly in the United States (about 0.45 kg or 4.5 N). In scientific contexts where pound (force) and pound (mass) need to be distinguished, SI units are usually used instead.\n* the Planck mass (mP) is the maximum mass of point particles (about ). It is used in particle physics.\n* the solar mass () is defined as the mass of the Sun. It is primarily used in astronomy to compare large masses such as stars or galaxies (≈).\n* the mass of a very small particle may be identified by its inverse Compton wavelength ().\n* the mass of a very large star or black hole may be identified with its Schwarzschild radius ().\n\nDefinitions of mass \n\nIn physical science, one may distinguish conceptually between at least seven different aspects of mass, or seven physical notions that involve the concept of mass. Every experiment to date has shown these seven values to be proportional, and in some cases equal, and this proportionality gives rise to the abstract concept of mass.  There are a number of ways mass can be measured or operationally defined:\n* Inertial mass is a measure of an object's resistance to acceleration when a force is applied. It is determined by applying a force to an object and measuring the acceleration that results from that force. An object with small inertial mass will accelerate more than an object with large inertial mass when acted upon by the same force. One says the body of greater mass has greater inertia.\n* Active gravitational massThe distinction between \"active\" and \"passive\" gravitational mass does not exist in the Newtonian view of gravity as found in classical mechanics, and can safely be ignored for many purposes. In most practical applications, Newtonian gravity is assumed because it is usually sufficiently accurate, and is simpler than General Relativity; for example, NASA uses primarily Newtonian gravity to design space missions, although \"accuracies are routinely enhanced by accounting for tiny relativistic effects\". The distinction between \"active\" and \"passive\" is very abstract, and applies to post-graduate level applications of General Relativity to certain problems in cosmology, and is otherwise not used. There is, nevertheless, an important conceptual distinction in Newtonian physics between \"inertial mass\" and \"gravitational mass\", although these quantities are identical; the conceptual distinction between these two fundamental definitions of mass is maintained for teaching purposes because they involve two distinct methods of measurement. It was long considered anomalous that the two distinct measurements of mass (inertial and gravitational) gave an identical result. The property, observed by Galileo, that objects of different mass fall with the same rate of acceleration (ignoring air resistance), shows that inertial and gravitational mass are the same. is a measure of the strength of an object's gravitational flux (gravitational flux is equal to the surface integral of gravitational field over an enclosing surface). Gravitational field can be measured by allowing a small \"test object\" to fall freely and measuring its free-fall acceleration. For example, an object in free fall near the Moon is subject to a smaller gravitational field, and hence accelerates more slowly, than the same object would if it were in free fall near the Earth. The gravitational field near the Moon is weaker because the Moon has less active gravitational mass.\n* Passive gravitational mass is a measure of the strength of an object's interaction with a gravitational field. Passive gravitational mass is determined by dividing an object's weight by its free-fall acceleration. Two objects within the same gravitational field will experience the same acceleration; however, the object with a smaller passive gravitational mass will experience a smaller force (less weight) than the object with a larger passive gravitational mass.\n* Energy also has mass according to the principle of mass–energy equivalence. This equivalence is exemplified in a large number of physical processes including pair production, nuclear fusion, and the gravitational bending of light. Pair production and nuclear fusion are processes in which measurable amounts of mass are converted to energy, or vice versa. In the gravitational bending of light, photons of pure energy are shown to exhibit a behavior similar to passive gravitational mass.\n* Curvature of spacetime is a relativistic manifestation of the existence of mass. Such curvature is extremely weak and difficult to measure.  For this reason, curvature was not discovered until after it was predicted by Einstein's theory of general relativity. Extremely precise atomic clocks on the surface of the Earth, for example, are found to measure less time (run slower) when compared to similar clocks in space. This difference in elapsed time is a form of curvature called gravitational time dilation. Other forms of curvature have been measured using the Gravity Probe B satellite.\n* Quantum mass manifests itself as a difference between an object's quantum frequency and its wave number. The quantum mass of an electron, the Compton wavelength, can be determined through various forms of spectroscopy and is closely related to the Rydberg constant, the Bohr radius, and the classical electron radius. The quantum mass of larger objects can be directly measured using a Watt balance. In relativistic quantum mechanics, mass is one of the irreducible representation labels of the Poincaré group.\n\nWeight vs. mass\n\nIn everyday usage, mass and \"weight\" are often used interchangeably. For instance, a person's weight may be stated as 75 kg. In a constant gravitational field, the weight of an object is proportional to its mass, and it is unproblematic to use the same unit for both concepts. But because of slight differences in the strength of the Earth's gravitational field at different places, the distinction becomes important for measurements with a precision better than a few percent, and for places far from the surface of the Earth, such as in space or on other planets. Conceptually, \"mass\" (measured in kilograms) refers to an intrinsic property of an object, whereas \"weight\" (measured in newtons) measures an object's resistance to deviating from its natural course of free fall, which can be influenced by the nearby gravitational field. No matter how strong the gravitational field, objects in free fall are weightless, though they still have mass.\n\nThe force known as \"weight\" is proportional to mass and acceleration in all situations where the mass is accelerated away from free fall. For example, when a body is at rest in a gravitational field (rather than in free fall), it must be accelerated by a force from a scale or the surface of a planetary body such as the Earth or the Moon. This force keeps the object from going into free fall. Weight is the opposing force in such circumstances, and is thus determined by the acceleration of free fall. On the surface of the Earth, for example, an object with a mass of 50 kilograms weighs 491 newtons, which means that 491 newtons is being applied to keep the object from going into free fall. By contrast, on the surface of the Moon, the same object still has a mass of 50 kilograms but weighs only 81.5 newtons, because only 81.5 newtons is required to keep this object from going into a free fall on the moon. Restated in mathematical terms, on the surface of the Earth, the weight W of an object is related to its mass m by , where  is the acceleration due to Earth's gravitational field, (expressed as the acceleration experienced by a free-falling object).\n\nFor other situations, such as when objects are subjected to mechanical accelerations from forces other than the resistance of a planetary surface, the weight force is proportional to the mass of an object multiplied by the total acceleration away from free fall, which is called the proper acceleration. Through such mechanisms, objects in elevators, vehicles, centrifuges, and the like, may experience weight forces many times those caused by resistance to the effects of gravity on objects, resulting from planetary surfaces. In such cases, the generalized equation for weight W of an object is related to its mass m by the equation , where a is the proper acceleration of the object caused by all influences other than gravity. (Again, if gravity is the only influence, such as occurs when an object falls freely, its weight will be zero).\n\nMacroscopically, mass is associated with matter, although matter is not, ultimately, as clearly defined a concept as mass. On the subatomic scale, not only fermions, the particles often associated with matter, but also some bosons, the particles that act as force carriers, have rest mass. Another problem for easy definition is that much of the rest mass of ordinary matter derives from the binding energy (potential energy) holding their quarks together and other forms of energy rather than the sum of the rest masses of the individual particle constituents.  For example, only 1% of the rest mass of matter is accounted for by the rest mass of its elementary quarks and electrons. From a fundamental physics perspective, mass is the number describing under which the representation of the little group of the Poincaré group a particle transforms. In the Standard Model of particle physics, this symmetry is described as arising as a consequence of a coupling of particles with rest mass to a postulated additional field, known as the Higgs field.\n\nThe total mass of the observable universe is estimated at 1053 kg, corresponding to the rest mass of between 1079 and 1080 protons.\n\nInertial vs. gravitational mass\n\nAlthough inertial mass, passive gravitational mass and active gravitational mass are conceptually distinct, no experiment has ever unambiguously demonstrated any difference between them. In classical mechanics, Newton's third law implies that active and passive gravitational mass must always be identical (or at least proportional), but the classical theory offers no compelling reason why the gravitational mass has to equal the inertial mass. That it does is merely an empirical fact.\n\nAlbert Einstein developed his general theory of relativity starting with the assumption of the intentionality of correspondence between inertial and passive gravitational mass, and that no experiment will ever detect a difference between them, in essence the equivalence principle. \n\nThis particular equivalence often referred to as the \"Galilean equivalence principle\" or the \"weak equivalence principle\" has the most important consequence for freely falling objects. Suppose an object with inertial and gravitational masses m and M, respectively. If the only force acting on the object comes from a gravitational field g, combining Newton's second law and the gravitational law yields the acceleration\n\na=\\frac{M}{m}g.\n\nThis says that the ratio of gravitational to inertial mass of any object is equal to some constant K if and only if all objects fall at the same rate in a given gravitational field. This phenomenon is referred to as the \"universality of free-fall\". In addition, the constant K can be taken as 1 by defining our units appropriately.\n\nThe first experiments demonstrating the universality of free-fall were conducted by Galileo obtained by dropping objects from the Leaning Tower of Pisa, but this is most likely apocryphal; actually, he performed his experiments with balls rolling down nearly frictionless inclined planes to slow the motion and increase the timing accuracy. Increasingly precise experiments have been performed, such as those performed by Loránd Eötvös,\n using the torsion balance pendulum, in 1889. , no deviation from universality, and thus from Galilean equivalence, has ever been found, at least to the precision 10−12. More precise experimental efforts are still being carried out.\n\nThe universality of free-fall only applies to systems in which gravity is the only acting force. All other forces, especially friction and air resistance, must be absent or at least negligible. For example, if a hammer and a feather are dropped from the same height through the air on Earth, the feather will take much longer to reach the ground; the feather is not really in free-fall because the force of air resistance upwards against the feather is comparable to the downward force of gravity. On the other hand, if the experiment is performed in a vacuum, in which there is no air resistance, the hammer and the feather should hit the ground at exactly the same time (assuming the acceleration of both objects towards each other, and of the ground towards both objects, for its own part, is negligible). This can easily be done in a high school laboratory by dropping the objects in transparent tubes that have the air removed with a vacuum pump. It is even more dramatic when done in an environment that naturally has a vacuum, as David Scott did on the surface of the Moon during Apollo 15.\n\nA stronger version of the equivalence principle, known as the Einstein equivalence principle or the strong equivalence principle, lies at the heart of the general theory of relativity. Einstein's equivalence principle states that within sufficiently small regions of space-time, it is impossible to distinguish between a uniform acceleration and a uniform gravitational field. Thus, the theory postulates that the force acting on a massive object caused by a gravitational field is a result of the object's tendency to move in a straight line (in other words its inertia) and should therefore be a function of its inertial mass and the strength of the gravitational field.\n\nOrigin of mass\n\nIn theoretical physics, a mass generation mechanism is a theory which attempts to explain the origin of mass from the most fundamental laws of physics. To date, a number of different models have been proposed which advocate different views of the origin of mass. The problem is complicated by the fact that the notion of mass is strongly related to the gravitational interaction but a theory of the latter has not been yet reconciled with the currently popular model of particle physics, known as the Standard Model.\n\nPre-Newtonian concepts \n\nWeight as an amount\n\nThe concept of amount is very old and predates recorded history.  Humans, at some early era, realized that the weight of a collection of similar objects was directly proportional to the number of objects in the collection:\n\nW_n \\propto n,\n\nwhere W is the weight of the collection of similar objects and n is the number of objects in the collection. Proportionality, by definition, implies that two values have a constant ratio:\n\n\\frac{W_n}{n} \\frac{W_m}{m}, or equivalently \\frac{W_n}{W_m} \n \\frac{n}{m}.\n\nAn early use of this relationship is a balance scale, which balances the force of one object's weight against the force of another object's weight. The two sides of a balance scale are close enough that the objects experience similar gravitational fields.  Hence, if they have similar masses then their weights will also be similar.  This allows the scale, by comparing weights, to also compare masses.\n\nConsequently, historical weight standards were often defined in terms of amounts.  The Romans, for example, used the carob seed (carat or siliqua) as a measurement standard.  If an object's weight was equivalent to [http://std.dkuug.dk/JTC1/SC2/WG2/docs/n3138.pdf 1728 carob seeds], then the object was said to weigh one Roman pound.  If, on the other hand, the object's weight was equivalent to 144 carob seeds then the object was said to weigh one Roman ounce (uncia).  The Roman pound and ounce were both defined in terms of different sized collections of the same common mass standard, the carob seed.  The ratio of a Roman ounce (144 carob seeds) to a Roman pound (1728 carob seeds) was:\n\n\\frac{\\mathrm{ounce}}{\\mathrm{pound}} \\frac{W_{144}}{W_{1728}} \n \\frac{144}{1728} = \\frac{1}{12}.\n\nPlanetary motion\n\nIn 1600 AD, Johannes Kepler sought employment with Tycho Brahe, who had some of the most precise astronomical data available.  Using Brahe's precise observations of the planet Mars, Kepler spent the next five years developing his own method for characterizing planetary motion. In 1609, Johannes Kepler published his three laws of planetary motion, explaining how the planets orbit the Sun. In Kepler's final planetary model, he described planetary orbits as following elliptical paths with the Sun at a focal point of the ellipse. Kepler discovered that the square of the orbital period of each planet is directly proportional to the cube of the semi-major axis of its orbit, or equivalently, that the ratio of these two values is constant for all planets in the Solar System.This constant ratio was later shown to be a direct measure of the Sun's active gravitational mass; it has units of distance cubed per time squared, and is known as the standard gravitational parameter:\n\n\\mu=4\\pi^2\\frac{\\text{distance}^3}{\\text{time}^2}\\propto\\text{gravitational mass}\n\nOn 25 August 1609, Galileo Galilei demonstrated his first telescope to a group of Venetian merchants, and in early January 1610, Galileo observed four dim objects near Jupiter, which he mistook for stars.  However, after a few days of observation, Galileo realized that these \"stars\" were in fact orbiting Jupiter.  These four objects (later named the Galilean moons in honor of their discoverer) were the first celestial bodies observed to orbit something other than the Earth or Sun.  Galileo continued to observe these moons over the next eighteen months, and by the middle of 1611 he had obtained remarkably accurate estimates for their periods.\n\nGalilean free fall\n\nSometime prior to 1638, Galileo turned his attention to the phenomenon of objects in free fall, attempting to characterize these motions. Galileo was not the first to investigate Earth's gravitational field, nor was he the first to accurately describe its fundamental characteristics.  However, Galileo's reliance on scientific experimentation to establish physical principles would have a profound effect on future generations of scientists. It is unclear if these were just hypothetical experiments used to illustrate a concept, or if they were real experiments performed by Galileo, but the results obtained from these experiments were both realistic and compelling.  A biography by Galileo's pupil Vincenzo Viviani stated that Galileo had dropped balls of the same material, but different masses, from the Leaning Tower of Pisa to demonstrate that their time of descent was independent of their mass.At the time when Viviani asserts that the experiment took place, Galileo had not yet formulated the final version of his law of free fall. He had, however, formulated an earlier version which predicted that bodies of the same material falling through the same medium would fall at the same speed. See  In support of this conclusion, Galileo had advanced the following theoretical argument: He asked if two bodies of different masses and different rates of fall are tied by a string, does the combined system fall faster because it is now more massive, or does the lighter body in its slower fall hold back the heavier body?  The only convincing resolution to this question is that all bodies must fall at the same rate.\n\nA later experiment was described in Galileo's Two New Sciences published in 1638.  One of Galileo's fictional characters, Salviati, describes an experiment using a bronze ball and a wooden ramp.  The wooden ramp was \"12 cubits long, half a cubit wide and three finger-breadths thick\" with a straight, smooth, polished groove.  The groove was lined with \"parchment, also smooth and polished as possible\".  And into this groove was placed \"a hard, smooth and very round bronze ball\".  The ramp was inclined at various angles to slow the acceleration enough so that the elapsed time could be measured.  The ball was allowed to roll a known distance down the ramp, and the time taken for the ball to move the known distance was measured.  The time was measured using a water clock described as follows:\n\"a large vessel of water placed in an elevated position; to the bottom of this vessel was soldered a pipe of small diameter giving a thin jet of water, which we collected in a small glass during the time of each descent, whether for the whole length of the channel or for a part of its length; the water thus collected was weighed, after each descent, on a very accurate balance; the differences and ratios of these weights gave us the differences and ratios of the times, and this with such accuracy that although the operation was repeated many, many times, there was no appreciable discrepancy in the results.\", translated in  and also available in \n\nGalileo found that for an object in free fall, the distance that the object has fallen is always proportional to the square of the elapsed time:\n\n{\\text{Distance}} \\propto {\\text{Time}^2}\n\nGalileo had shown that objects in free fall under the influence of the Earth’s gravitational field have a constant acceleration, and Galileo’s contemporary, Johannes Kepler, had shown that the planets follow elliptical paths under the influence of the Sun’s gravitational mass.  However, Galileo’s free fall motions and Kepler’s planetary motions remained distinct during Galileo’s lifetime.\n\nNewtonian mass \n\nRobert Hooke had published his concept of gravitational forces in 1674, stating that all celestial bodies have an attraction or gravitating power towards their own centers, and also attract all the other celestial bodies that are within the sphere of their activity. He further stated that gravitational attraction increases by how much nearer the body wrought upon is to their own center. In correspondence with Isaac Newton from 1679 and 1680, Hooke conjectured that gravitational forces might decrease according to the double of the distance between the two bodies. Hooke urged Newton, who was a pioneer in the development of calculus, to work through the mathematical details of Keplerian orbits to determine if Hooke's hypothesis was correct.  Newton's own investigations verified that Hooke was correct, but due to personal differences between the two men, Newton chose not to reveal this to Hooke.  Isaac Newton kept quiet about his discoveries until 1684, at which time he told a friend, Edmond Halley, that he had solved the problem of gravitational orbits, but had misplaced the solution in his office. After being encouraged by Halley, Newton decided to develop his ideas about gravity and publish all of his findings.  In November 1684, Isaac Newton sent a document to Edmund Halley, now lost but presumed to have been titled De motu corporum in gyrum (Latin for \"On the motion of bodies in an orbit\").\n Halley presented Newton's findings to the Royal Society of London, with a promise that a fuller presentation would follow.  Newton later recorded his ideas in a three book set, entitled Philosophiæ Naturalis Principia Mathematica (Latin: \"Mathematical Principles of Natural Philosophy\").  The first was received by the Royal Society on 28 April 1685–6; the second on 2 March 1686–7; and the third on 6 April 1686–7.  The Royal Society published Newton’s entire collection at their own expense in May 1686–7.\n\nIsaac Newton had bridged the gap between Kepler’s gravitational mass and Galileo’s gravitational acceleration, resulting in the discovery of the following relationship which governed both of these:\n\n\\mathbf{g}=-\\mu\\frac{\\hat{\\mathbf{R}}}",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Mass" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19048" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Mass is both a property of a physical body and a measure of its resistance to acceleration (a change in its state of motion) when a net force is applied.http://dictionary.reference.com/browse/mass It also determines the strength of its mutual gravitational attraction to other bodies.  The basic SI unit of mass is the kilogram (kg).\n\nIn physics, mass is not the same as weight, even though mass is often determined by measuring the object's weight using a spring scale, rather than balance scale comparing it directly with known masses. An object on the Moon would weigh less than it does on Earth because of the lower gravity, but it would still have the same mass. This is because weight is a force, while mass is the property that (along with gravity) determines the strength of this force.\n\nIn Newtonian physics, mass can be generalized as the amount of matter in an object. However, at very high speeds, special relativity states that the kinetic energy of its motion becomes a significant additional source of mass. Thus, any stationary body having mass has an equivalent amount of energy, and all forms of energy resist acceleration by a force and have gravitational attraction. In modern physics, matter is not a fundamental concept because its definition has proven elusive.\n\nThere are several distinct phenomena which can be used to measure mass. Although some theorists have speculated that some of these phenomena could be independent of each other, current experiments have found no difference in results regardless of how it is measured:\n* Inertial mass measures an object's resistance to being accelerated by a force (represented by the relationship ).\n* Active gravitational mass measures the gravitational force exerted by an object.\n* Passive gravitational mass measures the gravitational force exerted on an object in a known gravitational field.\n\nThe mass of an object determines its acceleration in the presence of an applied force. The inertia and the inertial mass describe the same properties of physical bodies at the qualitative and quantitative level respectively, by other words, the mass quantitatively describes the inertia.  According to Newton's second law of motion, if a body of fixed mass m is subjected to a single force F, its acceleration a is given by F/m. A body's mass also determines the degree to which it generates or is affected by a gravitational field. If a first body of mass mA is placed at a distance r (center of mass to center of mass) from a second body of mass mB, each body is subject to an attractive force , where  is the \"universal gravitational constant\". This is sometimes referred to as gravitational mass.When a distinction is necessary, M is used to denote the active gravitational mass and m the passive gravitational mass. Repeated experiments since the 17th century have demonstrated that inertial and gravitational mass are identical; since 1915, this observation has been entailed a priori in the equivalence principle of general relativity.\n\nUnits of mass \n\nThe standard International System of Units (SI) unit of mass is the kilogram (kg). The kilogram is 1000 grams (g), first defined in 1795 as one cubic decimeter of water at the melting point of ice. Then in 1889, the kilogram was redefined as the mass of the international prototype kilogram, and as such is independent of the meter, or the properties of water. However, the mass of the international prototype and its identical national copies have been found to be drifting over time. It is expected that the re-definition of the kilogram and several other units will change on May 20, 2019, following a final vote by the CGPM in November 2018. The new definition will use only invariant quantities of nature: the speed of light, the caesium hyperfine frequency, and the Planck constant.\n\nOther units are accepted for use in SI:\n* the tonne (t) (or \"metric ton\") is equal to 1000 kg.\n* the electronvolt (eV) is a unit of energy, but because of the mass–energy equivalence it can easily be converted to a unit of mass, and is often used like one. In this context, the mass has units of eV/c2 (where c is the speed of light). The electronvolt and its multiples, such as the MeV (megaelectronvolt), are commonly used in particle physics.\n* the atomic mass unit (u) is 1/12 of the mass of a carbon-12 atom, approximately .Since the Avogadro constant NA is defined as the number of atoms in 12 g of carbon-12, it follows that 1 u is exactly 1/(103NA) kg. The atomic mass unit is convenient for expressing the masses of atoms and molecules.\n\nOutside the SI system, other units of mass include:\n* the slug (sl) is an Imperial unit of mass (about 14.6 kg).\n* the pound (lb) is a unit of both mass and force, used mainly in the United States (about 0.45 kg or 4.5 N). In scientific contexts where pound (force) and pound (mass) need to be distinguished, SI units are usually used instead.\n* the Planck mass (mP) is the maximum mass of point particles (about ). It is used in particle physics.\n* the solar mass () is defined as the mass of the Sun. It is primarily used in astronomy to compare large masses such as stars or galaxies (≈).\n* the mass of a very small particle may be identified by its inverse Compton wavelength ().\n* the mass of a very large star or black hole may be identified with its Schwarzschild radius ().\n\nDefinitions of mass \n\nIn physical science, one may distinguish conceptually between at least seven different aspects of mass, or seven physical notions that involve the concept of mass. Every experiment to date has shown these seven values to be proportional, and in some cases equal, and this proportionality gives rise to the abstract concept of mass.  There are a number of ways mass can be measured or operationally defined:\n* Inertial mass is a measure of an object's resistance to acceleration when a force is applied. It is determined by applying a force to an object and measuring the acceleration that results from that force. An object with small inertial mass will accelerate more than an object with large inertial mass when acted upon by the same force. One says the body of greater mass has greater inertia.\n* Active gravitational massThe distinction between \"active\" and \"passive\" gravitational mass does not exist in the Newtonian view of gravity as found in classical mechanics, and can safely be ignored for many purposes. In most practical applications, Newtonian gravity is assumed because it is usually sufficiently accurate, and is simpler than General Relativity; for example, NASA uses primarily Newtonian gravity to design space missions, although \"accuracies are routinely enhanced by accounting for tiny relativistic effects\". The distinction between \"active\" and \"passive\" is very abstract, and applies to post-graduate level applications of General Relativity to certain problems in cosmology, and is otherwise not used. There is, nevertheless, an important conceptual distinction in Newtonian physics between \"inertial mass\" and \"gravitational mass\", although these quantities are identical; the conceptual distinction between these two fundamental definitions of mass is maintained for teaching purposes because they involve two distinct methods of measurement. It was long considered anomalous that the two distinct measurements of mass (inertial and gravitational) gave an identical result. The property, observed by Galileo, that objects of different mass fall with the same rate of acceleration (ignoring air resistance), shows that inertial and gravitational mass are the same. is a measure of the strength of an object's gravitational flux (gravitational flux is equal to the surface integral of gravitational field over an enclosing surface). Gravitational field can be measured by allowing a small \"test object\" to fall freely and measuring its free-fall acceleration. For example, an object in free fall near the Moon is subject to a smaller gravitational field, and hence accelerates more slowly, than the same object would if it were in free fall near the Earth. The gravitational field near the Moon is weaker because the Moon has less active gravitational mass.\n* Passive gravitational mass is a measure of the strength of an object's interaction with a gravitational field. Passive gravitational mass is determined by dividing an object's weight by its free-fall acceleration. Two objects within the same gravitational field will experience the same acceleration; however, the object with a smaller passive gravitational mass will experience a smaller force (less weight) than the object with a larger passive gravitational mass.\n* Energy also has mass according to the principle of mass–energy equivalence. This equivalence is exemplified in a large number of physical processes including pair production, nuclear fusion, and the gravitational bending of light. Pair production and nuclear fusion are processes in which measurable amounts of mass are converted to energy, or vice versa. In the gravitational bending of light, photons of pure energy are shown to exhibit a behavior similar to passive gravitational mass.\n* Curvature of spacetime is a relativistic manifestation of the existence of mass. Such curvature is extremely weak and difficult to measure.  For this reason, curvature was not discovered until after it was predicted by Einstein's theory of general relativity. Extremely precise atomic clocks on the surface of the Earth, for example, are found to measure less time (run slower) when compared to similar clocks in space. This difference in elapsed time is a form of curvature called gravitational time dilation. Other forms of curvature have been measured using the Gravity Probe B satellite.\n* Quantum mass manifests itself as a difference between an object's quantum frequency and its wave number. The quantum mass of an electron, the Compton wavelength, can be determined through various forms of spectroscopy and is closely related to the Rydberg constant, the Bohr radius, and the classical electron radius. The quantum mass of larger objects can be directly measured using a Watt balance. In relativistic quantum mechanics, mass is one of the irreducible representation labels of the Poincaré group.\n\nWeight vs. mass\n\nIn everyday usage, mass and \"weight\" are often used interchangeably. For instance, a person's weight may be stated as 75 kg. In a constant gravitational field, the weight of an object is proportional to its mass, and it is unproblematic to use the same unit for both concepts. But because of slight differences in the strength of the Earth's gravitational field at different places, the distinction becomes important for measurements with a precision better than a few percent, and for places far from the surface of the Earth, such as in space or on other planets. Conceptually, \"mass\" (measured in kilograms) refers to an intrinsic property of an object, whereas \"weight\" (measured in newtons) measures an object's resistance to deviating from its natural course of free fall, which can be influenced by the nearby gravitational field. No matter how strong the gravitational field, objects in free fall are weightless, though they still have mass.\n\nThe force known as \"weight\" is proportional to mass and acceleration in all situations where the mass is accelerated away from free fall. For example, when a body is at rest in a gravitational field (rather than in free fall), it must be accelerated by a force from a scale or the surface of a planetary body such as the Earth or the Moon. This force keeps the object from going into free fall. Weight is the opposing force in such circumstances, and is thus determined by the acceleration of free fall. On the surface of the Earth, for example, an object with a mass of 50 kilograms weighs 491 newtons, which means that 491 newtons is being applied to keep the object from going into free fall. By contrast, on the surface of the Moon, the same object still has a mass of 50 kilograms but weighs only 81.5 newtons, because only 81.5 newtons is required to keep this object from going into a free fall on the moon. Restated in mathematical terms, on the surface of the Earth, the weight W of an object is related to its mass m by , where  is the acceleration due to Earth's gravitational field, (expressed as the acceleration experienced by a free-falling object).\n\nFor other situations, such as when objects are subjected to mechanical accelerations from forces other than the resistance of a planetary surface, the weight force is proportional to the mass of an object multiplied by the total acceleration away from free fall, which is called the proper acceleration. Through such mechanisms, objects in elevators, vehicles, centrifuges, and the like, may experience weight forces many times those caused by resistance to the effects of gravity on objects, resulting from planetary surfaces. In such cases, the generalized equation for weight W of an object is related to its mass m by the equation , where a is the proper acceleration of the object caused by all influences other than gravity. (Again, if gravity is the only influence, such as occurs when an object falls freely, its weight will be zero).\n\nMacroscopically, mass is associated with matter, although matter is not, ultimately, as clearly defined a concept as mass. On the subatomic scale, not only fermions, the particles often associated with matter, but also some bosons, the particles that act as force carriers, have rest mass. Another problem for easy definition is that much of the rest mass of ordinary matter derives from the binding energy (potential energy) holding their quarks together and other forms of energy rather than the sum of the rest masses of the individual particle constituents.  For example, only 1% of the rest mass of matter is accounted for by the rest mass of its elementary quarks and electrons. From a fundamental physics perspective, mass is the number describing under which the representation of the little group of the Poincaré group a particle transforms. In the Standard Model of particle physics, this symmetry is described as arising as a consequence of a coupling of particles with rest mass to a postulated additional field, known as the Higgs field.\n\nThe total mass of the observable universe is estimated at 1053 kg, corresponding to the rest mass of between 1079 and 1080 protons.\n\nInertial vs. gravitational mass\n\nAlthough inertial mass, passive gravitational mass and active gravitational mass are conceptually distinct, no experiment has ever unambiguously demonstrated any difference between them. In classical mechanics, Newton's third law implies that active and passive gravitational mass must always be identical (or at least proportional), but the classical theory offers no compelling reason why the gravitational mass has to equal the inertial mass. That it does is merely an empirical fact.\n\nAlbert Einstein developed his general theory of relativity starting with the assumption of the intentionality of correspondence between inertial and passive gravitational mass, and that no experiment will ever detect a difference between them, in essence the equivalence principle. \n\nThis particular equivalence often referred to as the \"Galilean equivalence principle\" or the \"weak equivalence principle\" has the most important consequence for freely falling objects. Suppose an object with inertial and gravitational masses m and M, respectively. If the only force acting on the object comes from a gravitational field g, combining Newton's second law and the gravitational law yields the acceleration\n\na=\\frac{M}{m}g.\n\nThis says that the ratio of gravitational to inertial mass of any object is equal to some constant K if and only if all objects fall at the same rate in a given gravitational field. This phenomenon is referred to as the \"universality of free-fall\". In addition, the constant K can be taken as 1 by defining our units appropriately.\n\nThe first experiments demonstrating the universality of free-fall were conducted by Galileo obtained by dropping objects from the Leaning Tower of Pisa, but this is most likely apocryphal; actually, he performed his experiments with balls rolling down nearly frictionless inclined planes to slow the motion and increase the timing accuracy. Increasingly precise experiments have been performed, such as those performed by Loránd Eötvös,\n using the torsion balance pendulum, in 1889. , no deviation from universality, and thus from Galilean equivalence, has ever been found, at least to the precision 10−12. More precise experimental efforts are still being carried out.\n\nThe universality of free-fall only applies to systems in which gravity is the only acting force. All other forces, especially friction and air resistance, must be absent or at least negligible. For example, if a hammer and a feather are dropped from the same height through the air on Earth, the feather will take much longer to reach the ground; the feather is not really in free-fall because the force of air resistance upwards against the feather is comparable to the downward force of gravity. On the other hand, if the experiment is performed in a vacuum, in which there is no air resistance, the hammer and the feather should hit the ground at exactly the same time (assuming the acceleration of both objects towards each other, and of the ground towards both objects, for its own part, is negligible). This can easily be done in a high school laboratory by dropping the objects in transparent tubes that have the air removed with a vacuum pump. It is even more dramatic when done in an environment that naturally has a vacuum, as David Scott did on the surface of the Moon during Apollo 15.\n\nA stronger version of the equivalence principle, known as the Einstein equivalence principle or the strong equivalence principle, lies at the heart of the general theory of relativity. Einstein's equivalence principle states that within sufficiently small regions of space-time, it is impossible to distinguish between a uniform acceleration and a uniform gravitational field. Thus, the theory postulates that the force acting on a massive object caused by a gravitational field is a result of the object's tendency to move in a straight line (in other words its inertia) and should therefore be a function of its inertial mass and the strength of the gravitational field.\n\nOrigin of mass\n\nIn theoretical physics, a mass generation mechanism is a theory which attempts to explain the origin of mass from the most fundamental laws of physics. To date, a number of different models have been proposed which advocate different views of the origin of mass. The problem is complicated by the fact that the notion of mass is strongly related to the gravitational interaction but a theory of the latter has not been yet reconciled with the currently popular model of particle physics, known as the Standard Model.\n\nPre-Newtonian concepts \n\nWeight as an amount\n\nThe concept of amount is very old and predates recorded history.  Humans, at some early era, realized that the weight of a collection of similar objects was directly proportional to the number of objects in the collection:\n\nW_n \\propto n,\n\nwhere W is the weight of the collection of similar objects and n is the number of objects in the collection. Proportionality, by definition, implies that two values have a constant ratio:\n\n\\frac{W_n}{n} \\frac{W_m}{m}, or equivalently \\frac{W_n}{W_m} \n \\frac{n}{m}.\n\nAn early use of this relationship is a balance scale, which balances the force of one object's weight against the force of another object's weight. The two sides of a balance scale are close enough that the objects experience similar gravitational fields.  Hence, if they have similar masses then their weights will also be similar.  This allows the scale, by comparing weights, to also compare masses.\n\nConsequently, historical weight standards were often defined in terms of amounts.  The Romans, for example, used the carob seed (carat or siliqua) as a measurement standard.  If an object's weight was equivalent to [http://std.dkuug.dk/JTC1/SC2/WG2/docs/n3138.pdf 1728 carob seeds], then the object was said to weigh one Roman pound.  If, on the other hand, the object's weight was equivalent to 144 carob seeds then the object was said to weigh one Roman ounce (uncia).  The Roman pound and ounce were both defined in terms of different sized collections of the same common mass standard, the carob seed.  The ratio of a Roman ounce (144 carob seeds) to a Roman pound (1728 carob seeds) was:\n\n\\frac{\\mathrm{ounce}}{\\mathrm{pound}} \\frac{W_{144}}{W_{1728}} \n \\frac{144}{1728} = \\frac{1}{12}.\n\nPlanetary motion\n\nIn 1600 AD, Johannes Kepler sought employment with Tycho Brahe, who had some of the most precise astronomical data available.  Using Brahe's precise observations of the planet Mars, Kepler spent the next five years developing his own method for characterizing planetary motion. In 1609, Johannes Kepler published his three laws of planetary motion, explaining how the planets orbit the Sun. In Kepler's final planetary model, he described planetary orbits as following elliptical paths with the Sun at a focal point of the ellipse. Kepler discovered that the square of the orbital period of each planet is directly proportional to the cube of the semi-major axis of its orbit, or equivalently, that the ratio of these two values is constant for all planets in the Solar System.This constant ratio was later shown to be a direct measure of the Sun's active gravitational mass; it has units of distance cubed per time squared, and is known as the standard gravitational parameter:\n\n\\mu=4\\pi^2\\frac{\\text{distance}^3}{\\text{time}^2}\\propto\\text{gravitational mass}\n\nOn 25 August 1609, Galileo Galilei demonstrated his first telescope to a group of Venetian merchants, and in early January 1610, Galileo observed four dim objects near Jupiter, which he mistook for stars.  However, after a few days of observation, Galileo realized that these \"stars\" were in fact orbiting Jupiter.  These four objects (later named the Galilean moons in honor of their discoverer) were the first celestial bodies observed to orbit something other than the Earth or Sun.  Galileo continued to observe these moons over the next eighteen months, and by the middle of 1611 he had obtained remarkably accurate estimates for their periods.\n\nGalilean free fall\n\nSometime prior to 1638, Galileo turned his attention to the phenomenon of objects in free fall, attempting to characterize these motions. Galileo was not the first to investigate Earth's gravitational field, nor was he the first to accurately describe its fundamental characteristics.  However, Galileo's reliance on scientific experimentation to establish physical principles would have a profound effect on future generations of scientists. It is unclear if these were just hypothetical experiments used to illustrate a concept, or if they were real experiments performed by Galileo, but the results obtained from these experiments were both realistic and compelling.  A biography by Galileo's pupil Vincenzo Viviani stated that Galileo had dropped balls of the same material, but different masses, from the Leaning Tower of Pisa to demonstrate that their time of descent was independent of their mass.At the time when Viviani asserts that the experiment took place, Galileo had not yet formulated the final version of his law of free fall. He had, however, formulated an earlier version which predicted that bodies of the same material falling through the same medium would fall at the same speed. See  In support of this conclusion, Galileo had advanced the following theoretical argument: He asked if two bodies of different masses and different rates of fall are tied by a string, does the combined system fall faster because it is now more massive, or does the lighter body in its slower fall hold back the heavier body?  The only convincing resolution to this question is that all bodies must fall at the same rate.\n\nA later experiment was described in Galileo's Two New Sciences published in 1638.  One of Galileo's fictional characters, Salviati, describes an experiment using a bronze ball and a wooden ramp.  The wooden ramp was \"12 cubits long, half a cubit wide and three finger-breadths thick\" with a straight, smooth, polished groove.  The groove was lined with \"parchment, also smooth and polished as possible\".  And into this groove was placed \"a hard, smooth and very round bronze ball\".  The ramp was inclined at various angles to slow the acceleration enough so that the elapsed time could be measured.  The ball was allowed to roll a known distance down the ramp, and the time taken for the ball to move the known distance was measured.  The time was measured using a water clock described as follows:\n\"a large vessel of water placed in an elevated position; to the bottom of this vessel was soldered a pipe of small diameter giving a thin jet of water, which we collected in a small glass during the time of each descent, whether for the whole length of the channel or for a part of its length; the water thus collected was weighed, after each descent, on a very accurate balance; the differences and ratios of these weights gave us the differences and ratios of the times, and this with such accuracy that although the operation was repeated many, many times, there was no appreciable discrepancy in the results.\", translated in  and also available in \n\nGalileo found that for an object in free fall, the distance that the object has fallen is always proportional to the square of the elapsed time:\n\n{\\text{Distance}} \\propto {\\text{Time}^2}\n\nGalileo had shown that objects in free fall under the influence of the Earth’s gravitational field have a constant acceleration, and Galileo’s contemporary, Johannes Kepler, had shown that the planets follow elliptical paths under the influence of the Sun’s gravitational mass.  However, Galileo’s free fall motions and Kepler’s planetary motions remained distinct during Galileo’s lifetime.\n\nNewtonian mass \n\nRobert Hooke had published his concept of gravitational forces in 1674, stating that all celestial bodies have an attraction or gravitating power towards their own centers, and also attract all the other celestial bodies that are within the sphere of their activity. He further stated that gravitational attraction increases by how much nearer the body wrought upon is to their own center. In correspondence with Isaac Newton from 1679 and 1680, Hooke conjectured that gravitational forces might decrease according to the double of the distance between the two bodies. Hooke urged Newton, who was a pioneer in the development of calculus, to work through the mathematical details of Keplerian orbits to determine if Hooke's hypothesis was correct.  Newton's own investigations verified that Hooke was correct, but due to personal differences between the two men, Newton chose not to reveal this to Hooke.  Isaac Newton kept quiet about his discoveries until 1684, at which time he told a friend, Edmond Halley, that he had solved the problem of gravitational orbits, but had misplaced the solution in his office. After being encouraged by Halley, Newton decided to develop his ideas about gravity and publish all of his findings.  In November 1684, Isaac Newton sent a document to Edmund Halley, now lost but presumed to have been titled De motu corporum in gyrum (Latin for \"On the motion of bodies in an orbit\").\n Halley presented Newton's findings to the Royal Society of London, with a promise that a fuller presentation would follow.  Newton later recorded his ideas in a three book set, entitled Philosophiæ Naturalis Principia Mathematica (Latin: \"Mathematical Principles of Natural Philosophy\").  The first was received by the Royal Society on 28 April 1685–6; the second on 2 March 1686–7; and the third on 6 April 1686–7.  The Royal Society published Newton’s entire collection at their own expense in May 1686–7.\n\nIsaac Newton had bridged the gap between Kepler’s gravitational mass and Galileo’s gravitational acceleration, resulting in the discovery of the following relationship which governed both of these:\n\n\\mathbf{g}=-\\mu\\frac{\\hat{\\mathbf{R}}}. Mass. http://en.wikipedia.org/?curid=19048."
  }
}
