{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18508",
  "eid" : "3342eb00-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778595248,
  "textBody" : "The Lightweight Directory Access Protocol  (LDAP;) is an open, vendor-neutral, industry standard application protocol for accessing and maintaining distributed directory information services over an Internet Protocol (IP) network.  Directory services play an important role in developing intranet and Internet applications by allowing the sharing of information about users, systems, networks, services, and applications throughout the network.  As examples, directory services may provide any organized set of records, often with a hierarchical structure, such as a corporate email directory.  Similarly, a telephone directory is a list of subscribers with an address and a phone number.\n\nLDAP is specified in a series of Internet Engineering Task Force (IETF) Standard Track publications called Request for Comments (RFCs), using the description language ASN.1. The latest specification is Version 3, published as RFC 4511.[http://www.gracion.com/server/whatldap.html What is LDAP?]. Gracion.com. Retrieved on 2013-07-17.\n\nA common use of LDAP is to provide a central place to store usernames and passwords. This allows many different applications and services to connect to the LDAP server to validate users.\n\nLDAP is based on a simpler subset of the standards contained within the X.500 standard.  Because of this relationship, LDAP is sometimes called X.500-lite.\n\nHistory\n\nTelecommunication companies' understanding of directory requirements were well developed after some 70 years of producing and managing telephone directories. These companies introduced the concept of directory services to information technology and computer networking, their input culminating in the comprehensive X.500 specification,The X.500 series - ITU-T Rec. X.500 to X.521 a suite of protocols produced by the International Telecommunication Union (ITU) in the 1980s.\n\nX.500 directory services were traditionally accessed via the X.500 Directory Access Protocol (DAP), which required the Open Systems Interconnection (OSI) protocol stack. LDAP was originally intended to be a lightweight alternative protocol for accessing X.500 directory services through the simpler (and now widespread) TCP/IP protocol stack.  This model of directory access was borrowed from the DIXIE and Directory Assistance Service protocols.\n\nThe protocol was originally created by Tim Howes of the University of Michigan, Steve Kille of Isode Limited, Colin Robbins of Nexor and Wengyik Yeong of Performance Systems International, circa 1993, as a successor to DIXIE and DAS. Mark Wahl of Critical Angle Inc., Tim Howes, and Steve Kille started work in 1996 on a new version of LDAP, LDAPv3, under the aegis of the Internet Engineering Task Force (IETF).  LDAPv3, first published in 1997, superseded LDAPv2 and added support for extensibility, integrated the Simple Authentication and Security Layer, and better aligned the protocol to the 1993 edition of X.500. Further development of the LDAPv3 specifications themselves and of numerous extensions adding features to LDAPv3 has come through the IETF.\n\nIn the early engineering stages of LDAP, it was known as Lightweight Directory Browsing Protocol, or LDBP.  It was renamed with the expansion of the scope of the protocol beyond directory browsing and searching, to include directory update functions. It was given its Lightweight name because it was not as network intensive as its DAP predecessor and thus was more easily implemented over the Internet due to its relatively modest bandwidth usage.\n\nLDAP has influenced subsequent Internet protocols, including later versions of X.500, XML Enabled Directory (XED), Directory Service Markup Language (DSML), Service Provisioning Markup Language (SPML), and the Service Location Protocol (SLP).\n\nProtocol overview\n\nA client starts an LDAP session by connecting to an LDAP server, called a Directory System Agent (DSA), by default on TCP and UDP port 389, or on port 636 for LDAPS (LDAP over SSL, see below). The client then sends an operation request to the server, and the server sends responses in return. With some exceptions, the client does not need to wait for a response before sending the next request, and the server may send the responses in any order. All information is transmitted using Basic Encoding Rules (BER).\n\nThe client may request the following operations:\n* StartTLS — use the LDAPv3 Transport Layer Security (TLS) extension for a secure connection\n* Bind — authenticate and specify LDAP protocol version\n* Search — search for and/or retrieve directory entries\n* Compare — test if a named entry contains a given attribute value\n* Add a new entry\n* Delete an entry\n* Modify an entry\n* Modify Distinguished Name (DN) — move or rename an entry\n* Abandon — abort a previous request\n* Extended Operation — generic operation used to define other operations\n* Unbind — close the connection (not the inverse of Bind)\n\nIn addition the server may send \"Unsolicited Notifications\" that are not responses to any request, e.g. before the connection is timed out.\n\nA common alternative method of securing LDAP communication is using an SSL tunnel. The default port for LDAP over SSL is 636. The use of LDAP over SSL was common in LDAP Version 2 (LDAPv2) but it was never standardized in any formal specification. This usage has been deprecated along with LDAPv2, which was officially retired in 2003.[http://tools.ietf.org/html/rfc3494 RFC3494] Global Catalog is available by default on ports 3268, and 3269 for LDAPS.\n\nDirectory structure\n\nThe protocol provides an interface with directories that follow the 1993 edition of the X.500 model:\n* An entry consists of a set of attributes.\n* An attribute has a name (an attribute type or attribute description) and one or more values. The attributes are defined in a schema (see below).\n* Each entry has a unique identifier: its Distinguished Name (DN). This consists of its Relative Distinguished Name (RDN), constructed from some attribute(s) in the entry, followed by the parent entry's DN. Think of the DN as the full file path and the RDN as its relative filename in its parent folder (e.g. if /foo/bar/myfile.txt were the DN, then myfile.txt would be the RDN).\n\nA DN may change over the lifetime of the entry, for instance, when entries are moved within a tree. To reliably and unambiguously identify entries, a UUID might be provided in the set of the entry's operational attributes.\n\nAn entry can look like this when represented in LDAP Data Interchange Format (LDIF) (LDAP itself is a binary protocol):\n\n dn: cnJohn Doe,dc\nexample,dc=com\n cn: John Doe\n givenName: John\n sn: Doe\n telephoneNumber: +1 888 555 6789\n telephoneNumber: +1 888 555 1232\n mail: john@example.com\n manager: cnBarbara Doe,dc\nexample,dc=com\n objectClass: inetOrgPerson\n objectClass: organizationalPerson\n objectClass: person\n objectClass: top\n\n\"dn\" is the distinguished name of the entry; it is neither an attribute nor a part of the entry. \"cnJohn Doe\" is the entry's RDN (Relative Distinguished Name), and \"dc\nexample,dc=com\" is the DN of the parent entry, where \"dc\" denotes 'Domain Component'. The other lines show the attributes in the entry. Attribute names are typically mnemonic strings, like \"cn\" for common name, \"dc\" for domain component, \"mail\" for e-mail address, and \"sn\" for surname.\n\nA server holds a subtree starting from a specific entry, e.g. \"dcexample,dc\ncom\" and its children. Servers may also hold references to other servers, so an attempt to access \"oudepartment,dc\nexample,dc=com\" could return a referral or continuation reference to a server that holds that part of the directory tree. The client can then contact the other server. Some servers also support chaining, which means the server contacts the other server and returns the results to the client.\n\nLDAP rarely defines any ordering: The server may return the values of an attribute, the attributes in an entry, and the entries found by a search operation in any order. This follows from the formal definitions - an entry is defined as a set of attributes, and an attribute is a set of values, and sets need not be ordered.\n\nOperations\n\nAdd\n\nThe ADD operation inserts a new entry into the directory-server database.[http://tools.ietf.org/html/rfc4511#section-4.7 Add section of RFC4511] If the distinguished name in the add request already exists in the directory, then the server will not add a duplicate entry but will set the result code in the add result to decimal 68, \"entryAlreadyExists\".[http://tools.ietf.org/html/rfc4511#appendix-A LDAP result codes]\n* LDAP-compliant servers will never dereference the distinguished name transmitted in the add request when attempting to locate the entry, that is, distinguished names are never de-aliased.\n* LDAP-compliant servers will ensure that the distinguished name and all attributes conform to naming standards.\n* The entry to be added must not exist, and the immediate superior must exist.\n\ndn: uiduser,ou\npeople,dcexample,dc\ncom\nchangetype: add\nobjectClass: top\nobjectClass: person\nuid: user\nsn: last-name\ncn: common-name\nuserPassword: password\n\nIn the above example, uiduser,ou\npeople,dcexample,dc\ncom must not exist, and oupeople,dc\nexample,dc=com must exist.\n\nBind (authenticate)\n\nWhen an LDAP session is created, that is, when an LDAP client connects to the server, the authentication state of the session\nis set to anonymous. The BIND operation establishes the authentication state for a session.\n\nSimple BIND and SASL PLAIN can send the user's DN and password in plaintext, so the connections utilizing either Simple or SASL PLAIN\nshould be encrypted using Transport Layer Security (TLS). The server typically checks the password against the userPassword\nattribute in the named entry.  Anonymous BIND (with empty DN and password) resets the connection to anonymous state.\n\nSASL (Simple Authentication and Security Layer) BIND provides authentication services through a\nwide range of mechanisms, e.g. Kerberos or the client certificate sent with\nTLS.[http://www.iana.org/assignments/sasl-mechanisms/sasl-mechanisms.xml SASL Mechanisms at IANA]\n\nBIND also sets the LDAP protocol version by sending a version number in the form of an integer. If the client requests a version that the server does not support,\nthe server must set the result code in the BIND response to the code for a protocol error. Normally clients should use LDAPv3, which is the\ndefault in the protocol but not always in LDAP libraries.\n\nBIND had to be the first operation in a session in LDAPv2, but is not required as of LDAPv3. In LDAPv3, each\nsuccessful BIND request changes the authentication state of the session and each unsuccessful BIND request resets the authentication state\nof the session.\n\nDelete\n\nTo delete an entry, an LDAP client transmits a properly formed delete request to the server.[http://tools.ietf.org/html/rfc4511#section-4.8 RFC4511: delete request]\n* A delete request must contain the distinguished name of the entry to be deleted\n* Request controls may also be attached to the delete request\n* Servers do not dereference aliases when processing a delete request\n* Only leaf entries (entries with no subordinates) may be deleted by a delete request. Some servers support an operational attribute hasSubordinates whose value indicates whether an entry has any subordinate entries, and some servers support an operational attribute numSubordinates[http://tools.ietf.org/html/draft-boreham-numsubordinates-01 Boreham Draft (numSubordinates)] indicating the number of entries subordinate to the entry containing the numSubordinates attribute.\n* Some servers support the subtree delete request control permitting deletion of the DN and all objects subordinate to the DN, subject to access controls. Delete requests are subject to access controls, that is, whether a connection with a given authentication state will be permitted to delete a given entry is governed by server-specific access control mechanisms.\n\nSearch and Compare\n\nThe Search operation is used to both search for and read entries.  Its parameters are:\n; baseObject : The name of the base object entry (or possibly the root) relative to which the search is to be performed.\n; scope : What elements below the baseObject to search. This can be BaseObject (search just the named entry, typically used to read one entry), singleLevel (entries immediately below the base DN), or wholeSubtree (the entire subtree starting at the base DN).\n; filter : Criteria to use in selecting elements within scope. For example, the filter (&(objectClassperson)(|(givenName\nJohn)(mailjohn*))) will select \"persons\" (elements of objectClass person) where the matching rules for givenName and mail determine whether the values for those attributes match the filter assertion. Note that a common misconception is that LDAP data is case-sensitive, whereas in fact matching rules and ordering rules determine matching, comparisons, and relative value relationships. If the example filters were required to match the case of the attribute value, an extensible match filter must be used, for example, (&(objectClass\nperson)(|(givenName:caseExactMatch:John)(mail:caseExactSubstringsMatch:\njohn*)))\n; derefAliases : Whether and how to follow alias entries (entries that refer to other entries),\n; attributes : Which attributes to return in result entries.\n; sizeLimit, timeLimit : Maximum number of entries to return, and maximum time to allow search to run. These values, however, cannot override any restrictions the server places on size limit and time limit.\n; typesOnly : Return attribute types only, not attribute values.\n\nThe server returns the matching entries and potentially continuation references. These may be returned in any order.  The final result will include the result code.\n\nThe Compare operation takes a DN, an attribute name and an attribute value, and checks if the named entry contains that attribute with that value.\n\nModify\n\nThe MODIFY operation is used by LDAP clients to request that the LDAP server make changes to existing entries.[http://tools.ietf.org/html/rfc4511#section-4.6 Modify Section of RFC4511] Attempts to modify entries that do not exist will fail. MODIFY requests are subject  to access controls as implemented by the server.\n\nThe MODIFY operation requires that the distinguished name (DN) of the entry be specified, and a sequence of changes. Each change in the sequence must be one of:\n* add (add a new value, which must not already exist in the attribute)\n* delete (delete an existing value)\n* replace (replace an existing value with a new value)\n\nLDIF example of adding a value to an attribute:\n\ndn: dcexample,dc\ncom\nchangetype: modify\nadd: cn\ncn: the-new-cn-value-to-be-added\n-\n\nTo replace the value of an existing attribute, Use the replace keyword. If the attribute is multi-valued, the client must specify the value of the attribute to delete.\n\nTo delete an attribute from an entry, use the keyword delete and the changetype designator modify. If the attribute is multi-valued, the client must specify the value of the attribute to delete.\n\nThere is also a Modify-Increment extension which allows an incrementable attribute value to be incremented by a specified amount. The following example using LDIF increments employeeNumber by 5:\n\ndn: uiduser.0,ou\npeople,dcexample,dc\ncom\nchangetype: modify\nincrement: employeeNumber\nemployeeNumber: 5\n-\n\nWhen LDAP servers are in a replicated topology, LDAP clients should consider using the post-read control to verify updates instead of a search after an update. The post-read control is designed so that applications need not issue a search request after an update – it is bad form to retrieve an entry for the sole purpose of checking that an update worked because of the replication eventual consistency model. An LDAP client should not assume that it connects to the same directory server for each request because architects may have placed load-balancers or LDAP proxies or both between LDAP clients and servers.\n\nModify DN\n\nModify DN (move/rename entry) takes the new RDN (Relative Distinguished Name), optionally the new parent's DN, and a flag that indicates whether to delete the value(s) in the entry that match the old RDN.  The server may support renaming of entire directory subtrees.\n\nAn update operation is atomic: Other operations will see either the new entry or the old one.  On the other hand, LDAP does not define transactions of multiple operations: If you read an entry and then modify it, another client may have updated the entry in the meantime.  Servers may implement extensions[http://tools.ietf.org/html/draft-zeilenga-ldap-txn-15 INTERNET-DRAFT LDAP Transactions draft-zeilenga-ldap-txn-15.txt] that support this, though.\n\nExtended operations\n\nThe Extended Operation is a generic LDAP operation that can define new operations that were not part of the original protocol specification. StartTLS is one of the most significant extensions.  Other examples include Cancel and Password Modify.\n\nStartTLS\n\nThe StartTLS operation establishes Transport Layer Security (the descendant of SSL) on the connection.  It can provide data confidentiality (to protect data from being observed by third parties) and/or data integrity protection (which protects the data from tampering).  During TLS negotiation the server sends its X.509 certificate to prove its identity.  The client may also send a certificate to prove its identity.  After doing so, the client may then use SASL/EXTERNAL.  By using the SASL/EXTERNAL, the client requests the server derive its identity from credentials provided at a lower level (such as TLS).  Though technically the server may use any identity information established at any lower level, typically the server will use the identity information established by TLS.\n\nServers also often support the non-standard \"LDAPS\" (\"Secure LDAP\", commonly known as \"LDAP over SSL\") protocol on a separate port, by default 636.  LDAPS differs from LDAP in two ways:\n1) upon connect, the client and server establish TLS before any LDAP messages are transferred (without a StartTLS operation) and\n2) the LDAPS connection must be closed upon TLS closure.\n\nSome \"LDAPS\" client libraries only encrypt communication; they do not check the host name against the name in the supplied certificate.[http://shibboleth.net/community/advisories/secadv_20120227.txt Shibboleth Security alert 20120227]\n\nAbandon\n\nThe Abandon operation requests that the server abort an operation named by a message ID.  The server need not honor the request.  Neither Abandon nor a successfully abandoned operation send a response.  A similar Cancel extended operation does send responses, but not all implementations support this.\n\nUnbind\n\nThe Unbind operation abandons any outstanding operations and closes the connection.  It has no response.  The name is of historical origin, and is not the opposite of the Bind operation.[http://tools.ietf.org/html/rfc4511#section-4.3 Tools.ietf.org]\n\nClients can abort a session by simply closing the connection, but they should use Unbind.[http://tools.ietf.org/html/rfc4511#section-5.3 Tools.ietf.org] Unbind allows the server to gracefully close the connection and free resources that it would otherwise keep for some time until discovering the client had abandoned the connection. It also instructs the server to cancel operations that can be canceled, and to not send responses for operations that cannot be canceled.[http://tools.ietf.org/html/rfc4511#section-3.1 Tools.ietf.org]\n\nURI scheme\n\nAn LDAP uniform resource identifier (URI) scheme exists, which clients support in varying degrees, and servers return in referrals and continuation references (see RFC 4516):\n\n ldap://host:port/DN?attributes?scope?filter?extensions\n\nMost of the components described below are optional.\n* host is the FQDN or IP address of the LDAP server to search.\n* port is the network port (default port 389) of the LDAP server.\n* DN is the distinguished name to use as the search base.\n* attributes is a comma-separated list of attributes to retrieve.\n* scope specifies the search scope and can be \"base\" (the default), \"one\" or \"sub\".\n* filter is a search filter. For example, (objectClass=*) as defined in RFC 4515.\n* extensions are extensions to the LDAP URL format.\n\nFor example, \"ldap://ldap.example.com/cnJohn%20Doe,dc\nexample,dccom\" refers to all user attributes in John Doe's entry in ldap.example.com, while \"ldap:///dc\nexample,dccom??sub?(givenName\nJohn)\" searches for the entry in the default server (note the triple slash, omitting the host, and the double question mark, omitting the attributes).  As in other URLs, special characters must be percent-encoded.\n\nThere is a similar non-standard ldaps URI scheme for LDAP over SSL. This should not be confused with LDAP with TLS, which is achieved using the StartTLS operation using the standard ldap scheme.\n\nSchema\n\nThe contents of the entries in a subtree are governed by a directory schema, a set of definitions and constraints concerning the structure of the directory information tree (DIT).\n\nThe schema of a Directory Server defines a set of rules that govern the kinds of information that the server can hold. It has a number of elements, including:\n* Attribute Syntaxes—Provide information about the kind of information that can be stored in an attribute.\n* Matching Rules—Provide information about how to make comparisons against attribute values.\n* Matching Rule Uses—Indicate which attribute types may be used in conjunction with a particular matching rule.\n* Attribute Types—Define an object identifier (OID) and a set of names that may be used to refer to a given attribute, and associates that attribute with a syntax and set of matching rules.\n* Object Classes—Define named collections of attributes and classify them into sets of required and optional attributes.\n* Name Forms—Define rules for the set of attributes that should be included in the RDN for an entry.\n* Content Rules—Define additional constraints about the object classes and attributes that may be used in conjunction with an entry.\n* Structure Rule—Define rules that govern the kinds of subordinate entries that a given entry may have.\n\nAttributes are the elements responsible for storing information in a directory, and the schema defines the rules for which attributes may be used in an entry, the kinds of values that those attributes may have, and how clients may interact with those values.\n\nClients may learn about the schema elements that the server supports by retrieving an appropriate subschema subentry.\n\nThe schema defines object classes.  Each entry must have an objectClass attribute, containing named classes defined in the schema.  The schema definition of the classes of an entry defines what kind of object the entry may represent - e.g. a person, organization or domain.  The object class definitions also define the list of attributes that must contain values and the list of attributes which may contain values.\n\nFor example, an entry representing a person might belong to the classes \"top\" and \"person\". Membership in the \"person\" class would require the entry to contain the \"sn\" and \"cn\" attributes, and allow the entry also to contain \"userPassword\", \"telephoneNumber\", and other attributes. Since entries may have multiple ObjectClasses values, each entry has a complex of optional and mandatory attribute sets formed from the union of the object classes it represents. ObjectClasses can be inherited, and a single entry can have multiple ObjectClasses values that define the available and required attributes of the entry itself. A parallel to the schema of an objectClass is a class definition and an instance in Object-oriented programming, representing LDAP objectClass and LDAP entry, respectively.\n\nDirectory servers may publish the directory schema controlling an entry at a base DN given by the entry's subschemaSubentry operational attribute.  (An operational attribute describes operation of the directory rather than user information and is only returned from a search when it is explicitly requested.)\n\nServer administrators can add additional schema entries in addition to the provided schema elements.  A schema for representing individual people within organizations is termed a white pages schema.\n\nVariations\n\nA lot of the server operation is left to the implementor or administrator to decide.  Accordingly, servers may be set up to support a wide variety of scenarios.\n\nFor example, data storage in the server is not specified - the server may use flat files, databases, or just be a gateway to some other server.  Access control is not standardized, though there has been work on it and there are commonly used models.  Users' passwords may be stored in their entries or elsewhere.  The server may refuse to perform operations when it wishes, and impose various limits.\n\nMost parts of LDAP are extensible. Examples: One can define new operations.  Controls may modify requests and responses, e.g. to request sorted search results.  New search scopes and Bind methods can be defined.  Attributes can have options that may modify their semantics.\n\nOther data models\n\nAs LDAP has gained momentum, vendors have provided it as an access protocol to other services.  The implementation then recasts the data to mimic the LDAP/X.500 model, but how closely this model is followed varies.  For example, there is software to access SQL databases through LDAP, even though LDAP does not readily lend itself to this.[http://www.openldap.org/doc/admin24/backends.html#SQL Openldap.org] X.500 servers may support LDAP as well.\n\nSimilarly, data previously held in other types of data stores are sometimes moved to LDAP directories.  For example, Unix user and group information can be stored in LDAP and accessed via PAM and NSS modules.  LDAP is often used by other services for authentication.\n\nAn example of such data model is the GLUE Schema,[https://www.ogf.org/documents/GFD.218.pdf Open Grid Forum : Project Home] which is used in a distributed information system based on LDAP that enable users, applications and services to discover which services exist in a Grid infrastructure and further information about their structure and state.\n\nUsage\n\nAn LDAP server may return referrals to other servers for requests that it cannot fulfill itself. This requires a naming structure for LDAP entries so one can find a server holding a given distinguished name (DN), a concept defined in the X.500 Directory and also used in LDAP. Another way of locating LDAP servers for an organization is a DNS server record (SRV).\n\nAn organization with the domain example.org may use the top level LDAP DN dcexample,dc\norg (where dc means domain component).  If the LDAP server is also named ldap.example.org, the organization's top level LDAP URL becomes ldap://ldap.example.org/dcexample,dc\norg.\n\nPrimarily two common styles of naming are used in both X.500 [2008] and LDAPv3. These are documented in the ITU specifications and IETF RFCs. The original form takes the top level object as the country object, such as cUS, c\nFR. The domain component model uses the model described above. An example of country based naming could be lLocality, ou\nSome Organizational Unit, oSome Organization, c\nFR, or in the US: cnCommon Name, l\nLocality, ouSome Organizational Unit, o\nSome Organization, stCA, c\nUS.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lightweight Directory Access Protocol" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18508" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Lightweight Directory Access Protocol  (LDAP;) is an open, vendor-neutral, industry standard application protocol for accessing and maintaining distributed directory information services over an Internet Protocol (IP) network.  Directory services play an important role in developing intranet and Internet applications by allowing the sharing of information about users, systems, networks, services, and applications throughout the network.  As examples, directory services may provide any organized set of records, often with a hierarchical structure, such as a corporate email directory.  Similarly, a telephone directory is a list of subscribers with an address and a phone number.\n\nLDAP is specified in a series of Internet Engineering Task Force (IETF) Standard Track publications called Request for Comments (RFCs), using the description language ASN.1. The latest specification is Version 3, published as RFC 4511.[http://www.gracion.com/server/whatldap.html What is LDAP?]. Gracion.com. Retrieved on 2013-07-17.\n\nA common use of LDAP is to provide a central place to store usernames and passwords. This allows many different applications and services to connect to the LDAP server to validate users.\n\nLDAP is based on a simpler subset of the standards contained within the X.500 standard.  Because of this relationship, LDAP is sometimes called X.500-lite.\n\nHistory\n\nTelecommunication companies' understanding of directory requirements were well developed after some 70 years of producing and managing telephone directories. These companies introduced the concept of directory services to information technology and computer networking, their input culminating in the comprehensive X.500 specification,The X.500 series - ITU-T Rec. X.500 to X.521 a suite of protocols produced by the International Telecommunication Union (ITU) in the 1980s.\n\nX.500 directory services were traditionally accessed via the X.500 Directory Access Protocol (DAP), which required the Open Systems Interconnection (OSI) protocol stack. LDAP was originally intended to be a lightweight alternative protocol for accessing X.500 directory services through the simpler (and now widespread) TCP/IP protocol stack.  This model of directory access was borrowed from the DIXIE and Directory Assistance Service protocols.\n\nThe protocol was originally created by Tim Howes of the University of Michigan, Steve Kille of Isode Limited, Colin Robbins of Nexor and Wengyik Yeong of Performance Systems International, circa 1993, as a successor to DIXIE and DAS. Mark Wahl of Critical Angle Inc., Tim Howes, and Steve Kille started work in 1996 on a new version of LDAP, LDAPv3, under the aegis of the Internet Engineering Task Force (IETF).  LDAPv3, first published in 1997, superseded LDAPv2 and added support for extensibility, integrated the Simple Authentication and Security Layer, and better aligned the protocol to the 1993 edition of X.500. Further development of the LDAPv3 specifications themselves and of numerous extensions adding features to LDAPv3 has come through the IETF.\n\nIn the early engineering stages of LDAP, it was known as Lightweight Directory Browsing Protocol, or LDBP.  It was renamed with the expansion of the scope of the protocol beyond directory browsing and searching, to include directory update functions. It was given its Lightweight name because it was not as network intensive as its DAP predecessor and thus was more easily implemented over the Internet due to its relatively modest bandwidth usage.\n\nLDAP has influenced subsequent Internet protocols, including later versions of X.500, XML Enabled Directory (XED), Directory Service Markup Language (DSML), Service Provisioning Markup Language (SPML), and the Service Location Protocol (SLP).\n\nProtocol overview\n\nA client starts an LDAP session by connecting to an LDAP server, called a Directory System Agent (DSA), by default on TCP and UDP port 389, or on port 636 for LDAPS (LDAP over SSL, see below). The client then sends an operation request to the server, and the server sends responses in return. With some exceptions, the client does not need to wait for a response before sending the next request, and the server may send the responses in any order. All information is transmitted using Basic Encoding Rules (BER).\n\nThe client may request the following operations:\n* StartTLS — use the LDAPv3 Transport Layer Security (TLS) extension for a secure connection\n* Bind — authenticate and specify LDAP protocol version\n* Search — search for and/or retrieve directory entries\n* Compare — test if a named entry contains a given attribute value\n* Add a new entry\n* Delete an entry\n* Modify an entry\n* Modify Distinguished Name (DN) — move or rename an entry\n* Abandon — abort a previous request\n* Extended Operation — generic operation used to define other operations\n* Unbind — close the connection (not the inverse of Bind)\n\nIn addition the server may send \"Unsolicited Notifications\" that are not responses to any request, e.g. before the connection is timed out.\n\nA common alternative method of securing LDAP communication is using an SSL tunnel. The default port for LDAP over SSL is 636. The use of LDAP over SSL was common in LDAP Version 2 (LDAPv2) but it was never standardized in any formal specification. This usage has been deprecated along with LDAPv2, which was officially retired in 2003.[http://tools.ietf.org/html/rfc3494 RFC3494] Global Catalog is available by default on ports 3268, and 3269 for LDAPS.\n\nDirectory structure\n\nThe protocol provides an interface with directories that follow the 1993 edition of the X.500 model:\n* An entry consists of a set of attributes.\n* An attribute has a name (an attribute type or attribute description) and one or more values. The attributes are defined in a schema (see below).\n* Each entry has a unique identifier: its Distinguished Name (DN). This consists of its Relative Distinguished Name (RDN), constructed from some attribute(s) in the entry, followed by the parent entry's DN. Think of the DN as the full file path and the RDN as its relative filename in its parent folder (e.g. if /foo/bar/myfile.txt were the DN, then myfile.txt would be the RDN).\n\nA DN may change over the lifetime of the entry, for instance, when entries are moved within a tree. To reliably and unambiguously identify entries, a UUID might be provided in the set of the entry's operational attributes.\n\nAn entry can look like this when represented in LDAP Data Interchange Format (LDIF) (LDAP itself is a binary protocol):\n\n dn: cnJohn Doe,dc\nexample,dc=com\n cn: John Doe\n givenName: John\n sn: Doe\n telephoneNumber: +1 888 555 6789\n telephoneNumber: +1 888 555 1232\n mail: john@example.com\n manager: cnBarbara Doe,dc\nexample,dc=com\n objectClass: inetOrgPerson\n objectClass: organizationalPerson\n objectClass: person\n objectClass: top\n\n\"dn\" is the distinguished name of the entry; it is neither an attribute nor a part of the entry. \"cnJohn Doe\" is the entry's RDN (Relative Distinguished Name), and \"dc\nexample,dc=com\" is the DN of the parent entry, where \"dc\" denotes 'Domain Component'. The other lines show the attributes in the entry. Attribute names are typically mnemonic strings, like \"cn\" for common name, \"dc\" for domain component, \"mail\" for e-mail address, and \"sn\" for surname.\n\nA server holds a subtree starting from a specific entry, e.g. \"dcexample,dc\ncom\" and its children. Servers may also hold references to other servers, so an attempt to access \"oudepartment,dc\nexample,dc=com\" could return a referral or continuation reference to a server that holds that part of the directory tree. The client can then contact the other server. Some servers also support chaining, which means the server contacts the other server and returns the results to the client.\n\nLDAP rarely defines any ordering: The server may return the values of an attribute, the attributes in an entry, and the entries found by a search operation in any order. This follows from the formal definitions - an entry is defined as a set of attributes, and an attribute is a set of values, and sets need not be ordered.\n\nOperations\n\nAdd\n\nThe ADD operation inserts a new entry into the directory-server database.[http://tools.ietf.org/html/rfc4511#section-4.7 Add section of RFC4511] If the distinguished name in the add request already exists in the directory, then the server will not add a duplicate entry but will set the result code in the add result to decimal 68, \"entryAlreadyExists\".[http://tools.ietf.org/html/rfc4511#appendix-A LDAP result codes]\n* LDAP-compliant servers will never dereference the distinguished name transmitted in the add request when attempting to locate the entry, that is, distinguished names are never de-aliased.\n* LDAP-compliant servers will ensure that the distinguished name and all attributes conform to naming standards.\n* The entry to be added must not exist, and the immediate superior must exist.\n\ndn: uiduser,ou\npeople,dcexample,dc\ncom\nchangetype: add\nobjectClass: top\nobjectClass: person\nuid: user\nsn: last-name\ncn: common-name\nuserPassword: password\n\nIn the above example, uiduser,ou\npeople,dcexample,dc\ncom must not exist, and oupeople,dc\nexample,dc=com must exist.\n\nBind (authenticate)\n\nWhen an LDAP session is created, that is, when an LDAP client connects to the server, the authentication state of the session\nis set to anonymous. The BIND operation establishes the authentication state for a session.\n\nSimple BIND and SASL PLAIN can send the user's DN and password in plaintext, so the connections utilizing either Simple or SASL PLAIN\nshould be encrypted using Transport Layer Security (TLS). The server typically checks the password against the userPassword\nattribute in the named entry.  Anonymous BIND (with empty DN and password) resets the connection to anonymous state.\n\nSASL (Simple Authentication and Security Layer) BIND provides authentication services through a\nwide range of mechanisms, e.g. Kerberos or the client certificate sent with\nTLS.[http://www.iana.org/assignments/sasl-mechanisms/sasl-mechanisms.xml SASL Mechanisms at IANA]\n\nBIND also sets the LDAP protocol version by sending a version number in the form of an integer. If the client requests a version that the server does not support,\nthe server must set the result code in the BIND response to the code for a protocol error. Normally clients should use LDAPv3, which is the\ndefault in the protocol but not always in LDAP libraries.\n\nBIND had to be the first operation in a session in LDAPv2, but is not required as of LDAPv3. In LDAPv3, each\nsuccessful BIND request changes the authentication state of the session and each unsuccessful BIND request resets the authentication state\nof the session.\n\nDelete\n\nTo delete an entry, an LDAP client transmits a properly formed delete request to the server.[http://tools.ietf.org/html/rfc4511#section-4.8 RFC4511: delete request]\n* A delete request must contain the distinguished name of the entry to be deleted\n* Request controls may also be attached to the delete request\n* Servers do not dereference aliases when processing a delete request\n* Only leaf entries (entries with no subordinates) may be deleted by a delete request. Some servers support an operational attribute hasSubordinates whose value indicates whether an entry has any subordinate entries, and some servers support an operational attribute numSubordinates[http://tools.ietf.org/html/draft-boreham-numsubordinates-01 Boreham Draft (numSubordinates)] indicating the number of entries subordinate to the entry containing the numSubordinates attribute.\n* Some servers support the subtree delete request control permitting deletion of the DN and all objects subordinate to the DN, subject to access controls. Delete requests are subject to access controls, that is, whether a connection with a given authentication state will be permitted to delete a given entry is governed by server-specific access control mechanisms.\n\nSearch and Compare\n\nThe Search operation is used to both search for and read entries.  Its parameters are:\n; baseObject : The name of the base object entry (or possibly the root) relative to which the search is to be performed.\n; scope : What elements below the baseObject to search. This can be BaseObject (search just the named entry, typically used to read one entry), singleLevel (entries immediately below the base DN), or wholeSubtree (the entire subtree starting at the base DN).\n; filter : Criteria to use in selecting elements within scope. For example, the filter (&(objectClassperson)(|(givenName\nJohn)(mailjohn*))) will select \"persons\" (elements of objectClass person) where the matching rules for givenName and mail determine whether the values for those attributes match the filter assertion. Note that a common misconception is that LDAP data is case-sensitive, whereas in fact matching rules and ordering rules determine matching, comparisons, and relative value relationships. If the example filters were required to match the case of the attribute value, an extensible match filter must be used, for example, (&(objectClass\nperson)(|(givenName:caseExactMatch:John)(mail:caseExactSubstringsMatch:\njohn*)))\n; derefAliases : Whether and how to follow alias entries (entries that refer to other entries),\n; attributes : Which attributes to return in result entries.\n; sizeLimit, timeLimit : Maximum number of entries to return, and maximum time to allow search to run. These values, however, cannot override any restrictions the server places on size limit and time limit.\n; typesOnly : Return attribute types only, not attribute values.\n\nThe server returns the matching entries and potentially continuation references. These may be returned in any order.  The final result will include the result code.\n\nThe Compare operation takes a DN, an attribute name and an attribute value, and checks if the named entry contains that attribute with that value.\n\nModify\n\nThe MODIFY operation is used by LDAP clients to request that the LDAP server make changes to existing entries.[http://tools.ietf.org/html/rfc4511#section-4.6 Modify Section of RFC4511] Attempts to modify entries that do not exist will fail. MODIFY requests are subject  to access controls as implemented by the server.\n\nThe MODIFY operation requires that the distinguished name (DN) of the entry be specified, and a sequence of changes. Each change in the sequence must be one of:\n* add (add a new value, which must not already exist in the attribute)\n* delete (delete an existing value)\n* replace (replace an existing value with a new value)\n\nLDIF example of adding a value to an attribute:\n\ndn: dcexample,dc\ncom\nchangetype: modify\nadd: cn\ncn: the-new-cn-value-to-be-added\n-\n\nTo replace the value of an existing attribute, Use the replace keyword. If the attribute is multi-valued, the client must specify the value of the attribute to delete.\n\nTo delete an attribute from an entry, use the keyword delete and the changetype designator modify. If the attribute is multi-valued, the client must specify the value of the attribute to delete.\n\nThere is also a Modify-Increment extension which allows an incrementable attribute value to be incremented by a specified amount. The following example using LDIF increments employeeNumber by 5:\n\ndn: uiduser.0,ou\npeople,dcexample,dc\ncom\nchangetype: modify\nincrement: employeeNumber\nemployeeNumber: 5\n-\n\nWhen LDAP servers are in a replicated topology, LDAP clients should consider using the post-read control to verify updates instead of a search after an update. The post-read control is designed so that applications need not issue a search request after an update – it is bad form to retrieve an entry for the sole purpose of checking that an update worked because of the replication eventual consistency model. An LDAP client should not assume that it connects to the same directory server for each request because architects may have placed load-balancers or LDAP proxies or both between LDAP clients and servers.\n\nModify DN\n\nModify DN (move/rename entry) takes the new RDN (Relative Distinguished Name), optionally the new parent's DN, and a flag that indicates whether to delete the value(s) in the entry that match the old RDN.  The server may support renaming of entire directory subtrees.\n\nAn update operation is atomic: Other operations will see either the new entry or the old one.  On the other hand, LDAP does not define transactions of multiple operations: If you read an entry and then modify it, another client may have updated the entry in the meantime.  Servers may implement extensions[http://tools.ietf.org/html/draft-zeilenga-ldap-txn-15 INTERNET-DRAFT LDAP Transactions draft-zeilenga-ldap-txn-15.txt] that support this, though.\n\nExtended operations\n\nThe Extended Operation is a generic LDAP operation that can define new operations that were not part of the original protocol specification. StartTLS is one of the most significant extensions.  Other examples include Cancel and Password Modify.\n\nStartTLS\n\nThe StartTLS operation establishes Transport Layer Security (the descendant of SSL) on the connection.  It can provide data confidentiality (to protect data from being observed by third parties) and/or data integrity protection (which protects the data from tampering).  During TLS negotiation the server sends its X.509 certificate to prove its identity.  The client may also send a certificate to prove its identity.  After doing so, the client may then use SASL/EXTERNAL.  By using the SASL/EXTERNAL, the client requests the server derive its identity from credentials provided at a lower level (such as TLS).  Though technically the server may use any identity information established at any lower level, typically the server will use the identity information established by TLS.\n\nServers also often support the non-standard \"LDAPS\" (\"Secure LDAP\", commonly known as \"LDAP over SSL\") protocol on a separate port, by default 636.  LDAPS differs from LDAP in two ways:\n1) upon connect, the client and server establish TLS before any LDAP messages are transferred (without a StartTLS operation) and\n2) the LDAPS connection must be closed upon TLS closure.\n\nSome \"LDAPS\" client libraries only encrypt communication; they do not check the host name against the name in the supplied certificate.[http://shibboleth.net/community/advisories/secadv_20120227.txt Shibboleth Security alert 20120227]\n\nAbandon\n\nThe Abandon operation requests that the server abort an operation named by a message ID.  The server need not honor the request.  Neither Abandon nor a successfully abandoned operation send a response.  A similar Cancel extended operation does send responses, but not all implementations support this.\n\nUnbind\n\nThe Unbind operation abandons any outstanding operations and closes the connection.  It has no response.  The name is of historical origin, and is not the opposite of the Bind operation.[http://tools.ietf.org/html/rfc4511#section-4.3 Tools.ietf.org]\n\nClients can abort a session by simply closing the connection, but they should use Unbind.[http://tools.ietf.org/html/rfc4511#section-5.3 Tools.ietf.org] Unbind allows the server to gracefully close the connection and free resources that it would otherwise keep for some time until discovering the client had abandoned the connection. It also instructs the server to cancel operations that can be canceled, and to not send responses for operations that cannot be canceled.[http://tools.ietf.org/html/rfc4511#section-3.1 Tools.ietf.org]\n\nURI scheme\n\nAn LDAP uniform resource identifier (URI) scheme exists, which clients support in varying degrees, and servers return in referrals and continuation references (see RFC 4516):\n\n ldap://host:port/DN?attributes?scope?filter?extensions\n\nMost of the components described below are optional.\n* host is the FQDN or IP address of the LDAP server to search.\n* port is the network port (default port 389) of the LDAP server.\n* DN is the distinguished name to use as the search base.\n* attributes is a comma-separated list of attributes to retrieve.\n* scope specifies the search scope and can be \"base\" (the default), \"one\" or \"sub\".\n* filter is a search filter. For example, (objectClass=*) as defined in RFC 4515.\n* extensions are extensions to the LDAP URL format.\n\nFor example, \"ldap://ldap.example.com/cnJohn%20Doe,dc\nexample,dccom\" refers to all user attributes in John Doe's entry in ldap.example.com, while \"ldap:///dc\nexample,dccom??sub?(givenName\nJohn)\" searches for the entry in the default server (note the triple slash, omitting the host, and the double question mark, omitting the attributes).  As in other URLs, special characters must be percent-encoded.\n\nThere is a similar non-standard ldaps URI scheme for LDAP over SSL. This should not be confused with LDAP with TLS, which is achieved using the StartTLS operation using the standard ldap scheme.\n\nSchema\n\nThe contents of the entries in a subtree are governed by a directory schema, a set of definitions and constraints concerning the structure of the directory information tree (DIT).\n\nThe schema of a Directory Server defines a set of rules that govern the kinds of information that the server can hold. It has a number of elements, including:\n* Attribute Syntaxes—Provide information about the kind of information that can be stored in an attribute.\n* Matching Rules—Provide information about how to make comparisons against attribute values.\n* Matching Rule Uses—Indicate which attribute types may be used in conjunction with a particular matching rule.\n* Attribute Types—Define an object identifier (OID) and a set of names that may be used to refer to a given attribute, and associates that attribute with a syntax and set of matching rules.\n* Object Classes—Define named collections of attributes and classify them into sets of required and optional attributes.\n* Name Forms—Define rules for the set of attributes that should be included in the RDN for an entry.\n* Content Rules—Define additional constraints about the object classes and attributes that may be used in conjunction with an entry.\n* Structure Rule—Define rules that govern the kinds of subordinate entries that a given entry may have.\n\nAttributes are the elements responsible for storing information in a directory, and the schema defines the rules for which attributes may be used in an entry, the kinds of values that those attributes may have, and how clients may interact with those values.\n\nClients may learn about the schema elements that the server supports by retrieving an appropriate subschema subentry.\n\nThe schema defines object classes.  Each entry must have an objectClass attribute, containing named classes defined in the schema.  The schema definition of the classes of an entry defines what kind of object the entry may represent - e.g. a person, organization or domain.  The object class definitions also define the list of attributes that must contain values and the list of attributes which may contain values.\n\nFor example, an entry representing a person might belong to the classes \"top\" and \"person\". Membership in the \"person\" class would require the entry to contain the \"sn\" and \"cn\" attributes, and allow the entry also to contain \"userPassword\", \"telephoneNumber\", and other attributes. Since entries may have multiple ObjectClasses values, each entry has a complex of optional and mandatory attribute sets formed from the union of the object classes it represents. ObjectClasses can be inherited, and a single entry can have multiple ObjectClasses values that define the available and required attributes of the entry itself. A parallel to the schema of an objectClass is a class definition and an instance in Object-oriented programming, representing LDAP objectClass and LDAP entry, respectively.\n\nDirectory servers may publish the directory schema controlling an entry at a base DN given by the entry's subschemaSubentry operational attribute.  (An operational attribute describes operation of the directory rather than user information and is only returned from a search when it is explicitly requested.)\n\nServer administrators can add additional schema entries in addition to the provided schema elements.  A schema for representing individual people within organizations is termed a white pages schema.\n\nVariations\n\nA lot of the server operation is left to the implementor or administrator to decide.  Accordingly, servers may be set up to support a wide variety of scenarios.\n\nFor example, data storage in the server is not specified - the server may use flat files, databases, or just be a gateway to some other server.  Access control is not standardized, though there has been work on it and there are commonly used models.  Users' passwords may be stored in their entries or elsewhere.  The server may refuse to perform operations when it wishes, and impose various limits.\n\nMost parts of LDAP are extensible. Examples: One can define new operations.  Controls may modify requests and responses, e.g. to request sorted search results.  New search scopes and Bind methods can be defined.  Attributes can have options that may modify their semantics.\n\nOther data models\n\nAs LDAP has gained momentum, vendors have provided it as an access protocol to other services.  The implementation then recasts the data to mimic the LDAP/X.500 model, but how closely this model is followed varies.  For example, there is software to access SQL databases through LDAP, even though LDAP does not readily lend itself to this.[http://www.openldap.org/doc/admin24/backends.html#SQL Openldap.org] X.500 servers may support LDAP as well.\n\nSimilarly, data previously held in other types of data stores are sometimes moved to LDAP directories.  For example, Unix user and group information can be stored in LDAP and accessed via PAM and NSS modules.  LDAP is often used by other services for authentication.\n\nAn example of such data model is the GLUE Schema,[https://www.ogf.org/documents/GFD.218.pdf Open Grid Forum : Project Home] which is used in a distributed information system based on LDAP that enable users, applications and services to discover which services exist in a Grid infrastructure and further information about their structure and state.\n\nUsage\n\nAn LDAP server may return referrals to other servers for requests that it cannot fulfill itself. This requires a naming structure for LDAP entries so one can find a server holding a given distinguished name (DN), a concept defined in the X.500 Directory and also used in LDAP. Another way of locating LDAP servers for an organization is a DNS server record (SRV).\n\nAn organization with the domain example.org may use the top level LDAP DN dcexample,dc\norg (where dc means domain component).  If the LDAP server is also named ldap.example.org, the organization's top level LDAP URL becomes ldap://ldap.example.org/dcexample,dc\norg.\n\nPrimarily two common styles of naming are used in both X.500 [2008] and LDAPv3. These are documented in the ITU specifications and IETF RFCs. The original form takes the top level object as the country object, such as cUS, c\nFR. The domain component model uses the model described above. An example of country based naming could be lLocality, ou\nSome Organizational Unit, oSome Organization, c\nFR, or in the US: cnCommon Name, l\nLocality, ouSome Organizational Unit, o\nSome Organization, stCA, c\nUS. Lightweight Directory Access Protocol. http://en.wikipedia.org/?curid=18508."
  }
}
