{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9299",
  "eid" : "edd294d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778478749,
  "textBody" : "Erasmus Darwin (12 December 173118 April 1802) was an English physician. One of the key thinkers of the Midlands Enlightenment, he was also a natural philosopher, physiologist, slave-trade abolitionist, inventor and poet.\n\nHis poems included much natural history, including a statement of evolution and the relatedness of all forms of life.\n\nHe was a member of the Darwin–Wedgwood family, which includes his grandsons Charles Darwin and Francis Galton. Darwin was a founding member of the Lunar Society of Birmingham, a discussion group of pioneering industrialists and natural philosophers.\n\nHe turned down an invitation of George III's to become a physician to the King.\n\nEarly life and education \n\nDarwin was born in 1731 at Elston Hall, Nottinghamshire near Newark-on-Trent, England, the youngest of seven children of Robert Darwin of Elston (12 August 1682 – 20 November 1754), a lawyer and physician, and his wife Elizabeth Hill (1702–97). The name Erasmus had been used by a number of his family and derives from his ancestor Erasmus Earle, Common Sergent of England under Oliver Cromwell.Burke's Landed Gentry, Darwin formerly of Downe, 1966 His siblings were: \n* Robert Darwin (17 October 1724 – 4 November 1816)\n* Elizabeth Darwin (15 September 1725 – 8 April 1800)\n* William Alvey Darwin (3 October 1726 – 7 October 1783)\n* Anne Darwin (12 November 1727 – 3 August 1813)\n* Susannah Darwin (10 April 1729 – 29 September 1789)\n* Charles Darwin, rector of Elston (28 September 1730 – 24 May 1805)\n\nHe was educated at Chesterfield Grammar School, then later at St John's College, Cambridge. He obtained his medical education at the University of Edinburgh Medical School. Whether Darwin ever obtained the formal degree of MD is not known. Darwin settled in 1756 as a physician at Nottingham, but met with little success and so moved the following year to Lichfield to try to establish a practice there. A few weeks after his arrival, using a novel course of treatment, he restored the health of a young man whose death seemed inevitable. This ensured his success in the new locale. Darwin was a highly successful physician for more than fifty years in the Midlands. George III invited him to be Royal Physician, but Darwin declined. In Lichfield, Darwin wrote \"didactic poetry, developed his system of evolution, and invented amongst other things, a carriage steering mechanism, a manuscript copier and a speaking machine.\n\nPersonal life \n\nDarwin married twice and had 14 children, including two illegitimate daughters by an employee, and, possibly, at least one further illegitimate daughter.\n\nIn 1757 he married Mary (Polly) Howard (1740–1770). They had four sons and one daughter, two of whom (a son and a daughter) died in infancy:\n\n* Charles Darwin (1758–1778)\n* Erasmus Darwin II (1759–1799)\n* Elizabeth Darwin (1763, survived 4 months)\n* Robert Waring Darwin (1766–1848), father of the naturalist Charles Darwin\n* William Alvey Darwin (1767, survived 19 days)\n\nThe first Mrs. Darwin died in 1770. A governess, Mary Parker, was hired to look after Robert. By late 1771, employer and employee had become intimately involved and together they had two illegitimate daughters:\n* Susanna Parker (1772–1856)\n* Mary Parker Jr (1774–1859)\n\nSusanna and Mary Jr later established a boarding school for girls. In 1782, Mary Sr (the governess) married Joseph Day (1745–1811), a Birmingham merchant, and moved away.\n\nDarwin may have fathered another child, this time with a married woman. A Lucy Swift gave birth in 1771 to a baby, also named Lucy, who was christened a daughter of her mother and William Swift, but there is reason to believe the father was really Darwin. Lucy Jr. married John Hardcastle in Derby in 1792 and their daughter, Mary, married Francis Boott, the physician.\n\nIn 1775 Darwin met Elizabeth Pole, daughter of Charles Colyear, 2nd Earl of Portmore, and wife of Colonel Edward Pole (1718–1780); but as she was married, Darwin could only make his feelings known for her through poetry. When Edward Pole died, Darwin married Elizabeth and moved to her home, Radbourne Hall, four miles (6 km) west of Derby. The hall and village are these days known as Radbourne. In 1782, they moved to Full Street, Derby. They had four sons, one of whom died in infancy, and three daughters:\n\n* Edward Darwin (1782–1829)\n* Frances Ann Violetta Darwin (1783–1874), married Samuel Tertius Galton, was the mother of Francis Galton\n* Emma Georgina Elizabeth Darwin (1784–1818)\n* Sir Francis Sacheverel Darwin (1786–1859)\n* John Darwin (1787–1818)\n* Henry Darwin (1789–1790), died in infancy.\n* Harriet Darwin (1790–1825), married Admiral Thomas James Maling\n\nDarwin's personal appearance is described in unflattering detail in his Biographical Memoirs, printed by the Monthly Magazine in 1802. Darwin, the description reads, \"was of middle stature, in person gross and corpulent; his features were coarse, and his countenance heavy; if not wholly void of animation, it certainly was by no means expressive. The print of him, from a painting of Mr. Wright, is a good likeness. In his gait and dress he was rather clumsy and slovenly, and frequently walked with his tongue hanging out of his mouth.\"\n\nDeath \n\nDarwin died suddenly on 18 April 1802, weeks after having moved to Breadsall Priory, just north of Derby. The Monthly Magazine of 1802, in its Biographical Memoirs of the Late Dr. Darwin, reports that \"during the last few years, Dr. Darwin was much subject to inflammation in his breast and lungs; he had a very serious attack of this disease in the course of the last Spring, from which, after repeated bleedings, by himself and a surgeon, he with great difficulty recovered.\"\n\nDarwin's death, the Biographical Memoirs continues, \"is variously accounted for: it is supposed to have been caused by the cold fit of an inflammatory fever. Dr. Fox, of Derby, considers the disease which occasioned it to have been angina pectoris; but Dr. Garlicke, of the same place, thinks this opinion not sufficiently well founded. Whatever was the disease, it is not improbable, surely, that the fatal event was hastened by the violent fit of passion with which he was seized in the morning.\"\n\nHis body is buried in All Saints Church, Breadsall.\n\nErasmus Darwin is commemorated on one of the Moonstones, a series of monuments in Birmingham.\n\nWritings \n\nBotanical works and the Lichfield Botanical Society \n\nDarwin formed the Lichfield Botanical Society (despite the name, composed of only three men, Erasmus Darwin, Sir Brooke Boothby and Mr John Jackson, proctor of Lichfield Cathedralfl. 1740s–1790s. Also Bookseller and Printer in Lichfield. When Darwin left Lichfield in 1781, Jackson took over his botanical garden.   His daughter, Miss Mary A(nn) Jackson of Lichfield  (fl. 1830s–1840s), was a botanical illustrator,  and author of Botanical Terms illustrated (1842) and Pictorial Flora (1840)) to translate the works of the Swedish botanist Carl Linnaeus from Latin into English. This took seven years. The result was two publications: A System of Vegetables between 1783 and 1785, and The Families of Plants in 1787. In these volumes, Darwin coined many of the English names of plants that we use today.\n\nDarwin then wrote The Loves of the Plants, a long poem, which was a popular rendering of Linnaeus'  works. Darwin also wrote Economy of Vegetation, and together the two were published as The Botanic Garden. Among other writers he influenced were Anna Seward and Maria Jacson.\n\nZoonomia \n\nDarwin's most important scientific work, Zoonomia (1794–1796), contains a system of pathology and a chapter on 'Generation'. In the latter, he anticipated some of the views of Jean-Baptiste Lamarck, which foreshadowed the modern theory of evolution. Erasmus Darwin's works were read and commented on by his grandson Charles Darwin the naturalist. Erasmus Darwin based his theories on David Hartley's psychological theory of associationism.Allen, Richard C. 1999. David Hartley on human nature. Albany, N.Y.: SUNY Press.  The essence of his views is contained in the following passage, which he follows up with the conclusion that one and the same kind of living filament is and has been the cause of all organic life:\n\nWould it be too bold to imagine, that in the great length of time, since the earth began to exist, perhaps millions of ages before the commencement of the history of mankind, would it be too bold to imagine, that all warm-blooded animals have arisen from one living filament, which THE GREAT FIRST CAUSE endued with animality, with the power of acquiring new parts, attended with new propensities, directed by irritations, sensations, volitions, and associations; and thus possessing the faculty of continuing to improve by its own inherent activity, and of delivering down those improvements by generation to its posterity, world without end![http://www.gutenberg.org/files/15707/15707-h/15707-h.htm#sect_XXXIX Erasmus Darwin, Zoonomia: Project Gutenberg text XXIX.4.8] \n\nErasmus Darwin also anticipated survival of the fittest in Zoönomia mainly when writing about the \"three great objects of desire\" for every organism: \"lust, hunger, and security.\"  A similar \"survival of the fittest\" view in Zoönomia is Erasmus' view on how a species \"should\" propagate itself. Erasmus' idea that \"the strongest and most active animal should propagate the species, which should thence become improved\".  Today, this is called the theory of survival of the fittest.  Interestingly, his grandson Charles Darwin, much less libidinous and who led more of an invalid life, and who is not known to have illegitimately fathered children, or fathered children he did not plan, acknowledge and raise, posited the different and fuller theory of natural selection. Charles' theory was that natural selection is the inheritance of changed genetic characteristics that are better adaptations to the environment; these are not necessarily based in \"strength\" and \"activity\", which themselves ironically can lead to the overpopulation that results in natural selection yielding nonsurvivors of genetic traits.\n\nErasmus Darwin was familiar with the earlier proto-evolutionary thinking of James Burnett, Lord Monboddo, and cited him in his 1803 work Temple of Nature.\n\nPoem on evolution \n\nErasmus Darwin offered the first glimpse of his theory of evolution, obliquely, in a question at the end of a long footnote to his popular poem The Loves of the Plants (1789), which was republished throughout the 1790s in several editions as The Botanic Garden. His poetic concept was to anthropomorphise the stamen (male) and pistil (female) sexual organs, as bride and groom. In this stanza on the flower Curcuma (also Flax and Turmeric) the \"youths\" are infertile, and he devotes the footnote to other examples of neutered organs in flowers, insect castes, and finally associates this more broadly with many popular and well-known cases of vestigial organs (male nipples, the third and fourth wings of flies, etc.)\n\nWoo'd with long care, CURCUMA cold and shy\nMeets her fond husband with averted eye:\nFour beardless youths the obdurate beauty move\nWith soft attentions of Platonic love.\n\nDarwin's final long poem, The Temple of Nature was published posthumously in 1803.  The poem was originally titled The Origin of Society.  It is considered his best poetic work. It centres on his own conception of evolution. The poem traces the progression of life from micro-organisms to civilised society. The poem contains a passage that describes the struggle for existence.\n\nHis poetry was admired by Wordsworth, although Coleridge was intensely critical, writing, \"I absolutely nauseate Darwin's poem\".\nIt often made reference to his interests in science; for example botany and steam engines.\n\nEducation of women \n\nThe last two leaves of Darwin's A plan for the conduct of female education in boarding schools (1797) contain a book list, an apology for the work, and an advert for \"Miss Parkers School\". The work probably resulted from his liaison with Mary Parker. \nThe school advertised on the last page is the one he set up in Ashbourne, Derbyshire for their two illegitimate children, Susanna and Mary.\n\nDarwin regretted that a good education had not been generally available to women in Britain in his time, and drew on the ideas of Locke, Rousseau, and Genlis in organising his thoughts. Addressing the education of middle class girls, Darwin argued that amorous romance novels were inappropriate and that they should seek simplicity in dress. He contends that young women should be educated in schools, rather than privately at home, and learn appropriate subjects. These subjects include physiognomy, physical exercise, botany, chemistry, mineralogy, and experimental philosophy. They should familiarise themselves with arts and manufactures through visits to sites like Coalbrookdale, and Wedgwood's potteries; they should learn how to handle money, and study modern languages. Darwin's educational philosophy took the view that men and women should have different, capabilities, skills, spheres, and interests, where the woman's education was designed to support and serve male agency, accomplishment and financial reward and relieve him from daily responsibility for children and chores of life.DNB entry for Erasmus Darwin. Oxford. In the context of the times, this program may be read as a modernising influence in the sense that the woman was at least to learn about the \"man's world\", although not be allowed to participate in it. However, the text was written seven years after A Vindication of the Rights of Woman by Mary Wollstonecraft, which has the central argument that women should be educated in a rational manner to give them the opportunity to contribute to society.\n\nSome women of Darwin's era were receiving more substantial educations and participating in the broader world.  An example is Susanna Wright, who was raised in Lancashire and became an American colonist associated with the Midlands Enlightenment. It is not known whether Darwin and Wright knew each other, although they definitely knew many people in common.  Other women who received substantial educations and who participated in the broader world albeit sometimes anonymously, whom Darwin definitely knew, were Maria Jacson and Anna Seward.\n\nLunar Society \n\nThe Lunar Society: these dates indicate the year in which Darwin became friends with these people, who, in turn, became members of the Lunar Society. The Lunar Society existed from 1765 to 1813.\n\nBefore 1765:\n* Matthew Boulton, originally a buckle maker in Birmingham\n* John Whitehurst of Derby, maker of clocks and scientific instruments, pioneer of geology\nAfter 1765:\n* Josiah Wedgwood, potter 1765\n* Dr. William Small, 1765, man of science, formerly Professor of Natural Philosophy at the College of William and Mary, where Thomas Jefferson was an appreciative pupil\n* Richard Lovell Edgeworth, 1766, inventor\n* James Watt, 1767, improver of steam engine\n* James Keir, 1767, pioneer of the chemical industry\n* Thomas Day, 1768, eccentric and author\n* Dr. William Withering, 1775, the death of Dr. Small left an opening for a physician in the group.\n* Joseph Priestley, 1780, experimental chemist and discoverer of many substances.\n* Samuel Galton, 1782, a Quaker gunmaker with a taste for science, took Darwin's place after Darwin moved to Derby.\n\nDarwin also established a lifelong friendship with Benjamin Franklin, who shared Darwin's support for the American and French revolutions. The Lunar Society was instrumental as an intellectual driving force behind England's Industrial Revolution.\n\nThe members of the Lunar Society, and especially Darwin, opposed the slave trade. He attacked it in The Botanic Garden (1789–1791), and in The Loves of Plants (1789), The Economy of Vegetation (1791), and the Phytologia (1800).\n\nOther activities \n\nIn addition to the Lunar Society, Erasmus Darwin belonged to the influential Derby Philosophical Society, as did his brother-in-law Samuel Fox (see family tree below). He experimented with the use of air and gases to alleviate infections and cancers in patients. A Pneumatic Institution was established at Clifton in 1799 for clinically testing these ideas. He conducted research into the formation of clouds, on which he published in 1788. He also inspired Robert Weldon's Somerset Coal Canal caisson lock.\n\nMary Shelley in her introduction to the 1831 edition of Frankenstein notes that some unspecified \"experiments of Dr. Darwin\" were part of the evening discussion topics leading up to her inspiration and creation of her novel.Shelley, Mary. [http://www.gutenberg.org/files/42324/42324-h/42324-h.htm \"Introduction\" Frankenstein (1831 edition)] Gutenberg\"Many and long were the conversations between Lord Byron and Shelley, to which I was a devout but nearly silent listener. ... They talked of the experiments of Dr. Darwin, (I speak not of what the Doctor really did, or said that he did, but, as more to my purpose, of what was then spoken of as having been done by him,) who preserved a piece of vermicelli in a glass case, till by some extraordinary means it began to move with voluntary motion.\" [underlining added]\n\nCosmological speculation \n\nContemporary literature dates the cosmological theories of the Big Bang and Big Crunch to the 19th and 20th centuries. However Erasmus Darwin had speculated on these sorts of events in The Botanic Garden, A Poem in Two Parts: Part 1, The Economy of Vegetation, 1791:\n\nRoll on, ye Stars! exult in youthful prime,Mark with bright curves the printless steps of Time;Near and more near your beamy cars approach,And lessening orbs on lessening orbs encroach; —Flowers of the sky! ye too to age must yield,Frail as your silken sisters of the field.Star after star from Heaven's high arch shall rush,Suns sink on suns, and systems, systems crush,Headlong, extinct, to one dark centre fall,And death and night and chaos mingle all:— Till o'er the wreck, emerging from the storm,Immortal Nature lifts her changeful form,Mounts from her funeral pyre on wings of flame,And soars and shines, another and the same!\n\nInventions \n\nDarwin was the inventor of several devices, though he did not patent any.  He believed this would damage his reputation as a doctor, and encouraged his friends to patent their own modifications of his designs.\n* A horizontal windmill, which he designed for Josiah Wedgwood (who would be Charles Darwin's other grandfather, see family tree below).\n* A carriage that would not tip over (1766).\n* A steering mechanism for his carriage, known today as the Ackermann linkage, that would be adopted by cars 130 years later (1759).\n* A speaking machine, which was a mechanical larynx made of wood, silk, and leather and pronounced several sounds so well ‘as to deceive all who heard it unseen’(at Clifton in 1799).\n* A canal lift for barges.\n* A minute artificial bird.\n* A copying machine (1778).\n* A variety of weather monitoring machines.\n\nRocket engine \n\nIn notes dating to 1779, Darwin made a sketch of a simple hydrogen-oxygen rocket engine, with gas tanks connected by plumbing and pumps to an elongated combustion chamber and expansion nozzle, a concept not to be seen again until one century later.\n\nMajor publications \n\n* Erasmus Darwin, A Botanical Society at Lichfield. A System of Vegetables, according to their classes, orders... translated from the 13th edition of Linnaeus’ Systema Vegetabiliium. 2 vols., 1783, Lichfield, J. Jackson, for Leigh and Sotheby, London.\n* Erasmus Darwin, A Botanical Society at Lichfield. The Families of Plants with their natural characters...Translated from the last edition of Linnaeus’ Genera Plantarum. 1787, Lichfield, J. Jackson, for J. Johnson, London.\n* Erasmus Darwin, The Botanic Garden, Part I, The Economy of Vegetation. 1791 London, J. Johnson.\n* Part II, The Loves of the Plants. 1789, London, J. Johnson.\n* Erasmus Darwin, Zoonomia; or, The Laws of Organic Life, 1794, Part I. London, J. Johnson,\n* Part I–III. 1796, London, J. Johnson.\n*  (last two leaves contain a book list, an apology for the work, and an advert for \"Miss Parkers School\".)\n* Erasmus Darwin, Phytologia; or, The Philosophy of Agriculture and Gardening. 1800, London, J. Johnson.\n* Erasmus Darwin, The Temple of Nature; or, The Origin of Society. 1803, London, J. Johnson.\n\nFamily tree \n\nAppearances \n\n* Charles Sheffield, an author noted largely for hard science fiction, wrote a number of stories featuring Darwin in a manner quite similar to Sherlock Holmes. These stories were collected in a book, The Amazing Dr. Darwin.\n* Darwin's opposition to slavery in poetry was included by Benjamin Zephaniah in a reading. This inspired the establishment of the [http://www.infection.bham.ac.uk/BPAG/Dub/dub.html Genomic Dub Collective], whose album includes quotations from Erasmus \"Ras\" Darwin, his grandson Charles Darwin and Haile Selassie.\n* The forgetting of Erasmus' designs for a rocket is a major plot point in Stephen Baxter's tale of alternate universes, Manifold: Origin.\n* Phrases from Darwin's poem The Botanic Garden are used as chapter headings in The Pornographer of Vienna by Lewis Crofts.\n* British poet J.H. Prynne took on the pseudonym Erasmus W. Darwin for his \"plant time\" bulletins in the pages of Bean News (1972).\n* A building on the Nottingham Trent University Clifton Campus is named after him. It is the centre for science teaching, academic offices and study space.\n* Erasmus Darwin appears as a character in Sergey Lukyanenko's novel New Watch as a Dark Other and a prophet living in Regent's Park Estate.\n\nSurviving houses\n\nErasmus Darwin House, his home in Lichfield, is now a museum dedicated to Erasmus Darwin and his life's work. A school in nearby Chasetown recently converted to Academy status and is now known as Erasmus Darwin Academy.\n\nWorks \n\n* Darwin, Erasmus. (1794–96). Zoonomia. J. Johnson (reissued by Cambridge University Press, 2009; )\n*",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Erasmus Darwin" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9299" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Erasmus Darwin (12 December 173118 April 1802) was an English physician. One of the key thinkers of the Midlands Enlightenment, he was also a natural philosopher, physiologist, slave-trade abolitionist, inventor and poet.\n\nHis poems included much natural history, including a statement of evolution and the relatedness of all forms of life.\n\nHe was a member of the Darwin–Wedgwood family, which includes his grandsons Charles Darwin and Francis Galton. Darwin was a founding member of the Lunar Society of Birmingham, a discussion group of pioneering industrialists and natural philosophers.\n\nHe turned down an invitation of George III's to become a physician to the King.\n\nEarly life and education \n\nDarwin was born in 1731 at Elston Hall, Nottinghamshire near Newark-on-Trent, England, the youngest of seven children of Robert Darwin of Elston (12 August 1682 – 20 November 1754), a lawyer and physician, and his wife Elizabeth Hill (1702–97). The name Erasmus had been used by a number of his family and derives from his ancestor Erasmus Earle, Common Sergent of England under Oliver Cromwell.Burke's Landed Gentry, Darwin formerly of Downe, 1966 His siblings were: \n* Robert Darwin (17 October 1724 – 4 November 1816)\n* Elizabeth Darwin (15 September 1725 – 8 April 1800)\n* William Alvey Darwin (3 October 1726 – 7 October 1783)\n* Anne Darwin (12 November 1727 – 3 August 1813)\n* Susannah Darwin (10 April 1729 – 29 September 1789)\n* Charles Darwin, rector of Elston (28 September 1730 – 24 May 1805)\n\nHe was educated at Chesterfield Grammar School, then later at St John's College, Cambridge. He obtained his medical education at the University of Edinburgh Medical School. Whether Darwin ever obtained the formal degree of MD is not known. Darwin settled in 1756 as a physician at Nottingham, but met with little success and so moved the following year to Lichfield to try to establish a practice there. A few weeks after his arrival, using a novel course of treatment, he restored the health of a young man whose death seemed inevitable. This ensured his success in the new locale. Darwin was a highly successful physician for more than fifty years in the Midlands. George III invited him to be Royal Physician, but Darwin declined. In Lichfield, Darwin wrote \"didactic poetry, developed his system of evolution, and invented amongst other things, a carriage steering mechanism, a manuscript copier and a speaking machine.\n\nPersonal life \n\nDarwin married twice and had 14 children, including two illegitimate daughters by an employee, and, possibly, at least one further illegitimate daughter.\n\nIn 1757 he married Mary (Polly) Howard (1740–1770). They had four sons and one daughter, two of whom (a son and a daughter) died in infancy:\n\n* Charles Darwin (1758–1778)\n* Erasmus Darwin II (1759–1799)\n* Elizabeth Darwin (1763, survived 4 months)\n* Robert Waring Darwin (1766–1848), father of the naturalist Charles Darwin\n* William Alvey Darwin (1767, survived 19 days)\n\nThe first Mrs. Darwin died in 1770. A governess, Mary Parker, was hired to look after Robert. By late 1771, employer and employee had become intimately involved and together they had two illegitimate daughters:\n* Susanna Parker (1772–1856)\n* Mary Parker Jr (1774–1859)\n\nSusanna and Mary Jr later established a boarding school for girls. In 1782, Mary Sr (the governess) married Joseph Day (1745–1811), a Birmingham merchant, and moved away.\n\nDarwin may have fathered another child, this time with a married woman. A Lucy Swift gave birth in 1771 to a baby, also named Lucy, who was christened a daughter of her mother and William Swift, but there is reason to believe the father was really Darwin. Lucy Jr. married John Hardcastle in Derby in 1792 and their daughter, Mary, married Francis Boott, the physician.\n\nIn 1775 Darwin met Elizabeth Pole, daughter of Charles Colyear, 2nd Earl of Portmore, and wife of Colonel Edward Pole (1718–1780); but as she was married, Darwin could only make his feelings known for her through poetry. When Edward Pole died, Darwin married Elizabeth and moved to her home, Radbourne Hall, four miles (6 km) west of Derby. The hall and village are these days known as Radbourne. In 1782, they moved to Full Street, Derby. They had four sons, one of whom died in infancy, and three daughters:\n\n* Edward Darwin (1782–1829)\n* Frances Ann Violetta Darwin (1783–1874), married Samuel Tertius Galton, was the mother of Francis Galton\n* Emma Georgina Elizabeth Darwin (1784–1818)\n* Sir Francis Sacheverel Darwin (1786–1859)\n* John Darwin (1787–1818)\n* Henry Darwin (1789–1790), died in infancy.\n* Harriet Darwin (1790–1825), married Admiral Thomas James Maling\n\nDarwin's personal appearance is described in unflattering detail in his Biographical Memoirs, printed by the Monthly Magazine in 1802. Darwin, the description reads, \"was of middle stature, in person gross and corpulent; his features were coarse, and his countenance heavy; if not wholly void of animation, it certainly was by no means expressive. The print of him, from a painting of Mr. Wright, is a good likeness. In his gait and dress he was rather clumsy and slovenly, and frequently walked with his tongue hanging out of his mouth.\"\n\nDeath \n\nDarwin died suddenly on 18 April 1802, weeks after having moved to Breadsall Priory, just north of Derby. The Monthly Magazine of 1802, in its Biographical Memoirs of the Late Dr. Darwin, reports that \"during the last few years, Dr. Darwin was much subject to inflammation in his breast and lungs; he had a very serious attack of this disease in the course of the last Spring, from which, after repeated bleedings, by himself and a surgeon, he with great difficulty recovered.\"\n\nDarwin's death, the Biographical Memoirs continues, \"is variously accounted for: it is supposed to have been caused by the cold fit of an inflammatory fever. Dr. Fox, of Derby, considers the disease which occasioned it to have been angina pectoris; but Dr. Garlicke, of the same place, thinks this opinion not sufficiently well founded. Whatever was the disease, it is not improbable, surely, that the fatal event was hastened by the violent fit of passion with which he was seized in the morning.\"\n\nHis body is buried in All Saints Church, Breadsall.\n\nErasmus Darwin is commemorated on one of the Moonstones, a series of monuments in Birmingham.\n\nWritings \n\nBotanical works and the Lichfield Botanical Society \n\nDarwin formed the Lichfield Botanical Society (despite the name, composed of only three men, Erasmus Darwin, Sir Brooke Boothby and Mr John Jackson, proctor of Lichfield Cathedralfl. 1740s–1790s. Also Bookseller and Printer in Lichfield. When Darwin left Lichfield in 1781, Jackson took over his botanical garden.   His daughter, Miss Mary A(nn) Jackson of Lichfield  (fl. 1830s–1840s), was a botanical illustrator,  and author of Botanical Terms illustrated (1842) and Pictorial Flora (1840)) to translate the works of the Swedish botanist Carl Linnaeus from Latin into English. This took seven years. The result was two publications: A System of Vegetables between 1783 and 1785, and The Families of Plants in 1787. In these volumes, Darwin coined many of the English names of plants that we use today.\n\nDarwin then wrote The Loves of the Plants, a long poem, which was a popular rendering of Linnaeus'  works. Darwin also wrote Economy of Vegetation, and together the two were published as The Botanic Garden. Among other writers he influenced were Anna Seward and Maria Jacson.\n\nZoonomia \n\nDarwin's most important scientific work, Zoonomia (1794–1796), contains a system of pathology and a chapter on 'Generation'. In the latter, he anticipated some of the views of Jean-Baptiste Lamarck, which foreshadowed the modern theory of evolution. Erasmus Darwin's works were read and commented on by his grandson Charles Darwin the naturalist. Erasmus Darwin based his theories on David Hartley's psychological theory of associationism.Allen, Richard C. 1999. David Hartley on human nature. Albany, N.Y.: SUNY Press.  The essence of his views is contained in the following passage, which he follows up with the conclusion that one and the same kind of living filament is and has been the cause of all organic life:\n\nWould it be too bold to imagine, that in the great length of time, since the earth began to exist, perhaps millions of ages before the commencement of the history of mankind, would it be too bold to imagine, that all warm-blooded animals have arisen from one living filament, which THE GREAT FIRST CAUSE endued with animality, with the power of acquiring new parts, attended with new propensities, directed by irritations, sensations, volitions, and associations; and thus possessing the faculty of continuing to improve by its own inherent activity, and of delivering down those improvements by generation to its posterity, world without end![http://www.gutenberg.org/files/15707/15707-h/15707-h.htm#sect_XXXIX Erasmus Darwin, Zoonomia: Project Gutenberg text XXIX.4.8] \n\nErasmus Darwin also anticipated survival of the fittest in Zoönomia mainly when writing about the \"three great objects of desire\" for every organism: \"lust, hunger, and security.\"  A similar \"survival of the fittest\" view in Zoönomia is Erasmus' view on how a species \"should\" propagate itself. Erasmus' idea that \"the strongest and most active animal should propagate the species, which should thence become improved\".  Today, this is called the theory of survival of the fittest.  Interestingly, his grandson Charles Darwin, much less libidinous and who led more of an invalid life, and who is not known to have illegitimately fathered children, or fathered children he did not plan, acknowledge and raise, posited the different and fuller theory of natural selection. Charles' theory was that natural selection is the inheritance of changed genetic characteristics that are better adaptations to the environment; these are not necessarily based in \"strength\" and \"activity\", which themselves ironically can lead to the overpopulation that results in natural selection yielding nonsurvivors of genetic traits.\n\nErasmus Darwin was familiar with the earlier proto-evolutionary thinking of James Burnett, Lord Monboddo, and cited him in his 1803 work Temple of Nature.\n\nPoem on evolution \n\nErasmus Darwin offered the first glimpse of his theory of evolution, obliquely, in a question at the end of a long footnote to his popular poem The Loves of the Plants (1789), which was republished throughout the 1790s in several editions as The Botanic Garden. His poetic concept was to anthropomorphise the stamen (male) and pistil (female) sexual organs, as bride and groom. In this stanza on the flower Curcuma (also Flax and Turmeric) the \"youths\" are infertile, and he devotes the footnote to other examples of neutered organs in flowers, insect castes, and finally associates this more broadly with many popular and well-known cases of vestigial organs (male nipples, the third and fourth wings of flies, etc.)\n\nWoo'd with long care, CURCUMA cold and shy\nMeets her fond husband with averted eye:\nFour beardless youths the obdurate beauty move\nWith soft attentions of Platonic love.\n\nDarwin's final long poem, The Temple of Nature was published posthumously in 1803.  The poem was originally titled The Origin of Society.  It is considered his best poetic work. It centres on his own conception of evolution. The poem traces the progression of life from micro-organisms to civilised society. The poem contains a passage that describes the struggle for existence.\n\nHis poetry was admired by Wordsworth, although Coleridge was intensely critical, writing, \"I absolutely nauseate Darwin's poem\".\nIt often made reference to his interests in science; for example botany and steam engines.\n\nEducation of women \n\nThe last two leaves of Darwin's A plan for the conduct of female education in boarding schools (1797) contain a book list, an apology for the work, and an advert for \"Miss Parkers School\". The work probably resulted from his liaison with Mary Parker. \nThe school advertised on the last page is the one he set up in Ashbourne, Derbyshire for their two illegitimate children, Susanna and Mary.\n\nDarwin regretted that a good education had not been generally available to women in Britain in his time, and drew on the ideas of Locke, Rousseau, and Genlis in organising his thoughts. Addressing the education of middle class girls, Darwin argued that amorous romance novels were inappropriate and that they should seek simplicity in dress. He contends that young women should be educated in schools, rather than privately at home, and learn appropriate subjects. These subjects include physiognomy, physical exercise, botany, chemistry, mineralogy, and experimental philosophy. They should familiarise themselves with arts and manufactures through visits to sites like Coalbrookdale, and Wedgwood's potteries; they should learn how to handle money, and study modern languages. Darwin's educational philosophy took the view that men and women should have different, capabilities, skills, spheres, and interests, where the woman's education was designed to support and serve male agency, accomplishment and financial reward and relieve him from daily responsibility for children and chores of life.DNB entry for Erasmus Darwin. Oxford. In the context of the times, this program may be read as a modernising influence in the sense that the woman was at least to learn about the \"man's world\", although not be allowed to participate in it. However, the text was written seven years after A Vindication of the Rights of Woman by Mary Wollstonecraft, which has the central argument that women should be educated in a rational manner to give them the opportunity to contribute to society.\n\nSome women of Darwin's era were receiving more substantial educations and participating in the broader world.  An example is Susanna Wright, who was raised in Lancashire and became an American colonist associated with the Midlands Enlightenment. It is not known whether Darwin and Wright knew each other, although they definitely knew many people in common.  Other women who received substantial educations and who participated in the broader world albeit sometimes anonymously, whom Darwin definitely knew, were Maria Jacson and Anna Seward.\n\nLunar Society \n\nThe Lunar Society: these dates indicate the year in which Darwin became friends with these people, who, in turn, became members of the Lunar Society. The Lunar Society existed from 1765 to 1813.\n\nBefore 1765:\n* Matthew Boulton, originally a buckle maker in Birmingham\n* John Whitehurst of Derby, maker of clocks and scientific instruments, pioneer of geology\nAfter 1765:\n* Josiah Wedgwood, potter 1765\n* Dr. William Small, 1765, man of science, formerly Professor of Natural Philosophy at the College of William and Mary, where Thomas Jefferson was an appreciative pupil\n* Richard Lovell Edgeworth, 1766, inventor\n* James Watt, 1767, improver of steam engine\n* James Keir, 1767, pioneer of the chemical industry\n* Thomas Day, 1768, eccentric and author\n* Dr. William Withering, 1775, the death of Dr. Small left an opening for a physician in the group.\n* Joseph Priestley, 1780, experimental chemist and discoverer of many substances.\n* Samuel Galton, 1782, a Quaker gunmaker with a taste for science, took Darwin's place after Darwin moved to Derby.\n\nDarwin also established a lifelong friendship with Benjamin Franklin, who shared Darwin's support for the American and French revolutions. The Lunar Society was instrumental as an intellectual driving force behind England's Industrial Revolution.\n\nThe members of the Lunar Society, and especially Darwin, opposed the slave trade. He attacked it in The Botanic Garden (1789–1791), and in The Loves of Plants (1789), The Economy of Vegetation (1791), and the Phytologia (1800).\n\nOther activities \n\nIn addition to the Lunar Society, Erasmus Darwin belonged to the influential Derby Philosophical Society, as did his brother-in-law Samuel Fox (see family tree below). He experimented with the use of air and gases to alleviate infections and cancers in patients. A Pneumatic Institution was established at Clifton in 1799 for clinically testing these ideas. He conducted research into the formation of clouds, on which he published in 1788. He also inspired Robert Weldon's Somerset Coal Canal caisson lock.\n\nMary Shelley in her introduction to the 1831 edition of Frankenstein notes that some unspecified \"experiments of Dr. Darwin\" were part of the evening discussion topics leading up to her inspiration and creation of her novel.Shelley, Mary. [http://www.gutenberg.org/files/42324/42324-h/42324-h.htm \"Introduction\" Frankenstein (1831 edition)] Gutenberg\"Many and long were the conversations between Lord Byron and Shelley, to which I was a devout but nearly silent listener. ... They talked of the experiments of Dr. Darwin, (I speak not of what the Doctor really did, or said that he did, but, as more to my purpose, of what was then spoken of as having been done by him,) who preserved a piece of vermicelli in a glass case, till by some extraordinary means it began to move with voluntary motion.\" [underlining added]\n\nCosmological speculation \n\nContemporary literature dates the cosmological theories of the Big Bang and Big Crunch to the 19th and 20th centuries. However Erasmus Darwin had speculated on these sorts of events in The Botanic Garden, A Poem in Two Parts: Part 1, The Economy of Vegetation, 1791:\n\nRoll on, ye Stars! exult in youthful prime,Mark with bright curves the printless steps of Time;Near and more near your beamy cars approach,And lessening orbs on lessening orbs encroach; —Flowers of the sky! ye too to age must yield,Frail as your silken sisters of the field.Star after star from Heaven's high arch shall rush,Suns sink on suns, and systems, systems crush,Headlong, extinct, to one dark centre fall,And death and night and chaos mingle all:— Till o'er the wreck, emerging from the storm,Immortal Nature lifts her changeful form,Mounts from her funeral pyre on wings of flame,And soars and shines, another and the same!\n\nInventions \n\nDarwin was the inventor of several devices, though he did not patent any.  He believed this would damage his reputation as a doctor, and encouraged his friends to patent their own modifications of his designs.\n* A horizontal windmill, which he designed for Josiah Wedgwood (who would be Charles Darwin's other grandfather, see family tree below).\n* A carriage that would not tip over (1766).\n* A steering mechanism for his carriage, known today as the Ackermann linkage, that would be adopted by cars 130 years later (1759).\n* A speaking machine, which was a mechanical larynx made of wood, silk, and leather and pronounced several sounds so well ‘as to deceive all who heard it unseen’(at Clifton in 1799).\n* A canal lift for barges.\n* A minute artificial bird.\n* A copying machine (1778).\n* A variety of weather monitoring machines.\n\nRocket engine \n\nIn notes dating to 1779, Darwin made a sketch of a simple hydrogen-oxygen rocket engine, with gas tanks connected by plumbing and pumps to an elongated combustion chamber and expansion nozzle, a concept not to be seen again until one century later.\n\nMajor publications \n\n* Erasmus Darwin, A Botanical Society at Lichfield. A System of Vegetables, according to their classes, orders... translated from the 13th edition of Linnaeus’ Systema Vegetabiliium. 2 vols., 1783, Lichfield, J. Jackson, for Leigh and Sotheby, London.\n* Erasmus Darwin, A Botanical Society at Lichfield. The Families of Plants with their natural characters...Translated from the last edition of Linnaeus’ Genera Plantarum. 1787, Lichfield, J. Jackson, for J. Johnson, London.\n* Erasmus Darwin, The Botanic Garden, Part I, The Economy of Vegetation. 1791 London, J. Johnson.\n* Part II, The Loves of the Plants. 1789, London, J. Johnson.\n* Erasmus Darwin, Zoonomia; or, The Laws of Organic Life, 1794, Part I. London, J. Johnson,\n* Part I–III. 1796, London, J. Johnson.\n*  (last two leaves contain a book list, an apology for the work, and an advert for \"Miss Parkers School\".)\n* Erasmus Darwin, Phytologia; or, The Philosophy of Agriculture and Gardening. 1800, London, J. Johnson.\n* Erasmus Darwin, The Temple of Nature; or, The Origin of Society. 1803, London, J. Johnson.\n\nFamily tree \n\nAppearances \n\n* Charles Sheffield, an author noted largely for hard science fiction, wrote a number of stories featuring Darwin in a manner quite similar to Sherlock Holmes. These stories were collected in a book, The Amazing Dr. Darwin.\n* Darwin's opposition to slavery in poetry was included by Benjamin Zephaniah in a reading. This inspired the establishment of the [http://www.infection.bham.ac.uk/BPAG/Dub/dub.html Genomic Dub Collective], whose album includes quotations from Erasmus \"Ras\" Darwin, his grandson Charles Darwin and Haile Selassie.\n* The forgetting of Erasmus' designs for a rocket is a major plot point in Stephen Baxter's tale of alternate universes, Manifold: Origin.\n* Phrases from Darwin's poem The Botanic Garden are used as chapter headings in The Pornographer of Vienna by Lewis Crofts.\n* British poet J.H. Prynne took on the pseudonym Erasmus W. Darwin for his \"plant time\" bulletins in the pages of Bean News (1972).\n* A building on the Nottingham Trent University Clifton Campus is named after him. It is the centre for science teaching, academic offices and study space.\n* Erasmus Darwin appears as a character in Sergey Lukyanenko's novel New Watch as a Dark Other and a prophet living in Regent's Park Estate.\n\nSurviving houses\n\nErasmus Darwin House, his home in Lichfield, is now a museum dedicated to Erasmus Darwin and his life's work. A school in nearby Chasetown recently converted to Academy status and is now known as Erasmus Darwin Academy.\n\nWorks \n\n* Darwin, Erasmus. (1794–96). Zoonomia. J. Johnson (reissued by Cambridge University Press, 2009; )\n*. Erasmus Darwin. http://en.wikipedia.org/?curid=9299."
  }
}
