{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14814",
  "eid" : "17f293f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778549423,
  "textBody" : "Dr. Henry Walton \"Indiana\" Jones Jr. is a title character and protagonist of the Indiana Jones franchise. George Lucas created the character in homage to the action heroes of 1930s film serials. The character first appeared in the 1981 film Raiders of the Lost Ark, to be followed by Indiana Jones and the Temple of Doom in 1984, Indiana Jones and the Last Crusade in 1989, The Young Indiana Jones Chronicles from 1992 to 1996, and Indiana Jones and the Kingdom of the Crystal Skull in 2008. The character is also featured in novels, comics, video games, and other media. Jones is also featured in several Disney theme parks, including the Indiana Jones Adventure, Indiana Jones et le Temple du Péril, and Epic Stunt Spectacular! attractions.\n\nJones is most famously portrayed by Harrison Ford and has also been portrayed by River Phoenix (as the young Jones in The Last Crusade) and in the television series The Young Indiana Jones Chronicles by Corey Carrier, Sean Patrick Flanery, and George Hall. Doug Lee has supplied the voice of Jones for two LucasArts video games, Indiana Jones and the Fate of Atlantis and Indiana Jones and the Infernal Machine, David Esch supplied his voice for Indiana Jones and the Emperor's Tomb, and John Armstrong for Indiana Jones and the Staff of Kings.[http://www.imdb.com/title/tt1363107/ Indiana Jones and the Staff of Kings (Video Game 2009) – IMDb]\n\nThe character is distinguished by his appearance (bullwhip, fedora, satchel and leather jacket), sense of humor, deep knowledge of many ancient civilizations and languages, and fear of snakes.\n\nSince his first appearance in Raiders of the Lost Ark, Indiana Jones has become one of cinema's most famous characters. In 2003, the American Film Institute ranked him the second greatest film hero of all time. He was also named the 1st Greatest Movie Character by Empire magazine. Entertainment Weekly ranked Indy 2nd on their list of The All-Time Coolest Heroes in Pop Culture. Premiere magazine also placed Indy at number 7 on their list of The 100 Greatest Movie Characters of All Time.\n\nAppearances\n\nFilm\n\n* 1981 film Raiders of the Lost Ark\n* 1984 prequel film Indiana Jones and the Temple of Doom\n* 1989 film Indiana Jones and the Last Crusade\n* 2008 film Indiana Jones and the Kingdom of the Crystal Skull\n\nA native of Princeton, New Jersey, Indiana Jones was introduced as a tenured professor of archeology in the 1981 film Raiders of the Lost Ark, set in 1936. The character is an adventurer reminiscent of the 1930s film serial treasure hunters and pulp action heroes, whose research is funded by Marshall College (named after producer Frank Marshall), a fictional college in Connecticut, where he is a professor of archaeology.  He also attended the University of Chicago.\n\nIn this first adventure, he is pitted against the Nazis, who are commissioned by Hitler to recover evidence related to Aryan roots of Nazism. (see Nazi archaeology). In consequence, Dr Jones travels the world to prevent them from recovering the Ark of the Covenant (see also Biblical archaeology). He is aided by Marion Ravenwood and Sallah. The Nazis are led by Jones's archrival, a Nazi-sympathizing French archaeologist named René Belloq, and Arnold Toht, a sinister Gestapo agent.\n\nIn the 1984 prequel, Indiana Jones and the Temple of Doom, set in 1935, Jones travels to India and attempts to free enslaved children and the three Sankara stones from the bloodthirsty Thuggee cult. He is aided by Short Round, a young boy, and is accompanied by singer Willie Scott (Kate Capshaw).\n\nThe third film, 1989's Indiana Jones and the Last Crusade, set in 1938, returned to the formula of the original, reintroducing characters such as Sallah and Marcus Brody, a scene from Professor Jones's classroom (he now teaches at Barnett College), the globe trotting element of multiple locations, and the return of the infamous Nazi mystics, this time trying to find the Holy Grail. The film's introduction, set in 1912, provided some back story to the character, specifically the origin of his fear of snakes, his use of a bullwhip, the scar on his chin, and his hat; the film's epilogue also reveals that \"Indiana\" is not Jones's first name, but a nickname he took from the family dog. The film was a buddy movie of sorts, teaming Jones with his father, often to comical effect. Although Lucas intended to make five Indiana Jones films, Indiana Jones and the Last Crusade was the last for over eighteen years, as he could not think of a good plot element to drive the next installment.\n\nThe 2008 film, Indiana Jones and the Kingdom of the Crystal Skull, is the latest film in the series. Set in 1957, 19 years after the third film, it pits an older, wiser Indiana Jones against Soviet agents bent on harnessing the power of an extraterrestrial device discovered in South America. Jones is aided in his adventure by his former lover, Marion Ravenwood (Karen Allen), and her son—a young greaser named Henry \"Mutt\" Williams (Shia LaBeouf), later revealed to be Jones' unknown child. There were rumors that Harrison Ford will not return for any future installments and LaBeouf will take over the Indy franchise. This film also reveals that Jones was recruited by the Office of Strategic Services during World War II, attaining the rank of Colonel in the United States Army. He is tasked with conducting covert operations with MI6 agent George McHale against the Soviet Union.\n\nIn March 2016, Disney announced a fifth Indiana Jones film currently in development, with Ford and Spielberg set to return to the franchise. The film will be released on July 10, 2020.\n\nAttractions\n\nIndiana Jones is featured at several Walt Disney theme park attractions. The Indiana Jones Adventure attractions at Disneyland and Tokyo DisneySea (\"Temple of the Forbidden Eye\" and \"Temple of the Crystal Skull,\" respectively) place Indy at the forefront of two similar archaeological discoveries. These two temples each contain a wrathful deity who threatens the guests who ride through in World War II troop transports. The attractions, some of the most expensive of their kind at the time,url=http://disneyland.disney.go.com/attractions/disneyland/indiana-jones-adventure/ opened in 1995 and 2001, respectively, with sole design credit attributed to Walt Disney Imagineering. Disney did not originally license Harrison Ford's likeness for the American version; nonetheless, a differentiated Indiana Jones audio-animatronic character appears at three points in both attractions. However, the Indiana Jones featured in the DisneySea version does use Harrison Ford's likeness but uses Japanese audio for all of his speaking parts. In 2010, some of the Indy audio-animatronics at the Disneyland version were replaced with ones resembling Ford.[http://www.disunplugged.com/2010/02/08/disneyland-resort-whats-worth-seeing-in-2010/ Disneyland Resort: What’s Worth Seeing in 2010? | The DIS Unplugged Disney Blog]. Disunplugged.com. (2010-02-08). Retrieved on 2012-01-14.\n\nDisneyland Paris also features an Indiana Jones-titled ride where people speed off through ancient ruins in a runaway mine wagon similar to that found in Indiana Jones and the Temple of Doom. Indiana Jones and the Temple of Peril is a looping roller coaster engineered by Intamin, designed by Walt Disney Imagineering, and opened in 1993.\n\nThe Indiana Jones Epic Stunt Spectacular! is a live show that has been presented in the Disney's Hollywood Studios theme park of the Walt Disney World Resort with few changes since the park's 1989 opening, as Disney-MGM Studios. The 25-minute show presents various stunts framed in the context of a feature film production, and recruits members of the audience to participate in the show. Stunt artists in the show re-create and ultimately reveal some of the secrets of the stunts of the Raiders of the Lost Ark films, including the well-known \"running-from-the-boulder\" scene. Stunt performer Anislav Varbanov was fatally injured in August 2009, while rehearsing the popular show. Also at Disney's Hollywood Studios, an audio-animatronic Indiana Jones appears in another attraction; during The Great Movie Ride's Raiders of the Lost Ark segment.\n\nLiterature\n\nGraphic novels\n\nIndy also appears in the 2004 Dark Horse Comics story Into The Great Unknown, collected in Star Wars Tales Volume 5. In this non-canon story bringing together two of Harrison Ford's best roles, Indy and Short Round discover a crash-landed Millennium Falcon in the Pacific Northwest, along with Han Solo's skeleton and the realization that a rumored nearby Sasquatch is in fact Chewbacca. Indy also appears in a series of Marvel Comics.\n\nMovie-tie-in novelizations\n\nThe four Indiana Jones film scripts were novelized and published in the time-frame of the films’ initial releases.All titles, authors, dates of publication, and publishers of these novelizations are from the title and copyright pages of the first editions of each of the cited volumes. Raiders of the Lost Ark was novelized by Campbell Black based on the script by Lawrence Kasdan that was based on the story by George Lucas and Philip Kaufman and published in April 1981 by Ballantine Books; Indiana Jones and the Temple of Doom was novelized by James Kahn and based on the script by Willard Huyck & Gloria Katz that was based on the story by George Lucas and published May 1984 by Ballantine Books; Indiana Jones and the Last Crusade was novelized by Rob MacGregor based on the script by Jeffrey Boam that was based on a story by George Lucas and Menno Meyjes and published June 1989 by Ballantine Books. Nearly 20 years later Indiana Jones and the Kingdom of the Crystal Skull was novelized by James Rollins based on the script by David Koepp based on the story by George Lucas and Jeff Nathanson and published May 2008 by Ballantine Books. In addition, in 2008 to accompany the release of Kingdom of Skulls, Scholastic Books published juvenile novelizations of the four scripts written, successively in the order above, by Ryder Windham, Suzanne Weyn, Ryder Windham, and James Luceno. All these books have been reprinted, with Raiders of the Lost Ark being retitled Indiana Jones and the Raiders of the Lost Ark. While these are the principal titles and authors, there are numerous other volumes derived from the four film properties.\n\nOriginal novels\n\n\tFrom February 1991 through February 1999, twelve original Indiana Jones-themed adult novels were licensed by Lucasfilm, Ltd. and written by three genre authors of the period. Ten years afterward, a thirteenth original novel was added, also written by a popular genre author. The first twelve were published by Bantam Books; the last by Ballantine Books in 2009. (See Indiana Jones franchise for broad descriptions of these original adult novels.) The novels are:All titles, authors, dates of publication, and publishers of these novelizations are from the copyright pages of the first editions of each of the cited volumes.\n\n* Rob MacGregor (author)\n* Indiana Jones and the Peril at Delphi, February 1991.\n* Indiana Jones and the Dance of the Giants, June 1991.\n* Indiana Jones and the Seven Veils, December 1991.\n* Indiana Jones and the Genesis Deluge, February 1992.\n* Indiana Jones and the Unicorn’s Legacy, September 1992.\n* Indiana Jones and the Interior World, December 1992.\n* Martin Caidin (author)\n* Indiana Jones and the Sky Pirates, December 1993.\n* Indiana Jones and the White Witch, April 1994.\n* Max McCoy (author)\n* Indiana Jones and the Philosopher’s Stone, May 1995.\n* Indiana Jones and the Dinosaur Eggs, March 1996.\n* Indiana Jones and the Hollow Earth, March 1997.\n* Indiana Jones and the Secret of the Sphinx, February 1999.\n* Steve Perry (author)\n* Indiana Jones and the Army of the Dead, September 2009.\n\nTelevision\n\nFrom 1992 to 1996, George Lucas executive-produced a television series named The Young Indiana Jones Chronicles, aimed mainly at teenagers and children, which showed many of the important events and historical figures of the early 20th century through the prism of Indiana Jones' life.\n\nThe show initially featured the formula of an elderly (93 to 94 years of age) Indiana Jones played by George Hall introducing a story from his youth by way of an anecdote: the main part of the episode then featured an adventure with either a young adult Indy (16 to 21 years of age) played by Sean Patrick Flanery or a child Indy (8 to 11 years) played by Corey Carrier. One episode, \"Young Indiana Jones and the Mystery of the Blues\", is bookended by Harrison Ford as Indiana Jones, rather than Hall. Later episodes and telemovies did not have this bookend format.\n\nThe bulk of the series centers around the young adult Indiana Jones and his activities during World War I as a 16- to 17-year-old soldier in the Belgian Army and then as an intelligence officer and spy seconded to French intelligence. The child Indy episodes follow the boy's travels around the globe as he accompanies his parents on his father's worldwide lecture tour from 1908 to 1910.\n\nThe show provided some backstory for the films, as well as new information regarding the character. Indiana Jones was born July 1, 1899, and his middle name is Walton (Lucas's middle name). It is also mentioned that he had a sister called Suzie who died as an infant of fever, and that he eventually has a daughter and grandchildren who appear in some episode introductions and epilogues. His relationship with his father, first introduced in Indiana Jones and the Last Crusade, was further fleshed out with stories about his travels with his father as a young boy. Indy damages or loses his right eye sometime between the events in 1957 and the early 1990s, when the \"Old Indy\" segments take place, as the elderly Indiana Jones wears an eyepatch.\n\nIn 1999, Lucas removed the episode introductions and epilogues by George Hall for the VHS and DVD releases, and re-edited the episodes into chronologically ordered feature-length stories. The series title was also changed to The Adventures of Young Indiana Jones.\n\nVideo games\n\nThe character has appeared in several officially licensed games, beginning with adaptations of Raiders of the Lost Ark, Indiana Jones and the Temple of Doom, two adaptations of Indiana Jones and the Last Crusade (one with purely action mechanics, one with an adventure and puzzle based structure) and Indiana Jones' Greatest Adventures, which included the storylines from all three of the original films.\n\nFollowing this, the games branched off into original storylines with Indiana Jones in the Lost Kingdom, Indiana Jones and the Fate of Atlantis, Indiana Jones and the Infernal Machine, Indiana Jones and the Emperor's Tomb and Indiana Jones and the Staff of Kings. Emperor's Tomb sets up Jones's companion Wu Han and the search for Nurhaci's ashes seen at the beginning of Temple of Doom. The first two games were developed by Hal Barwood and starred Doug Lee as the voice of Indiana Jones; Emperor's Tomb had David Esch fill the role and Staff of Kings starred John Armstrong.\n\nIndiana Jones and the Infernal Machine was the first Indy-based game presented in three dimensions, as opposed to 8-bit graphics and side-scrolling games before.\n\nThere is also a small game from Lucas Arts Indiana Jones and His Desktop Adventures. A video game was made for young Indy called Young Indiana Jones and the Instruments of Chaos, as well as a video game version of The Young Indiana Jones Chronicles.\n\nTwo Lego Indiana Jones games have also been released. Lego Indiana Jones: The Original Adventures was released in 2008 and follows the plots of the first three films. It was followed by Lego Indiana Jones 2: The Adventure Continues in late 2009. The sequel includes an abbreviated reprise of the first three films, but focuses on the plot of Indiana Jones and the Kingdom of the Crystal Skull.\n\nSocial gaming company Zynga introduced Indiana Jones to their \"Adventure World\" game in late 2011.\n\nCharacter description and formation\n\n\"Indiana\" Jones's full name is Dr. Henry Walton Jones Jr.,The character's full name is stated in the Corey Carrier narration of the feature-length episode My First Adventure from The Young Indiana Jones Chronicles. and his nickname is often shortened to \"Indy\".\n\nIn his role as a college professor of archaeology, Jones is scholarly and learned in a tweed suit, lecturing on ancient civilizations. At the opportunity to recover important artifacts, Dr. Jones transforms into \"Indiana,\" a \"non-superhero superhero\" image he has concocted for himself. Producer Frank Marshall said, \"Indy [is] a fallible character. He makes mistakes and gets hurt. ... That's the other thing people like: He's a real character, not a character with superpowers.\" Spielberg said there \"was the willingness to allow our leading man to get hurt and to express his pain and to get his mad out and to take pratfalls and sometimes be the butt of his own jokes. I mean, Indiana Jones is not a perfect hero, and his imperfections, I think, make the audience feel that, with a little more exercise and a little more courage, they could be just like him.\" According to Spielberg biographer Douglas Brode, Indiana created his heroic figure so as to escape the dullness of teaching at a school. Both of Indiana's personas reject one another in philosophy, creating a duality. Harrison Ford said the fun of playing the character was because Indiana is both a romantic and a cynic, while scholars have analyzed Indiana as having traits of a lone wolf; a man on a quest; a noble treasure hunter; a hardboiled detective; a human superhero; and an American patriot.\n\nLike many characters in his films, Jones has some autobiographical elements of Spielberg. Indiana lacks a proper father figure because of his strained relationship with his father, Henry Senior. His own contained anger is misdirected towards Professor Abner Ravenwood, his mentor at the University of Chicago, leading to a strained relationship with Marion Ravenwood. The teenage Indiana bases his own look on a figure from the prologue of Indiana Jones and the Last Crusade, after being given his hat. Marcus Brody acts as Indiana's positive role model at the college. Indiana's own insecurities are made worse by the absence of his mother. In Indiana Jones and the Temple of Doom, he becomes the father figure to Willie Scott and Short Round, to survive; he is rescued from Kali's evil by Short Round's dedication. Indiana also saves many enslaved children.\n\nIndiana uses his knowledge of Shiva to defeat Mola Ram. In Raiders, however, he is wise enough to close his eyes in the presence of God in the Ark of the Covenant. By contrast, his rival Rene Belloq is killed for having the audacity to try to communicate directly with God.\n\nIn the prologue of Indiana Jones and the Last Crusade, Jones is seen as a teenager, establishing his look when given a fedora hat. Indiana's intentions are revealed as prosocial, as he believes artifacts \"belong in a museum.\" In the film's climax, Indiana undergoes \"literal\" tests of faith to retrieve the Grail and save his father's life. He also remembers Jesus as a historical figure – a humble carpenter – rather than an exalted figure when he recognizes the simple nature and tarnished appearance of the real Grail amongst a large assortment of much more ornately decorated ones. Henry Senior rescues his son from falling to his death when reaching for the fallen Grail, telling him to \"let it go,\" overcoming his mercenary nature. The Young Indiana Jones Chronicles explains how Indiana becomes solitary and less idealistic following his service in World War I. In Indiana Jones and the Kingdom of the Crystal Skull, Jones is older and wiser, whereas his sidekicks Mutt and Mac are youthfully arrogant and greedy, respectively.\n\nOrigins and inspirations\n\nIndiana Jones is modeled after the strong-jawed heroes of the matinée serials and pulp magazines that George Lucas and Steven Spielberg enjoyed in their childhoods (such as the Republic Pictures serials, and the Doc Savage series). Sir H. Rider Haggard's safari guide/big game hunter Allan Quatermain of King Solomon's Mines, who dates back to 1885, is a notable template for Jones.[https://web.archive.org/web/20081205015223/http://www.superheroflix.com/news/NE0ab607ewPH26 \"Based on a 1885 novel by Henry Rider Haggard, exploits of Allan Quartermain have long served as a template for the Indiana Jones character. King Solomon's Mines (1950), Quartermain finds himself unwillingly thrust into a worldwide search for the legendary mines of King Solomon. The look and feel of Indiana and his past adventures are quite apparent. Both Quartermain and Jones are confronted by angry villagers and a myriad of dangerous booby traps. Look to King Solomon's Mines for a good idea on the feel and tone Lucas and Spielberg are after with their latest Indiana Jones outing\"]. Superheroflix.com. Retrieved on 2012-01-14. The two friends first discussed the project in Hawaii around the time of the release of the first Star Wars film. Spielberg told Lucas how he wanted his next project to be something fun, like a James Bond film (this would later be referenced when they cast Sean Connery as Henry Jones Sr.). According to sources, Lucas responded to the effect that he had something \"even better,\" or that he'd \"got that beat.\"\n\nOne of the possible bases for Indiana Jones is Professor Challenger, created by Sir Arthur Conan Doyle in 1912 for his novel, The Lost World. Challenger was based on Doyle's physiology professor, Sir William Rutherford, an adventuring academic, albeit a zoologist/anthropologist.\n\nAnother important influence on the development of the character Indiana Jones is Carl Barks' comic character Uncle Scrooge, which, since his creation has been an intellectual property of the Walt Disney Company. Carl Barks created Uncle Scrooge in 1948 as a one-off relation for Donald Duck in a Donald Duck comic book.\"Uncle Scrooge McDuck: His Life and Times\" Celestial Arts Press, Millbrae, Califormia, p.23, 1981. \"These four panels, from pages one and two of CHRISTMAS ON BEAR MOUNTAIN (1948), are the very first appearance of Scrooge McDuck. His Dickensian and Scottish origins are apparent in his demeanor and costume. Scrooge gradually evolved into a less stereotypical and more complex character.\" Barks realized that the character had more potential, so a separate \"Uncle Scrooge\" Dell Comics book series full of exciting and strange adventures in the company of his duck nephews was developed. This Uncle Scrooge comic series strongly influenced George LucasGeorge Lucas in ″An Appreciation″ in \"Uncle Scrooge McDuck: His Life and Times\" Celestial Arts Press, Millbrae, Califormia, 1981. ″Some of the very first comics I obtained were written by Carl Barks. I had a subscription to \"Walt Disney's Comics and Stories\" and liked the Scrooge character so much that I immediately went out and bought all the Uncle Scrooge comics I could find on the newsstand... The stories are...cinematic.\" This appreciation of Scrooge as an adventurer influenced the development of Jones in clear and obvious ways. For example, the prolog of \"Raiders of the Lost Ark\" contains an homage to Barks' Uncle Scrooge adventure ″The Seven Cities of Cibola″ published in \"Uncle Scrooge\" # 7, Dell Comics, September 1954.\"Uncle Scrooge McDuck: His Life and Times\" Celestial Arts Press, Millbrae, Califormia, 1981. This homage in the film takes the form of playfully mimicking the removal-of-the-statuette-from-its-pedestal and the falling-stone sequences of the comic book.http://goodcomics.comicbookresources.com/2007/12/13/comic-book-urban-legends-revealed-133/Stefano Priarone in Walt Disney's Uncle $crooge: The Seven Cities of Gold, Fantagraphics Books, 2014. ″Uncle Scrooge takes Donald and the nephews on a perilous trek in search of the fabled seven cities of gold! This is the Scrooge story famous for providing Steven Spielberg and George Lucas with inspiration for parts of Raiders of the Lost Ark.″http://www.dialbforblog.com/archives/429/ducktales2.html While a prototype of Uncle Scrooge in the beginning was Ebenezer Scrooge from Charles Dickens's  \"A Christmas Carol\", quickly the personality of Scrooge took on some of the characteristics of H. Rider Haggard's Allan Quatermain and Arthur Conan Doyle's Professor Challenger.http://www.tor.com/2015/08/12/five-books-with-forgotten-cities/ ″The 19th-century ″lost world/race″ tropes of Haggard and Conan Doyle [inspired] many of the adventures of Carl Barks’ Donald Duck and Uncle Scrooge [that] involved such lost races or lost cities (e.g. ″Tralla La,″ a take-off on Shangri-La; Plain Awful, a city/race ″Lost in the Andes″ where all people and objects are blocky and round things are taboo; ″Forbidden Valley,″ a Conan Doyle-style dinosaur valley in South America). This means then that Lucas and Spielberg may have been influenced directly by Haggard's Quatermain and Doyle's Challenger, as noted above, but also indirectly through Bark's/Disney's Uncle Scrooge.\n\nThe character was originally named Indiana Smith, after an Alaskan Malamute called Indiana that Lucas owned in the 1970s[https://www.buzzfeed.com/keelyflaherty/why-did-it-have-to-be-snakes#.jnN6e4WlA\"53 Fascinating Facts About \"Indiana Jones\" You Probably Never Knew\"] Retrieved 10 August 2015 and on which he based the Star Wars character Chewbacca.[https://www.youtube.com/watch?vFSuDjjlIPak The making of Star Wars - around minute 20] Spielberg disliked the name Smith, and Lucas casually suggested Jones as an alternative. The Last Crusade script references the name's origin, with Jones's father revealing his son's birth name to be Henry and explaining that \"we named the dog Indiana\", to his son's chagrin.http://www.imdb.com/title/tt0097576/quotes\n\nLucas has said on various occasions that Sean Connery's portrayal of British secret agent James Bond was one of the primary inspirations for Jones, a reason Connery was chosen for the role of Indiana's father in Indiana Jones and the Last Crusade.[http://www.starpulse.com/news/index.php/2006/08/28/indiana_jones_was_supposed_to_be_like_ja Bond Inspiration For Indiana Jones] . Starpulse.com (2006-08-28). Retrieved on 2012-01-14. Spielberg earned the rank of Eagle Scout and Ford the Life Scout badge in their youth, which gave them the inspiration to portray Indiana Jones as a Life Scout at age 13 in The Last Crusade.[http://www.thebiographychannel.co.uk/biographies/harrison-ford.html HARRISON FORD BIOGRAPHY - The Biography Channel.co.uk] \n\nCostume designer Deborah Nadoolman Landis noted that the inspiration for the series as well as Indiana Jones' outfit was Charlton Heston's Harry Steele in Secret of the Incas (1954) and called Raiders of the Lost Ark \"almost a shot for shot\" remake of the Heston film, citing that Indiana Jones was \"a kinder, gentler Harry Steele\": \"We did watch this film together as a crew several times, and I always thought it strange that the filmmakers did not credit it later as the inspiration for the series.\"\n\nHistorical models\n\nMany people are said to be the real-life inspiration of the Indiana Jones character—although none of the following have been confirmed as inspirations by Lucas or Spielberg. There are some suggestions listed here in alphabetical order by last name:\n* Carl Ethan Akeley (May 19, 1864 – November 18, 1926) Explorer, sculptor, biologist, conservationist, inventor, taxidermist, and nature photographer, noted for his contributions to American museums, most notably to the Field Museum of Natural History and the American Museum of Natural History. He is considered the father of modern taxidermy.\n* Beloit College professor and paleontologist Roy Chapman Andrews., [https://books.google.com/books?vidISBN0312104561&id\nCaBxisxbAfwC&pgPA98&lpg\nPA98&sig=v0aO-D_rCrUl-IRZHI0RoexkydQ pp. 97–98], \"Andrews is allegedly the real person that the movie character of Indiana Jones was patterned after... crack shot, fighter of Mongolian brigands, the man who created the metaphor of 'Outer Mongolia' as denoting any exceedingly remote place.\"\n* Edgar James Banks (May 23, 1866 – May 5, 1945). American diplomat, antiquarian and novelist. Banks is credited with the sale of an ancient cuneiform tablet famously known as Plimpton 322 proving the Babylonians beat the Greeks to the invention of trigonometry - the study of triangles - by more than 1000 years.\n* Italian archaeologist and circus strongman Giovanni Battista Belzoni (1778–1823).\n* Yale University professor, historian, US senator, and explorer Hiram Bingham III, who rediscovered and excavated the lost city of Machu Picchu, and chronicled his find in the bestselling book The Lost City of the Incas in 1948.\n* University of Chicago archaeologist Robert Braidwood.\n* University of Chicago archaeologist James Henry Breasted. \"Some sources say that Breasted was the inspiration for Indiana Jones; others say it was Robert Braidwood.\"\n* Frederick Russell Burnham, the celebrated American scout and British Army spy who heavily influenced Haggard's fictional Allan Quatermain character and also became the inspiration for the Boy Scouts.\n* British archaeologist Percy Fawcett, who spent much of his life exploring the jungles of northern Brazil, and who was last seen in 1925 returning to the Amazon Basin to look for the Lost City Of Z. A fictionalized version of Fawcett appears to Jones in the book Indiana Jones And The Seven Veils.\n* American archaeologist Walter Fairservis.\n* Harvard University paleontologist Farish Jenkins.\n* British archaeologist and soldier T. E. Lawrence.\n* Northwestern University political scientist, anthropologist, professor and adventurer William Montgomery McGovern.\n* British adventurer Frederick Albert Mitchell-Hedges.\n* German archaeologist Otto Rahn.\n* Harvard University archaeologist and art historian Langdon Warner.\n* Vendyl Jones (1930 - 2010) led digs in Israel searching for the holy ark. He discovered items identified as the Temple incense and a clay vessel for holy anointing oil. In his book A Door of Hope: My Search for the Treasures of the Copper Scroll, he discusses the similarities.\n\nCostume\n\nUpon requests by Spielberg and Lucas, the costume designer gave the character a distinctive silhouette through the styling of the hat; after examining many hats, the designers chose a tall-crowned, wide-brimmed fedora. As a documentary of Raiders pointed out, the hat served a practical purpose. Following the lead of the old \"B\"-movies that inspired the Indiana Jones series, the fedora hid the actor's face sufficiently to allow doubles to perform the more dangerous stunts seamlessly. Examples in Raiders include the wider-angle shot of Indy and Marion crashing a statue through a wall, and Indy sliding under a fast-moving vehicle from front to back. Thus it was necessary for the hat to stay in place much of the time.\n\nThe hat became so iconic that the filmmakers could only come up with very good reasons or jokes to remove it. If it ever fell off during a take, filming would have to stop to put it back on. In jest, Ford put a stapler against his head to stop his hat from falling off when a documentary crew visited during shooting of Indiana Jones and the Last Crusade. This created the urban legend that Ford stapled the hat to his head. Anytime Indy's hat accidentally came off as part of the storyline (blown off by the wind, knocked off, etc.) and seemed almost irretrievable, filmmakers would make sure Indy and his hat were always reunited, regardless of the implausibility of its return. Although other hats were also used throughout the films, the general style and profile remained the same. Elements of the outfit include:\n* The fedora was supplied by [http://www.herbert-johnson.co.uk/history.html Herbert Johnson Hatters] in England for the first three films.  An Australian model was used by costume designer Deborah Landis to show hat maker Richard Swales the details when making the iconic hat from \"the Poets\" parts. The fedora for Crystal Skull was made by Steve Delk and Marc Kitter of the Adventurebilt Hat Company of Columbus, Mississippi.\n* The leather jacket, a hybrid of the \"Type 440\" and the A-2 jacket, was made by Leather Concessionaires (now known as Wested Leather Co.) for Raiders of the Lost Ark and Indiana Jones and the Last Crusade. For Indiana Jones and the Temple of Doom, jackets were made in-house at Bermans & Nathans in London based on a stunt jacket they provided for Raiders of the Lost Ark. Tony Nowak made the jacket for Indiana Jones and the Kingdom of the Crystal Skull.\n* The Indiana Jones shirt is based on a typical safari-style shirt. Its distinctive feature is two vertical strips running from the shoulders to the bottom of the shirt tails and continued over both breast pockets. A common debate regards the original shirt color. Surviving samples of the original shirts seem to be darker in reality than they appear on screen. Most fans look for an off-white \"stone\" color for their replicas. The original shirts, however, may have been more of a \"tan\" or \"natural\" color. The shirt varied little from film to film, the only notable difference being the darker buttons in Temple of Doom and Last Crusade. Originally designed by Andreas Dometakis for the films, this shirt was once one of the hardest pieces of gear to find.\n* The trousers worn by Indiana Jones in all three films were based on original World War II Army and Army Air Corps officer trousers. Although not original Pinks they are based on the same basic design and do carry a slight pinkish hue. The trousers made for Raiders are said to be more of a greyish-brown whereas the trousers made for Temple of Doom and Last Crusade were supposedly a purer reddish brown. The trousers were made of a khaki wool-twill, pleated with seven belt loops, two scalloped button flap rear pockets, a button fly and a four-inch military style hem. They were all most likely subcontracted by the costume department and made by famed London based cinema costumers, Angels and Bermans, to be tailored perfectly for Harrison Ford for the production.\n* The satchel was a modified Mark VII gas mask bag that was used by British troops and civilians during World War II.\n* The whip was an 8 to bullwhip crafted by David Morgan for the first three films. The whips for Crystal Skull were crafted by a variety of people, including Terry Jacka, Joe Strain and Morgan (different lengths and styles were likely used in specific stunts).\n* The pistol was usually a World War I-era revolver, including the Webley Green (Last Crusade and Crystal Skull), or a .455 Webley Smith & Wesson Hand Ejector 2nd model revolver (Raiders). He has also used a Colt Official Police revolver (Temple of Doom), a Nagant M1895 (Young Indiana Jones), and a 9 mm Browning Hi-Power (Raiders). The weapon is carried in a military pattern flap holster.\n* The shoes were made by Alden. A stock style (model 405) that had been a favorite of Ford's before the films, they are still sold today (though in a redder (brick) shade of brown than seen in the films) and are popularly known as \"Indy Boots.\"\n\nThe fedora and leather jacket from Indiana Jones and the Last Crusade are on display at the Smithsonian Institution's American History Museum in Washington, D.C. The collection of props and clothing from the films has become a thriving hobby for some aficionados of the franchise. Jones' whip was the third most popular film weapon, as shown by a 2008 poll held by 20th Century Fox, which surveyed approximately two thousand film fans.\n\nCasting\n\nOriginally, Spielberg suggested Harrison Ford; Lucas resisted the idea, since he had already cast the actor in American Graffiti, Star Wars and The Empire Strikes Back, and did not want Ford to become known as his \"Bobby De Niro\" (in reference to the fact that fellow director Martin Scorsese regularly casts Robert De Niro in his films). During an intensive casting process, Lucas and Spielberg auditioned many actors, and finally cast actor Tom Selleck as Indiana Jones. Shortly afterward pre-production began in earnest on Raiders of the Lost Ark. However, CBS refused to release Selleck from his contractual commitment to Magnum, P.I. (which was gradually gaining momentum in the ratings), forcing him to turn down the role. One of CBS's concerns was that shooting for Magnum P.I. conflicted with shooting for Raiders, both of which were to begin about the same time. However, Selleck was to say later in an interview that shooting for Magnum P.I. was delayed and did not actually begin until shooting for Raiders had concluded. \n\nSubsequently, both Peter Coyote and Tim Matheson auditioned for the role. However, after Spielberg suggested Ford again, Lucas relented, and Ford was cast in the role less than three weeks before filming began.\n\nCultural impact\n\nArchaeological influence\n\nThe industry magazine Archaeology named eight past and present archaeologists who they felt \"embodied [Jones'] spirit\" as recipients of the Indy Spirit Awards in 2008. That same year Ford himself was elected to the Board of Directors for the Archaeological Institute of America. Commenting that \"understanding the past can only help us in dealing with the present and the future,\" Ford was praised by the association's president for his character's \"significant role in stimulating the public's interest in archaeological exploration.\"\n\nHe is perhaps the most influential character in films that explore archaeology. Since the release of Raiders of the Lost Ark in 1981, the very idea of archaeology and archaeologists has fundamentally shifted. Prior to the film's release, the stereotypical image of an archaeologist was that of an older, lacklustre professor type. In the early years of films involving archaeologists, they were portrayed as victims who would need to be rescued by a more masculine or heroic figure. Following 1981, the stereotypical archaeologist is thought of as a male bull whip wielding adventurer and Ivy League professor. The stereotypical image of an archaeologist is also portrayed as an individual usually out doing fieldwork, which is not always the case.\n\nIndiana Jones is essentially the archetype for the field of archaeology, individuals who are actively involved in this field are influenced by the ideas put forward in the films and any other associated media. Indiana Jones is still a highly debated topic among archaeologists, whether the influence of these films is positive or negative has yet to be determined. The argument for these films having a negative influence states that it reflects poorly on the field, one prominent individual with this opinion is Anne Pyburn. Pyburn described the influence of Indiana Jones as being one that is elitist and sexist, she went on to say that the Indiana Jones films have caused new discoveries in the field of archaeology to become oversimplified and overhyped in an attempt to gain public interest which negatively influences archaeology as a whole. Eric Powell, an editor with the magazine Archaeology, was quoted saying \"O.K., fine, the movie romanticizes what we do,\" continuing on to say that \"Indy may be a horrible archeologist, but he’s a great diplomat for archeology. I think we'll see a spike in kids who want to become archeologists.\" In an article written by Kevin McGeoughs, an associate professor of archaeology, he describes the original archaeological criticism of the film as missing the point of the film. Going on to say that the various critiques of poor excavation techniques used were a plot feature to make the film more enjoyable and that in doing so it is not trying to push an agenda. He finished by saying, \"dramatic interest is what is at issue, and it is unlikely that film will change in order to promote and foster better archaeological techniques\".\n\nA 2007 survey conducted at Lycoming College set out to examine the public perception of archaeology and what an archaeologist looks like. The results from this survey indicated that the majority of participants all formed a similar image of an archaeologist, the picture painted is one of a male dressed in light weight khaki clothing, wearing a \"Indiana Jones hat\" and would typically be found in a desert or exotic location. In addition individuals described that the archaeologist would potentially have to become destructive or involved in dangerous situations to obtain the wanted artifacts, demonstrating an adventurer personality.\n\nFandom\n\nWhile himself an homage to various prior adventurers, aspects of Indiana Jones also directly influenced some subsequent characterizations:\n* Lara Croft, the female archaeologist of the Tomb Raider series, was originally designed as a man but was changed to a woman, partly because the developers felt the original design was too similar to Indiana Jones. Paramount Pictures, which distributed the Indiana Jones film series, would later make two films based on the Tomb Raider games.\n* The producer of the Prince of Persia (2008) video game, Ben Mattes, explained that its \"inspiration was anything Harrison Ford has ever done: Indiana Jones, Han Solo.\"As quoted in Gary Steinman, \"Prince of Persia: Anatomy of a Prince,\" PlayStation: The Official Magazine 13 (December 2008): 50.\n* The video game series Uncharted is also very heavily influenced and inspired by Indiana Jones. The protagonist, Nathan Drake, also shares many similarities with Jones himself, both visually and personality-wise. The design team felt the sources shared themes of mystery and \"what-if scenarios\" that romanticized adventure and aimed to include those in Uncharted.\n* The Lego character Johnny Thunder is derived from Indiana Jones, among other influences. For one, he is Australian (like Steve Irwin the Crocodile Hunter). His clothes are also different, as he sports a slouch hat instead of a fedora, a red bandanna, and a tan shirt. Plus, he has a visible mustache and sideburns.\n* The roguelike NetHack features the role of archaeologist, an adventurer starting the game with the trademark fedora, bullwhip and leather jacket.\n*Montezuma's Revenge character Panama Joe (who was originally a Mexican named Pedro) shares a lot of similaries to Indy http://img.gamefaqs.net/box/5/3/0/45530_front.jpg however, it is a coindence as neither Jaeger or Parker bros. knew about Indy at that time http://www.digitpress.com/library/interviews/interview_robert_jaeger.html\n*Also Montezuma's Return! character Max Montezuma (or at least in the Game Boy/Game Boy color version) shares a lot of similarities with Indy as well\n*Blizzard Entertainment made a big homage to the Indiana Jones character in their MMO game World of Warcraft. The character 'Harrison Jones' (named after the movie character and the actor portraying it) is the nominal leader of a league of archaeologists which opposes various unsavoury villains in situations that references the various movies. The same 'Harrison Jones' makes an appearance in their Hearthstone CCG, along with Indiana's/Harrison's trademark hat.\n*My Little Pony: Friendship Is Magic, Daring Do is a pegasus and main character of the fictional Daring Do adventure novel series parodying Indiana Jones.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Indiana Jones" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14814" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dr. Henry Walton \"Indiana\" Jones Jr. is a title character and protagonist of the Indiana Jones franchise. George Lucas created the character in homage to the action heroes of 1930s film serials. The character first appeared in the 1981 film Raiders of the Lost Ark, to be followed by Indiana Jones and the Temple of Doom in 1984, Indiana Jones and the Last Crusade in 1989, The Young Indiana Jones Chronicles from 1992 to 1996, and Indiana Jones and the Kingdom of the Crystal Skull in 2008. The character is also featured in novels, comics, video games, and other media. Jones is also featured in several Disney theme parks, including the Indiana Jones Adventure, Indiana Jones et le Temple du Péril, and Epic Stunt Spectacular! attractions.\n\nJones is most famously portrayed by Harrison Ford and has also been portrayed by River Phoenix (as the young Jones in The Last Crusade) and in the television series The Young Indiana Jones Chronicles by Corey Carrier, Sean Patrick Flanery, and George Hall. Doug Lee has supplied the voice of Jones for two LucasArts video games, Indiana Jones and the Fate of Atlantis and Indiana Jones and the Infernal Machine, David Esch supplied his voice for Indiana Jones and the Emperor's Tomb, and John Armstrong for Indiana Jones and the Staff of Kings.[http://www.imdb.com/title/tt1363107/ Indiana Jones and the Staff of Kings (Video Game 2009) – IMDb]\n\nThe character is distinguished by his appearance (bullwhip, fedora, satchel and leather jacket), sense of humor, deep knowledge of many ancient civilizations and languages, and fear of snakes.\n\nSince his first appearance in Raiders of the Lost Ark, Indiana Jones has become one of cinema's most famous characters. In 2003, the American Film Institute ranked him the second greatest film hero of all time. He was also named the 1st Greatest Movie Character by Empire magazine. Entertainment Weekly ranked Indy 2nd on their list of The All-Time Coolest Heroes in Pop Culture. Premiere magazine also placed Indy at number 7 on their list of The 100 Greatest Movie Characters of All Time.\n\nAppearances\n\nFilm\n\n* 1981 film Raiders of the Lost Ark\n* 1984 prequel film Indiana Jones and the Temple of Doom\n* 1989 film Indiana Jones and the Last Crusade\n* 2008 film Indiana Jones and the Kingdom of the Crystal Skull\n\nA native of Princeton, New Jersey, Indiana Jones was introduced as a tenured professor of archeology in the 1981 film Raiders of the Lost Ark, set in 1936. The character is an adventurer reminiscent of the 1930s film serial treasure hunters and pulp action heroes, whose research is funded by Marshall College (named after producer Frank Marshall), a fictional college in Connecticut, where he is a professor of archaeology.  He also attended the University of Chicago.\n\nIn this first adventure, he is pitted against the Nazis, who are commissioned by Hitler to recover evidence related to Aryan roots of Nazism. (see Nazi archaeology). In consequence, Dr Jones travels the world to prevent them from recovering the Ark of the Covenant (see also Biblical archaeology). He is aided by Marion Ravenwood and Sallah. The Nazis are led by Jones's archrival, a Nazi-sympathizing French archaeologist named René Belloq, and Arnold Toht, a sinister Gestapo agent.\n\nIn the 1984 prequel, Indiana Jones and the Temple of Doom, set in 1935, Jones travels to India and attempts to free enslaved children and the three Sankara stones from the bloodthirsty Thuggee cult. He is aided by Short Round, a young boy, and is accompanied by singer Willie Scott (Kate Capshaw).\n\nThe third film, 1989's Indiana Jones and the Last Crusade, set in 1938, returned to the formula of the original, reintroducing characters such as Sallah and Marcus Brody, a scene from Professor Jones's classroom (he now teaches at Barnett College), the globe trotting element of multiple locations, and the return of the infamous Nazi mystics, this time trying to find the Holy Grail. The film's introduction, set in 1912, provided some back story to the character, specifically the origin of his fear of snakes, his use of a bullwhip, the scar on his chin, and his hat; the film's epilogue also reveals that \"Indiana\" is not Jones's first name, but a nickname he took from the family dog. The film was a buddy movie of sorts, teaming Jones with his father, often to comical effect. Although Lucas intended to make five Indiana Jones films, Indiana Jones and the Last Crusade was the last for over eighteen years, as he could not think of a good plot element to drive the next installment.\n\nThe 2008 film, Indiana Jones and the Kingdom of the Crystal Skull, is the latest film in the series. Set in 1957, 19 years after the third film, it pits an older, wiser Indiana Jones against Soviet agents bent on harnessing the power of an extraterrestrial device discovered in South America. Jones is aided in his adventure by his former lover, Marion Ravenwood (Karen Allen), and her son—a young greaser named Henry \"Mutt\" Williams (Shia LaBeouf), later revealed to be Jones' unknown child. There were rumors that Harrison Ford will not return for any future installments and LaBeouf will take over the Indy franchise. This film also reveals that Jones was recruited by the Office of Strategic Services during World War II, attaining the rank of Colonel in the United States Army. He is tasked with conducting covert operations with MI6 agent George McHale against the Soviet Union.\n\nIn March 2016, Disney announced a fifth Indiana Jones film currently in development, with Ford and Spielberg set to return to the franchise. The film will be released on July 10, 2020.\n\nAttractions\n\nIndiana Jones is featured at several Walt Disney theme park attractions. The Indiana Jones Adventure attractions at Disneyland and Tokyo DisneySea (\"Temple of the Forbidden Eye\" and \"Temple of the Crystal Skull,\" respectively) place Indy at the forefront of two similar archaeological discoveries. These two temples each contain a wrathful deity who threatens the guests who ride through in World War II troop transports. The attractions, some of the most expensive of their kind at the time,url=http://disneyland.disney.go.com/attractions/disneyland/indiana-jones-adventure/ opened in 1995 and 2001, respectively, with sole design credit attributed to Walt Disney Imagineering. Disney did not originally license Harrison Ford's likeness for the American version; nonetheless, a differentiated Indiana Jones audio-animatronic character appears at three points in both attractions. However, the Indiana Jones featured in the DisneySea version does use Harrison Ford's likeness but uses Japanese audio for all of his speaking parts. In 2010, some of the Indy audio-animatronics at the Disneyland version were replaced with ones resembling Ford.[http://www.disunplugged.com/2010/02/08/disneyland-resort-whats-worth-seeing-in-2010/ Disneyland Resort: What’s Worth Seeing in 2010? | The DIS Unplugged Disney Blog]. Disunplugged.com. (2010-02-08). Retrieved on 2012-01-14.\n\nDisneyland Paris also features an Indiana Jones-titled ride where people speed off through ancient ruins in a runaway mine wagon similar to that found in Indiana Jones and the Temple of Doom. Indiana Jones and the Temple of Peril is a looping roller coaster engineered by Intamin, designed by Walt Disney Imagineering, and opened in 1993.\n\nThe Indiana Jones Epic Stunt Spectacular! is a live show that has been presented in the Disney's Hollywood Studios theme park of the Walt Disney World Resort with few changes since the park's 1989 opening, as Disney-MGM Studios. The 25-minute show presents various stunts framed in the context of a feature film production, and recruits members of the audience to participate in the show. Stunt artists in the show re-create and ultimately reveal some of the secrets of the stunts of the Raiders of the Lost Ark films, including the well-known \"running-from-the-boulder\" scene. Stunt performer Anislav Varbanov was fatally injured in August 2009, while rehearsing the popular show. Also at Disney's Hollywood Studios, an audio-animatronic Indiana Jones appears in another attraction; during The Great Movie Ride's Raiders of the Lost Ark segment.\n\nLiterature\n\nGraphic novels\n\nIndy also appears in the 2004 Dark Horse Comics story Into The Great Unknown, collected in Star Wars Tales Volume 5. In this non-canon story bringing together two of Harrison Ford's best roles, Indy and Short Round discover a crash-landed Millennium Falcon in the Pacific Northwest, along with Han Solo's skeleton and the realization that a rumored nearby Sasquatch is in fact Chewbacca. Indy also appears in a series of Marvel Comics.\n\nMovie-tie-in novelizations\n\nThe four Indiana Jones film scripts were novelized and published in the time-frame of the films’ initial releases.All titles, authors, dates of publication, and publishers of these novelizations are from the title and copyright pages of the first editions of each of the cited volumes. Raiders of the Lost Ark was novelized by Campbell Black based on the script by Lawrence Kasdan that was based on the story by George Lucas and Philip Kaufman and published in April 1981 by Ballantine Books; Indiana Jones and the Temple of Doom was novelized by James Kahn and based on the script by Willard Huyck & Gloria Katz that was based on the story by George Lucas and published May 1984 by Ballantine Books; Indiana Jones and the Last Crusade was novelized by Rob MacGregor based on the script by Jeffrey Boam that was based on a story by George Lucas and Menno Meyjes and published June 1989 by Ballantine Books. Nearly 20 years later Indiana Jones and the Kingdom of the Crystal Skull was novelized by James Rollins based on the script by David Koepp based on the story by George Lucas and Jeff Nathanson and published May 2008 by Ballantine Books. In addition, in 2008 to accompany the release of Kingdom of Skulls, Scholastic Books published juvenile novelizations of the four scripts written, successively in the order above, by Ryder Windham, Suzanne Weyn, Ryder Windham, and James Luceno. All these books have been reprinted, with Raiders of the Lost Ark being retitled Indiana Jones and the Raiders of the Lost Ark. While these are the principal titles and authors, there are numerous other volumes derived from the four film properties.\n\nOriginal novels\n\n\tFrom February 1991 through February 1999, twelve original Indiana Jones-themed adult novels were licensed by Lucasfilm, Ltd. and written by three genre authors of the period. Ten years afterward, a thirteenth original novel was added, also written by a popular genre author. The first twelve were published by Bantam Books; the last by Ballantine Books in 2009. (See Indiana Jones franchise for broad descriptions of these original adult novels.) The novels are:All titles, authors, dates of publication, and publishers of these novelizations are from the copyright pages of the first editions of each of the cited volumes.\n\n* Rob MacGregor (author)\n* Indiana Jones and the Peril at Delphi, February 1991.\n* Indiana Jones and the Dance of the Giants, June 1991.\n* Indiana Jones and the Seven Veils, December 1991.\n* Indiana Jones and the Genesis Deluge, February 1992.\n* Indiana Jones and the Unicorn’s Legacy, September 1992.\n* Indiana Jones and the Interior World, December 1992.\n* Martin Caidin (author)\n* Indiana Jones and the Sky Pirates, December 1993.\n* Indiana Jones and the White Witch, April 1994.\n* Max McCoy (author)\n* Indiana Jones and the Philosopher’s Stone, May 1995.\n* Indiana Jones and the Dinosaur Eggs, March 1996.\n* Indiana Jones and the Hollow Earth, March 1997.\n* Indiana Jones and the Secret of the Sphinx, February 1999.\n* Steve Perry (author)\n* Indiana Jones and the Army of the Dead, September 2009.\n\nTelevision\n\nFrom 1992 to 1996, George Lucas executive-produced a television series named The Young Indiana Jones Chronicles, aimed mainly at teenagers and children, which showed many of the important events and historical figures of the early 20th century through the prism of Indiana Jones' life.\n\nThe show initially featured the formula of an elderly (93 to 94 years of age) Indiana Jones played by George Hall introducing a story from his youth by way of an anecdote: the main part of the episode then featured an adventure with either a young adult Indy (16 to 21 years of age) played by Sean Patrick Flanery or a child Indy (8 to 11 years) played by Corey Carrier. One episode, \"Young Indiana Jones and the Mystery of the Blues\", is bookended by Harrison Ford as Indiana Jones, rather than Hall. Later episodes and telemovies did not have this bookend format.\n\nThe bulk of the series centers around the young adult Indiana Jones and his activities during World War I as a 16- to 17-year-old soldier in the Belgian Army and then as an intelligence officer and spy seconded to French intelligence. The child Indy episodes follow the boy's travels around the globe as he accompanies his parents on his father's worldwide lecture tour from 1908 to 1910.\n\nThe show provided some backstory for the films, as well as new information regarding the character. Indiana Jones was born July 1, 1899, and his middle name is Walton (Lucas's middle name). It is also mentioned that he had a sister called Suzie who died as an infant of fever, and that he eventually has a daughter and grandchildren who appear in some episode introductions and epilogues. His relationship with his father, first introduced in Indiana Jones and the Last Crusade, was further fleshed out with stories about his travels with his father as a young boy. Indy damages or loses his right eye sometime between the events in 1957 and the early 1990s, when the \"Old Indy\" segments take place, as the elderly Indiana Jones wears an eyepatch.\n\nIn 1999, Lucas removed the episode introductions and epilogues by George Hall for the VHS and DVD releases, and re-edited the episodes into chronologically ordered feature-length stories. The series title was also changed to The Adventures of Young Indiana Jones.\n\nVideo games\n\nThe character has appeared in several officially licensed games, beginning with adaptations of Raiders of the Lost Ark, Indiana Jones and the Temple of Doom, two adaptations of Indiana Jones and the Last Crusade (one with purely action mechanics, one with an adventure and puzzle based structure) and Indiana Jones' Greatest Adventures, which included the storylines from all three of the original films.\n\nFollowing this, the games branched off into original storylines with Indiana Jones in the Lost Kingdom, Indiana Jones and the Fate of Atlantis, Indiana Jones and the Infernal Machine, Indiana Jones and the Emperor's Tomb and Indiana Jones and the Staff of Kings. Emperor's Tomb sets up Jones's companion Wu Han and the search for Nurhaci's ashes seen at the beginning of Temple of Doom. The first two games were developed by Hal Barwood and starred Doug Lee as the voice of Indiana Jones; Emperor's Tomb had David Esch fill the role and Staff of Kings starred John Armstrong.\n\nIndiana Jones and the Infernal Machine was the first Indy-based game presented in three dimensions, as opposed to 8-bit graphics and side-scrolling games before.\n\nThere is also a small game from Lucas Arts Indiana Jones and His Desktop Adventures. A video game was made for young Indy called Young Indiana Jones and the Instruments of Chaos, as well as a video game version of The Young Indiana Jones Chronicles.\n\nTwo Lego Indiana Jones games have also been released. Lego Indiana Jones: The Original Adventures was released in 2008 and follows the plots of the first three films. It was followed by Lego Indiana Jones 2: The Adventure Continues in late 2009. The sequel includes an abbreviated reprise of the first three films, but focuses on the plot of Indiana Jones and the Kingdom of the Crystal Skull.\n\nSocial gaming company Zynga introduced Indiana Jones to their \"Adventure World\" game in late 2011.\n\nCharacter description and formation\n\n\"Indiana\" Jones's full name is Dr. Henry Walton Jones Jr.,The character's full name is stated in the Corey Carrier narration of the feature-length episode My First Adventure from The Young Indiana Jones Chronicles. and his nickname is often shortened to \"Indy\".\n\nIn his role as a college professor of archaeology, Jones is scholarly and learned in a tweed suit, lecturing on ancient civilizations. At the opportunity to recover important artifacts, Dr. Jones transforms into \"Indiana,\" a \"non-superhero superhero\" image he has concocted for himself. Producer Frank Marshall said, \"Indy [is] a fallible character. He makes mistakes and gets hurt. ... That's the other thing people like: He's a real character, not a character with superpowers.\" Spielberg said there \"was the willingness to allow our leading man to get hurt and to express his pain and to get his mad out and to take pratfalls and sometimes be the butt of his own jokes. I mean, Indiana Jones is not a perfect hero, and his imperfections, I think, make the audience feel that, with a little more exercise and a little more courage, they could be just like him.\" According to Spielberg biographer Douglas Brode, Indiana created his heroic figure so as to escape the dullness of teaching at a school. Both of Indiana's personas reject one another in philosophy, creating a duality. Harrison Ford said the fun of playing the character was because Indiana is both a romantic and a cynic, while scholars have analyzed Indiana as having traits of a lone wolf; a man on a quest; a noble treasure hunter; a hardboiled detective; a human superhero; and an American patriot.\n\nLike many characters in his films, Jones has some autobiographical elements of Spielberg. Indiana lacks a proper father figure because of his strained relationship with his father, Henry Senior. His own contained anger is misdirected towards Professor Abner Ravenwood, his mentor at the University of Chicago, leading to a strained relationship with Marion Ravenwood. The teenage Indiana bases his own look on a figure from the prologue of Indiana Jones and the Last Crusade, after being given his hat. Marcus Brody acts as Indiana's positive role model at the college. Indiana's own insecurities are made worse by the absence of his mother. In Indiana Jones and the Temple of Doom, he becomes the father figure to Willie Scott and Short Round, to survive; he is rescued from Kali's evil by Short Round's dedication. Indiana also saves many enslaved children.\n\nIndiana uses his knowledge of Shiva to defeat Mola Ram. In Raiders, however, he is wise enough to close his eyes in the presence of God in the Ark of the Covenant. By contrast, his rival Rene Belloq is killed for having the audacity to try to communicate directly with God.\n\nIn the prologue of Indiana Jones and the Last Crusade, Jones is seen as a teenager, establishing his look when given a fedora hat. Indiana's intentions are revealed as prosocial, as he believes artifacts \"belong in a museum.\" In the film's climax, Indiana undergoes \"literal\" tests of faith to retrieve the Grail and save his father's life. He also remembers Jesus as a historical figure – a humble carpenter – rather than an exalted figure when he recognizes the simple nature and tarnished appearance of the real Grail amongst a large assortment of much more ornately decorated ones. Henry Senior rescues his son from falling to his death when reaching for the fallen Grail, telling him to \"let it go,\" overcoming his mercenary nature. The Young Indiana Jones Chronicles explains how Indiana becomes solitary and less idealistic following his service in World War I. In Indiana Jones and the Kingdom of the Crystal Skull, Jones is older and wiser, whereas his sidekicks Mutt and Mac are youthfully arrogant and greedy, respectively.\n\nOrigins and inspirations\n\nIndiana Jones is modeled after the strong-jawed heroes of the matinée serials and pulp magazines that George Lucas and Steven Spielberg enjoyed in their childhoods (such as the Republic Pictures serials, and the Doc Savage series). Sir H. Rider Haggard's safari guide/big game hunter Allan Quatermain of King Solomon's Mines, who dates back to 1885, is a notable template for Jones.[https://web.archive.org/web/20081205015223/http://www.superheroflix.com/news/NE0ab607ewPH26 \"Based on a 1885 novel by Henry Rider Haggard, exploits of Allan Quartermain have long served as a template for the Indiana Jones character. King Solomon's Mines (1950), Quartermain finds himself unwillingly thrust into a worldwide search for the legendary mines of King Solomon. The look and feel of Indiana and his past adventures are quite apparent. Both Quartermain and Jones are confronted by angry villagers and a myriad of dangerous booby traps. Look to King Solomon's Mines for a good idea on the feel and tone Lucas and Spielberg are after with their latest Indiana Jones outing\"]. Superheroflix.com. Retrieved on 2012-01-14. The two friends first discussed the project in Hawaii around the time of the release of the first Star Wars film. Spielberg told Lucas how he wanted his next project to be something fun, like a James Bond film (this would later be referenced when they cast Sean Connery as Henry Jones Sr.). According to sources, Lucas responded to the effect that he had something \"even better,\" or that he'd \"got that beat.\"\n\nOne of the possible bases for Indiana Jones is Professor Challenger, created by Sir Arthur Conan Doyle in 1912 for his novel, The Lost World. Challenger was based on Doyle's physiology professor, Sir William Rutherford, an adventuring academic, albeit a zoologist/anthropologist.\n\nAnother important influence on the development of the character Indiana Jones is Carl Barks' comic character Uncle Scrooge, which, since his creation has been an intellectual property of the Walt Disney Company. Carl Barks created Uncle Scrooge in 1948 as a one-off relation for Donald Duck in a Donald Duck comic book.\"Uncle Scrooge McDuck: His Life and Times\" Celestial Arts Press, Millbrae, Califormia, p.23, 1981. \"These four panels, from pages one and two of CHRISTMAS ON BEAR MOUNTAIN (1948), are the very first appearance of Scrooge McDuck. His Dickensian and Scottish origins are apparent in his demeanor and costume. Scrooge gradually evolved into a less stereotypical and more complex character.\" Barks realized that the character had more potential, so a separate \"Uncle Scrooge\" Dell Comics book series full of exciting and strange adventures in the company of his duck nephews was developed. This Uncle Scrooge comic series strongly influenced George LucasGeorge Lucas in ″An Appreciation″ in \"Uncle Scrooge McDuck: His Life and Times\" Celestial Arts Press, Millbrae, Califormia, 1981. ″Some of the very first comics I obtained were written by Carl Barks. I had a subscription to \"Walt Disney's Comics and Stories\" and liked the Scrooge character so much that I immediately went out and bought all the Uncle Scrooge comics I could find on the newsstand... The stories are...cinematic.\" This appreciation of Scrooge as an adventurer influenced the development of Jones in clear and obvious ways. For example, the prolog of \"Raiders of the Lost Ark\" contains an homage to Barks' Uncle Scrooge adventure ″The Seven Cities of Cibola″ published in \"Uncle Scrooge\" # 7, Dell Comics, September 1954.\"Uncle Scrooge McDuck: His Life and Times\" Celestial Arts Press, Millbrae, Califormia, 1981. This homage in the film takes the form of playfully mimicking the removal-of-the-statuette-from-its-pedestal and the falling-stone sequences of the comic book.http://goodcomics.comicbookresources.com/2007/12/13/comic-book-urban-legends-revealed-133/Stefano Priarone in Walt Disney's Uncle $crooge: The Seven Cities of Gold, Fantagraphics Books, 2014. ″Uncle Scrooge takes Donald and the nephews on a perilous trek in search of the fabled seven cities of gold! This is the Scrooge story famous for providing Steven Spielberg and George Lucas with inspiration for parts of Raiders of the Lost Ark.″http://www.dialbforblog.com/archives/429/ducktales2.html While a prototype of Uncle Scrooge in the beginning was Ebenezer Scrooge from Charles Dickens's  \"A Christmas Carol\", quickly the personality of Scrooge took on some of the characteristics of H. Rider Haggard's Allan Quatermain and Arthur Conan Doyle's Professor Challenger.http://www.tor.com/2015/08/12/five-books-with-forgotten-cities/ ″The 19th-century ″lost world/race″ tropes of Haggard and Conan Doyle [inspired] many of the adventures of Carl Barks’ Donald Duck and Uncle Scrooge [that] involved such lost races or lost cities (e.g. ″Tralla La,″ a take-off on Shangri-La; Plain Awful, a city/race ″Lost in the Andes″ where all people and objects are blocky and round things are taboo; ″Forbidden Valley,″ a Conan Doyle-style dinosaur valley in South America). This means then that Lucas and Spielberg may have been influenced directly by Haggard's Quatermain and Doyle's Challenger, as noted above, but also indirectly through Bark's/Disney's Uncle Scrooge.\n\nThe character was originally named Indiana Smith, after an Alaskan Malamute called Indiana that Lucas owned in the 1970s[https://www.buzzfeed.com/keelyflaherty/why-did-it-have-to-be-snakes#.jnN6e4WlA\"53 Fascinating Facts About \"Indiana Jones\" You Probably Never Knew\"] Retrieved 10 August 2015 and on which he based the Star Wars character Chewbacca.[https://www.youtube.com/watch?vFSuDjjlIPak The making of Star Wars - around minute 20] Spielberg disliked the name Smith, and Lucas casually suggested Jones as an alternative. The Last Crusade script references the name's origin, with Jones's father revealing his son's birth name to be Henry and explaining that \"we named the dog Indiana\", to his son's chagrin.http://www.imdb.com/title/tt0097576/quotes\n\nLucas has said on various occasions that Sean Connery's portrayal of British secret agent James Bond was one of the primary inspirations for Jones, a reason Connery was chosen for the role of Indiana's father in Indiana Jones and the Last Crusade.[http://www.starpulse.com/news/index.php/2006/08/28/indiana_jones_was_supposed_to_be_like_ja Bond Inspiration For Indiana Jones] . Starpulse.com (2006-08-28). Retrieved on 2012-01-14. Spielberg earned the rank of Eagle Scout and Ford the Life Scout badge in their youth, which gave them the inspiration to portray Indiana Jones as a Life Scout at age 13 in The Last Crusade.[http://www.thebiographychannel.co.uk/biographies/harrison-ford.html HARRISON FORD BIOGRAPHY - The Biography Channel.co.uk] \n\nCostume designer Deborah Nadoolman Landis noted that the inspiration for the series as well as Indiana Jones' outfit was Charlton Heston's Harry Steele in Secret of the Incas (1954) and called Raiders of the Lost Ark \"almost a shot for shot\" remake of the Heston film, citing that Indiana Jones was \"a kinder, gentler Harry Steele\": \"We did watch this film together as a crew several times, and I always thought it strange that the filmmakers did not credit it later as the inspiration for the series.\"\n\nHistorical models\n\nMany people are said to be the real-life inspiration of the Indiana Jones character—although none of the following have been confirmed as inspirations by Lucas or Spielberg. There are some suggestions listed here in alphabetical order by last name:\n* Carl Ethan Akeley (May 19, 1864 – November 18, 1926) Explorer, sculptor, biologist, conservationist, inventor, taxidermist, and nature photographer, noted for his contributions to American museums, most notably to the Field Museum of Natural History and the American Museum of Natural History. He is considered the father of modern taxidermy.\n* Beloit College professor and paleontologist Roy Chapman Andrews., [https://books.google.com/books?vidISBN0312104561&id\nCaBxisxbAfwC&pgPA98&lpg\nPA98&sig=v0aO-D_rCrUl-IRZHI0RoexkydQ pp. 97–98], \"Andrews is allegedly the real person that the movie character of Indiana Jones was patterned after... crack shot, fighter of Mongolian brigands, the man who created the metaphor of 'Outer Mongolia' as denoting any exceedingly remote place.\"\n* Edgar James Banks (May 23, 1866 – May 5, 1945). American diplomat, antiquarian and novelist. Banks is credited with the sale of an ancient cuneiform tablet famously known as Plimpton 322 proving the Babylonians beat the Greeks to the invention of trigonometry - the study of triangles - by more than 1000 years.\n* Italian archaeologist and circus strongman Giovanni Battista Belzoni (1778–1823).\n* Yale University professor, historian, US senator, and explorer Hiram Bingham III, who rediscovered and excavated the lost city of Machu Picchu, and chronicled his find in the bestselling book The Lost City of the Incas in 1948.\n* University of Chicago archaeologist Robert Braidwood.\n* University of Chicago archaeologist James Henry Breasted. \"Some sources say that Breasted was the inspiration for Indiana Jones; others say it was Robert Braidwood.\"\n* Frederick Russell Burnham, the celebrated American scout and British Army spy who heavily influenced Haggard's fictional Allan Quatermain character and also became the inspiration for the Boy Scouts.\n* British archaeologist Percy Fawcett, who spent much of his life exploring the jungles of northern Brazil, and who was last seen in 1925 returning to the Amazon Basin to look for the Lost City Of Z. A fictionalized version of Fawcett appears to Jones in the book Indiana Jones And The Seven Veils.\n* American archaeologist Walter Fairservis.\n* Harvard University paleontologist Farish Jenkins.\n* British archaeologist and soldier T. E. Lawrence.\n* Northwestern University political scientist, anthropologist, professor and adventurer William Montgomery McGovern.\n* British adventurer Frederick Albert Mitchell-Hedges.\n* German archaeologist Otto Rahn.\n* Harvard University archaeologist and art historian Langdon Warner.\n* Vendyl Jones (1930 - 2010) led digs in Israel searching for the holy ark. He discovered items identified as the Temple incense and a clay vessel for holy anointing oil. In his book A Door of Hope: My Search for the Treasures of the Copper Scroll, he discusses the similarities.\n\nCostume\n\nUpon requests by Spielberg and Lucas, the costume designer gave the character a distinctive silhouette through the styling of the hat; after examining many hats, the designers chose a tall-crowned, wide-brimmed fedora. As a documentary of Raiders pointed out, the hat served a practical purpose. Following the lead of the old \"B\"-movies that inspired the Indiana Jones series, the fedora hid the actor's face sufficiently to allow doubles to perform the more dangerous stunts seamlessly. Examples in Raiders include the wider-angle shot of Indy and Marion crashing a statue through a wall, and Indy sliding under a fast-moving vehicle from front to back. Thus it was necessary for the hat to stay in place much of the time.\n\nThe hat became so iconic that the filmmakers could only come up with very good reasons or jokes to remove it. If it ever fell off during a take, filming would have to stop to put it back on. In jest, Ford put a stapler against his head to stop his hat from falling off when a documentary crew visited during shooting of Indiana Jones and the Last Crusade. This created the urban legend that Ford stapled the hat to his head. Anytime Indy's hat accidentally came off as part of the storyline (blown off by the wind, knocked off, etc.) and seemed almost irretrievable, filmmakers would make sure Indy and his hat were always reunited, regardless of the implausibility of its return. Although other hats were also used throughout the films, the general style and profile remained the same. Elements of the outfit include:\n* The fedora was supplied by [http://www.herbert-johnson.co.uk/history.html Herbert Johnson Hatters] in England for the first three films.  An Australian model was used by costume designer Deborah Landis to show hat maker Richard Swales the details when making the iconic hat from \"the Poets\" parts. The fedora for Crystal Skull was made by Steve Delk and Marc Kitter of the Adventurebilt Hat Company of Columbus, Mississippi.\n* The leather jacket, a hybrid of the \"Type 440\" and the A-2 jacket, was made by Leather Concessionaires (now known as Wested Leather Co.) for Raiders of the Lost Ark and Indiana Jones and the Last Crusade. For Indiana Jones and the Temple of Doom, jackets were made in-house at Bermans & Nathans in London based on a stunt jacket they provided for Raiders of the Lost Ark. Tony Nowak made the jacket for Indiana Jones and the Kingdom of the Crystal Skull.\n* The Indiana Jones shirt is based on a typical safari-style shirt. Its distinctive feature is two vertical strips running from the shoulders to the bottom of the shirt tails and continued over both breast pockets. A common debate regards the original shirt color. Surviving samples of the original shirts seem to be darker in reality than they appear on screen. Most fans look for an off-white \"stone\" color for their replicas. The original shirts, however, may have been more of a \"tan\" or \"natural\" color. The shirt varied little from film to film, the only notable difference being the darker buttons in Temple of Doom and Last Crusade. Originally designed by Andreas Dometakis for the films, this shirt was once one of the hardest pieces of gear to find.\n* The trousers worn by Indiana Jones in all three films were based on original World War II Army and Army Air Corps officer trousers. Although not original Pinks they are based on the same basic design and do carry a slight pinkish hue. The trousers made for Raiders are said to be more of a greyish-brown whereas the trousers made for Temple of Doom and Last Crusade were supposedly a purer reddish brown. The trousers were made of a khaki wool-twill, pleated with seven belt loops, two scalloped button flap rear pockets, a button fly and a four-inch military style hem. They were all most likely subcontracted by the costume department and made by famed London based cinema costumers, Angels and Bermans, to be tailored perfectly for Harrison Ford for the production.\n* The satchel was a modified Mark VII gas mask bag that was used by British troops and civilians during World War II.\n* The whip was an 8 to bullwhip crafted by David Morgan for the first three films. The whips for Crystal Skull were crafted by a variety of people, including Terry Jacka, Joe Strain and Morgan (different lengths and styles were likely used in specific stunts).\n* The pistol was usually a World War I-era revolver, including the Webley Green (Last Crusade and Crystal Skull), or a .455 Webley Smith & Wesson Hand Ejector 2nd model revolver (Raiders). He has also used a Colt Official Police revolver (Temple of Doom), a Nagant M1895 (Young Indiana Jones), and a 9 mm Browning Hi-Power (Raiders). The weapon is carried in a military pattern flap holster.\n* The shoes were made by Alden. A stock style (model 405) that had been a favorite of Ford's before the films, they are still sold today (though in a redder (brick) shade of brown than seen in the films) and are popularly known as \"Indy Boots.\"\n\nThe fedora and leather jacket from Indiana Jones and the Last Crusade are on display at the Smithsonian Institution's American History Museum in Washington, D.C. The collection of props and clothing from the films has become a thriving hobby for some aficionados of the franchise. Jones' whip was the third most popular film weapon, as shown by a 2008 poll held by 20th Century Fox, which surveyed approximately two thousand film fans.\n\nCasting\n\nOriginally, Spielberg suggested Harrison Ford; Lucas resisted the idea, since he had already cast the actor in American Graffiti, Star Wars and The Empire Strikes Back, and did not want Ford to become known as his \"Bobby De Niro\" (in reference to the fact that fellow director Martin Scorsese regularly casts Robert De Niro in his films). During an intensive casting process, Lucas and Spielberg auditioned many actors, and finally cast actor Tom Selleck as Indiana Jones. Shortly afterward pre-production began in earnest on Raiders of the Lost Ark. However, CBS refused to release Selleck from his contractual commitment to Magnum, P.I. (which was gradually gaining momentum in the ratings), forcing him to turn down the role. One of CBS's concerns was that shooting for Magnum P.I. conflicted with shooting for Raiders, both of which were to begin about the same time. However, Selleck was to say later in an interview that shooting for Magnum P.I. was delayed and did not actually begin until shooting for Raiders had concluded. \n\nSubsequently, both Peter Coyote and Tim Matheson auditioned for the role. However, after Spielberg suggested Ford again, Lucas relented, and Ford was cast in the role less than three weeks before filming began.\n\nCultural impact\n\nArchaeological influence\n\nThe industry magazine Archaeology named eight past and present archaeologists who they felt \"embodied [Jones'] spirit\" as recipients of the Indy Spirit Awards in 2008. That same year Ford himself was elected to the Board of Directors for the Archaeological Institute of America. Commenting that \"understanding the past can only help us in dealing with the present and the future,\" Ford was praised by the association's president for his character's \"significant role in stimulating the public's interest in archaeological exploration.\"\n\nHe is perhaps the most influential character in films that explore archaeology. Since the release of Raiders of the Lost Ark in 1981, the very idea of archaeology and archaeologists has fundamentally shifted. Prior to the film's release, the stereotypical image of an archaeologist was that of an older, lacklustre professor type. In the early years of films involving archaeologists, they were portrayed as victims who would need to be rescued by a more masculine or heroic figure. Following 1981, the stereotypical archaeologist is thought of as a male bull whip wielding adventurer and Ivy League professor. The stereotypical image of an archaeologist is also portrayed as an individual usually out doing fieldwork, which is not always the case.\n\nIndiana Jones is essentially the archetype for the field of archaeology, individuals who are actively involved in this field are influenced by the ideas put forward in the films and any other associated media. Indiana Jones is still a highly debated topic among archaeologists, whether the influence of these films is positive or negative has yet to be determined. The argument for these films having a negative influence states that it reflects poorly on the field, one prominent individual with this opinion is Anne Pyburn. Pyburn described the influence of Indiana Jones as being one that is elitist and sexist, she went on to say that the Indiana Jones films have caused new discoveries in the field of archaeology to become oversimplified and overhyped in an attempt to gain public interest which negatively influences archaeology as a whole. Eric Powell, an editor with the magazine Archaeology, was quoted saying \"O.K., fine, the movie romanticizes what we do,\" continuing on to say that \"Indy may be a horrible archeologist, but he’s a great diplomat for archeology. I think we'll see a spike in kids who want to become archeologists.\" In an article written by Kevin McGeoughs, an associate professor of archaeology, he describes the original archaeological criticism of the film as missing the point of the film. Going on to say that the various critiques of poor excavation techniques used were a plot feature to make the film more enjoyable and that in doing so it is not trying to push an agenda. He finished by saying, \"dramatic interest is what is at issue, and it is unlikely that film will change in order to promote and foster better archaeological techniques\".\n\nA 2007 survey conducted at Lycoming College set out to examine the public perception of archaeology and what an archaeologist looks like. The results from this survey indicated that the majority of participants all formed a similar image of an archaeologist, the picture painted is one of a male dressed in light weight khaki clothing, wearing a \"Indiana Jones hat\" and would typically be found in a desert or exotic location. In addition individuals described that the archaeologist would potentially have to become destructive or involved in dangerous situations to obtain the wanted artifacts, demonstrating an adventurer personality.\n\nFandom\n\nWhile himself an homage to various prior adventurers, aspects of Indiana Jones also directly influenced some subsequent characterizations:\n* Lara Croft, the female archaeologist of the Tomb Raider series, was originally designed as a man but was changed to a woman, partly because the developers felt the original design was too similar to Indiana Jones. Paramount Pictures, which distributed the Indiana Jones film series, would later make two films based on the Tomb Raider games.\n* The producer of the Prince of Persia (2008) video game, Ben Mattes, explained that its \"inspiration was anything Harrison Ford has ever done: Indiana Jones, Han Solo.\"As quoted in Gary Steinman, \"Prince of Persia: Anatomy of a Prince,\" PlayStation: The Official Magazine 13 (December 2008): 50.\n* The video game series Uncharted is also very heavily influenced and inspired by Indiana Jones. The protagonist, Nathan Drake, also shares many similarities with Jones himself, both visually and personality-wise. The design team felt the sources shared themes of mystery and \"what-if scenarios\" that romanticized adventure and aimed to include those in Uncharted.\n* The Lego character Johnny Thunder is derived from Indiana Jones, among other influences. For one, he is Australian (like Steve Irwin the Crocodile Hunter). His clothes are also different, as he sports a slouch hat instead of a fedora, a red bandanna, and a tan shirt. Plus, he has a visible mustache and sideburns.\n* The roguelike NetHack features the role of archaeologist, an adventurer starting the game with the trademark fedora, bullwhip and leather jacket.\n*Montezuma's Revenge character Panama Joe (who was originally a Mexican named Pedro) shares a lot of similaries to Indy http://img.gamefaqs.net/box/5/3/0/45530_front.jpg however, it is a coindence as neither Jaeger or Parker bros. knew about Indy at that time http://www.digitpress.com/library/interviews/interview_robert_jaeger.html\n*Also Montezuma's Return! character Max Montezuma (or at least in the Game Boy/Game Boy color version) shares a lot of similarities with Indy as well\n*Blizzard Entertainment made a big homage to the Indiana Jones character in their MMO game World of Warcraft. The character 'Harrison Jones' (named after the movie character and the actor portraying it) is the nominal leader of a league of archaeologists which opposes various unsavoury villains in situations that references the various movies. The same 'Harrison Jones' makes an appearance in their Hearthstone CCG, along with Indiana's/Harrison's trademark hat.\n*My Little Pony: Friendship Is Magic, Daring Do is a pegasus and main character of the fictional Daring Do adventure novel series parodying Indiana Jones. Indiana Jones. http://en.wikipedia.org/?curid=14814."
  }
}
