{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12076",
  "eid" : "ffee0c80-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778509128,
  "textBody" : "The foreign relations of Ghana are controlled by the Ministry of Foreign Affairs of Ghana. Ghana is active in the United Nations and many of its specialised agencies, the World Trade Organization, the Non-Aligned Movement, the Organisation of African Unity (OAU), the African Union (AU) and the Economic Community of West African States. Generally, it follows the consensus of the Non-aligned Movement and the OAU on economic and political issues not directly affecting its own interests. Ghana has been extremely active in international peacekeeping activities under UN auspices in Lebanon, Afghanistan, Rwanda, and the Balkans, in addition to an eight-year sub-regional initiative with its ECOWAS partners to develop and then enforce a cease-fire in Liberia. Ghana is also a member of the International Criminal Court.\n\nGuiding principles and objectives\n\nGhana's foreign policy since independence has been characterised by a commitment to the principles and ideals of non-alignment and Pan-Africanism as first enunciated by Kwame Nkrumah in the early 1960s. For Nkrumah, non-alignment meant complete independence from the policies and alliances of both East and West and support for a worldwide union of so-called non-aligned nations as a counter to both East and West power blocs. Pan-Africanism, by contrast, was a specifically African policy that envisioned the independence of Africa from Western colonialism and the eventual economic and political unity of the African continent.Owusu, Maxwell. \"Guiding Principles and Objectives\". A Country Study: Ghana (La Verle Berry, editor). Library of Congress Federal Research Division (November 1994). This article incorporates text from this source, which is in the public domain.[http://lcweb2.loc.gov/frd/cs/about.html]\n\nThe PNDC, like most of its predecessors, made serious and consistent attempts at the practical application of these ideals and principles, and its successor, the NDC government, promises to follow in the PNDC's footsteps. Under the NDC, Ghana remains committed to the principle of non-alignment in world politics. Ghana is also opposed to interference in the internal affairs of both small and large countries. This is a departure from Nkrumah's foreign policy approach; Nkrumah was frequently accused of subverting African regimes, such as Togo and Ivory Coast, which he considered ideologically conservative. The NDC government, like the PNDC before it, believes in the principle of self-determination, including the right to political independence and the right of people to pursue their economic and social development free from external interference. Another feature of NDC rule carried over from the PNDC era is faithfulness to what a leading scholar of Africa has called \"one of the most successful neoclassical economic reform efforts supported by the IMF and the World Bank.\"\n\nThe broad objectives of Ghana's foreign policy thus include maintaining friendly relations and cooperation with all countries that desire such cooperation, irrespective of ideological considerations, on the basis of mutual respect and non-interference in each other's internal affairs. Africa and its liberation and unity are naturally the cornerstones of Ghana's foreign policy. As a founding member of the Organisation of African Unity (OAU), NDC policy is to adhere faithfully to the OAU Charter.\n\nAnother important principle of Ghana's foreign policy involves the closest possible cooperation with neighbouring countries with which the people of Ghana share cultural history, ties of blood, and economics. The results have included various bilateral trade and economic agreements and permanent joint commissions involving Ghana and its immediate neighbours, sometimes in the face of latent ideological and political differences and mutual suspicion, as well as numerous reciprocal state visits by high-ranking officials. These measures have contributed significantly to subregional cooperation, development, and the reduction of tension.\n\nAs an example of Ghana's interest in regional cooperation, the country enthusiastically endorsed formation of the Economic Community of West African States (ECOWAS) in 1975. This organisation was created specifically to foster inter-regional economic and political cooperation. It has served as a useful vehicle for contacts with neighbouring West African governments and for channelling increased Ghanaian exports to regional markets. Since 1990 ECOWAS has been engaged in a peacekeeping mission in Liberia to which Ghana has contributed a large contingent of troops. Ghana has participated in other international peacekeeping efforts as well, sending soldiers to operations of the United Nations (UN) in Cambodia in 1992-93 and Rwanda in 1993-94.\n\nIn August 1994, Rawlings became ECOWAS chairman, a post that had eluded him since the PNDC came to power. He immediately undertook several initiatives to reduce tensions and conflict in West Africa. Notable among them was the Akosombo Accord of September 12, designed to end civil war in Liberia.\n\nStrategic bilateral relations\n\nStrategic Africa\n\nBurkina Faso\n\n;Bordering state \n\nWith the coming to power of Thomas Sankara in Burkina Faso in 1983, relations between Ghana and Burkina became both warm and close. Indeed, Rawlings and Sankara began discussions about uniting Ghana and Burkina in the manner of the defunct Ghana-Guinea-Mali Union, which Nkrumah had sought unsuccessfully to promote as a foundation for his dream of unified continental government. Political and economic ties between Ghana and Burkina, a poorer country, were strengthened through joint commissions of cooperation and through border demarcation committee meetings. Frequent high-level consultations and joint military exercises, meant to discourage potential dissidents and to protect young \"revolutions\" in each country, were fairly regular features of Ghana-Burkina relations.Owusu, Maxwell. \"Burkina\". A Country Study: Ghana (La Verle Berry, editor). Library of Congress Federal Research Division (November 1994). This article incorporates text from this source, which is in the public domain.[http://lcweb2.loc.gov/frd/cs/about.html]\n\nIvory Coast\n\n;Bordering state \n\nGhana-Ivory Coast relations suffered from the same ups and downs that characterised Ghana-Togo relations. In early 1984, the PNDC government complained that Ivory Coast was allowing Ghanaian dissidents to use its territory as a base from which to carry out acts of sabotage against Ghana.  Ghana also accused Ivory Coast of granting asylum to political agitators wanted for crimes in Ghana. Relations between Ghana and Ivory Coast improved significantly, however, after 1988.  In 1989, after fifteen years of no progress, the Ghana-Ivory Coast border re-demarcation commission finally agreed on the definition of the 640-kilometer border between the two countries. The PNDC thereafter worked to improve the transportation and communication links with both Ivory Coast and Togo, despite problems with both countries.Owusu, Maxwell. \"Relations with Immediate African Neighbours\". A Country Study: Ghana (La Verle Berry, editor). Library of Congress Federal Research Division (November 1994). This article incorporates text from this source, which is in the public domain.[http://lcweb2.loc.gov/frd/cs/about.html]\n\nTogo\n\n;Bordering state \n\nThe strains in Ghana-Togo relations stretch back to pre-independence days. After 1918, following the defeat of Germany, the League of Nations divided the German colony of Togoland from north to south, a decision that divided the Ewe people among the Gold Coast, British Togoland, and French Togoland. After 1945, the United Nations took over the Togoland mandates.  During the 1950s, when the independence of Ghana was in sight, demands grew for a separate Ewe state, an idea that Kwame Nkrumah, leader of the Gold Coast independence movement, opposed.  Following a UN plebiscite in May 1956, in which a majority of the Ewe voted for union with Ghana, British Togoland became part of the Gold Coast.  After Togolese independence in 1960, relations between Togo and Ghana deteriorated, aggravated by political differences and incidents such as smuggling across their common border. At times, relations have verged on open aggression.\n\nThe result of the transfer of Togoland to Ghana has meant that many Togolese keep one foot on either side of the border, living in Ghana by night and working in the markets of the capital, Lomé, by day.\n\nSouth Africa\n\n;Strategic Africa and Antarctic\n\nSouth Africa has a high commission in Ghana and Ghana has a high commission in Pretoria.\n\nNigeria\n\nDespite close cultural ties, diplomatic relations between the two countries have in many instances been volatile. After the takeover in November 1993 by General Sani Abacha as the new Nigerian head of state, Ghana and Nigeria continued to consult on economic, political, and security issues affecting the two countries and West Africa as a whole.  Between early August 1994 when Rawlings became ECOWAS chairman and the end of the following October, the Ghanaian president visited Nigeria three times to discuss the peace process in Liberia and measures to restore democracy in that country.\n\nStrategic East Asia\n\nChina\n\nGhana's relations with the People's Republic of China (PRC) date back to 1960 when President Nkrumah became one of Africa's first leaders to recognise the country.  Ghana and the PRC have had close and relatively good relations in that time despite a short period of relatively cold relations after Nkrumah was deposed in 1966.\n\nJapan\n\nGhana and Japan maintain a special relationship and Japan has an embassy in Ghana and Ghana has an embassy in Tokyo.\n\nSouth Korea\n\nEstablishment of diplomatic relations between the Republic of Korea and the Republic of Ghana was on 14 November 1977. The number of South Koreans living in Ghana in 2011 was 691.http://www.mofa.go.kr/ENG/countries/middleeast/countries/20070824/1_24460.jsp?menu=m_30_50\n\nStrategic South Asia\n\nIndia\n\nGhana and India maintain an historic special relationship and India has a High Commission in Accra and Ghana has an High Commission in New Delhi.\n\nPakistan\n\nPakistan and Ghana enjoy amicable and cordial relations. There has been historical support extended by Pakistan to the African states particularly OIC member states in which Ghana has significant importance. Despite this, there have been low level of bilateral trade between the two countries. Volume of bilateral trade during 2011 was just $19 million.[http://www.thenews.com.pk/Todays-News-2-135304-Pakistan-Ghana Pakistan-Ghana]. thenews.com.pk.\n\nBangladesh\n\nBangladesh has an embassy in Accra and Ghana has an embassy in Dhaka.\n\nStrategic South East Asia\n\nMalaysia\n\nGhana has a high commission in Kuala Lumpur, and Malaysia has a high commission in Accra.\n\nIndonesia\n\nIndonesia has no Embassy in Ghana and Ghana Embassy in Kuala Lumpur, Malaysia is accredited to Indonesia. While Indonesian Embassy in Abuja, Nigeria is accredited to Ghana.\n\nSingapore\n\nGhana and Singapore maintain an historic special relationship and Singapore has an embassy in Ghana and Ghana has an embassy in Downtown Core.\n\nThailand\n\nThe Mission of Thailand accredited to Ghana is the Royal Thai Embassy in Abuja, Nigeria, while the High Commission of Ghana in Kuala Lumpur is accredited to Thailand.\n\nVietnam\n\nVietnam has an embassy in Ghana and Ghana has an embassy in Hanoi.\n\nStrategic Arctic and Eurasia\n\nRussia\n\nRussia has an embassy in Accra, and Ghana has an embassy in Moscow. In 2008, assurances from Russia's ambassador to Ghana concerning assistance to sustain the fight against mosquitoes and environmental pollution in the region were very much appreciated since they were the major problems confronting Accra.\n\nDenmark\n\n;Strategic Scandinavia\nDenmark has historic relations with Ghana from once possessing Danish Gold Coast and Denmark has an embassy in Ghana and Ghana has an embassy in Copenhagen.\n\nStrategic Persian Gulf and Middle East\n\nIran\n\nGhana and Iran maintain an historic special relationship and Iran has an embassy in Ghana and Ghana has an embassy in Tehran.\n\nStrategic Caribbean\n\nCuba\n\nGhana and Cuba maintain a historic special relationship and Cuba has an embassy in Ghana and Ghana has an embassy in Havana.\n\nJamaica\n\nGhana and Jamaica maintain an historic special relationship and Jamaica has an embassy in Ghana and Ghana has an embassy in Kingston.\n\nStrategic South America\n\nBrazil\n\nGhana and Brazil maintain a special relationship and Brazil has an embassy in Ghana and Ghana has an embassy in Brasília.\n\nColombia\n\nGhana and Colombia’s diplomatic relations dated back to 1988 but it remained dormant until July 2013 when Colombia opened its embassy in Accra. Colombia helps Ghana by providing assistance on building capacity of the Ghana Police Service, Immigration Service and the Narcotics Control Board on cybersecurity and drug trafficking.\n\nStrategic Oceania\n\nAustralia\n\nGhana and Australia maintain a special relationship and Australia has a high commission in Ghana and Ghana has a high commission in Canberra.\n\nGhana also has a Consulate-General in Sydney, New South Wales.\n\nBilateral relations\n\nArmenia\n\nBoth countries established diplomatic relations on 29 May 1992.\n\nCanada\n\nCanada has a High Commission in Ghana and Ghana has an High Commission in Ottawa.\n\nEgypt\n\nEgypt has an embassy in Ghana and Ghana has an embassy in Cairo.\n\nKosovo\n\nGhana officially recognised the Republic of Kosovo on 23 January 2012.[http://www.mfa-ks.net/?page2,4,1090 Ghana Republic – the 86th country recognising the Independence of Kosovo], Ministry of Foreign Affairs of the Republic of Kosovo, 2012-01-23 Ghana and Kosovo later established diplomatic relations on 4 October 2012.[http://www.ambasada-ks.net/us/?page\n2,8,72 The Republic of Kosovo establishes diplomatic relations with the Republic of Ghana], Embassy of the Republic of Kosovo in the United States, Washington, DC, 2012-10-02\n\nIsrael\n\nIsrael has an embassy in Ghana and Ghana has an embassy in Tel Aviv.\n\nUnited States\n\nThe United States is among Ghana's trading partners. The Office of the President of Ghana worked closely with the U.S. Embassy in Accra to establish an American Chamber of Commerce to continue to develop closer economic ties in the private sector. Major U.S. companies operating in the country include ACS, CMS Energy, Coca-Cola, S.C. Johnson, Ralston Purina, Star-Kist, A.H. Robins, Sterling, Pfizer, IBM, 3M, Motorola, Stewart & Stevenson, PriceWaterhouseCoopers, and National Cash Register (NCR). Several U.S. firms recently made or are considering investments in Ghana, primarily in gold mining, wood products, and petroleum. U.S. mining giant Newmont entered Ghana's mining sector in 2004 and intends to invest up to $1 billion. In late 1997, Nuevo Petroleum concluded an oil exploration agreement accounting for one of Ghana's offshore mineral rights zones. Several other U.S. oil companies also are engaged in offshore exploration.\n\nGhana and the Commonwealth of Nations\n\nGhana has been a member state of the Commonwealth since independence in 1957, firstly as a Dominion, then as a Commonwealth republic.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Foreign relations of Ghana" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12076" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The foreign relations of Ghana are controlled by the Ministry of Foreign Affairs of Ghana. Ghana is active in the United Nations and many of its specialised agencies, the World Trade Organization, the Non-Aligned Movement, the Organisation of African Unity (OAU), the African Union (AU) and the Economic Community of West African States. Generally, it follows the consensus of the Non-aligned Movement and the OAU on economic and political issues not directly affecting its own interests. Ghana has been extremely active in international peacekeeping activities under UN auspices in Lebanon, Afghanistan, Rwanda, and the Balkans, in addition to an eight-year sub-regional initiative with its ECOWAS partners to develop and then enforce a cease-fire in Liberia. Ghana is also a member of the International Criminal Court.\n\nGuiding principles and objectives\n\nGhana's foreign policy since independence has been characterised by a commitment to the principles and ideals of non-alignment and Pan-Africanism as first enunciated by Kwame Nkrumah in the early 1960s. For Nkrumah, non-alignment meant complete independence from the policies and alliances of both East and West and support for a worldwide union of so-called non-aligned nations as a counter to both East and West power blocs. Pan-Africanism, by contrast, was a specifically African policy that envisioned the independence of Africa from Western colonialism and the eventual economic and political unity of the African continent.Owusu, Maxwell. \"Guiding Principles and Objectives\". A Country Study: Ghana (La Verle Berry, editor). Library of Congress Federal Research Division (November 1994). This article incorporates text from this source, which is in the public domain.[http://lcweb2.loc.gov/frd/cs/about.html]\n\nThe PNDC, like most of its predecessors, made serious and consistent attempts at the practical application of these ideals and principles, and its successor, the NDC government, promises to follow in the PNDC's footsteps. Under the NDC, Ghana remains committed to the principle of non-alignment in world politics. Ghana is also opposed to interference in the internal affairs of both small and large countries. This is a departure from Nkrumah's foreign policy approach; Nkrumah was frequently accused of subverting African regimes, such as Togo and Ivory Coast, which he considered ideologically conservative. The NDC government, like the PNDC before it, believes in the principle of self-determination, including the right to political independence and the right of people to pursue their economic and social development free from external interference. Another feature of NDC rule carried over from the PNDC era is faithfulness to what a leading scholar of Africa has called \"one of the most successful neoclassical economic reform efforts supported by the IMF and the World Bank.\"\n\nThe broad objectives of Ghana's foreign policy thus include maintaining friendly relations and cooperation with all countries that desire such cooperation, irrespective of ideological considerations, on the basis of mutual respect and non-interference in each other's internal affairs. Africa and its liberation and unity are naturally the cornerstones of Ghana's foreign policy. As a founding member of the Organisation of African Unity (OAU), NDC policy is to adhere faithfully to the OAU Charter.\n\nAnother important principle of Ghana's foreign policy involves the closest possible cooperation with neighbouring countries with which the people of Ghana share cultural history, ties of blood, and economics. The results have included various bilateral trade and economic agreements and permanent joint commissions involving Ghana and its immediate neighbours, sometimes in the face of latent ideological and political differences and mutual suspicion, as well as numerous reciprocal state visits by high-ranking officials. These measures have contributed significantly to subregional cooperation, development, and the reduction of tension.\n\nAs an example of Ghana's interest in regional cooperation, the country enthusiastically endorsed formation of the Economic Community of West African States (ECOWAS) in 1975. This organisation was created specifically to foster inter-regional economic and political cooperation. It has served as a useful vehicle for contacts with neighbouring West African governments and for channelling increased Ghanaian exports to regional markets. Since 1990 ECOWAS has been engaged in a peacekeeping mission in Liberia to which Ghana has contributed a large contingent of troops. Ghana has participated in other international peacekeeping efforts as well, sending soldiers to operations of the United Nations (UN) in Cambodia in 1992-93 and Rwanda in 1993-94.\n\nIn August 1994, Rawlings became ECOWAS chairman, a post that had eluded him since the PNDC came to power. He immediately undertook several initiatives to reduce tensions and conflict in West Africa. Notable among them was the Akosombo Accord of September 12, designed to end civil war in Liberia.\n\nStrategic bilateral relations\n\nStrategic Africa\n\nBurkina Faso\n\n;Bordering state \n\nWith the coming to power of Thomas Sankara in Burkina Faso in 1983, relations between Ghana and Burkina became both warm and close. Indeed, Rawlings and Sankara began discussions about uniting Ghana and Burkina in the manner of the defunct Ghana-Guinea-Mali Union, which Nkrumah had sought unsuccessfully to promote as a foundation for his dream of unified continental government. Political and economic ties between Ghana and Burkina, a poorer country, were strengthened through joint commissions of cooperation and through border demarcation committee meetings. Frequent high-level consultations and joint military exercises, meant to discourage potential dissidents and to protect young \"revolutions\" in each country, were fairly regular features of Ghana-Burkina relations.Owusu, Maxwell. \"Burkina\". A Country Study: Ghana (La Verle Berry, editor). Library of Congress Federal Research Division (November 1994). This article incorporates text from this source, which is in the public domain.[http://lcweb2.loc.gov/frd/cs/about.html]\n\nIvory Coast\n\n;Bordering state \n\nGhana-Ivory Coast relations suffered from the same ups and downs that characterised Ghana-Togo relations. In early 1984, the PNDC government complained that Ivory Coast was allowing Ghanaian dissidents to use its territory as a base from which to carry out acts of sabotage against Ghana.  Ghana also accused Ivory Coast of granting asylum to political agitators wanted for crimes in Ghana. Relations between Ghana and Ivory Coast improved significantly, however, after 1988.  In 1989, after fifteen years of no progress, the Ghana-Ivory Coast border re-demarcation commission finally agreed on the definition of the 640-kilometer border between the two countries. The PNDC thereafter worked to improve the transportation and communication links with both Ivory Coast and Togo, despite problems with both countries.Owusu, Maxwell. \"Relations with Immediate African Neighbours\". A Country Study: Ghana (La Verle Berry, editor). Library of Congress Federal Research Division (November 1994). This article incorporates text from this source, which is in the public domain.[http://lcweb2.loc.gov/frd/cs/about.html]\n\nTogo\n\n;Bordering state \n\nThe strains in Ghana-Togo relations stretch back to pre-independence days. After 1918, following the defeat of Germany, the League of Nations divided the German colony of Togoland from north to south, a decision that divided the Ewe people among the Gold Coast, British Togoland, and French Togoland. After 1945, the United Nations took over the Togoland mandates.  During the 1950s, when the independence of Ghana was in sight, demands grew for a separate Ewe state, an idea that Kwame Nkrumah, leader of the Gold Coast independence movement, opposed.  Following a UN plebiscite in May 1956, in which a majority of the Ewe voted for union with Ghana, British Togoland became part of the Gold Coast.  After Togolese independence in 1960, relations between Togo and Ghana deteriorated, aggravated by political differences and incidents such as smuggling across their common border. At times, relations have verged on open aggression.\n\nThe result of the transfer of Togoland to Ghana has meant that many Togolese keep one foot on either side of the border, living in Ghana by night and working in the markets of the capital, Lomé, by day.\n\nSouth Africa\n\n;Strategic Africa and Antarctic\n\nSouth Africa has a high commission in Ghana and Ghana has a high commission in Pretoria.\n\nNigeria\n\nDespite close cultural ties, diplomatic relations between the two countries have in many instances been volatile. After the takeover in November 1993 by General Sani Abacha as the new Nigerian head of state, Ghana and Nigeria continued to consult on economic, political, and security issues affecting the two countries and West Africa as a whole.  Between early August 1994 when Rawlings became ECOWAS chairman and the end of the following October, the Ghanaian president visited Nigeria three times to discuss the peace process in Liberia and measures to restore democracy in that country.\n\nStrategic East Asia\n\nChina\n\nGhana's relations with the People's Republic of China (PRC) date back to 1960 when President Nkrumah became one of Africa's first leaders to recognise the country.  Ghana and the PRC have had close and relatively good relations in that time despite a short period of relatively cold relations after Nkrumah was deposed in 1966.\n\nJapan\n\nGhana and Japan maintain a special relationship and Japan has an embassy in Ghana and Ghana has an embassy in Tokyo.\n\nSouth Korea\n\nEstablishment of diplomatic relations between the Republic of Korea and the Republic of Ghana was on 14 November 1977. The number of South Koreans living in Ghana in 2011 was 691.http://www.mofa.go.kr/ENG/countries/middleeast/countries/20070824/1_24460.jsp?menu=m_30_50\n\nStrategic South Asia\n\nIndia\n\nGhana and India maintain an historic special relationship and India has a High Commission in Accra and Ghana has an High Commission in New Delhi.\n\nPakistan\n\nPakistan and Ghana enjoy amicable and cordial relations. There has been historical support extended by Pakistan to the African states particularly OIC member states in which Ghana has significant importance. Despite this, there have been low level of bilateral trade between the two countries. Volume of bilateral trade during 2011 was just $19 million.[http://www.thenews.com.pk/Todays-News-2-135304-Pakistan-Ghana Pakistan-Ghana]. thenews.com.pk.\n\nBangladesh\n\nBangladesh has an embassy in Accra and Ghana has an embassy in Dhaka.\n\nStrategic South East Asia\n\nMalaysia\n\nGhana has a high commission in Kuala Lumpur, and Malaysia has a high commission in Accra.\n\nIndonesia\n\nIndonesia has no Embassy in Ghana and Ghana Embassy in Kuala Lumpur, Malaysia is accredited to Indonesia. While Indonesian Embassy in Abuja, Nigeria is accredited to Ghana.\n\nSingapore\n\nGhana and Singapore maintain an historic special relationship and Singapore has an embassy in Ghana and Ghana has an embassy in Downtown Core.\n\nThailand\n\nThe Mission of Thailand accredited to Ghana is the Royal Thai Embassy in Abuja, Nigeria, while the High Commission of Ghana in Kuala Lumpur is accredited to Thailand.\n\nVietnam\n\nVietnam has an embassy in Ghana and Ghana has an embassy in Hanoi.\n\nStrategic Arctic and Eurasia\n\nRussia\n\nRussia has an embassy in Accra, and Ghana has an embassy in Moscow. In 2008, assurances from Russia's ambassador to Ghana concerning assistance to sustain the fight against mosquitoes and environmental pollution in the region were very much appreciated since they were the major problems confronting Accra.\n\nDenmark\n\n;Strategic Scandinavia\nDenmark has historic relations with Ghana from once possessing Danish Gold Coast and Denmark has an embassy in Ghana and Ghana has an embassy in Copenhagen.\n\nStrategic Persian Gulf and Middle East\n\nIran\n\nGhana and Iran maintain an historic special relationship and Iran has an embassy in Ghana and Ghana has an embassy in Tehran.\n\nStrategic Caribbean\n\nCuba\n\nGhana and Cuba maintain a historic special relationship and Cuba has an embassy in Ghana and Ghana has an embassy in Havana.\n\nJamaica\n\nGhana and Jamaica maintain an historic special relationship and Jamaica has an embassy in Ghana and Ghana has an embassy in Kingston.\n\nStrategic South America\n\nBrazil\n\nGhana and Brazil maintain a special relationship and Brazil has an embassy in Ghana and Ghana has an embassy in Brasília.\n\nColombia\n\nGhana and Colombia’s diplomatic relations dated back to 1988 but it remained dormant until July 2013 when Colombia opened its embassy in Accra. Colombia helps Ghana by providing assistance on building capacity of the Ghana Police Service, Immigration Service and the Narcotics Control Board on cybersecurity and drug trafficking.\n\nStrategic Oceania\n\nAustralia\n\nGhana and Australia maintain a special relationship and Australia has a high commission in Ghana and Ghana has a high commission in Canberra.\n\nGhana also has a Consulate-General in Sydney, New South Wales.\n\nBilateral relations\n\nArmenia\n\nBoth countries established diplomatic relations on 29 May 1992.\n\nCanada\n\nCanada has a High Commission in Ghana and Ghana has an High Commission in Ottawa.\n\nEgypt\n\nEgypt has an embassy in Ghana and Ghana has an embassy in Cairo.\n\nKosovo\n\nGhana officially recognised the Republic of Kosovo on 23 January 2012.[http://www.mfa-ks.net/?page2,4,1090 Ghana Republic – the 86th country recognising the Independence of Kosovo], Ministry of Foreign Affairs of the Republic of Kosovo, 2012-01-23 Ghana and Kosovo later established diplomatic relations on 4 October 2012.[http://www.ambasada-ks.net/us/?page\n2,8,72 The Republic of Kosovo establishes diplomatic relations with the Republic of Ghana], Embassy of the Republic of Kosovo in the United States, Washington, DC, 2012-10-02\n\nIsrael\n\nIsrael has an embassy in Ghana and Ghana has an embassy in Tel Aviv.\n\nUnited States\n\nThe United States is among Ghana's trading partners. The Office of the President of Ghana worked closely with the U.S. Embassy in Accra to establish an American Chamber of Commerce to continue to develop closer economic ties in the private sector. Major U.S. companies operating in the country include ACS, CMS Energy, Coca-Cola, S.C. Johnson, Ralston Purina, Star-Kist, A.H. Robins, Sterling, Pfizer, IBM, 3M, Motorola, Stewart & Stevenson, PriceWaterhouseCoopers, and National Cash Register (NCR). Several U.S. firms recently made or are considering investments in Ghana, primarily in gold mining, wood products, and petroleum. U.S. mining giant Newmont entered Ghana's mining sector in 2004 and intends to invest up to $1 billion. In late 1997, Nuevo Petroleum concluded an oil exploration agreement accounting for one of Ghana's offshore mineral rights zones. Several other U.S. oil companies also are engaged in offshore exploration.\n\nGhana and the Commonwealth of Nations\n\nGhana has been a member state of the Commonwealth since independence in 1957, firstly as a Dominion, then as a Commonwealth republic. Foreign relations of Ghana. http://en.wikipedia.org/?curid=12076."
  }
}
