{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12521",
  "eid" : "03220e60-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778514502,
  "textBody" : "Geneva (, , , , , ) is the second most populous city in Switzerland (after Zürich) and is the most populous city of the Romandy, the French-speaking part of Switzerland. Situated where the Rhône exits Lake Geneva, it is the capital of the Republic and Canton of Geneva.\n\nThe municipality (ville de Genève) has a population () of , and the canton (which is essentially the city and its inner-ring suburbs) has  residents. In 2014, the compact agglomération du Grand Genève had 946,000 inhabitants in 212 communities in both Switzerland and France.[http://www.grand-geneve.org/grand-geneve/le-territoire/chiffres-cles Grand-Geneve website]  accessed 14 July 2016 Within Swiss territory, the commuter area named \"Métropole lémanique\" contains a population of 1.26 million. This area is essentially spread east from Geneva towards the Riviera area (Vevey, Montreux) and north-east towards Yverdon-les-Bains, in the neighbouring canton of Vaud.\n\nGeneva is a global city, a financial center, and worldwide center for diplomacy due to the presence of numerous international organizations, including the headquarters of many of the agencies of the United Nations and the Red Cross. Geneva is the city that hosts the highest number of international organizations in the world.François Modoux, \"La Suisse engagera 300 millions pour rénover le Palais des Nations\", Le Temps, Friday 28 June 2013, page 9. It is also the place where the Geneva Conventions were signed, which chiefly concern the treatment of wartime non-combatants and prisoners of war.\n\nIn 2017 Geneva was ranked as the world's fifteenth most important financial centre for competitiveness by the Global Financial Centres Index, fifth in Europe behind London, Zürich, Frankfurt and Luxembourg. A 2009 survey by Mercer found that Geneva has the third-highest quality of life of any city in the world (behind Vienna and Zürich for expatriates; it is narrowly outranked by Zürich)., last updated 28 April 2009. The city has been referred to as the world's most compact metropolis and the \"Peace Capital\". In 2017, Geneva was ranked as the seventh most expensive city in the world.\n\nToponym \n\nThe city was mentioned in Latin texts, by Caesar, with the spelling Genava,Hans-Friedrich Mueller, Caesar Selections from His Commentarii De Bello Gallico, Bolchazy-Carducci Publishers, 2012, p. 34. probably from a Celtic toponym *genawa- from the stem *genu- (\"bend, knee\"), in the sense of a bending river or estuary.John T. Koch, Celtic culture: a historical encyclopedia, ABC-CLIO, 2006, p. 1513.\n\nThe medieval county of Geneva in Middle Latin was known as  pagus major Genevensis or Comitatus Genevensis (also Gebennensis), after 1400 becoming the Genevois province  of Savoy (albeit not extending to the city proper, until the Reformation the seat of the bishop of Geneva).Pour cette citation et le découpage suivant, organisation décrite par l'ouvrage Jules-Joseph Vernier, Étude historique et géographique sur la Savoie, Le Livre d'Histoire - Res Universis (réimpr. 1993) (1re éd. 1896), p. 137.\n\nThe name takes various forms in modern languages, Geneva in English, ,Word Reference: [http://www.wordreference.com/fren/Gen%C3%A8ve Genève].  , , and .\n\nThe city in origin shares its name, *genawa \"estuary\", with the Italian port city of Genoa (in Italian Genova).\n\nHistory \n\nGeneva was an Allobrogian border town, fortified against the Helvetii tribe, when the Romans took it in 121 BC. It  became Christian under the Late Roman Empire, and acquired its first bishop in the 5th century, having been connected to the bishopric of Vienne in the 4th.\n\nIn the Middle Ages, Geneva was ruled by a count under the Holy Roman Empire until the late 14th century, when it was granted a charter giving it a high degree of self-governance. Around this time the House of Savoy came to (at least nominally) dominate the city. In the 15th century, an oligarchic republican government emerged with the creation of the Grand Council. In the first half of the 16th century, the Protestant Reformation reached the city, causing religious strife during which Savoy rule was thrown off and Geneva allied itself  with  the Swiss Confederacy. \nIn 1541, with Protestantism in the ascendancy, John Calvin, the founder of Calvinism, became the spiritual leader of the city. By the 18th century, however, Geneva had come under the influence of Catholic France, which cultivated the city as its own. France also tended to be at odds with the ordinary townsfolk, which inspired the failed Geneva Revolution of 1782 in an attempt to win representation in the government for men of modest means. In 1798, revolutionary France under the Directory annexed Geneva. At the end of the Napoleonic Wars, on 1 June 1814, Geneva was admitted to the Swiss Confederation. In 1907, the separation of Church and State was adopted. Geneva flourished in the 19th and 20th centuries, becoming the seat of many international organizations.\n\nGeography and climate\n\nTopography\n\nGeneva is located at 46°12' North, 6°09' East, at the south-western end of Lake Geneva, where the lake flows out to form the Rhône again. It is entirely surrounded by three mountain chains all belonging to the Jura: the Jura main range north-westward, the Vuache southward, and the Salève south-eastward.\n\nThe city has an area of , while the area of the canton is 282 km2, including the two small exclaves of Céligny in Vaud. The part of the lake that is attached to Geneva has an area of 38 km2 and is sometimes referred to as Petit lac (small lake). The canton has only a  long border with the rest of Switzerland. Of  of border, 103 are shared with France, the Département de l'Ain to the north and west and the Département de la Haute-Savoie to the south and east.\n\nOf the land in the city,  or 1.5% is used for agricultural purposes, while  or 3.1% is forested.   Of the rest of the land,  or 91.8% is settled (buildings or roads),  or 3.1% is either rivers or lakes and  or 0.1% is unproductive land.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/02/03/blank/data/gemeindedaten.html Swiss Federal Statistical Office-Land Use Statistics] 2009 data  accessed 25 March 2010\n\nOf the built up area, industrial buildings made up 3.4% of the area while housing and buildings made up 46.2% and transportation infrastructure 25.8%, while parks, green belts and sports fields made up 15.7%.  All the forested land area is covered with heavy forests.  Of the agricultural land, 0.3% is used for growing crops.  Of the water in the municipality, 0.2% is in lakes and 2.9% is in rivers and streams.\n\nThe altitude of Geneva is , and corresponds to the altitude of the largest of the Pierres du Niton, two large rocks emerging from the lake which date from the last ice age. This rock was chosen by General Guillaume Henri Dufour as the reference point for surveying in Switzerland.Swisstopo, [http://www.swisstopo.ch/en/basics/geo/faq/horizon Height reference for Switzerland]. Retrieved 1 February 2007. \nThe second main river of Geneva is the Arve which flows into the Rhône just west of the city centre. Mont Blanc can be seen from Geneva and is an hour's drive from the city centre.\n\nClimate\n\nThe climate of Geneva is temperate, oceanic (Köppen: Cfb). Winters are cool, usually with light frosts at night and thawing conditions during the day. Summers are relatively warm. Precipitation is adequate and is relatively well-distributed throughout the year, although autumn is slightly wetter than the other seasons. Ice storms near Lac Léman are quite normal in the winter. In the summer many people enjoy swimming in the lake, and frequently patronise public beaches such as Genève Plage and the Bains des Pâquis. Geneva, in certain years, receives snow in the colder months of the year. The nearby mountains are subject to substantial snowfall and are suitable for skiing. Many world-renowned ski resorts such as Verbier and Crans-Montana are just over two hours away by car. Mont Salève (1379 m), just across the border in France, dominates the southerly view from the city centre and Mont Blanc, the highest of the Alpine range is visible from most of the city, towering high above Chamonix, which along with Morzine, Le Grand Bornand, La Clusaz, and resorts of the Grand Massif such as Samoens, Morillon and Flaine, are the closest French skiing destinations to Geneva.\n\nDuring the years 2000–2009, the mean yearly temperature was 11 °C and the mean number of sunshine-hours per year was 2003.\n\nThe highest temperature recorded in Genève–Cointrin was  in July 2015, and the lowest temperature recorded was −20.0 °C (−4.0 °F) in February 1956.\n\nPolitics\n\nAdministrative divisions\n\nThe city is divided into eight quartiers, or districts, sometimes composed of several neighborhoods. On the Left Bank are (1) Jonction, (2) Centre. Plainpalais, and Acacias, (3) Eaux-Vives, and (4) Champel, while the Right Bank includes (1) Saint-Jean and Charmilles, (2) Servette and Petit-Saconnex, (3) Grottes and Saint-Gervais, and (4) Paquis and Nations.\n\nGovernment\n\nThe Administrational Council (Conseil administratif) constitutes the executive government of the City of Geneva and operates as a collegiate authority. It is composed of five councilors (), each presiding over a department. The president of the executive department acts as mayor (la/le maire). In the governmental year 2016/2017 the Administrational Council is presided by Monsieur le maire de Genève Guillaume Barazzone. Departmental tasks, coordination measures and implementation of laws decreed by the Municipal Council are carried by the Administrational Council. The election of the Administrational Council is held every five years. The current mandate period (la législature) is from 1 June 2015 to 31 May 2020. The delegates are elected by means of a system of Majorz. The mayor changes in turnus every year, while the heads of the other departments are assigned by the collegiate. The executive body holds its meetings in the Palais Eynard, near the Parc des Bastions. The building was built between 1817 and 1821 in Neoclassical style.\n\n, Geneva's Administrational Council is made up of two representatives of the PS (Social Democratic Party), and one member each of PES (Green Party, who is also the mayor for the current year), Ensemble à Gauche (an alliance of the left parties PST-POP (Parti Suisse du Travail – Parti Ouvrier et Populaire) and solidaritéS), and PDC (Christian Democratic Party), giving the left parties a very strong four out of five seats. The last election was held on 19 April 2015. All of the previous members were re-elected.\n\nParliament\n\nThe Municipal Council (Conseil municipal) holds legislative power. It is made up of 80 members, with elections held every five years. The Municipal Council decrees regulations and by-laws that are executed by the Administrational Council and the administration. The delegates are selected by means of a system of Proporz with a seven percentage threshold.\n\nThe sessions of the Municipal Council are public. Unlike members of the Administrational Council, members of the Municipal Council are not politicians by profession, and they are paid a fee based on their attendance. Any resident of Geneva allowed to vote can be elected as a member of the Municipal Council. The parliament holds its meetings in the Town Hall (Hôtel de Ville), in the old city.\n\nThe last election of the Municipal Council was held on 20 April 2015 for the mandate period (législature) of 2015–2020. Currently the Municipal Council consist of 19 members of the Social Democratic Party (PS), 15 Les Libéraux-Radicaux (PLR), 11 Christian Democratic People's Party (PDC), 11 Geneva Citizens' Movement (MCG,), 10 Ensemble à Gauche (an alliance of the left parties PST-POP (Parti Suisse du Travail – Parti Ouvrier et Populaire) and solidaritéS), 8 Green Party (PES), and 6 Swiss People's Party (UDC).\n\nElections\n\nNational Council\n\nIn the 2015 federal election for the Swiss National Council the most popular party was the PS which received 23.8% of the vote. The next three most popular parties were the PLR (17.6%), the UDC (16.3%), the Green Party (11.4%), the PDC (10.7%), and the solidaritéS (8.8%). In the federal election, a total of 36,490 voters were cast, and the voter turnout was 44.1%.\n\nInternational relations\n\nGeneva intentionally does not have any particular \"sister\" tie with any city in the world. It declares itself related to the entire world.\n\nDemographics\n\nPopulation\n\nGeneva has a population () of . The city of Geneva is at the centre of the Geneva metropolitan area, known as the Grand Genève in French (Greater Geneva). Greater Geneva includes the Canton of Geneva in its entirety as well as the District of Nyon in the Canton of Vaud and several areas in the neighboring French departments of Haute-Savoie and Ain. In 2011, the agglomération franco-valdo-genevoise had 915,000 inhabitants, two-thirds of whom lived on Swiss soil and one-third on French soil. The Geneva metropolitan area is experiencing steady demographic growth of 1.2% a year and the population of the agglomération franco-valdo-genevoise is expected to reach a total of one million people in the near future.\n\nThe official language of Geneva, in both the city and canton is French, the main language used in Romandie. As a result of immigration flows in the 1960s and 1980s, Italian, Portuguese and Spanish are also spoken by a considerable proportion of the population. English is also quite common due to the high number of anglophone expatriates and foreigners working in international institutions and in the bank sector. Lack of proficiency in French of English-speaking expatriates (even after years spent in Geneva) is an increasing concern.\n\nMost of the population () speaks French (128,622 or 72.3%), with English being second most common (7,853 or 4.4%) and Spanish third (7,462 or 4.2%).  There are 7,320 people who speak Italian (4.1%), 7,050 people who speak German (4.0%) and 113 people who speak Romansh.\n\nIn the city of Geneva, , 48% of the population are resident foreign nationals. For a list of the largest groups of foreign residents see the cantonal overview.\nOver the last 10 years (1999–2009) the population has changed at a rate of 7.2%.  It has changed at a rate of 3.4% due to migration and at a rate of 3.4% due to births and deaths.[http://www.bfs.admin.ch/bfs/portal/en/index/regionen/02/key.html Swiss Federal Statistical Office]  accessed 25-April-2011\n\n, the gender distribution of the population was 47.8% male and 52.2% female.  The population was made up of 46,284 Swiss men (24.2% of the population) and 45,127 (23.6%) non-Swiss men.  There were 56,091 Swiss women (29.3%) and 43,735 (22.9%) non-Swiss women.[http://www.ge.ch/statistique/domaines/01/01_02_1/tableaux.asp#1 Canton of Geneva Statistical Office] Population résidante du canton de Genève, selon l'origine et le sexe, par commune, en mars 2011 accessed 18 April 2011  Of the population in the municipality 43,296 or about 24.3% were born in Geneva and lived there in 2000.  There were 11,757 or 6.6% who were born in the same canton, while 27,359 or 15.4% were born somewhere else in Switzerland, and 77,893 or 43.8% were born outside of Switzerland.\n\nIn  there were 1,147 live births to Swiss citizens and 893 births to non-Swiss citizens, and in same time span there were 1,114 deaths of Swiss citizens and 274 non-Swiss citizen deaths.  Ignoring immigration and emigration, the population of Swiss citizens increased by 33 while the foreign population increased by 619.  There were 465 Swiss men and 498 Swiss women who emigrated from Switzerland.  At the same time, there were 2933 non-Swiss men and 2662 non-Swiss women who immigrated from another country to Switzerland.  The total Swiss population change in 2008 (from all sources, including moves across municipal borders) was an increase of 135 and the non-Swiss population increased by 3181 people.  This represents a population growth rate of 1.8%.[http://www.bfs.admin.ch/bfs/portal/de/index/infothek/onlinedb/superweb/login.html Swiss Federal Statistical Office – Superweb database – Gemeinde Statistics 1981–2008]   accessed 19 June 2010\n\nThe age distribution of the population () is children and teenagers (0–19 years old) make up 18.2% of the population, while adults (20–64 years old) make up 65.8% and seniors (over 64 years old) make up 16%.\n\n, there were 78,666 people who were single and never married in the municipality.  There were 74,205 married individuals, 10,006 widows or widowers and 15,087 individuals who are divorced.[https://www.pxweb.bfs.admin.ch/default.aspx?px_language\nde STAT-TAB Thema 40 - Eidgenössische Volkszählung (34)]   accessed 2 February 2011\n\n, there were 86,231 private households in the municipality, and an average of 1.9 persons per household.  There were 44,373 households that consist of only one person and 2,549 households with five or more people.  Out of a total of 89,269 households that answered this question, 49.7% were households made up of just one person and there were 471 adults who lived with their parents.  Of the rest of the households, there are 17,429 married couples without children, 16,607 married couples with children  There were 5,499 single parents with a child or children.  There were 1,852 households that were made up of unrelated people and 3,038 households that were made up of some sort of institution or another collective housing.\n\n there were 743 single family homes (or 10.6% of the total) out of a total of 6,990 inhabited buildings.  There were 2,758 multi-family buildings (39.5%), along with 2,886 multi-purpose buildings that were mostly used for housing (41.3%) and 603 other use buildings (commercial or industrial) that also had some housing (8.6%).  Of the single family homes 197 were built before 1919, while 20 were built between 1990 and 2000.  The greatest number of single family homes (277) were built between 1919 and 1945.[http://www.pxweb.bfs.admin.ch/Database/German_09%20-%20Bau-%20und%20Wohnungswesen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen.asp?lang\n1&prod09&secprod\n2&openChild=true Swiss Federal Statistical Office STAT-TAB – Datenwürfel für Thema 09.2 – Gebäude und Wohnungen]   accessed 28 January 2011\n\n there were 101,794 apartments in the municipality.  The most common apartment size was 3 rooms of which there were 27,084.  There were 21,889 single room apartments and 11,166 apartments with five or more rooms.  Of these apartments, a total of 85,330 apartments (83.8% of the total) were permanently occupied, while 13,644 apartments (13.4%) were seasonally occupied and 2,820 apartments (2.8%) were empty.  , the construction rate of new housing units was 1.3 new units per 1000 residents.\n\n the average price to rent an average apartment in Geneva was 1163.30 Swiss francs (CHF) per month (US$930, £520, €740 approx. exchange rate from 2003).  The average rate for a one-room apartment was 641.60 CHF (US$510, £290, €410), a two-room apartment was about 874.46 CHF (US$700, £390, €560), a three-room apartment was about 1126.37 CHF (US$900, £510, €720) and a six or more room apartment cost an average of 2691.07 CHF (US$2150, £1210, €1720).  The average apartment price in Geneva was 104.2% of the national average of 1116 CHF.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/05/06/blank/key/einfuehrung.html Swiss Federal Statistical Office-Rental prices] 2003 data  accessed 26 May 2010  The vacancy rate for the municipality, , was 0.25%.\n\nIn June 2011 the average price of an apartment in and around Geneva was 13,681 Swiss francs (CHF) per square metre (1 m2).  The average can be as high as 17,589 Swiss francs (CHF) per square metre (1 m2) for a luxury apartment and as low as 9,847 Swiss francs (CHF) for an older or basic apartment.  For houses in and around Geneva, the average price was 11,595 Swiss francs (CHF) per square metre (1 m2) (June 2011), with a lowest price per square metre (1 m2) of 4,874 Swiss francs (CHF), and a maximum price of 21,966 Swiss francs (CHF).\n\nHistorical population \n\nMonter calculates that the city's total population was 12,000–13,000 in 1550, doubling to over 25,000 by 1560.Monter, E. William, \"Historical Demography and Religious History in Sixteenth-Century Geneva,\" The Journal of Interdisciplinary History, Vol. 9, No. 3, Winter, 1979, pp. 403–4 [https://www.jstor.org/stable/203418]\n\nThe historical population is given in the following chart:\n\nColors=\n  id:lightgrey value:gray(0.9)\n  id:darkgrey  value:gray(0.8)\nImageSize  = width:1100 height:500\nPlotArea   = height:350 left: 100 bottom:90 right:100\nLegend     = columns:3 left:220 top:70 columnwidth:160\nAlignBars  = justify\nDateFormat = x.y\nPeriod     = from:0 till:180000\nTimeAxis   = orientation:vertical\nAlignBars  = justify\nScaleMajor = gridcolor:darkgrey increment:20000 start:0\nScaleMinor = gridcolor:lightgrey increment:5000 start:0\nColors=\n id:TO     value:yellowgreen      legend:Total\n id:FR     value:teal      legend:French_Speaking\n id:GE     value:green      legend:German_Speaking\n id:CA     value:lightpurple      legend:Catholic\n id:PR     value:oceanblue      legend:Protestant\n id:SW     value:red      legend:Swiss\nPlotData=\n  color:yellowgreen width:40   mark:(line,white) align:center\n  bar:1850 from:start till:37724 text:\"37,724\" color:TO\n  bar:1870 from:start till:60004 text:\"60,004\" color:TO\n  bar:1888 from:start till:75709 text:\"75,709\" color:TO\n  bar:1900 from:start till:97359 text:\"97,359\" color:TO\n  bar:1910 from:start till:115243 text:\"115,243\" color:TO\n  bar:1930 from:start till:124121 text:\"124,121\" color:TO\n  bar:1950 from:start till:145473 text:\"145,473\" color:TO\n  bar:1970 from:start till:173618 text:\"173,618\" color:TO\n  bar:1990 from:start till:171042 text:\"171,042\" color:TO\n  bar:2000 from:start till:177964 text:\"177,964\" color:TO\nLineData =\n  points:(300,111)(400,113)  color:GE\n  points:(400,113)(500,118)  color:GE\n  points:(500,118)(600,126)  color:GE\n  points:(600,126)(700,130)  color:GE\n  points:(700,130)(800,128)  color:GE\n  points:(800,128)(900,109)  color:GE\n  points:(900,109)(1000,104)  color:GE\n  points:(300,209)(400,241)  color:FR\n  points:(400,241)(500,259)  color:FR\n  points:(500,259)(600,271)  color:FR\n  points:(600,271)(700,306)  color:FR\n  points:(700,306)(800,307)  color:FR\n  points:(800,307)(900,309)  color:FR\n  points:(900,309)(1000,340)  color:FR\n  points:(100,112)(200,143)  color:CA\n  points:(200,143)(300,153)  color:CA\n  points:(300,153)(400,177)  color:CA\n  points:(400,177)(500,194)  color:CA\n  points:(500,194)(600,186)  color:CA\n  points:(600,186)(700,204)  color:CA\n  points:(700,204)(800,266)  color:CA\n  points:(800,266)(900,245)  color:CA\n  points:(900,245)(1000,219)  color:CA\n  points:(100,141)(200,158)  color:PR\n  points:(200,158)(300,171)  color:PR\n  points:(300,171)(400,187)  color:PR\n  points:(400,187)(500,198)  color:PR\n  points:(500,198)(600,218)  color:PR\n  points:(600,218)(700,236)  color:PR\n  points:(700,236)(800,217)  color:PR\n  points:(800,217)(900,157)  color:PR\n  points:(900,157)(1000,141)  color:PR\n  points:(100,147)(200,166)  color:SW\n  points:(200,166)(300,182)  color:SW\n  points:(300,182)(400,204)  color:SW\n  points:(400,204)(500,221)  color:SW\n  points:(500,221)(600,270)  color:SW\n  points:(600,270)(700,321)  color:SW\n  points:(700,321)(800,314)  color:SW\n  points:(800,314)(900,282)  color:SW\n  points:(900,282)(1000,284)  color:SW\n\nReligion \n\nThe  recorded 66,491 residents (37.4% of the population) as Roman Catholic, while 41,289 people (23.20%) belonged to no church or were agnostic or atheist, 24,105 (13.5%) belonged to the Swiss Reformed Church, and 8,698 (4.89%) were Muslim. Of the rest of the population, there were 3,959 members of an Orthodox church (2.22%), there were 220 individuals (or about 0.12% of the population) who belonged to the Christian Catholic Church of Switzerland, and there were 2,422 individuals (1.36%) who belonged to another Christian church. There were 2,601 individuals (1.46%) who were Jewish. There were 707 individuals who were Buddhist, 474 individuals who were Hindu and 423 individuals who belonged to another church. A total of 26,575 individuals (14.93%) did not answer the question.\n\nAccording to 2012 statistics by Swiss Bundesamt für Statistik 49.2% are Christian, divided into 34.2% Roman Catholic, 8.8% Swiss Reformed (organized in the Protestant Church of Geneva) and 6.2% other Christian (mostly various other Protestants). 38% of Genevans are unaffiliated, 6.1% are Muslim and 1.6% are Jews.\n\nGeneva has historically been considered a Protestant city and was known as the Protestant Rome due to it being the base of John Calvin, William Farel, Theodore Beza and other Protestant Reformers. Over the past century, substantial immigration from France and other predominantly Roman Catholic countries, as well as general European secularization, especially among Christians, has changed its religious landscape. As a result, three times as many Roman Catholics as Protestants lived in the city in 2000, while a large number of residents were members of neither group. Roman Catholics form part of the Roman Catholic Diocese of Lausanne, Geneva and Fribourg.\n\nThe World Council of Churches has its headquarters at the Ecumenical Centre in Grand-Saconnex, Geneva.\n\nWorld Communion of Reformed Churches, a worldwide organization of Presbyterian, Continental Reformed, Congregational and other Reformed churches gathering more than 80 million people around the world was based here from 1948 until 2013. The Executive Committee of the World Communion of Reformed Churches voted in 2012 to move its offices to Hanover, Germany, citing the high costs of running the ecumenical organization in Geneva, Switzerland. The move was completed in 2013.\n\nThe Lutheran World Federation of 74 million people is also based here.\n\nProtestant Rome\n\nPrior to the Protestant Reformation the city was de jure and de facto Roman Catholic.\n\nAs highlighted by popular perception, the Protestant Reformation caused major transformations in the religious and political life of Geneva. Reaction to the new movement varied across Switzerland. While Bern favoured the introduction of the new teaching, Fribourg renounced its allegiance to Geneva in 1531 and stayed Catholic. John Calvin went to Geneva in 1536 after William Farel encouraged him to do so. Calvin's previous residence was Strasbourg in his native France, where he ministered on invitation from fellow reformer Martin Bucer. In Geneva, the Catholic bishop had been obliged to seek exile already in 1532 as a new Protestant leader was to arrive to take his place as city's ecclesiastical leader. Geneva became a stronghold of Calvinism, making religious progress and theological advances within that tradition. Some of tenets created there influenced Protestantism as a whole through the lasting influence of Calvinism. St. Pierre Cathedral was where Calvin and his Protestant Reformers preached. A hotbed of thriving religious debate among major clergy, it constituted the epicenter of the newly developing Protestant thought that would later become to be known as the Reformed tradition. Many prominent Reformed theologians operated there, including William Farel and Theodore Beza, Calvin's successor who progressed Reformed thought after his death.\n\nGeneva was deeply shaped by Calvinism, and Calvin was its spiritual leader until his death. It was a shelter for Calvinists, but at the same time it persecuted Roman Catholics and other heretics. The case of Michael Servetus, an early Nontrinitarian, is notable. Condemned by Catholics and Protestants alike, he was arrested in Geneva and burnt at the stake as a heretic by order of the city's Protestant governing council. John Calvin and his followers denounced him, and possibly contributed to his sentence.\n\nNowadays, Protestants simply use the word Geneva in multiple contexts to refer to the collective legacy of John Calvin and his theological successors. Another major city in Switzerland during the Protestant Reformation, often placed alongside Geneva, was Zürich. Several major Reformed theologians like Huldrych Zwingli and Heinrich Bullinger operated there.\n\nIn 1802, during its annexation to France under Napoleon I, the Diocese of Geneva was united with the Diocese of Chambéry, but the 1814 Congress of Vienna and the 1816 Treaty of Turin stipulated that  in territories transferred to a now considerably extended Geneva the Catholic religion was to be protected, and that no changes were to be made in existing conditions without agreement with the Holy See. Napoleon's common policy was to emancipate Catholics in Protestant-majority areas, and the other way around, as well as emancipating Jews. In 1819 the city of Geneva and 20 parishes were united to the Diocese of Lausanne by Pope Pius VII and in  1822 the non-Swiss territory was made into the Diocese of Annecy. A variety of concord with the civil authorities came as a result of the separation of church and state, enacted with strong Catholic support in 1907.\n\nCrime\n\nIn 2014 the crime rate, of crimes listed in the Swiss Criminal Code, in Genève was 143.9 per thousand residents. During the same period, the rate of drug crimes was 33.6 per thousand residents.  The rate of violations of immigration, visa and work permit laws was 35.7 per thousand residents.[https://www.atlas.bfs.admin.ch/maps/13/de/11488_11587_3864_7266/19010.html Statistical Atlas of Switzerland] accessed 5 April 2016\n\nCityscape \n\nHeritage sites of national significance \n\nThere are 82 buildings or sites in Geneva that are listed as Swiss heritage site of national significance, and the entire old city of Geneva is part of the Inventory of Swiss Heritage Sites.\n\nReligious buildings: Cathedral St-Pierre et Chapel des Macchabés, Notre-Dame Church, Russian church, St-Germain Church, Temple de la Fusterie, Temple de l'Auditoire\n\nCivic buildings: Former Arsenal and Archives of the City of Genève, Former Crédit Lyonnais, Former Hôtel Buisson, Former Hôtel du Résident de France et Bibliothèque de la Société de lecture de Genève, Former école des arts industriels, Archives d'État de Genève (Annexe), Bâtiment des forces motrices, Library de Genève, Library juive de Genève «Gérard Nordmann», Cabinet des estampes, Centre d'Iconographie genevoise, Collège Calvin, École Geisendorf, University Hospital of Geneva (HUG), Hôtel de Ville et tour Baudet, Immeuble Clarté at Rue Saint-Laurent 2 and 4, Immeubles House Rotonde at Rue Charles-Giron 11–19, Immeubles at Rue Beauregard 2, 4, 6, 8, Immeubles at Rue de la Corraterie 10–26, Immeubles at Rue des Granges 2–6, Immeuble at Rue des Granges 8, Immeubles at Rue des Granges 10 and 12, Immeuble at Rue des Granges 14, Immeuble and Former Armory at Rue des Granges 16, Immeubles at Rue Pierre Fatio 7 and 9, House de Saussure at Rue de la Cité 24, House Des arts du Grütli at Rue du Général-Dufour 16, House Royale et les deux immeubles à côté at Quai Gustave Ador 44–50, Tavel House at Rue du Puits-St-Pierre 6, Turrettini House at Rue de l'Hôtel-de-Ville 8 and 10, Brunswick Monument, Palais de Justice, Palais de l'Athénée, Palais des Nations with library and archives of the SDN and ONU, Palais Eynard et Archives de la ville de Genève, Palais Wilson, Parc des Bastions avec Mur des Réformateurs, Place Neuve et Monument du Général Dufour, Pont de la Machine, Pont sur l'Arve, Poste du Mont-Blanc, Quai du Mont-Blanc, Quai et Hôtel des Bergues, Quai Général Guisan and English Gardens, Quai Gustave-Ador and Jet d'eau, Télévision Suisse Romande, university of Geneva, Victoria Hall\n\nArcheological sites:\nFondation Baur and Museum of the arts d'Extrême-Orient, Parc et campagne de la Grange and Library (neolithic shore settlement/Roman villa), Bronze Age shore settlement of Plonjon, Temple de la Madeleine archeological site, Temple Saint-Gervais archeological site, Old City with Celtic, Roman and medieval villages\n\nMuseums, theaters, and other cultural sites: Conservatoire de musique at Place Neuve 5, Conservatoire et Jardin botaniques, Fonds cantonal d'art contemporain, Ile Rousseau and statue, Institute and Museum of Voltaire with Library and Archives, Mallet House and Museum international de la Réforme, Musée Ariana, Musée d'Art et d'Histoire, Museum d'art moderne et contemporain, Museum d'ethnographie, Museum of the International Red Cross, Musée Rath, Muséum d'histoire naturelle, Salle communale de Plainpalais et théâtre Pitoëff, Villa Bartholoni et Museum d'Histoire et Sciences\n\nInternational organizations: International Labour Organization (BIT), International Committee of the Red Cross, United Nations High Commissioner for Refugees (UNHCR), World Meteorological Organization, World Trade Organization, International Telecommunication Union, World Alliance of Young Men's Christian Association\n\nFile:Geneva saint peter.JPG|Cathedral St-Pierre\nFile:Vue aile sud College Calvin.JPG|Collège Calvin\nFile:IKRK Hauptquartier.jpg| International Committee of the Red Cross (CICR)\nFile:Botanical Garden Geneva 2006 803.JPG| Conservatory and Botanical Garden of the City of Geneva\nFile:Basilique Notre-Dame, Genève.jpg| Notre-Dame Church\nFile:Eglise Orthodoxe Russe de Geneve.jpg| Russian Orthodox Church\nFile:Genf UNHCR.JPG|United Nations High Commissioner for Refugees (UNHCR)\nFile:Hotel de Ville Geneva.jpg|Hôtel de Ville and the Tour Baudet\nFile:Voltaire Museum.JPG|Institute and Museum of Voltaire with Library and Archives\nFile:Musee Reforme.JPG| Mallet House and Museum international de la Réforme\nFile:Tavel House.JPG|Tavel House\nFile:Brunswick Monument.jpg| Brunswick Monument\n\nSociety and culture \n\nMedia \n\nThe city's main newspaper is the Tribune de Genève, with a readership of about 187,000, a daily newspaper founded on 1 February 1879 by James T. Bates.\nLe Courrier, founded in 1868, was originally supported by the Roman Catholic Church, but has been independent since 1996. Mainly focussed on Geneva, Le Courrier is trying to expand into other cantons in Romandy. Both Le Temps (headquartered in Geneva) and Le Matin are widely read in Geneva, but cover the whole of Romandy.\n\nGeneva is the main media centre for French-speaking Switzerland.  It is the headquarters for the numerous French language radio and television networks of the Swiss Broadcasting Corporation, known collectively as Radio Télévision Suisse.  While both networks cover the whole of Romandy, special programs related to Geneva are sometimes broadcast on some of the local radio frequencies in the case of special events such as elections. Other local radio stations broadcast from the city, including YesFM (FM 91.8 MHz), Radio Cité (Non-commercial radio, FM 92.2 MHz), OneFM (FM 107.0 MHz, also broadcast in Vaud), and World Radio Switzerland (FM 88.4 MHz).\n\nLéman Bleu is a local TV channel, founded in 1996 and distributed by cable. Due to the proximity to France, many of the French television channels are also available.\n\nTraditions and customs \n\nGeneva observes Jeûne genevois on the first Thursday following the first Sunday in September.  By local tradition, this commemorates the date the news of the St. Bartholomew's Day massacre of Huguenots reached Geneva.\n\nGeneva celebrates L'Escalade on the weekend nearest 12 December celebrating the defeat of the surprise attack by troops sent by Charles Emmanuel I, Duke of Savoy during the night of 11–12 December 1602. Besides festive traditions that includes chocolate cauldrons filled with vegetable-shaped marzipan treats and the Escalade procession on horseback in seventeenth century armour, Geneva has been organizing 'Course de l'Escalade', which means 'Climbing Race'. This race takes place in Geneva's Old Town, and has been very popular amongst racers across all ages. Non-competitive racers have fun by dressing up in fancy costumes, while walking in the race. 2015 marks the 38th edition of this race.\n\nSince 1818, a particular chestnut tree has been used as the official \"herald of the spring\" in Geneva. The sautier (secretary of the Parliament of the Canton of Geneva) observes the tree and notes the day of arrival of the first bud. While this event has no practical effect, the sautier issues a formal press release and the local newspaper will usually mention the news. \n\nAs this is one of the world's oldest records of a plant's reaction to climatic conditions, researchers have been interested to note that the first bud appears earlier and earlier in the year. During the first century, many dates were in March or April. In recent years, it has usually been in mid-February and sometimes even earlier.\nIn 2002, the first bud appeared unusually early, on 7 February, and then again on 29 December of the same year. The following year, which was one of the hottest years recorded in Europe, became a year with no bud. In 2008, the first bud also appeared very early, on 19 February.\n\nMusic and festivals \n\nThe opera house, the Grand Théâtre de Genève, which officially opened in 1876, was partly destroyed by fire in 1951 and reopened in 1962. It has the largest stage in Switzerland. It features opera and dance performances, recitals, concerts and, occasionally, theatre. The Victoria Hall is used for classical music concerts. It is home of the Orchestre de la Suisse Romande.\n\nEvery summer, the Fêtes de Genève (Geneva Festival) are organised in Geneva. According to the Radio télévision suisse, in 2013, hundreds of thousands of people came to Geneva to see the annual one-hour long grand firework display of the Fêtes de Genève.[http://www.rts.ch/info/regions/geneve/5125297-une-heure-de-feux-genevois-sur-le-theme-des-conquetes.html \"Une heure de feux genevois sur le thème des conquêtes\"], www.rts.ch (page visited on 11 August 2013).\n\nBesides, a music festival occurs in Geneva every year in June. Different groups of artists make their show in different areas of the city. In 2016, the festival celebrates its 25th anniversary.\n\nMuseums \n\nMuseums and art galleries are numerous throughout the city. Some are related to the many international organizations as the International Red Cross and Red Crescent Museum or the Microcosm in the CERN area. The Palace of Nations, home of the United Nations headquarters, can also be visited.\n\nEducation \n\nGeneva is home to the University of Geneva. In 1559, John Calvin founded the Geneva Academy, a theological and humanist seminary. In the 19th century, the Academy  lost its ecclesiastic links and in 1873, with the addition of a medical faculty, it became the University of Geneva. In 2011, the ranking web of universities ranked it  European university.\n\nThe Graduate Institute of International and Development Studies was among the first academic institutions to teach international relations in the world and is today one of Europe's most prestigious institutions, offering MA and PhD programmes in law, political science, history, economics, international affairs, and development studies.\n\nAlso, the oldest international school in the world is located in Geneva, the International School of Geneva, founded in 1924 along with the League of Nations. The Geneva School of Diplomacy and International Relations is a private university on the grounds of the Château de Penthes, an old manor with a park and view of Lake Geneva.\n\nThe Canton of Geneva's public school system has écoles primaires (ages 4–12) and  cycles d'orientation (ages 12–15). The obligation to attend school ends at age 15, but secondary education is provided by  collèges (ages 15–19), the oldest of which is the Collège Calvin, which could be considered one of the oldest public schools in the world, écoles de culture générale (15-18/19)  and the écoles professionnelles (15-18/19). The écoles professionnelles offer full-time courses and part-time study as part of an apprenticeship.  Geneva also has a choice of private schools.\n\nOut of all the educational and research facilities in Geneva, CERN (the European Organization for Nuclear Research) is probably the best known on a world basis and most recently renown for the Large Hadron Collider. Founded in 1954, CERN was one of Europe's first joint ventures and has developed as the world's largest particle physics laboratory. Physicists from around the world travel to CERN to research matter and explore the fundamental forces and materials that form the universe.\n\nIn 2011, 89,244 (37.0%) of the population have completed non-mandatory upper secondary education, and 107,060 or (44.3%) have completed additional higher education (either university or a Fachhochschule). Of the 107,060  who completed tertiary schooling, 32.5% were Swiss men, 31.6% were Swiss women, 18.1% were non-Swiss men and 17.8% were non-Swiss women.\n\nDuring the 2011–2012 school year, there were a total of 92,311 students in the Geneva school system (Primary to University). The education system in the Canton of Geneva has eight years of primary school, with 32,716 students. The secondary school program consists of three lower, obligatory years of schooling, followed by three to five years of optional, advanced schools. There were 13,146 lower secondary students who attended schools in Geneva. There were 10,486 upper secondary students from the municipality along with 10330 students who were in a professional, non-university track program.\nAn additional 11,797 students attended a private school.[http://www.ge.ch/recherche-education/statistiques/annuaire-2012.asp Service de Recherche en éducation, Geneva Education department]  accessed 6 December 2012\n\nGeneva is home to five major libraries, the Bibliothèques municipales Genève, the Haute école de travail social, Institut d'études sociales, the Haute école de santé, the Ecole d'ingénieurs de Genève and the Haute école d'art et de design.  There were () 877,680 books or other media in the libraries, and in the same year 1,798,980 items were loaned.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/16/02/02/data.html Swiss Federal Statistical Office, list of libraries]  accessed 14 May 2010\n\nEconomy \n\nGeneva's economy is mainly services oriented. The city has an important and old finance sector, which is specialised in private banking (managing assets of about 1 trillion USD) and financing of international trade. In the 2017 Global Financial Centres Index, Geneva was ranked as having the 15th most competitive financial center in the world (up from 20th in March 2017), and fifth most competitive in Europe (after London, Zürich, Frankfurt and Luxembourg).\n\nGeneva hosts the international headquarters of companies like Japan Tobacco International, Mediterranean Shipping Company, Vitol, Gunvor, Mercuria Energy Group. Merck Serono,Serono S.A. was bought by the German Merck KGaA – not to be mistaken with the American Merck & Co. – in 2006 and operated under Merck Serono S.A. as one of the ten biggest bio-pharmaceutical companies in the world, before all their Geneva workers were dismissed in April 2012 (although they continue to dispute the closure).[http://www.tdg.ch/geneve/actu-genevoise/fermeture-merck-serono-faut-printemps-genevois/story/14848970] SITA, Société Générale de Surveillance, STMicroelectronics, and Weatherford International.Clanton, Brett. \"[http://www.chron.com/CDA/archives/archive.mpl?id2008_4676934 Another oil firm puts base overseas / Weatherford says Switzerland near key markets].\" Houston Chronicle. Friday 12 December 2008. A1. Retrieved on 23 January 2010. Many other multinational companies like Caterpillar, DuPont, and Cargill have their international headquarters in the city; Take Two Interactive, Electronic Arts, INVISTA, Procter & Gamble and Oracle Corporation have their European headquarters in the city. Hewlett Packard has its Europe, Africa, and Middle East headquarters in Meyrin, near Geneva.\"[http://www.meyrin.ch/jahia/webdav/site/meyrin/shared/documents/informations%20utiles/Plan%20Commune%20Meyrin.pdf Plan de commune].\" Meyrin. Retrieved on 29 September 2009.\"[http://welcome.hp.com/country/us/en/contact/office_locs.html Office Locations].\" Hewlett Packard. Retrieved on 22 July 2009. PrivatAir has its headquarters in Meyrin,\"[http://www.privatair.com/cda/privatair/display/main/privatair_content.jsp?znprivatair&cp\n1-4-12-39_4000_0__ How to Find Us] .\" PrivatAir. Retrieved on 22 October 2009. near Geneva.\"[http://www.privatair.com/cda/privatair/display/main/privatair_content.jsp?znprivatair&cp\n1-4-9_4000_0__ Overview] .\" PrivatAir. Retrieved on 22 August 2009.\n\nThere is a long tradition of watchmaking in Geneva which roots back to the 16th century, directly related to the Calvinism of Geneva. Many watchmakers are based in Geneva since their foundation, such as (Baume et Mercier, Charriol, Chopard, Franck Muller, Patek Philippe, Rolex, Universal Genève, Raymond Weil, Vacheron Constantin, Frédérique Constant, etc.). Two major international producers of flavours and fragrances, Firmenich and Givaudan, have their headquarters and main production facilities in Geneva.\n\nThe private sector is organized in different Union of employers, including the Fédération des Entreprises Romandes Genève (FER Genève) and the Fédération des métiers du bâtiment (FMB).Eric Rabbath, « La Fédération des syndicats patronaux à Genève va changer de nom », L’AGEFI, 17 September 2003Serge Guertchakoff, « La Fédération des syndicats patronaux change de nom », La Tribune de Genève, 17 March 2003\n\nMany people also work in the numerous offices of international organisations located in Geneva (about 22,233 in March 2012).\n\nThe Geneva Motor Show is one of the most important international auto shows. It is held at Palexpo, a giant convention centre next to the International Airport.\n\nIn 2009, Geneva was ranked as the fourth most expensive city in the world. Geneva moved up four places from eighth place the previous year. Geneva is ranked behind Tokyo, Osaka, and Moscow at first, second, and third respectively. Geneva also beat Hong Kong, which came in at fifth place.\n\n, Geneva had an unemployment rate of 6.3%.[http://www.geneve.ch/dse/doc/communiques/2011-02-08--emploi-chiffres-chomage.pdf geneve.ch]   , there were five people employed in the primary economic sector and about three businesses involved in this sector.  9,783 people were employed in the secondary sector and there were 1,200 businesses in this sector.  134,429 people were employed in the tertiary sector, with 12,489 businesses in this sector.  There were 91,880 residents of the municipality who were employed in some capacity, of which females made up 47.7% of the workforce.\n\n the total number of full-time equivalent jobs was 124,185.  The number of jobs in the primary sector was four, all of which were in agriculture.  The number of jobs in the secondary sector was 9,363 of which 4,863 or (51.9%) were in manufacturing and 4,451 (47.5%) were in construction.  The number of jobs in the tertiary sector was 114,818.  In the tertiary sector; 16,573 or 14.4% were in wholesale or retail sales or the repair of motor vehicles, 3,474 or 3.0% were in the movement and storage of goods, 9,484 or 8.3% were in a hotel or restaurant, 4,544 or 4.0% were in the information industry, 20,982 or 18.3% were the insurance or financial industry, 12,177 or 10.6% were technical professionals or scientists, 10,007 or 8.7% were in education and 15,029 or 13.1% were in health care.[http://www.pxweb.bfs.admin.ch/Database/German_06%20-%20Industrie%20und%20Dienstleistungen/06.2%20-%20Unternehmen/06.2%20-%20Unternehmen.asp?lang1&prod\n06&secprod2&openChild\ntrue Swiss Federal Statistical Office STAT-TAB Betriebszählung: Arbeitsstätten nach Gemeinde und NOGA 2008 (Abschnitte), Sektoren 1–3]   accessed 28 January 2011\n\n, there were 95,190 workers who commuted into the municipality and 25,920 workers who commuted away.  The municipality is a net importer of workers, with about 3.7 workers entering the municipality for every one leaving.  About 13.8% of the workforce coming into Geneva are coming from outside Switzerland, while 0.4% of the locals commute out of Switzerland for work.[https://archive.is/20120804043150/http://www.media-stat.admin.ch/stat/pendler/pop.php Swiss Federal Statistical Office – Statweb]  accessed 24 June 2010  Of the working population, 38.2% used public transportation to get to work, and 30.6% used a private car.\n\nSports \n\nAmong the most popular sports in Switzerland is ice hockey. Geneva is home to Genève-Servette HC, which plays in the National League (NL). They play their home games in the 7,135-seat Patinoire des Vernets. In 2008 and 2010, the team made it to the league finals but lost to the ZSC Lions and SC Bern respectively. The team is by far the most popular one in both the city and the canton of Geneva, drawing three times more spectators than the football team in 2017.\n\nThe town is home to Servette FC, a football club founded in 1890 and named after a borough on the right bank of the Rhône. The home of Servette FC is the 30,000-seat Stade de Genève. Servette FC plays in the Challenge League.\n\nFurther, Geneva is home to the basketball team Lions de Genève, 2013 and 2015 Champion of the Swiss Basketball League. The team plays its home games in the Pavilion des Sports.\n\nInfrastructure\n\nTransportation \n\nThe city is served by the Geneva Cointrin International Airport. It is connected by Geneva Airport railway station () with both the Swiss Federal Railways network and the French SNCF network, including to Paris, Lyon, Marseille and Montpellier by TGV. Geneva is connected to the motorway systems of both Switzerland (A1 motorway) and France.\n\nPublic transport by bus, trolleybus or tram is provided by Transports Publics Genevois (TPG). In addition to an extensive coverage of the city centre, the network covers most of the municipalities of the Canton, with a few lines extending into France. Public transport by boat is provided by the Mouettes Genevoises, which link the two banks of the lake within the city, and by the Compagnie Générale de Navigation sur le lac Léman (CGN) which serves more distant destinations such as Nyon, Yvoire, Thonon, Évian, Lausanne and Montreux using both modern diesel vessels and vintage paddle steamers.\n\nTrains operated by Swiss Federal Railways connect the airport to the main station of Cornavin in six minutes. Regional train services are being increasingly developed, towards Coppet and Bellegarde. At the city limits, two new railway stations have been opened since 2002: Genève-Sécheron (close to the UN and the Botanical Gardens) and Lancy-Pont-Rouge.\n\nIn 2011, work started on the CEVA (Cornavin – Eaux-Vives – Annemasse) project, first planned in 1884, which will connect Cornavin with the Cantonal hospital, Eaux-Vives railway station and Annemasse, in France. The link between the main railway station and the classification yard of La Praille already exists; from there, the line will go mostly underground to the Hospital and Eaux-Vives, where it will link to the existing line to France. Support for this project was obtained from all parties in the local parliament.\n\nIn May 2013, the demonstrator TOSA Flash Mobility, Clean City, Smart Bus of a large capacity (133 passengers) full electric bus system with opportunity charging starts its service between Geneva Airport and PALEXPO. The project aims to introduce a new system of mass transport with electric \"flash\" recharging of the buses at selected stops while passengers are disembarking and embarking. By December 2016, the TOSA buses will run on line 23.\n\nTaxis in Geneva can be difficult to find, and may need to be booked in advance especially in the early morning or at peak hours. Taxis can refuse to take babies and children because of seating legislation.\n\nAn ambitious project to close 200 streets in the centre of Geneva to cars has been approved in principle by the Geneva cantonal authorities, and is projected to be implemented over four years (2010–2014).\n\nUtilities \n\nWater, natural gas and electricity are provided to the municipalities of the Canton of Geneva by the state-owned Services Industriels de Genève (shortly SIG). Most of the drinkable water (80%) is extracted from the lake; the remaining 20% is provided by groundwater originally formed by infiltration from the Arve. 30% of the Canton's electricity needs is locally produced, mainly by three hydroelectric dams on the Rhône (Seujet, Verbois and Chancy-Pougny). In addition, 13% of the electricity produced in the Canton is made from the heat induced by the burning of waste at the waste incineration facility of Les Cheneviers. The remaining needs (57%) are covered by imports from other cantons in Switzerland or other European countries; SIG buys only electricity produced by renewable methods, and in particular does not use electricity produced using nuclear reactors or fossil fuels.\nNatural gas is available in the City of Geneva, as well as in about two-thirds of the municipalities of the canton, and is imported from Western Europe by the Swiss company Gaznat. SIG also provides telecommunication facilities to carriers, service providers and large enterprises. From 2003 to 2005, \"Voisin, voisine\" a Fibre to the Home pilot project with a Triple play offering was launched to test the end-user market in the Charmilles district.\n\nInternational organisations \n\nGeneva is the European headquarters of the United Nations, in the Palace of Nations building (French: Palais des Nations), which was also the headquarters of the former League of Nations. Several agencies are headquartered at Geneva, including the United Nations High Commissioner for Refugees (UNHCR), the UN Office of the High Commissioner for Human Rights (OHCHR), the World Health Organization (WHO), the International Labour Organization (ILO), International Telecommunication Union (ITU), the International Baccalaureate Organization (IBO) and the World Intellectual Property Organization (WIPO).\n\nApart from the UN agencies, Geneva hosts many inter-governmental organizations, such as the World Trade Organization (WTO), World Meteorological Organization (WMO), the World Economic Forum (WEF), the International Organization for Migration (IOM), the International Federation of Red Cross and Red Crescent Societies (IFRC) and the International Committee of the Red Cross (ICRC).\n\nThe Maison de la Paix building hosts the three Geneva centres supported by the Swiss Confederation, the International Centre for Humanitarian Demining (GICHD), the Centre for the Democratic Control of Armed Forces (DCAF) and the Centre for Security Policy (GCSP), as well as other organisations active in the field of peace, international affairs and sustainable development.\n\nOrganizations on the European level include the European Broadcasting Union (EBU) and the CERN (European Organization for Nuclear Research) which is the world's largest particle physics laboratory.\n\nThe Geneva Environment Network (GEN) publishes the Geneva Green Guide, an extensive listing of Geneva-based global organisations working on environment protection and sustainable development. A website (by the Swiss Government, WBCSD, UNEP and IUCN) includes stories about how NGOs, business, government and the UN cooperate. By doing so, it attempts to explain why Geneva has been picked by so many NGOs and UN as their headquarters location.\n\nThe World Organization of the Scout Movement (WOSM) and the World Scout Bureau Central Office  are headquartered in Geneva.\n\nNotable people \n\nA-G \n\n* Alfredo Aceto (born 1991), artist\n* Gustave Ador (1845–1928), politician and president of the International Committee of the Red Cross (ICRC)\n* David Aebischer (born 1978), ice hockey goaltender, Stanley Cup champion with the Colorado Avalanche in 2001\n* Jacques-Laurent Agasse (1767–1849), animal and landscape painter\n* Henri-Frédéric Amiel (1821–1881), writer and moral philosopher\n* Adolphe Appia (1862–1928), architect\n* Aimé Argand (1750–1803), naturalist and entrepreneur\n* Philip Arditti, actor\n* Martha Argerich (born 1941), Argentine pianist\n* John Armleder (born 1948), artist, painter, sculptor\n* Germaine Aussey (1909–1979), French actress\n* Edna Best (1900–1974), British actress\n* Jean-Luc Bideau (born 1940), Swiss film actor\n* Ernest Bloch (1880–1959), US composer of Swiss origin\n* Caroline Boissier-Butini (1786–1836), pianist and composer\n* Nicolas Bouvier (1929–1998), writer and photographer\n* Jorge Luis Borges (1899–1986), Argentine author, studied at the Collège de Genève from 1914 to 1918\n* Clotilde Bressler-Gianoli (1875-1912), opera singer born in Geneva\n\n* Christiane Brunner (born 1947), politician and trade unionist\n* Mickaël Buffaz (born 1979), French cyclist\n* Kate Burton (born 1957), actress, the daughter of actor Richard Burton\n* Cécile Butticaz (1884–1966), engineer\n* John Calvin (1509–1564), influential theologian, reformer\n* Clint Capela (born 1994), Swiss professional basketball player\n* Jean-Jacques Challet-Venel (1811–1893), politician\n* Henri Christiné (1867–1941), French composer\n* Étienne Clavière (1735–1793), banker and politician of the French revolution\n* Bernard Dalle (born 1967), venture capitalist\n* Jean-Louis de Lolme (1740–1806), lawyer\n* Jean-André Deluc (1727–1817), geologist and meteorologist\n* Ferdinand de Saussure (1857–1913), professor of linguistics\n* Giovanni Diodati (1576–1649), reformed theologian and Bible translator\n* Élie Ducommun (1833–1906), peace activist, Nobel Peace Prize 1902\n* Armand Dufaux (1833–1941), French-Swiss aviation pioneer and inventor\n* Henri Dufaux (1879–1980), French-Swiss aviation pioneer, inventor, painter and politician\n* Henry Dunant (1828–1910), initiator of the Red Cross movement and co-founder of the International Committee of the Red Cross, received the first Nobel Peace Prize in 1901\n* Isabelle Eberhardt (1877–1904), Russian-Swiss explorer and travel writer\n* Louis Favre (1826–1879), engineer, responsible for the construction of the Gotthard tunnel\n* Philippe Favre (1961–2013), racing driver\n* Edmond Fleg (1874–1963), French writer of Swiss origin\n* Ian Fleming (1908–1964), author (James Bond), studied psychology briefly at the University of Geneva\n* Sylvie Fleury (born 1961), object artist\n* Frère Max (1921–1996), theologian\n* Pierre-Victor Galland (1822–1892), painter\n* Albert Gallatin (1761–1849), American politician and diplomat\n* Marcel Golay (1927–2015), astronomer\n* Claude Goretta (born 1929), film director and television producer\n* Emilie Gourd (1879–1946), women's rights activist and journalist\n* Germain Henri Hess (1802–1850), chemist\n* Katerina Graham (born 1989), actress, singer, and model; she plays Bonnie Bennett in The Vampire Diaries\n* Romain Grosjean (born 1986), Formula 1 driver\n\nH-R \n\n* Germain Henri Hess (1802–1850), Swiss-Russian chemist\n* Jean Huber (1721–1786), Swiss politician, silhouette-cutter and painter\n* François Huber (1750–1831), naturalist\n* Marie Huber (1695–1753), translator, editor and author of theological works\n* Pierre Jeanneret (1896–1967), architect\n* Charles Journet (1891–1975), cardinal of the Roman Catholic Church\n* Louis Jurine (1751–1819), physician and naturalist\n* Thomas Jouannet (born 1970), actor\n* Adrien Lachenal (1849–1918), politician (Bundesrat)\n* Paul Lachenal (1884–1955), politician (Grand Conseil),President Pro Helvetia\n* François Lachenal (1918–1997), diplomat,editor\n* Marie Laforêt (born 1939), singer and actress\n\n* Sarah Lahbati (born 1993), actress, singer\n* François Le Fort (1656–1699), first Russian Admiral\n* Georges-Louis Le Sage (1724–1803), physicist\n* Jean Leclerc (1657–1736), theologian and philologist\n* Vladimir Lenin (1870–1924), lived in Geneva as an exile from the Russian Empire between 1902 and 1905.\n* Jean-Étienne Liotard (1702–1789), painter\n* Frank Martin (1890–1974), composer\n* Théodore Maunoir (1806–1869), co-founder of the International Committee of the Red Cross\n\n* Barthélemy Menn (1815–1893), landscape painter\n* Heinrich Menu von Minutoli (1772–1846), explorer and archaeologist\n* Jacques-Barthélemy Micheli du Crest (1690–1766), politicians and scientists\n* Thierry Moutinho (born 1991), Swiss-Portuguese footballer\n* Stephanie Morgenstern, actress, filmmaker, and screenwriter\n* Gustave Moynier (1826–1910), lawyer and co-founder of the International Committee of the Red Cross\n* Jacques Necker (1732–1804), banker and finance minister under Louis XVI\n* Louis Albert Necker (1786–1861), scientist and politician\n* Julie Ordon (born 1984), model and actress\n* Jean Piaget (1896 – 1980), Swiss clinical psychologist, founder of the International Center for Genetic Epistemology, director of the Rousseau Institute, Director of the International Bureau of Education, a professor at University of Geneva. Buried in an unmarked grave in the Cimetière des Rois, as requested. \n* Robert Pinget (1919–1997), writer\n* Léa Pool (born 1950), film director and screenwriter\n* James Pradier (1790–1852), French sculptor\n* Pierre Prévost (1751–1839), philosopher and physicist\n* Tariq Ramadan (born 1962), scientist and political activist\n* Marcel Raymond (1897–1981), literary critic and writer\n* Liliane Maury Pasquier (born 1956), politician\n* Jean-Louis Prévost (1838–1927), neurologist\n* Flore Revalles (1889–1966), singer, dancer and actress.\n* Charles-Gaspard de la Rive (1770–1834), physicist, psychiatrist and politician\n* Lucien de la Rive (1834–1924), physicist\n* Marc Rosset (born 1970), tennis player\n* Jean-Jacques Rousseau (1712–1778), writer and philosopher\n* Jean Rousset (1910–2002), literary critic and writer\n* Xavier Ruiz (born 1970), film producer and director\n\nS-Z \n\n* Horace-Bénédict de Saussure (1740–1799), naturalist\n* Nicolas-Théodore de Saussure (1767–1845), naturalist\n* Léon Savary (1895–1968), writer and journalist\n* Michel Simon (1895–1975), actor\n* Michael Schade (born 1965), Canadian opera and concert singer\n* Marguerite Sechehaye, (1887–1965), psychotherapist\n* Louis Segond (1810–1885), theologian\n* Philippe Senderos (born 1985), footballer\n* Jean Senebier (1742–1809), reformed pastor and naturalist\n* Pierre Eugene du Simitiere (1737–1784), artist and philosopher\n* François Simon (1917–1982), actor\n* Edward Snowden (born 1983), lived in Geneva between 2007 and 2009, while working for the CIA\n* Terry Southern (1924–1995), author, essayist, screenwriter\n* Emile Taddéoli (1879–1920), Swiss aviation pioneer\n* Alain Tanner (born 1929), film director\n* Voltaire (1694–1778), Enlightenment writer and philosopher, lived at Les Délices from 1755 to 1760\n* Ezekiel Spanheim (1629–1710), German diplomat\n* Friedrich Spanheim (1632–1701), German church historian\n* Maya Stojan (born 1986), Swiss actress\n* Richard Tarnas (born 1950), American philosopher and psychologist\n\n* Sigismund Thalberg (1812–1871), Austrian composer and pianist\n* Rodolphe Töpffer (1799–1846), artist and novelist\n* Vico Torriani (1920–1998), singer, actor, show host\n* Jean Alphonse Turretin (1671–1737), reformed theologian\n* Maurice Turrettini (1878–1932), architect\n* Pierre Wissmer (1915–1992), Swiss-French composer, pianist and music teacher\n* Jean Ziegler (born 1934), politician and sociologist",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Geneva" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12521" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Geneva (, , , , , ) is the second most populous city in Switzerland (after Zürich) and is the most populous city of the Romandy, the French-speaking part of Switzerland. Situated where the Rhône exits Lake Geneva, it is the capital of the Republic and Canton of Geneva.\n\nThe municipality (ville de Genève) has a population () of , and the canton (which is essentially the city and its inner-ring suburbs) has  residents. In 2014, the compact agglomération du Grand Genève had 946,000 inhabitants in 212 communities in both Switzerland and France.[http://www.grand-geneve.org/grand-geneve/le-territoire/chiffres-cles Grand-Geneve website]  accessed 14 July 2016 Within Swiss territory, the commuter area named \"Métropole lémanique\" contains a population of 1.26 million. This area is essentially spread east from Geneva towards the Riviera area (Vevey, Montreux) and north-east towards Yverdon-les-Bains, in the neighbouring canton of Vaud.\n\nGeneva is a global city, a financial center, and worldwide center for diplomacy due to the presence of numerous international organizations, including the headquarters of many of the agencies of the United Nations and the Red Cross. Geneva is the city that hosts the highest number of international organizations in the world.François Modoux, \"La Suisse engagera 300 millions pour rénover le Palais des Nations\", Le Temps, Friday 28 June 2013, page 9. It is also the place where the Geneva Conventions were signed, which chiefly concern the treatment of wartime non-combatants and prisoners of war.\n\nIn 2017 Geneva was ranked as the world's fifteenth most important financial centre for competitiveness by the Global Financial Centres Index, fifth in Europe behind London, Zürich, Frankfurt and Luxembourg. A 2009 survey by Mercer found that Geneva has the third-highest quality of life of any city in the world (behind Vienna and Zürich for expatriates; it is narrowly outranked by Zürich)., last updated 28 April 2009. The city has been referred to as the world's most compact metropolis and the \"Peace Capital\". In 2017, Geneva was ranked as the seventh most expensive city in the world.\n\nToponym \n\nThe city was mentioned in Latin texts, by Caesar, with the spelling Genava,Hans-Friedrich Mueller, Caesar Selections from His Commentarii De Bello Gallico, Bolchazy-Carducci Publishers, 2012, p. 34. probably from a Celtic toponym *genawa- from the stem *genu- (\"bend, knee\"), in the sense of a bending river or estuary.John T. Koch, Celtic culture: a historical encyclopedia, ABC-CLIO, 2006, p. 1513.\n\nThe medieval county of Geneva in Middle Latin was known as  pagus major Genevensis or Comitatus Genevensis (also Gebennensis), after 1400 becoming the Genevois province  of Savoy (albeit not extending to the city proper, until the Reformation the seat of the bishop of Geneva).Pour cette citation et le découpage suivant, organisation décrite par l'ouvrage Jules-Joseph Vernier, Étude historique et géographique sur la Savoie, Le Livre d'Histoire - Res Universis (réimpr. 1993) (1re éd. 1896), p. 137.\n\nThe name takes various forms in modern languages, Geneva in English, ,Word Reference: [http://www.wordreference.com/fren/Gen%C3%A8ve Genève].  , , and .\n\nThe city in origin shares its name, *genawa \"estuary\", with the Italian port city of Genoa (in Italian Genova).\n\nHistory \n\nGeneva was an Allobrogian border town, fortified against the Helvetii tribe, when the Romans took it in 121 BC. It  became Christian under the Late Roman Empire, and acquired its first bishop in the 5th century, having been connected to the bishopric of Vienne in the 4th.\n\nIn the Middle Ages, Geneva was ruled by a count under the Holy Roman Empire until the late 14th century, when it was granted a charter giving it a high degree of self-governance. Around this time the House of Savoy came to (at least nominally) dominate the city. In the 15th century, an oligarchic republican government emerged with the creation of the Grand Council. In the first half of the 16th century, the Protestant Reformation reached the city, causing religious strife during which Savoy rule was thrown off and Geneva allied itself  with  the Swiss Confederacy. \nIn 1541, with Protestantism in the ascendancy, John Calvin, the founder of Calvinism, became the spiritual leader of the city. By the 18th century, however, Geneva had come under the influence of Catholic France, which cultivated the city as its own. France also tended to be at odds with the ordinary townsfolk, which inspired the failed Geneva Revolution of 1782 in an attempt to win representation in the government for men of modest means. In 1798, revolutionary France under the Directory annexed Geneva. At the end of the Napoleonic Wars, on 1 June 1814, Geneva was admitted to the Swiss Confederation. In 1907, the separation of Church and State was adopted. Geneva flourished in the 19th and 20th centuries, becoming the seat of many international organizations.\n\nGeography and climate\n\nTopography\n\nGeneva is located at 46°12' North, 6°09' East, at the south-western end of Lake Geneva, where the lake flows out to form the Rhône again. It is entirely surrounded by three mountain chains all belonging to the Jura: the Jura main range north-westward, the Vuache southward, and the Salève south-eastward.\n\nThe city has an area of , while the area of the canton is 282 km2, including the two small exclaves of Céligny in Vaud. The part of the lake that is attached to Geneva has an area of 38 km2 and is sometimes referred to as Petit lac (small lake). The canton has only a  long border with the rest of Switzerland. Of  of border, 103 are shared with France, the Département de l'Ain to the north and west and the Département de la Haute-Savoie to the south and east.\n\nOf the land in the city,  or 1.5% is used for agricultural purposes, while  or 3.1% is forested.   Of the rest of the land,  or 91.8% is settled (buildings or roads),  or 3.1% is either rivers or lakes and  or 0.1% is unproductive land.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/02/03/blank/data/gemeindedaten.html Swiss Federal Statistical Office-Land Use Statistics] 2009 data  accessed 25 March 2010\n\nOf the built up area, industrial buildings made up 3.4% of the area while housing and buildings made up 46.2% and transportation infrastructure 25.8%, while parks, green belts and sports fields made up 15.7%.  All the forested land area is covered with heavy forests.  Of the agricultural land, 0.3% is used for growing crops.  Of the water in the municipality, 0.2% is in lakes and 2.9% is in rivers and streams.\n\nThe altitude of Geneva is , and corresponds to the altitude of the largest of the Pierres du Niton, two large rocks emerging from the lake which date from the last ice age. This rock was chosen by General Guillaume Henri Dufour as the reference point for surveying in Switzerland.Swisstopo, [http://www.swisstopo.ch/en/basics/geo/faq/horizon Height reference for Switzerland]. Retrieved 1 February 2007. \nThe second main river of Geneva is the Arve which flows into the Rhône just west of the city centre. Mont Blanc can be seen from Geneva and is an hour's drive from the city centre.\n\nClimate\n\nThe climate of Geneva is temperate, oceanic (Köppen: Cfb). Winters are cool, usually with light frosts at night and thawing conditions during the day. Summers are relatively warm. Precipitation is adequate and is relatively well-distributed throughout the year, although autumn is slightly wetter than the other seasons. Ice storms near Lac Léman are quite normal in the winter. In the summer many people enjoy swimming in the lake, and frequently patronise public beaches such as Genève Plage and the Bains des Pâquis. Geneva, in certain years, receives snow in the colder months of the year. The nearby mountains are subject to substantial snowfall and are suitable for skiing. Many world-renowned ski resorts such as Verbier and Crans-Montana are just over two hours away by car. Mont Salève (1379 m), just across the border in France, dominates the southerly view from the city centre and Mont Blanc, the highest of the Alpine range is visible from most of the city, towering high above Chamonix, which along with Morzine, Le Grand Bornand, La Clusaz, and resorts of the Grand Massif such as Samoens, Morillon and Flaine, are the closest French skiing destinations to Geneva.\n\nDuring the years 2000–2009, the mean yearly temperature was 11 °C and the mean number of sunshine-hours per year was 2003.\n\nThe highest temperature recorded in Genève–Cointrin was  in July 2015, and the lowest temperature recorded was −20.0 °C (−4.0 °F) in February 1956.\n\nPolitics\n\nAdministrative divisions\n\nThe city is divided into eight quartiers, or districts, sometimes composed of several neighborhoods. On the Left Bank are (1) Jonction, (2) Centre. Plainpalais, and Acacias, (3) Eaux-Vives, and (4) Champel, while the Right Bank includes (1) Saint-Jean and Charmilles, (2) Servette and Petit-Saconnex, (3) Grottes and Saint-Gervais, and (4) Paquis and Nations.\n\nGovernment\n\nThe Administrational Council (Conseil administratif) constitutes the executive government of the City of Geneva and operates as a collegiate authority. It is composed of five councilors (), each presiding over a department. The president of the executive department acts as mayor (la/le maire). In the governmental year 2016/2017 the Administrational Council is presided by Monsieur le maire de Genève Guillaume Barazzone. Departmental tasks, coordination measures and implementation of laws decreed by the Municipal Council are carried by the Administrational Council. The election of the Administrational Council is held every five years. The current mandate period (la législature) is from 1 June 2015 to 31 May 2020. The delegates are elected by means of a system of Majorz. The mayor changes in turnus every year, while the heads of the other departments are assigned by the collegiate. The executive body holds its meetings in the Palais Eynard, near the Parc des Bastions. The building was built between 1817 and 1821 in Neoclassical style.\n\n, Geneva's Administrational Council is made up of two representatives of the PS (Social Democratic Party), and one member each of PES (Green Party, who is also the mayor for the current year), Ensemble à Gauche (an alliance of the left parties PST-POP (Parti Suisse du Travail – Parti Ouvrier et Populaire) and solidaritéS), and PDC (Christian Democratic Party), giving the left parties a very strong four out of five seats. The last election was held on 19 April 2015. All of the previous members were re-elected.\n\nParliament\n\nThe Municipal Council (Conseil municipal) holds legislative power. It is made up of 80 members, with elections held every five years. The Municipal Council decrees regulations and by-laws that are executed by the Administrational Council and the administration. The delegates are selected by means of a system of Proporz with a seven percentage threshold.\n\nThe sessions of the Municipal Council are public. Unlike members of the Administrational Council, members of the Municipal Council are not politicians by profession, and they are paid a fee based on their attendance. Any resident of Geneva allowed to vote can be elected as a member of the Municipal Council. The parliament holds its meetings in the Town Hall (Hôtel de Ville), in the old city.\n\nThe last election of the Municipal Council was held on 20 April 2015 for the mandate period (législature) of 2015–2020. Currently the Municipal Council consist of 19 members of the Social Democratic Party (PS), 15 Les Libéraux-Radicaux (PLR), 11 Christian Democratic People's Party (PDC), 11 Geneva Citizens' Movement (MCG,), 10 Ensemble à Gauche (an alliance of the left parties PST-POP (Parti Suisse du Travail – Parti Ouvrier et Populaire) and solidaritéS), 8 Green Party (PES), and 6 Swiss People's Party (UDC).\n\nElections\n\nNational Council\n\nIn the 2015 federal election for the Swiss National Council the most popular party was the PS which received 23.8% of the vote. The next three most popular parties were the PLR (17.6%), the UDC (16.3%), the Green Party (11.4%), the PDC (10.7%), and the solidaritéS (8.8%). In the federal election, a total of 36,490 voters were cast, and the voter turnout was 44.1%.\n\nInternational relations\n\nGeneva intentionally does not have any particular \"sister\" tie with any city in the world. It declares itself related to the entire world.\n\nDemographics\n\nPopulation\n\nGeneva has a population () of . The city of Geneva is at the centre of the Geneva metropolitan area, known as the Grand Genève in French (Greater Geneva). Greater Geneva includes the Canton of Geneva in its entirety as well as the District of Nyon in the Canton of Vaud and several areas in the neighboring French departments of Haute-Savoie and Ain. In 2011, the agglomération franco-valdo-genevoise had 915,000 inhabitants, two-thirds of whom lived on Swiss soil and one-third on French soil. The Geneva metropolitan area is experiencing steady demographic growth of 1.2% a year and the population of the agglomération franco-valdo-genevoise is expected to reach a total of one million people in the near future.\n\nThe official language of Geneva, in both the city and canton is French, the main language used in Romandie. As a result of immigration flows in the 1960s and 1980s, Italian, Portuguese and Spanish are also spoken by a considerable proportion of the population. English is also quite common due to the high number of anglophone expatriates and foreigners working in international institutions and in the bank sector. Lack of proficiency in French of English-speaking expatriates (even after years spent in Geneva) is an increasing concern.\n\nMost of the population () speaks French (128,622 or 72.3%), with English being second most common (7,853 or 4.4%) and Spanish third (7,462 or 4.2%).  There are 7,320 people who speak Italian (4.1%), 7,050 people who speak German (4.0%) and 113 people who speak Romansh.\n\nIn the city of Geneva, , 48% of the population are resident foreign nationals. For a list of the largest groups of foreign residents see the cantonal overview.\nOver the last 10 years (1999–2009) the population has changed at a rate of 7.2%.  It has changed at a rate of 3.4% due to migration and at a rate of 3.4% due to births and deaths.[http://www.bfs.admin.ch/bfs/portal/en/index/regionen/02/key.html Swiss Federal Statistical Office]  accessed 25-April-2011\n\n, the gender distribution of the population was 47.8% male and 52.2% female.  The population was made up of 46,284 Swiss men (24.2% of the population) and 45,127 (23.6%) non-Swiss men.  There were 56,091 Swiss women (29.3%) and 43,735 (22.9%) non-Swiss women.[http://www.ge.ch/statistique/domaines/01/01_02_1/tableaux.asp#1 Canton of Geneva Statistical Office] Population résidante du canton de Genève, selon l'origine et le sexe, par commune, en mars 2011 accessed 18 April 2011  Of the population in the municipality 43,296 or about 24.3% were born in Geneva and lived there in 2000.  There were 11,757 or 6.6% who were born in the same canton, while 27,359 or 15.4% were born somewhere else in Switzerland, and 77,893 or 43.8% were born outside of Switzerland.\n\nIn  there were 1,147 live births to Swiss citizens and 893 births to non-Swiss citizens, and in same time span there were 1,114 deaths of Swiss citizens and 274 non-Swiss citizen deaths.  Ignoring immigration and emigration, the population of Swiss citizens increased by 33 while the foreign population increased by 619.  There were 465 Swiss men and 498 Swiss women who emigrated from Switzerland.  At the same time, there were 2933 non-Swiss men and 2662 non-Swiss women who immigrated from another country to Switzerland.  The total Swiss population change in 2008 (from all sources, including moves across municipal borders) was an increase of 135 and the non-Swiss population increased by 3181 people.  This represents a population growth rate of 1.8%.[http://www.bfs.admin.ch/bfs/portal/de/index/infothek/onlinedb/superweb/login.html Swiss Federal Statistical Office – Superweb database – Gemeinde Statistics 1981–2008]   accessed 19 June 2010\n\nThe age distribution of the population () is children and teenagers (0–19 years old) make up 18.2% of the population, while adults (20–64 years old) make up 65.8% and seniors (over 64 years old) make up 16%.\n\n, there were 78,666 people who were single and never married in the municipality.  There were 74,205 married individuals, 10,006 widows or widowers and 15,087 individuals who are divorced.[https://www.pxweb.bfs.admin.ch/default.aspx?px_language\nde STAT-TAB Thema 40 - Eidgenössische Volkszählung (34)]   accessed 2 February 2011\n\n, there were 86,231 private households in the municipality, and an average of 1.9 persons per household.  There were 44,373 households that consist of only one person and 2,549 households with five or more people.  Out of a total of 89,269 households that answered this question, 49.7% were households made up of just one person and there were 471 adults who lived with their parents.  Of the rest of the households, there are 17,429 married couples without children, 16,607 married couples with children  There were 5,499 single parents with a child or children.  There were 1,852 households that were made up of unrelated people and 3,038 households that were made up of some sort of institution or another collective housing.\n\n there were 743 single family homes (or 10.6% of the total) out of a total of 6,990 inhabited buildings.  There were 2,758 multi-family buildings (39.5%), along with 2,886 multi-purpose buildings that were mostly used for housing (41.3%) and 603 other use buildings (commercial or industrial) that also had some housing (8.6%).  Of the single family homes 197 were built before 1919, while 20 were built between 1990 and 2000.  The greatest number of single family homes (277) were built between 1919 and 1945.[http://www.pxweb.bfs.admin.ch/Database/German_09%20-%20Bau-%20und%20Wohnungswesen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen/09.2%20-%20Geb%C3%A4ude%20und%20Wohnungen.asp?lang\n1&prod09&secprod\n2&openChild=true Swiss Federal Statistical Office STAT-TAB – Datenwürfel für Thema 09.2 – Gebäude und Wohnungen]   accessed 28 January 2011\n\n there were 101,794 apartments in the municipality.  The most common apartment size was 3 rooms of which there were 27,084.  There were 21,889 single room apartments and 11,166 apartments with five or more rooms.  Of these apartments, a total of 85,330 apartments (83.8% of the total) were permanently occupied, while 13,644 apartments (13.4%) were seasonally occupied and 2,820 apartments (2.8%) were empty.  , the construction rate of new housing units was 1.3 new units per 1000 residents.\n\n the average price to rent an average apartment in Geneva was 1163.30 Swiss francs (CHF) per month (US$930, £520, €740 approx. exchange rate from 2003).  The average rate for a one-room apartment was 641.60 CHF (US$510, £290, €410), a two-room apartment was about 874.46 CHF (US$700, £390, €560), a three-room apartment was about 1126.37 CHF (US$900, £510, €720) and a six or more room apartment cost an average of 2691.07 CHF (US$2150, £1210, €1720).  The average apartment price in Geneva was 104.2% of the national average of 1116 CHF.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/05/06/blank/key/einfuehrung.html Swiss Federal Statistical Office-Rental prices] 2003 data  accessed 26 May 2010  The vacancy rate for the municipality, , was 0.25%.\n\nIn June 2011 the average price of an apartment in and around Geneva was 13,681 Swiss francs (CHF) per square metre (1 m2).  The average can be as high as 17,589 Swiss francs (CHF) per square metre (1 m2) for a luxury apartment and as low as 9,847 Swiss francs (CHF) for an older or basic apartment.  For houses in and around Geneva, the average price was 11,595 Swiss francs (CHF) per square metre (1 m2) (June 2011), with a lowest price per square metre (1 m2) of 4,874 Swiss francs (CHF), and a maximum price of 21,966 Swiss francs (CHF).\n\nHistorical population \n\nMonter calculates that the city's total population was 12,000–13,000 in 1550, doubling to over 25,000 by 1560.Monter, E. William, \"Historical Demography and Religious History in Sixteenth-Century Geneva,\" The Journal of Interdisciplinary History, Vol. 9, No. 3, Winter, 1979, pp. 403–4 [https://www.jstor.org/stable/203418]\n\nThe historical population is given in the following chart:\n\nColors=\n  id:lightgrey value:gray(0.9)\n  id:darkgrey  value:gray(0.8)\nImageSize  = width:1100 height:500\nPlotArea   = height:350 left: 100 bottom:90 right:100\nLegend     = columns:3 left:220 top:70 columnwidth:160\nAlignBars  = justify\nDateFormat = x.y\nPeriod     = from:0 till:180000\nTimeAxis   = orientation:vertical\nAlignBars  = justify\nScaleMajor = gridcolor:darkgrey increment:20000 start:0\nScaleMinor = gridcolor:lightgrey increment:5000 start:0\nColors=\n id:TO     value:yellowgreen      legend:Total\n id:FR     value:teal      legend:French_Speaking\n id:GE     value:green      legend:German_Speaking\n id:CA     value:lightpurple      legend:Catholic\n id:PR     value:oceanblue      legend:Protestant\n id:SW     value:red      legend:Swiss\nPlotData=\n  color:yellowgreen width:40   mark:(line,white) align:center\n  bar:1850 from:start till:37724 text:\"37,724\" color:TO\n  bar:1870 from:start till:60004 text:\"60,004\" color:TO\n  bar:1888 from:start till:75709 text:\"75,709\" color:TO\n  bar:1900 from:start till:97359 text:\"97,359\" color:TO\n  bar:1910 from:start till:115243 text:\"115,243\" color:TO\n  bar:1930 from:start till:124121 text:\"124,121\" color:TO\n  bar:1950 from:start till:145473 text:\"145,473\" color:TO\n  bar:1970 from:start till:173618 text:\"173,618\" color:TO\n  bar:1990 from:start till:171042 text:\"171,042\" color:TO\n  bar:2000 from:start till:177964 text:\"177,964\" color:TO\nLineData =\n  points:(300,111)(400,113)  color:GE\n  points:(400,113)(500,118)  color:GE\n  points:(500,118)(600,126)  color:GE\n  points:(600,126)(700,130)  color:GE\n  points:(700,130)(800,128)  color:GE\n  points:(800,128)(900,109)  color:GE\n  points:(900,109)(1000,104)  color:GE\n  points:(300,209)(400,241)  color:FR\n  points:(400,241)(500,259)  color:FR\n  points:(500,259)(600,271)  color:FR\n  points:(600,271)(700,306)  color:FR\n  points:(700,306)(800,307)  color:FR\n  points:(800,307)(900,309)  color:FR\n  points:(900,309)(1000,340)  color:FR\n  points:(100,112)(200,143)  color:CA\n  points:(200,143)(300,153)  color:CA\n  points:(300,153)(400,177)  color:CA\n  points:(400,177)(500,194)  color:CA\n  points:(500,194)(600,186)  color:CA\n  points:(600,186)(700,204)  color:CA\n  points:(700,204)(800,266)  color:CA\n  points:(800,266)(900,245)  color:CA\n  points:(900,245)(1000,219)  color:CA\n  points:(100,141)(200,158)  color:PR\n  points:(200,158)(300,171)  color:PR\n  points:(300,171)(400,187)  color:PR\n  points:(400,187)(500,198)  color:PR\n  points:(500,198)(600,218)  color:PR\n  points:(600,218)(700,236)  color:PR\n  points:(700,236)(800,217)  color:PR\n  points:(800,217)(900,157)  color:PR\n  points:(900,157)(1000,141)  color:PR\n  points:(100,147)(200,166)  color:SW\n  points:(200,166)(300,182)  color:SW\n  points:(300,182)(400,204)  color:SW\n  points:(400,204)(500,221)  color:SW\n  points:(500,221)(600,270)  color:SW\n  points:(600,270)(700,321)  color:SW\n  points:(700,321)(800,314)  color:SW\n  points:(800,314)(900,282)  color:SW\n  points:(900,282)(1000,284)  color:SW\n\nReligion \n\nThe  recorded 66,491 residents (37.4% of the population) as Roman Catholic, while 41,289 people (23.20%) belonged to no church or were agnostic or atheist, 24,105 (13.5%) belonged to the Swiss Reformed Church, and 8,698 (4.89%) were Muslim. Of the rest of the population, there were 3,959 members of an Orthodox church (2.22%), there were 220 individuals (or about 0.12% of the population) who belonged to the Christian Catholic Church of Switzerland, and there were 2,422 individuals (1.36%) who belonged to another Christian church. There were 2,601 individuals (1.46%) who were Jewish. There were 707 individuals who were Buddhist, 474 individuals who were Hindu and 423 individuals who belonged to another church. A total of 26,575 individuals (14.93%) did not answer the question.\n\nAccording to 2012 statistics by Swiss Bundesamt für Statistik 49.2% are Christian, divided into 34.2% Roman Catholic, 8.8% Swiss Reformed (organized in the Protestant Church of Geneva) and 6.2% other Christian (mostly various other Protestants). 38% of Genevans are unaffiliated, 6.1% are Muslim and 1.6% are Jews.\n\nGeneva has historically been considered a Protestant city and was known as the Protestant Rome due to it being the base of John Calvin, William Farel, Theodore Beza and other Protestant Reformers. Over the past century, substantial immigration from France and other predominantly Roman Catholic countries, as well as general European secularization, especially among Christians, has changed its religious landscape. As a result, three times as many Roman Catholics as Protestants lived in the city in 2000, while a large number of residents were members of neither group. Roman Catholics form part of the Roman Catholic Diocese of Lausanne, Geneva and Fribourg.\n\nThe World Council of Churches has its headquarters at the Ecumenical Centre in Grand-Saconnex, Geneva.\n\nWorld Communion of Reformed Churches, a worldwide organization of Presbyterian, Continental Reformed, Congregational and other Reformed churches gathering more than 80 million people around the world was based here from 1948 until 2013. The Executive Committee of the World Communion of Reformed Churches voted in 2012 to move its offices to Hanover, Germany, citing the high costs of running the ecumenical organization in Geneva, Switzerland. The move was completed in 2013.\n\nThe Lutheran World Federation of 74 million people is also based here.\n\nProtestant Rome\n\nPrior to the Protestant Reformation the city was de jure and de facto Roman Catholic.\n\nAs highlighted by popular perception, the Protestant Reformation caused major transformations in the religious and political life of Geneva. Reaction to the new movement varied across Switzerland. While Bern favoured the introduction of the new teaching, Fribourg renounced its allegiance to Geneva in 1531 and stayed Catholic. John Calvin went to Geneva in 1536 after William Farel encouraged him to do so. Calvin's previous residence was Strasbourg in his native France, where he ministered on invitation from fellow reformer Martin Bucer. In Geneva, the Catholic bishop had been obliged to seek exile already in 1532 as a new Protestant leader was to arrive to take his place as city's ecclesiastical leader. Geneva became a stronghold of Calvinism, making religious progress and theological advances within that tradition. Some of tenets created there influenced Protestantism as a whole through the lasting influence of Calvinism. St. Pierre Cathedral was where Calvin and his Protestant Reformers preached. A hotbed of thriving religious debate among major clergy, it constituted the epicenter of the newly developing Protestant thought that would later become to be known as the Reformed tradition. Many prominent Reformed theologians operated there, including William Farel and Theodore Beza, Calvin's successor who progressed Reformed thought after his death.\n\nGeneva was deeply shaped by Calvinism, and Calvin was its spiritual leader until his death. It was a shelter for Calvinists, but at the same time it persecuted Roman Catholics and other heretics. The case of Michael Servetus, an early Nontrinitarian, is notable. Condemned by Catholics and Protestants alike, he was arrested in Geneva and burnt at the stake as a heretic by order of the city's Protestant governing council. John Calvin and his followers denounced him, and possibly contributed to his sentence.\n\nNowadays, Protestants simply use the word Geneva in multiple contexts to refer to the collective legacy of John Calvin and his theological successors. Another major city in Switzerland during the Protestant Reformation, often placed alongside Geneva, was Zürich. Several major Reformed theologians like Huldrych Zwingli and Heinrich Bullinger operated there.\n\nIn 1802, during its annexation to France under Napoleon I, the Diocese of Geneva was united with the Diocese of Chambéry, but the 1814 Congress of Vienna and the 1816 Treaty of Turin stipulated that  in territories transferred to a now considerably extended Geneva the Catholic religion was to be protected, and that no changes were to be made in existing conditions without agreement with the Holy See. Napoleon's common policy was to emancipate Catholics in Protestant-majority areas, and the other way around, as well as emancipating Jews. In 1819 the city of Geneva and 20 parishes were united to the Diocese of Lausanne by Pope Pius VII and in  1822 the non-Swiss territory was made into the Diocese of Annecy. A variety of concord with the civil authorities came as a result of the separation of church and state, enacted with strong Catholic support in 1907.\n\nCrime\n\nIn 2014 the crime rate, of crimes listed in the Swiss Criminal Code, in Genève was 143.9 per thousand residents. During the same period, the rate of drug crimes was 33.6 per thousand residents.  The rate of violations of immigration, visa and work permit laws was 35.7 per thousand residents.[https://www.atlas.bfs.admin.ch/maps/13/de/11488_11587_3864_7266/19010.html Statistical Atlas of Switzerland] accessed 5 April 2016\n\nCityscape \n\nHeritage sites of national significance \n\nThere are 82 buildings or sites in Geneva that are listed as Swiss heritage site of national significance, and the entire old city of Geneva is part of the Inventory of Swiss Heritage Sites.\n\nReligious buildings: Cathedral St-Pierre et Chapel des Macchabés, Notre-Dame Church, Russian church, St-Germain Church, Temple de la Fusterie, Temple de l'Auditoire\n\nCivic buildings: Former Arsenal and Archives of the City of Genève, Former Crédit Lyonnais, Former Hôtel Buisson, Former Hôtel du Résident de France et Bibliothèque de la Société de lecture de Genève, Former école des arts industriels, Archives d'État de Genève (Annexe), Bâtiment des forces motrices, Library de Genève, Library juive de Genève «Gérard Nordmann», Cabinet des estampes, Centre d'Iconographie genevoise, Collège Calvin, École Geisendorf, University Hospital of Geneva (HUG), Hôtel de Ville et tour Baudet, Immeuble Clarté at Rue Saint-Laurent 2 and 4, Immeubles House Rotonde at Rue Charles-Giron 11–19, Immeubles at Rue Beauregard 2, 4, 6, 8, Immeubles at Rue de la Corraterie 10–26, Immeubles at Rue des Granges 2–6, Immeuble at Rue des Granges 8, Immeubles at Rue des Granges 10 and 12, Immeuble at Rue des Granges 14, Immeuble and Former Armory at Rue des Granges 16, Immeubles at Rue Pierre Fatio 7 and 9, House de Saussure at Rue de la Cité 24, House Des arts du Grütli at Rue du Général-Dufour 16, House Royale et les deux immeubles à côté at Quai Gustave Ador 44–50, Tavel House at Rue du Puits-St-Pierre 6, Turrettini House at Rue de l'Hôtel-de-Ville 8 and 10, Brunswick Monument, Palais de Justice, Palais de l'Athénée, Palais des Nations with library and archives of the SDN and ONU, Palais Eynard et Archives de la ville de Genève, Palais Wilson, Parc des Bastions avec Mur des Réformateurs, Place Neuve et Monument du Général Dufour, Pont de la Machine, Pont sur l'Arve, Poste du Mont-Blanc, Quai du Mont-Blanc, Quai et Hôtel des Bergues, Quai Général Guisan and English Gardens, Quai Gustave-Ador and Jet d'eau, Télévision Suisse Romande, university of Geneva, Victoria Hall\n\nArcheological sites:\nFondation Baur and Museum of the arts d'Extrême-Orient, Parc et campagne de la Grange and Library (neolithic shore settlement/Roman villa), Bronze Age shore settlement of Plonjon, Temple de la Madeleine archeological site, Temple Saint-Gervais archeological site, Old City with Celtic, Roman and medieval villages\n\nMuseums, theaters, and other cultural sites: Conservatoire de musique at Place Neuve 5, Conservatoire et Jardin botaniques, Fonds cantonal d'art contemporain, Ile Rousseau and statue, Institute and Museum of Voltaire with Library and Archives, Mallet House and Museum international de la Réforme, Musée Ariana, Musée d'Art et d'Histoire, Museum d'art moderne et contemporain, Museum d'ethnographie, Museum of the International Red Cross, Musée Rath, Muséum d'histoire naturelle, Salle communale de Plainpalais et théâtre Pitoëff, Villa Bartholoni et Museum d'Histoire et Sciences\n\nInternational organizations: International Labour Organization (BIT), International Committee of the Red Cross, United Nations High Commissioner for Refugees (UNHCR), World Meteorological Organization, World Trade Organization, International Telecommunication Union, World Alliance of Young Men's Christian Association\n\nFile:Geneva saint peter.JPG|Cathedral St-Pierre\nFile:Vue aile sud College Calvin.JPG|Collège Calvin\nFile:IKRK Hauptquartier.jpg| International Committee of the Red Cross (CICR)\nFile:Botanical Garden Geneva 2006 803.JPG| Conservatory and Botanical Garden of the City of Geneva\nFile:Basilique Notre-Dame, Genève.jpg| Notre-Dame Church\nFile:Eglise Orthodoxe Russe de Geneve.jpg| Russian Orthodox Church\nFile:Genf UNHCR.JPG|United Nations High Commissioner for Refugees (UNHCR)\nFile:Hotel de Ville Geneva.jpg|Hôtel de Ville and the Tour Baudet\nFile:Voltaire Museum.JPG|Institute and Museum of Voltaire with Library and Archives\nFile:Musee Reforme.JPG| Mallet House and Museum international de la Réforme\nFile:Tavel House.JPG|Tavel House\nFile:Brunswick Monument.jpg| Brunswick Monument\n\nSociety and culture \n\nMedia \n\nThe city's main newspaper is the Tribune de Genève, with a readership of about 187,000, a daily newspaper founded on 1 February 1879 by James T. Bates.\nLe Courrier, founded in 1868, was originally supported by the Roman Catholic Church, but has been independent since 1996. Mainly focussed on Geneva, Le Courrier is trying to expand into other cantons in Romandy. Both Le Temps (headquartered in Geneva) and Le Matin are widely read in Geneva, but cover the whole of Romandy.\n\nGeneva is the main media centre for French-speaking Switzerland.  It is the headquarters for the numerous French language radio and television networks of the Swiss Broadcasting Corporation, known collectively as Radio Télévision Suisse.  While both networks cover the whole of Romandy, special programs related to Geneva are sometimes broadcast on some of the local radio frequencies in the case of special events such as elections. Other local radio stations broadcast from the city, including YesFM (FM 91.8 MHz), Radio Cité (Non-commercial radio, FM 92.2 MHz), OneFM (FM 107.0 MHz, also broadcast in Vaud), and World Radio Switzerland (FM 88.4 MHz).\n\nLéman Bleu is a local TV channel, founded in 1996 and distributed by cable. Due to the proximity to France, many of the French television channels are also available.\n\nTraditions and customs \n\nGeneva observes Jeûne genevois on the first Thursday following the first Sunday in September.  By local tradition, this commemorates the date the news of the St. Bartholomew's Day massacre of Huguenots reached Geneva.\n\nGeneva celebrates L'Escalade on the weekend nearest 12 December celebrating the defeat of the surprise attack by troops sent by Charles Emmanuel I, Duke of Savoy during the night of 11–12 December 1602. Besides festive traditions that includes chocolate cauldrons filled with vegetable-shaped marzipan treats and the Escalade procession on horseback in seventeenth century armour, Geneva has been organizing 'Course de l'Escalade', which means 'Climbing Race'. This race takes place in Geneva's Old Town, and has been very popular amongst racers across all ages. Non-competitive racers have fun by dressing up in fancy costumes, while walking in the race. 2015 marks the 38th edition of this race.\n\nSince 1818, a particular chestnut tree has been used as the official \"herald of the spring\" in Geneva. The sautier (secretary of the Parliament of the Canton of Geneva) observes the tree and notes the day of arrival of the first bud. While this event has no practical effect, the sautier issues a formal press release and the local newspaper will usually mention the news. \n\nAs this is one of the world's oldest records of a plant's reaction to climatic conditions, researchers have been interested to note that the first bud appears earlier and earlier in the year. During the first century, many dates were in March or April. In recent years, it has usually been in mid-February and sometimes even earlier.\nIn 2002, the first bud appeared unusually early, on 7 February, and then again on 29 December of the same year. The following year, which was one of the hottest years recorded in Europe, became a year with no bud. In 2008, the first bud also appeared very early, on 19 February.\n\nMusic and festivals \n\nThe opera house, the Grand Théâtre de Genève, which officially opened in 1876, was partly destroyed by fire in 1951 and reopened in 1962. It has the largest stage in Switzerland. It features opera and dance performances, recitals, concerts and, occasionally, theatre. The Victoria Hall is used for classical music concerts. It is home of the Orchestre de la Suisse Romande.\n\nEvery summer, the Fêtes de Genève (Geneva Festival) are organised in Geneva. According to the Radio télévision suisse, in 2013, hundreds of thousands of people came to Geneva to see the annual one-hour long grand firework display of the Fêtes de Genève.[http://www.rts.ch/info/regions/geneve/5125297-une-heure-de-feux-genevois-sur-le-theme-des-conquetes.html \"Une heure de feux genevois sur le thème des conquêtes\"], www.rts.ch (page visited on 11 August 2013).\n\nBesides, a music festival occurs in Geneva every year in June. Different groups of artists make their show in different areas of the city. In 2016, the festival celebrates its 25th anniversary.\n\nMuseums \n\nMuseums and art galleries are numerous throughout the city. Some are related to the many international organizations as the International Red Cross and Red Crescent Museum or the Microcosm in the CERN area. The Palace of Nations, home of the United Nations headquarters, can also be visited.\n\nEducation \n\nGeneva is home to the University of Geneva. In 1559, John Calvin founded the Geneva Academy, a theological and humanist seminary. In the 19th century, the Academy  lost its ecclesiastic links and in 1873, with the addition of a medical faculty, it became the University of Geneva. In 2011, the ranking web of universities ranked it  European university.\n\nThe Graduate Institute of International and Development Studies was among the first academic institutions to teach international relations in the world and is today one of Europe's most prestigious institutions, offering MA and PhD programmes in law, political science, history, economics, international affairs, and development studies.\n\nAlso, the oldest international school in the world is located in Geneva, the International School of Geneva, founded in 1924 along with the League of Nations. The Geneva School of Diplomacy and International Relations is a private university on the grounds of the Château de Penthes, an old manor with a park and view of Lake Geneva.\n\nThe Canton of Geneva's public school system has écoles primaires (ages 4–12) and  cycles d'orientation (ages 12–15). The obligation to attend school ends at age 15, but secondary education is provided by  collèges (ages 15–19), the oldest of which is the Collège Calvin, which could be considered one of the oldest public schools in the world, écoles de culture générale (15-18/19)  and the écoles professionnelles (15-18/19). The écoles professionnelles offer full-time courses and part-time study as part of an apprenticeship.  Geneva also has a choice of private schools.\n\nOut of all the educational and research facilities in Geneva, CERN (the European Organization for Nuclear Research) is probably the best known on a world basis and most recently renown for the Large Hadron Collider. Founded in 1954, CERN was one of Europe's first joint ventures and has developed as the world's largest particle physics laboratory. Physicists from around the world travel to CERN to research matter and explore the fundamental forces and materials that form the universe.\n\nIn 2011, 89,244 (37.0%) of the population have completed non-mandatory upper secondary education, and 107,060 or (44.3%) have completed additional higher education (either university or a Fachhochschule). Of the 107,060  who completed tertiary schooling, 32.5% were Swiss men, 31.6% were Swiss women, 18.1% were non-Swiss men and 17.8% were non-Swiss women.\n\nDuring the 2011–2012 school year, there were a total of 92,311 students in the Geneva school system (Primary to University). The education system in the Canton of Geneva has eight years of primary school, with 32,716 students. The secondary school program consists of three lower, obligatory years of schooling, followed by three to five years of optional, advanced schools. There were 13,146 lower secondary students who attended schools in Geneva. There were 10,486 upper secondary students from the municipality along with 10330 students who were in a professional, non-university track program.\nAn additional 11,797 students attended a private school.[http://www.ge.ch/recherche-education/statistiques/annuaire-2012.asp Service de Recherche en éducation, Geneva Education department]  accessed 6 December 2012\n\nGeneva is home to five major libraries, the Bibliothèques municipales Genève, the Haute école de travail social, Institut d'études sociales, the Haute école de santé, the Ecole d'ingénieurs de Genève and the Haute école d'art et de design.  There were () 877,680 books or other media in the libraries, and in the same year 1,798,980 items were loaned.[http://www.bfs.admin.ch/bfs/portal/de/index/themen/16/02/02/data.html Swiss Federal Statistical Office, list of libraries]  accessed 14 May 2010\n\nEconomy \n\nGeneva's economy is mainly services oriented. The city has an important and old finance sector, which is specialised in private banking (managing assets of about 1 trillion USD) and financing of international trade. In the 2017 Global Financial Centres Index, Geneva was ranked as having the 15th most competitive financial center in the world (up from 20th in March 2017), and fifth most competitive in Europe (after London, Zürich, Frankfurt and Luxembourg).\n\nGeneva hosts the international headquarters of companies like Japan Tobacco International, Mediterranean Shipping Company, Vitol, Gunvor, Mercuria Energy Group. Merck Serono,Serono S.A. was bought by the German Merck KGaA – not to be mistaken with the American Merck & Co. – in 2006 and operated under Merck Serono S.A. as one of the ten biggest bio-pharmaceutical companies in the world, before all their Geneva workers were dismissed in April 2012 (although they continue to dispute the closure).[http://www.tdg.ch/geneve/actu-genevoise/fermeture-merck-serono-faut-printemps-genevois/story/14848970] SITA, Société Générale de Surveillance, STMicroelectronics, and Weatherford International.Clanton, Brett. \"[http://www.chron.com/CDA/archives/archive.mpl?id2008_4676934 Another oil firm puts base overseas / Weatherford says Switzerland near key markets].\" Houston Chronicle. Friday 12 December 2008. A1. Retrieved on 23 January 2010. Many other multinational companies like Caterpillar, DuPont, and Cargill have their international headquarters in the city; Take Two Interactive, Electronic Arts, INVISTA, Procter & Gamble and Oracle Corporation have their European headquarters in the city. Hewlett Packard has its Europe, Africa, and Middle East headquarters in Meyrin, near Geneva.\"[http://www.meyrin.ch/jahia/webdav/site/meyrin/shared/documents/informations%20utiles/Plan%20Commune%20Meyrin.pdf Plan de commune].\" Meyrin. Retrieved on 29 September 2009.\"[http://welcome.hp.com/country/us/en/contact/office_locs.html Office Locations].\" Hewlett Packard. Retrieved on 22 July 2009. PrivatAir has its headquarters in Meyrin,\"[http://www.privatair.com/cda/privatair/display/main/privatair_content.jsp?znprivatair&cp\n1-4-12-39_4000_0__ How to Find Us] .\" PrivatAir. Retrieved on 22 October 2009. near Geneva.\"[http://www.privatair.com/cda/privatair/display/main/privatair_content.jsp?znprivatair&cp\n1-4-9_4000_0__ Overview] .\" PrivatAir. Retrieved on 22 August 2009.\n\nThere is a long tradition of watchmaking in Geneva which roots back to the 16th century, directly related to the Calvinism of Geneva. Many watchmakers are based in Geneva since their foundation, such as (Baume et Mercier, Charriol, Chopard, Franck Muller, Patek Philippe, Rolex, Universal Genève, Raymond Weil, Vacheron Constantin, Frédérique Constant, etc.). Two major international producers of flavours and fragrances, Firmenich and Givaudan, have their headquarters and main production facilities in Geneva.\n\nThe private sector is organized in different Union of employers, including the Fédération des Entreprises Romandes Genève (FER Genève) and the Fédération des métiers du bâtiment (FMB).Eric Rabbath, « La Fédération des syndicats patronaux à Genève va changer de nom », L’AGEFI, 17 September 2003Serge Guertchakoff, « La Fédération des syndicats patronaux change de nom », La Tribune de Genève, 17 March 2003\n\nMany people also work in the numerous offices of international organisations located in Geneva (about 22,233 in March 2012).\n\nThe Geneva Motor Show is one of the most important international auto shows. It is held at Palexpo, a giant convention centre next to the International Airport.\n\nIn 2009, Geneva was ranked as the fourth most expensive city in the world. Geneva moved up four places from eighth place the previous year. Geneva is ranked behind Tokyo, Osaka, and Moscow at first, second, and third respectively. Geneva also beat Hong Kong, which came in at fifth place.\n\n, Geneva had an unemployment rate of 6.3%.[http://www.geneve.ch/dse/doc/communiques/2011-02-08--emploi-chiffres-chomage.pdf geneve.ch]   , there were five people employed in the primary economic sector and about three businesses involved in this sector.  9,783 people were employed in the secondary sector and there were 1,200 businesses in this sector.  134,429 people were employed in the tertiary sector, with 12,489 businesses in this sector.  There were 91,880 residents of the municipality who were employed in some capacity, of which females made up 47.7% of the workforce.\n\n the total number of full-time equivalent jobs was 124,185.  The number of jobs in the primary sector was four, all of which were in agriculture.  The number of jobs in the secondary sector was 9,363 of which 4,863 or (51.9%) were in manufacturing and 4,451 (47.5%) were in construction.  The number of jobs in the tertiary sector was 114,818.  In the tertiary sector; 16,573 or 14.4% were in wholesale or retail sales or the repair of motor vehicles, 3,474 or 3.0% were in the movement and storage of goods, 9,484 or 8.3% were in a hotel or restaurant, 4,544 or 4.0% were in the information industry, 20,982 or 18.3% were the insurance or financial industry, 12,177 or 10.6% were technical professionals or scientists, 10,007 or 8.7% were in education and 15,029 or 13.1% were in health care.[http://www.pxweb.bfs.admin.ch/Database/German_06%20-%20Industrie%20und%20Dienstleistungen/06.2%20-%20Unternehmen/06.2%20-%20Unternehmen.asp?lang1&prod\n06&secprod2&openChild\ntrue Swiss Federal Statistical Office STAT-TAB Betriebszählung: Arbeitsstätten nach Gemeinde und NOGA 2008 (Abschnitte), Sektoren 1–3]   accessed 28 January 2011\n\n, there were 95,190 workers who commuted into the municipality and 25,920 workers who commuted away.  The municipality is a net importer of workers, with about 3.7 workers entering the municipality for every one leaving.  About 13.8% of the workforce coming into Geneva are coming from outside Switzerland, while 0.4% of the locals commute out of Switzerland for work.[https://archive.is/20120804043150/http://www.media-stat.admin.ch/stat/pendler/pop.php Swiss Federal Statistical Office – Statweb]  accessed 24 June 2010  Of the working population, 38.2% used public transportation to get to work, and 30.6% used a private car.\n\nSports \n\nAmong the most popular sports in Switzerland is ice hockey. Geneva is home to Genève-Servette HC, which plays in the National League (NL). They play their home games in the 7,135-seat Patinoire des Vernets. In 2008 and 2010, the team made it to the league finals but lost to the ZSC Lions and SC Bern respectively. The team is by far the most popular one in both the city and the canton of Geneva, drawing three times more spectators than the football team in 2017.\n\nThe town is home to Servette FC, a football club founded in 1890 and named after a borough on the right bank of the Rhône. The home of Servette FC is the 30,000-seat Stade de Genève. Servette FC plays in the Challenge League.\n\nFurther, Geneva is home to the basketball team Lions de Genève, 2013 and 2015 Champion of the Swiss Basketball League. The team plays its home games in the Pavilion des Sports.\n\nInfrastructure\n\nTransportation \n\nThe city is served by the Geneva Cointrin International Airport. It is connected by Geneva Airport railway station () with both the Swiss Federal Railways network and the French SNCF network, including to Paris, Lyon, Marseille and Montpellier by TGV. Geneva is connected to the motorway systems of both Switzerland (A1 motorway) and France.\n\nPublic transport by bus, trolleybus or tram is provided by Transports Publics Genevois (TPG). In addition to an extensive coverage of the city centre, the network covers most of the municipalities of the Canton, with a few lines extending into France. Public transport by boat is provided by the Mouettes Genevoises, which link the two banks of the lake within the city, and by the Compagnie Générale de Navigation sur le lac Léman (CGN) which serves more distant destinations such as Nyon, Yvoire, Thonon, Évian, Lausanne and Montreux using both modern diesel vessels and vintage paddle steamers.\n\nTrains operated by Swiss Federal Railways connect the airport to the main station of Cornavin in six minutes. Regional train services are being increasingly developed, towards Coppet and Bellegarde. At the city limits, two new railway stations have been opened since 2002: Genève-Sécheron (close to the UN and the Botanical Gardens) and Lancy-Pont-Rouge.\n\nIn 2011, work started on the CEVA (Cornavin – Eaux-Vives – Annemasse) project, first planned in 1884, which will connect Cornavin with the Cantonal hospital, Eaux-Vives railway station and Annemasse, in France. The link between the main railway station and the classification yard of La Praille already exists; from there, the line will go mostly underground to the Hospital and Eaux-Vives, where it will link to the existing line to France. Support for this project was obtained from all parties in the local parliament.\n\nIn May 2013, the demonstrator TOSA Flash Mobility, Clean City, Smart Bus of a large capacity (133 passengers) full electric bus system with opportunity charging starts its service between Geneva Airport and PALEXPO. The project aims to introduce a new system of mass transport with electric \"flash\" recharging of the buses at selected stops while passengers are disembarking and embarking. By December 2016, the TOSA buses will run on line 23.\n\nTaxis in Geneva can be difficult to find, and may need to be booked in advance especially in the early morning or at peak hours. Taxis can refuse to take babies and children because of seating legislation.\n\nAn ambitious project to close 200 streets in the centre of Geneva to cars has been approved in principle by the Geneva cantonal authorities, and is projected to be implemented over four years (2010–2014).\n\nUtilities \n\nWater, natural gas and electricity are provided to the municipalities of the Canton of Geneva by the state-owned Services Industriels de Genève (shortly SIG). Most of the drinkable water (80%) is extracted from the lake; the remaining 20% is provided by groundwater originally formed by infiltration from the Arve. 30% of the Canton's electricity needs is locally produced, mainly by three hydroelectric dams on the Rhône (Seujet, Verbois and Chancy-Pougny). In addition, 13% of the electricity produced in the Canton is made from the heat induced by the burning of waste at the waste incineration facility of Les Cheneviers. The remaining needs (57%) are covered by imports from other cantons in Switzerland or other European countries; SIG buys only electricity produced by renewable methods, and in particular does not use electricity produced using nuclear reactors or fossil fuels.\nNatural gas is available in the City of Geneva, as well as in about two-thirds of the municipalities of the canton, and is imported from Western Europe by the Swiss company Gaznat. SIG also provides telecommunication facilities to carriers, service providers and large enterprises. From 2003 to 2005, \"Voisin, voisine\" a Fibre to the Home pilot project with a Triple play offering was launched to test the end-user market in the Charmilles district.\n\nInternational organisations \n\nGeneva is the European headquarters of the United Nations, in the Palace of Nations building (French: Palais des Nations), which was also the headquarters of the former League of Nations. Several agencies are headquartered at Geneva, including the United Nations High Commissioner for Refugees (UNHCR), the UN Office of the High Commissioner for Human Rights (OHCHR), the World Health Organization (WHO), the International Labour Organization (ILO), International Telecommunication Union (ITU), the International Baccalaureate Organization (IBO) and the World Intellectual Property Organization (WIPO).\n\nApart from the UN agencies, Geneva hosts many inter-governmental organizations, such as the World Trade Organization (WTO), World Meteorological Organization (WMO), the World Economic Forum (WEF), the International Organization for Migration (IOM), the International Federation of Red Cross and Red Crescent Societies (IFRC) and the International Committee of the Red Cross (ICRC).\n\nThe Maison de la Paix building hosts the three Geneva centres supported by the Swiss Confederation, the International Centre for Humanitarian Demining (GICHD), the Centre for the Democratic Control of Armed Forces (DCAF) and the Centre for Security Policy (GCSP), as well as other organisations active in the field of peace, international affairs and sustainable development.\n\nOrganizations on the European level include the European Broadcasting Union (EBU) and the CERN (European Organization for Nuclear Research) which is the world's largest particle physics laboratory.\n\nThe Geneva Environment Network (GEN) publishes the Geneva Green Guide, an extensive listing of Geneva-based global organisations working on environment protection and sustainable development. A website (by the Swiss Government, WBCSD, UNEP and IUCN) includes stories about how NGOs, business, government and the UN cooperate. By doing so, it attempts to explain why Geneva has been picked by so many NGOs and UN as their headquarters location.\n\nThe World Organization of the Scout Movement (WOSM) and the World Scout Bureau Central Office  are headquartered in Geneva.\n\nNotable people \n\nA-G \n\n* Alfredo Aceto (born 1991), artist\n* Gustave Ador (1845–1928), politician and president of the International Committee of the Red Cross (ICRC)\n* David Aebischer (born 1978), ice hockey goaltender, Stanley Cup champion with the Colorado Avalanche in 2001\n* Jacques-Laurent Agasse (1767–1849), animal and landscape painter\n* Henri-Frédéric Amiel (1821–1881), writer and moral philosopher\n* Adolphe Appia (1862–1928), architect\n* Aimé Argand (1750–1803), naturalist and entrepreneur\n* Philip Arditti, actor\n* Martha Argerich (born 1941), Argentine pianist\n* John Armleder (born 1948), artist, painter, sculptor\n* Germaine Aussey (1909–1979), French actress\n* Edna Best (1900–1974), British actress\n* Jean-Luc Bideau (born 1940), Swiss film actor\n* Ernest Bloch (1880–1959), US composer of Swiss origin\n* Caroline Boissier-Butini (1786–1836), pianist and composer\n* Nicolas Bouvier (1929–1998), writer and photographer\n* Jorge Luis Borges (1899–1986), Argentine author, studied at the Collège de Genève from 1914 to 1918\n* Clotilde Bressler-Gianoli (1875-1912), opera singer born in Geneva\n\n* Christiane Brunner (born 1947), politician and trade unionist\n* Mickaël Buffaz (born 1979), French cyclist\n* Kate Burton (born 1957), actress, the daughter of actor Richard Burton\n* Cécile Butticaz (1884–1966), engineer\n* John Calvin (1509–1564), influential theologian, reformer\n* Clint Capela (born 1994), Swiss professional basketball player\n* Jean-Jacques Challet-Venel (1811–1893), politician\n* Henri Christiné (1867–1941), French composer\n* Étienne Clavière (1735–1793), banker and politician of the French revolution\n* Bernard Dalle (born 1967), venture capitalist\n* Jean-Louis de Lolme (1740–1806), lawyer\n* Jean-André Deluc (1727–1817), geologist and meteorologist\n* Ferdinand de Saussure (1857–1913), professor of linguistics\n* Giovanni Diodati (1576–1649), reformed theologian and Bible translator\n* Élie Ducommun (1833–1906), peace activist, Nobel Peace Prize 1902\n* Armand Dufaux (1833–1941), French-Swiss aviation pioneer and inventor\n* Henri Dufaux (1879–1980), French-Swiss aviation pioneer, inventor, painter and politician\n* Henry Dunant (1828–1910), initiator of the Red Cross movement and co-founder of the International Committee of the Red Cross, received the first Nobel Peace Prize in 1901\n* Isabelle Eberhardt (1877–1904), Russian-Swiss explorer and travel writer\n* Louis Favre (1826–1879), engineer, responsible for the construction of the Gotthard tunnel\n* Philippe Favre (1961–2013), racing driver\n* Edmond Fleg (1874–1963), French writer of Swiss origin\n* Ian Fleming (1908–1964), author (James Bond), studied psychology briefly at the University of Geneva\n* Sylvie Fleury (born 1961), object artist\n* Frère Max (1921–1996), theologian\n* Pierre-Victor Galland (1822–1892), painter\n* Albert Gallatin (1761–1849), American politician and diplomat\n* Marcel Golay (1927–2015), astronomer\n* Claude Goretta (born 1929), film director and television producer\n* Emilie Gourd (1879–1946), women's rights activist and journalist\n* Germain Henri Hess (1802–1850), chemist\n* Katerina Graham (born 1989), actress, singer, and model; she plays Bonnie Bennett in The Vampire Diaries\n* Romain Grosjean (born 1986), Formula 1 driver\n\nH-R \n\n* Germain Henri Hess (1802–1850), Swiss-Russian chemist\n* Jean Huber (1721–1786), Swiss politician, silhouette-cutter and painter\n* François Huber (1750–1831), naturalist\n* Marie Huber (1695–1753), translator, editor and author of theological works\n* Pierre Jeanneret (1896–1967), architect\n* Charles Journet (1891–1975), cardinal of the Roman Catholic Church\n* Louis Jurine (1751–1819), physician and naturalist\n* Thomas Jouannet (born 1970), actor\n* Adrien Lachenal (1849–1918), politician (Bundesrat)\n* Paul Lachenal (1884–1955), politician (Grand Conseil),President Pro Helvetia\n* François Lachenal (1918–1997), diplomat,editor\n* Marie Laforêt (born 1939), singer and actress\n\n* Sarah Lahbati (born 1993), actress, singer\n* François Le Fort (1656–1699), first Russian Admiral\n* Georges-Louis Le Sage (1724–1803), physicist\n* Jean Leclerc (1657–1736), theologian and philologist\n* Vladimir Lenin (1870–1924), lived in Geneva as an exile from the Russian Empire between 1902 and 1905.\n* Jean-Étienne Liotard (1702–1789), painter\n* Frank Martin (1890–1974), composer\n* Théodore Maunoir (1806–1869), co-founder of the International Committee of the Red Cross\n\n* Barthélemy Menn (1815–1893), landscape painter\n* Heinrich Menu von Minutoli (1772–1846), explorer and archaeologist\n* Jacques-Barthélemy Micheli du Crest (1690–1766), politicians and scientists\n* Thierry Moutinho (born 1991), Swiss-Portuguese footballer\n* Stephanie Morgenstern, actress, filmmaker, and screenwriter\n* Gustave Moynier (1826–1910), lawyer and co-founder of the International Committee of the Red Cross\n* Jacques Necker (1732–1804), banker and finance minister under Louis XVI\n* Louis Albert Necker (1786–1861), scientist and politician\n* Julie Ordon (born 1984), model and actress\n* Jean Piaget (1896 – 1980), Swiss clinical psychologist, founder of the International Center for Genetic Epistemology, director of the Rousseau Institute, Director of the International Bureau of Education, a professor at University of Geneva. Buried in an unmarked grave in the Cimetière des Rois, as requested. \n* Robert Pinget (1919–1997), writer\n* Léa Pool (born 1950), film director and screenwriter\n* James Pradier (1790–1852), French sculptor\n* Pierre Prévost (1751–1839), philosopher and physicist\n* Tariq Ramadan (born 1962), scientist and political activist\n* Marcel Raymond (1897–1981), literary critic and writer\n* Liliane Maury Pasquier (born 1956), politician\n* Jean-Louis Prévost (1838–1927), neurologist\n* Flore Revalles (1889–1966), singer, dancer and actress.\n* Charles-Gaspard de la Rive (1770–1834), physicist, psychiatrist and politician\n* Lucien de la Rive (1834–1924), physicist\n* Marc Rosset (born 1970), tennis player\n* Jean-Jacques Rousseau (1712–1778), writer and philosopher\n* Jean Rousset (1910–2002), literary critic and writer\n* Xavier Ruiz (born 1970), film producer and director\n\nS-Z \n\n* Horace-Bénédict de Saussure (1740–1799), naturalist\n* Nicolas-Théodore de Saussure (1767–1845), naturalist\n* Léon Savary (1895–1968), writer and journalist\n* Michel Simon (1895–1975), actor\n* Michael Schade (born 1965), Canadian opera and concert singer\n* Marguerite Sechehaye, (1887–1965), psychotherapist\n* Louis Segond (1810–1885), theologian\n* Philippe Senderos (born 1985), footballer\n* Jean Senebier (1742–1809), reformed pastor and naturalist\n* Pierre Eugene du Simitiere (1737–1784), artist and philosopher\n* François Simon (1917–1982), actor\n* Edward Snowden (born 1983), lived in Geneva between 2007 and 2009, while working for the CIA\n* Terry Southern (1924–1995), author, essayist, screenwriter\n* Emile Taddéoli (1879–1920), Swiss aviation pioneer\n* Alain Tanner (born 1929), film director\n* Voltaire (1694–1778), Enlightenment writer and philosopher, lived at Les Délices from 1755 to 1760\n* Ezekiel Spanheim (1629–1710), German diplomat\n* Friedrich Spanheim (1632–1701), German church historian\n* Maya Stojan (born 1986), Swiss actress\n* Richard Tarnas (born 1950), American philosopher and psychologist\n\n* Sigismund Thalberg (1812–1871), Austrian composer and pianist\n* Rodolphe Töpffer (1799–1846), artist and novelist\n* Vico Torriani (1920–1998), singer, actor, show host\n* Jean Alphonse Turretin (1671–1737), reformed theologian\n* Maurice Turrettini (1878–1932), architect\n* Pierre Wissmer (1915–1992), Swiss-French composer, pianist and music teacher\n* Jean Ziegler (born 1934), politician and sociologist. Geneva. http://en.wikipedia.org/?curid=12521."
  }
}
