{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8589",
  "eid" : "e90c8140-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778470740,
  "textBody" : "Events\n\n* 480 – Odoacer, first King of Italy, occupies Dalmatia. He later establishes his political power with the co-operation of the Roman Senate.\n* 536 – Gothic War: The Byzantine general Belisarius enters Rome unopposed; the Gothic garrison flee the capital.\n* 730 – Battle of Marj Ardabil: The Khazars annihilate an Umayyad army and kill its commander, Al-Jarrah Ibn Abdallah Al-Hakami.\n*1425 – The Catholic University of Leuven is founded.\n*1531 – The Virgin of Guadalupe first appears to Juan Diego at Tepeyac, Mexico City.\n*1688 – Glorious Revolution: Williamite forces defeat Jacobites at Battle of Reading, forcing flight of James II from the country.\n*1775 – American Revolutionary War: British troops lose the Battle of Great Bridge, and leave Virginia soon afterward.\n*1793 – New York City's first daily newspaper, the American Minerva, is established by Noah Webster.\n*1824 – Patriot forces led by General Antonio José de Sucre defeat a Royalist army in the Battle of Ayacucho, putting an end to the Peruvian War of Independence.\n*1835 – Texas Revolution: The Texian Army captures San Antonio, Texas.\n*1851 – The first YMCA in North America is established in Montreal.\n*1856 – The Iranian city of Bushehr surrenders to occupying British forces.\n*1861 – American Civil War: The Joint Committee on the Conduct of the War is established by the U.S. Congress.\n*1872 – In Louisiana, P. B. S. Pinchback becomes the first African-American governor of a U.S. state.\n*1892 – English soccer club Newcastle United is founded\n*1897 – Activist Marguerite Durand founds the feminist daily newspaper La Fronde in Paris.\n*1905 – In France, the law separating church and state is passed.\n*1911 – A mine explosion near Briceville, Tennessee, kills 84 miners despite rescue efforts led by the United States Bureau of Mines.\n*1917 – World War I: Field Marshal Allenby captures Jerusalem, Palestine.\n*1922 – Gabriel Narutowicz is elected the first president of Poland.\n*1931 – The Constituent Cortes approves a constitution which establishes the Second Spanish Republic.\n*1935 – Walter Liggett, American newspaper editor and muckraker, is killed in a gangland murder.\n*  1935   – The Downtown Athletic Club Trophy, later renamed the Heisman Trophy, is awarded for the first time. The winner is halfback Jay Berwanger of the University of Chicago.\n*1937 – Second Sino-Japanese War: Battle of Nanking: Japanese troops under the command of Lt. Gen. Asaka Yasuhiko launch an assault on the Chinese city of Nanjing (Nanking).\n*1940 – World War II: Operation Compass: British and Indian troops under the command of Major-General Richard O'Connor attack Italian forces near Sidi Barrani in Egypt.\n*1941 – World War II: The Republic of China, Cuba, Guatemala, and the Philippine Commonwealth, declare war on Germany and Japan.\n*  1941   – World War II: The American 19th Bombardment Group attacks Japanese ships off the coast of Vigan, Luzon.\n*1946 – The \"Subsequent Nuremberg trials\" begin with the \"Doctors' trial\", prosecuting physicians and officers alleged to be involved in Nazi human experimentation and mass murder under the guise of euthanasia.\n*  1946   – The Constituent Assembly of India meets for the first time to write the Constitution of India.\n*1948 – The Genocide Convention is adopted.\n*1950 – Cold War: Harry Gold is sentenced to 30 years in jail for helping Klaus Fuchs pass information about the Manhattan Project to the Soviet Union. His testimony is later instrumental in the prosecution of Julius and Ethel Rosenberg.\n*1953 – Red Scare: General Electric announces that all communist employees will be discharged from the company.\n*1956 – Trans-Canada Air Lines Flight 810, a Canadair North Star, crashes near Hope, British Columbia, Canada, killing all 62 people on board.\n*1958 – The John Birch Society is founded in the United States.\n*1960 – The first episode of Coronation Street, the world's longest-running television soap opera, is broadcast in the United Kingdom.\n*1961 – Tanganyika becomes independent from Britain.\n*1962 – The Petrified Forest National Park is established in Arizona.\n*1965 – Kecksburg UFO incident: A fireball is seen from Michigan to Pennsylvania; witnesses report something crashing in the woods near Pittsburgh.\n*  1965   – A Charlie Brown Christmas, first in a series of Peanuts television specials, debuts on CBS.\n*1968 – Douglas Engelbart gave what became known as \"The Mother of All Demos\", publicly debuting the computer mouse, hypertext, and the bit-mapped graphical user interface using the oN-Line System (NLS).\n*1969 – U.S. Secretary of State William P. Rogers proposes his plan for a ceasefire in the War of Attrition; Egypt and Jordan accept it over the objections of the PLO, which leads to civil war in Jordan in September 1970.\n*  1971   – Indo-Pakistani War: The Indian Air Force executes an airdrop of Indian Army units, bypassing Pakistani defences.\n*1973 – British and Irish authorities sign the Sunningdale Agreement in an attempt to establish a power-sharing Northern Ireland Executive and a cross-border Council of Ireland.\n*1979 – The eradication of the smallpox virus is certified, making smallpox the first of only two diseases that have been driven to extinction (rinderpest in 2011 being the other).\n*1982 – Explosion in office belonging to the Kuwait Airways in Athens.\n*1987 – Israeli–Palestinian conflict: The First Intifada begins in the Gaza Strip and West Bank.\n*1988 – The Michael Hughes Bridge in Sligo, Ireland, is officially opened.\n*1992 – American troops land in Somalia for Operation Restore Hope. \n*1996 – Gwen Jacob is acquitted of committing an indecent act, giving women the right to be topfree in Ontario, Canada.\n*2003 – A blast in the center of Moscow kills six people and wounds several more.\n*2008 – The Governor of Illinois, Rod Blagojevich, is arrested by federal officials for crimes including attempting to sell the U.S. Senate seat being vacated by President-elect Barack Obama.\n*2012 – A plane crash in Mexico kills seven people.\n*2013 – At least seven are dead and 63 are injured following a train accident near Bintaro, Indonesia.\n*2015 – The start of the thirty-sixth GCC summit in Riyadh business.\n*2016 – President Park Geun-hye of South Korea is impeached by the country's National Assembly in response to a major political scandal. Prime Minister Hwang Kyo-ahn becomes Acting President, later declining to run for a full term.\n*  2016   – At least 57 people are killed and a further 177 injured when two schoolgirl suicide bombers attack a market area in Madagali, Northeastern Nigeria in the Madagali suicide bombings.\n*2017 – Australia becomes the 26th country to legalize same-sex marriage.\n\nBirths\n\n*1392 – Peter, Duke of Coimbra (d. 1449)\n*1447 – Chenghua Emperor of China (d. 1487)\n*1482 – Frederick II, Elector Palatine (d. 1556)\n*1493 – Íñigo López de Mendoza, 4th Duke of the Infantado (d. 1566)\n*1508 – Gemma Frisius, Dutch mathematician and cartographer (d. 1555)\n*1561 – Edwin Sandys, English lawyer and politician (d. 1629)\n*1571 – Metius, Dutch mathematician and astronomer (d. 1635)\n*1579 – Martin de Porres, Peruvian saint (d. 1639)\n*1594 – Gustavus Adolphus of Sweden (d. 1632)\n*1608 – John Milton, English poet and philosopher (d. 1674)\n*1610 – Baldassare Ferri, Italian singer and actor (d. 1680)\n*1617 – Richard Lovelace, English poet (d. 1657)\n*1652 – Augustus Quirinus Rivinus, German physician and botanist (d. 1723)\n*1667 – William Whiston, English mathematician, historian, and theologian (d. 1752)\n*1717 – Johann Joachim Winckelmann, German archaeologist and historian (d. 1768)\n*1721 – Peter Pelham, English-American organist and composer (d. 1805)\n*1728 – Pietro Alessandro Guglielmi, Italian composer (d. 1804)\n*1745 – Maddalena Laura Sirmen, Italian violinist and composer (d. 1818)\n*1748 – Claude Louis Berthollet, French chemist and academic (d. 1822)\n*1752 – Antoine Étienne de Tousard, French general and engineer (d. 1813)\n*1787 – John Dobson, English architect, designed Eldon Square and Lilburn Tower (d. 1865)\n*1779 – Tabitha Babbitt,  American tool maker and inventor (d. 1853)\n*1806 – Jean-Olivier Chénier, Canadian physician (d. 1838)\n*1813 – Thomas Andrews, Irish chemist and physicist (d. 1885)\n*1837 – Émile Waldteufel, French pianist, composer, and conductor (d. 1915)\n*1842 – Peter Kropotkin, Russian zoologist, economist, geographer, and philosopher (d. 1921)\n*1845 – Joel Chandler Harris, American journalist and author (d. 1908)\n*1850 – Emma Abbott, American soprano and actress (d. 1891)\n*1861 – Hélène Smith, French psychic and occultist (d. 1929)\n*1867 – Gregorios Xenopoulos, Greek journalist and author (d. 1951)\n*1868 – Fritz Haber, Polish-German chemist and academic, Nobel Prize laureate (d. 1934)\n*1870 – Ida S. Scudder, Indian physician and missionary (d. 1960)\n*1871 – Joe Kelley, American baseball player and manager (d. 1943)\n*1873 – George Blewett, Canadian philosopher, author, and academic (d. 1912)\n*1875 – Harry Miller, American engineer (d. 1943)\n*1876 – Berton Churchill, Canadian-American actor and singer (d. 1940)\n*1882 – Elmer Booth, American actor (d. 1915)\n*  1882   – Joaquín Turina, Spanish-French composer, critic, and educator (d. 1949)\n*1883 – Nikolai Luzin, Russian mathematician, theorist, and academic (d. 1950)\n*  1883   – Alexander Papagos, Greek general and politician, 152nd Prime Minister of Greece (d. 1955)\n*  1883   – Joseph Pilates, German-American fitness expert, developed Pilates (d. 1967)\n*1886 – Clarence Birdseye, American businessman, founded Birds Eye (d. 1956)\n*1887 – Tim Moore, American actor (d. 1958)\n*1889 – Hannes Kolehmainen, Finnish-American runner (d. 1966)\n*1890 – Laura Salverson, Canadian author (d. 1970)\n*1891 – Maksim Bahdanovič, Belarusian poet and critic (d. 1917)\n*1892 – André Randall, French actor (d. 1974)\n*1895 – Dolores Ibárruri, Spanish activist, journalist and politician (d. 1989)\n*  1895   – Conchita Supervía, Spanish soprano and actress (d. 1936)\n*1897 – Hermione Gingold, English actress and singer (d. 1987)\n*1898 – Emmett Kelly, American clown and actor (d. 1979)\n*1899 – Jean de Brunhoff, French author and illustrator (d. 1937)\n*1900 – Margaret Brundage, American illustrator, known for illustrating pulp magazine Weird Tales (d. 1976)\n*  1900   – Albert Weisbord, American activist, founded the Communist League of Struggle (d. 1977)\n*1901 – Jean Mermoz, French pilot and politician (d. 1936)\n*  1901   – Ödön von Horváth, Hungarian-German author and playwright (d. 1938)\n*1902 – Margaret Hamilton, American schoolteacher, actress and voice artist (d. 1985)\n*1904 – Robert Livingston, American actor and singer (d. 1988)\n*1905 – Dalton Trumbo, American author, screenwriter, and blacklistee (d. 1976)\n*1906 – Grace Hopper, American admiral and computer scientist, designed COBOL (d. 1992)\n*  1906   – Freddy Martin, American bandleader and tenor saxophonist (d. 1983)\n*1909 – Douglas Fairbanks, Jr., American captain, actor, and producer (d. 2000)\n*1911 – Broderick Crawford, American actor (d. 1986)\n*  1911   – Ryūzō Sejima, Japanese colonel and businessman (d. 2007)\n*1912 – Tip O'Neill, American lawyer and politician, 55th Speaker of the United States House of Representatives (d. 1994)\n*  1912   – Jim Turnesa, American golfer (d. 1971)\n*1914 – Max Manus, Norwegian lieutenant (d. 1996)\n*  1914   – Frances Reid, American actress (d. 2010)\n*  1914   – Ljubica Sokić, Serbian painter and illustrator (d. 2009)\n*1915 – Eloise Jarvis McGraw, American author (d. 2000)\n*  1915   – Elisabeth Schwarzkopf, German-Austrian soprano and actress (d. 2006)\n*1916 – Jerome Beatty, Jr., American soldier, journalist, and author (d. 2002)\n*  1916   – Kirk Douglas, American actor, singer, and producer\n*  1916   – Colin McCool, Australian cricketer (d. 1986)\n*1917 – James Jesus Angleton, American CIA agent (d. 1987)\n*  1917   – James Rainwater, American physicist and academic, Nobel Prize laureate (d. 1986)\n*1918 – Joyce Redman, Irish-born British actress (d. 2012)\n*1919 – V. Dakshinamoorthy, Indian singer-songwriter (d. 2013)\n*  1919   – William Lipscomb, American chemist and academic, Nobel Prize laureate (d. 2011)\n*1920 – Carlo Azeglio Ciampi, Italian economist and politician, 10th President of Italy (d. 2016)\n*  1920   – Bruno Ruffo, Italian motorcycle racer and race car driver (d. 2007)\n*1922 – Redd Foxx, American actor (d. 1991)\n*  1925   – Roy Rubin, American basketball player and coach (d. 2013)\n*1926 – Henry Way Kendall, American physicist, photographer, and mountaineer, Nobel Prize laureate (d. 1999)\n*  1926   – David Nathan, British journalist (d. 2001)\n*  1926   – Jan Křesadlo, Czech-English psychologist and author (d. 1995)\n*  1926   – Lorenzo Wright, American sprinter and coach (d. 1972)\n*1927 – Pierre Henry, French composer (d. 2017)\n*1928 – Joan Blos, American author and educator\n*  1928   – André Milhoux, Belgian race car driver\n*  1928   – Dick Van Patten, American actor (d. 2015)\n*1929 – John Cassavetes, American actor, director, and screenwriter (d. 1989)\n*  1929   – Bob Hawke, Australian union leader and politician, 23rd Prime Minister of Australia\n*1930 – Buck Henry, American actor, director, and screenwriter\n*  1930   – Óscar Humberto Mejía Víctores, Guatemalan soldier and politician, 27th President of Guatemala (d. 2016)\n*1931 – William Reynolds, American actor\n*  1931   – Ladislav Smoljak, Czech actor, director, and screenwriter (d. 2010)\n*  1931   – Paddi Edwards, English-American actress (d. 1999)\n*1932 – Donald Byrd, American trumpet player and academic (d. 2013)\n*  1932   – Bill Hartack, American jockey (d. 2007)\n*  1932   – Billy Edd Wheeler, American singer-songwriter, guitarist, and playwright\n*1933 – Ashleigh Brilliant, English-American author and illustrator\n*  1933   – Milt Campbell, American decathlete and football player (d. 2012)\n*  1933   – Morton Downey, Jr., American singer-songwriter, actor, and talk show host (d. 2001)\n*  1933   – Orville Moody, American golfer (d. 2008)\n*1934 – Judi Dench, English actress \n*  1934   – Junior Wells, American blues singer-songwriter and harmonica player (d. 1998)\n*1938 – David Houston, American singer-songwriter and guitarist (d. 1993)\n*  1938   – Deacon Jones, American football player, sportscaster, and actor (d. 2013)\n*  1938   – Dimitrios Trichopoulos, Greek epidemiologist, oncologist, and academic (d. 2014)\n*1940 – Clancy Eccles, Jamaican singer-songwriter and producer (d. 2005)\n*1941 – Mehmet Ali Birand, Turkish journalist and author (d. 2013)\n*  1941   – Beau Bridges, American actor, director, and producer\n*  1941   – Dan Hicks, American singer-songwriter and guitarist (d. 2016)\n*1942 – Billy Bremner, Scottish footballer and manager (d. 1997)\n*  1942   – Dick Butkus, American football player, sportscaster, and actor\n*  1942   – Germain Gagnon, Canadian ice hockey player (d. 2014)\n*  1942   – Joe McGinniss, American journalist and author (d. 2014)\n*1943 – Pit Martin, Canadian ice hockey player (d. 2008)\n*  1943   – Joanna Trollope, English author, playwright, and director\n*  1943   – Kenny Vance, American singer-songwriter and music producer\n*1944 – Neil Innes, English singer-songwriter \n*  1944   – Ki Longfellow, American author, playwright, and producer\n*  1944   – Bob O'Connor, American businessman and politician, 57th Mayor of Pittsburgh (d. 2006)\n*1945 – Michael Nouri, American actor\n*1946 – David Currie, Baron Currie of Marylebone, English economist and academic\n*  1946   – Dennis Dunaway, American bass player and songwriter\n*  1946   – Sonia Gandhi, Italian-Indian politician\n*  1946   – Nicholas Reade, English bishop\n*1947 – Tom Daschle, American soldier, academic, and politician\n*  1947   – Jaak Jõerüüt, Estonian politician, 24th Estonian Minister of Defense\n*  1947   – Allan Jones, English cricketer and umpire\n*1948 – Marleen Gorris, Dutch director and screenwriter\n*  1948   – Jonathan Sumption, English historian, author, and judge\n*1949 – Tom Kite, American golfer and architect\n*1950 – Joan Armatrading, Kittian-English singer-songwriter and guitarist\n*1952 – Liaqat Baloch, Pakistani politician\n*  1952   – Michael Dorn, American actor and voice artist\n*1953 – Cornelis de Bondt, Dutch composer and educator\n*  1953   – World B. Free, American basketball player\n*  1953   – John Malkovich, American actor and producer\n*1954 – Phil Bryant, American academic and politician, 63rd Governor of Mississippi\n*  1954   – Jean-Claude Juncker, Luxembourger lawyer and politician, Prime Minister of Luxembourg\n*  1954   – Henk ten Cate, Dutch footballer and manager\n*1955 – Otis Birdsong, American basketball player and radio host\n*  1955   – Chamras Saewataporn, Thai singer-songwriter\n*1956 – Sylvia, American country singer-songwriter\n*  1956   – Jean-Pierre Thiollet, French journalist and author\n*1957 – Peter O'Mara, Australian guitarist and composer \n*  1957   – Donny Osmond, American singer-songwriter, dancer, and actor\n*  1957   – Steve Taylor, American singer-songwriter and producer \n*1958 – Nick Seymour, Australian bass player, songwriter, and producer \n*1959 – Susan Bullock, English soprano\n*1960 – Stefen Fangmeier, American visual effects designer and director\n*  1960   – Caroline Lucas, English activist and politician\n*  1960   – Terry Moran, American journalist\n*  1960   – Dobroslav Paraga, Croatian politician\n*  1960   – Juan Samuel, Dominican-American baseball player and manager\n*1961 – David Anthony Higgins, American actor and screenwriter\n*1962 – Felicity Huffman, American actress and producer\n*  1962   – Roxanne Swentzell, Santa Clara Pueblo (Native American) ceramic sculptor\n*1963 – Masako, Crown Princess of Japan\n*  1963   – Dave Hilton, Jr., Canadian boxer\n*1964 – Michael Foster, American drummer\n*  1964   – Hape Kerkeling, German actor and singer\n*  1964   – Les Kiss, Australian rugby league player\n*  1964   – Johannes B. Kerner, German journalist and sportscaster\n*  1964   – Paul Landers, German guitarist \n*1965 – Joe Ausanio, American baseball player and coach\n*1966 – Kirsten Gillibrand, American lawyer and politician\n*  1966   – Dave Harold, English snooker player\n*  1966   – Gideon Sa'ar, Israeli lawyer and politician, 24th Israeli Minister of Internal Affairs\n*  1966   – Martin Taylor, English footballer and coach\n*1967 – Joshua Bell, American violinist and conductor\n*  1967   – Jason Dozzell, English footballer and manager\n*1968 – Brian Bell, American singer-songwriter and guitarist \n*  1968   – Brent Price, American basketball player\n*1969 – Jakob Dylan, American singer-songwriter and guitarist \n*  1969   – Saskia Garel, Jamaican-Canadian singer-songwriter \n*  1969   – Lori Greiner, American businesswoman\n*  1969   – Bixente Lizarazu, French footballer\n*  1969   – Raphaël Rouquier, French mathematician and academic\n*1970 – Kara DioGuardi, American singer-songwriter and producer \n*  1970   – Lance Krall, American actor, director, producer, and screenwriter\n*1971 – Geoff Barrow, English drummer, DJ, composer, and producer \n*  1971   – Nick Hysong, American pole vaulter and coach\n*  1971   – Petr Nedvěd, Czech-Canadian ice hockey player\n*1972 – Reiko Aylesworth, American actress\n*  1972   – Tré Cool, German-American drummer and songwriter\n*  1972   – Michael Corcoran, American singer-songwriter and producer\n*  1972   – Fabrice Santoro, Tahitian-French tennis player and sportscaster\n*1973 – Fabio Artico, Italian footballer\n*  1973   – Vénuste Niyongabo, Burundian runner\n*  1973   – Bárbara Padilla, Mexican-American soprano\n*1974 – Canibus, Jamaican-American rapper \n*  1974   – Aloísio da Silva Filho, Brazilian footballer\n*  1974   – Wendy Dillinger, American soccer player, coach, and manager\n*1976 – Chris Booker, American baseball player\n*1977 – Shayne Graham, American football player\n*  1977   – Imogen Heap, English singer-songwriter and keyboard player \n*1978 – Gastón Gaudio, Argentinian tennis player\n*  1978   – Jesse Metcalfe, American actor and musician\n*1979 – Olivia Lufkin, Japanese-American singer-songwriter \n*  1979   – Stephen McPhail, Irish footballer\n*  1979   – Aiko Uemura, Japanese skier\n*1980 – Simon Helberg, American actor, comedian, and musician\n*  1980   – Ryder Hesjedal, Canadian cyclist\n*  1980   – Mark Riddell, Australian rugby league player and spostscaster\n*1981 – Mardy Fish, American tennis player\n*1982 – Tamilla Abassova, Russian cyclist\n*  1982   – Nathalie De Vos, Belgian runner\n*  1982   – Ryan Grant, American football player\n*  1982   – Bastian Swillims, German sprinter\n*1983 – Jermaine Beckford, English-Jamaican footballer\n*  1983   – Neslihan Demir Darnel, Turkish volleyball player\n*  1983   – Dariusz Dudka, Polish footballer\n*1984 – Michael Adam, German politician\n*  1984   – Ángel Guirado, Spanish–Filipino footballer\n*  1984   – Leon Hall, American football player\n*1985 – Wil Besseling, Dutch golfer\n*1987 – Kostas Giannoulis, Greek footballer\n*  1987   – Mat Latos, American baseball player\n*  1987   – Hikaru Nakamura, Japanese-American chess player\n*1988 – Kwadwo Asamoah, Ghanaian footballer\n*1990 – Denise Hannema, Dutch cricketer\n*1991 – Choi Minho, Korean singer and actor\n*1993 – Mark McMorris,  Canadian snowboarder\n*  1993   – Laura Smulders, Dutch cyclist \n*1995 – McKayla Maroney, American gymnast\n*1996 – MyKayla Skinner, American gymnast\n*2000 – Diāna Ņikitina, Latvian figure skater\n\nDeaths\n\n* 638 – Sergius I of Constantinople\n* 730 – Al-Jarrah ibn Abdallah, Arab general\n* 748 – Nasr ibn Sayyar, Umayyad general and politician (b. 663)\n* 933 – Li Congrong, prince of Later Tang\n*1048 – Al-Biruni, Persian mathematician (b. 973)\n*1117 – Gertrude of Brunswick, Markgräfin of Meißen\n*1165 – Malcolm IV of Scotland (b. 1141)\n*1242 – Richard le Gras, Lord Keeper of England and Abbot of Evesham\n*1268 – Vaišvilkas, Prince of Black Ruthenia, Grand Duke of Lithuania\n*1299 – Bohemond I, Archbishop of Trier\n*1437 – Sigismund, Holy Roman Emperor (b. 1368)\n*1544 – Teofilo Folengo, Italian poet (b. 1491)\n*1565 – Pope Pius IV (b. 1499)\n*1603 – William Watson, English priest (b. 1559)\n*1625 – Ubbo Emmius, Dutch historian and geographer (b. 1547)\n*1636 – Fabian Birkowski, Polish preacher and author (b. 1566)\n*1641 – Anthony van Dyck, Belgian-English painter and illustrator (b. 1599)\n*1669 – Pope Clement IX (b. 1600)\n*1674 – Edward Hyde, 1st Earl of Clarendon, English historian and politician, Chancellor of the Exchequer (b. 1609)\n*1706 – Peter II of Portugal (b. 1648)\n*1718 – Vincenzo Coronelli, Italian monk and cartographer (b. 1650)\n*1793 – Yolande de Polastron, French-Austrian educator (b. 1749)\n*1798 – Johann Reinhold Forster, German pastor, botanist, and ornithologist (b. 1729)\n*1830 – Heinrich Christian Friedrich Schumacher, Danish surgeon, botanist, and academic (b. 1757)\n*1854 – Almeida Garrett, Portuguese journalist and author (b. 1799)\n*1858 – Robert Baldwin, Canadian lawyer and politician, 3rd Premier of Canada West (b. 1804)\n*1887 – Mahmadu Lamine, Senegalese religious leader\n*1906 – Ferdinand Brunetière, French author and critic (b. 1849)\n*1916 – Natsume Sōseki, Japanese author and poet (b. 1867)\n*1924 – Bernard Zweers, Dutch composer and educator (b. 1854)\n*1930 – Rube Foster, American baseball player and manager (b. 1879)\n*1932 – Karl Blossfeldt, German photographer, sculptor, and educator (b. 1865)\n*  1932   – Begum Rokeya, Bangladeshi social worker and author (b. 1880)\n*1935 – Walter Liggett, American journalist and activist (b. 1886)\n*1937 – Lilias Armstrong, English phonetician (b. 1882)\n*  1937   – Gustaf Dalén, Swedish physicist and engineer, Nobel Prize laureate (b. 1869)\n*1941 – Dmitry Merezhkovsky, Russian author, poet, and philosopher (b. 1865)\n*1943 – Georges Dufrénoy, French painter (b. 1870)\n*1944 – Laird Cregar, American actor (b. 1913)\n*1945 – Yun Chi-ho, South Korean activist and politician (b. 1864)\n*1957 – Ali İhsan Sâbis, Turkish general (b. 1882)\n*1963 – Daniel O. Fagunwa, Nigerian author and educator (b. 1903)\n*  1963   – Perry Miller, American historian, author, and academic (b. 1905)\n*1964 – Edith Sitwell, English poet and critic (b. 1887)\n*1965 – Branch Rickey, American baseball player and manager (b. 1884)\n*1967 – Charles Léon Hammes, Luxembourgian lawyer and judge, 3rd President of the European Court of Justice (b. 1898)\n*1968 – Enoch L. Johnson, American mob boss (b. 1883)\n*1970 – Artem Mikoyan, Armenian-Russian engineer and businessman, co-founded the Mikoyan Company (b. 1905)\n*  1970   – Feroz Khan Noon, Pakistani politician, 7th Prime Minister of Pakistan (b. 1893)\n*1971 – Ralph Bunche, American political scientist, academic, and diplomat, Nobel Prize laureate (b. 1904)\n*  1971   – Sergey Konenkov, Russian sculptor and painter (b. 1874)\n*1972 – Louella Parsons, American writer and columnist (b. 1881)\n*1975 – William A. Wellman, American actor, director, producer, and screenwriter (b. 1896)\n*1979 – Fulton J. Sheen, American archbishop (b. 1895)\n*1982 – Leon Jaworski, American lawyer and politician (b. 1905)\n*1991 – Berenice Abbott, American photographer (b. 1898)\n*1992 – Vincent Gardenia, American actor (b. 1922)\n*1993 – Danny Blanchflower, Northern Irish footballer and manager (b. 1926)\n*1995 – Toni Cade Bambara, American author and academic (b. 1939)\n*  1995   – Douglas Corrigan, American pilot (b. 1907)\n*1996 – Patty Donahue, American singer-songwriter (b. 1956)\n*  1996   – Mary Leakey, English archaeologist and anthropologist (b. 1913)\n*  1996   – Alain Poher, French lawyer and politician, President of France (b. 1909)\n*  1996   – Diana Morgan, Welsh playwright and screenwriter (b. 1908)\n*1998 – Shaughnessy Cohen, Canadian lawyer and politician (b. 1948)\n*  1998   – Archie Moore, American boxer and actor (b. 1913)\n*2001 – Michael Carver, Baron Carver, English field marshal (b. 1915)\n*2002 – Mary Hansen, Australian singer and guitarist (b. 1966)\n*  2002   – Ian Hornak, American painter and sculptor (b. 1944)\n*  2002   – Stan Rice, American painter and poet (b. 1942)\n*2003 – Norm Sloan, American basketball player and coach (b. 1926)\n*  2003   – Paul Simon, American soldier, journalist, and politician, 39th Lieutenant Governor of Illinois (b. 1928)\n*2005 – György Sándor, Hungarian-American pianist and educator (b. 1912)\n*  2005   – Robert Sheckley, American author (b. 1928)\n*2006 – Georgia Gibbs, American singer (b. 1919)\n*2007 – Rafael Sperafico, Brazilian race car driver (b. 1981)\n*  2007   – Gordon Zahn, American sociologist, author, and academic (b. 1918)\n*2008 – Ibrahim Dossey, Ghanaian footballer (b. 1972)\n*  2008   – Yury Glazkov, Russian general, pilot, and astronaut (b. 1939)\n*2009 – Gene Barry, American actor (b. 1919)\n*2010 – James Moody, American saxophonist, flute player, and composer (b. 1925)\n*  2010   – Dov Shilansky, Lithuanian-Israeli lawyer and politician, 10th Speaker of the Knesset (b. 1924)\n*2012 – Béla Nagy Abodi, Hungarian painter and academic (b. 1918)\n*  2012   – Patrick Moore, English lieutenant, astronomer, and educator (b. 1923)\n*  2012   – Alex Moulton, English engineer and businessman, founded the Moulton Bicycle Company (b. 1920)\n*  2012   – Jenni Rivera, American singer-songwriter, producer, and actress (b. 1969)\n*  2012   – Charles Rosen, American pianist and musicologist (b. 1927)\n*  2012   – Riccardo Schicchi, Italian director and producer, co-founded Diva Futura (b. 1953)\n*  2012   – Norman Joseph Woodland, American inventor, co-created the bar code (b. 1921)\n*2013 – John Gabbert, American soldier, lawyer, and judge (b. 1909)\n*  2013   – Barbara Hesse-Bukowska, Polish pianist and educator (b. 1930)\n*  2013   – Eleanor Parker, American actress (b. 1922)\n*  2013   – John Wilbur, American football player (b. 1943)\n*2014 – Sacvan Bercovitch, Canadian-American author, critic, and academic (b. 1933)\n*  2014   – Jane Freilicher, American painter and poet (b. 1924)\n*  2014   – Jorge María Mejía, Argentinian cardinal (b. 1923)\n*  2014   – Mary Ann Mobley, American model and actress, Miss America 1959 (b. 1937)\n*  2014   – Blagoje Paunović, Serbian footballer and manager (b. 1947)\n*  2014   – Jože Toporišič, Slovenian linguist and author (b. 1926)\n*2015 – Soshana Afroyim, Austrian painter (b. 1927)\n*  2015   – Norman Breslow, American statistician and academic (b. 1941)\n*  2015   – Juvenal Juvêncio, Brazilian lawyer and politician (b. 1934)\n*  2015   – Julio Terrazas Sandoval, Bolivian cardinal (b. 1936)\n\nHolidays and observances\n\n*Anna's Day, marks the day to start the preparation process of the lutefisk to be consumed on Christmas Eve, as well as a Swedish name day, celebrating all people named Anna. (Sweden and Finland)\n*Armed Forces Day (Peru) \n*Christian feast day:\n**Feast of the Conception of the Most Holy Theotokos by St. Anne (Orthodox Church)\n**Juan Diego\n**Leocadia\n**Nectarius of Auvergne\n**Peter Fourier\n**December 9 (Eastern Orthodox liturgics)\n*Fatherland's Heroes Day (Russia)\n*Independence Day, celebrates the independence of Tanganyika from Britain in 1961. (Tanzania)\n*International Anti-Corruption Day (United Nations) \n*National Heroes Day, formerly V.C. Bird Day. (Antigua and Barbuda)\n*Navy Day (Sri Lanka)\n*Yuri's Day in the Autumn (Russian Orthodox Church)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "December 9" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8589" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 480 – Odoacer, first King of Italy, occupies Dalmatia. He later establishes his political power with the co-operation of the Roman Senate.\n* 536 – Gothic War: The Byzantine general Belisarius enters Rome unopposed; the Gothic garrison flee the capital.\n* 730 – Battle of Marj Ardabil: The Khazars annihilate an Umayyad army and kill its commander, Al-Jarrah Ibn Abdallah Al-Hakami.\n*1425 – The Catholic University of Leuven is founded.\n*1531 – The Virgin of Guadalupe first appears to Juan Diego at Tepeyac, Mexico City.\n*1688 – Glorious Revolution: Williamite forces defeat Jacobites at Battle of Reading, forcing flight of James II from the country.\n*1775 – American Revolutionary War: British troops lose the Battle of Great Bridge, and leave Virginia soon afterward.\n*1793 – New York City's first daily newspaper, the American Minerva, is established by Noah Webster.\n*1824 – Patriot forces led by General Antonio José de Sucre defeat a Royalist army in the Battle of Ayacucho, putting an end to the Peruvian War of Independence.\n*1835 – Texas Revolution: The Texian Army captures San Antonio, Texas.\n*1851 – The first YMCA in North America is established in Montreal.\n*1856 – The Iranian city of Bushehr surrenders to occupying British forces.\n*1861 – American Civil War: The Joint Committee on the Conduct of the War is established by the U.S. Congress.\n*1872 – In Louisiana, P. B. S. Pinchback becomes the first African-American governor of a U.S. state.\n*1892 – English soccer club Newcastle United is founded\n*1897 – Activist Marguerite Durand founds the feminist daily newspaper La Fronde in Paris.\n*1905 – In France, the law separating church and state is passed.\n*1911 – A mine explosion near Briceville, Tennessee, kills 84 miners despite rescue efforts led by the United States Bureau of Mines.\n*1917 – World War I: Field Marshal Allenby captures Jerusalem, Palestine.\n*1922 – Gabriel Narutowicz is elected the first president of Poland.\n*1931 – The Constituent Cortes approves a constitution which establishes the Second Spanish Republic.\n*1935 – Walter Liggett, American newspaper editor and muckraker, is killed in a gangland murder.\n*  1935   – The Downtown Athletic Club Trophy, later renamed the Heisman Trophy, is awarded for the first time. The winner is halfback Jay Berwanger of the University of Chicago.\n*1937 – Second Sino-Japanese War: Battle of Nanking: Japanese troops under the command of Lt. Gen. Asaka Yasuhiko launch an assault on the Chinese city of Nanjing (Nanking).\n*1940 – World War II: Operation Compass: British and Indian troops under the command of Major-General Richard O'Connor attack Italian forces near Sidi Barrani in Egypt.\n*1941 – World War II: The Republic of China, Cuba, Guatemala, and the Philippine Commonwealth, declare war on Germany and Japan.\n*  1941   – World War II: The American 19th Bombardment Group attacks Japanese ships off the coast of Vigan, Luzon.\n*1946 – The \"Subsequent Nuremberg trials\" begin with the \"Doctors' trial\", prosecuting physicians and officers alleged to be involved in Nazi human experimentation and mass murder under the guise of euthanasia.\n*  1946   – The Constituent Assembly of India meets for the first time to write the Constitution of India.\n*1948 – The Genocide Convention is adopted.\n*1950 – Cold War: Harry Gold is sentenced to 30 years in jail for helping Klaus Fuchs pass information about the Manhattan Project to the Soviet Union. His testimony is later instrumental in the prosecution of Julius and Ethel Rosenberg.\n*1953 – Red Scare: General Electric announces that all communist employees will be discharged from the company.\n*1956 – Trans-Canada Air Lines Flight 810, a Canadair North Star, crashes near Hope, British Columbia, Canada, killing all 62 people on board.\n*1958 – The John Birch Society is founded in the United States.\n*1960 – The first episode of Coronation Street, the world's longest-running television soap opera, is broadcast in the United Kingdom.\n*1961 – Tanganyika becomes independent from Britain.\n*1962 – The Petrified Forest National Park is established in Arizona.\n*1965 – Kecksburg UFO incident: A fireball is seen from Michigan to Pennsylvania; witnesses report something crashing in the woods near Pittsburgh.\n*  1965   – A Charlie Brown Christmas, first in a series of Peanuts television specials, debuts on CBS.\n*1968 – Douglas Engelbart gave what became known as \"The Mother of All Demos\", publicly debuting the computer mouse, hypertext, and the bit-mapped graphical user interface using the oN-Line System (NLS).\n*1969 – U.S. Secretary of State William P. Rogers proposes his plan for a ceasefire in the War of Attrition; Egypt and Jordan accept it over the objections of the PLO, which leads to civil war in Jordan in September 1970.\n*  1971   – Indo-Pakistani War: The Indian Air Force executes an airdrop of Indian Army units, bypassing Pakistani defences.\n*1973 – British and Irish authorities sign the Sunningdale Agreement in an attempt to establish a power-sharing Northern Ireland Executive and a cross-border Council of Ireland.\n*1979 – The eradication of the smallpox virus is certified, making smallpox the first of only two diseases that have been driven to extinction (rinderpest in 2011 being the other).\n*1982 – Explosion in office belonging to the Kuwait Airways in Athens.\n*1987 – Israeli–Palestinian conflict: The First Intifada begins in the Gaza Strip and West Bank.\n*1988 – The Michael Hughes Bridge in Sligo, Ireland, is officially opened.\n*1992 – American troops land in Somalia for Operation Restore Hope. \n*1996 – Gwen Jacob is acquitted of committing an indecent act, giving women the right to be topfree in Ontario, Canada.\n*2003 – A blast in the center of Moscow kills six people and wounds several more.\n*2008 – The Governor of Illinois, Rod Blagojevich, is arrested by federal officials for crimes including attempting to sell the U.S. Senate seat being vacated by President-elect Barack Obama.\n*2012 – A plane crash in Mexico kills seven people.\n*2013 – At least seven are dead and 63 are injured following a train accident near Bintaro, Indonesia.\n*2015 – The start of the thirty-sixth GCC summit in Riyadh business.\n*2016 – President Park Geun-hye of South Korea is impeached by the country's National Assembly in response to a major political scandal. Prime Minister Hwang Kyo-ahn becomes Acting President, later declining to run for a full term.\n*  2016   – At least 57 people are killed and a further 177 injured when two schoolgirl suicide bombers attack a market area in Madagali, Northeastern Nigeria in the Madagali suicide bombings.\n*2017 – Australia becomes the 26th country to legalize same-sex marriage.\n\nBirths\n\n*1392 – Peter, Duke of Coimbra (d. 1449)\n*1447 – Chenghua Emperor of China (d. 1487)\n*1482 – Frederick II, Elector Palatine (d. 1556)\n*1493 – Íñigo López de Mendoza, 4th Duke of the Infantado (d. 1566)\n*1508 – Gemma Frisius, Dutch mathematician and cartographer (d. 1555)\n*1561 – Edwin Sandys, English lawyer and politician (d. 1629)\n*1571 – Metius, Dutch mathematician and astronomer (d. 1635)\n*1579 – Martin de Porres, Peruvian saint (d. 1639)\n*1594 – Gustavus Adolphus of Sweden (d. 1632)\n*1608 – John Milton, English poet and philosopher (d. 1674)\n*1610 – Baldassare Ferri, Italian singer and actor (d. 1680)\n*1617 – Richard Lovelace, English poet (d. 1657)\n*1652 – Augustus Quirinus Rivinus, German physician and botanist (d. 1723)\n*1667 – William Whiston, English mathematician, historian, and theologian (d. 1752)\n*1717 – Johann Joachim Winckelmann, German archaeologist and historian (d. 1768)\n*1721 – Peter Pelham, English-American organist and composer (d. 1805)\n*1728 – Pietro Alessandro Guglielmi, Italian composer (d. 1804)\n*1745 – Maddalena Laura Sirmen, Italian violinist and composer (d. 1818)\n*1748 – Claude Louis Berthollet, French chemist and academic (d. 1822)\n*1752 – Antoine Étienne de Tousard, French general and engineer (d. 1813)\n*1787 – John Dobson, English architect, designed Eldon Square and Lilburn Tower (d. 1865)\n*1779 – Tabitha Babbitt,  American tool maker and inventor (d. 1853)\n*1806 – Jean-Olivier Chénier, Canadian physician (d. 1838)\n*1813 – Thomas Andrews, Irish chemist and physicist (d. 1885)\n*1837 – Émile Waldteufel, French pianist, composer, and conductor (d. 1915)\n*1842 – Peter Kropotkin, Russian zoologist, economist, geographer, and philosopher (d. 1921)\n*1845 – Joel Chandler Harris, American journalist and author (d. 1908)\n*1850 – Emma Abbott, American soprano and actress (d. 1891)\n*1861 – Hélène Smith, French psychic and occultist (d. 1929)\n*1867 – Gregorios Xenopoulos, Greek journalist and author (d. 1951)\n*1868 – Fritz Haber, Polish-German chemist and academic, Nobel Prize laureate (d. 1934)\n*1870 – Ida S. Scudder, Indian physician and missionary (d. 1960)\n*1871 – Joe Kelley, American baseball player and manager (d. 1943)\n*1873 – George Blewett, Canadian philosopher, author, and academic (d. 1912)\n*1875 – Harry Miller, American engineer (d. 1943)\n*1876 – Berton Churchill, Canadian-American actor and singer (d. 1940)\n*1882 – Elmer Booth, American actor (d. 1915)\n*  1882   – Joaquín Turina, Spanish-French composer, critic, and educator (d. 1949)\n*1883 – Nikolai Luzin, Russian mathematician, theorist, and academic (d. 1950)\n*  1883   – Alexander Papagos, Greek general and politician, 152nd Prime Minister of Greece (d. 1955)\n*  1883   – Joseph Pilates, German-American fitness expert, developed Pilates (d. 1967)\n*1886 – Clarence Birdseye, American businessman, founded Birds Eye (d. 1956)\n*1887 – Tim Moore, American actor (d. 1958)\n*1889 – Hannes Kolehmainen, Finnish-American runner (d. 1966)\n*1890 – Laura Salverson, Canadian author (d. 1970)\n*1891 – Maksim Bahdanovič, Belarusian poet and critic (d. 1917)\n*1892 – André Randall, French actor (d. 1974)\n*1895 – Dolores Ibárruri, Spanish activist, journalist and politician (d. 1989)\n*  1895   – Conchita Supervía, Spanish soprano and actress (d. 1936)\n*1897 – Hermione Gingold, English actress and singer (d. 1987)\n*1898 – Emmett Kelly, American clown and actor (d. 1979)\n*1899 – Jean de Brunhoff, French author and illustrator (d. 1937)\n*1900 – Margaret Brundage, American illustrator, known for illustrating pulp magazine Weird Tales (d. 1976)\n*  1900   – Albert Weisbord, American activist, founded the Communist League of Struggle (d. 1977)\n*1901 – Jean Mermoz, French pilot and politician (d. 1936)\n*  1901   – Ödön von Horváth, Hungarian-German author and playwright (d. 1938)\n*1902 – Margaret Hamilton, American schoolteacher, actress and voice artist (d. 1985)\n*1904 – Robert Livingston, American actor and singer (d. 1988)\n*1905 – Dalton Trumbo, American author, screenwriter, and blacklistee (d. 1976)\n*1906 – Grace Hopper, American admiral and computer scientist, designed COBOL (d. 1992)\n*  1906   – Freddy Martin, American bandleader and tenor saxophonist (d. 1983)\n*1909 – Douglas Fairbanks, Jr., American captain, actor, and producer (d. 2000)\n*1911 – Broderick Crawford, American actor (d. 1986)\n*  1911   – Ryūzō Sejima, Japanese colonel and businessman (d. 2007)\n*1912 – Tip O'Neill, American lawyer and politician, 55th Speaker of the United States House of Representatives (d. 1994)\n*  1912   – Jim Turnesa, American golfer (d. 1971)\n*1914 – Max Manus, Norwegian lieutenant (d. 1996)\n*  1914   – Frances Reid, American actress (d. 2010)\n*  1914   – Ljubica Sokić, Serbian painter and illustrator (d. 2009)\n*1915 – Eloise Jarvis McGraw, American author (d. 2000)\n*  1915   – Elisabeth Schwarzkopf, German-Austrian soprano and actress (d. 2006)\n*1916 – Jerome Beatty, Jr., American soldier, journalist, and author (d. 2002)\n*  1916   – Kirk Douglas, American actor, singer, and producer\n*  1916   – Colin McCool, Australian cricketer (d. 1986)\n*1917 – James Jesus Angleton, American CIA agent (d. 1987)\n*  1917   – James Rainwater, American physicist and academic, Nobel Prize laureate (d. 1986)\n*1918 – Joyce Redman, Irish-born British actress (d. 2012)\n*1919 – V. Dakshinamoorthy, Indian singer-songwriter (d. 2013)\n*  1919   – William Lipscomb, American chemist and academic, Nobel Prize laureate (d. 2011)\n*1920 – Carlo Azeglio Ciampi, Italian economist and politician, 10th President of Italy (d. 2016)\n*  1920   – Bruno Ruffo, Italian motorcycle racer and race car driver (d. 2007)\n*1922 – Redd Foxx, American actor (d. 1991)\n*  1925   – Roy Rubin, American basketball player and coach (d. 2013)\n*1926 – Henry Way Kendall, American physicist, photographer, and mountaineer, Nobel Prize laureate (d. 1999)\n*  1926   – David Nathan, British journalist (d. 2001)\n*  1926   – Jan Křesadlo, Czech-English psychologist and author (d. 1995)\n*  1926   – Lorenzo Wright, American sprinter and coach (d. 1972)\n*1927 – Pierre Henry, French composer (d. 2017)\n*1928 – Joan Blos, American author and educator\n*  1928   – André Milhoux, Belgian race car driver\n*  1928   – Dick Van Patten, American actor (d. 2015)\n*1929 – John Cassavetes, American actor, director, and screenwriter (d. 1989)\n*  1929   – Bob Hawke, Australian union leader and politician, 23rd Prime Minister of Australia\n*1930 – Buck Henry, American actor, director, and screenwriter\n*  1930   – Óscar Humberto Mejía Víctores, Guatemalan soldier and politician, 27th President of Guatemala (d. 2016)\n*1931 – William Reynolds, American actor\n*  1931   – Ladislav Smoljak, Czech actor, director, and screenwriter (d. 2010)\n*  1931   – Paddi Edwards, English-American actress (d. 1999)\n*1932 – Donald Byrd, American trumpet player and academic (d. 2013)\n*  1932   – Bill Hartack, American jockey (d. 2007)\n*  1932   – Billy Edd Wheeler, American singer-songwriter, guitarist, and playwright\n*1933 – Ashleigh Brilliant, English-American author and illustrator\n*  1933   – Milt Campbell, American decathlete and football player (d. 2012)\n*  1933   – Morton Downey, Jr., American singer-songwriter, actor, and talk show host (d. 2001)\n*  1933   – Orville Moody, American golfer (d. 2008)\n*1934 – Judi Dench, English actress \n*  1934   – Junior Wells, American blues singer-songwriter and harmonica player (d. 1998)\n*1938 – David Houston, American singer-songwriter and guitarist (d. 1993)\n*  1938   – Deacon Jones, American football player, sportscaster, and actor (d. 2013)\n*  1938   – Dimitrios Trichopoulos, Greek epidemiologist, oncologist, and academic (d. 2014)\n*1940 – Clancy Eccles, Jamaican singer-songwriter and producer (d. 2005)\n*1941 – Mehmet Ali Birand, Turkish journalist and author (d. 2013)\n*  1941   – Beau Bridges, American actor, director, and producer\n*  1941   – Dan Hicks, American singer-songwriter and guitarist (d. 2016)\n*1942 – Billy Bremner, Scottish footballer and manager (d. 1997)\n*  1942   – Dick Butkus, American football player, sportscaster, and actor\n*  1942   – Germain Gagnon, Canadian ice hockey player (d. 2014)\n*  1942   – Joe McGinniss, American journalist and author (d. 2014)\n*1943 – Pit Martin, Canadian ice hockey player (d. 2008)\n*  1943   – Joanna Trollope, English author, playwright, and director\n*  1943   – Kenny Vance, American singer-songwriter and music producer\n*1944 – Neil Innes, English singer-songwriter \n*  1944   – Ki Longfellow, American author, playwright, and producer\n*  1944   – Bob O'Connor, American businessman and politician, 57th Mayor of Pittsburgh (d. 2006)\n*1945 – Michael Nouri, American actor\n*1946 – David Currie, Baron Currie of Marylebone, English economist and academic\n*  1946   – Dennis Dunaway, American bass player and songwriter\n*  1946   – Sonia Gandhi, Italian-Indian politician\n*  1946   – Nicholas Reade, English bishop\n*1947 – Tom Daschle, American soldier, academic, and politician\n*  1947   – Jaak Jõerüüt, Estonian politician, 24th Estonian Minister of Defense\n*  1947   – Allan Jones, English cricketer and umpire\n*1948 – Marleen Gorris, Dutch director and screenwriter\n*  1948   – Jonathan Sumption, English historian, author, and judge\n*1949 – Tom Kite, American golfer and architect\n*1950 – Joan Armatrading, Kittian-English singer-songwriter and guitarist\n*1952 – Liaqat Baloch, Pakistani politician\n*  1952   – Michael Dorn, American actor and voice artist\n*1953 – Cornelis de Bondt, Dutch composer and educator\n*  1953   – World B. Free, American basketball player\n*  1953   – John Malkovich, American actor and producer\n*1954 – Phil Bryant, American academic and politician, 63rd Governor of Mississippi\n*  1954   – Jean-Claude Juncker, Luxembourger lawyer and politician, Prime Minister of Luxembourg\n*  1954   – Henk ten Cate, Dutch footballer and manager\n*1955 – Otis Birdsong, American basketball player and radio host\n*  1955   – Chamras Saewataporn, Thai singer-songwriter\n*1956 – Sylvia, American country singer-songwriter\n*  1956   – Jean-Pierre Thiollet, French journalist and author\n*1957 – Peter O'Mara, Australian guitarist and composer \n*  1957   – Donny Osmond, American singer-songwriter, dancer, and actor\n*  1957   – Steve Taylor, American singer-songwriter and producer \n*1958 – Nick Seymour, Australian bass player, songwriter, and producer \n*1959 – Susan Bullock, English soprano\n*1960 – Stefen Fangmeier, American visual effects designer and director\n*  1960   – Caroline Lucas, English activist and politician\n*  1960   – Terry Moran, American journalist\n*  1960   – Dobroslav Paraga, Croatian politician\n*  1960   – Juan Samuel, Dominican-American baseball player and manager\n*1961 – David Anthony Higgins, American actor and screenwriter\n*1962 – Felicity Huffman, American actress and producer\n*  1962   – Roxanne Swentzell, Santa Clara Pueblo (Native American) ceramic sculptor\n*1963 – Masako, Crown Princess of Japan\n*  1963   – Dave Hilton, Jr., Canadian boxer\n*1964 – Michael Foster, American drummer\n*  1964   – Hape Kerkeling, German actor and singer\n*  1964   – Les Kiss, Australian rugby league player\n*  1964   – Johannes B. Kerner, German journalist and sportscaster\n*  1964   – Paul Landers, German guitarist \n*1965 – Joe Ausanio, American baseball player and coach\n*1966 – Kirsten Gillibrand, American lawyer and politician\n*  1966   – Dave Harold, English snooker player\n*  1966   – Gideon Sa'ar, Israeli lawyer and politician, 24th Israeli Minister of Internal Affairs\n*  1966   – Martin Taylor, English footballer and coach\n*1967 – Joshua Bell, American violinist and conductor\n*  1967   – Jason Dozzell, English footballer and manager\n*1968 – Brian Bell, American singer-songwriter and guitarist \n*  1968   – Brent Price, American basketball player\n*1969 – Jakob Dylan, American singer-songwriter and guitarist \n*  1969   – Saskia Garel, Jamaican-Canadian singer-songwriter \n*  1969   – Lori Greiner, American businesswoman\n*  1969   – Bixente Lizarazu, French footballer\n*  1969   – Raphaël Rouquier, French mathematician and academic\n*1970 – Kara DioGuardi, American singer-songwriter and producer \n*  1970   – Lance Krall, American actor, director, producer, and screenwriter\n*1971 – Geoff Barrow, English drummer, DJ, composer, and producer \n*  1971   – Nick Hysong, American pole vaulter and coach\n*  1971   – Petr Nedvěd, Czech-Canadian ice hockey player\n*1972 – Reiko Aylesworth, American actress\n*  1972   – Tré Cool, German-American drummer and songwriter\n*  1972   – Michael Corcoran, American singer-songwriter and producer\n*  1972   – Fabrice Santoro, Tahitian-French tennis player and sportscaster\n*1973 – Fabio Artico, Italian footballer\n*  1973   – Vénuste Niyongabo, Burundian runner\n*  1973   – Bárbara Padilla, Mexican-American soprano\n*1974 – Canibus, Jamaican-American rapper \n*  1974   – Aloísio da Silva Filho, Brazilian footballer\n*  1974   – Wendy Dillinger, American soccer player, coach, and manager\n*1976 – Chris Booker, American baseball player\n*1977 – Shayne Graham, American football player\n*  1977   – Imogen Heap, English singer-songwriter and keyboard player \n*1978 – Gastón Gaudio, Argentinian tennis player\n*  1978   – Jesse Metcalfe, American actor and musician\n*1979 – Olivia Lufkin, Japanese-American singer-songwriter \n*  1979   – Stephen McPhail, Irish footballer\n*  1979   – Aiko Uemura, Japanese skier\n*1980 – Simon Helberg, American actor, comedian, and musician\n*  1980   – Ryder Hesjedal, Canadian cyclist\n*  1980   – Mark Riddell, Australian rugby league player and spostscaster\n*1981 – Mardy Fish, American tennis player\n*1982 – Tamilla Abassova, Russian cyclist\n*  1982   – Nathalie De Vos, Belgian runner\n*  1982   – Ryan Grant, American football player\n*  1982   – Bastian Swillims, German sprinter\n*1983 – Jermaine Beckford, English-Jamaican footballer\n*  1983   – Neslihan Demir Darnel, Turkish volleyball player\n*  1983   – Dariusz Dudka, Polish footballer\n*1984 – Michael Adam, German politician\n*  1984   – Ángel Guirado, Spanish–Filipino footballer\n*  1984   – Leon Hall, American football player\n*1985 – Wil Besseling, Dutch golfer\n*1987 – Kostas Giannoulis, Greek footballer\n*  1987   – Mat Latos, American baseball player\n*  1987   – Hikaru Nakamura, Japanese-American chess player\n*1988 – Kwadwo Asamoah, Ghanaian footballer\n*1990 – Denise Hannema, Dutch cricketer\n*1991 – Choi Minho, Korean singer and actor\n*1993 – Mark McMorris,  Canadian snowboarder\n*  1993   – Laura Smulders, Dutch cyclist \n*1995 – McKayla Maroney, American gymnast\n*1996 – MyKayla Skinner, American gymnast\n*2000 – Diāna Ņikitina, Latvian figure skater\n\nDeaths\n\n* 638 – Sergius I of Constantinople\n* 730 – Al-Jarrah ibn Abdallah, Arab general\n* 748 – Nasr ibn Sayyar, Umayyad general and politician (b. 663)\n* 933 – Li Congrong, prince of Later Tang\n*1048 – Al-Biruni, Persian mathematician (b. 973)\n*1117 – Gertrude of Brunswick, Markgräfin of Meißen\n*1165 – Malcolm IV of Scotland (b. 1141)\n*1242 – Richard le Gras, Lord Keeper of England and Abbot of Evesham\n*1268 – Vaišvilkas, Prince of Black Ruthenia, Grand Duke of Lithuania\n*1299 – Bohemond I, Archbishop of Trier\n*1437 – Sigismund, Holy Roman Emperor (b. 1368)\n*1544 – Teofilo Folengo, Italian poet (b. 1491)\n*1565 – Pope Pius IV (b. 1499)\n*1603 – William Watson, English priest (b. 1559)\n*1625 – Ubbo Emmius, Dutch historian and geographer (b. 1547)\n*1636 – Fabian Birkowski, Polish preacher and author (b. 1566)\n*1641 – Anthony van Dyck, Belgian-English painter and illustrator (b. 1599)\n*1669 – Pope Clement IX (b. 1600)\n*1674 – Edward Hyde, 1st Earl of Clarendon, English historian and politician, Chancellor of the Exchequer (b. 1609)\n*1706 – Peter II of Portugal (b. 1648)\n*1718 – Vincenzo Coronelli, Italian monk and cartographer (b. 1650)\n*1793 – Yolande de Polastron, French-Austrian educator (b. 1749)\n*1798 – Johann Reinhold Forster, German pastor, botanist, and ornithologist (b. 1729)\n*1830 – Heinrich Christian Friedrich Schumacher, Danish surgeon, botanist, and academic (b. 1757)\n*1854 – Almeida Garrett, Portuguese journalist and author (b. 1799)\n*1858 – Robert Baldwin, Canadian lawyer and politician, 3rd Premier of Canada West (b. 1804)\n*1887 – Mahmadu Lamine, Senegalese religious leader\n*1906 – Ferdinand Brunetière, French author and critic (b. 1849)\n*1916 – Natsume Sōseki, Japanese author and poet (b. 1867)\n*1924 – Bernard Zweers, Dutch composer and educator (b. 1854)\n*1930 – Rube Foster, American baseball player and manager (b. 1879)\n*1932 – Karl Blossfeldt, German photographer, sculptor, and educator (b. 1865)\n*  1932   – Begum Rokeya, Bangladeshi social worker and author (b. 1880)\n*1935 – Walter Liggett, American journalist and activist (b. 1886)\n*1937 – Lilias Armstrong, English phonetician (b. 1882)\n*  1937   – Gustaf Dalén, Swedish physicist and engineer, Nobel Prize laureate (b. 1869)\n*1941 – Dmitry Merezhkovsky, Russian author, poet, and philosopher (b. 1865)\n*1943 – Georges Dufrénoy, French painter (b. 1870)\n*1944 – Laird Cregar, American actor (b. 1913)\n*1945 – Yun Chi-ho, South Korean activist and politician (b. 1864)\n*1957 – Ali İhsan Sâbis, Turkish general (b. 1882)\n*1963 – Daniel O. Fagunwa, Nigerian author and educator (b. 1903)\n*  1963   – Perry Miller, American historian, author, and academic (b. 1905)\n*1964 – Edith Sitwell, English poet and critic (b. 1887)\n*1965 – Branch Rickey, American baseball player and manager (b. 1884)\n*1967 – Charles Léon Hammes, Luxembourgian lawyer and judge, 3rd President of the European Court of Justice (b. 1898)\n*1968 – Enoch L. Johnson, American mob boss (b. 1883)\n*1970 – Artem Mikoyan, Armenian-Russian engineer and businessman, co-founded the Mikoyan Company (b. 1905)\n*  1970   – Feroz Khan Noon, Pakistani politician, 7th Prime Minister of Pakistan (b. 1893)\n*1971 – Ralph Bunche, American political scientist, academic, and diplomat, Nobel Prize laureate (b. 1904)\n*  1971   – Sergey Konenkov, Russian sculptor and painter (b. 1874)\n*1972 – Louella Parsons, American writer and columnist (b. 1881)\n*1975 – William A. Wellman, American actor, director, producer, and screenwriter (b. 1896)\n*1979 – Fulton J. Sheen, American archbishop (b. 1895)\n*1982 – Leon Jaworski, American lawyer and politician (b. 1905)\n*1991 – Berenice Abbott, American photographer (b. 1898)\n*1992 – Vincent Gardenia, American actor (b. 1922)\n*1993 – Danny Blanchflower, Northern Irish footballer and manager (b. 1926)\n*1995 – Toni Cade Bambara, American author and academic (b. 1939)\n*  1995   – Douglas Corrigan, American pilot (b. 1907)\n*1996 – Patty Donahue, American singer-songwriter (b. 1956)\n*  1996   – Mary Leakey, English archaeologist and anthropologist (b. 1913)\n*  1996   – Alain Poher, French lawyer and politician, President of France (b. 1909)\n*  1996   – Diana Morgan, Welsh playwright and screenwriter (b. 1908)\n*1998 – Shaughnessy Cohen, Canadian lawyer and politician (b. 1948)\n*  1998   – Archie Moore, American boxer and actor (b. 1913)\n*2001 – Michael Carver, Baron Carver, English field marshal (b. 1915)\n*2002 – Mary Hansen, Australian singer and guitarist (b. 1966)\n*  2002   – Ian Hornak, American painter and sculptor (b. 1944)\n*  2002   – Stan Rice, American painter and poet (b. 1942)\n*2003 – Norm Sloan, American basketball player and coach (b. 1926)\n*  2003   – Paul Simon, American soldier, journalist, and politician, 39th Lieutenant Governor of Illinois (b. 1928)\n*2005 – György Sándor, Hungarian-American pianist and educator (b. 1912)\n*  2005   – Robert Sheckley, American author (b. 1928)\n*2006 – Georgia Gibbs, American singer (b. 1919)\n*2007 – Rafael Sperafico, Brazilian race car driver (b. 1981)\n*  2007   – Gordon Zahn, American sociologist, author, and academic (b. 1918)\n*2008 – Ibrahim Dossey, Ghanaian footballer (b. 1972)\n*  2008   – Yury Glazkov, Russian general, pilot, and astronaut (b. 1939)\n*2009 – Gene Barry, American actor (b. 1919)\n*2010 – James Moody, American saxophonist, flute player, and composer (b. 1925)\n*  2010   – Dov Shilansky, Lithuanian-Israeli lawyer and politician, 10th Speaker of the Knesset (b. 1924)\n*2012 – Béla Nagy Abodi, Hungarian painter and academic (b. 1918)\n*  2012   – Patrick Moore, English lieutenant, astronomer, and educator (b. 1923)\n*  2012   – Alex Moulton, English engineer and businessman, founded the Moulton Bicycle Company (b. 1920)\n*  2012   – Jenni Rivera, American singer-songwriter, producer, and actress (b. 1969)\n*  2012   – Charles Rosen, American pianist and musicologist (b. 1927)\n*  2012   – Riccardo Schicchi, Italian director and producer, co-founded Diva Futura (b. 1953)\n*  2012   – Norman Joseph Woodland, American inventor, co-created the bar code (b. 1921)\n*2013 – John Gabbert, American soldier, lawyer, and judge (b. 1909)\n*  2013   – Barbara Hesse-Bukowska, Polish pianist and educator (b. 1930)\n*  2013   – Eleanor Parker, American actress (b. 1922)\n*  2013   – John Wilbur, American football player (b. 1943)\n*2014 – Sacvan Bercovitch, Canadian-American author, critic, and academic (b. 1933)\n*  2014   – Jane Freilicher, American painter and poet (b. 1924)\n*  2014   – Jorge María Mejía, Argentinian cardinal (b. 1923)\n*  2014   – Mary Ann Mobley, American model and actress, Miss America 1959 (b. 1937)\n*  2014   – Blagoje Paunović, Serbian footballer and manager (b. 1947)\n*  2014   – Jože Toporišič, Slovenian linguist and author (b. 1926)\n*2015 – Soshana Afroyim, Austrian painter (b. 1927)\n*  2015   – Norman Breslow, American statistician and academic (b. 1941)\n*  2015   – Juvenal Juvêncio, Brazilian lawyer and politician (b. 1934)\n*  2015   – Julio Terrazas Sandoval, Bolivian cardinal (b. 1936)\n\nHolidays and observances\n\n*Anna's Day, marks the day to start the preparation process of the lutefisk to be consumed on Christmas Eve, as well as a Swedish name day, celebrating all people named Anna. (Sweden and Finland)\n*Armed Forces Day (Peru) \n*Christian feast day:\n**Feast of the Conception of the Most Holy Theotokos by St. Anne (Orthodox Church)\n**Juan Diego\n**Leocadia\n**Nectarius of Auvergne\n**Peter Fourier\n**December 9 (Eastern Orthodox liturgics)\n*Fatherland's Heroes Day (Russia)\n*Independence Day, celebrates the independence of Tanganyika from Britain in 1961. (Tanzania)\n*International Anti-Corruption Day (United Nations) \n*National Heroes Day, formerly V.C. Bird Day. (Antigua and Barbuda)\n*Navy Day (Sri Lanka)\n*Yuri's Day in the Autumn (Russian Orthodox Church). December 9. http://en.wikipedia.org/?curid=8589."
  }
}
