{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14802",
  "eid" : "17e1cb10-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778549313,
  "textBody" : "Iconology is a method of interpretation in cultural history and the history of art used by Aby Warburg, Erwin Panofsky and their followers that uncovers the cultural, social, and historical background of themes and subjects in the visual arts.Roelof van Straten, An Introduction to Iconography: Symbols, Allusions and Meaning in the Visual Arts. Abingdon and New York 1994, p.12. It is derived from synthesis rather than scattered analysis and examines symbolic meaning on more than its face value by reconciling it with its historical context and with the artist's body of work[http://www.biddingtons.com/content/pedigreeicon.html Iconography and Iconology] – in contrast to the widely descriptive iconography, which, as described by Panofsky, is an approach to studying the content and meaning of works of art that is primarily focused on classifying, establishing dates, provenance and other necessary fundamental knowledge concerning the subject matter of an artwork that is needed for further interpretation.Victor Ljunggren Szepessy, \"Panofsky - Iconology and Iconography\". In The Marriage Maker: The Pergamon Hermaphrodite as the God Hermaphroditos, Divine Ideal and Erotic Object. MA thesis, University of Oslo 2014, p.16.\n\nThough Panofsky strongly differentiated between iconology and iconography, the distinction is not very widely followed, \"and they have never been given definitions accepted by all iconographers and iconologists\".[http://www.oxfordbibliographies.com/view/document/obo-9780195399301/obo-9780195399301-0161.xml Oxford Bibliographies: Paul Taylor, \"Iconology and Iconography\"]  Few 21st-century authors continue to use the term consistently.\n\nIt should also be noted that Panofsky's \"use of iconology as the principle tool of art analysis brought him critics.\" For instance, in 1946, Jan Gerrit Van Gelder \"criticized Panofsky's iconology as putting too much emphasis on the symbolic content of the work of art, neglecting its formal aspects and the work as a unity of form and content.\"[https://dictionaryofarthistorians.org/panofskye.htm Dictionary of Art Historians: Panofsky, Erwin] Furthermore, iconology is mostly avoided by social historians who do not accept the theoretical dogmaticism in the work of Panofsky.Klaus von Beyme, \"Why is there no Political Science of the Arts?\" In Udo J. Hebel and Christoph Wagner, eds., Pictorial Cultures and Political Iconographies: Approaches, Perspectives, Case Studies from Europe and America. Berlin and New York 2011, p.16.\n\nIconology in contrast to iconography\n\nErwin Panofsky defines iconography as \"a known principle in the known world\", \nwhile iconology is \"an iconography turned interpretive\".Andrew Tudor, Image and Influence: Studies in the Sociology of Film. New York 1974, p.115. According to his view, iconology tries to reveal the underlying principles that form the basic attitude of a nation, a period, a class, a religious or philosophical perspective, which is modulated by one personality and condensed into one work.[http://tems.umn.edu/pdf/Panofsky_iconology2.pdf Erwin Panofsky, Studies in Iconology: Humanistic Themes in the Art of the Renaissance. Oxford 1939.] According to Roelof van Straten, iconology \"can explain why an artist or patron chose a particular subject at a specific location and time and represented it in a certain way. An iconological investigation should concentrate on the social-historical, not art-historical, influences and values that the artist might not have consciously brought into play but are nevertheless present. The artwork is primarily seen as a document of its time.\"Roelof van Straten, An Introduction to Iconography: Symbols, Allusions and Meaning in the Visual Arts. Abingdon and New York 1994, p. 12.\n\nWarburg used the term \"iconography\" in his early research, replacing it in 1908 with \"iconology\" in his particular method of visual interpretation called \"critical iconology\", which focused on the tracing of motifs through different cultures and visual forms.Michael Hatt and Charlotte Klonk, \"Iconography - iconology: Erwin Panofsky\". In Art History: A Critical Introduction to Its Methods. Manchester University Press, 2006, p. 98. In 1932, Panofsky published a seminal article, introducing a three-step method of visual interpretation dealing with (1) primary or natural subject matter; (2) secondary or conventional subject matter, i.e. iconography; (3) tertiary or intrinsic meaning or content, i.e. iconology.Erwin Panofsky, \"Zum Problem der Beschreibung und Inhaltsdeutung von Werken der bildenden Kunst.\" Logos, Vol. 21 (1932), pp. 103-119.[http://tems.umn.edu/pdf/Panofsky_iconology2.pdf Erwin Panofsky, Studies in Iconology: Humanistic Themes in the Art of the Renaissance. Oxford 1939.] Whereas iconography analyses the world of images, stories and allegories and requires knowledge of literary sources, an understanding of the history of types and how themes and concepts were expressed by objects and events under different historical conditions, iconology interprets intrinsic meaning or content and the world of symbolical values by using \"synthetic intuition\". The interpreter is aware of the essential tendencies of the human mind as conditioned by psychology and world view; he analyses the history of cultural symptoms or symbols, or how tendencies of the human mind were expressed by specific themes due to different historical conditions. Moreover, when understanding the work of art as a document of a specific civilization, or of a certain religious attitude therein, the work of art becomes a symptom of something else, which expresses itself in a variety of other symptoms. Interpreting these symbolical values, which can be unknown to, or different from, the artist's intention, is the object of iconology.Victor Ljunggren Szepessy, \"Panofsky - Iconology and Iconography\". In The Marriage Maker: The Pergamon Hermaphrodite as the God Hermaphroditos, Divine Ideal and Erotic Object. MA thesis, University of Oslo 2014, pp.13, 16. Panofsky emphasized that \"iconology can be done when there are no originals to look at and nothing but artificial light to work in.\"Michael Ann Holly, Panofsky and the Foundations of Art History. Ithaca and London: Cornell University Press, 1984, p.14.\n\nAccording to Ernst Gombrich, \"the emerging discipline of iconology [...] must ultimately do for the image what linguistics has done for the word.\"E.H. Gombrich, Reflections on the History of Art: Views and Reviews, ed. Richard Woodfield. Oxford 1987, p.246. However, Michael Camille is of the opinion that \"though Panofsky's concept of iconology has been very influential in the humanities and is quite effective when applied to Renaissance art, it is still problematic when applied to art from periods before and after.\"[http://art.arizona.edu/downloads/Garcia,_Dominique_Writing_Sample.pdf Dominique E. Garcia, \"Nationalistic Iconography and 'Anti-Iconology' of the Aztec Coatlicue Sculpture\"]\n\nNuances of iconology\n\nIn 1952, Creighton Gilbert added another opinion about the meaning of the word \"iconology\". According to his view, iconology was not the actual investigation of the work of art but rather the result of this investigation. The Austrian art historian Hans Sedlmayr differentiated between \"sachliche\" and \"methodische\" iconology. \"Sachliche\" iconology refers to the \"general meaning of an individual painting or of an artistic complex (church, palace, monument) as seen and explained with reference to the ideas which take shape in them.\" In contrast, \"methodische\" iconology is the \"integral iconography which accounts for the changes and development in the representations\".[http://www.encyclopedia.com/article-1G2-3407705539/iconology-and-iconography.html Encyclopedia.com: Iconology and Iconography] In Iconology: Images, Text, Ideology (1986), W.J.T. Mitchell writes that iconology is a study of \"what to say about images\", concerned with the description and interpretation of visual art, and also a study of \"what images say\" – the ways in which they seem to speak for themselves by persuading, telling stories, or describing.[http://iconictheory.blogspot.de/2010/05/iconology.html Karen Hope, The Iconic Image: Iconology] He pleads for a postlinguistic, postsemiotic \"iconic turn\", emphasizing the role of \"non-linguistic symbol systems\".W.J.T. Mitchell, Iconology: Images, Text, Ideology. University of Chicago Press, 1986.[http://d-sites.net/english/mitchell.htm w.j.t. mitchell and the image (review)]W.J.T. Mitchell, \"Iconology and Ideology: Panofsky, Althusser, and the Scene of Recognition\". In David B. Downing and Susan Bazargan, eds., Image and Ideology in Modern/Postmodern Discourse. New York 1991, pp.321-329. Instead of just pointing out the difference between the material (pictorial or artistic) images, \"he pays attention to the dialectic relationship between material images and mental images\".[https://ksangmin.wordpress.com/2009/11/19/w-j-t-mitchell-iconology-and-picture-theory/ W. J. T. Mitchell's Iconology and Picture Theory] According to Dennise Bartelo and Robert Morton, the term \"iconology\" can also be used for characterizing \"a movement toward seeing connections across all the language processes\" and the idea about \"multiple levels and forms used to communicate meaning\" in order to get \"the total picture” of learning. \"Being both literate in the traditional sense and visually literate are the true mark of a well-educated human.\"[http://wac.colostate.edu/journal/vol8/bartelo_morton.pdf Dennise Bartelo and Robert Morton, \"Iconology: An Alternate Form of Writing\"]\n\nFor several years, new approaches to iconology have developed in the theory of images. This is the case of what Jean-Michel Durafour, French philosopher and theorist of cinema, proposed to call \"econology\", a biological approach to images as forms of life, crossing iconology, ecology and sciences of nature. In an econological regime, the image (eikon) self-speciates, that is to say, it self-iconicizes with others and eco-iconicizes with them its iconic habitat (oikos). The iconology, mainly Warburghian iconology, is thus merged with a conception of the relations between the beings of the nature inherited, among others (Arne Næss, etc.) from the writings of Kinji Imanishi. For Imanishi, living beings are subjects. Or, more precisely, the environment and the living being are juste one. One of the main consequences is that the \"specity\", the living individual, \"self-eco-speciates its place of life\" (Freedom in Evolution). As far as the images are concerned: \"If the living species self-specify, the images self-iconicize. This is not a tautology. The images update some of their iconic virtualities. They live in the midst of other images, past or present, but also future (those are only human classifications), which they have relations with. They self-iconicize in an iconic environment which they interact with, and which in particular makes them the images they are. Or more precisely, insofar as images have an active part: the images self-eco-iconicize their iconic environment.Jean-Michel Durafour, \"L'Étrange Créature du lac noir\" de Jack Arnold. Aubades pour une zoologie des images, Aix-en-Provence, Rouge profond, 2017, 200 p. (), p. 13\"\n\nStudies in iconology\n\nStudies in Iconology is the title of a book by Erwin Panofsky on humanistic themes in the art of the Renaissance, which was first published in 1939.[http://tems.umn.edu/pdf/Panofsky_iconology2.pdf Erwin Panofsky, Studies in Iconology: Humanistic Themes in the Art of the Renaissance. Oxford 1939.] It is also the name of a peer-reviewed series of books started in 2014 under the editorship of Barbara Baert and published by Peeters international academic publishers, Leuven, Belgium, addressing the deeper meaning of the visual medium throughout human history in the fields of philosophy, art history, theology and cultural anthropology.[http://www.peeters-leuven.be/search_serie_book.asp?nr=284 Peeters Publishers: Studies in Iconology]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Iconology" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14802" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Iconology is a method of interpretation in cultural history and the history of art used by Aby Warburg, Erwin Panofsky and their followers that uncovers the cultural, social, and historical background of themes and subjects in the visual arts.Roelof van Straten, An Introduction to Iconography: Symbols, Allusions and Meaning in the Visual Arts. Abingdon and New York 1994, p.12. It is derived from synthesis rather than scattered analysis and examines symbolic meaning on more than its face value by reconciling it with its historical context and with the artist's body of work[http://www.biddingtons.com/content/pedigreeicon.html Iconography and Iconology] – in contrast to the widely descriptive iconography, which, as described by Panofsky, is an approach to studying the content and meaning of works of art that is primarily focused on classifying, establishing dates, provenance and other necessary fundamental knowledge concerning the subject matter of an artwork that is needed for further interpretation.Victor Ljunggren Szepessy, \"Panofsky - Iconology and Iconography\". In The Marriage Maker: The Pergamon Hermaphrodite as the God Hermaphroditos, Divine Ideal and Erotic Object. MA thesis, University of Oslo 2014, p.16.\n\nThough Panofsky strongly differentiated between iconology and iconography, the distinction is not very widely followed, \"and they have never been given definitions accepted by all iconographers and iconologists\".[http://www.oxfordbibliographies.com/view/document/obo-9780195399301/obo-9780195399301-0161.xml Oxford Bibliographies: Paul Taylor, \"Iconology and Iconography\"]  Few 21st-century authors continue to use the term consistently.\n\nIt should also be noted that Panofsky's \"use of iconology as the principle tool of art analysis brought him critics.\" For instance, in 1946, Jan Gerrit Van Gelder \"criticized Panofsky's iconology as putting too much emphasis on the symbolic content of the work of art, neglecting its formal aspects and the work as a unity of form and content.\"[https://dictionaryofarthistorians.org/panofskye.htm Dictionary of Art Historians: Panofsky, Erwin] Furthermore, iconology is mostly avoided by social historians who do not accept the theoretical dogmaticism in the work of Panofsky.Klaus von Beyme, \"Why is there no Political Science of the Arts?\" In Udo J. Hebel and Christoph Wagner, eds., Pictorial Cultures and Political Iconographies: Approaches, Perspectives, Case Studies from Europe and America. Berlin and New York 2011, p.16.\n\nIconology in contrast to iconography\n\nErwin Panofsky defines iconography as \"a known principle in the known world\", \nwhile iconology is \"an iconography turned interpretive\".Andrew Tudor, Image and Influence: Studies in the Sociology of Film. New York 1974, p.115. According to his view, iconology tries to reveal the underlying principles that form the basic attitude of a nation, a period, a class, a religious or philosophical perspective, which is modulated by one personality and condensed into one work.[http://tems.umn.edu/pdf/Panofsky_iconology2.pdf Erwin Panofsky, Studies in Iconology: Humanistic Themes in the Art of the Renaissance. Oxford 1939.] According to Roelof van Straten, iconology \"can explain why an artist or patron chose a particular subject at a specific location and time and represented it in a certain way. An iconological investigation should concentrate on the social-historical, not art-historical, influences and values that the artist might not have consciously brought into play but are nevertheless present. The artwork is primarily seen as a document of its time.\"Roelof van Straten, An Introduction to Iconography: Symbols, Allusions and Meaning in the Visual Arts. Abingdon and New York 1994, p. 12.\n\nWarburg used the term \"iconography\" in his early research, replacing it in 1908 with \"iconology\" in his particular method of visual interpretation called \"critical iconology\", which focused on the tracing of motifs through different cultures and visual forms.Michael Hatt and Charlotte Klonk, \"Iconography - iconology: Erwin Panofsky\". In Art History: A Critical Introduction to Its Methods. Manchester University Press, 2006, p. 98. In 1932, Panofsky published a seminal article, introducing a three-step method of visual interpretation dealing with (1) primary or natural subject matter; (2) secondary or conventional subject matter, i.e. iconography; (3) tertiary or intrinsic meaning or content, i.e. iconology.Erwin Panofsky, \"Zum Problem der Beschreibung und Inhaltsdeutung von Werken der bildenden Kunst.\" Logos, Vol. 21 (1932), pp. 103-119.[http://tems.umn.edu/pdf/Panofsky_iconology2.pdf Erwin Panofsky, Studies in Iconology: Humanistic Themes in the Art of the Renaissance. Oxford 1939.] Whereas iconography analyses the world of images, stories and allegories and requires knowledge of literary sources, an understanding of the history of types and how themes and concepts were expressed by objects and events under different historical conditions, iconology interprets intrinsic meaning or content and the world of symbolical values by using \"synthetic intuition\". The interpreter is aware of the essential tendencies of the human mind as conditioned by psychology and world view; he analyses the history of cultural symptoms or symbols, or how tendencies of the human mind were expressed by specific themes due to different historical conditions. Moreover, when understanding the work of art as a document of a specific civilization, or of a certain religious attitude therein, the work of art becomes a symptom of something else, which expresses itself in a variety of other symptoms. Interpreting these symbolical values, which can be unknown to, or different from, the artist's intention, is the object of iconology.Victor Ljunggren Szepessy, \"Panofsky - Iconology and Iconography\". In The Marriage Maker: The Pergamon Hermaphrodite as the God Hermaphroditos, Divine Ideal and Erotic Object. MA thesis, University of Oslo 2014, pp.13, 16. Panofsky emphasized that \"iconology can be done when there are no originals to look at and nothing but artificial light to work in.\"Michael Ann Holly, Panofsky and the Foundations of Art History. Ithaca and London: Cornell University Press, 1984, p.14.\n\nAccording to Ernst Gombrich, \"the emerging discipline of iconology [...] must ultimately do for the image what linguistics has done for the word.\"E.H. Gombrich, Reflections on the History of Art: Views and Reviews, ed. Richard Woodfield. Oxford 1987, p.246. However, Michael Camille is of the opinion that \"though Panofsky's concept of iconology has been very influential in the humanities and is quite effective when applied to Renaissance art, it is still problematic when applied to art from periods before and after.\"[http://art.arizona.edu/downloads/Garcia,_Dominique_Writing_Sample.pdf Dominique E. Garcia, \"Nationalistic Iconography and 'Anti-Iconology' of the Aztec Coatlicue Sculpture\"]\n\nNuances of iconology\n\nIn 1952, Creighton Gilbert added another opinion about the meaning of the word \"iconology\". According to his view, iconology was not the actual investigation of the work of art but rather the result of this investigation. The Austrian art historian Hans Sedlmayr differentiated between \"sachliche\" and \"methodische\" iconology. \"Sachliche\" iconology refers to the \"general meaning of an individual painting or of an artistic complex (church, palace, monument) as seen and explained with reference to the ideas which take shape in them.\" In contrast, \"methodische\" iconology is the \"integral iconography which accounts for the changes and development in the representations\".[http://www.encyclopedia.com/article-1G2-3407705539/iconology-and-iconography.html Encyclopedia.com: Iconology and Iconography] In Iconology: Images, Text, Ideology (1986), W.J.T. Mitchell writes that iconology is a study of \"what to say about images\", concerned with the description and interpretation of visual art, and also a study of \"what images say\" – the ways in which they seem to speak for themselves by persuading, telling stories, or describing.[http://iconictheory.blogspot.de/2010/05/iconology.html Karen Hope, The Iconic Image: Iconology] He pleads for a postlinguistic, postsemiotic \"iconic turn\", emphasizing the role of \"non-linguistic symbol systems\".W.J.T. Mitchell, Iconology: Images, Text, Ideology. University of Chicago Press, 1986.[http://d-sites.net/english/mitchell.htm w.j.t. mitchell and the image (review)]W.J.T. Mitchell, \"Iconology and Ideology: Panofsky, Althusser, and the Scene of Recognition\". In David B. Downing and Susan Bazargan, eds., Image and Ideology in Modern/Postmodern Discourse. New York 1991, pp.321-329. Instead of just pointing out the difference between the material (pictorial or artistic) images, \"he pays attention to the dialectic relationship between material images and mental images\".[https://ksangmin.wordpress.com/2009/11/19/w-j-t-mitchell-iconology-and-picture-theory/ W. J. T. Mitchell's Iconology and Picture Theory] According to Dennise Bartelo and Robert Morton, the term \"iconology\" can also be used for characterizing \"a movement toward seeing connections across all the language processes\" and the idea about \"multiple levels and forms used to communicate meaning\" in order to get \"the total picture” of learning. \"Being both literate in the traditional sense and visually literate are the true mark of a well-educated human.\"[http://wac.colostate.edu/journal/vol8/bartelo_morton.pdf Dennise Bartelo and Robert Morton, \"Iconology: An Alternate Form of Writing\"]\n\nFor several years, new approaches to iconology have developed in the theory of images. This is the case of what Jean-Michel Durafour, French philosopher and theorist of cinema, proposed to call \"econology\", a biological approach to images as forms of life, crossing iconology, ecology and sciences of nature. In an econological regime, the image (eikon) self-speciates, that is to say, it self-iconicizes with others and eco-iconicizes with them its iconic habitat (oikos). The iconology, mainly Warburghian iconology, is thus merged with a conception of the relations between the beings of the nature inherited, among others (Arne Næss, etc.) from the writings of Kinji Imanishi. For Imanishi, living beings are subjects. Or, more precisely, the environment and the living being are juste one. One of the main consequences is that the \"specity\", the living individual, \"self-eco-speciates its place of life\" (Freedom in Evolution). As far as the images are concerned: \"If the living species self-specify, the images self-iconicize. This is not a tautology. The images update some of their iconic virtualities. They live in the midst of other images, past or present, but also future (those are only human classifications), which they have relations with. They self-iconicize in an iconic environment which they interact with, and which in particular makes them the images they are. Or more precisely, insofar as images have an active part: the images self-eco-iconicize their iconic environment.Jean-Michel Durafour, \"L'Étrange Créature du lac noir\" de Jack Arnold. Aubades pour une zoologie des images, Aix-en-Provence, Rouge profond, 2017, 200 p. (), p. 13\"\n\nStudies in iconology\n\nStudies in Iconology is the title of a book by Erwin Panofsky on humanistic themes in the art of the Renaissance, which was first published in 1939.[http://tems.umn.edu/pdf/Panofsky_iconology2.pdf Erwin Panofsky, Studies in Iconology: Humanistic Themes in the Art of the Renaissance. Oxford 1939.] It is also the name of a peer-reviewed series of books started in 2014 under the editorship of Barbara Baert and published by Peeters international academic publishers, Leuven, Belgium, addressing the deeper meaning of the visual medium throughout human history in the fields of philosophy, art history, theology and cultural anthropology.[http://www.peeters-leuven.be/search_serie_book.asp?nr=284 Peeters Publishers: Studies in Iconology]. Iconology. http://en.wikipedia.org/?curid=14802."
  }
}
