{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16756",
  "eid" : "28085090-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778576409,
  "textBody" : "The Korean language () is the official and national language of both Koreas: the Democratic People's Republic of Korea (North Korea) and the Republic of Korea (South Korea), with different standardized official forms used in each territory. It is also one of the two official languages in the Yanbian Korean Autonomous Prefecture and Changbai Korean Autonomous County of the People's Republic of China. Approximately 80 million people worldwide speak Korean..\n\nHistorical and modern linguists classify Korean as a language isolate;......\nhowever, it does have a few extinct relatives, which together with Korean itself and the Jeju language (spoken in the Jeju Province and considered somewhat distinct) form the Koreanic language family. This implies that Korean is not an isolate, but a member of a small family. The idea that Korean belongs to the controversial Altaic language family is discredited in academic research. Korean is now often included in the Paleosiberian family, a group of ancient languages in Northeast Asia. The Korean language is agglutinative in its morphology and SOV in its syntax.\n\nHistory\n\nModern Korean descends from Middle Korean, which in turn descends from Old Korean, which descends from the language spoken in Prehistoric Korea (labeled Proto-Korean), whose nature is debated, in part because Korean genetic origins are controversial. A relation of Korean (together with its extinct relatives which form the Koreanic family) with Japonic languages has been proposed by linguists such as William George Aston and Samuel Martin. Roy Andrew Miller and others suggested or supported the inclusion of Koreanic and Japonic languages (because of a certain resemblance) in the purported Altaic family (a macro-family that would comprise Tungusic, Mongolian and Turkic families); the Altaic hypothesis has since been largely rejected by most linguistic specialists.\n\nChinese characters arrived in Korea together with Buddhism during the pre-Three Kingdoms period. It was adapted for Korean and became known as Hanja, and remained as the main script for writing Korean through over a millennium alongside various phonetic scripts that were later invented such as idu and gugyeol. Mainly privileged elites were educated to read and write in Hanja, however, most of the population was illiterate. In the 15th century, King Sejong the Great felt that the Hanja was not adequate to write Korean and this was the cause of its very restricted use, so (with a likely help of the Hall of Worthies) he developed an alphabetic featural writing system known today as Hangul, which was designed to either aid in reading Hanja or replace Hanja entirely. Introduced in the document Hunminjeongeum, it was called as Eonmun(colloquial script) and spread nationwide soon and increased literacy in Korea. Hangul was widely used by all the Korean classes but due to conservative aristocratic class, official documents were still written in Hanja during the Joseon era. Today, the Hanja are largely unused in everyday life due to its inconvenience, but it is still important for historic and/or linguistic studies. Both South and North Korea don't oppose learning Hanja even though they both don't use it anymore.\n\nSince the Korean War, through 70 years of separation, North–South differences have developed in standard Korean, including variations in pronunciation and vocabulary chosen, but these minor differences can be found in any of the Korean dialects and still largely mutually intelligible.\n\nNames\n\nThe Korean names for the language are based on the names for Korea used in North Korea and South Korea.\n\nIn South Korea, the Korean language is referred to by many names including hanguk-eo (\"Korean language\"), hanguk-mal (\"Korean speech\") and uri-mal (\"our language\"). In \"hanguk-eo\" and \"hanguk-mal\", the first part of the word, \"hanguk\", refers to the Korean nation while \"-eo\" and \"-mal\" mean \"language\" and \"speech\", respectively. Korean is also simply referred to as guk-eo, literally \"national language\". This name is based on the same Han characters, meaning \"nation\" + \"language\" (\"國語\"), that are also used in Taiwan and Japan to refer to their respective national languages.\n\nIn North Korea and China, the language is most often called Chosŏn-mal, or more formally, Chosŏn-ŏ. The English word \"Korean\" is derived from Goryeo, which is thought to be the first Korean dynasty known to the Western nations. Korean people in the former USSR refer to themselves as Koryo-saram and/or Koryo-in (literally, \"Koryo/Goryeo person(s)\"), and call the language Koryo-mar.\n\nIn mainland China, following the establishment of diplomatic relations with South Korea in 1992, the term Cháoxiǎnyǔ or the short form Cháoyǔ has normally been used to refer to the standard language of North Korea and Yanbian, whereas Hánguóyǔ or the short form Hányǔ is used to refer to the standard language of South Korea.\n\nSome older English sources also use the spelling \"Corea\" to refer to the nation, and its inflected form for the language, culture and people, \"Korea\" becoming more popular in the late 1800s according to Google's NGram English corpus of 2015.\n\nClassification\n\nThe majority of historical and modern linguists classify Korean as a language isolate.\n\nThere are still a small number who think that Korean might be related to the now discredited Altaic family,Miller 1971, 1996, Starostin et al. 2003 but linguists agree today that typological resemblances cannot be used to prove genetic relatedness of languages,Vovin 2008: 1 as these features are typologically connected and easily borrowed from one language to the other.Trask 1996: 147–51 Such factors of typological divergence as Middle Mongolian's exhibition of gender agreementRybatzki 2003: 57 can be used to argue that a genetic relationship with Altaic is unlikely.Vovin 2008: 5\n\nThe hypothesis that Korean might be related to Japanese has had some supporters due to some overlap in vocabulary and similar grammatical features that have been elaborated upon by such researchers as Samuel E. MartinMartin 1966, 1990 and Roy Andrew Miller.e.g. Miller 1971, 1996 Sergei Anatolyevich Starostin (1991) found about 25% of potential cognates in the Japanese–Korean 100-word Swadesh list. Some linguists concerned with the issue, for example Alexander Vovin, have argued that the indicated similarities between Japanese and Korean are not due to any genetic relationship, but rather to a sprachbund effect and heavy borrowing, especially from ancient Korean into Western Old Japanese.Vovin 2008 A good example might be Middle Korean sàm and Japanese asá, meaning \"hemp\".Whitman 1985: 232, also found in Martin 1966: 233 This word seems to be a cognate, but although it is well attested in Western Old Japanese and Northern Ryukyuan languages, in Eastern Old Japanese it only occurs in compounds, and it is only present in three dialects of the Southern Ryukyuan language group. Also, the doublet wo meaning \"hemp\" is attested in Western Old Japanese and Southern Ryukyuan languages. It is thus plausible to assume a borrowed term.Vovin 2008: 211–12 (See Classification of the Japonic languages for further details on a possible relationship.)\n\nAmong ancient languages, various closer relatives of Korean have been proposed, constituting a possible small Koreanic language family. Some classify the language of Jeju Island as a distinct modern Koreanic language.\n\nOther lesser-known disputed theory is the Dravido-Korean languages theory which suggests a southern relation. Korean and Dravidian languages share similar vocabulary, both languages are agglutinative, follow the SOV order, nominal and adjectives follow the same syntax, particles are post positional, modifiers always precede modified words are some of the common features. Comparative linguist Kang Gil-un proposes 1300 Dravidian Tamil cognates in Korean,, which would significantly outnumber the number of Dravidian cognates he claims are found in Tungusic, Turkic or Ainu. He insisted that the Korean language is based on the proto Nivkh language and was influenced by Dravidian, Ainu, Tungusic and maybe Turkic vocabulary. However, this theory is seen as controversial by contemporary mainstream linguists.The World's Major Languages edited by Bernard Comrie\n\nGeographic distribution and international spread\n\nKorean is spoken by the Korean people in North Korea and South Korea and by the Korean diaspora in many countries including the People's Republic of China, the United States, Japan, and Russia. Currently, Korean is the fourth most popular foreign language in China, following English, Japanese, and Russian.  Korean-speaking minorities exist in these states, but because of cultural assimilation into host countries, not all ethnic Koreans may speak it with native fluency.\n\nOfficial status\n\nKorean is the official language of South Korea and North Korea. It is also one of the two official languages of the Yanbian Korean Autonomous Prefecture in China.\n\nIn South Korea, the regulatory body for Korean is the Seoul-based National Institute of the Korean Language, which was created by presidential decree on January 23, 1991. In North Korea, the regulatory body is the Language Institute of the Academy of Social Sciences (, Sahoe Kwahagwon Ŏhak Yŏnguso).\n\nKing Sejong Institute\n\nEstablished pursuant to Article 9, Section 2, of the Framework Act on the National Language, the King Sejong Institute is a public institution set up to coordinate the government's project of propagating Korean language and culture; it also supports the [http://eng.ksif.or.kr/main.do King Sejong Institute], which is the institution's overseas branch. The King Sejong Institute was established in response to:\n\n* An increase in the demand for Korean language education;\n* a rapid increase in Korean language education thanks to the spread of hallyu, an increase in international marriage, the expansion of Korean enterprises into overseas markets, and enforcement of employment licensing system;\n* the need for a government-sanctioned Korean language educational institution;\n* the need for general support for overseas Korean language education based on a successful domestic language education program.\n\nTopik Korea Institute\n\nThe Topik Korea Institute is a lifelong educational center affiliated with a variety of Korean universities in Seoul, South Korea, whose aim is to promote Korean language and culture, support local Korean teaching internationally, and facilitate cultural exchanges.\n\nThe institute is sometimes compared to language and culture promotion organizations such as the King Sejong Institute. Unlike that organization, however, Topik Korea Institutes operate within established universities and colleges around the world, providing educational materials.\n\nDialects\n\nKorean has numerous small local dialects (called mal () [literally \"speech\"], saturi (), or bang'eon ( in Korean). The standard language (pyojun-eo or pyojun-mal) of both South Korea and North Korea is based on the dialect of the area around Seoul (which, as Hanyang, was the capital of Joseon-era Korea for 500 years), though the northern standard after the Korean War has been influenced by the dialect of P'yŏngyang. All dialects of Korean are similar to each other and largely mutually intelligible (with the exception of dialect-specific phrases or non-Standard vocabulary unique to dialects), though the dialect of Jeju Island is divergent enough to be sometimes classified as a separate language.David Lightfoot, 1999. The development of language: acquisition, change, and evolutionJanhunen, Juha, 1996. Manchuria: an ethnic history One of the more salient differences between dialects is the use of tone: speakers of the Seoul dialect make use of vowel length, whereas speakers of the Gyeongsang dialect maintain the pitch accent of Middle Korean. Some dialects are conservative, maintaining Middle Korean sounds (such as z, β, ə) which have been lost from the standard language, whereas others are highly innovative.\n\nThere is substantial evidence for a history of extensive dialect levelling, or even convergent evolution or intermixture of two or more originally distinct linguistic stocks, within the Korean language and its dialects. Many Korean dialects have basic vocabulary that is etymologically distinct from vocabulary of identical meaning in Standard Korean or other dialects, such as South Jeolla dialect vs. Standard Korean  \"mouth\" or Gyeongsang dialect vs. Standard Korean \"garlic chives\". This suggests that the Korean Peninsula may have at one time been much more linguistically diverse than it is at present. See also the Buyeo languages hypothesis.\n\nNonetheless, the separation of the two Korean nations has resulted in increasing differences among the dialects that have emerged over time. Since the allies of the newly founded nations split the Korean peninsula in half after 1945, the newly formed Korean nations have since borrowed vocabulary extensively from their respective allies. As the Soviet Union helped industrialize North Korea and establish it as a communist state, the North Koreans would therefore borrow a number of Russian terms. Likewise, since the United States helped South Korea extensively to develop militarily, economically, and politically, South Koreans would therefore borrow extensively from English. The differences among northern and southern dialects have become so significant that many North Korean defectors reportedly have had great difficulty communicating with South Koreans after having initially settled into South Korea. In response to the diverging vocabularies, an app called Univoca was designed to help North Korean defectors learn South Korean terms by translating them into North Korean ones. More info can be found on the page North-South differences in the Korean language.\n\nAside from the standard language, there are few clear boundaries between Korean dialects, and they are typically partially grouped according to the regions of Korea.\n\nPhonology\n\nConsonants\n\n1 The semivowels and are represented in Korean writing by modifications to vowel symbols (see below).\n\nThe IPA symbol  (a subscript double straight quotation mark, shown here with a placeholder circle) is used to denote the tensed consonants. Its official use in the Extensions to the IPA is for 'strong' articulation, but is used in the literature for faucalized voice. The Korean consonants also have elements of stiff voice, but it is not yet known how typical this is of faucalized consonants. They are produced with a partially constricted glottis and additional subglottal pressure in addition to tense vocal tract walls, laryngeal lowering, or other expansion of the larynx.\n\nVowels\n\n  is closer to a near-open central vowel, though  is still used for tradition.\n\nAllophones\n\n is aspirated and becomes an alveolo-palatal before or for most speakers (but see North–South differences in the Korean language). This occurs with the tense fricative and all the affricates as well. At the end of a syllable, changes to (example: beoseot () 'mushroom').\n\n may become a bilabial before or, a palatal before or, a velar before, a voiced between voiced sounds, and a elsewhere.\n\n become voiced between voiced sounds.\n\n frequently denasalize to at the beginnings of words.\n\n becomes alveolar flap between vowels, and or at the end of a syllable or next to another. Note that a written syllable-final , when followed by a vowel or a glide (i.e., when the next character starts with ), migrates to the next syllable and thus becomes.\n\nTraditionally, was disallowed at the beginning of a word. It disappeared before, and otherwise became. However, the inflow of western loanwords changed the trend, and now word-initial (mostly from English loanwords) are pronounced as a free variation of either or. The traditional prohibition of word-initial became a morphological rule called \"initial law\" () in South Korea, which pertains to Sino-Korean vocabulary. Such words retain their word-initial in North Korea.\n\nAll obstruents (plosives, affricates, fricatives) at the end of a word are pronounced with no audible release,.\n\nPlosive stops become nasal stops before nasal stops.\n\nHangul spelling does not reflect these assimilatory pronunciation rules, but rather maintains the underlying, partly historical morphology. Given this, it is sometimes hard to tell which actual phonemes are present in a certain word.\n\nOne difference between the pronunciation standards of North and South Korea is the treatment of initial, and initial. For example,\n* \"labor\" – north: rodong (), south: nodong ()\n* \"history\" – north: ryŏksa (), south: yeoksa ()\n* \"female\" – north: nyŏja (), south: yeoja ()\n\nMorphophonemics\n\nGrammatical morphemes may change shape depending on the preceding sounds. Examples include -eun/-neun () and -i/-ga (). Sometimes sounds may be inserted instead. Examples include -eul/-reul (), -euro/-ro (), -eseo/-seo (), -ideunji/-deunji () and -iya/-ya (). However, -euro/-ro is somewhat irregular, since it will behave differently after a rieul consonant.\n\nSome verbs may also change shape morphophonemically.\n\nGrammar\n\nKorean is an agglutinative language. The Korean language is traditionally considered to have nine parts of speech. For details, see Korean parts of speech. Modifiers generally precede the modified words, and in the case of verb modifiers, can be serially appended. The basic form of a Korean sentence is subject–object–verb, but the verb is the only required and immovable element.\n\n\"Did [you] go to the store?\" (\"you\" implied in conversation)\n\n\"Yes.\"\n\nSpeech levels and honorifics\n\nThe relationship between a speaker or writer and his or her subject and audience is paramount in Korean grammar. The relationship between speaker/writer and subject referent is reflected in honorifics, whereas that between speaker/writer and audience is reflected in speech level.\n\nHonorifics\n\nWhen talking about someone superior in status, a speaker or writer usually uses special nouns or verb endings to indicate the subject's superiority. Generally, someone is superior in status if he/she is an older relative, a stranger of roughly equal or greater age, or an employer, teacher, customer, or the like. Someone is equal or inferior in status if he/she is a younger stranger, student, employee or the like. Nowadays, there are special endings which can be used on declarative, interrogative, and imperative sentences; and both honorific or normal sentences.\n\nHonorifics in traditional Korea were strictly hierarchical. The caste and estate systems possessed patterns and usages much more complex and stratified than those used today. The intricate structure of the Korean honorific system flourished in traditional culture and society. Honorifics in contemporary Korea are now used for people who are psychologically distant. Honorifics are also used for people who are superior in status. For example, older relatives, people who are older, teachers, and employers.\n\nSpeech levels\n\nThere are seven verb paradigms or speech levels in Korean, and each level has its own unique set of verb endings which are used to indicate the level of formality of a situation. Unlike honorifics—which are used to show respect towards the referent (the person spoken of) —speech levels are used to show respect towards a speaker's or writer's audience (the person spoken to). The names of the seven levels are derived from the non-honorific imperative form of the verb  (hada, \"do\") in each level, plus the suffix  (\"che\", Hanja: ), which means \"style\".\n\nThe highest six levels are generally grouped together as jondaenmal (), whereas the lowest level (haeche, ) is called banmal () in Korean.\n\nNowadays, younger-generation speakers no longer feel obligated to lower their usual regard toward the referent. It is common to see younger people talk to their older relatives with banmal (). This is not out of disrespect, but instead it shows the intimacy and the closeness of the relationship between the two speakers. Transformations in social structures and attitudes in today's rapidly changing society have brought about change in the way people speak.\n\nGender\n\nIn general, Korean lacks grammatical gender.  As one of the few exceptions, the third-person singular pronoun has two different forms: 그 geu (male) and 그녀 geunyeo (female).  However, the terms were invented in the 20th century, under the influence of foreign languages, and they seldom appear in colloquial speech.\n\nHowever, one can still find stronger contrasts between the sexes within Korean speech. Some examples of this can be seen in: (1) softer tone used by women in speech; (2) a married woman introducing herself as someone’s mother or wife, not with her own name; (3) the presence of gender differences in titles and occupational terms (for example, a sajang is a company president and yŏsajang is a female company president.); (4) females sometimes using more tag questions and rising tones in statements, also seen in speech from children.Cho, Young A. Gender Differences in Korean Speech. Korean Language in Culture and Society. Ed. Ho-min Sohn. University of Hawaii Press, 2006. pp. 189–98.\n\nIn Western societies, individuals tend to avoid expressions of power asymmetry, mutually addressing each other by their first names for the sake of solidarity . Between two people of asymmetrical status in a Korean society, people tend to emphasize differences in status for the sake of solidarity. Koreans prefer to use kinship terms, rather than any other terms of reference.Kim, Minju. “Cross Adoption of language between different genders: The case of the Korean kinship terms hyeng and enni.” Proceedings of the Fifth Berkeley Women and Language Conference. Berkeley: Berkeley Women and Language Group. 1999. In traditional Korean society, women have long been in disadvantaged positions. Korean social structure traditionally was a patriarchically dominated family system that emphasized the maintenance of family lines. This structure has tended to separate the roles of women from those of men.Palley, Marian Lief. “Women’s Status in South Korea: Tradition and Change.” Asian Survey, Vol 30 No. 12. December 1990. pp. 1136–53.\n\nVocabulary\n\nThe core of the Korean vocabulary is made up of native Korean words. A significant proportion of the vocabulary, especially words that denote abstract ideas, are Sino-Korean words,Sohn, Ho-Min. The Korean Language (Section 1.5.3 \"Korean vocabulary\", pp. 12–13), Cambridge University Press, 2001. . either\n* directly borrowed from written Chinese, or\n* coined in Korea or Japan using Chinese characters,\n\nThe exact proportion of Sino-Korean vocabulary is a matter of debate. Sohn (2001) stated 50–60%. Later, the same author (2006, p. 5) gives an even higher estimate of 65%. Jeong Jae-do, one of the compilers of the dictionary Urimal Keun Sajeon, asserts that the proportion is not so high. He points out that Korean dictionaries compiled during the colonial period include many unused Sino-Korean words. In his estimation, the proportion of native Korean vocabulary in the Korean language might be as high as 70%.. The dictionary mentioned is \n\nKorean has two numeral systems: one native, and one borrowed from Sino-Korean.\n\nTo a much lesser extent, some words have also been borrowed from Mongolian and other languages. Conversely, the Korean language itself has also contributed some loanwords to other languages, most notably the Tsushima dialect of Japanese.\n\nThe vast majority of loanwords other than Sino-Korean come from modern times, approximately 90% of which are from English. Many words have also been borrowed from Western languages such as German via Japanese ( (areubaiteu) \"part-time job\",  (allereugi) \"allergy\",  (gibseu or gibuseu) \"plaster cast used for broken bones\"). Some Western words were borrowed indirectly via Japanese during the Japanese occupation of Korea, taking a Japanese sound pattern, for example \"dozen\" >  dāsu >  daseu. Most indirect Western borrowings are now written according to current \"Hangulization\" rules for the respective Western language, as if borrowed directly. There are a few more complicated borrowings such as \"German(y)\" (see names of Germany), the first part of whose endonym Deutschland the Japanese approximated using the kanji   doitsu that were then accepted into the Korean language by their Sino-Korean pronunciation:  dok +  il \n Dogil. In South Korean official use, a number of other Sino-Korean country names have been replaced with phonetically oriented \"Hangeulizations\" of the countries' endonyms or English names.\n\nBecause of such a prevalence of English in modern Korean culture and society, lexical borrowing is inevitable. English-derived Korean, or 'Konglish' (), is increasingly used. The vocabulary of the Korean language is roughly 5% loanwords (excluding Sino-Korean vocabulary).\n\nKorean uses words adapted from English in ways that may seem strange to native English speakers. For example, in soccer heading () is used as a noun meaning a 'header', whereas fighting () is a term of encouragement like 'come on'/'go (on)' in English. Something that is 'service' () is free or 'on the house'. A building referred to as an 'apart-uh' () is an 'apartment' (but in fact refers to a residence more akin to a condominium) and a type of pencil that is called a 'sharp' () is a mechanical pencil. Like other borrowings, many of these idiosyncrasies, including all the examples listed above, appear to be imported into Korean via Japanese, or influenced by Japanese.\n\nNorth Korean vocabulary shows a tendency to prefer native Korean over Sino-Korean or foreign borrowings, especially with recent political objectives aimed at eliminating foreign influences on the Korean language in the North. In the early years, the North Korean government tried to eliminate Sino-Korean words. Consequently, South Korean may have several Sino-Korean or foreign borrowings which are not in North Korean.\n\nWriting system\n\nBefore the creation of Hangul, people in Korea (known as Joseon at the time) primarily wrote using Classical Chinese alongside native phonetic writing systems that predate Hangul by hundreds of years, including idu, hyangchal, gugyeol, and gakpil. However, due to the fundamental differences between the Korean and Chinese languages, and the large number of characters needed to be learned, there was much difficulty in learning how to write using Chinese characters for the lower classes, who often didn't have the privilege of education. To assuage this problem, King Sejong () created the unique alphabet known as Hangul to promote literacy among the common people.\n\nHangul was denounced and looked down upon by the yangban aristocracy who deemed it too easy to learn, but it gained widespread use among the common class, and was widely used to print popular novels which were enjoyed by the common class. With growing Korean nationalism in the 19th century, the Gabo Reformists' push, and the promotion of Hangul in schools, in 1894, Hangul displaced Hanja as Korea's national script. Hanja are still used to a certain extent in South Korea where they are sometimes combined with Hangul, but this method is slowly declining in use despite students learning Hanja in school.\n\nBelow is a chart of the Korean alphabet's symbols and their canonical IPA values:\n\nThe letters of Hangul are not written linearly like most alphabets, but instead arranged into blocks that represent a syllable. So, while the word bibimbap is written as eight characters in a row in English, in Korean it is written 비빔밥, as three syllable blocks in a row. The syllable blocks are then written left to right, top to bottom.\n\nModern Korean is written with spaces between words, a feature not found in Chinese or Japanese (except when writing exclusive in hiragana, as in children's books). Korean punctuation marks are almost identical to Western ones. Traditionally, Korean was written in columns, from top to bottom, right to left, but is now usually written in rows, from left to right, top to bottom.\n\nDifferences between North Korean and South Korean\n\nThe Korean language used in the North and the South exhibits differences in pronunciation, spelling, grammar and vocabulary.Kanno, Hiroomi (ed.) / Society for Korean Linguistics in Japan (1987). Chōsengo o manabō (), Sanshūsha, Tokyo. \n\nPronunciation\n\nIn North Korea, palatalization of is optional, and can be pronounced between vowels.\n\nWords that are written the same way may be pronounced differently, such as the examples below. The pronunciations below are given in Revised Romanization, McCune–Reischauer and Hangul, the last of which represents what the Hangul would be if one were to write the word as pronounced.\n\n* Similar pronunciation is used in the North whenever the hanja \"\" is attached to a Sino-Korean word ending in ,  or . (In the South, this rule only applies when it is attached to any single-character Sino-Korean word.)\n\nSpelling\n\nSome words are spelled differently by the North and the South, but the pronunciations are the same.\n\nSpelling and pronunciation\n\nSome words have different spellings and pronunciations in the North and the South. Most of the official languages of North Korea are from the northwest (Pyeongan dialect), and the standard language of South Korea is the standard language (Seoul language close to Gyeonggi- dialect). some of which were given in the \"Phonology\" section above:\n\nIn general, when transcribing place names, North Korea tends to use the pronunciation in the original language more than South Korea, which often uses the pronunciation in English. For example:\n\nGrammar\n\nSome grammatical constructions are also different:\n\nVocabulary\n\nSome vocabulary is different between the North and the South:\n\nPunctuation\n\nIn the North, guillemets  and  are the symbols used for quotes; in the South, quotation marks equivalent to the English ones,  and , are standard, although  and  are also used.\n\nStudy by non-native learners\n\nFor native English speakers, Korean is generally considered to be one of the most difficult languages to master despite the relative ease of learning Hangul. For instance, the United States' Defense Language Institute places Korean in Category IV, which also includes Japanese, Chinese (e.g. Mandarin, Cantonese & Shanghainese) and Arabic. This means that 63 weeks of instruction (as compared to just 25 weeks for Italian, French, Portuguese and Spanish) are required to bring an English-speaking student to a limited working level of proficiency in which he or she has \"sufficient capability to meet routine social demands and limited job requirements\" and \"can deal with concrete topics in past, present, and future tense.\" Similarly, the Foreign Service Institute's School of Language Studies places Korean in Category IV, the highest level of difficulty.\n\nThe study of the Korean language in the United States is dominated by Korean American heritage language students; in 2007 they were estimated to form over 80% of all students of the language at non-military universities. However, Sejong Institutes in the United States have noted a sharp rise in the number of people of other ethnic backgrounds studying Korean between 2009 and 2011; they attribute this to rising popularity of South Korean music and television shows.\n\nThere are two widely used tests of Korean as a foreign language: the Korean Language Proficiency Test (KLPT) and the Test of Proficiency in Korean (TOPIK). The Korean Language Proficiency Test, an examination aimed at assessing non-native speakers' competence in Korean, was instituted in 1997; 17,000 people applied for the 2005 sitting of the examination. The TOPIK was first administered in 1997 and was taken by 2,274 people. Since then the total number of people who have taken the TOPIK has surpassed 1 million, with more than 150,000 candidates taking the test in 2012. TOPIK is administered in 45 regions within South Korea and 72 nations outside of South Korea, with a significant portion being administered in Japan and North America, which would suggest the targeted audience for TOPIK is still primarily foreigners of Korean heritage. This is also evident in TOPIK's website, where the examination is introduced as intended for Korean heritage students.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Korean language" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16756" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Korean language () is the official and national language of both Koreas: the Democratic People's Republic of Korea (North Korea) and the Republic of Korea (South Korea), with different standardized official forms used in each territory. It is also one of the two official languages in the Yanbian Korean Autonomous Prefecture and Changbai Korean Autonomous County of the People's Republic of China. Approximately 80 million people worldwide speak Korean..\n\nHistorical and modern linguists classify Korean as a language isolate;......\nhowever, it does have a few extinct relatives, which together with Korean itself and the Jeju language (spoken in the Jeju Province and considered somewhat distinct) form the Koreanic language family. This implies that Korean is not an isolate, but a member of a small family. The idea that Korean belongs to the controversial Altaic language family is discredited in academic research. Korean is now often included in the Paleosiberian family, a group of ancient languages in Northeast Asia. The Korean language is agglutinative in its morphology and SOV in its syntax.\n\nHistory\n\nModern Korean descends from Middle Korean, which in turn descends from Old Korean, which descends from the language spoken in Prehistoric Korea (labeled Proto-Korean), whose nature is debated, in part because Korean genetic origins are controversial. A relation of Korean (together with its extinct relatives which form the Koreanic family) with Japonic languages has been proposed by linguists such as William George Aston and Samuel Martin. Roy Andrew Miller and others suggested or supported the inclusion of Koreanic and Japonic languages (because of a certain resemblance) in the purported Altaic family (a macro-family that would comprise Tungusic, Mongolian and Turkic families); the Altaic hypothesis has since been largely rejected by most linguistic specialists.\n\nChinese characters arrived in Korea together with Buddhism during the pre-Three Kingdoms period. It was adapted for Korean and became known as Hanja, and remained as the main script for writing Korean through over a millennium alongside various phonetic scripts that were later invented such as idu and gugyeol. Mainly privileged elites were educated to read and write in Hanja, however, most of the population was illiterate. In the 15th century, King Sejong the Great felt that the Hanja was not adequate to write Korean and this was the cause of its very restricted use, so (with a likely help of the Hall of Worthies) he developed an alphabetic featural writing system known today as Hangul, which was designed to either aid in reading Hanja or replace Hanja entirely. Introduced in the document Hunminjeongeum, it was called as Eonmun(colloquial script) and spread nationwide soon and increased literacy in Korea. Hangul was widely used by all the Korean classes but due to conservative aristocratic class, official documents were still written in Hanja during the Joseon era. Today, the Hanja are largely unused in everyday life due to its inconvenience, but it is still important for historic and/or linguistic studies. Both South and North Korea don't oppose learning Hanja even though they both don't use it anymore.\n\nSince the Korean War, through 70 years of separation, North–South differences have developed in standard Korean, including variations in pronunciation and vocabulary chosen, but these minor differences can be found in any of the Korean dialects and still largely mutually intelligible.\n\nNames\n\nThe Korean names for the language are based on the names for Korea used in North Korea and South Korea.\n\nIn South Korea, the Korean language is referred to by many names including hanguk-eo (\"Korean language\"), hanguk-mal (\"Korean speech\") and uri-mal (\"our language\"). In \"hanguk-eo\" and \"hanguk-mal\", the first part of the word, \"hanguk\", refers to the Korean nation while \"-eo\" and \"-mal\" mean \"language\" and \"speech\", respectively. Korean is also simply referred to as guk-eo, literally \"national language\". This name is based on the same Han characters, meaning \"nation\" + \"language\" (\"國語\"), that are also used in Taiwan and Japan to refer to their respective national languages.\n\nIn North Korea and China, the language is most often called Chosŏn-mal, or more formally, Chosŏn-ŏ. The English word \"Korean\" is derived from Goryeo, which is thought to be the first Korean dynasty known to the Western nations. Korean people in the former USSR refer to themselves as Koryo-saram and/or Koryo-in (literally, \"Koryo/Goryeo person(s)\"), and call the language Koryo-mar.\n\nIn mainland China, following the establishment of diplomatic relations with South Korea in 1992, the term Cháoxiǎnyǔ or the short form Cháoyǔ has normally been used to refer to the standard language of North Korea and Yanbian, whereas Hánguóyǔ or the short form Hányǔ is used to refer to the standard language of South Korea.\n\nSome older English sources also use the spelling \"Corea\" to refer to the nation, and its inflected form for the language, culture and people, \"Korea\" becoming more popular in the late 1800s according to Google's NGram English corpus of 2015.\n\nClassification\n\nThe majority of historical and modern linguists classify Korean as a language isolate.\n\nThere are still a small number who think that Korean might be related to the now discredited Altaic family,Miller 1971, 1996, Starostin et al. 2003 but linguists agree today that typological resemblances cannot be used to prove genetic relatedness of languages,Vovin 2008: 1 as these features are typologically connected and easily borrowed from one language to the other.Trask 1996: 147–51 Such factors of typological divergence as Middle Mongolian's exhibition of gender agreementRybatzki 2003: 57 can be used to argue that a genetic relationship with Altaic is unlikely.Vovin 2008: 5\n\nThe hypothesis that Korean might be related to Japanese has had some supporters due to some overlap in vocabulary and similar grammatical features that have been elaborated upon by such researchers as Samuel E. MartinMartin 1966, 1990 and Roy Andrew Miller.e.g. Miller 1971, 1996 Sergei Anatolyevich Starostin (1991) found about 25% of potential cognates in the Japanese–Korean 100-word Swadesh list. Some linguists concerned with the issue, for example Alexander Vovin, have argued that the indicated similarities between Japanese and Korean are not due to any genetic relationship, but rather to a sprachbund effect and heavy borrowing, especially from ancient Korean into Western Old Japanese.Vovin 2008 A good example might be Middle Korean sàm and Japanese asá, meaning \"hemp\".Whitman 1985: 232, also found in Martin 1966: 233 This word seems to be a cognate, but although it is well attested in Western Old Japanese and Northern Ryukyuan languages, in Eastern Old Japanese it only occurs in compounds, and it is only present in three dialects of the Southern Ryukyuan language group. Also, the doublet wo meaning \"hemp\" is attested in Western Old Japanese and Southern Ryukyuan languages. It is thus plausible to assume a borrowed term.Vovin 2008: 211–12 (See Classification of the Japonic languages for further details on a possible relationship.)\n\nAmong ancient languages, various closer relatives of Korean have been proposed, constituting a possible small Koreanic language family. Some classify the language of Jeju Island as a distinct modern Koreanic language.\n\nOther lesser-known disputed theory is the Dravido-Korean languages theory which suggests a southern relation. Korean and Dravidian languages share similar vocabulary, both languages are agglutinative, follow the SOV order, nominal and adjectives follow the same syntax, particles are post positional, modifiers always precede modified words are some of the common features. Comparative linguist Kang Gil-un proposes 1300 Dravidian Tamil cognates in Korean,, which would significantly outnumber the number of Dravidian cognates he claims are found in Tungusic, Turkic or Ainu. He insisted that the Korean language is based on the proto Nivkh language and was influenced by Dravidian, Ainu, Tungusic and maybe Turkic vocabulary. However, this theory is seen as controversial by contemporary mainstream linguists.The World's Major Languages edited by Bernard Comrie\n\nGeographic distribution and international spread\n\nKorean is spoken by the Korean people in North Korea and South Korea and by the Korean diaspora in many countries including the People's Republic of China, the United States, Japan, and Russia. Currently, Korean is the fourth most popular foreign language in China, following English, Japanese, and Russian.  Korean-speaking minorities exist in these states, but because of cultural assimilation into host countries, not all ethnic Koreans may speak it with native fluency.\n\nOfficial status\n\nKorean is the official language of South Korea and North Korea. It is also one of the two official languages of the Yanbian Korean Autonomous Prefecture in China.\n\nIn South Korea, the regulatory body for Korean is the Seoul-based National Institute of the Korean Language, which was created by presidential decree on January 23, 1991. In North Korea, the regulatory body is the Language Institute of the Academy of Social Sciences (, Sahoe Kwahagwon Ŏhak Yŏnguso).\n\nKing Sejong Institute\n\nEstablished pursuant to Article 9, Section 2, of the Framework Act on the National Language, the King Sejong Institute is a public institution set up to coordinate the government's project of propagating Korean language and culture; it also supports the [http://eng.ksif.or.kr/main.do King Sejong Institute], which is the institution's overseas branch. The King Sejong Institute was established in response to:\n\n* An increase in the demand for Korean language education;\n* a rapid increase in Korean language education thanks to the spread of hallyu, an increase in international marriage, the expansion of Korean enterprises into overseas markets, and enforcement of employment licensing system;\n* the need for a government-sanctioned Korean language educational institution;\n* the need for general support for overseas Korean language education based on a successful domestic language education program.\n\nTopik Korea Institute\n\nThe Topik Korea Institute is a lifelong educational center affiliated with a variety of Korean universities in Seoul, South Korea, whose aim is to promote Korean language and culture, support local Korean teaching internationally, and facilitate cultural exchanges.\n\nThe institute is sometimes compared to language and culture promotion organizations such as the King Sejong Institute. Unlike that organization, however, Topik Korea Institutes operate within established universities and colleges around the world, providing educational materials.\n\nDialects\n\nKorean has numerous small local dialects (called mal () [literally \"speech\"], saturi (), or bang'eon ( in Korean). The standard language (pyojun-eo or pyojun-mal) of both South Korea and North Korea is based on the dialect of the area around Seoul (which, as Hanyang, was the capital of Joseon-era Korea for 500 years), though the northern standard after the Korean War has been influenced by the dialect of P'yŏngyang. All dialects of Korean are similar to each other and largely mutually intelligible (with the exception of dialect-specific phrases or non-Standard vocabulary unique to dialects), though the dialect of Jeju Island is divergent enough to be sometimes classified as a separate language.David Lightfoot, 1999. The development of language: acquisition, change, and evolutionJanhunen, Juha, 1996. Manchuria: an ethnic history One of the more salient differences between dialects is the use of tone: speakers of the Seoul dialect make use of vowel length, whereas speakers of the Gyeongsang dialect maintain the pitch accent of Middle Korean. Some dialects are conservative, maintaining Middle Korean sounds (such as z, β, ə) which have been lost from the standard language, whereas others are highly innovative.\n\nThere is substantial evidence for a history of extensive dialect levelling, or even convergent evolution or intermixture of two or more originally distinct linguistic stocks, within the Korean language and its dialects. Many Korean dialects have basic vocabulary that is etymologically distinct from vocabulary of identical meaning in Standard Korean or other dialects, such as South Jeolla dialect vs. Standard Korean  \"mouth\" or Gyeongsang dialect vs. Standard Korean \"garlic chives\". This suggests that the Korean Peninsula may have at one time been much more linguistically diverse than it is at present. See also the Buyeo languages hypothesis.\n\nNonetheless, the separation of the two Korean nations has resulted in increasing differences among the dialects that have emerged over time. Since the allies of the newly founded nations split the Korean peninsula in half after 1945, the newly formed Korean nations have since borrowed vocabulary extensively from their respective allies. As the Soviet Union helped industrialize North Korea and establish it as a communist state, the North Koreans would therefore borrow a number of Russian terms. Likewise, since the United States helped South Korea extensively to develop militarily, economically, and politically, South Koreans would therefore borrow extensively from English. The differences among northern and southern dialects have become so significant that many North Korean defectors reportedly have had great difficulty communicating with South Koreans after having initially settled into South Korea. In response to the diverging vocabularies, an app called Univoca was designed to help North Korean defectors learn South Korean terms by translating them into North Korean ones. More info can be found on the page North-South differences in the Korean language.\n\nAside from the standard language, there are few clear boundaries between Korean dialects, and they are typically partially grouped according to the regions of Korea.\n\nPhonology\n\nConsonants\n\n1 The semivowels and are represented in Korean writing by modifications to vowel symbols (see below).\n\nThe IPA symbol  (a subscript double straight quotation mark, shown here with a placeholder circle) is used to denote the tensed consonants. Its official use in the Extensions to the IPA is for 'strong' articulation, but is used in the literature for faucalized voice. The Korean consonants also have elements of stiff voice, but it is not yet known how typical this is of faucalized consonants. They are produced with a partially constricted glottis and additional subglottal pressure in addition to tense vocal tract walls, laryngeal lowering, or other expansion of the larynx.\n\nVowels\n\n  is closer to a near-open central vowel, though  is still used for tradition.\n\nAllophones\n\n is aspirated and becomes an alveolo-palatal before or for most speakers (but see North–South differences in the Korean language). This occurs with the tense fricative and all the affricates as well. At the end of a syllable, changes to (example: beoseot () 'mushroom').\n\n may become a bilabial before or, a palatal before or, a velar before, a voiced between voiced sounds, and a elsewhere.\n\n become voiced between voiced sounds.\n\n frequently denasalize to at the beginnings of words.\n\n becomes alveolar flap between vowels, and or at the end of a syllable or next to another. Note that a written syllable-final , when followed by a vowel or a glide (i.e., when the next character starts with ), migrates to the next syllable and thus becomes.\n\nTraditionally, was disallowed at the beginning of a word. It disappeared before, and otherwise became. However, the inflow of western loanwords changed the trend, and now word-initial (mostly from English loanwords) are pronounced as a free variation of either or. The traditional prohibition of word-initial became a morphological rule called \"initial law\" () in South Korea, which pertains to Sino-Korean vocabulary. Such words retain their word-initial in North Korea.\n\nAll obstruents (plosives, affricates, fricatives) at the end of a word are pronounced with no audible release,.\n\nPlosive stops become nasal stops before nasal stops.\n\nHangul spelling does not reflect these assimilatory pronunciation rules, but rather maintains the underlying, partly historical morphology. Given this, it is sometimes hard to tell which actual phonemes are present in a certain word.\n\nOne difference between the pronunciation standards of North and South Korea is the treatment of initial, and initial. For example,\n* \"labor\" – north: rodong (), south: nodong ()\n* \"history\" – north: ryŏksa (), south: yeoksa ()\n* \"female\" – north: nyŏja (), south: yeoja ()\n\nMorphophonemics\n\nGrammatical morphemes may change shape depending on the preceding sounds. Examples include -eun/-neun () and -i/-ga (). Sometimes sounds may be inserted instead. Examples include -eul/-reul (), -euro/-ro (), -eseo/-seo (), -ideunji/-deunji () and -iya/-ya (). However, -euro/-ro is somewhat irregular, since it will behave differently after a rieul consonant.\n\nSome verbs may also change shape morphophonemically.\n\nGrammar\n\nKorean is an agglutinative language. The Korean language is traditionally considered to have nine parts of speech. For details, see Korean parts of speech. Modifiers generally precede the modified words, and in the case of verb modifiers, can be serially appended. The basic form of a Korean sentence is subject–object–verb, but the verb is the only required and immovable element.\n\n\"Did [you] go to the store?\" (\"you\" implied in conversation)\n\n\"Yes.\"\n\nSpeech levels and honorifics\n\nThe relationship between a speaker or writer and his or her subject and audience is paramount in Korean grammar. The relationship between speaker/writer and subject referent is reflected in honorifics, whereas that between speaker/writer and audience is reflected in speech level.\n\nHonorifics\n\nWhen talking about someone superior in status, a speaker or writer usually uses special nouns or verb endings to indicate the subject's superiority. Generally, someone is superior in status if he/she is an older relative, a stranger of roughly equal or greater age, or an employer, teacher, customer, or the like. Someone is equal or inferior in status if he/she is a younger stranger, student, employee or the like. Nowadays, there are special endings which can be used on declarative, interrogative, and imperative sentences; and both honorific or normal sentences.\n\nHonorifics in traditional Korea were strictly hierarchical. The caste and estate systems possessed patterns and usages much more complex and stratified than those used today. The intricate structure of the Korean honorific system flourished in traditional culture and society. Honorifics in contemporary Korea are now used for people who are psychologically distant. Honorifics are also used for people who are superior in status. For example, older relatives, people who are older, teachers, and employers.\n\nSpeech levels\n\nThere are seven verb paradigms or speech levels in Korean, and each level has its own unique set of verb endings which are used to indicate the level of formality of a situation. Unlike honorifics—which are used to show respect towards the referent (the person spoken of) —speech levels are used to show respect towards a speaker's or writer's audience (the person spoken to). The names of the seven levels are derived from the non-honorific imperative form of the verb  (hada, \"do\") in each level, plus the suffix  (\"che\", Hanja: ), which means \"style\".\n\nThe highest six levels are generally grouped together as jondaenmal (), whereas the lowest level (haeche, ) is called banmal () in Korean.\n\nNowadays, younger-generation speakers no longer feel obligated to lower their usual regard toward the referent. It is common to see younger people talk to their older relatives with banmal (). This is not out of disrespect, but instead it shows the intimacy and the closeness of the relationship between the two speakers. Transformations in social structures and attitudes in today's rapidly changing society have brought about change in the way people speak.\n\nGender\n\nIn general, Korean lacks grammatical gender.  As one of the few exceptions, the third-person singular pronoun has two different forms: 그 geu (male) and 그녀 geunyeo (female).  However, the terms were invented in the 20th century, under the influence of foreign languages, and they seldom appear in colloquial speech.\n\nHowever, one can still find stronger contrasts between the sexes within Korean speech. Some examples of this can be seen in: (1) softer tone used by women in speech; (2) a married woman introducing herself as someone’s mother or wife, not with her own name; (3) the presence of gender differences in titles and occupational terms (for example, a sajang is a company president and yŏsajang is a female company president.); (4) females sometimes using more tag questions and rising tones in statements, also seen in speech from children.Cho, Young A. Gender Differences in Korean Speech. Korean Language in Culture and Society. Ed. Ho-min Sohn. University of Hawaii Press, 2006. pp. 189–98.\n\nIn Western societies, individuals tend to avoid expressions of power asymmetry, mutually addressing each other by their first names for the sake of solidarity . Between two people of asymmetrical status in a Korean society, people tend to emphasize differences in status for the sake of solidarity. Koreans prefer to use kinship terms, rather than any other terms of reference.Kim, Minju. “Cross Adoption of language between different genders: The case of the Korean kinship terms hyeng and enni.” Proceedings of the Fifth Berkeley Women and Language Conference. Berkeley: Berkeley Women and Language Group. 1999. In traditional Korean society, women have long been in disadvantaged positions. Korean social structure traditionally was a patriarchically dominated family system that emphasized the maintenance of family lines. This structure has tended to separate the roles of women from those of men.Palley, Marian Lief. “Women’s Status in South Korea: Tradition and Change.” Asian Survey, Vol 30 No. 12. December 1990. pp. 1136–53.\n\nVocabulary\n\nThe core of the Korean vocabulary is made up of native Korean words. A significant proportion of the vocabulary, especially words that denote abstract ideas, are Sino-Korean words,Sohn, Ho-Min. The Korean Language (Section 1.5.3 \"Korean vocabulary\", pp. 12–13), Cambridge University Press, 2001. . either\n* directly borrowed from written Chinese, or\n* coined in Korea or Japan using Chinese characters,\n\nThe exact proportion of Sino-Korean vocabulary is a matter of debate. Sohn (2001) stated 50–60%. Later, the same author (2006, p. 5) gives an even higher estimate of 65%. Jeong Jae-do, one of the compilers of the dictionary Urimal Keun Sajeon, asserts that the proportion is not so high. He points out that Korean dictionaries compiled during the colonial period include many unused Sino-Korean words. In his estimation, the proportion of native Korean vocabulary in the Korean language might be as high as 70%.. The dictionary mentioned is \n\nKorean has two numeral systems: one native, and one borrowed from Sino-Korean.\n\nTo a much lesser extent, some words have also been borrowed from Mongolian and other languages. Conversely, the Korean language itself has also contributed some loanwords to other languages, most notably the Tsushima dialect of Japanese.\n\nThe vast majority of loanwords other than Sino-Korean come from modern times, approximately 90% of which are from English. Many words have also been borrowed from Western languages such as German via Japanese ( (areubaiteu) \"part-time job\",  (allereugi) \"allergy\",  (gibseu or gibuseu) \"plaster cast used for broken bones\"). Some Western words were borrowed indirectly via Japanese during the Japanese occupation of Korea, taking a Japanese sound pattern, for example \"dozen\" >  dāsu >  daseu. Most indirect Western borrowings are now written according to current \"Hangulization\" rules for the respective Western language, as if borrowed directly. There are a few more complicated borrowings such as \"German(y)\" (see names of Germany), the first part of whose endonym Deutschland the Japanese approximated using the kanji   doitsu that were then accepted into the Korean language by their Sino-Korean pronunciation:  dok +  il \n Dogil. In South Korean official use, a number of other Sino-Korean country names have been replaced with phonetically oriented \"Hangeulizations\" of the countries' endonyms or English names.\n\nBecause of such a prevalence of English in modern Korean culture and society, lexical borrowing is inevitable. English-derived Korean, or 'Konglish' (), is increasingly used. The vocabulary of the Korean language is roughly 5% loanwords (excluding Sino-Korean vocabulary).\n\nKorean uses words adapted from English in ways that may seem strange to native English speakers. For example, in soccer heading () is used as a noun meaning a 'header', whereas fighting () is a term of encouragement like 'come on'/'go (on)' in English. Something that is 'service' () is free or 'on the house'. A building referred to as an 'apart-uh' () is an 'apartment' (but in fact refers to a residence more akin to a condominium) and a type of pencil that is called a 'sharp' () is a mechanical pencil. Like other borrowings, many of these idiosyncrasies, including all the examples listed above, appear to be imported into Korean via Japanese, or influenced by Japanese.\n\nNorth Korean vocabulary shows a tendency to prefer native Korean over Sino-Korean or foreign borrowings, especially with recent political objectives aimed at eliminating foreign influences on the Korean language in the North. In the early years, the North Korean government tried to eliminate Sino-Korean words. Consequently, South Korean may have several Sino-Korean or foreign borrowings which are not in North Korean.\n\nWriting system\n\nBefore the creation of Hangul, people in Korea (known as Joseon at the time) primarily wrote using Classical Chinese alongside native phonetic writing systems that predate Hangul by hundreds of years, including idu, hyangchal, gugyeol, and gakpil. However, due to the fundamental differences between the Korean and Chinese languages, and the large number of characters needed to be learned, there was much difficulty in learning how to write using Chinese characters for the lower classes, who often didn't have the privilege of education. To assuage this problem, King Sejong () created the unique alphabet known as Hangul to promote literacy among the common people.\n\nHangul was denounced and looked down upon by the yangban aristocracy who deemed it too easy to learn, but it gained widespread use among the common class, and was widely used to print popular novels which were enjoyed by the common class. With growing Korean nationalism in the 19th century, the Gabo Reformists' push, and the promotion of Hangul in schools, in 1894, Hangul displaced Hanja as Korea's national script. Hanja are still used to a certain extent in South Korea where they are sometimes combined with Hangul, but this method is slowly declining in use despite students learning Hanja in school.\n\nBelow is a chart of the Korean alphabet's symbols and their canonical IPA values:\n\nThe letters of Hangul are not written linearly like most alphabets, but instead arranged into blocks that represent a syllable. So, while the word bibimbap is written as eight characters in a row in English, in Korean it is written 비빔밥, as three syllable blocks in a row. The syllable blocks are then written left to right, top to bottom.\n\nModern Korean is written with spaces between words, a feature not found in Chinese or Japanese (except when writing exclusive in hiragana, as in children's books). Korean punctuation marks are almost identical to Western ones. Traditionally, Korean was written in columns, from top to bottom, right to left, but is now usually written in rows, from left to right, top to bottom.\n\nDifferences between North Korean and South Korean\n\nThe Korean language used in the North and the South exhibits differences in pronunciation, spelling, grammar and vocabulary.Kanno, Hiroomi (ed.) / Society for Korean Linguistics in Japan (1987). Chōsengo o manabō (), Sanshūsha, Tokyo. \n\nPronunciation\n\nIn North Korea, palatalization of is optional, and can be pronounced between vowels.\n\nWords that are written the same way may be pronounced differently, such as the examples below. The pronunciations below are given in Revised Romanization, McCune–Reischauer and Hangul, the last of which represents what the Hangul would be if one were to write the word as pronounced.\n\n* Similar pronunciation is used in the North whenever the hanja \"\" is attached to a Sino-Korean word ending in ,  or . (In the South, this rule only applies when it is attached to any single-character Sino-Korean word.)\n\nSpelling\n\nSome words are spelled differently by the North and the South, but the pronunciations are the same.\n\nSpelling and pronunciation\n\nSome words have different spellings and pronunciations in the North and the South. Most of the official languages of North Korea are from the northwest (Pyeongan dialect), and the standard language of South Korea is the standard language (Seoul language close to Gyeonggi- dialect). some of which were given in the \"Phonology\" section above:\n\nIn general, when transcribing place names, North Korea tends to use the pronunciation in the original language more than South Korea, which often uses the pronunciation in English. For example:\n\nGrammar\n\nSome grammatical constructions are also different:\n\nVocabulary\n\nSome vocabulary is different between the North and the South:\n\nPunctuation\n\nIn the North, guillemets  and  are the symbols used for quotes; in the South, quotation marks equivalent to the English ones,  and , are standard, although  and  are also used.\n\nStudy by non-native learners\n\nFor native English speakers, Korean is generally considered to be one of the most difficult languages to master despite the relative ease of learning Hangul. For instance, the United States' Defense Language Institute places Korean in Category IV, which also includes Japanese, Chinese (e.g. Mandarin, Cantonese & Shanghainese) and Arabic. This means that 63 weeks of instruction (as compared to just 25 weeks for Italian, French, Portuguese and Spanish) are required to bring an English-speaking student to a limited working level of proficiency in which he or she has \"sufficient capability to meet routine social demands and limited job requirements\" and \"can deal with concrete topics in past, present, and future tense.\" Similarly, the Foreign Service Institute's School of Language Studies places Korean in Category IV, the highest level of difficulty.\n\nThe study of the Korean language in the United States is dominated by Korean American heritage language students; in 2007 they were estimated to form over 80% of all students of the language at non-military universities. However, Sejong Institutes in the United States have noted a sharp rise in the number of people of other ethnic backgrounds studying Korean between 2009 and 2011; they attribute this to rising popularity of South Korean music and television shows.\n\nThere are two widely used tests of Korean as a foreign language: the Korean Language Proficiency Test (KLPT) and the Test of Proficiency in Korean (TOPIK). The Korean Language Proficiency Test, an examination aimed at assessing non-native speakers' competence in Korean, was instituted in 1997; 17,000 people applied for the 2005 sitting of the examination. The TOPIK was first administered in 1997 and was taken by 2,274 people. Since then the total number of people who have taken the TOPIK has surpassed 1 million, with more than 150,000 candidates taking the test in 2012. TOPIK is administered in 45 regions within South Korea and 72 nations outside of South Korea, with a significant portion being administered in Japan and North America, which would suggest the targeted audience for TOPIK is still primarily foreigners of Korean heritage. This is also evident in TOPIK's website, where the examination is introduced as intended for Korean heritage students. Korean language. http://en.wikipedia.org/?curid=16756."
  }
}
