{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4554",
  "eid" : "cee233a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778426842,
  "textBody" : "Bishkek (, Bişkek, بىشکەک;; ), formerly Pishpek and Frunze, is the capital and largest city of Kyrgyzstan (Kyrgyz Republic). Bishkek is also the administrative center of the Chuy Region. The province surrounds the city, although the city itself is not part of the province, but rather a province-level unit of Kyrgyzstan.\n\nIn 1825 Khokand authorities established the fortress of \"Pishpek\" in order to control local caravan-routes and to collect tribute from Kyrgyz tribes. On 4 September 1860, with the approval of the Kyrgyz, Russian forces led by Colonel Zimmermann destroyed the fortress. \nIn 1868 a Russian settlement was established on the site of the fortress under its original name, \"Pishpek\". It lay within the General Governorship of Russian Turkestan and its Semirechye Oblast.\n\nIn 1925 the Kara-Kirghiz Autonomous Oblast was established in Russian Turkestan, promoting Pishpek to its capital. In 1926 the Communist Party of the Soviet Union renamed the city as Frunze, after the Bolshevik military leader Mikhail Frunze (1885–1925), who was born there. In 1936, the city of Frunze became the capital of the Kirghiz Soviet Socialist Republic, during the final stages of the national delimitation in the Soviet Union.\n\nIn 1991 the Kyrgyz parliament changed the capital's name to \"Bishkek\".\n\nBishkek is situated at an altitude of about 800 meters, just off the northern fringe of the Kyrgyz Ala-Too range, an extension of the Tian Shan mountain range. These mountains rise to a height of 4855 meters and provide a spectacular backdrop to the city. North of the city, a fertile and gently undulating steppe extends far north into neighboring Kazakhstan. The Chui River drains most of the area. Bishkek is connected to the Turkestan-Siberia Railway by a spur line.\n\nBishkek is a city of wide boulevards and marble-faced public buildings combined with numerous Soviet-style apartment blocks surrounding interior courtyards. There are also thousands of smaller privately built houses – mostly outside the city center. Streets follow a grid pattern, with most flanked on both sides by narrow irrigation channels, watering innumerable trees to provide shade in the hot summers.\n\nHistory\n\nKokhand rule\n\nOriginally a caravan rest stop (possibly founded by the Sogdians) on one of the branches of the Silk Road through the Tian Shan range, the location was fortified in 1825 by the Uzbek khan of Kokhand with a mud fort. In the last years of Kokhand rule, the fortress was led by Atabek, the Datka.\n\nTsarist era\n\nIn 1860, the fort was conquered and razed by the military forces of Colonel Zimmermann when Tsarist Russia annexed the area. Colonel Zimmermann rebuilt the town over the destroyed fort and put field Poruchik Titov as head of a new Russian garrison. The site was redeveloped from 1877 onward by the Russian government, which encouraged the settlement of Russian peasants by giving them fertile land to develop.\n\nSoviet era\n\nIn 1926, the city became the capital of the newly established Kirghiz ASSR and was renamed \"Frunze\" after Mikhail Frunze, Lenin's close associate who was born in Bishkek and played key roles during the revolutions of 1905 and 1917 and during the Russian civil war of the early 1920s.\n\nIndependence era\n\nThe early 1990s were tumultuous. In June 1990, a state of emergency was declared following severe ethnic riots in southern Kyrgyzstan that threatened to spread to the capital. The city was renamed Bishkek on 5 February 1991 and Kyrgyzstan achieved independence later that year during the breakup of the Soviet Union. Before independence, the majority of Bishkek's population were ethnic Russians. In 2004, Russians made up approximately 20% of the city's population, and about  in 2011.[http://findarticles.com/p/articles/mi_qa3681/is_200407/ai_n9472919 Residential Real Estate Market in Bishkek, Kyrgyzstan: Current Conditions and Prospects]  \n\nToday, Bishkek is a modern city with many restaurants and cafes, and with many second-hand European and Japanese cars and minibuses crowding its streets. However, streets and sidewalks have fallen into disrepair since the 1990s. At the same time, Bishkek still preserves its former Soviet feel with Soviet-period buildings and gardens prevailing over newer structures.\n\nBishkek is also the country's financial center, with all of the country's 21 commercial banks headquartered there. During the Soviet era, the city was home to a large number of industrial plants, but most have been shut down since 1991 or now operate on a much reduced scale. One of Bishkek's largest employment centers today is the Dordoy Bazaar open market, where many of the Chinese goods imported to CIS countries are sold.\n\nGeography\n\nOrientation\n\nThough the city is relatively young, the surrounding area has some sites of interest dating to prehistorical times.  There are also sites from the Greco-Buddhist period, the period of Nestorian influence, the era of the Central Asian khanates, and the Soviet period.\n\nThe central part of the city is laid out on a rectangular grid plan. The city's main street is the east–west Chui Avenue (Chuy Prospekti), named after the region's main river. In the Soviet era, it was called Lenin Avenue. Along or near it are many of the most important government buildings and  universities.  These include the Academy of Sciences compound. The westernmost section of the avenue is known as Deng Xiaoping Avenue.\n\nThe main north–south street is Yusup Abdrakhmanov Street, still commonly referred to by its old name, Sovietskaya Street. Its northern and southern sections are called, respectively, Yelebesov and Baityk Batyr Streets. Several major shopping centers are located along it, and in the north it provides access to Dordoy Bazaar.\n\nErkindik (\"Freedom\") Boulevard runs from north to south, from the main railroad station (Bishkek II) south of Chui Avenue to the museum quarter and sculpture park just north of Chui Avenue, and further north toward the Ministry of Foreign Affairs. In the past it was called Dzerzhinsky Boulevard,  named after a Communist revolutionary, Felix Dzerzhinsky, and its northern continuation is still called Dzerzhinsky Street.\n\nAn important east–west street is Jibek Jolu ('Silk Road'). It runs parallel to Chui Avenue about 1 mi north of it, and is part of the main east–west road of Chui Province. Both the eastern and western bus terminals are located along Jibek Jolu.\n\nThere is a Roman Catholic church located at ul. Vasiljeva 197 (near Rynok Bayat). It is the only Catholic cathedral in Kyrgyzstan.[http://www.catholic-kyrgyzstan.org/ Catholic Church in Kyrgyzstan]. Catholic-kyrgyzstan.org. Retrieved 11 March 2012.\n\nCity centre\n\n* State Historical Museum, located in Ala-Too Square, the main city square\n* State Museum of Applied Arts, containing examples of traditional Kyrgyz handicrafts\n* Frunze House Museum\n* Statue of Ivan Panfilov in the park near the White House.\n* An equestrian statue of Mikhail Frunze stands in a large park (Boulevard Erkindik) across from the train station.\n* The train station itself was built in 1946 by German prisoners of war and has survived since then without further renovation or repairs; most of those who built it perished and were buried in unmarked pits near the station.\n* The main government building, the White House, is a huge, seven story marble block and the former headquarters of the Communist Party of the Kirghiz SSR\n* At Ala-Too Square there is an independence monument where the changing of the guards may be watched.\n* Osh bazaar, west of the downtown area, is a large, picturesque produce market\n\nOuter neighbourhoods\n\nThe Dordoy Bazaar, just inside the bypass highway on the north-eastern edge of the city, is a major retail and wholesale market.\n\nOutside the city\n\nThe Kyrgyz Ala-Too mountain range, some 40 km away, provides a spectacular backdrop to the city; the Ala Archa National Park is only a 30 to 45 minutes drive away.\n\nClimate\n\nBishkek has both hot dry summer continental and mediterranean climate depending which isotherm would be used. (Köppen climate classification  Csa/Dsa respectively). Average precipitation is around 440 mm per year. Average daily high temperatures range from 3 °C in January to about 31 °C during July. The summer months are dominated by dry periods, punctuated by the occasional thunderstorm, which produces strong gusty winds and rare dust storms. The mountains to the south provide a natural boundary and protection from much of the damaging weather, as does the smaller mountain chain which runs north-west to south-east. In the winter months, sparse snow storms and frequent heavy fog are the dominating features. There are sometimes temperature inversions, during which the fog can last for days at a time.\n\nDemographics\n\nBishkek is the most populated city in Kyrgyzstan. Its population, estimated in 2015, was 937,400. From the foundation of the city to the mid-1990s, ethnic Russians and other peoples of European descent (Ukrainians, Tatars, Germans) comprised the majority of the city's population. According to the 1970 census, the ethnic Kyrgyz were only 12.3%, while whites were more than 80% of Frunze population. Now Bishkek is a predominantly Kyrgyz city, with around 66% of its residents Kyrgyz, while European peoples make up less than 20% of the population. Despite this fact, Russian is the main language while Kyrgyz continues losing ground especially among the younger generations \n\nEcology and environment\n\nAir quality\n\nEmissions of air pollutants in Bishkek amounted to 14,400 tons in 2010. Among all cities in Kyrgyzstan, the level of air pollution in Bishkek is the highest, occasionally exceeding maximum allowable concentrations by several times, especially in the city center.[http://www.nature.kg/index.php?option\ncom_content&viewarticle&id\n18&Itemid11&lang\nru Web-site of the State Agency on Environment Protection and Forestry: Assessment of Air Pollution]. Meteo.ktnet.kg. Retrieved on 11 March 2012. For example, concentrations of formaldehyde occasionally exceed maximum allowable limits by a factor of four.\n\nResponsibility for ambient air quality monitoring in Bishkek lies with the Kyrgyz State Agency of Hydrometeorology. There are seven air quality monitoring stations in Bishkek, measuring levels of sulfur dioxide, nitrogen oxides, formaldehyde, and ammonia.\n\nEconomy\n\nBishkek uses the Kyrgyzstan currency, the som. The som's value fluctuates regularly, but averaged around 61 som per U.S. dollar as of February 2015. The economy in Bishkek is primarily agricultural, and agricultural products are sometimes bartered in the outlying regions. The streets of Bishkek are regularly lined with produce vendors in a market style venue. In most of the downtown area there is a more urban cityscape with banks, stores, markets and malls. Sought after goods include hand-crafted artisan pieces, such as statues, carvings, paintings and many nature-based sculptures.\n\nHousing \n\nAs with many cities in Post-Soviet states, housing in Bishkek has undergone extensive changes since the collapse of the Soviet Union. While housing was formerly distributed to citizens in the Soviet-era, housing in Bishkek has since become privatized.\n\nThough single family houses are slowly becoming more popular, the majority of the residents live in Soviet-era apartments. Despite the Kyrgyz economy experiencing growth, increases in available housing has been slow with very little new construction. As a result of this growing prosperity and the lack of new formal housing, prices have been rising significantly – doubling from 2001 to 2002.\n\nThose unable to afford the high price of housing within Bishkek, notably internal migrants from rural villages and small provincial towns often have to resort to informal squatter settlements on the outskirts of the city. These settlements are estimated to house 400,000 people or about 30 percent of Bishkek’s population. While many of the settlements have lacked basic necessities such as electricity and running water, recently there has been a push by the local government to provide these services.\n\nGovernment\n\nLocal government is administered by the Bishkek Mayor's Office.  Askarbek Salymbekov was mayor until his resignation in August 2005, after which his deputy, Arstanbek Nogoev, took over the mayorship. Nogoev was in turn removed from his position in October 2007 through a decree of President Kurmanbek Bakiyev and replaced by businessman and former first deputy prime minister Daniar Usenov. In July 2008 former head of the Kyrgyz Railways Nariman Tuleyev was appointed mayor, who was dismissed by the interim government after 7 April 2010. From April 2010 to February 2011 Isa Omurkulov, also a former head of the Kyrgyz Railways, was an interim mayor, and from 4 February 2011 to 14 December 2013 he was re-elected the mayor of Bishkek. Kubanychbek Kulmatov was nominated for election by parliamentary group of Social Democratic Party of Kyrgyzstan in city kenesh, and he was elected as a new mayor on 15 January 2014, and stepped down on 9 February 2016 \nThe new major Albek Sabirbekovich Ibraimov was also nominated for election by parliamentary group of Social Democratic Party of Kyrgyzstan in city kenesh, and he was elected by Bishkek City Kenesh on 27 February 2016.\n\nAdministrative divisions\n\nBishkek city covers  and is administered separately and not part of any region. Besides the city proper, one urban-type settlement and one village are administered by the city: Chong-Aryk and Orto-Say. The city is divided into 4 districts: Birinchi May, Lenin, Oktyabr and Sverdlov. Chong-Aryk and Orto-Say are part of Lenin District.\n\nSports\n\nBishkek is home to Spartak, the largest football stadium in Kyrgyzstan and the only one eligible to host international matches.[https://archive.is/20120919015326/http://www.the-afc.com/en/member-association-news/central-a-south-asia-news/1924 Corporate Japanese companies to renovate Kyrgyzstan football stadium]. The-afc.com (9 November 2007). Retrieved on 11 March 2012. Several Bishkek-based football teams play on this pitch, including six-time Kyrgyzstan League champions, Dordoi-Dynamo.\n\nBishkek hosted the 2014 IIHF Challenge Cup of Asia – Division I.\n\nEducation\n\nEducational institutions in Bishkek include:\n* APAP KR\n* American University of Central Asia\n* Arabaev Kyrgyz State University[https://www.webcitation.org/5ko0Y33Jh?url=http://www.geocities.com/kyrgyzeducation October 2009+01:35:14]\n* Bishkek Humanities University\n* International Ataturk-Alatoo University\n* International University Of Kyrgyzstan\n* Kyrgyz Russian Slovenic University\n* I.K. Akhunbaev Kyrgyz State Medical Academy\n* Kyrgyz State National University\n* Kyrgyz Technical University\n* Kyrgyz-Russian State University\n* Kyrgyz-Turkish MANAS University\n* Kyrgyz Uzbek University\n* Plato University of Management and Design\n* University of Central Asia \nIn addition, the following international schools serve the expatriate community in Bishkek:\n* European School in Central Asia\n* Oxford International School Bishkek\n* Hope Academy of Bishkek\n* QSI International School of Bishkek\n* Silk Road International School\n\nTransportation\n\nMass public transport\n\nPublic transportation includes buses, electric trolley buses, and public vans (known in Russian as marshrutka). The first bus and trolley bus services in Bishkek were introduced in 1934 and 1951, respectively.\n\nTaxi cabs can be found throughout the city.\n\nThe city is considering designing and building a light rail system ().\n\nCommuter and long-distance buses\n\nThere are two main bus stations in Bishkek. The smaller old Eastern Bus Station is primarily the terminal for minibuses to various destinations within or just beyond the eastern suburbs, such as Kant, Tokmok, Kemin, Issyk Ata, or the Korday border crossing.\n\nLong-distance regular bus and minibus services to all parts of the country, as well as to Almaty (the largest city in neighboring Kazakhstan) and Kashgar, China, run mostly from the newer grand Western Bus Station; only a smaller number run from the Eastern Station.\n\nThe Dordoy Bazaar on the north-eastern outskirts of the city also contains makeshift terminals for frequent minibuses to suburban towns in all directions (from Sokuluk in the west to Tokmak in the east) and to some buses taking traders to Kazakhstan and Siberia.\n\nRail\n\n, the Bishkek railway station sees only a few trains a day. It offers a popular three-day train service from Bishkek to Moscow.\n\nThere are also long-distance trains that leave for Siberia (Novosibirsk and Novokuznetsk), via Almaty, over the Turksib route, and to Yekaterinburg (Sverdlovsk) in the Urals, via Astana. These services are remarkably slow (over 48 hours to Yekaterinburg), due to long stops at the border and the indirect route (the trains first have to go west for more than a 100 km before they enter the main Turksib line and can continue to the east or north). For example, as of the fall of 2008, train No. 305 Bishkek-Yekaterinburg was scheduled to take 11 hours to reach the Shu junction—a distance of some 269 km by rail, and less than half of that by road.\n\nAir\n\nThe city is served by Manas International Airport (IATA code FRU), located approximately 25 km northwest of the city centre, and readily reachable by taxi.\n\nIn 2002, the United States obtained the right to use Manas International Airport as an air base for its military operations in Afghanistan and Iraq. Russia subsequently (2003) established an air base of its own (Kant Air Base) near Kant, some 20 km east of Bishkek. It is based at a facility that used to be home to a major Soviet military pilot training school; one of its students, Hosni Mubarak, later became president of Egypt.\n\nNotable people\n\n* Mikhail Frunze – after whom the city was named from 1926\n* Roza Isakovna Otunbayeva (born 23 August 1950) — the third president of Kyrgyzstan.\n* Chingiz Aitmatov – world-renowned writer and public activist.\n* Nasirdin Isanov (7 November 1943 – 29 November 1991)- first prime minister of Kyrgyzstan.\n* Talant Duyshebaev (born 1968) - Handball coach and former handball player (voted 2nd IHF World Player of the Century)\n* Valentina Shevchenko – eight-time world champion kickboxer, 10 time world champion muay thai fighter, and current UFC women's bantamweight top contender.\n* Vladimir Perlin (born 1942) – cellist.\n\nTwin towns and sister cities\n\nSister cities of Bishkek include:\n* Almaty, Kazakhstan\n* Astana, Kazakhstan\n* Qazvin, Iran\n* Colorado Springs, Colorado, United States, since 1994\n* Meriden, Connecticut, USA, since 2005\n* Ankara, Turkey, since 1992\n* İzmir, Turkey\n* Ürümqi, People's Republic of China\n* Minsk, Belarus, since 2008",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bishkek" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4554" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Bishkek (, Bişkek, بىشکەک;; ), formerly Pishpek and Frunze, is the capital and largest city of Kyrgyzstan (Kyrgyz Republic). Bishkek is also the administrative center of the Chuy Region. The province surrounds the city, although the city itself is not part of the province, but rather a province-level unit of Kyrgyzstan.\n\nIn 1825 Khokand authorities established the fortress of \"Pishpek\" in order to control local caravan-routes and to collect tribute from Kyrgyz tribes. On 4 September 1860, with the approval of the Kyrgyz, Russian forces led by Colonel Zimmermann destroyed the fortress. \nIn 1868 a Russian settlement was established on the site of the fortress under its original name, \"Pishpek\". It lay within the General Governorship of Russian Turkestan and its Semirechye Oblast.\n\nIn 1925 the Kara-Kirghiz Autonomous Oblast was established in Russian Turkestan, promoting Pishpek to its capital. In 1926 the Communist Party of the Soviet Union renamed the city as Frunze, after the Bolshevik military leader Mikhail Frunze (1885–1925), who was born there. In 1936, the city of Frunze became the capital of the Kirghiz Soviet Socialist Republic, during the final stages of the national delimitation in the Soviet Union.\n\nIn 1991 the Kyrgyz parliament changed the capital's name to \"Bishkek\".\n\nBishkek is situated at an altitude of about 800 meters, just off the northern fringe of the Kyrgyz Ala-Too range, an extension of the Tian Shan mountain range. These mountains rise to a height of 4855 meters and provide a spectacular backdrop to the city. North of the city, a fertile and gently undulating steppe extends far north into neighboring Kazakhstan. The Chui River drains most of the area. Bishkek is connected to the Turkestan-Siberia Railway by a spur line.\n\nBishkek is a city of wide boulevards and marble-faced public buildings combined with numerous Soviet-style apartment blocks surrounding interior courtyards. There are also thousands of smaller privately built houses – mostly outside the city center. Streets follow a grid pattern, with most flanked on both sides by narrow irrigation channels, watering innumerable trees to provide shade in the hot summers.\n\nHistory\n\nKokhand rule\n\nOriginally a caravan rest stop (possibly founded by the Sogdians) on one of the branches of the Silk Road through the Tian Shan range, the location was fortified in 1825 by the Uzbek khan of Kokhand with a mud fort. In the last years of Kokhand rule, the fortress was led by Atabek, the Datka.\n\nTsarist era\n\nIn 1860, the fort was conquered and razed by the military forces of Colonel Zimmermann when Tsarist Russia annexed the area. Colonel Zimmermann rebuilt the town over the destroyed fort and put field Poruchik Titov as head of a new Russian garrison. The site was redeveloped from 1877 onward by the Russian government, which encouraged the settlement of Russian peasants by giving them fertile land to develop.\n\nSoviet era\n\nIn 1926, the city became the capital of the newly established Kirghiz ASSR and was renamed \"Frunze\" after Mikhail Frunze, Lenin's close associate who was born in Bishkek and played key roles during the revolutions of 1905 and 1917 and during the Russian civil war of the early 1920s.\n\nIndependence era\n\nThe early 1990s were tumultuous. In June 1990, a state of emergency was declared following severe ethnic riots in southern Kyrgyzstan that threatened to spread to the capital. The city was renamed Bishkek on 5 February 1991 and Kyrgyzstan achieved independence later that year during the breakup of the Soviet Union. Before independence, the majority of Bishkek's population were ethnic Russians. In 2004, Russians made up approximately 20% of the city's population, and about  in 2011.[http://findarticles.com/p/articles/mi_qa3681/is_200407/ai_n9472919 Residential Real Estate Market in Bishkek, Kyrgyzstan: Current Conditions and Prospects]  \n\nToday, Bishkek is a modern city with many restaurants and cafes, and with many second-hand European and Japanese cars and minibuses crowding its streets. However, streets and sidewalks have fallen into disrepair since the 1990s. At the same time, Bishkek still preserves its former Soviet feel with Soviet-period buildings and gardens prevailing over newer structures.\n\nBishkek is also the country's financial center, with all of the country's 21 commercial banks headquartered there. During the Soviet era, the city was home to a large number of industrial plants, but most have been shut down since 1991 or now operate on a much reduced scale. One of Bishkek's largest employment centers today is the Dordoy Bazaar open market, where many of the Chinese goods imported to CIS countries are sold.\n\nGeography\n\nOrientation\n\nThough the city is relatively young, the surrounding area has some sites of interest dating to prehistorical times.  There are also sites from the Greco-Buddhist period, the period of Nestorian influence, the era of the Central Asian khanates, and the Soviet period.\n\nThe central part of the city is laid out on a rectangular grid plan. The city's main street is the east–west Chui Avenue (Chuy Prospekti), named after the region's main river. In the Soviet era, it was called Lenin Avenue. Along or near it are many of the most important government buildings and  universities.  These include the Academy of Sciences compound. The westernmost section of the avenue is known as Deng Xiaoping Avenue.\n\nThe main north–south street is Yusup Abdrakhmanov Street, still commonly referred to by its old name, Sovietskaya Street. Its northern and southern sections are called, respectively, Yelebesov and Baityk Batyr Streets. Several major shopping centers are located along it, and in the north it provides access to Dordoy Bazaar.\n\nErkindik (\"Freedom\") Boulevard runs from north to south, from the main railroad station (Bishkek II) south of Chui Avenue to the museum quarter and sculpture park just north of Chui Avenue, and further north toward the Ministry of Foreign Affairs. In the past it was called Dzerzhinsky Boulevard,  named after a Communist revolutionary, Felix Dzerzhinsky, and its northern continuation is still called Dzerzhinsky Street.\n\nAn important east–west street is Jibek Jolu ('Silk Road'). It runs parallel to Chui Avenue about 1 mi north of it, and is part of the main east–west road of Chui Province. Both the eastern and western bus terminals are located along Jibek Jolu.\n\nThere is a Roman Catholic church located at ul. Vasiljeva 197 (near Rynok Bayat). It is the only Catholic cathedral in Kyrgyzstan.[http://www.catholic-kyrgyzstan.org/ Catholic Church in Kyrgyzstan]. Catholic-kyrgyzstan.org. Retrieved 11 March 2012.\n\nCity centre\n\n* State Historical Museum, located in Ala-Too Square, the main city square\n* State Museum of Applied Arts, containing examples of traditional Kyrgyz handicrafts\n* Frunze House Museum\n* Statue of Ivan Panfilov in the park near the White House.\n* An equestrian statue of Mikhail Frunze stands in a large park (Boulevard Erkindik) across from the train station.\n* The train station itself was built in 1946 by German prisoners of war and has survived since then without further renovation or repairs; most of those who built it perished and were buried in unmarked pits near the station.\n* The main government building, the White House, is a huge, seven story marble block and the former headquarters of the Communist Party of the Kirghiz SSR\n* At Ala-Too Square there is an independence monument where the changing of the guards may be watched.\n* Osh bazaar, west of the downtown area, is a large, picturesque produce market\n\nOuter neighbourhoods\n\nThe Dordoy Bazaar, just inside the bypass highway on the north-eastern edge of the city, is a major retail and wholesale market.\n\nOutside the city\n\nThe Kyrgyz Ala-Too mountain range, some 40 km away, provides a spectacular backdrop to the city; the Ala Archa National Park is only a 30 to 45 minutes drive away.\n\nClimate\n\nBishkek has both hot dry summer continental and mediterranean climate depending which isotherm would be used. (Köppen climate classification  Csa/Dsa respectively). Average precipitation is around 440 mm per year. Average daily high temperatures range from 3 °C in January to about 31 °C during July. The summer months are dominated by dry periods, punctuated by the occasional thunderstorm, which produces strong gusty winds and rare dust storms. The mountains to the south provide a natural boundary and protection from much of the damaging weather, as does the smaller mountain chain which runs north-west to south-east. In the winter months, sparse snow storms and frequent heavy fog are the dominating features. There are sometimes temperature inversions, during which the fog can last for days at a time.\n\nDemographics\n\nBishkek is the most populated city in Kyrgyzstan. Its population, estimated in 2015, was 937,400. From the foundation of the city to the mid-1990s, ethnic Russians and other peoples of European descent (Ukrainians, Tatars, Germans) comprised the majority of the city's population. According to the 1970 census, the ethnic Kyrgyz were only 12.3%, while whites were more than 80% of Frunze population. Now Bishkek is a predominantly Kyrgyz city, with around 66% of its residents Kyrgyz, while European peoples make up less than 20% of the population. Despite this fact, Russian is the main language while Kyrgyz continues losing ground especially among the younger generations \n\nEcology and environment\n\nAir quality\n\nEmissions of air pollutants in Bishkek amounted to 14,400 tons in 2010. Among all cities in Kyrgyzstan, the level of air pollution in Bishkek is the highest, occasionally exceeding maximum allowable concentrations by several times, especially in the city center.[http://www.nature.kg/index.php?option\ncom_content&viewarticle&id\n18&Itemid11&lang\nru Web-site of the State Agency on Environment Protection and Forestry: Assessment of Air Pollution]. Meteo.ktnet.kg. Retrieved on 11 March 2012. For example, concentrations of formaldehyde occasionally exceed maximum allowable limits by a factor of four.\n\nResponsibility for ambient air quality monitoring in Bishkek lies with the Kyrgyz State Agency of Hydrometeorology. There are seven air quality monitoring stations in Bishkek, measuring levels of sulfur dioxide, nitrogen oxides, formaldehyde, and ammonia.\n\nEconomy\n\nBishkek uses the Kyrgyzstan currency, the som. The som's value fluctuates regularly, but averaged around 61 som per U.S. dollar as of February 2015. The economy in Bishkek is primarily agricultural, and agricultural products are sometimes bartered in the outlying regions. The streets of Bishkek are regularly lined with produce vendors in a market style venue. In most of the downtown area there is a more urban cityscape with banks, stores, markets and malls. Sought after goods include hand-crafted artisan pieces, such as statues, carvings, paintings and many nature-based sculptures.\n\nHousing \n\nAs with many cities in Post-Soviet states, housing in Bishkek has undergone extensive changes since the collapse of the Soviet Union. While housing was formerly distributed to citizens in the Soviet-era, housing in Bishkek has since become privatized.\n\nThough single family houses are slowly becoming more popular, the majority of the residents live in Soviet-era apartments. Despite the Kyrgyz economy experiencing growth, increases in available housing has been slow with very little new construction. As a result of this growing prosperity and the lack of new formal housing, prices have been rising significantly – doubling from 2001 to 2002.\n\nThose unable to afford the high price of housing within Bishkek, notably internal migrants from rural villages and small provincial towns often have to resort to informal squatter settlements on the outskirts of the city. These settlements are estimated to house 400,000 people or about 30 percent of Bishkek’s population. While many of the settlements have lacked basic necessities such as electricity and running water, recently there has been a push by the local government to provide these services.\n\nGovernment\n\nLocal government is administered by the Bishkek Mayor's Office.  Askarbek Salymbekov was mayor until his resignation in August 2005, after which his deputy, Arstanbek Nogoev, took over the mayorship. Nogoev was in turn removed from his position in October 2007 through a decree of President Kurmanbek Bakiyev and replaced by businessman and former first deputy prime minister Daniar Usenov. In July 2008 former head of the Kyrgyz Railways Nariman Tuleyev was appointed mayor, who was dismissed by the interim government after 7 April 2010. From April 2010 to February 2011 Isa Omurkulov, also a former head of the Kyrgyz Railways, was an interim mayor, and from 4 February 2011 to 14 December 2013 he was re-elected the mayor of Bishkek. Kubanychbek Kulmatov was nominated for election by parliamentary group of Social Democratic Party of Kyrgyzstan in city kenesh, and he was elected as a new mayor on 15 January 2014, and stepped down on 9 February 2016 \nThe new major Albek Sabirbekovich Ibraimov was also nominated for election by parliamentary group of Social Democratic Party of Kyrgyzstan in city kenesh, and he was elected by Bishkek City Kenesh on 27 February 2016.\n\nAdministrative divisions\n\nBishkek city covers  and is administered separately and not part of any region. Besides the city proper, one urban-type settlement and one village are administered by the city: Chong-Aryk and Orto-Say. The city is divided into 4 districts: Birinchi May, Lenin, Oktyabr and Sverdlov. Chong-Aryk and Orto-Say are part of Lenin District.\n\nSports\n\nBishkek is home to Spartak, the largest football stadium in Kyrgyzstan and the only one eligible to host international matches.[https://archive.is/20120919015326/http://www.the-afc.com/en/member-association-news/central-a-south-asia-news/1924 Corporate Japanese companies to renovate Kyrgyzstan football stadium]. The-afc.com (9 November 2007). Retrieved on 11 March 2012. Several Bishkek-based football teams play on this pitch, including six-time Kyrgyzstan League champions, Dordoi-Dynamo.\n\nBishkek hosted the 2014 IIHF Challenge Cup of Asia – Division I.\n\nEducation\n\nEducational institutions in Bishkek include:\n* APAP KR\n* American University of Central Asia\n* Arabaev Kyrgyz State University[https://www.webcitation.org/5ko0Y33Jh?url=http://www.geocities.com/kyrgyzeducation October 2009+01:35:14]\n* Bishkek Humanities University\n* International Ataturk-Alatoo University\n* International University Of Kyrgyzstan\n* Kyrgyz Russian Slovenic University\n* I.K. Akhunbaev Kyrgyz State Medical Academy\n* Kyrgyz State National University\n* Kyrgyz Technical University\n* Kyrgyz-Russian State University\n* Kyrgyz-Turkish MANAS University\n* Kyrgyz Uzbek University\n* Plato University of Management and Design\n* University of Central Asia \nIn addition, the following international schools serve the expatriate community in Bishkek:\n* European School in Central Asia\n* Oxford International School Bishkek\n* Hope Academy of Bishkek\n* QSI International School of Bishkek\n* Silk Road International School\n\nTransportation\n\nMass public transport\n\nPublic transportation includes buses, electric trolley buses, and public vans (known in Russian as marshrutka). The first bus and trolley bus services in Bishkek were introduced in 1934 and 1951, respectively.\n\nTaxi cabs can be found throughout the city.\n\nThe city is considering designing and building a light rail system ().\n\nCommuter and long-distance buses\n\nThere are two main bus stations in Bishkek. The smaller old Eastern Bus Station is primarily the terminal for minibuses to various destinations within or just beyond the eastern suburbs, such as Kant, Tokmok, Kemin, Issyk Ata, or the Korday border crossing.\n\nLong-distance regular bus and minibus services to all parts of the country, as well as to Almaty (the largest city in neighboring Kazakhstan) and Kashgar, China, run mostly from the newer grand Western Bus Station; only a smaller number run from the Eastern Station.\n\nThe Dordoy Bazaar on the north-eastern outskirts of the city also contains makeshift terminals for frequent minibuses to suburban towns in all directions (from Sokuluk in the west to Tokmak in the east) and to some buses taking traders to Kazakhstan and Siberia.\n\nRail\n\n, the Bishkek railway station sees only a few trains a day. It offers a popular three-day train service from Bishkek to Moscow.\n\nThere are also long-distance trains that leave for Siberia (Novosibirsk and Novokuznetsk), via Almaty, over the Turksib route, and to Yekaterinburg (Sverdlovsk) in the Urals, via Astana. These services are remarkably slow (over 48 hours to Yekaterinburg), due to long stops at the border and the indirect route (the trains first have to go west for more than a 100 km before they enter the main Turksib line and can continue to the east or north). For example, as of the fall of 2008, train No. 305 Bishkek-Yekaterinburg was scheduled to take 11 hours to reach the Shu junction—a distance of some 269 km by rail, and less than half of that by road.\n\nAir\n\nThe city is served by Manas International Airport (IATA code FRU), located approximately 25 km northwest of the city centre, and readily reachable by taxi.\n\nIn 2002, the United States obtained the right to use Manas International Airport as an air base for its military operations in Afghanistan and Iraq. Russia subsequently (2003) established an air base of its own (Kant Air Base) near Kant, some 20 km east of Bishkek. It is based at a facility that used to be home to a major Soviet military pilot training school; one of its students, Hosni Mubarak, later became president of Egypt.\n\nNotable people\n\n* Mikhail Frunze – after whom the city was named from 1926\n* Roza Isakovna Otunbayeva (born 23 August 1950) — the third president of Kyrgyzstan.\n* Chingiz Aitmatov – world-renowned writer and public activist.\n* Nasirdin Isanov (7 November 1943 – 29 November 1991)- first prime minister of Kyrgyzstan.\n* Talant Duyshebaev (born 1968) - Handball coach and former handball player (voted 2nd IHF World Player of the Century)\n* Valentina Shevchenko – eight-time world champion kickboxer, 10 time world champion muay thai fighter, and current UFC women's bantamweight top contender.\n* Vladimir Perlin (born 1942) – cellist.\n\nTwin towns and sister cities\n\nSister cities of Bishkek include:\n* Almaty, Kazakhstan\n* Astana, Kazakhstan\n* Qazvin, Iran\n* Colorado Springs, Colorado, United States, since 1994\n* Meriden, Connecticut, USA, since 2005\n* Ankara, Turkey, since 1992\n* İzmir, Turkey\n* Ürümqi, People's Republic of China\n* Minsk, Belarus, since 2008. Bishkek. http://en.wikipedia.org/?curid=4554."
  }
}
