{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13881",
  "eid" : "0f1411f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778534543,
  "textBody" : "The H. J. Heinz Company, or Heinz, was an American food processing company with world headquarters in Pittsburgh, Pennsylvania.  It was founded by Henry John Heinz in 1869.  The H. J. Heinz Company manufactures thousands of food products in plants on six continents, and markets these products in more than 200 countries and territories.  The company claims to have 150 number-one or number-two brands worldwide. Heinz ranked first in ketchup in the US with a market share in excess of 50%; Ore-Ida label held 46% of the frozen potato sector in 2003.\n\nSince 1896, the company has used its \"57 Varieties\" slogan; it was inspired by a sign advertising 21 styles of shoes, and Henry Heinz chose the number 57 even though the company manufactured more than 60 products at the time.\n\nOn February 14, 2013, Heinz agreed to be purchased by Berkshire Hathaway and 3G Capital for $23 billion. On March 25, 2015, Kraft announced its merger with Heinz, arranged by Berkshire Hathaway and 3G Capital. The resulting Kraft Heinz Company is the fifth largest food company in the world. Berkshire Hathaway became a majority owner of Heinz on June 18, 2015. After exercising a warrant to acquire 46,195,652 shares of common stock for a total price of $461,956.52, Berkshire increased its stake to 52.5%. The companies completed the merger on July 2, 2015.\n\nHistory\n\n19th-century origins\n\nThe Heinz company was founded by and is named for Henry J. Heinz, who was born in the United States to German immigrants. His father was originally from Kallstadt (then in Bavaria, now part of Rhineland-Palatinate). His mother Anna was also from Bavaria, and they met in Pittsburgh.\n\nHenry J. Heinz began packing foodstuffs on a small scale at Sharpsburg, Pennsylvania, in 1869. There he founded Heinz Noble & Company with a friend, L. Clarence Noble, and began marketing horseradish. The first product in Heinz and Noble's new Anchor Brand (a name selected for its biblical meaning of hope) was his mother Anna Heinz's recipe for horseradish. The young Heinz manufactured it in the basement of his father's former house.\n\nThe company went bankrupt in 1875. The following year Heinz founded another company, F & J Heinz, with his brother John Heinz and a cousin, Frederick Heinz. One of this company's first products was Heinz Tomato Ketchup. The company continued to grow.\n\nIn 1888 Heinz bought out his other two partners and reorganized the company as the H. J. Heinz Company. Its slogan, \"57 varieties\", was introduced by Heinz in 1896. Inspired by an advertisement he saw while riding an elevated train in New York City (a shoe store boasting \"21 styles\"), Heinz picked the number more or less at random because he liked the sound of it, selecting \"7\" specifically because, as he put it, of the \"psychological influence of that figure and of its enduring significance to people of all ages.\"\n\n20th century\n\nIn 1905, H. J. Heinz was incorporated, and Heinz served as its first president, remaining in the position for the rest of his life. Under his leadership, the company pioneered processes for sanitary food preparation, leading a successful lobbying effort in favor of the Pure Food and Drug Act in 1906. Heinz was a pioneer in both scientific and \"technological innovations to solve problems like bacterial contamination.\" He personally worked to control the \"purity of his products by managing his employees\", offering hot showers and weekly manicures for the women handling food. During World War I, he worked with the Food Administration.\n\nIn 1914, Heinz Salad Cream was invented in England.\n\nIn 1930, Howard Heinz, son of Henry Heinz, helped to fight the Great Depression by selling ready-to-serve quality soups and baby food. They became top sellers. During World War II, \"Jack\" Heinz led the company as president and CEO to aid the United Kingdom offset food shortages. Its plant in Pittsburgh was converted for a time to manufacture gliders for the War Department.\n\nIn the postwar years, Jack Heinz expanded the company to develop plants in several nations overseas, greatly expanding its international presence. He also acquired Ore-Ida and Starkist Tuna.\n\nIn 1959, long-time Heinz employee Frank Armour Jr. was elected president and COO of H. J. Heinz Co., succeeding H. J. Heinz II. He was the first non-family member to hold the job since the company started in 1869. He became vice chairman in 1966, and later became chairman and CEO of Heinz subsidiary, Ore-Ida Foods Inc.\n\nIn 1969, Tony O'Reilly joined the company's UK subsidiary, soon becoming its managing director; he moved to Pittsburgh in 1971 when he was promoted to Senior Vice President for the North America and Pacific region. By 1973, board members Robert Burt Gookin and Jack Heinz selected him as COO and President.  He became CEO in 1979 and chairman in 1987.\n\nBetween 1981 and 1991, Heinz returned 28% annually, doubling the Standard & Poor's average annual return for those years.  By 2000, the consolidation of grocery store chains, the spread of retailers such as Walmart, and growth of private-label brands caused competition for shelf space, and put price pressure on the company's products.  The decline was also attributed to an inadequate response to broad demographic changes in the United States, particularly the growth in population among Hispanic and African Americans.\n\nOn April 4, 1991, former U.S. Senator Henry John Heinz III, the third-generation successor to the Heinz fortune, and six other people were killed when a Bell 412 helicopter and a Piper Aerostar with Heinz aboard collided in mid-air above Merion Elementary School in Lower Merion Township, Pennsylvania. His fortune passed on to his wife, Teresa Heinz.\n\nIn 1998, Tony O'Reilly left Heinz after issues with the company's performance. He faced challenges from corporate governance groups and pension funds including CalPERS.Lead cover story: \"The CEO and the Board\", Business Week, 15 September 1997 He was succeeded by his deputy, William R. Johnson. \n\n21st century\n\nBillionaire Nelson Peltz initiated a proxy battle during 2006, culminating in a vote to place five of Peltz's nominees on the Board. After the final vote, two of the five nominees joined the Heinz Board. The new members of the board were Nelson Peltz and Matthew Craig Walsh.\n\nIn June 2008, Heinz began an advertising campaign in the UK for their new 'New York Deli Mayo' products. The advertisement featured a family with the mother replaced by a male New York deli worker. The advert ended with the father and the 'mother' kissing. This drew 200 complaints to the Advertising Standards Authority. On June 24, 2008 Heinz decided to withdraw the advertisement, which was initially planned for a 5-week run. A spokesperson for Heinz said the company had recognized that some of its customers had concerns about the advertisement's content.\n\nWithdrawing the advert was also controversial, as critics accused Heinz of homophobia. The gay rights group Stonewall called for a boycott of the company's products. Some have expressed surprise that Heinz has responded to what they view as a small number of complaints, relative to the United Kingdom's 3.6 million gay and lesbian consumers. MP Diane Abbott called the decision to withdraw the advert 'ill-considered' and 'likely to offend the gay community' in an early day motion on June 25.\n\nOn February 14, 2013, it was announced that Heinz would be purchased by Berkshire Hathaway and 3G Capital for $23 billion. Including debt assumption the transaction was valued at $28 billion. According to Heinz, the deal was the largest in food industry history. Berkshire Hathaway and 3G would each own half of Heinz, with 3G running the company. Berkshire and 3G paid $72.50 a share. The acquisition was completed in June of that year. Berkshire and 3G immediately named former chief executive of Burger King Worldwide Inc, Bernardo Hees, as the CEO.\n\nOn August 13, 2013, Heinz announced it was cutting 600 jobs in North America.\nOn October 25, 2013, fast-food chain McDonald's announced it would end its 40-year relationship with Heinz, after Bernardo Hees became CEO. Hees had previously been the chief executive of Burger King, a major competitor of McDonald's.\n\nBrands\n\n* ABC\n* Bagel Bites\n* Classico\n* Complan\n* Daddies\n* \n* Delimex\n* Diana Sauce\n* Farex\n* Greenseas\n* Heinz\n* HP Sauce\n* Jack Daniel's sauces (under license)\n* Lea & Perrins\n* Ore-Ida\n* T.G.I. Friday's (under license)\n* Wattie's\n* Weight Watchers (under license)\n* Wyler's\n\nInternational presence\n\nUnited States\n\nThe company's world headquarters are in Pittsburgh, Pennsylvania, where the company has been located since 1890. The company's \"keystone\" logo is based on that of Pennsylvania, the \"keystone state\". A majority of its ketchup is produced in Fremont, Ohio. Heinz Field was named after the Heinz company in 2001.\n\nHeinz opened a pickle factory in Holland, Michigan, in 1897, and it is the largest such facility in the world. The Heinz Portion Control subsidiary is located in Jacksonville Florida and produces single-serving containers of ketchup, mustard, salad dressings, jams, jellies and syrups.\n\nHeinz also has factories in the following locations:\nArizona (Phoenix);\nCalifornia (Chatsworth, Escalon, Irvine, San Diego);\nFlorida (Fort Myers);\nIdaho (Pocatello);\nIowa, (Cedar Rapids, Muscatine);\nMassachusetts (Newburyport);\nOhio (Mason, Massillon);\nOregon (Ontario), and\nSouth Carolina (Florence).\n\nIn 2000, seven retailers, including Walmart, Albertsons, and Safeway, comprised half of the company's sales by volume.\n\nAustralia\n\nHeinz Australia's head office is located in Melbourne. Products include canned baked beans in tomato sauce (popularized in the \"beanz meanz Heinz\" advertising campaign), spaghetti in a similar sauce, and canned soup, condensed soup, and \"ready to eat\" soups.\n\nHeinz manufactures \"Big Red\" tomato sauce, and a number of flavored baked bean varieties, as well as canned meals.  Heinz also markets the Wattie's brand of canned foods, which are made in New Zealand.\n\nOn October 6, 2008, Heinz announced plans to acquire the Australian company Golden Circle which \"manufactures more than 500 products, including canned fruit and vegetables, fruit juices, drinks, cordials and jams.\"\n\nOn May 27, 2011, Heinz announced it would close its factory in Girgarre, Victoria, and downsize its factories in Northgate (Brisbane), and Wagga Wagga, with loss of more than 300 jobs. Heinz has other factories in Echuca and Mill Park.\n\nOn January 6, 2012, Heinz closed its tomato sauce factory in Girgarre as announced in the previous May. 146 workers lost their jobs. A local group was seeking to purchase the factory and start its own production, with offers of financial assistance from investors. The group's first offer for the site was rejected by Heinz. Girgarre was the second to last tomato sauce factory in Australia, and its closing brought an end to Heinz's 70 years of tomato processing operations in Australia.\n\nCanada\n\nHeinz was established in Canada in 1909 in a former tobacco factory in Leamington, Ontario (known as the Tomato Capital of Canada). Most products shipped from Leamington have English and French labels for distribution throughout Canada, but a substantial amount of product is sent to the US. Ketchup is the main product produced there, but the factory also produces Canada Fancy (Grade A) tomato juice, mustard, vinegar, baby food, barbecue sauces, canned pastas, beans, pasta sauces, gravies and soups. Heinz Canada is the major supplier of single-serving and flexible-packaging condiments for most fast food chains in Canada. Leamington  is the largest tomato processing region per acreage in the world. The Leamington plant usually processes more than 250,000 tons of tomatoes per year. Heinz Canada's head office is in North York, Ontario; it also has operations in St. Marys, Ontario; Montreal, Quebec; and Calgary, Alberta.\n\nOn November 14, 2013, Heinz announced that the Leamington facility, the second-largest in the company, would close sometime in May 2014. Ketchup processing operations were to be consolidated at the company's US locations. Over 800 local jobs were lost due to the town's largest employer ending operations there. A local effort began in an attempt to save the 105-year-old Leamington plant, which included a Facebook page to gather support. On February 27, 2014 the Highbury Canco Corporation signed a letter of intent to acquire and operate the facility. In April it was reported that Highbury Canco Corporation had received a one-year license to process tomatoes at the facility.\n\nIndia\n\nHeinz Ketchup is available in India in two varieties, the standard Tomato Ketchup and Tomato Chili Sauce.\n\nAs Indian taste preferences vary among the regions, Western brands such as Heinz must work on Indian interpretations of ketchups for sale in the country.Vijayraghavan, Kala. \"[http://economictimes.indiatimes.com/news/news-by-industry/cons-products/food/heinz-braces-up-for-aggressive-marketing/articleshow/5417995.cms Heinz braces up for aggressive marketing].\" The Economic Times. 7 January 2010.\n\nHeinz acquired the former foods division of Glaxo India, gaining the Complan, Glucon D, Glucon C, Sampriti Ghee, and Nycil products and brands.\n\nIndonesia\n\nH. J. Heinz Company entered Indonesia in 1999, when it acquired 65 percent share of PT. ABC Central Food, for US$70 million, and formed PT. Heinz ABC Indonesia. The company is based in Jakarta, and manufactures sauces, condiments, juices and syrups.\n\nServing demand from Indonesia's large population and growing economy, in the early 21st century PT. Heinz ABC Indonesia is the largest Heinz's business in Asia, and one of the largest in the world. It employs 3000 employees, has 3 production facilities, 8 packing facilities, and an extensive distribution network in Java and other parts of Indonesia. Their leading products are Syrup ABC (fruit syrup), Kecap ABC (sweet soy sauce), and Sambal ABC (hot chili sauce).\n\nNetherlands\n\nHeinz sells many products in the Netherlands; the Elst factory in Gelderland is the primary production facility for Heinz sauces for Western Europe. In 2006, production of both HP Sauce and Daddies was transferred from Birmingham, West Midlands to Elst as a result of the acquisition of HP Foods and the subsequent closure of the Aston factory. Subsequently, Heinz suffered severe supply issues for the ex-HP Foods brands as the Elst factory struggled to integrate production, resulting in significant negative coverage from UK retailers. Heinz was forced to begin bottling sauce in Spain, shipping ready-made sauce from Elst, to get product back into supply.\n\nUnited Kingdom\n\nHeinz is the leading seller of baked beans in the UK, with its beans product lines referred to as Heinz Baked Beans.\n\nThe UK headquarters is in Hayes, London. After opening its first overseas office in London in 1896, the company opened its first UK factory in Peckham, south London in 1905. This was followed by a factory at Harlesden, north-west London in 1919. Bombed twice in World War 2, this factory remained in production until 2000. Production was started at a former munitions factory at Standish near Wigan in 1946, before the new factory at Kitt Green, near Wigan, opened in 1959. Heinz also has an infant food factory in Kendal, Cumbria. The site specializes in baby milks, previously under the brand of Farley's, but now manufactured under the name Heinz Nurture. It has around 200 employees.\n\nHeinz produces oriental foods sold under the Amoy brand, used under license from Ajinomoto Co. Inc., Tokyo, Japan.\n\nIn July 2001, the Food Standards Agency of the Government of the United Kingdom found Heinz canned baked beans products to be contaminated with the hormone disruptor bisphenol.\n\nIn June 2009, a company PR stunt announced they had introduced the prototype of the world's smallest, portable microwave, the \"Beanzawave\". The microwave was to appeal to office workers and students and can be powered by a computer via a USB port. The microwave may be used to heat up coffee or tea, or small food items. It is also good for heating up Heinz's hot snack line, Snap Pots, for which it was designed. The prototype was designed by microwave expert, Gordon Andrews and industrial designer, Stephen Frazer.\n\nIn 2013, the Kitt Green facility was listed as one among the world's five largest manufacturing units by the Discovery Channel (the list comprised Reliance's Jamnagar Refinery, Volkswagen's car plant, Kitt Green Foods plant, NASA's Kennedy Space Center and POSCO's steel plant). It is Europe's largest food factory and turns over more than 1 billion cans every year.\n\nChina\n\nOn February 22, 2013, Sanquan Food, a Chinese frozen food company, signed a contract to purchase LongFong Food, a subsidiary of Heinz Company in China.  With this sale, Heinz (China) will focus on infant foods and sauces in emerging markets such as China. Heinz Hong Kong Limited is the regional office serving for operations in Hong Kong, China and Taiwan.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Heinz" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13881" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The H. J. Heinz Company, or Heinz, was an American food processing company with world headquarters in Pittsburgh, Pennsylvania.  It was founded by Henry John Heinz in 1869.  The H. J. Heinz Company manufactures thousands of food products in plants on six continents, and markets these products in more than 200 countries and territories.  The company claims to have 150 number-one or number-two brands worldwide. Heinz ranked first in ketchup in the US with a market share in excess of 50%; Ore-Ida label held 46% of the frozen potato sector in 2003.\n\nSince 1896, the company has used its \"57 Varieties\" slogan; it was inspired by a sign advertising 21 styles of shoes, and Henry Heinz chose the number 57 even though the company manufactured more than 60 products at the time.\n\nOn February 14, 2013, Heinz agreed to be purchased by Berkshire Hathaway and 3G Capital for $23 billion. On March 25, 2015, Kraft announced its merger with Heinz, arranged by Berkshire Hathaway and 3G Capital. The resulting Kraft Heinz Company is the fifth largest food company in the world. Berkshire Hathaway became a majority owner of Heinz on June 18, 2015. After exercising a warrant to acquire 46,195,652 shares of common stock for a total price of $461,956.52, Berkshire increased its stake to 52.5%. The companies completed the merger on July 2, 2015.\n\nHistory\n\n19th-century origins\n\nThe Heinz company was founded by and is named for Henry J. Heinz, who was born in the United States to German immigrants. His father was originally from Kallstadt (then in Bavaria, now part of Rhineland-Palatinate). His mother Anna was also from Bavaria, and they met in Pittsburgh.\n\nHenry J. Heinz began packing foodstuffs on a small scale at Sharpsburg, Pennsylvania, in 1869. There he founded Heinz Noble & Company with a friend, L. Clarence Noble, and began marketing horseradish. The first product in Heinz and Noble's new Anchor Brand (a name selected for its biblical meaning of hope) was his mother Anna Heinz's recipe for horseradish. The young Heinz manufactured it in the basement of his father's former house.\n\nThe company went bankrupt in 1875. The following year Heinz founded another company, F & J Heinz, with his brother John Heinz and a cousin, Frederick Heinz. One of this company's first products was Heinz Tomato Ketchup. The company continued to grow.\n\nIn 1888 Heinz bought out his other two partners and reorganized the company as the H. J. Heinz Company. Its slogan, \"57 varieties\", was introduced by Heinz in 1896. Inspired by an advertisement he saw while riding an elevated train in New York City (a shoe store boasting \"21 styles\"), Heinz picked the number more or less at random because he liked the sound of it, selecting \"7\" specifically because, as he put it, of the \"psychological influence of that figure and of its enduring significance to people of all ages.\"\n\n20th century\n\nIn 1905, H. J. Heinz was incorporated, and Heinz served as its first president, remaining in the position for the rest of his life. Under his leadership, the company pioneered processes for sanitary food preparation, leading a successful lobbying effort in favor of the Pure Food and Drug Act in 1906. Heinz was a pioneer in both scientific and \"technological innovations to solve problems like bacterial contamination.\" He personally worked to control the \"purity of his products by managing his employees\", offering hot showers and weekly manicures for the women handling food. During World War I, he worked with the Food Administration.\n\nIn 1914, Heinz Salad Cream was invented in England.\n\nIn 1930, Howard Heinz, son of Henry Heinz, helped to fight the Great Depression by selling ready-to-serve quality soups and baby food. They became top sellers. During World War II, \"Jack\" Heinz led the company as president and CEO to aid the United Kingdom offset food shortages. Its plant in Pittsburgh was converted for a time to manufacture gliders for the War Department.\n\nIn the postwar years, Jack Heinz expanded the company to develop plants in several nations overseas, greatly expanding its international presence. He also acquired Ore-Ida and Starkist Tuna.\n\nIn 1959, long-time Heinz employee Frank Armour Jr. was elected president and COO of H. J. Heinz Co., succeeding H. J. Heinz II. He was the first non-family member to hold the job since the company started in 1869. He became vice chairman in 1966, and later became chairman and CEO of Heinz subsidiary, Ore-Ida Foods Inc.\n\nIn 1969, Tony O'Reilly joined the company's UK subsidiary, soon becoming its managing director; he moved to Pittsburgh in 1971 when he was promoted to Senior Vice President for the North America and Pacific region. By 1973, board members Robert Burt Gookin and Jack Heinz selected him as COO and President.  He became CEO in 1979 and chairman in 1987.\n\nBetween 1981 and 1991, Heinz returned 28% annually, doubling the Standard & Poor's average annual return for those years.  By 2000, the consolidation of grocery store chains, the spread of retailers such as Walmart, and growth of private-label brands caused competition for shelf space, and put price pressure on the company's products.  The decline was also attributed to an inadequate response to broad demographic changes in the United States, particularly the growth in population among Hispanic and African Americans.\n\nOn April 4, 1991, former U.S. Senator Henry John Heinz III, the third-generation successor to the Heinz fortune, and six other people were killed when a Bell 412 helicopter and a Piper Aerostar with Heinz aboard collided in mid-air above Merion Elementary School in Lower Merion Township, Pennsylvania. His fortune passed on to his wife, Teresa Heinz.\n\nIn 1998, Tony O'Reilly left Heinz after issues with the company's performance. He faced challenges from corporate governance groups and pension funds including CalPERS.Lead cover story: \"The CEO and the Board\", Business Week, 15 September 1997 He was succeeded by his deputy, William R. Johnson. \n\n21st century\n\nBillionaire Nelson Peltz initiated a proxy battle during 2006, culminating in a vote to place five of Peltz's nominees on the Board. After the final vote, two of the five nominees joined the Heinz Board. The new members of the board were Nelson Peltz and Matthew Craig Walsh.\n\nIn June 2008, Heinz began an advertising campaign in the UK for their new 'New York Deli Mayo' products. The advertisement featured a family with the mother replaced by a male New York deli worker. The advert ended with the father and the 'mother' kissing. This drew 200 complaints to the Advertising Standards Authority. On June 24, 2008 Heinz decided to withdraw the advertisement, which was initially planned for a 5-week run. A spokesperson for Heinz said the company had recognized that some of its customers had concerns about the advertisement's content.\n\nWithdrawing the advert was also controversial, as critics accused Heinz of homophobia. The gay rights group Stonewall called for a boycott of the company's products. Some have expressed surprise that Heinz has responded to what they view as a small number of complaints, relative to the United Kingdom's 3.6 million gay and lesbian consumers. MP Diane Abbott called the decision to withdraw the advert 'ill-considered' and 'likely to offend the gay community' in an early day motion on June 25.\n\nOn February 14, 2013, it was announced that Heinz would be purchased by Berkshire Hathaway and 3G Capital for $23 billion. Including debt assumption the transaction was valued at $28 billion. According to Heinz, the deal was the largest in food industry history. Berkshire Hathaway and 3G would each own half of Heinz, with 3G running the company. Berkshire and 3G paid $72.50 a share. The acquisition was completed in June of that year. Berkshire and 3G immediately named former chief executive of Burger King Worldwide Inc, Bernardo Hees, as the CEO.\n\nOn August 13, 2013, Heinz announced it was cutting 600 jobs in North America.\nOn October 25, 2013, fast-food chain McDonald's announced it would end its 40-year relationship with Heinz, after Bernardo Hees became CEO. Hees had previously been the chief executive of Burger King, a major competitor of McDonald's.\n\nBrands\n\n* ABC\n* Bagel Bites\n* Classico\n* Complan\n* Daddies\n* \n* Delimex\n* Diana Sauce\n* Farex\n* Greenseas\n* Heinz\n* HP Sauce\n* Jack Daniel's sauces (under license)\n* Lea & Perrins\n* Ore-Ida\n* T.G.I. Friday's (under license)\n* Wattie's\n* Weight Watchers (under license)\n* Wyler's\n\nInternational presence\n\nUnited States\n\nThe company's world headquarters are in Pittsburgh, Pennsylvania, where the company has been located since 1890. The company's \"keystone\" logo is based on that of Pennsylvania, the \"keystone state\". A majority of its ketchup is produced in Fremont, Ohio. Heinz Field was named after the Heinz company in 2001.\n\nHeinz opened a pickle factory in Holland, Michigan, in 1897, and it is the largest such facility in the world. The Heinz Portion Control subsidiary is located in Jacksonville Florida and produces single-serving containers of ketchup, mustard, salad dressings, jams, jellies and syrups.\n\nHeinz also has factories in the following locations:\nArizona (Phoenix);\nCalifornia (Chatsworth, Escalon, Irvine, San Diego);\nFlorida (Fort Myers);\nIdaho (Pocatello);\nIowa, (Cedar Rapids, Muscatine);\nMassachusetts (Newburyport);\nOhio (Mason, Massillon);\nOregon (Ontario), and\nSouth Carolina (Florence).\n\nIn 2000, seven retailers, including Walmart, Albertsons, and Safeway, comprised half of the company's sales by volume.\n\nAustralia\n\nHeinz Australia's head office is located in Melbourne. Products include canned baked beans in tomato sauce (popularized in the \"beanz meanz Heinz\" advertising campaign), spaghetti in a similar sauce, and canned soup, condensed soup, and \"ready to eat\" soups.\n\nHeinz manufactures \"Big Red\" tomato sauce, and a number of flavored baked bean varieties, as well as canned meals.  Heinz also markets the Wattie's brand of canned foods, which are made in New Zealand.\n\nOn October 6, 2008, Heinz announced plans to acquire the Australian company Golden Circle which \"manufactures more than 500 products, including canned fruit and vegetables, fruit juices, drinks, cordials and jams.\"\n\nOn May 27, 2011, Heinz announced it would close its factory in Girgarre, Victoria, and downsize its factories in Northgate (Brisbane), and Wagga Wagga, with loss of more than 300 jobs. Heinz has other factories in Echuca and Mill Park.\n\nOn January 6, 2012, Heinz closed its tomato sauce factory in Girgarre as announced in the previous May. 146 workers lost their jobs. A local group was seeking to purchase the factory and start its own production, with offers of financial assistance from investors. The group's first offer for the site was rejected by Heinz. Girgarre was the second to last tomato sauce factory in Australia, and its closing brought an end to Heinz's 70 years of tomato processing operations in Australia.\n\nCanada\n\nHeinz was established in Canada in 1909 in a former tobacco factory in Leamington, Ontario (known as the Tomato Capital of Canada). Most products shipped from Leamington have English and French labels for distribution throughout Canada, but a substantial amount of product is sent to the US. Ketchup is the main product produced there, but the factory also produces Canada Fancy (Grade A) tomato juice, mustard, vinegar, baby food, barbecue sauces, canned pastas, beans, pasta sauces, gravies and soups. Heinz Canada is the major supplier of single-serving and flexible-packaging condiments for most fast food chains in Canada. Leamington  is the largest tomato processing region per acreage in the world. The Leamington plant usually processes more than 250,000 tons of tomatoes per year. Heinz Canada's head office is in North York, Ontario; it also has operations in St. Marys, Ontario; Montreal, Quebec; and Calgary, Alberta.\n\nOn November 14, 2013, Heinz announced that the Leamington facility, the second-largest in the company, would close sometime in May 2014. Ketchup processing operations were to be consolidated at the company's US locations. Over 800 local jobs were lost due to the town's largest employer ending operations there. A local effort began in an attempt to save the 105-year-old Leamington plant, which included a Facebook page to gather support. On February 27, 2014 the Highbury Canco Corporation signed a letter of intent to acquire and operate the facility. In April it was reported that Highbury Canco Corporation had received a one-year license to process tomatoes at the facility.\n\nIndia\n\nHeinz Ketchup is available in India in two varieties, the standard Tomato Ketchup and Tomato Chili Sauce.\n\nAs Indian taste preferences vary among the regions, Western brands such as Heinz must work on Indian interpretations of ketchups for sale in the country.Vijayraghavan, Kala. \"[http://economictimes.indiatimes.com/news/news-by-industry/cons-products/food/heinz-braces-up-for-aggressive-marketing/articleshow/5417995.cms Heinz braces up for aggressive marketing].\" The Economic Times. 7 January 2010.\n\nHeinz acquired the former foods division of Glaxo India, gaining the Complan, Glucon D, Glucon C, Sampriti Ghee, and Nycil products and brands.\n\nIndonesia\n\nH. J. Heinz Company entered Indonesia in 1999, when it acquired 65 percent share of PT. ABC Central Food, for US$70 million, and formed PT. Heinz ABC Indonesia. The company is based in Jakarta, and manufactures sauces, condiments, juices and syrups.\n\nServing demand from Indonesia's large population and growing economy, in the early 21st century PT. Heinz ABC Indonesia is the largest Heinz's business in Asia, and one of the largest in the world. It employs 3000 employees, has 3 production facilities, 8 packing facilities, and an extensive distribution network in Java and other parts of Indonesia. Their leading products are Syrup ABC (fruit syrup), Kecap ABC (sweet soy sauce), and Sambal ABC (hot chili sauce).\n\nNetherlands\n\nHeinz sells many products in the Netherlands; the Elst factory in Gelderland is the primary production facility for Heinz sauces for Western Europe. In 2006, production of both HP Sauce and Daddies was transferred from Birmingham, West Midlands to Elst as a result of the acquisition of HP Foods and the subsequent closure of the Aston factory. Subsequently, Heinz suffered severe supply issues for the ex-HP Foods brands as the Elst factory struggled to integrate production, resulting in significant negative coverage from UK retailers. Heinz was forced to begin bottling sauce in Spain, shipping ready-made sauce from Elst, to get product back into supply.\n\nUnited Kingdom\n\nHeinz is the leading seller of baked beans in the UK, with its beans product lines referred to as Heinz Baked Beans.\n\nThe UK headquarters is in Hayes, London. After opening its first overseas office in London in 1896, the company opened its first UK factory in Peckham, south London in 1905. This was followed by a factory at Harlesden, north-west London in 1919. Bombed twice in World War 2, this factory remained in production until 2000. Production was started at a former munitions factory at Standish near Wigan in 1946, before the new factory at Kitt Green, near Wigan, opened in 1959. Heinz also has an infant food factory in Kendal, Cumbria. The site specializes in baby milks, previously under the brand of Farley's, but now manufactured under the name Heinz Nurture. It has around 200 employees.\n\nHeinz produces oriental foods sold under the Amoy brand, used under license from Ajinomoto Co. Inc., Tokyo, Japan.\n\nIn July 2001, the Food Standards Agency of the Government of the United Kingdom found Heinz canned baked beans products to be contaminated with the hormone disruptor bisphenol.\n\nIn June 2009, a company PR stunt announced they had introduced the prototype of the world's smallest, portable microwave, the \"Beanzawave\". The microwave was to appeal to office workers and students and can be powered by a computer via a USB port. The microwave may be used to heat up coffee or tea, or small food items. It is also good for heating up Heinz's hot snack line, Snap Pots, for which it was designed. The prototype was designed by microwave expert, Gordon Andrews and industrial designer, Stephen Frazer.\n\nIn 2013, the Kitt Green facility was listed as one among the world's five largest manufacturing units by the Discovery Channel (the list comprised Reliance's Jamnagar Refinery, Volkswagen's car plant, Kitt Green Foods plant, NASA's Kennedy Space Center and POSCO's steel plant). It is Europe's largest food factory and turns over more than 1 billion cans every year.\n\nChina\n\nOn February 22, 2013, Sanquan Food, a Chinese frozen food company, signed a contract to purchase LongFong Food, a subsidiary of Heinz Company in China.  With this sale, Heinz (China) will focus on infant foods and sauces in emerging markets such as China. Heinz Hong Kong Limited is the regional office serving for operations in Hong Kong, China and Taiwan. Heinz. http://en.wikipedia.org/?curid=13881."
  }
}
