{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12161",
  "eid" : "00bd1c50-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778510485,
  "textBody" : "Guatemala is the most populous of the Central American countries with a GDP per capita roughly one-third that of Brazil's.http://data.worldbank.org/indicator/NY.GDP.PCAP.CD Coffee, sugar, and bananas are the main products. The 1996 peace accords ended 36 years of civil war and removed a major obstacle to foreign investment, and since then Guatemala has pursued important reforms and macroeconomic stabilization. On 1 July 2006, the Central American Free Trade Agreement (CAFTA) entered into force between the US and Guatemala and has since spurred increased investment in the export sector. The distribution of income remains highly unequal with 12% of the population living below the international poverty line.http://www.unicef.org/infobycountry/guatemala_statistics.html Given Guatemala's large expatriate community in the United States, it is the top remittance recipient in Central America, with inflows being a primary source of foreign income equivalent to nearly two-thirds of exports.\n\nGuatemala's gross domestic product for 1990 was estimated at $19.1 billion, with real growth slowing to approximately 3.3%. Ten years later, in 2000, it rose by 1 to 4% and by 2010 it had fallen back to 3%, according to the World Bank. The final peace accord in December 1996 left Guatemala well-positioned for rapid economic growth over the next 11 years.\n\nGuatemala's economy is dominated by the private sector, which generates about 85% of GDP. Most manufacturing is light assembly and food processing, geared to the domestic, U.S., and Central American markets. In 1990 the labor force participation rate for women was 42%, later increasing by 1% in 2000 to 43% and 51% in 2010. For men, the labor force participation rate in 1990 was about 89%, decreased to 88% in 2000, and  increased up to 90% in 2010 (World Bank). Self-employment for men is about 50%, while the rate for women is about 32% (Pagàn 1).\n\nOver the past several years, tourism and exports of textiles, apparel, and nontraditional agricultural products such as winter vegetables, fruit, and cut flowers have boomed, while more traditional exports such as sugar, bananas, and coffee continue to represent a large share of the export market.Over the past twenty years the percentage of exports of goods and services has fluctuated. In 1990 it was 21% and in 2000, 20%. It increased again in 2010 to 26%. On the other hand, its level of imports of goods and services has continually increased. In 1990 its imports of goods and services was about 25%. In 2000 it increased by 4% up to 29%, and in 2010 it increased up to 36%. Migration is another important avenue in Guatemala. According to Cecilia Menjivar, remittances are “central to the economy.” In 2004 remittances to Guatemala from men’s migration to the U.S. accounted for approximately 97% (Menjivar 2).\n\nThe United States is the country's largest trading partner, providing 36% of Guatemala's imports and receiving 40% of its exports.https://www.cia.gov/library/publications/the-world-factbook/geos/gt.html Retrieved 2 June 2011 The government sector is small and shrinking, with its business activities limited to public utilities—some of which have been privatized—ports and airports and several development-oriented financial institutions. Guatemala was certified to receive export trade benefits under the United States' Caribbean Basin Trade and Partnership Act (CBTPA) in October 2000, and enjoys access to U.S. Generalized System of Preferences (GSP) benefits. Due to concerns over serious worker rights protection issues, however, Guatemala's benefits under both the CBTPA and GSP are currently under review.\n\nMacroeconomic development\n\nGuatemala became more economically developed and stable from 1990-2011. The annual GDP growth rate for Guatemala in 2000 was 3.6%, but just 0.9% in 2009, increasing slightly in 2010 to 2.0%United Nations Development Programme. Human Development Report 2011; Sustainability and Equity: A Better Future For All. New York. 2011.United Nations Development Programme. Assessment of Development Results Evaluation of UNDP Contribution Guatemala. New York. 2009. \nThe poverty rate in Guatemala in 2006 was 54.8%, and the extreme poverty rate was 26.1%. Latin America as a whole had a poverty rate of 33% and an extreme poverty rate of 12.9% in 2009.UNDP Contribution Guatemala. New York. 2009. \nUnited Nations. \nAchieving the Millennium Development Goals With Equality in Latin America and the Caribbean Progress and Challenges. \nNew York. \n2010.\n The data indicate that Guatemala is behind other Latin American countries, in terms of lowering poverty rates, but there has been an increase in economic activity in terms of GDP and development. Guatemala’s HDI increased from 0.462 in 1990, to 0.525 in 2000, to 0.550 in 2005, and 0.574 in 2011.3 Guatemala ranked 131st in HDI in 2011. Other important human development statistics such as the total fertility rate in Guatemala decreased from 4.8 births per woman in 2000 to 4.2 births per woman in 2006. During the same period, life expectancy increased from 67.9 years in 2000, to 69.9 years in 2006.\n\nGlobalization and poverty in Guatemala\n\nGlobalization is the process of economic integration, political policy exchange, transfer of knowledge and ideas, and exchange of culture.Al-Rodhan, Nayef R.F. and Gérard Stoudmann. \"Definitions of Globalization: A Comprehensive Overview and a Proposed Definition.\" Geneva Center for Security Policy: Geneva, 2006. Web. Dec. 3, 2012. Guatemala is becoming more globalized and is growing with an annual GDP growth of 5% in 2006, 6% in 2007, 3% in 2008, 1% in 2009, 3% in 2010 and 3% in 2011.\n\n High poverty levels still persist.\n\nManufacturing (20%), commerce (18%), private services (14%), and agriculture (12%) are the biggest estimated economic sectors in Guatemala. The country's economic structure shows a declining trend in the agricultural sector.\n\n Guatemala is the biggest country in Central America. It has one of the highest disparities between rich and poor as well as one of the highest poverty levels worldwide, with 54% of the population living below the poverty line in 2006 and 54% in 2011.\n\n According to the United Nations Development Programme (UNDP), the Multidimensional Poverty Index (MPI), which looks at multiple deprivations in the same household in regard to education, health and standard of living, found that in 2011, 25.9% of the population experienced multiple deprivations and another 9.8% were vulnerable to such deprivations. A human development report also states that the average percentage of multidimensional poverty in 2011 was 49.1%.\n Guatemala's economy continued expanding in 2014.\n\nPoor women and unpaid work\n\nIn Guatemala in 2010, 31% of the female population was illiterate.Arends, Mary. \"Female Labor Force Participation And Earnings In Guatemala.\" Case studies on women's employment and pay in Latin America.Washington, D.C. (1992): 273-298. EconLit. Web. 23 Sept. 2012. In rural Guatemala, 70.5% are poor; women are more likely to be poor in the more rural areas.\n\n Gammage argues that women in poor households engage more in domestic tasks and undertake more household maintenance, social reproduction and care work than men.\n Similarly, Benería states that the women perform tough work but do not get paid and argues that there is an opportunity cost related, since the women could be paid for other work instead.Benería, Lourdes. Gender, Development, and Globalization. New York: Routledge, 2003. Unpaid household work is associated with the number of people in the household, the location, and the availability of paid employment. Unfortunately, this means that women in rural Guatemala are greater victims of poverty than urban women, and most poverty is found in the rural parts of Guatemala, so Gammage found that many rural women perform unpaid work.\n\nEducated women and the labor force\n\nLabor force participation for women was at 51% in 2010, 50% in 2007, and 44% in 2004. Women have a small pay disadvantage, earning 97% of male wages in most occupations. Gender inequality declines if women have a second and/or third educational degree, and they are treated more equally with their male counterparts. As in many countries, both men and women earn the most if they have a university degree. The percent of women with a steady income increases for women who have completed the secondary level of schooling, but decreases again after university. This means that women earn about the same as men if they both have a secondary education, but after university, men earn more. The situation changes on the professional level, where women earn more than men. Men work more hours in all professions, except in the household, because many women have part-time jobs.\n\nChild labor\n\nChildren in Guatemala are engaged in child labor, primarily in agriculture, according to the U.S. Department of Labor. In fact, 13.4% of children aged 7 to 14 work; 68% of them are in the agricultural sector, 13% in the industrial sector, and 18% in the services sector.[http://www.dol.gov/ilab/reports/child-labor/guatemala.htm Guatemala, 2013 Findings on the Worst Forms of Child Labor] The 2013 DOL report stated that \"Guatemala [...] lacks Government programs targeting sectors in which children are known to engage in exploitative labor, such as domestic service, mining, quarrying, and construction.\"\nIn December 2014, the Department's List of Goods Produced by Child Labor or Forced Labor included mostly agricultural goods produced in such working conditions, namely broccoli, coffee, corn and sugarcane. Guatemala's firework and gravel production also resorted to child labor according to the report.\n\nMaquilas\n\nAmong the most important factors in Guatemala's economy are the significant number of maquila factories, Korean-owned, in the highland of Guatemala. Korean entrepreneurs have adopted a buyer-driven commodity chain process that depends on the existence of a large labor force, low capital investment and low skills. Korea presents itself to Guatemalan industry and to Guatemalan workers by means of subcontractors responsible for delivering finished orders to multiple buyers, mostly located in the United States. Buyers include Macy's and JC Penny and brands such as Liz Claiborne, OshKosh and Tracy Evans.\n\nThe first industries began in 1980s. At first, workers were very interested in the new jobs in the factories, because they offered the opportunity for transition to what was seen as a new and modern world, away from agricultural work. However, in the factories, workers' backs hurt, because they sat for many hours on backless benches in front of sewing machines. Workers would usually enter the plant at 7:00 a.m. and take a 1-hour break for lunch at noon. They were expected to work until 7:00 or 8:00pm in the evening. About 70% of the workers in macula factories were female. Years later, there was a huge turnover. Workers started to leave the macula factories for reasons like stress, bad treatment, poor payment, etc.\n\nEconomic priorities\n\nCurrent economic priorities include:\n* Liberalizing the trade regime;\n* Financial services sector reform;\n* Overhauling Guatemala's public finances;\n* Simplifying the tax structure, enhancing tax compliance, and broadening the tax base.\n* Improving the investment climate through procedural and regulatory simplification and adopting a goal of concluding treaties to protect investment and intellectual property rights.\n\nImport tariffs have been lowered in conjunction with Guatemala's Central American neighbors so that most fall between 0% and 15%, with further reductions planned. Responding to Guatemala's changed political and economic policy environment, the international community has mobilized substantial resources to support the country's economic and social development objectives. The United States, along with other donor countries—especially France, Italy, Spain, Germany, Japan, and the international financial institutions—have increased development project financing. Donors' response to the need for international financial support funds for implementation of the Peace Accords is, however, contingent upon Guatemalan government reforms and counterpart financing.\n\nProblems hindering economic growth include high crime rates, illiteracy and low levels of education, and an inadequate and underdeveloped capital market. They also include lack of infrastructure, particularly in the transportation, telecommunications, and electricity sectors, although the state telephone company and electricity distribution were privatized in 1998. The distribution of income and wealth remains highly skewed. The wealthiest 10% of the population receives almost one-half of all income, and the top 20% receives two-thirds of all income. As a result, approximately 29% of the population lives in poverty, and 6% of that number live in extreme poverty. Guatemala's social indicators, such as infant mortality and illiteracy, are successively improving, but remain in low growth and are still among the worst in the hemisphere. In 2000 the percentage of girls completing primary school was approximately 52%. That percentage rose in 2010 to about 81%. The completion rate in primary school for boys in 2000 was 63% and rose to 87% in 2010.\n\nIn 2005 Guatemala ratified its signature to the Dominican Republic-Central America Free Trade Agreement (DR-CAFTA) between the United States and several other Central American countries.\n\n2009 food crisis\n\nIn September 2009, Guatemalan President Alvaro Colom declared that lack of food and proper nutrition were a national emergency. Colom stated that the situation is the combined result of a severe drought and  global warming, which have reduced the domestic food supply, and the Global financial crisis, which has reduced Guatemala's ability to import food. Colom said the government would immediately seek assistance from the international community for emergency food supplies.[http://www.cnn.com/2009/WORLD/americas/09/09/guatemala.calamity/index.html Guatemala declares calamity as food crisis grows], CNN.com, 9 September 2009.\n\nA number of international organizations expressed concern about Guatemala's current economic status in 2009. The United Nations World Food Programme (WFP) and the World Bank reported the following:\n\n*Guatemala has the fourth highest rate of chronic malnutrition in the world and the highest in the western hemisphere.\n*Approximately 75% of Guatemalans live below the poverty level, which is defined as an income that is not sufficient to purchase a basic basket of goods and basic services.\n*Approximately 58% of the population have incomes below the extreme poverty line, which is defined as the amount needed to purchase a basic basket of food.\n*Approximately 50% of Guatemalan children under the age of 5 now suffer from chronic under-nutrition.\n*In the nation's highlands, where many indigenous people live, 70% of children under age 5 are malnourished.\n\nAgriculture\n\nGuatemala is the world leader in Cardamom production and export. As of 2013, demand for biofuels has resulted in diversion of land from subsistence agriculture to sugar cane and African Palm plantations. Much of the land is owned by large landlords. Due to legal requirements for production of biofuels in the United States the price of maize, a Guatemalan staple, has risen sharply.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Economy of Guatemala" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12161" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Guatemala is the most populous of the Central American countries with a GDP per capita roughly one-third that of Brazil's.http://data.worldbank.org/indicator/NY.GDP.PCAP.CD Coffee, sugar, and bananas are the main products. The 1996 peace accords ended 36 years of civil war and removed a major obstacle to foreign investment, and since then Guatemala has pursued important reforms and macroeconomic stabilization. On 1 July 2006, the Central American Free Trade Agreement (CAFTA) entered into force between the US and Guatemala and has since spurred increased investment in the export sector. The distribution of income remains highly unequal with 12% of the population living below the international poverty line.http://www.unicef.org/infobycountry/guatemala_statistics.html Given Guatemala's large expatriate community in the United States, it is the top remittance recipient in Central America, with inflows being a primary source of foreign income equivalent to nearly two-thirds of exports.\n\nGuatemala's gross domestic product for 1990 was estimated at $19.1 billion, with real growth slowing to approximately 3.3%. Ten years later, in 2000, it rose by 1 to 4% and by 2010 it had fallen back to 3%, according to the World Bank. The final peace accord in December 1996 left Guatemala well-positioned for rapid economic growth over the next 11 years.\n\nGuatemala's economy is dominated by the private sector, which generates about 85% of GDP. Most manufacturing is light assembly and food processing, geared to the domestic, U.S., and Central American markets. In 1990 the labor force participation rate for women was 42%, later increasing by 1% in 2000 to 43% and 51% in 2010. For men, the labor force participation rate in 1990 was about 89%, decreased to 88% in 2000, and  increased up to 90% in 2010 (World Bank). Self-employment for men is about 50%, while the rate for women is about 32% (Pagàn 1).\n\nOver the past several years, tourism and exports of textiles, apparel, and nontraditional agricultural products such as winter vegetables, fruit, and cut flowers have boomed, while more traditional exports such as sugar, bananas, and coffee continue to represent a large share of the export market.Over the past twenty years the percentage of exports of goods and services has fluctuated. In 1990 it was 21% and in 2000, 20%. It increased again in 2010 to 26%. On the other hand, its level of imports of goods and services has continually increased. In 1990 its imports of goods and services was about 25%. In 2000 it increased by 4% up to 29%, and in 2010 it increased up to 36%. Migration is another important avenue in Guatemala. According to Cecilia Menjivar, remittances are “central to the economy.” In 2004 remittances to Guatemala from men’s migration to the U.S. accounted for approximately 97% (Menjivar 2).\n\nThe United States is the country's largest trading partner, providing 36% of Guatemala's imports and receiving 40% of its exports.https://www.cia.gov/library/publications/the-world-factbook/geos/gt.html Retrieved 2 June 2011 The government sector is small and shrinking, with its business activities limited to public utilities—some of which have been privatized—ports and airports and several development-oriented financial institutions. Guatemala was certified to receive export trade benefits under the United States' Caribbean Basin Trade and Partnership Act (CBTPA) in October 2000, and enjoys access to U.S. Generalized System of Preferences (GSP) benefits. Due to concerns over serious worker rights protection issues, however, Guatemala's benefits under both the CBTPA and GSP are currently under review.\n\nMacroeconomic development\n\nGuatemala became more economically developed and stable from 1990-2011. The annual GDP growth rate for Guatemala in 2000 was 3.6%, but just 0.9% in 2009, increasing slightly in 2010 to 2.0%United Nations Development Programme. Human Development Report 2011; Sustainability and Equity: A Better Future For All. New York. 2011.United Nations Development Programme. Assessment of Development Results Evaluation of UNDP Contribution Guatemala. New York. 2009. \nThe poverty rate in Guatemala in 2006 was 54.8%, and the extreme poverty rate was 26.1%. Latin America as a whole had a poverty rate of 33% and an extreme poverty rate of 12.9% in 2009.UNDP Contribution Guatemala. New York. 2009. \nUnited Nations. \nAchieving the Millennium Development Goals With Equality in Latin America and the Caribbean Progress and Challenges. \nNew York. \n2010.\n The data indicate that Guatemala is behind other Latin American countries, in terms of lowering poverty rates, but there has been an increase in economic activity in terms of GDP and development. Guatemala’s HDI increased from 0.462 in 1990, to 0.525 in 2000, to 0.550 in 2005, and 0.574 in 2011.3 Guatemala ranked 131st in HDI in 2011. Other important human development statistics such as the total fertility rate in Guatemala decreased from 4.8 births per woman in 2000 to 4.2 births per woman in 2006. During the same period, life expectancy increased from 67.9 years in 2000, to 69.9 years in 2006.\n\nGlobalization and poverty in Guatemala\n\nGlobalization is the process of economic integration, political policy exchange, transfer of knowledge and ideas, and exchange of culture.Al-Rodhan, Nayef R.F. and Gérard Stoudmann. \"Definitions of Globalization: A Comprehensive Overview and a Proposed Definition.\" Geneva Center for Security Policy: Geneva, 2006. Web. Dec. 3, 2012. Guatemala is becoming more globalized and is growing with an annual GDP growth of 5% in 2006, 6% in 2007, 3% in 2008, 1% in 2009, 3% in 2010 and 3% in 2011.\n\n High poverty levels still persist.\n\nManufacturing (20%), commerce (18%), private services (14%), and agriculture (12%) are the biggest estimated economic sectors in Guatemala. The country's economic structure shows a declining trend in the agricultural sector.\n\n Guatemala is the biggest country in Central America. It has one of the highest disparities between rich and poor as well as one of the highest poverty levels worldwide, with 54% of the population living below the poverty line in 2006 and 54% in 2011.\n\n According to the United Nations Development Programme (UNDP), the Multidimensional Poverty Index (MPI), which looks at multiple deprivations in the same household in regard to education, health and standard of living, found that in 2011, 25.9% of the population experienced multiple deprivations and another 9.8% were vulnerable to such deprivations. A human development report also states that the average percentage of multidimensional poverty in 2011 was 49.1%.\n Guatemala's economy continued expanding in 2014.\n\nPoor women and unpaid work\n\nIn Guatemala in 2010, 31% of the female population was illiterate.Arends, Mary. \"Female Labor Force Participation And Earnings In Guatemala.\" Case studies on women's employment and pay in Latin America.Washington, D.C. (1992): 273-298. EconLit. Web. 23 Sept. 2012. In rural Guatemala, 70.5% are poor; women are more likely to be poor in the more rural areas.\n\n Gammage argues that women in poor households engage more in domestic tasks and undertake more household maintenance, social reproduction and care work than men.\n Similarly, Benería states that the women perform tough work but do not get paid and argues that there is an opportunity cost related, since the women could be paid for other work instead.Benería, Lourdes. Gender, Development, and Globalization. New York: Routledge, 2003. Unpaid household work is associated with the number of people in the household, the location, and the availability of paid employment. Unfortunately, this means that women in rural Guatemala are greater victims of poverty than urban women, and most poverty is found in the rural parts of Guatemala, so Gammage found that many rural women perform unpaid work.\n\nEducated women and the labor force\n\nLabor force participation for women was at 51% in 2010, 50% in 2007, and 44% in 2004. Women have a small pay disadvantage, earning 97% of male wages in most occupations. Gender inequality declines if women have a second and/or third educational degree, and they are treated more equally with their male counterparts. As in many countries, both men and women earn the most if they have a university degree. The percent of women with a steady income increases for women who have completed the secondary level of schooling, but decreases again after university. This means that women earn about the same as men if they both have a secondary education, but after university, men earn more. The situation changes on the professional level, where women earn more than men. Men work more hours in all professions, except in the household, because many women have part-time jobs.\n\nChild labor\n\nChildren in Guatemala are engaged in child labor, primarily in agriculture, according to the U.S. Department of Labor. In fact, 13.4% of children aged 7 to 14 work; 68% of them are in the agricultural sector, 13% in the industrial sector, and 18% in the services sector.[http://www.dol.gov/ilab/reports/child-labor/guatemala.htm Guatemala, 2013 Findings on the Worst Forms of Child Labor] The 2013 DOL report stated that \"Guatemala [...] lacks Government programs targeting sectors in which children are known to engage in exploitative labor, such as domestic service, mining, quarrying, and construction.\"\nIn December 2014, the Department's List of Goods Produced by Child Labor or Forced Labor included mostly agricultural goods produced in such working conditions, namely broccoli, coffee, corn and sugarcane. Guatemala's firework and gravel production also resorted to child labor according to the report.\n\nMaquilas\n\nAmong the most important factors in Guatemala's economy are the significant number of maquila factories, Korean-owned, in the highland of Guatemala. Korean entrepreneurs have adopted a buyer-driven commodity chain process that depends on the existence of a large labor force, low capital investment and low skills. Korea presents itself to Guatemalan industry and to Guatemalan workers by means of subcontractors responsible for delivering finished orders to multiple buyers, mostly located in the United States. Buyers include Macy's and JC Penny and brands such as Liz Claiborne, OshKosh and Tracy Evans.\n\nThe first industries began in 1980s. At first, workers were very interested in the new jobs in the factories, because they offered the opportunity for transition to what was seen as a new and modern world, away from agricultural work. However, in the factories, workers' backs hurt, because they sat for many hours on backless benches in front of sewing machines. Workers would usually enter the plant at 7:00 a.m. and take a 1-hour break for lunch at noon. They were expected to work until 7:00 or 8:00pm in the evening. About 70% of the workers in macula factories were female. Years later, there was a huge turnover. Workers started to leave the macula factories for reasons like stress, bad treatment, poor payment, etc.\n\nEconomic priorities\n\nCurrent economic priorities include:\n* Liberalizing the trade regime;\n* Financial services sector reform;\n* Overhauling Guatemala's public finances;\n* Simplifying the tax structure, enhancing tax compliance, and broadening the tax base.\n* Improving the investment climate through procedural and regulatory simplification and adopting a goal of concluding treaties to protect investment and intellectual property rights.\n\nImport tariffs have been lowered in conjunction with Guatemala's Central American neighbors so that most fall between 0% and 15%, with further reductions planned. Responding to Guatemala's changed political and economic policy environment, the international community has mobilized substantial resources to support the country's economic and social development objectives. The United States, along with other donor countries—especially France, Italy, Spain, Germany, Japan, and the international financial institutions—have increased development project financing. Donors' response to the need for international financial support funds for implementation of the Peace Accords is, however, contingent upon Guatemalan government reforms and counterpart financing.\n\nProblems hindering economic growth include high crime rates, illiteracy and low levels of education, and an inadequate and underdeveloped capital market. They also include lack of infrastructure, particularly in the transportation, telecommunications, and electricity sectors, although the state telephone company and electricity distribution were privatized in 1998. The distribution of income and wealth remains highly skewed. The wealthiest 10% of the population receives almost one-half of all income, and the top 20% receives two-thirds of all income. As a result, approximately 29% of the population lives in poverty, and 6% of that number live in extreme poverty. Guatemala's social indicators, such as infant mortality and illiteracy, are successively improving, but remain in low growth and are still among the worst in the hemisphere. In 2000 the percentage of girls completing primary school was approximately 52%. That percentage rose in 2010 to about 81%. The completion rate in primary school for boys in 2000 was 63% and rose to 87% in 2010.\n\nIn 2005 Guatemala ratified its signature to the Dominican Republic-Central America Free Trade Agreement (DR-CAFTA) between the United States and several other Central American countries.\n\n2009 food crisis\n\nIn September 2009, Guatemalan President Alvaro Colom declared that lack of food and proper nutrition were a national emergency. Colom stated that the situation is the combined result of a severe drought and  global warming, which have reduced the domestic food supply, and the Global financial crisis, which has reduced Guatemala's ability to import food. Colom said the government would immediately seek assistance from the international community for emergency food supplies.[http://www.cnn.com/2009/WORLD/americas/09/09/guatemala.calamity/index.html Guatemala declares calamity as food crisis grows], CNN.com, 9 September 2009.\n\nA number of international organizations expressed concern about Guatemala's current economic status in 2009. The United Nations World Food Programme (WFP) and the World Bank reported the following:\n\n*Guatemala has the fourth highest rate of chronic malnutrition in the world and the highest in the western hemisphere.\n*Approximately 75% of Guatemalans live below the poverty level, which is defined as an income that is not sufficient to purchase a basic basket of goods and basic services.\n*Approximately 58% of the population have incomes below the extreme poverty line, which is defined as the amount needed to purchase a basic basket of food.\n*Approximately 50% of Guatemalan children under the age of 5 now suffer from chronic under-nutrition.\n*In the nation's highlands, where many indigenous people live, 70% of children under age 5 are malnourished.\n\nAgriculture\n\nGuatemala is the world leader in Cardamom production and export. As of 2013, demand for biofuels has resulted in diversion of land from subsistence agriculture to sugar cane and African Palm plantations. Much of the land is owned by large landlords. Due to legal requirements for production of biofuels in the United States the price of maize, a Guatemalan staple, has risen sharply. Economy of Guatemala. http://en.wikipedia.org/?curid=12161."
  }
}
