{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19031",
  "eid" : "372db9c0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778601820,
  "textBody" : "Maltese () is the national language of Malta and a co-official language of the country alongside English, while also serving as an official language of the European Union, the only Semitic language so distinguished. Maltese is descended from Siculo-Arabic, the extinct variety of Arabic that developed in Sicily and was later introduced to Malta, between the end of the ninth century and the end of the twelfth century AD. Maltese has evolved independently of Literary Arabic and its varieties into a standardized language over the past 800 years in a gradual process of Latinisation. Maltese is therefore considered an exceptional branch of Arabic that has no diglossic relationship with Standard Arabic or Classical Arabic. Maltese is also unique among Semitic languages since its morphology has been deeply influenced by Romance languages, namely Italian and Sicilian. \n\nThe original Semitic base (Siculo-Arabic) comprises around one-third of the Maltese vocabulary, especially words that denote basic ideas and the function words, but about half of the vocabulary is derived from standard Italian and Sicilian;  and English words make up between 6% and 20% of the vocabulary. A recent study shows that, in terms of basic everyday language, speakers of Maltese are able to understand less than a third of what is said to them in Tunisian Arabic, which is related to Siculo-Arabic,Borg, Albert J.; Azzopardi-Alexander, Marie (1997). Maltese. Routledge. . whereas speakers of Tunisian are able to understand about 40% of what is said to them in Maltese. This reported level of asymmetric intelligibility is considerably lower than the mutual intelligibility found between Arabic dialects. \n\nMaltese has always been written in the Latin script, the earliest surviving example dating from the late Middle Ages. It remains the only  standardized Semitic language written in the Latin script.\n\nHistory\n\nThe origins of the Maltese language are attributed to the arrival, early in the eleventh century, of settlers from neighbouring Sicily, where Siculo-Arabic was spoken, following the Fatimid Caliphate's conquest of the island at the end of the ninth century.  This claim has been corroborated by genetic studies, which show that contemporary Maltese people share common ancestry with Sicilians and Calabrians, with little genetic input from North Africa and the Levant.[http://www.timesofmalta.com/articles/view/20070805/opinion/genetic-origin-of-contemporary-maltese.9032 A.E. Felice; \"The Genetic Origin of Contemporary Maltese,\"] The Sunday Times of Malta,5 August 2007.[http://www.familytreedna.com/pdf/capelli2005.pdf C. Capelli, N. Redhead, N. Novelletto, L. Terrenato, P. Malaspina, Z. Poulli, G. Lefranc, A. Megarbane, V. Delague, V. Romano, F. Cali, V.F. Pascali, M. Fellous, A.E. Felice, and D.B. Goldstein; \"Population Structure in the Mediterranean Basin: A Y Chromosome Perspective,\"] Annals of Human Genetics, 69, 1-20, 2005. Last visited August 8, 2007.\n\nThe Norman conquest in 1090, followed by the expulsion of the Muslims (complete by 1249) permanently isolated the vernacular from its Arabic source, creating the conditions for its evolution into a distinct language. In contrast to Sicily (where Siculo-Arabic became extinct, replaced by Sicilian), the vernacular in Malta continued to develop alongside Italian, eventually replacing it as official language in 1934 (alongside English).\n\nThe first written reference to the Maltese language is in a will of 1436, where it is called lingua maltensi. The oldest known document in Maltese is \"Il Cantilena\" (Xidew il-Qada) by Pietru Caxaro. It dates from the 15th century.\n\nThe earliest known Maltese dictionary was a sixteenth-century manuscript entitled \"Maltese-Italiano\"; it was included in the Biblioteca Maltese of Mifsud in 1764, but is now lost. A list of Maltese words was included in both the Thesaurus Polyglottus (1603) and Propugnaculum Europae (1606) of Hieronymus Megiser, who had visited Malta in 1588–89; Domenico Magri gave the etymologies of some Maltese words in his Hierolexicon, sive sacrum dictionarium (1677). An early manuscript dictionary, Dizionario Italiano e Maltese, was discovered in the Biblioteca Vallicelliana in Rome in the 1980s, together with a grammar, the Regole per la Lingua Maltese, attributed to a French Knight named Thezan.Dionisius A. Agius (1990). [https://www.jstor.org/stable/194709 Review article: Al-Miklem Malti: A Contribution to Arabic Lexical Dialectology]. Bulletin (British Society for Middle Eastern Studies) 17 (2): 171-180. Arnold Cassola (2012). [http://imsmr.or.kr/cont/103/File_Upload/050101.pdf Italo-Maltese Relations (ca. 1150 -1936): People, Culture, Literature, Language] . Mediterranean Review 5 (1): 1–20. The first systematic lexicon is that of Giovanni Pietro Francesco Agius de Soldanis, who also wrote the first systematic grammar of the language and proposed a standard orthography.\n\nDemographics\n\nIn 1975, there were an estimated 371,000 Maltese speakers, of whom 300,000 resided in Malta. Thousands of Maltese emigrants in Australia, Canada, Italy, the United Kingdom, and the United States still speak the language, and in 2007 it was reported that Maltese is still spoken by descendants of Maltese immigrants in Tunisia.\n\nIndeed, nowadays  people across the world speak Maltese, while Malta has a population of only 445,426 people, which means that the remaining figure of 76,574 people can be attributed to the Maltese diaspora.   [https://web.archive.org/web/20131203033602/http://www.nso.gov.mt/site/page.aspx?pageid\n588 Census 2011]. National Statistics Office, Malta\n\nClassification\n\nMaltese is descended from Siculo-Arabic, a Semitic language within the Afroasiatic family,C.F. & F.M. Voegelin. 1977. Classification and Index of the World's Languages. Elsevier.Merritt Ruhlen.  1991.  A Guide to the World's Languages, Volume 1: Classification. Stanford.David Dalby.  2000. The Linguasphere Register of the World's Languages and Speech Communities. Linguasphere Observatory.Gordon, Raymond G., Jr., ed.  2005.  Ethnologue: Languages of the World.  15th ed.  Summer Institute of Linguistics.Alan S. Kaye & Judith Rosenhouse.  1997.  \"Arabic Dialects and Maltese\", The Semitic Languages. Ed. Robert Hetzron. Routledge. Pages 263–311. that in the course of its history has been influenced by Sicilian and Italian, to a lesser extent French, and more recently English. Today, the core vocabulary (including both the most commonly used vocabulary and function words) is Semitic, with large numbers of loanwords. Because of the Sicilian influence on Siculo-Arabic, Maltese has many language contact features and is most commonly described as a language with a large number of loanwords.\n\nThe Maltese language has historically been classified in various ways, with some claiming that the ancient Punic language (another Semitic language) was its origin instead of Siculo-Arabic, while others believed the language to be one of the Berber languages (another family within Afroasiatic), and under the Fascist Kingdom of Italy, it was classified as regional Italian.\n\nPhonology\n\nConsonants\n\nVoiceless stops are only lightly aspirated and voiced stops are fully voiced. Voicing is carried over from the last segment in obstruent clusters; thus, two- and three-obstruent clusters are either voiceless or voiced throughout, e.g. is realised \"we write\". Maltese has final-obstruent devoicing of voiced obstruents and voiceless stops have no audible release, making voiceless–voiced pairs phonetically indistinguishable.\n\nGemination is distinctive word-medially and word-finally in Maltese. The distinction is most rigid intervocalically after a stressed vowel. Stressed, word-final closed syllables with short vowels end in a long consonant, and those with a long vowel in a single consonant; the only exception is where historic and meant the compensatory lengthening of the succeeding vowel. Some speakers have lost length distinction in clusters.\n\nThe two nasals and assimilate for place of articulation in clusters. and are usually dental, whereas are all alveolar. are found mostly in words of Italian origin, retaining length (if not word-initial). and are only found in loanwords, e.g. \"newspaper\" and \"television\". The pharyngeal fricative is velar or glottal for some speakers.\n\nVowels\n\nMaltese has five short vowels,, written a e i o u; six long vowels,, written a e ie i o u; and seven diphthongs: both written għi,  both written għu, and written ew iw oj.\n\nStress\n\nStress is generally on the penultimate syllable, unless some other syllable is heavy (has a long vowel or final consonant), or unless a stress-shifting suffix is added. (Suffixes marking gender, possession, and verbal plurals do not cause the stress to shift.)\n\nWhen two syllables are equally heavy, the penultimate takes the stress, but otherwise the heavier syllable does, e.g. bajjad 'he painted' vs bajjad 'a painter'.\n\nHistorical phonology\n\nMany Classical Arabic consonants underwent mergers and modifications in Maltese:\n\nOrthography\n\nAlphabet\n\nThe modern system of Maltese orthography was introduced in 1924.\nBelow is the Maltese alphabet, with IPA symbols and approximate English pronunciation:\n\nFinal vowels with grave accents (à, è, ì, ò, ù) are also found in some Maltese words of Italian origin, such as libertà (\"freedom\"), sigurtà (old Italian: sicurtà, \"security\"), or soċjetà (Italian: società, \"society\").\n\nThe official rules governing the structure of the Maltese language are found in the official guidebook issued by the Akkademja tal-Malti, the Academy of the Maltese language, which is named  Tagħrif fuq il-Kitba Maltija, that is, Knowledge on Writing in Maltese. The first edition of this book was printed in 1924 by the Maltese government's printing press. The rules were further expanded in the 1984 book, iż-Żieda mat-Tagħrif, which focused mainly on the increasing influence of Romance and English words. In 1992 the Academy issued the Aġġornament tat-Tagħrif fuq il-Kitba Maltija, which updated the previous works. All these works were included in a revised and expanded guidebook published in 1996.\n\nThe National Council for the Maltese Language (KNM) is the main regulator of the Maltese language (see Maltese Language Act, below) and not the Akkademja tal-Malti. However, these orthography rules are still valid and official.\n\nWritten Maltese\n\nSince Maltese evolved after the Italo-Normans ended the Arab rule of the islands, a written form of the language was not developed for a long time after the Arabs' expulsion in the middle of the thirteenth century. Under the rule of the Knights Hospitaller, both French and Italian were used for official documents and correspondence. During the British colonial period, the use of English was encouraged through education, with Italian regarded as the next-most important language.\n\nIn 1934, Maltese was recognised as an official language. In the late eighteenth century and throughout the nineteenth century, philologists and academics such as Mikiel Anton Vassalli made a concerted effort to standardize written Maltese. Many examples of written Maltese exist from before this period, always in the Latin alphabet, Il Cantilena  being the earliest example of written Maltese.\n\nSample\n\nFrom the [http://europa.eu/eu-law/decision-making/treaties/pdf/treaty_establishing_a_constitution_for_europe/treaty_establishing_a_constitution_for_europe_mt.pdf Treaty establishing a Constitution for Europe]:\n\nVocabulary\n\nAlthough the original vocabulary of the language was Siculo-Arabic, it has incorporated a large number of borrowings from Romance sources of influence (Sicilian, Italian, and French), and more recently Germanic ones (from English).\n\nThe historical source of modern Maltese vocabulary is 52% Italian/Sicilian, 32% Siculo-Arabic, and 6% English, with some of the remainder being French.[http://www.translationsmalta.com/page.aspx?pid=22 About Malta]; GTS; retrieved on 2008-02-24 Today, most function words are Semitic. In this way, it is similar to English, which is a Germanic language that had large influence from Norman French. As a result of this, Romance language-speakers may easily be able to comprehend more complex ideas expressed in Maltese, such as \"Ġeografikament, l-Ewropa hi parti tas-superkontinent ta' l-Ewrasja\" (Geographically, Europe is part of the Supercontinent of Eurasia), while not understanding a single word of a simple sentence such as \"Ir-raġel qiegħed fid-dar\" (The man is in the house), which would be easily understood by any Arabic speaker.\n\nRomance\n\nAn analysis of the etymology of the 41,000 words in Aquilina's Maltese-English Dictionary shows that words of Romance origin make up 52% of the Maltese vocabulary, although other sources claim from as low as 40%, to as high as 55%.http://google.com/search?q\ncache:DMnjEhi4EicJ:www.anglistik.uni-freiburg.de/Englisches_Seminar/Lehrstuehle/LS_Kortmann/FoL/index_html/2008-03-17.8198766048+Maltese+55%25+Romance&hlen&ct\nclnk&cd5&client\nsafari These vocabularies tend to deal with more complicated concepts. They are mostly derived from Sicilian and thus exhibit Sicilian phonetic characteristics, such as in place of, and in place of (e.g. tiatru not teatro and fidi not fede). Also, as with Old Sicilian, (English 'sh') is written 'x' and this produces spellings such as: ambaxxata ('embassy'), xena ('scene' cf. Italian ambasciata, scena).\n\nA tendency in modern Maltese is to adopt further influences from English and Italian.\nComplex Latinate English words adopted into Maltese are often given Italianate or Sicilianate forms, even if the resulting words do not appear in either of those languages. For instance, the words \"evaluation\", \"industrial action\", and \"chemical armaments\" become \"evalwazzjoni\", \"azzjoni industrjali\", and \"armamenti kimiċi\" in Maltese, while the Italian terms are valutazione, vertenza sindacale, and armi chimiche respectively. English words of Germanic origin are generally preserved relatively unchanged.\n\nSiculo-Arabic\n\nSiculo-Arabic is the ancestor of the Maltese language, and supplies between 32% and 40% of the language's vocabulary.\n\n found that 40% of a sample of 1,820 Quranic Arabic roots were found in Maltese, a lower percentage than found in Moroccan (58%) and Lebanese Arabic (72%). An analysis of the etymology of the 41,000 words in Aquilina's Maltese-English Dictionary shows that 32% of the Maltese vocabulary is of Arabic origin, although another source claims 40%.Compare with approx. 25–33% of Old English or Germanic words in Modern English. Usually, words expressing basic concepts and ideas, such as ' (man), ' (woman), ' (boy), ' (house), ' (sun), ' (summer), are of Arabic origin. Moreover,  in Maltese tend to aim mainly at diction belonging to this group.\n\nThe Maltese language has merged many of the original Arabic consonants, in particular the emphatic consonants, with others that are common in European languages. Thus, original Arabic,, and all merged into Maltese. The vowels, however, separated from the three in Arabic to five, as is more typical of other European languages. Some unstressed short vowels have been elided. The common Arabic greeting ' is cognate with ' in Maltese (lit. the peace for you, peace be with you), as are similar greetings in other Semitic languages (e.g. ' in Hebrew).\n\nSince the attested vocabulary of Siculo-Arabic is limited, the following table compares cognates in Maltese and some other varieties of Arabic (all forms are written phonetically, as in the source):Alan S. Kaye & Judith Rosenhouse.  1997.  \"Arabic Dialects and Maltese\", The Semitic Languages. Routledge. Pp. 263–311.\n\nEnglish\n\nIt is estimated that English loanwords, which are becoming more commonplace, make up 20% of the Maltese vocabulary, although other sources claim amounts as low as 6%. This percentage discrepancy is due to the fact that a number of new English loanwords are sometimes not officially considered part of the Maltese vocabulary; hence, they are not included in certain dictionaries. Also, English loanwards of Latinate origin are very often Italianised, as discussed above. English loanwords are generally transliterated, although standard English pronunciation is virtually always retained. Below are a few examples:\n\nNote \"fridge\", which is a slang term derived from \"refrigerator\", a Latinate word which might be expected to be rendered as rifriġeratori (Italian uses a different word: frigorifero).\n\nGrammar\n\nMaltese grammar is fundamentally derived from Siculo-Arabic, although Romance and English noun pluralization patterns are also used on borrowed words.\n\nAdjectives and adverbs\n\nAdjectives follow nouns. There are no separately formed native adverbs, and word order is fairly flexible. Both nouns and adjectives of Semitic origin take the definite article (for example, It-tifel il-kbir, lit. \"The boy the elder\"=\"The elder boy\"). This rule does not apply to adjectives of Romance origin.\n\nNouns\n\nNouns are pluralized and also have a dual marker.  Semitic plurals are complex; if they are regular, they are marked by -iet/-ijiet, e.g., art, artijiet \"lands (territorial possessions or property)\" (cf. Arabic -at and Hebrew -ot/-oth) or -in (cf. Arabic -īn and Hebrew -im). If irregular, they fall in the pluralis fractus category, in which a word is pluralized by internal vowel changes: ktieb, kotba \" book\", \"books\"; raġel, irġiel \"man\", \"men\".\n\nWords of Romance origin are usually pluralized in two manners: addition of -i or -jiet. For example, lingwa, lingwi \"languages\", from Sicilian lingua, lingui.\n\nWords of English origin are pluralized by adding either an \"-s\" or \"-jiet\", for example, friġġ, friġis from the word fridge.  Some words can be pluralized with either of the suffixes to denote the plural.  A few words borrowed from English can amalgamate both suffixes, like brikksa from the English brick, which can adopt either collective form brikks or the plural form brikksiet.\n\nArticle\n\nThe proclitic il- is the definite article, equivalent to \"the\" in English and \"al-\" in Arabic.\n\nThe Maltese article becomes l- before or after a vowel.\n* l-omm (the mother)\n* rajna l-Papa (we saw the Pope)\n* il-missier (the father)\n\nThe Maltese article assimilates to a following coronal consonant (called konsonanti xemxin \"sun consonants\"), namely:\n* Ċ iċ-ċikkulata (the chocolate)\n* D id-dar (the house)\n* N in-nar (the fire)\n* R ir-razzett (the farm)\n* S is-serrieq (the saw)\n* T it-tifel (the boy)\n* X ix-xemx (the sun)\n* Ż iż-żarbun (the shoe)\n* Z iz-zalzett (the sausage)\n\nMaltese il- is coincidentally identical in pronunciation to the one of the Italian masculine articles, il, which is also l’ before, but not after, a vowel. Consequently, many nouns borrowed from Standard Italian did not change their original article when used in Maltese. Romance vocabulary taken from Sicilian did change where the Sicilian articles u and a, before a consonant, are used.\nIn spite of its Romance appearance, il- is related to the Arabic article al-.\n\nVerbs\n\nVerbs show a triliteral Semitic pattern, in which a verb is conjugated with prefixes, suffixes, and infixes (for example ktibna, Arabic katabna, Hebrew kathabhnu (Modern Hebrew: katavnu) \"we wrote\"). There are two tenses: present and perfect.  The Maltese verb system incorporates Romance verbs and adds Maltese suffixes and prefixes to them (for example, iddeċidejna \"we decided\" ← (i)ddeċieda \"decide\", a Romance verb + -ejna, a Maltese first person plural perfect marker).\n\nDialects\n\nUrban varieties of Maltese are closer to Standard Maltese than rural varieties,Isserlin. Studies in Islamic History and Civilization. BRILL 1986,  which have some characteristics that distinguish them from Standard Maltese. They tend to show some archaic features such as the realization of kh and gh and the imāla of Arabic ā into ē (or ī especially in Gozo)-considered archaic because they are reminiscent of 15th century transcriptions of this sound.  Another archaic feature is the realization of Standard Maltese ā as ō in rural dialects. There is also a tendency to diphthongize simple vowels, e.g., ū becomes eo or eu.  Rural dialects also tend to employ more Semitic roots and broken plurals than Standard Maltese.  In general, rural Maltese is less distant from its Siculo-Arabic ancestor than Standard Maltese.\n\nMedia\n\nWith Malta being a multilingual country, the usage of Maltese in the mass media is shared with other European languages, namely English and Italian. The majority of television stations broadcast from Malta in English or Maltese, although broadcasts from Italy in Italian are also received on the islands. Similarly, there are more Maltese-language radio programs than English ones broadcast from Malta, but again, as with television, Italian broadcasts are also picked up. Maltese generally receives equal usage in newspaper periodicals to English.\n\nBy early 2000s, the use of the Maltese language on the Internet is uncommon, and the number of websites written in Maltese are few. In a survey of Maltese cultural websites conducted in 2004 on behalf of the Maltese Government, 12 of 13 were in English only, while the remaining one was multilingual but did not include Maltese.\n\nCode-switching\n\nThe Maltese population, being fluent in both Maltese and English, displays code-switching (referred to as Maltenglish) in certain localities and between certain social groups.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Maltese language" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19031" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Maltese () is the national language of Malta and a co-official language of the country alongside English, while also serving as an official language of the European Union, the only Semitic language so distinguished. Maltese is descended from Siculo-Arabic, the extinct variety of Arabic that developed in Sicily and was later introduced to Malta, between the end of the ninth century and the end of the twelfth century AD. Maltese has evolved independently of Literary Arabic and its varieties into a standardized language over the past 800 years in a gradual process of Latinisation. Maltese is therefore considered an exceptional branch of Arabic that has no diglossic relationship with Standard Arabic or Classical Arabic. Maltese is also unique among Semitic languages since its morphology has been deeply influenced by Romance languages, namely Italian and Sicilian. \n\nThe original Semitic base (Siculo-Arabic) comprises around one-third of the Maltese vocabulary, especially words that denote basic ideas and the function words, but about half of the vocabulary is derived from standard Italian and Sicilian;  and English words make up between 6% and 20% of the vocabulary. A recent study shows that, in terms of basic everyday language, speakers of Maltese are able to understand less than a third of what is said to them in Tunisian Arabic, which is related to Siculo-Arabic,Borg, Albert J.; Azzopardi-Alexander, Marie (1997). Maltese. Routledge. . whereas speakers of Tunisian are able to understand about 40% of what is said to them in Maltese. This reported level of asymmetric intelligibility is considerably lower than the mutual intelligibility found between Arabic dialects. \n\nMaltese has always been written in the Latin script, the earliest surviving example dating from the late Middle Ages. It remains the only  standardized Semitic language written in the Latin script.\n\nHistory\n\nThe origins of the Maltese language are attributed to the arrival, early in the eleventh century, of settlers from neighbouring Sicily, where Siculo-Arabic was spoken, following the Fatimid Caliphate's conquest of the island at the end of the ninth century.  This claim has been corroborated by genetic studies, which show that contemporary Maltese people share common ancestry with Sicilians and Calabrians, with little genetic input from North Africa and the Levant.[http://www.timesofmalta.com/articles/view/20070805/opinion/genetic-origin-of-contemporary-maltese.9032 A.E. Felice; \"The Genetic Origin of Contemporary Maltese,\"] The Sunday Times of Malta,5 August 2007.[http://www.familytreedna.com/pdf/capelli2005.pdf C. Capelli, N. Redhead, N. Novelletto, L. Terrenato, P. Malaspina, Z. Poulli, G. Lefranc, A. Megarbane, V. Delague, V. Romano, F. Cali, V.F. Pascali, M. Fellous, A.E. Felice, and D.B. Goldstein; \"Population Structure in the Mediterranean Basin: A Y Chromosome Perspective,\"] Annals of Human Genetics, 69, 1-20, 2005. Last visited August 8, 2007.\n\nThe Norman conquest in 1090, followed by the expulsion of the Muslims (complete by 1249) permanently isolated the vernacular from its Arabic source, creating the conditions for its evolution into a distinct language. In contrast to Sicily (where Siculo-Arabic became extinct, replaced by Sicilian), the vernacular in Malta continued to develop alongside Italian, eventually replacing it as official language in 1934 (alongside English).\n\nThe first written reference to the Maltese language is in a will of 1436, where it is called lingua maltensi. The oldest known document in Maltese is \"Il Cantilena\" (Xidew il-Qada) by Pietru Caxaro. It dates from the 15th century.\n\nThe earliest known Maltese dictionary was a sixteenth-century manuscript entitled \"Maltese-Italiano\"; it was included in the Biblioteca Maltese of Mifsud in 1764, but is now lost. A list of Maltese words was included in both the Thesaurus Polyglottus (1603) and Propugnaculum Europae (1606) of Hieronymus Megiser, who had visited Malta in 1588–89; Domenico Magri gave the etymologies of some Maltese words in his Hierolexicon, sive sacrum dictionarium (1677). An early manuscript dictionary, Dizionario Italiano e Maltese, was discovered in the Biblioteca Vallicelliana in Rome in the 1980s, together with a grammar, the Regole per la Lingua Maltese, attributed to a French Knight named Thezan.Dionisius A. Agius (1990). [https://www.jstor.org/stable/194709 Review article: Al-Miklem Malti: A Contribution to Arabic Lexical Dialectology]. Bulletin (British Society for Middle Eastern Studies) 17 (2): 171-180. Arnold Cassola (2012). [http://imsmr.or.kr/cont/103/File_Upload/050101.pdf Italo-Maltese Relations (ca. 1150 -1936): People, Culture, Literature, Language] . Mediterranean Review 5 (1): 1–20. The first systematic lexicon is that of Giovanni Pietro Francesco Agius de Soldanis, who also wrote the first systematic grammar of the language and proposed a standard orthography.\n\nDemographics\n\nIn 1975, there were an estimated 371,000 Maltese speakers, of whom 300,000 resided in Malta. Thousands of Maltese emigrants in Australia, Canada, Italy, the United Kingdom, and the United States still speak the language, and in 2007 it was reported that Maltese is still spoken by descendants of Maltese immigrants in Tunisia.\n\nIndeed, nowadays  people across the world speak Maltese, while Malta has a population of only 445,426 people, which means that the remaining figure of 76,574 people can be attributed to the Maltese diaspora.   [https://web.archive.org/web/20131203033602/http://www.nso.gov.mt/site/page.aspx?pageid\n588 Census 2011]. National Statistics Office, Malta\n\nClassification\n\nMaltese is descended from Siculo-Arabic, a Semitic language within the Afroasiatic family,C.F. & F.M. Voegelin. 1977. Classification and Index of the World's Languages. Elsevier.Merritt Ruhlen.  1991.  A Guide to the World's Languages, Volume 1: Classification. Stanford.David Dalby.  2000. The Linguasphere Register of the World's Languages and Speech Communities. Linguasphere Observatory.Gordon, Raymond G., Jr., ed.  2005.  Ethnologue: Languages of the World.  15th ed.  Summer Institute of Linguistics.Alan S. Kaye & Judith Rosenhouse.  1997.  \"Arabic Dialects and Maltese\", The Semitic Languages. Ed. Robert Hetzron. Routledge. Pages 263–311. that in the course of its history has been influenced by Sicilian and Italian, to a lesser extent French, and more recently English. Today, the core vocabulary (including both the most commonly used vocabulary and function words) is Semitic, with large numbers of loanwords. Because of the Sicilian influence on Siculo-Arabic, Maltese has many language contact features and is most commonly described as a language with a large number of loanwords.\n\nThe Maltese language has historically been classified in various ways, with some claiming that the ancient Punic language (another Semitic language) was its origin instead of Siculo-Arabic, while others believed the language to be one of the Berber languages (another family within Afroasiatic), and under the Fascist Kingdom of Italy, it was classified as regional Italian.\n\nPhonology\n\nConsonants\n\nVoiceless stops are only lightly aspirated and voiced stops are fully voiced. Voicing is carried over from the last segment in obstruent clusters; thus, two- and three-obstruent clusters are either voiceless or voiced throughout, e.g. is realised \"we write\". Maltese has final-obstruent devoicing of voiced obstruents and voiceless stops have no audible release, making voiceless–voiced pairs phonetically indistinguishable.\n\nGemination is distinctive word-medially and word-finally in Maltese. The distinction is most rigid intervocalically after a stressed vowel. Stressed, word-final closed syllables with short vowels end in a long consonant, and those with a long vowel in a single consonant; the only exception is where historic and meant the compensatory lengthening of the succeeding vowel. Some speakers have lost length distinction in clusters.\n\nThe two nasals and assimilate for place of articulation in clusters. and are usually dental, whereas are all alveolar. are found mostly in words of Italian origin, retaining length (if not word-initial). and are only found in loanwords, e.g. \"newspaper\" and \"television\". The pharyngeal fricative is velar or glottal for some speakers.\n\nVowels\n\nMaltese has five short vowels,, written a e i o u; six long vowels,, written a e ie i o u; and seven diphthongs: both written għi,  both written għu, and written ew iw oj.\n\nStress\n\nStress is generally on the penultimate syllable, unless some other syllable is heavy (has a long vowel or final consonant), or unless a stress-shifting suffix is added. (Suffixes marking gender, possession, and verbal plurals do not cause the stress to shift.)\n\nWhen two syllables are equally heavy, the penultimate takes the stress, but otherwise the heavier syllable does, e.g. bajjad 'he painted' vs bajjad 'a painter'.\n\nHistorical phonology\n\nMany Classical Arabic consonants underwent mergers and modifications in Maltese:\n\nOrthography\n\nAlphabet\n\nThe modern system of Maltese orthography was introduced in 1924.\nBelow is the Maltese alphabet, with IPA symbols and approximate English pronunciation:\n\nFinal vowels with grave accents (à, è, ì, ò, ù) are also found in some Maltese words of Italian origin, such as libertà (\"freedom\"), sigurtà (old Italian: sicurtà, \"security\"), or soċjetà (Italian: società, \"society\").\n\nThe official rules governing the structure of the Maltese language are found in the official guidebook issued by the Akkademja tal-Malti, the Academy of the Maltese language, which is named  Tagħrif fuq il-Kitba Maltija, that is, Knowledge on Writing in Maltese. The first edition of this book was printed in 1924 by the Maltese government's printing press. The rules were further expanded in the 1984 book, iż-Żieda mat-Tagħrif, which focused mainly on the increasing influence of Romance and English words. In 1992 the Academy issued the Aġġornament tat-Tagħrif fuq il-Kitba Maltija, which updated the previous works. All these works were included in a revised and expanded guidebook published in 1996.\n\nThe National Council for the Maltese Language (KNM) is the main regulator of the Maltese language (see Maltese Language Act, below) and not the Akkademja tal-Malti. However, these orthography rules are still valid and official.\n\nWritten Maltese\n\nSince Maltese evolved after the Italo-Normans ended the Arab rule of the islands, a written form of the language was not developed for a long time after the Arabs' expulsion in the middle of the thirteenth century. Under the rule of the Knights Hospitaller, both French and Italian were used for official documents and correspondence. During the British colonial period, the use of English was encouraged through education, with Italian regarded as the next-most important language.\n\nIn 1934, Maltese was recognised as an official language. In the late eighteenth century and throughout the nineteenth century, philologists and academics such as Mikiel Anton Vassalli made a concerted effort to standardize written Maltese. Many examples of written Maltese exist from before this period, always in the Latin alphabet, Il Cantilena  being the earliest example of written Maltese.\n\nSample\n\nFrom the [http://europa.eu/eu-law/decision-making/treaties/pdf/treaty_establishing_a_constitution_for_europe/treaty_establishing_a_constitution_for_europe_mt.pdf Treaty establishing a Constitution for Europe]:\n\nVocabulary\n\nAlthough the original vocabulary of the language was Siculo-Arabic, it has incorporated a large number of borrowings from Romance sources of influence (Sicilian, Italian, and French), and more recently Germanic ones (from English).\n\nThe historical source of modern Maltese vocabulary is 52% Italian/Sicilian, 32% Siculo-Arabic, and 6% English, with some of the remainder being French.[http://www.translationsmalta.com/page.aspx?pid=22 About Malta]; GTS; retrieved on 2008-02-24 Today, most function words are Semitic. In this way, it is similar to English, which is a Germanic language that had large influence from Norman French. As a result of this, Romance language-speakers may easily be able to comprehend more complex ideas expressed in Maltese, such as \"Ġeografikament, l-Ewropa hi parti tas-superkontinent ta' l-Ewrasja\" (Geographically, Europe is part of the Supercontinent of Eurasia), while not understanding a single word of a simple sentence such as \"Ir-raġel qiegħed fid-dar\" (The man is in the house), which would be easily understood by any Arabic speaker.\n\nRomance\n\nAn analysis of the etymology of the 41,000 words in Aquilina's Maltese-English Dictionary shows that words of Romance origin make up 52% of the Maltese vocabulary, although other sources claim from as low as 40%, to as high as 55%.http://google.com/search?q\ncache:DMnjEhi4EicJ:www.anglistik.uni-freiburg.de/Englisches_Seminar/Lehrstuehle/LS_Kortmann/FoL/index_html/2008-03-17.8198766048+Maltese+55%25+Romance&hlen&ct\nclnk&cd5&client\nsafari These vocabularies tend to deal with more complicated concepts. They are mostly derived from Sicilian and thus exhibit Sicilian phonetic characteristics, such as in place of, and in place of (e.g. tiatru not teatro and fidi not fede). Also, as with Old Sicilian, (English 'sh') is written 'x' and this produces spellings such as: ambaxxata ('embassy'), xena ('scene' cf. Italian ambasciata, scena).\n\nA tendency in modern Maltese is to adopt further influences from English and Italian.\nComplex Latinate English words adopted into Maltese are often given Italianate or Sicilianate forms, even if the resulting words do not appear in either of those languages. For instance, the words \"evaluation\", \"industrial action\", and \"chemical armaments\" become \"evalwazzjoni\", \"azzjoni industrjali\", and \"armamenti kimiċi\" in Maltese, while the Italian terms are valutazione, vertenza sindacale, and armi chimiche respectively. English words of Germanic origin are generally preserved relatively unchanged.\n\nSiculo-Arabic\n\nSiculo-Arabic is the ancestor of the Maltese language, and supplies between 32% and 40% of the language's vocabulary.\n\n found that 40% of a sample of 1,820 Quranic Arabic roots were found in Maltese, a lower percentage than found in Moroccan (58%) and Lebanese Arabic (72%). An analysis of the etymology of the 41,000 words in Aquilina's Maltese-English Dictionary shows that 32% of the Maltese vocabulary is of Arabic origin, although another source claims 40%.Compare with approx. 25–33% of Old English or Germanic words in Modern English. Usually, words expressing basic concepts and ideas, such as ' (man), ' (woman), ' (boy), ' (house), ' (sun), ' (summer), are of Arabic origin. Moreover,  in Maltese tend to aim mainly at diction belonging to this group.\n\nThe Maltese language has merged many of the original Arabic consonants, in particular the emphatic consonants, with others that are common in European languages. Thus, original Arabic,, and all merged into Maltese. The vowels, however, separated from the three in Arabic to five, as is more typical of other European languages. Some unstressed short vowels have been elided. The common Arabic greeting ' is cognate with ' in Maltese (lit. the peace for you, peace be with you), as are similar greetings in other Semitic languages (e.g. ' in Hebrew).\n\nSince the attested vocabulary of Siculo-Arabic is limited, the following table compares cognates in Maltese and some other varieties of Arabic (all forms are written phonetically, as in the source):Alan S. Kaye & Judith Rosenhouse.  1997.  \"Arabic Dialects and Maltese\", The Semitic Languages. Routledge. Pp. 263–311.\n\nEnglish\n\nIt is estimated that English loanwords, which are becoming more commonplace, make up 20% of the Maltese vocabulary, although other sources claim amounts as low as 6%. This percentage discrepancy is due to the fact that a number of new English loanwords are sometimes not officially considered part of the Maltese vocabulary; hence, they are not included in certain dictionaries. Also, English loanwards of Latinate origin are very often Italianised, as discussed above. English loanwords are generally transliterated, although standard English pronunciation is virtually always retained. Below are a few examples:\n\nNote \"fridge\", which is a slang term derived from \"refrigerator\", a Latinate word which might be expected to be rendered as rifriġeratori (Italian uses a different word: frigorifero).\n\nGrammar\n\nMaltese grammar is fundamentally derived from Siculo-Arabic, although Romance and English noun pluralization patterns are also used on borrowed words.\n\nAdjectives and adverbs\n\nAdjectives follow nouns. There are no separately formed native adverbs, and word order is fairly flexible. Both nouns and adjectives of Semitic origin take the definite article (for example, It-tifel il-kbir, lit. \"The boy the elder\"=\"The elder boy\"). This rule does not apply to adjectives of Romance origin.\n\nNouns\n\nNouns are pluralized and also have a dual marker.  Semitic plurals are complex; if they are regular, they are marked by -iet/-ijiet, e.g., art, artijiet \"lands (territorial possessions or property)\" (cf. Arabic -at and Hebrew -ot/-oth) or -in (cf. Arabic -īn and Hebrew -im). If irregular, they fall in the pluralis fractus category, in which a word is pluralized by internal vowel changes: ktieb, kotba \" book\", \"books\"; raġel, irġiel \"man\", \"men\".\n\nWords of Romance origin are usually pluralized in two manners: addition of -i or -jiet. For example, lingwa, lingwi \"languages\", from Sicilian lingua, lingui.\n\nWords of English origin are pluralized by adding either an \"-s\" or \"-jiet\", for example, friġġ, friġis from the word fridge.  Some words can be pluralized with either of the suffixes to denote the plural.  A few words borrowed from English can amalgamate both suffixes, like brikksa from the English brick, which can adopt either collective form brikks or the plural form brikksiet.\n\nArticle\n\nThe proclitic il- is the definite article, equivalent to \"the\" in English and \"al-\" in Arabic.\n\nThe Maltese article becomes l- before or after a vowel.\n* l-omm (the mother)\n* rajna l-Papa (we saw the Pope)\n* il-missier (the father)\n\nThe Maltese article assimilates to a following coronal consonant (called konsonanti xemxin \"sun consonants\"), namely:\n* Ċ iċ-ċikkulata (the chocolate)\n* D id-dar (the house)\n* N in-nar (the fire)\n* R ir-razzett (the farm)\n* S is-serrieq (the saw)\n* T it-tifel (the boy)\n* X ix-xemx (the sun)\n* Ż iż-żarbun (the shoe)\n* Z iz-zalzett (the sausage)\n\nMaltese il- is coincidentally identical in pronunciation to the one of the Italian masculine articles, il, which is also l’ before, but not after, a vowel. Consequently, many nouns borrowed from Standard Italian did not change their original article when used in Maltese. Romance vocabulary taken from Sicilian did change where the Sicilian articles u and a, before a consonant, are used.\nIn spite of its Romance appearance, il- is related to the Arabic article al-.\n\nVerbs\n\nVerbs show a triliteral Semitic pattern, in which a verb is conjugated with prefixes, suffixes, and infixes (for example ktibna, Arabic katabna, Hebrew kathabhnu (Modern Hebrew: katavnu) \"we wrote\"). There are two tenses: present and perfect.  The Maltese verb system incorporates Romance verbs and adds Maltese suffixes and prefixes to them (for example, iddeċidejna \"we decided\" ← (i)ddeċieda \"decide\", a Romance verb + -ejna, a Maltese first person plural perfect marker).\n\nDialects\n\nUrban varieties of Maltese are closer to Standard Maltese than rural varieties,Isserlin. Studies in Islamic History and Civilization. BRILL 1986,  which have some characteristics that distinguish them from Standard Maltese. They tend to show some archaic features such as the realization of kh and gh and the imāla of Arabic ā into ē (or ī especially in Gozo)-considered archaic because they are reminiscent of 15th century transcriptions of this sound.  Another archaic feature is the realization of Standard Maltese ā as ō in rural dialects. There is also a tendency to diphthongize simple vowels, e.g., ū becomes eo or eu.  Rural dialects also tend to employ more Semitic roots and broken plurals than Standard Maltese.  In general, rural Maltese is less distant from its Siculo-Arabic ancestor than Standard Maltese.\n\nMedia\n\nWith Malta being a multilingual country, the usage of Maltese in the mass media is shared with other European languages, namely English and Italian. The majority of television stations broadcast from Malta in English or Maltese, although broadcasts from Italy in Italian are also received on the islands. Similarly, there are more Maltese-language radio programs than English ones broadcast from Malta, but again, as with television, Italian broadcasts are also picked up. Maltese generally receives equal usage in newspaper periodicals to English.\n\nBy early 2000s, the use of the Maltese language on the Internet is uncommon, and the number of websites written in Maltese are few. In a survey of Maltese cultural websites conducted in 2004 on behalf of the Maltese Government, 12 of 13 were in English only, while the remaining one was multilingual but did not include Maltese.\n\nCode-switching\n\nThe Maltese population, being fluent in both Maltese and English, displays code-switching (referred to as Maltenglish) in certain localities and between certain social groups. Maltese language. http://en.wikipedia.org/?curid=19031."
  }
}
