{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3462",
  "eid" : "c71e2250-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778413813,
  "textBody" : "Bolivia (;; ; ; ), officially known as the Plurinational State of Bolivia (), is a landlocked country located in western-central South America. The capital is Sucre while the seat of government is located in La Paz. The largest city and principal economic and financial center is Santa Cruz de la Sierra, located on the Llanos Orientales (Tropical lowlands) a mostly flat region in the East of Bolivia.\n\nIt is constitutionally a unitary state, divided into nine departments. Its geography varies from the peaks of the Andes in the West, to the Eastern Lowlands, situated within the Amazon Basin. It is bordered to the north and east by Brazil, to the southeast by Paraguay, to the south by Argentina, to the southwest by Chile, and to the northwest by Peru. One-third of the country is within the Andean mountain range. With  of area, Bolivia is the 5th largest country in South America and the 27th largest in the world.\n\nThe country's population, estimated at 11 million, is multiethnic, including Amerindians, Mestizos, Europeans, Asians and Africans. The racial and social segregation that arose from Spanish colonialism has continued to the modern era. Spanish is the official and predominant language, although 36 indigenous languages also have official status, of which the most commonly spoken are Guarani, Aymara and Quechua languages.\n\nBefore Spanish colonization, the Andean region of Bolivia was part of the Inca Empire, while the northern and eastern lowlands were inhabited by independent tribes. Spanish conquistadors arriving from Cuzco and Asunción took control of the region in the 16th century. During the Spanish colonial period Bolivia was administered by the Royal Audiencia of Charcas. Spain built its empire in great part upon the silver that was extracted from Bolivia's mines.\nAfter the first call for independence in 1809, 16 years of war followed before the establishment of the Republic, named for Simón Bolívar. It has been landlocked since the annexation of its Pacific coast territory by Chile following the War of the Pacific (1879–84).\n\nModern Bolivia is a charter member of the UN, IMF, NAM, OAS, ACTO, Bank of the South, ALBA and USAN. For over a decade Bolivia has had one of the fastest economic growths in Latin America, however it remains one poorest countries in South America, . It is a developing country, with a medium ranking in the Human Development Index, a poverty level of 38,6 percent,, and it is one of the top three safest countries in Latin America. It Its main economic activities include agriculture, forestry, fishing, mining, and manufacturing goods such as textiles, clothing, refined metals, and refined petroleum. Bolivia is very wealthy in minerals, especially tin.\n\nEtymology \n\nBolivia is named after Simón Bolívar, a leader in the Spanish American wars of independence. The leader of Venezuela, Antonio José de Sucre, had been given the option by Bolívar to either unite Charcas (present-day Bolivia) with the newly formed Republic of Peru, to unite with the United Provinces of Rio de la Plata, or to formally declare its independence from Spain as a wholly independent nation. Sucre opted to create a brand new nation and on 6 August 1825, with local support, named it in honor of Simón Bolívar.\n\nThe original name was Republic of Bolívar. Some days later, congressman Manuel Martín Cruz proposed: \"If from Romulus comes Rome, then from Bolívar comes Bolivia\" (). The name was approved by the Republic on 3 October 1825. In 2009, a new constitution changed the country's official name to \"Plurinational State of Bolivia\" in recognition of the multi-ethnic nature of the country and the enhanced position of Bolivia's indigenous peoples under the new constitution.\n\nHistory \n\nPre-colonial \n\nThe region now known as Bolivia had been occupied for over 2,500 years when the Aymara arrived. However, present-day Aymara associate themselves with the ancient civilization of the Tiwanaku culture which had its capital at Tiwanaku, in Western Bolivia. The capital city of Tiwanaku dates from as early as 1500 BC when it was a small, agriculturally based village.\n\nThe community grew to urban proportions between AD 600 and AD 800, becoming an important regional power in the southern Andes. According to early estimates, the city covered approximately  at its maximum extent and had between 15,000 and 30,000 inhabitants. In 1996 satellite imaging was used to map the extent of fossilized suka kollus (flooded raised fields) across the three primary valleys of Tiwanaku, arriving at population-carrying capacity estimates of anywhere between 285,000 and 1,482,000 people.\n\nAround AD 400, Tiwanaku went from being a locally dominant force to a predatory state. Tiwanaku expanded its reaches into the Yungas and brought its culture and way of life to many other cultures in Peru, Bolivia, and Chile. Tiwanaku was not a violent culture in many respects. In order to expand its reach, Tiwanaku exercised great political astuteness, creating colonies, fostering trade agreements (which made the other cultures rather dependent), and instituting state cults.\n\nThe empire continued to grow with no end in sight. William H. Isbell states \"Tiahuanaco underwent a dramatic transformation between AD 600 and 700 that established new monumental standards for civic architecture and greatly increased the resident population.\" Tiwanaku continued to absorb cultures rather than eradicate them. Archaeologists note a dramatic adoption of Tiwanaku ceramics into the cultures which became part of the Tiwanaku empire. Tiwanaku's power was further solidified through the trade it implemented among the cities within its empire.\n\nTiwanaku's elites gained their status through the surplus food they controlled, collected from outlying regions and then redistributed to the general populace. Further, this elite's control of llama herds became a powerful control mechanism as llamas were essential for carrying goods between the civic centre and the periphery. These herds also came to symbolize class distinctions between the commoners and the elites. Through this control and manipulation of surplus resources, the elite's power continued to grow until about AD 950. At this time a dramatic shift in climate occurred, causing a significant drop in precipitation in the Titicaca Basin, believed by archaeologists to have been on the scale of a major drought.\n\nAs the rainfall decreased, many of the cities farther away from Lake Titicaca began to tender fewer foodstuffs to the elites. As the surplus of food decreased, and thus the amount available to underpin their power, the control of the elites began to falter. The capital city became the last place viable for food production due to the resiliency of the raised field method of agriculture. Tiwanaku disappeared around AD 1000 because food production, the main source of the elites' power, dried up. The area remained uninhabited for centuries thereafter.\n\nBetween 1438 and 1527, the Inca empire, during its expansion from its capital at Cuzco, Peru. It gained control over much of what is now Andean Bolivia and extended its control into the fringes of the Amazon basin.\n\nColonial period \n\nThe Spanish conquest of the Inca empire began in 1524, and was mostly completed by 1533. The territory now called Bolivia was known as Charcas, and was under the authority of the Viceroy of Lima. Local government came from the Audiencia de Charcas located in Chuquisaca (La Plata—modern Sucre). Founded in 1545 as a mining town, Potosí soon produced fabulous wealth, becoming the largest city in the New World with a population exceeding 150,000 people.\n\nBy the late 16th century, Bolivian silver was an important source of revenue for the Spanish Empire. A steady stream of natives served as labor force under the brutal, slave conditions of the Spanish version of the pre-Columbian draft system called the mita. Charcas was transferred to the Viceroyalty of the Río de la Plata in 1776 and the people from Buenos Aires, the capital of the Viceroyalty, coined the term \"Upper Peru\" () as a popular reference to the Royal Audiencia of Charcas. Túpac Katari led the indigenous rebellion that laid siege to La Paz in March 1781, during which 20,000 people died. As Spanish royal authority weakened during the Napoleonic wars, sentiment against colonial rule grew.\n\nIndependence and subsequent wars \n\nThe struggle for independence started in the city of Sucre on 25 May 1809 and the Chuquisaca Revolution (Chuquisaca was then the name of the city) is known as the first cry of Freedom in Latin America. That revolution was followed by the La Paz revolution on 16 July 1809. The La Paz revolution marked a complete split with the Spanish government, while the Chuquisaca Revolution established a local independent junta in the name of the Spanish King deposed by Napoleon Bonaparte. Both revolutions were short-lived and defeated by the Spanish authorities in the Viceroyalty of the Rio de La Plata, but the following year the Spanish American wars of independence raged across the continent.\n\nBolivia was captured and recaptured many times during the war by the royalists and patriots. Buenos Aires sent three military campaigns, all of which were defeated, and eventually limited itself to protecting the national borders at Salta. Bolivia was finally freed of Royalist dominion by Antonio José de Sucre, with a military campaign coming from the North in support of the campaign of Simón Bolívar. After 16 years of war the Republic was proclaimed on 6 August 1825.\n\nIn 1836, Bolivia, under the rule of Marshal Andrés de Santa Cruz, invaded Peru to reinstall the deposed president, General Luis José de Orbegoso. Peru and Bolivia formed the Peru-Bolivian Confederation, with de Santa Cruz as the Supreme Protector. Following tension between the Confederation and Chile, Chile declared war on 28 December 1836. Argentina separately declared war on the Confederation on 9 May 1837. The Peruvian-Bolivian forces achieved several major victories during the War of the Confederation: the defeat of the Argentine expedition and the defeat of the first Chilean expedition on the fields of Paucarpata near the city of Arequipa.\n\nAt the outset of the war, the Chilean and Peruvian rebel army surrendered unconditionally and signed the Paucarpata Treaty. The treaty stipulated that Chile would withdraw from Peru-Bolivia, Chile would return captured Confederate ships, economic relations would be normalized, and the Confederation would pay Peruvian debt to Chile. In Chile, the government and public rejected the peace treaty. Chile organized a second attack on the Confederation and defeated it in the Battle of Yungay. After this defeat, Santa Cruz resigned and went to exile in Ecuador and then Paris, and the Peruvian-Bolivian Confederation was dissolved.\n\nFollowing the renewed independence of Peru, Peruvian president General Agustín Gamarra invaded Bolivia. The Peruvian army was decisively defeated at the Battle of Ingavi on 20 November 1841 where Gamarra was killed. The Bolivian army under General José Ballivián then mounted a counter-offensive, capturing the Peruvian port of Arica. Later, both sides signed a peace treaty in 1842, putting a final end to the war.\n\nA period of political and economic instability in the early-to-mid-19th century weakened Bolivia. In addition, during the War of the Pacific (1879–83), Chile  occupied vast territories rich in natural resources south west of Bolivia, including the Bolivian coast. Chile took control of today's Chuquicamata area, the adjoining rich salitre (saltpeter) fields, and the port of Antofagasta among other Bolivian territories.\n\nThus, since independence, Bolivia has lost over half of its territory to neighboring countries. It also lost the state of Acre, in the Acre War, important because this region was known for its production of rubber. Peasants and the Bolivian army fought briefly but after a few victories, and facing the prospect of a total war against Brazil, it was forced to sign the Treaty of Petrópolis in 1903, in which Bolivia lost this rich territory. Popular myth has it that Bolivian president Mariano Melgarejo (1864–71) traded the land for what he called \"a magnificent white horse\" and Acre was subsequently flooded by Brazilians, which ultimately led to confrontation and fear of war with Brazil. In the late 19th century, an increase in the world price of silver brought Bolivia relative prosperity and political stability.\n\nEarly 20th century \n\nDuring the early 20th century, tin replaced silver as the country's most important source of wealth. A succession of governments controlled by the economic and social elite followed laissez-faire capitalist policies through the first thirty years of the 20th century.\n\nLiving conditions of the native people, who constitute most of the population, remained deplorable. With work opportunities limited to primitive conditions in the mines and in large estates having nearly feudal status, they had no access to education, economic opportunity, and political participation. Bolivia's defeat by Paraguay in the Chaco War (1932–35), where Bolivia lost a great part of the Gran Chaco region in dispute, marked a turning-point. [http://www.geography.wisc.edu/archiveNews/2006/pdf/NYT-History%20Geography%20Bolivia.pdf (PDF)] , University of Wisconsin–Madison, Department of Geography\n\nThe Revolutionary Nationalist Movement (MNR), the most historic political party, emerged as a broad-based party. Denied its victory in the 1951 presidential elections, the MNR led a successful revolution in 1952. Under President Víctor Paz Estenssoro, the MNR, having strong popular pressure, introduced universal suffrage into his political platform and carried out a sweeping land-reform promoting rural education and nationalization of the country's largest tin mines.\n\nLate 20th century \n\n12 years of tumultuous rule left the MNR divided. In 1964, a military junta overthrew President Estenssoro at the outset of his third term. The 1969 death of President René Barrientos Ortuño, a former member of the junta who was elected president in 1966, led to a succession of weak governments. Alarmed by the rising Popular Assembly and the increase in the popularity of President Juan José Torres, the military, the MNR, and others installed Colonel (later General) Hugo Banzer Suárez as president in 1971. He returned to the presidency in 1997 through 2001.\n\nThe United States' Central Intelligence Agency (CIA) had been active in providing finances and training to the Bolivian military dictatorship in the 1960s. The revolutionary leader Che Guevara was killed by a team of CIA officers and members of the Bolivian Army on 9 October 1967, in Bolivia. Félix Rodríguez was a CIA officer on the team with the Bolivian Army that captured and shot Guevara. Rodriguez said that after he received a Bolivian presidential execution order, he told \"the soldier who pulled the trigger to aim carefully, to remain consistent with the Bolivian government's story that Che had been killed in action during a clash with the Bolivian army.\" Rodriguez said the US government had wanted Che in Panama, and \"I could have tried to falsify the command to the troops, and got Che to Panama as the US government said they had wanted\", but that he had chosen to \"let history run its course\" as desired by Bolivia.\n\nElections in 1979 and 1981 were inconclusive and marked by fraud. There were coups d'état, counter-coups, and caretaker governments. In 1980, General Luis García Meza Tejada carried out a ruthless and violent coup d'état that did not have popular support. He pacified the people by promising to remain in power only for one year. At the end of the year, he staged a televised rally to claim popular support and announced, \"Bueno, me quedo\", or, \"All right; I'll stay [in office].\" After a military rebellion forced out Meza in 1981, three other military governments in 14 months struggled with Bolivia's growing problems. Unrest forced the military to convoke the Congress, elected in 1980, and allow it to choose a new chief executive. In October 1982, Hernán Siles Zuazo again became president, 22 years after the end of his first term of office (1956–60).\n\nDemocratic transition \n\nGonzalo Sánchez de Lozada pursued an aggressive economic and social reform agenda. The most dramatic reform was the \"capitalization\" program, under which investors, typically foreign, acquired 50% ownership and management control of public enterprises in return for agreed upon capital investments.\n\nIn 1993, Gonzalo Sánchez de Lozada ran for president in alliance with the Tupac Katari Revolutionary Liberation Movement, which inspired indigenous-sensitive and multicultural-aware policies. In 1993, Sanchez de Lozada introduced the Plan de Todos, which led to the decentralization of government, introduction of intercultural bilingual education, implementation of agrarian legislation, and privatization of state owned businesses. The plan explicitly stated that Bolivian citizens would own a minimum of 51% of enterprises; under the plan, most state-owned enterprises (SOEs), though not mines, were sold. This privatization of SOEs led to a neoliberal structuring.\n\nThe Law of Popular Participation gave municipalities the responsibility of maintaining various infrastructures (and offering services): health, education, systems of irrigation, which stripped the responsibility away from the state.\n\nThe reforms and economic restructuring were strongly opposed by certain segments of society, which instigated frequent and sometimes violent protests, particularly in La Paz and the Chapare coca-growing region, from 1994 through 1996. During this time, the umbrella labor-organization of Bolivia, the Central Obrera Boliviana (COB), became increasingly unable to effectively challenge government policy. A teachers' strike in 1995 was defeated because the COB could not marshal the support of many of its members, including construction and factory workers.\n\nIn the 1997 elections, General Hugo Banzer, leader of the Nationalist Democratic Action party (ADN) and former dictator (1971–78), won 22% of the vote, while the MNR candidate won 18%. At the outset of his government, President Banzer launched a policy of using special police-units to eradicate physically the illegal coca of the Chapare region. The MIR of Jaime Paz Zamora remained a coalition-partner throughout the Banzer government, supporting this policy (called the Dignity Plan). The Banzer government basically continued the free-market and privatization-policies of its predecessor. The relatively robust economic growth of the mid-1990s continued until about the third year of its term in office. After that, regional, global and domestic factors contributed to a decline in economic growth. Financial crises in Argentina and Brazil, lower world prices for export commodities, and reduced employment in the coca sector depressed the Bolivian economy. The public also perceived a significant amount of public sector corruption. These factors contributed to increasing social protests during the second half of Banzer's term.\n\nBetween January 1999 and April 2000, large-scale protests erupted in Cochabamba, Bolivia's third largest city, in response to the privatisation of water resources by foreign companies and a subsequent doubling of water prices. On 6 August 2001, Banzer resigned from office after being diagnosed with cancer. He died less than a year later. Vice President Jorge Fernando Quiroga Ramírez completed the final year of his term.\n\nIn the June 2002 national elections, former President Gonzalo Sánchez de Lozada (MNR) placed first with 22.5% of the vote, followed by coca-advocate and native peasant-leader Evo Morales (Movement Toward Socialism, MAS) with 20.9%. A July agreement between the MNR and the fourth-place MIR, which had again been led in the election by former President Jaime Paz Zamora, virtually ensured the election of Sánchez de Lozada in the congressional run-off, and on 6 August he was sworn in for the second time. The MNR platform featured three overarching objectives: economic reactivation (and job creation), anti-corruption, and social inclusion.\n\nIn 2003 the Bolivian gas conflict broke out. On 12 October 2003 the government imposed martial law in El Alto after 16 people were shot by the police and several dozen wounded in violent clashes. Faced with the option of resigning or more bloodshed, Sanchez de Lozada offered his resignation in a letter to an emergency session of Congress. After his resignation was accepted and his vice president, Carlos Mesa, invested, he left on a commercially scheduled flight for the United States.\n\nThe country's internal situation became unfavorable for such political action on the international stage. After a resurgence of gas protests in 2005, Carlos Mesa attempted to resign in January 2005, but his offer was refused by Congress. On 22 March 2005, after weeks of new street protests from organizations accusing Mesa of bowing to U.S. corporate interests, Mesa again offered his resignation to Congress, which was accepted on 10 June. The chief justice of the Supreme Court, Eduardo Rodríguez, was sworn as interim president to succeed the outgoing Carlos Mesa.\n\nThe indigenous population of the Andean region was not able to benefit from government reforms.\n\nEvo Morales won the 2005 presidential election with 53.7% of the votes, an absolute majority, unusual in Bolivian elections. On 1 May 2006, Morales caused controversy when he announced his intent to re-nationalize Bolivian hydrocarbon assets. Fulfilling a campaign promise, on 6 August 2006, Morales opened the Bolivian Constituent Assembly to begin writing a new constitution aimed at giving more power to the indigenous majority.\n\nIn August 2007, more conflicts arose in Sucre, as the city demanded the discussion of the seat of government inside the assembly, hoping the executive and legislative branches could return to the city, but the assembly and the government said this demand was overwhelmingly impractical and politically undesirable. In May 2008, Evo Morales was a signatory to the UNASUR Constitutive Treaty of the Union of South American Nations. In the 2009 national general elections, Evo Morales was re-elected with 64.22% of the vote. His party, Movement for Socialism, also won a two-thirds majority in both houses of the National Congress.\n\nGeography \n\nBolivia is located in the central zone of South America, between 57°26'–69°38'W and 9°38'–22°53'S. With an area of 1098581 km2, Bolivia is the world's 28th-largest country, and the fifth largest country in South America, extending from the Central Andes through part of the Gran Chaco as far as the Amazon. The geographic center of the country is the so-called Puerto Estrella (\"Star Port\") on the Río Grande, in Ñuflo de Chávez Province, Santa Cruz Department.\n\nThe geography of the country exhibits a great variety of terrain and climates. Bolivia has a high level of biodiversity, considered one of the greatest in the world, as well as several ecoregions with ecological sub-units such as the Altiplano, tropical rainforests (including Amazon rainforest), dry valleys, and the Chiquitania, which is a tropical savanna. These areas feature enormous variations in altitude, from an elevation of 6542 m above sea level in Nevado Sajama to nearly 70 m along the Paraguay River. Although a country of great geographic diversity, Bolivia has remained a landlocked country since the War of the Pacific.\n\nBolivia can be divided into three physiographic regions:\n\n*The Andean region in the southwest spans 28% of the national territory, extending over 307603 km². This area is located above 3000 m altitude and is located between two big Andean chains, the Cordillera Occidental (\"Western Range\") and the Cordillera Central (\"Central Range\"), with some of the highest spots in the Americas such as the Nevado Sajama, with an altitude of 6542 m, and the Illimani, at 6462 m. Also located in the Cordillera Central is Lake Titicaca, the highest commercially navigable lake in the world and the largest lake in South America; the lake is shared with Peru. Also in this region are the Altiplano and the Salar de Uyuni, which is the largest salt flat in the world and an important source of lithium.\n*The Sub-Andean region in the center and south of the country is an intermediate region between the Altiplano and the eastern llanos (plain); this region comprises 13% of the territory of Bolivia, extending over 142815 km², and encompassing the Bolivian valleys and the Yungas region. It is distinguished by its farming activities and its temperate climate.\n*The Llanos region in the northeast comprises 59% of the territory, with 648163 km². It is located to the north of the Cordillera Central and extends from the Andean foothills to the Paraguay River. It is a region of flat land and small plateaus, all covered by extensive rain forests containing enormous biodiversity. The region is below 400 m above sea level.\n\nBolivia has three drainage basins:\n\n*The first is the Amazon Basin, also called the North Basin (724000 km²/66% of the territory). The rivers of this basin generally have big meanders which form lakes such as Murillo Lake in Pando Department. The main Bolivian tributary to the Amazon basin is the Mamoré River, with a length of 2000 km running north to the confluence with the Beni River, 1113 km in length and the second most important river of the country. The Beni River, along with the Madeira River, forms the main tributary of the Amazon River. From east to west, the basin is formed by other important rivers, such as the Madre de Dios River, the Orthon River, the Abuna River, the Yata River, and the Guaporé River. The most important lakes are Rogaguado Lake, Rogagua Lake, and Jara Lake.\n*The second is the Rio de la Plata Basin, also called the South Basin (229500 km²/21% of the territory). The tributaries in this basin are in general less abundant than the ones forming the Amazon Basin. The Rio de la Plata Basin is mainly formed by the Paraguay River, Pilcomayo River, and Bermejo River. The most important lakes are Uberaba Lake and Mandioré Lake, both located in the Bolivian marshland.\n*The third basin is the Central Basin, which is an endorheic basin (145081 km²/13% of the territory). The Altiplano has large numbers of lakes and rivers that do not run into any ocean because they are enclosed by the Andean mountains. The most important river is the Desaguadero River, with a length of 436 km, the longest river of the Altiplano; it begins in Lake Titicaca and then runs in a southeast direction to Poopó Lake. The basin is then formed by Lake Titicaca, Lake Poopó, the Desaguadero River, and great salt flats, including the Salar de Uyuni and Coipasa Lake.\n\nGeology\n\nThe geology of Bolivia comprises a variety of different lithologies as well as tectonic and sedimentary environments. On a synoptic scale, geological units coincide with topographical units. Most elementally, the country is divided into a mountainous western area affected by the subduction processes in the Pacific and an eastern lowlands of stable platforms and shields.\n\nClimate \n\nThe climate of Bolivia varies drastically from one eco-region to the other, from the tropics in the eastern llanos to a polar climate in the western Andes. The summers are warm, humid in the east and dry in the west, with rains that often modify temperatures, humidity, winds, atmospheric pressure and evaporation, yielding very different climates in different areas. When the climatological phenomenon known as El Niño takes place, it causes great alterations in the weather. Winters are very cold in the west, and it snows in the mountain ranges, while in the western regions, windy days are more common. The autumn is dry in the non-tropical regions.\n*Llanos. A humid tropical climate with an average temperature of 30 °C. The wind coming from the Amazon rainforest causes significant rainfall. In May, there is low precipitation because of dry winds, and most days have clear skies. Even so, winds from the south, called surazos, can bring cooler temperatures lasting several days.\n*Altiplano. Desert-Polar climates, with strong and cold winds. The average temperature ranges from 15 to 20 °C. At night, temperatures descend drastically to slightly above 0 °C, while during the day, the weather is dry and solar radiation is high. Ground frosts occur every month, and snow is frequent.\n*Valleys and Yungas. Temperate climate. The humid northeastern winds are pushed to the mountains, making this region very humid and rainy. Temperatures are cooler at higher elevations. Snow occurs at altitudes of 2000 m.\n*Chaco. Subtropical semi-arid climate. Rainy and humid in January and the rest of the year, with warm days and cool nights.\n\nBiodiversity \n\nBolivia, with an enormous variety of organisms and ecosystems, is part of the \"Like-Minded Megadiverse Countries\".\n\nBolivia's variable altitudes, ranging from 90 - above sea level, allow for a vast biologic diversity. The territory of Bolivia comprises four types of biomes, 32 ecological regions, and 199 ecosystems. Within this geographic area there are several natural parks and reserves such as the Noel Kempff Mercado National Park, the Madidi National Park, the Tunari National Park, the Eduardo Avaroa Andean Fauna National Reserve, and the Kaa-Iya del Gran Chaco National Park and Integrated Management Natural Area, among others.\n\nBolivia boasts over 17,000 species of seed plants, including over 1,200 species of fern, 1,500 species of marchantiophyta and moss, and at least 800 species of fungus. In addition, there are more than 3,000 species of medicinal plants. Bolivia is considered the place of origin for such species as peppers and chili peppers, peanuts, the common beans, yucca, and several species of palm. Bolivia also naturally produces over 4,000 kinds of potatoes.\n\nBolivia has more than 2,900 animal species, including 398 mammals, over 1,400 birds (about 14% of birds known in the world, being the sixth most diverse country in terms of bird species), 204 amphibians, 277 reptiles, and 635 fish, all fresh water fish as Bolivia is a landlocked country. In addition, there are more than 3,000 types of butterfly, and more than 60 domestic animals.\n\nBolivia has gained global attention for its 'Law of the Rights of Mother Earth', which accords nature the same rights as humans.\n\nPolitics and government \n\nBolivia has been governed by democratically elected governments since 1982; prior to that, it was governed by various dictatorships. Presidents Hernán Siles Zuazo (1982–85) and Víctor Paz Estenssoro (1985–89) began a tradition of ceding power peacefully which has continued, although two presidents have stepped down in the face of popular protests: Gonzalo Sánchez de Lozada in 2003 and Carlos Mesa in 2005.\n\nBolivia's multiparty democracy has seen a wide variety of parties in the presidency and parliament, although the Revolutionary Nationalist Movement, Nationalist Democratic Action, and the Revolutionary Left Movement predominated from 1985 to 2005. The current president is Evo Morales, the first indigenous Bolivian to serve as head of state. Morales' Movement for Socialism – Political Instrument for the Sovereignty of the Peoples party was the first to win an outright presidential majority in four decades, doing so both in 2005 and 2009.\n\nThe constitution, drafted in 2006–07 and approved in 2009, provides for balanced executive, legislative, judicial, and electoral powers, as well as several levels of autonomy. The traditionally strong executive branch tends to overshadow the Congress, whose role is generally limited to debating and approving legislation initiated by the executive. The judiciary, consisting of the Supreme Court and departmental and lower courts, has long been riddled with corruption and inefficiency. Through revisions to the constitution in 1994, and subsequent laws, the government has initiated potentially far-reaching reforms in the judicial system as well as increasing decentralizing powers to departments, municipalities, and indigenous territories.\n\nThe executive branch is headed by a President and Vice President, and consists of a variable number (currently, 20) of government ministries. The president is elected to a five-year term by popular vote, and governs from the Presidential Palace (popularly called the Burnt Palace, Palacio Quemado) in La Paz. In the case that no candidate receives an absolute majority of the popular vote or more than 40% of the vote with an advantage of more than 10% over the second-place finisher, a run-off is to be held among the two candidates most voted.\n\nThe Asamblea Legislativa Plurinacional (Plurinational Legislative Assembly or National Congress) has two chambers. The Cámara de Diputados (Chamber of Deputies) has 130 members elected to five-year terms, seventy from single-member districts (circunscripciones), sixty by proportional representation, and seven by the minority indigenous peoples of seven departments. The Cámara de Senadores (Chamber of Senators) has 36 members (four per department). Members of the Assembly are elected to five-year terms. The body has its headquarters on the Plaza Murillo in La Paz, but also holds honorary sessions elsewhere in Bolivia. The Vice President serves as titular head of the combined Assembly.\n\nThe judiciary consists of the Supreme Court, the Constitutional Tribunal, the Judiciary Council, Agrarian and Environmental Tribunal, and District (departmental) and lower courts. In October 2011, Bolivia held its first judicial elections to choose members of the national courts by popular vote, a reform brought about by Evo Morales.\n\nThe Plurinational Electoral Organ is an independent branch of government which replaced the National Electoral Court in 2010. The branch consists of the Supreme Electoral Tribunal, the nine Departmental Electoral Tribunals, Electoral Judges, the anonymously selected Juries at Election Tables, and Electoral Notaries. Wilfredo Ovando presides over the seven-member Supreme Electoral Tribunal. Its operations are mandated by the Constitution and regulated by the Electoral Regime Law (Law 026, passed 2010). The Organ's first elections were the country's first judicial election in October 2011, and five municipal special elections held in 2011.\n\nCapital \n\nBolivia has its constitutionally recognized capital in Sucre, while La Paz is the seat of government. La Plata (now Sucre) was proclaimed provisional capital of the newly independent Alto Perú (later, Bolivia) on 1 July 1826. On 12 July 1839, President José Miguel de Velasco proclaimed a law naming the city as the capital of Bolivia, and renaming it in honor of the revolutionary leader Antonio José de Sucre. The Bolivian seat of government moved to La Paz at the start of the twentieth century, as a consequence of Sucre's relative remoteness from economic activity after the decline of Potosí and its silver industry and of the Liberal Party in the War of 1899.\n\nThe 2009 Constitution assigns the role of national capital to Sucre, not referring to La Paz in the text. In addition to being the constitutional capital, the Supreme Court of Bolivia is located in Sucre, making it the judicial capital. Nonetheless, the Palacio Quemado (the Presidential Palace and seat of Bolivian executive power) is located in La Paz, as are the National Congress and Plurinational Electoral Organ. La Paz thus continues to be the seat of government.\n\nLaw and crime \n\nThere are 53 prisons in Bolivia, which incarcerate around 8,700 people . The prisons are managed by the Penitentiary Regime Directorate (). There are 17 prisons in departmental capital cities and 36 provincial prisons.\n\nForeign relations \n\nDespite losing its maritime coast, the so-called Litoral Department, after the War of the Pacific, Bolivia has historically maintained, as a state policy, a maritime claim to that part of Chile; the claim asks for sovereign access to the Pacific Ocean and its maritime space. The issue has also been presented before the Organization of American States; in 1979, the OAS passed the 426 Resolution, which declared that the Bolivian problem is a hemispheric problem. On 4 April 1884, a truce was signed with Chile, whereby Chile gave facilities of access to Bolivian products through Antofagasta, and freed the payment of export rights in the port of Arica. In October 1904, the Treaty of Peace and Friendship was signed, and Chile agreed to build a railway between Arica and La Paz, to improve access of Bolivian products to the ports.\n\nThe Special Economical Zone for Bolivia in Ilo (ZEEBI) is a special economic area of 5 km of maritime coast, and a total extension of 358 ha, called Mar Bolivia (\"Sea Bolivia\"), where Bolivia may maintain a free port near Ilo, Peru under its administration and operation for a period of 99 years starting in 1992; once that time has passed, all the construction and territory revert to the Peruvian government. Since 1964, Bolivia has had its own port facilities in the Bolivian Free Port in Rosario, Argentina. This port is located on the Paraná River, which is directly connected to the Atlantic Ocean.\n\nMilitary \n\nThe Bolivian military comprises three branches: Ejército (Army), Naval (Navy) and Fuerza Aérea (Air Force). The legal age for voluntary admissions is 18; however, when the numbers are small the government recruits anyone as young as 14. The tour of duty is generally 12 months. The Bolivian government annually spends $130 million on defense.\n\nThe Bolivian army has around 31,500 men. There are six military regions (regiones militares—RMs) in the army. The army is organized into ten divisions.\n\nThough it is landlocked Bolivia keeps a navy. The Bolivian Naval Force (Fuerza Naval Boliviana in Spanish) is a naval force about 5,000 strong in 2008.\n\nThe Bolivian Air Force ('Fuerza Aérea Boliviana' or 'FAB') has nine air bases, located at La Paz, Cochabamba, Santa Cruz, Puerto Suárez, Tarija, Villamontes, Cobija, Riberalta, and Roboré.\n\nAdministrative divisions \n\nBolivia has nine departments—Pando, La Paz, Beni, Oruro, Cochabamba, Santa Cruz, Potosí, Chuquisaca, Tarija.\n\nAccording to what is established by the Bolivian Political Constitution, the Law of Autonomies and Decentralization regulates de procedure for the elaboration of Statutes of Autonomy, the transfer and distribution of direct competences between the central government and the autonomous entities.Political Constitution of Bolivia, Article 271\n\nThere are four levels of decentralization: Departmental government, constituted by the Departmental Assembly, with rights over the legislation of the department. The governor is chosen by universal suffrage. Municipal government, constituted by a Municipal Council, with rights over the legislation of the municipality. The mayor is chosen by universal suffrage. Regional government, formed by several provinces or municipalities of geographical continuity within a department. It is constituted by a Regional Assembly. Original indigenous government, self-governance of original indigenous people on the ancient territories where they live.\n\nEconomy \n\nBolivia's estimated 2012 gross domestic product (GDP) totaled $27.43 billion at official exchange rate and $56.14 billion at purchasing power parity. Economic growth was estimated to be at about 5.2%, and inflation was estimated at about 6.9%. Bolivia was rated \"Repressed\" by The Heritage Foundation's 2010 Index of Economic Freedom. Despite a series of mostly political setbacks, between 2006 and 2009 the Morales administration has spurred growth higher than at any point in the preceding 30 years. The growth was accompanied by a moderate decrease in inequality. A surplus budget of 1.7% (GDP) was obtained by 2012, the government runs surpluses since Morales administration reflecting a prudent economic management.\n\nA major blow to the Bolivian economy came with a drastic fall in the price of tin during the early 1980s, which impacted one of Bolivia's main sources of income and one of its major mining industries. Since 1985, the government of Bolivia has implemented a far-reaching program of macroeconomic stabilization and structural reform aimed at maintaining price stability, creating conditions for sustained growth, and alleviating scarcity. A major reform of the customs service has significantly improved transparency in this area. Parallel legislative reforms have locked into place market-liberal policies, especially in the hydrocarbon and telecommunication sectors, that have encouraged private investment. Foreign investors are accorded national treatment.\n\nIn April 2000, Hugo Banzer, the former President of Bolivia, signed a contract with Aguas del Tunari, a private consortium, to operate and improve the water supply in Bolivia's third-largest city, Cochabamba. Shortly thereafter, the company tripled the water rates in that city, an action which resulted in protests and rioting among those who could no longer afford clean water. Amidst Bolivia's nationwide economic collapse and growing national unrest over the state of the economy, the Bolivian government was forced to withdraw the water contract.\n\nBolivia has the second largest natural gas reserves in South America. The government has a long-term sales agreement to sell natural gas to Brazil through 2019. The government held a binding referendum in 2005 on the Hydrocarbon Law.\n\nThe US Geological Service estimates that Bolivia has 5.4 million cubic tonnes of lithium, which represent 50%–70% of world reserves. However, to mine for it would involve disturbing the country's salt flats (called Salar de Uyuni), an important natural feature which boosts tourism in the region. The government does not want to destroy this unique natural landscape to meet the rising world demand for lithium. On the other hand, sustainable extraction of lithium is attempted by the government. This project is carried out by the public company \"Recursos Evaporíticos\" subsidiary of COMIBOL.\n\nOnce Bolivia's government depended heavily on foreign assistance to finance development projects and to pay the public staff. At the end of 2002, the government owed $4.5 billion to its foreign creditors, with $1.6 billion of this amount owed to other governments and most of the balance owed to multilateral development banks. Most payments to other governments have been rescheduled on several occasions since 1987 through the Paris Club mechanism. External creditors have been willing to do this because the Bolivian government has generally achieved the monetary and fiscal targets set by IMF programs since 1987, though economic crises have undercut Bolivia's normally good record. However, by 2013 the foreign assistance is just a fraction of the government budget thanks to tax collection mainly from the profitable exports to Brazil and Argentina of natural gas.\n\nThe income from tourism has become increasingly important. Bolivia's tourist industry has grown gradually since about 1990.\n\nForeign-exchange reserves \n\nThe amount in reserve currencies and gold held by Bolivia's Central Bank advanced from 1.085 billion US dollars in 2000, under Hugo Banzer Suarez's government, to 15.282 billion US dollars in 2014 under Evo Morales' government.\n\nTransport \n\nAir traffic\n\nThe General Directorate of Civil Aeronautics (Dirección General de Aeronáutica Civil—DGAC) formerly part of the FAB, administers a civil aeronautics school called the National Institute of Civil Aeronautics (Instituto Nacional de Aeronáutica Civil—INAC), and two commercial air transport services TAM and TAB.\n\nTAM – Transporte Aéreo Militar (the Bolivian Military Airline) is an airline based in La Paz, Bolivia. It is the civilian wing of the 'Fuerza Aérea Boliviana' (the Bolivian Air Force), operating passenger services to remote towns and communities in the North and Northeast of Bolivia. TAM (a.k.a. TAM Group 71) has been a part of the FAB since 1945.\n\nA similar airline serving the Beni Department with small planes is Línea Aérea Amaszonas, using smaller planes than TAM.\n\nAlthough a civil transport airline, TAB – Transportes Aéreos Bolivianos, was created as a subsidiary company of the FAB in 1977. It is subordinate to the Air Transport Management (Gerencia de Transportes Aéreos) and is headed by an FAB general. TAB, a charter heavy cargo airline, links Bolivia with most countries of the Western Hemisphere; its inventory includes a fleet of Hercules C130 aircraft. TAB is headquartered adjacent to El Alto International Airport. TAB flies to Miami and Houston, with a stop in Panama.\n\nThe three largest, and main international airports in Bolivia are El Alto International Airport in La Paz, Viru Viru International Airport in Santa Cruz, and Jorge Wilstermann International Airport in Cochabamba.\n\nRailways\n\nBolivia possesses an extensive but aged rail system, all in 1000 mm gauge, consisting of two disconnected networks.\n\nTechnology \n\nBolivia owns a communications satellite which was offshored/outsourced and launched by China named Túpac Katari 1. In 2015, it was announced that electrical power advancements include a planned $300 million nuclear reactor developed by the Russian nuclear company Rosatom.\n\nWater supply and sanitation \n\nBolivias's drinking water and Sanitation coverage has greatly improved since 1990 due to a considerable increase\nin sectoral investment. However, the country has the continent's lowest coverage levels and services are of low \nquality. Political and institutional instability have \ncontributed to the weakening of the sector's institutions at the \nnational and local levels.\n\nTwo concessions to foreign private companies in two of the three largest cities – Cochabamba and La Paz/El Alto — were prematurely ended in 2000 and 2006 respectively. The country's second largest city, Santa Cruz de la Sierra, relatively successfully manages its own water and sanitation system by way of cooperatives. The government of Evo Morales intends to  strengthen citizen participation within the sector. Increasing coverage requires a substantial increase of investment financing.\n\nAccording to the government the main problems in the sector are low access to sanitation throughout the country; low access to  water in rural areas; insufficient and ineffective investments; a low visibility of community service providers; a lack of respect of indigenous customs; \"technical and institutional difficulties in the design and implementation of projects\"; a lack of capacity to operate and maintain infrastructure; an institutional framework that is \"not consistent with the political change in the country\"; \"ambiguities in the social participation schemes\"; a reduction in the quantity and \nquality of water due to climate change; pollution and a lack of integrated water resources management; and the lack of policies and programs for the reuse of wastewater.Estado Plurinacional de Bolivia:[http://www.mmaya.gob.bo/documentos/pnsb_final.pdf Plan Nacional de Saneamiento Basico 2008–2015] , retrieved on September 30, 2010\n\nOnly 27% of the population has access to improved sanitation, 80 to 88% has access to improved water sources. Coverage in urban areas is bigger than in rural ones.[http://www.wssinfo.org/about-the-jmp/introduction/ JMP 2010 Estimates for Bolivia] . The estimates are based on the Household Survey (2005), the Bolivia Democratic and Health Survey (2008) and other surveys.\n\nDemographics \n\nAccording to the last two censuses carried out by the Bolivian National Statistics Institute (Instituto Nacional de Estadística, INE), the population increased from 8,274,325 (from which 4,123,850 were men and 4,150,475 were women) in 2001 to 10,027,254 in 2012.\n\nIn the last fifty years the Bolivian population has tripled, reaching a population growth rate of 2.25%. The growth of the population in the inter-census periods (1950–1976 and 1976–1992) was approximately 2.05%, while between the last period, 1992–2001, it reached 2.74% annually.\n\nSome 62.43% of Bolivians live in urban areas, while the remaining 37.57% in rural areas. The most part of the population (70%) is concentrated in the departments of La Paz, Santa Cruz and Cochabamba. In the Andean Altiplano region the departments of La Paz and Oruro hold the largest percentage of population, in the valley region the largest percentage is held by the departments of Cochabamba and Chuquisaca, while in the Llanos region by Santa Cruz and Beni. At national level, the population density is 8.49, with variations marked between 0.8 (Pando Department) and 26.2 (Cochabamba Department).\n\nThe largest population center is located in the so-called \"central axis\" and in the Llanos region. Bolivia has a young population. According to the 2011 census, 59% of the population is between 15 and 59 years old, 39% is less than 15 years old. Almost 60% of the population is younger than 25 years of age.\n\nGenetics \n\nAccording to a genetic study done on Bolivians, average values of Native American, European and African ancestry are 86%, 12.5%, and 1.5%, in individuals from La Paz and 76.8%, 21.4%, and 1.8% in individuals from Chuquisaca; respectively.\n\nEthnic and Racial Classifications \n\nThe ethnic composition of Bolivia is diverse, and racial classifications, though outdated, are abundant. There are approximately three dozen native groups totaling approximately half of the Bolivian population – the largest proportion of indigenous people in Latin America. Exact numbers vary based on the wording of the ethnicity question and the available response choices. For example, the 2001 census did not provide the racial category \"mestizo\" as a response choice, resulting in a much higher proportion of respondents identifying themselves as belonging to one of the available indigenous ethnicity choices. Mestizos are distributed throughout the entire country and make up 26% of the Bolivian population. Most people assume their mestizo identity while at the same time identifying themselves with one or more indigenous cultures.  A 2009 estimate of racial classification put mestizo (mixed white and Amerindian) at 68%, indigenous at 20%, white at 5%, cholo at 2%, black at 1%, other at 1%, while 3% were unspecified; 44% attributed themselves to some indigenous group, predominantly the linguistic categories of Quechuas or Aymaras.  Whites comprised about 14% of the population in 2006, and are usually concentrated in the largest cities: La Paz, Santa Cruz de la Sierra and Cochabamba, but as well in some minor cities like Tarija. In the Santa Cruz Department, there are several dozen colonies of German-speaking Mennonites from Russia totaling around 40,000 inhabitants ().\n\nAfro-Bolivians, descendents of African slaves who arrived in the time of the Spanish Empire, inhabit the department of La Paz, and are located mainly in the provinces of Nor Yungas and Sud Yungas. Slavery was abolished in Bolivia in 1831.  There are also important communities of Japanese (14.000) and Lebanese (12.900).  \n\nIndigenous peoples, also called \"originarios\" (\"native\" or \"original\") and less frequently, Amerindians, could be categorized by geographic area, such as Andean, like the Aymaras and Quechuas (who formed the ancient Inca Empire), who are concentrated in the western departments of La Paz, Potosí, Oruro, Cochabamba and Chuquisaca. There also are ethnic populations in the east, composed of the Chiquitano, Chane, Guaraní and Moxos, among others, who inhabit the departments of Santa Cruz, Beni, Tarija and Pando.\n\nThere are small numbers of European citizens from Germany, France, Italy and Portugal, as well as from other American countries, as Argentina, Brazil, Chile, Colombia, Cuba, Ecuador, the United States, Paraguay, Peru, Mexico and Venezuela, among others. There are important Peruvian colonies in La Paz, El Alto and Santa Cruz de la Sierra.\n\nIndigenous peoples \n\nThe Indigenous peoples of Bolivia can be divided into two categories of ethnic groups: the Andeans, who are located in the Andean Altiplano and the valley region; and the lowland groups, who inhabit the warm regions of central and eastern Bolivia, including the valleys of Cochabamba Department, the Amazon Basin areas of northern La Paz Department, and the lowland departments of Beni, Pando, Santa Cruz, and Tarija (including the Gran Chaco region in the southeast of the country). Large numbers of Andean peoples have also migrated to form Quechua, Aymara, and intercultural communities in the lowlands.\n\n*Andean ethnicities\n** Aymara people. They live on the high plateau of the departments of La Paz, Oruro and Potosí, as well as some small regions near the tropical flatlands.\n** Quechua people. They mostly inhabit the valleys in Cochabamba and Chuquisaca. They also inhabit some mountain regions in Potosí and Oruro. They divide themselves into different Quechua nations, as the Tarabucos, Ucumaris, Chalchas, Chaquies, Yralipes, Tirinas, among others.\n** Uru people\n*Ethnicities of the Eastern Lowlands\n** Guaraníes. Made up of Guarayos, Pausernas, Sirionos, Chiriguanos, Wichí, Chulipis, Taipetes, Tobas and Yuquis.\n**Tacanas: Made up of Lecos, Chimanes, Araonas and Maropas.\n**Panos: Made up of Chacobos, Caripunas, Sinabos, Capuibos and Guacanaguas.\n**Aruacos: Made up of Apolistas, Baures, Moxos, Chané, Movimas, Cayabayas, Carabecas, Paiconecas or Paucanacas.\n**Chapacuras: Made up of Itenez or More, Chapacuras, Sansinonianos, Canichanas, Itonamas, Yuracares, Guatoses and Chiquitos.\n**Botocudos: Made up of Bororos y Otuquis.\n**Zamucos: Made up of Ayoreos.\n\nLanguage \n\nBolivia has great linguistic diversity as a result of its multiculturalism. The Constitution of Bolivia recognizes 36 official languages besides Spanish: Aymara, Araona, Baure, Bésiro, Canichana, Cavineño, Cayubaba, Chácobo, Chimán, Ese Ejja, Guaraní, Guarasu'we, Guarayu, Itonama, Leco, Machajuyai-Kallawaya, Machineri, Maropa, Mojeño-Ignaciano, Mojeño-Trinitario, Moré, Mosetén, Movima, Pacawara, Puquina, Quechua, Sirionó, Tacana, Tapieté, Toromona, Uru-Chipaya, Weenhayek, Yaminawa, Yuki, Yuracaré, and Zamuco.\n\nSpanish is the most spoken official language in the country, according to the 2001 census; as it is spoken bym two thirds of the population. All legal and official documents issued by the State, including the Constitution, the main private and public institutions, the media, and commercial activities, are in Spanish.\n\nThe main indigenous languages are: Quechua (21.2% of the population in the 2001 census), Aymara (14.6%), Guarani (0.6%) and others (0.4%) including the Moxos in the department of Beni.\n\nPlautdietsch, a German dialect, is spoken by about 70,000 Mennonites in Santa Cruz. Portuguese is spoken mainly in the areas close to Brazil.\n\nReligion \n\nBolivia is a constitutionally secular state that guarantees the freedom of religion and the independence of government from religion.\"\n\nAccording to the 2001 census conducted by the National Institute of Statistics of Bolivia, 78 percent of the population is Roman Catholic, followed by 19 percent Protestant and 3 percent non-religious.\n\nThe Association of Religion Data Archives (relying on the World Christian Database) records that in 2010, 92.5 percent of Bolivians identified as Christian (of any denomination), 3.1 percent identified with indigenous religion, 2.2 percent identified as Bahá'í, 1.9 percent identified as agnostic, and all other groups constituted 0.1 percent or less.\n\nMuch of the indigenous population adheres to different traditional beliefs marked by inculturation or syncretisim with Christianity. The cult of Pachamama, or \"Mother Earth\", is notable. The veneration of the Virgin of Copacabana, Virgin of Urkupiña and Virgin of Socavón, is also an important feature. There also are important Aymaran communities near Lake Titicaca that have a strong devotion to James the Apostle. Deities worshiped in Bolivia include Ekeko, the Aymaran god of abundance and prosperity, whose day is celebrated every 24 January, and Tupá, a god of the Guaraní people.\n\nLargest cities and towns \n\nApproximately 67 percent of Bolivians live in urban areas, among the lowest proportion in South America. Nevertheless, the rate of urbanization is growing steadily, at around 2.5 percent annually. According to the 2012 census, there are total of 3,158,691 households in Bolivia – an increase of 887,960 from 2001. In 2009, 75.4 percent of homes were classified as a house, hut, or Pahuichi; 3.3 percent were apartments; 21.1 percent were rental residences; and 0.1 percent were mobile homes. Most of the country's largest cities are located in the highlands of the west and central regions.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bolivia" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3462" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Bolivia (;; ; ; ), officially known as the Plurinational State of Bolivia (), is a landlocked country located in western-central South America. The capital is Sucre while the seat of government is located in La Paz. The largest city and principal economic and financial center is Santa Cruz de la Sierra, located on the Llanos Orientales (Tropical lowlands) a mostly flat region in the East of Bolivia.\n\nIt is constitutionally a unitary state, divided into nine departments. Its geography varies from the peaks of the Andes in the West, to the Eastern Lowlands, situated within the Amazon Basin. It is bordered to the north and east by Brazil, to the southeast by Paraguay, to the south by Argentina, to the southwest by Chile, and to the northwest by Peru. One-third of the country is within the Andean mountain range. With  of area, Bolivia is the 5th largest country in South America and the 27th largest in the world.\n\nThe country's population, estimated at 11 million, is multiethnic, including Amerindians, Mestizos, Europeans, Asians and Africans. The racial and social segregation that arose from Spanish colonialism has continued to the modern era. Spanish is the official and predominant language, although 36 indigenous languages also have official status, of which the most commonly spoken are Guarani, Aymara and Quechua languages.\n\nBefore Spanish colonization, the Andean region of Bolivia was part of the Inca Empire, while the northern and eastern lowlands were inhabited by independent tribes. Spanish conquistadors arriving from Cuzco and Asunción took control of the region in the 16th century. During the Spanish colonial period Bolivia was administered by the Royal Audiencia of Charcas. Spain built its empire in great part upon the silver that was extracted from Bolivia's mines.\nAfter the first call for independence in 1809, 16 years of war followed before the establishment of the Republic, named for Simón Bolívar. It has been landlocked since the annexation of its Pacific coast territory by Chile following the War of the Pacific (1879–84).\n\nModern Bolivia is a charter member of the UN, IMF, NAM, OAS, ACTO, Bank of the South, ALBA and USAN. For over a decade Bolivia has had one of the fastest economic growths in Latin America, however it remains one poorest countries in South America, . It is a developing country, with a medium ranking in the Human Development Index, a poverty level of 38,6 percent,, and it is one of the top three safest countries in Latin America. It Its main economic activities include agriculture, forestry, fishing, mining, and manufacturing goods such as textiles, clothing, refined metals, and refined petroleum. Bolivia is very wealthy in minerals, especially tin.\n\nEtymology \n\nBolivia is named after Simón Bolívar, a leader in the Spanish American wars of independence. The leader of Venezuela, Antonio José de Sucre, had been given the option by Bolívar to either unite Charcas (present-day Bolivia) with the newly formed Republic of Peru, to unite with the United Provinces of Rio de la Plata, or to formally declare its independence from Spain as a wholly independent nation. Sucre opted to create a brand new nation and on 6 August 1825, with local support, named it in honor of Simón Bolívar.\n\nThe original name was Republic of Bolívar. Some days later, congressman Manuel Martín Cruz proposed: \"If from Romulus comes Rome, then from Bolívar comes Bolivia\" (). The name was approved by the Republic on 3 October 1825. In 2009, a new constitution changed the country's official name to \"Plurinational State of Bolivia\" in recognition of the multi-ethnic nature of the country and the enhanced position of Bolivia's indigenous peoples under the new constitution.\n\nHistory \n\nPre-colonial \n\nThe region now known as Bolivia had been occupied for over 2,500 years when the Aymara arrived. However, present-day Aymara associate themselves with the ancient civilization of the Tiwanaku culture which had its capital at Tiwanaku, in Western Bolivia. The capital city of Tiwanaku dates from as early as 1500 BC when it was a small, agriculturally based village.\n\nThe community grew to urban proportions between AD 600 and AD 800, becoming an important regional power in the southern Andes. According to early estimates, the city covered approximately  at its maximum extent and had between 15,000 and 30,000 inhabitants. In 1996 satellite imaging was used to map the extent of fossilized suka kollus (flooded raised fields) across the three primary valleys of Tiwanaku, arriving at population-carrying capacity estimates of anywhere between 285,000 and 1,482,000 people.\n\nAround AD 400, Tiwanaku went from being a locally dominant force to a predatory state. Tiwanaku expanded its reaches into the Yungas and brought its culture and way of life to many other cultures in Peru, Bolivia, and Chile. Tiwanaku was not a violent culture in many respects. In order to expand its reach, Tiwanaku exercised great political astuteness, creating colonies, fostering trade agreements (which made the other cultures rather dependent), and instituting state cults.\n\nThe empire continued to grow with no end in sight. William H. Isbell states \"Tiahuanaco underwent a dramatic transformation between AD 600 and 700 that established new monumental standards for civic architecture and greatly increased the resident population.\" Tiwanaku continued to absorb cultures rather than eradicate them. Archaeologists note a dramatic adoption of Tiwanaku ceramics into the cultures which became part of the Tiwanaku empire. Tiwanaku's power was further solidified through the trade it implemented among the cities within its empire.\n\nTiwanaku's elites gained their status through the surplus food they controlled, collected from outlying regions and then redistributed to the general populace. Further, this elite's control of llama herds became a powerful control mechanism as llamas were essential for carrying goods between the civic centre and the periphery. These herds also came to symbolize class distinctions between the commoners and the elites. Through this control and manipulation of surplus resources, the elite's power continued to grow until about AD 950. At this time a dramatic shift in climate occurred, causing a significant drop in precipitation in the Titicaca Basin, believed by archaeologists to have been on the scale of a major drought.\n\nAs the rainfall decreased, many of the cities farther away from Lake Titicaca began to tender fewer foodstuffs to the elites. As the surplus of food decreased, and thus the amount available to underpin their power, the control of the elites began to falter. The capital city became the last place viable for food production due to the resiliency of the raised field method of agriculture. Tiwanaku disappeared around AD 1000 because food production, the main source of the elites' power, dried up. The area remained uninhabited for centuries thereafter.\n\nBetween 1438 and 1527, the Inca empire, during its expansion from its capital at Cuzco, Peru. It gained control over much of what is now Andean Bolivia and extended its control into the fringes of the Amazon basin.\n\nColonial period \n\nThe Spanish conquest of the Inca empire began in 1524, and was mostly completed by 1533. The territory now called Bolivia was known as Charcas, and was under the authority of the Viceroy of Lima. Local government came from the Audiencia de Charcas located in Chuquisaca (La Plata—modern Sucre). Founded in 1545 as a mining town, Potosí soon produced fabulous wealth, becoming the largest city in the New World with a population exceeding 150,000 people.\n\nBy the late 16th century, Bolivian silver was an important source of revenue for the Spanish Empire. A steady stream of natives served as labor force under the brutal, slave conditions of the Spanish version of the pre-Columbian draft system called the mita. Charcas was transferred to the Viceroyalty of the Río de la Plata in 1776 and the people from Buenos Aires, the capital of the Viceroyalty, coined the term \"Upper Peru\" () as a popular reference to the Royal Audiencia of Charcas. Túpac Katari led the indigenous rebellion that laid siege to La Paz in March 1781, during which 20,000 people died. As Spanish royal authority weakened during the Napoleonic wars, sentiment against colonial rule grew.\n\nIndependence and subsequent wars \n\nThe struggle for independence started in the city of Sucre on 25 May 1809 and the Chuquisaca Revolution (Chuquisaca was then the name of the city) is known as the first cry of Freedom in Latin America. That revolution was followed by the La Paz revolution on 16 July 1809. The La Paz revolution marked a complete split with the Spanish government, while the Chuquisaca Revolution established a local independent junta in the name of the Spanish King deposed by Napoleon Bonaparte. Both revolutions were short-lived and defeated by the Spanish authorities in the Viceroyalty of the Rio de La Plata, but the following year the Spanish American wars of independence raged across the continent.\n\nBolivia was captured and recaptured many times during the war by the royalists and patriots. Buenos Aires sent three military campaigns, all of which were defeated, and eventually limited itself to protecting the national borders at Salta. Bolivia was finally freed of Royalist dominion by Antonio José de Sucre, with a military campaign coming from the North in support of the campaign of Simón Bolívar. After 16 years of war the Republic was proclaimed on 6 August 1825.\n\nIn 1836, Bolivia, under the rule of Marshal Andrés de Santa Cruz, invaded Peru to reinstall the deposed president, General Luis José de Orbegoso. Peru and Bolivia formed the Peru-Bolivian Confederation, with de Santa Cruz as the Supreme Protector. Following tension between the Confederation and Chile, Chile declared war on 28 December 1836. Argentina separately declared war on the Confederation on 9 May 1837. The Peruvian-Bolivian forces achieved several major victories during the War of the Confederation: the defeat of the Argentine expedition and the defeat of the first Chilean expedition on the fields of Paucarpata near the city of Arequipa.\n\nAt the outset of the war, the Chilean and Peruvian rebel army surrendered unconditionally and signed the Paucarpata Treaty. The treaty stipulated that Chile would withdraw from Peru-Bolivia, Chile would return captured Confederate ships, economic relations would be normalized, and the Confederation would pay Peruvian debt to Chile. In Chile, the government and public rejected the peace treaty. Chile organized a second attack on the Confederation and defeated it in the Battle of Yungay. After this defeat, Santa Cruz resigned and went to exile in Ecuador and then Paris, and the Peruvian-Bolivian Confederation was dissolved.\n\nFollowing the renewed independence of Peru, Peruvian president General Agustín Gamarra invaded Bolivia. The Peruvian army was decisively defeated at the Battle of Ingavi on 20 November 1841 where Gamarra was killed. The Bolivian army under General José Ballivián then mounted a counter-offensive, capturing the Peruvian port of Arica. Later, both sides signed a peace treaty in 1842, putting a final end to the war.\n\nA period of political and economic instability in the early-to-mid-19th century weakened Bolivia. In addition, during the War of the Pacific (1879–83), Chile  occupied vast territories rich in natural resources south west of Bolivia, including the Bolivian coast. Chile took control of today's Chuquicamata area, the adjoining rich salitre (saltpeter) fields, and the port of Antofagasta among other Bolivian territories.\n\nThus, since independence, Bolivia has lost over half of its territory to neighboring countries. It also lost the state of Acre, in the Acre War, important because this region was known for its production of rubber. Peasants and the Bolivian army fought briefly but after a few victories, and facing the prospect of a total war against Brazil, it was forced to sign the Treaty of Petrópolis in 1903, in which Bolivia lost this rich territory. Popular myth has it that Bolivian president Mariano Melgarejo (1864–71) traded the land for what he called \"a magnificent white horse\" and Acre was subsequently flooded by Brazilians, which ultimately led to confrontation and fear of war with Brazil. In the late 19th century, an increase in the world price of silver brought Bolivia relative prosperity and political stability.\n\nEarly 20th century \n\nDuring the early 20th century, tin replaced silver as the country's most important source of wealth. A succession of governments controlled by the economic and social elite followed laissez-faire capitalist policies through the first thirty years of the 20th century.\n\nLiving conditions of the native people, who constitute most of the population, remained deplorable. With work opportunities limited to primitive conditions in the mines and in large estates having nearly feudal status, they had no access to education, economic opportunity, and political participation. Bolivia's defeat by Paraguay in the Chaco War (1932–35), where Bolivia lost a great part of the Gran Chaco region in dispute, marked a turning-point. [http://www.geography.wisc.edu/archiveNews/2006/pdf/NYT-History%20Geography%20Bolivia.pdf (PDF)] , University of Wisconsin–Madison, Department of Geography\n\nThe Revolutionary Nationalist Movement (MNR), the most historic political party, emerged as a broad-based party. Denied its victory in the 1951 presidential elections, the MNR led a successful revolution in 1952. Under President Víctor Paz Estenssoro, the MNR, having strong popular pressure, introduced universal suffrage into his political platform and carried out a sweeping land-reform promoting rural education and nationalization of the country's largest tin mines.\n\nLate 20th century \n\n12 years of tumultuous rule left the MNR divided. In 1964, a military junta overthrew President Estenssoro at the outset of his third term. The 1969 death of President René Barrientos Ortuño, a former member of the junta who was elected president in 1966, led to a succession of weak governments. Alarmed by the rising Popular Assembly and the increase in the popularity of President Juan José Torres, the military, the MNR, and others installed Colonel (later General) Hugo Banzer Suárez as president in 1971. He returned to the presidency in 1997 through 2001.\n\nThe United States' Central Intelligence Agency (CIA) had been active in providing finances and training to the Bolivian military dictatorship in the 1960s. The revolutionary leader Che Guevara was killed by a team of CIA officers and members of the Bolivian Army on 9 October 1967, in Bolivia. Félix Rodríguez was a CIA officer on the team with the Bolivian Army that captured and shot Guevara. Rodriguez said that after he received a Bolivian presidential execution order, he told \"the soldier who pulled the trigger to aim carefully, to remain consistent with the Bolivian government's story that Che had been killed in action during a clash with the Bolivian army.\" Rodriguez said the US government had wanted Che in Panama, and \"I could have tried to falsify the command to the troops, and got Che to Panama as the US government said they had wanted\", but that he had chosen to \"let history run its course\" as desired by Bolivia.\n\nElections in 1979 and 1981 were inconclusive and marked by fraud. There were coups d'état, counter-coups, and caretaker governments. In 1980, General Luis García Meza Tejada carried out a ruthless and violent coup d'état that did not have popular support. He pacified the people by promising to remain in power only for one year. At the end of the year, he staged a televised rally to claim popular support and announced, \"Bueno, me quedo\", or, \"All right; I'll stay [in office].\" After a military rebellion forced out Meza in 1981, three other military governments in 14 months struggled with Bolivia's growing problems. Unrest forced the military to convoke the Congress, elected in 1980, and allow it to choose a new chief executive. In October 1982, Hernán Siles Zuazo again became president, 22 years after the end of his first term of office (1956–60).\n\nDemocratic transition \n\nGonzalo Sánchez de Lozada pursued an aggressive economic and social reform agenda. The most dramatic reform was the \"capitalization\" program, under which investors, typically foreign, acquired 50% ownership and management control of public enterprises in return for agreed upon capital investments.\n\nIn 1993, Gonzalo Sánchez de Lozada ran for president in alliance with the Tupac Katari Revolutionary Liberation Movement, which inspired indigenous-sensitive and multicultural-aware policies. In 1993, Sanchez de Lozada introduced the Plan de Todos, which led to the decentralization of government, introduction of intercultural bilingual education, implementation of agrarian legislation, and privatization of state owned businesses. The plan explicitly stated that Bolivian citizens would own a minimum of 51% of enterprises; under the plan, most state-owned enterprises (SOEs), though not mines, were sold. This privatization of SOEs led to a neoliberal structuring.\n\nThe Law of Popular Participation gave municipalities the responsibility of maintaining various infrastructures (and offering services): health, education, systems of irrigation, which stripped the responsibility away from the state.\n\nThe reforms and economic restructuring were strongly opposed by certain segments of society, which instigated frequent and sometimes violent protests, particularly in La Paz and the Chapare coca-growing region, from 1994 through 1996. During this time, the umbrella labor-organization of Bolivia, the Central Obrera Boliviana (COB), became increasingly unable to effectively challenge government policy. A teachers' strike in 1995 was defeated because the COB could not marshal the support of many of its members, including construction and factory workers.\n\nIn the 1997 elections, General Hugo Banzer, leader of the Nationalist Democratic Action party (ADN) and former dictator (1971–78), won 22% of the vote, while the MNR candidate won 18%. At the outset of his government, President Banzer launched a policy of using special police-units to eradicate physically the illegal coca of the Chapare region. The MIR of Jaime Paz Zamora remained a coalition-partner throughout the Banzer government, supporting this policy (called the Dignity Plan). The Banzer government basically continued the free-market and privatization-policies of its predecessor. The relatively robust economic growth of the mid-1990s continued until about the third year of its term in office. After that, regional, global and domestic factors contributed to a decline in economic growth. Financial crises in Argentina and Brazil, lower world prices for export commodities, and reduced employment in the coca sector depressed the Bolivian economy. The public also perceived a significant amount of public sector corruption. These factors contributed to increasing social protests during the second half of Banzer's term.\n\nBetween January 1999 and April 2000, large-scale protests erupted in Cochabamba, Bolivia's third largest city, in response to the privatisation of water resources by foreign companies and a subsequent doubling of water prices. On 6 August 2001, Banzer resigned from office after being diagnosed with cancer. He died less than a year later. Vice President Jorge Fernando Quiroga Ramírez completed the final year of his term.\n\nIn the June 2002 national elections, former President Gonzalo Sánchez de Lozada (MNR) placed first with 22.5% of the vote, followed by coca-advocate and native peasant-leader Evo Morales (Movement Toward Socialism, MAS) with 20.9%. A July agreement between the MNR and the fourth-place MIR, which had again been led in the election by former President Jaime Paz Zamora, virtually ensured the election of Sánchez de Lozada in the congressional run-off, and on 6 August he was sworn in for the second time. The MNR platform featured three overarching objectives: economic reactivation (and job creation), anti-corruption, and social inclusion.\n\nIn 2003 the Bolivian gas conflict broke out. On 12 October 2003 the government imposed martial law in El Alto after 16 people were shot by the police and several dozen wounded in violent clashes. Faced with the option of resigning or more bloodshed, Sanchez de Lozada offered his resignation in a letter to an emergency session of Congress. After his resignation was accepted and his vice president, Carlos Mesa, invested, he left on a commercially scheduled flight for the United States.\n\nThe country's internal situation became unfavorable for such political action on the international stage. After a resurgence of gas protests in 2005, Carlos Mesa attempted to resign in January 2005, but his offer was refused by Congress. On 22 March 2005, after weeks of new street protests from organizations accusing Mesa of bowing to U.S. corporate interests, Mesa again offered his resignation to Congress, which was accepted on 10 June. The chief justice of the Supreme Court, Eduardo Rodríguez, was sworn as interim president to succeed the outgoing Carlos Mesa.\n\nThe indigenous population of the Andean region was not able to benefit from government reforms.\n\nEvo Morales won the 2005 presidential election with 53.7% of the votes, an absolute majority, unusual in Bolivian elections. On 1 May 2006, Morales caused controversy when he announced his intent to re-nationalize Bolivian hydrocarbon assets. Fulfilling a campaign promise, on 6 August 2006, Morales opened the Bolivian Constituent Assembly to begin writing a new constitution aimed at giving more power to the indigenous majority.\n\nIn August 2007, more conflicts arose in Sucre, as the city demanded the discussion of the seat of government inside the assembly, hoping the executive and legislative branches could return to the city, but the assembly and the government said this demand was overwhelmingly impractical and politically undesirable. In May 2008, Evo Morales was a signatory to the UNASUR Constitutive Treaty of the Union of South American Nations. In the 2009 national general elections, Evo Morales was re-elected with 64.22% of the vote. His party, Movement for Socialism, also won a two-thirds majority in both houses of the National Congress.\n\nGeography \n\nBolivia is located in the central zone of South America, between 57°26'–69°38'W and 9°38'–22°53'S. With an area of 1098581 km2, Bolivia is the world's 28th-largest country, and the fifth largest country in South America, extending from the Central Andes through part of the Gran Chaco as far as the Amazon. The geographic center of the country is the so-called Puerto Estrella (\"Star Port\") on the Río Grande, in Ñuflo de Chávez Province, Santa Cruz Department.\n\nThe geography of the country exhibits a great variety of terrain and climates. Bolivia has a high level of biodiversity, considered one of the greatest in the world, as well as several ecoregions with ecological sub-units such as the Altiplano, tropical rainforests (including Amazon rainforest), dry valleys, and the Chiquitania, which is a tropical savanna. These areas feature enormous variations in altitude, from an elevation of 6542 m above sea level in Nevado Sajama to nearly 70 m along the Paraguay River. Although a country of great geographic diversity, Bolivia has remained a landlocked country since the War of the Pacific.\n\nBolivia can be divided into three physiographic regions:\n\n*The Andean region in the southwest spans 28% of the national territory, extending over 307603 km². This area is located above 3000 m altitude and is located between two big Andean chains, the Cordillera Occidental (\"Western Range\") and the Cordillera Central (\"Central Range\"), with some of the highest spots in the Americas such as the Nevado Sajama, with an altitude of 6542 m, and the Illimani, at 6462 m. Also located in the Cordillera Central is Lake Titicaca, the highest commercially navigable lake in the world and the largest lake in South America; the lake is shared with Peru. Also in this region are the Altiplano and the Salar de Uyuni, which is the largest salt flat in the world and an important source of lithium.\n*The Sub-Andean region in the center and south of the country is an intermediate region between the Altiplano and the eastern llanos (plain); this region comprises 13% of the territory of Bolivia, extending over 142815 km², and encompassing the Bolivian valleys and the Yungas region. It is distinguished by its farming activities and its temperate climate.\n*The Llanos region in the northeast comprises 59% of the territory, with 648163 km². It is located to the north of the Cordillera Central and extends from the Andean foothills to the Paraguay River. It is a region of flat land and small plateaus, all covered by extensive rain forests containing enormous biodiversity. The region is below 400 m above sea level.\n\nBolivia has three drainage basins:\n\n*The first is the Amazon Basin, also called the North Basin (724000 km²/66% of the territory). The rivers of this basin generally have big meanders which form lakes such as Murillo Lake in Pando Department. The main Bolivian tributary to the Amazon basin is the Mamoré River, with a length of 2000 km running north to the confluence with the Beni River, 1113 km in length and the second most important river of the country. The Beni River, along with the Madeira River, forms the main tributary of the Amazon River. From east to west, the basin is formed by other important rivers, such as the Madre de Dios River, the Orthon River, the Abuna River, the Yata River, and the Guaporé River. The most important lakes are Rogaguado Lake, Rogagua Lake, and Jara Lake.\n*The second is the Rio de la Plata Basin, also called the South Basin (229500 km²/21% of the territory). The tributaries in this basin are in general less abundant than the ones forming the Amazon Basin. The Rio de la Plata Basin is mainly formed by the Paraguay River, Pilcomayo River, and Bermejo River. The most important lakes are Uberaba Lake and Mandioré Lake, both located in the Bolivian marshland.\n*The third basin is the Central Basin, which is an endorheic basin (145081 km²/13% of the territory). The Altiplano has large numbers of lakes and rivers that do not run into any ocean because they are enclosed by the Andean mountains. The most important river is the Desaguadero River, with a length of 436 km, the longest river of the Altiplano; it begins in Lake Titicaca and then runs in a southeast direction to Poopó Lake. The basin is then formed by Lake Titicaca, Lake Poopó, the Desaguadero River, and great salt flats, including the Salar de Uyuni and Coipasa Lake.\n\nGeology\n\nThe geology of Bolivia comprises a variety of different lithologies as well as tectonic and sedimentary environments. On a synoptic scale, geological units coincide with topographical units. Most elementally, the country is divided into a mountainous western area affected by the subduction processes in the Pacific and an eastern lowlands of stable platforms and shields.\n\nClimate \n\nThe climate of Bolivia varies drastically from one eco-region to the other, from the tropics in the eastern llanos to a polar climate in the western Andes. The summers are warm, humid in the east and dry in the west, with rains that often modify temperatures, humidity, winds, atmospheric pressure and evaporation, yielding very different climates in different areas. When the climatological phenomenon known as El Niño takes place, it causes great alterations in the weather. Winters are very cold in the west, and it snows in the mountain ranges, while in the western regions, windy days are more common. The autumn is dry in the non-tropical regions.\n*Llanos. A humid tropical climate with an average temperature of 30 °C. The wind coming from the Amazon rainforest causes significant rainfall. In May, there is low precipitation because of dry winds, and most days have clear skies. Even so, winds from the south, called surazos, can bring cooler temperatures lasting several days.\n*Altiplano. Desert-Polar climates, with strong and cold winds. The average temperature ranges from 15 to 20 °C. At night, temperatures descend drastically to slightly above 0 °C, while during the day, the weather is dry and solar radiation is high. Ground frosts occur every month, and snow is frequent.\n*Valleys and Yungas. Temperate climate. The humid northeastern winds are pushed to the mountains, making this region very humid and rainy. Temperatures are cooler at higher elevations. Snow occurs at altitudes of 2000 m.\n*Chaco. Subtropical semi-arid climate. Rainy and humid in January and the rest of the year, with warm days and cool nights.\n\nBiodiversity \n\nBolivia, with an enormous variety of organisms and ecosystems, is part of the \"Like-Minded Megadiverse Countries\".\n\nBolivia's variable altitudes, ranging from 90 - above sea level, allow for a vast biologic diversity. The territory of Bolivia comprises four types of biomes, 32 ecological regions, and 199 ecosystems. Within this geographic area there are several natural parks and reserves such as the Noel Kempff Mercado National Park, the Madidi National Park, the Tunari National Park, the Eduardo Avaroa Andean Fauna National Reserve, and the Kaa-Iya del Gran Chaco National Park and Integrated Management Natural Area, among others.\n\nBolivia boasts over 17,000 species of seed plants, including over 1,200 species of fern, 1,500 species of marchantiophyta and moss, and at least 800 species of fungus. In addition, there are more than 3,000 species of medicinal plants. Bolivia is considered the place of origin for such species as peppers and chili peppers, peanuts, the common beans, yucca, and several species of palm. Bolivia also naturally produces over 4,000 kinds of potatoes.\n\nBolivia has more than 2,900 animal species, including 398 mammals, over 1,400 birds (about 14% of birds known in the world, being the sixth most diverse country in terms of bird species), 204 amphibians, 277 reptiles, and 635 fish, all fresh water fish as Bolivia is a landlocked country. In addition, there are more than 3,000 types of butterfly, and more than 60 domestic animals.\n\nBolivia has gained global attention for its 'Law of the Rights of Mother Earth', which accords nature the same rights as humans.\n\nPolitics and government \n\nBolivia has been governed by democratically elected governments since 1982; prior to that, it was governed by various dictatorships. Presidents Hernán Siles Zuazo (1982–85) and Víctor Paz Estenssoro (1985–89) began a tradition of ceding power peacefully which has continued, although two presidents have stepped down in the face of popular protests: Gonzalo Sánchez de Lozada in 2003 and Carlos Mesa in 2005.\n\nBolivia's multiparty democracy has seen a wide variety of parties in the presidency and parliament, although the Revolutionary Nationalist Movement, Nationalist Democratic Action, and the Revolutionary Left Movement predominated from 1985 to 2005. The current president is Evo Morales, the first indigenous Bolivian to serve as head of state. Morales' Movement for Socialism – Political Instrument for the Sovereignty of the Peoples party was the first to win an outright presidential majority in four decades, doing so both in 2005 and 2009.\n\nThe constitution, drafted in 2006–07 and approved in 2009, provides for balanced executive, legislative, judicial, and electoral powers, as well as several levels of autonomy. The traditionally strong executive branch tends to overshadow the Congress, whose role is generally limited to debating and approving legislation initiated by the executive. The judiciary, consisting of the Supreme Court and departmental and lower courts, has long been riddled with corruption and inefficiency. Through revisions to the constitution in 1994, and subsequent laws, the government has initiated potentially far-reaching reforms in the judicial system as well as increasing decentralizing powers to departments, municipalities, and indigenous territories.\n\nThe executive branch is headed by a President and Vice President, and consists of a variable number (currently, 20) of government ministries. The president is elected to a five-year term by popular vote, and governs from the Presidential Palace (popularly called the Burnt Palace, Palacio Quemado) in La Paz. In the case that no candidate receives an absolute majority of the popular vote or more than 40% of the vote with an advantage of more than 10% over the second-place finisher, a run-off is to be held among the two candidates most voted.\n\nThe Asamblea Legislativa Plurinacional (Plurinational Legislative Assembly or National Congress) has two chambers. The Cámara de Diputados (Chamber of Deputies) has 130 members elected to five-year terms, seventy from single-member districts (circunscripciones), sixty by proportional representation, and seven by the minority indigenous peoples of seven departments. The Cámara de Senadores (Chamber of Senators) has 36 members (four per department). Members of the Assembly are elected to five-year terms. The body has its headquarters on the Plaza Murillo in La Paz, but also holds honorary sessions elsewhere in Bolivia. The Vice President serves as titular head of the combined Assembly.\n\nThe judiciary consists of the Supreme Court, the Constitutional Tribunal, the Judiciary Council, Agrarian and Environmental Tribunal, and District (departmental) and lower courts. In October 2011, Bolivia held its first judicial elections to choose members of the national courts by popular vote, a reform brought about by Evo Morales.\n\nThe Plurinational Electoral Organ is an independent branch of government which replaced the National Electoral Court in 2010. The branch consists of the Supreme Electoral Tribunal, the nine Departmental Electoral Tribunals, Electoral Judges, the anonymously selected Juries at Election Tables, and Electoral Notaries. Wilfredo Ovando presides over the seven-member Supreme Electoral Tribunal. Its operations are mandated by the Constitution and regulated by the Electoral Regime Law (Law 026, passed 2010). The Organ's first elections were the country's first judicial election in October 2011, and five municipal special elections held in 2011.\n\nCapital \n\nBolivia has its constitutionally recognized capital in Sucre, while La Paz is the seat of government. La Plata (now Sucre) was proclaimed provisional capital of the newly independent Alto Perú (later, Bolivia) on 1 July 1826. On 12 July 1839, President José Miguel de Velasco proclaimed a law naming the city as the capital of Bolivia, and renaming it in honor of the revolutionary leader Antonio José de Sucre. The Bolivian seat of government moved to La Paz at the start of the twentieth century, as a consequence of Sucre's relative remoteness from economic activity after the decline of Potosí and its silver industry and of the Liberal Party in the War of 1899.\n\nThe 2009 Constitution assigns the role of national capital to Sucre, not referring to La Paz in the text. In addition to being the constitutional capital, the Supreme Court of Bolivia is located in Sucre, making it the judicial capital. Nonetheless, the Palacio Quemado (the Presidential Palace and seat of Bolivian executive power) is located in La Paz, as are the National Congress and Plurinational Electoral Organ. La Paz thus continues to be the seat of government.\n\nLaw and crime \n\nThere are 53 prisons in Bolivia, which incarcerate around 8,700 people . The prisons are managed by the Penitentiary Regime Directorate (). There are 17 prisons in departmental capital cities and 36 provincial prisons.\n\nForeign relations \n\nDespite losing its maritime coast, the so-called Litoral Department, after the War of the Pacific, Bolivia has historically maintained, as a state policy, a maritime claim to that part of Chile; the claim asks for sovereign access to the Pacific Ocean and its maritime space. The issue has also been presented before the Organization of American States; in 1979, the OAS passed the 426 Resolution, which declared that the Bolivian problem is a hemispheric problem. On 4 April 1884, a truce was signed with Chile, whereby Chile gave facilities of access to Bolivian products through Antofagasta, and freed the payment of export rights in the port of Arica. In October 1904, the Treaty of Peace and Friendship was signed, and Chile agreed to build a railway between Arica and La Paz, to improve access of Bolivian products to the ports.\n\nThe Special Economical Zone for Bolivia in Ilo (ZEEBI) is a special economic area of 5 km of maritime coast, and a total extension of 358 ha, called Mar Bolivia (\"Sea Bolivia\"), where Bolivia may maintain a free port near Ilo, Peru under its administration and operation for a period of 99 years starting in 1992; once that time has passed, all the construction and territory revert to the Peruvian government. Since 1964, Bolivia has had its own port facilities in the Bolivian Free Port in Rosario, Argentina. This port is located on the Paraná River, which is directly connected to the Atlantic Ocean.\n\nMilitary \n\nThe Bolivian military comprises three branches: Ejército (Army), Naval (Navy) and Fuerza Aérea (Air Force). The legal age for voluntary admissions is 18; however, when the numbers are small the government recruits anyone as young as 14. The tour of duty is generally 12 months. The Bolivian government annually spends $130 million on defense.\n\nThe Bolivian army has around 31,500 men. There are six military regions (regiones militares—RMs) in the army. The army is organized into ten divisions.\n\nThough it is landlocked Bolivia keeps a navy. The Bolivian Naval Force (Fuerza Naval Boliviana in Spanish) is a naval force about 5,000 strong in 2008.\n\nThe Bolivian Air Force ('Fuerza Aérea Boliviana' or 'FAB') has nine air bases, located at La Paz, Cochabamba, Santa Cruz, Puerto Suárez, Tarija, Villamontes, Cobija, Riberalta, and Roboré.\n\nAdministrative divisions \n\nBolivia has nine departments—Pando, La Paz, Beni, Oruro, Cochabamba, Santa Cruz, Potosí, Chuquisaca, Tarija.\n\nAccording to what is established by the Bolivian Political Constitution, the Law of Autonomies and Decentralization regulates de procedure for the elaboration of Statutes of Autonomy, the transfer and distribution of direct competences between the central government and the autonomous entities.Political Constitution of Bolivia, Article 271\n\nThere are four levels of decentralization: Departmental government, constituted by the Departmental Assembly, with rights over the legislation of the department. The governor is chosen by universal suffrage. Municipal government, constituted by a Municipal Council, with rights over the legislation of the municipality. The mayor is chosen by universal suffrage. Regional government, formed by several provinces or municipalities of geographical continuity within a department. It is constituted by a Regional Assembly. Original indigenous government, self-governance of original indigenous people on the ancient territories where they live.\n\nEconomy \n\nBolivia's estimated 2012 gross domestic product (GDP) totaled $27.43 billion at official exchange rate and $56.14 billion at purchasing power parity. Economic growth was estimated to be at about 5.2%, and inflation was estimated at about 6.9%. Bolivia was rated \"Repressed\" by The Heritage Foundation's 2010 Index of Economic Freedom. Despite a series of mostly political setbacks, between 2006 and 2009 the Morales administration has spurred growth higher than at any point in the preceding 30 years. The growth was accompanied by a moderate decrease in inequality. A surplus budget of 1.7% (GDP) was obtained by 2012, the government runs surpluses since Morales administration reflecting a prudent economic management.\n\nA major blow to the Bolivian economy came with a drastic fall in the price of tin during the early 1980s, which impacted one of Bolivia's main sources of income and one of its major mining industries. Since 1985, the government of Bolivia has implemented a far-reaching program of macroeconomic stabilization and structural reform aimed at maintaining price stability, creating conditions for sustained growth, and alleviating scarcity. A major reform of the customs service has significantly improved transparency in this area. Parallel legislative reforms have locked into place market-liberal policies, especially in the hydrocarbon and telecommunication sectors, that have encouraged private investment. Foreign investors are accorded national treatment.\n\nIn April 2000, Hugo Banzer, the former President of Bolivia, signed a contract with Aguas del Tunari, a private consortium, to operate and improve the water supply in Bolivia's third-largest city, Cochabamba. Shortly thereafter, the company tripled the water rates in that city, an action which resulted in protests and rioting among those who could no longer afford clean water. Amidst Bolivia's nationwide economic collapse and growing national unrest over the state of the economy, the Bolivian government was forced to withdraw the water contract.\n\nBolivia has the second largest natural gas reserves in South America. The government has a long-term sales agreement to sell natural gas to Brazil through 2019. The government held a binding referendum in 2005 on the Hydrocarbon Law.\n\nThe US Geological Service estimates that Bolivia has 5.4 million cubic tonnes of lithium, which represent 50%–70% of world reserves. However, to mine for it would involve disturbing the country's salt flats (called Salar de Uyuni), an important natural feature which boosts tourism in the region. The government does not want to destroy this unique natural landscape to meet the rising world demand for lithium. On the other hand, sustainable extraction of lithium is attempted by the government. This project is carried out by the public company \"Recursos Evaporíticos\" subsidiary of COMIBOL.\n\nOnce Bolivia's government depended heavily on foreign assistance to finance development projects and to pay the public staff. At the end of 2002, the government owed $4.5 billion to its foreign creditors, with $1.6 billion of this amount owed to other governments and most of the balance owed to multilateral development banks. Most payments to other governments have been rescheduled on several occasions since 1987 through the Paris Club mechanism. External creditors have been willing to do this because the Bolivian government has generally achieved the monetary and fiscal targets set by IMF programs since 1987, though economic crises have undercut Bolivia's normally good record. However, by 2013 the foreign assistance is just a fraction of the government budget thanks to tax collection mainly from the profitable exports to Brazil and Argentina of natural gas.\n\nThe income from tourism has become increasingly important. Bolivia's tourist industry has grown gradually since about 1990.\n\nForeign-exchange reserves \n\nThe amount in reserve currencies and gold held by Bolivia's Central Bank advanced from 1.085 billion US dollars in 2000, under Hugo Banzer Suarez's government, to 15.282 billion US dollars in 2014 under Evo Morales' government.\n\nTransport \n\nAir traffic\n\nThe General Directorate of Civil Aeronautics (Dirección General de Aeronáutica Civil—DGAC) formerly part of the FAB, administers a civil aeronautics school called the National Institute of Civil Aeronautics (Instituto Nacional de Aeronáutica Civil—INAC), and two commercial air transport services TAM and TAB.\n\nTAM – Transporte Aéreo Militar (the Bolivian Military Airline) is an airline based in La Paz, Bolivia. It is the civilian wing of the 'Fuerza Aérea Boliviana' (the Bolivian Air Force), operating passenger services to remote towns and communities in the North and Northeast of Bolivia. TAM (a.k.a. TAM Group 71) has been a part of the FAB since 1945.\n\nA similar airline serving the Beni Department with small planes is Línea Aérea Amaszonas, using smaller planes than TAM.\n\nAlthough a civil transport airline, TAB – Transportes Aéreos Bolivianos, was created as a subsidiary company of the FAB in 1977. It is subordinate to the Air Transport Management (Gerencia de Transportes Aéreos) and is headed by an FAB general. TAB, a charter heavy cargo airline, links Bolivia with most countries of the Western Hemisphere; its inventory includes a fleet of Hercules C130 aircraft. TAB is headquartered adjacent to El Alto International Airport. TAB flies to Miami and Houston, with a stop in Panama.\n\nThe three largest, and main international airports in Bolivia are El Alto International Airport in La Paz, Viru Viru International Airport in Santa Cruz, and Jorge Wilstermann International Airport in Cochabamba.\n\nRailways\n\nBolivia possesses an extensive but aged rail system, all in 1000 mm gauge, consisting of two disconnected networks.\n\nTechnology \n\nBolivia owns a communications satellite which was offshored/outsourced and launched by China named Túpac Katari 1. In 2015, it was announced that electrical power advancements include a planned $300 million nuclear reactor developed by the Russian nuclear company Rosatom.\n\nWater supply and sanitation \n\nBolivias's drinking water and Sanitation coverage has greatly improved since 1990 due to a considerable increase\nin sectoral investment. However, the country has the continent's lowest coverage levels and services are of low \nquality. Political and institutional instability have \ncontributed to the weakening of the sector's institutions at the \nnational and local levels.\n\nTwo concessions to foreign private companies in two of the three largest cities – Cochabamba and La Paz/El Alto — were prematurely ended in 2000 and 2006 respectively. The country's second largest city, Santa Cruz de la Sierra, relatively successfully manages its own water and sanitation system by way of cooperatives. The government of Evo Morales intends to  strengthen citizen participation within the sector. Increasing coverage requires a substantial increase of investment financing.\n\nAccording to the government the main problems in the sector are low access to sanitation throughout the country; low access to  water in rural areas; insufficient and ineffective investments; a low visibility of community service providers; a lack of respect of indigenous customs; \"technical and institutional difficulties in the design and implementation of projects\"; a lack of capacity to operate and maintain infrastructure; an institutional framework that is \"not consistent with the political change in the country\"; \"ambiguities in the social participation schemes\"; a reduction in the quantity and \nquality of water due to climate change; pollution and a lack of integrated water resources management; and the lack of policies and programs for the reuse of wastewater.Estado Plurinacional de Bolivia:[http://www.mmaya.gob.bo/documentos/pnsb_final.pdf Plan Nacional de Saneamiento Basico 2008–2015] , retrieved on September 30, 2010\n\nOnly 27% of the population has access to improved sanitation, 80 to 88% has access to improved water sources. Coverage in urban areas is bigger than in rural ones.[http://www.wssinfo.org/about-the-jmp/introduction/ JMP 2010 Estimates for Bolivia] . The estimates are based on the Household Survey (2005), the Bolivia Democratic and Health Survey (2008) and other surveys.\n\nDemographics \n\nAccording to the last two censuses carried out by the Bolivian National Statistics Institute (Instituto Nacional de Estadística, INE), the population increased from 8,274,325 (from which 4,123,850 were men and 4,150,475 were women) in 2001 to 10,027,254 in 2012.\n\nIn the last fifty years the Bolivian population has tripled, reaching a population growth rate of 2.25%. The growth of the population in the inter-census periods (1950–1976 and 1976–1992) was approximately 2.05%, while between the last period, 1992–2001, it reached 2.74% annually.\n\nSome 62.43% of Bolivians live in urban areas, while the remaining 37.57% in rural areas. The most part of the population (70%) is concentrated in the departments of La Paz, Santa Cruz and Cochabamba. In the Andean Altiplano region the departments of La Paz and Oruro hold the largest percentage of population, in the valley region the largest percentage is held by the departments of Cochabamba and Chuquisaca, while in the Llanos region by Santa Cruz and Beni. At national level, the population density is 8.49, with variations marked between 0.8 (Pando Department) and 26.2 (Cochabamba Department).\n\nThe largest population center is located in the so-called \"central axis\" and in the Llanos region. Bolivia has a young population. According to the 2011 census, 59% of the population is between 15 and 59 years old, 39% is less than 15 years old. Almost 60% of the population is younger than 25 years of age.\n\nGenetics \n\nAccording to a genetic study done on Bolivians, average values of Native American, European and African ancestry are 86%, 12.5%, and 1.5%, in individuals from La Paz and 76.8%, 21.4%, and 1.8% in individuals from Chuquisaca; respectively.\n\nEthnic and Racial Classifications \n\nThe ethnic composition of Bolivia is diverse, and racial classifications, though outdated, are abundant. There are approximately three dozen native groups totaling approximately half of the Bolivian population – the largest proportion of indigenous people in Latin America. Exact numbers vary based on the wording of the ethnicity question and the available response choices. For example, the 2001 census did not provide the racial category \"mestizo\" as a response choice, resulting in a much higher proportion of respondents identifying themselves as belonging to one of the available indigenous ethnicity choices. Mestizos are distributed throughout the entire country and make up 26% of the Bolivian population. Most people assume their mestizo identity while at the same time identifying themselves with one or more indigenous cultures.  A 2009 estimate of racial classification put mestizo (mixed white and Amerindian) at 68%, indigenous at 20%, white at 5%, cholo at 2%, black at 1%, other at 1%, while 3% were unspecified; 44% attributed themselves to some indigenous group, predominantly the linguistic categories of Quechuas or Aymaras.  Whites comprised about 14% of the population in 2006, and are usually concentrated in the largest cities: La Paz, Santa Cruz de la Sierra and Cochabamba, but as well in some minor cities like Tarija. In the Santa Cruz Department, there are several dozen colonies of German-speaking Mennonites from Russia totaling around 40,000 inhabitants ().\n\nAfro-Bolivians, descendents of African slaves who arrived in the time of the Spanish Empire, inhabit the department of La Paz, and are located mainly in the provinces of Nor Yungas and Sud Yungas. Slavery was abolished in Bolivia in 1831.  There are also important communities of Japanese (14.000) and Lebanese (12.900).  \n\nIndigenous peoples, also called \"originarios\" (\"native\" or \"original\") and less frequently, Amerindians, could be categorized by geographic area, such as Andean, like the Aymaras and Quechuas (who formed the ancient Inca Empire), who are concentrated in the western departments of La Paz, Potosí, Oruro, Cochabamba and Chuquisaca. There also are ethnic populations in the east, composed of the Chiquitano, Chane, Guaraní and Moxos, among others, who inhabit the departments of Santa Cruz, Beni, Tarija and Pando.\n\nThere are small numbers of European citizens from Germany, France, Italy and Portugal, as well as from other American countries, as Argentina, Brazil, Chile, Colombia, Cuba, Ecuador, the United States, Paraguay, Peru, Mexico and Venezuela, among others. There are important Peruvian colonies in La Paz, El Alto and Santa Cruz de la Sierra.\n\nIndigenous peoples \n\nThe Indigenous peoples of Bolivia can be divided into two categories of ethnic groups: the Andeans, who are located in the Andean Altiplano and the valley region; and the lowland groups, who inhabit the warm regions of central and eastern Bolivia, including the valleys of Cochabamba Department, the Amazon Basin areas of northern La Paz Department, and the lowland departments of Beni, Pando, Santa Cruz, and Tarija (including the Gran Chaco region in the southeast of the country). Large numbers of Andean peoples have also migrated to form Quechua, Aymara, and intercultural communities in the lowlands.\n\n*Andean ethnicities\n** Aymara people. They live on the high plateau of the departments of La Paz, Oruro and Potosí, as well as some small regions near the tropical flatlands.\n** Quechua people. They mostly inhabit the valleys in Cochabamba and Chuquisaca. They also inhabit some mountain regions in Potosí and Oruro. They divide themselves into different Quechua nations, as the Tarabucos, Ucumaris, Chalchas, Chaquies, Yralipes, Tirinas, among others.\n** Uru people\n*Ethnicities of the Eastern Lowlands\n** Guaraníes. Made up of Guarayos, Pausernas, Sirionos, Chiriguanos, Wichí, Chulipis, Taipetes, Tobas and Yuquis.\n**Tacanas: Made up of Lecos, Chimanes, Araonas and Maropas.\n**Panos: Made up of Chacobos, Caripunas, Sinabos, Capuibos and Guacanaguas.\n**Aruacos: Made up of Apolistas, Baures, Moxos, Chané, Movimas, Cayabayas, Carabecas, Paiconecas or Paucanacas.\n**Chapacuras: Made up of Itenez or More, Chapacuras, Sansinonianos, Canichanas, Itonamas, Yuracares, Guatoses and Chiquitos.\n**Botocudos: Made up of Bororos y Otuquis.\n**Zamucos: Made up of Ayoreos.\n\nLanguage \n\nBolivia has great linguistic diversity as a result of its multiculturalism. The Constitution of Bolivia recognizes 36 official languages besides Spanish: Aymara, Araona, Baure, Bésiro, Canichana, Cavineño, Cayubaba, Chácobo, Chimán, Ese Ejja, Guaraní, Guarasu'we, Guarayu, Itonama, Leco, Machajuyai-Kallawaya, Machineri, Maropa, Mojeño-Ignaciano, Mojeño-Trinitario, Moré, Mosetén, Movima, Pacawara, Puquina, Quechua, Sirionó, Tacana, Tapieté, Toromona, Uru-Chipaya, Weenhayek, Yaminawa, Yuki, Yuracaré, and Zamuco.\n\nSpanish is the most spoken official language in the country, according to the 2001 census; as it is spoken bym two thirds of the population. All legal and official documents issued by the State, including the Constitution, the main private and public institutions, the media, and commercial activities, are in Spanish.\n\nThe main indigenous languages are: Quechua (21.2% of the population in the 2001 census), Aymara (14.6%), Guarani (0.6%) and others (0.4%) including the Moxos in the department of Beni.\n\nPlautdietsch, a German dialect, is spoken by about 70,000 Mennonites in Santa Cruz. Portuguese is spoken mainly in the areas close to Brazil.\n\nReligion \n\nBolivia is a constitutionally secular state that guarantees the freedom of religion and the independence of government from religion.\"\n\nAccording to the 2001 census conducted by the National Institute of Statistics of Bolivia, 78 percent of the population is Roman Catholic, followed by 19 percent Protestant and 3 percent non-religious.\n\nThe Association of Religion Data Archives (relying on the World Christian Database) records that in 2010, 92.5 percent of Bolivians identified as Christian (of any denomination), 3.1 percent identified with indigenous religion, 2.2 percent identified as Bahá'í, 1.9 percent identified as agnostic, and all other groups constituted 0.1 percent or less.\n\nMuch of the indigenous population adheres to different traditional beliefs marked by inculturation or syncretisim with Christianity. The cult of Pachamama, or \"Mother Earth\", is notable. The veneration of the Virgin of Copacabana, Virgin of Urkupiña and Virgin of Socavón, is also an important feature. There also are important Aymaran communities near Lake Titicaca that have a strong devotion to James the Apostle. Deities worshiped in Bolivia include Ekeko, the Aymaran god of abundance and prosperity, whose day is celebrated every 24 January, and Tupá, a god of the Guaraní people.\n\nLargest cities and towns \n\nApproximately 67 percent of Bolivians live in urban areas, among the lowest proportion in South America. Nevertheless, the rate of urbanization is growing steadily, at around 2.5 percent annually. According to the 2012 census, there are total of 3,158,691 households in Bolivia – an increase of 887,960 from 2001. In 2009, 75.4 percent of homes were classified as a house, hut, or Pahuichi; 3.3 percent were apartments; 21.1 percent were rental residences; and 0.1 percent were mobile homes. Most of the country's largest cities are located in the highlands of the west and central regions. Bolivia. http://en.wikipedia.org/?curid=3462."
  }
}
