{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14631",
  "eid" : "166982f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778546847,
  "textBody" : "Immanuel Kant (;[http://dictionary.reference.com/browse/kant \"Kant\"]. Random House Webster's Unabridged Dictionary.; 22 April 1724 – 12 February 1804) was a German philosopher who is a central figure in modern philosophy. Kant argues that the human mind creates the structure of human experience, that reason is the source of morality, that aesthetics arises from a faculty of disinterested judgment, that space and time are forms of human sensibility, and that the world as it is \"in-itself\" is independent of humanity's concepts of it. Kant took himself to have effected a \"Copernican revolution\" in philosophy, akin to Copernicus' reversal of the age-old belief that the sun revolves around the earth. Kant's beliefs continue to have a major influence on contemporary philosophy, especially the fields of metaphysics, epistemology, ethics, political theory, and aesthetics.\n\nPolitically, Kant is one of the earliest exponents of the idea that perpetual peace could be secured through universal democracy and international cooperation. He believed that this will be the eventual outcome of universal history, although it is not rationally planned.Idea for a Universal History with a Cosmopolitan Purpose. The exact nature of Kant's religious ideas continues to be the subject of especially heated philosophical dispute, as viewpoints are ranging from the idea that Kant was an early and radical exponent of atheism who finally exploded the ontological argument for God's existence, to more critical treatments epitomized by Nietzsche who claimed that Kant had \"theologian blood\"Friedrich Nietzsche, The Anti-Christ (1895), [https://books.google.com/books?idDcVl57jzP2gC&pg\nPA9&lpgPA9&dq\n%22theologian+blood%22+the+antichrist&sourcebl&ots\nCzqxPveANg&sigA-X36l8mmYUUI3wT56qpkBnVwpc&hl\nen&saX&ved\n0CCwQ6AEwA2oVChMIm-iS_d_UxwIVA3Y-Ch2mGgvo#vonepage&q\n%22theologian%20blood%22%20the%20antichrist&f=false para. 10]. and that Kant was merely a sophisticated apologist for traditional Christian religious belief, writing that \"Kant wanted to prove, in a way that would dumbfound the common man, that the common man was right: that was the secret joke of this soul.\"Friedrich Nietzsche (trans. Walter Arnold Kaufmann), The Portable Nietzsche, 1976, p. 96.\n\nIn one of Kant's major works, the Critique of Pure Reason (Kritik der reinen Vernunft, 1781), he attempted to explain the relationship between reason and human experience and to move beyond the failures of traditional philosophy and metaphysics. Kant wanted to put an end to an era of futile and speculative theories of human experience, while resisting the skepticism of thinkers such as David Hume. Kant regarded himself as ending and showing the way beyond the impasse which modern philosophy had led to between rationalists and empiricists, and is widely held to have synthesized these two early modern traditions in his thought.\n\nKant argued that our experiences are structured by necessary features of our minds. In his view, the mind shapes and structures experience so that, on an abstract level, all human experience shares certain essential structural features. Among other things, Kant believed that the concepts of space and time are integral to all human experience, as are our concepts of cause and effect.\n One important consequence of this view is that our experience of things is always of the phenomenal world as conveyed by our senses: we do not have direct access to things in themselves, the so-called noumenal world. Kant published other important works on ethics, religion, law, aesthetics, astronomy, and history. These included the Critique of Practical Reason (Kritik der praktischen Vernunft, 1788), the Metaphysics of Morals (Die Metaphysik der Sitten, 1797), which dealt with ethics, and the Critique of Judgment (Kritik der Urteilskraft, 1790), which looks at aesthetics and teleology.\n\nBiography\n\nImmanuel Kant was born on April 22, 1724 in Königsberg, Prussia (since 1946 the city of Kaliningrad, Kaliningrad Oblast, Russia). His mother, Anna Regina Reuter\n (1697–1737), was also born in Königsberg to a father from Nuremberg. (Her name is sometimes erroneously given as Anna Regina Porter.) His father, Johann Georg Kant (1682–1746), was a German harness maker from Memel, at the time Prussia's most northeastern city (now Klaipėda, Lithuania). Immanuel Kant believed that his paternal grandfather Hans Kant was of Scottish origin.Mortensen, Hans and Gertrud, Kants väterliche Ahnen und ihre Umwelt, Rede von 1952 in Jahrbuch der Albertus-Universität zu Königsberg, Pr., Holzner-Verlag, Kitzingen, Main 1953, Vol. 3, p. 26. While scholars of Kant's life long accepted the claim, there is no evidence that Kant's paternal line was Scottish; it is more likely that the Kants got their name from the village of Kantwaggen (today part of Priekulė) and were of Curonian origin.R. K. Murray, \"The Origin of Immanuel Kant's Family Name\", Kantian Review 13(1), March 2008, pp. 190-193.Rosa Kohlheim, Volker Kohlheim, Duden – Familiennamen: Herkunft und Bedeutung von 20.000 Nachnamen, Bibliographisches Institut & F. A. Brockhaus AG, Mannheim 2005, p. 365. Kant was the fourth of nine children (four of them reached adulthood).[http://www.freunde-kants.com/attachments/article/137/Bohnenrede%202015%20(de).pdf freunde-kants.com]   Baptized 'Emanuel', he changed his name to 'Immanuel'Kuehn 2001, p. 26. after learning Hebrew.\n\nYoung Kant was a solid, albeit unspectacular, student. Kant was born into a Prussian German family of Lutheran Protestant faith in East Prussia. He was brought up in a Pietist household that stressed religious devotion, humility, and a literal interpretation of the Bible. His education was strict, punitive and disciplinary, and focused on Latin and religious instruction over mathematics and science.Kuehn 2001, p. 47. Kant maintained a belief in Christianity, in his work Groundwork of the Metaphysic of Morals he reveals a belief in human immortality as the necessary condition of our continued approach to the highest good possible.Metaphysics, p. 131 However, as Kant was skeptical about some of the arguments used prior to him in defence of Theism and maintained that human understanding is limited and can never attain knowledge about God or the soul, various commentators have labelled him a philosophical agnostic.\"While this sounds skeptical, Kant is only agnostic about our knowledge of metaphysical objects such as God. And, as noted above, Kant's agnosticism leads to the conclusion that we can neither affirm nor deny claims made by traditional metaphysics.\" Andrew Fiala, J. M. D. Meiklejohn, Critique of Pure Reason – Introduction, page xi. \n\nCommon myths about Kant's personal mannerisms are listed, explained, and refuted in Goldthwait's introduction to his translation of Observations on the Feeling of the Beautiful and Sublime.\nKant, Immanuel. Observations on the Feeling of the Beautiful and Sublime. Trans. John T. Goldthwait. University of California Press, 1961, 2003. \n It is often held that Kant lived a very strict and disciplined life, leading to an oft-repeated story that neighbors would set their clocks by his daily walks. He never married, but seemed to have a rewarding social life — he was a popular teacher and a modestly successful author even before starting on his major philosophical works. He had a circle of friends whom he frequently met, among them Joseph Green, an English merchant in Königsberg.\n\nA common myth is that Kant never traveled more than 16 km from Königsberg his whole life.Lewis, Rick. 2005. [https://philosophynow.org/issues/49/Kant_200_Years_On 'Kant 200 Years On']. Philosophy Now. No. 49. In fact, between 1750 and 1754 he worked as a tutor (Hauslehrer) in Judtschen (now Veselovka, Russia, approximately 20 km) and in Groß-Arnsdorf (now Jarnołtowo near Morąg (German: Mohrungen), Poland, approximately 145 km).\n\nYoung scholar\n\nKant showed a great aptitude for study at an early age. He first attended the Collegium Fridericianum from which he graduated at the end of the summer of 1740. In 1740, aged 16, he enrolled at the University of Königsberg, where he spent his whole career.The American International Encyclopedia (New York: J.J. Little & Ives, 1954), Vol. IX. He studied the philosophy of Gottfried Leibniz and Christian Wolff under Martin Knutzen (Associate Professor of Logic and Metaphysics from 1734 until his death in 1756), a rationalist who was also familiar with developments in British philosophy and science and introduced Kant to the new mathematical physics of Isaac Newton. Knutzen dissuaded Kant from the theory of pre-established harmony, which he regarded as \"the pillow for the lazy mind\". He also dissuaded Kant from idealism, the idea that reality is purely mental, which most philosophers in the 18th century regarded in a negative light. (The theory of transcendental idealism that Kant developed in the Critique of Pure Reason is not traditional idealism and the Critiques second part even argues against traditional idealism.)\n\nHis father's stroke and subsequent death in 1746 interrupted his studies. Kant left Königsberg shortly after August 1748Kuehn 2001, p. 94.—he would return there in August 1754.Kuehn 2001, p. 98. He became a private tutor in the towns surrounding Königsberg, but continued his scholarly research. In 1749, he published his first philosophical work, Thoughts on the True Estimation of Living Forces (written in 1745–47).Eric Watkins (ed.), Immanuel Kant: Natural Science, Cambridge University Press, 2012: [http://assets.cambridge.org/97805213/63945/excerpt/9780521363945_excerpt.pdf \"Thoughts on the true estimation...\"].\n\nEarly work\n\nKant is best known for his work in the philosophy of ethics and metaphysics, but he made significant contributions to other disciplines. He made an important astronomical discovery about the nature of Earth's rotation, for which he won the Berlin Academy Prize in 1754. According to Lord Kelvin in 1897, Kant made contributions useful to mathematicians or physical astronomers. According to Thomas Huxley in 1867 Kant made contributions to geology as well when, in 1775 [1755], he wrote his General Natural History and Theory of the Celestial Bodies; or, an Attempt to Account for the Constitutional and Mechanical Origin of the Universe, upon Newtonian Principles.\"\n\nIn the General History of Nature and Theory of the Heavens (Allgemeine Naturgeschichte und Theorie des Himmels) (1755), Kant laid out the Nebular hypothesis, in which he deduced that the Solar System formed from a large cloud of gas, a nebula. Thus he tried to explain the order of the solar system, which Isaac Newton had explained as imposed from the beginning by God. Kant also correctly deduced that the Milky Way was a large disk of stars, which he theorized also formed from a (much larger) spinning cloud of gas. He further suggested that other nebulae might also be similarly large and distant disks of stars. These postulations opened new horizons for astronomy: for the first time extending astronomy beyond the solar system to galactic and extragalactic realms.George Gamow, One, Two, Three... Infinity, pp. 300ff. Viking Press, 1954\n\nFrom then on, Kant turned increasingly to philosophical issues, although he continued to write on the sciences throughout his life. In the early 1760s, Kant produced a series of important works in philosophy. The False Subtlety of the Four Syllogistic Figures, a work in logic, was published in 1762. Two more works appeared the following year: Attempt to Introduce the Concept of Negative Magnitudes into Philosophy and The Only Possible Argument in Support of a Demonstration of the Existence of God. In 1764, Kant wrote Observations on the Feeling of the Beautiful and Sublime and then was second to Moses Mendelssohn in a Berlin Academy prize competition with his Inquiry Concerning the Distinctness of the Principles of Natural Theology and Morality (often referred to as \"The Prize Essay\"). In 1766 Kant wrote Dreams of a Spirit-Seer which dealt with the writings of Emanuel Swedenborg. On 31 March 1770, aged 45, Kant was finally appointed Full Professor of Logic and Metaphysics (Professor Ordinarius der Logic und Metaphysic) at the University of Königsberg. In defense of this appointment, Kant wrote his inaugural dissertation (Inaugural-Dissertation) De Mundi Sensibilis atque Intelligibilis Forma et Principiis (On the Form and Principles of the Sensible and the Intelligible World).Since he had written his last habilitation thesis 14 years earlier, a new habilitation thesis was required (see S. J. McGrath, Joseph Carew (eds.), Rethinking German Idealism, Palgrave Macmillan, 2016, p. 24). This work saw the emergence of several central themes of his mature work, including the distinction between the faculties of intellectual thought and sensible receptivity. To miss this distinction would mean to commit the error of subreption, and, as he says in the last chapter of the dissertation, only in avoiding this error does metaphysics flourish.\n\nThe issue that vexed Kant was central to what 20th-century scholars called \"the philosophy of mind\". The flowering of the natural sciences had led to an understanding of how data reaches the brain. Sunlight falling on an object is reflected from its surface in a way that maps the surface features (color, texture, etc.). The reflected light reaches the human eye, passes through the cornea, is focused by the lens onto the retina where it forms an image similar to that formed by light passing through a pinhole into a camera obscura. The retinal cells send impulses through the optic nerve and then they form a mapping in the brain of the visual features of the object. The interior mapping is not the exterior object, and our belief that there is a meaningful relationship between the object and the mapping in the brain depends on a chain of reasoning that is not fully grounded. But the uncertainty aroused by these considerations, by optical illusions, misperceptions, delusions, etc., are not the end of the problems.\n\nKant saw that the mind could not function as an empty container that simply receives data from outside. Something must be giving order to the incoming data. Images of external objects must be kept in the same sequence in which they were received. This ordering occurs through the mind's intuition of time. The same considerations apply to the mind's function of constituting space for ordering mappings of visual and tactile signals arriving via the already described chains of physical causation.\n\nIt is often claimed that Kant was a late developer, that he only became an important philosopher in his mid-50s after rejecting his earlier views. While it is true that Kant wrote his greatest works relatively late in life, there is a tendency to underestimate the value of his earlier works. Recent Kant scholarship has devoted more attention to these \"pre-critical\" writings and has recognized a degree of continuity with his mature work.Cf., for example, Susan Shell, The Embodiment of Reason (Chicago, 1996)\n\nWork hiatus\n\nAt age 46, Kant was an established scholar and an increasingly influential philosopher, as much was expected of him.\n\nIn correspondence with his ex-student and friend Markus Herz, Kant admitted that, in the inaugural dissertation, he had failed to account for the relation between our sensible and intellectual faculties. He needed to explain how we combine what is known as sensory knowledge with the other type of knowledge – i.e. reasoned knowledge. These two being are related but have very different processes.\n\nKant also credited David Hume with awakening him from dogmatic slumber (circa 1771). Hume had stated that experience consists only of sequences of feelings, images or sounds. Ideas such as \"cause\", goodness, or objects were not evident in experience, so why do we believe in the reality of these? Kant felt that reason could remove this skepticism, and he set himself to solving these problems. He did not publish any work in philosophy for the next 11 years.\n\nAlthough fond of company and conversation with others, Kant isolated himself, and resisted friends' attempts to bring him out of his isolation. It's been noted that in 1778, in response to one of these offers by a former pupil, Kant wrote:\n\nWhen Kant emerged from his silence in 1781, the result was the Critique of Pure Reason. Although now uniformly recognized as one of the greatest works in the history of philosophy, this Critique was largely ignored upon its initial publication. The book was long, over 800 pages in the original German edition, and written in a convoluted style. It received few reviews, and these granted it no significance. Kant's former student, Johann Gottfried Herder criticized it for placing reason as an entity worthy of criticism instead of considering the process of reasoning within the context of language and one's entire personality.Copleston, Frederick Charles. The Enlightenment: Voltaire to Kant. 2003. p. 146. Similar to Christian Garve and Johann Georg Heinrich Feder, he rejected Kant's position that space and time possessed a form that could be analyzed. Additionally, Garve and Feder also faulted Kant's Critique for not explaining differences in perception of sensations.Sassen, Brigitte. Kant's Early Critics: The Empiricist Critique of the Theoretical Philosophy. 2000. Its density made it, as Herder said in a letter to Johann Georg Hamann, a \"tough nut to crack\", obscured by \"all this heavy gossamer\".Ein Jahrhundert deutscher Literaturkritik, vol. III, Der Aufstieg zur Klassik in der Kritik der Zeit (Berlin, 1959), p. 315; as quoted in Gulyga, Arsenij. Immanuel Kant: His Life and Thought. Trans., Marijan Despaltović. Boston: Birkhäuser, 1987. Its reception stood in stark contrast to the praise Kant had received for earlier works, such as his Prize Essay and shorter works that preceded the first Critique. These well-received and readable tracts include one on the earthquake in Lisbon that was so popular that it was sold by the page.Gulyga, Arsenij. Immanuel Kant: His Life and Thought. Trans., Marijan Despaltović. Boston: Birkhäuser, 1987 pp. 28–9. Prior to the change in course documented in the first Critique, his books sold well, and by the time he published Observations on the Feeling of the Beautiful and Sublime in 1764 he had become a notable popular author.Gulyga, Arsenij. Immanuel Kant: His Life and Thought. Trans., Marijan Despaltović. Boston: Birkhäuser, 1987, p. 62. Kant was disappointed with the first Critique's reception. Recognizing the need to clarify the original treatise, Kant wrote the Prolegomena to any Future Metaphysics in 1783 as a summary of its main views. Shortly thereafter, Kant's friend Johann Friedrich Schultz (1739–1805) (professor of mathematics) published Erläuterungen über des Herrn Professor Kant Critik der reinen Vernunft (Königsberg, 1784), which was a brief but very accurate commentary on Kant's Critique of Pure Reason.\n\nKant's reputation gradually rose through the latter portion of the 1780s, sparked by a series of important works: the 1784 essay, \"Answer to the Question: What is Enlightenment?\"; 1785's Groundwork of the Metaphysics of Morals (his first work on moral philosophy); and, from 1786, Metaphysical Foundations of Natural Science. But Kant's fame ultimately arrived from an unexpected source. In 1786, Karl Leonhard Reinhold published a series of public letters on Kantian philosophy. In these letters, Reinhold framed Kant's philosophy as a response to the central intellectual controversy of the era: the Pantheism Dispute. Friedrich Jacobi had accused the recently deceased Gotthold Ephraim Lessing (a distinguished dramatist and philosophical essayist) of Spinozism. Such a charge, tantamount to atheism, was vigorously denied by Lessing's friend Moses Mendelssohn, leading to a bitter public dispute among partisans. The controversy gradually escalated into a debate about the values of the Enlightenment and the value of reason.\n\nReinhold maintained in his letters that Kant's Critique of Pure Reason could settle this dispute by defending the authority and bounds of reason. Reinhold's letters were widely read and made Kant the most famous philosopher of his era.\n\nLater work and death\n\nKant published a second edition of the Critique of Pure Reason (Kritik der reinen Vernunft) in 1787, heavily revising the first parts of the book. Most of his subsequent work focused on other areas of philosophy. He continued to develop his moral philosophy, notably in 1788's Critique of Practical Reason (known as the second Critique) and 1797's Metaphysics of Morals. The 1790 Critique of Judgment (the third Critique) applied the Kantian system to aesthetics and teleology.\n\nIn 1792, Kant's attempt to publish the Second of the four Pieces of Religion within the Bounds of Bare Reason, in the journal Berlinische Monatsschrift, met with opposition from the King's censorship commission, which had been established that same year in the context of the French Revolution. Kant then arranged to have all four pieces published as a book, routing it through the philosophy department at the University of Jena to avoid the need for theological censorship.Derrida Vacant Chair p. 44. This insubordination earned him a now famous reprimand from the King. When he nevertheless published a second edition in 1794, the censor was so irate that he arranged for a royal order that required Kant never to publish or even speak publicly about religion. Kant then published his response to the King's reprimand and explained himself, in the preface of The Conflict of the Faculties.\n\nHe also wrote a number of semi-popular essays on history, religion, politics and other topics. These works were well received by Kant's contemporaries and confirmed his preeminent status in 18th-century philosophy. There were several journals devoted solely to defending and criticizing Kantian philosophy. Despite his success, philosophical trends were moving in another direction. Many of Kant's most important disciples and followers (including Reinhold, Beck and Fichte) transformed the Kantian position into increasingly radical forms of idealism. The progressive stages of revision of Kant's teachings marked the emergence of German Idealism. Kant opposed these developments and publicly denounced Fichte in an open letter in 1799. It was one of his final acts expounding a stance on philosophical questions. In 1800, a student of Kant named Gottlob Benjamin Jäsche (1762–1842) published a manual of logic for teachers called Logik, which he had prepared at Kant's request. Jäsche prepared the Logik using a copy of a textbook in logic by Georg Friedrich Meier entitled Auszug aus der Vernunftlehre, in which Kant had written copious notes and annotations. The Logik has been considered of fundamental importance to Kant's philosophy, and the understanding of it. The great 19th-century logician Charles Sanders Peirce remarked, in an incomplete review of Thomas Kingsmill Abbott's English translation of the introduction to Logik, that \"Kant's whole philosophy turns upon his logic.\"Peirce, C.S., Collected Papers of Charles Sanders Peirce, v.1, (HUP, 1960), 'Kant and his Refutation of Idealism' p. 15\n Also, Robert Schirokauer Hartman and Wolfgang Schwarz, wrote in the translators' introduction to their English translation of the Logik, \"Its importance lies not only in its significance for the Critique of Pure Reason, the second part of which is a restatement of fundamental tenets of the Logic, but in its position within the whole of Kant's work.\"Kant, Immanuel, Logic, G.B. Jäsche (ed), R.S. Hartman, W. Schwarz (translators), Indianapolis, 1984, p. xv.\n\nKant's health, long poor, worsened and he died at Königsberg on 12 February 1804, uttering \"Es ist gut\" (\"It is good\") before expiring.Karl Vorländer, Immanuel Kant: Der Mann und das Werk, Hamburg: Meiner, 1992, p. II 332. His unfinished final work was published as Opus Postumum.\n\nKant wrote a book discussing his theory of virtue in terms of independence which he believed was \"a viable modern alternative to more familiar Greek views about virtue\". This book is often criticized for its hostile tone and for not articulating his thoughts about autocracy comprehensibly. In the self-governance model of Aristotelian virtue, the non-rational part of the soul can be made to listen to reason through training. Although Kantian self-governance appears to involve \"a rational crackdown on appetites and emotions\" with lack of harmony between reason and emotion, Kantian virtue denies requiring \"self-conquest, self-suppression, or self-silencing\". They dispute that \"the self-mastery constitutive of virtue is ultimately mastery over our tendency of will to give priority to appetite or emotion unregulated by duty, it does not require extirpating, suppressing, or silencing sensibility in general\".\n\nPhilosophy\n\nIn Kant's essay \"Answering the Question: What is Enlightenment?\",\nKant defined the Enlightenment as an age shaped by the Latin motto Sapere aude (\"Dare to be wise\"). Kant maintained that one ought to think autonomously, free of the dictates of external authority. His work reconciled many of the differences between the rationalist and empiricist traditions of the 18th century. He had a decisive impact on the Romantic and German Idealist philosophies of the 19th century. His work has also been a starting point for many 20th century philosophers.\n\nKant asserted that, because of the limitations of argumentation in the absence of irrefutable evidence, no one could really know whether there is a God and an afterlife or not. For the sake of morality and as a ground for reason, Kant asserted, people are justified in believing in God, even though they could never know God's presence empirically. He explained:\n\nThe sense of an enlightened approach and the critical method required that \"If one cannot prove that a thing is, he may try to prove that it is not. If he fails to do either (as often occurs), he may still ask whether it is in his interest to accept one or the other of the alternatives hypothetically, from the theoretical or the practical point of view. Hence the question no longer is as to whether perpetual peace is a real thing or not a real thing, or as to whether we may not be deceiving ourselves when we adopt the former alternative, but we must act on the supposition of its being real.\"The Science of Right, Conclusion. The presupposition of God, soul, and freedom was then a practical concern, for \"Morality, by itself, constitutes a system, but happiness does not, unless it is distributed in exact proportion to morality. This, however, is possible in an intelligible world only under a wise author and ruler. Reason compels us to admit such a ruler, together with life in such a world, which we must consider as future life, or else all moral laws are to be considered as idle dreams... .\"Critique of Pure Reason, A811.\n\nKant drew a parallel between the \"Copernican revolution\" and the epistemology of his new transcendental philosophy, although, according to Tom Rockmore,Tom Rockmore, Marx After Marxism: The Philosophy of Karl Marx (2002), p. 184. Kant himself never used the \"Copernican revolution\" phrase about himself, though it was \"routinely\" applied to his work by others.\n\nKant's Copernican revolution involved two interconnected foundations of his \"critical philosophy\":\n* the epistemology of transcendental idealism and\n* the moral philosophy of the autonomy of practical reason.\n\nThese teachings placed the active, rational human subject at the center of the cognitive and moral worlds. Kant argued that the rational order of the world as known by science was not just the accidental accumulation of sense perceptions.\n\nConceptual unification and integration is carried out by the mind through concepts or the \"categories of the understanding\" operating on the perceptual manifold within space and time. The latter are not concepts,In the first edition of the Critique of Pure Reason Kant refers to space as \"no discursive or...general conception of the relation of things, but a pure intuition\" and maintained that \"We can only represent to ourselves one space\". The \"general notion of spaces...depends solely upon limitations\" (Meikeljohn trans., A25). In the second edition of the CPR, Kant adds, \"The original representation of space is an a priori intuition, not a concept\" (Kemp Smith trans., B40). In regard to time, Kant states that \"Time is not a discursive, or what is called a general concept, but a pure form of sensible intuition. Different times are but parts of one and the same time; and the representation which can be given only through a single object is intuition\" (A31/B47). For the differences in the discursive use of reason according to concepts and its intuitive use through the construction of concepts, see Critique of Pure Reason (A719/B747 ff. and A837/B865). On \"One and the same thing in space and time\" and the mathematical construction of concepts, see A724/B752. but are forms of sensibility that are a priori necessary conditions for any possible experience. Thus the objective order of nature and the causal necessity that operates within it depend on the mind's processes, the product of the rule-based activity that Kant called, \"synthesis.\" There is much discussion among Kant scholars about the correct interpretation of this train of thought.\n\nThe 'two-world' interpretation regards Kant's position as a statement of epistemological limitation, that we are not able to transcend the bounds of our own mind, meaning that we cannot access the \"thing-in-itself\". However, Kant also speaks of the thing in itself or transcendental object as a product of the (human) understanding as it attempts to conceive of objects in abstraction from the conditions of sensibility. Following this line of thought, some interpreters have argued that the thing in itself does not represent a separate ontological domain but simply a way of considering objects by means of the understanding alonethis is known as the two-aspect view.\n\nThe notion of the \"thing in itself\" was much discussed by philosophers after Kant. It was argued that because the \"thing in itself\" was unknowable, its existence must not be assumed. Rather than arbitrarily switching to an account that was ungrounded in anything supposed to be the \"real,\" as did the German Idealists, another group arose to ask how our (presumably reliable) accounts of a coherent and rule-abiding universe were actually grounded. This new kind of philosophy became known as Phenomenology, and its founder was Edmund Husserl.\n\nWith regard to morality, Kant argued that the source of the good lies not in anything outside the human subject, either in nature or given by God, but rather is only the good will itself. A good will is one that acts from duty in accordance with the universal moral law that the autonomous human being freely gives itself. This law obliges one to treat humanityunderstood as rational agency, and represented through oneself as well as othersas an end in itself rather than (merely) as means to other ends the individual might hold. This necessitates practical self-reflection in which we universalize our reasons.\n\nThese ideas have largely framed or influenced all subsequent philosophical discussion and analysis. The specifics of Kant's account generated immediate and lasting controversy. Nevertheless, his thesesthat the mind itself necessarily makes a constitutive contribution to its knowledge, that this contribution is transcendental rather than psychological, that philosophy involves self-critical activity, that morality is rooted in human freedom, and that to act autonomously is to act according to rational moral principleshave all had a lasting effect on subsequent philosophy.\n\nTheory of perception\n\nKant defines his theory of perception in his influential 1781 work the Critique of Pure Reason, which has often been cited as the most significant volume of metaphysics and epistemology in modern philosophy. Kant maintains that our understanding of the external world had its foundations not merely in experience, but in both experience and a priori concepts, thus offering a non-empiricist critique of rationalist philosophy, which is what he and others referred to as his \"Copernican revolution\".\n\nFirstly, Kant distinguishes between analytic and synthetic propositions:\n\n# Analytic proposition: a proposition whose predicate concept is contained in its subject concept; e.g., \"All bachelors are unmarried,\" or, \"All bodies take up space.\"\n# Synthetic proposition: a proposition whose predicate concept is not contained in its subject concept; e.g., \"All bachelors are alone,\" or, \"All bodies have weight.\"\n\nAn analytic proposition is true by nature of the meaning of the words in the sentence — we require no further knowledge than a grasp of the language to understand this proposition. On the other hand, a synthetic statement is one that tells us something about the world. The truth or falsehood of synthetic statements derives from something outside their linguistic content. In this instance, weight is not a necessary predicate of the body; until we are told the heaviness of the body we do not know that it has weight. In this case, experience of the body is required before its heaviness becomes clear. Before Kant's first Critique, empiricists (cf. Hume) and rationalists (cf. Leibniz) assumed that all synthetic statements required experience to be known.\n\nKant, however, contests this: he claims that elementary mathematics, like arithmetic, is synthetic a priori, in that its statements provide new knowledge, but knowledge that is not derived from experience. This becomes part of his over-all argument for transcendental idealism. That is, he argues that the possibility of experience depends on certain necessary conditions — which he calls a priori forms — and that these conditions structure and hold true of the world of experience. In so doing, his main claims in the \"Transcendental Aesthetic\" are that mathematic judgments are synthetic a priori and in addition, that Space and Time are not derived from experience but rather are its preconditions.\n\nOnce we have grasped the functions of basic arithmetic, we do not need any empirical experience to know that 100 + 100 200, and so it appears that arithmetic is analytic. However, that it is analytic can be disproved by considering the calculation 5 + 7 \n 12: there is nothing in the numbers 5 and 7 by which the number 12 can be inferred. Thus \"5 + 7\" and \"the cube root of 1,728\" or \"12\" are not analytic because their reference is the same but their sense is not — the mathematical judgment \"5 + 7 = 12\" tells us something new about the world. It is self-evident, and undeniably a priori, but at the same time it is synthetic. Thus Kant proved that a proposition can be synthetic and known a priori.\n\nKant asserts that experience is based both on the perception of external objects and a priori knowledge.The German word Anschauung, which Kant used, literally means 'looking at' and generally means what in philosophy in English is called \"perception\". However it sometimes is rendered as \"intuition\": not, however, with the vernacular meaning of an indescribable or mystical experience or sixth sense, but rather with the meaning of the direct perception or grasping of sensory phenomena. In this article, both terms, \"perception\" and \"intuition\" are used to stand for Kant's Anschauung. The external world, he writes, provides those things that we sense. But it is our mind that processes this information and gives it order, allowing us to comprehend it. Our mind supplies the conditions of space and time to experience objects. According to the \"transcendental unity of apperception\", the concepts of the mind (Understanding) and the perceptions or intuitions that garner information from phenomena (Sensibility) are synthesized by comprehension. Without the concepts, perceptions are nondescript; without the perceptions, concepts are meaningless — thus the famous statement, \"Thoughts without content are empty, intuitions (perceptions) without concepts are blind.\"Immanuel Kant, Critique of Pure Reason [1781], trans. Norman Kemp Smith (N.Y.: St. Martins, 1965), A 51/B 75.\n\nKant also claims that an external environment is necessary for the establishment of the self. Although Kant would want to argue that there is no empirical way of observing the self, we can see the logical necessity of the self when we observe that we can have different perceptions of the external environment over time. By uniting all of these general representations into one global representation, we can see how a transcendental self emerges. \"I am therefore conscious of the identical self in regard to the manifold of the representations that are given to me in an intuition because I call them all together my representations.\"Kant, Immanuel. Critique of Pure Reason. Ed. Paul Guyer and Allen W. Wood. Cambridge: Cambridge UP, 1998. p. 248.\n\nCategories of the Faculty of Understanding\n\nKant deemed it obvious that we have some objective knowledge of the world, such as, say, Newtonian physics. But this knowledge relies on synthetic, a priori laws of nature, like causality and substance. The problem, then, is how this is possible. Kant's solution was to reason that the subject must supply laws that make experience of objects possible, and that these laws are the synthetic, a priori laws of nature that we know apply to all objects before we experience them. So, to deduce all these laws, Kant examined experience in general, dissecting in it what is supplied by the mind from what is supplied by the given intuitions. What has just been explicated is commonly called a transcendental deduction.Immanuel Kant, Prolegomena to perhaps Any Future Metaphysics, pages 35 to 43.\n\nTo begin with, Kant's distinction between the a posteriori being contingent and particular knowledge, and the a priori being universal and necessary knowledge, must be kept in mind. For if we merely connect two intuitions together in a perceiving subject, the knowledge is always subjective because it is derived a posteriori, when what is desired is for the knowledge to be objective, that is, for the two intuitions to refer to the object and hold good of it necessarily universally for anyone at any time, not just the perceiving subject in its current condition. What else is equivalent to objective knowledge besides the a priori, that is to say, universal and necessary knowledge? Nothing else, and hence before knowledge can be objective, it must be incorporated under an a priori category of the understanding.[http://www.webdeleuze.com/php/texte.php?cle\n66&groupeKant&langue\n2 Deleuze on Kant] , from where the definitions of a priori and a posteriori were obtained.\n\nFor example, say a subject says, \"The sun shines on the stone; the stone grows warm,\" which is all he perceives in perception. His judgment is contingent and holds no necessity. But if he says, \"The sunshine causes the stone to warm,\" he subsumes the perception under the category of causality, which is not found in the perception, and necessarily synthesizes the concept sunshine with the concept heat, producing a necessarily universally true judgment.\n\nTo explain the categories in more detail, they are the preconditions of the construction of objects in the mind. Indeed, to even think of the sun and stone presupposes the category of subsistence, that is, substance. For the categories synthesize the random data of the sensory manifold into intelligible objects. This means that the categories are also the most abstract things one can say of any object whatsoever, and hence one can have an a priori cognition of the totality of all objects of experience if one can list all of them. To do so, Kant formulates another transcendental deduction.\n\nJudgments are, for Kant, the preconditions of any thought. Man thinks via judgments, so all possible judgments must be listed and the perceptions connected within them put aside, so as to make it possible to examine the moments when the understanding is engaged in constructing judgments. For the categories are equivalent to these moments, in that they are concepts of intuitions in general, so far as they are determined by these moments universally and necessarily. Thus by listing all the moments, one can deduce from them all of the categories.\n\nOne may now ask: How many possible judgments are there? Kant believed that all the possible propositions within Aristotle's syllogistic logic are equivalent to all possible judgments, and that all the logical operators within the propositions are equivalent to the moments of the understanding within judgments. Thus he listed Aristotle's system in four groups of three: quantity (universal, particular, singular), quality (affirmative, negative, infinite), relation (categorical, hypothetical, disjunctive) and modality (problematic, assertoric, apodeictic). The parallelism with Kant's categories is obvious: quantity (unity, plurality, totality), quality (reality, negation, limitation), relation (substance, cause, community) and modality (possibility, existence, necessity).\n\nThe fundamental building blocks of experience, i.e. objective knowledge, are now in place. First there is the sensibility, which supplies the mind with intuitions, and then there is the understanding, which produces judgments of these intuitions and can subsume them under categories. These categories lift the intuitions up out of the subject's current state of consciousness and place them within consciousness in general, producing universally necessary knowledge. For the categories are innate in any rational being, so any intuition thought within a category in one mind is necessarily subsumed and understood identically in any mind. In other words, we filter what we see and hear.\n\nTranscendental schema doctrine\n\nKant ran into a problem with his theory that the mind plays a part in producing objective knowledge. Intuitions and categories are entirely disparate, so how can they interact? Kant's solution is the (transcendental) schema: a priori principles by which the transcendental imagination connects concepts with intuitions through time. All the principles are temporally bound, for if a concept is purely a priori, as the categories are, then they must apply for all times. Hence there are principles such as substance is that which endures through time, and the cause must always be prior to the effect.Immanuel Kant, Prolegomena to Any Future Metaphysics, pages 35 to 43.Immanuel Kant, Critique of Judgment, the Introduction to the Hackett edition.\n\nMoral philosophy\n\nKant developed his moral philosophy in three works: Groundwork of the Metaphysic of Morals (1785), Critique of Practical Reason (1788), and Metaphysics of Morals (1797).\n\nIn the Groundwork, Kant's method involves trying to convert our everyday, obvious, rationalThe distinction between rational and philosophical knowledge is given in the Preface to the Groundwork, 1785. knowledge of morality into philosophical knowledge. The latter two works followed a method of using \"practical reason\", which is based only on things about which reason can tell us, and not deriving any principles from experience, to reach conclusions which can be applied to the world of experience (in the second part of The Metaphysic of Morals).\n\nKant is known for his theory that there is a single moral obligation, which he called the \"Categorical Imperative\", and is derived from the concept of duty. Kant defines the demands of the moral law as \"categorical imperatives\". Categorical imperatives are principles that are intrinsically valid; they are good in and of themselves; they must be obeyed by everyone in all situations and circumstances, if our behavior is to observe the moral law. The Categorical Imperative provides a test against which moral statements can be assessed. Kant also stated that the moral means and ends can be applied to the categorical imperative, that rational beings can pursue certain \"ends\" using the appropriate \"means\". Ends based on physical needs or wants can create merely hypothetical imperatives. The categorical imperative can only be based on something that is an \"end in itself\", that is, an end that is not a means to some other need, desire, or purpose.Kant, Foundations, p. 421. Kant believed that the moral law is a principle of reason itself, and is not based on contingent facts about the world, such as what would make us happy, but to act on the moral law which has no other motive than \"worthiness of being happy\".Critique of Pure Reason, A806/B834. Accordingly, he believed that moral obligation applies only to rational agents.Kant, Foundations, p. 408.\n\nUnlike a hypothetical imperative, a categorical imperative is an unconditional obligation; that is, it has the force of an obligation regardless of our will or desiresKant, Foundations, pp. 420–1. In Groundwork of the Metaphysic of Morals (1785) Kant enumerated three formulations of the categorical imperative that he believed to be roughly equivalent.Kant, Foundations, p. 436. In the same book, Kant stated:\n\nAct only according to that maxim whereby you can, at the same time, will that it should become a universal law.. It is standard to also reference the Akademie Ausgabe of Kant's works. The Groundwork occurs in the fourth volume.The above citation is taken from 4:421.\n\nIn other words, according to Kant, one cannot make exceptions for oneself. The philosophical maxim on which one acts should always be considered to be a universal law without exception.  One cannot allow oneself to do a particular action unless one thinks it appropriate that the reason for the action should become a universal law. For example, one should not steal, however dire the circumstancesbecause, by permitting oneself to steal, one makes stealing a universally  acceptable act, without contradiction. This is the first formulation of the categorical imperative, often known as the universalizability principle.\n\nKant believed that, if an action is not done with the motive of duty, then it is without moral value. He thought that every action should have pure intention behind it; otherwise, it is meaningless. The final result is not the most important aspect of an action;  rather, how the person feels while carrying out the action is the time at which value is attached to the result.\n\nIn Groundwork of the Metaphysic of Morals, Kant also posited the \"counter-utilitarian idea that there is a difference between preferences and values, and that considerations of individual rights temper calculations of aggregate utility\", a concept that is an axiom in economics:Millennium Ecosystem Assessment (2003) Ecosystems and Well-being: A Framework for Assessment. Washington DC: Island Press, p. 142.\n\nEverything has either a price or a dignity. Whatever has a price can be replaced by something else as its equivalent; on the other hand, whatever is above all price, and therefore admits of no equivalent, has a dignity. But that which constitutes the condition under which alone something can be an end in itself does not have mere relative worth, i.e., price, but an intrinsic worth, i.e., a dignity. (p. 53, italics in original).\n\nA phrase quoted by Kant, which is used to summarize the counter-utilitarian nature of his moral philosophy, is Fiat justitia, pereat mundus, (\"Let justice be done, though the world perish\"), which he translates loosely as \"Let justice reign even if all the rascals in the world should perish from it\". This appears in his 1795 \"Perpetual Peace\" (\"Zum ewigen Frieden. Ein philosophischer Entwurf\"), Appendix 1.\n\nFirst formulation\n\nThe first formulation (Formula of Universal Law) of the moral imperative \"requires that the maxims be chosen as though they should hold as universal laws of nature\" . This formulation in principle has as its supreme law the creed \"Always act according to that maxim whose universality as a law you can at the same time will\" and is the \"only condition under which a will can never come into conflict with itself [....]\"Kant, Foundations, p. 437.\n\nOne interpretation of the first formulation is called the \"universalizability test\".\"Kant and the German Enlightenment\" in \"History of Ethics\". Encyclopedia of Philosophy, Vol. 3, pp. 95–96. MacMillan, 1973. An agent's maxim, according to Kant, is his \"subjective principle of human actions\": that is, what the agent believes is his reason to act.Kant, Foundations, pp. 400, 429. The universalisability test has five steps:\n\n# Find the agent's maxim (i.e., an action paired with its motivation). Take for example the declaration \"I will lie for personal benefit\". Lying is the action; the motivation is to fulfill some sort of desire. Paired together, they form the maxim.\n# Imagine a possible world in which everyone in a similar position to the real-world agent followed that maxim. With no exception of one's self. This is in order for you to hold people to the same principle required of yourself.\n# Decide whether any contradictions or irrationalities arise in the possible world as a result of following the maxim.\n# If a contradiction or irrationality arises, acting on that maxim is not allowed in the real world.\n# If there is no contradiction, then acting on that maxim is permissible, and is sometimes required.\n\n(For a modern parallel, see John Rawls' hypothetical situation, the original position.)\n\nSecond formulation\n\nThe second formulation (or Formula of the End in Itself) holds that \"the rational being, as by its nature an end and thus as an end in itself, must serve in every maxim as the condition restricting all merely relative and arbitrary ends\". The principle dictates that you \"[a]ct with reference to every rational being (whether yourself or another) so that it is an end in itself in your maxim\", meaning that the rational being is \"the basis of all maxims of action\" and \"must be treated never as a mere means but as the supreme limiting condition in the use of all means, i.e., as an end at the same time\".Kant, Foundations, pp. 437–8.\n\nThird formulation \n\nThe third formulation (i.e. Formula of Autonomy) is a synthesis of the first two and is the basis for the \"complete determination of all maxims\". It states \"that all maxims which stem from autonomous legislation ought to harmonize with a possible realm of ends as with a realm of nature\".\n\nIn principle, \"So act as if your maxims should serve at the same time as the universal law (of all rational beings)\", meaning that we should so act that we may think of ourselves as \"a member in the universal realm of ends\", legislating universal laws through our maxims (that is, a universal code of conduct), in a \"possible realm of ends\".Kant, Foundations, pp. 438–9. See also Kingdom of Ends None may elevate themselves above the universal law, therefore it is one's duty to follow the maxim(s).\n\nReligion Within the Limits of Reason\n\nKant articulates his strongest criticisms of the organization and practices of religious organizations to those that encourage what he sees as a religion of counterfeit service to God.Immanuel Kant. Religion within the Limits of Reason Alone (1793), Book IV, Part 1, Section 1, \"The Christian religion as a natural religion.\" Among the major targets of his criticism are external ritual, superstition and a hierarchical church order. He sees all of these as efforts to make oneself pleasing to God in ways other than conscientious adherence to the principle of moral rightness in choosing one's actions. The severity of Kant's criticisms on these matters, along with his rejection of the possibility of theoretical proofs for the existence of God and his philosophical re-interpretation of some basic Christian doctrines, allow interpretations that see Kant as thoroughly hostile to religion in general and Christianity in particular (e.g., Walsh 1967). Nevertheless, other interpreters consider that Kant was trying to mark off a defensible rational core of Christian belief. Kant sees in Jesus Christ the affirmation of a \"pure moral disposition of the heart\" that \"can make man well-pleasing to God\".\n\nRegarding Kant’s conception of religion, some critics have highlighted his deism, for example Peter Byrne, who wrote about Kant’s precise relationship with deism.Byrne, Peter (2007), Kant on God, London: Ashgate, page 159. Other critics have argued that Kant’s moral conception moves from deism to theism (as moral theism), for example Allen W. WoodWood, Allen W. (1970), Kant's moral religion, London and Ithaca: Cornell University Press, page 16. and Merold Westphal.Westphal, Merold (2010),The Emerge of Modern Philosophy of Religion, in Taliaferro, Charles, Draper, Paul and Quinn, Philip (editors), A Companion to Philosophy of Religion, Oxford: Blackwell, page 135. As for Kant’s book entitled Religion within the Boundaries of bare Reason, it was emphasized that Kant reduced religiosity to rationality, religion to morality and Christianity to ethics.Iţu, Mircia (2004), Dumnezeu şi religia în concepţia lui Immanuel Kant din Religia în limitele raţiunii, in Boboc, Alexandru and Mariş, N. I. (editors), Studii de istoria filosofiei universale, volume 12, Bucharest: Romanian Academy.\n\nIdea of freedom\n\nIn the Critique of Pure Reason,The Norman Kemp Smith translation has been used for this section, with citation noting the pagination of the first and second editions. Kant distinguishes between the transcendental idea of freedom, which as a psychological concept is \"mainly empirical\" and refers to \"the question whether we must admit a power of spontaneously beginning a series of successive things or states\" as a real ground of necessity in regard to causality,Kant, Critique of Pure Reason, A448/B476. and the practical concept of freedom as the independence of our will from the \"coercion\" or \"necessitation through sensuous impulses\". Kant finds it a source of difficulty that the practical idea of freedom is founded on the transcendental idea of freedom,Kant, Critique of Pure Reason, A534/B562. but for the sake of practical interests uses the practical meaning, taking \"no account of... its transcendental meaning,\" which he feels was properly \"disposed of\" in the Third Antinomy, and as an element in the question of the freedom of the will is for philosophy \"a real stumbling-block\" that has \"embarrassed speculative reason\".\n\nKant calls practical \"everything that is possible through freedom\", and the pure practical laws that are never given through sensuous conditions but are held analogously with the universal law of causality are moral laws. Reason can give us only the \"pragmatic laws of free action through the senses\", but pure practical laws given by reason a priorithe same distinction of transcendental and practical meaning can be applied to the idea of God, with the proviso that the practical concept of freedom can be experienced (Critique of Pure Reason, A801-804/B829-832). dictate \"what ought to be done\".Kant, Critique of Pure Reason, A800–2/B828–30.The concept of freedom is also handled in the third section of the Foundations of the Metaphysics of Morals. In the Critique of Practical Reason see § VII and § VIII.\n\nCategories of freedom\n\nIn the Critique of Practical Reason, at the end of the second Main Part of the Analytics,5:65–67 Kant introduces the categories of freedom, in analogy with the categories of understanding their practical counterparts. Kant's categories of freedom apparently function primarily as conditions for the possibility for actions (i) to be free, (ii) to be understood as free and (iii) to be morally evaluated. For Kant, although actions as theoretical objects are constituted by means of the theoretical categories, actions as practical objects (objects of practical use of reason, and which can be good or bad) are constituted by means of the categories of freedom. Only in this way can actions, as phenomena, be a consequence of freedom, and be understood and evaluated as such.Susanne Bobzien, 'Die Kategorien der Freiheit bei Kant', in Kant: Analysen, Probleme, Kritik Vol. 1, 1988, 193–220.\n\nAesthetic philosophy\n\nKant discusses the subjective nature of aesthetic qualities and experiences in Observations on the Feeling of the Beautiful and Sublime (1764). Kant's contribution to aesthetic theory is developed in the Critique of Judgment (1790) where he investigates the possibility and logical status of \"judgments of taste.\" In the \"Critique of Aesthetic Judgment,\" the first major division of the Critique of Judgment, Kant used the term \"aesthetic\" in a manner that, according to Kant scholar W.H. Walsh, differs from its modern sense.Critique of Judgment in \"Kant, Immanuel\" Encyclopedia of Philosophy. Vol 4. Macmillan, 1973. Prior to this, in the Critique of Pure Reason, to note essential differences between judgments of taste, moral judgments, and scientific judgments, Kant abandoned the term \"aesthetic\" as \"designating the critique of taste,\" noting that judgments of taste could never be \"directed\" by \"laws a priori\".Kant, Critique of Pure Reason, A22/B36. After A. G. Baumgarten, who wrote Aesthetica (1750–58),Beardsley, Monroe. \"History of Aesthetics\". Encyclopedia of Philosophy. Vol. 1, section on \"Toward a unified aesthetics\", p. 25, Macmillan 1973. Baumgarten coined the term \"aesthetics\" and expanded, clarified, and unified Wolffian aesthetic theory, but had left the Aesthetica unfinished (See also: Tonelli, Giorgio. \"Alexander Gottlieb Baumgarten\". Encyclopedia of Philosophy. Vol. 1, Macmillan 1973). In Bernard's translation of the Critique of Judgment he indicates in the notes that Kant's reference in § 15 in regard to the identification of perfection and beauty is probably a reference to Baumgarten. Kant was one of the first philosophers to develop and integrate aesthetic theory into a unified and comprehensive philosophical system, utilizing ideas that played an integral role throughout his philosophy.German Idealism in \"History of Aesthetics\" Encyclopedia of Philosophy. Vol 1. Macmillan, 1973.\n\nIn the chapter \"Analytic of the Beautiful\" of the Critique of Judgment, Kant states that beauty is not a property of an artwork or natural phenomenon, but is instead a consciousness of the pleasure that attends the 'free play' of the imagination and the understanding. Even though it appears that we are using reason to decide what is beautiful, the judgment is not a cognitive judgment,Kant's general discussions of the distinction between \"cognition\" and \"conscious of\" are also given in the Critique of Pure Reason (notably A320/B376), and section V and the conclusion of section VIII of his Introduction in Logic. \"and is consequently not logical, but aesthetical\" (§ 1). A pure judgement of taste is in fact subjective insofar as it refers to the emotional response of the subject and is based upon nothing but esteem for an object itself: it is a disinterested pleasure, and we feel that pure judgements of taste, i.e. judgements of beauty, lay claim to universal validity (§§20–22). It is important to note that this universal validity is not derived from a determinate concept of beauty but from common sense (§40). Kant also believed that a judgement of taste shares characteristics engaged in a moral judgement: both are disinterested, and we hold them to be universal. In the chapter \"Analytic of the Sublime\" Kant identifies the sublime as an aesthetic quality that, like beauty, is subjective, but unlike beauty refers to an indeterminate relationship between the faculties of the imagination and of reason, and shares the character of moral judgments in the use of reason. The feeling of the sublime, itself officially divided into two distinct modes (the mathematical and the dynamical sublime), describes two subjective moments, both of which concern the relationship of the faculty of the imagination to reason. Some commentators, however, argue that Kant's critical philosophy contains a third kind of the sublime, the moral sublime, which is the aesthetic response to the moral law or a representation thereof, and a development of the \"noble\" sublime in Kant's theory of 1764. The mathematical sublime is situated in the failure of the imagination to comprehend natural objects that appear boundless and formless, or appear \"absolutely great\" (§ 23–25). This imaginative failure is then recuperated through the pleasure taken in reason's assertion of the concept of infinity. In this move the faculty of reason proves itself superior to our fallible sensible self (§§ 25–26). In the dynamical sublime there is the sense of annihilation of the sensible self as the imagination tries to comprehend a vast might. This power of nature threatens us but through the resistance of reason to such sensible annihilation, the subject feels a pleasure and a sense of the human moral vocation. This appreciation of moral feeling through exposure to the sublime helps to develop moral character.\n\nKant had developed the distinction between an object of art as a material value subject to the conventions of society and the transcendental condition of the judgment of taste as a \"refined\" value in the propositions of his Idea of A Universal History (1784). In the Fourth and Fifth Theses of that work he identified all art as the \"fruits of unsociableness\" due to men's \"antagonism in society\",Kant, Immanuel. Idea for a Universal History. Trans. Lewis White Beck (20, 22). and in the Seventh Thesis asserted that while such material property is indicative of a civilized state, only the ideal of morality and the universalization of refined value through the improvement of the mind of man \"belongs to culture\".Kant, Immanuel. Idea for a Universal History. Trans. Lewis White Beck (26).\n\nPolitical philosophy\n\nIn \"Perpetual Peace: A Philosophical Sketch\",Kant, Immanuel. [http://www.mtholyoke.edu/acad/intrel/kant/kant1.htm Perpetual Peace: A Philosophical Sketch] (1795) Kant listed several conditions that he thought necessary for ending wars and creating a lasting peace. They included a world of constitutional republics.Kant, Immanuel. Perpetual Peace. Trans. Lewis White Beck (377). His classical republican theory was extended in the Science of Right, the first part of the Metaphysics of Morals (1797).Manfred Riedel Between Tradition and Revolution: The Hegelian Transformation of Political Philosophy, Cambridge 1984 Kant believed that universal history leads to the ultimate world of republican states at peace, but his theory was not pragmatic. The process was described in \"Perpetual Peace\" as natural rather than rational:\n\nKant's political thought can be summarized as republican government and international organization. \"In more characteristically Kantian terms, it is doctrine of the state based upon the law (Rechtsstaat) and of eternal peace. Indeed, in each of these formulations, both terms express the same idea: that of legal constitution or of 'peace through law'. Taken simply by itself, Kant's political philosophy, being essentially a legal doctrine, rejects by definition the opposition between moral education and the play of passions as alternate foundations for social life. The state is defined as the union of men under law. The state rightly so called is constituted by laws which are necessary a priori because they flow from the very concept of law. A regime can be judged by no other criteria nor be assigned any other functions, than those proper to the lawful order as such.\" History of Political Philosophy, edited by Leo Strauss and Joseph Cropsey, The University of Chicago Press, 1987, pp. 581–582, 603\n\nHe opposed \"democracy,\" which at his time meant direct democracy, believing that majority rule posed a threat to individual liberty. He stated, \"...democracy is, properly speaking, necessarily a despotism, because it establishes an executive power in which 'all' decide for or even against one who does not agree; that is, 'all,' who are not quite all, decide, and this is a contradiction of the general will with itself and with freedom.\"Kant, Immanuel. Perpetual Peace. Trans. Lewis White Beck (352). As with most writers at the time, he distinguished three forms of government i.e. democracy, aristocracy, and monarchy with mixed government as the most ideal form of it.\n\nAnthropology\n\nKant lectured on anthropology for over 25 years. His Anthropology from a Pragmatic Point of View was published in 1798. (This was the subject of Michel Foucault's secondary dissertation for his State doctorate, Introduction to Kant's Anthropology.) Kant's Lectures on Anthropology were published for the first time in 1997 in German.Thomas Sturm, Kant und die Wissenschaften vom Menschen (Paderborn: Mentis Verlag, 2009). The former was translated into English and published by the Cambridge Texts in the History of Philosophy series in 2006.Anthropology from a Pragmatic Point of View, ed. Robert B. Louden, introduction by Manfred Kuehn, Cambridge University Press, 2006\n\nKant was among the first people of his time to introduce anthropology as an intellectual area of study long before the field gained popularity. As a result, his texts are considered to have advanced the field. Kant's point of view also influenced the works of philosophers after him such as Martin Heidegger, Paul Ricoeur, and Jean Greisch.\n\nKant viewed anthropology in two broad categories. One category was the physiological approach which he referred to as \"what nature makes of the human being\". The other category was the pragmatic approach which explored the things a human \"can and should make of himself\".\n\nViews on homosexuality \n\n\"A second crimen carnis contra naturam is intercourse between seux hornogenii, in which the object of sexual impulse is a human being but there is homogeneity instead of heterogeneity of sex, as when a woman satisfies her desire on a woman or a man on a man. This practice too is contrary to the ends of humanity: for the end of humanity in respect of sexuality is to preserve the species without debasing the person: but in this instance the species is not being preserved.\"Lectures on Ethics, translated by L. Infield (New York: Harper & Row, 1'163), p. 170, quoted by Ruse, op. cit., p. 186. \n\nInfluence\n\nKant's influence on Western thought has been profound.Prof. Oliver A. Johnson claims that, \"With the possible exception of Plato's Republic, (Critique of Pure Reason) is the most important philosophical book ever written.\" Article on Kant within the collection \"Great thinkers of the Western World\", Ian P. McGreal, Ed., HarperCollins, 1992. Over and above his influence on specific thinkers, Kant changed the framework within which philosophical inquiry has been carried out. He accomplished a paradigm shift: very little philosophy is now carried out in the style of pre-Kantian philosophy. This shift consists in several closely related innovations that have become axiomatic, in philosophy itself and in the social sciences and humanities generally:\n* Kant's \"Copernican revolution\", that placed the role of the human subject or knower at the center of inquiry into our knowledge, such that it is impossible to philosophize about things as they are independently of us or of how they are for us;See Stephen Palmquist, \"The Architectonic Form of Kant's Copernican Logic\", Metaphilosophy 17:4 (October 1986), pp. 266–288; revised and reprinted as Chapter III of [http://www.hkbu.edu.hk/~ppp/ksp1 Kant's System of Perspectives]: An architectonic interpretation of the Critical philosophy (Lanham: University Press of America, 1993).\n* His invention of critical philosophy, that is of the notion of being able to discover and systematically explore possible inherent limits to our ability to know through philosophical reasoning;\n* His creation of the concept of \"conditions of possibility\", as in his notion of \"the conditions of possible experience\"that is that things, knowledge, and forms of consciousness rest on prior conditions that make them possible, so that, to understand or to know them, we must first understand these conditions;\n* His theory that objective experience is actively constituted or constructed by the functioning of the human mind;\n* His notion of moral autonomy as central to humanity;\n* His assertion of the principle that human beings should be treated as ends rather than as means.\n\nKant's ideas have been incorporated into a variety of schools of thought. These include German Idealism, Marxism, positivism, phenomenology, existentialism, critical theory, linguistic philosophy, structuralism, post-structuralism, and deconstructionism.\n\nHistorical influence\n\nDuring his own life, there was much critical attention paid to his thought. He had an influence on Reinhold, Fichte, Schelling, Hegel, and Novalis during the 1780s and 1790s. The school of thinking known as German Idealism developed from his writings. The German Idealists Fichte and Schelling, for example, tried to bring traditional \"metaphysically\" laden notions like \"the Absolute\", \"God\", and \"Being\" into the scope of Kant's critical thought.There is much debate in the recent scholarship about the extent to which Fichte and Schelling actually overstep the boundaries of Kant's critical philosophy, thus entering the realm of dogmatic or pre-Critical philosophy. Beiser's German Idealism discusses some of these issues. Beiser, Frederick C. German Idealism: The Struggle against Subjectivism, 1781–1801. Cambridge, MA: Harvard University Press, 2002. In so doing, the German Idealists tried to reverse Kant's view that we cannot know what we cannot observe.\n\nHegel was one of Kant's first major critics. In response to what he saw as Kant's abstract and formal account, Hegel brought about an ethic focused on the \"ethical life\" of the community.Georg Wilhelm Friedrich Hegel, Natural Law: The Scientific Ways of Treating Natural Law, Its Place in Moral Philosophy, and Its Relation to the Positive Sciences. trans. T. M. Knox. Philadelphia, PA: University of Pennsylvania Press, 1975. Hegel's mature view and his concept of \"ethical life\" is elaborated in his Philosophy of Right. Hegel, Philosophy of Right. trans. T. M. Knox. Oxford University Press, 1967. But Hegel's notion of \"ethical life\" is meant to subsume, rather than replace, Kantian ethics. And Hegel can be seen as trying to defend Kant's idea of freedom as going beyond finite \"desires\", by means of reason. Thus, in contrast to later critics like Nietzsche or Russell, Hegel shares some of Kant's most basic concerns.Robert Pippin's Hegel's Idealism (Cambridge: Cambridge University Press, 1989) emphasizes the continuity of Hegel's concerns with Kant's. Robert Wallace, Hegel's Philosophy of Reality, Freedom, and God (Cambridge: Cambridge University Press, 2005) explains how Hegel's Science of Logic defends Kant's idea of freedom as going beyond finite \"inclinations\", contra skeptics such as David Hume.\n\nKant's thinking on religion was used in Britain to challenge the decline in religious faith in the nineteenth century. British Catholic writers, notably G. K. Chesterton and Hilaire Belloc, followed this approach. Ronald Englefield debated this movement, and Kant's use of language. See Englefield's article,Englefield, Ronald, Kant as Defender of the Faith in Nineteenth-century England\", Question, 12, 16–27, (Pemberton, London) reprinted in Englefield.Englefield, Ronald, Critique of Pure Verbiage, Essays on Abuses of Language in Literary, Religious, and Philosophical Writings, edited by G. A. Wells and D. R. Oppenheimer, Open Court, 1990. Criticisms of Kant were common in the realist views of the new positivism at that time.\n\nArthur Schopenhauer was strongly influenced by Kant's transcendental idealism. He, like G. E. Schulze, Jacobi, and Fichte before him, was critical of Kant's theory of the thing in itself. Things in themselves, they argued, are neither the cause of what we observe nor are they completely beyond our access. Ever since the first Critique of Pure Reason philosophers have been critical of Kant's theory of the thing in itself. Many have argued, if such a thing exists beyond experience then one cannot posit that it affects us causally, since that would entail stretching the category 'causality' beyond the realm of experience. For a review of this problem and the relevant literature see The Thing in Itself and the Problem of Affection in the revised edition of Henry Allison's Kant's Transcendental Idealism. For Schopenhauer things in themselves do not exist outside the non-rational will. The world, as Schopenhauer would have it, is the striving and largely unconscious will. Michael Kelly, in the preface to his 1910 book Kant's Ethics and Schopenhauer's Criticism, stated: \"Of Kant it may be said that what is good and true in his philosophy would have been buried with him, were it not for Schopenhauer....\"\n\nWith the success and wide influence of Hegel's writings, Kant's influence began to wane, though there was in Germany a movement that hailed a return to Kant in the 1860s, beginning with the publication of Kant und die Epigonen in 1865 by Otto Liebmann. His motto was \"Back to Kant\", and a re-examination of his ideas began (See Neo-Kantianism). During the turn of the 20th century there was an important revival of Kant's theoretical philosophy, known as the Marburg School, represented in the work of Hermann Cohen, Paul Natorp, Ernst Cassirer,Beck, Lewis White. \"Neo-Kantianism\". In Encyclopedia of Philosophy. Vol. 5–6. Macmillan, 1973. Article on Neo-Kantianism by a translator and scholar of Kant. and anti-Neo-Kantian Nicolai Hartmann.Cerf, Walter. \"Nicolai Hartmann\". In Encyclopedia of Philosophy. Vol. 3–4. Macmillan, 1973. Nicolai was a realist who later rejected the idealism of Neo-Kantianism, his anti-Neo-Kantian views emerging with the publication of the second volume of Hegel (1929).\n\nKant's notion of \"Critique\" has been quite influential. The Early German Romantics, especially Friedrich Schlegel in his \"Athenaeum Fragments\", used Kant's self-reflexive conception of criticism in their Romantic theory of poetry.Schlegel, Friedrich. \"Athenaeum Fragments\", in Philosophical Fragments. Trans. Peter Firchow. Minneapolis, MN: University of Minnesota Press, 1991. See especially fragments Nos. 1, 43, 44. Also in Aesthetics, Clement Greenberg, in his classic essay \"Modernist Painting\", uses Kantian criticism, what Greenberg refers to as \"immanent criticism\", to justify the aims of Abstract painting, a movement Greenberg saw as aware of the key limitiaton—flatness—that makes up the medium of painting.Greenberg, Clement. \"Modernist Painting\", in The Philosophy of Art, ed. Alex Neill and Aaron Ridley, McGraw-Hill, 1995. French philosopher Michel Foucault was also greatly influenced by Kant's notion of \"Critique\" and wrote several pieces on Kant for a re-thinking of the Enlightenment as a form of \"critical thought\". He went so far as to classify his own philosophy as a \"critical history of modernity, rooted in Kant\".See \"Essential Works of Foucault: 1954–1984 vol.2: Aesthetics, Method, and Epistemology.\" Ed. by James Faubion, Trans. Robert Hurley et al. New York City, New York: The New Press, 1998 (2010 reprint). See \"Foucault, Michel, 1926 –\" entry by Maurice Florence.\n\nKant believed that mathematical truths were forms of synthetic a priori knowledge, which means they are necessary and universal, yet known through intuition.For a discussion and qualified defense of this position, see Stephen Palmquist, \"A Priori Knowledge in Perspective: (I) Mathematics, Method and Pure Intuition\", The Review of Metaphysics 41:1 (September 1987), pp. 3–22. Kant's often brief remarks about mathematics influenced the mathematical school known as intuitionism, a movement in philosophy of mathematics opposed to Hilbert's formalism, and the logicism of Frege and Bertrand Russell.Körner, Stephan, The Philosophy of Mathematics, Dover, 1986. For an analysis of Kant's writings on mathematics see, Friedman, Michael, Kant and the Exact Sciences, Cambridge, MA: Harvard University Press, 1992.\n\nInfluence on modern thinkers\n\nWith his \"Perpetual Peace: A Philosophical Sketch\", Kant is considered to have foreshadowed many of the ideas that have come to form the democratic peace theory, one of the main controversies in political science.Ray, James Lee. [http://www.mtholyoke.edu/acad/intrel/ray.htm Does Democracy Cause Peace?]  Annual Review of Political Science 1998. 1:27–46.\n\nProminent recent Kantians include the British philosophers P. F. StrawsonStrawson, P. F., The Bounds of Sense: An Essay on Kant's Critique of Pure Reason. Routledge: 2004. When first published in 1966, this book forced many Anglo-American philosophers to reconsider Kant's Critique of Pure Reason. and Quassim CassamCassam, Q., \"The Possibility of Knowledge\" Oxford: 2009 and the American philosophers Wilfrid SellarsSellars, Wilfrid, Science and Metaphysics: Variations on Kantian Themes. Ridgeview Publishing Company, 1967 and Christine Korsgaard.Korsgaard, Christine. Creating the Kingdom of Ends. Cambridge; New York, NY, US: Cambridge University Press, 1996. ,  (pbk.) Not a commentary, but a defense of a broadly Kantian approach to ethics Due to the influence of Strawson and Sellars, among others, there has been a renewed interest in Kant's view of the mind. Central to many debates in philosophy of psychology and cognitive science is Kant's conception of the unity of consciousness.Brook, Andrew. Kant and the Mind. Cambridge: Cambridge University Press, 1994. See also, Meerbote, R. \"Kant's Functionalism\". In: J. C. Smith, ed. Historical Foundations of Cognitive Science. Dordrecht, Holland: Reidel, 1991. Brook has an article on Kant's View of the Mind in the [http://plato.stanford.edu/entries/kant-mind/ Stanford Encyclopedia]\n\nJürgen Habermas and John Rawls are two significant political and moral philosophers whose work is strongly influenced by Kant's moral philosophy.See Habermas, J. Moral Consciousness and Communicative Action. Trans. Christian Lenhardt and Shierry Weber Nicholsen. Cambridge, MA: MIT Press, 1996. For Rawls see, Rawls, John. Theory of Justice Cambridge, MA: Harvard University Press, 1971. Rawls has a well-known essay on Kant's concept of good. See, Rawls, \"Themes in Kant's Moral Philosophy\" in Kant's Transcendental Deductions. Ed. Eckart Förster. Stanford, CA: Stanford University Press, 1989. They have each argued against relativism,Habermas, J. (1994): The Unity of Reason in the Diversity of Its Voices. In: Habermas, J. (Eds.): Postmetaphysical Thinking. Political Essays, Cambridge, Massachusetts: 115–148. supporting the Kantian view that universality is essential to any viable moral philosophy. Jean-Francois Lyotard, however, has emphasized the indeterminacy in the nature of thought and language and has engaged in debates with Habermas based on the effects this indeterminacy has on philosophical and political debates.Rorty, R. (2984) Habermas and Lyotard on postmodernity. Praxis International (32-44)\n\nKant's influence also has extended to the social, behavioral, and physical sciences, as in the sociology of Max Weber, the psychology of Jean Piaget, and the linguistics of Noam Chomsky. Kant's work on mathematics and synthetic a priori knowledge is also cited by theoretical physicist Albert Einstein as an early influence on his intellectual development.Issacson, Walter. \"Einstein: His Life and Universe.\" p. 20. Because of the thoroughness of the Kantian paradigm shift, his influence extends to thinkers who neither specifically refer to his work nor use his terminology.\n\nPersonal legacy\n\nKant always cut a curious figure in his lifetime for his modest, rigorously scheduled habits, which have been referred to as clocklike. But Heinrich Heine noted the magnitude of \"his destructive, world-crushing thoughts\" and considered him a sort of philosophical \"executioner\", comparing him to Robespierre with the observation that both men \"represented in the highest the type of provincial bourgeois. Nature had destined them to weigh coffee and sugar, but Fate determined that they should weigh other things and placed on the scales of the one a king, on the scales of the other a god.\"\n\nWhen he was exhumed for his body's transfer to a new burial spot, his skull was measured amidst his exhumation ceremony, and found to be larger than the average German male's with a \"high and broad\" forehead.Examined Lives, From Socrates to Nietzsche, James Miller p.284 His forehead has been an object of interest ever since it became well-known through his portraits: “In Döbler’s portrait and in Kiefer’s faithful if expressionistic reproduction of it — as well as in many of the other late eighteenth- and early nineteenth-century portraits of Kant — the forehead is remarkably large and decidedly retreating. Was Kant’s forehead shaped this way in these images because he was a philosopher, or, to follow the implications of Lavater’s system, was he a philosopher because of the intellectual acuity manifested by his forehead? Kant and Lavater were correspondents on theological matters, and Lavater cites Kant in the Physiognomy.”Immanuel Kant and the Bo(a)rders of Art History Mark Cheetham, in The Subjects of Art History: Historical Objects in Contemporary Perspectives, p. 16\n\nTomb and statue\n\nKant's tomb is today in a mausoleum adjoining the northeast corner of Königsberg Cathedral in what is now known as Kaliningrad, Russia. The mausoleum was constructed by the architect Friedrich Lahrs and was finished in 1924 in time for the bicentenary of Kant's birth. Originally, Kant was buried inside the cathedral, but in 1880 his remains were moved outside and placed in a neo-Gothic chapel adjoining the northeast corner of the cathedral. Over the years, the chapel became dilapidated before it was demolished to make way for the mausoleum, which was built on the same spot, where it is today.\n\nThe tomb and its mausoleum are among the few artifacts of German times preserved by the Soviets after they conquered and annexed the city. Today, many newlyweds bring flowers to the mausoleum.\n\nArtifacts previously owned by Kant, known as Kantiana, were included in the Königsberg City Museum. However, the museum was destroyed during World War II.\n\nA replica of the statue of Kant that stood in German times in front of the main University of Königsberg building was donated by a German entity in the early 1990s and placed in the same grounds.\n\nAfter the expulsion of Königsberg's German population at the end of World War II, the University of Königsberg where Kant taught was replaced by the Russian-language Kaliningrad State University, which took up the campus and surviving buildings of the historic German university. In 2005, the university was renamed Immanuel Kant State University of Russia. The change of name was announced at a ceremony attended by President Vladimir Putin of Russia and Chancellor Gerhard Schröder of Germany, and the university formed a Kant Society, dedicated to the study of Kantianism.\n\nBibliography\n\nList of major works\n\n* (1749) Thoughts on the True Estimation of Living Forces (Gedanken von der wahren Schätzung der lebendigen Kräfte)\n* (March 1755) Universal Natural History and Theory of Heaven (Allgemeine Naturgeschichte und Theorie des Himmels)\n* (Apr. 1755) Brief Outline of Certain Meditations on Fire (Meditationum quarundam de igne succinta delineatio (master's thesis under Johann Gottfried Teske))The thesis was submitted on 17 April 1755. \"The public examination was held four weeks later on 13 May, and the degree was formally awarded on 12 June\" (Eric Watkins, Kant: Natural Science, Cambridge University Press, 2012, p. 309).Eric Watkins (ed.), Kant and the Sciences, Oxford University Press, 2001, p. 27.Martin Schonfeld, The Philosophy of the Young Kant: The Precritical Project, Oxford University Press, 2000, p. 74.Available [https://korpora.zim.uni-duisburg-essen.de/kant/aa01/369.html online at Bonner Kant-Korpus].\n* (Sep. 1755) A New Elucidation of the First Principles of Metaphysical Cognition (Principiorum primorum cognitionis metaphysicae nova dilucidatio (doctoral thesis))The thesis was publicly disputed on 27 September 1755 (Kuehn 2001, p. 100).Available [https://korpora.zim.uni-duisburg-essen.de/kant/aa01/385.html online at Bonner Kant-Korpus].\n* (1756) The Use in Natural Philosophy of Metaphysics Combined with Geometry, Part I: Physical Monadology (Metaphysicae cum geometrica iunctae usus in philosophin naturali, cuius specimen I. continet monadologiam physicam, abbreviated as Monadologia Physica (thesis as a prerequisite of associate professorship))Kant's application for the position was unsuccessful. He defended it on 10 April 1756 (Kuehn 2001, p. 102).\n* (1762) The False Subtlety of the Four Syllogistic Figures (Die falsche Spitzfindigkeit der vier syllogistischen Figuren)\n* (1763) The Only Possible Argument in Support of a Demonstration of the Existence of God (Der einzig mögliche Beweisgrund zu einer Demonstration des Daseins Gottes)\n* (1763) Attempt to Introduce the Concept of Negative Magnitudes into Philosophy (Versuch den Begriff der negativen Größen in die Weltweisheit einzuführen)\n* (1764) Observations on the Feeling of the Beautiful and Sublime (Beobachtungen über das Gefühl des Schönen und Erhabenen)\n* (1764) Essay on the Illness of the Head (Über die Krankheit des Kopfes)\n* (1764) Inquiry Concerning the Distinctness of the Principles of Natural Theology and Morality (the Prize Essay) (Untersuchungen über die Deutlichkeit der Grundsätze der natürlichen Theologie und der Moral)\n* (1766) Dreams of a Spirit-Seer (Träume eines Geistersehers)Available [https://archive.org/details/dreamsofspiritse00kant online at Archive.org].\n* (1770) Dissertation on the Form and Principles of the Sensible and the Intelligible World (De mundi sensibilis atque intelligibilis forma et principiis (doctoral thesis))The thesis was publicly disputed on 21 August 1770 (Kuehn 2001, p. 189).Available [https://books.google.com/books?iddNRKAQAAMAAJ&pg\nPA123&redir_escy#v\nonepage&q&ffalse online at Google Books].English translation available online at Wikisource.\n* (1775) On the Different Races of Man (Über die verschiedenen Rassen der Menschen)\n* (1781) First edition of the Critique of Pure Reason (Kritik der reinen Vernunft)\n* (1783) Prolegomena to any Future Metaphysicshttp://eserver.org/philosophy/kant-prolegomena.txt (Prolegomena zu einer jeden künftigen Metaphysik)\n* (1784) \"An Answer to the Question: What Is Enlightenment?\" (\"Beantwortung der Frage: Was ist Aufklärung?\")\n* (1784) \"Idea for a Universal History with a Cosmopolitan Purpose\" (\"Idee zu einer allgemeinen Geschichte in weltbürgerlicher Absicht\")\n* (1785) Groundwork of the Metaphysics of Morals (Grundlegung zur Metaphysik der Sitten)\n* (1786) Metaphysical Foundations of Natural Science (Metaphysische Anfangsgründe der Naturwissenschaft)\n* (1786) \"[https://archive.org/details/KantOrientFerrerMarch2014 What does it mean to orient oneself in thinking?]\" (\"Was heißt: sich im Denken orientieren?\")\n* (1786) Conjectural Beginning of Human History\n* (1787) Second edition of the Critique of Pure Reason (Kritik der reinen Vernunft)\n* (1788) Critique of Practical Reasonhttp://eserver.org/philosophy/kant/critique-of-practical-reaso.txt (Kritik der praktischen Vernunft)\n* (1790) Critique of Judgment (Kritik der Urteilskraft) \n* (1793) Religion within the Limits of Reason Alone (Die Religion innerhalb der Grenzen der bloßen Vernunft)\n* (1793) On the Old Saw: That may be right in theory, but it won't work in practice (Über den Gemeinspruch: Das mag in der Theorie richtig sein, taugt aber nicht für die Praxis)\n* (1795) \"Perpetual Peace\" (\"Zum ewigen Frieden\")\n* (1797) Metaphysics of Morals (Metaphysik der Sitten). First part is The Doctrine of Right, which has often been published separately as The Science of Right.\n* (1798) Anthropology from a Pragmatic Point of View (Anthropologie in pragmatischer Hinsicht)\n* (1798) The Contest of Faculties (Der Streit der Fakultäten)\n* (1800) Logic (Logik)\n* (1803) On Pedagogy (Über Pädagogik)Available [http://www.deutschestextarchiv.de/book/show/kant_paedagogik_1803 online at DeutschesTextArchiv.de].\n* (1804) Opus Postumum\n* (1817) Lectures on Philosophical Theology (Immanuel Kants Vorlesungen über die philosophische Religionslehre edited by K. H. L. Pölitz) [The English edition of A. W. Wood & G. M. Clark (Cornell, 1978) is based on Pölitz' second edition, 1830, of these lectures.]As noted by Allen W. Wood in his Introduction, p. 12. Wood further speculates that the lectures themselves were delivered in the Winter of 1783–84.\n\nCollected works in German\n\nWilhelm Dilthey inaugurated the Academy edition (the Akademie-Ausgabe abbreviated as AA or Ak) of Kant's writings (Gesammelte Schriften, Königlich-Preußische Akademie der Wissenschaften, Berlin, 1902–38) in 1895,Immanuel Kant, Notes and Fragments, Cambridge University Press, 2005, p. xvi. and served as its first editor. The volumes are grouped into four sections:\n* I. Kant's published writings (vols. 1–9),\n* II. Kant's correspondence (vols. 10–13),\n* III. Kant's literary remains, or Nachlass (vols. 14–23), and\n* IV. Student notes from Kant’s lectures (vols. 24–29).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Immanuel Kant" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14631" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Immanuel Kant (;[http://dictionary.reference.com/browse/kant \"Kant\"]. Random House Webster's Unabridged Dictionary.; 22 April 1724 – 12 February 1804) was a German philosopher who is a central figure in modern philosophy. Kant argues that the human mind creates the structure of human experience, that reason is the source of morality, that aesthetics arises from a faculty of disinterested judgment, that space and time are forms of human sensibility, and that the world as it is \"in-itself\" is independent of humanity's concepts of it. Kant took himself to have effected a \"Copernican revolution\" in philosophy, akin to Copernicus' reversal of the age-old belief that the sun revolves around the earth. Kant's beliefs continue to have a major influence on contemporary philosophy, especially the fields of metaphysics, epistemology, ethics, political theory, and aesthetics.\n\nPolitically, Kant is one of the earliest exponents of the idea that perpetual peace could be secured through universal democracy and international cooperation. He believed that this will be the eventual outcome of universal history, although it is not rationally planned.Idea for a Universal History with a Cosmopolitan Purpose. The exact nature of Kant's religious ideas continues to be the subject of especially heated philosophical dispute, as viewpoints are ranging from the idea that Kant was an early and radical exponent of atheism who finally exploded the ontological argument for God's existence, to more critical treatments epitomized by Nietzsche who claimed that Kant had \"theologian blood\"Friedrich Nietzsche, The Anti-Christ (1895), [https://books.google.com/books?idDcVl57jzP2gC&pg\nPA9&lpgPA9&dq\n%22theologian+blood%22+the+antichrist&sourcebl&ots\nCzqxPveANg&sigA-X36l8mmYUUI3wT56qpkBnVwpc&hl\nen&saX&ved\n0CCwQ6AEwA2oVChMIm-iS_d_UxwIVA3Y-Ch2mGgvo#vonepage&q\n%22theologian%20blood%22%20the%20antichrist&f=false para. 10]. and that Kant was merely a sophisticated apologist for traditional Christian religious belief, writing that \"Kant wanted to prove, in a way that would dumbfound the common man, that the common man was right: that was the secret joke of this soul.\"Friedrich Nietzsche (trans. Walter Arnold Kaufmann), The Portable Nietzsche, 1976, p. 96.\n\nIn one of Kant's major works, the Critique of Pure Reason (Kritik der reinen Vernunft, 1781), he attempted to explain the relationship between reason and human experience and to move beyond the failures of traditional philosophy and metaphysics. Kant wanted to put an end to an era of futile and speculative theories of human experience, while resisting the skepticism of thinkers such as David Hume. Kant regarded himself as ending and showing the way beyond the impasse which modern philosophy had led to between rationalists and empiricists, and is widely held to have synthesized these two early modern traditions in his thought.\n\nKant argued that our experiences are structured by necessary features of our minds. In his view, the mind shapes and structures experience so that, on an abstract level, all human experience shares certain essential structural features. Among other things, Kant believed that the concepts of space and time are integral to all human experience, as are our concepts of cause and effect.\n One important consequence of this view is that our experience of things is always of the phenomenal world as conveyed by our senses: we do not have direct access to things in themselves, the so-called noumenal world. Kant published other important works on ethics, religion, law, aesthetics, astronomy, and history. These included the Critique of Practical Reason (Kritik der praktischen Vernunft, 1788), the Metaphysics of Morals (Die Metaphysik der Sitten, 1797), which dealt with ethics, and the Critique of Judgment (Kritik der Urteilskraft, 1790), which looks at aesthetics and teleology.\n\nBiography\n\nImmanuel Kant was born on April 22, 1724 in Königsberg, Prussia (since 1946 the city of Kaliningrad, Kaliningrad Oblast, Russia). His mother, Anna Regina Reuter\n (1697–1737), was also born in Königsberg to a father from Nuremberg. (Her name is sometimes erroneously given as Anna Regina Porter.) His father, Johann Georg Kant (1682–1746), was a German harness maker from Memel, at the time Prussia's most northeastern city (now Klaipėda, Lithuania). Immanuel Kant believed that his paternal grandfather Hans Kant was of Scottish origin.Mortensen, Hans and Gertrud, Kants väterliche Ahnen und ihre Umwelt, Rede von 1952 in Jahrbuch der Albertus-Universität zu Königsberg, Pr., Holzner-Verlag, Kitzingen, Main 1953, Vol. 3, p. 26. While scholars of Kant's life long accepted the claim, there is no evidence that Kant's paternal line was Scottish; it is more likely that the Kants got their name from the village of Kantwaggen (today part of Priekulė) and were of Curonian origin.R. K. Murray, \"The Origin of Immanuel Kant's Family Name\", Kantian Review 13(1), March 2008, pp. 190-193.Rosa Kohlheim, Volker Kohlheim, Duden – Familiennamen: Herkunft und Bedeutung von 20.000 Nachnamen, Bibliographisches Institut & F. A. Brockhaus AG, Mannheim 2005, p. 365. Kant was the fourth of nine children (four of them reached adulthood).[http://www.freunde-kants.com/attachments/article/137/Bohnenrede%202015%20(de).pdf freunde-kants.com]   Baptized 'Emanuel', he changed his name to 'Immanuel'Kuehn 2001, p. 26. after learning Hebrew.\n\nYoung Kant was a solid, albeit unspectacular, student. Kant was born into a Prussian German family of Lutheran Protestant faith in East Prussia. He was brought up in a Pietist household that stressed religious devotion, humility, and a literal interpretation of the Bible. His education was strict, punitive and disciplinary, and focused on Latin and religious instruction over mathematics and science.Kuehn 2001, p. 47. Kant maintained a belief in Christianity, in his work Groundwork of the Metaphysic of Morals he reveals a belief in human immortality as the necessary condition of our continued approach to the highest good possible.Metaphysics, p. 131 However, as Kant was skeptical about some of the arguments used prior to him in defence of Theism and maintained that human understanding is limited and can never attain knowledge about God or the soul, various commentators have labelled him a philosophical agnostic.\"While this sounds skeptical, Kant is only agnostic about our knowledge of metaphysical objects such as God. And, as noted above, Kant's agnosticism leads to the conclusion that we can neither affirm nor deny claims made by traditional metaphysics.\" Andrew Fiala, J. M. D. Meiklejohn, Critique of Pure Reason – Introduction, page xi. \n\nCommon myths about Kant's personal mannerisms are listed, explained, and refuted in Goldthwait's introduction to his translation of Observations on the Feeling of the Beautiful and Sublime.\nKant, Immanuel. Observations on the Feeling of the Beautiful and Sublime. Trans. John T. Goldthwait. University of California Press, 1961, 2003. \n It is often held that Kant lived a very strict and disciplined life, leading to an oft-repeated story that neighbors would set their clocks by his daily walks. He never married, but seemed to have a rewarding social life — he was a popular teacher and a modestly successful author even before starting on his major philosophical works. He had a circle of friends whom he frequently met, among them Joseph Green, an English merchant in Königsberg.\n\nA common myth is that Kant never traveled more than 16 km from Königsberg his whole life.Lewis, Rick. 2005. [https://philosophynow.org/issues/49/Kant_200_Years_On 'Kant 200 Years On']. Philosophy Now. No. 49. In fact, between 1750 and 1754 he worked as a tutor (Hauslehrer) in Judtschen (now Veselovka, Russia, approximately 20 km) and in Groß-Arnsdorf (now Jarnołtowo near Morąg (German: Mohrungen), Poland, approximately 145 km).\n\nYoung scholar\n\nKant showed a great aptitude for study at an early age. He first attended the Collegium Fridericianum from which he graduated at the end of the summer of 1740. In 1740, aged 16, he enrolled at the University of Königsberg, where he spent his whole career.The American International Encyclopedia (New York: J.J. Little & Ives, 1954), Vol. IX. He studied the philosophy of Gottfried Leibniz and Christian Wolff under Martin Knutzen (Associate Professor of Logic and Metaphysics from 1734 until his death in 1756), a rationalist who was also familiar with developments in British philosophy and science and introduced Kant to the new mathematical physics of Isaac Newton. Knutzen dissuaded Kant from the theory of pre-established harmony, which he regarded as \"the pillow for the lazy mind\". He also dissuaded Kant from idealism, the idea that reality is purely mental, which most philosophers in the 18th century regarded in a negative light. (The theory of transcendental idealism that Kant developed in the Critique of Pure Reason is not traditional idealism and the Critiques second part even argues against traditional idealism.)\n\nHis father's stroke and subsequent death in 1746 interrupted his studies. Kant left Königsberg shortly after August 1748Kuehn 2001, p. 94.—he would return there in August 1754.Kuehn 2001, p. 98. He became a private tutor in the towns surrounding Königsberg, but continued his scholarly research. In 1749, he published his first philosophical work, Thoughts on the True Estimation of Living Forces (written in 1745–47).Eric Watkins (ed.), Immanuel Kant: Natural Science, Cambridge University Press, 2012: [http://assets.cambridge.org/97805213/63945/excerpt/9780521363945_excerpt.pdf \"Thoughts on the true estimation...\"].\n\nEarly work\n\nKant is best known for his work in the philosophy of ethics and metaphysics, but he made significant contributions to other disciplines. He made an important astronomical discovery about the nature of Earth's rotation, for which he won the Berlin Academy Prize in 1754. According to Lord Kelvin in 1897, Kant made contributions useful to mathematicians or physical astronomers. According to Thomas Huxley in 1867 Kant made contributions to geology as well when, in 1775 [1755], he wrote his General Natural History and Theory of the Celestial Bodies; or, an Attempt to Account for the Constitutional and Mechanical Origin of the Universe, upon Newtonian Principles.\"\n\nIn the General History of Nature and Theory of the Heavens (Allgemeine Naturgeschichte und Theorie des Himmels) (1755), Kant laid out the Nebular hypothesis, in which he deduced that the Solar System formed from a large cloud of gas, a nebula. Thus he tried to explain the order of the solar system, which Isaac Newton had explained as imposed from the beginning by God. Kant also correctly deduced that the Milky Way was a large disk of stars, which he theorized also formed from a (much larger) spinning cloud of gas. He further suggested that other nebulae might also be similarly large and distant disks of stars. These postulations opened new horizons for astronomy: for the first time extending astronomy beyond the solar system to galactic and extragalactic realms.George Gamow, One, Two, Three... Infinity, pp. 300ff. Viking Press, 1954\n\nFrom then on, Kant turned increasingly to philosophical issues, although he continued to write on the sciences throughout his life. In the early 1760s, Kant produced a series of important works in philosophy. The False Subtlety of the Four Syllogistic Figures, a work in logic, was published in 1762. Two more works appeared the following year: Attempt to Introduce the Concept of Negative Magnitudes into Philosophy and The Only Possible Argument in Support of a Demonstration of the Existence of God. In 1764, Kant wrote Observations on the Feeling of the Beautiful and Sublime and then was second to Moses Mendelssohn in a Berlin Academy prize competition with his Inquiry Concerning the Distinctness of the Principles of Natural Theology and Morality (often referred to as \"The Prize Essay\"). In 1766 Kant wrote Dreams of a Spirit-Seer which dealt with the writings of Emanuel Swedenborg. On 31 March 1770, aged 45, Kant was finally appointed Full Professor of Logic and Metaphysics (Professor Ordinarius der Logic und Metaphysic) at the University of Königsberg. In defense of this appointment, Kant wrote his inaugural dissertation (Inaugural-Dissertation) De Mundi Sensibilis atque Intelligibilis Forma et Principiis (On the Form and Principles of the Sensible and the Intelligible World).Since he had written his last habilitation thesis 14 years earlier, a new habilitation thesis was required (see S. J. McGrath, Joseph Carew (eds.), Rethinking German Idealism, Palgrave Macmillan, 2016, p. 24). This work saw the emergence of several central themes of his mature work, including the distinction between the faculties of intellectual thought and sensible receptivity. To miss this distinction would mean to commit the error of subreption, and, as he says in the last chapter of the dissertation, only in avoiding this error does metaphysics flourish.\n\nThe issue that vexed Kant was central to what 20th-century scholars called \"the philosophy of mind\". The flowering of the natural sciences had led to an understanding of how data reaches the brain. Sunlight falling on an object is reflected from its surface in a way that maps the surface features (color, texture, etc.). The reflected light reaches the human eye, passes through the cornea, is focused by the lens onto the retina where it forms an image similar to that formed by light passing through a pinhole into a camera obscura. The retinal cells send impulses through the optic nerve and then they form a mapping in the brain of the visual features of the object. The interior mapping is not the exterior object, and our belief that there is a meaningful relationship between the object and the mapping in the brain depends on a chain of reasoning that is not fully grounded. But the uncertainty aroused by these considerations, by optical illusions, misperceptions, delusions, etc., are not the end of the problems.\n\nKant saw that the mind could not function as an empty container that simply receives data from outside. Something must be giving order to the incoming data. Images of external objects must be kept in the same sequence in which they were received. This ordering occurs through the mind's intuition of time. The same considerations apply to the mind's function of constituting space for ordering mappings of visual and tactile signals arriving via the already described chains of physical causation.\n\nIt is often claimed that Kant was a late developer, that he only became an important philosopher in his mid-50s after rejecting his earlier views. While it is true that Kant wrote his greatest works relatively late in life, there is a tendency to underestimate the value of his earlier works. Recent Kant scholarship has devoted more attention to these \"pre-critical\" writings and has recognized a degree of continuity with his mature work.Cf., for example, Susan Shell, The Embodiment of Reason (Chicago, 1996)\n\nWork hiatus\n\nAt age 46, Kant was an established scholar and an increasingly influential philosopher, as much was expected of him.\n\nIn correspondence with his ex-student and friend Markus Herz, Kant admitted that, in the inaugural dissertation, he had failed to account for the relation between our sensible and intellectual faculties. He needed to explain how we combine what is known as sensory knowledge with the other type of knowledge – i.e. reasoned knowledge. These two being are related but have very different processes.\n\nKant also credited David Hume with awakening him from dogmatic slumber (circa 1771). Hume had stated that experience consists only of sequences of feelings, images or sounds. Ideas such as \"cause\", goodness, or objects were not evident in experience, so why do we believe in the reality of these? Kant felt that reason could remove this skepticism, and he set himself to solving these problems. He did not publish any work in philosophy for the next 11 years.\n\nAlthough fond of company and conversation with others, Kant isolated himself, and resisted friends' attempts to bring him out of his isolation. It's been noted that in 1778, in response to one of these offers by a former pupil, Kant wrote:\n\nWhen Kant emerged from his silence in 1781, the result was the Critique of Pure Reason. Although now uniformly recognized as one of the greatest works in the history of philosophy, this Critique was largely ignored upon its initial publication. The book was long, over 800 pages in the original German edition, and written in a convoluted style. It received few reviews, and these granted it no significance. Kant's former student, Johann Gottfried Herder criticized it for placing reason as an entity worthy of criticism instead of considering the process of reasoning within the context of language and one's entire personality.Copleston, Frederick Charles. The Enlightenment: Voltaire to Kant. 2003. p. 146. Similar to Christian Garve and Johann Georg Heinrich Feder, he rejected Kant's position that space and time possessed a form that could be analyzed. Additionally, Garve and Feder also faulted Kant's Critique for not explaining differences in perception of sensations.Sassen, Brigitte. Kant's Early Critics: The Empiricist Critique of the Theoretical Philosophy. 2000. Its density made it, as Herder said in a letter to Johann Georg Hamann, a \"tough nut to crack\", obscured by \"all this heavy gossamer\".Ein Jahrhundert deutscher Literaturkritik, vol. III, Der Aufstieg zur Klassik in der Kritik der Zeit (Berlin, 1959), p. 315; as quoted in Gulyga, Arsenij. Immanuel Kant: His Life and Thought. Trans., Marijan Despaltović. Boston: Birkhäuser, 1987. Its reception stood in stark contrast to the praise Kant had received for earlier works, such as his Prize Essay and shorter works that preceded the first Critique. These well-received and readable tracts include one on the earthquake in Lisbon that was so popular that it was sold by the page.Gulyga, Arsenij. Immanuel Kant: His Life and Thought. Trans., Marijan Despaltović. Boston: Birkhäuser, 1987 pp. 28–9. Prior to the change in course documented in the first Critique, his books sold well, and by the time he published Observations on the Feeling of the Beautiful and Sublime in 1764 he had become a notable popular author.Gulyga, Arsenij. Immanuel Kant: His Life and Thought. Trans., Marijan Despaltović. Boston: Birkhäuser, 1987, p. 62. Kant was disappointed with the first Critique's reception. Recognizing the need to clarify the original treatise, Kant wrote the Prolegomena to any Future Metaphysics in 1783 as a summary of its main views. Shortly thereafter, Kant's friend Johann Friedrich Schultz (1739–1805) (professor of mathematics) published Erläuterungen über des Herrn Professor Kant Critik der reinen Vernunft (Königsberg, 1784), which was a brief but very accurate commentary on Kant's Critique of Pure Reason.\n\nKant's reputation gradually rose through the latter portion of the 1780s, sparked by a series of important works: the 1784 essay, \"Answer to the Question: What is Enlightenment?\"; 1785's Groundwork of the Metaphysics of Morals (his first work on moral philosophy); and, from 1786, Metaphysical Foundations of Natural Science. But Kant's fame ultimately arrived from an unexpected source. In 1786, Karl Leonhard Reinhold published a series of public letters on Kantian philosophy. In these letters, Reinhold framed Kant's philosophy as a response to the central intellectual controversy of the era: the Pantheism Dispute. Friedrich Jacobi had accused the recently deceased Gotthold Ephraim Lessing (a distinguished dramatist and philosophical essayist) of Spinozism. Such a charge, tantamount to atheism, was vigorously denied by Lessing's friend Moses Mendelssohn, leading to a bitter public dispute among partisans. The controversy gradually escalated into a debate about the values of the Enlightenment and the value of reason.\n\nReinhold maintained in his letters that Kant's Critique of Pure Reason could settle this dispute by defending the authority and bounds of reason. Reinhold's letters were widely read and made Kant the most famous philosopher of his era.\n\nLater work and death\n\nKant published a second edition of the Critique of Pure Reason (Kritik der reinen Vernunft) in 1787, heavily revising the first parts of the book. Most of his subsequent work focused on other areas of philosophy. He continued to develop his moral philosophy, notably in 1788's Critique of Practical Reason (known as the second Critique) and 1797's Metaphysics of Morals. The 1790 Critique of Judgment (the third Critique) applied the Kantian system to aesthetics and teleology.\n\nIn 1792, Kant's attempt to publish the Second of the four Pieces of Religion within the Bounds of Bare Reason, in the journal Berlinische Monatsschrift, met with opposition from the King's censorship commission, which had been established that same year in the context of the French Revolution. Kant then arranged to have all four pieces published as a book, routing it through the philosophy department at the University of Jena to avoid the need for theological censorship.Derrida Vacant Chair p. 44. This insubordination earned him a now famous reprimand from the King. When he nevertheless published a second edition in 1794, the censor was so irate that he arranged for a royal order that required Kant never to publish or even speak publicly about religion. Kant then published his response to the King's reprimand and explained himself, in the preface of The Conflict of the Faculties.\n\nHe also wrote a number of semi-popular essays on history, religion, politics and other topics. These works were well received by Kant's contemporaries and confirmed his preeminent status in 18th-century philosophy. There were several journals devoted solely to defending and criticizing Kantian philosophy. Despite his success, philosophical trends were moving in another direction. Many of Kant's most important disciples and followers (including Reinhold, Beck and Fichte) transformed the Kantian position into increasingly radical forms of idealism. The progressive stages of revision of Kant's teachings marked the emergence of German Idealism. Kant opposed these developments and publicly denounced Fichte in an open letter in 1799. It was one of his final acts expounding a stance on philosophical questions. In 1800, a student of Kant named Gottlob Benjamin Jäsche (1762–1842) published a manual of logic for teachers called Logik, which he had prepared at Kant's request. Jäsche prepared the Logik using a copy of a textbook in logic by Georg Friedrich Meier entitled Auszug aus der Vernunftlehre, in which Kant had written copious notes and annotations. The Logik has been considered of fundamental importance to Kant's philosophy, and the understanding of it. The great 19th-century logician Charles Sanders Peirce remarked, in an incomplete review of Thomas Kingsmill Abbott's English translation of the introduction to Logik, that \"Kant's whole philosophy turns upon his logic.\"Peirce, C.S., Collected Papers of Charles Sanders Peirce, v.1, (HUP, 1960), 'Kant and his Refutation of Idealism' p. 15\n Also, Robert Schirokauer Hartman and Wolfgang Schwarz, wrote in the translators' introduction to their English translation of the Logik, \"Its importance lies not only in its significance for the Critique of Pure Reason, the second part of which is a restatement of fundamental tenets of the Logic, but in its position within the whole of Kant's work.\"Kant, Immanuel, Logic, G.B. Jäsche (ed), R.S. Hartman, W. Schwarz (translators), Indianapolis, 1984, p. xv.\n\nKant's health, long poor, worsened and he died at Königsberg on 12 February 1804, uttering \"Es ist gut\" (\"It is good\") before expiring.Karl Vorländer, Immanuel Kant: Der Mann und das Werk, Hamburg: Meiner, 1992, p. II 332. His unfinished final work was published as Opus Postumum.\n\nKant wrote a book discussing his theory of virtue in terms of independence which he believed was \"a viable modern alternative to more familiar Greek views about virtue\". This book is often criticized for its hostile tone and for not articulating his thoughts about autocracy comprehensibly. In the self-governance model of Aristotelian virtue, the non-rational part of the soul can be made to listen to reason through training. Although Kantian self-governance appears to involve \"a rational crackdown on appetites and emotions\" with lack of harmony between reason and emotion, Kantian virtue denies requiring \"self-conquest, self-suppression, or self-silencing\". They dispute that \"the self-mastery constitutive of virtue is ultimately mastery over our tendency of will to give priority to appetite or emotion unregulated by duty, it does not require extirpating, suppressing, or silencing sensibility in general\".\n\nPhilosophy\n\nIn Kant's essay \"Answering the Question: What is Enlightenment?\",\nKant defined the Enlightenment as an age shaped by the Latin motto Sapere aude (\"Dare to be wise\"). Kant maintained that one ought to think autonomously, free of the dictates of external authority. His work reconciled many of the differences between the rationalist and empiricist traditions of the 18th century. He had a decisive impact on the Romantic and German Idealist philosophies of the 19th century. His work has also been a starting point for many 20th century philosophers.\n\nKant asserted that, because of the limitations of argumentation in the absence of irrefutable evidence, no one could really know whether there is a God and an afterlife or not. For the sake of morality and as a ground for reason, Kant asserted, people are justified in believing in God, even though they could never know God's presence empirically. He explained:\n\nThe sense of an enlightened approach and the critical method required that \"If one cannot prove that a thing is, he may try to prove that it is not. If he fails to do either (as often occurs), he may still ask whether it is in his interest to accept one or the other of the alternatives hypothetically, from the theoretical or the practical point of view. Hence the question no longer is as to whether perpetual peace is a real thing or not a real thing, or as to whether we may not be deceiving ourselves when we adopt the former alternative, but we must act on the supposition of its being real.\"The Science of Right, Conclusion. The presupposition of God, soul, and freedom was then a practical concern, for \"Morality, by itself, constitutes a system, but happiness does not, unless it is distributed in exact proportion to morality. This, however, is possible in an intelligible world only under a wise author and ruler. Reason compels us to admit such a ruler, together with life in such a world, which we must consider as future life, or else all moral laws are to be considered as idle dreams... .\"Critique of Pure Reason, A811.\n\nKant drew a parallel between the \"Copernican revolution\" and the epistemology of his new transcendental philosophy, although, according to Tom Rockmore,Tom Rockmore, Marx After Marxism: The Philosophy of Karl Marx (2002), p. 184. Kant himself never used the \"Copernican revolution\" phrase about himself, though it was \"routinely\" applied to his work by others.\n\nKant's Copernican revolution involved two interconnected foundations of his \"critical philosophy\":\n* the epistemology of transcendental idealism and\n* the moral philosophy of the autonomy of practical reason.\n\nThese teachings placed the active, rational human subject at the center of the cognitive and moral worlds. Kant argued that the rational order of the world as known by science was not just the accidental accumulation of sense perceptions.\n\nConceptual unification and integration is carried out by the mind through concepts or the \"categories of the understanding\" operating on the perceptual manifold within space and time. The latter are not concepts,In the first edition of the Critique of Pure Reason Kant refers to space as \"no discursive or...general conception of the relation of things, but a pure intuition\" and maintained that \"We can only represent to ourselves one space\". The \"general notion of spaces...depends solely upon limitations\" (Meikeljohn trans., A25). In the second edition of the CPR, Kant adds, \"The original representation of space is an a priori intuition, not a concept\" (Kemp Smith trans., B40). In regard to time, Kant states that \"Time is not a discursive, or what is called a general concept, but a pure form of sensible intuition. Different times are but parts of one and the same time; and the representation which can be given only through a single object is intuition\" (A31/B47). For the differences in the discursive use of reason according to concepts and its intuitive use through the construction of concepts, see Critique of Pure Reason (A719/B747 ff. and A837/B865). On \"One and the same thing in space and time\" and the mathematical construction of concepts, see A724/B752. but are forms of sensibility that are a priori necessary conditions for any possible experience. Thus the objective order of nature and the causal necessity that operates within it depend on the mind's processes, the product of the rule-based activity that Kant called, \"synthesis.\" There is much discussion among Kant scholars about the correct interpretation of this train of thought.\n\nThe 'two-world' interpretation regards Kant's position as a statement of epistemological limitation, that we are not able to transcend the bounds of our own mind, meaning that we cannot access the \"thing-in-itself\". However, Kant also speaks of the thing in itself or transcendental object as a product of the (human) understanding as it attempts to conceive of objects in abstraction from the conditions of sensibility. Following this line of thought, some interpreters have argued that the thing in itself does not represent a separate ontological domain but simply a way of considering objects by means of the understanding alonethis is known as the two-aspect view.\n\nThe notion of the \"thing in itself\" was much discussed by philosophers after Kant. It was argued that because the \"thing in itself\" was unknowable, its existence must not be assumed. Rather than arbitrarily switching to an account that was ungrounded in anything supposed to be the \"real,\" as did the German Idealists, another group arose to ask how our (presumably reliable) accounts of a coherent and rule-abiding universe were actually grounded. This new kind of philosophy became known as Phenomenology, and its founder was Edmund Husserl.\n\nWith regard to morality, Kant argued that the source of the good lies not in anything outside the human subject, either in nature or given by God, but rather is only the good will itself. A good will is one that acts from duty in accordance with the universal moral law that the autonomous human being freely gives itself. This law obliges one to treat humanityunderstood as rational agency, and represented through oneself as well as othersas an end in itself rather than (merely) as means to other ends the individual might hold. This necessitates practical self-reflection in which we universalize our reasons.\n\nThese ideas have largely framed or influenced all subsequent philosophical discussion and analysis. The specifics of Kant's account generated immediate and lasting controversy. Nevertheless, his thesesthat the mind itself necessarily makes a constitutive contribution to its knowledge, that this contribution is transcendental rather than psychological, that philosophy involves self-critical activity, that morality is rooted in human freedom, and that to act autonomously is to act according to rational moral principleshave all had a lasting effect on subsequent philosophy.\n\nTheory of perception\n\nKant defines his theory of perception in his influential 1781 work the Critique of Pure Reason, which has often been cited as the most significant volume of metaphysics and epistemology in modern philosophy. Kant maintains that our understanding of the external world had its foundations not merely in experience, but in both experience and a priori concepts, thus offering a non-empiricist critique of rationalist philosophy, which is what he and others referred to as his \"Copernican revolution\".\n\nFirstly, Kant distinguishes between analytic and synthetic propositions:\n\n# Analytic proposition: a proposition whose predicate concept is contained in its subject concept; e.g., \"All bachelors are unmarried,\" or, \"All bodies take up space.\"\n# Synthetic proposition: a proposition whose predicate concept is not contained in its subject concept; e.g., \"All bachelors are alone,\" or, \"All bodies have weight.\"\n\nAn analytic proposition is true by nature of the meaning of the words in the sentence — we require no further knowledge than a grasp of the language to understand this proposition. On the other hand, a synthetic statement is one that tells us something about the world. The truth or falsehood of synthetic statements derives from something outside their linguistic content. In this instance, weight is not a necessary predicate of the body; until we are told the heaviness of the body we do not know that it has weight. In this case, experience of the body is required before its heaviness becomes clear. Before Kant's first Critique, empiricists (cf. Hume) and rationalists (cf. Leibniz) assumed that all synthetic statements required experience to be known.\n\nKant, however, contests this: he claims that elementary mathematics, like arithmetic, is synthetic a priori, in that its statements provide new knowledge, but knowledge that is not derived from experience. This becomes part of his over-all argument for transcendental idealism. That is, he argues that the possibility of experience depends on certain necessary conditions — which he calls a priori forms — and that these conditions structure and hold true of the world of experience. In so doing, his main claims in the \"Transcendental Aesthetic\" are that mathematic judgments are synthetic a priori and in addition, that Space and Time are not derived from experience but rather are its preconditions.\n\nOnce we have grasped the functions of basic arithmetic, we do not need any empirical experience to know that 100 + 100 200, and so it appears that arithmetic is analytic. However, that it is analytic can be disproved by considering the calculation 5 + 7 \n 12: there is nothing in the numbers 5 and 7 by which the number 12 can be inferred. Thus \"5 + 7\" and \"the cube root of 1,728\" or \"12\" are not analytic because their reference is the same but their sense is not — the mathematical judgment \"5 + 7 = 12\" tells us something new about the world. It is self-evident, and undeniably a priori, but at the same time it is synthetic. Thus Kant proved that a proposition can be synthetic and known a priori.\n\nKant asserts that experience is based both on the perception of external objects and a priori knowledge.The German word Anschauung, which Kant used, literally means 'looking at' and generally means what in philosophy in English is called \"perception\". However it sometimes is rendered as \"intuition\": not, however, with the vernacular meaning of an indescribable or mystical experience or sixth sense, but rather with the meaning of the direct perception or grasping of sensory phenomena. In this article, both terms, \"perception\" and \"intuition\" are used to stand for Kant's Anschauung. The external world, he writes, provides those things that we sense. But it is our mind that processes this information and gives it order, allowing us to comprehend it. Our mind supplies the conditions of space and time to experience objects. According to the \"transcendental unity of apperception\", the concepts of the mind (Understanding) and the perceptions or intuitions that garner information from phenomena (Sensibility) are synthesized by comprehension. Without the concepts, perceptions are nondescript; without the perceptions, concepts are meaningless — thus the famous statement, \"Thoughts without content are empty, intuitions (perceptions) without concepts are blind.\"Immanuel Kant, Critique of Pure Reason [1781], trans. Norman Kemp Smith (N.Y.: St. Martins, 1965), A 51/B 75.\n\nKant also claims that an external environment is necessary for the establishment of the self. Although Kant would want to argue that there is no empirical way of observing the self, we can see the logical necessity of the self when we observe that we can have different perceptions of the external environment over time. By uniting all of these general representations into one global representation, we can see how a transcendental self emerges. \"I am therefore conscious of the identical self in regard to the manifold of the representations that are given to me in an intuition because I call them all together my representations.\"Kant, Immanuel. Critique of Pure Reason. Ed. Paul Guyer and Allen W. Wood. Cambridge: Cambridge UP, 1998. p. 248.\n\nCategories of the Faculty of Understanding\n\nKant deemed it obvious that we have some objective knowledge of the world, such as, say, Newtonian physics. But this knowledge relies on synthetic, a priori laws of nature, like causality and substance. The problem, then, is how this is possible. Kant's solution was to reason that the subject must supply laws that make experience of objects possible, and that these laws are the synthetic, a priori laws of nature that we know apply to all objects before we experience them. So, to deduce all these laws, Kant examined experience in general, dissecting in it what is supplied by the mind from what is supplied by the given intuitions. What has just been explicated is commonly called a transcendental deduction.Immanuel Kant, Prolegomena to perhaps Any Future Metaphysics, pages 35 to 43.\n\nTo begin with, Kant's distinction between the a posteriori being contingent and particular knowledge, and the a priori being universal and necessary knowledge, must be kept in mind. For if we merely connect two intuitions together in a perceiving subject, the knowledge is always subjective because it is derived a posteriori, when what is desired is for the knowledge to be objective, that is, for the two intuitions to refer to the object and hold good of it necessarily universally for anyone at any time, not just the perceiving subject in its current condition. What else is equivalent to objective knowledge besides the a priori, that is to say, universal and necessary knowledge? Nothing else, and hence before knowledge can be objective, it must be incorporated under an a priori category of the understanding.[http://www.webdeleuze.com/php/texte.php?cle\n66&groupeKant&langue\n2 Deleuze on Kant] , from where the definitions of a priori and a posteriori were obtained.\n\nFor example, say a subject says, \"The sun shines on the stone; the stone grows warm,\" which is all he perceives in perception. His judgment is contingent and holds no necessity. But if he says, \"The sunshine causes the stone to warm,\" he subsumes the perception under the category of causality, which is not found in the perception, and necessarily synthesizes the concept sunshine with the concept heat, producing a necessarily universally true judgment.\n\nTo explain the categories in more detail, they are the preconditions of the construction of objects in the mind. Indeed, to even think of the sun and stone presupposes the category of subsistence, that is, substance. For the categories synthesize the random data of the sensory manifold into intelligible objects. This means that the categories are also the most abstract things one can say of any object whatsoever, and hence one can have an a priori cognition of the totality of all objects of experience if one can list all of them. To do so, Kant formulates another transcendental deduction.\n\nJudgments are, for Kant, the preconditions of any thought. Man thinks via judgments, so all possible judgments must be listed and the perceptions connected within them put aside, so as to make it possible to examine the moments when the understanding is engaged in constructing judgments. For the categories are equivalent to these moments, in that they are concepts of intuitions in general, so far as they are determined by these moments universally and necessarily. Thus by listing all the moments, one can deduce from them all of the categories.\n\nOne may now ask: How many possible judgments are there? Kant believed that all the possible propositions within Aristotle's syllogistic logic are equivalent to all possible judgments, and that all the logical operators within the propositions are equivalent to the moments of the understanding within judgments. Thus he listed Aristotle's system in four groups of three: quantity (universal, particular, singular), quality (affirmative, negative, infinite), relation (categorical, hypothetical, disjunctive) and modality (problematic, assertoric, apodeictic). The parallelism with Kant's categories is obvious: quantity (unity, plurality, totality), quality (reality, negation, limitation), relation (substance, cause, community) and modality (possibility, existence, necessity).\n\nThe fundamental building blocks of experience, i.e. objective knowledge, are now in place. First there is the sensibility, which supplies the mind with intuitions, and then there is the understanding, which produces judgments of these intuitions and can subsume them under categories. These categories lift the intuitions up out of the subject's current state of consciousness and place them within consciousness in general, producing universally necessary knowledge. For the categories are innate in any rational being, so any intuition thought within a category in one mind is necessarily subsumed and understood identically in any mind. In other words, we filter what we see and hear.\n\nTranscendental schema doctrine\n\nKant ran into a problem with his theory that the mind plays a part in producing objective knowledge. Intuitions and categories are entirely disparate, so how can they interact? Kant's solution is the (transcendental) schema: a priori principles by which the transcendental imagination connects concepts with intuitions through time. All the principles are temporally bound, for if a concept is purely a priori, as the categories are, then they must apply for all times. Hence there are principles such as substance is that which endures through time, and the cause must always be prior to the effect.Immanuel Kant, Prolegomena to Any Future Metaphysics, pages 35 to 43.Immanuel Kant, Critique of Judgment, the Introduction to the Hackett edition.\n\nMoral philosophy\n\nKant developed his moral philosophy in three works: Groundwork of the Metaphysic of Morals (1785), Critique of Practical Reason (1788), and Metaphysics of Morals (1797).\n\nIn the Groundwork, Kant's method involves trying to convert our everyday, obvious, rationalThe distinction between rational and philosophical knowledge is given in the Preface to the Groundwork, 1785. knowledge of morality into philosophical knowledge. The latter two works followed a method of using \"practical reason\", which is based only on things about which reason can tell us, and not deriving any principles from experience, to reach conclusions which can be applied to the world of experience (in the second part of The Metaphysic of Morals).\n\nKant is known for his theory that there is a single moral obligation, which he called the \"Categorical Imperative\", and is derived from the concept of duty. Kant defines the demands of the moral law as \"categorical imperatives\". Categorical imperatives are principles that are intrinsically valid; they are good in and of themselves; they must be obeyed by everyone in all situations and circumstances, if our behavior is to observe the moral law. The Categorical Imperative provides a test against which moral statements can be assessed. Kant also stated that the moral means and ends can be applied to the categorical imperative, that rational beings can pursue certain \"ends\" using the appropriate \"means\". Ends based on physical needs or wants can create merely hypothetical imperatives. The categorical imperative can only be based on something that is an \"end in itself\", that is, an end that is not a means to some other need, desire, or purpose.Kant, Foundations, p. 421. Kant believed that the moral law is a principle of reason itself, and is not based on contingent facts about the world, such as what would make us happy, but to act on the moral law which has no other motive than \"worthiness of being happy\".Critique of Pure Reason, A806/B834. Accordingly, he believed that moral obligation applies only to rational agents.Kant, Foundations, p. 408.\n\nUnlike a hypothetical imperative, a categorical imperative is an unconditional obligation; that is, it has the force of an obligation regardless of our will or desiresKant, Foundations, pp. 420–1. In Groundwork of the Metaphysic of Morals (1785) Kant enumerated three formulations of the categorical imperative that he believed to be roughly equivalent.Kant, Foundations, p. 436. In the same book, Kant stated:\n\nAct only according to that maxim whereby you can, at the same time, will that it should become a universal law.. It is standard to also reference the Akademie Ausgabe of Kant's works. The Groundwork occurs in the fourth volume.The above citation is taken from 4:421.\n\nIn other words, according to Kant, one cannot make exceptions for oneself. The philosophical maxim on which one acts should always be considered to be a universal law without exception.  One cannot allow oneself to do a particular action unless one thinks it appropriate that the reason for the action should become a universal law. For example, one should not steal, however dire the circumstancesbecause, by permitting oneself to steal, one makes stealing a universally  acceptable act, without contradiction. This is the first formulation of the categorical imperative, often known as the universalizability principle.\n\nKant believed that, if an action is not done with the motive of duty, then it is without moral value. He thought that every action should have pure intention behind it; otherwise, it is meaningless. The final result is not the most important aspect of an action;  rather, how the person feels while carrying out the action is the time at which value is attached to the result.\n\nIn Groundwork of the Metaphysic of Morals, Kant also posited the \"counter-utilitarian idea that there is a difference between preferences and values, and that considerations of individual rights temper calculations of aggregate utility\", a concept that is an axiom in economics:Millennium Ecosystem Assessment (2003) Ecosystems and Well-being: A Framework for Assessment. Washington DC: Island Press, p. 142.\n\nEverything has either a price or a dignity. Whatever has a price can be replaced by something else as its equivalent; on the other hand, whatever is above all price, and therefore admits of no equivalent, has a dignity. But that which constitutes the condition under which alone something can be an end in itself does not have mere relative worth, i.e., price, but an intrinsic worth, i.e., a dignity. (p. 53, italics in original).\n\nA phrase quoted by Kant, which is used to summarize the counter-utilitarian nature of his moral philosophy, is Fiat justitia, pereat mundus, (\"Let justice be done, though the world perish\"), which he translates loosely as \"Let justice reign even if all the rascals in the world should perish from it\". This appears in his 1795 \"Perpetual Peace\" (\"Zum ewigen Frieden. Ein philosophischer Entwurf\"), Appendix 1.\n\nFirst formulation\n\nThe first formulation (Formula of Universal Law) of the moral imperative \"requires that the maxims be chosen as though they should hold as universal laws of nature\" . This formulation in principle has as its supreme law the creed \"Always act according to that maxim whose universality as a law you can at the same time will\" and is the \"only condition under which a will can never come into conflict with itself [....]\"Kant, Foundations, p. 437.\n\nOne interpretation of the first formulation is called the \"universalizability test\".\"Kant and the German Enlightenment\" in \"History of Ethics\". Encyclopedia of Philosophy, Vol. 3, pp. 95–96. MacMillan, 1973. An agent's maxim, according to Kant, is his \"subjective principle of human actions\": that is, what the agent believes is his reason to act.Kant, Foundations, pp. 400, 429. The universalisability test has five steps:\n\n# Find the agent's maxim (i.e., an action paired with its motivation). Take for example the declaration \"I will lie for personal benefit\". Lying is the action; the motivation is to fulfill some sort of desire. Paired together, they form the maxim.\n# Imagine a possible world in which everyone in a similar position to the real-world agent followed that maxim. With no exception of one's self. This is in order for you to hold people to the same principle required of yourself.\n# Decide whether any contradictions or irrationalities arise in the possible world as a result of following the maxim.\n# If a contradiction or irrationality arises, acting on that maxim is not allowed in the real world.\n# If there is no contradiction, then acting on that maxim is permissible, and is sometimes required.\n\n(For a modern parallel, see John Rawls' hypothetical situation, the original position.)\n\nSecond formulation\n\nThe second formulation (or Formula of the End in Itself) holds that \"the rational being, as by its nature an end and thus as an end in itself, must serve in every maxim as the condition restricting all merely relative and arbitrary ends\". The principle dictates that you \"[a]ct with reference to every rational being (whether yourself or another) so that it is an end in itself in your maxim\", meaning that the rational being is \"the basis of all maxims of action\" and \"must be treated never as a mere means but as the supreme limiting condition in the use of all means, i.e., as an end at the same time\".Kant, Foundations, pp. 437–8.\n\nThird formulation \n\nThe third formulation (i.e. Formula of Autonomy) is a synthesis of the first two and is the basis for the \"complete determination of all maxims\". It states \"that all maxims which stem from autonomous legislation ought to harmonize with a possible realm of ends as with a realm of nature\".\n\nIn principle, \"So act as if your maxims should serve at the same time as the universal law (of all rational beings)\", meaning that we should so act that we may think of ourselves as \"a member in the universal realm of ends\", legislating universal laws through our maxims (that is, a universal code of conduct), in a \"possible realm of ends\".Kant, Foundations, pp. 438–9. See also Kingdom of Ends None may elevate themselves above the universal law, therefore it is one's duty to follow the maxim(s).\n\nReligion Within the Limits of Reason\n\nKant articulates his strongest criticisms of the organization and practices of religious organizations to those that encourage what he sees as a religion of counterfeit service to God.Immanuel Kant. Religion within the Limits of Reason Alone (1793), Book IV, Part 1, Section 1, \"The Christian religion as a natural religion.\" Among the major targets of his criticism are external ritual, superstition and a hierarchical church order. He sees all of these as efforts to make oneself pleasing to God in ways other than conscientious adherence to the principle of moral rightness in choosing one's actions. The severity of Kant's criticisms on these matters, along with his rejection of the possibility of theoretical proofs for the existence of God and his philosophical re-interpretation of some basic Christian doctrines, allow interpretations that see Kant as thoroughly hostile to religion in general and Christianity in particular (e.g., Walsh 1967). Nevertheless, other interpreters consider that Kant was trying to mark off a defensible rational core of Christian belief. Kant sees in Jesus Christ the affirmation of a \"pure moral disposition of the heart\" that \"can make man well-pleasing to God\".\n\nRegarding Kant’s conception of religion, some critics have highlighted his deism, for example Peter Byrne, who wrote about Kant’s precise relationship with deism.Byrne, Peter (2007), Kant on God, London: Ashgate, page 159. Other critics have argued that Kant’s moral conception moves from deism to theism (as moral theism), for example Allen W. WoodWood, Allen W. (1970), Kant's moral religion, London and Ithaca: Cornell University Press, page 16. and Merold Westphal.Westphal, Merold (2010),The Emerge of Modern Philosophy of Religion, in Taliaferro, Charles, Draper, Paul and Quinn, Philip (editors), A Companion to Philosophy of Religion, Oxford: Blackwell, page 135. As for Kant’s book entitled Religion within the Boundaries of bare Reason, it was emphasized that Kant reduced religiosity to rationality, religion to morality and Christianity to ethics.Iţu, Mircia (2004), Dumnezeu şi religia în concepţia lui Immanuel Kant din Religia în limitele raţiunii, in Boboc, Alexandru and Mariş, N. I. (editors), Studii de istoria filosofiei universale, volume 12, Bucharest: Romanian Academy.\n\nIdea of freedom\n\nIn the Critique of Pure Reason,The Norman Kemp Smith translation has been used for this section, with citation noting the pagination of the first and second editions. Kant distinguishes between the transcendental idea of freedom, which as a psychological concept is \"mainly empirical\" and refers to \"the question whether we must admit a power of spontaneously beginning a series of successive things or states\" as a real ground of necessity in regard to causality,Kant, Critique of Pure Reason, A448/B476. and the practical concept of freedom as the independence of our will from the \"coercion\" or \"necessitation through sensuous impulses\". Kant finds it a source of difficulty that the practical idea of freedom is founded on the transcendental idea of freedom,Kant, Critique of Pure Reason, A534/B562. but for the sake of practical interests uses the practical meaning, taking \"no account of... its transcendental meaning,\" which he feels was properly \"disposed of\" in the Third Antinomy, and as an element in the question of the freedom of the will is for philosophy \"a real stumbling-block\" that has \"embarrassed speculative reason\".\n\nKant calls practical \"everything that is possible through freedom\", and the pure practical laws that are never given through sensuous conditions but are held analogously with the universal law of causality are moral laws. Reason can give us only the \"pragmatic laws of free action through the senses\", but pure practical laws given by reason a priorithe same distinction of transcendental and practical meaning can be applied to the idea of God, with the proviso that the practical concept of freedom can be experienced (Critique of Pure Reason, A801-804/B829-832). dictate \"what ought to be done\".Kant, Critique of Pure Reason, A800–2/B828–30.The concept of freedom is also handled in the third section of the Foundations of the Metaphysics of Morals. In the Critique of Practical Reason see § VII and § VIII.\n\nCategories of freedom\n\nIn the Critique of Practical Reason, at the end of the second Main Part of the Analytics,5:65–67 Kant introduces the categories of freedom, in analogy with the categories of understanding their practical counterparts. Kant's categories of freedom apparently function primarily as conditions for the possibility for actions (i) to be free, (ii) to be understood as free and (iii) to be morally evaluated. For Kant, although actions as theoretical objects are constituted by means of the theoretical categories, actions as practical objects (objects of practical use of reason, and which can be good or bad) are constituted by means of the categories of freedom. Only in this way can actions, as phenomena, be a consequence of freedom, and be understood and evaluated as such.Susanne Bobzien, 'Die Kategorien der Freiheit bei Kant', in Kant: Analysen, Probleme, Kritik Vol. 1, 1988, 193–220.\n\nAesthetic philosophy\n\nKant discusses the subjective nature of aesthetic qualities and experiences in Observations on the Feeling of the Beautiful and Sublime (1764). Kant's contribution to aesthetic theory is developed in the Critique of Judgment (1790) where he investigates the possibility and logical status of \"judgments of taste.\" In the \"Critique of Aesthetic Judgment,\" the first major division of the Critique of Judgment, Kant used the term \"aesthetic\" in a manner that, according to Kant scholar W.H. Walsh, differs from its modern sense.Critique of Judgment in \"Kant, Immanuel\" Encyclopedia of Philosophy. Vol 4. Macmillan, 1973. Prior to this, in the Critique of Pure Reason, to note essential differences between judgments of taste, moral judgments, and scientific judgments, Kant abandoned the term \"aesthetic\" as \"designating the critique of taste,\" noting that judgments of taste could never be \"directed\" by \"laws a priori\".Kant, Critique of Pure Reason, A22/B36. After A. G. Baumgarten, who wrote Aesthetica (1750–58),Beardsley, Monroe. \"History of Aesthetics\". Encyclopedia of Philosophy. Vol. 1, section on \"Toward a unified aesthetics\", p. 25, Macmillan 1973. Baumgarten coined the term \"aesthetics\" and expanded, clarified, and unified Wolffian aesthetic theory, but had left the Aesthetica unfinished (See also: Tonelli, Giorgio. \"Alexander Gottlieb Baumgarten\". Encyclopedia of Philosophy. Vol. 1, Macmillan 1973). In Bernard's translation of the Critique of Judgment he indicates in the notes that Kant's reference in § 15 in regard to the identification of perfection and beauty is probably a reference to Baumgarten. Kant was one of the first philosophers to develop and integrate aesthetic theory into a unified and comprehensive philosophical system, utilizing ideas that played an integral role throughout his philosophy.German Idealism in \"History of Aesthetics\" Encyclopedia of Philosophy. Vol 1. Macmillan, 1973.\n\nIn the chapter \"Analytic of the Beautiful\" of the Critique of Judgment, Kant states that beauty is not a property of an artwork or natural phenomenon, but is instead a consciousness of the pleasure that attends the 'free play' of the imagination and the understanding. Even though it appears that we are using reason to decide what is beautiful, the judgment is not a cognitive judgment,Kant's general discussions of the distinction between \"cognition\" and \"conscious of\" are also given in the Critique of Pure Reason (notably A320/B376), and section V and the conclusion of section VIII of his Introduction in Logic. \"and is consequently not logical, but aesthetical\" (§ 1). A pure judgement of taste is in fact subjective insofar as it refers to the emotional response of the subject and is based upon nothing but esteem for an object itself: it is a disinterested pleasure, and we feel that pure judgements of taste, i.e. judgements of beauty, lay claim to universal validity (§§20–22). It is important to note that this universal validity is not derived from a determinate concept of beauty but from common sense (§40). Kant also believed that a judgement of taste shares characteristics engaged in a moral judgement: both are disinterested, and we hold them to be universal. In the chapter \"Analytic of the Sublime\" Kant identifies the sublime as an aesthetic quality that, like beauty, is subjective, but unlike beauty refers to an indeterminate relationship between the faculties of the imagination and of reason, and shares the character of moral judgments in the use of reason. The feeling of the sublime, itself officially divided into two distinct modes (the mathematical and the dynamical sublime), describes two subjective moments, both of which concern the relationship of the faculty of the imagination to reason. Some commentators, however, argue that Kant's critical philosophy contains a third kind of the sublime, the moral sublime, which is the aesthetic response to the moral law or a representation thereof, and a development of the \"noble\" sublime in Kant's theory of 1764. The mathematical sublime is situated in the failure of the imagination to comprehend natural objects that appear boundless and formless, or appear \"absolutely great\" (§ 23–25). This imaginative failure is then recuperated through the pleasure taken in reason's assertion of the concept of infinity. In this move the faculty of reason proves itself superior to our fallible sensible self (§§ 25–26). In the dynamical sublime there is the sense of annihilation of the sensible self as the imagination tries to comprehend a vast might. This power of nature threatens us but through the resistance of reason to such sensible annihilation, the subject feels a pleasure and a sense of the human moral vocation. This appreciation of moral feeling through exposure to the sublime helps to develop moral character.\n\nKant had developed the distinction between an object of art as a material value subject to the conventions of society and the transcendental condition of the judgment of taste as a \"refined\" value in the propositions of his Idea of A Universal History (1784). In the Fourth and Fifth Theses of that work he identified all art as the \"fruits of unsociableness\" due to men's \"antagonism in society\",Kant, Immanuel. Idea for a Universal History. Trans. Lewis White Beck (20, 22). and in the Seventh Thesis asserted that while such material property is indicative of a civilized state, only the ideal of morality and the universalization of refined value through the improvement of the mind of man \"belongs to culture\".Kant, Immanuel. Idea for a Universal History. Trans. Lewis White Beck (26).\n\nPolitical philosophy\n\nIn \"Perpetual Peace: A Philosophical Sketch\",Kant, Immanuel. [http://www.mtholyoke.edu/acad/intrel/kant/kant1.htm Perpetual Peace: A Philosophical Sketch] (1795) Kant listed several conditions that he thought necessary for ending wars and creating a lasting peace. They included a world of constitutional republics.Kant, Immanuel. Perpetual Peace. Trans. Lewis White Beck (377). His classical republican theory was extended in the Science of Right, the first part of the Metaphysics of Morals (1797).Manfred Riedel Between Tradition and Revolution: The Hegelian Transformation of Political Philosophy, Cambridge 1984 Kant believed that universal history leads to the ultimate world of republican states at peace, but his theory was not pragmatic. The process was described in \"Perpetual Peace\" as natural rather than rational:\n\nKant's political thought can be summarized as republican government and international organization. \"In more characteristically Kantian terms, it is doctrine of the state based upon the law (Rechtsstaat) and of eternal peace. Indeed, in each of these formulations, both terms express the same idea: that of legal constitution or of 'peace through law'. Taken simply by itself, Kant's political philosophy, being essentially a legal doctrine, rejects by definition the opposition between moral education and the play of passions as alternate foundations for social life. The state is defined as the union of men under law. The state rightly so called is constituted by laws which are necessary a priori because they flow from the very concept of law. A regime can be judged by no other criteria nor be assigned any other functions, than those proper to the lawful order as such.\" History of Political Philosophy, edited by Leo Strauss and Joseph Cropsey, The University of Chicago Press, 1987, pp. 581–582, 603\n\nHe opposed \"democracy,\" which at his time meant direct democracy, believing that majority rule posed a threat to individual liberty. He stated, \"...democracy is, properly speaking, necessarily a despotism, because it establishes an executive power in which 'all' decide for or even against one who does not agree; that is, 'all,' who are not quite all, decide, and this is a contradiction of the general will with itself and with freedom.\"Kant, Immanuel. Perpetual Peace. Trans. Lewis White Beck (352). As with most writers at the time, he distinguished three forms of government i.e. democracy, aristocracy, and monarchy with mixed government as the most ideal form of it.\n\nAnthropology\n\nKant lectured on anthropology for over 25 years. His Anthropology from a Pragmatic Point of View was published in 1798. (This was the subject of Michel Foucault's secondary dissertation for his State doctorate, Introduction to Kant's Anthropology.) Kant's Lectures on Anthropology were published for the first time in 1997 in German.Thomas Sturm, Kant und die Wissenschaften vom Menschen (Paderborn: Mentis Verlag, 2009). The former was translated into English and published by the Cambridge Texts in the History of Philosophy series in 2006.Anthropology from a Pragmatic Point of View, ed. Robert B. Louden, introduction by Manfred Kuehn, Cambridge University Press, 2006\n\nKant was among the first people of his time to introduce anthropology as an intellectual area of study long before the field gained popularity. As a result, his texts are considered to have advanced the field. Kant's point of view also influenced the works of philosophers after him such as Martin Heidegger, Paul Ricoeur, and Jean Greisch.\n\nKant viewed anthropology in two broad categories. One category was the physiological approach which he referred to as \"what nature makes of the human being\". The other category was the pragmatic approach which explored the things a human \"can and should make of himself\".\n\nViews on homosexuality \n\n\"A second crimen carnis contra naturam is intercourse between seux hornogenii, in which the object of sexual impulse is a human being but there is homogeneity instead of heterogeneity of sex, as when a woman satisfies her desire on a woman or a man on a man. This practice too is contrary to the ends of humanity: for the end of humanity in respect of sexuality is to preserve the species without debasing the person: but in this instance the species is not being preserved.\"Lectures on Ethics, translated by L. Infield (New York: Harper & Row, 1'163), p. 170, quoted by Ruse, op. cit., p. 186. \n\nInfluence\n\nKant's influence on Western thought has been profound.Prof. Oliver A. Johnson claims that, \"With the possible exception of Plato's Republic, (Critique of Pure Reason) is the most important philosophical book ever written.\" Article on Kant within the collection \"Great thinkers of the Western World\", Ian P. McGreal, Ed., HarperCollins, 1992. Over and above his influence on specific thinkers, Kant changed the framework within which philosophical inquiry has been carried out. He accomplished a paradigm shift: very little philosophy is now carried out in the style of pre-Kantian philosophy. This shift consists in several closely related innovations that have become axiomatic, in philosophy itself and in the social sciences and humanities generally:\n* Kant's \"Copernican revolution\", that placed the role of the human subject or knower at the center of inquiry into our knowledge, such that it is impossible to philosophize about things as they are independently of us or of how they are for us;See Stephen Palmquist, \"The Architectonic Form of Kant's Copernican Logic\", Metaphilosophy 17:4 (October 1986), pp. 266–288; revised and reprinted as Chapter III of [http://www.hkbu.edu.hk/~ppp/ksp1 Kant's System of Perspectives]: An architectonic interpretation of the Critical philosophy (Lanham: University Press of America, 1993).\n* His invention of critical philosophy, that is of the notion of being able to discover and systematically explore possible inherent limits to our ability to know through philosophical reasoning;\n* His creation of the concept of \"conditions of possibility\", as in his notion of \"the conditions of possible experience\"that is that things, knowledge, and forms of consciousness rest on prior conditions that make them possible, so that, to understand or to know them, we must first understand these conditions;\n* His theory that objective experience is actively constituted or constructed by the functioning of the human mind;\n* His notion of moral autonomy as central to humanity;\n* His assertion of the principle that human beings should be treated as ends rather than as means.\n\nKant's ideas have been incorporated into a variety of schools of thought. These include German Idealism, Marxism, positivism, phenomenology, existentialism, critical theory, linguistic philosophy, structuralism, post-structuralism, and deconstructionism.\n\nHistorical influence\n\nDuring his own life, there was much critical attention paid to his thought. He had an influence on Reinhold, Fichte, Schelling, Hegel, and Novalis during the 1780s and 1790s. The school of thinking known as German Idealism developed from his writings. The German Idealists Fichte and Schelling, for example, tried to bring traditional \"metaphysically\" laden notions like \"the Absolute\", \"God\", and \"Being\" into the scope of Kant's critical thought.There is much debate in the recent scholarship about the extent to which Fichte and Schelling actually overstep the boundaries of Kant's critical philosophy, thus entering the realm of dogmatic or pre-Critical philosophy. Beiser's German Idealism discusses some of these issues. Beiser, Frederick C. German Idealism: The Struggle against Subjectivism, 1781–1801. Cambridge, MA: Harvard University Press, 2002. In so doing, the German Idealists tried to reverse Kant's view that we cannot know what we cannot observe.\n\nHegel was one of Kant's first major critics. In response to what he saw as Kant's abstract and formal account, Hegel brought about an ethic focused on the \"ethical life\" of the community.Georg Wilhelm Friedrich Hegel, Natural Law: The Scientific Ways of Treating Natural Law, Its Place in Moral Philosophy, and Its Relation to the Positive Sciences. trans. T. M. Knox. Philadelphia, PA: University of Pennsylvania Press, 1975. Hegel's mature view and his concept of \"ethical life\" is elaborated in his Philosophy of Right. Hegel, Philosophy of Right. trans. T. M. Knox. Oxford University Press, 1967. But Hegel's notion of \"ethical life\" is meant to subsume, rather than replace, Kantian ethics. And Hegel can be seen as trying to defend Kant's idea of freedom as going beyond finite \"desires\", by means of reason. Thus, in contrast to later critics like Nietzsche or Russell, Hegel shares some of Kant's most basic concerns.Robert Pippin's Hegel's Idealism (Cambridge: Cambridge University Press, 1989) emphasizes the continuity of Hegel's concerns with Kant's. Robert Wallace, Hegel's Philosophy of Reality, Freedom, and God (Cambridge: Cambridge University Press, 2005) explains how Hegel's Science of Logic defends Kant's idea of freedom as going beyond finite \"inclinations\", contra skeptics such as David Hume.\n\nKant's thinking on religion was used in Britain to challenge the decline in religious faith in the nineteenth century. British Catholic writers, notably G. K. Chesterton and Hilaire Belloc, followed this approach. Ronald Englefield debated this movement, and Kant's use of language. See Englefield's article,Englefield, Ronald, Kant as Defender of the Faith in Nineteenth-century England\", Question, 12, 16–27, (Pemberton, London) reprinted in Englefield.Englefield, Ronald, Critique of Pure Verbiage, Essays on Abuses of Language in Literary, Religious, and Philosophical Writings, edited by G. A. Wells and D. R. Oppenheimer, Open Court, 1990. Criticisms of Kant were common in the realist views of the new positivism at that time.\n\nArthur Schopenhauer was strongly influenced by Kant's transcendental idealism. He, like G. E. Schulze, Jacobi, and Fichte before him, was critical of Kant's theory of the thing in itself. Things in themselves, they argued, are neither the cause of what we observe nor are they completely beyond our access. Ever since the first Critique of Pure Reason philosophers have been critical of Kant's theory of the thing in itself. Many have argued, if such a thing exists beyond experience then one cannot posit that it affects us causally, since that would entail stretching the category 'causality' beyond the realm of experience. For a review of this problem and the relevant literature see The Thing in Itself and the Problem of Affection in the revised edition of Henry Allison's Kant's Transcendental Idealism. For Schopenhauer things in themselves do not exist outside the non-rational will. The world, as Schopenhauer would have it, is the striving and largely unconscious will. Michael Kelly, in the preface to his 1910 book Kant's Ethics and Schopenhauer's Criticism, stated: \"Of Kant it may be said that what is good and true in his philosophy would have been buried with him, were it not for Schopenhauer....\"\n\nWith the success and wide influence of Hegel's writings, Kant's influence began to wane, though there was in Germany a movement that hailed a return to Kant in the 1860s, beginning with the publication of Kant und die Epigonen in 1865 by Otto Liebmann. His motto was \"Back to Kant\", and a re-examination of his ideas began (See Neo-Kantianism). During the turn of the 20th century there was an important revival of Kant's theoretical philosophy, known as the Marburg School, represented in the work of Hermann Cohen, Paul Natorp, Ernst Cassirer,Beck, Lewis White. \"Neo-Kantianism\". In Encyclopedia of Philosophy. Vol. 5–6. Macmillan, 1973. Article on Neo-Kantianism by a translator and scholar of Kant. and anti-Neo-Kantian Nicolai Hartmann.Cerf, Walter. \"Nicolai Hartmann\". In Encyclopedia of Philosophy. Vol. 3–4. Macmillan, 1973. Nicolai was a realist who later rejected the idealism of Neo-Kantianism, his anti-Neo-Kantian views emerging with the publication of the second volume of Hegel (1929).\n\nKant's notion of \"Critique\" has been quite influential. The Early German Romantics, especially Friedrich Schlegel in his \"Athenaeum Fragments\", used Kant's self-reflexive conception of criticism in their Romantic theory of poetry.Schlegel, Friedrich. \"Athenaeum Fragments\", in Philosophical Fragments. Trans. Peter Firchow. Minneapolis, MN: University of Minnesota Press, 1991. See especially fragments Nos. 1, 43, 44. Also in Aesthetics, Clement Greenberg, in his classic essay \"Modernist Painting\", uses Kantian criticism, what Greenberg refers to as \"immanent criticism\", to justify the aims of Abstract painting, a movement Greenberg saw as aware of the key limitiaton—flatness—that makes up the medium of painting.Greenberg, Clement. \"Modernist Painting\", in The Philosophy of Art, ed. Alex Neill and Aaron Ridley, McGraw-Hill, 1995. French philosopher Michel Foucault was also greatly influenced by Kant's notion of \"Critique\" and wrote several pieces on Kant for a re-thinking of the Enlightenment as a form of \"critical thought\". He went so far as to classify his own philosophy as a \"critical history of modernity, rooted in Kant\".See \"Essential Works of Foucault: 1954–1984 vol.2: Aesthetics, Method, and Epistemology.\" Ed. by James Faubion, Trans. Robert Hurley et al. New York City, New York: The New Press, 1998 (2010 reprint). See \"Foucault, Michel, 1926 –\" entry by Maurice Florence.\n\nKant believed that mathematical truths were forms of synthetic a priori knowledge, which means they are necessary and universal, yet known through intuition.For a discussion and qualified defense of this position, see Stephen Palmquist, \"A Priori Knowledge in Perspective: (I) Mathematics, Method and Pure Intuition\", The Review of Metaphysics 41:1 (September 1987), pp. 3–22. Kant's often brief remarks about mathematics influenced the mathematical school known as intuitionism, a movement in philosophy of mathematics opposed to Hilbert's formalism, and the logicism of Frege and Bertrand Russell.Körner, Stephan, The Philosophy of Mathematics, Dover, 1986. For an analysis of Kant's writings on mathematics see, Friedman, Michael, Kant and the Exact Sciences, Cambridge, MA: Harvard University Press, 1992.\n\nInfluence on modern thinkers\n\nWith his \"Perpetual Peace: A Philosophical Sketch\", Kant is considered to have foreshadowed many of the ideas that have come to form the democratic peace theory, one of the main controversies in political science.Ray, James Lee. [http://www.mtholyoke.edu/acad/intrel/ray.htm Does Democracy Cause Peace?]  Annual Review of Political Science 1998. 1:27–46.\n\nProminent recent Kantians include the British philosophers P. F. StrawsonStrawson, P. F., The Bounds of Sense: An Essay on Kant's Critique of Pure Reason. Routledge: 2004. When first published in 1966, this book forced many Anglo-American philosophers to reconsider Kant's Critique of Pure Reason. and Quassim CassamCassam, Q., \"The Possibility of Knowledge\" Oxford: 2009 and the American philosophers Wilfrid SellarsSellars, Wilfrid, Science and Metaphysics: Variations on Kantian Themes. Ridgeview Publishing Company, 1967 and Christine Korsgaard.Korsgaard, Christine. Creating the Kingdom of Ends. Cambridge; New York, NY, US: Cambridge University Press, 1996. ,  (pbk.) Not a commentary, but a defense of a broadly Kantian approach to ethics Due to the influence of Strawson and Sellars, among others, there has been a renewed interest in Kant's view of the mind. Central to many debates in philosophy of psychology and cognitive science is Kant's conception of the unity of consciousness.Brook, Andrew. Kant and the Mind. Cambridge: Cambridge University Press, 1994. See also, Meerbote, R. \"Kant's Functionalism\". In: J. C. Smith, ed. Historical Foundations of Cognitive Science. Dordrecht, Holland: Reidel, 1991. Brook has an article on Kant's View of the Mind in the [http://plato.stanford.edu/entries/kant-mind/ Stanford Encyclopedia]\n\nJürgen Habermas and John Rawls are two significant political and moral philosophers whose work is strongly influenced by Kant's moral philosophy.See Habermas, J. Moral Consciousness and Communicative Action. Trans. Christian Lenhardt and Shierry Weber Nicholsen. Cambridge, MA: MIT Press, 1996. For Rawls see, Rawls, John. Theory of Justice Cambridge, MA: Harvard University Press, 1971. Rawls has a well-known essay on Kant's concept of good. See, Rawls, \"Themes in Kant's Moral Philosophy\" in Kant's Transcendental Deductions. Ed. Eckart Förster. Stanford, CA: Stanford University Press, 1989. They have each argued against relativism,Habermas, J. (1994): The Unity of Reason in the Diversity of Its Voices. In: Habermas, J. (Eds.): Postmetaphysical Thinking. Political Essays, Cambridge, Massachusetts: 115–148. supporting the Kantian view that universality is essential to any viable moral philosophy. Jean-Francois Lyotard, however, has emphasized the indeterminacy in the nature of thought and language and has engaged in debates with Habermas based on the effects this indeterminacy has on philosophical and political debates.Rorty, R. (2984) Habermas and Lyotard on postmodernity. Praxis International (32-44)\n\nKant's influence also has extended to the social, behavioral, and physical sciences, as in the sociology of Max Weber, the psychology of Jean Piaget, and the linguistics of Noam Chomsky. Kant's work on mathematics and synthetic a priori knowledge is also cited by theoretical physicist Albert Einstein as an early influence on his intellectual development.Issacson, Walter. \"Einstein: His Life and Universe.\" p. 20. Because of the thoroughness of the Kantian paradigm shift, his influence extends to thinkers who neither specifically refer to his work nor use his terminology.\n\nPersonal legacy\n\nKant always cut a curious figure in his lifetime for his modest, rigorously scheduled habits, which have been referred to as clocklike. But Heinrich Heine noted the magnitude of \"his destructive, world-crushing thoughts\" and considered him a sort of philosophical \"executioner\", comparing him to Robespierre with the observation that both men \"represented in the highest the type of provincial bourgeois. Nature had destined them to weigh coffee and sugar, but Fate determined that they should weigh other things and placed on the scales of the one a king, on the scales of the other a god.\"\n\nWhen he was exhumed for his body's transfer to a new burial spot, his skull was measured amidst his exhumation ceremony, and found to be larger than the average German male's with a \"high and broad\" forehead.Examined Lives, From Socrates to Nietzsche, James Miller p.284 His forehead has been an object of interest ever since it became well-known through his portraits: “In Döbler’s portrait and in Kiefer’s faithful if expressionistic reproduction of it — as well as in many of the other late eighteenth- and early nineteenth-century portraits of Kant — the forehead is remarkably large and decidedly retreating. Was Kant’s forehead shaped this way in these images because he was a philosopher, or, to follow the implications of Lavater’s system, was he a philosopher because of the intellectual acuity manifested by his forehead? Kant and Lavater were correspondents on theological matters, and Lavater cites Kant in the Physiognomy.”Immanuel Kant and the Bo(a)rders of Art History Mark Cheetham, in The Subjects of Art History: Historical Objects in Contemporary Perspectives, p. 16\n\nTomb and statue\n\nKant's tomb is today in a mausoleum adjoining the northeast corner of Königsberg Cathedral in what is now known as Kaliningrad, Russia. The mausoleum was constructed by the architect Friedrich Lahrs and was finished in 1924 in time for the bicentenary of Kant's birth. Originally, Kant was buried inside the cathedral, but in 1880 his remains were moved outside and placed in a neo-Gothic chapel adjoining the northeast corner of the cathedral. Over the years, the chapel became dilapidated before it was demolished to make way for the mausoleum, which was built on the same spot, where it is today.\n\nThe tomb and its mausoleum are among the few artifacts of German times preserved by the Soviets after they conquered and annexed the city. Today, many newlyweds bring flowers to the mausoleum.\n\nArtifacts previously owned by Kant, known as Kantiana, were included in the Königsberg City Museum. However, the museum was destroyed during World War II.\n\nA replica of the statue of Kant that stood in German times in front of the main University of Königsberg building was donated by a German entity in the early 1990s and placed in the same grounds.\n\nAfter the expulsion of Königsberg's German population at the end of World War II, the University of Königsberg where Kant taught was replaced by the Russian-language Kaliningrad State University, which took up the campus and surviving buildings of the historic German university. In 2005, the university was renamed Immanuel Kant State University of Russia. The change of name was announced at a ceremony attended by President Vladimir Putin of Russia and Chancellor Gerhard Schröder of Germany, and the university formed a Kant Society, dedicated to the study of Kantianism.\n\nBibliography\n\nList of major works\n\n* (1749) Thoughts on the True Estimation of Living Forces (Gedanken von der wahren Schätzung der lebendigen Kräfte)\n* (March 1755) Universal Natural History and Theory of Heaven (Allgemeine Naturgeschichte und Theorie des Himmels)\n* (Apr. 1755) Brief Outline of Certain Meditations on Fire (Meditationum quarundam de igne succinta delineatio (master's thesis under Johann Gottfried Teske))The thesis was submitted on 17 April 1755. \"The public examination was held four weeks later on 13 May, and the degree was formally awarded on 12 June\" (Eric Watkins, Kant: Natural Science, Cambridge University Press, 2012, p. 309).Eric Watkins (ed.), Kant and the Sciences, Oxford University Press, 2001, p. 27.Martin Schonfeld, The Philosophy of the Young Kant: The Precritical Project, Oxford University Press, 2000, p. 74.Available [https://korpora.zim.uni-duisburg-essen.de/kant/aa01/369.html online at Bonner Kant-Korpus].\n* (Sep. 1755) A New Elucidation of the First Principles of Metaphysical Cognition (Principiorum primorum cognitionis metaphysicae nova dilucidatio (doctoral thesis))The thesis was publicly disputed on 27 September 1755 (Kuehn 2001, p. 100).Available [https://korpora.zim.uni-duisburg-essen.de/kant/aa01/385.html online at Bonner Kant-Korpus].\n* (1756) The Use in Natural Philosophy of Metaphysics Combined with Geometry, Part I: Physical Monadology (Metaphysicae cum geometrica iunctae usus in philosophin naturali, cuius specimen I. continet monadologiam physicam, abbreviated as Monadologia Physica (thesis as a prerequisite of associate professorship))Kant's application for the position was unsuccessful. He defended it on 10 April 1756 (Kuehn 2001, p. 102).\n* (1762) The False Subtlety of the Four Syllogistic Figures (Die falsche Spitzfindigkeit der vier syllogistischen Figuren)\n* (1763) The Only Possible Argument in Support of a Demonstration of the Existence of God (Der einzig mögliche Beweisgrund zu einer Demonstration des Daseins Gottes)\n* (1763) Attempt to Introduce the Concept of Negative Magnitudes into Philosophy (Versuch den Begriff der negativen Größen in die Weltweisheit einzuführen)\n* (1764) Observations on the Feeling of the Beautiful and Sublime (Beobachtungen über das Gefühl des Schönen und Erhabenen)\n* (1764) Essay on the Illness of the Head (Über die Krankheit des Kopfes)\n* (1764) Inquiry Concerning the Distinctness of the Principles of Natural Theology and Morality (the Prize Essay) (Untersuchungen über die Deutlichkeit der Grundsätze der natürlichen Theologie und der Moral)\n* (1766) Dreams of a Spirit-Seer (Träume eines Geistersehers)Available [https://archive.org/details/dreamsofspiritse00kant online at Archive.org].\n* (1770) Dissertation on the Form and Principles of the Sensible and the Intelligible World (De mundi sensibilis atque intelligibilis forma et principiis (doctoral thesis))The thesis was publicly disputed on 21 August 1770 (Kuehn 2001, p. 189).Available [https://books.google.com/books?iddNRKAQAAMAAJ&pg\nPA123&redir_escy#v\nonepage&q&ffalse online at Google Books].English translation available online at Wikisource.\n* (1775) On the Different Races of Man (Über die verschiedenen Rassen der Menschen)\n* (1781) First edition of the Critique of Pure Reason (Kritik der reinen Vernunft)\n* (1783) Prolegomena to any Future Metaphysicshttp://eserver.org/philosophy/kant-prolegomena.txt (Prolegomena zu einer jeden künftigen Metaphysik)\n* (1784) \"An Answer to the Question: What Is Enlightenment?\" (\"Beantwortung der Frage: Was ist Aufklärung?\")\n* (1784) \"Idea for a Universal History with a Cosmopolitan Purpose\" (\"Idee zu einer allgemeinen Geschichte in weltbürgerlicher Absicht\")\n* (1785) Groundwork of the Metaphysics of Morals (Grundlegung zur Metaphysik der Sitten)\n* (1786) Metaphysical Foundations of Natural Science (Metaphysische Anfangsgründe der Naturwissenschaft)\n* (1786) \"[https://archive.org/details/KantOrientFerrerMarch2014 What does it mean to orient oneself in thinking?]\" (\"Was heißt: sich im Denken orientieren?\")\n* (1786) Conjectural Beginning of Human History\n* (1787) Second edition of the Critique of Pure Reason (Kritik der reinen Vernunft)\n* (1788) Critique of Practical Reasonhttp://eserver.org/philosophy/kant/critique-of-practical-reaso.txt (Kritik der praktischen Vernunft)\n* (1790) Critique of Judgment (Kritik der Urteilskraft) \n* (1793) Religion within the Limits of Reason Alone (Die Religion innerhalb der Grenzen der bloßen Vernunft)\n* (1793) On the Old Saw: That may be right in theory, but it won't work in practice (Über den Gemeinspruch: Das mag in der Theorie richtig sein, taugt aber nicht für die Praxis)\n* (1795) \"Perpetual Peace\" (\"Zum ewigen Frieden\")\n* (1797) Metaphysics of Morals (Metaphysik der Sitten). First part is The Doctrine of Right, which has often been published separately as The Science of Right.\n* (1798) Anthropology from a Pragmatic Point of View (Anthropologie in pragmatischer Hinsicht)\n* (1798) The Contest of Faculties (Der Streit der Fakultäten)\n* (1800) Logic (Logik)\n* (1803) On Pedagogy (Über Pädagogik)Available [http://www.deutschestextarchiv.de/book/show/kant_paedagogik_1803 online at DeutschesTextArchiv.de].\n* (1804) Opus Postumum\n* (1817) Lectures on Philosophical Theology (Immanuel Kants Vorlesungen über die philosophische Religionslehre edited by K. H. L. Pölitz) [The English edition of A. W. Wood & G. M. Clark (Cornell, 1978) is based on Pölitz' second edition, 1830, of these lectures.]As noted by Allen W. Wood in his Introduction, p. 12. Wood further speculates that the lectures themselves were delivered in the Winter of 1783–84.\n\nCollected works in German\n\nWilhelm Dilthey inaugurated the Academy edition (the Akademie-Ausgabe abbreviated as AA or Ak) of Kant's writings (Gesammelte Schriften, Königlich-Preußische Akademie der Wissenschaften, Berlin, 1902–38) in 1895,Immanuel Kant, Notes and Fragments, Cambridge University Press, 2005, p. xvi. and served as its first editor. The volumes are grouped into four sections:\n* I. Kant's published writings (vols. 1–9),\n* II. Kant's correspondence (vols. 10–13),\n* III. Kant's literary remains, or Nachlass (vols. 14–23), and\n* IV. Student notes from Kant’s lectures (vols. 24–29). Immanuel Kant. http://en.wikipedia.org/?curid=14631."
  }
}
