{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13027",
  "eid" : "062626a0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778519562,
  "textBody" : "Jinn (, '), also romanized as djinn or anglicized as genies (with the more broad meaning of spirits or demons)Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 22 (German) are supernatural creatures in early Arabian and later Islamic mythology and theology. They are not purely spiritual, but also physical in nature, being able to interact in a tactile manner with people and objects and also subject to bodily desires like eating and sleeping. Jinn mentioned in Middle Eastern folktales are often depicted as monstrous or magical creatures, though jinn figments from such stories are generally considered to be fictional.Robert Lebling Legends of the Fire Spirits: Jinn and Genies from Arabia to Zanzibar I.B.Tauris 2010 \n\nEtymology\n\nJinn is an Arabic collective noun deriving from the Semitic root  (, jann), whose primary meaning is \"to hide\" or \"to conceal\". Some authors interpret the word to mean, literally, \"beings that are concealed from the senses\".. p. 462. Cognates include the Arabic ' (\"possessed\", or generally \"insane\"), ' (\"garden\"), and ' (\"embryo\"). Jinn is properly treated as a plural, with the singular being jinni.\n\nThe origin of the word Jinn remains uncertain.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 22 (German)\nSome scholars relate the Arabic term jinn to the Latin genius, as a result of syncretism during the reign of the Roman empire under Tiberius Augustus,Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 38 but this derivation is also disputed.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 25 (German) Another suggestion holds, that jinn may derived from Aramaic \"ginnaya\" () with the meaning of Tutelary deity Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 24 (German) or also ‘garden’. Others claim a Persian origin of the word, for in the form of the Avestic \"Jaini\", a wicked (female) spirit.  Jaini were among various creatures in the possibly even pre-Zoroastrian mythology of peoples of Iran.Tisdall, W. St. Clair. The Original Sources of the Qur'an, Society for Promoting Christian Knowledge, London, 1905The Religion of the Crescent or Islam: Its Strength, Its Weakness, Its Origin, Its Influence, William St. Clair Tisdall, 1895\n\nThe anglicized form genie is a borrowing of the French ', from the Latin genius, a guardian spirit of people and places in Roman religion. It first appearedOxford English Dictionary, 3rd ed. \"genie, n.\" Oxford University Press (Oxford), 2014. in 18th-century translations of the Thousand and One Nights from the French,. where it had been used owing to its rough similarity in sound and sense.\n\nPre-Islamic  Arabia \n\nJinn were worshipped by Arabs during the Pre-Islamic period. But unlike gods, jinn were not depicted as immortals, rather assisting humans in regard of their worships. According to a common belief, soothsayers and poets got their inspirations from the jinn.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 34 However jinn were also feared and thought to be responsible for various diseases and mental illnesses.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 122 Julius Wellhausen has observed that such spirits were thought to inhabit desolate, dingy, and dark places and that they were feared. One had to protect oneself from them, but they were not the objects of a true cult. In ancient Arabia, the term jinn also applied to all kinds of supernatural entities among various religions and cults, thus angels and demons among Zoroastrianism, Christianity and Judaism were also called jinn.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 34\n\nIslamic theology\n\nIn the Islamic sense, jinn is used in two different ways:\n\n* As the opposite of al-Ins (something in shape) referring to any object concealed from humans sensory organs, including angels, demons and the interior of humn. Thus every demon and every angel is also a jinn, but not every jinn is an angel or a demon.Scott B. Noegel, Brannon M. Wheeler The A to Z of Prophets in Islam and Judaism Scarecrow Press 2010  page 170University of Michigan Muhammad Asad: Europe's Gift to Islam, Band 1 Truth Society 2006  page 387Richard Gauvain Salafi Ritual Purity: In the Presence of God Routledge 2013  page 302\n\n*An invisible entity, created by God out of a \"mixture of fire\" or \"smokeless fire\", who roamed the earth before Adam. These entities are believed to resemble human in regards of the need of eating and drinking, procreation and dying, being subject to judgment and will either condemned to heaven or hell according to their deeds.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 18 But they were much faster and stronger than humans.\n\nIn Islamic tradition, Muhammad was sent as a prophet to both human and jinn communities, and that prophets and messengers were sent to both communities.Muḥammad ibn Ayyūb al-Ṭabarī, Tuḥfat al-gharā’ib, I, p. 68; Abū al-Futūḥ Rāzī, Tafsīr-e rawḥ al-jenān va rūḥ al-janān, pp. 193, 341 Traditionally Surah 72 is held to tell about the revelation to jinn and several stories mention one of Muhammads followers accompanied him, witnessing the revelation to the jinn.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 64\n\nAnother Islamic prophet, who is related to interactions with jinn, is Solomon. In Quran, he is said to be a king in ancient Israel and was gifted by God to talk to animals and jinn. God granted him authory over the rebellious jinn and the demons, thus Solomon forced them to build the First Temple. Beliefs regarding Solomon and his power over the jinn were later extended in folklore and folktales. \n\nRelated to common traditions, the angels were created on Wednesday, the jinn on Thursday and humans on Friday, but not the very next day, rather more than 1000 years later. Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 43 (German) The community of the jinn race were like these of humans, but then corruption and injustice among them increased and all warnings sent by God were ignored. Consequentially, God sent his angels to battle the infidel jinn. Just a few survived, and were oust to far islands or to the mountains. With the revelation of Islam, the jinn were given a new chance to access salvation.Patrick Hughes, Thomas Patrick Hughes Dictionary of Islam Asian Educational Services 1995 page 134 Gabriel Said Reynolds The Qur'an and Its Biblical Subtext Routledge 2010  page 41\n\nDevelopment of Islamic Jinn belief\n\nIn the beginning of Islam\n\nIn early Islamic development, the status of jinn were reduced from that of deityChristopher R. Fee, Jeffrey B. Webb American Myths, Legends, and Tall Tales: An Encyclopedia of American Folklore [3 volumes]: An Encyclopedia of American Folklore (3 Volumes) ABC-CLIO 2016  page 527 to minor spirits. To assert a strictly monotheism and the Islamic concept on Tauhid all affinities between the jinn and God were denied, thus Jinn were placed parallel to human, also subject to Gods judgment and may attain paradise or hell. However, even their status as tutelary deities was reduced, they were not consequently regarded as demons.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 52 In later revelations, the concept of demons and angels distinct from the pagan jinn were made.Jacques Waardenburg Islam: Historical, Social, and Political Perspectives Walter de Gruyter 2008  page 40 T. Fahd stated, the jinn were related to the pagan belief, while the demons and angels were borrowed from monotheistic concepts of angels and demons. In later revealations the demons and the jinn seems to be used interchangeable, here placing the jinn with the devil diametral, against  the angels and Muhammad.\n\nJinn belief in the later centuries\n\nWhen Islam spread outside of Arabia, belief in the Jinn was assimilated with local belief about spirits and deities from Iran, Africa, Turkey and India.Juan Eduardo Campo Encyclopedia of Islam Infobase Publishing  2009  page 402 Persians, for example, identified the Jinn in the Quran with the Daeva from Zoroastrian lore.Patrick Hughes, Thomas Patrick Hughes Dictionary of Islam Asian Educational Services 1995  page 134 Developed from various traditions and local folklore, but not mentioned in canonical Islamic scriptures, Jinn were thought to be able to possess humans; Morocco especially has many possession traditions, including exorcism rituals.Joseph P. Laycock Spirit Possession around the World: Possession, Communion, and Demon Expulsion across Cultures: Possession, Communion, and Demon Expulsion across Cultures ABC-CLIO 2015  page 243 In Sindh the concept of the Jinni was introduced during the Abbasid Era and has become a common part of local folklore, also including stories of both male jinn called \"Jinn\" and female Jinn called \"Jiniri\". Folk stories of female Jinn include stories such as the Jejhal Jiniri. Although, due to the cultural influence, the concept of jinn may vary over different concepts, all share some common features. The Jinn are believed to live in societies resembling these of humans, practicing religion (including Islam, Christianity and Judaism), having emotions, needing to eat and drink, and can procreate and raise families. Additionally, they fear iron, generally appear in desolate or abandoned places, and are stronger and faster than humans.Hughes, Thomas Patrick. Dictionary of Islam. 1885. \"Genii\" p.136  Generally, Jinn are thought to eat bones and prefer rotten flesh over fresh flesh.Abu’l-Fotūḥ, XVII, pp. 280–281\n\nThe composition and existence of Jinn is the subject of various debates during the Middle Ages. According to Ashari, the existence of Jinn can not be proven, because arguments concerning the existence of jinn are beyond human comprehension. Adepts of Ashʿari theology, explained Jinn are invisible to humans because they lack the appropriate sense organs to envision them.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 22 Critics argued, if Jinn exist, their bodies must either be ethereal or made of solid material; if they were composed of the former, they would not able to do hard work, like carrying heavy stones. If they were composed of the latter, they would be visible to any human with functional eyes.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p.33 (German) Critics therefore refused to believe in a literal reading on Jinn in Islamic sacred texts, preferring to view them as \"unruly men\".Hughes, Thomas Patrick. Dictionary of Islam. 1885. \"Genii\" p.134 On the other hand, advocates of belief in Jinn assert that God's creation can exceed the human mind; thus, Jinn are beyond human understanding. Since they are mentioned in Islamic texts, scholars such as Ibn Taimiyya and Ibn Hazm prohibit the denial of Jinn. They also refer to spirits and demons among the Christians, Zoroastrians and Jews to \"prove\" their existence.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p.33 (German) Ibn Taymiyya believed the Jinn to be generally \"ignorant, untruthful, oppressive and treacherous\". He held that the Jinn account for much of the \"magic\" that is perceived by humans, cooperating with magicians to lift items in the air, delivering hidden truths to fortune tellers, and mimicking the voices of deceased humans during seances.Ibn Taymiyyah, al-Furqān bayna awliyā’ al-Raḥmān wa-awliyā’ al-Shayṭān (\"Essay on the Jinn\"), translated by Abu Ameenah Bilal Phillips\n\nOther critics, such as Jahiz and Mas'udi, stated that sightings of Jinn are due to psychological causes. According to Mas'udi, the Jinn as described by traditional scholars, are not a priori false, but improbable. Jahiz states in his work Kitab al-Hayawan that loneliness induces humans to mind-games and wishful thinking, causing waswās (whisperings in the mind, traditionally thought to be caused by Satan). If he is afraid, he may see things that are not real. These alleged appearances are told to other generations in bedtime stories and poems, and with children of the next generation growing up with such stories, when they are afraid or lonely, they remember these stories, encouraging their imaginations and causing another alleged sighting of Jinn.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p.37 (German)\n\nLater Sufi traditions related the meaning of Jinn back to its origin \"something that is concealed from sights\", thus they were related to the hidden realm, including angels from the heavenly realm and the Jinn from an sublunary realm. Ibn Arabi stated: \"Only this much is different-the spirits of the Jinn are lower spirits, while the spirits of angels are heavenly spirits.\"http://www.ibnarabisociety.org/articles/futuhat_ch009.html The jinn share, due to their intermediary abode both angelic and human traits. According to some Sufi teachings, a jinn is like an empty cup, composed of its own ego and intention, and a reflection of its observer.H.J. Witteveen The Heart of Sufism: Essential Writings of Hazrat Inayat Khan Shambhala Publications 1999  Because Jinn are closer to the material realm, it would be easier for human to contact a Jinn, than an angel.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 50\n\nIn folk literature \n\nJinn can be found in the One Thousand and One Nights story of \"The Fisherman and the Jinni\";[http://classiclit.about.com/library/bl-etexts/arabian/bl-arabian-jinni.htm The fisherman and the Jinni] at About.com Classic Literature more than three different types of jinn are described in the story of Ma‘ruf the Cobbler;[http://www.idriesshahfoundation.org/books/tales-of-the-dervishes/ Idries Shah - Tales of the Dervishes] at ISF website two jinn help young Aladdin in the story of Aladdin and the Wonderful Lamp;[http://classiclit.about.com/library/bl-etexts/arabian/bl-arabian-alladin.htm The Arabian Nights - ALADDIN; OR, THE WONDERFUL LAMP] at About.com Classic Literature as Ḥasan Badr al-Dīn weeps over the grave of his father until sleep overcomes him, and he is awoken by a large group of sympathetic jinn in the Tale of ‘Alī Nūr al-Dīn and his son Badr ad-Dīn Ḥasan.[http://classiclit.about.com/library/bl-etexts/arabian/bl-arabian-nuraldin.htm The Arabian Nights - TALE OF NUR AL-DIN ALI AND HIS SON BADR AL-DIN HASAN] at About.com Classic Literature In some stories, jinn are credited with the ability of instantaneous travel (from China to Morocco in a single instant); in others, they need to fly from one place to another, though quite fast (from Baghdad to Cairo in a few hours).\n\nModern interpretations\n\nAlthought affirmation on the existence of jinn as sapient creatures living along with human is still widespread in Middle Eastern world, modernist commentators, on the basis of the word's meaning, refer jinn to microorganisms such as bacteria and viruses or rather to undetectable uncivilized persons.Simon Ross Valentine Islam and the Ahmadiyya Jama'at: History, Belief, Practice Hurst Publishers 2008  page 143U. A. B. Razia Akter Banu Islam in Bangladesh BRILL 1992  page 57 Another interpretation holds, they live in paralleldimensions consisting on rays.\n\nIn science \n\nSleep paralysis is conceptualized as a \"Jinn attack\" by many sleep paralysis sufferers in Egypt as discovered by Cambridge neuroscientist Baland Jalal. A scientific study found that as many as 48 percent of those who experience sleep paralysis in Egypt believe it to be an assault by the Jinn. Almost all of these sleep paralysis sufferers (95%) would recite verses from the Quran during sleep paralysis to prevent future \"Jinn attacks\". In addition, some (9%) would increase their daily Islamic prayer (salah) to get rid of these attacks by Jinn. Sleep paralysis is generally associated with great fear in Egypt, especially if believed to be supernatural in origin.\n\nDepictions of Jinn\n \nGenerally jinn lack individuality and are thought to appear in mists or sandstorms.Hughes, Thomas Patrick. Dictionary of Islam. 1885. \"Genii\" p.136 Zubayr ibn al-Awam, who is held to have accompanied Muhammad during his lecture to the jinn, is said to view the jinn as shadowy ghosts with no individual structure.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 64 But jinn are thought to be able to materialize in different forms and therefore may gain individuality, like Sakhr.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 153 (German) They can shape into both animals and human. Especially black dogs, onagers and serpents are thought to be common temporarily embodiments of jinn. Except for the udhrut from Yemeni folklore, jinn could not transform in wolves, because they were the foes of jinn, disabling the jinn to vanish.  name=\"ReferenceA\">Robert Lebling Legends of the Fire Spirits: Jinn and Genies from Arabia to Zanzibar Legends of the Fire Spirits: Jinn and Genies from Arabia to Zanzibar 2010  page 98 Associations between dogs and jinn prevailed in Arabic-literature, but lost its meaning in Persian scriptures.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 134 (German) Commonly associated with jinn in humanform are the Si'lah and the Ghoul. However they stay partly animalic, their bodies are depicted as fashioned out of two or more different species.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 164  Therefore, individual jinn are commonly depicted as  monstrous and anthropomorphized creatures with body parts from different animals or human with animalic traits.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 164 (German)\n\nJinn in witchcraft and magical literature\n\nIbn al-Nadim, in his Kitāb al-Fihrist, describes a book that lists 70 Jinn led by Fuqtus, including several Jinn appointed over each day of the week.Bayard Dodge, ed. and trans. The Fihrist of al-Nadim: A Tenth-Century Survey of Muslim Culture. New York: Columbia University Press, 1970. pp. 727-8.Robert Lebling. Legends of the Fire Spirits: Jinn and Genies from Arabia to Zanzibar. I.B. Taurus, 2010. p.38 Bayard Dodge, who translated al-Fihrist into English, notes that most of these names appear in the Testament of Solomon. A collection of late fourteenth- or early fifteenth-century magico-medical manuscripts from Ocaña, Spain describes a different set of 72 Jinn (termed \"Tayaliq\") again under Fuqtus (here named \"Fayqayțūš\" or Fiqitush), blaming them for various ailments.Celia del Moral. Magia y Superstitión en los Manuscritos de Ocaña (Toledo). Siglos XIV-XV. Proceedings of the 20th Congress of the Union Européenne des Arabisants et Islamisants, Part Two; A. Fodor, ed.  Budapest, 10–17 September 2000. pp.109-121Joaquina Albarracin Navarro & Juan Martinez Ruiz. Medicina, Farmacopea y Magia en el \"Misceláneo de Salomón\".  Universidad de Granada, 1987. p.38 et passim According to these manuscripts each Jinn was brought before King Solomon and ordered to divulge their \"corruption\" and \"residence\" while the Jinn King Fiqitush gave Solomon a recipe for curing the ailments associated with each Jinn as they confessed their transgressions.\n\nSeven kings of the Jinn are traditionally associated with days of the week.\n* Sunday: Al-Mudhib (Abu 'Abdallah Sa'id)\n* Monday: Murrah al-Abyad Abu al-Harith (Abu al-Nur)\n* Tuesday: Abu Mihriz (or Abu Ya'qub) Al-Ahmar\n* Wednesday: Barqan Abu al-'Adja'yb\n* Thursday: Shamhurish (al-Tayyar)\n* Friday: Abu Hasan Zoba'ah (al-Abyad)\n* Saturday: Abu Nuh Maimun\n\nDuring the Rwandan genocide, both Hutus and Tutsis avoided searching local Rwandan Muslim neighborhoods because they widely believed the myth that local Muslims and mosques were protected by the power of Islamic magic and the efficacious jinn. In Cyangugu, arsonists ran away instead of destroying the mosque because they believed that jinn were guarding the mosque and they feared their wrath.\n\nComparative mythology\n\nJudaism\n\nShedim, one of several supernatural creatures in early Jewish mythology resemble the Islamic concept of Jinn. Both are said to be invisible to human eye but are subject to bodily desires, like procreating and the need to eat and both may be malevolent or benevolent. Like the Islamic notion of jinn as Pre-Adamites, Jewish lore also regard shedim as Pre-Adamites, replaced by human being in some legends.Carol K. Mack, Dinah Mack A Field Guide to Demons, Vampires, Fallen Angels and Other Subversive Spirits Skyhorse Publishing 2013  Narrations regarding Asmodeus, an antagonist in Solomon legends, appears both in Islamic lore and in Talmud as the king either of the jinn or the shedim.\n\nBuddhism\n\nSimilar to the Islamic idea of spiritual entities converting to One's religion can be found on Buddhism lore. Accordingly, Buddha preached among humans and Deva, spiritual entities who are like humans subject to the cycle of life.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 165Marie Musæus-Higgins Poya Days Asian Educational Services 1925  page 14\n\nIn the Guanche mythology \n\nIn Guanche mythology from Tenerife in the Canary Islands, there existed the belief in beings that were similar to genies, (Spanish) such as the maxios or dioses paredros (\"attendant gods\", domestic and nature spirits) and tibicenas (evil genies), as well as the demon Guayota (aboriginal god of evil) that, like the Arabic Devil (Islam)|, is sometimes identified with a genie.[http://www.eldia.es/2009-08-23/CRITERIOS/3-Religion-guanche.htm Guanche Religion]  (Spanish) The Guanches were the Berber natives of the Canary Islands before they were colonised and enslaved by the Europeans who claimed the island for themselves.\n\nChristian sources\n\nVan Dyck's Arabic translation of the Old Testament uses the alternative collective plural \"jann\" (Arab:الجان}; translation:al-jānn) to render the Hebrew word usually translated into English as \"familiar spirit\" (אוב , Strong #0178) in several places (Leviticus 19:31, 20:6, 1 Samuel 28:3,7,9, 1 Chronicles 10:13).\n\nIn popular culture\n\nThe jinn frequently occurs as a character or plot element in fiction. Two other classes of jinns, the ifrit and the marid, have been represented in fiction as well.\n\nGenies appear in film in various forms, such as the genie freed by Abu, the eponymous character in the 1940 film Thief of Bagdad.\n\nA Jinn makes a short appearance in the novel American Gods by Neil Gaiman, originally published in 2001.  American Gods was also made into a TV series for the Starz television cable television network in 2017. The television adaptation also features a Jinn.\n\nThe protagonist of the Bartimaeus Sequence is a jinni, and the books have an established hierarchy that include other types of spirit: imps, foliots, djinn, afrits, and marids (to use the author's own spelling). In this interpretation, jinn and all other spirits are not physical beings, but are instead from another dimension of chaos called \"The Other Place\". To exist on Earth at all, magicians must summon sprits and force them to take some kind of form, something so alien that it causes all spirits pain. As a result, magicians must put measures in place to force spirits to do what they want in a form of magical slavery.\n\nGallery\n\nFile:Iranischer_Meister_001.jpg|Zulqarnayn with the help of some jinn, building the Iron Wall to keep the barbarian Gog and Magog from civilized peoples (16th century Persian miniature)\nFile:Illustration of Aladdin Flying Away with Two People from the Arabian Nights.jpg|Aladdin flying away with two people, from the Arabian Nights, c. 1900\nFile:John Tenniel - The sleeping genie and the lady.jpg|The sleeping genie and the lady, from the Arabian Nights, illustrated by Sir John Tenniel, 1912\nFile:He's_behind_you.jpg|An 1886 theatre poster advertising a production of the pantomime Aladdin with some jinn in the background\nFile:Kitab al-Bulhan -- devil.jpg|page from 14th/15th-century manuscript Kitab al-Bulhan or Book of Wonders",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Jinn" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13027" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Jinn (, '), also romanized as djinn or anglicized as genies (with the more broad meaning of spirits or demons)Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 22 (German) are supernatural creatures in early Arabian and later Islamic mythology and theology. They are not purely spiritual, but also physical in nature, being able to interact in a tactile manner with people and objects and also subject to bodily desires like eating and sleeping. Jinn mentioned in Middle Eastern folktales are often depicted as monstrous or magical creatures, though jinn figments from such stories are generally considered to be fictional.Robert Lebling Legends of the Fire Spirits: Jinn and Genies from Arabia to Zanzibar I.B.Tauris 2010 \n\nEtymology\n\nJinn is an Arabic collective noun deriving from the Semitic root  (, jann), whose primary meaning is \"to hide\" or \"to conceal\". Some authors interpret the word to mean, literally, \"beings that are concealed from the senses\".. p. 462. Cognates include the Arabic ' (\"possessed\", or generally \"insane\"), ' (\"garden\"), and ' (\"embryo\"). Jinn is properly treated as a plural, with the singular being jinni.\n\nThe origin of the word Jinn remains uncertain.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 22 (German)\nSome scholars relate the Arabic term jinn to the Latin genius, as a result of syncretism during the reign of the Roman empire under Tiberius Augustus,Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 38 but this derivation is also disputed.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 25 (German) Another suggestion holds, that jinn may derived from Aramaic \"ginnaya\" () with the meaning of Tutelary deity Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 24 (German) or also ‘garden’. Others claim a Persian origin of the word, for in the form of the Avestic \"Jaini\", a wicked (female) spirit.  Jaini were among various creatures in the possibly even pre-Zoroastrian mythology of peoples of Iran.Tisdall, W. St. Clair. The Original Sources of the Qur'an, Society for Promoting Christian Knowledge, London, 1905The Religion of the Crescent or Islam: Its Strength, Its Weakness, Its Origin, Its Influence, William St. Clair Tisdall, 1895\n\nThe anglicized form genie is a borrowing of the French ', from the Latin genius, a guardian spirit of people and places in Roman religion. It first appearedOxford English Dictionary, 3rd ed. \"genie, n.\" Oxford University Press (Oxford), 2014. in 18th-century translations of the Thousand and One Nights from the French,. where it had been used owing to its rough similarity in sound and sense.\n\nPre-Islamic  Arabia \n\nJinn were worshipped by Arabs during the Pre-Islamic period. But unlike gods, jinn were not depicted as immortals, rather assisting humans in regard of their worships. According to a common belief, soothsayers and poets got their inspirations from the jinn.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 34 However jinn were also feared and thought to be responsible for various diseases and mental illnesses.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 122 Julius Wellhausen has observed that such spirits were thought to inhabit desolate, dingy, and dark places and that they were feared. One had to protect oneself from them, but they were not the objects of a true cult. In ancient Arabia, the term jinn also applied to all kinds of supernatural entities among various religions and cults, thus angels and demons among Zoroastrianism, Christianity and Judaism were also called jinn.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 34\n\nIslamic theology\n\nIn the Islamic sense, jinn is used in two different ways:\n\n* As the opposite of al-Ins (something in shape) referring to any object concealed from humans sensory organs, including angels, demons and the interior of humn. Thus every demon and every angel is also a jinn, but not every jinn is an angel or a demon.Scott B. Noegel, Brannon M. Wheeler The A to Z of Prophets in Islam and Judaism Scarecrow Press 2010  page 170University of Michigan Muhammad Asad: Europe's Gift to Islam, Band 1 Truth Society 2006  page 387Richard Gauvain Salafi Ritual Purity: In the Presence of God Routledge 2013  page 302\n\n*An invisible entity, created by God out of a \"mixture of fire\" or \"smokeless fire\", who roamed the earth before Adam. These entities are believed to resemble human in regards of the need of eating and drinking, procreation and dying, being subject to judgment and will either condemned to heaven or hell according to their deeds.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 18 But they were much faster and stronger than humans.\n\nIn Islamic tradition, Muhammad was sent as a prophet to both human and jinn communities, and that prophets and messengers were sent to both communities.Muḥammad ibn Ayyūb al-Ṭabarī, Tuḥfat al-gharā’ib, I, p. 68; Abū al-Futūḥ Rāzī, Tafsīr-e rawḥ al-jenān va rūḥ al-janān, pp. 193, 341 Traditionally Surah 72 is held to tell about the revelation to jinn and several stories mention one of Muhammads followers accompanied him, witnessing the revelation to the jinn.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 64\n\nAnother Islamic prophet, who is related to interactions with jinn, is Solomon. In Quran, he is said to be a king in ancient Israel and was gifted by God to talk to animals and jinn. God granted him authory over the rebellious jinn and the demons, thus Solomon forced them to build the First Temple. Beliefs regarding Solomon and his power over the jinn were later extended in folklore and folktales. \n\nRelated to common traditions, the angels were created on Wednesday, the jinn on Thursday and humans on Friday, but not the very next day, rather more than 1000 years later. Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 43 (German) The community of the jinn race were like these of humans, but then corruption and injustice among them increased and all warnings sent by God were ignored. Consequentially, God sent his angels to battle the infidel jinn. Just a few survived, and were oust to far islands or to the mountains. With the revelation of Islam, the jinn were given a new chance to access salvation.Patrick Hughes, Thomas Patrick Hughes Dictionary of Islam Asian Educational Services 1995 page 134 Gabriel Said Reynolds The Qur'an and Its Biblical Subtext Routledge 2010  page 41\n\nDevelopment of Islamic Jinn belief\n\nIn the beginning of Islam\n\nIn early Islamic development, the status of jinn were reduced from that of deityChristopher R. Fee, Jeffrey B. Webb American Myths, Legends, and Tall Tales: An Encyclopedia of American Folklore [3 volumes]: An Encyclopedia of American Folklore (3 Volumes) ABC-CLIO 2016  page 527 to minor spirits. To assert a strictly monotheism and the Islamic concept on Tauhid all affinities between the jinn and God were denied, thus Jinn were placed parallel to human, also subject to Gods judgment and may attain paradise or hell. However, even their status as tutelary deities was reduced, they were not consequently regarded as demons.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 52 In later revelations, the concept of demons and angels distinct from the pagan jinn were made.Jacques Waardenburg Islam: Historical, Social, and Political Perspectives Walter de Gruyter 2008  page 40 T. Fahd stated, the jinn were related to the pagan belief, while the demons and angels were borrowed from monotheistic concepts of angels and demons. In later revealations the demons and the jinn seems to be used interchangeable, here placing the jinn with the devil diametral, against  the angels and Muhammad.\n\nJinn belief in the later centuries\n\nWhen Islam spread outside of Arabia, belief in the Jinn was assimilated with local belief about spirits and deities from Iran, Africa, Turkey and India.Juan Eduardo Campo Encyclopedia of Islam Infobase Publishing  2009  page 402 Persians, for example, identified the Jinn in the Quran with the Daeva from Zoroastrian lore.Patrick Hughes, Thomas Patrick Hughes Dictionary of Islam Asian Educational Services 1995  page 134 Developed from various traditions and local folklore, but not mentioned in canonical Islamic scriptures, Jinn were thought to be able to possess humans; Morocco especially has many possession traditions, including exorcism rituals.Joseph P. Laycock Spirit Possession around the World: Possession, Communion, and Demon Expulsion across Cultures: Possession, Communion, and Demon Expulsion across Cultures ABC-CLIO 2015  page 243 In Sindh the concept of the Jinni was introduced during the Abbasid Era and has become a common part of local folklore, also including stories of both male jinn called \"Jinn\" and female Jinn called \"Jiniri\". Folk stories of female Jinn include stories such as the Jejhal Jiniri. Although, due to the cultural influence, the concept of jinn may vary over different concepts, all share some common features. The Jinn are believed to live in societies resembling these of humans, practicing religion (including Islam, Christianity and Judaism), having emotions, needing to eat and drink, and can procreate and raise families. Additionally, they fear iron, generally appear in desolate or abandoned places, and are stronger and faster than humans.Hughes, Thomas Patrick. Dictionary of Islam. 1885. \"Genii\" p.136  Generally, Jinn are thought to eat bones and prefer rotten flesh over fresh flesh.Abu’l-Fotūḥ, XVII, pp. 280–281\n\nThe composition and existence of Jinn is the subject of various debates during the Middle Ages. According to Ashari, the existence of Jinn can not be proven, because arguments concerning the existence of jinn are beyond human comprehension. Adepts of Ashʿari theology, explained Jinn are invisible to humans because they lack the appropriate sense organs to envision them.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 22 Critics argued, if Jinn exist, their bodies must either be ethereal or made of solid material; if they were composed of the former, they would not able to do hard work, like carrying heavy stones. If they were composed of the latter, they would be visible to any human with functional eyes.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p.33 (German) Critics therefore refused to believe in a literal reading on Jinn in Islamic sacred texts, preferring to view them as \"unruly men\".Hughes, Thomas Patrick. Dictionary of Islam. 1885. \"Genii\" p.134 On the other hand, advocates of belief in Jinn assert that God's creation can exceed the human mind; thus, Jinn are beyond human understanding. Since they are mentioned in Islamic texts, scholars such as Ibn Taimiyya and Ibn Hazm prohibit the denial of Jinn. They also refer to spirits and demons among the Christians, Zoroastrians and Jews to \"prove\" their existence.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p.33 (German) Ibn Taymiyya believed the Jinn to be generally \"ignorant, untruthful, oppressive and treacherous\". He held that the Jinn account for much of the \"magic\" that is perceived by humans, cooperating with magicians to lift items in the air, delivering hidden truths to fortune tellers, and mimicking the voices of deceased humans during seances.Ibn Taymiyyah, al-Furqān bayna awliyā’ al-Raḥmān wa-awliyā’ al-Shayṭān (\"Essay on the Jinn\"), translated by Abu Ameenah Bilal Phillips\n\nOther critics, such as Jahiz and Mas'udi, stated that sightings of Jinn are due to psychological causes. According to Mas'udi, the Jinn as described by traditional scholars, are not a priori false, but improbable. Jahiz states in his work Kitab al-Hayawan that loneliness induces humans to mind-games and wishful thinking, causing waswās (whisperings in the mind, traditionally thought to be caused by Satan). If he is afraid, he may see things that are not real. These alleged appearances are told to other generations in bedtime stories and poems, and with children of the next generation growing up with such stories, when they are afraid or lonely, they remember these stories, encouraging their imaginations and causing another alleged sighting of Jinn.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p.37 (German)\n\nLater Sufi traditions related the meaning of Jinn back to its origin \"something that is concealed from sights\", thus they were related to the hidden realm, including angels from the heavenly realm and the Jinn from an sublunary realm. Ibn Arabi stated: \"Only this much is different-the spirits of the Jinn are lower spirits, while the spirits of angels are heavenly spirits.\"http://www.ibnarabisociety.org/articles/futuhat_ch009.html The jinn share, due to their intermediary abode both angelic and human traits. According to some Sufi teachings, a jinn is like an empty cup, composed of its own ego and intention, and a reflection of its observer.H.J. Witteveen The Heart of Sufism: Essential Writings of Hazrat Inayat Khan Shambhala Publications 1999  Because Jinn are closer to the material realm, it would be easier for human to contact a Jinn, than an angel.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 50\n\nIn folk literature \n\nJinn can be found in the One Thousand and One Nights story of \"The Fisherman and the Jinni\";[http://classiclit.about.com/library/bl-etexts/arabian/bl-arabian-jinni.htm The fisherman and the Jinni] at About.com Classic Literature more than three different types of jinn are described in the story of Ma‘ruf the Cobbler;[http://www.idriesshahfoundation.org/books/tales-of-the-dervishes/ Idries Shah - Tales of the Dervishes] at ISF website two jinn help young Aladdin in the story of Aladdin and the Wonderful Lamp;[http://classiclit.about.com/library/bl-etexts/arabian/bl-arabian-alladin.htm The Arabian Nights - ALADDIN; OR, THE WONDERFUL LAMP] at About.com Classic Literature as Ḥasan Badr al-Dīn weeps over the grave of his father until sleep overcomes him, and he is awoken by a large group of sympathetic jinn in the Tale of ‘Alī Nūr al-Dīn and his son Badr ad-Dīn Ḥasan.[http://classiclit.about.com/library/bl-etexts/arabian/bl-arabian-nuraldin.htm The Arabian Nights - TALE OF NUR AL-DIN ALI AND HIS SON BADR AL-DIN HASAN] at About.com Classic Literature In some stories, jinn are credited with the ability of instantaneous travel (from China to Morocco in a single instant); in others, they need to fly from one place to another, though quite fast (from Baghdad to Cairo in a few hours).\n\nModern interpretations\n\nAlthought affirmation on the existence of jinn as sapient creatures living along with human is still widespread in Middle Eastern world, modernist commentators, on the basis of the word's meaning, refer jinn to microorganisms such as bacteria and viruses or rather to undetectable uncivilized persons.Simon Ross Valentine Islam and the Ahmadiyya Jama'at: History, Belief, Practice Hurst Publishers 2008  page 143U. A. B. Razia Akter Banu Islam in Bangladesh BRILL 1992  page 57 Another interpretation holds, they live in paralleldimensions consisting on rays.\n\nIn science \n\nSleep paralysis is conceptualized as a \"Jinn attack\" by many sleep paralysis sufferers in Egypt as discovered by Cambridge neuroscientist Baland Jalal. A scientific study found that as many as 48 percent of those who experience sleep paralysis in Egypt believe it to be an assault by the Jinn. Almost all of these sleep paralysis sufferers (95%) would recite verses from the Quran during sleep paralysis to prevent future \"Jinn attacks\". In addition, some (9%) would increase their daily Islamic prayer (salah) to get rid of these attacks by Jinn. Sleep paralysis is generally associated with great fear in Egypt, especially if believed to be supernatural in origin.\n\nDepictions of Jinn\n \nGenerally jinn lack individuality and are thought to appear in mists or sandstorms.Hughes, Thomas Patrick. Dictionary of Islam. 1885. \"Genii\" p.136 Zubayr ibn al-Awam, who is held to have accompanied Muhammad during his lecture to the jinn, is said to view the jinn as shadowy ghosts with no individual structure.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 64 But jinn are thought to be able to materialize in different forms and therefore may gain individuality, like Sakhr.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 153 (German) They can shape into both animals and human. Especially black dogs, onagers and serpents are thought to be common temporarily embodiments of jinn. Except for the udhrut from Yemeni folklore, jinn could not transform in wolves, because they were the foes of jinn, disabling the jinn to vanish.  name=\"ReferenceA\">Robert Lebling Legends of the Fire Spirits: Jinn and Genies from Arabia to Zanzibar Legends of the Fire Spirits: Jinn and Genies from Arabia to Zanzibar 2010  page 98 Associations between dogs and jinn prevailed in Arabic-literature, but lost its meaning in Persian scriptures.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 134 (German) Commonly associated with jinn in humanform are the Si'lah and the Ghoul. However they stay partly animalic, their bodies are depicted as fashioned out of two or more different species.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 164  Therefore, individual jinn are commonly depicted as  monstrous and anthropomorphized creatures with body parts from different animals or human with animalic traits.Tobias Nünlist Dämonenglaube im Islam Walter de Gruyter GmbH & Co KG, 2015  p. 164 (German)\n\nJinn in witchcraft and magical literature\n\nIbn al-Nadim, in his Kitāb al-Fihrist, describes a book that lists 70 Jinn led by Fuqtus, including several Jinn appointed over each day of the week.Bayard Dodge, ed. and trans. The Fihrist of al-Nadim: A Tenth-Century Survey of Muslim Culture. New York: Columbia University Press, 1970. pp. 727-8.Robert Lebling. Legends of the Fire Spirits: Jinn and Genies from Arabia to Zanzibar. I.B. Taurus, 2010. p.38 Bayard Dodge, who translated al-Fihrist into English, notes that most of these names appear in the Testament of Solomon. A collection of late fourteenth- or early fifteenth-century magico-medical manuscripts from Ocaña, Spain describes a different set of 72 Jinn (termed \"Tayaliq\") again under Fuqtus (here named \"Fayqayțūš\" or Fiqitush), blaming them for various ailments.Celia del Moral. Magia y Superstitión en los Manuscritos de Ocaña (Toledo). Siglos XIV-XV. Proceedings of the 20th Congress of the Union Européenne des Arabisants et Islamisants, Part Two; A. Fodor, ed.  Budapest, 10–17 September 2000. pp.109-121Joaquina Albarracin Navarro & Juan Martinez Ruiz. Medicina, Farmacopea y Magia en el \"Misceláneo de Salomón\".  Universidad de Granada, 1987. p.38 et passim According to these manuscripts each Jinn was brought before King Solomon and ordered to divulge their \"corruption\" and \"residence\" while the Jinn King Fiqitush gave Solomon a recipe for curing the ailments associated with each Jinn as they confessed their transgressions.\n\nSeven kings of the Jinn are traditionally associated with days of the week.\n* Sunday: Al-Mudhib (Abu 'Abdallah Sa'id)\n* Monday: Murrah al-Abyad Abu al-Harith (Abu al-Nur)\n* Tuesday: Abu Mihriz (or Abu Ya'qub) Al-Ahmar\n* Wednesday: Barqan Abu al-'Adja'yb\n* Thursday: Shamhurish (al-Tayyar)\n* Friday: Abu Hasan Zoba'ah (al-Abyad)\n* Saturday: Abu Nuh Maimun\n\nDuring the Rwandan genocide, both Hutus and Tutsis avoided searching local Rwandan Muslim neighborhoods because they widely believed the myth that local Muslims and mosques were protected by the power of Islamic magic and the efficacious jinn. In Cyangugu, arsonists ran away instead of destroying the mosque because they believed that jinn were guarding the mosque and they feared their wrath.\n\nComparative mythology\n\nJudaism\n\nShedim, one of several supernatural creatures in early Jewish mythology resemble the Islamic concept of Jinn. Both are said to be invisible to human eye but are subject to bodily desires, like procreating and the need to eat and both may be malevolent or benevolent. Like the Islamic notion of jinn as Pre-Adamites, Jewish lore also regard shedim as Pre-Adamites, replaced by human being in some legends.Carol K. Mack, Dinah Mack A Field Guide to Demons, Vampires, Fallen Angels and Other Subversive Spirits Skyhorse Publishing 2013  Narrations regarding Asmodeus, an antagonist in Solomon legends, appears both in Islamic lore and in Talmud as the king either of the jinn or the shedim.\n\nBuddhism\n\nSimilar to the Islamic idea of spiritual entities converting to One's religion can be found on Buddhism lore. Accordingly, Buddha preached among humans and Deva, spiritual entities who are like humans subject to the cycle of life.Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 165Marie Musæus-Higgins Poya Days Asian Educational Services 1925  page 14\n\nIn the Guanche mythology \n\nIn Guanche mythology from Tenerife in the Canary Islands, there existed the belief in beings that were similar to genies, (Spanish) such as the maxios or dioses paredros (\"attendant gods\", domestic and nature spirits) and tibicenas (evil genies), as well as the demon Guayota (aboriginal god of evil) that, like the Arabic Devil (Islam)|, is sometimes identified with a genie.[http://www.eldia.es/2009-08-23/CRITERIOS/3-Religion-guanche.htm Guanche Religion]  (Spanish) The Guanches were the Berber natives of the Canary Islands before they were colonised and enslaved by the Europeans who claimed the island for themselves.\n\nChristian sources\n\nVan Dyck's Arabic translation of the Old Testament uses the alternative collective plural \"jann\" (Arab:الجان}; translation:al-jānn) to render the Hebrew word usually translated into English as \"familiar spirit\" (אוב , Strong #0178) in several places (Leviticus 19:31, 20:6, 1 Samuel 28:3,7,9, 1 Chronicles 10:13).\n\nIn popular culture\n\nThe jinn frequently occurs as a character or plot element in fiction. Two other classes of jinns, the ifrit and the marid, have been represented in fiction as well.\n\nGenies appear in film in various forms, such as the genie freed by Abu, the eponymous character in the 1940 film Thief of Bagdad.\n\nA Jinn makes a short appearance in the novel American Gods by Neil Gaiman, originally published in 2001.  American Gods was also made into a TV series for the Starz television cable television network in 2017. The television adaptation also features a Jinn.\n\nThe protagonist of the Bartimaeus Sequence is a jinni, and the books have an established hierarchy that include other types of spirit: imps, foliots, djinn, afrits, and marids (to use the author's own spelling). In this interpretation, jinn and all other spirits are not physical beings, but are instead from another dimension of chaos called \"The Other Place\". To exist on Earth at all, magicians must summon sprits and force them to take some kind of form, something so alien that it causes all spirits pain. As a result, magicians must put measures in place to force spirits to do what they want in a form of magical slavery.\n\nGallery\n\nFile:Iranischer_Meister_001.jpg|Zulqarnayn with the help of some jinn, building the Iron Wall to keep the barbarian Gog and Magog from civilized peoples (16th century Persian miniature)\nFile:Illustration of Aladdin Flying Away with Two People from the Arabian Nights.jpg|Aladdin flying away with two people, from the Arabian Nights, c. 1900\nFile:John Tenniel - The sleeping genie and the lady.jpg|The sleeping genie and the lady, from the Arabian Nights, illustrated by Sir John Tenniel, 1912\nFile:He's_behind_you.jpg|An 1886 theatre poster advertising a production of the pantomime Aladdin with some jinn in the background\nFile:Kitab al-Bulhan -- devil.jpg|page from 14th/15th-century manuscript Kitab al-Bulhan or Book of Wonders. Jinn. http://en.wikipedia.org/?curid=13027."
  }
}
