{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1491",
  "eid" : "ba13f800-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778391936,
  "textBody" : "It is the peak of the Perseid meteor shower. It is also known as the \"Glorious Twelfth\" in the United Kingdom, as it marks the traditional start of the grouse shooting season.\n\nEvents\n\n*1099 – First Crusade: Battle of Ascalon Crusaders under the command of Godfrey of Bouillon defeat Fatimid forces led by Al-Afdal Shahanshah. This is considered the last engagement of the First Crusade.\n*1121 – Battle of Didgori: The Georgian army under King David IV wins a decisive victory over the famous Seljuk commander Ilghazi.\n*1164 – Battle of Harim: Nur ad-Din Zangi defeats the Crusader armies of the County of Tripoli and the Principality of Antioch.\n*1323 – Signature of the Treaty of Nöteborg between Sweden and Novgorod Republic, that regulates the border between the two countries for the first time.\n*1492 – Christopher Columbus arrives in the Canary Islands on his first voyage to the New World.\n*1499 – First engagement of the Battle of Zonchio between Venetian and Ottoman fleets.\n*1624 – The president of Louis XIII of France's royal council is arrested, leaving Cardinal Richelieu in the role of the King's principal minister.\n*1676 – Praying Indian John Alderman shoots and kills Metacomet, the Wampanoag war chief, ending King Philip's War.\n*1687 – Battle of Mohács: Charles of Lorraine defeats the Ottoman Empire.\n*1765 – Treaty of Allahabad is signed. The Treaty marks the political and constitutional involvement and the beginning of Company rule in India.\n*1793 – The Rhône and Loire départments are created when the former département of Rhône-et-Loire is split into two.\n*1806 – Santiago de Liniers, 1st Count of Buenos Aires re-takes the city of Buenos Aires, Argentina after the first British invasion.\n*1831 – French intervention forces William I of the Netherlands to abandon his attempt to suppress the Belgian Revolution.\n*1851 – Isaac Singer is granted a patent for his sewing machine.\n*1865 – Joseph Lister, British surgeon and scientist,  performs 1st antiseptic surgery.\n*1883 – The last quagga dies at the Natura Artis Magistra, a zoo in Amsterdam, Netherlands.\n*1898 – The Hawaiian flag is lowered from ʻIolani Palace in an elaborate annexation ceremony and replaced with the flag of the United States to signify the transfer of sovereignty from the Republic of Hawaii to the United States.\n*1914 – World War I: The United Kingdom declares war on Austria-Hungary; the countries of the British Empire follow suit.\n*  1914   – World War I: The Battle of Halen a.k.a. Battle of the Silver Helmets a clash between large Belgian and German cavalry formations at Halen, Belgium.\n*1944 – Waffen-SS troops massacre 560 people in Sant'Anna di Stazzema.\n*  1944   – Nazi German troops end the week-long Wola massacre, during which time at least 40,000 people were killed indiscriminately or in mass executions.\n*  1944   – Alençon is liberated by General Philippe Leclerc de Hauteclocque, the first city in France to be liberated from the Nazis by French forces.\n*1950 – Korean War: Bloody Gulch massacre: American POWs are massacred by North Korean Army.\n*1952 – The Night of the Murdered Poets: Thirteen prominent Jewish intellectuals are murdered in Moscow, Russia, Soviet Union.\n*1953 – The first testing of a real thermonuclear weapon (not test devices): The Soviet atomic bomb project continues with the detonation of \"RDS-6s\" (Joe 4), the first Soviet thermonuclear bomb.\n*  1953   – The 7.2  Ionian earthquake shakes the southern Ionian Islands with a maximum Mercalli intensity of X (Extreme). Between 445 and 800 people were killed.\n*1960 – Echo 1A, NASA's first successful communications satellite, is launched.\n*1964 – South Africa is banned from the Olympic Games due to the country's racist policies.\n*1969 – Violence erupts after the Apprentice Boys of Derry march in Derry, Northern Ireland, resulting in a three-day communal riot known as the Battle of the Bogside.\n*1976 – Between 1,000 and 3,500 Palestinians are killed in the Tel al-Zaatar massacre, one of the bloodiest events of the Lebanese Civil War\n*1977 – The first free flight of the .\n*  1977   – The Sri Lanka Riots:, targeting the minority Sri Lankan Tamils, begin, less than a month after the United National Party came to power. Over 300 Tamils are killed.\n*1981 – The IBM Personal Computer is released.\n*1985 – Japan Airlines Flight 123 crashes into Osutaka ridge in Gunma Prefecture, Japan, killing 520, to become the worst single-plane air disaster.\n*1990 – Sue, the largest and most complete Tyrannosaurus Rex skeleton found to date, is discovered by Sue Hendrickson in South Dakota.\n*1992 – Canada, Mexico and the United States announce completion of negotiations for the North American Free Trade Agreement (NAFTA).\n*1994 – Major League Baseball players go on strike, forcing the cancellation of the 1994 World Series.\n*2000 – The Russian Navy submarine  explodes and sinks in the Barents Sea during a military exercise, killing her entire 118-man crew.\n*2015 – At least two massive explosions kill 173 people and injure nearly 800 more in Tianjin, China.\n\nBirths\n\n*1452 – Abraham Zacuto, Jewish astronomer, astrologer, mathematician, rabbi and historian (d. 1515)\n*1503 – Christian III of Denmark (d. 1559)\n*1506 – Franciscus Sonnius, Dutch counter-Reformation theologian (d. 1576)\n*1591 – Louise de Marillac, co-founder of the Daughters of Charity (d. 1660)\n*1599 – Sir William Curtius FRS, German magistrate, English baronet (d. 1678).\n*1604 – Tokugawa Iemitsu, Japanese shogun (d. 1651)\n*1626 – Giovanni Legrenzi, Italian composer (d. 1690)\n*1629 – Archduchess Isabella Clara of Austria, Austrian archduchess (d. 1685)\n*1644 – Heinrich Ignaz Franz Biber, Bohemian-Austrian violinist and composer (d. 1704)\n*1686 – John Balguy, English philosopher and author (d. 1748)\n*1696 – Maurice Greene, English organist and composer (d. 1755)\n*1762 – George IV of the United Kingdom (d. 1830)\n*1773 – Karl Faber, Prussian historian and academic (d. 1853)\n*1774 – Robert Southey, English poet and author (d. 1843)\n*1831 – Helena Blavatsky, Russian theosophist and scholar (d. 1891)\n*1852 – Michael J. McGivney, American priest, founded the Knights of Columbus (d. 1890)\n*1856 – Diamond Jim Brady, American businessman and philanthropist (d. 1917)\n*1857 – Ernestine von Kirchsberg, Austrian painter and educator (d. 1924)\n*1859 – Katharine Lee Bates, American poet and author (d. 1929)\n*1860 – Klara Hitler, Austrian mother of Adolf Hitler (d. 1907)\n*1866 – Jacinto Benavente, Spanish playwright, Nobel Prize laureate (d. 1954)\n*  1866   – Henrik Sillem, Dutch target shooter, mountaineer, and jurist (d. 1907)\n*1867 – Edith Hamilton, German-American author and educator (d. 1963)\n*1870 – Henry Reuterdahl, Swedish-American artist (d. 1925)\n*1871 – Gustavs Zemgals, Latvian politician, 2nd President of Latvia (d. 1939)\n*1876 – Mary Roberts Rinehart, American author and playwright (d. 1958)\n*1877 – Albert Bartha, Hungarian general and politician, Hungarian Minister of Defence (d. 1960)\n*1880 – Radclyffe Hall, English poet, author, and activist (d. 1943)\n*  1880   – Christy Mathewson, American baseball player and manager (d. 1925)\n*1881 – Cecil B. DeMille, American director and producer (d. 1959)\n*1883 – Martha Hedman, Swedish-American actress and playwright (d. 1974)\n*  1883   – Marion Lorne, American actress (d. 1968)\n*1885 – Jean Cabannes, French physicist and academic (d. 1959)\n*  1885   – Keith Murdoch, Australian journalist (d. 1952)\n*  1885   – Juhan Simm, Estonian composer and conductor (d. 1959)\n*1887 – Erwin Schrödinger, Austrian physicist and academic, Nobel Prize laureate (d. 1961)\n*1889 – Zerna Sharp, American author and educator (d. 1981)\n*1891 – C. E. M. Joad, English philosopher and academic (d. 1953)\n*  1891   – John McDermott, American golfer (d. 1971)\n*1892 – Alfred Lunt, American actor and director (d. 1977)\n*1897 – Maurice Fernandes, Guyanese cricketer (d. 1981)\n*1899 – Ben Sealey, Trinidadian cricketer (d. 1963)\n*1902 – Mohammad Hatta, Indonesian politician, 1st Vice President of Indonesia (d. 1980)\n*1904 – Idel Jakobson, Latvian-Estonian NKVD officer (d. 1997)\n*  1904   – Tamás Lossonczy, Hungarian painter (d. 2009)\n*  1904   – Alexei Nikolaevich, Tsarevich of Russia (d. 1918)\n*1906 – Harry Hopman, Australian tennis player and coach (d. 1985)\n*  1906   – Tedd Pierce, American animator, producer, and screenwriter (d. 1972)\n*1907 – Gladys Bentley, American blues singer (d. 1960)\n*  1907   – Joe Besser, American actor (d. 1988)\n*  1907   – Boy Charlton, Australian swimmer (d. 1975)\n*  1907   – Benjamin Sheares, Singaporean physician and politician, 2nd President of Singapore (d. 1981)\n*1909 – Bruce Matthews, Canadian general and businessman (d. 1991)\n*1910 – Yusof bin Ishak, Singaporean journalist and politician, 1st President of Singapore (d. 1970)\n*  1910   – Jane Wyatt, American actress (d. 2006)\n*1911 – Cantinflas, Mexican actor, screenwriter, and producer (d. 1993)\n*1912 – Samuel Fuller, American actor, director, and screenwriter (d. 1997)\n*1913 – Richard L. Bare, American director, producer, and screenwriter (d. 2015)\n*1914 – Gerd Buchdahl, German-English philosopher and author (d. 2001)\n*  1914   – Ruth Lowe, Canadian pianist and songwriter (d. 1981)\n*1915 – Michael Kidd, American dancer and choreographer (d. 2007)\n*1916 – Ioan Dicezare, Romanian general and pilot (d. 2012)\n*  1916   – Edward Pinkowski, American writer, journalist and Polonia historian  \n*1917 – Oliver Crawford, American screenwriter and author (d. 2008)\n*1918 – Sid Bernstein, American record producer (d. 2013)\n*  1918   – Guy Gibson, Anglo-Indian commander and pilot, Victoria Cross recipient (d. 1944)\n*1919 – Margaret Burbidge, English-American astrophysicist and academic\n*  1919   – Vikram Sarabhai, Indian physicist and academic (d. 1971)\n*1920 – Charles Gibson, American ethnohistorian (d. 1985)\n*  1920   – Percy Mayfield, American R&B singer-songwriter (d. 1984)\n*1922 – Fulton Mackay, Scottish actor and playwright (d. 1987)\n*  1922   – Miloš Jakeš, Czech communist politician\n*1923 – John Holt, Jamaican cricketer (d. 1997)\n*1924 – Derek Shackleton, English cricketer, coach, and umpire (d. 2007)\n*  1924   – Muhammad Zia-ul-Haq, Pakistani general and politician, 6th President of Pakistan (d. 1988)\n*1925 – Dale Bumpers, American soldier, lawyer, and politician, 38th Governor of Arkansas (d. 2016)\n*  1925   – Guillermo Cano Isaza, Colombian journalist (d. 1986)\n*  1925   – Donald Justice, American poet and writing teacher (d. 2004)\n*  1925   – Norris McWhirter, Scottish publisher and activist co-founded the Guinness World Records (d. 2004)\n*  1925   – Ross McWhirter, Scottish publisher and activist, co-founded the Guinness World Records (d. 1975)\n*  1925   – George Wetherill, American physicist and academic (d. 2006)\n*1926 – John Derek, American actor, director, and cinematographer (d. 1998)\n*  1926   – Joe Jones, American R&B singer-songwriter and producer (d. 2005)\n*1927 – Porter Wagoner, American singer-songwriter and guitarist (d. 2007)\n*1928 – Charles Blackman, Australian painter and illustrator\n*  1928   – Bob Buhl, American baseball player (d. 2001)\n*  1928   – Dan Curtis, American director and producer (d. 2006)\n*1929 – Buck Owens, American singer-songwriter and guitarist (d. 2006)\n*1930 – George Soros, Hungarian-American businessman and investor, founded the Soros Fund Management\n*  1930   – Kanagaratnam Sriskandan, Sri Lankan engineer and civil servant (d. 2010)\n*  1930   – Jacques Tits, Belgian-French mathematician and academic\n*1931 – William Goldman, American author, playwright, and screenwriter\n*1932 – Dallin H. Oaks, American lawyer, jurist, and religious leader\n*  1932   – Charlie O'Donnell, American radio and television announcer (d. 2010)\n*  1932   – Sirikit, Queen mother of Thailand\n*1933 – Parnelli Jones, American race car driver and businessman\n*  1933   – Frederic Lindsay, Scottish author and educator (d. 2013)\n*1934 – Robin Nicholson, English metallurgist and academic\n*1935 – John Cazale, American actor (d. 1978)\n*1936 – Kjell Grede, Swedish director and screenwriter (d. 2017)\n*1937 – Walter Dean Myers, American author and poet (d. 2014)\n*1938 – Jean-Paul L'Allier, Canadian journalist and politician, 38th Mayor of Quebec City (d. 2016)\n*1939 – George Hamilton, American actor \n*  1939   – Pam Kilborn, Australian track and field athlete\n*  1939   – David King, South African chemist and academic\n*  1939   – Sushil Koirala, Nepalese politician, 37th Prime Minister of Nepal (d. 2016)\n*  1939   – Roy Romanow, Canadian lawyer and politician, 12th Premier of Saskatchewan\n*1940 – Eddie Barlow, South African cricketer and coach (d. 2005)\n*1941 – L. M. Kit Carson, American actor, producer, and screenwriter (d. 2014)\n*  1941   – Réjean Ducharme, Canadian author and playwright\n*  1941   – Dana Ivey, American actress\n*1942 – Hans-Wilhelm Müller-Wohlfahrt, German physician and author\n*1945 – Dorothy E. Denning, American computer scientist and academic\n*  1945   – Ron Mael, American keyboard player and songwriter \n*1946 – Terry Nutkins, English television host and author (d. 2012)\n*1948 – Siddaramaiah, Indian lawyer and politician, 22nd Chief Minister of Karnataka\n*  1948   – Graham J. Zellick, English academic and jurist\n*1949 – Panagiotis Chinofotis, Greek admiral and politician\n*  1949   – Mark Knopfler, Scottish-English singer-songwriter, guitarist, and producer \n*  1949   – Lou Martin, Northern Irish pianist, songwriter, and producer (d. 2012)\n*  1949   – Alex Naumik, Lithuanian-Norwegian singer-songwriter and producer (d. 2013)\n*  1949   – Rick Ridgeway, American mountaineer and photographer\n*1950 – Jim Beaver, American actor, director, and screenwriter\n*  1950   – August \"Kid Creole\" Darnell, American musician, bandleader, singer-songwriter, and record producer\n*1951 – Klaus Toppmöller, German football manager and former player \n*1952 – Daniel Biles, American associate justice of the Kansas Supreme Court \n*1954 – Rob Borbidge, Australian politician, 35th Premier of Queensland \n*  1954   – Leung Chun-ying, Hong Kong businessman and politician, 3rd Chief Executive of Hong Kong\n*  1954   – Ibolya Dávid, Hungarian lawyer and politician, Minister of Justice of Hungary\n*  1954   – François Hollande, French lawyer and politician, 24th President of France\n*  1954   – Pat Metheny, American jazz guitarist and composer\n*1956 – Lee Freedman, Australian horse trainer\n*  1956   – Bruce Greenwood, Canadian actor and producer\n*  1956   – Sidath Wettimuny, Sri Lankan cricketer\n*1957 – Friedhelm Schütte, German footballer\n*1958 – Jürgen Dehmel, German bass player and songwriter \n*1959 – Kerry Boustead, Australian rugby league player\n*  1959   – Amanda Redman, English actress\n*1960 – Laurent Fignon, French cyclist and sportscaster (d. 2010)\n*  1960   – Greg Thomas, Welsh-English cricketer\n*1961 – Roy Hay, English guitarist, keyboard player, and composer \n*  1961   – Mark Priest, New Zealand cricketer\n*1963 – Kōji Kitao, Japanese sumo wrestler, the 60th Yokozuna\n*  1963   – Campbell Newman, Australian politician, 38th Premier of Queensland\n*  1963   – Sir Mix-a-Lot, American rapper, producer, and actor\n*1964 – Txiki Begiristain, Spanish footballer\n*  1964   – Michael Hagan, Australian rugby league player and coach\n*1965 – Peter Krause, American actor \n*1966 – Tobias Ellwood, American-English captain and politician\n*1967 – Andy Hui, Hong Kong singer-songwriter and actor \n*  1967   – Andrey Plotnikov, Russian race walker\n*  1967   – Regilio Tuur, Dutch boxer\n*1968 – Thorsten Boer, German footballer and manager\n*  1968   – Ülar Mark, Estonian architect\n*1969 – Aga Muhlach, Filipino actor and politician\n*  1969   – Stuart Williams, Nevisian cricketer\n*1970 – Aleksandar Đurić, Bosnian footballer\n*  1970   – Charles Mesure, English-Australian actor and screenwriter\n*  1970   – Toby Perkins, English businessman and politician\n*  1970   – Jim Schlossnagle, American baseball player and coach\n*  1970   – Anthony Swofford, American soldier and author\n*1971 – Michael Ian Black, American comedian, actor, director, producer, and screenwriter\n*  1971   – Rebecca Gayheart, American actress\n*  1971   – Pete Sampras, American tennis player\n*1972 – Demir Demirkan, Turkish singer-songwriter and producer\n*  1972   – Mark Kinsella, Irish footballer and manager   \n*  1972   – Takanohana Kōji, Japanese sumo wrestler, the 65th Yokozuna\n*  1972   – Gyanendra Pandey, Indian cricketer\n*1973 – Jonathan Coachman, American basketball player, wrestler, and sportscaster\n*  1973   – Mark Iuliano, Italian footballer and manager\n*  1973   – Todd Marchant, American ice hockey player and coach\n*1974 – Matt Clement, American baseball player and coach\n*  1974   – Karl Stefanovic, Australian television host \n*1975 – Casey Affleck, American actor\n*1976 – Pedro Collins, Barbadian cricketer\n*  1976   – Mikko Lindström, Finnish guitarist \n*  1976   – Henry Tuilagi, Samoan rugby player\n*  1976   – Antoine Walker, American basketball player \n*1977 – Plaxico Burress, American football player\n*  1977   – Jesper Grønkjær, Danish footballer\n*1978 – Chris Chambers, American football player\n*  1978   – Hayley Wickenheiser, Canadian ice hockey player\n*1979 – D. J. Houlton, American baseball player\n*  1979   – Ian Hutchinson, English motorcycle racer\n*  1979   – Cindy Klassen, Canadian speed skater\n*  1979   – Austra Skujytė, Lithuanian pentathlete\n*1980 – Javier Chevantón, Uruguayan footballer\n*  1980   – Maggie Lawson, American actress\n*  1980   – Dominique Swain, American actress\n*  1980   – Matt Thiessen, Canadian-American singer-songwriter and guitarist \n*1981 – Tony Capaldi, Norwegian-Northern Irish footballer\n*  1981   – Djibril Cissé, French footballer\n*1982 – Boban Grnčarov, Macedonian footballer\n*  1982   – Alexandros Tzorvas, Greek footballer\n*1983 – Klaas-Jan Huntelaar, Dutch footballer\n*  1983   – Kléber Giacomance de Souza Freitas, Brazilian footballer\n*  1983   – Manoa Vosawai, Italian rugby player\n*1984 – Bryan Pata, American football player (d. 2006)\n*1985 – Danny Graham, English footballer\n*  1985   – Franck Moutsinga, German rugby player\n*1986 – Andrei Agius, Maltese footballer\n*  1986   – Kyle Arrington, American football player\n*1987 – Vanessa Watts, West Indian cricketer\n*1988 – Tyson Fury, English boxer\n*  1988   – Matt Gillett, Australian rugby league player\n*1989 – Tom Cleverley, English footballer\n*  1989   – Hong Jeong-ho, South Korean footballer\n*  1989   – Sunye, South Korean singer\n*1990 – Mario Balotelli, Italian footballer\n*  1990   – Marvin Zeegelaar, Dutch footballer\n*  1990   – Martin Zurawsky, German footballer\n*1991 – Jesinta Campbell, Australian model\n*  1991   – Sam Hoare, Australian rugby league player\n*1992 – Cara Delevingne, English model and actress\n*  1992   – Isabella Escobar, Guatemalan tennis player\n*  1992   – Jacob Loko, Australian rugby player\n*  1992   – Teo Gheorghiu, Swiss pianist and actor\n*1993 – Ewa Farna, Czech singer-songwriter\n*  1993   – Luna (singer), South Korean singer, actress and presenter\n*1996 – Julio Urías, Mexican baseball player\n*1999 – Matthijs de Ligt, Dutch footballer\n\nDeaths\n\n*30 BC– Cleopatra, Egyptian queen (b. 69 BC)\n* 792 – Jænberht, archbishop of Canterbury\n* 875 – Louis II, Holy Roman Emperor (b. 825)\n* 960 – Li Gu, chancellor of Later Zhou (b. 903)\n* 961 – Yuan Zong, emperor of Southern Tang (b. 916)\n*1222 – Vladislaus III, duke of Bohemia\n*1295 – Charles Martel, king of Hungary (b. 1271)\n*1319 – Rudolf I, duke of Bavaria (b. 1274)\n*1315 – Guy de Beauchamp, 10th Earl of Warwick, English nobleman\n*1335 – Prince Moriyoshi, Japanese shogun (b. 1308)\n*1399 – Demetrius I Starshy, Prince of Trubczewsk (in battle) (b. 1327)\n*1424 – Yongle, emperor of the Ming Empire (b. 1360)\n*1484 – Sixtus IV, pope of the Catholic Church (b. 1414)\n*1546 – Francisco de Vitoria, Spanish theologian (b. 1492)\n*1577 – Thomas Smith, English scholar and diplomat (b. 1513)\n*1588 – Alfonso Ferrabosco the elder, Italian-English composer (b. 1543)\n*1602 – Abu'l-Fazl ibn Mubarak, Mughal vizier and historian (b. 1551)\n*1612 – Giovanni Gabrieli, Italian organist and composer (b. 1557)\n*1638 – Johannes Althusius, German jurist and philosopher (b. 1557)\n*1674 – Philippe de Champaigne, Belgian-French painter and educator (b. 1602)\n*1689 – Pope Innocent XI (b. 1611)\n*1778 – Peregrine Bertie, 3rd Duke of Ancaster and Kesteven, English general and politician, Lord Lieutenant of Lincolnshire (b. 1714)\n*1809 – Mikhail Kamensky, Russian field marshal (b. 1738)\n*1810 – Étienne Louis Geoffroy, French pharmacist and entomologist (b. 1725)\n*1822 – Robert Stewart, Viscount Castlereagh, Irish-English politician, Secretary of State for Foreign Affairs (b. 1769)\n*1827 – William Blake, English poet and painter (b. 1757)\n*1829 – Charles Sapinaud de La Rairie, French general (b. 1760)\n*1848 – George Stephenson, English engineer and academic (b. 1781)\n*1849 – Albert Gallatin, Swiss-American ethnologist, linguist, and politician, 4th United States Secretary of the Treasury (b. 1761)\n*1851 – John Elliot Drinkwater Bethune, British lawyer and activist (b. 1801)\n*1861 – Eliphalet Remington, American inventor and businessman, founded Remington Arms (b. 1793)\n*1864 – Sakuma Shōzan, Japanese scholar and politician (b. 1811)\n*1865 – William Jackson Hooker, English botanist and academic (b. 1785)\n*1891 – James Russell Lowell, American poet and critic (b. 1819)\n*1896 – Thomas Chamberlain, American colonel (b. 1841)\n*1900 – Wilhelm Steinitz, Austrian chess player and theoretician (b. 1836)\n*1901 – Adolf Erik Nordenskiöld, Finnish-Swedish botanist, geologist, mineralogist, and explorer (b. 1832)\n*1904 – William Renshaw, English tennis player (b. 1861)\n*1914 – John Philip Holland, Irish engineer, designed the HMS Holland 1 (b. 1840)\n*1918 – William Thompson, American archer (b. 1848)\n*1921 – Pyotr Boborykin, Russian playwright and journalist (b. 1836)\n*1922 – Arthur Griffith, Irish journalist and politician, 3rd President of Dáil Éireann (b. 1871)\n*1924 – Sándor Bródy, Hungarian journalist and author (b. 1863)\n*1928 – Leoš Janáček, Czech composer and educator (b. 1854)\n*1934 – Hendrik Petrus Berlage, Dutch architect, designed the Beurs van Berlage (b. 1856)\n*1935 – Friedrich Schottky, German mathematician and academic (b. 1851)\n*1940 – Nikolai Triik, Estonian painter, illustrator, and academic (b. 1884) \n*1941 – Freeman Freeman-Thomas, 1st Marquess of Willingdon, English soldier and politician, 56th Governor General of Canada (b. 1866)\n*  1941   – Bobby Peel, English cricketer and umpire (b. 1857)\n*1943 – Vittorio Sella, Italian photographer and mountaineer (b. 1859)\n*1944 – Joseph P. Kennedy Jr., American lieutenant and pilot (b. 1915)\n*1952 – David Bergelson, Ukrainian author and playwright (b. 1884)\n*1955 – Thomas Mann, German author and critic, Nobel Prize laureate (b. 1875)\n*  1955   – James B. Sumner, American chemist and academic, Nobel Prize laureate (b. 1887)\n*1959 – Mike O'Neill, Irish-American baseball player and manager (b. 1877)\n*1964 – Ian Fleming, English spy, journalist, and author (b. 1908)\n*1966 – Artur Alliksaar, Estonian poet and author (b. 1923)\n*1967 – Esther Forbes, American historian and author (b. 1891)\n*1973 – Walter Rudolf Hess, Swiss physiologist and academic, Nobel Prize laureate (b. 1881)\n*  1973   – Karl Ziegler, German chemist and engineer, Nobel Prize laureate (b. 1898)\n*1978 – John Williams, English motorcycle racer (b. 1946)\n*1979 – Ernst Boris Chain, German-Irish biochemist and academic, Nobel Prize laureate (b. 1906)\n*1982 – Henry Fonda, American actor (b. 1905)\n*  1982   – Salvador Sánchez, Mexican boxer (b. 1959)\n*1983 – Theodor Burchardi, German admiral (b. 1892)\n*1985 – Kyu Sakamoto, Japanese singer-songwriter (b. 1941)\n*  1985   – Manfred Winkelhock, German race car driver (b. 1951)\n*1986 – Evaline Ness, American author and illustrator (b. 1911)\n*1988 – Jean-Michel Basquiat, American painter (b. 1960)\n*1989 – William Shockley, American physicist and academic, Nobel Prize laureate (b. 1910)\n*1990 – Dorothy Mackaill, English-American actress (b. 1903)\n*1992 – John Cage, American composer and theorist (b. 1912)\n*1996 – Victor Ambartsumian, Georgian-Armenian astrophysicist and academic (b. 1908)\n*  1996   – Mark Gruenwald, American author and illustrator (b. 1953)\n*1997 – Jack Delano, American photographer and composer (b. 1914)\n*1999 – Jean Drapeau, Canadian lawyer and politician, 37th Mayor of Montreal (b. 1916)\n*2000 – Gennady Lyachin, Russian captain (b. 1955)\n*  2000   – Loretta Young, American actress (b. 1913)\n*2002 – Enos Slaughter, American baseball player and manager (b. 1916)\n*2004 – Godfrey Hounsfield, English biophysicist and engineer, Nobel Prize laureate (b. 1919)\n*2005 – John Loder, English sound engineer and producer, founded Southern Studios (b. 1946)\n*2006 – Victoria Gray Adams, American civil rights activist (b. 1926)\n*2007 – Merv Griffin, American actor, singer, and producer, created Jeopardy! and Wheel of Fortune (b. 1925)\n*  2007   – Mike Wieringo, American author and illustrator (b. 1963)\n*2008 – Christie Allen, English-Australian singer (b. 1954)\n*  2008   – Helge Hagerup, Norwegian playwright, poet and novelist (b. 1933)\n*2009 – Les Paul, American guitarist and songwriter (b. 1915)\n*2010 – Isaac Bonewits, American Druid, author, and activist; founded Ár nDraíocht Féin (b. 1949)\n*  2010   – Guido de Marco, Maltese lawyer and politician, 6th President of Malta (b. 1931)\n*  2010   – Richie Hayward, American drummer and songwriter (b. 1946)\n*  2010   – André Kim, South Korean fashion designer (b. 1935)\n*2011 – Robert Robinson, English journalist and author (b. 1927)\n*2012 – Jimmy Carr, American football player and coach (b. 1933) \n*  2012   – Jerry Grant, American race car driver (b. 1935)\n*  2012   – Joe Kubert, Polish-American illustrator, founded The Kubert School (b. 1926)\n*  2012   – Édgar Morales Pérez, Mexican engineer and politician\n*  2012   – Alf Morris, English politician and activist (b. 1928)\n*2013 – Tereza de Arriaga, Portuguese painter (b. 1915)\n*  2013   – Hans-Ekkehard Bob, German soldier and pilot (b. 1917)\n*  2013   – Pauline Maier, American historian and academic (b. 1938)\n*  2013   – David McLetchie, Scottish lawyer and politician (b. 1952)\n*  2013   – Vasiliy Mihaylovich Peskov, Russian ecologist and journalist (b. 1930)\n*2014 – Lauren Bacall, American model, actress, and singer (b. 1924)\n*  2014   – Futatsuryū Jun'ichi, Japanese sumo wrestler (b. 1950)\n*  2014   – Kongō Masahiro, Japanese sumo wrestler (b. 1948)\n*2015 – Jaakko Hintikka, Finnish philosopher and academic (b. 1929)\n*  2015   – Stephen Lewis, English actor and screenwriter (b. 1926)\n*  2015   – Meshulim Feish Lowy, Hungarian-Canadian rabbi and author (b. 1921)\n*  2015   – John Scott, English organist and conductor (b. 1956)\n*2016 – Juan Pedro de Miguel, Spanish handball player (b. 1958)\n*2017 – Bryan Murray, Canadian ice hockey coach (b. 1942)\n\nHolidays and observances\n\n* Christian feast day:\n** Euplius\n** Eusebius of Milan\n** Herculanus of Brescia\n** Pope Innocent XI\n** Jænberht\n** Jane Frances de Chantal \n** Muiredach (or Murtagh)\n** Porcarius\n** August 12 (Eastern Orthodox liturgics)\n* Glorious Twelfth (United Kingdom)\n* HM the Queen's Birthday and National Mother's Day (Thailand)\n* International Youth Day (United Nations)\n* Russian Air Force Day (Russia)\n* Russian Railway Troops Day (Russia)\n* Sea Org Day (Scientology)\n* World Elephant Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "August 12" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1491" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "It is the peak of the Perseid meteor shower. It is also known as the \"Glorious Twelfth\" in the United Kingdom, as it marks the traditional start of the grouse shooting season.\n\nEvents\n\n*1099 – First Crusade: Battle of Ascalon Crusaders under the command of Godfrey of Bouillon defeat Fatimid forces led by Al-Afdal Shahanshah. This is considered the last engagement of the First Crusade.\n*1121 – Battle of Didgori: The Georgian army under King David IV wins a decisive victory over the famous Seljuk commander Ilghazi.\n*1164 – Battle of Harim: Nur ad-Din Zangi defeats the Crusader armies of the County of Tripoli and the Principality of Antioch.\n*1323 – Signature of the Treaty of Nöteborg between Sweden and Novgorod Republic, that regulates the border between the two countries for the first time.\n*1492 – Christopher Columbus arrives in the Canary Islands on his first voyage to the New World.\n*1499 – First engagement of the Battle of Zonchio between Venetian and Ottoman fleets.\n*1624 – The president of Louis XIII of France's royal council is arrested, leaving Cardinal Richelieu in the role of the King's principal minister.\n*1676 – Praying Indian John Alderman shoots and kills Metacomet, the Wampanoag war chief, ending King Philip's War.\n*1687 – Battle of Mohács: Charles of Lorraine defeats the Ottoman Empire.\n*1765 – Treaty of Allahabad is signed. The Treaty marks the political and constitutional involvement and the beginning of Company rule in India.\n*1793 – The Rhône and Loire départments are created when the former département of Rhône-et-Loire is split into two.\n*1806 – Santiago de Liniers, 1st Count of Buenos Aires re-takes the city of Buenos Aires, Argentina after the first British invasion.\n*1831 – French intervention forces William I of the Netherlands to abandon his attempt to suppress the Belgian Revolution.\n*1851 – Isaac Singer is granted a patent for his sewing machine.\n*1865 – Joseph Lister, British surgeon and scientist,  performs 1st antiseptic surgery.\n*1883 – The last quagga dies at the Natura Artis Magistra, a zoo in Amsterdam, Netherlands.\n*1898 – The Hawaiian flag is lowered from ʻIolani Palace in an elaborate annexation ceremony and replaced with the flag of the United States to signify the transfer of sovereignty from the Republic of Hawaii to the United States.\n*1914 – World War I: The United Kingdom declares war on Austria-Hungary; the countries of the British Empire follow suit.\n*  1914   – World War I: The Battle of Halen a.k.a. Battle of the Silver Helmets a clash between large Belgian and German cavalry formations at Halen, Belgium.\n*1944 – Waffen-SS troops massacre 560 people in Sant'Anna di Stazzema.\n*  1944   – Nazi German troops end the week-long Wola massacre, during which time at least 40,000 people were killed indiscriminately or in mass executions.\n*  1944   – Alençon is liberated by General Philippe Leclerc de Hauteclocque, the first city in France to be liberated from the Nazis by French forces.\n*1950 – Korean War: Bloody Gulch massacre: American POWs are massacred by North Korean Army.\n*1952 – The Night of the Murdered Poets: Thirteen prominent Jewish intellectuals are murdered in Moscow, Russia, Soviet Union.\n*1953 – The first testing of a real thermonuclear weapon (not test devices): The Soviet atomic bomb project continues with the detonation of \"RDS-6s\" (Joe 4), the first Soviet thermonuclear bomb.\n*  1953   – The 7.2  Ionian earthquake shakes the southern Ionian Islands with a maximum Mercalli intensity of X (Extreme). Between 445 and 800 people were killed.\n*1960 – Echo 1A, NASA's first successful communications satellite, is launched.\n*1964 – South Africa is banned from the Olympic Games due to the country's racist policies.\n*1969 – Violence erupts after the Apprentice Boys of Derry march in Derry, Northern Ireland, resulting in a three-day communal riot known as the Battle of the Bogside.\n*1976 – Between 1,000 and 3,500 Palestinians are killed in the Tel al-Zaatar massacre, one of the bloodiest events of the Lebanese Civil War\n*1977 – The first free flight of the .\n*  1977   – The Sri Lanka Riots:, targeting the minority Sri Lankan Tamils, begin, less than a month after the United National Party came to power. Over 300 Tamils are killed.\n*1981 – The IBM Personal Computer is released.\n*1985 – Japan Airlines Flight 123 crashes into Osutaka ridge in Gunma Prefecture, Japan, killing 520, to become the worst single-plane air disaster.\n*1990 – Sue, the largest and most complete Tyrannosaurus Rex skeleton found to date, is discovered by Sue Hendrickson in South Dakota.\n*1992 – Canada, Mexico and the United States announce completion of negotiations for the North American Free Trade Agreement (NAFTA).\n*1994 – Major League Baseball players go on strike, forcing the cancellation of the 1994 World Series.\n*2000 – The Russian Navy submarine  explodes and sinks in the Barents Sea during a military exercise, killing her entire 118-man crew.\n*2015 – At least two massive explosions kill 173 people and injure nearly 800 more in Tianjin, China.\n\nBirths\n\n*1452 – Abraham Zacuto, Jewish astronomer, astrologer, mathematician, rabbi and historian (d. 1515)\n*1503 – Christian III of Denmark (d. 1559)\n*1506 – Franciscus Sonnius, Dutch counter-Reformation theologian (d. 1576)\n*1591 – Louise de Marillac, co-founder of the Daughters of Charity (d. 1660)\n*1599 – Sir William Curtius FRS, German magistrate, English baronet (d. 1678).\n*1604 – Tokugawa Iemitsu, Japanese shogun (d. 1651)\n*1626 – Giovanni Legrenzi, Italian composer (d. 1690)\n*1629 – Archduchess Isabella Clara of Austria, Austrian archduchess (d. 1685)\n*1644 – Heinrich Ignaz Franz Biber, Bohemian-Austrian violinist and composer (d. 1704)\n*1686 – John Balguy, English philosopher and author (d. 1748)\n*1696 – Maurice Greene, English organist and composer (d. 1755)\n*1762 – George IV of the United Kingdom (d. 1830)\n*1773 – Karl Faber, Prussian historian and academic (d. 1853)\n*1774 – Robert Southey, English poet and author (d. 1843)\n*1831 – Helena Blavatsky, Russian theosophist and scholar (d. 1891)\n*1852 – Michael J. McGivney, American priest, founded the Knights of Columbus (d. 1890)\n*1856 – Diamond Jim Brady, American businessman and philanthropist (d. 1917)\n*1857 – Ernestine von Kirchsberg, Austrian painter and educator (d. 1924)\n*1859 – Katharine Lee Bates, American poet and author (d. 1929)\n*1860 – Klara Hitler, Austrian mother of Adolf Hitler (d. 1907)\n*1866 – Jacinto Benavente, Spanish playwright, Nobel Prize laureate (d. 1954)\n*  1866   – Henrik Sillem, Dutch target shooter, mountaineer, and jurist (d. 1907)\n*1867 – Edith Hamilton, German-American author and educator (d. 1963)\n*1870 – Henry Reuterdahl, Swedish-American artist (d. 1925)\n*1871 – Gustavs Zemgals, Latvian politician, 2nd President of Latvia (d. 1939)\n*1876 – Mary Roberts Rinehart, American author and playwright (d. 1958)\n*1877 – Albert Bartha, Hungarian general and politician, Hungarian Minister of Defence (d. 1960)\n*1880 – Radclyffe Hall, English poet, author, and activist (d. 1943)\n*  1880   – Christy Mathewson, American baseball player and manager (d. 1925)\n*1881 – Cecil B. DeMille, American director and producer (d. 1959)\n*1883 – Martha Hedman, Swedish-American actress and playwright (d. 1974)\n*  1883   – Marion Lorne, American actress (d. 1968)\n*1885 – Jean Cabannes, French physicist and academic (d. 1959)\n*  1885   – Keith Murdoch, Australian journalist (d. 1952)\n*  1885   – Juhan Simm, Estonian composer and conductor (d. 1959)\n*1887 – Erwin Schrödinger, Austrian physicist and academic, Nobel Prize laureate (d. 1961)\n*1889 – Zerna Sharp, American author and educator (d. 1981)\n*1891 – C. E. M. Joad, English philosopher and academic (d. 1953)\n*  1891   – John McDermott, American golfer (d. 1971)\n*1892 – Alfred Lunt, American actor and director (d. 1977)\n*1897 – Maurice Fernandes, Guyanese cricketer (d. 1981)\n*1899 – Ben Sealey, Trinidadian cricketer (d. 1963)\n*1902 – Mohammad Hatta, Indonesian politician, 1st Vice President of Indonesia (d. 1980)\n*1904 – Idel Jakobson, Latvian-Estonian NKVD officer (d. 1997)\n*  1904   – Tamás Lossonczy, Hungarian painter (d. 2009)\n*  1904   – Alexei Nikolaevich, Tsarevich of Russia (d. 1918)\n*1906 – Harry Hopman, Australian tennis player and coach (d. 1985)\n*  1906   – Tedd Pierce, American animator, producer, and screenwriter (d. 1972)\n*1907 – Gladys Bentley, American blues singer (d. 1960)\n*  1907   – Joe Besser, American actor (d. 1988)\n*  1907   – Boy Charlton, Australian swimmer (d. 1975)\n*  1907   – Benjamin Sheares, Singaporean physician and politician, 2nd President of Singapore (d. 1981)\n*1909 – Bruce Matthews, Canadian general and businessman (d. 1991)\n*1910 – Yusof bin Ishak, Singaporean journalist and politician, 1st President of Singapore (d. 1970)\n*  1910   – Jane Wyatt, American actress (d. 2006)\n*1911 – Cantinflas, Mexican actor, screenwriter, and producer (d. 1993)\n*1912 – Samuel Fuller, American actor, director, and screenwriter (d. 1997)\n*1913 – Richard L. Bare, American director, producer, and screenwriter (d. 2015)\n*1914 – Gerd Buchdahl, German-English philosopher and author (d. 2001)\n*  1914   – Ruth Lowe, Canadian pianist and songwriter (d. 1981)\n*1915 – Michael Kidd, American dancer and choreographer (d. 2007)\n*1916 – Ioan Dicezare, Romanian general and pilot (d. 2012)\n*  1916   – Edward Pinkowski, American writer, journalist and Polonia historian  \n*1917 – Oliver Crawford, American screenwriter and author (d. 2008)\n*1918 – Sid Bernstein, American record producer (d. 2013)\n*  1918   – Guy Gibson, Anglo-Indian commander and pilot, Victoria Cross recipient (d. 1944)\n*1919 – Margaret Burbidge, English-American astrophysicist and academic\n*  1919   – Vikram Sarabhai, Indian physicist and academic (d. 1971)\n*1920 – Charles Gibson, American ethnohistorian (d. 1985)\n*  1920   – Percy Mayfield, American R&B singer-songwriter (d. 1984)\n*1922 – Fulton Mackay, Scottish actor and playwright (d. 1987)\n*  1922   – Miloš Jakeš, Czech communist politician\n*1923 – John Holt, Jamaican cricketer (d. 1997)\n*1924 – Derek Shackleton, English cricketer, coach, and umpire (d. 2007)\n*  1924   – Muhammad Zia-ul-Haq, Pakistani general and politician, 6th President of Pakistan (d. 1988)\n*1925 – Dale Bumpers, American soldier, lawyer, and politician, 38th Governor of Arkansas (d. 2016)\n*  1925   – Guillermo Cano Isaza, Colombian journalist (d. 1986)\n*  1925   – Donald Justice, American poet and writing teacher (d. 2004)\n*  1925   – Norris McWhirter, Scottish publisher and activist co-founded the Guinness World Records (d. 2004)\n*  1925   – Ross McWhirter, Scottish publisher and activist, co-founded the Guinness World Records (d. 1975)\n*  1925   – George Wetherill, American physicist and academic (d. 2006)\n*1926 – John Derek, American actor, director, and cinematographer (d. 1998)\n*  1926   – Joe Jones, American R&B singer-songwriter and producer (d. 2005)\n*1927 – Porter Wagoner, American singer-songwriter and guitarist (d. 2007)\n*1928 – Charles Blackman, Australian painter and illustrator\n*  1928   – Bob Buhl, American baseball player (d. 2001)\n*  1928   – Dan Curtis, American director and producer (d. 2006)\n*1929 – Buck Owens, American singer-songwriter and guitarist (d. 2006)\n*1930 – George Soros, Hungarian-American businessman and investor, founded the Soros Fund Management\n*  1930   – Kanagaratnam Sriskandan, Sri Lankan engineer and civil servant (d. 2010)\n*  1930   – Jacques Tits, Belgian-French mathematician and academic\n*1931 – William Goldman, American author, playwright, and screenwriter\n*1932 – Dallin H. Oaks, American lawyer, jurist, and religious leader\n*  1932   – Charlie O'Donnell, American radio and television announcer (d. 2010)\n*  1932   – Sirikit, Queen mother of Thailand\n*1933 – Parnelli Jones, American race car driver and businessman\n*  1933   – Frederic Lindsay, Scottish author and educator (d. 2013)\n*1934 – Robin Nicholson, English metallurgist and academic\n*1935 – John Cazale, American actor (d. 1978)\n*1936 – Kjell Grede, Swedish director and screenwriter (d. 2017)\n*1937 – Walter Dean Myers, American author and poet (d. 2014)\n*1938 – Jean-Paul L'Allier, Canadian journalist and politician, 38th Mayor of Quebec City (d. 2016)\n*1939 – George Hamilton, American actor \n*  1939   – Pam Kilborn, Australian track and field athlete\n*  1939   – David King, South African chemist and academic\n*  1939   – Sushil Koirala, Nepalese politician, 37th Prime Minister of Nepal (d. 2016)\n*  1939   – Roy Romanow, Canadian lawyer and politician, 12th Premier of Saskatchewan\n*1940 – Eddie Barlow, South African cricketer and coach (d. 2005)\n*1941 – L. M. Kit Carson, American actor, producer, and screenwriter (d. 2014)\n*  1941   – Réjean Ducharme, Canadian author and playwright\n*  1941   – Dana Ivey, American actress\n*1942 – Hans-Wilhelm Müller-Wohlfahrt, German physician and author\n*1945 – Dorothy E. Denning, American computer scientist and academic\n*  1945   – Ron Mael, American keyboard player and songwriter \n*1946 – Terry Nutkins, English television host and author (d. 2012)\n*1948 – Siddaramaiah, Indian lawyer and politician, 22nd Chief Minister of Karnataka\n*  1948   – Graham J. Zellick, English academic and jurist\n*1949 – Panagiotis Chinofotis, Greek admiral and politician\n*  1949   – Mark Knopfler, Scottish-English singer-songwriter, guitarist, and producer \n*  1949   – Lou Martin, Northern Irish pianist, songwriter, and producer (d. 2012)\n*  1949   – Alex Naumik, Lithuanian-Norwegian singer-songwriter and producer (d. 2013)\n*  1949   – Rick Ridgeway, American mountaineer and photographer\n*1950 – Jim Beaver, American actor, director, and screenwriter\n*  1950   – August \"Kid Creole\" Darnell, American musician, bandleader, singer-songwriter, and record producer\n*1951 – Klaus Toppmöller, German football manager and former player \n*1952 – Daniel Biles, American associate justice of the Kansas Supreme Court \n*1954 – Rob Borbidge, Australian politician, 35th Premier of Queensland \n*  1954   – Leung Chun-ying, Hong Kong businessman and politician, 3rd Chief Executive of Hong Kong\n*  1954   – Ibolya Dávid, Hungarian lawyer and politician, Minister of Justice of Hungary\n*  1954   – François Hollande, French lawyer and politician, 24th President of France\n*  1954   – Pat Metheny, American jazz guitarist and composer\n*1956 – Lee Freedman, Australian horse trainer\n*  1956   – Bruce Greenwood, Canadian actor and producer\n*  1956   – Sidath Wettimuny, Sri Lankan cricketer\n*1957 – Friedhelm Schütte, German footballer\n*1958 – Jürgen Dehmel, German bass player and songwriter \n*1959 – Kerry Boustead, Australian rugby league player\n*  1959   – Amanda Redman, English actress\n*1960 – Laurent Fignon, French cyclist and sportscaster (d. 2010)\n*  1960   – Greg Thomas, Welsh-English cricketer\n*1961 – Roy Hay, English guitarist, keyboard player, and composer \n*  1961   – Mark Priest, New Zealand cricketer\n*1963 – Kōji Kitao, Japanese sumo wrestler, the 60th Yokozuna\n*  1963   – Campbell Newman, Australian politician, 38th Premier of Queensland\n*  1963   – Sir Mix-a-Lot, American rapper, producer, and actor\n*1964 – Txiki Begiristain, Spanish footballer\n*  1964   – Michael Hagan, Australian rugby league player and coach\n*1965 – Peter Krause, American actor \n*1966 – Tobias Ellwood, American-English captain and politician\n*1967 – Andy Hui, Hong Kong singer-songwriter and actor \n*  1967   – Andrey Plotnikov, Russian race walker\n*  1967   – Regilio Tuur, Dutch boxer\n*1968 – Thorsten Boer, German footballer and manager\n*  1968   – Ülar Mark, Estonian architect\n*1969 – Aga Muhlach, Filipino actor and politician\n*  1969   – Stuart Williams, Nevisian cricketer\n*1970 – Aleksandar Đurić, Bosnian footballer\n*  1970   – Charles Mesure, English-Australian actor and screenwriter\n*  1970   – Toby Perkins, English businessman and politician\n*  1970   – Jim Schlossnagle, American baseball player and coach\n*  1970   – Anthony Swofford, American soldier and author\n*1971 – Michael Ian Black, American comedian, actor, director, producer, and screenwriter\n*  1971   – Rebecca Gayheart, American actress\n*  1971   – Pete Sampras, American tennis player\n*1972 – Demir Demirkan, Turkish singer-songwriter and producer\n*  1972   – Mark Kinsella, Irish footballer and manager   \n*  1972   – Takanohana Kōji, Japanese sumo wrestler, the 65th Yokozuna\n*  1972   – Gyanendra Pandey, Indian cricketer\n*1973 – Jonathan Coachman, American basketball player, wrestler, and sportscaster\n*  1973   – Mark Iuliano, Italian footballer and manager\n*  1973   – Todd Marchant, American ice hockey player and coach\n*1974 – Matt Clement, American baseball player and coach\n*  1974   – Karl Stefanovic, Australian television host \n*1975 – Casey Affleck, American actor\n*1976 – Pedro Collins, Barbadian cricketer\n*  1976   – Mikko Lindström, Finnish guitarist \n*  1976   – Henry Tuilagi, Samoan rugby player\n*  1976   – Antoine Walker, American basketball player \n*1977 – Plaxico Burress, American football player\n*  1977   – Jesper Grønkjær, Danish footballer\n*1978 – Chris Chambers, American football player\n*  1978   – Hayley Wickenheiser, Canadian ice hockey player\n*1979 – D. J. Houlton, American baseball player\n*  1979   – Ian Hutchinson, English motorcycle racer\n*  1979   – Cindy Klassen, Canadian speed skater\n*  1979   – Austra Skujytė, Lithuanian pentathlete\n*1980 – Javier Chevantón, Uruguayan footballer\n*  1980   – Maggie Lawson, American actress\n*  1980   – Dominique Swain, American actress\n*  1980   – Matt Thiessen, Canadian-American singer-songwriter and guitarist \n*1981 – Tony Capaldi, Norwegian-Northern Irish footballer\n*  1981   – Djibril Cissé, French footballer\n*1982 – Boban Grnčarov, Macedonian footballer\n*  1982   – Alexandros Tzorvas, Greek footballer\n*1983 – Klaas-Jan Huntelaar, Dutch footballer\n*  1983   – Kléber Giacomance de Souza Freitas, Brazilian footballer\n*  1983   – Manoa Vosawai, Italian rugby player\n*1984 – Bryan Pata, American football player (d. 2006)\n*1985 – Danny Graham, English footballer\n*  1985   – Franck Moutsinga, German rugby player\n*1986 – Andrei Agius, Maltese footballer\n*  1986   – Kyle Arrington, American football player\n*1987 – Vanessa Watts, West Indian cricketer\n*1988 – Tyson Fury, English boxer\n*  1988   – Matt Gillett, Australian rugby league player\n*1989 – Tom Cleverley, English footballer\n*  1989   – Hong Jeong-ho, South Korean footballer\n*  1989   – Sunye, South Korean singer\n*1990 – Mario Balotelli, Italian footballer\n*  1990   – Marvin Zeegelaar, Dutch footballer\n*  1990   – Martin Zurawsky, German footballer\n*1991 – Jesinta Campbell, Australian model\n*  1991   – Sam Hoare, Australian rugby league player\n*1992 – Cara Delevingne, English model and actress\n*  1992   – Isabella Escobar, Guatemalan tennis player\n*  1992   – Jacob Loko, Australian rugby player\n*  1992   – Teo Gheorghiu, Swiss pianist and actor\n*1993 – Ewa Farna, Czech singer-songwriter\n*  1993   – Luna (singer), South Korean singer, actress and presenter\n*1996 – Julio Urías, Mexican baseball player\n*1999 – Matthijs de Ligt, Dutch footballer\n\nDeaths\n\n*30 BC– Cleopatra, Egyptian queen (b. 69 BC)\n* 792 – Jænberht, archbishop of Canterbury\n* 875 – Louis II, Holy Roman Emperor (b. 825)\n* 960 – Li Gu, chancellor of Later Zhou (b. 903)\n* 961 – Yuan Zong, emperor of Southern Tang (b. 916)\n*1222 – Vladislaus III, duke of Bohemia\n*1295 – Charles Martel, king of Hungary (b. 1271)\n*1319 – Rudolf I, duke of Bavaria (b. 1274)\n*1315 – Guy de Beauchamp, 10th Earl of Warwick, English nobleman\n*1335 – Prince Moriyoshi, Japanese shogun (b. 1308)\n*1399 – Demetrius I Starshy, Prince of Trubczewsk (in battle) (b. 1327)\n*1424 – Yongle, emperor of the Ming Empire (b. 1360)\n*1484 – Sixtus IV, pope of the Catholic Church (b. 1414)\n*1546 – Francisco de Vitoria, Spanish theologian (b. 1492)\n*1577 – Thomas Smith, English scholar and diplomat (b. 1513)\n*1588 – Alfonso Ferrabosco the elder, Italian-English composer (b. 1543)\n*1602 – Abu'l-Fazl ibn Mubarak, Mughal vizier and historian (b. 1551)\n*1612 – Giovanni Gabrieli, Italian organist and composer (b. 1557)\n*1638 – Johannes Althusius, German jurist and philosopher (b. 1557)\n*1674 – Philippe de Champaigne, Belgian-French painter and educator (b. 1602)\n*1689 – Pope Innocent XI (b. 1611)\n*1778 – Peregrine Bertie, 3rd Duke of Ancaster and Kesteven, English general and politician, Lord Lieutenant of Lincolnshire (b. 1714)\n*1809 – Mikhail Kamensky, Russian field marshal (b. 1738)\n*1810 – Étienne Louis Geoffroy, French pharmacist and entomologist (b. 1725)\n*1822 – Robert Stewart, Viscount Castlereagh, Irish-English politician, Secretary of State for Foreign Affairs (b. 1769)\n*1827 – William Blake, English poet and painter (b. 1757)\n*1829 – Charles Sapinaud de La Rairie, French general (b. 1760)\n*1848 – George Stephenson, English engineer and academic (b. 1781)\n*1849 – Albert Gallatin, Swiss-American ethnologist, linguist, and politician, 4th United States Secretary of the Treasury (b. 1761)\n*1851 – John Elliot Drinkwater Bethune, British lawyer and activist (b. 1801)\n*1861 – Eliphalet Remington, American inventor and businessman, founded Remington Arms (b. 1793)\n*1864 – Sakuma Shōzan, Japanese scholar and politician (b. 1811)\n*1865 – William Jackson Hooker, English botanist and academic (b. 1785)\n*1891 – James Russell Lowell, American poet and critic (b. 1819)\n*1896 – Thomas Chamberlain, American colonel (b. 1841)\n*1900 – Wilhelm Steinitz, Austrian chess player and theoretician (b. 1836)\n*1901 – Adolf Erik Nordenskiöld, Finnish-Swedish botanist, geologist, mineralogist, and explorer (b. 1832)\n*1904 – William Renshaw, English tennis player (b. 1861)\n*1914 – John Philip Holland, Irish engineer, designed the HMS Holland 1 (b. 1840)\n*1918 – William Thompson, American archer (b. 1848)\n*1921 – Pyotr Boborykin, Russian playwright and journalist (b. 1836)\n*1922 – Arthur Griffith, Irish journalist and politician, 3rd President of Dáil Éireann (b. 1871)\n*1924 – Sándor Bródy, Hungarian journalist and author (b. 1863)\n*1928 – Leoš Janáček, Czech composer and educator (b. 1854)\n*1934 – Hendrik Petrus Berlage, Dutch architect, designed the Beurs van Berlage (b. 1856)\n*1935 – Friedrich Schottky, German mathematician and academic (b. 1851)\n*1940 – Nikolai Triik, Estonian painter, illustrator, and academic (b. 1884) \n*1941 – Freeman Freeman-Thomas, 1st Marquess of Willingdon, English soldier and politician, 56th Governor General of Canada (b. 1866)\n*  1941   – Bobby Peel, English cricketer and umpire (b. 1857)\n*1943 – Vittorio Sella, Italian photographer and mountaineer (b. 1859)\n*1944 – Joseph P. Kennedy Jr., American lieutenant and pilot (b. 1915)\n*1952 – David Bergelson, Ukrainian author and playwright (b. 1884)\n*1955 – Thomas Mann, German author and critic, Nobel Prize laureate (b. 1875)\n*  1955   – James B. Sumner, American chemist and academic, Nobel Prize laureate (b. 1887)\n*1959 – Mike O'Neill, Irish-American baseball player and manager (b. 1877)\n*1964 – Ian Fleming, English spy, journalist, and author (b. 1908)\n*1966 – Artur Alliksaar, Estonian poet and author (b. 1923)\n*1967 – Esther Forbes, American historian and author (b. 1891)\n*1973 – Walter Rudolf Hess, Swiss physiologist and academic, Nobel Prize laureate (b. 1881)\n*  1973   – Karl Ziegler, German chemist and engineer, Nobel Prize laureate (b. 1898)\n*1978 – John Williams, English motorcycle racer (b. 1946)\n*1979 – Ernst Boris Chain, German-Irish biochemist and academic, Nobel Prize laureate (b. 1906)\n*1982 – Henry Fonda, American actor (b. 1905)\n*  1982   – Salvador Sánchez, Mexican boxer (b. 1959)\n*1983 – Theodor Burchardi, German admiral (b. 1892)\n*1985 – Kyu Sakamoto, Japanese singer-songwriter (b. 1941)\n*  1985   – Manfred Winkelhock, German race car driver (b. 1951)\n*1986 – Evaline Ness, American author and illustrator (b. 1911)\n*1988 – Jean-Michel Basquiat, American painter (b. 1960)\n*1989 – William Shockley, American physicist and academic, Nobel Prize laureate (b. 1910)\n*1990 – Dorothy Mackaill, English-American actress (b. 1903)\n*1992 – John Cage, American composer and theorist (b. 1912)\n*1996 – Victor Ambartsumian, Georgian-Armenian astrophysicist and academic (b. 1908)\n*  1996   – Mark Gruenwald, American author and illustrator (b. 1953)\n*1997 – Jack Delano, American photographer and composer (b. 1914)\n*1999 – Jean Drapeau, Canadian lawyer and politician, 37th Mayor of Montreal (b. 1916)\n*2000 – Gennady Lyachin, Russian captain (b. 1955)\n*  2000   – Loretta Young, American actress (b. 1913)\n*2002 – Enos Slaughter, American baseball player and manager (b. 1916)\n*2004 – Godfrey Hounsfield, English biophysicist and engineer, Nobel Prize laureate (b. 1919)\n*2005 – John Loder, English sound engineer and producer, founded Southern Studios (b. 1946)\n*2006 – Victoria Gray Adams, American civil rights activist (b. 1926)\n*2007 – Merv Griffin, American actor, singer, and producer, created Jeopardy! and Wheel of Fortune (b. 1925)\n*  2007   – Mike Wieringo, American author and illustrator (b. 1963)\n*2008 – Christie Allen, English-Australian singer (b. 1954)\n*  2008   – Helge Hagerup, Norwegian playwright, poet and novelist (b. 1933)\n*2009 – Les Paul, American guitarist and songwriter (b. 1915)\n*2010 – Isaac Bonewits, American Druid, author, and activist; founded Ár nDraíocht Féin (b. 1949)\n*  2010   – Guido de Marco, Maltese lawyer and politician, 6th President of Malta (b. 1931)\n*  2010   – Richie Hayward, American drummer and songwriter (b. 1946)\n*  2010   – André Kim, South Korean fashion designer (b. 1935)\n*2011 – Robert Robinson, English journalist and author (b. 1927)\n*2012 – Jimmy Carr, American football player and coach (b. 1933) \n*  2012   – Jerry Grant, American race car driver (b. 1935)\n*  2012   – Joe Kubert, Polish-American illustrator, founded The Kubert School (b. 1926)\n*  2012   – Édgar Morales Pérez, Mexican engineer and politician\n*  2012   – Alf Morris, English politician and activist (b. 1928)\n*2013 – Tereza de Arriaga, Portuguese painter (b. 1915)\n*  2013   – Hans-Ekkehard Bob, German soldier and pilot (b. 1917)\n*  2013   – Pauline Maier, American historian and academic (b. 1938)\n*  2013   – David McLetchie, Scottish lawyer and politician (b. 1952)\n*  2013   – Vasiliy Mihaylovich Peskov, Russian ecologist and journalist (b. 1930)\n*2014 – Lauren Bacall, American model, actress, and singer (b. 1924)\n*  2014   – Futatsuryū Jun'ichi, Japanese sumo wrestler (b. 1950)\n*  2014   – Kongō Masahiro, Japanese sumo wrestler (b. 1948)\n*2015 – Jaakko Hintikka, Finnish philosopher and academic (b. 1929)\n*  2015   – Stephen Lewis, English actor and screenwriter (b. 1926)\n*  2015   – Meshulim Feish Lowy, Hungarian-Canadian rabbi and author (b. 1921)\n*  2015   – John Scott, English organist and conductor (b. 1956)\n*2016 – Juan Pedro de Miguel, Spanish handball player (b. 1958)\n*2017 – Bryan Murray, Canadian ice hockey coach (b. 1942)\n\nHolidays and observances\n\n* Christian feast day:\n** Euplius\n** Eusebius of Milan\n** Herculanus of Brescia\n** Pope Innocent XI\n** Jænberht\n** Jane Frances de Chantal \n** Muiredach (or Murtagh)\n** Porcarius\n** August 12 (Eastern Orthodox liturgics)\n* Glorious Twelfth (United Kingdom)\n* HM the Queen's Birthday and National Mother's Day (Thailand)\n* International Youth Day (United Nations)\n* Russian Air Force Day (Russia)\n* Russian Railway Troops Day (Russia)\n* Sea Org Day (Scientology)\n* World Elephant Day. August 12. http://en.wikipedia.org/?curid=1491."
  }
}
