{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7279",
  "eid" : "e0d25590-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778456937,
  "textBody" : "Chapter 11 is a chapter of Title 11 of the United States Bankruptcy Code, which permits reorganization under the bankruptcy laws of the United States. Chapter 11 bankruptcy is available to every business, whether organized as a corporation, partnership or sole proprietorship, and to individuals, although it is most prominently used by corporate entities. In contrast, Chapter 7 governs the process of a liquidation bankruptcy (although liquidation can go under this chapter), while Chapter 13 provides a reorganization process for the majority of private individuals.\n\nChapter 11 in general\n\nWhen a business is unable to service its debt or pay its creditors, the business or its creditors can file with a federal bankruptcy court for protection under either Chapter 7 or Chapter 11.\n\nIn Chapter 7, the business ceases operations, a trustee sells all of its assets, and then distributes the proceeds to its creditors. Any residual amount is returned to the owners of the company.\n\nIn Chapter 11, in most instances the debtor remains in control of its business operations as a debtor in possession, and is subject to the oversight and jurisdiction of the court.Joseph Swanson and Peter Marshall, Houlihan Lokey and Lyndon Norley, Kirkland & Ellis International LLP (2008). A Practitioner's Guide to Corporate Restructuring. City & Financial Publishing, 1st edition \n\nFeatures of Chapter 11 reorganization\n\nChapter 11 retains many of the features present in all, or most, bankruptcy proceedings in the U.S. It provides additional tools for debtors as well. Most importantly,  empowers the trustee to operate the debtor's business. In Chapter 11, unless a separate trustee is appointed for cause, the debtor, as debtor in possession, acts as trustee of the business.\n\nChapter 11 affords the debtor in possession a number of mechanisms to restructure its business. A debtor in possession can acquire financing and loans on favorable terms by giving new lenders first priority on the business's earnings. The court may also permit the debtor in possession to reject and cancel contracts. Debtors are also protected from other litigation against the business through the imposition of an automatic stay. While the automatic stay is in place, creditors are stayed from any collection attempts or activities against the debtor in possession, and most litigation against the debtor is stayed, or put on hold, until it can be resolved in bankruptcy court, or resumed in its original venue.  An example of proceedings that are not necessarily stayed automatically are family law proceedings against a spouse or parent.  Further, creditors may file with the court seeking relief from the automatic stay.\n\nIf the business is insolvent, its debts exceed its assets and the business is unable to pay debts as they come due, the bankruptcy restructuring may result in the company's owners being left with nothing; instead, the owners' rights and interests are ended and the company's creditors are left with ownership of the newly reorganized company.\n\nAll creditors are entitled to be heard by the court.1 U.S.C. Sec. 1109 (b) The court is ultimately responsible for determining whether the proposed plan of reorganization complies with the bankruptcy law.\n\nOne controversy that has broken out in bankruptcy courts concerns the proper amount of disclosure that the court and other parties are entitled to receive from the members of the ad hoc creditor's committees that play a large role in many such proceedings.\n\nChapter 11 plan\n\nChapter 11 usually results in reorganization of the debtor's business or personal assets and debts, but can also be used as a mechanism for liquidation. Debtors may \"emerge\" from a chapter 11 bankruptcy within a few months or within several years, depending on the size and complexity of the bankruptcy. The Bankruptcy Code accomplishes this objective through the use of a bankruptcy plan. The debtor in possession typically has the first opportunity to propose a plan during the period of exclusivity. This period allows the debtor 120 days from the date of filing for chapter 11, to propose a plan of reorganization before any other party in interest may propose a plan. If the debtor proposes a plan within the 120-day exclusivity period, a 180-day exclusivity period from the date of filing for chapter 11 is granted in order to allow the debtor to gain confirmation of the proposed plan.  With some exceptions, the plan may be proposed by any party in interest. Interested creditors then vote for a plan.\n\nConfirmation\n\nIf the judge approves the reorganization plan and if the creditors all agree the plan can be confirmed.  If at least one class of creditors votes against the plan and thus objects, the plan may nonetheless be confirmed if the requirements of cramdown are met.  In order to be confirmed over their objection the plan must not discriminate against that class of creditors, and the plan must be found fair and equitable to that class.\n\nUpon its confirmation, the plan becomes binding and identifies the treatment of debts and operations of the business for the duration of the plan.\n\nIf a plan cannot be confirmed, the court may either convert the case to a liquidation under chapter 7, or, if in the best interests of the creditors and the estate, the case may be dismissed resulting in a return to the status quo before bankruptcy. If the case is dismissed, creditors will look to non-bankruptcy law in order to satisfy their claims.\n\nAutomatic stay\n\nLike other forms of bankruptcy, petitions filed under chapter 11 invoke the automatic stay of [http://www.bknevada.com/index.php/chapter-3-case-administration/subchapter-iv-administrative-powers/362-automatic-stay § 362]. The automatic stay requires all creditors to cease collection attempts, and makes many post-petition debt collection efforts void or voidable. Under some circumstances, some creditors, otherwise the United States Trustee can request for the court converting the case into a liquidation under chapter 7, or appointing a trustee to manage the debtor's business. The court will grant a motion to convert to chapter 7 or appoint a trustee if either of these actions is in the best interest of all creditors. Sometimes a company will liquidate under chapter 11, in which the pre-existing management may be able to help get a higher price for divisions or other assets than a chapter 7 liquidation would be likely to achieve. Appointment of a trustee requires some wrongdoing or gross mismanagement on the part of existing management and is relatively rare.\n\nExecutory contracts\n\nSome contracts, known as executory contracts, may be rejected if canceling them would be financially favorable to the company and its creditors. Such contracts may include labor union contracts, supply or operating contracts (with both vendors and customers), and real estate leases. The standard feature of executory contracts is that each party to the contract has duties remaining under the contract. In the event of a rejection, the remaining parties to the contract become unsecured creditors of the debtor. For example, in some districts a contract for deed is an executory contract, while in others it is not.\n\nIn the new millennium airlines have fallen under intense scrutiny for what many see as abusing Chapter 11 Bankruptcy as a simple tool for escaping labor contracts, usually 30-35% of an airline's operating cost. Every major US airline has filed for Chapter 11 since 2002. In the space of 2 years (2002 - 2004) US. Airways filed for bankruptcy twice  leaving the AFL-CIO, pilot unions and other airline employees claiming the rules of Chapter 11 have helped turn the USA into a corporatocracy.\n\nPriority\n\nChapter 11 follows the same priority scheme as other bankruptcy chapters. The priority structure is defined primarily by § 507 of the Bankruptcy Code (.)\n\nAs a general rule, administrative expenses (the actual, necessary expenses of preserving the bankruptcy estate, including expenses such as employee wages, and the cost of litigating the chapter 11 case)are paid first. Secured creditors—creditors who have a security interest, or collateral, in the debtor's property—will be paid before unsecured creditors. Unsecured creditors' claims are prioritized by § 507. For instance the claims of suppliers of products or employees of a company may be paid before other unsecured creditors are paid. Each priority level must be paid in full before the next lowest priority level may receive payment.\n\nSection 1110\n\nSection 1110 () generally provides a secured party with an interest in an aircraft the ability to take possession of the equipment within 60 days after a bankruptcy filing unless the airline cures all defaults. More specifically, the right of the lender to take possession of the secured equipment is not hampered by the automatic stay provisions of the U.S. Bankruptcy Code.\n\nStock\n\nIf the company's stock is publicly traded, a Chapter 11 filing generally causes it to be delisted from its primary stock exchange if listed on the New York Stock Exchange, the American Stock Exchange, or the NASDAQ. On the NASDAQ the identifying fifth letter \"Q\" at the end of a stock symbol indicates the company is in bankruptcy (formerly the \"Q\" was placed in front of the pre-existing stock symbol; a celebrated example was Penn Central, whose symbol was originally \"PC\" and became \"QPC\" after the company filed Chapter 11 in 1970). Many stocks that are delisted quickly resume listing as over-the-counter (OTC) stocks. Actual share value does not reach zero unless the probability of restructuring is so low that a Chapter 7 filing is sure to follow.\n\nIndividuals may file Chapter 11, but due to the complexity and expense of the proceeding, this option is rarely chosen by debtors who are eligible for Chapter 7 or Chapter 13 relief.\n\nRationale\n\nIn enacting Chapter 11 of the Bankruptcy code, Congress concluded that it is sometimes the case that the value of a business is greater if sold or reorganized as a going concern than the value of the sum of its parts if the business's assets were to be sold off individually. It follows that it may be more economically efficient to allow a troubled company to continue running, cancel some of its debts, and give ownership of the newly reorganized company to the creditors whose debts were canceled. Alternatively, the business can be sold as a going concern with the net proceeds of the sale distributed to creditors ratably in accordance with statutory priorities. In this way, jobs may be saved, the (previously mismanaged) engine of profitability which is the business is maintained (presumably under better management) rather than being dismantled, and, as a proponent of a chapter 11 plan is required to demonstrate as a precursor to plan confirmation, the business's creditors end up with more money than they would in a Chapter 7 liquidation.\n\nConsiderations\n\nThe reorganization and court process may take an inordinate amount of time, limiting the chances of a successful outcome and sufficient debtor in possession financing may be unavailable during an economic recession. A preplanned, preagreed approach between the debtor and its creditors (sometimes called a pre-packaged bankruptcy) may facilitate the desired result. A company undergoing Chapter 11 reorganization is effectively operating under the \"protection\" of the court until it emerges. An example is the airline industry in the United States; in 2006 over half the industry's seating capacity was on airlines that were in Chapter 11. These airlines were able to stop making debt payments, break their previously agreed upon labor union contracts, freeing up cash to expand routes or weather a price war against competitors — all with the bankruptcy court's approval.\n\nStudies on the impact of forestalling the creditors' rights to enforce their security reach different conclusions.\n\nDeadlines\n\nWithin 60 days of filing for Chapter 11 bankruptcy, the debtor must submit a written disclosure statement with the court containing information on assets, liabilities and business affairs.\n\nStatistics\n\nFrequency\n\nChapter 11 cases dropped by 60% from 1991 to 2003. One 2007 study(January 24, 2007), \"Small Firms Spurn Chapter 11\", Wall Street Journal, page B6B found this was because businesses were turning to bankruptcy-like proceedings under state law, rather than the federal bankruptcy proceedings, including those under chapter 11. Insolvency proceedings under state law, the study stated, are currently faster, less expensive, and more private, with some states not even requiring court filings. However, a 2005 study claimed the drop may have been due to an increase in the incorrect classification of many bankruptcies as \"consumer cases\" rather than \"business cases\".\n\nCases involving more than US$50 million in assets are almost always handled in federal bankruptcy court, and not in bankruptcy-like state proceeding.\n\nLargest cases\n\nThe largest bankruptcy in history was of the US investment bank Lehman Brothers Holdings Inc., which listed $639 billion in assets as of its Chapter 11 filing in 2008. The 16 largest corporate bankruptcies as of 13 December 2011:\n[http://www.bankruptcydata.com Bankruptcydata.com]\n\nEnron, Lehman Brothers, MF Global and Refco have all ceased operations while others were acquired by other buyers or emerged as a new company with a similar name.\n\nThe Enron assets were taken from the 10-Q filed on November 11, 2001. The company announced that the annual financials were under review at the time of filing for Chapter 11.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Chapter 11, Title 11, United States Code" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7279" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Chapter 11 is a chapter of Title 11 of the United States Bankruptcy Code, which permits reorganization under the bankruptcy laws of the United States. Chapter 11 bankruptcy is available to every business, whether organized as a corporation, partnership or sole proprietorship, and to individuals, although it is most prominently used by corporate entities. In contrast, Chapter 7 governs the process of a liquidation bankruptcy (although liquidation can go under this chapter), while Chapter 13 provides a reorganization process for the majority of private individuals.\n\nChapter 11 in general\n\nWhen a business is unable to service its debt or pay its creditors, the business or its creditors can file with a federal bankruptcy court for protection under either Chapter 7 or Chapter 11.\n\nIn Chapter 7, the business ceases operations, a trustee sells all of its assets, and then distributes the proceeds to its creditors. Any residual amount is returned to the owners of the company.\n\nIn Chapter 11, in most instances the debtor remains in control of its business operations as a debtor in possession, and is subject to the oversight and jurisdiction of the court.Joseph Swanson and Peter Marshall, Houlihan Lokey and Lyndon Norley, Kirkland & Ellis International LLP (2008). A Practitioner's Guide to Corporate Restructuring. City & Financial Publishing, 1st edition \n\nFeatures of Chapter 11 reorganization\n\nChapter 11 retains many of the features present in all, or most, bankruptcy proceedings in the U.S. It provides additional tools for debtors as well. Most importantly,  empowers the trustee to operate the debtor's business. In Chapter 11, unless a separate trustee is appointed for cause, the debtor, as debtor in possession, acts as trustee of the business.\n\nChapter 11 affords the debtor in possession a number of mechanisms to restructure its business. A debtor in possession can acquire financing and loans on favorable terms by giving new lenders first priority on the business's earnings. The court may also permit the debtor in possession to reject and cancel contracts. Debtors are also protected from other litigation against the business through the imposition of an automatic stay. While the automatic stay is in place, creditors are stayed from any collection attempts or activities against the debtor in possession, and most litigation against the debtor is stayed, or put on hold, until it can be resolved in bankruptcy court, or resumed in its original venue.  An example of proceedings that are not necessarily stayed automatically are family law proceedings against a spouse or parent.  Further, creditors may file with the court seeking relief from the automatic stay.\n\nIf the business is insolvent, its debts exceed its assets and the business is unable to pay debts as they come due, the bankruptcy restructuring may result in the company's owners being left with nothing; instead, the owners' rights and interests are ended and the company's creditors are left with ownership of the newly reorganized company.\n\nAll creditors are entitled to be heard by the court.1 U.S.C. Sec. 1109 (b) The court is ultimately responsible for determining whether the proposed plan of reorganization complies with the bankruptcy law.\n\nOne controversy that has broken out in bankruptcy courts concerns the proper amount of disclosure that the court and other parties are entitled to receive from the members of the ad hoc creditor's committees that play a large role in many such proceedings.\n\nChapter 11 plan\n\nChapter 11 usually results in reorganization of the debtor's business or personal assets and debts, but can also be used as a mechanism for liquidation. Debtors may \"emerge\" from a chapter 11 bankruptcy within a few months or within several years, depending on the size and complexity of the bankruptcy. The Bankruptcy Code accomplishes this objective through the use of a bankruptcy plan. The debtor in possession typically has the first opportunity to propose a plan during the period of exclusivity. This period allows the debtor 120 days from the date of filing for chapter 11, to propose a plan of reorganization before any other party in interest may propose a plan. If the debtor proposes a plan within the 120-day exclusivity period, a 180-day exclusivity period from the date of filing for chapter 11 is granted in order to allow the debtor to gain confirmation of the proposed plan.  With some exceptions, the plan may be proposed by any party in interest. Interested creditors then vote for a plan.\n\nConfirmation\n\nIf the judge approves the reorganization plan and if the creditors all agree the plan can be confirmed.  If at least one class of creditors votes against the plan and thus objects, the plan may nonetheless be confirmed if the requirements of cramdown are met.  In order to be confirmed over their objection the plan must not discriminate against that class of creditors, and the plan must be found fair and equitable to that class.\n\nUpon its confirmation, the plan becomes binding and identifies the treatment of debts and operations of the business for the duration of the plan.\n\nIf a plan cannot be confirmed, the court may either convert the case to a liquidation under chapter 7, or, if in the best interests of the creditors and the estate, the case may be dismissed resulting in a return to the status quo before bankruptcy. If the case is dismissed, creditors will look to non-bankruptcy law in order to satisfy their claims.\n\nAutomatic stay\n\nLike other forms of bankruptcy, petitions filed under chapter 11 invoke the automatic stay of [http://www.bknevada.com/index.php/chapter-3-case-administration/subchapter-iv-administrative-powers/362-automatic-stay § 362]. The automatic stay requires all creditors to cease collection attempts, and makes many post-petition debt collection efforts void or voidable. Under some circumstances, some creditors, otherwise the United States Trustee can request for the court converting the case into a liquidation under chapter 7, or appointing a trustee to manage the debtor's business. The court will grant a motion to convert to chapter 7 or appoint a trustee if either of these actions is in the best interest of all creditors. Sometimes a company will liquidate under chapter 11, in which the pre-existing management may be able to help get a higher price for divisions or other assets than a chapter 7 liquidation would be likely to achieve. Appointment of a trustee requires some wrongdoing or gross mismanagement on the part of existing management and is relatively rare.\n\nExecutory contracts\n\nSome contracts, known as executory contracts, may be rejected if canceling them would be financially favorable to the company and its creditors. Such contracts may include labor union contracts, supply or operating contracts (with both vendors and customers), and real estate leases. The standard feature of executory contracts is that each party to the contract has duties remaining under the contract. In the event of a rejection, the remaining parties to the contract become unsecured creditors of the debtor. For example, in some districts a contract for deed is an executory contract, while in others it is not.\n\nIn the new millennium airlines have fallen under intense scrutiny for what many see as abusing Chapter 11 Bankruptcy as a simple tool for escaping labor contracts, usually 30-35% of an airline's operating cost. Every major US airline has filed for Chapter 11 since 2002. In the space of 2 years (2002 - 2004) US. Airways filed for bankruptcy twice  leaving the AFL-CIO, pilot unions and other airline employees claiming the rules of Chapter 11 have helped turn the USA into a corporatocracy.\n\nPriority\n\nChapter 11 follows the same priority scheme as other bankruptcy chapters. The priority structure is defined primarily by § 507 of the Bankruptcy Code (.)\n\nAs a general rule, administrative expenses (the actual, necessary expenses of preserving the bankruptcy estate, including expenses such as employee wages, and the cost of litigating the chapter 11 case)are paid first. Secured creditors—creditors who have a security interest, or collateral, in the debtor's property—will be paid before unsecured creditors. Unsecured creditors' claims are prioritized by § 507. For instance the claims of suppliers of products or employees of a company may be paid before other unsecured creditors are paid. Each priority level must be paid in full before the next lowest priority level may receive payment.\n\nSection 1110\n\nSection 1110 () generally provides a secured party with an interest in an aircraft the ability to take possession of the equipment within 60 days after a bankruptcy filing unless the airline cures all defaults. More specifically, the right of the lender to take possession of the secured equipment is not hampered by the automatic stay provisions of the U.S. Bankruptcy Code.\n\nStock\n\nIf the company's stock is publicly traded, a Chapter 11 filing generally causes it to be delisted from its primary stock exchange if listed on the New York Stock Exchange, the American Stock Exchange, or the NASDAQ. On the NASDAQ the identifying fifth letter \"Q\" at the end of a stock symbol indicates the company is in bankruptcy (formerly the \"Q\" was placed in front of the pre-existing stock symbol; a celebrated example was Penn Central, whose symbol was originally \"PC\" and became \"QPC\" after the company filed Chapter 11 in 1970). Many stocks that are delisted quickly resume listing as over-the-counter (OTC) stocks. Actual share value does not reach zero unless the probability of restructuring is so low that a Chapter 7 filing is sure to follow.\n\nIndividuals may file Chapter 11, but due to the complexity and expense of the proceeding, this option is rarely chosen by debtors who are eligible for Chapter 7 or Chapter 13 relief.\n\nRationale\n\nIn enacting Chapter 11 of the Bankruptcy code, Congress concluded that it is sometimes the case that the value of a business is greater if sold or reorganized as a going concern than the value of the sum of its parts if the business's assets were to be sold off individually. It follows that it may be more economically efficient to allow a troubled company to continue running, cancel some of its debts, and give ownership of the newly reorganized company to the creditors whose debts were canceled. Alternatively, the business can be sold as a going concern with the net proceeds of the sale distributed to creditors ratably in accordance with statutory priorities. In this way, jobs may be saved, the (previously mismanaged) engine of profitability which is the business is maintained (presumably under better management) rather than being dismantled, and, as a proponent of a chapter 11 plan is required to demonstrate as a precursor to plan confirmation, the business's creditors end up with more money than they would in a Chapter 7 liquidation.\n\nConsiderations\n\nThe reorganization and court process may take an inordinate amount of time, limiting the chances of a successful outcome and sufficient debtor in possession financing may be unavailable during an economic recession. A preplanned, preagreed approach between the debtor and its creditors (sometimes called a pre-packaged bankruptcy) may facilitate the desired result. A company undergoing Chapter 11 reorganization is effectively operating under the \"protection\" of the court until it emerges. An example is the airline industry in the United States; in 2006 over half the industry's seating capacity was on airlines that were in Chapter 11. These airlines were able to stop making debt payments, break their previously agreed upon labor union contracts, freeing up cash to expand routes or weather a price war against competitors — all with the bankruptcy court's approval.\n\nStudies on the impact of forestalling the creditors' rights to enforce their security reach different conclusions.\n\nDeadlines\n\nWithin 60 days of filing for Chapter 11 bankruptcy, the debtor must submit a written disclosure statement with the court containing information on assets, liabilities and business affairs.\n\nStatistics\n\nFrequency\n\nChapter 11 cases dropped by 60% from 1991 to 2003. One 2007 study(January 24, 2007), \"Small Firms Spurn Chapter 11\", Wall Street Journal, page B6B found this was because businesses were turning to bankruptcy-like proceedings under state law, rather than the federal bankruptcy proceedings, including those under chapter 11. Insolvency proceedings under state law, the study stated, are currently faster, less expensive, and more private, with some states not even requiring court filings. However, a 2005 study claimed the drop may have been due to an increase in the incorrect classification of many bankruptcies as \"consumer cases\" rather than \"business cases\".\n\nCases involving more than US$50 million in assets are almost always handled in federal bankruptcy court, and not in bankruptcy-like state proceeding.\n\nLargest cases\n\nThe largest bankruptcy in history was of the US investment bank Lehman Brothers Holdings Inc., which listed $639 billion in assets as of its Chapter 11 filing in 2008. The 16 largest corporate bankruptcies as of 13 December 2011:\n[http://www.bankruptcydata.com Bankruptcydata.com]\n\nEnron, Lehman Brothers, MF Global and Refco have all ceased operations while others were acquired by other buyers or emerged as a new company with a similar name.\n\nThe Enron assets were taken from the 10-Q filed on November 11, 2001. The company announced that the annual financials were under review at the time of filing for Chapter 11. Chapter 11, Title 11, United States Code. http://en.wikipedia.org/?curid=7279."
  }
}
