{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17135",
  "eid" : "2ab0b440-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778580868,
  "textBody" : "The Kentucky Derby presented by Woodford Reserve is a horse race that is held annually in Louisville, Kentucky, United States, on the first Saturday in May, capping the two-week-long Kentucky Derby Festival. The race is a Grade I stakes race for three-year-old Thoroughbreds at a distance of one and a quarter miles (2 km) at Churchill Downs. Colts and geldings carry 126 lb and fillies 121 lb.[https://web.archive.org/web/20050129145223/http://www.drf.com/sample/pdf/sample_chart.pdf \"Tenth Race Churchill May 1, 2004\"]. May 1, 2004. Daily Racing Forum. Accessed on May 9, 2006.\n\nThe race is known in the United States as \"The Most Exciting Two Minutes In Sports\" or \"The Fastest Two Minutes in Sports\" for its approximate duration, and is also called \"The Run for the Roses\" for the blanket of roses draped over the winner. It is the first leg of the American Triple Crown and is followed by the Preakness Stakes, then the Belmont Stakes. Unlike the Preakness and Belmont Stakes, which took hiatuses in 1891–1893 and 1911–1912, respectively, the Kentucky Derby has been run every consecutive year since 1875. A horse must win all three races to win the Triple Crown. In the 2015 listing of the International Federation of Horseracing Authorities (IFHA), the Kentucky Derby tied with the Whitney Handicap as the top Grade 1 race in the United States outside the Breeders' Cup races.\n\nThe attendance at the Kentucky Derby ranks first in North America and usually surpasses the attendance of all other stakes races including the Preakness Stakes, Belmont Stakes, and the Breeders' Cup.^ 2009 The Original Racing Almanac, page 140 for Kentucky Derby, page 156 for the Preakness Stakes, page 241 for Kentucky Oaks, page 167 for Belmont Stakes, page 184 Breeders' Cup, June 26, 2008.\n\nHistory\n\nIn 1872, Col. Meriwether Lewis Clark, Jr., grandson of William Clark of the Lewis and Clark expedition, traveled to England, visiting Epsom in Surrey where The Derby had been running annually since 1780. From there, Clark went on to Paris, France, where in 1863, a group of racing enthusiasts had formed the French Jockey Club and had organized the Grand Prix de Paris at Longchamp, which at the time was the greatest race in France.\n\nReturning home to Kentucky, Clark organized the Louisville Jockey Club for the purpose of raising money to build quality racing facilities just outside the city. The track would soon become known as Churchill Downs, named for John and Henry Churchill, who provided the land for the racetrack.  Officially, the racetrack was incorporated as Churchill Downs in 1937.\n\nThe Kentucky Derby was first run at , the same distance as the Epsom Derby. The distance was changed in 1896 to its current . On May 17, 1875, in front of an estimated crowd of 10,000 people, a field of 15 three-year-old horses contested the first Derby. Under jockey Oliver Lewis, a colt named Aristides, who was trained by future Hall of Famer Ansel Williamson, won the inaugural Derby. Later that year, Lewis rode Aristides to a second-place finish in the Belmont Stakes.\n\nAlthough the first race meeting proved a success, the track ran into financial difficulties and in 1894 the New Louisville Jockey Club was incorporated with new capitalization and improved facilities. Despite this, the business foundered until 1902 when Col. Matt Winn of Louisville put together a syndicate of businessmen to acquire the facility. Under Winn, Churchill Downs prospered and the Kentucky Derby then became the preeminent stakes race for three-year-old thoroughbred horses in North America.\n\nDerby participants are limited to three-year-old horses. Apollo (1882) is the only horse to have won the Derby without having raced at age two.\n\nThoroughbred owners began sending their successful Derby horses to compete a few weeks later in the Preakness Stakes at the Pimlico Race Course, in Baltimore, Maryland, followed by the Belmont Stakes in Elmont, New York. The three races offered the largest purse and in 1919 Sir Barton became the first horse to win all three races. However, the term Triple Crown didn't come into use for another eleven years. In 1930, when Gallant Fox became the second horse to win all three races, sportswriter Charles Hatton brought the phrase into American usage. Fueled by the media, public interest in the possibility of a \"superhorse\" that could win the Triple Crown began in the weeks leading up to the derby. Two years after the term was coined, the race, which had been run in mid-May since inception, was changed to the first Saturday in May to allow for a specific schedule for the Triple Crown races. Since 1931, the order of Triple Crown races has been the Kentucky Derby first, followed by the Preakness Stakes and then the Belmont Stakes. Prior to 1931, eleven times the Preakness was run before the Derby. On May 12, 1917 and again on May 13, 1922, the Preakness and the Derby were run on the same day. On eleven occasions the Belmont Stakes was run before the Preakness Stakes.\n\nOn May 16, 1925, the first live radio broadcast of the Kentucky Derby was originated by WHAS and was also carried by WGN in Chicago.\"Derby To Go On The Air\", The New York Times, May 16, 1925, p. 11 On May 7, 1949, the first television coverage of the Kentucky Derby took place, produced by WAVE-TV, the NBC affiliate in Louisville. This coverage was aired live in the Louisville market and sent to NBC as a kinescope newsreel recording for national broadcast. This broadcast was the first time Zoomar lenses were used on a broadcast TV sports show. On May 3, 1952, the first national television coverage of the Kentucky Derby took place, aired from then-CBS affiliate WHAS-TV. In 1954, the purse exceeded $100,000 for the first time. In 1968 Dancer's Image became the first (and to this day the only) horse to win the race and then be disqualified after traces of phenylbutazone, an analgesic and anti-inflammatory drug, were found in the horse's urinalysis; Forward Pass won after a protracted legal battle by the owners of Dancer's Image (which they lost).  Forward Pass thus became the Eighth winner for Calumet Farm. Unexpectedly, the regulations at Kentucky thoroughbred race tracks were changed some years later, allowing horses to run on phenylbutazone. In 1970, Diane Crump became the first female jockey to ride in the Derby, finishing 15th aboard Fathom.\n\nThe fastest time ever run in the Derby  was set in 1973 at 1:59.4 minutes when Secretariat broke the record set by Northern Dancer in 1964. Not only has Secretariat's record time yet to be topped, in the race itself, he did something unique in Triple Crown races: each successive quarter, his times were faster. Though times for non-winners were not recorded, in 1973 Sham finished second, two and a half lengths behind Secretariat in the same race. Using the thoroughbred racing convention of one length equaling one-fifth of a second to calculate Sham's time, he also finished in under two minutes. Another sub-two-minute finish, only the third, was set in 2001 by Monarchos at 1:59.97.\n\nThe 2004 Derby marked the first time that jockeys, as a result of a court order, were allowed to wear corporate advertising logos on their clothing.\n\nIn 2005, the purse distribution for the Derby was changed, so that horses finishing fifth would henceforth receive a share of the purse; previously only the first four finishers did so.\n\nNorman Adams has been the designer of the Kentucky Derby Logo since 2002. On February 1, 2006, the Louisville-based fast-food company Yum! Brands, Inc. announced a corporate sponsorship deal to call the race \"The Kentucky Derby presented by Yum! Brands.\"\n\nIn 2007, HM Queen Elizabeth II, on a visit to the United States, joined the racegoers at Churchill Downs.\n\nIn 2010 Calvin Borel set a new record, being the first jockey to win 3 out of 4 consecutive Kentucky Derbys.\n\nTraditions\n\nIn addition to the race itself, a number of traditions play a large role in the Derby atmosphere. The mint julep, an iced drink consisting of bourbon, mint, and a sugar syrup, is the traditional beverage of the race. The historic drink can be served in an ice-frosted silver julep cup, but most Churchill Downs patrons sip theirs from souvenir glasses (first offered in 1939 and available in revised form each year since) printed with all previous Derby winners. Also, burgoo, a thick stew of beef, chicken, pork, and vegetables, is a popular Kentucky dish served at the Derby.\n\nThe infield, a spectator area inside the track, offers general admission prices but little chance of seeing much of the race. Instead, revelers show up in the infield to party with abandon. By contrast, \"Millionaire's Row\" refers to the expensive box seats that attract the rich, the famous and the well-connected. Women appear in fine outfits lavishly accessorized with large, elaborate hats. As the horses are paraded before the grandstands, the University of Louisville Marching Band plays Stephen Foster's \"My Old Kentucky Home,\" a tradition which began in 1921. The event attracts spectators from a large area, flying in hundreds of private aircraft to Louisville International Airport.\n\nThe Derby is frequently referred to as \"The Run for the Roses,\" because a lush blanket of 554 red roses is awarded to the Kentucky Derby winner each year. The tradition originated in 1883 when New York socialite E. Berry Wall presented roses to ladies at a post-Derby party that was attended by Churchill Downs founder and president, Col. M. Lewis Clark. This gesture is believed to have led Clark to the idea of making the rose the race's official flower. However, it was not until 1896 that any recorded account referred to roses being draped on the Derby winner. The Governor of Kentucky awards the garland and the Kentucky Derby Trophy. Pop vocalist Dan Fogelberg composed the song \"Run for the Roses\" which was released in time for the 1980 running of the race.\n\nRecords\n\nMost wins by a jockey\n* 5 – Eddie Arcaro (1938, 1941, 1945, 1948, 1952)\n* 5 – Bill Hartack (1957, 1960, 1962, 1964, 1969)\n\nMost wins by a trainer\n* 6 – Ben A. Jones (1938, 1941, 1944, 1948, 1949, 1952)\n\nMost wins by an owner\n* 8 – Calumet Farm (1941, 1944, 1948, 1949, 1952, 1957, 1958, 1968)\n\nStakes record\n* Mile and a Quarter: 1:59.40 – Secretariat (1973) \n* Mile and a Half: 2:34 1/2 - Spokane (1889)\n\nRecord victory margin\n* 8 lengths – Old Rosebud (1914)\n* 8 lengths – Johnstown (1939)\n* 8 lengths – Whirlaway (1941)\n* 8 lengths – Assault (1946)\n\nLongest shot to win the Derby\n* 91 to 1 – Donerail (1913)\n\nWinners\n\n;Notes:\n* The race was timed to 1/4 second from 1875 to 1905, to 1/5 second from 1906 to 2000 and to 1/100 second since 2001.\n*  designates a Triple Crown Winner.\n*  designates a filly.\n* In 1968, Dancer's Image, ridden by Bobby Ussery, trained by Lou Cavalaris, Jr., and owned by Peter Fuller, finished first, but was disqualified after a post-race urine sample revealed traces of a banned drug in the horse. The drug in question - phenylbutazone - is now legal for use on racehorses in many states, including Kentucky.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kentucky Derby" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17135" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Kentucky Derby presented by Woodford Reserve is a horse race that is held annually in Louisville, Kentucky, United States, on the first Saturday in May, capping the two-week-long Kentucky Derby Festival. The race is a Grade I stakes race for three-year-old Thoroughbreds at a distance of one and a quarter miles (2 km) at Churchill Downs. Colts and geldings carry 126 lb and fillies 121 lb.[https://web.archive.org/web/20050129145223/http://www.drf.com/sample/pdf/sample_chart.pdf \"Tenth Race Churchill May 1, 2004\"]. May 1, 2004. Daily Racing Forum. Accessed on May 9, 2006.\n\nThe race is known in the United States as \"The Most Exciting Two Minutes In Sports\" or \"The Fastest Two Minutes in Sports\" for its approximate duration, and is also called \"The Run for the Roses\" for the blanket of roses draped over the winner. It is the first leg of the American Triple Crown and is followed by the Preakness Stakes, then the Belmont Stakes. Unlike the Preakness and Belmont Stakes, which took hiatuses in 1891–1893 and 1911–1912, respectively, the Kentucky Derby has been run every consecutive year since 1875. A horse must win all three races to win the Triple Crown. In the 2015 listing of the International Federation of Horseracing Authorities (IFHA), the Kentucky Derby tied with the Whitney Handicap as the top Grade 1 race in the United States outside the Breeders' Cup races.\n\nThe attendance at the Kentucky Derby ranks first in North America and usually surpasses the attendance of all other stakes races including the Preakness Stakes, Belmont Stakes, and the Breeders' Cup.^ 2009 The Original Racing Almanac, page 140 for Kentucky Derby, page 156 for the Preakness Stakes, page 241 for Kentucky Oaks, page 167 for Belmont Stakes, page 184 Breeders' Cup, June 26, 2008.\n\nHistory\n\nIn 1872, Col. Meriwether Lewis Clark, Jr., grandson of William Clark of the Lewis and Clark expedition, traveled to England, visiting Epsom in Surrey where The Derby had been running annually since 1780. From there, Clark went on to Paris, France, where in 1863, a group of racing enthusiasts had formed the French Jockey Club and had organized the Grand Prix de Paris at Longchamp, which at the time was the greatest race in France.\n\nReturning home to Kentucky, Clark organized the Louisville Jockey Club for the purpose of raising money to build quality racing facilities just outside the city. The track would soon become known as Churchill Downs, named for John and Henry Churchill, who provided the land for the racetrack.  Officially, the racetrack was incorporated as Churchill Downs in 1937.\n\nThe Kentucky Derby was first run at , the same distance as the Epsom Derby. The distance was changed in 1896 to its current . On May 17, 1875, in front of an estimated crowd of 10,000 people, a field of 15 three-year-old horses contested the first Derby. Under jockey Oliver Lewis, a colt named Aristides, who was trained by future Hall of Famer Ansel Williamson, won the inaugural Derby. Later that year, Lewis rode Aristides to a second-place finish in the Belmont Stakes.\n\nAlthough the first race meeting proved a success, the track ran into financial difficulties and in 1894 the New Louisville Jockey Club was incorporated with new capitalization and improved facilities. Despite this, the business foundered until 1902 when Col. Matt Winn of Louisville put together a syndicate of businessmen to acquire the facility. Under Winn, Churchill Downs prospered and the Kentucky Derby then became the preeminent stakes race for three-year-old thoroughbred horses in North America.\n\nDerby participants are limited to three-year-old horses. Apollo (1882) is the only horse to have won the Derby without having raced at age two.\n\nThoroughbred owners began sending their successful Derby horses to compete a few weeks later in the Preakness Stakes at the Pimlico Race Course, in Baltimore, Maryland, followed by the Belmont Stakes in Elmont, New York. The three races offered the largest purse and in 1919 Sir Barton became the first horse to win all three races. However, the term Triple Crown didn't come into use for another eleven years. In 1930, when Gallant Fox became the second horse to win all three races, sportswriter Charles Hatton brought the phrase into American usage. Fueled by the media, public interest in the possibility of a \"superhorse\" that could win the Triple Crown began in the weeks leading up to the derby. Two years after the term was coined, the race, which had been run in mid-May since inception, was changed to the first Saturday in May to allow for a specific schedule for the Triple Crown races. Since 1931, the order of Triple Crown races has been the Kentucky Derby first, followed by the Preakness Stakes and then the Belmont Stakes. Prior to 1931, eleven times the Preakness was run before the Derby. On May 12, 1917 and again on May 13, 1922, the Preakness and the Derby were run on the same day. On eleven occasions the Belmont Stakes was run before the Preakness Stakes.\n\nOn May 16, 1925, the first live radio broadcast of the Kentucky Derby was originated by WHAS and was also carried by WGN in Chicago.\"Derby To Go On The Air\", The New York Times, May 16, 1925, p. 11 On May 7, 1949, the first television coverage of the Kentucky Derby took place, produced by WAVE-TV, the NBC affiliate in Louisville. This coverage was aired live in the Louisville market and sent to NBC as a kinescope newsreel recording for national broadcast. This broadcast was the first time Zoomar lenses were used on a broadcast TV sports show. On May 3, 1952, the first national television coverage of the Kentucky Derby took place, aired from then-CBS affiliate WHAS-TV. In 1954, the purse exceeded $100,000 for the first time. In 1968 Dancer's Image became the first (and to this day the only) horse to win the race and then be disqualified after traces of phenylbutazone, an analgesic and anti-inflammatory drug, were found in the horse's urinalysis; Forward Pass won after a protracted legal battle by the owners of Dancer's Image (which they lost).  Forward Pass thus became the Eighth winner for Calumet Farm. Unexpectedly, the regulations at Kentucky thoroughbred race tracks were changed some years later, allowing horses to run on phenylbutazone. In 1970, Diane Crump became the first female jockey to ride in the Derby, finishing 15th aboard Fathom.\n\nThe fastest time ever run in the Derby  was set in 1973 at 1:59.4 minutes when Secretariat broke the record set by Northern Dancer in 1964. Not only has Secretariat's record time yet to be topped, in the race itself, he did something unique in Triple Crown races: each successive quarter, his times were faster. Though times for non-winners were not recorded, in 1973 Sham finished second, two and a half lengths behind Secretariat in the same race. Using the thoroughbred racing convention of one length equaling one-fifth of a second to calculate Sham's time, he also finished in under two minutes. Another sub-two-minute finish, only the third, was set in 2001 by Monarchos at 1:59.97.\n\nThe 2004 Derby marked the first time that jockeys, as a result of a court order, were allowed to wear corporate advertising logos on their clothing.\n\nIn 2005, the purse distribution for the Derby was changed, so that horses finishing fifth would henceforth receive a share of the purse; previously only the first four finishers did so.\n\nNorman Adams has been the designer of the Kentucky Derby Logo since 2002. On February 1, 2006, the Louisville-based fast-food company Yum! Brands, Inc. announced a corporate sponsorship deal to call the race \"The Kentucky Derby presented by Yum! Brands.\"\n\nIn 2007, HM Queen Elizabeth II, on a visit to the United States, joined the racegoers at Churchill Downs.\n\nIn 2010 Calvin Borel set a new record, being the first jockey to win 3 out of 4 consecutive Kentucky Derbys.\n\nTraditions\n\nIn addition to the race itself, a number of traditions play a large role in the Derby atmosphere. The mint julep, an iced drink consisting of bourbon, mint, and a sugar syrup, is the traditional beverage of the race. The historic drink can be served in an ice-frosted silver julep cup, but most Churchill Downs patrons sip theirs from souvenir glasses (first offered in 1939 and available in revised form each year since) printed with all previous Derby winners. Also, burgoo, a thick stew of beef, chicken, pork, and vegetables, is a popular Kentucky dish served at the Derby.\n\nThe infield, a spectator area inside the track, offers general admission prices but little chance of seeing much of the race. Instead, revelers show up in the infield to party with abandon. By contrast, \"Millionaire's Row\" refers to the expensive box seats that attract the rich, the famous and the well-connected. Women appear in fine outfits lavishly accessorized with large, elaborate hats. As the horses are paraded before the grandstands, the University of Louisville Marching Band plays Stephen Foster's \"My Old Kentucky Home,\" a tradition which began in 1921. The event attracts spectators from a large area, flying in hundreds of private aircraft to Louisville International Airport.\n\nThe Derby is frequently referred to as \"The Run for the Roses,\" because a lush blanket of 554 red roses is awarded to the Kentucky Derby winner each year. The tradition originated in 1883 when New York socialite E. Berry Wall presented roses to ladies at a post-Derby party that was attended by Churchill Downs founder and president, Col. M. Lewis Clark. This gesture is believed to have led Clark to the idea of making the rose the race's official flower. However, it was not until 1896 that any recorded account referred to roses being draped on the Derby winner. The Governor of Kentucky awards the garland and the Kentucky Derby Trophy. Pop vocalist Dan Fogelberg composed the song \"Run for the Roses\" which was released in time for the 1980 running of the race.\n\nRecords\n\nMost wins by a jockey\n* 5 – Eddie Arcaro (1938, 1941, 1945, 1948, 1952)\n* 5 – Bill Hartack (1957, 1960, 1962, 1964, 1969)\n\nMost wins by a trainer\n* 6 – Ben A. Jones (1938, 1941, 1944, 1948, 1949, 1952)\n\nMost wins by an owner\n* 8 – Calumet Farm (1941, 1944, 1948, 1949, 1952, 1957, 1958, 1968)\n\nStakes record\n* Mile and a Quarter: 1:59.40 – Secretariat (1973) \n* Mile and a Half: 2:34 1/2 - Spokane (1889)\n\nRecord victory margin\n* 8 lengths – Old Rosebud (1914)\n* 8 lengths – Johnstown (1939)\n* 8 lengths – Whirlaway (1941)\n* 8 lengths – Assault (1946)\n\nLongest shot to win the Derby\n* 91 to 1 – Donerail (1913)\n\nWinners\n\n;Notes:\n* The race was timed to 1/4 second from 1875 to 1905, to 1/5 second from 1906 to 2000 and to 1/100 second since 2001.\n*  designates a Triple Crown Winner.\n*  designates a filly.\n* In 1968, Dancer's Image, ridden by Bobby Ussery, trained by Lou Cavalaris, Jr., and owned by Peter Fuller, finished first, but was disqualified after a post-race urine sample revealed traces of a banned drug in the horse. The drug in question - phenylbutazone - is now legal for use on racehorses in many states, including Kentucky. Kentucky Derby. http://en.wikipedia.org/?curid=17135."
  }
}
