{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=983",
  "eid" : "a8bfef00-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778362864,
  "textBody" : "Albert Camus (;[http://dictionary.reference.com/browse/camus \"Camus\"]. Random House Webster's Unabridged Dictionary.; 7 November 1913 – 4 January 1960) was a French philosopher, author, and journalist. His views contributed to the rise of the philosophy known as absurdism. He wrote in his essay The Rebel that his whole life was devoted to opposing the philosophy of nihilism while still delving deeply into individual freedom. He won the Nobel Prize in Literature at the age of 43 in 1957, the second youngest recipient in history.\n\nCamus did not consider himself to be an existentialist despite usually being classified as a follower of it, even in his lifetime. In a 1945 interview, Camus rejected any ideological associations: \"No, I am not an existentialist. Sartre and I are always surprised to see our names linked.\"Les Nouvelles littéraires, 15 November 1945\n\nCamus was born in French Algeria to a Pied-Noir family and studied at the University of Algiers, from which he graduated in 1936. In 1949, Camus founded the Group for International Liaisons to \"denounce two ideologies found in both the USSR and the USA\".\n\nLife\n\nEarly years\n\nAlbert Camus was born on 7 November 1913 in Mondovi (present-day Dréan), in French Algeria. His mother was of Spanish descent and could only hear out of her left ear.Lottman 1979, p.11 His father, Lucien, a poor agricultural worker of Alsatian descent, was wounded in the Battle of the Marne in 1914 during World War I, while serving as a member of a Zouave infantry regiment. Lucien died from his wounds in a makeshift army hospital on 11 October.His death is confirmed in the article 'The Master of the Absurd Turns 100', in the September/October 2013 issue of Philosophy Now magazine. The article can be accessed here [http://philosophynow.org/issues/98/The_Master_of_the_Absurd_Turns_100]  Camus and his mother, an illiterate house cleaner, lived without many basic material possessions during his childhood in the Belcourt section of Algiers.\n\nIn 1923, Camus gained acceptance into the  and eventually was admitted to the University of Algiers. After contracting tuberculosis in 1930, he had to end his football activities: he had been a goalkeeper for a prominent Algerian university team. In addition, he was only able to study part-time. To earn money, he took odd jobs: as a private tutor, car parts clerk, and assistant at the Meteorological Institute. He completed his licence de philosophie (BA) in 1936; in May 1936, he successfully presented his thesis on Plotinus, \"Rapports de l'hellénisme et du christianisme à travers les oeuvres de Plotin et de saint Augustin\" (\"Relationship of Greek and Christian thought in Plotinus and St. Augustine\"),Alan D. Schrift (2006), Twentieth-Century French Philosophy: Key Themes And Thinkers, Blackwell Publishing, p. 109. for his ' (roughly equivalent to an MA thesis).\n\nCamus joined the French Communist Party in early 1935, seeing it as a way to \"fight inequalities between Europeans and 'natives' in Algeria.\" He did not suggest he was a Marxist or that he had read Das Kapital, but did write, \"We might see communism as a springboard and asceticism that prepares the ground for more spiritual activities.\" In 1936, the independence-minded Algerian Communist Party (PCA) was founded. Camus joined the activities of the Algerian People's Party (Le Parti du Peuple Algérien), which got him into trouble with his Communist party comrades, who in 1937 denounced him as a Trotskyite and expelled him from the party. Camus then became associated with the French anarchist movement.\n\nThe anarchist André Prudhommeaux first introduced him at a meeting in 1948 of the Cercle des Étudiants Anarchistes (Anarchist Student Circle) as a sympathiser familiar with anarchist thought. Camus wrote for anarchist publications such as Le Libertaire, La révolution Prolétarienne, and Solidaridad Obrera (Workers' Solidarity), the organ of the anarcho-syndicalist CNT (National Confederation of Labor). Camus stood with the anarchists when they expressed support for the uprising of 1953 in East Germany. He again allied with the anarchists in 1956, first in support of the workers' uprising in Poznań, Poland, and then later in the year with the Hungarian Revolution.\n\nCamus was irreligious.David Simpson writes that Camus affirmed \"a defiantly atheistic creed.\" [http://www.iep.utm.edu/c/camus.htm Albert Camus (1913–1960)], The Internet Encyclopedia of Philosophy, 2006, (Accessed June 14, 2007). “I do not believe in God and I am not an atheist.” ~Notebooks 1951-1959. He told Le Monde in 1956, \"I would agree with Benjamin Constant, who thought a lack of religion was vulgar and even hackneyed.\"\n\nMarriage\n\nIn 1934, Camus married Simone Hié, but the marriage ended as a consequence of infidelities on both sides. In 1935, he founded Théâtre du Travail (Worker's Theatre), renamed Théâtre de l'Equipe (Theatre of the Team) in 1937. It lasted until 1939. From 1937 to 1939 he wrote for a socialist paper, Alger-Républicain. His work included a report on the poor conditions for peasants in Kabylie, which apparently cost him his job. From 1939 to 1940, he briefly wrote for a similar paper, Soir-Republicain. He was rejected by the French army because of his tuberculosis.\n\nIn 1940, Camus married Francine Faure, a pianist and mathematician. Although he loved her, he had argued passionately against the institution of marriage, dismissing it as unnatural. Even after Francine gave birth to twins, Catherine and Jean, on 5 September 1945, he continued to joke to friends that he was not cut out for marriage. Camus had numerous affairs, particularly an irregular and eventually public affair with the Spanish-born actress María Casares. In the same year, Camus began to work for Paris-Soir magazine. In the first stage of World War II, during the so-called Phoney War, Camus was a pacifist. While in Lyon during the Wehrmacht occupation, on 15 December 1941, Camus read about the Paris execution of Gabriel Péri; it crystallized his revolt against the Germans. He moved to Bordeaux with the rest of the staff of Paris-Soir. In the same year he finished his first books, The Stranger and The Myth of Sisyphus. He returned briefly to Oran, Algeria, in 1942.\n\nFootball\n\nCamus was once asked by his friend Charles Poncet which he preferred, football or the theatre. Camus is said to have replied, \"Football, without hesitation.\"\n\nCamus played as goalkeeper for Racing Universitaire d'Alger (RUA won both the North African Champions Cup and the North African Cup twice each in the 1930s) junior team from 1928 to 1930. The sense of team spirit, fraternity, and common purpose appealed to Camus enormously. In match reports Camus would often attract positive comment for playing with passion and courage. Any football  ambitions disappeared when he contracted tuberculosis at the age of 17. The affliction, which was then incurable, caused Camus to be bedridden for long and painful periods.\n\nWhen Camus was asked in the 1950s by an alumni sports magazine for a few words regarding his time with the RUA, his response included the following: \"After many years during which I saw many things, what I know most surely about morality and the duty of man I owe to sport and learned it in the RUA.\" Camus was referring to a sort of simplistic morality he wrote about in his early essays, the principle of sticking up for your friends, of valuing bravery and fair-play. Camus's belief was that political and religious authorities try to confuse us with over-complicated moral systems to make things appear more complex than they really are, potentially to serve their own needs.\n\nA professional footballer appears as a character in The Plague and football is discussed in the dialogue.\n\nRevolutionary Union Movement and Europe\n\nAs he wrote in L'Homme révolté (The Rebel), in the chapter about \"The Thought on Midday\", Camus was a follower of the ancient Greek 'Solar Tradition' (la pensée solaire). In 1947–48, he founded the Revolutionary Union Movement (Groupes de liaison internationale – GLI) a trade union movement in the context of revolutionary syndicalism (Syndicalisme révolutionnaire). According to Olivier Todd, in his biography Albert Camus, une vie, it was a group opposed to some tendencies of the Surrealist movement of André Breton. For more, see the book Alfred Rosmer et le mouvement révolutionnaire international by Christian Gras.\n\nHis colleagues were Nicolas Lazarévitch, Louis Mercier, Roger Lapeyre, Paul Chauvet, Auguste Largentier, Jean de Boë (see the article: \"Nicolas Lazarévitch, Itinéraire d'un syndicaliste révolutionnaire\" by Sylvain Boulouque in the review Communisme, n° 61, 2000). His main aim was to express the positive side of surrealism and existentialism, rejecting the negativity and the nihilism of André Breton.\n\nFrom 1943, Albert Camus had correspondence with Altiero Spinelli who founded the European Federalist Movement in Milan—see Ventotene Manifesto and the book \"Unire l'Europa, superare gli stati\", Altiero Spinelli nel Partito d'Azione del Nord Italia e in Francia dal 1944 al 1945-annexed a letter by Altiero Spinelli to Albert Camus.\n\nIn 1944, Camus founded the \"French Committee for the European Federation\" (Comité Français pour la Féderation Européenne – CFFE) declaring that Europe \"can only evolve along the path of economic progress, democracy and peace if the nation states become a federation.\"\n\nFrom 22 to 25 March 1945, the first conference of the European Federalist Movement was organised in Paris with the participation of Albert Camus, George Orwell, Emmanuel Mounier, Lewis Mumford, André Philip, Daniel Mayer, François Bondy and Altiero Spinelli.See the book The Biography of Europe by Pan Drakopoulos. This specific branch of the European Federalist Movement disintegrated in 1957 after Winston Churchill's ideas about European integration rose to dominance.\n\nDeath\n\nCamus died on 4 January 1960 at the age of 46, in a car accident near Sens, in Le Grand Fossard in the small town of Villeblevin. In his coat pocket was an unused train ticket. He had planned to travel by train with his wife and children, but at the last minute he accepted his publisher's proposal to travel with him.\n\nThe driver of the Facel Vega HK500 car, , who was Camus's publisher and close friend, died five days after the accident. In August 2011, the Milan newspaper Corriere della Sera reported a theory that the writer had been the victim of a Soviet plot, but Camus's biographer, , did not consider it credible.Kim Willsher [https://www.theguardian.com/books/2011/aug/07/albert-camus-killed-by-kgb Albert Camus might have been killed by the KGB for criticising the Soviet Union, claims newspaper] The Observer, 7 August 2011 Camus was buried in the Lourmarin Cemetery, Lourmarin, Vaucluse, France.\n\nHe was the second-youngest recipient, at the age of 44, of the Nobel Prize in Literature, after Rudyard Kipling, at the age of 42.\n\nHe was survived by his wife and twin son and daughter, Jean and Catherine, who hold the copyrights to his work.\n\nTwo of Camus's works were published posthumously. The first, entitled A Happy Death (1970), featured a character named Patrice Mersault, comparable to The Stranger's Meursault. There is scholarly debate as to the relationship between the two books. The second was an unfinished novel, The First Man (1995), which Camus was writing before he died. The novel was an autobiographical work about his childhood in Algeria.\n\nLiterary career\n\nThe first publication of Camus (co-written by Jeanne-Paule Sicard, Yves Bourgeois and Alfred Poignant, and edited by Edmond Charlot) was Revolte dans les Asturies in May 1936. This concerned a revolt by Spanish miners brutally suppressed by the Spanish government. In May 1937 he wrote his first book L’Envers et l’Endroit – dedicated to Jean Grenier and edited by Charlot.\n \nDuring the war Camus joined the French Resistance cell Combat, which published an underground newspaper of the same name. This group worked against the Nazis, and in it Camus assumed the nom de guerre Beauchard. Camus became the paper's editor in 1943. He first met Sartre at the dress rehearsal of Sartre's play, The Flies, in June 1943.', by Simone de Beauvoir\n\nWhen the Allies liberated Paris in August 1944, Camus witnessed and reported the last of the fighting. Soon after the event on 6 August 1945, he was one of the few French editors to publicly express opposition and disgust to the United States' dropping the atomic bombs on Japan. He resigned from Combat in 1947 when it became a commercial paper. After the war, Camus began frequenting the Café de Flore on the Boulevard Saint-Germain in Paris with Sartre and others. He also toured the United States to lecture about French thought. Although he leaned left, politically, his strong criticisms of Communist doctrine did not win him any friends in the Communist parties and eventually alienated Sartre.\n\nIn 1949, his tuberculosis returned, whereupon he lived in seclusion for two years. In 1951, he published The Rebel, a philosophical analysis of rebellion and revolution which expressed his rejection of communism. Upsetting many of his colleagues and contemporaries in France, the book brought about the final split with Sartre. The dour reception depressed Camus; he began to translate plays.\n\nCamus's first significant contribution to philosophy was his idea of the absurd. He saw it as the result of our desire for clarity and meaning within a world and condition that offers neither, which he expressed in The Myth of Sisyphus and incorporated into many of his other works, such as The Stranger and The Plague. Despite his split from his \"study partner\", Sartre, Camus was still categorized as an Existentialist. He specifically rejected that label in his essay \"Enigma\" and elsewhere.See: The Lyrical and Critical Essays of Albert Camus The current confusion arises, in part, because many recent applications of existentialism have much in common with many of Camus's practical ideas (see: Resistance, Rebellion, and Death). But, his personal understanding of the world (e.g., \"a benign indifference\", in The Stranger), and every vision he had for its progress (e.g., vanquishing the \"adolescent furies\" of history and society, in The Rebel) undoubtedly set him apart.\n\nIn the 1950s, Camus devoted his efforts to human rights. In 1952, he resigned from his work for UNESCO when the UN accepted Spain as a member under the leadership of General Franco. In 1953, he criticized Soviet methods to crush a workers' strike in East Berlin. In 1956, he protested against similar methods in Poland (protests in Poznań) and the Soviet repression of the Hungarian revolution in October.\n\nCamus maintained his pacifism and resisted capital punishment anywhere in the world. He wrote an essay against capital punishment in collaboration with Arthur Koestler, the writer, intellectual and founder of the League Against Capital Punishment. He was consistent in his call for non-aggression in Algeria (see below).\n\nFrom 1955 to 1956, Camus wrote for L'Express. In 1957, he was awarded the Nobel Prize in literature \"for his important literary production, which with clear-sighted earnestness illuminates the problems of the human conscience in our times\".\n\nCamus remained active and ambitious until the end of his life. Financed by the money he received with his Nobel Prize, he adapted and directed for the stage Dostoyesvsky's Demons. The play opened in January 1959 at the Antoine Theatre in Paris. It was a critical success as well as an artistic and technical tour de force: 33 actors, 4 hours long, 7 sets, 24 scenes. The walls could move sideways to reduce the size of each depicted location and the whole stage rotated to allow for immediate set transformations. Camus put the painter and set decorator Mayo, who had already illustrated several of Camus' novels (The Stranger - 1948 Ed.), in charge of the demanding task of designing these multiple and complex theater sets.\n\nAlgeria \n\nCamus once confided that the troubles in Algeria \"affected him as others feel pain in their lungs.\"\n\nIn the 1930s, Camus was affiliated with Left-wing groups like the Maison de Culture in Algiers which were highly critical of the French colonial regime's treatment of Algeria's Arab and indigenous inhabitants, supporting the Blum-Viollette proposal to grant Algerians full French citizenship.  His 1938 address on \"The New Mediterranean Culture\" represents Camus' most systematic statement on his views at this time.  In 1939, Camus wrote a stinging series of articles for Alger Republicain on the atrocious living conditions of the inhabitants of the Kabylie highlands, advocating for economic, educational and political reforms as a matter of emergency.\n\nIn 1945, following the Sétif and Guelma massacre after Arab revolts against French mistreatment, Camus was one of only a few mainland journalists to visit the colony, again writing a series of article reports on conditions, and advocating for French concessions and reforms to the demands of the Algerian people.\n\nWhen the Algerian War began in 1954, Camus was confronted with a moral dilemma. He identified with the Pieds-Noirs such as his own parents and defended the French government's actions against the revolt. He argued that the Algerian uprising was an integral part of the 'new Arab imperialism' led by Egypt and an 'anti-Western' offensive orchestrated by Russia to 'encircle Europe' and 'isolate the United States'.Actuelles III: Chroniques Algeriennes, 1939–58 Although favoring greater Algerian autonomy or even federation, though not full-scale independence, he believed that the Pieds-Noirs and Arabs could co-exist. During the war he advocated a civil truce that would spare the civilians, which was rejected by both sides, who regarded it as foolish. Behind the scenes, he began to work for imprisoned Algerians who faced the death penalty.\n\nWhen he spoke to students at the University of Stockholm, he defended his apparent inactivity in the Algerian question; he stated that he was worried about what might happen to his mother, who still lived in Algeria. This led to further ostracism by French left-wing intellectuals. At the time of his death, Camus was working on an incomplete novel with a strong biographical component titled The First Man.  The publication of this book in 1994 has sparked a widespread reconsideration of Camus' allegedly unrepentant colonialism in the work of figures such as David Carroll in the English-speaking world.\n\nPhilosophy\n\nExistentialism\n\nAs one of the forefathers of existentialism, Camus focused most of his philosophy around existential questions. The absurdity of life and its inevitable ending (death) is highlighted in the very famous opening of the novel The Stranger (1942): \"Mother died today. Or maybe yesterday; I can't be sure.\". This alludes to his claim that life is engrossed by the absurd. He believed that the absurd - life being void of meaning, or mans' inability to know that meaning if it were to exist - was something that man should embrace. He argued that this crises of self could cause a man to commit (\"philosophical suicide\"); choosing to believe in external sources that give life (what he would describe as false) meaning. He claimed that religion was the main culprit. If a man chose to believe in religion - that the meaning of life was ascend to heaven, or some similar afterlife, that he committed philosophical suicide by trying to escape the absurd.\n\nAbsurdism\n\nMany writers have addressed the Absurd, each with his or her own interpretation of what the Absurd is and what comprises its importance. For example, Sartre recognizes the absurdity of individual experience, while Kierkegaard explains that the absurdity of certain religious truths prevents us from reaching God rationally. Camus regretted the continued reference to himself as a \"philosopher of the absurd\". He showed less interest in the Absurd shortly after publishing Le Mythe de Sisyphe (The Myth of Sisyphus). To distinguish his ideas, scholars sometimes refer to the Paradox of the Absurd, when referring to \"Camus' Absurd\".\n\nHis early thoughts appeared in his first collection of essays, L'Envers et l'endroit (Betwixt and Between) in 1937. Absurd themes were expressed with more sophistication in his second collection of essays, Noces (Nuptials), in 1938. In these essays Camus reflects on the experience of the Absurd. In 1942 he published the story of a man living an absurd life as L'Étranger (The Stranger). In the same year he released Le Mythe de Sisyphe (The Myth of Sisyphus), a literary essay on the Absurd. He also wrote a play about Caligula, a Roman Emperor, pursuing an absurd logic. The play was not performed until 1945.\n\nThe turning point in Camus's attitude to the Absurd occurs in a collection of four letters to an anonymous German friend, written between July 1943 and July 1944. The first was published in the Revue Libre in 1943, the second in the Cahiers de Libération in 1944, and the third in the newspaper Libertés, in 1945. The four letters were published as Lettres à un ami allemand (Letters to a German Friend) in 1945, and were included in the collection Resistance, Rebellion, and Death.\n\nIdeas on the absurd\n\nCamus presents the reader with dualisms such as happiness and sadness, dark and light, life and death, etc. He emphasizes the fact that happiness is fleeting and that the human condition is one of mortality; for Camus, this is cause for a greater appreciation for life and happiness. In Le Mythe, dualism becomes a paradox: we value our own lives in spite of our mortality and in spite of the universe's silence. While we can live with a dualism (I can accept periods of unhappiness, because I know I will also experience happiness to come), we cannot live with the paradox (I think my life is of great importance, but I also think it is meaningless). In Le Mythe, Camus investigates our experience of the Absurd and asks how we live with it. Our life must have meaning for us to value it. If we accept that life has no meaning and therefore no value, should we kill ourselves?\n\nIn Le Mythe, Camus suggests that 'creation of meaning' would entail a logical leap or a kind of philosophical suicide in order to find psychological comfort.  But Camus wants to know if he can live with what logic and lucidity have uncovered – if one can build a foundation on what one knows and nothing more. Creation of meaning is not a viable alternative but a logical leap and an evasion of the problem. He gives examples of how others would seem to make this kind of leap. The alternative option, namely suicide, would entail another kind of leap, where one attempts to kill absurdity by destroying one of its terms (the human being). Camus points out, however, that there is no more meaning in death than there is in life, and that it simply evades the problem yet again. Camus concludes that we must instead \"entertain\" both death and the absurd, while never agreeing to their terms.\n\nMeursault, the absurdist hero of L'Étranger, has killed a man and is scheduled to be executed. Caligula ends up admitting his absurd logic was wrong and is killed by an assassination he has deliberately brought about. However, while Camus possibly suggests that Caligula's absurd reasoning is wrong, the play's anti-hero does get the last word, as the author similarly exalts Meursault's final moments.\n\nCamus made a significant contribution to a viewpoint of the Absurd, and always rejected nihilism as a valid response. If nothing had any meaning, you would be right. But there is something that still has a meaning. — Second Letter to a German Friend, December 1943.\n\nCamus's understanding of the Absurd promotes public debate; his various offerings entice us to think about the Absurd and offer our own contribution. Concepts such as cooperation, joint effort and solidarity are of key importance to Camus, though they are most likely sources of 'relative' versus 'absolute' meaning. In The Rebel, Camus identifies rebellion (or rather, the values indicated by rebellion) as a basis for human solidarity. When he rebels, a man identifies himself with other men and so surpasses himself, and from this point of view human solidarity is metaphysical. But for the moment we are only talking of the kind of solidarity that is born in chains. \n\nThe Myth of Sisyphus\n\nDespite his opposition to the label, Camus addressed one of the fundamental questions of existentialism: the problem of suicide. He wrote, \"There is only one really serious philosophical question, and that is suicide. Deciding whether or not life is worth living is to answer the fundamental question in philosophy. All other questions follow from that.\" Camus viewed the question of suicide as arising naturally as a solution to the absurdity of life. In The Myth of Sisyphus, Camus seeks to identify the kinds of life that could be worth living despite their inherent meaninglessness.\n\nViews on totalitarianism\n\nThroughout his life, Camus spoke out against and actively opposed totalitarianism in its many forms. Early on, Camus was active within the French Resistance to the German occupation of France during World War II, even directing the famous Resistance journal, Combat. On the French collaboration with Nazi occupiers he wrote: \"Now the only moral value is courage, which is useful here for judging the puppets and chatterboxes who pretend to speak in the name of the people.\" After liberation, Camus remarked, \"This country does not need a Talleyrand, but a Saint-Just.\" The reality of the bloody postwar tribunals soon changed his mind: Camus publicly reversed himself and became a lifelong opponent of capital punishment.\n\nCamus's well-known falling out with Sartre is linked to his opposition to authoritarian communism. Camus detected a reflexive totalitarianism in the mass politics espoused by Sartre in the name of Marxism. This was apparent in his work L'Homme Révolté (The Rebel) which not only was an assault on the Soviet police state, but also questioned the very nature of mass revolutionary politics and ideas. Camus continued to speak out against the atrocities of the Soviet Union, a sentiment captured in his 1957 speech, The Blood of the Hungarians, commemorating the anniversary of the 1956 Hungarian Revolution, an uprising crushed in a bloody assault by the Red Army.\n\nPhilhellenism, debts to Greek classical thought \n\nOne further important, often neglected component of Camus' philosophical and literary persona was his love of classical Greek thought and literature, or philhellenism.  This love looks back to his youthful encounters with Friedrich Nietzsche, his teacher Jean Grenier, and his own sense of a \"Mediterranean\" identity, based in a common experience of sunshine, beaches, and living in proximity to the near-Eastern world.  Camus' Diplomes thesis (roughly like an MA thesis in most anglophone countries) was on the transition between classical Greek and Roman, and Christian culture, featuring chapters on the early Church, gnosticism, Plotinus and Saint Augustine's \"second revelation\", bringing Greek philosophical conceptuality to Christian revelation.  Camus' early essay collection Noces (Nuptials) features essays set amidst classical Roman ruins; as the Myth of Sisyphus and The Rebel (which takes as its hero Prometheus) both are rooted in Camus' classical paideia.  The culmination of the latter work defends a \"midday thought\" based in classical moderation or mesure, in opposition to the tendency of modern political ideologies to exclusively valorise race or class, and to dream of a total redemptive revolution.  Camus' conception of classical moderation also has deep roots in his lifelong love of Greek tragic theatre, about which he gave an intriguing address in Athens in 1956. He appealed to Queen Elizabeth II for mercy for the young Greek Cypriot anti colonial freedom fighter Michalis Karaolis, who was sentenced to death in 1956.[https://www.academia.edu/11727557/The_Pleiade_in_Cyprus_French_Authors_and_the_Island_of_Aphrodite Demetra Demetriou The pleiade in Cyprus: French authors and the island of Aphrodite p.303]  Camus letter was acquired from auction by Nasos Ktorides and donated to the National Struggle Museum in Nicosia.[http://www.financialmirror.com/news-details.php?nid\n35509 Remembering Karaolis - a historical document by Albert Camus, Financial mirror 28 March, 2017]\n\nWorks\n\nNovels\n\n* The Stranger (L'Étranger, often translated as The Outsider) (1942)\n* The Plague (La Peste) (1947)\n* The Fall (La Chute) (1956)\n* A Happy Death (La Mort heureuse) (written 1936–38, published posthumously 1971)\n* The First Man (Le premier homme) (incomplete, published posthumously 1995)\n\nShort stories\n\n* Exile and the Kingdom (L'exil et le royaume) (collection, 1957) containing the following short stories:\n** The Adulterous Woman (La Femme adultère)\n** The Renegade or a Confused Spirit (Le Renégat ou un esprit confus)\n** The Silent Men (Les Muets)\n** The Guest (L'Hôte)\n** Jonas or the Artist at Work (Jonas ou l’artiste au travail)\n** The Growing Stone (La Pierre qui pousse)\n\nNon-fiction books\n\n* Christian Metaphysics and Neoplatonism (1935)\n* Betwixt and Between (L'envers et l'endroit, also translated as The Wrong Side and the Right Side) (collection, 1937)\n* Nuptials (Noces) (1938)\n* The Myth of Sisyphus (Le Mythe de Sisyphe) (1942)\n* The Rebel (L'Homme révolté) (1951)\n* Notebooks 1935–1942 (Carnets, mai 1935 —fevrier 1942) (1962)\n* Notebooks 1943–1951 (1965)\n* Notebooks 1951–1959 (2008) Published as \"Carnets Tome III : Mars 1951 – December 1959\" (1989)\n* Algerian Chronicles (2013)Harvard University Press ()[https://www.wsj.com/articles/SB10001424127887323335404578444562558795632 Betwixt and Between] by James Campbell - Wall Street Journal (3 May 2013 review)[http://bookforum.com/inprint/020_01/11228 Resistance, Rebellion, and Writing], by George Scialabba - bookforum.com April / May 2013\n* Albert Camus, Maria Casarès. Correspondance inédite (1944-1959) Avant-propos de Catherine Camus (2017)\n\nPlays\n\n* Caligula (performed 1945, written 1938)\n* The Misunderstanding (Le Malentendu) (1944)\n* The State of Siege (L'État de Siège) (1948)\n* The Just Assassins (Les Justes) (1949)\n* Requiem for a Nun (Requiem pour une nonne, adapted from William Faulkner's novel by the same name) (1956)\n* The Possessed (Les Possédés, adapted from Fyodor Dostoyevsky's novel Demons) (1959)\n\nEssays\n\n* The Crisis of Man (Lecture at Columbia University) (March 28, 1946)[https://www.scribd.com/document/341261228/The-Human-Crisis-Albert-Camus-Lecture The Human Crisis - Albert Camus Lecture at scribd.com]\n* Neither Victims Nor Executioners (Series of essays in Combat) (1946)\n* Why Spain? (Essay for the theatrical play L' Etat de Siège) (1948)\n* The Ancient Greek Tragedy (Parnassos lecture in Greece) (1956)\n* Reflections on the Guillotine (Réflexions sur la guillotine) (Extended essay, 1957)\n* Create Dangerously (Essay on Realism and Artistic Creation, lecture at the University of Uppsala in Sweden) (1957)\n\nCollected essays\n\n* Resistance, Rebellion, and Death (1961) – a collection of essays selected by the author, including the 1945 Lettres à un ami allemand (Letters to a German Friend) and A Defense of Intelligence, a 1945 speech given at a meeting organized by Amitié FrançaiseOrme, Mark (2007). [https://books.google.com/books?idVGBSVdHwmUYC&lpg\nPA139&dq%22A%20Defense%20of%20Intelligence%22%20%22transform%20our%20appetite%20for%20hatred%20into%20a%20desire%20for%20justice%22&hl\nen&pgPA139#v\nonepage&q%22A%20Defense%20of%20Intelligence%22%20%22transform%20our%20appetite%20for%20hatred%20into%20a%20desire%20for%20justice%22&f\nfalse The Development of Albert Camus's Concern for Social and Political Justice], Fairleigh Dickinson University Press, \n* Lyrical and Critical Essays (1970)\n* Youthful Writings (1976)\n* Between Hell and Reason: Essays from the Resistance Newspaper \"Combat\", 1944–1947 (1991)\n* Camus at \"Combat\": Writing 1944–1947 (2005)\n* Albert Camus Contre la Peine de Mort (2011)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Albert Camus" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=983" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Albert Camus (;[http://dictionary.reference.com/browse/camus \"Camus\"]. Random House Webster's Unabridged Dictionary.; 7 November 1913 – 4 January 1960) was a French philosopher, author, and journalist. His views contributed to the rise of the philosophy known as absurdism. He wrote in his essay The Rebel that his whole life was devoted to opposing the philosophy of nihilism while still delving deeply into individual freedom. He won the Nobel Prize in Literature at the age of 43 in 1957, the second youngest recipient in history.\n\nCamus did not consider himself to be an existentialist despite usually being classified as a follower of it, even in his lifetime. In a 1945 interview, Camus rejected any ideological associations: \"No, I am not an existentialist. Sartre and I are always surprised to see our names linked.\"Les Nouvelles littéraires, 15 November 1945\n\nCamus was born in French Algeria to a Pied-Noir family and studied at the University of Algiers, from which he graduated in 1936. In 1949, Camus founded the Group for International Liaisons to \"denounce two ideologies found in both the USSR and the USA\".\n\nLife\n\nEarly years\n\nAlbert Camus was born on 7 November 1913 in Mondovi (present-day Dréan), in French Algeria. His mother was of Spanish descent and could only hear out of her left ear.Lottman 1979, p.11 His father, Lucien, a poor agricultural worker of Alsatian descent, was wounded in the Battle of the Marne in 1914 during World War I, while serving as a member of a Zouave infantry regiment. Lucien died from his wounds in a makeshift army hospital on 11 October.His death is confirmed in the article 'The Master of the Absurd Turns 100', in the September/October 2013 issue of Philosophy Now magazine. The article can be accessed here [http://philosophynow.org/issues/98/The_Master_of_the_Absurd_Turns_100]  Camus and his mother, an illiterate house cleaner, lived without many basic material possessions during his childhood in the Belcourt section of Algiers.\n\nIn 1923, Camus gained acceptance into the  and eventually was admitted to the University of Algiers. After contracting tuberculosis in 1930, he had to end his football activities: he had been a goalkeeper for a prominent Algerian university team. In addition, he was only able to study part-time. To earn money, he took odd jobs: as a private tutor, car parts clerk, and assistant at the Meteorological Institute. He completed his licence de philosophie (BA) in 1936; in May 1936, he successfully presented his thesis on Plotinus, \"Rapports de l'hellénisme et du christianisme à travers les oeuvres de Plotin et de saint Augustin\" (\"Relationship of Greek and Christian thought in Plotinus and St. Augustine\"),Alan D. Schrift (2006), Twentieth-Century French Philosophy: Key Themes And Thinkers, Blackwell Publishing, p. 109. for his ' (roughly equivalent to an MA thesis).\n\nCamus joined the French Communist Party in early 1935, seeing it as a way to \"fight inequalities between Europeans and 'natives' in Algeria.\" He did not suggest he was a Marxist or that he had read Das Kapital, but did write, \"We might see communism as a springboard and asceticism that prepares the ground for more spiritual activities.\" In 1936, the independence-minded Algerian Communist Party (PCA) was founded. Camus joined the activities of the Algerian People's Party (Le Parti du Peuple Algérien), which got him into trouble with his Communist party comrades, who in 1937 denounced him as a Trotskyite and expelled him from the party. Camus then became associated with the French anarchist movement.\n\nThe anarchist André Prudhommeaux first introduced him at a meeting in 1948 of the Cercle des Étudiants Anarchistes (Anarchist Student Circle) as a sympathiser familiar with anarchist thought. Camus wrote for anarchist publications such as Le Libertaire, La révolution Prolétarienne, and Solidaridad Obrera (Workers' Solidarity), the organ of the anarcho-syndicalist CNT (National Confederation of Labor). Camus stood with the anarchists when they expressed support for the uprising of 1953 in East Germany. He again allied with the anarchists in 1956, first in support of the workers' uprising in Poznań, Poland, and then later in the year with the Hungarian Revolution.\n\nCamus was irreligious.David Simpson writes that Camus affirmed \"a defiantly atheistic creed.\" [http://www.iep.utm.edu/c/camus.htm Albert Camus (1913–1960)], The Internet Encyclopedia of Philosophy, 2006, (Accessed June 14, 2007). “I do not believe in God and I am not an atheist.” ~Notebooks 1951-1959. He told Le Monde in 1956, \"I would agree with Benjamin Constant, who thought a lack of religion was vulgar and even hackneyed.\"\n\nMarriage\n\nIn 1934, Camus married Simone Hié, but the marriage ended as a consequence of infidelities on both sides. In 1935, he founded Théâtre du Travail (Worker's Theatre), renamed Théâtre de l'Equipe (Theatre of the Team) in 1937. It lasted until 1939. From 1937 to 1939 he wrote for a socialist paper, Alger-Républicain. His work included a report on the poor conditions for peasants in Kabylie, which apparently cost him his job. From 1939 to 1940, he briefly wrote for a similar paper, Soir-Republicain. He was rejected by the French army because of his tuberculosis.\n\nIn 1940, Camus married Francine Faure, a pianist and mathematician. Although he loved her, he had argued passionately against the institution of marriage, dismissing it as unnatural. Even after Francine gave birth to twins, Catherine and Jean, on 5 September 1945, he continued to joke to friends that he was not cut out for marriage. Camus had numerous affairs, particularly an irregular and eventually public affair with the Spanish-born actress María Casares. In the same year, Camus began to work for Paris-Soir magazine. In the first stage of World War II, during the so-called Phoney War, Camus was a pacifist. While in Lyon during the Wehrmacht occupation, on 15 December 1941, Camus read about the Paris execution of Gabriel Péri; it crystallized his revolt against the Germans. He moved to Bordeaux with the rest of the staff of Paris-Soir. In the same year he finished his first books, The Stranger and The Myth of Sisyphus. He returned briefly to Oran, Algeria, in 1942.\n\nFootball\n\nCamus was once asked by his friend Charles Poncet which he preferred, football or the theatre. Camus is said to have replied, \"Football, without hesitation.\"\n\nCamus played as goalkeeper for Racing Universitaire d'Alger (RUA won both the North African Champions Cup and the North African Cup twice each in the 1930s) junior team from 1928 to 1930. The sense of team spirit, fraternity, and common purpose appealed to Camus enormously. In match reports Camus would often attract positive comment for playing with passion and courage. Any football  ambitions disappeared when he contracted tuberculosis at the age of 17. The affliction, which was then incurable, caused Camus to be bedridden for long and painful periods.\n\nWhen Camus was asked in the 1950s by an alumni sports magazine for a few words regarding his time with the RUA, his response included the following: \"After many years during which I saw many things, what I know most surely about morality and the duty of man I owe to sport and learned it in the RUA.\" Camus was referring to a sort of simplistic morality he wrote about in his early essays, the principle of sticking up for your friends, of valuing bravery and fair-play. Camus's belief was that political and religious authorities try to confuse us with over-complicated moral systems to make things appear more complex than they really are, potentially to serve their own needs.\n\nA professional footballer appears as a character in The Plague and football is discussed in the dialogue.\n\nRevolutionary Union Movement and Europe\n\nAs he wrote in L'Homme révolté (The Rebel), in the chapter about \"The Thought on Midday\", Camus was a follower of the ancient Greek 'Solar Tradition' (la pensée solaire). In 1947–48, he founded the Revolutionary Union Movement (Groupes de liaison internationale – GLI) a trade union movement in the context of revolutionary syndicalism (Syndicalisme révolutionnaire). According to Olivier Todd, in his biography Albert Camus, une vie, it was a group opposed to some tendencies of the Surrealist movement of André Breton. For more, see the book Alfred Rosmer et le mouvement révolutionnaire international by Christian Gras.\n\nHis colleagues were Nicolas Lazarévitch, Louis Mercier, Roger Lapeyre, Paul Chauvet, Auguste Largentier, Jean de Boë (see the article: \"Nicolas Lazarévitch, Itinéraire d'un syndicaliste révolutionnaire\" by Sylvain Boulouque in the review Communisme, n° 61, 2000). His main aim was to express the positive side of surrealism and existentialism, rejecting the negativity and the nihilism of André Breton.\n\nFrom 1943, Albert Camus had correspondence with Altiero Spinelli who founded the European Federalist Movement in Milan—see Ventotene Manifesto and the book \"Unire l'Europa, superare gli stati\", Altiero Spinelli nel Partito d'Azione del Nord Italia e in Francia dal 1944 al 1945-annexed a letter by Altiero Spinelli to Albert Camus.\n\nIn 1944, Camus founded the \"French Committee for the European Federation\" (Comité Français pour la Féderation Européenne – CFFE) declaring that Europe \"can only evolve along the path of economic progress, democracy and peace if the nation states become a federation.\"\n\nFrom 22 to 25 March 1945, the first conference of the European Federalist Movement was organised in Paris with the participation of Albert Camus, George Orwell, Emmanuel Mounier, Lewis Mumford, André Philip, Daniel Mayer, François Bondy and Altiero Spinelli.See the book The Biography of Europe by Pan Drakopoulos. This specific branch of the European Federalist Movement disintegrated in 1957 after Winston Churchill's ideas about European integration rose to dominance.\n\nDeath\n\nCamus died on 4 January 1960 at the age of 46, in a car accident near Sens, in Le Grand Fossard in the small town of Villeblevin. In his coat pocket was an unused train ticket. He had planned to travel by train with his wife and children, but at the last minute he accepted his publisher's proposal to travel with him.\n\nThe driver of the Facel Vega HK500 car, , who was Camus's publisher and close friend, died five days after the accident. In August 2011, the Milan newspaper Corriere della Sera reported a theory that the writer had been the victim of a Soviet plot, but Camus's biographer, , did not consider it credible.Kim Willsher [https://www.theguardian.com/books/2011/aug/07/albert-camus-killed-by-kgb Albert Camus might have been killed by the KGB for criticising the Soviet Union, claims newspaper] The Observer, 7 August 2011 Camus was buried in the Lourmarin Cemetery, Lourmarin, Vaucluse, France.\n\nHe was the second-youngest recipient, at the age of 44, of the Nobel Prize in Literature, after Rudyard Kipling, at the age of 42.\n\nHe was survived by his wife and twin son and daughter, Jean and Catherine, who hold the copyrights to his work.\n\nTwo of Camus's works were published posthumously. The first, entitled A Happy Death (1970), featured a character named Patrice Mersault, comparable to The Stranger's Meursault. There is scholarly debate as to the relationship between the two books. The second was an unfinished novel, The First Man (1995), which Camus was writing before he died. The novel was an autobiographical work about his childhood in Algeria.\n\nLiterary career\n\nThe first publication of Camus (co-written by Jeanne-Paule Sicard, Yves Bourgeois and Alfred Poignant, and edited by Edmond Charlot) was Revolte dans les Asturies in May 1936. This concerned a revolt by Spanish miners brutally suppressed by the Spanish government. In May 1937 he wrote his first book L’Envers et l’Endroit – dedicated to Jean Grenier and edited by Charlot.\n \nDuring the war Camus joined the French Resistance cell Combat, which published an underground newspaper of the same name. This group worked against the Nazis, and in it Camus assumed the nom de guerre Beauchard. Camus became the paper's editor in 1943. He first met Sartre at the dress rehearsal of Sartre's play, The Flies, in June 1943.', by Simone de Beauvoir\n\nWhen the Allies liberated Paris in August 1944, Camus witnessed and reported the last of the fighting. Soon after the event on 6 August 1945, he was one of the few French editors to publicly express opposition and disgust to the United States' dropping the atomic bombs on Japan. He resigned from Combat in 1947 when it became a commercial paper. After the war, Camus began frequenting the Café de Flore on the Boulevard Saint-Germain in Paris with Sartre and others. He also toured the United States to lecture about French thought. Although he leaned left, politically, his strong criticisms of Communist doctrine did not win him any friends in the Communist parties and eventually alienated Sartre.\n\nIn 1949, his tuberculosis returned, whereupon he lived in seclusion for two years. In 1951, he published The Rebel, a philosophical analysis of rebellion and revolution which expressed his rejection of communism. Upsetting many of his colleagues and contemporaries in France, the book brought about the final split with Sartre. The dour reception depressed Camus; he began to translate plays.\n\nCamus's first significant contribution to philosophy was his idea of the absurd. He saw it as the result of our desire for clarity and meaning within a world and condition that offers neither, which he expressed in The Myth of Sisyphus and incorporated into many of his other works, such as The Stranger and The Plague. Despite his split from his \"study partner\", Sartre, Camus was still categorized as an Existentialist. He specifically rejected that label in his essay \"Enigma\" and elsewhere.See: The Lyrical and Critical Essays of Albert Camus The current confusion arises, in part, because many recent applications of existentialism have much in common with many of Camus's practical ideas (see: Resistance, Rebellion, and Death). But, his personal understanding of the world (e.g., \"a benign indifference\", in The Stranger), and every vision he had for its progress (e.g., vanquishing the \"adolescent furies\" of history and society, in The Rebel) undoubtedly set him apart.\n\nIn the 1950s, Camus devoted his efforts to human rights. In 1952, he resigned from his work for UNESCO when the UN accepted Spain as a member under the leadership of General Franco. In 1953, he criticized Soviet methods to crush a workers' strike in East Berlin. In 1956, he protested against similar methods in Poland (protests in Poznań) and the Soviet repression of the Hungarian revolution in October.\n\nCamus maintained his pacifism and resisted capital punishment anywhere in the world. He wrote an essay against capital punishment in collaboration with Arthur Koestler, the writer, intellectual and founder of the League Against Capital Punishment. He was consistent in his call for non-aggression in Algeria (see below).\n\nFrom 1955 to 1956, Camus wrote for L'Express. In 1957, he was awarded the Nobel Prize in literature \"for his important literary production, which with clear-sighted earnestness illuminates the problems of the human conscience in our times\".\n\nCamus remained active and ambitious until the end of his life. Financed by the money he received with his Nobel Prize, he adapted and directed for the stage Dostoyesvsky's Demons. The play opened in January 1959 at the Antoine Theatre in Paris. It was a critical success as well as an artistic and technical tour de force: 33 actors, 4 hours long, 7 sets, 24 scenes. The walls could move sideways to reduce the size of each depicted location and the whole stage rotated to allow for immediate set transformations. Camus put the painter and set decorator Mayo, who had already illustrated several of Camus' novels (The Stranger - 1948 Ed.), in charge of the demanding task of designing these multiple and complex theater sets.\n\nAlgeria \n\nCamus once confided that the troubles in Algeria \"affected him as others feel pain in their lungs.\"\n\nIn the 1930s, Camus was affiliated with Left-wing groups like the Maison de Culture in Algiers which were highly critical of the French colonial regime's treatment of Algeria's Arab and indigenous inhabitants, supporting the Blum-Viollette proposal to grant Algerians full French citizenship.  His 1938 address on \"The New Mediterranean Culture\" represents Camus' most systematic statement on his views at this time.  In 1939, Camus wrote a stinging series of articles for Alger Republicain on the atrocious living conditions of the inhabitants of the Kabylie highlands, advocating for economic, educational and political reforms as a matter of emergency.\n\nIn 1945, following the Sétif and Guelma massacre after Arab revolts against French mistreatment, Camus was one of only a few mainland journalists to visit the colony, again writing a series of article reports on conditions, and advocating for French concessions and reforms to the demands of the Algerian people.\n\nWhen the Algerian War began in 1954, Camus was confronted with a moral dilemma. He identified with the Pieds-Noirs such as his own parents and defended the French government's actions against the revolt. He argued that the Algerian uprising was an integral part of the 'new Arab imperialism' led by Egypt and an 'anti-Western' offensive orchestrated by Russia to 'encircle Europe' and 'isolate the United States'.Actuelles III: Chroniques Algeriennes, 1939–58 Although favoring greater Algerian autonomy or even federation, though not full-scale independence, he believed that the Pieds-Noirs and Arabs could co-exist. During the war he advocated a civil truce that would spare the civilians, which was rejected by both sides, who regarded it as foolish. Behind the scenes, he began to work for imprisoned Algerians who faced the death penalty.\n\nWhen he spoke to students at the University of Stockholm, he defended his apparent inactivity in the Algerian question; he stated that he was worried about what might happen to his mother, who still lived in Algeria. This led to further ostracism by French left-wing intellectuals. At the time of his death, Camus was working on an incomplete novel with a strong biographical component titled The First Man.  The publication of this book in 1994 has sparked a widespread reconsideration of Camus' allegedly unrepentant colonialism in the work of figures such as David Carroll in the English-speaking world.\n\nPhilosophy\n\nExistentialism\n\nAs one of the forefathers of existentialism, Camus focused most of his philosophy around existential questions. The absurdity of life and its inevitable ending (death) is highlighted in the very famous opening of the novel The Stranger (1942): \"Mother died today. Or maybe yesterday; I can't be sure.\". This alludes to his claim that life is engrossed by the absurd. He believed that the absurd - life being void of meaning, or mans' inability to know that meaning if it were to exist - was something that man should embrace. He argued that this crises of self could cause a man to commit (\"philosophical suicide\"); choosing to believe in external sources that give life (what he would describe as false) meaning. He claimed that religion was the main culprit. If a man chose to believe in religion - that the meaning of life was ascend to heaven, or some similar afterlife, that he committed philosophical suicide by trying to escape the absurd.\n\nAbsurdism\n\nMany writers have addressed the Absurd, each with his or her own interpretation of what the Absurd is and what comprises its importance. For example, Sartre recognizes the absurdity of individual experience, while Kierkegaard explains that the absurdity of certain religious truths prevents us from reaching God rationally. Camus regretted the continued reference to himself as a \"philosopher of the absurd\". He showed less interest in the Absurd shortly after publishing Le Mythe de Sisyphe (The Myth of Sisyphus). To distinguish his ideas, scholars sometimes refer to the Paradox of the Absurd, when referring to \"Camus' Absurd\".\n\nHis early thoughts appeared in his first collection of essays, L'Envers et l'endroit (Betwixt and Between) in 1937. Absurd themes were expressed with more sophistication in his second collection of essays, Noces (Nuptials), in 1938. In these essays Camus reflects on the experience of the Absurd. In 1942 he published the story of a man living an absurd life as L'Étranger (The Stranger). In the same year he released Le Mythe de Sisyphe (The Myth of Sisyphus), a literary essay on the Absurd. He also wrote a play about Caligula, a Roman Emperor, pursuing an absurd logic. The play was not performed until 1945.\n\nThe turning point in Camus's attitude to the Absurd occurs in a collection of four letters to an anonymous German friend, written between July 1943 and July 1944. The first was published in the Revue Libre in 1943, the second in the Cahiers de Libération in 1944, and the third in the newspaper Libertés, in 1945. The four letters were published as Lettres à un ami allemand (Letters to a German Friend) in 1945, and were included in the collection Resistance, Rebellion, and Death.\n\nIdeas on the absurd\n\nCamus presents the reader with dualisms such as happiness and sadness, dark and light, life and death, etc. He emphasizes the fact that happiness is fleeting and that the human condition is one of mortality; for Camus, this is cause for a greater appreciation for life and happiness. In Le Mythe, dualism becomes a paradox: we value our own lives in spite of our mortality and in spite of the universe's silence. While we can live with a dualism (I can accept periods of unhappiness, because I know I will also experience happiness to come), we cannot live with the paradox (I think my life is of great importance, but I also think it is meaningless). In Le Mythe, Camus investigates our experience of the Absurd and asks how we live with it. Our life must have meaning for us to value it. If we accept that life has no meaning and therefore no value, should we kill ourselves?\n\nIn Le Mythe, Camus suggests that 'creation of meaning' would entail a logical leap or a kind of philosophical suicide in order to find psychological comfort.  But Camus wants to know if he can live with what logic and lucidity have uncovered – if one can build a foundation on what one knows and nothing more. Creation of meaning is not a viable alternative but a logical leap and an evasion of the problem. He gives examples of how others would seem to make this kind of leap. The alternative option, namely suicide, would entail another kind of leap, where one attempts to kill absurdity by destroying one of its terms (the human being). Camus points out, however, that there is no more meaning in death than there is in life, and that it simply evades the problem yet again. Camus concludes that we must instead \"entertain\" both death and the absurd, while never agreeing to their terms.\n\nMeursault, the absurdist hero of L'Étranger, has killed a man and is scheduled to be executed. Caligula ends up admitting his absurd logic was wrong and is killed by an assassination he has deliberately brought about. However, while Camus possibly suggests that Caligula's absurd reasoning is wrong, the play's anti-hero does get the last word, as the author similarly exalts Meursault's final moments.\n\nCamus made a significant contribution to a viewpoint of the Absurd, and always rejected nihilism as a valid response. If nothing had any meaning, you would be right. But there is something that still has a meaning. — Second Letter to a German Friend, December 1943.\n\nCamus's understanding of the Absurd promotes public debate; his various offerings entice us to think about the Absurd and offer our own contribution. Concepts such as cooperation, joint effort and solidarity are of key importance to Camus, though they are most likely sources of 'relative' versus 'absolute' meaning. In The Rebel, Camus identifies rebellion (or rather, the values indicated by rebellion) as a basis for human solidarity. When he rebels, a man identifies himself with other men and so surpasses himself, and from this point of view human solidarity is metaphysical. But for the moment we are only talking of the kind of solidarity that is born in chains. \n\nThe Myth of Sisyphus\n\nDespite his opposition to the label, Camus addressed one of the fundamental questions of existentialism: the problem of suicide. He wrote, \"There is only one really serious philosophical question, and that is suicide. Deciding whether or not life is worth living is to answer the fundamental question in philosophy. All other questions follow from that.\" Camus viewed the question of suicide as arising naturally as a solution to the absurdity of life. In The Myth of Sisyphus, Camus seeks to identify the kinds of life that could be worth living despite their inherent meaninglessness.\n\nViews on totalitarianism\n\nThroughout his life, Camus spoke out against and actively opposed totalitarianism in its many forms. Early on, Camus was active within the French Resistance to the German occupation of France during World War II, even directing the famous Resistance journal, Combat. On the French collaboration with Nazi occupiers he wrote: \"Now the only moral value is courage, which is useful here for judging the puppets and chatterboxes who pretend to speak in the name of the people.\" After liberation, Camus remarked, \"This country does not need a Talleyrand, but a Saint-Just.\" The reality of the bloody postwar tribunals soon changed his mind: Camus publicly reversed himself and became a lifelong opponent of capital punishment.\n\nCamus's well-known falling out with Sartre is linked to his opposition to authoritarian communism. Camus detected a reflexive totalitarianism in the mass politics espoused by Sartre in the name of Marxism. This was apparent in his work L'Homme Révolté (The Rebel) which not only was an assault on the Soviet police state, but also questioned the very nature of mass revolutionary politics and ideas. Camus continued to speak out against the atrocities of the Soviet Union, a sentiment captured in his 1957 speech, The Blood of the Hungarians, commemorating the anniversary of the 1956 Hungarian Revolution, an uprising crushed in a bloody assault by the Red Army.\n\nPhilhellenism, debts to Greek classical thought \n\nOne further important, often neglected component of Camus' philosophical and literary persona was his love of classical Greek thought and literature, or philhellenism.  This love looks back to his youthful encounters with Friedrich Nietzsche, his teacher Jean Grenier, and his own sense of a \"Mediterranean\" identity, based in a common experience of sunshine, beaches, and living in proximity to the near-Eastern world.  Camus' Diplomes thesis (roughly like an MA thesis in most anglophone countries) was on the transition between classical Greek and Roman, and Christian culture, featuring chapters on the early Church, gnosticism, Plotinus and Saint Augustine's \"second revelation\", bringing Greek philosophical conceptuality to Christian revelation.  Camus' early essay collection Noces (Nuptials) features essays set amidst classical Roman ruins; as the Myth of Sisyphus and The Rebel (which takes as its hero Prometheus) both are rooted in Camus' classical paideia.  The culmination of the latter work defends a \"midday thought\" based in classical moderation or mesure, in opposition to the tendency of modern political ideologies to exclusively valorise race or class, and to dream of a total redemptive revolution.  Camus' conception of classical moderation also has deep roots in his lifelong love of Greek tragic theatre, about which he gave an intriguing address in Athens in 1956. He appealed to Queen Elizabeth II for mercy for the young Greek Cypriot anti colonial freedom fighter Michalis Karaolis, who was sentenced to death in 1956.[https://www.academia.edu/11727557/The_Pleiade_in_Cyprus_French_Authors_and_the_Island_of_Aphrodite Demetra Demetriou The pleiade in Cyprus: French authors and the island of Aphrodite p.303]  Camus letter was acquired from auction by Nasos Ktorides and donated to the National Struggle Museum in Nicosia.[http://www.financialmirror.com/news-details.php?nid\n35509 Remembering Karaolis - a historical document by Albert Camus, Financial mirror 28 March, 2017]\n\nWorks\n\nNovels\n\n* The Stranger (L'Étranger, often translated as The Outsider) (1942)\n* The Plague (La Peste) (1947)\n* The Fall (La Chute) (1956)\n* A Happy Death (La Mort heureuse) (written 1936–38, published posthumously 1971)\n* The First Man (Le premier homme) (incomplete, published posthumously 1995)\n\nShort stories\n\n* Exile and the Kingdom (L'exil et le royaume) (collection, 1957) containing the following short stories:\n** The Adulterous Woman (La Femme adultère)\n** The Renegade or a Confused Spirit (Le Renégat ou un esprit confus)\n** The Silent Men (Les Muets)\n** The Guest (L'Hôte)\n** Jonas or the Artist at Work (Jonas ou l’artiste au travail)\n** The Growing Stone (La Pierre qui pousse)\n\nNon-fiction books\n\n* Christian Metaphysics and Neoplatonism (1935)\n* Betwixt and Between (L'envers et l'endroit, also translated as The Wrong Side and the Right Side) (collection, 1937)\n* Nuptials (Noces) (1938)\n* The Myth of Sisyphus (Le Mythe de Sisyphe) (1942)\n* The Rebel (L'Homme révolté) (1951)\n* Notebooks 1935–1942 (Carnets, mai 1935 —fevrier 1942) (1962)\n* Notebooks 1943–1951 (1965)\n* Notebooks 1951–1959 (2008) Published as \"Carnets Tome III : Mars 1951 – December 1959\" (1989)\n* Algerian Chronicles (2013)Harvard University Press ()[https://www.wsj.com/articles/SB10001424127887323335404578444562558795632 Betwixt and Between] by James Campbell - Wall Street Journal (3 May 2013 review)[http://bookforum.com/inprint/020_01/11228 Resistance, Rebellion, and Writing], by George Scialabba - bookforum.com April / May 2013\n* Albert Camus, Maria Casarès. Correspondance inédite (1944-1959) Avant-propos de Catherine Camus (2017)\n\nPlays\n\n* Caligula (performed 1945, written 1938)\n* The Misunderstanding (Le Malentendu) (1944)\n* The State of Siege (L'État de Siège) (1948)\n* The Just Assassins (Les Justes) (1949)\n* Requiem for a Nun (Requiem pour une nonne, adapted from William Faulkner's novel by the same name) (1956)\n* The Possessed (Les Possédés, adapted from Fyodor Dostoyevsky's novel Demons) (1959)\n\nEssays\n\n* The Crisis of Man (Lecture at Columbia University) (March 28, 1946)[https://www.scribd.com/document/341261228/The-Human-Crisis-Albert-Camus-Lecture The Human Crisis - Albert Camus Lecture at scribd.com]\n* Neither Victims Nor Executioners (Series of essays in Combat) (1946)\n* Why Spain? (Essay for the theatrical play L' Etat de Siège) (1948)\n* The Ancient Greek Tragedy (Parnassos lecture in Greece) (1956)\n* Reflections on the Guillotine (Réflexions sur la guillotine) (Extended essay, 1957)\n* Create Dangerously (Essay on Realism and Artistic Creation, lecture at the University of Uppsala in Sweden) (1957)\n\nCollected essays\n\n* Resistance, Rebellion, and Death (1961) – a collection of essays selected by the author, including the 1945 Lettres à un ami allemand (Letters to a German Friend) and A Defense of Intelligence, a 1945 speech given at a meeting organized by Amitié FrançaiseOrme, Mark (2007). [https://books.google.com/books?idVGBSVdHwmUYC&lpg\nPA139&dq%22A%20Defense%20of%20Intelligence%22%20%22transform%20our%20appetite%20for%20hatred%20into%20a%20desire%20for%20justice%22&hl\nen&pgPA139#v\nonepage&q%22A%20Defense%20of%20Intelligence%22%20%22transform%20our%20appetite%20for%20hatred%20into%20a%20desire%20for%20justice%22&f\nfalse The Development of Albert Camus's Concern for Social and Political Justice], Fairleigh Dickinson University Press, \n* Lyrical and Critical Essays (1970)\n* Youthful Writings (1976)\n* Between Hell and Reason: Essays from the Resistance Newspaper \"Combat\", 1944–1947 (1991)\n* Camus at \"Combat\": Writing 1944–1947 (2005)\n* Albert Camus Contre la Peine de Mort (2011). Albert Camus. http://en.wikipedia.org/?curid=983."
  }
}
