{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1542",
  "eid" : "ba6c2a20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778392514,
  "textBody" : "Amaranthus, collectively known as amaranth, is a cosmopolitan genus of annual or short-lived perennial plants. Some amaranth species are cultivated as leaf vegetables, pseudocereals, and ornamental plants. Most of the Amaranthus species are summer annual weeds and are commonly referred to as pigweed.Bensch et al. (2003). Interference of redroot pigweed (Amaranthus retroflexus), Palmer amaranth (A. palmeri), and common waterhemp (A. rudis) in soybean. Weed Science 51: 37–43. Catkin-like cymes of densely packed flowers grow in summer or autumn. Approximately 60 species are recognized, with inflorescences and foliage ranging from purple, through red and green to gold. Members of this genus share many characteristics and uses with members of the closely related genus Celosia.\n\n\"Amaranth\" derives from Greek  (amárantos), \"unfading\", with the Greek word for \"flower\",  (ánthos), factoring into the word's development as amaranth. Amarant is an archaic variant.\n\nTaxonomy \n\nAmaranthus shows a wide variety of morphological diversity among and even within certain species. Although the family (Amaranthaceae) is distinctive, the genus has few distinguishing characters among the 70 species included. This complicates taxonomy and Amaranthus has generally been considered among systematists as a \"difficult\" genus.\n\nFormerly, Sauer (1955) classified the genus into two subgenera, differentiating only between monoecious and dioecious species: Acnida (L.) Aellen ex K.R. Robertson and Amaranthus. Although this classification was widely accepted, further infrageneric classification was (and still is) needed to differentiate this widely diverse group.\n\nCurrently, Amaranthus includes three recognized subgenera and 70 species, although species numbers are questionable due to hybridization and species concepts.Judd et al. (2008). Plant Systematics: A Phylogenetic Approach, Third Edition. Sinauer Associates, Inc. Sunderland, MA Infrageneric classification focuses on inflorescence, flower characters and whether a species is monoecious/dioecious, as in the Sauer (1955) suggested classification. A modified infrageneric classification of Amaranthus was published by Mosyakin & Robertson (1996) and includes three subgenera: Acnida, Amaranthus, and Albersia. The taxonomy is further differentiated by sections within each of the subgenera.\n\nSpecies \n\nSpecies include:\n\n* Amaranthus acanthochiton – greenstripe\n* Amaranthus acutilobus – a synonym of Amaranthus viridis\n* Amaranthus albus – white pigweed, tumble pigweed\n* Amaranthus anderssonii\n* Amaranthus arenicola – sandhill amaranth\n* Amaranthus australis – southern amaranth\n* Amaranthus bigelovii – Bigelow's amaranth\n* Amaranthus blitoides – mat amaranth, prostrate amaranth, prostrate pigweed\n* Amaranthus blitum – purple amaranth\n* Amaranthus brownii – Brown's amaranth\n* Amaranthus californicus – California amaranth, California pigweed\n* Amaranthus cannabinus – tidal-marsh amaranth\n* Amaranthus caudatus – love-lies-bleeding, pendant amaranth, tassel flower, quilete\n* Amaranthus chihuahuensis – Chihuahuan amaranth\n* Amaranthus crassipes – spreading amaranth\n* Amaranthus crispus – crispleaf amaranth\n* Amaranthus cruentus – purple amaranth, red amaranth, Mexican grain amaranth\n* Amaranthus deflexus – large-fruit amaranth\n* Amaranthus dubius – spleen amaranth, khada sag\n* Amaranthus fimbriatus – fringed amaranth, fringed pigweed\n* Amaranthus floridanus – Florida amaranth\n* Amaranthus furcatus\n* Amaranthus graecizans\n* Amaranthus grandiflorus\n* Amaranthus greggii – Gregg's amaranth\n* Amaranthus hybridus – smooth amaranth, smooth pigweed, red amaranth\n* Amaranthus hypochondriacus – Prince-of-Wales feather, prince's feather\n* Amaranthus interruptus – Australian amaranth\n* Amaranthus minimus\n* Amaranthus mitchellii\n* Amaranthus muricatus – African amaranth\n* Amaranthus obcordatus – Trans-Pecos amaranth\n* Amaranthus palmeri – Palmer's amaranth, Palmer pigweed, careless weed\n* Amaranthus polygonoides – tropical amaranth\n* Amaranthus powellii – green amaranth, Powell amaranth, Powell pigweed\n* Amaranthus pringlei – Pringle's amaranth\n* Amaranthus pumilus – seaside amaranth\n* Amaranthus retroflexus – red-root amaranth, redroot pigweed, common amaranth\n* Amaranthus scleranthoides – variously Amaranthus sclerantoides\n* Amaranthus scleropoides – bone-bract amaranth\n* Amaranthus spinosus – spiny amaranth, prickly amaranth, thorny amaranth\n* Amaranthus standleyanus\n* Amaranthus thunbergii – Thunberg's amaranth\n* Amaranthus torreyi – Torrey's amaranth\n* Amaranthus tricolor – Joseph's-coat\n* Amaranthus tuberculatus – rough-fruit amaranth, tall waterhemp\n* Amaranthus viridis – slender amaranth, green amaranth\n* Amaranthus watsonii – Watson's amaranth\n* Amaranthus wrightii – Wright's amaranth\n\nNutrition\n\nOne cup (2.4 dl, 245 g) of cooked amaranth grain (from about 65 g raw) provides 251 calories and is an excellent source (20% or more of the Daily Value, DV) of protein, dietary fiber, and some dietary minerals. Amaranth is particularly rich in manganese (105% DV), magnesium (40% DV), iron (29% DV), and selenium (20% DV). Cooked amaranth leaves are a rich source of vitamin A, vitamin C, calcium, manganese, and folate. Amaranth does not contain gluten.\n\nAmaranth contains phytochemicals that may be antinutrient factors, such as polyphenols, saponins, tannins, and oxalates which are reduced in content and effect by cooking.\n\nHuman uses \n\nHistory \n\nKnown to the Aztecs as huauhtli, amaranth is thought to have represented up to 80% of their energy consumption before the Spanish conquest. Another important use of amaranth throughout Mesoamerica was to prepare ritual drinks and foods. To this day, amaranth grains are toasted much like popcorn and mixed with honey, molasses, or chocolate to make a treat called alegría, meaning \"joy\" in Spanish. Diego Durán described the festivities for Huitzilopochtli, the name of which means \"hummingbird of the left side\" or \"left-handed hummingbird\" (Real hummingbirds feed on amaranth flowers). The Aztec month of Panquetzaliztli (7 December to 26 December) was dedicated to Huitzilopochtli.  People decorated their homes and trees with paper flags; ritual races, processions, dances, songs, prayers, and finally human sacrifices were held. This was one of the more important Aztec festivals, and the people prepared for the whole month. They fasted or ate very little; a statue of the god was made out of amaranth seeds and honey, and at the end of the month, it was cut into small pieces so everybody could eat a little piece of the god. After the Spanish conquest, cultivation of amaranth was outlawed, while some of the festivities were subsumed into the Christmas celebration.\n\nBecause of its importance as a symbol of indigenous culture, its gluten-free palatability, ease of cooking, and a protein that is particularly well-suited to human nutritional needs, interest in grain amaranth (especially A. cruentus and A. hypochondriacus) revived in the 1970s. It was recovered in Mexico from wild varieties and is now commercially cultivated. It is a popular snack sold in Mexico, sometimes mixed with chocolate or puffed rice, and its use has spread to Europe and parts of North America.  Amaranth and quinoa are not grasses and are called pseudocereals because of their similarities to cereals in flavor and cooking.\n\nSeed \n\nSeveral species are raised for amaranth \"grain\" in Asia and the Americas.\n\nAncient amaranth grains still used include the three species, Amaranthus caudatus, Amaranthus cruentus, and Amaranthus hypochondriacus.Costea et al. (2006). Delimitation of A. cruentus L. and A. caudatus L. using micromorphology and AFLP analysis: an application in germplasm identification. Genetic Resources and Crop Evolution 53: 1625-1633. Although amaranth was cultivated on a large scale in ancient Mexico, Guatemala, and Peru, nowadays it is only cultivated on a small scale there, along with India, China, Nepal, and other tropical countries; thus, the potential exists for further cultivation in those countries, as well as in the U.S. In a 1977 article in Science, amaranth was described as \"the crop of the future\".Marx (1977). Speaking of Science: Amaranth: A Comeback for the Food of the Aztecs? Science 198(4312): 40. It has been proposed as an inexpensive native crop that could be cultivated by indigenous people in rural areas for several reasons:\n* It is easily harvested.\n* Its seeds are a good source of protein.De Macvean & Pöll (1997). Chapter 8: Ethnobotany. Tropical Tree Seed Manual, USDA Forest Service, edt. J.A Vozzo.\n* In cooked and edible forms, amaranth retains adequate content of several dietary minerals.\n* It is easy to cook.\n* As befits its weedy life history, amaranth grains grow rapidly and, in three cultivated species of amaranth, their large seedheads can weigh up to 1 kg and contain a half-million small seeds.Tucker, J. (1986). Amaranth: the once and future crop. Bioscience 36(1): 9-13.\n\nLeaves, roots, and stems \n\nAmaranth species are cultivated and consumed as a leaf vegetable in many parts of the world. Four species of Amaranthus are documented as cultivated vegetables in eastern Asia: Amaranthus cruentus, Amaranthus blitum, Amaranthus dubius, and Amaranthus tricolor.Costea (2003). Notes on Economic Plants. Economic Botany 57(4): 646-649\n\nIn Indonesia and Malaysia, leaf amaranth is called bayam. In the Philippines, the Ilocano word for the plant is kalunay; the Tagalog word for the plant is kilitis or kulitis. In Uttar Pradesh and Bihar in India, it is called chaulai and is a popular green leafy vegetable (referred to in the class of vegetable preparations called saag). It is called chua in Kumaun area of Uttarakhand, where it is a popular red-green vegetable. In Karnataka in India, it is called harive. It is used to prepare curries such as hulee, palya, majjigay-hulee, and so on. In Kerala, it is called cheera and is consumed by stir-frying the leaves with spices and red chillies to make cheera thoran. In Tamil Nadu, it is called mulaikkira and is regularly consumed as a favourite dish, where the greens are steamed, and mashed, with light seasoning of salt, red chili, and cumin. It is  called keerai masial.  In Andhra Pradesh, this leaf is added in preparation of a popular dal called thotakura pappu in (Telugu). In Maharashtra, it is called shravani maath and is available in both red and white colour. In Orissa, it is called khada saga, it is used to prepare saga bhaja, in which the leaf is fried with chili and onions.\n\nIn China, the leaves and stems are used as a stir-fry vegetable, or in soups. In Vietnam, it is called rau dền and is used to make soup. Two species are popular as edible vegetable in Vietnam: dền đỏ- Amaranthus tricolor and dền cơm or dền trắng- Amaranthus viridis.\n\nA traditional food plant in Africa, amaranth has the potential to improve nutrition, boost food security, foster rural development and support sustainable land care.\n\nIn Bantu regions of Uganda and western Kenya, it is known as doodo or litoto. It is also known among the Kalenjin as a drought crop (chepkerta). In Lingala (spoken in the Congo), it is known as lɛngalɛnga or bítɛkutɛku. In Nigeria, it is a common vegetable and goes with all Nigerian starch dishes. It is known in Yoruba as shoko a short form of shokoyokoto (meaning make the husband fat) or arowo jeja (meaning \"we have money left over for fish\"). In the Caribbean, the leaves are called bhaji in Trinidad and callaloo in Jamaica, and are sautéed with onions, garlic, and tomatoes, or sometimes used in a soup called pepperpot soup. In Botswana, it is referred to as morug and cooked as a staple green vegetable.\n\nIn Greece, green amaranth (A. viridis) is a popular dish called βλήτα, vlita or vleeta. It is boiled, then served with olive oil and lemon juice like a salad, sometimes alongside fried fish. Greeks stop harvesting the plant (which also grows wild) when it starts to bloom at the end of August.\n\nIn Brazil, green amaranth was, and to a degree still is, frequently regarded as an invasive species as all other species of amaranth (except the generally imported A. caudatus cultivar), though some have traditionally appreciated it as a leaf vegetable, under the names of  or , which is consumed cooked, generally accompanying the staple food, rice and beans.\n\nOil\n\nMaking up about 5% of the total fatty acids of amaranth, squalene is extracted as a vegetable-based alternative to the more expensive shark oil for use in dietary supplements and cosmetics.\n\nDyes \n\nThe flowers of the 'Hopi Red Dye' amaranth were used by the Hopi (a tribe in the western United States) as the source of a deep red dye.  Also a synthetic dye was named \"amaranth\" for its similarity in color to the natural amaranth pigments known as betalains. This synthetic dye is also known as Red No. 2 in North America and E123 in the European Union.\"The following color additives are not authorized for use in food products in the United States: (1) Amaranth (C.I. 16185, EEC No. E123, formerly certifiable as FD&C red No. 2);\" [http://www.cfsan.fda.gov/~comm/cp03803.html FDA/CFSAN Food Compliance Program: Domestic Food Safety Program] \n\nOrnamentals \n\nThe genus also contains several well-known ornamental plants, such as Amaranthus caudatus (love-lies-bleeding), a vigorous, hardy annual with dark purplish flowers crowded in handsome drooping spikes. Another Indian annual, A. hypochondriacus (prince's feather), has deeply veined, lance-shaped leaves, purple on the under face, and deep crimson flowers densely packed on erect spikes.\n\nAmaranths are recorded as food plants for some Lepidoptera (butterfly and moth) species including the nutmeg moth and various case-bearer moths of the genus Coleophora: C. amaranthella, C. enchorda (feeds exclusively on Amaranthus), C. immortalis (feeds exclusively on Amaranthus), C. lineapulvella, and C. versurella (recorded on A. spinosus).\n\nEcology \n\nAmaranth weed species have an extended period of germination, rapid growth, and high rates of seed production, and have been causing problems for farmers since the mid-1990s. This is partially due to the reduction in tillage, reduction in herbicidal use and the evolution of herbicidal resistance in several species where herbicides have been applied more often.Wetzel et al. (1999). Use of PCR-based molecular markers to identify weedy Amaranthus species. Weed Science 47: 518-523. The following 9 species of Amaranthus are considered invasive and noxious weeds in the U.S and Canada: A. albus, A. blitoides, A. hybridus, A. palmeri, A. powellii, A. retroflexus, A. spinosus, A. tuberculatus, and A. viridis.[http://plants.usda.gov/java/profile?symbol\nAMARA USDA Plant Database. Plants Profile- Amaranthus L]\n\nA new herbicide-resistant strain of Amaranthus palmeri has appeared; it is glyphosate-resistant and so cannot be killed by herbicides using the chemical. Also, this plant can survive in tough conditions. This could be of particular concern to cotton farmers using glyphosate-resistant cotton. The species Amaranthus palmeri (Palmer amaranth) causes the greatest reduction in soybean yields and has the potential to reduce yields by 17-68% in field experiments. Palmer amaranth is among the \"top five most troublesome weeds\" in the southeast of the United States and has already evolved resistances to dinitroaniline herbicides and acetolactate synthase inhibitors.Culpepper et al. (2006). Glyphosate-resistant Palmer amaranth (Amaranthus palmeri) confirmed in Georgia. Weed Science 54: 620-626. This makes the proper identification of Amaranthus species at the seedling stage essential for agriculturalists. Proper weed control needs to be applied before the species successfully colonizes in the crop field and causes significant yield reductions.\n\nImages\n\nFile:Amaranthus caudatus1.jpg|Love-lies-bleeding (Amaranthus caudatus)\nFile:Amaranthus.hybridus1web.jpg|Green Amaranth (A. hybridus)\nFile:Amaranth2.jpg|Seabeach amaranth (A. pumilus), an amaranth on the Federal Threatened species List\nFile:Illustration Amaranthus retroflexus0.jpg|Red-root Amaranth (A. retroflexus)—from Thomé, Flora von Deutschland, Österreich und der Schweiz 1885\nFile:Amaranthus.spinosus1web.jpg|Spiny Amaranth (Amaranthus spinosus)\nFile:Amaranthus.viridis1web.jpg|Green Amaranth (Amaranthus viridis)\nFile:Amaranth sp 2.jpg| Popping Amaranth (Amaranthus sp.)\nFile:Amaranth und WW.jpg|Amaranth grain (left) and wheat (right)\nFile:Travancore Cheera Thoran.JPG|Southern Kerala-style traditional Thoran made with Cheera (Amaranth) leaves\nFile:Fepm (8).jpg|Example from Chilpancingo",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Amaranth" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1542" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Amaranthus, collectively known as amaranth, is a cosmopolitan genus of annual or short-lived perennial plants. Some amaranth species are cultivated as leaf vegetables, pseudocereals, and ornamental plants. Most of the Amaranthus species are summer annual weeds and are commonly referred to as pigweed.Bensch et al. (2003). Interference of redroot pigweed (Amaranthus retroflexus), Palmer amaranth (A. palmeri), and common waterhemp (A. rudis) in soybean. Weed Science 51: 37–43. Catkin-like cymes of densely packed flowers grow in summer or autumn. Approximately 60 species are recognized, with inflorescences and foliage ranging from purple, through red and green to gold. Members of this genus share many characteristics and uses with members of the closely related genus Celosia.\n\n\"Amaranth\" derives from Greek  (amárantos), \"unfading\", with the Greek word for \"flower\",  (ánthos), factoring into the word's development as amaranth. Amarant is an archaic variant.\n\nTaxonomy \n\nAmaranthus shows a wide variety of morphological diversity among and even within certain species. Although the family (Amaranthaceae) is distinctive, the genus has few distinguishing characters among the 70 species included. This complicates taxonomy and Amaranthus has generally been considered among systematists as a \"difficult\" genus.\n\nFormerly, Sauer (1955) classified the genus into two subgenera, differentiating only between monoecious and dioecious species: Acnida (L.) Aellen ex K.R. Robertson and Amaranthus. Although this classification was widely accepted, further infrageneric classification was (and still is) needed to differentiate this widely diverse group.\n\nCurrently, Amaranthus includes three recognized subgenera and 70 species, although species numbers are questionable due to hybridization and species concepts.Judd et al. (2008). Plant Systematics: A Phylogenetic Approach, Third Edition. Sinauer Associates, Inc. Sunderland, MA Infrageneric classification focuses on inflorescence, flower characters and whether a species is monoecious/dioecious, as in the Sauer (1955) suggested classification. A modified infrageneric classification of Amaranthus was published by Mosyakin & Robertson (1996) and includes three subgenera: Acnida, Amaranthus, and Albersia. The taxonomy is further differentiated by sections within each of the subgenera.\n\nSpecies \n\nSpecies include:\n\n* Amaranthus acanthochiton – greenstripe\n* Amaranthus acutilobus – a synonym of Amaranthus viridis\n* Amaranthus albus – white pigweed, tumble pigweed\n* Amaranthus anderssonii\n* Amaranthus arenicola – sandhill amaranth\n* Amaranthus australis – southern amaranth\n* Amaranthus bigelovii – Bigelow's amaranth\n* Amaranthus blitoides – mat amaranth, prostrate amaranth, prostrate pigweed\n* Amaranthus blitum – purple amaranth\n* Amaranthus brownii – Brown's amaranth\n* Amaranthus californicus – California amaranth, California pigweed\n* Amaranthus cannabinus – tidal-marsh amaranth\n* Amaranthus caudatus – love-lies-bleeding, pendant amaranth, tassel flower, quilete\n* Amaranthus chihuahuensis – Chihuahuan amaranth\n* Amaranthus crassipes – spreading amaranth\n* Amaranthus crispus – crispleaf amaranth\n* Amaranthus cruentus – purple amaranth, red amaranth, Mexican grain amaranth\n* Amaranthus deflexus – large-fruit amaranth\n* Amaranthus dubius – spleen amaranth, khada sag\n* Amaranthus fimbriatus – fringed amaranth, fringed pigweed\n* Amaranthus floridanus – Florida amaranth\n* Amaranthus furcatus\n* Amaranthus graecizans\n* Amaranthus grandiflorus\n* Amaranthus greggii – Gregg's amaranth\n* Amaranthus hybridus – smooth amaranth, smooth pigweed, red amaranth\n* Amaranthus hypochondriacus – Prince-of-Wales feather, prince's feather\n* Amaranthus interruptus – Australian amaranth\n* Amaranthus minimus\n* Amaranthus mitchellii\n* Amaranthus muricatus – African amaranth\n* Amaranthus obcordatus – Trans-Pecos amaranth\n* Amaranthus palmeri – Palmer's amaranth, Palmer pigweed, careless weed\n* Amaranthus polygonoides – tropical amaranth\n* Amaranthus powellii – green amaranth, Powell amaranth, Powell pigweed\n* Amaranthus pringlei – Pringle's amaranth\n* Amaranthus pumilus – seaside amaranth\n* Amaranthus retroflexus – red-root amaranth, redroot pigweed, common amaranth\n* Amaranthus scleranthoides – variously Amaranthus sclerantoides\n* Amaranthus scleropoides – bone-bract amaranth\n* Amaranthus spinosus – spiny amaranth, prickly amaranth, thorny amaranth\n* Amaranthus standleyanus\n* Amaranthus thunbergii – Thunberg's amaranth\n* Amaranthus torreyi – Torrey's amaranth\n* Amaranthus tricolor – Joseph's-coat\n* Amaranthus tuberculatus – rough-fruit amaranth, tall waterhemp\n* Amaranthus viridis – slender amaranth, green amaranth\n* Amaranthus watsonii – Watson's amaranth\n* Amaranthus wrightii – Wright's amaranth\n\nNutrition\n\nOne cup (2.4 dl, 245 g) of cooked amaranth grain (from about 65 g raw) provides 251 calories and is an excellent source (20% or more of the Daily Value, DV) of protein, dietary fiber, and some dietary minerals. Amaranth is particularly rich in manganese (105% DV), magnesium (40% DV), iron (29% DV), and selenium (20% DV). Cooked amaranth leaves are a rich source of vitamin A, vitamin C, calcium, manganese, and folate. Amaranth does not contain gluten.\n\nAmaranth contains phytochemicals that may be antinutrient factors, such as polyphenols, saponins, tannins, and oxalates which are reduced in content and effect by cooking.\n\nHuman uses \n\nHistory \n\nKnown to the Aztecs as huauhtli, amaranth is thought to have represented up to 80% of their energy consumption before the Spanish conquest. Another important use of amaranth throughout Mesoamerica was to prepare ritual drinks and foods. To this day, amaranth grains are toasted much like popcorn and mixed with honey, molasses, or chocolate to make a treat called alegría, meaning \"joy\" in Spanish. Diego Durán described the festivities for Huitzilopochtli, the name of which means \"hummingbird of the left side\" or \"left-handed hummingbird\" (Real hummingbirds feed on amaranth flowers). The Aztec month of Panquetzaliztli (7 December to 26 December) was dedicated to Huitzilopochtli.  People decorated their homes and trees with paper flags; ritual races, processions, dances, songs, prayers, and finally human sacrifices were held. This was one of the more important Aztec festivals, and the people prepared for the whole month. They fasted or ate very little; a statue of the god was made out of amaranth seeds and honey, and at the end of the month, it was cut into small pieces so everybody could eat a little piece of the god. After the Spanish conquest, cultivation of amaranth was outlawed, while some of the festivities were subsumed into the Christmas celebration.\n\nBecause of its importance as a symbol of indigenous culture, its gluten-free palatability, ease of cooking, and a protein that is particularly well-suited to human nutritional needs, interest in grain amaranth (especially A. cruentus and A. hypochondriacus) revived in the 1970s. It was recovered in Mexico from wild varieties and is now commercially cultivated. It is a popular snack sold in Mexico, sometimes mixed with chocolate or puffed rice, and its use has spread to Europe and parts of North America.  Amaranth and quinoa are not grasses and are called pseudocereals because of their similarities to cereals in flavor and cooking.\n\nSeed \n\nSeveral species are raised for amaranth \"grain\" in Asia and the Americas.\n\nAncient amaranth grains still used include the three species, Amaranthus caudatus, Amaranthus cruentus, and Amaranthus hypochondriacus.Costea et al. (2006). Delimitation of A. cruentus L. and A. caudatus L. using micromorphology and AFLP analysis: an application in germplasm identification. Genetic Resources and Crop Evolution 53: 1625-1633. Although amaranth was cultivated on a large scale in ancient Mexico, Guatemala, and Peru, nowadays it is only cultivated on a small scale there, along with India, China, Nepal, and other tropical countries; thus, the potential exists for further cultivation in those countries, as well as in the U.S. In a 1977 article in Science, amaranth was described as \"the crop of the future\".Marx (1977). Speaking of Science: Amaranth: A Comeback for the Food of the Aztecs? Science 198(4312): 40. It has been proposed as an inexpensive native crop that could be cultivated by indigenous people in rural areas for several reasons:\n* It is easily harvested.\n* Its seeds are a good source of protein.De Macvean & Pöll (1997). Chapter 8: Ethnobotany. Tropical Tree Seed Manual, USDA Forest Service, edt. J.A Vozzo.\n* In cooked and edible forms, amaranth retains adequate content of several dietary minerals.\n* It is easy to cook.\n* As befits its weedy life history, amaranth grains grow rapidly and, in three cultivated species of amaranth, their large seedheads can weigh up to 1 kg and contain a half-million small seeds.Tucker, J. (1986). Amaranth: the once and future crop. Bioscience 36(1): 9-13.\n\nLeaves, roots, and stems \n\nAmaranth species are cultivated and consumed as a leaf vegetable in many parts of the world. Four species of Amaranthus are documented as cultivated vegetables in eastern Asia: Amaranthus cruentus, Amaranthus blitum, Amaranthus dubius, and Amaranthus tricolor.Costea (2003). Notes on Economic Plants. Economic Botany 57(4): 646-649\n\nIn Indonesia and Malaysia, leaf amaranth is called bayam. In the Philippines, the Ilocano word for the plant is kalunay; the Tagalog word for the plant is kilitis or kulitis. In Uttar Pradesh and Bihar in India, it is called chaulai and is a popular green leafy vegetable (referred to in the class of vegetable preparations called saag). It is called chua in Kumaun area of Uttarakhand, where it is a popular red-green vegetable. In Karnataka in India, it is called harive. It is used to prepare curries such as hulee, palya, majjigay-hulee, and so on. In Kerala, it is called cheera and is consumed by stir-frying the leaves with spices and red chillies to make cheera thoran. In Tamil Nadu, it is called mulaikkira and is regularly consumed as a favourite dish, where the greens are steamed, and mashed, with light seasoning of salt, red chili, and cumin. It is  called keerai masial.  In Andhra Pradesh, this leaf is added in preparation of a popular dal called thotakura pappu in (Telugu). In Maharashtra, it is called shravani maath and is available in both red and white colour. In Orissa, it is called khada saga, it is used to prepare saga bhaja, in which the leaf is fried with chili and onions.\n\nIn China, the leaves and stems are used as a stir-fry vegetable, or in soups. In Vietnam, it is called rau dền and is used to make soup. Two species are popular as edible vegetable in Vietnam: dền đỏ- Amaranthus tricolor and dền cơm or dền trắng- Amaranthus viridis.\n\nA traditional food plant in Africa, amaranth has the potential to improve nutrition, boost food security, foster rural development and support sustainable land care.\n\nIn Bantu regions of Uganda and western Kenya, it is known as doodo or litoto. It is also known among the Kalenjin as a drought crop (chepkerta). In Lingala (spoken in the Congo), it is known as lɛngalɛnga or bítɛkutɛku. In Nigeria, it is a common vegetable and goes with all Nigerian starch dishes. It is known in Yoruba as shoko a short form of shokoyokoto (meaning make the husband fat) or arowo jeja (meaning \"we have money left over for fish\"). In the Caribbean, the leaves are called bhaji in Trinidad and callaloo in Jamaica, and are sautéed with onions, garlic, and tomatoes, or sometimes used in a soup called pepperpot soup. In Botswana, it is referred to as morug and cooked as a staple green vegetable.\n\nIn Greece, green amaranth (A. viridis) is a popular dish called βλήτα, vlita or vleeta. It is boiled, then served with olive oil and lemon juice like a salad, sometimes alongside fried fish. Greeks stop harvesting the plant (which also grows wild) when it starts to bloom at the end of August.\n\nIn Brazil, green amaranth was, and to a degree still is, frequently regarded as an invasive species as all other species of amaranth (except the generally imported A. caudatus cultivar), though some have traditionally appreciated it as a leaf vegetable, under the names of  or , which is consumed cooked, generally accompanying the staple food, rice and beans.\n\nOil\n\nMaking up about 5% of the total fatty acids of amaranth, squalene is extracted as a vegetable-based alternative to the more expensive shark oil for use in dietary supplements and cosmetics.\n\nDyes \n\nThe flowers of the 'Hopi Red Dye' amaranth were used by the Hopi (a tribe in the western United States) as the source of a deep red dye.  Also a synthetic dye was named \"amaranth\" for its similarity in color to the natural amaranth pigments known as betalains. This synthetic dye is also known as Red No. 2 in North America and E123 in the European Union.\"The following color additives are not authorized for use in food products in the United States: (1) Amaranth (C.I. 16185, EEC No. E123, formerly certifiable as FD&C red No. 2);\" [http://www.cfsan.fda.gov/~comm/cp03803.html FDA/CFSAN Food Compliance Program: Domestic Food Safety Program] \n\nOrnamentals \n\nThe genus also contains several well-known ornamental plants, such as Amaranthus caudatus (love-lies-bleeding), a vigorous, hardy annual with dark purplish flowers crowded in handsome drooping spikes. Another Indian annual, A. hypochondriacus (prince's feather), has deeply veined, lance-shaped leaves, purple on the under face, and deep crimson flowers densely packed on erect spikes.\n\nAmaranths are recorded as food plants for some Lepidoptera (butterfly and moth) species including the nutmeg moth and various case-bearer moths of the genus Coleophora: C. amaranthella, C. enchorda (feeds exclusively on Amaranthus), C. immortalis (feeds exclusively on Amaranthus), C. lineapulvella, and C. versurella (recorded on A. spinosus).\n\nEcology \n\nAmaranth weed species have an extended period of germination, rapid growth, and high rates of seed production, and have been causing problems for farmers since the mid-1990s. This is partially due to the reduction in tillage, reduction in herbicidal use and the evolution of herbicidal resistance in several species where herbicides have been applied more often.Wetzel et al. (1999). Use of PCR-based molecular markers to identify weedy Amaranthus species. Weed Science 47: 518-523. The following 9 species of Amaranthus are considered invasive and noxious weeds in the U.S and Canada: A. albus, A. blitoides, A. hybridus, A. palmeri, A. powellii, A. retroflexus, A. spinosus, A. tuberculatus, and A. viridis.[http://plants.usda.gov/java/profile?symbol\nAMARA USDA Plant Database. Plants Profile- Amaranthus L]\n\nA new herbicide-resistant strain of Amaranthus palmeri has appeared; it is glyphosate-resistant and so cannot be killed by herbicides using the chemical. Also, this plant can survive in tough conditions. This could be of particular concern to cotton farmers using glyphosate-resistant cotton. The species Amaranthus palmeri (Palmer amaranth) causes the greatest reduction in soybean yields and has the potential to reduce yields by 17-68% in field experiments. Palmer amaranth is among the \"top five most troublesome weeds\" in the southeast of the United States and has already evolved resistances to dinitroaniline herbicides and acetolactate synthase inhibitors.Culpepper et al. (2006). Glyphosate-resistant Palmer amaranth (Amaranthus palmeri) confirmed in Georgia. Weed Science 54: 620-626. This makes the proper identification of Amaranthus species at the seedling stage essential for agriculturalists. Proper weed control needs to be applied before the species successfully colonizes in the crop field and causes significant yield reductions.\n\nImages\n\nFile:Amaranthus caudatus1.jpg|Love-lies-bleeding (Amaranthus caudatus)\nFile:Amaranthus.hybridus1web.jpg|Green Amaranth (A. hybridus)\nFile:Amaranth2.jpg|Seabeach amaranth (A. pumilus), an amaranth on the Federal Threatened species List\nFile:Illustration Amaranthus retroflexus0.jpg|Red-root Amaranth (A. retroflexus)—from Thomé, Flora von Deutschland, Österreich und der Schweiz 1885\nFile:Amaranthus.spinosus1web.jpg|Spiny Amaranth (Amaranthus spinosus)\nFile:Amaranthus.viridis1web.jpg|Green Amaranth (Amaranthus viridis)\nFile:Amaranth sp 2.jpg| Popping Amaranth (Amaranthus sp.)\nFile:Amaranth und WW.jpg|Amaranth grain (left) and wheat (right)\nFile:Travancore Cheera Thoran.JPG|Southern Kerala-style traditional Thoran made with Cheera (Amaranth) leaves\nFile:Fepm (8).jpg|Example from Chilpancingo. Amaranth. http://en.wikipedia.org/?curid=1542."
  }
}
