{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19659",
  "eid" : "3cdf65d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778611373,
  "textBody" : "Events\n\n* 218 – Julia Maesa, aunt of the assassinated Caracalla, is banished to her home in Syria by self-proclaimed emperor Macrinus. She declares her 14-year-old grandson Elagabalus to be emperor of Rome. Macrinus is later deposed. \n* 946 – Emperor Suzaku abdicates the throne in favor of his brother Murakami who becomes the 62nd emperor of Japan.\n*1204 – Baldwin IX, Count of Flanders is crowned as the first Emperor of the Latin Empire.\n*1527 – The Florentines drive out the Medici for a second time and Florence re-establishes itself as a republic.\n*1532 – Sir Thomas More resigns as Lord Chancellor of England.\n*1568 – Mary, Queen of Scots, flees to England.\n*1584 – Santiago de Vera becomes sixth Governor-General of the Spanish colony of the Philippines.\n*1770 – A 14-year-old Marie Antoinette marries 15-year-old Louis-Auguste who later becomes king of France.\n*1771 – The Battle of Alamance, a pre-American Revolutionary War battle between local militia and a group of rebels called The \"Regulators\", occurs in present-day Alamance County, North Carolina.\n*1811 – Peninsular War: The allies Spain, Portugal and United Kingdom, defeat the French at the Battle of Albuera.\n*1812 – Russian Field Marshal Mikhail Kutuzov signs the Treaty of Bucharest, ending the Russo-Turkish War. Bessarabia is annexed by Imperial Russia.\n*1822 – Greek War of Independence: The Turks capture the Greek town of Souli.\n*1834 – The Battle of Asseiceira is fought, the last and decisive engagement of the Liberal Wars in Portugal. \n*1843 – The first major wagon train heading for the Pacific Northwest sets out on the Oregon Trail with one thousand pioneers from Elm Grove, Missouri.\n*1866 – The United States Congress establishes the nickel.\n*1868 – United States President Andrew Johnson is acquitted in his impeachment trial by one vote in the United States Senate.\n*1874 – A flood on the Mill River in Massachusetts destroys much of four villages and kills 139 people.\n*1888 – Nikola Tesla delivers a lecture describing the equipment which will allow efficient generation and use of alternating currents to transmit electric power over long distances.\n*1891 – The International Electrotechnical Exhibition opens in Frankfurt, Germany, and will feature the world's first long distance transmission of high-power, three-phase electric current (the most common form today).\n* 1916 – The United Kingdom of Great Britain and Ireland and the French Third Republic sign the secret wartime Sykes-Picot Agreement partitioning former Ottoman territories such as Iraq and Syria.\n*1918 – The Sedition Act of 1918 is passed by the U.S. Congress, making criticism of the government during wartime an imprisonable offense. It will be repealed less than two years later.\n*1919 – A naval Curtiss NC-4 aircraft commanded by Albert Cushing Read leaves Trepassey, Newfoundland, for Lisbon via the Azores on the first transatlantic flight.\n*1920 – In Rome, Pope Benedict XV canonizes Joan of Arc.\n*1929 – In Hollywood, the first Academy Awards ceremony takes place. \n*1943 – The Holocaust: The Warsaw Ghetto Uprising ends.\n*1951 – The first regularly scheduled transatlantic flights begin between Idlewild Airport (now John F Kennedy International Airport) in New York City and Heathrow Airport in London, operated by El Al Israel Airlines.\n*1959 – The Triton Fountain is inaugurated in Valletta, Malta.\n*1960 – Theodore Maiman operates the first optical laser (a ruby laser), at Hughes Research Laboratories in Malibu, California.\n*1961 – Park Chung-hee leads a coup d'état to overthrow the Second Republic of South Korea.\n*1966 – The Communist Party of China issues the \"May 16 Notice\", marking the beginning of the Cultural Revolution.\n*1969 – Venera program: Venera 5, a Soviet space probe, lands on Venus.\n*1974 – Josip Broz Tito is elected president for life of Yugoslavia. \n*1983 – Sudan People's Liberation Army/Movement rebels against the Sudanese government.\n*1988 – A report by the Surgeon General of the United States C. Everett Koop states that the addictive properties of nicotine are similar to those of heroin and cocaine.\n*1991 – Queen Elizabeth II of the United Kingdom addresses a joint session of the United States Congress. She is the first British monarch to address the U.S. Congress.\n*1997 – Mobutu Sese Seko, the President of Zaire, flees the country.\n*2003 – In Morocco, 33 civilians are killed and more than 100 people are injured in the Casablanca terrorist attacks.\n*2005 – Kuwait permits women's suffrage in a 35–23 National Assembly vote.\n*2011 – STS-134 (ISS assembly flight ULF6), launched from the Kennedy Space Center on the 25th and final flight for .\n*2014 – Twelve people are killed in two explosions in the Gikomba market area of Nairobi, Kenya.\n\nBirths\n\n*1418 – John II of Cyprus, King of Cyprus and Armenia and also titular King of Jerusalem from 1432 to 1458 (d. 1458)\n*1455 – Wolfgang I of Oettingen, German count (d. 1522)\n*1542 – Anna Sibylle of Hanau-Lichtenberg, German noblewoman (d. 1580)\n*1606 – John Bulwer, British doctor (d. 1656)\n*1611 – Pope Innocent XI (d. 1689)\n*1641 – Dudley North, English economist and politician (d. 1691)\n*1710 – William Talbot, 1st Earl Talbot, English politician, Lord Steward of the Household (d. 1782)\n*1718 – Maria Gaetana Agnesi, Italian mathematician and philosopher (d. 1799)\n*1763 – Louis Nicolas Vauquelin, French pharmacist and chemist (d. 1829)\n*1788 – Friedrich Rückert, German poet and translator (d. 1866)\n*1801 – William H. Seward, American lawyer and politician, 24th United States Secretary of State (d. 1872)\n*1804 – Elizabeth Palmer Peabody, American educator who founded the first U.S. kindergarten (d. 1894)\n*1819 – Johann Voldemar Jannsen, Estonian journalist and poet (d. 1890)\n*1821 – Pafnuty Chebyshev, Russian mathematician and statistician (d. 1894)\n*1824 – Levi P. Morton, American banker and politician, 22nd United States Vice President (d. 1920)\n* 1824 – Edmund Kirby Smith, American general (d. 1893)\n*1827 – Pierre Cuypers, Dutch architect, designed the Amsterdam Centraal railway station and Rijksmuseum (d. 1921)\n*1831 – David Edward Hughes, Welsh-American physicist, co-invented the microphone (d. 1900)\n*1845 – Élie Metchnikoff, Ukrainian-French biologist and zoologist, Nobel Prize laureate (d. 1916)\n*1879 – Pierre Gilliard, Swiss author and academic (d. 1962)\n*1882 – Simeon Price, American golfer (d. 1945)\n*1883 – Celâl Bayar, Turkish politician, 3rd President of Turkey (d. 1986)\n*1888 – Royal Rife, American microbiologist and instrument maker (d. 1971)\n*1897 – Zvi Sliternik, Israeli entomologist and academic (d. 1994)\n*1898 – Tamara de Lempicka, Polish-American painter (d. 1980)\n*  1898   – Desanka Maksimović, Serbian poet and academic (d. 1993)\n*  1898   – Kenji Mizoguchi, Japanese director and screenwriter (d. 1956)\n*1903 – Charles F. Brannock, American inventor and manufacturer (d. 1992)\n*1905 – Henry Fonda, American actor (d. 1982)\n*1906 – Ernie McCormick, Australian cricketer (d. 1991)\n*  1906   – Alfred Pellan, Canadian painter and educator (d. 1988)\n*  1906   – Arturo Uslar Pietri, Venezuelan lawyer, journalist, and author (d. 2001)\n*  1906   – Margret Rey, German author and illustrator (d. 1996)\n*1907 – Bob Tisdall, Irish hurdler (d. 2004)\n*1909 – Margaret Sullavan, American actress and singer (d. 1960)\n*  1909   – Luigi Villoresi, Italian race car driver (d. 1997)\n*1910 – Olga Bergholz, Russian poet and author (d. 1975)\n*  1910   – Higashifushimi Kunihide, Japanese monk and educator (d. 2014)\n*  1910   – Aleksandr Ivanovich Laktionov, Russian painter and educator (d. 1972)\n*1912 – Studs Terkel, American historian and author (d. 2008)\n*1913 – Woody Herman, American singer, saxophonist, and clarinet player (d. 1987)\n*1914 – Edward T. Hall, American anthropologist and author (d. 2009)\n*1915 – Mario Monicelli, Italian director and screenwriter (d. 2010)\n*1916 – Ephraim Katzir, Israeli biophysicist and politician, 4th President of Israel (d. 2009)\n*  1917   – Ben Kuroki, American sergeant and pilot (d. 2015)\n*  1917   – James C. Murray, American lawyer and politician (d. 1999)\n*  1917   – Juan Rulfo, Mexican author and photographer (d. 1986)\n*1918 – Wilf Mannion, English footballer and manager (d. 2000)\n*1919 – Liberace, American pianist and entertainer (d. 1987)\n*  1919   – Ramon Margalef, Spanish ecologist and biologist (d. 2004)\n*1920 – Martine Carol, French actress (d. 1967)\n*1921 – Harry Carey, Jr., American actor, producer, and screenwriter (d. 2012)\n*1923 – Victoria Fromkin, American linguist and academic (d. 2000)\n*  1923   – Merton Miller, American economist and academic, Nobel Prize laureate (d. 2000)\n*  1923   – Peter Underwood, English parapsychologist and author (d. 2014)\n*1924 – Dawda Jawara, 1st President of the Gambia\n*1925 – Nancy Roman, American astronomer\n*  1925   – Ola Vincent, Nigerian banker and economist  (d. 2012)\n*  1925   – Nílton Santos, Brazilian footballer (d. 2013)\n*1928 – Billy Martin, American baseball player and coach (d. 1989)\n*1929 – Betty Carter, American singer-songwriter (d. 1998)\n*  1929   – John Conyers, American lawyer and politician\n*  1929   – Claude Morin, Canadian academic and politician\n*  1929   – Adrienne Rich, American poet, essayist, and feminist (d. 2012)\n*1930 – Friedrich Gulda, Austrian pianist and composer (d. 2000)\n*1931 – Vujadin Boškov, Serbian footballer, coach, and manager (d. 2014)\n*  1931   – K. Natwar Singh, Indian scholar and politician, Indian Minister of External Affairs\n*  1931   – Lowell P. Weicker, Jr., American soldier and politician, 85th Governor of Connecticut\n*1934 – Kenneth O. Morgan, Welsh historian and author\n*  1934   – Antony Walker, English general\n*1935 – Floyd Smith, Canadian ice hockey player and coach\n*1936 – Karl Lehmann, German cardinal\n*1937 – Yvonne Craig, American ballet dancer and actress (d. 2015)\n*1938 – Stuart Bell, English lawyer and politician (d. 2012)\n*  1938   – Ivan Sutherland, American computer scientist and academic\n*1941 – Denis Hart, Australian archbishop\n*1942 – David Penry-Davey, English lawyer and judge\n*1943 – Kay Andrews, Baroness Andrews, English politician\n*  1943   – Dan Coats, American politician and diplomat, 29th United States Ambassador to Germany\n*1944 – Billy Cobham, Panamanian-American drummer, composer, and bandleader \n*  1944   – Antal Nagy, Hungarian footballer\n*  1944   – Danny Trejo, American actor \n*1946 – John Law, English sociologist and academic\n*  1946 – Robert Fripp, English guitarist, songwriter and producer\n*  1947   – Darrell Sweet, Scottish drummer (d. 1999)\n*  1947   – Roch Thériault, Canadian religious leader (d. 2011)\n*1948 – Jesper Christensen, Danish actor, director, and producer\n*  1948   – Judy Finnigan, English talk show host and author\n*  1948   – Enrico Fumia, Italian automobile and product designer\n*  1948   – Emma Georgina Rothschild, English historian and academic\n*  1948   – Staf Van Roosbroeck, Belgian cyclist\n*1949 – Rick Reuschel, American baseball player\n*1950 – Georg Bednorz, German physicist and academic, Nobel Prize laureate\n*  1950   – Ray Condo, Canadian singer-songwriter and guitarist (d. 2004)\n*  1950   – Bruce Coville, American author\n*1951 – Christian Lacroix, French fashion designer\n*  1951   – Jonathan Richman, American singer-songwriter and guitarist \n*  1951   – Janet Soskice, Canadian philosopher and theologian\n*1952 – James Herndon, American psychologist and academic\n*1953 – Pierce Brosnan, Irish-American actor and producer\n*  1953   – Peter Onorati, American actor\n*  1953   – Richard Page, American singer-songwriter and bass player \n*  1953   – Kitanoumi Toshimitsu, Japanese sumo wrestler, the 55th Yokozuna (d. 2015)\n*  1953   – David Maclean, Scottish politician\n*  1953   – Stephen Woolman, Lord Woolman, Scottish judge and academic\n*1954 – Dafydd Williams, Canadian physician and astronaut\n*1955 – Olga Korbut, Soviet gymnast\n*  1955   – Jack Morris, American baseball player and sportscaster\n*  1955   – Hazel O'Connor, English-born Irish singer-songwriter and actress\n*  1955   – Páidí Ó Sé, Irish footballer and manager (d. 2012)\n*  1955   – Debra Winger, American actress \n*1957 – Joan Benoit, American runner\n*  1957   – Benjamin Mancroft, 3rd Baron Mancroft, English politician\n*  1957   – Yuri Shevchuk, Russian singer-songwriter and guitarist \n*  1957   – Anthony St John, 22nd Baron St John of Bletso, English lawyer and businessman\n*  1957   – Bob Suter, American ice hockey player and coach (d. 2014)\n*1959 – Mitch Webster, American baseball player\n*  1959   – Mare Winningham, American actress and singer-songwriter\n*1960 – Landon Deireragea, Nauruan politician, Nauruan Speaker of Parliament\n*  1960   – S. Shanmuganathan, Sri Lankan commander and politician (d. 1998)\n*1961 – Kevin McDonald, Canadian actor and screenwriter\n*  1961   – Charles Wright, American wrestler\n*1962 – Jimmy Hood, Scottish engineer and politician\n*  1962   – Helga Radtke, German long jumper\n*1963 – Rachel Griffith, Anglo-American economist\n*  1963   – David Wilkinson, English theologian and academic\n*1964 – John Salley, American basketball player and actor\n*  1964   – Boyd Tinsley, American singer-songwriter and violinist \n*1964 – Milton Jones, English comedian, actor, and screenwriter\n*1965 – Krist Novoselic, American bass player, songwriter, author, and activist\n*  1965   – Tanel Tammet, Estonian computer scientist, engineer, and academic\n*1966 – Janet Jackson, American singer-songwriter, producer, dancer, and actress\n*  1966   – Scott Reeves, American singer-songwriter and actor \n*  1966   – Thurman Thomas, American football player\n*1967 – Doug Brocail, American baseball player and coach\n*  1967   – Susan Williams, Baroness Williams of Trafford, British politician\n*1968 – Ralph Tresvant, American singer and producer \n*1969 – David Boreanaz, American actor\n*  1969   – Tucker Carlson, American journalist, co-founded The Daily Caller\n*  1969   – Steve Lewis, American sprinter\n*1970 – Gabriela Sabatini, Argentinian tennis player\n*  1970   – Danielle Spencer, Australian singer-songwriter and actress\n*1971 – Phil Clarke, English rugby league player and sportscaster\n*  1971   – Rachel Goswell, English singer-songwriter and guitarist \n*1972 – Christian Califano, French rugby player\n*  1972   – Matthew Hart, New Zealand cricketer\n*1973 – Tori Spelling, American actress, reality television personality, and author\n*1974 – Laura Pausini, Italian singer-songwriter and producer\n*  1974   – Sonny Sandoval, American singer-songwriter and rapper\n*1975 – Tony Kakko, Finnish musician, composer, and vocalist\n*1976 – Dirk Nannes, Australian-Dutch cricketer\n*1977 – Melanie Lynskey, New Zealand actress\n*  1977   – Emilíana Torrini, Icelandic singer-songwriter\n*1978 – Scott Nicholls, English motorcycle racer\n*  1978   – Lionel Scaloni, Argentinian footballer\n*1980 – Nuria Llagostera Vives, Spanish tennis player\n*1981 – Ricardo Costa, Portuguese footballer\n*1983 – Daniel Kerr, Australian footballer\n*  1983   – Kyle Wellwood, Canadian ice hockey player\n*1984 – Darío Cvitanich, Argentinian footballer\n*  1984   – Tomáš Fleischmann, Czech ice hockey player\n*  1984   – Jensen Lewis, American baseball player\n*  1984   – Rick Rypien, Canadian ice hockey player (d. 2011)\n*1985 – Anja Mittag, German footballer\n*  1985   – Rodrigo Peters Marques, Brazilian footballer\n*  1985   – Corey Perry, Canadian ice hockey player\n*1986 – Megan Fox, American actress\n*  1986   – Andy Keogh, Irish footballer\n*  1986   – Shamcey Supsup, Filipino model and architect\n*1987 – Tom Onslow-Cole, English race car driver\n*1988 – Jesús Castillo, Mexican footballer\n*  1988   – Martynas Gecevičius, Lithuanian basketball player\n*  1988   – Jaak Põldma, Estonian tennis player\n*1989 – Behati Prinsloo, Namibian model\n*1990 – Amanda Carreras, Gibraltarian tennis player\n*  1990   – Thomas Brodie-Sangster, English actor\n*  1990   – Darko Šarović, Serbian sprinter\n*  1990   – Omar Strong, American basketball player\n*1991 – Grigor Dimitrov, Bulgarian tennis player\n*1991 –Joey Graceffa, American internet celebrity \n*  1991   – Ashley Wagner, American figure skater\n*1992 – Jeff Skinner, Canadian ice hockey player\n*1993 – Johannes Thingnes Bø, Norwegian biathlete\n*  1993   – Karol Mets, Estonian footballer\n*1995 – Elizabeth Ralston, Australian footballer\n*1996 – Louisa Chirico, American tennis player\n\nDeaths\n\n* 290 – Emperor Wu of Jin, Chinese emperor (b. 236)\n* 895 – Qian Kuan, Chinese nobleman\n* 934 – Meng Hanqiong, eunuch official of Later Tang\n*1182 – John Komnenos Vatatzes, Byzantine general (b. 1132)\n*1265 – Simon Stock, English-French saint (b. 1165)\n*1375 – Liu Bowen, Chinese military strategist, officer, statesman and poet (b. 1311)\n*1412 – Gian Maria Visconti, Duke of Milan*1561 – Jan Tarnowski, Polish noble and statesman (b. 1488)\n*1620 – William Adams, English sailor and navigator (b. 1564)\n*1657 – Andrew Bobola, Polish missionary and martyr (b. 1591)\n*1667 – Thomas Wriothesley, 4th Earl of Southampton, English politician, Lord High Treasurer (b. 1607)\n*1669 – Pietro da Cortona, Italian painter and architect, designed the Santi Luca e Martina (b. 1596)\n*1691 – Jacob Leisler, German-American politician, 8th Colonial Governor of New York (b. 1640)\n*1696 – Mariana of Austria, Queen consort of Spain (b. 1634)\n*1703 – Charles Perrault, French author and academic (b. 1628)\n*1778 – Robert Darcy, 4th Earl of Holderness, English politician, Secretary of State for the Southern Department (b. 1718)\n*1790 – Philip Yorke, 2nd Earl of Hardwicke, English politician, Lord Lieutenant of Cambridgeshire (b. 1720)\n*1818 – Matthew Lewis, English author and playwright (b. 1775)\n*1830 – Joseph Fourier, French mathematician and physicist (b. 1768)\n*1862 – Edward Gibbon Wakefield, English politician (b. 1796)\n*1882 – Reuben Chapman, American lawyer and politician, 13th Governor of Alabama (b. 1799)\n*1890 – Mihkel Veske, Estonian poet, linguist and theologist (b. 1843)\n*1891 – Ion C. Brătianu, Romanian politician, 14th Prime Minister of Romania (b. 1821)\n*1910 – Henri-Edmond Cross, French Neo-Impressionist painter (b. 1856)\n*1913 – Louis Perrier, Swiss architect and politician (b. 1849)\n*1920 – Levi P. Morton, American politician, 22nd United States Vice President (b. 1824)\n*1926 – Mehmed VI, Ottoman sultan (b. 1861)\n*1936 – Leonidas Paraskevopoulos, Greek general and politician (b. 1860)\n*1938 – Joseph Strauss, American engineer, co designed The Golden Gate Bridge (b. 1870)\n*1943 – Alfred Hoche, German psychiatrist and academic (b. 1865)\n*1944 – George Ade, American journalist, author, and playwright (b. 1866)\n*1946 – Bruno Tesch, German chemist and businessman (b. 1890)\n*1947 – Frederick Gowland Hopkins, English biochemist and academic, Nobel Prize laureate (b. 1861)\n*  1947   – Zhang Lingfu, Chinese general (b. 1903)\n*1953 – Django Reinhardt, Belgian guitarist and composer  (b. 1910)\n*1954 – Clemens Krauss, Austrian conductor and manager (b. 1893)\n*1955 – James Agee, American novelist, screenwriter, and critic(b. 1909)\n*  1955   – Manny Ayulo, American racing driver (b. 1921)\n*1956 – H. B. Reese, American candy-maker and businessman, created Reese's Peanut Butter Cups  (b. 1876)\n*1957 – Eliot Ness, American federal agent (b. 1903)\n*1961 – George A. Malcolm, American lawyer and jurist (b. 1881)\n*1973 – Jacques Lipchitz, Lithuanian-American sculptor (b. 1891)\n*1977 – Modibo Keïta, Malian politician, 1st President of Mali (b. 1915)\n*1979 – A. Philip Randolph, American union leader and activist (b. 1889)\n*1981 – Ernie Freeman, American pianist, composer, and bandleader (b. 1922)\n*  1981   – Willy Hartner, German physician and academic (b. 1905)\n*1984 – Andy Kaufman, American actor, comedian, and screenwriter (b. 1949)\n*  1984   – Irwin Shaw, American playwright, screenwriter, novelist, and short story writer (b. 1913)\n*1985 – Margaret Hamilton, American actress (b. 1902)\n*1989 – Leila Kasra, Iranian poet and songwriter (b. 1939)\n*1990 – Sammy Davis Jr., American singer, dancer, and actor (b. 1925)\n*  1990   – Jim Henson, American puppeteer, director, producer, and screenwriter, created The Muppets (b. 1936)\n*1993 – Marv Johnson, American singer-songwriter and pianist (b. 1938)\n*1994 – Alain Cuny, French actor (b. 1908)\n*1996 – Jeremy Michael Boorda, American admiral (b. 1939)\n*1997 – Elbridge Durbrow, American diplomat (b. 1903)\n*2002 – Alec Campbell, Australian soldier (b. 1899)\n*2003 – Mark McCormack, American lawyer and sports agent, founded IMG (b. 1930)\n*2005 – Andrew Goodpaster, American general (b. 1915)\n*2008 – Robert Mondavi, American winemaker, co-founded the Opus One Winery (b. 1913)\n*2010 – Ronnie James Dio, American singer-songwriter and producer (b. 1942)\n*  2010   – Hank Jones, American pianist, composer, and bandleader (b. 1918)\n*2011 – Ralph Barker, English author (b. 1917) \n*  2011   – Bob Davis, Australian footballer and coach (b. 1928)\n*  2011   – Edward Hardwicke, English actor (b. 1932)\n*  2011   – Kiyoshi Kodama, Japanese actor (b. 1934)\n*2012 – Patricia Aakhus, American author and academic (b. 1952)\n*  2012   – James Abdnor, American soldier and politician, 30th Lieutenant Governor of South Dakota (b. 1923)\n*  2012   – Chuck Brown, American singer-songwriter, guitarist, and producer (b. 1936)\n*  2012   – Ernie Chan, Filipino-American illustrator (b. 1940)\n*  2012   – Kevin Hickey, American baseball player (b. 1956)\n*2013 – Angelo Errichetti, American politician (b. 1928)\n*  2013   – Bryan Illerbrun, Canadian football player (b. 1957)\n*  2013   – Frankie Librán, Puerto Rican-American baseball player (b. 1948)\n*  2013   – Heinrich Rohrer, Swiss physicist and academic, Nobel Prize laureate (b. 1933)\n*  2013   – Dick Trickle, American race car driver (b. 1941)\n*  2013   – Bernard Waber, American author and illustrator (b. 1921)\n*2014 – Chris Duckworth, Zimbabwean-South African cricketer (b. 1933)\n*  2014   – Vito Favero, Italian cyclist (b. 1932)\n*  2014   – Bud Hollowell, American baseball player and manager (b. 1943)\n*  2014   – Clyde Snow, American anthropologist and author (b. 1928)\n*2015 – Prashant Bhargava, American director and producer (b. 1973)\n*  2015   – Moshe Levinger, Israeli rabbi and author (b. 1935)\n*  2015   – Flora MacNeil, Scottish Gaelic singer (b. 1928)\n\nHolidays and observances\n\n* Christian feast day:\n** Aaron (Coptic Church)\n** Abda and Abdjesus, and companions:\n*** Abdas of Susa\n** Andrew Bobola\n** Brendan the Navigator (Roman Catholic Church, Anglican Communion, Eastern Orthodox Church)\n** Caroline Chisholm (Church of England)\n** Germerius\n** Honoratus of Amiens\n** John of Nepomuk\n** Margaret of Cortona\n** Peregrine of Auxerre\n** Simon Stock\n** Ubald (see Saint Ubaldo Day)\n* Martyrs of Sudan (Episcopal Church (USA))\n* Mass Graves Day (Iraq)\n* National Day, declared by Salva Kiir Mayardit (South Sudan)\n* Teachers' Day (Malaysia)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "May 16" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19659" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 218 – Julia Maesa, aunt of the assassinated Caracalla, is banished to her home in Syria by self-proclaimed emperor Macrinus. She declares her 14-year-old grandson Elagabalus to be emperor of Rome. Macrinus is later deposed. \n* 946 – Emperor Suzaku abdicates the throne in favor of his brother Murakami who becomes the 62nd emperor of Japan.\n*1204 – Baldwin IX, Count of Flanders is crowned as the first Emperor of the Latin Empire.\n*1527 – The Florentines drive out the Medici for a second time and Florence re-establishes itself as a republic.\n*1532 – Sir Thomas More resigns as Lord Chancellor of England.\n*1568 – Mary, Queen of Scots, flees to England.\n*1584 – Santiago de Vera becomes sixth Governor-General of the Spanish colony of the Philippines.\n*1770 – A 14-year-old Marie Antoinette marries 15-year-old Louis-Auguste who later becomes king of France.\n*1771 – The Battle of Alamance, a pre-American Revolutionary War battle between local militia and a group of rebels called The \"Regulators\", occurs in present-day Alamance County, North Carolina.\n*1811 – Peninsular War: The allies Spain, Portugal and United Kingdom, defeat the French at the Battle of Albuera.\n*1812 – Russian Field Marshal Mikhail Kutuzov signs the Treaty of Bucharest, ending the Russo-Turkish War. Bessarabia is annexed by Imperial Russia.\n*1822 – Greek War of Independence: The Turks capture the Greek town of Souli.\n*1834 – The Battle of Asseiceira is fought, the last and decisive engagement of the Liberal Wars in Portugal. \n*1843 – The first major wagon train heading for the Pacific Northwest sets out on the Oregon Trail with one thousand pioneers from Elm Grove, Missouri.\n*1866 – The United States Congress establishes the nickel.\n*1868 – United States President Andrew Johnson is acquitted in his impeachment trial by one vote in the United States Senate.\n*1874 – A flood on the Mill River in Massachusetts destroys much of four villages and kills 139 people.\n*1888 – Nikola Tesla delivers a lecture describing the equipment which will allow efficient generation and use of alternating currents to transmit electric power over long distances.\n*1891 – The International Electrotechnical Exhibition opens in Frankfurt, Germany, and will feature the world's first long distance transmission of high-power, three-phase electric current (the most common form today).\n* 1916 – The United Kingdom of Great Britain and Ireland and the French Third Republic sign the secret wartime Sykes-Picot Agreement partitioning former Ottoman territories such as Iraq and Syria.\n*1918 – The Sedition Act of 1918 is passed by the U.S. Congress, making criticism of the government during wartime an imprisonable offense. It will be repealed less than two years later.\n*1919 – A naval Curtiss NC-4 aircraft commanded by Albert Cushing Read leaves Trepassey, Newfoundland, for Lisbon via the Azores on the first transatlantic flight.\n*1920 – In Rome, Pope Benedict XV canonizes Joan of Arc.\n*1929 – In Hollywood, the first Academy Awards ceremony takes place. \n*1943 – The Holocaust: The Warsaw Ghetto Uprising ends.\n*1951 – The first regularly scheduled transatlantic flights begin between Idlewild Airport (now John F Kennedy International Airport) in New York City and Heathrow Airport in London, operated by El Al Israel Airlines.\n*1959 – The Triton Fountain is inaugurated in Valletta, Malta.\n*1960 – Theodore Maiman operates the first optical laser (a ruby laser), at Hughes Research Laboratories in Malibu, California.\n*1961 – Park Chung-hee leads a coup d'état to overthrow the Second Republic of South Korea.\n*1966 – The Communist Party of China issues the \"May 16 Notice\", marking the beginning of the Cultural Revolution.\n*1969 – Venera program: Venera 5, a Soviet space probe, lands on Venus.\n*1974 – Josip Broz Tito is elected president for life of Yugoslavia. \n*1983 – Sudan People's Liberation Army/Movement rebels against the Sudanese government.\n*1988 – A report by the Surgeon General of the United States C. Everett Koop states that the addictive properties of nicotine are similar to those of heroin and cocaine.\n*1991 – Queen Elizabeth II of the United Kingdom addresses a joint session of the United States Congress. She is the first British monarch to address the U.S. Congress.\n*1997 – Mobutu Sese Seko, the President of Zaire, flees the country.\n*2003 – In Morocco, 33 civilians are killed and more than 100 people are injured in the Casablanca terrorist attacks.\n*2005 – Kuwait permits women's suffrage in a 35–23 National Assembly vote.\n*2011 – STS-134 (ISS assembly flight ULF6), launched from the Kennedy Space Center on the 25th and final flight for .\n*2014 – Twelve people are killed in two explosions in the Gikomba market area of Nairobi, Kenya.\n\nBirths\n\n*1418 – John II of Cyprus, King of Cyprus and Armenia and also titular King of Jerusalem from 1432 to 1458 (d. 1458)\n*1455 – Wolfgang I of Oettingen, German count (d. 1522)\n*1542 – Anna Sibylle of Hanau-Lichtenberg, German noblewoman (d. 1580)\n*1606 – John Bulwer, British doctor (d. 1656)\n*1611 – Pope Innocent XI (d. 1689)\n*1641 – Dudley North, English economist and politician (d. 1691)\n*1710 – William Talbot, 1st Earl Talbot, English politician, Lord Steward of the Household (d. 1782)\n*1718 – Maria Gaetana Agnesi, Italian mathematician and philosopher (d. 1799)\n*1763 – Louis Nicolas Vauquelin, French pharmacist and chemist (d. 1829)\n*1788 – Friedrich Rückert, German poet and translator (d. 1866)\n*1801 – William H. Seward, American lawyer and politician, 24th United States Secretary of State (d. 1872)\n*1804 – Elizabeth Palmer Peabody, American educator who founded the first U.S. kindergarten (d. 1894)\n*1819 – Johann Voldemar Jannsen, Estonian journalist and poet (d. 1890)\n*1821 – Pafnuty Chebyshev, Russian mathematician and statistician (d. 1894)\n*1824 – Levi P. Morton, American banker and politician, 22nd United States Vice President (d. 1920)\n* 1824 – Edmund Kirby Smith, American general (d. 1893)\n*1827 – Pierre Cuypers, Dutch architect, designed the Amsterdam Centraal railway station and Rijksmuseum (d. 1921)\n*1831 – David Edward Hughes, Welsh-American physicist, co-invented the microphone (d. 1900)\n*1845 – Élie Metchnikoff, Ukrainian-French biologist and zoologist, Nobel Prize laureate (d. 1916)\n*1879 – Pierre Gilliard, Swiss author and academic (d. 1962)\n*1882 – Simeon Price, American golfer (d. 1945)\n*1883 – Celâl Bayar, Turkish politician, 3rd President of Turkey (d. 1986)\n*1888 – Royal Rife, American microbiologist and instrument maker (d. 1971)\n*1897 – Zvi Sliternik, Israeli entomologist and academic (d. 1994)\n*1898 – Tamara de Lempicka, Polish-American painter (d. 1980)\n*  1898   – Desanka Maksimović, Serbian poet and academic (d. 1993)\n*  1898   – Kenji Mizoguchi, Japanese director and screenwriter (d. 1956)\n*1903 – Charles F. Brannock, American inventor and manufacturer (d. 1992)\n*1905 – Henry Fonda, American actor (d. 1982)\n*1906 – Ernie McCormick, Australian cricketer (d. 1991)\n*  1906   – Alfred Pellan, Canadian painter and educator (d. 1988)\n*  1906   – Arturo Uslar Pietri, Venezuelan lawyer, journalist, and author (d. 2001)\n*  1906   – Margret Rey, German author and illustrator (d. 1996)\n*1907 – Bob Tisdall, Irish hurdler (d. 2004)\n*1909 – Margaret Sullavan, American actress and singer (d. 1960)\n*  1909   – Luigi Villoresi, Italian race car driver (d. 1997)\n*1910 – Olga Bergholz, Russian poet and author (d. 1975)\n*  1910   – Higashifushimi Kunihide, Japanese monk and educator (d. 2014)\n*  1910   – Aleksandr Ivanovich Laktionov, Russian painter and educator (d. 1972)\n*1912 – Studs Terkel, American historian and author (d. 2008)\n*1913 – Woody Herman, American singer, saxophonist, and clarinet player (d. 1987)\n*1914 – Edward T. Hall, American anthropologist and author (d. 2009)\n*1915 – Mario Monicelli, Italian director and screenwriter (d. 2010)\n*1916 – Ephraim Katzir, Israeli biophysicist and politician, 4th President of Israel (d. 2009)\n*  1917   – Ben Kuroki, American sergeant and pilot (d. 2015)\n*  1917   – James C. Murray, American lawyer and politician (d. 1999)\n*  1917   – Juan Rulfo, Mexican author and photographer (d. 1986)\n*1918 – Wilf Mannion, English footballer and manager (d. 2000)\n*1919 – Liberace, American pianist and entertainer (d. 1987)\n*  1919   – Ramon Margalef, Spanish ecologist and biologist (d. 2004)\n*1920 – Martine Carol, French actress (d. 1967)\n*1921 – Harry Carey, Jr., American actor, producer, and screenwriter (d. 2012)\n*1923 – Victoria Fromkin, American linguist and academic (d. 2000)\n*  1923   – Merton Miller, American economist and academic, Nobel Prize laureate (d. 2000)\n*  1923   – Peter Underwood, English parapsychologist and author (d. 2014)\n*1924 – Dawda Jawara, 1st President of the Gambia\n*1925 – Nancy Roman, American astronomer\n*  1925   – Ola Vincent, Nigerian banker and economist  (d. 2012)\n*  1925   – Nílton Santos, Brazilian footballer (d. 2013)\n*1928 – Billy Martin, American baseball player and coach (d. 1989)\n*1929 – Betty Carter, American singer-songwriter (d. 1998)\n*  1929   – John Conyers, American lawyer and politician\n*  1929   – Claude Morin, Canadian academic and politician\n*  1929   – Adrienne Rich, American poet, essayist, and feminist (d. 2012)\n*1930 – Friedrich Gulda, Austrian pianist and composer (d. 2000)\n*1931 – Vujadin Boškov, Serbian footballer, coach, and manager (d. 2014)\n*  1931   – K. Natwar Singh, Indian scholar and politician, Indian Minister of External Affairs\n*  1931   – Lowell P. Weicker, Jr., American soldier and politician, 85th Governor of Connecticut\n*1934 – Kenneth O. Morgan, Welsh historian and author\n*  1934   – Antony Walker, English general\n*1935 – Floyd Smith, Canadian ice hockey player and coach\n*1936 – Karl Lehmann, German cardinal\n*1937 – Yvonne Craig, American ballet dancer and actress (d. 2015)\n*1938 – Stuart Bell, English lawyer and politician (d. 2012)\n*  1938   – Ivan Sutherland, American computer scientist and academic\n*1941 – Denis Hart, Australian archbishop\n*1942 – David Penry-Davey, English lawyer and judge\n*1943 – Kay Andrews, Baroness Andrews, English politician\n*  1943   – Dan Coats, American politician and diplomat, 29th United States Ambassador to Germany\n*1944 – Billy Cobham, Panamanian-American drummer, composer, and bandleader \n*  1944   – Antal Nagy, Hungarian footballer\n*  1944   – Danny Trejo, American actor \n*1946 – John Law, English sociologist and academic\n*  1946 – Robert Fripp, English guitarist, songwriter and producer\n*  1947   – Darrell Sweet, Scottish drummer (d. 1999)\n*  1947   – Roch Thériault, Canadian religious leader (d. 2011)\n*1948 – Jesper Christensen, Danish actor, director, and producer\n*  1948   – Judy Finnigan, English talk show host and author\n*  1948   – Enrico Fumia, Italian automobile and product designer\n*  1948   – Emma Georgina Rothschild, English historian and academic\n*  1948   – Staf Van Roosbroeck, Belgian cyclist\n*1949 – Rick Reuschel, American baseball player\n*1950 – Georg Bednorz, German physicist and academic, Nobel Prize laureate\n*  1950   – Ray Condo, Canadian singer-songwriter and guitarist (d. 2004)\n*  1950   – Bruce Coville, American author\n*1951 – Christian Lacroix, French fashion designer\n*  1951   – Jonathan Richman, American singer-songwriter and guitarist \n*  1951   – Janet Soskice, Canadian philosopher and theologian\n*1952 – James Herndon, American psychologist and academic\n*1953 – Pierce Brosnan, Irish-American actor and producer\n*  1953   – Peter Onorati, American actor\n*  1953   – Richard Page, American singer-songwriter and bass player \n*  1953   – Kitanoumi Toshimitsu, Japanese sumo wrestler, the 55th Yokozuna (d. 2015)\n*  1953   – David Maclean, Scottish politician\n*  1953   – Stephen Woolman, Lord Woolman, Scottish judge and academic\n*1954 – Dafydd Williams, Canadian physician and astronaut\n*1955 – Olga Korbut, Soviet gymnast\n*  1955   – Jack Morris, American baseball player and sportscaster\n*  1955   – Hazel O'Connor, English-born Irish singer-songwriter and actress\n*  1955   – Páidí Ó Sé, Irish footballer and manager (d. 2012)\n*  1955   – Debra Winger, American actress \n*1957 – Joan Benoit, American runner\n*  1957   – Benjamin Mancroft, 3rd Baron Mancroft, English politician\n*  1957   – Yuri Shevchuk, Russian singer-songwriter and guitarist \n*  1957   – Anthony St John, 22nd Baron St John of Bletso, English lawyer and businessman\n*  1957   – Bob Suter, American ice hockey player and coach (d. 2014)\n*1959 – Mitch Webster, American baseball player\n*  1959   – Mare Winningham, American actress and singer-songwriter\n*1960 – Landon Deireragea, Nauruan politician, Nauruan Speaker of Parliament\n*  1960   – S. Shanmuganathan, Sri Lankan commander and politician (d. 1998)\n*1961 – Kevin McDonald, Canadian actor and screenwriter\n*  1961   – Charles Wright, American wrestler\n*1962 – Jimmy Hood, Scottish engineer and politician\n*  1962   – Helga Radtke, German long jumper\n*1963 – Rachel Griffith, Anglo-American economist\n*  1963   – David Wilkinson, English theologian and academic\n*1964 – John Salley, American basketball player and actor\n*  1964   – Boyd Tinsley, American singer-songwriter and violinist \n*1964 – Milton Jones, English comedian, actor, and screenwriter\n*1965 – Krist Novoselic, American bass player, songwriter, author, and activist\n*  1965   – Tanel Tammet, Estonian computer scientist, engineer, and academic\n*1966 – Janet Jackson, American singer-songwriter, producer, dancer, and actress\n*  1966   – Scott Reeves, American singer-songwriter and actor \n*  1966   – Thurman Thomas, American football player\n*1967 – Doug Brocail, American baseball player and coach\n*  1967   – Susan Williams, Baroness Williams of Trafford, British politician\n*1968 – Ralph Tresvant, American singer and producer \n*1969 – David Boreanaz, American actor\n*  1969   – Tucker Carlson, American journalist, co-founded The Daily Caller\n*  1969   – Steve Lewis, American sprinter\n*1970 – Gabriela Sabatini, Argentinian tennis player\n*  1970   – Danielle Spencer, Australian singer-songwriter and actress\n*1971 – Phil Clarke, English rugby league player and sportscaster\n*  1971   – Rachel Goswell, English singer-songwriter and guitarist \n*1972 – Christian Califano, French rugby player\n*  1972   – Matthew Hart, New Zealand cricketer\n*1973 – Tori Spelling, American actress, reality television personality, and author\n*1974 – Laura Pausini, Italian singer-songwriter and producer\n*  1974   – Sonny Sandoval, American singer-songwriter and rapper\n*1975 – Tony Kakko, Finnish musician, composer, and vocalist\n*1976 – Dirk Nannes, Australian-Dutch cricketer\n*1977 – Melanie Lynskey, New Zealand actress\n*  1977   – Emilíana Torrini, Icelandic singer-songwriter\n*1978 – Scott Nicholls, English motorcycle racer\n*  1978   – Lionel Scaloni, Argentinian footballer\n*1980 – Nuria Llagostera Vives, Spanish tennis player\n*1981 – Ricardo Costa, Portuguese footballer\n*1983 – Daniel Kerr, Australian footballer\n*  1983   – Kyle Wellwood, Canadian ice hockey player\n*1984 – Darío Cvitanich, Argentinian footballer\n*  1984   – Tomáš Fleischmann, Czech ice hockey player\n*  1984   – Jensen Lewis, American baseball player\n*  1984   – Rick Rypien, Canadian ice hockey player (d. 2011)\n*1985 – Anja Mittag, German footballer\n*  1985   – Rodrigo Peters Marques, Brazilian footballer\n*  1985   – Corey Perry, Canadian ice hockey player\n*1986 – Megan Fox, American actress\n*  1986   – Andy Keogh, Irish footballer\n*  1986   – Shamcey Supsup, Filipino model and architect\n*1987 – Tom Onslow-Cole, English race car driver\n*1988 – Jesús Castillo, Mexican footballer\n*  1988   – Martynas Gecevičius, Lithuanian basketball player\n*  1988   – Jaak Põldma, Estonian tennis player\n*1989 – Behati Prinsloo, Namibian model\n*1990 – Amanda Carreras, Gibraltarian tennis player\n*  1990   – Thomas Brodie-Sangster, English actor\n*  1990   – Darko Šarović, Serbian sprinter\n*  1990   – Omar Strong, American basketball player\n*1991 – Grigor Dimitrov, Bulgarian tennis player\n*1991 –Joey Graceffa, American internet celebrity \n*  1991   – Ashley Wagner, American figure skater\n*1992 – Jeff Skinner, Canadian ice hockey player\n*1993 – Johannes Thingnes Bø, Norwegian biathlete\n*  1993   – Karol Mets, Estonian footballer\n*1995 – Elizabeth Ralston, Australian footballer\n*1996 – Louisa Chirico, American tennis player\n\nDeaths\n\n* 290 – Emperor Wu of Jin, Chinese emperor (b. 236)\n* 895 – Qian Kuan, Chinese nobleman\n* 934 – Meng Hanqiong, eunuch official of Later Tang\n*1182 – John Komnenos Vatatzes, Byzantine general (b. 1132)\n*1265 – Simon Stock, English-French saint (b. 1165)\n*1375 – Liu Bowen, Chinese military strategist, officer, statesman and poet (b. 1311)\n*1412 – Gian Maria Visconti, Duke of Milan*1561 – Jan Tarnowski, Polish noble and statesman (b. 1488)\n*1620 – William Adams, English sailor and navigator (b. 1564)\n*1657 – Andrew Bobola, Polish missionary and martyr (b. 1591)\n*1667 – Thomas Wriothesley, 4th Earl of Southampton, English politician, Lord High Treasurer (b. 1607)\n*1669 – Pietro da Cortona, Italian painter and architect, designed the Santi Luca e Martina (b. 1596)\n*1691 – Jacob Leisler, German-American politician, 8th Colonial Governor of New York (b. 1640)\n*1696 – Mariana of Austria, Queen consort of Spain (b. 1634)\n*1703 – Charles Perrault, French author and academic (b. 1628)\n*1778 – Robert Darcy, 4th Earl of Holderness, English politician, Secretary of State for the Southern Department (b. 1718)\n*1790 – Philip Yorke, 2nd Earl of Hardwicke, English politician, Lord Lieutenant of Cambridgeshire (b. 1720)\n*1818 – Matthew Lewis, English author and playwright (b. 1775)\n*1830 – Joseph Fourier, French mathematician and physicist (b. 1768)\n*1862 – Edward Gibbon Wakefield, English politician (b. 1796)\n*1882 – Reuben Chapman, American lawyer and politician, 13th Governor of Alabama (b. 1799)\n*1890 – Mihkel Veske, Estonian poet, linguist and theologist (b. 1843)\n*1891 – Ion C. Brătianu, Romanian politician, 14th Prime Minister of Romania (b. 1821)\n*1910 – Henri-Edmond Cross, French Neo-Impressionist painter (b. 1856)\n*1913 – Louis Perrier, Swiss architect and politician (b. 1849)\n*1920 – Levi P. Morton, American politician, 22nd United States Vice President (b. 1824)\n*1926 – Mehmed VI, Ottoman sultan (b. 1861)\n*1936 – Leonidas Paraskevopoulos, Greek general and politician (b. 1860)\n*1938 – Joseph Strauss, American engineer, co designed The Golden Gate Bridge (b. 1870)\n*1943 – Alfred Hoche, German psychiatrist and academic (b. 1865)\n*1944 – George Ade, American journalist, author, and playwright (b. 1866)\n*1946 – Bruno Tesch, German chemist and businessman (b. 1890)\n*1947 – Frederick Gowland Hopkins, English biochemist and academic, Nobel Prize laureate (b. 1861)\n*  1947   – Zhang Lingfu, Chinese general (b. 1903)\n*1953 – Django Reinhardt, Belgian guitarist and composer  (b. 1910)\n*1954 – Clemens Krauss, Austrian conductor and manager (b. 1893)\n*1955 – James Agee, American novelist, screenwriter, and critic(b. 1909)\n*  1955   – Manny Ayulo, American racing driver (b. 1921)\n*1956 – H. B. Reese, American candy-maker and businessman, created Reese's Peanut Butter Cups  (b. 1876)\n*1957 – Eliot Ness, American federal agent (b. 1903)\n*1961 – George A. Malcolm, American lawyer and jurist (b. 1881)\n*1973 – Jacques Lipchitz, Lithuanian-American sculptor (b. 1891)\n*1977 – Modibo Keïta, Malian politician, 1st President of Mali (b. 1915)\n*1979 – A. Philip Randolph, American union leader and activist (b. 1889)\n*1981 – Ernie Freeman, American pianist, composer, and bandleader (b. 1922)\n*  1981   – Willy Hartner, German physician and academic (b. 1905)\n*1984 – Andy Kaufman, American actor, comedian, and screenwriter (b. 1949)\n*  1984   – Irwin Shaw, American playwright, screenwriter, novelist, and short story writer (b. 1913)\n*1985 – Margaret Hamilton, American actress (b. 1902)\n*1989 – Leila Kasra, Iranian poet and songwriter (b. 1939)\n*1990 – Sammy Davis Jr., American singer, dancer, and actor (b. 1925)\n*  1990   – Jim Henson, American puppeteer, director, producer, and screenwriter, created The Muppets (b. 1936)\n*1993 – Marv Johnson, American singer-songwriter and pianist (b. 1938)\n*1994 – Alain Cuny, French actor (b. 1908)\n*1996 – Jeremy Michael Boorda, American admiral (b. 1939)\n*1997 – Elbridge Durbrow, American diplomat (b. 1903)\n*2002 – Alec Campbell, Australian soldier (b. 1899)\n*2003 – Mark McCormack, American lawyer and sports agent, founded IMG (b. 1930)\n*2005 – Andrew Goodpaster, American general (b. 1915)\n*2008 – Robert Mondavi, American winemaker, co-founded the Opus One Winery (b. 1913)\n*2010 – Ronnie James Dio, American singer-songwriter and producer (b. 1942)\n*  2010   – Hank Jones, American pianist, composer, and bandleader (b. 1918)\n*2011 – Ralph Barker, English author (b. 1917) \n*  2011   – Bob Davis, Australian footballer and coach (b. 1928)\n*  2011   – Edward Hardwicke, English actor (b. 1932)\n*  2011   – Kiyoshi Kodama, Japanese actor (b. 1934)\n*2012 – Patricia Aakhus, American author and academic (b. 1952)\n*  2012   – James Abdnor, American soldier and politician, 30th Lieutenant Governor of South Dakota (b. 1923)\n*  2012   – Chuck Brown, American singer-songwriter, guitarist, and producer (b. 1936)\n*  2012   – Ernie Chan, Filipino-American illustrator (b. 1940)\n*  2012   – Kevin Hickey, American baseball player (b. 1956)\n*2013 – Angelo Errichetti, American politician (b. 1928)\n*  2013   – Bryan Illerbrun, Canadian football player (b. 1957)\n*  2013   – Frankie Librán, Puerto Rican-American baseball player (b. 1948)\n*  2013   – Heinrich Rohrer, Swiss physicist and academic, Nobel Prize laureate (b. 1933)\n*  2013   – Dick Trickle, American race car driver (b. 1941)\n*  2013   – Bernard Waber, American author and illustrator (b. 1921)\n*2014 – Chris Duckworth, Zimbabwean-South African cricketer (b. 1933)\n*  2014   – Vito Favero, Italian cyclist (b. 1932)\n*  2014   – Bud Hollowell, American baseball player and manager (b. 1943)\n*  2014   – Clyde Snow, American anthropologist and author (b. 1928)\n*2015 – Prashant Bhargava, American director and producer (b. 1973)\n*  2015   – Moshe Levinger, Israeli rabbi and author (b. 1935)\n*  2015   – Flora MacNeil, Scottish Gaelic singer (b. 1928)\n\nHolidays and observances\n\n* Christian feast day:\n** Aaron (Coptic Church)\n** Abda and Abdjesus, and companions:\n*** Abdas of Susa\n** Andrew Bobola\n** Brendan the Navigator (Roman Catholic Church, Anglican Communion, Eastern Orthodox Church)\n** Caroline Chisholm (Church of England)\n** Germerius\n** Honoratus of Amiens\n** John of Nepomuk\n** Margaret of Cortona\n** Peregrine of Auxerre\n** Simon Stock\n** Ubald (see Saint Ubaldo Day)\n* Martyrs of Sudan (Episcopal Church (USA))\n* Mass Graves Day (Iraq)\n* National Day, declared by Salva Kiir Mayardit (South Sudan)\n* Teachers' Day (Malaysia). May 16. http://en.wikipedia.org/?curid=19659."
  }
}
