{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8334",
  "eid" : "e7234ee0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778467534,
  "textBody" : "Events\n\n*218 BC – Second Punic War: Battle of the Trebia – Hannibal's Carthaginian forces defeat those of the Roman Republic.\n*1271 – Kublai Khan renames his empire \"Yuan\" (元 yuán), officially marking the start of the Yuan dynasty of Mongolia and China.\n*1499 – Rebellion triggeres in Alpujarras in response to the forced conversions of Muslims in Spain. \n*1622 – Portuguese forces score a military victory over the Kingdom of Kongo at the Battle of Mbumbi in present-day Angola.\n*1655 – The Whitehall Conference ends with the determination that there was no law preventing Jews from re-entering England after the Edict of Expulsion of 1290.\n*1777 – The United States celebrates its first Thanksgiving, marking the recent victory by the American rebels over British General John Burgoyne at Saratoga in October.\n*1787 – New Jersey becomes the third state to ratify the U.S. Constitution.\n*1793 – Surrender of the frigate La Lutine by French Royalists to Lord Samuel Hood; renamed , she later becomes a famous treasure wreck.\n*1833 – The national anthem of the Russian Empire, \"God Save the Tsar!\", is first performed.\n*1865 – US Secretary of State William Seward proclaims the adoption of the Thirteenth Amendment, prohibiting slavery throughout the USA. \n*1878 – The Al-Thani family become the rulers of the state of Qatar.\n*1892 – Premiere performance of The Nutcracker by Pyotr Ilyich Tchaikovsky in Saint Petersburg, Russia.\n*1898 – Gaston de Chasseloup-Laubat sets the first officially recognized land speed record of  in a Jeantaud electric car.\n*1900 – The Upper Ferntree Gully to Gembrook, Victoria Narrow-gauge (2 ft 6 in or 762 mm) Railway (now the Puffing Billy Railway) in Victoria, Australia is opened for traffic.\n*1916 – World War I: The Battle of Verdun ends when German forces under Chief of staff Erich von Falkenhayn are defeated by the French, and suffer 337,000 casualties.\n*1917 – The resolution containing the language of the Eighteenth Amendment to enact Prohibition is passed by the United States Congress.\n*1932 – The Chicago Bears defeat the Portsmouth Spartans in the first NFL Championship Game.\n*1935 – The Lanka Sama Samaja Party is founded in Ceylon.\n*1939 – World War II: The Battle of the Heligoland Bight, the first major air battle of the war, takes place.\n*1944 – World War II: Seventy-seven B-29 Superfortress and 200 other aircraft of U.S. Fourteenth Air Force bomb Hankow, China, a Japanese supply base.\n*1958 – Project SCORE, the world's first communications satellite, is launched.\n*1966 – Saturn's moon Epimetheus is discovered by astronomer Richard Walker.\n*1972 – Vietnam War: President Richard Nixon announces that the United States will engage North Vietnam in Operation Linebacker II, a series of Christmas bombings, after peace talks collapsed with North Vietnam on the 13th.\n*1973 – Soviet Soyuz Programme: Soyuz 13, crewed by cosmonauts Valentin Lebedev and Pyotr Klimuk, is launched from Baikonur in the Soviet Union.\n*1981 – First flight of the Russian heavy strategic bomber Tu-160, the world's largest combat aircraft, largest supersonic aircraft and largest variable-sweep wing aircraft built.\n*1999 – NASA launches into orbit the Terra platform carrying five Earth Observation instruments, including ASTER, CERES, MISR, MODIS and MOPITT.\n*2002 – California gubernatorial recall: Then Governor of California Gray Davis announces that the state would face a record budget deficit of $35 billion, roughly double the figure reported during his reelection campaign one month earlier.\n*2005 – The Chadian Civil War begins when rebel groups, allegedly backed by neighbouring Sudan, launch an attack in Adré.\n*2006 – The first of a series of floods strikes Malaysia. The death toll of all flooding is at least 118, with over 400,000 people displaced.\n*  2006   – United Arab Emirates holds its first-ever elections.\n*2015 – Kellingley Colliery, the last deep coal mine in Great Britain, closes.\n*2017 – Amtrak Cascades passenger train 501, derailed near DuPont, Washington, a city in United States near Olympia, Washington killing 6 people, and injuring 70 others.\n\nBirths\n\n*1406 – Richard Olivier de Longueil, French Roman Catholic bishop and cardinal (d. 1470)\n*1481 – Sophie of Mecklenburg, Duchess of Mecklenburg, Duchess of Saxony (d. 1503)\n*1505 – Philipp von Hutten, German explorer (d. 1546)\n*1507 – Ōuchi Yoshitaka, Japanese daimyo (d. 1551)\n*1590 – William Louis, Count of Nassau-Saarbrücken (d. 1640)\n*1602 – Simonds d'Ewes, English historian and politician (d. 1650)\n*1610 – Charles du Fresne, sieur du Cange, French philologist and historian (d. 1688)\n*1620 – Heinrich Roth, German missionary and scholar (d. 1668)\n*1626 – Christina, Queen of Sweden (d. 1689)\n*1660 – Countess Johanna Magdalene of Hanau-Lichtenberg (d. 1715)\n*1661 – Christopher Polhem, Swedish physicist and inventor (d. 1751)\n*1662 – James Douglas, 2nd Duke of Queensberry, Scottish colonel and politician, Secretary of State for Scotland (d. 1711)\n*1707 – Charles Wesley, English missionary and composer (d. 1788)\n*1725 – Johann Salomo Semler, German historian and theologian (d. 1791)\n*1734 – Jean-Baptiste Rey, French conductor and composer (d. 1810)\n*1800 – James Watney, English brewer and businessman (d. 1884)\n*1824 – John Hall, English-New Zealand politician, 12th Prime Minister of New Zealand (d. 1907)\n*1825 – Charles Griffin, American general (d. 1876)\n*  1825   – John S. Harris, American surveyor and politician (d. 1906)\n*1835 – Lyman Abbott, American minister, theologian, and author (d. 1922)\n*1847 – Augusta Holmès, French pianist and composer (d. 1903)\n*1849 – Henrietta Edwards, Canadian activist and author (d. 1931)\n*1851 – Graciano López Jaena, Filipino journalist (d. 1896)\n*1856 – J. J. Thomson, English physicist and academic, Nobel Prize laureate (d. 1940)\n*1860 – Edward MacDowell, American pianist and composer (d. 1908)\n*1861 – Lionel Monckton, English composer and critic (d. 1924)\n*1863 – Archduke Franz Ferdinand of Austria (d. 1914)\n*1867 – Foxhall P. Keene, American polo player and horse breeder (d. 1941)\n*1869 – Edward Willis Redfield, American painter and educator (d. 1965)\n*1870 – Saki, British short story writer (d. 1916)\n*1873 – Francis Burton Harrison, American general and politician, 6th Governor-General of the Philippines (d. 1957)\n*1875 – Matt McGrath, Irish-American hammer thrower (d. 1941)\n*1878 – Joseph Stalin, Georgian-Russian marshal and politician, 4th Premier of the Soviet Union (d. 1953)\n*1879 – Paul Klee, Swiss-German painter and educator (d. 1940)\n*1882 – Richard Maury, American-Argentinian engineer, designed the Salta–Antofagasta railway (d. 1950)\n*1884 – Emil Starkenstein, Czech pharmacologist, co-founded clinical pharmacology (d. 1942)\n*1886 – Ty Cobb, American baseball player and manager (d. 1961)\n*1887 – Bhikhari Thakur, Indian actor, singer, and playwright (d. 1971)\n*1888 – Gladys Cooper, English actress and singer (d. 1971)\n*  1888   – Robert Moses, American urban planner (d. 1981)\n*1890 – Edwin Howard Armstrong, American engineer, invented FM radio (d. 1954)\n*1896 – Gerald Barry, English colonel and cricketer (d. 1977)\n*1897 – Fletcher Henderson, American pianist and composer (d. 1952)\n*1899 – Peter Wessel Zapffe, Norwegian philosopher and author (d. 1990)\n*1904 – George Stevens, American director, producer, screenwriter, and cinematographer (d. 1975)\n*1907 – Bill Holland, American race car driver (d. 1984)\n*  1907   – Lawrence Lucie, American guitarist and educator (d. 2009)\n*1908 – Celia Johnson, English actress (d. 1982)\n*  1908   – Paul Siple, American geographer and explorer (d. 1969)\n*1910 – Abe Burrows, American author, playwright, and director (d. 1985)\n*  1910   – Eric Tindill, New Zealand rugby player, cricketer, and umpire (d. 2010)\n*1911 – Jules Dassin, American-Greek actor, director, producer, and screenwriter (d. 2008)\n*1912 – Benjamin O. Davis, Jr., American general and pilot (d. 2002)\n*1913 – Alfred Bester, American author and screenwriter (d. 1987)\n*  1913   – Willy Brandt, German politician, 4th Chancellor of Germany, Nobel Prize laureate (d. 1992)\n*  1913   – Ray Meyer, American basketball player and coach (d. 2006)\n*1916 – Douglas Fraser, Scottish-American trade union leader and academic (d. 2008)\n*  1916   – Betty Grable, American actress, singer, and dancer (d. 1973)\n*1917 – Ossie Davis, American actor and activist (d. 2005)\n*1920 – Robert Leckie, American soldier and author (d. 2001)\n*1922 – Jack Brooks, American colonel, lawyer, and politician (d. 2012)\n*  1922   – Esther Lederberg, American microbiologist (d. 2006)\n*1923 – Edwin Bramall, Baron Bramall, English field marshal and politician, Lord Lieutenant of Greater London\n*1927 – Ramsey Clark, American lawyer and politician, 66th United States Attorney General\n*  1927   – Roméo LeBlanc, Canadian journalist and politician, 25th Governor General of Canada (d. 2009)\n*1928 – Mirza Tahir Ahmad, Indian-English caliph and author (d. 2003)\n*  1928   – Harold Land, American tenor saxophonist (d. 2001)\n*1929 – Gino Cimoli, American baseball player (d. 2011)\n*  1929   – Józef Glemp, Polish cardinal (d. 2013)\n*1930 – Moose Skowron, American baseball player (d. 2012)\n*1931 – Allen Klein, American businessman and music publisher (d. 2009)\n*  1931   – Alison Plowden, English historian and author (d. 2007)\n*  1931   – Bill Thompson, American television host (d. 2014)\n*1932 – Norm Provan, Australian rugby league player, coach, and businessman\n*  1932   – Roger Smith, American actor, producer, and screenwriter (d. 2017)\n*1934 – Marc Rich, Belgian-American businessman, founded Glencore (d. 2013)\n*  1934   – Boris Volynov, Russian colonel, engineer, and astronaut\n*1935 – Rosemary Leach, English actress (d. 2017)\n*  1935   – Jacques Pépin, French-American chef and author\n*1936 – Malcolm Kirk, English rugby player and wrestler (d. 1987)\n*1937 – Nancy Ryles, American politician (d. 1990)\n*1938 – Chas Chandler, English bass player and producer (d. 1996)\n*  1938   – Joel Hirschhorn, American songwriter and composer (d. 2005)\n*1939 – Michael Moorcock, English author and songwriter\n*  1939   – Harold E. Varmus, American biologist and academic, Nobel Prize laureate\n*1940 – Ilario Castagner, Italian football manager\n*  1940   – John Cooper, English sprinter and hurdler (d. 1974)\n*1941 – Sam Andrew, American singer-songwriter and guitarist  (d. 2015)\n*  1941   – Wadada Leo Smith, American trumpet player and composer \n*  1941   – Joan Wallach Scott, American historian, author, and academic\n*1942 – Lenore Blum, American mathematician and academic\n*  1942   – Bobby Keyes, Australian rugby league player\n*1943 – Bobby Keys, American saxophone player (d. 2014)\n*  1943   – Keith Richards, English singer-songwriter, guitarist and producer\n*  1943   – Alan Rudolph, American director and screenwriter\n*1944 – Crispian Steele-Perkins, English trumpet player and educator\n*1945 – Jean Pronovost, Canadian ice hockey player and coach\n*1946 – Steve Biko, South African activist, founded the Black Consciousness Movement (d. 1977)\n*  1946   – Steven Spielberg, American director, producer, and screenwriter, co-founded DreamWorks\n*1947 – Leonid Yuzefovich, Russian author and screenwriter\n*1948 – Bill Nelson, English singer-songwriter and guitarist \n*  1948   – Mimmo Paladino, Italian sculptor and painter\n*  1948   – Laurent Voulzy, French-English singer-songwriter and guitarist\n*1949 – David A. Johnston, American volcanologist and geologist (d. 1980)\n*1950 – Gillian Armstrong, Australian director, producer, and screenwriter\n*  1950   – Randy Castillo, American drummer and songwriter (d. 2002)\n*  1950   – Sarath Fonseka, Sri Lankan general and politician\n*  1950   – Lizmark, Mexican wrestler (d. 2015)\n*  1950   – Leonard Maltin, American historian, author, and critic\n*1952 – John Leventhal, American songwriter and producer\n*1953 – Elliot Easton, American guitarist and singer\n*1954 – John Booth, English race car driver\n*  1954   – Ray Liotta, American actor\n*  1954   – Willi Wülbeck, German runner\n*1955 – Vijay Mallya, Indian businessman and politician\n*  1955   – Bogusław Mamiński, Polish runner\n*1957 – Jonathan Cainer, English astrologer and author (d. 2016)\n*1958 – Geordie Walker, English guitarist \n*  1958   – Julia Wolfe, American composer and educator\n*1960 – Kazuhide Uekusa, Japanese economist and academic\n*  1960   – Naoko Yamano, Japanese singer, guitarist and composer \n*1961 – Brian Orser, Canadian figure skater and coach\n*  1961   – Leila Steinberg, American singer, producer, author, and poet\n*  1961   – Daniel S. Loeb, American businessman and philanthropist, founded Third Point Management\n*  1961   – Lalchand Rajput, former Indian cricketer\n*1963 – Norman Brown, American singer and guitarist \n*  1963   – Greg D'Angelo, American drummer \n*  1963   – Karl Dorrell, American football player and coach\n*  1963   – Pierre Nkurunziza, Burundian soldier and politician, President of Burundi\n*  1963   – Charles Oakley, American basketball player and coach\n*  1963   – Brad Pitt, American actor and producer\n*1964 – Stone Cold Steve Austin, American wrestler and producer\n*  1964   – Don Beebe, American football player and coach\n*1965 – Shawn Christian, American actor, director, and screenwriter\n*  1965   – Manuel Peña Escontrela, Spanish footballer (d. 2012)\n*1966 – Gianluca Pagliuca, Italian footballer and sportscaster\n*1967 – Toine van Peperstraten, Dutch journalist\n*  1967   – Mille Petrozza, German singer-songwriter and guitarist\n*1968 – Mario Basler, German footballer and manager\n*  1968   – Rachel Griffiths, Australian actress\n*  1968   – Alejandro Sanz, Spanish singer-songwriter and guitarist\n*  1968   – Casper Van Dien, American actor and producer\n*1969 – Santiago Cañizares, Spanish footballer\n*  1969   – Justin Edinburgh, English footballer and manager\n*  1969   – Akira Iida, Japanese race car driver\n*1970 – DMX, American rapper and actor\n*  1970   – Lucious Harris, American basketball player\n*  1970   – Giannis Ploutarhos, Greek singer-songwriter\n*  1970   – Rob Van Dam, American wrestler\n*  1970   – Jonathan Yeo, English painter\n*1971 – Barkha Dutt, Indian journalist\n*  1971   – Noriko Matsueda, Japanese pianist and composer\n*  1971   – Arantxa Sánchez Vicario, Spanish tennis player and sportscaster\n*1972 – Anzhela Balakhonova, Ukrainian pole vaulter\n*  1972   – Raymond Herrera, American drummer and songwriter \n*1973 – Fatuma Roba, Ethiopian runner\n*1974 – Peter Boulware, American football player and politician\n*  1974   – Knut Schreiner, Norwegian singer, guitarist, and producer \n*1975 – Sia Furler, Australian singer-songwriter \n*  1975   – Randy Houser, American singer-songwriter and guitarist\n*  1975   – Trish Stratus, Canadian wrestler and actress\n*1977 – José Acevedo, Dominican baseball player\n*  1977   – Maria Brink, American singer-songwriter \n*  1977   – Claudia Gesell, German runner\n*1978 – Daniel Cleary, Canadian ice hockey player\n*  1978   – Ali Curtis, American soccer player\n*  1978   – Josh Dallas, American actor\n*  1978   – Katie Holmes, American actress \n*1980 – Christina Aguilera, American singer-songwriter, producer, and actress\n*  1980   – Neil Fingleton, English actor and basketball player, one of the tallest 25 men in the world (d. 2017)\n*  1980   – Heinz Inniger, Swiss snowboarder\n*  1980   – Benjamin Watson, American football player\n*1983 – Andy Fantuz, Canadian football player\n*1984 – Brian Boyle, American ice hockey player\n*  1984   – Paul Harrison, English footballer\n*  1984   – Giuliano Razzoli, Italian skier\n*  1984   – Derrick Tribbett, American bass player and singer \n*1986 – François Hamelin, Canadian speed skater\n*  1986   – Usman Khawaja, Pakistani-Australian cricketer\n*  1986   – Bill Stull, American football player\n*1987 – Ayaka, Japanese singer-songwriter and producer\n*  1987   – Miki Ando, Japanese figure skater\n*  1987   – Yuki Furukawa, Japanese actor\n*1988 – Lizzie Deignan, English cyclist\n*  1988   – Seth Doege, American football player\n*  1988   – Brianne Theisen-Eaton, Canadian heptathlete\n*1988 – Imad Wasim, Pakistani cricketer\n*1990 – Sierra Kay, American singer-songwriter \n*1991 – Marcus Butler, English internet celebrity \n*1992 – Ryan Crouser, American shot putter\n*1993 – Byron Buxton, American baseball player\n*  1993   – Ana Porgras, Romanian former artistic gymnast\n*  1993   – Thomas Lam, Finnish professional football defender\n*1994 – Natália Kelly, American-Austrian singer\n*  1994   – Gerard Gumbau, Spanish professional footballer\n*2001 – Billie Eilish, American pop singer\n\nDeaths\n\n* 821 – Theodulf of Orléans, Spanish bishop and poet (b. 750)\n* 919 – Lady Wu, wife of Qian Liu (b. 858)\n* 933 – Yaonian Yanmujin, Chinese empress dowager\n*1075 – Edith of Wessex (b. 1025)\n*1111 – Al-Ghazali, Persian jurist, philosopher, theologian, and mystic (b. 1058)\n*1133 – Hildebert, French poet and scholar (b. 1055)\n*1290 – Magnus III, king of Sweden (b. 1240)\n*1442 – Pierre Cauchon, French Catholic bishop (b. 1371)\n*1495 – Alfonso II of Naples (b. 1448)\n*1577 – Anna of Saxony, Princess consort of Orange (b. 1544)\n*1651 – William Brabazon, 1st Earl of Meath, English lawyer and politician (b. 1580)\n*1692 – Veit Ludwig von Seckendorff, German scholar and politician (b. 1626)\n*1737 – Antonio Stradivari, Italian instrument maker (b. 1644)\n*1787 – Soame Jenyns, English poet and politician (b. 1704)\n*1799 – Jean-Étienne Montucla, French mathematician and historian (b. 1725)\n*1803 – Johann Gottfried Herder, German philosopher, theologian, and poet (b. 1744)\n*1829 – Jean-Baptiste Lamarck, French soldier, biologist, and academic (b. 1744)\n*1843 – Thomas Graham, 1st Baron Lynedoch, Scottish-English general and politician (b. 1748)\n*1848 – Bernard Bolzano, Bohemian priest and mathematician (b. 1781)\n*1869 – Louis Moreau Gottschalk, American pianist and composer (b. 1829)\n*1880 – Michel Chasles, French mathematician and academic (b. 1793)\n*1892 – Richard Owen, English biologist, anatomist, and paleontologist (b. 1804)\n*1919 – John Alcock, English captain and pilot (b. 1892)\n*1922 – Sir Carl Meyer, 1st Baronet, German-English banker and businessman (b. 1851)\n*1925 – Hamo Thornycroft, English sculptor and academic (b. 1850)\n*1932 – Eduard Bernstein, German theorist and politician (b. 1850)\n*1936 – Andrija Mohorovičić, Croatian meteorologist and seismologist (b. 1857)\n*1939 – Ernest Lawson, Canadian-American painter (b. 1873)\n*1961 – Leo Reisman, American violinist and bandleader (b. 1897)\n*1969 – Charles Dvorak, American pole vaulter and coach (b. 1878)\n*1971 – Bobby Jones, American golfer and lawyer (b. 1902)\n*  1971   – Diana Lynn, American actress (b. 1926)\n*1973 – Allamah Rasheed Turabi, Indian-Pakistani religious leader and philosopher (b. 1908)\n*1974 – Harry Hooper, American baseball player, coach, and manager (b. 1887)\n*1975 – Theodosius Dobzhansky, Ukrainian geneticist and biologist (b. 1900)\n*1977 – Michio Nishizawa, Japanese baseball player and manager (b. 1921)\n*  1977   – Louis Untermeyer  American poet, anthologist, critic (b. 1885)\n*1980 – Dobriša Cesarić, Croatian poet and translator (b. 1902)\n*  1980   – Alexei Kosygin, Russian soldier and politician, 8th Premier of the Soviet Union (b. 1904)\n*1982 – Hans-Ulrich Rudel, German colonel and pilot (b. 1916)\n*1985 – Xuân Diệu, Vietnamese poet and author (b. 1916)\n*1987 – Conny Plank, German keyboard player and producer  (b. 1940)\n*1988 – Niyazi Berkes, Turkish Cypriot-English sociologist and academic (b. 1908)\n*1990 – Anne Revere, American actress (b. 1903)\n*  1990   – Paul Tortelier, French cellist and composer (b. 1914)\n*  1990   – Joseph Zubin, Lithuanian-American psychologist and academic (b. 1900)\n*1991 – George Abecassis, English race car driver (b. 1913)\n*1992 – Mark Goodson, American game show producer, created Family Feud and The Price Is Right (b. 1915)\n*1993 – Helm Glöckler, German race car driver (b. 1909)\n*  1993   – Sam Wanamaker, American-English actor, director, and producer (b. 1919)\n*1994 – Roger Apéry, Greek-French mathematician and academic (b. 1916)\n*  1994   – Lilia Skala, Austrian-American actress (b. 1896)\n*1995 – Brian Brockless, English organist, composer, and conductor (b. 1926)\n*  1995   – Ross Thomas, American author (b. 1926)\n*  1995   – Konrad Zuse, German engineer, designed the Z3 computer (b. 1910)\n*1996 – Yulii Borisovich Khariton, Russian physicist and academic (b. 1904)\n*  1996   – Irving Caesar, American composer (b. 1895)\n*1997 – Chris Farley, American comedian and actor (b. 1964)\n*1998 – Lev Dyomin, Russian colonel, pilot, and astronaut (b. 1926)\n*1999 – Robert Bresson, French director and screenwriter (b. 1901)\n*2000 – Stan Fox, American race car driver (b. 1952)\n*  2000   – Randolph Apperson Hearst, American businessman (b. 1915)\n*  2000   – Kirsty MacColl, British singer-songwriter (b. 1959)\n*2001 – Gilbert Bécaud, French singer-songwriter, pianist, and actor (b. 1927)\n*  2001   – Dimitris Dragatakis, Greek violinist and composer (b. 1914)\n*  2001   – Marcel Mule, French saxophonist and educator (b. 1901)\n*2002 – Necip Hablemitoğlu, Turkish historian and academic (b. 1954)\n*  2002   – Ray Hnatyshyn, Canadian lawyer and politician, 24th Governor General of Canada (b. 1934)\n*  2002   – Wayne Owens, American lawyer and politician (b. 1937)\n*2004 – Anthony Sampson, English journalist and author (b. 1926)\n*2005 – Alan Voorhees, American engineer and urban planner (b. 1922)\n*2006 – Joseph Barbera, American animator, director, and producer, co-founded Hanna-Barbera (b. 1911)\n*  2006   – Ruth Bernhard, German-American photographer (b. 1905)\n*  2006   – Shaukat Siddiqui, Pakistani author and activist (b. 1923)\n*2007 – Hans Billian, Polish-German actor, director, and screenwriter (b. 1918)\n*  2007   – Gerald Le Dain, Canadian lawyer and judge (b. 1924)\n*  2007   – William Strauss, American author and playwright (b. 1947)\n*  2007   – Alan Wagner, American businessman and critic (b. 1931)\n*2008 – Majel Barrett, American actress and producer (b. 1932)\n*  2008   – Mark Felt, American FBI agent and informant (b. 1913)\n*2010 – Phil Cavarretta, American baseball player and manager (b. 1916)\n*  2010   – Jacqueline de Romilly, French philologist, author, and scholar (b. 1913)\n*  2010   – Tommaso Padoa-Schioppa, Italian economist and politician, Italian Minister of Economy and Finances (b. 1940)\n*  2010   – James Pickles, English judge and journalist (b. 1925)\n*2011 – Václav Havel, Czech poet, playwright, and politician, 1st President of the Czech Republic (b. 1936)\n*2012 – Frank Macchiarola, American lawyer and academic (b. 1941)\n*  2012   – Mustafa Ould Salek, Mauritanian colonel and politician, President of Mauritania (b. 1936)\n*  2012   – Jim Whalen, American football player (b. 1943)\n*  2012   – Anatoliy Zayaev, Ukrainian footballer, coach, and manager (b. 1931)\n*2013 – Ken Hutcherson, American football player (b. 1952)\n*  2013   – Graham Mackay, South African-English businessman (b. 1949)\n*2014 – Donald J. Albosta, American soldier and politician (b. 1925)\n*  2014   – Gideon Ben-Yisrael, Israeli soldier and politician (b. 1923)\n*  2014   – Larry Henley, American singer-songwriter (b. 1937)\n*  2014   – Virna Lisi, Italian actress (b. 1936)\n*  2014   – Mandy Rice-Davies, English model and actress (b. 1944)\n*  2014   – Robert Simpson, American meteorologist and author (b. 1912)\n*2015 – Luc Brewaeys, Belgian pianist, composer, and conductor (b. 1959)\n*  2015   – Helge Solum Larsen, Norwegian businessman and politician (b. 1969)\n*2016 – Zsa Zsa Gabor, Hungarian-American actress and socialite (b. 1917)\n*2017 – Kim Jong-hyun, South Korean singer (b. 1990)\n\nHolidays and observances\n\n* Christian feast day:\n** Expectation of the Blessed Virgin Mary\n** Flannán\n** Gatianus of Tours\n** O Adonai\n** Our Lady of Expectation\n** Sebastian (Eastern Orthodox Church)\n** Winibald\n** December 18 (Eastern Orthodox liturgics)\n* International Migrants Day \n* National Day (Qatar)\n* Republic Day (Niger)\n* UN Arabic Language Day (United Nations)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "December 18" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8334" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*218 BC – Second Punic War: Battle of the Trebia – Hannibal's Carthaginian forces defeat those of the Roman Republic.\n*1271 – Kublai Khan renames his empire \"Yuan\" (元 yuán), officially marking the start of the Yuan dynasty of Mongolia and China.\n*1499 – Rebellion triggeres in Alpujarras in response to the forced conversions of Muslims in Spain. \n*1622 – Portuguese forces score a military victory over the Kingdom of Kongo at the Battle of Mbumbi in present-day Angola.\n*1655 – The Whitehall Conference ends with the determination that there was no law preventing Jews from re-entering England after the Edict of Expulsion of 1290.\n*1777 – The United States celebrates its first Thanksgiving, marking the recent victory by the American rebels over British General John Burgoyne at Saratoga in October.\n*1787 – New Jersey becomes the third state to ratify the U.S. Constitution.\n*1793 – Surrender of the frigate La Lutine by French Royalists to Lord Samuel Hood; renamed , she later becomes a famous treasure wreck.\n*1833 – The national anthem of the Russian Empire, \"God Save the Tsar!\", is first performed.\n*1865 – US Secretary of State William Seward proclaims the adoption of the Thirteenth Amendment, prohibiting slavery throughout the USA. \n*1878 – The Al-Thani family become the rulers of the state of Qatar.\n*1892 – Premiere performance of The Nutcracker by Pyotr Ilyich Tchaikovsky in Saint Petersburg, Russia.\n*1898 – Gaston de Chasseloup-Laubat sets the first officially recognized land speed record of  in a Jeantaud electric car.\n*1900 – The Upper Ferntree Gully to Gembrook, Victoria Narrow-gauge (2 ft 6 in or 762 mm) Railway (now the Puffing Billy Railway) in Victoria, Australia is opened for traffic.\n*1916 – World War I: The Battle of Verdun ends when German forces under Chief of staff Erich von Falkenhayn are defeated by the French, and suffer 337,000 casualties.\n*1917 – The resolution containing the language of the Eighteenth Amendment to enact Prohibition is passed by the United States Congress.\n*1932 – The Chicago Bears defeat the Portsmouth Spartans in the first NFL Championship Game.\n*1935 – The Lanka Sama Samaja Party is founded in Ceylon.\n*1939 – World War II: The Battle of the Heligoland Bight, the first major air battle of the war, takes place.\n*1944 – World War II: Seventy-seven B-29 Superfortress and 200 other aircraft of U.S. Fourteenth Air Force bomb Hankow, China, a Japanese supply base.\n*1958 – Project SCORE, the world's first communications satellite, is launched.\n*1966 – Saturn's moon Epimetheus is discovered by astronomer Richard Walker.\n*1972 – Vietnam War: President Richard Nixon announces that the United States will engage North Vietnam in Operation Linebacker II, a series of Christmas bombings, after peace talks collapsed with North Vietnam on the 13th.\n*1973 – Soviet Soyuz Programme: Soyuz 13, crewed by cosmonauts Valentin Lebedev and Pyotr Klimuk, is launched from Baikonur in the Soviet Union.\n*1981 – First flight of the Russian heavy strategic bomber Tu-160, the world's largest combat aircraft, largest supersonic aircraft and largest variable-sweep wing aircraft built.\n*1999 – NASA launches into orbit the Terra platform carrying five Earth Observation instruments, including ASTER, CERES, MISR, MODIS and MOPITT.\n*2002 – California gubernatorial recall: Then Governor of California Gray Davis announces that the state would face a record budget deficit of $35 billion, roughly double the figure reported during his reelection campaign one month earlier.\n*2005 – The Chadian Civil War begins when rebel groups, allegedly backed by neighbouring Sudan, launch an attack in Adré.\n*2006 – The first of a series of floods strikes Malaysia. The death toll of all flooding is at least 118, with over 400,000 people displaced.\n*  2006   – United Arab Emirates holds its first-ever elections.\n*2015 – Kellingley Colliery, the last deep coal mine in Great Britain, closes.\n*2017 – Amtrak Cascades passenger train 501, derailed near DuPont, Washington, a city in United States near Olympia, Washington killing 6 people, and injuring 70 others.\n\nBirths\n\n*1406 – Richard Olivier de Longueil, French Roman Catholic bishop and cardinal (d. 1470)\n*1481 – Sophie of Mecklenburg, Duchess of Mecklenburg, Duchess of Saxony (d. 1503)\n*1505 – Philipp von Hutten, German explorer (d. 1546)\n*1507 – Ōuchi Yoshitaka, Japanese daimyo (d. 1551)\n*1590 – William Louis, Count of Nassau-Saarbrücken (d. 1640)\n*1602 – Simonds d'Ewes, English historian and politician (d. 1650)\n*1610 – Charles du Fresne, sieur du Cange, French philologist and historian (d. 1688)\n*1620 – Heinrich Roth, German missionary and scholar (d. 1668)\n*1626 – Christina, Queen of Sweden (d. 1689)\n*1660 – Countess Johanna Magdalene of Hanau-Lichtenberg (d. 1715)\n*1661 – Christopher Polhem, Swedish physicist and inventor (d. 1751)\n*1662 – James Douglas, 2nd Duke of Queensberry, Scottish colonel and politician, Secretary of State for Scotland (d. 1711)\n*1707 – Charles Wesley, English missionary and composer (d. 1788)\n*1725 – Johann Salomo Semler, German historian and theologian (d. 1791)\n*1734 – Jean-Baptiste Rey, French conductor and composer (d. 1810)\n*1800 – James Watney, English brewer and businessman (d. 1884)\n*1824 – John Hall, English-New Zealand politician, 12th Prime Minister of New Zealand (d. 1907)\n*1825 – Charles Griffin, American general (d. 1876)\n*  1825   – John S. Harris, American surveyor and politician (d. 1906)\n*1835 – Lyman Abbott, American minister, theologian, and author (d. 1922)\n*1847 – Augusta Holmès, French pianist and composer (d. 1903)\n*1849 – Henrietta Edwards, Canadian activist and author (d. 1931)\n*1851 – Graciano López Jaena, Filipino journalist (d. 1896)\n*1856 – J. J. Thomson, English physicist and academic, Nobel Prize laureate (d. 1940)\n*1860 – Edward MacDowell, American pianist and composer (d. 1908)\n*1861 – Lionel Monckton, English composer and critic (d. 1924)\n*1863 – Archduke Franz Ferdinand of Austria (d. 1914)\n*1867 – Foxhall P. Keene, American polo player and horse breeder (d. 1941)\n*1869 – Edward Willis Redfield, American painter and educator (d. 1965)\n*1870 – Saki, British short story writer (d. 1916)\n*1873 – Francis Burton Harrison, American general and politician, 6th Governor-General of the Philippines (d. 1957)\n*1875 – Matt McGrath, Irish-American hammer thrower (d. 1941)\n*1878 – Joseph Stalin, Georgian-Russian marshal and politician, 4th Premier of the Soviet Union (d. 1953)\n*1879 – Paul Klee, Swiss-German painter and educator (d. 1940)\n*1882 – Richard Maury, American-Argentinian engineer, designed the Salta–Antofagasta railway (d. 1950)\n*1884 – Emil Starkenstein, Czech pharmacologist, co-founded clinical pharmacology (d. 1942)\n*1886 – Ty Cobb, American baseball player and manager (d. 1961)\n*1887 – Bhikhari Thakur, Indian actor, singer, and playwright (d. 1971)\n*1888 – Gladys Cooper, English actress and singer (d. 1971)\n*  1888   – Robert Moses, American urban planner (d. 1981)\n*1890 – Edwin Howard Armstrong, American engineer, invented FM radio (d. 1954)\n*1896 – Gerald Barry, English colonel and cricketer (d. 1977)\n*1897 – Fletcher Henderson, American pianist and composer (d. 1952)\n*1899 – Peter Wessel Zapffe, Norwegian philosopher and author (d. 1990)\n*1904 – George Stevens, American director, producer, screenwriter, and cinematographer (d. 1975)\n*1907 – Bill Holland, American race car driver (d. 1984)\n*  1907   – Lawrence Lucie, American guitarist and educator (d. 2009)\n*1908 – Celia Johnson, English actress (d. 1982)\n*  1908   – Paul Siple, American geographer and explorer (d. 1969)\n*1910 – Abe Burrows, American author, playwright, and director (d. 1985)\n*  1910   – Eric Tindill, New Zealand rugby player, cricketer, and umpire (d. 2010)\n*1911 – Jules Dassin, American-Greek actor, director, producer, and screenwriter (d. 2008)\n*1912 – Benjamin O. Davis, Jr., American general and pilot (d. 2002)\n*1913 – Alfred Bester, American author and screenwriter (d. 1987)\n*  1913   – Willy Brandt, German politician, 4th Chancellor of Germany, Nobel Prize laureate (d. 1992)\n*  1913   – Ray Meyer, American basketball player and coach (d. 2006)\n*1916 – Douglas Fraser, Scottish-American trade union leader and academic (d. 2008)\n*  1916   – Betty Grable, American actress, singer, and dancer (d. 1973)\n*1917 – Ossie Davis, American actor and activist (d. 2005)\n*1920 – Robert Leckie, American soldier and author (d. 2001)\n*1922 – Jack Brooks, American colonel, lawyer, and politician (d. 2012)\n*  1922   – Esther Lederberg, American microbiologist (d. 2006)\n*1923 – Edwin Bramall, Baron Bramall, English field marshal and politician, Lord Lieutenant of Greater London\n*1927 – Ramsey Clark, American lawyer and politician, 66th United States Attorney General\n*  1927   – Roméo LeBlanc, Canadian journalist and politician, 25th Governor General of Canada (d. 2009)\n*1928 – Mirza Tahir Ahmad, Indian-English caliph and author (d. 2003)\n*  1928   – Harold Land, American tenor saxophonist (d. 2001)\n*1929 – Gino Cimoli, American baseball player (d. 2011)\n*  1929   – Józef Glemp, Polish cardinal (d. 2013)\n*1930 – Moose Skowron, American baseball player (d. 2012)\n*1931 – Allen Klein, American businessman and music publisher (d. 2009)\n*  1931   – Alison Plowden, English historian and author (d. 2007)\n*  1931   – Bill Thompson, American television host (d. 2014)\n*1932 – Norm Provan, Australian rugby league player, coach, and businessman\n*  1932   – Roger Smith, American actor, producer, and screenwriter (d. 2017)\n*1934 – Marc Rich, Belgian-American businessman, founded Glencore (d. 2013)\n*  1934   – Boris Volynov, Russian colonel, engineer, and astronaut\n*1935 – Rosemary Leach, English actress (d. 2017)\n*  1935   – Jacques Pépin, French-American chef and author\n*1936 – Malcolm Kirk, English rugby player and wrestler (d. 1987)\n*1937 – Nancy Ryles, American politician (d. 1990)\n*1938 – Chas Chandler, English bass player and producer (d. 1996)\n*  1938   – Joel Hirschhorn, American songwriter and composer (d. 2005)\n*1939 – Michael Moorcock, English author and songwriter\n*  1939   – Harold E. Varmus, American biologist and academic, Nobel Prize laureate\n*1940 – Ilario Castagner, Italian football manager\n*  1940   – John Cooper, English sprinter and hurdler (d. 1974)\n*1941 – Sam Andrew, American singer-songwriter and guitarist  (d. 2015)\n*  1941   – Wadada Leo Smith, American trumpet player and composer \n*  1941   – Joan Wallach Scott, American historian, author, and academic\n*1942 – Lenore Blum, American mathematician and academic\n*  1942   – Bobby Keyes, Australian rugby league player\n*1943 – Bobby Keys, American saxophone player (d. 2014)\n*  1943   – Keith Richards, English singer-songwriter, guitarist and producer\n*  1943   – Alan Rudolph, American director and screenwriter\n*1944 – Crispian Steele-Perkins, English trumpet player and educator\n*1945 – Jean Pronovost, Canadian ice hockey player and coach\n*1946 – Steve Biko, South African activist, founded the Black Consciousness Movement (d. 1977)\n*  1946   – Steven Spielberg, American director, producer, and screenwriter, co-founded DreamWorks\n*1947 – Leonid Yuzefovich, Russian author and screenwriter\n*1948 – Bill Nelson, English singer-songwriter and guitarist \n*  1948   – Mimmo Paladino, Italian sculptor and painter\n*  1948   – Laurent Voulzy, French-English singer-songwriter and guitarist\n*1949 – David A. Johnston, American volcanologist and geologist (d. 1980)\n*1950 – Gillian Armstrong, Australian director, producer, and screenwriter\n*  1950   – Randy Castillo, American drummer and songwriter (d. 2002)\n*  1950   – Sarath Fonseka, Sri Lankan general and politician\n*  1950   – Lizmark, Mexican wrestler (d. 2015)\n*  1950   – Leonard Maltin, American historian, author, and critic\n*1952 – John Leventhal, American songwriter and producer\n*1953 – Elliot Easton, American guitarist and singer\n*1954 – John Booth, English race car driver\n*  1954   – Ray Liotta, American actor\n*  1954   – Willi Wülbeck, German runner\n*1955 – Vijay Mallya, Indian businessman and politician\n*  1955   – Bogusław Mamiński, Polish runner\n*1957 – Jonathan Cainer, English astrologer and author (d. 2016)\n*1958 – Geordie Walker, English guitarist \n*  1958   – Julia Wolfe, American composer and educator\n*1960 – Kazuhide Uekusa, Japanese economist and academic\n*  1960   – Naoko Yamano, Japanese singer, guitarist and composer \n*1961 – Brian Orser, Canadian figure skater and coach\n*  1961   – Leila Steinberg, American singer, producer, author, and poet\n*  1961   – Daniel S. Loeb, American businessman and philanthropist, founded Third Point Management\n*  1961   – Lalchand Rajput, former Indian cricketer\n*1963 – Norman Brown, American singer and guitarist \n*  1963   – Greg D'Angelo, American drummer \n*  1963   – Karl Dorrell, American football player and coach\n*  1963   – Pierre Nkurunziza, Burundian soldier and politician, President of Burundi\n*  1963   – Charles Oakley, American basketball player and coach\n*  1963   – Brad Pitt, American actor and producer\n*1964 – Stone Cold Steve Austin, American wrestler and producer\n*  1964   – Don Beebe, American football player and coach\n*1965 – Shawn Christian, American actor, director, and screenwriter\n*  1965   – Manuel Peña Escontrela, Spanish footballer (d. 2012)\n*1966 – Gianluca Pagliuca, Italian footballer and sportscaster\n*1967 – Toine van Peperstraten, Dutch journalist\n*  1967   – Mille Petrozza, German singer-songwriter and guitarist\n*1968 – Mario Basler, German footballer and manager\n*  1968   – Rachel Griffiths, Australian actress\n*  1968   – Alejandro Sanz, Spanish singer-songwriter and guitarist\n*  1968   – Casper Van Dien, American actor and producer\n*1969 – Santiago Cañizares, Spanish footballer\n*  1969   – Justin Edinburgh, English footballer and manager\n*  1969   – Akira Iida, Japanese race car driver\n*1970 – DMX, American rapper and actor\n*  1970   – Lucious Harris, American basketball player\n*  1970   – Giannis Ploutarhos, Greek singer-songwriter\n*  1970   – Rob Van Dam, American wrestler\n*  1970   – Jonathan Yeo, English painter\n*1971 – Barkha Dutt, Indian journalist\n*  1971   – Noriko Matsueda, Japanese pianist and composer\n*  1971   – Arantxa Sánchez Vicario, Spanish tennis player and sportscaster\n*1972 – Anzhela Balakhonova, Ukrainian pole vaulter\n*  1972   – Raymond Herrera, American drummer and songwriter \n*1973 – Fatuma Roba, Ethiopian runner\n*1974 – Peter Boulware, American football player and politician\n*  1974   – Knut Schreiner, Norwegian singer, guitarist, and producer \n*1975 – Sia Furler, Australian singer-songwriter \n*  1975   – Randy Houser, American singer-songwriter and guitarist\n*  1975   – Trish Stratus, Canadian wrestler and actress\n*1977 – José Acevedo, Dominican baseball player\n*  1977   – Maria Brink, American singer-songwriter \n*  1977   – Claudia Gesell, German runner\n*1978 – Daniel Cleary, Canadian ice hockey player\n*  1978   – Ali Curtis, American soccer player\n*  1978   – Josh Dallas, American actor\n*  1978   – Katie Holmes, American actress \n*1980 – Christina Aguilera, American singer-songwriter, producer, and actress\n*  1980   – Neil Fingleton, English actor and basketball player, one of the tallest 25 men in the world (d. 2017)\n*  1980   – Heinz Inniger, Swiss snowboarder\n*  1980   – Benjamin Watson, American football player\n*1983 – Andy Fantuz, Canadian football player\n*1984 – Brian Boyle, American ice hockey player\n*  1984   – Paul Harrison, English footballer\n*  1984   – Giuliano Razzoli, Italian skier\n*  1984   – Derrick Tribbett, American bass player and singer \n*1986 – François Hamelin, Canadian speed skater\n*  1986   – Usman Khawaja, Pakistani-Australian cricketer\n*  1986   – Bill Stull, American football player\n*1987 – Ayaka, Japanese singer-songwriter and producer\n*  1987   – Miki Ando, Japanese figure skater\n*  1987   – Yuki Furukawa, Japanese actor\n*1988 – Lizzie Deignan, English cyclist\n*  1988   – Seth Doege, American football player\n*  1988   – Brianne Theisen-Eaton, Canadian heptathlete\n*1988 – Imad Wasim, Pakistani cricketer\n*1990 – Sierra Kay, American singer-songwriter \n*1991 – Marcus Butler, English internet celebrity \n*1992 – Ryan Crouser, American shot putter\n*1993 – Byron Buxton, American baseball player\n*  1993   – Ana Porgras, Romanian former artistic gymnast\n*  1993   – Thomas Lam, Finnish professional football defender\n*1994 – Natália Kelly, American-Austrian singer\n*  1994   – Gerard Gumbau, Spanish professional footballer\n*2001 – Billie Eilish, American pop singer\n\nDeaths\n\n* 821 – Theodulf of Orléans, Spanish bishop and poet (b. 750)\n* 919 – Lady Wu, wife of Qian Liu (b. 858)\n* 933 – Yaonian Yanmujin, Chinese empress dowager\n*1075 – Edith of Wessex (b. 1025)\n*1111 – Al-Ghazali, Persian jurist, philosopher, theologian, and mystic (b. 1058)\n*1133 – Hildebert, French poet and scholar (b. 1055)\n*1290 – Magnus III, king of Sweden (b. 1240)\n*1442 – Pierre Cauchon, French Catholic bishop (b. 1371)\n*1495 – Alfonso II of Naples (b. 1448)\n*1577 – Anna of Saxony, Princess consort of Orange (b. 1544)\n*1651 – William Brabazon, 1st Earl of Meath, English lawyer and politician (b. 1580)\n*1692 – Veit Ludwig von Seckendorff, German scholar and politician (b. 1626)\n*1737 – Antonio Stradivari, Italian instrument maker (b. 1644)\n*1787 – Soame Jenyns, English poet and politician (b. 1704)\n*1799 – Jean-Étienne Montucla, French mathematician and historian (b. 1725)\n*1803 – Johann Gottfried Herder, German philosopher, theologian, and poet (b. 1744)\n*1829 – Jean-Baptiste Lamarck, French soldier, biologist, and academic (b. 1744)\n*1843 – Thomas Graham, 1st Baron Lynedoch, Scottish-English general and politician (b. 1748)\n*1848 – Bernard Bolzano, Bohemian priest and mathematician (b. 1781)\n*1869 – Louis Moreau Gottschalk, American pianist and composer (b. 1829)\n*1880 – Michel Chasles, French mathematician and academic (b. 1793)\n*1892 – Richard Owen, English biologist, anatomist, and paleontologist (b. 1804)\n*1919 – John Alcock, English captain and pilot (b. 1892)\n*1922 – Sir Carl Meyer, 1st Baronet, German-English banker and businessman (b. 1851)\n*1925 – Hamo Thornycroft, English sculptor and academic (b. 1850)\n*1932 – Eduard Bernstein, German theorist and politician (b. 1850)\n*1936 – Andrija Mohorovičić, Croatian meteorologist and seismologist (b. 1857)\n*1939 – Ernest Lawson, Canadian-American painter (b. 1873)\n*1961 – Leo Reisman, American violinist and bandleader (b. 1897)\n*1969 – Charles Dvorak, American pole vaulter and coach (b. 1878)\n*1971 – Bobby Jones, American golfer and lawyer (b. 1902)\n*  1971   – Diana Lynn, American actress (b. 1926)\n*1973 – Allamah Rasheed Turabi, Indian-Pakistani religious leader and philosopher (b. 1908)\n*1974 – Harry Hooper, American baseball player, coach, and manager (b. 1887)\n*1975 – Theodosius Dobzhansky, Ukrainian geneticist and biologist (b. 1900)\n*1977 – Michio Nishizawa, Japanese baseball player and manager (b. 1921)\n*  1977   – Louis Untermeyer  American poet, anthologist, critic (b. 1885)\n*1980 – Dobriša Cesarić, Croatian poet and translator (b. 1902)\n*  1980   – Alexei Kosygin, Russian soldier and politician, 8th Premier of the Soviet Union (b. 1904)\n*1982 – Hans-Ulrich Rudel, German colonel and pilot (b. 1916)\n*1985 – Xuân Diệu, Vietnamese poet and author (b. 1916)\n*1987 – Conny Plank, German keyboard player and producer  (b. 1940)\n*1988 – Niyazi Berkes, Turkish Cypriot-English sociologist and academic (b. 1908)\n*1990 – Anne Revere, American actress (b. 1903)\n*  1990   – Paul Tortelier, French cellist and composer (b. 1914)\n*  1990   – Joseph Zubin, Lithuanian-American psychologist and academic (b. 1900)\n*1991 – George Abecassis, English race car driver (b. 1913)\n*1992 – Mark Goodson, American game show producer, created Family Feud and The Price Is Right (b. 1915)\n*1993 – Helm Glöckler, German race car driver (b. 1909)\n*  1993   – Sam Wanamaker, American-English actor, director, and producer (b. 1919)\n*1994 – Roger Apéry, Greek-French mathematician and academic (b. 1916)\n*  1994   – Lilia Skala, Austrian-American actress (b. 1896)\n*1995 – Brian Brockless, English organist, composer, and conductor (b. 1926)\n*  1995   – Ross Thomas, American author (b. 1926)\n*  1995   – Konrad Zuse, German engineer, designed the Z3 computer (b. 1910)\n*1996 – Yulii Borisovich Khariton, Russian physicist and academic (b. 1904)\n*  1996   – Irving Caesar, American composer (b. 1895)\n*1997 – Chris Farley, American comedian and actor (b. 1964)\n*1998 – Lev Dyomin, Russian colonel, pilot, and astronaut (b. 1926)\n*1999 – Robert Bresson, French director and screenwriter (b. 1901)\n*2000 – Stan Fox, American race car driver (b. 1952)\n*  2000   – Randolph Apperson Hearst, American businessman (b. 1915)\n*  2000   – Kirsty MacColl, British singer-songwriter (b. 1959)\n*2001 – Gilbert Bécaud, French singer-songwriter, pianist, and actor (b. 1927)\n*  2001   – Dimitris Dragatakis, Greek violinist and composer (b. 1914)\n*  2001   – Marcel Mule, French saxophonist and educator (b. 1901)\n*2002 – Necip Hablemitoğlu, Turkish historian and academic (b. 1954)\n*  2002   – Ray Hnatyshyn, Canadian lawyer and politician, 24th Governor General of Canada (b. 1934)\n*  2002   – Wayne Owens, American lawyer and politician (b. 1937)\n*2004 – Anthony Sampson, English journalist and author (b. 1926)\n*2005 – Alan Voorhees, American engineer and urban planner (b. 1922)\n*2006 – Joseph Barbera, American animator, director, and producer, co-founded Hanna-Barbera (b. 1911)\n*  2006   – Ruth Bernhard, German-American photographer (b. 1905)\n*  2006   – Shaukat Siddiqui, Pakistani author and activist (b. 1923)\n*2007 – Hans Billian, Polish-German actor, director, and screenwriter (b. 1918)\n*  2007   – Gerald Le Dain, Canadian lawyer and judge (b. 1924)\n*  2007   – William Strauss, American author and playwright (b. 1947)\n*  2007   – Alan Wagner, American businessman and critic (b. 1931)\n*2008 – Majel Barrett, American actress and producer (b. 1932)\n*  2008   – Mark Felt, American FBI agent and informant (b. 1913)\n*2010 – Phil Cavarretta, American baseball player and manager (b. 1916)\n*  2010   – Jacqueline de Romilly, French philologist, author, and scholar (b. 1913)\n*  2010   – Tommaso Padoa-Schioppa, Italian economist and politician, Italian Minister of Economy and Finances (b. 1940)\n*  2010   – James Pickles, English judge and journalist (b. 1925)\n*2011 – Václav Havel, Czech poet, playwright, and politician, 1st President of the Czech Republic (b. 1936)\n*2012 – Frank Macchiarola, American lawyer and academic (b. 1941)\n*  2012   – Mustafa Ould Salek, Mauritanian colonel and politician, President of Mauritania (b. 1936)\n*  2012   – Jim Whalen, American football player (b. 1943)\n*  2012   – Anatoliy Zayaev, Ukrainian footballer, coach, and manager (b. 1931)\n*2013 – Ken Hutcherson, American football player (b. 1952)\n*  2013   – Graham Mackay, South African-English businessman (b. 1949)\n*2014 – Donald J. Albosta, American soldier and politician (b. 1925)\n*  2014   – Gideon Ben-Yisrael, Israeli soldier and politician (b. 1923)\n*  2014   – Larry Henley, American singer-songwriter (b. 1937)\n*  2014   – Virna Lisi, Italian actress (b. 1936)\n*  2014   – Mandy Rice-Davies, English model and actress (b. 1944)\n*  2014   – Robert Simpson, American meteorologist and author (b. 1912)\n*2015 – Luc Brewaeys, Belgian pianist, composer, and conductor (b. 1959)\n*  2015   – Helge Solum Larsen, Norwegian businessman and politician (b. 1969)\n*2016 – Zsa Zsa Gabor, Hungarian-American actress and socialite (b. 1917)\n*2017 – Kim Jong-hyun, South Korean singer (b. 1990)\n\nHolidays and observances\n\n* Christian feast day:\n** Expectation of the Blessed Virgin Mary\n** Flannán\n** Gatianus of Tours\n** O Adonai\n** Our Lady of Expectation\n** Sebastian (Eastern Orthodox Church)\n** Winibald\n** December 18 (Eastern Orthodox liturgics)\n* International Migrants Day \n* National Day (Qatar)\n* Republic Day (Niger)\n* UN Arabic Language Day (United Nations). December 18. http://en.wikipedia.org/?curid=8334."
  }
}
