{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18625",
  "eid" : "340836d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778596541,
  "textBody" : "Professor Ludwig Von Drake is one of Walt Disney's cartoon and comic book characters. He was first introduced on September 24, 1961, as the presenter (and singer of \"The Spectrum Song\") in the cartoon An Adventure in Color, part of the first episode of Walt Disney's Wonderful World of Color on NBC. Said to be an uncle of Donald Duck. He is described as a scientist, lecturer, psychologist, and world traveler. The character displayed his \"expert\" knowledge on a variety of subjects in eighteen episodes of the classic anthology series, as well as on a number of Disneyland Records.\n\nPaul Frees was the original voice of Ludwig Von Drake. After Frees retired from the role, the character was briefly voiced by Walker Edmiston. Since 1987, he has been voiced by Corey Burton.\n\nCharacter\n\nLudwig Von Drake comes from Vienna, Austria and has a fascination with knowledge. Since his youth he has been trying to obtain as many diplomas, in any science, as possible. When he is consulted by other family members, it is a running gag that he almost invariably turns out to have a university degree relevant for whatever information they are seeking. He is often shown as having little social competence, however, and is often portrayed as being very forgetful, sometimes even somewhat senile. In the comics Ludwig usually visits with Donald Duck and Donald's nephews Huey, Dewey and Louie. On occasion, Daisy Duck would coax (or even trick) the professor into giving lectures and tours for her ladies' club. Sometimes Ludwig and Gyro Gearloose have competed as to who is the greater inventor. He can play the piano and acoustic guitar, as shown in a few television specials and more.\n\nIn the Wonderful World of Color episode Kids is Kids, Ludwig states that he is a bachelor.\n\nIn the comic strips by the famous duo of comic artists Bob Karp and Al Taliaferro, Donald and his nephews usually call him 'Uncle Ludwig', but in the comic stories he is generally called 'Ludwig' or 'Professor' by them. Daisy Duck refers to Ludwig as sort of an uncle of Donald in the first Sunday strip where his name is mentioned.[http://coa.inducks.org/story.php?cZD+61-09-24 Coa Inducks - Page for the Sunday strip ZD 61-09-24] In the story \"Duckburg, U.S.A.\", published in Ludwig Von Drake #1 (November 1961), Professor Ludwig Von Drake arrives in Duckburg by train, and it is shown that Donald Duck had never seen this Austrian relative before, not even in a picture. Grandma Duck, Uncle Scrooge McDuck, Daisy Duck, Gladstone Gander, Huey, Dewey and Louie, Gus Goose, and Gyro Gearloose also appear in this same story waiting to know Ludwig at the train station, and Grandma enthusiastically exclaims, \"Professor Ludwig Von Drake! Such a nice-sounding name!\".[http://coa.inducks.org/hr.php?normalsize\n1&imagehttp://outducks.org/webusers/webusers-char0/us_lvd_001_02_001_gd.jpg Coa Inducks - Excerpt of the comic story Duckburg, U.S.A.] According to an explanation created by Don Rosa's personal family tree, he would have to be married to Donald Duck's aunt, Matilda McDuck, making him Scrooge's brother-in-law. Nevertheless, Ludwig exclaims in the Christmas story \"The Cuckoo Clock Caper\" that he and Scrooge are \"joined in good fellowship\".[http://coa.inducks.org/hr.php?normalsize\n1&imagehttp://outducks.org/webusers/webusers-char0/us_cpgk_01_06_007_lvd.jpg Coa Inducks - Excerpt of the comic story The Cuckoo Clock Caper] Besides, he was shown as a member of the Absentminded Dating Club,[http://coa.inducks.org/hr.php?normalsize\n1&imagehttp://outducks.org/webusers/webusers-char0/us_zz1985h12d_001_alicefromyd.png Coa Inducks - Excerpt of the comic strip YD 85-07-12] being the suitor of another member of this same club in some old comic strips, a duck woman called Alice.[http://coa.inducks.org/character.php?c1\ndate&cAlice%20from%20YD&view\n4 Coa Inducks - Index to strips with Alice from YD] Therefore, Ludwig's marital status is officially unmarried.\n\nIn a theory based on an old American comic story called \"The Family Tree Spree\", Humperdink Duck's early life before marrying Elvira Coot could be nebulous enough to pin him and Ludwig as half-brothers, thus making Ludwig a granduncle to Donald. In this story, Donald scares of seeing Ludwig's specs on the floor and thinks about them as \"Uncle Ludwig's specs\".[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/au_gs_265c_004_dd.jpg Coa Inducks - Excerpt of the comic story The Family Tree Spree] In the end of this same story, it's revealed that Ludwig also appears in Donald's paternal family tree, wherein he and Donald both have an ancestor called Colombust Duck, who tried to prove the world was flat.[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_lvd_003_03_005_lvd.png Coa Inducks - Excerpt of the comic story The Family Tree Spree] So it's possible to conclude that Ludwig, whose Austrian father obviously owns the surname Von Drake, has an ancestor with the surname Duck because of his mother. In this case, Humperdink, who possibly was some years older than Ludwig, really could be regarded as half-brother on mother's side of Ludwig and both of their parents would be descendants from the failed geographer Colombust Duck.\n\nIn some old comic stories where Ludwig visits Grandma on her farm, it's clear that they have a close relationship, as shown in the story \"Message From Space\", where Grandma exclaims, \"You need rest, dear boy!\", after thinking he had a kind of nervous breakdown.[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_lvd_004_08_004_gd.png Coa Inducks - Excerpt of the comic story Message From Space] In \"Pigeon Panic\" Ludwig exclaims, \"Ho! You know you can depend on me!\", after Grandma warned him to be careful with her smartest homer.[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_us_0051_03_001_gd.jpg Coa Inducks - Excerpt of the comic story Pigeon Panic] There is an enlightening sequence of two panels in the story \"The Rural Eggs-pert\", where Ludwig is resting in an old chair of Grandma's house when an antique buyer asks Grandma to sell him \"this fine old specimen\" (the chair) and she answers, \"Well, it's been in the family for years, but I could do without it!\", making Ludwig astonished, since he thinks she's referring to him as if he was a livestock.[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_wdcd_34_10_007_lvd.jpg Coa Inducks - Excerpt of the comic story The Rural Eggs-Pert] He wouldn't have reacted this way if he wasn't her relative. In the last panel of the story \"Barn Dance Doctor\", Grandma refers to Ludwig as her \"cityfied cousin\".[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_gpsb_04_02_006_gd.jpg Coa Inducks - Excerpt of the comic story Barn Dance Doctor] Since it was stipulated by Don Rosa that her father was a Coot and her mother was a Gadwall, it's not clear if Ludwig Von Drake is related to Elvira Coot through her father or her mother. Elvira could have an Austrian ascendancy to explain her kinship to Ludwig.\n\nLudwig revealed in \"Blown Up Genius\" that he came from a long line of glass blowers.[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_wdc_267_04_002_lvd.png Coa Inducks - Excerpt of the comic story Blown Up Genius] In \"The Big Payoff\", it's revealed that he spent many months living in Donald's house since his arrival in Duckburg. Ludwig wins a TV chess challenge in this comic story, making Donald exclaim, \"Yippee! He did it! Now he can pay all he's owed us (he and his nephews) for these many months!\".[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_lvd_004_07_002_dd.png Coa Inducks - Excerpt of the comic story The Big Payoff] According to the story \"The Jewels of Skull Rock\",[http://coa.inducks.org/story.php?cW+DD++114-02 Coa Inducks - Page to the comic story The Jewels of Skull Rock] Ludwig spent six months in Donald's house.[http://coa.inducks.org/hr.php?normalsize\n1&image=http://outducks.org/webusers/webusers-char0/us_tc_0003b02_003_dd.png Coa Inducks - Excerpt of the comic story The Jewels of Skull Rock]\n\nThose ten stories mentioned above were drawn by Tony Strobl, who was the cartoonist responsible for introducing Professor Ludwig into American Disney comic books. Actually, Ludwig's first comic book appearance was in a not previously mentioned story by Strobl, \"The Scene Stealer\", first published in October, 1961. The events showed in this one presumably happened after the ones showed in \"Duckburg, U.S.A.\", which was published two months later.\n\nFilmography\n\nProfessor Ludwig Von Drake was introduced as a new character alongside Walt Disney himself in the very first episode of Walt Disney's Wonderful World of Color after the series was moved to NBC in the fall of 1961. He was designed, and frequently animated, by Milt Kahl and Ward Kimball, two of Disney's Nine Old Men of animators.\n\nWonderful World of Color appearances (1960s)\n*An Adventure in Color/Mathmagicland (24 September 1961) - This show introduced Walt Disney's new character and co-host Professor Ludwig Von Drake.\n*The Hunting Instinct (22 October 1961) - Von Drake sheds some light on the subject of why man hunts with his assistant Herman the Bootle Beetle. \n*Inside Donald Duck (5 November 1961) - Von Drake attempts to diagnose Donald Duck's problems, deciding the cause is romance.\n*Kids is Kids (10 December 1961) - Von Drake shares his knowledge on the subject of child psychology and how to handle Huey, Dewey and Louie.\n*Carnival Time (4 March 1962) - Von Drake takes a look at some major carnivals in New Orleans and Rio de Janeiro with Donald Duck and Jose Carioca.\n*Von Drake in Spain (8 April 1962) - Ludwig Von Drake lectures on the dances of Spain.\n*Man is His Own Worst Enemy (21 October 1962) - Von Drake explains why people are the biggest challenge facing humanity. This episode is sometimes titled Ducking Disaster with Donald and his Friends.\n*Three Tall Tales (6 January 1963) - Von Drake and his sidekick Herman tell three stories including \"Casey at the Bat\" and \"Paul Bunyan.\"\n*A Square Peg in a Round Hole (3 March 1963) - Von Drake has founded the Research Institute For Human Behavior.\n*Fly With Von Drake (13 October 1963) - Von Drake gives a historically accurate and funny lecture on the birth of manned flight.\n*The Truth About Mother Goose (17 November 1963) - Von Drake tells the stories behind Mother Goose rhymes. Including footage from Mickey and the Beanstalk. Von Drake narrates this story which was originally featured as a segment in the 1947 feature film Fun and Fancy Free, replacing the original narration; Herman makes a comeback in this episode.\n*In Shape with Von Drake (22 March 1964) - Von Drake returns to explain sports and fitness. He illustrates his points through the use of several Goofy cartoons.\n*Mediterranean Cruise (1964) - Von Drake takes a trip on a Cruise liner \n*A Rag, A Bone, A Box of Junk (1964) - Von Drake makes an cameo in this documentary about stop-motion animation\n*Music for Everybody (30 January 1966) - Von Drake hosts this look at the importance of music in people's lives.\n*Nature's Strangest Oddballs (30 January 1966) - Von Drake hosts this look at various animal species that have stayed\n\nTheatrical\n\n*A Symposium on Popular Songs (19 December 1962) - Von Drake demonstrates examples of popular music through the years.\n\nInside Donald Duck\n\nAmong his many interests is psychology, and he has tried to make a psychological study of his nephew Donald Duck. Ludwig was best fleshed out in this anthology cartoon, where Donald's psychology was examined, as we got to see some of his worst temper tantrums. Ludwig however was well understood by the end of the cartoon. His Austrian German ancestry betrayed itself in his language - for example \"as we say in the psychiatry\" is a very typical Germanism. In comics translated into German he sometimes speaks with an Austrian accent, like \"ein bisserl\" instead of \"ein bisschen\". He also enjoys several off color jokes, for instance \"What you have here is a depressed Duck! And there is nothing worse than depressed duck...unless you like depressed duck...but the taste is sometimes....\" making a pun off of the dish of pressed duck.\n\nCartoon appearances (1980s–present)\n\nVon Drake has appeared on several Disney animated cartoon series: DuckTales, Raw Toonage, Bonkers, Mickey Mouse Works, Quack Pack, Disney's House of Mouse, Mickey Mouse Clubhouse, Mickey Mouse, Mickey and the Roadster Racers and in numerous television specials. In all of these, Von Drake wears a pink shirt, black tie, red vest, and a lab coat.\n\nIn House of Mouse, Von Drake appears as a recurring character. In \"Ask Von Drake\", Mickey tries to prove that Ludwig Von Drake doesn't know everything. At the end, Mickey convinces him that during the headcount of all the Disney characters, he forgot himself. Also, in \"House of Genius\", Ludwig creates robot duplicates of Mickey, Minnie, Donald, Daisy, Goofy, and Pluto. At the end, when Ludwig brings in a robot duplicate of himself, Mickey tells the robot to send the real Ludwig packing.\n\nLudwig is due to appear as a recurring character in the DuckTales reboot.https://ohmy.disney.com/news/2017/06/14/disney-xds-new-ducktales-has-a-premiere-date-and-an-amazing-all-new-opening-title-sequence/\n\nLudwig Von Drake in the Sing-Along Songs series\n\nIn the Disney's Sing-Along Songs series of videos, he has hosted or co-hosted these six volumes:\n\n*You Can Fly (February 5, 1988)\n*Fun with Music (along with Professor Owl) (October 12, 1989)\n*Under the Sea (August 14, 1990)\n*I Love to Laugh (a.k.a. Supercalifragilisticexpialidocious) (December 28, 1990)\n*101 Notes of Fun (March 12, 1994)\n*Colors of the Wind (July 21, 1995)\n\nDisneyland Records discography\n\nIn 1961 Disneyland Records released the LP Professor Ludwig Von Drake. The LP had two songs from the character's debut in the An Adventure in Color episode (\"The Green With Envy Blues\" and \"The Spectrum Song\"), as well as new songs and comedy bits.\n\nThe track list for the \"Ludwig Von Drake\" LP:\n\n# I'm Ludwig Von Drake\n# The Spectrum Song\n# The Green With Envy Blues\n# It Gets You\n# Von Drake Variations on \"The Blue Danube\"\n# Professor Ludwig Von Drake Discourse: All About Sound Recording\n# An Operatic Version of a Theme from 'Cinderella'\n\nAs of February 2010, the digitally remastered LP can be downloaded exclusively at the iTunes Store.\n\nPrint appearances\n\nThe Disney studio encouraged the writers of Duck comics to introduce this new character in print, and already in September 1961, Von Drake started appearing in Al Taliaferro and Bob Karp's featured daily strips. However, aside from a solitary cameo appearance in a one-page story in Uncle Scrooge #54 (December 1964), the character was not used by leading Disney duck artist Carl Barks.\n\nIn 1961, Dell Comics launched a comic book series starring Von Drake and illustrated by Tony Strobl,[http://www.comicvine.com/comic/ludwig-von-drake/2037/&i21522&v\ng 'Ludwig Von Drake' comic book #1-#4 featuring Tony Strobl List]  but it only lasted for four issues before being discontinued. The character made subsequent appearances in other comic titles such as Walt Disney's Comics and Stories and in the Donald Duck newspaper strip.\n\nProfessor Ludwig has often been used by Italian cartoonists, including in some of the long sagas inspired by famous books that they usually produce with the Duck Family, such as \"La storia di Marco Polo detta Il Milione\" (free translation \"The Million - A Story of Marco Polo\") and \"Paperino in: Il mondo perduto\" (free translation \"Donald in: The Lost World\"). As a result, he has achieved a quite significant popularity in Italy (he's known there as Pico De' Paperis).\n\nSimilar character\n\nIn an episode of Goof Troop, it was revealed that Goofy has an uncle named Ludwig Von Goof. Von Goof is also a scientist, whose appearance is almost identical to Von Drake, except for the fact that Ludwig Von Drake is a duck and Ludwig Von Goof is a dog.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ludwig Von Drake" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18625" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Professor Ludwig Von Drake is one of Walt Disney's cartoon and comic book characters. He was first introduced on September 24, 1961, as the presenter (and singer of \"The Spectrum Song\") in the cartoon An Adventure in Color, part of the first episode of Walt Disney's Wonderful World of Color on NBC. Said to be an uncle of Donald Duck. He is described as a scientist, lecturer, psychologist, and world traveler. The character displayed his \"expert\" knowledge on a variety of subjects in eighteen episodes of the classic anthology series, as well as on a number of Disneyland Records.\n\nPaul Frees was the original voice of Ludwig Von Drake. After Frees retired from the role, the character was briefly voiced by Walker Edmiston. Since 1987, he has been voiced by Corey Burton.\n\nCharacter\n\nLudwig Von Drake comes from Vienna, Austria and has a fascination with knowledge. Since his youth he has been trying to obtain as many diplomas, in any science, as possible. When he is consulted by other family members, it is a running gag that he almost invariably turns out to have a university degree relevant for whatever information they are seeking. He is often shown as having little social competence, however, and is often portrayed as being very forgetful, sometimes even somewhat senile. In the comics Ludwig usually visits with Donald Duck and Donald's nephews Huey, Dewey and Louie. On occasion, Daisy Duck would coax (or even trick) the professor into giving lectures and tours for her ladies' club. Sometimes Ludwig and Gyro Gearloose have competed as to who is the greater inventor. He can play the piano and acoustic guitar, as shown in a few television specials and more.\n\nIn the Wonderful World of Color episode Kids is Kids, Ludwig states that he is a bachelor.\n\nIn the comic strips by the famous duo of comic artists Bob Karp and Al Taliaferro, Donald and his nephews usually call him 'Uncle Ludwig', but in the comic stories he is generally called 'Ludwig' or 'Professor' by them. Daisy Duck refers to Ludwig as sort of an uncle of Donald in the first Sunday strip where his name is mentioned.[http://coa.inducks.org/story.php?cZD+61-09-24 Coa Inducks - Page for the Sunday strip ZD 61-09-24] In the story \"Duckburg, U.S.A.\", published in Ludwig Von Drake #1 (November 1961), Professor Ludwig Von Drake arrives in Duckburg by train, and it is shown that Donald Duck had never seen this Austrian relative before, not even in a picture. Grandma Duck, Uncle Scrooge McDuck, Daisy Duck, Gladstone Gander, Huey, Dewey and Louie, Gus Goose, and Gyro Gearloose also appear in this same story waiting to know Ludwig at the train station, and Grandma enthusiastically exclaims, \"Professor Ludwig Von Drake! Such a nice-sounding name!\".[http://coa.inducks.org/hr.php?normalsize\n1&imagehttp://outducks.org/webusers/webusers-char0/us_lvd_001_02_001_gd.jpg Coa Inducks - Excerpt of the comic story Duckburg, U.S.A.] According to an explanation created by Don Rosa's personal family tree, he would have to be married to Donald Duck's aunt, Matilda McDuck, making him Scrooge's brother-in-law. Nevertheless, Ludwig exclaims in the Christmas story \"The Cuckoo Clock Caper\" that he and Scrooge are \"joined in good fellowship\".[http://coa.inducks.org/hr.php?normalsize\n1&imagehttp://outducks.org/webusers/webusers-char0/us_cpgk_01_06_007_lvd.jpg Coa Inducks - Excerpt of the comic story The Cuckoo Clock Caper] Besides, he was shown as a member of the Absentminded Dating Club,[http://coa.inducks.org/hr.php?normalsize\n1&imagehttp://outducks.org/webusers/webusers-char0/us_zz1985h12d_001_alicefromyd.png Coa Inducks - Excerpt of the comic strip YD 85-07-12] being the suitor of another member of this same club in some old comic strips, a duck woman called Alice.[http://coa.inducks.org/character.php?c1\ndate&cAlice%20from%20YD&view\n4 Coa Inducks - Index to strips with Alice from YD] Therefore, Ludwig's marital status is officially unmarried.\n\nIn a theory based on an old American comic story called \"The Family Tree Spree\", Humperdink Duck's early life before marrying Elvira Coot could be nebulous enough to pin him and Ludwig as half-brothers, thus making Ludwig a granduncle to Donald. In this story, Donald scares of seeing Ludwig's specs on the floor and thinks about them as \"Uncle Ludwig's specs\".[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/au_gs_265c_004_dd.jpg Coa Inducks - Excerpt of the comic story The Family Tree Spree] In the end of this same story, it's revealed that Ludwig also appears in Donald's paternal family tree, wherein he and Donald both have an ancestor called Colombust Duck, who tried to prove the world was flat.[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_lvd_003_03_005_lvd.png Coa Inducks - Excerpt of the comic story The Family Tree Spree] So it's possible to conclude that Ludwig, whose Austrian father obviously owns the surname Von Drake, has an ancestor with the surname Duck because of his mother. In this case, Humperdink, who possibly was some years older than Ludwig, really could be regarded as half-brother on mother's side of Ludwig and both of their parents would be descendants from the failed geographer Colombust Duck.\n\nIn some old comic stories where Ludwig visits Grandma on her farm, it's clear that they have a close relationship, as shown in the story \"Message From Space\", where Grandma exclaims, \"You need rest, dear boy!\", after thinking he had a kind of nervous breakdown.[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_lvd_004_08_004_gd.png Coa Inducks - Excerpt of the comic story Message From Space] In \"Pigeon Panic\" Ludwig exclaims, \"Ho! You know you can depend on me!\", after Grandma warned him to be careful with her smartest homer.[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_us_0051_03_001_gd.jpg Coa Inducks - Excerpt of the comic story Pigeon Panic] There is an enlightening sequence of two panels in the story \"The Rural Eggs-pert\", where Ludwig is resting in an old chair of Grandma's house when an antique buyer asks Grandma to sell him \"this fine old specimen\" (the chair) and she answers, \"Well, it's been in the family for years, but I could do without it!\", making Ludwig astonished, since he thinks she's referring to him as if he was a livestock.[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_wdcd_34_10_007_lvd.jpg Coa Inducks - Excerpt of the comic story The Rural Eggs-Pert] He wouldn't have reacted this way if he wasn't her relative. In the last panel of the story \"Barn Dance Doctor\", Grandma refers to Ludwig as her \"cityfied cousin\".[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_gpsb_04_02_006_gd.jpg Coa Inducks - Excerpt of the comic story Barn Dance Doctor] Since it was stipulated by Don Rosa that her father was a Coot and her mother was a Gadwall, it's not clear if Ludwig Von Drake is related to Elvira Coot through her father or her mother. Elvira could have an Austrian ascendancy to explain her kinship to Ludwig.\n\nLudwig revealed in \"Blown Up Genius\" that he came from a long line of glass blowers.[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_wdc_267_04_002_lvd.png Coa Inducks - Excerpt of the comic story Blown Up Genius] In \"The Big Payoff\", it's revealed that he spent many months living in Donald's house since his arrival in Duckburg. Ludwig wins a TV chess challenge in this comic story, making Donald exclaim, \"Yippee! He did it! Now he can pay all he's owed us (he and his nephews) for these many months!\".[http://coa.inducks.org/hr.php?normalsize1&image\nhttp://outducks.org/webusers/webusers-char0/us_lvd_004_07_002_dd.png Coa Inducks - Excerpt of the comic story The Big Payoff] According to the story \"The Jewels of Skull Rock\",[http://coa.inducks.org/story.php?cW+DD++114-02 Coa Inducks - Page to the comic story The Jewels of Skull Rock] Ludwig spent six months in Donald's house.[http://coa.inducks.org/hr.php?normalsize\n1&image=http://outducks.org/webusers/webusers-char0/us_tc_0003b02_003_dd.png Coa Inducks - Excerpt of the comic story The Jewels of Skull Rock]\n\nThose ten stories mentioned above were drawn by Tony Strobl, who was the cartoonist responsible for introducing Professor Ludwig into American Disney comic books. Actually, Ludwig's first comic book appearance was in a not previously mentioned story by Strobl, \"The Scene Stealer\", first published in October, 1961. The events showed in this one presumably happened after the ones showed in \"Duckburg, U.S.A.\", which was published two months later.\n\nFilmography\n\nProfessor Ludwig Von Drake was introduced as a new character alongside Walt Disney himself in the very first episode of Walt Disney's Wonderful World of Color after the series was moved to NBC in the fall of 1961. He was designed, and frequently animated, by Milt Kahl and Ward Kimball, two of Disney's Nine Old Men of animators.\n\nWonderful World of Color appearances (1960s)\n*An Adventure in Color/Mathmagicland (24 September 1961) - This show introduced Walt Disney's new character and co-host Professor Ludwig Von Drake.\n*The Hunting Instinct (22 October 1961) - Von Drake sheds some light on the subject of why man hunts with his assistant Herman the Bootle Beetle. \n*Inside Donald Duck (5 November 1961) - Von Drake attempts to diagnose Donald Duck's problems, deciding the cause is romance.\n*Kids is Kids (10 December 1961) - Von Drake shares his knowledge on the subject of child psychology and how to handle Huey, Dewey and Louie.\n*Carnival Time (4 March 1962) - Von Drake takes a look at some major carnivals in New Orleans and Rio de Janeiro with Donald Duck and Jose Carioca.\n*Von Drake in Spain (8 April 1962) - Ludwig Von Drake lectures on the dances of Spain.\n*Man is His Own Worst Enemy (21 October 1962) - Von Drake explains why people are the biggest challenge facing humanity. This episode is sometimes titled Ducking Disaster with Donald and his Friends.\n*Three Tall Tales (6 January 1963) - Von Drake and his sidekick Herman tell three stories including \"Casey at the Bat\" and \"Paul Bunyan.\"\n*A Square Peg in a Round Hole (3 March 1963) - Von Drake has founded the Research Institute For Human Behavior.\n*Fly With Von Drake (13 October 1963) - Von Drake gives a historically accurate and funny lecture on the birth of manned flight.\n*The Truth About Mother Goose (17 November 1963) - Von Drake tells the stories behind Mother Goose rhymes. Including footage from Mickey and the Beanstalk. Von Drake narrates this story which was originally featured as a segment in the 1947 feature film Fun and Fancy Free, replacing the original narration; Herman makes a comeback in this episode.\n*In Shape with Von Drake (22 March 1964) - Von Drake returns to explain sports and fitness. He illustrates his points through the use of several Goofy cartoons.\n*Mediterranean Cruise (1964) - Von Drake takes a trip on a Cruise liner \n*A Rag, A Bone, A Box of Junk (1964) - Von Drake makes an cameo in this documentary about stop-motion animation\n*Music for Everybody (30 January 1966) - Von Drake hosts this look at the importance of music in people's lives.\n*Nature's Strangest Oddballs (30 January 1966) - Von Drake hosts this look at various animal species that have stayed\n\nTheatrical\n\n*A Symposium on Popular Songs (19 December 1962) - Von Drake demonstrates examples of popular music through the years.\n\nInside Donald Duck\n\nAmong his many interests is psychology, and he has tried to make a psychological study of his nephew Donald Duck. Ludwig was best fleshed out in this anthology cartoon, where Donald's psychology was examined, as we got to see some of his worst temper tantrums. Ludwig however was well understood by the end of the cartoon. His Austrian German ancestry betrayed itself in his language - for example \"as we say in the psychiatry\" is a very typical Germanism. In comics translated into German he sometimes speaks with an Austrian accent, like \"ein bisserl\" instead of \"ein bisschen\". He also enjoys several off color jokes, for instance \"What you have here is a depressed Duck! And there is nothing worse than depressed duck...unless you like depressed duck...but the taste is sometimes....\" making a pun off of the dish of pressed duck.\n\nCartoon appearances (1980s–present)\n\nVon Drake has appeared on several Disney animated cartoon series: DuckTales, Raw Toonage, Bonkers, Mickey Mouse Works, Quack Pack, Disney's House of Mouse, Mickey Mouse Clubhouse, Mickey Mouse, Mickey and the Roadster Racers and in numerous television specials. In all of these, Von Drake wears a pink shirt, black tie, red vest, and a lab coat.\n\nIn House of Mouse, Von Drake appears as a recurring character. In \"Ask Von Drake\", Mickey tries to prove that Ludwig Von Drake doesn't know everything. At the end, Mickey convinces him that during the headcount of all the Disney characters, he forgot himself. Also, in \"House of Genius\", Ludwig creates robot duplicates of Mickey, Minnie, Donald, Daisy, Goofy, and Pluto. At the end, when Ludwig brings in a robot duplicate of himself, Mickey tells the robot to send the real Ludwig packing.\n\nLudwig is due to appear as a recurring character in the DuckTales reboot.https://ohmy.disney.com/news/2017/06/14/disney-xds-new-ducktales-has-a-premiere-date-and-an-amazing-all-new-opening-title-sequence/\n\nLudwig Von Drake in the Sing-Along Songs series\n\nIn the Disney's Sing-Along Songs series of videos, he has hosted or co-hosted these six volumes:\n\n*You Can Fly (February 5, 1988)\n*Fun with Music (along with Professor Owl) (October 12, 1989)\n*Under the Sea (August 14, 1990)\n*I Love to Laugh (a.k.a. Supercalifragilisticexpialidocious) (December 28, 1990)\n*101 Notes of Fun (March 12, 1994)\n*Colors of the Wind (July 21, 1995)\n\nDisneyland Records discography\n\nIn 1961 Disneyland Records released the LP Professor Ludwig Von Drake. The LP had two songs from the character's debut in the An Adventure in Color episode (\"The Green With Envy Blues\" and \"The Spectrum Song\"), as well as new songs and comedy bits.\n\nThe track list for the \"Ludwig Von Drake\" LP:\n\n# I'm Ludwig Von Drake\n# The Spectrum Song\n# The Green With Envy Blues\n# It Gets You\n# Von Drake Variations on \"The Blue Danube\"\n# Professor Ludwig Von Drake Discourse: All About Sound Recording\n# An Operatic Version of a Theme from 'Cinderella'\n\nAs of February 2010, the digitally remastered LP can be downloaded exclusively at the iTunes Store.\n\nPrint appearances\n\nThe Disney studio encouraged the writers of Duck comics to introduce this new character in print, and already in September 1961, Von Drake started appearing in Al Taliaferro and Bob Karp's featured daily strips. However, aside from a solitary cameo appearance in a one-page story in Uncle Scrooge #54 (December 1964), the character was not used by leading Disney duck artist Carl Barks.\n\nIn 1961, Dell Comics launched a comic book series starring Von Drake and illustrated by Tony Strobl,[http://www.comicvine.com/comic/ludwig-von-drake/2037/&i21522&v\ng 'Ludwig Von Drake' comic book #1-#4 featuring Tony Strobl List]  but it only lasted for four issues before being discontinued. The character made subsequent appearances in other comic titles such as Walt Disney's Comics and Stories and in the Donald Duck newspaper strip.\n\nProfessor Ludwig has often been used by Italian cartoonists, including in some of the long sagas inspired by famous books that they usually produce with the Duck Family, such as \"La storia di Marco Polo detta Il Milione\" (free translation \"The Million - A Story of Marco Polo\") and \"Paperino in: Il mondo perduto\" (free translation \"Donald in: The Lost World\"). As a result, he has achieved a quite significant popularity in Italy (he's known there as Pico De' Paperis).\n\nSimilar character\n\nIn an episode of Goof Troop, it was revealed that Goofy has an uncle named Ludwig Von Goof. Von Goof is also a scientist, whose appearance is almost identical to Von Drake, except for the fact that Ludwig Von Drake is a duck and Ludwig Von Goof is a dog. Ludwig Von Drake. http://en.wikipedia.org/?curid=18625."
  }
}
