{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12230",
  "eid" : "01128f50-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778511045,
  "textBody" : "Gary Wayne Coleman (February 8, 1968 – May 28, 2010) was an American actor, best known for his role as Arnold Jackson in Diff'rent Strokes (1978–1986). He was described in the 1980s as \"one of television's most promising stars\". After a successful childhood acting career, Coleman struggled financially later in life. In 1989, he successfully sued his parents and business adviser over misappropriation of his assets, only to declare bankruptcy a decade later. On May 28, 2010, Coleman died of an epidural hematoma at age 42.\n\nEarly life and education\n\nGary Wayne Coleman was born in Zion, Illinois, outside Chicago, on February 8, 1968. He was adopted by W. G. Coleman, a fork-lift operator, and Edmonia Sue, a nurse practitioner.  Due to focal segmental glomerulosclerosis (a congenital chronic kidney disease), and the corticosteroids and other medications used to treat it, his growth was limited to 4 ft, and his face retained a childlike appearance well into adulthood. He underwent two unsuccessful kidney transplants in 1973 and 1984, and required frequent dialysis.\n\nCareer \n\nIn 1974, Coleman's career began when he appeared in a commercial for Harris Bank. His line (after the announcer said, \"You should have a Harris banker.\") was \"You should have a Hubert doll.\"[https://www.youtube.com/watch?vT_vQ98mLpdg Gary Coleman's first television commercial: Harris Bank (1974)] \"Hubert\" was a stuffed lion representing the Harris bank logo. The same year, he appeared in an episode of Medical Center.\n\nWhile best known for his role on Diff'rent Strokes, Coleman had appeared earlier on television, on The Jeffersons as Raymond, George Jefferson's nephew, and on Good Times as Penny's friend Gary. He also appeared in a 1977 pilot for a revival of The Little Rascals as Stymie.[http://www.cnn.com/2010/SHOWBIZ/TV/05/28/obit.gary.coleman/index.html?sectioncnn_latest Diff'rent Strokes actor Gary Coleman dies at 42.\"] CNN May 28, 2010 article added May 28, 2010. VH1 rated Coleman first on a list of \"100 Greatest Child Stars\" on television.\n\nDiff'rent Strokes \n\nColeman was cast in the role of Arnold Jackson in Diff'rent Strokes, portraying one of two black brothers from Harlem adopted by a wealthy white widower in Manhattan. The series was broadcast from 1978 to 1986.\n\nHe became the most popular fixture of the series, enhanced by his character's catchphrase \"What'chu talkin' 'bout, Willis?\". At the height of his fame on Diff'rent Strokes, he earned $100,000 per episode. A Biography Channel documentary estimated he was left with a quarter of the original amount after paying his parents, advisers, lawyers, and taxes. He later successfully sued his parents and his former advisers for misappropriation of his finances and was awarded $1.3 million. According to Todd Bridges' autobiography Killing Willis, Coleman was made to work long hours on the set of Diff'rent Strokes, despite his age and health problems and this contributed to his being unhappy and separating himself from the cast.\n\nLater character appearances \n\nColeman became a popular figure, starring in a number of feature films and television films, including The Kid from Left Field (1979), On the Right Track (1981) and The Kid with the Broken Halo (1982). The latter eventually served as the basis for The Gary Coleman Show in 1982. He also made video game appearances in The Curse of Monkey Island (1997) and Postal 2 (2003). In 2005, Coleman appeared in John Cena's music video for his single \"Bad, Bad Man\" (from the album You Can't See Me), Coleman played himself as a villain taking Michael Jackson and Madonna hostage. The video was a spoof of 80s culture, focusing on The A-Team.You Can't See Me\n\nCandidacy for Governor of California \n\nIn the 2003 California recall election, Coleman was a candidate for governor. This campaign was sponsored by the free newsweekly East Bay Express as a satirical comment on the recall. After Arnold Schwarzenegger declared his candidacy, Coleman announced that he would vote for Schwarzenegger. Coleman placed 8th in a field of 135 candidates, receiving 14,242 votes.\n\nAvenue Q \n\nColeman is parodied in Avenue Q, which won the 2004 Tony Award for Best Musical. A fictionalized version of Coleman works as the superintendent of the apartment complex where the musical takes place.  In the song \"It Sucks to Be Me\", he laments his fate.Horowitz, Lisa.  On Broadway, the role was originated by Natalie Venetia Belcon.\n\nThe show's creators, Jeff Marx and Robert Lopez, have said the Coleman character personifies one of Avenue Qs central themes: that as children we are told we are \"special\", but upon entering adulthood we discover that life is not nearly as easy as we have been led to believe. They added that their original intent was for Coleman himself to play the Gary Coleman role, and he expressed interest in accepting it but never showed up for a meeting scheduled to discuss it.\n\nIn 2005, Coleman announced his intention to sue the producers of Avenue Q for their depiction of him, although the lawsuit never materialized. At the 2007 New York Comic Con, Coleman said, \"I wish there was a lawyer on Earth that would sue them for me.\"\n\nPersonal life \n\nIn a 1993 television interview, Coleman said he had twice attempted suicide by overdosing on pills. Around the same time he was living in Denver, Colorado, where he hosted a Sunday night show on local radio station KHIH titled Gary Coleman's Colorado High, in which he played light jazz and new-age music. He gave part of his salary to the Colorado Kidney Foundation.\n\nIn 2005, Coleman moved from Los Angeles to Santaquin, a small town about 50 miles (80 km) south of Salt Lake City, Utah, where he lived for the remainder of his life.\n\nIn early 2007 he met Shannon Price, 22, on the set of the film Church Ball, where she was working as an extra. Price and Coleman married several months later.  On May 1 and 2, 2008, they made a well-publicized appearance on the show Divorce Court to air their differences in an attempt to save their marriage. Nevertheless, they divorced in August 2008, citing irreconcilable differences and Coleman was granted an ex parte restraining order against Price to prevent her from living in his home when he was hospitalized after their divorce. According to a court petition later filed by Price, she and Coleman continued to live together in a common-law marriage until his death. However, a judge ultimately ruled against Price after hearing evidence that she carried on affairs with other men during the time she claimed to be with Coleman, and \"physically abused Coleman in public, led him around by the hand like a child [and] displayed no physical affection toward him in front of anyone.\"\n\nFinancial struggles \n\nIn August 1999, Coleman filed for bankruptcy protection. Multiple people, he said, were responsible for his insolvency, \"... from me, to accountants, to my adoptive parents, to agents, to lawyers, and back to me again.\"\n\nOngoing medical expenses contributed significantly to Coleman's chronic financial problems and compelled him, at times, to resort to unusual fundraising activities. In 2008, for example, he auctioned an autographed pair of his pants on eBay to help pay his medical bills. The auction attracted considerable attention, including fake bids up to $400,000. The pants were eventually bought for $500 by comedian Jimmy Kimmel, who hung them from the rafters of his television studio.\n\nLegal troubles \n\nIn 1989, Coleman sued his adoptive parents and former business advisor for $3.8 million, for misappropriating his trust fund, and won a $1,280,000 judgment in 1993.\n\nIn 1998, Coleman was charged with assault while he was working as a security guard. Tracy Fields, a Los Angeles bus driver and fan of Coleman's work on Diff'rent Strokes, approached him in a California mall and requested his autograph, while Coleman was shopping for a bulletproof vest. Coleman refused to give her an autograph, an argument ensued, and Fields reportedly mocked Coleman's lackluster career as an actor. Coleman then punched Fields in the face several times in front of witnesses. He was arrested and later testified in court that she threatened him, and he defended himself. \"She wouldn't leave me alone. I was getting scared, and she was getting ugly,\" he said. Coleman pleaded no contest to one count of assault, received a suspended jail sentence, and was ordered to pay Fields' $1,665 hospital bill, as well as take anger management classes.\n\nIn 2007, Coleman was cited for misdemeanor disorderly conduct in Provo, Utah, after a \"heated discussion\" in public with his wife.\n\nIn 2008, Coleman was involved in a car accident after an altercation at a Payson, Utah bowling alley, which began when Colt Rushton, age 24, photographed Coleman without his permission. The two men argued, according to witnesses. In the parking lot, Coleman allegedly backed his truck into Rushton, striking his knee and pulling him under the vehicle, before hitting another car. Rushton was treated at a local hospital for minor injuries and released. Coleman later pleaded no contest to charges of disorderly conduct and reckless driving, and was fined $100. In 2010, he settled a civil suit related to the incident for an undisclosed amount.\n\nIn 2009, Coleman and his ex-wife were involved in a domestic dispute, after which Price was arrested on suspicion of domestic violence, and both parties were cited for disorderly conduct.\n\nIn January 2010, months before his death, Coleman was arrested on an outstanding domestic assault warrant in Santaquin, booked into the Utah County Jail, and released the following day.\n\nTrains and model railroading \n\nColeman was an avid railfan, model railroader, and supporter of Amtrak. He became interested in trains sometime before the age of 5 during his frequent train trips to Chicago, in support of his burgeoning acting career. Fans often saw him at stores specializing in model trains in areas in which he lived, and he worked part-time at Denver-area, Tucson-area, and California hobby stores to be around his hobby.\n\nColeman built and maintained miniature railroads in his homes in several states. One of his train layouts appears in the September 1990 issue of Railroad Model Craftsman. Coleman is photographed on the front cover, with his \"Rio Grande\" layout.\n\nHe preferred to model in HO scale, but modeled in other scales, as well. One such model railroad was over 800 square feet (75 m²) in size. Currently, at least one of Coleman's model railroads is being preserved in Colorado Springs, Colorado.\n\nDeath and memorial \n\nVery few details of Coleman's medical history have been made public. His short stature (4 feet, 8 inches or 142 centimeters) stemmed from congenital kidney disease and its treatment. He underwent at least two unsuccessful kidney transplants early in his life and required frequent dialysis, which he preferred not to discuss. In 2009, Coleman underwent heart surgery, details of which were never made public, but he is known to have developed pneumonia postoperatively. In January 2010, Coleman was hospitalized after a seizure in Los Angeles, and in February he suffered another seizure on the set of The Insider television program.\n\nOn May 26, 2010, Coleman was admitted to Utah Valley Regional Medical Center in Provo, Utah, in critical condition after falling down the stairs at his home in Santaquin and hitting his head, possibly after another seizure, and suffering an epidural hematoma. According to a hospital spokesman, Coleman was conscious and lucid the next morning, but his condition subsequently worsened. By mid-afternoon on May 27, he was unconscious and on life support. He died at 12:05 pm MDT (18:05 UTC) on May 28, at the age of 42.\n\nThe casts of the Off Broadway production of Avenue Q in New York City and the Avenue Q National Tour in Dallas dedicated their May 28 performances to his memory, and the actors playing the part of Coleman paid tribute to him from the stage at the performances' conclusions. (The Coleman character remained in the show after modifications were made to relevant dialogue.)\n\nThe weekend after Coleman's death, a scheduled funeral was postponed and later canceled due to a dispute regarding the disposition of his estate and remains among Coleman's adoptive parents, former business associate Anna Gray, and Price. Coleman's former manager, Dion Mial, was involved initially, but withdrew after Coleman's 1999 will, which named Mial as executor and directed that his wake be \"...conducted by those with no financial ties to me and can look each other in the eyes and say they really cared personally for Gary Colemen \", turned out to be superseded by a later one replacing Mial with Gray, and directing \"...that there be no funeral service, wake, or other ceremony memorializing my passing.\"\n\nQuestions were also raised as to whether Price, who approved discontinuing Coleman's life support, was legally authorized to do so. The controversy was exacerbated by a photograph published on the front page of the tabloid newspaper The Globe depicting Price posed next to a comatose, intubated Coleman, under the headline, \"It Was Murder!\"\n\nThe hospital later issued a statement confirming that Coleman had completed an advance health care directive granting Price permission to make medical decisions on his behalf. An investigation by Santaquin police was closed on October 5, 2010, after the medical examiner ruled Coleman's death accidental, and no evidence of wrongdoing could be demonstrated.\n\nIn June, Coleman's remains were cremated, in accordance with his wishes, after a Utah judge agreed that there was no dispute regarding that issue; but disposition of the ashes was delayed pending a judicial decision on permanent control of the estate.  While Coleman's final will, signed in 2005, named Gray as executor and awarded his entire estate to her, Coleman and Price married in 2007.  Although they divorced in 2008, Price claimed in a court petition that she remained Coleman's common-law wife, sharing bank accounts  and the couple presented themselves publicly as husband and wife until Coleman's death, an assertion that, if validated by the court, would make her the lawful heir.\n\nIn May 2012, Judge James Taylor ruled that while Price had indeed lived in Coleman's home after their marriage ended, their relationship at the time of his death failed to meet Utah's standard for a common-law marriage. The disposition of his ashes remains unreported.  Price said, were she granted disposition, she would scatter the ashes at the Golden Spike National Historic Site in Utah as a tribute to Coleman's lifelong love of trains.\n\nFilmography \n\nFilm \n\nTelevision \n\nVideo games \n\nColeman portrayed a fictional version of himself in Postal 2, providing the voice and motion capture. He also portrayed Kenny Falmouth in The Curse of Monkey Island.\n\nMusic videos \n\n* John Cena – \"Bad, Bad Man\" as himself\n* 'N Sync – \"Merry Christmas, Happy Holidays\" as Santa's elf\n* Kid Rock - \"Cowboy\" as himself\n* Moby - \"We Are All Made of Stars\" as himself\n* Raging Slab - \"Anywhere But Here\" as himself\n* Slum Village - \"Climax\" as himself",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Gary Coleman" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12230" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Gary Wayne Coleman (February 8, 1968 – May 28, 2010) was an American actor, best known for his role as Arnold Jackson in Diff'rent Strokes (1978–1986). He was described in the 1980s as \"one of television's most promising stars\". After a successful childhood acting career, Coleman struggled financially later in life. In 1989, he successfully sued his parents and business adviser over misappropriation of his assets, only to declare bankruptcy a decade later. On May 28, 2010, Coleman died of an epidural hematoma at age 42.\n\nEarly life and education\n\nGary Wayne Coleman was born in Zion, Illinois, outside Chicago, on February 8, 1968. He was adopted by W. G. Coleman, a fork-lift operator, and Edmonia Sue, a nurse practitioner.  Due to focal segmental glomerulosclerosis (a congenital chronic kidney disease), and the corticosteroids and other medications used to treat it, his growth was limited to 4 ft, and his face retained a childlike appearance well into adulthood. He underwent two unsuccessful kidney transplants in 1973 and 1984, and required frequent dialysis.\n\nCareer \n\nIn 1974, Coleman's career began when he appeared in a commercial for Harris Bank. His line (after the announcer said, \"You should have a Harris banker.\") was \"You should have a Hubert doll.\"[https://www.youtube.com/watch?vT_vQ98mLpdg Gary Coleman's first television commercial: Harris Bank (1974)] \"Hubert\" was a stuffed lion representing the Harris bank logo. The same year, he appeared in an episode of Medical Center.\n\nWhile best known for his role on Diff'rent Strokes, Coleman had appeared earlier on television, on The Jeffersons as Raymond, George Jefferson's nephew, and on Good Times as Penny's friend Gary. He also appeared in a 1977 pilot for a revival of The Little Rascals as Stymie.[http://www.cnn.com/2010/SHOWBIZ/TV/05/28/obit.gary.coleman/index.html?sectioncnn_latest Diff'rent Strokes actor Gary Coleman dies at 42.\"] CNN May 28, 2010 article added May 28, 2010. VH1 rated Coleman first on a list of \"100 Greatest Child Stars\" on television.\n\nDiff'rent Strokes \n\nColeman was cast in the role of Arnold Jackson in Diff'rent Strokes, portraying one of two black brothers from Harlem adopted by a wealthy white widower in Manhattan. The series was broadcast from 1978 to 1986.\n\nHe became the most popular fixture of the series, enhanced by his character's catchphrase \"What'chu talkin' 'bout, Willis?\". At the height of his fame on Diff'rent Strokes, he earned $100,000 per episode. A Biography Channel documentary estimated he was left with a quarter of the original amount after paying his parents, advisers, lawyers, and taxes. He later successfully sued his parents and his former advisers for misappropriation of his finances and was awarded $1.3 million. According to Todd Bridges' autobiography Killing Willis, Coleman was made to work long hours on the set of Diff'rent Strokes, despite his age and health problems and this contributed to his being unhappy and separating himself from the cast.\n\nLater character appearances \n\nColeman became a popular figure, starring in a number of feature films and television films, including The Kid from Left Field (1979), On the Right Track (1981) and The Kid with the Broken Halo (1982). The latter eventually served as the basis for The Gary Coleman Show in 1982. He also made video game appearances in The Curse of Monkey Island (1997) and Postal 2 (2003). In 2005, Coleman appeared in John Cena's music video for his single \"Bad, Bad Man\" (from the album You Can't See Me), Coleman played himself as a villain taking Michael Jackson and Madonna hostage. The video was a spoof of 80s culture, focusing on The A-Team.You Can't See Me\n\nCandidacy for Governor of California \n\nIn the 2003 California recall election, Coleman was a candidate for governor. This campaign was sponsored by the free newsweekly East Bay Express as a satirical comment on the recall. After Arnold Schwarzenegger declared his candidacy, Coleman announced that he would vote for Schwarzenegger. Coleman placed 8th in a field of 135 candidates, receiving 14,242 votes.\n\nAvenue Q \n\nColeman is parodied in Avenue Q, which won the 2004 Tony Award for Best Musical. A fictionalized version of Coleman works as the superintendent of the apartment complex where the musical takes place.  In the song \"It Sucks to Be Me\", he laments his fate.Horowitz, Lisa.  On Broadway, the role was originated by Natalie Venetia Belcon.\n\nThe show's creators, Jeff Marx and Robert Lopez, have said the Coleman character personifies one of Avenue Qs central themes: that as children we are told we are \"special\", but upon entering adulthood we discover that life is not nearly as easy as we have been led to believe. They added that their original intent was for Coleman himself to play the Gary Coleman role, and he expressed interest in accepting it but never showed up for a meeting scheduled to discuss it.\n\nIn 2005, Coleman announced his intention to sue the producers of Avenue Q for their depiction of him, although the lawsuit never materialized. At the 2007 New York Comic Con, Coleman said, \"I wish there was a lawyer on Earth that would sue them for me.\"\n\nPersonal life \n\nIn a 1993 television interview, Coleman said he had twice attempted suicide by overdosing on pills. Around the same time he was living in Denver, Colorado, where he hosted a Sunday night show on local radio station KHIH titled Gary Coleman's Colorado High, in which he played light jazz and new-age music. He gave part of his salary to the Colorado Kidney Foundation.\n\nIn 2005, Coleman moved from Los Angeles to Santaquin, a small town about 50 miles (80 km) south of Salt Lake City, Utah, where he lived for the remainder of his life.\n\nIn early 2007 he met Shannon Price, 22, on the set of the film Church Ball, where she was working as an extra. Price and Coleman married several months later.  On May 1 and 2, 2008, they made a well-publicized appearance on the show Divorce Court to air their differences in an attempt to save their marriage. Nevertheless, they divorced in August 2008, citing irreconcilable differences and Coleman was granted an ex parte restraining order against Price to prevent her from living in his home when he was hospitalized after their divorce. According to a court petition later filed by Price, she and Coleman continued to live together in a common-law marriage until his death. However, a judge ultimately ruled against Price after hearing evidence that she carried on affairs with other men during the time she claimed to be with Coleman, and \"physically abused Coleman in public, led him around by the hand like a child [and] displayed no physical affection toward him in front of anyone.\"\n\nFinancial struggles \n\nIn August 1999, Coleman filed for bankruptcy protection. Multiple people, he said, were responsible for his insolvency, \"... from me, to accountants, to my adoptive parents, to agents, to lawyers, and back to me again.\"\n\nOngoing medical expenses contributed significantly to Coleman's chronic financial problems and compelled him, at times, to resort to unusual fundraising activities. In 2008, for example, he auctioned an autographed pair of his pants on eBay to help pay his medical bills. The auction attracted considerable attention, including fake bids up to $400,000. The pants were eventually bought for $500 by comedian Jimmy Kimmel, who hung them from the rafters of his television studio.\n\nLegal troubles \n\nIn 1989, Coleman sued his adoptive parents and former business advisor for $3.8 million, for misappropriating his trust fund, and won a $1,280,000 judgment in 1993.\n\nIn 1998, Coleman was charged with assault while he was working as a security guard. Tracy Fields, a Los Angeles bus driver and fan of Coleman's work on Diff'rent Strokes, approached him in a California mall and requested his autograph, while Coleman was shopping for a bulletproof vest. Coleman refused to give her an autograph, an argument ensued, and Fields reportedly mocked Coleman's lackluster career as an actor. Coleman then punched Fields in the face several times in front of witnesses. He was arrested and later testified in court that she threatened him, and he defended himself. \"She wouldn't leave me alone. I was getting scared, and she was getting ugly,\" he said. Coleman pleaded no contest to one count of assault, received a suspended jail sentence, and was ordered to pay Fields' $1,665 hospital bill, as well as take anger management classes.\n\nIn 2007, Coleman was cited for misdemeanor disorderly conduct in Provo, Utah, after a \"heated discussion\" in public with his wife.\n\nIn 2008, Coleman was involved in a car accident after an altercation at a Payson, Utah bowling alley, which began when Colt Rushton, age 24, photographed Coleman without his permission. The two men argued, according to witnesses. In the parking lot, Coleman allegedly backed his truck into Rushton, striking his knee and pulling him under the vehicle, before hitting another car. Rushton was treated at a local hospital for minor injuries and released. Coleman later pleaded no contest to charges of disorderly conduct and reckless driving, and was fined $100. In 2010, he settled a civil suit related to the incident for an undisclosed amount.\n\nIn 2009, Coleman and his ex-wife were involved in a domestic dispute, after which Price was arrested on suspicion of domestic violence, and both parties were cited for disorderly conduct.\n\nIn January 2010, months before his death, Coleman was arrested on an outstanding domestic assault warrant in Santaquin, booked into the Utah County Jail, and released the following day.\n\nTrains and model railroading \n\nColeman was an avid railfan, model railroader, and supporter of Amtrak. He became interested in trains sometime before the age of 5 during his frequent train trips to Chicago, in support of his burgeoning acting career. Fans often saw him at stores specializing in model trains in areas in which he lived, and he worked part-time at Denver-area, Tucson-area, and California hobby stores to be around his hobby.\n\nColeman built and maintained miniature railroads in his homes in several states. One of his train layouts appears in the September 1990 issue of Railroad Model Craftsman. Coleman is photographed on the front cover, with his \"Rio Grande\" layout.\n\nHe preferred to model in HO scale, but modeled in other scales, as well. One such model railroad was over 800 square feet (75 m²) in size. Currently, at least one of Coleman's model railroads is being preserved in Colorado Springs, Colorado.\n\nDeath and memorial \n\nVery few details of Coleman's medical history have been made public. His short stature (4 feet, 8 inches or 142 centimeters) stemmed from congenital kidney disease and its treatment. He underwent at least two unsuccessful kidney transplants early in his life and required frequent dialysis, which he preferred not to discuss. In 2009, Coleman underwent heart surgery, details of which were never made public, but he is known to have developed pneumonia postoperatively. In January 2010, Coleman was hospitalized after a seizure in Los Angeles, and in February he suffered another seizure on the set of The Insider television program.\n\nOn May 26, 2010, Coleman was admitted to Utah Valley Regional Medical Center in Provo, Utah, in critical condition after falling down the stairs at his home in Santaquin and hitting his head, possibly after another seizure, and suffering an epidural hematoma. According to a hospital spokesman, Coleman was conscious and lucid the next morning, but his condition subsequently worsened. By mid-afternoon on May 27, he was unconscious and on life support. He died at 12:05 pm MDT (18:05 UTC) on May 28, at the age of 42.\n\nThe casts of the Off Broadway production of Avenue Q in New York City and the Avenue Q National Tour in Dallas dedicated their May 28 performances to his memory, and the actors playing the part of Coleman paid tribute to him from the stage at the performances' conclusions. (The Coleman character remained in the show after modifications were made to relevant dialogue.)\n\nThe weekend after Coleman's death, a scheduled funeral was postponed and later canceled due to a dispute regarding the disposition of his estate and remains among Coleman's adoptive parents, former business associate Anna Gray, and Price. Coleman's former manager, Dion Mial, was involved initially, but withdrew after Coleman's 1999 will, which named Mial as executor and directed that his wake be \"...conducted by those with no financial ties to me and can look each other in the eyes and say they really cared personally for Gary Colemen \", turned out to be superseded by a later one replacing Mial with Gray, and directing \"...that there be no funeral service, wake, or other ceremony memorializing my passing.\"\n\nQuestions were also raised as to whether Price, who approved discontinuing Coleman's life support, was legally authorized to do so. The controversy was exacerbated by a photograph published on the front page of the tabloid newspaper The Globe depicting Price posed next to a comatose, intubated Coleman, under the headline, \"It Was Murder!\"\n\nThe hospital later issued a statement confirming that Coleman had completed an advance health care directive granting Price permission to make medical decisions on his behalf. An investigation by Santaquin police was closed on October 5, 2010, after the medical examiner ruled Coleman's death accidental, and no evidence of wrongdoing could be demonstrated.\n\nIn June, Coleman's remains were cremated, in accordance with his wishes, after a Utah judge agreed that there was no dispute regarding that issue; but disposition of the ashes was delayed pending a judicial decision on permanent control of the estate.  While Coleman's final will, signed in 2005, named Gray as executor and awarded his entire estate to her, Coleman and Price married in 2007.  Although they divorced in 2008, Price claimed in a court petition that she remained Coleman's common-law wife, sharing bank accounts  and the couple presented themselves publicly as husband and wife until Coleman's death, an assertion that, if validated by the court, would make her the lawful heir.\n\nIn May 2012, Judge James Taylor ruled that while Price had indeed lived in Coleman's home after their marriage ended, their relationship at the time of his death failed to meet Utah's standard for a common-law marriage. The disposition of his ashes remains unreported.  Price said, were she granted disposition, she would scatter the ashes at the Golden Spike National Historic Site in Utah as a tribute to Coleman's lifelong love of trains.\n\nFilmography \n\nFilm \n\nTelevision \n\nVideo games \n\nColeman portrayed a fictional version of himself in Postal 2, providing the voice and motion capture. He also portrayed Kenny Falmouth in The Curse of Monkey Island.\n\nMusic videos \n\n* John Cena – \"Bad, Bad Man\" as himself\n* 'N Sync – \"Merry Christmas, Happy Holidays\" as Santa's elf\n* Kid Rock - \"Cowboy\" as himself\n* Moby - \"We Are All Made of Stars\" as himself\n* Raging Slab - \"Anywhere But Here\" as himself\n* Slum Village - \"Climax\" as himself. Gary Coleman. http://en.wikipedia.org/?curid=12230."
  }
}
