{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13404",
  "eid" : "08faf180-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778524312,
  "textBody" : "Hong Kong (,), officially the Hong Kong Special Administrative Region of the People's Republic of China, is an autonomous territory on the eastern side of the Pearl River estuary in East Asia, south of the mainland Chinese province of Guangdong, and east of the special administrative region of Macau. With over 7.3 million Hongkongers of various nationalities in a territory of 1,104 km2, Hong Kong is the fourth-most densely populated region in the world.\n\nHong Kong was formerly a colony of the British Empire, after the perpetual cession of Hong Kong Island from Qing China at the conclusion of the First Opium War in 1842. The colony expanded to the Kowloon Peninsula in 1860 after the Second Opium War, and was further extended when Britain acquired a 99-year lease of the New Territories starting in 1898. The Empire of Japan attacked the city as part of a greater offensive against the Allied Powers at the start of the Pacific War and held it under military occupation for the duration of the war, until the British resumed control of the colony in 1945. The entire territory, including ceded areas, was returned to China under the framework of the Sino-British Joint Declaration, signed by the United Kingdom and China in 1984 and marked with the transfer of sovereignty over Hong Kong at the end of the New Territories lease in 1997, when it became a special administrative region of the People's Republic of China.\n\nUnder the principle of \"one country, two systems\", Hong Kong maintains a separate political and economic system apart from China. Except in military defence and foreign affairs, Hong Kong retains independent executive, legislative, and judiciary powers. Nevertheless, the territory does directly develop relations with foreign states and international organizations in a broad range of \"appropriate fields\", being actively and independently involved in institutions such as the Asia-Pacific Economic Cooperation forum and the World Trade Organization.\n\nHong Kong is one of the most significant global financial centres, holding the highest Financial Development Index score and consistently ranking as the most competitive and freest economic area in the world. As the world's seventh-largest trading entity, its legal tender, the Hong Kong dollar, is the 13th-most traded currency. Hong Kong's tertiary sector dominated economy is characterised by competitive simple taxation and supported by its independent judiciary system. Although the city boasts one of the highest per capita incomes in the world, it suffers from severe income inequality.\n\nThe territory features the most skyscrapers in the world, surrounding Victoria Harbour, which lies in the centre of the city's dense urban region. It has a very high Human Development Index ranking and the world's longest life expectancy. Over 90% of its population makes use of well-developed public transportation. Along with Macau, Guangzhou, Shenzhen, Zhuhai, and several other major cities in Guangdong, Hong Kong forms a core part of the Pearl River Delta metropolitan region, one of the most populated areas in the world. Seasonal air pollution originating from neighbouring industrial areas of mainland China, which adopts loose emissions standards, has resulted in a high level of atmospheric particulates in winter.\n\nEtymology \n\nThe name Hong Kong originally referred to a small inlet between Aberdeen Island and the southern coast of Hong Kong Island. The town of Aberdeen was an initial point of contact between British sailors and local fishermen. The source of the romanised name is not known, but it is generally believed to be an early imprecise phonetic rendering of the spoken Cantonese pronunciation of  (), which means \"Fragrant Harbour\" or \"Incense Harbour\". Fragrance may refer to the sweet taste of the harbour's fresh water influx from the Pearl River estuary or to the incense from factories lining the coast of northern Kowloon. The incense was stored near Aberdeen Harbour for export before Victoria Harbour was developed. Another theory is that the name originates from the Tanka, early inhabitants of the region; it is equally probable that a romanisation of the name in their dialect was used (i.e. hōng, not hēung in Cantonese). Regardless of origin, the name was recorded in the Treaty of Nanking to encompass all of Hong Kong Island, and has been used to refer to the territory in its entirety ever since.\n\nThe name had often been written as the single word Hongkong until the government adopted the current form in 1926. Nevertheless, a number of institutions founded during the early colonial era still retain the single-word form, such as the Hongkong Post, Hongkong Electric, and the Hongkong and Shanghai Banking Corporation.\n\nHistory \n\nPrehistory \n\nArchaeological studies support human presence in the Chek Lap Kok area from 35,000 to 39,000 years ago and on Sai Kung Peninsula from 6,000 years ago. Wong Tei Tung and Three Fathoms Cove are the earliest sites of human habitation in Hong Kong during the Paleolithic Period. It is believed that the Three Fathom Cove was a river-valley settlement and Wong Tei Tung was a lithic manufacturing site. Excavated Neolithic artefacts suggested cultural differences from the Longshan culture of northern China and settlement by the Che people, prior to the migration of the Baiyue to Hong Kong. Eight petroglyphs dated to the Shang Dynasty were discovered on the surrounding islands.\n\nImperial China \n\nIn 214 BC, the Qin dynasty conquered the Baiyue tribes in Jiaozhi (modern-day Liangguang region and Vietnam) and incorporated the area of Hong Kong into China for the first time. After a brief period of centralisation and subsequent collapse of the Qin dynasty, the area of Hong Kong was consolidated under the Nanyue kingdom, founded by general Zhao Tuo in 204 BC. After the Han conquered Nanyue in 111 BC, Hong Kong was assigned to the Jiaozhi commandery. Archaeological evidence indicates an increase of population and expansion of salt production. The Lei Cheng Uk Han Tomb on the Kowloon Peninsula is believed to have been built as a burial site during the Han dynasty.\n\nDuring the Tang dynasty, the Guangdong region flourished as an international trading centre. A military stronghold was established in Tuen Mun to strengthen defence of the coastal area. Lantau Island was a salt production centre and smuggler riots occasionally broke out against the government. The first village school, Li Ying College, was established around 1075 in the modern-day New Territories by the Song dynasty. During their war against the Mongols, the Southern Song court was briefly stationed at modern-day Kowloon City (the Sung Wong Toi site) before their ultimate defeat at the Battle of Yamen in 1279.\n\nThe earliest European visitor on record was Jorge Álvares, a Portuguese explorer, who arrived in 1513. Having established a settlement in a site they called \"Tamão\" in Hong Kong waters, Portuguese merchants began regularly trading in southern China. However, subsequent military clashes between China and Portugal led to the expulsion of all Portuguese merchants in the 1520s. The Portuguese were able to reestablish trade relations by 1549 with annual trade missions sent to Shangchuan Island and acquired a land lease from Ming authorities in 1557 to establish a permanent trade outpost at Macau.\n\nAfter the Qing conquest, Hong Kong was directly affected by the Great Clearance, an imperial decree that ordered the evacuation of coastal areas of Guangdong from 1661 to 1669 as part of the new dynasty's efforts against Ming loyalist rebels in southern China. Over 16,000 inhabitants of Xin'an County, which included Hong Kong, were forced to migrate inland; only 1,648 of those who had evacuated returned in subsequent years.\nWith frequent pirate attacks and ever increasing incursions by European explorers, forts were constructed at Tung Chung and the Kowloon Walled City to guard the region.\n\nThough maritime trade had previously been banned, after repopulation of the coast and final defeat of all rebels with Ming sympathies, the Kangxi Emperor lifted the trade prohibition in 1684 and allowed foreigners to enter Chinese ports. Trade with Europeans was more strictly regulated and became concentrated in the Pearl River Delta after establishment of the Canton System in 1757, which forbade non-Russian ships from northern Chinese ports and forced all commerce to be conducted solely in the port of Canton, just north of Hong Kong. While European demand for Chinese commodities like tea, silk, and porcelain was high, Chinese interest in European manufactured goods was comparatively negligible, creating a large trade imbalance between Qing China and Great Britain. To counter this deficit, the British began to sell increasingly large volumes of Indian opium to China. Faced with a drug addiction crisis, Chinese officials pursued ever more aggressive actions in an attempt to halt the opium trade.\n\nBritish colony \n\nIn 1839, the Daoguang Emperor, having rejected proposals to legalise and tax opium, tasked Imperial Commissioner Lin Zexu with eradicating the opium trade. Lin ordered the confiscation and destruction of all opium stockpiles in Canton and a general blockade of foreign trade. The British objected to the sudden seizure, especially without monetary compensation for the seized product, and dispatched an expeditionary force to China, starting the First Opium War. After British victory in the Second Battle of Chuenpi, the Qing initially admitted defeat. As part of a ceasefire agreement between Captain Charles Elliot and Qishan, Viceroy of Liangguang, Hong Kong Island was declared to be ceded under the Convention of Chuenpi. British forces took formal possession of the island on 26 January 1841. However, disputes between high-ranking officials of both countries led to the failure of the treaty's ratification. After more than another year of further hostilities, Hong Kong Island was formally ceded in perpetuity to the United Kingdom under the terms of the Treaty of Nanking on 29 August 1842. The British officially established a Crown colony and founded the City of Victoria in the following year.\n\nThe population of Hong Kong Island was 7,450 when the Union Jack was raised over Possession Point on 26 January 1841. It mostly consisted of Tanka fishermen and Hakka charcoal burners, whose settlements scattered along several coastal hamlets. In the 1850s, a large number of Chinese refugees crossed the open border fleeing from the Taiping Rebellion. Other natural disasters, such as flooding, typhoons, and famine in mainland China would play a role in establishing Hong Kong as a place for safe shelter.John Thomson 1837–1921,[http://irc.aa.tufs.ac.jp/thomson/vol_1/mother/102.html Chap on Hong Kong], Illustrations of China and Its People (London,1873–1874)Info Gov HK. \"[http://www.info.gov.hk/police/hkp-text/english/history/history_01.htm Hong Kong Gov Info] .\" History of Hong Kong. Retrieved on 16 February 2007. Further conflicts over the opium trade between the British and Qing quickly escalated into the Second Opium War. Following the Anglo-French victory, the colony was expanded to include Kowloon Peninsula south of present-day Boundary Street and Stonecutter's Island, both of which were ceded to the British in perpetuity under the Convention of Beijing in 1860. The colony was expanded further in 1898, when Britain obtained a 99-year lease of additional territory from the Qing under the Convention for the Extension of Hong Kong Territory; Lantau Island, the remainder of Kowloon north of Boundary Street, further territory beyond Kowloon up to the Sham Chun River, and over 200 other outlying islands were given over to British control.\n\nHong Kong soon became a major entrepôt thanks to its free port status, attracting new immigrants from both China and Europe. However, the population remained racially divided and polarised under early British colonial policies. Despite the rise of a British-educated Chinese upper class by the late 19th century, zoning laws prevented ethnic Chinese from acquiring property in reserved areas. Though enacted ostensibly to address health concerns of European residents, the Peak Reservation Ordinance and other similar pieces of legislation enforced a system of residential zoning that racially segregated the population of the colony, creating exclusive communities of Europeans in areas like Victoria Peak and Cheung Chau. At this time, the majority of the Chinese population in Hong Kong had no political representation in the British colonial government. The British governors did rely, however, on a small number of Chinese elites, including Sir Kai Ho and Robert Hotung, who served as ambassadors and mediators between the government and local population. Chinese appointments to the Legislative Council and Executive Council were not made until 1880 and 1926, with Wu Tingfang and Shouson Chow serving as the first members of the colony's ethnic majority on the respective chambers.\n\nThe colony continued to experience modest growth during the first half of the 20th century. The University of Hong Kong was established in 1911 as the territory's first higher education institute. During the First World War, many Chinese residents left the city, fearing a German attack on the colony. Hong Kong ultimately remained unscathed and continued growing; its population increased from 530,000 in 1916 to 725,000 in 1925 and reached 1.6 million by 1941. Kai Tak Airport entered operation in 1925 and the colony was able to avoid a prolonged economic downturn after the Canton–Hong Kong strike ended, which had last for more than a year from 1925 through 1926.. At the outbreak of the Second Sino-Japanese War in 1937, when the Empire of Japan invaded China from its protectorate in Manchuria, Governor Geoffry Northcote declared the colony a neutral zone to safeguard Hong Kong's status as a free port.\n\nJapanese military occupation \n\nOn 8 December 1941, the same morning as the attack on Pearl Harbor, the Imperial Japanese Army moved south from Guangzhou and crossed the Sham Chun River to attack Hong Kong as part of a coordinated military offensive against the Allied Powers. The Battle of Hong Kong lasted for 17 days, through which British, Canadian, Indian, and local colonial units defended Hong Kong. By the fifth day, Commonwealth troops, under heavy artillery and aerial bombardment, had been forced to abandon their positions in Kowloon and retreated to Hong Kong Island. With the remaining troops unable to further mount an effective defence, Governor Young surrendered the colony on Christmas Day. This day is remembered by locals as \"Black Christmas\".\n\nDuring the occupation, the garrisoned Japanese soldiers committed many atrocities against both civilians and prisoners of war, including the St. Stephen's College massacre. Local residents suffered widespread food shortages, strict rationing, and hyperinflation arising from the forced exchange of currency from Hong Kong dollars to Japanese military yen. Widespread starvation and forced deportation of residents to mainland China for use as slave labour drastically reduced the population of the city from 1.6 million in 1941 to 600,000 in 1945. Some residents were able to flee to nearby Macau, which was comparatively untouched by the Japanese as a colony of neutral Portugal, with a few of these refugees further managing to find passage from there to Allied territory. Britain resumed control of the colony shortly after the surrender of Japan, on 30 August 1945, after almost four years of occupation.\n\nPost-war industrialisation \n\nHong Kong's population recovered quickly after the war, as a wave of skilled migrants from the Republic of China sought refuge from the Chinese Civil War in a territory neutral to the conflict. When the Communist Party took full control of mainland China in 1949, even more refugees fled across the open border in fear of persecution. Many newcomers, especially those who had been based in the major port cities of Shanghai and Guangzhou, established corporations and small- to medium-sized businesses and shifted their base operations to British Hong Kong. The establishment of the People's Republic of China caused the British colonial government to reconsider Hong Kong's open border to mainland China. In 1951, a boundary zone was demarked as a buffer zone against potential military attacks from communist China. Border posts along the north of Hong Kong began operation in 1953 to regulate the movement of people and goods into and out of the territory.\n\nIn the 1950s, Hong Kong became the first of the Four Asian Tiger economies that was undergoing rapid industrialisation driven by textile exports, manufacturing industries, and re-exports of goods to China. As the population grew, with labour costs remaining low, living standards began to rise steadily. The construction of the Shek Kip Mei Estate in 1953 marked the beginning of the public housing estate programme, which provided shelter for the less privileged and helped cope with the continuing influx of immigrants.\n\nUnder Governor Murray MacLehose, the government began a series of reforms to improve the quality of infrastructure and public services through the 1970s. Systemic corruption in the uniformed services had crippled trust in the government; MacLehose established the ICAC, an independent security service under the direct authority of the Governor, to restore the integrity of the civil service. Chinese was recognised as an official language during his tenure, accelerating the process of localisation in the government, slowly handing key official posts long held only by British members of the government over to local ethnic Chinese people. To alleviate road traffic congestion and provide a more reliable means of crossing the Victoria Harbour, the Mass Transit Railway was constructed and began operations of its first line in 1979. The Island Line, Kwun Tong Line, and Tsuen Wan Line all opened in the early 1980s, connecting Hong Kong Island, Kowloon, and parts of the New Territories to a single transport system.Forsyth, Neil, dir. Underground Pride. Mass Transit Railway Corporation, 1990. Film. 21 November 2013 MacLehose was the longest-serving colonial governor and, by the end of his governorship, had become one of the most popular and well-known figures in the territory. MacLehose laid the foundation for Hong Kong to establish itself as a key global city in the 1980s and early 1990s.\n\nSince 1983, the value of the Hong Kong dollar has been pegged to that of the United States dollar. The territory's competitiveness in manufacturing gradually declined due to rising labour and property costs, as well as new industrial capacity developed in southern China under the Open Door Policy, which was introduced in 1978. Nevertheless, by the early 1990s, Hong Kong had established itself as a global financial centre, a regional hub for logistics and freight, one of the fastest-growing economies in Asia, and the world's exemplar of laissez-faire market policy.\n\nThe Hong Kong issue \n\nIn 1971, China's permanent seat on the United Nations Security Council was transferred from the Republic of China, which had evacuated to Taiwan at the conclusion of the Chinese Civil War, to the People's Republic of China. Hong Kong was soon after removed from the organisation's list of non-self-governing territories, at the request of the PRC. Facing an uncertain future for the colony and the expiration of the New Territories lease beyond 1997, Governor MacLehose raised the question of Hong Kong's status with Deng Xiaoping in 1979.\n\nDiplomatic negotiations with China resulted in the Sino-British Joint Declaration in 1984. The United Kingdom agreed to transfer to China the entirety of the colony, including the perpetually ceded areas of Hong Kong Island and Kowloon Peninsula, at the conclusion of the 99-year New Territories lease in 1997. Hong Kong would then become a special administrative region governed separately from the mainland, retaining its free-market economy, common law judicial system, independent representation in international organisations, treaty arrangements, and self-governance in all areas except foreign diplomacy and military defence. The treaty further stipulated that the territory would be guaranteed a high degree of autonomy for 50 years after the transfer, with the Basic Law of Hong Kong serving as its constitutional document.\n\nUnder the terms of the Second Convention of Peking, the colony was expanded out to the New Territories, but the treaty did not include a small military outpost over which the Kowloon Walled City would later be built. After the end of Japanese occupation, thousands of refugees fleeing from the mainland during the Chinese Civil War made their way to the Walled City and became squatters occupying this parcel of land where China was technically still the sovereign power. Over the following decades, the population of this  area dramatically increased, reaching 33,000 by 1987, making the Walled City the most densely populated area in the world at its peak. Despite widespread illegal activity and unsanitary living conditions, the British largely took a 'hands-off' approach with regard to the Walled City due to the area's muddled territorial status and to avoid confrontation with the mainland authority. The Joint Declaration laid the groundwork for bilateral co-operation concerning any Hong Kong-related issues, including the fate of the former military fort. The Chinese government acquiesced to the demolition of the settlement in 1987. The structure was cleared away in 1994 and the area converted into the Kowloon Walled City Park.\n\nThe signing of the Joint Declaration and impending retrocession of the colony to China triggered a wave of mass migration. Residents during the transitional period were apprehensive about life after the transfer of sovereignty and were fearful of a curbing of civil rights and individual liberties, erosion of the integrity of the legal system, and an overall reduction in quality of life post-handover. Although colonial residents were British subjects, Parliament denied Hongkongers the right of abode in Britain. Emigrants left with the goal of obtaining residency or citizenship in Western countries, such as the United States, Canada, and Australia. Over half a million people in total left the territory during the peak migration period from 1987 until 1996.\n\nIn preparation for the transfer of sovereignty, the colonial administration implemented a series of electoral reforms that gradually introduced elected seats to the then-fully appointed Legislative Council. Indirectly elected functional constituency seats were introduced in 1985 and directly elected geographical constituency seats in 1991. However, following the Tiananmen Square protests of 1989, both the British and colonial governments were under intensified pressure to allow a faster pace of democratisation. The outflow of emigrants rapidly accelerated, increasing from around 20,000 people per year throughout most of the 1980s to over 66,000 in 1992. Governor Chris Patten proposed further reforms that broadly expanded the electorate to enable a fully elected legislature in 1995. The mainland authority considered these changes to be incompatible with the Basic Law and created a parallel Provisional Legislative Council that would assume legislative powers after the transfer of sovereignty.\n\nTransfer of sovereignty \n\nOn 1 July 1997, sovereignty over Hong Kong was officially transferred from the United Kingdom to the People's Republic of China, marking the end of 156 years of British colonial rule. As Britain's last major and most populous remaining colony, the handover effectively represented the end of the British Empire. Exactly at midnight, all government organisations with royal patronage simultaneously dropped the Royal prefix from their titles and any regalia with references to the Crown were replaced with insignia bearing the Bauhinia. After the handover ceremony, Chris Patten, the last Governor of Hong Kong, together with Prince Charles, departed the city on board the Royal Yacht Britannia. Tung Chee-hwa was then sworn in as the first Chief Executive of Hong Kong, with President Jiang Zemin administering the oath of office. The following morning, the Hong Kong Garrison of the People's Liberation Army entered the city and assumed control of the territory's military bases.\n\nSpecial administrative region \n\nAlmost immediately after the transfer of sovereignty, Hong Kong's economy was severely affected by the Asian financial crisis and further depressed by the outbreak of the H5N1 strain of avian flu. Financial Secretary Donald Tsang used the substantial territorial foreign currency reserves to maintain the Hong Kong dollar's currency peg and spent over HK$120 billion on significant holdings of major Hong Kong companies to prevent a general market collapse. While complete disaster was averted, Chief Executive Tung's housing policy of building 85,000 subsidised flats a year triggered a housing market crisis in 1998, depressing property prices and causing some homeowners to become bankrupt. Hong Kong was again gravely affected by the outbreak of severe acute respiratory syndrome (SARS) in 2003. In total, 1,755 people were infected, with 299 fatalities. Economic activities slowed and schools were closed for weeks at the height of the epidemic. An estimated HK$380 million (US$48.9 million) in contracts were lost as a result of the epidemic. While Hong Kong was also severely affected by the global recession of the late 2000s, the Tsang government introduced a series of economic stimulus measures prevented a prolonged recession.\n\nInfrastructure post-handover has been rapidly developed, with major transport links continuing to be planned and constructed. The Rose Garden Project, which began under British administration, to construct a new international airport was completed in 1998 and operations began at the new site during the same year. The Ngong Ping Cable Car, West Kowloon Cultural District, multiple new railway lines, and additional cross-harbour tunnels were all completed in the first 20 years of territorial self-governance. Direct infrastructure links with mainland China are also being actively developed, with both the Hong Kong–Zhuhai–Macau Bridge and Hong Kong section of the national high-speed railway currently under construction. Construction of the rail link generated a high level of controversy surrounding the demolition of key landmarks and displacement of residents along the planned route.\n\nPolitical debates have centred themselves predominately on issues surrounding electoral reform and Hong Kong's jurisdictional independence from the central government. Following the handover, democratic reform of the Legislative Council was immediately terminated and the government attempted to legislate sweeping national security legislation pursuant to Article 23 of the Basic Law. Coupled with years of economic hardships and discontent of Chief Executive Tung's pro-Beijing stance, over 500,000 people demonstrated against the government, which eventually led to Tung's resignation in 2005. Further proposals by the government to introduce a national education curriculum and nominee pre-screening before allowing Chief Executive elections triggered a number of mass protests in 2014, collectively known as the Umbrella Revolution.\n\nViolent attacks on journalists, an increasing level of press self-censorship, alleged extraterritorial abduction of anti-China publishers, and covert intervention into Hong Kong's educational, political, and independent institutions have posed challenges to the policy of one country, two systems. In the 2016 legislative election, there were reports of discrepancies in the electorate registry, which contained ghost registrations across constituencies, as well as political intervention to strip pro-independence individuals of their right to stand in elections and alleged death threats to election candidates. Social divisiveness on ethnic identity heightened markedly during Leung's term, especially among younger members of the population. An ongoing University of Hong Kong study found that 69.7% of those aged 18 to 29 considered themselves as Hongkongers, while only 0.3% identified as Chinese; at the end of 2011, before the start of Leung's tenure as Chief Executive, ethnic identity polling for that demographic measured 42.4% and 11.8%, respectively.\n\nGovernment and politics \n\nHong Kong is a special administrative region of China, maintaining a separate legislature, executive, and judiciary from the rest of the country. It has an executive-led parliamentary government modelled after the Westminster system, inheriting this from British colonial administration. The Sino-British Joint Declaration guarantees the territory's capitalist economic system and autonomous system of government for 50 years after the transfer of sovereignty. Under this framework and the concept of \"one country, two systems\", the Basic Law of Hong Kong is the regional constitutional document, establishing the structure and responsibility of the government.\n\nThe head of government is the Chief Executive, who is selected for a once-renewable five-year term by the Election Committee, a 1,200-member nominating body composed of prominent corporate, community, and government leaders. The central government provides oversight for the regional government; final interpretative power of the Basic Law rests with the Standing Committee of the National People's Congress and the Chief Executive is formally appointed by the State Council after nomination by the aforementioned Election Committee. Responsibility for foreign and military affairs is also assumed by the central authority.\n\nThe Legislative Council is a unicameral legislature with 70 members, consisting of 35 directly elected members apportioned to geographical constituencies, 30 members representing professional or special interest groups formed as functional constituencies, and 5 members nominated by members of the District Councils and selected in territory-wide elections. Legislators are elected using multiple different voting systems, determined by whichever constituency a particular seat is representing. All directly elected seats are filled using a proportional representative system, while functional constituencies other than the all-territory District Council constituency choose their councillors using first-past-the-post or instant-runoff voting.\n\nGovernment policy is determined by the Executive Council, a body of advisors appointed by the Chief Executive with the authority to issue delegated legislation and proposes new bills to the legislature for debate and promulgation. Direct administration is managed by the Civil Service, an apolitical bureaucracy that ensures positive implementation of policy. Hong Kong is nationally represented by 36 deputies in the National People's Congress chosen through an electoral college and 203 delegates in the Chinese People's Political Consultative Conference appointed by the central government.\n\n22 political parties had representatives elected to the Legislative Council in the 2016 election. These parties have aligned themselves into three ideological groups: the  pro-Beijing camp who form the current government, the pro-democracy camp, and localist groups. The Communist Party does not have an official political presence in Hong Kong and its members do not run in local elections.\n\nThe Monetary Authority is the currency board and de facto central bank of the territory. It is responsible for regulation of the Hong Kong dollar and, along with HSBC, Standard Chartered Hong Kong, and the Bank of China, issues currency in the form of banknotes. Coinage is solely minted by the Monetary Authority.\n\nLegal system and judiciary \n\nThe judicial system is derived from the common law system of English law, and was created at the establishment of the territory as a British colony. Chinese national law does not generally apply in the region, and Hong Kong is treated as an independent jurisdiction. The Court of Final Appeal is the territory's highest court, exercising final adjudication over interpretation of laws and has the power to strike down statutes and legislation inconsistent with the Basic Law. It is led by the Chief Justice and consists of three additional permanent judges and one non-permanent seat filled on a rotating basis by both local judges and those invited from overseas common law jurisdictions. However, authoritative interpretative power over the Basic Law itself instead lies with the Standing Committee of the National People's Congress. Judges on all courts are appointed by the Chief Executive on the recommendation of an independent commission. As a common law jurisdiction, Hong Kong courts may refer to precedents set in English law and Commonwealth judicial rulings.\n\nThe Department of Justice is responsible for handling legal matters on behalf of the government. Its responsibilities include providing legal advice, criminal prosecution, civil representation, legal and policy drafting and reform, and international judicial co-operation between different jurisdictions. Apart from prosecuting criminal cases, lawyers of the Department of Justice represent the government in any civil and administrative lawsuits against the administration. The department may call for judicial review of government action or legislation and may intervene in cases that may involve the greater public interest. The Basic Law protects the Department of Justice from interference by the government when exercising its control over criminal prosecution. Law enforcement is a responsibility of the Security Bureau and the Hong Kong Police, with agencies like the Customs and Excise Department and Immigration Department handling more specialised tasks.\n\nGreater China relations \n\nThe Constitutional and Mainland Affairs Bureau is responsible for co-ordinating with the central government on issues related to the implementation and interpretation of the Basic Law, electoral matters, and bilateral economic and legal co-operative efforts. Because national law does not automatically apply in the territory, the two governments periodically negotiate formal agreements that cover a range of issues, including cross-boundary trade, law enforcement co-operation, environmental protection, shipping logistics, among other fields. The Liaison Office is the mainland authority's corresponding representative and co-operative body in the region and maintains an extensive network of relations with local commercial, educational, and cultural organisations in addition to its government functions.\n\nThe Closer Partnership Economic Arrangement formalised a policy of free trade between Hong Kong and the mainland, with each government committing to reduce regulations concerning cross-boundary trade and investments. The agreement forms the basis for further integration between the two regions, with supplements concerning more areas of co-operation added to the arrangement almost every year since its signing. A similar economic partnership arrangement with Macau also details liberalisation of trade and deregulation of the movement of goods and services between the two special administrative regions. Cross-strait relations with Taiwan falls under the purview of the Hong Kong–Taiwan Economic and Cultural Co-operation and Promotion Council.\n\nAn area where the jurisdictional independence of the territory is most apparent is its immigration policy. The Immigration Department issues distinct passports for permanent residents different from those of the mainland or Macau. The region maintains a regulated border with the mainland and all travellers between Hong Kong and both China and Macau, regardless of nationality or residency, must pass through border controls.\n\nForeign relations \n\nResponsibility for diplomatic affairs is assumed by the central government and the Ministry of Foreign Affairs, but Hong Kong retains the ability to enter into international agreements in commercial, economic, and other appropriate fields defined by the Basic Law. Under the name \"Hong Kong, China\", the territory co-operates with foreign nations in international organisations, such as the World Trade Organization, the Asia-Pacific Economic Cooperation forum, and the International Olympic Committee. Although not a member of the United Nations as the territory is not a sovereign nation, Hong Kong actively participates in the organisation's agencies and is party to many of its international agreements.\n\nThough no longer administering the territory after the transfer of sovereignty, the United Kingdom maintains strong ties with Hong Kong. Hundreds of British corporations maintain offices or their regional headquarters in the territory, and both parties collaborate on a number of economic and bilateral agreements. Hong Kong regularly invites British and Commonwealth judges to sit on the Court of Final Appeal, and its universities remain involved in the Association of Commonwealth Universities. As a party to the Sino-British Joint Declaration, the United Kingdom is obligated to ensure proper implementation of the treaty; the Foreign Secretary gives biannual reports to Parliament on the status of Hong Kong.\n\n123 countries maintain consular missions in Hong Kong, as well as major supranational organizations, including the European Union. A number of consulates-general, such as those of the United States and United Kingdom, operate independently of their corresponding embassies in Beijing, extend their areas of jurisdiction beyond Hong Kong to include Macau, are headed by officials with ambassadorial rank, and report directly to their respective foreign offices.Chapter 1, Hong Kong Year Book 2011 The regional government itself maintains trade offices for conducting external commercial relations throughout Greater China and in foreign countries.\n\nRegional and administrative divisions \n\nHong Kong consists of three geographical regions, divided by their historical time of acquisition by the United Kingdom: Hong Kong Island, Kowloon, and the New Territories. The city of Victoria, the first urban settlement in the territory, was established on Hong Kong Island, and its area is analogous to present-day Central and Western District.\n\nThe territory is administratively divided into 18 districts. Each district is represented by a District Council, which advises the government on local issues such as the provisioning of public facilities, maintenance of community programmes, promotion of cultural activities, and improvement of environmental policies. There are a total of 458 seats in the District Councils, 431 of which are directly elected while the remaining 27 are filled by ex officio members consisting of rural committee chairmen, representing villages and towns of outlying areas of the New Territories. The Home Affairs Department communicates government policies and plans to the public through the district offices. Local administration of municipal services was previously delegated to the Urban Council in Kowloon and Hong Kong Island and to the Regional Council in the New Territories, until they were abolished in 1999.\n\nElectoral and political reforms\n\nAlthough the Basic Law lays the foundation for the regional government, some of its articles require more specific legislation to be adopted before implementation. Article 23 provides for laws that prohibit treason and subversion in the territory, and a bill was drafted pursuant to this constitutional requirement. The government dropped this proposal after fierce opposition and protests against its perceived potential to restrict freedom of information.\n\nArticles 45 and 68 state that the ultimate goal is for both the Chief Executive and all members of the Legislative Council to be selected by universal suffrage. While the legislature is now partially directly elected, the executive continues to be selected by means other than direct election. From its establishment as a colony, Hong Kong has not had a fully representative democratic government. Colonial administration prior to the Second World War largely excluded Chinese representation. When Hong Kong was a British territory, the executive was embodied by the Sovereign, who appointed and was personally represented by the Governor. The Legislative Council initially consisted exclusively of appointed white British members, with its first Chinese member not joining the chamber until 1880. After the end of Japanese occupation and the resumption of British control, amidst the greater movement of global decolonisation, the government seriously considered constitutional reform in Hong Kong; this was ultimately shelved due to fears of government infiltration by communist sympathisers after their victory at the conclusion of the Chinese Civil War.\n\nAfter negotiation of the Sino-British Joint Declaration, the Legislative Council was reformed from an assembly consisting solely of government officials and appointed members to include indirectly elected functional constituency seats in 1985 and directly elected seats in 1991. Electoral reform introduced in 1994 greatly expanded the electorate for functional constituencies, effectively making them representative. However, the legislature was abolished after the handover and replaced with an interim Provisional Legislative Council, before new elections in 1998 were held under a selection system similar to what was used prior to the last colonial era reforms.\n\nElectoral reform continues to be a contentious issue after the transfer of sovereignty. The government faces ongoing calls to introduce direct election of the Chief Executive and all Legislative Council members. These efforts have been partially successful; the Election Committee no longer selects a portion of the Legislative Council and was slightly expanded from 800 to 1,200 members, and the number of legislature seats was increased from 60 to 70. A central government decision in 2014 to require Chief Executive candidates to be pre-screened as part of a reform package to introduce universal suffrage incited large-scale protests demanding a more open process. The proposal was later rejected by the legislature and the executive selection process remains unchanged.\n\nSociopolitical issues and human rights \n\nThe Basic Law establishes a series of fundamental rights for every resident of Hong Kong. Though the regional government generally observes these guarantees, the central government has been increasingly perceived to be encroaching on the autonomy of the territory.\n\nThe Standing Committee of the National People's Congress holds final interpretative power over the Basic Law, and use of it can override any regional judicial process. After the 2016 legislative elections, six incoming Legislative Council members took their oaths of office improperly. The Standing Committee subsequently issued a new interpretation of the Basic Law article regarding assumption of office, preempting a territorial judicial review and allowing the High Court to disqualify the legislators. Judicial independence was also questioned after the disappearance of five staff members of a Causeway Bay bookstore that was known to sell literary material prohibited in the mainland. Their possible abduction and rendition by Chinese public security bureau officials would represent a breach of the Sino-British Joint Declaration, violating the guarantee of regional autonomy; mainland authorities do not have extraterritorial jurisdiction to enforce national laws.\n\nFreedom of the press since the handover have been threatened by incidents of physical violence against journalists and as news media organisations are pressured not to publish stories that portray the central government in a negative way. News media has been increasingly prone to self-censorship, as publication owners expand business interests on the mainland or media organisations become acquired by Chinese corporations. The police have been accused of using excessive force against protesters at public rallies and overtly barring demonstrators from free assembly.\n\nEthnic minorities, excluding those of European ancestry, have marginal representation in government and are often discriminated against while seeking housing, education, and employment opportunities. While legislation prohibits discrimination based on age, sex, and disability, it specifically excludes migrant workers, along with immigrants and mainland Chinese. Employment vacancies and public service appointments frequently have language requirements, which minority job seekers frequently fail to meet, while language education resources remain inadequate for Chinese learners. In recent years, residents of a minority ethnicity have been more frequently placed on government advisory committees to address racial issues.\n\nForeign domestic helpers, predominately women from the Philippines and Indonesia, have little protection under territorial law. Although residing and working in Hong Kong, workers of this class are not treated as ordinarily resident, barring them from eligibility for right of abode. Domestic helpers are required to live in the residence of the employer and must leave Hong Kong within two weeks on termination of an employment contract or face deportation. Additionally, the Immigration Department does not renew visas for workers who change employers more than three times in a single year. Legislation offers nominal protection for migrant workers, but the legal process for recourse is time-consuming and costly, potentially taking 15 months for cases to be heard in the District Court or Labour Tribunal. The culmulative effect of these policies and legislation leaves foreign domestic helpers vulnerable to exploitation and abuse by employers and greatly restricts their labour mobility.\n\nMilitary \n\nThe President of China holds the title of Chairman of the Central Military Commission, making him supreme commander of the nation's armed forces. Under the Basic Law, responsibility for the defence of Hong Kong is assumed by the central government. The Hong Kong Garrison of the People's Liberation Army is stationed in the territory and is headquartered at the Chinese People's Liberation Army Forces Hong Kong Building in Central. 6,000 active duty servicemen serve as part of the garrison. The Basic Law also protects civilians and civil affairs against interference by the garrison. Military personnel are subject to both national and Hong Kong laws while serving in the territory. Under exceptional circumstances, the regional government may ask the central government for assistance from the garrison in disaster relief.\n\nResidents of Hong Kong are not required to perform military service. Current law has no provision for enlistment of local residents, meaning that the military force defending the territory is composed entirely of personnel originating outside of Hong Kong. As responsibility for the defence of Hong Kong rests solely with the central authority, the regional government is not obligated to bear the expenditures of the garrison stationed in the city. During the colonial era, territorial defence was the responsibility of the British Forces Overseas Hong Kong, supplemented by local militia organized as the Royal Hong Kong Regiment. The only military-affiliated organisation that recruits local residents is the Hong Kong Army Cadets Association, a uniformed youth organisation of children aged 6 and older sponsored by the People's Liberation Army.\n\nGeography \n\nHong Kong is located on China's south coast, 60 km east of Macau on the opposite side of the Pearl River Delta. It is surrounded by the South China Sea on the east, south, and west, and borders the Guangdong city of Shenzhen to the north over the Sham Chun River. The territory's 2755 km2 area consists of Hong Kong Island, the Kowloon Peninsula, the New Territories, and over 200 offshore islands, of which the largest is Lantau Island. Of the total area, 1106 km2 is land and 1649 km2 is water. Hong Kong claims territorial waters to a distance of 3 nmi. Its land area makes Hong Kong the 167th largest inhabited territory in the world.\n\nAs much of Hong Kong's terrain is hilly to mountainous with steep slopes, less than 25% of the territory's landmass is developed, while the majority is grassland, woodland, shrubland, and agricultural land. About 40% of the remaining land area is reserved as country parks and nature reserves. Low altitude vegetation in Hong Kong is dominated by secondary rainforests, as the primary forest was mostly cleared during the Second World War, and higher altitudes are dominated by grassland. The territory is highly diverse: over 3,000 species of vascular plants occur in the region, 300 of which are native to Hong Kong. Over 2,000 species of moths, butterflies, dragonflies, and other insects can be found, as well as one third of the total bird species in China, and a variety of fish, amphibians, reptiles, and mammals native to the Pearl River Delta. The Bauhinia orchid, native to the region, serves as a symbol for the city, appearing on the territorial flag and emblem.\n\nMost of the territory's urban development exists on Kowloon Peninsula, along the northern edge of Hong Kong Island, and in scattered settlements throughout the New Territories. The highest elevation in the territory is at Tai Mo Shan, 957 m above sea level. Hong Kong's long and irregular coast provides it with many bays, rivers and beaches. On 18 September 2011, UNESCO listed the Hong Kong Global Geopark as part of its Global Geoparks Network. Hong Kong Geopark is made up of eight Geo-Areas distributed across the Sai Kung Volcanic Rock Region and Northeast New Territories Sedimentary Rock Region.\n\nDespite Hong Kong's reputation of being intensely urbanised, the territory has tried to promote a green environment, and recent growing public concern has prompted the severe restriction of further land reclamation from Victoria Harbour. Awareness of the environment is growing as Hong Kong suffers from increasing pollution compounded by its geography and tall buildings. Approximately 80% of the city's smog originates from other parts of the Pearl River Delta.\n\nClimate \n\nIn the Köppen–Geiger classification system, Hong Kong has a humid subtropical climate (Cwa), though it is situated 128 km south of the Tropic of Cancer. Summer is hot and humid with occasional showers and thunderstorms, and warm air coming from the southwest. Typhoons most often occur in summer, sometimes resulting in flooding or landslides. Winters are mild and usually start sunny, becoming cloudier towards February; the occasional cold front brings strong, cooling winds from the north. The most temperate seasons are spring, which can be changeable, and autumn, which is generally sunny and dry. Snowfall is extremely rare, and usually occurs in areas of high elevation. Hong Kong averages 1,948 hours of sunshine per year, while the highest and lowest ever recorded temperatures at the Hong Kong Observatory are  on 22 August 2017 and  on 18 January 1893, respectively. The highest and lowest ever recorded temperatures across all of Hong Kong, on the other hand, are   at Waglan Island in June 1991 and  at Tai Mo Shan on 24 January 2016, respectively.\n\nArchitecture \n\nAccording to Emporis, there are 1,223 skyscrapers in Hong Kong, which puts the city at the top of world rankings.\nIt has more buildings taller than 500 ft than any other city.\nThe high density and tall skyline of Hong Kong's urban area is due to a lack of available sprawl space, with the average distance from the harbour front to the steep hills of Hong Kong Island at , much of it reclaimed land. This lack of space causes demand for dense, high-rise offices and housing. Thirty-six of the world's 100 tallest residential buildings are in Hong Kong. More people in Hong Kong live or work above the 14th floor than anywhere else on Earth, making it the world's most vertical city.\n\nAs a result of the lack of space and demand for construction, few older buildings remain, and the city is becoming a centre for modern architecture. The International Commerce Centre (ICC), at 484 m high, is the tallest building in Hong Kong and the seventh tallest in the world, by height to roof measurement. The tallest building prior to the ICC is Two International Finance Centre, at 415 m high. Other recognisable skyline features include the HSBC Headquarters Building, the triangular-topped Central Plaza with its pyramid-shaped spire, The Center with its night-time multi-coloured neon light show; A Symphony of Lights and I. M. Pei's Bank of China Tower with its sharp, angular façade. According to the Emporis website, the city skyline has the biggest visual impact of all world cities. Also, Hong Kong's skyline is often regarded to be the best in the world, with the surrounding mountains and Victoria Harbour complementing the skyscrapers. Most of the oldest remaining historic structures, including the Tsim Sha Tsui Clock Tower, the Central Police Station, and the remains of Kowloon Walled City were constructed during the 19th and early 20th centuries.\n\nThere are many development plans in place, including the construction of new government buildings, waterfront redevelopment in Central, and a series of projects in West Kowloon. More high-rise development is set to take place on the other side of Victoria Harbour in Kowloon, as the 1998 closure of the nearby Kai Tak Airport lifted strict height restrictions. The Urban Renewal Authority is highly active in demolishing older areas, including the razing and redevelopment of Kwun Tong town centre, an approach which has been criticised for its impact on the cultural identity of the city and on lower-income residents.\n\nCityscape \n\nDemographics \n\nThe Census and Statistics Department estimated the population to be 7,389,500 people as of August 2017, with an average annual growth rate of 0.66% over the previous five years. The territorial population has multiplied by over a factor of 12 since the end of the Second World War, from about 600,000 in 1945. Since 1979, the fertility rate has consistently declined below the replacement level of 2.1, reaching 1.2 children per woman in 2016. Continued growth can be attributed to high rates of immigration from foreign countries and Greater China; 40% of the population were born outside of the territory.\n\n92% of the population is Han Chinese, the majority of whom are Taishanese, Teochew, Hakka, and a variety of other Cantonese peoples. A large portion of Hong Kong's majority population originated from the neighbouring province of Guangdong, from where many fled during the Second Sino-Japanese War, the Chinese Civil War, and after establishment of communist rule in China.\n\nNon-ethnic Chinese minorities constitute the remaining 8% of the population. Filipinos and Indonesians form the city's largest ethnic minority groups, many of whom work as foreign domestic helpers. South Asians, largely descendants of British Indian soldiers stationed by the colonial government and migrants of that era, also make up a significant minority. Like many Chinese who crossed the border after the communist victory at the conclusion of the Chinese Civil War, Vietnamese refugees sought refuge and settled in Hong Kong during and after the Vietnam War. Britons, Americans, Canadians, Japanese, and Koreans resident in the city largely work in the commercial and financial sector.\n\nA legacy of colonial rule, about 3 million residents hold some form of British nationality, including British National (Overseas) status and British citizenship. The vast majority of them concurrently hold Chinese nationality, which was automatically granted to all residents of Chinese descent at the transfer of sovereignty.\n\nChinese citizens ordinarily resident in mainland China are not entitled to right of abode in Hong Kong, and are subject to immigration controls. Like foreign nationals, they may apply for right of abode after seven years of continuous residency. Some rights may be acquired through marriage (e.g., the right to work), but these do not include the right to vote or stand for office. The influx of Chinese immigrants is a significant contributor to territorial population growth, and is limited by a daily quota of 150 people with existing family ties in Hong Kong. These immigrants are issued a One-way Permit and have their household registration in the mainland rescinded.\n\nLanguages \n\nThe two official languages of Hong Kong are Chinese and English. Cantonese, a variety of Chinese originating from the province of Guangdong to the north of Hong Kong, is spoken by the vast majority of the population. According to the 2016 by-census, 94.6% of the population speak Cantonese; 88.9% as a first language and 5.7% as a second language.\n\nThe Basic Law is written in Chinese and English, and legislation enacted since the handover has been drafted in both languages. Colonial era legislation and court proceedings predominantly used English, so the two languages share a coequal status in the common law system of the territory. Approximately half of the population speaks English, though only 4.3% use it natively and 48.9% as a second language. Hong Kong English is the common form of English used in the region, generally following British English in spelling and heavily influenced by Cantonese pronunciations. Among the bilingual members of the population, many exhibit code-switching, mixing English and Cantonese in informal conversation.\n\nSince the transfer of sovereignty, an influx of mainland Chinese immigrants and greater interaction with the rest of the national economy have brought an increasing number of Mandarin speakers to Hong Kong. Mandarin is about as prevalent as English in the territory; 48.6% of the population can speak it, with 1.9% using it as a first language and 46.7% as a second language. Hong Kong uses traditional Chinese characters in written script, rather than the simplified characters that are officially used in the mainland.\n\nPersonal income and wealth \n\nHong Kong has the highest statistical income gap in the Asia-Pacific region. The Census and Statistics Department measured the Gini coefficient of the territory as 53.9 using data collected in the 2016 by-census. Income inequality has risen since the transfer of sovereignty, as the region's ageing population has gradually added to the number of economically inactive people. While median household income has also steadily increased in the last decade, the wage gap remains high, with the 90th percentile of earners receiving 41 per cent of all income. Hong Kong is ranked fourth in terms of the highest percentage of millionaire households, with 8.5 per cent of all households holding at least one million US dollars. The city is also ranked second in the world by the most billionaires per capita, with one per 132,075 people. Despite government efforts to reduce growth of the disparity through assistance programmes such as the Old Age Living Allowance, median income for the top 10 per cent of earners is 44 times that of the bottom 10 per cent. There were 908 homeless persons registered with the Social Welfare Department by the end of 2016, though it is estimated that the actual number is almost double that of the official figure.\n\nReligion \n\nFreedom of religion is guaranteed by the Basic Law, and many religious organisations have an established presence in the territory. The majority of residents have no religious affiliation, professing some form of agnosticism, irreligion, or atheism. In a 2015 Gallup International poll, 26% of Hongkongers self-identified as religious. Prior to the transfer of sovereignty, Christianity was the only faith with official presence in the government; only Anglican and Catholic bishops were placed in the colonial order of precedence. Other religions with significant numbers of adherents are now similarly acknowledged by the post-handover government.\n\nAmong the religious population, the traditional \"three teachings\" of China (Buddhism, Confucianism, and Taoism) have the most adherents, estimated to be around 1.5 million. About 869,000 residents profess Christianity as their faith, forming 11.7% of the total population. Protestants and Catholics make up the bulk of this number, while the remainder is composed of members of other denominations, including Mormons, Jehovah's Witnesses, and Eastern Orthodox Christians. Islam has about 300,000 adherents in the territory, 50,000 of whom are Chinese. Followers of other religions, including Sikhism, Hinduism, Judaism, and the Bahá'í Faith, generally ethnically originate from the same region as their faith.\n\nRegulation and restrictions on religion that are required in mainland China do not apply in Hong Kong. The Anglican and Catholic churches freely appoint their own bishops and maintain ties with the Church of England and the Vatican. Although banned by the central government, the practice of Falun Gong is tolerated in the territory.\n\nEconomy \n\nHong Kong has a capitalist mixed service economy, characterised by low taxation, minimal government market intervention, and an established international financial market. It is the 33rd-largest economy in the world, with a nominal GDP of approximately US$320 billion. Hong Kong's economy has consistently ranked at the top of the Heritage Foundation's index of economic freedom since 1995,  and had been described by Milton Friedman as the world's greatest experiment in laissez-faire capitalism, but the territory suffers from a relatively high level of income disparity. The Hong Kong Stock Exchange is the seventh largest in the world and has a market capitalisation of US$3.2 trillion as of December 2016. It is an important centre for international finance and trade, with one of the greatest concentrations of corporate headquarters in the Asia-Pacific region.\n\nHong Kong is the world's seventh largest trading entity in both exports and imports, with the total value of traded goods exceeding its gross domestic product. It is also the world's largest transshipment centre; much of its exports consist of re-exports, products manufactured outside of the territory, especially in mainland China, and distributed via Hong Kong. Its physical location has allowed the city to establish a transportation and logistics infrastructure that includes the world's second busiest container port and the world's busiest airport for international cargo. The territory's largest export markets are mainland China and the United States.\n\nThe territory has little arable land and few natural resources, so it imports most of its food and raw materials. Imports account for more than 90 per cent of Hong Kong's food supply, including nearly all of the meat and rice available there. Agricultural activity, relatively unimportant to Hong Kong's economy and contributing just 0.1 per cent of its GDP, primarily consists of growing premium food and flower varieties.\n\nWhile the territory boasted one of the largest manufacturing economies in Asia during the latter half of the colonial era as the city industrialised, Hong Kong's economy is now dominated by the services sector. Services alone constitute 92.7 per cent of economic output, with the public sector accounting for about 10 per cent. As one of the Four Asian Tigers, Hong Kong rapidly industrialised as a manufacturing centre driven by exports through the post-war decades of the 20th century, turning the territory into a developed high-income area by the end of the colonial era. Between 1961 and 1997, Hong Kong's gross domestic product multiplied by a factor of 180, while per-capita GDP increased 87 times over. The territory's GDP relative to mainland China's peaked at 27 per cent in 1993, but this has since fallen significantly as the mainland developed and liberalised its economy, declining to less than 3 per cent in 2017.\n\nThe government traditionally played a passive role in the economy, with little by way of industrial policy and almost no import or export controls. Under the official policy of \"positive non-interventionism\", Hong Kong was often cited as a comprehensive example of laissez-faire capitalism. While the economy transitioned to become service-based in the 1980s, late colonial governments steadily introduced interventionist policies that were continued and expanded by post-handover administrations, including export credit guarantees, a compulsory pension scheme, a minimum wage, anti-discrimination laws, and a state mortgage backer.\n\nHong Kong's economic and infrastructure integration with China has increased significantly from the start of market liberalisation in the mainland beginning in 1978. Since resumption of cross-boundary train service in 1979, multiple rail and road links have been continuously improved and constructed, facilitating trade between the regions. The Closer Partnership Economic Arrangement formalised a policy of free trade between Hong Kong and the mainland, with each jurisdiction pledging to eliminate remaining obstacles to the trade of goods and services and cross-boundary investments. Chinese companies have greatly expanded their economic presence in the territory since the transfer of sovereignty; mainland firms now represent over half of the total value of the Hang Seng Index, up from just 5 per cent in 1997.\n\nThe Hong Kong dollar has been pegged to the United States dollar since 1983. Because most business transactions in the territory are dealt in US dollars, the fixed exchange-rate system is intended to reduce foreign exchange risk for international traders and investors. Policy changes implemented by the Federal Reserve affect Hong Kong, but do not necessarily take the territory into account, and volatility in the value of the US dollar itself requires the Monetary Authority to continually maintain the fixed exchange rate at substantial cost. Consequently, there are periodic appeals to discontinue the existing currency peg, and to either allow the Hong Kong dollar to be freely floated or peg it to the Chinese renminbi.\n\nTourism forms a major part of the territorial economy, comprising 5 per cent of GDP; 26.6 million visitors contributed US$32.9 billion in international tourism receipts in 2016, making Hong Kong the fourteenth most popular destination for international tourists. It is also the most popular city for tourists, receiving over 70 per cent more visitors than its closest competitor, Macau. The city is further consistently ranked as one of the most expensive cities for expatriates.\n\nInfrastructure \n\nEnergy \n\nHong Kong meets its energy requirements largely through imports from external sources, including both generated electricity and fuel. The vast majority of this energy came from fossil fuels, with 46% from coal and 47% from petroleum. The remainder came from other imports, including nuclear energy generated on the mainland. Renewable sources accounts for a negligible amount of total energy generated for the territory; wind power sources have only been developed at a very small scale, while solar panels are deployed on a limited scale for use in private homes.\n\nWater and sanitation \n\nWith few natural lakes and rivers, a high population density, groundwater sources inaccessible through hard granite bedrock, and extremely seasonal variations in rainfall, the territory does not have an adequately reliable local source of fresh water. 70 per cent of water demand is met by importing water from the Dongjiang River in the neighbouring province of Guangdong. Use of seawater for toilet flushing, supplied through a separate distribution system, greatly reduces strain on freshwater supply. A planned desalination plant in Tseung Kwan O is expected to reduce dependence on external imports and to provide a more reliable water source during periods of low rainfall and severe droughts.\n\nTelecommunications \n\nMobile phone usage in Hong Kong is ubiquitous; there are more than 17 million active mobile phone subscribers, more than double the total number of residents in the territory. Internet usage is similarly high with 5.58 million users, or 87.5% of the population. The regional average broadband connection speed is 21.9 Mbit/s, making Hong Kong fourth in the world in terms of internet speed. 92.4% of households have broadband internet access and connections over fibre-optic infrastructure are becoming increasingly prevalent. 29 submarine communications cables link the region's telecommunications network with the rest of the world.\n\nTransport \n\nHong Kong has a highly developed and sophisticated transport network, encompassing both public and private modes of travel. Regulation and administrative policy is handled by the Transport Department. Over 90% of daily journeys are made on public transport, the highest such percentage in the world. The Octopus card, a contactless smart payment card, is widely accepted on railways, buses, and ferries, and can be used for payment in retail stores. Launched in 1997 on the Mass Transit Railway, it is the second contactless smart card system in the world to be used and is a ubiquitous form of payment throughout the territory.\n\nRail \n\nThe Mass Transit Railway (MTR) is an extensive passenger railway network, connecting 93 metro stations throughout the territory. With a daily ridership of over five million, the system serves 41% of all public transit passengers in the city. Service is extremely punctual, achieving an on-time rate of 99.9%. The rapid transit network operates within inner urban Hong Kong and extends to New Kowloon, Lantau Island, and the northeastern and northwestern parts of the New Territories. Nine railway lines provide general metro services, while the Airport Express provides a direct link from Hong Kong International Airport to the city centre and a dedicated line transports passengers to and from Hong Kong Disneyland.\n\nCross-boundary train service to Shenzhen is offered by the East Rail Line, terminating at immigration checkpoints at Lo Wu and Lok Ma Chau. Inter-city trains to Guangzhou, Shanghai, and Beijing are operated from Hung Hom Station. Connecting service to the national high-speed rail system is scheduled to begin in 2018, after construction of West Kowloon Station completes.\n\nRoads and taxis \n\nRoad traffic in the territory drives on the left, unlike that of mainland China. Highways are organized as the Hong Kong Strategic Route and Exit Number System, a system of major roads comprising 3 north-south routes, 5 east-west routes, and the New Territories Circular Road. All major geographic areas of the territory are connected over this road system; Route 8 runs along the Tsing Ma Bridge to connect the city centre with Tsing Yi and Lantau Island, and Routes 1, 2, and 3 pass through the three tunnels under Victoria Harbour to connect Hong Kong Island with the Kowloon Peninsula. Route 10 provides direct road access to Shenzhen, terminating at the Shenzhen Bay Port. The territory is connected to the national expressway system at Lok Ma Chau; the G4 Beijing–Hong Kong–Macau Expressway ends at the Huanggang Port and is connected to Route 9 by a short spur road beginning at immediately at the territorial border. When completed, the Hong Kong–Zhuhai–Macau Bridge will provide an additional connection to the mainland road system and create a direct route to the western side of the Pearl River estuary.\n\nWhile public transport systems handle the majority of passenger traffic, there are over 500,000 private vehicles licensed in Hong Kong. Because of the territory's small size, residents are discouraged from private car ownership; cars are subjected to a first-time registration tax, which varies from 35% to over 100% depending on the size and value of the car, and over half the cost of petrol sold at filling stations is due to taxes. Road traffic is extremely congested during peak hours, with average vehicle speeds reaching as a low as 10 km/h on major roads. Congestion is exacerbated by the urban layout of the city, the physical constraints to expanding road transport infrastructure, and a growing number of vehicles.\n\nMore than 18,000 taxicabs provide transport services for the city and they are easily identifiable by their brightly painted vehicles. The geographical area that a taxicab operates is distinguished by vehicle color. Red taxis serve Hong Kong Island, Kowloon, all of the New Territories, and the northern part of Lantau Island; green taxis operate in portions of the New Territories and specific stations outside of their assigned area; blue taxis are available only on Lantau Island.\n\nAviation \n\nHong Kong International Airport is the primary airport for the territory. Over 100 airlines operate flights from the airport and it is the main hub of flag carrier Cathay Pacific, Cathay Dragon, Air Hong Kong, and Hong Kong Airlines. It is an important regional transhipment centre, passenger hub, and gateway for destinations in mainland China and the rest of Asia. The airport is a major international air passenger gateway and services the most air cargo traffic in the world. Handling over 70 million passengers annually, it is the eighth busiest airport worldwide by passenger traffic. The airport is constructed on an artificial island north of Lantau Island and was built to replace the overcrowded Kai Tak Airport in Kowloon Bay.\n\nFerries \n\nThe Star Ferry, in service since 1888, operates two lines across Victoria Harbour and provides scenic views of Hong Kong's skyline for its 53,000 daily passengers. Outlying islands of the territory are inaccessible by other means and transport to those areas is provided exclusively by ferry operators, including New World First Ferry, Hong Kong & Kowloon Ferry, and Tsui Wah Ferry. Ferry services also operate routes to Macau and nearby cities in mainland China, including direct service between Hong Kong International Airport and Shenzhen Bao'an International Airport for transiting passengers. Cross-boundary services operate out of the Macau Ferry Terminal, China Ferry Terminal, and Tuen Mun Ferry Pier.\n\nHong Kong is famous for its junk ships that traverse the harbour, and small kai-to ferries that serve remote coastal settlements. The Port of Hong Kong is a busy deepwater port, specialising in container shipping.\n\nBuses and trams \n\nPublic bus services are franchised and run by five private companies, together operating more than 700 routes across the territory. The largest are Kowloon Motor Bus, providing 402 routes in Kowloon and New Territories; Citybus, operating 154 routes on Hong Kong Island; and New World First Bus, running an additional 56 routes in Kowloon and Hong Kong Island. All three major bus operators provide cross-harbour services, serving as a major transport link for the 3.9 million daily bus passengers. Double-decker buses were introduced to Hong Kong in 1949, and are now almost exclusively used; single-decker buses remain in use for routes with lower demand or roads with lower load capacity. Public light buses serve most parts of Hong Kong, particularly areas where standard bus lines cannot reach or do not reach as frequently, quickly, or directly.\n\nHong Kong Island's steep, hilly terrain was initially served by sedan chairs. The Peak Tram, the first public transport system in Hong Kong, has provided vertical rail transport between Central and Victoria Peak since 1888. In the Central and Western District, there is an extensive system of escalators and moving pavements, including the longest outdoor covered escalator system in the world, the Mid-Levels escalator. Hong Kong Tramways, which has served the territory since 1904, covers the northern parts of Hong Kong Island. The MTR operates the Light Rail system serving the districts of Tuen Mun and Yuen Long.\n\nEducation \n\nEducation in Hong Kong is largely modelled after that of the United Kingdom, particularly the English system. Children are required to attend school from the age of six until completion of secondary education, generally at age 18. Mandatory education has contributed to an adult literacy rate of 95.7%. At the end of secondary schooling, a public examination is administered to all students, awarding the Hong Kong Diploma of Secondary Education on successful completion. Of residents aged 15 and older, 81.3% completed lower secondary schooling, 66.4% graduated from upper secondary, 31.6% attended a non-degree tertiary program, and 24% earned a bachelor's degree or higher.\n\nComprehensive schools fall under three categories: public schools, which are fully government-run; subsidised schools, including government aid-and-grant schools; and private schools, often those run by religious organisations and that base admissions on academic merit. These schools are subject to the curriculum guidelines as provided by the Education Bureau. Private schools subsidised under the Direct Subsidy Scheme and international schools fall outside of this system and may elect to use differing curricula and teach based on other languages.\n\nThe government maintains a policy of \"mother tongue instruction\", in which the medium of instruction is Cantonese, with written education in both Chinese and English. In secondary schools, \"biliterate and trilingual\" proficiency is emphasised, which has encouraged the proliferation of spoken Mandarin language education. The Programme for International Student Assessment ranked Hong Kong's education system as the second best in the world.\n\nHong Kong has ten universities within its territory. The University of Hong Kong was founded as the city's first institute of higher education during the early colonial period in 1911. The Chinese University of Hong Kong was established in 1963 to fill the need for a university that taught using Chinese as its primary language of instruction. Along with the Hong Kong University of Science and Technology and City University of Hong Kong, these universities are ranked among the best in Asia. In subsequent years, the Hong Kong Polytechnic University, Hong Kong Baptist University, Lingnan University, Education University of Hong Kong, Open University of Hong Kong, and Hong Kong Shue Yan University were established to meet growing demand for higher education. Competition among students for admission into undergraduate programmes is fierce, as the number of available placements remains limited. The city additionally has post-secondary institutes that provide an alternative path for tertiary education.\n\nHealth \n\nHealthcare in Hong Kong is mainly provided by the Hospital Authority, a government agency that administers the 42 public medical facilities in the territory. Treatment in the universal public system is highly subsidised and available to all residents, permanent and non-permanent, who have an identity card. While the statutory system fulfills the vast majority of medical service needs, private healthcare facilities provide more readily accessible and specialised care at higher cost, especially for individuals with non-resident status. Healthcare policy and provisioning is set by the Department of Health, which also directly supervises the 12 registered private hospital facilities.\n\nLife expectancy in Hong Kong is 81.3 years for males and 87.3 years for females , making it the highest in the world. The region also has one of the lowest infant mortality rates, at 1.5 per 1,000 births. Infants are generally well immunised against communicable diseases.\n\nCancer, pneumonia, heart disease, cerebrovascular disease, and severe injuries caused by accidents are the five leading causes of death in the territory. Obesity rates have increased sharply in the last decade; approximately 30 per cent of the population is obese and an additional 20 per cent is overweight. Adolescent pregnancy rates are comparatively lower than many developed nations. Official abortion rates are similarly low, but it is estimated that the number of people who seek termination is higher due to procedural barriers and costs.\n\nThe territorial healthcare system is separate from those serving mainland China and Macau. Individuals from those regions seeking medical services in Hong Kong are not entitled to publicly subsidised care intended for local residents, with the reverse being true as well. Stricter medical procedure standards, lower mortality rates, and the prospect of permanent residency have led expectant mothers from the mainland to travel to the city to give birth, straining capacity of local maternity wards. Macanese residents also often seek regular care in Hong Kong, due to a lack of developed healthcare infrastructure in Macau's physically limited area.\n\nCulture \n\nHong Kong is frequently described as a place where \"East meets West\", reflecting the cultural mix of the territory's Chinese roots with Western influence from its time as a British colony. Though the vast majority of the population is ethnically Chinese, the long period of colonial administration and sustained exposure to Western culture has resulted in a distinct cultural identity from that of mainland China. Mainstream culture in Hong Kong is an Eastern culture largely derived from immigrants originating from various parts of China, but influenced by British-style education, a separate political system, and the territory's status as a major port of trade.\n\nChinese immigrants after the Second World War fueled Hong Kong's economic growth in the post-war decades, creating the perception that residents enjoy high social mobility and a culture characterised by individual entrepreneurialism and a strong work ethic among those who arrived. As most incoming migrants from the mainland were fleeing economic hardship, people in Hong Kong today tend to tie self-image and decision-making to material benefits quite closely.\n\nConcepts like feng shui are taken very seriously, with expensive construction projects often hiring expert consultants, and are often believed to make or break a business. Other objects like Ba gua mirrors are still regularly used to deflect evil spirits, and buildings often lack any floor number that has a 4 in it, due to its similarity to the word for \"die\" in Cantonese. The fusion of east and west also characterises Hong Kong's cuisine, where dim sum, hot pot, and fast food restaurants coexist with haute cuisine.\n\nHong Kong is a recognized global centre of trade and calls itself an \"entertainment hub\". Its martial arts film genre gained a high level of popularity in the late 1960s and 1970s. Several Hollywood performers, notable actors and martial artists have originated from Hong Kong cinema, notably Bruce Lee, Jackie Chan, Chow Yun-fat, Michelle Yeoh, Maggie Cheung and Jet Li. A number of Hong Kong film-makers have achieved widespread fame in Hollywood, such as John Woo, Wong Kar-wai, and Stephen Chow. Homegrown films such as Chungking Express, Infernal Affairs, Shaolin Soccer, Rumble in the Bronx, In the Mood for Love and Echoes of the Rainbow have gained international recognition. Hong Kong is the centre for Cantopop music, which draws its influence from other forms of Chinese music and Western genres, and has a multinational fanbase.\n\nThe Hong Kong government supports cultural institutions such as the Hong Kong Heritage Museum, the Hong Kong Museum of Art, the Hong Kong Academy for Performing Arts, and the Hong Kong Philharmonic Orchestra. The government's Leisure and Cultural Services Department subsidises and sponsors international performers brought to Hong Kong. Many international cultural activities are organised by the government, consulates, and privately.\n\nSport \n\nDespite its small area, Hong Kong is home to a wide range of sports and recreational facilities. The city frequently sends regional teams to international competitions and was host to the 2009 East Asian Games, the equestrian events of the 2008 Summer Olympics, and the 2007 Premier League Asia Trophy. Hong Kong's steep terrain and extensive trail network with expansive views attracts hikers, and its rugged coastline provides many beaches for swimming. Major sporting venues in the territory have regularly hosted the Hong Kong Sevens, Hong Kong Marathon, Hong Kong Tennis Classic, and Lunar New Year Cup. Hong Kong was also the host city for the inaugural 1956 tournament of the AFC Asian Cup and the 1995 Dynasty Cup.\n\nDue to British colonial influence, Hong Kong had an earlier introduction to Western athletics compared to other East Asian regions. As part of the government's active involvement in promoting sports participation, the Tourism Board organised the first international dragon boat racing competition in 1976.\n\nHong Kong maintains territory-wide teams for participation in all international sporting events, and represents itself separately instead of as a part of Chinese national teams. The city has sent athletes to almost every Summer Olympics since 1952. As of 2017, Hong Kong has won 3 medals at the Olympic Games, 126 at the Paralympic Games, and 17 at the Commonwealth Games. No longer part of the Commonwealth of Nations, the city's last appearance at the Commonwealth Games was in 1994.\n\nMedia \n\nThe largest and dominant television broadcaster in the territory is TVB, which runs the largest commercial television production studio in Asia. Public broadcasting is operated by RTHK, operating seven radio channels and three television channels. Cable, satellite, and other premium content services cater to a variety of niche audiences. Local television productions reach audiences throughout Greater China and internationally in the Cantonese-speaking overseas Chinese diaspora.\n\nMagazine and newspaper publishers in Hong Kong distribute and print in both Chinese and English, with a focus on sensationalism and celebrity gossip. Unlike the government's public presence in broadcasting, newspaper publications in the territory are all privately owned. The largest Chinese-language newspapers by local circulation are the Headline Daily and Oriental Daily News. The most widely circulating English-language counterparts are the South China Morning Post, which is the publication of record for the territory, and The Standard.\n\nThe media in Hong Kong is relatively free from official interference compared to Mainland China, although the Far Eastern Economic Review pointed to signs of self-censorship by media whose owners have close ties to or business interests in the People's Republic of China and states that even Western media outlets are not immune to growing Chinese economic power.\n\nNotable people",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hong Kong" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13404" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hong Kong (,), officially the Hong Kong Special Administrative Region of the People's Republic of China, is an autonomous territory on the eastern side of the Pearl River estuary in East Asia, south of the mainland Chinese province of Guangdong, and east of the special administrative region of Macau. With over 7.3 million Hongkongers of various nationalities in a territory of 1,104 km2, Hong Kong is the fourth-most densely populated region in the world.\n\nHong Kong was formerly a colony of the British Empire, after the perpetual cession of Hong Kong Island from Qing China at the conclusion of the First Opium War in 1842. The colony expanded to the Kowloon Peninsula in 1860 after the Second Opium War, and was further extended when Britain acquired a 99-year lease of the New Territories starting in 1898. The Empire of Japan attacked the city as part of a greater offensive against the Allied Powers at the start of the Pacific War and held it under military occupation for the duration of the war, until the British resumed control of the colony in 1945. The entire territory, including ceded areas, was returned to China under the framework of the Sino-British Joint Declaration, signed by the United Kingdom and China in 1984 and marked with the transfer of sovereignty over Hong Kong at the end of the New Territories lease in 1997, when it became a special administrative region of the People's Republic of China.\n\nUnder the principle of \"one country, two systems\", Hong Kong maintains a separate political and economic system apart from China. Except in military defence and foreign affairs, Hong Kong retains independent executive, legislative, and judiciary powers. Nevertheless, the territory does directly develop relations with foreign states and international organizations in a broad range of \"appropriate fields\", being actively and independently involved in institutions such as the Asia-Pacific Economic Cooperation forum and the World Trade Organization.\n\nHong Kong is one of the most significant global financial centres, holding the highest Financial Development Index score and consistently ranking as the most competitive and freest economic area in the world. As the world's seventh-largest trading entity, its legal tender, the Hong Kong dollar, is the 13th-most traded currency. Hong Kong's tertiary sector dominated economy is characterised by competitive simple taxation and supported by its independent judiciary system. Although the city boasts one of the highest per capita incomes in the world, it suffers from severe income inequality.\n\nThe territory features the most skyscrapers in the world, surrounding Victoria Harbour, which lies in the centre of the city's dense urban region. It has a very high Human Development Index ranking and the world's longest life expectancy. Over 90% of its population makes use of well-developed public transportation. Along with Macau, Guangzhou, Shenzhen, Zhuhai, and several other major cities in Guangdong, Hong Kong forms a core part of the Pearl River Delta metropolitan region, one of the most populated areas in the world. Seasonal air pollution originating from neighbouring industrial areas of mainland China, which adopts loose emissions standards, has resulted in a high level of atmospheric particulates in winter.\n\nEtymology \n\nThe name Hong Kong originally referred to a small inlet between Aberdeen Island and the southern coast of Hong Kong Island. The town of Aberdeen was an initial point of contact between British sailors and local fishermen. The source of the romanised name is not known, but it is generally believed to be an early imprecise phonetic rendering of the spoken Cantonese pronunciation of  (), which means \"Fragrant Harbour\" or \"Incense Harbour\". Fragrance may refer to the sweet taste of the harbour's fresh water influx from the Pearl River estuary or to the incense from factories lining the coast of northern Kowloon. The incense was stored near Aberdeen Harbour for export before Victoria Harbour was developed. Another theory is that the name originates from the Tanka, early inhabitants of the region; it is equally probable that a romanisation of the name in their dialect was used (i.e. hōng, not hēung in Cantonese). Regardless of origin, the name was recorded in the Treaty of Nanking to encompass all of Hong Kong Island, and has been used to refer to the territory in its entirety ever since.\n\nThe name had often been written as the single word Hongkong until the government adopted the current form in 1926. Nevertheless, a number of institutions founded during the early colonial era still retain the single-word form, such as the Hongkong Post, Hongkong Electric, and the Hongkong and Shanghai Banking Corporation.\n\nHistory \n\nPrehistory \n\nArchaeological studies support human presence in the Chek Lap Kok area from 35,000 to 39,000 years ago and on Sai Kung Peninsula from 6,000 years ago. Wong Tei Tung and Three Fathoms Cove are the earliest sites of human habitation in Hong Kong during the Paleolithic Period. It is believed that the Three Fathom Cove was a river-valley settlement and Wong Tei Tung was a lithic manufacturing site. Excavated Neolithic artefacts suggested cultural differences from the Longshan culture of northern China and settlement by the Che people, prior to the migration of the Baiyue to Hong Kong. Eight petroglyphs dated to the Shang Dynasty were discovered on the surrounding islands.\n\nImperial China \n\nIn 214 BC, the Qin dynasty conquered the Baiyue tribes in Jiaozhi (modern-day Liangguang region and Vietnam) and incorporated the area of Hong Kong into China for the first time. After a brief period of centralisation and subsequent collapse of the Qin dynasty, the area of Hong Kong was consolidated under the Nanyue kingdom, founded by general Zhao Tuo in 204 BC. After the Han conquered Nanyue in 111 BC, Hong Kong was assigned to the Jiaozhi commandery. Archaeological evidence indicates an increase of population and expansion of salt production. The Lei Cheng Uk Han Tomb on the Kowloon Peninsula is believed to have been built as a burial site during the Han dynasty.\n\nDuring the Tang dynasty, the Guangdong region flourished as an international trading centre. A military stronghold was established in Tuen Mun to strengthen defence of the coastal area. Lantau Island was a salt production centre and smuggler riots occasionally broke out against the government. The first village school, Li Ying College, was established around 1075 in the modern-day New Territories by the Song dynasty. During their war against the Mongols, the Southern Song court was briefly stationed at modern-day Kowloon City (the Sung Wong Toi site) before their ultimate defeat at the Battle of Yamen in 1279.\n\nThe earliest European visitor on record was Jorge Álvares, a Portuguese explorer, who arrived in 1513. Having established a settlement in a site they called \"Tamão\" in Hong Kong waters, Portuguese merchants began regularly trading in southern China. However, subsequent military clashes between China and Portugal led to the expulsion of all Portuguese merchants in the 1520s. The Portuguese were able to reestablish trade relations by 1549 with annual trade missions sent to Shangchuan Island and acquired a land lease from Ming authorities in 1557 to establish a permanent trade outpost at Macau.\n\nAfter the Qing conquest, Hong Kong was directly affected by the Great Clearance, an imperial decree that ordered the evacuation of coastal areas of Guangdong from 1661 to 1669 as part of the new dynasty's efforts against Ming loyalist rebels in southern China. Over 16,000 inhabitants of Xin'an County, which included Hong Kong, were forced to migrate inland; only 1,648 of those who had evacuated returned in subsequent years.\nWith frequent pirate attacks and ever increasing incursions by European explorers, forts were constructed at Tung Chung and the Kowloon Walled City to guard the region.\n\nThough maritime trade had previously been banned, after repopulation of the coast and final defeat of all rebels with Ming sympathies, the Kangxi Emperor lifted the trade prohibition in 1684 and allowed foreigners to enter Chinese ports. Trade with Europeans was more strictly regulated and became concentrated in the Pearl River Delta after establishment of the Canton System in 1757, which forbade non-Russian ships from northern Chinese ports and forced all commerce to be conducted solely in the port of Canton, just north of Hong Kong. While European demand for Chinese commodities like tea, silk, and porcelain was high, Chinese interest in European manufactured goods was comparatively negligible, creating a large trade imbalance between Qing China and Great Britain. To counter this deficit, the British began to sell increasingly large volumes of Indian opium to China. Faced with a drug addiction crisis, Chinese officials pursued ever more aggressive actions in an attempt to halt the opium trade.\n\nBritish colony \n\nIn 1839, the Daoguang Emperor, having rejected proposals to legalise and tax opium, tasked Imperial Commissioner Lin Zexu with eradicating the opium trade. Lin ordered the confiscation and destruction of all opium stockpiles in Canton and a general blockade of foreign trade. The British objected to the sudden seizure, especially without monetary compensation for the seized product, and dispatched an expeditionary force to China, starting the First Opium War. After British victory in the Second Battle of Chuenpi, the Qing initially admitted defeat. As part of a ceasefire agreement between Captain Charles Elliot and Qishan, Viceroy of Liangguang, Hong Kong Island was declared to be ceded under the Convention of Chuenpi. British forces took formal possession of the island on 26 January 1841. However, disputes between high-ranking officials of both countries led to the failure of the treaty's ratification. After more than another year of further hostilities, Hong Kong Island was formally ceded in perpetuity to the United Kingdom under the terms of the Treaty of Nanking on 29 August 1842. The British officially established a Crown colony and founded the City of Victoria in the following year.\n\nThe population of Hong Kong Island was 7,450 when the Union Jack was raised over Possession Point on 26 January 1841. It mostly consisted of Tanka fishermen and Hakka charcoal burners, whose settlements scattered along several coastal hamlets. In the 1850s, a large number of Chinese refugees crossed the open border fleeing from the Taiping Rebellion. Other natural disasters, such as flooding, typhoons, and famine in mainland China would play a role in establishing Hong Kong as a place for safe shelter.John Thomson 1837–1921,[http://irc.aa.tufs.ac.jp/thomson/vol_1/mother/102.html Chap on Hong Kong], Illustrations of China and Its People (London,1873–1874)Info Gov HK. \"[http://www.info.gov.hk/police/hkp-text/english/history/history_01.htm Hong Kong Gov Info] .\" History of Hong Kong. Retrieved on 16 February 2007. Further conflicts over the opium trade between the British and Qing quickly escalated into the Second Opium War. Following the Anglo-French victory, the colony was expanded to include Kowloon Peninsula south of present-day Boundary Street and Stonecutter's Island, both of which were ceded to the British in perpetuity under the Convention of Beijing in 1860. The colony was expanded further in 1898, when Britain obtained a 99-year lease of additional territory from the Qing under the Convention for the Extension of Hong Kong Territory; Lantau Island, the remainder of Kowloon north of Boundary Street, further territory beyond Kowloon up to the Sham Chun River, and over 200 other outlying islands were given over to British control.\n\nHong Kong soon became a major entrepôt thanks to its free port status, attracting new immigrants from both China and Europe. However, the population remained racially divided and polarised under early British colonial policies. Despite the rise of a British-educated Chinese upper class by the late 19th century, zoning laws prevented ethnic Chinese from acquiring property in reserved areas. Though enacted ostensibly to address health concerns of European residents, the Peak Reservation Ordinance and other similar pieces of legislation enforced a system of residential zoning that racially segregated the population of the colony, creating exclusive communities of Europeans in areas like Victoria Peak and Cheung Chau. At this time, the majority of the Chinese population in Hong Kong had no political representation in the British colonial government. The British governors did rely, however, on a small number of Chinese elites, including Sir Kai Ho and Robert Hotung, who served as ambassadors and mediators between the government and local population. Chinese appointments to the Legislative Council and Executive Council were not made until 1880 and 1926, with Wu Tingfang and Shouson Chow serving as the first members of the colony's ethnic majority on the respective chambers.\n\nThe colony continued to experience modest growth during the first half of the 20th century. The University of Hong Kong was established in 1911 as the territory's first higher education institute. During the First World War, many Chinese residents left the city, fearing a German attack on the colony. Hong Kong ultimately remained unscathed and continued growing; its population increased from 530,000 in 1916 to 725,000 in 1925 and reached 1.6 million by 1941. Kai Tak Airport entered operation in 1925 and the colony was able to avoid a prolonged economic downturn after the Canton–Hong Kong strike ended, which had last for more than a year from 1925 through 1926.. At the outbreak of the Second Sino-Japanese War in 1937, when the Empire of Japan invaded China from its protectorate in Manchuria, Governor Geoffry Northcote declared the colony a neutral zone to safeguard Hong Kong's status as a free port.\n\nJapanese military occupation \n\nOn 8 December 1941, the same morning as the attack on Pearl Harbor, the Imperial Japanese Army moved south from Guangzhou and crossed the Sham Chun River to attack Hong Kong as part of a coordinated military offensive against the Allied Powers. The Battle of Hong Kong lasted for 17 days, through which British, Canadian, Indian, and local colonial units defended Hong Kong. By the fifth day, Commonwealth troops, under heavy artillery and aerial bombardment, had been forced to abandon their positions in Kowloon and retreated to Hong Kong Island. With the remaining troops unable to further mount an effective defence, Governor Young surrendered the colony on Christmas Day. This day is remembered by locals as \"Black Christmas\".\n\nDuring the occupation, the garrisoned Japanese soldiers committed many atrocities against both civilians and prisoners of war, including the St. Stephen's College massacre. Local residents suffered widespread food shortages, strict rationing, and hyperinflation arising from the forced exchange of currency from Hong Kong dollars to Japanese military yen. Widespread starvation and forced deportation of residents to mainland China for use as slave labour drastically reduced the population of the city from 1.6 million in 1941 to 600,000 in 1945. Some residents were able to flee to nearby Macau, which was comparatively untouched by the Japanese as a colony of neutral Portugal, with a few of these refugees further managing to find passage from there to Allied territory. Britain resumed control of the colony shortly after the surrender of Japan, on 30 August 1945, after almost four years of occupation.\n\nPost-war industrialisation \n\nHong Kong's population recovered quickly after the war, as a wave of skilled migrants from the Republic of China sought refuge from the Chinese Civil War in a territory neutral to the conflict. When the Communist Party took full control of mainland China in 1949, even more refugees fled across the open border in fear of persecution. Many newcomers, especially those who had been based in the major port cities of Shanghai and Guangzhou, established corporations and small- to medium-sized businesses and shifted their base operations to British Hong Kong. The establishment of the People's Republic of China caused the British colonial government to reconsider Hong Kong's open border to mainland China. In 1951, a boundary zone was demarked as a buffer zone against potential military attacks from communist China. Border posts along the north of Hong Kong began operation in 1953 to regulate the movement of people and goods into and out of the territory.\n\nIn the 1950s, Hong Kong became the first of the Four Asian Tiger economies that was undergoing rapid industrialisation driven by textile exports, manufacturing industries, and re-exports of goods to China. As the population grew, with labour costs remaining low, living standards began to rise steadily. The construction of the Shek Kip Mei Estate in 1953 marked the beginning of the public housing estate programme, which provided shelter for the less privileged and helped cope with the continuing influx of immigrants.\n\nUnder Governor Murray MacLehose, the government began a series of reforms to improve the quality of infrastructure and public services through the 1970s. Systemic corruption in the uniformed services had crippled trust in the government; MacLehose established the ICAC, an independent security service under the direct authority of the Governor, to restore the integrity of the civil service. Chinese was recognised as an official language during his tenure, accelerating the process of localisation in the government, slowly handing key official posts long held only by British members of the government over to local ethnic Chinese people. To alleviate road traffic congestion and provide a more reliable means of crossing the Victoria Harbour, the Mass Transit Railway was constructed and began operations of its first line in 1979. The Island Line, Kwun Tong Line, and Tsuen Wan Line all opened in the early 1980s, connecting Hong Kong Island, Kowloon, and parts of the New Territories to a single transport system.Forsyth, Neil, dir. Underground Pride. Mass Transit Railway Corporation, 1990. Film. 21 November 2013 MacLehose was the longest-serving colonial governor and, by the end of his governorship, had become one of the most popular and well-known figures in the territory. MacLehose laid the foundation for Hong Kong to establish itself as a key global city in the 1980s and early 1990s.\n\nSince 1983, the value of the Hong Kong dollar has been pegged to that of the United States dollar. The territory's competitiveness in manufacturing gradually declined due to rising labour and property costs, as well as new industrial capacity developed in southern China under the Open Door Policy, which was introduced in 1978. Nevertheless, by the early 1990s, Hong Kong had established itself as a global financial centre, a regional hub for logistics and freight, one of the fastest-growing economies in Asia, and the world's exemplar of laissez-faire market policy.\n\nThe Hong Kong issue \n\nIn 1971, China's permanent seat on the United Nations Security Council was transferred from the Republic of China, which had evacuated to Taiwan at the conclusion of the Chinese Civil War, to the People's Republic of China. Hong Kong was soon after removed from the organisation's list of non-self-governing territories, at the request of the PRC. Facing an uncertain future for the colony and the expiration of the New Territories lease beyond 1997, Governor MacLehose raised the question of Hong Kong's status with Deng Xiaoping in 1979.\n\nDiplomatic negotiations with China resulted in the Sino-British Joint Declaration in 1984. The United Kingdom agreed to transfer to China the entirety of the colony, including the perpetually ceded areas of Hong Kong Island and Kowloon Peninsula, at the conclusion of the 99-year New Territories lease in 1997. Hong Kong would then become a special administrative region governed separately from the mainland, retaining its free-market economy, common law judicial system, independent representation in international organisations, treaty arrangements, and self-governance in all areas except foreign diplomacy and military defence. The treaty further stipulated that the territory would be guaranteed a high degree of autonomy for 50 years after the transfer, with the Basic Law of Hong Kong serving as its constitutional document.\n\nUnder the terms of the Second Convention of Peking, the colony was expanded out to the New Territories, but the treaty did not include a small military outpost over which the Kowloon Walled City would later be built. After the end of Japanese occupation, thousands of refugees fleeing from the mainland during the Chinese Civil War made their way to the Walled City and became squatters occupying this parcel of land where China was technically still the sovereign power. Over the following decades, the population of this  area dramatically increased, reaching 33,000 by 1987, making the Walled City the most densely populated area in the world at its peak. Despite widespread illegal activity and unsanitary living conditions, the British largely took a 'hands-off' approach with regard to the Walled City due to the area's muddled territorial status and to avoid confrontation with the mainland authority. The Joint Declaration laid the groundwork for bilateral co-operation concerning any Hong Kong-related issues, including the fate of the former military fort. The Chinese government acquiesced to the demolition of the settlement in 1987. The structure was cleared away in 1994 and the area converted into the Kowloon Walled City Park.\n\nThe signing of the Joint Declaration and impending retrocession of the colony to China triggered a wave of mass migration. Residents during the transitional period were apprehensive about life after the transfer of sovereignty and were fearful of a curbing of civil rights and individual liberties, erosion of the integrity of the legal system, and an overall reduction in quality of life post-handover. Although colonial residents were British subjects, Parliament denied Hongkongers the right of abode in Britain. Emigrants left with the goal of obtaining residency or citizenship in Western countries, such as the United States, Canada, and Australia. Over half a million people in total left the territory during the peak migration period from 1987 until 1996.\n\nIn preparation for the transfer of sovereignty, the colonial administration implemented a series of electoral reforms that gradually introduced elected seats to the then-fully appointed Legislative Council. Indirectly elected functional constituency seats were introduced in 1985 and directly elected geographical constituency seats in 1991. However, following the Tiananmen Square protests of 1989, both the British and colonial governments were under intensified pressure to allow a faster pace of democratisation. The outflow of emigrants rapidly accelerated, increasing from around 20,000 people per year throughout most of the 1980s to over 66,000 in 1992. Governor Chris Patten proposed further reforms that broadly expanded the electorate to enable a fully elected legislature in 1995. The mainland authority considered these changes to be incompatible with the Basic Law and created a parallel Provisional Legislative Council that would assume legislative powers after the transfer of sovereignty.\n\nTransfer of sovereignty \n\nOn 1 July 1997, sovereignty over Hong Kong was officially transferred from the United Kingdom to the People's Republic of China, marking the end of 156 years of British colonial rule. As Britain's last major and most populous remaining colony, the handover effectively represented the end of the British Empire. Exactly at midnight, all government organisations with royal patronage simultaneously dropped the Royal prefix from their titles and any regalia with references to the Crown were replaced with insignia bearing the Bauhinia. After the handover ceremony, Chris Patten, the last Governor of Hong Kong, together with Prince Charles, departed the city on board the Royal Yacht Britannia. Tung Chee-hwa was then sworn in as the first Chief Executive of Hong Kong, with President Jiang Zemin administering the oath of office. The following morning, the Hong Kong Garrison of the People's Liberation Army entered the city and assumed control of the territory's military bases.\n\nSpecial administrative region \n\nAlmost immediately after the transfer of sovereignty, Hong Kong's economy was severely affected by the Asian financial crisis and further depressed by the outbreak of the H5N1 strain of avian flu. Financial Secretary Donald Tsang used the substantial territorial foreign currency reserves to maintain the Hong Kong dollar's currency peg and spent over HK$120 billion on significant holdings of major Hong Kong companies to prevent a general market collapse. While complete disaster was averted, Chief Executive Tung's housing policy of building 85,000 subsidised flats a year triggered a housing market crisis in 1998, depressing property prices and causing some homeowners to become bankrupt. Hong Kong was again gravely affected by the outbreak of severe acute respiratory syndrome (SARS) in 2003. In total, 1,755 people were infected, with 299 fatalities. Economic activities slowed and schools were closed for weeks at the height of the epidemic. An estimated HK$380 million (US$48.9 million) in contracts were lost as a result of the epidemic. While Hong Kong was also severely affected by the global recession of the late 2000s, the Tsang government introduced a series of economic stimulus measures prevented a prolonged recession.\n\nInfrastructure post-handover has been rapidly developed, with major transport links continuing to be planned and constructed. The Rose Garden Project, which began under British administration, to construct a new international airport was completed in 1998 and operations began at the new site during the same year. The Ngong Ping Cable Car, West Kowloon Cultural District, multiple new railway lines, and additional cross-harbour tunnels were all completed in the first 20 years of territorial self-governance. Direct infrastructure links with mainland China are also being actively developed, with both the Hong Kong–Zhuhai–Macau Bridge and Hong Kong section of the national high-speed railway currently under construction. Construction of the rail link generated a high level of controversy surrounding the demolition of key landmarks and displacement of residents along the planned route.\n\nPolitical debates have centred themselves predominately on issues surrounding electoral reform and Hong Kong's jurisdictional independence from the central government. Following the handover, democratic reform of the Legislative Council was immediately terminated and the government attempted to legislate sweeping national security legislation pursuant to Article 23 of the Basic Law. Coupled with years of economic hardships and discontent of Chief Executive Tung's pro-Beijing stance, over 500,000 people demonstrated against the government, which eventually led to Tung's resignation in 2005. Further proposals by the government to introduce a national education curriculum and nominee pre-screening before allowing Chief Executive elections triggered a number of mass protests in 2014, collectively known as the Umbrella Revolution.\n\nViolent attacks on journalists, an increasing level of press self-censorship, alleged extraterritorial abduction of anti-China publishers, and covert intervention into Hong Kong's educational, political, and independent institutions have posed challenges to the policy of one country, two systems. In the 2016 legislative election, there were reports of discrepancies in the electorate registry, which contained ghost registrations across constituencies, as well as political intervention to strip pro-independence individuals of their right to stand in elections and alleged death threats to election candidates. Social divisiveness on ethnic identity heightened markedly during Leung's term, especially among younger members of the population. An ongoing University of Hong Kong study found that 69.7% of those aged 18 to 29 considered themselves as Hongkongers, while only 0.3% identified as Chinese; at the end of 2011, before the start of Leung's tenure as Chief Executive, ethnic identity polling for that demographic measured 42.4% and 11.8%, respectively.\n\nGovernment and politics \n\nHong Kong is a special administrative region of China, maintaining a separate legislature, executive, and judiciary from the rest of the country. It has an executive-led parliamentary government modelled after the Westminster system, inheriting this from British colonial administration. The Sino-British Joint Declaration guarantees the territory's capitalist economic system and autonomous system of government for 50 years after the transfer of sovereignty. Under this framework and the concept of \"one country, two systems\", the Basic Law of Hong Kong is the regional constitutional document, establishing the structure and responsibility of the government.\n\nThe head of government is the Chief Executive, who is selected for a once-renewable five-year term by the Election Committee, a 1,200-member nominating body composed of prominent corporate, community, and government leaders. The central government provides oversight for the regional government; final interpretative power of the Basic Law rests with the Standing Committee of the National People's Congress and the Chief Executive is formally appointed by the State Council after nomination by the aforementioned Election Committee. Responsibility for foreign and military affairs is also assumed by the central authority.\n\nThe Legislative Council is a unicameral legislature with 70 members, consisting of 35 directly elected members apportioned to geographical constituencies, 30 members representing professional or special interest groups formed as functional constituencies, and 5 members nominated by members of the District Councils and selected in territory-wide elections. Legislators are elected using multiple different voting systems, determined by whichever constituency a particular seat is representing. All directly elected seats are filled using a proportional representative system, while functional constituencies other than the all-territory District Council constituency choose their councillors using first-past-the-post or instant-runoff voting.\n\nGovernment policy is determined by the Executive Council, a body of advisors appointed by the Chief Executive with the authority to issue delegated legislation and proposes new bills to the legislature for debate and promulgation. Direct administration is managed by the Civil Service, an apolitical bureaucracy that ensures positive implementation of policy. Hong Kong is nationally represented by 36 deputies in the National People's Congress chosen through an electoral college and 203 delegates in the Chinese People's Political Consultative Conference appointed by the central government.\n\n22 political parties had representatives elected to the Legislative Council in the 2016 election. These parties have aligned themselves into three ideological groups: the  pro-Beijing camp who form the current government, the pro-democracy camp, and localist groups. The Communist Party does not have an official political presence in Hong Kong and its members do not run in local elections.\n\nThe Monetary Authority is the currency board and de facto central bank of the territory. It is responsible for regulation of the Hong Kong dollar and, along with HSBC, Standard Chartered Hong Kong, and the Bank of China, issues currency in the form of banknotes. Coinage is solely minted by the Monetary Authority.\n\nLegal system and judiciary \n\nThe judicial system is derived from the common law system of English law, and was created at the establishment of the territory as a British colony. Chinese national law does not generally apply in the region, and Hong Kong is treated as an independent jurisdiction. The Court of Final Appeal is the territory's highest court, exercising final adjudication over interpretation of laws and has the power to strike down statutes and legislation inconsistent with the Basic Law. It is led by the Chief Justice and consists of three additional permanent judges and one non-permanent seat filled on a rotating basis by both local judges and those invited from overseas common law jurisdictions. However, authoritative interpretative power over the Basic Law itself instead lies with the Standing Committee of the National People's Congress. Judges on all courts are appointed by the Chief Executive on the recommendation of an independent commission. As a common law jurisdiction, Hong Kong courts may refer to precedents set in English law and Commonwealth judicial rulings.\n\nThe Department of Justice is responsible for handling legal matters on behalf of the government. Its responsibilities include providing legal advice, criminal prosecution, civil representation, legal and policy drafting and reform, and international judicial co-operation between different jurisdictions. Apart from prosecuting criminal cases, lawyers of the Department of Justice represent the government in any civil and administrative lawsuits against the administration. The department may call for judicial review of government action or legislation and may intervene in cases that may involve the greater public interest. The Basic Law protects the Department of Justice from interference by the government when exercising its control over criminal prosecution. Law enforcement is a responsibility of the Security Bureau and the Hong Kong Police, with agencies like the Customs and Excise Department and Immigration Department handling more specialised tasks.\n\nGreater China relations \n\nThe Constitutional and Mainland Affairs Bureau is responsible for co-ordinating with the central government on issues related to the implementation and interpretation of the Basic Law, electoral matters, and bilateral economic and legal co-operative efforts. Because national law does not automatically apply in the territory, the two governments periodically negotiate formal agreements that cover a range of issues, including cross-boundary trade, law enforcement co-operation, environmental protection, shipping logistics, among other fields. The Liaison Office is the mainland authority's corresponding representative and co-operative body in the region and maintains an extensive network of relations with local commercial, educational, and cultural organisations in addition to its government functions.\n\nThe Closer Partnership Economic Arrangement formalised a policy of free trade between Hong Kong and the mainland, with each government committing to reduce regulations concerning cross-boundary trade and investments. The agreement forms the basis for further integration between the two regions, with supplements concerning more areas of co-operation added to the arrangement almost every year since its signing. A similar economic partnership arrangement with Macau also details liberalisation of trade and deregulation of the movement of goods and services between the two special administrative regions. Cross-strait relations with Taiwan falls under the purview of the Hong Kong–Taiwan Economic and Cultural Co-operation and Promotion Council.\n\nAn area where the jurisdictional independence of the territory is most apparent is its immigration policy. The Immigration Department issues distinct passports for permanent residents different from those of the mainland or Macau. The region maintains a regulated border with the mainland and all travellers between Hong Kong and both China and Macau, regardless of nationality or residency, must pass through border controls.\n\nForeign relations \n\nResponsibility for diplomatic affairs is assumed by the central government and the Ministry of Foreign Affairs, but Hong Kong retains the ability to enter into international agreements in commercial, economic, and other appropriate fields defined by the Basic Law. Under the name \"Hong Kong, China\", the territory co-operates with foreign nations in international organisations, such as the World Trade Organization, the Asia-Pacific Economic Cooperation forum, and the International Olympic Committee. Although not a member of the United Nations as the territory is not a sovereign nation, Hong Kong actively participates in the organisation's agencies and is party to many of its international agreements.\n\nThough no longer administering the territory after the transfer of sovereignty, the United Kingdom maintains strong ties with Hong Kong. Hundreds of British corporations maintain offices or their regional headquarters in the territory, and both parties collaborate on a number of economic and bilateral agreements. Hong Kong regularly invites British and Commonwealth judges to sit on the Court of Final Appeal, and its universities remain involved in the Association of Commonwealth Universities. As a party to the Sino-British Joint Declaration, the United Kingdom is obligated to ensure proper implementation of the treaty; the Foreign Secretary gives biannual reports to Parliament on the status of Hong Kong.\n\n123 countries maintain consular missions in Hong Kong, as well as major supranational organizations, including the European Union. A number of consulates-general, such as those of the United States and United Kingdom, operate independently of their corresponding embassies in Beijing, extend their areas of jurisdiction beyond Hong Kong to include Macau, are headed by officials with ambassadorial rank, and report directly to their respective foreign offices.Chapter 1, Hong Kong Year Book 2011 The regional government itself maintains trade offices for conducting external commercial relations throughout Greater China and in foreign countries.\n\nRegional and administrative divisions \n\nHong Kong consists of three geographical regions, divided by their historical time of acquisition by the United Kingdom: Hong Kong Island, Kowloon, and the New Territories. The city of Victoria, the first urban settlement in the territory, was established on Hong Kong Island, and its area is analogous to present-day Central and Western District.\n\nThe territory is administratively divided into 18 districts. Each district is represented by a District Council, which advises the government on local issues such as the provisioning of public facilities, maintenance of community programmes, promotion of cultural activities, and improvement of environmental policies. There are a total of 458 seats in the District Councils, 431 of which are directly elected while the remaining 27 are filled by ex officio members consisting of rural committee chairmen, representing villages and towns of outlying areas of the New Territories. The Home Affairs Department communicates government policies and plans to the public through the district offices. Local administration of municipal services was previously delegated to the Urban Council in Kowloon and Hong Kong Island and to the Regional Council in the New Territories, until they were abolished in 1999.\n\nElectoral and political reforms\n\nAlthough the Basic Law lays the foundation for the regional government, some of its articles require more specific legislation to be adopted before implementation. Article 23 provides for laws that prohibit treason and subversion in the territory, and a bill was drafted pursuant to this constitutional requirement. The government dropped this proposal after fierce opposition and protests against its perceived potential to restrict freedom of information.\n\nArticles 45 and 68 state that the ultimate goal is for both the Chief Executive and all members of the Legislative Council to be selected by universal suffrage. While the legislature is now partially directly elected, the executive continues to be selected by means other than direct election. From its establishment as a colony, Hong Kong has not had a fully representative democratic government. Colonial administration prior to the Second World War largely excluded Chinese representation. When Hong Kong was a British territory, the executive was embodied by the Sovereign, who appointed and was personally represented by the Governor. The Legislative Council initially consisted exclusively of appointed white British members, with its first Chinese member not joining the chamber until 1880. After the end of Japanese occupation and the resumption of British control, amidst the greater movement of global decolonisation, the government seriously considered constitutional reform in Hong Kong; this was ultimately shelved due to fears of government infiltration by communist sympathisers after their victory at the conclusion of the Chinese Civil War.\n\nAfter negotiation of the Sino-British Joint Declaration, the Legislative Council was reformed from an assembly consisting solely of government officials and appointed members to include indirectly elected functional constituency seats in 1985 and directly elected seats in 1991. Electoral reform introduced in 1994 greatly expanded the electorate for functional constituencies, effectively making them representative. However, the legislature was abolished after the handover and replaced with an interim Provisional Legislative Council, before new elections in 1998 were held under a selection system similar to what was used prior to the last colonial era reforms.\n\nElectoral reform continues to be a contentious issue after the transfer of sovereignty. The government faces ongoing calls to introduce direct election of the Chief Executive and all Legislative Council members. These efforts have been partially successful; the Election Committee no longer selects a portion of the Legislative Council and was slightly expanded from 800 to 1,200 members, and the number of legislature seats was increased from 60 to 70. A central government decision in 2014 to require Chief Executive candidates to be pre-screened as part of a reform package to introduce universal suffrage incited large-scale protests demanding a more open process. The proposal was later rejected by the legislature and the executive selection process remains unchanged.\n\nSociopolitical issues and human rights \n\nThe Basic Law establishes a series of fundamental rights for every resident of Hong Kong. Though the regional government generally observes these guarantees, the central government has been increasingly perceived to be encroaching on the autonomy of the territory.\n\nThe Standing Committee of the National People's Congress holds final interpretative power over the Basic Law, and use of it can override any regional judicial process. After the 2016 legislative elections, six incoming Legislative Council members took their oaths of office improperly. The Standing Committee subsequently issued a new interpretation of the Basic Law article regarding assumption of office, preempting a territorial judicial review and allowing the High Court to disqualify the legislators. Judicial independence was also questioned after the disappearance of five staff members of a Causeway Bay bookstore that was known to sell literary material prohibited in the mainland. Their possible abduction and rendition by Chinese public security bureau officials would represent a breach of the Sino-British Joint Declaration, violating the guarantee of regional autonomy; mainland authorities do not have extraterritorial jurisdiction to enforce national laws.\n\nFreedom of the press since the handover have been threatened by incidents of physical violence against journalists and as news media organisations are pressured not to publish stories that portray the central government in a negative way. News media has been increasingly prone to self-censorship, as publication owners expand business interests on the mainland or media organisations become acquired by Chinese corporations. The police have been accused of using excessive force against protesters at public rallies and overtly barring demonstrators from free assembly.\n\nEthnic minorities, excluding those of European ancestry, have marginal representation in government and are often discriminated against while seeking housing, education, and employment opportunities. While legislation prohibits discrimination based on age, sex, and disability, it specifically excludes migrant workers, along with immigrants and mainland Chinese. Employment vacancies and public service appointments frequently have language requirements, which minority job seekers frequently fail to meet, while language education resources remain inadequate for Chinese learners. In recent years, residents of a minority ethnicity have been more frequently placed on government advisory committees to address racial issues.\n\nForeign domestic helpers, predominately women from the Philippines and Indonesia, have little protection under territorial law. Although residing and working in Hong Kong, workers of this class are not treated as ordinarily resident, barring them from eligibility for right of abode. Domestic helpers are required to live in the residence of the employer and must leave Hong Kong within two weeks on termination of an employment contract or face deportation. Additionally, the Immigration Department does not renew visas for workers who change employers more than three times in a single year. Legislation offers nominal protection for migrant workers, but the legal process for recourse is time-consuming and costly, potentially taking 15 months for cases to be heard in the District Court or Labour Tribunal. The culmulative effect of these policies and legislation leaves foreign domestic helpers vulnerable to exploitation and abuse by employers and greatly restricts their labour mobility.\n\nMilitary \n\nThe President of China holds the title of Chairman of the Central Military Commission, making him supreme commander of the nation's armed forces. Under the Basic Law, responsibility for the defence of Hong Kong is assumed by the central government. The Hong Kong Garrison of the People's Liberation Army is stationed in the territory and is headquartered at the Chinese People's Liberation Army Forces Hong Kong Building in Central. 6,000 active duty servicemen serve as part of the garrison. The Basic Law also protects civilians and civil affairs against interference by the garrison. Military personnel are subject to both national and Hong Kong laws while serving in the territory. Under exceptional circumstances, the regional government may ask the central government for assistance from the garrison in disaster relief.\n\nResidents of Hong Kong are not required to perform military service. Current law has no provision for enlistment of local residents, meaning that the military force defending the territory is composed entirely of personnel originating outside of Hong Kong. As responsibility for the defence of Hong Kong rests solely with the central authority, the regional government is not obligated to bear the expenditures of the garrison stationed in the city. During the colonial era, territorial defence was the responsibility of the British Forces Overseas Hong Kong, supplemented by local militia organized as the Royal Hong Kong Regiment. The only military-affiliated organisation that recruits local residents is the Hong Kong Army Cadets Association, a uniformed youth organisation of children aged 6 and older sponsored by the People's Liberation Army.\n\nGeography \n\nHong Kong is located on China's south coast, 60 km east of Macau on the opposite side of the Pearl River Delta. It is surrounded by the South China Sea on the east, south, and west, and borders the Guangdong city of Shenzhen to the north over the Sham Chun River. The territory's 2755 km2 area consists of Hong Kong Island, the Kowloon Peninsula, the New Territories, and over 200 offshore islands, of which the largest is Lantau Island. Of the total area, 1106 km2 is land and 1649 km2 is water. Hong Kong claims territorial waters to a distance of 3 nmi. Its land area makes Hong Kong the 167th largest inhabited territory in the world.\n\nAs much of Hong Kong's terrain is hilly to mountainous with steep slopes, less than 25% of the territory's landmass is developed, while the majority is grassland, woodland, shrubland, and agricultural land. About 40% of the remaining land area is reserved as country parks and nature reserves. Low altitude vegetation in Hong Kong is dominated by secondary rainforests, as the primary forest was mostly cleared during the Second World War, and higher altitudes are dominated by grassland. The territory is highly diverse: over 3,000 species of vascular plants occur in the region, 300 of which are native to Hong Kong. Over 2,000 species of moths, butterflies, dragonflies, and other insects can be found, as well as one third of the total bird species in China, and a variety of fish, amphibians, reptiles, and mammals native to the Pearl River Delta. The Bauhinia orchid, native to the region, serves as a symbol for the city, appearing on the territorial flag and emblem.\n\nMost of the territory's urban development exists on Kowloon Peninsula, along the northern edge of Hong Kong Island, and in scattered settlements throughout the New Territories. The highest elevation in the territory is at Tai Mo Shan, 957 m above sea level. Hong Kong's long and irregular coast provides it with many bays, rivers and beaches. On 18 September 2011, UNESCO listed the Hong Kong Global Geopark as part of its Global Geoparks Network. Hong Kong Geopark is made up of eight Geo-Areas distributed across the Sai Kung Volcanic Rock Region and Northeast New Territories Sedimentary Rock Region.\n\nDespite Hong Kong's reputation of being intensely urbanised, the territory has tried to promote a green environment, and recent growing public concern has prompted the severe restriction of further land reclamation from Victoria Harbour. Awareness of the environment is growing as Hong Kong suffers from increasing pollution compounded by its geography and tall buildings. Approximately 80% of the city's smog originates from other parts of the Pearl River Delta.\n\nClimate \n\nIn the Köppen–Geiger classification system, Hong Kong has a humid subtropical climate (Cwa), though it is situated 128 km south of the Tropic of Cancer. Summer is hot and humid with occasional showers and thunderstorms, and warm air coming from the southwest. Typhoons most often occur in summer, sometimes resulting in flooding or landslides. Winters are mild and usually start sunny, becoming cloudier towards February; the occasional cold front brings strong, cooling winds from the north. The most temperate seasons are spring, which can be changeable, and autumn, which is generally sunny and dry. Snowfall is extremely rare, and usually occurs in areas of high elevation. Hong Kong averages 1,948 hours of sunshine per year, while the highest and lowest ever recorded temperatures at the Hong Kong Observatory are  on 22 August 2017 and  on 18 January 1893, respectively. The highest and lowest ever recorded temperatures across all of Hong Kong, on the other hand, are   at Waglan Island in June 1991 and  at Tai Mo Shan on 24 January 2016, respectively.\n\nArchitecture \n\nAccording to Emporis, there are 1,223 skyscrapers in Hong Kong, which puts the city at the top of world rankings.\nIt has more buildings taller than 500 ft than any other city.\nThe high density and tall skyline of Hong Kong's urban area is due to a lack of available sprawl space, with the average distance from the harbour front to the steep hills of Hong Kong Island at , much of it reclaimed land. This lack of space causes demand for dense, high-rise offices and housing. Thirty-six of the world's 100 tallest residential buildings are in Hong Kong. More people in Hong Kong live or work above the 14th floor than anywhere else on Earth, making it the world's most vertical city.\n\nAs a result of the lack of space and demand for construction, few older buildings remain, and the city is becoming a centre for modern architecture. The International Commerce Centre (ICC), at 484 m high, is the tallest building in Hong Kong and the seventh tallest in the world, by height to roof measurement. The tallest building prior to the ICC is Two International Finance Centre, at 415 m high. Other recognisable skyline features include the HSBC Headquarters Building, the triangular-topped Central Plaza with its pyramid-shaped spire, The Center with its night-time multi-coloured neon light show; A Symphony of Lights and I. M. Pei's Bank of China Tower with its sharp, angular façade. According to the Emporis website, the city skyline has the biggest visual impact of all world cities. Also, Hong Kong's skyline is often regarded to be the best in the world, with the surrounding mountains and Victoria Harbour complementing the skyscrapers. Most of the oldest remaining historic structures, including the Tsim Sha Tsui Clock Tower, the Central Police Station, and the remains of Kowloon Walled City were constructed during the 19th and early 20th centuries.\n\nThere are many development plans in place, including the construction of new government buildings, waterfront redevelopment in Central, and a series of projects in West Kowloon. More high-rise development is set to take place on the other side of Victoria Harbour in Kowloon, as the 1998 closure of the nearby Kai Tak Airport lifted strict height restrictions. The Urban Renewal Authority is highly active in demolishing older areas, including the razing and redevelopment of Kwun Tong town centre, an approach which has been criticised for its impact on the cultural identity of the city and on lower-income residents.\n\nCityscape \n\nDemographics \n\nThe Census and Statistics Department estimated the population to be 7,389,500 people as of August 2017, with an average annual growth rate of 0.66% over the previous five years. The territorial population has multiplied by over a factor of 12 since the end of the Second World War, from about 600,000 in 1945. Since 1979, the fertility rate has consistently declined below the replacement level of 2.1, reaching 1.2 children per woman in 2016. Continued growth can be attributed to high rates of immigration from foreign countries and Greater China; 40% of the population were born outside of the territory.\n\n92% of the population is Han Chinese, the majority of whom are Taishanese, Teochew, Hakka, and a variety of other Cantonese peoples. A large portion of Hong Kong's majority population originated from the neighbouring province of Guangdong, from where many fled during the Second Sino-Japanese War, the Chinese Civil War, and after establishment of communist rule in China.\n\nNon-ethnic Chinese minorities constitute the remaining 8% of the population. Filipinos and Indonesians form the city's largest ethnic minority groups, many of whom work as foreign domestic helpers. South Asians, largely descendants of British Indian soldiers stationed by the colonial government and migrants of that era, also make up a significant minority. Like many Chinese who crossed the border after the communist victory at the conclusion of the Chinese Civil War, Vietnamese refugees sought refuge and settled in Hong Kong during and after the Vietnam War. Britons, Americans, Canadians, Japanese, and Koreans resident in the city largely work in the commercial and financial sector.\n\nA legacy of colonial rule, about 3 million residents hold some form of British nationality, including British National (Overseas) status and British citizenship. The vast majority of them concurrently hold Chinese nationality, which was automatically granted to all residents of Chinese descent at the transfer of sovereignty.\n\nChinese citizens ordinarily resident in mainland China are not entitled to right of abode in Hong Kong, and are subject to immigration controls. Like foreign nationals, they may apply for right of abode after seven years of continuous residency. Some rights may be acquired through marriage (e.g., the right to work), but these do not include the right to vote or stand for office. The influx of Chinese immigrants is a significant contributor to territorial population growth, and is limited by a daily quota of 150 people with existing family ties in Hong Kong. These immigrants are issued a One-way Permit and have their household registration in the mainland rescinded.\n\nLanguages \n\nThe two official languages of Hong Kong are Chinese and English. Cantonese, a variety of Chinese originating from the province of Guangdong to the north of Hong Kong, is spoken by the vast majority of the population. According to the 2016 by-census, 94.6% of the population speak Cantonese; 88.9% as a first language and 5.7% as a second language.\n\nThe Basic Law is written in Chinese and English, and legislation enacted since the handover has been drafted in both languages. Colonial era legislation and court proceedings predominantly used English, so the two languages share a coequal status in the common law system of the territory. Approximately half of the population speaks English, though only 4.3% use it natively and 48.9% as a second language. Hong Kong English is the common form of English used in the region, generally following British English in spelling and heavily influenced by Cantonese pronunciations. Among the bilingual members of the population, many exhibit code-switching, mixing English and Cantonese in informal conversation.\n\nSince the transfer of sovereignty, an influx of mainland Chinese immigrants and greater interaction with the rest of the national economy have brought an increasing number of Mandarin speakers to Hong Kong. Mandarin is about as prevalent as English in the territory; 48.6% of the population can speak it, with 1.9% using it as a first language and 46.7% as a second language. Hong Kong uses traditional Chinese characters in written script, rather than the simplified characters that are officially used in the mainland.\n\nPersonal income and wealth \n\nHong Kong has the highest statistical income gap in the Asia-Pacific region. The Census and Statistics Department measured the Gini coefficient of the territory as 53.9 using data collected in the 2016 by-census. Income inequality has risen since the transfer of sovereignty, as the region's ageing population has gradually added to the number of economically inactive people. While median household income has also steadily increased in the last decade, the wage gap remains high, with the 90th percentile of earners receiving 41 per cent of all income. Hong Kong is ranked fourth in terms of the highest percentage of millionaire households, with 8.5 per cent of all households holding at least one million US dollars. The city is also ranked second in the world by the most billionaires per capita, with one per 132,075 people. Despite government efforts to reduce growth of the disparity through assistance programmes such as the Old Age Living Allowance, median income for the top 10 per cent of earners is 44 times that of the bottom 10 per cent. There were 908 homeless persons registered with the Social Welfare Department by the end of 2016, though it is estimated that the actual number is almost double that of the official figure.\n\nReligion \n\nFreedom of religion is guaranteed by the Basic Law, and many religious organisations have an established presence in the territory. The majority of residents have no religious affiliation, professing some form of agnosticism, irreligion, or atheism. In a 2015 Gallup International poll, 26% of Hongkongers self-identified as religious. Prior to the transfer of sovereignty, Christianity was the only faith with official presence in the government; only Anglican and Catholic bishops were placed in the colonial order of precedence. Other religions with significant numbers of adherents are now similarly acknowledged by the post-handover government.\n\nAmong the religious population, the traditional \"three teachings\" of China (Buddhism, Confucianism, and Taoism) have the most adherents, estimated to be around 1.5 million. About 869,000 residents profess Christianity as their faith, forming 11.7% of the total population. Protestants and Catholics make up the bulk of this number, while the remainder is composed of members of other denominations, including Mormons, Jehovah's Witnesses, and Eastern Orthodox Christians. Islam has about 300,000 adherents in the territory, 50,000 of whom are Chinese. Followers of other religions, including Sikhism, Hinduism, Judaism, and the Bahá'í Faith, generally ethnically originate from the same region as their faith.\n\nRegulation and restrictions on religion that are required in mainland China do not apply in Hong Kong. The Anglican and Catholic churches freely appoint their own bishops and maintain ties with the Church of England and the Vatican. Although banned by the central government, the practice of Falun Gong is tolerated in the territory.\n\nEconomy \n\nHong Kong has a capitalist mixed service economy, characterised by low taxation, minimal government market intervention, and an established international financial market. It is the 33rd-largest economy in the world, with a nominal GDP of approximately US$320 billion. Hong Kong's economy has consistently ranked at the top of the Heritage Foundation's index of economic freedom since 1995,  and had been described by Milton Friedman as the world's greatest experiment in laissez-faire capitalism, but the territory suffers from a relatively high level of income disparity. The Hong Kong Stock Exchange is the seventh largest in the world and has a market capitalisation of US$3.2 trillion as of December 2016. It is an important centre for international finance and trade, with one of the greatest concentrations of corporate headquarters in the Asia-Pacific region.\n\nHong Kong is the world's seventh largest trading entity in both exports and imports, with the total value of traded goods exceeding its gross domestic product. It is also the world's largest transshipment centre; much of its exports consist of re-exports, products manufactured outside of the territory, especially in mainland China, and distributed via Hong Kong. Its physical location has allowed the city to establish a transportation and logistics infrastructure that includes the world's second busiest container port and the world's busiest airport for international cargo. The territory's largest export markets are mainland China and the United States.\n\nThe territory has little arable land and few natural resources, so it imports most of its food and raw materials. Imports account for more than 90 per cent of Hong Kong's food supply, including nearly all of the meat and rice available there. Agricultural activity, relatively unimportant to Hong Kong's economy and contributing just 0.1 per cent of its GDP, primarily consists of growing premium food and flower varieties.\n\nWhile the territory boasted one of the largest manufacturing economies in Asia during the latter half of the colonial era as the city industrialised, Hong Kong's economy is now dominated by the services sector. Services alone constitute 92.7 per cent of economic output, with the public sector accounting for about 10 per cent. As one of the Four Asian Tigers, Hong Kong rapidly industrialised as a manufacturing centre driven by exports through the post-war decades of the 20th century, turning the territory into a developed high-income area by the end of the colonial era. Between 1961 and 1997, Hong Kong's gross domestic product multiplied by a factor of 180, while per-capita GDP increased 87 times over. The territory's GDP relative to mainland China's peaked at 27 per cent in 1993, but this has since fallen significantly as the mainland developed and liberalised its economy, declining to less than 3 per cent in 2017.\n\nThe government traditionally played a passive role in the economy, with little by way of industrial policy and almost no import or export controls. Under the official policy of \"positive non-interventionism\", Hong Kong was often cited as a comprehensive example of laissez-faire capitalism. While the economy transitioned to become service-based in the 1980s, late colonial governments steadily introduced interventionist policies that were continued and expanded by post-handover administrations, including export credit guarantees, a compulsory pension scheme, a minimum wage, anti-discrimination laws, and a state mortgage backer.\n\nHong Kong's economic and infrastructure integration with China has increased significantly from the start of market liberalisation in the mainland beginning in 1978. Since resumption of cross-boundary train service in 1979, multiple rail and road links have been continuously improved and constructed, facilitating trade between the regions. The Closer Partnership Economic Arrangement formalised a policy of free trade between Hong Kong and the mainland, with each jurisdiction pledging to eliminate remaining obstacles to the trade of goods and services and cross-boundary investments. Chinese companies have greatly expanded their economic presence in the territory since the transfer of sovereignty; mainland firms now represent over half of the total value of the Hang Seng Index, up from just 5 per cent in 1997.\n\nThe Hong Kong dollar has been pegged to the United States dollar since 1983. Because most business transactions in the territory are dealt in US dollars, the fixed exchange-rate system is intended to reduce foreign exchange risk for international traders and investors. Policy changes implemented by the Federal Reserve affect Hong Kong, but do not necessarily take the territory into account, and volatility in the value of the US dollar itself requires the Monetary Authority to continually maintain the fixed exchange rate at substantial cost. Consequently, there are periodic appeals to discontinue the existing currency peg, and to either allow the Hong Kong dollar to be freely floated or peg it to the Chinese renminbi.\n\nTourism forms a major part of the territorial economy, comprising 5 per cent of GDP; 26.6 million visitors contributed US$32.9 billion in international tourism receipts in 2016, making Hong Kong the fourteenth most popular destination for international tourists. It is also the most popular city for tourists, receiving over 70 per cent more visitors than its closest competitor, Macau. The city is further consistently ranked as one of the most expensive cities for expatriates.\n\nInfrastructure \n\nEnergy \n\nHong Kong meets its energy requirements largely through imports from external sources, including both generated electricity and fuel. The vast majority of this energy came from fossil fuels, with 46% from coal and 47% from petroleum. The remainder came from other imports, including nuclear energy generated on the mainland. Renewable sources accounts for a negligible amount of total energy generated for the territory; wind power sources have only been developed at a very small scale, while solar panels are deployed on a limited scale for use in private homes.\n\nWater and sanitation \n\nWith few natural lakes and rivers, a high population density, groundwater sources inaccessible through hard granite bedrock, and extremely seasonal variations in rainfall, the territory does not have an adequately reliable local source of fresh water. 70 per cent of water demand is met by importing water from the Dongjiang River in the neighbouring province of Guangdong. Use of seawater for toilet flushing, supplied through a separate distribution system, greatly reduces strain on freshwater supply. A planned desalination plant in Tseung Kwan O is expected to reduce dependence on external imports and to provide a more reliable water source during periods of low rainfall and severe droughts.\n\nTelecommunications \n\nMobile phone usage in Hong Kong is ubiquitous; there are more than 17 million active mobile phone subscribers, more than double the total number of residents in the territory. Internet usage is similarly high with 5.58 million users, or 87.5% of the population. The regional average broadband connection speed is 21.9 Mbit/s, making Hong Kong fourth in the world in terms of internet speed. 92.4% of households have broadband internet access and connections over fibre-optic infrastructure are becoming increasingly prevalent. 29 submarine communications cables link the region's telecommunications network with the rest of the world.\n\nTransport \n\nHong Kong has a highly developed and sophisticated transport network, encompassing both public and private modes of travel. Regulation and administrative policy is handled by the Transport Department. Over 90% of daily journeys are made on public transport, the highest such percentage in the world. The Octopus card, a contactless smart payment card, is widely accepted on railways, buses, and ferries, and can be used for payment in retail stores. Launched in 1997 on the Mass Transit Railway, it is the second contactless smart card system in the world to be used and is a ubiquitous form of payment throughout the territory.\n\nRail \n\nThe Mass Transit Railway (MTR) is an extensive passenger railway network, connecting 93 metro stations throughout the territory. With a daily ridership of over five million, the system serves 41% of all public transit passengers in the city. Service is extremely punctual, achieving an on-time rate of 99.9%. The rapid transit network operates within inner urban Hong Kong and extends to New Kowloon, Lantau Island, and the northeastern and northwestern parts of the New Territories. Nine railway lines provide general metro services, while the Airport Express provides a direct link from Hong Kong International Airport to the city centre and a dedicated line transports passengers to and from Hong Kong Disneyland.\n\nCross-boundary train service to Shenzhen is offered by the East Rail Line, terminating at immigration checkpoints at Lo Wu and Lok Ma Chau. Inter-city trains to Guangzhou, Shanghai, and Beijing are operated from Hung Hom Station. Connecting service to the national high-speed rail system is scheduled to begin in 2018, after construction of West Kowloon Station completes.\n\nRoads and taxis \n\nRoad traffic in the territory drives on the left, unlike that of mainland China. Highways are organized as the Hong Kong Strategic Route and Exit Number System, a system of major roads comprising 3 north-south routes, 5 east-west routes, and the New Territories Circular Road. All major geographic areas of the territory are connected over this road system; Route 8 runs along the Tsing Ma Bridge to connect the city centre with Tsing Yi and Lantau Island, and Routes 1, 2, and 3 pass through the three tunnels under Victoria Harbour to connect Hong Kong Island with the Kowloon Peninsula. Route 10 provides direct road access to Shenzhen, terminating at the Shenzhen Bay Port. The territory is connected to the national expressway system at Lok Ma Chau; the G4 Beijing–Hong Kong–Macau Expressway ends at the Huanggang Port and is connected to Route 9 by a short spur road beginning at immediately at the territorial border. When completed, the Hong Kong–Zhuhai–Macau Bridge will provide an additional connection to the mainland road system and create a direct route to the western side of the Pearl River estuary.\n\nWhile public transport systems handle the majority of passenger traffic, there are over 500,000 private vehicles licensed in Hong Kong. Because of the territory's small size, residents are discouraged from private car ownership; cars are subjected to a first-time registration tax, which varies from 35% to over 100% depending on the size and value of the car, and over half the cost of petrol sold at filling stations is due to taxes. Road traffic is extremely congested during peak hours, with average vehicle speeds reaching as a low as 10 km/h on major roads. Congestion is exacerbated by the urban layout of the city, the physical constraints to expanding road transport infrastructure, and a growing number of vehicles.\n\nMore than 18,000 taxicabs provide transport services for the city and they are easily identifiable by their brightly painted vehicles. The geographical area that a taxicab operates is distinguished by vehicle color. Red taxis serve Hong Kong Island, Kowloon, all of the New Territories, and the northern part of Lantau Island; green taxis operate in portions of the New Territories and specific stations outside of their assigned area; blue taxis are available only on Lantau Island.\n\nAviation \n\nHong Kong International Airport is the primary airport for the territory. Over 100 airlines operate flights from the airport and it is the main hub of flag carrier Cathay Pacific, Cathay Dragon, Air Hong Kong, and Hong Kong Airlines. It is an important regional transhipment centre, passenger hub, and gateway for destinations in mainland China and the rest of Asia. The airport is a major international air passenger gateway and services the most air cargo traffic in the world. Handling over 70 million passengers annually, it is the eighth busiest airport worldwide by passenger traffic. The airport is constructed on an artificial island north of Lantau Island and was built to replace the overcrowded Kai Tak Airport in Kowloon Bay.\n\nFerries \n\nThe Star Ferry, in service since 1888, operates two lines across Victoria Harbour and provides scenic views of Hong Kong's skyline for its 53,000 daily passengers. Outlying islands of the territory are inaccessible by other means and transport to those areas is provided exclusively by ferry operators, including New World First Ferry, Hong Kong & Kowloon Ferry, and Tsui Wah Ferry. Ferry services also operate routes to Macau and nearby cities in mainland China, including direct service between Hong Kong International Airport and Shenzhen Bao'an International Airport for transiting passengers. Cross-boundary services operate out of the Macau Ferry Terminal, China Ferry Terminal, and Tuen Mun Ferry Pier.\n\nHong Kong is famous for its junk ships that traverse the harbour, and small kai-to ferries that serve remote coastal settlements. The Port of Hong Kong is a busy deepwater port, specialising in container shipping.\n\nBuses and trams \n\nPublic bus services are franchised and run by five private companies, together operating more than 700 routes across the territory. The largest are Kowloon Motor Bus, providing 402 routes in Kowloon and New Territories; Citybus, operating 154 routes on Hong Kong Island; and New World First Bus, running an additional 56 routes in Kowloon and Hong Kong Island. All three major bus operators provide cross-harbour services, serving as a major transport link for the 3.9 million daily bus passengers. Double-decker buses were introduced to Hong Kong in 1949, and are now almost exclusively used; single-decker buses remain in use for routes with lower demand or roads with lower load capacity. Public light buses serve most parts of Hong Kong, particularly areas where standard bus lines cannot reach or do not reach as frequently, quickly, or directly.\n\nHong Kong Island's steep, hilly terrain was initially served by sedan chairs. The Peak Tram, the first public transport system in Hong Kong, has provided vertical rail transport between Central and Victoria Peak since 1888. In the Central and Western District, there is an extensive system of escalators and moving pavements, including the longest outdoor covered escalator system in the world, the Mid-Levels escalator. Hong Kong Tramways, which has served the territory since 1904, covers the northern parts of Hong Kong Island. The MTR operates the Light Rail system serving the districts of Tuen Mun and Yuen Long.\n\nEducation \n\nEducation in Hong Kong is largely modelled after that of the United Kingdom, particularly the English system. Children are required to attend school from the age of six until completion of secondary education, generally at age 18. Mandatory education has contributed to an adult literacy rate of 95.7%. At the end of secondary schooling, a public examination is administered to all students, awarding the Hong Kong Diploma of Secondary Education on successful completion. Of residents aged 15 and older, 81.3% completed lower secondary schooling, 66.4% graduated from upper secondary, 31.6% attended a non-degree tertiary program, and 24% earned a bachelor's degree or higher.\n\nComprehensive schools fall under three categories: public schools, which are fully government-run; subsidised schools, including government aid-and-grant schools; and private schools, often those run by religious organisations and that base admissions on academic merit. These schools are subject to the curriculum guidelines as provided by the Education Bureau. Private schools subsidised under the Direct Subsidy Scheme and international schools fall outside of this system and may elect to use differing curricula and teach based on other languages.\n\nThe government maintains a policy of \"mother tongue instruction\", in which the medium of instruction is Cantonese, with written education in both Chinese and English. In secondary schools, \"biliterate and trilingual\" proficiency is emphasised, which has encouraged the proliferation of spoken Mandarin language education. The Programme for International Student Assessment ranked Hong Kong's education system as the second best in the world.\n\nHong Kong has ten universities within its territory. The University of Hong Kong was founded as the city's first institute of higher education during the early colonial period in 1911. The Chinese University of Hong Kong was established in 1963 to fill the need for a university that taught using Chinese as its primary language of instruction. Along with the Hong Kong University of Science and Technology and City University of Hong Kong, these universities are ranked among the best in Asia. In subsequent years, the Hong Kong Polytechnic University, Hong Kong Baptist University, Lingnan University, Education University of Hong Kong, Open University of Hong Kong, and Hong Kong Shue Yan University were established to meet growing demand for higher education. Competition among students for admission into undergraduate programmes is fierce, as the number of available placements remains limited. The city additionally has post-secondary institutes that provide an alternative path for tertiary education.\n\nHealth \n\nHealthcare in Hong Kong is mainly provided by the Hospital Authority, a government agency that administers the 42 public medical facilities in the territory. Treatment in the universal public system is highly subsidised and available to all residents, permanent and non-permanent, who have an identity card. While the statutory system fulfills the vast majority of medical service needs, private healthcare facilities provide more readily accessible and specialised care at higher cost, especially for individuals with non-resident status. Healthcare policy and provisioning is set by the Department of Health, which also directly supervises the 12 registered private hospital facilities.\n\nLife expectancy in Hong Kong is 81.3 years for males and 87.3 years for females , making it the highest in the world. The region also has one of the lowest infant mortality rates, at 1.5 per 1,000 births. Infants are generally well immunised against communicable diseases.\n\nCancer, pneumonia, heart disease, cerebrovascular disease, and severe injuries caused by accidents are the five leading causes of death in the territory. Obesity rates have increased sharply in the last decade; approximately 30 per cent of the population is obese and an additional 20 per cent is overweight. Adolescent pregnancy rates are comparatively lower than many developed nations. Official abortion rates are similarly low, but it is estimated that the number of people who seek termination is higher due to procedural barriers and costs.\n\nThe territorial healthcare system is separate from those serving mainland China and Macau. Individuals from those regions seeking medical services in Hong Kong are not entitled to publicly subsidised care intended for local residents, with the reverse being true as well. Stricter medical procedure standards, lower mortality rates, and the prospect of permanent residency have led expectant mothers from the mainland to travel to the city to give birth, straining capacity of local maternity wards. Macanese residents also often seek regular care in Hong Kong, due to a lack of developed healthcare infrastructure in Macau's physically limited area.\n\nCulture \n\nHong Kong is frequently described as a place where \"East meets West\", reflecting the cultural mix of the territory's Chinese roots with Western influence from its time as a British colony. Though the vast majority of the population is ethnically Chinese, the long period of colonial administration and sustained exposure to Western culture has resulted in a distinct cultural identity from that of mainland China. Mainstream culture in Hong Kong is an Eastern culture largely derived from immigrants originating from various parts of China, but influenced by British-style education, a separate political system, and the territory's status as a major port of trade.\n\nChinese immigrants after the Second World War fueled Hong Kong's economic growth in the post-war decades, creating the perception that residents enjoy high social mobility and a culture characterised by individual entrepreneurialism and a strong work ethic among those who arrived. As most incoming migrants from the mainland were fleeing economic hardship, people in Hong Kong today tend to tie self-image and decision-making to material benefits quite closely.\n\nConcepts like feng shui are taken very seriously, with expensive construction projects often hiring expert consultants, and are often believed to make or break a business. Other objects like Ba gua mirrors are still regularly used to deflect evil spirits, and buildings often lack any floor number that has a 4 in it, due to its similarity to the word for \"die\" in Cantonese. The fusion of east and west also characterises Hong Kong's cuisine, where dim sum, hot pot, and fast food restaurants coexist with haute cuisine.\n\nHong Kong is a recognized global centre of trade and calls itself an \"entertainment hub\". Its martial arts film genre gained a high level of popularity in the late 1960s and 1970s. Several Hollywood performers, notable actors and martial artists have originated from Hong Kong cinema, notably Bruce Lee, Jackie Chan, Chow Yun-fat, Michelle Yeoh, Maggie Cheung and Jet Li. A number of Hong Kong film-makers have achieved widespread fame in Hollywood, such as John Woo, Wong Kar-wai, and Stephen Chow. Homegrown films such as Chungking Express, Infernal Affairs, Shaolin Soccer, Rumble in the Bronx, In the Mood for Love and Echoes of the Rainbow have gained international recognition. Hong Kong is the centre for Cantopop music, which draws its influence from other forms of Chinese music and Western genres, and has a multinational fanbase.\n\nThe Hong Kong government supports cultural institutions such as the Hong Kong Heritage Museum, the Hong Kong Museum of Art, the Hong Kong Academy for Performing Arts, and the Hong Kong Philharmonic Orchestra. The government's Leisure and Cultural Services Department subsidises and sponsors international performers brought to Hong Kong. Many international cultural activities are organised by the government, consulates, and privately.\n\nSport \n\nDespite its small area, Hong Kong is home to a wide range of sports and recreational facilities. The city frequently sends regional teams to international competitions and was host to the 2009 East Asian Games, the equestrian events of the 2008 Summer Olympics, and the 2007 Premier League Asia Trophy. Hong Kong's steep terrain and extensive trail network with expansive views attracts hikers, and its rugged coastline provides many beaches for swimming. Major sporting venues in the territory have regularly hosted the Hong Kong Sevens, Hong Kong Marathon, Hong Kong Tennis Classic, and Lunar New Year Cup. Hong Kong was also the host city for the inaugural 1956 tournament of the AFC Asian Cup and the 1995 Dynasty Cup.\n\nDue to British colonial influence, Hong Kong had an earlier introduction to Western athletics compared to other East Asian regions. As part of the government's active involvement in promoting sports participation, the Tourism Board organised the first international dragon boat racing competition in 1976.\n\nHong Kong maintains territory-wide teams for participation in all international sporting events, and represents itself separately instead of as a part of Chinese national teams. The city has sent athletes to almost every Summer Olympics since 1952. As of 2017, Hong Kong has won 3 medals at the Olympic Games, 126 at the Paralympic Games, and 17 at the Commonwealth Games. No longer part of the Commonwealth of Nations, the city's last appearance at the Commonwealth Games was in 1994.\n\nMedia \n\nThe largest and dominant television broadcaster in the territory is TVB, which runs the largest commercial television production studio in Asia. Public broadcasting is operated by RTHK, operating seven radio channels and three television channels. Cable, satellite, and other premium content services cater to a variety of niche audiences. Local television productions reach audiences throughout Greater China and internationally in the Cantonese-speaking overseas Chinese diaspora.\n\nMagazine and newspaper publishers in Hong Kong distribute and print in both Chinese and English, with a focus on sensationalism and celebrity gossip. Unlike the government's public presence in broadcasting, newspaper publications in the territory are all privately owned. The largest Chinese-language newspapers by local circulation are the Headline Daily and Oriental Daily News. The most widely circulating English-language counterparts are the South China Morning Post, which is the publication of record for the territory, and The Standard.\n\nThe media in Hong Kong is relatively free from official interference compared to Mainland China, although the Far Eastern Economic Review pointed to signs of self-censorship by media whose owners have close ties to or business interests in the People's Republic of China and states that even Western media outlets are not immune to growing Chinese economic power.\n\nNotable people. Hong Kong. http://en.wikipedia.org/?curid=13404."
  }
}
