{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13104",
  "eid" : "06ab0e10-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778520433,
  "textBody" : "Grinnell College is a private liberal arts college in Grinnell, Iowa, U.S., known for its rigorous academics and tradition of social responsibility.[http://www.princetonreview.com/college/research/profiles/academics.asp?listing1023453&ltid\n1&intbucketid= \"Grinnell College: Academics\"], The Princeton Review\". Retrieved 30 April 2008. It was founded in 1846, when a group of New England Congregationalists established the Trustees of Iowa College.\n\nHistory \n\nIn 1843, eleven Congregational ministers, all of whom trained at Andover Theological Seminary in Massachusetts, set out to proselytize on the frontier. Each man pledged to gather a church and together the group or band would seek to establish a college. When the group arrived in Iowa later that year, each selected a different town in which to establish a congregation. In 1846, they collectively established Iowa College in Davenport. A few months later, Iowa joined the Union.\n\nThe first 25 years of Grinnell's history saw a change in name and location. Iowa College moved farther west from Davenport, Iowa, to the town of Grinnell and unofficially adopted the name of its benefactor: an abolitionist minister, Josiah Bushnell Grinnell, to whom journalist Horace Greeley supposedly wrote \"Go West, young man, go West.\" However, Greeley vehemently denied ever saying this to Grinnell, or to anyone.Wall, Joseph Frazier. Grinnell College in the Nineteenth Century: From Salvation to Service. (Ames: Iowa State University Press), 91-92. The name of the corporation, \"The Trustees of Iowa College,\" remained, but in 1909 the name \"Grinnell College\" was adopted by the trustees for the institution.\n\nIn its early years, the College experienced setbacks. Although two students received bachelor of arts degrees in 1854 (the first to be granted by a college west of the Mississippi River), within 10 years the Civil War had claimed most of Grinnell's students and professors. In the decade following the war, growth resumed: women were officially admitted as candidates for degrees, and the curriculum was enlarged to include then-new areas of academic studies, such as natural sciences with laboratory work.\n\nIn 1882, Grinnell College was struck by a tornado — then called a cyclone, after which the college yearbook was named. The storm devastated the campus and destroyed both College buildings. Rebuilding began immediately, and the determination to expand wasn't limited to architecture: the curriculum was again extended to include departments in political science (the first in the United States) and modern languages.\n\nGrinnell became known as the center of the Social Gospel reform movement,. see footnote 4. as Robert Handy writes, \"The movement centered on the campus of Iowa (now Grinnell) College. Its leading figures were Professor George D. Herron and President George A. Gates\". Other firsts pointed to the lighter side of college life: the first intercollegiate football and baseball games west of the Mississippi were played in Grinnell, and the home teams won.\n\nAs the 20th century began, Grinnell established a Phi Beta Kappa chapter, introduced the departmental \"major\" system of study, began Grinnell-in-China (an educational mission that lasted until the Japanese invasion and resumed in 1987), and built a women's residence hall system that became a national model. The social consciousness fostered at Grinnell during these years became evident during Franklin D. Roosevelt's presidency, when Grinnell graduates Harry Hopkins '12, Chester Davis '11, Paul Appleby '13, Hallie Flanagan '11, and Florence Kerr '12 became influential New Deal administrators.\n\nConcern with social issues, educational innovation, and individual expression continue to shape Grinnell. As an example, the school’s \"5th year travel-service program,\" preceded the establishment of the Peace Corps by many years. Other recent innovations include first-year tutorials, cooperative pre-professional programs, and programs in quantitative studies and the societal impacts of technology.\n\nIn its 2016 edition of \"America's Best Colleges\", U.S. News & World Report ranked Grinnell tied for 19th among all liberal arts colleges in the United States, and tied for highest economic diversity as measured by low-income students receiving federal Pell Grants.\n\nCampus \n\nGrinnell College is located in the town of Grinnell, Iowa, about halfway between Des Moines and Iowa City. The main campus is bounded by 6th Avenue (which is also US Highway 6) on the south, 10th Avenue on the north, East Street on the east and Park Street on the west. The 120 acre campus contains sixty-three buildings ranging in style from Collegiate Gothic to Bauhaus.  Goodnow Hall and Mears Cottage (1889) are listed on the National Register of Historic Places.\n\nThe residential part of campus is divided into three sections: North Campus, East Campus, and South Campus. North and South Campus' dormitories are modeled explicitly after the residential colleges of Oxford and Cambridge. The East Campus dormitories were designed by William Rawn Associates  and feature a modern design. Upon completion East Campus was awarded LEED certification. The four East Campus dorms are made out of Iowa limestone which helped in securing the LEED certification. All three campuses feature dormitory buildings that are connected by a loggia, an architectural signature of the college. The loggia on South Campus is the only entirely closed loggia, featuring walls on all sides, while the loggias on East and North campus are only partially closed. From the time that the first dorm opened in 1915 until the fall of 1968, the nine north campus dorms were exclusively for male students, and the six south campus dorms were reserved for female students. The dorms are much smaller than those seen in many schools, ranging from the smallest, Rawson Hall, which houses 34 students, to the largest, Younker Hall, which houses 113.\n\nMost academic buildings are located on the southwestern quarter of campus. The athletic facilities are mostly located on the northeastern quarter, and some facilities are located north of 10th Avenue.\n\nIn addition to the main campus, the college owns much of the adjacent property. Many administrative offices are located in converted houses across Park Street near the older academic buildings, and several residences are used for college-owned off-campus student housing.\n\nThe college maintains a 365 acre environmental research area called the Conard Environmental Research Area (CERA). The U.S. Green Building Council awarded CERA's Environmental Education Center a gold certification.United States Green Building Council. [http://www.usgbc.org/ShowFile.aspx?DocumentID=1548 \"Cera Environmental Education Center LEED Scorecard\"]. Accessed May 14, 2007. The building is the first in Iowa to receive the designation.American Association for the Advancement of Sustainability in Higher Education. AAASHE Bulletin [http://www.aashe.org/archives/2006/06_06_08.php \"Grinnell College Education Center Receives LEED Gold Certification\"], June 8, 2006. Retrieved 29 April 2008.\n\nMany building projects have been undertaken in recent years at the College including a new athletics center, the Bucksbaum Center for the Arts, the renovation of the Robert Noyce '49 Science Center and the Joe Rosenfield '25 Student Center. Noted architect César Pelli designed the athletics center, the Joe Rosenfield '25 Student Center, and the Bucksbaum Center for the Arts.Hebel, Sara. [http://chronicle.com/weekly/v52/i31/31a01501.htm \"In Iowa, 2 Colleges Separated by 150 Miles and $1.37-Billion\"], The Chronicle of Higher Education, April 7, 2006. Retrieved 30 April 2008.\n\nAcademics \n\nReputation \n\nGrinnell College is nationally recognized as a leading undergraduate institution. In July 2006, The New York Times included Grinnell in its profile of the 20 colleges and universities of \"established or rising scholarship\" which are fast becoming viable alternatives to Ivy League institutions,Archibold, R.C. [https://query.nytimes.com/gst/fullpage.html?res9500E3D7163FF933A05754C0A9609C8B63&sec\n&spon&pagewanted\n2 \"Off the Beaten Path\"], The New York Times, 30 July 2006. and is considered one of the 30 Hidden Ivies.\n\nThe 2016 annual ranking of U.S. News & World Report rates it tied for the 19th best liberal arts college in the nation, 5th for \"Best Undergraduate Teaching,\" and 7th in \"Best Value Schools.\"  The College has been consistently ranked in the top 25 liberal arts colleges in the nation since the publication began in 1983.[http://chronicle.com/stats/usnews/index.php?category=Liberal+Arts+Colleges \"U.S. News Rankings Through the Years\"], Chronicle of Higher Education  Kiplinger's Personal Finance ranks Grinnell 9th in its 2016 ranking of \"best value\" liberal arts colleges in the United States.  Grinnell was ranked 15th in the 2015 Washington Monthly rankings, which focus on key outputs such as research, dollar value of scientific grants won, the number of graduates going on to earn Ph.D. degrees, and certain types of public service. In Forbes magazine's 2015 rankings of academic institutions, \"America's Top Colleges\" (which uses a non-traditional ranking system based on RateMyProfessors.com evaluations, notable alumni, student debt, percentage of students graduating in four years, and the number of students or faculty receiving prestigious awards), Grinnell College was ranked 56th among all private colleges, and 9th in the Midwest.\n\nData analyzed in 2006 place Grinnell at number eight among all U.S. undergraduate institutions in the proportion of graduates who go on to earn Ph.D. degrees and 15th for graduating female Ph.D. earners.Higher Education Data Sharing Consortium. \"Weighted Baccalaureate Origins Study.\" 2006. Grinnell College graduates enjoy a high acceptance rate to law school; over 46% of all applications submitted by students have been accepted by law schools.Grinnell College Career Development Office [http://web.grinnell.edu/careerdevelopment/gradschool/LawSchoolAdmissionReport/GeneralStatistics.html#anchor619447 Law School Admission Report]  Unigo.com's 2010 college rankings place Grinnell College in the \"Top 10 Colleges Where the Pursuit of Knowledge Goes Outside the Classroom\".\n\nFaculty \n\nGrinnell had 171 full-time faculty in Fall 2015, 98% of whom possess a doctorate or the terminal degree in their field. At the end of each semester, students fill out course surveys which play a large role in determining faculty tenure decisions and merit raises.\n\nAcademic program \n\nGrinnell's open curriculum encourages students to take initiative and to assume responsibility for their own courses of study. The sole core, or general education, requirement is the completion of the First-Year Tutorial, a one-semester, four-credit special topics seminar that stresses methods of inquiry, critical analysis, and writing skills. All other classes are chosen, with the direct guidance of a faculty member in the student's major department, by the student.\n\nThe academic program at Grinnell College emphasizes active learning and one-on-one interactions between faculty members and students. There are few large lecture classes. In sharp contrast to all public universities and many private universities in the United States, no classes, labs or other courses are taught by graduate students.\n\nGrinnell College expects all students to possess significant academic achievements. For example, the math department does not offer any basic-level classes such as college algebra, trigonometry, or pre-calculus, and remedial classes are not offered in any subject. However, several independent, non-credit programs assist students who need help in a specific subject. Among these programs are the Library Lab, Math Lab, Reading Lab, Science Learning Center, and the Writing Lab. While private tutors can be hired, participation in these programs is free for any enrolled student.\n\nGrinnell has twenty-six major departments and ten interdisciplinary concentrations. Popular majors include Psychology, Economics, Biology, History, English, and Political Science. The minimum requirements in a major area of study are typically limited to 32 credits in a single department, with some departments additionally requiring a small number of classes in related fields that are deemed critical for all students in that field. For example, the biology program requires 32 credits in the biology department plus two classes in chemistry and one in math.[http://www.grinnell.edu/academic/catalog/courses/biology/ Biology major requirements] Many students exceed the minimum requirements.\n\nTo graduate, students are normally expected to complete at least 32 credits in a major field and a total of 124 credits of academic work. To encourage students to explore courses outside of their primary interest area, no more than 48 credits in one department and no more than 92 credits in one division are counted towards this requirement.\n\nGrinnell’s commitment to the importance of off-campus study reflects the school’s emphasis on social and political awareness and the international nature of its campus. Approximately 60 percent of all Grinnell students participate in at least one of more than seventy off-campus programs, including the Grinnell-in-London program and study tours of China, France, Greece, and Russia. These study programs in Europe (including Russia), Africa, the Near East, and Asia, as well as nine programs in Central and South America, provide the opportunity for research in many disciplines, from archaeology to education to mathematics. In addition to off-campus programs, Grinnell offers internship programs in such areas as urban studies, art, and marine biology for students interested in field-based learning and experience in professional settings. Second- and third-year students may apply for summer internship grants and receive credit for the experience. Semester programs in the United States include those at Oak Ridge National Laboratory, Newberry Library, National Theatre Institute, and Grinnell-in-Washington, D.C.\n\nGrinnell also has invested in several interdisciplinary programs: the Center for Prairie Studies, Center for the Humanities, Center for International Studies, Noun Program in Women's Studies, Peace Studies Program, Rosenfield Public Affairs Program, and the Donald L. Wilson Program in Enterprise and Leadership.\n\nDespite the growing trend of U.S. students taking five or more years to finish an undergraduate degree, Grinnell College is strongly oriented towards students being enrolled full-time in exactly eight consecutive semesters at the college, although exceptions are available for medical issues and other emergencies.Grinnell College. [http://www.grinnell.edu/academic/catalog/acadreg/courseloads/ \"Academic Catalog: Academic Regulations\"] To avoid being suspended from the college, students must make \"normal progress towards graduation.\" This generally means that the student must pass at least 12 credits of classes in each individual semester, with grades C or higher, and have accumulated enough credits to make graduation possible at the end of four years, which requires an average of 15.5 credits each semester. A student who is not making normal progress towards graduation is placed on academic probation and may be dismissed from the college.Grinnell College. [http://www.grinnell.edu/academic/catalog/acadreg/probation/ \"Academic Catalog: Academic Regulations\"]\n\nAdmission\n\nU.S. News & World Report classifies Grinnell's selectivity as \"most selective.\"  For Fall 2015, Grinnell received 6,414 freshmen applications; 1,598 were admitted (24.9%).  Of the 41% of enrolled freshmen who submitted class rank, 81% were in the top 10% of their high school classes and 96% were in the top quarter. The middle 50% range of SAT scores for the enrolled freshmen was 640-740 for critical reading and 660-770 for math, while the ACT Composite range was 30–33.\n\nGrinnell College's admission selectivity rating, according to The Princeton Review in 2008, is a 95 out of 99.The Princeton Review. [http://www.princetonreview.com/schools/college/CollegeAdmissions.aspx?iid=1023453 Grinnell College]. Retrieved 23 November 2008. This rating is determined by several institutionally reported factors, including: the class rank, average standardized test scores, and average high school GPA of entering freshmen; the percentage of students who hail from out-of-state; and the percentage of applicants accepted.The Princeton Review. [http://www.princetonreview.com/college/research/articles/find/ratings.asp#selectivity About College]\n\nThe primary factor in evaluating applicants is the quality of the education they have received, as shown by their transcript. Additional factors include standardized test scores, student writing skills, recommendations, and extracurricular activities.[http://www.grinnell.edu/admission/apply/faqs/#lookingfor Grinnell College Admission FAQ]. Retrieved 15 May 2008.\n\nEarly decision rounds are offered to students in the fall; most students apply in January of their final year in high school. Admission decisions are released by April 1 of each year. All students begin classes in August.\n\nThe students' expectation of needing financial assistance does not affect the admission process.Montgomery, David. [http://web.grinnell.edu/sandb/archives/volume_121/number_17/news/article06.html \"International student financial aid goes need-sensitive\"] , The Scarlet & Black, March 4, 2005\n\nTuition and financial aid \n\nGrinnell's combined tuition, room, board, and fees for the 2013–2014 academic year is $53,654. Tuition and fees are $43,656 and room and board are $9,998.[http://www.grinnell.edu/admission/apply/tuition Grinnell College, Office of Admissions] . Retrieved 28 December 2012. Grinnell offers a large amount of need-based and merit-based aid in comparison with peer institutions. About 90% of students receive some form of financial aid.Grinnell College, Office of Admission. [http://www.grinnell.edu/admission/tuifees/ Tuition & Fees] . Retrieved 26 February 2007. In 2013-2014, 24% of students enrolled at Grinnell College were receiving federal Pell Grants, which are generally reserved for students from low-income families. The average financial aid package is over $26,000.College Board. [http://collegesearch.collegeboard.com/search/CollegeDetail.jsp?collegeId\n442&profileId=2 \"College Board Profile of Grinnell College\"]. Retrieved 2 October 2007.\n\nGrinnell College is one of a few dozen US colleges that maintain need-blind admissions and meets the full demonstrated financial need of all U.S. residents who are admitted to the college.\n\nWith the first-year students enrolled in the 2006–2007 school year, Grinnell has ended its need-blind admissions policy for international applicants. Under the old policy, students from countries outside the U.S. were admitted without any consideration of their ability to afford four years of study at the college. However, financial aid offers to these students were limited to half the cost of tuition. International students frequently carried very high workloads in an effort to pay the bills, and their academic performance often suffered.Leavens, Kennedy. [http://web.grinnell.edu/sandb/archives/volume_119/number_19/news/3.html \"Need-sensitivity? Admissions may start looking at international students’ bank accounts\"] , The Scarlet & Black, February 28, 2003. Under the new \"need-sensitive\" or \"need-aware\" policy, international students whose demonstrated financial needs can be met are given a slight admissions edge over applicants who can't. The twin hopes are that the enrolled international students will be able to dedicate more energy to their schoolwork, and also that this will ultimately allow the college to provide higher tuition grants to international students.\n\nAdditionally, several extremely competitive \"special scholarships\" were set up to meet the full demonstrated financial needs for students from the following countries or regions: Africa, Eastern and Central Europe, Latin America, Middle East and Asia, Nepal, the People's Republic of China, as well as for native speakers of Russian regardless of citizenship, available every other year.Grinnell College. [http://www.grinnell.edu/admission/apply/international/finaid/ \"International Student Financial Aid Policy\"].\n\nAthletics \n\nThe school's varsity sports teams are named the Pioneers. They participate in eighteen intercollegiate sports at the NCAA Division III level and in the Midwest Conference. In addition, Grinnell has several club sports teams that compete in non-varsity sports such as volleyball, sailing, water polo, ultimate and rugby union.\n\nNearly one-third of recent Grinnell graduates participated in at least one of varsity sports while attending the college and the college has led the Midwest Conference in the total number of Academic All-Conference honorees in last six years.\n\nThe men's water polo team, known as the Wild Turkeys, were runners-up in the 2007 College Water Polo Association (CWPA) Division III Collegiate National Club Championships hosted by Lindenwood University in St. Peters, Missouri. They also qualified for the tournament in 2008, 2009, 2011, 2013, and 2014. The Men's Ultimate team, nicknamed the Grinnellephants, qualified in 2008 for its first Division III National Championship in Versailles, Ohio. The Women's Ultimate team, nicknamed The Sticky Tongue Frogs, tied for third place in the 2010 Division III National Championship in Appleton, Wisconsin.USA Ultimate. [http://scores.usaultimate.org/scores/#college-womens/tournament/6639 2010 UPA College Division III Womens Championships]  The success was repeated in 2011 when the men's team placed third in 2011 Division III National Championship in Buffalo.\n\nIn February 2005, Grinnell became the first Division III school featured in a regular season basketball game by the ESPN network family in 30 years when it faced off against the Beloit Buccaneers on ESPN2.Amy Farnum. NCAA Sports. [http://www.ncaasports.com/basketball/mens/story/8141645 Grinnell Goes Big-Time]. January 28, 2005. Grinnell lost 86-85.D3Hoops.com [http://www.d3hoops.com/story.php?story=38975 Beloit 86, Grinnell 85] . February 3, 2005. Grinnell College's basketball team attracted ESPN due to the team's run and gun style of playing basketball, known in Grinnell simply as \"The System.\" Coach Dave Arseneault originated the Grinnell System that incorporates a continual full-court press, a fast-paced offense, an emphasis on offensive rebounding, a barrage of three-point shots and substitutions of five players at a time every 35 to 40 seconds. This allows a higher average playing time for more players than the \"starters\" and suits the Division III goals of scholar-athletes. \"The System\" has been criticized for not teaching the principles of defense. However, under \"The System,\" Grinnell has won three conference championships over the past ten years and have regularly placed in the top half of the conference. Coach Arseneault's teams have set numerous NCAA scoring records and several individuals on the Grinnell team have led the nation in scoring or assists.Official 2007 NCAA Men's Basketball Records Book, [https://www.ncaa.org/library/records/basketball/m_basketball_records_book/2007/2007_m_basketball_records.pdf NCAA.org]  Retrieved 7 March 2007.\n\nOn November 19, 2011 Grinnell player Griffin Lentsch set a new Division III individual scoring record in a game against Principia College. The  guard scored 89 points, besting the old record of 77, also set by a Pioneers player—Jeff Clement—in 1998. Lentsch made 27 of his 55 shots, including 15 three-pointers as Grinnell won the high-scoring game 145 to 97. On November 20, 2012 Grinnell's Jack Taylor broke Lentsch's scoring record, as well as the records for NCAA and collegiate scoring, in a 179-104 victory over Faith Baptist Bible. Taylor scored 138 points on 108 shots, along with 3 rebounds, 6 turnovers and 3 steals. Taylor went 27-71 from behind the arc. Taylor scored 109 points in a November 2013 game against Crossroads College to become the first player in NCAA history to have two 100-point games.\n\nSocial activities and organizations \n\nThe organizational structure of the Student Government Association, wielding a yearly budget of over $360,000 and unusually strong administrative influence, covers almost all aspects of student activity and campus life.\n\nFounded in November 2000, the student-run Student Endowment Investing Group (SEIG), actively invests over $100,000 of Grinnell College's endowment in the stock market. The group's mission is to provide interested students with valuable experience for future careers in finance.\n\nService organizations are popular. The Alternative Break (\"AltBreak\") program takes students to pursue service initiatives during school holidays, and as of 2005, Grinnell had more alumni per capita serving in the Peace Corps than any other college in the nation.Peace Corps. [http://www.peacecorps.gov/index.cfm?shell\nresources.media.press.view&news_id=1011 Peace Corps Announces the Colleges and Universities that Have Produced the Most Peace Corps Volunteers] . January 24, 2005. The college also runs its own post-graduation service program known as Grinnell Corps in Grinnell, China, Namibia, New Orleans, and Thailand, and has previously operated programs in Greece, Lesotho, Macau, and Nepal.Grinnell College Center for Careers, Life, and Service. [http://www.grinnell.edu/about/offices-services/cls/civic-engagement/grinnell-corps Grinnell Corps]. Retrieved 18 November 2014.\n\nThe Scarlet and Black is the campus newspaper and KDIC (88.5 FM) is the student-run radio station. The school has a monthly satirical newspaper, \"The B&S\".\n\nThe Scarlet and Black, or the S&B is the first college newspaper west of the Mississippi River and is currently in its 130th year of publication. The newspaper, typically 16 tabloid pages in length, is published in print most Fridays of the school year and [http://thesandb.com online].  Students primarily write the newspaper, although occasional letters from alumni or faculty are included. Funding comes from student fees and advertisers. \n\nGrinnell is also home to the unofficial \"B&S,\" which features satirical, made-up articles about current events both on and off campus.\n\nIn April 2007, Grinnell college students founded the Social Entrepreneurs of Grinnell, a student operated microfinance lending institution. The group collects donations for the purpose of making small loans at zero interest to business owners and artisans around the world. It is affiliated with kiva.org.[http://www.segrinnell.org/about/history/ History of Social Entrepreneurs of Grinnell], segrinnell.org, Retrieved 18 November 2014\n\nGrinnell also has an entirely student-run textbook lending library on campus. Aimed at the economically disadvantaged yet open to all, it allows students to check out books for the semester for free, defraying the high cost of college textbooks.Grinnell College, Student Government Association, [http://www.grinnellsga.com/?p=161 Grinnellsga.com] , Retrieved 13 July 2008. The library has no funding, relying solely on books donated. Since its founding in 2005, the collection has grown to thousands of books due to the generosity of the campus community. The library has expanded to include caps and gowns, which are lent out to graduating seniors every spring.[http://www.grinnell.edu/commencement \"Commencement\"], Grinnell.edu, Retrieved 18 November 2014.\n\nGrinnell hosts the Titular Head film festival.\n\nSelf-governance \n\nStudents at Grinnell adhere to an honor system known as \"self-governance\" wherein they are expected to govern their own choices and behavior with minimal direct intervention by the college administration. By cultivating a community based on freedom of choice, self-governance aims to encourage students to become responsible, respectful, and accountable members of the campus, town, and global community.\n\nEndowment \n\nWith an endowment of $1.65 billion (2016), Grinnell College is the 53rd wealthiest educational institution in North America.As of June 30, 2016.  Under the stewardship of Warren Buffett and Joseph Rosenfield, the college adopted an opportunistic strategy in managing its assets. In 1976, Grinnell's capital fund acquired a TV station, WDTN in Dayton, Ohio,[http://www.time.com/time/magazine/article/0,9171,920003,00.html \"Stratagems for Staying Solvent\"], Time, January 15, 1979. one of many investments that were unprecedented in their time for a college endowment. (Grinnell would sell the station in 1981.) Another move that significantly increased the endowment occurred when Rosenfield and the college contributed to the founding of Intel—an investment exceeding 10% of the venture capital raised to start the semiconductor company (Intel co-founder Robert Noyce was a Grinnell alumnus).CNNMoney.com, [http://money.cnn.com/2000/06/01/zweig_on_funds/zweig_on_funds/a.htm The Best Investor You've Never Heard Of], Jason Zweig, June 1, 2000.\n\nWarren Buffett played a significant role in growing the endowment at Grinnell, where he served as a trustee from 1968 until 2011, when he decided to step down from all boards not relating to Berkshire Hathaway.Grinnell College, Office of the President. [http://www.grinnell.edu/Offices/president/trustee/memberintro/buffett/ \"Board of Trustees: Warren E. Buffett 1968; Life Trustee 1987\".] Accessed May 12, 2008.[http://www.thesandb.com/news/buffett-ends-term-as-college-trustee.html \"Buffett ends term as college trustee\"], Scarlet and Black (Grinnell, Iowa), Nov. 4, 2011\n\nNotable alumni \n\n \n* Thomas Cech, 1970, co-winner of 1989 Nobel Prize in Chemistry, president of Howard Hughes Medical Institute.\n* Amy Clampitt, 1941, poet and critic.\n* Tom Cole, 1971, U.S. Congressman of Oklahoma's 4th District.\n* Mary Sue Coleman, 1965, former President of the University of Michigan\n* Gary Cooper, 1922, actor, best known for High Noon, received five Academy Award nominations for Best Actor, winning three.\n* Hallie Flanagan, 1911, pioneer of experimental theatre and director, the Federal Theatre Project of the Works Progress Administration; first woman to win a Guggenheim.\n* Herbie Hancock, 1960, Grammy Award-winning jazz musician and composer.\n* Edward Hirsch, 1972, poet and critic.\n* Harry Hopkins, 1912, senior advisor to Franklin Delano Roosevelt, principal architect of New Deal, WPA administrator.\n* Bernice King, 1985, American minister, best known as the youngest daughter of slain civil rights leader, Dr. Martin Luther King and Coretta Scott King.  \n* Kumail Nanjiani, 2001, Academy Award nominated writer, actor and comedian, best known for role on TV series Silicon Valley and co-authorship and performance in film The Big Sick. \n* Robert Noyce, 1949, co-founder of Intel, co-inventor of integrated circuit, National Medal of Science recipient.\n* Joseph Welch, 1914, head attorney for United States Army during Army-McCarthy Hearings. .",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Grinnell College" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13104" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Grinnell College is a private liberal arts college in Grinnell, Iowa, U.S., known for its rigorous academics and tradition of social responsibility.[http://www.princetonreview.com/college/research/profiles/academics.asp?listing1023453&ltid\n1&intbucketid= \"Grinnell College: Academics\"], The Princeton Review\". Retrieved 30 April 2008. It was founded in 1846, when a group of New England Congregationalists established the Trustees of Iowa College.\n\nHistory \n\nIn 1843, eleven Congregational ministers, all of whom trained at Andover Theological Seminary in Massachusetts, set out to proselytize on the frontier. Each man pledged to gather a church and together the group or band would seek to establish a college. When the group arrived in Iowa later that year, each selected a different town in which to establish a congregation. In 1846, they collectively established Iowa College in Davenport. A few months later, Iowa joined the Union.\n\nThe first 25 years of Grinnell's history saw a change in name and location. Iowa College moved farther west from Davenport, Iowa, to the town of Grinnell and unofficially adopted the name of its benefactor: an abolitionist minister, Josiah Bushnell Grinnell, to whom journalist Horace Greeley supposedly wrote \"Go West, young man, go West.\" However, Greeley vehemently denied ever saying this to Grinnell, or to anyone.Wall, Joseph Frazier. Grinnell College in the Nineteenth Century: From Salvation to Service. (Ames: Iowa State University Press), 91-92. The name of the corporation, \"The Trustees of Iowa College,\" remained, but in 1909 the name \"Grinnell College\" was adopted by the trustees for the institution.\n\nIn its early years, the College experienced setbacks. Although two students received bachelor of arts degrees in 1854 (the first to be granted by a college west of the Mississippi River), within 10 years the Civil War had claimed most of Grinnell's students and professors. In the decade following the war, growth resumed: women were officially admitted as candidates for degrees, and the curriculum was enlarged to include then-new areas of academic studies, such as natural sciences with laboratory work.\n\nIn 1882, Grinnell College was struck by a tornado — then called a cyclone, after which the college yearbook was named. The storm devastated the campus and destroyed both College buildings. Rebuilding began immediately, and the determination to expand wasn't limited to architecture: the curriculum was again extended to include departments in political science (the first in the United States) and modern languages.\n\nGrinnell became known as the center of the Social Gospel reform movement,. see footnote 4. as Robert Handy writes, \"The movement centered on the campus of Iowa (now Grinnell) College. Its leading figures were Professor George D. Herron and President George A. Gates\". Other firsts pointed to the lighter side of college life: the first intercollegiate football and baseball games west of the Mississippi were played in Grinnell, and the home teams won.\n\nAs the 20th century began, Grinnell established a Phi Beta Kappa chapter, introduced the departmental \"major\" system of study, began Grinnell-in-China (an educational mission that lasted until the Japanese invasion and resumed in 1987), and built a women's residence hall system that became a national model. The social consciousness fostered at Grinnell during these years became evident during Franklin D. Roosevelt's presidency, when Grinnell graduates Harry Hopkins '12, Chester Davis '11, Paul Appleby '13, Hallie Flanagan '11, and Florence Kerr '12 became influential New Deal administrators.\n\nConcern with social issues, educational innovation, and individual expression continue to shape Grinnell. As an example, the school’s \"5th year travel-service program,\" preceded the establishment of the Peace Corps by many years. Other recent innovations include first-year tutorials, cooperative pre-professional programs, and programs in quantitative studies and the societal impacts of technology.\n\nIn its 2016 edition of \"America's Best Colleges\", U.S. News & World Report ranked Grinnell tied for 19th among all liberal arts colleges in the United States, and tied for highest economic diversity as measured by low-income students receiving federal Pell Grants.\n\nCampus \n\nGrinnell College is located in the town of Grinnell, Iowa, about halfway between Des Moines and Iowa City. The main campus is bounded by 6th Avenue (which is also US Highway 6) on the south, 10th Avenue on the north, East Street on the east and Park Street on the west. The 120 acre campus contains sixty-three buildings ranging in style from Collegiate Gothic to Bauhaus.  Goodnow Hall and Mears Cottage (1889) are listed on the National Register of Historic Places.\n\nThe residential part of campus is divided into three sections: North Campus, East Campus, and South Campus. North and South Campus' dormitories are modeled explicitly after the residential colleges of Oxford and Cambridge. The East Campus dormitories were designed by William Rawn Associates  and feature a modern design. Upon completion East Campus was awarded LEED certification. The four East Campus dorms are made out of Iowa limestone which helped in securing the LEED certification. All three campuses feature dormitory buildings that are connected by a loggia, an architectural signature of the college. The loggia on South Campus is the only entirely closed loggia, featuring walls on all sides, while the loggias on East and North campus are only partially closed. From the time that the first dorm opened in 1915 until the fall of 1968, the nine north campus dorms were exclusively for male students, and the six south campus dorms were reserved for female students. The dorms are much smaller than those seen in many schools, ranging from the smallest, Rawson Hall, which houses 34 students, to the largest, Younker Hall, which houses 113.\n\nMost academic buildings are located on the southwestern quarter of campus. The athletic facilities are mostly located on the northeastern quarter, and some facilities are located north of 10th Avenue.\n\nIn addition to the main campus, the college owns much of the adjacent property. Many administrative offices are located in converted houses across Park Street near the older academic buildings, and several residences are used for college-owned off-campus student housing.\n\nThe college maintains a 365 acre environmental research area called the Conard Environmental Research Area (CERA). The U.S. Green Building Council awarded CERA's Environmental Education Center a gold certification.United States Green Building Council. [http://www.usgbc.org/ShowFile.aspx?DocumentID=1548 \"Cera Environmental Education Center LEED Scorecard\"]. Accessed May 14, 2007. The building is the first in Iowa to receive the designation.American Association for the Advancement of Sustainability in Higher Education. AAASHE Bulletin [http://www.aashe.org/archives/2006/06_06_08.php \"Grinnell College Education Center Receives LEED Gold Certification\"], June 8, 2006. Retrieved 29 April 2008.\n\nMany building projects have been undertaken in recent years at the College including a new athletics center, the Bucksbaum Center for the Arts, the renovation of the Robert Noyce '49 Science Center and the Joe Rosenfield '25 Student Center. Noted architect César Pelli designed the athletics center, the Joe Rosenfield '25 Student Center, and the Bucksbaum Center for the Arts.Hebel, Sara. [http://chronicle.com/weekly/v52/i31/31a01501.htm \"In Iowa, 2 Colleges Separated by 150 Miles and $1.37-Billion\"], The Chronicle of Higher Education, April 7, 2006. Retrieved 30 April 2008.\n\nAcademics \n\nReputation \n\nGrinnell College is nationally recognized as a leading undergraduate institution. In July 2006, The New York Times included Grinnell in its profile of the 20 colleges and universities of \"established or rising scholarship\" which are fast becoming viable alternatives to Ivy League institutions,Archibold, R.C. [https://query.nytimes.com/gst/fullpage.html?res9500E3D7163FF933A05754C0A9609C8B63&sec\n&spon&pagewanted\n2 \"Off the Beaten Path\"], The New York Times, 30 July 2006. and is considered one of the 30 Hidden Ivies.\n\nThe 2016 annual ranking of U.S. News & World Report rates it tied for the 19th best liberal arts college in the nation, 5th for \"Best Undergraduate Teaching,\" and 7th in \"Best Value Schools.\"  The College has been consistently ranked in the top 25 liberal arts colleges in the nation since the publication began in 1983.[http://chronicle.com/stats/usnews/index.php?category=Liberal+Arts+Colleges \"U.S. News Rankings Through the Years\"], Chronicle of Higher Education  Kiplinger's Personal Finance ranks Grinnell 9th in its 2016 ranking of \"best value\" liberal arts colleges in the United States.  Grinnell was ranked 15th in the 2015 Washington Monthly rankings, which focus on key outputs such as research, dollar value of scientific grants won, the number of graduates going on to earn Ph.D. degrees, and certain types of public service. In Forbes magazine's 2015 rankings of academic institutions, \"America's Top Colleges\" (which uses a non-traditional ranking system based on RateMyProfessors.com evaluations, notable alumni, student debt, percentage of students graduating in four years, and the number of students or faculty receiving prestigious awards), Grinnell College was ranked 56th among all private colleges, and 9th in the Midwest.\n\nData analyzed in 2006 place Grinnell at number eight among all U.S. undergraduate institutions in the proportion of graduates who go on to earn Ph.D. degrees and 15th for graduating female Ph.D. earners.Higher Education Data Sharing Consortium. \"Weighted Baccalaureate Origins Study.\" 2006. Grinnell College graduates enjoy a high acceptance rate to law school; over 46% of all applications submitted by students have been accepted by law schools.Grinnell College Career Development Office [http://web.grinnell.edu/careerdevelopment/gradschool/LawSchoolAdmissionReport/GeneralStatistics.html#anchor619447 Law School Admission Report]  Unigo.com's 2010 college rankings place Grinnell College in the \"Top 10 Colleges Where the Pursuit of Knowledge Goes Outside the Classroom\".\n\nFaculty \n\nGrinnell had 171 full-time faculty in Fall 2015, 98% of whom possess a doctorate or the terminal degree in their field. At the end of each semester, students fill out course surveys which play a large role in determining faculty tenure decisions and merit raises.\n\nAcademic program \n\nGrinnell's open curriculum encourages students to take initiative and to assume responsibility for their own courses of study. The sole core, or general education, requirement is the completion of the First-Year Tutorial, a one-semester, four-credit special topics seminar that stresses methods of inquiry, critical analysis, and writing skills. All other classes are chosen, with the direct guidance of a faculty member in the student's major department, by the student.\n\nThe academic program at Grinnell College emphasizes active learning and one-on-one interactions between faculty members and students. There are few large lecture classes. In sharp contrast to all public universities and many private universities in the United States, no classes, labs or other courses are taught by graduate students.\n\nGrinnell College expects all students to possess significant academic achievements. For example, the math department does not offer any basic-level classes such as college algebra, trigonometry, or pre-calculus, and remedial classes are not offered in any subject. However, several independent, non-credit programs assist students who need help in a specific subject. Among these programs are the Library Lab, Math Lab, Reading Lab, Science Learning Center, and the Writing Lab. While private tutors can be hired, participation in these programs is free for any enrolled student.\n\nGrinnell has twenty-six major departments and ten interdisciplinary concentrations. Popular majors include Psychology, Economics, Biology, History, English, and Political Science. The minimum requirements in a major area of study are typically limited to 32 credits in a single department, with some departments additionally requiring a small number of classes in related fields that are deemed critical for all students in that field. For example, the biology program requires 32 credits in the biology department plus two classes in chemistry and one in math.[http://www.grinnell.edu/academic/catalog/courses/biology/ Biology major requirements] Many students exceed the minimum requirements.\n\nTo graduate, students are normally expected to complete at least 32 credits in a major field and a total of 124 credits of academic work. To encourage students to explore courses outside of their primary interest area, no more than 48 credits in one department and no more than 92 credits in one division are counted towards this requirement.\n\nGrinnell’s commitment to the importance of off-campus study reflects the school’s emphasis on social and political awareness and the international nature of its campus. Approximately 60 percent of all Grinnell students participate in at least one of more than seventy off-campus programs, including the Grinnell-in-London program and study tours of China, France, Greece, and Russia. These study programs in Europe (including Russia), Africa, the Near East, and Asia, as well as nine programs in Central and South America, provide the opportunity for research in many disciplines, from archaeology to education to mathematics. In addition to off-campus programs, Grinnell offers internship programs in such areas as urban studies, art, and marine biology for students interested in field-based learning and experience in professional settings. Second- and third-year students may apply for summer internship grants and receive credit for the experience. Semester programs in the United States include those at Oak Ridge National Laboratory, Newberry Library, National Theatre Institute, and Grinnell-in-Washington, D.C.\n\nGrinnell also has invested in several interdisciplinary programs: the Center for Prairie Studies, Center for the Humanities, Center for International Studies, Noun Program in Women's Studies, Peace Studies Program, Rosenfield Public Affairs Program, and the Donald L. Wilson Program in Enterprise and Leadership.\n\nDespite the growing trend of U.S. students taking five or more years to finish an undergraduate degree, Grinnell College is strongly oriented towards students being enrolled full-time in exactly eight consecutive semesters at the college, although exceptions are available for medical issues and other emergencies.Grinnell College. [http://www.grinnell.edu/academic/catalog/acadreg/courseloads/ \"Academic Catalog: Academic Regulations\"] To avoid being suspended from the college, students must make \"normal progress towards graduation.\" This generally means that the student must pass at least 12 credits of classes in each individual semester, with grades C or higher, and have accumulated enough credits to make graduation possible at the end of four years, which requires an average of 15.5 credits each semester. A student who is not making normal progress towards graduation is placed on academic probation and may be dismissed from the college.Grinnell College. [http://www.grinnell.edu/academic/catalog/acadreg/probation/ \"Academic Catalog: Academic Regulations\"]\n\nAdmission\n\nU.S. News & World Report classifies Grinnell's selectivity as \"most selective.\"  For Fall 2015, Grinnell received 6,414 freshmen applications; 1,598 were admitted (24.9%).  Of the 41% of enrolled freshmen who submitted class rank, 81% were in the top 10% of their high school classes and 96% were in the top quarter. The middle 50% range of SAT scores for the enrolled freshmen was 640-740 for critical reading and 660-770 for math, while the ACT Composite range was 30–33.\n\nGrinnell College's admission selectivity rating, according to The Princeton Review in 2008, is a 95 out of 99.The Princeton Review. [http://www.princetonreview.com/schools/college/CollegeAdmissions.aspx?iid=1023453 Grinnell College]. Retrieved 23 November 2008. This rating is determined by several institutionally reported factors, including: the class rank, average standardized test scores, and average high school GPA of entering freshmen; the percentage of students who hail from out-of-state; and the percentage of applicants accepted.The Princeton Review. [http://www.princetonreview.com/college/research/articles/find/ratings.asp#selectivity About College]\n\nThe primary factor in evaluating applicants is the quality of the education they have received, as shown by their transcript. Additional factors include standardized test scores, student writing skills, recommendations, and extracurricular activities.[http://www.grinnell.edu/admission/apply/faqs/#lookingfor Grinnell College Admission FAQ]. Retrieved 15 May 2008.\n\nEarly decision rounds are offered to students in the fall; most students apply in January of their final year in high school. Admission decisions are released by April 1 of each year. All students begin classes in August.\n\nThe students' expectation of needing financial assistance does not affect the admission process.Montgomery, David. [http://web.grinnell.edu/sandb/archives/volume_121/number_17/news/article06.html \"International student financial aid goes need-sensitive\"] , The Scarlet & Black, March 4, 2005\n\nTuition and financial aid \n\nGrinnell's combined tuition, room, board, and fees for the 2013–2014 academic year is $53,654. Tuition and fees are $43,656 and room and board are $9,998.[http://www.grinnell.edu/admission/apply/tuition Grinnell College, Office of Admissions] . Retrieved 28 December 2012. Grinnell offers a large amount of need-based and merit-based aid in comparison with peer institutions. About 90% of students receive some form of financial aid.Grinnell College, Office of Admission. [http://www.grinnell.edu/admission/tuifees/ Tuition & Fees] . Retrieved 26 February 2007. In 2013-2014, 24% of students enrolled at Grinnell College were receiving federal Pell Grants, which are generally reserved for students from low-income families. The average financial aid package is over $26,000.College Board. [http://collegesearch.collegeboard.com/search/CollegeDetail.jsp?collegeId\n442&profileId=2 \"College Board Profile of Grinnell College\"]. Retrieved 2 October 2007.\n\nGrinnell College is one of a few dozen US colleges that maintain need-blind admissions and meets the full demonstrated financial need of all U.S. residents who are admitted to the college.\n\nWith the first-year students enrolled in the 2006–2007 school year, Grinnell has ended its need-blind admissions policy for international applicants. Under the old policy, students from countries outside the U.S. were admitted without any consideration of their ability to afford four years of study at the college. However, financial aid offers to these students were limited to half the cost of tuition. International students frequently carried very high workloads in an effort to pay the bills, and their academic performance often suffered.Leavens, Kennedy. [http://web.grinnell.edu/sandb/archives/volume_119/number_19/news/3.html \"Need-sensitivity? Admissions may start looking at international students’ bank accounts\"] , The Scarlet & Black, February 28, 2003. Under the new \"need-sensitive\" or \"need-aware\" policy, international students whose demonstrated financial needs can be met are given a slight admissions edge over applicants who can't. The twin hopes are that the enrolled international students will be able to dedicate more energy to their schoolwork, and also that this will ultimately allow the college to provide higher tuition grants to international students.\n\nAdditionally, several extremely competitive \"special scholarships\" were set up to meet the full demonstrated financial needs for students from the following countries or regions: Africa, Eastern and Central Europe, Latin America, Middle East and Asia, Nepal, the People's Republic of China, as well as for native speakers of Russian regardless of citizenship, available every other year.Grinnell College. [http://www.grinnell.edu/admission/apply/international/finaid/ \"International Student Financial Aid Policy\"].\n\nAthletics \n\nThe school's varsity sports teams are named the Pioneers. They participate in eighteen intercollegiate sports at the NCAA Division III level and in the Midwest Conference. In addition, Grinnell has several club sports teams that compete in non-varsity sports such as volleyball, sailing, water polo, ultimate and rugby union.\n\nNearly one-third of recent Grinnell graduates participated in at least one of varsity sports while attending the college and the college has led the Midwest Conference in the total number of Academic All-Conference honorees in last six years.\n\nThe men's water polo team, known as the Wild Turkeys, were runners-up in the 2007 College Water Polo Association (CWPA) Division III Collegiate National Club Championships hosted by Lindenwood University in St. Peters, Missouri. They also qualified for the tournament in 2008, 2009, 2011, 2013, and 2014. The Men's Ultimate team, nicknamed the Grinnellephants, qualified in 2008 for its first Division III National Championship in Versailles, Ohio. The Women's Ultimate team, nicknamed The Sticky Tongue Frogs, tied for third place in the 2010 Division III National Championship in Appleton, Wisconsin.USA Ultimate. [http://scores.usaultimate.org/scores/#college-womens/tournament/6639 2010 UPA College Division III Womens Championships]  The success was repeated in 2011 when the men's team placed third in 2011 Division III National Championship in Buffalo.\n\nIn February 2005, Grinnell became the first Division III school featured in a regular season basketball game by the ESPN network family in 30 years when it faced off against the Beloit Buccaneers on ESPN2.Amy Farnum. NCAA Sports. [http://www.ncaasports.com/basketball/mens/story/8141645 Grinnell Goes Big-Time]. January 28, 2005. Grinnell lost 86-85.D3Hoops.com [http://www.d3hoops.com/story.php?story=38975 Beloit 86, Grinnell 85] . February 3, 2005. Grinnell College's basketball team attracted ESPN due to the team's run and gun style of playing basketball, known in Grinnell simply as \"The System.\" Coach Dave Arseneault originated the Grinnell System that incorporates a continual full-court press, a fast-paced offense, an emphasis on offensive rebounding, a barrage of three-point shots and substitutions of five players at a time every 35 to 40 seconds. This allows a higher average playing time for more players than the \"starters\" and suits the Division III goals of scholar-athletes. \"The System\" has been criticized for not teaching the principles of defense. However, under \"The System,\" Grinnell has won three conference championships over the past ten years and have regularly placed in the top half of the conference. Coach Arseneault's teams have set numerous NCAA scoring records and several individuals on the Grinnell team have led the nation in scoring or assists.Official 2007 NCAA Men's Basketball Records Book, [https://www.ncaa.org/library/records/basketball/m_basketball_records_book/2007/2007_m_basketball_records.pdf NCAA.org]  Retrieved 7 March 2007.\n\nOn November 19, 2011 Grinnell player Griffin Lentsch set a new Division III individual scoring record in a game against Principia College. The  guard scored 89 points, besting the old record of 77, also set by a Pioneers player—Jeff Clement—in 1998. Lentsch made 27 of his 55 shots, including 15 three-pointers as Grinnell won the high-scoring game 145 to 97. On November 20, 2012 Grinnell's Jack Taylor broke Lentsch's scoring record, as well as the records for NCAA and collegiate scoring, in a 179-104 victory over Faith Baptist Bible. Taylor scored 138 points on 108 shots, along with 3 rebounds, 6 turnovers and 3 steals. Taylor went 27-71 from behind the arc. Taylor scored 109 points in a November 2013 game against Crossroads College to become the first player in NCAA history to have two 100-point games.\n\nSocial activities and organizations \n\nThe organizational structure of the Student Government Association, wielding a yearly budget of over $360,000 and unusually strong administrative influence, covers almost all aspects of student activity and campus life.\n\nFounded in November 2000, the student-run Student Endowment Investing Group (SEIG), actively invests over $100,000 of Grinnell College's endowment in the stock market. The group's mission is to provide interested students with valuable experience for future careers in finance.\n\nService organizations are popular. The Alternative Break (\"AltBreak\") program takes students to pursue service initiatives during school holidays, and as of 2005, Grinnell had more alumni per capita serving in the Peace Corps than any other college in the nation.Peace Corps. [http://www.peacecorps.gov/index.cfm?shell\nresources.media.press.view&news_id=1011 Peace Corps Announces the Colleges and Universities that Have Produced the Most Peace Corps Volunteers] . January 24, 2005. The college also runs its own post-graduation service program known as Grinnell Corps in Grinnell, China, Namibia, New Orleans, and Thailand, and has previously operated programs in Greece, Lesotho, Macau, and Nepal.Grinnell College Center for Careers, Life, and Service. [http://www.grinnell.edu/about/offices-services/cls/civic-engagement/grinnell-corps Grinnell Corps]. Retrieved 18 November 2014.\n\nThe Scarlet and Black is the campus newspaper and KDIC (88.5 FM) is the student-run radio station. The school has a monthly satirical newspaper, \"The B&S\".\n\nThe Scarlet and Black, or the S&B is the first college newspaper west of the Mississippi River and is currently in its 130th year of publication. The newspaper, typically 16 tabloid pages in length, is published in print most Fridays of the school year and [http://thesandb.com online].  Students primarily write the newspaper, although occasional letters from alumni or faculty are included. Funding comes from student fees and advertisers. \n\nGrinnell is also home to the unofficial \"B&S,\" which features satirical, made-up articles about current events both on and off campus.\n\nIn April 2007, Grinnell college students founded the Social Entrepreneurs of Grinnell, a student operated microfinance lending institution. The group collects donations for the purpose of making small loans at zero interest to business owners and artisans around the world. It is affiliated with kiva.org.[http://www.segrinnell.org/about/history/ History of Social Entrepreneurs of Grinnell], segrinnell.org, Retrieved 18 November 2014\n\nGrinnell also has an entirely student-run textbook lending library on campus. Aimed at the economically disadvantaged yet open to all, it allows students to check out books for the semester for free, defraying the high cost of college textbooks.Grinnell College, Student Government Association, [http://www.grinnellsga.com/?p=161 Grinnellsga.com] , Retrieved 13 July 2008. The library has no funding, relying solely on books donated. Since its founding in 2005, the collection has grown to thousands of books due to the generosity of the campus community. The library has expanded to include caps and gowns, which are lent out to graduating seniors every spring.[http://www.grinnell.edu/commencement \"Commencement\"], Grinnell.edu, Retrieved 18 November 2014.\n\nGrinnell hosts the Titular Head film festival.\n\nSelf-governance \n\nStudents at Grinnell adhere to an honor system known as \"self-governance\" wherein they are expected to govern their own choices and behavior with minimal direct intervention by the college administration. By cultivating a community based on freedom of choice, self-governance aims to encourage students to become responsible, respectful, and accountable members of the campus, town, and global community.\n\nEndowment \n\nWith an endowment of $1.65 billion (2016), Grinnell College is the 53rd wealthiest educational institution in North America.As of June 30, 2016.  Under the stewardship of Warren Buffett and Joseph Rosenfield, the college adopted an opportunistic strategy in managing its assets. In 1976, Grinnell's capital fund acquired a TV station, WDTN in Dayton, Ohio,[http://www.time.com/time/magazine/article/0,9171,920003,00.html \"Stratagems for Staying Solvent\"], Time, January 15, 1979. one of many investments that were unprecedented in their time for a college endowment. (Grinnell would sell the station in 1981.) Another move that significantly increased the endowment occurred when Rosenfield and the college contributed to the founding of Intel—an investment exceeding 10% of the venture capital raised to start the semiconductor company (Intel co-founder Robert Noyce was a Grinnell alumnus).CNNMoney.com, [http://money.cnn.com/2000/06/01/zweig_on_funds/zweig_on_funds/a.htm The Best Investor You've Never Heard Of], Jason Zweig, June 1, 2000.\n\nWarren Buffett played a significant role in growing the endowment at Grinnell, where he served as a trustee from 1968 until 2011, when he decided to step down from all boards not relating to Berkshire Hathaway.Grinnell College, Office of the President. [http://www.grinnell.edu/Offices/president/trustee/memberintro/buffett/ \"Board of Trustees: Warren E. Buffett 1968; Life Trustee 1987\".] Accessed May 12, 2008.[http://www.thesandb.com/news/buffett-ends-term-as-college-trustee.html \"Buffett ends term as college trustee\"], Scarlet and Black (Grinnell, Iowa), Nov. 4, 2011\n\nNotable alumni \n\n \n* Thomas Cech, 1970, co-winner of 1989 Nobel Prize in Chemistry, president of Howard Hughes Medical Institute.\n* Amy Clampitt, 1941, poet and critic.\n* Tom Cole, 1971, U.S. Congressman of Oklahoma's 4th District.\n* Mary Sue Coleman, 1965, former President of the University of Michigan\n* Gary Cooper, 1922, actor, best known for High Noon, received five Academy Award nominations for Best Actor, winning three.\n* Hallie Flanagan, 1911, pioneer of experimental theatre and director, the Federal Theatre Project of the Works Progress Administration; first woman to win a Guggenheim.\n* Herbie Hancock, 1960, Grammy Award-winning jazz musician and composer.\n* Edward Hirsch, 1972, poet and critic.\n* Harry Hopkins, 1912, senior advisor to Franklin Delano Roosevelt, principal architect of New Deal, WPA administrator.\n* Bernice King, 1985, American minister, best known as the youngest daughter of slain civil rights leader, Dr. Martin Luther King and Coretta Scott King.  \n* Kumail Nanjiani, 2001, Academy Award nominated writer, actor and comedian, best known for role on TV series Silicon Valley and co-authorship and performance in film The Big Sick. \n* Robert Noyce, 1949, co-founder of Intel, co-inventor of integrated circuit, National Medal of Science recipient.\n* Joseph Welch, 1914, head attorney for United States Army during Army-McCarthy Hearings. . Grinnell College. http://en.wikipedia.org/?curid=13104."
  }
}
