{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10384",
  "eid" : "f58b8290-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778491705,
  "textBody" : "The Boeing E-3 Sentry, commonly known as AWACS, is an American airborne early warning and control (AEW&C) aircraft developed by Boeing. Derived from the Boeing 707, it provides all-weather surveillance, command, control, and communications, and is used by the United States Air Force, NATO, Royal Air Force, French Air Force, and Royal Saudi Air Force. The E-3 is distinguished by the distinctive rotating radar dome above the fuselage. Production ended in 1992 after 68 aircraft had been built.\n\nIn the mid-1960s, the US Air Force (USAF) was seeking an aircraft to replace its piston-engined Lockheed EC-121 Warning Star, which had been in service for over a decade. After issuing preliminary development contracts to three companies, the USAF picked Boeing to construct two airframes to test Westinghouse Electric and Hughes's competing radars. Both radars used pulse-Doppler technology, with Westinghouse's design emerging as the contract winner. Testing on the first production E-3 began in October 1975.\n\nThe first USAF E-3 was delivered in March 1977, and during the next seven years, a total of 34 aircraft were manufactured. NATO, as a single identity, also had 18 aircraft manufactured, basing them in Germany. The E-3 was also sold to the United Kingdom (seven) and France (four) and Saudi Arabia (five, plus eight E-3-derived tanker aircraft). In 1991, when the last aircraft had been delivered, E-3s participated in Operation Desert Storm, playing a crucial role of directing coalition aircraft against the enemy. Throughout the aircraft's service life, numerous upgrades were performed to enhance its capabilities. In 1996, Westinghouse Electric's Defense & Electronic Systems division, was acquired by Northrop Corporation before its being renamed Northrop Grumman Mission Systems, which currently supports the E-3's radar.\n\nDevelopment\n\nBackground\n\nIn 1963, the USAF asked for proposals for an Airborne Warning and Control System (AWACS) to replace its EC-121 Warning Stars, which had served in the airborne early warning role for over a decade.Wilson 1998, p. 72. The new aircraft would take advantage of improvements in radar technology and in computer aided radar data analysis and data reduction. These developments allowed airborne radars to \"look down\", detect the movement of low-flying aircraft (see Look-down/shoot-down), and discriminate, even over land, target aircraft's movements—previously this had been impossible, due to the inability to discriminate an aircraft's track from ground clutter.Eden et al. 2004, p. 92. Contracts were issued to Boeing, Douglas, and Lockheed, the latter being eliminated in July 1966. In 1967, a parallel program was put into place to develop the radar, with Westinghouse Electric and the Hughes Aircraft being asked to compete in producing the radar system. In 1968, it was referred to as Overland Radar Technology (ORT) during development tests on the modified EC-121Q.Davies 2005, p. 2. The Westinghouse radar antenna was going to be used by whichever company won the radar competition, since Westinghouse had pioneered in the design of high-power RF phase-shifters.\n\nBoeing initially proposed a purpose-built aircraft, but tests indicated it would not outperform the already-operational 707, so the latter was chosen instead. To increase endurance, this design was to be powered by eight General Electric TF34s. It would carry its radar in a rotating dome mounted at the top of a forward-swept tail, above the fuselage. Boeing was selected ahead of McDonnell Douglas's DC-8-based proposal in July 1970. Initial orders were placed for two aircraft, designated EC-137D as test beds to evaluate the two competing radars. As the test-beds did not need the same 14-hour endurance demanded of the production aircraft, the EC-137s retained the Pratt & Whitney JT3D commercial engines, and a later reduction in endurance requirement led to retaining the normal engines in production.\n\nThe first EC-137 made its maiden flight on 9 February 1972, with the fly-off between the two radars taking place during March–July that year. Favorable test results led to the selection of Westinghouse's radar for the production aircraft.Davies 2005, pp. 5–6. Hughes's radar was initially thought to be a certain winner, simply because much of its design was also going into the new F-15 Eagle's radar program. The Westinghouse radar used a pipelined fast fourier transform (FFT) to digitally resolve 128 Doppler frequencies, while Hughes's radars used analog filters based on the design for the F-15 fighter. Westinghouse's engineering team won this competition by using a programmable 18-bit computer whose software could be modified before each mission. This computer was the AN/AYK-8 design from the B-57G program, and designated AYK-8-EP1 for its much expanded memory. This radar also multiplexed a beyond-the-horizon (BTH) pulse mode that could complement the pulse-Doppler radar mode. This proved to be beneficial especially when the BTH mode is used to detect ships at sea when the radar beam is directed below the horizon.\n\nFull-scale development\n\nApproval was given on 26 January 1973 for full-scale development of the AWACS system. To allow further development of the aircraft's systems, orders were placed for three preproduction aircraft, the first of which performed its maiden flight in February 1975. To save costs, the endurance requirements were relaxed, allowing the new aircraft to retain the four JT3D (U.S. military designation TF33) engines.Taylor et al. 1976, p. 246. IBM and Hazeltine were selected to develop the mission computer and display system. The IBM computer receiving the designation 4PI, and the software is written in JOVIAL. A Semi-Automatic Ground Environment (SAGE) or back-up interceptor control (BUIC) operator would immediately be at home with the track displays and tabular displays, but differences in symbology would create compatibility problems in tactical ground radar systems in Iceland, mainland Europe, and South Korea over Link-11 (TADIL-A).\n\nModifications to the Boeing 707 for the E-3 Sentry included a rotating radar dome (rotodome), hydraulics were changed from 3500 to 5000 PSI to drive the rotodome, single-point ground refueling, air refueling, and a bail-out tunnel or chute. The original design had two (one forward, and one aft), but the aft bail-out chute was deleted to cut mounting costs. Engineering, test and evaluation began on the first E-3 Sentry in October 1975. Between  1977 and 1992, a total of 68 E-3s were built.\n\nFuture status\n\nBecause the Boeing 707 is no longer in production, the E-3 mission package has been fitted into the Boeing E-767 for the Japan Air Self Defense Forces. The E-10 MC2A was intended to replace USAF E-3s—along with the RC-135 and the E-8, but the E-10 program was canceled by the Department of Defense. The USAF is now performing a series of incremental improvements, mainly to avionics, to bring the E-3 up to current standards of performance. Boeing is flight-testing its Block 40/45 E-3s. This modified E-3 contains upgrades of the mission crew and air battle management sections, as well as significantly upgraded electronic equipment.\n\nAnother program that the Air Force is considering is the \"Avionics Modernization Program\" (AMP). AMP would equip the E-3s with glass cockpits. The Air Force also wants modified E-3s with jet engines that are more reliable than the original ones, and also with at least 19% higher fuel efficiencies. New turbofan engines would give these E-3s longer ranges, longer time-on-station, and a shorter critical runway length. If the modification is carried out, the E-3s could take off with full fuel loads using runways only 10000 ft long, and also at higher ambient temperatures and lower barometric pressures, such as from bases in mountainous areas. Now that the E-8 Joint STARS are being fitted with the new Pratt & Whitney JT8D-219 turbofans, which are stated as having one-half the cost of the competing engine, the CFM56, the Air Force is again studying the possibility of replacing the E-3's original turbofan engines with more-efficient ones.\n\nUpgrading NATO's E-3 fleet is complicated by the heterogeneity of the fleet's equipment.  Each NATO member's E-3 aircraft are configured differently, and NATO has not finalized upgrade or replacement plans.  The airplanes themselves can be flown to 2050 with appropriate maintenance, but as the worldwide fleet of 707 aircraft dwindles, supporting the E-3 becomes more difficult.Batey, Angus, Early warning, Aviation Week and Space Technology, 21 April 2014, p.54\n\nDesign\n\nOverview\n\nThe E-3 Sentry's airframe is a modified Boeing 707-320B Advanced model. USAF and NATO E-3s have an unrefueled range of some 4000 mi or eight hours of flying. The newer E-3 versions bought by France, Saudi Arabia, and the UK are equipped with newer CFM56-2 turbofan engines, and these can fly for about 11 hours or about 5000 mi. The Sentry's range and on-station time can be increased through air-to-air refueling and the crews can work in shifts by the use of an on-board crew rest and meals area.\n\nWhen deployed, the E-3 monitors an assigned area of the battlefield and provides information for commanders of air operations to gain and maintain control of the battle; while as an air defense asset, E-3s can detect, identify, and track airborne enemy forces far from the boundaries of the U.S. or NATO countries and can direct fighter-interceptor aircraft to these targets. In support of air-to-ground operations, the E-3 can provide direct information needed for interdiction, reconnaissance, airlift, and close-air support for friendly ground forces.\n\nAvionics\n\nThe unpressurized rotodome is 30 feet (9.1 m) in diameter, six feet (1.8 m) thick at the center, and is held 11 feet (3.4 m) above the fuselage by two struts. It is tilted down at the front to reduce its aerodynamic drag, which lessens its detrimental effect on take-offs and endurance (which is corrected electronically by both the radar and secondary surveillance radar antenna phase shifters). The rotodome uses bleed air, outside cooling doors, and fluorocarbon based cold plate cooling to maintain the electronic and mechanical equipment temperatures. The hydraulically rotated antenna system permits the Westinghouse Corporation's AN/APY-1 and AN/APY-2 passive electronically scanned array radar system to provide surveillance from the Earth's surface up into the stratosphere, over land or water.\n\nOther major subsystems in the E-3 Sentry are navigation, communications, and computers. Fourteen consoles display computer-processed data in graphic and tabular format on video screens. Console operators perform surveillance, identification, weapons control, battle management and communications functions. The radar and computer subsystems on the E-3 can gather and present broad and detailed battlefield information. This includes position and tracking information on enemy aircraft and ships, and location and status of friendly aircraft and naval vessels. The information can be sent to major command and control centers in rear areas or aboard ships. In times of crisis, data can be forwarded to the National Command Authority in the U.S. via RC-135 or naval aircraft carrier task forces.\n\nElectrical generators mounted on each of the E-3's four engines provide the one megawatt of electrical power that is required by the E-3's radars and other electronics. Its pulse-Doppler radar (PD) has a range of more than 250 mi (400 km) for low-flying targets at its operating altitude, and the pulse (BTH) radar has a range of approximately 400 mi (650 km) for aircraft flying at medium to high altitudes. The radar, combined with an SSR, and electronic support measures (ESM), provides a look down capability, to detect, identify, and track low-flying aircraft, while eliminating ground clutter (radar) returns.\n\nUpgrades\n\nStarting in 1987, USAF E-3s were upgraded under the \"Block 30/35 Modification Program\" to enhance the E-3's capabilities. On 30 October 2001, the final airframe to be upgraded under this program was rolled out. Several major enhancements were made, firstly the installation of ESM and an electronic surveillance capability, for both active and passive means of detection. Also, Joint Tactical Information Distribution System (JTIDS) was installed, which provides rapid and secure communication for transmitting information, including target positions and identification data, to other friendly platforms. Global Positioning System (GPS) capability was also added. Onboard computers were also overhauled to accommodate JTIDS, Link-16, the new ESM systems and to provide for future enhancements.\n\nThe Radar System Improvement Program (RSIP) was a joint US/NATO development program. RSIP enhances the operational capability of the E-3 radars' electronic countermeasures, and dramatically improve the system's reliability, maintainability, and availability. Essentially, this program replaced the older transistor-transistor logic (TTL) and emitter-coupled logic (MECL) electronic components, long-since out of production, with off-the-shelf digital computers that utilised a High-level programming language instead of assembly language. Significant improvement came from adding pulse compression to the pulse-Doppler mode, replacing the old 8-bit FFT with 24-bit FFTs, and the 12-bit A/D (Sign + 12-bits) with a 15-bit A/D (Sign + 15-bits). These hardware and software modifications improve the E-3 radars' performance, providing enhanced detection with an emphasis towards low radar cross-section (RCS) targets.\n\nThe RAF had also joined the USAF in adding RSIP to upgrade the E-3's radars. The retrofitting of the E-3 squadrons was completed in December 2000. Along with the RSIP upgrade was installation of the Global Positioning System/Inertial Navigation Systems which dramatically improve positioning accuracy. In 2002, Boeing was awarded a contract to add RSIP to the small French AWACS squadron. Installation was completed in 2006.\n\nIn 2009, the USAF, in cooperation with NATO, entered into a major flight deck avionics modernization program in order to maintain compliance with worldwide airspace mandates. The program, called DRAGON (for DMS Replacement of Avionics for Global Operation and Navigation), was awarded in 2010 – the prime was Boeing and the subcontractor was Rockwell Collins. Drawing on their Flight2 Flight Management System (FMS), almost all the existing avionics were replaced with new, more modern digital equipment from Rockwell Collins. The major upgraded capabilities include a Digital Audio Distribution System, Mode-5/ADS-B transponder, Inmarsat & VDL datalinks, and a TAWS function.  The navigation system is capable of RNP-0.3, STARs and LNAV/VNAV approaches, and SIDs.  The centerpiece flight deck hardware consists of five 6x8 color graphics displays (2 PFDs, 2 IMFDs, and an EICAS), two color CDUs, and a Thales ISD standby. DRAGON lays the foundation for subsequent upgrades including GPS M-Code, Iridium ATC, and Autopilot.  USAF DRAGON Production begins in 2018.http://www.af.mil/News/Article-Display/Article/497312/dragon-program-to-improve-aging-e-3/\n\nOperational history\n\nIn March 1977, the 552nd Airborne Warning and Control Wing (now the 552d Air Control Wing) at Tinker AFB, Oklahoma received the first E-3 aircraft, flown and commanded by Major James R. Sterk. The 34th and last USAF Sentry was delivered in June 1984. In March 1996, the USAF activated the 513th Air Control Group (513 ACG), an ACC-gained Air Force Reserve Command (AFRC) AWACS unit under the Reserve Associate Program. Collocated with the 552 ACW at Tinker AFB, the 513 ACG which performs similar duties on active duty E-3 aircraft shared with the 552 ACW.\n\nThe USAF has a total of thirty-one E-3s in active service. Twenty-seven are stationed at Tinker AFB and belong to the Air Combat Command (ACC). Four are assigned to the Pacific Air Forces (PACAF) and stationed at Kadena AB, Okinawa and Elmendorf AFB, Alaska. One aircraft (TS-3) was assigned to Boeing for testing and development (retired/scrapped June 2012).\n\nIn 1977, Iran placed an order for ten E-3s, however this order was cancelled following the 1979 revolution.\n\nNATO acquired 18 E-3As and support equipment for a NATO air defense force. Since all aircraft must be registered with a certain country, the decision was made to register the 18 NATO Sentries with Luxembourg, a NATO member that previously did not have any air force. The first NATO E-3 was delivered in January 1982.Wilson 1998, p 75. The eighteen E-3s were operated by Number 1, 2 and 3 Squadrons of NATO's E-3 Component, based at NATO Air Base Geilenkirchen. Presently, 16 NATO E-3As are in the inventory, since one E-3 was lost in a crash and one was retired from service in 2015 (see below).\n\nThe United Kingdom and France are not part of the NATO E-3A Component, instead procuring E-3 aircraft through a joint project. The UK and France operate their E-3 aircraft independently of each other and of NATO. The UK operates six aircraft (with a seventh now retired) and France operates four aircraft, all fitted with the newer CFM56-2 engines. The British requirement came about following the cancellation of the British Aerospace Nimrod AEW3 project to replace the Avro Shackleton AEW2 during the 1980s. The UK E-3 order was placed in February 1987, with deliveries starting in 1990.Lake 2009, p. 44. The other operator of the type, delivered between June 1986 and September 1987, is Saudi Arabia which operates five aircraft, all fitted with CFM56-2 engines. This particular sale was hotly contested between the Reagan administration and opponents of the sale.\n\nE-3 Sentry aircraft were among the first to deploy during Operation Desert Shield, where they immediately established as an around-the-clock radar screen to defend against Iraqi forces. During Operation Desert Storm, E-3s flew 379 missions and logged 5,052 hours of on-station time.Veronico and Dunn 2004, p. 83. The data collection capability of the E-3 radar and computer subsystems allowed an entire air war to be recorded for the first time in history. In addition to providing senior leadership with time-critical information on the actions of enemy forces, E-3 controllers assisted in 38 of the 41 air-to-air kills recorded during the conflict.\n\nNATO E-3s joined their USAF colleagues for joint air defense as part of Operation Eagle Assist in the wake of the September 11, 2001 terrorist attacks on the World Trade Center towers and the Pentagon.[http://www.e3a.nato.int/eng/html/organizations/humanitarian.htm ″The history of the TCA Squadron.″]  NATO AWACS\n\nNATO and RAF E-3s participated in the international military operation in Libya.\n\nOn 27 January 2015, the RAF deployed an E-3D Sentry to Cyprus in support of U.S.-led coalition airstrikes against Islamic State militants in Iraq and Syria.  The Sentry joins RAF Panavia Tornado, MQ-9 Reaper, and AirTanker Voyager aircraft performing or supporting almost daily strikes against militants.[http://www.flightglobal.com/news/articles/raf-sentry-aew-aircraft-deploys-in-support-of-counter-is-408549/ RAF Sentry AEW aircraft deploys in support of counter-IS mission] – Flightglobal.com, 2 February 2015\n\nOn 23 June 2015, the first of the original 18 NATO E-3A AWACS aircraft to retire, arrived at Davis-Monthan AFB near Tucson, AZ.  The aircraft, LX-N 90449, will be placed in parts reclamation storage where critical parts will be removed by NATO technicians to support their remaining fleet of 16 Boeing E-3A aircraft. It had accumulated 22,206 flight hours between 19 August 1983 and 13 May 2015 and operated out of twenty-one different countries in support of NATO operational activities. The aircraft was due in mid-July 2015 for a six-year cycle Depot Level Maintenance (DLM) inspection which would have been very costly.  Without the inspection, the aircraft would no longer be allowed to fly. The so-called \"449 Retirement Project\" will result in reclamation of critical parts with a value of upwards of $40,000,000.  Some of the parts to be removed are no longer on the market or have become very expensive.https://www.dvidshub.net/video/411646/nato-e-3a-arrives-davis-monthan-afb#.VZvF7vlVikq\n\nOn 18 November 2015, an E-3G was deployed to the Middle East to begin \"immediately\" flying combat missions in support of Operation Inherent Resolve against ISIL, marking the first combat deployment of the upgraded AWAC Block 40/45.  The $2.7 billion development effort started in 2003, with the first five aircraft achieving initial operational capability (IOC) in July 2015.  The Block 40/45 upgrade is the most extensive the E-3 has undergone, replacing its 1970s computer technology with an early 2000s standard and including a deployable ground system that receives, processes, and disseminates data. The Air Force plans to convert 24 AWACS to E-3G standard, while retiring seven from the fleet to avoid upgrade costs and harvest out-of-production components.[https://www.flightglobal.com/news/articles/boeing-e-3g-makes-middle-east-combat-debut-419318/ Boeing E-3G makes Middle East combat debut] – Flightglobal.com, 19 November 2015\n\nVariants\n\n;EC-137D\nTwo prototype AWACS aircraft with JT3D engines, one fitted with a Westinghouse Electric radar and the other with a Hughes Aircraft Company radar. Both converted to E-3A standard with TF33 engines.\n;E-3A\nProduction aircraft with TF33 engines and AN/APY-1 radar, 24 built for USAF later converted to E-3B standard, total of 34 ordered but the last 9 completed as E-3C.Pither 1998, pp. 40–42 One additional aircraft retained by Boeing for testing, 18 built for NATO with TF33 engines and five for Saudi Arabia with CFM56 engines.\n;KE-3A\nThese are not AWACS aircraft but CFM56 powered tankers based on the E-3 design. Eight were sold to Saudi Arabia.\n;E-3B\nE-3As with improvements, 24 conversions.\n;E-3C\nProduction aircraft with AN/APY-2 radar, additional electronic consoles and system improvements, ten built.\n;JE-3C\nOne E-3A aircraft used by Boeing for trials later redesignated E-3C.\n;E-3D\nProduction aircraft for the Royal Air Force to E-3C standard with CFM56 engines and British modifications designated Sentry AEW.1, seven built.\n;E-3F\nProduction aircraft for the French Air Force to E-3C standard with CFM56 engines and French modifications, four built.\n;E-3G\nUSAF Block 40/45 modification. Includes hardware and software upgrades to improve communications, computer processing power, threat tracking, and others, and automates some previously manual functions.  initial operating capability (IOC) reached in July 2015.[http://www.tinker.af.mil/news/story.asp?id\n123463680 The wait is over…E-3 Block 40/45 deploys to combat theater]  – AF.mil, 18 November 2015\n\nOperators\n\n;: The French Air Force purchased four E-3F aircraft similar to the British E-3D aircraft.\nAll planes are assigned to the Escadron de Détection et de Commandement Aéroporté (ECDA, Air detection and command squadron) and are based at Avord Air Base.Wilson 1998, p 76.\n\n;\nBased in Geilenkirchen, Germany, 18 E-3 AWACS were purchased – one lost in Greece, one retired from service. All of these aircraft are officially registered as aircraft of Luxembourg, a NATO member with no other air force. Responsible for monitoring airspace for NATO operations around the world.\n* [https://web.archive.org/web/20161005091546/http://www.e3a.nato.int/eng/html/organizations/aircrew_training_sq.htm Aircrew Training Squadron]\n* [https://web.archive.org/web/20160602204204/http://www.e3a.nato.int/eng/html/organizations/sq_1.htm Flying Squadron 1]\n* [https://web.archive.org/web/20160612235226/http://www.e3a.nato.int/eng/html/organizations/sq_2.htm Flying Squadron 2]\n* [https://web.archive.org/web/20161005093211/http://www.e3a.nato.int/eng/html/organizations/sq_3.htm Flying Squadron 3] – disbanded in 2015\n\n;: The Royal Saudi Air Force purchased five E-3A aircraft and eight KE-3A tanker aircraft in 1983.Wilson 1998, pp. 75–76.\n* No. 18 Squadron\n\n;: The Royal Air Force purchased seven E-3Ds by October 1987.  All seven are still in service; six are operational and one is used for training.  The aircraft are designated Sentry AEW.1.\n* No. 8 Squadron\n* No. 23 Squadron – disbanded in 2009\n\n;: The United States Air Force currently has 32 E-3s.\n\nTactical Air Command 1976–1992\nAir Combat Command 1992–present\n* 552d Air Control Wing – Tinker Air Force Base, Oklahoma\n:960th Airborne Air Control Squadron 2001–present (NAS Keflavik, Iceland 1979–1992)\n:963d Airborne Air Control Squadron 1976–present\n:964th Airborne Air Control Squadron 1977–present\n:965th Airborne Air Control Squadron 1978–1979, 1984–present\n:966th Airborne Air Control Squadron 1976–present\n* 380th Air Expeditionary Wing – Al Dhafra Air Base, United Arab Emirates\n:968th Expeditionary Airborne Air Control Squadron 2002–2003, 2013–present\nAir Force Reserve Command\n* 513th Air Control Group (Associate) – Tinker AFB, Oklahoma\n:970th Airborne Air Control Squadron 1996–present\nPacific Air Forces\n* 3d Wing – Elmendorf AFB, Alaska\n:962d Airborne Air Control Squadron 1986–present\n* 18th Wing – Kadena AB, Japan\n:961st Airborne Air Control Squadron 1979–present\n\nIncidents and accidents\n\nThe E-3 has been involved in three hull-loss accidents, and one radar antenna destroyed during RSIP development (see photo under Avionics).\n* On 9 December 1983, a U.S. Air Force E-3 Sentry collided with a KC-135A Tanker aircraft over Saudi Arabia during Operation ELF-1. Both aircraft were recovered back to Riyadh Air Base. The Tanker received substantial damage, with parts impact and loss of pressure, as well as shut down of the two starboard engines. The E-3 received severe damage with the partial loss of a left wing section.\n* On 22 September 1995, a U.S. Air Force E-3 Sentry (callsign Yukla 27, serial number 77-0354), crashed shortly after take off from Elmendorf AFB, Alaska. The plane lost power to both left side engines after these engines ingested several Canada geese during takeoff. The aircraft went down about 2 mile northeast of the runway, killing all 24 crew members on board.\n* On 14 July 1996, a NATO E-3A, LX-N90457, overran the runway and dipped into the sea on takeoff from Preveza AB, Preveza, Greece. The fuselage broke into two, destroying the aircraft, but there were no casualties among the 16 crew members on board.Hurturk 1998, p. 358. It allegedly suffered a birdstrike during take off, but no evidence of a birdstrike was found.\n* On 28 August 2009, a USAF E-3C, 83-0008, was severely damaged while landing at Nellis Air Force Base, after experiencing a nose-wheel failure. The failure resulted in a fire that caused a reported US$100 million in damage.[http://www.af.mil/news/story.asp?id\n123165650 \"E-3 damaged while landing at Nellis\"]. US Air Force, 31 August 2009. (copy on Wikisource) The accident was determined to be pilot error: at an altitude of about 100 ft, both the co-pilot and the pilot lost track of their height above ground. The aircraft struck the ground with such force that the nose wheel strut broke. The aircraft slid along the runway for 4500 ft.\n\nSpecifications (USAF/NATO)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Boeing E-3 Sentry" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10384" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Boeing E-3 Sentry, commonly known as AWACS, is an American airborne early warning and control (AEW&C) aircraft developed by Boeing. Derived from the Boeing 707, it provides all-weather surveillance, command, control, and communications, and is used by the United States Air Force, NATO, Royal Air Force, French Air Force, and Royal Saudi Air Force. The E-3 is distinguished by the distinctive rotating radar dome above the fuselage. Production ended in 1992 after 68 aircraft had been built.\n\nIn the mid-1960s, the US Air Force (USAF) was seeking an aircraft to replace its piston-engined Lockheed EC-121 Warning Star, which had been in service for over a decade. After issuing preliminary development contracts to three companies, the USAF picked Boeing to construct two airframes to test Westinghouse Electric and Hughes's competing radars. Both radars used pulse-Doppler technology, with Westinghouse's design emerging as the contract winner. Testing on the first production E-3 began in October 1975.\n\nThe first USAF E-3 was delivered in March 1977, and during the next seven years, a total of 34 aircraft were manufactured. NATO, as a single identity, also had 18 aircraft manufactured, basing them in Germany. The E-3 was also sold to the United Kingdom (seven) and France (four) and Saudi Arabia (five, plus eight E-3-derived tanker aircraft). In 1991, when the last aircraft had been delivered, E-3s participated in Operation Desert Storm, playing a crucial role of directing coalition aircraft against the enemy. Throughout the aircraft's service life, numerous upgrades were performed to enhance its capabilities. In 1996, Westinghouse Electric's Defense & Electronic Systems division, was acquired by Northrop Corporation before its being renamed Northrop Grumman Mission Systems, which currently supports the E-3's radar.\n\nDevelopment\n\nBackground\n\nIn 1963, the USAF asked for proposals for an Airborne Warning and Control System (AWACS) to replace its EC-121 Warning Stars, which had served in the airborne early warning role for over a decade.Wilson 1998, p. 72. The new aircraft would take advantage of improvements in radar technology and in computer aided radar data analysis and data reduction. These developments allowed airborne radars to \"look down\", detect the movement of low-flying aircraft (see Look-down/shoot-down), and discriminate, even over land, target aircraft's movements—previously this had been impossible, due to the inability to discriminate an aircraft's track from ground clutter.Eden et al. 2004, p. 92. Contracts were issued to Boeing, Douglas, and Lockheed, the latter being eliminated in July 1966. In 1967, a parallel program was put into place to develop the radar, with Westinghouse Electric and the Hughes Aircraft being asked to compete in producing the radar system. In 1968, it was referred to as Overland Radar Technology (ORT) during development tests on the modified EC-121Q.Davies 2005, p. 2. The Westinghouse radar antenna was going to be used by whichever company won the radar competition, since Westinghouse had pioneered in the design of high-power RF phase-shifters.\n\nBoeing initially proposed a purpose-built aircraft, but tests indicated it would not outperform the already-operational 707, so the latter was chosen instead. To increase endurance, this design was to be powered by eight General Electric TF34s. It would carry its radar in a rotating dome mounted at the top of a forward-swept tail, above the fuselage. Boeing was selected ahead of McDonnell Douglas's DC-8-based proposal in July 1970. Initial orders were placed for two aircraft, designated EC-137D as test beds to evaluate the two competing radars. As the test-beds did not need the same 14-hour endurance demanded of the production aircraft, the EC-137s retained the Pratt & Whitney JT3D commercial engines, and a later reduction in endurance requirement led to retaining the normal engines in production.\n\nThe first EC-137 made its maiden flight on 9 February 1972, with the fly-off between the two radars taking place during March–July that year. Favorable test results led to the selection of Westinghouse's radar for the production aircraft.Davies 2005, pp. 5–6. Hughes's radar was initially thought to be a certain winner, simply because much of its design was also going into the new F-15 Eagle's radar program. The Westinghouse radar used a pipelined fast fourier transform (FFT) to digitally resolve 128 Doppler frequencies, while Hughes's radars used analog filters based on the design for the F-15 fighter. Westinghouse's engineering team won this competition by using a programmable 18-bit computer whose software could be modified before each mission. This computer was the AN/AYK-8 design from the B-57G program, and designated AYK-8-EP1 for its much expanded memory. This radar also multiplexed a beyond-the-horizon (BTH) pulse mode that could complement the pulse-Doppler radar mode. This proved to be beneficial especially when the BTH mode is used to detect ships at sea when the radar beam is directed below the horizon.\n\nFull-scale development\n\nApproval was given on 26 January 1973 for full-scale development of the AWACS system. To allow further development of the aircraft's systems, orders were placed for three preproduction aircraft, the first of which performed its maiden flight in February 1975. To save costs, the endurance requirements were relaxed, allowing the new aircraft to retain the four JT3D (U.S. military designation TF33) engines.Taylor et al. 1976, p. 246. IBM and Hazeltine were selected to develop the mission computer and display system. The IBM computer receiving the designation 4PI, and the software is written in JOVIAL. A Semi-Automatic Ground Environment (SAGE) or back-up interceptor control (BUIC) operator would immediately be at home with the track displays and tabular displays, but differences in symbology would create compatibility problems in tactical ground radar systems in Iceland, mainland Europe, and South Korea over Link-11 (TADIL-A).\n\nModifications to the Boeing 707 for the E-3 Sentry included a rotating radar dome (rotodome), hydraulics were changed from 3500 to 5000 PSI to drive the rotodome, single-point ground refueling, air refueling, and a bail-out tunnel or chute. The original design had two (one forward, and one aft), but the aft bail-out chute was deleted to cut mounting costs. Engineering, test and evaluation began on the first E-3 Sentry in October 1975. Between  1977 and 1992, a total of 68 E-3s were built.\n\nFuture status\n\nBecause the Boeing 707 is no longer in production, the E-3 mission package has been fitted into the Boeing E-767 for the Japan Air Self Defense Forces. The E-10 MC2A was intended to replace USAF E-3s—along with the RC-135 and the E-8, but the E-10 program was canceled by the Department of Defense. The USAF is now performing a series of incremental improvements, mainly to avionics, to bring the E-3 up to current standards of performance. Boeing is flight-testing its Block 40/45 E-3s. This modified E-3 contains upgrades of the mission crew and air battle management sections, as well as significantly upgraded electronic equipment.\n\nAnother program that the Air Force is considering is the \"Avionics Modernization Program\" (AMP). AMP would equip the E-3s with glass cockpits. The Air Force also wants modified E-3s with jet engines that are more reliable than the original ones, and also with at least 19% higher fuel efficiencies. New turbofan engines would give these E-3s longer ranges, longer time-on-station, and a shorter critical runway length. If the modification is carried out, the E-3s could take off with full fuel loads using runways only 10000 ft long, and also at higher ambient temperatures and lower barometric pressures, such as from bases in mountainous areas. Now that the E-8 Joint STARS are being fitted with the new Pratt & Whitney JT8D-219 turbofans, which are stated as having one-half the cost of the competing engine, the CFM56, the Air Force is again studying the possibility of replacing the E-3's original turbofan engines with more-efficient ones.\n\nUpgrading NATO's E-3 fleet is complicated by the heterogeneity of the fleet's equipment.  Each NATO member's E-3 aircraft are configured differently, and NATO has not finalized upgrade or replacement plans.  The airplanes themselves can be flown to 2050 with appropriate maintenance, but as the worldwide fleet of 707 aircraft dwindles, supporting the E-3 becomes more difficult.Batey, Angus, Early warning, Aviation Week and Space Technology, 21 April 2014, p.54\n\nDesign\n\nOverview\n\nThe E-3 Sentry's airframe is a modified Boeing 707-320B Advanced model. USAF and NATO E-3s have an unrefueled range of some 4000 mi or eight hours of flying. The newer E-3 versions bought by France, Saudi Arabia, and the UK are equipped with newer CFM56-2 turbofan engines, and these can fly for about 11 hours or about 5000 mi. The Sentry's range and on-station time can be increased through air-to-air refueling and the crews can work in shifts by the use of an on-board crew rest and meals area.\n\nWhen deployed, the E-3 monitors an assigned area of the battlefield and provides information for commanders of air operations to gain and maintain control of the battle; while as an air defense asset, E-3s can detect, identify, and track airborne enemy forces far from the boundaries of the U.S. or NATO countries and can direct fighter-interceptor aircraft to these targets. In support of air-to-ground operations, the E-3 can provide direct information needed for interdiction, reconnaissance, airlift, and close-air support for friendly ground forces.\n\nAvionics\n\nThe unpressurized rotodome is 30 feet (9.1 m) in diameter, six feet (1.8 m) thick at the center, and is held 11 feet (3.4 m) above the fuselage by two struts. It is tilted down at the front to reduce its aerodynamic drag, which lessens its detrimental effect on take-offs and endurance (which is corrected electronically by both the radar and secondary surveillance radar antenna phase shifters). The rotodome uses bleed air, outside cooling doors, and fluorocarbon based cold plate cooling to maintain the electronic and mechanical equipment temperatures. The hydraulically rotated antenna system permits the Westinghouse Corporation's AN/APY-1 and AN/APY-2 passive electronically scanned array radar system to provide surveillance from the Earth's surface up into the stratosphere, over land or water.\n\nOther major subsystems in the E-3 Sentry are navigation, communications, and computers. Fourteen consoles display computer-processed data in graphic and tabular format on video screens. Console operators perform surveillance, identification, weapons control, battle management and communications functions. The radar and computer subsystems on the E-3 can gather and present broad and detailed battlefield information. This includes position and tracking information on enemy aircraft and ships, and location and status of friendly aircraft and naval vessels. The information can be sent to major command and control centers in rear areas or aboard ships. In times of crisis, data can be forwarded to the National Command Authority in the U.S. via RC-135 or naval aircraft carrier task forces.\n\nElectrical generators mounted on each of the E-3's four engines provide the one megawatt of electrical power that is required by the E-3's radars and other electronics. Its pulse-Doppler radar (PD) has a range of more than 250 mi (400 km) for low-flying targets at its operating altitude, and the pulse (BTH) radar has a range of approximately 400 mi (650 km) for aircraft flying at medium to high altitudes. The radar, combined with an SSR, and electronic support measures (ESM), provides a look down capability, to detect, identify, and track low-flying aircraft, while eliminating ground clutter (radar) returns.\n\nUpgrades\n\nStarting in 1987, USAF E-3s were upgraded under the \"Block 30/35 Modification Program\" to enhance the E-3's capabilities. On 30 October 2001, the final airframe to be upgraded under this program was rolled out. Several major enhancements were made, firstly the installation of ESM and an electronic surveillance capability, for both active and passive means of detection. Also, Joint Tactical Information Distribution System (JTIDS) was installed, which provides rapid and secure communication for transmitting information, including target positions and identification data, to other friendly platforms. Global Positioning System (GPS) capability was also added. Onboard computers were also overhauled to accommodate JTIDS, Link-16, the new ESM systems and to provide for future enhancements.\n\nThe Radar System Improvement Program (RSIP) was a joint US/NATO development program. RSIP enhances the operational capability of the E-3 radars' electronic countermeasures, and dramatically improve the system's reliability, maintainability, and availability. Essentially, this program replaced the older transistor-transistor logic (TTL) and emitter-coupled logic (MECL) electronic components, long-since out of production, with off-the-shelf digital computers that utilised a High-level programming language instead of assembly language. Significant improvement came from adding pulse compression to the pulse-Doppler mode, replacing the old 8-bit FFT with 24-bit FFTs, and the 12-bit A/D (Sign + 12-bits) with a 15-bit A/D (Sign + 15-bits). These hardware and software modifications improve the E-3 radars' performance, providing enhanced detection with an emphasis towards low radar cross-section (RCS) targets.\n\nThe RAF had also joined the USAF in adding RSIP to upgrade the E-3's radars. The retrofitting of the E-3 squadrons was completed in December 2000. Along with the RSIP upgrade was installation of the Global Positioning System/Inertial Navigation Systems which dramatically improve positioning accuracy. In 2002, Boeing was awarded a contract to add RSIP to the small French AWACS squadron. Installation was completed in 2006.\n\nIn 2009, the USAF, in cooperation with NATO, entered into a major flight deck avionics modernization program in order to maintain compliance with worldwide airspace mandates. The program, called DRAGON (for DMS Replacement of Avionics for Global Operation and Navigation), was awarded in 2010 – the prime was Boeing and the subcontractor was Rockwell Collins. Drawing on their Flight2 Flight Management System (FMS), almost all the existing avionics were replaced with new, more modern digital equipment from Rockwell Collins. The major upgraded capabilities include a Digital Audio Distribution System, Mode-5/ADS-B transponder, Inmarsat & VDL datalinks, and a TAWS function.  The navigation system is capable of RNP-0.3, STARs and LNAV/VNAV approaches, and SIDs.  The centerpiece flight deck hardware consists of five 6x8 color graphics displays (2 PFDs, 2 IMFDs, and an EICAS), two color CDUs, and a Thales ISD standby. DRAGON lays the foundation for subsequent upgrades including GPS M-Code, Iridium ATC, and Autopilot.  USAF DRAGON Production begins in 2018.http://www.af.mil/News/Article-Display/Article/497312/dragon-program-to-improve-aging-e-3/\n\nOperational history\n\nIn March 1977, the 552nd Airborne Warning and Control Wing (now the 552d Air Control Wing) at Tinker AFB, Oklahoma received the first E-3 aircraft, flown and commanded by Major James R. Sterk. The 34th and last USAF Sentry was delivered in June 1984. In March 1996, the USAF activated the 513th Air Control Group (513 ACG), an ACC-gained Air Force Reserve Command (AFRC) AWACS unit under the Reserve Associate Program. Collocated with the 552 ACW at Tinker AFB, the 513 ACG which performs similar duties on active duty E-3 aircraft shared with the 552 ACW.\n\nThe USAF has a total of thirty-one E-3s in active service. Twenty-seven are stationed at Tinker AFB and belong to the Air Combat Command (ACC). Four are assigned to the Pacific Air Forces (PACAF) and stationed at Kadena AB, Okinawa and Elmendorf AFB, Alaska. One aircraft (TS-3) was assigned to Boeing for testing and development (retired/scrapped June 2012).\n\nIn 1977, Iran placed an order for ten E-3s, however this order was cancelled following the 1979 revolution.\n\nNATO acquired 18 E-3As and support equipment for a NATO air defense force. Since all aircraft must be registered with a certain country, the decision was made to register the 18 NATO Sentries with Luxembourg, a NATO member that previously did not have any air force. The first NATO E-3 was delivered in January 1982.Wilson 1998, p 75. The eighteen E-3s were operated by Number 1, 2 and 3 Squadrons of NATO's E-3 Component, based at NATO Air Base Geilenkirchen. Presently, 16 NATO E-3As are in the inventory, since one E-3 was lost in a crash and one was retired from service in 2015 (see below).\n\nThe United Kingdom and France are not part of the NATO E-3A Component, instead procuring E-3 aircraft through a joint project. The UK and France operate their E-3 aircraft independently of each other and of NATO. The UK operates six aircraft (with a seventh now retired) and France operates four aircraft, all fitted with the newer CFM56-2 engines. The British requirement came about following the cancellation of the British Aerospace Nimrod AEW3 project to replace the Avro Shackleton AEW2 during the 1980s. The UK E-3 order was placed in February 1987, with deliveries starting in 1990.Lake 2009, p. 44. The other operator of the type, delivered between June 1986 and September 1987, is Saudi Arabia which operates five aircraft, all fitted with CFM56-2 engines. This particular sale was hotly contested between the Reagan administration and opponents of the sale.\n\nE-3 Sentry aircraft were among the first to deploy during Operation Desert Shield, where they immediately established as an around-the-clock radar screen to defend against Iraqi forces. During Operation Desert Storm, E-3s flew 379 missions and logged 5,052 hours of on-station time.Veronico and Dunn 2004, p. 83. The data collection capability of the E-3 radar and computer subsystems allowed an entire air war to be recorded for the first time in history. In addition to providing senior leadership with time-critical information on the actions of enemy forces, E-3 controllers assisted in 38 of the 41 air-to-air kills recorded during the conflict.\n\nNATO E-3s joined their USAF colleagues for joint air defense as part of Operation Eagle Assist in the wake of the September 11, 2001 terrorist attacks on the World Trade Center towers and the Pentagon.[http://www.e3a.nato.int/eng/html/organizations/humanitarian.htm ″The history of the TCA Squadron.″]  NATO AWACS\n\nNATO and RAF E-3s participated in the international military operation in Libya.\n\nOn 27 January 2015, the RAF deployed an E-3D Sentry to Cyprus in support of U.S.-led coalition airstrikes against Islamic State militants in Iraq and Syria.  The Sentry joins RAF Panavia Tornado, MQ-9 Reaper, and AirTanker Voyager aircraft performing or supporting almost daily strikes against militants.[http://www.flightglobal.com/news/articles/raf-sentry-aew-aircraft-deploys-in-support-of-counter-is-408549/ RAF Sentry AEW aircraft deploys in support of counter-IS mission] – Flightglobal.com, 2 February 2015\n\nOn 23 June 2015, the first of the original 18 NATO E-3A AWACS aircraft to retire, arrived at Davis-Monthan AFB near Tucson, AZ.  The aircraft, LX-N 90449, will be placed in parts reclamation storage where critical parts will be removed by NATO technicians to support their remaining fleet of 16 Boeing E-3A aircraft. It had accumulated 22,206 flight hours between 19 August 1983 and 13 May 2015 and operated out of twenty-one different countries in support of NATO operational activities. The aircraft was due in mid-July 2015 for a six-year cycle Depot Level Maintenance (DLM) inspection which would have been very costly.  Without the inspection, the aircraft would no longer be allowed to fly. The so-called \"449 Retirement Project\" will result in reclamation of critical parts with a value of upwards of $40,000,000.  Some of the parts to be removed are no longer on the market or have become very expensive.https://www.dvidshub.net/video/411646/nato-e-3a-arrives-davis-monthan-afb#.VZvF7vlVikq\n\nOn 18 November 2015, an E-3G was deployed to the Middle East to begin \"immediately\" flying combat missions in support of Operation Inherent Resolve against ISIL, marking the first combat deployment of the upgraded AWAC Block 40/45.  The $2.7 billion development effort started in 2003, with the first five aircraft achieving initial operational capability (IOC) in July 2015.  The Block 40/45 upgrade is the most extensive the E-3 has undergone, replacing its 1970s computer technology with an early 2000s standard and including a deployable ground system that receives, processes, and disseminates data. The Air Force plans to convert 24 AWACS to E-3G standard, while retiring seven from the fleet to avoid upgrade costs and harvest out-of-production components.[https://www.flightglobal.com/news/articles/boeing-e-3g-makes-middle-east-combat-debut-419318/ Boeing E-3G makes Middle East combat debut] – Flightglobal.com, 19 November 2015\n\nVariants\n\n;EC-137D\nTwo prototype AWACS aircraft with JT3D engines, one fitted with a Westinghouse Electric radar and the other with a Hughes Aircraft Company radar. Both converted to E-3A standard with TF33 engines.\n;E-3A\nProduction aircraft with TF33 engines and AN/APY-1 radar, 24 built for USAF later converted to E-3B standard, total of 34 ordered but the last 9 completed as E-3C.Pither 1998, pp. 40–42 One additional aircraft retained by Boeing for testing, 18 built for NATO with TF33 engines and five for Saudi Arabia with CFM56 engines.\n;KE-3A\nThese are not AWACS aircraft but CFM56 powered tankers based on the E-3 design. Eight were sold to Saudi Arabia.\n;E-3B\nE-3As with improvements, 24 conversions.\n;E-3C\nProduction aircraft with AN/APY-2 radar, additional electronic consoles and system improvements, ten built.\n;JE-3C\nOne E-3A aircraft used by Boeing for trials later redesignated E-3C.\n;E-3D\nProduction aircraft for the Royal Air Force to E-3C standard with CFM56 engines and British modifications designated Sentry AEW.1, seven built.\n;E-3F\nProduction aircraft for the French Air Force to E-3C standard with CFM56 engines and French modifications, four built.\n;E-3G\nUSAF Block 40/45 modification. Includes hardware and software upgrades to improve communications, computer processing power, threat tracking, and others, and automates some previously manual functions.  initial operating capability (IOC) reached in July 2015.[http://www.tinker.af.mil/news/story.asp?id\n123463680 The wait is over…E-3 Block 40/45 deploys to combat theater]  – AF.mil, 18 November 2015\n\nOperators\n\n;: The French Air Force purchased four E-3F aircraft similar to the British E-3D aircraft.\nAll planes are assigned to the Escadron de Détection et de Commandement Aéroporté (ECDA, Air detection and command squadron) and are based at Avord Air Base.Wilson 1998, p 76.\n\n;\nBased in Geilenkirchen, Germany, 18 E-3 AWACS were purchased – one lost in Greece, one retired from service. All of these aircraft are officially registered as aircraft of Luxembourg, a NATO member with no other air force. Responsible for monitoring airspace for NATO operations around the world.\n* [https://web.archive.org/web/20161005091546/http://www.e3a.nato.int/eng/html/organizations/aircrew_training_sq.htm Aircrew Training Squadron]\n* [https://web.archive.org/web/20160602204204/http://www.e3a.nato.int/eng/html/organizations/sq_1.htm Flying Squadron 1]\n* [https://web.archive.org/web/20160612235226/http://www.e3a.nato.int/eng/html/organizations/sq_2.htm Flying Squadron 2]\n* [https://web.archive.org/web/20161005093211/http://www.e3a.nato.int/eng/html/organizations/sq_3.htm Flying Squadron 3] – disbanded in 2015\n\n;: The Royal Saudi Air Force purchased five E-3A aircraft and eight KE-3A tanker aircraft in 1983.Wilson 1998, pp. 75–76.\n* No. 18 Squadron\n\n;: The Royal Air Force purchased seven E-3Ds by October 1987.  All seven are still in service; six are operational and one is used for training.  The aircraft are designated Sentry AEW.1.\n* No. 8 Squadron\n* No. 23 Squadron – disbanded in 2009\n\n;: The United States Air Force currently has 32 E-3s.\n\nTactical Air Command 1976–1992\nAir Combat Command 1992–present\n* 552d Air Control Wing – Tinker Air Force Base, Oklahoma\n:960th Airborne Air Control Squadron 2001–present (NAS Keflavik, Iceland 1979–1992)\n:963d Airborne Air Control Squadron 1976–present\n:964th Airborne Air Control Squadron 1977–present\n:965th Airborne Air Control Squadron 1978–1979, 1984–present\n:966th Airborne Air Control Squadron 1976–present\n* 380th Air Expeditionary Wing – Al Dhafra Air Base, United Arab Emirates\n:968th Expeditionary Airborne Air Control Squadron 2002–2003, 2013–present\nAir Force Reserve Command\n* 513th Air Control Group (Associate) – Tinker AFB, Oklahoma\n:970th Airborne Air Control Squadron 1996–present\nPacific Air Forces\n* 3d Wing – Elmendorf AFB, Alaska\n:962d Airborne Air Control Squadron 1986–present\n* 18th Wing – Kadena AB, Japan\n:961st Airborne Air Control Squadron 1979–present\n\nIncidents and accidents\n\nThe E-3 has been involved in three hull-loss accidents, and one radar antenna destroyed during RSIP development (see photo under Avionics).\n* On 9 December 1983, a U.S. Air Force E-3 Sentry collided with a KC-135A Tanker aircraft over Saudi Arabia during Operation ELF-1. Both aircraft were recovered back to Riyadh Air Base. The Tanker received substantial damage, with parts impact and loss of pressure, as well as shut down of the two starboard engines. The E-3 received severe damage with the partial loss of a left wing section.\n* On 22 September 1995, a U.S. Air Force E-3 Sentry (callsign Yukla 27, serial number 77-0354), crashed shortly after take off from Elmendorf AFB, Alaska. The plane lost power to both left side engines after these engines ingested several Canada geese during takeoff. The aircraft went down about 2 mile northeast of the runway, killing all 24 crew members on board.\n* On 14 July 1996, a NATO E-3A, LX-N90457, overran the runway and dipped into the sea on takeoff from Preveza AB, Preveza, Greece. The fuselage broke into two, destroying the aircraft, but there were no casualties among the 16 crew members on board.Hurturk 1998, p. 358. It allegedly suffered a birdstrike during take off, but no evidence of a birdstrike was found.\n* On 28 August 2009, a USAF E-3C, 83-0008, was severely damaged while landing at Nellis Air Force Base, after experiencing a nose-wheel failure. The failure resulted in a fire that caused a reported US$100 million in damage.[http://www.af.mil/news/story.asp?id\n123165650 \"E-3 damaged while landing at Nellis\"]. US Air Force, 31 August 2009. (copy on Wikisource) The accident was determined to be pilot error: at an altitude of about 100 ft, both the co-pilot and the pilot lost track of their height above ground. The aircraft struck the ground with such force that the nose wheel strut broke. The aircraft slid along the runway for 4500 ft.\n\nSpecifications (USAF/NATO). Boeing E-3 Sentry. http://en.wikipedia.org/?curid=10384."
  }
}
