{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15446",
  "eid" : "1c6d46a0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778556938,
  "textBody" : "Ithaca College is a private, nonsectarian, coeducational liberal arts college located on the South Hill of Ithaca, New York, United States. The college was founded by William Egbert in 1892 as a conservatory of music and is set against the backdrop of the city of Ithaca, Cayuga Lake, waterfalls, and gorges. The college is best known for its large list of alumni who have played substantial roles in the media and entertainment industries.\n\nIthaca College is internationally known for the Roy H. Park School of Communications, which is ranked by several organizations as a top school for journalism, film, media and entertainment.[http://www.tvweek.com/news/np%20Dec%202013%20LR%20Book.pdf Survey: The Top 20 Journalism Schools - TV Week. 2013.] [https://www.linkedin.com/edu/rankings/us/undergraduate-media?trkedu-cp-rank-cat \"LinkedIn: Best Schools for Media Professionals\"], 2014 The college has a strong liberal arts core, and offers several pre-professional programs, along with some graduate programs.[http://www.carnegiefoundation.org/classifications/sub.asp?key\n748&subkey15312&start\n782 Carnegie Classifications: Ithaca College] Carnegie Foundation for the Advancement of Teaching.\n\nIthaca College has been ranked among the Top 10 masters universities in the \"Regional Universities North\" category by U.S. News & World Report, every year since 1996, and was ranked 6th in 2016. Ithaca College is consistently named among the best colleges in the nation by Princeton Review, with the 2018 guide ranking the college #3 for theater, #3 for newspaper, and #6 for Radio, and is among the top schools producing Fulbright scholarship recipients.\n\nHistory\n\nBeginnings\n\nIthaca College was founded as the Ithaca Conservatory of Music in 1892 when a local violin teacher, William Grant Egbert, rented four rooms and arranged for the instruction of eight students. For nearly seven decades the institution flourished in the city of Ithaca, adding to its music curriculum the study of elocution, dance, physical education, speech correction, radio, business, and the liberal arts. In 1931 the conservatory was chartered as a private college. The college was originally housed in the Boardman House, that later became the Ithaca College Museum of Art, and it was listed on the National Register of Historic Places in 1971.\n\nModern era\n\nBy 1960, some 2,000 students were in attendance. A modern campus was built on South Hill in the 1960s, and students were shuttled between the old and new during the construction. The hillside campus continued to grow in the ensuing 30 years to accommodate more than 6,000 students.\n\nAs the campus expanded, the college also began to expand its curriculum. By the 1990s, some 2,000 courses in more than 100 programs of study were available in the college's five schools. The school attracts a multicultural student body with representatives from almost every state and from 78 foreign countries.\n\nCampus\n\nIthaca College's current campus was built in the 1960s on South Hill. The College's final academic department moved from downtown to the South Hill campus in 1968, making the move complete.\n\nSatellite campuses\n\nBesides its Ithaca campus, Ithaca College has also operated satellite campuses in other cities. The Ithaca College London Center has been in existence since 1972. Ithaca runs the Ithaca College Los Angeles Program at the James B. Pendleton Center. Additionally, there is an Ithaca College Washington Semester Program, and a recently launched Ithaca College New York City Center.\n\nFormer programs include the Ithaca College Antigua Program and the Ithaca College Walkabout Down Under Program in Australia.\n\nIthaca College also operates direct enrollment exchange programs with several universities, including Griffith University, La Trobe University, Murdoch University, and University of Tasmania (Australia); Chengdu Sport University and Beijing Sport University (China); University of Hong Kong; Masaryk University (Czech Republic); Akita International University and University of Tsukuba (Japan); Hanyang University (Korea); Nanyang Technological University (Singapore); University of Valencia (Spain); and Jönköping University (Sweden).\n\nAcademics\n\nThe college offers a curriculum with more than 100 degree programs in its five schools.\n\nUntil recently, several cross-disciplinary degree programs along with the Center for the Study of Culture, Race, and Ethnicity were housed in the Division of Interdisciplinary and International Studies; however, starting in the spring of 2011, the division was eliminated and its programs, centers and institutes were absorbed within other schools.\n\nAs of 2017, the most popular majors included visual and performing arts, health professions and related programs, business, management, marketing, and related support services and biological and biomedical Sciences.\n\nStudent life\n\nMedia and publications\n\nWith its top-ranked Roy H. Park School of Communications, Ithaca College is well known for its several prominent student-run media vehicles, including:\n\n* The Ithacan is Ithaca College's official weekly newspaper that is written, edited and published by students. The Ithacan and its staff have won over 200 major collegiate journalism awards and is generally recognized as one of the top student-run newspapers in the country. Most notably, the newspaper is a consistent recipient of the Associated Collegiate Press' National Pacemaker Award; it has received the National Newspaper Pacemaker Award six times and the Online Pacemaker Award nine times (both most recently in 2015). The Pacemaker has been widely considered the \"Pulitzer Prize of collegiate journalism.\" The Ithacan is also a five-time recipient of the Gold Crown Award from the Columbia Scholastic Press Association, most recently receiving the award in 2016. The Ithacan was also ranked #3 on the 2018 Princeton Review Best College Newspaper list.\n*Ithaca College Television (ICTV) is the world's oldest student-operated college television channel. Broadcasting since 1958, ICTV is available to 26,000 cable households. It is also one of the most awarded student-run television stations, with its news program, Newswatch, receiving best news telecast accolades from organizations including the New York State Associated Press Broadcasters Association, Society of Professional Journalists and Collegiate Broadcasters Inc. The show also received ICTV's first College Emmy Award from the Academy of Television Arts & Sciences. ICTV is housed and operated in the Roy H. Park School of Communications. Approximately 15 to 20 production teams operate simultaneously, utilizing around 400 volunteers each semester. Programming varies by semester, but typically includes news, sports, entertainment, scripted, and podcast programs.\n*WICB is a student-operated, 4,100 Watt FM station that serves Tompkins County and beyond, reaching from northern Pennsylvania to Lake Ontario, with a potential audience of over 250,000. The majority of programming on WICB - which broadcasts from 91.7 on the FM band - is modern rock, but the station also airs a number of specialty shows, which includes a number of genres (including blues, Broadway, jam band music and \"homeless\" music) that is not normally heard on public airwaves. Recently, readers of the Ithaca Times voted 92 WICB \"Best Radio Station.\" WICB has also won the MTV U's Woodie Award for Best College Radio, while the Princeton Review ranks WICB the number one college radio station in the country.\n* VIC Radio[http://vicradio.org/ VIC Radio] is Ithaca College's second student-run radio station. Previously available on 105.9 FM, VIC Radio is now an online-only radio station. It is most well known for its annual 50 Hour Marathon,[http://50hours.org/ 50 Hour Marathon] in which four DJs broadcast for 50 hours straight to raise money for local community organizations.\n*Buzzsaw Magazine, formerly Buzzsaw Haircut, was founded in 1999 and is an independent monthly alternative magazine written, produced and distributed by Ithaca College students. It is a progressive publication with a goal to \"publish original creative journalism, commentary and satire that works to deconstruct society, pop culture, politics, college life and dominant Western beliefs.\" The faculty adviser is prominent media critic Jeff Cohen, who is also the founder of the college's Park Center for Independent Media. In 2011, the organization added a new multimedia section to Buzzsaw, titled Seesaw, dedicated to creating documentaries, radio pieces, interactive graphics, and other multimedia pieces to complement the print and online magazine. Buzzsaw has also won a number of national awards, including the Campus Alternative Journalism Project's award for \"Best Sense of Humor\" and the Independent Press Association's Campus Independent Journalism Awards for \"Best Campus Publication with a Budget Under $10,000\" and \"Best Political Commentary.\"\n*Park Productions is a professional production unit within the Roy H. Park School of Communications which allows students to collaborate with faculty and industry professionals to create interdisciplinary media projects. Park Productions partners with community organizations, government agencies, and higher education institutions and has produced over 200 titles including documentaries, feature films, shorts, commercials, museum exhibits, television programs, educational, corporate, and web-based media. Awards and juried screenings include LA Webfest, Mexico International Film Festival, CINE Awards, Chicago International Film Festival, Official selections at Miami, University Film and Video Festival, Cinema in Industry Awards, Multiple International Communicator Awards, Oberhausen, Montreal, Palm Springs, and Hudson Valley Film Festivals.[http://www.parkproductions.org/awards--screenings.html]\n\nGreek life\n\nHistorically, various independent and national fraternities and sororities had active chapters at Ithaca College. However, due to a series of highly publicized hazing incidents in the 1980s, including one that was responsible for the death of a student, the College administration removed all but five Greek letter organizations from campus, and adopted a non-expansion policy, prohibiting any new Greek houses from affiliating with the College.[http://www.ithaca.edu/ithacan/articles/0411/11/news/5music_frater.htm \"Music fraternities break stereotype\"] The Ithacan, November 11, 2004 As of 2014, three recognized Greek organizations remain on campus, all of which are music-oriented:\n*Phi Mu Alpha Sinfonia (Delta Chapter)\n*Sigma Alpha Iota (Epsilon Chapter)\n*Mu Phi Epsilon (Lambda Chapter)\n\nA fourth house, performing arts fraternity Kappa Gamma Psi (Iota Chapter) became inactive in 2008. Although there are potentially plans to reactivate the chapter, it is unclear whether this will be permitted or not due to the college's non-expansionist policy.\n\nHowever, there are various Greek letter organizations at Ithaca College that are unaffiliated with the school, and therefore not subject to the same housing privileges or rules that contribute to the safety of their members such as non-hazing and non-drinking policies. Additionally, while not particularly common, Ithaca College students may rush for Greek houses affiliated with Cornell University, subject to the rules of each individual fraternity or sorority. Some Cornell-affiliated Greek organizations actively recruit Ithaca College students.\n\nThere are a few unaffiliated fraternities that some Ithaca College students join - ΔΚΕ (Delta Kappa Epsilon), ΑΕΠ (Alpha Epsilon Pi), and ΚΣ (Kappa Sigma).\nThere is one unaffiliated sorority - ΓΔΠ (Gamma Delta Pi).\n\nAthletics\n\nIthaca is a member of the NCAA's Division III, the Liberty League Conference, and the Eastern College Athletic Conference. Ithaca has one of Division III's strongest athletic programs, with the Bombers winning a total of 15 national titles in seven team sports and five individual sports. Ithaca was previously a member of the Empire 8 Conference.\n\nThe Ithaca athletics nickname \"Bombers\" is unique in NCAA athletics, and the origins of the nickname are obscure. Ithaca College's sports teams were originally named the Cayugas, but the name was changed to the Bombers sometime in the 1930s. Some other names that have been used for Ithaca College's teams include: Blue Team, Blues, Blue and Gold, Collegians, and the Seneca Streeters. Several possibilities for the change to the \"Bombers\" have been posited. The most common explanation is that the school's baseball uniforms—white with navy blue pinstripes and an interlocking \"IC\" on the left chest—bear a striking resemblance to the distinctive home uniforms of the New York Yankees, who are known as the Bronx Bombers. It may also have referred to the Ithaca basketball team of that era and its propensity for half-court \"bombs\". Grumman Aircraft also manufactured airplanes including bombers in Ithaca for many years. The first “Bombers” reference on record was in the December 17, 1938 issue of the Rochester Times-Union in a men’s basketball article.\n\nThe name has at times sparked controversy for its perceived martial connotations. It is an occasional source of umbrage from Ithaca's prominent pacifist community, but the athletics department has consistently stated it has no interest in changing the name. The athletics logo has in the past incorporated World War II era fighter planes, but currently does not, and the school does not currently have a physical mascot to personify the name. In 2010 the school launched a contest to choose one. It received over 250 suggestions and narrowed the field down to three: a phoenix, a flying squirrel, and a Lake Beast. In June 2011, President Rochon announced that the school would discontinue the search due to opposition in the alumni community.\n\nIthaca College recently remodeled the Hill Center in 2013. The building features hardwood floors (Ben Light Gymnasium) as well as coaches offices. The building is home to Ithaca's men's and women's basketball teams, women's volleyball team, wrestling, and gymnastics. Ithaca also opened the Athletics & Events Center in 2011, a $65.5 million facility funded by donors. The facility is mainly used by the school's varsity athletes. It has a 47,000 square foot, 9-lane 50 meter Olympic-size pool. The building also has Glazer Arena, a 130,000 square foot event space. It is a track and field center that doubles as a practice facility for lacrosse, field hockey, soccer, baseball, tennis, and football. The facility was designed by the architectural firm Moody-Nolan and began construction in June 2009.\n\nCoached by Jim Butterfield for 27 years, the football team has won three NCAA Division III National Football Championships in 1979, 1988 and 1991 (a total surpassed only by Augustana, Mount Union and Wisconsin-Whitewater). Bomber football teams made a record seven appearances in the Division III national championship game, the Amos Alonzo Stagg Bowl, which has since been surpassed by Mount Union in 2003. The Bombers play the SUNY Cortland Red Dragons for the Cortaca Jug, which was added in 1959 to an already competitive rivalry. The match-up is one of the most prominent in Division III college football.\"[http://theithacan.org/am/publish/sportscolumn/200711_Media_gear_up_for_Cortaca_Jug.shtml Media gear up for Cortaca Jug] \", The Ithacan Online, 8 November 2007 The game alternates locations between Ithaca and Cortland. Cortland has won the Cortaca Jug the past six years.\n\nThe women's crew won back-to-back NCAA Division III championships in 2004 and 2005.\n\nThe men's crew saw much success in 2008, receiving 4 medals at the New York State Collegiate Championships.\n\nWomen's soccer has won two national championships in Division III and is consistently ranked in the top 20 nationally.\n\nGymnastics won the NCAA Division III national championships in 1998.\n\nThe men's wrestling team won NCAA Division III National Championships in 1989, 1990 and 1994.\n\nWomen's field hockey won the 1982 NCAA Division III Field Hockey Championship.\n\nIn 2013, Paula Miller, head of the women's swimming team completed her 30th year as head coach of the Ithaca Bombers. She has led the team to many victories. In the previous four years, the Bombers were undefeated throughout their season defeating tough competition. Ithaca has finished first or second at 25 of the past 29 state meets. The Bombers have also won the Empire 8 crown in each of the past nine seasons.\n\nThe 2013-2014 season ended with regaining the NCAA Division III Championship trophy.\n\nDuring the 2015-2016 season the Bombers swimming and diving team held the UNYSCSA Empire 8 state champion meet in the Athletic and Events center at Ithaca College. The men's swimming and diving team scored 616.5 points, finishing 4th in states under coach Kevin Markwardt. The men's team was led by captain Addison Hebert, who was injured the first day of the meet and was able to overcome it by the last day helping the rest of the bombers get 3rd place in the 400 freestyle relay by .01 seconds. The girls' swimming and diving team scored 1227 points, winning states under Paula Miller. The bombers were to bring two women divers to South Carolina, to compete in nationals in March.\n\nIthaca is also home to more than 60 club sports, many of which compete regularly against other colleges in leagues and tournaments.\n\n\"Ithaca Forever\"\n\n\"Ithaca Forever\" is the official alma mater or school song of Ithaca College.\n\nIntramurals\n\nAlong with Intercollegiate athletics, Ithaca College has a large intramural sport program. This extracurricular program serves approximately 25% of the undergraduate population yearly. Fourteen traditional team activities are offered throughout the year and include basketball, flag football, kickball, soccer, softball, ultimate frisbee, ski racing, and volleyball.\n\nFor most activities, divisions are offered for men's, women's, and co-recreational teams.  Throughout the year usually two or more activities run concurrently and participants are able to play on a single sex team and co-recreational team for each activity.\n\nSustainability\n\nIthaca's School of Business was the first college or university business school in the world to achieve LEED Platinum Certification alongside Yale University, which had the second. Ithaca's Peggy Ryan Williams Center is also LEED Platinum certified. It makes extensive use of day light in occupied spaces. There are sensors that regulate lighting and ventilation based on occupancy and natural light. Over 50% of the building energy comes from renewable sources such as wind power. The college also has a LEED Gold Certified building, the Athletics & Events Center. The College composts its dining hall waste, runs a \"Take It or Leave It\" Green move-out program, and offers a sustainable living option. It also operates an office supply collection and reuse program, as well as a sustainability education program during new student orientation. Ithaca received a B- grade on the Sustainable Endowments Institute's 2009 College Sustainability Report Card[http://www.greenreportcard.org/report-card-2009/schools/ithaca-college Green Report Card 2009 - Ithaca College] Sustainable Endowments Institute and an A- for 2010.\n\nIthaca College was listed as one of Princeton Review's top \"green colleges\" for being environmentally responsible.\n\nEnvironmental record\n\nCommitments to action on climate change\n\nIn the spring of 2007, then-President Peggy R. Williams signed the American College and University President's Climate Commitment (ACUPCC), pledging Ithaca College to the task of developing a strategy and long-range plan to achieve \"carbon neutrality\" at some point in the future. In 2009 the Ithaca College Board of Trustees approved the Ithaca College Climate Action Plan, which calls for 100% carbon neutrality by 2050. In 2009, the Ithaca College Board of Trustees approved the Ithaca College Climate Action Plan, which calls for 100% carbon neutrality by 2050 and offers a 40-year action plan to work toward that ambitious goal.\n\nEnergy profile\n\nThe college purchases 14 percent of its electricity from renewable sources and offsets 3 percent of its energy use with renewable energy credits.\n\nEnergy investments\n\nThe college aims to optimize investment returns and does not invest the endowment in on-campus sustainability projects, renewable energy funds, or community development loan funds. The college's investment policy reserves the right of the investment committee to restrict investments for any reason, which could include environmental and sustainability factors.\n\nCommunity impact\n\nWhile the Ithaca College Natural Lands has issued a statement that Ithaca College should join efforts calling for a moratorium on horizontal drilling and high volume (“slick water”) hydraulic fracturing, or fracking, the college as a whole has refused to issue a statement regarding the issue.\n\nLeadership\n\nCurrent president\n\nIthaca's current president is Shirley M. Collado. She was named the ninth president of Ithaca College on February 22, 2017, and assumed the presidency on July 1, 2017. She was previously executive vice chancellor and chief operating officer at Rutgers University–Newark and vice president of student affairs and dean of the college at Middlebury College. She is the first Dominican American to be named president of a college in the United States.\n\nCollado succeeds Thomas Rochon, who was named eighth president of Ithaca College on April 11, 2008. Rochon took over as president of the college following Peggy Williams, who had announced on July 12, 2007, that she would retire from the presidency post effective May 31, 2009, following a one-year sabbatical. During the fall 2015 semester, multiple protests focusing on campus climate and Rochon's leadership were led by students and faculty. After multiple racially charged events including student house party themes and racially-tinged comments at administration led-programs, students, faculty and staff all decided to hold votes of \"no confidence\" in Rochon. Students voted \"no confidence\" by a count of 72% no confidence, 27% confidence, and 1% abstaining. The faculty voted 77.8% no confidence to 22.2% confidence. Rochon retired on July 1, 2017.\n\nFormer presidents\n\nAlumni\n\nIthaca College has 49,570 alumni in the United States. There are alumni clubs for Boston, Chicago, Connecticut, Los Angeles, Metro New York, National Capital, North and South Carolina, Philadelphia, Rochester (NY), San Diego, and Southern Florida. Alumni events are hosted in cooperation with city-specific clubs and through a program called \"IC on the Road\".\n\nFollowing is a brief list of noteworthy Ithaca College alumni.\nFor a more extensive list, refer to the List of Ithaca College alumni.\n*The Birthday Boys (2005, 2006), sketch comedy group and stars of IFC comedy show executive produced by Bob Odenkirk and Ben Stiller\n*David Boreanaz (B.S. 1991), actor, Buffy the Vampire Slayer, Angel and Bones\n*Chris Burch (B.S. 1976), founder and CEO of Burch Creative Capital and co-founder of Tory Burch LLC\n*Kerry Butler (B.F.A. 1992), Tony Award-nominated Broadway actress, Xanadu, Catch Me If You Can and Little Shop of Horrors\n*Alan Colmes (attended), television and radio host of Hannity & Colmes and The Alan Colmes Show\n*Andy Daly (1993), actor and comedian\n*Nancy Daniels (1994), president/general manager of TLC\n*Gavin DeGraw, Grammy Award-nominated and platinum-selling musician best known for Billboard Hot 100 hits \"I Don't Want to Be\" and \"Not Over You\"\n*Tommy Demenkoff (B.F.A. 1974), arts education activist, director, actor, teacher\n*Peter Dougherty (1977), creator of Yo! MTV Raps\n*Michelle Federer (B.F.A. 1995), theater and film actress; originated the character, Nessarose, in Broadway's Wicked\n*Ben Feldman, Emmy Award-nominated actor, star of Superstore\n*Colonel Arnald Gabriel (1950), Conductor Emeritus of the U.S. Air Force Band\n*Barbara Gaines (B.A. 1979), Emmy Award-winning executive producer, Late Show with David Letterman\n*Paul Gallo (B.F.A. 1974), Tony Award-nominated lighting designer with more than 50 Broadway shows, City of Angels, Six Degrees of Separation, Crazy for You, Smokey Joe's Cafe and Titanic\n*Patrick Horan, defensive end, 2009-2011 New York Giants practice squad\n*Robert Allen Iger (B.S. 1973), chairman and CEO, The Walt Disney Company\n*Richard Jadick (B.S. 1987), combat surgeon who was awarded the Bronze Star for service in Iraq\n*Jeremy Jordan, Tony Award-nominated and Grammy Award-nominated star of Newsies and Bonnie & Clyde, also starred on Smash and in Joyful Noise\n*Bob Kur (B.S. 1970), Washington Post Radio, former NBC News national reporter\n*Scott LaFaro, influential jazz bassist with the Bill Evans Trio (1959–61)\n*Ricki Lake, Emmy Award-winning actress, Serial Mom, Hairspray, television host\n*David Guy Levy, film producer, Would You Rather and Terri\n*Allan Loeb, film screenwriter, Things We Lost in the Fire, Wall Street: Money Never Sleeps, The Dilemma\n*Gavin MacLeod, Golden Globe Award-nominated actor, The Love Boat and The Mary Tyler Moore Show\n*Jesse Zook Mann (B.S. 2002), Emmy Award-winning documentary film and television producer and director\n*Robert Marella, former professional wrestler (known as Gorilla Monsoon), ringside commentator for the World Wrestling Federation\n*David Muir (B.S. 1995), ABC World News anchor\n*Nick Nickson, hockey broadcaster for Los Angeles Kings\n*Tom Nugent, college football head coach and sportscaster, College Football Hall of Famer, developer of the I Formation\n*Les Otten (B.S. 1971), vice chairman and partner, Boston Red Sox Organization\n*C. C. H. Pounder, Emmy Award-nominated actress, Bagdad Café, The Shield and Avatar\n*Tish Rabe (1973), children's book author and writer of over 40 Dr. Seuss books\n*Karl Ravech (B.S. 1987), ESPN sportscaster\n*Chris Regan (1989), Emmy Award-winning writer for The Daily Show\n*Mark Romanek, filmmaker (One Hour Photo, Never Let Me Go) and Grammy Award-winning music video director\n*Mike Royce, executive producer and writer, Everybody Loves Raymond and Lucky Louie\n*Jessica Savitch (B.S. 1968), first female network news anchor\n*Rod Serling (former faculty), Emmy Award-winning screenwriter, creator and host of The Twilight Zone\n*Jan Singer (1986), chief executive officer of Victoria's Secret\n*Deborah Snyder (1991), executive producer of Suicide Squad, 300 and Watchmen\n*Liz Tigelaar, television producer and writer, Life Unexpected and Casual (TV series)\n*Giorgio A. Tsoukalos (1998), television presenter specializing in the ancient astronaut hypothesis\n*Maureen Tucker, drummer for The Velvet Underground\n*Aaron Tveit, Broadway lead actor of Catch Me If You Can and Next to Normal, starred in NBC's Grease: Live\n*Steven Van Slyke (B.S. 1978), chemist, 20 patents related to organic light-emitting diodes (OLEDs)\n\nFaculty\n\nFollowing is a brief list of current and former noteworthy Ithaca College faculty.\n*Asma Barlas, politics, director of the Center for the Study of Culture, Race, and Ethnicity. Specializes in comparative and international politics; women, gender, and Islam; Islam and Qur'anic hermeneutics\n*Jeff Cohen, journalism, and founding director, Park Center for Independent Media; media critic and commentator, author, founder of Fairness & Accuracy in Reporting (FAIR) media watchdog group\n*Patrick Conway, famous early 20th-century bandleader\n*Andrew Ezergailis, history; expert in 20th-century history of Latvia\n*Alex Perialas, sound recording technology; acclaimed audio engineer and record producer known for his extensive work during the \"golden age\" of thrash metal\n*Rod Serling, communications; creator, producer and host of The Twilight Zone\n*Saviana Stănescu, theater; poet, playwright, script analyst, journalist\n*Gordon Stout, music; percussionist, composer, specializes in marimba\n*Fred A. Wilcox, writing; nonfiction writer, fiction writer, expert on Vietnam War and effects of U.S. use of Agent Orange on U.S. military members and Vietnamese people (retired 2014)\n*Dana Wilson, the Charles A. Dana Professor of Music; composer, jazz pianist",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ithaca College" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15446" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ithaca College is a private, nonsectarian, coeducational liberal arts college located on the South Hill of Ithaca, New York, United States. The college was founded by William Egbert in 1892 as a conservatory of music and is set against the backdrop of the city of Ithaca, Cayuga Lake, waterfalls, and gorges. The college is best known for its large list of alumni who have played substantial roles in the media and entertainment industries.\n\nIthaca College is internationally known for the Roy H. Park School of Communications, which is ranked by several organizations as a top school for journalism, film, media and entertainment.[http://www.tvweek.com/news/np%20Dec%202013%20LR%20Book.pdf Survey: The Top 20 Journalism Schools - TV Week. 2013.] [https://www.linkedin.com/edu/rankings/us/undergraduate-media?trkedu-cp-rank-cat \"LinkedIn: Best Schools for Media Professionals\"], 2014 The college has a strong liberal arts core, and offers several pre-professional programs, along with some graduate programs.[http://www.carnegiefoundation.org/classifications/sub.asp?key\n748&subkey15312&start\n782 Carnegie Classifications: Ithaca College] Carnegie Foundation for the Advancement of Teaching.\n\nIthaca College has been ranked among the Top 10 masters universities in the \"Regional Universities North\" category by U.S. News & World Report, every year since 1996, and was ranked 6th in 2016. Ithaca College is consistently named among the best colleges in the nation by Princeton Review, with the 2018 guide ranking the college #3 for theater, #3 for newspaper, and #6 for Radio, and is among the top schools producing Fulbright scholarship recipients.\n\nHistory\n\nBeginnings\n\nIthaca College was founded as the Ithaca Conservatory of Music in 1892 when a local violin teacher, William Grant Egbert, rented four rooms and arranged for the instruction of eight students. For nearly seven decades the institution flourished in the city of Ithaca, adding to its music curriculum the study of elocution, dance, physical education, speech correction, radio, business, and the liberal arts. In 1931 the conservatory was chartered as a private college. The college was originally housed in the Boardman House, that later became the Ithaca College Museum of Art, and it was listed on the National Register of Historic Places in 1971.\n\nModern era\n\nBy 1960, some 2,000 students were in attendance. A modern campus was built on South Hill in the 1960s, and students were shuttled between the old and new during the construction. The hillside campus continued to grow in the ensuing 30 years to accommodate more than 6,000 students.\n\nAs the campus expanded, the college also began to expand its curriculum. By the 1990s, some 2,000 courses in more than 100 programs of study were available in the college's five schools. The school attracts a multicultural student body with representatives from almost every state and from 78 foreign countries.\n\nCampus\n\nIthaca College's current campus was built in the 1960s on South Hill. The College's final academic department moved from downtown to the South Hill campus in 1968, making the move complete.\n\nSatellite campuses\n\nBesides its Ithaca campus, Ithaca College has also operated satellite campuses in other cities. The Ithaca College London Center has been in existence since 1972. Ithaca runs the Ithaca College Los Angeles Program at the James B. Pendleton Center. Additionally, there is an Ithaca College Washington Semester Program, and a recently launched Ithaca College New York City Center.\n\nFormer programs include the Ithaca College Antigua Program and the Ithaca College Walkabout Down Under Program in Australia.\n\nIthaca College also operates direct enrollment exchange programs with several universities, including Griffith University, La Trobe University, Murdoch University, and University of Tasmania (Australia); Chengdu Sport University and Beijing Sport University (China); University of Hong Kong; Masaryk University (Czech Republic); Akita International University and University of Tsukuba (Japan); Hanyang University (Korea); Nanyang Technological University (Singapore); University of Valencia (Spain); and Jönköping University (Sweden).\n\nAcademics\n\nThe college offers a curriculum with more than 100 degree programs in its five schools.\n\nUntil recently, several cross-disciplinary degree programs along with the Center for the Study of Culture, Race, and Ethnicity were housed in the Division of Interdisciplinary and International Studies; however, starting in the spring of 2011, the division was eliminated and its programs, centers and institutes were absorbed within other schools.\n\nAs of 2017, the most popular majors included visual and performing arts, health professions and related programs, business, management, marketing, and related support services and biological and biomedical Sciences.\n\nStudent life\n\nMedia and publications\n\nWith its top-ranked Roy H. Park School of Communications, Ithaca College is well known for its several prominent student-run media vehicles, including:\n\n* The Ithacan is Ithaca College's official weekly newspaper that is written, edited and published by students. The Ithacan and its staff have won over 200 major collegiate journalism awards and is generally recognized as one of the top student-run newspapers in the country. Most notably, the newspaper is a consistent recipient of the Associated Collegiate Press' National Pacemaker Award; it has received the National Newspaper Pacemaker Award six times and the Online Pacemaker Award nine times (both most recently in 2015). The Pacemaker has been widely considered the \"Pulitzer Prize of collegiate journalism.\" The Ithacan is also a five-time recipient of the Gold Crown Award from the Columbia Scholastic Press Association, most recently receiving the award in 2016. The Ithacan was also ranked #3 on the 2018 Princeton Review Best College Newspaper list.\n*Ithaca College Television (ICTV) is the world's oldest student-operated college television channel. Broadcasting since 1958, ICTV is available to 26,000 cable households. It is also one of the most awarded student-run television stations, with its news program, Newswatch, receiving best news telecast accolades from organizations including the New York State Associated Press Broadcasters Association, Society of Professional Journalists and Collegiate Broadcasters Inc. The show also received ICTV's first College Emmy Award from the Academy of Television Arts & Sciences. ICTV is housed and operated in the Roy H. Park School of Communications. Approximately 15 to 20 production teams operate simultaneously, utilizing around 400 volunteers each semester. Programming varies by semester, but typically includes news, sports, entertainment, scripted, and podcast programs.\n*WICB is a student-operated, 4,100 Watt FM station that serves Tompkins County and beyond, reaching from northern Pennsylvania to Lake Ontario, with a potential audience of over 250,000. The majority of programming on WICB - which broadcasts from 91.7 on the FM band - is modern rock, but the station also airs a number of specialty shows, which includes a number of genres (including blues, Broadway, jam band music and \"homeless\" music) that is not normally heard on public airwaves. Recently, readers of the Ithaca Times voted 92 WICB \"Best Radio Station.\" WICB has also won the MTV U's Woodie Award for Best College Radio, while the Princeton Review ranks WICB the number one college radio station in the country.\n* VIC Radio[http://vicradio.org/ VIC Radio] is Ithaca College's second student-run radio station. Previously available on 105.9 FM, VIC Radio is now an online-only radio station. It is most well known for its annual 50 Hour Marathon,[http://50hours.org/ 50 Hour Marathon] in which four DJs broadcast for 50 hours straight to raise money for local community organizations.\n*Buzzsaw Magazine, formerly Buzzsaw Haircut, was founded in 1999 and is an independent monthly alternative magazine written, produced and distributed by Ithaca College students. It is a progressive publication with a goal to \"publish original creative journalism, commentary and satire that works to deconstruct society, pop culture, politics, college life and dominant Western beliefs.\" The faculty adviser is prominent media critic Jeff Cohen, who is also the founder of the college's Park Center for Independent Media. In 2011, the organization added a new multimedia section to Buzzsaw, titled Seesaw, dedicated to creating documentaries, radio pieces, interactive graphics, and other multimedia pieces to complement the print and online magazine. Buzzsaw has also won a number of national awards, including the Campus Alternative Journalism Project's award for \"Best Sense of Humor\" and the Independent Press Association's Campus Independent Journalism Awards for \"Best Campus Publication with a Budget Under $10,000\" and \"Best Political Commentary.\"\n*Park Productions is a professional production unit within the Roy H. Park School of Communications which allows students to collaborate with faculty and industry professionals to create interdisciplinary media projects. Park Productions partners with community organizations, government agencies, and higher education institutions and has produced over 200 titles including documentaries, feature films, shorts, commercials, museum exhibits, television programs, educational, corporate, and web-based media. Awards and juried screenings include LA Webfest, Mexico International Film Festival, CINE Awards, Chicago International Film Festival, Official selections at Miami, University Film and Video Festival, Cinema in Industry Awards, Multiple International Communicator Awards, Oberhausen, Montreal, Palm Springs, and Hudson Valley Film Festivals.[http://www.parkproductions.org/awards--screenings.html]\n\nGreek life\n\nHistorically, various independent and national fraternities and sororities had active chapters at Ithaca College. However, due to a series of highly publicized hazing incidents in the 1980s, including one that was responsible for the death of a student, the College administration removed all but five Greek letter organizations from campus, and adopted a non-expansion policy, prohibiting any new Greek houses from affiliating with the College.[http://www.ithaca.edu/ithacan/articles/0411/11/news/5music_frater.htm \"Music fraternities break stereotype\"] The Ithacan, November 11, 2004 As of 2014, three recognized Greek organizations remain on campus, all of which are music-oriented:\n*Phi Mu Alpha Sinfonia (Delta Chapter)\n*Sigma Alpha Iota (Epsilon Chapter)\n*Mu Phi Epsilon (Lambda Chapter)\n\nA fourth house, performing arts fraternity Kappa Gamma Psi (Iota Chapter) became inactive in 2008. Although there are potentially plans to reactivate the chapter, it is unclear whether this will be permitted or not due to the college's non-expansionist policy.\n\nHowever, there are various Greek letter organizations at Ithaca College that are unaffiliated with the school, and therefore not subject to the same housing privileges or rules that contribute to the safety of their members such as non-hazing and non-drinking policies. Additionally, while not particularly common, Ithaca College students may rush for Greek houses affiliated with Cornell University, subject to the rules of each individual fraternity or sorority. Some Cornell-affiliated Greek organizations actively recruit Ithaca College students.\n\nThere are a few unaffiliated fraternities that some Ithaca College students join - ΔΚΕ (Delta Kappa Epsilon), ΑΕΠ (Alpha Epsilon Pi), and ΚΣ (Kappa Sigma).\nThere is one unaffiliated sorority - ΓΔΠ (Gamma Delta Pi).\n\nAthletics\n\nIthaca is a member of the NCAA's Division III, the Liberty League Conference, and the Eastern College Athletic Conference. Ithaca has one of Division III's strongest athletic programs, with the Bombers winning a total of 15 national titles in seven team sports and five individual sports. Ithaca was previously a member of the Empire 8 Conference.\n\nThe Ithaca athletics nickname \"Bombers\" is unique in NCAA athletics, and the origins of the nickname are obscure. Ithaca College's sports teams were originally named the Cayugas, but the name was changed to the Bombers sometime in the 1930s. Some other names that have been used for Ithaca College's teams include: Blue Team, Blues, Blue and Gold, Collegians, and the Seneca Streeters. Several possibilities for the change to the \"Bombers\" have been posited. The most common explanation is that the school's baseball uniforms—white with navy blue pinstripes and an interlocking \"IC\" on the left chest—bear a striking resemblance to the distinctive home uniforms of the New York Yankees, who are known as the Bronx Bombers. It may also have referred to the Ithaca basketball team of that era and its propensity for half-court \"bombs\". Grumman Aircraft also manufactured airplanes including bombers in Ithaca for many years. The first “Bombers” reference on record was in the December 17, 1938 issue of the Rochester Times-Union in a men’s basketball article.\n\nThe name has at times sparked controversy for its perceived martial connotations. It is an occasional source of umbrage from Ithaca's prominent pacifist community, but the athletics department has consistently stated it has no interest in changing the name. The athletics logo has in the past incorporated World War II era fighter planes, but currently does not, and the school does not currently have a physical mascot to personify the name. In 2010 the school launched a contest to choose one. It received over 250 suggestions and narrowed the field down to three: a phoenix, a flying squirrel, and a Lake Beast. In June 2011, President Rochon announced that the school would discontinue the search due to opposition in the alumni community.\n\nIthaca College recently remodeled the Hill Center in 2013. The building features hardwood floors (Ben Light Gymnasium) as well as coaches offices. The building is home to Ithaca's men's and women's basketball teams, women's volleyball team, wrestling, and gymnastics. Ithaca also opened the Athletics & Events Center in 2011, a $65.5 million facility funded by donors. The facility is mainly used by the school's varsity athletes. It has a 47,000 square foot, 9-lane 50 meter Olympic-size pool. The building also has Glazer Arena, a 130,000 square foot event space. It is a track and field center that doubles as a practice facility for lacrosse, field hockey, soccer, baseball, tennis, and football. The facility was designed by the architectural firm Moody-Nolan and began construction in June 2009.\n\nCoached by Jim Butterfield for 27 years, the football team has won three NCAA Division III National Football Championships in 1979, 1988 and 1991 (a total surpassed only by Augustana, Mount Union and Wisconsin-Whitewater). Bomber football teams made a record seven appearances in the Division III national championship game, the Amos Alonzo Stagg Bowl, which has since been surpassed by Mount Union in 2003. The Bombers play the SUNY Cortland Red Dragons for the Cortaca Jug, which was added in 1959 to an already competitive rivalry. The match-up is one of the most prominent in Division III college football.\"[http://theithacan.org/am/publish/sportscolumn/200711_Media_gear_up_for_Cortaca_Jug.shtml Media gear up for Cortaca Jug] \", The Ithacan Online, 8 November 2007 The game alternates locations between Ithaca and Cortland. Cortland has won the Cortaca Jug the past six years.\n\nThe women's crew won back-to-back NCAA Division III championships in 2004 and 2005.\n\nThe men's crew saw much success in 2008, receiving 4 medals at the New York State Collegiate Championships.\n\nWomen's soccer has won two national championships in Division III and is consistently ranked in the top 20 nationally.\n\nGymnastics won the NCAA Division III national championships in 1998.\n\nThe men's wrestling team won NCAA Division III National Championships in 1989, 1990 and 1994.\n\nWomen's field hockey won the 1982 NCAA Division III Field Hockey Championship.\n\nIn 2013, Paula Miller, head of the women's swimming team completed her 30th year as head coach of the Ithaca Bombers. She has led the team to many victories. In the previous four years, the Bombers were undefeated throughout their season defeating tough competition. Ithaca has finished first or second at 25 of the past 29 state meets. The Bombers have also won the Empire 8 crown in each of the past nine seasons.\n\nThe 2013-2014 season ended with regaining the NCAA Division III Championship trophy.\n\nDuring the 2015-2016 season the Bombers swimming and diving team held the UNYSCSA Empire 8 state champion meet in the Athletic and Events center at Ithaca College. The men's swimming and diving team scored 616.5 points, finishing 4th in states under coach Kevin Markwardt. The men's team was led by captain Addison Hebert, who was injured the first day of the meet and was able to overcome it by the last day helping the rest of the bombers get 3rd place in the 400 freestyle relay by .01 seconds. The girls' swimming and diving team scored 1227 points, winning states under Paula Miller. The bombers were to bring two women divers to South Carolina, to compete in nationals in March.\n\nIthaca is also home to more than 60 club sports, many of which compete regularly against other colleges in leagues and tournaments.\n\n\"Ithaca Forever\"\n\n\"Ithaca Forever\" is the official alma mater or school song of Ithaca College.\n\nIntramurals\n\nAlong with Intercollegiate athletics, Ithaca College has a large intramural sport program. This extracurricular program serves approximately 25% of the undergraduate population yearly. Fourteen traditional team activities are offered throughout the year and include basketball, flag football, kickball, soccer, softball, ultimate frisbee, ski racing, and volleyball.\n\nFor most activities, divisions are offered for men's, women's, and co-recreational teams.  Throughout the year usually two or more activities run concurrently and participants are able to play on a single sex team and co-recreational team for each activity.\n\nSustainability\n\nIthaca's School of Business was the first college or university business school in the world to achieve LEED Platinum Certification alongside Yale University, which had the second. Ithaca's Peggy Ryan Williams Center is also LEED Platinum certified. It makes extensive use of day light in occupied spaces. There are sensors that regulate lighting and ventilation based on occupancy and natural light. Over 50% of the building energy comes from renewable sources such as wind power. The college also has a LEED Gold Certified building, the Athletics & Events Center. The College composts its dining hall waste, runs a \"Take It or Leave It\" Green move-out program, and offers a sustainable living option. It also operates an office supply collection and reuse program, as well as a sustainability education program during new student orientation. Ithaca received a B- grade on the Sustainable Endowments Institute's 2009 College Sustainability Report Card[http://www.greenreportcard.org/report-card-2009/schools/ithaca-college Green Report Card 2009 - Ithaca College] Sustainable Endowments Institute and an A- for 2010.\n\nIthaca College was listed as one of Princeton Review's top \"green colleges\" for being environmentally responsible.\n\nEnvironmental record\n\nCommitments to action on climate change\n\nIn the spring of 2007, then-President Peggy R. Williams signed the American College and University President's Climate Commitment (ACUPCC), pledging Ithaca College to the task of developing a strategy and long-range plan to achieve \"carbon neutrality\" at some point in the future. In 2009 the Ithaca College Board of Trustees approved the Ithaca College Climate Action Plan, which calls for 100% carbon neutrality by 2050. In 2009, the Ithaca College Board of Trustees approved the Ithaca College Climate Action Plan, which calls for 100% carbon neutrality by 2050 and offers a 40-year action plan to work toward that ambitious goal.\n\nEnergy profile\n\nThe college purchases 14 percent of its electricity from renewable sources and offsets 3 percent of its energy use with renewable energy credits.\n\nEnergy investments\n\nThe college aims to optimize investment returns and does not invest the endowment in on-campus sustainability projects, renewable energy funds, or community development loan funds. The college's investment policy reserves the right of the investment committee to restrict investments for any reason, which could include environmental and sustainability factors.\n\nCommunity impact\n\nWhile the Ithaca College Natural Lands has issued a statement that Ithaca College should join efforts calling for a moratorium on horizontal drilling and high volume (“slick water”) hydraulic fracturing, or fracking, the college as a whole has refused to issue a statement regarding the issue.\n\nLeadership\n\nCurrent president\n\nIthaca's current president is Shirley M. Collado. She was named the ninth president of Ithaca College on February 22, 2017, and assumed the presidency on July 1, 2017. She was previously executive vice chancellor and chief operating officer at Rutgers University–Newark and vice president of student affairs and dean of the college at Middlebury College. She is the first Dominican American to be named president of a college in the United States.\n\nCollado succeeds Thomas Rochon, who was named eighth president of Ithaca College on April 11, 2008. Rochon took over as president of the college following Peggy Williams, who had announced on July 12, 2007, that she would retire from the presidency post effective May 31, 2009, following a one-year sabbatical. During the fall 2015 semester, multiple protests focusing on campus climate and Rochon's leadership were led by students and faculty. After multiple racially charged events including student house party themes and racially-tinged comments at administration led-programs, students, faculty and staff all decided to hold votes of \"no confidence\" in Rochon. Students voted \"no confidence\" by a count of 72% no confidence, 27% confidence, and 1% abstaining. The faculty voted 77.8% no confidence to 22.2% confidence. Rochon retired on July 1, 2017.\n\nFormer presidents\n\nAlumni\n\nIthaca College has 49,570 alumni in the United States. There are alumni clubs for Boston, Chicago, Connecticut, Los Angeles, Metro New York, National Capital, North and South Carolina, Philadelphia, Rochester (NY), San Diego, and Southern Florida. Alumni events are hosted in cooperation with city-specific clubs and through a program called \"IC on the Road\".\n\nFollowing is a brief list of noteworthy Ithaca College alumni.\nFor a more extensive list, refer to the List of Ithaca College alumni.\n*The Birthday Boys (2005, 2006), sketch comedy group and stars of IFC comedy show executive produced by Bob Odenkirk and Ben Stiller\n*David Boreanaz (B.S. 1991), actor, Buffy the Vampire Slayer, Angel and Bones\n*Chris Burch (B.S. 1976), founder and CEO of Burch Creative Capital and co-founder of Tory Burch LLC\n*Kerry Butler (B.F.A. 1992), Tony Award-nominated Broadway actress, Xanadu, Catch Me If You Can and Little Shop of Horrors\n*Alan Colmes (attended), television and radio host of Hannity & Colmes and The Alan Colmes Show\n*Andy Daly (1993), actor and comedian\n*Nancy Daniels (1994), president/general manager of TLC\n*Gavin DeGraw, Grammy Award-nominated and platinum-selling musician best known for Billboard Hot 100 hits \"I Don't Want to Be\" and \"Not Over You\"\n*Tommy Demenkoff (B.F.A. 1974), arts education activist, director, actor, teacher\n*Peter Dougherty (1977), creator of Yo! MTV Raps\n*Michelle Federer (B.F.A. 1995), theater and film actress; originated the character, Nessarose, in Broadway's Wicked\n*Ben Feldman, Emmy Award-nominated actor, star of Superstore\n*Colonel Arnald Gabriel (1950), Conductor Emeritus of the U.S. Air Force Band\n*Barbara Gaines (B.A. 1979), Emmy Award-winning executive producer, Late Show with David Letterman\n*Paul Gallo (B.F.A. 1974), Tony Award-nominated lighting designer with more than 50 Broadway shows, City of Angels, Six Degrees of Separation, Crazy for You, Smokey Joe's Cafe and Titanic\n*Patrick Horan, defensive end, 2009-2011 New York Giants practice squad\n*Robert Allen Iger (B.S. 1973), chairman and CEO, The Walt Disney Company\n*Richard Jadick (B.S. 1987), combat surgeon who was awarded the Bronze Star for service in Iraq\n*Jeremy Jordan, Tony Award-nominated and Grammy Award-nominated star of Newsies and Bonnie & Clyde, also starred on Smash and in Joyful Noise\n*Bob Kur (B.S. 1970), Washington Post Radio, former NBC News national reporter\n*Scott LaFaro, influential jazz bassist with the Bill Evans Trio (1959–61)\n*Ricki Lake, Emmy Award-winning actress, Serial Mom, Hairspray, television host\n*David Guy Levy, film producer, Would You Rather and Terri\n*Allan Loeb, film screenwriter, Things We Lost in the Fire, Wall Street: Money Never Sleeps, The Dilemma\n*Gavin MacLeod, Golden Globe Award-nominated actor, The Love Boat and The Mary Tyler Moore Show\n*Jesse Zook Mann (B.S. 2002), Emmy Award-winning documentary film and television producer and director\n*Robert Marella, former professional wrestler (known as Gorilla Monsoon), ringside commentator for the World Wrestling Federation\n*David Muir (B.S. 1995), ABC World News anchor\n*Nick Nickson, hockey broadcaster for Los Angeles Kings\n*Tom Nugent, college football head coach and sportscaster, College Football Hall of Famer, developer of the I Formation\n*Les Otten (B.S. 1971), vice chairman and partner, Boston Red Sox Organization\n*C. C. H. Pounder, Emmy Award-nominated actress, Bagdad Café, The Shield and Avatar\n*Tish Rabe (1973), children's book author and writer of over 40 Dr. Seuss books\n*Karl Ravech (B.S. 1987), ESPN sportscaster\n*Chris Regan (1989), Emmy Award-winning writer for The Daily Show\n*Mark Romanek, filmmaker (One Hour Photo, Never Let Me Go) and Grammy Award-winning music video director\n*Mike Royce, executive producer and writer, Everybody Loves Raymond and Lucky Louie\n*Jessica Savitch (B.S. 1968), first female network news anchor\n*Rod Serling (former faculty), Emmy Award-winning screenwriter, creator and host of The Twilight Zone\n*Jan Singer (1986), chief executive officer of Victoria's Secret\n*Deborah Snyder (1991), executive producer of Suicide Squad, 300 and Watchmen\n*Liz Tigelaar, television producer and writer, Life Unexpected and Casual (TV series)\n*Giorgio A. Tsoukalos (1998), television presenter specializing in the ancient astronaut hypothesis\n*Maureen Tucker, drummer for The Velvet Underground\n*Aaron Tveit, Broadway lead actor of Catch Me If You Can and Next to Normal, starred in NBC's Grease: Live\n*Steven Van Slyke (B.S. 1978), chemist, 20 patents related to organic light-emitting diodes (OLEDs)\n\nFaculty\n\nFollowing is a brief list of current and former noteworthy Ithaca College faculty.\n*Asma Barlas, politics, director of the Center for the Study of Culture, Race, and Ethnicity. Specializes in comparative and international politics; women, gender, and Islam; Islam and Qur'anic hermeneutics\n*Jeff Cohen, journalism, and founding director, Park Center for Independent Media; media critic and commentator, author, founder of Fairness & Accuracy in Reporting (FAIR) media watchdog group\n*Patrick Conway, famous early 20th-century bandleader\n*Andrew Ezergailis, history; expert in 20th-century history of Latvia\n*Alex Perialas, sound recording technology; acclaimed audio engineer and record producer known for his extensive work during the \"golden age\" of thrash metal\n*Rod Serling, communications; creator, producer and host of The Twilight Zone\n*Saviana Stănescu, theater; poet, playwright, script analyst, journalist\n*Gordon Stout, music; percussionist, composer, specializes in marimba\n*Fred A. Wilcox, writing; nonfiction writer, fiction writer, expert on Vietnam War and effects of U.S. use of Agent Orange on U.S. military members and Vietnamese people (retired 2014)\n*Dana Wilson, the Charles A. Dana Professor of Music; composer, jazz pianist. Ithaca College. http://en.wikipedia.org/?curid=15446."
  }
}
