{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4640",
  "eid" : "cf6657c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778427708,
  "textBody" : "A bogie ( ) (in some senses called a truck in North American English) is a chassis or framework carrying wheelsets, attached to a vehicle, thus serving as a modular subassembly of wheels and axles. Bogies take various forms in various modes of transport. A bogie may remain normally attached (as on many railway carriages [cars] and semi-trailers) or be quickly detachable (as the dolly in a road train or in railway bogie exchange); it may contain a suspension within it (as most rail and trucking bogies do), or be solid and in turn be suspended (as most bogies of tracked vehicles are); it may be mounted on a swivel, as traditionally on a railway carriage or locomotive, additionally jointed and sprung (as in the landing gear of an airliner), or held in place by other means (centreless bogies).\n\nWhile bogie is the preferred spelling and first-listed variant in various dictionaries, bogey and bogy are also used.\n\nRailway \n\nA bogie in the UK, or a railroad truck, wheel truck, or simply truck in North America, is a structure underneath a railway vehicle (wagon, coach or locomotive) to which axles (and, hence, wheels) are attached through bearings. In Indian English, bogie may also refer to an entire railway carriage.http://www.oxfordadvancedlearnersdictionary.com/dictionary/bogie In South Africa, the term bogie is often alternatively used to refer to a freight or goods wagon (shortened from bogie wagon).\n\nThe first standard gauge British railway to build coaches with bogies, instead of rigidly mounted axles, was the Midland Railway in 1874.\n\nPurpose\n\nBogies serve a number of purposes:\n* Support of the rail vehicle body\n* Stability on both straight and curved track\n* Improve ride quality by absorbing vibration and minimizing the impact of centrifugal forces when the train runs on curves at high speed\n* Minimizing generation of track irregularities and rail abrasion\n\nUsually, two bogies are fitted to each carriage, wagon or locomotive, one at each end. Another configuration is often used in articulated vehicles, which places the bogies (often Jacobs bogies) under the connection between the carriages or wagons.\n\nMost bogies have two axles, but some cars designed for heavy loads have more axles per bogie. Heavy-duty cars may have more than two bogies using span bolsters to equalize the load and connect the bogies to the cars.\n\nUsually, the train floor is at a level above the bogies, but the floor of the car may be lower between bogies, such as for a bilevel rail car to increase interior space while staying within height restrictions, or in easy-access, stepless-entry, low-floor trains.\n\nComponents\n\nKey components of a bogie include:\n* The bogie frame: This can be of inside frame type where the main frame and bearings are between the wheels, or (more commonly) of outside frame type where the main frame and bearings are outside the wheels.\n* Suspension to absorb shocks between the bogie frame and the rail vehicle body. Common types are coil springs and rubber airbags.\n* At least one wheelset, composed of an axle with bearings and a wheel at each end.\n* The bolster, the main crossmember, connected to the bogie frame through the secondary suspension. The railway car is supported at the pivot point on the bolster.\n* Axle box suspensions absorb shocks between the axle bearings and the bogie frame. The axle box suspension usually consists of a spring between the bogie frame and axle bearings to permit up-and-down movement, and sliders to prevent lateral movement. A more modern design uses solid rubber springs.\n* Brake equipment: Two main types are used: brake shoes that are pressed against the tread of the wheel, and disc brakes and pads.\n* In powered vehicles, some form of transmission, usually electrically powered traction motors or a hydraulically powered torque converter.\n\nThe connections of the bogie with the rail vehicle allow a certain degree of rotational movement around a vertical axis pivot (bolster), with side bearers preventing excessive movement. More modern, bolsterless bogie designs omit these features, instead taking advantage of the sideways movement of the suspension to permit rotational movement.\n\nExamples \n\nCommonwealth bogie \n\nThe Commonwealth bogie was manufactured by the English Steel Corporation under licence from the Commonwealth Steel Company in Illinois, United States. Fitted with SKF or Timken bearings, it was introduced in the late 1950s for all BR Mark 1 vehicles. It was a heavy, cast-steel design weighing about , with sealed roller bearings on the axle ends, avoiding the need to maintain axle box oil levels.\n\nThe leaf springs were replaced by coil springs (one per wheel) running vertically rather than horizontally. The advanced design gave a better ride quality than the BR1, being rated for 100 mph.\n\nThe side frame of the bogie was usually of bar construction, with simple horn guides attached, allowing the axle boxes vertical movements between them.  The axle boxes had a cast-steel equaliser beam or bar resting on them.  The bar had two steel coil springs placed on it and the bogie frame rested on the springs.  The effect was to allow the bar to act as a compensating lever between the two axles and to use both springs to soften shocks from either axle.  The bogie had a conventional bolster suspension with swing links carrying a spring plank.\n\nB4 bogie \n\nThe B4 bogie was introduced in 1963.  It was a fabricated steel design versus cast iron and was lighter than the Commonwealth, weighing in at 5 LT. It also had a speed rating of 100 mph.\n\nAxle to spring connection was again with fitted roller bearings.  However, now two coil springs rather than one were fitted per wheel.[http://www.wsr.org.uk/bogies.htm  Unofficial West Somerset Railway website - Bogies]\n\nOnly a very small number of Mark 1 stock was fitted with the B4 bogie from new, it being used on the Mark 1 only to replace worn BR1 bogies.  The British Rail Mark 2 coach, however, carried the B4 bogies from new. A heavier-duty version, the B5, was standard on Southern Region Mk1-based EMUs from the 1960s onwards. Some Mark 1 catering cars had mixed bogies—a B5 under the kitchen end, and a B4 under the seating end. Some of the B4-fitted Mark 2s, as well as many B4-fitted Mark 1 BGs were allowed to run at 110 mph with extra maintenance, particularly of the wheel profile, and more frequent inspection.\n\nBT10 bogie \n\nThe BT10 bogie was introduced on the British Rail Mark 3 coach in the 1970s. Each wheel is separately connected to the bogie by a swing-arm axle.\n\nThere is dual suspension:\n* Primary suspension via a coil spring and damper mounted on each axle\n* Secondary suspension via two air springs mounted on the pivot plank, this is connected to the bogie by pendulum links.  A constant coach height is maintained by air valves.[http://www.uctc.net/papers/114.pdf Roger Barnett - British Rail’s InterCity 125 and 225] \n\nLocomotives \n\nDiesel and electric \n\nMost diesel locomotives and electric locomotives are carried on bogies. Those used in the USA include AAR type A switcher truck, Blomberg B, HT-C truck and Flexicoil.http://www.hosam.com/emd/emd6a.html\n\nSteam \n\nOn a steam locomotive, the leading and trailing wheels may be mounted on bogies like pony trucks or Bissel bogies.  Articulated locomotives (e.g. Fairlie, Garratt or Mallet locomotives) have power bogies similar to those on diesel and electric locomotives.\n\nRollbock \n\nA rollbock is a specialized type of bogie that is inserted under the wheels of a rail wagon/car, usually to convert for another track gauge. Transporter wagons carry the same concept to the level of a flatcar specialized to take other cars as its load.\n\nArchbar trucks \n\nIn the case of archbar trucks or diamond frame bogies the side frames are fabricated rather than cast.\n\nFile:Oigawa-Archbar-Truck.jpg|Japanese archbar truck with axleboxes\nFile:Diamond Frame bogie (elliptical).jpg|Diamond frame bogie, elliptical springs and journal boxes\nFile:Diamond Frame bogie (coil).JPG|Diamond frame bogie, coil springs and journal boxes\nFile:archbar ACL143.JPG |Archbar type truck with journal bearings in journal boxes as used on some steam locomotive tenders. A version of the archbar truck was at one time also used on US freight cars.\n\nTramway \n\nModern \n\nTram bogies are much simpler in design because of their axle load, and the tighter curves found on tramways mean tram bogies almost never have more than two axles. Furthermore, some tramways have steeper gradients and vertical, as well as horizontal, curves, which means tram bogies often need to pivot on the horizontal axis, as well.\n\nSome articulated trams have bogies located under articulations, a setup referred to as a Jacobs bogie. Often, low-floor trams are fitted with nonpivoting bogies and many tramway enthusiasts see this as a retrograde step, as it leads to more wear of both track and wheels and also significantly reduces the speed at which a tram can round a curve.\n\nHistoric \n\nIn the past, many different types of bogie (truck) have been used under tramcars (e.g. Brill, Peckham, maximum traction).  A maximum traction truck has one driving axle with large wheels and one nondriving axle with smaller wheels.  The bogie pivot is located off-centre, so more than half the weight rests on the driving axle.\n\nHybrid systems \n\nThe retractable stadium roof on Toronto's Rogers Centre used modified off-the-shelf train bogies on a circular rail. The system was chosen for its proven reliability.\n\nRubber-tyred metro trains use a specialised version of railway bogies. Special flanged steel wheels are behind the rubber-tired running wheels, with additional horizontal guide wheels in front of and behind the running wheels, as well. The unusually large flanges on the steel wheels guide the bogie through standard railroad switches, and in addition keep the train from derailing in case the tires deflate.[http://www.infovisual.info/05/050_en.html part of Rubber-tyred metro bogie]\n\nVariable gauge axles \n\nTo overcome breaks of gauge some bogies are being fitted with variable gauge axles (VGA) so that they can operate on two different gauges.  These include the SUW 2000 system from ZNTK Poznań.\n\nCleminson system \n\nThe Cleminson system is not a true bogie, but serves a similar purpose. It was based on a patent of 1883 by James Cleminson,http://www.icevirtuallibrary.com/docserver/fulltext/imotp.1897.19461.pdf?expires1315520526&id\nid&accnameguest&checksum\nAD521ED02561C3CF38D1772ECF1ACA2B  and was once popular on narrow-gauge rolling stock, e.g. on the Isle of Man and Manx Northern Railways.  The vehicle would have three axles and the outer two could pivot to adapt to curvature of the track.  The pivoting was controlled by levers attached to the third (centre) axle, which could slide sideways.http://www.festipedia.org.uk/wiki/Cleminson_Flexible_Six-Wheeled_Waggon\n\nTracked vehicles \n\nSome tanks and other tracked vehicles have bogies as external suspension components (see armoured fighting vehicle suspension). This type of bogie usually has two or more road wheels and some type of sprung suspension to smooth the ride across rough terrain. Bogie suspensions keep much of their components on the outside of the vehicle, saving internal space. Although vulnerable to antitank fire, they can often be repaired or replaced in the field.\n\nArticulated bogie \n\nAn articulated bogie is any one of a number of bogie designs that allow railway equipment to safely turn sharp corners, while reducing or eliminating the \"screeching\" normally associated with metal wheels rounding a bend in the rails. There are a number of such designs, and the term is also applied to train sets that incorporate articulation in the vehicle, as opposed to the bogies themselves.\n\nIf one considers a single bogie \"up close\", it resembles a small rail car with axles at either end. The same effect that causes the bogies to rub against the rails at longer radius causes each of the pairs of wheels to rub on the rails and cause the screeching. Articulated bogies add a second pivot point between the two axles to allow them to rotate to the correct angle even in these cases.\n\nArticulated lorries (tractor-trailers) \n\nIn trucking, a bogie is the subassembly of axles and wheels that supports a semi-trailer, whether permanently attached to the frame (as on a single trailer) or making up the dolly that can be hitched and unhitched as needed when hitching up a second or third semi-trailer (as when pulling doubles or triples).\n\nBogie (aircraft) \n\nImage gallery \n\nFile:Journal box.png |A journal box. Journal boxes are no longer used on North American railways.\nFile:Railroad truck, FM55-20.Fig8-8.png |A US-style railroad truck with journal bearings in journal boxes\nFile:Bettendorf truck at Illinois Railway Museum.JPG | Bettendorf-style freight car truck. This one uses journal bearings in journal boxes.\nFile:Drehgestell SBB EC Waggon.jpg |Bogie of an SBB Eurocity passenger car, as seen from underneath\nFile:Reefers-shorty-Anheuser-Busch-Malt-Nutrine ACF builders photo pre-1911.jpg | Anheuser-Busch refrigerated rail car on archbar freight trucks\nFile:Oigawa-Archbar-Truck.jpg |Japanese archbar truck with axleboxes\nFile:Wheelbase and Track.png|Track = wheel gauge (measured between the gauge or flange reference lines of the flanges of railroad wheels)\nFile:Seitenkipper-Ua4201-Drehgestell.jpg|A Bettendorf-style bogie with axle boxes,[http://www.google.com/patents/US1924237 http://www.google.com/patents/US1924237 patents/US1924237]  known in North America as a \"truck\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bogie" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4640" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A bogie ( ) (in some senses called a truck in North American English) is a chassis or framework carrying wheelsets, attached to a vehicle, thus serving as a modular subassembly of wheels and axles. Bogies take various forms in various modes of transport. A bogie may remain normally attached (as on many railway carriages [cars] and semi-trailers) or be quickly detachable (as the dolly in a road train or in railway bogie exchange); it may contain a suspension within it (as most rail and trucking bogies do), or be solid and in turn be suspended (as most bogies of tracked vehicles are); it may be mounted on a swivel, as traditionally on a railway carriage or locomotive, additionally jointed and sprung (as in the landing gear of an airliner), or held in place by other means (centreless bogies).\n\nWhile bogie is the preferred spelling and first-listed variant in various dictionaries, bogey and bogy are also used.\n\nRailway \n\nA bogie in the UK, or a railroad truck, wheel truck, or simply truck in North America, is a structure underneath a railway vehicle (wagon, coach or locomotive) to which axles (and, hence, wheels) are attached through bearings. In Indian English, bogie may also refer to an entire railway carriage.http://www.oxfordadvancedlearnersdictionary.com/dictionary/bogie In South Africa, the term bogie is often alternatively used to refer to a freight or goods wagon (shortened from bogie wagon).\n\nThe first standard gauge British railway to build coaches with bogies, instead of rigidly mounted axles, was the Midland Railway in 1874.\n\nPurpose\n\nBogies serve a number of purposes:\n* Support of the rail vehicle body\n* Stability on both straight and curved track\n* Improve ride quality by absorbing vibration and minimizing the impact of centrifugal forces when the train runs on curves at high speed\n* Minimizing generation of track irregularities and rail abrasion\n\nUsually, two bogies are fitted to each carriage, wagon or locomotive, one at each end. Another configuration is often used in articulated vehicles, which places the bogies (often Jacobs bogies) under the connection between the carriages or wagons.\n\nMost bogies have two axles, but some cars designed for heavy loads have more axles per bogie. Heavy-duty cars may have more than two bogies using span bolsters to equalize the load and connect the bogies to the cars.\n\nUsually, the train floor is at a level above the bogies, but the floor of the car may be lower between bogies, such as for a bilevel rail car to increase interior space while staying within height restrictions, or in easy-access, stepless-entry, low-floor trains.\n\nComponents\n\nKey components of a bogie include:\n* The bogie frame: This can be of inside frame type where the main frame and bearings are between the wheels, or (more commonly) of outside frame type where the main frame and bearings are outside the wheels.\n* Suspension to absorb shocks between the bogie frame and the rail vehicle body. Common types are coil springs and rubber airbags.\n* At least one wheelset, composed of an axle with bearings and a wheel at each end.\n* The bolster, the main crossmember, connected to the bogie frame through the secondary suspension. The railway car is supported at the pivot point on the bolster.\n* Axle box suspensions absorb shocks between the axle bearings and the bogie frame. The axle box suspension usually consists of a spring between the bogie frame and axle bearings to permit up-and-down movement, and sliders to prevent lateral movement. A more modern design uses solid rubber springs.\n* Brake equipment: Two main types are used: brake shoes that are pressed against the tread of the wheel, and disc brakes and pads.\n* In powered vehicles, some form of transmission, usually electrically powered traction motors or a hydraulically powered torque converter.\n\nThe connections of the bogie with the rail vehicle allow a certain degree of rotational movement around a vertical axis pivot (bolster), with side bearers preventing excessive movement. More modern, bolsterless bogie designs omit these features, instead taking advantage of the sideways movement of the suspension to permit rotational movement.\n\nExamples \n\nCommonwealth bogie \n\nThe Commonwealth bogie was manufactured by the English Steel Corporation under licence from the Commonwealth Steel Company in Illinois, United States. Fitted with SKF or Timken bearings, it was introduced in the late 1950s for all BR Mark 1 vehicles. It was a heavy, cast-steel design weighing about , with sealed roller bearings on the axle ends, avoiding the need to maintain axle box oil levels.\n\nThe leaf springs were replaced by coil springs (one per wheel) running vertically rather than horizontally. The advanced design gave a better ride quality than the BR1, being rated for 100 mph.\n\nThe side frame of the bogie was usually of bar construction, with simple horn guides attached, allowing the axle boxes vertical movements between them.  The axle boxes had a cast-steel equaliser beam or bar resting on them.  The bar had two steel coil springs placed on it and the bogie frame rested on the springs.  The effect was to allow the bar to act as a compensating lever between the two axles and to use both springs to soften shocks from either axle.  The bogie had a conventional bolster suspension with swing links carrying a spring plank.\n\nB4 bogie \n\nThe B4 bogie was introduced in 1963.  It was a fabricated steel design versus cast iron and was lighter than the Commonwealth, weighing in at 5 LT. It also had a speed rating of 100 mph.\n\nAxle to spring connection was again with fitted roller bearings.  However, now two coil springs rather than one were fitted per wheel.[http://www.wsr.org.uk/bogies.htm  Unofficial West Somerset Railway website - Bogies]\n\nOnly a very small number of Mark 1 stock was fitted with the B4 bogie from new, it being used on the Mark 1 only to replace worn BR1 bogies.  The British Rail Mark 2 coach, however, carried the B4 bogies from new. A heavier-duty version, the B5, was standard on Southern Region Mk1-based EMUs from the 1960s onwards. Some Mark 1 catering cars had mixed bogies—a B5 under the kitchen end, and a B4 under the seating end. Some of the B4-fitted Mark 2s, as well as many B4-fitted Mark 1 BGs were allowed to run at 110 mph with extra maintenance, particularly of the wheel profile, and more frequent inspection.\n\nBT10 bogie \n\nThe BT10 bogie was introduced on the British Rail Mark 3 coach in the 1970s. Each wheel is separately connected to the bogie by a swing-arm axle.\n\nThere is dual suspension:\n* Primary suspension via a coil spring and damper mounted on each axle\n* Secondary suspension via two air springs mounted on the pivot plank, this is connected to the bogie by pendulum links.  A constant coach height is maintained by air valves.[http://www.uctc.net/papers/114.pdf Roger Barnett - British Rail’s InterCity 125 and 225] \n\nLocomotives \n\nDiesel and electric \n\nMost diesel locomotives and electric locomotives are carried on bogies. Those used in the USA include AAR type A switcher truck, Blomberg B, HT-C truck and Flexicoil.http://www.hosam.com/emd/emd6a.html\n\nSteam \n\nOn a steam locomotive, the leading and trailing wheels may be mounted on bogies like pony trucks or Bissel bogies.  Articulated locomotives (e.g. Fairlie, Garratt or Mallet locomotives) have power bogies similar to those on diesel and electric locomotives.\n\nRollbock \n\nA rollbock is a specialized type of bogie that is inserted under the wheels of a rail wagon/car, usually to convert for another track gauge. Transporter wagons carry the same concept to the level of a flatcar specialized to take other cars as its load.\n\nArchbar trucks \n\nIn the case of archbar trucks or diamond frame bogies the side frames are fabricated rather than cast.\n\nFile:Oigawa-Archbar-Truck.jpg|Japanese archbar truck with axleboxes\nFile:Diamond Frame bogie (elliptical).jpg|Diamond frame bogie, elliptical springs and journal boxes\nFile:Diamond Frame bogie (coil).JPG|Diamond frame bogie, coil springs and journal boxes\nFile:archbar ACL143.JPG |Archbar type truck with journal bearings in journal boxes as used on some steam locomotive tenders. A version of the archbar truck was at one time also used on US freight cars.\n\nTramway \n\nModern \n\nTram bogies are much simpler in design because of their axle load, and the tighter curves found on tramways mean tram bogies almost never have more than two axles. Furthermore, some tramways have steeper gradients and vertical, as well as horizontal, curves, which means tram bogies often need to pivot on the horizontal axis, as well.\n\nSome articulated trams have bogies located under articulations, a setup referred to as a Jacobs bogie. Often, low-floor trams are fitted with nonpivoting bogies and many tramway enthusiasts see this as a retrograde step, as it leads to more wear of both track and wheels and also significantly reduces the speed at which a tram can round a curve.\n\nHistoric \n\nIn the past, many different types of bogie (truck) have been used under tramcars (e.g. Brill, Peckham, maximum traction).  A maximum traction truck has one driving axle with large wheels and one nondriving axle with smaller wheels.  The bogie pivot is located off-centre, so more than half the weight rests on the driving axle.\n\nHybrid systems \n\nThe retractable stadium roof on Toronto's Rogers Centre used modified off-the-shelf train bogies on a circular rail. The system was chosen for its proven reliability.\n\nRubber-tyred metro trains use a specialised version of railway bogies. Special flanged steel wheels are behind the rubber-tired running wheels, with additional horizontal guide wheels in front of and behind the running wheels, as well. The unusually large flanges on the steel wheels guide the bogie through standard railroad switches, and in addition keep the train from derailing in case the tires deflate.[http://www.infovisual.info/05/050_en.html part of Rubber-tyred metro bogie]\n\nVariable gauge axles \n\nTo overcome breaks of gauge some bogies are being fitted with variable gauge axles (VGA) so that they can operate on two different gauges.  These include the SUW 2000 system from ZNTK Poznań.\n\nCleminson system \n\nThe Cleminson system is not a true bogie, but serves a similar purpose. It was based on a patent of 1883 by James Cleminson,http://www.icevirtuallibrary.com/docserver/fulltext/imotp.1897.19461.pdf?expires1315520526&id\nid&accnameguest&checksum\nAD521ED02561C3CF38D1772ECF1ACA2B  and was once popular on narrow-gauge rolling stock, e.g. on the Isle of Man and Manx Northern Railways.  The vehicle would have three axles and the outer two could pivot to adapt to curvature of the track.  The pivoting was controlled by levers attached to the third (centre) axle, which could slide sideways.http://www.festipedia.org.uk/wiki/Cleminson_Flexible_Six-Wheeled_Waggon\n\nTracked vehicles \n\nSome tanks and other tracked vehicles have bogies as external suspension components (see armoured fighting vehicle suspension). This type of bogie usually has two or more road wheels and some type of sprung suspension to smooth the ride across rough terrain. Bogie suspensions keep much of their components on the outside of the vehicle, saving internal space. Although vulnerable to antitank fire, they can often be repaired or replaced in the field.\n\nArticulated bogie \n\nAn articulated bogie is any one of a number of bogie designs that allow railway equipment to safely turn sharp corners, while reducing or eliminating the \"screeching\" normally associated with metal wheels rounding a bend in the rails. There are a number of such designs, and the term is also applied to train sets that incorporate articulation in the vehicle, as opposed to the bogies themselves.\n\nIf one considers a single bogie \"up close\", it resembles a small rail car with axles at either end. The same effect that causes the bogies to rub against the rails at longer radius causes each of the pairs of wheels to rub on the rails and cause the screeching. Articulated bogies add a second pivot point between the two axles to allow them to rotate to the correct angle even in these cases.\n\nArticulated lorries (tractor-trailers) \n\nIn trucking, a bogie is the subassembly of axles and wheels that supports a semi-trailer, whether permanently attached to the frame (as on a single trailer) or making up the dolly that can be hitched and unhitched as needed when hitching up a second or third semi-trailer (as when pulling doubles or triples).\n\nBogie (aircraft) \n\nImage gallery \n\nFile:Journal box.png |A journal box. Journal boxes are no longer used on North American railways.\nFile:Railroad truck, FM55-20.Fig8-8.png |A US-style railroad truck with journal bearings in journal boxes\nFile:Bettendorf truck at Illinois Railway Museum.JPG | Bettendorf-style freight car truck. This one uses journal bearings in journal boxes.\nFile:Drehgestell SBB EC Waggon.jpg |Bogie of an SBB Eurocity passenger car, as seen from underneath\nFile:Reefers-shorty-Anheuser-Busch-Malt-Nutrine ACF builders photo pre-1911.jpg | Anheuser-Busch refrigerated rail car on archbar freight trucks\nFile:Oigawa-Archbar-Truck.jpg |Japanese archbar truck with axleboxes\nFile:Wheelbase and Track.png|Track = wheel gauge (measured between the gauge or flange reference lines of the flanges of railroad wheels)\nFile:Seitenkipper-Ua4201-Drehgestell.jpg|A Bettendorf-style bogie with axle boxes,[http://www.google.com/patents/US1924237 http://www.google.com/patents/US1924237 patents/US1924237]  known in North America as a \"truck\". Bogie. http://en.wikipedia.org/?curid=4640."
  }
}
