{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9225",
  "eid" : "ece24160-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778477174,
  "textBody" : "Electronic paper and e-paper are display devices that mimic the appearance of ordinary ink on paper. Unlike conventional backlit flat panel displays that emit light, electronic paper displays reflect light like paper. This may make them more comfortable to read, and provide a wider viewing angle than most light-emitting displays. The contrast ratio in electronic displays available as of 2008 approaches newspaper, and newly (2008) developed displays are slightly better. An ideal e-paper display can be read in direct sunlight without the image appearing to fade.\n\nMany electronic paper technologies hold static text and images indefinitely without electricity. Flexible electronic paper uses plastic substrates and plastic electronics for the display backplane. There is ongoing competition among manufacturers to provide full-color ability.\n\nApplications of electronic visual displays include electronic pricing labels in retail shops and digital signage, time tables at bus stations, electronic billboards, smartphone displays, and e-readers able to display digital versions of books and magazines.\n\nTechnologies\n\nGyricon\n\nElectronic paper was first developed in the 1970s by Nick Sheridon at Xerox's Palo Alto Research Center. The first electronic paper, called Gyricon, consisted of polyethylene spheres between 75 and 106 micrometers across. Each sphere is a janus particle composed of negatively charged black plastic on one side and positively charged white plastic on the other (each bead is thus a dipole). The spheres are embedded in a transparent silicone sheet, with each sphere suspended in a bubble of oil so that they can rotate freely. The polarity of the voltage applied to each pair of electrodes then determines whether the white or black side is face-up, thus giving the pixel a white or black appearance.\nAt the FPD 2008 exhibition, Japanese company Soken demonstrated a wall with electronic wall-paper using this technology.Techon [http://techon.nikkeibp.co.jp/english/NEWS_EN/20081104/160670/ Soken electronic wall-paper] In 2007, the Estonian company Visitret Displays was developing this kind of display using polyvinylidene fluoride (PVDF) as the material for the spheres, dramatically improving the video speed and decreasing the control voltage.J. Liiv. [https://www.scholars-press.com/catalog/details/store/us/book/978-3-639-51567-1/pvdf-as-material-for-active-element-of-twisting-ball-displays?search=liiv PVDF as material for active element of twisting-ball displays]\n\nElectrophoretic \n\nIn the simplest implementation of an electrophoretic display, titanium dioxide (titania) particles approximately one micrometer in diameter are dispersed in a hydrocarbon oil.  A dark-colored dye is also added to the oil, along with surfactants and charging agents that cause the particles to take on an electric charge.  This mixture is placed between two parallel, conductive plates separated by a gap of 10 to 100 micrometres.  When a voltage is applied across the two plates, the particles migrate electrophoretically to the plate that bears the opposite charge from that on the particles.  When the particles are located at the front (viewing) side of the display, it appears white, because light is scattered back to the viewer by the high-index titania particles.  When the particles are located at the rear side of the display, it appears dark, because the incident light is absorbed by the colored dye.  If the rear electrode is divided into a number of small picture elements (pixels), then an image can be formed by applying the appropriate voltage to each region of the display to create a pattern of reflecting and absorbing regions.\n\nElectrophoretic displays are considered prime examples of the electronic paper category, because of their paper-like appearance and low power consumption.\n\nExamples of commercial electrophoretic displays include the high-resolution active matrix displays used in the Amazon Kindle, Barnes & Noble Nook, Sony Librie, Sony Reader, Kobo eReader and iRex iLiad e-readers. These displays are constructed from an electrophoretic imaging film manufactured by E Ink Corporation. A mobile phone that used the technology is the Motorola Fone.\n\nElectrophoretic Display technology has also been developed by Sipix and Bridgestone/Delta.\nSiPix is now part of E Ink. The Sipix design uses a flexible 0.15 mm Microcup architecture, instead of E Ink's 0.04 mm diameter microcapsules.\nBridgestone Corp.'s Advanced Materials Division cooperated with Delta Optoelectronics Inc. in developing the Quick Response Liquid Powder Display (QR-LPD) technology.\n\nElectrophoretic displays can be manufactured using the Electronics on Plastic by Laser Release (EPLaR) process developed by Philips Research to enable existing AM-LCD manufacturing plants to create flexible plastic displays.\n\nMicroencapsulated electrophoretic display\n\nAn electrophoretic display forms images by rearranging charged pigment particles with an applied electric field.\n\nIn the 1990s another type of electronic ink based on a microencapsulated electrophoretic display was conceived and prototyped by a team of undergraduates at MIT as described in their Nature paper.  J.D. Albert, Barrett Comiskey, Joseph Jacobson, Jeremy Rubin and Russ Wilcox co-founded E Ink Corporation in 1997 to commercialize the technology. E ink subsequently formed a partnership with Philips Components two years later to develop and market the technology. In 2005, Philips sold the electronic paper business as well as its related patents to Prime View International.  “It has for many years been an ambition of researchers in display media to create a flexible low-cost system that is the electronic analogue of paper. In this context, microparticle-based displays have long intrigued researchers. Switchable contrast in such displays is achieved by the electromigration of highly scattering or absorbing microparticles (in the size range 0.1–5 mm), quite distinct from the  molecular-scale properties that govern the behaviour of the more familiar liquid-crystal displays. Micro-particle-based displays possess intrinsic bistability, exhibit extremely low power d.c. field addressing and have demonstrated high contrast and reflectivity. These features, combined with a near-lambertian viewing characteristic, result in an ‘ink on paper’ look. But such displays have to date suffered from short lifetimes and difficulty in manufacture. Here we report the synthesis of an electrophoretic ink based on the microencapsulation of an electrophoretic dispersion. The use of a microencapsulated electrophoretic medium solves the lifetime issues and permits the fabrication of a bistable electronic display solely by means of printing. This system may satisfy the practical requirements of electronic paper.”\n\nThis used tiny microcapsules filled with electrically charged white particles suspended in a colored oil. In early versions, the underlying circuitry controlled whether the white particles were at the top of the capsule (so it looked white to the viewer) or at the bottom of the capsule (so the viewer saw the color of the oil). This was essentially a reintroduction of the well-known electrophoretic display technology, but microcapsules meant the display could be made on flexible plastic sheets instead of glass.\nOne early version of electronic paper consists of a sheet of very small transparent capsules, each about 40 micrometers across. Each capsule contains an oily solution containing black dye (the electronic ink), with numerous white titanium dioxide particles suspended within. The particles are slightly negatively charged, and each one is naturally white.\nThe screen holds microcapsules in a layer of liquid polymer, sandwiched between two arrays of electrodes, the upper of which is transparent. The two arrays are aligned to divide the sheet into pixels, and each pixel corresponds to a pair of electrodes situated on either side of the sheet. The sheet is laminated with transparent plastic for protection, resulting in an overall thickness of 80 micrometers, or twice that of ordinary paper.\nThe network of electrodes connects to display circuitry, which turns the electronic ink 'on' and 'off' at specific pixels by applying a voltage to specific electrode pairs. A negative charge to the surface electrode repels the particles to the bottom of local capsules, forcing the black dye to the surface and turning the pixel black. Reversing the voltage has the opposite effect. It forces the particles to the surface, turning the pixel white. A more recent implementation of this concept requires only one layer of electrodes beneath the microcapsules.\n\nElectrowetting\n\nElectro-wetting display (EWD) is based on controlling the shape of a confined water/oil interface by an applied voltage. With no voltage applied, the (colored) oil forms a flat film between the water and a hydrophobic (water-repellent) insulating coating of an electrode, resulting in a colored pixel. When a voltage is applied between the electrode and the water, the interfacial tension between the water and the coating changes. As a result, the stacked state is no longer stable, causing the water to move the oil aside. This makes a partly transparent pixel, or, if a reflective white surface is under the switchable element, a white pixel. Because of the small pixel size, the user only experiences the average reflection, which provides a high-brightness, high-contrast switchable element.\n\nDisplays based on electro-wetting provide several attractive features. The switching between white and colored reflection is fast enough to display video content. It's a low-power and low-voltage technology, and displays based on the effect can be made flat and thin. The reflectivity and contrast are better than or equal to other reflective display types and approach the visual qualities of paper. In addition, the technology offers a unique path toward high-brightness full-color displays, leading to displays that are four times brighter than reflective LCDs and twice as bright as other emerging technologies.LiquaVista electrowetting display technologies http://www.liquavista.com Instead of using red, green and blue (RGB) filters or alternating segments of the three primary colors, which effectively result in only one third of the display reflecting light in the desired color, electro-wetting allows for a system in which one sub-pixel can switch two different colors independently.\n\nThis results in the availability of two thirds of the display area to reflect light in any desired color. This is achieved by building up a pixel with a stack of two independently controllable colored oil films plus a color filter.\n\nThe colors are cyan, magenta and yellow, which is a subtractive system, comparable to the principle used in inkjet printing for example. Compared to LCD, brightness is gained because no polarisers are required.\n\nExamples of commercial electrowetting displays include Liquavista, ITRI,[http://www.itri.org.tw/eng/news-and-events/feature-story-detail.asp?RootNodeId050&NodeId\n0502&FocusNewsNBR52]  and ADT.Blankenbach K, Schmoll A, Bitman A, Bartels F and Jerosch D 2008 Novel highly reflective and bistable electrowetting displays SID J. 16 237–44http://www.iop.org/Select/article/0960-1317/19/6/065029/jmm9_6_065029.pdf?request-id\n37ba45f3-e740-4c0d-8c35-dcf2d9af1f10\n\nElectrofluidic\n\nElectrofluidic displays are a variation of an electrowetting display. Electrofluidic displays place an aqueous pigment dispersion inside a tiny reservoir.  The reservoir comprises  Voltage is used to electromechanically pull the pigment out of the reservoir and spread it as a film directly behind the viewing substrate.  As a result, the display takes on color and brightness similar to that of conventional pigments printed on paper. When voltage is removed liquid surface tension causes the pigment dispersion to rapidly recoil into the reservoir.  As reported in the May 2009 Issue of Nature Photonics, the technology can potentially provide >85 % white state reflectance for electronic paper.\n\nThe core technology was invented at the Novel Devices Laboratory at the University of Cincinnati.  The technology is currently being commercialized by Gamma Dynamics.\n\nInterferometric modulator (Mirasol)\n\nTechnology used in electronic visual displays that can create various colors via interference of reflected light. The color is selected with an electrically switched light modulator comprising a microscopic cavity that is switched on and off using driver integrated circuits similar to those used to address liquid crystal displays (LCD).\n\nPlasmonic electronic display \n\nPlasmonic nanostructures with conductive polymers have also been suggested as one kind of electronic paper.Xiong, Kunli; Emilsson, Gustav; Maziz, Ali. ”[http://onlinelibrary.wiley.com/doi/10.1002/adma.201603358/abstract Plasmonic Metasurfaces with Conjugated Polymers for Flexible Electronic Paper in Color]”Advanced Materials: sid. n/a–n/a. [http://onlinelibrary.wiley.com/doi/10.1002/adma.201603358/full doi:10.1002/adma.201603358]. ISSN 1521-4095. Last 28 oktober 2016. The material has two parts. The first part is a highly reflective metasurface made by metal-insulator-metal films tens of nanometers in thickness including nanoscale holes. The metasurfaces can reflect different colors depending on the thickness of the insulator. The three primary colors red, green and blue can be used as pixels for full color displays. The second part is a polymer with optical absorption controllable by an electrochemical potential. After growing the polymer on the plasmonic metasurfaces, the reflection of the metasurfaces can be modulated by the applied voltage. This technology presents broad range colors, high polarization-independent reflection (>50 %), strong contrast (>30 %), fast response time (hundreds of ms), and long-term stability. In addition, it has ultralow power consumption (10000 dpi). Since the ultrathin metasurfaces are flexible and the polymer is soft, the whole system can be bent.Desired future improvements for this technology include bistability, cheaper materials and implementation with TFT arrays.\n\nOther bistable displays\n\n* Plastic Logic, manufacturer of flexible plastic electrophoretic displays\n* Kent Displays, manufacturer of cholesteric liquid crystal display (ChLCD)\n* Nemoptic, nematic materials\n* TRED\n* [https://web.archive.org/web/20140525200255/http://www.sharpmemorylcd.com/aboutmemorylcd.html Sharp Memory LCD], used in Pebble smartwatch.\n* Zeta Imaging, research project to produce a color E-ink device without the need for filters or variable particle timing\n\nOther technologies\n\nOther research efforts into e-paper have involved using organic transistors embedded into flexible substrates, including attempts to build them into conventional paper.\nSimple color e-paper consists of a thin colored optical filter added to the monochrome technology described above. The array of pixels is divided into triads, typically consisting of the standard cyan, magenta and yellow, in the same way as CRT monitors (although using subtractive primary colors as opposed to additive primary colors).  The display is then controlled like any other electronic color display.\n\nExamples of electrochromic displays include Acreo, Ajjer, Aveso and Ntera.\n\nDisadvantages\n\nElectronic paper technologies have a very low refresh rate compared to other low-power display technologies, such as LCDs. This prevents producers from implementing sophisticated interactive applications (using fast-moving menus, mouse pointers or scrolling) like those common on standard mobile devices. An example of this limit is that a document cannot be smoothly zoomed without either extreme blurring during the transition or a very slow zoom.\n\nAnother limit is that a shadow of an image may be visible after refreshing parts of the screen. Such shadows are termed \"ghost images\", and the effect is termed \"ghosting\". This effect is reminiscent of screen burn-in but, unlike screen burn-in, is solved after the screen is refreshed several times. Turning every pixel white, then black, then white, helps normalize the contrast of the pixels. This is why several devices with this technology \"flash\" the entire screen white and black when loading a new image.\n\nE Ink Corporation of E Ink Holdings Inc. released the first colored e-ink displays to be used in a marketed product. The Ectaco Jetbook Color was released in 2012 as the first colored e-ink e-reader, which used E Ink's Triton display technology. E Ink in early 2015 also announced another color e-ink technology called Prism. This new technology is a color changing film that can be used for e-reader, but Prism is also marketed as a film that can be integrated into architectural design such as \"wall, ceiling panel, or entire room instantly.\" The disadvantage of these current color displays is that they are considerably more expensive than standard E Ink displays. The JetBook Color costs roughly nine times more than other popular e-readers such as the Amazon Kindle. As of January 2015, Prism had not been announced to be used in the plans for any e-reader devices.\n\nApplications\n\nSeveral companies are simultaneously developing electronic paper and ink.  While the technologies used by each company provide many of the same features, each has its own distinct technological advantages. All electronic paper technologies face the following general challenges:\n\n* A method for encapsulation\n* An ink or active material to fill the encapsulation\n* Electronics to activate the ink\n\nElectronic ink can be applied to flexible or rigid materials.  For flexible displays, the base requires a thin, flexible material tough enough to withstand considerable wear, such as extremely thin plastic. The method of how the inks are encapsulated and then applied to the substrate is what distinguishes each company from others. These processes are complex and are carefully guarded industry secrets.  Nevertheless, making electronic paper is less complex and costly than LCDs.\n\nThere are many approaches to electronic paper, with many companies developing technology in this area. Other technologies being applied to electronic paper include modifications of liquid crystal displays, electrochromic displays, and the electronic equivalent of an Etch A Sketch at Kyushu University.  Advantages of electronic paper includes low power usage (power is only drawn when the display is updated), flexibility and better readability than most displays.  Electronic ink can be printed on any surface, including walls, billboards, product labels and T-shirts.  The ink's flexibility would also make it possible to develop rollable displays for electronic devices.\n\nWristwatches\n\nIn December 2005 Seiko released the first electronic ink based watch called the Spectrum SVRD001 wristwatch, which has a flexible electrophoretic display\n[http://www.akihabaranews.com//en/news-10749-The+first+watch+that+uses+flexible+e-paper+hits+the+stores.html \"The first watch that uses flexible e-paper hits the stores\"]\n2005-12-01\n and in March 2010 Seiko released a second generation of this famous e-ink watch with an active matrix display.[http://www.seikowatches.com/baselworld/2010/precon/0402-epd.html \"Baselworld 2010 - Seiko Press Conference - Future Now, EPD Watch] \n2010-04-01\n The Pebble smart watch (2013) uses a low-power memory LCD manufactured by Sharp for its e-paper display.\n\nE-book readers\n\nIn 2004 Sony released the Librié in Japan, the first e-book reader with an electronic paper E Ink display. In September 2006, Sony released the PRS-500 Sony Reader e-book reader in the USA. On October 2, 2007, Sony announced the PRS-505, an updated version of the Reader. In November 2008, Sony released the PRS-700BC, which incorporated a backlight and a touchscreen.\n\nIn late 2007, Amazon began producing and marketing the Amazon Kindle, an e-book reader with an e-paper display. In February 2009, Amazon released the Kindle 2 and in May 2009 the larger Kindle DX was announced. In July 2010 the third generation Kindle was announced, with notable design changes.  The fourth generation of Kindle, called Touch, was announced in September 2011 that was the Kindle's first departure from keyboards and page turn buttons in favor of touchscreens.  In September 2012, Amazon announced the fifth generation of the Kindle called the Paperwhite, which incorporates a LED frontlight and a higher contrast display.\n\nIn November 2009, Barnes and Noble launched the Barnes & Noble Nook, running an Android operating system. It differs from other e-readers in having a replaceable battery, and a separate touch-screen color LCD below the main electronic paper reading screen.\n\nIn 2017 Sony and reMarkable offered e-books tailored for writing with a smart stylus. \n\nNewspapers\n\nIn February 2006, the Flemish daily De Tijd distributed an electronic version of the paper to select subscribers in a limited marketing study, using a pre-release version of the iRex iLiad.  This was the first recorded application of electronic ink to newspaper publishing.\n\nThe French daily Les Échos announced the official launch of an electronic version of the paper on a subscription basis, in September 2007. Two offers were available, combining a one-year subscription and a reading device. The offer included either a light (176g) reading device (adapted for Les Echos by Ganaxa) or the iRex iLiad. Two different processing platforms were used to deliver readable information of the daily, one based on the newly developed GPP electronic ink platform from Ganaxa, and the other one developed internally by Les Echos.\n\nDisplays embedded in smart cards\n\nFlexible display cards enable financial payment cardholders to generate a one-time password to reduce online banking and transaction fraud. Electronic paper offers a flat and thin alternative to existing key fob tokens for data security. The world’s first ISO compliant smart card with an embedded display was developed by Innovative Card Technologies and nCryptone in 2005. The cards were manufactured by Nagra ID.\n\nStatus displays\n\nSome devices, like USB flash drives, have used electronic paper to display status information, such as available storage space.  Once the image on the electronic paper has been set, it requires no power to maintain, so the readout can be seen even when the flash drive is not plugged in.\n\nMobile phones\n\nMotorola's low-cost mobile phone, the Motorola F3, uses an alphanumeric black-and-white electrophoretic display.\n\nThe Samsung Alias 2 mobile phone incorporates electronic ink from E Ink into the keypad, which allows the keypad to change character sets and orientation while in different display modes.\n\nOn December 12, 2012, Yota Devices announced the first \"YotaPhone\" prototype and was later released on December 2013, a unique double-display smartphone. It has an 4.3-inch, HD LCD on the front and an e-ink display on the back with smart battery usage.\n\nElectronic shelf labels\n\nE-Paper based electronic shelf labels (ESL) are used to digitally display the prices of goods at retail stores. Electronic paper based labels are updated via two-way infrared or radio technology.\n\nDigital signage\n\nBecause of its energy-saving properties, electronic paper has proved a technology suited to digital signage applications.\n\nOther\n\nOther proposed applications include clothes, digital photo frames, information boards and keyboards. Keyboards with dynamically changeable keys are useful for less represented languages, non-standard keyboard layouts such as Dvorak, or for special non-alphabetical applications such as video editing or games.\n\nDisplay manufacturers\n\n*E Ink Holdings Inc.\n*Liquavista\n*LG\n*NEC\n*Plastic Logic\n*Polymer Vision\n*Samsung\n*Seiko Epson",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Electronic paper" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9225" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Electronic paper and e-paper are display devices that mimic the appearance of ordinary ink on paper. Unlike conventional backlit flat panel displays that emit light, electronic paper displays reflect light like paper. This may make them more comfortable to read, and provide a wider viewing angle than most light-emitting displays. The contrast ratio in electronic displays available as of 2008 approaches newspaper, and newly (2008) developed displays are slightly better. An ideal e-paper display can be read in direct sunlight without the image appearing to fade.\n\nMany electronic paper technologies hold static text and images indefinitely without electricity. Flexible electronic paper uses plastic substrates and plastic electronics for the display backplane. There is ongoing competition among manufacturers to provide full-color ability.\n\nApplications of electronic visual displays include electronic pricing labels in retail shops and digital signage, time tables at bus stations, electronic billboards, smartphone displays, and e-readers able to display digital versions of books and magazines.\n\nTechnologies\n\nGyricon\n\nElectronic paper was first developed in the 1970s by Nick Sheridon at Xerox's Palo Alto Research Center. The first electronic paper, called Gyricon, consisted of polyethylene spheres between 75 and 106 micrometers across. Each sphere is a janus particle composed of negatively charged black plastic on one side and positively charged white plastic on the other (each bead is thus a dipole). The spheres are embedded in a transparent silicone sheet, with each sphere suspended in a bubble of oil so that they can rotate freely. The polarity of the voltage applied to each pair of electrodes then determines whether the white or black side is face-up, thus giving the pixel a white or black appearance.\nAt the FPD 2008 exhibition, Japanese company Soken demonstrated a wall with electronic wall-paper using this technology.Techon [http://techon.nikkeibp.co.jp/english/NEWS_EN/20081104/160670/ Soken electronic wall-paper] In 2007, the Estonian company Visitret Displays was developing this kind of display using polyvinylidene fluoride (PVDF) as the material for the spheres, dramatically improving the video speed and decreasing the control voltage.J. Liiv. [https://www.scholars-press.com/catalog/details/store/us/book/978-3-639-51567-1/pvdf-as-material-for-active-element-of-twisting-ball-displays?search=liiv PVDF as material for active element of twisting-ball displays]\n\nElectrophoretic \n\nIn the simplest implementation of an electrophoretic display, titanium dioxide (titania) particles approximately one micrometer in diameter are dispersed in a hydrocarbon oil.  A dark-colored dye is also added to the oil, along with surfactants and charging agents that cause the particles to take on an electric charge.  This mixture is placed between two parallel, conductive plates separated by a gap of 10 to 100 micrometres.  When a voltage is applied across the two plates, the particles migrate electrophoretically to the plate that bears the opposite charge from that on the particles.  When the particles are located at the front (viewing) side of the display, it appears white, because light is scattered back to the viewer by the high-index titania particles.  When the particles are located at the rear side of the display, it appears dark, because the incident light is absorbed by the colored dye.  If the rear electrode is divided into a number of small picture elements (pixels), then an image can be formed by applying the appropriate voltage to each region of the display to create a pattern of reflecting and absorbing regions.\n\nElectrophoretic displays are considered prime examples of the electronic paper category, because of their paper-like appearance and low power consumption.\n\nExamples of commercial electrophoretic displays include the high-resolution active matrix displays used in the Amazon Kindle, Barnes & Noble Nook, Sony Librie, Sony Reader, Kobo eReader and iRex iLiad e-readers. These displays are constructed from an electrophoretic imaging film manufactured by E Ink Corporation. A mobile phone that used the technology is the Motorola Fone.\n\nElectrophoretic Display technology has also been developed by Sipix and Bridgestone/Delta.\nSiPix is now part of E Ink. The Sipix design uses a flexible 0.15 mm Microcup architecture, instead of E Ink's 0.04 mm diameter microcapsules.\nBridgestone Corp.'s Advanced Materials Division cooperated with Delta Optoelectronics Inc. in developing the Quick Response Liquid Powder Display (QR-LPD) technology.\n\nElectrophoretic displays can be manufactured using the Electronics on Plastic by Laser Release (EPLaR) process developed by Philips Research to enable existing AM-LCD manufacturing plants to create flexible plastic displays.\n\nMicroencapsulated electrophoretic display\n\nAn electrophoretic display forms images by rearranging charged pigment particles with an applied electric field.\n\nIn the 1990s another type of electronic ink based on a microencapsulated electrophoretic display was conceived and prototyped by a team of undergraduates at MIT as described in their Nature paper.  J.D. Albert, Barrett Comiskey, Joseph Jacobson, Jeremy Rubin and Russ Wilcox co-founded E Ink Corporation in 1997 to commercialize the technology. E ink subsequently formed a partnership with Philips Components two years later to develop and market the technology. In 2005, Philips sold the electronic paper business as well as its related patents to Prime View International.  “It has for many years been an ambition of researchers in display media to create a flexible low-cost system that is the electronic analogue of paper. In this context, microparticle-based displays have long intrigued researchers. Switchable contrast in such displays is achieved by the electromigration of highly scattering or absorbing microparticles (in the size range 0.1–5 mm), quite distinct from the  molecular-scale properties that govern the behaviour of the more familiar liquid-crystal displays. Micro-particle-based displays possess intrinsic bistability, exhibit extremely low power d.c. field addressing and have demonstrated high contrast and reflectivity. These features, combined with a near-lambertian viewing characteristic, result in an ‘ink on paper’ look. But such displays have to date suffered from short lifetimes and difficulty in manufacture. Here we report the synthesis of an electrophoretic ink based on the microencapsulation of an electrophoretic dispersion. The use of a microencapsulated electrophoretic medium solves the lifetime issues and permits the fabrication of a bistable electronic display solely by means of printing. This system may satisfy the practical requirements of electronic paper.”\n\nThis used tiny microcapsules filled with electrically charged white particles suspended in a colored oil. In early versions, the underlying circuitry controlled whether the white particles were at the top of the capsule (so it looked white to the viewer) or at the bottom of the capsule (so the viewer saw the color of the oil). This was essentially a reintroduction of the well-known electrophoretic display technology, but microcapsules meant the display could be made on flexible plastic sheets instead of glass.\nOne early version of electronic paper consists of a sheet of very small transparent capsules, each about 40 micrometers across. Each capsule contains an oily solution containing black dye (the electronic ink), with numerous white titanium dioxide particles suspended within. The particles are slightly negatively charged, and each one is naturally white.\nThe screen holds microcapsules in a layer of liquid polymer, sandwiched between two arrays of electrodes, the upper of which is transparent. The two arrays are aligned to divide the sheet into pixels, and each pixel corresponds to a pair of electrodes situated on either side of the sheet. The sheet is laminated with transparent plastic for protection, resulting in an overall thickness of 80 micrometers, or twice that of ordinary paper.\nThe network of electrodes connects to display circuitry, which turns the electronic ink 'on' and 'off' at specific pixels by applying a voltage to specific electrode pairs. A negative charge to the surface electrode repels the particles to the bottom of local capsules, forcing the black dye to the surface and turning the pixel black. Reversing the voltage has the opposite effect. It forces the particles to the surface, turning the pixel white. A more recent implementation of this concept requires only one layer of electrodes beneath the microcapsules.\n\nElectrowetting\n\nElectro-wetting display (EWD) is based on controlling the shape of a confined water/oil interface by an applied voltage. With no voltage applied, the (colored) oil forms a flat film between the water and a hydrophobic (water-repellent) insulating coating of an electrode, resulting in a colored pixel. When a voltage is applied between the electrode and the water, the interfacial tension between the water and the coating changes. As a result, the stacked state is no longer stable, causing the water to move the oil aside. This makes a partly transparent pixel, or, if a reflective white surface is under the switchable element, a white pixel. Because of the small pixel size, the user only experiences the average reflection, which provides a high-brightness, high-contrast switchable element.\n\nDisplays based on electro-wetting provide several attractive features. The switching between white and colored reflection is fast enough to display video content. It's a low-power and low-voltage technology, and displays based on the effect can be made flat and thin. The reflectivity and contrast are better than or equal to other reflective display types and approach the visual qualities of paper. In addition, the technology offers a unique path toward high-brightness full-color displays, leading to displays that are four times brighter than reflective LCDs and twice as bright as other emerging technologies.LiquaVista electrowetting display technologies http://www.liquavista.com Instead of using red, green and blue (RGB) filters or alternating segments of the three primary colors, which effectively result in only one third of the display reflecting light in the desired color, electro-wetting allows for a system in which one sub-pixel can switch two different colors independently.\n\nThis results in the availability of two thirds of the display area to reflect light in any desired color. This is achieved by building up a pixel with a stack of two independently controllable colored oil films plus a color filter.\n\nThe colors are cyan, magenta and yellow, which is a subtractive system, comparable to the principle used in inkjet printing for example. Compared to LCD, brightness is gained because no polarisers are required.\n\nExamples of commercial electrowetting displays include Liquavista, ITRI,[http://www.itri.org.tw/eng/news-and-events/feature-story-detail.asp?RootNodeId050&NodeId\n0502&FocusNewsNBR52]  and ADT.Blankenbach K, Schmoll A, Bitman A, Bartels F and Jerosch D 2008 Novel highly reflective and bistable electrowetting displays SID J. 16 237–44http://www.iop.org/Select/article/0960-1317/19/6/065029/jmm9_6_065029.pdf?request-id\n37ba45f3-e740-4c0d-8c35-dcf2d9af1f10\n\nElectrofluidic\n\nElectrofluidic displays are a variation of an electrowetting display. Electrofluidic displays place an aqueous pigment dispersion inside a tiny reservoir.  The reservoir comprises  Voltage is used to electromechanically pull the pigment out of the reservoir and spread it as a film directly behind the viewing substrate.  As a result, the display takes on color and brightness similar to that of conventional pigments printed on paper. When voltage is removed liquid surface tension causes the pigment dispersion to rapidly recoil into the reservoir.  As reported in the May 2009 Issue of Nature Photonics, the technology can potentially provide >85 % white state reflectance for electronic paper.\n\nThe core technology was invented at the Novel Devices Laboratory at the University of Cincinnati.  The technology is currently being commercialized by Gamma Dynamics.\n\nInterferometric modulator (Mirasol)\n\nTechnology used in electronic visual displays that can create various colors via interference of reflected light. The color is selected with an electrically switched light modulator comprising a microscopic cavity that is switched on and off using driver integrated circuits similar to those used to address liquid crystal displays (LCD).\n\nPlasmonic electronic display \n\nPlasmonic nanostructures with conductive polymers have also been suggested as one kind of electronic paper.Xiong, Kunli; Emilsson, Gustav; Maziz, Ali. ”[http://onlinelibrary.wiley.com/doi/10.1002/adma.201603358/abstract Plasmonic Metasurfaces with Conjugated Polymers for Flexible Electronic Paper in Color]”Advanced Materials: sid. n/a–n/a. [http://onlinelibrary.wiley.com/doi/10.1002/adma.201603358/full doi:10.1002/adma.201603358]. ISSN 1521-4095. Last 28 oktober 2016. The material has two parts. The first part is a highly reflective metasurface made by metal-insulator-metal films tens of nanometers in thickness including nanoscale holes. The metasurfaces can reflect different colors depending on the thickness of the insulator. The three primary colors red, green and blue can be used as pixels for full color displays. The second part is a polymer with optical absorption controllable by an electrochemical potential. After growing the polymer on the plasmonic metasurfaces, the reflection of the metasurfaces can be modulated by the applied voltage. This technology presents broad range colors, high polarization-independent reflection (>50 %), strong contrast (>30 %), fast response time (hundreds of ms), and long-term stability. In addition, it has ultralow power consumption (10000 dpi). Since the ultrathin metasurfaces are flexible and the polymer is soft, the whole system can be bent.Desired future improvements for this technology include bistability, cheaper materials and implementation with TFT arrays.\n\nOther bistable displays\n\n* Plastic Logic, manufacturer of flexible plastic electrophoretic displays\n* Kent Displays, manufacturer of cholesteric liquid crystal display (ChLCD)\n* Nemoptic, nematic materials\n* TRED\n* [https://web.archive.org/web/20140525200255/http://www.sharpmemorylcd.com/aboutmemorylcd.html Sharp Memory LCD], used in Pebble smartwatch.\n* Zeta Imaging, research project to produce a color E-ink device without the need for filters or variable particle timing\n\nOther technologies\n\nOther research efforts into e-paper have involved using organic transistors embedded into flexible substrates, including attempts to build them into conventional paper.\nSimple color e-paper consists of a thin colored optical filter added to the monochrome technology described above. The array of pixels is divided into triads, typically consisting of the standard cyan, magenta and yellow, in the same way as CRT monitors (although using subtractive primary colors as opposed to additive primary colors).  The display is then controlled like any other electronic color display.\n\nExamples of electrochromic displays include Acreo, Ajjer, Aveso and Ntera.\n\nDisadvantages\n\nElectronic paper technologies have a very low refresh rate compared to other low-power display technologies, such as LCDs. This prevents producers from implementing sophisticated interactive applications (using fast-moving menus, mouse pointers or scrolling) like those common on standard mobile devices. An example of this limit is that a document cannot be smoothly zoomed without either extreme blurring during the transition or a very slow zoom.\n\nAnother limit is that a shadow of an image may be visible after refreshing parts of the screen. Such shadows are termed \"ghost images\", and the effect is termed \"ghosting\". This effect is reminiscent of screen burn-in but, unlike screen burn-in, is solved after the screen is refreshed several times. Turning every pixel white, then black, then white, helps normalize the contrast of the pixels. This is why several devices with this technology \"flash\" the entire screen white and black when loading a new image.\n\nE Ink Corporation of E Ink Holdings Inc. released the first colored e-ink displays to be used in a marketed product. The Ectaco Jetbook Color was released in 2012 as the first colored e-ink e-reader, which used E Ink's Triton display technology. E Ink in early 2015 also announced another color e-ink technology called Prism. This new technology is a color changing film that can be used for e-reader, but Prism is also marketed as a film that can be integrated into architectural design such as \"wall, ceiling panel, or entire room instantly.\" The disadvantage of these current color displays is that they are considerably more expensive than standard E Ink displays. The JetBook Color costs roughly nine times more than other popular e-readers such as the Amazon Kindle. As of January 2015, Prism had not been announced to be used in the plans for any e-reader devices.\n\nApplications\n\nSeveral companies are simultaneously developing electronic paper and ink.  While the technologies used by each company provide many of the same features, each has its own distinct technological advantages. All electronic paper technologies face the following general challenges:\n\n* A method for encapsulation\n* An ink or active material to fill the encapsulation\n* Electronics to activate the ink\n\nElectronic ink can be applied to flexible or rigid materials.  For flexible displays, the base requires a thin, flexible material tough enough to withstand considerable wear, such as extremely thin plastic. The method of how the inks are encapsulated and then applied to the substrate is what distinguishes each company from others. These processes are complex and are carefully guarded industry secrets.  Nevertheless, making electronic paper is less complex and costly than LCDs.\n\nThere are many approaches to electronic paper, with many companies developing technology in this area. Other technologies being applied to electronic paper include modifications of liquid crystal displays, electrochromic displays, and the electronic equivalent of an Etch A Sketch at Kyushu University.  Advantages of electronic paper includes low power usage (power is only drawn when the display is updated), flexibility and better readability than most displays.  Electronic ink can be printed on any surface, including walls, billboards, product labels and T-shirts.  The ink's flexibility would also make it possible to develop rollable displays for electronic devices.\n\nWristwatches\n\nIn December 2005 Seiko released the first electronic ink based watch called the Spectrum SVRD001 wristwatch, which has a flexible electrophoretic display\n[http://www.akihabaranews.com//en/news-10749-The+first+watch+that+uses+flexible+e-paper+hits+the+stores.html \"The first watch that uses flexible e-paper hits the stores\"]\n2005-12-01\n and in March 2010 Seiko released a second generation of this famous e-ink watch with an active matrix display.[http://www.seikowatches.com/baselworld/2010/precon/0402-epd.html \"Baselworld 2010 - Seiko Press Conference - Future Now, EPD Watch] \n2010-04-01\n The Pebble smart watch (2013) uses a low-power memory LCD manufactured by Sharp for its e-paper display.\n\nE-book readers\n\nIn 2004 Sony released the Librié in Japan, the first e-book reader with an electronic paper E Ink display. In September 2006, Sony released the PRS-500 Sony Reader e-book reader in the USA. On October 2, 2007, Sony announced the PRS-505, an updated version of the Reader. In November 2008, Sony released the PRS-700BC, which incorporated a backlight and a touchscreen.\n\nIn late 2007, Amazon began producing and marketing the Amazon Kindle, an e-book reader with an e-paper display. In February 2009, Amazon released the Kindle 2 and in May 2009 the larger Kindle DX was announced. In July 2010 the third generation Kindle was announced, with notable design changes.  The fourth generation of Kindle, called Touch, was announced in September 2011 that was the Kindle's first departure from keyboards and page turn buttons in favor of touchscreens.  In September 2012, Amazon announced the fifth generation of the Kindle called the Paperwhite, which incorporates a LED frontlight and a higher contrast display.\n\nIn November 2009, Barnes and Noble launched the Barnes & Noble Nook, running an Android operating system. It differs from other e-readers in having a replaceable battery, and a separate touch-screen color LCD below the main electronic paper reading screen.\n\nIn 2017 Sony and reMarkable offered e-books tailored for writing with a smart stylus. \n\nNewspapers\n\nIn February 2006, the Flemish daily De Tijd distributed an electronic version of the paper to select subscribers in a limited marketing study, using a pre-release version of the iRex iLiad.  This was the first recorded application of electronic ink to newspaper publishing.\n\nThe French daily Les Échos announced the official launch of an electronic version of the paper on a subscription basis, in September 2007. Two offers were available, combining a one-year subscription and a reading device. The offer included either a light (176g) reading device (adapted for Les Echos by Ganaxa) or the iRex iLiad. Two different processing platforms were used to deliver readable information of the daily, one based on the newly developed GPP electronic ink platform from Ganaxa, and the other one developed internally by Les Echos.\n\nDisplays embedded in smart cards\n\nFlexible display cards enable financial payment cardholders to generate a one-time password to reduce online banking and transaction fraud. Electronic paper offers a flat and thin alternative to existing key fob tokens for data security. The world’s first ISO compliant smart card with an embedded display was developed by Innovative Card Technologies and nCryptone in 2005. The cards were manufactured by Nagra ID.\n\nStatus displays\n\nSome devices, like USB flash drives, have used electronic paper to display status information, such as available storage space.  Once the image on the electronic paper has been set, it requires no power to maintain, so the readout can be seen even when the flash drive is not plugged in.\n\nMobile phones\n\nMotorola's low-cost mobile phone, the Motorola F3, uses an alphanumeric black-and-white electrophoretic display.\n\nThe Samsung Alias 2 mobile phone incorporates electronic ink from E Ink into the keypad, which allows the keypad to change character sets and orientation while in different display modes.\n\nOn December 12, 2012, Yota Devices announced the first \"YotaPhone\" prototype and was later released on December 2013, a unique double-display smartphone. It has an 4.3-inch, HD LCD on the front and an e-ink display on the back with smart battery usage.\n\nElectronic shelf labels\n\nE-Paper based electronic shelf labels (ESL) are used to digitally display the prices of goods at retail stores. Electronic paper based labels are updated via two-way infrared or radio technology.\n\nDigital signage\n\nBecause of its energy-saving properties, electronic paper has proved a technology suited to digital signage applications.\n\nOther\n\nOther proposed applications include clothes, digital photo frames, information boards and keyboards. Keyboards with dynamically changeable keys are useful for less represented languages, non-standard keyboard layouts such as Dvorak, or for special non-alphabetical applications such as video editing or games.\n\nDisplay manufacturers\n\n*E Ink Holdings Inc.\n*Liquavista\n*LG\n*NEC\n*Plastic Logic\n*Polymer Vision\n*Samsung\n*Seiko Epson. Electronic paper. http://en.wikipedia.org/?curid=9225."
  }
}
