{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19643",
  "eid" : "3cb26260-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778611078,
  "textBody" : "The Mahābhārata (, ',) is one of the two major Sanskrit epics of ancient India, the other being the Rāmāyaṇa.\n\nThe Mahābhārata is an epic narrative of the Kurukṣetra War and the fates of the Kaurava and the Pāṇḍava princes. It also contains philosophical and devotional material, such as  a discussion of the four \"goals of life\" or puruṣārtha (12.161). Among the principal works and stories in the Mahābhārata are the Bhagavad Gita, the story of Damayanti, an abbreviated version of the Rāmāyaṇa, and the story of Ṛṣyasringa, often considered as works in their own right.\n\nTraditionally, the authorship of the Mahābhārata is attributed to Vyāsa. There have been many attempts to unravel its historical growth and compositional layers. The oldest preserved parts of the text are thought to be not much older than around 400 BCE, though the origins of the epic probably fall between the 8th and 9th centuries BCE.Brockington (1998, p. 26) The text probably reached its final form by the early Gupta period (c. 4th century CE).Van Buitenen; The Mahabharata – 1; The Book of the Beginning. Introduction (Authorship and Date) The title may be translated as \"the great tale of the Bhārata dynasty\". According to the Mahābhārata itself, the tale is extended from a shorter version of 24,000 verses called simply Bhārata.bhārata means the progeny of Bharata, the  legendary king who is claimed to have founded the Bhāratavarsha kingdom.\n\nThe Mahābhārata is the longest epic poem known and has been described as \"the longest poem ever written\".  Its longest version consists of over 100,000 śloka or over 200,000 individual verse lines (each shloka is a couplet), and long prose passages. At about 1.8 million words in total, the Mahābhārata is roughly ten times the length of the Iliad and the Odyssey combined, or about four times the length of the Rāmāyaṇa.Spodek, Howard. Richard Mason. The World's History. Pearson Education: 2006, New Jersey. 224, 0-13-177318-6Amartya Sen, The Argumentative Indian. Writings on Indian Culture, History and Identity, London: Penguin Books, 2005. W. J. Johnson has compared the importance of the Mahābhārata in the context of world civilization to that of the Bible, the works of William Shakespeare, the works of Homer, Greek drama, or the Quran. Within the Indian tradition it is sometimes called the Fifth Veda.\n\nTextual history and structure\n\nThe epic is traditionally ascribed to the sage Vyāsa, who is also a major character in the epic. Vyāsa described it as being itihāsa (history). He also describes the Guru-shishya parampara, which traces all great teachers and their students of the Vedic times.\n\nThe first section of the Mahābhārata states that it was Gaṇeśa who wrote down the text to Vyasa's dictation.\n\nThe epic employs the story within a story structure, otherwise known as frametales, popular in many Indian religious and non-religious works. It is first recited at Takshashila by the sage Vaiśampāyana, a disciple of Vyāsa, to the King Janamejaya who is the great-grandson of the Pāṇḍava prince Arjuna. The story is then recited again by a professional storyteller named Ugraśrava Sauti, many years later, to an assemblage of sages performing the 12-year sacrifice for the king Saunaka Kulapati in the Naimiśa Forest.\n\nThe text was described by some early 20th-century western Indologists as unstructured and chaotic. Hermann Oldenberg supposed that the original poem must once have carried an immense \"tragic force\" but dismissed the full text as a \"horrible chaos.\"Hermann Oldenberg, Das Mahabharata: seine Entstehung, sein Inhalt, seine Form, Göttingen, 1922,  Moritz Winternitz (Geschichte der indischen Literatur 1909) considered that \"only unpoetical theologists and clumsy scribes\" could have lumped the parts of disparate origin into an unordered whole.[http://www.harekrsna.com/sun/features/07-06/features360.htm \"The Mahabharata\"] at The Sampradaya Sun \n\nAccretion and redaction\n\nResearch on the Mahābhārata has put an enormous effort into recognizing and dating layers within the text. Some elements of the present Mahābhārata can be traced back to Vedic times.[https://books.google.com/books?idFYPOVdzZ2UIC&pg\nPA452&dqa+history+of+indian+literature+mahabharata+date&hl\nen&eiLebbTIesJIOycOuWycMG&sa\nX&oibook_result&ct\nbook-thumbnail&resnum1&ved\n0CDgQ6wEwAA#vonepage&q\na%20history%20of%20indian%20literature%20mahabharata%20date&ffalse A History of Indian Literature], Volume 1 by Maurice Winternitz The background to the Mahābhārata suggests the origin of the epic occurs \"after the very early Vedic period\" and before \"the first Indian 'empire' was to rise in the third century B.C.\" That this is \"a date not too far removed from the 8th or 9th century B.C.\"Buitenen (1973) pp. xxiv–xxv is likely. Mahābhārata started as an orally-transmitted tale of the charioteer bards. It is generally agreed that \"Unlike the Vedas, which have to be preserved letter-perfect, the epic was a popular work whose reciters would inevitably conform to changes in language and style,\" so the earliest 'surviving' components of this dynamic text are believed to be no older than the earliest 'external' references we have to the epic, which may include an allusion in Panini's 4th century BCE grammar Aṣṭādhyāyī 4:2:56. It is estimated that the Sanskrit text probably reached something of a \"final form\" by the early Gupta period (about the 4th century CE). Vishnu Sukthankar, editor of the first great critical edition of the Mahābhārata, commented: \"It is useless to think of reconstructing a fluid text in a literally original shape, on the basis of an archetype and a stemma codicum. What then is possible? Our objective can only be to reconstruct the oldest form of the text which it is possible to reach on the basis of the manuscript material available.\"Sukthankar (1933) \"Prolegomena\" p. lxxxvi. Emphasis is original. That manuscript evidence is somewhat late, given its material composition and the climate of India, but it is very extensive.\n\nThe Mahābhārata itself (1.1.61) distinguishes a core portion of 24,000 verses: the Bhārata proper, as opposed to additional secondary material, while the Aśvalāyana Gṛhyasūtra (3.4.4) makes a similar distinction. At least three redactions of the text are commonly recognized: Jaya (Victory) with 8,800 verses attributed to Vyāsa, Bhārata with 24,000 verses as recited by Vaiśampāyana, and finally the Mahābhārata as recited by Ugraśrava Sauti with over 100,000 verses.Gupta & Ramachandran (1976), citing Mahabharata, Critical Edition, I, 56, 33SP Gupta and KS Ramachandran (1976), p.3-4, citing Vaidya (1967), p.11 However, some scholars, such as John Brockington, argue that Jaya and Bharata refer to the same text, and ascribe the theory of Jaya with 8,800 verses to a misreading of a verse in Ādiparvan (1.1.81).\nThe redaction of this large body of text was carried out after formal principles, emphasizing the numbers 1818 books, 18 chapters of the Bhagavadgita and the Narayaniya each, corresponding to the 18 days of the battle and the 18 armies (Mbh. 5.152.23) and 12. The addition of the latest parts may be dated by the absence of the Anuśāsana-parva and the Virāta parva from the \"Spitzer manuscript\".The Spitzer Manuscript (Beitrage zur Kultur- und Geistesgeschichte Asiens), Austrian Academy of Sciences, 2004. It is one of the oldest Sanskrit manuscripts found on the Silk Road and part of the estate of Dr. Moritz Spitzer. The oldest surviving Sanskrit text dates to the Kushan Period (200 CE).[https://www.jstor.org/pss/596517 The Oldest Extant Parvan-List of the Mahābhārata], Dieter Schlingloff, Journal of the American Oriental Society, Vol. 89, No. 2, April–June  1969, pp. 334–338, at JSTOR\n\nAccording to what one character says at Mbh. 1.1.50, there were three versions of the epic, beginning with Manu (1.1.27), Astika (1.3, sub-parva 5) or Vasu (1.57), respectively. These versions would correspond to the addition of one and then another 'frame' settings of dialogues. The Vasu version would omit the frame settings and begin with the account of the birth of Vyasa. The astika version would add the sarpasattra and aśvamedha material from Brahmanical literature, introduce the name Mahābhārata, and identify Vyāsa as the work's author. The redactors of these additions were probably Pāñcarātrin scholars who according to Oberlies (1998) likely retained control over the text until its final redaction. Mention of the Huna in the Bhīṣma-parva however appears to imply that this parva may have been edited around the 4th century.\n\nThe Ādi-parva includes the snake sacrifice (sarpasattra) of Janamejaya, explaining its motivation, detailing why all snakes in existence were intended to be destroyed, and why in spite of this, there are still snakes in existence. This sarpasattra material was often considered an independent tale added to a version of the Mahābhārata by \"thematic attraction\" (Minkowski 1991), and considered to have a particularly close connection to Vedic (Brahmana) literature. The Pañcavimśa Brahmana (at 25.15.3) enumerates the officiant priests of a sarpasattra among whom the names Dhṛtarāṣtra and Janamejaya, two main characters of the Mahābhāratas sarpasattra, as well as Takṣaka, the name of a snake in the Mahābhārata, occur.J.A.B. van Buitenen, Mahābhārata, Volume 1, p.445, citing W. Caland, The Pañcaviṃśa Brāhmaṇa, p.640-2\n\nHistorical references\n\nThe earliest known references to the Mahābhārata and its core Bhārata date to the Aṣṭādhyāyī (sutra 6.2.38) of Pāṇini (fl. 4th century BCE) and in the Aśvalāyana Gṛhyasūtra (3.4.4). This may mean the core 24,000 verses, known as the Bhārata, as well as an early version of the extended Mahābhārata, were composed by the 4th century BCE.  A report by the Greek writer Dio Chrysostom (c. 40 - c. 120 CE) about Homer's poetry being sung even in IndiaDio Chrysostom, 53.[http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Dio_Chrysostom/Discourses/53*.html#6 6]-7, trans. H. Lamar Crosby, Loeb Classical Library, 1946, vol. 4, p. 363. seems to imply that the Iliad had been translated into Sanskrit. However, Indian scholars have, in general, taken this as evidence for the existence of a Mahābhārata at this date, whose episodes Dio or his sources identify with the story of the Iliad.Christian Lassen, in his Indische Alterthumskunde, supposed that the reference is ultimately to Dhritarashtra's sorrows, the laments of Gandhari and Draupadi, and the valor of Arjuna and Suyodhana or Karna (cited approvingly in Max Duncker, The History of Antiquity (trans. Evelyn Abbott, London 1880), vol. 4, [https://books.google.com/books?idgIkBAAAAQAAJ&pg\nPA81 p. 81]). This interpretation is endorsed in such standard references as Albrecht Weber's History of Indian Literature but has sometimes been repeated as fact instead of as interpretation.\n\nSeveral stories within the Mahābhārata took on separate identities of their own in Classical Sanskrit literature. For instance, Abhijñānaśākuntala by the renowned Sanskrit poet Kālidāsa (c. 400 CE), believed to have lived in the era of the Gupta dynasty, is based on a story that is the precursor to the Mahābhārata. Urubhaṅga, a Sanskrit play written by Bhāsa who is believed to have lived before Kālidāsa, is based on the slaying of Duryodhana by the splitting of his thighs by Bhīma.\n\nThe copper-plate inscription of the Maharaja Sharvanatha (533–534 CE) from Khoh (Satna District, Madhya Pradesh) describes the Mahābhārata as a \"collection of 100,000 verses\" (śata-sahasri saṃhitā).\n\nThe 18 parvas or books\n\nThe division into 18 parvas is as follows:\n\nHistorical context\n\nThe historicity of the Kurukshetra War is unclear. Many historians  estimate the date of the Kurukshetra war to Iron Age India of the 10th century BCE.In discussing the dating question, historian A. L. Basham says: \"According to the most popular later tradition the Mahabharata War took place in 3102 BCE, which in the light of all evidence, is quite impossible. More reasonable is another tradition, placing it in the 15th century BCE, but this is also several centuries too early in the light of our archaeological knowledge. Probably the war took place around the beginning of the 9th century BCE; such a date seems to fit well with the scanty archaeological remains of the period, and there is some evidence in the Brahmana literature itself to show that it cannot have been much earlier.\" Basham, p. 40, citing HC Raychaudhuri, Political History of Ancient India, pp.27ff. The setting of the epic has a historical precedent in Iron Age (Vedic) India, where the Kuru kingdom was the center of political power during roughly 1200 to 800 BCE.M Witzel, Early Sanskritization: Origin and Development of the Kuru state, EJVS vol.1 no.4 (1995); also in B. Kölver (ed.), Recht, Staat und Verwaltung im klassischen Indien. The state, the Law, and Administration in Classical India, München, R. Oldenbourg, 1997, p.27-52  A dynastic conflict of the period could have been the inspiration for the Jaya, the foundation on which the Mahābhārata corpus was built, with a climactic battle eventually coming to be viewed as an epochal event.\n\nPuranic literature presents genealogical lists associated with the Mahābhārata narrative. The evidence of the Puranas is of two kinds. Of the first kind, there is the direct statement that there were 1015 (or 1050) years between the birth of Parikshit (Arjuna's grandson) and the accession of Mahapadma Nanda (400-329 BCE), which would yield an estimate of about 1400 BCE for the Bharata battle.A.D. Pusalker, History and Culture of the Indian People, Vol I, Chapter XIV, p.273  However, this would imply improbably long reigns on average for the kings listed in the genealogies.FE Pargiter, Ancient Indian Historical Tradition, p.180. He shows estimates of the average as 47, 50, 31 and 35 for various versions of the lists.\nOf the second kind are analyses of parallel genealogies in the Puranas between the times of Adhisimakrishna (Parikshit's great-grandson) and Mahapadma Nanda. Pargiter accordingly estimated 26 generations by averaging 10 different dynastic lists and, assuming 18 years for the average duration of a reign, arrived at an estimate of 850 BCE for Adhisimakrishna, and thus approximately 950 BCE for the Bharata battle.Pargiter, op.cit. p.180-182\n\nB. B. Lal used the same approach with a more conservative assumption of the average reign to estimate a date of 836 BCE, and correlated this with archaeological evidence from Painted Grey Ware (PGW) sites, the association being strong between PGW artifacts and places mentioned in the epic.B. B. Lal, Mahabharata and Archaeology in Gupta and Ramachandran (1976), p.57-58 John Keay confirm this and also gives 950 BCE for the Bharata battle.\n\nAttempts to date the events using methods of archaeoastronomy have produced, depending on which passages are chosen  and how they are interpreted, estimates ranging from the late 4th to the mid-2nd millennium BCE.Gupta and Ramachandran (1976), p.246, who summarize as follows: \"Astronomical calculations favor 15th century BCE as the date of the war while the Puranic data place it in the 10th/9th century BCE. Archaeological evidence points towards the latter.\" (p.254) The late 4th millennium date has a precedent in the calculation of the Kaliyuga epoch, based on planetary conjunctions, by Aryabhata (6th century). Aryabhata's date of February 18 3102 BCE for Mahābhārata war has become widespread in Indian tradition. Some sources mark this as the disappearance of Krishna from earth. The Aihole inscription of Pulikeshi II, dated to Saka 556 = 634 CE, claims that 3735 years have elapsed since the Bharata battle, putting the date of Mahābhārata war at 3137 BCE.Gupta and Ramachandran (1976), p.55; AD Pusalker, HCIP, Vol I, p.272\nAnother traditional school of astronomers and historians, represented by Vriddha-Garga, Varahamihira (author of the Brhatsamhita) and Kalhana (author of the Rajatarangini), place the Bharata war 653 years after the Kaliyuga epoch, corresponding to 2449 BCE.AD Pusalker, op.cit. p.272\n\nSynopsis\n\nThe core story of the work is that of a dynastic struggle for the throne of Hastinapura, the kingdom ruled by the Kuru clan. The two collateral branches of the family that participate in the struggle are the Kaurava and the Pandava. Although the Kaurava is the senior branch of the family, Duryodhana, the eldest Kaurava, is younger than Yudhishthira, the eldest Pandava. Both Duryodhana and Yudhishthira claim to be first in line to inherit the throne.\n\nThe struggle culminates in the great battle of Kurukshetra, in which the Pandavas are ultimately victorious. The battle produces complex conflicts of kinship and friendship, instances of family loyalty and duty taking precedence over what is right, as well as the converse.\n\nThe Mahābhārata itself ends with the death of Krishna, and the subsequent end of his dynasty and ascent of the Pandava brothers to heaven. It also marks the beginning of the Hindu age of Kali Yuga, the fourth and final age of humankind, in which great values and noble ideas have crumbled, and people are heading towards the complete dissolution of right action, morality and virtue.\n\nThe older generations\n\nKing Janamejaya's ancestor Shantanu, the king of Hastinapura, has a short-lived marriage with the goddess Ganga and has a son, Devavrata (later to be called Bhishma, a great warrior), who becomes the heir apparent. Many years later, when King Shantanu goes hunting, he sees Satyavati, the daughter of the chief of fisherman, and asks her father for her hand. Her father refuses to consent to the marriage unless Shantanu promises to make any future son of Satyavati the king upon his death. To resolve his father's dilemma, Devavrata agrees to relinquish his right to the throne. As the fisherman is not sure about the prince's children honouring the promise, Devavrata also takes a vow of lifelong celibacy to guarantee his father's promise.\n\nShantanu has two sons by Satyavati, Chitrāngada and Vichitravirya. Upon Shantanu's death, Chitrangada becomes king. He lives a very short uneventful life and dies. Vichitravirya, the younger son, rules Hastinapura. Meanwhile, the King of Kāśī arranges a swayamvara for his three daughters, neglecting to invite the royal family of Hastinapur. In order to arrange the marriage of young Vichitravirya, Bhishma attends the swayamvara of the three princesses Amba, Ambika and Ambalika, uninvited, and proceeds to abduct them. Ambika and Ambalika consent to be married to Vichitravirya.\n\nThe oldest princess Amba, however, informs Bhishma that she wishes to marry king of Shalva whom Bhishma defeated at their swayamvara. Bhishma lets her leave to marry king of Shalva, but Shalva refuses to marry her, still smarting at his humiliation at the hands of Bhishma. Amba then returns to marry Bhishma but he refuses due to his vow of celibacy. Amba becomes enraged and becomes Bhishma's bitter enemy, holding him responsible for her plight. Later she is reborn to King Drupada as Shikhandi (or Shikhandini) and causes Bhishma's fall, with the help of Arjuna, in the battle of Kurukshetra.\n\nThe Pandava and Kaurava princes\n\nWhen Vichitravirya dies young without any heirs, Satyavati asks her first son Vyasa to father children with the widows. The eldest, Ambika, shuts her eyes when she sees him, and so her son Dhritarashtra is born blind. Ambalika turns pale and bloodless upon seeing him, and thus her son Pandu is born pale and unhealthy (the term Pandu may also mean 'jaundiced'). Due to the physical challenges of the first two children, Satyavati asks Vyasa to try once again. However, Ambika and Ambalika send their maid instead, to Vyasa's room. Vyasa fathers a third son, Vidura, by the maid. He is born healthy and grows up to be one of the wisest characters in the Mahabharata. He serves as Prime Minister (Mahamantri or Mahatma) to King Pandu and King Dhritarashtra.\n\nWhen the princes grow up, Dhritarashtra is about to be crowned king by Bhishma when Vidura intervenes and uses his knowledge of politics to assert that a blind person cannot be king. This is because a blind man cannot control and protect his subjects. The throne is then given to Pandu because of Dhritarashtra's blindness. Pandu marries twice, to Kunti and Madri. Dhritarashtra  marries Gandhari, a princess from Gandhara, who blindfolds herself so that she may feel the pain that her husband feels. Her brother Shakuni is enraged by this and vows to take revenge on the Kuru family. One day, when Pandu is relaxing in the forest, he hears the sound of a wild animal. He shoots an arrow in the direction of the sound. However the arrow hits the sage Kindama, who curses him that if he engages in a sexual act, he will die. Pandu then retires to the forest along with his two wives, and his brother Dhritarashtra rules thereafter, despite his blindness.\n\nPandu's older queen Kunti, however, had been given a boon by Sage Durvasa that she could invoke any god using a special mantra. Kunti uses this boon to ask Dharma the god of justice, Vayu the god of the wind, and Indra the lord of the heavens for sons. She gives birth to three sons, Yudhishthira, Bhima, and Arjuna, through these gods. Kunti shares her mantra with the younger queen Madri, who  bears the twins Nakula and Sahadeva through the Ashwini twins. However, Pandu and Madri indulge in sex, and Pandu dies. Madri dies on his funeral pyre out of remorse. Kunti raises the five brothers, who are from then on usually referred to as the Pandava brothers.\n\nDhritarashtra has a hundred sons through Gandhari, all born after the birth of Yudhishthira. These are the Kaurava brothers, the eldest being Duryodhana, and the second Dushasana. Other Kaurava brothers were Vikarna and Sukarna. The rivalry and enmity between them and the Pandava brothers, from their youth and into manhood, leads to the Kurukshetra war.\n\nLakshagraha (the house of lac)\n\nAfter the deaths of their mother (Madri) and father (Pandu), the Pandavas and their mother Kunti return to the palace of Hastinapur. Yudhishthira is made Crown Prince by Dhritarashtra, under considerable pressure from his kingdom. Dhritarashtra wanted his own son Duryodhana to become king and lets his ambition get in the way of preserving justice.\n\nShakuni, Duryodhana and Dusasana plot to get rid of the Pandavas. Shakuni calls the architect Purochana to build a palace out of flammable materials like lac and ghee. He then arranges for the Pandavas and the Queen Mother Kunti to stay there, with the intention of setting it alight. However, the Pandavas are warned by their wise uncle, Vidura, who sends them a miner to dig a tunnel. They are able to escape to safety and go into hiding. Back at Hastinapur, the Pandavas and Kunti are presumed dead.\n\nMarriage to Draupadi\n\nWhilst they were in hiding the Pandavas learn of a swayamvara which is taking place for the hand of the Pāñcāla princess  Draupadī. The Pandavas enter the competition in disguise as Brahmins. The task is to string a mighty steel bow and shoot a target on the ceiling, which is the eye of a moving artificial fish, while looking at its reflection in oil below. Most of the princes fail, many being unable to lift the bow. Arjuna succeeds however. The Pandavas return home and inform their mother that Arjuna has won a competition and to look at what they have brought back. Without looking, Kunti asks them to share whatever it is Arjuna has won among themselves. On explaining the previous life of Draupadi, she ends up being the wife of all five brothers.\n\nIndraprastha\n\nAfter the wedding, the Pandava brothers are invited back to Hastinapura. The Kuru family elders and relatives negotiate and broker a split of the kingdom, with the Pandavas obtaining a new territory. Yudhishthira has a new capital built for this territory at Indraprastha. Neither the Pandava nor Kaurava sides are happy with the arrangement however.\n\nShortly after this, Arjuna elopes with and then marries Krishna's sister, Subhadra. Yudhisthra wishes to establish his position as king; he seeks Krishna's advice. Krishna advises him, and after due preparation and the elimination of some opposition, Yudhishthira carries out the rājasūya yagna ceremony; he is thus recognised as pre-eminent among kings.\n\nThe Pandavas have a new palace built for them, by Maya the Danava. They invite their Kaurava cousins to Indraprastha. Duryodhana walks round the palace, and mistakes a glossy floor for water, and will not step in. After being told of his error, he then sees a pond, and assumes it is not water and falls in. Bhima, Arjun, the twins and the servants laugh at him. In popular adaptations, this insult is wrongly attributed to Draupadi, even though in the Sanskrit epic, it was the Pandavas (except Yudhisthira) who had insulted Duryodhana. Enraged by the insult, and jealous at seeing the wealth of the Pandavas, Duryodhana decides to host a dice-game at Shakuni's suggestion.\n\nThe dice game\n\nShakuni, Duryodhana's uncle, now arranges a dice game, playing against Yudhishthira with loaded dice. Yudhishthira loses all his wealth, then his kingdom. He then even gambles his brothers, himself, and finally his wife into servitude. The jubilant Kauravas insult the Pandavas in their helpless state and even try to disrobe Draupadi in front of the entire court, but her honour is saved by Krishna who miraculously creates lengths of cloth to replace the ones being removed.\n\nDhritarashtra, Bhishma, and the other elders are aghast at the situation, but Duryodhana is adamant that there is no place for two crown princes in Hastinapura. Against his wishes Dhritarashtra orders for another dice game. The Pandavas are required to go into exile for 12 years, and in the 13th year must remain hidden. If discovered by the Kauravas, they will be forced into exile for another 12 years.\n\nExile and return\n\nThe Pandavas spend thirteen years in exile; many adventures occur during this time. They also prepare alliances for a possible future conflict. They spend their final year in disguise in the court of Virata, and are discovered just after the end of the year.\n\nAt the end of their exile, they try to negotiate a return to Indraprastha. However, this fails, as Duryodhana objects that they were discovered while in hiding, and that no return of their kingdom was agreed. War becomes inevitable.\n\nThe battle at Kurukshetra\n\nThe two sides summon vast armies to their help and line up at Kurukshetra for a war. The kingdoms of Panchala, Dwaraka, Kasi, Kekaya, Magadha, Matsya, Chedi, Pandyas, Telinga, and the Yadus of Mathura and some other clans like the Parama Kambojas were allied with the Pandavas. The allies of the Kauravas included the kings of Pragjyotisha, Anga, Kekaya, Sindhudesa (including Sindhus, Sauviras and Sivis), Mahishmati, Avanti in Madhyadesa, Madra, Gandhara, Bahlika people, Kambojas and many others. Before war being declared, Balarama had expressed his unhappiness at the developing conflict and left to go on pilgrimage; thus he does not take part in the battle itself. Krishna takes part in a non-combatant role, as charioteer for Arjuna.\n\nBefore the battle, Arjuna, seeing the opposing army includes many relatives and loved ones, including his great grandfather Bhishma and his teacher Drona, has doubts about the battle and he fails to lift his Gāndeeva bow. Krishna wakes him up to his call of duty in the famous Bhagavad Gita section of the epic.\n\nThough initially sticking to chivalrous notions of warfare, both sides soon adopt dishonourable tactics. At the end of the 18-day battle, only the Pandavas, Satyaki, Kripa, Ashwatthama, Kritavarma, Yuyutsu and Krishna survive.\n\nThe end of the Pandavas\n\nAfter \"seeing\" the carnage, Gandhari, who had lost all her sons, curses Krishna to be a witness to a similar annihilation of his family, for though divine and capable of stopping the war, he had not done so. Krishna accepts the curse, which bears fruit 36 years later.\n\nThe Pandavas, who had ruled their kingdom meanwhile, decide to renounce everything. Clad in skins and rags they retire to the Himalaya and climb towards heaven in their bodily form. A stray dog travels with them. One by one the brothers and Draupadi fall on their way. As each one stumbles, Yudhishthira gives the rest the reason for their fall (Draupadi was partial to Arjuna, Nakula and Sahadeva were vain and proud of their looks, and Bhima and Arjuna were proud of their strength and archery skills, respectively). Only the virtuous Yudhishthira, who had tried everything to prevent the carnage, and the dog remain. The dog reveals himself to be the god Yama (also known as Yama Dharmaraja), and then takes him to the underworld where he sees his siblings and wife. After explaining the nature of the test, Yama takes Yudhishthira back to heaven and explains that it was necessary to expose him to the underworld because (Rajyante narakam dhruvam) any ruler has to visit the underworld at least once. Yama then assures him that his siblings and wife would join him in heaven after they had been exposed to the underworld for measures of time according to their vices.\n\nArjuna's grandson Parikshit rules after them and dies bitten by a snake. His furious son, Janamejaya, decides to perform a snake sacrifice (sarpasattra) in order to destroy the snakes. It is at this sacrifice that the tale of his ancestors is narrated to him.\n\nThe reunion\n\nThe Mahābhārata mentions that Karna, the Pandavas, Draupadi and Dhritarashtra's sons eventually ascended to svarga and \"attained the state of the gods\" and banded together — \"serene and free from anger.\"\n\nThemes\n\nJust war\n\nThe Mahābhārata offers one of the first instances of theorizing about dharmayuddha, \"just war\", illustrating many of the standards that would be debated later across the world. In the story, one of five brothers asks if the suffering caused by war can ever be justified. A long discussion ensues between the siblings, establishing criteria like proportionality (chariots cannot attack cavalry, only other chariots; no attacking people in distress), just means (no poisoned or barbed arrows), just cause (no attacking out of rage), and fair treatment of captives and the wounded.\n\nVersions, translations, and derivative works\n\nCritical Edition\n\nBetween 1919 and 1966, scholars at the Bhandarkar Oriental Research Institute, Pune, compared the various manuscripts of the epic from India and abroad and produced the Critical Edition of the Mahabharata, on 13,000 pages in 19 volumes, followed by the Harivamsha in another two volumes and six index volumes. This is the text that is usually used in current Mahābhārata studies for reference.[http://www.virtualpune.com/html/channel/edu/institutes/html/bhandark.shtml Bhandarkar Institute, Pune]—Virtual Pune This work is sometimes called the \"Pune\" or \"Poona\" edition of the Mahabharata.\n\nRegional versions\n\nMany regional versions of the work developed over time, mostly differing only in minor details, or with verses or subsidiary stories being added. These include the Tamil street theatre, terukkuttu and kattaikkuttu, the plays of which use themes from the Tamil language versions of Mahabharata, focusing on Draupadi.\n\nOutside the Indian subcontinent, in Indonesia, a version was developed in ancient Java as Kakawin Bhāratayuddha in the 11th century under the patronage of King Dharmawangsa (990–1016) and later it spread to the neighboring island of Bali, which remains a Hindu majority island today. It has become the fertile source for Javanese literature, dance drama (wayang wong), and wayang shadow puppet performances. This Javanese version of the Mahābhārata differs slightly from the original Indian version. For example, Draupadi is only wed to Yudhishthira, not to all the Pandava brothers; this might demonstrate ancient Javanese opposition to polyandry. The author later added some female characters to be wed to the Pandavas, for example, Arjuna is described as having many wives and consorts next to Subhadra. Another difference is that Shikhandini does not change her sex and remains a woman, to be wed to Arjuna, and takes the role of a warrior princess during the war. Another twist is that Gandhari is described as antagonistic character who hates the Pandavas: her hate is out of jealousy because during Gandhari's swayamvara, she was in love with Pandu but was later wed to his blind elder brother instead, whom she did not love, so she blindfolded herself as protest. Another notable difference is the inclusion of the Punakawans, the clown servants of the main characters in the storyline. These characters include Semar, Petruk, Gareng and Bagong, who are much-loved by Indonesian audiences. There are also some spin-off episodes developed in ancient Java, such as Arjunawiwaha composed in 11th century.\n\nA Kawi version of the Mahabharata, of which eight of the eighteen parvas survive, is found on the Indonesian island of Bali. It has been translated into English by Dr. I. Gusti Putu Phalgunadi.\n\nTranslations\n\nA Persian translation of Mahabharta, titled Razmnameh, was produced at Akbar's orders, by  Faizi and `Abd al-Qadir Bada'uni in the 18th century.\n\nThe first complete English translation was the Victorian prose version by Kisari Mohan Ganguli,\nSeveral editions of the Kisari Mohan Ganguli translation of the Mahabharata incorrectly cite the publisher, Pratap Chandra Roy, as the translator and this error has been propagated into secondary citations. See the publishers preface to the current Munshiram Manoharlal edition for an explanation. published between 1883 and 1896 (Munshiram Manoharlal Publishers) and by M. N. Dutt (Motilal Banarsidass Publishers). Most critics consider the translation by Ganguli to be faithful to the original text. The complete text of Ganguli's translation is in the public domain and is available online.[http://www.sacred-texts.com/hin/maha/index.htm The Mahabharata of Krishna-Dwaipayana Vyasa translated by Kisari Mohan Ganguli] at the Internet Sacred Text Archive\n\nAnother English prose translation of the full epic, based on the Critical Edition, is in progress, published by University Of Chicago Press. It was initiated by Indologist J. A. B. van Buitenen (books 1–5) and, following a 20-year hiatus caused by the death of van Buitenen, is being continued by D. Gitomer of DePaul University (book 6), J. L. Fitzgerald  of Brown University (books 11–13) and Wendy Doniger of the University of Chicago (books 14–18).\n\nAn early poetry translation by Romesh Chunder Dutt and published in 1898 condenses the main themes of the Mahābhārata into English verse.[http://www.gutenberg.org/ebooks/19630 The Mahabharata of Krishna-Dwaipayana Vyasa translated by Romesh Chunder Dutt] at the Online Library of Liberty. A later poetic \"transcreation\" (author's own description) of the full epic into English, done by the poet P. Lal, is complete, and in 2005 began being published by Writers Workshop, Calcutta. The P. Lal translation is a non-rhyming verse-by-verse rendering, and is the only edition in any language to include all slokas in all recensions of the work (not just those in the Critical Edition). The completion of the publishing project is scheduled for 2010. Sixteen of the eighteen volumes are now available.\n\nA project to translate the full epic into English prose, translated by various hands, began to appear in 2005 from the Clay Sanskrit Library, published by New York University Press. The translation is based not on the Critical Edition but on the version known to the commentator Nīlakaṇṭha. Currently available are 15 volumes of the projected 32-volume edition.\n\nIndian economist Bibek Debroy has also begun an unabridged English translation in ten volumes. [http://www.penguinbooksindia.com/category/Non_Fiction/The_Mahabharata_9780143100133.aspx Volume 1: Adi Parva] was published in March 2010.\n\nMany condensed versions, abridgements and novelistic prose retellings of the complete epic have been published in English, including works by Ramesh Menon, William Buck, R. K. Narayan, C. Rajagopalachari, K. M. Munshi, Krishna Dharma, Romesh C. Dutt, Bharadvaja Sarma, John D. Smith and Sharon Maas.\n\nDerivative literature\n\nBhasa, the 2nd- or 3rd-century CE Sanskrit playwright, wrote two plays on episodes in the Marabharata, Urubhanga (Broken Thigh), about the fight between Duryodhana and Bhima, while Madhyamavyayoga (The Middle One) set around Bhima and his son, Ghatotkacha. The first important play of 20th century was Andha Yug (The Blind Epoch), by Dharamvir Bharati, which came in 1955, found in Mahabharat, both an ideal source and expression of modern predicaments and discontent. Starting with Ebrahim Alkazi it was staged by numerous directors. V. S. Khandekar's Marathi novel, Yayati (1960) and Girish Karnad's debut play Yayati (1961) are based on the story of King Yayati found in the Mahabharat. Bengali writer and playwright, Buddhadeva Bose wrote three plays set in Mahabharat, Anamni Angana, Pratham Partha and Kalsandhya.[http://www.boloji.com/hinduism/084.htm The Mahabharata as Theatre] by Pradip Bhattacharya, June 13, 2004. Pratibha Ray wrote an award winning novel entitled Yajnaseni from Draupadi's perspective in 1984. Later, Chitra Banerjee Divakaruni wrote a similar novel entitled The Palace of Illusions: A Novel in 2008. Gujarati poet Chinu Modi has written long narrative poetry Bahuk based on character Bahuka. Krishna Udayasankar, a Singapore-based Indian author has written several novels which are modern-day retellings of the epic, most notably the Aryavarta Chronicles Series. Suman Pokhrel wrote a solo play based on Ray's novel by personalizing and taking Draupadi alone in the scene.\n\nAmar Chitra Katha published a 1,260 page comic book version of the Mahabharata.\n\nIn film and television\n\nIn Indian cinema, several film versions of the epic have been made, dating back to 1920. (1920 film) In Telugu film Daana Veera Soora Karna (1977)  directed by and starring N. T. Rama Rao depicts Karna as the lead character. The Mahābhārata was also reinterpreted by Shyam Benegal in Kalyug. Prakash Jha directed 2010 film Raajneeti was partially inspired by the Mahabharata. A 2013 animated adaptation holds the record for India's most expensive animated film.\n\nIn the late 1980s, the Mahabharat TV series, directed by Ravi Chopra, (1988–1990 TV series) was televised on India's national television (Doordarshan). The same year as Mahabharat was being shown on Doordarshan, that same company's other television show, Bharat Ek Khoj, also directed by Shyam Benegal, showed a 2-episode abbreviation of the Mahabharata, drawing from various interpretations of the work, be they sung, danced, or staged. In the Western world, a well-known presentation of the epic is Peter Brook's nine-hour play, which premiered in Avignon in 1985, and its five-hour movie version The Mahābhārata (1989). (1989 mini-series)\n\nUncompleted projects on the Mahābhārata include a ones by Rajkumar Santoshi,  and a theaterical adaptation planned by Satyajit Ray.\n\nJain version\n\nJain versions of Mahābhārata can be found in the various Jain texts like Harivamsapurana (the story of Harivamsa) Trisastisalakapurusa Caritra (Hagiography of 63 Illustrious persons),   Pandavacaritra (lives of Pandavas) and Pandavapurana (stories of Pandavas). p. 351-52 From the earlier canonical literature, Antakrddaaśāh (8th cannon) and Vrisnidasa (upangagama or secondary canon) contain the stories of Neminatha (22nd Tirthankara), Krishna and Balarama.  vol 1 pp. 14–15 Prof. Padmanabh Jaini notes that, unlike in the Hindu Puranas, the names Baladeva and Vasudeva are not restricted to Balarama and Krishna in Jain puranas. Instead they serve as names of two distinct class of mighty brothers, who appear nine times in each half of  time cycles of the Jain cosmology and rule the half the earth as half-chakravartins. Jaini traces the origin of this list of brothers to the Jinacharitra by Bhadrabahu swami (4th–3rd century BCE). p. 377  According to Jain cosmology Balarama, Krishna and Jarasandha are the ninth and the last set of Baladeva, Vasudeva, and Partivasudeva. p.305 The main battle is not the Mahabharata, but the fight between Krishna and Jarasandha (who is killed by Krishna). Ultimately, the Pandavas and Balarama take renunciation as Jain monks and are reborn in heavens, while on the other hand Krishna and Jarasandha are reborn in hell. p. 351 In keeping with the law of karma, Krishna is reborn in hell for his exploits (sexual and violent) while Jarasandha for his evil ways. Prof. Jaini admits a possibility that perhaps because of his popularity, the Jain authors were keen to rehabilitate Krishna. The Jain texts predict that after his karmic term in hell is over sometime during the next half time-cycle, Krishna will be reborn as a Jain Tirthankara and attain liberation. Krishna and Balrama are shown as contemporaries and cousins of 22nd Tirthankara, Neminatha. According to this story, Krishna arranged young Neminath’s marriage with Rajamati, the daughter of Ugrasena, but Neminatha, empathizing with the animals which were to be slaughtered for the marriage feast, left the procession suddenly and renounced the world. refer story of Neminatha\n\nKuru family tree\n\nThis shows the line of royal and family succession, not necessarily the parentage. See the notes below for detail.\n\nKey to Symbols\n* Male:  blue border\n* Female:  red border \n* Pandavas:  green box \n* Kauravas:  yellow box \n\nNotes\n* a: Shantanu was a king of the Kuru dynasty or kingdom, and was some generations removed from any ancestor called Kuru. His marriage to Ganga preceded his marriage to Satyavati.\n* b: Pandu and Dhritarashtra were fathered by Vyasa in the niyoga tradition after Vichitravirya's death. Dhritarashtra, Pandu and Vidura were the sons of Vyasa with Ambika, Ambalika and a maid servant respectively.\n* c: Karna was born to Kunti through her invocation of Surya, before her marriage to Pandu.\n* d: Yudhishthira, Bhima, Arjuna, Nakula and Sahadeva were acknowledged sons of Pandu but were begotten by the invocation by Kunti and Madri of various deities. They all married Draupadi (not shown in tree).\n* e: Duryodhana and his siblings were born at the same time, and they were of the same generation as their Pandava cousins.\n* f : Although the succession after the Pandavas was through the descendants of Arjuna and Subhadra, it was Yudhishthira and Draupadi who occupied the throne of Hastinapura after the great battle.\n\nThe birth order of siblings is correctly shown in the family tree (from left to right), except for Vyasa and Bhishma whose birth order is not described, and Vichitravirya and Chitrangada who were born after them. The fact that Ambika and Ambalika are sisters is not shown in the family tree. The birth of Duryodhana took place after the birth of Karna, Yudhishthira and Bhima, but before the birth of the remaining Pandava brothers.\n\nSome siblings of the characters shown here have been left out for clarity; these include Chitrāngada, the eldest brother of Vichitravirya. Vidura, half-brother to Dhritarashtra and Pandu.\n\nCultural influence\n\nIn the Bhagavad Gita, Krishna explains to Arjuna his duties as a warrior and prince and elaborates on different Yogic and Vedantic philosophies, with examples and analogies. This has led to the Gita often being described as a concise guide to Hindu philosophy and a practical, self-contained guide to life.Maharishi Mahesh Yogi; On The Bhagavad Gita; A New Translation and Commentary With Sanskrit Text Chapters 1 to 6, Preface p.9 In more modern times, Swami Vivekananda, Bal Gangadhar Tilak, Mahatma Gandhi and many others used the text to help inspire the Indian independence movement.Stevenson, Robert W., \"Tilak and the Bhagavadgita's Doctrine of Karmayoga\", in: Minor, p. 44.Jordens, J. T. F., \"Gandhi and the Bhagavadgita\", in: Minor, p. 88.\n\nVarious modern day television shows and novels have taken inspiration from the Mahabharata.\n\nEditions\n\n* The Mahabharata: Complete and Unabridged (set of 10 volumes) by Bibek Debroy, Penguin Books India.\n* The Mahābhārata of Vyasa (18 volumes), transcreated from Sanskrit by P. Lal, Writers Workshop.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Mahabharata" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19643" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Mahābhārata (, ',) is one of the two major Sanskrit epics of ancient India, the other being the Rāmāyaṇa.\n\nThe Mahābhārata is an epic narrative of the Kurukṣetra War and the fates of the Kaurava and the Pāṇḍava princes. It also contains philosophical and devotional material, such as  a discussion of the four \"goals of life\" or puruṣārtha (12.161). Among the principal works and stories in the Mahābhārata are the Bhagavad Gita, the story of Damayanti, an abbreviated version of the Rāmāyaṇa, and the story of Ṛṣyasringa, often considered as works in their own right.\n\nTraditionally, the authorship of the Mahābhārata is attributed to Vyāsa. There have been many attempts to unravel its historical growth and compositional layers. The oldest preserved parts of the text are thought to be not much older than around 400 BCE, though the origins of the epic probably fall between the 8th and 9th centuries BCE.Brockington (1998, p. 26) The text probably reached its final form by the early Gupta period (c. 4th century CE).Van Buitenen; The Mahabharata – 1; The Book of the Beginning. Introduction (Authorship and Date) The title may be translated as \"the great tale of the Bhārata dynasty\". According to the Mahābhārata itself, the tale is extended from a shorter version of 24,000 verses called simply Bhārata.bhārata means the progeny of Bharata, the  legendary king who is claimed to have founded the Bhāratavarsha kingdom.\n\nThe Mahābhārata is the longest epic poem known and has been described as \"the longest poem ever written\".  Its longest version consists of over 100,000 śloka or over 200,000 individual verse lines (each shloka is a couplet), and long prose passages. At about 1.8 million words in total, the Mahābhārata is roughly ten times the length of the Iliad and the Odyssey combined, or about four times the length of the Rāmāyaṇa.Spodek, Howard. Richard Mason. The World's History. Pearson Education: 2006, New Jersey. 224, 0-13-177318-6Amartya Sen, The Argumentative Indian. Writings on Indian Culture, History and Identity, London: Penguin Books, 2005. W. J. Johnson has compared the importance of the Mahābhārata in the context of world civilization to that of the Bible, the works of William Shakespeare, the works of Homer, Greek drama, or the Quran. Within the Indian tradition it is sometimes called the Fifth Veda.\n\nTextual history and structure\n\nThe epic is traditionally ascribed to the sage Vyāsa, who is also a major character in the epic. Vyāsa described it as being itihāsa (history). He also describes the Guru-shishya parampara, which traces all great teachers and their students of the Vedic times.\n\nThe first section of the Mahābhārata states that it was Gaṇeśa who wrote down the text to Vyasa's dictation.\n\nThe epic employs the story within a story structure, otherwise known as frametales, popular in many Indian religious and non-religious works. It is first recited at Takshashila by the sage Vaiśampāyana, a disciple of Vyāsa, to the King Janamejaya who is the great-grandson of the Pāṇḍava prince Arjuna. The story is then recited again by a professional storyteller named Ugraśrava Sauti, many years later, to an assemblage of sages performing the 12-year sacrifice for the king Saunaka Kulapati in the Naimiśa Forest.\n\nThe text was described by some early 20th-century western Indologists as unstructured and chaotic. Hermann Oldenberg supposed that the original poem must once have carried an immense \"tragic force\" but dismissed the full text as a \"horrible chaos.\"Hermann Oldenberg, Das Mahabharata: seine Entstehung, sein Inhalt, seine Form, Göttingen, 1922,  Moritz Winternitz (Geschichte der indischen Literatur 1909) considered that \"only unpoetical theologists and clumsy scribes\" could have lumped the parts of disparate origin into an unordered whole.[http://www.harekrsna.com/sun/features/07-06/features360.htm \"The Mahabharata\"] at The Sampradaya Sun \n\nAccretion and redaction\n\nResearch on the Mahābhārata has put an enormous effort into recognizing and dating layers within the text. Some elements of the present Mahābhārata can be traced back to Vedic times.[https://books.google.com/books?idFYPOVdzZ2UIC&pg\nPA452&dqa+history+of+indian+literature+mahabharata+date&hl\nen&eiLebbTIesJIOycOuWycMG&sa\nX&oibook_result&ct\nbook-thumbnail&resnum1&ved\n0CDgQ6wEwAA#vonepage&q\na%20history%20of%20indian%20literature%20mahabharata%20date&ffalse A History of Indian Literature], Volume 1 by Maurice Winternitz The background to the Mahābhārata suggests the origin of the epic occurs \"after the very early Vedic period\" and before \"the first Indian 'empire' was to rise in the third century B.C.\" That this is \"a date not too far removed from the 8th or 9th century B.C.\"Buitenen (1973) pp. xxiv–xxv is likely. Mahābhārata started as an orally-transmitted tale of the charioteer bards. It is generally agreed that \"Unlike the Vedas, which have to be preserved letter-perfect, the epic was a popular work whose reciters would inevitably conform to changes in language and style,\" so the earliest 'surviving' components of this dynamic text are believed to be no older than the earliest 'external' references we have to the epic, which may include an allusion in Panini's 4th century BCE grammar Aṣṭādhyāyī 4:2:56. It is estimated that the Sanskrit text probably reached something of a \"final form\" by the early Gupta period (about the 4th century CE). Vishnu Sukthankar, editor of the first great critical edition of the Mahābhārata, commented: \"It is useless to think of reconstructing a fluid text in a literally original shape, on the basis of an archetype and a stemma codicum. What then is possible? Our objective can only be to reconstruct the oldest form of the text which it is possible to reach on the basis of the manuscript material available.\"Sukthankar (1933) \"Prolegomena\" p. lxxxvi. Emphasis is original. That manuscript evidence is somewhat late, given its material composition and the climate of India, but it is very extensive.\n\nThe Mahābhārata itself (1.1.61) distinguishes a core portion of 24,000 verses: the Bhārata proper, as opposed to additional secondary material, while the Aśvalāyana Gṛhyasūtra (3.4.4) makes a similar distinction. At least three redactions of the text are commonly recognized: Jaya (Victory) with 8,800 verses attributed to Vyāsa, Bhārata with 24,000 verses as recited by Vaiśampāyana, and finally the Mahābhārata as recited by Ugraśrava Sauti with over 100,000 verses.Gupta & Ramachandran (1976), citing Mahabharata, Critical Edition, I, 56, 33SP Gupta and KS Ramachandran (1976), p.3-4, citing Vaidya (1967), p.11 However, some scholars, such as John Brockington, argue that Jaya and Bharata refer to the same text, and ascribe the theory of Jaya with 8,800 verses to a misreading of a verse in Ādiparvan (1.1.81).\nThe redaction of this large body of text was carried out after formal principles, emphasizing the numbers 1818 books, 18 chapters of the Bhagavadgita and the Narayaniya each, corresponding to the 18 days of the battle and the 18 armies (Mbh. 5.152.23) and 12. The addition of the latest parts may be dated by the absence of the Anuśāsana-parva and the Virāta parva from the \"Spitzer manuscript\".The Spitzer Manuscript (Beitrage zur Kultur- und Geistesgeschichte Asiens), Austrian Academy of Sciences, 2004. It is one of the oldest Sanskrit manuscripts found on the Silk Road and part of the estate of Dr. Moritz Spitzer. The oldest surviving Sanskrit text dates to the Kushan Period (200 CE).[https://www.jstor.org/pss/596517 The Oldest Extant Parvan-List of the Mahābhārata], Dieter Schlingloff, Journal of the American Oriental Society, Vol. 89, No. 2, April–June  1969, pp. 334–338, at JSTOR\n\nAccording to what one character says at Mbh. 1.1.50, there were three versions of the epic, beginning with Manu (1.1.27), Astika (1.3, sub-parva 5) or Vasu (1.57), respectively. These versions would correspond to the addition of one and then another 'frame' settings of dialogues. The Vasu version would omit the frame settings and begin with the account of the birth of Vyasa. The astika version would add the sarpasattra and aśvamedha material from Brahmanical literature, introduce the name Mahābhārata, and identify Vyāsa as the work's author. The redactors of these additions were probably Pāñcarātrin scholars who according to Oberlies (1998) likely retained control over the text until its final redaction. Mention of the Huna in the Bhīṣma-parva however appears to imply that this parva may have been edited around the 4th century.\n\nThe Ādi-parva includes the snake sacrifice (sarpasattra) of Janamejaya, explaining its motivation, detailing why all snakes in existence were intended to be destroyed, and why in spite of this, there are still snakes in existence. This sarpasattra material was often considered an independent tale added to a version of the Mahābhārata by \"thematic attraction\" (Minkowski 1991), and considered to have a particularly close connection to Vedic (Brahmana) literature. The Pañcavimśa Brahmana (at 25.15.3) enumerates the officiant priests of a sarpasattra among whom the names Dhṛtarāṣtra and Janamejaya, two main characters of the Mahābhāratas sarpasattra, as well as Takṣaka, the name of a snake in the Mahābhārata, occur.J.A.B. van Buitenen, Mahābhārata, Volume 1, p.445, citing W. Caland, The Pañcaviṃśa Brāhmaṇa, p.640-2\n\nHistorical references\n\nThe earliest known references to the Mahābhārata and its core Bhārata date to the Aṣṭādhyāyī (sutra 6.2.38) of Pāṇini (fl. 4th century BCE) and in the Aśvalāyana Gṛhyasūtra (3.4.4). This may mean the core 24,000 verses, known as the Bhārata, as well as an early version of the extended Mahābhārata, were composed by the 4th century BCE.  A report by the Greek writer Dio Chrysostom (c. 40 - c. 120 CE) about Homer's poetry being sung even in IndiaDio Chrysostom, 53.[http://penelope.uchicago.edu/Thayer/E/Roman/Texts/Dio_Chrysostom/Discourses/53*.html#6 6]-7, trans. H. Lamar Crosby, Loeb Classical Library, 1946, vol. 4, p. 363. seems to imply that the Iliad had been translated into Sanskrit. However, Indian scholars have, in general, taken this as evidence for the existence of a Mahābhārata at this date, whose episodes Dio or his sources identify with the story of the Iliad.Christian Lassen, in his Indische Alterthumskunde, supposed that the reference is ultimately to Dhritarashtra's sorrows, the laments of Gandhari and Draupadi, and the valor of Arjuna and Suyodhana or Karna (cited approvingly in Max Duncker, The History of Antiquity (trans. Evelyn Abbott, London 1880), vol. 4, [https://books.google.com/books?idgIkBAAAAQAAJ&pg\nPA81 p. 81]). This interpretation is endorsed in such standard references as Albrecht Weber's History of Indian Literature but has sometimes been repeated as fact instead of as interpretation.\n\nSeveral stories within the Mahābhārata took on separate identities of their own in Classical Sanskrit literature. For instance, Abhijñānaśākuntala by the renowned Sanskrit poet Kālidāsa (c. 400 CE), believed to have lived in the era of the Gupta dynasty, is based on a story that is the precursor to the Mahābhārata. Urubhaṅga, a Sanskrit play written by Bhāsa who is believed to have lived before Kālidāsa, is based on the slaying of Duryodhana by the splitting of his thighs by Bhīma.\n\nThe copper-plate inscription of the Maharaja Sharvanatha (533–534 CE) from Khoh (Satna District, Madhya Pradesh) describes the Mahābhārata as a \"collection of 100,000 verses\" (śata-sahasri saṃhitā).\n\nThe 18 parvas or books\n\nThe division into 18 parvas is as follows:\n\nHistorical context\n\nThe historicity of the Kurukshetra War is unclear. Many historians  estimate the date of the Kurukshetra war to Iron Age India of the 10th century BCE.In discussing the dating question, historian A. L. Basham says: \"According to the most popular later tradition the Mahabharata War took place in 3102 BCE, which in the light of all evidence, is quite impossible. More reasonable is another tradition, placing it in the 15th century BCE, but this is also several centuries too early in the light of our archaeological knowledge. Probably the war took place around the beginning of the 9th century BCE; such a date seems to fit well with the scanty archaeological remains of the period, and there is some evidence in the Brahmana literature itself to show that it cannot have been much earlier.\" Basham, p. 40, citing HC Raychaudhuri, Political History of Ancient India, pp.27ff. The setting of the epic has a historical precedent in Iron Age (Vedic) India, where the Kuru kingdom was the center of political power during roughly 1200 to 800 BCE.M Witzel, Early Sanskritization: Origin and Development of the Kuru state, EJVS vol.1 no.4 (1995); also in B. Kölver (ed.), Recht, Staat und Verwaltung im klassischen Indien. The state, the Law, and Administration in Classical India, München, R. Oldenbourg, 1997, p.27-52  A dynastic conflict of the period could have been the inspiration for the Jaya, the foundation on which the Mahābhārata corpus was built, with a climactic battle eventually coming to be viewed as an epochal event.\n\nPuranic literature presents genealogical lists associated with the Mahābhārata narrative. The evidence of the Puranas is of two kinds. Of the first kind, there is the direct statement that there were 1015 (or 1050) years between the birth of Parikshit (Arjuna's grandson) and the accession of Mahapadma Nanda (400-329 BCE), which would yield an estimate of about 1400 BCE for the Bharata battle.A.D. Pusalker, History and Culture of the Indian People, Vol I, Chapter XIV, p.273  However, this would imply improbably long reigns on average for the kings listed in the genealogies.FE Pargiter, Ancient Indian Historical Tradition, p.180. He shows estimates of the average as 47, 50, 31 and 35 for various versions of the lists.\nOf the second kind are analyses of parallel genealogies in the Puranas between the times of Adhisimakrishna (Parikshit's great-grandson) and Mahapadma Nanda. Pargiter accordingly estimated 26 generations by averaging 10 different dynastic lists and, assuming 18 years for the average duration of a reign, arrived at an estimate of 850 BCE for Adhisimakrishna, and thus approximately 950 BCE for the Bharata battle.Pargiter, op.cit. p.180-182\n\nB. B. Lal used the same approach with a more conservative assumption of the average reign to estimate a date of 836 BCE, and correlated this with archaeological evidence from Painted Grey Ware (PGW) sites, the association being strong between PGW artifacts and places mentioned in the epic.B. B. Lal, Mahabharata and Archaeology in Gupta and Ramachandran (1976), p.57-58 John Keay confirm this and also gives 950 BCE for the Bharata battle.\n\nAttempts to date the events using methods of archaeoastronomy have produced, depending on which passages are chosen  and how they are interpreted, estimates ranging from the late 4th to the mid-2nd millennium BCE.Gupta and Ramachandran (1976), p.246, who summarize as follows: \"Astronomical calculations favor 15th century BCE as the date of the war while the Puranic data place it in the 10th/9th century BCE. Archaeological evidence points towards the latter.\" (p.254) The late 4th millennium date has a precedent in the calculation of the Kaliyuga epoch, based on planetary conjunctions, by Aryabhata (6th century). Aryabhata's date of February 18 3102 BCE for Mahābhārata war has become widespread in Indian tradition. Some sources mark this as the disappearance of Krishna from earth. The Aihole inscription of Pulikeshi II, dated to Saka 556 = 634 CE, claims that 3735 years have elapsed since the Bharata battle, putting the date of Mahābhārata war at 3137 BCE.Gupta and Ramachandran (1976), p.55; AD Pusalker, HCIP, Vol I, p.272\nAnother traditional school of astronomers and historians, represented by Vriddha-Garga, Varahamihira (author of the Brhatsamhita) and Kalhana (author of the Rajatarangini), place the Bharata war 653 years after the Kaliyuga epoch, corresponding to 2449 BCE.AD Pusalker, op.cit. p.272\n\nSynopsis\n\nThe core story of the work is that of a dynastic struggle for the throne of Hastinapura, the kingdom ruled by the Kuru clan. The two collateral branches of the family that participate in the struggle are the Kaurava and the Pandava. Although the Kaurava is the senior branch of the family, Duryodhana, the eldest Kaurava, is younger than Yudhishthira, the eldest Pandava. Both Duryodhana and Yudhishthira claim to be first in line to inherit the throne.\n\nThe struggle culminates in the great battle of Kurukshetra, in which the Pandavas are ultimately victorious. The battle produces complex conflicts of kinship and friendship, instances of family loyalty and duty taking precedence over what is right, as well as the converse.\n\nThe Mahābhārata itself ends with the death of Krishna, and the subsequent end of his dynasty and ascent of the Pandava brothers to heaven. It also marks the beginning of the Hindu age of Kali Yuga, the fourth and final age of humankind, in which great values and noble ideas have crumbled, and people are heading towards the complete dissolution of right action, morality and virtue.\n\nThe older generations\n\nKing Janamejaya's ancestor Shantanu, the king of Hastinapura, has a short-lived marriage with the goddess Ganga and has a son, Devavrata (later to be called Bhishma, a great warrior), who becomes the heir apparent. Many years later, when King Shantanu goes hunting, he sees Satyavati, the daughter of the chief of fisherman, and asks her father for her hand. Her father refuses to consent to the marriage unless Shantanu promises to make any future son of Satyavati the king upon his death. To resolve his father's dilemma, Devavrata agrees to relinquish his right to the throne. As the fisherman is not sure about the prince's children honouring the promise, Devavrata also takes a vow of lifelong celibacy to guarantee his father's promise.\n\nShantanu has two sons by Satyavati, Chitrāngada and Vichitravirya. Upon Shantanu's death, Chitrangada becomes king. He lives a very short uneventful life and dies. Vichitravirya, the younger son, rules Hastinapura. Meanwhile, the King of Kāśī arranges a swayamvara for his three daughters, neglecting to invite the royal family of Hastinapur. In order to arrange the marriage of young Vichitravirya, Bhishma attends the swayamvara of the three princesses Amba, Ambika and Ambalika, uninvited, and proceeds to abduct them. Ambika and Ambalika consent to be married to Vichitravirya.\n\nThe oldest princess Amba, however, informs Bhishma that she wishes to marry king of Shalva whom Bhishma defeated at their swayamvara. Bhishma lets her leave to marry king of Shalva, but Shalva refuses to marry her, still smarting at his humiliation at the hands of Bhishma. Amba then returns to marry Bhishma but he refuses due to his vow of celibacy. Amba becomes enraged and becomes Bhishma's bitter enemy, holding him responsible for her plight. Later she is reborn to King Drupada as Shikhandi (or Shikhandini) and causes Bhishma's fall, with the help of Arjuna, in the battle of Kurukshetra.\n\nThe Pandava and Kaurava princes\n\nWhen Vichitravirya dies young without any heirs, Satyavati asks her first son Vyasa to father children with the widows. The eldest, Ambika, shuts her eyes when she sees him, and so her son Dhritarashtra is born blind. Ambalika turns pale and bloodless upon seeing him, and thus her son Pandu is born pale and unhealthy (the term Pandu may also mean 'jaundiced'). Due to the physical challenges of the first two children, Satyavati asks Vyasa to try once again. However, Ambika and Ambalika send their maid instead, to Vyasa's room. Vyasa fathers a third son, Vidura, by the maid. He is born healthy and grows up to be one of the wisest characters in the Mahabharata. He serves as Prime Minister (Mahamantri or Mahatma) to King Pandu and King Dhritarashtra.\n\nWhen the princes grow up, Dhritarashtra is about to be crowned king by Bhishma when Vidura intervenes and uses his knowledge of politics to assert that a blind person cannot be king. This is because a blind man cannot control and protect his subjects. The throne is then given to Pandu because of Dhritarashtra's blindness. Pandu marries twice, to Kunti and Madri. Dhritarashtra  marries Gandhari, a princess from Gandhara, who blindfolds herself so that she may feel the pain that her husband feels. Her brother Shakuni is enraged by this and vows to take revenge on the Kuru family. One day, when Pandu is relaxing in the forest, he hears the sound of a wild animal. He shoots an arrow in the direction of the sound. However the arrow hits the sage Kindama, who curses him that if he engages in a sexual act, he will die. Pandu then retires to the forest along with his two wives, and his brother Dhritarashtra rules thereafter, despite his blindness.\n\nPandu's older queen Kunti, however, had been given a boon by Sage Durvasa that she could invoke any god using a special mantra. Kunti uses this boon to ask Dharma the god of justice, Vayu the god of the wind, and Indra the lord of the heavens for sons. She gives birth to three sons, Yudhishthira, Bhima, and Arjuna, through these gods. Kunti shares her mantra with the younger queen Madri, who  bears the twins Nakula and Sahadeva through the Ashwini twins. However, Pandu and Madri indulge in sex, and Pandu dies. Madri dies on his funeral pyre out of remorse. Kunti raises the five brothers, who are from then on usually referred to as the Pandava brothers.\n\nDhritarashtra has a hundred sons through Gandhari, all born after the birth of Yudhishthira. These are the Kaurava brothers, the eldest being Duryodhana, and the second Dushasana. Other Kaurava brothers were Vikarna and Sukarna. The rivalry and enmity between them and the Pandava brothers, from their youth and into manhood, leads to the Kurukshetra war.\n\nLakshagraha (the house of lac)\n\nAfter the deaths of their mother (Madri) and father (Pandu), the Pandavas and their mother Kunti return to the palace of Hastinapur. Yudhishthira is made Crown Prince by Dhritarashtra, under considerable pressure from his kingdom. Dhritarashtra wanted his own son Duryodhana to become king and lets his ambition get in the way of preserving justice.\n\nShakuni, Duryodhana and Dusasana plot to get rid of the Pandavas. Shakuni calls the architect Purochana to build a palace out of flammable materials like lac and ghee. He then arranges for the Pandavas and the Queen Mother Kunti to stay there, with the intention of setting it alight. However, the Pandavas are warned by their wise uncle, Vidura, who sends them a miner to dig a tunnel. They are able to escape to safety and go into hiding. Back at Hastinapur, the Pandavas and Kunti are presumed dead.\n\nMarriage to Draupadi\n\nWhilst they were in hiding the Pandavas learn of a swayamvara which is taking place for the hand of the Pāñcāla princess  Draupadī. The Pandavas enter the competition in disguise as Brahmins. The task is to string a mighty steel bow and shoot a target on the ceiling, which is the eye of a moving artificial fish, while looking at its reflection in oil below. Most of the princes fail, many being unable to lift the bow. Arjuna succeeds however. The Pandavas return home and inform their mother that Arjuna has won a competition and to look at what they have brought back. Without looking, Kunti asks them to share whatever it is Arjuna has won among themselves. On explaining the previous life of Draupadi, she ends up being the wife of all five brothers.\n\nIndraprastha\n\nAfter the wedding, the Pandava brothers are invited back to Hastinapura. The Kuru family elders and relatives negotiate and broker a split of the kingdom, with the Pandavas obtaining a new territory. Yudhishthira has a new capital built for this territory at Indraprastha. Neither the Pandava nor Kaurava sides are happy with the arrangement however.\n\nShortly after this, Arjuna elopes with and then marries Krishna's sister, Subhadra. Yudhisthra wishes to establish his position as king; he seeks Krishna's advice. Krishna advises him, and after due preparation and the elimination of some opposition, Yudhishthira carries out the rājasūya yagna ceremony; he is thus recognised as pre-eminent among kings.\n\nThe Pandavas have a new palace built for them, by Maya the Danava. They invite their Kaurava cousins to Indraprastha. Duryodhana walks round the palace, and mistakes a glossy floor for water, and will not step in. After being told of his error, he then sees a pond, and assumes it is not water and falls in. Bhima, Arjun, the twins and the servants laugh at him. In popular adaptations, this insult is wrongly attributed to Draupadi, even though in the Sanskrit epic, it was the Pandavas (except Yudhisthira) who had insulted Duryodhana. Enraged by the insult, and jealous at seeing the wealth of the Pandavas, Duryodhana decides to host a dice-game at Shakuni's suggestion.\n\nThe dice game\n\nShakuni, Duryodhana's uncle, now arranges a dice game, playing against Yudhishthira with loaded dice. Yudhishthira loses all his wealth, then his kingdom. He then even gambles his brothers, himself, and finally his wife into servitude. The jubilant Kauravas insult the Pandavas in their helpless state and even try to disrobe Draupadi in front of the entire court, but her honour is saved by Krishna who miraculously creates lengths of cloth to replace the ones being removed.\n\nDhritarashtra, Bhishma, and the other elders are aghast at the situation, but Duryodhana is adamant that there is no place for two crown princes in Hastinapura. Against his wishes Dhritarashtra orders for another dice game. The Pandavas are required to go into exile for 12 years, and in the 13th year must remain hidden. If discovered by the Kauravas, they will be forced into exile for another 12 years.\n\nExile and return\n\nThe Pandavas spend thirteen years in exile; many adventures occur during this time. They also prepare alliances for a possible future conflict. They spend their final year in disguise in the court of Virata, and are discovered just after the end of the year.\n\nAt the end of their exile, they try to negotiate a return to Indraprastha. However, this fails, as Duryodhana objects that they were discovered while in hiding, and that no return of their kingdom was agreed. War becomes inevitable.\n\nThe battle at Kurukshetra\n\nThe two sides summon vast armies to their help and line up at Kurukshetra for a war. The kingdoms of Panchala, Dwaraka, Kasi, Kekaya, Magadha, Matsya, Chedi, Pandyas, Telinga, and the Yadus of Mathura and some other clans like the Parama Kambojas were allied with the Pandavas. The allies of the Kauravas included the kings of Pragjyotisha, Anga, Kekaya, Sindhudesa (including Sindhus, Sauviras and Sivis), Mahishmati, Avanti in Madhyadesa, Madra, Gandhara, Bahlika people, Kambojas and many others. Before war being declared, Balarama had expressed his unhappiness at the developing conflict and left to go on pilgrimage; thus he does not take part in the battle itself. Krishna takes part in a non-combatant role, as charioteer for Arjuna.\n\nBefore the battle, Arjuna, seeing the opposing army includes many relatives and loved ones, including his great grandfather Bhishma and his teacher Drona, has doubts about the battle and he fails to lift his Gāndeeva bow. Krishna wakes him up to his call of duty in the famous Bhagavad Gita section of the epic.\n\nThough initially sticking to chivalrous notions of warfare, both sides soon adopt dishonourable tactics. At the end of the 18-day battle, only the Pandavas, Satyaki, Kripa, Ashwatthama, Kritavarma, Yuyutsu and Krishna survive.\n\nThe end of the Pandavas\n\nAfter \"seeing\" the carnage, Gandhari, who had lost all her sons, curses Krishna to be a witness to a similar annihilation of his family, for though divine and capable of stopping the war, he had not done so. Krishna accepts the curse, which bears fruit 36 years later.\n\nThe Pandavas, who had ruled their kingdom meanwhile, decide to renounce everything. Clad in skins and rags they retire to the Himalaya and climb towards heaven in their bodily form. A stray dog travels with them. One by one the brothers and Draupadi fall on their way. As each one stumbles, Yudhishthira gives the rest the reason for their fall (Draupadi was partial to Arjuna, Nakula and Sahadeva were vain and proud of their looks, and Bhima and Arjuna were proud of their strength and archery skills, respectively). Only the virtuous Yudhishthira, who had tried everything to prevent the carnage, and the dog remain. The dog reveals himself to be the god Yama (also known as Yama Dharmaraja), and then takes him to the underworld where he sees his siblings and wife. After explaining the nature of the test, Yama takes Yudhishthira back to heaven and explains that it was necessary to expose him to the underworld because (Rajyante narakam dhruvam) any ruler has to visit the underworld at least once. Yama then assures him that his siblings and wife would join him in heaven after they had been exposed to the underworld for measures of time according to their vices.\n\nArjuna's grandson Parikshit rules after them and dies bitten by a snake. His furious son, Janamejaya, decides to perform a snake sacrifice (sarpasattra) in order to destroy the snakes. It is at this sacrifice that the tale of his ancestors is narrated to him.\n\nThe reunion\n\nThe Mahābhārata mentions that Karna, the Pandavas, Draupadi and Dhritarashtra's sons eventually ascended to svarga and \"attained the state of the gods\" and banded together — \"serene and free from anger.\"\n\nThemes\n\nJust war\n\nThe Mahābhārata offers one of the first instances of theorizing about dharmayuddha, \"just war\", illustrating many of the standards that would be debated later across the world. In the story, one of five brothers asks if the suffering caused by war can ever be justified. A long discussion ensues between the siblings, establishing criteria like proportionality (chariots cannot attack cavalry, only other chariots; no attacking people in distress), just means (no poisoned or barbed arrows), just cause (no attacking out of rage), and fair treatment of captives and the wounded.\n\nVersions, translations, and derivative works\n\nCritical Edition\n\nBetween 1919 and 1966, scholars at the Bhandarkar Oriental Research Institute, Pune, compared the various manuscripts of the epic from India and abroad and produced the Critical Edition of the Mahabharata, on 13,000 pages in 19 volumes, followed by the Harivamsha in another two volumes and six index volumes. This is the text that is usually used in current Mahābhārata studies for reference.[http://www.virtualpune.com/html/channel/edu/institutes/html/bhandark.shtml Bhandarkar Institute, Pune]—Virtual Pune This work is sometimes called the \"Pune\" or \"Poona\" edition of the Mahabharata.\n\nRegional versions\n\nMany regional versions of the work developed over time, mostly differing only in minor details, or with verses or subsidiary stories being added. These include the Tamil street theatre, terukkuttu and kattaikkuttu, the plays of which use themes from the Tamil language versions of Mahabharata, focusing on Draupadi.\n\nOutside the Indian subcontinent, in Indonesia, a version was developed in ancient Java as Kakawin Bhāratayuddha in the 11th century under the patronage of King Dharmawangsa (990–1016) and later it spread to the neighboring island of Bali, which remains a Hindu majority island today. It has become the fertile source for Javanese literature, dance drama (wayang wong), and wayang shadow puppet performances. This Javanese version of the Mahābhārata differs slightly from the original Indian version. For example, Draupadi is only wed to Yudhishthira, not to all the Pandava brothers; this might demonstrate ancient Javanese opposition to polyandry. The author later added some female characters to be wed to the Pandavas, for example, Arjuna is described as having many wives and consorts next to Subhadra. Another difference is that Shikhandini does not change her sex and remains a woman, to be wed to Arjuna, and takes the role of a warrior princess during the war. Another twist is that Gandhari is described as antagonistic character who hates the Pandavas: her hate is out of jealousy because during Gandhari's swayamvara, she was in love with Pandu but was later wed to his blind elder brother instead, whom she did not love, so she blindfolded herself as protest. Another notable difference is the inclusion of the Punakawans, the clown servants of the main characters in the storyline. These characters include Semar, Petruk, Gareng and Bagong, who are much-loved by Indonesian audiences. There are also some spin-off episodes developed in ancient Java, such as Arjunawiwaha composed in 11th century.\n\nA Kawi version of the Mahabharata, of which eight of the eighteen parvas survive, is found on the Indonesian island of Bali. It has been translated into English by Dr. I. Gusti Putu Phalgunadi.\n\nTranslations\n\nA Persian translation of Mahabharta, titled Razmnameh, was produced at Akbar's orders, by  Faizi and `Abd al-Qadir Bada'uni in the 18th century.\n\nThe first complete English translation was the Victorian prose version by Kisari Mohan Ganguli,\nSeveral editions of the Kisari Mohan Ganguli translation of the Mahabharata incorrectly cite the publisher, Pratap Chandra Roy, as the translator and this error has been propagated into secondary citations. See the publishers preface to the current Munshiram Manoharlal edition for an explanation. published between 1883 and 1896 (Munshiram Manoharlal Publishers) and by M. N. Dutt (Motilal Banarsidass Publishers). Most critics consider the translation by Ganguli to be faithful to the original text. The complete text of Ganguli's translation is in the public domain and is available online.[http://www.sacred-texts.com/hin/maha/index.htm The Mahabharata of Krishna-Dwaipayana Vyasa translated by Kisari Mohan Ganguli] at the Internet Sacred Text Archive\n\nAnother English prose translation of the full epic, based on the Critical Edition, is in progress, published by University Of Chicago Press. It was initiated by Indologist J. A. B. van Buitenen (books 1–5) and, following a 20-year hiatus caused by the death of van Buitenen, is being continued by D. Gitomer of DePaul University (book 6), J. L. Fitzgerald  of Brown University (books 11–13) and Wendy Doniger of the University of Chicago (books 14–18).\n\nAn early poetry translation by Romesh Chunder Dutt and published in 1898 condenses the main themes of the Mahābhārata into English verse.[http://www.gutenberg.org/ebooks/19630 The Mahabharata of Krishna-Dwaipayana Vyasa translated by Romesh Chunder Dutt] at the Online Library of Liberty. A later poetic \"transcreation\" (author's own description) of the full epic into English, done by the poet P. Lal, is complete, and in 2005 began being published by Writers Workshop, Calcutta. The P. Lal translation is a non-rhyming verse-by-verse rendering, and is the only edition in any language to include all slokas in all recensions of the work (not just those in the Critical Edition). The completion of the publishing project is scheduled for 2010. Sixteen of the eighteen volumes are now available.\n\nA project to translate the full epic into English prose, translated by various hands, began to appear in 2005 from the Clay Sanskrit Library, published by New York University Press. The translation is based not on the Critical Edition but on the version known to the commentator Nīlakaṇṭha. Currently available are 15 volumes of the projected 32-volume edition.\n\nIndian economist Bibek Debroy has also begun an unabridged English translation in ten volumes. [http://www.penguinbooksindia.com/category/Non_Fiction/The_Mahabharata_9780143100133.aspx Volume 1: Adi Parva] was published in March 2010.\n\nMany condensed versions, abridgements and novelistic prose retellings of the complete epic have been published in English, including works by Ramesh Menon, William Buck, R. K. Narayan, C. Rajagopalachari, K. M. Munshi, Krishna Dharma, Romesh C. Dutt, Bharadvaja Sarma, John D. Smith and Sharon Maas.\n\nDerivative literature\n\nBhasa, the 2nd- or 3rd-century CE Sanskrit playwright, wrote two plays on episodes in the Marabharata, Urubhanga (Broken Thigh), about the fight between Duryodhana and Bhima, while Madhyamavyayoga (The Middle One) set around Bhima and his son, Ghatotkacha. The first important play of 20th century was Andha Yug (The Blind Epoch), by Dharamvir Bharati, which came in 1955, found in Mahabharat, both an ideal source and expression of modern predicaments and discontent. Starting with Ebrahim Alkazi it was staged by numerous directors. V. S. Khandekar's Marathi novel, Yayati (1960) and Girish Karnad's debut play Yayati (1961) are based on the story of King Yayati found in the Mahabharat. Bengali writer and playwright, Buddhadeva Bose wrote three plays set in Mahabharat, Anamni Angana, Pratham Partha and Kalsandhya.[http://www.boloji.com/hinduism/084.htm The Mahabharata as Theatre] by Pradip Bhattacharya, June 13, 2004. Pratibha Ray wrote an award winning novel entitled Yajnaseni from Draupadi's perspective in 1984. Later, Chitra Banerjee Divakaruni wrote a similar novel entitled The Palace of Illusions: A Novel in 2008. Gujarati poet Chinu Modi has written long narrative poetry Bahuk based on character Bahuka. Krishna Udayasankar, a Singapore-based Indian author has written several novels which are modern-day retellings of the epic, most notably the Aryavarta Chronicles Series. Suman Pokhrel wrote a solo play based on Ray's novel by personalizing and taking Draupadi alone in the scene.\n\nAmar Chitra Katha published a 1,260 page comic book version of the Mahabharata.\n\nIn film and television\n\nIn Indian cinema, several film versions of the epic have been made, dating back to 1920. (1920 film) In Telugu film Daana Veera Soora Karna (1977)  directed by and starring N. T. Rama Rao depicts Karna as the lead character. The Mahābhārata was also reinterpreted by Shyam Benegal in Kalyug. Prakash Jha directed 2010 film Raajneeti was partially inspired by the Mahabharata. A 2013 animated adaptation holds the record for India's most expensive animated film.\n\nIn the late 1980s, the Mahabharat TV series, directed by Ravi Chopra, (1988–1990 TV series) was televised on India's national television (Doordarshan). The same year as Mahabharat was being shown on Doordarshan, that same company's other television show, Bharat Ek Khoj, also directed by Shyam Benegal, showed a 2-episode abbreviation of the Mahabharata, drawing from various interpretations of the work, be they sung, danced, or staged. In the Western world, a well-known presentation of the epic is Peter Brook's nine-hour play, which premiered in Avignon in 1985, and its five-hour movie version The Mahābhārata (1989). (1989 mini-series)\n\nUncompleted projects on the Mahābhārata include a ones by Rajkumar Santoshi,  and a theaterical adaptation planned by Satyajit Ray.\n\nJain version\n\nJain versions of Mahābhārata can be found in the various Jain texts like Harivamsapurana (the story of Harivamsa) Trisastisalakapurusa Caritra (Hagiography of 63 Illustrious persons),   Pandavacaritra (lives of Pandavas) and Pandavapurana (stories of Pandavas). p. 351-52 From the earlier canonical literature, Antakrddaaśāh (8th cannon) and Vrisnidasa (upangagama or secondary canon) contain the stories of Neminatha (22nd Tirthankara), Krishna and Balarama.  vol 1 pp. 14–15 Prof. Padmanabh Jaini notes that, unlike in the Hindu Puranas, the names Baladeva and Vasudeva are not restricted to Balarama and Krishna in Jain puranas. Instead they serve as names of two distinct class of mighty brothers, who appear nine times in each half of  time cycles of the Jain cosmology and rule the half the earth as half-chakravartins. Jaini traces the origin of this list of brothers to the Jinacharitra by Bhadrabahu swami (4th–3rd century BCE). p. 377  According to Jain cosmology Balarama, Krishna and Jarasandha are the ninth and the last set of Baladeva, Vasudeva, and Partivasudeva. p.305 The main battle is not the Mahabharata, but the fight between Krishna and Jarasandha (who is killed by Krishna). Ultimately, the Pandavas and Balarama take renunciation as Jain monks and are reborn in heavens, while on the other hand Krishna and Jarasandha are reborn in hell. p. 351 In keeping with the law of karma, Krishna is reborn in hell for his exploits (sexual and violent) while Jarasandha for his evil ways. Prof. Jaini admits a possibility that perhaps because of his popularity, the Jain authors were keen to rehabilitate Krishna. The Jain texts predict that after his karmic term in hell is over sometime during the next half time-cycle, Krishna will be reborn as a Jain Tirthankara and attain liberation. Krishna and Balrama are shown as contemporaries and cousins of 22nd Tirthankara, Neminatha. According to this story, Krishna arranged young Neminath’s marriage with Rajamati, the daughter of Ugrasena, but Neminatha, empathizing with the animals which were to be slaughtered for the marriage feast, left the procession suddenly and renounced the world. refer story of Neminatha\n\nKuru family tree\n\nThis shows the line of royal and family succession, not necessarily the parentage. See the notes below for detail.\n\nKey to Symbols\n* Male:  blue border\n* Female:  red border \n* Pandavas:  green box \n* Kauravas:  yellow box \n\nNotes\n* a: Shantanu was a king of the Kuru dynasty or kingdom, and was some generations removed from any ancestor called Kuru. His marriage to Ganga preceded his marriage to Satyavati.\n* b: Pandu and Dhritarashtra were fathered by Vyasa in the niyoga tradition after Vichitravirya's death. Dhritarashtra, Pandu and Vidura were the sons of Vyasa with Ambika, Ambalika and a maid servant respectively.\n* c: Karna was born to Kunti through her invocation of Surya, before her marriage to Pandu.\n* d: Yudhishthira, Bhima, Arjuna, Nakula and Sahadeva were acknowledged sons of Pandu but were begotten by the invocation by Kunti and Madri of various deities. They all married Draupadi (not shown in tree).\n* e: Duryodhana and his siblings were born at the same time, and they were of the same generation as their Pandava cousins.\n* f : Although the succession after the Pandavas was through the descendants of Arjuna and Subhadra, it was Yudhishthira and Draupadi who occupied the throne of Hastinapura after the great battle.\n\nThe birth order of siblings is correctly shown in the family tree (from left to right), except for Vyasa and Bhishma whose birth order is not described, and Vichitravirya and Chitrangada who were born after them. The fact that Ambika and Ambalika are sisters is not shown in the family tree. The birth of Duryodhana took place after the birth of Karna, Yudhishthira and Bhima, but before the birth of the remaining Pandava brothers.\n\nSome siblings of the characters shown here have been left out for clarity; these include Chitrāngada, the eldest brother of Vichitravirya. Vidura, half-brother to Dhritarashtra and Pandu.\n\nCultural influence\n\nIn the Bhagavad Gita, Krishna explains to Arjuna his duties as a warrior and prince and elaborates on different Yogic and Vedantic philosophies, with examples and analogies. This has led to the Gita often being described as a concise guide to Hindu philosophy and a practical, self-contained guide to life.Maharishi Mahesh Yogi; On The Bhagavad Gita; A New Translation and Commentary With Sanskrit Text Chapters 1 to 6, Preface p.9 In more modern times, Swami Vivekananda, Bal Gangadhar Tilak, Mahatma Gandhi and many others used the text to help inspire the Indian independence movement.Stevenson, Robert W., \"Tilak and the Bhagavadgita's Doctrine of Karmayoga\", in: Minor, p. 44.Jordens, J. T. F., \"Gandhi and the Bhagavadgita\", in: Minor, p. 88.\n\nVarious modern day television shows and novels have taken inspiration from the Mahabharata.\n\nEditions\n\n* The Mahabharata: Complete and Unabridged (set of 10 volumes) by Bibek Debroy, Penguin Books India.\n* The Mahābhārata of Vyasa (18 volumes), transcreated from Sanskrit by P. Lal, Writers Workshop. Mahabharata. http://en.wikipedia.org/?curid=19643."
  }
}
