{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19052",
  "eid" : "37859dc0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778602396,
  "textBody" : "Molybdenum is a chemical element with symbol Mo and atomic number 42. The name is from Neo-Latin molybdaenum, from Ancient Greek  ', meaning lead, since its ores were confused with lead ores. Molybdenum minerals have been known throughout history, but the element was discovered (in the sense of differentiating it as a new entity from the mineral salts of other metals) in 1778 by Carl Wilhelm Scheele. The metal was first isolated in 1781 by Peter Jacob Hjelm.\n\nMolybdenum does not occur naturally as a free metal on Earth; it is found only in various oxidation states in minerals.  The free element, a silvery metal with a gray cast, has the sixth-highest melting point of any element. It readily forms hard, stable carbides in alloys, and for this reason most of world production of the element (about 80%) is used in steel alloys, including high-strength alloys and superalloys.\n\nMost molybdenum compounds have low solubility in water, but when molybdenum-bearing minerals contact oxygen and water, the resulting molybdate ion  is quite soluble. Industrially, molybdenum compounds (about 14% of world production of the element) are used in high-pressure and high-temperature applications as pigments and catalysts.\n\n are by far the most common bacterial catalysts for breaking the chemical bond in atmospheric molecular nitrogen in the process of biological nitrogen fixation. At least 50 molybdenum enzymes are now known in bacteria, plants, and animals, although only bacterial and cyanobacterial enzymes are involved in nitrogen fixation. These nitrogenases contain molybdenum in a form different from other molybdenum enzymes, which all contain fully oxidized molybdenum in a molybdenum cofactor. These various molybdenum cofactor enzymes are vital to the organisms, and molybdenum is an essential element for life in all higher eukaryote organisms, though not in all bacteria.\n\nCharacteristics\n\nPhysical properties\n\nIn its pure form, molybdenum is a silvery-grey metal with a Mohs hardness of 5.5. It has a melting point of 2623 °C; of the naturally occurring elements, only tantalum, osmium, rhenium, tungsten, and carbon have higher melting points. Weak oxidation of molybdenum starts at 300 °C. It has one of the lowest coefficients of thermal expansion among commercially used metals. The tensile strength of molybdenum wires increases about 3 times, from about 10 to 30 GPa, when their diameter decreases from ~50–100 nm to 10 nm.\n\nIsotopes\n\nThere are 35 known isotopes of molybdenum, ranging in atomic mass from 83 to 117, as well as four metastable nuclear isomers. Seven isotopes occur naturally, with atomic masses of 92, 94, 95, 96, 97, 98, and 100. Of these naturally occurring isotopes, only molybdenum-100 is unstable.\n\nMolybdenum-98 is the most abundant isotope, comprising 24.14% of all molybdenum. Molybdenum-100 has a half-life of about 1019 y and undergoes double beta decay into ruthenium-100. Molybdenum isotopes with mass numbers from 111 to 117 all have half-lives of approximately 150 ns. All unstable isotopes of molybdenum decay into isotopes of niobium, technetium, and ruthenium.\n\nAs also noted below, the most common isotopic molybdenum application involves molybdenum-99, which is a fission product. It is a parent radioisotope to the short-lived gamma-emitting daughter radioisotope technetium-99m, a nuclear isomer used in various imaging applications in medicine.\nIn 2008, the Delft University of Technology applied for a patent on the molybdenum-98-based production of molybdenum-99.Wolterbeek, Hubert Theodoor; Bode, Peter [http://worldwide.espacenet.com/publicationDetails/biblio?DBEPODOC&adjacent\ntrue&localenl_NL&FT\nD&date20110330&CC\nEP&NR2301041A1&KC\nA1 \"A process for the production of no-carrier added 99Mo\"]. European Patent EP2301041 (A1) ― 2011-03-30. Retrieved on 2012-06-27.\n\nCompounds and chemistry\n\nMolybdenum is a transition metal with an electronegativity of 2.16 on the Pauling scale and a standard atomic weight of 95.95 g/mol. It does not visibly react with oxygen or water at room temperature, and the bulk oxidation occurs at temperatures above 600 °C, resulting in molybdenum trioxide:\n\n2 Mo + 3  → 2 \n\nThe trioxide is volatile and sublimes at high temperatures. This prevents formation of a continuous protective (passivating) oxide layer, which would stop the bulk oxidation of metal. Molybdenum has several oxidation states, the most stable being +4 and +6 (bolded in the table at left). The chemistry and the compounds show more similarity to tungsten than to chromium; the instability of molybdenum(III) and tungsten(III) compounds, for example, contrasts with the stability of the chromium(III) compounds. The highest oxidation state is seen in molybdenum(VI) oxide (MoO3), while the normal sulfur compound is molybdenum disulfide MoS2.\n\nMolybdenum(VI) oxide is soluble in strong alkaline water, forming molybdates (MoO42−). Molybdates are weaker oxidants than chromates, but they show a similar tendency to form complex oxyanions by condensation at lower pH values, such as [Mo7O24]6− and [Mo8O26]4−. Polymolybdates can incorporate other ions, forming polyoxometalates. The dark-blue phosphorus-containing heteropolymolybdate P[Mo12O40]3− is used for the spectroscopic detection of phosphorus. The broad range of oxidation states of molybdenum is reflected in various molybdenum chlorides:\n* Molybdenum(II) chloride MoCl2 (yellow solid)\n* Molybdenum(III) chloride MoCl3 (dark red solid)\n* Molybdenum(IV) chloride MoCl4 (black solid)\n* Molybdenum(V) chloride MoCl5 (dark green solid)\n* Molybdenum(VI) chloride MoCl6 (brown solid)\n\nThe structure of the MoCl2 is clusters of Mo6Cl84+ and four chloride ions compensating the charge.\n\nLike chromium and some other transition metals, molybdenum forms quadruple bonds, such as in Mo2(CH3COO)4. This compound can be transformed into Mo2Cl84−, which also has a quadruple bond.\n\nThe oxidation state 0 is possible with carbon monoxide as ligand, such as in molybdenum hexacarbonyl, Mo(CO)6.\n\nHistory\n\nMolybdenite—the principal ore from which molybdenum is now extracted—was previously known as molybdena. Molybdena was confused with and often utilized as though it were graphite. Like graphite, molybdenite can be used to blacken a surface or as a solid lubricant. Even when molybdena was distinguishable from graphite, it was still confused with the common lead ore PbS (now called galena); the name comes from Ancient Greek  ', meaning lead. (The Greek word itself has been proposed as a loanword from Anatolian Luvian and Lydian languages).\n\nAlthough (reportedly) molybdenum was deliberately alloyed with steel in one 14th-century Japanese sword (mfd. ca. 1330), that art was never employed widely and was later lost.International Molybdenum Association, [https://web.archive.org/web/20130722102351/http://www.imoa.info/molybdenum/molydbenum_history.php \"Molybdenum History\"] In the West in 1754, Bengt Andersson Qvist examined a sample of molybdenite and determined that it did not contain lead and thus was not galena.\n\nBy 1778 Swedish chemist Carl Wilhelm Scheele stated firmly that molybdena was (indeed) neither galena nor graphite. Instead, Scheele correctly proposed that molybdena was an ore of a distinct new element, named molybdenum for the mineral in which it resided, and from which it might be isolated. Peter Jacob Hjelm successfully isolated molybdenum using carbon and linseed oil in 1781.\n\nFor the next century, molybdenum had no industrial use.  It was relatively scarce, the pure metal was difficult to extract, and the necessary techniques of metallurgy were immature. Early molybdenum steel alloys showed great promise of increased hardness, but efforts to manufacture the alloys on a large scale were hampered with inconsistent results, a tendency toward brittleness, and recrystallization. In 1906, William D. Coolidge filed a patent for rendering molybdenum ductile, leading to applications as a heating element for high-temperature furnaces and as a support for tungsten-filament light bulbs; oxide formation and degradation require that molybdenum be physically sealed or held in an inert gas. In 1913, Frank E. Elmore developed a froth flotation process to recover molybdenite from ores; flotation remains the primary isolation process.\n\nDuring World War I, demand for molybdenum spiked; it was used both in armor plating and as a substitute for tungsten in high speed steels. Some British tanks were protected by 75 mm (3 in) manganese steel plating, but this proved to be ineffective. The manganese steel plates were replaced with much lighter  molybdenum steel plates allowing for higher speed, greater maneuverability, and better protection. The Germans also used molybdenum-doped steel for heavy artillery, like in the super-heavy howitzer Big Bertha,[http://www.lenntech.com/periodic/elements/mo.htm Chemical properties of molibdenum - Health effects of molybdenum - Environmental effects of molybdenum]. lenntech.com\n because traditional steel melts at the temperatures produced by the propellant of the one ton shell.Sam Kean. The Disappearing Spoon. Page 88–89 After the war, demand plummeted until metallurgical advances allowed extensive development of peacetime applications. In World War II, molybdenum again saw strategic importance as a substitute for tungsten in steel alloys.\n\nOccurrence and production\n\nMolybdenum is the 54th most abundant element in the Earth's crust and the 25th most abundant element in its oceans, with an average of 10 parts per billion; it is the 42nd most abundant element in the Universe. The Russian Luna 24 mission discovered a molybdenum-bearing grain (1 × 0.6 µm) in a pyroxene fragment taken from Mare Crisium on the Moon. The comparative rarity of molybdenum in the Earth's crust is offset by its concentration in a number of water-insoluble ores, often combined with sulfur in the same way as copper, with which it is often found. Though molybdenum is found in such minerals as wulfenite (PbMoO4) and powellite (CaMoO4), the main commercial source is molybdenite (MoS2). Molybdenum is mined as a principal ore and is also recovered as a byproduct of copper and tungsten mining.\n\nThe world's production of molybdenum was 250,000 tonnes in 2011, the largest producers being China (94,000 t), the United States (64,000 t), Chile (38,000 t), Peru (18,000 t) and Mexico (12,000 t). The total reserves are estimated at 10 million tonnes, and are mostly concentrated in China (4.3 Mt), the US (2.7 Mt) and Chile (1.2 Mt). By continent, 93% of world molybdenum production is about evenly shared between North America, South America (mainly in Chile), and China. Europe and the rest of Asia (mostly Armenia, Russia, Iran and Mongolia) produce the remainder.\n\nIn molybdenite processing, the ore is first roasted in air at a temperature of 700 °C.  The process gives gaseous sulfur dioxide and the  molybdenum(VI) oxide:\n\n2 MoS2 + 7 O2 → 2 MoO3 +  4 SO2\n\nThe oxidized ore is then usually extracted with aqueous ammonia to give ammonium molybdate:\nMoO3 + 2 NH3  +  H2O  →  (NH4)2(MoO4)\nCopper, an impurity in molybdenite, is less soluble in ammonia. To completely remove it from the solution, it is precipitated with hydrogen sulfide.  Ammonium molybdate converts to ammonium dimolybdate, which is isolated as a solid.  Heating this solid gives molybdenum trioxide:Sebenik, Roger F. et al. (2005) \"Molybdenum and Molybdenum Compounds\" in Ullmann's Encyclopedia of Chemical Technology. Wiley-VCH, Weinheim. \n(NH4)2Mo2O7   →   2 MoO3  +  2 NH3  +  H2O\nCrude trioxide can be further purified by sublimation at 1100 °C.\n\nMetallic molybdenum is produced by reduction of the oxide with hydrogen:\nMoO3   +  3 H2  →   Mo  +  3 H2O\n\nThe molybdenum for steel production is reduced by the aluminothermic reaction with addition of iron to produce ferromolybdenum. A common form of ferromolybdenum contains 60% molybdenum.\n\nMolybdenum had a value of approximately $30,000 per tonne as of August 2009. It maintained a price at or near $10,000 per tonne from 1997 through 2003, and reached a peak of $103,000 per tonne in June 2005. In 2008, the London Metal Exchange announced that molybdenum would be traded as a commodity.\n\nHistory of molybdenum mining\n\nHistorically, the Knaben mine in southern Norway, opened in 1885, was the first dedicated molybdenum mine. It was closed in 1973 but was reopened in 2007. and now produces  of molybdenum disulfide per year. Large mines in Colorado (such as the Henderson mine and the Climax mine) and in British Columbia yield molybdenite as their primary product, while many porphyry copper deposits such as the Bingham Canyon Mine in Utah and the Chuquicamata mine in northern Chile produce molybdenum as a byproduct of copper mining.\n\nApplications\n\nAlloys\n\nAbout 86% of molybdenum produced is used in metallurgy, with the rest used in chemical applications. The estimated global use is structural steel 35%, stainless steel 25%, chemicals 14%, tool & high-speed steels 9%, cast iron 6%, molybdenum elemental metal 6%, and superalloys 5%.[https://web.archive.org/web/20120310004452/http://www.lme.com/minormetals/6782.asp Pie chart of world Mo uses]. London Metal Exchange.\n\nMolybdenum can withstand extreme temperatures without significantly expanding or softening, making it useful in environments of intense heat, including military armor, aircraft parts, electrical contacts, industrial motors, and filaments.\n\nMost high-strength steel alloys (for example, 41xx steels) contain 0.25% to 8% molybdenum. Even in these small portions, more than 43,000 tonnes of molybdenum are used each year in stainless steels, tool steels, cast irons, and high-temperature superalloys.\n\nMolybdenum is also valued in steel alloys for its high corrosion resistance and weldability. Molybdenum contributes corrosion resistance to type-300 stainless steels (specifically type-316) and especially so in the so-called superaustenitic stainless steels (such as alloy AL-6XN, 254SMO and 1925hMo). Molybdenum increases lattice strain, thus increasing the energy required to dissolve iron atoms from the surface. Molybdenum is also used to enhance the corrosion resistance of ferritic (for example grade 444) and martensitic (for example 1.4122 and 1.4418) stainless steels.\n\nBecause of its lower density and more stable price, molybdenum is sometimes used in place of tungsten. An example is the 'M' series of high-speed steels such as M2, M4 and M42 as substitution for the 'T' steel series, which contain tungsten. Molybdenum can also be used as a flame-resistant coating for other metals. Although its melting point is 2623 °C, molybdenum rapidly oxidizes at temperatures above 760 °C making it better-suited for use in vacuum environments.\n\nTZM (Mo (~99%), Ti (~0.5%), Zr (~0.08%) and some C) is a corrosion-resisting molybdenum superalloy that resists molten fluoride salts at temperatures above 1300 °C. It has about twice the strength of pure Mo, and is more ductile and more weldable, yet in tests it resisted corrosion of a standard eutectic salt (FLiBe) and salt vapors used in molten salt reactors for 1100 hours with so little corrosion that it was difficult to measure.\n\nOther molybdenum-based alloys that do not contain iron have only limited applications. For example, because of its resistance to molten zinc, both pure molybdenum and molybdenum-tungsten alloys (70%/30%) are used for piping, stirrers and pump impellers that come into contact with molten zinc.\n\nOther applications as a pure element\n\n* Molybdenum powder is used as a fertilizer for some plants, such as cauliflower\n* Elemental molybdenum is used in NO, NO2, NOx analyzers in power plants for pollution controls. At 350 °C, the element acts as a catalyst for NO2/NOx to form NO molecules for detection by infrared light.\n* Molybdenum anodes replace tungsten in certain low voltage X-ray sources for specialized uses such as mammography\n* The radioactive isotope molybdenum-99 is used to generate technetium-99m, used for medical imagingGray, Theodore (2009). The Elements. Black Dog & Leventhal. pp. 105–107. .\n\nCompounds (14% of global use)\n\n* Molybdenum disulfide (MoS2) is used as a solid lubricant and a high-pressure high-temperature (HPHT) antiwear agent. It forms strong films on metallic surfaces and is a common additive to HPHT greases — in the event of a catastrophic grease failure, a thin layer of molybdenum prevents contact of the lubricated parts. It also has semiconducting properties with distinct advantages over traditional silicon or graphene in electronics applications. MoS2 is also used as a catalyst in hydrocracking of petroleum fractions containing nitrogen, sulfur and oxygen.\n* Molybdenum disilicide (MoSi2) is an electrically conducting ceramic with primary use in heating elements operating at temperatures above 1500 °C in air.\n* Molybdenum trioxide (MoO3) is used as an adhesive between enamels and metals. Lead molybdate (wulfenite) co-precipitated with lead chromate and lead sulfate is a bright-orange pigment used with ceramics and plastics.[http://www.imoa.info/ International Molybdenum Association]. imoa.info.\n* The molybdenum-based mixed oxides are versatile catalysts in the chemical industry. Some examples are the catalysts for the selective oxidation of propylene to acrolein and acrylic acid, the ammoxidation of propylene to acrylonitrile. Suitable catalysts and process for the direct selective oxidation of propane to acrylic acid are being researched.\n* Ammonium heptamolybdate is used in biological staining.\n* Molybdenum coated soda lime glass is used in CIGS solar cells\n* Phosphomolybdic acid is a stain used in thin layer chromatography\n* Molybdenum-99 is a parent radioisotope of the daughter radioisotope technetium-99m, used in many medical procedures. The isotope is handled and stored as the molybdate.\n\nBiological role\n\nNitrogenases \n\nThe most important role of molybdenum in living organisms is as a metal heteroatom at the active site in certain enzymes. electronic-book   electronic-\n\n In bacterial nitrogen fixation, the nitrogenase enzyme involved in the terminal step of reducing molecular nitrogen usually contains molybdenum in the active site (though replacement of molybdenum with iron or vanadium is also known). The structure of the catalytic center of the enzyme is similar to that in iron-sulfur proteins: it incorporates a Fe4S3 and multiple MoFe3S3 clusters.The oxidation state of Mo in these clusters is less than in non-nitrogenase molybdenum cofactor enzymes. The oxidation state of Mo in these nitrogenases was formerly thought Mo(V), then Mo(IV), but more recent evidence is for Mo(III)[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4510703/ ].\n\nThe reaction that nitrogenase enzymes perform is:\n\n \\mathrm{N_2 + 8 \\ H^+ + 8 \\ e^- + 16 \\ ATP + 16 \\ H_2O \\longrightarrow 2 \\ NH_3 + H_2 + 16 \\ ADP + 16 \\ P_i} \n\nWith protons and electrons from the electron transport chain, nitrogen is reduced to ammonia and free hydrogen gas. This is an energy-using process, requiring the splitting (hydrolysis) of ATP into ADP plus free phosphate (Pi).\n\nIn 2008, evidence was reported that a scarcity of molybdenum in the Earth's early oceans was a limiting factor for nearly two billion years in the further evolution of eukaryotic life (which includes all plants and animals).  The chain of causation is as follows:\n# The relative lack of oxygen in the early ocean resulted in a scarcity in dissolved molybdenum. Most molybdenum compounds have low solubility in water, but the molybdate ion MoO42− is soluble and forms when molybdenum-containing minerals are in contact with oxygen and water.\n# The lack of dissolved molybdenum limited the growth of prokaryotic nitrogen-fixing bacteria, which require molybdenum-bearing enzymes for the process\n# The lack of prokaryotic nitrogen-fixing bacteria limited the growth of ocean eukaryotes, which require oxidized nitrogen suitable for the production of organic nitrogen compounds or the organics themselves (like proteins) from prokaryotic bacteria.\nHowever, once oxygen had been created in seawater by the limited eukaryotes, it reacted with water and the molybdenum in minerals on the sea bottom to produce soluble molybdate, making it available to nitrogen-fixing bacteria.  Those bacteria provided fixed usable nitrogen compounds for higher forms of life.\n\nAlthough oxygen once promoted nitrogen fixation by making molybdenum available in water, it also directly poisons nitrogenase enzymes. Thus, in Earth's ancient history, after oxygen arrived in large quantities in Earth's air and water, organisms that continued to fix nitrogen in aerobic conditions isolated and protected their nitrogen-fixing enzymes from too much oxygen in heterocysts or equivalent structures. This structural isolation of nitrogen fixation reactions in most aerobic organisms continues to the present, but is not quite universal. Trichodesmium (a cyanobacterial photosynthetic diazotroph) perhaps the most important marine nitrogen fixing organism  is the only known diazotroph able to fix nitrogen in daylight under aerobic conditions without the use of heterocysts.\n\nMolybdenum cofactor enzymes \n\nThough molybdenum forms compounds with various organic molecules, including carbohydrates and amino acids, it is transported throughout the human body as fully oxidized MoO42−. At least 50 molybdenum-containing enzymes were known by 2002, mostly in bacteria, and the number is increasing with every year; those enzymes include aldehyde oxidase, sulfite oxidase and xanthine oxidase. In some animals, and in humans, the oxidation of xanthine to uric acid, a process of purine catabolism, is catalyzed by xanthine oxidase, a molybdenum-containing enzyme. The activity of xanthine oxidase is directly proportional to the amount of molybdenum in the body. However, an extremely high concentration of molybdenum reverses the trend and can act as an inhibitor in both purine catabolism and other processes. Molybdenum concentration also affects protein synthesis, metabolism, and growth.\n\nIn animals and plants, a tricyclic compound called molybdopterin (which, despite the name, contains no molybdenum) is reacted with molybdate to form a complete molybdenum-containing cofactor called molybdenum cofactor. Other than the phylogenetically-ancient nitrogenases (discussed above) that fix nitrogen in some bacteria and cyanobacteria, all molybdenum-using enzymes (so far identified) use the molybdenum cofactor, where molybdenum is in the oxidation state of VI, similar to molybdate.. Summarized in [http://pathway.gramene.org/META/NEW-IMAGE?typeCOMPOUND&object\nCPD-4 MetaCyc Compound: molybdopterin]. Accessed Nov. 16, 2009. Molybdenum enzymes in plants and animals catalyze the oxidation and sometimes reduction of certain small molecules in the process of regulating nitrogen, sulfur, and carbon.\n\nHuman metabolism and deficiency\n\nMolybdenum is an essential trace dietary element. Four mammalian Mo-dependent enzymes are known, all of them harboring a pterin-based molybdenum cofactor (Moco) in their active site: sulfite oxidase, xanthine oxidoreductase, aldehyde oxidase, and mitochondrial amidoxime reductase.  People severely deficient in molybdenum have poorly functioning sulfite oxidase and are prone to toxic reactions to sulfites in foods.Blaylock Wellness Report, February 2010, page 3. The human body contains about 0.07 mg of molybdenum per kilogram of body weight, with higher concentrations in the liver and kidneys and in lower in the vertebrae. Molybdenum is also present within human tooth enamel and may help prevent its decay.\n\nAcute toxicity has not been seen in humans, and the toxicity depends strongly on the chemical state. Studies on rats show a median lethal dose (LD50) as low as 180 mg/kg for some Mo compounds. Although human toxicity data is unavailable, animal studies have shown that chronic ingestion of more than 10 mg/day of molybdenum can cause diarrhea, growth retardation, infertility, low birth weight, and gout; it can also affect the lungs, kidneys, and liver. Sodium tungstate is a competitive inhibitor of molybdenum. Dietary tungsten reduces the concentration of molybdenum in tissues.\n\nLow soil concentration of molybdenum in a geographical band from northern China to Iran results in a general dietary molybdenum deficiency, and is associated with increased rates of esophageal cancer. Compared to the United States, which has a greater supply of molybdenum in the soil, people living in those areas have about 16 times greater risk for esophageal squamous cell carcinoma.\n\nMolybdenum deficiency has also been reported as a consequence of non-molybdenum supplemented total parenteral nutrition (complete intravenous feeding) for long periods of time. It results in high blood levels of sulfite and urate, in much the same way as molybdenum cofactor deficiency. However (presumably since pure molybdenum deficiency from this cause occurs primarily in adults), the neurological consequences are not as marked as in cases of congenital cofactor deficiency.\n\nRelated diseases\n\nA congenital molybdenum cofactor deficiency disease, seen in infants, is an inability to synthesize molybdenum cofactor, the heterocyclic molecule discussed above that binds molybdenum at the active site in all known human enzymes that use molybdenum.  The resulting deficiency results in high levels of sulfite and urate, and neurological damage.\n\nCopper-molybdenum antagonism\n\nHigh levels of molybdenum can interfere with the body's uptake of copper, producing copper deficiency. Molybdenum prevents plasma proteins from binding to copper, and it also increases the amount of copper that is excreted in urine. Ruminants that consume high levels of molybdenum suffer from diarrhea, stunted growth, anemia, and achromotrichia (loss of fur pigment). These symptoms can be alleviated by copper supplements, either dietary and injection. The effective copper deficiency can be aggravated by excess sulfur.Hauer, Gerald [http://www.bisoncentre.com/index.php?optioncom_content&view\narticle&id59&Itemid\n256 Copper deficiency in cattle]. Bison Producers of Alberta. Accessed Dec. 16, 2010.\n\nCopper reduction or deficiency can also be deliberately induced for therapeutic purposes by the compound ammonium tetrathiomolybdate, in which the bright red anion tetrathiomolybdate is the copper-chelating agent. Tetrathiomolybdate was first used therapeutically in the treatment of copper toxicosis in animals. It was then introduced as a treatment in Wilson's disease, a hereditary copper metabolism disorder in humans; it acts both by competing with copper absorption in the bowel and by increasing excretion. It has also been found to have an inhibitory effect on angiogenesis, potentially by inhibiting the membrane translocation process that is dependent on copper ions. This is a promising avenue for investigation of treatments for cancer, age-related macular degeneration, and other diseases that involve a pathologic proliferation of blood vessels.\n\nDietary recommendations\n\nThe U.S. Institute of Medicine (IOM) updated Estimated Average Requirements (EARs) and Recommended Dietary Allowances (RDAs) for molybdenum in 2000. If there is not sufficient information to establish EARs and RDAs, an estimate designated Adequate Intake (AI) is used instead. The current EAR for molybdenum for people ages 19 and up is 34 μg/day. The RDA is 45 μg/day. RDAs are higher than EARs so as to identify amounts that will cover people with higher than average requirements. RDA for pregnancy is 50 μg/day. RDA for lactation is 50 μg/day. For children ages 1–18 years the RDA increases with age from 17 to 43 μg/day. As for safety, the IOM sets Tolerable upper intake levels (ULs) for vitamins and minerals when evidence is sufficient. In the case of molybdenum the UL is 2000 μg/day. Collectively the EARs, RDAs, AIs and ULs are referred to as Dietary Reference Intakes (DRIs).\n\nThe European Food Safety Authority (EFSA) refers to the collective set of information as Dietary Reference Values, with Population Reference Intake (PRI) instead of RDA, and Average Requirement instead of EAR. AI and UL defined the same as in United States. For women and men ages 15 and older the AI is set at 65 μg/day. AI for pregnancy is 65 μg/day, for lactation also 65 μg/day. For children ages 1–14 years the AIs increase with age from 15 to 45 μg/day. The adult AIs are higher than the U.S. RDAs. The European Food Safety Authority reviewed the same safety question and set its UL at 600 μg/day, which is much lower than the U.S. value.\n\nFor U.S. food and dietary supplement labeling purposes the amount in a serving is expressed as a percent of Daily Value (%DV). For molybdenum labeling purposes 100% of the Daily Value was 75 μg, but as of May 27, 2016 it was revised to 45 μg. A table of the old and new adult Daily Values is provided at Reference Daily Intake. The original deadline to be in compliance was July 28, 2018, but on September 29, 2017 the FDA released a proposed rule that extended the deadline to January 1, 2020 for large companies and January 1, 2021 for small companies. [https://www.fda.gov/Food/GuidanceRegulation/GuidanceDocumentsRegulatoryInformation/LabelingNutrition/ucm385663.htm#dates \"Changes to the Nutrition Facts Panel - Compliance Date\"]\n\nFood sources\n\nAverage daily intake varies between 120 and 240 μg/day, which is higher than dietary recommendations. Pork, lamb, and beef liver each have approximately 1.5 parts per million of molybdenum. Other significant dietary sources include green beans, eggs, sunflower seeds, wheat flour, lentils, cucumbers and cereal grain.\n\nPrecautions\n\nMolybdenum dusts and fumes, generated by mining or metalworking, can be toxic, especially if ingested (including dust trapped in the sinuses and later swallowed). Low levels of prolonged exposure can cause irritation to the eyes and skin. Direct inhalation or ingestion of molybdenum and its oxides should be avoided. OSHA regulations specify the maximum permissible molybdenum exposure in an 8-hour day as 5 mg/m3. Chronic exposure to 60 to 600 mg/m3 can cause symptoms including fatigue, headaches and joint pains. At levels of 5000 mg/m3, molybdenum is immediately dangerous to life and health.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Molybdenum" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19052" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Molybdenum is a chemical element with symbol Mo and atomic number 42. The name is from Neo-Latin molybdaenum, from Ancient Greek  ', meaning lead, since its ores were confused with lead ores. Molybdenum minerals have been known throughout history, but the element was discovered (in the sense of differentiating it as a new entity from the mineral salts of other metals) in 1778 by Carl Wilhelm Scheele. The metal was first isolated in 1781 by Peter Jacob Hjelm.\n\nMolybdenum does not occur naturally as a free metal on Earth; it is found only in various oxidation states in minerals.  The free element, a silvery metal with a gray cast, has the sixth-highest melting point of any element. It readily forms hard, stable carbides in alloys, and for this reason most of world production of the element (about 80%) is used in steel alloys, including high-strength alloys and superalloys.\n\nMost molybdenum compounds have low solubility in water, but when molybdenum-bearing minerals contact oxygen and water, the resulting molybdate ion  is quite soluble. Industrially, molybdenum compounds (about 14% of world production of the element) are used in high-pressure and high-temperature applications as pigments and catalysts.\n\n are by far the most common bacterial catalysts for breaking the chemical bond in atmospheric molecular nitrogen in the process of biological nitrogen fixation. At least 50 molybdenum enzymes are now known in bacteria, plants, and animals, although only bacterial and cyanobacterial enzymes are involved in nitrogen fixation. These nitrogenases contain molybdenum in a form different from other molybdenum enzymes, which all contain fully oxidized molybdenum in a molybdenum cofactor. These various molybdenum cofactor enzymes are vital to the organisms, and molybdenum is an essential element for life in all higher eukaryote organisms, though not in all bacteria.\n\nCharacteristics\n\nPhysical properties\n\nIn its pure form, molybdenum is a silvery-grey metal with a Mohs hardness of 5.5. It has a melting point of 2623 °C; of the naturally occurring elements, only tantalum, osmium, rhenium, tungsten, and carbon have higher melting points. Weak oxidation of molybdenum starts at 300 °C. It has one of the lowest coefficients of thermal expansion among commercially used metals. The tensile strength of molybdenum wires increases about 3 times, from about 10 to 30 GPa, when their diameter decreases from ~50–100 nm to 10 nm.\n\nIsotopes\n\nThere are 35 known isotopes of molybdenum, ranging in atomic mass from 83 to 117, as well as four metastable nuclear isomers. Seven isotopes occur naturally, with atomic masses of 92, 94, 95, 96, 97, 98, and 100. Of these naturally occurring isotopes, only molybdenum-100 is unstable.\n\nMolybdenum-98 is the most abundant isotope, comprising 24.14% of all molybdenum. Molybdenum-100 has a half-life of about 1019 y and undergoes double beta decay into ruthenium-100. Molybdenum isotopes with mass numbers from 111 to 117 all have half-lives of approximately 150 ns. All unstable isotopes of molybdenum decay into isotopes of niobium, technetium, and ruthenium.\n\nAs also noted below, the most common isotopic molybdenum application involves molybdenum-99, which is a fission product. It is a parent radioisotope to the short-lived gamma-emitting daughter radioisotope technetium-99m, a nuclear isomer used in various imaging applications in medicine.\nIn 2008, the Delft University of Technology applied for a patent on the molybdenum-98-based production of molybdenum-99.Wolterbeek, Hubert Theodoor; Bode, Peter [http://worldwide.espacenet.com/publicationDetails/biblio?DBEPODOC&adjacent\ntrue&localenl_NL&FT\nD&date20110330&CC\nEP&NR2301041A1&KC\nA1 \"A process for the production of no-carrier added 99Mo\"]. European Patent EP2301041 (A1) ― 2011-03-30. Retrieved on 2012-06-27.\n\nCompounds and chemistry\n\nMolybdenum is a transition metal with an electronegativity of 2.16 on the Pauling scale and a standard atomic weight of 95.95 g/mol. It does not visibly react with oxygen or water at room temperature, and the bulk oxidation occurs at temperatures above 600 °C, resulting in molybdenum trioxide:\n\n2 Mo + 3  → 2 \n\nThe trioxide is volatile and sublimes at high temperatures. This prevents formation of a continuous protective (passivating) oxide layer, which would stop the bulk oxidation of metal. Molybdenum has several oxidation states, the most stable being +4 and +6 (bolded in the table at left). The chemistry and the compounds show more similarity to tungsten than to chromium; the instability of molybdenum(III) and tungsten(III) compounds, for example, contrasts with the stability of the chromium(III) compounds. The highest oxidation state is seen in molybdenum(VI) oxide (MoO3), while the normal sulfur compound is molybdenum disulfide MoS2.\n\nMolybdenum(VI) oxide is soluble in strong alkaline water, forming molybdates (MoO42−). Molybdates are weaker oxidants than chromates, but they show a similar tendency to form complex oxyanions by condensation at lower pH values, such as [Mo7O24]6− and [Mo8O26]4−. Polymolybdates can incorporate other ions, forming polyoxometalates. The dark-blue phosphorus-containing heteropolymolybdate P[Mo12O40]3− is used for the spectroscopic detection of phosphorus. The broad range of oxidation states of molybdenum is reflected in various molybdenum chlorides:\n* Molybdenum(II) chloride MoCl2 (yellow solid)\n* Molybdenum(III) chloride MoCl3 (dark red solid)\n* Molybdenum(IV) chloride MoCl4 (black solid)\n* Molybdenum(V) chloride MoCl5 (dark green solid)\n* Molybdenum(VI) chloride MoCl6 (brown solid)\n\nThe structure of the MoCl2 is clusters of Mo6Cl84+ and four chloride ions compensating the charge.\n\nLike chromium and some other transition metals, molybdenum forms quadruple bonds, such as in Mo2(CH3COO)4. This compound can be transformed into Mo2Cl84−, which also has a quadruple bond.\n\nThe oxidation state 0 is possible with carbon monoxide as ligand, such as in molybdenum hexacarbonyl, Mo(CO)6.\n\nHistory\n\nMolybdenite—the principal ore from which molybdenum is now extracted—was previously known as molybdena. Molybdena was confused with and often utilized as though it were graphite. Like graphite, molybdenite can be used to blacken a surface or as a solid lubricant. Even when molybdena was distinguishable from graphite, it was still confused with the common lead ore PbS (now called galena); the name comes from Ancient Greek  ', meaning lead. (The Greek word itself has been proposed as a loanword from Anatolian Luvian and Lydian languages).\n\nAlthough (reportedly) molybdenum was deliberately alloyed with steel in one 14th-century Japanese sword (mfd. ca. 1330), that art was never employed widely and was later lost.International Molybdenum Association, [https://web.archive.org/web/20130722102351/http://www.imoa.info/molybdenum/molydbenum_history.php \"Molybdenum History\"] In the West in 1754, Bengt Andersson Qvist examined a sample of molybdenite and determined that it did not contain lead and thus was not galena.\n\nBy 1778 Swedish chemist Carl Wilhelm Scheele stated firmly that molybdena was (indeed) neither galena nor graphite. Instead, Scheele correctly proposed that molybdena was an ore of a distinct new element, named molybdenum for the mineral in which it resided, and from which it might be isolated. Peter Jacob Hjelm successfully isolated molybdenum using carbon and linseed oil in 1781.\n\nFor the next century, molybdenum had no industrial use.  It was relatively scarce, the pure metal was difficult to extract, and the necessary techniques of metallurgy were immature. Early molybdenum steel alloys showed great promise of increased hardness, but efforts to manufacture the alloys on a large scale were hampered with inconsistent results, a tendency toward brittleness, and recrystallization. In 1906, William D. Coolidge filed a patent for rendering molybdenum ductile, leading to applications as a heating element for high-temperature furnaces and as a support for tungsten-filament light bulbs; oxide formation and degradation require that molybdenum be physically sealed or held in an inert gas. In 1913, Frank E. Elmore developed a froth flotation process to recover molybdenite from ores; flotation remains the primary isolation process.\n\nDuring World War I, demand for molybdenum spiked; it was used both in armor plating and as a substitute for tungsten in high speed steels. Some British tanks were protected by 75 mm (3 in) manganese steel plating, but this proved to be ineffective. The manganese steel plates were replaced with much lighter  molybdenum steel plates allowing for higher speed, greater maneuverability, and better protection. The Germans also used molybdenum-doped steel for heavy artillery, like in the super-heavy howitzer Big Bertha,[http://www.lenntech.com/periodic/elements/mo.htm Chemical properties of molibdenum - Health effects of molybdenum - Environmental effects of molybdenum]. lenntech.com\n because traditional steel melts at the temperatures produced by the propellant of the one ton shell.Sam Kean. The Disappearing Spoon. Page 88–89 After the war, demand plummeted until metallurgical advances allowed extensive development of peacetime applications. In World War II, molybdenum again saw strategic importance as a substitute for tungsten in steel alloys.\n\nOccurrence and production\n\nMolybdenum is the 54th most abundant element in the Earth's crust and the 25th most abundant element in its oceans, with an average of 10 parts per billion; it is the 42nd most abundant element in the Universe. The Russian Luna 24 mission discovered a molybdenum-bearing grain (1 × 0.6 µm) in a pyroxene fragment taken from Mare Crisium on the Moon. The comparative rarity of molybdenum in the Earth's crust is offset by its concentration in a number of water-insoluble ores, often combined with sulfur in the same way as copper, with which it is often found. Though molybdenum is found in such minerals as wulfenite (PbMoO4) and powellite (CaMoO4), the main commercial source is molybdenite (MoS2). Molybdenum is mined as a principal ore and is also recovered as a byproduct of copper and tungsten mining.\n\nThe world's production of molybdenum was 250,000 tonnes in 2011, the largest producers being China (94,000 t), the United States (64,000 t), Chile (38,000 t), Peru (18,000 t) and Mexico (12,000 t). The total reserves are estimated at 10 million tonnes, and are mostly concentrated in China (4.3 Mt), the US (2.7 Mt) and Chile (1.2 Mt). By continent, 93% of world molybdenum production is about evenly shared between North America, South America (mainly in Chile), and China. Europe and the rest of Asia (mostly Armenia, Russia, Iran and Mongolia) produce the remainder.\n\nIn molybdenite processing, the ore is first roasted in air at a temperature of 700 °C.  The process gives gaseous sulfur dioxide and the  molybdenum(VI) oxide:\n\n2 MoS2 + 7 O2 → 2 MoO3 +  4 SO2\n\nThe oxidized ore is then usually extracted with aqueous ammonia to give ammonium molybdate:\nMoO3 + 2 NH3  +  H2O  →  (NH4)2(MoO4)\nCopper, an impurity in molybdenite, is less soluble in ammonia. To completely remove it from the solution, it is precipitated with hydrogen sulfide.  Ammonium molybdate converts to ammonium dimolybdate, which is isolated as a solid.  Heating this solid gives molybdenum trioxide:Sebenik, Roger F. et al. (2005) \"Molybdenum and Molybdenum Compounds\" in Ullmann's Encyclopedia of Chemical Technology. Wiley-VCH, Weinheim. \n(NH4)2Mo2O7   →   2 MoO3  +  2 NH3  +  H2O\nCrude trioxide can be further purified by sublimation at 1100 °C.\n\nMetallic molybdenum is produced by reduction of the oxide with hydrogen:\nMoO3   +  3 H2  →   Mo  +  3 H2O\n\nThe molybdenum for steel production is reduced by the aluminothermic reaction with addition of iron to produce ferromolybdenum. A common form of ferromolybdenum contains 60% molybdenum.\n\nMolybdenum had a value of approximately $30,000 per tonne as of August 2009. It maintained a price at or near $10,000 per tonne from 1997 through 2003, and reached a peak of $103,000 per tonne in June 2005. In 2008, the London Metal Exchange announced that molybdenum would be traded as a commodity.\n\nHistory of molybdenum mining\n\nHistorically, the Knaben mine in southern Norway, opened in 1885, was the first dedicated molybdenum mine. It was closed in 1973 but was reopened in 2007. and now produces  of molybdenum disulfide per year. Large mines in Colorado (such as the Henderson mine and the Climax mine) and in British Columbia yield molybdenite as their primary product, while many porphyry copper deposits such as the Bingham Canyon Mine in Utah and the Chuquicamata mine in northern Chile produce molybdenum as a byproduct of copper mining.\n\nApplications\n\nAlloys\n\nAbout 86% of molybdenum produced is used in metallurgy, with the rest used in chemical applications. The estimated global use is structural steel 35%, stainless steel 25%, chemicals 14%, tool & high-speed steels 9%, cast iron 6%, molybdenum elemental metal 6%, and superalloys 5%.[https://web.archive.org/web/20120310004452/http://www.lme.com/minormetals/6782.asp Pie chart of world Mo uses]. London Metal Exchange.\n\nMolybdenum can withstand extreme temperatures without significantly expanding or softening, making it useful in environments of intense heat, including military armor, aircraft parts, electrical contacts, industrial motors, and filaments.\n\nMost high-strength steel alloys (for example, 41xx steels) contain 0.25% to 8% molybdenum. Even in these small portions, more than 43,000 tonnes of molybdenum are used each year in stainless steels, tool steels, cast irons, and high-temperature superalloys.\n\nMolybdenum is also valued in steel alloys for its high corrosion resistance and weldability. Molybdenum contributes corrosion resistance to type-300 stainless steels (specifically type-316) and especially so in the so-called superaustenitic stainless steels (such as alloy AL-6XN, 254SMO and 1925hMo). Molybdenum increases lattice strain, thus increasing the energy required to dissolve iron atoms from the surface. Molybdenum is also used to enhance the corrosion resistance of ferritic (for example grade 444) and martensitic (for example 1.4122 and 1.4418) stainless steels.\n\nBecause of its lower density and more stable price, molybdenum is sometimes used in place of tungsten. An example is the 'M' series of high-speed steels such as M2, M4 and M42 as substitution for the 'T' steel series, which contain tungsten. Molybdenum can also be used as a flame-resistant coating for other metals. Although its melting point is 2623 °C, molybdenum rapidly oxidizes at temperatures above 760 °C making it better-suited for use in vacuum environments.\n\nTZM (Mo (~99%), Ti (~0.5%), Zr (~0.08%) and some C) is a corrosion-resisting molybdenum superalloy that resists molten fluoride salts at temperatures above 1300 °C. It has about twice the strength of pure Mo, and is more ductile and more weldable, yet in tests it resisted corrosion of a standard eutectic salt (FLiBe) and salt vapors used in molten salt reactors for 1100 hours with so little corrosion that it was difficult to measure.\n\nOther molybdenum-based alloys that do not contain iron have only limited applications. For example, because of its resistance to molten zinc, both pure molybdenum and molybdenum-tungsten alloys (70%/30%) are used for piping, stirrers and pump impellers that come into contact with molten zinc.\n\nOther applications as a pure element\n\n* Molybdenum powder is used as a fertilizer for some plants, such as cauliflower\n* Elemental molybdenum is used in NO, NO2, NOx analyzers in power plants for pollution controls. At 350 °C, the element acts as a catalyst for NO2/NOx to form NO molecules for detection by infrared light.\n* Molybdenum anodes replace tungsten in certain low voltage X-ray sources for specialized uses such as mammography\n* The radioactive isotope molybdenum-99 is used to generate technetium-99m, used for medical imagingGray, Theodore (2009). The Elements. Black Dog & Leventhal. pp. 105–107. .\n\nCompounds (14% of global use)\n\n* Molybdenum disulfide (MoS2) is used as a solid lubricant and a high-pressure high-temperature (HPHT) antiwear agent. It forms strong films on metallic surfaces and is a common additive to HPHT greases — in the event of a catastrophic grease failure, a thin layer of molybdenum prevents contact of the lubricated parts. It also has semiconducting properties with distinct advantages over traditional silicon or graphene in electronics applications. MoS2 is also used as a catalyst in hydrocracking of petroleum fractions containing nitrogen, sulfur and oxygen.\n* Molybdenum disilicide (MoSi2) is an electrically conducting ceramic with primary use in heating elements operating at temperatures above 1500 °C in air.\n* Molybdenum trioxide (MoO3) is used as an adhesive between enamels and metals. Lead molybdate (wulfenite) co-precipitated with lead chromate and lead sulfate is a bright-orange pigment used with ceramics and plastics.[http://www.imoa.info/ International Molybdenum Association]. imoa.info.\n* The molybdenum-based mixed oxides are versatile catalysts in the chemical industry. Some examples are the catalysts for the selective oxidation of propylene to acrolein and acrylic acid, the ammoxidation of propylene to acrylonitrile. Suitable catalysts and process for the direct selective oxidation of propane to acrylic acid are being researched.\n* Ammonium heptamolybdate is used in biological staining.\n* Molybdenum coated soda lime glass is used in CIGS solar cells\n* Phosphomolybdic acid is a stain used in thin layer chromatography\n* Molybdenum-99 is a parent radioisotope of the daughter radioisotope technetium-99m, used in many medical procedures. The isotope is handled and stored as the molybdate.\n\nBiological role\n\nNitrogenases \n\nThe most important role of molybdenum in living organisms is as a metal heteroatom at the active site in certain enzymes. electronic-book   electronic-\n\n In bacterial nitrogen fixation, the nitrogenase enzyme involved in the terminal step of reducing molecular nitrogen usually contains molybdenum in the active site (though replacement of molybdenum with iron or vanadium is also known). The structure of the catalytic center of the enzyme is similar to that in iron-sulfur proteins: it incorporates a Fe4S3 and multiple MoFe3S3 clusters.The oxidation state of Mo in these clusters is less than in non-nitrogenase molybdenum cofactor enzymes. The oxidation state of Mo in these nitrogenases was formerly thought Mo(V), then Mo(IV), but more recent evidence is for Mo(III)[https://www.ncbi.nlm.nih.gov/pmc/articles/PMC4510703/ ].\n\nThe reaction that nitrogenase enzymes perform is:\n\n \\mathrm{N_2 + 8 \\ H^+ + 8 \\ e^- + 16 \\ ATP + 16 \\ H_2O \\longrightarrow 2 \\ NH_3 + H_2 + 16 \\ ADP + 16 \\ P_i} \n\nWith protons and electrons from the electron transport chain, nitrogen is reduced to ammonia and free hydrogen gas. This is an energy-using process, requiring the splitting (hydrolysis) of ATP into ADP plus free phosphate (Pi).\n\nIn 2008, evidence was reported that a scarcity of molybdenum in the Earth's early oceans was a limiting factor for nearly two billion years in the further evolution of eukaryotic life (which includes all plants and animals).  The chain of causation is as follows:\n# The relative lack of oxygen in the early ocean resulted in a scarcity in dissolved molybdenum. Most molybdenum compounds have low solubility in water, but the molybdate ion MoO42− is soluble and forms when molybdenum-containing minerals are in contact with oxygen and water.\n# The lack of dissolved molybdenum limited the growth of prokaryotic nitrogen-fixing bacteria, which require molybdenum-bearing enzymes for the process\n# The lack of prokaryotic nitrogen-fixing bacteria limited the growth of ocean eukaryotes, which require oxidized nitrogen suitable for the production of organic nitrogen compounds or the organics themselves (like proteins) from prokaryotic bacteria.\nHowever, once oxygen had been created in seawater by the limited eukaryotes, it reacted with water and the molybdenum in minerals on the sea bottom to produce soluble molybdate, making it available to nitrogen-fixing bacteria.  Those bacteria provided fixed usable nitrogen compounds for higher forms of life.\n\nAlthough oxygen once promoted nitrogen fixation by making molybdenum available in water, it also directly poisons nitrogenase enzymes. Thus, in Earth's ancient history, after oxygen arrived in large quantities in Earth's air and water, organisms that continued to fix nitrogen in aerobic conditions isolated and protected their nitrogen-fixing enzymes from too much oxygen in heterocysts or equivalent structures. This structural isolation of nitrogen fixation reactions in most aerobic organisms continues to the present, but is not quite universal. Trichodesmium (a cyanobacterial photosynthetic diazotroph) perhaps the most important marine nitrogen fixing organism  is the only known diazotroph able to fix nitrogen in daylight under aerobic conditions without the use of heterocysts.\n\nMolybdenum cofactor enzymes \n\nThough molybdenum forms compounds with various organic molecules, including carbohydrates and amino acids, it is transported throughout the human body as fully oxidized MoO42−. At least 50 molybdenum-containing enzymes were known by 2002, mostly in bacteria, and the number is increasing with every year; those enzymes include aldehyde oxidase, sulfite oxidase and xanthine oxidase. In some animals, and in humans, the oxidation of xanthine to uric acid, a process of purine catabolism, is catalyzed by xanthine oxidase, a molybdenum-containing enzyme. The activity of xanthine oxidase is directly proportional to the amount of molybdenum in the body. However, an extremely high concentration of molybdenum reverses the trend and can act as an inhibitor in both purine catabolism and other processes. Molybdenum concentration also affects protein synthesis, metabolism, and growth.\n\nIn animals and plants, a tricyclic compound called molybdopterin (which, despite the name, contains no molybdenum) is reacted with molybdate to form a complete molybdenum-containing cofactor called molybdenum cofactor. Other than the phylogenetically-ancient nitrogenases (discussed above) that fix nitrogen in some bacteria and cyanobacteria, all molybdenum-using enzymes (so far identified) use the molybdenum cofactor, where molybdenum is in the oxidation state of VI, similar to molybdate.. Summarized in [http://pathway.gramene.org/META/NEW-IMAGE?typeCOMPOUND&object\nCPD-4 MetaCyc Compound: molybdopterin]. Accessed Nov. 16, 2009. Molybdenum enzymes in plants and animals catalyze the oxidation and sometimes reduction of certain small molecules in the process of regulating nitrogen, sulfur, and carbon.\n\nHuman metabolism and deficiency\n\nMolybdenum is an essential trace dietary element. Four mammalian Mo-dependent enzymes are known, all of them harboring a pterin-based molybdenum cofactor (Moco) in their active site: sulfite oxidase, xanthine oxidoreductase, aldehyde oxidase, and mitochondrial amidoxime reductase.  People severely deficient in molybdenum have poorly functioning sulfite oxidase and are prone to toxic reactions to sulfites in foods.Blaylock Wellness Report, February 2010, page 3. The human body contains about 0.07 mg of molybdenum per kilogram of body weight, with higher concentrations in the liver and kidneys and in lower in the vertebrae. Molybdenum is also present within human tooth enamel and may help prevent its decay.\n\nAcute toxicity has not been seen in humans, and the toxicity depends strongly on the chemical state. Studies on rats show a median lethal dose (LD50) as low as 180 mg/kg for some Mo compounds. Although human toxicity data is unavailable, animal studies have shown that chronic ingestion of more than 10 mg/day of molybdenum can cause diarrhea, growth retardation, infertility, low birth weight, and gout; it can also affect the lungs, kidneys, and liver. Sodium tungstate is a competitive inhibitor of molybdenum. Dietary tungsten reduces the concentration of molybdenum in tissues.\n\nLow soil concentration of molybdenum in a geographical band from northern China to Iran results in a general dietary molybdenum deficiency, and is associated with increased rates of esophageal cancer. Compared to the United States, which has a greater supply of molybdenum in the soil, people living in those areas have about 16 times greater risk for esophageal squamous cell carcinoma.\n\nMolybdenum deficiency has also been reported as a consequence of non-molybdenum supplemented total parenteral nutrition (complete intravenous feeding) for long periods of time. It results in high blood levels of sulfite and urate, in much the same way as molybdenum cofactor deficiency. However (presumably since pure molybdenum deficiency from this cause occurs primarily in adults), the neurological consequences are not as marked as in cases of congenital cofactor deficiency.\n\nRelated diseases\n\nA congenital molybdenum cofactor deficiency disease, seen in infants, is an inability to synthesize molybdenum cofactor, the heterocyclic molecule discussed above that binds molybdenum at the active site in all known human enzymes that use molybdenum.  The resulting deficiency results in high levels of sulfite and urate, and neurological damage.\n\nCopper-molybdenum antagonism\n\nHigh levels of molybdenum can interfere with the body's uptake of copper, producing copper deficiency. Molybdenum prevents plasma proteins from binding to copper, and it also increases the amount of copper that is excreted in urine. Ruminants that consume high levels of molybdenum suffer from diarrhea, stunted growth, anemia, and achromotrichia (loss of fur pigment). These symptoms can be alleviated by copper supplements, either dietary and injection. The effective copper deficiency can be aggravated by excess sulfur.Hauer, Gerald [http://www.bisoncentre.com/index.php?optioncom_content&view\narticle&id59&Itemid\n256 Copper deficiency in cattle]. Bison Producers of Alberta. Accessed Dec. 16, 2010.\n\nCopper reduction or deficiency can also be deliberately induced for therapeutic purposes by the compound ammonium tetrathiomolybdate, in which the bright red anion tetrathiomolybdate is the copper-chelating agent. Tetrathiomolybdate was first used therapeutically in the treatment of copper toxicosis in animals. It was then introduced as a treatment in Wilson's disease, a hereditary copper metabolism disorder in humans; it acts both by competing with copper absorption in the bowel and by increasing excretion. It has also been found to have an inhibitory effect on angiogenesis, potentially by inhibiting the membrane translocation process that is dependent on copper ions. This is a promising avenue for investigation of treatments for cancer, age-related macular degeneration, and other diseases that involve a pathologic proliferation of blood vessels.\n\nDietary recommendations\n\nThe U.S. Institute of Medicine (IOM) updated Estimated Average Requirements (EARs) and Recommended Dietary Allowances (RDAs) for molybdenum in 2000. If there is not sufficient information to establish EARs and RDAs, an estimate designated Adequate Intake (AI) is used instead. The current EAR for molybdenum for people ages 19 and up is 34 μg/day. The RDA is 45 μg/day. RDAs are higher than EARs so as to identify amounts that will cover people with higher than average requirements. RDA for pregnancy is 50 μg/day. RDA for lactation is 50 μg/day. For children ages 1–18 years the RDA increases with age from 17 to 43 μg/day. As for safety, the IOM sets Tolerable upper intake levels (ULs) for vitamins and minerals when evidence is sufficient. In the case of molybdenum the UL is 2000 μg/day. Collectively the EARs, RDAs, AIs and ULs are referred to as Dietary Reference Intakes (DRIs).\n\nThe European Food Safety Authority (EFSA) refers to the collective set of information as Dietary Reference Values, with Population Reference Intake (PRI) instead of RDA, and Average Requirement instead of EAR. AI and UL defined the same as in United States. For women and men ages 15 and older the AI is set at 65 μg/day. AI for pregnancy is 65 μg/day, for lactation also 65 μg/day. For children ages 1–14 years the AIs increase with age from 15 to 45 μg/day. The adult AIs are higher than the U.S. RDAs. The European Food Safety Authority reviewed the same safety question and set its UL at 600 μg/day, which is much lower than the U.S. value.\n\nFor U.S. food and dietary supplement labeling purposes the amount in a serving is expressed as a percent of Daily Value (%DV). For molybdenum labeling purposes 100% of the Daily Value was 75 μg, but as of May 27, 2016 it was revised to 45 μg. A table of the old and new adult Daily Values is provided at Reference Daily Intake. The original deadline to be in compliance was July 28, 2018, but on September 29, 2017 the FDA released a proposed rule that extended the deadline to January 1, 2020 for large companies and January 1, 2021 for small companies. [https://www.fda.gov/Food/GuidanceRegulation/GuidanceDocumentsRegulatoryInformation/LabelingNutrition/ucm385663.htm#dates \"Changes to the Nutrition Facts Panel - Compliance Date\"]\n\nFood sources\n\nAverage daily intake varies between 120 and 240 μg/day, which is higher than dietary recommendations. Pork, lamb, and beef liver each have approximately 1.5 parts per million of molybdenum. Other significant dietary sources include green beans, eggs, sunflower seeds, wheat flour, lentils, cucumbers and cereal grain.\n\nPrecautions\n\nMolybdenum dusts and fumes, generated by mining or metalworking, can be toxic, especially if ingested (including dust trapped in the sinuses and later swallowed). Low levels of prolonged exposure can cause irritation to the eyes and skin. Direct inhalation or ingestion of molybdenum and its oxides should be avoided. OSHA regulations specify the maximum permissible molybdenum exposure in an 8-hour day as 5 mg/m3. Chronic exposure to 60 to 600 mg/m3 can cause symptoms including fatigue, headaches and joint pains. At levels of 5000 mg/m3, molybdenum is immediately dangerous to life and health. Molybdenum. http://en.wikipedia.org/?curid=19052."
  }
}
