{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19459",
  "eid" : "3b09bb70-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778608295,
  "textBody" : "Events\n\n* 919 – The nobles of Franconia and Saxony elect Henry the Fowler at the Imperial Diet in Fritzlar as king of the East Frankish Kingdom.\n*1218 – The Fifth Crusade leaves Acre for Egypt.\n*1276 – Magnus Ladulås is crowned King of Sweden in Uppsala Cathedral.\n*1487 – The ten-year-old Lambert Simnel is crowned in Christ Church Cathedral, Dublin, Ireland, with the name of Edward VI in a bid to threaten King Henry VII's reign.\n*1567 – Erik XIV of Sweden and his guards murder five incarcerated Swedish nobles.\n*1595 – Nomenclator of Leiden University Library appears, the first printed catalog of an institutional library.\n*1607 – 100 English settlers disembark in Jamestown, the first English colony in America.\n*1621 – The Protestant Union is formally dissolved.\n*1626 – Peter Minuit buys Manhattan.\n*1667 – The French Royal Army crosses the border into the Spanish Netherlands, starting the War of Devolution opposing France to the Spanish Empire and the Triple Alliance.\n*1683 – The Ashmolean Museum in Oxford, England, opens as the world's first university museum.\n*1689 – The English Parliament passes the Act of Toleration protecting dissenting Protestants but excluding Roman Catholics.\n*1738 – John Wesley is converted, essentially launching the Methodist movement; the day is celebrated annually by Methodists as Aldersgate Day and a church service is generally held on the preceding Sunday.\n*1798 – The Irish Rebellion of 1798 led by the United Irishmen against British rule begins.\n*1813 – South American independence leader Simón Bolívar enters Mérida, leading the invasion of Venezuela, and is proclaimed El Libertador (\"The Liberator\").\n*1822 – Battle of Pichincha: Antonio José de Sucre secures the independence of the Presidency of Quito.\n*1830 – \"Mary Had a Little Lamb\" by Sarah Josepha Hale is published.\n*1832 – The First Kingdom of Greece is declared in the London Conference.\n*1844 – Samuel Morse sends the message \"What hath God wrought\" (a biblical quotation, Numbers 23:23) from the Old Supreme Court Chamber in the United States Capitol to his assistant, Alfred Vail, in Baltimore, Maryland, to inaugurate a commercial telegraph line between Baltimore and Washington D.C.\n*1856 – John Brown and his men kill five slavery supporters at Pottawatomie Creek, Kansas.\n*1861 – American Civil War: Union troops occupy Alexandria, Virginia.\n*1883 – The Brooklyn Bridge in New York City is opened to traffic after 14 years of construction.\n*1900 – Second Boer War: The United Kingdom annexes the Orange Free State.\n*1915 – World War I: Italy declares war on Austria-Hungary, joining the conflict on the side of the Allies.\n*1930 – Amy Johnson lands in Darwin, Northern Territory, becoming the first woman to fly solo from England to Australia (she left on May 5 for the 11,000 mile flight).\n*1935 – The first night game in Major League Baseball history is played in Cincinnati, Ohio, with the Cincinnati Reds beating the Philadelphia Phillies 2–1 at Crosley Field.\n*1940 – Igor Sikorsky performs the first successful single-rotor helicopter flight.\n*  1940   – Acting on the orders of Soviet leader Joseph Stalin, NKVD agent Iosif Grigulevich orchestrates an unsuccessful assassination attempt on exiled Russian revolutionary Leon Trotsky in Coyoacán, Mexico.\n*1941 – World War II: In the Battle of the Atlantic, the German Battleship Bismarck sinks then-pride of the Royal Navy, , killing all but three crewmen.\n*1948 – Arab–Israeli War: Egypt captures the Israeli kibbutz of Yad Mordechai, but the five-day effort gives Israeli forces time to prepare enough to stop the Egyptian advance a week later.\n*1956 – The first Eurovision Song Contest is held in Lugano, Switzerland.\n*1958 – United Press International is formed through a merger of the United Press and the International News Service.\n*1960 – Following the 1960 Valdivia earthquake, the largest ever recorded earthquake, Cordón Caulle begins to erupt.\n*1961 – American civil rights movement: Freedom Riders are arrested in Jackson, Mississippi, for \"disturbing the peace\" after disembarking from their bus.\n*1962 – Project Mercury: American astronaut Scott Carpenter orbits the Earth three times in the Aurora 7 space capsule.\n*1967 – Egypt imposes a blockade and siege of the Red Sea coast of Israel.\n*1976 – The Judgment of Paris takes place in France, launching California as a worldwide force in the production of quality wine.\n*1981 – Ecuadorian president Jaime Roldós Aguilera, his wife, and his presidential committee die in an aircraft accident while travelling from Quito to Zapotillo minutes after the president gave a famous speech regarding the 24 de mayo anniversary of the Battle of Pichincha.\n*1982 – Liberation of Khorramshahr: Iranians recapture of the port city of Khorramshahr from the Iraqis during the Iran–Iraq War.\n*1988 – Section 28 of the United Kingdom's Local Government Act 1988, a controversial amendment stating that a local authority cannot intentionally promote homosexuality, is enacted.\n*1991 – Israel conducts Operation Solomon, evacuating Ethiopian Jews to Israel.\n*1992 – The last Thai dictator, General Suchinda Kraprayoon, resigns following pro-democracy protests.\n*  1992   – The ethnic cleansing in Kozarac, Bosnia and Herzegovina begins when Serbian militia and police forces enter the town.\n*1993 – Eritrea gains its independence from Ethiopia.\n*1994 – Four men convicted of bombing the World Trade Center in New York in 1993 are each sentenced to 240 years in prison.\n*1999 – The International Criminal Tribunal for the former Yugoslavia in The Hague, Netherlands indicts Slobodan Milošević and four others for war crimes and crimes against humanity committed in Kosovo.\n*2000 – Israeli troops withdraw from southern Lebanon after 22 years of occupation.\n*2002 – Russia and the United States sign the Moscow Treaty.\n*2014 – A 6.4 magnitude earthquake occurs in the Aegean Sea between Greece and Turkey, injuring 324 people.\n*  2014   – At least three people are killed in a shooting at Brussels' Jewish Museum of Belgium.\n\nBirths\n\n*15 BC – Germanicus, Roman general (d. 19)\n*1335 – Margaret of Bohemia, Queen of Hungary (d. 1349)\n*1494 – Pontormo, Italian painter (d. 1557)\n*1522 – John Jewel, English bishop (d. 1571)\n*1544 – William Gilbert, English physician, physicist, and astronomer (d. 1603)\n*1576 – Elizabeth Carey, Lady Berkeley, English courtier (d. 1635)\n*1616 – John Maitland, 1st Duke of Lauderdale, Scottish politician, Secretary of State, Scotland (d. 1682)\n*1628 – Marek Sobieski, Polish noble (d. 1652)\n*1669 – Emerentia von Düben, Swedish royal favorite (d. 1743)\n*1671 – Gian Gastone de' Medici, Grand Duke of Tuscany (d. 1737)\n*1686 – Daniel Gabriel Fahrenheit, Polish-German physicist and engineer, developed the Fahrenheit scale (d. 1736)\n*1689 – Daniel Finch, 8th Earl of Winchilsea, English politician, Lord President of the Council (d. 1769)\n*1743 – Jean-Paul Marat, Swiss-French physician, journalist, and politician (d. 1793)\n*1794 – William Whewell, English priest and philosopher (d. 1866)\n*1803 – Alexander von Nordmann, Finnish biologist and paleontologist (d. 1866)\n*1810 – Abraham Geiger, German rabbi and scholar (d. 1874)\n*1816 – Emanuel Leutze, German-American painter (d. 1868)\n*1819 – Queen Victoria of the United Kingdom (d. 1901)\n*1830 – Alexei Savrasov, Russian painter and academic (d. 1897)\n*1855 – Arthur Wing Pinero, English actor, director, and playwright (d. 1934)\n*1861 – Gerald Strickland, 1st Baron Strickland, Maltese lawyer and politician, 4th Prime Minister of Malta (d. 1940)\n*1863 – George Grey Barnard, American sculptor (d. 1938)\n*1868 – Charlie Taylor, American engineer and mechanic (d. 1956)\n*1870 – Benjamin N. Cardozo, American lawyer and judge (d. 1938)\n*  1870   – Jan Smuts, South African lawyer and politician, 2nd Prime Minister of South Africa (d. 1950)\n*1874 – Princess Marie of Hesse and by Rhine (d. 1878)\n*1875 – Robert Garrett, American discus thrower and shot putter (d. 1961)\n*1878 – Lillian Moller Gilbreth, American psychologist and engineer (d. 1972)\n*1879 – H. B. Reese, American candy maker, created Reese's Peanut Butter Cups (d. 1956)\n*1886 – Paul Paray, French organist, composer, and conductor (d. 1979)\n*1887 – Mick Mannock, Irish soldier and pilot, Victoria Cross recipient (d. 1918)\n*1891 – William F. Albright, American archaeologist, philologist, and scholar (d. 1971)\n*1895 – Samuel Irving Newhouse Sr., American publisher, founded Advance Publications (d. 1979)\n*1899 – Suzanne Lenglen, French tennis player (d. 1938)\n*  1899   – Henri Michaux, Belgian-French poet and painter (d. 1984)\n*1900 – Eduardo De Filippo, Italian actor and screenwriter (d. 1984)\n*1901 – José Nasazzi, Uruguayan footballer and manager (d. 1968)\n*1902 – Lionel Conacher, Canadian football player and politician (d. 1954)\n*  1902   – Sylvia Daoust, Canadian sculptor (d. 2004)\n*1905 – Mikhail Sholokhov, Russian novelist and short story writer, Nobel Prize laureate (d. 1984)\n*1909 – Wilbur Mills, American banker and politician (d. 1992)\n*1910 – Jimmy Demaret, American golfer (d. 1983)\n*1913 – Joe Abreu, American baseball player and soldier (d. 1993)\n*1914 – Lilli Palmer, German-American actress (d. 1986)\n*1916 – Roden Cutler, Australian lieutenant and politician, 32nd Governor of New South Wales (d. 2002)\n*1917 – Alan Campbell, Baron Campbell of Alloway, English lawyer and judge (d. 2013)\n*1918 – Coleman Young, American politician, 66th Mayor of Detroit (d. 1997)\n*1923 – Siobhán McKenna, Irish actress (d. 1986)\n*1924 – Philip Pearlstein, American soldier and painter\n*1925 – Carmine Infantino, American illustrator and educator (d. 2013)\n*  1925   – Mai Zetterling, Swedish actress and director (d. 1994)\n*1926 – Stanley Baxter, Scottish actor and screenwriter\n*1928 – William Trevor, Irish novelist, playwright and short story writer (d. 2016)\n*1932 – Arnold Wesker, English playwright and producer (d. 2016)\n*1933 – Jane Byrne, American lawyer and politician, 50th Mayor of Chicago (d. 2014)\n*  1933   – Réal Giguère, Canadian television host and actor\n*  1933   – Aharon Lichtenstein, French-Israeli rabbi and author (d. 2015)\n*1935 – Joan Micklin Silver, American director and screenwriter\n*1936 – Harold Budd, American composer and poet\n*1937 – Maryvonne Dupureur, French runner and educator (d. 2008)\n*  1937   – Archie Shepp, American saxophonist and composer\n*1938 – Prince Buster, Jamaican singer-songwriter and producer \n*  1938   – Tommy Chong, Canadian-American actor, director, producer, and screenwriter\n*1940 – Joseph Brodsky, Russian-American poet and essayist, Nobel Prize laureate (d. 1996)\n*1941 – Bob Dylan, American singer-songwriter, guitarist, artist, writer, and producer; Nobel Prize laureate \n*  1941   – Patricia Hollis, Baroness Hollis of Heigham, English academic and politician\n*1942 – Ali Bacher, South African cricketer and manager\n*  1942   – Hannu Mikkola, Finnish race car driver\n*  1942   – Ichirō Ozawa, Japanese lawyer and politician, Japanese Minister of Home Affairs\n*1943 – Gary Burghoff, American actor \n*1944 – Patti LaBelle, American singer-songwriter and actress \n*  1944   – Dominique Lavanant, French actress\n*1945 – Terry Callier, American singer-songwriter and guitarist (d. 2012)\n*  1945   – Steven Norris, English engineer and politician\n*  1945   – Richard Ottaway, English lieutenant and politician, Shadow Secretary of State for Environment, Food and Rural Affairs\n*  1945   – Priscilla Presley, American actress and businesswoman\n*1946 – Tansu Çiller, Turkish economist and politician, 22nd Prime Minister of Turkey\n*  1946   – Jesualdo Ferreira, Portuguese footballer and manager \n*  1946   – Irena Szewińska, Russian-Polish sprinter\n*1947 – Albert Bouchard, American singer-songwriter, guitarist, and drummer \n*  1947   – Mike De Leon, Filipino director, producer, screenwriter and cinematographer\n*  1947   – Mike Reid, American singer-songwriter, pianist, and retired American football player\n*  1947   – Waddy Wachtel, American guitarist, singer-songwriter, and record producer \n*  1947   – Martin Winterkorn, German businessman \n*1948 – Richard Dembo, French director and screenwriter (d. 2004)\n*1949 – Jim Broadbent, English actor\n*  1953   – Alfred Molina, English actor\n*1955 – Rosanne Cash, American singer-songwriter and guitarist\n*  1955   – Philippe Lafontaine, Belgian singer and songwriter\n*  1955   – Rajesh Roshan, Indian composer\n*1956 – R. B. Bernstein, constitutional historian\n*  1956   – Larry Blackmon, American singer-songwriter and producer\n*  1956   – Dominic Grieve, English lawyer and politician, Attorney General for England and Wales\n*  1956   – Michael Jackson, Irish archbishop\n*1958 – Chip Ganassi, American race car driver, team owner and businessman\n*1959 – Pelle Lindbergh, Swedish-American ice hockey player (d. 1985)\n*  1959   – Barry O'Farrell, Australian politician, 43rd Premier of New South Wales \n*1960 – Guy Fletcher, English keyboard player, guitarist, and producer \n*  1960   – Bill Harrigan, Australian rugby league referee and sportscaster\n*  1960   – Kristin Scott Thomas, English actress\n*1961 – Lorella Cedroni, Italian philosopher and theorist (d. 2013)\n*  1961   – Alain Lemieux, Canadian-American ice hockey player and coach\n*1962 – Héctor Camacho, Puerto Rican-American boxer (d. 2012)\n*  1962   – Gene Anthony Ray, American actor, dancer, and choreographer (d. 2003)\n*1963 – Ivan Capelli, Italian race car driver and sportscaster\n*  1963   – Michael Chabon, American novelist, short story writer, and screenwriter\n*  1963   – Joe Dumars, American basketball player\n*  1963   – Rich Rodriguez, American football player and coach\n*  1963   – Valerie Taylor, American computer scientist and educator\n*1964 – Liz McColgan, Scottish educator and runner\n*  1964   – Adrian Moorhouse, English swimmer\n*  1964   – Isidro Pérez, Mexican boxer (d. 2013)\n*  1964   – Pat Verbeek, Canadian ice hockey player and manager\n*1965 – John C. Reilly, American actor\n*  1965   – Shinichirō Watanabe, Japanese director, producer, and screenwriter\n*1966 – Éric Cantona, French footballer, manager, and actor\n*  1966   – Ricky Craven, American race car driver and sportscaster\n*  1967   – Tamer Karadağlı, Turkish actor\n*1967 – Andrey Borodin, Russian-English economist and businessman\n*  1967   – Eric Close, American actor\n*  1967   – Heavy D, Jamaican-American rapper, producer, and actor (d. 2011)\n*  1967   – Carlos Hernández, Venezuelan-American baseball player and manager\n*1969 – Martin McCague, Northern Irish-English cricketer\n*  1969   – Jacob Rees-Mogg, English politician\n*  1969   – Rich Robinson, American guitarist and songwriter \n*1971 – Kris Draper, Canadian ice hockey player and manager\n*1972 – Greg Berlanti, American director, producer, and screenwriter\n*1973 – Rodrigo, Argentinian singer-songwriter (d. 2000)\n*  1973   – Bartolo Colón, Dominican-American baseball player\n*  1973   – Shirish Kunder, Indian director, producer, and screenwriter\n*  1973   – Vladimír Šmicer, Czech footballer and manager\n*1974 – Sébastien Foucan, French runner and actor\n*  1974   – Masahide Kobayashi, Japanese baseball player and coach\n*  1974   – Magnus Manske, German biochemist and computer programmer, developed MediaWiki\n*  1974   – Will Sasso, Canadian actor and comedian \n*1975 – Marc Gagnon, Canadian speed skater\n*  1975   – Giannis Goumas, Greek footballer and coach\n*  1975   – Maria Lawson, English singer-songwriter\n*1976 – Alessandro Cortini, Italian-American singer and keyboard player \n*  1976   – Catherine Cox, New Zealand-Australian netball player\n*  1976   – Silje Vige, Norwegian singer\n*1978 – Elijah Burke, American wrestler\n*  1978   – Johan Holmqvist, Swedish ice hockey player\n*  1978   – Brad Penny, American baseball player\n*  1978   – Rose, French singer, songwriter and composer\n*1979 – Tracy McGrady, American basketball player\n*  1979   – Kareem McKenzie, American football player\n*1980 – Jason Babin, American football player\n*  1980   – Anthony Minichiello, Australian rugby league player\n*1981 – Andy Lee, Australian comedian, actor, and screenwriter\n*1982 – Issah Gabriel Ahmed, Ghanaian footballer\n*  1982   – Rian Wallace, American football player\n*1983 – Custódio Castro, Portuguese footballer\n*  1983   – Pedram Javaheri, Iranian-American meteorologist and journalist\n*  1983   – Woo Seung-yeon, South Korean model and actress (d. 2009)\n*1984 – Sarah Hagan, American actress\n*  1984   – Dmitri Kruglov, Estonian footballer\n*1985 – Tim Bridgman, English race car driver\n*1986 – Mark Ballas, American singer-songwriter, guitarist, dancer, and actor \n*  1986   – Giannis Kontoes, Greek footballer\n*1987 – Déborah François, Belgian actress\n*  1987   – Guillaume Latendresse, Canadian ice hockey player\n*1988 – Artem Anisimov, Russian ice hockey player\n*  1988   – Monica Lin Brown, American sergeant\n*  1988   – Billy Gilman, American singer-songwriter\n*  1988   – Lucian Wintrich, American political artist and White House correspondent \n*1989 – Andrew Jordan, English race car driver\n*1990 – Mattias Ekholm, Swedish ice hockey player\n*1991 – Aled Davies, Welsh discus thrower\n*  1991   – Cody Eakin, Canadian ice hockey player\n*1993 – Christopher Bramell, English beauty pageant winner\n\nDeaths\n\n* 688 – Ségéne, bishop of Armagh (b. c. 610)\n*1089 – Lanfranc, Archbishop of Canterbury\n*1136 – Hugues de Payens, first Grand Master of the Knights Templar (b. c. 1070)\n*1153 – David I of Scotland (b. 1083)\n*1201 – Theobald III, Count of Champagne (b. 1179)\n*1351 – Abu al-Hasan Ali ibn Othman, Moroccan sultan (b. 1297)\n*1408 – Taejo of Joseon  (b. 1335)\n*1425 – Murdoch Stewart, 2nd Duke of Albany, Scottish politician (b. 1362)\n*1456 – Ambroise de Loré, French commander (b. 1396)\n*1543 – Nicolaus Copernicus, Polish mathematician and astronomer (b. 1473)\n*1612 – Robert Cecil, 1st Earl of Salisbury, English politician, Lord High Treasurer (b. 1563)\n*1627 – Luis de Góngora, Spanish poet and cleric (b. 1561)\n*1632 – Robert Hues, English mathematician and geographer (b. 1553)\n*1734 – Georg Ernst Stahl, German physician and chemist (b. 1660)\n*1792 – George Brydges Rodney, 1st Baron Rodney, English admiral and politician, 16th Governor of Newfoundland (b. 1718)\n*1806 – John Campbell, 5th Duke of Argyll, Scottish field marshal and politician, Lord Lieutenant of Argyllshire (b. 1723)\n*1843 – Sylvestre François Lacroix, French mathematician and academic (b. 1765)\n*1861 – Elmer E. Ellsworth, American colonel (b. 1837)\n*1872 – Julius Schnorr von Carolsfeld, German painter and illustrator (b. 1794)\n*1879 – William Lloyd Garrison, American journalist and activist (b. 1805)\n*1881 – Samuel Palmer, English painter and illustrator (b. 1805)\n*1901 – Louis-Zéphirin Moreau, Canadian bishop (b. 1824)\n*1908 – Old Tom Morris, Scottish golfer and architect (b. 1821)\n*1915 – John Condon, Irish-English soldier (b. 1896)\n*1919 – Amado Nervo, Mexican poet, journalist, and educator (b. 1870)\n*1941 – Lancelot Holland, English admiral (b. 1887)\n*1945 – Robert Ritter von Greim, German field marshal and pilot (b. 1892)\n*1948 – Jacques Feyder, Belgian actor, director, and screenwriter (b. 1885)\n*1949 – Alexey Shchusev, Russian architect, designed Lenin's Mausoleum and Moscow Kazanskaya railway station (b. 1873)\n*1950 – Archibald Wavell, 1st Earl Wavell, English field marshal and politician, 43rd Governor-General of India (b. 1883)\n*1951 – Thomas N. Heffron, American actor, director, screenwriter (b. 1872)\n*1958 – Frank Rowe, Australian public servant (b. 1895)\n*1959 – John Foster Dulles, American soldier, lawyer, and politician, 52nd United States Secretary of State (b. 1888) \n*1963 – Elmore James, American singer-songwriter and guitarist (b. 1918)\n*1965 – Sonny Boy Williamson II, American singer-songwriter and harmonica player (b. 1908)\n*1974 – Duke Ellington, American pianist and composer (b. 1899)\n*1976 – Denise Pelletier, Canadian actress (b. 1923)\n*1979 – Ernest Bullock, English organist, composer, and educator (b. 1890)\n*1981 – Herbert Müller, Swiss race car driver (b. 1940)\n*1984 – Vince McMahon Sr., American wrestling promoter and businessman, founded WWE (b. 1914)\n*1988 – Freddie Frith, English motorcycle road racer (b. 1909)\n*1990 – Arthur Villeneuve, Canadian painter (b. 1910)\n*1991 – Gene Clark, American singer-songwriter and guitarist  (b. 1944)\n*1992 – Hitoshi Ogawa, Japanese race car driver (b. 1956)\n*1995 – Harold Wilson, English academic and politician, Prime Minister of the United Kingdom (b. 1916)\n*1996 – Enrique Álvarez Félix, Mexican actor (b. 1934)\n*  1996   – Joseph Mitchell, American journalist and author (b. 1908)\n*1997 – Edward Mulhare, Irish actor (b. 1923)\n*2000 – Kurt Schork, American journalist and scholar (b. 1947)\n*  2000   – Majrooh Sultanpuri, Indian poet and songwriter (b. 1919)\n*2002 – Wallace Markfield, American author (b. 1926)\n*2003 – Rachel Kempson, English actress (b. 1910) \n*2004 – Henry Ries, German-American photographer (b. 1917)\n*  2004   – Milton Shulman, Canadian author and critic (b. 1913)\n*  2004   – Edward Wagenknecht, American critic and educator (b. 1900)\n*2005 – Carl Amery, German activist and author (b. 1922)\n*  2005   – Arthur Haulot, Belgian journalist and poet (b. 1913)\n*  2005   – Guy Tardif, Canadian academic and politician (b. 1935)\n*2006 – Henry Bumstead, American art director and production designer (b. 1915)\n*  2006   – Claude Piéplu, French actor (b. 1923)\n*  2006   – Michał Życzkowski, Polish technician and educator (b. 1930)\n*2008 – Dick Martin, American actor, comedian, and director (b. 1922)\n*  2008   – Jimmy McGriff, American organist and bandleader (b. 1936)\n*2009 – Jay Bennett, American singer-songwriter, guitarist, and producer (b. 1963)\n*2010 – Ray Alan, English ventriloquist, actor, and screenwriter (b. 1930)\n*  2010   – Paul Gray, American bass player and songwriter (b. 1972)\n*  2010   – Raymond V. Haysbert, American businessman and activist (b. 1920) \n*  2010   – Petr Muk, Czech singer-songwriter and guitarist (b. 1965)\n*  2010   – Anneliese Rothenberger, German soprano and actress (b. 1926)\n*2011 – Huguette Clark, American heiress, painter, and philanthropist (b. 1906)\n*  2011   – Hakim Ali Zardari Indian-Pakistani businessman and politician (b. 1930)\n*2012 – Klaas Carel Faber Dutch-German SS officer (b. 1922)\n*  2012   – Kathi Kamen Goldmark, American journalist and author (b. 1948)\n*  2012   – Jacqueline Harpman, Belgian psychoanalyst and author (b. 1929)\n*  2012   – Juan Francisco Lombardo, Argentinian footballer (b. 1925)\n*  2012   – Lee Rich, American production manager and producer (b. 1918)\n*2013 – Helmut Braunlich, German-American violinist and composer (b. 1929)\n*  2013   – Ron Davies, Welsh footballer (b. 1942)\n*  2013   – Gotthard Graubner, German painter (b. 1930)\n*  2013   – Haynes Johnson, American journalist and author (b. 1931)\n*  2013   – Pyotr Todorovsky, Ukrainian-Russian director and screenwriter (b. 1925)\n*2014 – David Allen, English cricketer (b. 1935)\n*  2014   – Mahafarid Amir Khosravi, Iranian businessman (b. 1969)\n*  2014   – Knowlton Nash, Canadian journalist and author (b. 1927)\n*  2014   – John Vasconcellos, American lieutenant, lawyer, and politician (b. 1932)\n*2015 – Dean Carroll, English rugby player (b. 1962)\n*  2015   – Kenneth Jacobs, Australian lawyer and judge (b. 1917)\n*  2015   – Tanith Lee, English author (b. 1947)\n\nHolidays and observances\n\n* Feast of Mary Help of Christians (Roman Catholicism)\n*Aldersgate Day/Wesley Day (Methodism)\n*Battle of Pichincha Day (Ecuador)\n*Bermuda Day (Bermuda), celebrated on the nearest weekday if May 24 falls on the weekend.\n*Christian feast day:\n**Anna Pak Agi (one of The Korean Martyrs)\n**David I of Scotland\n**Donatian and Rogatian\n**Jackson Kemper (Episcopal Church)\n**Joanna\n**Mary, Help of Christians\n**Sarah (celebrated by the Romani people of Camargue)\n**Vincent of Lérins\n**May 24 (Eastern Orthodox liturgics)\n*Commonwealth Day (Belize)\n*Earliest day on which El Colacho tradition can fall, while June 27 is the latest; celebrated on Sunday after Corpus Christi. (Castrillo de Murcia, near Burgos) \n*Independence Day (Eritrea), celebrates the independence of Eritrea from Ethiopia in 1993.\n*Lubiri Memorial Day (Buganda)\n*Saints Cyril and Methodius Day (Eastern Orthodox Church) and its related observance: \n**Bulgarian Education and Culture and Slavonic Literature Day (Bulgaria)\n**Saints Cyril and Methodius, Slavonic Enlighteners' Day (Republic of Macedonia)\n*Victoria Day; celebrated on Monday on or before May 24. (Canada), and its related observance:\n**National Patriots' Day or Journée nationale des patriotes (Quebec)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "May 24" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19459" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 919 – The nobles of Franconia and Saxony elect Henry the Fowler at the Imperial Diet in Fritzlar as king of the East Frankish Kingdom.\n*1218 – The Fifth Crusade leaves Acre for Egypt.\n*1276 – Magnus Ladulås is crowned King of Sweden in Uppsala Cathedral.\n*1487 – The ten-year-old Lambert Simnel is crowned in Christ Church Cathedral, Dublin, Ireland, with the name of Edward VI in a bid to threaten King Henry VII's reign.\n*1567 – Erik XIV of Sweden and his guards murder five incarcerated Swedish nobles.\n*1595 – Nomenclator of Leiden University Library appears, the first printed catalog of an institutional library.\n*1607 – 100 English settlers disembark in Jamestown, the first English colony in America.\n*1621 – The Protestant Union is formally dissolved.\n*1626 – Peter Minuit buys Manhattan.\n*1667 – The French Royal Army crosses the border into the Spanish Netherlands, starting the War of Devolution opposing France to the Spanish Empire and the Triple Alliance.\n*1683 – The Ashmolean Museum in Oxford, England, opens as the world's first university museum.\n*1689 – The English Parliament passes the Act of Toleration protecting dissenting Protestants but excluding Roman Catholics.\n*1738 – John Wesley is converted, essentially launching the Methodist movement; the day is celebrated annually by Methodists as Aldersgate Day and a church service is generally held on the preceding Sunday.\n*1798 – The Irish Rebellion of 1798 led by the United Irishmen against British rule begins.\n*1813 – South American independence leader Simón Bolívar enters Mérida, leading the invasion of Venezuela, and is proclaimed El Libertador (\"The Liberator\").\n*1822 – Battle of Pichincha: Antonio José de Sucre secures the independence of the Presidency of Quito.\n*1830 – \"Mary Had a Little Lamb\" by Sarah Josepha Hale is published.\n*1832 – The First Kingdom of Greece is declared in the London Conference.\n*1844 – Samuel Morse sends the message \"What hath God wrought\" (a biblical quotation, Numbers 23:23) from the Old Supreme Court Chamber in the United States Capitol to his assistant, Alfred Vail, in Baltimore, Maryland, to inaugurate a commercial telegraph line between Baltimore and Washington D.C.\n*1856 – John Brown and his men kill five slavery supporters at Pottawatomie Creek, Kansas.\n*1861 – American Civil War: Union troops occupy Alexandria, Virginia.\n*1883 – The Brooklyn Bridge in New York City is opened to traffic after 14 years of construction.\n*1900 – Second Boer War: The United Kingdom annexes the Orange Free State.\n*1915 – World War I: Italy declares war on Austria-Hungary, joining the conflict on the side of the Allies.\n*1930 – Amy Johnson lands in Darwin, Northern Territory, becoming the first woman to fly solo from England to Australia (she left on May 5 for the 11,000 mile flight).\n*1935 – The first night game in Major League Baseball history is played in Cincinnati, Ohio, with the Cincinnati Reds beating the Philadelphia Phillies 2–1 at Crosley Field.\n*1940 – Igor Sikorsky performs the first successful single-rotor helicopter flight.\n*  1940   – Acting on the orders of Soviet leader Joseph Stalin, NKVD agent Iosif Grigulevich orchestrates an unsuccessful assassination attempt on exiled Russian revolutionary Leon Trotsky in Coyoacán, Mexico.\n*1941 – World War II: In the Battle of the Atlantic, the German Battleship Bismarck sinks then-pride of the Royal Navy, , killing all but three crewmen.\n*1948 – Arab–Israeli War: Egypt captures the Israeli kibbutz of Yad Mordechai, but the five-day effort gives Israeli forces time to prepare enough to stop the Egyptian advance a week later.\n*1956 – The first Eurovision Song Contest is held in Lugano, Switzerland.\n*1958 – United Press International is formed through a merger of the United Press and the International News Service.\n*1960 – Following the 1960 Valdivia earthquake, the largest ever recorded earthquake, Cordón Caulle begins to erupt.\n*1961 – American civil rights movement: Freedom Riders are arrested in Jackson, Mississippi, for \"disturbing the peace\" after disembarking from their bus.\n*1962 – Project Mercury: American astronaut Scott Carpenter orbits the Earth three times in the Aurora 7 space capsule.\n*1967 – Egypt imposes a blockade and siege of the Red Sea coast of Israel.\n*1976 – The Judgment of Paris takes place in France, launching California as a worldwide force in the production of quality wine.\n*1981 – Ecuadorian president Jaime Roldós Aguilera, his wife, and his presidential committee die in an aircraft accident while travelling from Quito to Zapotillo minutes after the president gave a famous speech regarding the 24 de mayo anniversary of the Battle of Pichincha.\n*1982 – Liberation of Khorramshahr: Iranians recapture of the port city of Khorramshahr from the Iraqis during the Iran–Iraq War.\n*1988 – Section 28 of the United Kingdom's Local Government Act 1988, a controversial amendment stating that a local authority cannot intentionally promote homosexuality, is enacted.\n*1991 – Israel conducts Operation Solomon, evacuating Ethiopian Jews to Israel.\n*1992 – The last Thai dictator, General Suchinda Kraprayoon, resigns following pro-democracy protests.\n*  1992   – The ethnic cleansing in Kozarac, Bosnia and Herzegovina begins when Serbian militia and police forces enter the town.\n*1993 – Eritrea gains its independence from Ethiopia.\n*1994 – Four men convicted of bombing the World Trade Center in New York in 1993 are each sentenced to 240 years in prison.\n*1999 – The International Criminal Tribunal for the former Yugoslavia in The Hague, Netherlands indicts Slobodan Milošević and four others for war crimes and crimes against humanity committed in Kosovo.\n*2000 – Israeli troops withdraw from southern Lebanon after 22 years of occupation.\n*2002 – Russia and the United States sign the Moscow Treaty.\n*2014 – A 6.4 magnitude earthquake occurs in the Aegean Sea between Greece and Turkey, injuring 324 people.\n*  2014   – At least three people are killed in a shooting at Brussels' Jewish Museum of Belgium.\n\nBirths\n\n*15 BC – Germanicus, Roman general (d. 19)\n*1335 – Margaret of Bohemia, Queen of Hungary (d. 1349)\n*1494 – Pontormo, Italian painter (d. 1557)\n*1522 – John Jewel, English bishop (d. 1571)\n*1544 – William Gilbert, English physician, physicist, and astronomer (d. 1603)\n*1576 – Elizabeth Carey, Lady Berkeley, English courtier (d. 1635)\n*1616 – John Maitland, 1st Duke of Lauderdale, Scottish politician, Secretary of State, Scotland (d. 1682)\n*1628 – Marek Sobieski, Polish noble (d. 1652)\n*1669 – Emerentia von Düben, Swedish royal favorite (d. 1743)\n*1671 – Gian Gastone de' Medici, Grand Duke of Tuscany (d. 1737)\n*1686 – Daniel Gabriel Fahrenheit, Polish-German physicist and engineer, developed the Fahrenheit scale (d. 1736)\n*1689 – Daniel Finch, 8th Earl of Winchilsea, English politician, Lord President of the Council (d. 1769)\n*1743 – Jean-Paul Marat, Swiss-French physician, journalist, and politician (d. 1793)\n*1794 – William Whewell, English priest and philosopher (d. 1866)\n*1803 – Alexander von Nordmann, Finnish biologist and paleontologist (d. 1866)\n*1810 – Abraham Geiger, German rabbi and scholar (d. 1874)\n*1816 – Emanuel Leutze, German-American painter (d. 1868)\n*1819 – Queen Victoria of the United Kingdom (d. 1901)\n*1830 – Alexei Savrasov, Russian painter and academic (d. 1897)\n*1855 – Arthur Wing Pinero, English actor, director, and playwright (d. 1934)\n*1861 – Gerald Strickland, 1st Baron Strickland, Maltese lawyer and politician, 4th Prime Minister of Malta (d. 1940)\n*1863 – George Grey Barnard, American sculptor (d. 1938)\n*1868 – Charlie Taylor, American engineer and mechanic (d. 1956)\n*1870 – Benjamin N. Cardozo, American lawyer and judge (d. 1938)\n*  1870   – Jan Smuts, South African lawyer and politician, 2nd Prime Minister of South Africa (d. 1950)\n*1874 – Princess Marie of Hesse and by Rhine (d. 1878)\n*1875 – Robert Garrett, American discus thrower and shot putter (d. 1961)\n*1878 – Lillian Moller Gilbreth, American psychologist and engineer (d. 1972)\n*1879 – H. B. Reese, American candy maker, created Reese's Peanut Butter Cups (d. 1956)\n*1886 – Paul Paray, French organist, composer, and conductor (d. 1979)\n*1887 – Mick Mannock, Irish soldier and pilot, Victoria Cross recipient (d. 1918)\n*1891 – William F. Albright, American archaeologist, philologist, and scholar (d. 1971)\n*1895 – Samuel Irving Newhouse Sr., American publisher, founded Advance Publications (d. 1979)\n*1899 – Suzanne Lenglen, French tennis player (d. 1938)\n*  1899   – Henri Michaux, Belgian-French poet and painter (d. 1984)\n*1900 – Eduardo De Filippo, Italian actor and screenwriter (d. 1984)\n*1901 – José Nasazzi, Uruguayan footballer and manager (d. 1968)\n*1902 – Lionel Conacher, Canadian football player and politician (d. 1954)\n*  1902   – Sylvia Daoust, Canadian sculptor (d. 2004)\n*1905 – Mikhail Sholokhov, Russian novelist and short story writer, Nobel Prize laureate (d. 1984)\n*1909 – Wilbur Mills, American banker and politician (d. 1992)\n*1910 – Jimmy Demaret, American golfer (d. 1983)\n*1913 – Joe Abreu, American baseball player and soldier (d. 1993)\n*1914 – Lilli Palmer, German-American actress (d. 1986)\n*1916 – Roden Cutler, Australian lieutenant and politician, 32nd Governor of New South Wales (d. 2002)\n*1917 – Alan Campbell, Baron Campbell of Alloway, English lawyer and judge (d. 2013)\n*1918 – Coleman Young, American politician, 66th Mayor of Detroit (d. 1997)\n*1923 – Siobhán McKenna, Irish actress (d. 1986)\n*1924 – Philip Pearlstein, American soldier and painter\n*1925 – Carmine Infantino, American illustrator and educator (d. 2013)\n*  1925   – Mai Zetterling, Swedish actress and director (d. 1994)\n*1926 – Stanley Baxter, Scottish actor and screenwriter\n*1928 – William Trevor, Irish novelist, playwright and short story writer (d. 2016)\n*1932 – Arnold Wesker, English playwright and producer (d. 2016)\n*1933 – Jane Byrne, American lawyer and politician, 50th Mayor of Chicago (d. 2014)\n*  1933   – Réal Giguère, Canadian television host and actor\n*  1933   – Aharon Lichtenstein, French-Israeli rabbi and author (d. 2015)\n*1935 – Joan Micklin Silver, American director and screenwriter\n*1936 – Harold Budd, American composer and poet\n*1937 – Maryvonne Dupureur, French runner and educator (d. 2008)\n*  1937   – Archie Shepp, American saxophonist and composer\n*1938 – Prince Buster, Jamaican singer-songwriter and producer \n*  1938   – Tommy Chong, Canadian-American actor, director, producer, and screenwriter\n*1940 – Joseph Brodsky, Russian-American poet and essayist, Nobel Prize laureate (d. 1996)\n*1941 – Bob Dylan, American singer-songwriter, guitarist, artist, writer, and producer; Nobel Prize laureate \n*  1941   – Patricia Hollis, Baroness Hollis of Heigham, English academic and politician\n*1942 – Ali Bacher, South African cricketer and manager\n*  1942   – Hannu Mikkola, Finnish race car driver\n*  1942   – Ichirō Ozawa, Japanese lawyer and politician, Japanese Minister of Home Affairs\n*1943 – Gary Burghoff, American actor \n*1944 – Patti LaBelle, American singer-songwriter and actress \n*  1944   – Dominique Lavanant, French actress\n*1945 – Terry Callier, American singer-songwriter and guitarist (d. 2012)\n*  1945   – Steven Norris, English engineer and politician\n*  1945   – Richard Ottaway, English lieutenant and politician, Shadow Secretary of State for Environment, Food and Rural Affairs\n*  1945   – Priscilla Presley, American actress and businesswoman\n*1946 – Tansu Çiller, Turkish economist and politician, 22nd Prime Minister of Turkey\n*  1946   – Jesualdo Ferreira, Portuguese footballer and manager \n*  1946   – Irena Szewińska, Russian-Polish sprinter\n*1947 – Albert Bouchard, American singer-songwriter, guitarist, and drummer \n*  1947   – Mike De Leon, Filipino director, producer, screenwriter and cinematographer\n*  1947   – Mike Reid, American singer-songwriter, pianist, and retired American football player\n*  1947   – Waddy Wachtel, American guitarist, singer-songwriter, and record producer \n*  1947   – Martin Winterkorn, German businessman \n*1948 – Richard Dembo, French director and screenwriter (d. 2004)\n*1949 – Jim Broadbent, English actor\n*  1953   – Alfred Molina, English actor\n*1955 – Rosanne Cash, American singer-songwriter and guitarist\n*  1955   – Philippe Lafontaine, Belgian singer and songwriter\n*  1955   – Rajesh Roshan, Indian composer\n*1956 – R. B. Bernstein, constitutional historian\n*  1956   – Larry Blackmon, American singer-songwriter and producer\n*  1956   – Dominic Grieve, English lawyer and politician, Attorney General for England and Wales\n*  1956   – Michael Jackson, Irish archbishop\n*1958 – Chip Ganassi, American race car driver, team owner and businessman\n*1959 – Pelle Lindbergh, Swedish-American ice hockey player (d. 1985)\n*  1959   – Barry O'Farrell, Australian politician, 43rd Premier of New South Wales \n*1960 – Guy Fletcher, English keyboard player, guitarist, and producer \n*  1960   – Bill Harrigan, Australian rugby league referee and sportscaster\n*  1960   – Kristin Scott Thomas, English actress\n*1961 – Lorella Cedroni, Italian philosopher and theorist (d. 2013)\n*  1961   – Alain Lemieux, Canadian-American ice hockey player and coach\n*1962 – Héctor Camacho, Puerto Rican-American boxer (d. 2012)\n*  1962   – Gene Anthony Ray, American actor, dancer, and choreographer (d. 2003)\n*1963 – Ivan Capelli, Italian race car driver and sportscaster\n*  1963   – Michael Chabon, American novelist, short story writer, and screenwriter\n*  1963   – Joe Dumars, American basketball player\n*  1963   – Rich Rodriguez, American football player and coach\n*  1963   – Valerie Taylor, American computer scientist and educator\n*1964 – Liz McColgan, Scottish educator and runner\n*  1964   – Adrian Moorhouse, English swimmer\n*  1964   – Isidro Pérez, Mexican boxer (d. 2013)\n*  1964   – Pat Verbeek, Canadian ice hockey player and manager\n*1965 – John C. Reilly, American actor\n*  1965   – Shinichirō Watanabe, Japanese director, producer, and screenwriter\n*1966 – Éric Cantona, French footballer, manager, and actor\n*  1966   – Ricky Craven, American race car driver and sportscaster\n*  1967   – Tamer Karadağlı, Turkish actor\n*1967 – Andrey Borodin, Russian-English economist and businessman\n*  1967   – Eric Close, American actor\n*  1967   – Heavy D, Jamaican-American rapper, producer, and actor (d. 2011)\n*  1967   – Carlos Hernández, Venezuelan-American baseball player and manager\n*1969 – Martin McCague, Northern Irish-English cricketer\n*  1969   – Jacob Rees-Mogg, English politician\n*  1969   – Rich Robinson, American guitarist and songwriter \n*1971 – Kris Draper, Canadian ice hockey player and manager\n*1972 – Greg Berlanti, American director, producer, and screenwriter\n*1973 – Rodrigo, Argentinian singer-songwriter (d. 2000)\n*  1973   – Bartolo Colón, Dominican-American baseball player\n*  1973   – Shirish Kunder, Indian director, producer, and screenwriter\n*  1973   – Vladimír Šmicer, Czech footballer and manager\n*1974 – Sébastien Foucan, French runner and actor\n*  1974   – Masahide Kobayashi, Japanese baseball player and coach\n*  1974   – Magnus Manske, German biochemist and computer programmer, developed MediaWiki\n*  1974   – Will Sasso, Canadian actor and comedian \n*1975 – Marc Gagnon, Canadian speed skater\n*  1975   – Giannis Goumas, Greek footballer and coach\n*  1975   – Maria Lawson, English singer-songwriter\n*1976 – Alessandro Cortini, Italian-American singer and keyboard player \n*  1976   – Catherine Cox, New Zealand-Australian netball player\n*  1976   – Silje Vige, Norwegian singer\n*1978 – Elijah Burke, American wrestler\n*  1978   – Johan Holmqvist, Swedish ice hockey player\n*  1978   – Brad Penny, American baseball player\n*  1978   – Rose, French singer, songwriter and composer\n*1979 – Tracy McGrady, American basketball player\n*  1979   – Kareem McKenzie, American football player\n*1980 – Jason Babin, American football player\n*  1980   – Anthony Minichiello, Australian rugby league player\n*1981 – Andy Lee, Australian comedian, actor, and screenwriter\n*1982 – Issah Gabriel Ahmed, Ghanaian footballer\n*  1982   – Rian Wallace, American football player\n*1983 – Custódio Castro, Portuguese footballer\n*  1983   – Pedram Javaheri, Iranian-American meteorologist and journalist\n*  1983   – Woo Seung-yeon, South Korean model and actress (d. 2009)\n*1984 – Sarah Hagan, American actress\n*  1984   – Dmitri Kruglov, Estonian footballer\n*1985 – Tim Bridgman, English race car driver\n*1986 – Mark Ballas, American singer-songwriter, guitarist, dancer, and actor \n*  1986   – Giannis Kontoes, Greek footballer\n*1987 – Déborah François, Belgian actress\n*  1987   – Guillaume Latendresse, Canadian ice hockey player\n*1988 – Artem Anisimov, Russian ice hockey player\n*  1988   – Monica Lin Brown, American sergeant\n*  1988   – Billy Gilman, American singer-songwriter\n*  1988   – Lucian Wintrich, American political artist and White House correspondent \n*1989 – Andrew Jordan, English race car driver\n*1990 – Mattias Ekholm, Swedish ice hockey player\n*1991 – Aled Davies, Welsh discus thrower\n*  1991   – Cody Eakin, Canadian ice hockey player\n*1993 – Christopher Bramell, English beauty pageant winner\n\nDeaths\n\n* 688 – Ségéne, bishop of Armagh (b. c. 610)\n*1089 – Lanfranc, Archbishop of Canterbury\n*1136 – Hugues de Payens, first Grand Master of the Knights Templar (b. c. 1070)\n*1153 – David I of Scotland (b. 1083)\n*1201 – Theobald III, Count of Champagne (b. 1179)\n*1351 – Abu al-Hasan Ali ibn Othman, Moroccan sultan (b. 1297)\n*1408 – Taejo of Joseon  (b. 1335)\n*1425 – Murdoch Stewart, 2nd Duke of Albany, Scottish politician (b. 1362)\n*1456 – Ambroise de Loré, French commander (b. 1396)\n*1543 – Nicolaus Copernicus, Polish mathematician and astronomer (b. 1473)\n*1612 – Robert Cecil, 1st Earl of Salisbury, English politician, Lord High Treasurer (b. 1563)\n*1627 – Luis de Góngora, Spanish poet and cleric (b. 1561)\n*1632 – Robert Hues, English mathematician and geographer (b. 1553)\n*1734 – Georg Ernst Stahl, German physician and chemist (b. 1660)\n*1792 – George Brydges Rodney, 1st Baron Rodney, English admiral and politician, 16th Governor of Newfoundland (b. 1718)\n*1806 – John Campbell, 5th Duke of Argyll, Scottish field marshal and politician, Lord Lieutenant of Argyllshire (b. 1723)\n*1843 – Sylvestre François Lacroix, French mathematician and academic (b. 1765)\n*1861 – Elmer E. Ellsworth, American colonel (b. 1837)\n*1872 – Julius Schnorr von Carolsfeld, German painter and illustrator (b. 1794)\n*1879 – William Lloyd Garrison, American journalist and activist (b. 1805)\n*1881 – Samuel Palmer, English painter and illustrator (b. 1805)\n*1901 – Louis-Zéphirin Moreau, Canadian bishop (b. 1824)\n*1908 – Old Tom Morris, Scottish golfer and architect (b. 1821)\n*1915 – John Condon, Irish-English soldier (b. 1896)\n*1919 – Amado Nervo, Mexican poet, journalist, and educator (b. 1870)\n*1941 – Lancelot Holland, English admiral (b. 1887)\n*1945 – Robert Ritter von Greim, German field marshal and pilot (b. 1892)\n*1948 – Jacques Feyder, Belgian actor, director, and screenwriter (b. 1885)\n*1949 – Alexey Shchusev, Russian architect, designed Lenin's Mausoleum and Moscow Kazanskaya railway station (b. 1873)\n*1950 – Archibald Wavell, 1st Earl Wavell, English field marshal and politician, 43rd Governor-General of India (b. 1883)\n*1951 – Thomas N. Heffron, American actor, director, screenwriter (b. 1872)\n*1958 – Frank Rowe, Australian public servant (b. 1895)\n*1959 – John Foster Dulles, American soldier, lawyer, and politician, 52nd United States Secretary of State (b. 1888) \n*1963 – Elmore James, American singer-songwriter and guitarist (b. 1918)\n*1965 – Sonny Boy Williamson II, American singer-songwriter and harmonica player (b. 1908)\n*1974 – Duke Ellington, American pianist and composer (b. 1899)\n*1976 – Denise Pelletier, Canadian actress (b. 1923)\n*1979 – Ernest Bullock, English organist, composer, and educator (b. 1890)\n*1981 – Herbert Müller, Swiss race car driver (b. 1940)\n*1984 – Vince McMahon Sr., American wrestling promoter and businessman, founded WWE (b. 1914)\n*1988 – Freddie Frith, English motorcycle road racer (b. 1909)\n*1990 – Arthur Villeneuve, Canadian painter (b. 1910)\n*1991 – Gene Clark, American singer-songwriter and guitarist  (b. 1944)\n*1992 – Hitoshi Ogawa, Japanese race car driver (b. 1956)\n*1995 – Harold Wilson, English academic and politician, Prime Minister of the United Kingdom (b. 1916)\n*1996 – Enrique Álvarez Félix, Mexican actor (b. 1934)\n*  1996   – Joseph Mitchell, American journalist and author (b. 1908)\n*1997 – Edward Mulhare, Irish actor (b. 1923)\n*2000 – Kurt Schork, American journalist and scholar (b. 1947)\n*  2000   – Majrooh Sultanpuri, Indian poet and songwriter (b. 1919)\n*2002 – Wallace Markfield, American author (b. 1926)\n*2003 – Rachel Kempson, English actress (b. 1910) \n*2004 – Henry Ries, German-American photographer (b. 1917)\n*  2004   – Milton Shulman, Canadian author and critic (b. 1913)\n*  2004   – Edward Wagenknecht, American critic and educator (b. 1900)\n*2005 – Carl Amery, German activist and author (b. 1922)\n*  2005   – Arthur Haulot, Belgian journalist and poet (b. 1913)\n*  2005   – Guy Tardif, Canadian academic and politician (b. 1935)\n*2006 – Henry Bumstead, American art director and production designer (b. 1915)\n*  2006   – Claude Piéplu, French actor (b. 1923)\n*  2006   – Michał Życzkowski, Polish technician and educator (b. 1930)\n*2008 – Dick Martin, American actor, comedian, and director (b. 1922)\n*  2008   – Jimmy McGriff, American organist and bandleader (b. 1936)\n*2009 – Jay Bennett, American singer-songwriter, guitarist, and producer (b. 1963)\n*2010 – Ray Alan, English ventriloquist, actor, and screenwriter (b. 1930)\n*  2010   – Paul Gray, American bass player and songwriter (b. 1972)\n*  2010   – Raymond V. Haysbert, American businessman and activist (b. 1920) \n*  2010   – Petr Muk, Czech singer-songwriter and guitarist (b. 1965)\n*  2010   – Anneliese Rothenberger, German soprano and actress (b. 1926)\n*2011 – Huguette Clark, American heiress, painter, and philanthropist (b. 1906)\n*  2011   – Hakim Ali Zardari Indian-Pakistani businessman and politician (b. 1930)\n*2012 – Klaas Carel Faber Dutch-German SS officer (b. 1922)\n*  2012   – Kathi Kamen Goldmark, American journalist and author (b. 1948)\n*  2012   – Jacqueline Harpman, Belgian psychoanalyst and author (b. 1929)\n*  2012   – Juan Francisco Lombardo, Argentinian footballer (b. 1925)\n*  2012   – Lee Rich, American production manager and producer (b. 1918)\n*2013 – Helmut Braunlich, German-American violinist and composer (b. 1929)\n*  2013   – Ron Davies, Welsh footballer (b. 1942)\n*  2013   – Gotthard Graubner, German painter (b. 1930)\n*  2013   – Haynes Johnson, American journalist and author (b. 1931)\n*  2013   – Pyotr Todorovsky, Ukrainian-Russian director and screenwriter (b. 1925)\n*2014 – David Allen, English cricketer (b. 1935)\n*  2014   – Mahafarid Amir Khosravi, Iranian businessman (b. 1969)\n*  2014   – Knowlton Nash, Canadian journalist and author (b. 1927)\n*  2014   – John Vasconcellos, American lieutenant, lawyer, and politician (b. 1932)\n*2015 – Dean Carroll, English rugby player (b. 1962)\n*  2015   – Kenneth Jacobs, Australian lawyer and judge (b. 1917)\n*  2015   – Tanith Lee, English author (b. 1947)\n\nHolidays and observances\n\n* Feast of Mary Help of Christians (Roman Catholicism)\n*Aldersgate Day/Wesley Day (Methodism)\n*Battle of Pichincha Day (Ecuador)\n*Bermuda Day (Bermuda), celebrated on the nearest weekday if May 24 falls on the weekend.\n*Christian feast day:\n**Anna Pak Agi (one of The Korean Martyrs)\n**David I of Scotland\n**Donatian and Rogatian\n**Jackson Kemper (Episcopal Church)\n**Joanna\n**Mary, Help of Christians\n**Sarah (celebrated by the Romani people of Camargue)\n**Vincent of Lérins\n**May 24 (Eastern Orthodox liturgics)\n*Commonwealth Day (Belize)\n*Earliest day on which El Colacho tradition can fall, while June 27 is the latest; celebrated on Sunday after Corpus Christi. (Castrillo de Murcia, near Burgos) \n*Independence Day (Eritrea), celebrates the independence of Eritrea from Ethiopia in 1993.\n*Lubiri Memorial Day (Buganda)\n*Saints Cyril and Methodius Day (Eastern Orthodox Church) and its related observance: \n**Bulgarian Education and Culture and Slavonic Literature Day (Bulgaria)\n**Saints Cyril and Methodius, Slavonic Enlighteners' Day (Republic of Macedonia)\n*Victoria Day; celebrated on Monday on or before May 24. (Canada), and its related observance:\n**National Patriots' Day or Journée nationale des patriotes (Quebec). May 24. http://en.wikipedia.org/?curid=19459."
  }
}
