{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13867",
  "eid" : "0ed0ee70-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778534103,
  "textBody" : "Harold Edward Holt,  (5 August 190817 December 1967), was an Australian politician who served as the 17th Prime Minister of Australia, in office from 1966 until his presumed drowning death.\n\nHolt was born in Sydney, but lived in Melbourne from a young age. He studied law at the University of Melbourne and eventually opened his own legal practice. Holt entered parliament at a 1935 by-election, standing for the United Australia Party (UAP). He was a protégé of Robert Menzies, and was added to cabinet – aged only 30 – when Menzies became prime minister for the first time in 1939. He held a series of minor portfolios until the government's defeat in 1941, serving under both Menzies and Arthur Fadden. Holt's tenure was interrupted by a brief stint in the Australian Army, which ended when he was recalled to cabinet following the deaths of three ministers in the 1940 Canberra air disaster. He joined the new Liberal Party upon its creation in 1945.\n\nWhen Menzies regained the prime ministership in 1949, Holt became a senior figure in the new government. As Minister for Immigration (1949–56), he  expanded the post-war immigration scheme and relaxed the White Australia policy for the first time. He was also influential as Minister for Labour and National Service (1949–58), where he handled several industrial relations disputes. Holt was elected deputy leader of the Liberal Party in 1956, and after the 1958 election replaced Arthur Fadden as Treasurer. He oversaw the creation of the Reserve Bank of Australia and the decimal Australian dollar, but was blamed for a credit crunch that almost cost the Coalition the 1961 election. However, the economy soon rebounded and Holt retained his place as Menzies' heir apparent.\n\nHolt became prime minister in January 1966, elected unopposed as Liberal leader following Menzies' retirement. He fought a general election later that year, winning a landslide victory. The Holt Government continued the dismantling of the White Australia policy, amended the constitution to give the federal government responsibility for indigenous affairs, and took Australia out of the sterling area. Holt promoted greater engagement with Asia and the Pacific, and made visits to a number of Asian countries. His government expanded Australia's involvement in the Vietnam War, and maintained close ties with the United States under President Lyndon B. Johnson. While visiting the White House, Holt famously proclaimed that he was \"all the way with LBJ\", a remark which was poorly received at home.\n\nAfter just under two years in office, Holt disappeared while swimming at Cheviot Beach, Victoria, in rough conditions. His body was never recovered, and he was declared dead in absentia; his disappearance spawned a number of conspiracy theories. Holt was the third Australian prime minister to die in office, and was succeeded by John McEwen on an interim basis and then by John Gorton. His death was commemorated in a number of ways, most famously by the Harold Holt Memorial Swimming Centre.\n\nEarly life \n\nBirth and family background\n\nHolt was born in Sydney on 5 August 1908, in his parents' home at 58 Cavendish Street, Stanmore. He was the first of two sons born to Thomas James Holt and the former Olive May Pearce – his younger brother Clifford was born in 1910. On his father's side, Holt was descended from James Holt, a cobbler from Birmingham, England, who had arrived in New South Wales in 1829.Frame (2005), p. 3. His paternal grandfather, Thomas Holt Sr., owned a large property in Nubba, and was twice elected mayor of nearby Wallendbeen. Holt's father had left home at a young age to support the family, training as a schoolteacher in Sydney and eventually finding work as a physical education teacher at the Cleveland Street School in Surry Hills. Holt's mother was born in Eudunda, South Australia, and had Cornish, English, German, and Irish ancestry; her sister was the actress Vera Pearce.\n\nEducation\n\nIn 1914, Holt's parents moved to Adelaide, where his father became the licensee of a hotel in Payneham. He and his brother stayed behind in Sydney, living with an uncle and attending Randwick Public School. In late 1916, Holt was sent to live with grandparents in the country, where he briefly attended the Nubba State School. He returned to Sydney the following year, and for three years was enrolled at Abbottsholme College, a private school in Killara; his parents separated around that time. In 1920, Holt began boarding at Wesley College, Melbourne. He was a popular and talented student, winning a scholarship in his final year and graduating second in his class. Holt generally spent school holidays with his relatives in Nubba or with schoolmates, rather than with his parents – his father had begun working as a talent agent, touring the country on the Tivoli circuit, while his mother died in 1925. He was 16 at the time, and was unable to attend the funeral.Frame (2005), p. 5.\n\nIn 1927, Holt began studying law at the University of Melbourne, living at Queen's College on a scholarship. He represented the university in cricket and football, and was also active in various student organisations, serving as president of the Law Students' Society and of the Queen's College social club. Holt won prizes for oratory and essay-writing, and was a member of the inter-university debating team. He graduated with a Bachelor of Laws degree in 1930. Holt's father – living in London – invited to him to continue his studies in England, but he declined the offer.Frame (2005), p. 6.\n\nLegal career\n\nHolt served his articles of clerkship with the firm of Fink, Best, & Miller. He was admitted to the Victorian Bar in late 1932, and opened his own legal practice the following year. However, clients during the Depression were scarce and frequently underpaid, so Holt lived in a boardinghouse and often relied upon the hospitality of friends. Drawing on his family connections in show business, he eventually accepted an offer to become secretary of the Victorian Cinematograph Exhibitors' Association, a film industry lobby group. In this capacity he appeared several times before the Commonwealth Court of Conciliation and Arbitration.[http://adb.anu.edu.au/biography/holt-harold-edward-10530 Australian Dictionary of Biography]. 1996Frame (2005), p. 9. This had a positive affect on his own practice, and he eventually took on two partners, first Jack Graham and later James Newman.Frame (2005), p. 13. The firm of Holt, Graham, & Newman was dissolved in 1963, following a financial dispute and subsequently reconstituted as Holt, Newman, & Holt, with Holt's son Sam as the new addition. Holt's involvement in the practice declined once he entered politics and ceased altogether in 1949, although he did not formally retire until assuming the prime ministership.Frame (2005), p. 306.\n\nEarly political career\n\nIn 1933, Holt joined the Young Nationalists, the youth wing of the United Australia Party.Frame (2005), p. 9. He cultivated a friendship with Mabel Brookes, and through Brookes became acquainted with senior members of the influential Australian Women's National League (AWNL). He also secured the patronage of Robert Menzies, with whom he shared a similar background and political views.Frame (2005), p. 11. At the 1934 federal election, Holt stood for the UAP in the Division of Yarra. It was a safe seat for the Labor Party, held by the party's leader (and former prime minister) James Scullin. Holt lost heavily, as was expected, but was praised for his campaigning. Early the following year, he contested Clifton Hill – another safe Labor seat – at the Victorian state election, losing to Bert Cremean.Frame (2005), p. 10. Holt was eventually elected to parliament on his third attempt, winning a federal by-election in August 1935; his predecessor, George Maxwell, had died in office. He won UAP preselection against five other candidates, a victory which Smith's Weekly attributed to his \"political godmothers\" in the AWNL.[http://trove.nla.gov.au/newspaper/article/234615406 Political Godmothers Rule U.A.P. With Haughty Mien], Smith's Weekly, 10 August 1935. His new electorate, the Division of Fawkner, was centred on Melbourne's wealthy inner-eastern suburbs.Frame (2005), p. 12.\n\nHolt was 27 when he entered parliament, making him its youngest member. He kept a relatively low profile in his first few years, but spoke on a wide range of topics.Frame (2005), pp. 12–15. When Robert Menzies became prime minister in April 1939, he made Holt one of four ministers without portfolio. His inclusion was made possible by the collapse of the coalition with the Country Party – previously a certain number of positions had been reserved for Country MPs, but the new ministry was composed solely of UAP members.Frame (2005), p. 16. Although Holt officially had no portfolio, he effectively served as an assistant minister to Richard Casey, who headed the Department of Supply and Development. He was given responsibility for the Council for Scientific and Industrial Research (CSIR),Frame (2005), p. 17. and also acted for periods as Minister for Trade and Customs and Minister for Civil Aviation and Air while the incumbents were overseas.Frame (2005), p. 18. Holt's first stint as a government minister came to an end in March 1940, when the coalition with the Country Party was reinstituted. His replacement was Arthur Fadden, another future prime minister.Frame (2005), p. 19.\n\nWorld War II\n\nHolt enlisted in the Militia in February 1939, joining a part-time artillery unit for businessmen and professionals. He was given indefinite leave during his ministerial service.Frame (2005), pp. 16–17. In May 1940, without resigning his seat, Holt enlisted in the Australian Imperial Force with the intent of becoming a full-time soldier. Several of his parliamentary colleagues did likewise at various points in the war. Holt was posted to the 2/4th Field Regiment, holding the rank of gunner. He had been offered a commission as an officer in the Royal Australian Air Force, but declined due to his lack of experience. In a press statement, Holt said \"as the youngest member of the House, I could not feel happy in my position if I were not prepared to make some sacrifice and take an active part\".Frame (2005), p. 20. He was sent to Puckapunyal for training, and expected to be posted to North Africa or Palestine.Frame (2005), p. 21.\n\nHolt's brief military career came to an end as a result of the Canberra air disaster on 13 August, which killed three senior government ministers. Menzies called an early general election for 21 September, which resulted in a hung parliament and a UAP–Country minority government. Holt was given leave from the army to campaign, and won re-election with a large majority. Menzies subsequently asked him to return to cabinet, to which he agreed.Frame (2005), p. 22. Holt was sworn in as Minister for Labour and National Service on 28 October, and formally resigned from the army the same day. He was placed in charge of the new Department of Labour and National Service, which took over most of the responsibilities of the previous Department of Industry.Frame (2005), p. 23. He also became a member of the bipartisan Advisory War Council, although he personally favoured the establishment of a national unity government with the Labor Party.Frame (2005), p. 24.\n\nAs labour minister, Holt's foremost task was to prevent industrial disputes from disrupting the war effort.Frame (2005), p. 25. He met with union leaders and employer groups, and secured their agreement to a streamlining of the arbitration process while the war was underway. He had also been made Minister in charge of Scientific and Industrial Research, which gave him responsibility for the CSIR and its wartime efforts. In April 1941, Holt sponsored and oversaw the passage of the Child Endowment Act, which introduced a universal child endowment scheme; newspapers labelled him \"the godfather to a million Australian children\".Frame (2005), p. 26. When leadership troubles hit the Coalition later in the year, Holt initially supported Menzies. However, he and five cabinet colleagues eventually transferred their allegiance to Arthur Fadden, the leader of the Country Party, believing this way the only to ensure stable government. Menzies felt he had been betrayed, but forgave Holt and accepted his assurances that he had been acting in the best interests of the country.Frame (2005), p. 27.\n\nHolt retained his portfolios in the Fadden Government, which lasted only 40 days before being defeated on a confidence motion in October 1941. After going into opposition, he kept a reasonably low profile for the remainder of the war, except for his membership of the Joint Committee on War Expenditure.Frame (2005), p. 31. He was criticised by some for not re-joining the army,Frame (2005), p. 28. and at the 1943 election was opposed by Brigadier William Cremor, whose campaign was funded by Sydney businessmen (including Keith Murdoch). He lost a significant portion of his primary vote, but suffered only a small swing on the two-party-preferred count.Frame (2005), p. 29. Menzies returned as leader of the UAP in September 1943, and Holt was initially a candidate for the deputy leadership; he withdrew once former prime minister Billy Hughes entered the race.Frame (2005), p. 30. Holt was in favour of the creation of the Liberal Party, but played little role in the practical aspects of its establishment. He became an official member of the new party in February 1945.Frame (2005), p. 32.\n\nPostwar ministerial career\n\nAfter eight years in opposition, the Coalition won the federal election of December 1949 and Menzies began his record-setting second term as Prime Minister. In a redistribution held ahead of that election, Holt's majority in Fawkner nearly disappeared. He transferred to Higgins, one of several new seats created in the 1949 redistribution. The seat was created as a safe Liberal seat; it had been carved out of the wealthier portions of Fawkner. Holt won it easily. He was appointed to the prestigious portfolios of Minister for Labour and National Service (1949–1958; he had previously served in this portfolio 1940–41) and Minister for Immigration (1949–1956), by which time he was being touted in the press as a \"certain successor to Menzies and a potential Prime Minister\". In Immigration, Holt continued and expanded the massive immigration programme initiated by his ALP predecessor, Arthur Calwell. However, he displayed a more flexible and caring attitude than Calwell, who was a strong advocate of the White Australia policy. One of his first acts was to intervene in the so-called \"Gamboa case\", which involved a Filipino immigrant with an Australian wife and children. Calwell had had Gamboa deported under the War-time Refugees Removal Act 1949, but Holt reversed the decision and allowed Gamboa to return to Australia to live.[https://www.theguardian.com/commentisfree/2014/mar/18/annie-white-australia-policy How one refugee signalled the end of the White Australia policy], The Guardian Australia, 18 March 2014. Retrieved 14 December 2017.\n\nHolt excelled in the Labour portfolio and has been described as one of the best Labour ministers since Federation. Although the conditions were ripe for industrial unrest—Communist influence in the union movement was then at its peak, and the right-wing faction in Cabinet was openly agitating for a showdown with the unions—the combination of strong economic growth and Holt's enlightened approach to industrial relations saw the number of working hours lost to strikes fall dramatically, from over two million in 1949 to just 439,000 in 1958.  He also had ministerial responsibility for the Melbourne Olympics in 1956.\n\nHolt fostered greater collaboration between the government, the courts, employers and trade unions. He enjoyed good relationships with union leaders like Albert Monk, President of the Australian Council of Trade Unions; and Jim Healy, leader of the radical Waterside Workers Federation;and he gained a reputation for tolerance, restraint and a willingness to compromise, although his controversial decision to use troops to take control of cargo facilities during a waterside dispute in Bowen, Queensland in September 1953 provoked bitter criticism.\n\nHolt's personal profile and political standing grew throughout the 1950s. He served on numerous committees and overseas delegations, he was appointed a Privy Counsellor in 1953, and in 1954 he was named one of Australia's six best-dressed men. In 1956, he was elected Deputy Leader of the Liberal Party and became Leader of the House, and from this point on, he was generally acknowledged as Menzies' heir apparent.\n\nTreasurer (1958–1966)\n\nIn December 1958, following the retirement of Arthur Fadden, Holt succeeded him as Treasurer. Holt had little knowledge or interest in economics, but the job cemented his position as Menzies' likely successor. As Treasurer, Holt relied strongly on the advice of Treasury secretary Roland Wilson. His achievements included major reforms to the banking system (originated by Fadden)including the establishment of the Reserve Bank of Australiaand the planning and preparation for the introduction of decimal currency. It was Holt who convinced Cabinet to call the new currency the \"dollar\" rather than the \"royal\".\n\nThe economy Holt inherited was growing strongly, aided by the opening of new iron ore mines. However, in 1959, inflation was running at 4.5% and Treasury was alarmed. Holt was reluctant to act, but in November 1960 introduced a deflationary package of tax changes. He also reluctantly agreed to an interest rate rise by the Reserve Bank. The credit squeeze was nicknamed the \"Holt jolt\". The economy went into recession, and unemployment rose to three percent, which was considered high for the time (and contrary to the government's policy of full employment.[http://www.smh.com.au/business/its-half-a-century-since-australia-received-the-holt-jolt-20100222-orwn.html It's half a century since Australia received the Holt Jolt], The Sydney Morning Herald, 23 February 2010. Retrieved 15 December 2017.\n\nThe credit squeeze brought the Coalition dangerously close to losing the 1961 election, with the Coalition being returned with a precarious one-seat majority. There were calls for Holt to be sacked, but he retained Menzies' support. He later described 1960–61 as \"my most difficult year in public life\". Most of the deflationary measures were reversed in 1962, and unemployment dropped down to 1.5 percent by August 1963.Frame (2005), p. 119. In later budgets, Holt retreated to his Queensland holiday home while it was being prepared. He said that the 1965 budget \"has had the best reception yet of any in the series I have presented\".Frame (2005), p. 127.\n\nPrime Minister (1966–1967)\n\nHolt was sworn in as prime minister on 26 January 1966, following the retirement of Robert Menzies six days earlier. He won the leadership election unopposed, with William McMahon elected as his deputy.Frame (2005), p. 137. His swearing in was delayed by the death of Defence Minister Shane Paltridge; he and Menzies both served as pallbearers at Paltridge's state funeral on 25 January.[https://trove.nla.gov.au/newspaper/article/105883346 \"Paltridge to have state funeral\"], The Canberra Times, 22 January 1966. Retrieved 7 December 2017.[https://trove.nla.gov.au/newspaper/article/105883911 \"Hundreds pay last respects\"], The Canberra Times, 26 January 1966. Retrieved 7 December 2017. Holt was the first Australian prime minister born in the 20th century and the first born after federation. He was almost fourteen years younger than his predecessor, but, at the age of 57, was still the fourth-oldest man to assume the office. He had been an MP for over 30 years before becoming prime minister, a record surpassed only by his successor John McEwen's 33 years.[http://primeministers.naa.gov.au/primeministers/holt/fast-facts.aspx Fast facts: Harold Holt], National Archives of Australia. Retrieved 7 December 2017. Stylistically, Holt was more informal and contemporary than Menzies, and his wife accompanied him into the political spotlight. He gave the media an unprecedented level of access, and was the first prime minister to conduct regular press conferences and grant regular television interviews. His press secretary, Tony Eggleton, accompanied him virtually every time he travelled.Frame (2005), pp. 147–148.\n\nHolt's initial cabinet was virtually unchanged from that of his predecessor. John Gorton and Les Bury were promoted to replace Menzies and Paltridge, but there were no other changes in composition. There were also no major changes in portfolio, outside of McMahon's promotion to Treasurer in place of Holt. A notable addition to the outer ministry was Senator Annabelle Rankin as Minister for Housing – the first woman to hold a ministerial portfolio.Frame (2005), p. 141. A minor reshuffle occurred after the 1966 election, with Doug Anthony and Ian Sinclair added to cabinet and Charles Barnes demoted to the outer ministry. The only new government department created during Holt's tenure was the Department of Education and Science, established in December 1966, which was the first federal department specific to either of those areas.\n\nElections\n\nOn 26 November 1966, Holt fought his first and only general election as prime minister, winning a somewhat unexpected landslide victory. The Coalition secured 56.9 percent of the two-party-preferred vote, gaining 10 seats and bringing its total number of seats in the House of Representatives to 82 out of 124; the Liberal Party was only two seats away from forming majority government in its own right. It was a higher margin victory of victory than Menzies had achieved in eight elections as Liberal leader, and was the Labor Party's worst electoral defeat in 31 years.Frame (2005), p. 170.\n\nHolt received little credit for the Coalition's election victory, even from within his own party.Frame (2005), p. 172. It was generally held that the Labor Party's poor campaign had been the major factor in its defeat. Arthur Calwell, the Leader of the Opposition, was 70 years old and had limited personal popularity – a Gallup poll before the election placed his personal approval rating at 24 percent, compared with Holt's 60 percent.Frame (2005), p. 169. Calwell had suffered a damaging rift with his deputy Gough Whitlam earlier in the year, and the general public still perceived the party as divided.Frame (2005), p. 166. In an election where the Vietnam War was a major campaign issue, he and Whitlam publicly contradicted each other on major policy decisions. Labor ran on an anti-war platform, but struggled to appeal to voters concerned about national security; combined with Calwell's dedication to the White Australia policy, this allowed the party to be portrayed as isolationist and naive about external affairs. Calwell was far less telegenic than his opponent, and was seen as gruff and antagonistic where Holt was suave and easy-going. At a rally in Adelaide a week before the election, Calwell accused Holt of having \"chickened out of World War II – just as his three stepsons are chickening out of the war in Vietnam today\". His attack on Holt's family – which he refused to withdraw – was viewed as desperate and undignified, and it was pointed out that, unlike Holt, Calwell had performed no military service in World War II.\n\nIn early 1967, Arthur Calwell retired as ALP leader and Gough Whitlam succeeded him. Whitlam proved a far more effective opponent, both in the media and in parliament, and Labor soon began to recover from its losses and gain ground, with Whitlam repeatedly besting Holt in Parliament. By this time, the long-suppressed tensions between the Coalition partners over economic and trade policies were also beginning to emerge. Throughout his reign as Liberal leader, Menzies had enforced strict party discipline but, once he was gone, dissension began to surface. Some Liberals soon became dissatisfied by what they saw as Holt's weak leadership. Alan Reid asserts that Holt was being increasingly criticised within the party in the months before his death, that he was perceived as being \"vague, imprecise and evasive\" and \"nice to the point that his essential decency was viewed as weakness\".\n\nDomestic policy\n\nAccording to his biographer Tom Frame, \"Holt's inclinations and sympathies were those of the political centre [...] he was a pragmatist rather than a philosopher, but he nonetheless claimed a philosophical lineage connecting him with Alfred Deakin and approvingly quoted his statement that 'we are liberal always, radical often, and reactionary never'.\".Frame (2005), p. 133–134.\n\nEconomy\n\nHolt as prime minister was sometimes criticised for a failure to be assertive on economic matters. A major drought in 1965 had led to slowdown in growth, but he was unwilling to increase public spending in case it increased inflation.Frame (2005), p. 161. The Australian dollar – a legacy of Holt's period as Treasurer – came into circulation on 14 February 1966, less than a month after his prime ministership began. In November 1967, the British government unexpectedly announced that it would be devaluing the pound sterling by 14 percent. Holt announced that the Australian government would not follow suit, effectively withdrawing Australia from the sterling area. The decision was strongly opposed by the Country Party, who feared it would disadvantage primary industry. John McEwen, the Country Party leader, issued a public statement criticising the government, which caused a breakdown in his relations with Holt and nearly led to the collapse of the Coalition. The Bulletin said that the withdrawal was \"quite certain to mean the end of any remaining special relationship between Australia and Britain\".Frame (2005), pp. 239–241. There were no other important economic policy reforms made by the Holt Government, although Australia did become a founding member of the Asian Development Bank in 1966.Frame (2005), p. 180.\n\nImmigration\n\nAs prime minister, Holt continued the liberalisation of immigration law that he had begun as Minister for Immigration. When he came to office, what remained of the White Australia policy was upheld by ministerial decree rather than by explicit legislation. In March 1966, the residency requirement for naturalisation was changed to a uniform five years; it had previously been 15 years for non-whites. Discriminatory provisions relating to family reunification were also removed.[http://trove.nla.gov.au/newspaper/article/105891028 \"New migration policy will aid Japanese\"], The Canberra Times, 11 March 1966. Retrieved 3 December 2017. As a result, in the two years after March 1966 around 3,000 Asian immigrants were granted Australian citizenship,Frame (2005), p. 160. compared with 4,100 in the preceding two decades.[http://trove.nla.gov.au/newspaper/article/105888104 \"Sir Robert rejected migrant plan\"], The Canberra Times, 22 February 1966. Retrieved 3 December 2017. Additionally, Immigration Minister Hubert Opperman announced that potential immigrants to Australia would be assessed solely \"on the basis of their suitability as settlers, their ability to integrate readily, and their possession of qualifications which are in fact positively useful to Australia\";[https://www.moadoph.gov.au/blog/white-australia-policy-the-beginning-of-the-end-50-years-ago/ White Australia policy – the beginning of the end 50 years ago], Museum of Australian Democracy, 9 March 2016. Retrieved 3 December 2017. non-whites had previously had to demonstrate that they were \"highly qualified and distinguished\" to gain entry.\n\nKeith Wilson believed that the Holt Government's reforms ensured that \"from now on there will not be in any of our laws or in any of our regulations anything that discriminates against migrants on the grounds of colour or race\". However, there would not be a practical change in the composition of Australia's immigration intake for many more years.[http://www.nma.gov.au/online_features/defining_moments/featured/end_of_the_white_australia_policy White Australia policy ends], National Museum of Australia. Retrieved 3 December 2017. Holt maintained that \"every country reserves to itself the right to decide what the composition of its people shall be\", and promised \"a community life free from serious minority and racial problems\".[http://trove.nla.gov.au/newspaper/article/105890727/11617882 \"'We are a capital importing country': Mr Holt\"], The Canberra Times, 9 March 1966. Retrieved 3 December 2017. He was careful to frame his changes as simply a modification of existing policy, in order to avoid alienating organised labour (historically the greatest supporters of restricting non-white immigration). The Labor Party had only removed \"White Australia\" from its platform in 1965, and Opposition Leader Arthur Calwell stated he was \"determined to continue to oppose, for many obvious reasons, any attempt to create a multi-racial society in our midst\".[https://electionspeeches.moadoph.gov.au/speeches/1966-arthur-calwell Australian Federal Elections Speeches: Arthur Calwell], Museum of Australian Democracy. Retrieved 3 December 2017. However, Holt was less circumspect outside Australia, telling British journalists that no White Australia policy existed and ordering Australian embassies to promote the changes to Asian governments and media outlets.[http://trove.nla.gov.au/newspaper/article/107881136 \"Holt, Wilson in weekend meeting\"], The Canberra Times, 11 July 1966. Retrieved 3 December 2017.\n\nConstitutional reform\n\nIn 1967, the Holt Government amended the constitution to alter section 51 (xxvi) and remove section 127. This gave the federal government the power to legislate specifically for Indigenous Australians, and also allowed indigenous people to be enumerated in the census. The constitutional amendments required a referendum before they could be enacted, which passed with over 90 percent of the vote; it remains the largest referendum majority in Australian history. Holt personally considered the amendments unnecessary and mostly symbolic, but thought they would be well received by the international community (particularly Asia).Frame (2005), p. 213. According to Barrie Dexter, he was privately shocked by the referendum result, having been uncertain whether it would even pass.Frame (2005), p. 214.\n\nHolt came to regard the referendum as indicative of a shift in the national mood. In the following months, he toured Aboriginal communities and consulted with indigenous leaders, including Charles Perkins and Kath Walker. Despite opposition from state governments, he created a new Office of Aboriginal Affairs within the Prime Minister's Department, as well as a new advisory body called the Council of Aboriginal Affairs (chaired by H. C. Coombs).Frame (2005), p. 215. According to Coombs and Paul Hasluck, Holt had little interest in indigenous affairs before becoming prime minister. Despite this, he brought about a fundamental shift in the way policy was handled, paving the way for the federal government to assume many of the powers and responsibilities that had previously been the preserve of the states. Indigenous academic Gary Foley has said that Holt's death was a setback for Aboriginal people, as his successors did not show the same commitment to the framework that he established.Foley, Gary, [https://www.theguardian.com/australia-news/2017/may/27/harold-holts-death-and-why-the-1967-referendum-failed-indigenous-people Harold Holt's death and why the 1967 referendum failed Indigenous people], The Guardian Australia, 27 May 2017. Retrieved 14 October 2017.\n\nThe Holt Government also unsuccessfully attempted to remove section 24 of the constitution (the so-called \"nexus clause\"), which requires the number of members in the House of Representatives to be \"as nearly as practicable, twice the number of senators\". The resulting referendum did not come close to passing, with only 40 percent voting in favour nation-wide and only one state (New South Wales) recording a majority. All three major-party leaders campaigned for the \"Yes\" vote, while opposition came mainly from Coalition backbenchers and Democratic Labor Party senators. Supporters of the \"No\" vote successfully argued that section 24 protected the influence of the Senate, and thus the interests of less populous states and rural areas.[http://insidestory.org.au/the-forgotten-1967-referendum/ \"The forgotten 1967 referendum\"], Inside Story, 26 May 2017. Retrieved 10 December 2017. Holt did make one other significant legal reform, albeit one that did not require a constitutional amendment. In September 1967, he announced that his government would use section 74 of the constitution to remove the potential for High Court cases to be appealed to the Judicial Committee of the Privy Council. The necessary legislation was not passed until after his death.\n\nThe arts\n\nIn November 1967, in one of his last major policy statements, Holt announced the establishment of the National Gallery of Australia and the Australia Council for the Arts. The National Gallery, which did not open until 1982, was the first arts-related major infrastructure project to be funded by the federal government; previous projects had been funded by state governments or by private subscription. Holt said it would \"add significantly to the cultural life of Australia and the national capital\".[http://trove.nla.gov.au/newspaper/article/106980131 \"Work to begin on National Gallery\"], The Canberra Times, 2 November 1967. Retrieved 3 December 2017. The other element of his announcement, the Australia Council for the Arts, was the first national arts council, intended to provide arms-length advice to the Prime Minister's Department on arts funding.[http://trove.nla.gov.au/newspaper/article/106980333 \"New council for the arts\"], The Canberra Times, 2 November 1967. Retrieved 3 December 2017. Rupert Myer has suggested that \"Holt's legacy ought to be a core belief in, and broad public demand for, the sustained support of cultural activity from all three tiers of government\".Myer, Rupert, [http://www.theaustralian.com.au/opinion/cherish-harold-holts-legacy-so-the-arts-can-flourish/news-story/0a72e3c21d885f2dd523c59db7f3cb42 \"Cherish Harold Holt’s legacy so the arts can flourish\"], The Australian, 1 November 2017. Retrieved 3 December 2017.\n\nForeign policy\n\nHolt believed it was his responsibility as prime minister \"to reflect the modern Australia to my fellow countrymen, to our allies and the outside world at large\".Frame (2005), p. 158. His approach to national security emphasised opposition to international communism and the need to engage more with Asia. Holt said that the \"great central fact of modern history\" was \"the tremendous power conflict between the communist world and the free world\".Frame (2005), p. 167.  He was a strong believer in the domino theory and containment, holding that communism had to be fought wherever it occurred in order to prevent it spreading to neighbouring countries. In April 1967, Holt told parliament that \"geographically we are part of Asia, and increasingly we have become aware of our involvement in the affairs of Asia – our greatest dangers and our highest hopes are centred in Asia's tomorrows\". Gough Whitlam said that Holt \"made Australia better known in Asia and he made Australians more aware of Asia than ever before [...] this I believe was his most important contribution to our future\".[http://www.menziesrc.org/news/item/australia-s-17th-prime-minister-proved-no-holt-on-national-progress Australia’s 17th Prime Minister Proved no Holt on National Progress], Menzies Research Centre, 3 November 2017. Retrieved 9 December 2017.\n\nPersonal diplomacy was Holt's strong point – he believed diplomatic ties could be strengthened by making intimate connections with other world leaders.[http://insidestory.org.au/harold-holt-and-the-art-of-personal-diplomacy/ \"Harold Holt and the art of personal diplomacy\"], Inside Story, 1 July 2016. Retrieved 10 December 2017. This approach was disliked by his external affairs minister, Paul Hasluck, who in his memoirs accused him of believing in \"instant diplomacy\" and crediting his personal charms for advances made by diplomatic officials.Frame (2005), p. 175. As prime minister, Holt's first overseas trip was to South-East Asia in April 1966, where he visited Malaysia, Singapore, South Vietnam, and Thailand.Frame (2005), p. 179. He toured Cambodia, Laos, South Korea, and Taiwan in March and April 1967, and had planned to visit Burma, India, Indonesia, Japan, and Pakistan in 1968.[https://trove.nla.gov.au/newspaper/article/107037571 \"A human approach to great issues\"], The Canberra Times, 18 December 1967. Retrieved 9 December 2017. Most of those countries had never before been visited by an Australian prime minister.Frame (2005), p. 192. There were also a number of reciprocal visits from Asian leaders, including Eisaku Satō of Japan, Souvanna Phouma of Laos, and Thanom Kittikachorn of Thailand. The most controversial of those occurred in January 1967, when Prime Minister Nguyễn Cao Kỳ of South Vietnam visited on Holt's personal invitation – issued without consulting cabinet. Public sentiment was beginning to turn against the war, and Ky's visit was met with large demonstrations; opposition leader Arthur Calwell issued a statement calling him a \"miserable little butcher\". Ky nonetheless handled himself well, and The Bulletin called his visit a \"personal triumph\".Frame (2005), p. 191.\n\nVietnam War\n\nThe Vietnam War was the dominant foreign policy issue during Holt's term in office. He was a strong supporter of Australian involvement in the war, which had begun in 1962, and accused its critics of adopting a \"Lotus Land\" attitude.Frame (2005), p. 197. As well as citing Australia's SEATO obligations to South Vietnam, Holt justified the war on the grounds that Australia was morally obligated to \"resist communist subversion and aggression\" and \"defend the right of every people to choose their own social and economic order\". He held that \"unless there is security for all small nations, there cannot be security for any small nation\".[https://electionspeeches.moadoph.gov.au/speeches/1966-harold-holt Australian Federal Election Speeches: Harold Holt], Museum of Australian Democracy. Retrieved 10 December 2017.\n\nIn March 1966, Holt announced that the 1st Battalion, Royal Australian Regiment, would be withdrawn and replaced by the 1st Australian Task Force, a self-contained brigade-sized unit based at Nui Dat. This effectively tripled the number of Australian troops in Vietnam to around 4,500, and also included 1,500 national servicemen – the first conscripts to serve in the conflict.Frame (2005), p. 178. By the final months of Holt's prime ministership, Australia had over 8,000 personnel stationed in South Vietnam, drawn from all three branches of the Australian Defence Force; the final troop increase was announced in October 1967. Holt \"never deviated from his whole-hearted support for American bombing of North Vietnam and the hope that steadily increasing the number of foreign troops deployed to South Vietnam would lead to military victory and a solution to the crisis\".Frame (2005), p. 203. John Gorton later that it was \"ironical that, being a man of peace, he should have presided over one of the greatest build-ups of military power that Australia has found itself engaged in\".Frame (2005), p. 270.\n\nThe government's handling of the war initially enjoyed broad public support, and was considered a key contributor to the landslide election victory in 1966 – referred to by some as a \"khaki election\".Frame (2005), p. 188. By the end of the following year, however, opinion polls were showing that public sentiment had turned against the war, and previously supportive media outlets had begun to criticised Holt's decision-making.Frame (2005), p. 201. He did not live long enough to see the mass demonstrations experienced by his successors. Political opposition to the war was initially led by Opposition Leader Arthur Calwell, who promised a total withdrawal from the conflict and labelled it a \"cruel, unwinnable civil war\". His replacement, Gough Whitlam, adopted a more pragmatic approach, focusing on policy specifics (particularly the government's apparent lack of an exit strategy) rather than the validity of the war itself.Frame (2005), p. 200.\n\n\"All the way with LBJ\"\n\nHolt cultivated a close relationship with the United States under President Lyndon B. Johnson. He believed that \"without the American shield most of us who live in Asia and the South Pacific would have a continuing sense of insecurity\". Co-operation between the two countries extended beyond the Vietnam War. Holt approved the construction of several Earth stations for use by NASA and American intelligence agencies, including Pine Gap, Honeysuckle Creek, and Tidbinbilla. This made Australia \"the most substantial centre for American missile and space operations outside the continental United States\".Frame (2005), p. 190.\n\nHolt and Johnson developed a personal friendship. They were the same age, and had first met in 1942, when Johnson visited Melbourne as a naval officer; afterwards they shared a similar career trajectory. Holt visited the U.S. twice while in office, in June and July 1966, and on the latter visit was invited to stay at Camp David. He and Johnson reportedly played tennis, lounged by the pool, and watched movies together.[http://www.theaustralian.com.au/all-the-way-and-beyond/news-story/5027b3daabfa592207fc491f21adfaa1 All the way, and beyond], The Australian, 4 November 2013. Retrieved 15 December 2017.[https://providencemag.com/2017/02/lbjs-australian-bromance/ LBJ’s Australian Bromance], 8 February 2017. Retrieved 15 December 2017. In October 1966, Johnson made the first visit to Australia by an incumbent American president; Vice President Hubert Humphrey had visited in February of that year. He toured five cities, and was greeted by large crowds as well as a number of anti-war demonstrators, who disrupted the presidential motorcade. The opposition criticised the visit as a publicity stunt.Frame (2005), p. 163–164. Johnson later returned to Australia for Holt's memorial service, and invited his widow Zara to stay with him when she visited the United States in 1969.\n\nOn his first visit to the U.S., Holt made what was widely viewed as a faux pas while delivering a ceremonial address at the White House. Departing from his prepared remarks, he said: \"And so, sir, in the lonelier and perhaps even more disheartening moments which come to any national leader, I hope there will be a corner of your mind and heart which takes cheer from the fact that you have an admiring friend, a staunch friend that will be all the way with LBJ.\"Frame (2005), p. 181. Holt had meant it to be a \"light-hearted gesture of goodwill towards a generous host\", referencing the slogan used in Johnson's 1964 presidential campaign.Frame (2005), p. 182. It was interpreted as such by his immediate audience, but once it was reported back in Australia it came to be viewed as a \"foolish, sycophantic and dangerous statement\" that was indicative of Australian subservience. Bill Hayden said Holt's remarks \"shocked and insulted many Australians [...] its seeming servility was an embarrassment and a worry\".Frame (2005), p. 183. Newspaper editorials generally agreed with Holt's assertion that he had been misinterpreted, but still criticised him for making an error in judgment.Frame (2005), p. 184. His comments intensified anti-war sentiments among those who were already opposed to the war, but had little electoral impact. Nonetheless, \"all the way with LBJ\" is still remembered as Holt's \"best-known utterance\".\n\nBritain and the Commonwealth\n\nHolt was a strong supporter of the Commonwealth of Nations, and believed its member states had moral obligations to one another – particularly Britain, as the former colonial power.Frame (2005), p. 195. However, his relationship with Harold Wilson, the British prime minister, was somewhat frosty. He repeatedly lobbied Wilson to maintain a strong British presence \"East of Suez\", in order to complement American efforts, and in early 1967 received assurances that no reduction was being contemplated. However, by the middle of the year Wilson had announced that Britain intended to close all of its bases in Asia by the early 1970s (except for Hong Kong).Frame (2005), p. 194. In response to Australia's concerns, it was suggested that a British naval base could be established in Cockburn Sound.Frame (2005), p. 193. Holt rejected this outright, and felt that Wilson had deliberately misled him as to the UK's intentions.Frame (2005), pp. 193, 196.\n\nControversies\n\nHolt's popularity and political standing was damaged by his perceived poor handling of a series of controversies that emerged during 1967. In April, the ABC's new nightly current affairs program This Day Tonight ran a story which criticised the government's decision not to reappoint the Chair of the ABC Board, Sir James Darling. Holt responded rashly, questioning the impartiality of the ABC and implying political bias on the part of journalist Mike Willesee (whose father Don Willesee was an ALP Senator and future Whitlam government minister), and his statement drew strong protests from both Willesee and the Australian Journalists' Association.\n\nIn May, increasing pressure from the media and within the Liberal Party forced Holt to announce a parliamentary debate on the question of a second inquiry into the 1964 sinking of HMAS Voyager to be held on 16 May. The debate included the maiden speech by newly elected NSW Liberal MP Edward St John QC, who used the opportunity to criticize the government's attitude to new evidence about the disaster. An enraged Holt interrupted St John's speech, in defiance of the parliamentary convention that maiden speeches are heard in silence; his blunder embarrassed the government and further undermined Holt's support in the Liberal Party. A few days later, Holt announced a new Royal Commission into the disaster.\n\nIn October the government became embroiled in another embarrassing controversy over the alleged misuse of VIP aircraft, which came to a head when John Gorton (Government Leader in the Senate) tabled documents that showed that Holt had unintentionally misled Parliament in his earlier answers on the matter. Support for his leadership was eroded even further by his refusal to sack the Minister for Air, Peter Howson, in order to defuse the scandal, fuelling criticism from within the party that Holt was \"weak\" and lacked Menzies' ruthlessness. Much of the blame for the episode within the Public Service was visited upon Sir John Bunting, Secretary of the Prime Minister's Department, although other figures such as the Deputy Secretary Peter Lawler were able to protect themselves. One of John Gorton's first acts upon becoming Prime Minister in January 1968 was to sideline Bunting by creating a separate Department of the Cabinet Office with Bunting as its head, and replaced him with Lenox Hewitt.\n\nIn November 1967, the government suffered a serious setback in the Senate election, winning just 42.8 per cent of the vote against Labor's 45 per cent. The coalition also lost the seats of Corio and Dawson to Labor in by-elections. Alan Reid says that, within the party, the reversal was blamed on Holt's mishandling of the VIP planes scandal. Disquiet was growing about his leadership style and possible health problems.\n\nDisappearance\n\nHolt loved the ocean, particularly spearfishing, and had holiday homes at Portsea, Victoria, and Bingil Bay, Queensland.Frame (2005), p. 272. On 17 December 1967, while Holt was spending the weekend at Portsea, he and four companions decided to drive to Point Nepean to watch sailor Alec Rose pass through The Rip on his solo circumnavigation attempt. On their way back to Portsea, Holt convinced the group to stop at remote Cheviot Beach for a swim before lunch – he had spearfished there on many previous occasions, and claimed to \"know this beach like the back of my hand\". Because of the rough conditions, only one other person, Alan Stewart, joined Holt in the water. Stewart kept close to shore, but Holt swam out into deeper water and was seemingly caught up in a rip current, eventually disappearing from view. One of the witnesses, Marjorie Gillespie, described it as \"like a leaf being taken out [...] so quick and final\".Frame (2005), pp. 248–250.\n\nHolt's disappearance sparked \"one of the largest search operations in Australian history\", but no trace of his body was ever found.Frame (2005), p. 250. A police report released in early 1968 made no definitive findings about Holt's death, while a coronial inquest in 2005 returned a verdict of accidental drowning. It is generally accepted that Holt overestimated his swimming ability.Frame (2005), p. 275. Some have alleged that Holt committed suicide, but those close to him rejected this as uncharacteristic of his personality.Frame (2005), p. 277. Conspiracy theories have included suggestions that Holt faked his own death, was assassinated by the CIA, or was collected by a submarine so that he could defect to China.Frame (2005), pp. 278–293.\n\nA memorial service for Holt was held at St Paul's Cathedral, Melbourne, on 22 December, and attended by numerous world leaders.Frame (2005), p. 267. Aged 59 at the time of his death, Holt became the third Australian prime minister to die in office, after Joseph Lyons (1939) and John Curtin (1945). John McEwen, the leader of the Country Party, was sworn in as caretaker prime minister on 19 December.Frame (2005), p. 254. The Liberal Party held a leadership election on 9 January 1968, in which John Gorton defeated Paul Hasluck, Billy Snedden, and Les Bury. Gorton was a member of the Senate, and in line with constitutional convention transferred to the House of Representatives at the by-election caused by Holt's death.Frame (2005), p. 269.\n\nPersonal life\n\nRelationships\n\nWhile at university, Holt met Zara Dickins, the daughter of a Melbourne businessman; there was an \"instant mutual attraction\". They made plans to marry once Holt had graduated, but after a financial dispute chose to separate. Zara went on a trip to Britain, where she was introduced to James Fell, a British Indian Army officer. She accompanied Fell to India, and then in early 1935 returned to Australia where Holt again proposed marriage. She declined his offer, and married Fell a short time later, going to live with him in Jabalpur. Holt had entered parliament by that time, and was soon being profiled as \"the most eligible bachelor in parliament\". He briefly dated Lola Thring, the daughter of his father’s business partner, F. W. Thring, but his widowed father was also interested in her (to his son's \"disgust\"). Tom Holt married Lola in 1936, and their daughter Frances (Harold's half-sister) was born in 1940; Tom Holt died in 1945.Frame (2005), p. 7.\n\nIn 1937, Zara returned to Australia to give birth to her first child, Nicholas. She had two more children, twins Sam and Andrew, in 1939. Her marriage with Fell broke down a short time later, and in late 1940 she returned to Australia permanently and resumed a relationship with Holt. Their relationship did not become public for some time, in order to avoid Holt being implicated in Zara's divorce proceedings.Frame (2005), p. 8. They eventually married on 8 October 1946, at Zara's parents' home on St Georges Road, Toorak.Frame (2005), p. 33. They initially lived on nearby Washington Street, but in 1954 bought the St Georges Road house.Frame (2005), p. 34. Holt legally adopted Zara's three children, and as young men they changed their surname to his.Frame (2005), p. 55. According to biographer Tom Frame, it was an \"open secret\" that Holt was the biological father of the twins, as they shared his physical appearance and had been conceived at a time when Zara was known to have been in Melbourne.\n\nZara Holt was a successful businesswoman, owning a chain of dress shops, and out-earned her husband even as prime minister. It was her success that allowed the couple to purchase two holiday homes, one at Portsea, Victoria, and the other at Bingil Bay, Queensland.Frame (2005), pp. 114–115 She nonetheless made sacrifices for her husband's political career, accompanying him on all but one of his overseas trips, which could last for weeks. After her husband's death, Zara remarried in 1969 to one of his Liberal Party colleagues, Jeff Bate.Frame (2005), p. 304. She was widowed a second time in 1984, and died in 1989. In a 1988 interview with The Sydney Morning Herald, Zara stated that her husband had carried on \"dozens\" of extramarital affairs.Frame (2005), p. 305. In his biography of Holt, Tom Frame wrote: \"I have not included the names of women with whom Holt allegedly had a sexual relationship because I was unable to confirm or deny that most of these relationships took place […] by their very nature they were always illicit and Holt was very discreet.\"Frame (2005), p. xvii.\n\nReligious beliefs\n\nHolt has been described as an \"apathetic agnostic\". He was baptised Anglican, attended Methodist schools, and married with Presbyterian forms, but neither he nor his wife had any interest in religion. His lack of religiosity apparently had little impact on his political prospects, and was not generally remarked upon.Williams (2013), p. 141. Alick Downer believed that Holt's thoughts \"lay in this world not the next\".Williams (2013), p. 144. According to his friend Simon Warrender, he \"was an agnostic whose raison d'être was dedication to his career\".Frame (2005), p. 266. Holt had a reputation as something of a fatalist, and frequently quoted from Andrew Marvell's carpe diem poem \"To His Coy Mistress\".Williams (2013), p. 143. He was also fond of Rudyard Kipling's poem \"If—\", which Warrender said he used as a \"guiding light in his political and private life\".\n\nMemorials and other legacies\n\nHarold Holt is most famously commemorated by the Harold Holt Memorial Swimming Centre in the Melbourne suburb of Glen Iris. The complex was under construction at the time of Holt's disappearance, and since he was the local member, it was named in his memory. The irony of commemorating a man who is presumed to have drowned with a swimming pool has been a wry source of amusement to many Australians.Bryson, Bill. In a Sunburned Country (Broadway Books, New York, 2000) \n\nIn 1968, the newly commissioned United States Navy Knox class destroyer escort USS Harold E. Holt (FF-1074) was named in his honour. She was launched by Holt's widow Dame Zara at the Todd Shipyards in Los Angeles on 3 May 1969, and was the first American warship to bear the name of a foreign leader.\n\nIn 1969, a plaque commemorating Holt was bolted to the seafloor off Cheviot Beach after a memorial ceremony. It bears the inscription:\n\nOther memorials include:\n\n* the suburb of Holt, Australian Capital Territory;\n* the Naval Communication Station Harold E. Holt;\n* the Division of Holt, an electoral district in the Australian House of Representatives in Victoria;\n* a sundial and garden in the Fitzroy Gardens, Melbourne;\n* a wing for boarders at Wesley College, Melbourne;\n* the Harold Holt Fisheries Reserves – five protected areas in southern Port Phillip, located at Swan Bay, Point Lonsdale, Mud Islands, Point Nepean and Pope's Eye (The Annulus). \n* a memorial stone within the 'Prime Ministers Garden' of Melbourne General Cemetery\n\nBy way of a folk memorial, he is recalled in the Australian vernacular expression \"do a Harold Holt\" (or \"do the Harry\"), rhyming slang for \"do a bolt\" meaning \"to disappear suddenly and without explanation\", although this is usually employed in the context of disappearance from a social gathering rather than a case of presumed death.Lambert, James (2004) The Macquarie Australian Slang Dictionary, p. 69 (Macquarie Library: Sydney) \n\nIn the Queen's Birthday Honours of June 1968, Holt's widow Zara Holt was made a Dame Commander of the Order of the British Empire, becoming Dame Zara Holt DBE. She later married for a third time, to a Liberal party colleague of Holt's, Jeff Bate, and was then known as Dame Zara Bate.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Harold Holt" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13867" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Harold Edward Holt,  (5 August 190817 December 1967), was an Australian politician who served as the 17th Prime Minister of Australia, in office from 1966 until his presumed drowning death.\n\nHolt was born in Sydney, but lived in Melbourne from a young age. He studied law at the University of Melbourne and eventually opened his own legal practice. Holt entered parliament at a 1935 by-election, standing for the United Australia Party (UAP). He was a protégé of Robert Menzies, and was added to cabinet – aged only 30 – when Menzies became prime minister for the first time in 1939. He held a series of minor portfolios until the government's defeat in 1941, serving under both Menzies and Arthur Fadden. Holt's tenure was interrupted by a brief stint in the Australian Army, which ended when he was recalled to cabinet following the deaths of three ministers in the 1940 Canberra air disaster. He joined the new Liberal Party upon its creation in 1945.\n\nWhen Menzies regained the prime ministership in 1949, Holt became a senior figure in the new government. As Minister for Immigration (1949–56), he  expanded the post-war immigration scheme and relaxed the White Australia policy for the first time. He was also influential as Minister for Labour and National Service (1949–58), where he handled several industrial relations disputes. Holt was elected deputy leader of the Liberal Party in 1956, and after the 1958 election replaced Arthur Fadden as Treasurer. He oversaw the creation of the Reserve Bank of Australia and the decimal Australian dollar, but was blamed for a credit crunch that almost cost the Coalition the 1961 election. However, the economy soon rebounded and Holt retained his place as Menzies' heir apparent.\n\nHolt became prime minister in January 1966, elected unopposed as Liberal leader following Menzies' retirement. He fought a general election later that year, winning a landslide victory. The Holt Government continued the dismantling of the White Australia policy, amended the constitution to give the federal government responsibility for indigenous affairs, and took Australia out of the sterling area. Holt promoted greater engagement with Asia and the Pacific, and made visits to a number of Asian countries. His government expanded Australia's involvement in the Vietnam War, and maintained close ties with the United States under President Lyndon B. Johnson. While visiting the White House, Holt famously proclaimed that he was \"all the way with LBJ\", a remark which was poorly received at home.\n\nAfter just under two years in office, Holt disappeared while swimming at Cheviot Beach, Victoria, in rough conditions. His body was never recovered, and he was declared dead in absentia; his disappearance spawned a number of conspiracy theories. Holt was the third Australian prime minister to die in office, and was succeeded by John McEwen on an interim basis and then by John Gorton. His death was commemorated in a number of ways, most famously by the Harold Holt Memorial Swimming Centre.\n\nEarly life \n\nBirth and family background\n\nHolt was born in Sydney on 5 August 1908, in his parents' home at 58 Cavendish Street, Stanmore. He was the first of two sons born to Thomas James Holt and the former Olive May Pearce – his younger brother Clifford was born in 1910. On his father's side, Holt was descended from James Holt, a cobbler from Birmingham, England, who had arrived in New South Wales in 1829.Frame (2005), p. 3. His paternal grandfather, Thomas Holt Sr., owned a large property in Nubba, and was twice elected mayor of nearby Wallendbeen. Holt's father had left home at a young age to support the family, training as a schoolteacher in Sydney and eventually finding work as a physical education teacher at the Cleveland Street School in Surry Hills. Holt's mother was born in Eudunda, South Australia, and had Cornish, English, German, and Irish ancestry; her sister was the actress Vera Pearce.\n\nEducation\n\nIn 1914, Holt's parents moved to Adelaide, where his father became the licensee of a hotel in Payneham. He and his brother stayed behind in Sydney, living with an uncle and attending Randwick Public School. In late 1916, Holt was sent to live with grandparents in the country, where he briefly attended the Nubba State School. He returned to Sydney the following year, and for three years was enrolled at Abbottsholme College, a private school in Killara; his parents separated around that time. In 1920, Holt began boarding at Wesley College, Melbourne. He was a popular and talented student, winning a scholarship in his final year and graduating second in his class. Holt generally spent school holidays with his relatives in Nubba or with schoolmates, rather than with his parents – his father had begun working as a talent agent, touring the country on the Tivoli circuit, while his mother died in 1925. He was 16 at the time, and was unable to attend the funeral.Frame (2005), p. 5.\n\nIn 1927, Holt began studying law at the University of Melbourne, living at Queen's College on a scholarship. He represented the university in cricket and football, and was also active in various student organisations, serving as president of the Law Students' Society and of the Queen's College social club. Holt won prizes for oratory and essay-writing, and was a member of the inter-university debating team. He graduated with a Bachelor of Laws degree in 1930. Holt's father – living in London – invited to him to continue his studies in England, but he declined the offer.Frame (2005), p. 6.\n\nLegal career\n\nHolt served his articles of clerkship with the firm of Fink, Best, & Miller. He was admitted to the Victorian Bar in late 1932, and opened his own legal practice the following year. However, clients during the Depression were scarce and frequently underpaid, so Holt lived in a boardinghouse and often relied upon the hospitality of friends. Drawing on his family connections in show business, he eventually accepted an offer to become secretary of the Victorian Cinematograph Exhibitors' Association, a film industry lobby group. In this capacity he appeared several times before the Commonwealth Court of Conciliation and Arbitration.[http://adb.anu.edu.au/biography/holt-harold-edward-10530 Australian Dictionary of Biography]. 1996Frame (2005), p. 9. This had a positive affect on his own practice, and he eventually took on two partners, first Jack Graham and later James Newman.Frame (2005), p. 13. The firm of Holt, Graham, & Newman was dissolved in 1963, following a financial dispute and subsequently reconstituted as Holt, Newman, & Holt, with Holt's son Sam as the new addition. Holt's involvement in the practice declined once he entered politics and ceased altogether in 1949, although he did not formally retire until assuming the prime ministership.Frame (2005), p. 306.\n\nEarly political career\n\nIn 1933, Holt joined the Young Nationalists, the youth wing of the United Australia Party.Frame (2005), p. 9. He cultivated a friendship with Mabel Brookes, and through Brookes became acquainted with senior members of the influential Australian Women's National League (AWNL). He also secured the patronage of Robert Menzies, with whom he shared a similar background and political views.Frame (2005), p. 11. At the 1934 federal election, Holt stood for the UAP in the Division of Yarra. It was a safe seat for the Labor Party, held by the party's leader (and former prime minister) James Scullin. Holt lost heavily, as was expected, but was praised for his campaigning. Early the following year, he contested Clifton Hill – another safe Labor seat – at the Victorian state election, losing to Bert Cremean.Frame (2005), p. 10. Holt was eventually elected to parliament on his third attempt, winning a federal by-election in August 1935; his predecessor, George Maxwell, had died in office. He won UAP preselection against five other candidates, a victory which Smith's Weekly attributed to his \"political godmothers\" in the AWNL.[http://trove.nla.gov.au/newspaper/article/234615406 Political Godmothers Rule U.A.P. With Haughty Mien], Smith's Weekly, 10 August 1935. His new electorate, the Division of Fawkner, was centred on Melbourne's wealthy inner-eastern suburbs.Frame (2005), p. 12.\n\nHolt was 27 when he entered parliament, making him its youngest member. He kept a relatively low profile in his first few years, but spoke on a wide range of topics.Frame (2005), pp. 12–15. When Robert Menzies became prime minister in April 1939, he made Holt one of four ministers without portfolio. His inclusion was made possible by the collapse of the coalition with the Country Party – previously a certain number of positions had been reserved for Country MPs, but the new ministry was composed solely of UAP members.Frame (2005), p. 16. Although Holt officially had no portfolio, he effectively served as an assistant minister to Richard Casey, who headed the Department of Supply and Development. He was given responsibility for the Council for Scientific and Industrial Research (CSIR),Frame (2005), p. 17. and also acted for periods as Minister for Trade and Customs and Minister for Civil Aviation and Air while the incumbents were overseas.Frame (2005), p. 18. Holt's first stint as a government minister came to an end in March 1940, when the coalition with the Country Party was reinstituted. His replacement was Arthur Fadden, another future prime minister.Frame (2005), p. 19.\n\nWorld War II\n\nHolt enlisted in the Militia in February 1939, joining a part-time artillery unit for businessmen and professionals. He was given indefinite leave during his ministerial service.Frame (2005), pp. 16–17. In May 1940, without resigning his seat, Holt enlisted in the Australian Imperial Force with the intent of becoming a full-time soldier. Several of his parliamentary colleagues did likewise at various points in the war. Holt was posted to the 2/4th Field Regiment, holding the rank of gunner. He had been offered a commission as an officer in the Royal Australian Air Force, but declined due to his lack of experience. In a press statement, Holt said \"as the youngest member of the House, I could not feel happy in my position if I were not prepared to make some sacrifice and take an active part\".Frame (2005), p. 20. He was sent to Puckapunyal for training, and expected to be posted to North Africa or Palestine.Frame (2005), p. 21.\n\nHolt's brief military career came to an end as a result of the Canberra air disaster on 13 August, which killed three senior government ministers. Menzies called an early general election for 21 September, which resulted in a hung parliament and a UAP–Country minority government. Holt was given leave from the army to campaign, and won re-election with a large majority. Menzies subsequently asked him to return to cabinet, to which he agreed.Frame (2005), p. 22. Holt was sworn in as Minister for Labour and National Service on 28 October, and formally resigned from the army the same day. He was placed in charge of the new Department of Labour and National Service, which took over most of the responsibilities of the previous Department of Industry.Frame (2005), p. 23. He also became a member of the bipartisan Advisory War Council, although he personally favoured the establishment of a national unity government with the Labor Party.Frame (2005), p. 24.\n\nAs labour minister, Holt's foremost task was to prevent industrial disputes from disrupting the war effort.Frame (2005), p. 25. He met with union leaders and employer groups, and secured their agreement to a streamlining of the arbitration process while the war was underway. He had also been made Minister in charge of Scientific and Industrial Research, which gave him responsibility for the CSIR and its wartime efforts. In April 1941, Holt sponsored and oversaw the passage of the Child Endowment Act, which introduced a universal child endowment scheme; newspapers labelled him \"the godfather to a million Australian children\".Frame (2005), p. 26. When leadership troubles hit the Coalition later in the year, Holt initially supported Menzies. However, he and five cabinet colleagues eventually transferred their allegiance to Arthur Fadden, the leader of the Country Party, believing this way the only to ensure stable government. Menzies felt he had been betrayed, but forgave Holt and accepted his assurances that he had been acting in the best interests of the country.Frame (2005), p. 27.\n\nHolt retained his portfolios in the Fadden Government, which lasted only 40 days before being defeated on a confidence motion in October 1941. After going into opposition, he kept a reasonably low profile for the remainder of the war, except for his membership of the Joint Committee on War Expenditure.Frame (2005), p. 31. He was criticised by some for not re-joining the army,Frame (2005), p. 28. and at the 1943 election was opposed by Brigadier William Cremor, whose campaign was funded by Sydney businessmen (including Keith Murdoch). He lost a significant portion of his primary vote, but suffered only a small swing on the two-party-preferred count.Frame (2005), p. 29. Menzies returned as leader of the UAP in September 1943, and Holt was initially a candidate for the deputy leadership; he withdrew once former prime minister Billy Hughes entered the race.Frame (2005), p. 30. Holt was in favour of the creation of the Liberal Party, but played little role in the practical aspects of its establishment. He became an official member of the new party in February 1945.Frame (2005), p. 32.\n\nPostwar ministerial career\n\nAfter eight years in opposition, the Coalition won the federal election of December 1949 and Menzies began his record-setting second term as Prime Minister. In a redistribution held ahead of that election, Holt's majority in Fawkner nearly disappeared. He transferred to Higgins, one of several new seats created in the 1949 redistribution. The seat was created as a safe Liberal seat; it had been carved out of the wealthier portions of Fawkner. Holt won it easily. He was appointed to the prestigious portfolios of Minister for Labour and National Service (1949–1958; he had previously served in this portfolio 1940–41) and Minister for Immigration (1949–1956), by which time he was being touted in the press as a \"certain successor to Menzies and a potential Prime Minister\". In Immigration, Holt continued and expanded the massive immigration programme initiated by his ALP predecessor, Arthur Calwell. However, he displayed a more flexible and caring attitude than Calwell, who was a strong advocate of the White Australia policy. One of his first acts was to intervene in the so-called \"Gamboa case\", which involved a Filipino immigrant with an Australian wife and children. Calwell had had Gamboa deported under the War-time Refugees Removal Act 1949, but Holt reversed the decision and allowed Gamboa to return to Australia to live.[https://www.theguardian.com/commentisfree/2014/mar/18/annie-white-australia-policy How one refugee signalled the end of the White Australia policy], The Guardian Australia, 18 March 2014. Retrieved 14 December 2017.\n\nHolt excelled in the Labour portfolio and has been described as one of the best Labour ministers since Federation. Although the conditions were ripe for industrial unrest—Communist influence in the union movement was then at its peak, and the right-wing faction in Cabinet was openly agitating for a showdown with the unions—the combination of strong economic growth and Holt's enlightened approach to industrial relations saw the number of working hours lost to strikes fall dramatically, from over two million in 1949 to just 439,000 in 1958.  He also had ministerial responsibility for the Melbourne Olympics in 1956.\n\nHolt fostered greater collaboration between the government, the courts, employers and trade unions. He enjoyed good relationships with union leaders like Albert Monk, President of the Australian Council of Trade Unions; and Jim Healy, leader of the radical Waterside Workers Federation;and he gained a reputation for tolerance, restraint and a willingness to compromise, although his controversial decision to use troops to take control of cargo facilities during a waterside dispute in Bowen, Queensland in September 1953 provoked bitter criticism.\n\nHolt's personal profile and political standing grew throughout the 1950s. He served on numerous committees and overseas delegations, he was appointed a Privy Counsellor in 1953, and in 1954 he was named one of Australia's six best-dressed men. In 1956, he was elected Deputy Leader of the Liberal Party and became Leader of the House, and from this point on, he was generally acknowledged as Menzies' heir apparent.\n\nTreasurer (1958–1966)\n\nIn December 1958, following the retirement of Arthur Fadden, Holt succeeded him as Treasurer. Holt had little knowledge or interest in economics, but the job cemented his position as Menzies' likely successor. As Treasurer, Holt relied strongly on the advice of Treasury secretary Roland Wilson. His achievements included major reforms to the banking system (originated by Fadden)including the establishment of the Reserve Bank of Australiaand the planning and preparation for the introduction of decimal currency. It was Holt who convinced Cabinet to call the new currency the \"dollar\" rather than the \"royal\".\n\nThe economy Holt inherited was growing strongly, aided by the opening of new iron ore mines. However, in 1959, inflation was running at 4.5% and Treasury was alarmed. Holt was reluctant to act, but in November 1960 introduced a deflationary package of tax changes. He also reluctantly agreed to an interest rate rise by the Reserve Bank. The credit squeeze was nicknamed the \"Holt jolt\". The economy went into recession, and unemployment rose to three percent, which was considered high for the time (and contrary to the government's policy of full employment.[http://www.smh.com.au/business/its-half-a-century-since-australia-received-the-holt-jolt-20100222-orwn.html It's half a century since Australia received the Holt Jolt], The Sydney Morning Herald, 23 February 2010. Retrieved 15 December 2017.\n\nThe credit squeeze brought the Coalition dangerously close to losing the 1961 election, with the Coalition being returned with a precarious one-seat majority. There were calls for Holt to be sacked, but he retained Menzies' support. He later described 1960–61 as \"my most difficult year in public life\". Most of the deflationary measures were reversed in 1962, and unemployment dropped down to 1.5 percent by August 1963.Frame (2005), p. 119. In later budgets, Holt retreated to his Queensland holiday home while it was being prepared. He said that the 1965 budget \"has had the best reception yet of any in the series I have presented\".Frame (2005), p. 127.\n\nPrime Minister (1966–1967)\n\nHolt was sworn in as prime minister on 26 January 1966, following the retirement of Robert Menzies six days earlier. He won the leadership election unopposed, with William McMahon elected as his deputy.Frame (2005), p. 137. His swearing in was delayed by the death of Defence Minister Shane Paltridge; he and Menzies both served as pallbearers at Paltridge's state funeral on 25 January.[https://trove.nla.gov.au/newspaper/article/105883346 \"Paltridge to have state funeral\"], The Canberra Times, 22 January 1966. Retrieved 7 December 2017.[https://trove.nla.gov.au/newspaper/article/105883911 \"Hundreds pay last respects\"], The Canberra Times, 26 January 1966. Retrieved 7 December 2017. Holt was the first Australian prime minister born in the 20th century and the first born after federation. He was almost fourteen years younger than his predecessor, but, at the age of 57, was still the fourth-oldest man to assume the office. He had been an MP for over 30 years before becoming prime minister, a record surpassed only by his successor John McEwen's 33 years.[http://primeministers.naa.gov.au/primeministers/holt/fast-facts.aspx Fast facts: Harold Holt], National Archives of Australia. Retrieved 7 December 2017. Stylistically, Holt was more informal and contemporary than Menzies, and his wife accompanied him into the political spotlight. He gave the media an unprecedented level of access, and was the first prime minister to conduct regular press conferences and grant regular television interviews. His press secretary, Tony Eggleton, accompanied him virtually every time he travelled.Frame (2005), pp. 147–148.\n\nHolt's initial cabinet was virtually unchanged from that of his predecessor. John Gorton and Les Bury were promoted to replace Menzies and Paltridge, but there were no other changes in composition. There were also no major changes in portfolio, outside of McMahon's promotion to Treasurer in place of Holt. A notable addition to the outer ministry was Senator Annabelle Rankin as Minister for Housing – the first woman to hold a ministerial portfolio.Frame (2005), p. 141. A minor reshuffle occurred after the 1966 election, with Doug Anthony and Ian Sinclair added to cabinet and Charles Barnes demoted to the outer ministry. The only new government department created during Holt's tenure was the Department of Education and Science, established in December 1966, which was the first federal department specific to either of those areas.\n\nElections\n\nOn 26 November 1966, Holt fought his first and only general election as prime minister, winning a somewhat unexpected landslide victory. The Coalition secured 56.9 percent of the two-party-preferred vote, gaining 10 seats and bringing its total number of seats in the House of Representatives to 82 out of 124; the Liberal Party was only two seats away from forming majority government in its own right. It was a higher margin victory of victory than Menzies had achieved in eight elections as Liberal leader, and was the Labor Party's worst electoral defeat in 31 years.Frame (2005), p. 170.\n\nHolt received little credit for the Coalition's election victory, even from within his own party.Frame (2005), p. 172. It was generally held that the Labor Party's poor campaign had been the major factor in its defeat. Arthur Calwell, the Leader of the Opposition, was 70 years old and had limited personal popularity – a Gallup poll before the election placed his personal approval rating at 24 percent, compared with Holt's 60 percent.Frame (2005), p. 169. Calwell had suffered a damaging rift with his deputy Gough Whitlam earlier in the year, and the general public still perceived the party as divided.Frame (2005), p. 166. In an election where the Vietnam War was a major campaign issue, he and Whitlam publicly contradicted each other on major policy decisions. Labor ran on an anti-war platform, but struggled to appeal to voters concerned about national security; combined with Calwell's dedication to the White Australia policy, this allowed the party to be portrayed as isolationist and naive about external affairs. Calwell was far less telegenic than his opponent, and was seen as gruff and antagonistic where Holt was suave and easy-going. At a rally in Adelaide a week before the election, Calwell accused Holt of having \"chickened out of World War II – just as his three stepsons are chickening out of the war in Vietnam today\". His attack on Holt's family – which he refused to withdraw – was viewed as desperate and undignified, and it was pointed out that, unlike Holt, Calwell had performed no military service in World War II.\n\nIn early 1967, Arthur Calwell retired as ALP leader and Gough Whitlam succeeded him. Whitlam proved a far more effective opponent, both in the media and in parliament, and Labor soon began to recover from its losses and gain ground, with Whitlam repeatedly besting Holt in Parliament. By this time, the long-suppressed tensions between the Coalition partners over economic and trade policies were also beginning to emerge. Throughout his reign as Liberal leader, Menzies had enforced strict party discipline but, once he was gone, dissension began to surface. Some Liberals soon became dissatisfied by what they saw as Holt's weak leadership. Alan Reid asserts that Holt was being increasingly criticised within the party in the months before his death, that he was perceived as being \"vague, imprecise and evasive\" and \"nice to the point that his essential decency was viewed as weakness\".\n\nDomestic policy\n\nAccording to his biographer Tom Frame, \"Holt's inclinations and sympathies were those of the political centre [...] he was a pragmatist rather than a philosopher, but he nonetheless claimed a philosophical lineage connecting him with Alfred Deakin and approvingly quoted his statement that 'we are liberal always, radical often, and reactionary never'.\".Frame (2005), p. 133–134.\n\nEconomy\n\nHolt as prime minister was sometimes criticised for a failure to be assertive on economic matters. A major drought in 1965 had led to slowdown in growth, but he was unwilling to increase public spending in case it increased inflation.Frame (2005), p. 161. The Australian dollar – a legacy of Holt's period as Treasurer – came into circulation on 14 February 1966, less than a month after his prime ministership began. In November 1967, the British government unexpectedly announced that it would be devaluing the pound sterling by 14 percent. Holt announced that the Australian government would not follow suit, effectively withdrawing Australia from the sterling area. The decision was strongly opposed by the Country Party, who feared it would disadvantage primary industry. John McEwen, the Country Party leader, issued a public statement criticising the government, which caused a breakdown in his relations with Holt and nearly led to the collapse of the Coalition. The Bulletin said that the withdrawal was \"quite certain to mean the end of any remaining special relationship between Australia and Britain\".Frame (2005), pp. 239–241. There were no other important economic policy reforms made by the Holt Government, although Australia did become a founding member of the Asian Development Bank in 1966.Frame (2005), p. 180.\n\nImmigration\n\nAs prime minister, Holt continued the liberalisation of immigration law that he had begun as Minister for Immigration. When he came to office, what remained of the White Australia policy was upheld by ministerial decree rather than by explicit legislation. In March 1966, the residency requirement for naturalisation was changed to a uniform five years; it had previously been 15 years for non-whites. Discriminatory provisions relating to family reunification were also removed.[http://trove.nla.gov.au/newspaper/article/105891028 \"New migration policy will aid Japanese\"], The Canberra Times, 11 March 1966. Retrieved 3 December 2017. As a result, in the two years after March 1966 around 3,000 Asian immigrants were granted Australian citizenship,Frame (2005), p. 160. compared with 4,100 in the preceding two decades.[http://trove.nla.gov.au/newspaper/article/105888104 \"Sir Robert rejected migrant plan\"], The Canberra Times, 22 February 1966. Retrieved 3 December 2017. Additionally, Immigration Minister Hubert Opperman announced that potential immigrants to Australia would be assessed solely \"on the basis of their suitability as settlers, their ability to integrate readily, and their possession of qualifications which are in fact positively useful to Australia\";[https://www.moadoph.gov.au/blog/white-australia-policy-the-beginning-of-the-end-50-years-ago/ White Australia policy – the beginning of the end 50 years ago], Museum of Australian Democracy, 9 March 2016. Retrieved 3 December 2017. non-whites had previously had to demonstrate that they were \"highly qualified and distinguished\" to gain entry.\n\nKeith Wilson believed that the Holt Government's reforms ensured that \"from now on there will not be in any of our laws or in any of our regulations anything that discriminates against migrants on the grounds of colour or race\". However, there would not be a practical change in the composition of Australia's immigration intake for many more years.[http://www.nma.gov.au/online_features/defining_moments/featured/end_of_the_white_australia_policy White Australia policy ends], National Museum of Australia. Retrieved 3 December 2017. Holt maintained that \"every country reserves to itself the right to decide what the composition of its people shall be\", and promised \"a community life free from serious minority and racial problems\".[http://trove.nla.gov.au/newspaper/article/105890727/11617882 \"'We are a capital importing country': Mr Holt\"], The Canberra Times, 9 March 1966. Retrieved 3 December 2017. He was careful to frame his changes as simply a modification of existing policy, in order to avoid alienating organised labour (historically the greatest supporters of restricting non-white immigration). The Labor Party had only removed \"White Australia\" from its platform in 1965, and Opposition Leader Arthur Calwell stated he was \"determined to continue to oppose, for many obvious reasons, any attempt to create a multi-racial society in our midst\".[https://electionspeeches.moadoph.gov.au/speeches/1966-arthur-calwell Australian Federal Elections Speeches: Arthur Calwell], Museum of Australian Democracy. Retrieved 3 December 2017. However, Holt was less circumspect outside Australia, telling British journalists that no White Australia policy existed and ordering Australian embassies to promote the changes to Asian governments and media outlets.[http://trove.nla.gov.au/newspaper/article/107881136 \"Holt, Wilson in weekend meeting\"], The Canberra Times, 11 July 1966. Retrieved 3 December 2017.\n\nConstitutional reform\n\nIn 1967, the Holt Government amended the constitution to alter section 51 (xxvi) and remove section 127. This gave the federal government the power to legislate specifically for Indigenous Australians, and also allowed indigenous people to be enumerated in the census. The constitutional amendments required a referendum before they could be enacted, which passed with over 90 percent of the vote; it remains the largest referendum majority in Australian history. Holt personally considered the amendments unnecessary and mostly symbolic, but thought they would be well received by the international community (particularly Asia).Frame (2005), p. 213. According to Barrie Dexter, he was privately shocked by the referendum result, having been uncertain whether it would even pass.Frame (2005), p. 214.\n\nHolt came to regard the referendum as indicative of a shift in the national mood. In the following months, he toured Aboriginal communities and consulted with indigenous leaders, including Charles Perkins and Kath Walker. Despite opposition from state governments, he created a new Office of Aboriginal Affairs within the Prime Minister's Department, as well as a new advisory body called the Council of Aboriginal Affairs (chaired by H. C. Coombs).Frame (2005), p. 215. According to Coombs and Paul Hasluck, Holt had little interest in indigenous affairs before becoming prime minister. Despite this, he brought about a fundamental shift in the way policy was handled, paving the way for the federal government to assume many of the powers and responsibilities that had previously been the preserve of the states. Indigenous academic Gary Foley has said that Holt's death was a setback for Aboriginal people, as his successors did not show the same commitment to the framework that he established.Foley, Gary, [https://www.theguardian.com/australia-news/2017/may/27/harold-holts-death-and-why-the-1967-referendum-failed-indigenous-people Harold Holt's death and why the 1967 referendum failed Indigenous people], The Guardian Australia, 27 May 2017. Retrieved 14 October 2017.\n\nThe Holt Government also unsuccessfully attempted to remove section 24 of the constitution (the so-called \"nexus clause\"), which requires the number of members in the House of Representatives to be \"as nearly as practicable, twice the number of senators\". The resulting referendum did not come close to passing, with only 40 percent voting in favour nation-wide and only one state (New South Wales) recording a majority. All three major-party leaders campaigned for the \"Yes\" vote, while opposition came mainly from Coalition backbenchers and Democratic Labor Party senators. Supporters of the \"No\" vote successfully argued that section 24 protected the influence of the Senate, and thus the interests of less populous states and rural areas.[http://insidestory.org.au/the-forgotten-1967-referendum/ \"The forgotten 1967 referendum\"], Inside Story, 26 May 2017. Retrieved 10 December 2017. Holt did make one other significant legal reform, albeit one that did not require a constitutional amendment. In September 1967, he announced that his government would use section 74 of the constitution to remove the potential for High Court cases to be appealed to the Judicial Committee of the Privy Council. The necessary legislation was not passed until after his death.\n\nThe arts\n\nIn November 1967, in one of his last major policy statements, Holt announced the establishment of the National Gallery of Australia and the Australia Council for the Arts. The National Gallery, which did not open until 1982, was the first arts-related major infrastructure project to be funded by the federal government; previous projects had been funded by state governments or by private subscription. Holt said it would \"add significantly to the cultural life of Australia and the national capital\".[http://trove.nla.gov.au/newspaper/article/106980131 \"Work to begin on National Gallery\"], The Canberra Times, 2 November 1967. Retrieved 3 December 2017. The other element of his announcement, the Australia Council for the Arts, was the first national arts council, intended to provide arms-length advice to the Prime Minister's Department on arts funding.[http://trove.nla.gov.au/newspaper/article/106980333 \"New council for the arts\"], The Canberra Times, 2 November 1967. Retrieved 3 December 2017. Rupert Myer has suggested that \"Holt's legacy ought to be a core belief in, and broad public demand for, the sustained support of cultural activity from all three tiers of government\".Myer, Rupert, [http://www.theaustralian.com.au/opinion/cherish-harold-holts-legacy-so-the-arts-can-flourish/news-story/0a72e3c21d885f2dd523c59db7f3cb42 \"Cherish Harold Holt’s legacy so the arts can flourish\"], The Australian, 1 November 2017. Retrieved 3 December 2017.\n\nForeign policy\n\nHolt believed it was his responsibility as prime minister \"to reflect the modern Australia to my fellow countrymen, to our allies and the outside world at large\".Frame (2005), p. 158. His approach to national security emphasised opposition to international communism and the need to engage more with Asia. Holt said that the \"great central fact of modern history\" was \"the tremendous power conflict between the communist world and the free world\".Frame (2005), p. 167.  He was a strong believer in the domino theory and containment, holding that communism had to be fought wherever it occurred in order to prevent it spreading to neighbouring countries. In April 1967, Holt told parliament that \"geographically we are part of Asia, and increasingly we have become aware of our involvement in the affairs of Asia – our greatest dangers and our highest hopes are centred in Asia's tomorrows\". Gough Whitlam said that Holt \"made Australia better known in Asia and he made Australians more aware of Asia than ever before [...] this I believe was his most important contribution to our future\".[http://www.menziesrc.org/news/item/australia-s-17th-prime-minister-proved-no-holt-on-national-progress Australia’s 17th Prime Minister Proved no Holt on National Progress], Menzies Research Centre, 3 November 2017. Retrieved 9 December 2017.\n\nPersonal diplomacy was Holt's strong point – he believed diplomatic ties could be strengthened by making intimate connections with other world leaders.[http://insidestory.org.au/harold-holt-and-the-art-of-personal-diplomacy/ \"Harold Holt and the art of personal diplomacy\"], Inside Story, 1 July 2016. Retrieved 10 December 2017. This approach was disliked by his external affairs minister, Paul Hasluck, who in his memoirs accused him of believing in \"instant diplomacy\" and crediting his personal charms for advances made by diplomatic officials.Frame (2005), p. 175. As prime minister, Holt's first overseas trip was to South-East Asia in April 1966, where he visited Malaysia, Singapore, South Vietnam, and Thailand.Frame (2005), p. 179. He toured Cambodia, Laos, South Korea, and Taiwan in March and April 1967, and had planned to visit Burma, India, Indonesia, Japan, and Pakistan in 1968.[https://trove.nla.gov.au/newspaper/article/107037571 \"A human approach to great issues\"], The Canberra Times, 18 December 1967. Retrieved 9 December 2017. Most of those countries had never before been visited by an Australian prime minister.Frame (2005), p. 192. There were also a number of reciprocal visits from Asian leaders, including Eisaku Satō of Japan, Souvanna Phouma of Laos, and Thanom Kittikachorn of Thailand. The most controversial of those occurred in January 1967, when Prime Minister Nguyễn Cao Kỳ of South Vietnam visited on Holt's personal invitation – issued without consulting cabinet. Public sentiment was beginning to turn against the war, and Ky's visit was met with large demonstrations; opposition leader Arthur Calwell issued a statement calling him a \"miserable little butcher\". Ky nonetheless handled himself well, and The Bulletin called his visit a \"personal triumph\".Frame (2005), p. 191.\n\nVietnam War\n\nThe Vietnam War was the dominant foreign policy issue during Holt's term in office. He was a strong supporter of Australian involvement in the war, which had begun in 1962, and accused its critics of adopting a \"Lotus Land\" attitude.Frame (2005), p. 197. As well as citing Australia's SEATO obligations to South Vietnam, Holt justified the war on the grounds that Australia was morally obligated to \"resist communist subversion and aggression\" and \"defend the right of every people to choose their own social and economic order\". He held that \"unless there is security for all small nations, there cannot be security for any small nation\".[https://electionspeeches.moadoph.gov.au/speeches/1966-harold-holt Australian Federal Election Speeches: Harold Holt], Museum of Australian Democracy. Retrieved 10 December 2017.\n\nIn March 1966, Holt announced that the 1st Battalion, Royal Australian Regiment, would be withdrawn and replaced by the 1st Australian Task Force, a self-contained brigade-sized unit based at Nui Dat. This effectively tripled the number of Australian troops in Vietnam to around 4,500, and also included 1,500 national servicemen – the first conscripts to serve in the conflict.Frame (2005), p. 178. By the final months of Holt's prime ministership, Australia had over 8,000 personnel stationed in South Vietnam, drawn from all three branches of the Australian Defence Force; the final troop increase was announced in October 1967. Holt \"never deviated from his whole-hearted support for American bombing of North Vietnam and the hope that steadily increasing the number of foreign troops deployed to South Vietnam would lead to military victory and a solution to the crisis\".Frame (2005), p. 203. John Gorton later that it was \"ironical that, being a man of peace, he should have presided over one of the greatest build-ups of military power that Australia has found itself engaged in\".Frame (2005), p. 270.\n\nThe government's handling of the war initially enjoyed broad public support, and was considered a key contributor to the landslide election victory in 1966 – referred to by some as a \"khaki election\".Frame (2005), p. 188. By the end of the following year, however, opinion polls were showing that public sentiment had turned against the war, and previously supportive media outlets had begun to criticised Holt's decision-making.Frame (2005), p. 201. He did not live long enough to see the mass demonstrations experienced by his successors. Political opposition to the war was initially led by Opposition Leader Arthur Calwell, who promised a total withdrawal from the conflict and labelled it a \"cruel, unwinnable civil war\". His replacement, Gough Whitlam, adopted a more pragmatic approach, focusing on policy specifics (particularly the government's apparent lack of an exit strategy) rather than the validity of the war itself.Frame (2005), p. 200.\n\n\"All the way with LBJ\"\n\nHolt cultivated a close relationship with the United States under President Lyndon B. Johnson. He believed that \"without the American shield most of us who live in Asia and the South Pacific would have a continuing sense of insecurity\". Co-operation between the two countries extended beyond the Vietnam War. Holt approved the construction of several Earth stations for use by NASA and American intelligence agencies, including Pine Gap, Honeysuckle Creek, and Tidbinbilla. This made Australia \"the most substantial centre for American missile and space operations outside the continental United States\".Frame (2005), p. 190.\n\nHolt and Johnson developed a personal friendship. They were the same age, and had first met in 1942, when Johnson visited Melbourne as a naval officer; afterwards they shared a similar career trajectory. Holt visited the U.S. twice while in office, in June and July 1966, and on the latter visit was invited to stay at Camp David. He and Johnson reportedly played tennis, lounged by the pool, and watched movies together.[http://www.theaustralian.com.au/all-the-way-and-beyond/news-story/5027b3daabfa592207fc491f21adfaa1 All the way, and beyond], The Australian, 4 November 2013. Retrieved 15 December 2017.[https://providencemag.com/2017/02/lbjs-australian-bromance/ LBJ’s Australian Bromance], 8 February 2017. Retrieved 15 December 2017. In October 1966, Johnson made the first visit to Australia by an incumbent American president; Vice President Hubert Humphrey had visited in February of that year. He toured five cities, and was greeted by large crowds as well as a number of anti-war demonstrators, who disrupted the presidential motorcade. The opposition criticised the visit as a publicity stunt.Frame (2005), p. 163–164. Johnson later returned to Australia for Holt's memorial service, and invited his widow Zara to stay with him when she visited the United States in 1969.\n\nOn his first visit to the U.S., Holt made what was widely viewed as a faux pas while delivering a ceremonial address at the White House. Departing from his prepared remarks, he said: \"And so, sir, in the lonelier and perhaps even more disheartening moments which come to any national leader, I hope there will be a corner of your mind and heart which takes cheer from the fact that you have an admiring friend, a staunch friend that will be all the way with LBJ.\"Frame (2005), p. 181. Holt had meant it to be a \"light-hearted gesture of goodwill towards a generous host\", referencing the slogan used in Johnson's 1964 presidential campaign.Frame (2005), p. 182. It was interpreted as such by his immediate audience, but once it was reported back in Australia it came to be viewed as a \"foolish, sycophantic and dangerous statement\" that was indicative of Australian subservience. Bill Hayden said Holt's remarks \"shocked and insulted many Australians [...] its seeming servility was an embarrassment and a worry\".Frame (2005), p. 183. Newspaper editorials generally agreed with Holt's assertion that he had been misinterpreted, but still criticised him for making an error in judgment.Frame (2005), p. 184. His comments intensified anti-war sentiments among those who were already opposed to the war, but had little electoral impact. Nonetheless, \"all the way with LBJ\" is still remembered as Holt's \"best-known utterance\".\n\nBritain and the Commonwealth\n\nHolt was a strong supporter of the Commonwealth of Nations, and believed its member states had moral obligations to one another – particularly Britain, as the former colonial power.Frame (2005), p. 195. However, his relationship with Harold Wilson, the British prime minister, was somewhat frosty. He repeatedly lobbied Wilson to maintain a strong British presence \"East of Suez\", in order to complement American efforts, and in early 1967 received assurances that no reduction was being contemplated. However, by the middle of the year Wilson had announced that Britain intended to close all of its bases in Asia by the early 1970s (except for Hong Kong).Frame (2005), p. 194. In response to Australia's concerns, it was suggested that a British naval base could be established in Cockburn Sound.Frame (2005), p. 193. Holt rejected this outright, and felt that Wilson had deliberately misled him as to the UK's intentions.Frame (2005), pp. 193, 196.\n\nControversies\n\nHolt's popularity and political standing was damaged by his perceived poor handling of a series of controversies that emerged during 1967. In April, the ABC's new nightly current affairs program This Day Tonight ran a story which criticised the government's decision not to reappoint the Chair of the ABC Board, Sir James Darling. Holt responded rashly, questioning the impartiality of the ABC and implying political bias on the part of journalist Mike Willesee (whose father Don Willesee was an ALP Senator and future Whitlam government minister), and his statement drew strong protests from both Willesee and the Australian Journalists' Association.\n\nIn May, increasing pressure from the media and within the Liberal Party forced Holt to announce a parliamentary debate on the question of a second inquiry into the 1964 sinking of HMAS Voyager to be held on 16 May. The debate included the maiden speech by newly elected NSW Liberal MP Edward St John QC, who used the opportunity to criticize the government's attitude to new evidence about the disaster. An enraged Holt interrupted St John's speech, in defiance of the parliamentary convention that maiden speeches are heard in silence; his blunder embarrassed the government and further undermined Holt's support in the Liberal Party. A few days later, Holt announced a new Royal Commission into the disaster.\n\nIn October the government became embroiled in another embarrassing controversy over the alleged misuse of VIP aircraft, which came to a head when John Gorton (Government Leader in the Senate) tabled documents that showed that Holt had unintentionally misled Parliament in his earlier answers on the matter. Support for his leadership was eroded even further by his refusal to sack the Minister for Air, Peter Howson, in order to defuse the scandal, fuelling criticism from within the party that Holt was \"weak\" and lacked Menzies' ruthlessness. Much of the blame for the episode within the Public Service was visited upon Sir John Bunting, Secretary of the Prime Minister's Department, although other figures such as the Deputy Secretary Peter Lawler were able to protect themselves. One of John Gorton's first acts upon becoming Prime Minister in January 1968 was to sideline Bunting by creating a separate Department of the Cabinet Office with Bunting as its head, and replaced him with Lenox Hewitt.\n\nIn November 1967, the government suffered a serious setback in the Senate election, winning just 42.8 per cent of the vote against Labor's 45 per cent. The coalition also lost the seats of Corio and Dawson to Labor in by-elections. Alan Reid says that, within the party, the reversal was blamed on Holt's mishandling of the VIP planes scandal. Disquiet was growing about his leadership style and possible health problems.\n\nDisappearance\n\nHolt loved the ocean, particularly spearfishing, and had holiday homes at Portsea, Victoria, and Bingil Bay, Queensland.Frame (2005), p. 272. On 17 December 1967, while Holt was spending the weekend at Portsea, he and four companions decided to drive to Point Nepean to watch sailor Alec Rose pass through The Rip on his solo circumnavigation attempt. On their way back to Portsea, Holt convinced the group to stop at remote Cheviot Beach for a swim before lunch – he had spearfished there on many previous occasions, and claimed to \"know this beach like the back of my hand\". Because of the rough conditions, only one other person, Alan Stewart, joined Holt in the water. Stewart kept close to shore, but Holt swam out into deeper water and was seemingly caught up in a rip current, eventually disappearing from view. One of the witnesses, Marjorie Gillespie, described it as \"like a leaf being taken out [...] so quick and final\".Frame (2005), pp. 248–250.\n\nHolt's disappearance sparked \"one of the largest search operations in Australian history\", but no trace of his body was ever found.Frame (2005), p. 250. A police report released in early 1968 made no definitive findings about Holt's death, while a coronial inquest in 2005 returned a verdict of accidental drowning. It is generally accepted that Holt overestimated his swimming ability.Frame (2005), p. 275. Some have alleged that Holt committed suicide, but those close to him rejected this as uncharacteristic of his personality.Frame (2005), p. 277. Conspiracy theories have included suggestions that Holt faked his own death, was assassinated by the CIA, or was collected by a submarine so that he could defect to China.Frame (2005), pp. 278–293.\n\nA memorial service for Holt was held at St Paul's Cathedral, Melbourne, on 22 December, and attended by numerous world leaders.Frame (2005), p. 267. Aged 59 at the time of his death, Holt became the third Australian prime minister to die in office, after Joseph Lyons (1939) and John Curtin (1945). John McEwen, the leader of the Country Party, was sworn in as caretaker prime minister on 19 December.Frame (2005), p. 254. The Liberal Party held a leadership election on 9 January 1968, in which John Gorton defeated Paul Hasluck, Billy Snedden, and Les Bury. Gorton was a member of the Senate, and in line with constitutional convention transferred to the House of Representatives at the by-election caused by Holt's death.Frame (2005), p. 269.\n\nPersonal life\n\nRelationships\n\nWhile at university, Holt met Zara Dickins, the daughter of a Melbourne businessman; there was an \"instant mutual attraction\". They made plans to marry once Holt had graduated, but after a financial dispute chose to separate. Zara went on a trip to Britain, where she was introduced to James Fell, a British Indian Army officer. She accompanied Fell to India, and then in early 1935 returned to Australia where Holt again proposed marriage. She declined his offer, and married Fell a short time later, going to live with him in Jabalpur. Holt had entered parliament by that time, and was soon being profiled as \"the most eligible bachelor in parliament\". He briefly dated Lola Thring, the daughter of his father’s business partner, F. W. Thring, but his widowed father was also interested in her (to his son's \"disgust\"). Tom Holt married Lola in 1936, and their daughter Frances (Harold's half-sister) was born in 1940; Tom Holt died in 1945.Frame (2005), p. 7.\n\nIn 1937, Zara returned to Australia to give birth to her first child, Nicholas. She had two more children, twins Sam and Andrew, in 1939. Her marriage with Fell broke down a short time later, and in late 1940 she returned to Australia permanently and resumed a relationship with Holt. Their relationship did not become public for some time, in order to avoid Holt being implicated in Zara's divorce proceedings.Frame (2005), p. 8. They eventually married on 8 October 1946, at Zara's parents' home on St Georges Road, Toorak.Frame (2005), p. 33. They initially lived on nearby Washington Street, but in 1954 bought the St Georges Road house.Frame (2005), p. 34. Holt legally adopted Zara's three children, and as young men they changed their surname to his.Frame (2005), p. 55. According to biographer Tom Frame, it was an \"open secret\" that Holt was the biological father of the twins, as they shared his physical appearance and had been conceived at a time when Zara was known to have been in Melbourne.\n\nZara Holt was a successful businesswoman, owning a chain of dress shops, and out-earned her husband even as prime minister. It was her success that allowed the couple to purchase two holiday homes, one at Portsea, Victoria, and the other at Bingil Bay, Queensland.Frame (2005), pp. 114–115 She nonetheless made sacrifices for her husband's political career, accompanying him on all but one of his overseas trips, which could last for weeks. After her husband's death, Zara remarried in 1969 to one of his Liberal Party colleagues, Jeff Bate.Frame (2005), p. 304. She was widowed a second time in 1984, and died in 1989. In a 1988 interview with The Sydney Morning Herald, Zara stated that her husband had carried on \"dozens\" of extramarital affairs.Frame (2005), p. 305. In his biography of Holt, Tom Frame wrote: \"I have not included the names of women with whom Holt allegedly had a sexual relationship because I was unable to confirm or deny that most of these relationships took place […] by their very nature they were always illicit and Holt was very discreet.\"Frame (2005), p. xvii.\n\nReligious beliefs\n\nHolt has been described as an \"apathetic agnostic\". He was baptised Anglican, attended Methodist schools, and married with Presbyterian forms, but neither he nor his wife had any interest in religion. His lack of religiosity apparently had little impact on his political prospects, and was not generally remarked upon.Williams (2013), p. 141. Alick Downer believed that Holt's thoughts \"lay in this world not the next\".Williams (2013), p. 144. According to his friend Simon Warrender, he \"was an agnostic whose raison d'être was dedication to his career\".Frame (2005), p. 266. Holt had a reputation as something of a fatalist, and frequently quoted from Andrew Marvell's carpe diem poem \"To His Coy Mistress\".Williams (2013), p. 143. He was also fond of Rudyard Kipling's poem \"If—\", which Warrender said he used as a \"guiding light in his political and private life\".\n\nMemorials and other legacies\n\nHarold Holt is most famously commemorated by the Harold Holt Memorial Swimming Centre in the Melbourne suburb of Glen Iris. The complex was under construction at the time of Holt's disappearance, and since he was the local member, it was named in his memory. The irony of commemorating a man who is presumed to have drowned with a swimming pool has been a wry source of amusement to many Australians.Bryson, Bill. In a Sunburned Country (Broadway Books, New York, 2000) \n\nIn 1968, the newly commissioned United States Navy Knox class destroyer escort USS Harold E. Holt (FF-1074) was named in his honour. She was launched by Holt's widow Dame Zara at the Todd Shipyards in Los Angeles on 3 May 1969, and was the first American warship to bear the name of a foreign leader.\n\nIn 1969, a plaque commemorating Holt was bolted to the seafloor off Cheviot Beach after a memorial ceremony. It bears the inscription:\n\nOther memorials include:\n\n* the suburb of Holt, Australian Capital Territory;\n* the Naval Communication Station Harold E. Holt;\n* the Division of Holt, an electoral district in the Australian House of Representatives in Victoria;\n* a sundial and garden in the Fitzroy Gardens, Melbourne;\n* a wing for boarders at Wesley College, Melbourne;\n* the Harold Holt Fisheries Reserves – five protected areas in southern Port Phillip, located at Swan Bay, Point Lonsdale, Mud Islands, Point Nepean and Pope's Eye (The Annulus). \n* a memorial stone within the 'Prime Ministers Garden' of Melbourne General Cemetery\n\nBy way of a folk memorial, he is recalled in the Australian vernacular expression \"do a Harold Holt\" (or \"do the Harry\"), rhyming slang for \"do a bolt\" meaning \"to disappear suddenly and without explanation\", although this is usually employed in the context of disappearance from a social gathering rather than a case of presumed death.Lambert, James (2004) The Macquarie Australian Slang Dictionary, p. 69 (Macquarie Library: Sydney) \n\nIn the Queen's Birthday Honours of June 1968, Holt's widow Zara Holt was made a Dame Commander of the Order of the British Empire, becoming Dame Zara Holt DBE. She later married for a third time, to a Liberal party colleague of Holt's, Jeff Bate, and was then known as Dame Zara Bate. Harold Holt. http://en.wikipedia.org/?curid=13867."
  }
}
