{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5781",
  "eid" : "d7ce9850-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778441813,
  "textBody" : "Chinese numerals are words and characters used to denote numbers in Chinese.\n\nToday, speakers of Chinese use three written numeral systems: the system of Arabic numerals used worldwide, and two indigenous systems. The more familiar indigenous system is based on Chinese characters that correspond to numerals in the spoken language. These are shared with other languages of the Chinese cultural sphere such as Japanese, Korean and Vietnamese. Most people and institutions in China and Taiwan primarily use the Arabic or mixed Arabic-Chinese systems for convenience, with traditional Chinese numerals used in finance, mainly for writing amounts on checks, banknotes, some ceremonial occasions, some boxes, and on commercials.\n\nThe other indigenous system is the Suzhou numerals, or huama, a positional system, the only surviving form of the rod numerals. These were once used by Chinese mathematicians, and later in Chinese markets, such as those in Hong Kong before the 1990s, but have been gradually supplanted by Arabic (and also Roman) numerals.\n\nCharacters used to represent numbers\n\nThe Chinese character numeral system consists of the Chinese characters used by the Chinese written language to write spoken numerals. Similar to spelling-out numbers in English (e.g., \"one thousand nine hundred forty-five\"), it is not an independent system per se. Since it reflects spoken language, it does not use the positional system as in Arabic numerals, in the same way that spelling out numbers in English does not.\n\nStandard numbers \n\nThere are characters representing the numbers zero through nine, and other characters representing larger numbers such as tens, hundreds, thousands and so on. There are two sets of characters for Chinese numerals: one for everyday writing, known as xiǎoxiě (), and one for use in commercial or financial contexts, known as dàxiě (). The latter arose because the characters used for writing numerals are geometrically simple, so simply using those numerals cannot prevent forgeries in the same way spelling numbers out in English would.[http://big5.hwjyw.com/zyzx/jxsc/hy/200912/t20091215_34515.shtml 大寫數字『]  A forger could easily change the everyday characters 三十 (30) to 五千 (5000) just by adding a few strokes. That would not be possible when writing using the financial characters 叁拾 (30) and 伍仟 (5000). They are also referred to as \"banker's numerals\", \"anti-fraud numerals\", or \"banker's anti-fraud numerals\". For the same reason, rod numerals were never used in commercial records.\n\nT denotes Traditional Chinese characters, while S denotes Simplified Chinese characters.\n\nCharacters with regional usage \n\nCharacters with military usage \n\nIn the PLA, some numbers will have altered names when used for clearer radio communications. They are: “军语”里的那些秘密 http://news.xinhuanet.com/mil/2016-03/21/c_128818839.htm\n*0: renamed 洞 (dòng) lit. hole\n*1: renamed 幺 (yāo) lit. small\n*2: renamed 两 (liǎng) lit. double\n*7: renamed 拐 (guǎi) lit. cane, turn\n*9: renamed 勾 (gōu) lit. hook\n\nLarge numbers\n\nFor numbers larger than 10,000, similarly to the long and short scales in the West, there have been four systems in ancient and modern usage. The original one, with unique names for all powers of ten up to the 14th, is ascribed to the Yellow Emperor in the 6th century book by Zhen Luan,  Wujing suanshu (Arithmetic in Five Classics). In modern Chinese only the second system is used, in which the same ancient names are used, but each represents a number 10,000 (myriad, 萬 wàn) times the previous:\n\nIn practice, this situation does not lead to ambiguity, with the exception of 兆 (zhào), which means 1012 according to the system in common usage throughout the Chinese communities as well as in Japan and Korea, but has also been used for 106 in recent years (especially in mainland China for megabyte). To avoid problems arising from the ambiguity, the PRC government never uses this character in official documents, but uses 万亿 (wànyì) instead. Partly due to this, combinations of 万 and 亿 are often used instead of the larger units of the traditional system as well, for example 亿亿 (yìyì) instead of 京. The ROC government in Taiwan uses 兆 (zhào) to mean 1012 in official documents.\n\nNumbers from Buddhism \n\nNumerals beyond 載 zǎi come from Buddhist texts in Sanskrit, but are mostly found in ancient texts. Some of the following words are still being used today, but may have transferred meanings.\n\nSmall numbers \n\nThe following are characters used to denote small order of magnitude in Chinese historically. With the introduction of SI units, some of them have been incorporated as SI prefixes, while the rest have fallen into disuse.\n\nSI prefixes\n\nIn the People's Republic of China, the translations for the SI prefixes in 1981 were different from those used today. The larger (兆, 京, 垓, 秭, 穰) and smaller Chinese numerals (微, 纖, 沙, 塵, 渺) were defined as translations for the SI prefixes as mega, giga, tera, peta, exa, micro, nano,  pico,  femto,  atto, resulting in the creation of yet more values for each numeral. [http://www.gov.cn/zwgk/2011-11/09/content_1989016.htm 1981 Gazette of the State Council of the People's Republic of China], [http://www.gov.cn/gongbao/shuju/1981/gwyb198118.pdf No. 365], page 575, Table 7: SI prefixes\n\nThe Republic of China (Taiwan) defined 百萬 as the translation for mega. This translation is widely used in official documents, academic communities, informational industries, etc. However, the civil broadcasting industries sometimes use 兆赫 to represent \"megahertz\".\n\nToday, the governments of both China and Taiwan use phonetic transliterations for the SI prefixes. However, the governments have each chosen different Chinese characters for certain prefixes. The following table lists the two different standards together with the early translation.\n\nReading and transcribing numbers \n\nWhole numbers \n\nMultiple-digit numbers are constructed using a multiplicative principle; first the digit itself (from 1 to 9), then the place (such as 10 or 100); then the next digit.\n\nIn Mandarin, the multiplier 兩 (liǎng) is often used rather than 二 (èr) for all numbers 200 and greater with the \"2\" numeral (although as noted earlier this varies from dialect to dialect and person to person). Use of both 兩 (liǎng) or 二 (èr) are acceptable for the number 200. When writing in the Cantonese dialect, 二 (yi6) is used to represent the \"2\" numeral for all numbers.  In the southern Min dialect of Chaozhou (Teochew), 兩 (no6) is used to represent the \"2\" numeral in all numbers from 200 onwards.  Thus:\n\nFor the numbers 11 through 19, the leading \"one\" (一) is usually omitted.  In some dialects, like Shanghainese, when there are only two significant digits in the number, the leading \"one\" and the trailing zeroes are omitted.  Sometimes, the one before \"ten\" in the middle of a number, such as 213, is omitted.  Thus:\n\nNotes:\n# Nothing is ever omitted in large and more complicated numbers such as this.\n\nIn certain older texts like the Protestant Bible or in poetic usage, numbers such as 114 may be written as [100] [10] [4] (百十四).\n\nOutside of Taiwan, digits are sometimes grouped by myriads instead of thousands. Hence it is more convenient to think of numbers here as in groups of four, thus 1,234,567,890 is regrouped here as 12,3456,7890. Larger than a myriad, each number is therefore four zeroes longer than the one before it, thus 10000 × wàn (萬) = yì (億). If one of the numbers is between 10 and 19, the leading \"one\" is omitted as per the above point.  Hence (numbers in parentheses indicate that the number has been written as one number rather than expanded):\n\nIn Taiwan, pure Arabic numerals are officially always and only grouped by thousands. Unofficially, they are often not grouped, particularly for numbers below 100,000. Mixed Arabic-Chinese numerals are often used in order to denote myriads. This is used both officially and unofficially, and come in a variety of styles:\n\nInterior zeroes before the unit position (as in 1002) must be spelt explicitly.  The reason for this is that trailing zeroes (as in 1200) are often omitted as shorthand, so ambiguity occurs.  One zero is sufficient to resolve the ambiguity.  Where the zero is before a digit other than the units digit, the explicit zero is not ambiguous and is therefore optional, but preferred.  Thus:\n\nFractional values\n\nTo construct a fraction, the denominator is written first, followed by 分之 (\"parts of\") and then the numerator. This is the opposite of how fractions are read in English, which is numerator first. Each half of the fraction is written the same as a whole number. Mixed numbers are written with the whole-number part first, followed by 又 (\"and\"), then the fractional part.\n\nPercentages are constructed similarly, using 百 (100) as the denominator. The 一 (one) before 百 is omitted.\n\nDecimal numbers are constructed by first writing the whole number part, then inserting a point (), and finally the decimal expression. The decimal expression is written using only the digits for 0 to 9, without multiplicative words.\n\n半 bàn [half] functions as a number and therefore requires a measure word. Example: 半杯水 half a glass of water.\n\nOrdinal numbers\n\nOrdinal numbers are formed by adding 第 dì (\"sequence\") before the number.\n\nNegative numbers\n\nNegative numbers are formed by adding (, Pinyin: fù, Jyuping: fu6) before the number.\n\nUsage\n\nChinese grammar requires the use of classifiers (measure words) when a numeral is used together with a noun to express a quantity. For example, \"three people\" is expressed as 三个人 sān ge rén, \"three GE person\", where 个 ge is a classifier. There exist many different classifiers, for use with different sets of nouns, although 个 is the most common, and may be used informally in place of other classifiers.\n\nChinese uses cardinal numbers in certain situations in which English would use ordinals. For example, 三楼 sān lóu (literally \"three story\") means \"third floor\" (\"second floor\" in British numbering). Likewise, 二十一世纪 èrshí yī shìjì (literally \"twenty-one century\") is used for \"21st century\".Yip, Po-Ching; Rimmington, Don, Chinese: A Comprehensive Grammar, Routledge, 2004, p. 12.\n\nNumbers of years are commonly spoken as a sequence of digits, as in 二零零一 èr líng líng yī (\"two zero zero one\") for the year 2001.Yip, Po-Ching; Rimmington, Don, Chinese: A Comprehensive Grammar, Routledge, 2004, p. 13. Names of months and days (in the Western system) are also expressed using numbers: 一月 yīyuè (\"one month\") for January, etc.; and 星期一 xīngqīyī (\"week one\") for Monday, etc. Only one exception, Sunday is 星期日 xīngqīrì, or informally 星期天 xīngqītiān, literally \"week day\". When meaning \"week\", \"星期\" xīngqī and \"禮拜\" lǐbài are interchangeable. And 禮拜天 lǐbàitiān or 禮拜日 lǐbàirì, means \"day of worship\". Because Chinese Catholics call the Sunday \"主日\" zhǔrì, \"Lord's day\".Days of the Week in Chinese: Three Different Words for 'Week' http://www.cjvlang.com/Dow/dowchin.html\n\nFull dates are usually written in the format 2001年1月20日 for January 20, 2001 (using 年 nián \"year\", 月 yuè \"month\", and 日 rì \"day\") – all the numbers are read as cardinals, not ordinals, with no leading zeroes, and the year is read as a sequence of digits. For brevity the year yuè and rì may be dropped to give a date composed of just numbers, so for example 64, in Chinese is six-four, short for month six-day four i.e. June Fourth, a common Chinese shorthand for the Tiananmen Square protests of 1989.\n\nCounting rod and Suzhou numerals \n\nIn the same way that Roman numerals were standard in ancient and medieval Europe for mathematics and commerce, the Chinese formerly used the rod numerals, which is a positional system. The Suzhou numerals () system is a variation of the Southern Song rod numerals. Nowadays, the huāmǎ system is only used for displaying prices in Chinese markets or on traditional handwritten invoices.\n\nHand gestures\n\nThere is a common method of using of one hand to signify the numbers one to ten. While the five digits on one hand can express the numbers one to five, six to ten have special signs that can be used in commerce or day-to-day communication.\n\nHistorical use of numerals in China\n\n \n\nMost Chinese numerals of later periods were descendants of the Shang dynasty oracle numerals of the 14th century BC. The oracle bone script numerals were found on tortoise shell and animal bones. In early civilizations, the Shang were able to express any numbers, however large, with only nine symbols and a counting board.The Shorter Science & Civilisation in China Vol 2, An abridgement by Colin Ronan of Joseph Needham's original text, p5,Cambridge University Press  \n\nSome of the bronze script numerals such as 1, 2, 3, 4, 10, 11, 12, and 13 became part of the system of rod numerals.\n\nIn this system, horizontal rod numbers are used for the tens, thousands, hundred thousands etc.  It's written in Sunzi Suanjing that \"one is vertical, ten is horizontal\".[http://zh.wikisource.org/wiki/%E5%AD%AB%E5%AD%90%E7%AE%97%E7%B6%93 Chinese Wikisource] 孫子算經: 先識其位，一從十橫，百立千僵，千十相望，萬百相當。\n\nThe counting rod numerals system has place value and decimal numerals for computation, and was used widely by Chinese merchants, mathematicians and astronomers from the Han dynasty to the 16th century.\n\nAlexander Wylie, Christian missionary to China, in 1853 already refuted the notion that \"the Chinese numbers were written in words at length\", and stated that in ancient China, calculation was carried out by means of counting rods, and \"the written character is evidently a rude presentation of these\". After being introduced to the rod numerals, he said \"Having thus obtained a simple but effective system of figures, we find the Chinese in actual use of a method of notation depending on the theory of local value [i.e. place-value], several centuries before such theory was understood in Europe, and while yet the science of numbers had scarcely dawned among the Arabs.\"Alexander Wylie, Jottings on the Sciences of the Chinese, North Chinese Herald, 1853, Shanghai\n\nDuring the Ming and Qing dynasties (after Arabic numerals were introduced into China), some Chinese mathematicians used Chinese numeral characters as positional system digits. After the Qing period, both the Chinese numeral characters and the Suzhou numerals were replaced by Arabic numerals in mathematical writings.\n\nCultural influences \n\nTraditional Chinese numeric characters are also used in Japan and Korea and were used in Vietnam before the 20th century. In vertical text (that is, read top to bottom), using characters for numbers is the norm, while in horizontal text, Arabic numerals are most common. Chinese numeric characters are also used in much the same formal or decorative fashion that Roman numerals are in Western cultures. Chinese numerals may appear together with Arabic numbers on the same sign or document.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Chinese numerals" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5781" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Chinese numerals are words and characters used to denote numbers in Chinese.\n\nToday, speakers of Chinese use three written numeral systems: the system of Arabic numerals used worldwide, and two indigenous systems. The more familiar indigenous system is based on Chinese characters that correspond to numerals in the spoken language. These are shared with other languages of the Chinese cultural sphere such as Japanese, Korean and Vietnamese. Most people and institutions in China and Taiwan primarily use the Arabic or mixed Arabic-Chinese systems for convenience, with traditional Chinese numerals used in finance, mainly for writing amounts on checks, banknotes, some ceremonial occasions, some boxes, and on commercials.\n\nThe other indigenous system is the Suzhou numerals, or huama, a positional system, the only surviving form of the rod numerals. These were once used by Chinese mathematicians, and later in Chinese markets, such as those in Hong Kong before the 1990s, but have been gradually supplanted by Arabic (and also Roman) numerals.\n\nCharacters used to represent numbers\n\nThe Chinese character numeral system consists of the Chinese characters used by the Chinese written language to write spoken numerals. Similar to spelling-out numbers in English (e.g., \"one thousand nine hundred forty-five\"), it is not an independent system per se. Since it reflects spoken language, it does not use the positional system as in Arabic numerals, in the same way that spelling out numbers in English does not.\n\nStandard numbers \n\nThere are characters representing the numbers zero through nine, and other characters representing larger numbers such as tens, hundreds, thousands and so on. There are two sets of characters for Chinese numerals: one for everyday writing, known as xiǎoxiě (), and one for use in commercial or financial contexts, known as dàxiě (). The latter arose because the characters used for writing numerals are geometrically simple, so simply using those numerals cannot prevent forgeries in the same way spelling numbers out in English would.[http://big5.hwjyw.com/zyzx/jxsc/hy/200912/t20091215_34515.shtml 大寫數字『]  A forger could easily change the everyday characters 三十 (30) to 五千 (5000) just by adding a few strokes. That would not be possible when writing using the financial characters 叁拾 (30) and 伍仟 (5000). They are also referred to as \"banker's numerals\", \"anti-fraud numerals\", or \"banker's anti-fraud numerals\". For the same reason, rod numerals were never used in commercial records.\n\nT denotes Traditional Chinese characters, while S denotes Simplified Chinese characters.\n\nCharacters with regional usage \n\nCharacters with military usage \n\nIn the PLA, some numbers will have altered names when used for clearer radio communications. They are: “军语”里的那些秘密 http://news.xinhuanet.com/mil/2016-03/21/c_128818839.htm\n*0: renamed 洞 (dòng) lit. hole\n*1: renamed 幺 (yāo) lit. small\n*2: renamed 两 (liǎng) lit. double\n*7: renamed 拐 (guǎi) lit. cane, turn\n*9: renamed 勾 (gōu) lit. hook\n\nLarge numbers\n\nFor numbers larger than 10,000, similarly to the long and short scales in the West, there have been four systems in ancient and modern usage. The original one, with unique names for all powers of ten up to the 14th, is ascribed to the Yellow Emperor in the 6th century book by Zhen Luan,  Wujing suanshu (Arithmetic in Five Classics). In modern Chinese only the second system is used, in which the same ancient names are used, but each represents a number 10,000 (myriad, 萬 wàn) times the previous:\n\nIn practice, this situation does not lead to ambiguity, with the exception of 兆 (zhào), which means 1012 according to the system in common usage throughout the Chinese communities as well as in Japan and Korea, but has also been used for 106 in recent years (especially in mainland China for megabyte). To avoid problems arising from the ambiguity, the PRC government never uses this character in official documents, but uses 万亿 (wànyì) instead. Partly due to this, combinations of 万 and 亿 are often used instead of the larger units of the traditional system as well, for example 亿亿 (yìyì) instead of 京. The ROC government in Taiwan uses 兆 (zhào) to mean 1012 in official documents.\n\nNumbers from Buddhism \n\nNumerals beyond 載 zǎi come from Buddhist texts in Sanskrit, but are mostly found in ancient texts. Some of the following words are still being used today, but may have transferred meanings.\n\nSmall numbers \n\nThe following are characters used to denote small order of magnitude in Chinese historically. With the introduction of SI units, some of them have been incorporated as SI prefixes, while the rest have fallen into disuse.\n\nSI prefixes\n\nIn the People's Republic of China, the translations for the SI prefixes in 1981 were different from those used today. The larger (兆, 京, 垓, 秭, 穰) and smaller Chinese numerals (微, 纖, 沙, 塵, 渺) were defined as translations for the SI prefixes as mega, giga, tera, peta, exa, micro, nano,  pico,  femto,  atto, resulting in the creation of yet more values for each numeral. [http://www.gov.cn/zwgk/2011-11/09/content_1989016.htm 1981 Gazette of the State Council of the People's Republic of China], [http://www.gov.cn/gongbao/shuju/1981/gwyb198118.pdf No. 365], page 575, Table 7: SI prefixes\n\nThe Republic of China (Taiwan) defined 百萬 as the translation for mega. This translation is widely used in official documents, academic communities, informational industries, etc. However, the civil broadcasting industries sometimes use 兆赫 to represent \"megahertz\".\n\nToday, the governments of both China and Taiwan use phonetic transliterations for the SI prefixes. However, the governments have each chosen different Chinese characters for certain prefixes. The following table lists the two different standards together with the early translation.\n\nReading and transcribing numbers \n\nWhole numbers \n\nMultiple-digit numbers are constructed using a multiplicative principle; first the digit itself (from 1 to 9), then the place (such as 10 or 100); then the next digit.\n\nIn Mandarin, the multiplier 兩 (liǎng) is often used rather than 二 (èr) for all numbers 200 and greater with the \"2\" numeral (although as noted earlier this varies from dialect to dialect and person to person). Use of both 兩 (liǎng) or 二 (èr) are acceptable for the number 200. When writing in the Cantonese dialect, 二 (yi6) is used to represent the \"2\" numeral for all numbers.  In the southern Min dialect of Chaozhou (Teochew), 兩 (no6) is used to represent the \"2\" numeral in all numbers from 200 onwards.  Thus:\n\nFor the numbers 11 through 19, the leading \"one\" (一) is usually omitted.  In some dialects, like Shanghainese, when there are only two significant digits in the number, the leading \"one\" and the trailing zeroes are omitted.  Sometimes, the one before \"ten\" in the middle of a number, such as 213, is omitted.  Thus:\n\nNotes:\n# Nothing is ever omitted in large and more complicated numbers such as this.\n\nIn certain older texts like the Protestant Bible or in poetic usage, numbers such as 114 may be written as [100] [10] [4] (百十四).\n\nOutside of Taiwan, digits are sometimes grouped by myriads instead of thousands. Hence it is more convenient to think of numbers here as in groups of four, thus 1,234,567,890 is regrouped here as 12,3456,7890. Larger than a myriad, each number is therefore four zeroes longer than the one before it, thus 10000 × wàn (萬) = yì (億). If one of the numbers is between 10 and 19, the leading \"one\" is omitted as per the above point.  Hence (numbers in parentheses indicate that the number has been written as one number rather than expanded):\n\nIn Taiwan, pure Arabic numerals are officially always and only grouped by thousands. Unofficially, they are often not grouped, particularly for numbers below 100,000. Mixed Arabic-Chinese numerals are often used in order to denote myriads. This is used both officially and unofficially, and come in a variety of styles:\n\nInterior zeroes before the unit position (as in 1002) must be spelt explicitly.  The reason for this is that trailing zeroes (as in 1200) are often omitted as shorthand, so ambiguity occurs.  One zero is sufficient to resolve the ambiguity.  Where the zero is before a digit other than the units digit, the explicit zero is not ambiguous and is therefore optional, but preferred.  Thus:\n\nFractional values\n\nTo construct a fraction, the denominator is written first, followed by 分之 (\"parts of\") and then the numerator. This is the opposite of how fractions are read in English, which is numerator first. Each half of the fraction is written the same as a whole number. Mixed numbers are written with the whole-number part first, followed by 又 (\"and\"), then the fractional part.\n\nPercentages are constructed similarly, using 百 (100) as the denominator. The 一 (one) before 百 is omitted.\n\nDecimal numbers are constructed by first writing the whole number part, then inserting a point (), and finally the decimal expression. The decimal expression is written using only the digits for 0 to 9, without multiplicative words.\n\n半 bàn [half] functions as a number and therefore requires a measure word. Example: 半杯水 half a glass of water.\n\nOrdinal numbers\n\nOrdinal numbers are formed by adding 第 dì (\"sequence\") before the number.\n\nNegative numbers\n\nNegative numbers are formed by adding (, Pinyin: fù, Jyuping: fu6) before the number.\n\nUsage\n\nChinese grammar requires the use of classifiers (measure words) when a numeral is used together with a noun to express a quantity. For example, \"three people\" is expressed as 三个人 sān ge rén, \"three GE person\", where 个 ge is a classifier. There exist many different classifiers, for use with different sets of nouns, although 个 is the most common, and may be used informally in place of other classifiers.\n\nChinese uses cardinal numbers in certain situations in which English would use ordinals. For example, 三楼 sān lóu (literally \"three story\") means \"third floor\" (\"second floor\" in British numbering). Likewise, 二十一世纪 èrshí yī shìjì (literally \"twenty-one century\") is used for \"21st century\".Yip, Po-Ching; Rimmington, Don, Chinese: A Comprehensive Grammar, Routledge, 2004, p. 12.\n\nNumbers of years are commonly spoken as a sequence of digits, as in 二零零一 èr líng líng yī (\"two zero zero one\") for the year 2001.Yip, Po-Ching; Rimmington, Don, Chinese: A Comprehensive Grammar, Routledge, 2004, p. 13. Names of months and days (in the Western system) are also expressed using numbers: 一月 yīyuè (\"one month\") for January, etc.; and 星期一 xīngqīyī (\"week one\") for Monday, etc. Only one exception, Sunday is 星期日 xīngqīrì, or informally 星期天 xīngqītiān, literally \"week day\". When meaning \"week\", \"星期\" xīngqī and \"禮拜\" lǐbài are interchangeable. And 禮拜天 lǐbàitiān or 禮拜日 lǐbàirì, means \"day of worship\". Because Chinese Catholics call the Sunday \"主日\" zhǔrì, \"Lord's day\".Days of the Week in Chinese: Three Different Words for 'Week' http://www.cjvlang.com/Dow/dowchin.html\n\nFull dates are usually written in the format 2001年1月20日 for January 20, 2001 (using 年 nián \"year\", 月 yuè \"month\", and 日 rì \"day\") – all the numbers are read as cardinals, not ordinals, with no leading zeroes, and the year is read as a sequence of digits. For brevity the year yuè and rì may be dropped to give a date composed of just numbers, so for example 64, in Chinese is six-four, short for month six-day four i.e. June Fourth, a common Chinese shorthand for the Tiananmen Square protests of 1989.\n\nCounting rod and Suzhou numerals \n\nIn the same way that Roman numerals were standard in ancient and medieval Europe for mathematics and commerce, the Chinese formerly used the rod numerals, which is a positional system. The Suzhou numerals () system is a variation of the Southern Song rod numerals. Nowadays, the huāmǎ system is only used for displaying prices in Chinese markets or on traditional handwritten invoices.\n\nHand gestures\n\nThere is a common method of using of one hand to signify the numbers one to ten. While the five digits on one hand can express the numbers one to five, six to ten have special signs that can be used in commerce or day-to-day communication.\n\nHistorical use of numerals in China\n\n \n\nMost Chinese numerals of later periods were descendants of the Shang dynasty oracle numerals of the 14th century BC. The oracle bone script numerals were found on tortoise shell and animal bones. In early civilizations, the Shang were able to express any numbers, however large, with only nine symbols and a counting board.The Shorter Science & Civilisation in China Vol 2, An abridgement by Colin Ronan of Joseph Needham's original text, p5,Cambridge University Press  \n\nSome of the bronze script numerals such as 1, 2, 3, 4, 10, 11, 12, and 13 became part of the system of rod numerals.\n\nIn this system, horizontal rod numbers are used for the tens, thousands, hundred thousands etc.  It's written in Sunzi Suanjing that \"one is vertical, ten is horizontal\".[http://zh.wikisource.org/wiki/%E5%AD%AB%E5%AD%90%E7%AE%97%E7%B6%93 Chinese Wikisource] 孫子算經: 先識其位，一從十橫，百立千僵，千十相望，萬百相當。\n\nThe counting rod numerals system has place value and decimal numerals for computation, and was used widely by Chinese merchants, mathematicians and astronomers from the Han dynasty to the 16th century.\n\nAlexander Wylie, Christian missionary to China, in 1853 already refuted the notion that \"the Chinese numbers were written in words at length\", and stated that in ancient China, calculation was carried out by means of counting rods, and \"the written character is evidently a rude presentation of these\". After being introduced to the rod numerals, he said \"Having thus obtained a simple but effective system of figures, we find the Chinese in actual use of a method of notation depending on the theory of local value [i.e. place-value], several centuries before such theory was understood in Europe, and while yet the science of numbers had scarcely dawned among the Arabs.\"Alexander Wylie, Jottings on the Sciences of the Chinese, North Chinese Herald, 1853, Shanghai\n\nDuring the Ming and Qing dynasties (after Arabic numerals were introduced into China), some Chinese mathematicians used Chinese numeral characters as positional system digits. After the Qing period, both the Chinese numeral characters and the Suzhou numerals were replaced by Arabic numerals in mathematical writings.\n\nCultural influences \n\nTraditional Chinese numeric characters are also used in Japan and Korea and were used in Vietnam before the 20th century. In vertical text (that is, read top to bottom), using characters for numbers is the norm, while in horizontal text, Arabic numerals are most common. Chinese numeric characters are also used in much the same formal or decorative fashion that Roman numerals are in Western cultures. Chinese numerals may appear together with Arabic numbers on the same sign or document. Chinese numerals. http://en.wikipedia.org/?curid=5781."
  }
}
