{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9633",
  "eid" : "f0b9d640-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778483620,
  "textBody" : "The number  is a mathematical constant, approximately equal to 2.71828, which appears in many different settings throughout mathematics. It was discovered by the Swiss mathematician Jacob Bernoulli while studying compound interest, where  arises as the limit of  as  approaches infinity. The number  can also be calculated as the sum of the infinite seriesEncyclopedic Dictionary of Mathematics 142.D\ne  \\displaystyle\\sum\\limits_{n \n 0}^{ \\infty} \\dfrac{1}{n!} = \\frac{1}{1} + \\frac{1}{1} + \\frac{1}{1\\cdot 2} + \\frac{1}{1\\cdot 2\\cdot 3} + \\cdots\n\nAlso called Euler's number after the Swiss mathematician Leonhard Euler,  is different from , the Euler–Mascheroni constant, which is sometimes called simply Euler's constant. Occasionally, the number  is termed Napier's constant, but Euler's choice of the symbol  is said to have been retained in his honor.\n\nThe number  is of eminent importance in mathematics, alongside 0, 1, Pi| and Imaginary unit|. All five of these numbers play important and recurring roles across mathematics, and are the five constants appearing in one formulation of Euler's identity. Like the constant ,  is irrational: it is not a ratio of integers. Also like ,  is transcendental: it is not a root of any non-zero polynomial with rational coefficients. The numerical value of  truncated to 50 decimal places is\n\nThe function  is called the (natural) exponential function, and is the unique exponential function of type  equal to its own derivative (), so  can be spotted as the unique positive number  such that the graph of the function  has unit slope at . The natural logarithm, or logarithm to base , is the inverse function to the natural exponential function. The natural logarithm of a number  can also be defined directly as the area under the curve  between  and , in which case  is the value of  for which this area equals one (see image). In this view  is the unique number whose natural logarithm is equal to one.Oxford English Dictionary, 2nd ed.: [http://oxforddictionaries.com/definition/english/natural-logarithm natural logarithm]\n\nHistory\n\nThe first references to the constant were published in 1618 in the table of an appendix of a work on logarithms by John Napier. However, this did not contain the constant itself, but simply a list of logarithms calculated from the constant. It is assumed that the table was written by William Oughtred. The discovery of the constant itself is credited to Jacob Bernoulli in 1683,Jacob Bernoulli considered the problem of continuous compounding of interest, which led to a series expression for e.  See:  Jacob Bernoulli (1690) \"Quæstiones nonnullæ de usuris, cum solutione problematis de sorte alearum, propositi in Ephem. Gall. A. 1685\" (Some questions about interest, with a solution of a problem about games of chance, proposed in the Journal des Savants (Ephemerides Eruditorum Gallicanæ), in the year (anno) 1685.**), Acta eruditorum, pp. 219–223.  [https://books.google.com/books?ids4pw4GyHTRcC&pg\nPA222#vonepage&q&f\nfalse On page 222], Bernoulli poses the question:  \"Alterius naturæ hoc Problema est:  Quæritur, si creditor aliquis pecuniæ summam fænori exponat, ea lege, ut singulis momentis pars proportionalis usuræ annuæ sorti annumeretur; quantum ipsi finito anno debeatur?\"  (This is a problem of another kind:  The question is, if some lender were to invest [a] sum of money [at] interest, let it accumulate, so that [at] every moment [it] were to receive [a] proportional part of [its] annual interest; how much would he be owed [at the] end of [the] year?)  Bernoulli constructs a power series to calculate the answer, and then writes: \" … quæ nostra serie [mathematical expression for a geometric series] &c. major est.  … si ab, debebitur plu quam 2½a  & minus quam 3a.\" ( … which our series [a geometric series] is larger [than]. … if a\nb, [the lender] will be owed more than 2½a and less than 3a.)  If a=b, the geometric series reduces to the series for a × e, so 2.5  who attempted to find the value of the following expression (which is in fact ):\n\n\\lim_{n\\to\\infty} \\left( 1 + \\frac{1}{n} \\right)^n.\n\nThe first known use of the constant, represented by the letter , was in correspondence from Gottfried Leibniz to Christiaan Huygens in 1690 and 1691. Leonhard Euler introduced the letter  as the base for natural logarithms, writing in a letter to Christian Goldbach of 25 November 1731.Lettre XV.  Euler à Goldbach, dated November 25, 1731 in:  P. H. Fuss, ed., Correspondance Mathématique et Physique de Quelques Célèbres Géomètres du XVIIIeme Siècle … (Mathematical and physical correspondence of some famous geometers of the 18th century), vol. 1, (St. Petersburg, Russia:  1843), pp. 56–60 ; see especially [https://books.google.com/books?idgf1OEXIQQgsC&pg\nPA58#vonepage&q&f\nfalse page 58.]  From page 58:  \" … ( e denotat hic numerum, cujus logarithmus hyperbolicus est 1), … \" ( … (e denotes that number whose hyperbolic [i.e., natural] logarithm is equal to 1) … ) Euler started to use the letter  for the constant in 1727 or 1728, in an unpublished paper on explosive forces in cannons,Euler, [http://www.math.dartmouth.edu/~euler/pages/E853.html Meditatio in experimenta explosione tormentorum nuper instituta]. and the first appearance of  in a publication was in Euler's Mechanica (1736).Leonhard Euler, Mechanica, sive Motus scientia analytice exposita (St. Petersburg (Petropoli), Russia:  Academy of Sciences, 1736), vol. 1, Chapter 2, Corollary 11, paragraph 171, p. 68.  [https://books.google.com/books?idqalsP7uMiV4C&pg\nPA68#vonepage&q&f\nfalse From page 68:]  Erit enim \\frac{dc}{c} \\frac{dy ds}{rdx} seu c \n e^{\\int\\frac{dy ds}{rdx}} ubi e denotat numerum, cuius logarithmus hyperbolicus est 1.  (So it [i.e., c, the speed] will be \\frac{dc}{c} \\frac{dy ds}{rdx} or c \n e^{\\int\\frac{dy ds}{rdx}}, where e denotes the number whose hyperbolic [i.e., natural] logarithm is 1.) While in the subsequent years some researchers used the letter , the letter  was more common and eventually became the standard.\n\nThe constant has been historically typeset as \"\", in italics, although the ISO 80000-2:2009 standard recommends typesetting constants in an upright style.\n\nApplications\n\nCompound interest\n\nJacob Bernoulli discovered this constant in 1683 by studying a question about compound interest:\n\nIf the interest is credited twice in the year, the interest rate for each 6 months will be 50%, so the initial $1 is multiplied by 1.5 twice, yielding $1.00×1.52  $2.25 at the end of the year. Compounding quarterly yields $1.00×1.254 \n $2.4414..., and compounding monthly yields $1.00×(1+1/12)12 = $2.613035... If there are  compounding intervals, the interest for each interval will be  and the value at the end of the year will be $1.00×.\n\nBernoulli noticed that this sequence approaches a limit (the force of interest) with larger  and, thus, smaller compounding intervals. Compounding weekly () yields $2.692597..., while compounding daily () yields $2.714567..., just two cents more. The limit as  grows large is the number that came to be known as ; with continuous compounding, the account value will reach $2.7182818... More generally, an account that starts at $1 and offers an annual interest rate of  will, after  years, yield  dollars with continuous compounding. (Here  is the decimal equivalent of the rate of interest expressed as a percentage, so for 5% interest, )\n\nBernoulli trials\n\nThe number  itself also has applications to probability theory, where it arises in a way not obviously related to exponential growth. Suppose that a gambler plays a slot machine that pays out with a probability of one in  and plays it  times. Then, for large  (such as a million) the probability that the gambler will lose every bet is approximately . For  it is already approximately 1/2.79.\n\nThis is an example of a Bernoulli trial process. Each time the gambler plays the slots, there is a one in one million chance of winning. Playing one million times is modelled by the binomial distribution, which is closely related to the binomial theorem. The probability of winning  times out of a million trials is:\n\nIn particular, the probability of winning zero times () is\n\nThis is very close to the following limit for :\n\nDerangements\n\nAnother application of , also discovered in part by Jacob Bernoulli along with Pierre Raymond de Montmort, is in the problem of derangements, also known as the hat check problem:Grinstead, C.M. and Snell, J.L.[http://www.dartmouth.edu/~chance/teaching_aids/books_articles/probability_book/book.html Introduction to probability theory] (published online under the GFDL), p. 85.  guests are invited to a party, and at the door each guest checks his hat with the butler who then places them into  boxes, each labelled with the name of one guest. But the butler does not know the identities of the guests, and so he puts the hats into boxes selected at random. The problem of de Montmort is to find the probability that none of the hats gets put into the right box. The answer is:\n\nAs the number  of guests tends to infinity,  approaches . Furthermore, the number of ways the hats can be placed into the boxes so that none of the hats are in the right box is  rounded to the nearest integer, for every positive .Knuth (1997) The Art of Computer Programming Volume I, Addison-Wesley, p. 183 .\n\nOptimal planning problems\n\nA stick of length  is broken into  equal parts.  The value of  that maximizes the product of the lengths is then either\nn=\\lfloor L/e\\rfloor,\\,\\, \\text{or }\\,\\,\\lfloor L/e\\rfloor + 1.\nThe stated result follows because the maximum value of x^{-1}\\ln x occurs at x=e (Steiner's problem, discussed below).  The quantity x^{-1}\\ln x is a measure of information gleaned from an event occurring with probability 1/x , so that essentially the same optimal division appears in optimal planning problems like the secretary problem.\n\nAsymptotics\n\nThe number  occurs naturally in connection with many problems involving asymptotics. A prominent example is Stirling's formula for the asymptotics of the factorial function, in which both the numbers  and Pi| enter:\n\nA particular consequence of this is\n.}}\n\nStandard normal distribution\n\nThe simplest case of a normal distribution is known as the standard normal distribution, described by this probability density function:\n\n\\, e^{- \\frac{\\scriptscriptstyle 1}{\\scriptscriptstyle 2} x^2}.}}\n\nThe factor \\scriptstyle 1/\\sqrt{2\\pi} in this expression ensures that the total area under the curve ϕ(x) is equal to one.[proof]  The  in the exponent ensures that the distribution has unit variance (and therefore also unit standard deviation). This function is symmetric around , where it attains its maximum value \\scriptstyle 1/\\sqrt{2\\pi}; and has inflection points at +1 and −1.\n\nIn calculus\n\nThe principal motivation for introducing the number , particularly in calculus, is to perform differential and integral calculus with exponential functions and logarithms.Kline, M. (1998) Calculus: An intuitive and physical approach, section 12.3 [https://books.google.com/books?idYdjK_rD7BEkC&pg\nPA337 \"The Derived Functions of Logarithmic Functions.\"], pp. 337 ff, Courier Dover Publications, 1998,  A general exponential function  has a derivative, given by a limit:\n\n\\begin{align}\n\\frac{d}{dx}a^x &\\lim_{h\\to 0}\\frac{a^{x+h}-a^x}{h}\n\\lim_{h\\to 0}\\frac{a^{x}a^{h}-a^x}{h} \\\\\n&=a^x\\cdot \\left(\\lim_{h\\to 0}\\frac{a^h-1}{h}\\right).\n\\end{align}\n\nThe parenthesized limit on the right is independent of the variable : it depends only on the base . When the base is , this limit is equal to 1, and so  is symbolically defined by the equation:\n\nConsequently, the exponential function with base  is particularly suited to doing calculus. Choosing , as opposed to some other number, as the base of the exponential function makes calculations involving the derivative much simpler.\n\nAnother motivation comes from considering the derivative of the base- logarithm,This is the approach taken by Kline (1998). i.e., of  for :\n\n\\begin{align}\n\\frac{d}{dx}\\log_a x &= \\lim_{h\\to 0}\\frac{\\log_a(x+h)-\\log_a(x)}{h} \\\\\n&=\\lim_{h\\to 0}\\frac{\\log_a(1+h/x)}{x\\cdot h/x} \\\\\n&=\\frac{1}{x}\\log_a\\left(\\lim_{u\\to 0}(1+u)^{1/u}\\right) \\\\\n&=\\frac{1}{x}\\log_a e,\n\\end{align}\n\nwhere the substitution  was made. The -logarithm of  is 1, if  equals . So symbolically,\n\nThe logarithm with this special base is called the natural logarithm and is denoted as ; it behaves well under differentiation since there is no undetermined limit to carry through the calculations.\n\nThere are thus two ways in which to select a special number . One way is to set the derivative of the exponential function  to , and solve for . The other way is to set the derivative of the base  logarithm to  and solve for . In each case, one arrives at a convenient choice of base for doing calculus. In fact, these two solutions for  are actually the same, the number .\n\nAlternative characterizations\n\nOther characterizations of  are also possible: one is as the limit of a sequence, another is as the sum of an infinite series, and still others rely on integral calculus. So far, the following two (equivalent) properties have been introduced:\n\n# The number  is the unique positive real number such that \n# The number  is the unique positive real number such that \n\nThe following three characterizations can be proven equivalent:\n\n The number  is the limit\n\nSimilarly:\n}}\n The number  is the sum of the infinite series\n\nwhere  is the factorial of .\n The number  is the unique positive real number such thatMore generally, by the substitution tu^n,\\quad \\int_{1}^{e^n} \\frac{1}{t} \\, dt \n n\\int_1^e\\frac{du}{u} = n. \n\nProperties\n\nCalculus\n\nAs in the motivation, the exponential function  is important in part because it is the unique nontrivial function (up to multiplication by a constant) which is its own derivative\n\n\\frac{d}{dx}e^x=e^x\n\nand therefore its own antiderivative as well:\n\n\\int e^x\\,dx = e^x + C.\n\nInequalities\n\nThe number  is the unique real number such that\n\\left(1+\\frac{1}{x}\\right)^x \nfor all positive x.\n\nAlso, we have the inequality\ne^x\\ge x+1\nfor all real x, with equality if and only if .  Furthermore,  is the unique base of the exponential for which the inequality  holds for all x.\n\nExponential-like functions\n\nSteiner's problem asks to find the global maximum for the function\n\n f(x) = x^{1/x}.\n\nThis maximum occurs precisely at .  For proof, the inequality e^y \\ge y+1, from above, evaluated at y=(x-e)/e and simplifying gives e^{x/e}\\ge x.  So e^{1/e}\\ge x^{1/x} for all positive x.\n\nSimilarly,  is where the global minimum occurs for the function\n\n f(x) = x^x\\, \n\ndefined for positive .  More generally, for the function\n\n \\!\\ f(x) = x^{x^n} \n\nthe global maximum for positive  occurs at  for any ; and the global minimum occurs at  for any .\n\nThe infinite tetration\n\n x^{x^{x^{\\cdot^{\\cdot^{\\cdot}}}}}  or {^\\infty}x\n\nconverges if and only if  (or approximately between 0.0660 and 1.4447), due to a theorem of Leonhard Euler.Euler, L. \"De serie Lambertina Plurimisque eius insignibus proprietatibus.\" Acta Acad. Scient. Petropol. 2, 29–51, 1783. Reprinted in Euler, L.  Opera Omnia, Series Prima, Vol. 6: Commentationes Algebraicae. Leipzig,  Germany: Teubner, pp. 350–369, 1921. ([http://math.dartmouth.edu/~euler/docs/originals/E532.pdf facsimile])\n\nNumber theory\n\nThe real number  is irrational. Euler proved this by showing that its simple continued fraction expansion is infinite. (See also Fourier's proof that  is irrational.)\n\nFurthermore, by the Lindemann–Weierstrass theorem,  is transcendental, meaning that it is not a solution of any non-constant polynomial equation with rational coefficients. It was the first number to be proved transcendental without having been specifically constructed for this purpose (compare with Liouville number); the proof was given by Charles Hermite in 1873.\n\nIt is conjectured that  is normal, meaning that when  is expressed in any base the possible digits in that base are uniformly distributed (occur with equal probability in any sequence of given length).\n\nComplex numbers\n\nThe exponential function  may be written as a Taylor series\n\n e^{x} 1 + {x \\over 1!} + {x^{2} \\over 2!} + {x^{3} \\over 3!} + \\cdots \n \\sum_{n=0}^{\\infty} \\frac{x^n}{n!}\n\nBecause this series keeps many important properties for  even when  is complex, it is commonly used to extend the definition of  to the complex numbers. This, with the Taylor series for sin and cos , allows one to derive Euler's formula:\n\ne^{ix} = \\cos x + i\\sin x,\\,\\!\n\nwhich holds for all . The special case with  is Euler's identity:\n\ne^{i\\pi} + 1 = 0\\,\\!\n\nfrom which it follows that, in the principal branch of the logarithm,\n\n\\ln (-1) = i\\pi.\\,\\!\n\nFurthermore, using the laws for exponentiation,\n\n(\\cos x + i\\sin x)^n \\left(e^{ix}\\right)^n \n e^{inx} = \\cos (nx) + i \\sin (nx),\n\nwhich is de Moivre's formula.\n\nThe expression\n\n\\cos x + i \\sin x \\,\n\nis sometimes referred to as .\n\nDifferential equations\n\nThe general function\n\ny(x) = Ce^x\\,\n\nis the solution to the differential equation:\n\ny' = y.\\,\n\nRepresentations\n\nThe number  can be represented as a real number in a variety of ways: as an infinite series, an infinite product, a continued fraction, or a limit of a sequence. The chief among these representations, particularly in introductory calculus courses is the limit\n\\lim_{n\\to\\infty}\\left(1+\\frac{1}{n}\\right)^n,\ngiven above, as well as the series\ne\\sum_{n\n0}^\\infty \\frac{1}{n!}\ngiven by evaluating the above power series for  at .\n\nLess common is the continued fraction .\n\ne [2;1,2,1,1,4,1,1,6,1,...,1,2n,1,...] \n [1;0,1,1,2,1,1,4,1,1,...,2n,1,1,...],\nHofstadter, D. R., \"Fluid Concepts and Creative Analogies: Computer Models of the Fundamental Mechanisms of Thought\" Basic Books (1995) \n\nwhich written out looks like\n\ne = 2+\n\\cfrac{1}\n   {1+\\cfrac{1}\n      {2 +\\cfrac{1}\n         {1+\\cfrac{1}\n            {1+\\cfrac{1}\n               {4 +\\cfrac{1}\n            {1+\\cfrac{1}\n               {1+\\ddots}\n                  }\n               }\n            }\n         }\n      }\n   }\n= 1+\n\\cfrac{1}\n  {0 + \\cfrac{1}\n    {1 + \\cfrac{1}\n      {1 + \\cfrac{1}\n        {2 + \\cfrac{1}\n          {1 + \\cfrac{1}\n            {1 + \\cfrac{1}\n              {4 + \\cfrac{1}\n            {1 + \\cfrac{1}\n              {1 + \\ddots}\n                }\n              }\n            }\n          }\n        }\n      }\n    }\n  }.\n\nThis continued fraction for  converges three times as quickly:\n e = [ 1 ; 0.5 , 12 , 5 , 28 , 9 , 44 , 13 , \\ldots , 4(4n-1) , (4n+1) , \\ldots ],\n\nwhich written out looks like\n\n e = 1+\\cfrac{2}{1+\\cfrac{1}{6+\\cfrac{1}{10+\\cfrac{1}{14+\\cfrac{1}{18+\\cfrac{1}{22+\\cfrac{1}{26+\\ddots\\,}}}}}}}.\n\nMany other series, sequence, continued fraction, and infinite product representations of  have been developed.\n\nStochastic representations\n\nIn addition to exact analytical expressions for representation of , there are stochastic techniques for estimating .  One such approach begins with an infinite sequence of independent random variables , ..., drawn from the uniform distribution on [0, 1]. Let  be the least number  such that the sum of the first  observations exceeds 1:\n\nV = \\min { \\left \\{ n \\mid X_1+X_2+\\cdots+X_n > 1 \\right \\} }.\n\nThen the expected value of  is : .Russell, K. G. (1991) [https://www.jstor.org/stable/2685243 Estimating the Value of e by Simulation] The American Statistician, Vol. 45, No. 1. (Feb., 1991), pp. 66–68.Dinov, ID (2007) [http://wiki.stat.ucla.edu/socr/index.php/SOCR_EduMaterials_Activities_LawOfLargeNumbers#Estimating_e_using_SOCR_simulation Estimating e using SOCR simulation], SOCR Hands-on Activities (retrieved December 26, 2007).\n\nKnown digits\n\nThe number of known digits of  has increased substantially during the last decades. This is due both to the increased performance of computers and to algorithmic improvements.Sebah, P. and Gourdon, X.; [http://numbers.computation.free.fr/Constants/E/e.html The constant e and its computation]Gourdon, X.; [http://numbers.computation.free.fr/Constants/PiProgram/computations.html Reported large computations with PiFast]\n\nSince that time, the proliferation of modern high-speed desktop computers has made it possible for amateurs, with the right hardware, to compute trillions of digits of e.\n\nIn computer culture\n\nIn contemporary internet culture, individuals and organizations frequently pay homage to the number .\n\nFor instance, in the IPO filing for Google in 2004, rather than a typical round-number amount of money, the company announced its intention to raise $2,718,281,828, which is  billion dollars rounded to the nearest dollar. Google was also responsible for a billboard[http://braintags.com/archives/2004/07/first-10digit-prime-found-in-consecutive-digits-of-e/ First 10-digit prime found in consecutive digits of }]. Brain Tags. Retrieved on 2012-02-24. that appeared in the heart of Silicon Valley, and later in Cambridge, Massachusetts; Seattle, Washington; and Austin, Texas. It read \"{first 10-digit prime found in consecutive digits of }.com\". Solving this problem and visiting the advertised (now defunct) web site led to an even more difficult problem to solve, which in turn led to Google Labs where the visitor was invited to submit a resume. The first 10-digit prime in  is 7427466391, which starts at the 99th digit.\n\nIn another instance, the computer scientist Donald Knuth let the version numbers of his program Metafont approach . The versions are 2, 2.7, 2.71, 2.718, and so forth.\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "E (mathematical constant)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9633" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The number  is a mathematical constant, approximately equal to 2.71828, which appears in many different settings throughout mathematics. It was discovered by the Swiss mathematician Jacob Bernoulli while studying compound interest, where  arises as the limit of  as  approaches infinity. The number  can also be calculated as the sum of the infinite seriesEncyclopedic Dictionary of Mathematics 142.D\ne  \\displaystyle\\sum\\limits_{n \n 0}^{ \\infty} \\dfrac{1}{n!} = \\frac{1}{1} + \\frac{1}{1} + \\frac{1}{1\\cdot 2} + \\frac{1}{1\\cdot 2\\cdot 3} + \\cdots\n\nAlso called Euler's number after the Swiss mathematician Leonhard Euler,  is different from , the Euler–Mascheroni constant, which is sometimes called simply Euler's constant. Occasionally, the number  is termed Napier's constant, but Euler's choice of the symbol  is said to have been retained in his honor.\n\nThe number  is of eminent importance in mathematics, alongside 0, 1, Pi| and Imaginary unit|. All five of these numbers play important and recurring roles across mathematics, and are the five constants appearing in one formulation of Euler's identity. Like the constant ,  is irrational: it is not a ratio of integers. Also like ,  is transcendental: it is not a root of any non-zero polynomial with rational coefficients. The numerical value of  truncated to 50 decimal places is\n\nThe function  is called the (natural) exponential function, and is the unique exponential function of type  equal to its own derivative (), so  can be spotted as the unique positive number  such that the graph of the function  has unit slope at . The natural logarithm, or logarithm to base , is the inverse function to the natural exponential function. The natural logarithm of a number  can also be defined directly as the area under the curve  between  and , in which case  is the value of  for which this area equals one (see image). In this view  is the unique number whose natural logarithm is equal to one.Oxford English Dictionary, 2nd ed.: [http://oxforddictionaries.com/definition/english/natural-logarithm natural logarithm]\n\nHistory\n\nThe first references to the constant were published in 1618 in the table of an appendix of a work on logarithms by John Napier. However, this did not contain the constant itself, but simply a list of logarithms calculated from the constant. It is assumed that the table was written by William Oughtred. The discovery of the constant itself is credited to Jacob Bernoulli in 1683,Jacob Bernoulli considered the problem of continuous compounding of interest, which led to a series expression for e.  See:  Jacob Bernoulli (1690) \"Quæstiones nonnullæ de usuris, cum solutione problematis de sorte alearum, propositi in Ephem. Gall. A. 1685\" (Some questions about interest, with a solution of a problem about games of chance, proposed in the Journal des Savants (Ephemerides Eruditorum Gallicanæ), in the year (anno) 1685.**), Acta eruditorum, pp. 219–223.  [https://books.google.com/books?ids4pw4GyHTRcC&pg\nPA222#vonepage&q&f\nfalse On page 222], Bernoulli poses the question:  \"Alterius naturæ hoc Problema est:  Quæritur, si creditor aliquis pecuniæ summam fænori exponat, ea lege, ut singulis momentis pars proportionalis usuræ annuæ sorti annumeretur; quantum ipsi finito anno debeatur?\"  (This is a problem of another kind:  The question is, if some lender were to invest [a] sum of money [at] interest, let it accumulate, so that [at] every moment [it] were to receive [a] proportional part of [its] annual interest; how much would he be owed [at the] end of [the] year?)  Bernoulli constructs a power series to calculate the answer, and then writes: \" … quæ nostra serie [mathematical expression for a geometric series] &c. major est.  … si ab, debebitur plu quam 2½a  & minus quam 3a.\" ( … which our series [a geometric series] is larger [than]. … if a\nb, [the lender] will be owed more than 2½a and less than 3a.)  If a=b, the geometric series reduces to the series for a × e, so 2.5  who attempted to find the value of the following expression (which is in fact ):\n\n\\lim_{n\\to\\infty} \\left( 1 + \\frac{1}{n} \\right)^n.\n\nThe first known use of the constant, represented by the letter , was in correspondence from Gottfried Leibniz to Christiaan Huygens in 1690 and 1691. Leonhard Euler introduced the letter  as the base for natural logarithms, writing in a letter to Christian Goldbach of 25 November 1731.Lettre XV.  Euler à Goldbach, dated November 25, 1731 in:  P. H. Fuss, ed., Correspondance Mathématique et Physique de Quelques Célèbres Géomètres du XVIIIeme Siècle … (Mathematical and physical correspondence of some famous geometers of the 18th century), vol. 1, (St. Petersburg, Russia:  1843), pp. 56–60 ; see especially [https://books.google.com/books?idgf1OEXIQQgsC&pg\nPA58#vonepage&q&f\nfalse page 58.]  From page 58:  \" … ( e denotat hic numerum, cujus logarithmus hyperbolicus est 1), … \" ( … (e denotes that number whose hyperbolic [i.e., natural] logarithm is equal to 1) … ) Euler started to use the letter  for the constant in 1727 or 1728, in an unpublished paper on explosive forces in cannons,Euler, [http://www.math.dartmouth.edu/~euler/pages/E853.html Meditatio in experimenta explosione tormentorum nuper instituta]. and the first appearance of  in a publication was in Euler's Mechanica (1736).Leonhard Euler, Mechanica, sive Motus scientia analytice exposita (St. Petersburg (Petropoli), Russia:  Academy of Sciences, 1736), vol. 1, Chapter 2, Corollary 11, paragraph 171, p. 68.  [https://books.google.com/books?idqalsP7uMiV4C&pg\nPA68#vonepage&q&f\nfalse From page 68:]  Erit enim \\frac{dc}{c} \\frac{dy ds}{rdx} seu c \n e^{\\int\\frac{dy ds}{rdx}} ubi e denotat numerum, cuius logarithmus hyperbolicus est 1.  (So it [i.e., c, the speed] will be \\frac{dc}{c} \\frac{dy ds}{rdx} or c \n e^{\\int\\frac{dy ds}{rdx}}, where e denotes the number whose hyperbolic [i.e., natural] logarithm is 1.) While in the subsequent years some researchers used the letter , the letter  was more common and eventually became the standard.\n\nThe constant has been historically typeset as \"\", in italics, although the ISO 80000-2:2009 standard recommends typesetting constants in an upright style.\n\nApplications\n\nCompound interest\n\nJacob Bernoulli discovered this constant in 1683 by studying a question about compound interest:\n\nIf the interest is credited twice in the year, the interest rate for each 6 months will be 50%, so the initial $1 is multiplied by 1.5 twice, yielding $1.00×1.52  $2.25 at the end of the year. Compounding quarterly yields $1.00×1.254 \n $2.4414..., and compounding monthly yields $1.00×(1+1/12)12 = $2.613035... If there are  compounding intervals, the interest for each interval will be  and the value at the end of the year will be $1.00×.\n\nBernoulli noticed that this sequence approaches a limit (the force of interest) with larger  and, thus, smaller compounding intervals. Compounding weekly () yields $2.692597..., while compounding daily () yields $2.714567..., just two cents more. The limit as  grows large is the number that came to be known as ; with continuous compounding, the account value will reach $2.7182818... More generally, an account that starts at $1 and offers an annual interest rate of  will, after  years, yield  dollars with continuous compounding. (Here  is the decimal equivalent of the rate of interest expressed as a percentage, so for 5% interest, )\n\nBernoulli trials\n\nThe number  itself also has applications to probability theory, where it arises in a way not obviously related to exponential growth. Suppose that a gambler plays a slot machine that pays out with a probability of one in  and plays it  times. Then, for large  (such as a million) the probability that the gambler will lose every bet is approximately . For  it is already approximately 1/2.79.\n\nThis is an example of a Bernoulli trial process. Each time the gambler plays the slots, there is a one in one million chance of winning. Playing one million times is modelled by the binomial distribution, which is closely related to the binomial theorem. The probability of winning  times out of a million trials is:\n\nIn particular, the probability of winning zero times () is\n\nThis is very close to the following limit for :\n\nDerangements\n\nAnother application of , also discovered in part by Jacob Bernoulli along with Pierre Raymond de Montmort, is in the problem of derangements, also known as the hat check problem:Grinstead, C.M. and Snell, J.L.[http://www.dartmouth.edu/~chance/teaching_aids/books_articles/probability_book/book.html Introduction to probability theory] (published online under the GFDL), p. 85.  guests are invited to a party, and at the door each guest checks his hat with the butler who then places them into  boxes, each labelled with the name of one guest. But the butler does not know the identities of the guests, and so he puts the hats into boxes selected at random. The problem of de Montmort is to find the probability that none of the hats gets put into the right box. The answer is:\n\nAs the number  of guests tends to infinity,  approaches . Furthermore, the number of ways the hats can be placed into the boxes so that none of the hats are in the right box is  rounded to the nearest integer, for every positive .Knuth (1997) The Art of Computer Programming Volume I, Addison-Wesley, p. 183 .\n\nOptimal planning problems\n\nA stick of length  is broken into  equal parts.  The value of  that maximizes the product of the lengths is then either\nn=\\lfloor L/e\\rfloor,\\,\\, \\text{or }\\,\\,\\lfloor L/e\\rfloor + 1.\nThe stated result follows because the maximum value of x^{-1}\\ln x occurs at x=e (Steiner's problem, discussed below).  The quantity x^{-1}\\ln x is a measure of information gleaned from an event occurring with probability 1/x , so that essentially the same optimal division appears in optimal planning problems like the secretary problem.\n\nAsymptotics\n\nThe number  occurs naturally in connection with many problems involving asymptotics. A prominent example is Stirling's formula for the asymptotics of the factorial function, in which both the numbers  and Pi| enter:\n\nA particular consequence of this is\n.}}\n\nStandard normal distribution\n\nThe simplest case of a normal distribution is known as the standard normal distribution, described by this probability density function:\n\n\\, e^{- \\frac{\\scriptscriptstyle 1}{\\scriptscriptstyle 2} x^2}.}}\n\nThe factor \\scriptstyle 1/\\sqrt{2\\pi} in this expression ensures that the total area under the curve ϕ(x) is equal to one.[proof]  The  in the exponent ensures that the distribution has unit variance (and therefore also unit standard deviation). This function is symmetric around , where it attains its maximum value \\scriptstyle 1/\\sqrt{2\\pi}; and has inflection points at +1 and −1.\n\nIn calculus\n\nThe principal motivation for introducing the number , particularly in calculus, is to perform differential and integral calculus with exponential functions and logarithms.Kline, M. (1998) Calculus: An intuitive and physical approach, section 12.3 [https://books.google.com/books?idYdjK_rD7BEkC&pg\nPA337 \"The Derived Functions of Logarithmic Functions.\"], pp. 337 ff, Courier Dover Publications, 1998,  A general exponential function  has a derivative, given by a limit:\n\n\\begin{align}\n\\frac{d}{dx}a^x &\\lim_{h\\to 0}\\frac{a^{x+h}-a^x}{h}\n\\lim_{h\\to 0}\\frac{a^{x}a^{h}-a^x}{h} \\\\\n&=a^x\\cdot \\left(\\lim_{h\\to 0}\\frac{a^h-1}{h}\\right).\n\\end{align}\n\nThe parenthesized limit on the right is independent of the variable : it depends only on the base . When the base is , this limit is equal to 1, and so  is symbolically defined by the equation:\n\nConsequently, the exponential function with base  is particularly suited to doing calculus. Choosing , as opposed to some other number, as the base of the exponential function makes calculations involving the derivative much simpler.\n\nAnother motivation comes from considering the derivative of the base- logarithm,This is the approach taken by Kline (1998). i.e., of  for :\n\n\\begin{align}\n\\frac{d}{dx}\\log_a x &= \\lim_{h\\to 0}\\frac{\\log_a(x+h)-\\log_a(x)}{h} \\\\\n&=\\lim_{h\\to 0}\\frac{\\log_a(1+h/x)}{x\\cdot h/x} \\\\\n&=\\frac{1}{x}\\log_a\\left(\\lim_{u\\to 0}(1+u)^{1/u}\\right) \\\\\n&=\\frac{1}{x}\\log_a e,\n\\end{align}\n\nwhere the substitution  was made. The -logarithm of  is 1, if  equals . So symbolically,\n\nThe logarithm with this special base is called the natural logarithm and is denoted as ; it behaves well under differentiation since there is no undetermined limit to carry through the calculations.\n\nThere are thus two ways in which to select a special number . One way is to set the derivative of the exponential function  to , and solve for . The other way is to set the derivative of the base  logarithm to  and solve for . In each case, one arrives at a convenient choice of base for doing calculus. In fact, these two solutions for  are actually the same, the number .\n\nAlternative characterizations\n\nOther characterizations of  are also possible: one is as the limit of a sequence, another is as the sum of an infinite series, and still others rely on integral calculus. So far, the following two (equivalent) properties have been introduced:\n\n# The number  is the unique positive real number such that \n# The number  is the unique positive real number such that \n\nThe following three characterizations can be proven equivalent:\n\n The number  is the limit\n\nSimilarly:\n}}\n The number  is the sum of the infinite series\n\nwhere  is the factorial of .\n The number  is the unique positive real number such thatMore generally, by the substitution tu^n,\\quad \\int_{1}^{e^n} \\frac{1}{t} \\, dt \n n\\int_1^e\\frac{du}{u} = n. \n\nProperties\n\nCalculus\n\nAs in the motivation, the exponential function  is important in part because it is the unique nontrivial function (up to multiplication by a constant) which is its own derivative\n\n\\frac{d}{dx}e^x=e^x\n\nand therefore its own antiderivative as well:\n\n\\int e^x\\,dx = e^x + C.\n\nInequalities\n\nThe number  is the unique real number such that\n\\left(1+\\frac{1}{x}\\right)^x \nfor all positive x.\n\nAlso, we have the inequality\ne^x\\ge x+1\nfor all real x, with equality if and only if .  Furthermore,  is the unique base of the exponential for which the inequality  holds for all x.\n\nExponential-like functions\n\nSteiner's problem asks to find the global maximum for the function\n\n f(x) = x^{1/x}.\n\nThis maximum occurs precisely at .  For proof, the inequality e^y \\ge y+1, from above, evaluated at y=(x-e)/e and simplifying gives e^{x/e}\\ge x.  So e^{1/e}\\ge x^{1/x} for all positive x.\n\nSimilarly,  is where the global minimum occurs for the function\n\n f(x) = x^x\\, \n\ndefined for positive .  More generally, for the function\n\n \\!\\ f(x) = x^{x^n} \n\nthe global maximum for positive  occurs at  for any ; and the global minimum occurs at  for any .\n\nThe infinite tetration\n\n x^{x^{x^{\\cdot^{\\cdot^{\\cdot}}}}}  or {^\\infty}x\n\nconverges if and only if  (or approximately between 0.0660 and 1.4447), due to a theorem of Leonhard Euler.Euler, L. \"De serie Lambertina Plurimisque eius insignibus proprietatibus.\" Acta Acad. Scient. Petropol. 2, 29–51, 1783. Reprinted in Euler, L.  Opera Omnia, Series Prima, Vol. 6: Commentationes Algebraicae. Leipzig,  Germany: Teubner, pp. 350–369, 1921. ([http://math.dartmouth.edu/~euler/docs/originals/E532.pdf facsimile])\n\nNumber theory\n\nThe real number  is irrational. Euler proved this by showing that its simple continued fraction expansion is infinite. (See also Fourier's proof that  is irrational.)\n\nFurthermore, by the Lindemann–Weierstrass theorem,  is transcendental, meaning that it is not a solution of any non-constant polynomial equation with rational coefficients. It was the first number to be proved transcendental without having been specifically constructed for this purpose (compare with Liouville number); the proof was given by Charles Hermite in 1873.\n\nIt is conjectured that  is normal, meaning that when  is expressed in any base the possible digits in that base are uniformly distributed (occur with equal probability in any sequence of given length).\n\nComplex numbers\n\nThe exponential function  may be written as a Taylor series\n\n e^{x} 1 + {x \\over 1!} + {x^{2} \\over 2!} + {x^{3} \\over 3!} + \\cdots \n \\sum_{n=0}^{\\infty} \\frac{x^n}{n!}\n\nBecause this series keeps many important properties for  even when  is complex, it is commonly used to extend the definition of  to the complex numbers. This, with the Taylor series for sin and cos , allows one to derive Euler's formula:\n\ne^{ix} = \\cos x + i\\sin x,\\,\\!\n\nwhich holds for all . The special case with  is Euler's identity:\n\ne^{i\\pi} + 1 = 0\\,\\!\n\nfrom which it follows that, in the principal branch of the logarithm,\n\n\\ln (-1) = i\\pi.\\,\\!\n\nFurthermore, using the laws for exponentiation,\n\n(\\cos x + i\\sin x)^n \\left(e^{ix}\\right)^n \n e^{inx} = \\cos (nx) + i \\sin (nx),\n\nwhich is de Moivre's formula.\n\nThe expression\n\n\\cos x + i \\sin x \\,\n\nis sometimes referred to as .\n\nDifferential equations\n\nThe general function\n\ny(x) = Ce^x\\,\n\nis the solution to the differential equation:\n\ny' = y.\\,\n\nRepresentations\n\nThe number  can be represented as a real number in a variety of ways: as an infinite series, an infinite product, a continued fraction, or a limit of a sequence. The chief among these representations, particularly in introductory calculus courses is the limit\n\\lim_{n\\to\\infty}\\left(1+\\frac{1}{n}\\right)^n,\ngiven above, as well as the series\ne\\sum_{n\n0}^\\infty \\frac{1}{n!}\ngiven by evaluating the above power series for  at .\n\nLess common is the continued fraction .\n\ne [2;1,2,1,1,4,1,1,6,1,...,1,2n,1,...] \n [1;0,1,1,2,1,1,4,1,1,...,2n,1,1,...],\nHofstadter, D. R., \"Fluid Concepts and Creative Analogies: Computer Models of the Fundamental Mechanisms of Thought\" Basic Books (1995) \n\nwhich written out looks like\n\ne = 2+\n\\cfrac{1}\n   {1+\\cfrac{1}\n      {2 +\\cfrac{1}\n         {1+\\cfrac{1}\n            {1+\\cfrac{1}\n               {4 +\\cfrac{1}\n            {1+\\cfrac{1}\n               {1+\\ddots}\n                  }\n               }\n            }\n         }\n      }\n   }\n= 1+\n\\cfrac{1}\n  {0 + \\cfrac{1}\n    {1 + \\cfrac{1}\n      {1 + \\cfrac{1}\n        {2 + \\cfrac{1}\n          {1 + \\cfrac{1}\n            {1 + \\cfrac{1}\n              {4 + \\cfrac{1}\n            {1 + \\cfrac{1}\n              {1 + \\ddots}\n                }\n              }\n            }\n          }\n        }\n      }\n    }\n  }.\n\nThis continued fraction for  converges three times as quickly:\n e = [ 1 ; 0.5 , 12 , 5 , 28 , 9 , 44 , 13 , \\ldots , 4(4n-1) , (4n+1) , \\ldots ],\n\nwhich written out looks like\n\n e = 1+\\cfrac{2}{1+\\cfrac{1}{6+\\cfrac{1}{10+\\cfrac{1}{14+\\cfrac{1}{18+\\cfrac{1}{22+\\cfrac{1}{26+\\ddots\\,}}}}}}}.\n\nMany other series, sequence, continued fraction, and infinite product representations of  have been developed.\n\nStochastic representations\n\nIn addition to exact analytical expressions for representation of , there are stochastic techniques for estimating .  One such approach begins with an infinite sequence of independent random variables , ..., drawn from the uniform distribution on [0, 1]. Let  be the least number  such that the sum of the first  observations exceeds 1:\n\nV = \\min { \\left \\{ n \\mid X_1+X_2+\\cdots+X_n > 1 \\right \\} }.\n\nThen the expected value of  is : .Russell, K. G. (1991) [https://www.jstor.org/stable/2685243 Estimating the Value of e by Simulation] The American Statistician, Vol. 45, No. 1. (Feb., 1991), pp. 66–68.Dinov, ID (2007) [http://wiki.stat.ucla.edu/socr/index.php/SOCR_EduMaterials_Activities_LawOfLargeNumbers#Estimating_e_using_SOCR_simulation Estimating e using SOCR simulation], SOCR Hands-on Activities (retrieved December 26, 2007).\n\nKnown digits\n\nThe number of known digits of  has increased substantially during the last decades. This is due both to the increased performance of computers and to algorithmic improvements.Sebah, P. and Gourdon, X.; [http://numbers.computation.free.fr/Constants/E/e.html The constant e and its computation]Gourdon, X.; [http://numbers.computation.free.fr/Constants/PiProgram/computations.html Reported large computations with PiFast]\n\nSince that time, the proliferation of modern high-speed desktop computers has made it possible for amateurs, with the right hardware, to compute trillions of digits of e.\n\nIn computer culture\n\nIn contemporary internet culture, individuals and organizations frequently pay homage to the number .\n\nFor instance, in the IPO filing for Google in 2004, rather than a typical round-number amount of money, the company announced its intention to raise $2,718,281,828, which is  billion dollars rounded to the nearest dollar. Google was also responsible for a billboard[http://braintags.com/archives/2004/07/first-10digit-prime-found-in-consecutive-digits-of-e/ First 10-digit prime found in consecutive digits of }]. Brain Tags. Retrieved on 2012-02-24. that appeared in the heart of Silicon Valley, and later in Cambridge, Massachusetts; Seattle, Washington; and Austin, Texas. It read \"{first 10-digit prime found in consecutive digits of }.com\". Solving this problem and visiting the advertised (now defunct) web site led to an even more difficult problem to solve, which in turn led to Google Labs where the visitor was invited to submit a resume. The first 10-digit prime in  is 7427466391, which starts at the 99th digit.\n\nIn another instance, the computer scientist Donald Knuth let the version numbers of his program Metafont approach . The versions are 2, 2.7, 2.71, 2.718, and so forth.\n\nNotes. E (mathematical constant). http://en.wikipedia.org/?curid=9633."
  }
}
