{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20202",
  "eid" : "40b01ce0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778617774,
  "textBody" : "Meir David HaKohen Kahane () (; August 1, 1932 – November 5, 1990) was an American-Israeli Orthodox rabbi, ultra-nationalist politician, teacher, and writer, whose work became either the direct or the indirect foundation of most modern Jewish militant and far right-wing political groups. He was an ordained Orthodox rabbi, and later served as a member of the Israeli Knesset.\n\nKahane spent years reaching out to Jews through published works, weekly articles, speeches, and debates on college campuses and in synagogues throughout the United States, and appearances on various televised programs and radio shows. He gained recognition as an extreme advocate for Jewish causes, such as organizing defense squads and patrols in Jewish neighborhoods and demanding the Soviet Union \"release its oppressed Jews\". He later became known in the United States and Israel for supporting violence against the enemies of the Jewish people, calls for emergency Jewish mass migration to Israel due to a potential \"second Holocaust\" in the United States, proposing that Israel's democracy be reserved for its Jewish citizens, and hoping that Israel would eventually adopt Jewish religious law, and endorsing the annexation of the West Bank and Gaza Strip.\n\nKahane proposed enforcing Jewish law, as codified by Maimonides, under which non-Jews wishing to dwell in Israel would have three options: remain as \"resident strangers\" with all rights but national ones; leave Israel and receive compensation for their property; or for those who refused either option, be forcibly removed without compensation. While serving in Israel's Knesset in the mid-1980s, Kahane proposed numerous laws, none of which passed, to emphasize Judaism in public schools, to do away with Israel's bureaucracy, to forbid sexual relations between non-Jews and Jews, and to end cultural meetings between Jewish and Arab students.Brinkley, Joel. [https://www.nytimes.com/1988/10/06/world/israel-bans-kahane-party-from-election.html?pagewanted\n1 \"Israel Bans Kahane Party From Election\"], The New York Times, October 6, 1988.\n\nKahane founded the Jewish Defense League (JDL) in the United States, as well as the Israeli political party Kach (\"Thus\"). In 1971, he was convicted for conspiracy to manufacture explosives. In 1984, he became a member of the Knesset, when Kach gained one seat in parliamentary elections. In 1988, after polls showed Kach gaining popularity, the Israeli government banned Kach for being \"racist\" and \"anti-democratic\" under the terms of an ad hoc law.\n\nKahane was assassinated in a Manhattan hotel by an Arab gunman in November 1990.\n\nEarly life and education\n\nMartin David Kahane was born in Brooklyn, New York, in 1932 to an Orthodox Jewish family. His father, Yechezkel (Charles) Kahane, the author of the \"Torah Yesharah\", studied at Polish and Czech yeshivas, was involved in the Revisionist Zionist movement, and was a close friend of Ze'ev Jabotinsky.\n\nAs a teenager, Kahane became an ardent admirer of Ze'ev Jabotinsky and Peter Bergson, who were frequent guests in his parents' home, and he joined the Betar (Brit Trumpeldor) youth wing of Revisionist Zionism. He was active in protests against Ernest Bevin, the British Foreign Secretary who maintained restrictions on the immigration of Jews (even Nazi death camp survivors) to Palestine after the end of the Second World War. In 1947, Kahane was arrested for throwing eggs and tomatoes at Bevin, as the latter disembarked at Pier 84 on a visit to New York. A photo of the arrest appeared in the New York Daily News.Friedman, Robert I. The false prophet – Rabbi Meir Kahane – from FBI informant to Knesset member, New York, 1990, p.9.  In 1954, he became the mazkir (director) of Greater New York City’s sixteen Bnei Akiva chapters.\n\nKahane's formal education included elementary school at the Yeshiva of Flatbush, and he attended high school at both Abraham Lincoln H.S. and the Brooklyn Talmudical Academy. Kahane received his rabbinical ordination from the Mir Yeshiva in Brooklyn, where he was especially admired by the head, Rabbi Abraham Kalmanowitz, and he began going by his Hebrew name, Meir. He was fully conversant in the Tanakh (Jewish Bible), the Talmud, the Midrash, and Jewish law. Subsequently, Kahane earned a B.A. in Political Science from Brooklyn College, a Bachelor of Law - LL.B. from New York Law School, and an M.A. in International Relations from New York University.Libby Kahane, \"Rabbi Meir Kahane: His Life and Thought\" vol. 2, chap 6, note 3 p. 577.\n\nCareer \n\nPulpit rabbi\n\nIn 1956, Kahane married Libby Blum, with whom he had four children:Nathan-Kazis, Josh. [http://www.haaretz.com/hasen/spages/1053151.html \"Carrying a Torch\"], Ha'Aretz, January 6, 2009. Tzipporah, Tova, Baruch, and Binyamin. In 1958, he became the rabbi of the Howard Beach Jewish Center in Queens, New York City. Although the synagogue was originally Conservative, rather than strictly Orthodox, the board of directors agreed to Kahane's conditions, which included resigning from the Conservative movement's United Synagogue of America, installing a partition separating men and women during prayer, instituting traditional prayers, and maintaining a kosher kitchen. At the Jewish Center, Kahane influenced many of the synagogue's youngsters to adopt a more observant lifestyle, which often troubled parents.\"Rabbi Meir Kahane: His Life and Thought\", pp. 48, 49. He trained Arlo Guthrie for his bar mitzvah. When his contract was not renewed, he soon published an article entitled \"End of the Miracle of Howard Beach\". This was Kahane's first article in the Jewish Press, an American Orthodox Jewish weekly, for which he continued to write until his assassination in 1990.Rakeffet-Rothkoff, Aaron. [http://www.ou.org/index.php/jewish_action/article/50163/ Review of Rabbi Meir Kahane: His Life and Thought] Rabbi Meir Kahane also served as an assistant rabbi in the Young Israel of Laurelton and as rabbi of the Rochdale Village Jewish Center., Jewish Action. Kahane also used the pen name David Sinai, and the pseudonyms Michael King, David Borac, and Martin Keene.\n\nInfiltrating the John Birch Society\n\nIn the late 1950s and early 1960s, Kahane's life of secrecy and his strong anti-communist views landed him a position as a consultant with the FBI. According to his wife, Libby, his assignment was to infiltrate the anti-communist John Birch Society and report his findings back to the FBI. Later, Michael T. Kaufman published an article claiming that at this point, Kahane confided in him that he had been in a relationship with Gloria Jean D'Argenio. According to these allegations, Kahane allegedly sent a letter to D'Argenio in which he unilaterally ended their relationship whereby, in response, D'Argenio jumped off the Queensboro Bridge and died of her injuries the next day.[https://www.nytimes.com/1994/03/06/weekinreview/remembering-kahane-and-the-woman-on-the-bridge.html?src\npm Remembering Kahane, and the Woman on the Bridge] New York Times; March 6, 1994\n\nAnti-Communist activism and collaboration with Joseph Churba\n\nAt some time in the late 1950s, Kahane took on the persona of a Gentile individual, along with the pseudonym Michael King. At this point, Kahane began openly expressing anti-Communist positions. He and Joseph Churba created the July Fourth Movement, which was formed to counteract widespread opposition towards U.S. involvement in the Vietnam War. Subsequently, they co-authored the text, The Jewish Stake in Vietnam together, which was an attempt to convince American Jews of the \"evil of Communism\". The book's introduction states that, \"all Americans have a stake in this grim war against Communism.... it is vital that Jews realize the threat to their very survival [should Communism succeed].\" Churba had a major falling out with Kahane over the use of para-militarism, and they permanently parted ways. Churba went on to pursue his own career, joining the US Air Force, writing many books on the Middle East, and later becoming one of Ronald Reagan's consultants. Kahane chose to fight for Jewish rights, and was willing to use extreme measures. He even attempted to acquire and grow biological weapons to use on a Soviet military installation, but failed. He began using the phrase \"Never Again\", and conceived the Jewish Star and fist insignia, a symbol resembling that of the Black Panther Party, though Kahane himself opposed the Black Panther party due to anti-Jewish riots they had supported in Massachusetts and their leftist leanings, as he saw it.\n\nThe Jewish Defense League\n\nThe Jewish Defense League (JDL) was founded by Kahane in New York City in 1968. JDL's self-described purpose was to protect Jews from local manifestations of anti-Semitism. The JDL said it was committed to five fundamental principles:\n\n* Love of Jewry: One Jewish people, indivisible and united, from which flows the love for, and the feeling of pain of, all Jews.\n* Dignity and Pride: Pride in and knowledge of Jewish tradition, faith, culture, land, history, strength, pain, and peoplehood.\n* Iron: The need to both move to help Jews everywhere and to change the Jewish image through sacrifice and all necessary means—even strength, force, and violence.\n* Discipline and Unity: The knowledge that he (or she) can and will do whatever must be done, and the unity and strength of willpower to bring this into reality.\n* Faith in the Indestructibility of the Jewish People: Faith in the greatness and indestructibility of the Jewish people, our religion, and our Land of Israel.\n\nThe JDL favored civil rights for blacks, but opposed black anti-Semites and racism of any form. In 1971, the JDL formed an alliance with a black rights group in what Kahane termed \"a turning point in Black-Jewish relations\". Despite the JDL's anti-racist positions, and its inclusion of individuals of all colors and faiths, the Anti-Defamation League claimed that Kahane \"preached a radical form of Jewish nationalism which reflected racism, violence and political extremism\" which were replicated by Irv Rubin, the JDL's successor to Kahane.\n\nTerrorism and convictions \n\nA number of the JDL's members and leaders, including Kahane, were convicted of acts related to domestic terrorism. In 1971, Kahane was sentenced to 5 years in prison, suspended, for conspiring to manufacture explosives. In 1975, Kahane was arrested for leading the attack on the Soviet United Nations mission and injuring two officers, but he was released after being given summonses for disorderly conduct. Later that same year, Kahane was accused of conspiring to kidnap a Soviet diplomat, bomb the Iraqi embassy in Washington, and ship arms abroad from Israel. He was convicted of violating his probation for the 1971 bombing conviction, and sentenced to one year in prison. However, he served most of it in a hotel, with frequently unsupervised absences, due to a concession over the provision of kosher food. In a 1984 interview with Washington Post correspondent Carla Hall, Kahane admitted that the JDL \"bombed the Russian [Soviet] mission in New York, the Russian cultural mission here [Washington] in 1971, the Soviet trade offices\".\n\nImmigration to Israel\n\nIn 1971, Kahane emigrated to Israel. When he moved to Israel, Kahane declared that he would focus on Jewish education.Ehud Sprinzak (1999). Brother against Brother. The Free Press. p. 189 He later began gathering lists of Arab residents who were willing to emigrate for compensation, and eventually, he initiated protests which advocated the expulsion of Arabs from Israel and the occupied territories. In 1972, Jewish Defense League leaflets were distributed in Hebron, calling for the mayor to stand trial for the 1929 Hebron massacre.The Kach Movement – Background. [http://www.mfa.gov.il Israel Ministry of Foreign Affairs] : March 3, 1994 Kahane was arrested dozens of times.60 Minutes – Meir Kahane In 1971, he founded the Kach party. In 1973, the party ran for the Knesset (Israeli parliament) during the general elections under the name \"The League List\". The party won 12,811 votes (0.82%), just 2,857 (0.18%) short of the electoral threshold at the time (1%) for winning a Knesset seat. The party was even less successful in the 1977 elections, winning 4,836 votes.\n\nIn 1980, Kahane was arrested for the 62nd time since his emigration, and he was jailed for six months following a detention order based on allegations of planning armed attacks against Palestinians in response to the killings of Jewish settlers.[https://news.google.com/newspapers?idKnwxAAAAIBAJ&sjid\nbaQFAAAAIBAJ&pg3057,1747482&dq\nkahane+arrested&hlen Israelis arrest rabbi on terrorism charges], The Montreal Gazette May 15, 1980 Kahane was held in prison in Ramla, where he wrote the book They Must Go. Kahane was banned from entering the United Kingdom in 1981.https://news.google.com/newspapers?nid\n1314&dat19811023&id\nplROAAAAIBAJ&sjidd-4DAAAAIBAJ&pg\n1701,3233841&hl=en\n\nIn 1981, Kahane's Kach party again ran for the Knesset during the 1981 elections, but it did not win a seat, receiving only 5,128 votes. In 1984, the Central Elections Committee banned him from being a candidate on the grounds that Kach was a racist party, but the Supreme Court of Israel overturned the ban on grounds that the committee was not authorized to ban Kahane's candidacy.Israel Court Drops Ban on 2 Political Parties, New York Times, June 29, 1984, p. 3 The Supreme Court suggested that the Knesset pass a law that would authorize the exclusion of racist parties from future elections, and the Anti-Racist Law of 1988 was later passed.\n\nElection to Knesset \n\nIn the 1984 legislative elections, Kahane's Kach party received 25,907 votes, enough to give the party one seat in the Knesset, which was taken by Kahane. Kahane refused to take the standard oath of office, and insisted on adding a Biblical verse from Psalms, to indicate that when national laws and the Torah conflict, the Torah (Biblical) law should have supremacy over the laws of the Knesset. Kahane's legislative proposals focused on Jewish education, an open economy, transferring the Arab population out from the Land of Israel, revoking Israeli citizenship from non-Jews, and banning Jewish-Gentile marriages and sexual relations, based on the Code of Jewish Law compiled by Maimonides in the Mishneh Torah.\n\nAs his political career progressed, and his popularity in the streets began growing, Kahane became increasingly isolated in the Knesset. His speeches, boycotted by nearly all Knesset members, were often made to an empty parliament, except for the duty chairman and the transcriptionist. Kahane's legislative proposals and motions of no-confidence against the government were ignored or rejected by fellow Knesset members. Kahane often pejoratively called other Knesset members \"Hellenists\" (a reference to Jews who assimilated into Greek culture after Judea's occupation by Alexander the Great). In 1987, Kahane opened a yeshiva (\"HaRaayon HaYehudi\") with funding from US supporters, to teach \"the Authentic Jewish Idea\". Despite the boycott, Kahane's popularity grew among the Israeli public, especially among working-class Sephardi Jews.[http://www.people.com/people/archive/article/0,,20113657,00.html After a Career of Preaching Hatred for Arabs, Rabbi Meir Kahane Is Cut Down by An Assassin's Bullet] People Magazine Polls showed that Kach would have likely received anywhere from four to twelve seats in the coming November 1988 elections.[http://www.washington-report.org/backissues/0799/9907081.html Jewish Defense League Unleashes Campaign of Violence in America] New York Times, October 17, 1988, Samuel G. Freedman\n\nIn 1985, the Knesset passed an amendment to Israel's Basic Law, barring \"racist\" candidates from election. The Central Elections Committee banned Kahane a second time, and he appealed to the Israeli Supreme Court. This time, the Supreme Court ruled in favor of the committee, disqualifying Kach from running in the 1988 elections. Kahane was thus the first candidate in Israel to be barred from election for racism. The move was criticized as being anti-democratic by Alan M. Dershowitz.\n\nAssassination\n\nIn November 1990, Kahane gave a speech to an audience of mostly Orthodox Jews from Brooklyn, warning American Jews to immigrate to Israel before it was \"too late\". As a crowd gathered around Kahane in the second-floor lecture hall in midtown Manhattan's New York Marriott East Side, Kahane was assassinatedKatz, Samuel M. \"Relentless Pursuit: The DSS and the manhunt for the al-Qaeda terrorists\", 2002Hamm, Mark S (2007). Terrorism as Crime: From Oklahoma City to Al-Qaeda and Beyond. NYU Press, p 29 by El Sayyid Nosair, an Egyptian-born American citizen trained in Pakistan, who was initially charged and acquitted of the murder. Nosair was later convicted of the murder in United States district court incident to the trial for his involvement in the 1993 World Trade Center bombing. Prosecutors were able to re-try Nosair for the murder because the federal indictment includes the killing as part of the alleged terrorist conspiracy.[http://www.cnn.com/US/9510/terror_trial/update/ CNN] Jenkins, Brian. \"Sheik, others convicted in New York\", October 1, 1995, CNN He was sentenced to life imprisonment, and later made a confession to federal agents.[http://www.jpost.com/International/Article.aspx?id\n184761 Scheffler, Gil. \"Sharon was Kahane killer's target\"], Aug 15, 2010, The Jerusalem Post\n\nSome researchers, such as Peter Lance, consider Kahane one of the first, if not the very first, American victims of the then-nascent Al Qaeda, as his killer is believed to have links to Osama bin Laden's network. The cell that Kahane's assassin belonged to had been training in the New York metro since the middle of 1989. Kahane was buried on Har HaMenuchot in Jerusalem. Kahane's funeral was one of the largest in Israel's history, where approximately 150,000 participated. He was eulogized by a number of prominent supporters in both the US and Israel, including Rabbi Moshe Tendler and the Sephardic Chief Rabbi of Israel, Mordechai Eliyahu, who spoke of how little the people understood of Kahane's \"true value\".\"Gentlemen, not everyone knows Rabbi Meir! They do not know his true value! His fear of heaven! His learning! His kindness! The help he gave in secret! How many families receive food products from him on the eve of Passover, the eve of Sukkoth, the eve of Rosh HaShana; how many poor people got money from him – and all this, giving in secret! I can tell you that just recently, before Rosh HaShana, Rabbi Meir handed out some 34,000 dollars. There was a family that needed money, so he took money from his private funds and gave them! This is kindness! This is fear of heaven! This is charity! This is giving in secret! His inner qualities, the delicacy of his soul, his inner fear of heaven! This, people do not know, with this they are not familiar. Gentlemen! As if we know how carefully he used to fix times for Torah study! Who was the first to speak of Russian Jewry? Who awakened the Israeli people and the entire world from their slumbers, with regard to Russian Jewry? Who was it who predicted that Russian Jews would yet come out of their exile? It was Rabbi Meir Kahane – may God avenge his blood! I can mention now the number of agunoth I asked him to act on behalf of – thanks to his efforts we succeeded in saving a goodly number of agunoth. He saved many Jewish women from non-Jewish hands! Rabbi Meir, Rabbi Meir! I ask of you to rise up to heaven and to awaken all those who were put to death by the authorities, so that they can act in heaven for the benefit of all of Israel, so that we need not mourn any more, and so that your own sacrifice will be the last one, so that crying and screaming shall no longer be heard in our day, and so that we be found worthy of the final redemption, speedily and in our day. Amen.\"\n\nIdeology\n\nKahane argued that there was a glory in Jewish destiny, which came through the observance of the Torah. He also noted that, \"Democracy and Judaism are not the same thing.\"\"One absolutely cannot confuse them. The objective of a democratic state is to allow a person to do exactly as he wishes. The objective of Judaism is to serve God and to make people better. These are two totally opposite conceptions of life. Kahane also stressed the view that a Jewish state and a Western democracy were incompatible, since a Western democracy is religion-blind, and a Jewish state is religion-oriented by its very name. He also warned of the danger of non-Jewish citizens becoming a majority and voting against the Jewish character of the state: \"The question is as follows: if the Arabs settle among us and make enough children to become a majority, will Israel continue to be a Jewish state? Do we have to accept that the Arab majority will decide?\"Kahane.org \"Western democracy has to be ruled out. For me that's cut and dried: there's no question of setting up democracy in Israel, because democracy means equal rights for all, irrespective of racial or religious origins.\"\n\nKahane proposed an \"exchange of populations\" that would continue the Jewish exodus from Arab lands: \"A total of some 750,000 Jews fled Arab lands since 1948. Surely it is time for Jews, worried over the huge growth of Arabs in Israel, to consider finishing the exchange of populations that began 35 years ago.\" Kahane proposed a $40,000 compensation plan for Arabs who would leave voluntarily, and forcible expulsion for those who \"don't want to leave\", and he encouraged retaliatory violence against Arabs who attacked Jews: \"I approve of anybody who commits such acts of violence. Really, I don't think that we can sit back and watch Arabs throwing rocks at buses whenever they feel like it. They must understand that a bomb thrown at a Jewish bus is going to mean a bomb thrown at an Arab bus.\"\n\nIn some of his writings, Kahane argued that Israel should never start a war for territory, but if a war were launched against Israel, Biblical territory should be annexed. However, in an interview, he defined Israel's \"minimal borders\" as follows: \"the southern boundary goes up to El Arish, which takes in all of northern Sinai, including Yamit. To the east, the frontier runs along the western part of the East Bank of the Jordan River, hence part of what is now Jordan. Eretz Yisrael also includes part of Lebanon and certain parts of Syria, and part of Iraq, all the way to the Euphrates River. When critics suggested that following Kahane's plans would mean a perpetual war between Jews and Arabs, Kahane responded, \"There will be a perpetual war. With or without Kahane.\"\n\nSupport\n\n* Irving M. Bunim, who was the major lay leader of Orthodox Jewry and the trusted assistant of Rabbi Aharon Kotler, was a strong supporter and admirer of Kahane.\n* Shlomo Carlebach was known for declaring that the Jewish people owed a great debt to Kahane. Together, Carlebach and Kahane organized one of the first Noahide conferences in the 1980s.\n* Bob Dylan made positive comments about Kahane. In a 1971 interview for Time magazine, Dylan said, \"He's a really sincere guy. He's really put it all together.\" According to Kahane, Dylan attended several meetings of the Jewish Defense League in order to find out \"what we're all about\" and he started to have talks with the rabbi. Subsequently, Dylan downplayed the extent of his contact with Kahane.Heylin, Bob Dylan: Behind the Shades Revisited, p. 329.\n* The former Sephardic Chief Rabbi of Israel (1983–93), Mordechai Eliyahu, was Kahane's personal mentor, and one of Kahane's staunchest supporters. Eliyahu wrote an approbation to Kahane's Tanakh commentary, \"Perush Hamacabee\", where he refers to Kahane as \"HaRav HaGaon\" (\"the rabbinic genius\"), a praiseworthy title attributed to the very saintly. Eliyahu wrote that, \"Only the Torah way interested Kahane, which he constantly toiled over and which served as his strength\", and, \"When one considers the depth and clarity of [Kahane's] works, one is astonished at how he had the time to compile such. The answer is that ... all his time and thoughts were invested in Torah while other matters were secondary. Fortunate is the family that publishes his works for others to learn from.\" At Kahane's funeral, Eliyahu stated that Kahane was a reincarnation of a fearless biblical character.\n* Kahane was endorsed in his bid for a Knesset seat by Zvi Yehuda Kook, the son of the first Chief Rabbi of Israel and the spiritual leader of the Gush Emunim movement. Kook had been a staunch supporter of the National Religious Party, but he broke with them in 1974 when they entered the Rabin government despite his opposition. In his letter of support for Kahane, Kook stated: \"The presence of Rabbi Meir Kahane and his uncompromising words from the Knesset platform will undoubtedly add strength and value to the obligatory struggle on behalf of the entire Land of Israel.\" The announcement of Kook's support of Kahane and his letter were made available to the Jewish Telegraphic Agency.\n* Yosef Mendelevitch stated that, \"Kahane was a representative for us. His activities made us feel good. His actions showed that Jews cared. His actions may have been controversial, but his role was very important. He was a symbol for Russian Jews.\"\n* Moshe Tendler, son-in-law of Moshe Feinstein, praised Kahane, and stated that, \"His whole goal was always 'How do you make each Jew stand tall?'\"\n* Yaakov Yosef, the son of Ovadia Yosef who headed the Hazon Ya'akov Yeshiva and served as rabbi of the Givat Moshe neighborhood in Jerusalem, described Kahane as one who \"fulfilled his role faithfully\", and declared that, \"We must learn from [Kahane's] great actions in order that we learn the way of the Torah.\" While serving in the Knesset as part of the Shas party, Yosef was one of the few who remained to listen to Kahane's addresses.\n\nLegacy\n\nFollowing Kahane's death, no leader emerged to replace him in the movement, although the idea of transferring populations, mainly attributed to Kahane, was subsequently incorporated into the political platform of various political parties in Israel, such as Moledet (applying to Arab non-citizen residents of the West Bank) and Yisrael Beiteinu (in the form of population exchange). Two small Kahanist factions later emerged; one under the name Kach, and the other under the name Kahane chai (Hebrew: כהנא חי, literally \"Kahane lives [on]\"), the second one was led by his younger son, Binyamin Ze'ev Kahane. Neither one was permitted to participate in the Knesset elections by the Central Elections Committee.\n\nIn 1994, following the Cave of the Patriarchs massacre of Palestinian Muslim worshippers in Hebron by Kach supporter Baruch Goldstein, in which 29 Muslim worshipers were killed, the Israeli government declared both parties to be terrorist organizations. The U.S. State Department also added Kach and Kahane Chai to its list of Foreign Terrorist Organizations.\n\nIn the 2003 Knesset elections, Herut, which split off from the National Union list, ran with Michael Kleiner, and former Kach activist Baruch Marzel taking the top two spots on the list. The joint effort narrowly missed the 1.5% barrier. In the following 2006 elections, the Jewish National Front, led by Baruch Marzel, fared better, but also failed to pass the minimum threshold. A follower of Kahane who was involved with Kach for many years, Michael Ben-Ari, was elected to the Knesset in the 2009 elections on renewed National Union list. He stood again in the 2013 elections as the second candidate on the list of Otzma LeYisrael, but the party failed to pass the minimum threshold.\n\nIn 2007, the FBI released over a thousand documents relating to their daily surveillance of Kahane since the early 1960s.\n\nIn 2015, Kahane's grandson, Meir Ettinger, was detained by Israeli law enforcement. He was the alleged leader of the radical Jewish group \"The Revolt\". In an online \"manifesto\" echoing some of his grandfather's teachings, Ettinger promotes the \"dispossession of gentiles\" who live in Israel, and the establishment of a new \"kingdom of Israel\", a theocracy ruled by Halacha. Ettinger's writings have condemned Israel's government, mainstream rabbis, and the IDF, and they also have denounced Christian churches as \"idolatry\".[https://www.nytimes.com/2015/08/05/world/middleeast/israel-palestinians-meir-ettinger.html Israeli Detains Meir Kahane’s Grandson, a Scion of Jewish Militancy] The New York Times, 4 August 2015\n\nIn 2016, Kahane's widow claimed that modern Jewish extremists in Israel are not following the ideology of her late husband, and she justified this claim by arguing that unlike modern Jewish extremists, he had a more mature approach which did not encourage illegal activities.\n\nThe prosecution argued that Arab MK Haneen Zoabi should be banned for denying the Jewish People's existence, and he was banned by the Central Elections Committee, using the Kahane precedent. A week later, this was unanimously overturned by the Supreme Court. Attempts to ban the Strong Israel and Balad political parties by using the Kahane precedent were also overturned.\n\nIn 2017, The Forward reported that some of Kahane's followers were aligning themselves with white nationalists and the alt-right. Other Kahanists declared that such moves did not reflect Kahane's teachings, and they supported this declaration by arguing that Kahane worked together with African Americans.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Meir Kahane" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20202" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Meir David HaKohen Kahane () (; August 1, 1932 – November 5, 1990) was an American-Israeli Orthodox rabbi, ultra-nationalist politician, teacher, and writer, whose work became either the direct or the indirect foundation of most modern Jewish militant and far right-wing political groups. He was an ordained Orthodox rabbi, and later served as a member of the Israeli Knesset.\n\nKahane spent years reaching out to Jews through published works, weekly articles, speeches, and debates on college campuses and in synagogues throughout the United States, and appearances on various televised programs and radio shows. He gained recognition as an extreme advocate for Jewish causes, such as organizing defense squads and patrols in Jewish neighborhoods and demanding the Soviet Union \"release its oppressed Jews\". He later became known in the United States and Israel for supporting violence against the enemies of the Jewish people, calls for emergency Jewish mass migration to Israel due to a potential \"second Holocaust\" in the United States, proposing that Israel's democracy be reserved for its Jewish citizens, and hoping that Israel would eventually adopt Jewish religious law, and endorsing the annexation of the West Bank and Gaza Strip.\n\nKahane proposed enforcing Jewish law, as codified by Maimonides, under which non-Jews wishing to dwell in Israel would have three options: remain as \"resident strangers\" with all rights but national ones; leave Israel and receive compensation for their property; or for those who refused either option, be forcibly removed without compensation. While serving in Israel's Knesset in the mid-1980s, Kahane proposed numerous laws, none of which passed, to emphasize Judaism in public schools, to do away with Israel's bureaucracy, to forbid sexual relations between non-Jews and Jews, and to end cultural meetings between Jewish and Arab students.Brinkley, Joel. [https://www.nytimes.com/1988/10/06/world/israel-bans-kahane-party-from-election.html?pagewanted\n1 \"Israel Bans Kahane Party From Election\"], The New York Times, October 6, 1988.\n\nKahane founded the Jewish Defense League (JDL) in the United States, as well as the Israeli political party Kach (\"Thus\"). In 1971, he was convicted for conspiracy to manufacture explosives. In 1984, he became a member of the Knesset, when Kach gained one seat in parliamentary elections. In 1988, after polls showed Kach gaining popularity, the Israeli government banned Kach for being \"racist\" and \"anti-democratic\" under the terms of an ad hoc law.\n\nKahane was assassinated in a Manhattan hotel by an Arab gunman in November 1990.\n\nEarly life and education\n\nMartin David Kahane was born in Brooklyn, New York, in 1932 to an Orthodox Jewish family. His father, Yechezkel (Charles) Kahane, the author of the \"Torah Yesharah\", studied at Polish and Czech yeshivas, was involved in the Revisionist Zionist movement, and was a close friend of Ze'ev Jabotinsky.\n\nAs a teenager, Kahane became an ardent admirer of Ze'ev Jabotinsky and Peter Bergson, who were frequent guests in his parents' home, and he joined the Betar (Brit Trumpeldor) youth wing of Revisionist Zionism. He was active in protests against Ernest Bevin, the British Foreign Secretary who maintained restrictions on the immigration of Jews (even Nazi death camp survivors) to Palestine after the end of the Second World War. In 1947, Kahane was arrested for throwing eggs and tomatoes at Bevin, as the latter disembarked at Pier 84 on a visit to New York. A photo of the arrest appeared in the New York Daily News.Friedman, Robert I. The false prophet – Rabbi Meir Kahane – from FBI informant to Knesset member, New York, 1990, p.9.  In 1954, he became the mazkir (director) of Greater New York City’s sixteen Bnei Akiva chapters.\n\nKahane's formal education included elementary school at the Yeshiva of Flatbush, and he attended high school at both Abraham Lincoln H.S. and the Brooklyn Talmudical Academy. Kahane received his rabbinical ordination from the Mir Yeshiva in Brooklyn, where he was especially admired by the head, Rabbi Abraham Kalmanowitz, and he began going by his Hebrew name, Meir. He was fully conversant in the Tanakh (Jewish Bible), the Talmud, the Midrash, and Jewish law. Subsequently, Kahane earned a B.A. in Political Science from Brooklyn College, a Bachelor of Law - LL.B. from New York Law School, and an M.A. in International Relations from New York University.Libby Kahane, \"Rabbi Meir Kahane: His Life and Thought\" vol. 2, chap 6, note 3 p. 577.\n\nCareer \n\nPulpit rabbi\n\nIn 1956, Kahane married Libby Blum, with whom he had four children:Nathan-Kazis, Josh. [http://www.haaretz.com/hasen/spages/1053151.html \"Carrying a Torch\"], Ha'Aretz, January 6, 2009. Tzipporah, Tova, Baruch, and Binyamin. In 1958, he became the rabbi of the Howard Beach Jewish Center in Queens, New York City. Although the synagogue was originally Conservative, rather than strictly Orthodox, the board of directors agreed to Kahane's conditions, which included resigning from the Conservative movement's United Synagogue of America, installing a partition separating men and women during prayer, instituting traditional prayers, and maintaining a kosher kitchen. At the Jewish Center, Kahane influenced many of the synagogue's youngsters to adopt a more observant lifestyle, which often troubled parents.\"Rabbi Meir Kahane: His Life and Thought\", pp. 48, 49. He trained Arlo Guthrie for his bar mitzvah. When his contract was not renewed, he soon published an article entitled \"End of the Miracle of Howard Beach\". This was Kahane's first article in the Jewish Press, an American Orthodox Jewish weekly, for which he continued to write until his assassination in 1990.Rakeffet-Rothkoff, Aaron. [http://www.ou.org/index.php/jewish_action/article/50163/ Review of Rabbi Meir Kahane: His Life and Thought] Rabbi Meir Kahane also served as an assistant rabbi in the Young Israel of Laurelton and as rabbi of the Rochdale Village Jewish Center., Jewish Action. Kahane also used the pen name David Sinai, and the pseudonyms Michael King, David Borac, and Martin Keene.\n\nInfiltrating the John Birch Society\n\nIn the late 1950s and early 1960s, Kahane's life of secrecy and his strong anti-communist views landed him a position as a consultant with the FBI. According to his wife, Libby, his assignment was to infiltrate the anti-communist John Birch Society and report his findings back to the FBI. Later, Michael T. Kaufman published an article claiming that at this point, Kahane confided in him that he had been in a relationship with Gloria Jean D'Argenio. According to these allegations, Kahane allegedly sent a letter to D'Argenio in which he unilaterally ended their relationship whereby, in response, D'Argenio jumped off the Queensboro Bridge and died of her injuries the next day.[https://www.nytimes.com/1994/03/06/weekinreview/remembering-kahane-and-the-woman-on-the-bridge.html?src\npm Remembering Kahane, and the Woman on the Bridge] New York Times; March 6, 1994\n\nAnti-Communist activism and collaboration with Joseph Churba\n\nAt some time in the late 1950s, Kahane took on the persona of a Gentile individual, along with the pseudonym Michael King. At this point, Kahane began openly expressing anti-Communist positions. He and Joseph Churba created the July Fourth Movement, which was formed to counteract widespread opposition towards U.S. involvement in the Vietnam War. Subsequently, they co-authored the text, The Jewish Stake in Vietnam together, which was an attempt to convince American Jews of the \"evil of Communism\". The book's introduction states that, \"all Americans have a stake in this grim war against Communism.... it is vital that Jews realize the threat to their very survival [should Communism succeed].\" Churba had a major falling out with Kahane over the use of para-militarism, and they permanently parted ways. Churba went on to pursue his own career, joining the US Air Force, writing many books on the Middle East, and later becoming one of Ronald Reagan's consultants. Kahane chose to fight for Jewish rights, and was willing to use extreme measures. He even attempted to acquire and grow biological weapons to use on a Soviet military installation, but failed. He began using the phrase \"Never Again\", and conceived the Jewish Star and fist insignia, a symbol resembling that of the Black Panther Party, though Kahane himself opposed the Black Panther party due to anti-Jewish riots they had supported in Massachusetts and their leftist leanings, as he saw it.\n\nThe Jewish Defense League\n\nThe Jewish Defense League (JDL) was founded by Kahane in New York City in 1968. JDL's self-described purpose was to protect Jews from local manifestations of anti-Semitism. The JDL said it was committed to five fundamental principles:\n\n* Love of Jewry: One Jewish people, indivisible and united, from which flows the love for, and the feeling of pain of, all Jews.\n* Dignity and Pride: Pride in and knowledge of Jewish tradition, faith, culture, land, history, strength, pain, and peoplehood.\n* Iron: The need to both move to help Jews everywhere and to change the Jewish image through sacrifice and all necessary means—even strength, force, and violence.\n* Discipline and Unity: The knowledge that he (or she) can and will do whatever must be done, and the unity and strength of willpower to bring this into reality.\n* Faith in the Indestructibility of the Jewish People: Faith in the greatness and indestructibility of the Jewish people, our religion, and our Land of Israel.\n\nThe JDL favored civil rights for blacks, but opposed black anti-Semites and racism of any form. In 1971, the JDL formed an alliance with a black rights group in what Kahane termed \"a turning point in Black-Jewish relations\". Despite the JDL's anti-racist positions, and its inclusion of individuals of all colors and faiths, the Anti-Defamation League claimed that Kahane \"preached a radical form of Jewish nationalism which reflected racism, violence and political extremism\" which were replicated by Irv Rubin, the JDL's successor to Kahane.\n\nTerrorism and convictions \n\nA number of the JDL's members and leaders, including Kahane, were convicted of acts related to domestic terrorism. In 1971, Kahane was sentenced to 5 years in prison, suspended, for conspiring to manufacture explosives. In 1975, Kahane was arrested for leading the attack on the Soviet United Nations mission and injuring two officers, but he was released after being given summonses for disorderly conduct. Later that same year, Kahane was accused of conspiring to kidnap a Soviet diplomat, bomb the Iraqi embassy in Washington, and ship arms abroad from Israel. He was convicted of violating his probation for the 1971 bombing conviction, and sentenced to one year in prison. However, he served most of it in a hotel, with frequently unsupervised absences, due to a concession over the provision of kosher food. In a 1984 interview with Washington Post correspondent Carla Hall, Kahane admitted that the JDL \"bombed the Russian [Soviet] mission in New York, the Russian cultural mission here [Washington] in 1971, the Soviet trade offices\".\n\nImmigration to Israel\n\nIn 1971, Kahane emigrated to Israel. When he moved to Israel, Kahane declared that he would focus on Jewish education.Ehud Sprinzak (1999). Brother against Brother. The Free Press. p. 189 He later began gathering lists of Arab residents who were willing to emigrate for compensation, and eventually, he initiated protests which advocated the expulsion of Arabs from Israel and the occupied territories. In 1972, Jewish Defense League leaflets were distributed in Hebron, calling for the mayor to stand trial for the 1929 Hebron massacre.The Kach Movement – Background. [http://www.mfa.gov.il Israel Ministry of Foreign Affairs] : March 3, 1994 Kahane was arrested dozens of times.60 Minutes – Meir Kahane In 1971, he founded the Kach party. In 1973, the party ran for the Knesset (Israeli parliament) during the general elections under the name \"The League List\". The party won 12,811 votes (0.82%), just 2,857 (0.18%) short of the electoral threshold at the time (1%) for winning a Knesset seat. The party was even less successful in the 1977 elections, winning 4,836 votes.\n\nIn 1980, Kahane was arrested for the 62nd time since his emigration, and he was jailed for six months following a detention order based on allegations of planning armed attacks against Palestinians in response to the killings of Jewish settlers.[https://news.google.com/newspapers?idKnwxAAAAIBAJ&sjid\nbaQFAAAAIBAJ&pg3057,1747482&dq\nkahane+arrested&hlen Israelis arrest rabbi on terrorism charges], The Montreal Gazette May 15, 1980 Kahane was held in prison in Ramla, where he wrote the book They Must Go. Kahane was banned from entering the United Kingdom in 1981.https://news.google.com/newspapers?nid\n1314&dat19811023&id\nplROAAAAIBAJ&sjidd-4DAAAAIBAJ&pg\n1701,3233841&hl=en\n\nIn 1981, Kahane's Kach party again ran for the Knesset during the 1981 elections, but it did not win a seat, receiving only 5,128 votes. In 1984, the Central Elections Committee banned him from being a candidate on the grounds that Kach was a racist party, but the Supreme Court of Israel overturned the ban on grounds that the committee was not authorized to ban Kahane's candidacy.Israel Court Drops Ban on 2 Political Parties, New York Times, June 29, 1984, p. 3 The Supreme Court suggested that the Knesset pass a law that would authorize the exclusion of racist parties from future elections, and the Anti-Racist Law of 1988 was later passed.\n\nElection to Knesset \n\nIn the 1984 legislative elections, Kahane's Kach party received 25,907 votes, enough to give the party one seat in the Knesset, which was taken by Kahane. Kahane refused to take the standard oath of office, and insisted on adding a Biblical verse from Psalms, to indicate that when national laws and the Torah conflict, the Torah (Biblical) law should have supremacy over the laws of the Knesset. Kahane's legislative proposals focused on Jewish education, an open economy, transferring the Arab population out from the Land of Israel, revoking Israeli citizenship from non-Jews, and banning Jewish-Gentile marriages and sexual relations, based on the Code of Jewish Law compiled by Maimonides in the Mishneh Torah.\n\nAs his political career progressed, and his popularity in the streets began growing, Kahane became increasingly isolated in the Knesset. His speeches, boycotted by nearly all Knesset members, were often made to an empty parliament, except for the duty chairman and the transcriptionist. Kahane's legislative proposals and motions of no-confidence against the government were ignored or rejected by fellow Knesset members. Kahane often pejoratively called other Knesset members \"Hellenists\" (a reference to Jews who assimilated into Greek culture after Judea's occupation by Alexander the Great). In 1987, Kahane opened a yeshiva (\"HaRaayon HaYehudi\") with funding from US supporters, to teach \"the Authentic Jewish Idea\". Despite the boycott, Kahane's popularity grew among the Israeli public, especially among working-class Sephardi Jews.[http://www.people.com/people/archive/article/0,,20113657,00.html After a Career of Preaching Hatred for Arabs, Rabbi Meir Kahane Is Cut Down by An Assassin's Bullet] People Magazine Polls showed that Kach would have likely received anywhere from four to twelve seats in the coming November 1988 elections.[http://www.washington-report.org/backissues/0799/9907081.html Jewish Defense League Unleashes Campaign of Violence in America] New York Times, October 17, 1988, Samuel G. Freedman\n\nIn 1985, the Knesset passed an amendment to Israel's Basic Law, barring \"racist\" candidates from election. The Central Elections Committee banned Kahane a second time, and he appealed to the Israeli Supreme Court. This time, the Supreme Court ruled in favor of the committee, disqualifying Kach from running in the 1988 elections. Kahane was thus the first candidate in Israel to be barred from election for racism. The move was criticized as being anti-democratic by Alan M. Dershowitz.\n\nAssassination\n\nIn November 1990, Kahane gave a speech to an audience of mostly Orthodox Jews from Brooklyn, warning American Jews to immigrate to Israel before it was \"too late\". As a crowd gathered around Kahane in the second-floor lecture hall in midtown Manhattan's New York Marriott East Side, Kahane was assassinatedKatz, Samuel M. \"Relentless Pursuit: The DSS and the manhunt for the al-Qaeda terrorists\", 2002Hamm, Mark S (2007). Terrorism as Crime: From Oklahoma City to Al-Qaeda and Beyond. NYU Press, p 29 by El Sayyid Nosair, an Egyptian-born American citizen trained in Pakistan, who was initially charged and acquitted of the murder. Nosair was later convicted of the murder in United States district court incident to the trial for his involvement in the 1993 World Trade Center bombing. Prosecutors were able to re-try Nosair for the murder because the federal indictment includes the killing as part of the alleged terrorist conspiracy.[http://www.cnn.com/US/9510/terror_trial/update/ CNN] Jenkins, Brian. \"Sheik, others convicted in New York\", October 1, 1995, CNN He was sentenced to life imprisonment, and later made a confession to federal agents.[http://www.jpost.com/International/Article.aspx?id\n184761 Scheffler, Gil. \"Sharon was Kahane killer's target\"], Aug 15, 2010, The Jerusalem Post\n\nSome researchers, such as Peter Lance, consider Kahane one of the first, if not the very first, American victims of the then-nascent Al Qaeda, as his killer is believed to have links to Osama bin Laden's network. The cell that Kahane's assassin belonged to had been training in the New York metro since the middle of 1989. Kahane was buried on Har HaMenuchot in Jerusalem. Kahane's funeral was one of the largest in Israel's history, where approximately 150,000 participated. He was eulogized by a number of prominent supporters in both the US and Israel, including Rabbi Moshe Tendler and the Sephardic Chief Rabbi of Israel, Mordechai Eliyahu, who spoke of how little the people understood of Kahane's \"true value\".\"Gentlemen, not everyone knows Rabbi Meir! They do not know his true value! His fear of heaven! His learning! His kindness! The help he gave in secret! How many families receive food products from him on the eve of Passover, the eve of Sukkoth, the eve of Rosh HaShana; how many poor people got money from him – and all this, giving in secret! I can tell you that just recently, before Rosh HaShana, Rabbi Meir handed out some 34,000 dollars. There was a family that needed money, so he took money from his private funds and gave them! This is kindness! This is fear of heaven! This is charity! This is giving in secret! His inner qualities, the delicacy of his soul, his inner fear of heaven! This, people do not know, with this they are not familiar. Gentlemen! As if we know how carefully he used to fix times for Torah study! Who was the first to speak of Russian Jewry? Who awakened the Israeli people and the entire world from their slumbers, with regard to Russian Jewry? Who was it who predicted that Russian Jews would yet come out of their exile? It was Rabbi Meir Kahane – may God avenge his blood! I can mention now the number of agunoth I asked him to act on behalf of – thanks to his efforts we succeeded in saving a goodly number of agunoth. He saved many Jewish women from non-Jewish hands! Rabbi Meir, Rabbi Meir! I ask of you to rise up to heaven and to awaken all those who were put to death by the authorities, so that they can act in heaven for the benefit of all of Israel, so that we need not mourn any more, and so that your own sacrifice will be the last one, so that crying and screaming shall no longer be heard in our day, and so that we be found worthy of the final redemption, speedily and in our day. Amen.\"\n\nIdeology\n\nKahane argued that there was a glory in Jewish destiny, which came through the observance of the Torah. He also noted that, \"Democracy and Judaism are not the same thing.\"\"One absolutely cannot confuse them. The objective of a democratic state is to allow a person to do exactly as he wishes. The objective of Judaism is to serve God and to make people better. These are two totally opposite conceptions of life. Kahane also stressed the view that a Jewish state and a Western democracy were incompatible, since a Western democracy is religion-blind, and a Jewish state is religion-oriented by its very name. He also warned of the danger of non-Jewish citizens becoming a majority and voting against the Jewish character of the state: \"The question is as follows: if the Arabs settle among us and make enough children to become a majority, will Israel continue to be a Jewish state? Do we have to accept that the Arab majority will decide?\"Kahane.org \"Western democracy has to be ruled out. For me that's cut and dried: there's no question of setting up democracy in Israel, because democracy means equal rights for all, irrespective of racial or religious origins.\"\n\nKahane proposed an \"exchange of populations\" that would continue the Jewish exodus from Arab lands: \"A total of some 750,000 Jews fled Arab lands since 1948. Surely it is time for Jews, worried over the huge growth of Arabs in Israel, to consider finishing the exchange of populations that began 35 years ago.\" Kahane proposed a $40,000 compensation plan for Arabs who would leave voluntarily, and forcible expulsion for those who \"don't want to leave\", and he encouraged retaliatory violence against Arabs who attacked Jews: \"I approve of anybody who commits such acts of violence. Really, I don't think that we can sit back and watch Arabs throwing rocks at buses whenever they feel like it. They must understand that a bomb thrown at a Jewish bus is going to mean a bomb thrown at an Arab bus.\"\n\nIn some of his writings, Kahane argued that Israel should never start a war for territory, but if a war were launched against Israel, Biblical territory should be annexed. However, in an interview, he defined Israel's \"minimal borders\" as follows: \"the southern boundary goes up to El Arish, which takes in all of northern Sinai, including Yamit. To the east, the frontier runs along the western part of the East Bank of the Jordan River, hence part of what is now Jordan. Eretz Yisrael also includes part of Lebanon and certain parts of Syria, and part of Iraq, all the way to the Euphrates River. When critics suggested that following Kahane's plans would mean a perpetual war between Jews and Arabs, Kahane responded, \"There will be a perpetual war. With or without Kahane.\"\n\nSupport\n\n* Irving M. Bunim, who was the major lay leader of Orthodox Jewry and the trusted assistant of Rabbi Aharon Kotler, was a strong supporter and admirer of Kahane.\n* Shlomo Carlebach was known for declaring that the Jewish people owed a great debt to Kahane. Together, Carlebach and Kahane organized one of the first Noahide conferences in the 1980s.\n* Bob Dylan made positive comments about Kahane. In a 1971 interview for Time magazine, Dylan said, \"He's a really sincere guy. He's really put it all together.\" According to Kahane, Dylan attended several meetings of the Jewish Defense League in order to find out \"what we're all about\" and he started to have talks with the rabbi. Subsequently, Dylan downplayed the extent of his contact with Kahane.Heylin, Bob Dylan: Behind the Shades Revisited, p. 329.\n* The former Sephardic Chief Rabbi of Israel (1983–93), Mordechai Eliyahu, was Kahane's personal mentor, and one of Kahane's staunchest supporters. Eliyahu wrote an approbation to Kahane's Tanakh commentary, \"Perush Hamacabee\", where he refers to Kahane as \"HaRav HaGaon\" (\"the rabbinic genius\"), a praiseworthy title attributed to the very saintly. Eliyahu wrote that, \"Only the Torah way interested Kahane, which he constantly toiled over and which served as his strength\", and, \"When one considers the depth and clarity of [Kahane's] works, one is astonished at how he had the time to compile such. The answer is that ... all his time and thoughts were invested in Torah while other matters were secondary. Fortunate is the family that publishes his works for others to learn from.\" At Kahane's funeral, Eliyahu stated that Kahane was a reincarnation of a fearless biblical character.\n* Kahane was endorsed in his bid for a Knesset seat by Zvi Yehuda Kook, the son of the first Chief Rabbi of Israel and the spiritual leader of the Gush Emunim movement. Kook had been a staunch supporter of the National Religious Party, but he broke with them in 1974 when they entered the Rabin government despite his opposition. In his letter of support for Kahane, Kook stated: \"The presence of Rabbi Meir Kahane and his uncompromising words from the Knesset platform will undoubtedly add strength and value to the obligatory struggle on behalf of the entire Land of Israel.\" The announcement of Kook's support of Kahane and his letter were made available to the Jewish Telegraphic Agency.\n* Yosef Mendelevitch stated that, \"Kahane was a representative for us. His activities made us feel good. His actions showed that Jews cared. His actions may have been controversial, but his role was very important. He was a symbol for Russian Jews.\"\n* Moshe Tendler, son-in-law of Moshe Feinstein, praised Kahane, and stated that, \"His whole goal was always 'How do you make each Jew stand tall?'\"\n* Yaakov Yosef, the son of Ovadia Yosef who headed the Hazon Ya'akov Yeshiva and served as rabbi of the Givat Moshe neighborhood in Jerusalem, described Kahane as one who \"fulfilled his role faithfully\", and declared that, \"We must learn from [Kahane's] great actions in order that we learn the way of the Torah.\" While serving in the Knesset as part of the Shas party, Yosef was one of the few who remained to listen to Kahane's addresses.\n\nLegacy\n\nFollowing Kahane's death, no leader emerged to replace him in the movement, although the idea of transferring populations, mainly attributed to Kahane, was subsequently incorporated into the political platform of various political parties in Israel, such as Moledet (applying to Arab non-citizen residents of the West Bank) and Yisrael Beiteinu (in the form of population exchange). Two small Kahanist factions later emerged; one under the name Kach, and the other under the name Kahane chai (Hebrew: כהנא חי, literally \"Kahane lives [on]\"), the second one was led by his younger son, Binyamin Ze'ev Kahane. Neither one was permitted to participate in the Knesset elections by the Central Elections Committee.\n\nIn 1994, following the Cave of the Patriarchs massacre of Palestinian Muslim worshippers in Hebron by Kach supporter Baruch Goldstein, in which 29 Muslim worshipers were killed, the Israeli government declared both parties to be terrorist organizations. The U.S. State Department also added Kach and Kahane Chai to its list of Foreign Terrorist Organizations.\n\nIn the 2003 Knesset elections, Herut, which split off from the National Union list, ran with Michael Kleiner, and former Kach activist Baruch Marzel taking the top two spots on the list. The joint effort narrowly missed the 1.5% barrier. In the following 2006 elections, the Jewish National Front, led by Baruch Marzel, fared better, but also failed to pass the minimum threshold. A follower of Kahane who was involved with Kach for many years, Michael Ben-Ari, was elected to the Knesset in the 2009 elections on renewed National Union list. He stood again in the 2013 elections as the second candidate on the list of Otzma LeYisrael, but the party failed to pass the minimum threshold.\n\nIn 2007, the FBI released over a thousand documents relating to their daily surveillance of Kahane since the early 1960s.\n\nIn 2015, Kahane's grandson, Meir Ettinger, was detained by Israeli law enforcement. He was the alleged leader of the radical Jewish group \"The Revolt\". In an online \"manifesto\" echoing some of his grandfather's teachings, Ettinger promotes the \"dispossession of gentiles\" who live in Israel, and the establishment of a new \"kingdom of Israel\", a theocracy ruled by Halacha. Ettinger's writings have condemned Israel's government, mainstream rabbis, and the IDF, and they also have denounced Christian churches as \"idolatry\".[https://www.nytimes.com/2015/08/05/world/middleeast/israel-palestinians-meir-ettinger.html Israeli Detains Meir Kahane’s Grandson, a Scion of Jewish Militancy] The New York Times, 4 August 2015\n\nIn 2016, Kahane's widow claimed that modern Jewish extremists in Israel are not following the ideology of her late husband, and she justified this claim by arguing that unlike modern Jewish extremists, he had a more mature approach which did not encourage illegal activities.\n\nThe prosecution argued that Arab MK Haneen Zoabi should be banned for denying the Jewish People's existence, and he was banned by the Central Elections Committee, using the Kahane precedent. A week later, this was unanimously overturned by the Supreme Court. Attempts to ban the Strong Israel and Balad political parties by using the Kahane precedent were also overturned.\n\nIn 2017, The Forward reported that some of Kahane's followers were aligning themselves with white nationalists and the alt-right. Other Kahanists declared that such moves did not reflect Kahane's teachings, and they supported this declaration by arguing that Kahane worked together with African Americans. Meir Kahane. http://en.wikipedia.org/?curid=20202."
  }
}
