{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6130",
  "eid" : "da186140-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778445652,
  "textBody" : "Cornish (') is a Southwestern Brittonic Celtic language native to Cornwall. The language began a revival in the early 20th century and is considered to be an important part of Cornish identity, culture and heritage. Cornish is currently a recognised minority language of the United Kingdom, protected under the European Charter for Regional or Minority Languages, and has a growing number of second language speakers and a small number of first language speakers.\n\nAlong with Welsh and Breton, Cornish is descended directly from the Common Brittonic language spoken throughout much of Britain before the English language came to dominate. It was the main language of Cornwall for centuries until it was pushed westwards by English, maintaining close links with its sister language Breton with which it was mutually intelligible until well into the Middle Ages. Cornish continued to function as a common community language in parts of Cornwall until the late 18th century, and continued to be spoken in the home by some families into the 19th and possibly 20th centuries, overlapping the beginning of revival efforts. A process to revive the language was begun in the early 20th century, with a number of orthographical systems still in use, although an attempt was made to impose a Standard Written Form in 2008. In 2010 UNESCO announced that its former classification of the language as \"extinct\" was \"no longer accurate\".\n\nSince the revival of the language, some Cornish textbooks and works of literature have been published and an increasing number of people are studying the language. Recent developments include Cornish music,[http://www.magakernow.org.uk/index.aspx?articleid\n38589]  independent films,[http://www.magakernow.org.uk/index.aspx?articleid38588]  and children's books. A small number of people in Cornwall have been brought up to be bilingual native speakers,Ken MacKinnon, Cornish Language Study 2000 – http://www.magakernow.org.uk/default.aspx?page797 and the language is taught in many schools. The first Cornish language crèche opened in 2010.\n\nClassification \n\nCornish is one of the Brittonic languages, which constitute a branch of the Insular Celtic section of the Celtic language family. Brittonic also includes Welsh, Breton and the Cumbric language; the last is extinct. Scottish Gaelic, Irish and Manx are part of the separate Goidelic branch of Insular Celtic.\n\nJoseph Loth viewed Cornish and Breton as being two dialects of the same language, claiming that \"Middle Cornish is without doubt closer to Breton as a whole than the modern Breton dialect of Quiberon is to that of Saint-Pol-de-Léon.\"\n\nHistory \n\nCornish evolved from the Common Brittonic spoken throughout Britain south of the Firth of Forth during the British Iron Age and Roman period. As a result of westward Anglo-Saxon expansion, the Britons of the southwest were separated from those in modern-day Wales and Cumbria. Some scholars have proposed that this split took place after the Battle of Deorham in about 577. The western dialects eventually evolved into modern Welsh and the now extinct Cumbric, while Southwestern Brittonic developed into Cornish and Breton, the latter as a result of emigration to parts of the continent, known as Brittany over the following centuries.\n\nOld Cornish \n\nThe area controlled by the southwestern Britons was progressively reduced by the expansion of Wessex over the next few centuries. During the Old Cornish period (800–1200), the Cornish-speaking area was largely coterminous with modern-day Cornwall; the region of Devon was isolated by Wessex in 936 AD and many inhabitants fled to Cornwall or Brittany. The earliest written record of the Cornish language comes from this period; a 9th-century gloss in a Latin manuscript of ' by Boethius, which used the words '.  The phrase means \"it [the mind] hated the gloomy places\".Sims-Williams, P. (Winter 2005) \"A New Brittonic Gloss on Boethius: ud rocashaas\", Cambrian Medieval Celtic Studies 50, 77–86. A much more substantial survival from Old Cornish is a Cornish-Latin glossary (the Vocabularium Cornicum or Cottonian Vocabulary) containing translations of around 300 words.Graves, Eugene van T. (ed.) (1964) The Old Cornish Vocabulary. Ann Arbor, Mich: Univ. M/films The manuscript was widely thought to be in Old Welsh until the 1700s when it was identified as Cornish. At this time there was still little difference between Welsh and Cornish, and even fewer differences between Cornish and Breton, with some scholars arguing that the terms \"Old Cornish\" and \"Old Breton\" are merely geographical terms for the same language.\n\nMiddle Cornish \n\nThe Cornish language continued to flourish well through the Middle Cornish period (1200–1600), reaching a peak of about 39,000 speakers in the 13th century, after which the number started to decline.Estimate by Ken George This period provided the bulk of traditional Cornish literature, which was used to reconstruct the language during its revival. Most important is the Ordinalia, a cycle of three mystery plays, Origo Mundi, Passio Christi and Resurrexio Domini.  Together these provide about 20,000 lines of text. Various plays were written by the canons of Glasney College, intended to educate the Cornish people about the Bible and the Celtic saints. From this period also is ' and the recently discovered '.\n\nIn the reign of Henry VIII, an account was given by Andrew Boorde in his 1542 Boke of the Introduction of Knowledge. He states, \"\"Jenner, Henry (1904) A Handbook of the Cornish Language Chiefly in Its Latest Stages with Some Account of Its History and Literature. London: David Nutt\n\nWhen Parliament passed the Act of Uniformity 1549, people in many areas of Cornwall did not speak or understand English. The intention of the Act was to replace worship in Latin with worship in English, which was known by the lawmakers not to be universally spoken throughout England. Instead of merely banning Latin, the Act was framed so as to enforce English. The Prayer Book Rebellion, which may also have been influenced by the retaliation of the English after the failed Cornish Rebellion of 1497, broke out, and was ruthlessly suppressed: over 4,000 people who protested against the imposition of an English prayer book were massacred by Edward VI's army. Their leaders were executed and the people suffered numerous reprisals.\n\nThe rebels' document claimed they wanted a return to the old religious services and ended, \"We the Cornishmen (whereof certain of us understand no English) utterly refuse this new English [altered spelling].\" Edward Seymour, Duke of Somerset, replied to the Cornishmen, inquiring as to why they should be offended by services in English when they had them in Latin, which they also did not understand.\n\nThrough many factors, including loss of life and the spread of English, the Prayer Book Rebellion proved a turning-point for the Cornish language. Indeed, some recent research has suggested that estimates of the Cornish-speaking population prior to the rebellion may have been low, making the decline even more drastic.\n\nPeter Berresford-Ellis cites the years 1550–1650 as a century of immense damage for the language, and its decline can be traced to this period. In 1680, William Scawen wrote an essay describing 16 reasons for the decline of Cornish, among them the lack of a distinctive Cornish alphabet, the loss of contact between Cornwall and Brittany, the cessation of the miracle plays, loss of records in the Civil War, lack of a Cornish bible, and immigration to Cornwall.\n\nEarly Modern Cornish \n\nBy the middle of the 17th century, the language had retreated to Penwith and Kerrier, and transmission of the language to new generations had almost entirely ceased. In his Survey of Cornwall, published in 1602, Richard Carew writes:[M]ost of the inhabitants can speak no word of Cornish, but very few are ignorant of the English; and yet some so affect their own, as to a stranger they will not speak it; for if meeting them by chance, you inquire the way, or any such matter, your answer shall be, \",\" \"I [will] speak no Saxonage.\"\nThe Late Cornish period from 1578 to about 1800 has fewer sources of information on the language but they are more varied in nature.  Written sources from this period are often spelled following English spelling conventions since the majority of writers of the time had had no exposure to Middle Cornish texts or the Cornish orthography within them, although after 1700 some writers began to adopt the orthography used by Edward Lhuyd in his Archaeologia Brittanica, for example using the circumflex to denote long vowels.  In 1776, William Bodinar, who had learnt Cornish from fishermen, wrote a letter in Cornish which was probably the last prose in the language. However, the last verse was the Cranken Rhyme, written in the late 19th century by John Davey of Boswednack.\n\nIn the 18th and 19th centuries, there was academic interest in the language and in attempting to find the last speaker of Cornish. This academic interest, along with the beginning of the Celtic Revival in the late 19th century, provided the groundwork for a Cornish language revival movement.\n\nRecent Modern Cornish \n\nIn 1904, the Celtic language scholar and Cornish cultural activist Henry Jenner published A Handbook of the Cornish Language. The publication of this book is often considered to be the point at which the revival movement started.\n\nThe revival focused on reconstructing and standardising the language, including coining new words for modern concepts, and creating educational material in order to teach Cornish to others. In 1929 Robert Morton Nance published his Unified Cornish system, based on the Middle Cornish literature while extending the attested vocabulary with forms based on Celtic roots also found in Breton and Welsh, publishing a dictionary in 1938. Nance's work became the basis of revived Cornish for most of the 20th century. However, as the revival grew in strength and focus shifted from written to spoken Cornish, Nance's stiff, archaic formulation of the language seemed less suitable for a spoken revival, and academic research into the traditional literature proved that the Unified system lacked some phonological distinctions.\n\nIn the 1980s, in response to dissatisfaction with Unified Cornish, Ken George published a new system,  (\"Common Cornish\"). Like Unified Cornish, it retained a Middle Cornish base but implemented an orthography that aspired to be as phonemic as possible. It was subsequently adopted by the Cornish Language Board as well as by many Cornish speakers, but came under fierce criticism by academic linguists, few having even a nodding acquaintance with Cornish, for its phonological base, as well as those who found its orthography too different from traditional Cornish spelling conventions. Also during this period, Richard Gendall created his Modern Cornish system (also known as \"Revived Late Cornish\"), which used Late Cornish as a basis, and Nicholas Williams published a revised version of Unified; however neither of these systems gained the popularity of Unified or Kemmyn.\n\nThe revival entered a period of factionalism and public disputes, with each orthography attempting to push the others aside. By the time that Cornish was recognised by the UK government under the European Charter for Regional or Minority Languages in 2002, it had become recognised that the existence of multiple orthographies was unsustainable with regards to using the language in education and public life, as none had achieved a wide consensus. A process of unification was set about which resulted in the creation of the public-body Cornish Language Partnership in 2005 and agreement on a Standard Written Form in 2008. In 2010 UNESCO altered its classification of Cornish, stating that its previous label of \"extinct\" was no longer accurate. This was seen by Cornish speakers as a milestone, turning the language from a state of undergoing revival, to having been revived.\n\nThe modern-day Cornish language is a successfully revived language with a number of speakers that is slowly increasing, and is becoming more visible in Cornwall as local government and business are encouraged to make use of the language as part of revitalisation efforts.\n\nGeographic distribution \n\nSpeakers of Cornish reside primarily in Cornwall which has a population of just 536,000 (2014). There are also some speakers living outside Cornwall, particularly in the countries of the Cornish diaspora, as well as other Celtic nations. Estimates of the number of Cornish speakers vary according to the definition of being a speaker, and is difficult to accurately determine due to the individualised nature of language take-up. Nevertheless, there is recognition that the number of Cornish speakers is growing. One figure for the mean number of people who know a few basic words, such as knowing that \"Kernow\" means \"Cornwall\", was 300,000; the same survey gave the figure of people able to have simple conversations at 3,000. The Cornish Language Strategy project commissioned research to provide quantitative and qualitative evidence for the number of Cornish speakers: due to the success of the revival project it was estimated that 2,000 people were fluent (surveyed in spring 2008), an increase from the estimated 300 people who spoke Cornish fluently suggested in a study by Kenneth MacKinnon in 2000.[http://www.gosw.gov.uk/497666/docs/254795/mode_of_use.doc]  In the 2011 UK census, 557 people in England and Wales declared Cornish to be their main language, 464 of whom lived in Cornwall.UK 2011 Census\n\nOfficial status \n\nCornish has no official status anywhere but, since 2002, it has been recognised as a minority language under the European Charter for Regional or Minority Languages. The Cornish Language Partnership promotes and develops the language in Cornwall.\n\nCornwall Council's policy is to support the language. A motion passed in November 2009 approved the council's use of Cornish. The policy notes the \"place of the Cornish language as a unique cultural asset\" and requires the council to promote Cornish in line with the European Charter for Regional or Minority Languages. One effect of the policy is that worn out road signs are replaced by bilingual ones, but this plan has drawn some criticism.\n\nIn October 2015, Cornwall County Council announced that staff would be encouraged to use \"basic words and phrases\" in Cornish when dealing with the public.\nIn 2014 the Cornish people were recognised by the UK Government as a national minority under the Framework Convention for the Protection of National Minorities. The FCNM provides certain rights and protections to a national minority with regard to their minority language.[http://conventions.coe.int/Treaty/en/Treaties/Html/157.htm Framework Convention for the Protection of National Minorities]. Strasbourg, 1 February 1995\n\nUNESCO's Atlas of World Languages classifies Cornish as \"critically endangered\". UNESCO has said that a previous classification of \"extinct\", which came under fierce criticism from Cornish speakers, \"does not reflect the current situation for Cornish\".\n\nIn 2016, national government funding for the Cornish language ceased, and responsibility transferred to Cornwall council.\n\nPhonology \n\nThe phonology of modern Cornish is based on a number of sources. The work of the linguist Edward Lhuyd who visited Cornwall in 1700 to record the language, as well as the modern Cornish dialect and accent of English, which got much of its intonation and sounds from the Cornish language, have provided a major source of input. Analysis of the traditional literature has also been used, as the Middle Cornish plays were often written in rhyming verse, and Late Cornish texts were written phonetically following English spelling conventions.\n\nConsonants \n\nVowels \n\nGrammar \n\nThe grammar of Cornish shares with other Celtic languages a number of features which, while not unique, are unusual in an Indo-European context. The grammatical features most unfamiliar to English speakers of the language are the initial consonant mutations, the verb–subject–object word order, inflected prepositions, fronting of emphasised syntactic elements, and the use of two different forms for \"to be\". Cornish nouns belong to one of two grammatical genders, masculine and feminine, but are not inflected for case. Cornish has a variety of different endings to indicate the plural, and some nouns have a third collective form. Verbs are conjugated for tense and mood, which can be indicated either by inflection of the main verb, or by the use of auxiliary verbs. In Cornish vocabulary, a large number of the lexical items are language and culture specific. Examples of these include the Cornish word ', which means \"mine waste\" and the word ', which means \"to mend fishing nets\". ' and ' are different types of pastry cakes. ' is culture specific when referring to \"a traditional Cornish dance get-together\", while ' is a specific kind of ceremonial dance that takes place in Cornwall.\n\nIn contrast, Cornish translates the English noun, \"book\", as ' (cognate with Welsh ', but ' can actually be translated into English as \"book\" or \"volume\" because it can be considered one in a set of books.\n\nAs in other Celtic languages, Cornish lacks a number of verbs that are commonly found in other languages. This includes modals and psych-verbs; examples \"have\", \"like\", \"hate\", \"prefer\", \"must\"/\"have to\", \"make\"/\"compel to\". These functions are instead fulfilled by periphrastic constructions involving a verb and various prepositional phrases.\n* Initial consonant mutation:  The first sound of a Cornish word may change according to grammatical context. As in Breton, there are four types of mutation in Cornish (compared to three in Welsh, two in Irish and Manx, and one in Scottish Gaelic).  These are known as soft (b > v, etc.), hard (b > p), aspirate (b unchanged, t > th) and mixed (b > f).\n\n* inflected (or conjugated) prepositions:  A preposition combines with a personal pronoun to give a separate word form.  For example, ' (with, by) + ' (me) → '; ' + ' (him) → '.\n* No indefinite article. ' means \"harbour\" or \"a harbour\" (there is, however a definite article: ' means \"the harbour\").\n\nCulture \n\nThe Celtic Congress and Celtic League are groups that advocate cooperation amongst the Celtic Nations in order to protect and promote Celtic languages and cultures, thus working in the interests of the Cornish language.\n\nThere have been films such as ', some televised, made entirely, or significantly, in the language. Some businesses use Cornish names.\n\nAccording to sociolinguist Kenneth MacKinnon, Jenner wrote \"There has never been a time when there has been no person in Cornwall without a knowledge of the Cornish language.\"Rebuilding the Celtic languages By Diarmuid O'Néill (Page 222)In a [http://languagelog.ldc.upenn.edu/nll/?p\n3327 post] on the blog Language Log. Retrieved 2 August 2011, linguist Geoffrey K. Pullum reported that MacKinnon was quoting an edition of Jenner that is no longer available to him (Pullum's main concern was the impact of the triple negative in the cited sentence).\n\nCornish has significantly and durably affected Cornwall's place names, as well as in Cornish surnames, and knowledge of the language helps the understanding of these ancient meanings. Cornish names are adopted for children, pets, houses and boats.\n\nThere is Cornish literature, in which poetry is the most important genre, particularly in oral form or as song or as traditional Cornish chants historically performed in marketplaces during religious holidays and public festivals and gatherings.\n\nThere are periodicals solely in the language such as the monthly ', ', and '. BBC Radio Cornwall has a news broadcast in Cornish, and sometimes has other programmes and features for learners and enthusiasts. Local newspapers such as the Western Morning News have articles in Cornish, and newspapers such as The Packet, The West Briton and The Cornishman have also been known to have Cornish features. There is an online radio service in Cornish called , publishing a one-hour podcast each week, based on a magazine format. It includes music in Cornish as well as interviews and features.\n\nThe language has financial sponsorship from sources, including the Millennium Commission. A number of language organisations exist in Cornwall:  (Our Language), the Cornish sub-group of the European Bureau for Lesser-Used Languages, ,  (the Cornish Language Board) and  (the Cornish Language Fellowship)]. There are ceremonies, some ancient, some modern, which use the language or are entirely in the language.\n\nCultural events \n\nThough estimations of the number of Cornish speakers vary, the speakers of Cornish today are thought to be around five hundred. Currently, Cornish is spoken by its speakers at home, outside the home, in the workplace, and at ritual ceremonies. Cornish is also being used in the arts. Revived Cornish is constructed on historical Cornish, so that the Cornish language develops. English language has had some effect in this development. Regardless of having \"no concrete purpose during the twentieth century,\" the number of Cornish speakers has gradually increased.\n\nThe Celtic Congress and Celtic League are groups that advocate cooperation amongst the Celtic Nations in order to protect and promote Celtic languages and cultures, thus working in the interests of the Cornish language. Cornish has significantly and durably affected Cornwall's place names, as well as in Cornish surnames, and knowledge of the language helps the understanding of these ancient meanings. Cornish names are adopted for children, pets, houses and boats. There are periodicals solely in the language such as the monthly An Gannas, An Gowsva, and An Garrick. BBC Radio Cornwall has a news broadcast in Cornish, and sometimes has other programmes and features for learners and enthusiasts. Local newspapers such as the Western Morning News have articles in Cornish, and newspapers such as The Packet, The West Briton and The Cornishman have also been known to have Cornish features. The language has financial sponsorship from sources, including the Millennium Commission. A number of language organisations exist in Cornwall: Agan Tavas (Our Language), the Cornish sub-group of the European Bureau for Lesser-Used Languages, Gorsedh Kernow, Kesva an Taves Kernewek (the Cornish Language Board) and Kowethas an Yeth Kernewek (the Cornish Language Fellowship)].\n\nCornwall has had cultural events associated with the language, including the international Celtic Media Festival, hosted in St Ives in 1997.  The Old Cornwall Society has promoted the use of the language at events and meetings. Two examples of ceremonies that are performed in both the English and Cornish languages are Crying the Neck and the annual mid-summer bonfires.\n\nStudy and teaching \n\nCornish is taught in some schools; it was previously taught at degree level at the University of Wales, though the only existing course in the language at University level is as part of a course in Cornish Studies at the University of Exeter. In March 2008, a course in the language was started as part of the Celtic Studies curriculum at the University of Vienna, Austria.\nThe University of Cambridge offers courses in Cornish through its John Trim Resources Centre, which is part of its Language Centre. In addition, the Department of Anglo-Saxon, Norse and Celtic (which is part of the faculty of English), also carries out research into the Cornish language.\n\nIn 2015 a university level course aiming to encourage and support practitioners working with young children to introduce the Cornish language into their settings was launched. The Cornish Language Practice Project (Early Years) is a level 4 course approved by Plymouth University and run at Cornwall College. The course is not a Cornish language course, but students will be assessed on their ability to use the Cornish language constructively in their work with young children. The course will cover such topics as Understanding Bilingualism, Creating Resources and Integrating Language and Play, but the focus of the language provision will be on Cornish. A non-accredited specialist Cornish language course has been developed to run alongside the level 4 course for those who prefer tutor support to learn the language or develop their skills further for use with young children.\n\nCornwall's first Cornish language crèche, ', was established in 2010 at Cornwall College, Camborne. The nursery teaches children aged between two and five years alongside their parents to ensure the language is also spoken in the home.\n\nA number of dictionaries are available in the different orthographies (a dictionary in the Standard Written Form has yet to be published), including ' by Ken George, ' by Nicholas Williams and A Practical Dictionary of Modern Cornish by Richard Gendall. Course books include the three-part ' series, ', ' and ', as well as the more recent ' and '.\n\nClasses and conversation groups for adults are available at several locations in Cornwall, as well as in London, Cardiff and Bristol.\n\nCornish studies \n\nWilliam Scawen produced a manuscript on the declining Cornish language that continually evolved until he died in 1689, aged 89. He was the first person to realise the language was dying out and wrote detailed manuscripts which he started working on when he was 78. The only version that was ever published was a short first draft, but the final version, which he worked on until his death, is a few hundred pages long. At the same time a group of scholars, led by John Keigwin (nephew of William Scawen), of Mousehole, tried to preserve and further the Cornish language. They left behind a large number of translations of parts of the Bible, proverbs and songs. This group was contacted by the Welsh linguist Edward Lhuyd who came to Cornwall to study the language.Ellis, P. B. (1974); pp. 82–94Lhuyd, Edward (1707) Archæologia Britannica: giving some account additional to what has been hitherto publish'd, of the languages, histories and customs of the original inhabitants of Great Britain, from collections and observations in travels through Wales, Cornwal, Bas-Bretagne, Ireland, and Scotland; Vol. I. Glossography. Oxford: printed at the Theater for the author, and sold by Mr. Bateman, LondonEllis, P. B. (1974); pp. 100–08Lhuyd, Edward (1702) [Elegy on the death of King William III, in Cornish verse] in: Pietas Universitatis Oxoniensis in obitum augustissimi Regis Gulielmi III; et gratulatio in exoptatissimam serenissimae Annæ Reginæ inaugurationem. Oxonii: e Theatro Sheldoniano\n\nEarly Modern Cornish was the subject of a study published by Lhuyd in 1707, and differs from the medieval language in having a considerably simpler structure and grammar. Such differences included the wide use of certain modal affixes that, although out of use by Lhuyd's time, had a considerable effect on the word-order of medieval Cornish. The medieval language also possessed two additional tenses for expressing past events and an extended set of possessive suffixes.\n\nJohn Whitaker, the Manchester-born rector of Ruan Lanihorne, studied the decline of the Cornish language. In his 1804 work the Ancient Cathedral of Cornwall he concluded that: \"[T]he English Liturgy, was not desired by the Cornish, but forced upon them by the tyranny of England, at a time when the English language was yet unknown in Cornwall. This act of tyranny was at once gross barbarity to the Cornish people, and a death blow to the Cornish language.\".Jago, Fred W. P. (1882) The Ancient Language and the Dialect of Cornwall. New York: AMS Press, 1983, (originally published 1882, Netherton and Worth, Truro), pp. 4 ff.\n\nRobert Williams published the first comprehensive Cornish dictionary in 1865, the Lexicon Cornu-Britannicum. As a result of the discovery of additional ancient Cornish manuscripts, 2000 new words were added to the vocabulary by Whitley Stokes in A Cornish Glossary. William C. Borlase published Proverbs and Rhymes in Cornish in 1866 while A Glossary of Cornish Place Names was produced by John Bannister in the same year. Frederick Jago published his English–Cornish Dictionary in 1882.\n\nIn 2002, the Cornish language gained new recognition because of the European Charter for Regional and Minority Languages. Conversely, along with government provision was the governmental basis of \"New Public Management,\" measuring quantifiable results as means of determining effectiveness. This put enormous pressure on finding a single orthography that could be used in unison. The revival of Cornish required extensive rebuilding. The Cornish orthographies that were reconstructed may be considered versions of Cornish because they are not traditional sociolinguistic variations. In the middle-to-late twentieth century, the debate over Cornish orthographies angered more people because several language groups received public funding. This caused other groups to sense favouritism as playing a role in the debate.\n\nA governmental policymaking structure called New Public Management (NPM) has helped the Cornish language by managing public life of the Cornish language and people. In 2007, the Cornish Language Partnership MAGA represents separate divisions of government and their purpose is to further enhance the Cornish Language Developmental Plan. MAGA established an \"Ad-Hoc Group,\" which resulted in three orthographies being presented. The relations for the Ad-Hoc Group were to obtain consensus among the three orthographies, and then develop a \"single written form.\" The end result was creating a new form of Cornish, which had to be natural for both new learners and skilled speakers.\n\nLiterature \n\nNeo-Cornish literature \n\nIn 1981, the Breton library ' edited ' (Passion of our lord), a 15th-century Cornish poem. The first complete translation of the Bible into Cornish translated from English, was published in 2011.  Another Bible translation project translating from original languages is underway.  The New Testament and Psalms were posted on-line on YouVersion (Bible.com) and Bibles.org in July 2014 by the Bible Society.\n\nA few small publishers produce books in Cornish which are stocked in some local bookshops, as well as in Cornish branches of Waterstones and WH Smiths, although newer publications are becoming increasingly available on the Internet. The Truro Waterstones hosts the annual \"\" literary awards, established by  to recognise publications relating to Cornwall or in the Cornish language. In recent years, a number of Cornish translations of literature has been published, including Alice's Adventures in Wonderland (2009), Around the World in Eighty Days (2009), Treasure Island (2010),  The Railway Children (2012), Hound of the Baskervilles (2012), The War of the Worlds (2012), The Wind in the Willows (2013), Three Men in a Boat (2013), Alice in Wonderland and Through the Looking-Glass (2014), and A Christmas Carol (which won the 2012  award for Cornish Language books), as well as original Cornish literature such as ' (The Lyonesse Stone) by Craig Weatherhill. Literature aimed at children is also available, such as ' (Where's Spot?), ' (The Beast of Bodmin Moor), three Topsy and Tim titles,,two Tintin titles and ' (Briallen and the Alien), which won the 2015  award for Cornish Language books for children. In 2014 ', Nicholas Williams' translation of J.R.R. Tolkien's The Hobbit was published.\n\nAn Gannas is a monthly magazine published entirely in the Cornish language. Members contribute articles on various subjects. The magazine is produced by Graham Sandercock who has been its editor since 1976.\n\nMedia \n\nIn 1983 BBC Radio Cornwall started broadcasting around two minutes of Cornish every week. In 1987, however, they gave over 15 minutes of airtime on Sunday mornings for a programme called ' (\"Holdall\"), presented by John King, running until the early 1990s.Martin Ball, Nicole Muller, The Celtic Languages, Psychology Press, 12 Nov 2012 It was eventually replaced with a five-minute news bulletin called ' (\"The News\"). The bulletin was presented every Sunday evening for many years by Rod Lyon, then Elizabeth Stewart, and currently a team presents in rotation. Pirate FM ran short bulletins on Saturday lunchtimes from 1998 to 1999. In 2006, Matthew Clarke who had presented the Pirate FM bulletin, launched a web-streamed news bulletin called ' (\"Weekly News\"), which in 2008 was merged into a new weekly magazine podcast ' (RanG).\n\nCornish television shows have included a 1982 series by Westward Television each episode containing a three-minute lesson in Cornish.Martin Ball, Nicole Muller ', an eight episode series produced by Television South West and broadcast between June and July 1984, later on S4C from May to July 1985, and as a schools programme in 1986. Also by Television South West were two bilingual programmes on Cornish Culture called '\nIn 2016 Kelly's Ice Cream of Bodmin introduced a light hearted television commercial in the Cornish language and this has been repeated in 2017.\n\nMusic \n\nEnglish composer Peter Warlock, an enthusiast of the Celtic languages, wrote a Christmas carol in Cornish (setting words by Henry Jenner). Cornish musician Jory Bennett (born Redruth, 1963) has composed \"Six Songs of Cornwall\" for bass and piano, a Cornish song-cycle, settings of Cornish language poems by Nicholas Williams /trans. E. G. Retallack Hooper (f.p. Keele University, 7 May 1986).  The Cornish electronic musician Richard D James has often used Cornish names for track titles, most notably on his DrukQs album. Gwenno Saunders is a multilingual Welsh-born musician and a Cornish speaker. Skwardya has produced four CD albums in Cornish in a modern pop/rock/blues/dance style.\n\nA number of traditional Cornish folk songs have been preserved, including \"An Awhesyth\", \"Bro Goth agan Tasow\", and \"Delkiow Sivy\".\n\nPlacenames and surnames \n\nThe Cornish language has influenced the toponomy of Cornwall, and has historically been used in surnames for the Cornish people. Long before the agreement of the  Standard Written Form of Cornish in the 21st century, Late Cornish orthography in the Early Modern period usually followed Welsh to English transliteration so phonetically rendering C for K, I for Y, U for W, and Z for S, caused place names such as Porthcurno and Penzance to be adopted into English instead of their Standard Written Form Porth Kernow and Pen Sans. Likewise, words such as Enys (\"island\") can be found spelled as \"Ince\" as at Ince Castle. These apparent mistranslations can however reveal an insight into how names and places were actually pronounced, explaining, for example, how anglicised Launceston is still pronounced \"Lann-zan\" from Cornish \"Lann Stefan\" with emphasis on the first element.\n\nThe following tables present some examples of Cornish placenames and surnames, and their anglicised versions:\n\nSamples \n\nFrom the Universal Declaration of Human Rights:\n\nFrom ', the Cornish anthem:",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Cornish language" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6130" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Cornish (') is a Southwestern Brittonic Celtic language native to Cornwall. The language began a revival in the early 20th century and is considered to be an important part of Cornish identity, culture and heritage. Cornish is currently a recognised minority language of the United Kingdom, protected under the European Charter for Regional or Minority Languages, and has a growing number of second language speakers and a small number of first language speakers.\n\nAlong with Welsh and Breton, Cornish is descended directly from the Common Brittonic language spoken throughout much of Britain before the English language came to dominate. It was the main language of Cornwall for centuries until it was pushed westwards by English, maintaining close links with its sister language Breton with which it was mutually intelligible until well into the Middle Ages. Cornish continued to function as a common community language in parts of Cornwall until the late 18th century, and continued to be spoken in the home by some families into the 19th and possibly 20th centuries, overlapping the beginning of revival efforts. A process to revive the language was begun in the early 20th century, with a number of orthographical systems still in use, although an attempt was made to impose a Standard Written Form in 2008. In 2010 UNESCO announced that its former classification of the language as \"extinct\" was \"no longer accurate\".\n\nSince the revival of the language, some Cornish textbooks and works of literature have been published and an increasing number of people are studying the language. Recent developments include Cornish music,[http://www.magakernow.org.uk/index.aspx?articleid\n38589]  independent films,[http://www.magakernow.org.uk/index.aspx?articleid38588]  and children's books. A small number of people in Cornwall have been brought up to be bilingual native speakers,Ken MacKinnon, Cornish Language Study 2000 – http://www.magakernow.org.uk/default.aspx?page797 and the language is taught in many schools. The first Cornish language crèche opened in 2010.\n\nClassification \n\nCornish is one of the Brittonic languages, which constitute a branch of the Insular Celtic section of the Celtic language family. Brittonic also includes Welsh, Breton and the Cumbric language; the last is extinct. Scottish Gaelic, Irish and Manx are part of the separate Goidelic branch of Insular Celtic.\n\nJoseph Loth viewed Cornish and Breton as being two dialects of the same language, claiming that \"Middle Cornish is without doubt closer to Breton as a whole than the modern Breton dialect of Quiberon is to that of Saint-Pol-de-Léon.\"\n\nHistory \n\nCornish evolved from the Common Brittonic spoken throughout Britain south of the Firth of Forth during the British Iron Age and Roman period. As a result of westward Anglo-Saxon expansion, the Britons of the southwest were separated from those in modern-day Wales and Cumbria. Some scholars have proposed that this split took place after the Battle of Deorham in about 577. The western dialects eventually evolved into modern Welsh and the now extinct Cumbric, while Southwestern Brittonic developed into Cornish and Breton, the latter as a result of emigration to parts of the continent, known as Brittany over the following centuries.\n\nOld Cornish \n\nThe area controlled by the southwestern Britons was progressively reduced by the expansion of Wessex over the next few centuries. During the Old Cornish period (800–1200), the Cornish-speaking area was largely coterminous with modern-day Cornwall; the region of Devon was isolated by Wessex in 936 AD and many inhabitants fled to Cornwall or Brittany. The earliest written record of the Cornish language comes from this period; a 9th-century gloss in a Latin manuscript of ' by Boethius, which used the words '.  The phrase means \"it [the mind] hated the gloomy places\".Sims-Williams, P. (Winter 2005) \"A New Brittonic Gloss on Boethius: ud rocashaas\", Cambrian Medieval Celtic Studies 50, 77–86. A much more substantial survival from Old Cornish is a Cornish-Latin glossary (the Vocabularium Cornicum or Cottonian Vocabulary) containing translations of around 300 words.Graves, Eugene van T. (ed.) (1964) The Old Cornish Vocabulary. Ann Arbor, Mich: Univ. M/films The manuscript was widely thought to be in Old Welsh until the 1700s when it was identified as Cornish. At this time there was still little difference between Welsh and Cornish, and even fewer differences between Cornish and Breton, with some scholars arguing that the terms \"Old Cornish\" and \"Old Breton\" are merely geographical terms for the same language.\n\nMiddle Cornish \n\nThe Cornish language continued to flourish well through the Middle Cornish period (1200–1600), reaching a peak of about 39,000 speakers in the 13th century, after which the number started to decline.Estimate by Ken George This period provided the bulk of traditional Cornish literature, which was used to reconstruct the language during its revival. Most important is the Ordinalia, a cycle of three mystery plays, Origo Mundi, Passio Christi and Resurrexio Domini.  Together these provide about 20,000 lines of text. Various plays were written by the canons of Glasney College, intended to educate the Cornish people about the Bible and the Celtic saints. From this period also is ' and the recently discovered '.\n\nIn the reign of Henry VIII, an account was given by Andrew Boorde in his 1542 Boke of the Introduction of Knowledge. He states, \"\"Jenner, Henry (1904) A Handbook of the Cornish Language Chiefly in Its Latest Stages with Some Account of Its History and Literature. London: David Nutt\n\nWhen Parliament passed the Act of Uniformity 1549, people in many areas of Cornwall did not speak or understand English. The intention of the Act was to replace worship in Latin with worship in English, which was known by the lawmakers not to be universally spoken throughout England. Instead of merely banning Latin, the Act was framed so as to enforce English. The Prayer Book Rebellion, which may also have been influenced by the retaliation of the English after the failed Cornish Rebellion of 1497, broke out, and was ruthlessly suppressed: over 4,000 people who protested against the imposition of an English prayer book were massacred by Edward VI's army. Their leaders were executed and the people suffered numerous reprisals.\n\nThe rebels' document claimed they wanted a return to the old religious services and ended, \"We the Cornishmen (whereof certain of us understand no English) utterly refuse this new English [altered spelling].\" Edward Seymour, Duke of Somerset, replied to the Cornishmen, inquiring as to why they should be offended by services in English when they had them in Latin, which they also did not understand.\n\nThrough many factors, including loss of life and the spread of English, the Prayer Book Rebellion proved a turning-point for the Cornish language. Indeed, some recent research has suggested that estimates of the Cornish-speaking population prior to the rebellion may have been low, making the decline even more drastic.\n\nPeter Berresford-Ellis cites the years 1550–1650 as a century of immense damage for the language, and its decline can be traced to this period. In 1680, William Scawen wrote an essay describing 16 reasons for the decline of Cornish, among them the lack of a distinctive Cornish alphabet, the loss of contact between Cornwall and Brittany, the cessation of the miracle plays, loss of records in the Civil War, lack of a Cornish bible, and immigration to Cornwall.\n\nEarly Modern Cornish \n\nBy the middle of the 17th century, the language had retreated to Penwith and Kerrier, and transmission of the language to new generations had almost entirely ceased. In his Survey of Cornwall, published in 1602, Richard Carew writes:[M]ost of the inhabitants can speak no word of Cornish, but very few are ignorant of the English; and yet some so affect their own, as to a stranger they will not speak it; for if meeting them by chance, you inquire the way, or any such matter, your answer shall be, \",\" \"I [will] speak no Saxonage.\"\nThe Late Cornish period from 1578 to about 1800 has fewer sources of information on the language but they are more varied in nature.  Written sources from this period are often spelled following English spelling conventions since the majority of writers of the time had had no exposure to Middle Cornish texts or the Cornish orthography within them, although after 1700 some writers began to adopt the orthography used by Edward Lhuyd in his Archaeologia Brittanica, for example using the circumflex to denote long vowels.  In 1776, William Bodinar, who had learnt Cornish from fishermen, wrote a letter in Cornish which was probably the last prose in the language. However, the last verse was the Cranken Rhyme, written in the late 19th century by John Davey of Boswednack.\n\nIn the 18th and 19th centuries, there was academic interest in the language and in attempting to find the last speaker of Cornish. This academic interest, along with the beginning of the Celtic Revival in the late 19th century, provided the groundwork for a Cornish language revival movement.\n\nRecent Modern Cornish \n\nIn 1904, the Celtic language scholar and Cornish cultural activist Henry Jenner published A Handbook of the Cornish Language. The publication of this book is often considered to be the point at which the revival movement started.\n\nThe revival focused on reconstructing and standardising the language, including coining new words for modern concepts, and creating educational material in order to teach Cornish to others. In 1929 Robert Morton Nance published his Unified Cornish system, based on the Middle Cornish literature while extending the attested vocabulary with forms based on Celtic roots also found in Breton and Welsh, publishing a dictionary in 1938. Nance's work became the basis of revived Cornish for most of the 20th century. However, as the revival grew in strength and focus shifted from written to spoken Cornish, Nance's stiff, archaic formulation of the language seemed less suitable for a spoken revival, and academic research into the traditional literature proved that the Unified system lacked some phonological distinctions.\n\nIn the 1980s, in response to dissatisfaction with Unified Cornish, Ken George published a new system,  (\"Common Cornish\"). Like Unified Cornish, it retained a Middle Cornish base but implemented an orthography that aspired to be as phonemic as possible. It was subsequently adopted by the Cornish Language Board as well as by many Cornish speakers, but came under fierce criticism by academic linguists, few having even a nodding acquaintance with Cornish, for its phonological base, as well as those who found its orthography too different from traditional Cornish spelling conventions. Also during this period, Richard Gendall created his Modern Cornish system (also known as \"Revived Late Cornish\"), which used Late Cornish as a basis, and Nicholas Williams published a revised version of Unified; however neither of these systems gained the popularity of Unified or Kemmyn.\n\nThe revival entered a period of factionalism and public disputes, with each orthography attempting to push the others aside. By the time that Cornish was recognised by the UK government under the European Charter for Regional or Minority Languages in 2002, it had become recognised that the existence of multiple orthographies was unsustainable with regards to using the language in education and public life, as none had achieved a wide consensus. A process of unification was set about which resulted in the creation of the public-body Cornish Language Partnership in 2005 and agreement on a Standard Written Form in 2008. In 2010 UNESCO altered its classification of Cornish, stating that its previous label of \"extinct\" was no longer accurate. This was seen by Cornish speakers as a milestone, turning the language from a state of undergoing revival, to having been revived.\n\nThe modern-day Cornish language is a successfully revived language with a number of speakers that is slowly increasing, and is becoming more visible in Cornwall as local government and business are encouraged to make use of the language as part of revitalisation efforts.\n\nGeographic distribution \n\nSpeakers of Cornish reside primarily in Cornwall which has a population of just 536,000 (2014). There are also some speakers living outside Cornwall, particularly in the countries of the Cornish diaspora, as well as other Celtic nations. Estimates of the number of Cornish speakers vary according to the definition of being a speaker, and is difficult to accurately determine due to the individualised nature of language take-up. Nevertheless, there is recognition that the number of Cornish speakers is growing. One figure for the mean number of people who know a few basic words, such as knowing that \"Kernow\" means \"Cornwall\", was 300,000; the same survey gave the figure of people able to have simple conversations at 3,000. The Cornish Language Strategy project commissioned research to provide quantitative and qualitative evidence for the number of Cornish speakers: due to the success of the revival project it was estimated that 2,000 people were fluent (surveyed in spring 2008), an increase from the estimated 300 people who spoke Cornish fluently suggested in a study by Kenneth MacKinnon in 2000.[http://www.gosw.gov.uk/497666/docs/254795/mode_of_use.doc]  In the 2011 UK census, 557 people in England and Wales declared Cornish to be their main language, 464 of whom lived in Cornwall.UK 2011 Census\n\nOfficial status \n\nCornish has no official status anywhere but, since 2002, it has been recognised as a minority language under the European Charter for Regional or Minority Languages. The Cornish Language Partnership promotes and develops the language in Cornwall.\n\nCornwall Council's policy is to support the language. A motion passed in November 2009 approved the council's use of Cornish. The policy notes the \"place of the Cornish language as a unique cultural asset\" and requires the council to promote Cornish in line with the European Charter for Regional or Minority Languages. One effect of the policy is that worn out road signs are replaced by bilingual ones, but this plan has drawn some criticism.\n\nIn October 2015, Cornwall County Council announced that staff would be encouraged to use \"basic words and phrases\" in Cornish when dealing with the public.\nIn 2014 the Cornish people were recognised by the UK Government as a national minority under the Framework Convention for the Protection of National Minorities. The FCNM provides certain rights and protections to a national minority with regard to their minority language.[http://conventions.coe.int/Treaty/en/Treaties/Html/157.htm Framework Convention for the Protection of National Minorities]. Strasbourg, 1 February 1995\n\nUNESCO's Atlas of World Languages classifies Cornish as \"critically endangered\". UNESCO has said that a previous classification of \"extinct\", which came under fierce criticism from Cornish speakers, \"does not reflect the current situation for Cornish\".\n\nIn 2016, national government funding for the Cornish language ceased, and responsibility transferred to Cornwall council.\n\nPhonology \n\nThe phonology of modern Cornish is based on a number of sources. The work of the linguist Edward Lhuyd who visited Cornwall in 1700 to record the language, as well as the modern Cornish dialect and accent of English, which got much of its intonation and sounds from the Cornish language, have provided a major source of input. Analysis of the traditional literature has also been used, as the Middle Cornish plays were often written in rhyming verse, and Late Cornish texts were written phonetically following English spelling conventions.\n\nConsonants \n\nVowels \n\nGrammar \n\nThe grammar of Cornish shares with other Celtic languages a number of features which, while not unique, are unusual in an Indo-European context. The grammatical features most unfamiliar to English speakers of the language are the initial consonant mutations, the verb–subject–object word order, inflected prepositions, fronting of emphasised syntactic elements, and the use of two different forms for \"to be\". Cornish nouns belong to one of two grammatical genders, masculine and feminine, but are not inflected for case. Cornish has a variety of different endings to indicate the plural, and some nouns have a third collective form. Verbs are conjugated for tense and mood, which can be indicated either by inflection of the main verb, or by the use of auxiliary verbs. In Cornish vocabulary, a large number of the lexical items are language and culture specific. Examples of these include the Cornish word ', which means \"mine waste\" and the word ', which means \"to mend fishing nets\". ' and ' are different types of pastry cakes. ' is culture specific when referring to \"a traditional Cornish dance get-together\", while ' is a specific kind of ceremonial dance that takes place in Cornwall.\n\nIn contrast, Cornish translates the English noun, \"book\", as ' (cognate with Welsh ', but ' can actually be translated into English as \"book\" or \"volume\" because it can be considered one in a set of books.\n\nAs in other Celtic languages, Cornish lacks a number of verbs that are commonly found in other languages. This includes modals and psych-verbs; examples \"have\", \"like\", \"hate\", \"prefer\", \"must\"/\"have to\", \"make\"/\"compel to\". These functions are instead fulfilled by periphrastic constructions involving a verb and various prepositional phrases.\n* Initial consonant mutation:  The first sound of a Cornish word may change according to grammatical context. As in Breton, there are four types of mutation in Cornish (compared to three in Welsh, two in Irish and Manx, and one in Scottish Gaelic).  These are known as soft (b > v, etc.), hard (b > p), aspirate (b unchanged, t > th) and mixed (b > f).\n\n* inflected (or conjugated) prepositions:  A preposition combines with a personal pronoun to give a separate word form.  For example, ' (with, by) + ' (me) → '; ' + ' (him) → '.\n* No indefinite article. ' means \"harbour\" or \"a harbour\" (there is, however a definite article: ' means \"the harbour\").\n\nCulture \n\nThe Celtic Congress and Celtic League are groups that advocate cooperation amongst the Celtic Nations in order to protect and promote Celtic languages and cultures, thus working in the interests of the Cornish language.\n\nThere have been films such as ', some televised, made entirely, or significantly, in the language. Some businesses use Cornish names.\n\nAccording to sociolinguist Kenneth MacKinnon, Jenner wrote \"There has never been a time when there has been no person in Cornwall without a knowledge of the Cornish language.\"Rebuilding the Celtic languages By Diarmuid O'Néill (Page 222)In a [http://languagelog.ldc.upenn.edu/nll/?p\n3327 post] on the blog Language Log. Retrieved 2 August 2011, linguist Geoffrey K. Pullum reported that MacKinnon was quoting an edition of Jenner that is no longer available to him (Pullum's main concern was the impact of the triple negative in the cited sentence).\n\nCornish has significantly and durably affected Cornwall's place names, as well as in Cornish surnames, and knowledge of the language helps the understanding of these ancient meanings. Cornish names are adopted for children, pets, houses and boats.\n\nThere is Cornish literature, in which poetry is the most important genre, particularly in oral form or as song or as traditional Cornish chants historically performed in marketplaces during religious holidays and public festivals and gatherings.\n\nThere are periodicals solely in the language such as the monthly ', ', and '. BBC Radio Cornwall has a news broadcast in Cornish, and sometimes has other programmes and features for learners and enthusiasts. Local newspapers such as the Western Morning News have articles in Cornish, and newspapers such as The Packet, The West Briton and The Cornishman have also been known to have Cornish features. There is an online radio service in Cornish called , publishing a one-hour podcast each week, based on a magazine format. It includes music in Cornish as well as interviews and features.\n\nThe language has financial sponsorship from sources, including the Millennium Commission. A number of language organisations exist in Cornwall:  (Our Language), the Cornish sub-group of the European Bureau for Lesser-Used Languages, ,  (the Cornish Language Board) and  (the Cornish Language Fellowship)]. There are ceremonies, some ancient, some modern, which use the language or are entirely in the language.\n\nCultural events \n\nThough estimations of the number of Cornish speakers vary, the speakers of Cornish today are thought to be around five hundred. Currently, Cornish is spoken by its speakers at home, outside the home, in the workplace, and at ritual ceremonies. Cornish is also being used in the arts. Revived Cornish is constructed on historical Cornish, so that the Cornish language develops. English language has had some effect in this development. Regardless of having \"no concrete purpose during the twentieth century,\" the number of Cornish speakers has gradually increased.\n\nThe Celtic Congress and Celtic League are groups that advocate cooperation amongst the Celtic Nations in order to protect and promote Celtic languages and cultures, thus working in the interests of the Cornish language. Cornish has significantly and durably affected Cornwall's place names, as well as in Cornish surnames, and knowledge of the language helps the understanding of these ancient meanings. Cornish names are adopted for children, pets, houses and boats. There are periodicals solely in the language such as the monthly An Gannas, An Gowsva, and An Garrick. BBC Radio Cornwall has a news broadcast in Cornish, and sometimes has other programmes and features for learners and enthusiasts. Local newspapers such as the Western Morning News have articles in Cornish, and newspapers such as The Packet, The West Briton and The Cornishman have also been known to have Cornish features. The language has financial sponsorship from sources, including the Millennium Commission. A number of language organisations exist in Cornwall: Agan Tavas (Our Language), the Cornish sub-group of the European Bureau for Lesser-Used Languages, Gorsedh Kernow, Kesva an Taves Kernewek (the Cornish Language Board) and Kowethas an Yeth Kernewek (the Cornish Language Fellowship)].\n\nCornwall has had cultural events associated with the language, including the international Celtic Media Festival, hosted in St Ives in 1997.  The Old Cornwall Society has promoted the use of the language at events and meetings. Two examples of ceremonies that are performed in both the English and Cornish languages are Crying the Neck and the annual mid-summer bonfires.\n\nStudy and teaching \n\nCornish is taught in some schools; it was previously taught at degree level at the University of Wales, though the only existing course in the language at University level is as part of a course in Cornish Studies at the University of Exeter. In March 2008, a course in the language was started as part of the Celtic Studies curriculum at the University of Vienna, Austria.\nThe University of Cambridge offers courses in Cornish through its John Trim Resources Centre, which is part of its Language Centre. In addition, the Department of Anglo-Saxon, Norse and Celtic (which is part of the faculty of English), also carries out research into the Cornish language.\n\nIn 2015 a university level course aiming to encourage and support practitioners working with young children to introduce the Cornish language into their settings was launched. The Cornish Language Practice Project (Early Years) is a level 4 course approved by Plymouth University and run at Cornwall College. The course is not a Cornish language course, but students will be assessed on their ability to use the Cornish language constructively in their work with young children. The course will cover such topics as Understanding Bilingualism, Creating Resources and Integrating Language and Play, but the focus of the language provision will be on Cornish. A non-accredited specialist Cornish language course has been developed to run alongside the level 4 course for those who prefer tutor support to learn the language or develop their skills further for use with young children.\n\nCornwall's first Cornish language crèche, ', was established in 2010 at Cornwall College, Camborne. The nursery teaches children aged between two and five years alongside their parents to ensure the language is also spoken in the home.\n\nA number of dictionaries are available in the different orthographies (a dictionary in the Standard Written Form has yet to be published), including ' by Ken George, ' by Nicholas Williams and A Practical Dictionary of Modern Cornish by Richard Gendall. Course books include the three-part ' series, ', ' and ', as well as the more recent ' and '.\n\nClasses and conversation groups for adults are available at several locations in Cornwall, as well as in London, Cardiff and Bristol.\n\nCornish studies \n\nWilliam Scawen produced a manuscript on the declining Cornish language that continually evolved until he died in 1689, aged 89. He was the first person to realise the language was dying out and wrote detailed manuscripts which he started working on when he was 78. The only version that was ever published was a short first draft, but the final version, which he worked on until his death, is a few hundred pages long. At the same time a group of scholars, led by John Keigwin (nephew of William Scawen), of Mousehole, tried to preserve and further the Cornish language. They left behind a large number of translations of parts of the Bible, proverbs and songs. This group was contacted by the Welsh linguist Edward Lhuyd who came to Cornwall to study the language.Ellis, P. B. (1974); pp. 82–94Lhuyd, Edward (1707) Archæologia Britannica: giving some account additional to what has been hitherto publish'd, of the languages, histories and customs of the original inhabitants of Great Britain, from collections and observations in travels through Wales, Cornwal, Bas-Bretagne, Ireland, and Scotland; Vol. I. Glossography. Oxford: printed at the Theater for the author, and sold by Mr. Bateman, LondonEllis, P. B. (1974); pp. 100–08Lhuyd, Edward (1702) [Elegy on the death of King William III, in Cornish verse] in: Pietas Universitatis Oxoniensis in obitum augustissimi Regis Gulielmi III; et gratulatio in exoptatissimam serenissimae Annæ Reginæ inaugurationem. Oxonii: e Theatro Sheldoniano\n\nEarly Modern Cornish was the subject of a study published by Lhuyd in 1707, and differs from the medieval language in having a considerably simpler structure and grammar. Such differences included the wide use of certain modal affixes that, although out of use by Lhuyd's time, had a considerable effect on the word-order of medieval Cornish. The medieval language also possessed two additional tenses for expressing past events and an extended set of possessive suffixes.\n\nJohn Whitaker, the Manchester-born rector of Ruan Lanihorne, studied the decline of the Cornish language. In his 1804 work the Ancient Cathedral of Cornwall he concluded that: \"[T]he English Liturgy, was not desired by the Cornish, but forced upon them by the tyranny of England, at a time when the English language was yet unknown in Cornwall. This act of tyranny was at once gross barbarity to the Cornish people, and a death blow to the Cornish language.\".Jago, Fred W. P. (1882) The Ancient Language and the Dialect of Cornwall. New York: AMS Press, 1983, (originally published 1882, Netherton and Worth, Truro), pp. 4 ff.\n\nRobert Williams published the first comprehensive Cornish dictionary in 1865, the Lexicon Cornu-Britannicum. As a result of the discovery of additional ancient Cornish manuscripts, 2000 new words were added to the vocabulary by Whitley Stokes in A Cornish Glossary. William C. Borlase published Proverbs and Rhymes in Cornish in 1866 while A Glossary of Cornish Place Names was produced by John Bannister in the same year. Frederick Jago published his English–Cornish Dictionary in 1882.\n\nIn 2002, the Cornish language gained new recognition because of the European Charter for Regional and Minority Languages. Conversely, along with government provision was the governmental basis of \"New Public Management,\" measuring quantifiable results as means of determining effectiveness. This put enormous pressure on finding a single orthography that could be used in unison. The revival of Cornish required extensive rebuilding. The Cornish orthographies that were reconstructed may be considered versions of Cornish because they are not traditional sociolinguistic variations. In the middle-to-late twentieth century, the debate over Cornish orthographies angered more people because several language groups received public funding. This caused other groups to sense favouritism as playing a role in the debate.\n\nA governmental policymaking structure called New Public Management (NPM) has helped the Cornish language by managing public life of the Cornish language and people. In 2007, the Cornish Language Partnership MAGA represents separate divisions of government and their purpose is to further enhance the Cornish Language Developmental Plan. MAGA established an \"Ad-Hoc Group,\" which resulted in three orthographies being presented. The relations for the Ad-Hoc Group were to obtain consensus among the three orthographies, and then develop a \"single written form.\" The end result was creating a new form of Cornish, which had to be natural for both new learners and skilled speakers.\n\nLiterature \n\nNeo-Cornish literature \n\nIn 1981, the Breton library ' edited ' (Passion of our lord), a 15th-century Cornish poem. The first complete translation of the Bible into Cornish translated from English, was published in 2011.  Another Bible translation project translating from original languages is underway.  The New Testament and Psalms were posted on-line on YouVersion (Bible.com) and Bibles.org in July 2014 by the Bible Society.\n\nA few small publishers produce books in Cornish which are stocked in some local bookshops, as well as in Cornish branches of Waterstones and WH Smiths, although newer publications are becoming increasingly available on the Internet. The Truro Waterstones hosts the annual \"\" literary awards, established by  to recognise publications relating to Cornwall or in the Cornish language. In recent years, a number of Cornish translations of literature has been published, including Alice's Adventures in Wonderland (2009), Around the World in Eighty Days (2009), Treasure Island (2010),  The Railway Children (2012), Hound of the Baskervilles (2012), The War of the Worlds (2012), The Wind in the Willows (2013), Three Men in a Boat (2013), Alice in Wonderland and Through the Looking-Glass (2014), and A Christmas Carol (which won the 2012  award for Cornish Language books), as well as original Cornish literature such as ' (The Lyonesse Stone) by Craig Weatherhill. Literature aimed at children is also available, such as ' (Where's Spot?), ' (The Beast of Bodmin Moor), three Topsy and Tim titles,,two Tintin titles and ' (Briallen and the Alien), which won the 2015  award for Cornish Language books for children. In 2014 ', Nicholas Williams' translation of J.R.R. Tolkien's The Hobbit was published.\n\nAn Gannas is a monthly magazine published entirely in the Cornish language. Members contribute articles on various subjects. The magazine is produced by Graham Sandercock who has been its editor since 1976.\n\nMedia \n\nIn 1983 BBC Radio Cornwall started broadcasting around two minutes of Cornish every week. In 1987, however, they gave over 15 minutes of airtime on Sunday mornings for a programme called ' (\"Holdall\"), presented by John King, running until the early 1990s.Martin Ball, Nicole Muller, The Celtic Languages, Psychology Press, 12 Nov 2012 It was eventually replaced with a five-minute news bulletin called ' (\"The News\"). The bulletin was presented every Sunday evening for many years by Rod Lyon, then Elizabeth Stewart, and currently a team presents in rotation. Pirate FM ran short bulletins on Saturday lunchtimes from 1998 to 1999. In 2006, Matthew Clarke who had presented the Pirate FM bulletin, launched a web-streamed news bulletin called ' (\"Weekly News\"), which in 2008 was merged into a new weekly magazine podcast ' (RanG).\n\nCornish television shows have included a 1982 series by Westward Television each episode containing a three-minute lesson in Cornish.Martin Ball, Nicole Muller ', an eight episode series produced by Television South West and broadcast between June and July 1984, later on S4C from May to July 1985, and as a schools programme in 1986. Also by Television South West were two bilingual programmes on Cornish Culture called '\nIn 2016 Kelly's Ice Cream of Bodmin introduced a light hearted television commercial in the Cornish language and this has been repeated in 2017.\n\nMusic \n\nEnglish composer Peter Warlock, an enthusiast of the Celtic languages, wrote a Christmas carol in Cornish (setting words by Henry Jenner). Cornish musician Jory Bennett (born Redruth, 1963) has composed \"Six Songs of Cornwall\" for bass and piano, a Cornish song-cycle, settings of Cornish language poems by Nicholas Williams /trans. E. G. Retallack Hooper (f.p. Keele University, 7 May 1986).  The Cornish electronic musician Richard D James has often used Cornish names for track titles, most notably on his DrukQs album. Gwenno Saunders is a multilingual Welsh-born musician and a Cornish speaker. Skwardya has produced four CD albums in Cornish in a modern pop/rock/blues/dance style.\n\nA number of traditional Cornish folk songs have been preserved, including \"An Awhesyth\", \"Bro Goth agan Tasow\", and \"Delkiow Sivy\".\n\nPlacenames and surnames \n\nThe Cornish language has influenced the toponomy of Cornwall, and has historically been used in surnames for the Cornish people. Long before the agreement of the  Standard Written Form of Cornish in the 21st century, Late Cornish orthography in the Early Modern period usually followed Welsh to English transliteration so phonetically rendering C for K, I for Y, U for W, and Z for S, caused place names such as Porthcurno and Penzance to be adopted into English instead of their Standard Written Form Porth Kernow and Pen Sans. Likewise, words such as Enys (\"island\") can be found spelled as \"Ince\" as at Ince Castle. These apparent mistranslations can however reveal an insight into how names and places were actually pronounced, explaining, for example, how anglicised Launceston is still pronounced \"Lann-zan\" from Cornish \"Lann Stefan\" with emphasis on the first element.\n\nThe following tables present some examples of Cornish placenames and surnames, and their anglicised versions:\n\nSamples \n\nFrom the Universal Declaration of Human Rights:\n\nFrom ', the Cornish anthem:. Cornish language. http://en.wikipedia.org/?curid=6130."
  }
}
