{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17029",
  "eid" : "2a2e8bf0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778580015,
  "textBody" : "Kermit the Frog is a Muppet character and Jim Henson's most well-known creation. Introduced in 1955, Kermit serves as the straight man protagonist of numerous Muppet productions, most notably Sesame Street and The Muppet Show, as well as in movies, specials, and public service announcements through the years. Henson originally performed Kermit until his death in 1990; Steve Whitmire performed Kermit from that time up until his dismissal from the role in 2016. Kermit is currently performed by Matt Vogel. He was also voiced by Frank Welker in Muppet Babies and occasionally in other animation projects.\n\nKermit performed the hit singles \"Bein' Green\" in 1970 and \"The Rainbow Connection\" in 1979 for The Muppet Movie, the first feature-length film featuring the Muppets. The latter song reached No. 25 on the Billboard Hot 100. Kermit's iconic look and voice have been recognizable worldwide since, and in 2006, the character was credited as the author of Before You Leap: A Frog's Eye View of Life's Greatest Lessons, which is an \"autobiography\" told from the perspective of the character himself.\n\nDevelopment\n\nThe earliest trace of Kermit first appeared in 1955 on WRC-TV's Sam and Friends. This prototype Kermit was created from a discarded spring coat belonging to Henson's mother and two ping pong ball halves for eyes.\n\nInitially, Kermit was a lizard-like creature.  He subsequently made a number of television appearances before his status as a frog was established. His collar was added at the time to make him seem more frog-like and to conceal the seam between his head and body.\n\nNaming\n\nThe origin of Kermit's name is a subject of some debate. It is often claimed that Kermit was named after Henson's childhood friend Kermit Scott, from Leland, Mississippi. However, Karen Falk, head archivist and board of directors member for the Jim Henson Legacy organization, denies this claim on the Jim Henson Company's website: \n\nJoy DiMenna, the only daughter of Kermit Kalman Cohen who worked as a sound engineer at WBAL-TV during Jim Henson's time with Sam and Friends,  recalls that the puppet was named after her father. According to Kermit Cohen's obituary, as well as DiMenna and Lenny Levin, a colleague of Mr. Cohen's at WBAL:\n\nAnother common belief is that Kermit was named for Kermit Love, who worked with Henson in designing and constructing Muppets, particularly on Sesame Street but Love's association with Henson did not begin until well after Kermit's creation and naming, and he always denied any connection between his name and that of the character.\n\nAs Sesame Street is localized for some different markets that speak languages other than English, Kermit is often renamed. In Portugal, he is called Cocas, o Sapo (sapo means \"toad\"), and in Brazil, his name is similar: Caco, o Sapo. In most of Hispanic America, his name is la rana René (René the Frog), while in Spain, he is named Gustavo. In the Arabic version, he is known as Kamel, which is a common Arabic male name that means \"perfect\". In Hungary, he is called Breki (onomatopoetic).\n\nPerformers \n\nJim Henson originated the character in 1955 on his local television series, Sam and Friends. Brian Henson described his father's performance as Kermit as \"coming out of his own personality—was a wry intelligence, a little bit of a naughtiness, but Kermit always loved everyone around and also loved a good prank.\" He continued to perform the character until his death in 1990. Henson's last known performance as Kermit was for an appearance on The Arsenio Hall Show to promote The Muppets at Walt Disney World. Henson died twelve days after that appearance.\n\nFollowing Henson's death, veteran Muppet performer Steve Whitmire was named Kermit's new performer. In 2017, Whitmire seemed to imply in a blog post that Jim Henson had asked him to assume the role before he died, though Jim's daughter Cheryl Henson claimed Brian had selected him after Jim's death.  Whitmire's first public performance as Kermit was at the end of the television special The Muppets Celebrate Jim Henson in 1990. He remained Kermit's principal performer until 2016. Disney announced that Matt Vogel would be taking over as the performer and voice for Kermit on July 10, 2017. Whitmire later revealed that he had not chosen to voluntarily leave the role, but rather, had been recast by Muppet Studios in October 2016. In an interview with The Hollywood Reporter later in July 2017, Whitmire elaborated he was fired for two reasons: long-term creative disagreements over Kermit's characterization and prolonged labor union negotiations that delayed his involvement in Muppet-related productions.\n\nFor a brief demonstration at MuppetFest (a 2001 Muppet fan convention), Muppet performer John Kennedy performed Kermit opposite Whitmire's performance of young Kermit (from Kermit's Swamp Years). Kennedy also performed Kermit for Muppets Ahoy!, a 2006 Disney Cruise Line stage show (though Whitmire performed Kermit for the first few shows). Muppet performer Artie Esposito briefly performed Kermit in 2009 for a few personal appearances (an appearance on America's Got Talent, an appearance at the MTV Video Music Awards, and at the 2009 D23 Expo with Rowlf the Dog as part of a tribute to Jim Henson).\n\nVoice actor Frank Welker provided the voice of Baby Kermit on the animated Saturday morning cartoon, Muppet Babies. He also provided the voice of an adult Kermit for a short-lived spin-off, Little Muppet Monsters.\n\nCharacter biography\n\nA biography has been developed for Kermit the Frog as if he was an actual living performer rather than a puppet character. According to this fictional biography, he was born in Leland, Mississippi alongside approximately 2,353 siblings, though a 2011 \"interview\" on The Ellen DeGeneres Show has him state that he was from the swamps of Louisiana.\n\nAs portrayed in the 2002 film Kermit's Swamp Years, at the age of 12, he was the first of his siblings to leave the swamp, and one of the first frogs to talk to humans. He is shown in the film encountering a 12-year-old Jim Henson (played by Christian Kriebel) for the first time.\n\nAccording to The Muppet Movie, Kermit returned to the swamp, where a passing agent (Dom DeLuise) noted he had talent and, thus inspired, he headed to Hollywood, encountering the rest of the Muppets along the way. Together, they were given a standard \"rich and famous\" contract by Lew Lord (Orson Welles) of Wide World Studios and began their showbiz careers. In Before You Leap, Kermit again references encountering Jim Henson sometime after the events depicted in the course of The Muppet Movie and details their friendship and their partnership in the entertainment industry, crediting Henson as being the individual to whom he owes his fame. At some point after the events of The Muppet Movie, Kermit and the other Muppets begin The Muppet Show, and the characters remain together as a group, before starring in the other Muppet films and Muppets Tonight, with Kermit usually at the core of the stories as the lead protagonist. Kermit is shown in The Muppet Movie as stating that the events of the film are \"approximate to how it happened\" when asked by his nephew Robin about how the Muppets got started.\n\nFozzie Bear is portrayed as Kermit's best friend—a fact reiterated by Kermit in Before You Leap—and the two were frequently seen together during sketches on The Muppet Show and in other Muppet-related media and merchandise.\n\nOn August 4, 2015, Kermit the Frog and Miss Piggy \"announced\" that they had ended their romantic relationship. On September 2, 2015, Kermit was stated to have found a new girlfriend, a pig named Denise, but around February 2016, Denise supposedly broke up with Kermit after almost six months together.\n\nCareer\n\nKermit has been featured prominently on both The Muppet Show and Sesame Street. However, he had a prominent career before Sesame Streets debut in 1969, as he starred in Sam and Friends, and numerous Muppets made guest appearances on Today from 1961 and The Ed Sullivan Show from 1966.\n\nSesame Street\n\nKermit was one of the original main Muppet characters on Sesame Street. Closely identified with the show, Kermit usually appeared as a lecturer on simple topics, a straight man to another Muppet (usually Grover, Herry Monster or Cookie Monster), or a news reporter interviewing storybook characters for Sesame Street News. He sang many songs on the show, including Bein' Green, and appeared in the 1998 video The Best of Kermit on Sesame Street.\n\nUnlike the rest of the show's Muppets, Kermit was never any property of Sesame Workshop and has rarely been a part of the show's merchandise. When Sesame Workshop bought full ownership of its characters from the Jim Henson Company for $180 million, Kermit was not included in the deal. The character now belongs to The Muppets Studio, a division of the Walt Disney Company. His first Sesame Street appearance since Disney-ownership was in the show's 40th-season premiere on November 10, 2009.\n\nWith the Muppets\n\nIn The Muppet Show television series, Kermit was the central character, the showrunner, and the long-suffering stage manager of the theater show, trying to keep order amidst the chaos created by the other Muppets. Jim Henson once claimed that Kermit's job on the Muppet Show was much like his own: \"trying to get a bunch of crazies to actually get the job done.\" It was on this show that the running gag of Kermit being pursued by leading lady Miss Piggy developed.\n\nOn Muppets Tonight, Kermit was still a main character, although he was the producer rather than frontman. He appeared in many parody sketches such as NYPD Green, City Schtickers, Flippers, and The Muppet Odd Squad, as well as in the Psychiatrist's Office sketch.\n\nKermit also served as the mascot for The Jim Henson Company, until the sale of the Muppet characters to Disney. A Kermit puppet can be seen at the National Museum of American History.\n\nKermit appears in Muppet*Vision 3D, an attraction that opened in 1991 at Disney's Hollywood Studios at Walt Disney World in Lake Buena Vista, Florida. The character was formerly featured at the attraction version in Disney California Adventure Park, at the Disneyland Resort in Anaheim, California, until its closure in 2014. Kermit also appears at the Magic Kingdom at The Muppets Present...Great Moments in American History. He also appeared in two parades; Disney Stars and Motor Cars Parade held at Disney's Hollywood Studios until 2008 and Disney's Honorary VoluntEars Cavalcade that was held during 2010 at the Magic Kingdom and Disneyland.\n\nFilmography\n\nKermit the Frog has appeared in almost every Muppet production, as well as making guest appearances in other shows and movies.\n\nBelow is a list of his more well-known appearances:\n\n* Sam and Friends (1955–1961) (TV)\n* Sesame Street (1969–1990, 1996–2001, and 2009) (TV)\n* Hey, Cinderella! (1969) (TV)\n* The Muppets on Puppets (1970) (TV)\n* The Frog Prince (1971) (TV)\n* The Muppets Valentine Show (1974) (TV)\n* The Muppet Show: Sex and Violence (1975) (TV)\n* The Muppet Show (1976–1981) (TV)\n* Emmet Otter's Jug-Band Christmas (1977) (TV)\n* The Muppet Movie (1979)\n* The Great Muppet Caper (1981)\n* The Muppets Take Manhattan (1984)\n* Muppet Babies (1984–1991) (TV)\n* Sesame Street Presents Follow That Bird (1985)\n* The Muppets: A Celebration of 30 Years (1986) (TV)\n* The Christmas Toy (1986) (TV)\n* A Muppet Family Christmas (1987) (TV)\n* The Jim Henson Hour (1989) (TV)\n* Cartoon All-Stars to the Rescue (1990) (TV)\n* The Muppets at Walt Disney World (1990) (TV)\n* The Muppets Celebrate Jim Henson (1990) (TV)\n* The Muppet Christmas Carol (1992) – Appearance as Bob Cratchit\n* Muppet Classic Theater (1994) (Direct-to-Video) - Appearance as King Midas and the King in Rumpelstiltskin. \n* Muppet Treasure Island (1996) – Appearance as Captain Abraham Smollett\n* Muppets Tonight (1996–1998) (TV)\n* Muppets from Space (1999)\n* Kermit's Swamp Years (2002) (Direct-to-Video)\n* It's a Very Merry Muppet Christmas Movie (2002) (TV)\n* Saturday Night Live (2004, 2011) (TV)\n* The Muppets' Wizard of Oz (2005) (TV) – Appearance as Himself and The Scarecrow\n* Mr. Magorium's Wonder Emporium (2007) (cameo)\n* Studio DC: Almost Live (2008) (TV)\n* A Muppets Christmas: Letters to Santa (2008) (TV)\n* The Muppets (2011)\n* Lady Gaga and the Muppets Holiday Spectacular (2013) (TV)\n* Muppets Most Wanted (2014)\n* The Muppets (2015-2016) (TV)\n\nCultural impact\n\nAwards and commemorations\n\n Kermit was awarded an honorary doctorate of Amphibious Letters on May 19, 1996, at Southampton College, New York, where he also gave a commencement speech. He is also the only \"amphibian\" to have had the honor of addressing the Oxford Union. A statue of Henson and Kermit was erected on the campus of Henson's alma mater, the University of Maryland, College Park in 2003.\n\nKermit was also given the honor of being the Grand Marshal of the Tournament of Roses Parade in 1996. The Macy's Thanksgiving Day Parade has featured a Kermit balloon since 1977.\n\nOn November 14, 2002, Kermit the Frog received a star on the Hollywood Walk of Fame. The star is located at 6801 Hollywood Blvd.\n\nOn Kermit's 50th birthday in 2005, the United States Postal Service released a set of new stamps with photos of Kermit and some of his fellow Muppets on them. The background of the stamp sheet features a photo of a silhouetted Henson sitting in a window well, with Kermit sitting in his lap looking at him.\n\nIn 2006, while Kermit was on his international tour, Kermit, Texas was taken over by the frog during their homecoming week, ending with Kermit himself crowning the homecoming queen. The city of Kermit's main water tower was then painted with the face and signature of the frog. The voice actor used for Kermit at this time was Tanner Martin (13) of Frackville Pennsylvania. He was selected for the contest, which had over 100,000 entries.\n\nKermit was also the grand marshal for Michigan State University's homecoming parade in 2006.\n\nIn 2013, the original Kermit puppet from Sam and Friends was donated to the Smithsonian Institution in Washington, D.C. for display in the pop culture gallery. In 2015, the Leland Chamber of Commerce in Leland, Mississippi opened a small museum containing puppets and memorabilia dedicated to Kermit.\n\nKermit's legacy is also deeply entrenched in the science community. One of the famous WP-3D Orion research platforms flown by the NOAA Hurricane Hunters is named after Kermit.  The other is named after Miss Piggy. In 2015, the discovery of the Costa Rican glass frog Hyalinobatrachium dianae also attracted viral media attention due to the creature's perceived resemblance to Kermit, with researcher Brian Kubicki quoted as saying \"I am glad that this species has ended up getting so much international attention, and in doing so it is highlighting the amazing amphibians that are native to Costa Rica and the need to continue exploring and studying the country's amazing tropical forests.\"\n\nGuest television appearances\n\nKermit has made numerous guest appearances on popular television shows, including co-hosting individual episodes of a number of long-running talk shows. On April 2, 1979, Kermit guest-hosted The Tonight Show Starring Johnny Carson to promote The Muppet Movie. From 1983 to 1995, the French political satire show Le Bébête Show used copies of various Muppets to parody key political figures, and Kermit renamed \"Kermitterrand\", embodied President François Mitterrand.\n\nAs an April Fool's joke, Kermit hosted CNN's Larry King Live in 1994 and interviewed Hulk Hogan. Kermit was also a semi-regular during various incarnations of Hollywood Squares, with other Muppets such as Big Bird and Oscar the Grouch also making appearances on the original Hollywood Squares.\n\nMerchandising\n\nJim Henson's characters, including the Muppets, have inspired merchandise internationally, with Chris Bensch, chief curator of Rochester, New York's The Strong National Museum of Play, reporting \"There seems to have been a particular craze for Kermit the Frog in Japan,\" likely due to the \"cuteness appeal.\" Baby Kermit plush toys became popular in the 1980s after the success of Muppet Babies. In 1991, one year after Jim Henson died, merchandise featuring Kermit and other Muppet characters was being sold at Disney theme parks, causing Henson Associates to file a lawsuit against Disney for copyright infringement. Henson alleged that the \"counterfeit merchandise\" falsely indicated that the characters belonged to Disney, although the latter company had the right to exercise use of the characters due to an earlier licensing agreement. The Henson Associates highlighted a T-shirt displaying Kermit, the Disney brand, and a copyright symbol. Disney representative Erwin Okun said the lawsuit was \"outrageous\" and \"an unfortunate break with the legacy of a fine relationship with Disney that Jim Henson left behind\". Disney later acquired the Muppets, and thusly, clothes, toys and souvenirs depicting Kermit and the Muppets continued to be sold at Disney theme parks and stores.\n\nThe Leland Chamber of Commerce's small Kermit-themed museum set out to preserve some of the dolls and merchandise. In 2016, The New Zealand Heraldreported a hat featuring Kermit sipping Lipton tea, associated with the \"But That’s None Of My Business\" Internet meme, became a popular seller after basketball player LeBron James drew attention for wearing one.\n\nKermit in Internet culture\n\nIn March 2007, Sad Kermit, an unofficial parody, was uploaded to the website YouTube, showing a store-bought Kermit puppet performing a version of the Nine Inch Nails song \"Hurt\" in a style similar to Johnny Cash's famous cover version. In contrast to the real Kermit character's usual family-friendly antics, the video shows the puppet engaging in drug abuse, smoking, alcoholism, performing oral sex on Rowlf the Dog, smashing a picture of Miss Piggy (with a breast exposed) and attempting suicide. The video became an Internet meme. The Victoria Times Colonist called it an \"online sensation\". The Chicago Sun-Times said it \"puts the high in 'Hi-ho!'\"  The London Free Press said \"Sad Kermit is in a world of pain\". The Houston Press described it as the \"world's most revolting web phenomenon\". SF Weekly described the unauthorized video as \"ironic slandering.\" Clips have been featured on the Canadian television series The Hour, where host George Stroumboulopoulos speculated that the Kermit version of \"Hurt\" was inspired by the Cash version rather than that of Nine Inch Nails.\n\nKermit has also appeared in a popular meme in which he is shown sipping tea, \"one used when you sassily point something out, and then slyly back away, claiming that it’s not [your] business.\" The photo is taken from \"Be More Kermit,\" a Lipton advertisement that aired in 2014, and was adapted into the \"But That’s None Of My Business\" meme by African American comedians on the Tumblr blog Kermit the Snitch, making appearances on Twitter, Instagram and Facebook. Charles Pulliam-Moore of the TV station Fusion praised \"But That’s None Of My Business\" as \"a symbol for the comedic brilliance born out of black communities on the internet,\" but Stephanie Hayes of Bustle magazine slammed the memes as racist and obscene.\n\nIn 2016, a Good Morning America post on Twitter referred to \"But That’s None Of My Business\" as \"Tea Lizard,\" becoming the subject of viral online derision. New York magazine replied that, \"Kermit is a frog. A frog is an amphibian. A lizard is a reptile. It’s just so insulting. Beyond a frog and a lizard both being clearly ectothermic, they couldn’t be any more different. Not all green things are the same, you ignorant bastards.\" Popular Science also addressed the misnomer, writing \"Frogs, which are amphibians, have quite a few significant differences from reptiles in how they breathe, their life cycles, whether they have scales or not... there's a lot to absorb here.\"\n\nIn November 2016, a new meme surfaced of Kermit talking to a hooded version of himself which represents the self and its dark inner thoughts. It involves captioning of a screenshot taken from the Muppets Most Wanted movie of Kermit and Constantine looking at each other.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kermit the Frog" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17029" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kermit the Frog is a Muppet character and Jim Henson's most well-known creation. Introduced in 1955, Kermit serves as the straight man protagonist of numerous Muppet productions, most notably Sesame Street and The Muppet Show, as well as in movies, specials, and public service announcements through the years. Henson originally performed Kermit until his death in 1990; Steve Whitmire performed Kermit from that time up until his dismissal from the role in 2016. Kermit is currently performed by Matt Vogel. He was also voiced by Frank Welker in Muppet Babies and occasionally in other animation projects.\n\nKermit performed the hit singles \"Bein' Green\" in 1970 and \"The Rainbow Connection\" in 1979 for The Muppet Movie, the first feature-length film featuring the Muppets. The latter song reached No. 25 on the Billboard Hot 100. Kermit's iconic look and voice have been recognizable worldwide since, and in 2006, the character was credited as the author of Before You Leap: A Frog's Eye View of Life's Greatest Lessons, which is an \"autobiography\" told from the perspective of the character himself.\n\nDevelopment\n\nThe earliest trace of Kermit first appeared in 1955 on WRC-TV's Sam and Friends. This prototype Kermit was created from a discarded spring coat belonging to Henson's mother and two ping pong ball halves for eyes.\n\nInitially, Kermit was a lizard-like creature.  He subsequently made a number of television appearances before his status as a frog was established. His collar was added at the time to make him seem more frog-like and to conceal the seam between his head and body.\n\nNaming\n\nThe origin of Kermit's name is a subject of some debate. It is often claimed that Kermit was named after Henson's childhood friend Kermit Scott, from Leland, Mississippi. However, Karen Falk, head archivist and board of directors member for the Jim Henson Legacy organization, denies this claim on the Jim Henson Company's website: \n\nJoy DiMenna, the only daughter of Kermit Kalman Cohen who worked as a sound engineer at WBAL-TV during Jim Henson's time with Sam and Friends,  recalls that the puppet was named after her father. According to Kermit Cohen's obituary, as well as DiMenna and Lenny Levin, a colleague of Mr. Cohen's at WBAL:\n\nAnother common belief is that Kermit was named for Kermit Love, who worked with Henson in designing and constructing Muppets, particularly on Sesame Street but Love's association with Henson did not begin until well after Kermit's creation and naming, and he always denied any connection between his name and that of the character.\n\nAs Sesame Street is localized for some different markets that speak languages other than English, Kermit is often renamed. In Portugal, he is called Cocas, o Sapo (sapo means \"toad\"), and in Brazil, his name is similar: Caco, o Sapo. In most of Hispanic America, his name is la rana René (René the Frog), while in Spain, he is named Gustavo. In the Arabic version, he is known as Kamel, which is a common Arabic male name that means \"perfect\". In Hungary, he is called Breki (onomatopoetic).\n\nPerformers \n\nJim Henson originated the character in 1955 on his local television series, Sam and Friends. Brian Henson described his father's performance as Kermit as \"coming out of his own personality—was a wry intelligence, a little bit of a naughtiness, but Kermit always loved everyone around and also loved a good prank.\" He continued to perform the character until his death in 1990. Henson's last known performance as Kermit was for an appearance on The Arsenio Hall Show to promote The Muppets at Walt Disney World. Henson died twelve days after that appearance.\n\nFollowing Henson's death, veteran Muppet performer Steve Whitmire was named Kermit's new performer. In 2017, Whitmire seemed to imply in a blog post that Jim Henson had asked him to assume the role before he died, though Jim's daughter Cheryl Henson claimed Brian had selected him after Jim's death.  Whitmire's first public performance as Kermit was at the end of the television special The Muppets Celebrate Jim Henson in 1990. He remained Kermit's principal performer until 2016. Disney announced that Matt Vogel would be taking over as the performer and voice for Kermit on July 10, 2017. Whitmire later revealed that he had not chosen to voluntarily leave the role, but rather, had been recast by Muppet Studios in October 2016. In an interview with The Hollywood Reporter later in July 2017, Whitmire elaborated he was fired for two reasons: long-term creative disagreements over Kermit's characterization and prolonged labor union negotiations that delayed his involvement in Muppet-related productions.\n\nFor a brief demonstration at MuppetFest (a 2001 Muppet fan convention), Muppet performer John Kennedy performed Kermit opposite Whitmire's performance of young Kermit (from Kermit's Swamp Years). Kennedy also performed Kermit for Muppets Ahoy!, a 2006 Disney Cruise Line stage show (though Whitmire performed Kermit for the first few shows). Muppet performer Artie Esposito briefly performed Kermit in 2009 for a few personal appearances (an appearance on America's Got Talent, an appearance at the MTV Video Music Awards, and at the 2009 D23 Expo with Rowlf the Dog as part of a tribute to Jim Henson).\n\nVoice actor Frank Welker provided the voice of Baby Kermit on the animated Saturday morning cartoon, Muppet Babies. He also provided the voice of an adult Kermit for a short-lived spin-off, Little Muppet Monsters.\n\nCharacter biography\n\nA biography has been developed for Kermit the Frog as if he was an actual living performer rather than a puppet character. According to this fictional biography, he was born in Leland, Mississippi alongside approximately 2,353 siblings, though a 2011 \"interview\" on The Ellen DeGeneres Show has him state that he was from the swamps of Louisiana.\n\nAs portrayed in the 2002 film Kermit's Swamp Years, at the age of 12, he was the first of his siblings to leave the swamp, and one of the first frogs to talk to humans. He is shown in the film encountering a 12-year-old Jim Henson (played by Christian Kriebel) for the first time.\n\nAccording to The Muppet Movie, Kermit returned to the swamp, where a passing agent (Dom DeLuise) noted he had talent and, thus inspired, he headed to Hollywood, encountering the rest of the Muppets along the way. Together, they were given a standard \"rich and famous\" contract by Lew Lord (Orson Welles) of Wide World Studios and began their showbiz careers. In Before You Leap, Kermit again references encountering Jim Henson sometime after the events depicted in the course of The Muppet Movie and details their friendship and their partnership in the entertainment industry, crediting Henson as being the individual to whom he owes his fame. At some point after the events of The Muppet Movie, Kermit and the other Muppets begin The Muppet Show, and the characters remain together as a group, before starring in the other Muppet films and Muppets Tonight, with Kermit usually at the core of the stories as the lead protagonist. Kermit is shown in The Muppet Movie as stating that the events of the film are \"approximate to how it happened\" when asked by his nephew Robin about how the Muppets got started.\n\nFozzie Bear is portrayed as Kermit's best friend—a fact reiterated by Kermit in Before You Leap—and the two were frequently seen together during sketches on The Muppet Show and in other Muppet-related media and merchandise.\n\nOn August 4, 2015, Kermit the Frog and Miss Piggy \"announced\" that they had ended their romantic relationship. On September 2, 2015, Kermit was stated to have found a new girlfriend, a pig named Denise, but around February 2016, Denise supposedly broke up with Kermit after almost six months together.\n\nCareer\n\nKermit has been featured prominently on both The Muppet Show and Sesame Street. However, he had a prominent career before Sesame Streets debut in 1969, as he starred in Sam and Friends, and numerous Muppets made guest appearances on Today from 1961 and The Ed Sullivan Show from 1966.\n\nSesame Street\n\nKermit was one of the original main Muppet characters on Sesame Street. Closely identified with the show, Kermit usually appeared as a lecturer on simple topics, a straight man to another Muppet (usually Grover, Herry Monster or Cookie Monster), or a news reporter interviewing storybook characters for Sesame Street News. He sang many songs on the show, including Bein' Green, and appeared in the 1998 video The Best of Kermit on Sesame Street.\n\nUnlike the rest of the show's Muppets, Kermit was never any property of Sesame Workshop and has rarely been a part of the show's merchandise. When Sesame Workshop bought full ownership of its characters from the Jim Henson Company for $180 million, Kermit was not included in the deal. The character now belongs to The Muppets Studio, a division of the Walt Disney Company. His first Sesame Street appearance since Disney-ownership was in the show's 40th-season premiere on November 10, 2009.\n\nWith the Muppets\n\nIn The Muppet Show television series, Kermit was the central character, the showrunner, and the long-suffering stage manager of the theater show, trying to keep order amidst the chaos created by the other Muppets. Jim Henson once claimed that Kermit's job on the Muppet Show was much like his own: \"trying to get a bunch of crazies to actually get the job done.\" It was on this show that the running gag of Kermit being pursued by leading lady Miss Piggy developed.\n\nOn Muppets Tonight, Kermit was still a main character, although he was the producer rather than frontman. He appeared in many parody sketches such as NYPD Green, City Schtickers, Flippers, and The Muppet Odd Squad, as well as in the Psychiatrist's Office sketch.\n\nKermit also served as the mascot for The Jim Henson Company, until the sale of the Muppet characters to Disney. A Kermit puppet can be seen at the National Museum of American History.\n\nKermit appears in Muppet*Vision 3D, an attraction that opened in 1991 at Disney's Hollywood Studios at Walt Disney World in Lake Buena Vista, Florida. The character was formerly featured at the attraction version in Disney California Adventure Park, at the Disneyland Resort in Anaheim, California, until its closure in 2014. Kermit also appears at the Magic Kingdom at The Muppets Present...Great Moments in American History. He also appeared in two parades; Disney Stars and Motor Cars Parade held at Disney's Hollywood Studios until 2008 and Disney's Honorary VoluntEars Cavalcade that was held during 2010 at the Magic Kingdom and Disneyland.\n\nFilmography\n\nKermit the Frog has appeared in almost every Muppet production, as well as making guest appearances in other shows and movies.\n\nBelow is a list of his more well-known appearances:\n\n* Sam and Friends (1955–1961) (TV)\n* Sesame Street (1969–1990, 1996–2001, and 2009) (TV)\n* Hey, Cinderella! (1969) (TV)\n* The Muppets on Puppets (1970) (TV)\n* The Frog Prince (1971) (TV)\n* The Muppets Valentine Show (1974) (TV)\n* The Muppet Show: Sex and Violence (1975) (TV)\n* The Muppet Show (1976–1981) (TV)\n* Emmet Otter's Jug-Band Christmas (1977) (TV)\n* The Muppet Movie (1979)\n* The Great Muppet Caper (1981)\n* The Muppets Take Manhattan (1984)\n* Muppet Babies (1984–1991) (TV)\n* Sesame Street Presents Follow That Bird (1985)\n* The Muppets: A Celebration of 30 Years (1986) (TV)\n* The Christmas Toy (1986) (TV)\n* A Muppet Family Christmas (1987) (TV)\n* The Jim Henson Hour (1989) (TV)\n* Cartoon All-Stars to the Rescue (1990) (TV)\n* The Muppets at Walt Disney World (1990) (TV)\n* The Muppets Celebrate Jim Henson (1990) (TV)\n* The Muppet Christmas Carol (1992) – Appearance as Bob Cratchit\n* Muppet Classic Theater (1994) (Direct-to-Video) - Appearance as King Midas and the King in Rumpelstiltskin. \n* Muppet Treasure Island (1996) – Appearance as Captain Abraham Smollett\n* Muppets Tonight (1996–1998) (TV)\n* Muppets from Space (1999)\n* Kermit's Swamp Years (2002) (Direct-to-Video)\n* It's a Very Merry Muppet Christmas Movie (2002) (TV)\n* Saturday Night Live (2004, 2011) (TV)\n* The Muppets' Wizard of Oz (2005) (TV) – Appearance as Himself and The Scarecrow\n* Mr. Magorium's Wonder Emporium (2007) (cameo)\n* Studio DC: Almost Live (2008) (TV)\n* A Muppets Christmas: Letters to Santa (2008) (TV)\n* The Muppets (2011)\n* Lady Gaga and the Muppets Holiday Spectacular (2013) (TV)\n* Muppets Most Wanted (2014)\n* The Muppets (2015-2016) (TV)\n\nCultural impact\n\nAwards and commemorations\n\n Kermit was awarded an honorary doctorate of Amphibious Letters on May 19, 1996, at Southampton College, New York, where he also gave a commencement speech. He is also the only \"amphibian\" to have had the honor of addressing the Oxford Union. A statue of Henson and Kermit was erected on the campus of Henson's alma mater, the University of Maryland, College Park in 2003.\n\nKermit was also given the honor of being the Grand Marshal of the Tournament of Roses Parade in 1996. The Macy's Thanksgiving Day Parade has featured a Kermit balloon since 1977.\n\nOn November 14, 2002, Kermit the Frog received a star on the Hollywood Walk of Fame. The star is located at 6801 Hollywood Blvd.\n\nOn Kermit's 50th birthday in 2005, the United States Postal Service released a set of new stamps with photos of Kermit and some of his fellow Muppets on them. The background of the stamp sheet features a photo of a silhouetted Henson sitting in a window well, with Kermit sitting in his lap looking at him.\n\nIn 2006, while Kermit was on his international tour, Kermit, Texas was taken over by the frog during their homecoming week, ending with Kermit himself crowning the homecoming queen. The city of Kermit's main water tower was then painted with the face and signature of the frog. The voice actor used for Kermit at this time was Tanner Martin (13) of Frackville Pennsylvania. He was selected for the contest, which had over 100,000 entries.\n\nKermit was also the grand marshal for Michigan State University's homecoming parade in 2006.\n\nIn 2013, the original Kermit puppet from Sam and Friends was donated to the Smithsonian Institution in Washington, D.C. for display in the pop culture gallery. In 2015, the Leland Chamber of Commerce in Leland, Mississippi opened a small museum containing puppets and memorabilia dedicated to Kermit.\n\nKermit's legacy is also deeply entrenched in the science community. One of the famous WP-3D Orion research platforms flown by the NOAA Hurricane Hunters is named after Kermit.  The other is named after Miss Piggy. In 2015, the discovery of the Costa Rican glass frog Hyalinobatrachium dianae also attracted viral media attention due to the creature's perceived resemblance to Kermit, with researcher Brian Kubicki quoted as saying \"I am glad that this species has ended up getting so much international attention, and in doing so it is highlighting the amazing amphibians that are native to Costa Rica and the need to continue exploring and studying the country's amazing tropical forests.\"\n\nGuest television appearances\n\nKermit has made numerous guest appearances on popular television shows, including co-hosting individual episodes of a number of long-running talk shows. On April 2, 1979, Kermit guest-hosted The Tonight Show Starring Johnny Carson to promote The Muppet Movie. From 1983 to 1995, the French political satire show Le Bébête Show used copies of various Muppets to parody key political figures, and Kermit renamed \"Kermitterrand\", embodied President François Mitterrand.\n\nAs an April Fool's joke, Kermit hosted CNN's Larry King Live in 1994 and interviewed Hulk Hogan. Kermit was also a semi-regular during various incarnations of Hollywood Squares, with other Muppets such as Big Bird and Oscar the Grouch also making appearances on the original Hollywood Squares.\n\nMerchandising\n\nJim Henson's characters, including the Muppets, have inspired merchandise internationally, with Chris Bensch, chief curator of Rochester, New York's The Strong National Museum of Play, reporting \"There seems to have been a particular craze for Kermit the Frog in Japan,\" likely due to the \"cuteness appeal.\" Baby Kermit plush toys became popular in the 1980s after the success of Muppet Babies. In 1991, one year after Jim Henson died, merchandise featuring Kermit and other Muppet characters was being sold at Disney theme parks, causing Henson Associates to file a lawsuit against Disney for copyright infringement. Henson alleged that the \"counterfeit merchandise\" falsely indicated that the characters belonged to Disney, although the latter company had the right to exercise use of the characters due to an earlier licensing agreement. The Henson Associates highlighted a T-shirt displaying Kermit, the Disney brand, and a copyright symbol. Disney representative Erwin Okun said the lawsuit was \"outrageous\" and \"an unfortunate break with the legacy of a fine relationship with Disney that Jim Henson left behind\". Disney later acquired the Muppets, and thusly, clothes, toys and souvenirs depicting Kermit and the Muppets continued to be sold at Disney theme parks and stores.\n\nThe Leland Chamber of Commerce's small Kermit-themed museum set out to preserve some of the dolls and merchandise. In 2016, The New Zealand Heraldreported a hat featuring Kermit sipping Lipton tea, associated with the \"But That’s None Of My Business\" Internet meme, became a popular seller after basketball player LeBron James drew attention for wearing one.\n\nKermit in Internet culture\n\nIn March 2007, Sad Kermit, an unofficial parody, was uploaded to the website YouTube, showing a store-bought Kermit puppet performing a version of the Nine Inch Nails song \"Hurt\" in a style similar to Johnny Cash's famous cover version. In contrast to the real Kermit character's usual family-friendly antics, the video shows the puppet engaging in drug abuse, smoking, alcoholism, performing oral sex on Rowlf the Dog, smashing a picture of Miss Piggy (with a breast exposed) and attempting suicide. The video became an Internet meme. The Victoria Times Colonist called it an \"online sensation\". The Chicago Sun-Times said it \"puts the high in 'Hi-ho!'\"  The London Free Press said \"Sad Kermit is in a world of pain\". The Houston Press described it as the \"world's most revolting web phenomenon\". SF Weekly described the unauthorized video as \"ironic slandering.\" Clips have been featured on the Canadian television series The Hour, where host George Stroumboulopoulos speculated that the Kermit version of \"Hurt\" was inspired by the Cash version rather than that of Nine Inch Nails.\n\nKermit has also appeared in a popular meme in which he is shown sipping tea, \"one used when you sassily point something out, and then slyly back away, claiming that it’s not [your] business.\" The photo is taken from \"Be More Kermit,\" a Lipton advertisement that aired in 2014, and was adapted into the \"But That’s None Of My Business\" meme by African American comedians on the Tumblr blog Kermit the Snitch, making appearances on Twitter, Instagram and Facebook. Charles Pulliam-Moore of the TV station Fusion praised \"But That’s None Of My Business\" as \"a symbol for the comedic brilliance born out of black communities on the internet,\" but Stephanie Hayes of Bustle magazine slammed the memes as racist and obscene.\n\nIn 2016, a Good Morning America post on Twitter referred to \"But That’s None Of My Business\" as \"Tea Lizard,\" becoming the subject of viral online derision. New York magazine replied that, \"Kermit is a frog. A frog is an amphibian. A lizard is a reptile. It’s just so insulting. Beyond a frog and a lizard both being clearly ectothermic, they couldn’t be any more different. Not all green things are the same, you ignorant bastards.\" Popular Science also addressed the misnomer, writing \"Frogs, which are amphibians, have quite a few significant differences from reptiles in how they breathe, their life cycles, whether they have scales or not... there's a lot to absorb here.\"\n\nIn November 2016, a new meme surfaced of Kermit talking to a hooded version of himself which represents the self and its dark inner thoughts. It involves captioning of a screenshot taken from the Muppets Most Wanted movie of Kermit and Constantine looking at each other. Kermit the Frog. http://en.wikipedia.org/?curid=17029."
  }
}
