{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19524",
  "eid" : "3b680810-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778608913,
  "textBody" : "Events\n\n*1092 – Lincoln Cathedral is consecrated.\n*1386 – England and Portugal formally ratify their alliance with the signing of the Treaty of Windsor, making it the oldest diplomatic alliance in the world which is still in force.\n*1450 – 'Abd al-Latif (Timurid monarch) is assassinated.\n*1540 – Hernando de Alarcón sets sail on an expedition to the Gulf of California.\n*1662 – The figure who later became Mr. Punch  made his first recorded appearance in England.\n*1671 – Thomas Blood, disguised as a clergyman, attempts to steal England's Crown Jewels from the Tower of London.\n*1726 – Five men arrested during a raid on Mother Clap's molly house in London are executed at Tyburn.\n*1763 – The Siege of Fort Detroit begins during Pontiac's War against British forces.\n*1864 – Second Schleswig War: The Danish navy defeats the Austrian and Prussian fleets in the Battle of Heligoland.\n*1865 – American Civil War: Nathan Bedford Forrest surrenders his forces at Gainesville, Alabama.\n*  1865   – American Civil War: President Andrew Johnson issues a proclamation ending belligerent rights of the rebels and enjoining foreign nations to intern or expel Confederate ships.\n*1873 – Der Krach: Vienna stock market crash heralds the Long Depression.\n*1874 – The first horse-drawn bus makes its début in the city of Mumbai, traveling two routes.\n*1877 – Mihail Kogălniceanu reads, in the Chamber of Deputies, the Declaration of Independence of Romania. This day became the Independence Day of Romania.\n*  1877   – A magnitude 8.8 earthquake off the coast of Peru kills 2,541, including some as far away as Hawaii and Japan.\n*1887 – Buffalo Bill Cody's Wild West Show opens in London.\n*1901 – Australia opens its first parliament in Melbourne.\n*1904 – The steam locomotive City of Truro becomes the first steam engine in Europe to exceed 100 mph.\n*1911 – The works of Gabriele D'Annunzio are placed in the Index of Forbidden Books by the Vatican.\n*1915 – World War I: Second Battle of Artois between German and French forces.\n*1918 – World War I: Germany repels Britain's second attempt to blockade the port of Ostend, Belgium.\n*1920 – Polish–Soviet War: The Polish army under General Edward Rydz-Śmigły celebrates its capture of Kiev with a victory parade on Khreshchatyk.\n*1926 – Admiral Richard E. Byrd and Floyd Bennett claim to have flown over the North Pole (later discovery of Byrd's diary appears to cast some doubt on the claim.)\n*1936 – Italy formally annexes Ethiopia after taking the capital Addis Ababa on May 5.\n*1940 – World War II: The German submarine U-9 sinks the French coastal submarine Doris near Den Helder.\n*1941 – World War II: The German submarine U-110 is captured by the Royal Navy. On board is the latest Enigma machine which Allied cryptographers later use to break coded German messages.\n*1942 – Holocaust: The SS executes 588 Jewish residents of the Podolian town of Zinkiv (Khmelnytska oblast, Ukraine). The Zoludek Ghetto (in Belarus) is destroyed and all its inhabitants executed or deported.\n*1945 – World War II: The final German Instrument of Surrender is signed at the Soviet headquarters in Berlin-Karlshorst.\n*  1945   – World War II: The Channel Islands are liberated by the British after five years of German occupation.\n*1946 – King Victor Emmanuel III of Italy abdicates and is succeeded by Umberto II.\n*1948 – Czechoslovakia's Ninth-of-May Constitution comes into effect.\n*1949 – Rainier III becomes Prince of Monaco.\n*1950 – Robert Schuman presents his proposal on the creation of an organized Europe, which according to him was indispensable to the maintenance of peaceful relations. This proposal, known as the \"Schuman Declaration\", is considered by some people to be the beginning of the creation of what is now the European Union.\n*1955 – Cold War: West Germany joins NATO.\n*1958 – Film: Vertigo has world premiere in San Francisco.\n*1960 – The Food and Drug Administration announces it will approve birth control as an additional indication for Searle's Enovid, making Enovid the world's first approved oral contraceptive pill.\n*1961 – FCC Chairman Newton N. Minow gives his Wasteland Speech.\n*1964 – Ngô Đình Cẩn, de facto ruler of central Vietnam under his brother President Ngô Đình Diệm before the family's toppling, is executed.\n*1969 – Carlos Lamarca leads the first urban guerrilla action against the military dictatorship of Brazil in São Paulo, by robbing two banks.\n*1970 – Vietnam War: In Washington, D.C., 75,000 to 100,000 war protesters demonstrate in front of the White House.\n*1974 – Watergate scandal: The  United States House Committee on the Judiciary opens formal and public impeachment hearings against President Richard Nixon.\n*1977 – Hotel Polen fire: A disastrous fire burns down the Hotel Polen in Amsterdam causing 33 deaths and 21 severe injuries.\n*1979 – Iranian Jewish businessman Habib Elghanian is executed by firing squad in Tehran, prompting the mass exodus of the once 100,000-strong Jewish community of Iran.\n*1980 – In Florida, Liberian freighter  collides with the Sunshine Skyway Bridge over Tampa Bay, making a 1,400-ft. section of the southbound span collapse.  Thirty-five people in six cars and a Greyhound bus fall 150 ft. into the water and die.\n*  1980   – In Norco, California, five masked gunmen hold up a Security Pacific bank, leading to a violent shoot-out and one of the largest pursuits in California history. Two of the gunmen and one police officer are killed and thirty-three police and civilian vehicles are destroyed in the chase.\n*1987 – LOT Flight 5055 Tadeusz Kościuszko crashes after takeoff in Warsaw, Poland, killing all 183 people on board.\n*1992 – Armenian forces capture Shusha, marking a major turning point in the Nagorno-Karabakh War.\n*1992 – Westray Mine disaster kills 26 workers in Nova Scotia, Canada.\n*2001 – In Ghana, 129 football fans die in what  became known as the Accra Sports Stadium disaster. The deaths are caused by a stampede (caused by the firing of teargas by police personnel at the stadium) that followed a controversial decision by the referee.\n*2002 – The 38-day stand-off in the Church of the Nativity in Bethlehem comes to an end when the Palestinians inside agree to have 13 suspected terrorists among them deported to several different countries.\n*2012 – A Sukhoi Superjet 100 aircraft crashes into Mount Salak in West Java, Indonesia, killing 45 people.\n*2015 – An Airbus A400M Atlas military transport aircraft crashes near the Spanish city of Seville with three people on board killed.\n*  2015   – Russia stages its biggest ever military parade in Moscow's Red Square to commemorate the 70th anniversary of Victory Day.\n\nBirths\n\n*1147 – Minamoto no Yoritomo, Japanese shogun (d. 1199)\n*1170 – Valdemar II of Denmark (d. 1241)\n*1540 – Maharana Pratap, Indian ruler (d. 1597)\n*1555 – Jerónima de la Asunción, Catholic nun and founder of the first monastery in Manila (d. 1630)\n*1594 – Louis Henry, Prince of Nassau-Dillenburg, Military leader in the Thirty Years' War (d. 1662)\n*1617 – Frederick, Landgrave of Hesse-Eschwege (d. 1655)\n*1740 – Giovanni Paisiello, Italian composer and educator (d. 1816)\n*1746 – Gaspard Monge, French mathematician and engineer (d. 1818)\n*1763 – János Batsányi, Hungarian-Austrian poet and author (d. 1845)\n*1800 – John Brown, American activist (d. 1859)\n*1801 – Peter Hesketh-Fleetwood, English politician, founded the town of Fleetwood (d. 1866)\n*1814 – John Brougham, Irish-American actor and playwright (d. 1880)\n*1823 – Frederick Weld, English-New Zealand politician, 6th Prime Minister of New Zealand (d. 1891)\n*1824 – Jacob ben Moses Bachrach, Polish apologist and author (d. 1896)\n*1825 – James Collinson, Victorian painter (d. 1881) \n*1836 – Ferdinand Monoyer, French ophthalmologist, invented the Monoyer chart (d. 1912)\n*1837 – Adam Opel, German engineer, founded the Opel Company (d. 1895)\n*1845 – Gustaf de Laval, Swedish engineer and businessman (d. 1913)\n*1850 – Edward Weston (chemist), English-American chemist (d. 1936)\n*1855 – Julius Röntgen, German-Dutch composer (d. 1932)\n*1860 – J. M. Barrie, Scottish novelist and playwright (d. 1937)\n*1866 – Gopal Krishna Gokhale, Indian economist and politician (d. 1915)\n*1870 – Harry Vardon, British golfer (d. 1937)\n*1873 – Anton Cermak, Czech-American captain and politician, 44th Mayor of Chicago (d. 1933)\n*1874 – Howard Carter, English archaeologist and historian (d. 1939)\n*1882 – George Barker, American painter (d. 1965)\n*  1882   – Henry J. Kaiser, American shipbuilder and businessman, founded Kaiser Shipyards (d. 1967)\n*1883 – José Ortega y Gasset, Spanish philosopher, author, and critic (d. 1955)\n*1884 – Valdemar Psilander, Danish actor (d. 1917)\n*1888 – Francesco Baracca, Italian fighter pilot (d. 1918)\n*1893 – William Moulton Marston, American psychologist and author (d. 1947)\n*1895 – Richard Barthelmess, American actor (d. 1963)\n*  1895   – Lucian Blaga, Romanian poet, playwright, and philosopher (d. 1961)\n*  1895   – Frank Foss, American pole vaulter (d. 1989)\n*1896 – Richard Day, Canadian-American art director and set decorator (d. 1972)\n*1888 – Rolf de Maré, Swedish art collector (d. 1964)\n*1900 – Maria Malicka, Polish stage and film actress (d. 1992) \n*1904 – Conrad Bernier, Canadian-American organist, composer, and educator (d. 1988)\n*1906 – Eleanor Estes, American librarian, author, and illustrator (d. 1988)\n*1907 – Jackie Grant, Trinidadian cricketer (d. 1978)\n*  1907   – Kathryn Kuhlman, American evangelist and author (d. 1976)\n*  1907   – Baldur von Schirach, German politician (d. 1974)\n*1909 – Don Messer, Canadian violinist (d. 1973)\n*  1909   – Gordon Bunshaft, American architect, designed the Solow Building (d. 1990)\n*1911 – Harry Simeone, American music arranger, conductor, and composer (d. 2005)\n*1912 – Pedro Armendáriz, Mexican-American actor (d. 1963)\n*  1912   – Per Imerslund, Norwegian-German soldier and author (d. 1943)\n*  1912   – Géza Ottlik, Hungarian mathematician and theorist (d. 1990)\n*1914 – Denham Fouts, American prostitute (d. 1948)\n*  1914   – Carlo Maria Giulini, Italian conductor and director (d. 2005)\n*  1914   – Hank Snow, American country music singer-songwriter and guitarist (d. 1999)\n*1916 – William Pène du Bois, American author and illustrator (d. 1993)\n*1917 – Fay Kanin, American screenwriter and producer (d. 2013)\n*1918 – Moisis Michail Bourlas, Greek soldier and educator (d. 2011)\n*  1918   – Orville Freeman, American soldier and politician, 16th United States Secretary of Agriculture (d. 2003)\n*  1918   – Mike Wallace, American journalist, media personality and one-time game show host (d. 2012)\n*1919 – Clifford Chadderton, Canadian soldier and journalist (d. 2013)\n*1920 – William Tenn, English-American author and academic (d. 2010)\n*  1920   – Richard Adams, English novelist (d. 2016)\n*1921 – Daniel Berrigan, American priest, poet, and activist (d. 2016)\n*  1921   – Sophie Scholl, German activist (d. 1943)\n*  1921   – Mona Van Duyn, American poet and academic (d. 2004)\n*1923 – Johnny Grant, American radio host and producer (d. 2008)\n*1924 – Bulat Okudzhava, Russian singer, poet, and author (d. 1997)\n*1926 – John Middleton Murry, Jr., English soldier, pilot, and author (d. 2002)\n*1927 – Manfred Eigen, German chemist and academic, Nobel Prize laureate\n*1928 – Ralph Goings, American painter\n*  1928   – Pancho Gonzales, American tennis player (d. 1995)\n*  1928   – Barbara Ann Scott, Canadian figure skater (d. 2012)\n*1930 – Joan Sims, English actress (d. 2001)\n*  1930   – Kalifa Tillisi, Libyan historian and linguist (d. 2010)\n*1931 – Vance D. Brand, American pilot, engineer, and astronaut\n*1932 – Conrad Hunte, Barbadian cricketer (d. 1999)\n*1934 – Alan Bennett, English screenwriter, playwright, and novelist\n*1935 – Nokie Edwards, American guitarist \n*  1935   – Roger Hargreaves, English author and illustrator (d. 1988)\n*1936 – Terry Downes, British boxer and former world middle-weight champion\n*  1936   – Albert Finney, English actor \n*  1936   – Glenda Jackson, English actress and politician \n*1937 – Sonny Curtis, American singer-songwriter and guitarist\n*  1937   – Rafael Moneo, Spanish architect, designed the Cathedral of Our Lady of the Angels and Valladolid Science Museum\n*  1937   – Dave Prater, American singer (d. 1988)\n*1938 – Charles Simic, Serbian-American poet and editor\n*1939 – Ralph Boston, American long jumper\n*  1939   – Pierre Desproges, French journalist and actor (d. 1988)\n*  1939   – Ion Țiriac, Romanian tennis player and manager\n*  1939   – Ken Warby, Australian motorboat racer\n*  1939   – Giorgio Zancanaro, Italian baritone\n*  1939   – John Ogbu, Nigerian-American anthropologist and professor (d. 2003)\n*1940 – James L. Brooks, American director, producer, and screenwriter\n*1941 – Dorothy Hyman, English sprinter\n*  1941   – Danny Rapp, American rock & roll singer (Danny & the Juniors) (d. 1983)\n*1942 – John Ashcroft, American lawyer and politician, 79th United States Attorney General\n*  1942   – Tommy Roe, American singer-songwriter and guitarist\n*1943 – Vince Cable, English economist and politician, former Secretary of State for Business, Innovation and Skills\n*  1943   – Anders Isaksson, Swedish historian and journalist (d. 2009)\n*  1943   – Colin Pillinger, English astronomer, chemist, and academic (d. 2014)\n*1944 – Richie Furay, American singer-songwriter and guitarist \n*1945 – Gamal El-Ghitani, Egyptian journalist and author (d. 2015)\n*  1945   – Jupp Heynckes, German footballer and manager\n*  1945   – Steve Katz, American guitarist, songwriter, and producer \n*1946 – Candice Bergen, American actress and producer\n*  1946   – Ayşe Nur Zarakolu, Turkish author and activist (d. 2002)\n*1947 – Yukiya Amano, Japanese diplomat\n*1948 – Hans Georg Bock, German mathematician, computer scientist, and academic\n*  1948   – John Mahaffey, American golfer\n*  1948   – Steven W. Mosher, American social scientist and author\n*  1948   – Calvin Murphy, American basketball player and radio host\n*1949 – Billy Joel, American singer-songwriter and pianist \n*  1949   – Richard S. Williamson, American lawyer and diplomat, 17th Assistant Secretary of State for International Organization Affairs (d. 2013)\n*1950 – James Butts, American triple jumper\n*  1950   – Tom Petersson, American bass player and songwriter \n*1951 – Alley Mills, American actress\n*1953 – Bruno Brokken, Belgian high jumper\n*1955 – Meles Zenawi, Prime Minister of Ethiopia (d. 2012) \n*  1955   – Anne Sofie von Otter, Swedish soprano and actress\n*1956 – Wendy Crewson, Canadian actress and producer\n*  1956   – Jana Wendt, Australian television host\n*1958 – Graham Smith, Canadian swimmer\n*1959 – Andrew Jones, New Zealand cricketer\n*1960 – Tony Gwynn, American baseball player and coach (d. 2014)\n*1961 – Sean Altman, American singer-songwriter and guitarist \n*  1961   – John Corbett, American actor \n*1962 – Dave Gahan, English singer-songwriter \n*  1962   – Paul Heaton, English singer-songwriter \n*1963 – Joe Cirella, Canadian ice hockey player and coach\n*1965 – Ken Nomura, Japanese race car driver and sportscaster\n*  1965   – Steve Yzerman, Canadian ice hockey player and manager\n*1966 – Mark Tinordi, Canadian ice hockey player and coach\n*1968 – David Benoit, American basketball player\n*  1968   – Masahiko Harada, Japanese ski jumper\n*  1968   – Graham Harman, American philosopher and academic\n*  1968   – Ruth Kelly, British economist and politician, Secretary of State for Transport\n*1970 – Doug Christie, American basketball player\n*  1970   – Ghostface Killah, American rapper and actor \n*1971 – Jason Lee, English footballer and manager\n*  1971   – Dan Chiasson, American poet and critic \n*1972 – Megumi Odaka, Japanese actress and singer\n*1973 – Tegla Loroupe, Kenyan runner\n*  1973   – Leonard Myles-Mills, Ghanaian sprinter\n*1975 – Tamia, Canadian singer-songwriter, producer, and actress\n*  1975   – Brian Deegan, American motocross rider\n*1977 – Averno, Mexican wrestler\n*  1977   – Marek Jankulovski, Czech footballer \n*  1977   – Svein Tuft, Canadian cyclist\n*1978 – Leandro Cufré, Argentinian footballer\n*  1978   – Santiago Dellapè, Argentinian-Italian rugby player\n*  1978   – Aaron Harang, American baseball player\n*1979 – Pierre Bouvier, Canadian singer-songwriter and guitarist \n*  1979   – Rosario Dawson, American actress\n*  1979   – Andrew W.K., American singer-songwriter, multi-instrumentalist, motivational speaker, and music producer\n*1980 – Grant Hackett, Australian swimmer\n*  1980   – Angela Nikodinov, American figure skater\n*  1980   – Tony Schmidt, German race car driver\n*  1980   – Jo Hyun-jae, South Korean actor\n*1981 – Bill Murphy, American baseball player\n*  1981   – Evangelos Tsiolis, Greek footballer\n*1983 – Giacomo Brichetto, Italian footballer\n*  1983   – Alan Campbell, British sculler\n*  1983   – Christos Marangos, Cypriot footballer\n*  1983   – Ryuhei Matsuda, Japanese actor\n*  1983   – Gilles Müller, Luxembourgian tennis player\n*  1983   – Tyler Lumsden, American baseball player\n*  1983   – Leandro Rinaudo, Italian footballer\n*1984 – Prince Fielder, American baseball player\n*  1984   – Chase Headley, American baseball player\n*1985 – Jake Long, American football player\n*  1985   – Henrique Andrade Silva, Brazilian footballer\n*1987 – Scott Bolton, Australian rugby league player\n*  1987   – Kevin Gameiro, French footballer\n*  1987   – Vitaliy Pushkar, Ukrainian race car driver\n*1988 – J. R. Fitzpatrick, Canadian race car driver\n*1989 – Ellen White, English footballer\n*  1991   – Majlinda Kelmendi, Kosovar judoka\n*  1991   – Stasija Rage, Latvian figure skater\n*1992 – Dan Burn, English footballer\n*  1992   – William Hopoate, Australian rugby league player\n*1993 – Ryosuke Yamada, Japanese idol \n*1994 – Ryan Auger, English footballer\n*1996 – Saron Läänmäe, Estonian footballer\n\nDeaths\n\n* 729 – Osric, king of Northumbria\n* 893 – Shi Pu, warlord of the Tang Dynasty\n* 909 – Adalgar, archbishop of Hamburg-Bremen\n* 934 – Wang Sitong, Chinese general and governor (b. 892)\n*1280 – Magnus VI of Norway\n*1315 – Hugh V, Duke of Burgundy (b. 1282)\n*1329 – John Drokensford, Bishop of Bath and Wells\n*1443 – Niccolò Albergati, Italian Cardinal and diplomat (b. 1373)\n*1446 – Mary of Enghien (b. 1368)\n*1590 – Charles de Bourbon French cardinal and pretender to the throne (b. 1523)\n*1657 – William Bradford, English-American politician, 2nd Governor of Plymouth Colony (b. 1590)\n*1707 – Dieterich Buxtehude, German-Danish organist and composer (b. 1637)\n*1736 – Diogo de Mendonça Corte-Real, Portuguese judge and politician (b. 1658)\n*1745 – Tomaso Antonio Vitali, Italian violinist and composer (b. 1663)\n*1747 – John Dalrymple, 2nd Earl of Stair, Scottish field marshal and diplomat, British Ambassador to France (b. 1673)\n*1760 – Nicolaus Zinzendorf, German bishop and saint (b. 1700)\n*1789 – Jean-Baptiste Vaquette de Gribeauval, French general and engineer (b. 1715)\n*1790 – William Clingan, American politician (b. 1721)\n*1791 – Francis Hopkinson, American judge and politician (b. 1737)\n*1805 – Friedrich Schiller, German poet, playwright, and historian (b. 1759)\n*1850 – Joseph Louis Gay-Lussac, French chemist and physicist (b. 1778)\n*  1850   – Garlieb Merkel, Estonian author and activist (b. 1769)\n*1861 – Peter Ernst von Lasaulx, German philologist and politician (b. 1805)\n*1864 – John Sedgwick, American general and educator (b. 1813)\n*1889 – William S. Harney, American general (b. 1800)\n*1906 – Oscar von Gebhardt, German theologian and academic (b. 1844)\n*1914 – C. W. Post, American businessman, founded Post Foods (b. 1854)\n*1915 – François Faber, Luxembourgian-French cyclist and soldier (b. 1887)\n*1915 – Anthony Wilding, New Zealand tennis player and cricketer (b. 1883)\n*1918 – George Coșbuc, Romanian journalist and poet (b. 1866)\n*1931 – Albert Abraham Michelson, German-American physicist and academic, Nobel Prize laureate (b. 1852)\n*1933 – John Arthur Jarvis, English swimmer (b. 1872)\n*1935 – Ernst Bresslau, German zoologist (b. 1877)\n*1938 – Thomas B. Thrige, Danish businessman (b. 1866)\n*1942 – Józef Cebula, Polish priest and saint (b. 1902)\n*1944 – Han Yong-un, Korean poet and social reformer (b. 1879)\n*1949 – Louis II, Prince of Monaco (b. 1870)\n*1950 – Esteban Terradas i Illa, Spanish mathematician and engineer (b. 1883)\n*1957 – Ernest de Silva, Sri Lankan banker and businessman (b. 1887)\n*  1957   – Ezio Pinza, Italian actor and singer (b. 1892)\n*1959 – Bhaurao Patil, Indian activist and educator (b. 1887)\n*1965 – Leopold Figl, Austrian engineer and politician, 18th Chancellor of Austria (b. 1902)\n*1968 – Mercedes de Acosta, American author, poet, and playwright (b. 1893)\n*  1968   – Harold Gray, American cartoonist, created Little Orphan Annie (b. 1894)\n*  1968   – Marion Lorne, American actress (b. 1883)\n*1970 – Walter Reuther, American union leader (b. 1907)\n*1976 – Jens Bjørneboe, Norwegian author, poet, and playwright (b. 1920)\n*  1976   – Ulrike Meinhof, German militant, co-founded the Red Army Faction (b. 1934)\n*1977 – James Jones, American novelist (b. 1921)\n*1978 – Giuseppe Impastato, Italian journalist and activist (b. 1948)\n*  1978   – Aldo Moro, Italian lawyer and politician, 38th Prime Minister of Italy (b. 1916)\n*1979 – Cyrus S. Eaton, Canadian-American banker, businessman, and philanthropist (b. 1883)\n*  1979   – Eddie Jefferson, American singer and lyricist (b. 1918)\n*1980 – Kate Molale, South African activist (b. 1928)\n*1981 – Nelson Algren, American novelist and short story writer (b. 1909)\n*1983 – Henry Bachtold, Australian soldier and railway engineer (b. 1891)\n*1985 – Edmond O'Brien, American actor and director (b. 1915)\n*1986 – Tenzing Norgay, Nepalese mountaineer (b. 1914)\n*1987 – Obafemi Awolowo, Nigerian lawyer and politician (b. 1909)\n*1993 – Penelope Gilliatt, English novelist, short story writer, and critic (b. 1932)\n*1994 – Elias Motsoaledi, South African activist (b. 1924)\n*1997 – Rawya Ateya, Egyptian captain and politician (b. 1926)\n*  1997   – Marco Ferreri, Italian actor, director, and screenwriter (b. 1928)\n*1998 – Alice Faye, American actress and singer (b. 1915)\n*  1998   – Talat Mahmood, Indian singer and actor (b. 1924)\n*2003 – Russell B. Long, American lieutenant, lawyer, and politician (b. 1918)\n*2004 – Akhmad Kadyrov, Chechen cleric and politician, 1st President of the Chechen Republic (b. 1951)\n*  2004   – Alan King, American actor, producer, and screenwriter (b. 1927)\n*  2004   – Brenda Fassie, South African singer (b. 1964)\n*2007 – Dwight Wilson, Canadian soldier (b. 1901)\n*2008 – Jack Gibson, Australian rugby league player, coach, and sportscaster (b. 1929)\n*  2008   – Baptiste Manzini, American football player (b. 1920)\n*  2008   – Nuala O'Faolain, Irish journalist and producer (b. 1942)\n*  2008   – Pascal Sevran, French singer, television host, and author (b. 1945)\n*2009 – Chuck Daly, American basketball player and coach (b. 1930)\n*2010 – Lena Horne, American singer, actress, and activist (b. 1917)\n*  2010   – Otakar Motejl, Czech lawyer and politician (b. 1932)\n*2011 – Wouter Weylandt, Belgian cyclist (b. 1984)\n*2012 – Bertram Cohler, American psychologist, psychoanalyst, and academic (b. 1938)\n*  2012   – Geoffrey Henry, Cook Islander lawyer and politician, 3rd Prime Minister of the Cook Islands (b. 1940)\n*  2012   – Vidal Sassoon, English-American hairdresser and businessman (b. 1928)\n*2013 – Ramón Blanco Rodríguez, Spanish footballer and manager (b. 1952)\n*  2013   – George M. Leader, American soldier and politician, 36th Governor of Pennsylvania (b. 1918)\n*  2013   – Humberto Lugo Gil, Mexican lawyer and politician, 23rd Governor of Hidalgo (b. 1933)\n*  2013   – Ottavio Missoni, Italian hurdler and fashion designer, founded Missoni (b. 1921)\n*2014 – Giacomo Bini, Italian priest and missionary (b. 1938)\n*  2014   – Harlan Mathews, American lawyer and politician (b. 1927)\n*  2014   – Nedurumalli Janardhana Reddy, Indian politician, 12th Chief Minister of Andhra Pradesh (b. 1935)\n*  2014   – Mary Stewart, English-Scottish author and poet (b. 1916)\n*2015 – Edward W. Estlow, American football player and journalist (b. 1920)\n*  2015   – Kenan Evren, Turkish general and politician, 7th President of Turkey (b. 1917)\n*  2015   – Elizabeth Wilson, American actress (b. 1921)\n\nHolidays and observances\n\n*Anniversary of Dianetics (Church of Scientology)\n*Christian feast day:\n**Beatus of Lungern\n**Beatus of Vendome\n**Christopher (Eastern Orthodox Church)\n**George Preca\n**Gerontius of Cervia\n**Gregory of Nazianzen (The Episcopal Church (US) and traditional Roman Catholic calendar)\n**Nicolaus Zinzendorf (Lutheran)\n**Pachomius the Great\n**Tudy of Landevennec\n**May 9 (Eastern Orthodox liturgics)\n*Commemoration of the end of the German occupation of the Channel Islands related observances:\n**Liberation Day, commemorating the end of the German occupation of the Channel Islands during World War II. (Guernsey and Jersey)\n**National Day (Alderney)\n*Europe Day, commemorating the Schuman Declaration. (European Union)\n*Victory Day observances, celebration of the Soviet Union victory over Nazi Germany (Soviet Union, Azerbaijan, Belarus, Bosnia and Herzegovina, Georgia, Israel, Kazakhstan, Kyrgyzstan, Moldova, Russia, Serbia, Tajikistan, Turkmenistan, Ukraine, Uzbekistan)\n**Victory and Peace Day, marks the capture of Shusha (1992) in the Nagorno-Karabakh War, and the end of World War II. (Armenia)\n**Victory Day over Nazism in World War II (Ukraine)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "May 9" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19524" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*1092 – Lincoln Cathedral is consecrated.\n*1386 – England and Portugal formally ratify their alliance with the signing of the Treaty of Windsor, making it the oldest diplomatic alliance in the world which is still in force.\n*1450 – 'Abd al-Latif (Timurid monarch) is assassinated.\n*1540 – Hernando de Alarcón sets sail on an expedition to the Gulf of California.\n*1662 – The figure who later became Mr. Punch  made his first recorded appearance in England.\n*1671 – Thomas Blood, disguised as a clergyman, attempts to steal England's Crown Jewels from the Tower of London.\n*1726 – Five men arrested during a raid on Mother Clap's molly house in London are executed at Tyburn.\n*1763 – The Siege of Fort Detroit begins during Pontiac's War against British forces.\n*1864 – Second Schleswig War: The Danish navy defeats the Austrian and Prussian fleets in the Battle of Heligoland.\n*1865 – American Civil War: Nathan Bedford Forrest surrenders his forces at Gainesville, Alabama.\n*  1865   – American Civil War: President Andrew Johnson issues a proclamation ending belligerent rights of the rebels and enjoining foreign nations to intern or expel Confederate ships.\n*1873 – Der Krach: Vienna stock market crash heralds the Long Depression.\n*1874 – The first horse-drawn bus makes its début in the city of Mumbai, traveling two routes.\n*1877 – Mihail Kogălniceanu reads, in the Chamber of Deputies, the Declaration of Independence of Romania. This day became the Independence Day of Romania.\n*  1877   – A magnitude 8.8 earthquake off the coast of Peru kills 2,541, including some as far away as Hawaii and Japan.\n*1887 – Buffalo Bill Cody's Wild West Show opens in London.\n*1901 – Australia opens its first parliament in Melbourne.\n*1904 – The steam locomotive City of Truro becomes the first steam engine in Europe to exceed 100 mph.\n*1911 – The works of Gabriele D'Annunzio are placed in the Index of Forbidden Books by the Vatican.\n*1915 – World War I: Second Battle of Artois between German and French forces.\n*1918 – World War I: Germany repels Britain's second attempt to blockade the port of Ostend, Belgium.\n*1920 – Polish–Soviet War: The Polish army under General Edward Rydz-Śmigły celebrates its capture of Kiev with a victory parade on Khreshchatyk.\n*1926 – Admiral Richard E. Byrd and Floyd Bennett claim to have flown over the North Pole (later discovery of Byrd's diary appears to cast some doubt on the claim.)\n*1936 – Italy formally annexes Ethiopia after taking the capital Addis Ababa on May 5.\n*1940 – World War II: The German submarine U-9 sinks the French coastal submarine Doris near Den Helder.\n*1941 – World War II: The German submarine U-110 is captured by the Royal Navy. On board is the latest Enigma machine which Allied cryptographers later use to break coded German messages.\n*1942 – Holocaust: The SS executes 588 Jewish residents of the Podolian town of Zinkiv (Khmelnytska oblast, Ukraine). The Zoludek Ghetto (in Belarus) is destroyed and all its inhabitants executed or deported.\n*1945 – World War II: The final German Instrument of Surrender is signed at the Soviet headquarters in Berlin-Karlshorst.\n*  1945   – World War II: The Channel Islands are liberated by the British after five years of German occupation.\n*1946 – King Victor Emmanuel III of Italy abdicates and is succeeded by Umberto II.\n*1948 – Czechoslovakia's Ninth-of-May Constitution comes into effect.\n*1949 – Rainier III becomes Prince of Monaco.\n*1950 – Robert Schuman presents his proposal on the creation of an organized Europe, which according to him was indispensable to the maintenance of peaceful relations. This proposal, known as the \"Schuman Declaration\", is considered by some people to be the beginning of the creation of what is now the European Union.\n*1955 – Cold War: West Germany joins NATO.\n*1958 – Film: Vertigo has world premiere in San Francisco.\n*1960 – The Food and Drug Administration announces it will approve birth control as an additional indication for Searle's Enovid, making Enovid the world's first approved oral contraceptive pill.\n*1961 – FCC Chairman Newton N. Minow gives his Wasteland Speech.\n*1964 – Ngô Đình Cẩn, de facto ruler of central Vietnam under his brother President Ngô Đình Diệm before the family's toppling, is executed.\n*1969 – Carlos Lamarca leads the first urban guerrilla action against the military dictatorship of Brazil in São Paulo, by robbing two banks.\n*1970 – Vietnam War: In Washington, D.C., 75,000 to 100,000 war protesters demonstrate in front of the White House.\n*1974 – Watergate scandal: The  United States House Committee on the Judiciary opens formal and public impeachment hearings against President Richard Nixon.\n*1977 – Hotel Polen fire: A disastrous fire burns down the Hotel Polen in Amsterdam causing 33 deaths and 21 severe injuries.\n*1979 – Iranian Jewish businessman Habib Elghanian is executed by firing squad in Tehran, prompting the mass exodus of the once 100,000-strong Jewish community of Iran.\n*1980 – In Florida, Liberian freighter  collides with the Sunshine Skyway Bridge over Tampa Bay, making a 1,400-ft. section of the southbound span collapse.  Thirty-five people in six cars and a Greyhound bus fall 150 ft. into the water and die.\n*  1980   – In Norco, California, five masked gunmen hold up a Security Pacific bank, leading to a violent shoot-out and one of the largest pursuits in California history. Two of the gunmen and one police officer are killed and thirty-three police and civilian vehicles are destroyed in the chase.\n*1987 – LOT Flight 5055 Tadeusz Kościuszko crashes after takeoff in Warsaw, Poland, killing all 183 people on board.\n*1992 – Armenian forces capture Shusha, marking a major turning point in the Nagorno-Karabakh War.\n*1992 – Westray Mine disaster kills 26 workers in Nova Scotia, Canada.\n*2001 – In Ghana, 129 football fans die in what  became known as the Accra Sports Stadium disaster. The deaths are caused by a stampede (caused by the firing of teargas by police personnel at the stadium) that followed a controversial decision by the referee.\n*2002 – The 38-day stand-off in the Church of the Nativity in Bethlehem comes to an end when the Palestinians inside agree to have 13 suspected terrorists among them deported to several different countries.\n*2012 – A Sukhoi Superjet 100 aircraft crashes into Mount Salak in West Java, Indonesia, killing 45 people.\n*2015 – An Airbus A400M Atlas military transport aircraft crashes near the Spanish city of Seville with three people on board killed.\n*  2015   – Russia stages its biggest ever military parade in Moscow's Red Square to commemorate the 70th anniversary of Victory Day.\n\nBirths\n\n*1147 – Minamoto no Yoritomo, Japanese shogun (d. 1199)\n*1170 – Valdemar II of Denmark (d. 1241)\n*1540 – Maharana Pratap, Indian ruler (d. 1597)\n*1555 – Jerónima de la Asunción, Catholic nun and founder of the first monastery in Manila (d. 1630)\n*1594 – Louis Henry, Prince of Nassau-Dillenburg, Military leader in the Thirty Years' War (d. 1662)\n*1617 – Frederick, Landgrave of Hesse-Eschwege (d. 1655)\n*1740 – Giovanni Paisiello, Italian composer and educator (d. 1816)\n*1746 – Gaspard Monge, French mathematician and engineer (d. 1818)\n*1763 – János Batsányi, Hungarian-Austrian poet and author (d. 1845)\n*1800 – John Brown, American activist (d. 1859)\n*1801 – Peter Hesketh-Fleetwood, English politician, founded the town of Fleetwood (d. 1866)\n*1814 – John Brougham, Irish-American actor and playwright (d. 1880)\n*1823 – Frederick Weld, English-New Zealand politician, 6th Prime Minister of New Zealand (d. 1891)\n*1824 – Jacob ben Moses Bachrach, Polish apologist and author (d. 1896)\n*1825 – James Collinson, Victorian painter (d. 1881) \n*1836 – Ferdinand Monoyer, French ophthalmologist, invented the Monoyer chart (d. 1912)\n*1837 – Adam Opel, German engineer, founded the Opel Company (d. 1895)\n*1845 – Gustaf de Laval, Swedish engineer and businessman (d. 1913)\n*1850 – Edward Weston (chemist), English-American chemist (d. 1936)\n*1855 – Julius Röntgen, German-Dutch composer (d. 1932)\n*1860 – J. M. Barrie, Scottish novelist and playwright (d. 1937)\n*1866 – Gopal Krishna Gokhale, Indian economist and politician (d. 1915)\n*1870 – Harry Vardon, British golfer (d. 1937)\n*1873 – Anton Cermak, Czech-American captain and politician, 44th Mayor of Chicago (d. 1933)\n*1874 – Howard Carter, English archaeologist and historian (d. 1939)\n*1882 – George Barker, American painter (d. 1965)\n*  1882   – Henry J. Kaiser, American shipbuilder and businessman, founded Kaiser Shipyards (d. 1967)\n*1883 – José Ortega y Gasset, Spanish philosopher, author, and critic (d. 1955)\n*1884 – Valdemar Psilander, Danish actor (d. 1917)\n*1888 – Francesco Baracca, Italian fighter pilot (d. 1918)\n*1893 – William Moulton Marston, American psychologist and author (d. 1947)\n*1895 – Richard Barthelmess, American actor (d. 1963)\n*  1895   – Lucian Blaga, Romanian poet, playwright, and philosopher (d. 1961)\n*  1895   – Frank Foss, American pole vaulter (d. 1989)\n*1896 – Richard Day, Canadian-American art director and set decorator (d. 1972)\n*1888 – Rolf de Maré, Swedish art collector (d. 1964)\n*1900 – Maria Malicka, Polish stage and film actress (d. 1992) \n*1904 – Conrad Bernier, Canadian-American organist, composer, and educator (d. 1988)\n*1906 – Eleanor Estes, American librarian, author, and illustrator (d. 1988)\n*1907 – Jackie Grant, Trinidadian cricketer (d. 1978)\n*  1907   – Kathryn Kuhlman, American evangelist and author (d. 1976)\n*  1907   – Baldur von Schirach, German politician (d. 1974)\n*1909 – Don Messer, Canadian violinist (d. 1973)\n*  1909   – Gordon Bunshaft, American architect, designed the Solow Building (d. 1990)\n*1911 – Harry Simeone, American music arranger, conductor, and composer (d. 2005)\n*1912 – Pedro Armendáriz, Mexican-American actor (d. 1963)\n*  1912   – Per Imerslund, Norwegian-German soldier and author (d. 1943)\n*  1912   – Géza Ottlik, Hungarian mathematician and theorist (d. 1990)\n*1914 – Denham Fouts, American prostitute (d. 1948)\n*  1914   – Carlo Maria Giulini, Italian conductor and director (d. 2005)\n*  1914   – Hank Snow, American country music singer-songwriter and guitarist (d. 1999)\n*1916 – William Pène du Bois, American author and illustrator (d. 1993)\n*1917 – Fay Kanin, American screenwriter and producer (d. 2013)\n*1918 – Moisis Michail Bourlas, Greek soldier and educator (d. 2011)\n*  1918   – Orville Freeman, American soldier and politician, 16th United States Secretary of Agriculture (d. 2003)\n*  1918   – Mike Wallace, American journalist, media personality and one-time game show host (d. 2012)\n*1919 – Clifford Chadderton, Canadian soldier and journalist (d. 2013)\n*1920 – William Tenn, English-American author and academic (d. 2010)\n*  1920   – Richard Adams, English novelist (d. 2016)\n*1921 – Daniel Berrigan, American priest, poet, and activist (d. 2016)\n*  1921   – Sophie Scholl, German activist (d. 1943)\n*  1921   – Mona Van Duyn, American poet and academic (d. 2004)\n*1923 – Johnny Grant, American radio host and producer (d. 2008)\n*1924 – Bulat Okudzhava, Russian singer, poet, and author (d. 1997)\n*1926 – John Middleton Murry, Jr., English soldier, pilot, and author (d. 2002)\n*1927 – Manfred Eigen, German chemist and academic, Nobel Prize laureate\n*1928 – Ralph Goings, American painter\n*  1928   – Pancho Gonzales, American tennis player (d. 1995)\n*  1928   – Barbara Ann Scott, Canadian figure skater (d. 2012)\n*1930 – Joan Sims, English actress (d. 2001)\n*  1930   – Kalifa Tillisi, Libyan historian and linguist (d. 2010)\n*1931 – Vance D. Brand, American pilot, engineer, and astronaut\n*1932 – Conrad Hunte, Barbadian cricketer (d. 1999)\n*1934 – Alan Bennett, English screenwriter, playwright, and novelist\n*1935 – Nokie Edwards, American guitarist \n*  1935   – Roger Hargreaves, English author and illustrator (d. 1988)\n*1936 – Terry Downes, British boxer and former world middle-weight champion\n*  1936   – Albert Finney, English actor \n*  1936   – Glenda Jackson, English actress and politician \n*1937 – Sonny Curtis, American singer-songwriter and guitarist\n*  1937   – Rafael Moneo, Spanish architect, designed the Cathedral of Our Lady of the Angels and Valladolid Science Museum\n*  1937   – Dave Prater, American singer (d. 1988)\n*1938 – Charles Simic, Serbian-American poet and editor\n*1939 – Ralph Boston, American long jumper\n*  1939   – Pierre Desproges, French journalist and actor (d. 1988)\n*  1939   – Ion Țiriac, Romanian tennis player and manager\n*  1939   – Ken Warby, Australian motorboat racer\n*  1939   – Giorgio Zancanaro, Italian baritone\n*  1939   – John Ogbu, Nigerian-American anthropologist and professor (d. 2003)\n*1940 – James L. Brooks, American director, producer, and screenwriter\n*1941 – Dorothy Hyman, English sprinter\n*  1941   – Danny Rapp, American rock & roll singer (Danny & the Juniors) (d. 1983)\n*1942 – John Ashcroft, American lawyer and politician, 79th United States Attorney General\n*  1942   – Tommy Roe, American singer-songwriter and guitarist\n*1943 – Vince Cable, English economist and politician, former Secretary of State for Business, Innovation and Skills\n*  1943   – Anders Isaksson, Swedish historian and journalist (d. 2009)\n*  1943   – Colin Pillinger, English astronomer, chemist, and academic (d. 2014)\n*1944 – Richie Furay, American singer-songwriter and guitarist \n*1945 – Gamal El-Ghitani, Egyptian journalist and author (d. 2015)\n*  1945   – Jupp Heynckes, German footballer and manager\n*  1945   – Steve Katz, American guitarist, songwriter, and producer \n*1946 – Candice Bergen, American actress and producer\n*  1946   – Ayşe Nur Zarakolu, Turkish author and activist (d. 2002)\n*1947 – Yukiya Amano, Japanese diplomat\n*1948 – Hans Georg Bock, German mathematician, computer scientist, and academic\n*  1948   – John Mahaffey, American golfer\n*  1948   – Steven W. Mosher, American social scientist and author\n*  1948   – Calvin Murphy, American basketball player and radio host\n*1949 – Billy Joel, American singer-songwriter and pianist \n*  1949   – Richard S. Williamson, American lawyer and diplomat, 17th Assistant Secretary of State for International Organization Affairs (d. 2013)\n*1950 – James Butts, American triple jumper\n*  1950   – Tom Petersson, American bass player and songwriter \n*1951 – Alley Mills, American actress\n*1953 – Bruno Brokken, Belgian high jumper\n*1955 – Meles Zenawi, Prime Minister of Ethiopia (d. 2012) \n*  1955   – Anne Sofie von Otter, Swedish soprano and actress\n*1956 – Wendy Crewson, Canadian actress and producer\n*  1956   – Jana Wendt, Australian television host\n*1958 – Graham Smith, Canadian swimmer\n*1959 – Andrew Jones, New Zealand cricketer\n*1960 – Tony Gwynn, American baseball player and coach (d. 2014)\n*1961 – Sean Altman, American singer-songwriter and guitarist \n*  1961   – John Corbett, American actor \n*1962 – Dave Gahan, English singer-songwriter \n*  1962   – Paul Heaton, English singer-songwriter \n*1963 – Joe Cirella, Canadian ice hockey player and coach\n*1965 – Ken Nomura, Japanese race car driver and sportscaster\n*  1965   – Steve Yzerman, Canadian ice hockey player and manager\n*1966 – Mark Tinordi, Canadian ice hockey player and coach\n*1968 – David Benoit, American basketball player\n*  1968   – Masahiko Harada, Japanese ski jumper\n*  1968   – Graham Harman, American philosopher and academic\n*  1968   – Ruth Kelly, British economist and politician, Secretary of State for Transport\n*1970 – Doug Christie, American basketball player\n*  1970   – Ghostface Killah, American rapper and actor \n*1971 – Jason Lee, English footballer and manager\n*  1971   – Dan Chiasson, American poet and critic \n*1972 – Megumi Odaka, Japanese actress and singer\n*1973 – Tegla Loroupe, Kenyan runner\n*  1973   – Leonard Myles-Mills, Ghanaian sprinter\n*1975 – Tamia, Canadian singer-songwriter, producer, and actress\n*  1975   – Brian Deegan, American motocross rider\n*1977 – Averno, Mexican wrestler\n*  1977   – Marek Jankulovski, Czech footballer \n*  1977   – Svein Tuft, Canadian cyclist\n*1978 – Leandro Cufré, Argentinian footballer\n*  1978   – Santiago Dellapè, Argentinian-Italian rugby player\n*  1978   – Aaron Harang, American baseball player\n*1979 – Pierre Bouvier, Canadian singer-songwriter and guitarist \n*  1979   – Rosario Dawson, American actress\n*  1979   – Andrew W.K., American singer-songwriter, multi-instrumentalist, motivational speaker, and music producer\n*1980 – Grant Hackett, Australian swimmer\n*  1980   – Angela Nikodinov, American figure skater\n*  1980   – Tony Schmidt, German race car driver\n*  1980   – Jo Hyun-jae, South Korean actor\n*1981 – Bill Murphy, American baseball player\n*  1981   – Evangelos Tsiolis, Greek footballer\n*1983 – Giacomo Brichetto, Italian footballer\n*  1983   – Alan Campbell, British sculler\n*  1983   – Christos Marangos, Cypriot footballer\n*  1983   – Ryuhei Matsuda, Japanese actor\n*  1983   – Gilles Müller, Luxembourgian tennis player\n*  1983   – Tyler Lumsden, American baseball player\n*  1983   – Leandro Rinaudo, Italian footballer\n*1984 – Prince Fielder, American baseball player\n*  1984   – Chase Headley, American baseball player\n*1985 – Jake Long, American football player\n*  1985   – Henrique Andrade Silva, Brazilian footballer\n*1987 – Scott Bolton, Australian rugby league player\n*  1987   – Kevin Gameiro, French footballer\n*  1987   – Vitaliy Pushkar, Ukrainian race car driver\n*1988 – J. R. Fitzpatrick, Canadian race car driver\n*1989 – Ellen White, English footballer\n*  1991   – Majlinda Kelmendi, Kosovar judoka\n*  1991   – Stasija Rage, Latvian figure skater\n*1992 – Dan Burn, English footballer\n*  1992   – William Hopoate, Australian rugby league player\n*1993 – Ryosuke Yamada, Japanese idol \n*1994 – Ryan Auger, English footballer\n*1996 – Saron Läänmäe, Estonian footballer\n\nDeaths\n\n* 729 – Osric, king of Northumbria\n* 893 – Shi Pu, warlord of the Tang Dynasty\n* 909 – Adalgar, archbishop of Hamburg-Bremen\n* 934 – Wang Sitong, Chinese general and governor (b. 892)\n*1280 – Magnus VI of Norway\n*1315 – Hugh V, Duke of Burgundy (b. 1282)\n*1329 – John Drokensford, Bishop of Bath and Wells\n*1443 – Niccolò Albergati, Italian Cardinal and diplomat (b. 1373)\n*1446 – Mary of Enghien (b. 1368)\n*1590 – Charles de Bourbon French cardinal and pretender to the throne (b. 1523)\n*1657 – William Bradford, English-American politician, 2nd Governor of Plymouth Colony (b. 1590)\n*1707 – Dieterich Buxtehude, German-Danish organist and composer (b. 1637)\n*1736 – Diogo de Mendonça Corte-Real, Portuguese judge and politician (b. 1658)\n*1745 – Tomaso Antonio Vitali, Italian violinist and composer (b. 1663)\n*1747 – John Dalrymple, 2nd Earl of Stair, Scottish field marshal and diplomat, British Ambassador to France (b. 1673)\n*1760 – Nicolaus Zinzendorf, German bishop and saint (b. 1700)\n*1789 – Jean-Baptiste Vaquette de Gribeauval, French general and engineer (b. 1715)\n*1790 – William Clingan, American politician (b. 1721)\n*1791 – Francis Hopkinson, American judge and politician (b. 1737)\n*1805 – Friedrich Schiller, German poet, playwright, and historian (b. 1759)\n*1850 – Joseph Louis Gay-Lussac, French chemist and physicist (b. 1778)\n*  1850   – Garlieb Merkel, Estonian author and activist (b. 1769)\n*1861 – Peter Ernst von Lasaulx, German philologist and politician (b. 1805)\n*1864 – John Sedgwick, American general and educator (b. 1813)\n*1889 – William S. Harney, American general (b. 1800)\n*1906 – Oscar von Gebhardt, German theologian and academic (b. 1844)\n*1914 – C. W. Post, American businessman, founded Post Foods (b. 1854)\n*1915 – François Faber, Luxembourgian-French cyclist and soldier (b. 1887)\n*1915 – Anthony Wilding, New Zealand tennis player and cricketer (b. 1883)\n*1918 – George Coșbuc, Romanian journalist and poet (b. 1866)\n*1931 – Albert Abraham Michelson, German-American physicist and academic, Nobel Prize laureate (b. 1852)\n*1933 – John Arthur Jarvis, English swimmer (b. 1872)\n*1935 – Ernst Bresslau, German zoologist (b. 1877)\n*1938 – Thomas B. Thrige, Danish businessman (b. 1866)\n*1942 – Józef Cebula, Polish priest and saint (b. 1902)\n*1944 – Han Yong-un, Korean poet and social reformer (b. 1879)\n*1949 – Louis II, Prince of Monaco (b. 1870)\n*1950 – Esteban Terradas i Illa, Spanish mathematician and engineer (b. 1883)\n*1957 – Ernest de Silva, Sri Lankan banker and businessman (b. 1887)\n*  1957   – Ezio Pinza, Italian actor and singer (b. 1892)\n*1959 – Bhaurao Patil, Indian activist and educator (b. 1887)\n*1965 – Leopold Figl, Austrian engineer and politician, 18th Chancellor of Austria (b. 1902)\n*1968 – Mercedes de Acosta, American author, poet, and playwright (b. 1893)\n*  1968   – Harold Gray, American cartoonist, created Little Orphan Annie (b. 1894)\n*  1968   – Marion Lorne, American actress (b. 1883)\n*1970 – Walter Reuther, American union leader (b. 1907)\n*1976 – Jens Bjørneboe, Norwegian author, poet, and playwright (b. 1920)\n*  1976   – Ulrike Meinhof, German militant, co-founded the Red Army Faction (b. 1934)\n*1977 – James Jones, American novelist (b. 1921)\n*1978 – Giuseppe Impastato, Italian journalist and activist (b. 1948)\n*  1978   – Aldo Moro, Italian lawyer and politician, 38th Prime Minister of Italy (b. 1916)\n*1979 – Cyrus S. Eaton, Canadian-American banker, businessman, and philanthropist (b. 1883)\n*  1979   – Eddie Jefferson, American singer and lyricist (b. 1918)\n*1980 – Kate Molale, South African activist (b. 1928)\n*1981 – Nelson Algren, American novelist and short story writer (b. 1909)\n*1983 – Henry Bachtold, Australian soldier and railway engineer (b. 1891)\n*1985 – Edmond O'Brien, American actor and director (b. 1915)\n*1986 – Tenzing Norgay, Nepalese mountaineer (b. 1914)\n*1987 – Obafemi Awolowo, Nigerian lawyer and politician (b. 1909)\n*1993 – Penelope Gilliatt, English novelist, short story writer, and critic (b. 1932)\n*1994 – Elias Motsoaledi, South African activist (b. 1924)\n*1997 – Rawya Ateya, Egyptian captain and politician (b. 1926)\n*  1997   – Marco Ferreri, Italian actor, director, and screenwriter (b. 1928)\n*1998 – Alice Faye, American actress and singer (b. 1915)\n*  1998   – Talat Mahmood, Indian singer and actor (b. 1924)\n*2003 – Russell B. Long, American lieutenant, lawyer, and politician (b. 1918)\n*2004 – Akhmad Kadyrov, Chechen cleric and politician, 1st President of the Chechen Republic (b. 1951)\n*  2004   – Alan King, American actor, producer, and screenwriter (b. 1927)\n*  2004   – Brenda Fassie, South African singer (b. 1964)\n*2007 – Dwight Wilson, Canadian soldier (b. 1901)\n*2008 – Jack Gibson, Australian rugby league player, coach, and sportscaster (b. 1929)\n*  2008   – Baptiste Manzini, American football player (b. 1920)\n*  2008   – Nuala O'Faolain, Irish journalist and producer (b. 1942)\n*  2008   – Pascal Sevran, French singer, television host, and author (b. 1945)\n*2009 – Chuck Daly, American basketball player and coach (b. 1930)\n*2010 – Lena Horne, American singer, actress, and activist (b. 1917)\n*  2010   – Otakar Motejl, Czech lawyer and politician (b. 1932)\n*2011 – Wouter Weylandt, Belgian cyclist (b. 1984)\n*2012 – Bertram Cohler, American psychologist, psychoanalyst, and academic (b. 1938)\n*  2012   – Geoffrey Henry, Cook Islander lawyer and politician, 3rd Prime Minister of the Cook Islands (b. 1940)\n*  2012   – Vidal Sassoon, English-American hairdresser and businessman (b. 1928)\n*2013 – Ramón Blanco Rodríguez, Spanish footballer and manager (b. 1952)\n*  2013   – George M. Leader, American soldier and politician, 36th Governor of Pennsylvania (b. 1918)\n*  2013   – Humberto Lugo Gil, Mexican lawyer and politician, 23rd Governor of Hidalgo (b. 1933)\n*  2013   – Ottavio Missoni, Italian hurdler and fashion designer, founded Missoni (b. 1921)\n*2014 – Giacomo Bini, Italian priest and missionary (b. 1938)\n*  2014   – Harlan Mathews, American lawyer and politician (b. 1927)\n*  2014   – Nedurumalli Janardhana Reddy, Indian politician, 12th Chief Minister of Andhra Pradesh (b. 1935)\n*  2014   – Mary Stewart, English-Scottish author and poet (b. 1916)\n*2015 – Edward W. Estlow, American football player and journalist (b. 1920)\n*  2015   – Kenan Evren, Turkish general and politician, 7th President of Turkey (b. 1917)\n*  2015   – Elizabeth Wilson, American actress (b. 1921)\n\nHolidays and observances\n\n*Anniversary of Dianetics (Church of Scientology)\n*Christian feast day:\n**Beatus of Lungern\n**Beatus of Vendome\n**Christopher (Eastern Orthodox Church)\n**George Preca\n**Gerontius of Cervia\n**Gregory of Nazianzen (The Episcopal Church (US) and traditional Roman Catholic calendar)\n**Nicolaus Zinzendorf (Lutheran)\n**Pachomius the Great\n**Tudy of Landevennec\n**May 9 (Eastern Orthodox liturgics)\n*Commemoration of the end of the German occupation of the Channel Islands related observances:\n**Liberation Day, commemorating the end of the German occupation of the Channel Islands during World War II. (Guernsey and Jersey)\n**National Day (Alderney)\n*Europe Day, commemorating the Schuman Declaration. (European Union)\n*Victory Day observances, celebration of the Soviet Union victory over Nazi Germany (Soviet Union, Azerbaijan, Belarus, Bosnia and Herzegovina, Georgia, Israel, Kazakhstan, Kyrgyzstan, Moldova, Russia, Serbia, Tajikistan, Turkmenistan, Ukraine, Uzbekistan)\n**Victory and Peace Day, marks the capture of Shusha (1992) in the Nagorno-Karabakh War, and the end of World War II. (Armenia)\n**Victory Day over Nazism in World War II (Ukraine). May 9. http://en.wikipedia.org/?curid=19524."
  }
}
