{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7522",
  "eid" : "e2088ba0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778458970,
  "textBody" : "Calorimetry is the science or act of measuring changes in state variables of a body for the purpose of deriving the heat transfer associated with changes of its state due, for example, to chemical reactions, physical changes, or phase transitions under specified constraints.   Calorimetry is performed with a calorimeter. The word calorimetry is derived from the Latin word calor, meaning heat and the Greek word μέτρον (metron), meaning measure.  Scottish physician and scientist Joseph Black, who was the first to recognize the distinction between heat and temperature, is said to be the founder of the science of calorimetry.\n\nIndirect calorimetry calculates heat that living organisms produce by measuring either their production of carbon dioxide and nitrogen waste (frequently ammonia in aquatic organisms, or urea in terrestrial ones), or from their consumption of oxygen. \nLavoisier noted in 1780 that heat production can be predicted from oxygen consumption this way, using multiple regression. The dynamic energy budget theory explains why this procedure is correct. Heat generated by living organisms may also be measured by direct calorimetry, in which the entire organism is placed inside the calorimeter for the measurement.\n\nA widely used modern instrument is the differential scanning calorimeter, a device which allows thermal data to be obtained on small amounts of material. It involves heating the sample at a controlled rate and recording the heat flow either into or from the specimen.\n\nClassical calorimetric calculation of heat\n\nCases with differentiable equation of state for a one-component body\n\nBasic classical calculation with respect to volume\n\nCalorimetry requires that a reference material that changes temperature have known definite thermal constitutive properties. The classical rule, recognized by Clausius and by Kelvin, is that the pressure exerted by the calorimetric material is fully and rapidly determined solely by its temperature and volume; this rule is for changes that do not involve phase change, such as melting of ice. There are many materials that do not comply with this rule, and for them, the present formula of classical calorimetry does not provide an adequate account. Here the classical rule is assumed to hold for the calorimetric material being used, and the propositions are mathematically written:\n\nThe thermal response of the calorimetric material is fully described by its pressure p\\  as the value of its constitutive function p(V,T)\\  of just the volume V\\  and the temperature T\\ . All increments are here required to be very small. This calculation refers to a domain of volume and temperature of the body in which no phase change occurs, and there is only one phase present. An important assumption here is continuity of property relations. A different analysis is needed for phase change\n\nWhen a small increment of heat is gained by a calorimetric body, with small increments, \\delta V\\  of its volume, and \\delta T\\  of its temperature, the increment of heat, \\delta Q\\ , gained by the body of calorimetric material, is given by\n\n\\delta Q\\ =C^{(V)}_T(V,T)\\, \\delta V\\,+\\,C^{(T)}_V(V,T)\\,\\delta T\n\nwhere\n\nC^{(V)}_T(V,T)\\  denotes the latent heat with respect to volume, of the calorimetric material at constant controlled temperature T. The surroundings' pressure on the material is instrumentally adjusted to impose a chosen volume change, with initial volume V\\ . To determine this latent heat, the volume change is effectively the independently instrumentally varied quantity. This latent heat is not one of the widely used ones, but is of theoretical or conceptual interest.\nC^{(T)}_V(V,T)\\  denotes the heat capacity, of the calorimetric material at fixed constant volume V\\ , while the pressure of the material is allowed to vary freely, with initial temperature T\\ . The temperature is forced to change by exposure to a suitable heat bath. It is customary to write C^{(T)}_V(V,T)\\  simply as C_V(V,T)\\ , or even more briefly as C_V\\ . This latent heat is one of the two widely used ones.Bryan, G.H. (1907), pages 21–22.Partington, J.R. (1949), pages 155–157.Prigogine, I., Defay, R. (1950/1954). Chemical Thermodynamics, Longmans, Green & Co, London, pages 22-23.Crawford, F.H. (1963), Section 5.9, pp. 120–121.Adkins, C.J. (1975), Section 3.6, pages 43-46.Truesdell, C., Bharatha, S. (1977), pages 20-21.Landsberg, P.T. (1978), page 11.\n\nThe latent heat with respect to volume is the heat required for unit increment in volume at constant temperature. It can be said to be 'measured along an isotherm', and the pressure the material exerts is allowed to vary freely, according to its constitutive law p=p(V,T)\\ . For a given material, it can have a positive or negative sign or exceptionally it can be zero, and this can depend on the temperature, as it does for water about 4 C.Maxwell, J.C. (1872), pages 232-233.Lewis, G.N., Randall, M. (1923/1961), pages 378-379.Truesdell, C., Bharatha, S. (1977), pages 9-10, 15-18, 36-37.Truesdell, C.A. (1980). The Tragicomical History of Thermodynamics, 1822–1854, Springer, New York, . The concept of latent heat with respect to volume was perhaps first recognized by Joseph Black in 1762.Lewis, G.N., Randall, M. (1923/1961), page 29. The term 'latent heat of expansion' is also used.Maxwell, J.C. (1872), page 73. The latent heat with respect to volume can also be called the 'latent energy with respect to volume'. For all of these usages of 'latent heat', a more systematic terminology uses 'latent heat capacity'.\n\nThe heat capacity at constant volume is the heat required for unit increment in temperature at constant volume. It can be said to be 'measured along an isochor', and again, the pressure the material exerts is allowed to vary freely. It always has a positive sign. This means that for an increase in the temperature of a body without change of its volume, heat must be supplied to it. This is consistent with common experience.\n\nQuantities like \\delta Q\\  are sometimes called 'curve differentials', because they are measured along curves in the (V,T)\\  surface.\n\nClassical theory for constant-volume calorimetry\n\nConstant-volume calorimetry is calorimetry performed at a constant volume. This involves the use of a constant-volume calorimeter. Heat is still measured by the above-stated principle of calorimetry.\n\nThis means that in a suitably constructed calorimeter, called a bomb calorimeter, the increment of volume \\delta V\\  can be made to vanish, \\delta V=0\\ . For constant-volume calorimetry:\n\n\\delta Q = C_V \\delta T\\ \n\nwhere\n\n\\delta T\\  denotes the increment in temperature and\nC_V\\  denotes the heat capacity at constant volume.\n\nClassical heat calculation with respect to pressure\n\nFrom the above rule of calculation of heat with respect to volume, there follows one with respect to pressure.Crawford, F.H. (1963), Section 5.10, pp. 121–122.Truesdell, C., Bharatha, S. (1977), page 23.\n\nIn a process of small increments, \\delta p\\  of its pressure, and \\delta T\\  of its temperature, the increment of heat, \\delta Q\\ , gained by the body of calorimetric material, is given by\n\n\\delta Q\\ =C^{(p)}_T(p,T)\\, \\delta p\\,+\\,C^{(T)}_p(p,T)\\,\\delta T\n\nwhere\n\nC^{(p)}_T(p,T)\\  denotes the latent heat with respect to pressure, of the calorimetric material at constant temperature, while the volume and pressure of the body are allowed to vary freely, at pressure p\\  and temperature T\\ ;\nC^{(T)}_p(p,T)\\  denotes the heat capacity, of the calorimetric material at constant pressure, while the temperature and volume of the body are allowed to vary freely, at pressure p\\  and temperature T\\ . It is customary to write C^{(T)}_p(p,T)\\  simply as C_p(p,T)\\ , or even more briefly as C_p\\ .\n\nThe new quantities here are related to the previous ones:Crawford, F.H. (1963), Section 5.11, pp. 123–124.\n\nC^{(p)}_T(p,T)=\\frac{C^{(V)}_T(V,T)}{\\left.\\cfrac{\\partial p}{\\partial V}\\right|_{(V,T)}} \n\nC^{(T)}_p(p,T)=C^{(T)}_V(V,T)-C^{(V)}_T(V,T) \\frac{\\left.\\cfrac{\\partial p}{\\partial T}\\right|_{(V,T)}}{\\left.\\cfrac{\\partial p}{\\partial V}\\right|_{(V,T)}} \nwhere\n\\left.\\frac{\\partial p}{\\partial V}\\right|_{(V,T)} denotes the partial derivative of p(V,T)\\  with respect to V\\  evaluated for (V,T)\\ \n\nand\n\n\\left.\\frac{\\partial p}{\\partial T}\\right|_{(V,T)} denotes the partial derivative of p(V,T)\\  with respect to T\\  evaluated for (V,T)\\ .\n\nThe latent heats C^{(V)}_T(V,T)\\  and C^{(p)}_T(p,T)\\  are always of opposite sign.Truesdell, C., Bharatha, S. (1977), page 24.\n\nIt is common to refer to the ratio of specific heats as\n\n\\gamma(V,T)\\frac{C^{(T)}_p(p,T)}{C^{(T)}_V(V,T)} often just written as \\gamma\n\\frac{C_p}{C_V}.Truesdell, C., Bharatha, S. (1977), page 25.Kondepudi, D. (2008), pages 66-67.\n\nCalorimetry through phase change, equation of state shows one jump discontinuity\n\nAn early calorimeter was that used by Laplace and Lavoisier, as shown in the figure above. It worked at constant temperature, and at atmospheric pressure. The latent heat involved was then not a latent heat with respect to volume or with respect to pressure, as in the above account for calorimetry without phase change. The latent heat involved in this calorimeter was with respect to phase change, naturally occurring at constant temperature. This kind of calorimeter worked by measurement of mass of water produced by the melting of ice, which is a phase change.\n\nCumulation of heating\n\nFor a time-dependent process of heating of the calorimetric material, defined by a continuous joint progression P(t_1,t_2)\\  of V(t)\\  and T(t)\\ , starting at time t_1\\  and ending at time t_2\\ , there can be calculated an accumulated quantity of heat delivered, \\Delta Q(P(t_1,t_2))\\,  . This calculation is done by mathematical integration along the progression with respect to time. This is because increments of heat are 'additive'; but this does not mean that heat is a conservative quantity. The idea that heat was a conservative quantity was invented by Lavoisier, and is called the 'caloric theory'; by the middle of the nineteenth century it was recognized as mistaken. Written with the symbol \\Delta\\ , the quantity \\Delta Q(P(t_1,t_2))\\,  is not at all restricted to be an increment with very small values; this is in contrast with \\delta Q\\ .\n\nOne can write\n\n\\Delta Q(P(t_1,t_2))\\ \n\n:=\\int_{P(t_1,t_2)} \\dot Q(t)dt\n\n:=\\int_{P(t_1,t_2)} C^{(V)}_T(V,T)\\, \\dot V(t)\\, dt\\,+\\,\\int_{P(t_1,t_2)}C^{(T)}_V(V,T)\\,\\dot T(t)\\,dt .\n\nThis expression uses quantities such as \\dot Q(t)\\  which are defined in the section below headed 'Mathematical aspects of the above rules'.\n\nMathematical aspects of the above rules\n\nThe use of 'very small' quantities such as \\delta Q\\  is related to the physical requirement for the quantity p(V,T)\\  to be 'rapidly determined' by V\\  and T\\ ; such 'rapid determination' refers to a physical process. These 'very small' quantities are used in the Leibniz approach to the infinitesimal calculus. The Newton approach uses instead 'fluxions' such as \\dot V(t) = \\left.\\frac{dV}{dt}\\right|_t, which makes it more obvious that p(V,T)\\  must be 'rapidly determined'.\n\nIn terms of fluxions, the above first rule of calculation can be writtenTruesdell, C., Bharatha, S. (1977), page 20.\n\n\\dot Q(t)\\ =C^{(V)}_T(V,T)\\, \\dot V(t)\\,+\\,C^{(T)}_V(V,T)\\,\\dot T(t)\n\nwhere\n\nt\\  denotes the time\n\n\\dot Q(t)\\  denotes the time rate of heating of the calorimetric material at time t\\ \n\n\\dot V(t)\\  denotes the time rate of change of volume of the calorimetric material at time t\\ \n\n\\dot T(t)\\  denotes the time rate of change of temperature of the calorimetric material.\n\nThe increment \\delta Q\\  and the fluxion \\dot Q(t)\\  are obtained for a particular time t\\  that determines the values of the quantities on the righthand sides of the above rules. But this is not a reason to expect that there should exist a mathematical function Q(V,T)\\ . For this reason, the increment \\delta Q\\  is said to be an 'imperfect differential' or an 'inexact differential'.Adkins, C.J. (1975), Section 1.9.3, page 16.Landsberg, P.T. (1978), pages 8-9.An account of this is given by Landsberg, P.T. (1978), Chapter 4, pages 26-33. Some books indicate this by writing q\\  instead of \\delta Q\\ .Fowler, R., Guggenheim, E.A. (1939/1965). Statistical Thermodynamics. A version of Statistical Mechanics for Students of Physics and Chemistry, Cambridge University Press, Cambridge UK, page 57.Guggenheim, E.A. (1949/1967), Section 1.10, pages 9-11. Also, the notation đQ is used in some books.Lebon, G., Jou, D., Casas-Vázquez, J. (2008). Understanding Non-equilibrium Thermodynamics: Foundations, Applications, Frontiers, Springer-Verlag, Berlin, , page 7. Carelessness about this can lead to error.Planck, M. (1923/1926), page 57.\n\nThe quantity \\Delta Q(P(t_1,t_2))\\  is properly said to be a functional of the continuous joint progression P(t_1,t_2)\\  of V(t)\\  and T(t)\\ , but, in the mathematical definition of a function, \\Delta Q(P(t_1,t_2))\\  is not a function of (V,T)\\ . Although the fluxion \\dot Q(t)\\  is defined here as a function of time t\\ , the symbols Q\\  and Q(V,T)\\  respectively standing alone are not defined here.\n\nPhysical scope of the above rules of calorimetry\n\nThe above rules refer only to suitable calorimetric materials. The terms 'rapidly' and 'very small' call for empirical physical checking of the domain of validity of the above rules.\n\nThe above rules for the calculation of heat belong to pure calorimetry. They make no reference to thermodynamics, and were mostly understood before the advent of thermodynamics. They are the basis of the 'thermo' contribution to thermodynamics. The 'dynamics' contribution is based on the idea of work, which is not used in the above rules of calculation.\n\nExperimentally conveniently measured coefficients\n\nEmpirically, it is convenient to measure properties of calorimetric materials under experimentally controlled conditions.\n\nPressure increase at constant volume\n\nFor measurements at experimentally controlled volume, one can use the assumption, stated above, that the pressure of the body of calorimetric material is can be expressed as a function of its volume and temperature.\n\nFor measurement at constant experimentally controlled volume, the isochoric coefficient of pressure rise with temperature, is defined by\n\n\\alpha _V(V,T)\\ \\frac{\\left.\\cfrac{\\partial p}{\\partial V}\\right|_{(V,T)}}{p(V,T)} .Iribarne, J.V., Godson, W.L. (1973/1981), page 46.\n\nExpansion at constant pressure\n\nFor measurements at experimentally controlled pressure, it is assumed that the volume V\\  of the body of calorimetric material can be expressed as a function V(T,p)\\  of its temperature T\\  and pressure p\\ . This assumption is related to, but is not the same as, the above used assumption that the pressure of the body of calorimetric material is known as a function of its volume and temperature; anomalous behaviour of materials can affect this relation.\n\nThe quantity that is conveniently measured at constant experimentally controlled pressure, the isobaric volume expansion coefficient, is defined by\n\n\\beta _p(T,p)\\ \\frac{\\left.\\cfrac{\\partial V}{\\partial T}\\right|_{(T,p)}}{V(T,p)} .Lewis, G.N., Randall, M. (1923/1961), page 54.Guggenheim, E.A. (1949/1967), page 38.Callen, H.B. (1960/1985), page 84.Adkins, C.J. (1975), page 38.Bailyn, M. (1994), page 49.Kondepudi, D. (2008), page 180.\n\nCompressibility at constant temperature\n\nFor measurements at experimentally controlled temperature, it is again assumed that the volume V\\  of the body of calorimetric material can be expressed as a function V(T,p)\\  of its temperature T\\  and pressure p\\ , with the same provisos as mentioned just above.\n\nThe quantity that is conveniently measured at constant experimentally controlled temperature, the isothermal compressibility, is defined by\n\n\\kappa _T(T,p)\\ -\\frac{\\left.\\cfrac{\\partial V}{\\partial p}\\right|_{(T,p)}}{V(T,p)} .\n\nRelation between classical calorimetric quantities\n\nAssuming that the rule p=p(V,T)\\  is known, one can derive the function \\frac{\\partial p}{\\partial T}\\  that is used above in the classical heat calculation with respect to pressure. This function can be found experimentally from the coefficients \\beta _p(T,p)\\  and \\kappa _T(T,p)\\  through the mathematically deducible relation\n\n\\frac{\\partial p}{\\partial T}\\frac{\\beta _p(T,p)}{\\kappa _T(T,p)}.Kondepudi, D. (2008), page 181.\n\nConnection between calorimetry and thermodynamics\n\nThermodynamics developed gradually over the first half of the nineteenth century, building on the above theory of calorimetry which had been worked out before it, and on other discoveries. According to Gislason and Craig (2005): \"Most thermodynamic data come from calorimetry...\"Gislason, E.A., Craig, N.C. (2005). Cementing the foundations of thermodynamics:comparison of system-based and surroundings-based definitions of work and heat, J. Chem. Thermodynamics 37: 954-966. According to Kondepudi (2008): \"Calorimetry is widely used in present day laboratories.\"Kondepudi, D. (2008), page 63.\n\nIn terms of thermodynamics, the internal energy U\\  of the calorimetric material can be considered as the value of a function U(V,T)\\  of (V,T)\\ , with partial derivatives \\frac{\\partial U}{\\partial V}\\  and \\frac{\\partial U}{\\partial T}\\ .\n\nThen it can be shown that one can write a thermodynamic version of the above calorimetric rules:\n\n\\delta Q\\ =\\left [p(V,T)\\,+\\,\\left.\\frac{\\partial U}{\\partial V}\\right|_{(V,T)}\\right ]\\, \\delta V\\,+\\,\\left.\\frac{\\partial U}{\\partial T}\\right|_{(V,T)}\\,\\delta T\n\nwith\n\nC^{(V)}_T(V,T)=p(V,T)\\,+\\,\\left.\\frac{\\partial U}{\\partial V}\\right|_{(V,T)}\\ \n\nand\n\nC^{(T)}_V(V,T)\\left.\\frac{\\partial U}{\\partial T}\\right|_{(V,T)}\\  .Preston, T. (1894/1904). The Theory of Heat, second edition, revised by J.R. Cotter, Macmillan, London, pages 700-701.Adkins, C.J. (1975), page 45.Truesdell, C., Bharatha, S. (1977), page 134.Kondepudi, D. (2008), page 64.\n\nAgain, further in terms of thermodynamics, the internal energy U\\  of the calorimetric material can sometimes, depending on the calorimetric material, be considered as the value of a function U(p,T)\\  of (p,T)\\ , with partial derivatives \\frac{\\partial U}{\\partial p}\\  and \\frac{\\partial U}{\\partial T}\\ , and with V\\  being expressible as the value of a function V(p,T)\\  of (p,T)\\ , with partial derivatives \\frac{\\partial V}{\\partial p}\\  and \\frac{\\partial V}{\\partial T}\\  .\n\nThen, according to Adkins (1975),Adkins, C.J. (1975), page 46. it can be shown that one can write a further thermodynamic version of the above calorimetric rules:\n\n\\delta Q\\ =\\left [\\left. \\frac{\\partial U}{\\partial p}\\right |_{(p,T)}\\,+\\,p \\left.\\frac{\\partial V}{\\partial p}\\right |_{(p,T)}\\right ]\\delta p\\,+\\,\\left [ \\left.\\frac{\\partial U}{\\partial T}\\right|_{(p,T)}\\,+\\,p \\left.\\frac{\\partial V}{\\partial T}\\right |_{(p,T)}\\right ]\\delta T\n\nwith\n\nC^{(p)}_T(p,T)=\\left.\\frac{\\partial U}{\\partial p}\\right|_{(p,T)}\\,+\\,p\\left.\\frac{\\partial V}{\\partial p}\\right|_{(p,T)}\\ \n\nand\n\nC^{(T)}_p(p,T)\\left.\\frac{\\partial U}{\\partial T}\\right|_{(p,T)}\\,+\\,p\\left.\\frac{\\partial V}{\\partial T}\\right|_{(p,T)}\\  .\n\nBeyond the calorimetric fact noted above that the latent heats C^{(V)}_T(V,T)\\  and C^{(p)}_T(p,T)\\  are always of opposite sign, it may be shown, using the thermodynamic concept of work, that also\n\nC^{(V)}_T(V,T)\\,\\left.\\frac{\\partial p}{\\partial T}\\right|_{(V,T)} \\geq 0\\,.Truesdell, C., Bharatha, S. (1977), page 59.\n\nSpecial interest of thermodynamics in calorimetry: the isothermal segments of a Carnot cycle\n\nCalorimetry has a special benefit for thermodynamics. It tells about the heat absorbed or emitted in the isothermal segment of a Carnot cycle.\n\nA Carnot cycle is a special kind of cyclic process affecting a body composed of material suitable for use in a heat engine. Such a material is of the kind considered in calorimetry, as noted above, that exerts a pressure that is very rapidly determined just by temperature and volume. Such a body is said to change reversibly. A Carnot cycle consists of four successive stages or segments:\n\n(1) a change in volume from a volume V_a\\  to a volume V_b\\  at constant temperature T^+\\  so as to incur a flow of heat into the body (known as an isothermal change)\n\n(2) a change in volume from V_b\\  to a volume V_c\\  at a variable temperature just such as to incur no flow of heat (known as an adiabatic change)\n\n(3) another isothermal change in volume from V_c\\  to a volume V_d\\  at constant temperature T^-\\  such as to incur a flow or heat out of the body and just such as to precisely prepare for the following change\n\n(4) another adiabatic change of volume from V_d\\  back to V_a\\  just such as to return the body to its starting temperature T^+\\ .\n\nIn isothermal segment (1), the heat that flows into the body is given by\n\n   \\Delta Q(V_a,V_b;T^+)\\,=\\,\\,\\,\\,\\,\\,\\,\\,\\int_{V_a}^{V_b} C^{(V)}_T(V,T^+)\\, dV\\ \n\nand in isothermal segment (3) the heat that flows out of the body is given by\n\n-\\Delta Q(V_c,V_d;T^-)\\,=\\,-\\int_{V_c}^{V_d} C^{(V)}_T(V,T^-)\\, dV\\ .Truesdell, C., Bharatha, S. (1977), pages 52-53.\n\nBecause the segments (2) and (4) are adiabats, no heat flows into or out of the body during them, and consequently the net heat supplied to the body during the cycle is given by\n\n\\Delta Q(V_a,V_b;T^+;V_c,V_d;T^-)\\,\\,\\Delta Q(V_a,V_b;T^+)\\,+\\,\\Delta Q(V_c,V_d;T^-)\\,\n\\,\\int_{V_a}^{V_b} C^{(V)}_T(V,T^+)\\, dV\\,+\\,\\int_{V_c}^{V_d} C^{(V)}_T(V,T^-)\\, dV\\ .\n\nThis quantity is used by thermodynamics and is related in a special way to the net work done by the body during the Carnot cycle. The net change of the body's internal energy during the Carnot cycle, \\Delta U(V_a,V_b;T^+;V_c,V_d;T^-)\\ , is equal to zero, because the material of the working body has the special properties noted above.\n\nSpecial interest of calorimetry in thermodynamics: relations between classical calorimetric quantities\n\nRelation of latent heat with respect to volume, and the equation of state\n\nThe quantity C^{(V)}_T(V,T)\\ , the latent heat with respect to volume, belongs to classical calorimetry. It accounts for the occurrence of energy transfer by work in a process in which heat is also transferred; the quantity, however, was considered before the relation between heat and work transfers was clarified by the invention of thermodynamics. In the light of thermodynamics, the classical calorimetric quantity is revealed as being tightly linked to the calorimetric material's equation of state p=p(V,T)\\ . Provided that the temperature T\\,  is measured in the thermodynamic absolute scale, the relation is expressed in the formula\n\nC^{(V)}_T(V,T)=T \\left.\\frac{\\partial p}{\\partial T}\\right|_{(V,T)}\\ .Truesdell, C., Bharatha, S. (1977), page 150.\n\nDifference of specific heats\n\nAdvanced thermodynamics provides the relation\n\nC_p(p,T)-C_V(V,T)=\\left [p(V,T)\\,+\\,\\left.\\frac{\\partial U}{\\partial V}\\right|_{(V,T)}\\right ]\\, \\left.\\frac{\\partial V}{\\partial T}\\right|_{(p,T)}.\n\nFrom this, further mathematical and thermodynamic reasoning leads to another relation between classical calorimetric quantities. The difference of specific heats is given by\n\nC_p(p,T)-C_V(V,T)\\frac{TV\\,\\beta _p^2(T,p)}{\\kappa _T(T,p)}.Callen, H.B. (1960/1985), page 86.\n\nPractical constant-volume calorimetry (bomb calorimetry) for thermodynamic studies\n\nConstant-volume calorimetry is calorimetry performed at a constant volume. This involves the use of a constant-volume calorimeter.\n\nNo work is performed in constant-volume calorimetry, so the heat measured equals the change in internal energy of the system. The heat capacity at constant volume is assumed to be independent of temperature.\n\nHeat is measured by the principle of calorimetry.\n\nq C_V \\Delta T \n \\Delta U \\,,\n\nwhere \n\nΔU is change in internal energy,\nΔT is change in temperature and\nCV is the heat capacity at constant volume.\nIn constant-volume calorimetry the pressure is not held constant. If there is a pressure difference between initial and final states, the heat measured needs adjustment to provide the enthalpy change. One then has\n\\Delta H \\Delta U + \\Delta (PV) \n \\Delta U + V \\Delta P \\,,\n\nwhere \n\nΔH is change in enthalpy and\nV is the unchanging volume of the sample chamber.\n\nBooks\n\n*Adkins, C.J. (1975). Equilibrium Thermodynamics, second edition, McGraw-Hill, London, .\n*Bailyn, M. (1994). A Survey of Thermodynamics, American Institute of Physics, New York, .\n*Bryan, G.H. (1907). Thermodynamics. An Introductory Treatise dealing mainly with First Principles and their Direct Applications, B.G. Tuebner, Leipzig.\n*Callen, H.B. (1960/1985). Thermodynamics and an Introduction to Thermostatistics, second edition, Wiley, New York, .\n*Crawford, F.H. (1963). Heat, Thermodynamics, and Statistical Physics, Rupert Hart-Davis, London, Harcourt, Brace, & World.\n*Guggenheim, E.A. (1949/1967). Thermodynamics. An Advanced Treatment for Chemists and Physicists, North-Holland, Amsterdam.\n*Iribarne, J.V., Godson, W.L. (1973/1981), Atmospheric Thermodynamics, second edition, D. Reidel, Kluwer Academic Publishers, Dordrecht, .\n*Kondepudi, D. (2008). Introduction to Modern Thermodynamics, Wiley, Chichester, .\n*Landsberg, P.T. (1978). Thermodynamics and Statistical Mechanics, Oxford University Press, Oxford, .\n*Lewis, G.N., Randall, M. (1923/1961). Thermodynamics, second edition revised by K.S Pitzer, L. Brewer, McGraw-Hill, New York.\n*Maxwell, J.C. (1872). Theory of Heat, third edition, Longmans, Green, and Co., London.\n*Partington, J.R. (1949). An Advanced Treatise on Physical Chemistry, Volume 1, Fundamental Principles. The Properties of Gases, Longmans, Green, and Co., London.\n*Planck, M. (1923/1926). Treatise on Thermodynamics, third English edition translated by A. Ogg from the seventh German edition, Longmans, Green & Co., London.\n*Truesdell, C., Bharatha, S. (1977). The Concepts and Logic of Classical Thermodynamics as a Theory of Heat Engines, Rigorously Constructed upon the Foundation Laid by S. Carnot and F. Reech, Springer, New York, .",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Calorimetry" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7522" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Calorimetry is the science or act of measuring changes in state variables of a body for the purpose of deriving the heat transfer associated with changes of its state due, for example, to chemical reactions, physical changes, or phase transitions under specified constraints.   Calorimetry is performed with a calorimeter. The word calorimetry is derived from the Latin word calor, meaning heat and the Greek word μέτρον (metron), meaning measure.  Scottish physician and scientist Joseph Black, who was the first to recognize the distinction between heat and temperature, is said to be the founder of the science of calorimetry.\n\nIndirect calorimetry calculates heat that living organisms produce by measuring either their production of carbon dioxide and nitrogen waste (frequently ammonia in aquatic organisms, or urea in terrestrial ones), or from their consumption of oxygen. \nLavoisier noted in 1780 that heat production can be predicted from oxygen consumption this way, using multiple regression. The dynamic energy budget theory explains why this procedure is correct. Heat generated by living organisms may also be measured by direct calorimetry, in which the entire organism is placed inside the calorimeter for the measurement.\n\nA widely used modern instrument is the differential scanning calorimeter, a device which allows thermal data to be obtained on small amounts of material. It involves heating the sample at a controlled rate and recording the heat flow either into or from the specimen.\n\nClassical calorimetric calculation of heat\n\nCases with differentiable equation of state for a one-component body\n\nBasic classical calculation with respect to volume\n\nCalorimetry requires that a reference material that changes temperature have known definite thermal constitutive properties. The classical rule, recognized by Clausius and by Kelvin, is that the pressure exerted by the calorimetric material is fully and rapidly determined solely by its temperature and volume; this rule is for changes that do not involve phase change, such as melting of ice. There are many materials that do not comply with this rule, and for them, the present formula of classical calorimetry does not provide an adequate account. Here the classical rule is assumed to hold for the calorimetric material being used, and the propositions are mathematically written:\n\nThe thermal response of the calorimetric material is fully described by its pressure p\\  as the value of its constitutive function p(V,T)\\  of just the volume V\\  and the temperature T\\ . All increments are here required to be very small. This calculation refers to a domain of volume and temperature of the body in which no phase change occurs, and there is only one phase present. An important assumption here is continuity of property relations. A different analysis is needed for phase change\n\nWhen a small increment of heat is gained by a calorimetric body, with small increments, \\delta V\\  of its volume, and \\delta T\\  of its temperature, the increment of heat, \\delta Q\\ , gained by the body of calorimetric material, is given by\n\n\\delta Q\\ =C^{(V)}_T(V,T)\\, \\delta V\\,+\\,C^{(T)}_V(V,T)\\,\\delta T\n\nwhere\n\nC^{(V)}_T(V,T)\\  denotes the latent heat with respect to volume, of the calorimetric material at constant controlled temperature T. The surroundings' pressure on the material is instrumentally adjusted to impose a chosen volume change, with initial volume V\\ . To determine this latent heat, the volume change is effectively the independently instrumentally varied quantity. This latent heat is not one of the widely used ones, but is of theoretical or conceptual interest.\nC^{(T)}_V(V,T)\\  denotes the heat capacity, of the calorimetric material at fixed constant volume V\\ , while the pressure of the material is allowed to vary freely, with initial temperature T\\ . The temperature is forced to change by exposure to a suitable heat bath. It is customary to write C^{(T)}_V(V,T)\\  simply as C_V(V,T)\\ , or even more briefly as C_V\\ . This latent heat is one of the two widely used ones.Bryan, G.H. (1907), pages 21–22.Partington, J.R. (1949), pages 155–157.Prigogine, I., Defay, R. (1950/1954). Chemical Thermodynamics, Longmans, Green & Co, London, pages 22-23.Crawford, F.H. (1963), Section 5.9, pp. 120–121.Adkins, C.J. (1975), Section 3.6, pages 43-46.Truesdell, C., Bharatha, S. (1977), pages 20-21.Landsberg, P.T. (1978), page 11.\n\nThe latent heat with respect to volume is the heat required for unit increment in volume at constant temperature. It can be said to be 'measured along an isotherm', and the pressure the material exerts is allowed to vary freely, according to its constitutive law p=p(V,T)\\ . For a given material, it can have a positive or negative sign or exceptionally it can be zero, and this can depend on the temperature, as it does for water about 4 C.Maxwell, J.C. (1872), pages 232-233.Lewis, G.N., Randall, M. (1923/1961), pages 378-379.Truesdell, C., Bharatha, S. (1977), pages 9-10, 15-18, 36-37.Truesdell, C.A. (1980). The Tragicomical History of Thermodynamics, 1822–1854, Springer, New York, . The concept of latent heat with respect to volume was perhaps first recognized by Joseph Black in 1762.Lewis, G.N., Randall, M. (1923/1961), page 29. The term 'latent heat of expansion' is also used.Maxwell, J.C. (1872), page 73. The latent heat with respect to volume can also be called the 'latent energy with respect to volume'. For all of these usages of 'latent heat', a more systematic terminology uses 'latent heat capacity'.\n\nThe heat capacity at constant volume is the heat required for unit increment in temperature at constant volume. It can be said to be 'measured along an isochor', and again, the pressure the material exerts is allowed to vary freely. It always has a positive sign. This means that for an increase in the temperature of a body without change of its volume, heat must be supplied to it. This is consistent with common experience.\n\nQuantities like \\delta Q\\  are sometimes called 'curve differentials', because they are measured along curves in the (V,T)\\  surface.\n\nClassical theory for constant-volume calorimetry\n\nConstant-volume calorimetry is calorimetry performed at a constant volume. This involves the use of a constant-volume calorimeter. Heat is still measured by the above-stated principle of calorimetry.\n\nThis means that in a suitably constructed calorimeter, called a bomb calorimeter, the increment of volume \\delta V\\  can be made to vanish, \\delta V=0\\ . For constant-volume calorimetry:\n\n\\delta Q = C_V \\delta T\\ \n\nwhere\n\n\\delta T\\  denotes the increment in temperature and\nC_V\\  denotes the heat capacity at constant volume.\n\nClassical heat calculation with respect to pressure\n\nFrom the above rule of calculation of heat with respect to volume, there follows one with respect to pressure.Crawford, F.H. (1963), Section 5.10, pp. 121–122.Truesdell, C., Bharatha, S. (1977), page 23.\n\nIn a process of small increments, \\delta p\\  of its pressure, and \\delta T\\  of its temperature, the increment of heat, \\delta Q\\ , gained by the body of calorimetric material, is given by\n\n\\delta Q\\ =C^{(p)}_T(p,T)\\, \\delta p\\,+\\,C^{(T)}_p(p,T)\\,\\delta T\n\nwhere\n\nC^{(p)}_T(p,T)\\  denotes the latent heat with respect to pressure, of the calorimetric material at constant temperature, while the volume and pressure of the body are allowed to vary freely, at pressure p\\  and temperature T\\ ;\nC^{(T)}_p(p,T)\\  denotes the heat capacity, of the calorimetric material at constant pressure, while the temperature and volume of the body are allowed to vary freely, at pressure p\\  and temperature T\\ . It is customary to write C^{(T)}_p(p,T)\\  simply as C_p(p,T)\\ , or even more briefly as C_p\\ .\n\nThe new quantities here are related to the previous ones:Crawford, F.H. (1963), Section 5.11, pp. 123–124.\n\nC^{(p)}_T(p,T)=\\frac{C^{(V)}_T(V,T)}{\\left.\\cfrac{\\partial p}{\\partial V}\\right|_{(V,T)}} \n\nC^{(T)}_p(p,T)=C^{(T)}_V(V,T)-C^{(V)}_T(V,T) \\frac{\\left.\\cfrac{\\partial p}{\\partial T}\\right|_{(V,T)}}{\\left.\\cfrac{\\partial p}{\\partial V}\\right|_{(V,T)}} \nwhere\n\\left.\\frac{\\partial p}{\\partial V}\\right|_{(V,T)} denotes the partial derivative of p(V,T)\\  with respect to V\\  evaluated for (V,T)\\ \n\nand\n\n\\left.\\frac{\\partial p}{\\partial T}\\right|_{(V,T)} denotes the partial derivative of p(V,T)\\  with respect to T\\  evaluated for (V,T)\\ .\n\nThe latent heats C^{(V)}_T(V,T)\\  and C^{(p)}_T(p,T)\\  are always of opposite sign.Truesdell, C., Bharatha, S. (1977), page 24.\n\nIt is common to refer to the ratio of specific heats as\n\n\\gamma(V,T)\\frac{C^{(T)}_p(p,T)}{C^{(T)}_V(V,T)} often just written as \\gamma\n\\frac{C_p}{C_V}.Truesdell, C., Bharatha, S. (1977), page 25.Kondepudi, D. (2008), pages 66-67.\n\nCalorimetry through phase change, equation of state shows one jump discontinuity\n\nAn early calorimeter was that used by Laplace and Lavoisier, as shown in the figure above. It worked at constant temperature, and at atmospheric pressure. The latent heat involved was then not a latent heat with respect to volume or with respect to pressure, as in the above account for calorimetry without phase change. The latent heat involved in this calorimeter was with respect to phase change, naturally occurring at constant temperature. This kind of calorimeter worked by measurement of mass of water produced by the melting of ice, which is a phase change.\n\nCumulation of heating\n\nFor a time-dependent process of heating of the calorimetric material, defined by a continuous joint progression P(t_1,t_2)\\  of V(t)\\  and T(t)\\ , starting at time t_1\\  and ending at time t_2\\ , there can be calculated an accumulated quantity of heat delivered, \\Delta Q(P(t_1,t_2))\\,  . This calculation is done by mathematical integration along the progression with respect to time. This is because increments of heat are 'additive'; but this does not mean that heat is a conservative quantity. The idea that heat was a conservative quantity was invented by Lavoisier, and is called the 'caloric theory'; by the middle of the nineteenth century it was recognized as mistaken. Written with the symbol \\Delta\\ , the quantity \\Delta Q(P(t_1,t_2))\\,  is not at all restricted to be an increment with very small values; this is in contrast with \\delta Q\\ .\n\nOne can write\n\n\\Delta Q(P(t_1,t_2))\\ \n\n:=\\int_{P(t_1,t_2)} \\dot Q(t)dt\n\n:=\\int_{P(t_1,t_2)} C^{(V)}_T(V,T)\\, \\dot V(t)\\, dt\\,+\\,\\int_{P(t_1,t_2)}C^{(T)}_V(V,T)\\,\\dot T(t)\\,dt .\n\nThis expression uses quantities such as \\dot Q(t)\\  which are defined in the section below headed 'Mathematical aspects of the above rules'.\n\nMathematical aspects of the above rules\n\nThe use of 'very small' quantities such as \\delta Q\\  is related to the physical requirement for the quantity p(V,T)\\  to be 'rapidly determined' by V\\  and T\\ ; such 'rapid determination' refers to a physical process. These 'very small' quantities are used in the Leibniz approach to the infinitesimal calculus. The Newton approach uses instead 'fluxions' such as \\dot V(t) = \\left.\\frac{dV}{dt}\\right|_t, which makes it more obvious that p(V,T)\\  must be 'rapidly determined'.\n\nIn terms of fluxions, the above first rule of calculation can be writtenTruesdell, C., Bharatha, S. (1977), page 20.\n\n\\dot Q(t)\\ =C^{(V)}_T(V,T)\\, \\dot V(t)\\,+\\,C^{(T)}_V(V,T)\\,\\dot T(t)\n\nwhere\n\nt\\  denotes the time\n\n\\dot Q(t)\\  denotes the time rate of heating of the calorimetric material at time t\\ \n\n\\dot V(t)\\  denotes the time rate of change of volume of the calorimetric material at time t\\ \n\n\\dot T(t)\\  denotes the time rate of change of temperature of the calorimetric material.\n\nThe increment \\delta Q\\  and the fluxion \\dot Q(t)\\  are obtained for a particular time t\\  that determines the values of the quantities on the righthand sides of the above rules. But this is not a reason to expect that there should exist a mathematical function Q(V,T)\\ . For this reason, the increment \\delta Q\\  is said to be an 'imperfect differential' or an 'inexact differential'.Adkins, C.J. (1975), Section 1.9.3, page 16.Landsberg, P.T. (1978), pages 8-9.An account of this is given by Landsberg, P.T. (1978), Chapter 4, pages 26-33. Some books indicate this by writing q\\  instead of \\delta Q\\ .Fowler, R., Guggenheim, E.A. (1939/1965). Statistical Thermodynamics. A version of Statistical Mechanics for Students of Physics and Chemistry, Cambridge University Press, Cambridge UK, page 57.Guggenheim, E.A. (1949/1967), Section 1.10, pages 9-11. Also, the notation đQ is used in some books.Lebon, G., Jou, D., Casas-Vázquez, J. (2008). Understanding Non-equilibrium Thermodynamics: Foundations, Applications, Frontiers, Springer-Verlag, Berlin, , page 7. Carelessness about this can lead to error.Planck, M. (1923/1926), page 57.\n\nThe quantity \\Delta Q(P(t_1,t_2))\\  is properly said to be a functional of the continuous joint progression P(t_1,t_2)\\  of V(t)\\  and T(t)\\ , but, in the mathematical definition of a function, \\Delta Q(P(t_1,t_2))\\  is not a function of (V,T)\\ . Although the fluxion \\dot Q(t)\\  is defined here as a function of time t\\ , the symbols Q\\  and Q(V,T)\\  respectively standing alone are not defined here.\n\nPhysical scope of the above rules of calorimetry\n\nThe above rules refer only to suitable calorimetric materials. The terms 'rapidly' and 'very small' call for empirical physical checking of the domain of validity of the above rules.\n\nThe above rules for the calculation of heat belong to pure calorimetry. They make no reference to thermodynamics, and were mostly understood before the advent of thermodynamics. They are the basis of the 'thermo' contribution to thermodynamics. The 'dynamics' contribution is based on the idea of work, which is not used in the above rules of calculation.\n\nExperimentally conveniently measured coefficients\n\nEmpirically, it is convenient to measure properties of calorimetric materials under experimentally controlled conditions.\n\nPressure increase at constant volume\n\nFor measurements at experimentally controlled volume, one can use the assumption, stated above, that the pressure of the body of calorimetric material is can be expressed as a function of its volume and temperature.\n\nFor measurement at constant experimentally controlled volume, the isochoric coefficient of pressure rise with temperature, is defined by\n\n\\alpha _V(V,T)\\ \\frac{\\left.\\cfrac{\\partial p}{\\partial V}\\right|_{(V,T)}}{p(V,T)} .Iribarne, J.V., Godson, W.L. (1973/1981), page 46.\n\nExpansion at constant pressure\n\nFor measurements at experimentally controlled pressure, it is assumed that the volume V\\  of the body of calorimetric material can be expressed as a function V(T,p)\\  of its temperature T\\  and pressure p\\ . This assumption is related to, but is not the same as, the above used assumption that the pressure of the body of calorimetric material is known as a function of its volume and temperature; anomalous behaviour of materials can affect this relation.\n\nThe quantity that is conveniently measured at constant experimentally controlled pressure, the isobaric volume expansion coefficient, is defined by\n\n\\beta _p(T,p)\\ \\frac{\\left.\\cfrac{\\partial V}{\\partial T}\\right|_{(T,p)}}{V(T,p)} .Lewis, G.N., Randall, M. (1923/1961), page 54.Guggenheim, E.A. (1949/1967), page 38.Callen, H.B. (1960/1985), page 84.Adkins, C.J. (1975), page 38.Bailyn, M. (1994), page 49.Kondepudi, D. (2008), page 180.\n\nCompressibility at constant temperature\n\nFor measurements at experimentally controlled temperature, it is again assumed that the volume V\\  of the body of calorimetric material can be expressed as a function V(T,p)\\  of its temperature T\\  and pressure p\\ , with the same provisos as mentioned just above.\n\nThe quantity that is conveniently measured at constant experimentally controlled temperature, the isothermal compressibility, is defined by\n\n\\kappa _T(T,p)\\ -\\frac{\\left.\\cfrac{\\partial V}{\\partial p}\\right|_{(T,p)}}{V(T,p)} .\n\nRelation between classical calorimetric quantities\n\nAssuming that the rule p=p(V,T)\\  is known, one can derive the function \\frac{\\partial p}{\\partial T}\\  that is used above in the classical heat calculation with respect to pressure. This function can be found experimentally from the coefficients \\beta _p(T,p)\\  and \\kappa _T(T,p)\\  through the mathematically deducible relation\n\n\\frac{\\partial p}{\\partial T}\\frac{\\beta _p(T,p)}{\\kappa _T(T,p)}.Kondepudi, D. (2008), page 181.\n\nConnection between calorimetry and thermodynamics\n\nThermodynamics developed gradually over the first half of the nineteenth century, building on the above theory of calorimetry which had been worked out before it, and on other discoveries. According to Gislason and Craig (2005): \"Most thermodynamic data come from calorimetry...\"Gislason, E.A., Craig, N.C. (2005). Cementing the foundations of thermodynamics:comparison of system-based and surroundings-based definitions of work and heat, J. Chem. Thermodynamics 37: 954-966. According to Kondepudi (2008): \"Calorimetry is widely used in present day laboratories.\"Kondepudi, D. (2008), page 63.\n\nIn terms of thermodynamics, the internal energy U\\  of the calorimetric material can be considered as the value of a function U(V,T)\\  of (V,T)\\ , with partial derivatives \\frac{\\partial U}{\\partial V}\\  and \\frac{\\partial U}{\\partial T}\\ .\n\nThen it can be shown that one can write a thermodynamic version of the above calorimetric rules:\n\n\\delta Q\\ =\\left [p(V,T)\\,+\\,\\left.\\frac{\\partial U}{\\partial V}\\right|_{(V,T)}\\right ]\\, \\delta V\\,+\\,\\left.\\frac{\\partial U}{\\partial T}\\right|_{(V,T)}\\,\\delta T\n\nwith\n\nC^{(V)}_T(V,T)=p(V,T)\\,+\\,\\left.\\frac{\\partial U}{\\partial V}\\right|_{(V,T)}\\ \n\nand\n\nC^{(T)}_V(V,T)\\left.\\frac{\\partial U}{\\partial T}\\right|_{(V,T)}\\  .Preston, T. (1894/1904). The Theory of Heat, second edition, revised by J.R. Cotter, Macmillan, London, pages 700-701.Adkins, C.J. (1975), page 45.Truesdell, C., Bharatha, S. (1977), page 134.Kondepudi, D. (2008), page 64.\n\nAgain, further in terms of thermodynamics, the internal energy U\\  of the calorimetric material can sometimes, depending on the calorimetric material, be considered as the value of a function U(p,T)\\  of (p,T)\\ , with partial derivatives \\frac{\\partial U}{\\partial p}\\  and \\frac{\\partial U}{\\partial T}\\ , and with V\\  being expressible as the value of a function V(p,T)\\  of (p,T)\\ , with partial derivatives \\frac{\\partial V}{\\partial p}\\  and \\frac{\\partial V}{\\partial T}\\  .\n\nThen, according to Adkins (1975),Adkins, C.J. (1975), page 46. it can be shown that one can write a further thermodynamic version of the above calorimetric rules:\n\n\\delta Q\\ =\\left [\\left. \\frac{\\partial U}{\\partial p}\\right |_{(p,T)}\\,+\\,p \\left.\\frac{\\partial V}{\\partial p}\\right |_{(p,T)}\\right ]\\delta p\\,+\\,\\left [ \\left.\\frac{\\partial U}{\\partial T}\\right|_{(p,T)}\\,+\\,p \\left.\\frac{\\partial V}{\\partial T}\\right |_{(p,T)}\\right ]\\delta T\n\nwith\n\nC^{(p)}_T(p,T)=\\left.\\frac{\\partial U}{\\partial p}\\right|_{(p,T)}\\,+\\,p\\left.\\frac{\\partial V}{\\partial p}\\right|_{(p,T)}\\ \n\nand\n\nC^{(T)}_p(p,T)\\left.\\frac{\\partial U}{\\partial T}\\right|_{(p,T)}\\,+\\,p\\left.\\frac{\\partial V}{\\partial T}\\right|_{(p,T)}\\  .\n\nBeyond the calorimetric fact noted above that the latent heats C^{(V)}_T(V,T)\\  and C^{(p)}_T(p,T)\\  are always of opposite sign, it may be shown, using the thermodynamic concept of work, that also\n\nC^{(V)}_T(V,T)\\,\\left.\\frac{\\partial p}{\\partial T}\\right|_{(V,T)} \\geq 0\\,.Truesdell, C., Bharatha, S. (1977), page 59.\n\nSpecial interest of thermodynamics in calorimetry: the isothermal segments of a Carnot cycle\n\nCalorimetry has a special benefit for thermodynamics. It tells about the heat absorbed or emitted in the isothermal segment of a Carnot cycle.\n\nA Carnot cycle is a special kind of cyclic process affecting a body composed of material suitable for use in a heat engine. Such a material is of the kind considered in calorimetry, as noted above, that exerts a pressure that is very rapidly determined just by temperature and volume. Such a body is said to change reversibly. A Carnot cycle consists of four successive stages or segments:\n\n(1) a change in volume from a volume V_a\\  to a volume V_b\\  at constant temperature T^+\\  so as to incur a flow of heat into the body (known as an isothermal change)\n\n(2) a change in volume from V_b\\  to a volume V_c\\  at a variable temperature just such as to incur no flow of heat (known as an adiabatic change)\n\n(3) another isothermal change in volume from V_c\\  to a volume V_d\\  at constant temperature T^-\\  such as to incur a flow or heat out of the body and just such as to precisely prepare for the following change\n\n(4) another adiabatic change of volume from V_d\\  back to V_a\\  just such as to return the body to its starting temperature T^+\\ .\n\nIn isothermal segment (1), the heat that flows into the body is given by\n\n   \\Delta Q(V_a,V_b;T^+)\\,=\\,\\,\\,\\,\\,\\,\\,\\,\\int_{V_a}^{V_b} C^{(V)}_T(V,T^+)\\, dV\\ \n\nand in isothermal segment (3) the heat that flows out of the body is given by\n\n-\\Delta Q(V_c,V_d;T^-)\\,=\\,-\\int_{V_c}^{V_d} C^{(V)}_T(V,T^-)\\, dV\\ .Truesdell, C., Bharatha, S. (1977), pages 52-53.\n\nBecause the segments (2) and (4) are adiabats, no heat flows into or out of the body during them, and consequently the net heat supplied to the body during the cycle is given by\n\n\\Delta Q(V_a,V_b;T^+;V_c,V_d;T^-)\\,\\,\\Delta Q(V_a,V_b;T^+)\\,+\\,\\Delta Q(V_c,V_d;T^-)\\,\n\\,\\int_{V_a}^{V_b} C^{(V)}_T(V,T^+)\\, dV\\,+\\,\\int_{V_c}^{V_d} C^{(V)}_T(V,T^-)\\, dV\\ .\n\nThis quantity is used by thermodynamics and is related in a special way to the net work done by the body during the Carnot cycle. The net change of the body's internal energy during the Carnot cycle, \\Delta U(V_a,V_b;T^+;V_c,V_d;T^-)\\ , is equal to zero, because the material of the working body has the special properties noted above.\n\nSpecial interest of calorimetry in thermodynamics: relations between classical calorimetric quantities\n\nRelation of latent heat with respect to volume, and the equation of state\n\nThe quantity C^{(V)}_T(V,T)\\ , the latent heat with respect to volume, belongs to classical calorimetry. It accounts for the occurrence of energy transfer by work in a process in which heat is also transferred; the quantity, however, was considered before the relation between heat and work transfers was clarified by the invention of thermodynamics. In the light of thermodynamics, the classical calorimetric quantity is revealed as being tightly linked to the calorimetric material's equation of state p=p(V,T)\\ . Provided that the temperature T\\,  is measured in the thermodynamic absolute scale, the relation is expressed in the formula\n\nC^{(V)}_T(V,T)=T \\left.\\frac{\\partial p}{\\partial T}\\right|_{(V,T)}\\ .Truesdell, C., Bharatha, S. (1977), page 150.\n\nDifference of specific heats\n\nAdvanced thermodynamics provides the relation\n\nC_p(p,T)-C_V(V,T)=\\left [p(V,T)\\,+\\,\\left.\\frac{\\partial U}{\\partial V}\\right|_{(V,T)}\\right ]\\, \\left.\\frac{\\partial V}{\\partial T}\\right|_{(p,T)}.\n\nFrom this, further mathematical and thermodynamic reasoning leads to another relation between classical calorimetric quantities. The difference of specific heats is given by\n\nC_p(p,T)-C_V(V,T)\\frac{TV\\,\\beta _p^2(T,p)}{\\kappa _T(T,p)}.Callen, H.B. (1960/1985), page 86.\n\nPractical constant-volume calorimetry (bomb calorimetry) for thermodynamic studies\n\nConstant-volume calorimetry is calorimetry performed at a constant volume. This involves the use of a constant-volume calorimeter.\n\nNo work is performed in constant-volume calorimetry, so the heat measured equals the change in internal energy of the system. The heat capacity at constant volume is assumed to be independent of temperature.\n\nHeat is measured by the principle of calorimetry.\n\nq C_V \\Delta T \n \\Delta U \\,,\n\nwhere \n\nΔU is change in internal energy,\nΔT is change in temperature and\nCV is the heat capacity at constant volume.\nIn constant-volume calorimetry the pressure is not held constant. If there is a pressure difference between initial and final states, the heat measured needs adjustment to provide the enthalpy change. One then has\n\\Delta H \\Delta U + \\Delta (PV) \n \\Delta U + V \\Delta P \\,,\n\nwhere \n\nΔH is change in enthalpy and\nV is the unchanging volume of the sample chamber.\n\nBooks\n\n*Adkins, C.J. (1975). Equilibrium Thermodynamics, second edition, McGraw-Hill, London, .\n*Bailyn, M. (1994). A Survey of Thermodynamics, American Institute of Physics, New York, .\n*Bryan, G.H. (1907). Thermodynamics. An Introductory Treatise dealing mainly with First Principles and their Direct Applications, B.G. Tuebner, Leipzig.\n*Callen, H.B. (1960/1985). Thermodynamics and an Introduction to Thermostatistics, second edition, Wiley, New York, .\n*Crawford, F.H. (1963). Heat, Thermodynamics, and Statistical Physics, Rupert Hart-Davis, London, Harcourt, Brace, & World.\n*Guggenheim, E.A. (1949/1967). Thermodynamics. An Advanced Treatment for Chemists and Physicists, North-Holland, Amsterdam.\n*Iribarne, J.V., Godson, W.L. (1973/1981), Atmospheric Thermodynamics, second edition, D. Reidel, Kluwer Academic Publishers, Dordrecht, .\n*Kondepudi, D. (2008). Introduction to Modern Thermodynamics, Wiley, Chichester, .\n*Landsberg, P.T. (1978). Thermodynamics and Statistical Mechanics, Oxford University Press, Oxford, .\n*Lewis, G.N., Randall, M. (1923/1961). Thermodynamics, second edition revised by K.S Pitzer, L. Brewer, McGraw-Hill, New York.\n*Maxwell, J.C. (1872). Theory of Heat, third edition, Longmans, Green, and Co., London.\n*Partington, J.R. (1949). An Advanced Treatise on Physical Chemistry, Volume 1, Fundamental Principles. The Properties of Gases, Longmans, Green, and Co., London.\n*Planck, M. (1923/1926). Treatise on Thermodynamics, third English edition translated by A. Ogg from the seventh German edition, Longmans, Green & Co., London.\n*Truesdell, C., Bharatha, S. (1977). The Concepts and Logic of Classical Thermodynamics as a Theory of Heat Engines, Rigorously Constructed upon the Foundation Laid by S. Carnot and F. Reech, Springer, New York, . Calorimetry. http://en.wikipedia.org/?curid=7522."
  }
}
