{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20203",
  "eid" : "40b1f1a0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778617786,
  "textBody" : "Marietta Alboni (6 March 1826Date stated by both Ciliberti and Pougin; the 1911 Encyclopædia Britannica gives the year as 1823. – 23 June 1894) was a renowned Italian contralto opera singer. She is considered as 'one of the greatest contraltos in operatic history'.Entry in Harold Rosenthal & John Warrack (ed.), The Concise Oxford Dictionary of Opera, Oxford UK, Oxford University Press, 1986, p. 6, .\n\nBiography\n\nAlboni was born at Città di Castello, in Umbria. She became a pupil of  of Cesena, Emilia–Romagna, and later of the composer Gioachino Rossini, when he was 'perpetual honorary adviser' in (and then the principal of) the Liceo Musicale, now Conservatorio Giovanni Battista Martini, in Bologna. Rossini tested the humble thirteen-year-old girl himself, had her admitted to the school with special treatment, and even procured her an early engagement to tour his Stabat Mater around Northern Italy, so that she could pay for her studies.Rossini himself taught her the part and she later told that all her life long she had kept singing exactly the same variations (\"cambiamenti\") he had recommended to her (Pougin, 2001, p. 25). After she achieved her diploma and made a modest debut in Bologna, in 1842, as \"Climene\" in Pacini's Saffo, she obtained a triennial engagement thanks to Rossini's influence on the impresario Bartolomeo Merelli, Intendant at both Milan's Teatro alla Scala and Vienna's Imperial Kärntnertortheater. The favourable contract was signed by Rossini himself, \"on behalf of Eustachio Alboni\", father of Marietta, who was still a minor.Pougin, 2001, pp. 19–26. The singer remained, throughout her life, deeply grateful to her ancient \"maestro\", nearly a second father to her.\n\nHer debut at Teatro alla Scala took place in December 1842 as \"Neocle\" in the Italian version of Le siège de Corinthe, which was followed by roles in operas by Marliani, Donizetti (as \"Maffio Orsini\" and \"Leonora\" in the Scala premiere of an Italian version of La favoriteIt was given in 1843 under the title of Elda (William Ashbrook, Favorite, La, in Sadie, II, p. 141).), Salvi and Pacini. In the season 1844–1845 she was engaged in the Saint Petersburg Imperial Bolshoi Kamenny Theatre; later, in 1846–47, she toured the principal cities of Central Europe, finally reaching London and Paris, where she settled permanently. In London, \"she appeared in leading roles by Rossini and Donizetti (where she outshone Giulia Grisi and Jenny Lind) and also sang Cherubino (performing with Henriette Sontag)\".Ciliberti. For the 1848 London run of Les Huguenots, Meyerbeer transposed the role of the page \"Urbain\" 'from soprano to contralto and composed the aria \"Non! – non, non, non, non, non! Vous n'avez jamais, je gage\"  in Act 2' for her.Owen Jander, J.B. Steane, Elizabeth Forbes, Contralto, in S. Sadie, cited, I, p. 934. On 28 August 1848, she sang at a concert in Manchester's Concert Hall, sharing the stage with Lorenzo Salvi and Frédéric Chopin.[https://www.theguardian.com/music/2016/mar/09/from-the-classical-archive-chopin-alboni-review-manchester-1848 \"Review: Frédéric Chopin and Marietta Alboni perform in Manchester\"], The Manchester Guardian, 30 August 1948; also singing was Amalia Colbari; the conductor was Charles Seymour, who was later first violinist in The Hallé orchestra. The Manchester Concert Hall is now the site of the Midland Hotel. She toured the United States in 1852–53, appearing there with Camilla Urso.\n\nIn 1853 she wed a nobleman, Count Carlo Pepoli, of the Papal States,He bore almost the same name (his full name, however, was Achille Francesco Luigi Carlo Maria, Count Pepoli) and was a first cousin of Carlo Pepoli, the librettist of Bellini's I puritani (Pougin, 2001, p. 77). but she kept her maiden name for the stage. In 1863 she had to retire the first time on account of her husband's serious mental illness. He died in 1867. A year later, in 1868, Alboni would take part in the funeral of her beloved master and friend, Rossini, in the Église de la Sainte-Trinité.Their relationship was still so close that, not having a family vault of his own in Père Lachaise Cemetery, Rossini was temporarily buried in Alboni's (Pougin, 2001, p. 110, note 66). There she sang, alongside Adelina Patti, the leading soprano of the time, a stanza of Dies irae, \"Liber scriptum\", adjusted to the music of the duet \"Quis est Homo\" from Rossini's own Stabat Mater. Out of deference to her master, she also accepted to resume her singing career mainly in order to tour the orchestral version of the Petite messe solennelle around Europe. Rossini had once expressed his hope that she would take upon herself to perform it when he was dead. He had said that he had composed it, and especially the new section \"O salutaris\", just having her voice in mind.Pougin, 2001, pp. 86–89.\n\nIn 1872 she permanently retired from the stage with four performances of \"Fidalma\" in Cimarosa's Il matrimonio segreto, at the Paris Théâtre des ItaliensPougin, 2001, p. 93. but, in fact, she never gave up singing in private and in benefit concerts.On 23 December 1880 she appeared once again, with a deep emotion, on the stage of the Paris Opéra (Pougin, 2001, pp. 103–104) for a benefit performance When in 1887 the French and Italian Governments agreed upon moving the mortal remains of Rossini into the Basilica di Santa Croce in Florence, Alboni, then a sixty-one-year-old lady living in seclusion, wrote to the Italian Foreign Minister, Di Robilant, proposing that the Petite Messe Solennelle, \"the last musical composition by Rossini\", be performed in Santa Croce the day of the funeral, and \"demanding the honour, as an Italian and a pupil of the immortal Maestro,\" of singing it herself in her \"dear and beloved homeland\". Her wish, however, never came true and she was just given the chance of being present at the exhumation ceremony in Paris. The Paris correspondent of the Rome newspaper Il Fanfulla wrote on the occasion: \"photographers snapped in the same shot the greatest performer of Cenerentola and Semiramide, and what is left of the man who wrote these masterpieces\".Pougin, 2001, pp. 108–110.\n\nIn 1877 she had remarried—to a French military officer named Charles Zieger. She died at Ville-d'Avray, near Paris, in her \"Villa La Cenerentola\", and was buried at Père Lachaise Cemetery. Always engaged in charity (often in memory of Maestro Rossini), she left nearly all her estate to the poor of Paris. In her will she wrote that by singing she had earned all her fortune, and on singing she would pass away, with the sweet thought that she had employed it to encourage and to console.Pougin, 2001, p. 111.\n\nArtistic features\n\nAlboni's voice, an exceptionally fine contralto with a seamless compass of two and one-half octaves, extending as high as the soprano range\"She was a real contralto from f3 to g5, then, up to c6, she was an excellent soprano. Which enabled her to perform, with some adjustments ['con qualche \"accomodo\"'], also Zerlina in Don Giovanni, Amina in La sonnambula and Marie in La fille du régiment\" (Celletti, pp. 243–244). In fact, her voice could reach down to f3 only while practising: in public her lowest note was g3. Alboni also reported that on practising she could sometimes climb up to e6 flat (Pougin, 2001, p. 96). was said to possess at once power, sweetness, fullness, and extraordinary flexibility. She had no peers in passages requiring a sensitive delivery and semi-religious calmness, owing to the moving quality of her velvety tone. She possessed vivacity, grace, and charm as an actress of the comédienne type; but she was not a natural tragédienne, and her attempt at the strongly dramatic part of Norma was sometimes reported to have turned out a failure.Article: [https://archive.org/stream/newinternational01gilm#page/284/mode/2up Alboni, Marietta], in Gilman, D. C.; Thurston, H. T.; Moore, F., New International Encyclopedia (1st ed.). New York: Dodd, Mead, 1905, I, p. 285. Not all sources, however, agree with the author of NIE; surely not Henry Wadsworth Longfellow, who was very keen on opera, somewhat of a connoisseur. \"Alboni was sublime in Norma, last night,\" he wrote to his best friend Charles Sumner on 15 February 1853, \"Would you had been with us, in our snug box.\" (quoted in Christoph Irmscher, Public Poet, Private Man: Henry Wadsworth Longfellow at 200, University of Massachusetts Press, 2009, p. 6. ). Walt Whitman went even farther likening \"Alboni in the children's scene in Norma\" to a marvel of Nature, such as \"the wild sea-storm\" he had once seen \"one winter day, off Fire island\", or \"night-views … on the field, after battles in Virginia, or the peculiar sentiment of moonlight and stars over the great Plains, western Kansas\" (Seeing Niagara to advantage, in Complete Prose Works, Kila MT/US, Kessinger Publishing, 2004, pp. 179–180, ) Nevertheless, she scored a real triumph in 1850, when she made her operatic debut at the Paris Opéra performing the tragic role of \"Fidès\" in Meyerbeer's Le prophète, which had been created the year before by no less than Pauline Viardot.Pougin, 2001, pp. 57–67. Furthermore, she was able to cope with such dramatic roles as \"Azucena\" and \"Ulrica\" in Verdi's Il trovatore and Un ballo in maschera, and even with the baritone role of \"Don Carlo\" in Ernani (London, 1847).Ciliberti; Celletti, pp. 243–244.\n\nRepertoire\n\nThe following list of the roles performed by Marietta Alboni was drawn up by Arthur Pougin and published in his biography of the singer.Pougin, 2001, pp. 115–116. It is reported here with the addition of further works and characters according to the sources stated in footnotes. \n* Anna Bolena, by Donizetti – Anna and SmetonThe role of the young musician is not mentioned by Pougin, but was certainly performed at the Royal Italian Opera (Covent Garden) in 1847 and 1848 (Royal Italian Opera, «The Musical World», n. 26, volume XXII, 26 June 1847, p. 445, and n. 25, volume XXIII, 17 June 1848, p. 389; accessible for free online at Books.Google: [https://books.google.com/books?idFJMPAAAAYAAJ&pg\nPA537 Volume XXII] and [https://books.google.com/books?id_PksAAAAYAAJ&pg\nPA384 Volume XXIII]). The latter article seems also to disprove Elizabeth Forbes's statement that Alboni performed in the 1748 season of the Royal Italian Opera the role of Romeo in Bellini's I Capuleti e i Montecchi, which was sung, instead, by Pauline Viardot (Elizabeth Forbes, Alboni, Marietta, in Laura Macy (ed), The Grove Book of Opera Singers, New York, Oxford University Press, 2008, pp. 6–7, ).\n* L'assedio di Corinto, by Rossini – NeoclePougin does not mention the character, but it is that of Neocle, transposed for contralto in the Italian version of the opera. It was Alboni's debut role at the Teatro alla Scala ([http://www.italianopera.org/compositori/R/c22034822.htm italianOpera]. Retrieved 17. October 2011).\n* Un ballo in maschera, by Verdi – Ulrica\n* Il barbiere di Siviglia, by Rossini – Rosina\n* La Cenerentola, by Rossini – Cenerentola\n* Charles VI, by Halévy – Odette\n* Consuelo, by Giovanni Battista Gordigiani – AnzolettoThe première of this opera was performed at Prague in 1846 (William Ashbrook, Gordigiani. (2) Gordigiani, Giovanni Battista, in Stanley Sadie, II, p. 489) It should hence be a role created by Alboni.\n* Così fan tutte, by Mozart – Dorabella\n* Il crociato, by Meyerbeer – FeliciaThe character name, not mentioned by Pougin, is reported in Jacques Gheusi, Histoire du Théâtre des Italiens de Paris. Neuvième et Dixième époques: 1852–1878, «Avant-scène opéra Paris», N° 65 (supplement), 1984 (Adelaide Borghi-Mamo performed the castrato role of Armando and Rosina Penco that of Palmide).\n\n* Un curioso accidente, pastiche with music by Rossini\n* David, oratorio, by Muhlig\n* Don Giovanni, by Mozart – Zerlina\n* Don Pasquale, by Donizetti – Norina\n* La donna del lago, by Rossini – Malcolm and Elena\n* L'ebrea, by Pacini – BereniceThe character name, not mentioned by Pougin, is reported in the original libretto (cf. [http://www.italianopera.org/compositori/P/c21986118.htm italianOpera]. Retrieved 17 October 2011); it is a role created by Alboni (Milan, 1844). According to Casaglia, Alboni performed, instead, a would-be role of Eudossia, which is not even stated by the original libretto among the other characters of this opera.\n* Ernani, by Verdi – Don Carlo, GiovannaBeyond her well-known 1848 London performance in the baritone role of Don Carlo, according to the sources reported by the website [http://musicabresciana.it/Oratori%201800-1849.html musicabresciana.it] Alboni had already sung in Verdi's Ernani, at the Teatro Grande in Brescia, in 1844. She evidently performed the minor role of Giovanna as the main role of Elvira was taken by soprano Augusta Boccabadati (1821?–1875) (Marcello Conati, Observations on the early reviews of Verdi's \"Ernani\", in Pierluigi Petrobelli (ed), Ernani yesterday and today : proceedings of the international conference : Modena, Teatro San Carlo, 9–10 december 1984, Parma, Istituto Nazionale di Studi Verdiani, 1989, p. 268, ). Boccabadati was the daughter of the more famous Luigia and the elder sister of , who was suggested by Verdi in 1853 as a suitable first performer of Violetta in La traviata (cf. article: Boccabadati, Luigia (Luisa), in Dizionario Biografico degli Italiani – Volume 10, 1968, accessible online at [http://www.treccani.it/enciclopedia/luigia-boccabadati_(Dizionario-Biografico)/ Treccani.it]).\n* La favorite, by Donizetti – Léonor\n* La fille du régiment, by Donizetti – Marie\n* La gazza ladra, by Rossini – Pippo and Ninetta\n* ',Performance not mentioned by Pougin, but stated by Gherardo Casaglia. cantata, by Rossini\n* Giulietta e Romeo, by Vaccai – Romeo\n* Il giuramento, by Mercadante – BiancaThe character name, not mentioned by Pougin, is reported by Gherardo Casaglia.\n* Ildegonda, by Marco Aurelio Marliani – RizzardoThe character name, not mentioned by Pougin, is reported in the original libretto (cf. [http://www.italianopera.org/compositori/M/c219427.htm#C142406 italianOpera]. Retrieved 15 October 2011); it is a role created by Alboni (Milan, 1843).\n* L'italiana in Algeri, by Rossini – Isabella\n* Lara, by Salvi – MirzaThe character name, not mentioned by Pougin, is reported in Charles H. Parsons (ed), Opera premieres: an index of casts. M–Z, Lewiston (NY), Mellen (opera reference index), 1992, p. 1141, . This role was created by Alboni (Milan, 1843).\n* Linda di Chamounix, by Donizetti – Pierotto\n* Lucrezia Borgia, by Donizetti – Maffio Orsini\n* Luisa Miller, by Verdi – FedericaThe character name, not mentioned by Pougin, is reported in Frederick J. Crowest, Verdi: Man and Musician. His Biography with Especial Reference to his English Experiences, Londra, Milne, 1897, p. 99 (accessible for free online at [https://archive.org/stream/verdimanmusician00crow#page/98/mode/2up Open Library.org]). Given the minor nature of the part, however, Alboni \"[substituted] a cavatina for the original duet of the opera\" (the part was sung at Her Majesty's Theatre, London, 1858).\n* Maria di Rohan, by Donizetti – Gondi\n* Martha, by Flotow – Nancy\n* Il matrimonio segreto, by Cimarosa – Fidalma\n* Messiah, oratorio by Händel\n* La pazza per amore, by Coppola – Nina\n* Norma, by Bellini – Norma\n* Le nozze di Figaro, by Mozart – The page (Cherubino)\n* Oberon, by Weber – Fatima\n* Petite messe solennelle,Not mentioned by Pougin (non-operatic performance). mass by Rossini\n* Le prophète, by Meyerbeer – Fidès\n* La reine de Chypre, by Halévy – Catarina\n* Rigoletto, by Verdi – Maddalena\n* Saffo, by Pacini – Climene\n* Semiramide, by Rossini – Arsace\n* La sibilla,Not mentioned by Pougin. Source: Gherardo Casaglia; it was a première (Bologna, 1842). by Pietro Torrigiani – Ismailia\n* La sonnambula, by Bellini – Amina\n* Stabat mater, Marian hymn, by Rossini\n* Tancredi, by Rossini – Tancredi\n* Il trovatore, by Verdi – Azucena\n* Zerline, by Auber – ZerlineIt was a première (Paris, 1851).\n* La zingara, by Balfe – Queen of the GypsiesThe character name is not mentioned by Pougin; in his biography of Balfe, however, William Alexander Barret states that the two primadonnas of La Zingara (an Italian version of The bohemian girl, which was given in the first experimental winter season at Her Majesty's Theatre, in 1858) were Alboni and Marietta Piccolomini (Balfe: His Life and Work, London, Remington, 1882, p. 229; accessible for free online at [https://archive.org/stream/cu31924021747781#page/n245/mode/2up Open Library.org]). Considering that the latter certainly performed the soprano leggiero part of Arline (cf., for instance, [http://www.musicwithease.com/balfe-bohemian-girl-annals.html Music with ease]. Retrieved 15 October 2011), it follows that Alboni expectedly interpreted the contralto role of the Gypsy Queen.\n* Les Huguenots, by Meyerbeer – The page (Urbain)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Marietta Alboni" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20203" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Marietta Alboni (6 March 1826Date stated by both Ciliberti and Pougin; the 1911 Encyclopædia Britannica gives the year as 1823. – 23 June 1894) was a renowned Italian contralto opera singer. She is considered as 'one of the greatest contraltos in operatic history'.Entry in Harold Rosenthal & John Warrack (ed.), The Concise Oxford Dictionary of Opera, Oxford UK, Oxford University Press, 1986, p. 6, .\n\nBiography\n\nAlboni was born at Città di Castello, in Umbria. She became a pupil of  of Cesena, Emilia–Romagna, and later of the composer Gioachino Rossini, when he was 'perpetual honorary adviser' in (and then the principal of) the Liceo Musicale, now Conservatorio Giovanni Battista Martini, in Bologna. Rossini tested the humble thirteen-year-old girl himself, had her admitted to the school with special treatment, and even procured her an early engagement to tour his Stabat Mater around Northern Italy, so that she could pay for her studies.Rossini himself taught her the part and she later told that all her life long she had kept singing exactly the same variations (\"cambiamenti\") he had recommended to her (Pougin, 2001, p. 25). After she achieved her diploma and made a modest debut in Bologna, in 1842, as \"Climene\" in Pacini's Saffo, she obtained a triennial engagement thanks to Rossini's influence on the impresario Bartolomeo Merelli, Intendant at both Milan's Teatro alla Scala and Vienna's Imperial Kärntnertortheater. The favourable contract was signed by Rossini himself, \"on behalf of Eustachio Alboni\", father of Marietta, who was still a minor.Pougin, 2001, pp. 19–26. The singer remained, throughout her life, deeply grateful to her ancient \"maestro\", nearly a second father to her.\n\nHer debut at Teatro alla Scala took place in December 1842 as \"Neocle\" in the Italian version of Le siège de Corinthe, which was followed by roles in operas by Marliani, Donizetti (as \"Maffio Orsini\" and \"Leonora\" in the Scala premiere of an Italian version of La favoriteIt was given in 1843 under the title of Elda (William Ashbrook, Favorite, La, in Sadie, II, p. 141).), Salvi and Pacini. In the season 1844–1845 she was engaged in the Saint Petersburg Imperial Bolshoi Kamenny Theatre; later, in 1846–47, she toured the principal cities of Central Europe, finally reaching London and Paris, where she settled permanently. In London, \"she appeared in leading roles by Rossini and Donizetti (where she outshone Giulia Grisi and Jenny Lind) and also sang Cherubino (performing with Henriette Sontag)\".Ciliberti. For the 1848 London run of Les Huguenots, Meyerbeer transposed the role of the page \"Urbain\" 'from soprano to contralto and composed the aria \"Non! – non, non, non, non, non! Vous n'avez jamais, je gage\"  in Act 2' for her.Owen Jander, J.B. Steane, Elizabeth Forbes, Contralto, in S. Sadie, cited, I, p. 934. On 28 August 1848, she sang at a concert in Manchester's Concert Hall, sharing the stage with Lorenzo Salvi and Frédéric Chopin.[https://www.theguardian.com/music/2016/mar/09/from-the-classical-archive-chopin-alboni-review-manchester-1848 \"Review: Frédéric Chopin and Marietta Alboni perform in Manchester\"], The Manchester Guardian, 30 August 1948; also singing was Amalia Colbari; the conductor was Charles Seymour, who was later first violinist in The Hallé orchestra. The Manchester Concert Hall is now the site of the Midland Hotel. She toured the United States in 1852–53, appearing there with Camilla Urso.\n\nIn 1853 she wed a nobleman, Count Carlo Pepoli, of the Papal States,He bore almost the same name (his full name, however, was Achille Francesco Luigi Carlo Maria, Count Pepoli) and was a first cousin of Carlo Pepoli, the librettist of Bellini's I puritani (Pougin, 2001, p. 77). but she kept her maiden name for the stage. In 1863 she had to retire the first time on account of her husband's serious mental illness. He died in 1867. A year later, in 1868, Alboni would take part in the funeral of her beloved master and friend, Rossini, in the Église de la Sainte-Trinité.Their relationship was still so close that, not having a family vault of his own in Père Lachaise Cemetery, Rossini was temporarily buried in Alboni's (Pougin, 2001, p. 110, note 66). There she sang, alongside Adelina Patti, the leading soprano of the time, a stanza of Dies irae, \"Liber scriptum\", adjusted to the music of the duet \"Quis est Homo\" from Rossini's own Stabat Mater. Out of deference to her master, she also accepted to resume her singing career mainly in order to tour the orchestral version of the Petite messe solennelle around Europe. Rossini had once expressed his hope that she would take upon herself to perform it when he was dead. He had said that he had composed it, and especially the new section \"O salutaris\", just having her voice in mind.Pougin, 2001, pp. 86–89.\n\nIn 1872 she permanently retired from the stage with four performances of \"Fidalma\" in Cimarosa's Il matrimonio segreto, at the Paris Théâtre des ItaliensPougin, 2001, p. 93. but, in fact, she never gave up singing in private and in benefit concerts.On 23 December 1880 she appeared once again, with a deep emotion, on the stage of the Paris Opéra (Pougin, 2001, pp. 103–104) for a benefit performance When in 1887 the French and Italian Governments agreed upon moving the mortal remains of Rossini into the Basilica di Santa Croce in Florence, Alboni, then a sixty-one-year-old lady living in seclusion, wrote to the Italian Foreign Minister, Di Robilant, proposing that the Petite Messe Solennelle, \"the last musical composition by Rossini\", be performed in Santa Croce the day of the funeral, and \"demanding the honour, as an Italian and a pupil of the immortal Maestro,\" of singing it herself in her \"dear and beloved homeland\". Her wish, however, never came true and she was just given the chance of being present at the exhumation ceremony in Paris. The Paris correspondent of the Rome newspaper Il Fanfulla wrote on the occasion: \"photographers snapped in the same shot the greatest performer of Cenerentola and Semiramide, and what is left of the man who wrote these masterpieces\".Pougin, 2001, pp. 108–110.\n\nIn 1877 she had remarried—to a French military officer named Charles Zieger. She died at Ville-d'Avray, near Paris, in her \"Villa La Cenerentola\", and was buried at Père Lachaise Cemetery. Always engaged in charity (often in memory of Maestro Rossini), she left nearly all her estate to the poor of Paris. In her will she wrote that by singing she had earned all her fortune, and on singing she would pass away, with the sweet thought that she had employed it to encourage and to console.Pougin, 2001, p. 111.\n\nArtistic features\n\nAlboni's voice, an exceptionally fine contralto with a seamless compass of two and one-half octaves, extending as high as the soprano range\"She was a real contralto from f3 to g5, then, up to c6, she was an excellent soprano. Which enabled her to perform, with some adjustments ['con qualche \"accomodo\"'], also Zerlina in Don Giovanni, Amina in La sonnambula and Marie in La fille du régiment\" (Celletti, pp. 243–244). In fact, her voice could reach down to f3 only while practising: in public her lowest note was g3. Alboni also reported that on practising she could sometimes climb up to e6 flat (Pougin, 2001, p. 96). was said to possess at once power, sweetness, fullness, and extraordinary flexibility. She had no peers in passages requiring a sensitive delivery and semi-religious calmness, owing to the moving quality of her velvety tone. She possessed vivacity, grace, and charm as an actress of the comédienne type; but she was not a natural tragédienne, and her attempt at the strongly dramatic part of Norma was sometimes reported to have turned out a failure.Article: [https://archive.org/stream/newinternational01gilm#page/284/mode/2up Alboni, Marietta], in Gilman, D. C.; Thurston, H. T.; Moore, F., New International Encyclopedia (1st ed.). New York: Dodd, Mead, 1905, I, p. 285. Not all sources, however, agree with the author of NIE; surely not Henry Wadsworth Longfellow, who was very keen on opera, somewhat of a connoisseur. \"Alboni was sublime in Norma, last night,\" he wrote to his best friend Charles Sumner on 15 February 1853, \"Would you had been with us, in our snug box.\" (quoted in Christoph Irmscher, Public Poet, Private Man: Henry Wadsworth Longfellow at 200, University of Massachusetts Press, 2009, p. 6. ). Walt Whitman went even farther likening \"Alboni in the children's scene in Norma\" to a marvel of Nature, such as \"the wild sea-storm\" he had once seen \"one winter day, off Fire island\", or \"night-views … on the field, after battles in Virginia, or the peculiar sentiment of moonlight and stars over the great Plains, western Kansas\" (Seeing Niagara to advantage, in Complete Prose Works, Kila MT/US, Kessinger Publishing, 2004, pp. 179–180, ) Nevertheless, she scored a real triumph in 1850, when she made her operatic debut at the Paris Opéra performing the tragic role of \"Fidès\" in Meyerbeer's Le prophète, which had been created the year before by no less than Pauline Viardot.Pougin, 2001, pp. 57–67. Furthermore, she was able to cope with such dramatic roles as \"Azucena\" and \"Ulrica\" in Verdi's Il trovatore and Un ballo in maschera, and even with the baritone role of \"Don Carlo\" in Ernani (London, 1847).Ciliberti; Celletti, pp. 243–244.\n\nRepertoire\n\nThe following list of the roles performed by Marietta Alboni was drawn up by Arthur Pougin and published in his biography of the singer.Pougin, 2001, pp. 115–116. It is reported here with the addition of further works and characters according to the sources stated in footnotes. \n* Anna Bolena, by Donizetti – Anna and SmetonThe role of the young musician is not mentioned by Pougin, but was certainly performed at the Royal Italian Opera (Covent Garden) in 1847 and 1848 (Royal Italian Opera, «The Musical World», n. 26, volume XXII, 26 June 1847, p. 445, and n. 25, volume XXIII, 17 June 1848, p. 389; accessible for free online at Books.Google: [https://books.google.com/books?idFJMPAAAAYAAJ&pg\nPA537 Volume XXII] and [https://books.google.com/books?id_PksAAAAYAAJ&pg\nPA384 Volume XXIII]). The latter article seems also to disprove Elizabeth Forbes's statement that Alboni performed in the 1748 season of the Royal Italian Opera the role of Romeo in Bellini's I Capuleti e i Montecchi, which was sung, instead, by Pauline Viardot (Elizabeth Forbes, Alboni, Marietta, in Laura Macy (ed), The Grove Book of Opera Singers, New York, Oxford University Press, 2008, pp. 6–7, ).\n* L'assedio di Corinto, by Rossini – NeoclePougin does not mention the character, but it is that of Neocle, transposed for contralto in the Italian version of the opera. It was Alboni's debut role at the Teatro alla Scala ([http://www.italianopera.org/compositori/R/c22034822.htm italianOpera]. Retrieved 17. October 2011).\n* Un ballo in maschera, by Verdi – Ulrica\n* Il barbiere di Siviglia, by Rossini – Rosina\n* La Cenerentola, by Rossini – Cenerentola\n* Charles VI, by Halévy – Odette\n* Consuelo, by Giovanni Battista Gordigiani – AnzolettoThe première of this opera was performed at Prague in 1846 (William Ashbrook, Gordigiani. (2) Gordigiani, Giovanni Battista, in Stanley Sadie, II, p. 489) It should hence be a role created by Alboni.\n* Così fan tutte, by Mozart – Dorabella\n* Il crociato, by Meyerbeer – FeliciaThe character name, not mentioned by Pougin, is reported in Jacques Gheusi, Histoire du Théâtre des Italiens de Paris. Neuvième et Dixième époques: 1852–1878, «Avant-scène opéra Paris», N° 65 (supplement), 1984 (Adelaide Borghi-Mamo performed the castrato role of Armando and Rosina Penco that of Palmide).\n\n* Un curioso accidente, pastiche with music by Rossini\n* David, oratorio, by Muhlig\n* Don Giovanni, by Mozart – Zerlina\n* Don Pasquale, by Donizetti – Norina\n* La donna del lago, by Rossini – Malcolm and Elena\n* L'ebrea, by Pacini – BereniceThe character name, not mentioned by Pougin, is reported in the original libretto (cf. [http://www.italianopera.org/compositori/P/c21986118.htm italianOpera]. Retrieved 17 October 2011); it is a role created by Alboni (Milan, 1844). According to Casaglia, Alboni performed, instead, a would-be role of Eudossia, which is not even stated by the original libretto among the other characters of this opera.\n* Ernani, by Verdi – Don Carlo, GiovannaBeyond her well-known 1848 London performance in the baritone role of Don Carlo, according to the sources reported by the website [http://musicabresciana.it/Oratori%201800-1849.html musicabresciana.it] Alboni had already sung in Verdi's Ernani, at the Teatro Grande in Brescia, in 1844. She evidently performed the minor role of Giovanna as the main role of Elvira was taken by soprano Augusta Boccabadati (1821?–1875) (Marcello Conati, Observations on the early reviews of Verdi's \"Ernani\", in Pierluigi Petrobelli (ed), Ernani yesterday and today : proceedings of the international conference : Modena, Teatro San Carlo, 9–10 december 1984, Parma, Istituto Nazionale di Studi Verdiani, 1989, p. 268, ). Boccabadati was the daughter of the more famous Luigia and the elder sister of , who was suggested by Verdi in 1853 as a suitable first performer of Violetta in La traviata (cf. article: Boccabadati, Luigia (Luisa), in Dizionario Biografico degli Italiani – Volume 10, 1968, accessible online at [http://www.treccani.it/enciclopedia/luigia-boccabadati_(Dizionario-Biografico)/ Treccani.it]).\n* La favorite, by Donizetti – Léonor\n* La fille du régiment, by Donizetti – Marie\n* La gazza ladra, by Rossini – Pippo and Ninetta\n* ',Performance not mentioned by Pougin, but stated by Gherardo Casaglia. cantata, by Rossini\n* Giulietta e Romeo, by Vaccai – Romeo\n* Il giuramento, by Mercadante – BiancaThe character name, not mentioned by Pougin, is reported by Gherardo Casaglia.\n* Ildegonda, by Marco Aurelio Marliani – RizzardoThe character name, not mentioned by Pougin, is reported in the original libretto (cf. [http://www.italianopera.org/compositori/M/c219427.htm#C142406 italianOpera]. Retrieved 15 October 2011); it is a role created by Alboni (Milan, 1843).\n* L'italiana in Algeri, by Rossini – Isabella\n* Lara, by Salvi – MirzaThe character name, not mentioned by Pougin, is reported in Charles H. Parsons (ed), Opera premieres: an index of casts. M–Z, Lewiston (NY), Mellen (opera reference index), 1992, p. 1141, . This role was created by Alboni (Milan, 1843).\n* Linda di Chamounix, by Donizetti – Pierotto\n* Lucrezia Borgia, by Donizetti – Maffio Orsini\n* Luisa Miller, by Verdi – FedericaThe character name, not mentioned by Pougin, is reported in Frederick J. Crowest, Verdi: Man and Musician. His Biography with Especial Reference to his English Experiences, Londra, Milne, 1897, p. 99 (accessible for free online at [https://archive.org/stream/verdimanmusician00crow#page/98/mode/2up Open Library.org]). Given the minor nature of the part, however, Alboni \"[substituted] a cavatina for the original duet of the opera\" (the part was sung at Her Majesty's Theatre, London, 1858).\n* Maria di Rohan, by Donizetti – Gondi\n* Martha, by Flotow – Nancy\n* Il matrimonio segreto, by Cimarosa – Fidalma\n* Messiah, oratorio by Händel\n* La pazza per amore, by Coppola – Nina\n* Norma, by Bellini – Norma\n* Le nozze di Figaro, by Mozart – The page (Cherubino)\n* Oberon, by Weber – Fatima\n* Petite messe solennelle,Not mentioned by Pougin (non-operatic performance). mass by Rossini\n* Le prophète, by Meyerbeer – Fidès\n* La reine de Chypre, by Halévy – Catarina\n* Rigoletto, by Verdi – Maddalena\n* Saffo, by Pacini – Climene\n* Semiramide, by Rossini – Arsace\n* La sibilla,Not mentioned by Pougin. Source: Gherardo Casaglia; it was a première (Bologna, 1842). by Pietro Torrigiani – Ismailia\n* La sonnambula, by Bellini – Amina\n* Stabat mater, Marian hymn, by Rossini\n* Tancredi, by Rossini – Tancredi\n* Il trovatore, by Verdi – Azucena\n* Zerline, by Auber – ZerlineIt was a première (Paris, 1851).\n* La zingara, by Balfe – Queen of the GypsiesThe character name is not mentioned by Pougin; in his biography of Balfe, however, William Alexander Barret states that the two primadonnas of La Zingara (an Italian version of The bohemian girl, which was given in the first experimental winter season at Her Majesty's Theatre, in 1858) were Alboni and Marietta Piccolomini (Balfe: His Life and Work, London, Remington, 1882, p. 229; accessible for free online at [https://archive.org/stream/cu31924021747781#page/n245/mode/2up Open Library.org]). Considering that the latter certainly performed the soprano leggiero part of Arline (cf., for instance, [http://www.musicwithease.com/balfe-bohemian-girl-annals.html Music with ease]. Retrieved 15 October 2011), it follows that Alboni expectedly interpreted the contralto role of the Gypsy Queen.\n* Les Huguenots, by Meyerbeer – The page (Urbain). Marietta Alboni. http://en.wikipedia.org/?curid=20203."
  }
}
