{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18837",
  "eid" : "34efb0a0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778598058,
  "textBody" : "The median is the value separating the higher half of a data sample, a population, or a probability distribution, from the lower half. For a data set, it may be thought of as the \"middle\" value. For example, in the data set {1, 3, 3, 6, 7, 8, 9}, the median is 6, the fourth largest, and also the fourth smallest, number in the sample. For a continuous probability distribution, the median is the value such that a number is equally likely to fall above or below it.\n\nThe median is a commonly used measure of the properties of a data set in statistics and probability theory. The basic advantage of the median in describing data compared to the mean (often simply described as the \"average\") is that it is not skewed so much by extremely large or small values, and so it may give a better idea of a \"typical\" value. For example, in understanding statistics like household income or assets which vary greatly, a mean may be skewed by a small number of extremely high or low values. Median income, for example, may be a better way to suggest what a \"typical\" income is.\n\nBecause of this, the median is of central importance in robust statistics, as it is the most resistant statistic, having a breakdown point of 50%: so long as no more than half the data are contaminated, the median will not give an arbitrarily large or small result.\n\nFinite set of numbers\n\nThe median of a finite list of numbers can be found by arranging all the numbers from smallest to greatest.\n\nIf there is an odd number of numbers, the middle one is picked. For example, consider the list of numbers\n\n1, 3, 3, 6, 7, 8, 9\n\nThis list contains seven numbers. The median is the fourth of them, which is 6.\n\nIf there is an even number of observations, then there is no single middle value; the median is then usually defined to be the mean of the two middle values.Simon, Laura J.; [http://www.stat.psu.edu/old_resources/ClassNotes/ljs_07/sld008.htm \"Descriptive statistics\"] , Statistical Education Resource Kit, Pennsylvania State Department of Statistics For example, in the data set\n\n1, 2, 3, 4, 5, 6, 8, 9\n\nthe median is the mean of the middle two numbers: this is (4 + 5) ÷ 2, which is 4.5 or 4 1/2. (In more technical terms, this interprets the median as the fully trimmed mid-range).\n\nThe formula used to find the middle number of a data set of n numerically ordered numbers is (n + 1) ÷ 2. This either gives the middle number (for an odd number of values) or the halfway point between the two middle values. For example, with 14 values, the formula will give 7.5, and the median will be taken by averaging the seventh and eighth values. So median can be represented by the following formula:\n\nmedian(a) = \\frac{a_{\\lfloor\\#x \\div 2\\rfloor} + a_{\\lfloor\\#x \\div 2 + 0.5\\rfloor}}{2}\n\nOne can find the median using the Stem-and-Leaf Plot.\n\nThere is no widely accepted standard notation for the median, but some authors represent the median of a variable x either as x͂ or as μ1/2 sometimes also M. In any of these cases, the use of these or other symbols for the median needs to be explicitly defined when they are introduced.\n\nThe median is used primarily for skewed distributions, which it summarizes differently from the arithmetic mean. Consider the multiset { 1, 2, 2, 2, 3, 14 }. The median is 2 in this case, (as is the mode), and it might be seen as a better indication of central tendency (less susceptible to the exceptionally large value in data) than the arithmetic mean of 4.\n\nThe median is a popular summary statistic used in descriptive statistics, since it is simple to understand and easy to calculate, while also giving a measure that is more robust in the presence of outlier values than is the mean. The widely cited empirical relationship between the relative locations of the mean and the median for skewed distributions is, however, not generally true. There are, however, various relationships for the absolute difference between them; see below.\n\nWith an even number of observations (as shown above) no value need be exactly at the value of the median. Nonetheless, the value of the median is uniquely determined with the usual definition. A related concept, in which the outcome is forced to correspond to a member of the sample, is the medoid.\n\nIn a population, at most half have values strictly less than the median and at most half have values strictly greater than it. If each group contains less than half the population, then some of the population is exactly equal to the median. For example, if a \n\nThe median can be used as a measure of location when a distribution is skewed, when end-values are not known, or when one requires reduced importance to be attached to outliers, e.g., because they may be measurement errors.\n\nA median is only defined on ordered one-dimensional data, and is independent of any distance metric. A geometric median, on the other hand, is defined in any number of dimensions.\n\nThe median is one of a number of ways of summarising the typical values associated with members of a statistical population; thus, it is a possible location parameter. The median is the 2nd quartile, 5th decile, and 50th percentile. Since the median is the same as the second quartile, its calculation is illustrated in the article on quartiles. A median can be worked out for ranked but not numerical classes (e.g. working out a median grade when students are graded from A to F), although the result might be halfway between grades if there is an even number of cases.\n\nWhen the median is used as a location parameter in descriptive statistics, there are several choices for a measure of variability: the range, the interquartile range, the mean absolute deviation, and the median absolute deviation.\n\nFor practical purposes, different measures of location and dispersion are often compared on the basis of how well the corresponding population values can be estimated from a sample of data. The median, estimated using the sample median, has good properties in this regard. While it is not usually optimal if a given population distribution is assumed, its properties are always reasonably good. For example, a comparison of the efficiency of candidate estimators shows that the sample mean is more statistically efficient than the sample median when data are uncontaminated by data from heavy-tailed distributions or from mixtures of distributions, but less efficient otherwise, and that the efficiency of the sample median is higher than that for a wide range of distributions. More specifically, the median has a 64% efficiency compared to the minimum-variance mean (for large normal samples), which is to say the variance of the median will be ~50% greater than the variance of the mean—see asymptotic efficiency and references therein.\n\nProbability distributions\n\nFor any probability distribution on the real line R with cumulative distribution function F, regardless of whether it is any kind of continuous probability distribution, in particular an absolutely continuous distribution (which has a probability density function), or a discrete probability distribution, a median is by definition any real number m that satisfies the inequalities\n\n\\operatorname{P}(X\\leq m) \\geq \\frac{1}{2}\\text{ and }\\operatorname{P}(X\\geq m) \\geq \\frac{1}{2}\\,\\!\n\nor, equivalently, the inequalities\n\n\\int_{(-\\infty,m]} dF(x) \\geq \\frac{1}{2}\\text{ and }\\int_{[m,\\infty)} dF(x) \\geq \\frac{1}{2}\\,\\!\n\nin which a Lebesgue–Stieltjes integral is used. For an absolutely continuous probability distribution with probability density function ƒ, the median satisfies\n\n\\operatorname{P}(X\\leq m) \\operatorname{P}(X\\geq m)\n\\int_{-\\infty}^m f(x)\\, dx=\\frac{1}{2}.\\,\\!\n\nAny probability distribution on R has at least one median, but there may be more than one median. Where exactly one median exists, statisticians speak of \"the median\" correctly; even when the median is not unique, some statisticians speak of \"the median\" informally.\n\nMedians of particular distributions\n\nThe medians of certain types of distributions can be easily calculated from their parameters; furthermore, they exist even for some distributions lacking a well-defined mean, such as the Cauchy distribution:\n\n* The median of a symmetric unimodal distribution coincides with the mode.\n* The median of a symmetric distribution which possesses a mean μ also takes the value μ.\n** The median of a normal distribution with mean μ and variance σ2 is μ. In fact, for a normal distribution, mean median \n mode.\n** The median of a uniform distribution in the interval [a, b] is (a + b) / 2, which is also the mean.\n* The median of a Cauchy distribution with location parameter x0 and scale parameter y is x0, the location parameter.\n* The median of a power law distribution x−a, with exponent a > 1 is 21/(a − 1)xmin, where xmin is the minimum value for which the power law holds[https://arxiv.org/pdf/cond-mat/0412004.pdf Newman, Mark EJ. \"Power laws, Pareto distributions and Zipf's law.\" Contemporary physics 46.5 (2005): 323–351.]\n* The median of an exponential distribution with rate parameter λ is the natural logarithm of 2 divided by the rate parameter: λ−1ln 2.\n* The median of a Weibull distribution with shape parameter k and scale parameter λ is λ(ln 2)1/k.\n\nPopulations\n\nOptimality property\n\nThe mean absolute error of a real variable c with respect to the random variable X is\nE(\\left|X-c\\right|)\\,\nProvided that the probability distribution of X is such that the above expectation exists, then m is a median of  X if and only if m is a minimizer of the mean absolute error with respect to X. In particular, m is a sample median if and only if m minimizes the arithmetic mean of the absolute deviations.\n\nMore generally, a median is defined as a minimum of \nE(|X-c| - |X| ), \nas discussed below in the section on multivariate medians (specifically, the spatial median).\n\nThis optimization-based definition of the median is useful in statistical data-analysis, for example, in k-medians clustering.\n\nUnimodal distributions\n\nIt can be shown for a unimodal distribution that the median \\tilde{X} and the mean \\bar{X} lie within (3/5)1/2 ≈ 0.7746 standard deviations of each other. In symbols,\n\n\\frac{\\left|\\tilde{X} - \\bar{X}\\right|}{\\sigma} \\le \\left(\\frac{3}{5}\\right)^\\frac{1}{2}\n\nwhere |·| is the absolute value.\n\nA similar relation holds between the median and the mode: they lie within 31/2 ≈ 1.732 standard deviations of each other:\n\n\\frac{\\sigma} \\le 3^\\frac{1}{2}.\n\nInequality relating means and medians\n\nIf the distribution has finite variance, then the distance between the median and the mean is bounded by one standard deviation.\n\nThis bound was proved by Mallows, who used Jensen's inequality twice, as follows. We have\n\n\\begin{align}\n  |\\mu - m| = |\\operatorname{E}(X - m)| & \\leq \\operatorname{E}(|X - m|) \\\\\n                                        & \\leq \\operatorname{E}(|X - \\mu|) \\\\\n                                        & \\leq \\sqrt{\\operatorname{E}\\left((X - \\mu)^2\\right)} = \\sigma.\n\\end{align}\n\nThe first and third inequalities come from Jensen's inequality applied to the absolute-value function and the square function, which are each convex.  The second inequality comes from the fact that a median minimizes the absolute deviation function\n\na \\mapsto \\operatorname{E}(|X-a|).\\,\n\nThis proof also follows directly from Cantelli's inequality.[http://www.montefiore.ulg.ac.be/~kvansteen/MATH0008-2/ac20112012/Class3/Chapter2_ac1112_vfinalPartII.pdf K.Van Steen Notes on probability and statistics ] \nThe result can be generalized to obtain a multivariate version of the inequality, as follows:\n\\begin{align}\n  \\|\\mu - m\\| = \\| \\operatorname{E}(X - m)\\| \n    & \\leq  \\operatorname{E}\\|X - m\\|  \\\\\n    & \\leq  \\operatorname{E}(\\| X - \\mu\\| ) \\\\\n    & \\leq \\sqrt{ \\operatorname{E}\\left(\\|X - \\mu\\|^2\\right) }\n      = \\sqrt{ \\operatorname{trace}\\left(\\operatorname{var}(X)\\right) }\n\\end{align}\n\nwhere m is a spatial median, that is, a minimizer of the function\na \\mapsto \\operatorname{E}(\\|X-a\\|).\\, The spatial median is unique when the data-set's dimension is two or more. An alternative proof uses the one-sided Chebyshev inequality; it appears in an inequality on location and scale parameters.\n\nJensen's inequality for medians\n\nJensen's inequality states that for any random variable x with a finite expectation E(x) and for any convex function f\n\n f[ E(x) ] \\le E[ f(x) ] \n\nIt has been shown that if x is a real variable with a unique median m and f is a C function then\n\n f(m) \\le \\operatorname{Median}[ f(x)] \n\nA C function is a real valued function, defined on the set of real numbers R, with the property that for any real t\n\n f^{-1}\\left( \\,(-\\infty, t]\\, \\right) = \\{ x \\in R \\mid f(x) \\le t \\} \n\nis a closed interval, a singleton or an empty set.\n\nMedians for samples\n\nThe sample median\n\n Efficient computation of the sample median\n\nEven though comparison-sorting n items requires  operations, selection algorithms can compute the 'th-smallest of  items with only  operations. This includes the median, which is the 'th order statistic (or for an even number of samples, the arithmetic mean of the two middle order statistics).\n\nSelection algorithms still have the downside of requiring  memory, that is, they need to have the full sample (or a linear-sized portion of it) in memory. Because this, as well as the linear time requirement, can be prohibitive, several estimation procedures for the median have been developed. A simple one is the median of three rule, which estimates the median as the median of a three-element subsample; this is commonly used as a subroutine in the quicksort sorting algorithm, which uses an estimate of its input's median. A more robust estimator is Tukey's ninther, which is the median of three rule applied with limited recursion: if  is the sample laid out as an array, and\n\n,\n\nthen\n\nThe remedian is an estimator for the median that requires linear time but sub-linear memory, operating in a single pass over the sample.\n\nEasy explanation of the sample median\n\nIn individual series (if number of observation is very low) first one must arrange all the observations in order. Then count(n) is the total number of observation in given data.\n\nIf n is odd then Median (M) = value of ((n + 1)/2)th item term.\n\nIf n is even then Median (M) = value of [(n/2)th item term + (n/2 + 1)th item term]/2\n\n;For an odd number of values\n\nAs an example, we will calculate the sample median for the following set of observations: 1, 5, 2, 8, 7.\n\nStart by sorting the values: 1, 2, 5, 7, 8.\n\nIn this case, the median is 5 since it is the middle observation in the ordered list.\n\nThe median is the ((n + 1)/2)th item, where n is the number of values. For example, for the list {1, 2, 5, 7, 8}, we have n = 5, so the median is the ((5 + 1)/2)th item.\nmedian = (6/2)th item\nmedian = 3rd item\nmedian = 5\n\n;For an even number of values\n\nAs an example, we will calculate the sample median for the following set of observations: 1, 6, 2, 8, 7, 2.\n\nStart by sorting the values: 1, 2, 2, 6, 7, 8.\n\nIn this case, the arithmetic mean of the two middlemost terms is (2 + 6)/2 = 4. Therefore, the median is 4 since it is the arithmetic mean of the middle observations in the ordered list.\n\nWe also use this formula MEDIAN {(n + 1 )/2}th item . n \n number of values\n\nAs above example 1, 2, 2, 6, 7, 8\nn 6 Median \n {(6 + 1)/2}th item = 3.5th item.  In this case, the median is average of the 3rd number and the next one (the fourth number).  The median is (2 + 6)/2 which is 4.\n\nSampling distribution\n\nThe distributions of both the sample mean and the sample median were determined by Laplace. The distribution of the sample median from a population with a density function f(x) is asymptotically normal with mean m and variance\n\n \\frac{ 1 }{ 4n f( m )^2 }\n\nwhere m is the median of f(x) and n is the sample size.\n\nThese results have also been extended. It is now known for the p-th quantile that the distribution of the sample p-th quantile is asymptotically normal around the p-th quantile with variance equal to\n \\frac{p( 1 - p )}{nf(x_p)^2}\nwhere f(x_{p}) is the value of the distribution density at the p-th quantile.\n\nIn the case of a discrete variable, the sampling distribution of the median for small-samples can be investigated as follows.  We take the sample size to be an odd number  N = 2n + 1 .  If a given value  v  is to be the median of the sample then two conditions must be satisfied.  The first is that at most  n  observations can have a value of  v - 1  or less.  The second is that at most  n  observations can have a value of  v + 1  or more.  Let  i  be the number of observations which have a value of  v - 1  or less and let  k  be the number of observations which have a value of  v + 1  or more.  Then  i  and  k  both have a minimum value of 0 and a maximum of  n .  If an observation has a value below  v , it is not relevant how far below  v  it is and conversely, if an observation has a value above  v , it is not relevant how far above  v  it is.  We can therefore represent the observations as following a trinomial distribution with probabilities   F(v - 1) ,  f(v)  and   1 - F(v) .  The probability that the median  m  will have a value  v  is then given by\n\n \\Pr(m v) \n \\sum_{i0}^n \\sum_{k\n0}^n \\frac{N!}{i!(N-i-k)!k!} [F(v-1)]^i [f(v)]^{N-i-k} [1 - F(v)]^k. \n\nSumming this over all values of  v  defines a proper distribution and gives a unit sum.  In practice, the function  f(v)  will often not be known but it can be estimated from an observed frequency distribution.  An example is given in the following table where the actual distribution is not known but a sample of 3,800 observations allows a sufficiently accurate assessment of  f(v) .\n\nUsing these data it is possible to investigate the effect of sample size on the standard errors of the mean and median.  The observed mean is 3.16, the observed raw median is 3 and the observed interpolated median is 3.174.  The following table gives some comparison statistics.  The standard error of the median is given both from the above expression for  pr(m = v)  and from the asymptotic approximation given earlier.\n\nThe expected value of the median falls slightly as sample size increases while, as would be expected, the standard errors of both the median and the mean are proportionate to the inverse square root of the sample size.  The asymptotic approximation errs on the side of caution by overestimating the standard error.\n\nIn the case of a continuous variable, the following argument can be used.  If a given value  v  is to be the median, then one observation must take the value  v .  The elemental probability of this is  f(v)\\,dv .  Then, of the remaining  2n  observations, exactly  n  of them must be above  v  and the remaining  n  below.  The probability of this is the  n th term of a binomial distribution with parameters  F(v)  and  2n .  Finally we multiply by  2n+1  since any of the observations in the sample can be the median observation.  Hence the elemental probability of the median at the point  v   is given by\n\n f(v) \\frac{(2n)!}{n!n!} [F(v)]^n [1 - F(v)]^n (2n + 1) \\, dv. \n\nNow we introduce the beta function.  For integer arguments  \\alpha  and  \\beta , this can be expressed as  \\Beta(\\alpha,\\beta) (\\alpha - 1)! (\\beta - 1)! / (\\alpha + \\beta - 1)! .  Also, we note that  f(v) \n dF(v)/dv .  Using these relationships and setting both  \\alpha  and  \\beta  equal to   (n+1)  allows the last expression to be written as\n\n \\frac{[F(v)]^n[1 - F(v)]^n}{\\Beta(n+1,n+1)} \\, dF(v) \n\nHence the density function of the median is a symmetric beta distribution over the unit interval which supports  F(v) .  Its mean, as we would expect, is 0.5 and its variance is   1/(4(N+2)) . The corresponding variance of the sample median is\n\n\\frac{ 1 }{ 4 (N + 2) f( m )^2 }.\n\nHowever this finding can only be used if the density function  f(v)  is known or can be assumed.  As this will not always be the case, the median variance has to be estimated sometimes from the sample data.\n\n;Estimation of variance from sample data\n\nThe value of (2 f(x))^{-2}—the asymptotic value of n^{-\\frac{1}{2}} (\\nu - m) where \\nu is the population median—has been studied by several authors. The standard \"delete one\" jackknife method produces inconsistent results. An alternative—the \"delete k\" method—where k grows with the sample size has been shown to be asymptotically consistent. This method may be computationally expensive for large data sets. A bootstrap estimate is known to be consistent, but converges very slowly (order of n^{-\\frac{1}{4}}). Other methods have been proposed but their behavior may differ between large and small samples.\n\n;Efficiency\n\nThe efficiency of the sample median, measured as the ratio of the variance of the mean to the variance of the median, depends on the sample size and on the underlying population distribution. For a sample of size N = 2n + 1 from the normal distribution, the efficiency for large N is\n\n \\frac{2}{\\pi} \\frac{N+2}{N} \n\nThe efficiency tends to  \\frac{2}{\\pi}  as N tends to infinity.\n\nOther estimators\n\nFor univariate distributions that are symmetric about one median, the Hodges–Lehmann estimator is a robust and highly efficient estimator of the population median.\n\nIf data are represented by a statistical model specifying a particular family of probability distributions, then estimates of the median can be obtained by fitting that family of probability distributions to the data and calculating the theoretical median of the fitted distribution. Pareto interpolation is an application of this when the population is assumed to have a Pareto distribution.\n\nCoefficient of dispersion\n\nThe coefficient of dispersion (CD) is defined as the ratio of the average absolute deviation from the median to the median of the data.Bonett DG, Seier E (2006) Confidence interval for a coefficient of dispersion in non-normal distributions. Biometrical Journal 48 (1) 144–148 It is a statistical measure used by the states of Iowa, New York and South Dakota in estimating dues taxes. In symbols\n\n CD = \\frac{ 1 }{ n } \\frac{ \\sum| m - x | }{ m } \n\nwhere n is the sample size, m is the sample median and x is a variate. The sum is taken over the whole sample.\n\nConfidence intervals for a two-sample test in which the sample sizes are large have been derived by Bonett and Seier This test assumes that both samples have the same median but differ in the dispersion around it. The confidence interval (CI) is bounded inferiorly by\n\n \\exp \\left[ \\log \\left( \\frac{t_a} {t_b} \\right) - z_\\alpha \\left( \\operatorname{var} \\left[ \\log \\left( \\frac{t_a} {t_b} \\right) \\right] \\right)^\\frac{1}{2} \\right] \n\nwhere tj is the mean absolute deviation of the jth sample, var() is the variance and zα is the value from the normal distribution for the chosen value of α: for α 0.05, zα \n 1.96. The following formulae are used in the derivation of these confidence intervals\n\n \\operatorname{var} [ \\log ( t_a ) ] = \\frac{1}{n} \\left[ \\frac{ s_a^2 } { t_a^2 } + \\left( \\frac{x_a - \\bar{x}} {t_a} \\right)^2 - 1 \\right] \n\n \\operatorname{var} \\left[ \\log\\left( \\frac{t_a}{t_b} \\right) \\right] = \\operatorname{var}[ \\log( t_a ) ] + \\operatorname{var}[ \\log( t_b )] - 2r (\\operatorname{var}[ \\log(t_a) ] \\operatorname{var}[ \\log( t_b ) ] )^\\frac{1}{2} \n\nwhere r is the Pearson correlation coefficient between the squared deviation scores\n\n d_{ia} | x_{ia} - \\bar{x}_a |  and  d_{ib} \n |x_{ib} - \\bar{x}_b | \n\na and b here are constants equal to 1 and 2, x is a variate and s is the standard deviation of the sample.\n\nMultivariate median\n\nPreviously, this article discussed the univariate median, when the sample or population had one-dimension. When the dimension is two or higher, there are multiple concepts that extend the definition of the univariate median; each such multivariate median agrees with the univariate median when the dimension is exactly one.Small, Christopher G. \"A survey of multidimensional medians.\" International Statistical Review/Revue Internationale de Statistique (1990): 263–277.  Niinimaa, A., and H. Oja. \"Multivariate median.\" Encyclopedia of statistical sciences (1999).Mosler, Karl. Multivariate Dispersion, Central Regions, and Depth: The Lift Zonoid Approach. Vol. 165. Springer Science & Business Media, 2012.\n\nMedoid \n\nLet  be a set of  points in a space with a distance function d. Medoid is defined as\n\n{\\displaystyle x_{\\text{medoid}}{\\text{argmin}}_{y\\in \\{x_{1},x_{2},\\cdots ,x_{n}\\}}\\sum _{i\n1}^{n}d(y,x_{i}).} \n\nThe medoid is often used in clustering using the k-medoid algorithm.\n\nMarginal median\n\nThe marginal median is defined for vectors defined with respect to a fixed set of coordinates. A marginal median is defined to be the vector whose components are univariate medians. The marginal median is easy to compute, and its properties were studied by Puri and Sen.Puri, Madan L.; Sen, Pranab K.; Nonparametric Methods in Multivariate Analysis, John Wiley & Sons, New York, NY, 197l. (Reprinted by Krieger Publishing)\n\nSpatial median\n\nFor N vectors in a normed vector space, a spatial median  minimizes the average distance\n\na \\mapsto \\frac 1 N \\sum_n (\\|x_n-a\\|), \\,\n\nwhere xn and a are vectors. The spatial median is unique when the data-set's dimension is two or more and the norm is the Euclidean norm (or another strictly convex norm). The spatial median is also called the L1 median, even when the norm is Euclidean. Other names are used especially for finite sets of points: geometric median, Fermat point (in mechanics), or Weber or Fermat-Weber point (in geographical location theory).\n\n In the special case where the norm is an L1-norm, then the spatial median and the marginal median are the same.\n\nMore generally, a spatial median is defined as a minimizer of\n\na \\mapsto \\frac 1 N \\sum_n{(\\|x_n-a\\| - \\|x_n\\|)}; \n\nthis general definition is convenient for defining a spatial median of a population in a finite-dimensional normed space, for example, for distributions without a finite mean. Spatial medians are defined for random vectors with values in a Banach space.\n\nThe spatial median is a robust and highly efficient estimator of a central tendency of a population.\n\nOther multivariate medians\n\nAn alternative generalization of the spatial median in higher dimensions that does not relate to a particular metric is the centerpoint.\n\nOther median-related concepts\n\nInterpolated median\n\nWhen dealing with a discrete variable, it is sometimes useful to regard the observed values as being midpoints of underlying continuous intervals. An example of this is a Likert scale, on which opinions or preferences are expressed on a scale with a set number of possible responses. If the scale consists of the positive integers, an observation of 3 might be regarded as representing the interval from 2.50 to 3.50. It is possible to estimate the median of the underlying variable. If, say, 22% of the observations are of value 2 or below and 55.0% are of 3 or below (so 33% have the value 3), then the median  m  is 3 since the median is the smallest value of  x  for which  F(x)  is greater than a half. But the interpolated median is somewhere between 2.50 and 3.50.  First we add half of the interval width  w  to the median to get the upper bound of the median interval. Then we subtract that proportion of the interval width which equals the proportion of the 33% which lies above the 50% mark.  In other words, we split up the interval width pro rata to the numbers of observations.  In this case, the 33% is split into 28% below the median and 5% above it so we subtract 5/33 of the interval width from the upper bound of 3.50 to give an interpolated median of 3.35. More formally, if the values  f(x)  are known, the interpolated median can be calculated from\n\n m_\\text{int} = m + w\\left[\\frac{1}{2} - \\frac{F( m ) - \\frac{1}{2} }{f( m )}\\right]. \n\nAlternatively, if in an observed sample there are  k  scores above the median category,  j  scores in it and  i  scores below it then the interpolated median is given by\n\n m_\\text{int} = m + \\frac{w}{2} \\left[\\frac{k - i} j\\right]. \n\nPseudo-median\n\nFor univariate distributions that are symmetric about one median, the Hodges–Lehmann estimator is a robust and highly efficient estimator of the population median; for non-symmetric distributions, the Hodges–Lehmann estimator is a robust and highly efficient estimator of the population pseudo-median, which is the median of a symmetrized distribution and which is close to the population median. The Hodges–Lehmann estimator has been generalized to multivariate distributions.\n\nVariants of regression\n\nThe Theil–Sen estimator is a method for robust linear regression based on finding medians of slopes..\n\nMedian filter\n\nIn the context of image processing of monochrome raster images there is a type of noise, known as the salt and pepper noise, when each pixel independently becomes black (with some small probability) or white (with some small probability), and is unchanged otherwise (with the probability close to 1). An image constructed of median values of neighborhoods (like 3×3 square) can effectively reduce noise in this case.\n\nCluster analysis\n\nIn cluster analysis, the k-medians clustering algorithm provides a way of defining clusters, in which the criterion of maximising the distance between cluster-means that is used in k-means clustering, is replaced by maximising the distance between cluster-medians.\n\nMedian–median line\n\nThis is a method of robust regression. The idea dates back to Wald in 1940 who suggested dividing a set of bivariate data into two halves depending on the value of the independent parameter x: a left half with values less than the median and a right half with values greater than the median. He suggested taking the means of the dependent y and independent x variables of the left and the right halves and estimating the slope of the line joining these two points. The line could then be adjusted to fit the majority of the points in the data set.\n\nNair and Shrivastava in 1942 suggested a similar idea but instead advocated dividing the sample into three equal parts before calculating the means of the subsamples. Brown and Mood in 1951 proposed the idea of using the medians of two subsamples rather the means. Tukey combined these ideas and recommended dividing the sample into three equal size subsamples and estimating the line based on the medians of the subsamples.\n\nMedian-unbiased estimators\n\nAny mean-unbiased estimator minimizes the risk (expected loss) with respect to the squared-error loss function, as observed by Gauss. A median-unbiased estimator minimizes the risk with respect to the absolute-deviation loss function, as observed by Laplace. Other loss functions are used in statistical theory, particularly in robust statistics.\n\nThe theory of median-unbiased estimators was revived by [https://web.archive.org/web/20110310043642/http://www.universityofcalifornia.edu/senate/inmemoriam/georgewbrown.htm George W. Brown] in 1947:\n\nFurther properties of median-unbiased estimators have been reported.  Median-unbiased estimators are invariant under one-to-one transformations.\n\nThere are methods of construction median-unbiased estimators that are optimal (in a sense analogous to minimum-variance property considered for mean-unbiased estimators). Such constructions exist for probability distributions having monotone likelihood-functions.Pfanzagl, Johann. \"On optimal median unbiased estimators in the presence of nuisance parameters.\" The Annals of Statistics (1979): 187–193.Brown, L. D.; Cohen, Arthur; Strawderman, W. E. A Complete Class Theorem for Strict Monotone Likelihood Ratio With Applications. Ann. Statist. 4 (1976), no. 4, 712–722. . http://projecteuclid.org/euclid.aos/1176343543. One such procedure is an analogue of the Rao–Blackwell procedure for mean-unbiased estimators: The procedure holds for a smaller class of probability distributions than does the Rao—Blackwell procedure but for a larger class of loss functions.Page 713: Brown, L. D.; Cohen, Arthur; Strawderman, W. E. A Complete Class Theorem for Strict Monotone Likelihood Ratio With Applications. Ann. Statist. 4 (1976), no. 4, 712–722. . http://projecteuclid.org/euclid.aos/1176343543.\n\nHistory\n\nThe idea of the median appeared in the 13th century in the Talmud [http://danadler.com/blog/2014/12/31/talmud-and-modern-economics/ Talmud and Modern Economics][http://www.wisdom.weizmann.ac.il/math/AABeyond12/presentations/Aumann.pdf Modern Economic Theory in the Talmud] by Yisrael Aumann (further  for possible older mentions)\n\nThe idea of the median also appeared later in Edward Wright's book on navigation (Certaine Errors in Navigation) in 1599 in a section concerning the determination of location with a compass. Wright felt that this value was the most likely to be the correct value in a series of observations.\n\nIn 1757, Roger Joseph Boscovich developed a regression method based on the L1 norm and therefore implicitly on the median.\n\nIn 1774, Laplace suggested the median be used as the standard estimator of the value of a posterior pdf. The specific criterion was to minimize the expected magnitude of the error; |\\alpha - \\alpha^{*}| where \\alpha^{*} is the estimate and \\alpha is the true value. Laplaces's criterion was generally rejected for 150 years in favor of the least squares method of Gauss and Legendre which minimizes (\\alpha - \\alpha^{*})^{2} to obtain the mean. The distribution of both the sample mean and the sample median were determined by Laplace in the early 1800s.Laplace PS de (1818) Deuxième supplément à la Théorie Analytique des Probabilités, Paris, Courcier\n\nAntoine Augustin Cournot in 1843 was the first to use the term median (valeur médiane) for the value that divides a probability distribution into two equal halves. Gustav Theodor Fechner used the median (Centralwerth) in sociological and psychological phenomena.Keynes, J.M. (1921) A Treatise on Probability. Pt II Ch XVII §5 (p 201) (2006 reprint, Cosimo Classics,  : multiple other reprints) It had earlier been used only in astronomy and related fields. Gustav Fechner popularized the median into the formal analysis of data, although it had been used previously by Laplace.\n\nFrancis Galton used the English term median in 1881,Galton F (1881) \"Report of the Anthropometric Committee\" pp 245–260. [https://www.biodiversitylibrary.org/item/94448 Report of the 51st Meeting of the British Association for the Advancement of Science] having earlier used the terms middle-most value in 1869, and the medium in 1880.[https://www.encyclopediaofmath.org/index.php/Galton,_Francis encyclopediaofmath.org][http://www.personal.psu.edu/users/e/c/ecb5/Courses/M475W/WeeklyReadings/Week%2013/DevelopmentOfModernStatistics.pdf  personal.psu.edu]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Median" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18837" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The median is the value separating the higher half of a data sample, a population, or a probability distribution, from the lower half. For a data set, it may be thought of as the \"middle\" value. For example, in the data set {1, 3, 3, 6, 7, 8, 9}, the median is 6, the fourth largest, and also the fourth smallest, number in the sample. For a continuous probability distribution, the median is the value such that a number is equally likely to fall above or below it.\n\nThe median is a commonly used measure of the properties of a data set in statistics and probability theory. The basic advantage of the median in describing data compared to the mean (often simply described as the \"average\") is that it is not skewed so much by extremely large or small values, and so it may give a better idea of a \"typical\" value. For example, in understanding statistics like household income or assets which vary greatly, a mean may be skewed by a small number of extremely high or low values. Median income, for example, may be a better way to suggest what a \"typical\" income is.\n\nBecause of this, the median is of central importance in robust statistics, as it is the most resistant statistic, having a breakdown point of 50%: so long as no more than half the data are contaminated, the median will not give an arbitrarily large or small result.\n\nFinite set of numbers\n\nThe median of a finite list of numbers can be found by arranging all the numbers from smallest to greatest.\n\nIf there is an odd number of numbers, the middle one is picked. For example, consider the list of numbers\n\n1, 3, 3, 6, 7, 8, 9\n\nThis list contains seven numbers. The median is the fourth of them, which is 6.\n\nIf there is an even number of observations, then there is no single middle value; the median is then usually defined to be the mean of the two middle values.Simon, Laura J.; [http://www.stat.psu.edu/old_resources/ClassNotes/ljs_07/sld008.htm \"Descriptive statistics\"] , Statistical Education Resource Kit, Pennsylvania State Department of Statistics For example, in the data set\n\n1, 2, 3, 4, 5, 6, 8, 9\n\nthe median is the mean of the middle two numbers: this is (4 + 5) ÷ 2, which is 4.5 or 4 1/2. (In more technical terms, this interprets the median as the fully trimmed mid-range).\n\nThe formula used to find the middle number of a data set of n numerically ordered numbers is (n + 1) ÷ 2. This either gives the middle number (for an odd number of values) or the halfway point between the two middle values. For example, with 14 values, the formula will give 7.5, and the median will be taken by averaging the seventh and eighth values. So median can be represented by the following formula:\n\nmedian(a) = \\frac{a_{\\lfloor\\#x \\div 2\\rfloor} + a_{\\lfloor\\#x \\div 2 + 0.5\\rfloor}}{2}\n\nOne can find the median using the Stem-and-Leaf Plot.\n\nThere is no widely accepted standard notation for the median, but some authors represent the median of a variable x either as x͂ or as μ1/2 sometimes also M. In any of these cases, the use of these or other symbols for the median needs to be explicitly defined when they are introduced.\n\nThe median is used primarily for skewed distributions, which it summarizes differently from the arithmetic mean. Consider the multiset { 1, 2, 2, 2, 3, 14 }. The median is 2 in this case, (as is the mode), and it might be seen as a better indication of central tendency (less susceptible to the exceptionally large value in data) than the arithmetic mean of 4.\n\nThe median is a popular summary statistic used in descriptive statistics, since it is simple to understand and easy to calculate, while also giving a measure that is more robust in the presence of outlier values than is the mean. The widely cited empirical relationship between the relative locations of the mean and the median for skewed distributions is, however, not generally true. There are, however, various relationships for the absolute difference between them; see below.\n\nWith an even number of observations (as shown above) no value need be exactly at the value of the median. Nonetheless, the value of the median is uniquely determined with the usual definition. A related concept, in which the outcome is forced to correspond to a member of the sample, is the medoid.\n\nIn a population, at most half have values strictly less than the median and at most half have values strictly greater than it. If each group contains less than half the population, then some of the population is exactly equal to the median. For example, if a \n\nThe median can be used as a measure of location when a distribution is skewed, when end-values are not known, or when one requires reduced importance to be attached to outliers, e.g., because they may be measurement errors.\n\nA median is only defined on ordered one-dimensional data, and is independent of any distance metric. A geometric median, on the other hand, is defined in any number of dimensions.\n\nThe median is one of a number of ways of summarising the typical values associated with members of a statistical population; thus, it is a possible location parameter. The median is the 2nd quartile, 5th decile, and 50th percentile. Since the median is the same as the second quartile, its calculation is illustrated in the article on quartiles. A median can be worked out for ranked but not numerical classes (e.g. working out a median grade when students are graded from A to F), although the result might be halfway between grades if there is an even number of cases.\n\nWhen the median is used as a location parameter in descriptive statistics, there are several choices for a measure of variability: the range, the interquartile range, the mean absolute deviation, and the median absolute deviation.\n\nFor practical purposes, different measures of location and dispersion are often compared on the basis of how well the corresponding population values can be estimated from a sample of data. The median, estimated using the sample median, has good properties in this regard. While it is not usually optimal if a given population distribution is assumed, its properties are always reasonably good. For example, a comparison of the efficiency of candidate estimators shows that the sample mean is more statistically efficient than the sample median when data are uncontaminated by data from heavy-tailed distributions or from mixtures of distributions, but less efficient otherwise, and that the efficiency of the sample median is higher than that for a wide range of distributions. More specifically, the median has a 64% efficiency compared to the minimum-variance mean (for large normal samples), which is to say the variance of the median will be ~50% greater than the variance of the mean—see asymptotic efficiency and references therein.\n\nProbability distributions\n\nFor any probability distribution on the real line R with cumulative distribution function F, regardless of whether it is any kind of continuous probability distribution, in particular an absolutely continuous distribution (which has a probability density function), or a discrete probability distribution, a median is by definition any real number m that satisfies the inequalities\n\n\\operatorname{P}(X\\leq m) \\geq \\frac{1}{2}\\text{ and }\\operatorname{P}(X\\geq m) \\geq \\frac{1}{2}\\,\\!\n\nor, equivalently, the inequalities\n\n\\int_{(-\\infty,m]} dF(x) \\geq \\frac{1}{2}\\text{ and }\\int_{[m,\\infty)} dF(x) \\geq \\frac{1}{2}\\,\\!\n\nin which a Lebesgue–Stieltjes integral is used. For an absolutely continuous probability distribution with probability density function ƒ, the median satisfies\n\n\\operatorname{P}(X\\leq m) \\operatorname{P}(X\\geq m)\n\\int_{-\\infty}^m f(x)\\, dx=\\frac{1}{2}.\\,\\!\n\nAny probability distribution on R has at least one median, but there may be more than one median. Where exactly one median exists, statisticians speak of \"the median\" correctly; even when the median is not unique, some statisticians speak of \"the median\" informally.\n\nMedians of particular distributions\n\nThe medians of certain types of distributions can be easily calculated from their parameters; furthermore, they exist even for some distributions lacking a well-defined mean, such as the Cauchy distribution:\n\n* The median of a symmetric unimodal distribution coincides with the mode.\n* The median of a symmetric distribution which possesses a mean μ also takes the value μ.\n** The median of a normal distribution with mean μ and variance σ2 is μ. In fact, for a normal distribution, mean median \n mode.\n** The median of a uniform distribution in the interval [a, b] is (a + b) / 2, which is also the mean.\n* The median of a Cauchy distribution with location parameter x0 and scale parameter y is x0, the location parameter.\n* The median of a power law distribution x−a, with exponent a > 1 is 21/(a − 1)xmin, where xmin is the minimum value for which the power law holds[https://arxiv.org/pdf/cond-mat/0412004.pdf Newman, Mark EJ. \"Power laws, Pareto distributions and Zipf's law.\" Contemporary physics 46.5 (2005): 323–351.]\n* The median of an exponential distribution with rate parameter λ is the natural logarithm of 2 divided by the rate parameter: λ−1ln 2.\n* The median of a Weibull distribution with shape parameter k and scale parameter λ is λ(ln 2)1/k.\n\nPopulations\n\nOptimality property\n\nThe mean absolute error of a real variable c with respect to the random variable X is\nE(\\left|X-c\\right|)\\,\nProvided that the probability distribution of X is such that the above expectation exists, then m is a median of  X if and only if m is a minimizer of the mean absolute error with respect to X. In particular, m is a sample median if and only if m minimizes the arithmetic mean of the absolute deviations.\n\nMore generally, a median is defined as a minimum of \nE(|X-c| - |X| ), \nas discussed below in the section on multivariate medians (specifically, the spatial median).\n\nThis optimization-based definition of the median is useful in statistical data-analysis, for example, in k-medians clustering.\n\nUnimodal distributions\n\nIt can be shown for a unimodal distribution that the median \\tilde{X} and the mean \\bar{X} lie within (3/5)1/2 ≈ 0.7746 standard deviations of each other. In symbols,\n\n\\frac{\\left|\\tilde{X} - \\bar{X}\\right|}{\\sigma} \\le \\left(\\frac{3}{5}\\right)^\\frac{1}{2}\n\nwhere |·| is the absolute value.\n\nA similar relation holds between the median and the mode: they lie within 31/2 ≈ 1.732 standard deviations of each other:\n\n\\frac{\\sigma} \\le 3^\\frac{1}{2}.\n\nInequality relating means and medians\n\nIf the distribution has finite variance, then the distance between the median and the mean is bounded by one standard deviation.\n\nThis bound was proved by Mallows, who used Jensen's inequality twice, as follows. We have\n\n\\begin{align}\n  |\\mu - m| = |\\operatorname{E}(X - m)| & \\leq \\operatorname{E}(|X - m|) \\\\\n                                        & \\leq \\operatorname{E}(|X - \\mu|) \\\\\n                                        & \\leq \\sqrt{\\operatorname{E}\\left((X - \\mu)^2\\right)} = \\sigma.\n\\end{align}\n\nThe first and third inequalities come from Jensen's inequality applied to the absolute-value function and the square function, which are each convex.  The second inequality comes from the fact that a median minimizes the absolute deviation function\n\na \\mapsto \\operatorname{E}(|X-a|).\\,\n\nThis proof also follows directly from Cantelli's inequality.[http://www.montefiore.ulg.ac.be/~kvansteen/MATH0008-2/ac20112012/Class3/Chapter2_ac1112_vfinalPartII.pdf K.Van Steen Notes on probability and statistics ] \nThe result can be generalized to obtain a multivariate version of the inequality, as follows:\n\\begin{align}\n  \\|\\mu - m\\| = \\| \\operatorname{E}(X - m)\\| \n    & \\leq  \\operatorname{E}\\|X - m\\|  \\\\\n    & \\leq  \\operatorname{E}(\\| X - \\mu\\| ) \\\\\n    & \\leq \\sqrt{ \\operatorname{E}\\left(\\|X - \\mu\\|^2\\right) }\n      = \\sqrt{ \\operatorname{trace}\\left(\\operatorname{var}(X)\\right) }\n\\end{align}\n\nwhere m is a spatial median, that is, a minimizer of the function\na \\mapsto \\operatorname{E}(\\|X-a\\|).\\, The spatial median is unique when the data-set's dimension is two or more. An alternative proof uses the one-sided Chebyshev inequality; it appears in an inequality on location and scale parameters.\n\nJensen's inequality for medians\n\nJensen's inequality states that for any random variable x with a finite expectation E(x) and for any convex function f\n\n f[ E(x) ] \\le E[ f(x) ] \n\nIt has been shown that if x is a real variable with a unique median m and f is a C function then\n\n f(m) \\le \\operatorname{Median}[ f(x)] \n\nA C function is a real valued function, defined on the set of real numbers R, with the property that for any real t\n\n f^{-1}\\left( \\,(-\\infty, t]\\, \\right) = \\{ x \\in R \\mid f(x) \\le t \\} \n\nis a closed interval, a singleton or an empty set.\n\nMedians for samples\n\nThe sample median\n\n Efficient computation of the sample median\n\nEven though comparison-sorting n items requires  operations, selection algorithms can compute the 'th-smallest of  items with only  operations. This includes the median, which is the 'th order statistic (or for an even number of samples, the arithmetic mean of the two middle order statistics).\n\nSelection algorithms still have the downside of requiring  memory, that is, they need to have the full sample (or a linear-sized portion of it) in memory. Because this, as well as the linear time requirement, can be prohibitive, several estimation procedures for the median have been developed. A simple one is the median of three rule, which estimates the median as the median of a three-element subsample; this is commonly used as a subroutine in the quicksort sorting algorithm, which uses an estimate of its input's median. A more robust estimator is Tukey's ninther, which is the median of three rule applied with limited recursion: if  is the sample laid out as an array, and\n\n,\n\nthen\n\nThe remedian is an estimator for the median that requires linear time but sub-linear memory, operating in a single pass over the sample.\n\nEasy explanation of the sample median\n\nIn individual series (if number of observation is very low) first one must arrange all the observations in order. Then count(n) is the total number of observation in given data.\n\nIf n is odd then Median (M) = value of ((n + 1)/2)th item term.\n\nIf n is even then Median (M) = value of [(n/2)th item term + (n/2 + 1)th item term]/2\n\n;For an odd number of values\n\nAs an example, we will calculate the sample median for the following set of observations: 1, 5, 2, 8, 7.\n\nStart by sorting the values: 1, 2, 5, 7, 8.\n\nIn this case, the median is 5 since it is the middle observation in the ordered list.\n\nThe median is the ((n + 1)/2)th item, where n is the number of values. For example, for the list {1, 2, 5, 7, 8}, we have n = 5, so the median is the ((5 + 1)/2)th item.\nmedian = (6/2)th item\nmedian = 3rd item\nmedian = 5\n\n;For an even number of values\n\nAs an example, we will calculate the sample median for the following set of observations: 1, 6, 2, 8, 7, 2.\n\nStart by sorting the values: 1, 2, 2, 6, 7, 8.\n\nIn this case, the arithmetic mean of the two middlemost terms is (2 + 6)/2 = 4. Therefore, the median is 4 since it is the arithmetic mean of the middle observations in the ordered list.\n\nWe also use this formula MEDIAN {(n + 1 )/2}th item . n \n number of values\n\nAs above example 1, 2, 2, 6, 7, 8\nn 6 Median \n {(6 + 1)/2}th item = 3.5th item.  In this case, the median is average of the 3rd number and the next one (the fourth number).  The median is (2 + 6)/2 which is 4.\n\nSampling distribution\n\nThe distributions of both the sample mean and the sample median were determined by Laplace. The distribution of the sample median from a population with a density function f(x) is asymptotically normal with mean m and variance\n\n \\frac{ 1 }{ 4n f( m )^2 }\n\nwhere m is the median of f(x) and n is the sample size.\n\nThese results have also been extended. It is now known for the p-th quantile that the distribution of the sample p-th quantile is asymptotically normal around the p-th quantile with variance equal to\n \\frac{p( 1 - p )}{nf(x_p)^2}\nwhere f(x_{p}) is the value of the distribution density at the p-th quantile.\n\nIn the case of a discrete variable, the sampling distribution of the median for small-samples can be investigated as follows.  We take the sample size to be an odd number  N = 2n + 1 .  If a given value  v  is to be the median of the sample then two conditions must be satisfied.  The first is that at most  n  observations can have a value of  v - 1  or less.  The second is that at most  n  observations can have a value of  v + 1  or more.  Let  i  be the number of observations which have a value of  v - 1  or less and let  k  be the number of observations which have a value of  v + 1  or more.  Then  i  and  k  both have a minimum value of 0 and a maximum of  n .  If an observation has a value below  v , it is not relevant how far below  v  it is and conversely, if an observation has a value above  v , it is not relevant how far above  v  it is.  We can therefore represent the observations as following a trinomial distribution with probabilities   F(v - 1) ,  f(v)  and   1 - F(v) .  The probability that the median  m  will have a value  v  is then given by\n\n \\Pr(m v) \n \\sum_{i0}^n \\sum_{k\n0}^n \\frac{N!}{i!(N-i-k)!k!} [F(v-1)]^i [f(v)]^{N-i-k} [1 - F(v)]^k. \n\nSumming this over all values of  v  defines a proper distribution and gives a unit sum.  In practice, the function  f(v)  will often not be known but it can be estimated from an observed frequency distribution.  An example is given in the following table where the actual distribution is not known but a sample of 3,800 observations allows a sufficiently accurate assessment of  f(v) .\n\nUsing these data it is possible to investigate the effect of sample size on the standard errors of the mean and median.  The observed mean is 3.16, the observed raw median is 3 and the observed interpolated median is 3.174.  The following table gives some comparison statistics.  The standard error of the median is given both from the above expression for  pr(m = v)  and from the asymptotic approximation given earlier.\n\nThe expected value of the median falls slightly as sample size increases while, as would be expected, the standard errors of both the median and the mean are proportionate to the inverse square root of the sample size.  The asymptotic approximation errs on the side of caution by overestimating the standard error.\n\nIn the case of a continuous variable, the following argument can be used.  If a given value  v  is to be the median, then one observation must take the value  v .  The elemental probability of this is  f(v)\\,dv .  Then, of the remaining  2n  observations, exactly  n  of them must be above  v  and the remaining  n  below.  The probability of this is the  n th term of a binomial distribution with parameters  F(v)  and  2n .  Finally we multiply by  2n+1  since any of the observations in the sample can be the median observation.  Hence the elemental probability of the median at the point  v   is given by\n\n f(v) \\frac{(2n)!}{n!n!} [F(v)]^n [1 - F(v)]^n (2n + 1) \\, dv. \n\nNow we introduce the beta function.  For integer arguments  \\alpha  and  \\beta , this can be expressed as  \\Beta(\\alpha,\\beta) (\\alpha - 1)! (\\beta - 1)! / (\\alpha + \\beta - 1)! .  Also, we note that  f(v) \n dF(v)/dv .  Using these relationships and setting both  \\alpha  and  \\beta  equal to   (n+1)  allows the last expression to be written as\n\n \\frac{[F(v)]^n[1 - F(v)]^n}{\\Beta(n+1,n+1)} \\, dF(v) \n\nHence the density function of the median is a symmetric beta distribution over the unit interval which supports  F(v) .  Its mean, as we would expect, is 0.5 and its variance is   1/(4(N+2)) . The corresponding variance of the sample median is\n\n\\frac{ 1 }{ 4 (N + 2) f( m )^2 }.\n\nHowever this finding can only be used if the density function  f(v)  is known or can be assumed.  As this will not always be the case, the median variance has to be estimated sometimes from the sample data.\n\n;Estimation of variance from sample data\n\nThe value of (2 f(x))^{-2}—the asymptotic value of n^{-\\frac{1}{2}} (\\nu - m) where \\nu is the population median—has been studied by several authors. The standard \"delete one\" jackknife method produces inconsistent results. An alternative—the \"delete k\" method—where k grows with the sample size has been shown to be asymptotically consistent. This method may be computationally expensive for large data sets. A bootstrap estimate is known to be consistent, but converges very slowly (order of n^{-\\frac{1}{4}}). Other methods have been proposed but their behavior may differ between large and small samples.\n\n;Efficiency\n\nThe efficiency of the sample median, measured as the ratio of the variance of the mean to the variance of the median, depends on the sample size and on the underlying population distribution. For a sample of size N = 2n + 1 from the normal distribution, the efficiency for large N is\n\n \\frac{2}{\\pi} \\frac{N+2}{N} \n\nThe efficiency tends to  \\frac{2}{\\pi}  as N tends to infinity.\n\nOther estimators\n\nFor univariate distributions that are symmetric about one median, the Hodges–Lehmann estimator is a robust and highly efficient estimator of the population median.\n\nIf data are represented by a statistical model specifying a particular family of probability distributions, then estimates of the median can be obtained by fitting that family of probability distributions to the data and calculating the theoretical median of the fitted distribution. Pareto interpolation is an application of this when the population is assumed to have a Pareto distribution.\n\nCoefficient of dispersion\n\nThe coefficient of dispersion (CD) is defined as the ratio of the average absolute deviation from the median to the median of the data.Bonett DG, Seier E (2006) Confidence interval for a coefficient of dispersion in non-normal distributions. Biometrical Journal 48 (1) 144–148 It is a statistical measure used by the states of Iowa, New York and South Dakota in estimating dues taxes. In symbols\n\n CD = \\frac{ 1 }{ n } \\frac{ \\sum| m - x | }{ m } \n\nwhere n is the sample size, m is the sample median and x is a variate. The sum is taken over the whole sample.\n\nConfidence intervals for a two-sample test in which the sample sizes are large have been derived by Bonett and Seier This test assumes that both samples have the same median but differ in the dispersion around it. The confidence interval (CI) is bounded inferiorly by\n\n \\exp \\left[ \\log \\left( \\frac{t_a} {t_b} \\right) - z_\\alpha \\left( \\operatorname{var} \\left[ \\log \\left( \\frac{t_a} {t_b} \\right) \\right] \\right)^\\frac{1}{2} \\right] \n\nwhere tj is the mean absolute deviation of the jth sample, var() is the variance and zα is the value from the normal distribution for the chosen value of α: for α 0.05, zα \n 1.96. The following formulae are used in the derivation of these confidence intervals\n\n \\operatorname{var} [ \\log ( t_a ) ] = \\frac{1}{n} \\left[ \\frac{ s_a^2 } { t_a^2 } + \\left( \\frac{x_a - \\bar{x}} {t_a} \\right)^2 - 1 \\right] \n\n \\operatorname{var} \\left[ \\log\\left( \\frac{t_a}{t_b} \\right) \\right] = \\operatorname{var}[ \\log( t_a ) ] + \\operatorname{var}[ \\log( t_b )] - 2r (\\operatorname{var}[ \\log(t_a) ] \\operatorname{var}[ \\log( t_b ) ] )^\\frac{1}{2} \n\nwhere r is the Pearson correlation coefficient between the squared deviation scores\n\n d_{ia} | x_{ia} - \\bar{x}_a |  and  d_{ib} \n |x_{ib} - \\bar{x}_b | \n\na and b here are constants equal to 1 and 2, x is a variate and s is the standard deviation of the sample.\n\nMultivariate median\n\nPreviously, this article discussed the univariate median, when the sample or population had one-dimension. When the dimension is two or higher, there are multiple concepts that extend the definition of the univariate median; each such multivariate median agrees with the univariate median when the dimension is exactly one.Small, Christopher G. \"A survey of multidimensional medians.\" International Statistical Review/Revue Internationale de Statistique (1990): 263–277.  Niinimaa, A., and H. Oja. \"Multivariate median.\" Encyclopedia of statistical sciences (1999).Mosler, Karl. Multivariate Dispersion, Central Regions, and Depth: The Lift Zonoid Approach. Vol. 165. Springer Science & Business Media, 2012.\n\nMedoid \n\nLet  be a set of  points in a space with a distance function d. Medoid is defined as\n\n{\\displaystyle x_{\\text{medoid}}{\\text{argmin}}_{y\\in \\{x_{1},x_{2},\\cdots ,x_{n}\\}}\\sum _{i\n1}^{n}d(y,x_{i}).} \n\nThe medoid is often used in clustering using the k-medoid algorithm.\n\nMarginal median\n\nThe marginal median is defined for vectors defined with respect to a fixed set of coordinates. A marginal median is defined to be the vector whose components are univariate medians. The marginal median is easy to compute, and its properties were studied by Puri and Sen.Puri, Madan L.; Sen, Pranab K.; Nonparametric Methods in Multivariate Analysis, John Wiley & Sons, New York, NY, 197l. (Reprinted by Krieger Publishing)\n\nSpatial median\n\nFor N vectors in a normed vector space, a spatial median  minimizes the average distance\n\na \\mapsto \\frac 1 N \\sum_n (\\|x_n-a\\|), \\,\n\nwhere xn and a are vectors. The spatial median is unique when the data-set's dimension is two or more and the norm is the Euclidean norm (or another strictly convex norm). The spatial median is also called the L1 median, even when the norm is Euclidean. Other names are used especially for finite sets of points: geometric median, Fermat point (in mechanics), or Weber or Fermat-Weber point (in geographical location theory).\n\n In the special case where the norm is an L1-norm, then the spatial median and the marginal median are the same.\n\nMore generally, a spatial median is defined as a minimizer of\n\na \\mapsto \\frac 1 N \\sum_n{(\\|x_n-a\\| - \\|x_n\\|)}; \n\nthis general definition is convenient for defining a spatial median of a population in a finite-dimensional normed space, for example, for distributions without a finite mean. Spatial medians are defined for random vectors with values in a Banach space.\n\nThe spatial median is a robust and highly efficient estimator of a central tendency of a population.\n\nOther multivariate medians\n\nAn alternative generalization of the spatial median in higher dimensions that does not relate to a particular metric is the centerpoint.\n\nOther median-related concepts\n\nInterpolated median\n\nWhen dealing with a discrete variable, it is sometimes useful to regard the observed values as being midpoints of underlying continuous intervals. An example of this is a Likert scale, on which opinions or preferences are expressed on a scale with a set number of possible responses. If the scale consists of the positive integers, an observation of 3 might be regarded as representing the interval from 2.50 to 3.50. It is possible to estimate the median of the underlying variable. If, say, 22% of the observations are of value 2 or below and 55.0% are of 3 or below (so 33% have the value 3), then the median  m  is 3 since the median is the smallest value of  x  for which  F(x)  is greater than a half. But the interpolated median is somewhere between 2.50 and 3.50.  First we add half of the interval width  w  to the median to get the upper bound of the median interval. Then we subtract that proportion of the interval width which equals the proportion of the 33% which lies above the 50% mark.  In other words, we split up the interval width pro rata to the numbers of observations.  In this case, the 33% is split into 28% below the median and 5% above it so we subtract 5/33 of the interval width from the upper bound of 3.50 to give an interpolated median of 3.35. More formally, if the values  f(x)  are known, the interpolated median can be calculated from\n\n m_\\text{int} = m + w\\left[\\frac{1}{2} - \\frac{F( m ) - \\frac{1}{2} }{f( m )}\\right]. \n\nAlternatively, if in an observed sample there are  k  scores above the median category,  j  scores in it and  i  scores below it then the interpolated median is given by\n\n m_\\text{int} = m + \\frac{w}{2} \\left[\\frac{k - i} j\\right]. \n\nPseudo-median\n\nFor univariate distributions that are symmetric about one median, the Hodges–Lehmann estimator is a robust and highly efficient estimator of the population median; for non-symmetric distributions, the Hodges–Lehmann estimator is a robust and highly efficient estimator of the population pseudo-median, which is the median of a symmetrized distribution and which is close to the population median. The Hodges–Lehmann estimator has been generalized to multivariate distributions.\n\nVariants of regression\n\nThe Theil–Sen estimator is a method for robust linear regression based on finding medians of slopes..\n\nMedian filter\n\nIn the context of image processing of monochrome raster images there is a type of noise, known as the salt and pepper noise, when each pixel independently becomes black (with some small probability) or white (with some small probability), and is unchanged otherwise (with the probability close to 1). An image constructed of median values of neighborhoods (like 3×3 square) can effectively reduce noise in this case.\n\nCluster analysis\n\nIn cluster analysis, the k-medians clustering algorithm provides a way of defining clusters, in which the criterion of maximising the distance between cluster-means that is used in k-means clustering, is replaced by maximising the distance between cluster-medians.\n\nMedian–median line\n\nThis is a method of robust regression. The idea dates back to Wald in 1940 who suggested dividing a set of bivariate data into two halves depending on the value of the independent parameter x: a left half with values less than the median and a right half with values greater than the median. He suggested taking the means of the dependent y and independent x variables of the left and the right halves and estimating the slope of the line joining these two points. The line could then be adjusted to fit the majority of the points in the data set.\n\nNair and Shrivastava in 1942 suggested a similar idea but instead advocated dividing the sample into three equal parts before calculating the means of the subsamples. Brown and Mood in 1951 proposed the idea of using the medians of two subsamples rather the means. Tukey combined these ideas and recommended dividing the sample into three equal size subsamples and estimating the line based on the medians of the subsamples.\n\nMedian-unbiased estimators\n\nAny mean-unbiased estimator minimizes the risk (expected loss) with respect to the squared-error loss function, as observed by Gauss. A median-unbiased estimator minimizes the risk with respect to the absolute-deviation loss function, as observed by Laplace. Other loss functions are used in statistical theory, particularly in robust statistics.\n\nThe theory of median-unbiased estimators was revived by [https://web.archive.org/web/20110310043642/http://www.universityofcalifornia.edu/senate/inmemoriam/georgewbrown.htm George W. Brown] in 1947:\n\nFurther properties of median-unbiased estimators have been reported.  Median-unbiased estimators are invariant under one-to-one transformations.\n\nThere are methods of construction median-unbiased estimators that are optimal (in a sense analogous to minimum-variance property considered for mean-unbiased estimators). Such constructions exist for probability distributions having monotone likelihood-functions.Pfanzagl, Johann. \"On optimal median unbiased estimators in the presence of nuisance parameters.\" The Annals of Statistics (1979): 187–193.Brown, L. D.; Cohen, Arthur; Strawderman, W. E. A Complete Class Theorem for Strict Monotone Likelihood Ratio With Applications. Ann. Statist. 4 (1976), no. 4, 712–722. . http://projecteuclid.org/euclid.aos/1176343543. One such procedure is an analogue of the Rao–Blackwell procedure for mean-unbiased estimators: The procedure holds for a smaller class of probability distributions than does the Rao—Blackwell procedure but for a larger class of loss functions.Page 713: Brown, L. D.; Cohen, Arthur; Strawderman, W. E. A Complete Class Theorem for Strict Monotone Likelihood Ratio With Applications. Ann. Statist. 4 (1976), no. 4, 712–722. . http://projecteuclid.org/euclid.aos/1176343543.\n\nHistory\n\nThe idea of the median appeared in the 13th century in the Talmud [http://danadler.com/blog/2014/12/31/talmud-and-modern-economics/ Talmud and Modern Economics][http://www.wisdom.weizmann.ac.il/math/AABeyond12/presentations/Aumann.pdf Modern Economic Theory in the Talmud] by Yisrael Aumann (further  for possible older mentions)\n\nThe idea of the median also appeared later in Edward Wright's book on navigation (Certaine Errors in Navigation) in 1599 in a section concerning the determination of location with a compass. Wright felt that this value was the most likely to be the correct value in a series of observations.\n\nIn 1757, Roger Joseph Boscovich developed a regression method based on the L1 norm and therefore implicitly on the median.\n\nIn 1774, Laplace suggested the median be used as the standard estimator of the value of a posterior pdf. The specific criterion was to minimize the expected magnitude of the error; |\\alpha - \\alpha^{*}| where \\alpha^{*} is the estimate and \\alpha is the true value. Laplaces's criterion was generally rejected for 150 years in favor of the least squares method of Gauss and Legendre which minimizes (\\alpha - \\alpha^{*})^{2} to obtain the mean. The distribution of both the sample mean and the sample median were determined by Laplace in the early 1800s.Laplace PS de (1818) Deuxième supplément à la Théorie Analytique des Probabilités, Paris, Courcier\n\nAntoine Augustin Cournot in 1843 was the first to use the term median (valeur médiane) for the value that divides a probability distribution into two equal halves. Gustav Theodor Fechner used the median (Centralwerth) in sociological and psychological phenomena.Keynes, J.M. (1921) A Treatise on Probability. Pt II Ch XVII §5 (p 201) (2006 reprint, Cosimo Classics,  : multiple other reprints) It had earlier been used only in astronomy and related fields. Gustav Fechner popularized the median into the formal analysis of data, although it had been used previously by Laplace.\n\nFrancis Galton used the English term median in 1881,Galton F (1881) \"Report of the Anthropometric Committee\" pp 245–260. [https://www.biodiversitylibrary.org/item/94448 Report of the 51st Meeting of the British Association for the Advancement of Science] having earlier used the terms middle-most value in 1869, and the medium in 1880.[https://www.encyclopediaofmath.org/index.php/Galton,_Francis encyclopediaofmath.org][http://www.personal.psu.edu/users/e/c/ecb5/Courses/M475W/WeeklyReadings/Week%2013/DevelopmentOfModernStatistics.pdf  personal.psu.edu]. Median. http://en.wikipedia.org/?curid=18837."
  }
}
