{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7597",
  "eid" : "e2820160-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778459766,
  "textBody" : "Processor design is the design engineering task of creating a microprocessor, a component of computer hardware. It is a subfield of computer engineering (design, development and implementation) and electronics engineering (fabrication). The design process involves choosing an instruction set and a certain execution paradigm (e.g. VLIW or RISC) and results in a microarchitecture described in e.g. VHDL or Verilog. This description is then manufactured employing some of the various semiconductor device fabrication processes. This results in a die which is bonded onto a chip carrier. This chip carrier is then soldered onto, or inserted into a socket on, a printed circuit board (PCB).\n\nThe mode of operation of any microprocessor is the execution of lists of instructions. Instructions typically include those to compute or manipulate data values using registers, change or retrieve values in read/write memory, perform relational tests between data values and to control program flow.\n\nDetails \n\nCPU design focuses on six main areas:\n# datapaths (such as ALUs and pipelines)\n# control unit: logic which controls the datapaths\n# Memory components such as register files, caches\n# Clock circuitry such as clock drivers, PLLs, clock distribution networks\n# Pad transceiver circuitry\n# Logic gate cell library which is used to implement the logic\n\nCPUs designed for high-performance markets might require custom designs for each of these items to achieve frequency, power-dissipation, and chip-area goals whereas CPUs designed for lower performance markets might lessen the implementation burden by acquiring some of these items by purchasing them as intellectual property. Control logic implementation techniques (logic synthesis using CAD tools) can be used to implement datapaths, register files, and clocks.  Common logic styles used in CPU design include unstructured random logic, finite-state machines, microprogramming (common from 1965 to 1985), and Programmable logic arrays (common in the 1980s, no longer common).\n\nDevice types used to implement the logic include:\n* Transistor-transistor logic Small Scale Integration logic chips - no longer used for CPUs\n* Programmable Array Logic and Programmable logic devices - no longer used for CPUs\n* Emitter-coupled logic (ECL) gate arrays - no longer common\n* CMOS gate arrays - no longer used for CPUs\n* CMOS mass-produced ICs - the vast majority of CPUs by volume\n* CMOS ASICs - only for a minority of special applications due to expense\n* Field-programmable gate arrays (FPGA) - common for soft microprocessors, and more or less required for reconfigurable computing\n\nA CPU design project generally has these major tasks:\n* Programmer-visible instruction set architecture, which can be implemented by a variety of microarchitectures\n* Architectural study and performance modeling in ANSI C/C++ or SystemC\n* High-level synthesis (HLS) or register transfer level (RTL, e.g. logic) implementation\n* RTL verification\n* Circuit design of speed critical components (caches, registers, ALUs)\n* Logic synthesis or logic-gate-level design\n* Timing analysis to confirm that all logic and circuits will run at the specified operating frequency\n* Physical design including floorplanning, place and route of logic gates\n* Checking that RTL, gate-level, transistor-level and physical-level representations are equivalent\n* Checks for signal integrity, chip manufacturability\n\nRe-designing a CPU core to a smaller die-area helps to shrink everything (a \"photomask shrink\"), resulting in the same number of transistors on a smaller die. It improves performance (smaller transistors switch faster), reduces power (smaller wires have less parasitic capacitance) and reduces cost (more CPUs fit on the same wafer of silicon). Releasing a CPU on the same size die, but with a smaller CPU core, keeps the cost about the same but allows higher levels of integration within one very-large-scale integration chip (additional cache, multiple CPUs or other components), improving performance and reducing overall system cost.\n\nAs with most complex electronic designs, the logic verification effort (proving that the design does\nnot have bugs) now dominates the project schedule of a CPU.\n\nKey CPU architectural innovations include index register, cache, virtual memory, instruction pipelining, superscalar, CISC, RISC, virtual machine, emulators, microprogram, and stack.\n\nMicro-architectural concepts \n\nResearch topics \n\nA variety of new CPU design ideas have been proposed,\nincluding reconfigurable logic, clockless CPUs, computational RAM, and optical computing.\n\nPerformance analysis and benchmarking\n\nBenchmarking is a way of testing CPU speed. Examples include SPECint and SPECfp, developed by Standard Performance Evaluation Corporation, and ConsumerMark developed by the Embedded Microprocessor Benchmark Consortium EEMBC.\n\nSome of the commonly used metrics include:\n* Instructions per second - Most consumers pick a computer architecture (normally Intel IA32 architecture) to be able to run a large base of pre-existing pre-compiled software.  Being relatively uninformed on computer benchmarks,  some of them pick a particular CPU based on operating frequency (see Megahertz Myth).\n* FLOPS - The number of floating point operations per second is often important in selecting computers for scientific computations.\n* Performance per watt - System designers building parallel computers, such as Google, pick CPUs based on their speed per watt of power, because the cost of powering the CPU outweighs the cost of the CPU itself.\n* Some system designers building parallel computers pick CPUs based on the speed per dollar.\n* System designers building real-time computing systems want to guarantee worst-case response. That is easier to do when the CPU has low interrupt latency and when it has deterministic response. (DSP)\n* Computer programmers who program directly in assembly language want a CPU to support a full featured instruction set.\n* Low power - For systems with limited power sources (e.g. solar, batteries, human power).\n* Small size or low weight - for portable embedded systems, systems for spacecraft.\n* Environmental impact - Minimizing environmental impact of computers during manufacturing and recycling as well during use.  Reducing waste, reducing hazardous materials.  (see Green computing).  \n\nThere may be tradeoffs in optimizing some of these metrics.  In particular, many design techniques that make a CPU run faster make the \"performance per watt\", \"performance per dollar\", and \"deterministic response\" much worse, and vice versa.\n\nMarkets\n\nThere are several different markets in which CPUs are used. Since each of these markets differ in their requirements for CPUs, the devices designed for one market are in most cases inappropriate for the other markets.\n\nGeneral purpose computing\n\nThe vast majority of revenues generated from CPU sales is for general purpose computing, that is, desktop, laptop, and server computers commonly used in businesses and homes. In this market, the Intel IA-32 and the 64-bit version x86-64 architecture dominate the market, with its rivals PowerPC and SPARC maintaining much smaller customer bases. Yearly, hundreds of millions of IA-32 architecture CPUs are used by this market.  A growing percentage of these processors are for mobile implementations such as netbooks and laptops.Kerr, Justin. [http://www.maximumpc.com/article/news/amd_loses_market_share_mobile_cpu_sales_outsell_desktop_first_time \"AMD Loses Market Share as Mobile CPU Sales Outsell Desktop for the First Time.\"]  Maximum PC.  Published 2010-10-26.\n\nSince these devices are used to run countless different types of programs, these CPU designs are not specifically targeted at one type of application or one function. The demands of being able to run a wide range of programs efficiently has made these CPU designs among the more advanced technically, along with some disadvantages of being relatively costly, and having high power consumption.\n\nHigh-end processor economics\n\nIn 1984, most high-performance CPUs required four to five years to develop.\n\"New system manages hundreds of transactions per second\" article\nby Robert Horst and Sandra Metz, of Tandem Computers Inc.,\n\"Electronics\" magazine, 1984 April 19:\n\"While most high-performance CPUs require four to five years to develop,\nThe NonStop TXP processor took just 2+1/2 years --\nsix months to develop a complete written specification,\none year to construct a working prototype,\nand another year to reach volume production.\"\n\nScientific computing\n\nScientific computing is a much smaller niche market (in revenue and units shipped).  It is used in government research labs and universities. Before 1990, CPU design was often done for this market, but mass market CPUs organized into large clusters have proven to be more affordable. The main remaining area of active hardware design and research for scientific computing is for high-speed data transmission systems to connect mass market CPUs.\n\nEmbedded design \n\nAs measured by units shipped, most CPUs are embedded in other machinery, such as telephones, clocks, appliances, vehicles, and infrastructure. Embedded processors sell in the volume of many billions of units per year, however, mostly at much lower price points than that of the general purpose processors.\n\nThese single-function devices differ from the more familiar general-purpose CPUs in several ways:\n* Low cost is of high importance.\n* It is important to maintain a low power dissipation as embedded devices often have a limited battery life and it is often impractical to include cooling fans.S. Mittal, \"[https://www.academia.edu/4186102/A_survey_of_techniques_for_improving_energy_efficiency_in_embedded_computing_systems A survey of techniques for improving energy efficiency in embedded computing systems]\", IJCAET, 6(4), 440–459, 2014.\n* To give lower system cost, peripherals are integrated with the processor on the same silicon chip.\n* Keeping peripherals on-chip also reduces power consumption as external GPIO ports typically require buffering so that they can source or sink the relatively high current loads that are required to maintain a strong signal outside of the chip.\n** Many embedded applications have a limited amount of physical space for circuitry; keeping peripherals on-chip will reduce the space required for the circuit board.\n** The program and data memories are often integrated on the same chip. When the only allowed program memory is ROM, the device is known as a microcontroller.\n* For many embedded applications, interrupt latency will be more critical than in some general-purpose processors.\n\nEmbedded processor economics\n\nThe embedded CPU family with the largest number of total units shipped is the 8051, averaging nearly a billion units per year.http://people.wallawalla.edu/~curt.nelson/engr355/lecture/8051_overview.pdf  The 8051 is widely used because it is very inexpensive.  The design time is now roughly zero, because it is widely available as commercial intellectual property.  It is now often embedded as a small part of a larger system on a chip.  The silicon cost of an 8051 is now as low as US$0.001, because some implementations use as few as 2,200 logic gates and take 0.0127 square millimeters of silicon.\n[http://www.keil.com/dd/docs/datashts/evatronix/t8051_ds.pdf Square millimeters per 8051, 0.013 in 45nm line-widths; see]To figure dollars per square millimeter, see [http://www.overclockers.com/forums/showthread.php?t=550542], and note that an SOC component has no pin or packaging costs.\n\nAs of 2009, more CPUs are produced using the ARM architecture instruction set than any other 32-bit instruction set.\n[http://www.extremetech.com/extreme/52180-arm-cores-climb-into-3g-territory \"ARM Cores Climb Into 3G Territory\"] by Mark Hachman, 2002.\n\n[http://www.embedded.com/electronics-blogs/significant-bits/4024488/The-Two-Percent-Solution \"The Two Percent Solution\"] by Jim Turley 2002.\n\nThe ARM architecture and the first ARM chip were designed in about one and a half years and 5 human years of work time.[https://web.archive.org/web/20090606152116/http://atterer.net/acorn/arm.html \"ARM's way\"] 1998\n\nThe 32-bit Parallax Propeller microcontroller architecture and the first chip were designed by two people in about 10 human years of work time.[http://www.parallax.com/Portals/0/Downloads/docs/article/WhythePropellerWorks.pdf \"Why the Propeller Works\"] by Chip Gracey\n\nThe 8-bit AVR architecture and first AVR microcontroller was conceived and designed by two students at the Norwegian Institute of Technology.\n\nThe 8-bit 6502 architecture and the first MOS Technology 6502 chip were designed in 13 months by a group of about 9 people.[http://silicongenesis.stanford.edu/transcripts/mensch.htm \"Interview with William Mensch\"]\n\nResearch and educational CPU design \n\nThe 32 bit Berkeley RISC I and RISC II architecture and the first chips were mostly designed by a series of students as part of a four quarter sequence of graduate courses.\n[http://www.eecs.berkeley.edu/Pubs/TechRpts/1982/CSD-82-106.pdf 'Design and Implementation of RISC I'] - original journal article by C.E. Sequin and D.A.Patterson\n\nThis design became the basis of the commercial SPARC processor design.\n\nFor about a decade, every student taking the 6.004 class at MIT was part of a team—each team had one semester to design and build a simple 8 bit CPU out of 7400 series integrated circuits.\nOne team of 4 students designed and built a simple 32 bit CPU during that semester.\n\n[http://sub-zero.mit.edu/fbyte/hacks/vhs/ \"the VHS\"]\n\nSome undergraduate courses require a team of 2 to 5 students to design, implement, and test a simple CPU in a FPGA in a single 15-week semester.\n\n[http://www.fpgacpu.org/teaching.html \"Teaching Computer Design with FPGAs\"] by Jan Gray\n\nThe MultiTitan CPU was designed with 2.5 man years of effort, which was considered \"relatively little design effort\" at the time.\nNorman P. Jouppi and Jeffrey Y. F. Tang.\n[http://citeseerx.ist.psu.edu/viewdoc/download?doi10.1.1.85.988&rep\nrep1&type=pdf \"A 20-MIPS Sustained 32-bit CMOS Microprocessor with High Ratio of Sustained to Peak Performance\"].\n1989.\n.\np. \"i\".\n\n24 people contributed to the 3.5 year MultiTitan research project, which included designing and building a prototype CPU.\n[ftp://ftp.hpl.hp.com/pub/DEC/WRL/research-reports/WRL-TR-87.8.pdf \"MultiTitan: Four Architecture Papers\"].\n1988.\np. 4-5.\n\nSoft microprocessor cores \n\nFor embedded systems, the highest performance levels are often not needed or desired due to the power consumption requirements. This allows for the use of processors which can be totally implemented by logic synthesis techniques. These synthesized processors can be implemented in a much shorter amount of time, giving quicker time-to-market.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Processor design" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7597" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Processor design is the design engineering task of creating a microprocessor, a component of computer hardware. It is a subfield of computer engineering (design, development and implementation) and electronics engineering (fabrication). The design process involves choosing an instruction set and a certain execution paradigm (e.g. VLIW or RISC) and results in a microarchitecture described in e.g. VHDL or Verilog. This description is then manufactured employing some of the various semiconductor device fabrication processes. This results in a die which is bonded onto a chip carrier. This chip carrier is then soldered onto, or inserted into a socket on, a printed circuit board (PCB).\n\nThe mode of operation of any microprocessor is the execution of lists of instructions. Instructions typically include those to compute or manipulate data values using registers, change or retrieve values in read/write memory, perform relational tests between data values and to control program flow.\n\nDetails \n\nCPU design focuses on six main areas:\n# datapaths (such as ALUs and pipelines)\n# control unit: logic which controls the datapaths\n# Memory components such as register files, caches\n# Clock circuitry such as clock drivers, PLLs, clock distribution networks\n# Pad transceiver circuitry\n# Logic gate cell library which is used to implement the logic\n\nCPUs designed for high-performance markets might require custom designs for each of these items to achieve frequency, power-dissipation, and chip-area goals whereas CPUs designed for lower performance markets might lessen the implementation burden by acquiring some of these items by purchasing them as intellectual property. Control logic implementation techniques (logic synthesis using CAD tools) can be used to implement datapaths, register files, and clocks.  Common logic styles used in CPU design include unstructured random logic, finite-state machines, microprogramming (common from 1965 to 1985), and Programmable logic arrays (common in the 1980s, no longer common).\n\nDevice types used to implement the logic include:\n* Transistor-transistor logic Small Scale Integration logic chips - no longer used for CPUs\n* Programmable Array Logic and Programmable logic devices - no longer used for CPUs\n* Emitter-coupled logic (ECL) gate arrays - no longer common\n* CMOS gate arrays - no longer used for CPUs\n* CMOS mass-produced ICs - the vast majority of CPUs by volume\n* CMOS ASICs - only for a minority of special applications due to expense\n* Field-programmable gate arrays (FPGA) - common for soft microprocessors, and more or less required for reconfigurable computing\n\nA CPU design project generally has these major tasks:\n* Programmer-visible instruction set architecture, which can be implemented by a variety of microarchitectures\n* Architectural study and performance modeling in ANSI C/C++ or SystemC\n* High-level synthesis (HLS) or register transfer level (RTL, e.g. logic) implementation\n* RTL verification\n* Circuit design of speed critical components (caches, registers, ALUs)\n* Logic synthesis or logic-gate-level design\n* Timing analysis to confirm that all logic and circuits will run at the specified operating frequency\n* Physical design including floorplanning, place and route of logic gates\n* Checking that RTL, gate-level, transistor-level and physical-level representations are equivalent\n* Checks for signal integrity, chip manufacturability\n\nRe-designing a CPU core to a smaller die-area helps to shrink everything (a \"photomask shrink\"), resulting in the same number of transistors on a smaller die. It improves performance (smaller transistors switch faster), reduces power (smaller wires have less parasitic capacitance) and reduces cost (more CPUs fit on the same wafer of silicon). Releasing a CPU on the same size die, but with a smaller CPU core, keeps the cost about the same but allows higher levels of integration within one very-large-scale integration chip (additional cache, multiple CPUs or other components), improving performance and reducing overall system cost.\n\nAs with most complex electronic designs, the logic verification effort (proving that the design does\nnot have bugs) now dominates the project schedule of a CPU.\n\nKey CPU architectural innovations include index register, cache, virtual memory, instruction pipelining, superscalar, CISC, RISC, virtual machine, emulators, microprogram, and stack.\n\nMicro-architectural concepts \n\nResearch topics \n\nA variety of new CPU design ideas have been proposed,\nincluding reconfigurable logic, clockless CPUs, computational RAM, and optical computing.\n\nPerformance analysis and benchmarking\n\nBenchmarking is a way of testing CPU speed. Examples include SPECint and SPECfp, developed by Standard Performance Evaluation Corporation, and ConsumerMark developed by the Embedded Microprocessor Benchmark Consortium EEMBC.\n\nSome of the commonly used metrics include:\n* Instructions per second - Most consumers pick a computer architecture (normally Intel IA32 architecture) to be able to run a large base of pre-existing pre-compiled software.  Being relatively uninformed on computer benchmarks,  some of them pick a particular CPU based on operating frequency (see Megahertz Myth).\n* FLOPS - The number of floating point operations per second is often important in selecting computers for scientific computations.\n* Performance per watt - System designers building parallel computers, such as Google, pick CPUs based on their speed per watt of power, because the cost of powering the CPU outweighs the cost of the CPU itself.\n* Some system designers building parallel computers pick CPUs based on the speed per dollar.\n* System designers building real-time computing systems want to guarantee worst-case response. That is easier to do when the CPU has low interrupt latency and when it has deterministic response. (DSP)\n* Computer programmers who program directly in assembly language want a CPU to support a full featured instruction set.\n* Low power - For systems with limited power sources (e.g. solar, batteries, human power).\n* Small size or low weight - for portable embedded systems, systems for spacecraft.\n* Environmental impact - Minimizing environmental impact of computers during manufacturing and recycling as well during use.  Reducing waste, reducing hazardous materials.  (see Green computing).  \n\nThere may be tradeoffs in optimizing some of these metrics.  In particular, many design techniques that make a CPU run faster make the \"performance per watt\", \"performance per dollar\", and \"deterministic response\" much worse, and vice versa.\n\nMarkets\n\nThere are several different markets in which CPUs are used. Since each of these markets differ in their requirements for CPUs, the devices designed for one market are in most cases inappropriate for the other markets.\n\nGeneral purpose computing\n\nThe vast majority of revenues generated from CPU sales is for general purpose computing, that is, desktop, laptop, and server computers commonly used in businesses and homes. In this market, the Intel IA-32 and the 64-bit version x86-64 architecture dominate the market, with its rivals PowerPC and SPARC maintaining much smaller customer bases. Yearly, hundreds of millions of IA-32 architecture CPUs are used by this market.  A growing percentage of these processors are for mobile implementations such as netbooks and laptops.Kerr, Justin. [http://www.maximumpc.com/article/news/amd_loses_market_share_mobile_cpu_sales_outsell_desktop_first_time \"AMD Loses Market Share as Mobile CPU Sales Outsell Desktop for the First Time.\"]  Maximum PC.  Published 2010-10-26.\n\nSince these devices are used to run countless different types of programs, these CPU designs are not specifically targeted at one type of application or one function. The demands of being able to run a wide range of programs efficiently has made these CPU designs among the more advanced technically, along with some disadvantages of being relatively costly, and having high power consumption.\n\nHigh-end processor economics\n\nIn 1984, most high-performance CPUs required four to five years to develop.\n\"New system manages hundreds of transactions per second\" article\nby Robert Horst and Sandra Metz, of Tandem Computers Inc.,\n\"Electronics\" magazine, 1984 April 19:\n\"While most high-performance CPUs require four to five years to develop,\nThe NonStop TXP processor took just 2+1/2 years --\nsix months to develop a complete written specification,\none year to construct a working prototype,\nand another year to reach volume production.\"\n\nScientific computing\n\nScientific computing is a much smaller niche market (in revenue and units shipped).  It is used in government research labs and universities. Before 1990, CPU design was often done for this market, but mass market CPUs organized into large clusters have proven to be more affordable. The main remaining area of active hardware design and research for scientific computing is for high-speed data transmission systems to connect mass market CPUs.\n\nEmbedded design \n\nAs measured by units shipped, most CPUs are embedded in other machinery, such as telephones, clocks, appliances, vehicles, and infrastructure. Embedded processors sell in the volume of many billions of units per year, however, mostly at much lower price points than that of the general purpose processors.\n\nThese single-function devices differ from the more familiar general-purpose CPUs in several ways:\n* Low cost is of high importance.\n* It is important to maintain a low power dissipation as embedded devices often have a limited battery life and it is often impractical to include cooling fans.S. Mittal, \"[https://www.academia.edu/4186102/A_survey_of_techniques_for_improving_energy_efficiency_in_embedded_computing_systems A survey of techniques for improving energy efficiency in embedded computing systems]\", IJCAET, 6(4), 440–459, 2014.\n* To give lower system cost, peripherals are integrated with the processor on the same silicon chip.\n* Keeping peripherals on-chip also reduces power consumption as external GPIO ports typically require buffering so that they can source or sink the relatively high current loads that are required to maintain a strong signal outside of the chip.\n** Many embedded applications have a limited amount of physical space for circuitry; keeping peripherals on-chip will reduce the space required for the circuit board.\n** The program and data memories are often integrated on the same chip. When the only allowed program memory is ROM, the device is known as a microcontroller.\n* For many embedded applications, interrupt latency will be more critical than in some general-purpose processors.\n\nEmbedded processor economics\n\nThe embedded CPU family with the largest number of total units shipped is the 8051, averaging nearly a billion units per year.http://people.wallawalla.edu/~curt.nelson/engr355/lecture/8051_overview.pdf  The 8051 is widely used because it is very inexpensive.  The design time is now roughly zero, because it is widely available as commercial intellectual property.  It is now often embedded as a small part of a larger system on a chip.  The silicon cost of an 8051 is now as low as US$0.001, because some implementations use as few as 2,200 logic gates and take 0.0127 square millimeters of silicon.\n[http://www.keil.com/dd/docs/datashts/evatronix/t8051_ds.pdf Square millimeters per 8051, 0.013 in 45nm line-widths; see]To figure dollars per square millimeter, see [http://www.overclockers.com/forums/showthread.php?t=550542], and note that an SOC component has no pin or packaging costs.\n\nAs of 2009, more CPUs are produced using the ARM architecture instruction set than any other 32-bit instruction set.\n[http://www.extremetech.com/extreme/52180-arm-cores-climb-into-3g-territory \"ARM Cores Climb Into 3G Territory\"] by Mark Hachman, 2002.\n\n[http://www.embedded.com/electronics-blogs/significant-bits/4024488/The-Two-Percent-Solution \"The Two Percent Solution\"] by Jim Turley 2002.\n\nThe ARM architecture and the first ARM chip were designed in about one and a half years and 5 human years of work time.[https://web.archive.org/web/20090606152116/http://atterer.net/acorn/arm.html \"ARM's way\"] 1998\n\nThe 32-bit Parallax Propeller microcontroller architecture and the first chip were designed by two people in about 10 human years of work time.[http://www.parallax.com/Portals/0/Downloads/docs/article/WhythePropellerWorks.pdf \"Why the Propeller Works\"] by Chip Gracey\n\nThe 8-bit AVR architecture and first AVR microcontroller was conceived and designed by two students at the Norwegian Institute of Technology.\n\nThe 8-bit 6502 architecture and the first MOS Technology 6502 chip were designed in 13 months by a group of about 9 people.[http://silicongenesis.stanford.edu/transcripts/mensch.htm \"Interview with William Mensch\"]\n\nResearch and educational CPU design \n\nThe 32 bit Berkeley RISC I and RISC II architecture and the first chips were mostly designed by a series of students as part of a four quarter sequence of graduate courses.\n[http://www.eecs.berkeley.edu/Pubs/TechRpts/1982/CSD-82-106.pdf 'Design and Implementation of RISC I'] - original journal article by C.E. Sequin and D.A.Patterson\n\nThis design became the basis of the commercial SPARC processor design.\n\nFor about a decade, every student taking the 6.004 class at MIT was part of a team—each team had one semester to design and build a simple 8 bit CPU out of 7400 series integrated circuits.\nOne team of 4 students designed and built a simple 32 bit CPU during that semester.\n\n[http://sub-zero.mit.edu/fbyte/hacks/vhs/ \"the VHS\"]\n\nSome undergraduate courses require a team of 2 to 5 students to design, implement, and test a simple CPU in a FPGA in a single 15-week semester.\n\n[http://www.fpgacpu.org/teaching.html \"Teaching Computer Design with FPGAs\"] by Jan Gray\n\nThe MultiTitan CPU was designed with 2.5 man years of effort, which was considered \"relatively little design effort\" at the time.\nNorman P. Jouppi and Jeffrey Y. F. Tang.\n[http://citeseerx.ist.psu.edu/viewdoc/download?doi10.1.1.85.988&rep\nrep1&type=pdf \"A 20-MIPS Sustained 32-bit CMOS Microprocessor with High Ratio of Sustained to Peak Performance\"].\n1989.\n.\np. \"i\".\n\n24 people contributed to the 3.5 year MultiTitan research project, which included designing and building a prototype CPU.\n[ftp://ftp.hpl.hp.com/pub/DEC/WRL/research-reports/WRL-TR-87.8.pdf \"MultiTitan: Four Architecture Papers\"].\n1988.\np. 4-5.\n\nSoft microprocessor cores \n\nFor embedded systems, the highest performance levels are often not needed or desired due to the power consumption requirements. This allows for the use of processors which can be totally implemented by logic synthesis techniques. These synthesized processors can be implemented in a much shorter amount of time, giving quicker time-to-market. Processor design. http://en.wikipedia.org/?curid=7597."
  }
}
