{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11164",
  "eid" : "f9faeaa0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778499146,
  "textBody" : "Events\n\n* 364 – Roman Emperor Jovian dies after a reign of eight months. He is found dead in his tent at Tyana (Asia Minor) en route back to Constantinople in suspicious circumstances.\n*1370 – Northern Crusades: Grand Duchy of Lithuania and the Teutonic Knights meet in the Battle of Rudau.\n*1411 – Following the successful campaigns during the Ottoman Interregnum, Musa Çelebi, one of the sons of Bayezid I, becomes Sultan with the support of Mircea I of Wallachia.\n*1500 – Duke Friedrich and Duke Johann attempt to subdue the peasantry of Dithmarschen, Denmark, in the Battle of Hemmingstedt.\n*1600 – The philosopher Giordano Bruno is burned alive, for heresy, at Campo de' Fiori in Rome.\n*1621 – Myles Standish is appointed as first military commander of the English Plymouth Colony in North America.\n*1753 – In Sweden February 17 is followed by March 1 as the country moves from the Julian calendar to the Gregorian calendar.\n*1801 – An electoral tie between Thomas Jefferson and Aaron Burr is resolved when Jefferson is elected President of the United States and Burr, Vice President by the United States House of Representatives.\n*1814 – War of the Sixth Coalition: The Battle of Mormant.\n*1819 – The United States House of Representatives passes the Missouri Compromise for the first time.\n*1838 – Weenen massacre: Hundreds of Voortrekkers along the Blaukraans River, Natal are killed by Zulus.\n*1854 – The United Kingdom recognizes the independence of the Orange Free State.\n*1859 – Cochinchina Campaign: The French Navy captured the Citadel of Saigon, a fortress that was manned by 1,000 Nguyễn dynasty soldiers, en route to conquering Saigon and other regions of southern Viet Nam.\n*1863 – A group of citizens of Geneva founded an International Committee for Relief to the Wounded, which later became known as the International Committee of the Red Cross.\n*1864 – American Civil War: The  becomes the first submarine to engage and sink a warship, the .\n*1865 – American Civil War: Columbia, South Carolina, is burned as Confederate forces flee from advancing Union forces.\n*1867 – The first ship passes through the Suez Canal.\n*1871 – The victorious Prussian Army parades through Paris, France, after the end of the Siege of Paris during the Franco-Prussian War.\n*1904 – Madama Butterfly receives its première at La Scala in Milan.\n*1913 – The Armory Show opens in New York City, displaying works of artists who are to become some of the most influential painters of the early 20th century.\n*1919 – The Ukrainian People's Republic asks Entente and the US for help fighting the Bolsheviks.\n*  1933   – Newsweek magazine is first published.\n*1944 – World War II: The Battle of Eniwetok begins: The battle ends in an American victory on February 22.\n*  1944   – World War II: Operation Hailstone begins: U.S. naval air, surface, and submarine attack against Truk Lagoon, Japan's main base in the central Pacific, in support of the Eniwetok invasion.\n*1949 – Chaim Weizmann begins his term as the first President of Israel.\n*1959 – Project Vanguard: Vanguard 2: The first weather satellite is launched to measure cloud-cover distribution.\n*1964 – In Wesberry v. Sanders the Supreme Court of the United States rules that congressional districts have to be approximately equal in population.\n*  1964   – Gabonese president Léon M'ba is toppled by a coup and his rival, Jean-Hilaire Aubame, is installed in his place.\n*1965 – Project Ranger: The Ranger 8 probe launches on its mission to photograph the Mare Tranquillitatis region of the Moon in preparation for the manned Apollo missions. Mare Tranquillitatis or the \"Sea of Tranquility\" would become the site chosen for the Apollo 11 lunar landing.\n*1968 – In Springfield, Massachusetts, the Naismith Memorial Basketball Hall of Fame opens.\n*1972 – Cumulative sales of the Volkswagen Beetle exceed those of the Ford Model T.\n*1974 – Robert K. Preston, a disgruntled U.S. Army private, buzzes the White House in a stolen helicopter.\n*1978 – The Troubles: The Provisional IRA detonates an incendiary bomb at the La Mon restaurant, near Belfast, killing 12 and seriously injuring 30 others, all Protestants.\n*1979 – The Sino-Vietnamese War begins.\n*1980 – First winter ascent of Mount Everest by Krzysztof Wielicki and Leszek Cichy.\n*1992 – Nagorno-Karabakh War: Armenian troops massacre more than 20 Azerbaijani civilians during the Capture of Garadaghly.\n*1995 – The Cenepa War between Peru and Ecuador ends on a ceasefire brokered by the UN.\n*1996 – In Philadelphia, world champion Garry Kasparov beats the Deep Blue supercomputer in a chess match.\n*  1996   – NASA's Discovery Program begins as the NEAR Shoemaker spacecraft lifts off on the first mission ever to orbit and land on an asteroid, 433 Eros.\n*  1996   – The 8.2  Biak earthquake shakes the Papua province of eastern Indonesia with a maximum Mercalli intensity of VIII (Severe). A large tsunami followed, leaving one-hundred sixty-six people dead or missing and 423 injured.\n*2006 – A massive mudslide occurs in Southern Leyte, Philippines; the official death toll is set at 1,126.\n*2008 – Kosovo declares independence as the Republic of Kosovo.\n*2011 – Libyan protests begin. In Bahrain, security forces launched a deadly pre-dawn raid on protesters in Pearl Roundabout in Manama, the day is locally known as Bloody Thursday.\n*2015 – Eighteen people are killed and 78 injured in a stampede at a Mardi Gras parade in Haiti.\n*2016 – Military vehicles explode outside a Turkish Armed Forces barracks in Ankara, Turkey, killing at least 29 people and injuring 61 others.\n\nBirths\n\n* 624 – Wu Zetian, Chinese consort to Emperor Gaozong of Tang, afterwards ruled as a regent and then as the empress of the Zhou dynasty (d. 705)\n*1451 – Raffaello Maffei, Italian theologian (d. 1522)\n*1490 – Charles III, Duke of Bourbon (d. 1527)\n*1519 – Francis, Duke of Guise (d. 1563)\n*1524 – Charles, Cardinal of Lorraine (d. 1574)\n*1646 – Pierre Le Pesant, sieur de Boisguilbert, French economist (d. 1714)\n*1653 – Arcangelo Corelli, Italian violinist and composer (d. 1713)\n*1723 – Tobias Mayer, German astronomer and academic (d. 1762)\n*1740 – Horace-Bénédict de Saussure, Swiss physicist and meteorologist (d. 1799)\n*1752 – Friedrich Maximilian Klinger, German author and playwright (d. 1831)\n*1754 – Nicolas Baudin, French cartographer and explorer (d. 1803)\n*1781 – René Laennec, French physician, invented the stethoscope (d. 1826)\n*1796 – Philipp Franz von Siebold, German physician and botanist (d. 1866)\n*1817 – Édouard Thilges, Luxembourgian jurist and politician, 7th Prime Minister of Luxembourg (d. 1904)\n*1820 – Henri Vieuxtemps, Belgian violinist and composer (d. 1881)\n*1821 – Lola Montez, Irish-American actress and dancer (d. 1861)\n*1832 – Richard Henry Park, American sculptor (d. 1902) \n*1836 – Gustavo Adolfo Bécquer, Spanish author, poet, and playwright (d. 1870)\n*1843 – Aaron Montgomery Ward, American businessman, founded Montgomery Ward (d. 1913)\n*1848 – Louisa Lawson, Australian poet and publisher (d. 1920)\n*1854 – Friedrich Alfred Krupp, German businessman (d. 1902)\n*1861 – Princess Helena of Waldeck and Pyrmont (d. 1922)\n*1862 – Mori Ōgai, Japanese general, author, and poet (d. 1922)\n*1864 – Jozef Murgaš, Slovak priest, botanist, and painter (d. 1929)\n*  1864   – Banjo Paterson, Australian journalist, author, and poet (d. 1941)\n*1874 – Thomas J. Watson, American businessman (d. 1956)\n*1877 – Isabelle Eberhardt, Swiss explorer and author (d. 1904)\n*  1877   – André Maginot, French sergeant and politician (d. 1932)\n*1881 – Mary Carson Breckinridge, American nurse-midwife, founded Frontier Nursing Service (d. 1965)\n*1887 – Joseph Bech, Luxembourgian lawyer and politician, 15th Prime Minister of Luxembourg (d. 1975)\n*  1887   – Leevi Madetoja, Finnish composer and critic (d. 1947)\n*1888 – Otto Stern, German-American physicist and academic, Nobel Prize laureate (d. 1969)\n*1890 – Ronald Fisher, English-Australian statistician, biologist, and geneticist (d. 1962)\n*1891 – Abraham Fraenkel, German-Israeli mathematician and academic (d. 1965)\n*1893 – Wally Pipp, American baseball player and journalist (d. 1965)\n*1899 – Jibanananda Das, Bangladeshi-Indian poet and author (d. 1954)\n*1900 – Ruth Clifford, American actress (d. 1998)\n*1903 – Sadegh Hedayat, Iranian-French author and translator (d. 1951)\n*1904 – Hans Morgenthau, German-American political scientist, philosopher, and academic (d. 1980)\n*1905 – Rózsa Péter, Hungarian mathematician (d. 1977)\n*1906 – Mary Brian, American actress (d. 2002) \n*1908 – Red Barber, American sportscaster (d. 1992)\n*  1908   – Bo Yibo, Chinese general and politician, Vice Premier of the People's Republic of China (d. 2007)\n*1910 – Marc Lawrence, American actor, director, producer, and screenwriter (d. 2005)\n*1911 – Oskar Seidlin, German-American author, poet, and scholar (d. 1984)\n*1912 – Andre Norton, American author (d. 2005)\n*1914 – Arthur Kennedy, American actor (d. 1990)\n*  1914   – Wayne Morris, American actor, singer, and producer (d. 1959)\n*1916 – Alexander Obolensky, Russian rugby player and pilot (d. 1940)\n*  1916   – Don Tallon, Australian cricketer (d. 1984)\n*  1916   – Raf Vallone, Italian footballer and actor (d. 2002)\n*1918 – William Bronk, American poet and academic (d. 1999)\n*  1918   – Jacqueline Ferrand, French mathematician (d. 2014)\n*1919 – J. M. S. Careless, Canadian historian and academic (d. 2009)\n*  1919   – Kathleen Freeman, American actress and singer (d. 2001)\n*  1919   – Joe Hunt, American tennis player (d. 1945)\n*1920 – Ivo Caprino, Norwegian director and screenwriter (d. 2001)\n*  1920   – Annie Castor, American disability and communication disorder advocate\n*  1920   – Curt Swan, American soldier and illustrator (d. 1996)\n*1921 – Duane Gish, American biochemist and academic (d. 2013)\n*1922 – Tommy Edwards, American R&B singer-songwriter (d. 1969)\n*1923 – John M. Allegro, English archaeologist and scholar (d. 1988)\n*  1923   – Buddy DeFranco, American clarinet player and bandleader (d. 2014)\n*1924 – Margaret Truman, American singer and author (d. 2008)\n*1925 – Ron Goodwin, English composer and conductor (d. 2003)\n*  1925   – Hal Holbrook, American actor and director\n*1928 – Marta Romero, Puerto Rican actress and singer (d. 2013)\n*1929 – Alejandro Jodorowsky, Chilean-French director and screenwriter\n*  1929   – Chaim Potok, American rabbi and author (d. 2002)\n*  1929   – Nicholas Ridley, Baron Ridley of Liddesdale, English lieutenant and politician, Secretary of State for Business, Innovation and Skills (d. 1993)\n*  1929   – Patricia Routledge, English actress and singer\n*1930 – Roger Craig, American baseball player, coach, and manager\n*  1930   – Benjamin Fain, Ukrainian-Israeli physicist and academic (d. 2013)\n*  1930   – Ruth Rendell, English author (d. 2015)\n*1931 – Jiřina Jirásková, Czech actress and singer (d. 2013)\n*  1931   – Buddy Ryan, American football coach (d. 2016)\n*1933 – Craig L. Thomas, American captain and politician (d. 2007)\n*1934 – Alan Bates, English actor (d. 2003)\n*  1934   – Barry Humphries (Dame Edna Everage), Australian comedian, actor, and author\n*1935 – Christina Pickles, English-American actress \n*1936 – Jim Brown, American football player and actor\n*1937 – Mary Ann Mobley, American model and actress, Miss America 1959 (d. 2014)\n*1940 – Vicente Fernández, Mexican singer-songwriter, actor, and producer\n*  1940   – Gene Pitney, American singer-songwriter (d. 2006)\n*1941 – Julia McKenzie, English actress, singer, and director\n*1942 – Huey P. Newton, American activist, co-founded the Black Panther Party (d. 1989)\n*1944 – Karl Jenkins, Welsh saxophonist, keyboard player, and composer (Soft Machine)\n*1945 – Zina Bethune, American actress, dancer, and choreographer (d. 2012)\n*  1945   – Brenda Fricker, Irish actress\n*1946 – Shahrnush Parsipur, Iranian-American author and academic\n*1948 – José José, Mexican singer-songwriter, producer, and actor\n*  1948   – Rick Majerus, American basketball player and coach (d. 2012)\n*1949 – Fred Frith, English guitarist and songwriter \n*  1949   – Dennis Green, American football player and coach (d. 2016)\n*1950 – Rickey Medlocke, American guitarist \n*1951 – Rashid Minhas, Pakistani soldier and pilot (d. 1971)\n*1952 – Karin Büttner-Janz, German gymnast and physician\n*  1952   – Vladimír Padrůněk, Czech bass player (d. 1991)\n*1954 – Lou Ann Barton, American blues singer-songwriter\n*  1954   – Miki Berkovich, Israeli basketball player\n*  1954   – Rene Russo, American actress \n*1955 – Mo Yan, Chinese author and academic, Nobel Prize laureate\n*1956 – Richard Karn, American actor and game show host\n*1957 – Loreena McKennitt, Canadian singer-songwriter, accordion player, and pianist\n*1959 – Aryeh Deri, Moroccan-Israeli rabbi and politician, Israeli Minister of Internal Affairs\n*  1959   – Rowdy Gaines, American swimmer and sportscaster\n*1960 – Lindy Ruff, Canadian hockey player and coach\n*1961 – Angela Eagle, English politician, Shadow Leader of the House of Commons\n*  1961   – Maria Eagle, English politician, Shadow Secretary of State for Defence\n*  1961   – Andrey Korotayev, Russian anthropologist, historian, and sociologist\n*1962 – Lou Diamond Phillips, American actor and director\n*1963 – Larry the Cable Guy, American comedian and voice actor\n*  1963   – Alison Hargreaves, English mountaineer (d. 1995)\n*  1963   – Jen-Hsun Huang, Taiwanese-American businessman, co-founded Nvidia\n*  1963   – Michael Jordan, American basketball player and actor\n*1965 – Michael Bay, American director and producer\n*  1965   – Danny Lee, Australian rugby league player\n*1966 – Michael Lepond, American bass player \n*  1966   – Quorthon, Swedish guitarist and songwriter (d. 2004)\n*  1966   – Luc Robitaille, Canadian ice hockey player, manager, and actor\n*1968 – Wu'erkaixi, Chinese journalist and activist\n*  1968   – Giuseppe Signori, Italian footballer  \n*1969 – David Douillet, French martial artist and politician\n*  1969   – Vasily Kudinov, Russian handball player (d. 2017)\n*1970 – Dominic Purcell, English-born Irish-Australian actor and producer\n*1971 – Denise Richards, American model and actress\n*1972 – Billie Joe Armstrong, American singer-songwriter, guitarist, actor, and producer \n*  1972   – Philippe Candeloro, French figure skater\n*  1972   – Taylor Hawkins, American singer-songwriter and drummer \n*  1972   – Valeria Mazza, Argentinian model and businesswoman\n*  1972   – Lars Göran Petrov, Swedish singer and drummer \n*1973 – Raphaël Ibañez, French rugby player\n*1974 – Kaoru, Japanese guitarist, songwriter, and producer \n*  1974   – Jerry O'Connell, American actor, director, and producer\n*1975 – Václav Prospal, Czech ice hockey player\n*1976 – Tonie Carroll, New Zealand-Australian rugby league player and coach\n*1978 – Rory Kinnear, English actor and playwright\n*1980 – Al Harrington, American basketball player\n*  1980   – Klemi Saban, Israeli footballer\n*1981 – Joseph Gordon-Levitt, American actor, director, and producer\n*  1981   – Paris Hilton, American model, media personality, actress, singer, DJ, author and businesswoman\n*  1981   – Pontus Segerström, Swedish footballer (d. 2014)\n*  1981   – Andrew Stephenson, English politician\n*1982 – Adriano, Brazilian footballer\n*  1982   – Brian Bruney, American baseball player\n*  1982   – Daniel Merriweather, Australian singer-songwriter \n*1983 – Kevin Rudolf, American singer-songwriter, guitarist, and producer\n*1984 – AB de Villiers, South African cricketer\n*  1984   – Jimmy Jacobs, American wrestler\n*  1984   – Katie Hill, Australian 3.0 point wheelchair basketball player.\n*  1984   – Drew Miller, American ice hockey player\n*  1984   – Marcin Gortat, Polish basketball player\n*1985 – Anders Jacobsen, Norwegian ski jumper\n*1988 – Vasyl Lomachenko, Ukrainian boxer\n*1989 – Rebecca Adlington, English swimmer\n*  1989   – Jake Marketo, Australian rugby league player\n*  1989   – Chord Overstreet, American actor and singer\n*  1989   – Tom Symonds, Australian rugby league player\n*1990 – Marianne St-Gelais, Canadian speed skater\n*1991 – Ed Sheeran, English singer-songwriter, guitarist, and producer\n*  1991   – Bonnie Wright, English actress, director, and screenwriter\n*1993 – Nicola Leali, Italian footballer\n*  1993   – Marc Márquez, Spanish motorcycle racer\n*1994 – Angie Miller, American singer-songwriter and pianist\n*1996 – Sasha Pieterse, South African actress\n\nDeaths\n\n* 306 – Theodore of Amasea, Roman soldier and Christian martyr\n* 364 – Jovian, Roman emperor (b. 331)\n* 440 – Mesrop Mashtots, Armenian monk, linguist, and theologian (b. 360)\n* 661 – Finan of Lindisfarne, Irish bishop and saint\n* 923 – Al-Tabari, Persian scholar (b. 839)\n*1178 – Evermode of Ratzeburg, bishop of Ratzeburg\n*1220 – Theobald I, Duke of Lorraine\n*1339 – Otto, Duke of Austria (b. 1301)\n*1371 – Ivan Alexander of Bulgaria\n*1500 – Adolph, Count of Oldenburg-Delmenhorst, German noble (b. before 1463)\n*1600 – Giordano Bruno, Italian mathematician, astronomer, and philosopher (b. 1548)\n*1609 – Ferdinando I de' Medici, Grand Duke of Tuscany (b. 1549)\n*1624 – Juan de Mariana, Spanish priest and historian (b. 1536)\n*1659 – Abel Servien, French politician, French Minister of Finance (b. 1593)\n*1673 – Molière, French actor and playwright (b. 1622)\n*1680 – Denzil Holles, 1st Baron Holles, English politician (b. 1599)\n*  1680   – Jan Swammerdam, Dutch biologist, zoologist, and entomologist (b. 1637)\n*1715 – Antoine Galland, French orientalist and archaeologist (b. 1646)\n*1732 – Louis Marchand, French organist and composer (b. 1669)\n*1768 – Arthur Onslow, English lawyer and politician, Speaker of the British House of Commons (b. 1691)\n*1841 – Ferdinando Carulli, Italian guitarist and composer (b. 1770)\n*1849 – María de las Mercedes Barbudo, Puerto Rican political activist, the first woman Independentista in the island (b. 1773)\n*1854 – John Martin, English painter, engraver, and illustrator (b. 1789)\n*1856 – Heinrich Heine, German journalist and poet (b. 1797)\n*1874 – Adolphe Quetelet, Belgian astronomer, mathematician, and sociologist (b. 1796)\n*1890 – Christopher Latham Sholes, American publisher and politician (b. 1819)\n*1905 – William Bickerton, English-American religious leader, leader in the Latter Day Saint movement (b. 1815)\n*1909 – Geronimo, American tribal leader (b. 1829)\n*1912 – Edgar Evans, Welsh sailor and explorer (b. 1876)\n*1919 – Wilfrid Laurier, Canadian lawyer and politician, 7th Prime Minister of Canada (b. 1841)\n*1934 – Albert I of Belgium (b. 1875)\n*  1934   – Siegbert Tarrasch, German chess player and theoretician (b. 1862)\n*1939 – Willy Hess, German violinist and educator (b. 1859)\n*1946 – Dorothy Gibson, American actress and singer (b. 1889)\n*1961 – Lütfi Kırdar, Turkish physician and politician, Turkish Minister of Health (b. 1887)\n*  1961   – Nita Naldi, American actress (b. 1897)\n*1962 – Joseph Kearns, American actor (b. 1907)\n*1962 – Bruno Walter, German-American pianist, composer, and conductor (b. 1876)\n*1966 – Hans Hofmann, German-American painter (b. 1880)\n*1970 – Shmuel Yosef Agnon, Ukrainian-Israeli novelist, short story writer, and poet, Nobel Prize laureate (b. 1888)\n*  1970   – Alfred Newman, American composer and conductor (b. 1900)\n*1977 – Janani Luwum, Ugandan archbishop and saint (b. 1922)\n*1979 – William Gargan, American actor (b. 1905)\n*1982 – Nestor Chylak, American baseball player and umpire (b. 1922)\n*  1982   – Thelonious Monk, American pianist and composer (b. 1917)\n*  1982   – Lee Strasberg, American actor and director (b. 1901)\n*1986 – Jiddu Krishnamurti, Indian-American philosopher and author (b. 1895)\n*1988 – John M. Allegro, English archaeologist and scholar (b. 1923)\n*  1988   – Karpoori Thakur, Indian educator and politician, 11th Chief Minister of Bihar (b. 1924)\n*1989 – Lefty Gomez, American baseball player (b. 1908)\n*1990 – Jean-Marc Boivin, French mountaineer, skier, and pilot (b. 1951)\n*1994 – Randy Shilts, American journalist and author (b. 1951)\n*1998 – Ernst Jünger, German soldier, philosopher, and author (b. 1895)\n*2003 – Steve Bechler, American baseball player (b. 1979)\n*2004 – José López Portillo, Mexican lawyer and politician, 51st President of Mexico (b. 1920)\n*2005 – Dan O'Herlihy, Irish-American actor (b. 1919)\n*  2005   – Omar Sívori, Argentinian footballer and manager (b. 1935)\n*2006 – Ray Barretto, American drummer (b. 1929)\n*  2006   – Bill Cowsill, American singer-songwriter and guitarist (b. 1948)\n*2009 – Conchita Cintrón, Chilean bullfighter and journalist (b. 1922)\n*2010 – Kathryn Grayson, American actress and singer (b. 1922)\n*2012 – Robert Carr, English engineer and politician, Shadow Chancellor of the Exchequer (b. 1916)\n*  2012   – Michael Davis, American singer-songwriter and bass player (b. 1943)\n*  2012   – Nicolaas Govert de Bruijn, Dutch mathematician and theorist (b. 1918)\n*  2012   – Ulric Neisser, German-American psychologist and academic (b. 1928)\n*2013 – Richard Briers, English actor (b. 1934)\n*  2013   – Shmulik Kraus, Israeli singer-songwriter and actor (b. 1935)\n*  2013   – Sophie Kurys, American baseball player (b. 1925)\n*  2013   – Mindy McCready, American singer-songwriter (b. 1975)\n*2014 – Bob Casale, American guitarist, keyboard player, and producer (b. 1952)\n*  2014   – Peter Florin, German politician and diplomat, President of the United Nations General Assembly (b. 1921)\n*  2014   – Wayne Smith, Jamaican singer (b. 1965)\n*2015 – John Barrow, American-Canadian football player and manager (b. 1935)\n*  2015   – Cathy Ubels-Veen, Dutch politician (b. 1928)\n*  2015   – Liu Yudi, Chinese general and pilot (b. 1923)\n*2016 – Andy Ganteaume, Trinidadian cricketer (b. 1921)\n*  2016   – Mohamed Hassanein Heikal, Egyptian journalist (b. 1923)\n*  2016   – Claude Jeancolas, French historian, author, and journalist (b. 1949)\n*  2016   – Tony Phillips, American baseball player (b. 1959)\n*  2016   – Andrzej Żuławski, Polish film director (b. 1940)\n*2017 – Robert H. Michel, American politician (b. 1923)\n*  2017   – Michael Novak, American Roman Catholic theologian (b. 1933)\n\nHolidays and observances\n\n*Christian feast day:\n**Seven Founders of the Servite Order\n***Alexis Falconieri\n**Constabilis\n**Donatus, Romulus, Secundian, and Companions\n**Fintan of Clonenagh\n**Janani Luwum (Anglican Communion)\n**Lommán of Trim\n**February 17 (Eastern Orthodox liturgics)\n*Independence Day, celebrates the independence declaration of Kosovo in 2008, still partially recognized.\n*Revolution Day (Libya)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "February 17" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11164" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 364 – Roman Emperor Jovian dies after a reign of eight months. He is found dead in his tent at Tyana (Asia Minor) en route back to Constantinople in suspicious circumstances.\n*1370 – Northern Crusades: Grand Duchy of Lithuania and the Teutonic Knights meet in the Battle of Rudau.\n*1411 – Following the successful campaigns during the Ottoman Interregnum, Musa Çelebi, one of the sons of Bayezid I, becomes Sultan with the support of Mircea I of Wallachia.\n*1500 – Duke Friedrich and Duke Johann attempt to subdue the peasantry of Dithmarschen, Denmark, in the Battle of Hemmingstedt.\n*1600 – The philosopher Giordano Bruno is burned alive, for heresy, at Campo de' Fiori in Rome.\n*1621 – Myles Standish is appointed as first military commander of the English Plymouth Colony in North America.\n*1753 – In Sweden February 17 is followed by March 1 as the country moves from the Julian calendar to the Gregorian calendar.\n*1801 – An electoral tie between Thomas Jefferson and Aaron Burr is resolved when Jefferson is elected President of the United States and Burr, Vice President by the United States House of Representatives.\n*1814 – War of the Sixth Coalition: The Battle of Mormant.\n*1819 – The United States House of Representatives passes the Missouri Compromise for the first time.\n*1838 – Weenen massacre: Hundreds of Voortrekkers along the Blaukraans River, Natal are killed by Zulus.\n*1854 – The United Kingdom recognizes the independence of the Orange Free State.\n*1859 – Cochinchina Campaign: The French Navy captured the Citadel of Saigon, a fortress that was manned by 1,000 Nguyễn dynasty soldiers, en route to conquering Saigon and other regions of southern Viet Nam.\n*1863 – A group of citizens of Geneva founded an International Committee for Relief to the Wounded, which later became known as the International Committee of the Red Cross.\n*1864 – American Civil War: The  becomes the first submarine to engage and sink a warship, the .\n*1865 – American Civil War: Columbia, South Carolina, is burned as Confederate forces flee from advancing Union forces.\n*1867 – The first ship passes through the Suez Canal.\n*1871 – The victorious Prussian Army parades through Paris, France, after the end of the Siege of Paris during the Franco-Prussian War.\n*1904 – Madama Butterfly receives its première at La Scala in Milan.\n*1913 – The Armory Show opens in New York City, displaying works of artists who are to become some of the most influential painters of the early 20th century.\n*1919 – The Ukrainian People's Republic asks Entente and the US for help fighting the Bolsheviks.\n*  1933   – Newsweek magazine is first published.\n*1944 – World War II: The Battle of Eniwetok begins: The battle ends in an American victory on February 22.\n*  1944   – World War II: Operation Hailstone begins: U.S. naval air, surface, and submarine attack against Truk Lagoon, Japan's main base in the central Pacific, in support of the Eniwetok invasion.\n*1949 – Chaim Weizmann begins his term as the first President of Israel.\n*1959 – Project Vanguard: Vanguard 2: The first weather satellite is launched to measure cloud-cover distribution.\n*1964 – In Wesberry v. Sanders the Supreme Court of the United States rules that congressional districts have to be approximately equal in population.\n*  1964   – Gabonese president Léon M'ba is toppled by a coup and his rival, Jean-Hilaire Aubame, is installed in his place.\n*1965 – Project Ranger: The Ranger 8 probe launches on its mission to photograph the Mare Tranquillitatis region of the Moon in preparation for the manned Apollo missions. Mare Tranquillitatis or the \"Sea of Tranquility\" would become the site chosen for the Apollo 11 lunar landing.\n*1968 – In Springfield, Massachusetts, the Naismith Memorial Basketball Hall of Fame opens.\n*1972 – Cumulative sales of the Volkswagen Beetle exceed those of the Ford Model T.\n*1974 – Robert K. Preston, a disgruntled U.S. Army private, buzzes the White House in a stolen helicopter.\n*1978 – The Troubles: The Provisional IRA detonates an incendiary bomb at the La Mon restaurant, near Belfast, killing 12 and seriously injuring 30 others, all Protestants.\n*1979 – The Sino-Vietnamese War begins.\n*1980 – First winter ascent of Mount Everest by Krzysztof Wielicki and Leszek Cichy.\n*1992 – Nagorno-Karabakh War: Armenian troops massacre more than 20 Azerbaijani civilians during the Capture of Garadaghly.\n*1995 – The Cenepa War between Peru and Ecuador ends on a ceasefire brokered by the UN.\n*1996 – In Philadelphia, world champion Garry Kasparov beats the Deep Blue supercomputer in a chess match.\n*  1996   – NASA's Discovery Program begins as the NEAR Shoemaker spacecraft lifts off on the first mission ever to orbit and land on an asteroid, 433 Eros.\n*  1996   – The 8.2  Biak earthquake shakes the Papua province of eastern Indonesia with a maximum Mercalli intensity of VIII (Severe). A large tsunami followed, leaving one-hundred sixty-six people dead or missing and 423 injured.\n*2006 – A massive mudslide occurs in Southern Leyte, Philippines; the official death toll is set at 1,126.\n*2008 – Kosovo declares independence as the Republic of Kosovo.\n*2011 – Libyan protests begin. In Bahrain, security forces launched a deadly pre-dawn raid on protesters in Pearl Roundabout in Manama, the day is locally known as Bloody Thursday.\n*2015 – Eighteen people are killed and 78 injured in a stampede at a Mardi Gras parade in Haiti.\n*2016 – Military vehicles explode outside a Turkish Armed Forces barracks in Ankara, Turkey, killing at least 29 people and injuring 61 others.\n\nBirths\n\n* 624 – Wu Zetian, Chinese consort to Emperor Gaozong of Tang, afterwards ruled as a regent and then as the empress of the Zhou dynasty (d. 705)\n*1451 – Raffaello Maffei, Italian theologian (d. 1522)\n*1490 – Charles III, Duke of Bourbon (d. 1527)\n*1519 – Francis, Duke of Guise (d. 1563)\n*1524 – Charles, Cardinal of Lorraine (d. 1574)\n*1646 – Pierre Le Pesant, sieur de Boisguilbert, French economist (d. 1714)\n*1653 – Arcangelo Corelli, Italian violinist and composer (d. 1713)\n*1723 – Tobias Mayer, German astronomer and academic (d. 1762)\n*1740 – Horace-Bénédict de Saussure, Swiss physicist and meteorologist (d. 1799)\n*1752 – Friedrich Maximilian Klinger, German author and playwright (d. 1831)\n*1754 – Nicolas Baudin, French cartographer and explorer (d. 1803)\n*1781 – René Laennec, French physician, invented the stethoscope (d. 1826)\n*1796 – Philipp Franz von Siebold, German physician and botanist (d. 1866)\n*1817 – Édouard Thilges, Luxembourgian jurist and politician, 7th Prime Minister of Luxembourg (d. 1904)\n*1820 – Henri Vieuxtemps, Belgian violinist and composer (d. 1881)\n*1821 – Lola Montez, Irish-American actress and dancer (d. 1861)\n*1832 – Richard Henry Park, American sculptor (d. 1902) \n*1836 – Gustavo Adolfo Bécquer, Spanish author, poet, and playwright (d. 1870)\n*1843 – Aaron Montgomery Ward, American businessman, founded Montgomery Ward (d. 1913)\n*1848 – Louisa Lawson, Australian poet and publisher (d. 1920)\n*1854 – Friedrich Alfred Krupp, German businessman (d. 1902)\n*1861 – Princess Helena of Waldeck and Pyrmont (d. 1922)\n*1862 – Mori Ōgai, Japanese general, author, and poet (d. 1922)\n*1864 – Jozef Murgaš, Slovak priest, botanist, and painter (d. 1929)\n*  1864   – Banjo Paterson, Australian journalist, author, and poet (d. 1941)\n*1874 – Thomas J. Watson, American businessman (d. 1956)\n*1877 – Isabelle Eberhardt, Swiss explorer and author (d. 1904)\n*  1877   – André Maginot, French sergeant and politician (d. 1932)\n*1881 – Mary Carson Breckinridge, American nurse-midwife, founded Frontier Nursing Service (d. 1965)\n*1887 – Joseph Bech, Luxembourgian lawyer and politician, 15th Prime Minister of Luxembourg (d. 1975)\n*  1887   – Leevi Madetoja, Finnish composer and critic (d. 1947)\n*1888 – Otto Stern, German-American physicist and academic, Nobel Prize laureate (d. 1969)\n*1890 – Ronald Fisher, English-Australian statistician, biologist, and geneticist (d. 1962)\n*1891 – Abraham Fraenkel, German-Israeli mathematician and academic (d. 1965)\n*1893 – Wally Pipp, American baseball player and journalist (d. 1965)\n*1899 – Jibanananda Das, Bangladeshi-Indian poet and author (d. 1954)\n*1900 – Ruth Clifford, American actress (d. 1998)\n*1903 – Sadegh Hedayat, Iranian-French author and translator (d. 1951)\n*1904 – Hans Morgenthau, German-American political scientist, philosopher, and academic (d. 1980)\n*1905 – Rózsa Péter, Hungarian mathematician (d. 1977)\n*1906 – Mary Brian, American actress (d. 2002) \n*1908 – Red Barber, American sportscaster (d. 1992)\n*  1908   – Bo Yibo, Chinese general and politician, Vice Premier of the People's Republic of China (d. 2007)\n*1910 – Marc Lawrence, American actor, director, producer, and screenwriter (d. 2005)\n*1911 – Oskar Seidlin, German-American author, poet, and scholar (d. 1984)\n*1912 – Andre Norton, American author (d. 2005)\n*1914 – Arthur Kennedy, American actor (d. 1990)\n*  1914   – Wayne Morris, American actor, singer, and producer (d. 1959)\n*1916 – Alexander Obolensky, Russian rugby player and pilot (d. 1940)\n*  1916   – Don Tallon, Australian cricketer (d. 1984)\n*  1916   – Raf Vallone, Italian footballer and actor (d. 2002)\n*1918 – William Bronk, American poet and academic (d. 1999)\n*  1918   – Jacqueline Ferrand, French mathematician (d. 2014)\n*1919 – J. M. S. Careless, Canadian historian and academic (d. 2009)\n*  1919   – Kathleen Freeman, American actress and singer (d. 2001)\n*  1919   – Joe Hunt, American tennis player (d. 1945)\n*1920 – Ivo Caprino, Norwegian director and screenwriter (d. 2001)\n*  1920   – Annie Castor, American disability and communication disorder advocate\n*  1920   – Curt Swan, American soldier and illustrator (d. 1996)\n*1921 – Duane Gish, American biochemist and academic (d. 2013)\n*1922 – Tommy Edwards, American R&B singer-songwriter (d. 1969)\n*1923 – John M. Allegro, English archaeologist and scholar (d. 1988)\n*  1923   – Buddy DeFranco, American clarinet player and bandleader (d. 2014)\n*1924 – Margaret Truman, American singer and author (d. 2008)\n*1925 – Ron Goodwin, English composer and conductor (d. 2003)\n*  1925   – Hal Holbrook, American actor and director\n*1928 – Marta Romero, Puerto Rican actress and singer (d. 2013)\n*1929 – Alejandro Jodorowsky, Chilean-French director and screenwriter\n*  1929   – Chaim Potok, American rabbi and author (d. 2002)\n*  1929   – Nicholas Ridley, Baron Ridley of Liddesdale, English lieutenant and politician, Secretary of State for Business, Innovation and Skills (d. 1993)\n*  1929   – Patricia Routledge, English actress and singer\n*1930 – Roger Craig, American baseball player, coach, and manager\n*  1930   – Benjamin Fain, Ukrainian-Israeli physicist and academic (d. 2013)\n*  1930   – Ruth Rendell, English author (d. 2015)\n*1931 – Jiřina Jirásková, Czech actress and singer (d. 2013)\n*  1931   – Buddy Ryan, American football coach (d. 2016)\n*1933 – Craig L. Thomas, American captain and politician (d. 2007)\n*1934 – Alan Bates, English actor (d. 2003)\n*  1934   – Barry Humphries (Dame Edna Everage), Australian comedian, actor, and author\n*1935 – Christina Pickles, English-American actress \n*1936 – Jim Brown, American football player and actor\n*1937 – Mary Ann Mobley, American model and actress, Miss America 1959 (d. 2014)\n*1940 – Vicente Fernández, Mexican singer-songwriter, actor, and producer\n*  1940   – Gene Pitney, American singer-songwriter (d. 2006)\n*1941 – Julia McKenzie, English actress, singer, and director\n*1942 – Huey P. Newton, American activist, co-founded the Black Panther Party (d. 1989)\n*1944 – Karl Jenkins, Welsh saxophonist, keyboard player, and composer (Soft Machine)\n*1945 – Zina Bethune, American actress, dancer, and choreographer (d. 2012)\n*  1945   – Brenda Fricker, Irish actress\n*1946 – Shahrnush Parsipur, Iranian-American author and academic\n*1948 – José José, Mexican singer-songwriter, producer, and actor\n*  1948   – Rick Majerus, American basketball player and coach (d. 2012)\n*1949 – Fred Frith, English guitarist and songwriter \n*  1949   – Dennis Green, American football player and coach (d. 2016)\n*1950 – Rickey Medlocke, American guitarist \n*1951 – Rashid Minhas, Pakistani soldier and pilot (d. 1971)\n*1952 – Karin Büttner-Janz, German gymnast and physician\n*  1952   – Vladimír Padrůněk, Czech bass player (d. 1991)\n*1954 – Lou Ann Barton, American blues singer-songwriter\n*  1954   – Miki Berkovich, Israeli basketball player\n*  1954   – Rene Russo, American actress \n*1955 – Mo Yan, Chinese author and academic, Nobel Prize laureate\n*1956 – Richard Karn, American actor and game show host\n*1957 – Loreena McKennitt, Canadian singer-songwriter, accordion player, and pianist\n*1959 – Aryeh Deri, Moroccan-Israeli rabbi and politician, Israeli Minister of Internal Affairs\n*  1959   – Rowdy Gaines, American swimmer and sportscaster\n*1960 – Lindy Ruff, Canadian hockey player and coach\n*1961 – Angela Eagle, English politician, Shadow Leader of the House of Commons\n*  1961   – Maria Eagle, English politician, Shadow Secretary of State for Defence\n*  1961   – Andrey Korotayev, Russian anthropologist, historian, and sociologist\n*1962 – Lou Diamond Phillips, American actor and director\n*1963 – Larry the Cable Guy, American comedian and voice actor\n*  1963   – Alison Hargreaves, English mountaineer (d. 1995)\n*  1963   – Jen-Hsun Huang, Taiwanese-American businessman, co-founded Nvidia\n*  1963   – Michael Jordan, American basketball player and actor\n*1965 – Michael Bay, American director and producer\n*  1965   – Danny Lee, Australian rugby league player\n*1966 – Michael Lepond, American bass player \n*  1966   – Quorthon, Swedish guitarist and songwriter (d. 2004)\n*  1966   – Luc Robitaille, Canadian ice hockey player, manager, and actor\n*1968 – Wu'erkaixi, Chinese journalist and activist\n*  1968   – Giuseppe Signori, Italian footballer  \n*1969 – David Douillet, French martial artist and politician\n*  1969   – Vasily Kudinov, Russian handball player (d. 2017)\n*1970 – Dominic Purcell, English-born Irish-Australian actor and producer\n*1971 – Denise Richards, American model and actress\n*1972 – Billie Joe Armstrong, American singer-songwriter, guitarist, actor, and producer \n*  1972   – Philippe Candeloro, French figure skater\n*  1972   – Taylor Hawkins, American singer-songwriter and drummer \n*  1972   – Valeria Mazza, Argentinian model and businesswoman\n*  1972   – Lars Göran Petrov, Swedish singer and drummer \n*1973 – Raphaël Ibañez, French rugby player\n*1974 – Kaoru, Japanese guitarist, songwriter, and producer \n*  1974   – Jerry O'Connell, American actor, director, and producer\n*1975 – Václav Prospal, Czech ice hockey player\n*1976 – Tonie Carroll, New Zealand-Australian rugby league player and coach\n*1978 – Rory Kinnear, English actor and playwright\n*1980 – Al Harrington, American basketball player\n*  1980   – Klemi Saban, Israeli footballer\n*1981 – Joseph Gordon-Levitt, American actor, director, and producer\n*  1981   – Paris Hilton, American model, media personality, actress, singer, DJ, author and businesswoman\n*  1981   – Pontus Segerström, Swedish footballer (d. 2014)\n*  1981   – Andrew Stephenson, English politician\n*1982 – Adriano, Brazilian footballer\n*  1982   – Brian Bruney, American baseball player\n*  1982   – Daniel Merriweather, Australian singer-songwriter \n*1983 – Kevin Rudolf, American singer-songwriter, guitarist, and producer\n*1984 – AB de Villiers, South African cricketer\n*  1984   – Jimmy Jacobs, American wrestler\n*  1984   – Katie Hill, Australian 3.0 point wheelchair basketball player.\n*  1984   – Drew Miller, American ice hockey player\n*  1984   – Marcin Gortat, Polish basketball player\n*1985 – Anders Jacobsen, Norwegian ski jumper\n*1988 – Vasyl Lomachenko, Ukrainian boxer\n*1989 – Rebecca Adlington, English swimmer\n*  1989   – Jake Marketo, Australian rugby league player\n*  1989   – Chord Overstreet, American actor and singer\n*  1989   – Tom Symonds, Australian rugby league player\n*1990 – Marianne St-Gelais, Canadian speed skater\n*1991 – Ed Sheeran, English singer-songwriter, guitarist, and producer\n*  1991   – Bonnie Wright, English actress, director, and screenwriter\n*1993 – Nicola Leali, Italian footballer\n*  1993   – Marc Márquez, Spanish motorcycle racer\n*1994 – Angie Miller, American singer-songwriter and pianist\n*1996 – Sasha Pieterse, South African actress\n\nDeaths\n\n* 306 – Theodore of Amasea, Roman soldier and Christian martyr\n* 364 – Jovian, Roman emperor (b. 331)\n* 440 – Mesrop Mashtots, Armenian monk, linguist, and theologian (b. 360)\n* 661 – Finan of Lindisfarne, Irish bishop and saint\n* 923 – Al-Tabari, Persian scholar (b. 839)\n*1178 – Evermode of Ratzeburg, bishop of Ratzeburg\n*1220 – Theobald I, Duke of Lorraine\n*1339 – Otto, Duke of Austria (b. 1301)\n*1371 – Ivan Alexander of Bulgaria\n*1500 – Adolph, Count of Oldenburg-Delmenhorst, German noble (b. before 1463)\n*1600 – Giordano Bruno, Italian mathematician, astronomer, and philosopher (b. 1548)\n*1609 – Ferdinando I de' Medici, Grand Duke of Tuscany (b. 1549)\n*1624 – Juan de Mariana, Spanish priest and historian (b. 1536)\n*1659 – Abel Servien, French politician, French Minister of Finance (b. 1593)\n*1673 – Molière, French actor and playwright (b. 1622)\n*1680 – Denzil Holles, 1st Baron Holles, English politician (b. 1599)\n*  1680   – Jan Swammerdam, Dutch biologist, zoologist, and entomologist (b. 1637)\n*1715 – Antoine Galland, French orientalist and archaeologist (b. 1646)\n*1732 – Louis Marchand, French organist and composer (b. 1669)\n*1768 – Arthur Onslow, English lawyer and politician, Speaker of the British House of Commons (b. 1691)\n*1841 – Ferdinando Carulli, Italian guitarist and composer (b. 1770)\n*1849 – María de las Mercedes Barbudo, Puerto Rican political activist, the first woman Independentista in the island (b. 1773)\n*1854 – John Martin, English painter, engraver, and illustrator (b. 1789)\n*1856 – Heinrich Heine, German journalist and poet (b. 1797)\n*1874 – Adolphe Quetelet, Belgian astronomer, mathematician, and sociologist (b. 1796)\n*1890 – Christopher Latham Sholes, American publisher and politician (b. 1819)\n*1905 – William Bickerton, English-American religious leader, leader in the Latter Day Saint movement (b. 1815)\n*1909 – Geronimo, American tribal leader (b. 1829)\n*1912 – Edgar Evans, Welsh sailor and explorer (b. 1876)\n*1919 – Wilfrid Laurier, Canadian lawyer and politician, 7th Prime Minister of Canada (b. 1841)\n*1934 – Albert I of Belgium (b. 1875)\n*  1934   – Siegbert Tarrasch, German chess player and theoretician (b. 1862)\n*1939 – Willy Hess, German violinist and educator (b. 1859)\n*1946 – Dorothy Gibson, American actress and singer (b. 1889)\n*1961 – Lütfi Kırdar, Turkish physician and politician, Turkish Minister of Health (b. 1887)\n*  1961   – Nita Naldi, American actress (b. 1897)\n*1962 – Joseph Kearns, American actor (b. 1907)\n*1962 – Bruno Walter, German-American pianist, composer, and conductor (b. 1876)\n*1966 – Hans Hofmann, German-American painter (b. 1880)\n*1970 – Shmuel Yosef Agnon, Ukrainian-Israeli novelist, short story writer, and poet, Nobel Prize laureate (b. 1888)\n*  1970   – Alfred Newman, American composer and conductor (b. 1900)\n*1977 – Janani Luwum, Ugandan archbishop and saint (b. 1922)\n*1979 – William Gargan, American actor (b. 1905)\n*1982 – Nestor Chylak, American baseball player and umpire (b. 1922)\n*  1982   – Thelonious Monk, American pianist and composer (b. 1917)\n*  1982   – Lee Strasberg, American actor and director (b. 1901)\n*1986 – Jiddu Krishnamurti, Indian-American philosopher and author (b. 1895)\n*1988 – John M. Allegro, English archaeologist and scholar (b. 1923)\n*  1988   – Karpoori Thakur, Indian educator and politician, 11th Chief Minister of Bihar (b. 1924)\n*1989 – Lefty Gomez, American baseball player (b. 1908)\n*1990 – Jean-Marc Boivin, French mountaineer, skier, and pilot (b. 1951)\n*1994 – Randy Shilts, American journalist and author (b. 1951)\n*1998 – Ernst Jünger, German soldier, philosopher, and author (b. 1895)\n*2003 – Steve Bechler, American baseball player (b. 1979)\n*2004 – José López Portillo, Mexican lawyer and politician, 51st President of Mexico (b. 1920)\n*2005 – Dan O'Herlihy, Irish-American actor (b. 1919)\n*  2005   – Omar Sívori, Argentinian footballer and manager (b. 1935)\n*2006 – Ray Barretto, American drummer (b. 1929)\n*  2006   – Bill Cowsill, American singer-songwriter and guitarist (b. 1948)\n*2009 – Conchita Cintrón, Chilean bullfighter and journalist (b. 1922)\n*2010 – Kathryn Grayson, American actress and singer (b. 1922)\n*2012 – Robert Carr, English engineer and politician, Shadow Chancellor of the Exchequer (b. 1916)\n*  2012   – Michael Davis, American singer-songwriter and bass player (b. 1943)\n*  2012   – Nicolaas Govert de Bruijn, Dutch mathematician and theorist (b. 1918)\n*  2012   – Ulric Neisser, German-American psychologist and academic (b. 1928)\n*2013 – Richard Briers, English actor (b. 1934)\n*  2013   – Shmulik Kraus, Israeli singer-songwriter and actor (b. 1935)\n*  2013   – Sophie Kurys, American baseball player (b. 1925)\n*  2013   – Mindy McCready, American singer-songwriter (b. 1975)\n*2014 – Bob Casale, American guitarist, keyboard player, and producer (b. 1952)\n*  2014   – Peter Florin, German politician and diplomat, President of the United Nations General Assembly (b. 1921)\n*  2014   – Wayne Smith, Jamaican singer (b. 1965)\n*2015 – John Barrow, American-Canadian football player and manager (b. 1935)\n*  2015   – Cathy Ubels-Veen, Dutch politician (b. 1928)\n*  2015   – Liu Yudi, Chinese general and pilot (b. 1923)\n*2016 – Andy Ganteaume, Trinidadian cricketer (b. 1921)\n*  2016   – Mohamed Hassanein Heikal, Egyptian journalist (b. 1923)\n*  2016   – Claude Jeancolas, French historian, author, and journalist (b. 1949)\n*  2016   – Tony Phillips, American baseball player (b. 1959)\n*  2016   – Andrzej Żuławski, Polish film director (b. 1940)\n*2017 – Robert H. Michel, American politician (b. 1923)\n*  2017   – Michael Novak, American Roman Catholic theologian (b. 1933)\n\nHolidays and observances\n\n*Christian feast day:\n**Seven Founders of the Servite Order\n***Alexis Falconieri\n**Constabilis\n**Donatus, Romulus, Secundian, and Companions\n**Fintan of Clonenagh\n**Janani Luwum (Anglican Communion)\n**Lommán of Trim\n**February 17 (Eastern Orthodox liturgics)\n*Independence Day, celebrates the independence declaration of Kosovo in 2008, still partially recognized.\n*Revolution Day (Libya). February 17. http://en.wikipedia.org/?curid=11164."
  }
}
