{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2386",
  "eid" : "bfe2f010-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778401681,
  "textBody" : "American Airlines, Inc. (AA) is a major U.S. airline headquartered in Fort Worth, Texas, within the Dallas-Fort Worth metroplex. It is the world's largest airline when measured by fleet size, revenue, scheduled passenger-kilometers flown, and number of destinations served. American together with its regional partners operates an extensive international and domestic network with an average of nearly 6,700 flights per day to nearly 350 destinations in more than 50 countries.\n\nAmerican Airlines is a founding member of Oneworld alliance, the third largest airline alliance in the world and coordinates fares, services, and scheduling with alliance partners British Airways, Iberia, and Finnair in the transatlantic market and with Cathay Pacific and Japan Airlines in the transpacific market. Regional service is operated by independent and subsidiary carriers under the brand name of American Eagle.\n\nAmerican operates out of ten hubs located in Dallas/Fort Worth, Charlotte, Chicago–O'Hare, Philadelphia, Miami, Phoenix–Sky Harbor, Washington–National, Los Angeles, New York–JFK, and New York–LaGuardia. American operates its primary maintenance base at Tulsa International Airport in addition to the maintenance locations located at its hubs. Dallas/Fort Worth International Airport is American Airlines’ largest passenger carrying hub, handling 51.1 million passengers annually with an average of 140,000 passengers daily. The company as of 2015 employs over 113,300 people. Through the airline's parent company, American Airlines Group, it is publicly traded under NASDAQ: AAL with a market capitalization of about $25 billion as of 2017.\n\nHistory \n\nAmerican Airlines was started in 1930 via a union of more than eighty small airlines.\n\nThe two organizations from which American Airlines was originated were Robertson Aircraft Corporation and Colonial Air Transport.  The former was first formed in Missouri in 1921, with both being merged in 1929 into holding company The Aviation Corporation.  This in turn, was made in 1930 into an operating company and rebranded as American Airways.  In 1934, when new laws and attrition of mail contracts forced many airlines to reorganize, the corporation redid its routes into a connected system, and was renamed American Airlines.  Between 1970 and 2000, the company grew into being an international carrier, purchasing Trans World Airlines in 2001.\n\nIn 2011, due to a downturn in the airline industry, American Airlines' parent company AMR Corporation filed for bankruptcy protection.  In 2013, US Airways purchased American Airlines but kept the American Airlines name, as it was the better recognized brand internationally; the combination of the two airlines resulted in the creation of the largest airline in the United States, and ultimately the world.https://www.britannica.com/topic/American-Airlines\n\nCorporate affairs\n\nHeadquarters\n\nAmerican Airlines is headquartered in Fort Worth, Texas, adjacent to the Dallas/Fort Worth International Airport.\"[https://www.aa.com/i18n/aboutUs/corporateInformation/facts/structure.jsp Corporate Structure].\" American Airlines. Retrieved 18 May 2009. The headquarters is located in two office buildings in the CentrePort office complex and these buildings together have about 1400000 sqft of space.  over 4,300 employees work at this complex.\"[http://www.aa.com/i18n/amrcorp/corporateInformation/facts/americanairlinesgroup.jsp American Airlines Group Overview] [https://www.webcitation.org/6P4lfN3BM?urlhttp://www.aa.com/i18n/amrcorp/corporateInformation/facts/americanairlinesgroup.jsp Archived copy] at WebCite (April 24, 2014).\" ([https://www.webcitation.org/6P4lfN3BM?url\nhttp://www.aa.com/i18n/amrcorp/corporateInformation/facts/americanairlinesgroup.jsp Archive]). American Airlines. Retrieved on April 24, 2014.\n\nBefore it was headquartered in Texas, American Airlines was headquartered at 633 Third Avenue in the Murray Hill area of Midtown Manhattan, New York City.World Airline Directory. Flight International. March 20, 1975. \"[http://www.flightglobal.com/pdfarchive/view/1975/1975%20-%200536.html 472].\"[http://gonyc.about.com/od/manhattan/l/bl_gramercy.htm Flatiron / Gramercy / Murray Hill / Union Square: Manhattan Neighborhood Map].\" About.com. Retrieved 25 January 2009. In 1979, American moved its headquarters to a site at Dallas/Fort Worth International Airport, which affected up to 1,300 jobs. Mayor of New York City Ed Koch described the move as a \"betrayal\" of New York City.Sterba, James P. \"[https://select.nytimes.com/gst/abstract.html?resF50F15FE3C5511728DDDAF0994D9415B888BF1D3 American Will Shift Headquarters From Manhattan to Dallas Airport; Big Economies Predicted].\" The New York Times. Thursday November 16, 1978. Page A1. Retrieved 27 August 2009. American moved to two leased office buildings in Grand Prairie, Texas.\"[https://news.google.com/newspapers?id9ZYTAAAAIBAJ&sjid\n5gUEAAAAIBAJ&pg3054,25513&dq\namerican-airlines+new+headquarters American Airlines Finishes Moving into Headquarters Monday].\" Associated Press at Ocala Star-Banner. January 16, 1983. 6A. Google News 4 of 62. Retrieved 27 August 2009. On January 17, 1983, the airline finished moving into a $150 million ($ when adjusted for inflation), 550000 sqft facility in Fort Worth; $147 million (about $ when adjusted for inflation) in Dallas/Fort Worth International Airport bonds financed the headquarters. The airline began leasing the facility from the airport, which owns the facility.\n\nAs of 2015 American Airlines is the corporation with the largest presence in Fort Worth.Brown, Steve. \"[http://www.dallasnews.com/business/airline-industry/20151022-american-airlines-will-build-new-headquarters-in-fort-worth1.ece American Airlines will build new headquarters in Fort Worth]\" ([https://www.webcitation.org/6cZgNBsFZ?url\nhttp://www.dallasnews.com/business/airline-industry/20151022-american-airlines-will-build-new-headquarters-in-fort-worth1.ece Archive]). The Dallas Morning News. October 22, 2015. Retrieved on October 27, 2015. \"Robert Sturns, Fort Worth's economic development director, said the city was committed to keeping its largest corporate citizen.\"\n\nNew headquarters\n\nIn 2015, the airline announced it will build a new headquarters in Fort Worth. Groundbreaking began in the spring of 2016 and occupancy is scheduled for summer 2019.Owens, Marjorie, Jason Whitely, and Jim Douglas. \"[http://www.wfaa.com/story/news/2015/10/22/american-to-build-new-headquarters-in-fort-worth/74395434/ American to build new headquarters in Fort Worth]\" ([https://www.webcitation.org/6cWE7iPZM?url\nhttp://www.wfaa.com/story/news/2015/10/22/american-to-build-new-headquarters-in-fort-worth/74395434/ Archive]). WFAA. October 22, 2015. Retrieved on October 24, 2015. The airline plans to house 5,000 new workers in the building.\n\nIt will be located on a 41 acre property adjacent to the airline's flight academy and conference and training center, west of Texas State Highway 360, 2 mi west from the current headquarters. The airline will lease a total of 300 acre from Dallas-Fort Worth International Airport and this area will include the headquarters.Construction of the new headquarters began after the demolition of the Sabre facility previously on the site.\n\nThe airline considered developing a new headquarters in Irving, on the Texas Stadium site, before deciding to keep the headquarters in Fort Worth.\n\nU.S. federal government subsidies\n\nAs of November 2013 American Airlines and American Eagle received $10,011,836 in annual federal subsidies for Essential Air Services. These subsidies are awarded by public tender and ensure that small, rural airports can be connected to the national air network.\n\nLabor unions\n\n* The Allied Pilots Association (APA) is an in-house union which represents the nearly 15,000 American Airlines pilots; it was created in 1963 after the pilots left the Air Line Pilots Association (ALPA). The majority of American Eagle pilots are ALPA members.\n* The Association of Professional Flight Attendants (APFA) represents American Airlines flight attendants, including former USAirways flight attendants. \n* Flight Attendants at American wholly owned Regional Carriers (Envoy - former American Eagle), Piedmont and PSA are all represented by [http://www.afacwa.org/ Association of Flight Attendants - Communications Workers of America] (AFA-CWA). USAirways Flight Attendants were active members of AFA-CWA prior to the merger. They are honorary lifetime members. AFA-CWA is the largest Flight Attendant Union in the industry and is operated by Flight Attendants.\n* The Transport Workers Union-International Association of Machinists alliance (TWU-IAM) represents the majority of American Airlines employed fleet service clerks, mechanics and other ground workers.\n* American's customer service and gate employees belong to the Communications Workers of America/International Brotherhood of Teamsters Passenger Service Association.\n\nEnvironmental record\n\nViolations occurring over a 4½ year period—from October 1993 to July 1998—targeted American Airlines for using high-sulfur fuel in motor vehicles at 10 major airports around the country. Under the federal Clean Air Act high sulfur fuel cannot be used in motor vehicles. American Airlines promptly identified and corrected these violations of the Clean Air Act.\n\nAmerican Airlines' wastewater treatment plant recycles water used at the base to wash aircraft, process rinse water tanks, and irrigate landscape. That alone has saved almost $1 million since 2002. In addition to that, American Airlines has also won the award for the reduction of hazardous waste that saved them $229,000 after a $2,000 investment. A bar code system is used to track hazardous waste. It has led to reduction of waste by 50 percent since 2000.\n\nSponsorships\n\nAmerican Airlines is title sponsor of two basketball venues: American Airlines Center (Dallas Mavericks), (Dallas Stars) and American Airlines Arena (Miami Heat).\n\nThe company sponsors several professional sports teams:\n* Carolina Panthers\n* Chicago Cubs\n* Dallas Cowboys\n* Dallas Mavericks\n* New England Patriots\n* New England Revolution\n* Philadelphia Eagles\n\nCorporate identity\n\nLogo\n\nIn 1931, Goodrich Murphy, an American employee, designed the AA logo.  The logo was redesigned by Massimo Vignelli in 1967. Thirty years later, in 1997, American Airlines was able to make its logo Internet-compatible by buying the domain AA.com. AA is also American's two-letter IATA airline designator.\n\nOn January 17, 2013, American launched a new rebranding and marketing campaign with FutureBrand dubbed, \"A New American\". This included a new logo replacing the logo used since 1967. American Airlines calls the new logo the \"Flight Symbol, incorporating the eagle, star, and the letter “A” of the classic logo.  \n\nOn June 3, 2016, American Airlines sought to register their 2013 logo with the United States Copyright Office.  However, in October of that year the Copyright Office ruled that the logo was ineligible for copyright protection, as it did not pass the threshold of originality. American submitted multiple requests for the Copyright Office to reconsider their determination. However, on January 8, 2018, the Copyright Office made a final decision that affirmed its initial determination that American's new logo was ineligible for copyright protection and is thus in the public domain.\n\nLivery\n\nAmerican's early liveries varied widely, but a common livery was adopted in the 1930s, featuring an eagle painted on the fuselage.   The eagle became a symbol of the company and inspired the name of American Eagle Airlines. Propeller aircraft featured an international orange lightning bolt running down the length of the fuselage, which was replaced by a simpler orange stripe with the introduction of jets.\n\nIn the late 1960s, American commissioned designer Massimo Vignelli to develop a new livery. The original design called for a red, white, and blue stripe on the fuselage, and a simple \"AA\" logo, without an eagle, on the tail; instead, Vignelli created a highly stylized eagle, which remained the company's logo until 2013. In 1999, American painted a new Boeing 757 (N679AN) in its 1959 international orange livery. One Boeing 777 and one Boeing 757 were painted in standard livery with a pink ribbon on the sides and on the tail, in support of Susan G. Komen for the Cure. One Boeing 757 is painted with a yellow ribbon on the tailfin on the aircraft and on the side of the body says \"Flagship Freedom\". American Eagle, the airline's regional airline has the same special livery on ERJ-145 aircraft.\n\nOn January 17, 2013, American unveiled a new livery. Before then, American had been the only major U.S. airline to leave most of its aircraft surfaces unpainted. This was because C. R. Smith hated painted aircraft, and refused to use any liveries that involved painting the entire plane. Robert \"Bob\" Crandall later justified the distinctive natural metal finish by noting that less paint reduced the aircraft's weight, thus saving on fuel costs.\n\nIn January 2013, American launched a new rebranding and marketing campaign dubbed, \"The New American\". In addition to a new logo, American Airlines introduced a new livery for its fleet. The airline calls the new livery and branding \"a clean and modern update\". The current design features an abstract American flag on the tail, along with a silver-painted fuselage, as a throw-back to the old livery. The new design was painted by Leading Edge Aviation Services in California. Doug Parker, the incoming CEO indicated that the new livery could be short-lived, stating that \"maybe we need to do something slightly different than that ... The only reason this is an issue now is because they just did it right in the middle, which kind of makes it confusing, so that gives us an opportunity, actually, to decide if we are going to do something different because we have so many airplanes to paint\".King, Eric. (2013-03-28) [http://www.nbcdfw.com/news/business/American-Airlines-New-Livery-Soon-Could-Become-Its-Old-Look-200532901.html American Airline's New Livery Soon Could Become Its Old Look | NBC 5 Dallas-Fort Worth]. Nbcdfw.com. Retrieved on 2013-07-18.\n\nIn the end, American let its employees decide the new livery's fate. On an internal website for employees, American posted two options, one the new livery and one a modified version of the old livery. All of the American Airlines Group employees (including US Airways and other affiliates) were able to vote.   American ultimately decided to keep the new look. Parker announced that American would keep a US Airways heritage aircraft in the fleet, with plans to add a heritage TWA aircraft and a heritage American plane with the old livery.  \n\nSlogans\n\n* Current: \"The World's Greatest Flyers Fly American\" \n* 2015-2016: \"Going for great.\"\n* 2013–2014: AA/US merger (With the introduction of new logo and branding in 2013.) – \"The new American is arriving.\" (Spanish: \"El nuevo American está llegando.\")\n* 2011–13: – \"Be yourself. Nonstop.\"\n* 2000s–13: – \"We know why you fly.\" (Spanish: \"Sabemos por qué vuelas\")\n* AA/TWA merger – \"Two great airlines, one great future.\"\n* 2001 (post-9/11) – \"We are an airline that is proud to bear the name: American.\"\n* 1998 – early 2000s - \"New York's Bridge To The World\" (Used for marketing in the New York metropolitan area.)\n* Early – mid-1990s – \"We Mean Business In Chicago.\" (Used for marketing in the Chicago market.)\n* 1988 – mid-1990s – \"Based Here. Best Here.\" (Used for marketing in the Dallas/Fort Worth Metroplex.)\n* 1988 – \"The On-Time Machine.\"\n* Late 1980s – \"No other Airline gives you more of America, than American.\"\n* 1984–2000 – \"Something special in the air.\" (Several variants of this slogan existed. Variant used on the website: \"Something special online.\", Spanish variant: \"Todo es especial, tú eres especial.\", Variant used to market European routes: \"Something special to Europe.\" Variant used with the previous tune: \"We're American Airlines. Something special in the air.\")\n* 1982 – late 1980s – \"En American, tenemos lo que tú buscas.\" (Spanish slogan, translated to \"At American, we've got what you're looking for\").\n* 1975 – 1984 – \"We're American Airlines. Doing what we do best.\" (The tune used for the campaign would be retained for several years with the \"Something special in the air\" slogan).\n* 1971 – 1975 – \"Our passengers get the best of everything.\" (also known as \"You get the best of everything.\")\n* 1969 – 1971 – \"It's good to know you're on American Airlines.\"\n* 1967 – 1969 – \"Fly the American Way.\", resurrected in 2017\n* 1964 – 1967 – \"American built an airline for professional travelers.\" (also known as \"You'll love it.\")\n* 1950s – 1964 – \"America's Leading Airline.\"\n\nHubs\n\nCurrent hubs\n\nAmerican currently operates ten hubs across the continental U.S.\n* Dallas/Fort Worth International Airport – American's primary hub, and its largest hub in terms of daily flights and number of destinations and American's primary hub for the South. American currently has about 85% of the market share and flies approximately 56 million passengers through DFW every year, which is about 153,000 people per day making it the busiest airline at the airport. American's corporate headquarters are also in Fort Worth near the airport. Dallas/Fort Worth remains the largest hub for American, in terms of passenger traffic since the American-US Airways merger. DFW serves as American's primary gateway to Mexico, and secondary gateway to Latin America. \n* Charlotte Douglas International Airport – American's second-largest hub in terms of number of destinations and daily flights. It is American's primary hub for the Southeastern United States. About 42 million passengers fly through CLT on American every year, or about 115,000 people per day. As of 2013 American has about 90% of the market share at CLT, making it the airport's largest airline. Charlotte was previously US Airways' largest hub before the American-US Airways merger.\n* O'Hare International Airport – The third-largest hub for American in terms of number of flights and American's primary hub for the Midwest. About 27 million passengers fly on American through O'Hare every year, or about 74,000 people per day. As of 2013 American has about 40% of the market share at O'Hare making it the airport's second-largest airline after United. O'Hare was American's second-largest hub before the American-US Airways merger.\n* Philadelphia International Airport – The fourth-largest hub in terms of number of daily flights and American's primary East Coast hub. American flies approximately 23 million passengers a year through PHL, which is about 63,000 people per day. As of 2013 American has about 70% of the market share at PHL, making it the airport's largest airline. PHL was US Airways' second-largest hub before the American-US Airways merger. Philadelphia is American Airlines' primary European and transatlantic gateway.\n* Miami International Airport – The fifth-largest hub in terms of number of flights. About 30 million passengers fly through MIA every year on American, which is about 82,000 people per day. American has about 70% of the market share at Miami International, making it the largest airline at the airport. Miami was previously American's third-largest hub before the American-US Airways merger. Miami is American's primary South American and Caribbean gateway.\n* Phoenix Sky Harbor International Airport – The sixth-largest hub in terms of number of flights and destinations and American's primary western hub. American flies approximately 23 million passengers a year through PHX, which is about 63,000 people per day. Currently American has about 52.6% of the market share at PHX, making it the airport's largest airline. PHX was previously US Airways' third-largest hub before the American-US Airways merger. Phoenix is American Airlines' only major domestic hub without service to Asia or Europe (service to Europe is currently operated by Oneworld partner British Airways operating a Phoenix to Heathrow flight, however, no transoceanic flights currently exist on AA metal).\n* Ronald Reagan Washington National Airport – The seventh-largest hub for American in terms of number of destinations and flights and American's third hub for the East Coast. The airport also serves as a base for American Airlines Shuttle. About 12 million passengers fly through DCA on American every year, or about 33,000 people per day. American has about 23.7% of the market share at DCA, making it the largest carrier at the airport. DCA was US Airways' fourth-largest hub before the American-US Airways merger.\n* Los Angeles International Airport – The eighth-largest hub in terms of number of destinations and flights and American's hub for the West Coast. About 16.5 million passengers fly through LAX on American every year, or about 45,000 people per day. American has about 23% of the market share at LAX, making it the largest carrier at the airport. LAX was American's fourth-largest hub before the American-US Airways merger. LAX is American Airlines' primary transpacific gateway.\n* John F. Kennedy International Airport – The ninth-largest hub for American in terms of number of destinations and flights and American's secondary East Coast hub. About 9.4 million passengers fly through JFK on American every year, or about 26,000 people per day. American has about 11% of the market share at JFK, making it the third-largest carrier at the airport behind Delta and JetBlue. JFK was American's fifth-largest hub before the American-US Airways merger. JFK is American's secondary European and transatlantic gateway. Since 2017, American has started reducing its international operations at JFK, opting to expand its Philadelphia hub instead.\n* LaGuardia Airport – The tenth-largest hub for American in terms of number of destinations and flights and American's fourth hub for the East Coast. About 7.5 million passengers fly through LGA on American every year, or about 21,000 people per day. The airport also serves as a base for American Airlines Shuttle. American has about 28% of the market share at LGA, and is the second-largest carrier behind Delta.\n\nFormer hubs\n\n* Lambert–St. Louis International Airport – American closed its St. Louis hub in 2009 because of the declining need for a second Midwestern hub. The St. Louis hub was inherited from Trans World Airlines.\n* Luis Muñoz Marín International Airport – American closed its San Juan hub in 2012. American used San Juan as a connection point for Caribbean destinations using ATR-72 commuter aircraft. American has since removed the ATR-72 series aircraft from its regional fleet and closed its hub at San Juan.\n* Nashville International Airport – American saw a decrease in passenger traffic and closed its Nashville hub in the mid-1990s to cut costs.\n* Raleigh–Durham International Airport – American closed its Raleigh-Durham hub in the mid-1990s after it was deemed not profitable.\n* San Jose International Airport – American closed its San Jose hub in the early 2000s. The hub was begun on December 2, 1988 with planned growth to 1991, soon after American acquired Air Cal and was seeking a Northern California hub either in San Jose or San Francisco.  The San Jose hub was inherited with the acquisition of Reno Air.  Reno Air had made San Jose a hub in the mid-1990s after American had decided that the competition on the West Coast made the hub unprofitable and closed it.\n\nMaintenance bases\n\n* Dallas/Fort Worth International Airport - Primary base for Airbus A319, and A321 aircraft, Boeing 777 and 787 aircraft, secondary base for Boeing 737, 757, 767, and McDonnell Douglas MD-80 aircraft.\n* LaGuardia Airport - American operates a small maintenance base for Boeing 737 and ERJ-145 aircraft.\n* Pittsburgh International Airport - Primary base for all legacy US Airways Airbus aircraft.\n* Tulsa International Airport - Primary base for all of American's Boeing fleet (with the exception of the 777 and 787), as well as American Eagle aircraft.\n\nDestinations\n\nAmerican operated interchange flight services in conjunction with Alaska Airlines during the 1970s between Texas and Alaska during the construction of the Trans-Alaska oil pipeline. This interchange agreement allowed for single, no change of aircraft service between Houston, Texas and Dallas/Fort Worth, Texas, and Anchorage, Alaska and Fairbanks, Alaska. The round trip routing of this interchange flight was Houston-Dallas/Fort Worth-Seattle-Anchorage-Fairbanks with Seattle, Washington serving as the interchange point where flight and cabin crews were changed from one airline to the other. Boeing 727-200 jetliners provided by both American and Alaska Airlines were utilized to provide this interchange service.\n\nAmerican Airlines is the only US carrier that flies to Barranquilla, Belo Horizonte, Brasilia, Cali, Cap-Haitien, Caracas, Fort-de-France, Guayaquil, La Paz, Manaus, Maracaibo, Montevideo, Pointe-a-Pitre, San Salvador (Bahamas), Santa Cruz de la Sierra and Varadero. It is also the leading U.S. carrier to Cuba in terms of passenger volume.\n\nCodeshare agreements\n\nAmerican Airlines codeshares with the following airlines:\n\n* Air Tahiti Nui\n* Alaska Airlines\n* British Airways\n* Caribbean Airlines\n* Cape Air\n* Cathay Pacific\n* China Southern Airlines\n* El Al\n* Etihad Airways (ends 25 March 2018)\n* Fiji Airways\n* Finnair\n* Gulf Air (ends 30 April 2018)\n* Hainan Airlines\n* Hawaiian Airlines\n* Iberia\n* Interjet\n* Japan Airlines\n* Jetstar Airways\n* Jetstar Japan\n* Korean Air \n* LATAM Argentina\n* LATAM Brasil\n* LATAM Chile\n* LATAM Ecuador\n* Malaysia Airlines\n* Qantas\n* Qatar Airways (ends 25 March 2018)\n* Royal Jordanian\n* Seaborne Airlines\n* SriLankan Airlines\n* WestJet (ends 31 July 2018)\n\nJoint ventures\n\nIn particular, American has joint ventures with British Airways, Iberia, and Finnair on transatlantic routes and with Japan Airlines, Qantas and Cathay Pacific on transpacific routes.\n\nFleet\n\nAs of October 2017, American Airlines operates a fleet of 947 aircraft, making it the largest commercial fleet in the world. It operates a mix of Airbus, Boeing, Embraer, and McDonnell Douglas aircraft.\n\nOver two thirds of American's aircraft are narrow-bodies, mainly Airbus A320 series and Boeing 737-800. It also operates Boeing 757, Embraer 190 and McDonnell Douglas MD-82/83, but most of them are planned to be phased out within five years.\n\nIts wide-body aircraft are mainly Boeing airliners. It is the third-largest operator of the Boeing 767 series and the fifth-largest operator of the Boeing 777 series. It also operates the Airbus A330.\n\nOn July 20, 2011, American announced an order for 460 narrowbody jets including 260 Airbus A320s.\nThe order broke Boeing's monopoly with the airline and forced Boeing into the re-engined 737 MAX.\nAs this sale included a Most-Favoured-Customer Clause, the European airframer has to refund any difference to American if it sells to another airline at a lower price, so Airbus can't give a competitive price to competitor United Airlines, leaving it to a Boeing-skewed fleet.\n\nCabin\n\nFlagship First\n\nFlagship First is American's international first class product. It is exclusively offered on all Boeing 777-300ERs in the fleet. \n\n• Boeing 777-300ER: Fully lie-flat seats with direct aisle access in a 1-2-1 reverse herringbone configuration. Seat length: 82 inches (208 cm). Equipped with a 17-inch (43 cm) touchscreen monitor and touchscreen handset, two universal AC power outlets, and USB ports.\n\nAmenities Include:\n\n• Flagship check-in privileges\n\n• 3 complimentary checked bags\n\n• Access to the Flagship Lounge (International First Class Lounge while the Flagship Lounges are being refurbished)\n\n• Early boarding\n\n• First Class amenity kit\n\n• Turndown service with pajamas\n\n• A pair of Bose QuietComfort Acoustic Noise Canceling Headsets to use during flight\n\n• Inflight wine tasting\n\n• Premium alcoholic beverages and wine selections (including pre-departure champagne service)\n\n• Chef-inspired dining options\n\n• Access to the premium cabin walk-up bar, which features assorted snacks and beverages throughout the duration of the flight.\n\nFlagship Business\n\nFlagship Business is offered on some Boeing 757-200s and all Airbus A330-200s, Airbus A330-300s, Boeing 767-300ERs, Boeing 777-200ERs, Boeing 777-300ERs, Boeing 787-8s, and Boeing 787-9s.\n• Airbus A330: Fully lie-flat Cirrus seats manufactured by Zodiac Seats France and designed by JPA Design for US Airways with direct aisle access in a 1-2-1 reverse herringbone configuration. Seat length: 76-80 inches (193–203 cm). Equipped with a 12.1 inch (31 cm) touchscreen monitor, one universal AC power outlet, and USB ports.[1]\n\n• Boeing 757-200 International: Fully lie-flat Diamond seats manufactured by B/E Aerospace and designed for American Airlines in a 2-2 configuration. Seat length: 75–78 inches (191–198cm). Equipped with Samsung Galaxy Tab™ 10.1 inch (26 cm) tablets, and two universal AC power outlets (one to power the tablet).\n\n• Boeing 767-300ER: Fully lie-flat seats manufactured by Thompson Aero Seating with direct aisle access in a 1-2-1 staggered configuration. Equipped with Samsung Galaxy Tab™ 10.1 inch (26 cm) tablets, two universal AC power outlets (one to power the tablet), and USB ports.\n\n• Boeing 777-200ER Version 1: Fully lie-flat seats manufactured by Zodiac Seats France, designed for American Airlines, with direct aisle access in a 1-2-1 reverse herringbone configuration with front-facing and rear-facing seats. Seat length: 77 inches (196cm). Equipped with a 16-inch (41 cm) touchscreen monitor and touchscreen handset, two universal AC power outlets, and USB ports.\n\n• Boeing 777-200ER Version 2: Fully lie-flat Super Diamond seats manufactured by B/E Aerospace and designed for American Airlines with direct aisle access in a 1-2-1 reverse herringbone configuration. Seat length: 77 inches (196cm). Equipped with a UNKNOWN-inch (UNKNOWN cm) touchscreen monitor and touchscreen handset, one universal AC power outlet, and USB ports.\n\n• Boeing 777-300ER: Fully lie-flat Cirrus seats manufactured by Zodiac Seats UK, designed by JPA Design for Cathay Pacific, and licensed from Cathay Pacific with direct aisle access in a 1-2-1 reverse herringbone configuration. Seat length: 76-80 inches (193–203 cm). Equipped with a 15.4-inch(39 cm) inch touchscreen monitor, one universal AC power outlet, and USB ports.[2]\n\n• Boeing 787-8: Fully lie-flat seats manufactured by Zodiac Seats France and designed for American Airlines with direct aisle access in a 1-2-1 reverse herringbone configuration with front-facing and rear-facing seats. Seat length: 77 inches (196cm). Equipped with a 16-inch (41 cm) touchscreen monitor and touchscreen handset, two universal AC power outlets, and USB ports.\n\n• Boeing 787-9: Fully lie-flat Super Diamond seats manufactured by B/E Aerospace and designed for American Airlines with direct aisle access in a 1-2-1 reverse herringbone configuration. Seat length: 77 inches (196cm). Equipped with a UNKNOWN-inch (UNKNOWN cm) touchscreen monitor and touchscreen handset, one universal AC power outlet, and USB ports.\n\nAmenities Include:\n\n• Priority check-in privileges\n\n• 2 complimentary checked bags\n\n• Access to the Admirals Club\n\n• Early boarding\n\n• Flagship Business amenity kit\n\n• A pair of Bose QuietComfort Acoustic Noise Canceling Headsets to use during flight\n\n• Premium alcoholic beverages and wine selections (including pre-departure beverage service)\n\n• Chef-inspired dining options\n\n• Access to the premium cabin walk-up bar, which features assorted snacks and beverages throughout the duration of the flight (available on the Boeing 777-300ER, Boeing 777-200, Boeing 787-8, and Boeing 787-9)\n\n• On flights from Los Angeles to Hong Kong and Sydney and Dallas to Hong Kong, turndown service and pajamas are also provided\n\nTranscontinental\n\nAmerican has dedicated 17 Airbus A321s (A321T) in its fleet for the specific use of flying transcontinental routes between New York JFK - Los Angeles LAX and New York JFK - San Francisco SFO. These aircraft offer two premium cabins, Flagship First and Flagship Business, which are unique among domestic mainline aircraft in American's fleet:\n\n• Flagship First: Fully lie-flat seats manufactured by Zodiac Seats France and designed for American Airlines with direct aisle access in a 1-1 reverse herringbone configuration. Seat length: UNKNOWN inches (UNKNOWN cm). Equipped with a 15.4-inch (39 cm) inch touchscreen monitor and touchscreen handset, one universal AC power outlet, and USB ports.\n\n• Flagship Business: Fully lie-flat Diamond seats manufactured by B/E Aerospace and designed for American Airlines in a 2-2 configuration. Seat length: 75–78 inches (191–198cm). Equipped with a 15.4-inch (39 cm) touchscreen monitor and touchscreen handset, one universal AC power outlet, and USB ports.\n\nAmenities Include:\n\n• Priority check-in privileges\n\n• 2/3 (First Class) complimentary checked bags\n\n• Access to the Admirals Club/Flagship Lounge (First Class)\n\n• Early boarding\n\n• First Class/Business Class amenity kit\n\n• A pair of Bose QuietComfort Acoustic Noise Canceling Headsets to use during flight\n\n• Premium alcoholic beverages and wine selections (including pre-departure beverage service)\n\n• Chef-inspired dining options\n\nDomestic First Class\n\nFirst Class is offered on all domestic mainline aircraft, as well as regional aircraft with more than 50 seats. When such aircraft are used on flights to international destinations including Canada, Mexico, Central America, and the Caribbean, the First Class cabin is branded as Business Class. Seats range from 19–21 inches (48–53 cm) in width and have 37–42 inches (94–106 cm) of pitch. Dining options include free snacks, beverages, and alcohol on all flights, with three-course meals offered on flights 900 miles (1,448 km) or longer (select routes under 900 miles offer meal service).\n\nPremium Economy\n\nOn December 9, 2015, American announced a new Premium Economy product for most long-haul widebody aircraft. This new product will debut on the new 787-9s in late 2016 and will be available on the new A350s in 2018. It will also be retrofitted to all other widebody aircraft within the next three years, excluding 767s due to their upcoming retirement. The seats will be wider than standard Main Cabin seats and will offer 38\" of pitch, 2\" more than Main Cabin Extra seats, as well as a footrest. Premium Economy customers will also get two free checked bags, priority boarding, and enhanced food and drink service including free alcohol. This product will make American Airlines the first U.S. carrier to offer a four-cabin aircraft.\n\nMain Cabin Extra\n\nAmerican's economy plus product (not to be confused with premium economy), Main Cabin Extra, is available on most of the mainline fleet and American Eagle regional aircraft with more than 50 seats. Exceptions include a majority of former US Airways aircraft (as of May 2014), US Airways Express regional aircraft, and a handful of 777-200ERs that have yet to be retrofitted. Seats range from 17.2–19.5 inches (44–47 cm) in width and have 34–38 inches (86–97 cm) of pitch, which is 5–6 more inches of pitch offered in regular economy seating. American will retain Main Cabin Extra when the new Premium Economy product enters service in late 2016.\n\nMain Cabin\n\nMain Cabin is American's economy product, and is found on all mainline and regional aircraft in its fleet. Seats range from 17–18.5 inches (43–47 cm) in width and have 30–32 inches (76–81 cm) of pitch. Newer aircraft, including all Boeing 777-300ER, refurbished Boeing 777-200ER's, all Boeing 787 Dreamliners, all Airbus A330s, all newly delivered Airbus A319s and most newly delivered Airbus A321s, include seatback TVs, featuring AVOD in each seat. However, American Airlines have decided not to add seatback TVs for the 100 Boeing 737 MAX 8 aircraft that have been ordered\n\nBasic Economy\n\nAmerican's basic economy product, Basic Economy, is available on select routes. It is American's lowest main cabin fare. Basic economy is located in main cabin, but comes with restrictions. These restrictions include assigned seat at check in, no access to overhead bins, no upgrades or refunds, and boarding in the last group.\n\nAmerican Airlines marketed increased legroom in economy class as \"More Room Throughout Coach\", also referred to as \"MRTC\" starting in February 2000. Two rows of economy class seats were removed on Boeing 737 and McDonnell Douglas MD-80 aircraft. Amid financial losses, this scheme was discontinued in 2004.\n\nIn May 2017, American announced they would be adding more seats to some of its Boeing 737 Max jetliners and reducing overall legroom in the basic economy class. The last three rows will lose two inches; going from the current 31 to 29 inches. The remainder of the economy cabin will have 30 inches of legroom. This compares to JetBlue with 34 inches of legroom and Spirit with 28 inches.\n\nAAdvantage\n\nAAdvantage is the frequent flyer program for American Airlines. It was launched on May 1, 1981, and it remains the largest frequent flyer program with over 67 million members as of 2011.\n\nLounges\n\nAdmirals Club\n\nThe Admirals Club was conceived by AA president C.R. Smith as a marketing promotion shortly after he was made an honorary Texas Ranger. Inspired by the Kentucky colonels and other honorary organizations, Smith decided to make particularly valued passengers \"admirals\" of the \"Flagship fleet\" (AA called its aircraft \"Flagships\" at the time). The list of Admirals included many celebrities, politicians, and other VIPs, as well as more \"ordinary\" customers who had been particularly loyal to the airline.\n\nThere was no physical Admirals Club until shortly after the opening of LaGuardia Airport. During the airport's construction, New York Mayor Fiorello LaGuardia had an upper-level lounge set aside for press conferences and business meetings. At one such press conference, he noted that the entire terminal was being offered for lease to airline tenants; after a reporter asked whether the lounge would be leased as well, LaGuardia replied that it would, and a vice president of AA immediately offered to lease the premises. The airline then procured a liquor license and began operating the lounge as the \"Admirals Club\" in 1939.\n\nThe second Admirals Club opened at Washington National Airport. Because it was illegal to sell alcohol in Virginia at the time, the club contained refrigerators for the use of its members, so they could store their own liquor at the airport. For many years, membership in the Admirals Club (and most other airline lounges) was by the airline's invitation. After a passenger sued for discrimination, the Club (and most other airline lounges) switched to a paid membership program.\n\nFlagship Lounge\n\nThough affiliated with the Admirals Club and staffed by many of the same employees, the Flagship Lounge is a separate lounge specifically designed for customers flying in First Class on international flights and transcontinental domestic flights, as well as AAdvantage Executive Platinum and Oneworld Emerald frequent flyers. As of January 2018, Flagship Lounges are located at four airports: Chicago-O'Hare, Miami International, Los Angeles and New York-JFK.\n\nAccidents and incidents\n\nAs of January 2018, the airline has had almost sixty aircraft hull losses due to all causes since the crash of an American Airways Ford 5-AT-C Trimotor in August 1931. Of these most were propeller driven aircraft, including three Lockheed L-188 Electra turboprop aircraft (of which one, the crash in 1959 of Flight 320, resulted in fatalities). Seventeen jet aircraft have been written off due to crashes – including Flight 587 in 2001, Flight 965 in 1995, Flight 191 in 1979, Flight 1 in 1962 and two aircraft destroyed in the September 11 attacks – and other accidents (such as the Flight 383 engine failure and fire in 2016); two of these were training flights in which only the crew were killed and six resulted in no fatalities. Another four jet aircraft have been written off due to incidents while they were parked between flights or while undergoing maintenance.\n\nIn popular culture\n\n* In the 1960s, Mattel released a series of American Airlines Stewardess Barbie dolls.\n* Throughout the 1990s, American Airlines was featured in John Hughes' Home Alone trilogy of movies.\n* In August 2008, in a Season 2 episode of Mad Men (Episode 2, titled \"Flight 1\"), Pete Campbell's father is a passenger on American Airlines Flight 1 which crashes shortly after takeoff from Idlewild Airport (now John F. Kennedy International Airport), killing all the passengers and crew on board.\n* American Airlines was a sponsor of a travelogue segment of the Univision show Sábado Gigante titled La Cámara Viajera.\n* American Airlines was extensively featured in the 2009 movie Up in the Air as part of a marketing tie-in between the airline and Paramount Pictures.\n* In 2013, American Airlines collaborated with Disney to promote Planes by featuring a cameo appearance of a passenger airliner named Tripp, with the American Airlines livery to promote its new image.[http://www.toonbarn.com/toonbarn-tv/disney-collaborates-american-airlines-planes/ Disney Collaborates With American Airlines for PLANES]. Toonbarn.com (July 1, 2013). Retrieved on July 1, 2013.\n* Airport 1975 used a Boeing 747-123 Freighter (cargo variant) s/n 20390 (registration N9675), leased from American Airlines.Santoir, Christian. [http://www.aeromovies.fr/articles.php?lngen&pg\n258 \"Airport 75.\"] Aeromovies. Retrieved: December 27, 2015.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "American Airlines" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2386" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "American Airlines, Inc. (AA) is a major U.S. airline headquartered in Fort Worth, Texas, within the Dallas-Fort Worth metroplex. It is the world's largest airline when measured by fleet size, revenue, scheduled passenger-kilometers flown, and number of destinations served. American together with its regional partners operates an extensive international and domestic network with an average of nearly 6,700 flights per day to nearly 350 destinations in more than 50 countries.\n\nAmerican Airlines is a founding member of Oneworld alliance, the third largest airline alliance in the world and coordinates fares, services, and scheduling with alliance partners British Airways, Iberia, and Finnair in the transatlantic market and with Cathay Pacific and Japan Airlines in the transpacific market. Regional service is operated by independent and subsidiary carriers under the brand name of American Eagle.\n\nAmerican operates out of ten hubs located in Dallas/Fort Worth, Charlotte, Chicago–O'Hare, Philadelphia, Miami, Phoenix–Sky Harbor, Washington–National, Los Angeles, New York–JFK, and New York–LaGuardia. American operates its primary maintenance base at Tulsa International Airport in addition to the maintenance locations located at its hubs. Dallas/Fort Worth International Airport is American Airlines’ largest passenger carrying hub, handling 51.1 million passengers annually with an average of 140,000 passengers daily. The company as of 2015 employs over 113,300 people. Through the airline's parent company, American Airlines Group, it is publicly traded under NASDAQ: AAL with a market capitalization of about $25 billion as of 2017.\n\nHistory \n\nAmerican Airlines was started in 1930 via a union of more than eighty small airlines.\n\nThe two organizations from which American Airlines was originated were Robertson Aircraft Corporation and Colonial Air Transport.  The former was first formed in Missouri in 1921, with both being merged in 1929 into holding company The Aviation Corporation.  This in turn, was made in 1930 into an operating company and rebranded as American Airways.  In 1934, when new laws and attrition of mail contracts forced many airlines to reorganize, the corporation redid its routes into a connected system, and was renamed American Airlines.  Between 1970 and 2000, the company grew into being an international carrier, purchasing Trans World Airlines in 2001.\n\nIn 2011, due to a downturn in the airline industry, American Airlines' parent company AMR Corporation filed for bankruptcy protection.  In 2013, US Airways purchased American Airlines but kept the American Airlines name, as it was the better recognized brand internationally; the combination of the two airlines resulted in the creation of the largest airline in the United States, and ultimately the world.https://www.britannica.com/topic/American-Airlines\n\nCorporate affairs\n\nHeadquarters\n\nAmerican Airlines is headquartered in Fort Worth, Texas, adjacent to the Dallas/Fort Worth International Airport.\"[https://www.aa.com/i18n/aboutUs/corporateInformation/facts/structure.jsp Corporate Structure].\" American Airlines. Retrieved 18 May 2009. The headquarters is located in two office buildings in the CentrePort office complex and these buildings together have about 1400000 sqft of space.  over 4,300 employees work at this complex.\"[http://www.aa.com/i18n/amrcorp/corporateInformation/facts/americanairlinesgroup.jsp American Airlines Group Overview] [https://www.webcitation.org/6P4lfN3BM?urlhttp://www.aa.com/i18n/amrcorp/corporateInformation/facts/americanairlinesgroup.jsp Archived copy] at WebCite (April 24, 2014).\" ([https://www.webcitation.org/6P4lfN3BM?url\nhttp://www.aa.com/i18n/amrcorp/corporateInformation/facts/americanairlinesgroup.jsp Archive]). American Airlines. Retrieved on April 24, 2014.\n\nBefore it was headquartered in Texas, American Airlines was headquartered at 633 Third Avenue in the Murray Hill area of Midtown Manhattan, New York City.World Airline Directory. Flight International. March 20, 1975. \"[http://www.flightglobal.com/pdfarchive/view/1975/1975%20-%200536.html 472].\"[http://gonyc.about.com/od/manhattan/l/bl_gramercy.htm Flatiron / Gramercy / Murray Hill / Union Square: Manhattan Neighborhood Map].\" About.com. Retrieved 25 January 2009. In 1979, American moved its headquarters to a site at Dallas/Fort Worth International Airport, which affected up to 1,300 jobs. Mayor of New York City Ed Koch described the move as a \"betrayal\" of New York City.Sterba, James P. \"[https://select.nytimes.com/gst/abstract.html?resF50F15FE3C5511728DDDAF0994D9415B888BF1D3 American Will Shift Headquarters From Manhattan to Dallas Airport; Big Economies Predicted].\" The New York Times. Thursday November 16, 1978. Page A1. Retrieved 27 August 2009. American moved to two leased office buildings in Grand Prairie, Texas.\"[https://news.google.com/newspapers?id9ZYTAAAAIBAJ&sjid\n5gUEAAAAIBAJ&pg3054,25513&dq\namerican-airlines+new+headquarters American Airlines Finishes Moving into Headquarters Monday].\" Associated Press at Ocala Star-Banner. January 16, 1983. 6A. Google News 4 of 62. Retrieved 27 August 2009. On January 17, 1983, the airline finished moving into a $150 million ($ when adjusted for inflation), 550000 sqft facility in Fort Worth; $147 million (about $ when adjusted for inflation) in Dallas/Fort Worth International Airport bonds financed the headquarters. The airline began leasing the facility from the airport, which owns the facility.\n\nAs of 2015 American Airlines is the corporation with the largest presence in Fort Worth.Brown, Steve. \"[http://www.dallasnews.com/business/airline-industry/20151022-american-airlines-will-build-new-headquarters-in-fort-worth1.ece American Airlines will build new headquarters in Fort Worth]\" ([https://www.webcitation.org/6cZgNBsFZ?url\nhttp://www.dallasnews.com/business/airline-industry/20151022-american-airlines-will-build-new-headquarters-in-fort-worth1.ece Archive]). The Dallas Morning News. October 22, 2015. Retrieved on October 27, 2015. \"Robert Sturns, Fort Worth's economic development director, said the city was committed to keeping its largest corporate citizen.\"\n\nNew headquarters\n\nIn 2015, the airline announced it will build a new headquarters in Fort Worth. Groundbreaking began in the spring of 2016 and occupancy is scheduled for summer 2019.Owens, Marjorie, Jason Whitely, and Jim Douglas. \"[http://www.wfaa.com/story/news/2015/10/22/american-to-build-new-headquarters-in-fort-worth/74395434/ American to build new headquarters in Fort Worth]\" ([https://www.webcitation.org/6cWE7iPZM?url\nhttp://www.wfaa.com/story/news/2015/10/22/american-to-build-new-headquarters-in-fort-worth/74395434/ Archive]). WFAA. October 22, 2015. Retrieved on October 24, 2015. The airline plans to house 5,000 new workers in the building.\n\nIt will be located on a 41 acre property adjacent to the airline's flight academy and conference and training center, west of Texas State Highway 360, 2 mi west from the current headquarters. The airline will lease a total of 300 acre from Dallas-Fort Worth International Airport and this area will include the headquarters.Construction of the new headquarters began after the demolition of the Sabre facility previously on the site.\n\nThe airline considered developing a new headquarters in Irving, on the Texas Stadium site, before deciding to keep the headquarters in Fort Worth.\n\nU.S. federal government subsidies\n\nAs of November 2013 American Airlines and American Eagle received $10,011,836 in annual federal subsidies for Essential Air Services. These subsidies are awarded by public tender and ensure that small, rural airports can be connected to the national air network.\n\nLabor unions\n\n* The Allied Pilots Association (APA) is an in-house union which represents the nearly 15,000 American Airlines pilots; it was created in 1963 after the pilots left the Air Line Pilots Association (ALPA). The majority of American Eagle pilots are ALPA members.\n* The Association of Professional Flight Attendants (APFA) represents American Airlines flight attendants, including former USAirways flight attendants. \n* Flight Attendants at American wholly owned Regional Carriers (Envoy - former American Eagle), Piedmont and PSA are all represented by [http://www.afacwa.org/ Association of Flight Attendants - Communications Workers of America] (AFA-CWA). USAirways Flight Attendants were active members of AFA-CWA prior to the merger. They are honorary lifetime members. AFA-CWA is the largest Flight Attendant Union in the industry and is operated by Flight Attendants.\n* The Transport Workers Union-International Association of Machinists alliance (TWU-IAM) represents the majority of American Airlines employed fleet service clerks, mechanics and other ground workers.\n* American's customer service and gate employees belong to the Communications Workers of America/International Brotherhood of Teamsters Passenger Service Association.\n\nEnvironmental record\n\nViolations occurring over a 4½ year period—from October 1993 to July 1998—targeted American Airlines for using high-sulfur fuel in motor vehicles at 10 major airports around the country. Under the federal Clean Air Act high sulfur fuel cannot be used in motor vehicles. American Airlines promptly identified and corrected these violations of the Clean Air Act.\n\nAmerican Airlines' wastewater treatment plant recycles water used at the base to wash aircraft, process rinse water tanks, and irrigate landscape. That alone has saved almost $1 million since 2002. In addition to that, American Airlines has also won the award for the reduction of hazardous waste that saved them $229,000 after a $2,000 investment. A bar code system is used to track hazardous waste. It has led to reduction of waste by 50 percent since 2000.\n\nSponsorships\n\nAmerican Airlines is title sponsor of two basketball venues: American Airlines Center (Dallas Mavericks), (Dallas Stars) and American Airlines Arena (Miami Heat).\n\nThe company sponsors several professional sports teams:\n* Carolina Panthers\n* Chicago Cubs\n* Dallas Cowboys\n* Dallas Mavericks\n* New England Patriots\n* New England Revolution\n* Philadelphia Eagles\n\nCorporate identity\n\nLogo\n\nIn 1931, Goodrich Murphy, an American employee, designed the AA logo.  The logo was redesigned by Massimo Vignelli in 1967. Thirty years later, in 1997, American Airlines was able to make its logo Internet-compatible by buying the domain AA.com. AA is also American's two-letter IATA airline designator.\n\nOn January 17, 2013, American launched a new rebranding and marketing campaign with FutureBrand dubbed, \"A New American\". This included a new logo replacing the logo used since 1967. American Airlines calls the new logo the \"Flight Symbol, incorporating the eagle, star, and the letter “A” of the classic logo.  \n\nOn June 3, 2016, American Airlines sought to register their 2013 logo with the United States Copyright Office.  However, in October of that year the Copyright Office ruled that the logo was ineligible for copyright protection, as it did not pass the threshold of originality. American submitted multiple requests for the Copyright Office to reconsider their determination. However, on January 8, 2018, the Copyright Office made a final decision that affirmed its initial determination that American's new logo was ineligible for copyright protection and is thus in the public domain.\n\nLivery\n\nAmerican's early liveries varied widely, but a common livery was adopted in the 1930s, featuring an eagle painted on the fuselage.   The eagle became a symbol of the company and inspired the name of American Eagle Airlines. Propeller aircraft featured an international orange lightning bolt running down the length of the fuselage, which was replaced by a simpler orange stripe with the introduction of jets.\n\nIn the late 1960s, American commissioned designer Massimo Vignelli to develop a new livery. The original design called for a red, white, and blue stripe on the fuselage, and a simple \"AA\" logo, without an eagle, on the tail; instead, Vignelli created a highly stylized eagle, which remained the company's logo until 2013. In 1999, American painted a new Boeing 757 (N679AN) in its 1959 international orange livery. One Boeing 777 and one Boeing 757 were painted in standard livery with a pink ribbon on the sides and on the tail, in support of Susan G. Komen for the Cure. One Boeing 757 is painted with a yellow ribbon on the tailfin on the aircraft and on the side of the body says \"Flagship Freedom\". American Eagle, the airline's regional airline has the same special livery on ERJ-145 aircraft.\n\nOn January 17, 2013, American unveiled a new livery. Before then, American had been the only major U.S. airline to leave most of its aircraft surfaces unpainted. This was because C. R. Smith hated painted aircraft, and refused to use any liveries that involved painting the entire plane. Robert \"Bob\" Crandall later justified the distinctive natural metal finish by noting that less paint reduced the aircraft's weight, thus saving on fuel costs.\n\nIn January 2013, American launched a new rebranding and marketing campaign dubbed, \"The New American\". In addition to a new logo, American Airlines introduced a new livery for its fleet. The airline calls the new livery and branding \"a clean and modern update\". The current design features an abstract American flag on the tail, along with a silver-painted fuselage, as a throw-back to the old livery. The new design was painted by Leading Edge Aviation Services in California. Doug Parker, the incoming CEO indicated that the new livery could be short-lived, stating that \"maybe we need to do something slightly different than that ... The only reason this is an issue now is because they just did it right in the middle, which kind of makes it confusing, so that gives us an opportunity, actually, to decide if we are going to do something different because we have so many airplanes to paint\".King, Eric. (2013-03-28) [http://www.nbcdfw.com/news/business/American-Airlines-New-Livery-Soon-Could-Become-Its-Old-Look-200532901.html American Airline's New Livery Soon Could Become Its Old Look | NBC 5 Dallas-Fort Worth]. Nbcdfw.com. Retrieved on 2013-07-18.\n\nIn the end, American let its employees decide the new livery's fate. On an internal website for employees, American posted two options, one the new livery and one a modified version of the old livery. All of the American Airlines Group employees (including US Airways and other affiliates) were able to vote.   American ultimately decided to keep the new look. Parker announced that American would keep a US Airways heritage aircraft in the fleet, with plans to add a heritage TWA aircraft and a heritage American plane with the old livery.  \n\nSlogans\n\n* Current: \"The World's Greatest Flyers Fly American\" \n* 2015-2016: \"Going for great.\"\n* 2013–2014: AA/US merger (With the introduction of new logo and branding in 2013.) – \"The new American is arriving.\" (Spanish: \"El nuevo American está llegando.\")\n* 2011–13: – \"Be yourself. Nonstop.\"\n* 2000s–13: – \"We know why you fly.\" (Spanish: \"Sabemos por qué vuelas\")\n* AA/TWA merger – \"Two great airlines, one great future.\"\n* 2001 (post-9/11) – \"We are an airline that is proud to bear the name: American.\"\n* 1998 – early 2000s - \"New York's Bridge To The World\" (Used for marketing in the New York metropolitan area.)\n* Early – mid-1990s – \"We Mean Business In Chicago.\" (Used for marketing in the Chicago market.)\n* 1988 – mid-1990s – \"Based Here. Best Here.\" (Used for marketing in the Dallas/Fort Worth Metroplex.)\n* 1988 – \"The On-Time Machine.\"\n* Late 1980s – \"No other Airline gives you more of America, than American.\"\n* 1984–2000 – \"Something special in the air.\" (Several variants of this slogan existed. Variant used on the website: \"Something special online.\", Spanish variant: \"Todo es especial, tú eres especial.\", Variant used to market European routes: \"Something special to Europe.\" Variant used with the previous tune: \"We're American Airlines. Something special in the air.\")\n* 1982 – late 1980s – \"En American, tenemos lo que tú buscas.\" (Spanish slogan, translated to \"At American, we've got what you're looking for\").\n* 1975 – 1984 – \"We're American Airlines. Doing what we do best.\" (The tune used for the campaign would be retained for several years with the \"Something special in the air\" slogan).\n* 1971 – 1975 – \"Our passengers get the best of everything.\" (also known as \"You get the best of everything.\")\n* 1969 – 1971 – \"It's good to know you're on American Airlines.\"\n* 1967 – 1969 – \"Fly the American Way.\", resurrected in 2017\n* 1964 – 1967 – \"American built an airline for professional travelers.\" (also known as \"You'll love it.\")\n* 1950s – 1964 – \"America's Leading Airline.\"\n\nHubs\n\nCurrent hubs\n\nAmerican currently operates ten hubs across the continental U.S.\n* Dallas/Fort Worth International Airport – American's primary hub, and its largest hub in terms of daily flights and number of destinations and American's primary hub for the South. American currently has about 85% of the market share and flies approximately 56 million passengers through DFW every year, which is about 153,000 people per day making it the busiest airline at the airport. American's corporate headquarters are also in Fort Worth near the airport. Dallas/Fort Worth remains the largest hub for American, in terms of passenger traffic since the American-US Airways merger. DFW serves as American's primary gateway to Mexico, and secondary gateway to Latin America. \n* Charlotte Douglas International Airport – American's second-largest hub in terms of number of destinations and daily flights. It is American's primary hub for the Southeastern United States. About 42 million passengers fly through CLT on American every year, or about 115,000 people per day. As of 2013 American has about 90% of the market share at CLT, making it the airport's largest airline. Charlotte was previously US Airways' largest hub before the American-US Airways merger.\n* O'Hare International Airport – The third-largest hub for American in terms of number of flights and American's primary hub for the Midwest. About 27 million passengers fly on American through O'Hare every year, or about 74,000 people per day. As of 2013 American has about 40% of the market share at O'Hare making it the airport's second-largest airline after United. O'Hare was American's second-largest hub before the American-US Airways merger.\n* Philadelphia International Airport – The fourth-largest hub in terms of number of daily flights and American's primary East Coast hub. American flies approximately 23 million passengers a year through PHL, which is about 63,000 people per day. As of 2013 American has about 70% of the market share at PHL, making it the airport's largest airline. PHL was US Airways' second-largest hub before the American-US Airways merger. Philadelphia is American Airlines' primary European and transatlantic gateway.\n* Miami International Airport – The fifth-largest hub in terms of number of flights. About 30 million passengers fly through MIA every year on American, which is about 82,000 people per day. American has about 70% of the market share at Miami International, making it the largest airline at the airport. Miami was previously American's third-largest hub before the American-US Airways merger. Miami is American's primary South American and Caribbean gateway.\n* Phoenix Sky Harbor International Airport – The sixth-largest hub in terms of number of flights and destinations and American's primary western hub. American flies approximately 23 million passengers a year through PHX, which is about 63,000 people per day. Currently American has about 52.6% of the market share at PHX, making it the airport's largest airline. PHX was previously US Airways' third-largest hub before the American-US Airways merger. Phoenix is American Airlines' only major domestic hub without service to Asia or Europe (service to Europe is currently operated by Oneworld partner British Airways operating a Phoenix to Heathrow flight, however, no transoceanic flights currently exist on AA metal).\n* Ronald Reagan Washington National Airport – The seventh-largest hub for American in terms of number of destinations and flights and American's third hub for the East Coast. The airport also serves as a base for American Airlines Shuttle. About 12 million passengers fly through DCA on American every year, or about 33,000 people per day. American has about 23.7% of the market share at DCA, making it the largest carrier at the airport. DCA was US Airways' fourth-largest hub before the American-US Airways merger.\n* Los Angeles International Airport – The eighth-largest hub in terms of number of destinations and flights and American's hub for the West Coast. About 16.5 million passengers fly through LAX on American every year, or about 45,000 people per day. American has about 23% of the market share at LAX, making it the largest carrier at the airport. LAX was American's fourth-largest hub before the American-US Airways merger. LAX is American Airlines' primary transpacific gateway.\n* John F. Kennedy International Airport – The ninth-largest hub for American in terms of number of destinations and flights and American's secondary East Coast hub. About 9.4 million passengers fly through JFK on American every year, or about 26,000 people per day. American has about 11% of the market share at JFK, making it the third-largest carrier at the airport behind Delta and JetBlue. JFK was American's fifth-largest hub before the American-US Airways merger. JFK is American's secondary European and transatlantic gateway. Since 2017, American has started reducing its international operations at JFK, opting to expand its Philadelphia hub instead.\n* LaGuardia Airport – The tenth-largest hub for American in terms of number of destinations and flights and American's fourth hub for the East Coast. About 7.5 million passengers fly through LGA on American every year, or about 21,000 people per day. The airport also serves as a base for American Airlines Shuttle. American has about 28% of the market share at LGA, and is the second-largest carrier behind Delta.\n\nFormer hubs\n\n* Lambert–St. Louis International Airport – American closed its St. Louis hub in 2009 because of the declining need for a second Midwestern hub. The St. Louis hub was inherited from Trans World Airlines.\n* Luis Muñoz Marín International Airport – American closed its San Juan hub in 2012. American used San Juan as a connection point for Caribbean destinations using ATR-72 commuter aircraft. American has since removed the ATR-72 series aircraft from its regional fleet and closed its hub at San Juan.\n* Nashville International Airport – American saw a decrease in passenger traffic and closed its Nashville hub in the mid-1990s to cut costs.\n* Raleigh–Durham International Airport – American closed its Raleigh-Durham hub in the mid-1990s after it was deemed not profitable.\n* San Jose International Airport – American closed its San Jose hub in the early 2000s. The hub was begun on December 2, 1988 with planned growth to 1991, soon after American acquired Air Cal and was seeking a Northern California hub either in San Jose or San Francisco.  The San Jose hub was inherited with the acquisition of Reno Air.  Reno Air had made San Jose a hub in the mid-1990s after American had decided that the competition on the West Coast made the hub unprofitable and closed it.\n\nMaintenance bases\n\n* Dallas/Fort Worth International Airport - Primary base for Airbus A319, and A321 aircraft, Boeing 777 and 787 aircraft, secondary base for Boeing 737, 757, 767, and McDonnell Douglas MD-80 aircraft.\n* LaGuardia Airport - American operates a small maintenance base for Boeing 737 and ERJ-145 aircraft.\n* Pittsburgh International Airport - Primary base for all legacy US Airways Airbus aircraft.\n* Tulsa International Airport - Primary base for all of American's Boeing fleet (with the exception of the 777 and 787), as well as American Eagle aircraft.\n\nDestinations\n\nAmerican operated interchange flight services in conjunction with Alaska Airlines during the 1970s between Texas and Alaska during the construction of the Trans-Alaska oil pipeline. This interchange agreement allowed for single, no change of aircraft service between Houston, Texas and Dallas/Fort Worth, Texas, and Anchorage, Alaska and Fairbanks, Alaska. The round trip routing of this interchange flight was Houston-Dallas/Fort Worth-Seattle-Anchorage-Fairbanks with Seattle, Washington serving as the interchange point where flight and cabin crews were changed from one airline to the other. Boeing 727-200 jetliners provided by both American and Alaska Airlines were utilized to provide this interchange service.\n\nAmerican Airlines is the only US carrier that flies to Barranquilla, Belo Horizonte, Brasilia, Cali, Cap-Haitien, Caracas, Fort-de-France, Guayaquil, La Paz, Manaus, Maracaibo, Montevideo, Pointe-a-Pitre, San Salvador (Bahamas), Santa Cruz de la Sierra and Varadero. It is also the leading U.S. carrier to Cuba in terms of passenger volume.\n\nCodeshare agreements\n\nAmerican Airlines codeshares with the following airlines:\n\n* Air Tahiti Nui\n* Alaska Airlines\n* British Airways\n* Caribbean Airlines\n* Cape Air\n* Cathay Pacific\n* China Southern Airlines\n* El Al\n* Etihad Airways (ends 25 March 2018)\n* Fiji Airways\n* Finnair\n* Gulf Air (ends 30 April 2018)\n* Hainan Airlines\n* Hawaiian Airlines\n* Iberia\n* Interjet\n* Japan Airlines\n* Jetstar Airways\n* Jetstar Japan\n* Korean Air \n* LATAM Argentina\n* LATAM Brasil\n* LATAM Chile\n* LATAM Ecuador\n* Malaysia Airlines\n* Qantas\n* Qatar Airways (ends 25 March 2018)\n* Royal Jordanian\n* Seaborne Airlines\n* SriLankan Airlines\n* WestJet (ends 31 July 2018)\n\nJoint ventures\n\nIn particular, American has joint ventures with British Airways, Iberia, and Finnair on transatlantic routes and with Japan Airlines, Qantas and Cathay Pacific on transpacific routes.\n\nFleet\n\nAs of October 2017, American Airlines operates a fleet of 947 aircraft, making it the largest commercial fleet in the world. It operates a mix of Airbus, Boeing, Embraer, and McDonnell Douglas aircraft.\n\nOver two thirds of American's aircraft are narrow-bodies, mainly Airbus A320 series and Boeing 737-800. It also operates Boeing 757, Embraer 190 and McDonnell Douglas MD-82/83, but most of them are planned to be phased out within five years.\n\nIts wide-body aircraft are mainly Boeing airliners. It is the third-largest operator of the Boeing 767 series and the fifth-largest operator of the Boeing 777 series. It also operates the Airbus A330.\n\nOn July 20, 2011, American announced an order for 460 narrowbody jets including 260 Airbus A320s.\nThe order broke Boeing's monopoly with the airline and forced Boeing into the re-engined 737 MAX.\nAs this sale included a Most-Favoured-Customer Clause, the European airframer has to refund any difference to American if it sells to another airline at a lower price, so Airbus can't give a competitive price to competitor United Airlines, leaving it to a Boeing-skewed fleet.\n\nCabin\n\nFlagship First\n\nFlagship First is American's international first class product. It is exclusively offered on all Boeing 777-300ERs in the fleet. \n\n• Boeing 777-300ER: Fully lie-flat seats with direct aisle access in a 1-2-1 reverse herringbone configuration. Seat length: 82 inches (208 cm). Equipped with a 17-inch (43 cm) touchscreen monitor and touchscreen handset, two universal AC power outlets, and USB ports.\n\nAmenities Include:\n\n• Flagship check-in privileges\n\n• 3 complimentary checked bags\n\n• Access to the Flagship Lounge (International First Class Lounge while the Flagship Lounges are being refurbished)\n\n• Early boarding\n\n• First Class amenity kit\n\n• Turndown service with pajamas\n\n• A pair of Bose QuietComfort Acoustic Noise Canceling Headsets to use during flight\n\n• Inflight wine tasting\n\n• Premium alcoholic beverages and wine selections (including pre-departure champagne service)\n\n• Chef-inspired dining options\n\n• Access to the premium cabin walk-up bar, which features assorted snacks and beverages throughout the duration of the flight.\n\nFlagship Business\n\nFlagship Business is offered on some Boeing 757-200s and all Airbus A330-200s, Airbus A330-300s, Boeing 767-300ERs, Boeing 777-200ERs, Boeing 777-300ERs, Boeing 787-8s, and Boeing 787-9s.\n• Airbus A330: Fully lie-flat Cirrus seats manufactured by Zodiac Seats France and designed by JPA Design for US Airways with direct aisle access in a 1-2-1 reverse herringbone configuration. Seat length: 76-80 inches (193–203 cm). Equipped with a 12.1 inch (31 cm) touchscreen monitor, one universal AC power outlet, and USB ports.[1]\n\n• Boeing 757-200 International: Fully lie-flat Diamond seats manufactured by B/E Aerospace and designed for American Airlines in a 2-2 configuration. Seat length: 75–78 inches (191–198cm). Equipped with Samsung Galaxy Tab™ 10.1 inch (26 cm) tablets, and two universal AC power outlets (one to power the tablet).\n\n• Boeing 767-300ER: Fully lie-flat seats manufactured by Thompson Aero Seating with direct aisle access in a 1-2-1 staggered configuration. Equipped with Samsung Galaxy Tab™ 10.1 inch (26 cm) tablets, two universal AC power outlets (one to power the tablet), and USB ports.\n\n• Boeing 777-200ER Version 1: Fully lie-flat seats manufactured by Zodiac Seats France, designed for American Airlines, with direct aisle access in a 1-2-1 reverse herringbone configuration with front-facing and rear-facing seats. Seat length: 77 inches (196cm). Equipped with a 16-inch (41 cm) touchscreen monitor and touchscreen handset, two universal AC power outlets, and USB ports.\n\n• Boeing 777-200ER Version 2: Fully lie-flat Super Diamond seats manufactured by B/E Aerospace and designed for American Airlines with direct aisle access in a 1-2-1 reverse herringbone configuration. Seat length: 77 inches (196cm). Equipped with a UNKNOWN-inch (UNKNOWN cm) touchscreen monitor and touchscreen handset, one universal AC power outlet, and USB ports.\n\n• Boeing 777-300ER: Fully lie-flat Cirrus seats manufactured by Zodiac Seats UK, designed by JPA Design for Cathay Pacific, and licensed from Cathay Pacific with direct aisle access in a 1-2-1 reverse herringbone configuration. Seat length: 76-80 inches (193–203 cm). Equipped with a 15.4-inch(39 cm) inch touchscreen monitor, one universal AC power outlet, and USB ports.[2]\n\n• Boeing 787-8: Fully lie-flat seats manufactured by Zodiac Seats France and designed for American Airlines with direct aisle access in a 1-2-1 reverse herringbone configuration with front-facing and rear-facing seats. Seat length: 77 inches (196cm). Equipped with a 16-inch (41 cm) touchscreen monitor and touchscreen handset, two universal AC power outlets, and USB ports.\n\n• Boeing 787-9: Fully lie-flat Super Diamond seats manufactured by B/E Aerospace and designed for American Airlines with direct aisle access in a 1-2-1 reverse herringbone configuration. Seat length: 77 inches (196cm). Equipped with a UNKNOWN-inch (UNKNOWN cm) touchscreen monitor and touchscreen handset, one universal AC power outlet, and USB ports.\n\nAmenities Include:\n\n• Priority check-in privileges\n\n• 2 complimentary checked bags\n\n• Access to the Admirals Club\n\n• Early boarding\n\n• Flagship Business amenity kit\n\n• A pair of Bose QuietComfort Acoustic Noise Canceling Headsets to use during flight\n\n• Premium alcoholic beverages and wine selections (including pre-departure beverage service)\n\n• Chef-inspired dining options\n\n• Access to the premium cabin walk-up bar, which features assorted snacks and beverages throughout the duration of the flight (available on the Boeing 777-300ER, Boeing 777-200, Boeing 787-8, and Boeing 787-9)\n\n• On flights from Los Angeles to Hong Kong and Sydney and Dallas to Hong Kong, turndown service and pajamas are also provided\n\nTranscontinental\n\nAmerican has dedicated 17 Airbus A321s (A321T) in its fleet for the specific use of flying transcontinental routes between New York JFK - Los Angeles LAX and New York JFK - San Francisco SFO. These aircraft offer two premium cabins, Flagship First and Flagship Business, which are unique among domestic mainline aircraft in American's fleet:\n\n• Flagship First: Fully lie-flat seats manufactured by Zodiac Seats France and designed for American Airlines with direct aisle access in a 1-1 reverse herringbone configuration. Seat length: UNKNOWN inches (UNKNOWN cm). Equipped with a 15.4-inch (39 cm) inch touchscreen monitor and touchscreen handset, one universal AC power outlet, and USB ports.\n\n• Flagship Business: Fully lie-flat Diamond seats manufactured by B/E Aerospace and designed for American Airlines in a 2-2 configuration. Seat length: 75–78 inches (191–198cm). Equipped with a 15.4-inch (39 cm) touchscreen monitor and touchscreen handset, one universal AC power outlet, and USB ports.\n\nAmenities Include:\n\n• Priority check-in privileges\n\n• 2/3 (First Class) complimentary checked bags\n\n• Access to the Admirals Club/Flagship Lounge (First Class)\n\n• Early boarding\n\n• First Class/Business Class amenity kit\n\n• A pair of Bose QuietComfort Acoustic Noise Canceling Headsets to use during flight\n\n• Premium alcoholic beverages and wine selections (including pre-departure beverage service)\n\n• Chef-inspired dining options\n\nDomestic First Class\n\nFirst Class is offered on all domestic mainline aircraft, as well as regional aircraft with more than 50 seats. When such aircraft are used on flights to international destinations including Canada, Mexico, Central America, and the Caribbean, the First Class cabin is branded as Business Class. Seats range from 19–21 inches (48–53 cm) in width and have 37–42 inches (94–106 cm) of pitch. Dining options include free snacks, beverages, and alcohol on all flights, with three-course meals offered on flights 900 miles (1,448 km) or longer (select routes under 900 miles offer meal service).\n\nPremium Economy\n\nOn December 9, 2015, American announced a new Premium Economy product for most long-haul widebody aircraft. This new product will debut on the new 787-9s in late 2016 and will be available on the new A350s in 2018. It will also be retrofitted to all other widebody aircraft within the next three years, excluding 767s due to their upcoming retirement. The seats will be wider than standard Main Cabin seats and will offer 38\" of pitch, 2\" more than Main Cabin Extra seats, as well as a footrest. Premium Economy customers will also get two free checked bags, priority boarding, and enhanced food and drink service including free alcohol. This product will make American Airlines the first U.S. carrier to offer a four-cabin aircraft.\n\nMain Cabin Extra\n\nAmerican's economy plus product (not to be confused with premium economy), Main Cabin Extra, is available on most of the mainline fleet and American Eagle regional aircraft with more than 50 seats. Exceptions include a majority of former US Airways aircraft (as of May 2014), US Airways Express regional aircraft, and a handful of 777-200ERs that have yet to be retrofitted. Seats range from 17.2–19.5 inches (44–47 cm) in width and have 34–38 inches (86–97 cm) of pitch, which is 5–6 more inches of pitch offered in regular economy seating. American will retain Main Cabin Extra when the new Premium Economy product enters service in late 2016.\n\nMain Cabin\n\nMain Cabin is American's economy product, and is found on all mainline and regional aircraft in its fleet. Seats range from 17–18.5 inches (43–47 cm) in width and have 30–32 inches (76–81 cm) of pitch. Newer aircraft, including all Boeing 777-300ER, refurbished Boeing 777-200ER's, all Boeing 787 Dreamliners, all Airbus A330s, all newly delivered Airbus A319s and most newly delivered Airbus A321s, include seatback TVs, featuring AVOD in each seat. However, American Airlines have decided not to add seatback TVs for the 100 Boeing 737 MAX 8 aircraft that have been ordered\n\nBasic Economy\n\nAmerican's basic economy product, Basic Economy, is available on select routes. It is American's lowest main cabin fare. Basic economy is located in main cabin, but comes with restrictions. These restrictions include assigned seat at check in, no access to overhead bins, no upgrades or refunds, and boarding in the last group.\n\nAmerican Airlines marketed increased legroom in economy class as \"More Room Throughout Coach\", also referred to as \"MRTC\" starting in February 2000. Two rows of economy class seats were removed on Boeing 737 and McDonnell Douglas MD-80 aircraft. Amid financial losses, this scheme was discontinued in 2004.\n\nIn May 2017, American announced they would be adding more seats to some of its Boeing 737 Max jetliners and reducing overall legroom in the basic economy class. The last three rows will lose two inches; going from the current 31 to 29 inches. The remainder of the economy cabin will have 30 inches of legroom. This compares to JetBlue with 34 inches of legroom and Spirit with 28 inches.\n\nAAdvantage\n\nAAdvantage is the frequent flyer program for American Airlines. It was launched on May 1, 1981, and it remains the largest frequent flyer program with over 67 million members as of 2011.\n\nLounges\n\nAdmirals Club\n\nThe Admirals Club was conceived by AA president C.R. Smith as a marketing promotion shortly after he was made an honorary Texas Ranger. Inspired by the Kentucky colonels and other honorary organizations, Smith decided to make particularly valued passengers \"admirals\" of the \"Flagship fleet\" (AA called its aircraft \"Flagships\" at the time). The list of Admirals included many celebrities, politicians, and other VIPs, as well as more \"ordinary\" customers who had been particularly loyal to the airline.\n\nThere was no physical Admirals Club until shortly after the opening of LaGuardia Airport. During the airport's construction, New York Mayor Fiorello LaGuardia had an upper-level lounge set aside for press conferences and business meetings. At one such press conference, he noted that the entire terminal was being offered for lease to airline tenants; after a reporter asked whether the lounge would be leased as well, LaGuardia replied that it would, and a vice president of AA immediately offered to lease the premises. The airline then procured a liquor license and began operating the lounge as the \"Admirals Club\" in 1939.\n\nThe second Admirals Club opened at Washington National Airport. Because it was illegal to sell alcohol in Virginia at the time, the club contained refrigerators for the use of its members, so they could store their own liquor at the airport. For many years, membership in the Admirals Club (and most other airline lounges) was by the airline's invitation. After a passenger sued for discrimination, the Club (and most other airline lounges) switched to a paid membership program.\n\nFlagship Lounge\n\nThough affiliated with the Admirals Club and staffed by many of the same employees, the Flagship Lounge is a separate lounge specifically designed for customers flying in First Class on international flights and transcontinental domestic flights, as well as AAdvantage Executive Platinum and Oneworld Emerald frequent flyers. As of January 2018, Flagship Lounges are located at four airports: Chicago-O'Hare, Miami International, Los Angeles and New York-JFK.\n\nAccidents and incidents\n\nAs of January 2018, the airline has had almost sixty aircraft hull losses due to all causes since the crash of an American Airways Ford 5-AT-C Trimotor in August 1931. Of these most were propeller driven aircraft, including three Lockheed L-188 Electra turboprop aircraft (of which one, the crash in 1959 of Flight 320, resulted in fatalities). Seventeen jet aircraft have been written off due to crashes – including Flight 587 in 2001, Flight 965 in 1995, Flight 191 in 1979, Flight 1 in 1962 and two aircraft destroyed in the September 11 attacks – and other accidents (such as the Flight 383 engine failure and fire in 2016); two of these were training flights in which only the crew were killed and six resulted in no fatalities. Another four jet aircraft have been written off due to incidents while they were parked between flights or while undergoing maintenance.\n\nIn popular culture\n\n* In the 1960s, Mattel released a series of American Airlines Stewardess Barbie dolls.\n* Throughout the 1990s, American Airlines was featured in John Hughes' Home Alone trilogy of movies.\n* In August 2008, in a Season 2 episode of Mad Men (Episode 2, titled \"Flight 1\"), Pete Campbell's father is a passenger on American Airlines Flight 1 which crashes shortly after takeoff from Idlewild Airport (now John F. Kennedy International Airport), killing all the passengers and crew on board.\n* American Airlines was a sponsor of a travelogue segment of the Univision show Sábado Gigante titled La Cámara Viajera.\n* American Airlines was extensively featured in the 2009 movie Up in the Air as part of a marketing tie-in between the airline and Paramount Pictures.\n* In 2013, American Airlines collaborated with Disney to promote Planes by featuring a cameo appearance of a passenger airliner named Tripp, with the American Airlines livery to promote its new image.[http://www.toonbarn.com/toonbarn-tv/disney-collaborates-american-airlines-planes/ Disney Collaborates With American Airlines for PLANES]. Toonbarn.com (July 1, 2013). Retrieved on July 1, 2013.\n* Airport 1975 used a Boeing 747-123 Freighter (cargo variant) s/n 20390 (registration N9675), leased from American Airlines.Santoir, Christian. [http://www.aeromovies.fr/articles.php?lngen&pg\n258 \"Airport 75.\"] Aeromovies. Retrieved: December 27, 2015. American Airlines. http://en.wikipedia.org/?curid=2386."
  }
}
