{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15641",
  "eid" : "1dd22dd0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778559277,
  "textBody" : "Joseph Vissarionovich Stalin (18 December 1878 – 5 March 1953) was a Soviet revolutionary and politician of Georgian ethnicity. Governing the Soviet Union as its dictator from the mid-1920s until his death in 1953, he served as General Secretary of the Central Committee of the Communist Party of the Soviet Union from 1922 to 1952 and as Premier of the Soviet Union from 1941 to 1953. Ideologically a Marxist and a Leninist, Stalin helped to formalise these ideas as Marxism–Leninism while his own policies became known as Stalinism.\n\nRaised into a poor family in Gori, Russian Empire, as a youth Stalin joined the Marxist Russian Social Democratic Labour Party. He edited the party newspaper Pravda and raised funds for Vladimir Lenin's Bolshevik faction via robberies, kidnappings, and protection rackets. Repeatedly arrested, he underwent several internal exiles. After the Bolsheviks gained power in the October Revolution of 1917 and established the Russian Soviet Republic, Stalin sat on the governing Politburo during the Russian Civil War and helped form the Soviet Union in 1922. Despite Lenin's opposition, Stalin consolidated power following the former's death in 1924. During Stalin's tenure, \"Socialism in One Country\" became a central concept in Soviet society, and Lenin's New Economic Policy was replaced with a centralised command economy, industrialisation and collectivisation. These rapidly transformed the country into an industrial power, but disrupted food production and contributed to the famine of 1932–33, particularly affecting Ukraine. To eradicate those regarded as \"enemies of the working class\", from 1934 to 1939 Stalin organised the \"Great Purge\" in which hundreds of thousands—including senior political and military figures—were interned in prison camps, exiled, or executed.\n\nStalin's government promoted Marxism–Leninism abroad through the Communist International and supported anti-fascist movements throughout Europe during the 1930s, particularly in the Spanish Civil War. However, in 1939 they signed a non-aggression pact with Nazi Germany, resulting in their joint invasion of Poland. Germany ended the pact by invading the Soviet Union in 1941. Despite initial setbacks, the Soviet Red Army halted the German incursion and captured Berlin in May 1945, ending World War II in Europe. The Soviets annexed the Baltic states and helped establish pro-Soviet Marxist–Leninist governments throughout Eastern Europe. The Soviet Union and the United States emerged as the two world superpowers, and a period of tensions began between the Soviet-backed Eastern Bloc and U.S.-backed Western Bloc known as the Cold War. Stalin led his country through its post-war reconstruction, during which it developed a nuclear weapon in 1949. In these years, the country experienced another major famine and a period of antisemitism, which reached its peak in the 1952–1953 Doctors' plot. Stalin died in 1953 and was succeeded by Nikita Khrushchev, who denounced his predecessor and initiated a de-Stalinisation process throughout Soviet society.\n\nWidely considered one of the 20th century's most significant figures, Stalin was the subject of a pervasive personality cult within the international Marxist–Leninist movement, for whom Stalin was a champion of socialism and the working class. Since the fall of the Soviet Union, Stalin has retained popularity in Russia and Georgia as a victorious wartime leader who established the Soviet Union as a major world power. Conversely, his autocratic government has been widely condemned and vilified for overseeing mass repressions, hundreds of thousands of executions and millions of non-combatant deaths through his policies.\n\nEarly life\n\nChildhood: 1878–1899\n\nStalin was born Ioseb Jughashvili in Gori on . He was the son of Besarion \"Beso\" Jughashvili and Ekaterina \"Keke\" Geladze, who had married in May 1872, and had lost two sons in infancy prior to Stalin's birth. They were ethnically Georgian and Stalin grew up speaking the Georgian language. Gori was then part of the Russian Empire, and was home to a population of 20,000, the majority of whom were Georgian but with Armenian, Russian, and Jewish minorities. Stalin was baptised on 17 December. He earned the childhood nickname of \"Soso\", a diminutive of Iosif (Joseph). Beso was a cobbler and in the early years of their marriage, the couple prospered. However, he did not adapt to changing footwear fashions and his business began to fail. The family soon found themselves living in poverty, moving through nine different rented rooms in ten years. Given this situation, the historian Robert Conquest later suggested that Stalin's class background was \"uncertain and indeterminate\".\n\nBeso was also an alcoholic, and drunkenly beat his wife and son. To escape the abusive relationship, Keke took Stalin and moved into the house of a family friend, Father Christopher Charkviani. She worked as a house cleaner and launderer for several local families who were sympathetic to her plight. Keke was determined to send her son to school, something that none of the family had previously achieved. In late 1888, aged 10 he enrolled at the Gori Church School. This was normally reserved for the children of clergy, although Charkviani ensured that Stalin received a place. Stalin excelled academically, displaying talent in painting and drama classes, writing his own poetry, and singing as a choirboy. He got into many fights, and a childhood friend later noted that Stalin \"was the best but also the naughtiest pupil\" in the class. Stalin faced several severe health problems; in 1884, he contracted smallpox and was left with facial pock scars. Aged 12, he was seriously injured after being hit by a phaeton, resulting in a lifelong disability to his left arm.\n\nAt his teachers' recommendation, Stalin proceeded to the Spiritual Seminary in Tiflis. He enrolled at the school in August 1894, enabled by a scholarship that allowed him to study at a reduced rate. Here he joined 600 trainee priests who boarded at the seminary. Stalin was again academically successful and gained high grades. He continued writing poetry; five of his poems were published under the pseudonym of \"Soselo\" in Ilia Chavchavadze's newspaper Iveria (\"Georgia\"). Thematically, they dealt with topics like nature, land, and patriotism. According to Stalin's biographer Simon Sebag Montefiore, they became \"minor Georgian classics\", and were included in various anthologies of Georgian poetry over the coming years. As he grew older, Stalin lost interest in his studies; his grades dropped, and he was repeatedly confined to a cell for his rebellious behaviour. Teachers complained that he declared himself an atheist, chatted in class and refused to doff his hat to monks.\n\nStalin had joined a forbidden book club active at the school; he was particularly influenced by Nikolay Chernyshevsky's 1863 pro-revolutionary novel What Is To Be Done?. Another influential text was Alexander Kazbegi's The Patricide, with Stalin adopting the nickname \"Koba\" from that of the book's bandit protagonist. He also read Capital, the 1867 book by German sociological theorist Karl Marx. Stalin devoted himself to Marx's socio-political theory, Marxism, which was then on the rise in Georgia, one of various forms of socialism opposed to the governing Tsarist authorities. At night, he attended secret workers' meetings, and was introduced to Silibistro \"Silva\" Jibladze, the Marxist founder of Mesame Dasi ('Third Group'), a Georgian socialist group. In April 1899, Stalin left the seminary and never returned, although the school encouraged him to come back.\n\nRussian Social-Democratic Labour Party: 1899–1904\n\nIn October 1899, Stalin began work as a meteorologist at a Tiflis observatory, a position that allowed him to read while on duty. Stalin gave classes in socialist theory and attracted a group of young men around him. He co-organised a secret mass meeting of workers for May Day 1900, at which he successfully encouraged many of the men to take strike action. By this point, the empire's secret police—the Okhrana—were aware of Stalin's activities within Tiflis' revolutionary milieu. They attempted to arrest him in March 1901, but he escaped and went into hiding, living off the donations of friends and sympathisers. Remaining underground, he helped to plan a demonstration for May Day 1901, in which 3,000 marchers clashed with the authorities. He continued to evade arrest by using aliases and sleeping in different apartments. In November 1901, he was elected to the Tiflis Committee of the Russian Social Democratic Labour Party (RSDLP), a Marxist party founded in 1898.\n\nThat month he travelled to the port city of Batumi. His militant rhetoric proved divisive among the city's Marxists, with some suspecting that he might be an agent provocateur. He found employment at the Rothschild refinery storehouse, where he co-organised two workers' strikes. After several strike leaders were arrested, he co-organised a mass public demonstration that led to the storming of the prison; troops fired upon the demonstrators, 13 of whom were killed. Stalin organised a second mass demonstration on the day of their funeral, before being arrested in April 1902. He was initially held at Batumi Prison, and later moved to the more secure Kutaisi Prison. In mid-1903, Stalin was sentenced to three years of exile in eastern Siberia.\n\nStalin left Batumi in October, arriving at the small Siberian town of Novaya Uda in late November. There, he lived in the two-room house of a local peasant, sleeping in the building's larder. Stalin made several escape attempts; on the first he made it to Balagansk before returning due to frostbite. His second attempt was successful and he made it to Tiflis. Here, he co-edited a Georgian Marxist newspaper, Proletariatis Brdzola (\"Proletarian Struggle\"), with Philip Makharadze. His calls for a separate Georgian Marxist movement resulted in several RSDLP members calling for his expulsion, claiming that his views were contrary to the ethos of Marxist internationalism. Under Mikha Tskhakaya's influence, Stalin renounced these views. During his exile, the RSDLP had split between Vladimir Lenin's Bolsheviks and Julius Martov's Mensheviks. Stalin detested many of the Mensheviks in Georgia and aligned himself with the Bolsheviks. Although Stalin established a Bolshevik stronghold in the mining town of Chiatura, Bolshevism remained a minority force in the Menshevik-dominated Georgian revolutionary scene.\n\nThe Revolution of 1905 and its aftermath: 1905–1912\n\nIn January 1905, government troops massacred protesters in Saint Petersburg. Unrest soon spread across the Russian Empire in what came to be known as the Revolution of 1905. Georgia was one of the regions particularly affected. In February, Stalin was in Baku when ethnic violence broke out between Armenians and Azeris; at least 2,000 were killed. Stalin publicly lambasted the \"pogroms against Jews and Armenians\" as being part of Tsar Nicholas II's attempts to \"buttress his despicable throne\". He formed a Bolshevik Battle Squad which he used to try and keep Baku's warring ethnic factions apart, also using the unrest to steal printing equipment. Amid the growing violence throughout Georgia, Stalin formed further Battle Squads, with the Mensheviks doing the same. Stalin's Squads disarmed local police and troops, raided government arsenals, and raised funds through protection rackets on large local businesses and mines. They launched attacks on the government's Cossack troops and pro-Tsarist Black Hundreds, co-ordinating some of their operations with the Menshevik militia.\n\nIn November 1905, the Georgian Bolsheviks elected Stalin as one of their delegates to a Bolshevik conference in Saint Petersburg. On arrival, he met Lenin's wife Nadezhda Krupskaya, who informed them that the venue had been moved to Tampere in the Grand Duchy of Finland. At the conference Stalin met Lenin for the first time. Although Stalin held Lenin in deep respect, he was vocal in his disagreement with Lenin's view that the Bolsheviks should field candidates for the forthcoming election to the State Duma; Stalin saw the parliamentary process as a waste of time. In April 1906, Stalin attended the RSDLP Fourth Congress in Stockholm; this was his first trip outside the Russian Empire. At the conference, the RSDLP—then led by its Menshevik majority—agreed that it would not raise funds using armed robbery. Lenin and Stalin disagreed with this decision, and later privately discussed how they could continue the robberies for the Bolshevik cause.\n\nStalin married Kato Svanidze in a church ceremony at Senaki in July 1906. In March 1907 she bore a son, Yakov. By that year—according to the historian Robert Service—Stalin had established himself as \"Georgia's leading Bolshevik\". He attended the Fifth RSDLP Congress, held in London in May–June 1907. After returning to Tiflis, Stalin organized the robbing of a large delivery of money to the Imperial Bank in June 1907. His gang ambushed the armed convoy in Yerevan Square with gunfire and home-made bombs. Around 40 people were killed, but all of his gang escaped alive.\n\nAfter the heist, Stalin settled in Baku with his wife and son. There, Mensheviks confronted Stalin about the robbery and voted to expel him from the RSDLP, but he took no notice of them. In Baku, Stalin secured Bolshevik domination of the local RSDLP branch, and edited two Bolshevik newspapers, Bakinsky Proletary  and Gudok (\"Whistle\"). In August 1907, he attended the Seventh Congress of the Second International in Stuttgart, Germany. In November 1907, his wife died of typhus, and he left his son with her family in Tiflis. In Baku he had reassembled his gang, the Outfit, which continued to attack Black Hundreds and raised finances by running protection rackets, counterfeiting currency, and carrying out robberies. They also kidnapped the children of several wealthy figures in order to extract ransom money. In early 1908, he travelled to the Swiss city of Geneva to meet with Lenin and the prominent Russian Marxist Georgi Plekhanov, although the latter exasperated him.\n\nIn March 1908, Stalin was arrested and interred in Bailov Prison, where he led the imprisoned Bolsheviks, organised discussion groups, and ordered the killing of suspected informants. He was eventually sentenced to two years exile in the village of Solvychegodsk, Vologda Province, arriving there in February 1909. In June, he escaped the village and made it to Kotlas disguised as a woman and from there to Saint Petersburg. In March 1910, he was arrested again, and sent back to Solvychegodsk. There he had affairs with at least two women; his landlady, Maria Kuzakova, later gave birth to his second son, Konstantin. In June 1911, Stalin was given permission to move to Vologda, where he stayed for two months, having a relationship with Pelageya Onufrieva. He proceeded to Saint Petersburg, where he was arrested in September 1911, and sentenced to a further three-year exile in Vologda.\n\nEditing Pravda and the Central Committee: 1912–1917\n\nThe first Bolshevik Central Committee had been elected at the Prague Conference, after which Lenin and Grigory Zinoviev invited Stalin to join it. Still in Vologda, Stalin agreed, remaining a Central Committee member for the rest of his life. Lenin believed that Stalin would be useful in helping to secure support for the Bolsheviks from the Empire's minority ethnicities. In February 1912, Stalin escaped to Saint Petersburg, tasked with converting the Bolshevik weekly newspaper, Zvezda (\"Star\") into a daily, Pravda (\"Truth\"). The new newspaper was launched in April 1912, although Stalin's role as editor was kept secret. In May 1912, he was arrested again and imprisoned in the Shpalerhy Prison, before being sentenced to three years exile in Siberia. In July, he arrived at the Siberian village of Narym, where he shared a room with fellow Bolshevik Yakov Sverdlov. After two months, Stalin and Sverdlov escaped back to Saint Petersburg.\n\nDuring a brief period back in Tiflis, Stalin and the Outfit planned the ambush of a mail coach, during which most of the group—although not Stalin—were apprehended by the authorities. Stalin returned to Saint Petersburg, where he continued editing and writing articles for Pravda. After the October 1912 Duma elections resulted in six Bolsheviks and six Mensheviks being elected, Stalin wrote articles calling for reconciliation between the two Marxist factions, for which he was criticised by Lenin. In late 1912, he twice crossed into the Austro-Hungarian Empire to visit Lenin in Kraków, eventually bowing to Lenin's opposition to reunification with the Mensheviks.\n\nIn January 1913 Stalin travelled to Vienna, there focusing his attention on the 'national question' of how the Bolsheviks should deal with the Russian Empire's national and ethnic minorities. Lenin wanted to attract these groups to the Bolshevik cause by offering them the right of secession from the Russian state, but at the same time he hoped that they would remain part of a future Bolshevik-governed Russia. Stalin's finished article was titled Marxism and the National Question; Lenin was very happy with it. According to Montefiore, this was \"Stalin's most famous work\". The article was published under the pseudonym of \"K. Stalin\", a name he had been using since 1912. This name derived from the Russian language word for steel (stal), and has been translated as \"Man of Steel\". Further, as argued by Robert C. Tucker, the pseudonym was intended to imitate that of Lenin. Stalin retained this name for the rest of his life, possibly because it had been used on the article which established his reputation among the Bolsheviks.\n\nIn February 1913, Stalin was arrested while back in Saint Petersburg. He was sentenced to four years exile in Turukhansk, a remote part of Siberia from which escape was particularly difficult. In August, he arrived in the village of Monastyrskoe, although after four weeks was relocated to the hamlet of Kostino. In March 1914, concerned over a potential escape attempt, the authorities moved Stalin to the hamlet of Kureika on the edge of the Arctic Circle. In the hamlet, Stalin had an affair with Lidia Pereprygia, who was thirteen at the time and thus a year under the legal age of consent in Tsarist Russia. Circa December 1914, Pereprygia gave birth to Stalin's child, although the infant soon died. She gave birth to another of his children, Alexander, circa April 1917. In Kureika, Stalin lived closely with the indigenous Tunguses and Ostyak, and spent much of his time fishing.\n\nThe Russian Revolution: 1917\n\nWhile Stalin was in exile, Russia entered the First World War, and in October 1916 Stalin and other exiled Bolsheviks were conscripted into the Russian Army, leaving for Monastyrskoe. They arrived in Krasnoyarsk in February 1917, where a medical examiner ruled him unfit for military service due to his crippled arm. Stalin was required to serve four more months on his exile, and he successfully requested that he serve it in nearby Achinsk. Stalin was in the city when the February Revolution took place; uprisings broke out in Petrograd—as Saint Petersburg had been renamed—and Tsar Nicholas II abdicated, to be replaced by a Provisional Government. In a celebratory mood, Stalin travelled by train to Petrograd in March. There, Stalin and fellow Bolshevik Lev Kamenev assumed control of Pravda, and Stalin was appointed the Bolshevik representative to the Executive Committee of the Petrograd Soviet, an influential council of the city's workers. In April, Stalin came third in the Bolshevik elections for the party's Central Committee; Lenin came first and Zinoviev came second. This reflected his senior standing in the party at the time.\n\nStalin helped to organise the July Days uprising, an armed display of strength by Bolshevik supporters. After the armed demonstration was suppressed, the Provisional Government initiated a crackdown on the Bolsheviks, raiding Pravda. During this raid, Stalin smuggled Lenin out of the newspaper's office and took charge of the Bolshevik leader's safety, moving him between Petrograd safe houses before smuggling him to Razliv. In Lenin's absence, Stalin continued editing Pravda and served as acting leader of the Bolsheviks, overseeing the party's Sixth Congress, which was held covertly. Lenin began calling for the Bolsheviks to seize power by toppling the Provisional Government in a coup. Stalin and fellow senior Bolshevik Leon Trotsky both endorsed Lenin's plan of action, but it was opposed by Kamenev and other party members. Lenin returned to Petrograd and at a meeting of the Central Committee on 10 October, he secured a majority in favour of a coup.\n\nOn 24 October, police raided the Bolshevik newspaper offices, smashing machinery and presses; Stalin salvaged some of this equipment in order to continue his activities. In the early hours of 25 October, Stalin joined Lenin in a Central Committee meeting in the Smolny Institute, from where the Bolshevik coup—the October Revolution—was directed. Bolshevik militia seized Petrograd's electric power station, main post office, state bank, telephone exchange, and several bridges. A Bolshevik-controlled ship, the Aurora, opened fire on the Winter Palace; the Provisional Government's assembled delegates surrendered and were arrested by the Bolsheviks. Although he had been tasked with briefing the Bolshevik delegates of the Second Congress of Soviets about the developing situation, Stalin's role in the coup had not been publicly visible. Trotsky and other later Bolshevik opponents of Stalin used this as evidence that his role in the coup had been insignificant, although several historians reject this. According to the historian Oleg Khlevniuk, Stalin \"filled an important role [in the October Revolution]... as a senior Bolshevik, member of the party's Central Committee, and editor of its main newspaper\".\n\nIn Lenin's government\n\nConsolidating power: 1917–1918\n\nOn 26 October, Lenin formed a new government, the Council of People's Commissars (\"Sovnarkom\"), which he led as Chairman. Stalin was among the Bolsheviks who backed Lenin's decision not to form a coalition with the Mensheviks and Socialist Revolutionary Party, although they did form a coalition government with the Left Socialist Revolutionaries. Stalin was soon part of an informal foursome leading the government, alongside Lenin, Trotsky, and Sverdlov; of these, Sverdlov was regularly absent, and died in March 1919. Stalin's office was based near to Lenin's in the Smolny Institute, and he and Trotsky were the only individuals allowed access to Lenin's study without an appointment. Although not so publicly well known as Lenin or Trotsky, Stalin's importance among the Bolsheviks grew. He co-signed Lenin's decrees shutting down hostile newspapers, and with Sverdlov chaired the sessions of the committee drafting a constitution for the new Russian Soviet Federative Socialist Republic. He strongly supported Lenin's formation of the Cheka security service and the subsequent Red Terror that it initiated; noting that state violence had proved an effective tool for capitalist powers, he believed that it would prove the same for the Soviet government. Unlike senior Bolsheviks like Kamenev and Nikolai Bukharin, Stalin never expressed concern about the rapid growth and expansion of the Cheka and Terror.\n\nHaving dropped his editorship of Pravda, Stalin was appointed as the People's Commissar for Nationalities. In November, he signed the Decree on Nationality, according ethnic and national minorities living in Russia the right of secession and self-determination. The purpose of this decree was primarily strategic, designed to woo the support of ethnic minorities for the Bolshevik cause; the Bolsheviks hoped that the minorities would not actually desire independence. That month, he travelled to Helsinki to talk with the Finnish Social-Democrats, to whom he promised independence, which was then granted in December. His department allocated funds for the establishment of presses and schools in the languages of various ethnic minorities. Socialist Revolutionaries accused Stalin of using talk of federalism and national self-determination as a front for Sovnarkom's centralising and imperialist policies.\n\nAs a result of the ongoing First World War, in which Russia was fighting the Central Powers, Lenin's government relocated from Petrograd to Moscow in March 1918. Stalin brought Nadezhda Alliluyeva with him as his secretary; he had been a longstanding friend of her parents. At some point, the couple married, although the exact date of their wedding is unknown. Lenin wanted to sign an armistice with the Central Powers regardless of the cost in territory, and was supported in this by Stalin. Stalin thought it necessary because he was unconvinced that Europe itself was on the verge of proletarian revolution, a view that irked Lenin. Lenin eventually convinced the other senior Bolsheviks of the need for a peace treaty, resulting in the signing of the Treaty of Brest-Litovsk in March 1918. The treaty gave vast areas of land and resources to the Central Powers and angered many in Russia; the Left Socialist Revolutionaries abandoned the coalition government over the issue.\n\nMilitary Command: 1918–1921\n\nAfter the Bolsheviks seized power, both right and left-wing armies rallied against them, generating the Russian Civil War. To secure access to the dwindling food supply, in May 1918 Sovnarkom sent Stalin to Tsaritsyn to take charge of food procurement in southern Russia. Eager to prove himself as a commander, once there he took control of regional military operations. He befriended two military figures, Kliment Voroshilov and Semyon Budyonny, who would form the nucleus of his military and political support base. Believing that victory was assured by numerical superiority, he sent large numbers of Red Army troops into battle against the region's anti-Bolshevik White armies, resulting in heavy losses; Lenin was concerned by this costly tactic. In Tsaritsyn, Stalin executed suspected counter-revolutionaries, sometimes without trial, and—in contravention of government orders—purged the military and food collection agencies of middle-class specialists, some of whom he also executed. His use of state violence and terror was at a greater scale than most Bolshevik leaders approved of. For instance, he ordered several villages to be torched to ensure compliance with his food procurement program.\n\nIn December 1918, Stalin was sent to Perm to lead an inquiry into how the Red Army forces based there had been decimated in an attack by Alexander Kolchak's White forces. He returned to Moscow between January and March 1919, before being assigned to the Western Front at Petrograd. When the Third Regiment defected, he ordered any captured defectors to be publicly shot. In September he was returned to the Southern Front. During the war, he proved his worth to the Central Committee, displaying decisiveness, determination, and a willingness to take on responsibility in conflict situations. At the same time, he disregarded orders and when affronted he repeatedly threatened to resign, forcing Lenin to convince him to reconsider. In November 1919, the government awarded him the Order of the Red Banner for his service in the war.\n\nThe civil war was over by the end of 1919, having resulted in a Bolshevik victory. Sovnarkom turned its attention to spreading proletarian revolution abroad, to this end forming the Communist International in March 1919; Stalin was present at its inaugural ceremony. Although Stalin did not share Lenin's belief that the European proletariat were on the verge of revolution, he acknowledged that as long as it stood alone, Soviet Russia remained vulnerable. In December 1918, he had drawn up decrees recognising Marxist-governed Soviet republics in Estonia, Lithuania, and Latvia, however these Marxist governments had been overthrown and the Baltic countries became fully independent of Russia, an act which he regarded as illegitimate. In February 1920, Stalin was appointed to head the Workers' and Peasants' Inspectorate; that same month he was also transferred to the Caucasian Front.\n\nFollowing earlier clashes between Polish and Russian troops, the Polish–Soviet War broke out in the spring of 1920. Stalin was moved to Ukraine, on the Southwest Front. The Red Army forced the Polish troops back into Poland. Lenin believed that the Polish proletariat would rise up to support the Russians against Józef Piłsudski's Polish government. Stalin had cautioned against this; he believed that nationalism would lead the Polish working-classes to support their government's war effort. He also believed that the Red Army was ill-prepared to conduct an offensive war and that it would give White Armies a chance to resurface in Crimea, potentially reigniting the civil war. Stalin lost the argument, after which he accepted Lenin's decision and supported it. Along the Southwest Front, he became determined to conquer Lwów; in focusing on this goal he disobeyed orders to transfer his troops to assist Mikhail Tukhachevsky's forces. In August, the Poles repulsed the Russian advance and Stalin returned to Moscow. A peace treaty between the two countries was signed, for which Stalin blamed Trotsky. Stalin felt resentful and under-appreciated; he was angry at how the war had been conducted and in September demanded demission from the military, which was granted. At the 9th Bolshevik Conference, Stalin was accused of insubordination and military incompetence during the war with Poland, with Trotsky accusing him of making \"strategic mistakes\".\n\nLenin's final years: 1921–1923\n\nStalin believed that each nation and ethnic group should have the right to self-expression, facilitating this through \"autonomous republics\" within the Russian state in which ethnic minorities could oversee various regional affairs. Some Communists accused him of bending too much to \"petit-bourgeois\" nationalisms, while others accused him of remaining too Russocentric by seeking to maintain these nations within the Russian state.\nStalin's native Caucasus posed a particular problem due to its highly multi-cultural mix. Stalin opposed the idea of separate Georgian, Armenian, and Azerbaijani autonomous republics, arguing that these would likely oppress the many minorities within their territory; instead he called for the formation of a Transcaucasian Socialist Federative Soviet Republic. The Georgian Communist Party opposed the idea, resulting in the Georgian Affair. In the summer of 1921, he returned to the southern Caucasus, there calling on Georgian Communists to avoid the chauvinistic Georgian nationalism which he believed marginalised the Abkhazian, Ossetian, and Adjarian minorities. On this trip, Stalin met with his son Yakov, and brought him back to Moscow with them; Nadya had given birth to another of Stalin's sons, Vasily, in March 1921.\n\nAfter the civil war, workers' strikes and peasant uprisings broke out across Russia, largely in opposition to Sovnarkom's food requisitioning project; as an antidote, Lenin introduced a level of market-oriented reform as the New Economic Policy (NEP). There was also internal turmoil in the Communist Party, as Trotsky led a faction calling for the abolition of trade unions; Lenin opposed this and Stalin helped him to drum up support against Trotsky's position. Stalin also agreed to supervise the Department of Agitation and Propaganda in the Central Committee Secretariat. At the 11th Party Congress in 1922, Lenin nominated Stalin as the party's new General Secretary. Although concerns were expressed that adopting this new post on top of his others would both overstretch his workload and give him too much power, Stalin was appointed to the position. For Lenin, it was advantageous to have one of his allies in a post crucial for the maintenance of his policies.\n\nIn May 1922, Lenin had a massive stroke and was partially paralysed. Residing at his Gorki dacha, Lenin's main connection to Sovnarkom was through Stalin, who was a regular visitor. Lenin twice asked Stalin to procure poison so that he may commit suicide, but Stalin never did so. Despite this comradeship, Lenin disliked what he referred to as Stalin's \"Asiatic\" manner, and told his sister Maria that Stalin was \"not intelligent\". Lenin and Stalin argued on the issue of foreign trade; Lenin believed that the Soviet state should have a monopoly on foreign trade, but Stalin supported Grigori Sokolnikov's view that doing so was impractical at that stage. Another disagreement came over the Georgian Affair, with Lenin backing the Georgian Central Committee's desire for a Georgian Soviet Republic over Stalin's idea of a Transcaucasian one.\n\nThey also disagreed on the nature of the Soviet state. Lenin called for the country to be renamed the \"Union of Soviet Republics of Europe and Asia\", reflecting his desire for expansion across the two continents. Stalin believed that this would encourage independence sentiment among non-Russians, instead arguing that ethnic minorities would be content as \"autonomous republics\" within the Russian Soviet Federative Socialist Republic. Lenin accused Stalin of \"Great Russian chauvinism\"; Stalin accused Lenin of \"national liberalism\". A compromise was reached, in which the country would be renamed the \"Union of Soviet Socialist Republics\" (USSR). The USSR's formation was ratified in December 1922; although officially a federal system, all major decisions were taken by the Politburo in Moscow. Their differences were not just based on policy but also became personal; Lenin was particularly angered when Stalin was rude to his wife Krupskaya during a telephone conversation. In the final years of his life, Lenin dictated increasingly disparaging notes on Stalin that became his testament. He criticized Stalin's rude manners and excessive power, suggesting that Stalin should be removed from the position of General Secretary.\n\nRise to power\n\nSucceeding Lenin: 1924–1927\n\nLenin died in January 1924. Stalin took charge of the funeral and was one of its pallbearers; against the wishes of Lenin's widow, the Politburo embalmed his corpse and placed it within a mausoleum in Moscow's Red Square. It was incorporated into a growing personality cult devoted to Lenin, with Petrograd being renamed \"Leningrad\" that year. To bolster his image as a devoted Leninist, Stalin was eager to present himself as a theorist, giving nine lectures at Sverdlov University on the \"Foundations of Leninism\"; it was later published as a concise overview of Lenin's ideas. At the following 13th Party Congress, Lenin's Testament was read out to senior figures. Embarrassed by its contents, Stalin offered his resignation as General Secretary; this act of humility saved him and he was retained in the position. In his private life, he was dividing his time between his Kremlin apartment and a dacha he had obtained at Zubalova. His wife had given birth to a daughter, Svetlana, in February 1926.\n\nStalin saw Trotsky as the main obstacle to his rise to dominance within the Communist Party, and while Lenin had been ill he had forged an anti-Trotsky alliance with Kamenev and Grigory Zinoviev. Although Zinoviev had expressed concerned about Stalin's growing authority, he rallied behind him at the 13th Congress as a counterweight to Trotsky, who now led a party faction known as the Left Opposition. The Left Opposition believed that too many concessions to capitalism had been made with the NEP; Stalin was deemed a \"rightist\" in the party for his support of the policy. Stalin built up a retinue of his supporters in the Central Committee, while the Left Opposition were gradually removed from their positions of influence. He was supported in this by Bukharin, who like Stalin believed that implementing the Left Opposition's proposals would plunge the Soviet Union into instability.\n\nIn the autumn of 1924, Stalin also removed Kamenev and Zinoviev's supporters from key positions. In 1925, Kamenev and Zinoviev moved into open opposition of Stalin and Bukharin. They attacked one another at the 14th Party Congress, where Stalin accused Kamenev and Zinoviev of reintroducing factionalism—and thus instability—into the party. In the summer of 1926, Kamenev and Zinoviev joined with the Trotskyites to form the United Opposition against Stalin; in October they agreed to stop factional activity under threat of expulsion, and later publicly recanted their views under Stalin's command. The factionalist arguments continued, with Stalin threatening to resign in both December 1926 and December 1927. In October 1927, Zinoviev and Trotsky were removed from the Central Committee; the latter was exiled to Kazakhstan and later deported from the country in 1929. Some of those United Opposition members who were repentant were later rehabilitated and allowed to return to government. Stalin had established himself as the party's supreme leader, although was not the head of government, a task he entrusted to key ally Vyacheslav Molotov. Other important supporters on the Politburo were Voroshilov, Lazar Kaganovich, and Sergo Ordzhonikidze, with Stalin ensuring that his allies ran the various state institutions. According to Montefiore, at this point \"Stalin was the leader of the oligarchs but he was far from a dictator\".\n\nIn 1924, Georgian nationalists seeking independence launched the August Uprising; it was suppressed by the Red Army. In April 1925, Tsaritsyn was renamed Stalingrad.\nIn 1926, Stalin published On Questions of Leninism. It was in this book that he introduced the concept of \"Socialism in One Country\", which he claimed was an orthodox Leninist perspective. It nevertheless clashed with established Bolshevik views that socialism could not be established in one country but could only be achieved globally through the process of world revolution.\nIn 1927, there was some argument in the party over the USSR's relationship to the situation in China. Stalin had called for the Communist Party of China, led by Mao Zedong, to ally itself with Chiang Kai-shek's Kuomintang (KMT) nationalists, viewing a Communist-Kuomintang alliance as the best bulwark against Japanese imperial expansionism in eastern Asia. Instead, the KMT repressed the Communists and a civil war broke out between the two sides.\n\nDekulakisation, collectivisation, and industrialisation: 1927–1931\n\nEconomic policy\n\nBy the latter half of the 1920s, the Soviet Union was still lagging behind the industrial development of Western countries, and Stalin's government feared military attack from Japan, France, or the United Kingdom. Many Bolsheviks, including in Komsomol, OGPU, and the Red Army, were eager to be rid of the NEP and its market-oriented approach, desiring a push towards socialism. There were concerns about a growing sector of society—the 'kulaks' and the Nepmen—who had profited from the policy and become wealthier than other citizens. There had also been a shortfall of grain supplies; 1927 produced only 70% of grain produced in 1926. At this point, Stalin turned against the NEP, putting him on a course to the \"left\" even of Trotsky or Zinoviev.\n\nIn early 1928 Stalin travelled to Novosibirsk, there claiming that kulaks were hoarding their grain. He ordered that the kulaks be arrested and their grain confiscated, with Stalin bringing much of the area's grain back to Moscow with him in February. At his command, grain procurement squads surfaced across Western Siberia and the Urals, with violence breaking out between these squads and the peasantry. Stalin announced that both kulaks and the \"middle peasants\" must be coerced into releasing their harvest. Bukharin and several other members of the Central Committee were angry that they had not been consulted about this measure, which they deemed rash. In January 1930, the Politburo approved a measure to liquidate the existence of the kulaks as a class; they were rounded up and exiled either elsewhere in their own regions, to other parts of the country, or to concentration camps. Large numbers died during the journey. By July 1930, over 320,000 households had been affected by the de-kulakisation policy.\n\nIn 1929, the Politburo announced the mass collectivisation of agriculture, establishing both kolkhozy collective farms and sovkhoz state farms. Stalin stipulated that kulaks would be barred from joining these collectives. Although officially voluntary, many peasants joined the collectives out of fear they would face the fate of the kulaks; others joined amid intimidation and violence from party loyalists.\nBy 1932, about 62% of households involved in agriculture were part of collectives, and by 1936 this had risen to 90%. Many of the peasants who had been collectivised resented the loss of their private farmland, and productivity slumped. Famine broke out in many areas, with the Politburo frequently ordering the distribution of emergency food relief to these regions. Armed peasant uprisings against dekulakisation and collectivisation broke out in Ukraine, northern Caucasus, southern Russia, and central Asia, reaching their apex in March 1930; these were repressed by the Red Army. Stalin responded to the uprisings with an article insisting that collectivisation was voluntary and blaming any violence and other excesses on local officials. Bukharin expressed concerns about these policies; he regarded them as a return to Lenin's old \"war communism\" policy and believed that it would fail. However, by the summer of 1928 he was unable to rally sufficient support in the party to oppose the reforms. In November 1929 Stalin removed him from the Politburo.\n\nOfficially, the Soviet Union had replaced the irrationality and wastefulness of a market economy with a planned economy organised along a long-term, precise, and scientific framework; in reality, Soviet economics were based on ad hoc commandments issued from the centre, often to make short-term targets. In 1928, the first five-year plan was launched, its main focus on boosting heavy industry; it was finished a year ahead of schedule, in 1932.\nThe USSR underwent a massive economic transformation. New mines were opened, new cities like Magnitogorsk constructed, and work on the White Sea-Baltic Canal begun. Millions of peasants moved to the cities and became proletariat, although urban house building could not keep up with the demand. Large debts were accrued while purchasing foreign-made machinery. Many of the major construction projects, including the White Sea-Baltic Canal and the Moscow Metro, were constructed largely through forced labour. The last elements of workers' control over industry were removed, with factory managers increasing their authority and receiving privileges and perks; Stalin defended wage disparity by pointing to Marx's argument that it was necessary during the lower stages of socialism. To promote the intensification of labour, a series of medals and awards as well as the Stakhanovite movement were introduced. Stalin's message was that socialism was being established in the USSR while capitalism was crumbling amid the Wall Street crash. His speeches and articles reflected his utopian vision of the Soviet Union rising to unparalleled heights of human development, creating a \"new Soviet person\".\n\nCultural and foreign policy\n\nIn 1928, Stalin declared that class war between the proletariat and their enemies would intensify as socialism developed. He warned of a \"danger from the right\", including in the Communist Party itself. The first major show trial in the USSR was the Shakhty Trial of 1928, in which several middle-class \"industrial specialists\" were convicted of sabotage. From 1929 to 1930, further show trials were held to intimidate opposition: these included the Industrial Party Trial, Menshevik Trial, and Metro-Vickers Trial. Aware that the ethnic Russian majority may have concerns about being ruled by a Georgian,  he promoted ethnic Russians throughout the state hierarchy and made the Russian language compulsory throughout schools and offices, albeit to be used in tandem with local languages in areas with non-Russian majorities. Nationalist sentiment among ethnic minorities was suppressed. Conservative social policies were promoted to enhance social discipline and boost population growth; this included a focus on strong family units and motherhood, the re-criminalisation of homosexuality, restrictions placed on abortion and divorce, and the abolition of the Zhenotdel.\n\nStalin desired a \"cultural revolution\", entailing both the creation of a culture for the \"masses\" and the wider dissemination of previously elite culture. He oversaw the proliferation of schools, newspapers, and libraries, as well as the advancement of literacy and numeracy. \"Socialist realism\" was promoted throughout the arts, while he personally wooed prominent writers, namely Maxim Gorky, Mikhail Sholokhov, and Aleksey Nikolayevich Tolstoy. He also expressed patronage for scientists whose research fitted within his preconceived interpretation of Marxism; he for instance endorsed the research of agrobiologist Trofim Lysenko despite the fact that it was rejected by the majority of his scientific peers as pseudo-scientific. The government's anti-religious campaign was re-intensified, with increased funding given to the League of Militant Atheists. Christian, Muslim, Jewish, and Buddhist clergy faced persecution. Many religious buildings were demolished, most notably Moscow's Cathedral of Christ the Saviour, destroyed in 1931 to make way for the (never completed) Palace of the Soviets. Religion retained an influence over much of the population; in the 1937 census, 57% of respondents identified as religious.\n\nThroughout the 1920s and beyond, Stalin placed a high priority on foreign policy. He personally met with a range of Western visitors, including George Bernard Shaw and H. G. Wells, both of whom were impressed with him. Through the Communist International, Stalin's government exerted a strong influence over Marxist parties elsewhere in the world; initially, Stalin left the running of the organisation largely to Bukharin. \nAt its 6th Congress in July 1928, Stalin informed delegates that the main threat to socialism came not from the right but from non-Marxist socialists and social democrats, whom he called \"social fascists\"; Stalin recognised that the social democrats were the Marxist-Leninists' main rivals for working-class support in many countries. This preoccupation with opposing rival leftists concerned Bukharin, who was particularly worried by the growth of fascism and the far right across Europe. After Bukharin's departure, Stalin placed the Communist International under the administration of Dmitry Manuilsky and Osip Piatnitsky.\n\nStalin faced problems in his family life. In 1929, his son Yakov unsuccessfully attempted suicide; his failure earned Stalin's contempt. His relationship with Nadya was also strained amid their arguments and her mental health problems. In November 1932, after a group dinner in the Kremlin in which Stalin flirted with other women, Nadya shot herself.\nPublicly, it was claimed that Nadya died of appendicitis; Stalin also concealed the real cause of death from his children. Stalin's friends noted that he underwent a significant change following her suicide, becoming emotionally harder.\n\nMajor crises: 1932–1939\n\nFamine in Ukraine\n\nWithin the Soviet Union, there was widespread civic disgruntlement against Stalin's government. Social unrest, previously restricted largely to the countryside, was increasingly evident in urban areas, prompting Stalin to ease on some of his economic policies in 1932. In May 1932, he introduced a system of kolkhoz markets where peasants could trade their surplus produce. At the same time, penal sanctions became more severe; at Stalin's instigation, in August 1932 a measure was introduced meaning that the theft of even a handful of grain could be a capital offense. The second five-year plan had its production quotas reduced from that of the first, with the main emphasis now being on improving living conditions. It therefore emphasised the expansion of housing space and the production of consumer goods. Like its predecessor, this Plan was repeatedly amended to meet changing situations; there was for instance an increasing emphasis placed on armament production after Adolf Hitler became German Chancellor in 1933.\n\nSuch policies nevertheless failed to stop the famine which peaked in the winter of 1932–33. Between five and seven million people died; many resorted to cannibalising the dead to survive. Worst affected were Ukraine and the North Caucuses, although the famine also impacted Kazakhstan and several Russian provinces. The 1932 harvest had been a poor one, and had followed several years in which lower productivity had resulted in a gradual decline in output. Stalin blamed the famine on hostile elements and wreckers within the peasantry.\nAccording to British historian Alan Bullock, \"the total Soviet grain crop was no worse than that of 1931 ... it was not a crop failure but the excessive demands of the state, ruthlessly enforced, that cost the lives of as many as five million Ukrainian peasants.\" Stalin refused to release large grain reserves that could have alleviated the famine, while continuing to export grain, and he strictly enforced new draconian anti-theft laws on the collective farm. Other historians hold the view that it was largely the insufficient harvests of 1931 and 1932 caused by a variety of natural disasters that resulted in famine, with the successful harvest of 1933 ending the famine. \nThe Ukrainian famine is sometimes referred to as the Holodomor,  implying that it was engineered by the Soviet government, specifically targeting the Ukrainian people in order to destroy the Ukrainian nation as both a political factor and a social entity. The existence of the famine was denied to foreign observers.\n\nStalinism\n\nIn 1935–36, Stalin oversaw a new constitution; its dramatic liberal features were designed as propaganda weapons, for all power rested in the hands of Stalin and his Politburo. He declared that \"socialism, which is the first phase of communism, has basically been achieved in this country\". In 1938, The History of the Communist Party of the Soviet Union (Bolsheviks), colloquially known as the Short Course, was released; Conquest later referred to it as the \"central text of Stalinism\". A number of authorised Stalin biographies were also published, although Stalin generally wanted to be portrayed as the embodiment of the Communist Party rather than have his life story explored.  During the later 1930s, Stalin placed \"a few limits on the worship of his own greatness\".  By 1938, Stalin's inner circle had gained a degree of stability, containing the personalities who would remain there until Stalin's death.\n\nForeign affairs\n\nSeeking improved international relations, in 1934 the Soviet Union secured membership of the League of Nations, of which it had previously been excluded. Stalin initiated confidential communications with Hitler in October 1933, shortly after the latter came to power in Germany. Stalin admired Hitler, particularly the latter's manoeuvres to remove rivals within the Nazi Party in the Night of the Long Knives. He nevertheless recognised the threat posed by fascism and sought to establish better links with the liberal democracies of Western Europe; in May 1935, the Soviets signed a treaty of mutual assistance with France and Czechoslovakia. At the Communist International's 7th Congress, held in July–August 1935, the Soviet government encouraged Marxist-Leninists to unite with other leftists as part of a popular front against fascism. In turn, the anti-communist governments of Germany, Fascist Italy and Japan signed the Anti-Comintern Pact of 1936. When the Spanish Civil War broke out the same year, the Soviets sent 648 aircraft and 407 tanks to the left-wing Republican faction; these were accompanied by 3000 Soviet troops and 42,000 members of the International Brigades set up by the Communist International. Stalin took a strong personal involvement in the Spanish situation. Germany and Italy backed the Nationalist faction, which was ultimately victorious in March 1939. Stalin would also give aid to the Chinese after the outbreak of the Second Sino-Japanese War in July 1937, the KMT and the Communists having formed Stalin's desired United Front.\n\nThe Great Terror\n\nRegarding state repressions, Stalin often provided conflicting signals. In May 1933, he ordered the release of many criminals convicted of minor offenses from the overcrowded prisons and ordered the security services not to enact further mass arrests and deportations. In September 1934, he ordered the Politburo to establish a commission to investigate any false imprisonments; however, that same month he called for the execution of workers at the Stalin Metallurgical Factory accused of spying for Japan. This mixed approach began to change in December 1934, when the prominent party member Sergey Kirov was murdered. After Kirov's murder, Stalin became increasingly attentive of the possibility of murder and subsequently improved his own personal security, including being heavily guarded at all times and rarely going out in public.\n\nKirov's killing was followed by an intensification of state repression; Stalin issued a decree establishing NKVD troikas which could mete out rulings without involving the courts. Just as the de-kulakisation policy had sought to rid rural areas of anti-government forces, so Stalin sought to do the same in the cities and towns. In 1935, the NKVD was ordered to expel suspected counter-revolutionaries, particularly those who had been aristocrats, landlords, or businesspeople before the October Revolution. In the early months of 1935, over 11,000 people were expelled from Leningrad, to live in isolated rural areas. In 1936, Nikolai Yezhov became head of the NKVD and oversaw this intensification. Stalin instigated this intensification of repression, which was rooted in his own psychological compulsions and the logic of the system he had created, one which prioritised security above other considerations.\n\nStalin orchestrated the arrest of many former opponents in the Communist Party: denounced as Western-backed mercenaries, many were imprisoned or exiled internally. The first Moscow Trial took place in August 1936; Kamenev and Zinoviev were among those accused of plotting assassinations, found guilty in a show trial, and executed. The second Moscow Show Trial took place in January 1937, and the third in March 1938, in which Bukharin and Rykov were accused of involvement in the alleged Trotskyite-Zinovievite terrorist plot and sentenced to death. By late 1937, all remnants of collective leadership were gone from the Politburo, which was controlled entirely by Stalin.\nThere were mass expulsions from the party, with Stalin commanding foreign communist parties to also purge anti-Stalinist elements. During the 1930s and 1940s, NKVD groups assassinated defectors and opponents abroad; in August 1940, Trotsky was assassinated in Mexico, eliminating the last of Stalin's opponents among the former Party leadership.\nIn May, this was followed by the arrest of most members of the military Supreme Command and mass arrests throughout the military, often on fabricated charges. These purges replaced most of the party's old guard with younger officials who did not remember a time before Stalin's leadership and who were regarded as more personally loyal to him. Party functionaries readily carried out their commands and sought to ingratiate themselves with Stalin to avoid becoming the victim of the purge. Such functionaries often carried out a greater number of arrests and executions than their quotas set by Stalin's central government.\n\nRepressions further intensified in December 1936 and remained at a high level until November 1938, a period known as the Great Purge. By the latter part of 1937, the purges had moved beyond the party and were affecting the wider population. In July 1937, the Politburo ordered a purge of \"anti-Soviet elements\" in society, affecting Bolsheviks who had opposed Stalin, former Mensheviks and Socialist Revolutionaries, priests, former soldiers in the White Army, and common criminals. That month, Stalin and Yezhov signed Order No. 00447, listing 268,950 people for arrest, of whom 75,950 were executed. He also initiated \"national operations\", the ethnic cleansing of non-Soviet ethnic groups—among them Poles, Germans, Latvians, Finns, Greeks, Koreans, and Chinese—through internal or external exile. During these years, approximately 1.6 million people were arrested. 700,000 were shot, and an unknown number died under NKVD torture.\n\nStalin initiated all of the key decisions during the Terror, personally directing many of its operations and taking an interest in the details of their implementation. His motives in doing so have been much debated by historians. His personal writings from the period were—according to Khlevniuk—\"unusually convoluted and incoherent\", filled with claims about conspiracies and enemies encircling him. He was particularly concerned at the success that right-wing forces had in overthrowing the leftist Spanish government, worried that domestic anti-Stalinist elements would become a fifth column in the event of a future war with Japan and Germany. The Great Terror ended when Yezhov was removed as the head of the NKVD, to be replaced by Lavrentiy Beria, a man totally devoted to Stalin. Yezhov was arrested in April 1939 and executed in 1940. The Terror had damaged the Soviet Union's reputation abroad, particularly among previously sympathetic leftists, and as the Terror wound down, so Stalin sought to deflect responsibility away from himself. He later claimed that the Terror's \"excesses\" and \"violations of law\" were Yezhov's fault.\n\nWorld War II\n\nNon-aggression pact with Germany: 1939–1941\n\nAs a Marxist–Leninist, Stalin expected an inevitable Second World War between competing capitalist powers; as Nazi Germany annexed Austria and then part of Czechoslovakia in 1938, Stalin recognised that this war was looming. He sought to maintain Soviet neutrality in the conflict, hoping that a German war against France and the UK would leave the Soviets a dominant force in Europe. Militarily, the Soviets also faced a threat from the east, with Soviet troops clashing with the expansionist Japanese in the latter part of the 1930s. Stalin initiated a military build-up, with the Red Army more than doubling between January 1939 and June 1941, although in its haste to expand many of its officers were poorly trained.\n\nAs Britain and France seemed unwilling to commit to an alliance with the Soviet Union, Stalin saw a better deal with the Germans. In May 1939, Germany began negotiations with the Soviets, proposing that Eastern Europe be divided between the two powers. Stalin saw this as an opportunity both for territorial expansion and temporary peace with Germany. In August 1939, the Soviet Union signed a non-aggression pact with Germany, negotiated by Soviet foreign minister Vyacheslav Molotov and German foreign minister Joachim von Ribbentrop. A week later, Germany invaded Poland, sparking the UK and France to declare war on it. On 17 September, the Red Army entered eastern Poland, officially to restore order amid the collapse of the Polish state; this explanation was also designed so as not to anger the UK and France.\n\nStalin suggested a territorial exchange with Germany, giving them the ethnic Polish-dominated areas of Lublin Province and part of Warsaw Province, and in return receiving Lithuania; Stalin had desired the reintegration of the three Baltic states into the Soviet Union. This was agreed in 28 September. A German–Soviet Frontier Treaty was signed shortly after, in Stalin's presence. The two nations continued trading, undermining the British blockade of Germany.\n\nThe Red Army entered the Baltic states, which were forcibly merged into the Soviet Union in August. The Soviets also claimed Finland, but the Finnish government refused their demands. The Soviets invaded Finland in November; despite their numerical inferiority, the Finns kept the Red Army at bay. International opinion backed Finland, with the Soviets being expelled from the League of Nations. Embarrassed by their inability to defeat the Finns, the Soviets signed an interim peace treaty, in which they received territorial concessions from Finland. In June 1940, Bessarabia and northern Bukovina—parts of Romania—were also annexed into the Soviet Union. The Soviet authorities sought to forestall any dissent in these new East European territories. One of the most noted instances was the Katyn massacre of April and May 1940, in which around 22,000 members of the Polish armed forces, police, and intelligentsia were executed.\n\nThe speed of the German victory over and occupation of France in summer 1940 took Stalin by surprise. He increasingly focused on appeasement with Germany to delay any conflict with them.\nAfter the Tripartite Pact was signed by Axis Powers Germany, Japan and Italy, in October 1940, Stalin approached Germany with the suggestion that it too join the Axis alliance. To demonstrate peaceful intentions toward Germany, in April 1941 the Soviets signed a neutrality pact with Japan.\nOn 6 May, Stalin replaced Molotov as Premier of the Soviet Union. Although de facto head of government for a decade and a half, Stalin concluded that relations with Germany had deteriorated to such an extent that he needed to deal with the problem as de jure head of government as well.\n\nGerman invasion: 1941–1942\n\nIn June 1941, Germany invaded the Soviet Union, initiating the war on the Eastern Front. Despite having prior warning, Stalin was taken by surprise. He formed a military Supreme Command (Stavka), as well as a State Committee of Defence, which he headed as Supreme Commander. The German tactic of blitzkrieg was initially highly effective; the Soviet air force in the western borderlands was destroyed within two days. The German Wehrmacht pushed deep into Soviet territory; soon, Ukraine, Belorussia, and the Baltic states were under German occupation. Soviet refugees flooded into Moscow and Leningrad to escape the Wehrmacht, although there were other Soviet citizens—namely those who were neither ethnically Russian nor Jewish—who welcomed the German Army as liberators; they soon found that the Nazis regarded them as Untermensch, fit only for economic exploitation. By July, Germany's Luftwaffe was bombing Moscow, and by October the Wehrmacht were amassing for a full assault on the capital. Plans were made for the Soviet government to evacuate to Kuibyshev, although Stalin decided to remain in Moscow, believing that his flight would damage troop morale. The German advance on Moscow was halted by the arrival of winter.\n\nAgainst his generals' advice, Stalin emphasised attack over defence. In June 1941, he ordered a scorched earth policy of destroying infrastructure and food supplies before the Germans could seize them, also commanding the NKVD to kill around 100,000 political prisoners in areas the Wehrmacht approached. He purged the military command; several high-ranking figures were demoted or reassigned but a few were arrested and executed. With Order No. 270, Stalin commanded soldiers risking capture to commit suicide or fight to the death, and that those who allowed themselves to be captured were traitors; among those taken as a prisoner of war by the Germans was Stalin's son Yakov, who died in their custody. Stalin issued Order No. 227 in July 1942, which directed that those retreating would be placed in \"penal battalions\" used as cannon fodder on the front lines. Amid the fighting, both the German and Soviet armies disregarded the law of war set forth in the Geneva Conventions; the Soviets heavily publicised Nazi massacres of communists, Jews, and Romani.\n\nThe Soviets allied with the United Kingdom and United States; although the US joined the war against Germany in 1941, little direct assistance reached the Soviets until late 1942.\nResponding to the invasion, the Soviets intensified their industrial enterprises in central Russia, focusing almost entirely on production for the military. They achieved high levels of industrial productivity, outstripping that of Germany. During the war, Stalin was more tolerant of the Russian Orthodox Church, allowing it to resume some of its activities and meeting with Patriarch Sergius in September 1943. He also permitted a wider range of cultural expression, notably permitting formerly suppressed writers and artists like Anna Akhmatova and Dmitri Shostakovich to disperse their work more widely. The Internationale was dropped as the country's national anthem, to be replaced with a more patriotic replacement. There was an increased criticism of cosmopolitanism, particularly the idea of \"rootless cosmopolitanism\", an approach with particular repercussions for Soviet Jews. Comintern was dissolved in 1943, and Stalin encouraged foreign Marxist–Leninist parties to emphasise nationalism over internationalism to broaden their domestic appeal. The Soviet government also began to increasingly promote Pan-Slavist sentiment. Stalin exploited Nazi anti-Semitism, and in April 1942 he sponsored the Jewish Anti-Fascist Committee (JAC) to garner Jewish and foreign support for the Soviet war effort.\n\nIn April 1942 Stalin overrode Stavka by ordering the Soviets' first serious counter-attack, an attempt to seize German-held Kharkov in eastern Ukraine. This attack proved unsuccessful. That year, Hitler shifted his primary goal from an immediate victory in the East, to the more long-term goal of securing the southern Soviet Union to conquer oil fields vital to a long-term German war effort. While Red Army generals saw evidence that Hitler would shift efforts south, Stalin considered this to be a flanking campaign in efforts to take Moscow. In June 1942, the German Army attacked Stalingrad; Stalin ordered the Red Army to hold the city at all costs. This resulted in the protracted Battle of Stalingrad. In December 1942 he placed Konstantin Rokossovski in charge of holding the city. In February 1943, the German troops attacking Stalingrad surrendered. The Soviet victory marked a major turning point in the war; in commemoration, Stalin declared himself Marshal of the Soviet Union.\n\nSoviet counter-attack: 1942–1945\n\nBy November 1942, the Soviets had begun to repulse the important German strategic southern campaign and, although there were 2.5 million Soviet casualties in that effort, it permitted the Soviets to take the offensive for most of the rest of the war on the Eastern Front. Germany attempted an encirclement attack at Kursk, which was successfully repulsed by the Soviets. By the end of 1943, the Soviets occupied half of the territory taken by the Germans from 1941 to 1942. Soviet military industrial output also had increased substantially from late 1941 to early 1943 after Stalin had moved factories well to the East of the front, safe from German invasion and air attack.\n\nIn Allied countries, Stalin was increasingly depicted in a positive light over the course of the war. In 1941, the London Philharmonic Orchestra performed a concert to celebrate his birthday, and in 1942, Time magazine named him \"Man of the Year\". When Stalin learned that people in Western countries affectionately called him \"Uncle Joe\" he was initially offended, regarding it as undignified.\nThere remained mutual suspicions between Stalin, British Prime Minister Winston Churchill, and U.S. President Franklin D. Roosevelt, who were together known as the \"Big Three\". Churchill flew to Moscow to visit Stalin in August 1942 and again in October 1944. Stalin scarcely left Moscow throughout the war, with Roosevelt and Churchill frustrated with his reluctance to travel to meet them.\n\nIn November 1943, Stalin met with Churchill and Roosevelt in Tehran, a location of Stalin's choosing. There, Stalin and Roosevelt got on well, with both desiring the post-war dismantling of the British Empire. At Tehran, the trio agreed that to prevent Germany rising to military prowess yet again, the German state should be broken up. Roosevelt and Churchill also agreed to Stalin's demand that the German city of Konigsberg be declared Soviet territory. Stalin was impatient for the UK and US to open up a Western Front to take the pressure off of the East; they eventually did so in the summer of 1944. Stalin insisted that, after the war, the Soviet Union should incorporate the portions of Poland it occupied pursuant to the Molotov-Ribbentrop Pact with Germany, which Churchill opposed. Discussing the fate of the Balkans, later in 1944 Churchill agreed to Stalin's suggestion that after the war, Bulgaria, Romania, Hungary, and Yugoslavia would come under the Soviet sphere of influence while Greece would come under that of the West.\n\nIn 1944, the Soviet Union made significant advances across Eastern Europe toward Germany, including Operation Bagration, a massive offensive in the Byelorussian SSR against the German Army Group Centre. In 1944 the German armies were pushed out of the Baltic states, which were then re-annexed into the Soviet Union. As the Red Army reconquered the Caucasus and Crimea, various ethnic groups living in the region—the Kalmyks, Chechens, Ingushi, Karachai, Balkars, and Crimean Tatars—were accused of having collaborated with the Germans. Using the idea of collective responsibility as a basis, Stalin's government abolished their autonomous republics and between late 1943 and 1944 deported the majority of their populations to Central Asia and Siberia. Over one million people were deported as a result of the policy.\n\nIn February 1945, the three leaders met at the Yalta Conference. Roosevelt and Churchill conceded to Stalin's demand that Germany pay the Soviet Union 20 billion dollars in reparations, and that his country be permitted to annex Sakhalin and the Kurile Islands in exchange for entering the war against Japan. An agreement was also made that a post-war Polish government should be a coalition consisting of both communist and conservative elements. Privately, Stalin sought to ensure that Poland would come fully under Soviet influence. The Red Army withheld assistance to Polish resistance fighters battling the Germans in the Warsaw Uprising, with Stalin believing that any victorious Polish militants could interfere with his aspirations to dominate Poland through a future Marxist government. Although concealing his desires from the other Allied leaders, Stalin placed great emphasis on capturing Berlin first, believing that this would enable him to bring more of Europe under long-term Soviet control. Churchill was concerned that this was the case, and unsuccessfully tried to convince the U.S. that the Western Allies should pursue the same goal.\n\nVictory: 1945\n\nIn April 1945, the Red Army seized Berlin, Hitler committed suicide, and Germany surrendered unconditionally. Stalin was annoyed that Hitler was dead, having wanted to capture him alive. He ordered his intelligence agencies to secretly bring Hitler's remains to Moscow, seeking to prevent any physical remains becoming a relic for Nazi sympathisers. As the Red Army had conquered German territory, they discovered the extermination camps that the Nazi administration had run. Many Soviet soldiers engaged in looting, pillaging, and rape, both in Germany and parts of Eastern Europe. Stalin refused to punish the offenders. After receiving a complaint about this from Yugoslav communist Milovan Djilas, Stalin asked how after experiencing the traumas of war a soldier could \"react normally? And what is so awful in his having fun with a woman, after such horrors?\"\n\nWith Germany defeated, Stalin switched his focus to the ongoing war with Japan, transferring half a million troops to the far east. Stalin was aware that the United States had developed nuclear weaponry, with which it intended to subdue the Japanese, and was steadfast in entering the war before he could be denied the territories promised to him. On 8 August, in between the atomic bombings of Hiroshima and Nagasaki, the Soviet army invaded Japanese occupied Manchuria and defeated the Kwantung Army. These events led to the Japanese surrender and the complete end of World War II. Soviet forces continued to expand until they occupied all their territorial concessions, but the U.S. rebuffed Stalin's desire for the Red Army to take a role in the occupation of Japan by Allied forces.\n\nStalin attended the Potsdam Conference in July–August 1945, alongside his new British and U.S. counterparts, Prime Minister Clement Attlee and President Harry Truman. At the beginning of the conference, Stalin repeated previous promises to Churchill that he would refrain from a \"Sovietization\" of Eastern Europe. Stalin pushed for reparations from Germany without regard to the base minimum supply for German citizens' survival, which worried Truman and Churchill who thought that Germany would become a financial burden for Western powers.\nHe also pushed for \"war booty\", which would permit the Soviet Union to directly seize property from conquered nations without quantitative or qualitative limitation, and a clause was added permitting this to occur with some limitations. Germany was divided into four zones: Soviet, U.S., British, and French, with Berlin itself—located within the Soviet area—also subdivided thusly.\n\nPost-war era\n\nPost-war reconstruction and famine: 1945–1947\n\nAfter the war, Stalin was—according to Service—at the \"apex of his career\". Within the Soviet Union he was widely regarded as the embodiment of victory and patriotism. His armies controlled eastern and eastern-central Europe up to the River Elbe.\nIn June 1945, Stalin adopted the title of Generalissimus, and stood atop Lenin's Mausoleum to watch a celebratory parade led by Zhukov through Red Square. At a banquet held for army commanders, he described the Russian people as \"the outstanding nation\" and \"leading force\" within the Soviet Union, the first time that he had unequivocally endorsed the Russians over other Soviet nationalities. In 1946, the state published Stalin's Collected Works. In 1947, it brought out a second edition of his official biography, which eulogised him to a greater extent than its predecessor. He was quoted in Pravda on a daily basis and pictures of him remained pervasive on the walls of workplaces and homes.\n\nDespite his strengthened international position, Stalin was cautious about internal dissent and desire for change among the population. He was also concerned about his returning armies, who had been exposed to a wide range of consumer goods in Germany, much of which they had looted and brought back with them. In this he recalled the 1825 Decembrist Revolt by Russian soldiers returning from having defeated France in the Napoleonic Wars. He ensured that returning Soviet prisoners of war went through \"filtration\" camps as they arrived in the Soviet Union, in which 2,775,700 were interrogated to determine if they were traitors. About half were then imprisoned in labour camps. In the Baltic states, where there was much opposition to Soviet rule, de-kulakisation and de-clericalisation programs were initiated, resulting in 142,000 deportations between 1945 and 1949.\n\nThe NKVD were ordered to catalogue the scale of destruction during the war. It was established that 1,710 Soviet towns and 70,000 villages had been destroyed. They recorded that between 26 and 27 million Soviet citizens had been killed, with millions more being wounded, malnourished, or orphaned. In the war's aftermath, some of Stalin's associates suggested modifications to government policy. Post-war Soviet society was more tolerant than its pre-war phase in various respects. Stalin allowed the Russian Orthodox Church to retain the churches it had opened during the war. Academia and the arts were also allowed greater freedom than they had prior to 1941. Recognising the need for drastic steps to be taken to combat inflation and promote economic regeneration, in December 1947 Stalin's government devalued the ruble and abolished the ration-book system. Capital punishment was abolished in 1947 but reinstalled in 1950.\n\nStalin's health was deteriorating, and heart problems forced a two-month vacation in the latter part of 1945.\nHe grew increasingly concerned that senior political and military figures might try to oust him; he prevented any of then from becoming powerful enough to rival him and had their apartments bugged with listening devices. He demoted Molotov, and increasingly favoured Beria and Malenkov for key positions. In 1949, he brought Nikita Khrushchev from Ukraine to Moscow, appointing him a Central Committee secretary and the head of the city's party branch. In the Leningrad Affair, the city's leadership was purged amid accusations of treachery; executions of many of the accused took place in 1950.\n\nIn the post-war period there were often food shortages in Soviet cities, and the USSR experienced a major famine from 1946 to 1947. Sparked by a drought and ensuing bad harvest in 1946, it was exacerbated by government policy towards food procurement, including the state's decision to build up stocks and export food internationally rather than distributing it to famine hit areas. Current estimates indicate that between 1 million and 1.5 million people died from malnutrition or disease as a result. While agricultural production stagnated, Stalin focused on a series of major infrastructure projects, including the construction of hydroelectric plants, canals, and railway lines running to the polar north. Much of this was constructed by prison labour.\n\nCold War policy: 1947–1950\n\nIn the aftermath of the Second World War, the British Empire declined, leaving the US and USSR as the dominant world powers. Tensions among these former Allies grew, resulting in the Cold War. Although publicly referring to what Stalin regarded as the aggressive nature of the British and U.S. governments, he thought it unlikely that a war with them would be imminent, believing that several decades of peace was likely. He nevertheless secretly intensified Soviet research into nuclear weaponry, intent on creating an atom bomb. He personally took a keen interest in the development of the weapon. In August 1949, the bomb was successfully tested in the deserts outside Semipalatinsk in Kazakhstan. Stalin also initiated a new military build-up; the Soviet army was expanded from 2.9 million soldiers, as it stood in 1949, to 5.8 million by 1953.\n\nThe US began pushing its interests on every continent, acquiring air force bases in Africa and Asia and ensuring pro-U.S. regimes took power across Latin America. It launched the Marshall Plan in June 1947, with which it sought to undermine Soviet hegemony in eastern Europe. The US also offered financial assistance as part of the Marshall Plan on the condition that they opened their markets to trade, aware that the Soviets would never agree.\nThe Allies demanded that Stalin withdraw the Red Army from northern Iran, which he did in April 1947.\nStalin also tried to maximise Soviet influence on the world stage, unsuccessfully pushing for Libya—recently liberated from Italian occupation—to become a Soviet protectorate. He sent Molotov as his representative to San Francisco to take part in negotiations to form the United Nations, insisting that the Soviets have a place on the Security Council. In April 1949, the Western powers established the North Atlantic Treaty Organisation (NATO), an international military alliance of capitalist countries. Within Western countries, Stalin was increasingly portrayed as the \"most evil dictator alive\" and compared to Hitler.\n\nIn 1948, Stalin edited and rewrote sections of Falsifiers of History, published as a series of Pravda articles in February 1948 and then in book form. Written in response to public revelations of the 1939 Soviet alliance with Germany, it focused on blaming Western powers for the war. He erroneously claimed that the initial German advance in the early part of the war was not a result of Soviet military weakness, but rather a deliberate Soviet strategic retreat. In 1949, celebrations took place to mark Stalin's seventieth birthday (albeit not the correct year) at which Stalin attended an event in the Bolshoi Theatre alongside communist leaders from across Europe and Asia.\n\nThe Eastern Bloc\n\nAfter the war, Stalin sought to retain Soviet dominance across Eastern Europe while expanding its influence in Asia.\nCautious regarding the responses from the Western Allies, Stalin avoided immediately installing Communist Party governments across Eastern Europe, instead initially ensuring that Marxist-Leninists were placed in coalition ministries. In contrast to his approach to the Baltic states, he rejected the proposal of merging these states into the Soviet Union, rather recognising them as independent nation-states.\nHe was faced with the problem that there were few Marxists left in Eastern Europe, with most having been killed by the Nazis. He demanded that war reparations be paid by Germany and its Axis allies Hungary, Romania, and the Slovak Republic.\nAware that these countries had been pushed toward socialism through invasion rather than by proletarian revolution, Stalin referred to them not as \"dictatorships of the proletariat\" but as \"people's democracies\", suggesting that in these countries there was a pro-socialist alliance combining the proletariat, peasantry, and lower middle-class.\n\nChurchill observed that an \"Iron Curtain\" had been drawn across Europe, separating the east from the west. In September 1947, a meeting of East European leaders was held in Szklarska Poręba, Poland, from which was formed Cominform to co-ordinate the Communist Parties across Eastern Europe and also in France and Italy. Stalin did not personally attend the meeting, sending Zhdanov in his place. Various East European communists also visited Stalin in Moscow. There, he offered advice on their ideas; for instance he cautioned against the Yugoslav idea for a Balkan federation incorporating Bulgaria and Albania. Stalin had a particularly strained relationship with Yugoslav leader Josip Broz Tito due to the latter's continued calls for Balkan federation and for Soviet aid for the communist forces in the ongoing Greek Civil War. In March 1948, Stalin launched an anti-Tito campaign, accusing the Yugoslav communists of adventurism and deviating from Marxist–Leninist doctrine. At the second Cominform conference, held in Bucharest in June 1948, East European communist leaders all denounced Tito's government, accusing them of being fascists and agents of Western capitalism. Stalin ordered several assassination attempts on Tito's life and contemplated invading Yugoslavia.\n\nStalin suggested that a unified, but demilitarised, German state be established, hoping that it would either come under Soviet influence or remain neutral. When the US and UK remained opposed to this, Stalin sought to force their hand by blockading Berlin in June 1948. He gambled that the others would not risk war, but they airlifted supplies into West Berlin until May 1949, when Stalin relented and ended the blockade. In September 1949 the Western powers transformed Western Germany into an independent Federal Republic of Germany; in response the Soviets formed East Germany into the German Democratic Republic in October. In accordance with their earlier agreements, the Western powers expected Poland to become an independent state with free democratic elections. In Poland, the Soviets merged various socialist parties into the Polish United Workers' Party, and vote rigging was used to ensure that it secured office. The 1947 Hungarian elections were also rigged, with the Hungarian Working People's Party taking control. In Czechoslovakia, where the communists did have a level of popular support, they were elected the largest party in 1946.\nAcross Eastern Europe, the Soviet model was enforced, with a termination of political pluralism, agricultural collectivisation, and investment in heavy industry. It was aimed for economic autarky within the Eastern Bloc. Monarchies were removed from power in Romania and Bulgaria.\n\nAsia\n\nIn October 1949, Mao took took power in China. With this accomplished, Marxist governments now controlled a third of the world's land mass. Privately, Stalin revealed that he had underestimated the Chinese Communists and their ability to win the civil war, instead encouraging them to make another peace with the KMT. In December 1949, Mao visited Stalin. Initially Stalin refused to repeal the Sino-Soviet Treaty of 1945, which significantly benefited the Soviet Union over China, although in January 1950 he relented and agreed to sign a new treaty between the two countries. Stalin was concerned that Mao might follow Tito's example by pursuing a course independent of Soviet influence, and made it known that if displeased he would withdraw assistance from China; the Chinese desperately needed said assistance after decades of civil war.\n\nAfter the Second World War, the Soviet Union and the United States divided up the Korean Peninsula, formerly a Japanese colonial possession, along the 38th parallel, setting up a communist government in the north and a pro-Western government in the south. North Korean leader Kim Il-Sung visited Stalin in March 1949 and again in March 1950; he wanted to invade the south and although Stalin was initially reticent to provide support, he eventually agreed by May 1950. The North Korean Army launched the Korean War by invading the south in June 1950, making swift gains and capturing Seoul. Both Stalin and Mao believed that a swift victory would ensue. The U.S. went to the UN Security Council—which the Soviets were boycotting over its refusal to recognise Mao's government—and secured military support for the South Koreans. U.S. led forces pushed the North Koreans back. Stalin wanted to avoid direct Soviet conflict with the U.S., convincing the Chinese to hold the 38th Parallel.\n\nPolicy towards Jews and Israel\n\nThe Soviet Union was one of the first nations to extend diplomatic recognition to the newly created state of Israel in 1948. However, when the Israeli ambassador Golda Meir arrived in the USSR, Stalin was angered by the Jewish crowds who arrayed to greet her. He was further angered by Israel's growing alliance with the U.S. After Stalin fell out with Israel, he launched an anti-Jewish campaign within the Soviet Union and the Eastern Bloc. In November 1948, he abolished the JAC, and show trials took place for some of its members. The Soviet press engaged in attacks on Zionism, Jewish culture, and \"rootless cosmopolitanism\", with growing levels of anti-Semitism being expressed across Soviet society.\n\nStalin's increasing tolerance of anti-Semitism may have stemmed from his increasing Russian nationalism or from the recognition that anti-Semitism had proved a useful mobilising tool for Hitler and that he could do the same; he may have increasingly viewed the Jewish people as a \"counter-revolutionary\" nation whose members were loyal to the U.S. There were rumours, although they have never been substantiated, that Stalin was planning on deporting all Soviet Jews to the Jewish Autonomous Region in Birobidzhan, eastern Siberia.\n\nFinal years: 1950–1953\n\nIn his later years, Stalin was in poor health. He took increasingly long holidays; in 1950 and again in 1951 he spent almost five months vacationing at his Abkhazian dacha. Stalin nevertheless mistrusted his doctors; in January 1952 he had one imprisoned after they suggested that he should retire to improve his health. In September 1952, several Kremlin doctors were arrested for allegedly plotting to kill senior politicians in what came to be known as the Doctors' Plot; the majority of the accused were Jewish.Ro'i, Yaacov, Jews and Jewish Life in Russia and the Soviet Union, Routledge, 1995, , pp. 103–6 He instructed the arrested doctors to be tortured to ensure confession. In November, the Slánský trial took place in Czechoslovakia as 13 senior Communist Party figures, 11 of them Jewish, were accused and convicted of being part of a vast Zionist-American conspiracy to subvert Eastern Bloc governments. That same month, a much publicised trial of accused Jewish industrial wreckers took place in Ukraine. In 1951, he initiated the Mingrelian affair, a purge of the Georgian branch of the Communist Party which resulted in over 11,000 deportations.\n\nFrom 1946 until his death, Stalin only gave three public speeches, two of which lasted only a few minutes. The amount of written material that he produced also declined. In 1950, Stalin issued the article \"Marxism and Problems of Linguistics\", which reflected his interest in questions of Russian nationhood.\nIn 1952, Stalin's last book, The Economic Problems of Socialism in the USSR, was published. It sought to provide a guide to leading the country for after his death. In October 1952, Stalin gave an hour and a half speech at the Central Committee plenum. There, he emphasised what he regarded as leadership qualities necessary in the future and highlighted the weaknesses of various potential successors, particularly Molotov and Mikoyan. In 1952, he also eliminated the Politburo and replaced it with a larger version which he called the Presidium.\n\nDeath and funeral: 1953\n\nOn 1 March 1953, Stalin's staff found him semi-conscious on the bedroom floor of his Volynskoe dacha, having urinated on himself. He had suffered a cerebral hemorrhage. He was moved onto a couch and remained there for three days. He was hand-fed using a spoon, given various medicines and injections, and leeches were applied to him. Svetlana and Vasily were called to the dacha on 2 March; the latter was drunk and angrily shouted at the doctors, resulting in him being sent home. Stalin died on 5 March 1953. According to Svetlana, it had been \"a difficult and terrible death\".\n\nAn autopsy revealed that he had died of a cerebral haemorrhage and that he also suffered from severe damage to his cerebral arteries due to atherosclerosis. It is possible that Stalin was murdered. Beria has been suspected of murder, although no firm evidence has ever appeared. \n\nStalin's death was announced on 6 March. The body was embalmed for long-term preservation, and then placed on display in Moscow's House of Unions for three days. Crowds were such that a crush killed around 100 people. The subsequent funeral involved the body being laid to rest in Lenin's Mausoleum in Red Square on 9 March. Hundreds of thousands attended. That month featured a surge in arrests for \"anti-Soviet agitation\" as those celebrating Stalin's death came to police attention. The Chinese government instituted a period of official mourning for Stalin's death.\n\nAftermath: 1953–1961\n\nStalin left no anointed successor nor a framework within which a transfer of power could take place. The Central Committee met on the day of his death, with Malenkov, Beria, and Khruschev emerging as the party's key figures. The system of collective leadership was restored, and measures introduced to prevent any one member attaining autocratic domination again. Reforms to the Soviet system were immediately implemented. Economic reform scaled back the mass construction projects, placed a new emphasis on house building, and eased the levels of taxation on the peasantry to stimulate production. The new leaders sought rapprochement with Yugoslavia and a less hostile relationship with the U.S., pursuing a negotiated end to the Korean War in July 1953. The doctors who had been imprisoned were released and the anti-Semitic purges ceased. A mass amnesty for those imprisoned for non-political crimes was issued, halving the country's inmate population, while the state security and Gulag systems were reformed, with torture being banned in April 1953.\n\nIn March, Malenkov denounced the Stalin personality cult. Pravda restrained its praise of Stalin and began to criticise his personality cult. Stalingrad was renamed Volgograd, while Svetlana changed her surname from Stalin to Allilueva. \nIn 1956, Khruschev gave his \"Secret Speech\", titled \"On the Cult of Personality and Its Consequences\", to a closed session of the Party's 20th Congress. There, Khrushchev denounced Stalin for both his mass repression and his personality cult. He repeated these denunciations at the 22nd Party Congress in October 1962. In October 1961, Stalin's body was removed from the mausoleum and buried in the Kremlin Wall Necropolis next to the Kremlin walls, the location marked only by a simple bust.\n\nPolitical ideology\n\nStalin claimed to have embraced Marxism at the age of fifteen, and it served as the guiding philosophy throughout his adult life; according to Montefiore, it held a \"quasi-religious\" value for Stalin. Although he never became a Georgian nationalist, during his early life elements from Georgian nationalist thought blended with Marxism in his outlook. The historian Alfred J. Rieber noted that he had been raised in \"a society where rebellion was deeply rooted in folklore and popular rituals\". In 1917, Stalin wrote that \"there is dogmatic Marxism and there is creative Marxism. I stand on the ground of the latter\". Volkogonov however believed that Stalin's Marxism was shaped by his \"dogmatic turn of mind\", suggesting that this had been instilled in the Soviet leader during his education in religious institutions. According to scholar Robert Service, Stalin's \"few innovations in ideology were crude, dubious developments of Marxism\". Some of these derived from political expediency rather than any sincere intellectual commitment; Stalin would often turn to ideology post hoc to justify his decisions. Stalin referred to himself as a praktik, meaning that he was more of a practical revolutionary than a theoretician.\n\nAs a Marxist, Stalin believed in an inevitable class war between the world's working and middle classes. He believed that the working classes would prove successful in this struggle and would establish a dictatorship of the proletariat, regarding the Soviet Union as an example of such a state. He also believed that this proletarian state would need to introduce repressive measures to ensure the full crushing of the propertied classes, and thus the class war would intensify with the advance of socialism. The new state would then be able to ensure that all citizens had access to work, food, shelter, healthcare, and education, with the wastefulness of capitalism eliminated by a new, standardised economic system. According to Sandle, Stalin was \"committed to the creation of a society that was industrialized, collectivized, centrally planned and technologically advanced.\"\n\nStalin claimed to be a loyal Leninist. Nevertheless, he was—according to Service—\"not a blindly obedient Leninist\". Stalin respected Lenin, but not uncritically, and spoke out when he believed that Lenin was wrong. During the period of his revolutionary activity, Stalin regarded some of Lenin's views and actions as being the self-indulgent activities of a spoiled émigré, deeming them counterproductive for those Bolshevik activists based within the Russian Empire itself. After the October Revolution, they continued to have differences. Whereas Lenin believed that all countries across Europe and Asia would readily unite as a single state following proletariat revolution, Stalin argued that national pride would prevent this, and that different socialist states would have to be formed; in his view, a country like Germany would not readily submit to being part of a Russian-dominated federal state. Stalin biographer Oleg Khlevniuk nevertheless believed that the pair developed a \"strong bond\" over the years, and after Lenin's death, Stalin relied heavily on Lenin's writings—far more so than those of Marx and Engels—to guide him in the affairs of state. Stalin adopted the Leninist view on the need for a revolutionary vanguard who could lead the proletariat rather than being led by them. Leading this vanguard, he believed that the Soviet peoples needed a strong, central figure—akin to a Tsar—whom they could rally around. In his words, \"the people need a Tsar, whom they can worship and for whom they can live and work\". He read about, and admired, two Tsars in particular: Ivan the Terrible and Peter the Great.\n\nStalinism was a development of Leninism, and while Stalin avoided using the term \"Marxism-Leninism-Stalinism\", he allowed others to do so. Following Lenin's death, Stalin contributed to the theoretical debates within the Communist Party, namely by developing the idea of \"socialism in one country\". This concept was intricately linked to factional struggles within the party, particularly against Trotsky. He first developed the idea in December 1924 and elaborated upon in his writings of 1925–26. Stalin's doctrine held that socialism could be completed in Russia but that its final victory there could not be guaranteed because of the threat from capitalist intervention. For this reason, he retained the Leninist view that world revolution was still a necessity to ensure the ultimate victory of socialism. Although retaining the Marxist belief that the state would wither away as socialism transformed into pure communism, he believed that the Soviet state would remain until the final defeat of international capitalism. This concept synthesised Marxist and Leninist ideas with nationalist ideals, and served to discredit Trotsky—who promoted the idea of \"permanent revolution\"—by presenting the latter as a defeatist with little faith in Russian workers' abilities to construct socialism.\n\nStalin viewed nations as contingent entities which were formed by capitalism and could merge into others. Ultimately he believed that all nations would merge into a single, global human community, and regarded all nations as inherently equal. Stalin argued that the Jews possessed a \"national character\" but were not a \"nation\" and were thus unassimilable. He argued that Jewish nationalism, particularly Zionism, was hostile to socialism. In his work, he stated that \"the right of secession\" should be offered to the ethnic-minorities of the Russian Empire, but that they should not be encouraged to take that option. He was of the view that if they became fully autonomous, then they would end up being controlled by the most reactionary elements of their community; as an example he cited the largely illiterate Tatars, whom he claimed would end up dominated by their mullahs. Khlevniuk therefore argued that Stalin reconciled Marxism with imperialism.\nAccording to Service, Stalin's Marxism was imbued with a great deal of Russian nationalism. However, according to Montefiore, Stalin's embrace of the Russian nation was pragmatic, as the Russians were the core of the population of the USSR; it was not a rejection of his Georgian origins. Stalin's push for Soviet westward expansion into eastern Europe resulted in accusations of Russian imperialism.\n\nPersonal life and characteristics \n\nIn adulthood, Stalin measured 5 ft tall. To give the impression that he was taller, he wore stacked shoes, and stood on a small wooden platform during parades. His mustached face was pock-marked from smallpox during childhood. He was born with a webbed left foot, and his left arm had been permanently injured in childhood which left it shorter than his right and lacking in flexibility, which was probably the result of being hit, at the age of 12, by a horse-drawn carriage.\n\nDuring his youth, Stalin usually wore a red satin shirt, grey coat, and red fedora, or alternatively a traditional Georgian chokha and white hood. At the time he grew his hair long and often had a beard. His cultivation of a scruffy appearance deliberately sought to reject middle-class aesthetic values. After the summer of 1918 until his death he took to wearing military-style clothing, in particular long black boots and a light-coloured collarless tunics, and also carried a gun. He had few material demands and lived plainly, with simple and inexpensive clothing and furniture; his interest was in power rather than wealth. He was a lifelong smoker, who smoked both a pipe and cigarettes.\n\nStalin was ethnically Georgian, and had grown up speaking the Georgian language, only learning Russian when aged eight or nine. Stalin remained proud of his Georgian identity and culture, and throughout his life, he retained his Georgian accent when speaking Russian. According to Montefiore, his adoption of Russian culture has been exaggerated, and he was profoundly Georgian in his lifestyle and personality, spending much of his final years in his homeland. Montefiore was of the view that \"after 1917, he became quadri-national: Georgian by nationality, Russian by loyalty, internationalist by ideology, Soviet by citizenship.\" Service stated that Stalin \"would never be Russian\", could not credibly pass as one and contrary to what has been previously suggested, he never really tried to be one. Stalin was described as \"Asiatic\" by his colleagues, and told a Japanese journalist, \"I am not a European man, but an Asian, a Russified Georgian\". He first adopted the pseudonym \"Stalin\" in 1912; being based on the Russian word for \"steel\" it has often been translated as \"Man of Steel\". Prior nicknames included \"Koba\", \"Soselo\", \"Ivanov\" and many others.\n\nStalin had a soft voice, and when speaking Russian he did so slowly, carefully choosing his phrasing. Although he avoided doing so in public, in private Stalin used coarse language. Described as a poor orator, according to Volkogonov, Stalin's speaking style was \"simple and clear, without flights of fancy, catchy phrases or platform histrionics\". He rarely spoke before large audiences, and preferred to express himself in written form. His writing style was similar, being characterised by its simplicity, clarity, and conciseness.\n\nPersonality\n\nTrotsky and several other Soviet figures promoted the idea that Stalin was a mediocrity. This idea gained widespread acceptance outside the Soviet Union but was misleading. According to Montefiore, \"it is clear from hostile and friendly witnesses alike that Stalin was always exceptional, even from childhood\". Stalin had a complex mind, with a great deal of self-control. He rarely raised his voice in anger, although as his health declined in later life he became increasingly unpredictable and bad tempered. A hard worker, he displayed a keen desire to learn, and had an excellent memory. When in power, he scrutinised many details of Soviet life, from film scripts to architectural plans and military hardware.\n\nStalin was a capable actor who could play many different roles to different audiences, and was adept at deception, often lying or deceiving others as to his true motives and aims. He was a good organiser, and judged others according to their inner strength, practicality, and cleverness. Despite his short temper and tough-talking attitude, he could be very charming; when relaxed, he cracked jokes and mimicked others. Montefiore suggested that it was his charm which represented \"the foundation of Stalin's power in the Party\". Several historians have seen it appropriate to follow Lazar Kaganovich's description of there being \"several Stalins\" as a means of understanding his multi-faceted personality.\n\nStalin was ruthless, temperamentally cruel,  and had a propensity for violence excessive even among the Bolsheviks. He lacked compassion, something which Volkogonov suggested might have been accentuated by his many years spent in prison and exile, although he was capable of acts of kindness to strangers, even amid the Great Terror. He never personally attended any torture sessions or executions. Service stated that Stalin \"derived deep satisfaction\" from degrading and humiliating people, and that he \"delighted\" in keeping even close associates in a state of \"unrelieved fear\". He was capable of self-righteous indignation, and was both resentful, and vengeful, holding onto grievances against others for many years. He was also suspicious and conspiratorial, prone to believing that people were plotting against him and that there were vast international conspiracies behind acts of dissent. Montefiore thought that Stalin's brutality marked him out as a \"natural extremist\"; Service suggested that he had a paranoid or sociopathic personality disorder, with this \"dangerously damaged\" personality supplying \"the high-octane fuel for the journey to the Great Terror\". Other historians have argued that Stalin's brutality should be seen not as a result of any personality traits, but through his unflinching commitment to the survival of his socialist state and the cause of international socialism. By the period of glasnost and perestroika, Soviet psychologists were openly debating whether Stalin had been insane.\n\nStalin admired artistic talent, and protected several Soviet writers, such as Mikhail Bulgakov, even when their work was regarded as harmful to his regime. He enjoyed listening to music, and owned around 2,700 albums. His taste in music and theatre was conservative, favouring classical drama, opera, and ballet over what he dismissed as experimental \"formalism\". He was a voracious reader, with a library of over 20,000 books. Little of this was fiction, although he knew passages from the work of Alexander Pushkin and Nikolay Nekrasov by heart and could also recite Walt Whitman. He favoured historical studies, keeping up with debates in the study of Russian, Mesopotamian, ancient Roman, and Byzantine history. He claimed to read as many as 500 pages a day, with Montefiore regarding him as an accomplished autodidact and intellectual.\n\nStalin typically awoke at around 11am, and worked late into the evening. His main meal was lunch, which took place between 3 and 5pm, while dinner was held no earlier than 9pm. He often chose to dine with other Politburo members and their wives who lived in the Kremlin. He spent much time in the Kremlin cinema, where he enjoyed watching films with other officials late at night; he had a particular fondness for the Western genre, although his favourite film was the 1938 film Volga Volga. Stalin enjoyed alcoholic beverages, and at dinner parties and other social events would encourage those around him to join in, hoping that in a drunken state they would reveal secrets. He enjoyed practical jokes, for instance by putting a tomato on the seat of Politburo members and waiting for them to sit on it, and encouraged singing at social events. As an infant, Stalin had displayed a love of flowers, and later in life he became a keen gardener. His dacha in the Moscow suburb of Volynskoe was surrounded by a 50-acre park, with Stalin devoting much attention to its agricultural activities. Stalin also enjoyed billiards and was an accomplished player.\n\nStalin disliked travel, and refused to travel by plane. As leader of the USSR, he rarely left Moscow, unless to go to his dacha or on holiday. His choice of favoured holiday house changed over the years, although he holidayed in southern parts of the USSR every year from 1925 to 1936 and again from 1945 to 1951. Along with other senior figures, he had a dacha at Zubalova, 35 km outside Moscow, although he ceased using it after Nadya's 1932 suicide. After 1932, he favoured Abkhazia as a holiday destination, being a friend of its leader, Nestor Lakoba. In 1934, his new  Kuntsevo Dacha was built; 9 km from the Kremlin, it became his primary residence. In 1935 he began using a new dacha provided for him by Lakoba at Novy Afon; in 1936, he had the Kholodnaya Rechka dacha built on the Abkhazian coast, designed by Miron Merzhanov. Before World War II he added the Lipki estate and Semyonovskaya and had at least four dachas in the south by 1937, including one near Sochi. A luxury villa near Gagri was given to him by Beria. In Abkhazia he maintained a mountain retreat. After the war he added dachas at Novy Afon, near Sukhumi, in the Valdai Hills, and at Lake Mitsa. Another estate was near Zelyony Myss on the Black Sea. All these dachas, estates, and palaces were staffed, well-furnished and equipped, kept safe by security forces, and were mainly used privately, rarely for diplomatic purposes.\n\nAlthough Stalin publicly condemned anti-Semitism, he was repeatedly accused of being anti-Semitic. People who knew Stalin, such as Nikita Khrushchev, suggested that he had long harbored negative sentiments toward Jews, and anti-Semitic trends in the Kremlin's policies were further fueled by the struggle against Leon Trotsky. After Stalin's death, Khrushchev made the claim that Stalin hinted that he should incite anti-Semitism in the Ukraine, allegedly telling him that \"the good workers at the factory should be given clubs so they can beat the hell out of those Jews.\" In 1946, Stalin allegedly said privately that \"every Jew is a potential spy.\" Conquest stated that although Stalin had Jewish associates, he promoted anti-Semitism. Service cautioned that there was \"no irrefutable evidence\" of anti-Semitism in Stalin's published work, although his private statements and public actions were \"undeniably reminiscent of crude antagonism towards Jews\"; he added that throughout his lifetime, Stalin \"would be the friend, associate or leader of countless individual Jews\". According to Beria, Stalin had affairs with several Jewish women.\n\nRelationships and family\n\nFriendship was important to Stalin, and he used it to gain and maintain power. He gave nicknames to his favourites, for instance referring to Yezhov as \"my blackberry\". Stalin was sociable and enjoyed a joke. According to Montefiore, Stalin's friendships \"meandered between love, admiration, and venomous jealousy\". While head of the Soviet Union he remained in contact with many of his old friends in Georgia, sending them letters and gifts of money.\n\nStalin was attracted to women and there are no reports of any homosexual tendencies; according to Montefiore, in his early life Stalin \"rarely seems to have been without a girlfriend\". He was sexually promiscuous, although rarely talked about his sex life. Montefiore noted that Stalin's favoured types were \"young, malleable teenagers or buxom peasant women\", who would be supportive and unchallenging toward him. According to Service, Stalin \"regarded women as a resource for sexual gratification and domestic comfort\". Stalin married twice and had several offspring. He married his first wife, Ekaterina Svanidze, in 1906. According to Montefiore, theirs was \"a true love match\"; Volkogonov suggested that she was \"probably the one human being he had really loved\". They had a son, Yakov, who often frustrated and annoyed Stalin. Yakov had a daughter, Galina, before fighting for the Red Army in the Second World War. He was captured by the German Army and then committed suicide.\n\nStalin's second wife was Nadezhda Alliluyeva; theirs was not an easy relationship, and they often rowed. They had two biological children—a son, Vasiliy, and a daughter, Svetlana—and adopted another son, Artyom Sergeev, in 1921. During his marriage to Nadezhda, Stalin had affairs with many other women, most of whom were fellow revolutionaries or their wives. Nadezdha suspected that this was the case, and committed suicide in 1932. Stalin regarded Vasily as spoiled and often chastised his behaviour; as Stalin's son, Vasily nevertheless was swiftly promoted through the ranks of the Red Army and allowed a lavish lifestyle. Conversely, Stalin had an affectionate relationship with Svetlana during her childhood, and was also very fond of Artyom. In later life, he disapproved of Svetlana's various suitors and husbands, putting a strain on his relationship with her. After the Second World War he made little time for his children and his family played a decreasingly important role in his life. After Stalin's death, Svetlana defected to the U.S.\n\nAfter Nadezdha's death, Stalin became increasingly close to his sister-in-law Zhenya Alliluyeva; Montefiore believed that they were probably lovers. There are unproven rumours that from 1934 onward he had a relationship with his housekeeper Valentina Istomina. Stalin had at least two illegitimate children, although he never recognised these as being his. One of these, Constantin Kuzakova, later taught philosophy at the Leningrad Military Mechanical Institute, but never met his father. The other, Alexander, was the son of Lidia Pereprygia; he was raised as the son of a peasant fisherman and the Soviet authorities made him swear never to reveal that Stalin was his biological father.\n\nLegacy\n\nThe historian Robert Conquest stated that Stalin, \"perhaps more than any other [person,] determined the course of the twentieth century\". Service regarded the Georgian as \"one of the twentieth century's outstanding politicians\".\nMontefiore labelled Stalin as \"that rare combination: both 'intellectual' and killer\", a man who was \"the ultimate politician\" and \"the most elusive and fascinating of the twentieth-century titans\". According to historian Kevin McDermott, interpretations of Stalin range from \"the sycophantic and adulatory to the vitriolic and condemnatory\". For most Westerners and anti-communist Russians, he is viewed overwhelmingly negatively as a mass murderer; for significant numbers of Russians and Georgians, he is regarded as a great statesman and state-builder.\n\nStalin strengthened and stabilised the Soviet Union. Service suggested that without Stalin's leadership the Soviet Union might have collapsed long before 1991. By the time of his death, the country had been transformed into a world power and industrial colossus, with a literate population. According to Service, Stalin's USSR \"could claim impressive achievements\" in terms of urbanisation, military strength, education, and Soviet pride. Although millions of Soviet citizens despised him, support for him was nevertheless widespread throughout Soviet society.\n\nStalin's Soviet Union has been characterised as totalitarian. Various biographers have described him as a dictator, an autocrat, or accused him of practicing Caesarism. Montefiore argued that while Stalin initially ruled as part of a Communist Party oligarchy, in 1934 the Soviet government transformed from this oligarchy into a personal dictatorship, with Stalin only becoming \"absolute dictator\" between March and June 1937, when senior military and NKVD figures were eliminated. In both the Soviet Union and elsewhere he came to be portrayed as an \"Oriental despot\". The biographer Dmitri Volkogonov characterised him as \"one of the most powerful figures in human history\", while McDermott stated that Stalin had \"concentrated unprecedented political authority in his hands\", and Service noted that by the late 1930s, Stalin \"had come closer to personal despotism than almost any monarch in history\".\n\nMcDermott nevertheless cautioned about \"over-simplistic stereotypes\"—promoted in the fiction of writers like Aleksandr Solzhenitsyn, Vasily Grossman, and Anatoly Rybakov—that portrayed Stalin as an omnipotent and omnipresent tyrant who controlled every aspect of Soviet life through repression and totalitarianism. Service similarly warned of the portrayal of Stalin as an \"unimpeded despot\", noting that \"powerful though he was, his powers were not limitless\", and his rule depended on his willingness to conserve the Soviet structure he had inherited. Khlevniuk noted that at various points, particularly when Stalin was old and frail, there were \"periodic manifestations\" in which the party oligarchy threatened his autocratic control. Stalin denied to foreign visitors that he was a dictator, stating that those who labelled him such did not understand the Soviet governance structure. Stalin has also been described as a terrorist for his revolutionary activities in Georgia.\n\nA vast literature devoted to Stalin has been produced; it is so substantial that even specialists could not read it all.\nDuring Stalin's lifetime, his approved biographies were largely hagiographic in content. Stalin ensured that these works gave very little attention to his early life, particularly because he did not wish to emphasise his Georgian origins in a state numerically dominated by Russians. A large number of Stalin biographies have been published since his death. Until the 1980s, these relied largely on the same sources of information as each other. Under the administration of Mikhail Gorbachev a number of previously classified files on Stalin's life were made available to historians; during Gorbachev's glasnost period, Stalin became \"one of the most urgent and vital issues on the public agenda\" in the Soviet Union. After the dissolution of the Union in 1991, the rest of the archives were opened to historians, resulting in much new information about Stalin coming to light, and producing a flood of new research. \n\nLeninists remain divided in their views on Stalin. Some view him as the authentic successor to Lenin, who continued and developed his legacy, while others believe that Stalin betrayed Lenin's ideas by deviating from them. The socio-economic nature of Stalin's Soviet Union has also been much debated, varyingly being labelled a form of state socialism, state capitalism, bureaucratic collectivism, or a totally unique mode of production.\n\nDeath toll and allegations of genocide\n\nAccording to Service, Stalin was \"one of the most notorious figures in history\", one who ordered \"the systematic killing of people on a massive scale\". Khlevniuk stated that Stalin's actions \"upended or utterly destroyed literally millions upon millions of lives\". Official records show that 800,000 were shot in the Soviet Union between 1930 and 1952, although a larger number died during torture or as a result of poor conditions in labour camps. Many more died as a result of famines and starvation; particularly during the 1932–33 famine.\n\nMontefiore suggested that Stalin was ultimately responsible for the deaths of between 20 and 25 million people, with Khlevniuk stating that at least 60 million people faced some form of repression or discrimination under Stalin's regime. In his 2008 edition of The Great Terror, Conquest stated that \"at least 15 million people\" were killed by \"the whole range of Soviet regime's terrors\", although acknowledged that exact numbers will never be known. The historian and archival researcher Stephen G. Wheatcroft attributes roughly 3 million deaths to the Stalinist regime, including those from criminal negligence but excluding famine deaths, which he and historian R. W. Davies estimate to be around 5.5 to 6.5 million. American historian Timothy D. Snyder asserts that while the Nazi regime killed 11–12 million non-combatants, Stalin's was responsible for about 6–9 million, disputing the conventional wisdom that Stalin killed more than Hitler.\n\nHistorians continue to debate whether or not the Holodomor should be called a genocide.Rebekah Moore,  \"'A Crime Against Humanity Arguably Without Parallel in European History': Genocide and the 'Politics' of Victimhood in Western Narratives of the Ukrainian Holodomor.\" Australian Journal of Politics & History 58#3 (2012): 367-379; Laura C. Collins, \"Book Review: The Holodomor Reader: A Sourcebook on the Famine of 1932–1933 in Ukraine,\" Genocide Studies and Prevention: An International Journal (2015) 9#1 : 114–115 [http://scholarcommons.usf.edu/cgi/viewcontent.cgi?article1320&context\ngsp online].  In any case, Stalin is given a great deal of blame. Davies and Wheatcroft argue the great famine was, “a consequence of the decision to industrialise this peasant country at breakneck speed.\" They emphasize Moscow's ignorance of agriculture and its priority given to food for industrial workers.  They state, \"We do not at all absolve Stalin from responsibility for the famine. His policies towards the peasants were ruthless and brutal. But the...Soviet leadership which was struggling with a famine crisis which had been caused partly by their wrongheaded policies, but was unexpected and undesirable.\" They state: \"We have found no evidence, either direct or indirect, that Stalin sought deliberately to starve the peasants”.  From the other side of the debate, historian Norman Naimark argues:\nMost scholars agree that there was enough grain in the Soviet Union in this period to feed everyone in Ukraine at a minimal level.  But forced requisitioning removed the margin of sufficiency and sank the region into famine, cannibalism, and desperation.  There is not a lot of evidence that Stalin himself ordered the Ukrainian killer famine, but there is every reason to believe he knew about it, understood what was happening, and was completely indifferent to the fate of the victims. This may not be enough evidence to convict him in an international court of justice as a genocidaire, but that does not mean that the event itself cannot be judged as genocide.Norman M. Naimark, \"Stalin and the Question of Soviet Genocide\" pp 39-48 in \n\nIn the Soviet Union and its successor states\n\nKhrushchev's de-Stalinisation process in Soviet society ended when he was replaced as leader by Leonid Brezhnev in 1964; the latter introduced a level of re-Stalinisation within the Soviet Union. In 1969 and again in 1979, plans were proposed for a full rehabilitation of Stalin's legacy; both were defeated by complaints both domestically and from foreign Communist parties. Gorbachev saw the total denunciation of Stalin as being necessary for the regeneration of Soviet society. After the fall of the Soviet Union in 1991, the first President of the new Russian Federation, Boris Yeltsin, also retained Gorbachev's denunciation of Stalin but added to it a denunciation of Lenin. His successor, Vladimir Putin, did not seek to rehabilitate Stalin but placed an emphasis on celebrating Soviet achievement under Stalin's leadership rather than the repressions.\n\nAmid the social and economic turmoil of the post-Soviet period, many Russians viewed Stalin as having overseen an era of order, predictability, and pride. He remains a revered figure among many Russian nationalists, who feel nostalgic about the Soviet victory over Nazi Germany in World War II, and he is regularly invoked approvingly within both Russia's far-left and far-right.\nIn a 2006 survey, 30% of Russians aged over 30 stated that they would definitely or probably vote for Stalin,Mendelson, Sarah E. and Gerber, Theodore P. (January/February 2006) [https://www.foreignaffairs.com/articles/russia-fsu/2006-01-01/failing-stalin-test Failing the Stalin Test] . Foreign Affairs and in the 2008 Name of Russia television show, Stalin was voted as the third most notable personality in Russian history. A 2017 poll revealed that Stalin's popularity reached a 16-year high among the Russian population, with 46% expressing a favourable view of him. At the same time, there was a growth in pro-Stalinist literature in Russia, much of which relies upon the misrepresentation or fabrication of source material. In this literature, Stalin's repressions are regarded either as a necessary measure to defeat \"enemies of the people\" or the result of lower-level officials acting without Stalin's knowledge.\n\nThe only part of the former Soviet Union where admiration for Stalin has remained consistently widespread is Georgia. Many Georgians resent criticism of Stalin, the most famous figure from their nation's modern history; a 2013 survey by Tbilisi University found 45% of Georgians expressing \"a positive attitude\" to him.\n\nTwenty-six countries have officially recognized the Ukrainian famine of 1932–33 under the legal definition of genocide. In 2006, the Ukrainian Parliament declared it to be genocide, and in 2010 a Ukrainian court posthumously convicted  Stalin, Lazar Kaganovich, Stanislav Kosior and other Soviet leaders of genocide.[http://en.rian.ru/exsoviet/20100113/157536602.html Ukraine court finds Bolsheviks guilty of Holodomor genocide], RIA Novosti (13 January 2010)[http://www.rferl.org/content/Yushchenko_Praises_Guilty_Verdict_Against_Soviet_Leaders_For_Famine/1929566.html Yushchenko Praises Guilty Verdict Against Soviet Leaders For Famine], Radio Free Europe/Radio Liberty (14 January 2010)[http://www.nybooks.com/blogs/nyrblog/2010/may/26/springtime-for-stalin/ Springtime for Stalin] by Timothy D. Snyder, The New York Review of Books (26 May 2010) In the spring of 2010 a new monument in honor of Stalin was erected in Zaporizhia. In late December 2010 the statue had his head cut off by unidentified vandals and the following New Year's Eve it was completely destroyed in an explosion.[http://en.rian.ru/world/20110225/162757220.html Ukraine stands by its view of Stalin as villain – president (Update 1)], RIA Novosti (25 February 2011) In a 2016 Kiev International Institute of Sociology poll, 38% of respondents had a negative attitude to Stalin, 26% a neutral one and 17% a positive (19% refused to answer). [http://pda.pravda.com.ua/news/id_7101130/ About Stalin positive about 1/5 less Ukrainian], Ukrayinska Pravda (4 March 2015)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Joseph Stalin" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15641" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Joseph Vissarionovich Stalin (18 December 1878 – 5 March 1953) was a Soviet revolutionary and politician of Georgian ethnicity. Governing the Soviet Union as its dictator from the mid-1920s until his death in 1953, he served as General Secretary of the Central Committee of the Communist Party of the Soviet Union from 1922 to 1952 and as Premier of the Soviet Union from 1941 to 1953. Ideologically a Marxist and a Leninist, Stalin helped to formalise these ideas as Marxism–Leninism while his own policies became known as Stalinism.\n\nRaised into a poor family in Gori, Russian Empire, as a youth Stalin joined the Marxist Russian Social Democratic Labour Party. He edited the party newspaper Pravda and raised funds for Vladimir Lenin's Bolshevik faction via robberies, kidnappings, and protection rackets. Repeatedly arrested, he underwent several internal exiles. After the Bolsheviks gained power in the October Revolution of 1917 and established the Russian Soviet Republic, Stalin sat on the governing Politburo during the Russian Civil War and helped form the Soviet Union in 1922. Despite Lenin's opposition, Stalin consolidated power following the former's death in 1924. During Stalin's tenure, \"Socialism in One Country\" became a central concept in Soviet society, and Lenin's New Economic Policy was replaced with a centralised command economy, industrialisation and collectivisation. These rapidly transformed the country into an industrial power, but disrupted food production and contributed to the famine of 1932–33, particularly affecting Ukraine. To eradicate those regarded as \"enemies of the working class\", from 1934 to 1939 Stalin organised the \"Great Purge\" in which hundreds of thousands—including senior political and military figures—were interned in prison camps, exiled, or executed.\n\nStalin's government promoted Marxism–Leninism abroad through the Communist International and supported anti-fascist movements throughout Europe during the 1930s, particularly in the Spanish Civil War. However, in 1939 they signed a non-aggression pact with Nazi Germany, resulting in their joint invasion of Poland. Germany ended the pact by invading the Soviet Union in 1941. Despite initial setbacks, the Soviet Red Army halted the German incursion and captured Berlin in May 1945, ending World War II in Europe. The Soviets annexed the Baltic states and helped establish pro-Soviet Marxist–Leninist governments throughout Eastern Europe. The Soviet Union and the United States emerged as the two world superpowers, and a period of tensions began between the Soviet-backed Eastern Bloc and U.S.-backed Western Bloc known as the Cold War. Stalin led his country through its post-war reconstruction, during which it developed a nuclear weapon in 1949. In these years, the country experienced another major famine and a period of antisemitism, which reached its peak in the 1952–1953 Doctors' plot. Stalin died in 1953 and was succeeded by Nikita Khrushchev, who denounced his predecessor and initiated a de-Stalinisation process throughout Soviet society.\n\nWidely considered one of the 20th century's most significant figures, Stalin was the subject of a pervasive personality cult within the international Marxist–Leninist movement, for whom Stalin was a champion of socialism and the working class. Since the fall of the Soviet Union, Stalin has retained popularity in Russia and Georgia as a victorious wartime leader who established the Soviet Union as a major world power. Conversely, his autocratic government has been widely condemned and vilified for overseeing mass repressions, hundreds of thousands of executions and millions of non-combatant deaths through his policies.\n\nEarly life\n\nChildhood: 1878–1899\n\nStalin was born Ioseb Jughashvili in Gori on . He was the son of Besarion \"Beso\" Jughashvili and Ekaterina \"Keke\" Geladze, who had married in May 1872, and had lost two sons in infancy prior to Stalin's birth. They were ethnically Georgian and Stalin grew up speaking the Georgian language. Gori was then part of the Russian Empire, and was home to a population of 20,000, the majority of whom were Georgian but with Armenian, Russian, and Jewish minorities. Stalin was baptised on 17 December. He earned the childhood nickname of \"Soso\", a diminutive of Iosif (Joseph). Beso was a cobbler and in the early years of their marriage, the couple prospered. However, he did not adapt to changing footwear fashions and his business began to fail. The family soon found themselves living in poverty, moving through nine different rented rooms in ten years. Given this situation, the historian Robert Conquest later suggested that Stalin's class background was \"uncertain and indeterminate\".\n\nBeso was also an alcoholic, and drunkenly beat his wife and son. To escape the abusive relationship, Keke took Stalin and moved into the house of a family friend, Father Christopher Charkviani. She worked as a house cleaner and launderer for several local families who were sympathetic to her plight. Keke was determined to send her son to school, something that none of the family had previously achieved. In late 1888, aged 10 he enrolled at the Gori Church School. This was normally reserved for the children of clergy, although Charkviani ensured that Stalin received a place. Stalin excelled academically, displaying talent in painting and drama classes, writing his own poetry, and singing as a choirboy. He got into many fights, and a childhood friend later noted that Stalin \"was the best but also the naughtiest pupil\" in the class. Stalin faced several severe health problems; in 1884, he contracted smallpox and was left with facial pock scars. Aged 12, he was seriously injured after being hit by a phaeton, resulting in a lifelong disability to his left arm.\n\nAt his teachers' recommendation, Stalin proceeded to the Spiritual Seminary in Tiflis. He enrolled at the school in August 1894, enabled by a scholarship that allowed him to study at a reduced rate. Here he joined 600 trainee priests who boarded at the seminary. Stalin was again academically successful and gained high grades. He continued writing poetry; five of his poems were published under the pseudonym of \"Soselo\" in Ilia Chavchavadze's newspaper Iveria (\"Georgia\"). Thematically, they dealt with topics like nature, land, and patriotism. According to Stalin's biographer Simon Sebag Montefiore, they became \"minor Georgian classics\", and were included in various anthologies of Georgian poetry over the coming years. As he grew older, Stalin lost interest in his studies; his grades dropped, and he was repeatedly confined to a cell for his rebellious behaviour. Teachers complained that he declared himself an atheist, chatted in class and refused to doff his hat to monks.\n\nStalin had joined a forbidden book club active at the school; he was particularly influenced by Nikolay Chernyshevsky's 1863 pro-revolutionary novel What Is To Be Done?. Another influential text was Alexander Kazbegi's The Patricide, with Stalin adopting the nickname \"Koba\" from that of the book's bandit protagonist. He also read Capital, the 1867 book by German sociological theorist Karl Marx. Stalin devoted himself to Marx's socio-political theory, Marxism, which was then on the rise in Georgia, one of various forms of socialism opposed to the governing Tsarist authorities. At night, he attended secret workers' meetings, and was introduced to Silibistro \"Silva\" Jibladze, the Marxist founder of Mesame Dasi ('Third Group'), a Georgian socialist group. In April 1899, Stalin left the seminary and never returned, although the school encouraged him to come back.\n\nRussian Social-Democratic Labour Party: 1899–1904\n\nIn October 1899, Stalin began work as a meteorologist at a Tiflis observatory, a position that allowed him to read while on duty. Stalin gave classes in socialist theory and attracted a group of young men around him. He co-organised a secret mass meeting of workers for May Day 1900, at which he successfully encouraged many of the men to take strike action. By this point, the empire's secret police—the Okhrana—were aware of Stalin's activities within Tiflis' revolutionary milieu. They attempted to arrest him in March 1901, but he escaped and went into hiding, living off the donations of friends and sympathisers. Remaining underground, he helped to plan a demonstration for May Day 1901, in which 3,000 marchers clashed with the authorities. He continued to evade arrest by using aliases and sleeping in different apartments. In November 1901, he was elected to the Tiflis Committee of the Russian Social Democratic Labour Party (RSDLP), a Marxist party founded in 1898.\n\nThat month he travelled to the port city of Batumi. His militant rhetoric proved divisive among the city's Marxists, with some suspecting that he might be an agent provocateur. He found employment at the Rothschild refinery storehouse, where he co-organised two workers' strikes. After several strike leaders were arrested, he co-organised a mass public demonstration that led to the storming of the prison; troops fired upon the demonstrators, 13 of whom were killed. Stalin organised a second mass demonstration on the day of their funeral, before being arrested in April 1902. He was initially held at Batumi Prison, and later moved to the more secure Kutaisi Prison. In mid-1903, Stalin was sentenced to three years of exile in eastern Siberia.\n\nStalin left Batumi in October, arriving at the small Siberian town of Novaya Uda in late November. There, he lived in the two-room house of a local peasant, sleeping in the building's larder. Stalin made several escape attempts; on the first he made it to Balagansk before returning due to frostbite. His second attempt was successful and he made it to Tiflis. Here, he co-edited a Georgian Marxist newspaper, Proletariatis Brdzola (\"Proletarian Struggle\"), with Philip Makharadze. His calls for a separate Georgian Marxist movement resulted in several RSDLP members calling for his expulsion, claiming that his views were contrary to the ethos of Marxist internationalism. Under Mikha Tskhakaya's influence, Stalin renounced these views. During his exile, the RSDLP had split between Vladimir Lenin's Bolsheviks and Julius Martov's Mensheviks. Stalin detested many of the Mensheviks in Georgia and aligned himself with the Bolsheviks. Although Stalin established a Bolshevik stronghold in the mining town of Chiatura, Bolshevism remained a minority force in the Menshevik-dominated Georgian revolutionary scene.\n\nThe Revolution of 1905 and its aftermath: 1905–1912\n\nIn January 1905, government troops massacred protesters in Saint Petersburg. Unrest soon spread across the Russian Empire in what came to be known as the Revolution of 1905. Georgia was one of the regions particularly affected. In February, Stalin was in Baku when ethnic violence broke out between Armenians and Azeris; at least 2,000 were killed. Stalin publicly lambasted the \"pogroms against Jews and Armenians\" as being part of Tsar Nicholas II's attempts to \"buttress his despicable throne\". He formed a Bolshevik Battle Squad which he used to try and keep Baku's warring ethnic factions apart, also using the unrest to steal printing equipment. Amid the growing violence throughout Georgia, Stalin formed further Battle Squads, with the Mensheviks doing the same. Stalin's Squads disarmed local police and troops, raided government arsenals, and raised funds through protection rackets on large local businesses and mines. They launched attacks on the government's Cossack troops and pro-Tsarist Black Hundreds, co-ordinating some of their operations with the Menshevik militia.\n\nIn November 1905, the Georgian Bolsheviks elected Stalin as one of their delegates to a Bolshevik conference in Saint Petersburg. On arrival, he met Lenin's wife Nadezhda Krupskaya, who informed them that the venue had been moved to Tampere in the Grand Duchy of Finland. At the conference Stalin met Lenin for the first time. Although Stalin held Lenin in deep respect, he was vocal in his disagreement with Lenin's view that the Bolsheviks should field candidates for the forthcoming election to the State Duma; Stalin saw the parliamentary process as a waste of time. In April 1906, Stalin attended the RSDLP Fourth Congress in Stockholm; this was his first trip outside the Russian Empire. At the conference, the RSDLP—then led by its Menshevik majority—agreed that it would not raise funds using armed robbery. Lenin and Stalin disagreed with this decision, and later privately discussed how they could continue the robberies for the Bolshevik cause.\n\nStalin married Kato Svanidze in a church ceremony at Senaki in July 1906. In March 1907 she bore a son, Yakov. By that year—according to the historian Robert Service—Stalin had established himself as \"Georgia's leading Bolshevik\". He attended the Fifth RSDLP Congress, held in London in May–June 1907. After returning to Tiflis, Stalin organized the robbing of a large delivery of money to the Imperial Bank in June 1907. His gang ambushed the armed convoy in Yerevan Square with gunfire and home-made bombs. Around 40 people were killed, but all of his gang escaped alive.\n\nAfter the heist, Stalin settled in Baku with his wife and son. There, Mensheviks confronted Stalin about the robbery and voted to expel him from the RSDLP, but he took no notice of them. In Baku, Stalin secured Bolshevik domination of the local RSDLP branch, and edited two Bolshevik newspapers, Bakinsky Proletary  and Gudok (\"Whistle\"). In August 1907, he attended the Seventh Congress of the Second International in Stuttgart, Germany. In November 1907, his wife died of typhus, and he left his son with her family in Tiflis. In Baku he had reassembled his gang, the Outfit, which continued to attack Black Hundreds and raised finances by running protection rackets, counterfeiting currency, and carrying out robberies. They also kidnapped the children of several wealthy figures in order to extract ransom money. In early 1908, he travelled to the Swiss city of Geneva to meet with Lenin and the prominent Russian Marxist Georgi Plekhanov, although the latter exasperated him.\n\nIn March 1908, Stalin was arrested and interred in Bailov Prison, where he led the imprisoned Bolsheviks, organised discussion groups, and ordered the killing of suspected informants. He was eventually sentenced to two years exile in the village of Solvychegodsk, Vologda Province, arriving there in February 1909. In June, he escaped the village and made it to Kotlas disguised as a woman and from there to Saint Petersburg. In March 1910, he was arrested again, and sent back to Solvychegodsk. There he had affairs with at least two women; his landlady, Maria Kuzakova, later gave birth to his second son, Konstantin. In June 1911, Stalin was given permission to move to Vologda, where he stayed for two months, having a relationship with Pelageya Onufrieva. He proceeded to Saint Petersburg, where he was arrested in September 1911, and sentenced to a further three-year exile in Vologda.\n\nEditing Pravda and the Central Committee: 1912–1917\n\nThe first Bolshevik Central Committee had been elected at the Prague Conference, after which Lenin and Grigory Zinoviev invited Stalin to join it. Still in Vologda, Stalin agreed, remaining a Central Committee member for the rest of his life. Lenin believed that Stalin would be useful in helping to secure support for the Bolsheviks from the Empire's minority ethnicities. In February 1912, Stalin escaped to Saint Petersburg, tasked with converting the Bolshevik weekly newspaper, Zvezda (\"Star\") into a daily, Pravda (\"Truth\"). The new newspaper was launched in April 1912, although Stalin's role as editor was kept secret. In May 1912, he was arrested again and imprisoned in the Shpalerhy Prison, before being sentenced to three years exile in Siberia. In July, he arrived at the Siberian village of Narym, where he shared a room with fellow Bolshevik Yakov Sverdlov. After two months, Stalin and Sverdlov escaped back to Saint Petersburg.\n\nDuring a brief period back in Tiflis, Stalin and the Outfit planned the ambush of a mail coach, during which most of the group—although not Stalin—were apprehended by the authorities. Stalin returned to Saint Petersburg, where he continued editing and writing articles for Pravda. After the October 1912 Duma elections resulted in six Bolsheviks and six Mensheviks being elected, Stalin wrote articles calling for reconciliation between the two Marxist factions, for which he was criticised by Lenin. In late 1912, he twice crossed into the Austro-Hungarian Empire to visit Lenin in Kraków, eventually bowing to Lenin's opposition to reunification with the Mensheviks.\n\nIn January 1913 Stalin travelled to Vienna, there focusing his attention on the 'national question' of how the Bolsheviks should deal with the Russian Empire's national and ethnic minorities. Lenin wanted to attract these groups to the Bolshevik cause by offering them the right of secession from the Russian state, but at the same time he hoped that they would remain part of a future Bolshevik-governed Russia. Stalin's finished article was titled Marxism and the National Question; Lenin was very happy with it. According to Montefiore, this was \"Stalin's most famous work\". The article was published under the pseudonym of \"K. Stalin\", a name he had been using since 1912. This name derived from the Russian language word for steel (stal), and has been translated as \"Man of Steel\". Further, as argued by Robert C. Tucker, the pseudonym was intended to imitate that of Lenin. Stalin retained this name for the rest of his life, possibly because it had been used on the article which established his reputation among the Bolsheviks.\n\nIn February 1913, Stalin was arrested while back in Saint Petersburg. He was sentenced to four years exile in Turukhansk, a remote part of Siberia from which escape was particularly difficult. In August, he arrived in the village of Monastyrskoe, although after four weeks was relocated to the hamlet of Kostino. In March 1914, concerned over a potential escape attempt, the authorities moved Stalin to the hamlet of Kureika on the edge of the Arctic Circle. In the hamlet, Stalin had an affair with Lidia Pereprygia, who was thirteen at the time and thus a year under the legal age of consent in Tsarist Russia. Circa December 1914, Pereprygia gave birth to Stalin's child, although the infant soon died. She gave birth to another of his children, Alexander, circa April 1917. In Kureika, Stalin lived closely with the indigenous Tunguses and Ostyak, and spent much of his time fishing.\n\nThe Russian Revolution: 1917\n\nWhile Stalin was in exile, Russia entered the First World War, and in October 1916 Stalin and other exiled Bolsheviks were conscripted into the Russian Army, leaving for Monastyrskoe. They arrived in Krasnoyarsk in February 1917, where a medical examiner ruled him unfit for military service due to his crippled arm. Stalin was required to serve four more months on his exile, and he successfully requested that he serve it in nearby Achinsk. Stalin was in the city when the February Revolution took place; uprisings broke out in Petrograd—as Saint Petersburg had been renamed—and Tsar Nicholas II abdicated, to be replaced by a Provisional Government. In a celebratory mood, Stalin travelled by train to Petrograd in March. There, Stalin and fellow Bolshevik Lev Kamenev assumed control of Pravda, and Stalin was appointed the Bolshevik representative to the Executive Committee of the Petrograd Soviet, an influential council of the city's workers. In April, Stalin came third in the Bolshevik elections for the party's Central Committee; Lenin came first and Zinoviev came second. This reflected his senior standing in the party at the time.\n\nStalin helped to organise the July Days uprising, an armed display of strength by Bolshevik supporters. After the armed demonstration was suppressed, the Provisional Government initiated a crackdown on the Bolsheviks, raiding Pravda. During this raid, Stalin smuggled Lenin out of the newspaper's office and took charge of the Bolshevik leader's safety, moving him between Petrograd safe houses before smuggling him to Razliv. In Lenin's absence, Stalin continued editing Pravda and served as acting leader of the Bolsheviks, overseeing the party's Sixth Congress, which was held covertly. Lenin began calling for the Bolsheviks to seize power by toppling the Provisional Government in a coup. Stalin and fellow senior Bolshevik Leon Trotsky both endorsed Lenin's plan of action, but it was opposed by Kamenev and other party members. Lenin returned to Petrograd and at a meeting of the Central Committee on 10 October, he secured a majority in favour of a coup.\n\nOn 24 October, police raided the Bolshevik newspaper offices, smashing machinery and presses; Stalin salvaged some of this equipment in order to continue his activities. In the early hours of 25 October, Stalin joined Lenin in a Central Committee meeting in the Smolny Institute, from where the Bolshevik coup—the October Revolution—was directed. Bolshevik militia seized Petrograd's electric power station, main post office, state bank, telephone exchange, and several bridges. A Bolshevik-controlled ship, the Aurora, opened fire on the Winter Palace; the Provisional Government's assembled delegates surrendered and were arrested by the Bolsheviks. Although he had been tasked with briefing the Bolshevik delegates of the Second Congress of Soviets about the developing situation, Stalin's role in the coup had not been publicly visible. Trotsky and other later Bolshevik opponents of Stalin used this as evidence that his role in the coup had been insignificant, although several historians reject this. According to the historian Oleg Khlevniuk, Stalin \"filled an important role [in the October Revolution]... as a senior Bolshevik, member of the party's Central Committee, and editor of its main newspaper\".\n\nIn Lenin's government\n\nConsolidating power: 1917–1918\n\nOn 26 October, Lenin formed a new government, the Council of People's Commissars (\"Sovnarkom\"), which he led as Chairman. Stalin was among the Bolsheviks who backed Lenin's decision not to form a coalition with the Mensheviks and Socialist Revolutionary Party, although they did form a coalition government with the Left Socialist Revolutionaries. Stalin was soon part of an informal foursome leading the government, alongside Lenin, Trotsky, and Sverdlov; of these, Sverdlov was regularly absent, and died in March 1919. Stalin's office was based near to Lenin's in the Smolny Institute, and he and Trotsky were the only individuals allowed access to Lenin's study without an appointment. Although not so publicly well known as Lenin or Trotsky, Stalin's importance among the Bolsheviks grew. He co-signed Lenin's decrees shutting down hostile newspapers, and with Sverdlov chaired the sessions of the committee drafting a constitution for the new Russian Soviet Federative Socialist Republic. He strongly supported Lenin's formation of the Cheka security service and the subsequent Red Terror that it initiated; noting that state violence had proved an effective tool for capitalist powers, he believed that it would prove the same for the Soviet government. Unlike senior Bolsheviks like Kamenev and Nikolai Bukharin, Stalin never expressed concern about the rapid growth and expansion of the Cheka and Terror.\n\nHaving dropped his editorship of Pravda, Stalin was appointed as the People's Commissar for Nationalities. In November, he signed the Decree on Nationality, according ethnic and national minorities living in Russia the right of secession and self-determination. The purpose of this decree was primarily strategic, designed to woo the support of ethnic minorities for the Bolshevik cause; the Bolsheviks hoped that the minorities would not actually desire independence. That month, he travelled to Helsinki to talk with the Finnish Social-Democrats, to whom he promised independence, which was then granted in December. His department allocated funds for the establishment of presses and schools in the languages of various ethnic minorities. Socialist Revolutionaries accused Stalin of using talk of federalism and national self-determination as a front for Sovnarkom's centralising and imperialist policies.\n\nAs a result of the ongoing First World War, in which Russia was fighting the Central Powers, Lenin's government relocated from Petrograd to Moscow in March 1918. Stalin brought Nadezhda Alliluyeva with him as his secretary; he had been a longstanding friend of her parents. At some point, the couple married, although the exact date of their wedding is unknown. Lenin wanted to sign an armistice with the Central Powers regardless of the cost in territory, and was supported in this by Stalin. Stalin thought it necessary because he was unconvinced that Europe itself was on the verge of proletarian revolution, a view that irked Lenin. Lenin eventually convinced the other senior Bolsheviks of the need for a peace treaty, resulting in the signing of the Treaty of Brest-Litovsk in March 1918. The treaty gave vast areas of land and resources to the Central Powers and angered many in Russia; the Left Socialist Revolutionaries abandoned the coalition government over the issue.\n\nMilitary Command: 1918–1921\n\nAfter the Bolsheviks seized power, both right and left-wing armies rallied against them, generating the Russian Civil War. To secure access to the dwindling food supply, in May 1918 Sovnarkom sent Stalin to Tsaritsyn to take charge of food procurement in southern Russia. Eager to prove himself as a commander, once there he took control of regional military operations. He befriended two military figures, Kliment Voroshilov and Semyon Budyonny, who would form the nucleus of his military and political support base. Believing that victory was assured by numerical superiority, he sent large numbers of Red Army troops into battle against the region's anti-Bolshevik White armies, resulting in heavy losses; Lenin was concerned by this costly tactic. In Tsaritsyn, Stalin executed suspected counter-revolutionaries, sometimes without trial, and—in contravention of government orders—purged the military and food collection agencies of middle-class specialists, some of whom he also executed. His use of state violence and terror was at a greater scale than most Bolshevik leaders approved of. For instance, he ordered several villages to be torched to ensure compliance with his food procurement program.\n\nIn December 1918, Stalin was sent to Perm to lead an inquiry into how the Red Army forces based there had been decimated in an attack by Alexander Kolchak's White forces. He returned to Moscow between January and March 1919, before being assigned to the Western Front at Petrograd. When the Third Regiment defected, he ordered any captured defectors to be publicly shot. In September he was returned to the Southern Front. During the war, he proved his worth to the Central Committee, displaying decisiveness, determination, and a willingness to take on responsibility in conflict situations. At the same time, he disregarded orders and when affronted he repeatedly threatened to resign, forcing Lenin to convince him to reconsider. In November 1919, the government awarded him the Order of the Red Banner for his service in the war.\n\nThe civil war was over by the end of 1919, having resulted in a Bolshevik victory. Sovnarkom turned its attention to spreading proletarian revolution abroad, to this end forming the Communist International in March 1919; Stalin was present at its inaugural ceremony. Although Stalin did not share Lenin's belief that the European proletariat were on the verge of revolution, he acknowledged that as long as it stood alone, Soviet Russia remained vulnerable. In December 1918, he had drawn up decrees recognising Marxist-governed Soviet republics in Estonia, Lithuania, and Latvia, however these Marxist governments had been overthrown and the Baltic countries became fully independent of Russia, an act which he regarded as illegitimate. In February 1920, Stalin was appointed to head the Workers' and Peasants' Inspectorate; that same month he was also transferred to the Caucasian Front.\n\nFollowing earlier clashes between Polish and Russian troops, the Polish–Soviet War broke out in the spring of 1920. Stalin was moved to Ukraine, on the Southwest Front. The Red Army forced the Polish troops back into Poland. Lenin believed that the Polish proletariat would rise up to support the Russians against Józef Piłsudski's Polish government. Stalin had cautioned against this; he believed that nationalism would lead the Polish working-classes to support their government's war effort. He also believed that the Red Army was ill-prepared to conduct an offensive war and that it would give White Armies a chance to resurface in Crimea, potentially reigniting the civil war. Stalin lost the argument, after which he accepted Lenin's decision and supported it. Along the Southwest Front, he became determined to conquer Lwów; in focusing on this goal he disobeyed orders to transfer his troops to assist Mikhail Tukhachevsky's forces. In August, the Poles repulsed the Russian advance and Stalin returned to Moscow. A peace treaty between the two countries was signed, for which Stalin blamed Trotsky. Stalin felt resentful and under-appreciated; he was angry at how the war had been conducted and in September demanded demission from the military, which was granted. At the 9th Bolshevik Conference, Stalin was accused of insubordination and military incompetence during the war with Poland, with Trotsky accusing him of making \"strategic mistakes\".\n\nLenin's final years: 1921–1923\n\nStalin believed that each nation and ethnic group should have the right to self-expression, facilitating this through \"autonomous republics\" within the Russian state in which ethnic minorities could oversee various regional affairs. Some Communists accused him of bending too much to \"petit-bourgeois\" nationalisms, while others accused him of remaining too Russocentric by seeking to maintain these nations within the Russian state.\nStalin's native Caucasus posed a particular problem due to its highly multi-cultural mix. Stalin opposed the idea of separate Georgian, Armenian, and Azerbaijani autonomous republics, arguing that these would likely oppress the many minorities within their territory; instead he called for the formation of a Transcaucasian Socialist Federative Soviet Republic. The Georgian Communist Party opposed the idea, resulting in the Georgian Affair. In the summer of 1921, he returned to the southern Caucasus, there calling on Georgian Communists to avoid the chauvinistic Georgian nationalism which he believed marginalised the Abkhazian, Ossetian, and Adjarian minorities. On this trip, Stalin met with his son Yakov, and brought him back to Moscow with them; Nadya had given birth to another of Stalin's sons, Vasily, in March 1921.\n\nAfter the civil war, workers' strikes and peasant uprisings broke out across Russia, largely in opposition to Sovnarkom's food requisitioning project; as an antidote, Lenin introduced a level of market-oriented reform as the New Economic Policy (NEP). There was also internal turmoil in the Communist Party, as Trotsky led a faction calling for the abolition of trade unions; Lenin opposed this and Stalin helped him to drum up support against Trotsky's position. Stalin also agreed to supervise the Department of Agitation and Propaganda in the Central Committee Secretariat. At the 11th Party Congress in 1922, Lenin nominated Stalin as the party's new General Secretary. Although concerns were expressed that adopting this new post on top of his others would both overstretch his workload and give him too much power, Stalin was appointed to the position. For Lenin, it was advantageous to have one of his allies in a post crucial for the maintenance of his policies.\n\nIn May 1922, Lenin had a massive stroke and was partially paralysed. Residing at his Gorki dacha, Lenin's main connection to Sovnarkom was through Stalin, who was a regular visitor. Lenin twice asked Stalin to procure poison so that he may commit suicide, but Stalin never did so. Despite this comradeship, Lenin disliked what he referred to as Stalin's \"Asiatic\" manner, and told his sister Maria that Stalin was \"not intelligent\". Lenin and Stalin argued on the issue of foreign trade; Lenin believed that the Soviet state should have a monopoly on foreign trade, but Stalin supported Grigori Sokolnikov's view that doing so was impractical at that stage. Another disagreement came over the Georgian Affair, with Lenin backing the Georgian Central Committee's desire for a Georgian Soviet Republic over Stalin's idea of a Transcaucasian one.\n\nThey also disagreed on the nature of the Soviet state. Lenin called for the country to be renamed the \"Union of Soviet Republics of Europe and Asia\", reflecting his desire for expansion across the two continents. Stalin believed that this would encourage independence sentiment among non-Russians, instead arguing that ethnic minorities would be content as \"autonomous republics\" within the Russian Soviet Federative Socialist Republic. Lenin accused Stalin of \"Great Russian chauvinism\"; Stalin accused Lenin of \"national liberalism\". A compromise was reached, in which the country would be renamed the \"Union of Soviet Socialist Republics\" (USSR). The USSR's formation was ratified in December 1922; although officially a federal system, all major decisions were taken by the Politburo in Moscow. Their differences were not just based on policy but also became personal; Lenin was particularly angered when Stalin was rude to his wife Krupskaya during a telephone conversation. In the final years of his life, Lenin dictated increasingly disparaging notes on Stalin that became his testament. He criticized Stalin's rude manners and excessive power, suggesting that Stalin should be removed from the position of General Secretary.\n\nRise to power\n\nSucceeding Lenin: 1924–1927\n\nLenin died in January 1924. Stalin took charge of the funeral and was one of its pallbearers; against the wishes of Lenin's widow, the Politburo embalmed his corpse and placed it within a mausoleum in Moscow's Red Square. It was incorporated into a growing personality cult devoted to Lenin, with Petrograd being renamed \"Leningrad\" that year. To bolster his image as a devoted Leninist, Stalin was eager to present himself as a theorist, giving nine lectures at Sverdlov University on the \"Foundations of Leninism\"; it was later published as a concise overview of Lenin's ideas. At the following 13th Party Congress, Lenin's Testament was read out to senior figures. Embarrassed by its contents, Stalin offered his resignation as General Secretary; this act of humility saved him and he was retained in the position. In his private life, he was dividing his time between his Kremlin apartment and a dacha he had obtained at Zubalova. His wife had given birth to a daughter, Svetlana, in February 1926.\n\nStalin saw Trotsky as the main obstacle to his rise to dominance within the Communist Party, and while Lenin had been ill he had forged an anti-Trotsky alliance with Kamenev and Grigory Zinoviev. Although Zinoviev had expressed concerned about Stalin's growing authority, he rallied behind him at the 13th Congress as a counterweight to Trotsky, who now led a party faction known as the Left Opposition. The Left Opposition believed that too many concessions to capitalism had been made with the NEP; Stalin was deemed a \"rightist\" in the party for his support of the policy. Stalin built up a retinue of his supporters in the Central Committee, while the Left Opposition were gradually removed from their positions of influence. He was supported in this by Bukharin, who like Stalin believed that implementing the Left Opposition's proposals would plunge the Soviet Union into instability.\n\nIn the autumn of 1924, Stalin also removed Kamenev and Zinoviev's supporters from key positions. In 1925, Kamenev and Zinoviev moved into open opposition of Stalin and Bukharin. They attacked one another at the 14th Party Congress, where Stalin accused Kamenev and Zinoviev of reintroducing factionalism—and thus instability—into the party. In the summer of 1926, Kamenev and Zinoviev joined with the Trotskyites to form the United Opposition against Stalin; in October they agreed to stop factional activity under threat of expulsion, and later publicly recanted their views under Stalin's command. The factionalist arguments continued, with Stalin threatening to resign in both December 1926 and December 1927. In October 1927, Zinoviev and Trotsky were removed from the Central Committee; the latter was exiled to Kazakhstan and later deported from the country in 1929. Some of those United Opposition members who were repentant were later rehabilitated and allowed to return to government. Stalin had established himself as the party's supreme leader, although was not the head of government, a task he entrusted to key ally Vyacheslav Molotov. Other important supporters on the Politburo were Voroshilov, Lazar Kaganovich, and Sergo Ordzhonikidze, with Stalin ensuring that his allies ran the various state institutions. According to Montefiore, at this point \"Stalin was the leader of the oligarchs but he was far from a dictator\".\n\nIn 1924, Georgian nationalists seeking independence launched the August Uprising; it was suppressed by the Red Army. In April 1925, Tsaritsyn was renamed Stalingrad.\nIn 1926, Stalin published On Questions of Leninism. It was in this book that he introduced the concept of \"Socialism in One Country\", which he claimed was an orthodox Leninist perspective. It nevertheless clashed with established Bolshevik views that socialism could not be established in one country but could only be achieved globally through the process of world revolution.\nIn 1927, there was some argument in the party over the USSR's relationship to the situation in China. Stalin had called for the Communist Party of China, led by Mao Zedong, to ally itself with Chiang Kai-shek's Kuomintang (KMT) nationalists, viewing a Communist-Kuomintang alliance as the best bulwark against Japanese imperial expansionism in eastern Asia. Instead, the KMT repressed the Communists and a civil war broke out between the two sides.\n\nDekulakisation, collectivisation, and industrialisation: 1927–1931\n\nEconomic policy\n\nBy the latter half of the 1920s, the Soviet Union was still lagging behind the industrial development of Western countries, and Stalin's government feared military attack from Japan, France, or the United Kingdom. Many Bolsheviks, including in Komsomol, OGPU, and the Red Army, were eager to be rid of the NEP and its market-oriented approach, desiring a push towards socialism. There were concerns about a growing sector of society—the 'kulaks' and the Nepmen—who had profited from the policy and become wealthier than other citizens. There had also been a shortfall of grain supplies; 1927 produced only 70% of grain produced in 1926. At this point, Stalin turned against the NEP, putting him on a course to the \"left\" even of Trotsky or Zinoviev.\n\nIn early 1928 Stalin travelled to Novosibirsk, there claiming that kulaks were hoarding their grain. He ordered that the kulaks be arrested and their grain confiscated, with Stalin bringing much of the area's grain back to Moscow with him in February. At his command, grain procurement squads surfaced across Western Siberia and the Urals, with violence breaking out between these squads and the peasantry. Stalin announced that both kulaks and the \"middle peasants\" must be coerced into releasing their harvest. Bukharin and several other members of the Central Committee were angry that they had not been consulted about this measure, which they deemed rash. In January 1930, the Politburo approved a measure to liquidate the existence of the kulaks as a class; they were rounded up and exiled either elsewhere in their own regions, to other parts of the country, or to concentration camps. Large numbers died during the journey. By July 1930, over 320,000 households had been affected by the de-kulakisation policy.\n\nIn 1929, the Politburo announced the mass collectivisation of agriculture, establishing both kolkhozy collective farms and sovkhoz state farms. Stalin stipulated that kulaks would be barred from joining these collectives. Although officially voluntary, many peasants joined the collectives out of fear they would face the fate of the kulaks; others joined amid intimidation and violence from party loyalists.\nBy 1932, about 62% of households involved in agriculture were part of collectives, and by 1936 this had risen to 90%. Many of the peasants who had been collectivised resented the loss of their private farmland, and productivity slumped. Famine broke out in many areas, with the Politburo frequently ordering the distribution of emergency food relief to these regions. Armed peasant uprisings against dekulakisation and collectivisation broke out in Ukraine, northern Caucasus, southern Russia, and central Asia, reaching their apex in March 1930; these were repressed by the Red Army. Stalin responded to the uprisings with an article insisting that collectivisation was voluntary and blaming any violence and other excesses on local officials. Bukharin expressed concerns about these policies; he regarded them as a return to Lenin's old \"war communism\" policy and believed that it would fail. However, by the summer of 1928 he was unable to rally sufficient support in the party to oppose the reforms. In November 1929 Stalin removed him from the Politburo.\n\nOfficially, the Soviet Union had replaced the irrationality and wastefulness of a market economy with a planned economy organised along a long-term, precise, and scientific framework; in reality, Soviet economics were based on ad hoc commandments issued from the centre, often to make short-term targets. In 1928, the first five-year plan was launched, its main focus on boosting heavy industry; it was finished a year ahead of schedule, in 1932.\nThe USSR underwent a massive economic transformation. New mines were opened, new cities like Magnitogorsk constructed, and work on the White Sea-Baltic Canal begun. Millions of peasants moved to the cities and became proletariat, although urban house building could not keep up with the demand. Large debts were accrued while purchasing foreign-made machinery. Many of the major construction projects, including the White Sea-Baltic Canal and the Moscow Metro, were constructed largely through forced labour. The last elements of workers' control over industry were removed, with factory managers increasing their authority and receiving privileges and perks; Stalin defended wage disparity by pointing to Marx's argument that it was necessary during the lower stages of socialism. To promote the intensification of labour, a series of medals and awards as well as the Stakhanovite movement were introduced. Stalin's message was that socialism was being established in the USSR while capitalism was crumbling amid the Wall Street crash. His speeches and articles reflected his utopian vision of the Soviet Union rising to unparalleled heights of human development, creating a \"new Soviet person\".\n\nCultural and foreign policy\n\nIn 1928, Stalin declared that class war between the proletariat and their enemies would intensify as socialism developed. He warned of a \"danger from the right\", including in the Communist Party itself. The first major show trial in the USSR was the Shakhty Trial of 1928, in which several middle-class \"industrial specialists\" were convicted of sabotage. From 1929 to 1930, further show trials were held to intimidate opposition: these included the Industrial Party Trial, Menshevik Trial, and Metro-Vickers Trial. Aware that the ethnic Russian majority may have concerns about being ruled by a Georgian,  he promoted ethnic Russians throughout the state hierarchy and made the Russian language compulsory throughout schools and offices, albeit to be used in tandem with local languages in areas with non-Russian majorities. Nationalist sentiment among ethnic minorities was suppressed. Conservative social policies were promoted to enhance social discipline and boost population growth; this included a focus on strong family units and motherhood, the re-criminalisation of homosexuality, restrictions placed on abortion and divorce, and the abolition of the Zhenotdel.\n\nStalin desired a \"cultural revolution\", entailing both the creation of a culture for the \"masses\" and the wider dissemination of previously elite culture. He oversaw the proliferation of schools, newspapers, and libraries, as well as the advancement of literacy and numeracy. \"Socialist realism\" was promoted throughout the arts, while he personally wooed prominent writers, namely Maxim Gorky, Mikhail Sholokhov, and Aleksey Nikolayevich Tolstoy. He also expressed patronage for scientists whose research fitted within his preconceived interpretation of Marxism; he for instance endorsed the research of agrobiologist Trofim Lysenko despite the fact that it was rejected by the majority of his scientific peers as pseudo-scientific. The government's anti-religious campaign was re-intensified, with increased funding given to the League of Militant Atheists. Christian, Muslim, Jewish, and Buddhist clergy faced persecution. Many religious buildings were demolished, most notably Moscow's Cathedral of Christ the Saviour, destroyed in 1931 to make way for the (never completed) Palace of the Soviets. Religion retained an influence over much of the population; in the 1937 census, 57% of respondents identified as religious.\n\nThroughout the 1920s and beyond, Stalin placed a high priority on foreign policy. He personally met with a range of Western visitors, including George Bernard Shaw and H. G. Wells, both of whom were impressed with him. Through the Communist International, Stalin's government exerted a strong influence over Marxist parties elsewhere in the world; initially, Stalin left the running of the organisation largely to Bukharin. \nAt its 6th Congress in July 1928, Stalin informed delegates that the main threat to socialism came not from the right but from non-Marxist socialists and social democrats, whom he called \"social fascists\"; Stalin recognised that the social democrats were the Marxist-Leninists' main rivals for working-class support in many countries. This preoccupation with opposing rival leftists concerned Bukharin, who was particularly worried by the growth of fascism and the far right across Europe. After Bukharin's departure, Stalin placed the Communist International under the administration of Dmitry Manuilsky and Osip Piatnitsky.\n\nStalin faced problems in his family life. In 1929, his son Yakov unsuccessfully attempted suicide; his failure earned Stalin's contempt. His relationship with Nadya was also strained amid their arguments and her mental health problems. In November 1932, after a group dinner in the Kremlin in which Stalin flirted with other women, Nadya shot herself.\nPublicly, it was claimed that Nadya died of appendicitis; Stalin also concealed the real cause of death from his children. Stalin's friends noted that he underwent a significant change following her suicide, becoming emotionally harder.\n\nMajor crises: 1932–1939\n\nFamine in Ukraine\n\nWithin the Soviet Union, there was widespread civic disgruntlement against Stalin's government. Social unrest, previously restricted largely to the countryside, was increasingly evident in urban areas, prompting Stalin to ease on some of his economic policies in 1932. In May 1932, he introduced a system of kolkhoz markets where peasants could trade their surplus produce. At the same time, penal sanctions became more severe; at Stalin's instigation, in August 1932 a measure was introduced meaning that the theft of even a handful of grain could be a capital offense. The second five-year plan had its production quotas reduced from that of the first, with the main emphasis now being on improving living conditions. It therefore emphasised the expansion of housing space and the production of consumer goods. Like its predecessor, this Plan was repeatedly amended to meet changing situations; there was for instance an increasing emphasis placed on armament production after Adolf Hitler became German Chancellor in 1933.\n\nSuch policies nevertheless failed to stop the famine which peaked in the winter of 1932–33. Between five and seven million people died; many resorted to cannibalising the dead to survive. Worst affected were Ukraine and the North Caucuses, although the famine also impacted Kazakhstan and several Russian provinces. The 1932 harvest had been a poor one, and had followed several years in which lower productivity had resulted in a gradual decline in output. Stalin blamed the famine on hostile elements and wreckers within the peasantry.\nAccording to British historian Alan Bullock, \"the total Soviet grain crop was no worse than that of 1931 ... it was not a crop failure but the excessive demands of the state, ruthlessly enforced, that cost the lives of as many as five million Ukrainian peasants.\" Stalin refused to release large grain reserves that could have alleviated the famine, while continuing to export grain, and he strictly enforced new draconian anti-theft laws on the collective farm. Other historians hold the view that it was largely the insufficient harvests of 1931 and 1932 caused by a variety of natural disasters that resulted in famine, with the successful harvest of 1933 ending the famine. \nThe Ukrainian famine is sometimes referred to as the Holodomor,  implying that it was engineered by the Soviet government, specifically targeting the Ukrainian people in order to destroy the Ukrainian nation as both a political factor and a social entity. The existence of the famine was denied to foreign observers.\n\nStalinism\n\nIn 1935–36, Stalin oversaw a new constitution; its dramatic liberal features were designed as propaganda weapons, for all power rested in the hands of Stalin and his Politburo. He declared that \"socialism, which is the first phase of communism, has basically been achieved in this country\". In 1938, The History of the Communist Party of the Soviet Union (Bolsheviks), colloquially known as the Short Course, was released; Conquest later referred to it as the \"central text of Stalinism\". A number of authorised Stalin biographies were also published, although Stalin generally wanted to be portrayed as the embodiment of the Communist Party rather than have his life story explored.  During the later 1930s, Stalin placed \"a few limits on the worship of his own greatness\".  By 1938, Stalin's inner circle had gained a degree of stability, containing the personalities who would remain there until Stalin's death.\n\nForeign affairs\n\nSeeking improved international relations, in 1934 the Soviet Union secured membership of the League of Nations, of which it had previously been excluded. Stalin initiated confidential communications with Hitler in October 1933, shortly after the latter came to power in Germany. Stalin admired Hitler, particularly the latter's manoeuvres to remove rivals within the Nazi Party in the Night of the Long Knives. He nevertheless recognised the threat posed by fascism and sought to establish better links with the liberal democracies of Western Europe; in May 1935, the Soviets signed a treaty of mutual assistance with France and Czechoslovakia. At the Communist International's 7th Congress, held in July–August 1935, the Soviet government encouraged Marxist-Leninists to unite with other leftists as part of a popular front against fascism. In turn, the anti-communist governments of Germany, Fascist Italy and Japan signed the Anti-Comintern Pact of 1936. When the Spanish Civil War broke out the same year, the Soviets sent 648 aircraft and 407 tanks to the left-wing Republican faction; these were accompanied by 3000 Soviet troops and 42,000 members of the International Brigades set up by the Communist International. Stalin took a strong personal involvement in the Spanish situation. Germany and Italy backed the Nationalist faction, which was ultimately victorious in March 1939. Stalin would also give aid to the Chinese after the outbreak of the Second Sino-Japanese War in July 1937, the KMT and the Communists having formed Stalin's desired United Front.\n\nThe Great Terror\n\nRegarding state repressions, Stalin often provided conflicting signals. In May 1933, he ordered the release of many criminals convicted of minor offenses from the overcrowded prisons and ordered the security services not to enact further mass arrests and deportations. In September 1934, he ordered the Politburo to establish a commission to investigate any false imprisonments; however, that same month he called for the execution of workers at the Stalin Metallurgical Factory accused of spying for Japan. This mixed approach began to change in December 1934, when the prominent party member Sergey Kirov was murdered. After Kirov's murder, Stalin became increasingly attentive of the possibility of murder and subsequently improved his own personal security, including being heavily guarded at all times and rarely going out in public.\n\nKirov's killing was followed by an intensification of state repression; Stalin issued a decree establishing NKVD troikas which could mete out rulings without involving the courts. Just as the de-kulakisation policy had sought to rid rural areas of anti-government forces, so Stalin sought to do the same in the cities and towns. In 1935, the NKVD was ordered to expel suspected counter-revolutionaries, particularly those who had been aristocrats, landlords, or businesspeople before the October Revolution. In the early months of 1935, over 11,000 people were expelled from Leningrad, to live in isolated rural areas. In 1936, Nikolai Yezhov became head of the NKVD and oversaw this intensification. Stalin instigated this intensification of repression, which was rooted in his own psychological compulsions and the logic of the system he had created, one which prioritised security above other considerations.\n\nStalin orchestrated the arrest of many former opponents in the Communist Party: denounced as Western-backed mercenaries, many were imprisoned or exiled internally. The first Moscow Trial took place in August 1936; Kamenev and Zinoviev were among those accused of plotting assassinations, found guilty in a show trial, and executed. The second Moscow Show Trial took place in January 1937, and the third in March 1938, in which Bukharin and Rykov were accused of involvement in the alleged Trotskyite-Zinovievite terrorist plot and sentenced to death. By late 1937, all remnants of collective leadership were gone from the Politburo, which was controlled entirely by Stalin.\nThere were mass expulsions from the party, with Stalin commanding foreign communist parties to also purge anti-Stalinist elements. During the 1930s and 1940s, NKVD groups assassinated defectors and opponents abroad; in August 1940, Trotsky was assassinated in Mexico, eliminating the last of Stalin's opponents among the former Party leadership.\nIn May, this was followed by the arrest of most members of the military Supreme Command and mass arrests throughout the military, often on fabricated charges. These purges replaced most of the party's old guard with younger officials who did not remember a time before Stalin's leadership and who were regarded as more personally loyal to him. Party functionaries readily carried out their commands and sought to ingratiate themselves with Stalin to avoid becoming the victim of the purge. Such functionaries often carried out a greater number of arrests and executions than their quotas set by Stalin's central government.\n\nRepressions further intensified in December 1936 and remained at a high level until November 1938, a period known as the Great Purge. By the latter part of 1937, the purges had moved beyond the party and were affecting the wider population. In July 1937, the Politburo ordered a purge of \"anti-Soviet elements\" in society, affecting Bolsheviks who had opposed Stalin, former Mensheviks and Socialist Revolutionaries, priests, former soldiers in the White Army, and common criminals. That month, Stalin and Yezhov signed Order No. 00447, listing 268,950 people for arrest, of whom 75,950 were executed. He also initiated \"national operations\", the ethnic cleansing of non-Soviet ethnic groups—among them Poles, Germans, Latvians, Finns, Greeks, Koreans, and Chinese—through internal or external exile. During these years, approximately 1.6 million people were arrested. 700,000 were shot, and an unknown number died under NKVD torture.\n\nStalin initiated all of the key decisions during the Terror, personally directing many of its operations and taking an interest in the details of their implementation. His motives in doing so have been much debated by historians. His personal writings from the period were—according to Khlevniuk—\"unusually convoluted and incoherent\", filled with claims about conspiracies and enemies encircling him. He was particularly concerned at the success that right-wing forces had in overthrowing the leftist Spanish government, worried that domestic anti-Stalinist elements would become a fifth column in the event of a future war with Japan and Germany. The Great Terror ended when Yezhov was removed as the head of the NKVD, to be replaced by Lavrentiy Beria, a man totally devoted to Stalin. Yezhov was arrested in April 1939 and executed in 1940. The Terror had damaged the Soviet Union's reputation abroad, particularly among previously sympathetic leftists, and as the Terror wound down, so Stalin sought to deflect responsibility away from himself. He later claimed that the Terror's \"excesses\" and \"violations of law\" were Yezhov's fault.\n\nWorld War II\n\nNon-aggression pact with Germany: 1939–1941\n\nAs a Marxist–Leninist, Stalin expected an inevitable Second World War between competing capitalist powers; as Nazi Germany annexed Austria and then part of Czechoslovakia in 1938, Stalin recognised that this war was looming. He sought to maintain Soviet neutrality in the conflict, hoping that a German war against France and the UK would leave the Soviets a dominant force in Europe. Militarily, the Soviets also faced a threat from the east, with Soviet troops clashing with the expansionist Japanese in the latter part of the 1930s. Stalin initiated a military build-up, with the Red Army more than doubling between January 1939 and June 1941, although in its haste to expand many of its officers were poorly trained.\n\nAs Britain and France seemed unwilling to commit to an alliance with the Soviet Union, Stalin saw a better deal with the Germans. In May 1939, Germany began negotiations with the Soviets, proposing that Eastern Europe be divided between the two powers. Stalin saw this as an opportunity both for territorial expansion and temporary peace with Germany. In August 1939, the Soviet Union signed a non-aggression pact with Germany, negotiated by Soviet foreign minister Vyacheslav Molotov and German foreign minister Joachim von Ribbentrop. A week later, Germany invaded Poland, sparking the UK and France to declare war on it. On 17 September, the Red Army entered eastern Poland, officially to restore order amid the collapse of the Polish state; this explanation was also designed so as not to anger the UK and France.\n\nStalin suggested a territorial exchange with Germany, giving them the ethnic Polish-dominated areas of Lublin Province and part of Warsaw Province, and in return receiving Lithuania; Stalin had desired the reintegration of the three Baltic states into the Soviet Union. This was agreed in 28 September. A German–Soviet Frontier Treaty was signed shortly after, in Stalin's presence. The two nations continued trading, undermining the British blockade of Germany.\n\nThe Red Army entered the Baltic states, which were forcibly merged into the Soviet Union in August. The Soviets also claimed Finland, but the Finnish government refused their demands. The Soviets invaded Finland in November; despite their numerical inferiority, the Finns kept the Red Army at bay. International opinion backed Finland, with the Soviets being expelled from the League of Nations. Embarrassed by their inability to defeat the Finns, the Soviets signed an interim peace treaty, in which they received territorial concessions from Finland. In June 1940, Bessarabia and northern Bukovina—parts of Romania—were also annexed into the Soviet Union. The Soviet authorities sought to forestall any dissent in these new East European territories. One of the most noted instances was the Katyn massacre of April and May 1940, in which around 22,000 members of the Polish armed forces, police, and intelligentsia were executed.\n\nThe speed of the German victory over and occupation of France in summer 1940 took Stalin by surprise. He increasingly focused on appeasement with Germany to delay any conflict with them.\nAfter the Tripartite Pact was signed by Axis Powers Germany, Japan and Italy, in October 1940, Stalin approached Germany with the suggestion that it too join the Axis alliance. To demonstrate peaceful intentions toward Germany, in April 1941 the Soviets signed a neutrality pact with Japan.\nOn 6 May, Stalin replaced Molotov as Premier of the Soviet Union. Although de facto head of government for a decade and a half, Stalin concluded that relations with Germany had deteriorated to such an extent that he needed to deal with the problem as de jure head of government as well.\n\nGerman invasion: 1941–1942\n\nIn June 1941, Germany invaded the Soviet Union, initiating the war on the Eastern Front. Despite having prior warning, Stalin was taken by surprise. He formed a military Supreme Command (Stavka), as well as a State Committee of Defence, which he headed as Supreme Commander. The German tactic of blitzkrieg was initially highly effective; the Soviet air force in the western borderlands was destroyed within two days. The German Wehrmacht pushed deep into Soviet territory; soon, Ukraine, Belorussia, and the Baltic states were under German occupation. Soviet refugees flooded into Moscow and Leningrad to escape the Wehrmacht, although there were other Soviet citizens—namely those who were neither ethnically Russian nor Jewish—who welcomed the German Army as liberators; they soon found that the Nazis regarded them as Untermensch, fit only for economic exploitation. By July, Germany's Luftwaffe was bombing Moscow, and by October the Wehrmacht were amassing for a full assault on the capital. Plans were made for the Soviet government to evacuate to Kuibyshev, although Stalin decided to remain in Moscow, believing that his flight would damage troop morale. The German advance on Moscow was halted by the arrival of winter.\n\nAgainst his generals' advice, Stalin emphasised attack over defence. In June 1941, he ordered a scorched earth policy of destroying infrastructure and food supplies before the Germans could seize them, also commanding the NKVD to kill around 100,000 political prisoners in areas the Wehrmacht approached. He purged the military command; several high-ranking figures were demoted or reassigned but a few were arrested and executed. With Order No. 270, Stalin commanded soldiers risking capture to commit suicide or fight to the death, and that those who allowed themselves to be captured were traitors; among those taken as a prisoner of war by the Germans was Stalin's son Yakov, who died in their custody. Stalin issued Order No. 227 in July 1942, which directed that those retreating would be placed in \"penal battalions\" used as cannon fodder on the front lines. Amid the fighting, both the German and Soviet armies disregarded the law of war set forth in the Geneva Conventions; the Soviets heavily publicised Nazi massacres of communists, Jews, and Romani.\n\nThe Soviets allied with the United Kingdom and United States; although the US joined the war against Germany in 1941, little direct assistance reached the Soviets until late 1942.\nResponding to the invasion, the Soviets intensified their industrial enterprises in central Russia, focusing almost entirely on production for the military. They achieved high levels of industrial productivity, outstripping that of Germany. During the war, Stalin was more tolerant of the Russian Orthodox Church, allowing it to resume some of its activities and meeting with Patriarch Sergius in September 1943. He also permitted a wider range of cultural expression, notably permitting formerly suppressed writers and artists like Anna Akhmatova and Dmitri Shostakovich to disperse their work more widely. The Internationale was dropped as the country's national anthem, to be replaced with a more patriotic replacement. There was an increased criticism of cosmopolitanism, particularly the idea of \"rootless cosmopolitanism\", an approach with particular repercussions for Soviet Jews. Comintern was dissolved in 1943, and Stalin encouraged foreign Marxist–Leninist parties to emphasise nationalism over internationalism to broaden their domestic appeal. The Soviet government also began to increasingly promote Pan-Slavist sentiment. Stalin exploited Nazi anti-Semitism, and in April 1942 he sponsored the Jewish Anti-Fascist Committee (JAC) to garner Jewish and foreign support for the Soviet war effort.\n\nIn April 1942 Stalin overrode Stavka by ordering the Soviets' first serious counter-attack, an attempt to seize German-held Kharkov in eastern Ukraine. This attack proved unsuccessful. That year, Hitler shifted his primary goal from an immediate victory in the East, to the more long-term goal of securing the southern Soviet Union to conquer oil fields vital to a long-term German war effort. While Red Army generals saw evidence that Hitler would shift efforts south, Stalin considered this to be a flanking campaign in efforts to take Moscow. In June 1942, the German Army attacked Stalingrad; Stalin ordered the Red Army to hold the city at all costs. This resulted in the protracted Battle of Stalingrad. In December 1942 he placed Konstantin Rokossovski in charge of holding the city. In February 1943, the German troops attacking Stalingrad surrendered. The Soviet victory marked a major turning point in the war; in commemoration, Stalin declared himself Marshal of the Soviet Union.\n\nSoviet counter-attack: 1942–1945\n\nBy November 1942, the Soviets had begun to repulse the important German strategic southern campaign and, although there were 2.5 million Soviet casualties in that effort, it permitted the Soviets to take the offensive for most of the rest of the war on the Eastern Front. Germany attempted an encirclement attack at Kursk, which was successfully repulsed by the Soviets. By the end of 1943, the Soviets occupied half of the territory taken by the Germans from 1941 to 1942. Soviet military industrial output also had increased substantially from late 1941 to early 1943 after Stalin had moved factories well to the East of the front, safe from German invasion and air attack.\n\nIn Allied countries, Stalin was increasingly depicted in a positive light over the course of the war. In 1941, the London Philharmonic Orchestra performed a concert to celebrate his birthday, and in 1942, Time magazine named him \"Man of the Year\". When Stalin learned that people in Western countries affectionately called him \"Uncle Joe\" he was initially offended, regarding it as undignified.\nThere remained mutual suspicions between Stalin, British Prime Minister Winston Churchill, and U.S. President Franklin D. Roosevelt, who were together known as the \"Big Three\". Churchill flew to Moscow to visit Stalin in August 1942 and again in October 1944. Stalin scarcely left Moscow throughout the war, with Roosevelt and Churchill frustrated with his reluctance to travel to meet them.\n\nIn November 1943, Stalin met with Churchill and Roosevelt in Tehran, a location of Stalin's choosing. There, Stalin and Roosevelt got on well, with both desiring the post-war dismantling of the British Empire. At Tehran, the trio agreed that to prevent Germany rising to military prowess yet again, the German state should be broken up. Roosevelt and Churchill also agreed to Stalin's demand that the German city of Konigsberg be declared Soviet territory. Stalin was impatient for the UK and US to open up a Western Front to take the pressure off of the East; they eventually did so in the summer of 1944. Stalin insisted that, after the war, the Soviet Union should incorporate the portions of Poland it occupied pursuant to the Molotov-Ribbentrop Pact with Germany, which Churchill opposed. Discussing the fate of the Balkans, later in 1944 Churchill agreed to Stalin's suggestion that after the war, Bulgaria, Romania, Hungary, and Yugoslavia would come under the Soviet sphere of influence while Greece would come under that of the West.\n\nIn 1944, the Soviet Union made significant advances across Eastern Europe toward Germany, including Operation Bagration, a massive offensive in the Byelorussian SSR against the German Army Group Centre. In 1944 the German armies were pushed out of the Baltic states, which were then re-annexed into the Soviet Union. As the Red Army reconquered the Caucasus and Crimea, various ethnic groups living in the region—the Kalmyks, Chechens, Ingushi, Karachai, Balkars, and Crimean Tatars—were accused of having collaborated with the Germans. Using the idea of collective responsibility as a basis, Stalin's government abolished their autonomous republics and between late 1943 and 1944 deported the majority of their populations to Central Asia and Siberia. Over one million people were deported as a result of the policy.\n\nIn February 1945, the three leaders met at the Yalta Conference. Roosevelt and Churchill conceded to Stalin's demand that Germany pay the Soviet Union 20 billion dollars in reparations, and that his country be permitted to annex Sakhalin and the Kurile Islands in exchange for entering the war against Japan. An agreement was also made that a post-war Polish government should be a coalition consisting of both communist and conservative elements. Privately, Stalin sought to ensure that Poland would come fully under Soviet influence. The Red Army withheld assistance to Polish resistance fighters battling the Germans in the Warsaw Uprising, with Stalin believing that any victorious Polish militants could interfere with his aspirations to dominate Poland through a future Marxist government. Although concealing his desires from the other Allied leaders, Stalin placed great emphasis on capturing Berlin first, believing that this would enable him to bring more of Europe under long-term Soviet control. Churchill was concerned that this was the case, and unsuccessfully tried to convince the U.S. that the Western Allies should pursue the same goal.\n\nVictory: 1945\n\nIn April 1945, the Red Army seized Berlin, Hitler committed suicide, and Germany surrendered unconditionally. Stalin was annoyed that Hitler was dead, having wanted to capture him alive. He ordered his intelligence agencies to secretly bring Hitler's remains to Moscow, seeking to prevent any physical remains becoming a relic for Nazi sympathisers. As the Red Army had conquered German territory, they discovered the extermination camps that the Nazi administration had run. Many Soviet soldiers engaged in looting, pillaging, and rape, both in Germany and parts of Eastern Europe. Stalin refused to punish the offenders. After receiving a complaint about this from Yugoslav communist Milovan Djilas, Stalin asked how after experiencing the traumas of war a soldier could \"react normally? And what is so awful in his having fun with a woman, after such horrors?\"\n\nWith Germany defeated, Stalin switched his focus to the ongoing war with Japan, transferring half a million troops to the far east. Stalin was aware that the United States had developed nuclear weaponry, with which it intended to subdue the Japanese, and was steadfast in entering the war before he could be denied the territories promised to him. On 8 August, in between the atomic bombings of Hiroshima and Nagasaki, the Soviet army invaded Japanese occupied Manchuria and defeated the Kwantung Army. These events led to the Japanese surrender and the complete end of World War II. Soviet forces continued to expand until they occupied all their territorial concessions, but the U.S. rebuffed Stalin's desire for the Red Army to take a role in the occupation of Japan by Allied forces.\n\nStalin attended the Potsdam Conference in July–August 1945, alongside his new British and U.S. counterparts, Prime Minister Clement Attlee and President Harry Truman. At the beginning of the conference, Stalin repeated previous promises to Churchill that he would refrain from a \"Sovietization\" of Eastern Europe. Stalin pushed for reparations from Germany without regard to the base minimum supply for German citizens' survival, which worried Truman and Churchill who thought that Germany would become a financial burden for Western powers.\nHe also pushed for \"war booty\", which would permit the Soviet Union to directly seize property from conquered nations without quantitative or qualitative limitation, and a clause was added permitting this to occur with some limitations. Germany was divided into four zones: Soviet, U.S., British, and French, with Berlin itself—located within the Soviet area—also subdivided thusly.\n\nPost-war era\n\nPost-war reconstruction and famine: 1945–1947\n\nAfter the war, Stalin was—according to Service—at the \"apex of his career\". Within the Soviet Union he was widely regarded as the embodiment of victory and patriotism. His armies controlled eastern and eastern-central Europe up to the River Elbe.\nIn June 1945, Stalin adopted the title of Generalissimus, and stood atop Lenin's Mausoleum to watch a celebratory parade led by Zhukov through Red Square. At a banquet held for army commanders, he described the Russian people as \"the outstanding nation\" and \"leading force\" within the Soviet Union, the first time that he had unequivocally endorsed the Russians over other Soviet nationalities. In 1946, the state published Stalin's Collected Works. In 1947, it brought out a second edition of his official biography, which eulogised him to a greater extent than its predecessor. He was quoted in Pravda on a daily basis and pictures of him remained pervasive on the walls of workplaces and homes.\n\nDespite his strengthened international position, Stalin was cautious about internal dissent and desire for change among the population. He was also concerned about his returning armies, who had been exposed to a wide range of consumer goods in Germany, much of which they had looted and brought back with them. In this he recalled the 1825 Decembrist Revolt by Russian soldiers returning from having defeated France in the Napoleonic Wars. He ensured that returning Soviet prisoners of war went through \"filtration\" camps as they arrived in the Soviet Union, in which 2,775,700 were interrogated to determine if they were traitors. About half were then imprisoned in labour camps. In the Baltic states, where there was much opposition to Soviet rule, de-kulakisation and de-clericalisation programs were initiated, resulting in 142,000 deportations between 1945 and 1949.\n\nThe NKVD were ordered to catalogue the scale of destruction during the war. It was established that 1,710 Soviet towns and 70,000 villages had been destroyed. They recorded that between 26 and 27 million Soviet citizens had been killed, with millions more being wounded, malnourished, or orphaned. In the war's aftermath, some of Stalin's associates suggested modifications to government policy. Post-war Soviet society was more tolerant than its pre-war phase in various respects. Stalin allowed the Russian Orthodox Church to retain the churches it had opened during the war. Academia and the arts were also allowed greater freedom than they had prior to 1941. Recognising the need for drastic steps to be taken to combat inflation and promote economic regeneration, in December 1947 Stalin's government devalued the ruble and abolished the ration-book system. Capital punishment was abolished in 1947 but reinstalled in 1950.\n\nStalin's health was deteriorating, and heart problems forced a two-month vacation in the latter part of 1945.\nHe grew increasingly concerned that senior political and military figures might try to oust him; he prevented any of then from becoming powerful enough to rival him and had their apartments bugged with listening devices. He demoted Molotov, and increasingly favoured Beria and Malenkov for key positions. In 1949, he brought Nikita Khrushchev from Ukraine to Moscow, appointing him a Central Committee secretary and the head of the city's party branch. In the Leningrad Affair, the city's leadership was purged amid accusations of treachery; executions of many of the accused took place in 1950.\n\nIn the post-war period there were often food shortages in Soviet cities, and the USSR experienced a major famine from 1946 to 1947. Sparked by a drought and ensuing bad harvest in 1946, it was exacerbated by government policy towards food procurement, including the state's decision to build up stocks and export food internationally rather than distributing it to famine hit areas. Current estimates indicate that between 1 million and 1.5 million people died from malnutrition or disease as a result. While agricultural production stagnated, Stalin focused on a series of major infrastructure projects, including the construction of hydroelectric plants, canals, and railway lines running to the polar north. Much of this was constructed by prison labour.\n\nCold War policy: 1947–1950\n\nIn the aftermath of the Second World War, the British Empire declined, leaving the US and USSR as the dominant world powers. Tensions among these former Allies grew, resulting in the Cold War. Although publicly referring to what Stalin regarded as the aggressive nature of the British and U.S. governments, he thought it unlikely that a war with them would be imminent, believing that several decades of peace was likely. He nevertheless secretly intensified Soviet research into nuclear weaponry, intent on creating an atom bomb. He personally took a keen interest in the development of the weapon. In August 1949, the bomb was successfully tested in the deserts outside Semipalatinsk in Kazakhstan. Stalin also initiated a new military build-up; the Soviet army was expanded from 2.9 million soldiers, as it stood in 1949, to 5.8 million by 1953.\n\nThe US began pushing its interests on every continent, acquiring air force bases in Africa and Asia and ensuring pro-U.S. regimes took power across Latin America. It launched the Marshall Plan in June 1947, with which it sought to undermine Soviet hegemony in eastern Europe. The US also offered financial assistance as part of the Marshall Plan on the condition that they opened their markets to trade, aware that the Soviets would never agree.\nThe Allies demanded that Stalin withdraw the Red Army from northern Iran, which he did in April 1947.\nStalin also tried to maximise Soviet influence on the world stage, unsuccessfully pushing for Libya—recently liberated from Italian occupation—to become a Soviet protectorate. He sent Molotov as his representative to San Francisco to take part in negotiations to form the United Nations, insisting that the Soviets have a place on the Security Council. In April 1949, the Western powers established the North Atlantic Treaty Organisation (NATO), an international military alliance of capitalist countries. Within Western countries, Stalin was increasingly portrayed as the \"most evil dictator alive\" and compared to Hitler.\n\nIn 1948, Stalin edited and rewrote sections of Falsifiers of History, published as a series of Pravda articles in February 1948 and then in book form. Written in response to public revelations of the 1939 Soviet alliance with Germany, it focused on blaming Western powers for the war. He erroneously claimed that the initial German advance in the early part of the war was not a result of Soviet military weakness, but rather a deliberate Soviet strategic retreat. In 1949, celebrations took place to mark Stalin's seventieth birthday (albeit not the correct year) at which Stalin attended an event in the Bolshoi Theatre alongside communist leaders from across Europe and Asia.\n\nThe Eastern Bloc\n\nAfter the war, Stalin sought to retain Soviet dominance across Eastern Europe while expanding its influence in Asia.\nCautious regarding the responses from the Western Allies, Stalin avoided immediately installing Communist Party governments across Eastern Europe, instead initially ensuring that Marxist-Leninists were placed in coalition ministries. In contrast to his approach to the Baltic states, he rejected the proposal of merging these states into the Soviet Union, rather recognising them as independent nation-states.\nHe was faced with the problem that there were few Marxists left in Eastern Europe, with most having been killed by the Nazis. He demanded that war reparations be paid by Germany and its Axis allies Hungary, Romania, and the Slovak Republic.\nAware that these countries had been pushed toward socialism through invasion rather than by proletarian revolution, Stalin referred to them not as \"dictatorships of the proletariat\" but as \"people's democracies\", suggesting that in these countries there was a pro-socialist alliance combining the proletariat, peasantry, and lower middle-class.\n\nChurchill observed that an \"Iron Curtain\" had been drawn across Europe, separating the east from the west. In September 1947, a meeting of East European leaders was held in Szklarska Poręba, Poland, from which was formed Cominform to co-ordinate the Communist Parties across Eastern Europe and also in France and Italy. Stalin did not personally attend the meeting, sending Zhdanov in his place. Various East European communists also visited Stalin in Moscow. There, he offered advice on their ideas; for instance he cautioned against the Yugoslav idea for a Balkan federation incorporating Bulgaria and Albania. Stalin had a particularly strained relationship with Yugoslav leader Josip Broz Tito due to the latter's continued calls for Balkan federation and for Soviet aid for the communist forces in the ongoing Greek Civil War. In March 1948, Stalin launched an anti-Tito campaign, accusing the Yugoslav communists of adventurism and deviating from Marxist–Leninist doctrine. At the second Cominform conference, held in Bucharest in June 1948, East European communist leaders all denounced Tito's government, accusing them of being fascists and agents of Western capitalism. Stalin ordered several assassination attempts on Tito's life and contemplated invading Yugoslavia.\n\nStalin suggested that a unified, but demilitarised, German state be established, hoping that it would either come under Soviet influence or remain neutral. When the US and UK remained opposed to this, Stalin sought to force their hand by blockading Berlin in June 1948. He gambled that the others would not risk war, but they airlifted supplies into West Berlin until May 1949, when Stalin relented and ended the blockade. In September 1949 the Western powers transformed Western Germany into an independent Federal Republic of Germany; in response the Soviets formed East Germany into the German Democratic Republic in October. In accordance with their earlier agreements, the Western powers expected Poland to become an independent state with free democratic elections. In Poland, the Soviets merged various socialist parties into the Polish United Workers' Party, and vote rigging was used to ensure that it secured office. The 1947 Hungarian elections were also rigged, with the Hungarian Working People's Party taking control. In Czechoslovakia, where the communists did have a level of popular support, they were elected the largest party in 1946.\nAcross Eastern Europe, the Soviet model was enforced, with a termination of political pluralism, agricultural collectivisation, and investment in heavy industry. It was aimed for economic autarky within the Eastern Bloc. Monarchies were removed from power in Romania and Bulgaria.\n\nAsia\n\nIn October 1949, Mao took took power in China. With this accomplished, Marxist governments now controlled a third of the world's land mass. Privately, Stalin revealed that he had underestimated the Chinese Communists and their ability to win the civil war, instead encouraging them to make another peace with the KMT. In December 1949, Mao visited Stalin. Initially Stalin refused to repeal the Sino-Soviet Treaty of 1945, which significantly benefited the Soviet Union over China, although in January 1950 he relented and agreed to sign a new treaty between the two countries. Stalin was concerned that Mao might follow Tito's example by pursuing a course independent of Soviet influence, and made it known that if displeased he would withdraw assistance from China; the Chinese desperately needed said assistance after decades of civil war.\n\nAfter the Second World War, the Soviet Union and the United States divided up the Korean Peninsula, formerly a Japanese colonial possession, along the 38th parallel, setting up a communist government in the north and a pro-Western government in the south. North Korean leader Kim Il-Sung visited Stalin in March 1949 and again in March 1950; he wanted to invade the south and although Stalin was initially reticent to provide support, he eventually agreed by May 1950. The North Korean Army launched the Korean War by invading the south in June 1950, making swift gains and capturing Seoul. Both Stalin and Mao believed that a swift victory would ensue. The U.S. went to the UN Security Council—which the Soviets were boycotting over its refusal to recognise Mao's government—and secured military support for the South Koreans. U.S. led forces pushed the North Koreans back. Stalin wanted to avoid direct Soviet conflict with the U.S., convincing the Chinese to hold the 38th Parallel.\n\nPolicy towards Jews and Israel\n\nThe Soviet Union was one of the first nations to extend diplomatic recognition to the newly created state of Israel in 1948. However, when the Israeli ambassador Golda Meir arrived in the USSR, Stalin was angered by the Jewish crowds who arrayed to greet her. He was further angered by Israel's growing alliance with the U.S. After Stalin fell out with Israel, he launched an anti-Jewish campaign within the Soviet Union and the Eastern Bloc. In November 1948, he abolished the JAC, and show trials took place for some of its members. The Soviet press engaged in attacks on Zionism, Jewish culture, and \"rootless cosmopolitanism\", with growing levels of anti-Semitism being expressed across Soviet society.\n\nStalin's increasing tolerance of anti-Semitism may have stemmed from his increasing Russian nationalism or from the recognition that anti-Semitism had proved a useful mobilising tool for Hitler and that he could do the same; he may have increasingly viewed the Jewish people as a \"counter-revolutionary\" nation whose members were loyal to the U.S. There were rumours, although they have never been substantiated, that Stalin was planning on deporting all Soviet Jews to the Jewish Autonomous Region in Birobidzhan, eastern Siberia.\n\nFinal years: 1950–1953\n\nIn his later years, Stalin was in poor health. He took increasingly long holidays; in 1950 and again in 1951 he spent almost five months vacationing at his Abkhazian dacha. Stalin nevertheless mistrusted his doctors; in January 1952 he had one imprisoned after they suggested that he should retire to improve his health. In September 1952, several Kremlin doctors were arrested for allegedly plotting to kill senior politicians in what came to be known as the Doctors' Plot; the majority of the accused were Jewish.Ro'i, Yaacov, Jews and Jewish Life in Russia and the Soviet Union, Routledge, 1995, , pp. 103–6 He instructed the arrested doctors to be tortured to ensure confession. In November, the Slánský trial took place in Czechoslovakia as 13 senior Communist Party figures, 11 of them Jewish, were accused and convicted of being part of a vast Zionist-American conspiracy to subvert Eastern Bloc governments. That same month, a much publicised trial of accused Jewish industrial wreckers took place in Ukraine. In 1951, he initiated the Mingrelian affair, a purge of the Georgian branch of the Communist Party which resulted in over 11,000 deportations.\n\nFrom 1946 until his death, Stalin only gave three public speeches, two of which lasted only a few minutes. The amount of written material that he produced also declined. In 1950, Stalin issued the article \"Marxism and Problems of Linguistics\", which reflected his interest in questions of Russian nationhood.\nIn 1952, Stalin's last book, The Economic Problems of Socialism in the USSR, was published. It sought to provide a guide to leading the country for after his death. In October 1952, Stalin gave an hour and a half speech at the Central Committee plenum. There, he emphasised what he regarded as leadership qualities necessary in the future and highlighted the weaknesses of various potential successors, particularly Molotov and Mikoyan. In 1952, he also eliminated the Politburo and replaced it with a larger version which he called the Presidium.\n\nDeath and funeral: 1953\n\nOn 1 March 1953, Stalin's staff found him semi-conscious on the bedroom floor of his Volynskoe dacha, having urinated on himself. He had suffered a cerebral hemorrhage. He was moved onto a couch and remained there for three days. He was hand-fed using a spoon, given various medicines and injections, and leeches were applied to him. Svetlana and Vasily were called to the dacha on 2 March; the latter was drunk and angrily shouted at the doctors, resulting in him being sent home. Stalin died on 5 March 1953. According to Svetlana, it had been \"a difficult and terrible death\".\n\nAn autopsy revealed that he had died of a cerebral haemorrhage and that he also suffered from severe damage to his cerebral arteries due to atherosclerosis. It is possible that Stalin was murdered. Beria has been suspected of murder, although no firm evidence has ever appeared. \n\nStalin's death was announced on 6 March. The body was embalmed for long-term preservation, and then placed on display in Moscow's House of Unions for three days. Crowds were such that a crush killed around 100 people. The subsequent funeral involved the body being laid to rest in Lenin's Mausoleum in Red Square on 9 March. Hundreds of thousands attended. That month featured a surge in arrests for \"anti-Soviet agitation\" as those celebrating Stalin's death came to police attention. The Chinese government instituted a period of official mourning for Stalin's death.\n\nAftermath: 1953–1961\n\nStalin left no anointed successor nor a framework within which a transfer of power could take place. The Central Committee met on the day of his death, with Malenkov, Beria, and Khruschev emerging as the party's key figures. The system of collective leadership was restored, and measures introduced to prevent any one member attaining autocratic domination again. Reforms to the Soviet system were immediately implemented. Economic reform scaled back the mass construction projects, placed a new emphasis on house building, and eased the levels of taxation on the peasantry to stimulate production. The new leaders sought rapprochement with Yugoslavia and a less hostile relationship with the U.S., pursuing a negotiated end to the Korean War in July 1953. The doctors who had been imprisoned were released and the anti-Semitic purges ceased. A mass amnesty for those imprisoned for non-political crimes was issued, halving the country's inmate population, while the state security and Gulag systems were reformed, with torture being banned in April 1953.\n\nIn March, Malenkov denounced the Stalin personality cult. Pravda restrained its praise of Stalin and began to criticise his personality cult. Stalingrad was renamed Volgograd, while Svetlana changed her surname from Stalin to Allilueva. \nIn 1956, Khruschev gave his \"Secret Speech\", titled \"On the Cult of Personality and Its Consequences\", to a closed session of the Party's 20th Congress. There, Khrushchev denounced Stalin for both his mass repression and his personality cult. He repeated these denunciations at the 22nd Party Congress in October 1962. In October 1961, Stalin's body was removed from the mausoleum and buried in the Kremlin Wall Necropolis next to the Kremlin walls, the location marked only by a simple bust.\n\nPolitical ideology\n\nStalin claimed to have embraced Marxism at the age of fifteen, and it served as the guiding philosophy throughout his adult life; according to Montefiore, it held a \"quasi-religious\" value for Stalin. Although he never became a Georgian nationalist, during his early life elements from Georgian nationalist thought blended with Marxism in his outlook. The historian Alfred J. Rieber noted that he had been raised in \"a society where rebellion was deeply rooted in folklore and popular rituals\". In 1917, Stalin wrote that \"there is dogmatic Marxism and there is creative Marxism. I stand on the ground of the latter\". Volkogonov however believed that Stalin's Marxism was shaped by his \"dogmatic turn of mind\", suggesting that this had been instilled in the Soviet leader during his education in religious institutions. According to scholar Robert Service, Stalin's \"few innovations in ideology were crude, dubious developments of Marxism\". Some of these derived from political expediency rather than any sincere intellectual commitment; Stalin would often turn to ideology post hoc to justify his decisions. Stalin referred to himself as a praktik, meaning that he was more of a practical revolutionary than a theoretician.\n\nAs a Marxist, Stalin believed in an inevitable class war between the world's working and middle classes. He believed that the working classes would prove successful in this struggle and would establish a dictatorship of the proletariat, regarding the Soviet Union as an example of such a state. He also believed that this proletarian state would need to introduce repressive measures to ensure the full crushing of the propertied classes, and thus the class war would intensify with the advance of socialism. The new state would then be able to ensure that all citizens had access to work, food, shelter, healthcare, and education, with the wastefulness of capitalism eliminated by a new, standardised economic system. According to Sandle, Stalin was \"committed to the creation of a society that was industrialized, collectivized, centrally planned and technologically advanced.\"\n\nStalin claimed to be a loyal Leninist. Nevertheless, he was—according to Service—\"not a blindly obedient Leninist\". Stalin respected Lenin, but not uncritically, and spoke out when he believed that Lenin was wrong. During the period of his revolutionary activity, Stalin regarded some of Lenin's views and actions as being the self-indulgent activities of a spoiled émigré, deeming them counterproductive for those Bolshevik activists based within the Russian Empire itself. After the October Revolution, they continued to have differences. Whereas Lenin believed that all countries across Europe and Asia would readily unite as a single state following proletariat revolution, Stalin argued that national pride would prevent this, and that different socialist states would have to be formed; in his view, a country like Germany would not readily submit to being part of a Russian-dominated federal state. Stalin biographer Oleg Khlevniuk nevertheless believed that the pair developed a \"strong bond\" over the years, and after Lenin's death, Stalin relied heavily on Lenin's writings—far more so than those of Marx and Engels—to guide him in the affairs of state. Stalin adopted the Leninist view on the need for a revolutionary vanguard who could lead the proletariat rather than being led by them. Leading this vanguard, he believed that the Soviet peoples needed a strong, central figure—akin to a Tsar—whom they could rally around. In his words, \"the people need a Tsar, whom they can worship and for whom they can live and work\". He read about, and admired, two Tsars in particular: Ivan the Terrible and Peter the Great.\n\nStalinism was a development of Leninism, and while Stalin avoided using the term \"Marxism-Leninism-Stalinism\", he allowed others to do so. Following Lenin's death, Stalin contributed to the theoretical debates within the Communist Party, namely by developing the idea of \"socialism in one country\". This concept was intricately linked to factional struggles within the party, particularly against Trotsky. He first developed the idea in December 1924 and elaborated upon in his writings of 1925–26. Stalin's doctrine held that socialism could be completed in Russia but that its final victory there could not be guaranteed because of the threat from capitalist intervention. For this reason, he retained the Leninist view that world revolution was still a necessity to ensure the ultimate victory of socialism. Although retaining the Marxist belief that the state would wither away as socialism transformed into pure communism, he believed that the Soviet state would remain until the final defeat of international capitalism. This concept synthesised Marxist and Leninist ideas with nationalist ideals, and served to discredit Trotsky—who promoted the idea of \"permanent revolution\"—by presenting the latter as a defeatist with little faith in Russian workers' abilities to construct socialism.\n\nStalin viewed nations as contingent entities which were formed by capitalism and could merge into others. Ultimately he believed that all nations would merge into a single, global human community, and regarded all nations as inherently equal. Stalin argued that the Jews possessed a \"national character\" but were not a \"nation\" and were thus unassimilable. He argued that Jewish nationalism, particularly Zionism, was hostile to socialism. In his work, he stated that \"the right of secession\" should be offered to the ethnic-minorities of the Russian Empire, but that they should not be encouraged to take that option. He was of the view that if they became fully autonomous, then they would end up being controlled by the most reactionary elements of their community; as an example he cited the largely illiterate Tatars, whom he claimed would end up dominated by their mullahs. Khlevniuk therefore argued that Stalin reconciled Marxism with imperialism.\nAccording to Service, Stalin's Marxism was imbued with a great deal of Russian nationalism. However, according to Montefiore, Stalin's embrace of the Russian nation was pragmatic, as the Russians were the core of the population of the USSR; it was not a rejection of his Georgian origins. Stalin's push for Soviet westward expansion into eastern Europe resulted in accusations of Russian imperialism.\n\nPersonal life and characteristics \n\nIn adulthood, Stalin measured 5 ft tall. To give the impression that he was taller, he wore stacked shoes, and stood on a small wooden platform during parades. His mustached face was pock-marked from smallpox during childhood. He was born with a webbed left foot, and his left arm had been permanently injured in childhood which left it shorter than his right and lacking in flexibility, which was probably the result of being hit, at the age of 12, by a horse-drawn carriage.\n\nDuring his youth, Stalin usually wore a red satin shirt, grey coat, and red fedora, or alternatively a traditional Georgian chokha and white hood. At the time he grew his hair long and often had a beard. His cultivation of a scruffy appearance deliberately sought to reject middle-class aesthetic values. After the summer of 1918 until his death he took to wearing military-style clothing, in particular long black boots and a light-coloured collarless tunics, and also carried a gun. He had few material demands and lived plainly, with simple and inexpensive clothing and furniture; his interest was in power rather than wealth. He was a lifelong smoker, who smoked both a pipe and cigarettes.\n\nStalin was ethnically Georgian, and had grown up speaking the Georgian language, only learning Russian when aged eight or nine. Stalin remained proud of his Georgian identity and culture, and throughout his life, he retained his Georgian accent when speaking Russian. According to Montefiore, his adoption of Russian culture has been exaggerated, and he was profoundly Georgian in his lifestyle and personality, spending much of his final years in his homeland. Montefiore was of the view that \"after 1917, he became quadri-national: Georgian by nationality, Russian by loyalty, internationalist by ideology, Soviet by citizenship.\" Service stated that Stalin \"would never be Russian\", could not credibly pass as one and contrary to what has been previously suggested, he never really tried to be one. Stalin was described as \"Asiatic\" by his colleagues, and told a Japanese journalist, \"I am not a European man, but an Asian, a Russified Georgian\". He first adopted the pseudonym \"Stalin\" in 1912; being based on the Russian word for \"steel\" it has often been translated as \"Man of Steel\". Prior nicknames included \"Koba\", \"Soselo\", \"Ivanov\" and many others.\n\nStalin had a soft voice, and when speaking Russian he did so slowly, carefully choosing his phrasing. Although he avoided doing so in public, in private Stalin used coarse language. Described as a poor orator, according to Volkogonov, Stalin's speaking style was \"simple and clear, without flights of fancy, catchy phrases or platform histrionics\". He rarely spoke before large audiences, and preferred to express himself in written form. His writing style was similar, being characterised by its simplicity, clarity, and conciseness.\n\nPersonality\n\nTrotsky and several other Soviet figures promoted the idea that Stalin was a mediocrity. This idea gained widespread acceptance outside the Soviet Union but was misleading. According to Montefiore, \"it is clear from hostile and friendly witnesses alike that Stalin was always exceptional, even from childhood\". Stalin had a complex mind, with a great deal of self-control. He rarely raised his voice in anger, although as his health declined in later life he became increasingly unpredictable and bad tempered. A hard worker, he displayed a keen desire to learn, and had an excellent memory. When in power, he scrutinised many details of Soviet life, from film scripts to architectural plans and military hardware.\n\nStalin was a capable actor who could play many different roles to different audiences, and was adept at deception, often lying or deceiving others as to his true motives and aims. He was a good organiser, and judged others according to their inner strength, practicality, and cleverness. Despite his short temper and tough-talking attitude, he could be very charming; when relaxed, he cracked jokes and mimicked others. Montefiore suggested that it was his charm which represented \"the foundation of Stalin's power in the Party\". Several historians have seen it appropriate to follow Lazar Kaganovich's description of there being \"several Stalins\" as a means of understanding his multi-faceted personality.\n\nStalin was ruthless, temperamentally cruel,  and had a propensity for violence excessive even among the Bolsheviks. He lacked compassion, something which Volkogonov suggested might have been accentuated by his many years spent in prison and exile, although he was capable of acts of kindness to strangers, even amid the Great Terror. He never personally attended any torture sessions or executions. Service stated that Stalin \"derived deep satisfaction\" from degrading and humiliating people, and that he \"delighted\" in keeping even close associates in a state of \"unrelieved fear\". He was capable of self-righteous indignation, and was both resentful, and vengeful, holding onto grievances against others for many years. He was also suspicious and conspiratorial, prone to believing that people were plotting against him and that there were vast international conspiracies behind acts of dissent. Montefiore thought that Stalin's brutality marked him out as a \"natural extremist\"; Service suggested that he had a paranoid or sociopathic personality disorder, with this \"dangerously damaged\" personality supplying \"the high-octane fuel for the journey to the Great Terror\". Other historians have argued that Stalin's brutality should be seen not as a result of any personality traits, but through his unflinching commitment to the survival of his socialist state and the cause of international socialism. By the period of glasnost and perestroika, Soviet psychologists were openly debating whether Stalin had been insane.\n\nStalin admired artistic talent, and protected several Soviet writers, such as Mikhail Bulgakov, even when their work was regarded as harmful to his regime. He enjoyed listening to music, and owned around 2,700 albums. His taste in music and theatre was conservative, favouring classical drama, opera, and ballet over what he dismissed as experimental \"formalism\". He was a voracious reader, with a library of over 20,000 books. Little of this was fiction, although he knew passages from the work of Alexander Pushkin and Nikolay Nekrasov by heart and could also recite Walt Whitman. He favoured historical studies, keeping up with debates in the study of Russian, Mesopotamian, ancient Roman, and Byzantine history. He claimed to read as many as 500 pages a day, with Montefiore regarding him as an accomplished autodidact and intellectual.\n\nStalin typically awoke at around 11am, and worked late into the evening. His main meal was lunch, which took place between 3 and 5pm, while dinner was held no earlier than 9pm. He often chose to dine with other Politburo members and their wives who lived in the Kremlin. He spent much time in the Kremlin cinema, where he enjoyed watching films with other officials late at night; he had a particular fondness for the Western genre, although his favourite film was the 1938 film Volga Volga. Stalin enjoyed alcoholic beverages, and at dinner parties and other social events would encourage those around him to join in, hoping that in a drunken state they would reveal secrets. He enjoyed practical jokes, for instance by putting a tomato on the seat of Politburo members and waiting for them to sit on it, and encouraged singing at social events. As an infant, Stalin had displayed a love of flowers, and later in life he became a keen gardener. His dacha in the Moscow suburb of Volynskoe was surrounded by a 50-acre park, with Stalin devoting much attention to its agricultural activities. Stalin also enjoyed billiards and was an accomplished player.\n\nStalin disliked travel, and refused to travel by plane. As leader of the USSR, he rarely left Moscow, unless to go to his dacha or on holiday. His choice of favoured holiday house changed over the years, although he holidayed in southern parts of the USSR every year from 1925 to 1936 and again from 1945 to 1951. Along with other senior figures, he had a dacha at Zubalova, 35 km outside Moscow, although he ceased using it after Nadya's 1932 suicide. After 1932, he favoured Abkhazia as a holiday destination, being a friend of its leader, Nestor Lakoba. In 1934, his new  Kuntsevo Dacha was built; 9 km from the Kremlin, it became his primary residence. In 1935 he began using a new dacha provided for him by Lakoba at Novy Afon; in 1936, he had the Kholodnaya Rechka dacha built on the Abkhazian coast, designed by Miron Merzhanov. Before World War II he added the Lipki estate and Semyonovskaya and had at least four dachas in the south by 1937, including one near Sochi. A luxury villa near Gagri was given to him by Beria. In Abkhazia he maintained a mountain retreat. After the war he added dachas at Novy Afon, near Sukhumi, in the Valdai Hills, and at Lake Mitsa. Another estate was near Zelyony Myss on the Black Sea. All these dachas, estates, and palaces were staffed, well-furnished and equipped, kept safe by security forces, and were mainly used privately, rarely for diplomatic purposes.\n\nAlthough Stalin publicly condemned anti-Semitism, he was repeatedly accused of being anti-Semitic. People who knew Stalin, such as Nikita Khrushchev, suggested that he had long harbored negative sentiments toward Jews, and anti-Semitic trends in the Kremlin's policies were further fueled by the struggle against Leon Trotsky. After Stalin's death, Khrushchev made the claim that Stalin hinted that he should incite anti-Semitism in the Ukraine, allegedly telling him that \"the good workers at the factory should be given clubs so they can beat the hell out of those Jews.\" In 1946, Stalin allegedly said privately that \"every Jew is a potential spy.\" Conquest stated that although Stalin had Jewish associates, he promoted anti-Semitism. Service cautioned that there was \"no irrefutable evidence\" of anti-Semitism in Stalin's published work, although his private statements and public actions were \"undeniably reminiscent of crude antagonism towards Jews\"; he added that throughout his lifetime, Stalin \"would be the friend, associate or leader of countless individual Jews\". According to Beria, Stalin had affairs with several Jewish women.\n\nRelationships and family\n\nFriendship was important to Stalin, and he used it to gain and maintain power. He gave nicknames to his favourites, for instance referring to Yezhov as \"my blackberry\". Stalin was sociable and enjoyed a joke. According to Montefiore, Stalin's friendships \"meandered between love, admiration, and venomous jealousy\". While head of the Soviet Union he remained in contact with many of his old friends in Georgia, sending them letters and gifts of money.\n\nStalin was attracted to women and there are no reports of any homosexual tendencies; according to Montefiore, in his early life Stalin \"rarely seems to have been without a girlfriend\". He was sexually promiscuous, although rarely talked about his sex life. Montefiore noted that Stalin's favoured types were \"young, malleable teenagers or buxom peasant women\", who would be supportive and unchallenging toward him. According to Service, Stalin \"regarded women as a resource for sexual gratification and domestic comfort\". Stalin married twice and had several offspring. He married his first wife, Ekaterina Svanidze, in 1906. According to Montefiore, theirs was \"a true love match\"; Volkogonov suggested that she was \"probably the one human being he had really loved\". They had a son, Yakov, who often frustrated and annoyed Stalin. Yakov had a daughter, Galina, before fighting for the Red Army in the Second World War. He was captured by the German Army and then committed suicide.\n\nStalin's second wife was Nadezhda Alliluyeva; theirs was not an easy relationship, and they often rowed. They had two biological children—a son, Vasiliy, and a daughter, Svetlana—and adopted another son, Artyom Sergeev, in 1921. During his marriage to Nadezhda, Stalin had affairs with many other women, most of whom were fellow revolutionaries or their wives. Nadezdha suspected that this was the case, and committed suicide in 1932. Stalin regarded Vasily as spoiled and often chastised his behaviour; as Stalin's son, Vasily nevertheless was swiftly promoted through the ranks of the Red Army and allowed a lavish lifestyle. Conversely, Stalin had an affectionate relationship with Svetlana during her childhood, and was also very fond of Artyom. In later life, he disapproved of Svetlana's various suitors and husbands, putting a strain on his relationship with her. After the Second World War he made little time for his children and his family played a decreasingly important role in his life. After Stalin's death, Svetlana defected to the U.S.\n\nAfter Nadezdha's death, Stalin became increasingly close to his sister-in-law Zhenya Alliluyeva; Montefiore believed that they were probably lovers. There are unproven rumours that from 1934 onward he had a relationship with his housekeeper Valentina Istomina. Stalin had at least two illegitimate children, although he never recognised these as being his. One of these, Constantin Kuzakova, later taught philosophy at the Leningrad Military Mechanical Institute, but never met his father. The other, Alexander, was the son of Lidia Pereprygia; he was raised as the son of a peasant fisherman and the Soviet authorities made him swear never to reveal that Stalin was his biological father.\n\nLegacy\n\nThe historian Robert Conquest stated that Stalin, \"perhaps more than any other [person,] determined the course of the twentieth century\". Service regarded the Georgian as \"one of the twentieth century's outstanding politicians\".\nMontefiore labelled Stalin as \"that rare combination: both 'intellectual' and killer\", a man who was \"the ultimate politician\" and \"the most elusive and fascinating of the twentieth-century titans\". According to historian Kevin McDermott, interpretations of Stalin range from \"the sycophantic and adulatory to the vitriolic and condemnatory\". For most Westerners and anti-communist Russians, he is viewed overwhelmingly negatively as a mass murderer; for significant numbers of Russians and Georgians, he is regarded as a great statesman and state-builder.\n\nStalin strengthened and stabilised the Soviet Union. Service suggested that without Stalin's leadership the Soviet Union might have collapsed long before 1991. By the time of his death, the country had been transformed into a world power and industrial colossus, with a literate population. According to Service, Stalin's USSR \"could claim impressive achievements\" in terms of urbanisation, military strength, education, and Soviet pride. Although millions of Soviet citizens despised him, support for him was nevertheless widespread throughout Soviet society.\n\nStalin's Soviet Union has been characterised as totalitarian. Various biographers have described him as a dictator, an autocrat, or accused him of practicing Caesarism. Montefiore argued that while Stalin initially ruled as part of a Communist Party oligarchy, in 1934 the Soviet government transformed from this oligarchy into a personal dictatorship, with Stalin only becoming \"absolute dictator\" between March and June 1937, when senior military and NKVD figures were eliminated. In both the Soviet Union and elsewhere he came to be portrayed as an \"Oriental despot\". The biographer Dmitri Volkogonov characterised him as \"one of the most powerful figures in human history\", while McDermott stated that Stalin had \"concentrated unprecedented political authority in his hands\", and Service noted that by the late 1930s, Stalin \"had come closer to personal despotism than almost any monarch in history\".\n\nMcDermott nevertheless cautioned about \"over-simplistic stereotypes\"—promoted in the fiction of writers like Aleksandr Solzhenitsyn, Vasily Grossman, and Anatoly Rybakov—that portrayed Stalin as an omnipotent and omnipresent tyrant who controlled every aspect of Soviet life through repression and totalitarianism. Service similarly warned of the portrayal of Stalin as an \"unimpeded despot\", noting that \"powerful though he was, his powers were not limitless\", and his rule depended on his willingness to conserve the Soviet structure he had inherited. Khlevniuk noted that at various points, particularly when Stalin was old and frail, there were \"periodic manifestations\" in which the party oligarchy threatened his autocratic control. Stalin denied to foreign visitors that he was a dictator, stating that those who labelled him such did not understand the Soviet governance structure. Stalin has also been described as a terrorist for his revolutionary activities in Georgia.\n\nA vast literature devoted to Stalin has been produced; it is so substantial that even specialists could not read it all.\nDuring Stalin's lifetime, his approved biographies were largely hagiographic in content. Stalin ensured that these works gave very little attention to his early life, particularly because he did not wish to emphasise his Georgian origins in a state numerically dominated by Russians. A large number of Stalin biographies have been published since his death. Until the 1980s, these relied largely on the same sources of information as each other. Under the administration of Mikhail Gorbachev a number of previously classified files on Stalin's life were made available to historians; during Gorbachev's glasnost period, Stalin became \"one of the most urgent and vital issues on the public agenda\" in the Soviet Union. After the dissolution of the Union in 1991, the rest of the archives were opened to historians, resulting in much new information about Stalin coming to light, and producing a flood of new research. \n\nLeninists remain divided in their views on Stalin. Some view him as the authentic successor to Lenin, who continued and developed his legacy, while others believe that Stalin betrayed Lenin's ideas by deviating from them. The socio-economic nature of Stalin's Soviet Union has also been much debated, varyingly being labelled a form of state socialism, state capitalism, bureaucratic collectivism, or a totally unique mode of production.\n\nDeath toll and allegations of genocide\n\nAccording to Service, Stalin was \"one of the most notorious figures in history\", one who ordered \"the systematic killing of people on a massive scale\". Khlevniuk stated that Stalin's actions \"upended or utterly destroyed literally millions upon millions of lives\". Official records show that 800,000 were shot in the Soviet Union between 1930 and 1952, although a larger number died during torture or as a result of poor conditions in labour camps. Many more died as a result of famines and starvation; particularly during the 1932–33 famine.\n\nMontefiore suggested that Stalin was ultimately responsible for the deaths of between 20 and 25 million people, with Khlevniuk stating that at least 60 million people faced some form of repression or discrimination under Stalin's regime. In his 2008 edition of The Great Terror, Conquest stated that \"at least 15 million people\" were killed by \"the whole range of Soviet regime's terrors\", although acknowledged that exact numbers will never be known. The historian and archival researcher Stephen G. Wheatcroft attributes roughly 3 million deaths to the Stalinist regime, including those from criminal negligence but excluding famine deaths, which he and historian R. W. Davies estimate to be around 5.5 to 6.5 million. American historian Timothy D. Snyder asserts that while the Nazi regime killed 11–12 million non-combatants, Stalin's was responsible for about 6–9 million, disputing the conventional wisdom that Stalin killed more than Hitler.\n\nHistorians continue to debate whether or not the Holodomor should be called a genocide.Rebekah Moore,  \"'A Crime Against Humanity Arguably Without Parallel in European History': Genocide and the 'Politics' of Victimhood in Western Narratives of the Ukrainian Holodomor.\" Australian Journal of Politics & History 58#3 (2012): 367-379; Laura C. Collins, \"Book Review: The Holodomor Reader: A Sourcebook on the Famine of 1932–1933 in Ukraine,\" Genocide Studies and Prevention: An International Journal (2015) 9#1 : 114–115 [http://scholarcommons.usf.edu/cgi/viewcontent.cgi?article1320&context\ngsp online].  In any case, Stalin is given a great deal of blame. Davies and Wheatcroft argue the great famine was, “a consequence of the decision to industrialise this peasant country at breakneck speed.\" They emphasize Moscow's ignorance of agriculture and its priority given to food for industrial workers.  They state, \"We do not at all absolve Stalin from responsibility for the famine. His policies towards the peasants were ruthless and brutal. But the...Soviet leadership which was struggling with a famine crisis which had been caused partly by their wrongheaded policies, but was unexpected and undesirable.\" They state: \"We have found no evidence, either direct or indirect, that Stalin sought deliberately to starve the peasants”.  From the other side of the debate, historian Norman Naimark argues:\nMost scholars agree that there was enough grain in the Soviet Union in this period to feed everyone in Ukraine at a minimal level.  But forced requisitioning removed the margin of sufficiency and sank the region into famine, cannibalism, and desperation.  There is not a lot of evidence that Stalin himself ordered the Ukrainian killer famine, but there is every reason to believe he knew about it, understood what was happening, and was completely indifferent to the fate of the victims. This may not be enough evidence to convict him in an international court of justice as a genocidaire, but that does not mean that the event itself cannot be judged as genocide.Norman M. Naimark, \"Stalin and the Question of Soviet Genocide\" pp 39-48 in \n\nIn the Soviet Union and its successor states\n\nKhrushchev's de-Stalinisation process in Soviet society ended when he was replaced as leader by Leonid Brezhnev in 1964; the latter introduced a level of re-Stalinisation within the Soviet Union. In 1969 and again in 1979, plans were proposed for a full rehabilitation of Stalin's legacy; both were defeated by complaints both domestically and from foreign Communist parties. Gorbachev saw the total denunciation of Stalin as being necessary for the regeneration of Soviet society. After the fall of the Soviet Union in 1991, the first President of the new Russian Federation, Boris Yeltsin, also retained Gorbachev's denunciation of Stalin but added to it a denunciation of Lenin. His successor, Vladimir Putin, did not seek to rehabilitate Stalin but placed an emphasis on celebrating Soviet achievement under Stalin's leadership rather than the repressions.\n\nAmid the social and economic turmoil of the post-Soviet period, many Russians viewed Stalin as having overseen an era of order, predictability, and pride. He remains a revered figure among many Russian nationalists, who feel nostalgic about the Soviet victory over Nazi Germany in World War II, and he is regularly invoked approvingly within both Russia's far-left and far-right.\nIn a 2006 survey, 30% of Russians aged over 30 stated that they would definitely or probably vote for Stalin,Mendelson, Sarah E. and Gerber, Theodore P. (January/February 2006) [https://www.foreignaffairs.com/articles/russia-fsu/2006-01-01/failing-stalin-test Failing the Stalin Test] . Foreign Affairs and in the 2008 Name of Russia television show, Stalin was voted as the third most notable personality in Russian history. A 2017 poll revealed that Stalin's popularity reached a 16-year high among the Russian population, with 46% expressing a favourable view of him. At the same time, there was a growth in pro-Stalinist literature in Russia, much of which relies upon the misrepresentation or fabrication of source material. In this literature, Stalin's repressions are regarded either as a necessary measure to defeat \"enemies of the people\" or the result of lower-level officials acting without Stalin's knowledge.\n\nThe only part of the former Soviet Union where admiration for Stalin has remained consistently widespread is Georgia. Many Georgians resent criticism of Stalin, the most famous figure from their nation's modern history; a 2013 survey by Tbilisi University found 45% of Georgians expressing \"a positive attitude\" to him.\n\nTwenty-six countries have officially recognized the Ukrainian famine of 1932–33 under the legal definition of genocide. In 2006, the Ukrainian Parliament declared it to be genocide, and in 2010 a Ukrainian court posthumously convicted  Stalin, Lazar Kaganovich, Stanislav Kosior and other Soviet leaders of genocide.[http://en.rian.ru/exsoviet/20100113/157536602.html Ukraine court finds Bolsheviks guilty of Holodomor genocide], RIA Novosti (13 January 2010)[http://www.rferl.org/content/Yushchenko_Praises_Guilty_Verdict_Against_Soviet_Leaders_For_Famine/1929566.html Yushchenko Praises Guilty Verdict Against Soviet Leaders For Famine], Radio Free Europe/Radio Liberty (14 January 2010)[http://www.nybooks.com/blogs/nyrblog/2010/may/26/springtime-for-stalin/ Springtime for Stalin] by Timothy D. Snyder, The New York Review of Books (26 May 2010) In the spring of 2010 a new monument in honor of Stalin was erected in Zaporizhia. In late December 2010 the statue had his head cut off by unidentified vandals and the following New Year's Eve it was completely destroyed in an explosion.[http://en.rian.ru/world/20110225/162757220.html Ukraine stands by its view of Stalin as villain – president (Update 1)], RIA Novosti (25 February 2011) In a 2016 Kiev International Institute of Sociology poll, 38% of respondents had a negative attitude to Stalin, 26% a neutral one and 17% a positive (19% refused to answer). [http://pda.pravda.com.ua/news/id_7101130/ About Stalin positive about 1/5 less Ukrainian], Ukrayinska Pravda (4 March 2015). Joseph Stalin. http://en.wikipedia.org/?curid=15641."
  }
}
