{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1837",
  "eid" : "bbf7d330-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778395107,
  "textBody" : "As a literary device, an allegory is a metaphor whose vehicle may be a character, place or event, representing real-world issues and occurrences. Allegory (in the sense of the practice and use of allegorical devices and works) has occurred widely throughout history in all forms of art, largely because it can readily illustrate or convey complex ideas and concepts in ways that are comprehensible or striking to its viewers, readers, or listeners.\n\nWriters or speakers typically use allegories as literary devices or as rhetorical devices that convey (semi-)hidden or complex meanings through symbolic figures, actions, imagery, or events, which together create the moral, spiritual, or political meaning the author wishes to convey.\n\n \n\nEtymology\n\nFirst attested in English in 1382, the word allegory comes from Latin allegoria, the latinisation of the Greek ἀλληγορία (allegoría), \"veiled language, figurative,\"[http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0057%3Aentry%3Da%29llhgori%2Fa ἀλληγορία],\nHenry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library which in turn comes from both ἄλλος (allos), \"another, different\"[http://www.perseus.tufts.edu/hopper/text?docPerseus%3Atext%3A1999.04.0057%3Aentry%3Da%29%2Fllos1 ἄλλος], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library and ἀγορεύω (agoreuo), \"to harangue, to speak in the assembly\"[http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.04.0057%3Aentry%3Da%29goreu%2Fw ἀγορεύω], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library which originate from ἀγορά (agora), \"assembly\".[http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0057%3Aentry%3Da%29gora%2F ἀγορά], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library\n\nTypes\n\nNorthrop Frye discussed what he termed a \"continuum of allegory\", a spectrum that ranges from what he termed the \"naive allegory\" of The Faerie Queene, to the more private allegories of modern paradox literature.[Frye, Northrop. Anatomy of Criticism. Princeton, NJ: Princeton UP, 1957. Print.] In this perspective, the characters in a \"naive\" allegory are not fully three-dimensional, for each aspect of their individual personalities and the events that befall them embodies some moral quality or other abstraction; the allegory has been selected first, and the details merely flesh it out.\n\nMany ancient religions are based on astrological allegories, that is, allegories of the movement of the sun and the moon as seen from the Earth.\n\nClassical allegory\n\nIn classical literature two of the best-known allegories are the Cave in Plato's Republic (Book VII) and the story of the stomach and its members in the speech of Menenius Agrippa (Livy ii. 32). Among the best-known examples of allegory, Plato's Allegory of the Cave, forms a part of his larger work The Republic. In this allegory, Plato describes a group of people who have lived chained in a cave all of their lives, facing a blank wall (514a–b). The people watch shadows projected on the wall by things passing in front of a fire behind them and begin to ascribe forms to these shadows, using language to identify their world (514c–515a). According to the allegory, the shadows are as close as the prisoners get to viewing reality, until one of them finds his way into the outside world where he sees the actual objects that produced the shadows. He tries to tell the people in the cave of his discovery, but they do not believe him and vehemently resist his efforts to free them so they can see for themselves (516e–518a). This allegory is, on a basic level, about a philosopher who upon finding greater knowledge outside the cave of human understanding, seeks to share it as is his duty, and the foolishness of those who would ignore him because they think themselves educated enough.\n[Elliott, R. K. (1967). \"Socrates and Plato's Cave\". Kant-Studien 58 (2): 138.]\n\nIn Late Antiquity Martianus Capella organized all the information a fifth-century upper-class male needed to know into an allegory of the wedding of Mercury and Philologia, with the seven liberal arts the young man needed to know as guests.[Capella, Martianus, William Harris. Stahl, Richard Johnson, and E. L. Burge. The Marriage of Philology and Mercury. New York: Columbia UP, 1977. Print.]\n\nOther early allegories are found in the Hebrew Bible, such as the extended metaphor in Psalm 80 of the Vine and its impressive spread and growth, representing Israel's conquest and peopling of the Promised Land. Also allegorical is Ezekiel 16 and 17, wherein the capture of that same vine by the mighty Eagle represents Israel's exile to Rome.\n\nMedieval allegory\n\nAllegory has an ability to freeze the temporality of a story, while infusing it with a spiritual context. Mediaeval thinking accepted allegory as having a reality underlying any rhetorical or fictional uses. The allegory was as true as the facts of surface appearances. Thus, the Papal Bull Unam Sanctam (1302) presents themes of the unity of Christendom with the pope as its head in which the allegorical details of the metaphors are adduced as facts on which is based a demonstration with the vocabulary of logic: \"Therefore of this one and only Church there is one body and one head—not two heads as if it were a monster... If, then, the Greeks or others say that they were not committed to the care of Peter and his successors, they necessarily confess that they are not of the sheep of Christ.\" This text also demonstrates the frequent use of allegory in religious texts during the Mediaeval Period, following the tradition and example of the Bible.\n\nIn the late 15th century, the enigmatic Hypnerotomachia, with its elaborate woodcut illustrations, shows the influence of themed pageants and masques on contemporary allegorical representation, as humanist dialectic conveyed them.\n\nThe denial of medieval allegory as found in the 12th-century works of Hugh of St Victor and Edward Topsell's Historie of Foure-footed Beastes (London, 1607, 1653) and its replacement in the study of nature with methods of categorisation and mathematics by such figures as naturalist John Ray and the astronomer Galileo is thought to mark the beginnings of early modern science.Peter Harrison, The Bible, Protestantism, and the rise of natural science, Cambridge University Press, , pages 1 to 10 (\"Introduction\")\n\nModern allegory\n\nSince meaningful stories are nearly always applicable to larger issues, allegories may be read into many stories which the author may not have recognised. This is allegoresis, or the act of reading a story as an allegory. Examples of allegory in popular culture that may or may not have been intended include the works of Bertolt Brecht, and even some works of science fiction and fantasy, such as The Chronicles of Narnia by C.S. Lewis and A Kingdom Far and Clear: The Complete Swan Lake Trilogy by Mark Helprin.\n\nThe story of the apple falling onto Isaac Newton's head is another famous allegory. It simplified the idea of gravity by depicting a simple way it was supposedly discovered. It also made the scientific revelation well known by condensing the theory into a short tale.\n\nPoetry and fiction\n\nIt is important to note that while allegoresis may make discovery of allegory in any work, not every resonant work of modern fiction is allegorical, and some are clearly not intended to be viewed this way. According to Henry Littlefield's 1964 article, L. Frank Baum's The Wonderful Wizard of Oz,  may be readily understood as a plot-driven fantasy narrative in an extended fable with talking animals and broadly sketched characters, intended to discuss the politics of the time.[Littlefield, Henry (1964). \"The Wizard of Oz: Parable on Populism\". American Quarterly 16 (1): 47–58. .] Yet, George MacDonald emphasised in 1893 that, \"A fairy tale is not an allegory.\"\n\nJ.R.R. Tolkien's The Lord of the Rings is another example of a well-known work mistakenly perceived as allegorical, as the author himself once stated, \"...I cordially dislike allegory in all its manifestations, and always have done so since I grew old and wary enough to detect its presence. I much prefer history – true or feigned– with its varied applicability to the thought and experience of readers. I think that many confuse applicability with allegory, but the one resides in the freedom of the reader, and the other in the purposed domination of the author.\"  While this does not mean his works may not be treated as having allegorical themes, especially when reinterpreted through postmodern sensibilities, it at least suggests that none were conscious in his writings. This further reinforces the idea of forced allegoresis, as allegory is often a matter of interpretation and only sometimes of original artistic intention.\n\nLike allegorical stories, allegorical poetry has two meanings – a literal meaning and a symbolic meaning.\n\nSome unique specimens of allegory can be found in the following works:\n*Edmund Spenser – The Faerie Queene: The several knights in the poem actually stand for several virtues.\n*William Shakespeare – The Tempest: a fight between good and evil on a deserted island\n*John Bunyan – The Pilgrim's Progress: The journey of the protagonists Christian and Evangelist symbolises the ascension of the soul from earth to Heaven.\n*Nathaniel Hawthorne – Young Goodman Brown: The Devil's Staff symbolises defiance of God. The characters' names, such as Goodman and Faith, ironically serve as paradox in the conclusion of the story.\n*Nathaniel Hawthorne – The Scarlet Letter: The scarlet letter symbolises many things. The characters, while developed with interiority, are allegorical in that they represent ways of seeing the world. Symbolism is also prominent.\n*George Orwell – Animal Farm: The pigs stand for political figures of the Russian Revolution.\n*László Krasznahorkai - The Melancholy of Resistance and the film Werckmeister Harmonies: It uses a circus to describe an occupying dysfunctional government.\n*Edgar Allan Poe – The Masque of the Red Death: The story can be read as an allegory how no one can evade death.[Roppolo, Joseph Patrick. \"Meaning and 'The Masque of the Red Death'\", collected in Poe: A Collection of Critical Essays, edited by Robert Regan. Englewood Cliffs, NJ: Prentice-Hall, Inc., 1967. p. 137]\n*Arthur Miller – The Crucible: The play about the Salem witch trials, was written as an allegory to the McCarthyism during the blacklisting of Communists in the United States of America.\n\nArt\n\nSome elaborate and successful specimens of allegory are to be found in the following works, arranged in approximate chronological order:\n*Ambrogio Lorenzetti – Allegoria del Buono e Cattivo Governo e loro Effetti in Città e Campagna (c. 1338–1339)\n*Sandro Botticelli – Primavera (c. 1482)\n*Albrecht Dürer – Melencolia I (1514)\n*Bronzino – Venus, Cupid, Folly and Time (c. 1545)\n*The English School's – \"Allegory of Queen Elizabeth\" (c. 1610)\n*Artemisia Gentileschi – Allegory of Inclination (c. 1620), An Allegory of Peace and the Arts under the English Crown (1638); Self-Portrait as the Allegory of Painting (c. 1638–39)\n* The Feast of Herod with the Beheading of St John the Baptist by Bartholomeus Strobel is also an allegory of Europe in the time of the Thirty Years War, with portraits of many leading political and military figures.\n*Jan Vermeer – Allegory of Painting (c. 1666)\n*Marcel Duchamp – The Bride Stripped Bare by Her Bachelors, Even (1912–1923)\n*Graydon Parrish – The Cycle of Terror and Tragedy (2006)\n*Many statues of Lady Justice: \"Such visual representations have raised the question why so many allegories in the history of art, pertaining occupations once reserved for men only, are of female sex.\"Cäcilia Rentmeister: The Muses, Banned From Their Occupations: Why Are There So Many Allegories Female? [http://www.cillie-rentmeister.de/themen/english/ English summary from Kvinnovetenskaplig Tidskrift, Nr.4. 1981, Lund, Sweden as PDF. Retrieved 10.July 2011] Original Version in German: Berufsverbot für die Musen. Warum sind so viele Allegorien weiblich? In: Ästhetik und Kommunikation, Nr. 25/1976, S. 92–112. Langfassung in: Frauen und Wissenschaft. Beiträge zur Berliner Sommeruniversität für Frauen, Juli 1976, Berlin 1977, S.258–297. With illustrations. [http://www.cillie-rentmeister.de/berufsverbot-fuer-die-musen/ Full Texts Online: Cäcilia (Cillie) Rentmeister: publications]\n*Damien Hirst – Verity (2012)\n\nGallery\n\nFile:Melencolia I (Durero).jpg|Albrecht Dürer, Melencolia I (1514): Unused tools, an hourglass, an empty scale surround a melancholic woman, other esoteric and exoteric symbols point to her alleged mental state.\nFile:Angelo Bronzino - Venus, Cupid, Folly and Time - National Gallery, London.jpg|Bronzino, Venus, Cupid, Folly and Time (c. 1545): The deities of love are surrounded by allegories of Time (a bald, man with angry eyes), Folly (the young woman-demon on the right, possibly also so old woman on the left).\nFile:Titian - Allegorie der Zeit.jpg|Titian, Allegory of Prudence (c. 1565–1570): The three human heads symbolise past, present and future, the characterisation of which is furthered by the triple-headed beast (wolf, lion, dog), girded by the body of a big snake.\nFile:Elizabeth-I-Allegorical-Po.jpg|The English School's Allegory of Queen Elizabeth (c. 1610), with Father Time at her right and Death looking over her left shoulder. Two cherubs are removing the weighty crown from her tired head.\nFile:Self-portrait as the Allegory of Painting (La Pittura) - Artemisia Gentileschi.jpg|Artemisia Gentileschi, Self-Portrait as the Allegory of Painting (c. 1638–39)\nFile:Jan Vermeer - The Art of Painting - Google Art Project.jpg|Jan Vermeer, The Art of Painting (c. 1666): Painting is shown as related to history and politics, the young woman being Clio, the muse of history, and other symbols for the political and religious division of the Netherlands appearing.\nFile:Kessel, Jan van Sr. - Allegory of Hearing.JPG|Jan van Kessel, Allegory of Hearing (17th century): Diverse sources of sound, especially instruments serve as allegorical symbols.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Allegory" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1837" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "As a literary device, an allegory is a metaphor whose vehicle may be a character, place or event, representing real-world issues and occurrences. Allegory (in the sense of the practice and use of allegorical devices and works) has occurred widely throughout history in all forms of art, largely because it can readily illustrate or convey complex ideas and concepts in ways that are comprehensible or striking to its viewers, readers, or listeners.\n\nWriters or speakers typically use allegories as literary devices or as rhetorical devices that convey (semi-)hidden or complex meanings through symbolic figures, actions, imagery, or events, which together create the moral, spiritual, or political meaning the author wishes to convey.\n\n \n\nEtymology\n\nFirst attested in English in 1382, the word allegory comes from Latin allegoria, the latinisation of the Greek ἀλληγορία (allegoría), \"veiled language, figurative,\"[http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0057%3Aentry%3Da%29llhgori%2Fa ἀλληγορία],\nHenry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library which in turn comes from both ἄλλος (allos), \"another, different\"[http://www.perseus.tufts.edu/hopper/text?docPerseus%3Atext%3A1999.04.0057%3Aentry%3Da%29%2Fllos1 ἄλλος], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library and ἀγορεύω (agoreuo), \"to harangue, to speak in the assembly\"[http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.04.0057%3Aentry%3Da%29goreu%2Fw ἀγορεύω], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library which originate from ἀγορά (agora), \"assembly\".[http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0057%3Aentry%3Da%29gora%2F ἀγορά], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus Digital Library\n\nTypes\n\nNorthrop Frye discussed what he termed a \"continuum of allegory\", a spectrum that ranges from what he termed the \"naive allegory\" of The Faerie Queene, to the more private allegories of modern paradox literature.[Frye, Northrop. Anatomy of Criticism. Princeton, NJ: Princeton UP, 1957. Print.] In this perspective, the characters in a \"naive\" allegory are not fully three-dimensional, for each aspect of their individual personalities and the events that befall them embodies some moral quality or other abstraction; the allegory has been selected first, and the details merely flesh it out.\n\nMany ancient religions are based on astrological allegories, that is, allegories of the movement of the sun and the moon as seen from the Earth.\n\nClassical allegory\n\nIn classical literature two of the best-known allegories are the Cave in Plato's Republic (Book VII) and the story of the stomach and its members in the speech of Menenius Agrippa (Livy ii. 32). Among the best-known examples of allegory, Plato's Allegory of the Cave, forms a part of his larger work The Republic. In this allegory, Plato describes a group of people who have lived chained in a cave all of their lives, facing a blank wall (514a–b). The people watch shadows projected on the wall by things passing in front of a fire behind them and begin to ascribe forms to these shadows, using language to identify their world (514c–515a). According to the allegory, the shadows are as close as the prisoners get to viewing reality, until one of them finds his way into the outside world where he sees the actual objects that produced the shadows. He tries to tell the people in the cave of his discovery, but they do not believe him and vehemently resist his efforts to free them so they can see for themselves (516e–518a). This allegory is, on a basic level, about a philosopher who upon finding greater knowledge outside the cave of human understanding, seeks to share it as is his duty, and the foolishness of those who would ignore him because they think themselves educated enough.\n[Elliott, R. K. (1967). \"Socrates and Plato's Cave\". Kant-Studien 58 (2): 138.]\n\nIn Late Antiquity Martianus Capella organized all the information a fifth-century upper-class male needed to know into an allegory of the wedding of Mercury and Philologia, with the seven liberal arts the young man needed to know as guests.[Capella, Martianus, William Harris. Stahl, Richard Johnson, and E. L. Burge. The Marriage of Philology and Mercury. New York: Columbia UP, 1977. Print.]\n\nOther early allegories are found in the Hebrew Bible, such as the extended metaphor in Psalm 80 of the Vine and its impressive spread and growth, representing Israel's conquest and peopling of the Promised Land. Also allegorical is Ezekiel 16 and 17, wherein the capture of that same vine by the mighty Eagle represents Israel's exile to Rome.\n\nMedieval allegory\n\nAllegory has an ability to freeze the temporality of a story, while infusing it with a spiritual context. Mediaeval thinking accepted allegory as having a reality underlying any rhetorical or fictional uses. The allegory was as true as the facts of surface appearances. Thus, the Papal Bull Unam Sanctam (1302) presents themes of the unity of Christendom with the pope as its head in which the allegorical details of the metaphors are adduced as facts on which is based a demonstration with the vocabulary of logic: \"Therefore of this one and only Church there is one body and one head—not two heads as if it were a monster... If, then, the Greeks or others say that they were not committed to the care of Peter and his successors, they necessarily confess that they are not of the sheep of Christ.\" This text also demonstrates the frequent use of allegory in religious texts during the Mediaeval Period, following the tradition and example of the Bible.\n\nIn the late 15th century, the enigmatic Hypnerotomachia, with its elaborate woodcut illustrations, shows the influence of themed pageants and masques on contemporary allegorical representation, as humanist dialectic conveyed them.\n\nThe denial of medieval allegory as found in the 12th-century works of Hugh of St Victor and Edward Topsell's Historie of Foure-footed Beastes (London, 1607, 1653) and its replacement in the study of nature with methods of categorisation and mathematics by such figures as naturalist John Ray and the astronomer Galileo is thought to mark the beginnings of early modern science.Peter Harrison, The Bible, Protestantism, and the rise of natural science, Cambridge University Press, , pages 1 to 10 (\"Introduction\")\n\nModern allegory\n\nSince meaningful stories are nearly always applicable to larger issues, allegories may be read into many stories which the author may not have recognised. This is allegoresis, or the act of reading a story as an allegory. Examples of allegory in popular culture that may or may not have been intended include the works of Bertolt Brecht, and even some works of science fiction and fantasy, such as The Chronicles of Narnia by C.S. Lewis and A Kingdom Far and Clear: The Complete Swan Lake Trilogy by Mark Helprin.\n\nThe story of the apple falling onto Isaac Newton's head is another famous allegory. It simplified the idea of gravity by depicting a simple way it was supposedly discovered. It also made the scientific revelation well known by condensing the theory into a short tale.\n\nPoetry and fiction\n\nIt is important to note that while allegoresis may make discovery of allegory in any work, not every resonant work of modern fiction is allegorical, and some are clearly not intended to be viewed this way. According to Henry Littlefield's 1964 article, L. Frank Baum's The Wonderful Wizard of Oz,  may be readily understood as a plot-driven fantasy narrative in an extended fable with talking animals and broadly sketched characters, intended to discuss the politics of the time.[Littlefield, Henry (1964). \"The Wizard of Oz: Parable on Populism\". American Quarterly 16 (1): 47–58. .] Yet, George MacDonald emphasised in 1893 that, \"A fairy tale is not an allegory.\"\n\nJ.R.R. Tolkien's The Lord of the Rings is another example of a well-known work mistakenly perceived as allegorical, as the author himself once stated, \"...I cordially dislike allegory in all its manifestations, and always have done so since I grew old and wary enough to detect its presence. I much prefer history – true or feigned– with its varied applicability to the thought and experience of readers. I think that many confuse applicability with allegory, but the one resides in the freedom of the reader, and the other in the purposed domination of the author.\"  While this does not mean his works may not be treated as having allegorical themes, especially when reinterpreted through postmodern sensibilities, it at least suggests that none were conscious in his writings. This further reinforces the idea of forced allegoresis, as allegory is often a matter of interpretation and only sometimes of original artistic intention.\n\nLike allegorical stories, allegorical poetry has two meanings – a literal meaning and a symbolic meaning.\n\nSome unique specimens of allegory can be found in the following works:\n*Edmund Spenser – The Faerie Queene: The several knights in the poem actually stand for several virtues.\n*William Shakespeare – The Tempest: a fight between good and evil on a deserted island\n*John Bunyan – The Pilgrim's Progress: The journey of the protagonists Christian and Evangelist symbolises the ascension of the soul from earth to Heaven.\n*Nathaniel Hawthorne – Young Goodman Brown: The Devil's Staff symbolises defiance of God. The characters' names, such as Goodman and Faith, ironically serve as paradox in the conclusion of the story.\n*Nathaniel Hawthorne – The Scarlet Letter: The scarlet letter symbolises many things. The characters, while developed with interiority, are allegorical in that they represent ways of seeing the world. Symbolism is also prominent.\n*George Orwell – Animal Farm: The pigs stand for political figures of the Russian Revolution.\n*László Krasznahorkai - The Melancholy of Resistance and the film Werckmeister Harmonies: It uses a circus to describe an occupying dysfunctional government.\n*Edgar Allan Poe – The Masque of the Red Death: The story can be read as an allegory how no one can evade death.[Roppolo, Joseph Patrick. \"Meaning and 'The Masque of the Red Death'\", collected in Poe: A Collection of Critical Essays, edited by Robert Regan. Englewood Cliffs, NJ: Prentice-Hall, Inc., 1967. p. 137]\n*Arthur Miller – The Crucible: The play about the Salem witch trials, was written as an allegory to the McCarthyism during the blacklisting of Communists in the United States of America.\n\nArt\n\nSome elaborate and successful specimens of allegory are to be found in the following works, arranged in approximate chronological order:\n*Ambrogio Lorenzetti – Allegoria del Buono e Cattivo Governo e loro Effetti in Città e Campagna (c. 1338–1339)\n*Sandro Botticelli – Primavera (c. 1482)\n*Albrecht Dürer – Melencolia I (1514)\n*Bronzino – Venus, Cupid, Folly and Time (c. 1545)\n*The English School's – \"Allegory of Queen Elizabeth\" (c. 1610)\n*Artemisia Gentileschi – Allegory of Inclination (c. 1620), An Allegory of Peace and the Arts under the English Crown (1638); Self-Portrait as the Allegory of Painting (c. 1638–39)\n* The Feast of Herod with the Beheading of St John the Baptist by Bartholomeus Strobel is also an allegory of Europe in the time of the Thirty Years War, with portraits of many leading political and military figures.\n*Jan Vermeer – Allegory of Painting (c. 1666)\n*Marcel Duchamp – The Bride Stripped Bare by Her Bachelors, Even (1912–1923)\n*Graydon Parrish – The Cycle of Terror and Tragedy (2006)\n*Many statues of Lady Justice: \"Such visual representations have raised the question why so many allegories in the history of art, pertaining occupations once reserved for men only, are of female sex.\"Cäcilia Rentmeister: The Muses, Banned From Their Occupations: Why Are There So Many Allegories Female? [http://www.cillie-rentmeister.de/themen/english/ English summary from Kvinnovetenskaplig Tidskrift, Nr.4. 1981, Lund, Sweden as PDF. Retrieved 10.July 2011] Original Version in German: Berufsverbot für die Musen. Warum sind so viele Allegorien weiblich? In: Ästhetik und Kommunikation, Nr. 25/1976, S. 92–112. Langfassung in: Frauen und Wissenschaft. Beiträge zur Berliner Sommeruniversität für Frauen, Juli 1976, Berlin 1977, S.258–297. With illustrations. [http://www.cillie-rentmeister.de/berufsverbot-fuer-die-musen/ Full Texts Online: Cäcilia (Cillie) Rentmeister: publications]\n*Damien Hirst – Verity (2012)\n\nGallery\n\nFile:Melencolia I (Durero).jpg|Albrecht Dürer, Melencolia I (1514): Unused tools, an hourglass, an empty scale surround a melancholic woman, other esoteric and exoteric symbols point to her alleged mental state.\nFile:Angelo Bronzino - Venus, Cupid, Folly and Time - National Gallery, London.jpg|Bronzino, Venus, Cupid, Folly and Time (c. 1545): The deities of love are surrounded by allegories of Time (a bald, man with angry eyes), Folly (the young woman-demon on the right, possibly also so old woman on the left).\nFile:Titian - Allegorie der Zeit.jpg|Titian, Allegory of Prudence (c. 1565–1570): The three human heads symbolise past, present and future, the characterisation of which is furthered by the triple-headed beast (wolf, lion, dog), girded by the body of a big snake.\nFile:Elizabeth-I-Allegorical-Po.jpg|The English School's Allegory of Queen Elizabeth (c. 1610), with Father Time at her right and Death looking over her left shoulder. Two cherubs are removing the weighty crown from her tired head.\nFile:Self-portrait as the Allegory of Painting (La Pittura) - Artemisia Gentileschi.jpg|Artemisia Gentileschi, Self-Portrait as the Allegory of Painting (c. 1638–39)\nFile:Jan Vermeer - The Art of Painting - Google Art Project.jpg|Jan Vermeer, The Art of Painting (c. 1666): Painting is shown as related to history and politics, the young woman being Clio, the muse of history, and other symbols for the political and religious division of the Netherlands appearing.\nFile:Kessel, Jan van Sr. - Allegory of Hearing.JPG|Jan van Kessel, Allegory of Hearing (17th century): Diverse sources of sound, especially instruments serve as allegorical symbols. Allegory. http://en.wikipedia.org/?curid=1837."
  }
}
