{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14376",
  "eid" : "1425ad70-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778543047,
  "textBody" : "Hamsters are rodents (order Rodentia) belonging to the subfamily Cricetinae, which contains about 25 species classified in six or seven genera.Fox, Sue. 2006. Hamsters. T.F.H. Publications Inc. They have become established as popular small house pets, but, because they are easy to breed in captivity, hamsters are also often used as laboratory animals.\n\nActually hamsters are more crepuscular than nocturnal and, in the wild, remain underground during the day to avoid being caught by predators. They feed primarily on seeds, fruits, and vegetation, and will occasionally eat burrowing insects. For one of their more prominent characteristics, they have elongated cheek pouches extending to their shoulders, which they use to carry food back to their burrows.\n\nHistory\n\nAlthough the Syrian hamster or golden hamster (Mesocricetus auratus) was first described scientifically by George Robert Waterhouse in 1839, researchers were not able to successfully breed and domesticate hamsters until 1939.Barrie, Anmarie. 1995. Hamsters as a New Pet. T.F.H. Publications Inc., NJ . The entire laboratory and pet populations of Syrian hamsters appear to be descendants of a single brother–sister pairing. These littermates were captured and imported in 1930 from Aleppo in Syria by Israel Aharoni, a zoologist of the University of Jerusalem.Fritzsche, Peter. 2008. Hamsters: A Complete Pet Owner’s Manual. Barron’s Educational Series Inc., NY . In Jerusalem, the hamsters bred very successfully. Years later, animals of this original breeding colony were exported to the USA, where Syrian hamsters became one of the most popular pets and laboratory animals.  Comparative studies of domestic and wild Syrian hamsters have shown reduced genetic variability in the domestic strain. However, the differences in behavioral, chronobiological, morphometrical, hematological, and biochemical parameters are relatively small and fall into the expected range of interstrain variations in other laboratory animals.Kuhnen, G. (2002). Comfortable quarters for hamsters in research institutions. In \"Comfortable Quarters for Laboratory Animals\" Eds V. Reinhardt and A. Reinhardt. Animal Welfare Institute, Washington DC. pp.33-37\n\nEarly literature\n\nIn 1774, Friedrich Gabriel Sulzer, a companion of Johann-Wolfgang von Goethe, devoted a whole academic monograph in the domain of social sciences and natural history to hamsters, entitled \"An approach to a natural history of the hamster\" (\"Versuch einer Naturgeschichte des Hamsters\"). In several instances, he used the hamster to document the equal rights of all beings, including Homo sapiens.\n\nEtymology\n\nThe name \"hamster\" is a loanword from the German, which itself derives from earlier Middle High German hamastra. It is possibly related to Old Church Slavonic khomestoru, which is either a blend of the root of Russian хомяк (khomyak) \"hamster\" and a Baltic word (cf. Lithuanian staras \"hamster\");Douglas Harper, The Online Etymology Dictionary, [http://www.etymonline.com/index.php?term=hamster entry for \"hamster\"] or of Persian origin (cf. Av hamaēstar \"oppressor\").Merriam-Webster's Collegiate Dictionary, s.v. \"hamster\" (29 May 2008) [http://www.merriam-webster.com/dictionary/hamster Merriam-Webster.com]\n\nDescription\n\nHamsters are typically stout-bodied, with tails shorter than body length, and have small, furry ears, short, stocky legs, and wide feet. They have thick, silky fur, which can be long or short, colored black, grey, honey, white, brown, yellow, red, or a mix, depending on the species. Two species of hamster belonging to the genus Phodopus, Campbell's dwarf hamster (P. campbelli) and the Djungarian hamster (P. sungorus), and two of the genus Cricetulus, the Chinese striped hamster (C. barabensis) and the Chinese hamster (C. griseus) have a dark stripe down their heads to their tails. The species of genus Phodopus are the smallest, with bodies  long; the largest is the European hamster (Cricetus cricetus), measuring up to  long, not including a short tail of up to .\n\nThe hamster tail can be difficult to see, as it is usually not very long (about 1/6 the length of the body), with the exception of the Chinese hamster, which has a tail the same length as the body. One rodent characteristic that can be highly visible in hamsters is their sharp incisors; they have an upper pair and lower pair which grow continuously throughout life, so must be regularly worn down. Hamsters are very flexible, but their bones are somewhat fragile. They are extremely susceptible to rapid temperature changes and drafts, as well as extreme heat or cold.\n\nSenses\n\nHamsters have poor eyesight; they are nearsighted and colorblind. Hamsters have scent glands on their flanks (and abdomens in Chinese and dwarf hamsters) which they rub against the substrate, leaving a scent trail. Hamsters also use their sense of smell to distinguish between the sexes, and to locate food. They are also particularly sensitive to high-pitched noises and can hear and communicate in the ultrasonic range.\n\nDiet\n\nHamsters are omnivores. Although pet hamsters can survive on a diet of exclusively commercial hamster food, other items, such as vegetables, fruits, seeds, and nuts, can be given. Hamsters in the Middle East have been known to hunt in packs to find insects for food.\"hamster.\" Encyclopædia Britannica. Standard Edition. Chicago: Encyclopædia Britannica, 2007.  Hamsters are hindgut fermenters and eat their own feces (coprophagy) to recover nutrients digested in the hindgut, but not absorbed.\n\nBehavior\n\nA behavioral characteristic of hamsters is food hoarding. They carry food in their spacious cheek pouches to their underground storage chambers. When full, the cheeks can make their heads double, or even triple in size.\n\nSocial behavior\n\nMost hamsters are strictly solitary. If housed together, acute and chronic stress may occur, and they may fight fiercely, sometimes fatally. Dwarf hamster species may tolerate conspecifics. Russian hamsters form close, monogamous bonds with their mates, and if separated, they may become very depressed. This happens especially in males. Males will become inactive, eat more, and even show some behavioral changes similar to some types of depression in humans. This can even cause obesity in the hamster.\n\nChronobiology\n\nEvidence conflicts as to whether hamsters are crepuscular or nocturnal. Khunen writes, \"Hamsters are nocturnal rodents who  are active during the night...\", but others have written that because hamsters live underground during most of the day, only leaving their burrows about an hour before sundown and then returning when it gets dark, their behavior is primarily crepuscular.  Fritzsche indicated although some species have been observed to show more nocturnal activity than others, they are all primarily crepuscular.\n\nWild Syrian hamsters are true hibernators and allow their body temperature to fall close to ambient temperature (but not below 20 °C). This kind of thermoregulation diminishes the metabolic rate to about 5% and helps the animal to considerably reduce the need for food during the winter.  Hamsters may not hibernate per se, but instead reduce the rate of a number of physiological systems, such as breathing and heart rate, for short periods of time. These periods of torpor (defined as \"a state of mental or physical inactivity or insensibility\"[http://www.thefreedictionary.com/torpor torpor]. Thefreedictionary.com. Retrieved on 2011-12-18.) can last up 10 days.\n\nBurrowing behavior\n\nAll hamsters are excellent diggers, constructing burrows with one or more entrances, with galleries connected to chambers for nesting, food storage, and other activities. They use their fore- and hindlegs, as well as their snouts and teeth, for digging. In the wild, the burrow buffers extreme ambient temperatures, offers relatively stable climatic conditions, and protects against predators. Syrian hamsters dig their burrows generally at a depth of 0.7 m.Gattermann, R., Fritzsche, P., Neumann, K., Al-Hussein, I., Kayser, A., Abiad, M. and Yakti, R., (2001). Notes on the current distribution and ecology of wild golden hamsters (Mesocricetus auratus). Journal of Zoology, 254: 359-365  A burrow includes a steep entrance pipe (4–5 cm in diameter), a nesting and a hoarding chamber and a blind-ending branch for urination. Laboratory hamsters have not lost their ability to dig burrows; in fact, they will do this with great vigor and skill if they are provided with the appropriate substrate.\n\nWild hamsters will also appropriate tunnels made by other mammals; the Djungarian hamster, for instance, uses paths and burrows of the pika.\n\nReproduction\n\nFertility\n\nHamsters become fertile at different ages depending on their species. Both Syrian and Russian hamsters mature quickly and can begin reproducing at a young age (4–5 weeks), whereas Chinese hamsters will usually begin reproducing at two to three months of age, and Roborovskis at three to four months of age. The female's reproductive life lasts about 18 months, but male hamsters remain fertile much longer. Females are in estrus about every four days, which is indicated by a reddening of genital areas, a musky smell, and a hissing, squeaking vocalisation she will emit if she believes a male is nearby.\n\nWhen seen from above, a sexually mature female hamster has a trim tail line; a male's tail line bulges on both sides. This might not be very visible in all species. Male hamsters typically have very large testes in relation to their body size. Before sexual maturity occurs, it is more difficult to determine a young hamster's sex. When examined, female hamsters have their anal and genital openings close together, whereas males have these two holes farther apart (the penis is usually withdrawn into the coat and thus appears as a hole or pink pimple).\n\nGestation and fecundity\n\nHamsters are seasonal breeders and will produce several litters a year with several pups in each litter. The breeding season is from April to October in the Northern Hemisphere, with two to five litters of one to 13 young being born after a gestation period of 16 to 23 days. Gestation lasts 16 to 18 days for Syrian hamsters, 18 to 21 days for Russian hamsters, 21 to 23 days for Chinese hamsters and 23 to 30 for Roborovski hamsters. The average litter size for Syrian hamsters is about seven pups, but can be as great as 24, which is the maximum number of pups that can be contained in the uterus. Campbell's dwarf hamsters tend to have four to eight pups in a litter, but can have up to 13. Djungarian hamsters tend to have slightly smaller litters, as do Chinese and Roborovski hamsters.\n\nIntersexual aggression and cannibalism\n\nFemale Chinese and Syrian hamsters are known for being aggressive toward the male if kept together for too long after mating. In some cases, male hamsters can die after being attacked by the female. If breeding hamsters, separation of the pair after mating is recommended, or they will attack each other.\n\nFemale hamsters are also particularly sensitive to disturbances while giving birth, and may even eat their own young if they think they are in danger, although sometimes they are just carrying the pups in their cheek pouches.  If captive female hamsters are left for extended periods (three weeks or more) with their litter, they may cannibalize the litter, so the litter must be removed by the time the young can feed and drink independently.\n\nWeaning\n\nHamsters are born hairless and blind in a nest the mother will have prepared in advance. After one week, they begin to explore outside the nest. They are completely weaned after three weeks, or four for Roborovski hamsters. Most breeders will sell the hamsters to shops when they are three to nine weeks old.\n\nLongevity\n\nSyrian hamsters typically live no more than two to three years in captivity, and less in the wild. Russian hamsters (Campbell's and Djungarian) live about two to four years in captivity, and Chinese hamsters 2–3 years. The smaller Roborovski hamster often lives to three years in captivity.\n\nSociety and culture\n\nHamsters as pets\n\nThe best-known species of hamster is the golden or Syrian hamster (Mesocricetus auratus), which is the type most commonly kept as pets. It is also sometimes called a \"fancy\" hamster. The pet trade and fanciers have given names to several color variations, including \"honey bear\", \"panda bear\", \"black bear\", \"European black bear\", \"polar bear\", \"teddy bear\", and \"Dalmatian\". Several variations, including long-haired varieties, grow hair several centimeters long and often require special care. British zoologist Leonard Goodwin claimed most hamsters kept in the United Kingdom were descended from the colony he introduced for medical research purposes during the Second World War.\n\nOther hamsters kept as pets are the various species of \"dwarf hamster\". Campbell's dwarf hamster (Phodopus campbelli) is the most common—they are also sometimes called \"Russian dwarfs\"; however, many hamsters are from Russia,  so this ambiguous name does not distinguish them from other species appropriately. The coat of the Djungarian or winter-white Russian dwarf hamster (Phodopus sungorus) turns almost white during winter (when the hours of daylight decrease). The Roborovski hamster (Phodopus roborovskii) is extremely small and fast, making it difficult to keep as a pet. The Chinese hamster (Cricetulus griseus), although not technically a true \"dwarf hamster\", is the only hamster with a prehensile tail (about 4 cm long)—most hamsters have very short, nonprehensile tails.\n\nMany breeders also show their hamsters, so breed towards producing a good, healthy, show hamster with a view to keeping one or two themselves, so quality and temperament are of vital importance when planning the breeding.\n\nFile:Cashew sable syrian hamster.jpg|A sable, short-haired golden hamster\nFile:Hamster Ruso.jpg|A Russian dwarf hamster\nFile:Roborofskiohamster.jpg|A Roborovski hamster\n\nHamster shows\n\nA hamster show is an event in which people gather hamsters to judge them against each other. Hamster shows are also places where people share their enthusiasm for hamsters among attendees. Hamster shows feature an exhibition of the hamsters participating in the judging.\n\nThe judging of hamsters usually includes a goal of promoting hamsters which conform to natural or established varieties of hamsters. By awarding hamsters which match standard hamster types, hamster shows encourage planned and careful hamster breeding.\n\nClassification\n\nTaxonomists generally disagree about the most appropriate placement of the subfamily Cricetinae within the superfamily Muroidea. Some place it in a family Cricetidae that also includes voles, lemmings, and New World rats and mice; others group all these into a large family called Muridae. Their evolutionary history is recorded by 15 extinct fossil genera and extends back 11.2 million to 16.4 million years to the Middle Miocene Epoch in Europe and North Africa; in Asia it extends 6 million to 11 million years. Four of the seven living genera include extinct species. One extinct hamster of Cricetus, for example, lived in North Africa during the Middle Miocene, but the only extant member of that genus is the European or common hamster of Eurasia.\n\n*Subfamily Cricetinae\n**Genus Allocricetulus\n***Species A. curtatus—Mongolian hamster\n***Species A. eversmanni—Eversmann's or Kazakh hamster\n**Genus Cansumys\n***Species C. canus—Gansu hamster\n**Genus Cricetulus\n***Species C. alticola—Tibetan dwarf or Ladak hamster\n***Species C. barabensis, including \"C. pseudogriseus\" and \"C. obscurus\"—Chinese striped hamster, also called Chinese hamster; striped dwarf hamster\n***Species C. griseus—Chinese (dwarf) hamster, also called rat hamster\n***Species C. kamensis—Kam dwarf hamster or Tibetan hamster\n***Species C. longicaudatus—long-tailed dwarf hamster\n***Species C. migratorius—grey dwarf hamster, Armenian hamster, migratory grey hamster; grey hamster; migratory hamster\n***Species C. sokolovi—Sokolov's dwarf hamster\n**Genus Cricetus\n***Species C. cricetus—European hamster, also called common hamster or black-bellied field hamster\n**Genus Mesocricetus—golden hamsters\n***Species M. auratus—golden or Syrian hamster\n***Species M. brandti—Turkish hamster, also called Brandt's hamster; Azerbaijani hamster\n***Species M. newtoni—Romanian hamster\n***Species M. raddei—Ciscaucasian hamster\n**Genus Phodopus—dwarf hamsters\n***Species P. campbelli—Campbell's dwarf hamster\n***Species P. roborovskii—Roborovski hamster\n***Species P. sungorus—Djungarian hamster or winter-white Russian dwarf hamster\n**Genus Tscherskia\n***Species T. triton—greater long-tailed hamster, also called Korean hamster\n\nRelationships among hamster species\n\nNeumann et al. (2006) conducted a molecular phylogenetic analysis of 12 of the above 17 species using DNA sequence from three genes: 12S rRNA, cytochrome b, and von Willebrand factor. They uncovered the following relationships:\n\n;Phodopus group\nThe genus Phodopus was found to represent the earliest split among hamsters. Their analysis included both species. The results of another study suggest Cricetulus kamensis (and presumably the related C. alticola) might belong to either this Phodopus group or hold a similar basal position.\n\n;Mesocricetus group\nThe genus Mesocricetus also forms a clade. Their analysis included all four species, with M. auratus and M. raddei forming one subclade and M. brandti and M. newtoni another.\n\n;Remaining genera\nThe remaining genera of hamsters formed a third major clade. Two of the three sampled species within Cricetulus represent the earliest split. This clade contains C. barabensis (and presumably the related C. sokolovi) and C. longicaudatus.\n\n;Miscellaneous\nThe remaining clade contains members of Allocricetulus, Tscherskia, Cricetus, and C. migratorius. Allocricetulus and Cricetus were sister taxa. Cricetulus migratorius was their next closest relative, and Tscherskia was basal.\n\nSimilar animals\n\nSome similar rodents sometimes called \"hamsters\" are not currently classified in the hamster subfamily Cricetinae. These include the maned hamster, or crested hamster, which is really the maned rat (Lophiomys imhausi). Others are the mouse-like hamsters (Calomyscus spp.), and the white-tailed rat (Mystromys albicaudatus).\n\nIn popular culture\n\nRichard Hammond has the nickname of Hamster, which is name made by BBC motoring expert Zog Ziegler because of his short height, and how his surname is Hammond, and also that he eats an award paper in Season 7 Episode 6, and also a sun visor in Ukraine.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hamster" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14376" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hamsters are rodents (order Rodentia) belonging to the subfamily Cricetinae, which contains about 25 species classified in six or seven genera.Fox, Sue. 2006. Hamsters. T.F.H. Publications Inc. They have become established as popular small house pets, but, because they are easy to breed in captivity, hamsters are also often used as laboratory animals.\n\nActually hamsters are more crepuscular than nocturnal and, in the wild, remain underground during the day to avoid being caught by predators. They feed primarily on seeds, fruits, and vegetation, and will occasionally eat burrowing insects. For one of their more prominent characteristics, they have elongated cheek pouches extending to their shoulders, which they use to carry food back to their burrows.\n\nHistory\n\nAlthough the Syrian hamster or golden hamster (Mesocricetus auratus) was first described scientifically by George Robert Waterhouse in 1839, researchers were not able to successfully breed and domesticate hamsters until 1939.Barrie, Anmarie. 1995. Hamsters as a New Pet. T.F.H. Publications Inc., NJ . The entire laboratory and pet populations of Syrian hamsters appear to be descendants of a single brother–sister pairing. These littermates were captured and imported in 1930 from Aleppo in Syria by Israel Aharoni, a zoologist of the University of Jerusalem.Fritzsche, Peter. 2008. Hamsters: A Complete Pet Owner’s Manual. Barron’s Educational Series Inc., NY . In Jerusalem, the hamsters bred very successfully. Years later, animals of this original breeding colony were exported to the USA, where Syrian hamsters became one of the most popular pets and laboratory animals.  Comparative studies of domestic and wild Syrian hamsters have shown reduced genetic variability in the domestic strain. However, the differences in behavioral, chronobiological, morphometrical, hematological, and biochemical parameters are relatively small and fall into the expected range of interstrain variations in other laboratory animals.Kuhnen, G. (2002). Comfortable quarters for hamsters in research institutions. In \"Comfortable Quarters for Laboratory Animals\" Eds V. Reinhardt and A. Reinhardt. Animal Welfare Institute, Washington DC. pp.33-37\n\nEarly literature\n\nIn 1774, Friedrich Gabriel Sulzer, a companion of Johann-Wolfgang von Goethe, devoted a whole academic monograph in the domain of social sciences and natural history to hamsters, entitled \"An approach to a natural history of the hamster\" (\"Versuch einer Naturgeschichte des Hamsters\"). In several instances, he used the hamster to document the equal rights of all beings, including Homo sapiens.\n\nEtymology\n\nThe name \"hamster\" is a loanword from the German, which itself derives from earlier Middle High German hamastra. It is possibly related to Old Church Slavonic khomestoru, which is either a blend of the root of Russian хомяк (khomyak) \"hamster\" and a Baltic word (cf. Lithuanian staras \"hamster\");Douglas Harper, The Online Etymology Dictionary, [http://www.etymonline.com/index.php?term=hamster entry for \"hamster\"] or of Persian origin (cf. Av hamaēstar \"oppressor\").Merriam-Webster's Collegiate Dictionary, s.v. \"hamster\" (29 May 2008) [http://www.merriam-webster.com/dictionary/hamster Merriam-Webster.com]\n\nDescription\n\nHamsters are typically stout-bodied, with tails shorter than body length, and have small, furry ears, short, stocky legs, and wide feet. They have thick, silky fur, which can be long or short, colored black, grey, honey, white, brown, yellow, red, or a mix, depending on the species. Two species of hamster belonging to the genus Phodopus, Campbell's dwarf hamster (P. campbelli) and the Djungarian hamster (P. sungorus), and two of the genus Cricetulus, the Chinese striped hamster (C. barabensis) and the Chinese hamster (C. griseus) have a dark stripe down their heads to their tails. The species of genus Phodopus are the smallest, with bodies  long; the largest is the European hamster (Cricetus cricetus), measuring up to  long, not including a short tail of up to .\n\nThe hamster tail can be difficult to see, as it is usually not very long (about 1/6 the length of the body), with the exception of the Chinese hamster, which has a tail the same length as the body. One rodent characteristic that can be highly visible in hamsters is their sharp incisors; they have an upper pair and lower pair which grow continuously throughout life, so must be regularly worn down. Hamsters are very flexible, but their bones are somewhat fragile. They are extremely susceptible to rapid temperature changes and drafts, as well as extreme heat or cold.\n\nSenses\n\nHamsters have poor eyesight; they are nearsighted and colorblind. Hamsters have scent glands on their flanks (and abdomens in Chinese and dwarf hamsters) which they rub against the substrate, leaving a scent trail. Hamsters also use their sense of smell to distinguish between the sexes, and to locate food. They are also particularly sensitive to high-pitched noises and can hear and communicate in the ultrasonic range.\n\nDiet\n\nHamsters are omnivores. Although pet hamsters can survive on a diet of exclusively commercial hamster food, other items, such as vegetables, fruits, seeds, and nuts, can be given. Hamsters in the Middle East have been known to hunt in packs to find insects for food.\"hamster.\" Encyclopædia Britannica. Standard Edition. Chicago: Encyclopædia Britannica, 2007.  Hamsters are hindgut fermenters and eat their own feces (coprophagy) to recover nutrients digested in the hindgut, but not absorbed.\n\nBehavior\n\nA behavioral characteristic of hamsters is food hoarding. They carry food in their spacious cheek pouches to their underground storage chambers. When full, the cheeks can make their heads double, or even triple in size.\n\nSocial behavior\n\nMost hamsters are strictly solitary. If housed together, acute and chronic stress may occur, and they may fight fiercely, sometimes fatally. Dwarf hamster species may tolerate conspecifics. Russian hamsters form close, monogamous bonds with their mates, and if separated, they may become very depressed. This happens especially in males. Males will become inactive, eat more, and even show some behavioral changes similar to some types of depression in humans. This can even cause obesity in the hamster.\n\nChronobiology\n\nEvidence conflicts as to whether hamsters are crepuscular or nocturnal. Khunen writes, \"Hamsters are nocturnal rodents who  are active during the night...\", but others have written that because hamsters live underground during most of the day, only leaving their burrows about an hour before sundown and then returning when it gets dark, their behavior is primarily crepuscular.  Fritzsche indicated although some species have been observed to show more nocturnal activity than others, they are all primarily crepuscular.\n\nWild Syrian hamsters are true hibernators and allow their body temperature to fall close to ambient temperature (but not below 20 °C). This kind of thermoregulation diminishes the metabolic rate to about 5% and helps the animal to considerably reduce the need for food during the winter.  Hamsters may not hibernate per se, but instead reduce the rate of a number of physiological systems, such as breathing and heart rate, for short periods of time. These periods of torpor (defined as \"a state of mental or physical inactivity or insensibility\"[http://www.thefreedictionary.com/torpor torpor]. Thefreedictionary.com. Retrieved on 2011-12-18.) can last up 10 days.\n\nBurrowing behavior\n\nAll hamsters are excellent diggers, constructing burrows with one or more entrances, with galleries connected to chambers for nesting, food storage, and other activities. They use their fore- and hindlegs, as well as their snouts and teeth, for digging. In the wild, the burrow buffers extreme ambient temperatures, offers relatively stable climatic conditions, and protects against predators. Syrian hamsters dig their burrows generally at a depth of 0.7 m.Gattermann, R., Fritzsche, P., Neumann, K., Al-Hussein, I., Kayser, A., Abiad, M. and Yakti, R., (2001). Notes on the current distribution and ecology of wild golden hamsters (Mesocricetus auratus). Journal of Zoology, 254: 359-365  A burrow includes a steep entrance pipe (4–5 cm in diameter), a nesting and a hoarding chamber and a blind-ending branch for urination. Laboratory hamsters have not lost their ability to dig burrows; in fact, they will do this with great vigor and skill if they are provided with the appropriate substrate.\n\nWild hamsters will also appropriate tunnels made by other mammals; the Djungarian hamster, for instance, uses paths and burrows of the pika.\n\nReproduction\n\nFertility\n\nHamsters become fertile at different ages depending on their species. Both Syrian and Russian hamsters mature quickly and can begin reproducing at a young age (4–5 weeks), whereas Chinese hamsters will usually begin reproducing at two to three months of age, and Roborovskis at three to four months of age. The female's reproductive life lasts about 18 months, but male hamsters remain fertile much longer. Females are in estrus about every four days, which is indicated by a reddening of genital areas, a musky smell, and a hissing, squeaking vocalisation she will emit if she believes a male is nearby.\n\nWhen seen from above, a sexually mature female hamster has a trim tail line; a male's tail line bulges on both sides. This might not be very visible in all species. Male hamsters typically have very large testes in relation to their body size. Before sexual maturity occurs, it is more difficult to determine a young hamster's sex. When examined, female hamsters have their anal and genital openings close together, whereas males have these two holes farther apart (the penis is usually withdrawn into the coat and thus appears as a hole or pink pimple).\n\nGestation and fecundity\n\nHamsters are seasonal breeders and will produce several litters a year with several pups in each litter. The breeding season is from April to October in the Northern Hemisphere, with two to five litters of one to 13 young being born after a gestation period of 16 to 23 days. Gestation lasts 16 to 18 days for Syrian hamsters, 18 to 21 days for Russian hamsters, 21 to 23 days for Chinese hamsters and 23 to 30 for Roborovski hamsters. The average litter size for Syrian hamsters is about seven pups, but can be as great as 24, which is the maximum number of pups that can be contained in the uterus. Campbell's dwarf hamsters tend to have four to eight pups in a litter, but can have up to 13. Djungarian hamsters tend to have slightly smaller litters, as do Chinese and Roborovski hamsters.\n\nIntersexual aggression and cannibalism\n\nFemale Chinese and Syrian hamsters are known for being aggressive toward the male if kept together for too long after mating. In some cases, male hamsters can die after being attacked by the female. If breeding hamsters, separation of the pair after mating is recommended, or they will attack each other.\n\nFemale hamsters are also particularly sensitive to disturbances while giving birth, and may even eat their own young if they think they are in danger, although sometimes they are just carrying the pups in their cheek pouches.  If captive female hamsters are left for extended periods (three weeks or more) with their litter, they may cannibalize the litter, so the litter must be removed by the time the young can feed and drink independently.\n\nWeaning\n\nHamsters are born hairless and blind in a nest the mother will have prepared in advance. After one week, they begin to explore outside the nest. They are completely weaned after three weeks, or four for Roborovski hamsters. Most breeders will sell the hamsters to shops when they are three to nine weeks old.\n\nLongevity\n\nSyrian hamsters typically live no more than two to three years in captivity, and less in the wild. Russian hamsters (Campbell's and Djungarian) live about two to four years in captivity, and Chinese hamsters 2–3 years. The smaller Roborovski hamster often lives to three years in captivity.\n\nSociety and culture\n\nHamsters as pets\n\nThe best-known species of hamster is the golden or Syrian hamster (Mesocricetus auratus), which is the type most commonly kept as pets. It is also sometimes called a \"fancy\" hamster. The pet trade and fanciers have given names to several color variations, including \"honey bear\", \"panda bear\", \"black bear\", \"European black bear\", \"polar bear\", \"teddy bear\", and \"Dalmatian\". Several variations, including long-haired varieties, grow hair several centimeters long and often require special care. British zoologist Leonard Goodwin claimed most hamsters kept in the United Kingdom were descended from the colony he introduced for medical research purposes during the Second World War.\n\nOther hamsters kept as pets are the various species of \"dwarf hamster\". Campbell's dwarf hamster (Phodopus campbelli) is the most common—they are also sometimes called \"Russian dwarfs\"; however, many hamsters are from Russia,  so this ambiguous name does not distinguish them from other species appropriately. The coat of the Djungarian or winter-white Russian dwarf hamster (Phodopus sungorus) turns almost white during winter (when the hours of daylight decrease). The Roborovski hamster (Phodopus roborovskii) is extremely small and fast, making it difficult to keep as a pet. The Chinese hamster (Cricetulus griseus), although not technically a true \"dwarf hamster\", is the only hamster with a prehensile tail (about 4 cm long)—most hamsters have very short, nonprehensile tails.\n\nMany breeders also show their hamsters, so breed towards producing a good, healthy, show hamster with a view to keeping one or two themselves, so quality and temperament are of vital importance when planning the breeding.\n\nFile:Cashew sable syrian hamster.jpg|A sable, short-haired golden hamster\nFile:Hamster Ruso.jpg|A Russian dwarf hamster\nFile:Roborofskiohamster.jpg|A Roborovski hamster\n\nHamster shows\n\nA hamster show is an event in which people gather hamsters to judge them against each other. Hamster shows are also places where people share their enthusiasm for hamsters among attendees. Hamster shows feature an exhibition of the hamsters participating in the judging.\n\nThe judging of hamsters usually includes a goal of promoting hamsters which conform to natural or established varieties of hamsters. By awarding hamsters which match standard hamster types, hamster shows encourage planned and careful hamster breeding.\n\nClassification\n\nTaxonomists generally disagree about the most appropriate placement of the subfamily Cricetinae within the superfamily Muroidea. Some place it in a family Cricetidae that also includes voles, lemmings, and New World rats and mice; others group all these into a large family called Muridae. Their evolutionary history is recorded by 15 extinct fossil genera and extends back 11.2 million to 16.4 million years to the Middle Miocene Epoch in Europe and North Africa; in Asia it extends 6 million to 11 million years. Four of the seven living genera include extinct species. One extinct hamster of Cricetus, for example, lived in North Africa during the Middle Miocene, but the only extant member of that genus is the European or common hamster of Eurasia.\n\n*Subfamily Cricetinae\n**Genus Allocricetulus\n***Species A. curtatus—Mongolian hamster\n***Species A. eversmanni—Eversmann's or Kazakh hamster\n**Genus Cansumys\n***Species C. canus—Gansu hamster\n**Genus Cricetulus\n***Species C. alticola—Tibetan dwarf or Ladak hamster\n***Species C. barabensis, including \"C. pseudogriseus\" and \"C. obscurus\"—Chinese striped hamster, also called Chinese hamster; striped dwarf hamster\n***Species C. griseus—Chinese (dwarf) hamster, also called rat hamster\n***Species C. kamensis—Kam dwarf hamster or Tibetan hamster\n***Species C. longicaudatus—long-tailed dwarf hamster\n***Species C. migratorius—grey dwarf hamster, Armenian hamster, migratory grey hamster; grey hamster; migratory hamster\n***Species C. sokolovi—Sokolov's dwarf hamster\n**Genus Cricetus\n***Species C. cricetus—European hamster, also called common hamster or black-bellied field hamster\n**Genus Mesocricetus—golden hamsters\n***Species M. auratus—golden or Syrian hamster\n***Species M. brandti—Turkish hamster, also called Brandt's hamster; Azerbaijani hamster\n***Species M. newtoni—Romanian hamster\n***Species M. raddei—Ciscaucasian hamster\n**Genus Phodopus—dwarf hamsters\n***Species P. campbelli—Campbell's dwarf hamster\n***Species P. roborovskii—Roborovski hamster\n***Species P. sungorus—Djungarian hamster or winter-white Russian dwarf hamster\n**Genus Tscherskia\n***Species T. triton—greater long-tailed hamster, also called Korean hamster\n\nRelationships among hamster species\n\nNeumann et al. (2006) conducted a molecular phylogenetic analysis of 12 of the above 17 species using DNA sequence from three genes: 12S rRNA, cytochrome b, and von Willebrand factor. They uncovered the following relationships:\n\n;Phodopus group\nThe genus Phodopus was found to represent the earliest split among hamsters. Their analysis included both species. The results of another study suggest Cricetulus kamensis (and presumably the related C. alticola) might belong to either this Phodopus group or hold a similar basal position.\n\n;Mesocricetus group\nThe genus Mesocricetus also forms a clade. Their analysis included all four species, with M. auratus and M. raddei forming one subclade and M. brandti and M. newtoni another.\n\n;Remaining genera\nThe remaining genera of hamsters formed a third major clade. Two of the three sampled species within Cricetulus represent the earliest split. This clade contains C. barabensis (and presumably the related C. sokolovi) and C. longicaudatus.\n\n;Miscellaneous\nThe remaining clade contains members of Allocricetulus, Tscherskia, Cricetus, and C. migratorius. Allocricetulus and Cricetus were sister taxa. Cricetulus migratorius was their next closest relative, and Tscherskia was basal.\n\nSimilar animals\n\nSome similar rodents sometimes called \"hamsters\" are not currently classified in the hamster subfamily Cricetinae. These include the maned hamster, or crested hamster, which is really the maned rat (Lophiomys imhausi). Others are the mouse-like hamsters (Calomyscus spp.), and the white-tailed rat (Mystromys albicaudatus).\n\nIn popular culture\n\nRichard Hammond has the nickname of Hamster, which is name made by BBC motoring expert Zog Ziegler because of his short height, and how his surname is Hammond, and also that he eats an award paper in Season 7 Episode 6, and also a sun visor in Ukraine. Hamster. http://en.wikipedia.org/?curid=14376."
  }
}
