{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6443",
  "eid" : "db8c3c90-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778448089,
  "textBody" : "Ceuta (assimilated pronunciation ; also ;[http://www.oxforddictionaries.com/definition/english/Ceuta Ceuta]. Oxford Dictionaries.; , Sabtah) is an  Spanish autonomous city on the north coast of Africa, separated by 14 kilometres from Cadiz province on the Spanish mainland by the Strait of Gibraltar and sharing a 6.4 kilometre land border with M'diq-Fnideq Prefecture in the Kingdom of Morocco. It lies along the boundary between the Mediterranean Sea and the Atlantic Ocean and is one of nine populated Spanish territories in Africa and, along with Melilla, one of two populated territories on mainland Africa. It was part of Cádiz province until 14 March 1995 when both Ceuta and Melilla's Statutes of Autonomy were passed, the latter having been part of Málaga province.\n\nCeuta, like Melilla and the Canary Islands, was a free port before Spain joined the European Union. As of 2011, it has a population of 82,376. Its population consists of Christians, Muslims and small minorities of Sephardic Jews and ethnic Sindhi Hindus.\n\nSpanish is the official language, while Darija Arabic is also spoken by 40–50% of the population, which is of Moroccan origin.\n\nHistory\n\nCeuta's location has made it an important commercial trade and military way-point for many cultures, beginning with the Carthaginians in the 5th century BC, who called the city Abyla; initially, this was also its name in Greek and Latin. It was known variously in Ancient Greek as: , , , or  (, ,  or , \"Pillar of Abyle\")Dictionary of Greek and Roman Geography, illustrated by numerous engravings on wood. William Smith, LLD (London:Walton and Maberly, Upper Gower Street and Ivy Lane, Paternoster Row; John Murray, Albemarle Street, 1854), Abyla [http://www.perseus.tufts.edu/hopper/text?doc\nabyla-geo&fromdocPerseus%3Atext%3A1999.04.0064]) and in the Latin derivation from Greek as  (\"Mount Abyla\" or \"Column of Abyla\"). Together with Gibraltar on the European side, it formed one of the famous \"Pillars of Hercules\".A Latin Dictionary. Founded on Andrews' edition of Freund's Latin dictionary. revised, enlarged, and in great part rewritten by. Charlton T. Lewis, Ph.D. and. Charles Short, LL.D. (Oxford:Clarendon Press, 1879), \"Abyla\" [http://www.perseus.tufts.edu/hopper/text?docPerseus:text:1999.04.0059:entry\nAbyla&highlightabyla] Later, it was renamed for a formation of seven surrounding smaller mountains, collectively referred to as  ('[The] Seven Brothers') by Pomponius Mela, which lent their name to a Roman fortification known as .\n\nIt changed hands again approximately 400 years later, when Vandal tribes ousted the Romans. After being controlled by the Visigoths, it then became an outpost of the Byzantine Empire. Ceuta was an important Christian center since the fourth century (as recent discovered ruins of a Roman basilica show).\n\nIn the 7th century the Umayyads tried to conquer the region but were unsuccessful. Byzantine governor, Julian (described as King of the Ghomara) who was a vassal of the Visigothic kings of Iberia changed his allegiance after the king Roderic raped his daughter, and exhorted the Muslims to invade the Iberian Peninsula. Under the leadership of the Berber general Tariq ibn Ziyad, the Muslims used Ceuta as a staging ground for an assault on Visigothic Iberian Peninsula. After Julian's death, the Berbers took direct control of the city, which the indigenous Berber tribes resented. They destroyed Ceuta during the Kharijite rebellion led by Maysara al-Matghari in 740.\n\nCeuta lay in ruins until it was resettled in the 9th century by Mâjakas, chief of the Majkasa Berber tribe, who started the short-lived Banu Isam dynasty. His great-grandson briefly allied his tribe with the Idrisids, but the Banu Isam rule ended in 931 when he abdicated in favor of Abd ar-Rahman III, the Umayyad Caliph of Cordoba. Ceuta reverted to Moorish Andalusian rule in 927 along with Melilla, and later Tangier, in 951.\n\nChaos ensued with the fall of the Umayyad caliphate in 1031. Following this Ceuta and the rest of Muslim Iberia were controlled by successive North African dynasties. Starting in 1084, the Almoravid Berbers ruled the region until 1147, when the Almohads conquered the land. Apart from Ibn Hud's rebellion of 1232, they ruled until the Tunisian Hafsids established control. The Hafsids' influence in the west rapidly waned, and Ceuta's inhabitants eventually expelled them in 1249. After this, a period of political instability persisted, under competing interests from the Kingdom of Fez and the Kingdom of Granada. The Kingdom of Fez finally conquered the region in 1387, with assistance from the Crown of Aragon.\n\n15th to 16th century\n\nOn the morning of 21 August 1415, king John I of Portugal led his sons and their assembled forces in a surprise assault that would come to be known as the Conquest of Ceuta. The battle was almost anti-climactic, because the 45,000 men who traveled on 200 Portuguese ships caught the defenders of Ceuta off guard and only suffered eight casualties. By nightfall the town was captured. On the morning of August 22, Ceuta was in Portuguese hands. Álvaro Vaz de Almada, 1st Count of Avranches was asked to hoist what was to become the flag of Ceuta, which is identical to the flag of Lisbon, but in which the coat of arms of the Kingdom of Portugal was added to the center, the original Portuguese flag and coat of arms of Ceuta remained unchanged, and the modern-day Ceuta flag features the configuration of the Portuguese shield.\n\nJohn's son Henry the Navigator distinguished himself in the battle, being wounded during the conquest. The looting of the city proved to be less profitable than expected for John I; he decided to keep the city to pursue further enterprises in the area.\n\nFrom 1415 to 1437 Pedro de Meneses, 1st Count of Vila Real became the first governor of Ceuta.\n\nThe Benemerine sultan started the Siege of Ceuta (1418) but was defeated by the first governor of Ceuta before reinforcements arrived in the form of John, Constable of Portugal and his brother Henry the Navigator who were sent with troops to defend Ceuta.\n\nUnder King John I of Portugals son, Duarte, the colony at Ceuta rapidly became a drain on the Portuguese treasury. Trans-Saharan trade journeyed instead to Tangier. It was soon realised that without the city of Tangier, possession of Ceuta was worthless. In 1437, Duarte's brothers Henry the Navigator and Fernando, the Saint Prince persuaded him to launch an attack on the Marinid sultanate. The resulting Battle of Tangier (1437), led by Henry, was a debacle. In the resulting treaty, Henry promised to deliver Ceuta back to the Marinids in return for allowing the Portuguese army to depart unmolested, which he reneged on.\n\nPossession of Ceuta would indirectly lead to further Portuguese expansion. The main area of Portuguese expansion, at this time, was the coast of Magreb, where there was grain, cattle, sugar, and textiles, as well as fish, hides, wax, and honey.[http://libro.uca.edu/payne1/payne10.pdf Payne, Stanley G., A History of Spain and Portugal, Vol.1, Chap.10 \"The Expansion\"]\n\nCeuta had to endure alone for 43 years, until the position of the city was consolidated with the taking of Ksar es-Seghir (1458), Arzila and Tangier (1471) by the Portuguese.\n\nThe city was recognized as a Portuguese possession by the Treaty of Alcáçovas (1479) and by the Treaty of Tordesilhas (1494).\n\nIn the 1540s the Portuguese began building the Royal Walls of Ceuta as they are today including bastions, a navigable moat and a drawbridge. Some of these bastions are still standing, like the bastions of Coraza Alta, Bandera and Mallorquines.\n\nLuís de Camões lived in Ceuta between 1549 and 1551, losing his right eye in battle, which influenced his work of poetry Os Lusíadas.\n\nIn 1578 king Sebastian of Portugal died at the Battle of Alcácer Quibir (known as the Battle of Three Kings) in what is today northern Morocco, without descendants, triggering the 1580 Portuguese succession crisis. His granduncle, the elderly Cardinal Henry, succeeded him as King, but Henry also had no descendants, having taken holy orders. When the Cardinal-King died two years after Sebastian's disappearance, three grandchildren of king Manuel I of Portugal claimed the throne: Infanta Catarina, Duchess of Braganza, António, Prior of Crato, and Philip II of Spain (Uncle of former King Sebastian of Portugal), who would go on to be crowned king Philip I of Portugal in 1581, uniting the two crowns and overseas empires known as the Iberian Union.*, which allowed the two kingdoms to continue without being merged.\n\n17th to 19th century\n\nDuring the Iberian Union 1580 to 1640, Ceuta attracted many residents of Spanish origin. Ceuta became the only city of the Portuguese Empire that sided with Spain when Portugal regained its independence in the Portuguese Restoration War of 1640.\n\nOn 1 January 1668 by the Treaty of Lisbon, King Afonso VI of Portugal recognized the formal allegiance of Ceuta to Spain and formally ceded Ceuta to King Carlos II of Spain.  \n\nThe city was attacked by Moroccan forces under Moulay Ismail during the Siege of Ceuta (1694-1727). During the longest siege in the history, the city underwent changes leading to the loss of its Portuguese character. While most of the military operations took place around the Royal Walls of Ceuta, there were also small-scale penetrations by Spanish forces at various points on the Moroccan coast, and seizure of shipping in the Strait of Gibraltar.\n\nDisagreements regarding the border of Ceuta resulted in the Hispano-Moroccan War (1859–60), which ended at the Battle of Tetuán.\n\n20th to 21st century\n\nIn July 1936, General Francisco Franco took command of the Spanish Army of Africa and rebelled against the Spanish republican government; his military uprising led to the Spanish Civil War of 1936–1939. Franco transported troops to mainland Spain in an airlift using transport aircraft supplied by Germany and Italy. Ceuta became one of the first casualties of the uprising: General Franco's rebel nationalist forces seized Ceuta, while at the same time the city came under fire from the air and sea forces of the official republican government.\n\nThe Llano Amarillo monument was erected to honor Francisco Franco, it was inaugurated on 13 July 1940. The tall obelisk has since been abandoned, but the shield symbols of the Falange and Imperial Eagle remain visible.\n\nWhen Spain recognized the independence of Spanish Morocco in 1956, Ceuta and the other  remained under Spanish rule. Spain considered them integral parts of the Spanish state, but Morocco has disputed this point.\n\nCulturally, modern Ceuta is part of the Spanish region of Andalusia. It was attached to the province of Cádiz until 1925, the Spanish coast being only 20 km (12.5 miles) away. It is a cosmopolitan city, with a large ethnic Arab Muslim minority as well as Sephardic Jewish and Hindu minorities.\n\nOn 5 November 2007, King Juan Carlos I visited the city, sparking great enthusiasm from the local population and protests from the Moroccan government. It was the first time a Spanish head of state had visited Ceuta in 80 years.\n\nSince 2010, Ceuta (and Melilla) have declared the Muslim holiday of Eid al-Adha or Feast of the Sacrifice, as an official public holiday. It is the first time a non-Christian religious festival has been officially celebrated in Spain since the Reconquista.\n\nEcclesiastical history\n\nThe Catholic Diocese of Ceuta existed from 1417 to 1879. It was a suffragan of the Patriarchate of Lisbon until 1675 and the end of the Iberian Union, when Ceuta chose to remain linked to the king of Spain. Since then it has been a suffragan of the archbishopric of Seville. The Diocese of Tanger was suppressed and incorporated to that of Ceuta in 1570.\n\nIn 1851, upon the signature of the concordat between the Holy See and Spain, the diocese of Ceuta was agreed to be suppressed, being combined into the Diocese of Cádiz y Ceuta. Until then in the Diocese of Cádiz y Algeciras, the bishop was usually the apostolic administrator of Ceuta. The agreement was not implemented until 1879.\n\nGeography\n\nCeuta is dominated by Monte Anyera, a hill along its western frontier with Morocco. The mountain is guarded by a military fort.\n\nMonte Hacho on the Peninsula of Almina overlooking the port is one of the possible locations for the southern pillar of the Pillars of Hercules of Greek legend (the other possibility being Jebel Musa).\n\nClimate\n\nCeuta has a maritime-influenced Subtropical/Mediterranean climate, similar to nearby Spanish and Moroccan cities such as Tarifa, Algeciras or Tangiers. The average diurnal temperature variation is relatively low; the average annual temperature is  with average yearly highs of  and lows of  though the Ceuta weather station has only been in operation since 2003. Ceuta has relatively mild winters for the latitude, while summers are warm yet milder than in the interior of Southern Spain, due to the moderating effect of the Straits of Gibraltar. Summers are very dry, but yearly precipitation is still at 849 mm, which could be considered a humid climate if the summers were not so arid.\n\nPolitics\n\nSince 1995, Ceuta is, along with Melilla, one of the two autonomous cities of Spain.\n\nCeuta is known officially in Spanish as Ciudad Autónoma de Ceuta (English: Autonomous City of Ceuta), with a rank between a standard Spanish city and an autonomous community. Ceuta is part of the territory of the European Union. The city was a free port before Spain joined the European Union in 1986. Now it has a low-tax system within the Economic and Monetary Union of the European Union. As of 2006, its population was 75,861.\n\nCeuta has held elections every four years since 1979, for its 25-seat assembly. The leader of its government was the Mayor until the Autonomy Statute had the title changed to the Mayor-President. , the People's Party (PP) won 18 seats, keeping Juan Jesús Vivas as Mayor-President, which he has been since 2001. The remaining seats are held by the regionalist Caballas Coalition (4) and the Socialist Workers' Party (PSOE, 3).\n\nDue to its small population, Ceuta elects only one member of the Congress of Deputies, the lower house of the Spanish legislature.  election, this post is held by Francisco Márquez de la Rubia of the PP.\n\nSubdivisions\n\nCeuta is subdivided into 63 barriadas (neighbourhoods), such as Barriada de Berizu, Barriada de P. Alfonso, Barriada del Sarchal, and El Hacho.\n\nDispute with Morocco\n\nThe government of Morocco has repeatedly called for Spain to transfer the sovereignty of Ceuta and Melilla, together with the rest of the Spanish plazas de soberanía on the North African coast, on the grounds of asserting its territorial integrity. Morocco has claimed the territories are colonies.\n\nEconomy\n\nThe official currency of Ceuta is the euro. It is part of a special low tax zone in Spain. Ceuta is one of two Spanish port cities on the northern shore of Africa, along with Melilla. They are historically military strongholds, free ports, oil ports, and also fishing ports. Today the economy of the city depends heavily on its port (now in expansion) and its industrial and retail centres. Ceuta Heliport is now used to connect the city to mainland Spain by air. Lidl, Decathlon Group and El Corte Inglés (hardware) have branches in Ceuta. There is also a casino.\n\nTransport\n\nThe city receives high numbers of ferries each day from Algeciras in Andalusia in the south of Spain, along with Melilla and the Canary Islands. The closest airport is Sania Ramel Airport in Morocco. There is a bus service throughout the city which does not pass into neighbouring Morocco.\n\nA single road border checkpoint allows for cars to travel between Morocco and Ceuta. The rest of the border is closed and inaccessible.\n\nDemographics\n\nDue to its location, Ceuta is home to a mixed ethnic and religious population. The two main religious groups are Christians and Muslims. As of 2006 approximately 50% of the population was Spanish/Christian and approximately 49% Arab-Berber/Muslims. As of 2012, the portion of Ceuta's population that identify as Roman Catholic was 68.0%, while the portion of Ceuta's population that identify as Muslim was 28.3%.\n\nSpanish is the primary and official language of the enclave. Moroccan Arabic, Berber, and French are also widely spoken.\n\nReligion\n\nChristianity has been present in Ceuta (called in Roman times Septem or Septum) continuously since the fall of the Western Roman Empire. The ruins of a basilica in downtown Ceuta confirm this reality.\n\nIn 1415, on conquering the city from the Muslims, the Portuguese started the construction of the Cathedral of St. Mary of the Assumption. The Roman Catholic Diocese of Ceuta was established two years later, and in 1851 was merged into the Roman Catholic Diocese of Cadiz y Ceuta. The present cathedral, dating from the late 17th century, combines baroque and neoclassical elements.\n\nEducation\n\nThe University of Granada offers undergraduate programs at their campus in Ceuta. Like all areas of Spain, Ceuta is also served by the National University of Distance Education (UNED).\n\nPrimary and secondary education is possible only in Spanish however a growing number of schools are entering the Bilingual Education Program.\n\nMigrants\n\nAs in Melilla, Ceuta is attractive to migrants who try to use it as an entry to Europe.  As a result the enclave is surrounded by double fences that are 6 meters high and hundreds of migrants congregate near the fences waiting for a chance to cross them. The fences are regularly stormed by migrants trying to claim asylum once they enter Ceuta. \n\nNotable people from Ceuta\n\n1083 to 1700 \n\n* Qadi Ayyad (1083 in Ceuta – 1149) born in Ceuta, then belonging to the Almoravids was the great imam of that city\n* Al-Idrisi (1100 in Ceuta – 1165 in Ceuta) was an Arab Muslim geographer, cartographer and Egyptologist. He lived in Palermo at the court of King Roger II of Sicily, known for the \"Tabula Rogeriana\"\n* Abu al-Abbas as-Sabti (Ceuta 1129 - Marrakesh 1204) is the patron saint of Marrakesh\n* Joseph ben Judah of Ceuta (c. 1160–1226) was a Jewish physician and poet, and disciple of Moses Maimonides\n* Abu al-Abbas al-Azafi (1162 in Ceuta – 1236) a religious and legal scholar, member of the Banu al-Azafi who ruled Ceuta\n* Mohammed ibn Rushayd (1259 in Sabta – 1321) was a judge, writer and scholar of Hadith \n* Alvaro of Braganza ( 1440 - 1504) was a president of Council of Castile.\n\n1700 to 1800\n\n* Don Fernando de Leyba (1734 in Ceuta - 1780) was a Spanish officer who served as the third governor of Upper Louisiana from 1778 until his death.\n* Brigadier General Francisco Antonio García Carrasco Díaz (1742 in Ceuta – 1813 in Lima, Peru ) was a Spanish soldier and Royal Governor of Chile\n* Sebastián Kindelán y O'Regan (1757 in Ceuta – 1826 Santiago de Cuba) was a colonel in the Spanish Army who served as governor of East Florida 1812/1815, of Santo Domingo 1818/1821 and was provisional governor of Cuba 1822/1823\n* Isidro de Alaix Fábregas Count of Vergara and Viscount of Villarrobledo, (1790 in Ceuta – 1853 in Madrid) was a Spanish general of the First Carlist War who backed Isabella II of Spain\n\n1800 to 1950\n\n* General Francisco Llano de la Encomienda (1879 in Ceuta – 1963 in Mexico City) was a Spanish soldier. During the Spanish Civil War (1936–39) he remained loyal to the Second Spanish Republic\n* General Antonio Escobar Huertas (1879 in Ceuta – executed 1940 in Barcelona) was a Spanish military officer\n* África de las Heras Gavilán (Ceuta, 1909 – Moscow, 1988) was a Spanish Communist, naturalized Soviet citizen, and KGB spy who went by the code name Patria\n* Eugenio Martín (born 1925 in Ceuta) is a Spanish film director and screenwriter\n* Jacob Hassan, PhD (1936 in Ceuta – 2006 in Madrid) was a Spanish-Jewish philologist\n* José Martínez Sánchez (born 1945 in Ceuta), nicknamed Pirri, is a retired Spanish footballer, mainly played for Real Madrid, appearing in 561 competitive games and scoring 172 goals\n* Manuel Chaves González (born 1945 in Ceuta) is a Spanish politician of the Spanish Socialist Workers' Party. He served as the Third Vice President of the Spanish Government from 2009 to 2011\n* Ramón Castellano de Torres (born 1947 in Ceuta) is a Spanish artist, thought by some to be an expressionist painter\n* José Ramón López (1950) was a sprint canoer. He won the silver medal in the 1976 Summer Olympics. \n\n1950 to date\n\n* Miguel Bernardo Bianquetti (born 1951 in Ceuta), known as Migueli is a * Spanish retired footballer who played central defender.\n* Francisco Lesmes and Rafael Lesmes Bobed brothers and Spanish footballers.\n* Ignacio Velázquez Rivera (born 1953), first Mayor-President of Melilla\n* Juan Jesús Vivas Lara (Ceuta 1953) became the Mayor-President of Ceuta in Spain in 2001 \n* Pedro Aviles Gutiérrez (Ceuta, 1956) is a Spanish novelist from Madrid.\n* Nayim (Ceuta, 1966) is a retired Spanish footballer; he scored a last-minute goal for Real Zaragoza in the 1995 UEFA Cup Winners' Cup Final.\n* Eva María Isanta Foncuberta (born 1971 in Ceuta) is a Spanish actress  [http://www.imdb.com/name/nm0410706/ IMDb] retrieved 19 October 2017\n* Mohamed Taieb Ahmed (1975, Ceuta) is a Spanish-Moroccan drug lord  responsible for trafficking hashish across the Strait of Gibraltar and into Spain.\n* Lorena Miranda (Ceuta, 1991) is a Spanish female water polo player. She won the silver medal in Water polo at the 2012 Summer Olympics.\n\nTwin towns and sister cities\n\nCeuta is twinned with:\n\n* Aci Catena, Italy\n* Algeciras, Spain\n* Barstow, US\n* Buenos Aires, Argentina\n* Cádiz, Spain\n* Guadalajara, Mexico\n* Malacca City, Malacca, Malaysia\n* Maseru, Lesotho\n* Melilla, Spain\n* Monte Carlo, Monaco\n* Montevideo, Uruguay\n* Santarém, Portugal",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ceuta" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6443" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ceuta (assimilated pronunciation ; also ;[http://www.oxforddictionaries.com/definition/english/Ceuta Ceuta]. Oxford Dictionaries.; , Sabtah) is an  Spanish autonomous city on the north coast of Africa, separated by 14 kilometres from Cadiz province on the Spanish mainland by the Strait of Gibraltar and sharing a 6.4 kilometre land border with M'diq-Fnideq Prefecture in the Kingdom of Morocco. It lies along the boundary between the Mediterranean Sea and the Atlantic Ocean and is one of nine populated Spanish territories in Africa and, along with Melilla, one of two populated territories on mainland Africa. It was part of Cádiz province until 14 March 1995 when both Ceuta and Melilla's Statutes of Autonomy were passed, the latter having been part of Málaga province.\n\nCeuta, like Melilla and the Canary Islands, was a free port before Spain joined the European Union. As of 2011, it has a population of 82,376. Its population consists of Christians, Muslims and small minorities of Sephardic Jews and ethnic Sindhi Hindus.\n\nSpanish is the official language, while Darija Arabic is also spoken by 40–50% of the population, which is of Moroccan origin.\n\nHistory\n\nCeuta's location has made it an important commercial trade and military way-point for many cultures, beginning with the Carthaginians in the 5th century BC, who called the city Abyla; initially, this was also its name in Greek and Latin. It was known variously in Ancient Greek as: , , , or  (, ,  or , \"Pillar of Abyle\")Dictionary of Greek and Roman Geography, illustrated by numerous engravings on wood. William Smith, LLD (London:Walton and Maberly, Upper Gower Street and Ivy Lane, Paternoster Row; John Murray, Albemarle Street, 1854), Abyla [http://www.perseus.tufts.edu/hopper/text?doc\nabyla-geo&fromdocPerseus%3Atext%3A1999.04.0064]) and in the Latin derivation from Greek as  (\"Mount Abyla\" or \"Column of Abyla\"). Together with Gibraltar on the European side, it formed one of the famous \"Pillars of Hercules\".A Latin Dictionary. Founded on Andrews' edition of Freund's Latin dictionary. revised, enlarged, and in great part rewritten by. Charlton T. Lewis, Ph.D. and. Charles Short, LL.D. (Oxford:Clarendon Press, 1879), \"Abyla\" [http://www.perseus.tufts.edu/hopper/text?docPerseus:text:1999.04.0059:entry\nAbyla&highlightabyla] Later, it was renamed for a formation of seven surrounding smaller mountains, collectively referred to as  ('[The] Seven Brothers') by Pomponius Mela, which lent their name to a Roman fortification known as .\n\nIt changed hands again approximately 400 years later, when Vandal tribes ousted the Romans. After being controlled by the Visigoths, it then became an outpost of the Byzantine Empire. Ceuta was an important Christian center since the fourth century (as recent discovered ruins of a Roman basilica show).\n\nIn the 7th century the Umayyads tried to conquer the region but were unsuccessful. Byzantine governor, Julian (described as King of the Ghomara) who was a vassal of the Visigothic kings of Iberia changed his allegiance after the king Roderic raped his daughter, and exhorted the Muslims to invade the Iberian Peninsula. Under the leadership of the Berber general Tariq ibn Ziyad, the Muslims used Ceuta as a staging ground for an assault on Visigothic Iberian Peninsula. After Julian's death, the Berbers took direct control of the city, which the indigenous Berber tribes resented. They destroyed Ceuta during the Kharijite rebellion led by Maysara al-Matghari in 740.\n\nCeuta lay in ruins until it was resettled in the 9th century by Mâjakas, chief of the Majkasa Berber tribe, who started the short-lived Banu Isam dynasty. His great-grandson briefly allied his tribe with the Idrisids, but the Banu Isam rule ended in 931 when he abdicated in favor of Abd ar-Rahman III, the Umayyad Caliph of Cordoba. Ceuta reverted to Moorish Andalusian rule in 927 along with Melilla, and later Tangier, in 951.\n\nChaos ensued with the fall of the Umayyad caliphate in 1031. Following this Ceuta and the rest of Muslim Iberia were controlled by successive North African dynasties. Starting in 1084, the Almoravid Berbers ruled the region until 1147, when the Almohads conquered the land. Apart from Ibn Hud's rebellion of 1232, they ruled until the Tunisian Hafsids established control. The Hafsids' influence in the west rapidly waned, and Ceuta's inhabitants eventually expelled them in 1249. After this, a period of political instability persisted, under competing interests from the Kingdom of Fez and the Kingdom of Granada. The Kingdom of Fez finally conquered the region in 1387, with assistance from the Crown of Aragon.\n\n15th to 16th century\n\nOn the morning of 21 August 1415, king John I of Portugal led his sons and their assembled forces in a surprise assault that would come to be known as the Conquest of Ceuta. The battle was almost anti-climactic, because the 45,000 men who traveled on 200 Portuguese ships caught the defenders of Ceuta off guard and only suffered eight casualties. By nightfall the town was captured. On the morning of August 22, Ceuta was in Portuguese hands. Álvaro Vaz de Almada, 1st Count of Avranches was asked to hoist what was to become the flag of Ceuta, which is identical to the flag of Lisbon, but in which the coat of arms of the Kingdom of Portugal was added to the center, the original Portuguese flag and coat of arms of Ceuta remained unchanged, and the modern-day Ceuta flag features the configuration of the Portuguese shield.\n\nJohn's son Henry the Navigator distinguished himself in the battle, being wounded during the conquest. The looting of the city proved to be less profitable than expected for John I; he decided to keep the city to pursue further enterprises in the area.\n\nFrom 1415 to 1437 Pedro de Meneses, 1st Count of Vila Real became the first governor of Ceuta.\n\nThe Benemerine sultan started the Siege of Ceuta (1418) but was defeated by the first governor of Ceuta before reinforcements arrived in the form of John, Constable of Portugal and his brother Henry the Navigator who were sent with troops to defend Ceuta.\n\nUnder King John I of Portugals son, Duarte, the colony at Ceuta rapidly became a drain on the Portuguese treasury. Trans-Saharan trade journeyed instead to Tangier. It was soon realised that without the city of Tangier, possession of Ceuta was worthless. In 1437, Duarte's brothers Henry the Navigator and Fernando, the Saint Prince persuaded him to launch an attack on the Marinid sultanate. The resulting Battle of Tangier (1437), led by Henry, was a debacle. In the resulting treaty, Henry promised to deliver Ceuta back to the Marinids in return for allowing the Portuguese army to depart unmolested, which he reneged on.\n\nPossession of Ceuta would indirectly lead to further Portuguese expansion. The main area of Portuguese expansion, at this time, was the coast of Magreb, where there was grain, cattle, sugar, and textiles, as well as fish, hides, wax, and honey.[http://libro.uca.edu/payne1/payne10.pdf Payne, Stanley G., A History of Spain and Portugal, Vol.1, Chap.10 \"The Expansion\"]\n\nCeuta had to endure alone for 43 years, until the position of the city was consolidated with the taking of Ksar es-Seghir (1458), Arzila and Tangier (1471) by the Portuguese.\n\nThe city was recognized as a Portuguese possession by the Treaty of Alcáçovas (1479) and by the Treaty of Tordesilhas (1494).\n\nIn the 1540s the Portuguese began building the Royal Walls of Ceuta as they are today including bastions, a navigable moat and a drawbridge. Some of these bastions are still standing, like the bastions of Coraza Alta, Bandera and Mallorquines.\n\nLuís de Camões lived in Ceuta between 1549 and 1551, losing his right eye in battle, which influenced his work of poetry Os Lusíadas.\n\nIn 1578 king Sebastian of Portugal died at the Battle of Alcácer Quibir (known as the Battle of Three Kings) in what is today northern Morocco, without descendants, triggering the 1580 Portuguese succession crisis. His granduncle, the elderly Cardinal Henry, succeeded him as King, but Henry also had no descendants, having taken holy orders. When the Cardinal-King died two years after Sebastian's disappearance, three grandchildren of king Manuel I of Portugal claimed the throne: Infanta Catarina, Duchess of Braganza, António, Prior of Crato, and Philip II of Spain (Uncle of former King Sebastian of Portugal), who would go on to be crowned king Philip I of Portugal in 1581, uniting the two crowns and overseas empires known as the Iberian Union.*, which allowed the two kingdoms to continue without being merged.\n\n17th to 19th century\n\nDuring the Iberian Union 1580 to 1640, Ceuta attracted many residents of Spanish origin. Ceuta became the only city of the Portuguese Empire that sided with Spain when Portugal regained its independence in the Portuguese Restoration War of 1640.\n\nOn 1 January 1668 by the Treaty of Lisbon, King Afonso VI of Portugal recognized the formal allegiance of Ceuta to Spain and formally ceded Ceuta to King Carlos II of Spain.  \n\nThe city was attacked by Moroccan forces under Moulay Ismail during the Siege of Ceuta (1694-1727). During the longest siege in the history, the city underwent changes leading to the loss of its Portuguese character. While most of the military operations took place around the Royal Walls of Ceuta, there were also small-scale penetrations by Spanish forces at various points on the Moroccan coast, and seizure of shipping in the Strait of Gibraltar.\n\nDisagreements regarding the border of Ceuta resulted in the Hispano-Moroccan War (1859–60), which ended at the Battle of Tetuán.\n\n20th to 21st century\n\nIn July 1936, General Francisco Franco took command of the Spanish Army of Africa and rebelled against the Spanish republican government; his military uprising led to the Spanish Civil War of 1936–1939. Franco transported troops to mainland Spain in an airlift using transport aircraft supplied by Germany and Italy. Ceuta became one of the first casualties of the uprising: General Franco's rebel nationalist forces seized Ceuta, while at the same time the city came under fire from the air and sea forces of the official republican government.\n\nThe Llano Amarillo monument was erected to honor Francisco Franco, it was inaugurated on 13 July 1940. The tall obelisk has since been abandoned, but the shield symbols of the Falange and Imperial Eagle remain visible.\n\nWhen Spain recognized the independence of Spanish Morocco in 1956, Ceuta and the other  remained under Spanish rule. Spain considered them integral parts of the Spanish state, but Morocco has disputed this point.\n\nCulturally, modern Ceuta is part of the Spanish region of Andalusia. It was attached to the province of Cádiz until 1925, the Spanish coast being only 20 km (12.5 miles) away. It is a cosmopolitan city, with a large ethnic Arab Muslim minority as well as Sephardic Jewish and Hindu minorities.\n\nOn 5 November 2007, King Juan Carlos I visited the city, sparking great enthusiasm from the local population and protests from the Moroccan government. It was the first time a Spanish head of state had visited Ceuta in 80 years.\n\nSince 2010, Ceuta (and Melilla) have declared the Muslim holiday of Eid al-Adha or Feast of the Sacrifice, as an official public holiday. It is the first time a non-Christian religious festival has been officially celebrated in Spain since the Reconquista.\n\nEcclesiastical history\n\nThe Catholic Diocese of Ceuta existed from 1417 to 1879. It was a suffragan of the Patriarchate of Lisbon until 1675 and the end of the Iberian Union, when Ceuta chose to remain linked to the king of Spain. Since then it has been a suffragan of the archbishopric of Seville. The Diocese of Tanger was suppressed and incorporated to that of Ceuta in 1570.\n\nIn 1851, upon the signature of the concordat between the Holy See and Spain, the diocese of Ceuta was agreed to be suppressed, being combined into the Diocese of Cádiz y Ceuta. Until then in the Diocese of Cádiz y Algeciras, the bishop was usually the apostolic administrator of Ceuta. The agreement was not implemented until 1879.\n\nGeography\n\nCeuta is dominated by Monte Anyera, a hill along its western frontier with Morocco. The mountain is guarded by a military fort.\n\nMonte Hacho on the Peninsula of Almina overlooking the port is one of the possible locations for the southern pillar of the Pillars of Hercules of Greek legend (the other possibility being Jebel Musa).\n\nClimate\n\nCeuta has a maritime-influenced Subtropical/Mediterranean climate, similar to nearby Spanish and Moroccan cities such as Tarifa, Algeciras or Tangiers. The average diurnal temperature variation is relatively low; the average annual temperature is  with average yearly highs of  and lows of  though the Ceuta weather station has only been in operation since 2003. Ceuta has relatively mild winters for the latitude, while summers are warm yet milder than in the interior of Southern Spain, due to the moderating effect of the Straits of Gibraltar. Summers are very dry, but yearly precipitation is still at 849 mm, which could be considered a humid climate if the summers were not so arid.\n\nPolitics\n\nSince 1995, Ceuta is, along with Melilla, one of the two autonomous cities of Spain.\n\nCeuta is known officially in Spanish as Ciudad Autónoma de Ceuta (English: Autonomous City of Ceuta), with a rank between a standard Spanish city and an autonomous community. Ceuta is part of the territory of the European Union. The city was a free port before Spain joined the European Union in 1986. Now it has a low-tax system within the Economic and Monetary Union of the European Union. As of 2006, its population was 75,861.\n\nCeuta has held elections every four years since 1979, for its 25-seat assembly. The leader of its government was the Mayor until the Autonomy Statute had the title changed to the Mayor-President. , the People's Party (PP) won 18 seats, keeping Juan Jesús Vivas as Mayor-President, which he has been since 2001. The remaining seats are held by the regionalist Caballas Coalition (4) and the Socialist Workers' Party (PSOE, 3).\n\nDue to its small population, Ceuta elects only one member of the Congress of Deputies, the lower house of the Spanish legislature.  election, this post is held by Francisco Márquez de la Rubia of the PP.\n\nSubdivisions\n\nCeuta is subdivided into 63 barriadas (neighbourhoods), such as Barriada de Berizu, Barriada de P. Alfonso, Barriada del Sarchal, and El Hacho.\n\nDispute with Morocco\n\nThe government of Morocco has repeatedly called for Spain to transfer the sovereignty of Ceuta and Melilla, together with the rest of the Spanish plazas de soberanía on the North African coast, on the grounds of asserting its territorial integrity. Morocco has claimed the territories are colonies.\n\nEconomy\n\nThe official currency of Ceuta is the euro. It is part of a special low tax zone in Spain. Ceuta is one of two Spanish port cities on the northern shore of Africa, along with Melilla. They are historically military strongholds, free ports, oil ports, and also fishing ports. Today the economy of the city depends heavily on its port (now in expansion) and its industrial and retail centres. Ceuta Heliport is now used to connect the city to mainland Spain by air. Lidl, Decathlon Group and El Corte Inglés (hardware) have branches in Ceuta. There is also a casino.\n\nTransport\n\nThe city receives high numbers of ferries each day from Algeciras in Andalusia in the south of Spain, along with Melilla and the Canary Islands. The closest airport is Sania Ramel Airport in Morocco. There is a bus service throughout the city which does not pass into neighbouring Morocco.\n\nA single road border checkpoint allows for cars to travel between Morocco and Ceuta. The rest of the border is closed and inaccessible.\n\nDemographics\n\nDue to its location, Ceuta is home to a mixed ethnic and religious population. The two main religious groups are Christians and Muslims. As of 2006 approximately 50% of the population was Spanish/Christian and approximately 49% Arab-Berber/Muslims. As of 2012, the portion of Ceuta's population that identify as Roman Catholic was 68.0%, while the portion of Ceuta's population that identify as Muslim was 28.3%.\n\nSpanish is the primary and official language of the enclave. Moroccan Arabic, Berber, and French are also widely spoken.\n\nReligion\n\nChristianity has been present in Ceuta (called in Roman times Septem or Septum) continuously since the fall of the Western Roman Empire. The ruins of a basilica in downtown Ceuta confirm this reality.\n\nIn 1415, on conquering the city from the Muslims, the Portuguese started the construction of the Cathedral of St. Mary of the Assumption. The Roman Catholic Diocese of Ceuta was established two years later, and in 1851 was merged into the Roman Catholic Diocese of Cadiz y Ceuta. The present cathedral, dating from the late 17th century, combines baroque and neoclassical elements.\n\nEducation\n\nThe University of Granada offers undergraduate programs at their campus in Ceuta. Like all areas of Spain, Ceuta is also served by the National University of Distance Education (UNED).\n\nPrimary and secondary education is possible only in Spanish however a growing number of schools are entering the Bilingual Education Program.\n\nMigrants\n\nAs in Melilla, Ceuta is attractive to migrants who try to use it as an entry to Europe.  As a result the enclave is surrounded by double fences that are 6 meters high and hundreds of migrants congregate near the fences waiting for a chance to cross them. The fences are regularly stormed by migrants trying to claim asylum once they enter Ceuta. \n\nNotable people from Ceuta\n\n1083 to 1700 \n\n* Qadi Ayyad (1083 in Ceuta – 1149) born in Ceuta, then belonging to the Almoravids was the great imam of that city\n* Al-Idrisi (1100 in Ceuta – 1165 in Ceuta) was an Arab Muslim geographer, cartographer and Egyptologist. He lived in Palermo at the court of King Roger II of Sicily, known for the \"Tabula Rogeriana\"\n* Abu al-Abbas as-Sabti (Ceuta 1129 - Marrakesh 1204) is the patron saint of Marrakesh\n* Joseph ben Judah of Ceuta (c. 1160–1226) was a Jewish physician and poet, and disciple of Moses Maimonides\n* Abu al-Abbas al-Azafi (1162 in Ceuta – 1236) a religious and legal scholar, member of the Banu al-Azafi who ruled Ceuta\n* Mohammed ibn Rushayd (1259 in Sabta – 1321) was a judge, writer and scholar of Hadith \n* Alvaro of Braganza ( 1440 - 1504) was a president of Council of Castile.\n\n1700 to 1800\n\n* Don Fernando de Leyba (1734 in Ceuta - 1780) was a Spanish officer who served as the third governor of Upper Louisiana from 1778 until his death.\n* Brigadier General Francisco Antonio García Carrasco Díaz (1742 in Ceuta – 1813 in Lima, Peru ) was a Spanish soldier and Royal Governor of Chile\n* Sebastián Kindelán y O'Regan (1757 in Ceuta – 1826 Santiago de Cuba) was a colonel in the Spanish Army who served as governor of East Florida 1812/1815, of Santo Domingo 1818/1821 and was provisional governor of Cuba 1822/1823\n* Isidro de Alaix Fábregas Count of Vergara and Viscount of Villarrobledo, (1790 in Ceuta – 1853 in Madrid) was a Spanish general of the First Carlist War who backed Isabella II of Spain\n\n1800 to 1950\n\n* General Francisco Llano de la Encomienda (1879 in Ceuta – 1963 in Mexico City) was a Spanish soldier. During the Spanish Civil War (1936–39) he remained loyal to the Second Spanish Republic\n* General Antonio Escobar Huertas (1879 in Ceuta – executed 1940 in Barcelona) was a Spanish military officer\n* África de las Heras Gavilán (Ceuta, 1909 – Moscow, 1988) was a Spanish Communist, naturalized Soviet citizen, and KGB spy who went by the code name Patria\n* Eugenio Martín (born 1925 in Ceuta) is a Spanish film director and screenwriter\n* Jacob Hassan, PhD (1936 in Ceuta – 2006 in Madrid) was a Spanish-Jewish philologist\n* José Martínez Sánchez (born 1945 in Ceuta), nicknamed Pirri, is a retired Spanish footballer, mainly played for Real Madrid, appearing in 561 competitive games and scoring 172 goals\n* Manuel Chaves González (born 1945 in Ceuta) is a Spanish politician of the Spanish Socialist Workers' Party. He served as the Third Vice President of the Spanish Government from 2009 to 2011\n* Ramón Castellano de Torres (born 1947 in Ceuta) is a Spanish artist, thought by some to be an expressionist painter\n* José Ramón López (1950) was a sprint canoer. He won the silver medal in the 1976 Summer Olympics. \n\n1950 to date\n\n* Miguel Bernardo Bianquetti (born 1951 in Ceuta), known as Migueli is a * Spanish retired footballer who played central defender.\n* Francisco Lesmes and Rafael Lesmes Bobed brothers and Spanish footballers.\n* Ignacio Velázquez Rivera (born 1953), first Mayor-President of Melilla\n* Juan Jesús Vivas Lara (Ceuta 1953) became the Mayor-President of Ceuta in Spain in 2001 \n* Pedro Aviles Gutiérrez (Ceuta, 1956) is a Spanish novelist from Madrid.\n* Nayim (Ceuta, 1966) is a retired Spanish footballer; he scored a last-minute goal for Real Zaragoza in the 1995 UEFA Cup Winners' Cup Final.\n* Eva María Isanta Foncuberta (born 1971 in Ceuta) is a Spanish actress  [http://www.imdb.com/name/nm0410706/ IMDb] retrieved 19 October 2017\n* Mohamed Taieb Ahmed (1975, Ceuta) is a Spanish-Moroccan drug lord  responsible for trafficking hashish across the Strait of Gibraltar and into Spain.\n* Lorena Miranda (Ceuta, 1991) is a Spanish female water polo player. She won the silver medal in Water polo at the 2012 Summer Olympics.\n\nTwin towns and sister cities\n\nCeuta is twinned with:\n\n* Aci Catena, Italy\n* Algeciras, Spain\n* Barstow, US\n* Buenos Aires, Argentina\n* Cádiz, Spain\n* Guadalajara, Mexico\n* Malacca City, Malacca, Malaysia\n* Maseru, Lesotho\n* Melilla, Spain\n* Monte Carlo, Monaco\n* Montevideo, Uruguay\n* Santarém, Portugal. Ceuta. http://en.wikipedia.org/?curid=6443."
  }
}
