{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14741",
  "eid" : "17886070-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778548727,
  "textBody" : "Irn-Bru ( \"iron brew\") is a Scottish carbonated soft drink, often described as \"Scotland's other national drink\" (after whisky). It is produced in Westfield, Cumbernauld, North Lanarkshire, by A.G. Barr of Glasgow, since moving out of their Parkhead factory in the mid-2000s, and at a second manufacturing site in Mansfield, Nottinghamshire, England. In addition to being sold throughout the United Kingdom, Barr's Irn-Bru is available throughout the world and can usually be purchased where there is a significant community of people from Scotland. Innovative and sometimes controversial marketing campaigns have kept it as the number one selling soft drink in Scotland, where it competes directly with global brands such as Coca-Cola and Pepsi.\n\nOverview \n\nIrn-Bru is known for its bright orange colour. As of 1999 it contained 0.002% of ammonium ferric citrate, sugar, 32 flavouring agents including caffeine and quinine (but not in Australia), and two controversial colourings (Sunset Yellow FCF and Ponceau 4R). On 27 January 2010, A.G. Barr agreed to a Food Standards Agency voluntary ban on these two colourings although no date was set for their replacement. However, after lobbying by First Minister of Scotland Alex Salmond, a proposed restriction of Sunset Yellow to 10 mg was eased to 20 mg  in 2011 — the same amount present in Irn Bru. As of May 2017, Irn-Bru still contains these colourings.\n\nEarly history \n\nThe first Iron Brew drink was produced by the Maas & Waldstein chemicals company of New York in 1889 under the name IRONBREW. The drink was popular across North America and was widely copied. A similar beverage was launched in 1898 by London essence firm Stevenson & Howell who supplied soft drinks manufacturers  in the UK and colonies. Following this date many local bottlers around the UK began selling their own version of the beverage. Despite the official launch date for Barr's Iron Brew being given as 1901, the firms AG Barr & Co (Glasgow) and Robert Barr (Falkirk) jointly launched their own Iron Brew drink at least two years earlier, according to a document in the firm's own archives which indicates that the drink was already enjoying strong sales by May 1899.  The strongman image which Barr's adopted for their bottle labels and advertising had in fact been trademarked by the firm Stevenson & Howell in 1898.  Barr's ordered their labels directly from Stevenson & Howell who also sold Barr's many of the individual flavours with which they mixed their own drinks. An ad  for Barr's Iron Brew dated 1900 featuring  the original strongman label can be found in Falkirk's Local History Archives. \n\nBarr's trademark application for the brand name Irn-Bru dates from July 1946Trademark number [https://trademarks.ipo.gov.uk/ipo-tmcase/page/Results/1/UK00000649974 UK00000649974]\n when the drink was still off sale because of wartime regulations. The firm first commercialised their drink using this new name in 1948 once government SDI consolidation of the soft drinks industry had ended. The name change followed the introduction of new labelling restrictions which  cracked down on spurious health claims and introduced minimum standards for drinks claiming to contain minerals such as iron. However, according to Robert Barr OBE (chairman 1947–1978), there was also a commercial rationale behind the unusual spelling.  \"Iron Brew\" had come to be understood as a generic product category in the UK, whereas adopting the name \"Irn-Bru\" allowed the firm to have a legally protected brand identity that would  enable the firm to benefit from the popularity of their wartime \"Adventures of Ba-Bru\" comic strip advertising. (The \"Iron Brew\" name has continued to be used for many versions of the drink sold by rival manufacturers.)\n\nRecent developments \n\n1980 saw the introduction of Low Calorie Irn-Bru: this was re-launched in 1991 as Diet Irn-Bru and again in 2011 as Irn-Bru Sugar Free. The Irn-Bru 32 energy drink variant was launched in 2006.\n\nIt has long been the most popular soft drink in Scotland, with Coca-Cola second, but competition between the two brands has brought their sales to roughly equal levels. It is also the third best selling soft drink in the UK, after Coca-Cola and Pepsi, outselling high-profile brands such as Fanta, Dr Pepper, Sprite and 7-Up. This success in defending its home market (a feat claimed only by Irn-Bru, Inca Kola and Thums Up; Thums Up sold out to Coca-Cola in 1993, and Inka Kola owners Corporación Lindley S.A. entered into a joint venture with Coca-Cola in 1999, giving up all rights to the name outside Peru) led to ongoing speculation that Coca-Cola, PepsiCo, Inc. or its UK brand franchisee Britvic would attempt to buy A.G. Barr. In November 2012 AG Barr and Britvic announced a merger proposal, in July 2013 the merger collapsed when terms could not be agreed.\n\nIrn-Bru's advertising slogans used to be 'Scotland's other National Drink', referring to whisky, and 'Made in Scotland from girders', a reference to the rusty colour of the drink; though the closest one can come to substantiating this claim is the 0.002% ammonium ferric citrate listed in the ingredients.\n\nA limited edition Irn-Bru was released in autumn 2011. Packaged with a black and orange design, and with the signature man icon with an added image of a fire, Fiery Irn-Bru, had a warm, tingly feeling in the mouth once drunk. It featured the traditional Irn-Bru flavour with an aftertaste similar to ginger.\n\nIrn-Bru was also sold in reusable 750 ml glass bottles which, like other Barr's drinks, were able to be returned to the manufacturer in exchange for a 30 pence (previously 20p) deposit paid on purchase. This scheme was widely available in shops across Scotland and led to the colloquial term for an empty: a \"glass cheque\". As a result of a 40% drop in returned bottles since the 90s Barr deemed the washing and re-filling process uneconomical, and on 1 January 2016 ceased the scheme.\n\n2016 saw the introduction the current logo, conveying strength and an industrial feel, and a new diet variant IRN-BRU Xtra in different branding to the existing sugar free variety in a similar fashion to Coca-Cola Zero and Pepsi Max.\n\nBarr is changing the formula in January 2018 in response to a sugar tax, to be implemented in April 2018, intended to combat obesity.  By reducing the sugar content below 5g per 100ml, Barr will make Irn-Bru exempt from the new tax.  The manufacturer asserts that most people will not be able to tell the difference in flavour between the old and new formulas, but fans of the drink have started the 'Save Real Irn-Bru' campaign to stop or reverse this change, and have been stocking up on the more sugary formula.\n\nPackaging\n\nIrn-Bru and other Barr brands including Pineappleade, Cream Soda, Tizer, Red Kola, Barr Cola, and Limeade are still available in 750 ml reusable glass bottles.\n\n* The most popular plastic bottle size is 500 ml.\n\nIrn-Bru and Diet Irn-Bru are available in the following sizes:\n* 150 ml can \n* 250 ml plastic bottle\n* 330 ml can\n* 330 ml glass bottle \n* 500 ml Value Can (formerly the big summer can)\n* 500 ml plastic bottle\n* 600 ml plastic bottle (Russia)\n* 1 litre plastic bottle\n* 1.25 litre bottle (Australia, New Zealand, Russia, UK)\n* 2 litre plastic bottle\n* 2.25 litre plastic bottle (Russia)\n* 2.5 litre bottle (UK \"Big Bru\")\n* 3 litre plastic bottle\n* 355 ml glass bottle (in Canada)\n* 750 ml glass bottle\n* 5 litre Syrup containers.\n\nIn May 2007, A.G Barr re-designed the Irn-Bru Can and Bottle Logos.\n\nIn April 2016, A.G Barr released the redesigned Irn-Bru Can and Bottle Logos.\n\nMarketing\n\nAdvertising campaigns \n\nBarr's actively promoted their Irn Bru from the outset, with some of their earliest ads featuring world champion wrestlers and Highland Games athletes Donald Dinnie and Alex Munro who endorsed the drink by means of personal testimonials. In the 1930s, the firm began a long-running series of comic strip ads entitled \"The Adventures of Ba-Bru\" which ran in various local papers from April 1939 until October 1970. The last traces of this campaign, a large neon sign featuring Ba-Bru which stood in Union St above Glasgow Central railway station, was  removed in 1983 and replaced with an illuminated display featuring the tagline \"Your Other National Drink\".\n\nBarr has a long-established gimmick associating Irn-Bru with Scottishness, stemming from the claim of it being Scotland's most popular soft drink. A tagline, \"Made in Scotland from girders\", was used for several years from the 1980s, usually featuring Irn-Bru drinkers becoming unusually strong, durable or magnetic.\n\nA new advertising campaign launched in Spring 2000 which \"dramatises the extraordinary appeal of Irn-Bru in a likeably maverick style\"https://www.campaignlive.co.uk/article/irn-bru-air-first-tv-ads-england/68714 Emma Jardine, Account Director, says:\n\"The ads will more than live up to people's expectations of Irn-Bru's continuously humorous campaign.\" while David Amers, Planning Director, says: \"Irn-Bru is the likeable maverick of the soft drinks market and these ads perfectly capture the brand's spirit.\"\nOne involved a grandfather (played by actor Robert Wilson) who removed his false teeth to spoil his grandson's interest in his can of Irn-Bru. A further TV advertisement featured a senior citizen in a motorised wheelchair robbing a local shopping market of a supply of Irn-Bru.\n\nIn 2004 Irn created a new concept \"Phenomenal\" http://www.thedrum.com/news/2004/10/05/irn-bru-unveils-biggest-ever-marketing-drive-scotland  In 2006 the company launched its first Christmas adverts. This campaign consisted of a parody commercial of a popular Christmas Cartoon, The Snowman, and was effective in interesting American audiences in the Irn-Bru brand.   \n\nFurther advertising campaigns for Irn-Bru appeared in conjunction with the release of Irn-Bru 32 in 2006. http://www.heraldscotland.com/news/12406343.Irn_Bru_32_campaign_leaves_a_sour_taste/ https://www.scotsman.com/news/irn-bru-bows-to-police-pressure-on-cuckoo-ad-1-1122867\n\nA 2009 advertisement for the product features a group of high school pupils performing a musical number, with the refrain \"It's fizzy, it's ginger, it's phenomenal!\" It is a parody of High School Musical, and stars Jack Lowden.\n\nIn 2012 the company change its slogan to \"gets you through\", which see a number of people drinking irn bru to get thought tough situations.https://www.campaignlive.co.uk/article/irn-bru-gets-through-leith-agency/1129415\n\nIn response to the Coca-Cola 'Share a Coke' campaign, Barr decided to produce thousands of limited edition 750 ml bottles of Irn-Bru with the names 'Fanny', 'Senga', 'Rab' and 'Tam' on the label, mimicking that by Coca Cola. The use of the name 'Fanny' ties in with one of Irn-Brus controversial marketing advertisements.\n\nControversy\n\nOne of the most controversial Irn-Bru television adverts evoked 1950s entertainment. A mother plays the piano, while the father and two children deliver a song which ends with the mother singing: \"...even though I used to be a man\". This advertisement was broadcast in 2000, but when it was repeated in 2003, it led to seventeen complaints[http://www.ofcom.org.uk/tv/obb/adv_comp/a14/a14.pdf Ofcom response to complaints about Leith Agency advert for Irn-Bru], July 2004.   about it being offensive to members of the transgender community. Issue A14 of the Ofcom Advertising Complaints bulletin reports that the children's response to their mother's claim was not offensive. The advertisement was meant to be a joke about changing points of view over time. However, the scene involving the mother shaving at the end of the advertisement was deemed to be potentially offensive to transgender people, and so it was taken off the air.\n\nIn 2003, an Irn-Bru commercial which showed a midwife trying to entice a baby from its mother's womb during a difficult delivery sparked fifty complaints. Some saw it as upsetting to women who had suffered miscarriages.\n\nOne billboard that drew criticism featured a young woman in a bikini along with the slogan \"I never knew four-and-a-half inches [] could give so much pleasure\". Another featured a picture of a cow with the slogan \"When I'm a burger, I want to be washed down with Irn-Bru\". This billboard resulted in over 700 complaints but was cleared by advertisement watchdogs.[http://www.asa.org.uk/NR/rdonlyres/B0A907A0-5D13-4EB5-9A40-CC5DA5584183/0/ASA_Statistics_1998.pdf Statistics: 1998 Complaints Resolved (Public and industry)]  A billboard which featured a depressed goth and the slogan \"Cheer up Goth. Have an Irn Bru.\" was also criticised for inciting bullying.\n\nBrand portfolio\n\nMcCowan's also produced Irn-Bru Bars, chewy, fizzy, bright orange confectionery bars which taste very strongly of Irn-Bru, though production ended in late 2005. Irn-Bru sorbet is available in some speciality ice cream shops in Scotland.\n\nIrn-Bru and others\n\nIt can be used as a mixer with alcoholic beverages, mainly vodka and whisky. The alcopop WKD was launched as an alcoholic equivalent of Irn-Bru. Barr retaliated by launching a drink combining Irn-Bru and Bell's whisky, although this proved to be unpopular and was discontinued. A later attempt came in the form of an official Irn-Bru flavour in the Red Square line-up of vodka-based drinks; this too has been discontinued. There is an official Irn-Bru WKD flavour.\n\nExports and foreign markets\n\nIrn-Bru is manufactured in five factories in Russia, and manufactured under licence in Canada, the United States, and since May 2008 in Norway. Bru and other Barr products are exported to Spain, the Netherlands, Germany, Gibraltar, Greece and Cyprus, as well as parts of Africa and Asia. It is available in the Republic of Ireland, increasingly being stocked in BWG and ADM Londis supplied stores, as well as in supermarkets owned by Dunnes Stores and Tesco Ireland. In Ireland generally, the drink mainly sells in Ulster, chiefly in Northern Ireland and County Donegal. It is also available in Malta, Belgium and, as of 2005, in Poland. It is now sold in Iceland, as of 2011. A similarly named product, using the Iron Brew spelling but bearing little resemblance to Irn-Bru in flavour, colour or packaging, is produced by Coca-Cola in South Africa.\n\nAustralia\n\nIn Australia, Irn-Bru was manufactured and distributed under licence by Occasio Australia Pty Ltd until 2009. It was available in 500 ml and 1.25 litre in both standard and diet. The drink enjoyed growing success in the country, with its first advertising campaign launched in Queensland in September 2007. It was initially available in major chains such as Coles and Woolworths, Caltex service stations and in many independent grocers and convenience stores. It was then delisted at Coles supermarkets. Because of manufacturing and bottling issues, Occasio ceased local production in late 2009. It is now imported direct from the UK and distributed by British Provender Pty Ltd.\n\nCanada\n\nIrn-Bru sold in Canada contained no caffeine until recently. In March 2010, Health Canada repealed the ban on caffeine on clear coloured soft drinks and now bottles of Irn-Bru have the label 'Now Contains caffeine' on the packaging. Irn-Bru in Canada is distributed by TFB & Associates Ltd from Markham, Ontario but is packaged by A.G. Barr in Glasgow, Scotland. Irn-Bru can be found at Sobeys supermarkets.\n\nThe now-defunct McKinlay soft-drink company in Glace Bay, Cape Breton, Nova Scotia, Canada, for many years offered its own non-licensed beverage called Iron Brew. It was a brown carbonated soft-drink with a fruity cola taste.\n\nThe standard Irn-Bru distributed in Canada also contains the \"Not a source of iron\" disclaimer on the label.\nThe UK version of the drink (with caffeine) is commonly imported by speciality retailers, particularly in areas with large British populations.\n\nDenmark\n\nIrn-Bru started being sold at 7-Eleven. It has often appeared in the Danish supermarket 'Netto', 'Rema 1000' and 'Normal'. Today only a few 7-Elevens in Denmark continue distributing Irn-Bru, while most Føtex and Bilka stores now stock Irn Bru.\n\nFinland\n\nImported Irn Bru cans are found throughout Finland in some K-supermarket and K-citymarket supermarkets and other shops.\n\nHong Kong\n\nIrn-Bru can be found in selected Wellcome supermarkets, in and around areas where the expatriate population is significant such as the Sheung Wan and Central districts.\n\nMiddle East\n\nA.G. Barr has launched its Irn-Bru product throughout the Middle East. Found mostly in LuLu supermarkets.\n\nNew Zealand \n\nIrn-bru is commonly available nationwide from supermarkets as cans and 1.25 litre plastic bottles. It is bottled by Oasis, the same company that bottles Coca-Cola. Imported Irn-bru from Scotland is available from speciality stores.\n\nNorway\n\nIrn-Bru entered the Norwegian market in May 2008. They had to withdraw from the market again in 2009 as a result of problems with production agreements and lack of funding for marketing.\n\nThey were believed to be sponsoring the Norwegian First Division club Mjøndalen IF in 2009. This later turned out to be fraud carried out by a third party company, and Mjøndalen IF never received any sponsorship from Irn-Bru, even though the team played the 2009 season with Irn-Bru logo on their shirts.\n\nRussia \n\nIrn-Bru began being sold in Russia in 1997, and by 2002 it had become their third best selling soft drink. After its original bottler went out of business, a new deal was signed for the drink to be manufactured and distributed in larger quantities by the Pepsi Bottling Group of Russia in 2002. Its popularity has been attributed to the drink's apparent similarity to discontinued Soviet-era soft drinks. As of 2011, Irn-Bru sales in Russia were still growing.\n\nUnited States\n\nIrn-Bru and Diet Irn-Bru have been formulated since 2002 by A.G. Barr plc to meet the regulations for food colouring of the U.S. Food and Drug Administration (FDA). Ponceau 4R, used in the UK formulation, is prohibited by the FDA. Barr uses alternative food and drink colourants manufactured by a U.S. company approved by the FDA. The product labelling also meets U.S. labelling standards on nutritional information and bar code. Compliant Irn-Bru is solely imported by Great Scot International in Charlotte, North Carolina, who supplies distributors and retailers throughout the U.S. It is only supplied in 500 ml.\n\nReferences in media\n\nMuseums\n\nIn the Museum of Scotland, on Chambers Street in Edinburgh, there is a range of exhibits selected by celebrities—Sir Sean Connery chose a crate of Irn-Bru.\n\nIn the Hunterian Museum in Glasgow, a small refrigerator  contains a 6-pack of Irn Bru in the section dedicated to Scientific Instruments and Lord Kelvin.\n\nMovies\n\nIn the Scottish movie \"The Angels' Share\", directed by Ken Loach, the stolen whisky is carried in Irn-Bru bottles. The colour of the liquor being fairly similar to Irn-Bru, this is a clever way to move the contraband.\n\nMusic\n\nScottish rock band the Fratellis featured a play on Irn-Bru's logo as one of their T-shirt designs in their 2008 tour. The band also brought Irn-Bru with them to drink during their performances.\n\nElvis Costello references Irn-Bru in the \"St Stephen's Day Murders,\" referring to a mixture of Tia Maria and \"that drink made from girders\".\n\nScottish indiepop band the Orchids reference Irn-Bru in their first single, \"I've Got A Habit.\"\n\nScottish Folk-n-Roll band Scocha has a song dedicated to Irn-Bru on their album \"ScattyBoo\". The song is called \"Irn Bru\".\n\nScottish Electro-Metal band Metaltech have referenced Irn Bru throughout the years, with The Insidious Doktor Mayhem drinking from bottles of Irn Bru marked with the band's own variant of the logo, and a song about the drink played at most gigs, called \"Phenomenal\" as well as the bands strong use of orange as a colour and branding.\n\nEnglish Indie-Punk band Martha reference Irn-Bru in their song \"Curly & Raquel\".\n\nComics\n\nIn DC Comics' Doom Patrol Vol 2 #42 (March 1991), Irn-Bru is referenced as one of the products stocked in one of the houses on Danny the Street.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Irn-Bru" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14741" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Irn-Bru ( \"iron brew\") is a Scottish carbonated soft drink, often described as \"Scotland's other national drink\" (after whisky). It is produced in Westfield, Cumbernauld, North Lanarkshire, by A.G. Barr of Glasgow, since moving out of their Parkhead factory in the mid-2000s, and at a second manufacturing site in Mansfield, Nottinghamshire, England. In addition to being sold throughout the United Kingdom, Barr's Irn-Bru is available throughout the world and can usually be purchased where there is a significant community of people from Scotland. Innovative and sometimes controversial marketing campaigns have kept it as the number one selling soft drink in Scotland, where it competes directly with global brands such as Coca-Cola and Pepsi.\n\nOverview \n\nIrn-Bru is known for its bright orange colour. As of 1999 it contained 0.002% of ammonium ferric citrate, sugar, 32 flavouring agents including caffeine and quinine (but not in Australia), and two controversial colourings (Sunset Yellow FCF and Ponceau 4R). On 27 January 2010, A.G. Barr agreed to a Food Standards Agency voluntary ban on these two colourings although no date was set for their replacement. However, after lobbying by First Minister of Scotland Alex Salmond, a proposed restriction of Sunset Yellow to 10 mg was eased to 20 mg  in 2011 — the same amount present in Irn Bru. As of May 2017, Irn-Bru still contains these colourings.\n\nEarly history \n\nThe first Iron Brew drink was produced by the Maas & Waldstein chemicals company of New York in 1889 under the name IRONBREW. The drink was popular across North America and was widely copied. A similar beverage was launched in 1898 by London essence firm Stevenson & Howell who supplied soft drinks manufacturers  in the UK and colonies. Following this date many local bottlers around the UK began selling their own version of the beverage. Despite the official launch date for Barr's Iron Brew being given as 1901, the firms AG Barr & Co (Glasgow) and Robert Barr (Falkirk) jointly launched their own Iron Brew drink at least two years earlier, according to a document in the firm's own archives which indicates that the drink was already enjoying strong sales by May 1899.  The strongman image which Barr's adopted for their bottle labels and advertising had in fact been trademarked by the firm Stevenson & Howell in 1898.  Barr's ordered their labels directly from Stevenson & Howell who also sold Barr's many of the individual flavours with which they mixed their own drinks. An ad  for Barr's Iron Brew dated 1900 featuring  the original strongman label can be found in Falkirk's Local History Archives. \n\nBarr's trademark application for the brand name Irn-Bru dates from July 1946Trademark number [https://trademarks.ipo.gov.uk/ipo-tmcase/page/Results/1/UK00000649974 UK00000649974]\n when the drink was still off sale because of wartime regulations. The firm first commercialised their drink using this new name in 1948 once government SDI consolidation of the soft drinks industry had ended. The name change followed the introduction of new labelling restrictions which  cracked down on spurious health claims and introduced minimum standards for drinks claiming to contain minerals such as iron. However, according to Robert Barr OBE (chairman 1947–1978), there was also a commercial rationale behind the unusual spelling.  \"Iron Brew\" had come to be understood as a generic product category in the UK, whereas adopting the name \"Irn-Bru\" allowed the firm to have a legally protected brand identity that would  enable the firm to benefit from the popularity of their wartime \"Adventures of Ba-Bru\" comic strip advertising. (The \"Iron Brew\" name has continued to be used for many versions of the drink sold by rival manufacturers.)\n\nRecent developments \n\n1980 saw the introduction of Low Calorie Irn-Bru: this was re-launched in 1991 as Diet Irn-Bru and again in 2011 as Irn-Bru Sugar Free. The Irn-Bru 32 energy drink variant was launched in 2006.\n\nIt has long been the most popular soft drink in Scotland, with Coca-Cola second, but competition between the two brands has brought their sales to roughly equal levels. It is also the third best selling soft drink in the UK, after Coca-Cola and Pepsi, outselling high-profile brands such as Fanta, Dr Pepper, Sprite and 7-Up. This success in defending its home market (a feat claimed only by Irn-Bru, Inca Kola and Thums Up; Thums Up sold out to Coca-Cola in 1993, and Inka Kola owners Corporación Lindley S.A. entered into a joint venture with Coca-Cola in 1999, giving up all rights to the name outside Peru) led to ongoing speculation that Coca-Cola, PepsiCo, Inc. or its UK brand franchisee Britvic would attempt to buy A.G. Barr. In November 2012 AG Barr and Britvic announced a merger proposal, in July 2013 the merger collapsed when terms could not be agreed.\n\nIrn-Bru's advertising slogans used to be 'Scotland's other National Drink', referring to whisky, and 'Made in Scotland from girders', a reference to the rusty colour of the drink; though the closest one can come to substantiating this claim is the 0.002% ammonium ferric citrate listed in the ingredients.\n\nA limited edition Irn-Bru was released in autumn 2011. Packaged with a black and orange design, and with the signature man icon with an added image of a fire, Fiery Irn-Bru, had a warm, tingly feeling in the mouth once drunk. It featured the traditional Irn-Bru flavour with an aftertaste similar to ginger.\n\nIrn-Bru was also sold in reusable 750 ml glass bottles which, like other Barr's drinks, were able to be returned to the manufacturer in exchange for a 30 pence (previously 20p) deposit paid on purchase. This scheme was widely available in shops across Scotland and led to the colloquial term for an empty: a \"glass cheque\". As a result of a 40% drop in returned bottles since the 90s Barr deemed the washing and re-filling process uneconomical, and on 1 January 2016 ceased the scheme.\n\n2016 saw the introduction the current logo, conveying strength and an industrial feel, and a new diet variant IRN-BRU Xtra in different branding to the existing sugar free variety in a similar fashion to Coca-Cola Zero and Pepsi Max.\n\nBarr is changing the formula in January 2018 in response to a sugar tax, to be implemented in April 2018, intended to combat obesity.  By reducing the sugar content below 5g per 100ml, Barr will make Irn-Bru exempt from the new tax.  The manufacturer asserts that most people will not be able to tell the difference in flavour between the old and new formulas, but fans of the drink have started the 'Save Real Irn-Bru' campaign to stop or reverse this change, and have been stocking up on the more sugary formula.\n\nPackaging\n\nIrn-Bru and other Barr brands including Pineappleade, Cream Soda, Tizer, Red Kola, Barr Cola, and Limeade are still available in 750 ml reusable glass bottles.\n\n* The most popular plastic bottle size is 500 ml.\n\nIrn-Bru and Diet Irn-Bru are available in the following sizes:\n* 150 ml can \n* 250 ml plastic bottle\n* 330 ml can\n* 330 ml glass bottle \n* 500 ml Value Can (formerly the big summer can)\n* 500 ml plastic bottle\n* 600 ml plastic bottle (Russia)\n* 1 litre plastic bottle\n* 1.25 litre bottle (Australia, New Zealand, Russia, UK)\n* 2 litre plastic bottle\n* 2.25 litre plastic bottle (Russia)\n* 2.5 litre bottle (UK \"Big Bru\")\n* 3 litre plastic bottle\n* 355 ml glass bottle (in Canada)\n* 750 ml glass bottle\n* 5 litre Syrup containers.\n\nIn May 2007, A.G Barr re-designed the Irn-Bru Can and Bottle Logos.\n\nIn April 2016, A.G Barr released the redesigned Irn-Bru Can and Bottle Logos.\n\nMarketing\n\nAdvertising campaigns \n\nBarr's actively promoted their Irn Bru from the outset, with some of their earliest ads featuring world champion wrestlers and Highland Games athletes Donald Dinnie and Alex Munro who endorsed the drink by means of personal testimonials. In the 1930s, the firm began a long-running series of comic strip ads entitled \"The Adventures of Ba-Bru\" which ran in various local papers from April 1939 until October 1970. The last traces of this campaign, a large neon sign featuring Ba-Bru which stood in Union St above Glasgow Central railway station, was  removed in 1983 and replaced with an illuminated display featuring the tagline \"Your Other National Drink\".\n\nBarr has a long-established gimmick associating Irn-Bru with Scottishness, stemming from the claim of it being Scotland's most popular soft drink. A tagline, \"Made in Scotland from girders\", was used for several years from the 1980s, usually featuring Irn-Bru drinkers becoming unusually strong, durable or magnetic.\n\nA new advertising campaign launched in Spring 2000 which \"dramatises the extraordinary appeal of Irn-Bru in a likeably maverick style\"https://www.campaignlive.co.uk/article/irn-bru-air-first-tv-ads-england/68714 Emma Jardine, Account Director, says:\n\"The ads will more than live up to people's expectations of Irn-Bru's continuously humorous campaign.\" while David Amers, Planning Director, says: \"Irn-Bru is the likeable maverick of the soft drinks market and these ads perfectly capture the brand's spirit.\"\nOne involved a grandfather (played by actor Robert Wilson) who removed his false teeth to spoil his grandson's interest in his can of Irn-Bru. A further TV advertisement featured a senior citizen in a motorised wheelchair robbing a local shopping market of a supply of Irn-Bru.\n\nIn 2004 Irn created a new concept \"Phenomenal\" http://www.thedrum.com/news/2004/10/05/irn-bru-unveils-biggest-ever-marketing-drive-scotland  In 2006 the company launched its first Christmas adverts. This campaign consisted of a parody commercial of a popular Christmas Cartoon, The Snowman, and was effective in interesting American audiences in the Irn-Bru brand.   \n\nFurther advertising campaigns for Irn-Bru appeared in conjunction with the release of Irn-Bru 32 in 2006. http://www.heraldscotland.com/news/12406343.Irn_Bru_32_campaign_leaves_a_sour_taste/ https://www.scotsman.com/news/irn-bru-bows-to-police-pressure-on-cuckoo-ad-1-1122867\n\nA 2009 advertisement for the product features a group of high school pupils performing a musical number, with the refrain \"It's fizzy, it's ginger, it's phenomenal!\" It is a parody of High School Musical, and stars Jack Lowden.\n\nIn 2012 the company change its slogan to \"gets you through\", which see a number of people drinking irn bru to get thought tough situations.https://www.campaignlive.co.uk/article/irn-bru-gets-through-leith-agency/1129415\n\nIn response to the Coca-Cola 'Share a Coke' campaign, Barr decided to produce thousands of limited edition 750 ml bottles of Irn-Bru with the names 'Fanny', 'Senga', 'Rab' and 'Tam' on the label, mimicking that by Coca Cola. The use of the name 'Fanny' ties in with one of Irn-Brus controversial marketing advertisements.\n\nControversy\n\nOne of the most controversial Irn-Bru television adverts evoked 1950s entertainment. A mother plays the piano, while the father and two children deliver a song which ends with the mother singing: \"...even though I used to be a man\". This advertisement was broadcast in 2000, but when it was repeated in 2003, it led to seventeen complaints[http://www.ofcom.org.uk/tv/obb/adv_comp/a14/a14.pdf Ofcom response to complaints about Leith Agency advert for Irn-Bru], July 2004.   about it being offensive to members of the transgender community. Issue A14 of the Ofcom Advertising Complaints bulletin reports that the children's response to their mother's claim was not offensive. The advertisement was meant to be a joke about changing points of view over time. However, the scene involving the mother shaving at the end of the advertisement was deemed to be potentially offensive to transgender people, and so it was taken off the air.\n\nIn 2003, an Irn-Bru commercial which showed a midwife trying to entice a baby from its mother's womb during a difficult delivery sparked fifty complaints. Some saw it as upsetting to women who had suffered miscarriages.\n\nOne billboard that drew criticism featured a young woman in a bikini along with the slogan \"I never knew four-and-a-half inches [] could give so much pleasure\". Another featured a picture of a cow with the slogan \"When I'm a burger, I want to be washed down with Irn-Bru\". This billboard resulted in over 700 complaints but was cleared by advertisement watchdogs.[http://www.asa.org.uk/NR/rdonlyres/B0A907A0-5D13-4EB5-9A40-CC5DA5584183/0/ASA_Statistics_1998.pdf Statistics: 1998 Complaints Resolved (Public and industry)]  A billboard which featured a depressed goth and the slogan \"Cheer up Goth. Have an Irn Bru.\" was also criticised for inciting bullying.\n\nBrand portfolio\n\nMcCowan's also produced Irn-Bru Bars, chewy, fizzy, bright orange confectionery bars which taste very strongly of Irn-Bru, though production ended in late 2005. Irn-Bru sorbet is available in some speciality ice cream shops in Scotland.\n\nIrn-Bru and others\n\nIt can be used as a mixer with alcoholic beverages, mainly vodka and whisky. The alcopop WKD was launched as an alcoholic equivalent of Irn-Bru. Barr retaliated by launching a drink combining Irn-Bru and Bell's whisky, although this proved to be unpopular and was discontinued. A later attempt came in the form of an official Irn-Bru flavour in the Red Square line-up of vodka-based drinks; this too has been discontinued. There is an official Irn-Bru WKD flavour.\n\nExports and foreign markets\n\nIrn-Bru is manufactured in five factories in Russia, and manufactured under licence in Canada, the United States, and since May 2008 in Norway. Bru and other Barr products are exported to Spain, the Netherlands, Germany, Gibraltar, Greece and Cyprus, as well as parts of Africa and Asia. It is available in the Republic of Ireland, increasingly being stocked in BWG and ADM Londis supplied stores, as well as in supermarkets owned by Dunnes Stores and Tesco Ireland. In Ireland generally, the drink mainly sells in Ulster, chiefly in Northern Ireland and County Donegal. It is also available in Malta, Belgium and, as of 2005, in Poland. It is now sold in Iceland, as of 2011. A similarly named product, using the Iron Brew spelling but bearing little resemblance to Irn-Bru in flavour, colour or packaging, is produced by Coca-Cola in South Africa.\n\nAustralia\n\nIn Australia, Irn-Bru was manufactured and distributed under licence by Occasio Australia Pty Ltd until 2009. It was available in 500 ml and 1.25 litre in both standard and diet. The drink enjoyed growing success in the country, with its first advertising campaign launched in Queensland in September 2007. It was initially available in major chains such as Coles and Woolworths, Caltex service stations and in many independent grocers and convenience stores. It was then delisted at Coles supermarkets. Because of manufacturing and bottling issues, Occasio ceased local production in late 2009. It is now imported direct from the UK and distributed by British Provender Pty Ltd.\n\nCanada\n\nIrn-Bru sold in Canada contained no caffeine until recently. In March 2010, Health Canada repealed the ban on caffeine on clear coloured soft drinks and now bottles of Irn-Bru have the label 'Now Contains caffeine' on the packaging. Irn-Bru in Canada is distributed by TFB & Associates Ltd from Markham, Ontario but is packaged by A.G. Barr in Glasgow, Scotland. Irn-Bru can be found at Sobeys supermarkets.\n\nThe now-defunct McKinlay soft-drink company in Glace Bay, Cape Breton, Nova Scotia, Canada, for many years offered its own non-licensed beverage called Iron Brew. It was a brown carbonated soft-drink with a fruity cola taste.\n\nThe standard Irn-Bru distributed in Canada also contains the \"Not a source of iron\" disclaimer on the label.\nThe UK version of the drink (with caffeine) is commonly imported by speciality retailers, particularly in areas with large British populations.\n\nDenmark\n\nIrn-Bru started being sold at 7-Eleven. It has often appeared in the Danish supermarket 'Netto', 'Rema 1000' and 'Normal'. Today only a few 7-Elevens in Denmark continue distributing Irn-Bru, while most Føtex and Bilka stores now stock Irn Bru.\n\nFinland\n\nImported Irn Bru cans are found throughout Finland in some K-supermarket and K-citymarket supermarkets and other shops.\n\nHong Kong\n\nIrn-Bru can be found in selected Wellcome supermarkets, in and around areas where the expatriate population is significant such as the Sheung Wan and Central districts.\n\nMiddle East\n\nA.G. Barr has launched its Irn-Bru product throughout the Middle East. Found mostly in LuLu supermarkets.\n\nNew Zealand \n\nIrn-bru is commonly available nationwide from supermarkets as cans and 1.25 litre plastic bottles. It is bottled by Oasis, the same company that bottles Coca-Cola. Imported Irn-bru from Scotland is available from speciality stores.\n\nNorway\n\nIrn-Bru entered the Norwegian market in May 2008. They had to withdraw from the market again in 2009 as a result of problems with production agreements and lack of funding for marketing.\n\nThey were believed to be sponsoring the Norwegian First Division club Mjøndalen IF in 2009. This later turned out to be fraud carried out by a third party company, and Mjøndalen IF never received any sponsorship from Irn-Bru, even though the team played the 2009 season with Irn-Bru logo on their shirts.\n\nRussia \n\nIrn-Bru began being sold in Russia in 1997, and by 2002 it had become their third best selling soft drink. After its original bottler went out of business, a new deal was signed for the drink to be manufactured and distributed in larger quantities by the Pepsi Bottling Group of Russia in 2002. Its popularity has been attributed to the drink's apparent similarity to discontinued Soviet-era soft drinks. As of 2011, Irn-Bru sales in Russia were still growing.\n\nUnited States\n\nIrn-Bru and Diet Irn-Bru have been formulated since 2002 by A.G. Barr plc to meet the regulations for food colouring of the U.S. Food and Drug Administration (FDA). Ponceau 4R, used in the UK formulation, is prohibited by the FDA. Barr uses alternative food and drink colourants manufactured by a U.S. company approved by the FDA. The product labelling also meets U.S. labelling standards on nutritional information and bar code. Compliant Irn-Bru is solely imported by Great Scot International in Charlotte, North Carolina, who supplies distributors and retailers throughout the U.S. It is only supplied in 500 ml.\n\nReferences in media\n\nMuseums\n\nIn the Museum of Scotland, on Chambers Street in Edinburgh, there is a range of exhibits selected by celebrities—Sir Sean Connery chose a crate of Irn-Bru.\n\nIn the Hunterian Museum in Glasgow, a small refrigerator  contains a 6-pack of Irn Bru in the section dedicated to Scientific Instruments and Lord Kelvin.\n\nMovies\n\nIn the Scottish movie \"The Angels' Share\", directed by Ken Loach, the stolen whisky is carried in Irn-Bru bottles. The colour of the liquor being fairly similar to Irn-Bru, this is a clever way to move the contraband.\n\nMusic\n\nScottish rock band the Fratellis featured a play on Irn-Bru's logo as one of their T-shirt designs in their 2008 tour. The band also brought Irn-Bru with them to drink during their performances.\n\nElvis Costello references Irn-Bru in the \"St Stephen's Day Murders,\" referring to a mixture of Tia Maria and \"that drink made from girders\".\n\nScottish indiepop band the Orchids reference Irn-Bru in their first single, \"I've Got A Habit.\"\n\nScottish Folk-n-Roll band Scocha has a song dedicated to Irn-Bru on their album \"ScattyBoo\". The song is called \"Irn Bru\".\n\nScottish Electro-Metal band Metaltech have referenced Irn Bru throughout the years, with The Insidious Doktor Mayhem drinking from bottles of Irn Bru marked with the band's own variant of the logo, and a song about the drink played at most gigs, called \"Phenomenal\" as well as the bands strong use of orange as a colour and branding.\n\nEnglish Indie-Punk band Martha reference Irn-Bru in their song \"Curly & Raquel\".\n\nComics\n\nIn DC Comics' Doom Patrol Vol 2 #42 (March 1991), Irn-Bru is referenced as one of the products stocked in one of the houses on Danny the Street. Irn-Bru. http://en.wikipedia.org/?curid=14741."
  }
}
