{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14894",
  "eid" : "18838950-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778550373,
  "textBody" : "Indian Institute of Technology Kanpur (also known as IIT Kanpur or IITK) is a public engineering institution located in Kanpur, Uttar Pradesh. It was declared to be an Institute of National Importance by the Government of India under the Institutes of Technology Act.\n\nEstablished in 1959 as one of the first Indian Institutes of Technology, the institute was created with the assistance of a consortium of nine US research universities as part of the Kanpur Indo-American Programme (KIAP).Norman Dahl: Kanpur Indo-American Program; http://csg.csail.mit.edu/Dahl/kiapbooklet.pdf, retrieved 3 February 2012.\n\nHistory\n\nIIT Kanpur was established by an Act of Parliament in 1959. The institute was started in December 1959 in a room in the canteen building of the Harcourt Butler Technological Institute at Agricultural Gardens in Kanpur. In 1963, the institute moved to its present location, on the Grand Trunk Road near the village of Kalyanpur in Kanpur district.\n\nDuring the first ten years of its existence, a consortium of nine US universities (namely M.I.T, University of California, Berkeley, California Institute of Technology, Princeton University, Carnegie Institute of Technology, University of Michigan, Ohio State University,\nCase Institute of Technology and Purdue University) helped set up IIT Kanpur's research laboratories and academic programmes under the Kanpur Indo-American Programme (KIAP). The first Director of the Institute was P. K. Kelkar (after whom the Central Library was renamed in 2002).\n\nUnder the guidance of economist John Kenneth Galbraith, IIT Kanpur was the first institute in India to offer Computer science education.E.C. Subbarao: An Eye for Excellence, Fifty Innovative Years of IIT Kanpur; Harper Collins Publishers, India, 2008. The earliest computer courses were started at IIT Kanpur in August 1963 on an IBM 1620 system. The initiative for computer education came from the Electrical engineering department, then under the chairmanship of Prof. H.K. Kesavan, who was concurrently the chairman of Electrical Engineering and head of the Computer Centre. Prof. Harry Huskey of the University of California, Berkeley, who preceded Kesavan, helped with the computer activity at IIT-Kanpur. In 1971, the institute began an independent academic program in Computer Science and Engineering, leading to M.Tech. and Ph.D. degrees.\n\nIn 1972 the KIAP program ended, in part because of tensions due to the U.S. support of Pakistan.  Government funding was also reduced as a reaction to the sentiment that the IIT's were contributing to the brain drain.\n\nCampus\n\n \nIIT Kanpur is located on the Grand Trunk Road, 15 km west of Kanpur City and measures close to 420 ha.  This land was donated by the Government of Uttar Pradesh in 1960 and by March 1963 the Institute had moved to its current location.\n\nThe institute has around 6478 students with 3938 undergraduate students and 2540 postgraduate students and about 500 research associates.\n\nNoida Extension centre\n\nIIT Kanpur is to open an extension centre in Noida with the plan of making a small convention centre there for supporting outreach activities. Its foundation was laid on 4 December 2012 on 5 acres of land allocated by Uttar Pradesh state government in the [https://maps.google.co.in/maps?qsector+62+noida&hl\nen&ll28.621634,77.367697&spn\n0.031606,0.066047&sll26.629195,73.873558&sspn\n16.435889,33.815918&tm&hnear\nSector+62,+Noida,+Gautam+Buddh+Nagar,+Uttar+Pradesh&z=15sector-62 sector-62] of Noida city, which is less than an hour`s journey from New Delhi and the Indira Gandhi International Airport. The cost of construction is estimated to be about 25 crores. The new campus will have an auditorium, seminar halls for organising national and international conferences and an International Relations Office along with a 7-storey guest house. Several short-term management courses and refresher courses meant for distance learning will be available at the extension center.[https://web.archive.org/web/20140202100045/http://www.iitk.ac.in/drpg/social_media/Greeting_2012.htm News from]. IITK. Retrieved on 9 October 2013.\n\nHelicopter service\n\nBeing a major industrial town, Kanpur has a good connectivity by rail and by road but it lags in terms of air connectivity. IIT Kanpur was suffering significantly in comparison to IIT Delhi and IIT Bombay due to this reason as far as visiting companies and other dignitaries are concerned\nOn 1 June 2013, a helicopter ferry service was started at IIT Kanpur run by Pawan Hans Helicopters Limited. In its initial run the service connects IIT Kanpur to Lucknow, but it is planned to later extend it to New Delhi. Currently  there are two flights daily to and from Lucknow Airport with a duration of 25 minutes. Lucknow Airport operates both international and domestic flights to major cities. IIT Kanpur is the first academic institution in the country to provide such a service.\nhttp://spo.iitk.ac.in/reach_us.html The estimated charges are Rs. 6000 (USD $100) per person. If anyone would like to avail the facility he/she have to contact Student Placement Office (SPO) at IIT Kanpur, since the helicopter service is subject to availability of chopper rights. The campus also has airstrips which allows flight workshops and joyrides for students.\n\nNew York Office\n\nThe Institute has set up an office in New York with alumnus, Sanjiv Khosla designated as the overseas brand ambassador of the institute. It is located on 62, William Street, Manhattan. The office aims to hunt for qualified and capable faculty abroad, facilitate internship opportunities in North American universities and be conduit for research tie ups with various US universitieshttps://nyc.iitk.ac.in/. The New York Office also tries to amass funds through the alumni based there. A system that invites students and faculty of foreign institutes to IIT Kanpur is also being formulated.http://timesofindia.indiatimes.com/home/education/news/IIT-Kanpur-opens-office-in-New-York/articleshow/22939102.cms\n\nAdmissions\n\nUndergraduate admissions until 2012 were being done through the national-level Indian Institute of Technology Joint Entrance Examination (IIT-JEE). Following the Ministry of Human Resource Development's decision to replace IIT-JEE with a common engineering entrance examination, IIT Kanpur's admissions are now based on JEE (Joint Entrance Examination) -Advanced level along with other IITs.\n\nPostgraduate admissions are made through the Graduate Aptitude Test in Engineering.\n\nStudent life\n\nNational events\n\n*Antaragni:  Antaragni is a non-profit organisation run by the students of IIT Kanpur. It was funded entirely by the Student Gymkhana of the university it began.  Today the budget is almost Rs 1 crore, raised through sponsorship. It began as an inter-collegiate cultural event in 1964, and now draws in over 30,000 visitors from 300 colleges in India Annual [culfest|cultural festival] held over 4 days in October. The festival includes music, drama, literary games and quizzing. There is a YouTube channel dedicated to the festival with 1,000+ subscribers.\n*Techkriti: It was started in 1995 with an aim to encourage interest and innovation in technology among students and to provide a platform for industry and academia to interact. Megabucks (a business and entrepreneurship festival) used to be held independently but was merged with Techkriti in 2010. Notable speakers at Techkriti have included APJ Abdul Kalam, Vladimir Voevodsky, Douglas Osheroff, Oliver Smithies, Rakesh Sharma, David Griffiths and Richard Stallman. \n* Udghosh:  Udghosh is an annual inter-college sports meet held in September. UDGHOSH involves students from all over India competing in the university's sports facilities. The festival includes Motivational Talks, Mini Marathon, Gymnastic Shows and Sport Quizzes to various sports events like:\n* Vivekananda Youth Leadership Convention: Vivekananda Samiti, under Students Gymkhana, on behalf of the IIT Kanpur, has undertaken the celebration of 150th Birth Anniversary of Swami Vivekananda from 2011-2015. The convention has included Kiran Bedi, Bana Singh, Yogendra Singh Yadav, Raju Narayana Swamy, Arunima Sinha, Rajendra Singh and other personalities from different fields in previous years.\n* E-summit: It started in 2013. The first E-Summit was scheduled for 16-18 Aug, 2013. These three day festival by Entrepreneurship Cell, IIT Kanpur on the theme Emerge on the Radar included talks by eminent personalities, workshops and competitions.\n\nStudents' Gymkhana\n\nThe Students' Gymkhana is the students' government organization of IIT Kanpur, established in 1962.[http://students.iitk.ac.in/gymkhana/ Home | Students' Gymkhana, IIT Kanpur]\n\nThe Students' Gymkhana functions mainly through the Students' Senate, an elected student representative body composed of Senators elected from each batch and the five elected executives:\n* President, Students' Gymkhana.\n* General Secretary Cultural Council.\n* General Secretary Films and Media Council.\n* General Secretary Games and Sports Council.\n* General Secretary Science and Technology Council.\n\nThe number of Senators in the Students' Senate is around 50-55. A senator is elected for every 100 students of IIT Kanpur.\n\nThe meetings of the Students' Senate are chaired by the Convener, Students' Senate, who is elected by the Senate.\nThe Senate lays down the guidelines for the functions of the executives, their associated councils, the Gymkhana Festivals and other matters pertaining to the Student body at large.\n\nThe Students' Senate has a say in the policy and decision making bodies of the institute. The President, Students' Gymkhana and the Convener, Students' Senate are special Invitees to the Institute Academic Senate. The President is usually invited to the meetings of the Board of Governors when matters affecting students are being discussed. Nominees of the Students' Senate are also members of the various standing Committees of the Institute Senate including the disciplinary committee, the Undergraduate and Postgraduate committee, the scholarship committee etc. All academic departments have Departmental Undergraduate and Post Graduate Committees consisting of members of the faculty and nominees of the Students' Gymkhana.\n\nRankings\n\nInternationally, IIT Kanpur was ranked 293 in QS World University Rankings for 2018. The same rankings ranked it 59 in Asia and 21 among BRICS nations. The Times Higher Education World University Rankings ranked it 501-600 globally in the 2018 ranking 63 in Asia and 32 among BRICS & Emerging Economies University Rankings 2017.\n\nIn India, among engineering colleges, it ranked third by India Today in 2017, fourth in India by Outlook India and fifth by The Week. It was ranked fifth among engineering collecges in India by the National Institutional Ranking Framework (NIRF) in 2017, and seventh overall.\n\nThe Department of Industrial and Management Engineering was ranked 11 among management schools in India by NIRF in 2017.\n\nAcademic bodies and activities\n\nIIT Kanpur offers various courses on management and social sciences.\n\nUndergraduate\n\nIIT Kanpur offers four-year B.Tech programs in Aerospace Engineering, Biological Sciences and Bio-engineering, Chemical Engineering, Civil Engineering, Computer Science and Engineering, Electrical Engineering, Materials Science and Engineering and Mechanical Engineering. The admission to these programs is procured through Joint Entrance Examination. IITK offers admission only to bachelor's degree now (discontinuing the integrated course programs), but it can be extended by 1 year to make it integrated, depending on the choice of student and based on his/her performance there at undergraduate level. IIT Kanpur also offers four-year B.S. Programs in Pure and Applied Sciences (Mathematics, Physics and Chemistry in particular), Earth Science and Economics.\n\nNew academic system\n\nFrom 2011, IIT Kanpur has started offering a four-year BS program in sciences and has kept its B.Tech Program intact. Entry to the five-year M.Tech/MBA programs and Dual degree programme will be done based on the CPI of students instead of JEE rank.[http://www.iitk.ac.in/doaa/faqs.pdf FAQ on the new academic curriculum]  In order to reduce the number of student exams, IIT Kanpur has also abolished the earlier system of conducting two mid-term examinations. Instead, only two examinations (plus two quizzes in most courses depending on the instructor-in-charge, one before mid-semesters and the other after the mid-semesters and before the end-semesters examination), one between the semester and other towards the end of it would be held from the academic session starting July 2011 onward as per Academic Review Committee's recommendations.\n\nPostgraduate\n\nPostgraduate courses in Engineering offer Master of Technology (M.Tech), MS (R) and Ph.D. degrees. The institute also offers two tier M.Sc. courses in areas of basic sciences in which students are admitted through Joint Admission Test for M.Sc.(JAM) exam. The institute also offers M.Des. (2 years), M.B.A. (2 years) and  M.Sc. (2 years) degrees. Admissions to M. Tech is made once a year through Graduate Aptitude Test in Engineering. Admissions to M. Des are made once a year through both Graduate Aptitude Test in Engineering(GATE) and Common Entrance Exam for Design(CEED). Until 2011, admissions to the M.B.A. program were accomplished through the Joint Management Entrance Test (JMET), held yearly, and followed by a Group Discussion/Personal Interview process. In 2011, JMET was replaced by Common Admission Test (CAT).http://www.iitk.ac.in/design/apply.html\n\nDepartments\n\nThe academic departments at IIT Kanpur are:\n\nLaboratories and other facilities\n\nThe campus is spread over an area of . Facilities include the National Wind Tunnel Facility. Other large research centres include the Advanced Centre for Material Science, a Bio-technology centre, the Advanced Centre for Electronic Systems, and the Samtel Centre for Display Technology, Centre for Mechatronics, Centre for Laser Technology, Prabhu Goel Research Centre for Computer and Internet Security, Facility for Ecological and Analytical Testing. The departments have their own libraries.\n\nThe institute has its own airfield, for flight testing and gliding.\n\nPK Kelkar Library (formerly Central Library) is an academic library of the institute with a collection of more than 300,000 volumes, and subscriptions to more than 1,000 periodicals. The library was renamed to its present name in 2003 after Dr. P K Kelkar, the first director of the institute. It is housed in a three-story building, with a total floor area of 6973 square metres.  The Abstracting and Indexing periodicals, Microform and CD-ROM databases, technical reports, Standards and thesis are in the library. Each year, about 4,500 books and journal volumes are added to the library.\n\nThe New Core Labs (NCL) is 3 storey building with state of the art physics and chemistry laboratories for courses in the first year. The New Core Labs also has Linux and Windows computer labs for the use of first year courses and a Mathematics department laboratory housing machines with high computing power.\n\nIIT Kanpur has set up the SIDBI Innovation and Incubation Centre(SIIC) in collaboration with the Small Industries development Bank of India (SIDBI) aiming to aid innovation, research, and entrepreneurial activities in technology-based areas. SIIC helps business Start-ups to develop their ideas into commercially viable products.\n\nA team of students, working under the guidance of faculty members of the institute and scientists of Indian Space Research Organisation (ISRO) have designed and built India's first nano satellite Jugnu, which was successfully launched in orbit on 12 Oct 2011 by ISRO's PSLV-C18.The Economic Times \"[http://articles.economictimes.indiatimes.com/2011-10-25/news/30320349_1_nano-satellite-jugnu-iit-kanpur Nano satellite 'Jugnu' launch by IIT-Kanpur marks watershed in Indian space technology]\". Dated  25 October 2011 \n\nComputer Centre\n\nThe Computer Centre is one of the advanced computing service centre among academic institution in India. IT hosts IIT Kanpur website and provides personal web space for students and faculties.  It also provides a spam filtered email server and high speed fibre optic Internet to all the hostels and the academics. Users have multiple options to choose among various interfaces to access mail service.  It has Linux and windows laboratories equipped with dozens of high-end software like MATLAB, Autocad, Ansys, Abaqus etc. for use of students. Apart from departmental computer labs, computer centre hosts more than 300 Linux terminals and more than 100 Windows terminals and is continuously available to the students for academic work and recreation. Computer centre has recently adopted an open source software policy for its infrastructure and computing. Various high-end compute and GPU servers are remotely available from data centre for user computation.\n\nComputer centre has multiple super computing clusters for research and teaching activity. In June 2014 IIT Kanpur launched their 2nd supercomputer which is India’s 5thhttp://timesofindia.indiatimes.com/city/kanpur/IIT-Kanpur-unveils-its-second-supercomputer/articleshow/36037756.cms most powerful supercomputer as of now. The new supercomputer 'Cluster Platform SL230s Gen8' manufactured by Hewlett-Packard has 15,360 cores and a theoretical peak (Rpeak) 307.2 TFlop/s and is the world's 192th most powerful supercomputer as of June 2015.http://top500.org/list/2015/06/?page=2\n\nStudents' research related activity\n\nResearch is controlled by the Office of the Dean of Research and Development. Under the aegis of the Office the students publish the quarterly NERD Magazine (Notes on Engineering Research and Development) which publishes scientific and technical content created by students. Articles may be original work done by students in the form of hobby projects, term projects, internships, or theses. Articles of general interest which are informative but do not reflect original work are also accepted.\n\nAlong with the magazine a student research organisation,  PoWER (Promotion of Work Experience and Research) has been started. Under it several independent student groups are working on projects like the Lunar Rover for ISRO, alternate energy solutions under the Group for Environment and Energy Engineering, ICT solutions through a group Young Engineers, solution for diabetes, green community solutions through ideas like zero water and zero waste quality air approach. Through BRaIN (Biological Research and Innovation Network) students interested in solving biological problems get involved in research projects like  genetically modifying fruit flies to study molecular systems and developing bio-sensors to detect alcohol levels. A budget of Rs 1.5 to 2 crore has been envisaged to support student projects that demonstrate technology.\n\n* Jugnu\nThe students of IIT Kanpur made a nano satellite called Jugnu, which was given by president Pratibha Patil to ISRO for launch. Jugnu is a remote sensing satellite which will be operated by the Indian Institute of Technology Kanpur. It is a nanosatellite which will be used to provide data for agriculture and disaster monitoring. It is a 3-kilogram (6.6 lb) spacecraft, which measures 34 centimetres (13 in) in length by 10 centimetres (3.9 in) in height and width. Its development programme cost around 25 million rupees. It has a design life of one year.\nJugnu's primary instrument is the Micro Imaging System, a near infrared camera which will be used to observe vegetation. It also carries a GPS receiver to aid tracking, and is intended to demonstrate a microelectromechanical inertial measurement unit.\n\n*IITK Motorsports\nIITK motorsports is the biggest and most comprehensive student initiative of the college, founded in January 2011. It is a group of students from varied disciplines who aim at designing and fabricating a Formula-style race car for international Formula SAE\n(Society of Automotive Engineers) events. Most of the components of the car, except the engine, tyres and wheel rims, are designed and manufactured by the team members themselves. The car is designed to provide maximum performance under the constraints of the event, while ensuring the driveability, reliability, driver safety and aesthetics of the car are not compromised.\n\nThe institute is part of the European Research and Education Collaboration with Asia (EURECA) programme since 2008.\n\nNotable alumni\n\n \n\n* Manindra Agrawal, Nitin Saxena, and Neeraj Kayal (proved with their AKS primality test that primality testing has a polynomial time algorithm.) Clay Research Award, 2002, Godel Prize, 2006[http://mangalorean.com/news.php?newstypebroadcast&broadcastid\n93282 \"Bangalore: IIT-Kanpur professor bags first Infosys Mathematics Prize\"], 16 September. 2008\n* Rakesh Agrawal, National Medal of Technology and Innovation Laureate and Professor of Chemical Engineering at Purdue University\n* Anand Kumar Bachhawat, biochemist, N-Bios laureate\n* P. Balram, Director of IISC Bangalore and winner of Padma Bhushan\n* Upinder Singh Bhalla, Neuroscientist, Shanti Swarup Bhatnagar laureate\n* Suresh Kumar Bhatia - chemical engineer, academic, Shanti Swarup Bhatnagar laureate\n* Jagjeet (Jeet) S. Bindra, director at Edison International\n* Narayanan Chandrakumar, chemical physicist, Shanti Swarup Bhatnagar laureate\n* Tushar Kanti Chakraborty, organic chemist, Shanti Swarup Bhatnagar laureate\n* Sumit Chowdhury, CEO & Founder at Gaia Smart Cities, Ex President at Reliance Jio Infocomm Ltd.\n* Atish Dabholkar, String theorist, Shanti Swarup Bhatnagar laureate\n* Sirshendu De, a recipient of 2011 Shanti Swarup Bhatnagar Award and professor of chemical engineering department, IIT Kharagpur\n* Avinash Deshpande - astrophysicist, Shanti Swarup Bhatnagar laureate\n* Deepak Dhar - theoretical physicist, Shanti Swarup Bhatnagar laureate\n* Satyendra Dubey, a Project Director in National Highways Authority of India who was assassinated  for exposing corruption in the Golden Quadrilateral highway project.\n* Rajit Gadh, Professor of Engineering, Director of UCLA Smart Grid Energy Research Center, and a pioneer of Smart Grids\"\n* Pradyut Ghosh, inorganic chemist, Shanti Swarup Bhatnagar laureate\n* Balasubramanian Gopal, Molecular biophysicist, Shanti Swarup Bhatnagar laureate\n* Umang Gupta, Chairman of the Board and Chief Executive Officer of Keynote Systems, Inc.\n* Jainendra K. Jain, condensed matter theorist\n*Lalit Jalan, CEO of Reliance Infrastructure Limited is a winner of Directors Honours and Deans List at Wharton.  He was also showcased as one of the 15 achievers from the IIT system at the 1st PAN IIT meeting in California in January 2003.\n* Rakesh Jain, distinguished tumor researcher at Harvard Medical School and recent winner of National Medal of Science.\n* Shahid Jameel - virologist, Shanti Swarup Bhatnagar laureate\n* Ashok Jhunjhunwala, Padma Shri and Professor, Department of Electrical Engineering, IIT Madras\n* Varun Khaitan - Co-Founder at UrbanClap\n* Chandra Kintala, Professor and Director of Software Engineering at New Jersey Institute of Technology; Director(Retd.), Bell Labs, USA\n* G. Ravindra Kumar - laser physicist, Shanti Swarup Bhatnagar laureate\n* Jitendra Malik, Arthur J. Chick Professor of EECS at University of California at Berkeley\n* Ranjan Mallik - communications engineer, Shanti Swarup Bhatnagar laureate\n* Shiraz Minwalla, a string theorist at TIFR who was awarded ICTP Prize for his contribution to theoretical physics\n* Som Mittal,  President of NASSCOM\n* Mahan Mj, mathematician and a recipient of the 2011 Shanti Swarup Bhatnagar Award\n* Debasisa Mohanty, computational biologist, N-Bios laureate\n* Pramod Sadasheo Moharir, geophysicist, Shanti Swarup Bhatnagar laureate\n* Late Rajeev Motwani, computer scientist, Professor of Computer Science at Stanford University\n* N.R. Narayana Murthy, the Founder & Chairman Emeritus of Infosys\n* Muktesh Pant, CEO of KFC.\n* Kapil Hari Paranjape, Mathematician, Shanti Swarup Bhatnagar laureate\n* Prashant Pathak, Canada-based entrepreneur and investor, Chairman of Investment Committee of Business Development Bank of Canada, CEO of Ekagrata Inc.\n* Manu Prakash- Physical Biologist and Inventor, Best known for his Foldscope and Paperfuge\n\n* Prem Das Rai, the first IIT and IIM educated member of Parliament Lok Sabha\n* Arup Kumar Raychaudhuri, condensed matter physicist, Shanti Swarup Bhatnagar laureate\n* Anil K. Rajvanshi,[http://www.iitk.ac.in/dora/anil-rajvanshi-dora] Director, Nimbkar Agricultural Research Institute and winner of Jamnalal Bajaj Award 2001,  FICCI award 2002, Globe Award 2009, 2014 University of Florida Distinguished Alumnus Award winner.[http://www.eng.ufl.edu/news/gator-engineering-honors-distinguished-alumnus-awardees-2/]\n* Ayyalusamy Ramamoorthy, scientist in the area of NMR and biological membranes\n* Suryanarayanasastry Ramasesha, quantum chemist, Shanti Swarup Bhatnagar laureate\n* Sanjay Sarma, professor at MIT, credited with developing standards and technologies in the commercial RFID industry and Director of Digital Learning at MIT.\n* Ashoke Sen, FRS, Padma Shri and Padma Bhushan, string theorist\n* Ram Sewak Sharma, Chairman, Telecom Regulatory Authority of India (TRAI)\n* Pradeep Sindhu, co-founder and Chief Technical Officer/Vice Chairman of the Board of Directors of Juniper Networks Inc.\n* B. N. Singh, Chairman of ICTACEM, Professor & Dean HR(Human Resource), IIT Kharagpur\n* Sudeshna Sinha, Fellow of World Academy of Sciences (TWAS), Indian Academy of Sciences, Indian National Science Academy\n* Duvvuri Subbarao, 22nd Governor of Reserve Bank of India\n* Mriganka Sur,  neuroscientist, Sherman Fairchild Professor of Neuroscience, Head, Dept of Brain and Cognitive Science MIT, Fellow of Royal Society\n* Amitabh Thakur, an officer of the Indian Police Service, social activist, writer\n* Muralee Thummarukudy- Chief Disaster Risk Reduction at United Nations Environment Programme\n* Sandip Trivedi, theoretical physicist working at Tata Institute for Fundamental Research TIFR,  recipient of the Infosys Prize 2010 in the category of Physical Sciences {http://www.infosys-science-foundation.com/prize/laureates/2010/sandip-trivedi.asp}\n* Vijay Vaishnavi , researcher and scholar in the computer information systems field\n* Raghavan Varadarajan, Biophysicist, Shanti Swarup Bhatnagar laureate\n* K. VijayRaghavan (Director of National Centre for Biological Sciences), Padma Shri - 2003 IITK Distinguished Alumnus Award Winner\n* Spenta R. Wadia, theoretical physicist working in string theory and quantum field theory",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Indian Institute of Technology Kanpur" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14894" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Indian Institute of Technology Kanpur (also known as IIT Kanpur or IITK) is a public engineering institution located in Kanpur, Uttar Pradesh. It was declared to be an Institute of National Importance by the Government of India under the Institutes of Technology Act.\n\nEstablished in 1959 as one of the first Indian Institutes of Technology, the institute was created with the assistance of a consortium of nine US research universities as part of the Kanpur Indo-American Programme (KIAP).Norman Dahl: Kanpur Indo-American Program; http://csg.csail.mit.edu/Dahl/kiapbooklet.pdf, retrieved 3 February 2012.\n\nHistory\n\nIIT Kanpur was established by an Act of Parliament in 1959. The institute was started in December 1959 in a room in the canteen building of the Harcourt Butler Technological Institute at Agricultural Gardens in Kanpur. In 1963, the institute moved to its present location, on the Grand Trunk Road near the village of Kalyanpur in Kanpur district.\n\nDuring the first ten years of its existence, a consortium of nine US universities (namely M.I.T, University of California, Berkeley, California Institute of Technology, Princeton University, Carnegie Institute of Technology, University of Michigan, Ohio State University,\nCase Institute of Technology and Purdue University) helped set up IIT Kanpur's research laboratories and academic programmes under the Kanpur Indo-American Programme (KIAP). The first Director of the Institute was P. K. Kelkar (after whom the Central Library was renamed in 2002).\n\nUnder the guidance of economist John Kenneth Galbraith, IIT Kanpur was the first institute in India to offer Computer science education.E.C. Subbarao: An Eye for Excellence, Fifty Innovative Years of IIT Kanpur; Harper Collins Publishers, India, 2008. The earliest computer courses were started at IIT Kanpur in August 1963 on an IBM 1620 system. The initiative for computer education came from the Electrical engineering department, then under the chairmanship of Prof. H.K. Kesavan, who was concurrently the chairman of Electrical Engineering and head of the Computer Centre. Prof. Harry Huskey of the University of California, Berkeley, who preceded Kesavan, helped with the computer activity at IIT-Kanpur. In 1971, the institute began an independent academic program in Computer Science and Engineering, leading to M.Tech. and Ph.D. degrees.\n\nIn 1972 the KIAP program ended, in part because of tensions due to the U.S. support of Pakistan.  Government funding was also reduced as a reaction to the sentiment that the IIT's were contributing to the brain drain.\n\nCampus\n\n \nIIT Kanpur is located on the Grand Trunk Road, 15 km west of Kanpur City and measures close to 420 ha.  This land was donated by the Government of Uttar Pradesh in 1960 and by March 1963 the Institute had moved to its current location.\n\nThe institute has around 6478 students with 3938 undergraduate students and 2540 postgraduate students and about 500 research associates.\n\nNoida Extension centre\n\nIIT Kanpur is to open an extension centre in Noida with the plan of making a small convention centre there for supporting outreach activities. Its foundation was laid on 4 December 2012 on 5 acres of land allocated by Uttar Pradesh state government in the [https://maps.google.co.in/maps?qsector+62+noida&hl\nen&ll28.621634,77.367697&spn\n0.031606,0.066047&sll26.629195,73.873558&sspn\n16.435889,33.815918&tm&hnear\nSector+62,+Noida,+Gautam+Buddh+Nagar,+Uttar+Pradesh&z=15sector-62 sector-62] of Noida city, which is less than an hour`s journey from New Delhi and the Indira Gandhi International Airport. The cost of construction is estimated to be about 25 crores. The new campus will have an auditorium, seminar halls for organising national and international conferences and an International Relations Office along with a 7-storey guest house. Several short-term management courses and refresher courses meant for distance learning will be available at the extension center.[https://web.archive.org/web/20140202100045/http://www.iitk.ac.in/drpg/social_media/Greeting_2012.htm News from]. IITK. Retrieved on 9 October 2013.\n\nHelicopter service\n\nBeing a major industrial town, Kanpur has a good connectivity by rail and by road but it lags in terms of air connectivity. IIT Kanpur was suffering significantly in comparison to IIT Delhi and IIT Bombay due to this reason as far as visiting companies and other dignitaries are concerned\nOn 1 June 2013, a helicopter ferry service was started at IIT Kanpur run by Pawan Hans Helicopters Limited. In its initial run the service connects IIT Kanpur to Lucknow, but it is planned to later extend it to New Delhi. Currently  there are two flights daily to and from Lucknow Airport with a duration of 25 minutes. Lucknow Airport operates both international and domestic flights to major cities. IIT Kanpur is the first academic institution in the country to provide such a service.\nhttp://spo.iitk.ac.in/reach_us.html The estimated charges are Rs. 6000 (USD $100) per person. If anyone would like to avail the facility he/she have to contact Student Placement Office (SPO) at IIT Kanpur, since the helicopter service is subject to availability of chopper rights. The campus also has airstrips which allows flight workshops and joyrides for students.\n\nNew York Office\n\nThe Institute has set up an office in New York with alumnus, Sanjiv Khosla designated as the overseas brand ambassador of the institute. It is located on 62, William Street, Manhattan. The office aims to hunt for qualified and capable faculty abroad, facilitate internship opportunities in North American universities and be conduit for research tie ups with various US universitieshttps://nyc.iitk.ac.in/. The New York Office also tries to amass funds through the alumni based there. A system that invites students and faculty of foreign institutes to IIT Kanpur is also being formulated.http://timesofindia.indiatimes.com/home/education/news/IIT-Kanpur-opens-office-in-New-York/articleshow/22939102.cms\n\nAdmissions\n\nUndergraduate admissions until 2012 were being done through the national-level Indian Institute of Technology Joint Entrance Examination (IIT-JEE). Following the Ministry of Human Resource Development's decision to replace IIT-JEE with a common engineering entrance examination, IIT Kanpur's admissions are now based on JEE (Joint Entrance Examination) -Advanced level along with other IITs.\n\nPostgraduate admissions are made through the Graduate Aptitude Test in Engineering.\n\nStudent life\n\nNational events\n\n*Antaragni:  Antaragni is a non-profit organisation run by the students of IIT Kanpur. It was funded entirely by the Student Gymkhana of the university it began.  Today the budget is almost Rs 1 crore, raised through sponsorship. It began as an inter-collegiate cultural event in 1964, and now draws in over 30,000 visitors from 300 colleges in India Annual [culfest|cultural festival] held over 4 days in October. The festival includes music, drama, literary games and quizzing. There is a YouTube channel dedicated to the festival with 1,000+ subscribers.\n*Techkriti: It was started in 1995 with an aim to encourage interest and innovation in technology among students and to provide a platform for industry and academia to interact. Megabucks (a business and entrepreneurship festival) used to be held independently but was merged with Techkriti in 2010. Notable speakers at Techkriti have included APJ Abdul Kalam, Vladimir Voevodsky, Douglas Osheroff, Oliver Smithies, Rakesh Sharma, David Griffiths and Richard Stallman. \n* Udghosh:  Udghosh is an annual inter-college sports meet held in September. UDGHOSH involves students from all over India competing in the university's sports facilities. The festival includes Motivational Talks, Mini Marathon, Gymnastic Shows and Sport Quizzes to various sports events like:\n* Vivekananda Youth Leadership Convention: Vivekananda Samiti, under Students Gymkhana, on behalf of the IIT Kanpur, has undertaken the celebration of 150th Birth Anniversary of Swami Vivekananda from 2011-2015. The convention has included Kiran Bedi, Bana Singh, Yogendra Singh Yadav, Raju Narayana Swamy, Arunima Sinha, Rajendra Singh and other personalities from different fields in previous years.\n* E-summit: It started in 2013. The first E-Summit was scheduled for 16-18 Aug, 2013. These three day festival by Entrepreneurship Cell, IIT Kanpur on the theme Emerge on the Radar included talks by eminent personalities, workshops and competitions.\n\nStudents' Gymkhana\n\nThe Students' Gymkhana is the students' government organization of IIT Kanpur, established in 1962.[http://students.iitk.ac.in/gymkhana/ Home | Students' Gymkhana, IIT Kanpur]\n\nThe Students' Gymkhana functions mainly through the Students' Senate, an elected student representative body composed of Senators elected from each batch and the five elected executives:\n* President, Students' Gymkhana.\n* General Secretary Cultural Council.\n* General Secretary Films and Media Council.\n* General Secretary Games and Sports Council.\n* General Secretary Science and Technology Council.\n\nThe number of Senators in the Students' Senate is around 50-55. A senator is elected for every 100 students of IIT Kanpur.\n\nThe meetings of the Students' Senate are chaired by the Convener, Students' Senate, who is elected by the Senate.\nThe Senate lays down the guidelines for the functions of the executives, their associated councils, the Gymkhana Festivals and other matters pertaining to the Student body at large.\n\nThe Students' Senate has a say in the policy and decision making bodies of the institute. The President, Students' Gymkhana and the Convener, Students' Senate are special Invitees to the Institute Academic Senate. The President is usually invited to the meetings of the Board of Governors when matters affecting students are being discussed. Nominees of the Students' Senate are also members of the various standing Committees of the Institute Senate including the disciplinary committee, the Undergraduate and Postgraduate committee, the scholarship committee etc. All academic departments have Departmental Undergraduate and Post Graduate Committees consisting of members of the faculty and nominees of the Students' Gymkhana.\n\nRankings\n\nInternationally, IIT Kanpur was ranked 293 in QS World University Rankings for 2018. The same rankings ranked it 59 in Asia and 21 among BRICS nations. The Times Higher Education World University Rankings ranked it 501-600 globally in the 2018 ranking 63 in Asia and 32 among BRICS & Emerging Economies University Rankings 2017.\n\nIn India, among engineering colleges, it ranked third by India Today in 2017, fourth in India by Outlook India and fifth by The Week. It was ranked fifth among engineering collecges in India by the National Institutional Ranking Framework (NIRF) in 2017, and seventh overall.\n\nThe Department of Industrial and Management Engineering was ranked 11 among management schools in India by NIRF in 2017.\n\nAcademic bodies and activities\n\nIIT Kanpur offers various courses on management and social sciences.\n\nUndergraduate\n\nIIT Kanpur offers four-year B.Tech programs in Aerospace Engineering, Biological Sciences and Bio-engineering, Chemical Engineering, Civil Engineering, Computer Science and Engineering, Electrical Engineering, Materials Science and Engineering and Mechanical Engineering. The admission to these programs is procured through Joint Entrance Examination. IITK offers admission only to bachelor's degree now (discontinuing the integrated course programs), but it can be extended by 1 year to make it integrated, depending on the choice of student and based on his/her performance there at undergraduate level. IIT Kanpur also offers four-year B.S. Programs in Pure and Applied Sciences (Mathematics, Physics and Chemistry in particular), Earth Science and Economics.\n\nNew academic system\n\nFrom 2011, IIT Kanpur has started offering a four-year BS program in sciences and has kept its B.Tech Program intact. Entry to the five-year M.Tech/MBA programs and Dual degree programme will be done based on the CPI of students instead of JEE rank.[http://www.iitk.ac.in/doaa/faqs.pdf FAQ on the new academic curriculum]  In order to reduce the number of student exams, IIT Kanpur has also abolished the earlier system of conducting two mid-term examinations. Instead, only two examinations (plus two quizzes in most courses depending on the instructor-in-charge, one before mid-semesters and the other after the mid-semesters and before the end-semesters examination), one between the semester and other towards the end of it would be held from the academic session starting July 2011 onward as per Academic Review Committee's recommendations.\n\nPostgraduate\n\nPostgraduate courses in Engineering offer Master of Technology (M.Tech), MS (R) and Ph.D. degrees. The institute also offers two tier M.Sc. courses in areas of basic sciences in which students are admitted through Joint Admission Test for M.Sc.(JAM) exam. The institute also offers M.Des. (2 years), M.B.A. (2 years) and  M.Sc. (2 years) degrees. Admissions to M. Tech is made once a year through Graduate Aptitude Test in Engineering. Admissions to M. Des are made once a year through both Graduate Aptitude Test in Engineering(GATE) and Common Entrance Exam for Design(CEED). Until 2011, admissions to the M.B.A. program were accomplished through the Joint Management Entrance Test (JMET), held yearly, and followed by a Group Discussion/Personal Interview process. In 2011, JMET was replaced by Common Admission Test (CAT).http://www.iitk.ac.in/design/apply.html\n\nDepartments\n\nThe academic departments at IIT Kanpur are:\n\nLaboratories and other facilities\n\nThe campus is spread over an area of . Facilities include the National Wind Tunnel Facility. Other large research centres include the Advanced Centre for Material Science, a Bio-technology centre, the Advanced Centre for Electronic Systems, and the Samtel Centre for Display Technology, Centre for Mechatronics, Centre for Laser Technology, Prabhu Goel Research Centre for Computer and Internet Security, Facility for Ecological and Analytical Testing. The departments have their own libraries.\n\nThe institute has its own airfield, for flight testing and gliding.\n\nPK Kelkar Library (formerly Central Library) is an academic library of the institute with a collection of more than 300,000 volumes, and subscriptions to more than 1,000 periodicals. The library was renamed to its present name in 2003 after Dr. P K Kelkar, the first director of the institute. It is housed in a three-story building, with a total floor area of 6973 square metres.  The Abstracting and Indexing periodicals, Microform and CD-ROM databases, technical reports, Standards and thesis are in the library. Each year, about 4,500 books and journal volumes are added to the library.\n\nThe New Core Labs (NCL) is 3 storey building with state of the art physics and chemistry laboratories for courses in the first year. The New Core Labs also has Linux and Windows computer labs for the use of first year courses and a Mathematics department laboratory housing machines with high computing power.\n\nIIT Kanpur has set up the SIDBI Innovation and Incubation Centre(SIIC) in collaboration with the Small Industries development Bank of India (SIDBI) aiming to aid innovation, research, and entrepreneurial activities in technology-based areas. SIIC helps business Start-ups to develop their ideas into commercially viable products.\n\nA team of students, working under the guidance of faculty members of the institute and scientists of Indian Space Research Organisation (ISRO) have designed and built India's first nano satellite Jugnu, which was successfully launched in orbit on 12 Oct 2011 by ISRO's PSLV-C18.The Economic Times \"[http://articles.economictimes.indiatimes.com/2011-10-25/news/30320349_1_nano-satellite-jugnu-iit-kanpur Nano satellite 'Jugnu' launch by IIT-Kanpur marks watershed in Indian space technology]\". Dated  25 October 2011 \n\nComputer Centre\n\nThe Computer Centre is one of the advanced computing service centre among academic institution in India. IT hosts IIT Kanpur website and provides personal web space for students and faculties.  It also provides a spam filtered email server and high speed fibre optic Internet to all the hostels and the academics. Users have multiple options to choose among various interfaces to access mail service.  It has Linux and windows laboratories equipped with dozens of high-end software like MATLAB, Autocad, Ansys, Abaqus etc. for use of students. Apart from departmental computer labs, computer centre hosts more than 300 Linux terminals and more than 100 Windows terminals and is continuously available to the students for academic work and recreation. Computer centre has recently adopted an open source software policy for its infrastructure and computing. Various high-end compute and GPU servers are remotely available from data centre for user computation.\n\nComputer centre has multiple super computing clusters for research and teaching activity. In June 2014 IIT Kanpur launched their 2nd supercomputer which is India’s 5thhttp://timesofindia.indiatimes.com/city/kanpur/IIT-Kanpur-unveils-its-second-supercomputer/articleshow/36037756.cms most powerful supercomputer as of now. The new supercomputer 'Cluster Platform SL230s Gen8' manufactured by Hewlett-Packard has 15,360 cores and a theoretical peak (Rpeak) 307.2 TFlop/s and is the world's 192th most powerful supercomputer as of June 2015.http://top500.org/list/2015/06/?page=2\n\nStudents' research related activity\n\nResearch is controlled by the Office of the Dean of Research and Development. Under the aegis of the Office the students publish the quarterly NERD Magazine (Notes on Engineering Research and Development) which publishes scientific and technical content created by students. Articles may be original work done by students in the form of hobby projects, term projects, internships, or theses. Articles of general interest which are informative but do not reflect original work are also accepted.\n\nAlong with the magazine a student research organisation,  PoWER (Promotion of Work Experience and Research) has been started. Under it several independent student groups are working on projects like the Lunar Rover for ISRO, alternate energy solutions under the Group for Environment and Energy Engineering, ICT solutions through a group Young Engineers, solution for diabetes, green community solutions through ideas like zero water and zero waste quality air approach. Through BRaIN (Biological Research and Innovation Network) students interested in solving biological problems get involved in research projects like  genetically modifying fruit flies to study molecular systems and developing bio-sensors to detect alcohol levels. A budget of Rs 1.5 to 2 crore has been envisaged to support student projects that demonstrate technology.\n\n* Jugnu\nThe students of IIT Kanpur made a nano satellite called Jugnu, which was given by president Pratibha Patil to ISRO for launch. Jugnu is a remote sensing satellite which will be operated by the Indian Institute of Technology Kanpur. It is a nanosatellite which will be used to provide data for agriculture and disaster monitoring. It is a 3-kilogram (6.6 lb) spacecraft, which measures 34 centimetres (13 in) in length by 10 centimetres (3.9 in) in height and width. Its development programme cost around 25 million rupees. It has a design life of one year.\nJugnu's primary instrument is the Micro Imaging System, a near infrared camera which will be used to observe vegetation. It also carries a GPS receiver to aid tracking, and is intended to demonstrate a microelectromechanical inertial measurement unit.\n\n*IITK Motorsports\nIITK motorsports is the biggest and most comprehensive student initiative of the college, founded in January 2011. It is a group of students from varied disciplines who aim at designing and fabricating a Formula-style race car for international Formula SAE\n(Society of Automotive Engineers) events. Most of the components of the car, except the engine, tyres and wheel rims, are designed and manufactured by the team members themselves. The car is designed to provide maximum performance under the constraints of the event, while ensuring the driveability, reliability, driver safety and aesthetics of the car are not compromised.\n\nThe institute is part of the European Research and Education Collaboration with Asia (EURECA) programme since 2008.\n\nNotable alumni\n\n \n\n* Manindra Agrawal, Nitin Saxena, and Neeraj Kayal (proved with their AKS primality test that primality testing has a polynomial time algorithm.) Clay Research Award, 2002, Godel Prize, 2006[http://mangalorean.com/news.php?newstypebroadcast&broadcastid\n93282 \"Bangalore: IIT-Kanpur professor bags first Infosys Mathematics Prize\"], 16 September. 2008\n* Rakesh Agrawal, National Medal of Technology and Innovation Laureate and Professor of Chemical Engineering at Purdue University\n* Anand Kumar Bachhawat, biochemist, N-Bios laureate\n* P. Balram, Director of IISC Bangalore and winner of Padma Bhushan\n* Upinder Singh Bhalla, Neuroscientist, Shanti Swarup Bhatnagar laureate\n* Suresh Kumar Bhatia - chemical engineer, academic, Shanti Swarup Bhatnagar laureate\n* Jagjeet (Jeet) S. Bindra, director at Edison International\n* Narayanan Chandrakumar, chemical physicist, Shanti Swarup Bhatnagar laureate\n* Tushar Kanti Chakraborty, organic chemist, Shanti Swarup Bhatnagar laureate\n* Sumit Chowdhury, CEO & Founder at Gaia Smart Cities, Ex President at Reliance Jio Infocomm Ltd.\n* Atish Dabholkar, String theorist, Shanti Swarup Bhatnagar laureate\n* Sirshendu De, a recipient of 2011 Shanti Swarup Bhatnagar Award and professor of chemical engineering department, IIT Kharagpur\n* Avinash Deshpande - astrophysicist, Shanti Swarup Bhatnagar laureate\n* Deepak Dhar - theoretical physicist, Shanti Swarup Bhatnagar laureate\n* Satyendra Dubey, a Project Director in National Highways Authority of India who was assassinated  for exposing corruption in the Golden Quadrilateral highway project.\n* Rajit Gadh, Professor of Engineering, Director of UCLA Smart Grid Energy Research Center, and a pioneer of Smart Grids\"\n* Pradyut Ghosh, inorganic chemist, Shanti Swarup Bhatnagar laureate\n* Balasubramanian Gopal, Molecular biophysicist, Shanti Swarup Bhatnagar laureate\n* Umang Gupta, Chairman of the Board and Chief Executive Officer of Keynote Systems, Inc.\n* Jainendra K. Jain, condensed matter theorist\n*Lalit Jalan, CEO of Reliance Infrastructure Limited is a winner of Directors Honours and Deans List at Wharton.  He was also showcased as one of the 15 achievers from the IIT system at the 1st PAN IIT meeting in California in January 2003.\n* Rakesh Jain, distinguished tumor researcher at Harvard Medical School and recent winner of National Medal of Science.\n* Shahid Jameel - virologist, Shanti Swarup Bhatnagar laureate\n* Ashok Jhunjhunwala, Padma Shri and Professor, Department of Electrical Engineering, IIT Madras\n* Varun Khaitan - Co-Founder at UrbanClap\n* Chandra Kintala, Professor and Director of Software Engineering at New Jersey Institute of Technology; Director(Retd.), Bell Labs, USA\n* G. Ravindra Kumar - laser physicist, Shanti Swarup Bhatnagar laureate\n* Jitendra Malik, Arthur J. Chick Professor of EECS at University of California at Berkeley\n* Ranjan Mallik - communications engineer, Shanti Swarup Bhatnagar laureate\n* Shiraz Minwalla, a string theorist at TIFR who was awarded ICTP Prize for his contribution to theoretical physics\n* Som Mittal,  President of NASSCOM\n* Mahan Mj, mathematician and a recipient of the 2011 Shanti Swarup Bhatnagar Award\n* Debasisa Mohanty, computational biologist, N-Bios laureate\n* Pramod Sadasheo Moharir, geophysicist, Shanti Swarup Bhatnagar laureate\n* Late Rajeev Motwani, computer scientist, Professor of Computer Science at Stanford University\n* N.R. Narayana Murthy, the Founder & Chairman Emeritus of Infosys\n* Muktesh Pant, CEO of KFC.\n* Kapil Hari Paranjape, Mathematician, Shanti Swarup Bhatnagar laureate\n* Prashant Pathak, Canada-based entrepreneur and investor, Chairman of Investment Committee of Business Development Bank of Canada, CEO of Ekagrata Inc.\n* Manu Prakash- Physical Biologist and Inventor, Best known for his Foldscope and Paperfuge\n\n* Prem Das Rai, the first IIT and IIM educated member of Parliament Lok Sabha\n* Arup Kumar Raychaudhuri, condensed matter physicist, Shanti Swarup Bhatnagar laureate\n* Anil K. Rajvanshi,[http://www.iitk.ac.in/dora/anil-rajvanshi-dora] Director, Nimbkar Agricultural Research Institute and winner of Jamnalal Bajaj Award 2001,  FICCI award 2002, Globe Award 2009, 2014 University of Florida Distinguished Alumnus Award winner.[http://www.eng.ufl.edu/news/gator-engineering-honors-distinguished-alumnus-awardees-2/]\n* Ayyalusamy Ramamoorthy, scientist in the area of NMR and biological membranes\n* Suryanarayanasastry Ramasesha, quantum chemist, Shanti Swarup Bhatnagar laureate\n* Sanjay Sarma, professor at MIT, credited with developing standards and technologies in the commercial RFID industry and Director of Digital Learning at MIT.\n* Ashoke Sen, FRS, Padma Shri and Padma Bhushan, string theorist\n* Ram Sewak Sharma, Chairman, Telecom Regulatory Authority of India (TRAI)\n* Pradeep Sindhu, co-founder and Chief Technical Officer/Vice Chairman of the Board of Directors of Juniper Networks Inc.\n* B. N. Singh, Chairman of ICTACEM, Professor & Dean HR(Human Resource), IIT Kharagpur\n* Sudeshna Sinha, Fellow of World Academy of Sciences (TWAS), Indian Academy of Sciences, Indian National Science Academy\n* Duvvuri Subbarao, 22nd Governor of Reserve Bank of India\n* Mriganka Sur,  neuroscientist, Sherman Fairchild Professor of Neuroscience, Head, Dept of Brain and Cognitive Science MIT, Fellow of Royal Society\n* Amitabh Thakur, an officer of the Indian Police Service, social activist, writer\n* Muralee Thummarukudy- Chief Disaster Risk Reduction at United Nations Environment Programme\n* Sandip Trivedi, theoretical physicist working at Tata Institute for Fundamental Research TIFR,  recipient of the Infosys Prize 2010 in the category of Physical Sciences {http://www.infosys-science-foundation.com/prize/laureates/2010/sandip-trivedi.asp}\n* Vijay Vaishnavi , researcher and scholar in the computer information systems field\n* Raghavan Varadarajan, Biophysicist, Shanti Swarup Bhatnagar laureate\n* K. VijayRaghavan (Director of National Centre for Biological Sciences), Padma Shri - 2003 IITK Distinguished Alumnus Award Winner\n* Spenta R. Wadia, theoretical physicist working in string theory and quantum field theory. Indian Institute of Technology Kanpur. http://en.wikipedia.org/?curid=14894."
  }
}
