{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5431",
  "eid" : "d516a440-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778437252,
  "textBody" : "The politics of Cambodia takes place in a frame work of an elective constitutional monarchy, where by the Prime Minister is the head of government and a Monarch is head of state. The kingdom formally operates according to the nation's constitution (enacted in 1993) in a framework of a parliamentary, representative democracy. Executive power is exercised by Prime Minister, Hun Sen. Legislative power is vested in the two chambers of parliament, the National Assembly and the Senate. The Economist Intelligence Unit has rated Cambodia as \"authoritarian\" in 2017.\n\nExecutive branch\n\n \n\n|King\n|Norodom Sihamoni\n|\n|14 October 2004\n|-\n|Prime Minister\n|Hun Sen\n|CPP\n|14 January 1985\n|}\nThe Prime Minister of Cambodia is a representative from the ruling party of the National Assembly. He or she is appointed by the King on the recommendation of the President and Vice Presidents of the National Assembly.  In order for a person to become Prime Minister, he or she must first be given a vote of confidence by the National Assembly.\n\nThe Prime Minister is officially the Head of Government in Cambodia. Upon entry into office, he or she appoints a Council of Ministers who are responsible to the Prime Minister.  Officially, the Prime Minister's duties include chairing meetings of the Council of Ministers (Cambodia's version of a Cabinet) and appointing and leading a government. The Prime Minister and his government make up Cambodia's executive branch of government.\n\nThe current Prime Minister is Cambodian People's Party (CPP) member Hun Sen. He has held this position since the criticized 1998 election, one year after the CPP staged a bloody coup in Phnom Penhhttp://cambodia.ohchr.org/Documents/Statements%20and%20Speeches/English/40.pdfhttp://www.hri.org/docs/statedep/1997/97-07-08.std.html to overthrow elected Prime Minister Prince Norodom Ranariddh, president of the FUNCINPEC party. Hun Sen has vowed to rule until he is 74. Hun Sen is a former Khmer Rouge member who defected and oversaw Cambodia's rise from the ashes of war. His government is regularly accused of ignoring human rights and suppressing political dissent. After the 2013 election results, disputed by Hun Sen's opposition, demonstrators were injured and killed in Cambodia in protests in the capital where a reported 20,000 protesters gathered, some clashing with riot police.http://www.channelnewsasia.com/news/asiapacific/cambodia-protest-clashes/814406.html Retrieved September-16-2013 From a humble farming background, Hun Sen was just 33 when he took power in 1985 and is now in the company of enduring leaders such as Zimbabwe's Robert Mugabe and Kazakhstan's Nursultan Nazarbayev.https://www.reuters.com/article/2013/09/18/us-cambodia-hunsen-analysis-idUSBRE98H04K20130918 Retrieved September-19-2013\n\nCouncil of Ministers\n\nLegislative branch\n\nThe legislative branch of the Cambodian government is made up of a bicameral parliament.\n\n* The National Assembly (Radhsaphea) has 123 members, elected for a five-year term by proportional representation.\n* The Senate (Protsaphea) has 61 members.  Two of these members are appointed by the King, two are elected by the lower house of the government, and the remaining fifty-seven are elected popularly by \"functional constituencies.\"  Members in this house serve a six-year term.\n\nThe official duty of the Parliament is to legislate and make laws.  Bills passed by the Parliament are given to the King who gives the proposed bills royal assent.  The King does not have veto power over bills passed by the National Assembly and thus, cannot withhold royal assent.  The National Assembly also has the power to dismiss the Prime Minister and his government by a two-thirds vote of no confidence.\n\nSenate\n\nThe upper house of the Cambodian legislature is called the Senate. It consists of sixty-one members.  Two of these members are appointed by the King, two are elected by the lower house of the government, and the remaining fifty-seven are elected popularly by electors from provincial and local governments, in a similar fashion to the Senate of France. Members in this house serve six-year terms.\n\nPrior to 2006, elections had last been held for the Senate in 1999. New elections were supposed to have occurred in 2004, but these elections were initially postponed. On January 22, 2006, 11,352 possible voters went to the poll and chose their candidates. This election was criticized by local monitoring non-governmental organizations as being undemocratic.http://news.bbc.co.uk/2/hi/asia-pacific/4638406.stm\n\n, the Cambodian People's Party holds forty-three seats in the Senate, constituting a significant majority. The two other major parties holding seats in the Senate are the Funcinpec party (holding twelve seats) and the Sam Rainsy Party (holding two seats).\n\nNational Assembly\n\nThe lower house of the legislature is called the National Assembly.  It is made up of 123 members, elected by popular vote to serve a five-year term.  Elections were last held for the National Assembly in July 2013.\n\nIn order to vote in legislative elections, one must be at least eighteen years of age. However, in order to be elected to the Legislature, one must be at least twenty-five years of age.\n\nThe National Assembly is led by a President and two Vice Presidents who are selected by Assembly members prior to each session.\n\n, the Cambodian People's Party holds a majority of the seats in the National Assembly, controlling 68 out of the 123 seats. The Cambodia National Rescue Party holds the remaining 55 seats.\n\nPolitical parties and elections\n\n* In addition to the general election, the King and National Assembly each choose two Senators, bringing the total to 61 members.\n\nJudicial branch\n\nThe judicial branch is independent from the rest of the government, as specified by the Cambodian Constitution. The highest court of judicial branch is the Supreme Council of the Magistracy. Other, lower courts also exist. Until 1997, Cambodia did not have a judicial branch of government despite the nation's Constitution requiring one.\n\nThe main duties of the judiciary are to prosecute criminals, settle lawsuits, and, most importantly, protect the freedoms and rights of Cambodian citizens. However, in reality, the judicial branch in Cambodia is highly corrupt and often serves as a tool of the executive branch to silence civil society and its leaders.http://hrw.org/english/docs/2006/01/18/cambod12269.htm There are currently 17 justices on the Supreme Council.\n\nMonarchy\n\nCambodia is a constitutional monarchy, i.e. the King reigns but does not rule, in similar fashion to Queen Elizabeth II of the United Kingdom. The King is officially the Head of State and is the symbol of unity and \"perpetuity\" of the nation, as defined by Cambodia's constitution.\n\nFrom September 24, 1993 through October 7, 2004, Norodom Sihanouk reigned as King, after having previously served in a number of offices (including King) since 1941. Under the Constitution, the King has no political power, but as Norodom Sihanouk was revered in the country, his word often carried much influence in the government.  While such views are not prevalent in Cambodia, his word was respected by his subjects. The King, often irritated over the conflicts in his government, several times threatened to abdicate unless the political factions in the government got along. This put pressure on the government to solve their differences.  This influence of the King was often used to help mediate differences in government.\n\nAfter the abdication of King Norodom Sihanouk in 2004, he was succeeded by his son Norodom Sihamoni. While the retired King was highly revered in his country for dedicating his lifetime to Cambodia, the current King has spent most of his life abroad in France. Thus, it remains to be seen whether the new King's views will be as highly respected as his father's.\n\nAlthough in the Khmer language there are many words meaning \"king\", the word officially used in Khmer (as found in the 1993 Cambodian Constitution) is preahmâhaksat (Khmer regular script:), which literally means: preah- (\"sacred\", cognate of the Indian word Brahmin) -mâha- (from Sanskrit, meaning \"great\", cognate with \"maha-\" in maharaja) -ksat (\"warrior, ruler\", cognate of the Indian word Kshatriya).\n\nOn the occasion of HM King Norodom Sihanouk's retirement in September 2004, the Cambodian National Assembly coined a new word for the retired king: preahmâhaviraksat (Khmer regular script:), where vira comes from Sanskrit vīra, meaning \"brave or eminent man, hero, chief\", cognate of Latin vir, viris, English virile. Preahmâhaviraksat is translated in English as \"King-Father\" (), although the word \"father\" does not appear in the Khmer noun.\n\nAs preahmâhaviraksat, Norodom Sihanouk retained many of the prerogatives he formerly held as preahmâhaksat and was a highly respected and listened-to figure. Thus, in effect, Cambodia could be described as a country with two Kings during Sihanouk's lifetime: the one who was the Head of State, the preahmâhaksat Norodom Sihamoni, and the one who was not the Head of State, the preahmâhaviraksat Norodom Sihanouk.\n\nSihanouk died of a pulmonary infarction on October 15, 2012.\n\nSuccession to the throne\n\nUnlike most monarchies, Cambodia's monarchy is not necessarily hereditary and the King is not allowed to select his own heir.  Instead, a new King is chosen by a Royal Council of the Throne, consisting of the president of the National Assembly, the Prime Minister, the President of the Senate, the First and Second Vice Presidents of the Senate, the Chiefs of the orders of Mohanikay and Thammayut, and the First and Second Vice-President of the Assembly.  The Royal Council meets within a week of the King's death or abdication and selects a new King from a pool of candidates with royal blood.\n\nIt has been suggested that Cambodia's ability to peacefully appoint a new King shows that Cambodia's government has stabilized incredibly from the situation the country was in during the 1970s (see History of Cambodia).\n\nInternational organization participation\n\nACCT, AsDB, ASEAN, ESCAP, FAO, G-77, IAEA, IBRD, ICAO, ICC, ICRM, IDA, IFAD, IFC, IFRCS, ILO, IMF, IMO, Intelsat (nonsignatory user), International Monetary Fund, Interpol, IOC, ISO (subscriber), ITU, NAM, OPCW, PCA, UN, UNCTAD, UNESCO, UNIDO, UPU, WB, WFTU, WHO, WIPO, WMO, WTO, WToO, WTrO (applicant)\n\nInternational rankings \n\nProvincial and local governments\n\nBelow the central government are 24 provincial and municipal administration.Private Solutions for Infrastructure in Cambodia: A Country Framework Report. World Bank (2002), [https://books.google.com/books?id\nktRy_5sKrGEC&pgPA65 p65]. . (In rural areas, first-level administrative divisions are called provinces; in urban areas, they are called municipalities.)  The administrations are a part of the Ministry of the Interior and their members are appointed by the central government. Provincial and municipal administrations participate in the creation of nation budget; they also issue land titles and license businesses.\n\nSince 2002, commune-level governments (commune councils) have been composed of members directly elected by commune residents every five years.[http://www.embassyofcambodia.org.nz/March2007/March2007-3.htm Untitled Document]\n\nIn practice, the allocation of responsibilities between various levels of government is uncertain.  This uncertainty has created additional opportunities for corruption and increased costs for investors.\n\nResources",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Politics of Cambodia" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5431" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The politics of Cambodia takes place in a frame work of an elective constitutional monarchy, where by the Prime Minister is the head of government and a Monarch is head of state. The kingdom formally operates according to the nation's constitution (enacted in 1993) in a framework of a parliamentary, representative democracy. Executive power is exercised by Prime Minister, Hun Sen. Legislative power is vested in the two chambers of parliament, the National Assembly and the Senate. The Economist Intelligence Unit has rated Cambodia as \"authoritarian\" in 2017.\n\nExecutive branch\n\n \n\n|King\n|Norodom Sihamoni\n|\n|14 October 2004\n|-\n|Prime Minister\n|Hun Sen\n|CPP\n|14 January 1985\n|}\nThe Prime Minister of Cambodia is a representative from the ruling party of the National Assembly. He or she is appointed by the King on the recommendation of the President and Vice Presidents of the National Assembly.  In order for a person to become Prime Minister, he or she must first be given a vote of confidence by the National Assembly.\n\nThe Prime Minister is officially the Head of Government in Cambodia. Upon entry into office, he or she appoints a Council of Ministers who are responsible to the Prime Minister.  Officially, the Prime Minister's duties include chairing meetings of the Council of Ministers (Cambodia's version of a Cabinet) and appointing and leading a government. The Prime Minister and his government make up Cambodia's executive branch of government.\n\nThe current Prime Minister is Cambodian People's Party (CPP) member Hun Sen. He has held this position since the criticized 1998 election, one year after the CPP staged a bloody coup in Phnom Penhhttp://cambodia.ohchr.org/Documents/Statements%20and%20Speeches/English/40.pdfhttp://www.hri.org/docs/statedep/1997/97-07-08.std.html to overthrow elected Prime Minister Prince Norodom Ranariddh, president of the FUNCINPEC party. Hun Sen has vowed to rule until he is 74. Hun Sen is a former Khmer Rouge member who defected and oversaw Cambodia's rise from the ashes of war. His government is regularly accused of ignoring human rights and suppressing political dissent. After the 2013 election results, disputed by Hun Sen's opposition, demonstrators were injured and killed in Cambodia in protests in the capital where a reported 20,000 protesters gathered, some clashing with riot police.http://www.channelnewsasia.com/news/asiapacific/cambodia-protest-clashes/814406.html Retrieved September-16-2013 From a humble farming background, Hun Sen was just 33 when he took power in 1985 and is now in the company of enduring leaders such as Zimbabwe's Robert Mugabe and Kazakhstan's Nursultan Nazarbayev.https://www.reuters.com/article/2013/09/18/us-cambodia-hunsen-analysis-idUSBRE98H04K20130918 Retrieved September-19-2013\n\nCouncil of Ministers\n\nLegislative branch\n\nThe legislative branch of the Cambodian government is made up of a bicameral parliament.\n\n* The National Assembly (Radhsaphea) has 123 members, elected for a five-year term by proportional representation.\n* The Senate (Protsaphea) has 61 members.  Two of these members are appointed by the King, two are elected by the lower house of the government, and the remaining fifty-seven are elected popularly by \"functional constituencies.\"  Members in this house serve a six-year term.\n\nThe official duty of the Parliament is to legislate and make laws.  Bills passed by the Parliament are given to the King who gives the proposed bills royal assent.  The King does not have veto power over bills passed by the National Assembly and thus, cannot withhold royal assent.  The National Assembly also has the power to dismiss the Prime Minister and his government by a two-thirds vote of no confidence.\n\nSenate\n\nThe upper house of the Cambodian legislature is called the Senate. It consists of sixty-one members.  Two of these members are appointed by the King, two are elected by the lower house of the government, and the remaining fifty-seven are elected popularly by electors from provincial and local governments, in a similar fashion to the Senate of France. Members in this house serve six-year terms.\n\nPrior to 2006, elections had last been held for the Senate in 1999. New elections were supposed to have occurred in 2004, but these elections were initially postponed. On January 22, 2006, 11,352 possible voters went to the poll and chose their candidates. This election was criticized by local monitoring non-governmental organizations as being undemocratic.http://news.bbc.co.uk/2/hi/asia-pacific/4638406.stm\n\n, the Cambodian People's Party holds forty-three seats in the Senate, constituting a significant majority. The two other major parties holding seats in the Senate are the Funcinpec party (holding twelve seats) and the Sam Rainsy Party (holding two seats).\n\nNational Assembly\n\nThe lower house of the legislature is called the National Assembly.  It is made up of 123 members, elected by popular vote to serve a five-year term.  Elections were last held for the National Assembly in July 2013.\n\nIn order to vote in legislative elections, one must be at least eighteen years of age. However, in order to be elected to the Legislature, one must be at least twenty-five years of age.\n\nThe National Assembly is led by a President and two Vice Presidents who are selected by Assembly members prior to each session.\n\n, the Cambodian People's Party holds a majority of the seats in the National Assembly, controlling 68 out of the 123 seats. The Cambodia National Rescue Party holds the remaining 55 seats.\n\nPolitical parties and elections\n\n* In addition to the general election, the King and National Assembly each choose two Senators, bringing the total to 61 members.\n\nJudicial branch\n\nThe judicial branch is independent from the rest of the government, as specified by the Cambodian Constitution. The highest court of judicial branch is the Supreme Council of the Magistracy. Other, lower courts also exist. Until 1997, Cambodia did not have a judicial branch of government despite the nation's Constitution requiring one.\n\nThe main duties of the judiciary are to prosecute criminals, settle lawsuits, and, most importantly, protect the freedoms and rights of Cambodian citizens. However, in reality, the judicial branch in Cambodia is highly corrupt and often serves as a tool of the executive branch to silence civil society and its leaders.http://hrw.org/english/docs/2006/01/18/cambod12269.htm There are currently 17 justices on the Supreme Council.\n\nMonarchy\n\nCambodia is a constitutional monarchy, i.e. the King reigns but does not rule, in similar fashion to Queen Elizabeth II of the United Kingdom. The King is officially the Head of State and is the symbol of unity and \"perpetuity\" of the nation, as defined by Cambodia's constitution.\n\nFrom September 24, 1993 through October 7, 2004, Norodom Sihanouk reigned as King, after having previously served in a number of offices (including King) since 1941. Under the Constitution, the King has no political power, but as Norodom Sihanouk was revered in the country, his word often carried much influence in the government.  While such views are not prevalent in Cambodia, his word was respected by his subjects. The King, often irritated over the conflicts in his government, several times threatened to abdicate unless the political factions in the government got along. This put pressure on the government to solve their differences.  This influence of the King was often used to help mediate differences in government.\n\nAfter the abdication of King Norodom Sihanouk in 2004, he was succeeded by his son Norodom Sihamoni. While the retired King was highly revered in his country for dedicating his lifetime to Cambodia, the current King has spent most of his life abroad in France. Thus, it remains to be seen whether the new King's views will be as highly respected as his father's.\n\nAlthough in the Khmer language there are many words meaning \"king\", the word officially used in Khmer (as found in the 1993 Cambodian Constitution) is preahmâhaksat (Khmer regular script:), which literally means: preah- (\"sacred\", cognate of the Indian word Brahmin) -mâha- (from Sanskrit, meaning \"great\", cognate with \"maha-\" in maharaja) -ksat (\"warrior, ruler\", cognate of the Indian word Kshatriya).\n\nOn the occasion of HM King Norodom Sihanouk's retirement in September 2004, the Cambodian National Assembly coined a new word for the retired king: preahmâhaviraksat (Khmer regular script:), where vira comes from Sanskrit vīra, meaning \"brave or eminent man, hero, chief\", cognate of Latin vir, viris, English virile. Preahmâhaviraksat is translated in English as \"King-Father\" (), although the word \"father\" does not appear in the Khmer noun.\n\nAs preahmâhaviraksat, Norodom Sihanouk retained many of the prerogatives he formerly held as preahmâhaksat and was a highly respected and listened-to figure. Thus, in effect, Cambodia could be described as a country with two Kings during Sihanouk's lifetime: the one who was the Head of State, the preahmâhaksat Norodom Sihamoni, and the one who was not the Head of State, the preahmâhaviraksat Norodom Sihanouk.\n\nSihanouk died of a pulmonary infarction on October 15, 2012.\n\nSuccession to the throne\n\nUnlike most monarchies, Cambodia's monarchy is not necessarily hereditary and the King is not allowed to select his own heir.  Instead, a new King is chosen by a Royal Council of the Throne, consisting of the president of the National Assembly, the Prime Minister, the President of the Senate, the First and Second Vice Presidents of the Senate, the Chiefs of the orders of Mohanikay and Thammayut, and the First and Second Vice-President of the Assembly.  The Royal Council meets within a week of the King's death or abdication and selects a new King from a pool of candidates with royal blood.\n\nIt has been suggested that Cambodia's ability to peacefully appoint a new King shows that Cambodia's government has stabilized incredibly from the situation the country was in during the 1970s (see History of Cambodia).\n\nInternational organization participation\n\nACCT, AsDB, ASEAN, ESCAP, FAO, G-77, IAEA, IBRD, ICAO, ICC, ICRM, IDA, IFAD, IFC, IFRCS, ILO, IMF, IMO, Intelsat (nonsignatory user), International Monetary Fund, Interpol, IOC, ISO (subscriber), ITU, NAM, OPCW, PCA, UN, UNCTAD, UNESCO, UNIDO, UPU, WB, WFTU, WHO, WIPO, WMO, WTO, WToO, WTrO (applicant)\n\nInternational rankings \n\nProvincial and local governments\n\nBelow the central government are 24 provincial and municipal administration.Private Solutions for Infrastructure in Cambodia: A Country Framework Report. World Bank (2002), [https://books.google.com/books?id\nktRy_5sKrGEC&pgPA65 p65]. . (In rural areas, first-level administrative divisions are called provinces; in urban areas, they are called municipalities.)  The administrations are a part of the Ministry of the Interior and their members are appointed by the central government. Provincial and municipal administrations participate in the creation of nation budget; they also issue land titles and license businesses.\n\nSince 2002, commune-level governments (commune councils) have been composed of members directly elected by commune residents every five years.[http://www.embassyofcambodia.org.nz/March2007/March2007-3.htm Untitled Document]\n\nIn practice, the allocation of responsibilities between various levels of government is uncertain.  This uncertainty has created additional opportunities for corruption and increased costs for investors.\n\nResources. Politics of Cambodia. http://en.wikipedia.org/?curid=5431."
  }
}
