{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20161",
  "eid" : "40681760-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778617302,
  "textBody" : "A maze is a path or collection of paths, typically from an entrance to a goal.  The word is used to refer both to branching tour puzzles through which the solver must find a route, and to simpler non-branching (\"unicursal\") patterns that lead unambiguously through a convoluted layout to a goal. (The term \"labyrinth\" is generally synonymous, but also can connote specifically a unicursal pattern.)  The pathways and walls in a maze are typically fixed, but puzzles in which the walls and paths can change during the game are also categorised as mazes or tour puzzles.\n\nMaze construction\n\nMazes have been built with walls and rooms, with hedges, turf, corn stalks, hay bales, books, paving stones of contrasting colors or designs, and brick, or in fields of crops such as corn or, indeed, maize. Maize mazes can be very large; they are usually only kept for one growing season, so they can be different every year, and are promoted as seasonal tourist attractions. Indoors, mirror mazes are another form of maze, in which many of the apparent pathways are imaginary routes seen through multiple reflections in mirrors. Another type of maze consists of a set of rooms linked by doors (so a passageway is just another room in this definition). Players enter at one spot, and exit at another, or the idea may be to reach a certain spot in the maze. Mazes can also be printed or drawn on paper to be followed by a pencil or fingertip. Mazes can be built with snow.\n\nGenerating mazes\n\nMaze generation is the act of designing the layout of passages and walls within a maze. There are many different approaches to generating mazes, with various maze generation algorithms for building them, either by hand or automatically by computer.\n\nThere are two main mechanisms used to generate mazes. In \"carving passages\", one marks out the network of available routes. In building a maze by \"adding walls\", one lays out a set of obstructions within an open area. Most mazes drawn on paper are done by drawing the walls, with the spaces in between the markings composing the passages.\n\nSolving mazes\n\nMaze solving is the act of finding a route through the maze from the start to finish. Some maze solving methods are designed to be used inside the maze by a traveler with no prior knowledge of the maze, whereas others are designed to be used by a person or computer program that can see the whole maze at once.\n\nThe mathematician Leonhard Euler was one of the first to analyze plane mazes mathematically, and in doing so made the first significant contributions to the branch of mathematics known as topology.\n\nMazes containing no loops are known as \"standard\", or \"perfect\" mazes, and are equivalent to a tree in graph theory. Thus many maze solving algorithms are closely related to graph theory. Intuitively, if one pulled and stretched out the paths in the maze in the proper way, the result could be made to resemble a tree.[https://www.youtube.com/watch?v=k1tSK5V1pds Maze to Tree] . YouTube (2007-12-23). Retrieved on 2011-06-18.\n\nMazes in psychology experiments\n\nMazes are often used in psychology experiments to study spatial navigation and learning. Such experiments typically use rats or mice. Examples are:\n* Barnes maze\n* Morris water maze\n** Oasis maze\n* Radial arm maze\n* Elevated plus maze\n* T-maze\n\nOther types of mazes\n\n;Ball-in-a-maze puzzles: Dexterity puzzles which involve navigating a ball through a maze or labyrinth.\n\n;Block maze: A maze in which the player must complete or clear the maze pathway by positioning blocks. Blocks may slide into place or be added.\n\n;Hamilton maze: A maze in which the goal is to find the unique Hamiltonian cycle.\n\n;Linear or railroad maze: A maze in which the paths are laid out like a railroad with switches and crossovers.  Solvers are constrained to moving only forward.  Often, a railroad maze will have a single track for entrance and exit.\n\n;Logic mazes: These are like standard mazes except they use rules other than \"don't cross the lines\" to restrict motion.\n\n;Loops and traps maze: A maze that features one-way doors. The doors can lead to the correct path or create traps that divert you from the correct path and lead you to the starting point. The player may not return through a door through which he has entered, so dead ends may be created. The path is a series of loops interrupted by doors. Through the use of reciprocal doors, the correct path can intersect the incorrect path on a single plane. A graphical variant of this maze type is an arrow maze.\n\n;Mazes in higher dimensions: It is possible for a maze to have three or more dimensions. A maze with bridges is three-dimensional, and some natural cave systems are three-dimensional mazes. The computer game Descent uses fully three-dimensional mazes. Any maze can be mapped into a higher dimension without changing its topology.\n\n;Number maze: A maze in which numbers are used to determine jumps that form a pathway, allowing the maze to criss-cross itself many times.\n\n;Picture maze: A standard maze that forms a picture when solved.\n\n;Turf mazes and mizmazes: A pattern like a long rope folded up, without any junctions or crossings.\n\nGallery\n\nFile:Maze Type Standard.png|Standard maze: Find a path from and back to the star.\nFile:Circularmazeexample.jpg|Circular maze type: Find a route to the centre of the maze.\nFile:Maze Type Arrow.png|Loops and traps maze: Follow the arrows from and back to the star\nFile:Maze Type Block.png|Block maze: Fill in four blocks to make a road connecting the stars. No diagonals.\nFile:Maze Type Number.png|Number maze: Begin and end at the star. Using the number in your space, jump that number of blocks in a straight line to a new space. No diagonals.\n\nPublications about mazes\n\nNumerous mazes of different kinds have been drawn, painted, published in books and periodicals, used in advertising, in software, and sold as art. In the 1970s there occurred a publishing \"maze craze\" in which numerous books, and some magazines, were commercially available in nationwide outlets and devoted exclusively to mazes of a complexity that was able to challenge adults as well as children (for whom simple maze puzzles have long been provided both before, during, and since the 1970s \"craze\").\n\nSome of the best-selling books in the 1970s and early 1980s included those produced by Vladimir Koziakin,Mazes, Vladimir Koziakin (Grosset & Dunlap, 1971)  Rick and Glory Brightfield, Dave Phillips, Larry Evans, and Greg Bright.  Koziakin's works were predominantly of the standard two-dimensional \"trace a line between the walls\" variety.  The works of the Brightfields had a similar two-dimensional form but used a variety of graphics-oriented \"path obscuring\" techniques. Although the routing was comparable to or simpler than Koziakin's mazes, the Brightfields' mazes did not allow the various pathway options to be discerned easily by the roving eye as it glanced about.\n\nGreg Bright's works went beyond the standard published forms of the time by including \"weave\" mazes in which illustrated pathways can cross over and under each other. Bright's works also offered examples of extremely complex patterns of routing and optical illusions for the solver to work through.  What Bright termed \"mutually accessible centers\" (The Great Maze Book, 1973) also called \"braid\" mazes, allowed a proliferation of paths flowing in spiral patterns from a central nexus and, rather than relying on \"dead ends\" to hinder progress, instead relied on an overabundance of pathway choices.  Rather than have a single solution to the maze, Bright's routing often offered multiple equally valid routes from start to finish, with no loss of complexity or diminishment of solver difficulties because the result was that it became difficult for a solver to definitively \"rule out\" a particular pathway as unproductive.  Some of Bright's innovative mazes had no \"dead ends\", although some clearly had looping sections (or \"islands\") that would cause careless explorers to keep looping back again and again to pathways they had already travelled.\n\nThe books of Larry Evans focused on 3-D structures, often with realistic perspective and architectural themes, and Bernard Myers (Supermazes No. 1) produced similar illustrations.  Both Greg Bright (The Hole Maze Book) and Dave Phillips (The World's Most Difficult Maze) published maze books in which the sides of pages could be crossed over and in which holes could allow the pathways to cross from one page to another, and one side of a page to the other, thus enhancing the 3-D routing capacity of 2-D printed illustrations.\n\nAdrian Fisher is both the most prolific contemporary author on mazes, and also one of the leading maze designers.  His book The Amazing Book of Mazes (2006) contains examples and photographs of numerous methods of maze construction, several of which have been pioneered by Fisher; The Art of the Maze (Weidenfeld and Nicholson, 1990) contains a substantial history of the subject, whilst Mazes and Labyrinths (Shire Publications, 2004) is a useful introduction to the subject.\n\nA recent book by Galen Wadzinski (The Ultimate Maze Book) offers formalized rules for more recent innovations that involve single-directional pathways, 3-D simulating illustrations, \"key\" and \"ordered stop\" mazes in which items must be collected or visited in particular orders to add to the difficulties of routing (such restrictions on pathway traveling and re-use are important in a printed book in which the limited amount of space on a printed page would otherwise place clear limits on the number of choices and pathways that can be contained within a single maze).  Although these innovations are not all entirely new with Wadzinski, the book marks a significant advancement in published maze puzzles, offering expansions on the traditional puzzles that seem to have been fully informed by various video game innovations and designs, and adds new levels of challenge and complexity in both the design and the goals offered to the puzzle-solver in a printed format.\n\nMazes open to the public\n\nAsia\n\nDubai\n\n* Gardens Shopping Mall, Dubai (world's largest indoor maze)[http://www.ameinfo.com/45024.html Retail Arabia to open French hypermarket Géant in The Gardens Shopping Mall | Nakheel Properties] . AMEinfo.com. Retrieved on 2011-06-18.\n\nJapan\n\n* Hikimi no Meiro,[http://www.iwami.or.jp/hish/kankou/meiro/maze.htm welcome to hikimi town!!] . Iwami.or.jp. Retrieved on 2011-06-18. Kiso, Nagano, Japan\n* Kyodai Meiro Palladium,[http://www.kinugawa.ne.jp/facilities/palladium/palladium.html 巨大迷路パラディアム] . Kinugawa.ne.jp. Retrieved on 2011-06-18. Nikkō, Tochigi, Japan\n* Sendai Hi-Land,[http://www.hi-land.co.jp/ 仙台ハイランド ホームページ] . Hi-land.co.jp. Retrieved on 2011-06-18. Sendai, Miyagi, Japan\n* Shirahama Energy Land,[http://www.royalpines.co.jp/shirahama/ ：：白浜エネルギーランド：： 移転連絡] . Royalpines.co.jp. Retrieved on 2011-06-18. Shirahama, Wakayama, Japan\n\nPacific\n\nNew Zealand\n\n* Amazing Maze n' Maize\n* The Great Maze at Puzzling World\n\nEurope\n\nAustria\n\n* Schönbrunn Palace, Vienna, has a large hedge maze in its gardens.\n\nBelgium\n\n* Loppem Castle maze\n\nDenmark\n\n* Labyrinthia, Silkeborg[http://maps.google.com.au/maps?ll=56.106007,9.576414 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n* Samsø Labyrinten (The world's largest permanent maze, 60.000 m2)[http://www.samsolabyrinten.com/ Samsø Labyrinten – verdens største labyrint] . Samsolabyrinten.com. Retrieved on 2011-06-18.[http://maps.google.com.au/maps?ll=55.971925,10.551124 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n\nGermany\n\n* Hortus Vitalis – Der Irrgarten,[http://www.hortus-vitalis.de Hortus Vitalis – Irrgarten und Erlebniswelt – Ausflugsziel in Bad Salzuflen] . Hortus-vitalis.de. Retrieved on 2011-06-18. Bad Salzuflen (hedge maze)\n\nGreece\n\n* Labyrinth Park near Hersonissos, Crete (extends to approximately 1.300 m2)[http://www.labyrinthpark.gr/en Labyrinth Park] . Retrieved on 2017-04-26.[http://maps.google.com.au/maps?ll=35.2950336,25.357162 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2017-04-26.\n\nItaly\n\n* [http://maps.google.com.au/maps?fq&source\ns_q&hlit&q\n45.39361,7.955593&aq2&sll\n45.39361,7.955593&sspn0.001654,0.0021&ie\nUTF8&th&rq\n1&split0&ev\nzi&ll45.393489,7.955445&spn\n0.001654,0.0021&z=19 Castello di Masino, Caravino 10010, Torino, Italia]\n* , Chiusi, Tuscany (see Pliny's Italian labyrinth)\n* Villa Pisani, Stra, near Venice ()\n* The labyrinth of Franco Maria Ricci at Fontanellato ()\n\nNetherlands\n\n* Waterlabyrinth, Nijmegen, designed by Klaus van de Locht, 1981 ()\n* Doolhof Ruurlo, Ruurlo, designed by Daniel Marot, based on the design for Hampton Court Maze ()\n\nPortugal\n\n* Parque do Arnado,[http://www.pontedelima.com/index.php?optioncom_content&view\narticle&id168:jardins-no-parque-do-arnado&catid\n76:parques-e-jardins&Itemid=170 Jardins no Parque do Arnado] . Ponte de Lima. Retrieved on 2011-06-18. Ponte de Lima, District of Viana do Castelo\n* Parque de São Roque,[http://www.cm-porto.pt/gen.pl?pstories&op\nview&fokeycmp.stories/2383 C.M. Porto] . Cm-porto.pt. Retrieved on 2011-06-18. District of Porto[http://maps.google.com.au/maps?ll\n41.158021,-8.587639 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n* Forest Reserve of Pinhal da Paz,[http://www.azores.gov.pt/Portal/pt/entidades/sraf-drrf/textoImagem/Pinhal+da+Paz.htm Reserva Florestal de Recreio do Pinhal da Paz (São Miguel)] . Azores.gov.pt. Retrieved on 2011-06-18. São Miguel Island, Azores\n\nSpain\n\n* Alcázar of Seville, Seville\n* Corn Laberynth in the Camino de Santiago, León \n* Parc del laberint d'Horta, Barcelona, ()\n* Parc de la Torreblanca, Esplugues de Llobregat ()\n* Parque de El Capricho, Madrid\n* Laberinto de Villapresente, Cantabria. With 5,625qm, it is the largest maze in Spain.\n* Parque de Tentegorra, Murcia\n* Royal Palace of La Granja de San Ildefonso, Segovia ()\n\nUK\n\n* Blake House Craft Centre, Braintree, Essex, England (Open July–September)[http://www.greatmaze.info/maze.html maze] . Greatmaze.info. Retrieved on 2011-06-18.[http://maps.google.com.au/maps?ll=51.881823,0.474719 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n* Carnfunnock Country Park, Northern Ireland. A hedge maze in the shape of Northern Ireland and winner of 1985 Design a Maze competition.\n* Castlewellan, Northern Ireland, world's largest permanent hedge maze[http://www.guinnessworldrecords.com/content_pages/record.asp?recordid47417 Records Search Page] . Guinness World Records. Retrieved on 2011-06-18.[http://maps.google.com.au/maps?ll\n54.258284,-5.953174 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n* Chatsworth House garden maze, planted with 1,209 yews.\n* Cliveden House Originally laid out in 1894 and re-opened to the public in 2011, consisting of 1100 Yew trees\n* Crystal Palace Park, South London. Laid out in the 1870s, this is the largest maze in London.[http://londonist.com/2011/02/londons-labyrinths-and-mazes/ London's Labyrinths and Mazes]  Londonist. Retrieved on 2016-11-20.\n*Glendurgan Garden, Cornwall.  A cherry laurel hedge maze created in 1833.[http://www.nationaltrust.org.uk/glendurgan-garden/ Glendurgan Garden] . National Trust (2005-11-17). Retrieved on 2011-06-18.\n* Hampton Court Maze. A famous historic maze in the Palace gardens.\n* Hever Castle Maze, Hever, Kent. Yew tree maze and a splashing water maze\n* Hoo Hill Maze, Shefford, Bedfordshire, England[http://www.wuff.me.uk/hoo%20hill%20maze/noj.html Hoo Hill Maze] . Wuff.me.uk. Retrieved on 2011-06-18.[http://maps.google.com.au/maps?ll=52.029145,-0.321728 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n* Norwich Cathedral, Norfolk, England. A labyrinth in the Cloister Garth. Laid to commemorate the Golden Jubilee of HM Queen Elizabeth II in 2002.[http://www.cathedral.org.uk/visitorinfo/the-labyrinth--the-labyrinth.aspx Norwich Cathedral Labyrinth] . Norwich Cathedral. Retrieved on 2012-04-04.\n* Richings Park Amazing Maize Maze, Richings Park, near Heathrow, England (Open July–September)[http://www.farmmaze.co.uk/ The Maize Maze] . Farmmaze.co.uk (2005-07-10). Retrieved on 2011-06-18.\n* Saltwell Park, Gateshead, Tyne and Wear, England. A yew-tree maze restored to its original condition in 2005 and open to the public during park opening hours.\n* Somerleyton Hall, Suffolk, England. A yew hedge maze designed and planted in 1846 by William Nesfield.[http://www.somerleyton.co.uk/hallgardens/gardens_maze.php Somerleyton Hall and Gardens] . Somerleyton Estate. Retrieved on 2012-04-04.\n* York Maze. Located near RAF Elvington and constructed using maize (Dalek corn) plants,[http://www.yorkmaze.com/ York Maze website]  Retrieved 2014-13-11. the maze was created to celebrate the 50th anniversary of Doctor Who.\n\nNorth America\n\nCanada\n\n*In 2012, the Kraay Family Farm in Alberta, Canada created the world's largest QR code in the form of a massive corn maze, popularly known as The Edmonton Corn Maze.\n\nUSA\n\n*The Stanley Hotel in Estes Park, Colorado, which inspired Stephen King's novel The Shining (1977) but did not sport a hedge maze (despite one's being famously depicted in the 1980 film adaption), in November 2014 publicized an international design competition requesting entrants to propose designs to plant a 10,100-square-foot hedge maze, using 1,600 to 2,000 Alpine Currant hedge bushes, on the hotel's front lawn. On 31 January, the judges selected Jesse Alfaro’s Evans, Colorado construction company.\n* Dole Pineapple Plantation, Oahu.\n* Tanglewood Music Center Hedge Maze, Lenox and Stockbridge, Massachusetts.\n\nSouth Africa\n\nChartwell Castle in Johannesburg claims to have the biggest known uninterrupted hedgerow maze in the Southern world, with over 900 conifers. It covers about 6000 sq.m. (approximately 1.5 acres), which is around 5 times bigger than The Hampton Court Maze. The center is about 12m × 12m. The maze was designed and laid out by Conrad Penny.\n\nSouth America\n\nBrazil\n\n* Labirinto Verde, Nova Petrópolis, (Circular hedge maze built in 1989; Latitude 29°22'32.71\"S Longitude 51°06'43.68\"W)\n\nMazes in popular culture\n\nFictional mazes\n\n* The film adaptation of Stephen King's 1977 novel, The Shining (1980), includes a harrowing scene featuring Jack Torrance and Danny Torrance in an ominous hedge maze.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Maze" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20161" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A maze is a path or collection of paths, typically from an entrance to a goal.  The word is used to refer both to branching tour puzzles through which the solver must find a route, and to simpler non-branching (\"unicursal\") patterns that lead unambiguously through a convoluted layout to a goal. (The term \"labyrinth\" is generally synonymous, but also can connote specifically a unicursal pattern.)  The pathways and walls in a maze are typically fixed, but puzzles in which the walls and paths can change during the game are also categorised as mazes or tour puzzles.\n\nMaze construction\n\nMazes have been built with walls and rooms, with hedges, turf, corn stalks, hay bales, books, paving stones of contrasting colors or designs, and brick, or in fields of crops such as corn or, indeed, maize. Maize mazes can be very large; they are usually only kept for one growing season, so they can be different every year, and are promoted as seasonal tourist attractions. Indoors, mirror mazes are another form of maze, in which many of the apparent pathways are imaginary routes seen through multiple reflections in mirrors. Another type of maze consists of a set of rooms linked by doors (so a passageway is just another room in this definition). Players enter at one spot, and exit at another, or the idea may be to reach a certain spot in the maze. Mazes can also be printed or drawn on paper to be followed by a pencil or fingertip. Mazes can be built with snow.\n\nGenerating mazes\n\nMaze generation is the act of designing the layout of passages and walls within a maze. There are many different approaches to generating mazes, with various maze generation algorithms for building them, either by hand or automatically by computer.\n\nThere are two main mechanisms used to generate mazes. In \"carving passages\", one marks out the network of available routes. In building a maze by \"adding walls\", one lays out a set of obstructions within an open area. Most mazes drawn on paper are done by drawing the walls, with the spaces in between the markings composing the passages.\n\nSolving mazes\n\nMaze solving is the act of finding a route through the maze from the start to finish. Some maze solving methods are designed to be used inside the maze by a traveler with no prior knowledge of the maze, whereas others are designed to be used by a person or computer program that can see the whole maze at once.\n\nThe mathematician Leonhard Euler was one of the first to analyze plane mazes mathematically, and in doing so made the first significant contributions to the branch of mathematics known as topology.\n\nMazes containing no loops are known as \"standard\", or \"perfect\" mazes, and are equivalent to a tree in graph theory. Thus many maze solving algorithms are closely related to graph theory. Intuitively, if one pulled and stretched out the paths in the maze in the proper way, the result could be made to resemble a tree.[https://www.youtube.com/watch?v=k1tSK5V1pds Maze to Tree] . YouTube (2007-12-23). Retrieved on 2011-06-18.\n\nMazes in psychology experiments\n\nMazes are often used in psychology experiments to study spatial navigation and learning. Such experiments typically use rats or mice. Examples are:\n* Barnes maze\n* Morris water maze\n** Oasis maze\n* Radial arm maze\n* Elevated plus maze\n* T-maze\n\nOther types of mazes\n\n;Ball-in-a-maze puzzles: Dexterity puzzles which involve navigating a ball through a maze or labyrinth.\n\n;Block maze: A maze in which the player must complete or clear the maze pathway by positioning blocks. Blocks may slide into place or be added.\n\n;Hamilton maze: A maze in which the goal is to find the unique Hamiltonian cycle.\n\n;Linear or railroad maze: A maze in which the paths are laid out like a railroad with switches and crossovers.  Solvers are constrained to moving only forward.  Often, a railroad maze will have a single track for entrance and exit.\n\n;Logic mazes: These are like standard mazes except they use rules other than \"don't cross the lines\" to restrict motion.\n\n;Loops and traps maze: A maze that features one-way doors. The doors can lead to the correct path or create traps that divert you from the correct path and lead you to the starting point. The player may not return through a door through which he has entered, so dead ends may be created. The path is a series of loops interrupted by doors. Through the use of reciprocal doors, the correct path can intersect the incorrect path on a single plane. A graphical variant of this maze type is an arrow maze.\n\n;Mazes in higher dimensions: It is possible for a maze to have three or more dimensions. A maze with bridges is three-dimensional, and some natural cave systems are three-dimensional mazes. The computer game Descent uses fully three-dimensional mazes. Any maze can be mapped into a higher dimension without changing its topology.\n\n;Number maze: A maze in which numbers are used to determine jumps that form a pathway, allowing the maze to criss-cross itself many times.\n\n;Picture maze: A standard maze that forms a picture when solved.\n\n;Turf mazes and mizmazes: A pattern like a long rope folded up, without any junctions or crossings.\n\nGallery\n\nFile:Maze Type Standard.png|Standard maze: Find a path from and back to the star.\nFile:Circularmazeexample.jpg|Circular maze type: Find a route to the centre of the maze.\nFile:Maze Type Arrow.png|Loops and traps maze: Follow the arrows from and back to the star\nFile:Maze Type Block.png|Block maze: Fill in four blocks to make a road connecting the stars. No diagonals.\nFile:Maze Type Number.png|Number maze: Begin and end at the star. Using the number in your space, jump that number of blocks in a straight line to a new space. No diagonals.\n\nPublications about mazes\n\nNumerous mazes of different kinds have been drawn, painted, published in books and periodicals, used in advertising, in software, and sold as art. In the 1970s there occurred a publishing \"maze craze\" in which numerous books, and some magazines, were commercially available in nationwide outlets and devoted exclusively to mazes of a complexity that was able to challenge adults as well as children (for whom simple maze puzzles have long been provided both before, during, and since the 1970s \"craze\").\n\nSome of the best-selling books in the 1970s and early 1980s included those produced by Vladimir Koziakin,Mazes, Vladimir Koziakin (Grosset & Dunlap, 1971)  Rick and Glory Brightfield, Dave Phillips, Larry Evans, and Greg Bright.  Koziakin's works were predominantly of the standard two-dimensional \"trace a line between the walls\" variety.  The works of the Brightfields had a similar two-dimensional form but used a variety of graphics-oriented \"path obscuring\" techniques. Although the routing was comparable to or simpler than Koziakin's mazes, the Brightfields' mazes did not allow the various pathway options to be discerned easily by the roving eye as it glanced about.\n\nGreg Bright's works went beyond the standard published forms of the time by including \"weave\" mazes in which illustrated pathways can cross over and under each other. Bright's works also offered examples of extremely complex patterns of routing and optical illusions for the solver to work through.  What Bright termed \"mutually accessible centers\" (The Great Maze Book, 1973) also called \"braid\" mazes, allowed a proliferation of paths flowing in spiral patterns from a central nexus and, rather than relying on \"dead ends\" to hinder progress, instead relied on an overabundance of pathway choices.  Rather than have a single solution to the maze, Bright's routing often offered multiple equally valid routes from start to finish, with no loss of complexity or diminishment of solver difficulties because the result was that it became difficult for a solver to definitively \"rule out\" a particular pathway as unproductive.  Some of Bright's innovative mazes had no \"dead ends\", although some clearly had looping sections (or \"islands\") that would cause careless explorers to keep looping back again and again to pathways they had already travelled.\n\nThe books of Larry Evans focused on 3-D structures, often with realistic perspective and architectural themes, and Bernard Myers (Supermazes No. 1) produced similar illustrations.  Both Greg Bright (The Hole Maze Book) and Dave Phillips (The World's Most Difficult Maze) published maze books in which the sides of pages could be crossed over and in which holes could allow the pathways to cross from one page to another, and one side of a page to the other, thus enhancing the 3-D routing capacity of 2-D printed illustrations.\n\nAdrian Fisher is both the most prolific contemporary author on mazes, and also one of the leading maze designers.  His book The Amazing Book of Mazes (2006) contains examples and photographs of numerous methods of maze construction, several of which have been pioneered by Fisher; The Art of the Maze (Weidenfeld and Nicholson, 1990) contains a substantial history of the subject, whilst Mazes and Labyrinths (Shire Publications, 2004) is a useful introduction to the subject.\n\nA recent book by Galen Wadzinski (The Ultimate Maze Book) offers formalized rules for more recent innovations that involve single-directional pathways, 3-D simulating illustrations, \"key\" and \"ordered stop\" mazes in which items must be collected or visited in particular orders to add to the difficulties of routing (such restrictions on pathway traveling and re-use are important in a printed book in which the limited amount of space on a printed page would otherwise place clear limits on the number of choices and pathways that can be contained within a single maze).  Although these innovations are not all entirely new with Wadzinski, the book marks a significant advancement in published maze puzzles, offering expansions on the traditional puzzles that seem to have been fully informed by various video game innovations and designs, and adds new levels of challenge and complexity in both the design and the goals offered to the puzzle-solver in a printed format.\n\nMazes open to the public\n\nAsia\n\nDubai\n\n* Gardens Shopping Mall, Dubai (world's largest indoor maze)[http://www.ameinfo.com/45024.html Retail Arabia to open French hypermarket Géant in The Gardens Shopping Mall | Nakheel Properties] . AMEinfo.com. Retrieved on 2011-06-18.\n\nJapan\n\n* Hikimi no Meiro,[http://www.iwami.or.jp/hish/kankou/meiro/maze.htm welcome to hikimi town!!] . Iwami.or.jp. Retrieved on 2011-06-18. Kiso, Nagano, Japan\n* Kyodai Meiro Palladium,[http://www.kinugawa.ne.jp/facilities/palladium/palladium.html 巨大迷路パラディアム] . Kinugawa.ne.jp. Retrieved on 2011-06-18. Nikkō, Tochigi, Japan\n* Sendai Hi-Land,[http://www.hi-land.co.jp/ 仙台ハイランド ホームページ] . Hi-land.co.jp. Retrieved on 2011-06-18. Sendai, Miyagi, Japan\n* Shirahama Energy Land,[http://www.royalpines.co.jp/shirahama/ ：：白浜エネルギーランド：： 移転連絡] . Royalpines.co.jp. Retrieved on 2011-06-18. Shirahama, Wakayama, Japan\n\nPacific\n\nNew Zealand\n\n* Amazing Maze n' Maize\n* The Great Maze at Puzzling World\n\nEurope\n\nAustria\n\n* Schönbrunn Palace, Vienna, has a large hedge maze in its gardens.\n\nBelgium\n\n* Loppem Castle maze\n\nDenmark\n\n* Labyrinthia, Silkeborg[http://maps.google.com.au/maps?ll=56.106007,9.576414 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n* Samsø Labyrinten (The world's largest permanent maze, 60.000 m2)[http://www.samsolabyrinten.com/ Samsø Labyrinten – verdens største labyrint] . Samsolabyrinten.com. Retrieved on 2011-06-18.[http://maps.google.com.au/maps?ll=55.971925,10.551124 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n\nGermany\n\n* Hortus Vitalis – Der Irrgarten,[http://www.hortus-vitalis.de Hortus Vitalis – Irrgarten und Erlebniswelt – Ausflugsziel in Bad Salzuflen] . Hortus-vitalis.de. Retrieved on 2011-06-18. Bad Salzuflen (hedge maze)\n\nGreece\n\n* Labyrinth Park near Hersonissos, Crete (extends to approximately 1.300 m2)[http://www.labyrinthpark.gr/en Labyrinth Park] . Retrieved on 2017-04-26.[http://maps.google.com.au/maps?ll=35.2950336,25.357162 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2017-04-26.\n\nItaly\n\n* [http://maps.google.com.au/maps?fq&source\ns_q&hlit&q\n45.39361,7.955593&aq2&sll\n45.39361,7.955593&sspn0.001654,0.0021&ie\nUTF8&th&rq\n1&split0&ev\nzi&ll45.393489,7.955445&spn\n0.001654,0.0021&z=19 Castello di Masino, Caravino 10010, Torino, Italia]\n* , Chiusi, Tuscany (see Pliny's Italian labyrinth)\n* Villa Pisani, Stra, near Venice ()\n* The labyrinth of Franco Maria Ricci at Fontanellato ()\n\nNetherlands\n\n* Waterlabyrinth, Nijmegen, designed by Klaus van de Locht, 1981 ()\n* Doolhof Ruurlo, Ruurlo, designed by Daniel Marot, based on the design for Hampton Court Maze ()\n\nPortugal\n\n* Parque do Arnado,[http://www.pontedelima.com/index.php?optioncom_content&view\narticle&id168:jardins-no-parque-do-arnado&catid\n76:parques-e-jardins&Itemid=170 Jardins no Parque do Arnado] . Ponte de Lima. Retrieved on 2011-06-18. Ponte de Lima, District of Viana do Castelo\n* Parque de São Roque,[http://www.cm-porto.pt/gen.pl?pstories&op\nview&fokeycmp.stories/2383 C.M. Porto] . Cm-porto.pt. Retrieved on 2011-06-18. District of Porto[http://maps.google.com.au/maps?ll\n41.158021,-8.587639 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n* Forest Reserve of Pinhal da Paz,[http://www.azores.gov.pt/Portal/pt/entidades/sraf-drrf/textoImagem/Pinhal+da+Paz.htm Reserva Florestal de Recreio do Pinhal da Paz (São Miguel)] . Azores.gov.pt. Retrieved on 2011-06-18. São Miguel Island, Azores\n\nSpain\n\n* Alcázar of Seville, Seville\n* Corn Laberynth in the Camino de Santiago, León \n* Parc del laberint d'Horta, Barcelona, ()\n* Parc de la Torreblanca, Esplugues de Llobregat ()\n* Parque de El Capricho, Madrid\n* Laberinto de Villapresente, Cantabria. With 5,625qm, it is the largest maze in Spain.\n* Parque de Tentegorra, Murcia\n* Royal Palace of La Granja de San Ildefonso, Segovia ()\n\nUK\n\n* Blake House Craft Centre, Braintree, Essex, England (Open July–September)[http://www.greatmaze.info/maze.html maze] . Greatmaze.info. Retrieved on 2011-06-18.[http://maps.google.com.au/maps?ll=51.881823,0.474719 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n* Carnfunnock Country Park, Northern Ireland. A hedge maze in the shape of Northern Ireland and winner of 1985 Design a Maze competition.\n* Castlewellan, Northern Ireland, world's largest permanent hedge maze[http://www.guinnessworldrecords.com/content_pages/record.asp?recordid47417 Records Search Page] . Guinness World Records. Retrieved on 2011-06-18.[http://maps.google.com.au/maps?ll\n54.258284,-5.953174 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n* Chatsworth House garden maze, planted with 1,209 yews.\n* Cliveden House Originally laid out in 1894 and re-opened to the public in 2011, consisting of 1100 Yew trees\n* Crystal Palace Park, South London. Laid out in the 1870s, this is the largest maze in London.[http://londonist.com/2011/02/londons-labyrinths-and-mazes/ London's Labyrinths and Mazes]  Londonist. Retrieved on 2016-11-20.\n*Glendurgan Garden, Cornwall.  A cherry laurel hedge maze created in 1833.[http://www.nationaltrust.org.uk/glendurgan-garden/ Glendurgan Garden] . National Trust (2005-11-17). Retrieved on 2011-06-18.\n* Hampton Court Maze. A famous historic maze in the Palace gardens.\n* Hever Castle Maze, Hever, Kent. Yew tree maze and a splashing water maze\n* Hoo Hill Maze, Shefford, Bedfordshire, England[http://www.wuff.me.uk/hoo%20hill%20maze/noj.html Hoo Hill Maze] . Wuff.me.uk. Retrieved on 2011-06-18.[http://maps.google.com.au/maps?ll=52.029145,-0.321728 Google Maps]. Maps.google.com.au (1970-01-01). Retrieved on 2011-06-18.\n* Norwich Cathedral, Norfolk, England. A labyrinth in the Cloister Garth. Laid to commemorate the Golden Jubilee of HM Queen Elizabeth II in 2002.[http://www.cathedral.org.uk/visitorinfo/the-labyrinth--the-labyrinth.aspx Norwich Cathedral Labyrinth] . Norwich Cathedral. Retrieved on 2012-04-04.\n* Richings Park Amazing Maize Maze, Richings Park, near Heathrow, England (Open July–September)[http://www.farmmaze.co.uk/ The Maize Maze] . Farmmaze.co.uk (2005-07-10). Retrieved on 2011-06-18.\n* Saltwell Park, Gateshead, Tyne and Wear, England. A yew-tree maze restored to its original condition in 2005 and open to the public during park opening hours.\n* Somerleyton Hall, Suffolk, England. A yew hedge maze designed and planted in 1846 by William Nesfield.[http://www.somerleyton.co.uk/hallgardens/gardens_maze.php Somerleyton Hall and Gardens] . Somerleyton Estate. Retrieved on 2012-04-04.\n* York Maze. Located near RAF Elvington and constructed using maize (Dalek corn) plants,[http://www.yorkmaze.com/ York Maze website]  Retrieved 2014-13-11. the maze was created to celebrate the 50th anniversary of Doctor Who.\n\nNorth America\n\nCanada\n\n*In 2012, the Kraay Family Farm in Alberta, Canada created the world's largest QR code in the form of a massive corn maze, popularly known as The Edmonton Corn Maze.\n\nUSA\n\n*The Stanley Hotel in Estes Park, Colorado, which inspired Stephen King's novel The Shining (1977) but did not sport a hedge maze (despite one's being famously depicted in the 1980 film adaption), in November 2014 publicized an international design competition requesting entrants to propose designs to plant a 10,100-square-foot hedge maze, using 1,600 to 2,000 Alpine Currant hedge bushes, on the hotel's front lawn. On 31 January, the judges selected Jesse Alfaro’s Evans, Colorado construction company.\n* Dole Pineapple Plantation, Oahu.\n* Tanglewood Music Center Hedge Maze, Lenox and Stockbridge, Massachusetts.\n\nSouth Africa\n\nChartwell Castle in Johannesburg claims to have the biggest known uninterrupted hedgerow maze in the Southern world, with over 900 conifers. It covers about 6000 sq.m. (approximately 1.5 acres), which is around 5 times bigger than The Hampton Court Maze. The center is about 12m × 12m. The maze was designed and laid out by Conrad Penny.\n\nSouth America\n\nBrazil\n\n* Labirinto Verde, Nova Petrópolis, (Circular hedge maze built in 1989; Latitude 29°22'32.71\"S Longitude 51°06'43.68\"W)\n\nMazes in popular culture\n\nFictional mazes\n\n* The film adaptation of Stephen King's 1977 novel, The Shining (1980), includes a harrowing scene featuring Jack Torrance and Danny Torrance in an ominous hedge maze. Maze. http://en.wikipedia.org/?curid=20161."
  }
}
