{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11418",
  "eid" : "fb9eaf90-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778501897,
  "textBody" : "Fiorello Henry La Guardia (; born Fiorello Enrico La Guardia,)He signed his surname as a single word with no space between the \"La\" and the capitalized \"G\" which follows, but also with no space between his initial \"F\" and the surname; in his lifetime his surname was almost always written as two words. (December 11, 1882September 20, 1947) was an American politician. He is best known for being the 99th Mayor of New York City for three terms from 1934 to 1945 as a Republican. Previously he had been elected to Congress in 1916 and 1918, and again from 1922 through 1930. Irascible, energetic, and charismatic, he craved publicity and is acclaimed as one of the greatest mayors in American history.He was ranked first in Melvin G. Holli, The American Mayor (1993) Only five feet, two inches (1.57 m) tall, he was called \"the Little Flower\" (' is Italian for \"little flower\").\n\nLa Guardia, a Republican who appealed across party lines, was very popular in New York during the 1930s. As a New Dealer, he supported President Franklin D. Roosevelt, a Democrat, and in turn Roosevelt heavily funded the city and cut off patronage for La Guardia's enemies. La Guardia revitalized New York City and restored public faith in City Hall. He unified the transit system, directed the building of low-cost public housing, public playgrounds, and parks, constructed airports, reorganized the police force, defeated the powerful Tammany Hall political machine, and reestablished employment on merit in place of patronage jobs.\n\nLa Guardia was seen as a domineering leader who verged on authoritarian but whose reform politics were carefully tailored to address the sentiments of his diverse constituency. He won elections against the historically corrupt Tammany Hall political system, presided during the Great Depression and World War II, implemented New Deal welfare and public works programs in the city, and gave political support to immigrants and ethnic minorities. He was also supported by President Roosevelt. La Guardia was known as a reform mayor who helped clean out corruption, brought in experts, and made the city responsible for its own citizens. His administration engaged new groups that had been kept out of the political system, gave New York its modern infrastructure, and raised expectations of new levels of urban possibility.\n\nEarly life and career\n\nLa Guardia was born in Greenwich Village in New York City. His father, Achille La Guardia, was a lapsed Catholic from Cerignola, Italy, and his mother, Irene Coen, was a Jewish woman from Trieste, then part of the Austro-Hungarian Empire; his maternal grandmother Fiorina Luzzatto Coen was a Luzzatto, a member of the prestigious Italian-Jewish family of scholars, kabbalists, and poets and had among her ancestors the famous rabbi Samuel David Luzzatto. It was in Trieste that Achille La Guardia met and married Irene. Fiorello La Guardia was raised an Episcopalian and practiced that religion all his life. His middle name \"Enrico\" was anglicized to \"Henry\" when he was a child.\n\nHe moved to Arizona with his family, where his father had a bandmaster position at Fort Whipple in the U.S. Army. La Guardia attended public schools and high school in Prescott, Arizona. from the Biographical Directory of the United States Congress After his father was discharged from his bandmaster position in 1898, Fiorello lived in Trieste.For one biographical account about Achille La Guardia, see  He graduated from the Dwight School, a private school on the Upper West Side of New York City.\n\nLa Guardia joined the State Department and served in U.S. consulates in Budapest, Trieste (Austria-Hungary, now Italy), and Fiume (Austria-Hungary, now Rijeka, Croatia), (1901–1906). He returned to the United States to continue his education at New York University. From 1907 to 1910, he worked as an interpreter for the U.S. Bureau of Immigration at the Ellis Island immigration station.\n\nHe graduated from New York University School of Law in 1910, was admitted to the bar the same year, and began a law practice in New York City.\n\nMarriages and family\n\nLa Guardia married twice. His first wife was Thea Almerigotti, an Istrian immigrant, whom he married on March 8, 1919. In June 1920 they had a daughter, Fioretta Thea, who died May 9, 1921, of spinal meningitis. His first wife died of tuberculosis on November 29, 1921, at the age of 26. In 1929 he married Marie Fisher (1895–1984) who had been his secretary while in Congress; they adopted two children, Eric Henry (born 1930) and Jean Marie (1928–62), the biological daughter of Thea's sister. \n\nEarly political career\n\nElected to Congress\n\nLa Guardia became Deputy Attorney General of New York in January 1915. In 1916, he was elected to the U.S. House of Representatives, where he had a reputation as a fiery and devoted reformer. As a Representative, La Guardia represented an ethnically diverse slum district in East Harlem and, although barred from important committee posts because of his political independence, he was a tireless and vocal champion of progressive causes.Zinn, La Guardia in Congress (1959) La Guardia took office on March 4, 1917, but soon was commissioned into the United States Army Air Service; he rose to the rank of major in command of a unit of Ca.44 bombers on the Italian-Austrian front in World War I.  He resigned his seat in Congress on December 31, 1919.\n\nPresident of the Board of Aldermen\n\nIn 1919, La Guardia was chosen to run as the Republican candidate for the office of President of the New York City Board of Aldermen. His Democratic opponent was Robert L. Moran, an alderman from the Bronx who had succeeded to the Board presidency in 1918 when Alfred E. Smith, who had been elected board president in 1917, became governor.[https://select.nytimes.com/gst/abstract.html?resF30E11FB3A5A107B93CBA81783D85F408585F9 \"R. L. Moran Led City Alderman\"] (fee). New York Times. August 19, 1954. Michael \"Dynamite Mike\" Kelly, commander of New York's Third \"Shamrock\" Battalion, also joined the race. Tammany Hall looked with alarm upon Kelly's entrance into the campaign and tried to persuade him to withdraw his candidacy and throw his support behind Moran. When he refused, Tammany went to the New York Supreme Court and successfully sued to keep Kelly's name off the ballot.[https://select.nytimes.com/gst/abstract.html?resF50C16FA3C5411738DDDAA0A94DF405B808FF1D3 \"Major Kelly Killed by His Own Pistol\"] (fee). New York Times. July 23, 1930. When Election Day arrived, over 3,500 of Kelly's supporters wrote Kelly's name on the ballot. This number was sufficient to defeat Moran, who lost to La Guardia by 1,363 votes.[https://select.nytimes.com/gst/abstract.html?res=F00E1FF83D5E10728DDDAF0894D9415B898DF1D3 \"This Election Near A Collapse for Tammany]\", New York Times, November 6, 1919.\n\nImmigration\n\nAs the son of Italian immigrants and an interpreter on Ellis Island between 1907 and 1910, La Guardia had experienced how immigration policies affected the families that came to the United States. He wanted a change for the immigrants, especially with the immigrant medical examinations that took place on Ellis Island. His passion for justice among immigrants, and his ability to speak Italian, Yiddish, and Croatian helped him in his endeavor for justice amongst immigrant factory workers and set him on his path in public service.\n\nReturn to Congress\n\nLa Guardia, running as a Republican, won a seat in Congress from the Italian stronghold of East Harlem in 1922 and served in the House until March 3, 1933. A leading liberal reformer, La Guardia sponsored labor legislation and railed against immigration quotas. His major legislation was the Norris–La Guardia Act, cosponsored with Nebraska senator George Norris in 1932.  It circumvented Supreme Court limitations on the activities of labor unions, especially as those limitations were imposed between the enactment of the Clayton Antitrust Act in 1914 and the end of the 1920s. Based on the theory that the lower courts are creations not of the Constitution but of Congress, and that Congress therefore has wide power in defining and restricting their jurisdiction, the act forbids issuance of injunctions to sustain anti-union contracts of employment, to prevent ceasing or refusing to perform any work or remain in any relation of employment, or to restrain acts generally constituting component parts of strikes, boycotts, and picketing. It also said courts could no longer enforce yellow-dog contracts, which are labor contracts prohibiting a worker from joining a union.Zinn, La Guardia in Congress pp. 226–30Bernstein, Irving (1966). The Lean Years: A History of the American Worker, 1920–1933. pp. 406–9.\n\nForeign policy\n\nNever an isolationist, he supported using American influence abroad on behalf of democracy or for national independence or against autocracy. Thus he supported the Irish independence movement and the anti-czarist Russian Revolution of 1917, but did not approve of Vladimir Lenin.  Unlike most progressive colleagues, such as Norris, La Guardia consistently backed internationalism, speaking in favor of the League of Nations and the Inter-Parliamentary Union as well as peace and disarmament conferences. In domestic policies he tended toward socialism and wanted to nationalize and regulate; however he was never close to the Socialist Party and never bothered to read Karl Marx.Zinn, La Guardia in Congress pp. 267–70\n\nChampion of the progressive movement\n\nAs a congressman, La Guardia was a tireless and vocal champion of progressive causes, from allowing more immigration and removing U.S. troops from Nicaragua to speaking up for the rights and livelihoods of striking miners, impoverished farmers, oppressed minorities, and struggling families. A thorn in the side of the era's plutocrats and their enablers in government, he fought for progressive income taxes, greater government oversight of Wall Street, and national employment insurance for workers idled by the Great Depression.\n\nProhibition\n\nLa Guardia was one of the first Republicans to voice his opinion about prohibition, urging that the Dry cause \"would prove disastrous in the long run\". This was breaking a taboo, given the fact that both parties \"avoided taking a stand on prohibition issues\" at the time.\n\nDefeats in 1929 and 1932\n\nAs a Republican, La Guardia had to support Harding in 1920; he had to be silent in the 1928 campaign although he favored Al Smith, a Democrat. In 1929, he lost the election for mayor to incumbent Democrat Jimmy Walker by a landslide.Joseph McGoldrick, \"The New York City Election of 1929,\" The American Political Science Review, Vol. 24, No. 3 (Aug., 1930), pp. 688–690 [https://www.jstor.org/stable/1946937 in JSTOR]\nIn 1932 he was defeated for re-election to the House by James J. Lanzetta, the Democratic candidate; 1932 was not a good year for Republican candidates like La Guardia, and the 20th Congressional district was shifting from a Jewish and Italian-American population to a Puerto Rican population. However, it has also been argued that powerful Tammany Hall boss Jimmy Hines was able to successfully get enough votes forged to get La Guardia unseated in this election as well.Stolberg, Mary M. Fighting Organised Crime: Politics, Justice, and the Legacy of Thomas E. Dewey (1995) pg. 229\n\nMayor of New York\n\n1933 election\n\nWalker and his Irish-run Tammany Hall were forced out of office by scandal and La Guardia was determined to replace him. First he had to win the nomination of both the Republican party and also the \"Fusion\" group of independents. He was not the first choice of either, for they distrusted Italians. On the other hand, La Guardia had enormous determination, high visibility, the support of reformer Samuel Seabury and the ability to ruin the prospects of any rival by a divisive primary contest. He secured the nominations and expected an easy win against hapless incumbent Mayor John P. O'Brien. However, at the last minute Joseph V. McKee entered the race as the nominee of the new \"Recovery party\". McKee was a formidable opponent because he was sponsored by Bronx Democratic boss Edward J. Flynn and apparently was favored by President Franklin Roosevelt. La Guardia made corruption his main issue. The campaign saw mud slung three ways, with La Guardia denounced as a far-left \"Red\", O'Brien as a pawn of the bosses, and McKee as an anti-Semite. La Guardia's win was based on a complex coalition of regular Republicans (mostly middle class German Americans in the boroughs outside Manhattan), a minority of reform-minded Democrats, some Socialists, a large proportion of middle-class Jews, and the great majority of Italians. The Italians had been loyal to Tammany; their switch proved decisive.Arthur H. Mann, La Guardia Comes to Power 1933 (1969)\n\nAgenda\n\nLa Guardia came to office in January 1934 with five main goals:Thomas Kessner, Fiorello H. LaGuardia and the Making of Modern New York (1989) ch 8–9\n* Restore the financial health and break free from the bankers' control\n* Expand the federally funded work-relief program for the unemployed\n* End corruption in government and racketeering in key sectors of the economy\n* Replace patronage with a merit-based civil service, with high prestige\n* Modernize the infrastructure, especially transportation and parks\n\nHe achieved most of the first four goals in his first hundred days, as FDR gave him 20% of the entire national CWA budget for work relief.  La Guardia then collaborated closely with Robert Moses, with support from the governor, Democrat Herbert Lehman, to upgrade the decaying infrastructure. The city was favored by the New Deal in terms of funding for public works projects.\n\nEthnic politics\n\nLa Guardia governed in an uneasy alliance with New York's Jews and liberal WASPs, together with ethnic Italians and Germans.Ronald H. Bayor, Fiorello La Guardia: Ethnicity and Reform (1993)\n\nLa Guardia was not an orthodox Republican. He also ran as the nominee of the American Labor Party, a union-dominated anti-Tammany left wing group that supported Franklin D. Roosevelt for president beginning in 1936. La Guardia supported Roosevelt, chairing the Committee of Independent Voters for Roosevelt and Wallace with Senator George Norris during the 1940 presidential election.\n\nLa Guardia was the city's first Italian-American mayor, but was not a typical Italian New Yorker. He was a Republican Episcopalian who had grown up in Arizona and had a Triestine Jewish mother and a lapsed Catholic father. He spoke several languages, reportedly including Hebrew, Croatian, German, Italian, and Yiddish. It served him well during a contentious congressional campaign in 1922. When Henry Frank, a Jewish opponent, accused him of anti-Semitism, La Guardia rejected the suggestion that he publicly disclose that his mother was Jewish as \"self-serving\". Instead, La Guardia dictated an open letter in Yiddish that was also printed in Yiddish. In it, he challenged Frank to publicly and openly debate the issues of the campaign \"ENTIRELY IN THE YIDDISH LANGUAGE.” Frank, although he was Jewish, could not speak the language and was forced to decline—and lost the election.\n\nCrime\n\nLa Guardia loathed the gangsters who brought a negative stereotype and shame to the Italian community.Thomas Kessner, Fiorello H. LaGuardia and the Making of Modern New York  (1989) pp 350–68 His first action as mayor was to order the chief of police to arrest mob boss Lucky Luciano on whatever charges could be found. La Guardia then went after the gangsters with a vengeance, stating in a radio address to the people of New York in his high-pitched, squeaky voice, \"Let's drive the bums out of town\". In 1934 he went on a search-and-destroy mission looking for mob boss Frank Costello's slot machines, which La Guardia executed with gusto, rounding up thousands of the \"one armed bandits\", swinging a sledgehammer and dumping them off a barge into the water for the newspapers and media. In 1935 La Guardia appeared at The Bronx Terminal Market to institute a citywide ban on the sale, display, and possession of artichokes, whose prices were inflated by mobs. When prices went down, the ban was lifted. In 1936, La Guardia had special prosecutor Thomas E. Dewey, a future Republican presidential candidate, single out Lucky Luciano for prosecution. Dewey led a successful investigation into Luciano's lucrative prostitution operation, eventually sending Luciano to jail with a 30–50 year sentence. The case was made into the 1937 movie Marked Woman, starring Bette Davis.\n\nLa Guardia proved successful in shutting down the burlesque theaters, whose shows offended his puritanical sensibilities.Friedman, Andrea (October 1996). [https://www.jstor.org/stable/3704140 \"'The Habitats of Sex-Crazed Perverts': Campaigns against Burlesque in Depression-Era New York City\"]. Journal of the History of Sexuality Vol. 7, No. 2, pp. 203–238.\n\nPublic works\n\nLa Guardia's admirers credit him with, among other things, restoring the economic lifeblood of New York City during and after the Great Depression. He is given credit for many massive public works programs administered by his powerful Parks Commissioner Robert Moses and employed thousands of voters. The mayor's relentless lobbying for federal funds allowed New York to develop its economic infrastructure.\n\nTo obtain large-scale federal money the mayor became a close partner of Roosevelt and New Deal agencies such as CWA, PWA and WPA, which poured $1.1 billion into the city from 1934–39. In turn he gave FDR a showcase for New Deal achievement, helped defeat FDR's political enemies in Tammany Hall (the Democratic party machine in Manhattan).  He and Moses built highways, bridges and tunnels, transforming the physical landscape of New York City. The West Side Highway, East River Drive, Brooklyn Battery Tunnel, Triborough Bridge, and two airports (LaGuardia Airport, and, later, Idlewild, now JFK Airport) were built during his mayoralty.Mason B. Williams, City of Ambition: FDR, LaGuardia, and the Making of Modern New York (2014) pp 197, 256-58, 318\n\n1939\n\n1939 was a busy year, as he opened the 1939 New York World's Fair at Flushing Meadows-Corona Park, Queens, opened New York Municipal Airport No. 2 in Queens (later renamed Fiorello H. LaGuardia Field), and had the city buy out the Interborough Rapid Transit Company and Brooklyn–Manhattan Transit Corporation, thus completing the public takeover of the subway system.  When the city's newspapers were closed by a strike he famously read the comics on the radio.H. Paul Jeffers, The Napoleon of New York (2002) pp 275-90\n\nReform\n\nResponding to popular disdain for the sometimes corrupt City Council, La Guardia successfully proposed a reformed 1938 City Charter that created a powerful new New York City Board of Estimate, similar to a corporate board of directors.\n\nGermany\n\nHe was an outspoken and early critic of Adolf Hitler and the Nazi regime. In a public address in 1934, La Guardia warned that \"part of Hitler's program is the complete annihilation of the Jews in Germany\". In 1937, speaking before the Women's Division of the American Jewish Congress, he called for the creation of a special pavilion at the upcoming New York World's Fair, \"a chamber of horrors\" for \"that brown-shirted fanatic\".David M. Esposito, and Jackie R. Esposito, \"La Guardia and the Nazis, 1933–1938.\" American Jewish History 1988 78(1): 38–53. ; quote from H. Paul Jeffers, The Napoleon of New York (2002) p. 233. He also encouraged the boycotting of German goods, led anti-Nazi rallies, and promoted legislation to facilitate the U.S. rescue of the Jewish refugees.\n\nGemma La Guardia Gluck\n\nLa Guardia's sister, Gemma La Guardia Gluck (1881–1962), and brother-in-law, Herman Gluck (a Hungarian Jew whom she met while teaching English in Europe), were living in Hungary and were arrested by the Gestapo on June 7, 1944, when the Nazis took control of Budapest. Adolf Eichmann and Heinrich Himmler knew that Gemma was La Guardia's sister and ordered her to be held as a political prisoner. She and Herman Gluck were deported to Mauthausen concentration camp in Austria, where he died, as Gemma learned from reading a newspaper account a year after her own release. She was transferred from Mauthausen to the notorious women's concentration camp at Ravensbrück, located some fifty miles from Berlin, where unbeknownst to Gemma at the time, her daughter Yolanda (whose husband also died in the camps) and baby grandson were also held for a year in a separate barracks. Gemma Gluck, who was held in Block II of the camp and assigned prisoner #44139, was one of the few survivors of this camp and wrote about her time at Ravensbrück.\n She also wrote that the Soviets were \"violating girls and women of all ages\", and about her, her daughter's and grandson's suffering as displaced persons in postwar Berlin, where the Germans abandoned them for a possible hostage exchange in April 1945, as the Russians were advancing. Gemma and her family did not speak German, and had no identity papers, money, or means of documenting where they had been. Gemma finally managed to get word to the Americans who contacted La Guardia, who had no idea where they were. He worked to get them on the immigration lists, but asserted in a letter, included in the appendix of Gemma's memoir, that her \"case was the same as that of hundreds of thousands of displaced people\" and \"no exceptions can be made\". Thus, despite Gemma's intimate connection with a powerful American politician, who was then director of the United Nations Relief and Rehabilitation Administration (UNRRA), it took two years for her to be cleared and sent to the United States. She returned to New York in May 1947, where she was reunited with her brother only four months before he died. As he had made no provision for her, she lived in very reduced circumstances, in a public housing project in Queens, New York, until her death in 1962. Gluck is one of the few American-born women interned by the Nazis. (Another was Virginia d'Albert-Lake.)\n\nWorld War II\n\nIn 1941 during the run-up to American involvement in World War II, President Roosevelt appointed La Guardia first director of the new Office of Civilian Defense (OCD). Roosevelt was an admirer of La Guardia; after meeting Winston Churchill for the first time he described him as \"an English Mayor La Guardia\". The OCD was the national agency responsible for preparing for blackouts, air raid wardens, sirens, and shelters in case of German air raids. The government knew that such air raids were impossible but the goal was to psychologically mobilize many thousands of middle class volunteers to make them feel part of the war effort. La Guardia remained Mayor of New York, shuttling back and forth with three days in Washington and four in the city in an effort to do justice to two herculean jobs. On top of this, he still performed other gestures, such as arranging police protection with his personal assurances for local artists Joe Simon and Jack Kirby, when they were threatened by Nazi supporters for their new patriotic comic book superhero, Captain America. After the attack on Pearl Harbor in December 1941, his role was turned over to full-time director of OCD, James M. Landis. La Guardia's popularity slipped away and he ran so poorly in straw polls in 1945 that he did not run for a fourth term.Erwin Hargrove, \"The Dramas of Reform,\" in James D. Barber, ed. Political Leadership in American Government (1964), p. 94.\n\nUnemployment ended, and the city was a gateway for military supplies and soldiers sent to Europe, with the Brooklyn Navy Yard providing many of the warships and the garment trade providing uniforms. The city's great financiers, however, were less important in decision making than the policy makers in Washington, and very high wartime taxes were not offset by heavy war spending. New York was not a center of heavy industry and did not see a wartime boom, as defense plants were built elsewhere.Karl Drew Hartzell, The Empire State At War, World War II (1949) FDR refused to make La Guardia a general and was unable to provide fresh money for the city. By 1944 the city was short of funds to pay for La Guardia's new programs.Thomas Kessner, \"Fiorello H. LaGuardia\" in History Teacher (1993) 26(2): 151–159\n\nLater life and death\n\nLa Guardia was the director general for the United Nations Relief and Rehabilitation Administration (UNRRA) in 1946.\n\nA man of short stature, La Guardia's height is sometimes given as 5 ft. According to an article in The New York Times, however, his actual height was 5 ft.\n\nLa Guardia was a Freemason and was a member of Garibaldi Lodge #542, in New York City.\n\nHe died of pancreatic cancer in his home at 5020 Goodridge Avenue, in the Riverdale section of The Bronx on September 20, 1947, aged 64Jackson, Nancy Beth. [https://query.nytimes.com/gst/fullpage.html?res950CE7D91E3CF934A25751C0A9649C8B63&scp\n1&sq%22richard+simon%22+riverdale&st\nnyt \"If You're Thinking of Living In/Fieldston; A Leafy Enclave in the Hills of the Bronx\"] on September 20, 1947. The New York Times. February 17, 2002. Retrieved May 3, 2008. \"Fiorello H. La Guardia, a three-time mayor of New York, lived and died at 5020 Goodridge Avenue.\" and is interred at Woodlawn Cemetery in The Bronx, New York City.\n\nLegacy\n\nLa Guardia was ranked first among the nation's mayors in a 1993 poll of historians and social scientists. \nAccording to biographer Mason B. Williams, his close collaboration with Roosevelt's New Deal proved a striking success in linking national money and local needs.Mason B. Williams, City of Ambition: FDR, LaGuardia, and the Making of Modern New York (2014). La Guardia enabled the political recognition new groups that had been largely excluded from the political system, such as Jews and Italians.Ronald H. Bayor, Fiorello La Guardia: Ethnicity and Reform (1993). His administration (in cooperation with Robert Moses) gave New York its modern infrastructure. His far-sighted goals raised ambitions for new levels of urban possibility.  According to Thomas Kessner, trends since his tenure mean that \"people would be afraid of allowing anybody to take that kind of power\".\n\nMemorials\n\nIn 1972 the United States Postal Service honored La Guardia with a 14-cent postage stamp.\n\nNew York's LaGuardia Airport, LaGuardia Community College, and other parks and buildings around New York City are named for him.\n\nA strong supporter of Zionism, LaGuardia Street and LaGuardia interchange both in Tel Aviv, Israel, were named in his honor.\n\nKnown for his love of music, La Guardia was noted for spontaneously conducting professional and student orchestras and was instrumental in the creation of the High School of Music & Art in 1936, now renamed the Fiorello H. LaGuardia High School of Music & Art and Performing Arts.Steigman, Benjamin: Accent on TalentNew York's High School of Music & Art Wayne State University Press, 1984; pg. ???\n\nLa Guardia was a fictionalized character in many films – in Ghostbusters II La Guardia's ghost talks to New York Mayor Lenny (played by David Margulies). He was also the subject of the hit Broadway musical Fiorello!, portrayed by actor Tom Bosley and in The Little Flower, portrayed by Tony Lo Bianco. Fiorello! won a Pulitzer Prize, and ran for two years (1959–1961).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fiorello H. La Guardia" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11418" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Fiorello Henry La Guardia (; born Fiorello Enrico La Guardia,)He signed his surname as a single word with no space between the \"La\" and the capitalized \"G\" which follows, but also with no space between his initial \"F\" and the surname; in his lifetime his surname was almost always written as two words. (December 11, 1882September 20, 1947) was an American politician. He is best known for being the 99th Mayor of New York City for three terms from 1934 to 1945 as a Republican. Previously he had been elected to Congress in 1916 and 1918, and again from 1922 through 1930. Irascible, energetic, and charismatic, he craved publicity and is acclaimed as one of the greatest mayors in American history.He was ranked first in Melvin G. Holli, The American Mayor (1993) Only five feet, two inches (1.57 m) tall, he was called \"the Little Flower\" (' is Italian for \"little flower\").\n\nLa Guardia, a Republican who appealed across party lines, was very popular in New York during the 1930s. As a New Dealer, he supported President Franklin D. Roosevelt, a Democrat, and in turn Roosevelt heavily funded the city and cut off patronage for La Guardia's enemies. La Guardia revitalized New York City and restored public faith in City Hall. He unified the transit system, directed the building of low-cost public housing, public playgrounds, and parks, constructed airports, reorganized the police force, defeated the powerful Tammany Hall political machine, and reestablished employment on merit in place of patronage jobs.\n\nLa Guardia was seen as a domineering leader who verged on authoritarian but whose reform politics were carefully tailored to address the sentiments of his diverse constituency. He won elections against the historically corrupt Tammany Hall political system, presided during the Great Depression and World War II, implemented New Deal welfare and public works programs in the city, and gave political support to immigrants and ethnic minorities. He was also supported by President Roosevelt. La Guardia was known as a reform mayor who helped clean out corruption, brought in experts, and made the city responsible for its own citizens. His administration engaged new groups that had been kept out of the political system, gave New York its modern infrastructure, and raised expectations of new levels of urban possibility.\n\nEarly life and career\n\nLa Guardia was born in Greenwich Village in New York City. His father, Achille La Guardia, was a lapsed Catholic from Cerignola, Italy, and his mother, Irene Coen, was a Jewish woman from Trieste, then part of the Austro-Hungarian Empire; his maternal grandmother Fiorina Luzzatto Coen was a Luzzatto, a member of the prestigious Italian-Jewish family of scholars, kabbalists, and poets and had among her ancestors the famous rabbi Samuel David Luzzatto. It was in Trieste that Achille La Guardia met and married Irene. Fiorello La Guardia was raised an Episcopalian and practiced that religion all his life. His middle name \"Enrico\" was anglicized to \"Henry\" when he was a child.\n\nHe moved to Arizona with his family, where his father had a bandmaster position at Fort Whipple in the U.S. Army. La Guardia attended public schools and high school in Prescott, Arizona. from the Biographical Directory of the United States Congress After his father was discharged from his bandmaster position in 1898, Fiorello lived in Trieste.For one biographical account about Achille La Guardia, see  He graduated from the Dwight School, a private school on the Upper West Side of New York City.\n\nLa Guardia joined the State Department and served in U.S. consulates in Budapest, Trieste (Austria-Hungary, now Italy), and Fiume (Austria-Hungary, now Rijeka, Croatia), (1901–1906). He returned to the United States to continue his education at New York University. From 1907 to 1910, he worked as an interpreter for the U.S. Bureau of Immigration at the Ellis Island immigration station.\n\nHe graduated from New York University School of Law in 1910, was admitted to the bar the same year, and began a law practice in New York City.\n\nMarriages and family\n\nLa Guardia married twice. His first wife was Thea Almerigotti, an Istrian immigrant, whom he married on March 8, 1919. In June 1920 they had a daughter, Fioretta Thea, who died May 9, 1921, of spinal meningitis. His first wife died of tuberculosis on November 29, 1921, at the age of 26. In 1929 he married Marie Fisher (1895–1984) who had been his secretary while in Congress; they adopted two children, Eric Henry (born 1930) and Jean Marie (1928–62), the biological daughter of Thea's sister. \n\nEarly political career\n\nElected to Congress\n\nLa Guardia became Deputy Attorney General of New York in January 1915. In 1916, he was elected to the U.S. House of Representatives, where he had a reputation as a fiery and devoted reformer. As a Representative, La Guardia represented an ethnically diverse slum district in East Harlem and, although barred from important committee posts because of his political independence, he was a tireless and vocal champion of progressive causes.Zinn, La Guardia in Congress (1959) La Guardia took office on March 4, 1917, but soon was commissioned into the United States Army Air Service; he rose to the rank of major in command of a unit of Ca.44 bombers on the Italian-Austrian front in World War I.  He resigned his seat in Congress on December 31, 1919.\n\nPresident of the Board of Aldermen\n\nIn 1919, La Guardia was chosen to run as the Republican candidate for the office of President of the New York City Board of Aldermen. His Democratic opponent was Robert L. Moran, an alderman from the Bronx who had succeeded to the Board presidency in 1918 when Alfred E. Smith, who had been elected board president in 1917, became governor.[https://select.nytimes.com/gst/abstract.html?resF30E11FB3A5A107B93CBA81783D85F408585F9 \"R. L. Moran Led City Alderman\"] (fee). New York Times. August 19, 1954. Michael \"Dynamite Mike\" Kelly, commander of New York's Third \"Shamrock\" Battalion, also joined the race. Tammany Hall looked with alarm upon Kelly's entrance into the campaign and tried to persuade him to withdraw his candidacy and throw his support behind Moran. When he refused, Tammany went to the New York Supreme Court and successfully sued to keep Kelly's name off the ballot.[https://select.nytimes.com/gst/abstract.html?resF50C16FA3C5411738DDDAA0A94DF405B808FF1D3 \"Major Kelly Killed by His Own Pistol\"] (fee). New York Times. July 23, 1930. When Election Day arrived, over 3,500 of Kelly's supporters wrote Kelly's name on the ballot. This number was sufficient to defeat Moran, who lost to La Guardia by 1,363 votes.[https://select.nytimes.com/gst/abstract.html?res=F00E1FF83D5E10728DDDAF0894D9415B898DF1D3 \"This Election Near A Collapse for Tammany]\", New York Times, November 6, 1919.\n\nImmigration\n\nAs the son of Italian immigrants and an interpreter on Ellis Island between 1907 and 1910, La Guardia had experienced how immigration policies affected the families that came to the United States. He wanted a change for the immigrants, especially with the immigrant medical examinations that took place on Ellis Island. His passion for justice among immigrants, and his ability to speak Italian, Yiddish, and Croatian helped him in his endeavor for justice amongst immigrant factory workers and set him on his path in public service.\n\nReturn to Congress\n\nLa Guardia, running as a Republican, won a seat in Congress from the Italian stronghold of East Harlem in 1922 and served in the House until March 3, 1933. A leading liberal reformer, La Guardia sponsored labor legislation and railed against immigration quotas. His major legislation was the Norris–La Guardia Act, cosponsored with Nebraska senator George Norris in 1932.  It circumvented Supreme Court limitations on the activities of labor unions, especially as those limitations were imposed between the enactment of the Clayton Antitrust Act in 1914 and the end of the 1920s. Based on the theory that the lower courts are creations not of the Constitution but of Congress, and that Congress therefore has wide power in defining and restricting their jurisdiction, the act forbids issuance of injunctions to sustain anti-union contracts of employment, to prevent ceasing or refusing to perform any work or remain in any relation of employment, or to restrain acts generally constituting component parts of strikes, boycotts, and picketing. It also said courts could no longer enforce yellow-dog contracts, which are labor contracts prohibiting a worker from joining a union.Zinn, La Guardia in Congress pp. 226–30Bernstein, Irving (1966). The Lean Years: A History of the American Worker, 1920–1933. pp. 406–9.\n\nForeign policy\n\nNever an isolationist, he supported using American influence abroad on behalf of democracy or for national independence or against autocracy. Thus he supported the Irish independence movement and the anti-czarist Russian Revolution of 1917, but did not approve of Vladimir Lenin.  Unlike most progressive colleagues, such as Norris, La Guardia consistently backed internationalism, speaking in favor of the League of Nations and the Inter-Parliamentary Union as well as peace and disarmament conferences. In domestic policies he tended toward socialism and wanted to nationalize and regulate; however he was never close to the Socialist Party and never bothered to read Karl Marx.Zinn, La Guardia in Congress pp. 267–70\n\nChampion of the progressive movement\n\nAs a congressman, La Guardia was a tireless and vocal champion of progressive causes, from allowing more immigration and removing U.S. troops from Nicaragua to speaking up for the rights and livelihoods of striking miners, impoverished farmers, oppressed minorities, and struggling families. A thorn in the side of the era's plutocrats and their enablers in government, he fought for progressive income taxes, greater government oversight of Wall Street, and national employment insurance for workers idled by the Great Depression.\n\nProhibition\n\nLa Guardia was one of the first Republicans to voice his opinion about prohibition, urging that the Dry cause \"would prove disastrous in the long run\". This was breaking a taboo, given the fact that both parties \"avoided taking a stand on prohibition issues\" at the time.\n\nDefeats in 1929 and 1932\n\nAs a Republican, La Guardia had to support Harding in 1920; he had to be silent in the 1928 campaign although he favored Al Smith, a Democrat. In 1929, he lost the election for mayor to incumbent Democrat Jimmy Walker by a landslide.Joseph McGoldrick, \"The New York City Election of 1929,\" The American Political Science Review, Vol. 24, No. 3 (Aug., 1930), pp. 688–690 [https://www.jstor.org/stable/1946937 in JSTOR]\nIn 1932 he was defeated for re-election to the House by James J. Lanzetta, the Democratic candidate; 1932 was not a good year for Republican candidates like La Guardia, and the 20th Congressional district was shifting from a Jewish and Italian-American population to a Puerto Rican population. However, it has also been argued that powerful Tammany Hall boss Jimmy Hines was able to successfully get enough votes forged to get La Guardia unseated in this election as well.Stolberg, Mary M. Fighting Organised Crime: Politics, Justice, and the Legacy of Thomas E. Dewey (1995) pg. 229\n\nMayor of New York\n\n1933 election\n\nWalker and his Irish-run Tammany Hall were forced out of office by scandal and La Guardia was determined to replace him. First he had to win the nomination of both the Republican party and also the \"Fusion\" group of independents. He was not the first choice of either, for they distrusted Italians. On the other hand, La Guardia had enormous determination, high visibility, the support of reformer Samuel Seabury and the ability to ruin the prospects of any rival by a divisive primary contest. He secured the nominations and expected an easy win against hapless incumbent Mayor John P. O'Brien. However, at the last minute Joseph V. McKee entered the race as the nominee of the new \"Recovery party\". McKee was a formidable opponent because he was sponsored by Bronx Democratic boss Edward J. Flynn and apparently was favored by President Franklin Roosevelt. La Guardia made corruption his main issue. The campaign saw mud slung three ways, with La Guardia denounced as a far-left \"Red\", O'Brien as a pawn of the bosses, and McKee as an anti-Semite. La Guardia's win was based on a complex coalition of regular Republicans (mostly middle class German Americans in the boroughs outside Manhattan), a minority of reform-minded Democrats, some Socialists, a large proportion of middle-class Jews, and the great majority of Italians. The Italians had been loyal to Tammany; their switch proved decisive.Arthur H. Mann, La Guardia Comes to Power 1933 (1969)\n\nAgenda\n\nLa Guardia came to office in January 1934 with five main goals:Thomas Kessner, Fiorello H. LaGuardia and the Making of Modern New York (1989) ch 8–9\n* Restore the financial health and break free from the bankers' control\n* Expand the federally funded work-relief program for the unemployed\n* End corruption in government and racketeering in key sectors of the economy\n* Replace patronage with a merit-based civil service, with high prestige\n* Modernize the infrastructure, especially transportation and parks\n\nHe achieved most of the first four goals in his first hundred days, as FDR gave him 20% of the entire national CWA budget for work relief.  La Guardia then collaborated closely with Robert Moses, with support from the governor, Democrat Herbert Lehman, to upgrade the decaying infrastructure. The city was favored by the New Deal in terms of funding for public works projects.\n\nEthnic politics\n\nLa Guardia governed in an uneasy alliance with New York's Jews and liberal WASPs, together with ethnic Italians and Germans.Ronald H. Bayor, Fiorello La Guardia: Ethnicity and Reform (1993)\n\nLa Guardia was not an orthodox Republican. He also ran as the nominee of the American Labor Party, a union-dominated anti-Tammany left wing group that supported Franklin D. Roosevelt for president beginning in 1936. La Guardia supported Roosevelt, chairing the Committee of Independent Voters for Roosevelt and Wallace with Senator George Norris during the 1940 presidential election.\n\nLa Guardia was the city's first Italian-American mayor, but was not a typical Italian New Yorker. He was a Republican Episcopalian who had grown up in Arizona and had a Triestine Jewish mother and a lapsed Catholic father. He spoke several languages, reportedly including Hebrew, Croatian, German, Italian, and Yiddish. It served him well during a contentious congressional campaign in 1922. When Henry Frank, a Jewish opponent, accused him of anti-Semitism, La Guardia rejected the suggestion that he publicly disclose that his mother was Jewish as \"self-serving\". Instead, La Guardia dictated an open letter in Yiddish that was also printed in Yiddish. In it, he challenged Frank to publicly and openly debate the issues of the campaign \"ENTIRELY IN THE YIDDISH LANGUAGE.” Frank, although he was Jewish, could not speak the language and was forced to decline—and lost the election.\n\nCrime\n\nLa Guardia loathed the gangsters who brought a negative stereotype and shame to the Italian community.Thomas Kessner, Fiorello H. LaGuardia and the Making of Modern New York  (1989) pp 350–68 His first action as mayor was to order the chief of police to arrest mob boss Lucky Luciano on whatever charges could be found. La Guardia then went after the gangsters with a vengeance, stating in a radio address to the people of New York in his high-pitched, squeaky voice, \"Let's drive the bums out of town\". In 1934 he went on a search-and-destroy mission looking for mob boss Frank Costello's slot machines, which La Guardia executed with gusto, rounding up thousands of the \"one armed bandits\", swinging a sledgehammer and dumping them off a barge into the water for the newspapers and media. In 1935 La Guardia appeared at The Bronx Terminal Market to institute a citywide ban on the sale, display, and possession of artichokes, whose prices were inflated by mobs. When prices went down, the ban was lifted. In 1936, La Guardia had special prosecutor Thomas E. Dewey, a future Republican presidential candidate, single out Lucky Luciano for prosecution. Dewey led a successful investigation into Luciano's lucrative prostitution operation, eventually sending Luciano to jail with a 30–50 year sentence. The case was made into the 1937 movie Marked Woman, starring Bette Davis.\n\nLa Guardia proved successful in shutting down the burlesque theaters, whose shows offended his puritanical sensibilities.Friedman, Andrea (October 1996). [https://www.jstor.org/stable/3704140 \"'The Habitats of Sex-Crazed Perverts': Campaigns against Burlesque in Depression-Era New York City\"]. Journal of the History of Sexuality Vol. 7, No. 2, pp. 203–238.\n\nPublic works\n\nLa Guardia's admirers credit him with, among other things, restoring the economic lifeblood of New York City during and after the Great Depression. He is given credit for many massive public works programs administered by his powerful Parks Commissioner Robert Moses and employed thousands of voters. The mayor's relentless lobbying for federal funds allowed New York to develop its economic infrastructure.\n\nTo obtain large-scale federal money the mayor became a close partner of Roosevelt and New Deal agencies such as CWA, PWA and WPA, which poured $1.1 billion into the city from 1934–39. In turn he gave FDR a showcase for New Deal achievement, helped defeat FDR's political enemies in Tammany Hall (the Democratic party machine in Manhattan).  He and Moses built highways, bridges and tunnels, transforming the physical landscape of New York City. The West Side Highway, East River Drive, Brooklyn Battery Tunnel, Triborough Bridge, and two airports (LaGuardia Airport, and, later, Idlewild, now JFK Airport) were built during his mayoralty.Mason B. Williams, City of Ambition: FDR, LaGuardia, and the Making of Modern New York (2014) pp 197, 256-58, 318\n\n1939\n\n1939 was a busy year, as he opened the 1939 New York World's Fair at Flushing Meadows-Corona Park, Queens, opened New York Municipal Airport No. 2 in Queens (later renamed Fiorello H. LaGuardia Field), and had the city buy out the Interborough Rapid Transit Company and Brooklyn–Manhattan Transit Corporation, thus completing the public takeover of the subway system.  When the city's newspapers were closed by a strike he famously read the comics on the radio.H. Paul Jeffers, The Napoleon of New York (2002) pp 275-90\n\nReform\n\nResponding to popular disdain for the sometimes corrupt City Council, La Guardia successfully proposed a reformed 1938 City Charter that created a powerful new New York City Board of Estimate, similar to a corporate board of directors.\n\nGermany\n\nHe was an outspoken and early critic of Adolf Hitler and the Nazi regime. In a public address in 1934, La Guardia warned that \"part of Hitler's program is the complete annihilation of the Jews in Germany\". In 1937, speaking before the Women's Division of the American Jewish Congress, he called for the creation of a special pavilion at the upcoming New York World's Fair, \"a chamber of horrors\" for \"that brown-shirted fanatic\".David M. Esposito, and Jackie R. Esposito, \"La Guardia and the Nazis, 1933–1938.\" American Jewish History 1988 78(1): 38–53. ; quote from H. Paul Jeffers, The Napoleon of New York (2002) p. 233. He also encouraged the boycotting of German goods, led anti-Nazi rallies, and promoted legislation to facilitate the U.S. rescue of the Jewish refugees.\n\nGemma La Guardia Gluck\n\nLa Guardia's sister, Gemma La Guardia Gluck (1881–1962), and brother-in-law, Herman Gluck (a Hungarian Jew whom she met while teaching English in Europe), were living in Hungary and were arrested by the Gestapo on June 7, 1944, when the Nazis took control of Budapest. Adolf Eichmann and Heinrich Himmler knew that Gemma was La Guardia's sister and ordered her to be held as a political prisoner. She and Herman Gluck were deported to Mauthausen concentration camp in Austria, where he died, as Gemma learned from reading a newspaper account a year after her own release. She was transferred from Mauthausen to the notorious women's concentration camp at Ravensbrück, located some fifty miles from Berlin, where unbeknownst to Gemma at the time, her daughter Yolanda (whose husband also died in the camps) and baby grandson were also held for a year in a separate barracks. Gemma Gluck, who was held in Block II of the camp and assigned prisoner #44139, was one of the few survivors of this camp and wrote about her time at Ravensbrück.\n She also wrote that the Soviets were \"violating girls and women of all ages\", and about her, her daughter's and grandson's suffering as displaced persons in postwar Berlin, where the Germans abandoned them for a possible hostage exchange in April 1945, as the Russians were advancing. Gemma and her family did not speak German, and had no identity papers, money, or means of documenting where they had been. Gemma finally managed to get word to the Americans who contacted La Guardia, who had no idea where they were. He worked to get them on the immigration lists, but asserted in a letter, included in the appendix of Gemma's memoir, that her \"case was the same as that of hundreds of thousands of displaced people\" and \"no exceptions can be made\". Thus, despite Gemma's intimate connection with a powerful American politician, who was then director of the United Nations Relief and Rehabilitation Administration (UNRRA), it took two years for her to be cleared and sent to the United States. She returned to New York in May 1947, where she was reunited with her brother only four months before he died. As he had made no provision for her, she lived in very reduced circumstances, in a public housing project in Queens, New York, until her death in 1962. Gluck is one of the few American-born women interned by the Nazis. (Another was Virginia d'Albert-Lake.)\n\nWorld War II\n\nIn 1941 during the run-up to American involvement in World War II, President Roosevelt appointed La Guardia first director of the new Office of Civilian Defense (OCD). Roosevelt was an admirer of La Guardia; after meeting Winston Churchill for the first time he described him as \"an English Mayor La Guardia\". The OCD was the national agency responsible for preparing for blackouts, air raid wardens, sirens, and shelters in case of German air raids. The government knew that such air raids were impossible but the goal was to psychologically mobilize many thousands of middle class volunteers to make them feel part of the war effort. La Guardia remained Mayor of New York, shuttling back and forth with three days in Washington and four in the city in an effort to do justice to two herculean jobs. On top of this, he still performed other gestures, such as arranging police protection with his personal assurances for local artists Joe Simon and Jack Kirby, when they were threatened by Nazi supporters for their new patriotic comic book superhero, Captain America. After the attack on Pearl Harbor in December 1941, his role was turned over to full-time director of OCD, James M. Landis. La Guardia's popularity slipped away and he ran so poorly in straw polls in 1945 that he did not run for a fourth term.Erwin Hargrove, \"The Dramas of Reform,\" in James D. Barber, ed. Political Leadership in American Government (1964), p. 94.\n\nUnemployment ended, and the city was a gateway for military supplies and soldiers sent to Europe, with the Brooklyn Navy Yard providing many of the warships and the garment trade providing uniforms. The city's great financiers, however, were less important in decision making than the policy makers in Washington, and very high wartime taxes were not offset by heavy war spending. New York was not a center of heavy industry and did not see a wartime boom, as defense plants were built elsewhere.Karl Drew Hartzell, The Empire State At War, World War II (1949) FDR refused to make La Guardia a general and was unable to provide fresh money for the city. By 1944 the city was short of funds to pay for La Guardia's new programs.Thomas Kessner, \"Fiorello H. LaGuardia\" in History Teacher (1993) 26(2): 151–159\n\nLater life and death\n\nLa Guardia was the director general for the United Nations Relief and Rehabilitation Administration (UNRRA) in 1946.\n\nA man of short stature, La Guardia's height is sometimes given as 5 ft. According to an article in The New York Times, however, his actual height was 5 ft.\n\nLa Guardia was a Freemason and was a member of Garibaldi Lodge #542, in New York City.\n\nHe died of pancreatic cancer in his home at 5020 Goodridge Avenue, in the Riverdale section of The Bronx on September 20, 1947, aged 64Jackson, Nancy Beth. [https://query.nytimes.com/gst/fullpage.html?res950CE7D91E3CF934A25751C0A9649C8B63&scp\n1&sq%22richard+simon%22+riverdale&st\nnyt \"If You're Thinking of Living In/Fieldston; A Leafy Enclave in the Hills of the Bronx\"] on September 20, 1947. The New York Times. February 17, 2002. Retrieved May 3, 2008. \"Fiorello H. La Guardia, a three-time mayor of New York, lived and died at 5020 Goodridge Avenue.\" and is interred at Woodlawn Cemetery in The Bronx, New York City.\n\nLegacy\n\nLa Guardia was ranked first among the nation's mayors in a 1993 poll of historians and social scientists. \nAccording to biographer Mason B. Williams, his close collaboration with Roosevelt's New Deal proved a striking success in linking national money and local needs.Mason B. Williams, City of Ambition: FDR, LaGuardia, and the Making of Modern New York (2014). La Guardia enabled the political recognition new groups that had been largely excluded from the political system, such as Jews and Italians.Ronald H. Bayor, Fiorello La Guardia: Ethnicity and Reform (1993). His administration (in cooperation with Robert Moses) gave New York its modern infrastructure. His far-sighted goals raised ambitions for new levels of urban possibility.  According to Thomas Kessner, trends since his tenure mean that \"people would be afraid of allowing anybody to take that kind of power\".\n\nMemorials\n\nIn 1972 the United States Postal Service honored La Guardia with a 14-cent postage stamp.\n\nNew York's LaGuardia Airport, LaGuardia Community College, and other parks and buildings around New York City are named for him.\n\nA strong supporter of Zionism, LaGuardia Street and LaGuardia interchange both in Tel Aviv, Israel, were named in his honor.\n\nKnown for his love of music, La Guardia was noted for spontaneously conducting professional and student orchestras and was instrumental in the creation of the High School of Music & Art in 1936, now renamed the Fiorello H. LaGuardia High School of Music & Art and Performing Arts.Steigman, Benjamin: Accent on TalentNew York's High School of Music & Art Wayne State University Press, 1984; pg. ???\n\nLa Guardia was a fictionalized character in many films – in Ghostbusters II La Guardia's ghost talks to New York Mayor Lenny (played by David Margulies). He was also the subject of the hit Broadway musical Fiorello!, portrayed by actor Tom Bosley and in The Little Flower, portrayed by Tony Lo Bianco. Fiorello! won a Pulitzer Prize, and ran for two years (1959–1961). Fiorello H. La Guardia. http://en.wikipedia.org/?curid=11418."
  }
}
