{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12920",
  "eid" : "057aa460-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778518438,
  "textBody" : "General Packet Radio Service (GPRS) is a packet oriented mobile data service on the 2G and 3G cellular communication system's global system for mobile communications (GSM). GPRS was originally standardized by European Telecommunications Standards Institute (ETSI) in response to the earlier CDPD and i-mode packet-switched cellular technologies. It is now maintained by the 3rd Generation Partnership Project (3GPP).[http://www.etsi.org/WebSite/homepage.aspx ETSI][http://www.3gpp.org/ 3GPP]\n\nGPRS usage is typically charged based on volume of data transferred, contrasting with circuit switched data, which is usually billed per minute of connection time. Sometimes billing time is broken down to every third of a minute. Usage above the bundle cap is charged per megabyte, speed limited, or disallowed.\n\nGPRS is a best-effort service, implying variable throughput and latency that depend on the number of other users sharing the service concurrently, as opposed to circuit switching, where a certain quality of service (QoS) is guaranteed during the connection.  In 2G systems, GPRS provides data rates of 56–114 kbit/second.[http://about.qkport.com/g/general_packet_radio_service General packet radio service from Qkport] 2G cellular technology combined with GPRS is sometimes described as 2.5G, that is, a technology between the second (2G) and third (3G) generations of mobile telephony.[http://www.funsms.net/mobile_phone_generations.htm Mobile Phone Generations from]  It provides moderate-speed data transfer, by using unused time division multiple access (TDMA) channels in, for example, the GSM system. GPRS is integrated into GSM Release 97 and newer releases.\n\nTechnical overview \n\nThe GPRS core network allows 2G, 3G and WCDMA mobile networks to transmit IP packets to external networks such as the Internet.  The GPRS system is an integrated part of the GSM network switching subsystem.\n\nServices offered \n\nGPRS extends the GSM Packet circuit switched data capabilities and makes the following services possible:\n* SMS messaging and broadcasting\n* \"Always on\" internet access\n* Multimedia messaging service (MMS)\n* Push-to-talk over cellular (PoC)\n* Instant messaging and presence—wireless village\n* Internet applications for smart devices through wireless application protocol (WAP)\n* Point-to-point (P2P) service: inter-networking with the Internet (IP)\n* Point-to-multipoint (P2M) service: point-to-multipoint multicast and point-to-multipoint group calls\n\nIf SMS over GPRS is used, an SMS transmission speed of about 30 SMS messages per minute may be achieved. This is much faster than using the ordinary SMS over GSM, whose SMS transmission speed is about 6 to 10 SMS messages per minute.\n\nProtocols supported \n\nGPRS supports the following protocols:\n* Internet Protocol (IP). In practice, built-in mobile browsers use IPv4 since IPv6 was not yet popular.\n* Point-to-Point Protocol (PPP). In this mode, PPP is often not supported by the mobile phone operator but if the mobile is used as a modem to the connected computer, PPP is used to tunnel IP to the phone. This allows an IP address to be assigned dynamically (IPCP not DHCP) to the mobile equipment.\n* X.25 connections. This is typically used for applications like wireless payment terminals, although it has been removed from the standard. X.25 can still be supported over PPP, or even over IP, but doing this requires either a network-based router to perform encapsulation or intelligence built into the end-device/terminal; e.g., user equipment (UE).\n\nWhen TCP/IP is used, each phone can have one or more IP addresses allocated. GPRS will store and forward the IP packets to the phone even during handover. The TCP handles any packet loss (e.g. due to a radio noise induced pause).\n\nHardware \n\nDevices supporting GPRS are divided into three classes:\n;Class A: Can be connected to GPRS service and GSM service (voice, SMS), using both at the same time. Such devices are known to be available today.\n;Class B: Can be connected to GPRS service and GSM service (voice, SMS), but using only one or the other at a given time. During GSM service (voice call or SMS), GPRS service is suspended, and then resumed automatically after the GSM service (voice call or SMS) has concluded. Most GPRS mobile devices are Class B.\n;Class C: Are connected to either GPRS service or GSM service (voice, SMS). Must be switched manually between one and the other service.\n\nA true Class A device may be required to transmit on two different frequencies at the same time, and thus will need two radios. To get around this expensive requirement, a GPRS mobile may implement the dual transfer mode (DTM) feature. A DTM-capable mobile may use simultaneous voice and packet data, with the network coordinating to ensure that it is not required to transmit on two different frequencies at the same time. Such mobiles are considered pseudo-Class A, sometimes referred to as \"simple class A\". Some networks support DTM since 2007.\n\nUSB 3G/GPRS modems use a terminal-like interface over USB 1.1, 2.0 and later, data formats V.42bis, and RFC 1144 and some models have connector for external antenna. Modems can be added as cards (for laptops) or external USB devices which are similar in shape and size to a computer mouse, or nowadays more like a pendrive.\n\nAddressing \n\nA GPRS connection is established by reference to its access point name (APN). The APN defines the services such as wireless application protocol (WAP)\naccess, short message service (SMS), multimedia messaging service (MMS), and for Internet communication services such as email and World Wide Web access.\n\nIn order to set up a GPRS connection for a wireless modem, a user must specify an APN, optionally a user name and password, and very rarely an IP address,  provided by the network operator.\n\nGPRS modems and modules \n\nGSM module or GPRS modules are similar to modems, but there’s one difference: the modem is an external piece of equipment, whereas the GSM module or GPRS module can be integrated within an electrical or electronic equipment. It is an embedded piece of hardware. A GSM mobile, on the other hand, is a complete embedded system in itself. It comes with embedded processors dedicated to provide a functional interface between the user and the mobile network.\n\nCoding schemes and speeds \n\nThe upload and download speeds that can be achieved in GPRS depend on a number of factors such as:\n\n* the number of BTS TDMA time slots assigned by the operator\n* the channel encoding used.\n* the maximum capability of the mobile device expressed as a GPRS multislot class\n\nMultiple access schemes \n\nThe multiple access methods used in GSM with GPRS are based on frequency division duplex (FDD) and TDMA. During a session, a user is assigned to one pair of up-link and down-link frequency channels. This is combined with time domain statistical multiplexing which makes it possible for several users to share the same frequency channel. The packets have constant length, corresponding to a GSM time slot. The down-link uses first-come first-served packet scheduling, while the up-link uses a scheme very similar to reservation ALOHA (R-ALOHA). This means that slotted ALOHA (S-ALOHA) is used for reservation inquiries during a contention phase, and then the actual data is transferred using dynamic TDMA with first-come first-served.\n\nChannel encoding \n\nThe channel encoding process in GPRS consists of two steps: first, a cyclic code is used to add parity bits, which are also referred to as the Block Check Sequence, followed by coding with a possibly punctured convolutional code. The Coding Schemes CS-1 to CS-4 specify the number of parity bits generated by the cyclic code and the puncturing rate of the convolutional code. In Coding Schemes CS-1 through CS-3, the convolutional code is of rate 1/2, i.e. each input bit is converted into two coded bits. In Coding Schemes CS-2 and CS-3, the output of the convolutional code is punctured to achieve the desired code rate. In Coding Scheme CS-4, no convolutional coding is applied. The following table summarises the options.\n\nThe least robust, but fastest, coding scheme (CS-4) is available near a base transceiver station (BTS), while the most robust coding scheme (CS-1) is used when the mobile station (MS) is further away from a BTS.\n\nUsing the CS-4 it is possible to achieve a user speed of 20.0 kbit/s per time slot. However, using this scheme the cell coverage is 25% of normal. CS-1 can achieve a user speed of only 8.0 kbit/s per time slot, but has 98% of normal coverage. Newer network equipment can adapt the transfer speed automatically depending on the mobile location.\n\nIn addition to GPRS, there are two other GSM technologies which deliver data services: circuit-switched data (CSD) and high-speed circuit-switched data (HSCSD).  In contrast to the shared nature of GPRS, these instead establish a dedicated circuit (usually billed per minute).  Some applications such as video calling may prefer HSCSD, especially when there is a continuous flow of data between the endpoints.\n\nThe following table summarises some possible configurations of GPRS and circuit switched data services.\n\nMultislot Class \n\nThe multislot class determines the speed of data transfer available in the Uplink and Downlink directions.  It is a value between 1 and 45 which the network uses to allocate radio channels in the uplink and downlink direction.  Multislot class with values greater than 31 are referred to as high multislot classes.\n\nA multislot allocation is represented as, for example, 5+2. The first number is the number of downlink timeslots and the second is the number of uplink timeslots allocated for use by the mobile station.  A commonly used value is class 10 for many GPRS/EGPRS mobiles which uses a maximum of 4 timeslots in downlink direction and 2 timeslots in uplink direction. However simultaneously a maximum number of 5 simultaneous timeslots can be used in both uplink and downlink. The network will automatically configure for either 3+2 or 4+1 operation depending on the nature of data transfer.\n\nSome high end mobiles, usually also supporting UMTS, also support GPRS/EDGE multislot class 32. According to 3GPP TS 45.002 (Release 12), Table B.1, mobile stations of this class support 5 timeslots in downlink and 3 timeslots in uplink with a maximum number of 6 simultaneously used timeslots. If data traffic is concentrated in downlink direction the network will configure the connection for 5+1 operation. When more data is transferred in the uplink the network can at any time change the constellation to 4+2 or 3+3. Under the best reception conditions, i.e. when the best EDGE modulation and coding scheme can be used, 5 timeslots can carry a bandwidth of 5*59.2 kbit/s \n 296 kbit/s. In uplink direction, 3 timeslots can carry a bandwidth of 3*59.2 kbit/s = 177.6 kbit/s.[http://mobilesociety.typepad.com/mobile_life/2007/04/gprs_and_edge_m.html GPRS and EDGE Multislot Classes]\n\nMultislot Classes for GPRS/EGPRS \n\nAttributes of a multislot class \n\nEach multislot class identifies the following:\n* the maximum number of Timeslots that can be allocated on uplink\n* the maximum number of Timeslots that can be allocated on downlink\n* the total number of timeslots which can be allocated by the network to the mobile\n* the time needed for the MS to perform adjacent cell signal level measurement and get ready to transmit\n* the time needed for the MS to get ready to transmit\n* the time needed for the MS to perform adjacent cell signal level measurement and get ready to receive\n* the time needed for the MS to get ready to receive.\n\nThe different multislot class specification is detailed in the Annex B of the 3GPP Technical Specification 45.002 (Multiplexing and multiple access on the radio path)\n\nUsability \n\nThe maximum speed of a GPRS connection offered in 2003 was similar to a modem connection in an analog wire telephone network, about 32–40 kbit/s, depending on the phone used. Latency is very high; round-trip time (RTT) is typically about 600–700 ms and often reaches 1s. GPRS is typically prioritized lower than speech, and thus the quality of connection varies greatly.\n\nDevices with latency/RTT improvements (via, for example, the extended UL TBF mode feature) are generally available. Also, network upgrades of features are available with certain operators. With these enhancements the active round-trip time can be reduced, resulting in significant increase in application-level throughput speeds.\n\nHistory of GPRS \n\nGPRS opened in 2000 as a packet-switched data service embedded to the channel-switched cellular radio network GSM. GPRS extends the reach of the fixed Internet by connecting mobile terminals worldwide.\n\nThe CELLPACBernhard Walke, Wolf Mende, Georgios Hatziliadis: “CELLPAC: A packet radio protocol applied to the cellular GSM mobile radio network”, Proceedings of 41st IEEE Vehicular Technology Conference, May 1991, 408-413. protocol developed 1991-1993 was the trigger point for starting in 1993 specification of standard GPRS by ETSI [http://www.gsma.com/aboutus/history SMG]. Especially, the CELLPAC Voice & Data functions introduced in a 1993 ETSI Workshop contributionPeter Decker, Bernhard Walke: “A General Packet Radio Service proposed for GSM”, ETSI SMG Workshop “GSM in a Future Competitive Environment”, Helsinki, Finland, Oct. 13, 1993, pp. 1-20. anticipate what was later known to be the roots of GPRS. This workshop contribution is referenced in 22 GPRS related US-Patents.Program “Publish or Perish”, see [http://www.harzing.com/pop.htm] returns to a search for P. Decker, B. Walke their most cited paper that (after double click) unveils US patents referencing that paper Successor systems to GSM/GPRS like W-CDMA (UMTS)  and LTE  rely on key GPRS functions for mobile Internet access as introduced by CELLPAC.\n\nAccording to a study on history of GPRS developmentBernhard Walke: „The Roots of GPRS: The First System for Mobile Packet-Based Global Internet Access“, IEEE Wireless Communications, Oct. 2013, 12-23. Bernhard Walke and his student Peter Decker are the inventors of GPRS – the first system providing worldwide mobile Internet access.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "General Packet Radio Service" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12920" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "General Packet Radio Service (GPRS) is a packet oriented mobile data service on the 2G and 3G cellular communication system's global system for mobile communications (GSM). GPRS was originally standardized by European Telecommunications Standards Institute (ETSI) in response to the earlier CDPD and i-mode packet-switched cellular technologies. It is now maintained by the 3rd Generation Partnership Project (3GPP).[http://www.etsi.org/WebSite/homepage.aspx ETSI][http://www.3gpp.org/ 3GPP]\n\nGPRS usage is typically charged based on volume of data transferred, contrasting with circuit switched data, which is usually billed per minute of connection time. Sometimes billing time is broken down to every third of a minute. Usage above the bundle cap is charged per megabyte, speed limited, or disallowed.\n\nGPRS is a best-effort service, implying variable throughput and latency that depend on the number of other users sharing the service concurrently, as opposed to circuit switching, where a certain quality of service (QoS) is guaranteed during the connection.  In 2G systems, GPRS provides data rates of 56–114 kbit/second.[http://about.qkport.com/g/general_packet_radio_service General packet radio service from Qkport] 2G cellular technology combined with GPRS is sometimes described as 2.5G, that is, a technology between the second (2G) and third (3G) generations of mobile telephony.[http://www.funsms.net/mobile_phone_generations.htm Mobile Phone Generations from]  It provides moderate-speed data transfer, by using unused time division multiple access (TDMA) channels in, for example, the GSM system. GPRS is integrated into GSM Release 97 and newer releases.\n\nTechnical overview \n\nThe GPRS core network allows 2G, 3G and WCDMA mobile networks to transmit IP packets to external networks such as the Internet.  The GPRS system is an integrated part of the GSM network switching subsystem.\n\nServices offered \n\nGPRS extends the GSM Packet circuit switched data capabilities and makes the following services possible:\n* SMS messaging and broadcasting\n* \"Always on\" internet access\n* Multimedia messaging service (MMS)\n* Push-to-talk over cellular (PoC)\n* Instant messaging and presence—wireless village\n* Internet applications for smart devices through wireless application protocol (WAP)\n* Point-to-point (P2P) service: inter-networking with the Internet (IP)\n* Point-to-multipoint (P2M) service: point-to-multipoint multicast and point-to-multipoint group calls\n\nIf SMS over GPRS is used, an SMS transmission speed of about 30 SMS messages per minute may be achieved. This is much faster than using the ordinary SMS over GSM, whose SMS transmission speed is about 6 to 10 SMS messages per minute.\n\nProtocols supported \n\nGPRS supports the following protocols:\n* Internet Protocol (IP). In practice, built-in mobile browsers use IPv4 since IPv6 was not yet popular.\n* Point-to-Point Protocol (PPP). In this mode, PPP is often not supported by the mobile phone operator but if the mobile is used as a modem to the connected computer, PPP is used to tunnel IP to the phone. This allows an IP address to be assigned dynamically (IPCP not DHCP) to the mobile equipment.\n* X.25 connections. This is typically used for applications like wireless payment terminals, although it has been removed from the standard. X.25 can still be supported over PPP, or even over IP, but doing this requires either a network-based router to perform encapsulation or intelligence built into the end-device/terminal; e.g., user equipment (UE).\n\nWhen TCP/IP is used, each phone can have one or more IP addresses allocated. GPRS will store and forward the IP packets to the phone even during handover. The TCP handles any packet loss (e.g. due to a radio noise induced pause).\n\nHardware \n\nDevices supporting GPRS are divided into three classes:\n;Class A: Can be connected to GPRS service and GSM service (voice, SMS), using both at the same time. Such devices are known to be available today.\n;Class B: Can be connected to GPRS service and GSM service (voice, SMS), but using only one or the other at a given time. During GSM service (voice call or SMS), GPRS service is suspended, and then resumed automatically after the GSM service (voice call or SMS) has concluded. Most GPRS mobile devices are Class B.\n;Class C: Are connected to either GPRS service or GSM service (voice, SMS). Must be switched manually between one and the other service.\n\nA true Class A device may be required to transmit on two different frequencies at the same time, and thus will need two radios. To get around this expensive requirement, a GPRS mobile may implement the dual transfer mode (DTM) feature. A DTM-capable mobile may use simultaneous voice and packet data, with the network coordinating to ensure that it is not required to transmit on two different frequencies at the same time. Such mobiles are considered pseudo-Class A, sometimes referred to as \"simple class A\". Some networks support DTM since 2007.\n\nUSB 3G/GPRS modems use a terminal-like interface over USB 1.1, 2.0 and later, data formats V.42bis, and RFC 1144 and some models have connector for external antenna. Modems can be added as cards (for laptops) or external USB devices which are similar in shape and size to a computer mouse, or nowadays more like a pendrive.\n\nAddressing \n\nA GPRS connection is established by reference to its access point name (APN). The APN defines the services such as wireless application protocol (WAP)\naccess, short message service (SMS), multimedia messaging service (MMS), and for Internet communication services such as email and World Wide Web access.\n\nIn order to set up a GPRS connection for a wireless modem, a user must specify an APN, optionally a user name and password, and very rarely an IP address,  provided by the network operator.\n\nGPRS modems and modules \n\nGSM module or GPRS modules are similar to modems, but there’s one difference: the modem is an external piece of equipment, whereas the GSM module or GPRS module can be integrated within an electrical or electronic equipment. It is an embedded piece of hardware. A GSM mobile, on the other hand, is a complete embedded system in itself. It comes with embedded processors dedicated to provide a functional interface between the user and the mobile network.\n\nCoding schemes and speeds \n\nThe upload and download speeds that can be achieved in GPRS depend on a number of factors such as:\n\n* the number of BTS TDMA time slots assigned by the operator\n* the channel encoding used.\n* the maximum capability of the mobile device expressed as a GPRS multislot class\n\nMultiple access schemes \n\nThe multiple access methods used in GSM with GPRS are based on frequency division duplex (FDD) and TDMA. During a session, a user is assigned to one pair of up-link and down-link frequency channels. This is combined with time domain statistical multiplexing which makes it possible for several users to share the same frequency channel. The packets have constant length, corresponding to a GSM time slot. The down-link uses first-come first-served packet scheduling, while the up-link uses a scheme very similar to reservation ALOHA (R-ALOHA). This means that slotted ALOHA (S-ALOHA) is used for reservation inquiries during a contention phase, and then the actual data is transferred using dynamic TDMA with first-come first-served.\n\nChannel encoding \n\nThe channel encoding process in GPRS consists of two steps: first, a cyclic code is used to add parity bits, which are also referred to as the Block Check Sequence, followed by coding with a possibly punctured convolutional code. The Coding Schemes CS-1 to CS-4 specify the number of parity bits generated by the cyclic code and the puncturing rate of the convolutional code. In Coding Schemes CS-1 through CS-3, the convolutional code is of rate 1/2, i.e. each input bit is converted into two coded bits. In Coding Schemes CS-2 and CS-3, the output of the convolutional code is punctured to achieve the desired code rate. In Coding Scheme CS-4, no convolutional coding is applied. The following table summarises the options.\n\nThe least robust, but fastest, coding scheme (CS-4) is available near a base transceiver station (BTS), while the most robust coding scheme (CS-1) is used when the mobile station (MS) is further away from a BTS.\n\nUsing the CS-4 it is possible to achieve a user speed of 20.0 kbit/s per time slot. However, using this scheme the cell coverage is 25% of normal. CS-1 can achieve a user speed of only 8.0 kbit/s per time slot, but has 98% of normal coverage. Newer network equipment can adapt the transfer speed automatically depending on the mobile location.\n\nIn addition to GPRS, there are two other GSM technologies which deliver data services: circuit-switched data (CSD) and high-speed circuit-switched data (HSCSD).  In contrast to the shared nature of GPRS, these instead establish a dedicated circuit (usually billed per minute).  Some applications such as video calling may prefer HSCSD, especially when there is a continuous flow of data between the endpoints.\n\nThe following table summarises some possible configurations of GPRS and circuit switched data services.\n\nMultislot Class \n\nThe multislot class determines the speed of data transfer available in the Uplink and Downlink directions.  It is a value between 1 and 45 which the network uses to allocate radio channels in the uplink and downlink direction.  Multislot class with values greater than 31 are referred to as high multislot classes.\n\nA multislot allocation is represented as, for example, 5+2. The first number is the number of downlink timeslots and the second is the number of uplink timeslots allocated for use by the mobile station.  A commonly used value is class 10 for many GPRS/EGPRS mobiles which uses a maximum of 4 timeslots in downlink direction and 2 timeslots in uplink direction. However simultaneously a maximum number of 5 simultaneous timeslots can be used in both uplink and downlink. The network will automatically configure for either 3+2 or 4+1 operation depending on the nature of data transfer.\n\nSome high end mobiles, usually also supporting UMTS, also support GPRS/EDGE multislot class 32. According to 3GPP TS 45.002 (Release 12), Table B.1, mobile stations of this class support 5 timeslots in downlink and 3 timeslots in uplink with a maximum number of 6 simultaneously used timeslots. If data traffic is concentrated in downlink direction the network will configure the connection for 5+1 operation. When more data is transferred in the uplink the network can at any time change the constellation to 4+2 or 3+3. Under the best reception conditions, i.e. when the best EDGE modulation and coding scheme can be used, 5 timeslots can carry a bandwidth of 5*59.2 kbit/s \n 296 kbit/s. In uplink direction, 3 timeslots can carry a bandwidth of 3*59.2 kbit/s = 177.6 kbit/s.[http://mobilesociety.typepad.com/mobile_life/2007/04/gprs_and_edge_m.html GPRS and EDGE Multislot Classes]\n\nMultislot Classes for GPRS/EGPRS \n\nAttributes of a multislot class \n\nEach multislot class identifies the following:\n* the maximum number of Timeslots that can be allocated on uplink\n* the maximum number of Timeslots that can be allocated on downlink\n* the total number of timeslots which can be allocated by the network to the mobile\n* the time needed for the MS to perform adjacent cell signal level measurement and get ready to transmit\n* the time needed for the MS to get ready to transmit\n* the time needed for the MS to perform adjacent cell signal level measurement and get ready to receive\n* the time needed for the MS to get ready to receive.\n\nThe different multislot class specification is detailed in the Annex B of the 3GPP Technical Specification 45.002 (Multiplexing and multiple access on the radio path)\n\nUsability \n\nThe maximum speed of a GPRS connection offered in 2003 was similar to a modem connection in an analog wire telephone network, about 32–40 kbit/s, depending on the phone used. Latency is very high; round-trip time (RTT) is typically about 600–700 ms and often reaches 1s. GPRS is typically prioritized lower than speech, and thus the quality of connection varies greatly.\n\nDevices with latency/RTT improvements (via, for example, the extended UL TBF mode feature) are generally available. Also, network upgrades of features are available with certain operators. With these enhancements the active round-trip time can be reduced, resulting in significant increase in application-level throughput speeds.\n\nHistory of GPRS \n\nGPRS opened in 2000 as a packet-switched data service embedded to the channel-switched cellular radio network GSM. GPRS extends the reach of the fixed Internet by connecting mobile terminals worldwide.\n\nThe CELLPACBernhard Walke, Wolf Mende, Georgios Hatziliadis: “CELLPAC: A packet radio protocol applied to the cellular GSM mobile radio network”, Proceedings of 41st IEEE Vehicular Technology Conference, May 1991, 408-413. protocol developed 1991-1993 was the trigger point for starting in 1993 specification of standard GPRS by ETSI [http://www.gsma.com/aboutus/history SMG]. Especially, the CELLPAC Voice & Data functions introduced in a 1993 ETSI Workshop contributionPeter Decker, Bernhard Walke: “A General Packet Radio Service proposed for GSM”, ETSI SMG Workshop “GSM in a Future Competitive Environment”, Helsinki, Finland, Oct. 13, 1993, pp. 1-20. anticipate what was later known to be the roots of GPRS. This workshop contribution is referenced in 22 GPRS related US-Patents.Program “Publish or Perish”, see [http://www.harzing.com/pop.htm] returns to a search for P. Decker, B. Walke their most cited paper that (after double click) unveils US patents referencing that paper Successor systems to GSM/GPRS like W-CDMA (UMTS)  and LTE  rely on key GPRS functions for mobile Internet access as introduced by CELLPAC.\n\nAccording to a study on history of GPRS developmentBernhard Walke: „The Roots of GPRS: The First System for Mobile Packet-Based Global Internet Access“, IEEE Wireless Communications, Oct. 2013, 12-23. Bernhard Walke and his student Peter Decker are the inventors of GPRS – the first system providing worldwide mobile Internet access. General Packet Radio Service. http://en.wikipedia.org/?curid=12920."
  }
}
