{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13305",
  "eid" : "08329870-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778522999,
  "textBody" : "The Republic of Turkey was created after the overthrow of Sultan Mehmet VI Vahdettin by the new Republican Parliament in 1922. This new regime delivered the coup de grâce to the Ottoman state which had been practically wiped away from the world stage following the First World War.\n\nSingle-party period (1923–1946)\n\nAtatürk era (1923–1938)\n\nThe history of modern Turkey begins with the foundation of the republic on October 29, 1923, with Mustafa Kemal (Atatürk) as its first president. The government was formed from the Ankara-based revolutionary group, led by Mustafa Kemal Atatürk and his colleagues. The second constitution was ratified by the Grand National Assembly on April 20, 1924.\n\nFor about the next 10 years, the country saw a steady process of secular Westernization through Atatürk's Reforms, which included the unification of education; the discontinuation of religious and other titles; the closure of Islamic courts and the replacement of Islamic canon law with a secular civil code modeled after Switzerland's and a penal code modeled after the Italian Penal Code; recognition of the equality between the sexes and the granting of full political rights to women on 5 December 1934; the language reform initiated by the newly founded Turkish Language Association; replacement of the Ottoman Turkish alphabet with the new Turkish alphabet derived from the Latin alphabet; the dress law (the wearing of a fez, is outlawed); the law on family names; and many others.\n\nChronology of Major Kemalist Reforms:Webster, The Turkey of Atatürk: social process in the Turkish reformation\n*November 1, 1922: Abolition of the office of the Ottoman Sultan.\n*October 29, 1923: Proclamation of the Republic of Turkey.\n*March 3, 1924: Abolition of the office of Caliphate held by the Ottoman Caliphate.\n*November 25, 1925: Change of headgear and dress.\n*November 30, 1925: Closure of religious convents and dervish lodges.\n*March 1, 1926: Introduction of the new penal law.\n*October 4, 1926: Introduction of the new civil code.\n*November 1, 1928: Adoption of the new Turkish alphabet.\n*June 21, 1934: Introduction of the law on family names.\n*November 26, 1934: Abolition of titles and by-names.\n*December 5, 1934: Full political rights, to vote and be elected, to women.\n*February 5, 1937: The inclusion of the principle of laïcité in the constitution.\n\nThe first party to be established in the newly formed republic was the Women's Party (Kadınlar Halk Fırkası).Zihnioğlu, Yaprak. Kadınsız İnkılap. Metis Yayınları, 2003. It was founded by Nezihe Muhiddin and several other women but was stopped from its activities, since during the time women were not yet legally allowed to engage in politics.Çakır, Serpil. Osmanlı Kadın Hareketi. Metis Yayınları, 1994. The actual passage to multi-party period was first attempted with the Liberal Republican Party by Ali Fethi Okyar. The Liberal Republican Party was dissolved on 17 November 1930 and no further attempt for a multi-party democracy was made until 1945. Turkey was admitted to the League of Nations in July 1932.\n\nPost-Ataturk era (1938–1946)\n\nAtatürk's successor after his death on November 10, 1938 was İsmet İnönü. He started his term in the office as a respected figure of the Independence War but because of internal fights between power groups and external events like the World War which caused a lack of goods in the country, he lost some of his popularity and support.\n\nWorld War II (1939–1945)\n\nAfter failing in 1939 to get a defensive alliance against Germany with Britain, Turkey maintained neutrality during the war (1939–45). Ambassadors from the Axis powers and Allies intermingled in Ankara.For example, see this 1942 [https://books.google.com/books?idJUAEAAAAMBAJ&lpg\nPA4&pgPA45#v\nonepage&q&f=true Life magazine photograph] İnönü signed a non-aggression treaty with Nazi Germany on June 18, 1941, 4 days before the Axis powers invaded the Soviet Union.\n\nNationalist magazines Bozrukat and Chinar Altu called for the declaration of war against the Soviet Union. In July 1942, Bozrukat published a map of Greater Turkey, which included Soviet controlled Caucasus and central Asian republics.\n\nIn August 1942, during talks with the German ambassador, Turkish prime minister Şükrü Saracoğlu stated: \"The Russian problem can only be solved in case half the Russian population is exterminated.\"\n\nIn the summer of 1942, Turkish high command considered war with the Soviet Union almost unavoidable. An operation was planned, with Baku being the initial target.\n\nTurkey traded with both sides and purchased arms from both sides. The Allies tried to stop German purchases of chrome (used in making better steel).  Inflation was high as prices doubled.Erik J. Zurcher, Turkey: A Modern History (3rd ed. 2004) pp 203-5A. C. Edwards, \"The Impact of the War on Turkey,\" International Affairs (1946) 22#3 pp. 389-400 [https://www.jstor.org/stable/3017044 in JSTOR]\n\nBy August 1944, the Axis was clearly losing the war and Turkey broke off relations. Only in February 1945, Turkey declared war on Germany and Japan, a symbolic move that allowed Turkey to join the future United Nations.\n\nOn October 24, 1945 Turkey signed the United Nations Charter as one of the fifty-one original members.\n\nMulti-party transition (1946)\n\nIn 1946, İnönü's government organized multi-party elections, which were won by his party. He remained as the president of the country until 1950. He is still remembered as one of the key figures of Turkey.\n\nMulti-party period, 1946–present\n\nEarly period (1946–1987)\n\nAlthough the multi-party period began in 1946, the election of the Democratic Party government in May 1950 marked the first victory by a non-CHP party.\n\nThe government of Adnan Menderes (1950-1960) proved very popular at first, relaxing the restrictions on Islam and presiding over a booming economy. In the latter half of the 1950s, however, the economy began to fail and the government introduced censorship laws limiting dissent. The government became plagued by high inflation and a massive debt.\n\nMilitary coup\n\nOn May 27, 1960, General Cemal Gürsel led a military coup d'état, removing President Celal Bayar and Prime Minister Menderes, the second of whom was executed. The system returned to civilian control in October 1961. A fractured political system emerged in the wake of the 1960 coup, producing a series of unstable government coalitions in parliament alternating between the Justice Party of Süleyman Demirel on the right and the Republican People's Party of İsmet İnönü and Bülent Ecevit on the left.\n\nThe army issued a memorandum warning the civilian government in 1971, leading to another coup which resulted in the fall of the Demirel government and the establishment of interim governments.\n\nIn July 1974, under Prime Minister Ecevit in coalition with the religious National Salvation Party, Turkey carried out the invasion of Cyprus.\n\nThe governments of the National Front, a series of coalitions between rightist parties, followed as Ecevit was not able to remain in office despite ranking first in the elections. The fractured political scene and poor economy led to mounting violence between ultranationalists and communists in the streets of Turkey's cities, resulting in some 5,000 deaths during the late 1970s.\n\nA military coup d'état, headed by General Kenan Evren, took place in 1980. Martial law was extended from 20 to all then existing 67 provinces of Turkey.\nAmnesty International: Turkey Briefing, London, November 1988, AI Index Eur/44/65/88, , page 1; [http://ob.nubati.net/wiki/Illustrated_Reports_of_Amnesty_International#Turkey_Briefing] an online edition with scanned pages; accessed on 31 October 2009\n Within two years, the military returned the government to civilian hands, although retaining close control of the political scene. The political system came under one-party governance under the Motherland Party (ANAP) of Turgut Özal (Prime Minister from 1983 to 1989). The ANAP combined a globally oriented economic program with the promotion of conservative social values. Under Özal, the economy boomed, converting towns like Gaziantep from small provincial capitals into mid-sized economic boomtowns. Military rule began to be phased out at the end of 1983.[http://ob.nubati.net/en/campaign.php Amnesty International: Human Rights Denied], London, November 1988, AI Index Eur/44/65/88\n  In particular in provinces in the south-east of Turkey it was replaced by a state of emergency. In 1985 the government established village guards (local paramilitary militias) to oppose separatist Kurdish groups.\n\nPolitical instability (1987–2002)\n\nStarting in July 1987, the South-East was submitted to state of emergency legislation, a measure which lasted until November 2002. With the turn of the 1990s, political instability returned. The 1995 elections brought a short-lived coalition between Mesut Yılmaz's ANAP and the True Path Party, now with Tansu Çiller at the helm.\n\nIn 1997, the military, citing his government's support for religious policies deemed dangerous to Turkey's secular nature, sent a memorandum to Prime Minister Necmettin Erbakan requesting that he resign, which he did. The event has been famously labelled a \"postmodern coup\" by the Turkish admiral Salim Dervişoğlu. Shortly thereafter, the Welfare Party (RP) was banned and reborn as the Virtue Party (FP). A new government was formed by ANAP and Ecevit's Democratic Left Party (DSP) supported from the outside by the center-left Republican People's Party (CHP), led by Deniz Baykal. The DSP became the largest parliamentary party in the 1999 elections. Second place went to the far-right Nationalist Movement Party (MHP). These two parties, alongside Yılmaz's ANAP formed a government. The government was somewhat effective, if not harmonious, bringing about much-needed economic reform, instituting human rights legislation, and bringing Turkey ever closer to the European Union.\n\nAKP government (2002–present)\n\nA series of economic shocks led to new elections in 2002, bringing into power the conservative Justice and Development Party (AKP) of the former mayor of Istanbul, Recep Tayyip Erdoğan. The political reforms of the AKP have ensured the beginning of the negotiations with the European Union. The AKP again won the 2007 elections, which followed the controversial August 2007 presidential election, during which AKP member Abdullah Gül was elected President at the third round. Recent developments in Iraq (explained under positions on terrorism and security), secular and religious concerns, the intervention of the military in political issues, relations with the EU, the United States, and the Muslim world were the main issues. The outcome of this election, which brought the Turkish and Kurdish ethnic/nationalist parties (MHP and DTP) into the parliament, will affect Turkey's bid for the European Union membership, as Turkish perceptions of the current process (or lack thereof) affected the results and will continue to affect policy making in coming years.\n\nAKP is the only government in Turkish political history that has managed to win three general elections in a row with an increasing amount of votes received in each one. The AKP has positioned itself in the midpoint of the Turkish political scene, much thanks to the stability brought by steady economic growth since they came to power in 2002. A large part of the population have welcomed the end of the political and economic instability of the 1990s, often associated with coalition governments - see Economic history of Turkey. 2011 figures showed a 9% GDP growth for Turkey.\n\nAlleged members of a clandestine group called Ergenekon were detained in 2008 as part of a long and complex trial.  Members are accused of terrorism and of plotting to overthrow the civilian government.\n\nOn 22 February 2010 more than 40 officers were arrested and formally charged with attempting to overthrow the government with respect to so-called \"Sledgehammer\" plot. The accused included four admirals, a general and two colonels, some of them retired, including former commanders of the Turkish navy and air force (three days later, the former commanders of the navy and air force were released).\n\nAlthough the 2013 protests in Turkey started as a response against the removal of Taksim Gezi Park in Istanbul, they have sparked riots across the country in cities such as Izmir and Ankara as well.\n\nIn the Turkish parliamentary elections of 1 November 2015, the Justice and Development Party (AKP) won back the absolute majority in parliament: 317 of the 550 seats. CHP won 134 seats, HDP 59 seats, MHP 40 seats.\n\n2016 attempted coup and aftermath\n\nOn 15 July 2016 factions within the Turkish Military attempted to overthrow President Recep Tayyip Erdoğan, citing growing non-secularism and censorship as motivation for the attempted coup. The coup was blamed on the influence of the vast network led by U.S.-based Muslim cleric Fethullah Gülen.\n\nIn the aftermath of the failed coup, major purges have occurred, including that of military officials, police officers, judges, governors and civil servants. There has also been significant media purge in the aftermath of the failed coup. There has been allegations of torture in connection with these purges.\n\nAKP–Gülen alliance and \"Ergenekon\" \n\nAs opposed to previous political interventions by the Turkish military, Turkey's AKP government and pro-government media maintain that the 15 July 2016 coup attempt was not motivated by allegiance to Kemalist ideology, but rather to the vast political, economic, and religious network led by U.S.-based Muslim cleric Fethullah Gülen.\n\n2016-7 purges \n\nA purge has seen over 45,000 military officials, police officers, judges, governors and civil servants arrested or suspended, including 2,700 judges, 15,000 teachers, and every university dean in the country. 163 generals and admirals were detained, around 45% of the Turkish military's total.\n\nThe sheer number of these arrests made at such a speed could only be done so if the \"Turkish government had all those lists ready\", as suggested by Johannes Hahn, European Commissioner for Enlargement and European Neighbourhood Policy, on 18 July 2016. Hahn also claimed that because these lists were already available immediately after the coup, the \"event was prepared\" and the lists were to be used \"at a certain stage\".\n\nTurkey's media purge after the coup d'état attempt resulted in the shutdown of at least 131 media outlets and the arrest of 117 journalists – at least 35 of whom have been indicted for \"membership in a terror group\".\n\nTorture in the aftermath \n\nAccording to Amnesty International, detainees in Turkey have been denied access to legal counsel, have been beaten and tortured, and have not been provided with adequate food, water, or medical care, in the aftermath of the failed coup. At least one has attempted suicide. Amnesty International wanted the European Committee for the Prevention of Torture to send people to check on detainees conditions.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "History of the Republic of Turkey" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13305" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Republic of Turkey was created after the overthrow of Sultan Mehmet VI Vahdettin by the new Republican Parliament in 1922. This new regime delivered the coup de grâce to the Ottoman state which had been practically wiped away from the world stage following the First World War.\n\nSingle-party period (1923–1946)\n\nAtatürk era (1923–1938)\n\nThe history of modern Turkey begins with the foundation of the republic on October 29, 1923, with Mustafa Kemal (Atatürk) as its first president. The government was formed from the Ankara-based revolutionary group, led by Mustafa Kemal Atatürk and his colleagues. The second constitution was ratified by the Grand National Assembly on April 20, 1924.\n\nFor about the next 10 years, the country saw a steady process of secular Westernization through Atatürk's Reforms, which included the unification of education; the discontinuation of religious and other titles; the closure of Islamic courts and the replacement of Islamic canon law with a secular civil code modeled after Switzerland's and a penal code modeled after the Italian Penal Code; recognition of the equality between the sexes and the granting of full political rights to women on 5 December 1934; the language reform initiated by the newly founded Turkish Language Association; replacement of the Ottoman Turkish alphabet with the new Turkish alphabet derived from the Latin alphabet; the dress law (the wearing of a fez, is outlawed); the law on family names; and many others.\n\nChronology of Major Kemalist Reforms:Webster, The Turkey of Atatürk: social process in the Turkish reformation\n*November 1, 1922: Abolition of the office of the Ottoman Sultan.\n*October 29, 1923: Proclamation of the Republic of Turkey.\n*March 3, 1924: Abolition of the office of Caliphate held by the Ottoman Caliphate.\n*November 25, 1925: Change of headgear and dress.\n*November 30, 1925: Closure of religious convents and dervish lodges.\n*March 1, 1926: Introduction of the new penal law.\n*October 4, 1926: Introduction of the new civil code.\n*November 1, 1928: Adoption of the new Turkish alphabet.\n*June 21, 1934: Introduction of the law on family names.\n*November 26, 1934: Abolition of titles and by-names.\n*December 5, 1934: Full political rights, to vote and be elected, to women.\n*February 5, 1937: The inclusion of the principle of laïcité in the constitution.\n\nThe first party to be established in the newly formed republic was the Women's Party (Kadınlar Halk Fırkası).Zihnioğlu, Yaprak. Kadınsız İnkılap. Metis Yayınları, 2003. It was founded by Nezihe Muhiddin and several other women but was stopped from its activities, since during the time women were not yet legally allowed to engage in politics.Çakır, Serpil. Osmanlı Kadın Hareketi. Metis Yayınları, 1994. The actual passage to multi-party period was first attempted with the Liberal Republican Party by Ali Fethi Okyar. The Liberal Republican Party was dissolved on 17 November 1930 and no further attempt for a multi-party democracy was made until 1945. Turkey was admitted to the League of Nations in July 1932.\n\nPost-Ataturk era (1938–1946)\n\nAtatürk's successor after his death on November 10, 1938 was İsmet İnönü. He started his term in the office as a respected figure of the Independence War but because of internal fights between power groups and external events like the World War which caused a lack of goods in the country, he lost some of his popularity and support.\n\nWorld War II (1939–1945)\n\nAfter failing in 1939 to get a defensive alliance against Germany with Britain, Turkey maintained neutrality during the war (1939–45). Ambassadors from the Axis powers and Allies intermingled in Ankara.For example, see this 1942 [https://books.google.com/books?idJUAEAAAAMBAJ&lpg\nPA4&pgPA45#v\nonepage&q&f=true Life magazine photograph] İnönü signed a non-aggression treaty with Nazi Germany on June 18, 1941, 4 days before the Axis powers invaded the Soviet Union.\n\nNationalist magazines Bozrukat and Chinar Altu called for the declaration of war against the Soviet Union. In July 1942, Bozrukat published a map of Greater Turkey, which included Soviet controlled Caucasus and central Asian republics.\n\nIn August 1942, during talks with the German ambassador, Turkish prime minister Şükrü Saracoğlu stated: \"The Russian problem can only be solved in case half the Russian population is exterminated.\"\n\nIn the summer of 1942, Turkish high command considered war with the Soviet Union almost unavoidable. An operation was planned, with Baku being the initial target.\n\nTurkey traded with both sides and purchased arms from both sides. The Allies tried to stop German purchases of chrome (used in making better steel).  Inflation was high as prices doubled.Erik J. Zurcher, Turkey: A Modern History (3rd ed. 2004) pp 203-5A. C. Edwards, \"The Impact of the War on Turkey,\" International Affairs (1946) 22#3 pp. 389-400 [https://www.jstor.org/stable/3017044 in JSTOR]\n\nBy August 1944, the Axis was clearly losing the war and Turkey broke off relations. Only in February 1945, Turkey declared war on Germany and Japan, a symbolic move that allowed Turkey to join the future United Nations.\n\nOn October 24, 1945 Turkey signed the United Nations Charter as one of the fifty-one original members.\n\nMulti-party transition (1946)\n\nIn 1946, İnönü's government organized multi-party elections, which were won by his party. He remained as the president of the country until 1950. He is still remembered as one of the key figures of Turkey.\n\nMulti-party period, 1946–present\n\nEarly period (1946–1987)\n\nAlthough the multi-party period began in 1946, the election of the Democratic Party government in May 1950 marked the first victory by a non-CHP party.\n\nThe government of Adnan Menderes (1950-1960) proved very popular at first, relaxing the restrictions on Islam and presiding over a booming economy. In the latter half of the 1950s, however, the economy began to fail and the government introduced censorship laws limiting dissent. The government became plagued by high inflation and a massive debt.\n\nMilitary coup\n\nOn May 27, 1960, General Cemal Gürsel led a military coup d'état, removing President Celal Bayar and Prime Minister Menderes, the second of whom was executed. The system returned to civilian control in October 1961. A fractured political system emerged in the wake of the 1960 coup, producing a series of unstable government coalitions in parliament alternating between the Justice Party of Süleyman Demirel on the right and the Republican People's Party of İsmet İnönü and Bülent Ecevit on the left.\n\nThe army issued a memorandum warning the civilian government in 1971, leading to another coup which resulted in the fall of the Demirel government and the establishment of interim governments.\n\nIn July 1974, under Prime Minister Ecevit in coalition with the religious National Salvation Party, Turkey carried out the invasion of Cyprus.\n\nThe governments of the National Front, a series of coalitions between rightist parties, followed as Ecevit was not able to remain in office despite ranking first in the elections. The fractured political scene and poor economy led to mounting violence between ultranationalists and communists in the streets of Turkey's cities, resulting in some 5,000 deaths during the late 1970s.\n\nA military coup d'état, headed by General Kenan Evren, took place in 1980. Martial law was extended from 20 to all then existing 67 provinces of Turkey.\nAmnesty International: Turkey Briefing, London, November 1988, AI Index Eur/44/65/88, , page 1; [http://ob.nubati.net/wiki/Illustrated_Reports_of_Amnesty_International#Turkey_Briefing] an online edition with scanned pages; accessed on 31 October 2009\n Within two years, the military returned the government to civilian hands, although retaining close control of the political scene. The political system came under one-party governance under the Motherland Party (ANAP) of Turgut Özal (Prime Minister from 1983 to 1989). The ANAP combined a globally oriented economic program with the promotion of conservative social values. Under Özal, the economy boomed, converting towns like Gaziantep from small provincial capitals into mid-sized economic boomtowns. Military rule began to be phased out at the end of 1983.[http://ob.nubati.net/en/campaign.php Amnesty International: Human Rights Denied], London, November 1988, AI Index Eur/44/65/88\n  In particular in provinces in the south-east of Turkey it was replaced by a state of emergency. In 1985 the government established village guards (local paramilitary militias) to oppose separatist Kurdish groups.\n\nPolitical instability (1987–2002)\n\nStarting in July 1987, the South-East was submitted to state of emergency legislation, a measure which lasted until November 2002. With the turn of the 1990s, political instability returned. The 1995 elections brought a short-lived coalition between Mesut Yılmaz's ANAP and the True Path Party, now with Tansu Çiller at the helm.\n\nIn 1997, the military, citing his government's support for religious policies deemed dangerous to Turkey's secular nature, sent a memorandum to Prime Minister Necmettin Erbakan requesting that he resign, which he did. The event has been famously labelled a \"postmodern coup\" by the Turkish admiral Salim Dervişoğlu. Shortly thereafter, the Welfare Party (RP) was banned and reborn as the Virtue Party (FP). A new government was formed by ANAP and Ecevit's Democratic Left Party (DSP) supported from the outside by the center-left Republican People's Party (CHP), led by Deniz Baykal. The DSP became the largest parliamentary party in the 1999 elections. Second place went to the far-right Nationalist Movement Party (MHP). These two parties, alongside Yılmaz's ANAP formed a government. The government was somewhat effective, if not harmonious, bringing about much-needed economic reform, instituting human rights legislation, and bringing Turkey ever closer to the European Union.\n\nAKP government (2002–present)\n\nA series of economic shocks led to new elections in 2002, bringing into power the conservative Justice and Development Party (AKP) of the former mayor of Istanbul, Recep Tayyip Erdoğan. The political reforms of the AKP have ensured the beginning of the negotiations with the European Union. The AKP again won the 2007 elections, which followed the controversial August 2007 presidential election, during which AKP member Abdullah Gül was elected President at the third round. Recent developments in Iraq (explained under positions on terrorism and security), secular and religious concerns, the intervention of the military in political issues, relations with the EU, the United States, and the Muslim world were the main issues. The outcome of this election, which brought the Turkish and Kurdish ethnic/nationalist parties (MHP and DTP) into the parliament, will affect Turkey's bid for the European Union membership, as Turkish perceptions of the current process (or lack thereof) affected the results and will continue to affect policy making in coming years.\n\nAKP is the only government in Turkish political history that has managed to win three general elections in a row with an increasing amount of votes received in each one. The AKP has positioned itself in the midpoint of the Turkish political scene, much thanks to the stability brought by steady economic growth since they came to power in 2002. A large part of the population have welcomed the end of the political and economic instability of the 1990s, often associated with coalition governments - see Economic history of Turkey. 2011 figures showed a 9% GDP growth for Turkey.\n\nAlleged members of a clandestine group called Ergenekon were detained in 2008 as part of a long and complex trial.  Members are accused of terrorism and of plotting to overthrow the civilian government.\n\nOn 22 February 2010 more than 40 officers were arrested and formally charged with attempting to overthrow the government with respect to so-called \"Sledgehammer\" plot. The accused included four admirals, a general and two colonels, some of them retired, including former commanders of the Turkish navy and air force (three days later, the former commanders of the navy and air force were released).\n\nAlthough the 2013 protests in Turkey started as a response against the removal of Taksim Gezi Park in Istanbul, they have sparked riots across the country in cities such as Izmir and Ankara as well.\n\nIn the Turkish parliamentary elections of 1 November 2015, the Justice and Development Party (AKP) won back the absolute majority in parliament: 317 of the 550 seats. CHP won 134 seats, HDP 59 seats, MHP 40 seats.\n\n2016 attempted coup and aftermath\n\nOn 15 July 2016 factions within the Turkish Military attempted to overthrow President Recep Tayyip Erdoğan, citing growing non-secularism and censorship as motivation for the attempted coup. The coup was blamed on the influence of the vast network led by U.S.-based Muslim cleric Fethullah Gülen.\n\nIn the aftermath of the failed coup, major purges have occurred, including that of military officials, police officers, judges, governors and civil servants. There has also been significant media purge in the aftermath of the failed coup. There has been allegations of torture in connection with these purges.\n\nAKP–Gülen alliance and \"Ergenekon\" \n\nAs opposed to previous political interventions by the Turkish military, Turkey's AKP government and pro-government media maintain that the 15 July 2016 coup attempt was not motivated by allegiance to Kemalist ideology, but rather to the vast political, economic, and religious network led by U.S.-based Muslim cleric Fethullah Gülen.\n\n2016-7 purges \n\nA purge has seen over 45,000 military officials, police officers, judges, governors and civil servants arrested or suspended, including 2,700 judges, 15,000 teachers, and every university dean in the country. 163 generals and admirals were detained, around 45% of the Turkish military's total.\n\nThe sheer number of these arrests made at such a speed could only be done so if the \"Turkish government had all those lists ready\", as suggested by Johannes Hahn, European Commissioner for Enlargement and European Neighbourhood Policy, on 18 July 2016. Hahn also claimed that because these lists were already available immediately after the coup, the \"event was prepared\" and the lists were to be used \"at a certain stage\".\n\nTurkey's media purge after the coup d'état attempt resulted in the shutdown of at least 131 media outlets and the arrest of 117 journalists – at least 35 of whom have been indicted for \"membership in a terror group\".\n\nTorture in the aftermath \n\nAccording to Amnesty International, detainees in Turkey have been denied access to legal counsel, have been beaten and tortured, and have not been provided with adequate food, water, or medical care, in the aftermath of the failed coup. At least one has attempted suicide. Amnesty International wanted the European Committee for the Prevention of Torture to send people to check on detainees conditions. History of the Republic of Turkey. http://en.wikipedia.org/?curid=13305."
  }
}
