{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8463",
  "eid" : "e7f1c270-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778468887,
  "textBody" : "Dubnium is a synthetic chemical element with symbol Db and atomic number 105. Dubnium is highly radioactive: the most stable known isotope, dubnium-268, has a half-life of just over a day. This greatly limits the extent of research on dubnium.\n\nDubnium does not occur naturally on Earth and is produced artificially. The first discovery of the element was claimed by the Soviet Joint Institute for Nuclear Research (JINR) in 1968, followed in 1970 by the American University of California. Both teams proposed their names for the new element and used them without formal approval. The long-standing dispute was resolved in 1993 by an official investigation of the discovery claims by the IUPAC/IUPAP Joint Working Party, resulting in credit for discovery being officially shared between both teams. The element was officially named dubnium in 1997 after the town of Dubna, the site of the JINR.\n\nIn the periodic table of the elements, dubnium is located in group 5 as the third member of the 6d series of transition metals. Limited investigation of dubnium chemistry has demonstrated that dubnium behaves as a typical group 5 element and the heavier homologue to tantalum; however, some deviations from periodic trends occur due to relativistic effects.\n\nDiscovery \n\nUranium, element 92, is the heaviest of the elements that occur significantly in nature; heavier elements can only practically be produced by synthesis. The first synthesis of a new element—neptunium, element 93—occurred in 1940 by a team of scientists in the United States. In the coming years, American scientists undoubtedly synthesized the following elements up to mendelevium, element 101, in 1955. However, starting with element 102, priority of discovery was contested between American and Soviet physicists.\nTheir rivalry resulted in a race for new elements and credit of their discoveries, later named the Transfermium Wars.\n\nReports \n\nThe first report of discovery of element 105 came from the Joint Institute for Nuclear Research (JINR) in Dubna, Moscow Oblast, Russian SFSR, Soviet Union, in 1968. A target of 243Am was bombarded by a beam of 22Ne ions. The scientists at Dubna reported 9.4 MeV (with the reported half-life of 0.1–3 seconds) and 9.7 MeV (t1/2 > 0.05 s) alpha activities followed by alpha activities similar to those of either 256103 or 257103. The two activity lines were, based on prior theoretical predictions, assigned to 261105 and 260105, accordingly.\n\n+  → 265−x105 + x  (x = 4, 5)\n\nInvestigation on this reaction was continued; the research was aimed at looking for fission fragments of isotopes of element 105. A subsequent paper was published in February 1970. Two activities were found, with half-lives of 14 ms and 2.2±0.5 s. The former activity was assigned to 242mfAm; the latter one was described as having been caused by an isotope of element 105. The possibility that the latter activity could come from a transfer reaction and thus not be from element 105 was said to be diminished by the fact that the yield ratio for this reaction was lower than that of the 242mfAm-producing transfer reaction. The idea that this synthesis reaction was indeed a (22Ne,xn) reaction was supported by research on reactions of the 243Am target with 18O; reactions producing 256103 and 257103 showed very little spontaneous fission (SF) activity (matching the established data), and the reaction producing heavier 258103 and 259103 produced no SF activity at all, falling in line with theoretical data.\n\nIn April 1970, a team led by Albert Ghiorso working at the University of California (Berkeley, California, United States) stepped into the competition. They claimed to have synthesized the element by bombarding a californium-249 target with nitrogen-15 ions. Alpha activity with the energy of 9.1 MeV was formed; the team attempted reaction with other nuclides—bombardment of 249Cf with 14N, Pb with 15N, Hg with 15N—and stated no such activity was found in those reactions. The characteristics of the daughter nuclei correlated with those of 256103, implying the assignment of the parent to 260105.\n\n+  → 260105 + 4 \n\nThese results by the Berkeley scientists did not confirm the JINR findings regarding the 9.4 MeV or 9.7 MeV alpha decay of 260105, leaving only 261105 as a possibly produced isotope.\n\nIn May 1970, the JINR published a further report on dubnium. In the follow-up research, further syntheses of dubnium were performed. It was reported that the previous syntheses were confirmed; according to the paper, the isotope produced in Dubna was probably 261105, though the possibility of it being 260105 was not excluded.  The report included initial chemical examination: the thermal gradient version of the gas-chromatography method was applied to demonstrate that the chloride of what formed the SF activity nearly matched that of niobium pentachloride, rather than hafnium tetrachloride; therefore, this directed to an assignment to element 105. The team identified a 2.2-second spontaneous fission activity contained within a volatile chloride portraying eka-tantalum properties.\n\nIn June 1970, the Dubna team made improvements on their original experiment, providing a purer target and reducing the intensity of transfer reactions by installing a collimator before the catcher. This time, they were able to find 9.1 MeV alpha activities with daughter isotopes identifiable as either 256103 or 257103; thus, the original isotope was either 260105 or 261105.\n\nNaming controversy \n\nThe Soviet team proposed the name nielsbohrium (Ns) in honor of the Danish nuclear physicist Niels Bohr, one of the founders of the theories of the atomic structure and the quantum theory. The American team proposed that the new element should be named hahnium  (Ha), in honor of the German chemist Otto Hahn, the \"father of nuclear chemistry\". Thus, an element naming controversy arose.\n\nHowever, tensions in the late 1960s and 1970s somewhat simmered down. Both teams synthesized the next element, element 106, but decided not to suggest their names. Translation from  In 1968, the Soviet team presented a report calling recognition of discovery of elements 102 and 103 by other teams, including the American team, \"hasty\". Afterwards, they suggested establishing an international committee on elaborating the discovery criteria. This proposal was accepted in 1974; however, the newly formed Committee never assembled to assess the claims. Neither team showed interest in resolving the conflict through a third party, and so the leading scientists of the LBL—Albert Ghiorso and Glenn Seaborg—traveled to Dubna in 1975 and had a meeting with the leader of the Soviet team, Georgy Flerov, in an attempt to resolve the conflict internally and render the neutral joint group unnecessary; however, the meeting was unsuccessful. The conflict remained unsolved, and in 1979, the IUPAC published a new suggested system of systematic element names (according to which element 105 would be named unnilpentium, from the Latin roots un- and nil- and the Greek root pent- (meaning \"one\", \"zero\", and \"five\", respectively, referencing the decimal digits of the atomic number) intended to be used as placeholders until permanent names were established; the scientists ignored it, not wishing to weaken their claims by adopting a neutral naming system rather than their own.\n\nIn 1981, a third major competitor joined the race for superheavy elements—the Gesellschaft für Schwerionenforschung (English: Society for Heavy Ion Research) in Darmstadt, Hesse, West Germany. They claimed to have synthesized the element 107; their report came out five years after the first report from Dubna did but provided a greater level of precision, making a more solid claim on discovery. The German team joined with the Soviet team in that it suggested the name nielsbohrium for the new element, believing Bohr did deserve an element named after him, and hoping to ease the tension on the element 105 controversy. The Soviet team did not hurry to suggest a new name for element 105, stating it was more important to first determine the discoverers of the element.\n\nIn 1985, the International Union of Pure and Applied Chemistry (IUPAC) and the International Union of Pure and Applied Physics (IUPAP) formed a Joint Working Party (JWP) aimed at assessing discoveries and establishing final names for the elements in question. The party held numerous meetings with delegates from the three competing institutes; in 1990, they established criteria on recognizing an element and in 1991, they completed the work on assessing discoverer statuses and the party was disbanded. These results were published in 1993. According to the report, the first definitely successful experiment was the April 1970 experiment in Berkeley, followed closely by the June 1970 Dubna experiment; thus, credit for discovery of the element should be shared between the two competing teams.\n\nThe American team dismissed the report. In an open response, they proclaimed that the input from the Soviet team was overrated in the review. In addition, they claimed the Soviet team was able to undoubtedly demonstrate the synthesis of element 105 at least a year after they did. The Russian and the German teams endorsed the report. The scientists from the former JWP rejected the criticisms from Berkeley.\n\nIn 1994, IUPAC published a recommendation on naming the disputed elements following the previous reports. For element 105, they proposed the name joliotium (Jl), after the French physicist Frédéric Joliot-Curie, a significant contributor to the development of nuclear physics and chemistry; this name was originally proposed by the Soviet team for element 102, which by then had long been called nobelium. (The name nielsbohrium for element 107 was transformed to bohrium to conform with the practice set by all then-named elements.) This recommendation paper was generally met with criticism from the American scientists: their recommendations were scrambled (the names rutherfordium and hahnium, originally suggested by Berkeley for elements 104 and 105, were used for elements 106 and 108, respectively); both elements 104 and 105 were given names suggested by the Russian team despite earlier recognition of the Berkeley team as of an equal co-discoverer; and especially because the name seaborgium for element 106 was rejected for honoring a living person, a rule that had only just been approved. These names were to be accepted on a Council meeting in 1995.\n\nAfter a new term of negotiations between the parties, IUPAC decided to allow the name seaborgium for element 106 and changed the name of element 102 to flerovium after Georgy Flerov following the recognition by the 1993 report that the element had been first convincingly synthesized in Dubna. However, this compromise was also rejected by the American scientists and the decision was retracted. The name flerovium was later used for element 114.\n\nIn 1996, IUPAC held another meeting and reconsidered all names in hand and another set of recommendations was accepted on this meeting; it was finally approved and published in 1997. Element 105 got its final name, dubnium (Db), after the Russian town of Dubna, the location of the Joint Institute for Nuclear Research. This decision was \"reluctantly\" approved by the American scientists. IUPAC stated the Berkeley laboratory had already been recognized several times in the naming of elements (i.e., berkelium, californium, americium) and that the acceptance of the names rutherfordium and seaborgium for elements 104 and 106 should be offset by recognizing the Russian team's contributions to the discovery of elements 104, 105, and 106. (The matter of naming element 107 was transferred to the Royal Danish Academy of Sciences and Letters, who recommended the name bohrium to be used.)\n\nIsotopes\n\nDubnium with its atomic number 105 is a superheavy element; like all elements of such high atomic number, it is highly unstable. The most stable known isotope of dubnium, 268Db, has a half-life of around a day. Thus, even if it had once existed on Earth, it would have decayed completely long ago and can only be obtained by artificial production.\n\nThe short half-life of dubnium limits the scope of experimentation. This is amplified by the neutron-to-proton ratio of the most stable isotopes of an element growing with the atomic number, a trend that is expected to continue to the superheavy elements; this complicates synthesis of the most stable isotopes as the isotopes in question will have more neutrons per proton than both the target and beam nuclei that could be employed. (Although a different technique based on rapid neutron capture is being considered, the ones based on collision of a big and a small nucleus dominate research in the area nowadays.)\n\nBy 2016, only a few atoms of 268Db could be produced in each experiment, and thus the measured half-lives changed significantly during the process. During three experiments, 23 atoms were created in total, with a resulting half-life of . The second most stable isotope, 270Db, has been produced in even smaller quanitites: three atoms in total, with lifetimes of 33.4 h, 1.3 h, and 1.6 h. These two are the heaviest isotopes of dubnium to date, and both were produced as a result of decay of the heavier nuclei 288Mc and 294Ts rather than directly. The reason for this is that the experiments that yielded them were originally designed in Dubna for 48Ca beams. For its mass, 48Ca has by far the greatest neutron excess of all practically stable nuclei, both quantitative and relative, which correspondingly helps synthesize superheavy nuclei with more neutrons. However, this gain is compensated by decreased likelihood of fusion for high atomic numbers.\n\nWhile it yet remains to be seen if there are principally more stable isotopes, there has not any theoretical, let alone practical, suggestion this could be the case. In a 2012 calculation by the JINR, it was suggested that the half-lives of all dubnium isotopes, synthesized or not, would not significantly exceed a day.\n\nPredicted properties \n\nAccording to the periodic law, dubnium should belong to group 5, under vanadium, niobium, and tantalum. Several studies investigated the properties of element 105 and found a general agreement with the predictions from the periodic law. Significant deviations may nevertheless occur, due to relativistic effects, which dramatically change physical properties on both atomic and macroscopic scales. (Relativistic effects arise when an object moves on velocities comparable to the speed of light; in heavy atoms, the quickly moving objects are electrons revolving around the nucleus.) These properties have remained challenging to measure: studies have only been performed on single atoms; they generally confirm the assignment of dubnium to the position under tantalum in the periodic table.\n\nAtomic and physical \n\nA direct relativistic effect is that as atomic numbers of elements increase, the innermost electrons begin to revolve faster around the nucleus as a result of the increase of the electromagnetic attraction between an electron and a nucleus. Similar effects have been found for s orbitals (and p1/2 ones, though this is not quite applicable for dubnium): for example, the 7s orbital is contracted by 25% in size and stabilized by 2.6 eV.\n\nA more indirect effect would be that the contracted s and p1/2 orbitals shield (take on themselves) the charge of the nucleus more effectively, leaving even less for the outer d and f electrons, which therefore move on larger orbitals. Dubnium is greatly affected by this: unlike the previous group 5 members, its 7s electrons are more difficult to extract from an atom than the 6d electrons, though these energy levels remain close to each other.\n\nAnother effect is the spin–orbit interaction, particularly the spin–orbit splitting, which in application to dubnium splits the 6d subshell—the azimuthal quantum number ℓ for a d shell is 2—into two subshells, with four of the ten orbitals having their ℓ lowered to 3/2 and six raised to 5/2. While all ten energy levels are actually raised (lowered in absolute values), making them less stable energetically, four of them are more stable than the other six. (The three 6d electrons normally assume the energy levels of lowest energy, 6d3/2.)\n\nWhile the remaining valence electrons in a singly ionized dubnium ion (Db+) organize themselves in a 6d27s2 configuration, the doubly (Db2+) or triply (Db3+) ionized atoms eliminate the 7s electrons, the opposite order to that of its lighter homologs. Despite the changes, however, dubnium is still expected to use five electrons as its valence electrons; 7p energy levels have not been shown to influence dubnium and its properties. As the 6d orbitals of dubnium are more destabilized than the 5d ones of tantalum, and Db3+ is expected to have two d, rather than s, electrons remaining, the resulting oxidation state is expected to be unstable and even rarer than that of tantalum. The ionization potential of dubnium in its maximum oxidation state should be slightly lower than that of tantalum and the ionic radius of dubnium should increase compared to tantalum; this has a significant effect on dubnium's chemistry (see below).\n\nIf a large number of dubnium atoms were to gather together as a solid, they should arrange themselves in a body-centered cubic configuration, like the previous group 5 elements. The predicted density of dubnium is 29 g/cm3.\n\nChemical \n\nThe simplest case for computational chemistry is the gas-phase chemistry, in which a substance is treated as if it was a gas to eliminate the necessity of taking interactions between molecules in account. Research by multiple authors has been undertaken on dubnium pentachloride: it has been calculated to be consistent with the periodic laws by exhibiting properties of a compound of a d-block element. For example, the molecular orbital levels indicate dubnium uses three 6d electron levels as expected. One property dubnium pentachloride is expected to show is its increased (compared to its tantalum analog) covalence: a decrease in the effective charge on an atom and an increase in the overlap population (between orbitals of dubnium and chlorine).\n\nCalculations for solution chemistry indicate that again, the maximum oxidation state of dubnium, +5, will be more stable than that of niobium and tantalum, and the +3 state will be less stable than those of niobium and tantalum. The propensity towards hydrolysis of cations in the highest oxidation state is expected to continue to decrease within group 5; however, it is still expected to be quite rapid. Complexation of dubnium is expected to follow group 5 trends in its richness. Calculations for hydroxo-chlorido- complexes have been conducted; they show reversal in the trends of complex formation and extraction of group 5 elements, with dubnium being more prone to do so than tantalum.\n\nExperimental chemistry \n\nExperimental results of studies of the chemistry of dubnium date back to 1974 and 1976. Dubna researchers used a thermochromatographic system and concluded that the volatility of dubnium bromide was less than that of niobium bromide and about the same as that of hafnium bromide. It is not certain, however, that the detected fission products confirmed that the parent was indeed element 105. This may imply that the new element behaved more like hafnium than niobium.\n\nNext studies of the chemistry of dubnium were reported over a decade later, in 1988. Studies at Berkeley examined whether the most stable oxidation state of dubnium in aqueous solution was +5. Dubnium was fumed twice and washed with concentrated nitric acid; then, its sorption of dubnium on glass cover slips was compared with that of tracers of the group 5 elements niobium and tantalum and the group 4 elements zirconium and hafnium produced on‐line under similar conditions. The group 5 elements are known to sorb on glass surfaces while the group 4 elements do not. Dubnium was confirmed as a group 5 member. However, it was surprising that behavior on extraction from mixed nitric acid/hydrofluoric acid solution into methyl isobutyl ketones differed between dubnium, tantalum, and niobium. Dubnium did not extract and its behavior resembled niobium more closely than tantalum, indicating that details of complexing behavior could not be predicted based only on simple extrapolations of trends within a group in the periodic table.\n\nThis prompted further exploration of the chemical behavior of complexes of dubnium. Thousands of repetitive chromatographic experiments were performed jointly in various labs between 1988 and 1993. All group 5 elements and protactinium were extracted from concentrated hydrochloric acid; at lower concentrations of hydrogen chloride, small amounts of hydrogen fluoride were added to start selective re-extraction. Dubnium showed a behavior different from that of tantalum at concentrations of hydrogen chloride below 12 moles, following the behavior of niobium and the pseudohomolog protactinium. Because of this similarity to these two elements, the research suggested that the formed complex was either  or . After extraction experiments of dubnium from hydrogen bromide into diisobutyl carbinol (2,6-dimethylheptan-4-ol), a specific extractant for protactinium, with subsequent elutions with the hydrogen chloride/hydrogen fluoride mix as well as hydrogen chloride, dubnium was found to be less prone to extraction than both protactinium and niobium. It was explained as an increasing tendency to form non‐extractable complexes of multiple negative charges. Further experiments in 1992 confirmed the stability of the +5 state: Db(V) was shown to be extractable from cation‐exchange columns with α‐hydroxyisobutyrate, similarly to other group 5 elements and protactinium; Db(III) and Db(IV) were not. In 1998 and 1999, new predictions suggested dubnium would extract nearly as well as niobium and better than tantalum from halide solutions, which was later confirmed.\n\nThe first isothermal gas chromatography experiments were performed in 1992 with 262Db (half-life 35 seconds). The volatilities for niobium and tantalum were similar within error limits, but dubnium appeared to be significantly less volatile. It was postulated that traces of oxygen in the system might have led to formation of , which was predicted to be less volatile than . Later experiments in 1996 showed that group 5 chlorides were more volatile than the corresponding bromides, with the exception of tantalum, presumably due to formation of . Later volatility studies of chlorides of dubnium and niobium as a function of controlled partial pressures of oxygen showed that formation of oxychlorides and general volatility are dependent on concentrations of oxygen. The oxychlorides were shown to be less volatile than the chlorides.\n\nIn 2004–05, researchers from Dubna and Livermore identified a new dubnium isotope, 268Db, as a fivefold alpha decay product of the newly created element 115. This new isotope proved to be long-lived enough to allow further chemical experimentation, with a half-life of over a day. In the 2004 experiment, a thin layer was removed from the surface of the target (with dubnium on it), dissolved in aqua regia with tracers and lanthanum carrier, from which precipitated various +3, +4, and +5 species on adding ammonium hydroxide. The precipitate was washed and dissolved in hydrochloric acid, in which it was converted to nitrate form then dried on a film and counted. It mostly contained a +5 species, which was immediately assigned to dubnium, but also a +4 species; based on that result, the team decided that additional chemical separation was needed. In 2005, the experiment was repeated, with the final product being hydroxide rather than nitrate precipitate, which was processed further at both Livermore (based on reverse phase chromatography) and Dubna (based on anion exchange chromatography). The +5 species was effectively isolated; dubnium in that experiment appeared three times in tantalum-only fractions and not even once in niobium-only fractions. However, it was noted that these experiments were insufficient to draw conclusions about the general chemical profile of dubnium.\n\nIn 2009, another anion-exchange experiment was conducted in Japan at the JAEA tandem accelerator. Dubnium was processed to a nitric acid/hydrofluoric acid solution, with concentrations at which niobium forms  and tantalum forms . Dubnium's behavior was close to that of niobium but not tantalum; thus, it was deduced that it formed . It was concluded that the available information that dubnium often behaved like niobium, sometimes like protactinium, but rarely as tantalum.\n\nNotes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dubnium" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8463" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dubnium is a synthetic chemical element with symbol Db and atomic number 105. Dubnium is highly radioactive: the most stable known isotope, dubnium-268, has a half-life of just over a day. This greatly limits the extent of research on dubnium.\n\nDubnium does not occur naturally on Earth and is produced artificially. The first discovery of the element was claimed by the Soviet Joint Institute for Nuclear Research (JINR) in 1968, followed in 1970 by the American University of California. Both teams proposed their names for the new element and used them without formal approval. The long-standing dispute was resolved in 1993 by an official investigation of the discovery claims by the IUPAC/IUPAP Joint Working Party, resulting in credit for discovery being officially shared between both teams. The element was officially named dubnium in 1997 after the town of Dubna, the site of the JINR.\n\nIn the periodic table of the elements, dubnium is located in group 5 as the third member of the 6d series of transition metals. Limited investigation of dubnium chemistry has demonstrated that dubnium behaves as a typical group 5 element and the heavier homologue to tantalum; however, some deviations from periodic trends occur due to relativistic effects.\n\nDiscovery \n\nUranium, element 92, is the heaviest of the elements that occur significantly in nature; heavier elements can only practically be produced by synthesis. The first synthesis of a new element—neptunium, element 93—occurred in 1940 by a team of scientists in the United States. In the coming years, American scientists undoubtedly synthesized the following elements up to mendelevium, element 101, in 1955. However, starting with element 102, priority of discovery was contested between American and Soviet physicists.\nTheir rivalry resulted in a race for new elements and credit of their discoveries, later named the Transfermium Wars.\n\nReports \n\nThe first report of discovery of element 105 came from the Joint Institute for Nuclear Research (JINR) in Dubna, Moscow Oblast, Russian SFSR, Soviet Union, in 1968. A target of 243Am was bombarded by a beam of 22Ne ions. The scientists at Dubna reported 9.4 MeV (with the reported half-life of 0.1–3 seconds) and 9.7 MeV (t1/2 > 0.05 s) alpha activities followed by alpha activities similar to those of either 256103 or 257103. The two activity lines were, based on prior theoretical predictions, assigned to 261105 and 260105, accordingly.\n\n+  → 265−x105 + x  (x = 4, 5)\n\nInvestigation on this reaction was continued; the research was aimed at looking for fission fragments of isotopes of element 105. A subsequent paper was published in February 1970. Two activities were found, with half-lives of 14 ms and 2.2±0.5 s. The former activity was assigned to 242mfAm; the latter one was described as having been caused by an isotope of element 105. The possibility that the latter activity could come from a transfer reaction and thus not be from element 105 was said to be diminished by the fact that the yield ratio for this reaction was lower than that of the 242mfAm-producing transfer reaction. The idea that this synthesis reaction was indeed a (22Ne,xn) reaction was supported by research on reactions of the 243Am target with 18O; reactions producing 256103 and 257103 showed very little spontaneous fission (SF) activity (matching the established data), and the reaction producing heavier 258103 and 259103 produced no SF activity at all, falling in line with theoretical data.\n\nIn April 1970, a team led by Albert Ghiorso working at the University of California (Berkeley, California, United States) stepped into the competition. They claimed to have synthesized the element by bombarding a californium-249 target with nitrogen-15 ions. Alpha activity with the energy of 9.1 MeV was formed; the team attempted reaction with other nuclides—bombardment of 249Cf with 14N, Pb with 15N, Hg with 15N—and stated no such activity was found in those reactions. The characteristics of the daughter nuclei correlated with those of 256103, implying the assignment of the parent to 260105.\n\n+  → 260105 + 4 \n\nThese results by the Berkeley scientists did not confirm the JINR findings regarding the 9.4 MeV or 9.7 MeV alpha decay of 260105, leaving only 261105 as a possibly produced isotope.\n\nIn May 1970, the JINR published a further report on dubnium. In the follow-up research, further syntheses of dubnium were performed. It was reported that the previous syntheses were confirmed; according to the paper, the isotope produced in Dubna was probably 261105, though the possibility of it being 260105 was not excluded.  The report included initial chemical examination: the thermal gradient version of the gas-chromatography method was applied to demonstrate that the chloride of what formed the SF activity nearly matched that of niobium pentachloride, rather than hafnium tetrachloride; therefore, this directed to an assignment to element 105. The team identified a 2.2-second spontaneous fission activity contained within a volatile chloride portraying eka-tantalum properties.\n\nIn June 1970, the Dubna team made improvements on their original experiment, providing a purer target and reducing the intensity of transfer reactions by installing a collimator before the catcher. This time, they were able to find 9.1 MeV alpha activities with daughter isotopes identifiable as either 256103 or 257103; thus, the original isotope was either 260105 or 261105.\n\nNaming controversy \n\nThe Soviet team proposed the name nielsbohrium (Ns) in honor of the Danish nuclear physicist Niels Bohr, one of the founders of the theories of the atomic structure and the quantum theory. The American team proposed that the new element should be named hahnium  (Ha), in honor of the German chemist Otto Hahn, the \"father of nuclear chemistry\". Thus, an element naming controversy arose.\n\nHowever, tensions in the late 1960s and 1970s somewhat simmered down. Both teams synthesized the next element, element 106, but decided not to suggest their names. Translation from  In 1968, the Soviet team presented a report calling recognition of discovery of elements 102 and 103 by other teams, including the American team, \"hasty\". Afterwards, they suggested establishing an international committee on elaborating the discovery criteria. This proposal was accepted in 1974; however, the newly formed Committee never assembled to assess the claims. Neither team showed interest in resolving the conflict through a third party, and so the leading scientists of the LBL—Albert Ghiorso and Glenn Seaborg—traveled to Dubna in 1975 and had a meeting with the leader of the Soviet team, Georgy Flerov, in an attempt to resolve the conflict internally and render the neutral joint group unnecessary; however, the meeting was unsuccessful. The conflict remained unsolved, and in 1979, the IUPAC published a new suggested system of systematic element names (according to which element 105 would be named unnilpentium, from the Latin roots un- and nil- and the Greek root pent- (meaning \"one\", \"zero\", and \"five\", respectively, referencing the decimal digits of the atomic number) intended to be used as placeholders until permanent names were established; the scientists ignored it, not wishing to weaken their claims by adopting a neutral naming system rather than their own.\n\nIn 1981, a third major competitor joined the race for superheavy elements—the Gesellschaft für Schwerionenforschung (English: Society for Heavy Ion Research) in Darmstadt, Hesse, West Germany. They claimed to have synthesized the element 107; their report came out five years after the first report from Dubna did but provided a greater level of precision, making a more solid claim on discovery. The German team joined with the Soviet team in that it suggested the name nielsbohrium for the new element, believing Bohr did deserve an element named after him, and hoping to ease the tension on the element 105 controversy. The Soviet team did not hurry to suggest a new name for element 105, stating it was more important to first determine the discoverers of the element.\n\nIn 1985, the International Union of Pure and Applied Chemistry (IUPAC) and the International Union of Pure and Applied Physics (IUPAP) formed a Joint Working Party (JWP) aimed at assessing discoveries and establishing final names for the elements in question. The party held numerous meetings with delegates from the three competing institutes; in 1990, they established criteria on recognizing an element and in 1991, they completed the work on assessing discoverer statuses and the party was disbanded. These results were published in 1993. According to the report, the first definitely successful experiment was the April 1970 experiment in Berkeley, followed closely by the June 1970 Dubna experiment; thus, credit for discovery of the element should be shared between the two competing teams.\n\nThe American team dismissed the report. In an open response, they proclaimed that the input from the Soviet team was overrated in the review. In addition, they claimed the Soviet team was able to undoubtedly demonstrate the synthesis of element 105 at least a year after they did. The Russian and the German teams endorsed the report. The scientists from the former JWP rejected the criticisms from Berkeley.\n\nIn 1994, IUPAC published a recommendation on naming the disputed elements following the previous reports. For element 105, they proposed the name joliotium (Jl), after the French physicist Frédéric Joliot-Curie, a significant contributor to the development of nuclear physics and chemistry; this name was originally proposed by the Soviet team for element 102, which by then had long been called nobelium. (The name nielsbohrium for element 107 was transformed to bohrium to conform with the practice set by all then-named elements.) This recommendation paper was generally met with criticism from the American scientists: their recommendations were scrambled (the names rutherfordium and hahnium, originally suggested by Berkeley for elements 104 and 105, were used for elements 106 and 108, respectively); both elements 104 and 105 were given names suggested by the Russian team despite earlier recognition of the Berkeley team as of an equal co-discoverer; and especially because the name seaborgium for element 106 was rejected for honoring a living person, a rule that had only just been approved. These names were to be accepted on a Council meeting in 1995.\n\nAfter a new term of negotiations between the parties, IUPAC decided to allow the name seaborgium for element 106 and changed the name of element 102 to flerovium after Georgy Flerov following the recognition by the 1993 report that the element had been first convincingly synthesized in Dubna. However, this compromise was also rejected by the American scientists and the decision was retracted. The name flerovium was later used for element 114.\n\nIn 1996, IUPAC held another meeting and reconsidered all names in hand and another set of recommendations was accepted on this meeting; it was finally approved and published in 1997. Element 105 got its final name, dubnium (Db), after the Russian town of Dubna, the location of the Joint Institute for Nuclear Research. This decision was \"reluctantly\" approved by the American scientists. IUPAC stated the Berkeley laboratory had already been recognized several times in the naming of elements (i.e., berkelium, californium, americium) and that the acceptance of the names rutherfordium and seaborgium for elements 104 and 106 should be offset by recognizing the Russian team's contributions to the discovery of elements 104, 105, and 106. (The matter of naming element 107 was transferred to the Royal Danish Academy of Sciences and Letters, who recommended the name bohrium to be used.)\n\nIsotopes\n\nDubnium with its atomic number 105 is a superheavy element; like all elements of such high atomic number, it is highly unstable. The most stable known isotope of dubnium, 268Db, has a half-life of around a day. Thus, even if it had once existed on Earth, it would have decayed completely long ago and can only be obtained by artificial production.\n\nThe short half-life of dubnium limits the scope of experimentation. This is amplified by the neutron-to-proton ratio of the most stable isotopes of an element growing with the atomic number, a trend that is expected to continue to the superheavy elements; this complicates synthesis of the most stable isotopes as the isotopes in question will have more neutrons per proton than both the target and beam nuclei that could be employed. (Although a different technique based on rapid neutron capture is being considered, the ones based on collision of a big and a small nucleus dominate research in the area nowadays.)\n\nBy 2016, only a few atoms of 268Db could be produced in each experiment, and thus the measured half-lives changed significantly during the process. During three experiments, 23 atoms were created in total, with a resulting half-life of . The second most stable isotope, 270Db, has been produced in even smaller quanitites: three atoms in total, with lifetimes of 33.4 h, 1.3 h, and 1.6 h. These two are the heaviest isotopes of dubnium to date, and both were produced as a result of decay of the heavier nuclei 288Mc and 294Ts rather than directly. The reason for this is that the experiments that yielded them were originally designed in Dubna for 48Ca beams. For its mass, 48Ca has by far the greatest neutron excess of all practically stable nuclei, both quantitative and relative, which correspondingly helps synthesize superheavy nuclei with more neutrons. However, this gain is compensated by decreased likelihood of fusion for high atomic numbers.\n\nWhile it yet remains to be seen if there are principally more stable isotopes, there has not any theoretical, let alone practical, suggestion this could be the case. In a 2012 calculation by the JINR, it was suggested that the half-lives of all dubnium isotopes, synthesized or not, would not significantly exceed a day.\n\nPredicted properties \n\nAccording to the periodic law, dubnium should belong to group 5, under vanadium, niobium, and tantalum. Several studies investigated the properties of element 105 and found a general agreement with the predictions from the periodic law. Significant deviations may nevertheless occur, due to relativistic effects, which dramatically change physical properties on both atomic and macroscopic scales. (Relativistic effects arise when an object moves on velocities comparable to the speed of light; in heavy atoms, the quickly moving objects are electrons revolving around the nucleus.) These properties have remained challenging to measure: studies have only been performed on single atoms; they generally confirm the assignment of dubnium to the position under tantalum in the periodic table.\n\nAtomic and physical \n\nA direct relativistic effect is that as atomic numbers of elements increase, the innermost electrons begin to revolve faster around the nucleus as a result of the increase of the electromagnetic attraction between an electron and a nucleus. Similar effects have been found for s orbitals (and p1/2 ones, though this is not quite applicable for dubnium): for example, the 7s orbital is contracted by 25% in size and stabilized by 2.6 eV.\n\nA more indirect effect would be that the contracted s and p1/2 orbitals shield (take on themselves) the charge of the nucleus more effectively, leaving even less for the outer d and f electrons, which therefore move on larger orbitals. Dubnium is greatly affected by this: unlike the previous group 5 members, its 7s electrons are more difficult to extract from an atom than the 6d electrons, though these energy levels remain close to each other.\n\nAnother effect is the spin–orbit interaction, particularly the spin–orbit splitting, which in application to dubnium splits the 6d subshell—the azimuthal quantum number ℓ for a d shell is 2—into two subshells, with four of the ten orbitals having their ℓ lowered to 3/2 and six raised to 5/2. While all ten energy levels are actually raised (lowered in absolute values), making them less stable energetically, four of them are more stable than the other six. (The three 6d electrons normally assume the energy levels of lowest energy, 6d3/2.)\n\nWhile the remaining valence electrons in a singly ionized dubnium ion (Db+) organize themselves in a 6d27s2 configuration, the doubly (Db2+) or triply (Db3+) ionized atoms eliminate the 7s electrons, the opposite order to that of its lighter homologs. Despite the changes, however, dubnium is still expected to use five electrons as its valence electrons; 7p energy levels have not been shown to influence dubnium and its properties. As the 6d orbitals of dubnium are more destabilized than the 5d ones of tantalum, and Db3+ is expected to have two d, rather than s, electrons remaining, the resulting oxidation state is expected to be unstable and even rarer than that of tantalum. The ionization potential of dubnium in its maximum oxidation state should be slightly lower than that of tantalum and the ionic radius of dubnium should increase compared to tantalum; this has a significant effect on dubnium's chemistry (see below).\n\nIf a large number of dubnium atoms were to gather together as a solid, they should arrange themselves in a body-centered cubic configuration, like the previous group 5 elements. The predicted density of dubnium is 29 g/cm3.\n\nChemical \n\nThe simplest case for computational chemistry is the gas-phase chemistry, in which a substance is treated as if it was a gas to eliminate the necessity of taking interactions between molecules in account. Research by multiple authors has been undertaken on dubnium pentachloride: it has been calculated to be consistent with the periodic laws by exhibiting properties of a compound of a d-block element. For example, the molecular orbital levels indicate dubnium uses three 6d electron levels as expected. One property dubnium pentachloride is expected to show is its increased (compared to its tantalum analog) covalence: a decrease in the effective charge on an atom and an increase in the overlap population (between orbitals of dubnium and chlorine).\n\nCalculations for solution chemistry indicate that again, the maximum oxidation state of dubnium, +5, will be more stable than that of niobium and tantalum, and the +3 state will be less stable than those of niobium and tantalum. The propensity towards hydrolysis of cations in the highest oxidation state is expected to continue to decrease within group 5; however, it is still expected to be quite rapid. Complexation of dubnium is expected to follow group 5 trends in its richness. Calculations for hydroxo-chlorido- complexes have been conducted; they show reversal in the trends of complex formation and extraction of group 5 elements, with dubnium being more prone to do so than tantalum.\n\nExperimental chemistry \n\nExperimental results of studies of the chemistry of dubnium date back to 1974 and 1976. Dubna researchers used a thermochromatographic system and concluded that the volatility of dubnium bromide was less than that of niobium bromide and about the same as that of hafnium bromide. It is not certain, however, that the detected fission products confirmed that the parent was indeed element 105. This may imply that the new element behaved more like hafnium than niobium.\n\nNext studies of the chemistry of dubnium were reported over a decade later, in 1988. Studies at Berkeley examined whether the most stable oxidation state of dubnium in aqueous solution was +5. Dubnium was fumed twice and washed with concentrated nitric acid; then, its sorption of dubnium on glass cover slips was compared with that of tracers of the group 5 elements niobium and tantalum and the group 4 elements zirconium and hafnium produced on‐line under similar conditions. The group 5 elements are known to sorb on glass surfaces while the group 4 elements do not. Dubnium was confirmed as a group 5 member. However, it was surprising that behavior on extraction from mixed nitric acid/hydrofluoric acid solution into methyl isobutyl ketones differed between dubnium, tantalum, and niobium. Dubnium did not extract and its behavior resembled niobium more closely than tantalum, indicating that details of complexing behavior could not be predicted based only on simple extrapolations of trends within a group in the periodic table.\n\nThis prompted further exploration of the chemical behavior of complexes of dubnium. Thousands of repetitive chromatographic experiments were performed jointly in various labs between 1988 and 1993. All group 5 elements and protactinium were extracted from concentrated hydrochloric acid; at lower concentrations of hydrogen chloride, small amounts of hydrogen fluoride were added to start selective re-extraction. Dubnium showed a behavior different from that of tantalum at concentrations of hydrogen chloride below 12 moles, following the behavior of niobium and the pseudohomolog protactinium. Because of this similarity to these two elements, the research suggested that the formed complex was either  or . After extraction experiments of dubnium from hydrogen bromide into diisobutyl carbinol (2,6-dimethylheptan-4-ol), a specific extractant for protactinium, with subsequent elutions with the hydrogen chloride/hydrogen fluoride mix as well as hydrogen chloride, dubnium was found to be less prone to extraction than both protactinium and niobium. It was explained as an increasing tendency to form non‐extractable complexes of multiple negative charges. Further experiments in 1992 confirmed the stability of the +5 state: Db(V) was shown to be extractable from cation‐exchange columns with α‐hydroxyisobutyrate, similarly to other group 5 elements and protactinium; Db(III) and Db(IV) were not. In 1998 and 1999, new predictions suggested dubnium would extract nearly as well as niobium and better than tantalum from halide solutions, which was later confirmed.\n\nThe first isothermal gas chromatography experiments were performed in 1992 with 262Db (half-life 35 seconds). The volatilities for niobium and tantalum were similar within error limits, but dubnium appeared to be significantly less volatile. It was postulated that traces of oxygen in the system might have led to formation of , which was predicted to be less volatile than . Later experiments in 1996 showed that group 5 chlorides were more volatile than the corresponding bromides, with the exception of tantalum, presumably due to formation of . Later volatility studies of chlorides of dubnium and niobium as a function of controlled partial pressures of oxygen showed that formation of oxychlorides and general volatility are dependent on concentrations of oxygen. The oxychlorides were shown to be less volatile than the chlorides.\n\nIn 2004–05, researchers from Dubna and Livermore identified a new dubnium isotope, 268Db, as a fivefold alpha decay product of the newly created element 115. This new isotope proved to be long-lived enough to allow further chemical experimentation, with a half-life of over a day. In the 2004 experiment, a thin layer was removed from the surface of the target (with dubnium on it), dissolved in aqua regia with tracers and lanthanum carrier, from which precipitated various +3, +4, and +5 species on adding ammonium hydroxide. The precipitate was washed and dissolved in hydrochloric acid, in which it was converted to nitrate form then dried on a film and counted. It mostly contained a +5 species, which was immediately assigned to dubnium, but also a +4 species; based on that result, the team decided that additional chemical separation was needed. In 2005, the experiment was repeated, with the final product being hydroxide rather than nitrate precipitate, which was processed further at both Livermore (based on reverse phase chromatography) and Dubna (based on anion exchange chromatography). The +5 species was effectively isolated; dubnium in that experiment appeared three times in tantalum-only fractions and not even once in niobium-only fractions. However, it was noted that these experiments were insufficient to draw conclusions about the general chemical profile of dubnium.\n\nIn 2009, another anion-exchange experiment was conducted in Japan at the JAEA tandem accelerator. Dubnium was processed to a nitric acid/hydrofluoric acid solution, with concentrations at which niobium forms  and tantalum forms . Dubnium's behavior was close to that of niobium but not tantalum; thus, it was deduced that it formed . It was concluded that the available information that dubnium often behaved like niobium, sometimes like protactinium, but rarely as tantalum.\n\nNotes. Dubnium. http://en.wikipedia.org/?curid=8463."
  }
}
