{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15571",
  "eid" : "1cf7ac50-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778557845,
  "textBody" : "John Woo SBS (Wu Yu-seng;  Ng Yu-sum (Cantonese); born October 1946) is a Chinese-born Hong Kong film director, writer, and producer.[http://www.festival-cannes.com/en/archives/artist/id/4289098/link/jury.html John Woo] . Festival de Cannes fiche artiste (artist profile) He is the owner of Lion Rock Productions. He is considered a major influence on the action genre, known for his highly chaotic action sequences, Mexican standoffs, and frequent use of slow motion. \n\nWoo has directed several notable Hong Kong action films, among them, A Better Tomorrow (1986), The Killer (1989), Hard Boiled (1992), and Red Cliff (2008/2009). \n\nWoo's Hollywood films include the action films Hard Target (1993) and Broken Arrow (1996), the sci-fi action thriller Face/Off (1997) and the action spy film Mission: Impossible 2 (2000). He created the comic series Seven Brothers, published by Virgin Comics. He cites his three favorite films as David Lean's Lawrence of Arabia, Akira Kurosawa's Seven Samurai and Jean-Pierre Melville's Le Samouraï.\n\nEarly life\n\nWoo was born Wu Yu-seng (Ng Yu-sum in Cantonese) in Guangzhou, China, amidst the chaos of the Chinese Civil War at the end of October 1946. Due to school age restrictions, his mother changed his birth date to 22 September 1948, which is what remains on his passport. The Woo family, Christians faced with persecution during Mao Zedong's early anti-bourgeois purges after the communist revolution in China, fled to Hong Kong when he was five.Rawnsley, Gary D. Rawnsley, Ming-Yeh T. (2003). Political Communications in Greater China: the construction and reflection of identity. Routledge; .\n\nImpoverished, the Woo family lived in the slums at Shek Kip Mei. His father was a teacher, though rendered unable to work by tuberculosis, and his mother was a manual laborer on construction sites. The family was rendered homeless by the big Shek Kip Mei fire of 1953. Charitable donations from disaster relief efforts enabled the family to relocate; however, violent crime had by then become commonplace in Hong Kong housing projects. At age three he was diagnosed with a serious medical condition. Following surgery on his spine, he was unable to walk correctly until eight years old, and as a result his right leg is shorter than his left leg. \n\nHis Christian upbringing shows influences in his films.June 2000 edition of Premiere magazine As a young boy, Woo had wanted to be a Christian minister. He later found a passion for movies influenced by the French New Wave especially Jean-Pierre Melville. Woo has said he was shy and had difficulty speaking, but found making movies a way to explore his feelings and thinking and would \"use movies as a language\". \n\nThe local cinema would prove a haven of retreat. Woo found respite in musical films, such as The Wizard of Oz and in American Westerns. He has stated the final scene of Butch Cassidy and the Sundance Kid made a particular impression on him in his youth: the device of two comrades, each of whom fire pistols from each hand, is a recurrent spectacle later found in his own work.\n\nHong Kong career\n\nIn 1969, Woo was hired as a script supervisor at Cathay Studios. In 1971, he became an assistant director at Shaw Studios. His directorial debut in 1974 was the feature film The Young Dragons (鐵漢柔情, Tiě hàn róu qíng). \n\nIn the Kung fu action genre, it was choreographed by Jackie Chan and featured dynamic camera-work and elaborate action scenes. The film was picked up by Golden Harvest Studio where he went on to direct more martial arts films. He later had success as a comedy director with Money Crazy (發錢寒, Fā qián hàn) (1977), starring Hong Kong comedian Ricky Hui.\n\nBy the mid-1980s, Woo was experiencing occupational burnout. Several of his films were commercial disappointments, and he felt a distinct lack of creative control. It was during this period of self-imposed exile that director/producer Tsui Hark provided the funding for Woo to film a longtime pet project, A Better Tomorrow (1986).\n\nThe story of two brothers—one a law enforcement officer, the other a criminal—the film was a financial blockbuster. A Better Tomorrow became a defining achievement in Hong Kong action cinema for its combination of emotional drama, slow-motion gunplay, and gritty atmospherics. Its signature visual device of two-handed, two-gunned shootouts within confined quarters—often referred to as \"gun fu\" was novel, and its diametrical inversion of the \"good-guys-bad guys\" formula in its characterization would influence later American films.\n\nWoo would make several more Heroic Bloodshed films in the late 1980s and early 1990s, nearly all starring Chow Yun-Fat. These violent gangster thrillers typically focus on men bound by honor and loyalty, at odds with contemporary values of impermanence and expediency. The protagonists of these films, therefore, may be said to present a common lineage with the Chinese literary tradition of loyalty among generals depicted in classics such as \"Romance of the Three Kingdoms\".\n\nWoo gained international recognition with the release of The Killer, which became the most successful Hong Kong film in American release since Bruce Lee's Enter the Dragon (1973) and garnered Woo an American cult following. Bullet in the Head followed a year later failed to find an audience that accepted its political undertones, and failed to recoup its massive budget.\n\nHis last Hong Kong film before emigrating to the United States was Hard Boiled (1992), a police thriller that served as the antithesis of his previous glorification of gangsters. Most notable of its numerous action scenes is a 30-minute climax set within a hospital. One particular long take follows two characters for exactly 2 minutes and 42 seconds as they fight their way between hospital floors. On the Criterion DVD and laserdisc, this chapter is referenced as \"2 minutes, 42 seconds.\" The film was considerably darker than most of Woo's previous films, depicting a police force nearly helpless to stop the influx of gangsters in the city, and the senseless slaughter of innocents. As a result, it did not match the success of his other films.\n\nJohn Woo: Interviews () includes a new 36-page interview with Woo by editor Robert K. Elder, which documents the years 1968 to 1990, from Woo's early career in working on comedies and kung fu films (in which he gave Jackie Chan in one of his first major film roles), to his gunpowder morality plays in Hong Kong.\n\nUnited States career\n\nAn émigré in 1993, the director experienced difficulty in cultural adjustment while contracted with Universal Studios to direct Jean-Claude Van Damme in Hard Target. As characteristics of other foreign national film directors confronted the Hollywood environment, Woo was unaccustomed to pervasive management concerns, such as limitations on violence and completion schedules. When initial cuts failed to yield an \"R\" rated film, the studio assumed control of the project and edited footage to produce a cut \"suitable for American audiences\". A \"rough cut\" of the film, supposedly the original unrated version, is still circulated among his admirers.\n\nA three-year hiatus saw Woo next direct John Travolta and Christian Slater in Broken Arrow. A frenetic chase-themed film, the director once again found himself hampered by studio management and editorial concerns. Despite a larger budget than his previous Hard Target, the final feature lacked the trademark Woo style. Public reception saw modest financial success.\n\nReluctant to pursue projects which would necessarily entail front-office controls, the director cautiously rejected the script for Face/Off several times until it was rewritten to suit him. (The futuristic setting was changed to a contemporary one.) Paramount Pictures also offered the director significantly more freedom to exercise his speciality: emotional characterisation and elaborate action. A complex story of adversaries—each of whom surgically alters their identity—law enforcement agent John Travolta and terrorist Nicolas Cage play a cat-and-mouse game, trapped in each other's outward appearance. Face/Off opened in 1997 to critical acclaim and strong attendance. Grosses in the United States exceeded $100 million. Face/Off was also nominated for an Academy Award in the category Sound Effects Editing (Mark Stoeckinger) at the 70th Academy Awards.\n\nIn 2003, Mr. Woo directed a television pilot entitled The Robinsons: Lost in Space for The WB Television Network, based on the 1960s television series Lost in Space. The pilot was not purchased, although bootleg copies have been made available by fans.\n\nJohn Woo has made three additional films in Hollywood: Mission: Impossible 2, Windtalkers and Paycheck. Mission: Impossible 2 was the highest-grossing film in America in 2000, but received mixed reviews. Windtalkers and Paycheck fared poorly at the box office and were summarily dismissed by critics. Woo directed and produced a videogame called Stranglehold for games consoles and PC. It is a sequel to his 1992 film, Hard Boiled. He also produced the 2007 anime movie, Appleseed: Ex Machina, the sequel to Shinji Aramaki's 2004 film Appleseed.\n\nReturn to Asian cinema\n\nIn 2008, Woo returned to Asian cinema with the completion of the two-part epic war film Red Cliff, based on a historical battle from Records of the Three Kingdoms. Produced on a grand scale, it is his first film in China since he emigrated from Hong Kong to the United States in 1993. Part 1 of the film was released throughout Asia in July, 2008, to generally favourable reviews and strong attendance. Part 2 was released in China in January, 2009.\n\nJohn Woo was presented with a Golden Lion award for lifetime achievement at the Venice Film Festival in 2010.[https://www.google.com/hostednews/ap/article/ALeqM5jn8fqNXb3XIs_esDukLr47rR7IvgD9I0JDEO0 Woo awarded Golden Lion for lifetime achievement] \n\nHe followed Red Cliff with another two-part film, The Crossing, in 2014 and 2015. Featuring an all-star cast, the four-hour epic tells the parallel stories of several characters who all ultimately find themselves passengers on the doomed Taiping steamer, which sank in 1949 en route from mainland China to Taiwan and has been described as \"China's Titanic\".\n\nFollowing the box-office disappointment of The Crossing, Woo and producer Terence Chang disbanded Lion Rock Productions.\n\nFuture film projects\n\nA CGI Mighty Mouse film was announced in 2003 although, , nothing has yet been produced. There have been rumours that Woo will direct a film version of the videogame Metroid, however the rights he optioned have since expired. \n\nWoo's next projects are The Divide, a western concerning the friendship between two workers, one Chinese, the other Irish, on the transcontinental rail-road, while The Devil's Soldier is a biopic on Frederick Townsend Ward, an American brought to China in the mid 19th century by the Emperor to suppress rebellion. Rendezvous in Black will be an adaptation of the drama/thriller novel of the same name, and Psi-Ops is a science fiction thriller about a telepathic agent, and a remake of Blind Spot.\n\nIn May 2008, Woo announced in Cannes that his next movie would be 1949, an epic love story set between the end of World War II and Chinese Civil War to the founding of the People's Republic of China, the shooting of which would take place in China and Taiwan. Its production was due to begin by the end of 2008, with a theatrical release planned in December 2009. However, in early April 2009, the film was cancelled due to script right issues. Reports indicated that Woo might be working on another World War II film, this time about the American Volunteer Group, or the Flying Tigers. The movie was tentatively titled \"Flying Tiger Heroes\" and Woo is reported as saying it will feature \"The most spectacular aerial battle scenes ever seen in Chinese cinema.\" It was not clear whether Woo would not be directing the earlier war film, or whether it was put on the back burner. Woo has stated that Flying Tiger Heroes would be an \"extremely important production\" and will \"emphasise US-Chinese friendship and the contributions of the Flying Tigers and the Yunnan people during the war of resistance.\" Woo has announced he will be using IMAX cameras to film the Flying Tigers project. “It has always been a dream of mine to explore shooting with IMAX cameras and to work in the IMAX format, and the strong visual element of this film is incredibly well-suited to the tastes of cinemagoers today [...] Using IMAX for Flying Tigers would create a new experience for the audience, and I think it would be another breakthrough for Chinese movies.”\n\nAfter the death of Japanese actor Ken Takakura in 2014, Woo announced his next film Manhunt, a film based on the novel by Juko Nishimura. The novel had previously been adapted by Junya Satō in 1976 as Kimi yo Fundo no Kawa o Watare, starring Takakura. Andy Lau, Takeshi Kaneshiro and Shu Qi were in discussion to star in the film. In March 2016, it was confirmed that Zhang Hanyu, Masaharu Fukuyama, and Qi Wei would be starring in the film.  Ha Ji-won was additionally confirmed as being attached to the project. Lee Byung-hun was slated to join, but had to drop out due to scheduling conflicts. Taking place and being shot in Japan, the film will have Chinese, Korean, and English dialogue. It is currently set for a tentative 2017 release.\n\nPersonal life\n\nWoo married Annie Woo Ngau Chun-lung in 1976, with whom he has three children. He is a Christian and told the BBC in a September 2014 interview that he has the utmost admiration for Jesus, whom he calls \"a great philosopher\".\n\nFilmography\n\nDirector\n\nProducer\n\n*A Better Tomorrow (1986)\n* A Better Tomorrow III: Love & Death in Saigon (1989)\n*Peace Hotel (1995)\n*Somebody Up There Likes Me (1996)\n*Once a Thief (1996 film) (1996)\n*Once a Thief (1997-1998)\n*The Replacement Killers (1998) (John Woo also choreographed the action sequences)\n*The Big Hit (1998)\n*Red Skies (2002)\n*Bulletproof Monk (2003)\n*The Glass Beads (2005)\n*Blood Brothers (2007)\n*Appleseed Saga: Ex Machina (2007)\n*My Fair Gentleman (2009)\n*Reign of Assassins (2010)\n*Seediq Bale (2011)\n*Second Sight (2011)\n*The Killer (2012)\n\nWriter\n\n*Hello, Late Homecomers (1978)\n*A Better Tomorrow (1986)\n\nOther works\n\n*Airport '98 (Nike commercial) (1998)\n*Hostage (branded content short film for BMW) (2002)\n*7 Brothers (graphic novel) (2006–2007)\n*Stranglehold (video game) (2007)\n*Bloodstroke (iOS and Android videogame) (2014)\n*' (Asahi Breweries commercial) (2013)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "John Woo" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15571" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "John Woo SBS (Wu Yu-seng;  Ng Yu-sum (Cantonese); born October 1946) is a Chinese-born Hong Kong film director, writer, and producer.[http://www.festival-cannes.com/en/archives/artist/id/4289098/link/jury.html John Woo] . Festival de Cannes fiche artiste (artist profile) He is the owner of Lion Rock Productions. He is considered a major influence on the action genre, known for his highly chaotic action sequences, Mexican standoffs, and frequent use of slow motion. \n\nWoo has directed several notable Hong Kong action films, among them, A Better Tomorrow (1986), The Killer (1989), Hard Boiled (1992), and Red Cliff (2008/2009). \n\nWoo's Hollywood films include the action films Hard Target (1993) and Broken Arrow (1996), the sci-fi action thriller Face/Off (1997) and the action spy film Mission: Impossible 2 (2000). He created the comic series Seven Brothers, published by Virgin Comics. He cites his three favorite films as David Lean's Lawrence of Arabia, Akira Kurosawa's Seven Samurai and Jean-Pierre Melville's Le Samouraï.\n\nEarly life\n\nWoo was born Wu Yu-seng (Ng Yu-sum in Cantonese) in Guangzhou, China, amidst the chaos of the Chinese Civil War at the end of October 1946. Due to school age restrictions, his mother changed his birth date to 22 September 1948, which is what remains on his passport. The Woo family, Christians faced with persecution during Mao Zedong's early anti-bourgeois purges after the communist revolution in China, fled to Hong Kong when he was five.Rawnsley, Gary D. Rawnsley, Ming-Yeh T. (2003). Political Communications in Greater China: the construction and reflection of identity. Routledge; .\n\nImpoverished, the Woo family lived in the slums at Shek Kip Mei. His father was a teacher, though rendered unable to work by tuberculosis, and his mother was a manual laborer on construction sites. The family was rendered homeless by the big Shek Kip Mei fire of 1953. Charitable donations from disaster relief efforts enabled the family to relocate; however, violent crime had by then become commonplace in Hong Kong housing projects. At age three he was diagnosed with a serious medical condition. Following surgery on his spine, he was unable to walk correctly until eight years old, and as a result his right leg is shorter than his left leg. \n\nHis Christian upbringing shows influences in his films.June 2000 edition of Premiere magazine As a young boy, Woo had wanted to be a Christian minister. He later found a passion for movies influenced by the French New Wave especially Jean-Pierre Melville. Woo has said he was shy and had difficulty speaking, but found making movies a way to explore his feelings and thinking and would \"use movies as a language\". \n\nThe local cinema would prove a haven of retreat. Woo found respite in musical films, such as The Wizard of Oz and in American Westerns. He has stated the final scene of Butch Cassidy and the Sundance Kid made a particular impression on him in his youth: the device of two comrades, each of whom fire pistols from each hand, is a recurrent spectacle later found in his own work.\n\nHong Kong career\n\nIn 1969, Woo was hired as a script supervisor at Cathay Studios. In 1971, he became an assistant director at Shaw Studios. His directorial debut in 1974 was the feature film The Young Dragons (鐵漢柔情, Tiě hàn róu qíng). \n\nIn the Kung fu action genre, it was choreographed by Jackie Chan and featured dynamic camera-work and elaborate action scenes. The film was picked up by Golden Harvest Studio where he went on to direct more martial arts films. He later had success as a comedy director with Money Crazy (發錢寒, Fā qián hàn) (1977), starring Hong Kong comedian Ricky Hui.\n\nBy the mid-1980s, Woo was experiencing occupational burnout. Several of his films were commercial disappointments, and he felt a distinct lack of creative control. It was during this period of self-imposed exile that director/producer Tsui Hark provided the funding for Woo to film a longtime pet project, A Better Tomorrow (1986).\n\nThe story of two brothers—one a law enforcement officer, the other a criminal—the film was a financial blockbuster. A Better Tomorrow became a defining achievement in Hong Kong action cinema for its combination of emotional drama, slow-motion gunplay, and gritty atmospherics. Its signature visual device of two-handed, two-gunned shootouts within confined quarters—often referred to as \"gun fu\" was novel, and its diametrical inversion of the \"good-guys-bad guys\" formula in its characterization would influence later American films.\n\nWoo would make several more Heroic Bloodshed films in the late 1980s and early 1990s, nearly all starring Chow Yun-Fat. These violent gangster thrillers typically focus on men bound by honor and loyalty, at odds with contemporary values of impermanence and expediency. The protagonists of these films, therefore, may be said to present a common lineage with the Chinese literary tradition of loyalty among generals depicted in classics such as \"Romance of the Three Kingdoms\".\n\nWoo gained international recognition with the release of The Killer, which became the most successful Hong Kong film in American release since Bruce Lee's Enter the Dragon (1973) and garnered Woo an American cult following. Bullet in the Head followed a year later failed to find an audience that accepted its political undertones, and failed to recoup its massive budget.\n\nHis last Hong Kong film before emigrating to the United States was Hard Boiled (1992), a police thriller that served as the antithesis of his previous glorification of gangsters. Most notable of its numerous action scenes is a 30-minute climax set within a hospital. One particular long take follows two characters for exactly 2 minutes and 42 seconds as they fight their way between hospital floors. On the Criterion DVD and laserdisc, this chapter is referenced as \"2 minutes, 42 seconds.\" The film was considerably darker than most of Woo's previous films, depicting a police force nearly helpless to stop the influx of gangsters in the city, and the senseless slaughter of innocents. As a result, it did not match the success of his other films.\n\nJohn Woo: Interviews () includes a new 36-page interview with Woo by editor Robert K. Elder, which documents the years 1968 to 1990, from Woo's early career in working on comedies and kung fu films (in which he gave Jackie Chan in one of his first major film roles), to his gunpowder morality plays in Hong Kong.\n\nUnited States career\n\nAn émigré in 1993, the director experienced difficulty in cultural adjustment while contracted with Universal Studios to direct Jean-Claude Van Damme in Hard Target. As characteristics of other foreign national film directors confronted the Hollywood environment, Woo was unaccustomed to pervasive management concerns, such as limitations on violence and completion schedules. When initial cuts failed to yield an \"R\" rated film, the studio assumed control of the project and edited footage to produce a cut \"suitable for American audiences\". A \"rough cut\" of the film, supposedly the original unrated version, is still circulated among his admirers.\n\nA three-year hiatus saw Woo next direct John Travolta and Christian Slater in Broken Arrow. A frenetic chase-themed film, the director once again found himself hampered by studio management and editorial concerns. Despite a larger budget than his previous Hard Target, the final feature lacked the trademark Woo style. Public reception saw modest financial success.\n\nReluctant to pursue projects which would necessarily entail front-office controls, the director cautiously rejected the script for Face/Off several times until it was rewritten to suit him. (The futuristic setting was changed to a contemporary one.) Paramount Pictures also offered the director significantly more freedom to exercise his speciality: emotional characterisation and elaborate action. A complex story of adversaries—each of whom surgically alters their identity—law enforcement agent John Travolta and terrorist Nicolas Cage play a cat-and-mouse game, trapped in each other's outward appearance. Face/Off opened in 1997 to critical acclaim and strong attendance. Grosses in the United States exceeded $100 million. Face/Off was also nominated for an Academy Award in the category Sound Effects Editing (Mark Stoeckinger) at the 70th Academy Awards.\n\nIn 2003, Mr. Woo directed a television pilot entitled The Robinsons: Lost in Space for The WB Television Network, based on the 1960s television series Lost in Space. The pilot was not purchased, although bootleg copies have been made available by fans.\n\nJohn Woo has made three additional films in Hollywood: Mission: Impossible 2, Windtalkers and Paycheck. Mission: Impossible 2 was the highest-grossing film in America in 2000, but received mixed reviews. Windtalkers and Paycheck fared poorly at the box office and were summarily dismissed by critics. Woo directed and produced a videogame called Stranglehold for games consoles and PC. It is a sequel to his 1992 film, Hard Boiled. He also produced the 2007 anime movie, Appleseed: Ex Machina, the sequel to Shinji Aramaki's 2004 film Appleseed.\n\nReturn to Asian cinema\n\nIn 2008, Woo returned to Asian cinema with the completion of the two-part epic war film Red Cliff, based on a historical battle from Records of the Three Kingdoms. Produced on a grand scale, it is his first film in China since he emigrated from Hong Kong to the United States in 1993. Part 1 of the film was released throughout Asia in July, 2008, to generally favourable reviews and strong attendance. Part 2 was released in China in January, 2009.\n\nJohn Woo was presented with a Golden Lion award for lifetime achievement at the Venice Film Festival in 2010.[https://www.google.com/hostednews/ap/article/ALeqM5jn8fqNXb3XIs_esDukLr47rR7IvgD9I0JDEO0 Woo awarded Golden Lion for lifetime achievement] \n\nHe followed Red Cliff with another two-part film, The Crossing, in 2014 and 2015. Featuring an all-star cast, the four-hour epic tells the parallel stories of several characters who all ultimately find themselves passengers on the doomed Taiping steamer, which sank in 1949 en route from mainland China to Taiwan and has been described as \"China's Titanic\".\n\nFollowing the box-office disappointment of The Crossing, Woo and producer Terence Chang disbanded Lion Rock Productions.\n\nFuture film projects\n\nA CGI Mighty Mouse film was announced in 2003 although, , nothing has yet been produced. There have been rumours that Woo will direct a film version of the videogame Metroid, however the rights he optioned have since expired. \n\nWoo's next projects are The Divide, a western concerning the friendship between two workers, one Chinese, the other Irish, on the transcontinental rail-road, while The Devil's Soldier is a biopic on Frederick Townsend Ward, an American brought to China in the mid 19th century by the Emperor to suppress rebellion. Rendezvous in Black will be an adaptation of the drama/thriller novel of the same name, and Psi-Ops is a science fiction thriller about a telepathic agent, and a remake of Blind Spot.\n\nIn May 2008, Woo announced in Cannes that his next movie would be 1949, an epic love story set between the end of World War II and Chinese Civil War to the founding of the People's Republic of China, the shooting of which would take place in China and Taiwan. Its production was due to begin by the end of 2008, with a theatrical release planned in December 2009. However, in early April 2009, the film was cancelled due to script right issues. Reports indicated that Woo might be working on another World War II film, this time about the American Volunteer Group, or the Flying Tigers. The movie was tentatively titled \"Flying Tiger Heroes\" and Woo is reported as saying it will feature \"The most spectacular aerial battle scenes ever seen in Chinese cinema.\" It was not clear whether Woo would not be directing the earlier war film, or whether it was put on the back burner. Woo has stated that Flying Tiger Heroes would be an \"extremely important production\" and will \"emphasise US-Chinese friendship and the contributions of the Flying Tigers and the Yunnan people during the war of resistance.\" Woo has announced he will be using IMAX cameras to film the Flying Tigers project. “It has always been a dream of mine to explore shooting with IMAX cameras and to work in the IMAX format, and the strong visual element of this film is incredibly well-suited to the tastes of cinemagoers today [...] Using IMAX for Flying Tigers would create a new experience for the audience, and I think it would be another breakthrough for Chinese movies.”\n\nAfter the death of Japanese actor Ken Takakura in 2014, Woo announced his next film Manhunt, a film based on the novel by Juko Nishimura. The novel had previously been adapted by Junya Satō in 1976 as Kimi yo Fundo no Kawa o Watare, starring Takakura. Andy Lau, Takeshi Kaneshiro and Shu Qi were in discussion to star in the film. In March 2016, it was confirmed that Zhang Hanyu, Masaharu Fukuyama, and Qi Wei would be starring in the film.  Ha Ji-won was additionally confirmed as being attached to the project. Lee Byung-hun was slated to join, but had to drop out due to scheduling conflicts. Taking place and being shot in Japan, the film will have Chinese, Korean, and English dialogue. It is currently set for a tentative 2017 release.\n\nPersonal life\n\nWoo married Annie Woo Ngau Chun-lung in 1976, with whom he has three children. He is a Christian and told the BBC in a September 2014 interview that he has the utmost admiration for Jesus, whom he calls \"a great philosopher\".\n\nFilmography\n\nDirector\n\nProducer\n\n*A Better Tomorrow (1986)\n* A Better Tomorrow III: Love & Death in Saigon (1989)\n*Peace Hotel (1995)\n*Somebody Up There Likes Me (1996)\n*Once a Thief (1996 film) (1996)\n*Once a Thief (1997-1998)\n*The Replacement Killers (1998) (John Woo also choreographed the action sequences)\n*The Big Hit (1998)\n*Red Skies (2002)\n*Bulletproof Monk (2003)\n*The Glass Beads (2005)\n*Blood Brothers (2007)\n*Appleseed Saga: Ex Machina (2007)\n*My Fair Gentleman (2009)\n*Reign of Assassins (2010)\n*Seediq Bale (2011)\n*Second Sight (2011)\n*The Killer (2012)\n\nWriter\n\n*Hello, Late Homecomers (1978)\n*A Better Tomorrow (1986)\n\nOther works\n\n*Airport '98 (Nike commercial) (1998)\n*Hostage (branded content short film for BMW) (2002)\n*7 Brothers (graphic novel) (2006–2007)\n*Stranglehold (video game) (2007)\n*Bloodstroke (iOS and Android videogame) (2014)\n*' (Asahi Breweries commercial) (2013). John Woo. http://en.wikipedia.org/?curid=15571."
  }
}
