{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20316",
  "eid" : "415e8550-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778618917,
  "textBody" : "Events\n\n* 1279 – A Mongol victory at the Battle of Yamen ends the Song dynasty in China.\n* 1563 – The Edict of Amboise is signed, ending the first phase of the French Wars of Religion and granting certain freedoms to the Huguenots.\n* 1649 – The House of Commons of England passes an act abolishing the House of Lords, declaring it \"useless and dangerous to the people of England\".\n* 1687 – Explorer Robert Cavelier de La Salle, searching for the mouth of the Mississippi River, is murdered by his own men.\n* 1812 – The Cádiz Cortes promulgates the Spanish Constitution of 1812.\n* 1853 – The Taiping reform movement occupies and makes Nanjing its capital until 1864.\n* 1861 – The First Taranaki War ends in New Zealand.\n* 1863 – The , said to have been the most powerful Confederate cruiser, is destroyed on her maiden voyage with a cargo of munitions, medicines and merchandise then valued at over $1,000,000.\n* 1865 – American Civil War: The Battle of Bentonville begins. By the end of the battle two days later, Confederate forces had retreated from Four Oaks, North Carolina.\n* 1885 – Louis Riel declares a provisional government in Saskatchewan, beginning the North-West Rebellion.\n* 1895 – Auguste and Louis Lumière record their first footage using their newly patented cinematograph.\n* 1918 – The U.S. Congress establishes time zones and approves daylight saving time.\n* 1920 – The United States Senate rejects the Treaty of Versailles for the second time (the first time was on November 19, 1919).\n* 1921 – Irish War of Independence: One of the biggest engagements of the war takes place at Crossbarry, County Cork. About 100 Irish Republican Army (IRA) volunteers escape an attempt by over 1,300 British forces to encircle them.\n* 1931 – Gambling is legalized in Nevada.\n* 1932 – The Sydney Harbour Bridge is opened.\n* 1941 – World War II: The 99th Pursuit Squadron also known as the Tuskegee Airmen, the first all-black unit of the US Army Air Corps, is activated.\n* 1943 – Frank Nitti, the Chicago Outfit Boss after Al Capone, commits suicide at the Chicago Central Railyard.\n* 1944 – World War II: Nazi forces occupy Hungary.\n* 1945 – World War II: Off the coast of Japan, a dive bomber hits the aircraft carrier , killing 724 of her crew. Badly damaged, the ship is able to return to the U.S. under her own power.\n*  1945   – World War II: Adolf Hitler issues his \"Nero Decree\" ordering all industries, military installations, shops, transportation facilities and communications facilities in Germany to be destroyed.\n* 1946 – French Guiana, Guadeloupe, Martinique and Réunion become overseas départements of France.\n* 1954 – Joey Giardello knocks out Willie Tory in round seven at Madison Square Garden in the first televised prize boxing fight shown in colour.\n*  1954   – Willie Mosconi sets a world record by running 526 consecutive balls without a miss during a straight pool exhibition at East High Billiard Club in Springfield, Ohio, setting a record which remains unbroken. \n* 1958 – The Monarch Underwear Company fire leaves 24 dead and 15 injured.\n* 1962 – Highly influential artist, Bob Dylan releases his first album, Bob Dylan, for Columbia Records.\n*  1962   – Algerian War of Independence ends.\n* 1965 – The wreck of the , valued at over $50,000,000 and said to have been the most powerful Confederate cruiser, is discovered by teenage diver and pioneer underwater archaeologist E. Lee Spence, exactly 102 years after its destruction.\n* 1966 – Texas Western becomes the first college basketball team to win the Final four with an all-black starting lineup.\n* 1969 – The 385 m tall TV-mast at Emley Moor transmitting station, United Kingdom, collapses due to ice build-up.\n* 1979 – The United States House of Representatives begins broadcasting its day-to-day business via the cable television network C-SPAN.\n* 1982 – Falklands War: Argentinian forces land on South Georgia Island, precipitating war with the United Kingdom.\n* 1987 – Televangelist Jim Bakker resigns as head of the PTL Club due to a brewing sex scandal; he hands over control to Jerry Falwell.\n* 1989 – The Egyptian flag is raised at Taba marking the end of Israeli occupation since the Yom Kippur War in 1973 and the peace negotiations in 1979.\n* 1990 – The ethnic clashes of Târgu Mureș begin four days after the anniversary of the Revolutions of 1848 in the Austrian Empire.\n* 2002 – Zimbabwe is suspended from the Commonwealth on charges of human rights abuses and of electoral fraud, following a turbulent presidential election.\n\n* 2004 – A Swedish DC-3 shot down by a Russian MiG-15 in 1952 over the Baltic Sea is finally recovered after years of work. The remains of the three crewmen are left in place, pending further investigations.\n*  2004   – 3-19 shooting incident: Taiwanese president Chen Shui-bian is shot just before the country's presidential election on March 20.\n* 2008 – GRB 080319B: A cosmic burst that is the farthest object visible to the naked eye is briefly observed.\n* 2011 – Libyan Civil War: After the failure of Muammar Gaddafi's forces to take Benghazi, French Air Force launches Opération Harmattan, beginning foreign military intervention in Libya.\n* 2013 – A series of bombings and shootings kills at least 98 people and injures 240 others across Iraq.\n* 2016 – Flydubai Flight 981 crashes while attempting to land at Rostov-on-Don international airport, killing all 62 on board.\n*  2016   – An explosion occurs in Taksim Square in Istanbul, Turkey, killing five people and injuring 36. \n\nBirths\n\n* 1206 – Güyük Khan, Mongol ruler, 3rd Great Khan of the Mongol Empire (d. 1248)\n* 1434 – Ashikaga Yoshikatsu, Japanese shogun (d. 1443)\n* 1488 – Johannes Magnus, Swedish archbishop and theologian (d. 1544)\n* 1534 – José de Anchieta, Spanish missionary and saint (d. 1597)\n* 1542 – Jan Zamoyski, Polish nobleman (d. 1605)\n* 1601 – Alonzo Cano, Spanish painter, sculptor, and architect (d. 1667)\n* 1604 – John IV of Portugal (d. 1656)\n* 1641 – Abd al-Ghani al-Nabulsi, Syrian author and scholar (d. 1731)\n* 1661 – Francesco Gasparini, Italian composer and educator (d. 1727)\n* 1684 – Jean Astruc, French physician and scholar (d. 1766)\n* 1721 – Tobias Smollett, Scottish-Italian poet and author (d. 1771)\n* 1734 – Thomas McKean, American lawyer and politician, 2nd Governor of Pennsylvania (d. 1817)\n* 1739 – Charles-François Lebrun, duc de Plaisance, French lawyer and politician (d. 1824)\n* 1742 – Túpac Amaru II, Peruvian rebel leader (d. 1781)\n* 1748 – Elias Hicks, American farmer, minister, and theologian (d. 1830)\n* 1778 – Edward Pakenham, Anglo-Irish general and politician (d. 1815)\n* 1809 – Fredrik Pacius, German composer and conductor (d. 1891)\n* 1813 – David Livingstone, Scottish missionary and explorer (d. 1873)\n* 1816 – Johannes Verhulst, Dutch composer and conductor (d. 1891)\n* 1821 – Richard Francis Burton, English soldier, geographer, and diplomat (d. 1890)\n* 1824 – William Allingham, Irish poet, author, and scholar (d. 1889)\n* 1829 – Carl Frederik Tietgen, Danish businessman (d. 1901)\n* 1844 – Minna Canth, Finnish journalist, playwright, and activist (d. 1897)\n* 1847 – Albert Pinkham Ryder, American painter (d. 1917)\n* 1848 – Wyatt Earp, American police officer (d. 1929)\n* 1849 – Alfred von Tirpitz, Polish-German admiral and politician (d. 1930)\n* 1858 – Kang Youwei, Chinese scholar and politician (d. 1927)\n* 1860 – William Jennings Bryan, American lawyer and politician, 41st United States Secretary of State (d. 1925)\n* 1861 – Lomer Gouin, Canadian lawyer and politician, 13th Premier of Quebec (d. 1929)\n* 1864 – Charles Marion Russell, American painter and sculptor (d. 1926)\n* 1865 – William Morton Wheeler, American entomologist, myrmecologist, and academic (d. 1937)\n* 1868 – Senda Berenson Abbott, Lithuanian-born Jewish-American basketball player and educator (d. 1954)\n* 1871 – Schofield Haigh, English cricketer and coach (d. 1921)\n* 1872 – Anna Held, Polish singer (d. 1918)\n* 1873 – Max Reger, German pianist, composer, and conductor (d. 1916)\n* 1876 – Felix Jacoby, German philologist (d. 1959)\n* 1881 – Edith Nourse Rogers, American social worker and politician (d. 1960)\n* 1882 – Gaston Lachaise, French-American sculptor (d. 1935)\n* 1883 – Norman Haworth, English chemist and academic, Nobel Prize laureate (d. 1950)\n*  1883   – Joseph Stilwell, American general (d. 1946)\n* 1885 – Attik, Greek composer (d. 1944)\n* 1888 – Josef Albers, German-American painter and educator (d. 1976)\n*  1888   – Léon Scieur, Belgian cyclist (d. 1969)\n* 1891 – Earl Warren, American lieutenant, jurist, and politician, 14th Chief Justice of the United States (d. 1974)\n* 1892 – Theodore Sizer, American professor of the history of art (d. 1967) \n*  1892   – Ado Vabbe, Estonian painter (d. 1961)\n*  1892   – James Van Fleet, American general and diplomat (d. 1992)\n* 1894 – Moms Mabley, American comedian and singer (d. 1975)\n* 1900 – Carmen Carbonell, Spanish stage and film actress (d. 1988)\n*  1900   – Frédéric Joliot-Curie, French physicist and academic, Nobel Prize laureate (d. 1958)\n* 1901 – Jo Mielziner, French-American set designer (d. 1976)\n* 1904 – John Sirica, American lawyer and judge (d. 1992)\n* 1905 – Joe Rollino, American weightlifter and boxer (d. 2010)\n*  1905   – Albert Speer, German architect and politician (d. 1981)\n* 1906 – Adolf Eichmann, German SS officer (d. 1962)\n* 1909 – Louis Hayward, South African-born American actor (d. 1985)\n* 1910 – Joseph Carroll, American general (d. 1991)\n* 1912 – Hugh Watt, Australian-New Zealand engineer and politician, Prime Minister of New Zealand (d. 1980)\n* 1914 – Leonidas Alaoglu, Canadian-American mathematician and theorist (d. 1981)\n*  1914   – Jay Berwanger, American football player and coach (d. 2002)\n* 1915 – Robert G. Cole, American colonel, Medal of Honor recipient (d. 1944)\n*  1915   – Patricia Morison, American actress and singer\n* 1916 – Eric Christmas, English-Canadian actor (d. 2000)\n*  1916   – Irving Wallace, American journalist, author, and screenwriter (d. 1990)\n* 1917 – Laszlo Szabo, Hungarian chess player (d. 1998)\n* 1919 – Lennie Tristano, American pianist, composer, and educator (d. 1978)\n* 1920 – Kjell Aukrust, Norwegian author, poet, and painter (d. 2002)\n* 1921 – Tommy Cooper, British magician and prop comedian (d. 1984)\n* 1922 – Guy Lewis, American basketball player and coach (d. 2015)\n*  1922   – Hiroo Onoda, Japanese lieutenant (d. 2014)\n* 1923 – Pamela Britton, American actress (d. 1974)\n*  1923   – Benito Jacovitti, Italian illustrator (d. 1997)\n*  1923   – Henry Morgentaler, Polish-Canadian physician and activist (d. 2013)\n* 1924 – Joe Gaetjens, Haitian footballer (d. 1964)\n* 1925 – Brent Scowcroft, American general and diplomat, 9th United States National Security Advisor\n* 1927 – Richie Ashburn, American baseball player and sportscaster (d. 1997)\n* 1928 – Hans Küng, Swiss theologian and author\n*  1928   – Patrick McGoohan, Irish-American actor, director, producer, and screenwriter (d. 2009)\n* 1931 – Emma Andijewska, Ukrainian poet, writer and painter\n* 1932 – Gay Brewer, American golfer (d. 2007)\n*  1932   – Peter Hall, English geographer, author, and academic (d. 2014)\n*  1932   – Gail Kobe, American actress and producer (d. 2013)\n* 1933 – Phyllis Newman, American actress and singer\n*  1933   – Philip Roth, American novelist\n*  1933   – Renée Taylor, American actress, producer, and screenwriter\n*  1933   – Richard Williams, Canadian-English animator, director, and screenwriter\n* 1935 – Nancy Malone, American actress, director, and producer (d. 2014)\n*  1935   – Burt Metcalfe, Canadian-American director, producer, and screenwriter\n* 1936 – Ursula Andress, Swiss model and actress\n*  1936   – Ben Lexcen, Australian sailor and architect (d. 1988)\n* 1937 – Clarence \"Frogman\" Henry, American R&B singer and pianist\n*  1937   – Egon Krenz, German politician\n* 1938 – Joe Kapp, American football player, coach, and actor\n* 1942 – Richard Dobson, American singer-songwriter and guitarist\n*  1942   – Heather Robertson, Canadian journalist and author (d. 2014)\n* 1943 – Mario J. Molina, Mexican chemist and academic, Nobel Prize laureate\n*  1943   – Mario Monti, Italian economist and politician, Prime Minister of Italy\n*  1943   – Vern Schuppan, Australian race car driver\n* 1944 – Said Musa, Belizean lawyer and politician, 5th Prime Minister of Belize\n* 1945 – John Holder, English cricketer and umpire\n*  1945   – Modestas Paulauskas, Lithuanian basketball player and coach\n* 1946 – Paul Atkinson, English guitarist and A&R executive (d. 2004) \n*  1946   – Ruth Pointer, American singer-songwriter and producer \n* 1947 – Glenn Close, American actress, singer, and producer\n*  1947   – Joe Dolce, American-Australian singer-songwriter and guitarist\n*  1947   – Marinho Peres, Brazilian footballer and coach\n* 1948 – David Schnitter, American saxophonist and educator\n* 1949 – Blase J. Cupich, American theologian and cardinal\n* 1950 – José S. Palma, Filipino archbishop\n*  1950   – James Redfield, American author, screenwriter, and producer\n* 1952 – Wolfgang Ambros, Austrian singer-songwriter and guitarist \n*  1952   – Chris Brubeck, American pianist and composer\n*  1952   – Warren Lees, New Zealand cricketer and coach\n*  1952   – Martin Ravallion, Australian economist and academic\n*  1952   – Harvey Weinstein, American director and producer\n* 1953 – Ian Blair, English police officer\n*  1953   – Peter Hendy, English businessman\n*  1953   – Billy Sheehan, American bass player and songwriter \n*  1953   – Ricky Wilson, American singer-songwriter and musician (d. 1985) \n* 1954 – Cho Kwang-rae, South Korean footballer, coach, and manager\n* 1955 – Bruce Willis, German-American actor and producer\n* 1956 – Yegor Gaidar, Russian economist and politician, First Deputy Prime Minister of Russia (d. 2009)\n* 1958 – Andy Reid, American football player and coach\n* 1959 – Terry Hall, English singer-songwriter \n* 1960 – Eliane Elias, Brazilian singer-songwriter and pianist\n* 1962 – Iván Calderón, Puerto Rican-American baseball player (d. 2003)\n* 1963 – Neil LaBute, American director and screenwriter\n*  1963   – Mary Scheer, American actress, comedian, producer, and screenwriter\n* 1964 – Yoko Kanno, Japanese pianist and composer \n*  1964   – Jake Weber, English actor\n* 1966 – Michael Crockart, Scottish police officer and politician\n*  1966   – Olaf Marschall, German footballer and manager\n*  1966   – Andy Sinton, English footballer and manager\n* 1967 – Vladimir Konstantinov, Russian-American ice hockey player\n*  1967   – Katia Tiutiunnik, Australian viola player and composer\n* 1968 – Tyrone Hill, American basketball player and coach\n* 1969 – Gary Jules, American singer-songwriter and guitarist\n*  1969   – Tom McRae, English singer-songwriter and guitarist\n* 1970 – Gert Bettens, Belgian guitarist and songwriter \n*  1970   – Harald Johnsen, Norwegian bassist and composer (d. 2011)\n*  1970   – Michael Krumm, German race car driver\n* 1973 – Brant Bjork, American drummer \n*  1973   – Ashley Giles, English cricketer and coach\n* 1976 – Rachel Blanchard, Canadian actress\n*  1976   – Andre Miller, American basketball player\n*  1976   – Alessandro Nesta, Italian footballer and manager\n* 1978 – Cydonie Mothersille, Jamaican-Caymanian sprinter\n* 1979 – Sheldon Brown, American football player\n*  1979   – Hee-seop Choi, South Korean-American baseball player\n*  1979   – Ivan Ljubičić, Croatian tennis player\n*  1979   – Christos Patsatzoglou, Greek footballer\n*  1979   – Hedo Türkoğlu, Turkish basketball player\n* 1980 – Luca Ferri, Italian footballer\n*  1980   – Taichi Ishikari, Japanese wrestler\n*  1980   – Mikuni Shimokawa, Japanese singer-songwriter \n* 1981 – Steve Cummings, English cyclist\n*  1981   – Kolo Touré, Ivorian footballer\n* 1982 – Jonathan Fanene, American football player\n*  1982   – Brad Jones, Australian footballer\n*  1982   – Eduardo Saverin, Brazilian-Singaporean businessman\n*  1982   – Yoshikaze Masatsugu, Japanese sumo wrestler\n* 1985 – Inesa Jurevičiūtė, Lithuanian figure skater\n* 1986 – Tyler Bozak, Canadian ice hockey player\n* 1987 – Michal Švec, Czech footballer\n*  1987   – Miloš Teodosić, Serbian basketball player\n* 1988 – Clayton Kershaw, American baseball player\n*  1991   – Aleksandr Kokorin, Russian footballer\n* 1993 – Mateusz Szwoch, Polish footballer\n*  1993   – Hakim Ziyech, Moroccan footballer\n* 1995 – Alexei Sintsov, Russian figure skater\n* 1996 – Barbara Haas, Austrian tennis player\n\nDeaths\n\n* 235 – Severus Alexander, Roman emperor (b. 208)\n* 953 – Al-Mansur Billah, caliph of the Fatimid Caliphate (b. 913)\n* 968 – Emma of Paris, duchess of Normandy (b. 943)\n* 1238 – Henry the Bearded, Polish duke and son of Bolesław I the Tall (b. 1163)\n* 1263 – Hugh of Saint-Cher, French cardinal (b. 1200)\n* 1279 – Zhao Bing, Chinese emperor (b. 1271)\n* 1286 – Alexander III, king of Scotland (b. 1241)\n* 1330 – Edmund of Woodstock, 1st Earl of Kent, English politician, Lord Warden of the Cinque Ports (b. 1301)\n* 1372 – John II, marquess of Montferrat (b. 1321)\n* 1533 – John Bourchier, 2nd Baron Berners, English baron and statesman (b. 1467)\n* 1534 – Michael Weiße, German theologian (b. c. 1488)\n* 1539 – Lord Edmund Howard, English nobleman (b. c. 1478)\n* 1563 – Arthur Brooke, English poet\n* 1568 – Elizabeth Seymour, Lady Cromwell, English noblewoman (b.c. 1518)\n* 1581 – Francis I, duke of Saxe-Lauenburg (b. 1510)\n* 1612 – Sophia Olelkovich Radziwill, Belarusian saint (b. 1585)\n* 1637 – Péter Pázmány, Hungarian cardinal (b. 1570)\n* 1649 – Gerhard Johann Vossius, German scholar and theologian (b. 1577)\n* 1683 – Thomas Killigrew, English playwright and manager (b. 1612)\n* 1687 – René-Robert Cavelier, Sieur de La Salle, French-American explorer (b. 1643)\n* 1697 – Nicolaus Bruhns, German organist and composer (b. 1665)\n* 1711 – Thomas Ken, English bishop and hymn-writer (b. 1637)\n* 1717 – John Campbell, 1st Earl of Breadalbane and Holland, Scottish soldier (b. 1636)\n* 1721 – Pope Clement XI (b. 1649)\n* 1783 – Frederick Cornwallis, English archbishop (b. 1713)\n* 1790 – Cezayirli Gazi Hasan Pasha, Ottoman general and politician, 182nd Grand Vizier of the Ottoman Empire (b. 1713)\n* 1797 – Philip Hayes, English organist and composer (b. 1738)\n* 1816 – Philip Mazzei, Italian-American physician and philosopher (b. 1730)\n* 1871 – Wilhelm Karl Ritter von Haidinger, Austrian mineralogist, geologist, and physicist (b. 1795)\n* 1897 – Antoine Thomson d'Abbadie, Irish-French geographer, ethnologist, linguist, and astronomer (b. 1810)\n* 1900 – John Bingham, American lawyer and politician, 7th United States Ambassador to Japan (b. 1815)\n*  1900   – Charles-Louis Hanon, French pianist and composer (b. 1819)\n* 1914 – Giuseppe Mercalli, Italian priest, geologist, and volcanologist (b. 1850)\n* 1919 – Emma Bell Miles, American writer, poet, and artist of Appalachia (b. 1879)\n* 1930 – Arthur Balfour, Scottish-English politician, Prime Minister of the United Kingdom (b. 1848)\n* 1942 – Clinton Hart Merriam, American zoologist, ornithologist, and entomologist (b. 1855)\n* 1944 – William Hale Thompson, American rancher and politician, 41st Mayor of Chicago (b. 1869)\n* 1949 – James Somerville, English admiral and politician, Lord Lieutenant of Somerset (b. 1882)\n* 1950 – Edgar Rice Burroughs, American soldier and author (b. 1875)\n*  1950   – Norman Haworth, English chemist and academic, Nobel Prize laureate (b. 1883)\n* 1951 – Dmytro Doroshenko, Ukrainian historian and politician, Prime Minister of Ukraine (b. 1882)\n* 1973 – Lauritz Melchior, Danish-American tenor and actor (b. 1890)\n* 1976 – Albert Dieudonné, French actor and author (b. 1889)\n*  1976   – Paul Kossoff, English guitarist and songwriter (b. 1950)\n* 1977 – William L. Laurence, Lithuanian-born American journalist and author (b. 1888)\n* 1978 – M. A. Ayyangar, Indian lawyer and politician, 2nd Speaker of the Lok Sabha (b. 1891)\n* 1982 – J. B. Kripalani, Indian lawyer and politician (b. 1888)\n*  1982   – Randy Rhoads, American guitarist, songwriter, and producer (b. 1956)\n* 1984 – Garry Winogrand, American photographer (b. 1928)\n* 1986 – Sabino Barinaga, Spanish footballer and manager (b. 1922)\n* 1987 – Louis de Broglie, French physicist and academic, Nobel Prize laureate (b. 1892)\n* 1988 – Bun Cook, Canadian ice hockey player and coach (b. 1904)\n* 1990 – Andrew Wood, American singer-songwriter (b. 1966)\n* 1993 – Henrik Sandberg, Danish production manager and producer (b. 1915)\n* 1996 – Lise Østergaard, Danish psychologist and politician (b. 1924)\n*  1996   – Virginia Henderson, American nurse, researcher, theorist and author (b. 1897)\n* 1997 – Willem de Kooning, Dutch-American painter and educator (b. 1904)\n*  1997   – Eugène Guillevic, French poet and author (b. 1907)\n* 1998 – E. M. S. Namboodiripad, Indian theorist and politician, 1st Chief Minister of Kerala (b. 1909)\n* 1999 – Tofilau Eti Alesana, Samoan politician, 5th Prime Minister of Samoa (b. 1924)\n* 2000 – Joanne Weaver, American baseball player (b. 1935)\n*  2000   – Shafiq-ur-Rahman, Pakistani physician and author (b. 1920)\n* 2003 – Michael Mathias Prechtl, German soldier and illustrator (b. 1926)\n* 2004 – Mitchell Sharp, Canadian economist and politician, 23rd Canadian Minister of Finance (b. 1911)\n* 2005 – John DeLorean, American engineer and businessman, founded the DeLorean Motor Company (b. 1925)\n* 2008 – Arthur C. Clarke, British science fiction writer (b. 1917)\n*  2008   – Hugo Claus, Belgian author, poet, and playwright (b. 1929)\n*  2008   – Paul Scofield, English actor (b. 1922)\n* 2009 – Maria Bergson, Austrian-American architect and interior designer (b. 1914)\n* 2011 – Kym Bonython, Australian drummer and radio host (b. 1920)\n* 2012 – Jim Case, American director and producer (b. 1927)\n*  2012   – Ulu Grosbard, Belgian-American director and producer (b. 1929)\n*  2012   – Clancy Lyall, American sergeant (b. 1925)\n*  2012   – Hugo Munthe-Kaas, Norwegian intelligence agent (b. 1922)\n* 2014 – Patrick Joseph McGovern, American businessman, founded IDG (b. 1937)\n*  2014   – Fred Phelps, American lawyer, pastor, and activist, founded the Westboro Baptist Church (b. 1929)\n*  2014   – Heather Robertson, Canadian journalist and author (b. 1942)\n*  2014   – Robert S. Strauss, American diplomat, United States Ambassador to Russia (b. 1918)\n*  2014   – Lawrence Walsh, Canadian-American lawyer, judge, and politician, 4th United States Deputy Attorney General (b. 1912)\n*  2014   – Joseph F. Weis, Jr., American lawyer and judge (b. 1923)\n* 2015 – Gus Douglass, American farmer and politician (b. 1927)\n*  2015   – Safet Plakalo, Bosnian author and playwright (b. 1950)\n*  2015   – Danny Schechter, American director, producer, and screenwriter (b. 1942)\n* 2016 – Roger Agnelli, Brazilian banker and businessman (b. 1959)\n*  2016   – Jack Mansell, English footballer and manager (b. 1927)\n\nHolidays and observances\n\n* Christian feast day:\n** Joseph of Nazareth (Western Christianity - if this date falls on Sunday, the feast is moved to Monday March 20)\n** March 19 (Eastern Orthodox liturgics)\n* Earliest day on which Maundy Thursday can fall, while April 22 is the latest; celebrated on Thursday before Easter. (Christianity)\n* Minna Canth's Birthday (Finland)\n* St Joseph's Day (Roman Catholicism and Anglican Communion) related observances:\n** Father's Day (Spain, Portugal, Belgium, Italy, Honduras, and Bolivia)\n** Las Fallas, celebrated on the week leading to March 19. (Valencia)\n** \"Return of the Swallow\", annual observance of the swallows' return to Mission San Juan Capistrano in California.\n* Kashubian Unity Day (Poland)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "March 19" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20316" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 1279 – A Mongol victory at the Battle of Yamen ends the Song dynasty in China.\n* 1563 – The Edict of Amboise is signed, ending the first phase of the French Wars of Religion and granting certain freedoms to the Huguenots.\n* 1649 – The House of Commons of England passes an act abolishing the House of Lords, declaring it \"useless and dangerous to the people of England\".\n* 1687 – Explorer Robert Cavelier de La Salle, searching for the mouth of the Mississippi River, is murdered by his own men.\n* 1812 – The Cádiz Cortes promulgates the Spanish Constitution of 1812.\n* 1853 – The Taiping reform movement occupies and makes Nanjing its capital until 1864.\n* 1861 – The First Taranaki War ends in New Zealand.\n* 1863 – The , said to have been the most powerful Confederate cruiser, is destroyed on her maiden voyage with a cargo of munitions, medicines and merchandise then valued at over $1,000,000.\n* 1865 – American Civil War: The Battle of Bentonville begins. By the end of the battle two days later, Confederate forces had retreated from Four Oaks, North Carolina.\n* 1885 – Louis Riel declares a provisional government in Saskatchewan, beginning the North-West Rebellion.\n* 1895 – Auguste and Louis Lumière record their first footage using their newly patented cinematograph.\n* 1918 – The U.S. Congress establishes time zones and approves daylight saving time.\n* 1920 – The United States Senate rejects the Treaty of Versailles for the second time (the first time was on November 19, 1919).\n* 1921 – Irish War of Independence: One of the biggest engagements of the war takes place at Crossbarry, County Cork. About 100 Irish Republican Army (IRA) volunteers escape an attempt by over 1,300 British forces to encircle them.\n* 1931 – Gambling is legalized in Nevada.\n* 1932 – The Sydney Harbour Bridge is opened.\n* 1941 – World War II: The 99th Pursuit Squadron also known as the Tuskegee Airmen, the first all-black unit of the US Army Air Corps, is activated.\n* 1943 – Frank Nitti, the Chicago Outfit Boss after Al Capone, commits suicide at the Chicago Central Railyard.\n* 1944 – World War II: Nazi forces occupy Hungary.\n* 1945 – World War II: Off the coast of Japan, a dive bomber hits the aircraft carrier , killing 724 of her crew. Badly damaged, the ship is able to return to the U.S. under her own power.\n*  1945   – World War II: Adolf Hitler issues his \"Nero Decree\" ordering all industries, military installations, shops, transportation facilities and communications facilities in Germany to be destroyed.\n* 1946 – French Guiana, Guadeloupe, Martinique and Réunion become overseas départements of France.\n* 1954 – Joey Giardello knocks out Willie Tory in round seven at Madison Square Garden in the first televised prize boxing fight shown in colour.\n*  1954   – Willie Mosconi sets a world record by running 526 consecutive balls without a miss during a straight pool exhibition at East High Billiard Club in Springfield, Ohio, setting a record which remains unbroken. \n* 1958 – The Monarch Underwear Company fire leaves 24 dead and 15 injured.\n* 1962 – Highly influential artist, Bob Dylan releases his first album, Bob Dylan, for Columbia Records.\n*  1962   – Algerian War of Independence ends.\n* 1965 – The wreck of the , valued at over $50,000,000 and said to have been the most powerful Confederate cruiser, is discovered by teenage diver and pioneer underwater archaeologist E. Lee Spence, exactly 102 years after its destruction.\n* 1966 – Texas Western becomes the first college basketball team to win the Final four with an all-black starting lineup.\n* 1969 – The 385 m tall TV-mast at Emley Moor transmitting station, United Kingdom, collapses due to ice build-up.\n* 1979 – The United States House of Representatives begins broadcasting its day-to-day business via the cable television network C-SPAN.\n* 1982 – Falklands War: Argentinian forces land on South Georgia Island, precipitating war with the United Kingdom.\n* 1987 – Televangelist Jim Bakker resigns as head of the PTL Club due to a brewing sex scandal; he hands over control to Jerry Falwell.\n* 1989 – The Egyptian flag is raised at Taba marking the end of Israeli occupation since the Yom Kippur War in 1973 and the peace negotiations in 1979.\n* 1990 – The ethnic clashes of Târgu Mureș begin four days after the anniversary of the Revolutions of 1848 in the Austrian Empire.\n* 2002 – Zimbabwe is suspended from the Commonwealth on charges of human rights abuses and of electoral fraud, following a turbulent presidential election.\n\n* 2004 – A Swedish DC-3 shot down by a Russian MiG-15 in 1952 over the Baltic Sea is finally recovered after years of work. The remains of the three crewmen are left in place, pending further investigations.\n*  2004   – 3-19 shooting incident: Taiwanese president Chen Shui-bian is shot just before the country's presidential election on March 20.\n* 2008 – GRB 080319B: A cosmic burst that is the farthest object visible to the naked eye is briefly observed.\n* 2011 – Libyan Civil War: After the failure of Muammar Gaddafi's forces to take Benghazi, French Air Force launches Opération Harmattan, beginning foreign military intervention in Libya.\n* 2013 – A series of bombings and shootings kills at least 98 people and injures 240 others across Iraq.\n* 2016 – Flydubai Flight 981 crashes while attempting to land at Rostov-on-Don international airport, killing all 62 on board.\n*  2016   – An explosion occurs in Taksim Square in Istanbul, Turkey, killing five people and injuring 36. \n\nBirths\n\n* 1206 – Güyük Khan, Mongol ruler, 3rd Great Khan of the Mongol Empire (d. 1248)\n* 1434 – Ashikaga Yoshikatsu, Japanese shogun (d. 1443)\n* 1488 – Johannes Magnus, Swedish archbishop and theologian (d. 1544)\n* 1534 – José de Anchieta, Spanish missionary and saint (d. 1597)\n* 1542 – Jan Zamoyski, Polish nobleman (d. 1605)\n* 1601 – Alonzo Cano, Spanish painter, sculptor, and architect (d. 1667)\n* 1604 – John IV of Portugal (d. 1656)\n* 1641 – Abd al-Ghani al-Nabulsi, Syrian author and scholar (d. 1731)\n* 1661 – Francesco Gasparini, Italian composer and educator (d. 1727)\n* 1684 – Jean Astruc, French physician and scholar (d. 1766)\n* 1721 – Tobias Smollett, Scottish-Italian poet and author (d. 1771)\n* 1734 – Thomas McKean, American lawyer and politician, 2nd Governor of Pennsylvania (d. 1817)\n* 1739 – Charles-François Lebrun, duc de Plaisance, French lawyer and politician (d. 1824)\n* 1742 – Túpac Amaru II, Peruvian rebel leader (d. 1781)\n* 1748 – Elias Hicks, American farmer, minister, and theologian (d. 1830)\n* 1778 – Edward Pakenham, Anglo-Irish general and politician (d. 1815)\n* 1809 – Fredrik Pacius, German composer and conductor (d. 1891)\n* 1813 – David Livingstone, Scottish missionary and explorer (d. 1873)\n* 1816 – Johannes Verhulst, Dutch composer and conductor (d. 1891)\n* 1821 – Richard Francis Burton, English soldier, geographer, and diplomat (d. 1890)\n* 1824 – William Allingham, Irish poet, author, and scholar (d. 1889)\n* 1829 – Carl Frederik Tietgen, Danish businessman (d. 1901)\n* 1844 – Minna Canth, Finnish journalist, playwright, and activist (d. 1897)\n* 1847 – Albert Pinkham Ryder, American painter (d. 1917)\n* 1848 – Wyatt Earp, American police officer (d. 1929)\n* 1849 – Alfred von Tirpitz, Polish-German admiral and politician (d. 1930)\n* 1858 – Kang Youwei, Chinese scholar and politician (d. 1927)\n* 1860 – William Jennings Bryan, American lawyer and politician, 41st United States Secretary of State (d. 1925)\n* 1861 – Lomer Gouin, Canadian lawyer and politician, 13th Premier of Quebec (d. 1929)\n* 1864 – Charles Marion Russell, American painter and sculptor (d. 1926)\n* 1865 – William Morton Wheeler, American entomologist, myrmecologist, and academic (d. 1937)\n* 1868 – Senda Berenson Abbott, Lithuanian-born Jewish-American basketball player and educator (d. 1954)\n* 1871 – Schofield Haigh, English cricketer and coach (d. 1921)\n* 1872 – Anna Held, Polish singer (d. 1918)\n* 1873 – Max Reger, German pianist, composer, and conductor (d. 1916)\n* 1876 – Felix Jacoby, German philologist (d. 1959)\n* 1881 – Edith Nourse Rogers, American social worker and politician (d. 1960)\n* 1882 – Gaston Lachaise, French-American sculptor (d. 1935)\n* 1883 – Norman Haworth, English chemist and academic, Nobel Prize laureate (d. 1950)\n*  1883   – Joseph Stilwell, American general (d. 1946)\n* 1885 – Attik, Greek composer (d. 1944)\n* 1888 – Josef Albers, German-American painter and educator (d. 1976)\n*  1888   – Léon Scieur, Belgian cyclist (d. 1969)\n* 1891 – Earl Warren, American lieutenant, jurist, and politician, 14th Chief Justice of the United States (d. 1974)\n* 1892 – Theodore Sizer, American professor of the history of art (d. 1967) \n*  1892   – Ado Vabbe, Estonian painter (d. 1961)\n*  1892   – James Van Fleet, American general and diplomat (d. 1992)\n* 1894 – Moms Mabley, American comedian and singer (d. 1975)\n* 1900 – Carmen Carbonell, Spanish stage and film actress (d. 1988)\n*  1900   – Frédéric Joliot-Curie, French physicist and academic, Nobel Prize laureate (d. 1958)\n* 1901 – Jo Mielziner, French-American set designer (d. 1976)\n* 1904 – John Sirica, American lawyer and judge (d. 1992)\n* 1905 – Joe Rollino, American weightlifter and boxer (d. 2010)\n*  1905   – Albert Speer, German architect and politician (d. 1981)\n* 1906 – Adolf Eichmann, German SS officer (d. 1962)\n* 1909 – Louis Hayward, South African-born American actor (d. 1985)\n* 1910 – Joseph Carroll, American general (d. 1991)\n* 1912 – Hugh Watt, Australian-New Zealand engineer and politician, Prime Minister of New Zealand (d. 1980)\n* 1914 – Leonidas Alaoglu, Canadian-American mathematician and theorist (d. 1981)\n*  1914   – Jay Berwanger, American football player and coach (d. 2002)\n* 1915 – Robert G. Cole, American colonel, Medal of Honor recipient (d. 1944)\n*  1915   – Patricia Morison, American actress and singer\n* 1916 – Eric Christmas, English-Canadian actor (d. 2000)\n*  1916   – Irving Wallace, American journalist, author, and screenwriter (d. 1990)\n* 1917 – Laszlo Szabo, Hungarian chess player (d. 1998)\n* 1919 – Lennie Tristano, American pianist, composer, and educator (d. 1978)\n* 1920 – Kjell Aukrust, Norwegian author, poet, and painter (d. 2002)\n* 1921 – Tommy Cooper, British magician and prop comedian (d. 1984)\n* 1922 – Guy Lewis, American basketball player and coach (d. 2015)\n*  1922   – Hiroo Onoda, Japanese lieutenant (d. 2014)\n* 1923 – Pamela Britton, American actress (d. 1974)\n*  1923   – Benito Jacovitti, Italian illustrator (d. 1997)\n*  1923   – Henry Morgentaler, Polish-Canadian physician and activist (d. 2013)\n* 1924 – Joe Gaetjens, Haitian footballer (d. 1964)\n* 1925 – Brent Scowcroft, American general and diplomat, 9th United States National Security Advisor\n* 1927 – Richie Ashburn, American baseball player and sportscaster (d. 1997)\n* 1928 – Hans Küng, Swiss theologian and author\n*  1928   – Patrick McGoohan, Irish-American actor, director, producer, and screenwriter (d. 2009)\n* 1931 – Emma Andijewska, Ukrainian poet, writer and painter\n* 1932 – Gay Brewer, American golfer (d. 2007)\n*  1932   – Peter Hall, English geographer, author, and academic (d. 2014)\n*  1932   – Gail Kobe, American actress and producer (d. 2013)\n* 1933 – Phyllis Newman, American actress and singer\n*  1933   – Philip Roth, American novelist\n*  1933   – Renée Taylor, American actress, producer, and screenwriter\n*  1933   – Richard Williams, Canadian-English animator, director, and screenwriter\n* 1935 – Nancy Malone, American actress, director, and producer (d. 2014)\n*  1935   – Burt Metcalfe, Canadian-American director, producer, and screenwriter\n* 1936 – Ursula Andress, Swiss model and actress\n*  1936   – Ben Lexcen, Australian sailor and architect (d. 1988)\n* 1937 – Clarence \"Frogman\" Henry, American R&B singer and pianist\n*  1937   – Egon Krenz, German politician\n* 1938 – Joe Kapp, American football player, coach, and actor\n* 1942 – Richard Dobson, American singer-songwriter and guitarist\n*  1942   – Heather Robertson, Canadian journalist and author (d. 2014)\n* 1943 – Mario J. Molina, Mexican chemist and academic, Nobel Prize laureate\n*  1943   – Mario Monti, Italian economist and politician, Prime Minister of Italy\n*  1943   – Vern Schuppan, Australian race car driver\n* 1944 – Said Musa, Belizean lawyer and politician, 5th Prime Minister of Belize\n* 1945 – John Holder, English cricketer and umpire\n*  1945   – Modestas Paulauskas, Lithuanian basketball player and coach\n* 1946 – Paul Atkinson, English guitarist and A&R executive (d. 2004) \n*  1946   – Ruth Pointer, American singer-songwriter and producer \n* 1947 – Glenn Close, American actress, singer, and producer\n*  1947   – Joe Dolce, American-Australian singer-songwriter and guitarist\n*  1947   – Marinho Peres, Brazilian footballer and coach\n* 1948 – David Schnitter, American saxophonist and educator\n* 1949 – Blase J. Cupich, American theologian and cardinal\n* 1950 – José S. Palma, Filipino archbishop\n*  1950   – James Redfield, American author, screenwriter, and producer\n* 1952 – Wolfgang Ambros, Austrian singer-songwriter and guitarist \n*  1952   – Chris Brubeck, American pianist and composer\n*  1952   – Warren Lees, New Zealand cricketer and coach\n*  1952   – Martin Ravallion, Australian economist and academic\n*  1952   – Harvey Weinstein, American director and producer\n* 1953 – Ian Blair, English police officer\n*  1953   – Peter Hendy, English businessman\n*  1953   – Billy Sheehan, American bass player and songwriter \n*  1953   – Ricky Wilson, American singer-songwriter and musician (d. 1985) \n* 1954 – Cho Kwang-rae, South Korean footballer, coach, and manager\n* 1955 – Bruce Willis, German-American actor and producer\n* 1956 – Yegor Gaidar, Russian economist and politician, First Deputy Prime Minister of Russia (d. 2009)\n* 1958 – Andy Reid, American football player and coach\n* 1959 – Terry Hall, English singer-songwriter \n* 1960 – Eliane Elias, Brazilian singer-songwriter and pianist\n* 1962 – Iván Calderón, Puerto Rican-American baseball player (d. 2003)\n* 1963 – Neil LaBute, American director and screenwriter\n*  1963   – Mary Scheer, American actress, comedian, producer, and screenwriter\n* 1964 – Yoko Kanno, Japanese pianist and composer \n*  1964   – Jake Weber, English actor\n* 1966 – Michael Crockart, Scottish police officer and politician\n*  1966   – Olaf Marschall, German footballer and manager\n*  1966   – Andy Sinton, English footballer and manager\n* 1967 – Vladimir Konstantinov, Russian-American ice hockey player\n*  1967   – Katia Tiutiunnik, Australian viola player and composer\n* 1968 – Tyrone Hill, American basketball player and coach\n* 1969 – Gary Jules, American singer-songwriter and guitarist\n*  1969   – Tom McRae, English singer-songwriter and guitarist\n* 1970 – Gert Bettens, Belgian guitarist and songwriter \n*  1970   – Harald Johnsen, Norwegian bassist and composer (d. 2011)\n*  1970   – Michael Krumm, German race car driver\n* 1973 – Brant Bjork, American drummer \n*  1973   – Ashley Giles, English cricketer and coach\n* 1976 – Rachel Blanchard, Canadian actress\n*  1976   – Andre Miller, American basketball player\n*  1976   – Alessandro Nesta, Italian footballer and manager\n* 1978 – Cydonie Mothersille, Jamaican-Caymanian sprinter\n* 1979 – Sheldon Brown, American football player\n*  1979   – Hee-seop Choi, South Korean-American baseball player\n*  1979   – Ivan Ljubičić, Croatian tennis player\n*  1979   – Christos Patsatzoglou, Greek footballer\n*  1979   – Hedo Türkoğlu, Turkish basketball player\n* 1980 – Luca Ferri, Italian footballer\n*  1980   – Taichi Ishikari, Japanese wrestler\n*  1980   – Mikuni Shimokawa, Japanese singer-songwriter \n* 1981 – Steve Cummings, English cyclist\n*  1981   – Kolo Touré, Ivorian footballer\n* 1982 – Jonathan Fanene, American football player\n*  1982   – Brad Jones, Australian footballer\n*  1982   – Eduardo Saverin, Brazilian-Singaporean businessman\n*  1982   – Yoshikaze Masatsugu, Japanese sumo wrestler\n* 1985 – Inesa Jurevičiūtė, Lithuanian figure skater\n* 1986 – Tyler Bozak, Canadian ice hockey player\n* 1987 – Michal Švec, Czech footballer\n*  1987   – Miloš Teodosić, Serbian basketball player\n* 1988 – Clayton Kershaw, American baseball player\n*  1991   – Aleksandr Kokorin, Russian footballer\n* 1993 – Mateusz Szwoch, Polish footballer\n*  1993   – Hakim Ziyech, Moroccan footballer\n* 1995 – Alexei Sintsov, Russian figure skater\n* 1996 – Barbara Haas, Austrian tennis player\n\nDeaths\n\n* 235 – Severus Alexander, Roman emperor (b. 208)\n* 953 – Al-Mansur Billah, caliph of the Fatimid Caliphate (b. 913)\n* 968 – Emma of Paris, duchess of Normandy (b. 943)\n* 1238 – Henry the Bearded, Polish duke and son of Bolesław I the Tall (b. 1163)\n* 1263 – Hugh of Saint-Cher, French cardinal (b. 1200)\n* 1279 – Zhao Bing, Chinese emperor (b. 1271)\n* 1286 – Alexander III, king of Scotland (b. 1241)\n* 1330 – Edmund of Woodstock, 1st Earl of Kent, English politician, Lord Warden of the Cinque Ports (b. 1301)\n* 1372 – John II, marquess of Montferrat (b. 1321)\n* 1533 – John Bourchier, 2nd Baron Berners, English baron and statesman (b. 1467)\n* 1534 – Michael Weiße, German theologian (b. c. 1488)\n* 1539 – Lord Edmund Howard, English nobleman (b. c. 1478)\n* 1563 – Arthur Brooke, English poet\n* 1568 – Elizabeth Seymour, Lady Cromwell, English noblewoman (b.c. 1518)\n* 1581 – Francis I, duke of Saxe-Lauenburg (b. 1510)\n* 1612 – Sophia Olelkovich Radziwill, Belarusian saint (b. 1585)\n* 1637 – Péter Pázmány, Hungarian cardinal (b. 1570)\n* 1649 – Gerhard Johann Vossius, German scholar and theologian (b. 1577)\n* 1683 – Thomas Killigrew, English playwright and manager (b. 1612)\n* 1687 – René-Robert Cavelier, Sieur de La Salle, French-American explorer (b. 1643)\n* 1697 – Nicolaus Bruhns, German organist and composer (b. 1665)\n* 1711 – Thomas Ken, English bishop and hymn-writer (b. 1637)\n* 1717 – John Campbell, 1st Earl of Breadalbane and Holland, Scottish soldier (b. 1636)\n* 1721 – Pope Clement XI (b. 1649)\n* 1783 – Frederick Cornwallis, English archbishop (b. 1713)\n* 1790 – Cezayirli Gazi Hasan Pasha, Ottoman general and politician, 182nd Grand Vizier of the Ottoman Empire (b. 1713)\n* 1797 – Philip Hayes, English organist and composer (b. 1738)\n* 1816 – Philip Mazzei, Italian-American physician and philosopher (b. 1730)\n* 1871 – Wilhelm Karl Ritter von Haidinger, Austrian mineralogist, geologist, and physicist (b. 1795)\n* 1897 – Antoine Thomson d'Abbadie, Irish-French geographer, ethnologist, linguist, and astronomer (b. 1810)\n* 1900 – John Bingham, American lawyer and politician, 7th United States Ambassador to Japan (b. 1815)\n*  1900   – Charles-Louis Hanon, French pianist and composer (b. 1819)\n* 1914 – Giuseppe Mercalli, Italian priest, geologist, and volcanologist (b. 1850)\n* 1919 – Emma Bell Miles, American writer, poet, and artist of Appalachia (b. 1879)\n* 1930 – Arthur Balfour, Scottish-English politician, Prime Minister of the United Kingdom (b. 1848)\n* 1942 – Clinton Hart Merriam, American zoologist, ornithologist, and entomologist (b. 1855)\n* 1944 – William Hale Thompson, American rancher and politician, 41st Mayor of Chicago (b. 1869)\n* 1949 – James Somerville, English admiral and politician, Lord Lieutenant of Somerset (b. 1882)\n* 1950 – Edgar Rice Burroughs, American soldier and author (b. 1875)\n*  1950   – Norman Haworth, English chemist and academic, Nobel Prize laureate (b. 1883)\n* 1951 – Dmytro Doroshenko, Ukrainian historian and politician, Prime Minister of Ukraine (b. 1882)\n* 1973 – Lauritz Melchior, Danish-American tenor and actor (b. 1890)\n* 1976 – Albert Dieudonné, French actor and author (b. 1889)\n*  1976   – Paul Kossoff, English guitarist and songwriter (b. 1950)\n* 1977 – William L. Laurence, Lithuanian-born American journalist and author (b. 1888)\n* 1978 – M. A. Ayyangar, Indian lawyer and politician, 2nd Speaker of the Lok Sabha (b. 1891)\n* 1982 – J. B. Kripalani, Indian lawyer and politician (b. 1888)\n*  1982   – Randy Rhoads, American guitarist, songwriter, and producer (b. 1956)\n* 1984 – Garry Winogrand, American photographer (b. 1928)\n* 1986 – Sabino Barinaga, Spanish footballer and manager (b. 1922)\n* 1987 – Louis de Broglie, French physicist and academic, Nobel Prize laureate (b. 1892)\n* 1988 – Bun Cook, Canadian ice hockey player and coach (b. 1904)\n* 1990 – Andrew Wood, American singer-songwriter (b. 1966)\n* 1993 – Henrik Sandberg, Danish production manager and producer (b. 1915)\n* 1996 – Lise Østergaard, Danish psychologist and politician (b. 1924)\n*  1996   – Virginia Henderson, American nurse, researcher, theorist and author (b. 1897)\n* 1997 – Willem de Kooning, Dutch-American painter and educator (b. 1904)\n*  1997   – Eugène Guillevic, French poet and author (b. 1907)\n* 1998 – E. M. S. Namboodiripad, Indian theorist and politician, 1st Chief Minister of Kerala (b. 1909)\n* 1999 – Tofilau Eti Alesana, Samoan politician, 5th Prime Minister of Samoa (b. 1924)\n* 2000 – Joanne Weaver, American baseball player (b. 1935)\n*  2000   – Shafiq-ur-Rahman, Pakistani physician and author (b. 1920)\n* 2003 – Michael Mathias Prechtl, German soldier and illustrator (b. 1926)\n* 2004 – Mitchell Sharp, Canadian economist and politician, 23rd Canadian Minister of Finance (b. 1911)\n* 2005 – John DeLorean, American engineer and businessman, founded the DeLorean Motor Company (b. 1925)\n* 2008 – Arthur C. Clarke, British science fiction writer (b. 1917)\n*  2008   – Hugo Claus, Belgian author, poet, and playwright (b. 1929)\n*  2008   – Paul Scofield, English actor (b. 1922)\n* 2009 – Maria Bergson, Austrian-American architect and interior designer (b. 1914)\n* 2011 – Kym Bonython, Australian drummer and radio host (b. 1920)\n* 2012 – Jim Case, American director and producer (b. 1927)\n*  2012   – Ulu Grosbard, Belgian-American director and producer (b. 1929)\n*  2012   – Clancy Lyall, American sergeant (b. 1925)\n*  2012   – Hugo Munthe-Kaas, Norwegian intelligence agent (b. 1922)\n* 2014 – Patrick Joseph McGovern, American businessman, founded IDG (b. 1937)\n*  2014   – Fred Phelps, American lawyer, pastor, and activist, founded the Westboro Baptist Church (b. 1929)\n*  2014   – Heather Robertson, Canadian journalist and author (b. 1942)\n*  2014   – Robert S. Strauss, American diplomat, United States Ambassador to Russia (b. 1918)\n*  2014   – Lawrence Walsh, Canadian-American lawyer, judge, and politician, 4th United States Deputy Attorney General (b. 1912)\n*  2014   – Joseph F. Weis, Jr., American lawyer and judge (b. 1923)\n* 2015 – Gus Douglass, American farmer and politician (b. 1927)\n*  2015   – Safet Plakalo, Bosnian author and playwright (b. 1950)\n*  2015   – Danny Schechter, American director, producer, and screenwriter (b. 1942)\n* 2016 – Roger Agnelli, Brazilian banker and businessman (b. 1959)\n*  2016   – Jack Mansell, English footballer and manager (b. 1927)\n\nHolidays and observances\n\n* Christian feast day:\n** Joseph of Nazareth (Western Christianity - if this date falls on Sunday, the feast is moved to Monday March 20)\n** March 19 (Eastern Orthodox liturgics)\n* Earliest day on which Maundy Thursday can fall, while April 22 is the latest; celebrated on Thursday before Easter. (Christianity)\n* Minna Canth's Birthday (Finland)\n* St Joseph's Day (Roman Catholicism and Anglican Communion) related observances:\n** Father's Day (Spain, Portugal, Belgium, Italy, Honduras, and Bolivia)\n** Las Fallas, celebrated on the week leading to March 19. (Valencia)\n** \"Return of the Swallow\", annual observance of the swallows' return to Mission San Juan Capistrano in California.\n* Kashubian Unity Day (Poland). March 19. http://en.wikipedia.org/?curid=20316."
  }
}
