{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14701",
  "eid" : "172e0b70-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778548135,
  "textBody" : "Politics of Italy is conducted through a parliamentary republic with a multi-party system. Italy has been a democratic republic since 2 June 1946, when the monarchy was abolished by popular referendum and a constituent assembly was elected to draft a constitution, which was promulgated on 1 January 1948.\n\nThe executive power is exercised collectively by the Council of Ministers, which is led by the Prime Minister, officially referred to as President of the Council (Presidente del Consiglio). Legislative power is vested in the two houses of the Italian Parliament primarily, and secondarily on the Council of Ministers, which can introduce bills and holds the majority in both houses. The judiciary of Italy is independent of the executive and the legislative branches. It is headed by the High Council of the Judiciary, a body presided over by the President of Italy, who is the head of state though his position is separate from all branches. The current Italian President is Sergio Mattarella and the current Prime Minister of Italy is Paolo Gentiloni.\n\nThe Economist Intelligence Unit has rated the Italy as \"flawed democracy\" in 2016.\n\nGovernment\n\nArticle 1 of the Italian Constitution states:\n\nItaly is a democratic Republic founded on labour. Sovereignty belongs to the people and is exercised by the people in the forms and within the limits of the Constitution.\n\nBy stating that Italy is a democratic republic, the article solemnly declares the results of the constitutional referendum which took place on 2 June 1946. The State is not a hereditary property of the ruling monarch, but it is instead a Res Publica, belonging to everyone.\n\nThe people who are called to temporarily administer the republic are not owners, but servants; and the governed are not subjects, but citizens. And the sovereignty, that is the power to make choices that involve the entire community, belongs to the people, in accordance with the concept of a democracy, from the Greek demos (people) and kratìa (power). This power, however, is not to be exercised arbitrarily, but in the forms and within the limits established by the rule of law.\n\nHead of state\n\nAs the head of state, the President of the Republic represents the unity of the nation and has many of the duties previously given to the King of Italy. The President serves as a point of connection between the three branches: he is elected by the lawmakers, he appoints the executive, and is the president of the judiciary. The president is also commander-in-chief in the time of war.\n\nThe President of the Republic is elected for seven years by Parliament in joint session, together with three representatives of each region, except for the Aosta Valley, which gets only one representative. These delegates are elected by their respective Regional Councils so as to guarantee representation to minorities. The election needs a wide majority that is progressively reduced from two-thirds to one-half plus one of the votes after the third ballot. The only Presidents ever to be elected on the first ballot are Francesco Cossiga and Carlo Azeglio Ciampi. Ciampi was replaced by Giorgio Napolitano, who was elected on 10 May 2006. While it is not forbidden by law, no President had ever served two terms, until 20 April 2013, when President Giorgio Napolitano was reelected.\n\nAccording to the Constitution, any citizen that is fifty on the day of the election, and enjoys civil and political rights, can be elected President. The President cannot hold office in any other branch of power, and the office's salary and privileges are established by law.\n\nAmong the powers of the President are the capacity to:\n* send messages to Parliament, authorise the introduction of bills by the Government, and promulgate laws, decrees and regulations,\n* dissolve one or both Houses of Parliament, in consultation with their presidents, except during the last six months of his terms, unless that period coincides at least in part with the final six months of the Parliament,\n* call a general referendum under certain circumstances established by the Constitution,\n* appoint state officials in the cases established by law,\n* accredit and receive diplomats, and ratify international treaties, after the Parliament's authorisation when required,\n* make declarations of war agreed upon by the Parliament, as commander-in-chief of the armed forces,\n* grant pardons, commute sentences, and confer honorary distinctions of the Republic.\n\nThe President also presides over the High Council of the Judiciary and the Supreme Council of Defence.\n\nUsually, the President tries to stay out of the political debate, and to be an institutional guarantee for all those involved in the political process. The President can also reject openly anti-constitutional acts as the guardian of the Constitution of Italy.\n\nThe president is not responsible for the actions performed in the exercise of his duties, except for high treason and violation of the Constitution, for which the President can be impeached by the Parliament in joint session, with an absolute majority of its members.\n\nLegislative branch\n\nWith article 48 of the Constitution, which guarantees the right to vote, the people exercise their power through their elected representatives in the Parliament. The Italian legislative branch has rights to declare war with a majority vote. The Parliament has a bicameral system, and consists of the Chamber of deputies and the Senate, elected every five years.\n\nThe Chamber of deputies is elected by direct and universal suffrage by voters who are eighteen or older. There are 630 deputies, twelve of which are elected in the overseas constituencies. All voters who are twenty-five or older on election day are eligible to be deputies.\n\nThe Senate is elected by direct and universal suffrage by voters who are twenty-five or older. There are 315 senators, six of whom are elected in the overseas constituencies. There are also a number of senators for life, such as former Presidents and up to five citizens appointed by the President for having brought honor to the nation with their achievements. All voters who are forty or older on election day are eligible to be senators. The Senate of the Republic is a region based body with elections of Senators for each region being based on a modified proportional representation system.\n\nExecutive branch\n\nThe Constitution establishes the Government of Italy as composed of the  President of the Council (Prime Minister) and Ministers. The President of Italy appoints the Prime Minister and, on his proposal, the Ministers that form its cabinet. The appointee is usually the leader of the majority coalition that won the election, but it can also be a new leader emerging from a post-election leadership challenge within the majority coalition, or a person instructed by the President to form a national unity government in times of political crisis, such as a coalition shift or a hung parliament. In any event, the government must receive the confidence of both Houses, so the Executive derives its legitimacy from the Parliament and the great number of political parties forces the Prime Minister to bend to their will.\n\nIf the majority coalition no longer supports the government, the Prime Minister can be ousted with a vote of no confidence, at which point the President can either appoint a new Prime Minister capable of forming a government with the support of Parliament, or dissolve Parliament and call for new elections. Cabinet reshuffles are also possible in case specific Ministers lack the support of Parliament, while the Prime Minister remains in charge. In the history of the Italian Republic, there have been eighteen legislatures (including the Constituent Assembly), forty-two consecutive premierships, and sixty-four different cabinets.\n\nJudicial branch\n\nThe Constitution states that justice is administered in the name of the people and that judges are subject only to the law. So the judiciary is a branch that is completely autonomous and independent of all other branches of power, even though the Minister of Justice is responsible for the organization and functioning of those services involved with justice and has the power to originate disciplinary actions against judges, which are then administered by the High Council of the Judiciary, presided over by the President.\n\nThe Italian judicial system is based on Roman law, the Napoleonic code and later statutes. It is based on a mix of the adversarial and inquisitorial civil law systems, although the adversarial system was adopted in the Appeal Courts in 1988. Appeals are treated almost as new trials, and three degrees of trial are present. The third is a legitimating trial.\n\nThere is only partial judicial review of legislation in the American sense. Judicial review exists under certain conditions, established by the Constitutional Law, in the Constitutional Court, or Corte Costituzionale, which can reject anti-constitutional laws after scrutiny.\nAccording to Article 134 of the Constitution, the Constitutional Court shall pass judgement on:\n* controversies on the constitutional legitimacy of laws issued by the State and Regions;\n* conflicts arising from allocation of powers of the State and those powers allocated to State and Regions, and between Regions;\n* charges brought against the President and until 1989, the Ministers.\n\nThe Constitutional Court is composed of 15 judges, one of which is the President of the Italian Constitutional Court elected from the court itself. One third of the judges are appointed by the President of the Italian Republic, one-third are elected by Parliament and one-third are elected by the ordinary and administrative supreme courts. The Constitutional Court passes on the constitutionality of laws, and is a post-World War II innovation. Its powers, case load, and frequency of decisions are not as extensive as those of the U.S. Supreme Court.\n\nItaly has, in November 2014, accepted compulsory jurisdiction of the International Court of Justice.http://www.icj-cij.org/jurisdiction/?p15&p2\n1&p33&code\nIT\n\nPolitical parties and elections\n\nAll Italian citizens older than 18 can vote. However, to vote for the senate, the voter must be at least 25 or older.\n\nChamber of Deputies\n\nSenate of the Republic\n\nPolitical parties\n\nItaly's dramatic self-renewal transformed the political landscape between 1992 and 1997. Scandal investigations touched thousands of politicians, administrators, and businessmen; the shift from a proportional to an Additional Member System (with the requirement to obtain a minimum of 4% of the national vote to obtain representation) also altered the political landscape.\n\nParty changes were sweeping. The Christian Democratic party dissolved; the Italian People's Party and the Christian Democratic Center emerged. Other major parties, such as the Socialists, saw support plummet. A new liberal movement, Forza Italia, gained wide support among moderate voters. The Alleanza Nazionale (National Alliance) broke from the (alleged neo-fascist) Italian Social Movement (MSI). A trend toward two large coalitions (one on the center-left and the other on the center-right) emerged from the April 1995 regional elections. For the 1996 national elections, the center-left parties created the Olive Tree coalition while the center-right united again under the House of Freedoms. These coalitions continued into the 2001 and 2007 national elections.\n\nThis emerging bipolarity represents a major break from the fragmented, multi-party political landscape of the postwar era, although it appears to have reached a plateau, since efforts via referendums to further curtail the influence of small parties were defeated in 1999, 2000 and 2009.\n\nRegional governments\n\nFive regions (Aosta Valley, Friuli-Venezia Giulia, Sardinia, Sicily, Trentino-Alto Adige/Südtirol) have special charters granting them varying degrees of autonomy. The raisons d'être of these charters is in most cases the presence of significant linguistic and cultural minorities, but in the case of Sicily it was to calm down separatist movements. The other 15 regions were in practice established in 1970, even if their ideation had been a much earlier idea.\n\nHistory of the post-war political landscape\n\nFirst Republic: 1946-1994\n\nThere have been frequent government turnovers since 1945, indeed there have been 61 governments in this time.\"Pasta and fries\".The Economist (24 February – 2 March 2007 Issue) Volume 382, Number 8517 The dominance of the Christian Democratic party during much of the postwar period lent continuity and comparative stability to Italy's political situation, mainly dominated by the attempt of keeping the Italian Communist Party (PCI) out of power in order to maintain Cold War equilibrium in the region (see May 1947 crisis).\n\nThe communists were in the government only in the national unity governments before 1948, in which their party's secretary Palmiro Togliatti was minister of Justice. After the first democratic elections with universal suffrage in 1948, in which the Christian Democracy and their allies won against the Popular front of the Italian Communist and Socialists parties, the communist party never returned in the government.\n\nEven though many repeat the cliché that Italy had over fifty governments in its first fifty years of democracy to stigmatise its alleged political instability, Italy's main political problem was actually the opposite: in all the course of the so-called First Republic, the government was in the hands of the Christian Democrats and their allies, since it was unacceptable for a communist party to rule a western country during the Cold war. The system had been nicknamed the imperfect bipolarism, referring to more proper bipolarism in other western countries (the United States, Germany, the United Kingdom, France etc.) where right-wing and left-wing parties alternated in government.\n\nEntrance of the Socialists to the government\n\nThe main event in the First Republic in the 1960s was the inclusion of the Socialist party in the government, after the reducing edge of the Christian Democracy (DC) had forced them to accept this alliance; attempts to incorporate the Italian Social Movement (MSI), a right party, in the Tambroni government led to riots, and were short-lived.\n\nAldo Moro, a relatively left-leaning Christian democrat, inspired this alliance. He would later try to include the Communist Party as well, with a deal called the historic compromise. This attempt at compromise was, however, stopped by the kidnapping and murder of Moro in 1978 by the Red Brigades, an extremist left-wing terrorist organization.\n\nThe Communist party was at this point the largest communist party in western Europe, and remained such for the rest of its existence. Their ability to attract members was largely due to their pragmatic stance, especially their rejection of extremism, and to their growing independence from Moscow (see Eurocommunism). The Italian communist party was especially strong in areas like Emilia-Romagna and Tuscany, where communists had been elected to stable government positions. This practical political experience may have contributed to their taking a more pragmatic approach to politics.\n\nThe Years of Lead\n\nOn 12 December 1969, a roughly decade-long period of extremist left- and right-wing political terrorism, known as the years of lead (as in the metal of bullets, ), began with the Piazza Fontana bombing in the center of Milan. Neofascist Vincenzo Vinciguerra later declared the bombing to be an attempt to push the Italian state to declare a state of emergency, in order to lead to a more authoritative state. A bomb left in a bank killed about twenty, and was initially blamed on anarchist Giuseppe Pinelli. This accusation was hotly contested by left-wing circles, especially the Maoist Student Movement, which had support in those years from some students of Milan's universities, and who considered the bombing to have all the marks of a fascist operation. Their guess proved correct, but only after many years of difficult investigations.\n\nThe strategy of tension attempted to blame the left for bombings carried out by right-wing terrorists. Fascist \"black terrorists,\" such as Ordine Nuovo and the Avanguardia Nazionale, were, in the 1980s-1990s, found to be responsible for several terrorist attacks. On the other extreme of the political spectrum, the leftist Red Brigades carried out assassinations against specific persons, but weren't responsible for any blind bombings. The Red Brigades killed socialist journalist Walter Tobagi, and, in their most famous operation, kidnapped and assassinated Aldo Moro, president of the Christian Democracy, who was trying to involve the Communist Party in the government through the compromesso storico (\"historic compromise\"), to which the radical left, as well as Washington, were opposed. It is worth noting that the Red Brigades met fierce resistance from the Communist Party and the trade unions; some left-wing politicians, however, used the sympathetic expression \"comrades who are mistaken\" (Italian: Compagni che sbagliano) to refer to the Red Brigades. Some, including the prosecutor of Moro case Ferdinando Imposimato, have alleged that the 2nd Red Brigades (those led by Mario Moretti) were exploited - or anyway allowed to act freely - by Andreotti's government and possibly foreign forces (notably United States) to destabilize Italy, discredit the Communist Party and impede the historic compromise.\n\nThe last and largest of the bombings, known as the Bologna massacre, destroyed the city's railway station in 1980. This was found to be a neofascist bombing, in which Propaganda Due was involved.\n\nOn 24 October 1990 Prime minister Giulio Andreotti (DC) revealed to the Parliament the existence of Gladio, NATO's secret \"stay-behind\" networks which stocked weapons in order to facilitate an armed resistance in case of a communist coup. In 2000, a Parliament Commission report from the Olive Tree (centre-left) coalition concluded that the strategy of tension followed by Gladio had been supported by the United States to \"stop the PCI and, to a certain degree, the PSI [Italian Socialist Party] from reaching executive power in the country.\"\n\n1980s\n\nWith the end of the lead years, the communist party gradually increased their votes under the leadership of Enrico Berlinguer. The Italian Socialist Party, led by Bettino Craxi, became more and more critical of the communists and of the Soviet Union; Craxi himself pushed in favor of Ronald Reagan's positioning of Pershing II missiles in Italy, a move many communists strongly disapproved of.\n\nAs the socialist party moved to more moderate positions, it attracted many reformists, some of whom were irritated by the failure of the communists to modernize. Increasingly, many on the left began to see the communists as old and out of fashion, while Craxi and the socialists seemed to represent a new liberal-socialism. The Communist party surpassed the Christian Democrats only in the European elections of 1984, held barely two days after Berlinguer's death, a passing that likely drew sympathy from many voters. The election of 1984, however, was to be the only time the Christian Democrats did not emerge as the largest party in a nationwide election in which they participated.\n\nIn 1987, one year after the Chernobyl disaster following a referendum in that year, a nuclear phase-out was commenced. Italy's four nuclear power plants were closed down, the last in 1990. A moratorium on the construction of new plants, originally in effect from 1987 until 1993, has since been extended indefinitely.http://energytrends.pnl.gov/italy/it004.htm\n\nIn these years, corruption began to be more extensive, a development that would be exposed in the early 1990s and nicknamed Tangentopoli. With the Mani Pulite investigation, starting just one year after the collapse of the Soviet Union, the whole power structure faltered, and seemingly indestructible parties, such as the Christian Democrats and the Socialist party, disbanded; the communist party changed its name to the Democratic Party of the Left and took the role of the socialist party as the main social democratic party in Italy. What was to follow was then called the transition to the Second Republic.\n\nSecond Republic: 1994–present\n\nFrom 1992 to 1997, Italy faced significant challenges, as voters, disenchanted with past political paralysis, massive government debt, extensive corruption, and organized crime's considerable influence—collectively called Tangentopoli after being uncovered by Mani pulite—demanded political, economic, and ethical reforms.\n\nIn the Italian referendums of 1993, voters approved substantial changes, including moving from a proportional to an Additional Member System, which is largely dominated by a majoritarian electoral system and the abolition of some ministries, some of which, however, have been reintroduced with only partly modified names, such as the Ministry of Agriculture reincarnated as the Ministry of Agricultural Resources.\n\nMajor political parties, beset by scandal and loss of voter confidence, underwent far-reaching changes. New political forces and new alignments of power emerged in the March 1994 national elections. This election saw a major turnover in the new parliament, with 452 out of 630 deputies and 213 out of 315 senators elected for the first time.The 1994 elections also swept media magnate Silvio Berlusconi (leader of \"Pole of Freedoms\" coalition) into office as Prime Minister. Berlusconi, however, was forced to step down in December 1994 when the Lega Nord withdrew support. The Berlusconi government was succeeded by a technical government headed by Prime Minister Lamberto Dini, which left office in early 1996.\n\nA series of center-left coalitions dominated Italy's political landscape between 1996 and 2001. In April 1996, national elections led to the victory of a center-left coalition, Olive Tree, under the leadership of Romano Prodi. Prodi's government became the third-longest to stay in power before he narrowly lost a vote of confidence, by three votes, in October 1998.\n\nIn May 1999, the Parliament selected Carlo Azeglio Ciampi as the President of the Republic. Ciampi, a former Prime Minister and Minister of the Treasury and, before entering the government, the governor of the Bank of Italy, was elected on the first ballot by a comfortable margin over the required two-thirds of the votes.\n\nA new government was formed by the Democrats of the Left leader and former communist Massimo D'Alema, but in April 2000, following poor performance by his coalition in regional elections, D'Alema resigned.\n\nThe succeeding center-left government, including most of the same parties, was headed by Giuliano Amato, a social-democrat, who had previously served as Prime Minister in 1992-93, and had at the time sworn never to return to active politics.\n\nNational elections held on 13 May 2001 returned Berlusconi to power at the head of the five-party center-right \"Freedom House\" coalition, comprising the prime minister's own party, Forza Italia, the National Alliance, the North League, the Christian Democratic Center, and the United Christian Democrats.\n\nBetween 17 May 2006 and 21 February 2007 Romano Prodi served as Prime Minister of Italy following the narrow victory of his l'Unione coalition over the Casa delle Libertà led by Silvio Berlusconi in the April 2006 Italian elections. Following a government crisis, Prodi submitted his resignation on 21 February 2007. Three days later he was asked by the Italian President, Giorgio Napolitano to stay on as Prime Minister and he agreed to do so. On 28 February 2007 Prodi narrowly survived a senate no confidence vote.\n\nLater, on 24 January 2008 the Prodi II Cabinet went through a new crisis, because the Minister of Justice, Clemente Mastella, retracted his support to the Cabinet. Consequently, the Prodi Cabinet lost the vote of confidence and the President Giorgio Napolitano called a new general election.\n\nThe election set against two new parties, the Democratic Party (founded in October 2007 by the union of the Democrats of the Left and Democracy is Freedom – The Daisy) led by Walter Veltroni, and The People of Freedom (federation of Forza Italia, National Alliance and other parties) led by Silvio Berlusconi. The Democratic Party was in alliance with Italy of Values, while The People of Freedom forged an alliance with Lega Nord and the Movement for the Autonomy. The coalition led by Berlusconi won the election and the leader of the centre-right created the Berlusconi IV Cabinet.\n\nThe Monti government had the highest average age in the western world (64 years), with its youngest members being 57. The previous Italian prime minister Mario Monti is 70, his predecessor Silvio Berlusconi was 75 at the time of resignation (2011), the previous head of the government Romano Prodi was 70 when he stepped down (2008), the Italian president Giorgio Napolitano is 88 and his predecessor Carlo Azeglio Ciampi was 86. In 2013, the youngest among the candidates for prime minister (Pier Luigi Bersani) is 62, the others being 70 and 78. The current average age of Italian university professors is 63, of bank directors and CEOs 67, of members of parliament 56, of labor union representatives 59.http://www.svd.se/nyheter/utrikes/ung-ilska-mot-italiens-politiska-dinosaurier_6887573.svdhttp://espresso.repubblica.it/dettaglio/il-parlamento-italiano-maschio-e-di-mezza-eta/2159841http://www.lastampa.it/2012/05/17/italia/politica/abbiamo-i-potenti-piu-vecchi-d-europapolitici-e-manager-sfiorano-i-anni-bvZs8WQYLtO40axUjOYsoJ/pagina.htmlhttp://www.senato.it/leg/16/BGT/Schede_v3/Statistiche/Composizione/Copertina.html\n\nThe new Italian government headed by Enrico Letta took two months to form and made international news when Luigi Preiti shot at policemen near the building where they were swearing in the new government on Sunday 28 April 2013.\n\nThe former prime minister Matteo Renzi became the youngest prime minister, at 39 years. His government had the youngest average age in Europe.\n\nGrand Coalition governments \n\nAt different times, since his entering the Italian Parliament, Silvio Berlusconi, leader of the centre-right, had repeatedly vowed to stop the \"communist\", while leftist parties had insisted that they would oust Berlusconi. Thus, despite the fact that the executive branch bears responsibility toward the Parliament, the governments led by Mario Monti (since 2011) and by Enrico Letta (since 2013) were called \"unelected governments\"  because they won a vote of confidence by a Parliament coalition formed by centre-right and left-right parties that had in turn obtained parliamentary seats by taking part in the elections as competitors, rather than allies. While formally complying with law and procedures, the creation of these governments did not comply with the decision made by people through the election.\n\nMeanwhile, in 2013, a ruling by the Constitutional Court of Italy established that the Italian electoral system employed to elect the Parliament breached a number of Constitutional requirements. Notably, the Court observed the following four facts: 1) \"such a legislation deprives the elector of any margin of choice of its representatives\"; 2) \"all of the elected parliamentarians, with no exception, lack the support of a personal designation by the citizens\"; 3) the electoral law has regulations which \"exclude any ability on the part of the elector to have an influence on the election of his/her representatives\"; 4) and contains conditions such that \"they alter the representative relationship between electors and elected people...they coerce the electors' freedom of choice in the election of their representatives to the Parliament...and consequently they are at odds with the democratic principle, by affecting the very freedom of vote provided for by art. 48 of the Constitution\". This implies that, despite being called - and acting as – a legitimate \"parliament\", the legislative assembly of Italy was chosen with a vote system by which the right of vote was not exercised according to the Italian fundamental chart of citizen's rights and duties. The issue was a major one, to the extent that the Constitutional Court itself ruled that the Italian Parliament should remain in charge only to reform the electoral system and then should be dissolved.\n\nThe new government, led by Matteo Renzi, proposed a new electoral law. The so-called Italicum was approved in 2015 and came into force on 1 July 2016.\n\nIdeological composition of past Italian governments \n\nhttps://books.google.com/books?idW8K3AwAAQBAJ&pg\nPA1960\n\n1946/48: National Unity (1947–48)\n\n1948/53: Centrist\n\n1953/58: Centrist, Centre-Right (1957–58)\n\n1958/63: Centrist, centre-right (1960), centre-left (1960–62).\n\n1963/68: Centrist (1963), centre-left (1963–68)\n\n1968/72:  Centrist (1968 and 1972), centre-left\n\n1972/76: Centrist, centre-left\n\n1976/79: National Unity, centre-left (1979)\n\n1979/83: centre-left\n\n1983/92: centre-left",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Politics of Italy" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14701" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Politics of Italy is conducted through a parliamentary republic with a multi-party system. Italy has been a democratic republic since 2 June 1946, when the monarchy was abolished by popular referendum and a constituent assembly was elected to draft a constitution, which was promulgated on 1 January 1948.\n\nThe executive power is exercised collectively by the Council of Ministers, which is led by the Prime Minister, officially referred to as President of the Council (Presidente del Consiglio). Legislative power is vested in the two houses of the Italian Parliament primarily, and secondarily on the Council of Ministers, which can introduce bills and holds the majority in both houses. The judiciary of Italy is independent of the executive and the legislative branches. It is headed by the High Council of the Judiciary, a body presided over by the President of Italy, who is the head of state though his position is separate from all branches. The current Italian President is Sergio Mattarella and the current Prime Minister of Italy is Paolo Gentiloni.\n\nThe Economist Intelligence Unit has rated the Italy as \"flawed democracy\" in 2016.\n\nGovernment\n\nArticle 1 of the Italian Constitution states:\n\nItaly is a democratic Republic founded on labour. Sovereignty belongs to the people and is exercised by the people in the forms and within the limits of the Constitution.\n\nBy stating that Italy is a democratic republic, the article solemnly declares the results of the constitutional referendum which took place on 2 June 1946. The State is not a hereditary property of the ruling monarch, but it is instead a Res Publica, belonging to everyone.\n\nThe people who are called to temporarily administer the republic are not owners, but servants; and the governed are not subjects, but citizens. And the sovereignty, that is the power to make choices that involve the entire community, belongs to the people, in accordance with the concept of a democracy, from the Greek demos (people) and kratìa (power). This power, however, is not to be exercised arbitrarily, but in the forms and within the limits established by the rule of law.\n\nHead of state\n\nAs the head of state, the President of the Republic represents the unity of the nation and has many of the duties previously given to the King of Italy. The President serves as a point of connection between the three branches: he is elected by the lawmakers, he appoints the executive, and is the president of the judiciary. The president is also commander-in-chief in the time of war.\n\nThe President of the Republic is elected for seven years by Parliament in joint session, together with three representatives of each region, except for the Aosta Valley, which gets only one representative. These delegates are elected by their respective Regional Councils so as to guarantee representation to minorities. The election needs a wide majority that is progressively reduced from two-thirds to one-half plus one of the votes after the third ballot. The only Presidents ever to be elected on the first ballot are Francesco Cossiga and Carlo Azeglio Ciampi. Ciampi was replaced by Giorgio Napolitano, who was elected on 10 May 2006. While it is not forbidden by law, no President had ever served two terms, until 20 April 2013, when President Giorgio Napolitano was reelected.\n\nAccording to the Constitution, any citizen that is fifty on the day of the election, and enjoys civil and political rights, can be elected President. The President cannot hold office in any other branch of power, and the office's salary and privileges are established by law.\n\nAmong the powers of the President are the capacity to:\n* send messages to Parliament, authorise the introduction of bills by the Government, and promulgate laws, decrees and regulations,\n* dissolve one or both Houses of Parliament, in consultation with their presidents, except during the last six months of his terms, unless that period coincides at least in part with the final six months of the Parliament,\n* call a general referendum under certain circumstances established by the Constitution,\n* appoint state officials in the cases established by law,\n* accredit and receive diplomats, and ratify international treaties, after the Parliament's authorisation when required,\n* make declarations of war agreed upon by the Parliament, as commander-in-chief of the armed forces,\n* grant pardons, commute sentences, and confer honorary distinctions of the Republic.\n\nThe President also presides over the High Council of the Judiciary and the Supreme Council of Defence.\n\nUsually, the President tries to stay out of the political debate, and to be an institutional guarantee for all those involved in the political process. The President can also reject openly anti-constitutional acts as the guardian of the Constitution of Italy.\n\nThe president is not responsible for the actions performed in the exercise of his duties, except for high treason and violation of the Constitution, for which the President can be impeached by the Parliament in joint session, with an absolute majority of its members.\n\nLegislative branch\n\nWith article 48 of the Constitution, which guarantees the right to vote, the people exercise their power through their elected representatives in the Parliament. The Italian legislative branch has rights to declare war with a majority vote. The Parliament has a bicameral system, and consists of the Chamber of deputies and the Senate, elected every five years.\n\nThe Chamber of deputies is elected by direct and universal suffrage by voters who are eighteen or older. There are 630 deputies, twelve of which are elected in the overseas constituencies. All voters who are twenty-five or older on election day are eligible to be deputies.\n\nThe Senate is elected by direct and universal suffrage by voters who are twenty-five or older. There are 315 senators, six of whom are elected in the overseas constituencies. There are also a number of senators for life, such as former Presidents and up to five citizens appointed by the President for having brought honor to the nation with their achievements. All voters who are forty or older on election day are eligible to be senators. The Senate of the Republic is a region based body with elections of Senators for each region being based on a modified proportional representation system.\n\nExecutive branch\n\nThe Constitution establishes the Government of Italy as composed of the  President of the Council (Prime Minister) and Ministers. The President of Italy appoints the Prime Minister and, on his proposal, the Ministers that form its cabinet. The appointee is usually the leader of the majority coalition that won the election, but it can also be a new leader emerging from a post-election leadership challenge within the majority coalition, or a person instructed by the President to form a national unity government in times of political crisis, such as a coalition shift or a hung parliament. In any event, the government must receive the confidence of both Houses, so the Executive derives its legitimacy from the Parliament and the great number of political parties forces the Prime Minister to bend to their will.\n\nIf the majority coalition no longer supports the government, the Prime Minister can be ousted with a vote of no confidence, at which point the President can either appoint a new Prime Minister capable of forming a government with the support of Parliament, or dissolve Parliament and call for new elections. Cabinet reshuffles are also possible in case specific Ministers lack the support of Parliament, while the Prime Minister remains in charge. In the history of the Italian Republic, there have been eighteen legislatures (including the Constituent Assembly), forty-two consecutive premierships, and sixty-four different cabinets.\n\nJudicial branch\n\nThe Constitution states that justice is administered in the name of the people and that judges are subject only to the law. So the judiciary is a branch that is completely autonomous and independent of all other branches of power, even though the Minister of Justice is responsible for the organization and functioning of those services involved with justice and has the power to originate disciplinary actions against judges, which are then administered by the High Council of the Judiciary, presided over by the President.\n\nThe Italian judicial system is based on Roman law, the Napoleonic code and later statutes. It is based on a mix of the adversarial and inquisitorial civil law systems, although the adversarial system was adopted in the Appeal Courts in 1988. Appeals are treated almost as new trials, and three degrees of trial are present. The third is a legitimating trial.\n\nThere is only partial judicial review of legislation in the American sense. Judicial review exists under certain conditions, established by the Constitutional Law, in the Constitutional Court, or Corte Costituzionale, which can reject anti-constitutional laws after scrutiny.\nAccording to Article 134 of the Constitution, the Constitutional Court shall pass judgement on:\n* controversies on the constitutional legitimacy of laws issued by the State and Regions;\n* conflicts arising from allocation of powers of the State and those powers allocated to State and Regions, and between Regions;\n* charges brought against the President and until 1989, the Ministers.\n\nThe Constitutional Court is composed of 15 judges, one of which is the President of the Italian Constitutional Court elected from the court itself. One third of the judges are appointed by the President of the Italian Republic, one-third are elected by Parliament and one-third are elected by the ordinary and administrative supreme courts. The Constitutional Court passes on the constitutionality of laws, and is a post-World War II innovation. Its powers, case load, and frequency of decisions are not as extensive as those of the U.S. Supreme Court.\n\nItaly has, in November 2014, accepted compulsory jurisdiction of the International Court of Justice.http://www.icj-cij.org/jurisdiction/?p15&p2\n1&p33&code\nIT\n\nPolitical parties and elections\n\nAll Italian citizens older than 18 can vote. However, to vote for the senate, the voter must be at least 25 or older.\n\nChamber of Deputies\n\nSenate of the Republic\n\nPolitical parties\n\nItaly's dramatic self-renewal transformed the political landscape between 1992 and 1997. Scandal investigations touched thousands of politicians, administrators, and businessmen; the shift from a proportional to an Additional Member System (with the requirement to obtain a minimum of 4% of the national vote to obtain representation) also altered the political landscape.\n\nParty changes were sweeping. The Christian Democratic party dissolved; the Italian People's Party and the Christian Democratic Center emerged. Other major parties, such as the Socialists, saw support plummet. A new liberal movement, Forza Italia, gained wide support among moderate voters. The Alleanza Nazionale (National Alliance) broke from the (alleged neo-fascist) Italian Social Movement (MSI). A trend toward two large coalitions (one on the center-left and the other on the center-right) emerged from the April 1995 regional elections. For the 1996 national elections, the center-left parties created the Olive Tree coalition while the center-right united again under the House of Freedoms. These coalitions continued into the 2001 and 2007 national elections.\n\nThis emerging bipolarity represents a major break from the fragmented, multi-party political landscape of the postwar era, although it appears to have reached a plateau, since efforts via referendums to further curtail the influence of small parties were defeated in 1999, 2000 and 2009.\n\nRegional governments\n\nFive regions (Aosta Valley, Friuli-Venezia Giulia, Sardinia, Sicily, Trentino-Alto Adige/Südtirol) have special charters granting them varying degrees of autonomy. The raisons d'être of these charters is in most cases the presence of significant linguistic and cultural minorities, but in the case of Sicily it was to calm down separatist movements. The other 15 regions were in practice established in 1970, even if their ideation had been a much earlier idea.\n\nHistory of the post-war political landscape\n\nFirst Republic: 1946-1994\n\nThere have been frequent government turnovers since 1945, indeed there have been 61 governments in this time.\"Pasta and fries\".The Economist (24 February – 2 March 2007 Issue) Volume 382, Number 8517 The dominance of the Christian Democratic party during much of the postwar period lent continuity and comparative stability to Italy's political situation, mainly dominated by the attempt of keeping the Italian Communist Party (PCI) out of power in order to maintain Cold War equilibrium in the region (see May 1947 crisis).\n\nThe communists were in the government only in the national unity governments before 1948, in which their party's secretary Palmiro Togliatti was minister of Justice. After the first democratic elections with universal suffrage in 1948, in which the Christian Democracy and their allies won against the Popular front of the Italian Communist and Socialists parties, the communist party never returned in the government.\n\nEven though many repeat the cliché that Italy had over fifty governments in its first fifty years of democracy to stigmatise its alleged political instability, Italy's main political problem was actually the opposite: in all the course of the so-called First Republic, the government was in the hands of the Christian Democrats and their allies, since it was unacceptable for a communist party to rule a western country during the Cold war. The system had been nicknamed the imperfect bipolarism, referring to more proper bipolarism in other western countries (the United States, Germany, the United Kingdom, France etc.) where right-wing and left-wing parties alternated in government.\n\nEntrance of the Socialists to the government\n\nThe main event in the First Republic in the 1960s was the inclusion of the Socialist party in the government, after the reducing edge of the Christian Democracy (DC) had forced them to accept this alliance; attempts to incorporate the Italian Social Movement (MSI), a right party, in the Tambroni government led to riots, and were short-lived.\n\nAldo Moro, a relatively left-leaning Christian democrat, inspired this alliance. He would later try to include the Communist Party as well, with a deal called the historic compromise. This attempt at compromise was, however, stopped by the kidnapping and murder of Moro in 1978 by the Red Brigades, an extremist left-wing terrorist organization.\n\nThe Communist party was at this point the largest communist party in western Europe, and remained such for the rest of its existence. Their ability to attract members was largely due to their pragmatic stance, especially their rejection of extremism, and to their growing independence from Moscow (see Eurocommunism). The Italian communist party was especially strong in areas like Emilia-Romagna and Tuscany, where communists had been elected to stable government positions. This practical political experience may have contributed to their taking a more pragmatic approach to politics.\n\nThe Years of Lead\n\nOn 12 December 1969, a roughly decade-long period of extremist left- and right-wing political terrorism, known as the years of lead (as in the metal of bullets, ), began with the Piazza Fontana bombing in the center of Milan. Neofascist Vincenzo Vinciguerra later declared the bombing to be an attempt to push the Italian state to declare a state of emergency, in order to lead to a more authoritative state. A bomb left in a bank killed about twenty, and was initially blamed on anarchist Giuseppe Pinelli. This accusation was hotly contested by left-wing circles, especially the Maoist Student Movement, which had support in those years from some students of Milan's universities, and who considered the bombing to have all the marks of a fascist operation. Their guess proved correct, but only after many years of difficult investigations.\n\nThe strategy of tension attempted to blame the left for bombings carried out by right-wing terrorists. Fascist \"black terrorists,\" such as Ordine Nuovo and the Avanguardia Nazionale, were, in the 1980s-1990s, found to be responsible for several terrorist attacks. On the other extreme of the political spectrum, the leftist Red Brigades carried out assassinations against specific persons, but weren't responsible for any blind bombings. The Red Brigades killed socialist journalist Walter Tobagi, and, in their most famous operation, kidnapped and assassinated Aldo Moro, president of the Christian Democracy, who was trying to involve the Communist Party in the government through the compromesso storico (\"historic compromise\"), to which the radical left, as well as Washington, were opposed. It is worth noting that the Red Brigades met fierce resistance from the Communist Party and the trade unions; some left-wing politicians, however, used the sympathetic expression \"comrades who are mistaken\" (Italian: Compagni che sbagliano) to refer to the Red Brigades. Some, including the prosecutor of Moro case Ferdinando Imposimato, have alleged that the 2nd Red Brigades (those led by Mario Moretti) were exploited - or anyway allowed to act freely - by Andreotti's government and possibly foreign forces (notably United States) to destabilize Italy, discredit the Communist Party and impede the historic compromise.\n\nThe last and largest of the bombings, known as the Bologna massacre, destroyed the city's railway station in 1980. This was found to be a neofascist bombing, in which Propaganda Due was involved.\n\nOn 24 October 1990 Prime minister Giulio Andreotti (DC) revealed to the Parliament the existence of Gladio, NATO's secret \"stay-behind\" networks which stocked weapons in order to facilitate an armed resistance in case of a communist coup. In 2000, a Parliament Commission report from the Olive Tree (centre-left) coalition concluded that the strategy of tension followed by Gladio had been supported by the United States to \"stop the PCI and, to a certain degree, the PSI [Italian Socialist Party] from reaching executive power in the country.\"\n\n1980s\n\nWith the end of the lead years, the communist party gradually increased their votes under the leadership of Enrico Berlinguer. The Italian Socialist Party, led by Bettino Craxi, became more and more critical of the communists and of the Soviet Union; Craxi himself pushed in favor of Ronald Reagan's positioning of Pershing II missiles in Italy, a move many communists strongly disapproved of.\n\nAs the socialist party moved to more moderate positions, it attracted many reformists, some of whom were irritated by the failure of the communists to modernize. Increasingly, many on the left began to see the communists as old and out of fashion, while Craxi and the socialists seemed to represent a new liberal-socialism. The Communist party surpassed the Christian Democrats only in the European elections of 1984, held barely two days after Berlinguer's death, a passing that likely drew sympathy from many voters. The election of 1984, however, was to be the only time the Christian Democrats did not emerge as the largest party in a nationwide election in which they participated.\n\nIn 1987, one year after the Chernobyl disaster following a referendum in that year, a nuclear phase-out was commenced. Italy's four nuclear power plants were closed down, the last in 1990. A moratorium on the construction of new plants, originally in effect from 1987 until 1993, has since been extended indefinitely.http://energytrends.pnl.gov/italy/it004.htm\n\nIn these years, corruption began to be more extensive, a development that would be exposed in the early 1990s and nicknamed Tangentopoli. With the Mani Pulite investigation, starting just one year after the collapse of the Soviet Union, the whole power structure faltered, and seemingly indestructible parties, such as the Christian Democrats and the Socialist party, disbanded; the communist party changed its name to the Democratic Party of the Left and took the role of the socialist party as the main social democratic party in Italy. What was to follow was then called the transition to the Second Republic.\n\nSecond Republic: 1994–present\n\nFrom 1992 to 1997, Italy faced significant challenges, as voters, disenchanted with past political paralysis, massive government debt, extensive corruption, and organized crime's considerable influence—collectively called Tangentopoli after being uncovered by Mani pulite—demanded political, economic, and ethical reforms.\n\nIn the Italian referendums of 1993, voters approved substantial changes, including moving from a proportional to an Additional Member System, which is largely dominated by a majoritarian electoral system and the abolition of some ministries, some of which, however, have been reintroduced with only partly modified names, such as the Ministry of Agriculture reincarnated as the Ministry of Agricultural Resources.\n\nMajor political parties, beset by scandal and loss of voter confidence, underwent far-reaching changes. New political forces and new alignments of power emerged in the March 1994 national elections. This election saw a major turnover in the new parliament, with 452 out of 630 deputies and 213 out of 315 senators elected for the first time.The 1994 elections also swept media magnate Silvio Berlusconi (leader of \"Pole of Freedoms\" coalition) into office as Prime Minister. Berlusconi, however, was forced to step down in December 1994 when the Lega Nord withdrew support. The Berlusconi government was succeeded by a technical government headed by Prime Minister Lamberto Dini, which left office in early 1996.\n\nA series of center-left coalitions dominated Italy's political landscape between 1996 and 2001. In April 1996, national elections led to the victory of a center-left coalition, Olive Tree, under the leadership of Romano Prodi. Prodi's government became the third-longest to stay in power before he narrowly lost a vote of confidence, by three votes, in October 1998.\n\nIn May 1999, the Parliament selected Carlo Azeglio Ciampi as the President of the Republic. Ciampi, a former Prime Minister and Minister of the Treasury and, before entering the government, the governor of the Bank of Italy, was elected on the first ballot by a comfortable margin over the required two-thirds of the votes.\n\nA new government was formed by the Democrats of the Left leader and former communist Massimo D'Alema, but in April 2000, following poor performance by his coalition in regional elections, D'Alema resigned.\n\nThe succeeding center-left government, including most of the same parties, was headed by Giuliano Amato, a social-democrat, who had previously served as Prime Minister in 1992-93, and had at the time sworn never to return to active politics.\n\nNational elections held on 13 May 2001 returned Berlusconi to power at the head of the five-party center-right \"Freedom House\" coalition, comprising the prime minister's own party, Forza Italia, the National Alliance, the North League, the Christian Democratic Center, and the United Christian Democrats.\n\nBetween 17 May 2006 and 21 February 2007 Romano Prodi served as Prime Minister of Italy following the narrow victory of his l'Unione coalition over the Casa delle Libertà led by Silvio Berlusconi in the April 2006 Italian elections. Following a government crisis, Prodi submitted his resignation on 21 February 2007. Three days later he was asked by the Italian President, Giorgio Napolitano to stay on as Prime Minister and he agreed to do so. On 28 February 2007 Prodi narrowly survived a senate no confidence vote.\n\nLater, on 24 January 2008 the Prodi II Cabinet went through a new crisis, because the Minister of Justice, Clemente Mastella, retracted his support to the Cabinet. Consequently, the Prodi Cabinet lost the vote of confidence and the President Giorgio Napolitano called a new general election.\n\nThe election set against two new parties, the Democratic Party (founded in October 2007 by the union of the Democrats of the Left and Democracy is Freedom – The Daisy) led by Walter Veltroni, and The People of Freedom (federation of Forza Italia, National Alliance and other parties) led by Silvio Berlusconi. The Democratic Party was in alliance with Italy of Values, while The People of Freedom forged an alliance with Lega Nord and the Movement for the Autonomy. The coalition led by Berlusconi won the election and the leader of the centre-right created the Berlusconi IV Cabinet.\n\nThe Monti government had the highest average age in the western world (64 years), with its youngest members being 57. The previous Italian prime minister Mario Monti is 70, his predecessor Silvio Berlusconi was 75 at the time of resignation (2011), the previous head of the government Romano Prodi was 70 when he stepped down (2008), the Italian president Giorgio Napolitano is 88 and his predecessor Carlo Azeglio Ciampi was 86. In 2013, the youngest among the candidates for prime minister (Pier Luigi Bersani) is 62, the others being 70 and 78. The current average age of Italian university professors is 63, of bank directors and CEOs 67, of members of parliament 56, of labor union representatives 59.http://www.svd.se/nyheter/utrikes/ung-ilska-mot-italiens-politiska-dinosaurier_6887573.svdhttp://espresso.repubblica.it/dettaglio/il-parlamento-italiano-maschio-e-di-mezza-eta/2159841http://www.lastampa.it/2012/05/17/italia/politica/abbiamo-i-potenti-piu-vecchi-d-europapolitici-e-manager-sfiorano-i-anni-bvZs8WQYLtO40axUjOYsoJ/pagina.htmlhttp://www.senato.it/leg/16/BGT/Schede_v3/Statistiche/Composizione/Copertina.html\n\nThe new Italian government headed by Enrico Letta took two months to form and made international news when Luigi Preiti shot at policemen near the building where they were swearing in the new government on Sunday 28 April 2013.\n\nThe former prime minister Matteo Renzi became the youngest prime minister, at 39 years. His government had the youngest average age in Europe.\n\nGrand Coalition governments \n\nAt different times, since his entering the Italian Parliament, Silvio Berlusconi, leader of the centre-right, had repeatedly vowed to stop the \"communist\", while leftist parties had insisted that they would oust Berlusconi. Thus, despite the fact that the executive branch bears responsibility toward the Parliament, the governments led by Mario Monti (since 2011) and by Enrico Letta (since 2013) were called \"unelected governments\"  because they won a vote of confidence by a Parliament coalition formed by centre-right and left-right parties that had in turn obtained parliamentary seats by taking part in the elections as competitors, rather than allies. While formally complying with law and procedures, the creation of these governments did not comply with the decision made by people through the election.\n\nMeanwhile, in 2013, a ruling by the Constitutional Court of Italy established that the Italian electoral system employed to elect the Parliament breached a number of Constitutional requirements. Notably, the Court observed the following four facts: 1) \"such a legislation deprives the elector of any margin of choice of its representatives\"; 2) \"all of the elected parliamentarians, with no exception, lack the support of a personal designation by the citizens\"; 3) the electoral law has regulations which \"exclude any ability on the part of the elector to have an influence on the election of his/her representatives\"; 4) and contains conditions such that \"they alter the representative relationship between electors and elected people...they coerce the electors' freedom of choice in the election of their representatives to the Parliament...and consequently they are at odds with the democratic principle, by affecting the very freedom of vote provided for by art. 48 of the Constitution\". This implies that, despite being called - and acting as – a legitimate \"parliament\", the legislative assembly of Italy was chosen with a vote system by which the right of vote was not exercised according to the Italian fundamental chart of citizen's rights and duties. The issue was a major one, to the extent that the Constitutional Court itself ruled that the Italian Parliament should remain in charge only to reform the electoral system and then should be dissolved.\n\nThe new government, led by Matteo Renzi, proposed a new electoral law. The so-called Italicum was approved in 2015 and came into force on 1 July 2016.\n\nIdeological composition of past Italian governments \n\nhttps://books.google.com/books?idW8K3AwAAQBAJ&pg\nPA1960\n\n1946/48: National Unity (1947–48)\n\n1948/53: Centrist\n\n1953/58: Centrist, Centre-Right (1957–58)\n\n1958/63: Centrist, centre-right (1960), centre-left (1960–62).\n\n1963/68: Centrist (1963), centre-left (1963–68)\n\n1968/72:  Centrist (1968 and 1972), centre-left\n\n1972/76: Centrist, centre-left\n\n1976/79: National Unity, centre-left (1979)\n\n1979/83: centre-left\n\n1983/92: centre-left. Politics of Italy. http://en.wikipedia.org/?curid=14701."
  }
}
