{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6598",
  "eid" : "dc4cf480-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778449352,
  "textBody" : "A camel is an even-toed ungulate in the genus Camelus, bearing distinctive fatty deposits known as \"humps\" on its back. The three surviving species of camel are the dromedary, or one-humped camel (C. dromedarius), which inhabits the Middle East and the Horn of Africa; the Bactrian, or two-humped camel (C. bactrianus), which inhabits Central Asia; and the critically endangered wild Bactrian camel (C. ferus) that has limited populations in remote areas of northwest China and Mongolia. Bactrian camels take their name from the historical Bactria region of Central Asia. Additionally one other species of camel \nin the separate genus Camelops, C. hesternus  lived in western North America and became extinct when humans entered the continent at the end of the Pleistocene. Both the dromedary and the Bactrian camels have been domesticated; they provide milk, meat, hair for textiles or goods such as felted pouches, and are working animals with tasks ranging from human transport to bearing loads.\n\nThe term camel is derived via Latin and Greek ( and  kamēlos respectively) from Hebrew or Phoenician gāmāl.\n\nMost of the world's camels are dromedaries (94%) while Bactrian camels and wild Bactrian camels make up only 6% of the total camel population. \"Camel\" may also be used more broadly to describe any of the seven camel-like mammals in the family Camelidae: the three true camels and the four New World camelids (the llama, alpaca, guanaco, and vicuña).\n\nBiology\n\nThe average life expectancy of a camel is 40 to 50 years. A full-grown adult camel stands  at the shoulder and  at the hump. Camels can run at up to 65 km/h in short bursts and sustain speeds of up to 40 km/h. Bactrian camels weigh 300 to and dromedaries 300 to. The widening toes on a camel's hoof provide supplemental grip for varying soil sediments.Fayed, R. H. \"Adaptation of the Camel to Desert environment.\" Proceedings of the ESARF 11th Annual Conference. Available at:,(accessed on November 18, 2010). 2001.\n\nThe male dromedary camel has an organ called a dulla in its throat, a large, inflatable sac he extrudes from his mouth when in rut to assert dominance and attract females. It resembles a long, swollen, pink tongue hanging out of the side of its mouth. Camels mate by having both male and female sitting on the ground, with the male mounting from behind. The male usually ejaculates three or four times within a single mating session. Camelids are the only ungulates to mate in a sitting position.\n\nEcological and behavioral adaptations\n\nCamels do not directly store water in their humps as was once commonly believed. The humps are reservoirs of fatty tissue: concentrating body fat in their humps minimizes the insulating effect fat would have if distributed over the rest of their bodies, helping camels survive in hot climates. When this tissue is metabolized, it yields more than one gram of water for every gram of fat processed. This fat metabolization, while releasing energy, causes water to evaporate from the lungs during respiration (as oxygen is required for the metabolic process): overall, there is a net decrease in water.\n\nCamels have a series of physiological adaptations that allow them to withstand long periods of time without any external source of water.  The dromedary camel can drink as seldom as once every 10 days even under very hot conditions, and can lose up to 30% of its body mass due to dehydration. Unlike other mammals, camels' red blood cells are oval rather than circular in shape. This facilitates the flow of red blood cells during dehydration and makes them better at withstanding high osmotic variation without rupturing when drinking large amounts of water: a 600 kg camel can drink 200 L of water in three minutes.\n\nCamels are able to withstand changes in body temperature and water consumption that would kill most other animals. Their temperature ranges from 34 °C at dawn and steadily increases to 40 °C by sunset, before they cool off at night again. In general, to compare between camels and the other livestock, camels lose only 1.3 liters of fluid intake every day while the other livestock lose 20 to 40 liters per day (Breulmann, et al., 2007)Breulmann, M., Böer, B., Wernery, U., Wernery, R., El Shaer, H., Alhadrami, G., . . . Norton, J. (2007). \"The Camel From Tradition to Modern Times\" (PDF). UNESCO DOHA OFFICE. Maintaining the brain temperature within certain limits is critical for animals; to assist this, camels have a rete mirabile, a complex of arteries and veins lying very close to each other which utilizes countercurrent blood flow to cool blood flowing to the brain.Inside Nature's Giants.  Channel 4 (UK) documentary. Transmitted 30 August 2011 Camels rarely sweat, even when ambient temperatures reach 49 °C. Any sweat that does occur evaporates at the skin level rather than at the surface of their coat; the heat of vaporization therefore comes from body heat rather than ambient heat. Camels can withstand losing 25% of their body weight to sweating, whereas most other mammals can withstand only about 12–14% dehydration before cardiac failure results from circulatory disturbance.\n\nWhen the camel exhales, water vapor becomes trapped in their nostrils and is reabsorbed into the body as a means to conserve water. Camels eating green herbage can ingest sufficient moisture in milder conditions to maintain their bodies' hydrated state without the need for drinking.\n\nThe camels' thick coats insulate them from the intense heat radiated from desert sand; a shorn camel must sweat 50% more to avoid overheating. Cited in  During the summer the coat becomes lighter in color, reflecting light as well as helping avoid sunburn. The camel's long legs help by keeping its body farther from the ground, which can heat up to 70 °C. Dromedaries have a pad of thick tissue over the sternum called the pedestal. When the animal lies down in a sternal recumbent position, the pedestal raises the body from the hot surface and allows cooling air to pass under the body.\n\nCamels' mouths have a thick leathery lining, allowing them to chew thorny desert plants. Long eyelashes and ear hairs, together with nostrils that can close, form a barrier against sand. If sand gets lodged in their eyes, they can dislodge it using their transparent third eyelid. The camels' gait and widened feet help them move without sinking into the sand.\n\nThe kidneys and intestines of a camel are very efficient at reabsorbing water. Camels' kidneys have a 1:4 cortex to medulla ratio. Thus medullary part of camel's kidneys occupy twice as much area as a cow's kidney. Secondly, renal corpuscles have a smaller diameter, which reduces surface area for filtration. These two major anatomical characteristics enable camel to conserve water and limit the volume of urine in extreme desert conditions.Rehan S and AS Qureshi, 2006. Microscopic evaluation of the heart, kidneys and adrenal glands of one-humped camel calves (Camelus dromedarius) using semi automated image analysis system. J Camel Pract Res. 13(2): 123\n Camel urine comes out as a thick syrup, and camel feces are so dry that they do not require drying when the Bedouins use them to fuel fires. The camels are able to live in difficult conditions without drinking water due to their ability to produce small and pretty dry droppings as well as they use the water to maintain their body’s temperature to fit with the region surrounding them (Breulmann, et al., 2007).Breulmann, M., Böer, B., Wernery, U., Wernery, R., El Shaer, H., Alhadrami, G., . . . Norton, J. (2007). \"The Camel From Tradition to Modern Times\" (PDF). UNESCO DOHA OFFICE\n\nThe camel immune system differs from those of other mammals. Normally, the Y-shaped antibody molecules consist of two heavy (or long) chains along the length of the Y, and two light (or short) chains at each tip of the Y. Camels, in addition to these, also have antibodies made of only two heavy chains, a trait that makes them smaller and more durable. These \"heavy-chain-only\" antibodies, discovered in 1993, are thought to have developed 50 million years ago, after camelids split from ruminants and pigs.\n\nGenetics\n\nThe karyotypes of different camelid species have been studied earlier by many groups, but no agreement on chromosome nomenclature of camelids has been reached. A 2007 study flow sorted camel chromosomes, building on the fact that camels have 37 pairs of chromosomes (2n=74), and found that the karyotime consisted of one metacentric, three submetacentric, and 32 acrocentric autosomes. The Y is a small metacentric chromosome, while the X is a large metacentric chromosome.\n\nThe hybrid camel, a hybrid between Bactrian and dromedary camels, has one hump, though it has an indentation 4 – deep that divides the front from the back. The hybrid is  at the shoulder and  tall at the hump. It weighs an average of 650 kg and can carry around 400 to, which is more than either the dromedary or Bactrian can.\n\nAccording to molecular data, the New World and Old World camelids diverged about 11 million years ago. In spite of this, these species can hybridize and produce viable offspring. The cama is a camel-lama hybrid bred by scientists to see how closely related the parent species are. Scientists collected semen from a camel via an artificial vagina and inseminated a llama after stimulating ovulation with gonadotrophin injections. The cama is halfway in size between a camel and a llama and lacks a hump. It has ears intermediate between those of camels and llamas, longer legs than the llama, and partially cloven hooves. Like the mule, camas are sterile, despite both parents having the same number of chromosomes. The wild Bactrian camel (C. ferus) separated from the domestic Bactrian camel (C. bactrianus) about 1 million years ago.\n\nEvolution\n\nThe earliest known camel, called Protylopus, lived in North America 40 to 50 million years ago (during the Eocene). It was about the size of a rabbit and lived in the open woodlands of what is now South Dakota. By 35 million years ago, the Poebrotherium was the size of a goat and had many more traits similar to camels and llamas. The hoofed Stenomylus, which walked on the tips of its toes, also existed around this time, and the long-necked Aepycamelus evolved in the Miocene.\n\nThe direct ancestor of all modern camels, Procamelus, existed in the upper Miocene and lower Pliocene. Around 3–5 million years ago, the North American Camelidae spread to South America as part of the Great American Interchange via the newly formed Isthmus of Panama, where they gave rise to guanacos and related animals, and to Asia via the Bering land bridge. Surprising finds of fossil Paracamelus on Ellesmere Island beginning in 2006 in the high Canadian Arctic indicate the dromedary is descended from a larger, boreal browser whose hump may have evolved as an adaptation in a cold climate.Allen, Kate [https://www.thestar.com/news/world/2013/03/05/camel_fossils_discovered_in_canadas_arctic_shed_light_on_animals_evolution.html Camel fossils discovered in Canada’s Arctic shed light on animal’s evolution] , Toronto Star. 5 March 2013. Retrieved 5 March 2013. This creature is estimated to have stood around nine feet tall.\n\nThe last camel native to North America was Camelops hesternus, which vanished along with horses, short-faced bears, mammoths and mastodons, ground sloths, sabertooth cats, and many other megafauna, coinciding with the migration of humans from Asia.\n\nDomestication\n\nLike the horse, before their extinction in their native land, camels spread across the Bering land bridge, moving the opposite direction from the Asian immigration to America, to survive in the Old World and eventually be domesticated and spread globally by humans.\nMost camels surviving today are domesticated. Along with many other megafauna in North America, the original wild camels were wiped out during the spread of Native Americans from Asia into North America, 12,000 to 10,000 years ago. Although feral populations exist in Australia, India and Kazakhstan, the only wild camels left are the wild Bactrian camels of the Gobi Desert.\n\nDromedaries may have first been domesticated by humans in Somalia and southern Arabia, around 3,000 BC, the Bactrian in central Asia around 2,500 BC,—Note that Bulliet has many more references to early use of camels as at Shar-i Sokhta (also known as the Burnt City), Iran.\n\nDiscussions concerning camel domestication in Mesopotamia are often related to mentions of camels in the Hebrew Bible. The International Standard Bible Encyclopedia: E-J for instance mentions that \"In accord with patriarchal traditions, cylinder seals from Middle Bronze Age Mesopotamia showed riders seated upon camels.\"\n\nMartin Heide's 2010 work on the domestication of the camel tentatively concludes that the bactrian camel was domesticated by at least the middle of the third millennium somewhere east of the Zagros Mountains, then moving into Mesopotamia, and suggests that mentions of camels \"in the patriarchal narratives may refer, at least in some places, to the Bactrian camel.\" while noting that the camel is not mentioned in relationship to Canaan.\n\nRecent excavations in the Timna Valley by Lidar Sapir-Hen and Erez Ben-Yosef discovered what may be the earliest domestic camel bones found in Israel or even outside the Arabian Peninsula, dating to around 930 BC. This garnered considerable media coverage as it was described as evidence that the stories of Abraham, Jacob, Esau, and Joseph were written after this time.\n\nThe existence of camels in Mesopotamia but not in Israel is not a new idea. The historian Richard Bulliet did not think that the occasional mention of camels meant that the domestic camels were common in the Holy Land at that time. The archaeologist William F. Albright writing even earlier saw camels in the Bible as an anachronism.\n\nThe official report by Sapir-Hen and Ben-Joseph notes that \"The introduction of the dromedary camel (Camelus dromedarius) as a pack animal to the southern Levant ... substantially facilitated trade across the vast deserts of Arabia, promoting both economic and social change (e.g., Kohler 1984; Borowski 1998: 112–116; Jasmin 2005). This ... has generated extensive discussion regarding the date of the earliest domestic camel in the southern Levant (and beyond) (e.g., Albright 1949: 207; Epstein 1971: 558–584; Bulliet 1975; Zarins 1989; Köhler-Rollefson 1993; Uerpmann and Uerpmann 2002; Jasmin 2005; 2006; Heide 2010; Rosen and Saidel 2010; Grigson 2012). Most scholars today agree that the dromedary was exploited as a pack animal sometime in the early Iron Age (not before the 12th century [BC])\" and concludes that \"Current data from copper smelting sites of the Aravah Valley enable us to pinpoint the introduction of domestic camels to the southern Levant more precisely based on stratigraphic contexts associated with an extensive suite of radiocarbon dates. The data indicate that this event occurred not earlier than the last third of the 10th century [BC] and most probably during this time. The coincidence of this event with a major reorganization of the copper industry of the region—attributed to the results of the campaign of Pharaoh Shoshenq I—raises the possibility that the two were connected, and that camels were introduced as part of the efforts to improve efficiency by facilitating trade.\"\n\nTextiles \n\nDesert tribes and Mongolian nomads use camel hair for tents, yurts, clothing, bedding and accessories. Camels have outer guard hairs and soft inner down, and the fibers are sorted by color and age of the animal. The guard hairs can be felted for use as waterproof coats for the herdsmen, while the softer hair is used for premium goods. The fiber can be spun for use in weaving or made into yarns for hand knitting or crochet. Pure camel hair is recorded as being used for western garments from the 17th century onwards, and from the 19th century a mixture of wool and camel hair was used.\n\nMilitary uses\n\nBy at least 1200 BC, the first camel saddles had appeared, and Bactrian camels could be ridden. The first saddle was positioned to the back of the camel, and control of the Bactrian camel was exercised by means of a stick. However, between 500–100 BC, Bactrian camels attained military use. New saddles, which were inflexible and bent, were put over the humps and divided the rider's weight over the animal. In the seventh century BC, the military Arabian saddle appeared, which again improved the saddle design slightly.\n\nCamel cavalries have been used in wars throughout Africa, the Middle East, and into modern-day Border Security Force of India (though as of July 2012, the BSF has planned the replacement of camels with ATVs). The first use of camel cavalries was in the Battle of Qarqar in 853 BC. Armies have also used camels as freight animals instead of horses and mules.\n\nIn the East Roman Empire, the Romans used auxiliary forces known as dromedarii, whom they recruited in desert provinces. The camels were used mostly in combat because of their ability to scare off horses at close ranges (horses are afraid of the camels' scent), a quality famously employed by the Achaemenid Persians when fighting Lydia in the Battle of Thymbra.\n\n19th and 20th centuries\n\n* The United States Army established the U.S. Camel Corps, which was stationed in California in the late 19th century. One may still see stables at the Benicia Arsenal in Benicia, California, where they nowadays serve as the Benicia Historical Museum. Though the experimental use of camels was seen as a success (John B. Floyd, Secretary of War in 1858, recommended that funds be allocated towards obtaining a thousand more camels), the outbreak of the American Civil War saw the end of the Camel Corps: Texas became part of the Confederacy, and most of the camels were left to wander away into the desert.\n* France created a méhariste camel corps in 1912 as part of the Armée d'Afrique in the Sahara in order to exercise greater control over the camel-riding Tuareg and Arab insurgents, as previous efforts to defeat them on foot had failed. The Free French Camel Corps fought during World War II and camel-mounted units remained in service until the end of French rule over Algeria in 1962.\n* In 1916, the British created the Imperial Camel Corps. It was originally used to fight the Senussi, but was later used in the Sinai and Palestine Campaign in World War I. The Imperial Camel Corps comprised infantrymen mounted on camels for movement across desert, though they dismounted at battle sites and fought on foot. After July 1918, the Corps began to become run down, receiving no new reinforcements, and was formally disbanded in 1919.\n* In World War I, the British Army also created the Egyptian Camel Transport Corps, which consisted of a group of Egyptian camel drivers and their camels. The Corps supported British war operations in Sinai, Palestine, and Syria by transporting supplies to the troops.\n* The Somaliland Camel Corps was created by colonial authorities in British Somaliland in 1912; it was disbanded in 1944.\n* Bactrian camels were used by Romanian forces during World War II in the Caucasian region.\n* The Bikaner Camel Corps of British India fought alongside the British Indian Army in World Wars I and II.\n* The Tropas Nómadas (Nomad Troops) were an auxiliary regiment of Sahrawi tribesmen serving in the colonial army in Spanish Sahara (today Western Sahara). Operational from the 1930s until the end of the Spanish presence in the territory in 1975, the Tropas Nómadas were equipped with small arms and led by Spanish officers. The unit guarded outposts and sometimes conducted patrols on camelback.\n\nFood uses\n\nDairy\n\nCamel milk is a staple food of desert nomad tribes and is sometimes considered a meal itself; a nomad can live on only camel milk for almost a month. Camel milk is rich in vitamins, minerals, proteins, and immunoglobulins; compared to cow's milk, it is lower in fat and lactose, and higher in potassium, iron, and vitamin C. Bedouins believe the curative powers of camel milk are enhanced if the camel's diet consists of certain desert plants. Camel milk can readily be made into a drinkable yogurt, as well as butter or cheese, though the yields for cheese tend to be low.\n\nCamel milk cannot be made into butter by the traditional churning method. It can be made if it is soured first, churned, and a clarifying agent is then added. Until recently, camel milk could not be made into camel cheese because rennet was unable to coagulate the milk proteins to allow the collection of curds. Developing less wasteful uses of the milk, the FAO commissioned Professor J.P. Ramet of the École Nationale Supérieure d'Agronomie et des Industries Alimentaires, who was able to produce curdling by the addition of calcium phosphate and vegetable rennet. The cheese produced from this process has low levels of cholesterol and is easy to digest, even for the lactose intolerant. The sale of camel cheese is limited owing to the small output of the few dairies producing camel cheese and the absence of camel cheese in local (West African) markets. Cheese imports from countries that traditionally breed camels are difficult to obtain due to restrictions on dairy imports from these regions.\n\nAdditionally, camel milk has been made into ice cream in a Netherlands camel farm.\n\nMeat\n\nCamels are the ultimate pillars that support national economies of many developing countries, because they are useful for transport, and provide food in the form of meat and milk (Tariq et al.,2010).Tariq, M., Rabia, R., Jamil, A., Sakhwat, A., Aadil, A., & Muhammad S., 2010. Minerals and Nutritional Composition of Camel (Camelus Dromedarius) Meat in Pakistan. Journal- Chemical Society of Pakistan, Vol 33(6). A camel carcass can provide a substantial amount of meat. The male dromedary carcass can weigh 300 –, while the carcass of a male Bactrian can weigh up to 650 kg. The carcass of a female dromedary weighs less than the male, ranging between 250 and. The brisket, ribs and loin are among the preferred parts, and the hump is considered a delicacy. The hump contains \"white and sickly fat\", which can be used to make the khli (preserved meat) of mutton, beef, or camel. On the other hand, camel milk and meat are rich in protein, vitamins, glycogen, and other nutrients making them essential in the diet of many people. From chemical composition to meat quality, the dromedary camel is the preferred breed for meat production. It does well even in arid areas due to its unusual physiological behaviors and characteristics, which include tolerance to extreme temperatures, radiation from the sun, water paucity, rugged landscape and low vegetation (Aleme, 2013).Aleme, A., D., 2013. A Review of Camel Meat as a Precious Source of Nutrition in some part of Ethiopia. Agricultural Science, Engineering and Technology Research. Vol. 1, No. 4, December 2013, PP: 40–43. Available online at . Camel meat is reported to taste like coarse beef, but older camels can prove to be very tough, although camel meat becomes more tender the more it is cooked. The Abu Dhabi Officers' Club serves a camel burger mixed with beef or lamb fat in order to improve the texture and taste. In Karachi, Pakistan, some restaurants prepare nihari from camel meat. In Syria and Egypt, there are specialist camel butchers.[https://www.theguardian.com/lifeandstyle/wordofmouth/2013/apr/16/camel-meat-one-hump-two Anyone for camel meat? One hump or two?] The Guardian, Word of Mouth\n\nCamel meat has been eaten for centuries. It has been recorded by ancient Greek writers as an available dish at banquets in ancient Persia, usually roasted whole. The ancient Roman emperor Heliogabalus enjoyed camel's heel. Camel meat is still eaten in certain regions, including Eritrea, Somalia, Djibouti, Saudi Arabia, Egypt, Syria, Libya, Sudan, Ethiopia, Kazakhstan, and other arid regions where alternative forms of protein may be limited or where camel meat has had a long cultural history. Camel blood is also consumable, as is the case among pastoralists in northern Kenya, where camel blood is drunk with milk and acts as a key source of iron, vitamin D, salts and minerals. Camel meat is also occasionally found in Australian cuisine: for example, a camel lasagna is available in Alice Springs.\n\nA 2005 report issued jointly by the Saudi Ministry of Health and the United States Centers for Disease Control and Prevention details cases of human bubonic plague resulting from the ingestion of raw camel liver.\n\nReligion\n\nIslam\n\nCamel meat is halal (, 'allowed') for Muslims. However, according to some Islamic schools of thought, a state of impurity is brought on by the consumption of it. Consequently, these schools hold that Muslims must perform wudhu (ablution) before the next time they pray after eating camel meat. Also, some Islamic schools of thought consider it haram (, 'forbidden') for a Muslim to perform Salat in places where camels lie, as it is said to be a dwelling place of the Shaytan (, 'Devil'). According to Abu Yusuf, the urine of camel may be used for medical treatment if necessary, but according to Abū Ḥanīfah, the drinking of camel urine is discouraged.\n\nThe Islamic texts contain several stories featuring camels. In the story of the people of Thamud, the Prophet Salih miraculously brings forth a naqat (, 'she-camel') out of a rock. After the Prophet Muhammad migrated from Mecca to Medina, he allowed his she-camel to roam there; the location where the camel stopped to rest determined the location where he would build his house in Medina.Campo, Juan Eduardo (2009). Encyclopedia of Islam. Infobase Publishing. p. 128.\n\nJudaism\n\n   \nAccording to Jewish tradition, camel meat and milk are not kosher. Camels possess only one of the two kosher criteria; although they chew their cud, they do not possess cloven hooves:\n\n\"But these you shall not eat among those that bring up the cud and those that have a cloven hoof: the camel, because it brings up its cud, but does not have a [completely] cloven hoof; it is unclean for you.\"http://www.chabad.org/library/bible_cdo/aid/9912#v=41 \n\nDepictions in culture\n\nFile:Bowl Depicting Bahram Gur and Azada, late 12th-early 13th century 86.227.11.jpg|Bowl depicting Bahram Gur and Azada, c. early 13th century, Brooklyn Museum\nFile:Vessel in the Form of a Recumbent Camel with Jugs, 2015.65.15.jpg|Vessel in the form of a recumbent camel with jugs, 250 BC–224 AD,  Brooklyn Museum\nFile:Brooklyn Museum - Maru Ragini (Dhola and Maru riding on a Camel).jpg|Maru Ragini (Dhola and Maru riding on a camel), c. 1750,  Brooklyn Museum\nFile:Brooklyn Museum - The Magi Journeying (Les rois mages en voyage) - James Tissot - overall.jpg|The Magi journeying (Les rois mages en voyage) - James Tissot, c. 1886, Brooklyn Museum\n\nDistribution and numbers\n\nThere are around 14 million camels alive , with 90% being dromedaries. Dromedaries alive today are domesticated animals (mostly living in the Horn of Africa, the Sahel, Maghreb, Middle East and South Asia). The Horn region alone has the largest concentration of camels in the world, where the dromedaries constitute an important part of local nomadic life. They provide nomadic people in Somalia (which has the largest camel herd in the world) and Ethiopia with milk, food, and transportation. [http://www.mbali.info/doc265.htm Plain text version.] \n\nThe Bactrian camel is, , reduced to an estimated 1.4 million animals, most of which are domesticated. The only truly wild (as opposed to feral) camel is the wild Bactrian camel, which number approximately 1400, which inhabits the Gobi and Taklamakan Deserts in China and Mongolia.\n\nThe largest population of feral camels is in Australia. There are around 700,000 feral dromedary camels in central parts of Australia, descended from those introduced as a method of transport in the 19th and early 20th centuries. This population is growing about 8% per year. Representatives of the Australian government have culled more than 100,000 of the animals in part because the camels use too much of the limited resources needed by sheep farmers.\n\nA small population of introduced camels, dromedaries and Bactrians, wandered through Southwestern United States after having been imported in the 19th century as part of the U.S. Camel Corps experiment. When the project ended, they were used as draft animals in mines and escaped or were released. Twenty-five U.S. camels were bought and imported to Canada during the Cariboo Gold Rush.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Camel" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6598" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A camel is an even-toed ungulate in the genus Camelus, bearing distinctive fatty deposits known as \"humps\" on its back. The three surviving species of camel are the dromedary, or one-humped camel (C. dromedarius), which inhabits the Middle East and the Horn of Africa; the Bactrian, or two-humped camel (C. bactrianus), which inhabits Central Asia; and the critically endangered wild Bactrian camel (C. ferus) that has limited populations in remote areas of northwest China and Mongolia. Bactrian camels take their name from the historical Bactria region of Central Asia. Additionally one other species of camel \nin the separate genus Camelops, C. hesternus  lived in western North America and became extinct when humans entered the continent at the end of the Pleistocene. Both the dromedary and the Bactrian camels have been domesticated; they provide milk, meat, hair for textiles or goods such as felted pouches, and are working animals with tasks ranging from human transport to bearing loads.\n\nThe term camel is derived via Latin and Greek ( and  kamēlos respectively) from Hebrew or Phoenician gāmāl.\n\nMost of the world's camels are dromedaries (94%) while Bactrian camels and wild Bactrian camels make up only 6% of the total camel population. \"Camel\" may also be used more broadly to describe any of the seven camel-like mammals in the family Camelidae: the three true camels and the four New World camelids (the llama, alpaca, guanaco, and vicuña).\n\nBiology\n\nThe average life expectancy of a camel is 40 to 50 years. A full-grown adult camel stands  at the shoulder and  at the hump. Camels can run at up to 65 km/h in short bursts and sustain speeds of up to 40 km/h. Bactrian camels weigh 300 to and dromedaries 300 to. The widening toes on a camel's hoof provide supplemental grip for varying soil sediments.Fayed, R. H. \"Adaptation of the Camel to Desert environment.\" Proceedings of the ESARF 11th Annual Conference. Available at:,(accessed on November 18, 2010). 2001.\n\nThe male dromedary camel has an organ called a dulla in its throat, a large, inflatable sac he extrudes from his mouth when in rut to assert dominance and attract females. It resembles a long, swollen, pink tongue hanging out of the side of its mouth. Camels mate by having both male and female sitting on the ground, with the male mounting from behind. The male usually ejaculates three or four times within a single mating session. Camelids are the only ungulates to mate in a sitting position.\n\nEcological and behavioral adaptations\n\nCamels do not directly store water in their humps as was once commonly believed. The humps are reservoirs of fatty tissue: concentrating body fat in their humps minimizes the insulating effect fat would have if distributed over the rest of their bodies, helping camels survive in hot climates. When this tissue is metabolized, it yields more than one gram of water for every gram of fat processed. This fat metabolization, while releasing energy, causes water to evaporate from the lungs during respiration (as oxygen is required for the metabolic process): overall, there is a net decrease in water.\n\nCamels have a series of physiological adaptations that allow them to withstand long periods of time without any external source of water.  The dromedary camel can drink as seldom as once every 10 days even under very hot conditions, and can lose up to 30% of its body mass due to dehydration. Unlike other mammals, camels' red blood cells are oval rather than circular in shape. This facilitates the flow of red blood cells during dehydration and makes them better at withstanding high osmotic variation without rupturing when drinking large amounts of water: a 600 kg camel can drink 200 L of water in three minutes.\n\nCamels are able to withstand changes in body temperature and water consumption that would kill most other animals. Their temperature ranges from 34 °C at dawn and steadily increases to 40 °C by sunset, before they cool off at night again. In general, to compare between camels and the other livestock, camels lose only 1.3 liters of fluid intake every day while the other livestock lose 20 to 40 liters per day (Breulmann, et al., 2007)Breulmann, M., Böer, B., Wernery, U., Wernery, R., El Shaer, H., Alhadrami, G., . . . Norton, J. (2007). \"The Camel From Tradition to Modern Times\" (PDF). UNESCO DOHA OFFICE. Maintaining the brain temperature within certain limits is critical for animals; to assist this, camels have a rete mirabile, a complex of arteries and veins lying very close to each other which utilizes countercurrent blood flow to cool blood flowing to the brain.Inside Nature's Giants.  Channel 4 (UK) documentary. Transmitted 30 August 2011 Camels rarely sweat, even when ambient temperatures reach 49 °C. Any sweat that does occur evaporates at the skin level rather than at the surface of their coat; the heat of vaporization therefore comes from body heat rather than ambient heat. Camels can withstand losing 25% of their body weight to sweating, whereas most other mammals can withstand only about 12–14% dehydration before cardiac failure results from circulatory disturbance.\n\nWhen the camel exhales, water vapor becomes trapped in their nostrils and is reabsorbed into the body as a means to conserve water. Camels eating green herbage can ingest sufficient moisture in milder conditions to maintain their bodies' hydrated state without the need for drinking.\n\nThe camels' thick coats insulate them from the intense heat radiated from desert sand; a shorn camel must sweat 50% more to avoid overheating. Cited in  During the summer the coat becomes lighter in color, reflecting light as well as helping avoid sunburn. The camel's long legs help by keeping its body farther from the ground, which can heat up to 70 °C. Dromedaries have a pad of thick tissue over the sternum called the pedestal. When the animal lies down in a sternal recumbent position, the pedestal raises the body from the hot surface and allows cooling air to pass under the body.\n\nCamels' mouths have a thick leathery lining, allowing them to chew thorny desert plants. Long eyelashes and ear hairs, together with nostrils that can close, form a barrier against sand. If sand gets lodged in their eyes, they can dislodge it using their transparent third eyelid. The camels' gait and widened feet help them move without sinking into the sand.\n\nThe kidneys and intestines of a camel are very efficient at reabsorbing water. Camels' kidneys have a 1:4 cortex to medulla ratio. Thus medullary part of camel's kidneys occupy twice as much area as a cow's kidney. Secondly, renal corpuscles have a smaller diameter, which reduces surface area for filtration. These two major anatomical characteristics enable camel to conserve water and limit the volume of urine in extreme desert conditions.Rehan S and AS Qureshi, 2006. Microscopic evaluation of the heart, kidneys and adrenal glands of one-humped camel calves (Camelus dromedarius) using semi automated image analysis system. J Camel Pract Res. 13(2): 123\n Camel urine comes out as a thick syrup, and camel feces are so dry that they do not require drying when the Bedouins use them to fuel fires. The camels are able to live in difficult conditions without drinking water due to their ability to produce small and pretty dry droppings as well as they use the water to maintain their body’s temperature to fit with the region surrounding them (Breulmann, et al., 2007).Breulmann, M., Böer, B., Wernery, U., Wernery, R., El Shaer, H., Alhadrami, G., . . . Norton, J. (2007). \"The Camel From Tradition to Modern Times\" (PDF). UNESCO DOHA OFFICE\n\nThe camel immune system differs from those of other mammals. Normally, the Y-shaped antibody molecules consist of two heavy (or long) chains along the length of the Y, and two light (or short) chains at each tip of the Y. Camels, in addition to these, also have antibodies made of only two heavy chains, a trait that makes them smaller and more durable. These \"heavy-chain-only\" antibodies, discovered in 1993, are thought to have developed 50 million years ago, after camelids split from ruminants and pigs.\n\nGenetics\n\nThe karyotypes of different camelid species have been studied earlier by many groups, but no agreement on chromosome nomenclature of camelids has been reached. A 2007 study flow sorted camel chromosomes, building on the fact that camels have 37 pairs of chromosomes (2n=74), and found that the karyotime consisted of one metacentric, three submetacentric, and 32 acrocentric autosomes. The Y is a small metacentric chromosome, while the X is a large metacentric chromosome.\n\nThe hybrid camel, a hybrid between Bactrian and dromedary camels, has one hump, though it has an indentation 4 – deep that divides the front from the back. The hybrid is  at the shoulder and  tall at the hump. It weighs an average of 650 kg and can carry around 400 to, which is more than either the dromedary or Bactrian can.\n\nAccording to molecular data, the New World and Old World camelids diverged about 11 million years ago. In spite of this, these species can hybridize and produce viable offspring. The cama is a camel-lama hybrid bred by scientists to see how closely related the parent species are. Scientists collected semen from a camel via an artificial vagina and inseminated a llama after stimulating ovulation with gonadotrophin injections. The cama is halfway in size between a camel and a llama and lacks a hump. It has ears intermediate between those of camels and llamas, longer legs than the llama, and partially cloven hooves. Like the mule, camas are sterile, despite both parents having the same number of chromosomes. The wild Bactrian camel (C. ferus) separated from the domestic Bactrian camel (C. bactrianus) about 1 million years ago.\n\nEvolution\n\nThe earliest known camel, called Protylopus, lived in North America 40 to 50 million years ago (during the Eocene). It was about the size of a rabbit and lived in the open woodlands of what is now South Dakota. By 35 million years ago, the Poebrotherium was the size of a goat and had many more traits similar to camels and llamas. The hoofed Stenomylus, which walked on the tips of its toes, also existed around this time, and the long-necked Aepycamelus evolved in the Miocene.\n\nThe direct ancestor of all modern camels, Procamelus, existed in the upper Miocene and lower Pliocene. Around 3–5 million years ago, the North American Camelidae spread to South America as part of the Great American Interchange via the newly formed Isthmus of Panama, where they gave rise to guanacos and related animals, and to Asia via the Bering land bridge. Surprising finds of fossil Paracamelus on Ellesmere Island beginning in 2006 in the high Canadian Arctic indicate the dromedary is descended from a larger, boreal browser whose hump may have evolved as an adaptation in a cold climate.Allen, Kate [https://www.thestar.com/news/world/2013/03/05/camel_fossils_discovered_in_canadas_arctic_shed_light_on_animals_evolution.html Camel fossils discovered in Canada’s Arctic shed light on animal’s evolution] , Toronto Star. 5 March 2013. Retrieved 5 March 2013. This creature is estimated to have stood around nine feet tall.\n\nThe last camel native to North America was Camelops hesternus, which vanished along with horses, short-faced bears, mammoths and mastodons, ground sloths, sabertooth cats, and many other megafauna, coinciding with the migration of humans from Asia.\n\nDomestication\n\nLike the horse, before their extinction in their native land, camels spread across the Bering land bridge, moving the opposite direction from the Asian immigration to America, to survive in the Old World and eventually be domesticated and spread globally by humans.\nMost camels surviving today are domesticated. Along with many other megafauna in North America, the original wild camels were wiped out during the spread of Native Americans from Asia into North America, 12,000 to 10,000 years ago. Although feral populations exist in Australia, India and Kazakhstan, the only wild camels left are the wild Bactrian camels of the Gobi Desert.\n\nDromedaries may have first been domesticated by humans in Somalia and southern Arabia, around 3,000 BC, the Bactrian in central Asia around 2,500 BC,—Note that Bulliet has many more references to early use of camels as at Shar-i Sokhta (also known as the Burnt City), Iran.\n\nDiscussions concerning camel domestication in Mesopotamia are often related to mentions of camels in the Hebrew Bible. The International Standard Bible Encyclopedia: E-J for instance mentions that \"In accord with patriarchal traditions, cylinder seals from Middle Bronze Age Mesopotamia showed riders seated upon camels.\"\n\nMartin Heide's 2010 work on the domestication of the camel tentatively concludes that the bactrian camel was domesticated by at least the middle of the third millennium somewhere east of the Zagros Mountains, then moving into Mesopotamia, and suggests that mentions of camels \"in the patriarchal narratives may refer, at least in some places, to the Bactrian camel.\" while noting that the camel is not mentioned in relationship to Canaan.\n\nRecent excavations in the Timna Valley by Lidar Sapir-Hen and Erez Ben-Yosef discovered what may be the earliest domestic camel bones found in Israel or even outside the Arabian Peninsula, dating to around 930 BC. This garnered considerable media coverage as it was described as evidence that the stories of Abraham, Jacob, Esau, and Joseph were written after this time.\n\nThe existence of camels in Mesopotamia but not in Israel is not a new idea. The historian Richard Bulliet did not think that the occasional mention of camels meant that the domestic camels were common in the Holy Land at that time. The archaeologist William F. Albright writing even earlier saw camels in the Bible as an anachronism.\n\nThe official report by Sapir-Hen and Ben-Joseph notes that \"The introduction of the dromedary camel (Camelus dromedarius) as a pack animal to the southern Levant ... substantially facilitated trade across the vast deserts of Arabia, promoting both economic and social change (e.g., Kohler 1984; Borowski 1998: 112–116; Jasmin 2005). This ... has generated extensive discussion regarding the date of the earliest domestic camel in the southern Levant (and beyond) (e.g., Albright 1949: 207; Epstein 1971: 558–584; Bulliet 1975; Zarins 1989; Köhler-Rollefson 1993; Uerpmann and Uerpmann 2002; Jasmin 2005; 2006; Heide 2010; Rosen and Saidel 2010; Grigson 2012). Most scholars today agree that the dromedary was exploited as a pack animal sometime in the early Iron Age (not before the 12th century [BC])\" and concludes that \"Current data from copper smelting sites of the Aravah Valley enable us to pinpoint the introduction of domestic camels to the southern Levant more precisely based on stratigraphic contexts associated with an extensive suite of radiocarbon dates. The data indicate that this event occurred not earlier than the last third of the 10th century [BC] and most probably during this time. The coincidence of this event with a major reorganization of the copper industry of the region—attributed to the results of the campaign of Pharaoh Shoshenq I—raises the possibility that the two were connected, and that camels were introduced as part of the efforts to improve efficiency by facilitating trade.\"\n\nTextiles \n\nDesert tribes and Mongolian nomads use camel hair for tents, yurts, clothing, bedding and accessories. Camels have outer guard hairs and soft inner down, and the fibers are sorted by color and age of the animal. The guard hairs can be felted for use as waterproof coats for the herdsmen, while the softer hair is used for premium goods. The fiber can be spun for use in weaving or made into yarns for hand knitting or crochet. Pure camel hair is recorded as being used for western garments from the 17th century onwards, and from the 19th century a mixture of wool and camel hair was used.\n\nMilitary uses\n\nBy at least 1200 BC, the first camel saddles had appeared, and Bactrian camels could be ridden. The first saddle was positioned to the back of the camel, and control of the Bactrian camel was exercised by means of a stick. However, between 500–100 BC, Bactrian camels attained military use. New saddles, which were inflexible and bent, were put over the humps and divided the rider's weight over the animal. In the seventh century BC, the military Arabian saddle appeared, which again improved the saddle design slightly.\n\nCamel cavalries have been used in wars throughout Africa, the Middle East, and into modern-day Border Security Force of India (though as of July 2012, the BSF has planned the replacement of camels with ATVs). The first use of camel cavalries was in the Battle of Qarqar in 853 BC. Armies have also used camels as freight animals instead of horses and mules.\n\nIn the East Roman Empire, the Romans used auxiliary forces known as dromedarii, whom they recruited in desert provinces. The camels were used mostly in combat because of their ability to scare off horses at close ranges (horses are afraid of the camels' scent), a quality famously employed by the Achaemenid Persians when fighting Lydia in the Battle of Thymbra.\n\n19th and 20th centuries\n\n* The United States Army established the U.S. Camel Corps, which was stationed in California in the late 19th century. One may still see stables at the Benicia Arsenal in Benicia, California, where they nowadays serve as the Benicia Historical Museum. Though the experimental use of camels was seen as a success (John B. Floyd, Secretary of War in 1858, recommended that funds be allocated towards obtaining a thousand more camels), the outbreak of the American Civil War saw the end of the Camel Corps: Texas became part of the Confederacy, and most of the camels were left to wander away into the desert.\n* France created a méhariste camel corps in 1912 as part of the Armée d'Afrique in the Sahara in order to exercise greater control over the camel-riding Tuareg and Arab insurgents, as previous efforts to defeat them on foot had failed. The Free French Camel Corps fought during World War II and camel-mounted units remained in service until the end of French rule over Algeria in 1962.\n* In 1916, the British created the Imperial Camel Corps. It was originally used to fight the Senussi, but was later used in the Sinai and Palestine Campaign in World War I. The Imperial Camel Corps comprised infantrymen mounted on camels for movement across desert, though they dismounted at battle sites and fought on foot. After July 1918, the Corps began to become run down, receiving no new reinforcements, and was formally disbanded in 1919.\n* In World War I, the British Army also created the Egyptian Camel Transport Corps, which consisted of a group of Egyptian camel drivers and their camels. The Corps supported British war operations in Sinai, Palestine, and Syria by transporting supplies to the troops.\n* The Somaliland Camel Corps was created by colonial authorities in British Somaliland in 1912; it was disbanded in 1944.\n* Bactrian camels were used by Romanian forces during World War II in the Caucasian region.\n* The Bikaner Camel Corps of British India fought alongside the British Indian Army in World Wars I and II.\n* The Tropas Nómadas (Nomad Troops) were an auxiliary regiment of Sahrawi tribesmen serving in the colonial army in Spanish Sahara (today Western Sahara). Operational from the 1930s until the end of the Spanish presence in the territory in 1975, the Tropas Nómadas were equipped with small arms and led by Spanish officers. The unit guarded outposts and sometimes conducted patrols on camelback.\n\nFood uses\n\nDairy\n\nCamel milk is a staple food of desert nomad tribes and is sometimes considered a meal itself; a nomad can live on only camel milk for almost a month. Camel milk is rich in vitamins, minerals, proteins, and immunoglobulins; compared to cow's milk, it is lower in fat and lactose, and higher in potassium, iron, and vitamin C. Bedouins believe the curative powers of camel milk are enhanced if the camel's diet consists of certain desert plants. Camel milk can readily be made into a drinkable yogurt, as well as butter or cheese, though the yields for cheese tend to be low.\n\nCamel milk cannot be made into butter by the traditional churning method. It can be made if it is soured first, churned, and a clarifying agent is then added. Until recently, camel milk could not be made into camel cheese because rennet was unable to coagulate the milk proteins to allow the collection of curds. Developing less wasteful uses of the milk, the FAO commissioned Professor J.P. Ramet of the École Nationale Supérieure d'Agronomie et des Industries Alimentaires, who was able to produce curdling by the addition of calcium phosphate and vegetable rennet. The cheese produced from this process has low levels of cholesterol and is easy to digest, even for the lactose intolerant. The sale of camel cheese is limited owing to the small output of the few dairies producing camel cheese and the absence of camel cheese in local (West African) markets. Cheese imports from countries that traditionally breed camels are difficult to obtain due to restrictions on dairy imports from these regions.\n\nAdditionally, camel milk has been made into ice cream in a Netherlands camel farm.\n\nMeat\n\nCamels are the ultimate pillars that support national economies of many developing countries, because they are useful for transport, and provide food in the form of meat and milk (Tariq et al.,2010).Tariq, M., Rabia, R., Jamil, A., Sakhwat, A., Aadil, A., & Muhammad S., 2010. Minerals and Nutritional Composition of Camel (Camelus Dromedarius) Meat in Pakistan. Journal- Chemical Society of Pakistan, Vol 33(6). A camel carcass can provide a substantial amount of meat. The male dromedary carcass can weigh 300 –, while the carcass of a male Bactrian can weigh up to 650 kg. The carcass of a female dromedary weighs less than the male, ranging between 250 and. The brisket, ribs and loin are among the preferred parts, and the hump is considered a delicacy. The hump contains \"white and sickly fat\", which can be used to make the khli (preserved meat) of mutton, beef, or camel. On the other hand, camel milk and meat are rich in protein, vitamins, glycogen, and other nutrients making them essential in the diet of many people. From chemical composition to meat quality, the dromedary camel is the preferred breed for meat production. It does well even in arid areas due to its unusual physiological behaviors and characteristics, which include tolerance to extreme temperatures, radiation from the sun, water paucity, rugged landscape and low vegetation (Aleme, 2013).Aleme, A., D., 2013. A Review of Camel Meat as a Precious Source of Nutrition in some part of Ethiopia. Agricultural Science, Engineering and Technology Research. Vol. 1, No. 4, December 2013, PP: 40–43. Available online at . Camel meat is reported to taste like coarse beef, but older camels can prove to be very tough, although camel meat becomes more tender the more it is cooked. The Abu Dhabi Officers' Club serves a camel burger mixed with beef or lamb fat in order to improve the texture and taste. In Karachi, Pakistan, some restaurants prepare nihari from camel meat. In Syria and Egypt, there are specialist camel butchers.[https://www.theguardian.com/lifeandstyle/wordofmouth/2013/apr/16/camel-meat-one-hump-two Anyone for camel meat? One hump or two?] The Guardian, Word of Mouth\n\nCamel meat has been eaten for centuries. It has been recorded by ancient Greek writers as an available dish at banquets in ancient Persia, usually roasted whole. The ancient Roman emperor Heliogabalus enjoyed camel's heel. Camel meat is still eaten in certain regions, including Eritrea, Somalia, Djibouti, Saudi Arabia, Egypt, Syria, Libya, Sudan, Ethiopia, Kazakhstan, and other arid regions where alternative forms of protein may be limited or where camel meat has had a long cultural history. Camel blood is also consumable, as is the case among pastoralists in northern Kenya, where camel blood is drunk with milk and acts as a key source of iron, vitamin D, salts and minerals. Camel meat is also occasionally found in Australian cuisine: for example, a camel lasagna is available in Alice Springs.\n\nA 2005 report issued jointly by the Saudi Ministry of Health and the United States Centers for Disease Control and Prevention details cases of human bubonic plague resulting from the ingestion of raw camel liver.\n\nReligion\n\nIslam\n\nCamel meat is halal (, 'allowed') for Muslims. However, according to some Islamic schools of thought, a state of impurity is brought on by the consumption of it. Consequently, these schools hold that Muslims must perform wudhu (ablution) before the next time they pray after eating camel meat. Also, some Islamic schools of thought consider it haram (, 'forbidden') for a Muslim to perform Salat in places where camels lie, as it is said to be a dwelling place of the Shaytan (, 'Devil'). According to Abu Yusuf, the urine of camel may be used for medical treatment if necessary, but according to Abū Ḥanīfah, the drinking of camel urine is discouraged.\n\nThe Islamic texts contain several stories featuring camels. In the story of the people of Thamud, the Prophet Salih miraculously brings forth a naqat (, 'she-camel') out of a rock. After the Prophet Muhammad migrated from Mecca to Medina, he allowed his she-camel to roam there; the location where the camel stopped to rest determined the location where he would build his house in Medina.Campo, Juan Eduardo (2009). Encyclopedia of Islam. Infobase Publishing. p. 128.\n\nJudaism\n\n   \nAccording to Jewish tradition, camel meat and milk are not kosher. Camels possess only one of the two kosher criteria; although they chew their cud, they do not possess cloven hooves:\n\n\"But these you shall not eat among those that bring up the cud and those that have a cloven hoof: the camel, because it brings up its cud, but does not have a [completely] cloven hoof; it is unclean for you.\"http://www.chabad.org/library/bible_cdo/aid/9912#v=41 \n\nDepictions in culture\n\nFile:Bowl Depicting Bahram Gur and Azada, late 12th-early 13th century 86.227.11.jpg|Bowl depicting Bahram Gur and Azada, c. early 13th century, Brooklyn Museum\nFile:Vessel in the Form of a Recumbent Camel with Jugs, 2015.65.15.jpg|Vessel in the form of a recumbent camel with jugs, 250 BC–224 AD,  Brooklyn Museum\nFile:Brooklyn Museum - Maru Ragini (Dhola and Maru riding on a Camel).jpg|Maru Ragini (Dhola and Maru riding on a camel), c. 1750,  Brooklyn Museum\nFile:Brooklyn Museum - The Magi Journeying (Les rois mages en voyage) - James Tissot - overall.jpg|The Magi journeying (Les rois mages en voyage) - James Tissot, c. 1886, Brooklyn Museum\n\nDistribution and numbers\n\nThere are around 14 million camels alive , with 90% being dromedaries. Dromedaries alive today are domesticated animals (mostly living in the Horn of Africa, the Sahel, Maghreb, Middle East and South Asia). The Horn region alone has the largest concentration of camels in the world, where the dromedaries constitute an important part of local nomadic life. They provide nomadic people in Somalia (which has the largest camel herd in the world) and Ethiopia with milk, food, and transportation. [http://www.mbali.info/doc265.htm Plain text version.] \n\nThe Bactrian camel is, , reduced to an estimated 1.4 million animals, most of which are domesticated. The only truly wild (as opposed to feral) camel is the wild Bactrian camel, which number approximately 1400, which inhabits the Gobi and Taklamakan Deserts in China and Mongolia.\n\nThe largest population of feral camels is in Australia. There are around 700,000 feral dromedary camels in central parts of Australia, descended from those introduced as a method of transport in the 19th and early 20th centuries. This population is growing about 8% per year. Representatives of the Australian government have culled more than 100,000 of the animals in part because the camels use too much of the limited resources needed by sheep farmers.\n\nA small population of introduced camels, dromedaries and Bactrians, wandered through Southwestern United States after having been imported in the 19th century as part of the U.S. Camel Corps experiment. When the project ended, they were used as draft animals in mines and escaped or were released. Twenty-five U.S. camels were bought and imported to Canada during the Cariboo Gold Rush. Camel. http://en.wikipedia.org/?curid=6598."
  }
}
