{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19514",
  "eid" : "3b52ab50-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778608773,
  "textBody" : "Events\n\n*1527 – Spanish and German troops sack Rome; some consider this the end of the Renaissance. 147 Swiss Guards, including their commander, die fighting the forces of Charles V in order to allow Pope Clement VII to escape into Castel Sant'Angelo.\n*1536 – The Siege of Cuzco commences, in which Incan forces attempt to retake the city of Cuzco from the Spanish.\n*  1536   – King Henry VIII orders English-language Bibles be placed in every church. In 1539 the Great Bible would be provided for this purpose.\n*1542 – Francis Xavier reaches Old Goa, the capital of Portuguese India at the time.\n*1659 – English Restoration: A faction of the British Army removes Richard Cromwell as Lord Protector of the Commonwealth and reinstalls the Rump Parliament.\n*1682 – Louis XIV of France moves his court to the Palace of Versailles.\n*1757 – Battle of Prague: A Prussian army fights an Austrian army in Prague during the Seven Years' War.\n*  1757   – The end of Konbaung–Hanthawaddy War, and the end of Burmese Civil War (1740–1757).\n*  1757   – English poet Christopher Smart is admitted into St Luke's Hospital for Lunatics in London, beginning his six-year confinement to mental asylums.\n*1782 – Construction begins on the Grand Palace, the royal residence of the King of Siam in Bangkok, at the command of King Buddha Yodfa Chulaloke.\n*1801 – Captain Thomas Cochrane in the 14-gun  captures the 32-gun Spanish frigate El Gamo.\n*1835 – James Gordon Bennett, Sr. publishes the first issue of the New York Herald.\n*1840 – The Penny Black postage stamp becomes valid for use in the United Kingdom of Great Britain and Ireland\n*1857 – The British East India Company disbands the 34th Regiment of Bengal Native Infantry whose sepoy Mangal Pandey had earlier revolted against the British and is considered to be the First Martyr in the War of Indian Independence.\n*1861 – American Civil War: Arkansas secedes from the Union.\n*1863 – American Civil War: The Battle of Chancellorsville ends with the defeat of the Army of the Potomac by Confederate troops.\n*1877 – Chief Crazy Horse of the Oglala Lakota surrenders to United States troops in Nebraska.\n*1882 – Thomas Henry Burke and Lord Frederick Cavendish are stabbed to death by Fenian assassins in Phoenix Park, Dublin.\n*  1882   – The United States Congress passes the Chinese Exclusion Act.\n*1889 – The Eiffel Tower is officially opened to the public at the Universal Exposition in Paris.\n*1902 – Macario Sakay establishes the Tagalog Republic with himself as President.\n*1906 – The Russian Constitution of 1906 is adopted (on April 23rd by the Julian calendar).\n*1910 – George V becomes King of the United Kingdom upon the death of his father, Edward VII.\n*1915 – Babe Ruth, then a pitcher for the Boston Red Sox, hits his first major league home run.\n*1916 – Twenty-one Lebanese nationalists are executed in Martyrs' Square, Beirut by Djemal Pasha.\n*  1916   – Vietnamese Emperor Duy Tân is captured while attempting to call upon the people to rise up against the French, and later being deposed and exiled to Réunion island.\n*1933 – The Deutsche Studentenschaft attacked Magnus Hirschfeld's Institut für Sexualwissenschaft, later burning many of its books.\n*1935 – New Deal: Executive Order 7034 creates the Works Progress Administration.\n*1937 – Hindenburg disaster: The German zeppelin Hindenburg catches fire and is destroyed within a minute while attempting to dock at Lakehurst, New Jersey. Thirty-six people are killed.\n*1940 – John Steinbeck is awarded the Pulitzer Prize for his novel The Grapes of Wrath.\n*1941 – At California's March Field, Bob Hope performs his first USO show.\n*  1941   – The first flight of the Republic P-47 Thunderbolt.\n*1942 – World War II: On Corregidor, the last American forces in the Philippines surrender to the Japanese.\n*1945 – World War II: Axis Sally delivers her last propaganda broadcast to Allied troops.\n*  1945   – World War II: The Prague Offensive, the last major battle of the Eastern Front, begins.\n*1949 – EDSAC, the first practical electronic digital stored-program computer, runs its first operation.\n*1954 – Roger Bannister becomes the first person to run the mile in under four minutes.\n*1960 – More than 20 million viewers watch the first televised royal wedding when Princess Margaret marries Anthony Armstrong-Jones at Westminster Abbey.\n*1966 – Myra Hindley and Ian Brady are sentenced to life imprisonment for the Moors murders in England.\n*1972 – Deniz Gezmiş, Yusuf Aslan and Hüseyin İnan are executed in Ankara after being convicted of attempting to overthrow the Constitutional order.\n*1975 – During a lull in fighting, 100,000 Armenians gather in Beirut to commemorate 60th anniversary of the Armenian Genocide.\n*1976 – The 6.5  Friuli earthquake affected Northern Italy with a maximum Mercalli intensity of X (Extreme), leaving 900–978 dead and 1,700–2,400 injured.\n*1983 – The Hitler Diaries are revealed as a hoax after being examined by experts.\n*1984 – 103 Korean Martyrs are canonized by Pope John Paul II in Seoul.\n*1994 – Queen Elizabeth II of the United Kingdom and French President François Mitterrand officiate at the opening of the Channel Tunnel.\n*1996 – The body of former CIA director William Colby is found washed up on a riverbank in southern Maryland, eight days after he disappeared.\n*1997 – The Bank of England is given independence from political control, the most significant change in the bank's 300-year history.\n*1998 – Kerry Wood strikes out 20 Houston Astros to tie the major league record held by Roger Clemens. He threw a one-hitter and did not walk a batter in his fifth career start.\n*1999 – The first elections to the devolved Scottish Parliament and Welsh Assembly are held.\n*2001 – During a trip to Syria, Pope John Paul II becomes the first pope to enter a mosque.\n*2002 – Dutch politician Pim Fortuyn is assassinated following a radio-interview at the Mediapark in Hilversum.\n*2010 – In just 36 minutes DOW Jones plunged nearly a 1000 points in what is known as the 2010 Flash Crash.\n*2013 – Three women missing for more than a decade are found alive in the U.S. city of Cleveland, Ohio.\n\nBirths\n\n* 973 – Henry II, Holy Roman Emperor (d. 1024)\n*1405 – George Kastrioti, better known as Skanderbeg, Albanian national hero (d. 1468)\n*1464 – Sophia Jagiellon, Margravine of Brandenburg-Ansbach, Polish princess (d. 1512)\n*1493 – Girolamo Seripando, Italian theologian and cardinal (d. 1563)\n*1501 – Marcellus II, pope of the Catholic Church (d. 1555)\n*1574 – Innocent X, pope of the Catholic Church (d. 1655)\n*1580 – Charles Gonzaga, Duke of Mantua and Montferrat, French noble (d. 1637)\n*1635 – Johann Joachim Becher, German physician and alchemist (d. 1682)\n*1668 – Alain-René Lesage, French author and playwright (d. 1747)\n*1680 – Jean-Baptiste Stuck, Italian-French cellist and composer (d. 1755)\n*1713 – Charles Batteux, French philosopher and academic (d. 1780)\n*1714 – Anton Raaff, German tenor (d. 1797)\n*1742 – Jean Senebier, Swiss pastor and physiologist (d. 1809)\n*1758 – André Masséna, French general (d. 1817)\n*  1758   – Maximilien Robespierre, French lawyer and politician (d. 1794)\n*1769 – Ferdinand III, Grand Duke of Tuscany (d. 1824)\n*  1769   – Jean Nicolas Pierre Hachette, French mathematician and academic (d. 1834)\n*1781 – Karl Christian Friedrich Krause, German philosopher and author (d. 1832)\n*1797 – Joseph Brackett, American religious leader and composer (d. 1882)\n*1800 – Roman Sanguszko, Polish general (d. 1881)\n*1827 – Hermann Raster, German-American journalist and politician (d. 1891)\n*1836 – Max Eyth, German engineer and author (d. 1906)\n*1843 – Grove Karl Gilbert, American geologist and academic (d. 1918)\n*1848 – Henry Edward Armstrong, English chemist and academic (d. 1937)\n*1851 – Aristide Bruant, French singer and actor (d. 1925)\n*1856 – Sigmund Freud, Austrian neurologist and psychoanalyst (d. 1939)\n*  1856   – Robert Peary, American admiral and explorer (d. 1920)\n*1861 – Motilal Nehru, Indian lawyer and politician, President of the Indian National Congress (d. 1931)\n*1868 – Gaston Leroux, French journalist and author (d. 1927)\n*1869 – Junnosuke Inoue, Japanese businessman and central banker, 8th and 11th Governor of the Bank of Japan (d. 1932)\n*1870 – Walter Rutherford, Scottish golfer (d. 1936)\n*1871 – Victor Grignard, French chemist and academic, Nobel Prize laureate (d. 1935)\n*  1871   – Christian Morgenstern, German author and poet (d. 1914)\n*1872 – Willem de Sitter, Dutch mathematician, physicist, and astronomer (d. 1934)\n*  1872   – Djemal Pasha, Ottoman general (d. 1922)\n*1879 – Bedřich Hrozný, Czech orientalist and linguist (d. 1952)\n*  1879   – Hendrik van Heuckelum, Dutch footballer (d. 1929)\n*1880 – Winifred Brunton, English-South African painter and illustrator (d. 1959)\n*  1880   – Ernst Ludwig Kirchner, German-Swiss painter (d. 1938)\n*1883 – Alberto Collo, Italian actor (d. 1955) \n*1895 – Júlio César de Mello e Souza, Brazilian mathematician and author (d. 1974)\n*  1895   – Fidél Pálffy, Hungarian soldier and politician, Hungarian Minister of Agriculture (d. 1946)\n*  1895   – Rudolph Valentino, Italian actor (d. 1926)\n*1896 – Rolf Maximilian Sievert, Swedish physicist and academic (d. 1966)\n*1897 – Paul Alverdes, German author and poet (d. 1979)\n*1898 – Konrad Henlein, Czech soldier and politician (d. 1945)\n*1902 – Harry Golden, Ukrainian-American journalist and author (d. 1981)\n*  1902   – Max Ophüls, German-American director and screenwriter (d. 1957)\n*1903 – Toots Shor, American businessman, founded Toots Shor's Restaurant (d. 1977)\n*1904 – Moshé Feldenkrais, Ukrainian-Israeli physicist and academic (d. 1984)\n*  1904   – Catherine Lacey, English actress (d. 1979)\n*  1904   – Harry Martinson, Swedish novelist, essayist, and poet Nobel Prize laureate (d. 1978)\n*1905 – Philip N. Krasne, American lawyer and producer (d. 1999)\n*1906 – André Weil, French mathematician and academic (d. 1998)\n*1907 – Weeb Ewbank, American football player and coach (d. 1998)\n*1911 – Guy des Cars, French journalist and author (d. 1993)\n*1913 – Carmen Cavallaro, American pianist (d. 1989)\n*  1913   – Stewart Granger, English-American actor (d. 1993)\n*1915 – Orson Welles, American actor, director, producer, and screenwriter (d. 1985)\n*  1915   – Theodore H. White, American historian, journalist, and author (d. 1986)\n*1916 – Robert H. Dicke, American physicist and astronomer (d. 1997)\n*1917 – Kal Mann, American songwriter (d. 2001)\n*1918 – Zayed bin Sultan Al Nahyan, emir of Abu Dhabi and first president of the United Arab Emirates (d. 2004)\n*1919 – André Guelfi, French race car driver (d. 2016)\n*1920 – Ross Hunter, American actor and producer (d. 1996)\n*  1920   – Kamisese Mara, Fijian politician, 1st Prime Minister of Fiji (d. 2004)\n*  1920   – Marguerite Piazza, American soprano and actress (d. 2012)\n*1921 – Erich Fried, Austrian-German author, poet, and translator (d. 1988)\n*1922 – Camille Laurin, Canadian psychiatrist and politician, 7th Deputy Premier of Quebec (d. 1999)\n*1923 – Harry Watson, Canadian ice hockey player and coach (d. 2002)\n*1924 – Nestor Basterretxea, Spanish painter and sculptor (d. 2014)\n*  1924   – Patricia Kennedy Lawford, American socialite, activist, and author (d. 2006)\n*  1924   – Denny Wright, English guitarist, composer, and producer (d. 1992)\n*1926 – Gilles Grégoire, Canadian politician, co-founded the Parti Québécois (d. 2006)\n*1929 – Rosemary Cramp, English archaeologist and academic\n*  1929   – Paul Lauterbur, American chemist and biophysicist, Nobel Prize laureate (d. 2007)\n*  1929   – John Taylor, English bishop and theologian (d. 2016)\n*1930 – Sonia Rykiel, French fashion designer (d. 2016)\n*1931 – Willie Mays, American baseball player and coach\n*1932 – Ahmet Haxhiu, Kosovan activist (d. 1994)\n*  1932   – Alexander Thynn, 7th Marquess of Bath, English lieutenant and politician\n*1934 – Richard Shelby, American lawyer and politician\n*1937 – Rubin Carter, American-Canadian boxer (d. 2014)\n*1938 – Jean Garon, Canadian economist, lawyer, and politician (d. 2014)\n*1939 – Eddie C. Campbell, American singer and guitarist\n*  1939   – Chet Allen, American child actor (d. 1984)\n*1942 – Ariel Dorfman, Argentinian author, playwright, and academic\n*1943 – Andreas Baader, German terrorist, co-founded the Red Army Faction (d. 1977)\n*  1943   – Milton William Cooper, American theorist and author (d. 2001)\n*  1943   – Wolfgang Reinhardt, German pole vaulter (d. 2011)\n*  1943   – James Turrell, American sculptor and illustrator\n*1944 – Anton Furst, English-American production designer and art director (d. 1991)\n*  1944   – Masanori Murakami, Japanese baseball player and coach \n*1945 – Jimmie Dale Gilmore, American country singer-songwriter, guitarist, actor, and producer\n*  1945   – Bob Seger, American singer-songwriter and guitarist\n*1947 – Alan Dale, New Zealand actor\n*  1947   – Martha Nussbaum, American philosopher and author\n*  1947   – Ljubomir Vračarević, Serbian martial artist, founded Real Aikido (d. 2013)\n*1948 – Frankie Librán, Puerto Rican-American baseball player (d. 2013)\n*1950 – Jeffery Deaver, American journalist and author\n*1951 – Samuel Doe, Liberian sergeant and politician, 21st President of Liberia (d. 1990)\n*  1952   – Gerrit Zalm, Dutch economist and politician, Deputy Prime Minister of the Netherlands\n*1953 – Alexander Akimov, Ukrainian Chernobyl worker (d. 1986) \n*  1953   – Tony Blair, British politician, Prime Minister of the United Kingdom\n*  1953   – Michelle Courchesne, Canadian urban planner and politician, Deputy Premier of Quebec\n*  1953   – Ülle Rajasalu, Estonian politician\n*  1953   – Graeme Souness, Scottish footballer and manager\n*  1953   – Lynn Whitfield, American actress and producer\n*1954 – Tom Abernethy, American basketball player\n*  1954   – Dora Bakoyannis, Greek politician, 120th Greek Minister for Foreign Affairs\n*  1954   – Angela Hernández Nuñez, Dominican author and poet\n*  1954   – Ain Lutsepp, Estonian actor and politician  \n*1955 – Nicholas Alexander, 7th Earl of Caledon, English politician, Lord Lieutenant of Armagh\n*  1955   – Tom Bergeron, American television host\n*  1955   – John Hutton, Baron Hutton of Furness, English academic and politician, Secretary of State for Defence\n*1956 – Lakis Lazopoulos, Greek actor and screenwriter\n*  1956   – Roland Wieser, German race walker and coach\n*1958 – Randall Stout, American architect, designed the Taubman Museum of Art (d. 2014)\n*1959 – Andreas Busse, German runner\n*  1959   – Charles Hendry, English politician\n*1960 – Lyudmila Andonova, Bulgarian high jumper\n*  1960   – Keith Dowding, English political scientist, philosopher, and academic\n*  1960   – Roma Downey, Irish-American actress and producer\n*  1960   – John Flansburgh, American singer-songwriter and guitarist \n*  1960   – Aleksei Lotman, Estonian biologist and politician\n*  1960   – Anne Parillaud, French actress\n*1961 – Oleksandr Apaychev, Ukrainian decathlete and coach\n*  1961   – George Clooney, American actor, director, producer, and screenwriter\n*  1961   – Tom Hunter, Scottish businessman and philanthropist\n*  1961   – Gina Riley, Australian actress, producer, and screenwriter\n*  1961   – Frans Timmermans, Dutch politician and diplomat, First Vice President of the European Commission\n*1962 – Tom Brake, English politician\n*  1962   – Brad Izzard, Australian rugby league player\n*1963 – Alessandra Ferri, Italian ballerina\n*1965 – Leslie Hope, Canadian actress, director, producer, and screenwriter\n*1968 – Worku Bikila, Ethiopian runner\n*  1968   – Lætitia Sadier, French singer and keyboard player \n*1969 – Jim Magilton, Northern Irish footballer and manager\n*1970 – Roland Kun, Nauruan politician\n*1971 – Chris Shiflett, American singer-songwriter and guitarist \n*1972 – Martin Brodeur, Canadian ice hockey player\n*  1972   – Naoko Takahashi, Japanese runner\n*1974 – Bernard Barmasai, Kenyan runner\n*  1974   – Daniela Bártová, Czech pole vaulter and gymnast\n*1975 – Alan Richardson, English cricketer and coach\n*1976 – Dean Chandler, English footballer\n*  1976   – Iván de la Peña, Spanish footballer \n*1977 – Christophe Brandt, Belgian cyclist\n*  1977   – Marc Chouinard, Canadian ice hockey player\n*  1977   – Mark Eaton, American ice hockey player and coach\n*  1977   – Chantelle Newbery, Australian diver\n*1978 – John Abraham, American football player\n*  1978   – Fredrick Federley, Swedish journalist and politician\n*  1978   – Aleksandr Fyodorov, Russian bodybuilder\n*1979 – Gerd Kanter, Estonian discus thrower\n*  1979   – Jan Erik Mikalsen, Norwegian composer\n*1980 – Brooke Bennett, American swimmer\n*  1980   – Dimitris Diamantidis, Greek professional basketball player\n*  1980   – Ricardo Oliveira, Brazilian footballer\n*  1980   – Matthew Whiley, English cricketer \n*1982   – Jason Witten, American Footballer\n*1983 – Dani Alves, Brazilian footballer\n*  1983   – Ingrid Jonach, Australian author\n*  1983   – Gabourey Sidibe, American actress\n*  1983   – Trinley Thaye Dorje, Tibetan religious leader, the 17th Karmapa Lama\n*  1983   – Fredrik Sjöström, Swedish ice hockey player\n*1984 – Anton Babchuk, Ukrainian ice hockey player\n*  1984   – Juan Pablo Carrizo, Argentinian footballer\n*1985 – Chris Paul, American basketball player\n*1986 – Goran Dragic, Slovenian basketball player\n*1987 – Dries Mertens, Belgian footballer \n*  1987   – Adrienne Warren, American actress\n*1989 – Dominika Cibulková, Slovakian tennis player\n*  1989   – Jesse Hughes, Canadian DJ and producer\n*1990 – José Altuve, Venezuelan baseball player\n*1992 – Brendan Gallagher, Canadian ice hockey player\n*  1992   – Byun Baekhyun, South Korean musician and actor, member of boy band EXO\n*1993 – Gustavo Gómez, Paraguayan footballer\n*1994 – Mateo Kovačić, Austrian-Croatian footballer\n\nDeaths\n\n* 698 – Eadberht, bishop of Lindisfarne\n* 850 – Ninmyō, Japanese emperor (b. 808)\n* 932 – Qian Liu, Chinese warlord and king (b. 852)\n*1002 – Ealdwulf, Archbishop of York, Abbot of Peterborough and Bishop of Worcester \n*1187 – Ruben III, Prince of Armenia (b. 1145)\n*1236 – Roger of Wendover, Benedictine monk and chronicler\n*1471 – Edmund Beaufort, English commander (b. 1438)\n*1471 – Thomas Tresham, Speaker of the House of Commons\n*1475 – Dieric Bouts, Flemish painter (b. 1415)\n*1483 – Queen Jeonghui, Korean regent (b. 1418)\n*1502 – James Tyrrell, English knight (b. 1450)\n*1527 – Charles III, Duke of Bourbon, Count of Montpensier and Dauphin of Auvergne (b.1490)\n*1540 – Juan Luís Vives, Spanish scholar (b. 1492)\n*1596 – Giaches de Wert, Flemish-Italian composer (b. 1535)\n*1631 – Sir Robert Cotton, 1st Baronet, of Connington, English historian and politician, founded the Cotton library (b. 1570)\n*1638 – Cornelius Jansen, Dutch-French bishop and theologian (b. 1585)\n*1708 – François de Laval, French-Canadian bishop (b. 1623)\n*1757 – Charles FitzRoy, 2nd Duke of Grafton, English politician, Lord Lieutenant of Ireland (b. 1683)\n*  1757   – Kurt Christoph Graf von Schwerin, Prussian field marshal (b. 1684)\n*1782 – Christine Kirch, German astronomer and academic (b. 1696)\n*1840 – Francisco de Paula Santander, Colombian general and politician, 4th President of the Republic of the New Granada (b. 1792)\n*1859 – Alexander von Humboldt, German geographer and explorer (b. 1769)\n*1862 – Henry David Thoreau, American essayist, poet, and philosopher (b. 1817)\n*1877 – Johan Ludvig Runeberg, Swedish-Finnish poet and hymn-writer (b. 1804)\n*1882 – Thomas Henry Burke, Irish civil servant (b. 1829)\n*  1882   – Lord Frederick Cavendish, British politician, Chief Secretary for Ireland (b. 1836)\n*1902 – Bret Harte, American author and poet (b. 1836)\n*1905 – Robert Herbert, English-Australian politician, 1st Premier of Queensland (b. 1831)\n*1907 – Emanuele Luigi Galizia, Maltese architect and civil engineer (b. 1830)\n*1910 – Edward VII of the United Kingdom (b. 1841)\n*1919 – L. Frank Baum,  American novelist (b. 1856)\n*1939 – Konstantin Somov, Russian-French painter and illustrator (b. 1869)\n*1949 – Maurice Maeterlinck, Belgian-French poet and playwright, Nobel Prize laureate (b. 1862)\n*1951 – Élie Cartan, French mathematician and physicist (b. 1869)\n*1952 – Maria Montessori, Italian-Dutch physician and educator (b. 1870)\n*1959 – Maria Dulęba, Polish actress (b. 1881)\n*  1959   – Ragnar Nurkse, Estonian-American economist and academic (b. 1907)\n*1961 – Lucian Blaga, Romanian poet, playwright, and philosopher (b. 1895)\n*1963 – Theodore von Kármán, Hungarian-American mathematician, physicist, and engineer (b. 1881)\n*  1963   – Ted Weems, American violinist, trombonist, and bandleader (b. 1901)\n*  1963   – Monty Woolley, American raconteur, actor, and  director (b. 1888)\n*1967 – Zhou Zuoren, Chinese author and translator (b. 1885)\n*1970 – Alexander Rodzyanko, Russian general (b. 1879)\n*1973 – Ernest MacMillan, Canadian conductor and composer (b. 1893)\n*1975 – József Mindszenty, Hungarian cardinal (b. 1892)\n*1980 – María Luisa Bombal, Chilean writer (b. 1910)\n*1983 – Ezra Jack Keats, American author and illustrator (b. 1916)\n*  1983   – Kai Winding, Danish-American trombonist and composer (b. 1922)\n*1984 – Mary Cain, American journalist and politician (b. 1904)\n*  1984   – Bonner Pink, English politician (b. 1912)\n*1987 – William J. Casey, American politician, 13th Director of Central Intelligence (b. 1913)\n*1989 – Earl Blaik, American football player and coach (b. 1897)\n*1990 – Charles Farrell, American actor (b. 1901)\n*1991 – Wilfrid Hyde-White, English actor (b. 1903)\n*1992 – Marlene Dietrich, German-American actress and singer (b. 1901)\n*1995 – Noel Brotherston, Northern Irish footballer (b. 1956)\n*2000 – Gordon McClymont, Australian ecologist and academic (b. 1920)\n*2002 – Murray Adaskin, Canadian violinist, composer, conductor, and educator (b. 1906)\n*  2002   – Otis Blackwell, American singer-songwriter and pianist (b. 1932)\n*  2002   – Pim Fortuyn, Dutch sociologist, academic, and politician (b. 1948)\n*  2002   – Bjørn Johansen, Norwegian saxophonist (b. 1940)\n*2003 – Art Houtteman, American baseball player and journalist (b. 1927)\n*2004 – Virginia Capers, American actress and singer (b. 1925)\n*  2004   – Philip Kapleau, American monk and educator (b. 1912)\n*  2004   – Barney Kessel, American guitarist and composer (b. 1923)\n*2006 – Grant McLennan, Australian singer-songwriter and guitarist (b. 1958)\n*  2006   – Lorne Saxberg, Canadian journalist (b. 1958)\n*2007 – Enéas Carneiro, Brazilian physician and politician (b. 1938)\n*  2007   – Curtis Harrington, American actor, director, and screenwriter (b. 1926)\n*2009 – Kevin Grubb, American race car driver (b. 1978)\n*2010 – Robin Roberts, American baseball player, coach, and sportscaster (b. 1926)\n*2012 – James R. Browning, American lieutenant, lawyer, and judge (b. 1918)\n*  2012   – James Isaac, American director and producer (b. 1960)\n*  2012   – Jean Laplanche, French psychoanalyst and author (b. 1924)\n*2013 – Giulio Andreotti, Italian journalist and politician, 41st Prime Minister of Italy (b. 1919)\n*  2013   – Severo Aparicio Quispe, Peruvian bishop (b. 1923)\n*  2013   – Michelangelo Spensieri, Italian-Canadian lawyer and politician (b. 1949)\n*2014 – Wil Albeda, Dutch economist and politician, Dutch Minister of Social Affairs (b. 1925)\n*  2014   – William H. Dana, American pilot, engineer, and astronaut (b. 1930)\n*  2014   – Jimmy Ellis, American boxer (b. 1940)\n*  2014   – Billy Harrell, American baseball player and scout (b. 1928)\n*  2014   – Antony Hopkins, English pianist, composer, and conductor (b. 1921)\n*  2014   – Maria Lassnig, Austrian painter and academic (b. 1919)\n*  2014   – Farley Mowat, Canadian environmentalist and author (b. 1921)\n*2015 – Novera Ahmed, Bangladeshi sculptor (b. 1930)\n*  2015   – Denise McCluggage, American race car driver and journalist (b. 1927)\n*  2015   – Jim Wright, American soldier, lawyer, and politician, 56th Speaker of the United States House of Representatives (b. 1922)\n*2016 – Patrick Ekeng, Cameroonian footballer (b. 1990)\n*  2016   – Reg Grundy, Australian businessman (b. 1923)\n\nHolidays and observances\n\n*Christian Feast Day:\n**Dominic Savio\n**Evodius of Antioch (Roman Catholic Church)\n**François de Laval\n**Gerard of Lunel\n**Lucius of Cyrene\n**Petronax of Monte Cassino\n**St George's Day related observances (Eastern Orthodox Church):\n***Day of Bravery, also known as Gergyovden (Bulgaria)\n***Đurđevdan (Gorani, Roma)\n***Police Day (Georgia)\n***Yuri's Day in the Spring (Russian Orthodox Church)\n**St John before the Latin Gate\n**May 6 (Eastern Orthodox liturgics)\n*Earliest day on which Military Spouse Day can fall, while May 12 is the latest; celebrated on Friday before Mother's Day (United States)\n*International No Diet Day\n*Martyrs' Day (Gabon)\n*Martyrs' Day (Lebanon and Syria)\n*Teachers' Day (Jamaica)\n*The first day of Hıdırellez (Turkey)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "May 6" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19514" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*1527 – Spanish and German troops sack Rome; some consider this the end of the Renaissance. 147 Swiss Guards, including their commander, die fighting the forces of Charles V in order to allow Pope Clement VII to escape into Castel Sant'Angelo.\n*1536 – The Siege of Cuzco commences, in which Incan forces attempt to retake the city of Cuzco from the Spanish.\n*  1536   – King Henry VIII orders English-language Bibles be placed in every church. In 1539 the Great Bible would be provided for this purpose.\n*1542 – Francis Xavier reaches Old Goa, the capital of Portuguese India at the time.\n*1659 – English Restoration: A faction of the British Army removes Richard Cromwell as Lord Protector of the Commonwealth and reinstalls the Rump Parliament.\n*1682 – Louis XIV of France moves his court to the Palace of Versailles.\n*1757 – Battle of Prague: A Prussian army fights an Austrian army in Prague during the Seven Years' War.\n*  1757   – The end of Konbaung–Hanthawaddy War, and the end of Burmese Civil War (1740–1757).\n*  1757   – English poet Christopher Smart is admitted into St Luke's Hospital for Lunatics in London, beginning his six-year confinement to mental asylums.\n*1782 – Construction begins on the Grand Palace, the royal residence of the King of Siam in Bangkok, at the command of King Buddha Yodfa Chulaloke.\n*1801 – Captain Thomas Cochrane in the 14-gun  captures the 32-gun Spanish frigate El Gamo.\n*1835 – James Gordon Bennett, Sr. publishes the first issue of the New York Herald.\n*1840 – The Penny Black postage stamp becomes valid for use in the United Kingdom of Great Britain and Ireland\n*1857 – The British East India Company disbands the 34th Regiment of Bengal Native Infantry whose sepoy Mangal Pandey had earlier revolted against the British and is considered to be the First Martyr in the War of Indian Independence.\n*1861 – American Civil War: Arkansas secedes from the Union.\n*1863 – American Civil War: The Battle of Chancellorsville ends with the defeat of the Army of the Potomac by Confederate troops.\n*1877 – Chief Crazy Horse of the Oglala Lakota surrenders to United States troops in Nebraska.\n*1882 – Thomas Henry Burke and Lord Frederick Cavendish are stabbed to death by Fenian assassins in Phoenix Park, Dublin.\n*  1882   – The United States Congress passes the Chinese Exclusion Act.\n*1889 – The Eiffel Tower is officially opened to the public at the Universal Exposition in Paris.\n*1902 – Macario Sakay establishes the Tagalog Republic with himself as President.\n*1906 – The Russian Constitution of 1906 is adopted (on April 23rd by the Julian calendar).\n*1910 – George V becomes King of the United Kingdom upon the death of his father, Edward VII.\n*1915 – Babe Ruth, then a pitcher for the Boston Red Sox, hits his first major league home run.\n*1916 – Twenty-one Lebanese nationalists are executed in Martyrs' Square, Beirut by Djemal Pasha.\n*  1916   – Vietnamese Emperor Duy Tân is captured while attempting to call upon the people to rise up against the French, and later being deposed and exiled to Réunion island.\n*1933 – The Deutsche Studentenschaft attacked Magnus Hirschfeld's Institut für Sexualwissenschaft, later burning many of its books.\n*1935 – New Deal: Executive Order 7034 creates the Works Progress Administration.\n*1937 – Hindenburg disaster: The German zeppelin Hindenburg catches fire and is destroyed within a minute while attempting to dock at Lakehurst, New Jersey. Thirty-six people are killed.\n*1940 – John Steinbeck is awarded the Pulitzer Prize for his novel The Grapes of Wrath.\n*1941 – At California's March Field, Bob Hope performs his first USO show.\n*  1941   – The first flight of the Republic P-47 Thunderbolt.\n*1942 – World War II: On Corregidor, the last American forces in the Philippines surrender to the Japanese.\n*1945 – World War II: Axis Sally delivers her last propaganda broadcast to Allied troops.\n*  1945   – World War II: The Prague Offensive, the last major battle of the Eastern Front, begins.\n*1949 – EDSAC, the first practical electronic digital stored-program computer, runs its first operation.\n*1954 – Roger Bannister becomes the first person to run the mile in under four minutes.\n*1960 – More than 20 million viewers watch the first televised royal wedding when Princess Margaret marries Anthony Armstrong-Jones at Westminster Abbey.\n*1966 – Myra Hindley and Ian Brady are sentenced to life imprisonment for the Moors murders in England.\n*1972 – Deniz Gezmiş, Yusuf Aslan and Hüseyin İnan are executed in Ankara after being convicted of attempting to overthrow the Constitutional order.\n*1975 – During a lull in fighting, 100,000 Armenians gather in Beirut to commemorate 60th anniversary of the Armenian Genocide.\n*1976 – The 6.5  Friuli earthquake affected Northern Italy with a maximum Mercalli intensity of X (Extreme), leaving 900–978 dead and 1,700–2,400 injured.\n*1983 – The Hitler Diaries are revealed as a hoax after being examined by experts.\n*1984 – 103 Korean Martyrs are canonized by Pope John Paul II in Seoul.\n*1994 – Queen Elizabeth II of the United Kingdom and French President François Mitterrand officiate at the opening of the Channel Tunnel.\n*1996 – The body of former CIA director William Colby is found washed up on a riverbank in southern Maryland, eight days after he disappeared.\n*1997 – The Bank of England is given independence from political control, the most significant change in the bank's 300-year history.\n*1998 – Kerry Wood strikes out 20 Houston Astros to tie the major league record held by Roger Clemens. He threw a one-hitter and did not walk a batter in his fifth career start.\n*1999 – The first elections to the devolved Scottish Parliament and Welsh Assembly are held.\n*2001 – During a trip to Syria, Pope John Paul II becomes the first pope to enter a mosque.\n*2002 – Dutch politician Pim Fortuyn is assassinated following a radio-interview at the Mediapark in Hilversum.\n*2010 – In just 36 minutes DOW Jones plunged nearly a 1000 points in what is known as the 2010 Flash Crash.\n*2013 – Three women missing for more than a decade are found alive in the U.S. city of Cleveland, Ohio.\n\nBirths\n\n* 973 – Henry II, Holy Roman Emperor (d. 1024)\n*1405 – George Kastrioti, better known as Skanderbeg, Albanian national hero (d. 1468)\n*1464 – Sophia Jagiellon, Margravine of Brandenburg-Ansbach, Polish princess (d. 1512)\n*1493 – Girolamo Seripando, Italian theologian and cardinal (d. 1563)\n*1501 – Marcellus II, pope of the Catholic Church (d. 1555)\n*1574 – Innocent X, pope of the Catholic Church (d. 1655)\n*1580 – Charles Gonzaga, Duke of Mantua and Montferrat, French noble (d. 1637)\n*1635 – Johann Joachim Becher, German physician and alchemist (d. 1682)\n*1668 – Alain-René Lesage, French author and playwright (d. 1747)\n*1680 – Jean-Baptiste Stuck, Italian-French cellist and composer (d. 1755)\n*1713 – Charles Batteux, French philosopher and academic (d. 1780)\n*1714 – Anton Raaff, German tenor (d. 1797)\n*1742 – Jean Senebier, Swiss pastor and physiologist (d. 1809)\n*1758 – André Masséna, French general (d. 1817)\n*  1758   – Maximilien Robespierre, French lawyer and politician (d. 1794)\n*1769 – Ferdinand III, Grand Duke of Tuscany (d. 1824)\n*  1769   – Jean Nicolas Pierre Hachette, French mathematician and academic (d. 1834)\n*1781 – Karl Christian Friedrich Krause, German philosopher and author (d. 1832)\n*1797 – Joseph Brackett, American religious leader and composer (d. 1882)\n*1800 – Roman Sanguszko, Polish general (d. 1881)\n*1827 – Hermann Raster, German-American journalist and politician (d. 1891)\n*1836 – Max Eyth, German engineer and author (d. 1906)\n*1843 – Grove Karl Gilbert, American geologist and academic (d. 1918)\n*1848 – Henry Edward Armstrong, English chemist and academic (d. 1937)\n*1851 – Aristide Bruant, French singer and actor (d. 1925)\n*1856 – Sigmund Freud, Austrian neurologist and psychoanalyst (d. 1939)\n*  1856   – Robert Peary, American admiral and explorer (d. 1920)\n*1861 – Motilal Nehru, Indian lawyer and politician, President of the Indian National Congress (d. 1931)\n*1868 – Gaston Leroux, French journalist and author (d. 1927)\n*1869 – Junnosuke Inoue, Japanese businessman and central banker, 8th and 11th Governor of the Bank of Japan (d. 1932)\n*1870 – Walter Rutherford, Scottish golfer (d. 1936)\n*1871 – Victor Grignard, French chemist and academic, Nobel Prize laureate (d. 1935)\n*  1871   – Christian Morgenstern, German author and poet (d. 1914)\n*1872 – Willem de Sitter, Dutch mathematician, physicist, and astronomer (d. 1934)\n*  1872   – Djemal Pasha, Ottoman general (d. 1922)\n*1879 – Bedřich Hrozný, Czech orientalist and linguist (d. 1952)\n*  1879   – Hendrik van Heuckelum, Dutch footballer (d. 1929)\n*1880 – Winifred Brunton, English-South African painter and illustrator (d. 1959)\n*  1880   – Ernst Ludwig Kirchner, German-Swiss painter (d. 1938)\n*1883 – Alberto Collo, Italian actor (d. 1955) \n*1895 – Júlio César de Mello e Souza, Brazilian mathematician and author (d. 1974)\n*  1895   – Fidél Pálffy, Hungarian soldier and politician, Hungarian Minister of Agriculture (d. 1946)\n*  1895   – Rudolph Valentino, Italian actor (d. 1926)\n*1896 – Rolf Maximilian Sievert, Swedish physicist and academic (d. 1966)\n*1897 – Paul Alverdes, German author and poet (d. 1979)\n*1898 – Konrad Henlein, Czech soldier and politician (d. 1945)\n*1902 – Harry Golden, Ukrainian-American journalist and author (d. 1981)\n*  1902   – Max Ophüls, German-American director and screenwriter (d. 1957)\n*1903 – Toots Shor, American businessman, founded Toots Shor's Restaurant (d. 1977)\n*1904 – Moshé Feldenkrais, Ukrainian-Israeli physicist and academic (d. 1984)\n*  1904   – Catherine Lacey, English actress (d. 1979)\n*  1904   – Harry Martinson, Swedish novelist, essayist, and poet Nobel Prize laureate (d. 1978)\n*1905 – Philip N. Krasne, American lawyer and producer (d. 1999)\n*1906 – André Weil, French mathematician and academic (d. 1998)\n*1907 – Weeb Ewbank, American football player and coach (d. 1998)\n*1911 – Guy des Cars, French journalist and author (d. 1993)\n*1913 – Carmen Cavallaro, American pianist (d. 1989)\n*  1913   – Stewart Granger, English-American actor (d. 1993)\n*1915 – Orson Welles, American actor, director, producer, and screenwriter (d. 1985)\n*  1915   – Theodore H. White, American historian, journalist, and author (d. 1986)\n*1916 – Robert H. Dicke, American physicist and astronomer (d. 1997)\n*1917 – Kal Mann, American songwriter (d. 2001)\n*1918 – Zayed bin Sultan Al Nahyan, emir of Abu Dhabi and first president of the United Arab Emirates (d. 2004)\n*1919 – André Guelfi, French race car driver (d. 2016)\n*1920 – Ross Hunter, American actor and producer (d. 1996)\n*  1920   – Kamisese Mara, Fijian politician, 1st Prime Minister of Fiji (d. 2004)\n*  1920   – Marguerite Piazza, American soprano and actress (d. 2012)\n*1921 – Erich Fried, Austrian-German author, poet, and translator (d. 1988)\n*1922 – Camille Laurin, Canadian psychiatrist and politician, 7th Deputy Premier of Quebec (d. 1999)\n*1923 – Harry Watson, Canadian ice hockey player and coach (d. 2002)\n*1924 – Nestor Basterretxea, Spanish painter and sculptor (d. 2014)\n*  1924   – Patricia Kennedy Lawford, American socialite, activist, and author (d. 2006)\n*  1924   – Denny Wright, English guitarist, composer, and producer (d. 1992)\n*1926 – Gilles Grégoire, Canadian politician, co-founded the Parti Québécois (d. 2006)\n*1929 – Rosemary Cramp, English archaeologist and academic\n*  1929   – Paul Lauterbur, American chemist and biophysicist, Nobel Prize laureate (d. 2007)\n*  1929   – John Taylor, English bishop and theologian (d. 2016)\n*1930 – Sonia Rykiel, French fashion designer (d. 2016)\n*1931 – Willie Mays, American baseball player and coach\n*1932 – Ahmet Haxhiu, Kosovan activist (d. 1994)\n*  1932   – Alexander Thynn, 7th Marquess of Bath, English lieutenant and politician\n*1934 – Richard Shelby, American lawyer and politician\n*1937 – Rubin Carter, American-Canadian boxer (d. 2014)\n*1938 – Jean Garon, Canadian economist, lawyer, and politician (d. 2014)\n*1939 – Eddie C. Campbell, American singer and guitarist\n*  1939   – Chet Allen, American child actor (d. 1984)\n*1942 – Ariel Dorfman, Argentinian author, playwright, and academic\n*1943 – Andreas Baader, German terrorist, co-founded the Red Army Faction (d. 1977)\n*  1943   – Milton William Cooper, American theorist and author (d. 2001)\n*  1943   – Wolfgang Reinhardt, German pole vaulter (d. 2011)\n*  1943   – James Turrell, American sculptor and illustrator\n*1944 – Anton Furst, English-American production designer and art director (d. 1991)\n*  1944   – Masanori Murakami, Japanese baseball player and coach \n*1945 – Jimmie Dale Gilmore, American country singer-songwriter, guitarist, actor, and producer\n*  1945   – Bob Seger, American singer-songwriter and guitarist\n*1947 – Alan Dale, New Zealand actor\n*  1947   – Martha Nussbaum, American philosopher and author\n*  1947   – Ljubomir Vračarević, Serbian martial artist, founded Real Aikido (d. 2013)\n*1948 – Frankie Librán, Puerto Rican-American baseball player (d. 2013)\n*1950 – Jeffery Deaver, American journalist and author\n*1951 – Samuel Doe, Liberian sergeant and politician, 21st President of Liberia (d. 1990)\n*  1952   – Gerrit Zalm, Dutch economist and politician, Deputy Prime Minister of the Netherlands\n*1953 – Alexander Akimov, Ukrainian Chernobyl worker (d. 1986) \n*  1953   – Tony Blair, British politician, Prime Minister of the United Kingdom\n*  1953   – Michelle Courchesne, Canadian urban planner and politician, Deputy Premier of Quebec\n*  1953   – Ülle Rajasalu, Estonian politician\n*  1953   – Graeme Souness, Scottish footballer and manager\n*  1953   – Lynn Whitfield, American actress and producer\n*1954 – Tom Abernethy, American basketball player\n*  1954   – Dora Bakoyannis, Greek politician, 120th Greek Minister for Foreign Affairs\n*  1954   – Angela Hernández Nuñez, Dominican author and poet\n*  1954   – Ain Lutsepp, Estonian actor and politician  \n*1955 – Nicholas Alexander, 7th Earl of Caledon, English politician, Lord Lieutenant of Armagh\n*  1955   – Tom Bergeron, American television host\n*  1955   – John Hutton, Baron Hutton of Furness, English academic and politician, Secretary of State for Defence\n*1956 – Lakis Lazopoulos, Greek actor and screenwriter\n*  1956   – Roland Wieser, German race walker and coach\n*1958 – Randall Stout, American architect, designed the Taubman Museum of Art (d. 2014)\n*1959 – Andreas Busse, German runner\n*  1959   – Charles Hendry, English politician\n*1960 – Lyudmila Andonova, Bulgarian high jumper\n*  1960   – Keith Dowding, English political scientist, philosopher, and academic\n*  1960   – Roma Downey, Irish-American actress and producer\n*  1960   – John Flansburgh, American singer-songwriter and guitarist \n*  1960   – Aleksei Lotman, Estonian biologist and politician\n*  1960   – Anne Parillaud, French actress\n*1961 – Oleksandr Apaychev, Ukrainian decathlete and coach\n*  1961   – George Clooney, American actor, director, producer, and screenwriter\n*  1961   – Tom Hunter, Scottish businessman and philanthropist\n*  1961   – Gina Riley, Australian actress, producer, and screenwriter\n*  1961   – Frans Timmermans, Dutch politician and diplomat, First Vice President of the European Commission\n*1962 – Tom Brake, English politician\n*  1962   – Brad Izzard, Australian rugby league player\n*1963 – Alessandra Ferri, Italian ballerina\n*1965 – Leslie Hope, Canadian actress, director, producer, and screenwriter\n*1968 – Worku Bikila, Ethiopian runner\n*  1968   – Lætitia Sadier, French singer and keyboard player \n*1969 – Jim Magilton, Northern Irish footballer and manager\n*1970 – Roland Kun, Nauruan politician\n*1971 – Chris Shiflett, American singer-songwriter and guitarist \n*1972 – Martin Brodeur, Canadian ice hockey player\n*  1972   – Naoko Takahashi, Japanese runner\n*1974 – Bernard Barmasai, Kenyan runner\n*  1974   – Daniela Bártová, Czech pole vaulter and gymnast\n*1975 – Alan Richardson, English cricketer and coach\n*1976 – Dean Chandler, English footballer\n*  1976   – Iván de la Peña, Spanish footballer \n*1977 – Christophe Brandt, Belgian cyclist\n*  1977   – Marc Chouinard, Canadian ice hockey player\n*  1977   – Mark Eaton, American ice hockey player and coach\n*  1977   – Chantelle Newbery, Australian diver\n*1978 – John Abraham, American football player\n*  1978   – Fredrick Federley, Swedish journalist and politician\n*  1978   – Aleksandr Fyodorov, Russian bodybuilder\n*1979 – Gerd Kanter, Estonian discus thrower\n*  1979   – Jan Erik Mikalsen, Norwegian composer\n*1980 – Brooke Bennett, American swimmer\n*  1980   – Dimitris Diamantidis, Greek professional basketball player\n*  1980   – Ricardo Oliveira, Brazilian footballer\n*  1980   – Matthew Whiley, English cricketer \n*1982   – Jason Witten, American Footballer\n*1983 – Dani Alves, Brazilian footballer\n*  1983   – Ingrid Jonach, Australian author\n*  1983   – Gabourey Sidibe, American actress\n*  1983   – Trinley Thaye Dorje, Tibetan religious leader, the 17th Karmapa Lama\n*  1983   – Fredrik Sjöström, Swedish ice hockey player\n*1984 – Anton Babchuk, Ukrainian ice hockey player\n*  1984   – Juan Pablo Carrizo, Argentinian footballer\n*1985 – Chris Paul, American basketball player\n*1986 – Goran Dragic, Slovenian basketball player\n*1987 – Dries Mertens, Belgian footballer \n*  1987   – Adrienne Warren, American actress\n*1989 – Dominika Cibulková, Slovakian tennis player\n*  1989   – Jesse Hughes, Canadian DJ and producer\n*1990 – José Altuve, Venezuelan baseball player\n*1992 – Brendan Gallagher, Canadian ice hockey player\n*  1992   – Byun Baekhyun, South Korean musician and actor, member of boy band EXO\n*1993 – Gustavo Gómez, Paraguayan footballer\n*1994 – Mateo Kovačić, Austrian-Croatian footballer\n\nDeaths\n\n* 698 – Eadberht, bishop of Lindisfarne\n* 850 – Ninmyō, Japanese emperor (b. 808)\n* 932 – Qian Liu, Chinese warlord and king (b. 852)\n*1002 – Ealdwulf, Archbishop of York, Abbot of Peterborough and Bishop of Worcester \n*1187 – Ruben III, Prince of Armenia (b. 1145)\n*1236 – Roger of Wendover, Benedictine monk and chronicler\n*1471 – Edmund Beaufort, English commander (b. 1438)\n*1471 – Thomas Tresham, Speaker of the House of Commons\n*1475 – Dieric Bouts, Flemish painter (b. 1415)\n*1483 – Queen Jeonghui, Korean regent (b. 1418)\n*1502 – James Tyrrell, English knight (b. 1450)\n*1527 – Charles III, Duke of Bourbon, Count of Montpensier and Dauphin of Auvergne (b.1490)\n*1540 – Juan Luís Vives, Spanish scholar (b. 1492)\n*1596 – Giaches de Wert, Flemish-Italian composer (b. 1535)\n*1631 – Sir Robert Cotton, 1st Baronet, of Connington, English historian and politician, founded the Cotton library (b. 1570)\n*1638 – Cornelius Jansen, Dutch-French bishop and theologian (b. 1585)\n*1708 – François de Laval, French-Canadian bishop (b. 1623)\n*1757 – Charles FitzRoy, 2nd Duke of Grafton, English politician, Lord Lieutenant of Ireland (b. 1683)\n*  1757   – Kurt Christoph Graf von Schwerin, Prussian field marshal (b. 1684)\n*1782 – Christine Kirch, German astronomer and academic (b. 1696)\n*1840 – Francisco de Paula Santander, Colombian general and politician, 4th President of the Republic of the New Granada (b. 1792)\n*1859 – Alexander von Humboldt, German geographer and explorer (b. 1769)\n*1862 – Henry David Thoreau, American essayist, poet, and philosopher (b. 1817)\n*1877 – Johan Ludvig Runeberg, Swedish-Finnish poet and hymn-writer (b. 1804)\n*1882 – Thomas Henry Burke, Irish civil servant (b. 1829)\n*  1882   – Lord Frederick Cavendish, British politician, Chief Secretary for Ireland (b. 1836)\n*1902 – Bret Harte, American author and poet (b. 1836)\n*1905 – Robert Herbert, English-Australian politician, 1st Premier of Queensland (b. 1831)\n*1907 – Emanuele Luigi Galizia, Maltese architect and civil engineer (b. 1830)\n*1910 – Edward VII of the United Kingdom (b. 1841)\n*1919 – L. Frank Baum,  American novelist (b. 1856)\n*1939 – Konstantin Somov, Russian-French painter and illustrator (b. 1869)\n*1949 – Maurice Maeterlinck, Belgian-French poet and playwright, Nobel Prize laureate (b. 1862)\n*1951 – Élie Cartan, French mathematician and physicist (b. 1869)\n*1952 – Maria Montessori, Italian-Dutch physician and educator (b. 1870)\n*1959 – Maria Dulęba, Polish actress (b. 1881)\n*  1959   – Ragnar Nurkse, Estonian-American economist and academic (b. 1907)\n*1961 – Lucian Blaga, Romanian poet, playwright, and philosopher (b. 1895)\n*1963 – Theodore von Kármán, Hungarian-American mathematician, physicist, and engineer (b. 1881)\n*  1963   – Ted Weems, American violinist, trombonist, and bandleader (b. 1901)\n*  1963   – Monty Woolley, American raconteur, actor, and  director (b. 1888)\n*1967 – Zhou Zuoren, Chinese author and translator (b. 1885)\n*1970 – Alexander Rodzyanko, Russian general (b. 1879)\n*1973 – Ernest MacMillan, Canadian conductor and composer (b. 1893)\n*1975 – József Mindszenty, Hungarian cardinal (b. 1892)\n*1980 – María Luisa Bombal, Chilean writer (b. 1910)\n*1983 – Ezra Jack Keats, American author and illustrator (b. 1916)\n*  1983   – Kai Winding, Danish-American trombonist and composer (b. 1922)\n*1984 – Mary Cain, American journalist and politician (b. 1904)\n*  1984   – Bonner Pink, English politician (b. 1912)\n*1987 – William J. Casey, American politician, 13th Director of Central Intelligence (b. 1913)\n*1989 – Earl Blaik, American football player and coach (b. 1897)\n*1990 – Charles Farrell, American actor (b. 1901)\n*1991 – Wilfrid Hyde-White, English actor (b. 1903)\n*1992 – Marlene Dietrich, German-American actress and singer (b. 1901)\n*1995 – Noel Brotherston, Northern Irish footballer (b. 1956)\n*2000 – Gordon McClymont, Australian ecologist and academic (b. 1920)\n*2002 – Murray Adaskin, Canadian violinist, composer, conductor, and educator (b. 1906)\n*  2002   – Otis Blackwell, American singer-songwriter and pianist (b. 1932)\n*  2002   – Pim Fortuyn, Dutch sociologist, academic, and politician (b. 1948)\n*  2002   – Bjørn Johansen, Norwegian saxophonist (b. 1940)\n*2003 – Art Houtteman, American baseball player and journalist (b. 1927)\n*2004 – Virginia Capers, American actress and singer (b. 1925)\n*  2004   – Philip Kapleau, American monk and educator (b. 1912)\n*  2004   – Barney Kessel, American guitarist and composer (b. 1923)\n*2006 – Grant McLennan, Australian singer-songwriter and guitarist (b. 1958)\n*  2006   – Lorne Saxberg, Canadian journalist (b. 1958)\n*2007 – Enéas Carneiro, Brazilian physician and politician (b. 1938)\n*  2007   – Curtis Harrington, American actor, director, and screenwriter (b. 1926)\n*2009 – Kevin Grubb, American race car driver (b. 1978)\n*2010 – Robin Roberts, American baseball player, coach, and sportscaster (b. 1926)\n*2012 – James R. Browning, American lieutenant, lawyer, and judge (b. 1918)\n*  2012   – James Isaac, American director and producer (b. 1960)\n*  2012   – Jean Laplanche, French psychoanalyst and author (b. 1924)\n*2013 – Giulio Andreotti, Italian journalist and politician, 41st Prime Minister of Italy (b. 1919)\n*  2013   – Severo Aparicio Quispe, Peruvian bishop (b. 1923)\n*  2013   – Michelangelo Spensieri, Italian-Canadian lawyer and politician (b. 1949)\n*2014 – Wil Albeda, Dutch economist and politician, Dutch Minister of Social Affairs (b. 1925)\n*  2014   – William H. Dana, American pilot, engineer, and astronaut (b. 1930)\n*  2014   – Jimmy Ellis, American boxer (b. 1940)\n*  2014   – Billy Harrell, American baseball player and scout (b. 1928)\n*  2014   – Antony Hopkins, English pianist, composer, and conductor (b. 1921)\n*  2014   – Maria Lassnig, Austrian painter and academic (b. 1919)\n*  2014   – Farley Mowat, Canadian environmentalist and author (b. 1921)\n*2015 – Novera Ahmed, Bangladeshi sculptor (b. 1930)\n*  2015   – Denise McCluggage, American race car driver and journalist (b. 1927)\n*  2015   – Jim Wright, American soldier, lawyer, and politician, 56th Speaker of the United States House of Representatives (b. 1922)\n*2016 – Patrick Ekeng, Cameroonian footballer (b. 1990)\n*  2016   – Reg Grundy, Australian businessman (b. 1923)\n\nHolidays and observances\n\n*Christian Feast Day:\n**Dominic Savio\n**Evodius of Antioch (Roman Catholic Church)\n**François de Laval\n**Gerard of Lunel\n**Lucius of Cyrene\n**Petronax of Monte Cassino\n**St George's Day related observances (Eastern Orthodox Church):\n***Day of Bravery, also known as Gergyovden (Bulgaria)\n***Đurđevdan (Gorani, Roma)\n***Police Day (Georgia)\n***Yuri's Day in the Spring (Russian Orthodox Church)\n**St John before the Latin Gate\n**May 6 (Eastern Orthodox liturgics)\n*Earliest day on which Military Spouse Day can fall, while May 12 is the latest; celebrated on Friday before Mother's Day (United States)\n*International No Diet Day\n*Martyrs' Day (Gabon)\n*Martyrs' Day (Lebanon and Syria)\n*Teachers' Day (Jamaica)\n*The first day of Hıdırellez (Turkey). May 6. http://en.wikipedia.org/?curid=19514."
  }
}
