{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1762",
  "eid" : "bb8d78a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778394410,
  "textBody" : "Andronikos I Komnenos (;  – 12 September 1185), usually Latinized as Andronicus I Comnenus, was Byzantine Emperor from 1183 to 1185. He was the son of Isaac Komnenos and the grandson of the emperor Alexios I.\n\nBiography\n\nEarly years\n\nAndronikos Komnenos was born around 1118. He was handsome and eloquent, active, hardy, courageous, a great general and an able politician, but also licentious. His early years were spent alternately in pleasure and in military service.\n\nIn 1141 he was taken captive by the Seljuq Turks and remained in their hands for a year. On being ransomed, he went to Constantinople, where he was held at the court of his cousin, the Emperor Manuel I Komnenos, to whom he was a great favourite. Here the charms of his niece, Eudoxia, attracted him and she became his mistress. In 1152, accompanied by Eudoxia, he set out for an important command in Cilicia. Failing in his principal enterprise, an attack upon Mopsuestia, he returned but was again appointed to the command of a province.  This second post he seems also to have left after a short interval, for he appeared again in Constantinople and narrowly escaped death at the hands of the brothers of Eudoxia.\n\nExile\n\nAbout 1153, a conspiracy against the Emperor in which Andronikos participated was discovered, and he was thrown in prison. After repeated unsuccessful attempts, he escaped in 1165. After passing through many dangers, including captivity in Vlach territory, he reached Kiev, where his cousin Yaroslav Osmomysl of Galicia held court. While under the protection of Yaroslav, Andronikos formed an alliance with the Emperor Manuel I, and with a Galician army he joined Manuel in the invasion of Hungary, assisting at the siege of Semlin. The campaign was successful, and Andronikos returned to Constantinople with Manuel I in 1168; a year later, however, Andronikos refused to take the oath of allegiance to the future king Béla III of Hungary, whom Manuel desired to become his successor. Andronikos was removed from court but received the province of Cilicia.\n\nStill under the displeasure of the Emperor, Andronikos fled to the court of Raymond, Prince of Antioch. While residing here he captivated and seduced the beautiful daughter of the Prince, Philippa, sister of the Empress Maria. The Emperor was again angered by this dishonour, and Andronikos was compelled to flee. He took refuge with King Amalric I of Jerusalem, whose favour he gained, and who invested him with the Lordship of Beirut. In Jerusalem he saw Theodora Komnene, the beautiful widow of King Baldwin III and niece of the Emperor Manuel. Although Andronikos was at that time fifty-six years old, age had not diminished his charms, and Theodora became the next victim of his artful seduction. To avoid the vengeance of the Emperor, she fled with Andronikos to the court of Nur ad-Din, the Sultan of Damascus. Feeling unsafe there, they continued their perilous journey through the Caucasus and Anatolia. They were well received by King George III of Georgia, whose anonymous sister had probably been the first wife of Andronikos.\n\nAndronikos was granted estates in Kakhetia, in the east of Georgia. In 1173 or 1174, he accompanied the Georgian army on an expedition to Shirvan up to the Caspian shores, where George recaptured the fortress of Shabaran from the invaders from Darband for his cousin, the Shirvanshah Akhsitan I. Finally, Andronikos and Theodora settled in the ancestral lands of the Komnenoi at Oinaion, on the shores of the Black Sea, between Trebizond and Sinope.Speros Vryonis Jr., The Decline of medieval Hellenism in Asia Minor: and the process of Islamization from the eleventh through the fifteenth century, (Berkeley: University of California, 1971), p. 127 While Andronikos was on one of his incursions into Trebizond, his castle was surprised by the governor of that province, and Theodora and her two children were captured and sent to Constantinople. To obtain their release Andronikos in early 1180 made abject submission to the Emperor and, appearing in chains before him, besought pardon. This he obtained, and he was allowed to retire with Theodora into banishment at Oinaion.\n\nEmperor\n\nIn 1180 the Emperor Manuel died and was succeeded by his ten-year-old son Alexios II, who was under the guardianship of his mother, Empress Maria. Her Latin origins and culture led to creeping resentment from her Greek subjects. They had felt insulted by the Western tastes of Manuel, and being ruled by his Western wife built tensions to an explosion of rioting that almost became a full civil war. This gave Andronikos the opportunity to seize the crown for himself, leaving his retirement in 1182 and marching to Constantinople with an army that (according to non-Byzantine sources) included Muslim contingents.\n* Ibn Jubayr p. 355 Broadhurst (Turks and Arabs);\n* William of Tyre, Historia Transmarina 22.11 (innumeras Barbararum nationum secum trahens copias);\n* Walter Map, De Nugis Curialium 2.18 (Turks).\n The defection of the commander of the Byzantine navy, megas doux Andronikos Kontostephanos, and the general Andronikos Angelos, played a key role in allowing the rebellious forces to enter Constantinople.\n\nThe arrival of Andronikos Komnenos was soon followed by a massacre of the city's Latin inhabitants, who virtually controlled its economy, resulting in the deaths of thousands of Westerners. He was believed to have arranged the poisoning of Alexios II's elder sister Maria the Porphyrogenita and her husband Renier of Montferrat, although Maria herself had encouraged him to intervene; the poisoner was said to be the eunuch Pterygeonites. Soon afterwards Andronikos had the Empress Maria imprisoned and then killed — forcing a signature from the child Emperor Alexios to put his mother to death — by Pterygeonites and the hetaireiarches Constantine Tripsychos. Alexios II was compelled to acknowledge Andronikos as colleague in the empire in front of the crowd on the terrace of the Church of Christ of the Chalkè and was then quickly put to death in turn; the killing was carried out by Tripsychos, Theodore Dadibrenos, and Stephen Hagiochristophorites.\n\nIn 1183, sixty-five year old Andronikos married twelve-year-old Agnes of France,  daughter of King Louis VII of France and his third wife Adèle of Champagne — Agnes had been betrothed to Alexios II. By November 1183, Andronikos had associated his younger legitimate son John Komnenos on the throne. In 1184, a Venetian embassy visited Constantinople, and an agreement was reached that compensation of 1,500 gold pieces would be paid for the losses incurred in 1171.\n\nThe reign of Andronikos was characterized by his harsh measures. He resolved to suppress many abuses but above all things to check feudalism and limit the power of the nobles, who were rivals for his throne. The people, who felt the severity of his laws, at the same time acknowledged their justice and found themselves protected from the rapacity of their superiors, who had grown corrupt under the safety and opulence of Manuel I's rule. Andronikos became increasingly paranoid and violent, however, and the Empire descended into a terror state.. In September 1185, he ordered the execution of all prisoners, exiles, and their families for collusion with the invaders. The aristocrats in turn were infuriated against him, and there were several revolts.\n\nThe stories of chaos led to an invasion by King William of the Norman Sicilians. William landed in Epirus with a strong force of 200 ships and 80,000 men, including 5,000 knights, and marched as far as Thessalonica, which he took and pillaged ruthlessly (7,000 Greeks died). Andronikos hastily assembled five different armies to stop the Sicilian army from reaching Constantinople, but his forces failed to stand and retreated to the outlying hills. Andronikos also assembled a fleet of 100 ships to stop the Norman fleet from entering the Sea of Marmara. The invaders were finally driven out in 1186 by his successor, Isaac Angelos.\n\nDeath\n\nAndronikos seems then to have resolved to exterminate the aristocracy, and his plans were nearly successful. But on September 11, 1185, during his absence from the capital Stephen Hagiochristophorites, his lieutenant, moved to arrest Isaac Angelos, whose loyalty was suspect. Isaac killed Hagiochristophorites and took refuge in the church of Hagia Sophia. He appealed to the populace, and a tumult arose that spread rapidly over the whole city.\n\nWhen Andronikos arrived he found that Isaac had been proclaimed Emperor. The deposed Emperor attempted to escape in a boat with his wife Agnes and his mistress, but they were captured (though some claim that Andronikos survived and managed to escape to the then-self-proclaimed Kingdom of Cyprus). Isaac handed him over to the city mob and for three days he was exposed to their fury and resentment, remaining for that period tied to a post and beaten. His right hand was cut off, his teeth and hair were pulled out, one of his eyes was gouged out, and, among many other sufferings, boiling water was thrown in his face, punishment probably associated with his handsomeness and life of licentiousness. At last he was led to the Hippodrome of Constantinople and hung by his feet between two pillars. Two Latin soldiers competed as to whose sword would penetrate his body more deeply, and he was, according to the representation of his death, torn apart. He died on September 12, 1185. At the news of the emperor's death, his son and co-emperor John was murdered by his own troops in Thrace.\nAndronikos I was the last of the Komnenoi to rule Constantinople, although his grandsons Alexios and David founded the Empire of Trebizond in 1204. Their branch of the dynasty was known as the \"Great Komnenoi\" (Megaskomnenoi).\n\nFamily\n\nAndronikos I Komnenos was married twice and had numerous mistresses. By his first wife, whose name is not known, he had three children:\n* Manuel Komnenos (born 1145), the father of Alexios I and David Komnenos, the founders of the Empire of Trebizond\n* John Komnenos (apparently born 1159 or 1160), who was co-emperor with his father from 1183 to 1185 and was killed in that year\n* Maria Komnene\nBy his mistress Theodora Komnene, Andronikos I had the following children:\n* Alexios Komnenos (c. 1170–1199), an alleged forefather of the Georgian noble family of Andronikashvili.\n* Eirene Komnene (born c. 1169), who was briefly married to Alexios Komnenos, a son of Emperor Manuel I Komnenos by Theodora Batatzina.\n\nIn popular culture \n\nAndronikos is the main protagonist in Michael Arnold's Against the Fall of Night (Garden City, New York: Doubleday 1975), as well as Ange Vlachos' Their Most Serene Majesties (Vanguard Press, 1964).\n\nHe is mentioned in the Louis L'Amour medieval historical novel, The Walking Drum, with his gruesome death foreseen by the protagonist in a vision.\n\nHe is among the main characters of the historical novel Agnes of France (1980) by Greek writer Kostas Kyriazis (b. 1920). The novel describes the events of the reigns of Manuel I, Alexios II and Andronikos I through the eyes of Agnes. The novel ends with the death of Andronikos.\n\nAndronikos was portrayed in the novel Baudolino by Umberto Eco, with much detail being given to his grisly end.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Andronikos I Komnenos" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1762" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Andronikos I Komnenos (;  – 12 September 1185), usually Latinized as Andronicus I Comnenus, was Byzantine Emperor from 1183 to 1185. He was the son of Isaac Komnenos and the grandson of the emperor Alexios I.\n\nBiography\n\nEarly years\n\nAndronikos Komnenos was born around 1118. He was handsome and eloquent, active, hardy, courageous, a great general and an able politician, but also licentious. His early years were spent alternately in pleasure and in military service.\n\nIn 1141 he was taken captive by the Seljuq Turks and remained in their hands for a year. On being ransomed, he went to Constantinople, where he was held at the court of his cousin, the Emperor Manuel I Komnenos, to whom he was a great favourite. Here the charms of his niece, Eudoxia, attracted him and she became his mistress. In 1152, accompanied by Eudoxia, he set out for an important command in Cilicia. Failing in his principal enterprise, an attack upon Mopsuestia, he returned but was again appointed to the command of a province.  This second post he seems also to have left after a short interval, for he appeared again in Constantinople and narrowly escaped death at the hands of the brothers of Eudoxia.\n\nExile\n\nAbout 1153, a conspiracy against the Emperor in which Andronikos participated was discovered, and he was thrown in prison. After repeated unsuccessful attempts, he escaped in 1165. After passing through many dangers, including captivity in Vlach territory, he reached Kiev, where his cousin Yaroslav Osmomysl of Galicia held court. While under the protection of Yaroslav, Andronikos formed an alliance with the Emperor Manuel I, and with a Galician army he joined Manuel in the invasion of Hungary, assisting at the siege of Semlin. The campaign was successful, and Andronikos returned to Constantinople with Manuel I in 1168; a year later, however, Andronikos refused to take the oath of allegiance to the future king Béla III of Hungary, whom Manuel desired to become his successor. Andronikos was removed from court but received the province of Cilicia.\n\nStill under the displeasure of the Emperor, Andronikos fled to the court of Raymond, Prince of Antioch. While residing here he captivated and seduced the beautiful daughter of the Prince, Philippa, sister of the Empress Maria. The Emperor was again angered by this dishonour, and Andronikos was compelled to flee. He took refuge with King Amalric I of Jerusalem, whose favour he gained, and who invested him with the Lordship of Beirut. In Jerusalem he saw Theodora Komnene, the beautiful widow of King Baldwin III and niece of the Emperor Manuel. Although Andronikos was at that time fifty-six years old, age had not diminished his charms, and Theodora became the next victim of his artful seduction. To avoid the vengeance of the Emperor, she fled with Andronikos to the court of Nur ad-Din, the Sultan of Damascus. Feeling unsafe there, they continued their perilous journey through the Caucasus and Anatolia. They were well received by King George III of Georgia, whose anonymous sister had probably been the first wife of Andronikos.\n\nAndronikos was granted estates in Kakhetia, in the east of Georgia. In 1173 or 1174, he accompanied the Georgian army on an expedition to Shirvan up to the Caspian shores, where George recaptured the fortress of Shabaran from the invaders from Darband for his cousin, the Shirvanshah Akhsitan I. Finally, Andronikos and Theodora settled in the ancestral lands of the Komnenoi at Oinaion, on the shores of the Black Sea, between Trebizond and Sinope.Speros Vryonis Jr., The Decline of medieval Hellenism in Asia Minor: and the process of Islamization from the eleventh through the fifteenth century, (Berkeley: University of California, 1971), p. 127 While Andronikos was on one of his incursions into Trebizond, his castle was surprised by the governor of that province, and Theodora and her two children were captured and sent to Constantinople. To obtain their release Andronikos in early 1180 made abject submission to the Emperor and, appearing in chains before him, besought pardon. This he obtained, and he was allowed to retire with Theodora into banishment at Oinaion.\n\nEmperor\n\nIn 1180 the Emperor Manuel died and was succeeded by his ten-year-old son Alexios II, who was under the guardianship of his mother, Empress Maria. Her Latin origins and culture led to creeping resentment from her Greek subjects. They had felt insulted by the Western tastes of Manuel, and being ruled by his Western wife built tensions to an explosion of rioting that almost became a full civil war. This gave Andronikos the opportunity to seize the crown for himself, leaving his retirement in 1182 and marching to Constantinople with an army that (according to non-Byzantine sources) included Muslim contingents.\n* Ibn Jubayr p. 355 Broadhurst (Turks and Arabs);\n* William of Tyre, Historia Transmarina 22.11 (innumeras Barbararum nationum secum trahens copias);\n* Walter Map, De Nugis Curialium 2.18 (Turks).\n The defection of the commander of the Byzantine navy, megas doux Andronikos Kontostephanos, and the general Andronikos Angelos, played a key role in allowing the rebellious forces to enter Constantinople.\n\nThe arrival of Andronikos Komnenos was soon followed by a massacre of the city's Latin inhabitants, who virtually controlled its economy, resulting in the deaths of thousands of Westerners. He was believed to have arranged the poisoning of Alexios II's elder sister Maria the Porphyrogenita and her husband Renier of Montferrat, although Maria herself had encouraged him to intervene; the poisoner was said to be the eunuch Pterygeonites. Soon afterwards Andronikos had the Empress Maria imprisoned and then killed — forcing a signature from the child Emperor Alexios to put his mother to death — by Pterygeonites and the hetaireiarches Constantine Tripsychos. Alexios II was compelled to acknowledge Andronikos as colleague in the empire in front of the crowd on the terrace of the Church of Christ of the Chalkè and was then quickly put to death in turn; the killing was carried out by Tripsychos, Theodore Dadibrenos, and Stephen Hagiochristophorites.\n\nIn 1183, sixty-five year old Andronikos married twelve-year-old Agnes of France,  daughter of King Louis VII of France and his third wife Adèle of Champagne — Agnes had been betrothed to Alexios II. By November 1183, Andronikos had associated his younger legitimate son John Komnenos on the throne. In 1184, a Venetian embassy visited Constantinople, and an agreement was reached that compensation of 1,500 gold pieces would be paid for the losses incurred in 1171.\n\nThe reign of Andronikos was characterized by his harsh measures. He resolved to suppress many abuses but above all things to check feudalism and limit the power of the nobles, who were rivals for his throne. The people, who felt the severity of his laws, at the same time acknowledged their justice and found themselves protected from the rapacity of their superiors, who had grown corrupt under the safety and opulence of Manuel I's rule. Andronikos became increasingly paranoid and violent, however, and the Empire descended into a terror state.. In September 1185, he ordered the execution of all prisoners, exiles, and their families for collusion with the invaders. The aristocrats in turn were infuriated against him, and there were several revolts.\n\nThe stories of chaos led to an invasion by King William of the Norman Sicilians. William landed in Epirus with a strong force of 200 ships and 80,000 men, including 5,000 knights, and marched as far as Thessalonica, which he took and pillaged ruthlessly (7,000 Greeks died). Andronikos hastily assembled five different armies to stop the Sicilian army from reaching Constantinople, but his forces failed to stand and retreated to the outlying hills. Andronikos also assembled a fleet of 100 ships to stop the Norman fleet from entering the Sea of Marmara. The invaders were finally driven out in 1186 by his successor, Isaac Angelos.\n\nDeath\n\nAndronikos seems then to have resolved to exterminate the aristocracy, and his plans were nearly successful. But on September 11, 1185, during his absence from the capital Stephen Hagiochristophorites, his lieutenant, moved to arrest Isaac Angelos, whose loyalty was suspect. Isaac killed Hagiochristophorites and took refuge in the church of Hagia Sophia. He appealed to the populace, and a tumult arose that spread rapidly over the whole city.\n\nWhen Andronikos arrived he found that Isaac had been proclaimed Emperor. The deposed Emperor attempted to escape in a boat with his wife Agnes and his mistress, but they were captured (though some claim that Andronikos survived and managed to escape to the then-self-proclaimed Kingdom of Cyprus). Isaac handed him over to the city mob and for three days he was exposed to their fury and resentment, remaining for that period tied to a post and beaten. His right hand was cut off, his teeth and hair were pulled out, one of his eyes was gouged out, and, among many other sufferings, boiling water was thrown in his face, punishment probably associated with his handsomeness and life of licentiousness. At last he was led to the Hippodrome of Constantinople and hung by his feet between two pillars. Two Latin soldiers competed as to whose sword would penetrate his body more deeply, and he was, according to the representation of his death, torn apart. He died on September 12, 1185. At the news of the emperor's death, his son and co-emperor John was murdered by his own troops in Thrace.\nAndronikos I was the last of the Komnenoi to rule Constantinople, although his grandsons Alexios and David founded the Empire of Trebizond in 1204. Their branch of the dynasty was known as the \"Great Komnenoi\" (Megaskomnenoi).\n\nFamily\n\nAndronikos I Komnenos was married twice and had numerous mistresses. By his first wife, whose name is not known, he had three children:\n* Manuel Komnenos (born 1145), the father of Alexios I and David Komnenos, the founders of the Empire of Trebizond\n* John Komnenos (apparently born 1159 or 1160), who was co-emperor with his father from 1183 to 1185 and was killed in that year\n* Maria Komnene\nBy his mistress Theodora Komnene, Andronikos I had the following children:\n* Alexios Komnenos (c. 1170–1199), an alleged forefather of the Georgian noble family of Andronikashvili.\n* Eirene Komnene (born c. 1169), who was briefly married to Alexios Komnenos, a son of Emperor Manuel I Komnenos by Theodora Batatzina.\n\nIn popular culture \n\nAndronikos is the main protagonist in Michael Arnold's Against the Fall of Night (Garden City, New York: Doubleday 1975), as well as Ange Vlachos' Their Most Serene Majesties (Vanguard Press, 1964).\n\nHe is mentioned in the Louis L'Amour medieval historical novel, The Walking Drum, with his gruesome death foreseen by the protagonist in a vision.\n\nHe is among the main characters of the historical novel Agnes of France (1980) by Greek writer Kostas Kyriazis (b. 1920). The novel describes the events of the reigns of Manuel I, Alexios II and Andronikos I through the eyes of Agnes. The novel ends with the death of Andronikos.\n\nAndronikos was portrayed in the novel Baudolino by Umberto Eco, with much detail being given to his grisly end. Andronikos I Komnenos. http://en.wikipedia.org/?curid=1762."
  }
}
