{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1055",
  "eid" : "a95b1d90-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778363881,
  "textBody" : "In Christianity, All Souls' Day commemorates All Souls, the Holy Souls, or the Faithful Departed; that is, the souls of Christians who have died. Observing Christians typically remember deceased relatives on the day. In Western Christianity the annual celebration is now held on 2 November and is associated with the three days of Allhallowtide, including All Saints' Day (1 November) and its vigil, Halloween (31 October). In the Catholic Church, \"the faithful\" refers specifically to baptized Catholics; \"all souls\" commemorates the church penitent of souls in Purgatory, whereas \"all saints\" commemorates the church triumphant of saints in Heaven.  In the liturgical books of the western Catholic Church (the Latin Church) it is called the Commemoration of All the Faithful Departed (), and is celebrated annually on 2 November. In the ordinary form and Divine Worship form of the Roman Rite, it remains on 2 November if this date falls on a Sunday;Roman Missal, \"The Commemoration of All the Faithful Departed\", and \"Universal Norms on the Liturgical Year and the Calendar\", 59Divine Worship: The Missal, \"Commemoration of All the Faithful Departed (All Souls)\", p.871 in the extraordinary form, it is transferred to Monday, 3 November.Missale Romanum 1962, Rubricæ generales, \"De dierum liturgicorum occurentia accidentali eorumque translatione\", 96b On this day in particular, Catholics pray for the dead. In the Church of England it is called The Commemoration of the Faithful Departed (All Souls' Day) and is an optional celebration; Anglicans view All Souls' Day as an extension of the observance of All Saints' Day and it serves to \"remember those who have died\", in connection with the theological doctrines of the resurrection of the body and the Communion of Saints. In the Eastern Orthodox Church and the associated Eastern Catholic Churches, it is celebrated several times during the year and is not associated with the month of November.\n\nBeliefs and practices associated with All Souls' Day vary widely among Christian churches and denominations.\n\nByzantine (Greek) Catholic and the Eastern Orthodoxy\n\nAmong Eastern Orthodox and Byzantine (Greek) Catholics, there are several All Souls' Days during the year. Most of these fall on Saturday, since Jesus lay in the Tomb on Holy Saturday. They occur on the following occasions:\n* The Saturday of Meatfare Week (the second Saturday before Great Lent)—the day before the Sunday of the Last Judgement\n* The second Saturday of Great Lent\n* The third Saturday of Great Lent\n* The fourth Saturday of Great Lent\n* Radonitsa (Monday or Tuesday after Thomas Sunday)\n* The Saturday before Pentecost\n* Demetrius Saturday (the Saturday before the feast of Saint Demetrius of Thessaloniki—26 October)\n\nIn all of the Orthodox Church there is a commemoration of the dead on the Saturday before the feast of Saint Michael the Archangel—8 November, instead of the Demetrius Soul Saturday.\n\nIn the Serbian Orthodox Church there is also a commemoration of the dead on the Saturday closest to the Conception of St. John the Baptist—23 September.\n\nIn Slavic and Greek Churches, all of the Lenten Soul Saturdays are typically observed. In some of the Churches of the Eastern Mediterranean, Meatfare Saturday, Radonitsa and the Saturday before Pentecost are typically observed.\n\nIn addition to the Sundays mentioned above, Saturdays throughout the year are days for general commemoration of all saints, and special hymns to all saints are chanted from the Octoechos, unless some greater feast or saint's commemoration occurs.\n\nEast Syriac tradition\n\nEast Syriac churches including the Syro Malabar Church and Chaldean Catholic Church commemorates the feast of departed faithful on the last Friday of Epiphany(which means Friday just before start of Great Lent). The season of Epiphany remembers the revelation of Christ to the world. And on each Fridays of season of Epiphany the church remembers some important figures in the evangelism.\n\nApart from this In Syro Malabar Church Friday before the parish festival is also celebrated as feast of departed faithful. Here the parish remembers the activities of forefathers who worked for the parish and faithful. They also request the intercession of all departed for the faithful celebration of parish festival.\n\nIn east Syriac liturgy the church remembers departed souls including saints on every Fridays throughout the year since the Christ was crucified and died on Friday.\n\nRoman Catholicism\n\nBackground\n\nThe Catholic Church teaches that the fate of those in purgatory can be affected by the actions of the faithful on earth. Its teaching is based also on the practice of prayer for the dead mentioned as far back as 2 Maccabees 12:42–46. In the West there is ample evidence of the custom of praying for the dead in the inscriptions of the catacombs, with their constant prayers for the peace of the souls of the departed and in the early liturgies, which commonly contain commemorations of the dead. Tertullian, Cyprian and other early Western Fathers witness to the regular  practice of praying for the dead among the early Christians.Oxford Dictionary of the Christian Church (Oxford University Press 2005 ), article \"dead, prayer for the\" The theological basis for the feast is the doctrine that the souls which, on departing from the body, are not perfectly cleansed from venial sins, or have not fully atoned for past transgressions, are debarred from the Beatific Vision, and that the faithful on earth can help them by prayers, alms deeds and especially by the sacrifice of the Mass. Because Purgatory is outside created time and space, it is not necessarily accurate to speak of a location or duration in Purgatory. \n\nHistory\n\nIn the sixth century, it was customary in Benedictine monasteries to hold a commemoration of the deceased members at Whitsuntide. According to Widukind of Corvey (c. 975), in Saxony, there existed a time-honoured ceremony of praying to the dead on 1 October. The Diocese of Liège was the first diocese to adopt the practice under Bishop Notger (d. 1008). The day after All Saints' Day, was that which Saint Odilo of Cluny chose in the 11th century for all the monasteries dependent on the Abbey of Cluny. Odilo instituted the annual commemoration of all the faithful departed, to be observed by the members of his community with alms, prayers, and sacrifices, for the relief of the suffering souls in purgatory.[http://catholicsaints.info/butlers-lives-of-the-saints-saint-odilo-or-olon-sixth-abbot-of-cluni/ Butler, Alban. “Saint Odilo, or Olon, Sixth Abbot of Cluni”. Lives of the Fathers, Martyrs, and Principal Saints, 1866] Odilo decreed that that those requesting a Mass be offered for the departed should make an offering for the poor, thus linking almsgiving with fasting and prayer for the dead. From there the 2 November custom spread to other Benedictine monasteries and thence to the Western Church in general.\n\nIn the 15th century the Dominicans instituted a custom of each priest offering three Masses on the Feast of All Souls. During World War I, given the great number of war dead and the many destroyed churches where mass could no longer be said, Pope Benedict XV, granted all priests the privilege of offering three Masses on All Souls Day,[https://www.catholiceducation.org/en/culture/catholic-contributions/all-saints-and-all-souls.html Saunders, William. \"All Saints and All Souls\", Arlington Catholic Herald, 2003] a permission that still stands. \n\nKnown as the Commemoration of All the Faithful Departed, in some countries the celebration is known as the \"Day of the Dead\".  \n\nLiturgical practice\n\nIn the Roman Rite as revised in 1969, if 2 November falls on a Sunday, the Mass is of All Souls, but the Liturgy of the Hours is that of the Sunday. However, public celebration of Lauds and Vespers of the Dead with the people participating is permitted. While celebration of a Sunday, a solemnity or a feast of the Lord replacing a Sunday begins on the previous evening with Vespers and perhaps evening Mass, the general norms do not allow for anticipation on Saturday evening of the liturgy of All Souls' Day falling on a Sunday, and so they suggest that the formula of the Mass on that Saturday evening is that of the solemnity of All Saints, which outranks the Sunday of Ordinary Time whose Mass would be celebrated on that evening.Universal Norms on the Liturgical Year and the Calendar, \"Table of Liturgical Days\"]  However, in 2014, the United States Conference of Catholic Bishops decided that for that year the Saturday evening (Sunday vigil) Mass in that country was to be that of All Souls; in countries such as Italy the situation was less clear.\n\nIn countries where All Saints' Day is not a holy day of obligation attendance at an evening Mass of All Saints on Saturday 1 November satisfies the Sunday obligation. In England and Wales, where holy days of obligation that fall on a Saturday are transferred to the following day, if 2 November is a Sunday, the solemnity of All Saints is transferred to that date, and All Souls Day is transferred to 3 November. In pre-1970 forms of the Roman Rite, still observed by some, if All Souls Day falls on a Sunday, it is always transferred to 3 November.\n\nIn Divine Worship: The Missal the minor propers (Introit, Gradual, Tract, Sequence, Offertory, and Communion) are those used for Renaissance and Classical musical requiem settings, including the Dies Irae.  This permits the performance of traditional requiem settings in the context of the Divine Worship Form of the Roman Rite on All Souls Day as well as at funerals, votive celebrations of all faithful departed, and anniversaries of deaths.Divine Worship: The Missal, pp.871-875 & pp.1024-1032\n\nAll Souls' indulgence\n\nAccording to The Enchiridion of Indulgences, \nAn indulgence, applicable only to the souls in purgatory, is granted to the faithful, who devoutly visit a cemetery and pray for the departed. The indulgence is plenary, under the usual conditions, each day from the first to the eighth of November; a partial indulgence is granted on any other days of the year.[http://www.catholic.org/prayers/indulgw.php \"The Enchiridion of Indulgences\", Sacred Apostolic Penitentiary, 1968, #13]\n\n\"Visit to a Church or Oratory on All Souls Day. PLENARY INDULGENCE. A plenary indulgence, applicable ONLY to the souls in purgatory, may be obtained by those who, on All Souls Day, piously visit a church, public oratory, or -for those entitled to use it, a semi public oratory.  It may be acquired either on the day designated as All Souls Day or, with the consent of the bishop, on the preceding or following Sunday or the feast of All Saints. On visiting the church or oratory it is required that one Our Father and the Creed be recited.\"[http://www.catholic.org/prayers/indulgw.php \"The Enchiridion of Indulgences\", Sacred Apostolic Penitentiary, 1968, #67]\n\nAnglican Communion\n\nIn the Anglican Communion, All Souls' Day is known liturgically as the Commemoration of All Faithful Departed, and is an optional observance seen as \"an extension of All Saints' Day\", the latter of which marks the second day of Allhallowtide. Historically and at present, several Anglican churches are dedicated to All Souls. During the English Reformation, the observance of All Souls' Day lapsed, although a new Anglican theological understanding of the day has \"led to a widespread acceptance of this commemoration among Anglicans\". Patricia Bays, with regard to the Anglican view of All Souls' Day, wrote that:\n\nAs such, Anglican parishes \"now commemorate all the faithful departed in the context of the All Saints' Day celebration\", in keeping with this fresh perspective. Contributing to the revival was the need \"to help Anglicans mourn the deaths of millions of soldiers in World War I\". Members of the Guild of All Souls, an Anglican devotional society founded in 1873, \"are encouraged to pray for the dying and the dead, to participate in a requiem of All Souls' Day and say a Litany of the Faithful Departed at least once a month\".\n\nAt the Reformation the celebration of All Souls' Day was fused with All Saints' Day in the Church of England[http://www.episcopalchurch.org/files/bi102812half_0.pdf The Episcopal Church, \"All Saints' Day/All Faithful Departed\"] or, in the judgement of some, it was \"deservedly abrogated\".[https://books.google.com/books?id\nxUhVAAAAcAAJ&pgPR59&dq\n%22all+souls%22+%22deservedly+abrogated%22&hlen&sa\nX&redir_escy#v\nonepage&q%22all%20souls%22%20%22deservedly%20abrogated%22&f\nfalse The Book of Common Prayer ... With Notes ... by the Right Rev. Richard Mant (1850), p. lix] It was reinstated in certain parishes in connection with the Oxford Movement of the 19th century and is acknowledged in United States Anglicanism in the Holy Women, Holy Men calendar and in the Church of England with the 1980 Alternative Service Book. It features in Common Worship as a Lesser Festival called \"Commemoration of the Faithful Departed (All Souls' Day)\".\n\nProtestant churches\n\nAmong continental Protestants its tradition has been more tenaciously maintained. During Luther's lifetime, All Souls' Day was widely observed in Saxony although the Roman Catholic meaning of the day was discarded; ecclesiastically in the Lutheran Church, the day was merged with, and is often seen as an extension of All Saints' Day, with many Lutherans still visiting and decorating graves on all the days of Allhallowtide, including All Souls' Day. Just as it is the custom of French people, of all ranks and creeds, to decorate the graves of their dead on the jour des morts, so German, Polish and Hungarian people stream to the graveyards once a year with offerings of flowers and special grave lights (see the picture). Among Czech people the custom of visiting and tidying graves of relatives on the day is quite common. In 1816, Prussia introduced a new date for the remembrance of the Dead among its Lutheran citizens: Totensonntag, the last Sunday before Advent. This custom was later also adopted by the non-Prussian Lutherans in Germany, but it has not spread much beyond the Protestant areas of Germany.\n\nIn the Methodist Church, saints refer to all Christians and therefore, on All Saint's Day, the Church Universal, as well as the deceased members of a local congregation are honoured and remembered. In Methodist congregations that celebrate the liturgy on All Souls Day, the observance, as with Anglicanism and Lutheranism, is viewed as an extension of All Saints' Day and as such, Methodists \"remember our loved ones who had died\" in their observance of this feast.\n\nOrigins, practices and purposes\n\nSome believe that the origins of  All Souls' Day in European folklore and folk belief are related to customs of ancestor veneration practiced worldwide, through events such as, in India Pitru Paksha, the Chinese Ghost Festival, the Japanese Bon Festival. The Roman custom was that of the Lemuria.\n\nThe formal commemoration of the saints and martyrs (All Saints' Day) existed in the early Christian church since its legalization, and alongside that developed a day for commemoration of all the dead (All Souls' Day). The modern date of All Souls' Day was first popularized in the early eleventh century after Abbot Odilo established it as a day for the monks of Cluny and associated monasteries to pray for the souls in purgatory.\n\nMany of these European traditions reflect the dogma of purgatory. For example, ringing bells for the dead was believed to comfort them in their cleansing there, while the sharing of soul cakes with the poor helped to buy the dead a bit of respite from the suffering of purgatory. In the same way, lighting candles was meant to kindle a light for the dead souls languishing in the darkness. Out of this grew the traditions of \"going souling\" and the baking of special types of bread or cakes.Medieval Histories 2012: 11:1 http://medievalhistories.com/wp-content/uploads/medievalhistories-november1.pdf\n\nIn Tirol, cakes are left for them on the table and the room kept warm for their comfort. In Brittany, people flock to the cemeteries at nightfall to kneel, bareheaded, at the graves of their loved ones, and to anoint the hollow of the tombstone with holy water or to pour libations of milk on it. At bedtime, the supper is left on the table for the souls.\n\nIn Bolivia, many people believe that the dead eat the food that is left out for them. In Brazil people attend a Mass or visit the cemetery taking flowers to decorate their relatives' grave, but no food is involved.\n\nIn Malta many people make pilgrimages to graveyards, not just to visit the graves of their dead relatives, but to experience the special day in all its significance. Visits are not restricted to this day alone. During the month of November, Malta's cemeteries are frequented by families of the departed. Mass is also said throughout the month, with certain Catholic parishes organising special events at cemetery chapels.\n\nIn Linz, funereal musical pieces known as aequales were played from tower tops on All Soul's Day and the evening before.From sleevenotes, Triton Trombone Quartet: \"German Trombone Music\"; BIS-CD-644",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "All Souls' Day" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1055" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In Christianity, All Souls' Day commemorates All Souls, the Holy Souls, or the Faithful Departed; that is, the souls of Christians who have died. Observing Christians typically remember deceased relatives on the day. In Western Christianity the annual celebration is now held on 2 November and is associated with the three days of Allhallowtide, including All Saints' Day (1 November) and its vigil, Halloween (31 October). In the Catholic Church, \"the faithful\" refers specifically to baptized Catholics; \"all souls\" commemorates the church penitent of souls in Purgatory, whereas \"all saints\" commemorates the church triumphant of saints in Heaven.  In the liturgical books of the western Catholic Church (the Latin Church) it is called the Commemoration of All the Faithful Departed (), and is celebrated annually on 2 November. In the ordinary form and Divine Worship form of the Roman Rite, it remains on 2 November if this date falls on a Sunday;Roman Missal, \"The Commemoration of All the Faithful Departed\", and \"Universal Norms on the Liturgical Year and the Calendar\", 59Divine Worship: The Missal, \"Commemoration of All the Faithful Departed (All Souls)\", p.871 in the extraordinary form, it is transferred to Monday, 3 November.Missale Romanum 1962, Rubricæ generales, \"De dierum liturgicorum occurentia accidentali eorumque translatione\", 96b On this day in particular, Catholics pray for the dead. In the Church of England it is called The Commemoration of the Faithful Departed (All Souls' Day) and is an optional celebration; Anglicans view All Souls' Day as an extension of the observance of All Saints' Day and it serves to \"remember those who have died\", in connection with the theological doctrines of the resurrection of the body and the Communion of Saints. In the Eastern Orthodox Church and the associated Eastern Catholic Churches, it is celebrated several times during the year and is not associated with the month of November.\n\nBeliefs and practices associated with All Souls' Day vary widely among Christian churches and denominations.\n\nByzantine (Greek) Catholic and the Eastern Orthodoxy\n\nAmong Eastern Orthodox and Byzantine (Greek) Catholics, there are several All Souls' Days during the year. Most of these fall on Saturday, since Jesus lay in the Tomb on Holy Saturday. They occur on the following occasions:\n* The Saturday of Meatfare Week (the second Saturday before Great Lent)—the day before the Sunday of the Last Judgement\n* The second Saturday of Great Lent\n* The third Saturday of Great Lent\n* The fourth Saturday of Great Lent\n* Radonitsa (Monday or Tuesday after Thomas Sunday)\n* The Saturday before Pentecost\n* Demetrius Saturday (the Saturday before the feast of Saint Demetrius of Thessaloniki—26 October)\n\nIn all of the Orthodox Church there is a commemoration of the dead on the Saturday before the feast of Saint Michael the Archangel—8 November, instead of the Demetrius Soul Saturday.\n\nIn the Serbian Orthodox Church there is also a commemoration of the dead on the Saturday closest to the Conception of St. John the Baptist—23 September.\n\nIn Slavic and Greek Churches, all of the Lenten Soul Saturdays are typically observed. In some of the Churches of the Eastern Mediterranean, Meatfare Saturday, Radonitsa and the Saturday before Pentecost are typically observed.\n\nIn addition to the Sundays mentioned above, Saturdays throughout the year are days for general commemoration of all saints, and special hymns to all saints are chanted from the Octoechos, unless some greater feast or saint's commemoration occurs.\n\nEast Syriac tradition\n\nEast Syriac churches including the Syro Malabar Church and Chaldean Catholic Church commemorates the feast of departed faithful on the last Friday of Epiphany(which means Friday just before start of Great Lent). The season of Epiphany remembers the revelation of Christ to the world. And on each Fridays of season of Epiphany the church remembers some important figures in the evangelism.\n\nApart from this In Syro Malabar Church Friday before the parish festival is also celebrated as feast of departed faithful. Here the parish remembers the activities of forefathers who worked for the parish and faithful. They also request the intercession of all departed for the faithful celebration of parish festival.\n\nIn east Syriac liturgy the church remembers departed souls including saints on every Fridays throughout the year since the Christ was crucified and died on Friday.\n\nRoman Catholicism\n\nBackground\n\nThe Catholic Church teaches that the fate of those in purgatory can be affected by the actions of the faithful on earth. Its teaching is based also on the practice of prayer for the dead mentioned as far back as 2 Maccabees 12:42–46. In the West there is ample evidence of the custom of praying for the dead in the inscriptions of the catacombs, with their constant prayers for the peace of the souls of the departed and in the early liturgies, which commonly contain commemorations of the dead. Tertullian, Cyprian and other early Western Fathers witness to the regular  practice of praying for the dead among the early Christians.Oxford Dictionary of the Christian Church (Oxford University Press 2005 ), article \"dead, prayer for the\" The theological basis for the feast is the doctrine that the souls which, on departing from the body, are not perfectly cleansed from venial sins, or have not fully atoned for past transgressions, are debarred from the Beatific Vision, and that the faithful on earth can help them by prayers, alms deeds and especially by the sacrifice of the Mass. Because Purgatory is outside created time and space, it is not necessarily accurate to speak of a location or duration in Purgatory. \n\nHistory\n\nIn the sixth century, it was customary in Benedictine monasteries to hold a commemoration of the deceased members at Whitsuntide. According to Widukind of Corvey (c. 975), in Saxony, there existed a time-honoured ceremony of praying to the dead on 1 October. The Diocese of Liège was the first diocese to adopt the practice under Bishop Notger (d. 1008). The day after All Saints' Day, was that which Saint Odilo of Cluny chose in the 11th century for all the monasteries dependent on the Abbey of Cluny. Odilo instituted the annual commemoration of all the faithful departed, to be observed by the members of his community with alms, prayers, and sacrifices, for the relief of the suffering souls in purgatory.[http://catholicsaints.info/butlers-lives-of-the-saints-saint-odilo-or-olon-sixth-abbot-of-cluni/ Butler, Alban. “Saint Odilo, or Olon, Sixth Abbot of Cluni”. Lives of the Fathers, Martyrs, and Principal Saints, 1866] Odilo decreed that that those requesting a Mass be offered for the departed should make an offering for the poor, thus linking almsgiving with fasting and prayer for the dead. From there the 2 November custom spread to other Benedictine monasteries and thence to the Western Church in general.\n\nIn the 15th century the Dominicans instituted a custom of each priest offering three Masses on the Feast of All Souls. During World War I, given the great number of war dead and the many destroyed churches where mass could no longer be said, Pope Benedict XV, granted all priests the privilege of offering three Masses on All Souls Day,[https://www.catholiceducation.org/en/culture/catholic-contributions/all-saints-and-all-souls.html Saunders, William. \"All Saints and All Souls\", Arlington Catholic Herald, 2003] a permission that still stands. \n\nKnown as the Commemoration of All the Faithful Departed, in some countries the celebration is known as the \"Day of the Dead\".  \n\nLiturgical practice\n\nIn the Roman Rite as revised in 1969, if 2 November falls on a Sunday, the Mass is of All Souls, but the Liturgy of the Hours is that of the Sunday. However, public celebration of Lauds and Vespers of the Dead with the people participating is permitted. While celebration of a Sunday, a solemnity or a feast of the Lord replacing a Sunday begins on the previous evening with Vespers and perhaps evening Mass, the general norms do not allow for anticipation on Saturday evening of the liturgy of All Souls' Day falling on a Sunday, and so they suggest that the formula of the Mass on that Saturday evening is that of the solemnity of All Saints, which outranks the Sunday of Ordinary Time whose Mass would be celebrated on that evening.Universal Norms on the Liturgical Year and the Calendar, \"Table of Liturgical Days\"]  However, in 2014, the United States Conference of Catholic Bishops decided that for that year the Saturday evening (Sunday vigil) Mass in that country was to be that of All Souls; in countries such as Italy the situation was less clear.\n\nIn countries where All Saints' Day is not a holy day of obligation attendance at an evening Mass of All Saints on Saturday 1 November satisfies the Sunday obligation. In England and Wales, where holy days of obligation that fall on a Saturday are transferred to the following day, if 2 November is a Sunday, the solemnity of All Saints is transferred to that date, and All Souls Day is transferred to 3 November. In pre-1970 forms of the Roman Rite, still observed by some, if All Souls Day falls on a Sunday, it is always transferred to 3 November.\n\nIn Divine Worship: The Missal the minor propers (Introit, Gradual, Tract, Sequence, Offertory, and Communion) are those used for Renaissance and Classical musical requiem settings, including the Dies Irae.  This permits the performance of traditional requiem settings in the context of the Divine Worship Form of the Roman Rite on All Souls Day as well as at funerals, votive celebrations of all faithful departed, and anniversaries of deaths.Divine Worship: The Missal, pp.871-875 & pp.1024-1032\n\nAll Souls' indulgence\n\nAccording to The Enchiridion of Indulgences, \nAn indulgence, applicable only to the souls in purgatory, is granted to the faithful, who devoutly visit a cemetery and pray for the departed. The indulgence is plenary, under the usual conditions, each day from the first to the eighth of November; a partial indulgence is granted on any other days of the year.[http://www.catholic.org/prayers/indulgw.php \"The Enchiridion of Indulgences\", Sacred Apostolic Penitentiary, 1968, #13]\n\n\"Visit to a Church or Oratory on All Souls Day. PLENARY INDULGENCE. A plenary indulgence, applicable ONLY to the souls in purgatory, may be obtained by those who, on All Souls Day, piously visit a church, public oratory, or -for those entitled to use it, a semi public oratory.  It may be acquired either on the day designated as All Souls Day or, with the consent of the bishop, on the preceding or following Sunday or the feast of All Saints. On visiting the church or oratory it is required that one Our Father and the Creed be recited.\"[http://www.catholic.org/prayers/indulgw.php \"The Enchiridion of Indulgences\", Sacred Apostolic Penitentiary, 1968, #67]\n\nAnglican Communion\n\nIn the Anglican Communion, All Souls' Day is known liturgically as the Commemoration of All Faithful Departed, and is an optional observance seen as \"an extension of All Saints' Day\", the latter of which marks the second day of Allhallowtide. Historically and at present, several Anglican churches are dedicated to All Souls. During the English Reformation, the observance of All Souls' Day lapsed, although a new Anglican theological understanding of the day has \"led to a widespread acceptance of this commemoration among Anglicans\". Patricia Bays, with regard to the Anglican view of All Souls' Day, wrote that:\n\nAs such, Anglican parishes \"now commemorate all the faithful departed in the context of the All Saints' Day celebration\", in keeping with this fresh perspective. Contributing to the revival was the need \"to help Anglicans mourn the deaths of millions of soldiers in World War I\". Members of the Guild of All Souls, an Anglican devotional society founded in 1873, \"are encouraged to pray for the dying and the dead, to participate in a requiem of All Souls' Day and say a Litany of the Faithful Departed at least once a month\".\n\nAt the Reformation the celebration of All Souls' Day was fused with All Saints' Day in the Church of England[http://www.episcopalchurch.org/files/bi102812half_0.pdf The Episcopal Church, \"All Saints' Day/All Faithful Departed\"] or, in the judgement of some, it was \"deservedly abrogated\".[https://books.google.com/books?id\nxUhVAAAAcAAJ&pgPR59&dq\n%22all+souls%22+%22deservedly+abrogated%22&hlen&sa\nX&redir_escy#v\nonepage&q%22all%20souls%22%20%22deservedly%20abrogated%22&f\nfalse The Book of Common Prayer ... With Notes ... by the Right Rev. Richard Mant (1850), p. lix] It was reinstated in certain parishes in connection with the Oxford Movement of the 19th century and is acknowledged in United States Anglicanism in the Holy Women, Holy Men calendar and in the Church of England with the 1980 Alternative Service Book. It features in Common Worship as a Lesser Festival called \"Commemoration of the Faithful Departed (All Souls' Day)\".\n\nProtestant churches\n\nAmong continental Protestants its tradition has been more tenaciously maintained. During Luther's lifetime, All Souls' Day was widely observed in Saxony although the Roman Catholic meaning of the day was discarded; ecclesiastically in the Lutheran Church, the day was merged with, and is often seen as an extension of All Saints' Day, with many Lutherans still visiting and decorating graves on all the days of Allhallowtide, including All Souls' Day. Just as it is the custom of French people, of all ranks and creeds, to decorate the graves of their dead on the jour des morts, so German, Polish and Hungarian people stream to the graveyards once a year with offerings of flowers and special grave lights (see the picture). Among Czech people the custom of visiting and tidying graves of relatives on the day is quite common. In 1816, Prussia introduced a new date for the remembrance of the Dead among its Lutheran citizens: Totensonntag, the last Sunday before Advent. This custom was later also adopted by the non-Prussian Lutherans in Germany, but it has not spread much beyond the Protestant areas of Germany.\n\nIn the Methodist Church, saints refer to all Christians and therefore, on All Saint's Day, the Church Universal, as well as the deceased members of a local congregation are honoured and remembered. In Methodist congregations that celebrate the liturgy on All Souls Day, the observance, as with Anglicanism and Lutheranism, is viewed as an extension of All Saints' Day and as such, Methodists \"remember our loved ones who had died\" in their observance of this feast.\n\nOrigins, practices and purposes\n\nSome believe that the origins of  All Souls' Day in European folklore and folk belief are related to customs of ancestor veneration practiced worldwide, through events such as, in India Pitru Paksha, the Chinese Ghost Festival, the Japanese Bon Festival. The Roman custom was that of the Lemuria.\n\nThe formal commemoration of the saints and martyrs (All Saints' Day) existed in the early Christian church since its legalization, and alongside that developed a day for commemoration of all the dead (All Souls' Day). The modern date of All Souls' Day was first popularized in the early eleventh century after Abbot Odilo established it as a day for the monks of Cluny and associated monasteries to pray for the souls in purgatory.\n\nMany of these European traditions reflect the dogma of purgatory. For example, ringing bells for the dead was believed to comfort them in their cleansing there, while the sharing of soul cakes with the poor helped to buy the dead a bit of respite from the suffering of purgatory. In the same way, lighting candles was meant to kindle a light for the dead souls languishing in the darkness. Out of this grew the traditions of \"going souling\" and the baking of special types of bread or cakes.Medieval Histories 2012: 11:1 http://medievalhistories.com/wp-content/uploads/medievalhistories-november1.pdf\n\nIn Tirol, cakes are left for them on the table and the room kept warm for their comfort. In Brittany, people flock to the cemeteries at nightfall to kneel, bareheaded, at the graves of their loved ones, and to anoint the hollow of the tombstone with holy water or to pour libations of milk on it. At bedtime, the supper is left on the table for the souls.\n\nIn Bolivia, many people believe that the dead eat the food that is left out for them. In Brazil people attend a Mass or visit the cemetery taking flowers to decorate their relatives' grave, but no food is involved.\n\nIn Malta many people make pilgrimages to graveyards, not just to visit the graves of their dead relatives, but to experience the special day in all its significance. Visits are not restricted to this day alone. During the month of November, Malta's cemeteries are frequented by families of the departed. Mass is also said throughout the month, with certain Catholic parishes organising special events at cemetery chapels.\n\nIn Linz, funereal musical pieces known as aequales were played from tower tops on All Soul's Day and the evening before.From sleevenotes, Triton Trombone Quartet: \"German Trombone Music\"; BIS-CD-644. All Souls' Day. http://en.wikipedia.org/?curid=1055."
  }
}
