{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15820",
  "eid" : "1eee9a50-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778561141,
  "textBody" : "Events\n\n* AD 70 – Titus and his Roman legions breach the middle wall of Jerusalem in the Siege of Jerusalem.\n* 754 – Boniface, Anglo-Saxon missionary, is killed by a band of pagans at Dokkum in Frisia.\n*1257 – Kraków, in Poland, receives city rights.\n*1283 – Battle of the Gulf of Naples: Roger of Lauria, admiral to King Peter III of Aragon, captures Charles of Salerno.\n*1625 – The city of Breda surrenders to the Spanish tercios under general Ambrosio Spinola.\n*1798 – The Battle of New Ross: The attempt to spread the United Irish Rebellion into Munster is defeated.\n*1817 – The first Great Lakes steamer, the Frontenac, is launched.\n*1829 –  captures the armed slave ship Voladora off the coast of Cuba.\n*1832 – The June Rebellion breaks out in Paris in an attempt to overthrow the monarchy of Louis Philippe.\n*1837 – Houston is incorporated by the Republic of Texas.\n*1849 – Denmark becomes a constitutional monarchy by the signing of a new constitution.\n*1851 – Harriet Beecher Stowe's anti-slavery serial, Uncle Tom's Cabin, or Life Among the Lowly, starts a ten-month run in the National Era abolitionist newspaper.\n*1862 – As the Treaty of Saigon is signed, ceding parts of southern Vietnam to France, the guerrilla leader Trương Định decides to defy Emperor Tự Đức of Vietnam and fight on against the Europeans.\n*1864 – American Civil War: Battle of Piedmont: Union forces under General David Hunter defeat a Confederate army at Piedmont, Virginia, taking nearly 1,000 prisoners.\n*1883 – The first regularly scheduled Orient Express departs Paris.\n*1888 – The Rio de la Plata earthquake takes place.\n*1900 – Second Boer War: British soldiers take Pretoria.\n*1915 – Denmark amends its constitution to allow women's suffrage.\n*1916 – Louis Brandeis is sworn in as a Justice of the United States Supreme Court; he is the first American Jew to hold such a position.\n*  1916   – World War I: The Arab Revolt against the Ottoman Empire breaks out.\n*1917 – World War I: Conscription begins in the United States as \"Army registration day\".\n*1933 – The U.S. Congress abrogates the United States' use of the gold standard by enacting a joint resolution (48 Stat. 112) nullifying the right of creditors to demand payment in gold.\n*1940 – World War II: After a brief lull in the Battle of France, the Germans renew the offensive against the remaining French divisions south of the River Somme in Operation Fall Rot (\"Case Red\").\n*1941 – World War II: Four thousand Chongqing residents are asphyxiated in a bomb shelter during the Bombing of Chongqing.\n*1942 – World War II: The United States declares war on Bulgaria, Hungary, and Romania.\n*1944 – World War II: More than 1000 British bombers drop 5,000 tons of bombs on German gun batteries on the Normandy coast in preparation for D-Day.\n*1945 – The Allied Control Council, the military occupation governing body of Germany, formally takes power.\n*1946 – A fire in the La Salle Hotel in Chicago, Illinois, kills 61 people.\n*1947 – Cold War: Marshall Plan: In a speech at Harvard University, the United States Secretary of State George Marshall calls for economic aid to war-torn Europe.\n*1949 – Thailand elects Orapin Chaiyakan, the first female member of Thailand's Parliament.\n*1956 – Elvis Presley introduces his new single, \"Hound Dog\", on The Milton Berle Show, scandalizing the audience with his suggestive hip movements.\n*1959 – The first government of Singapore is sworn in.\n*1963 – The British Secretary of State for War, John Profumo, resigns in a sex scandal known as the \"Profumo affair\".\n*  1963   – Movement of 15 Khordad: Protests against the arrest of Ayatollah Ruhollah Khomeini by the Shah of Iran, Mohammad Reza Pahlavi. In several cities, masses of angry demonstrators are confronted by tanks and paratroopers.\n*1964 – DSV Alvin is commissioned.\n*1967 – The Six-Day War begins: Israel launches surprise strikes against Egyptian air-fields in response to the mobilisation of Egyptian forces on the Israeli border.\n*1968 – Robert F. Kennedy, a U.S. presidential candidate, is shot at the Ambassador Hotel in Los Angeles, by Sirhan Sirhan, a Palestinian. Kennedy dies the next day.\n*1975 – The Suez Canal opens for the first time since the Six-Day War.\n*  1975   – The United Kingdom holds its first country-wide referendum on membership of the European Economic Community (EEC).\n*1976 – The Teton Dam in Idaho, United States, collapses.\n*1981 – The \"Morbidity and Mortality Weekly Report\" of the Centers for Disease Control and Prevention reports that five people in Los Angeles, California, have a rare form of pneumonia seen only in patients with weakened immune systems, in what turns out to be the first recognized cases of AIDS.\n*1984 – The Prime Minister of India, Indira Gandhi, orders an attack on the Golden Temple, the holiest site of the Sikh religion.\n*1989 – The Tank Man halts the progress of a column of advancing tanks for over half an hour after the Tiananmen Square protests of 1989.\n*1993 – Portions of the Holbeck Hall Hotel in Scarborough, North Yorkshire, UK, fall into the sea following a landslide.\n*1995 – The Bose–Einstein condensate is first created.\n*1997 – The Second Republic of the Congo Civil War begins.\n*1998 – A strike begins at the General Motors parts factory in Flint, Michigan, that quickly spreads to five other assembly plants. The strike lasts seven weeks.\n*2000 – The Six-Day War in Kisangani begins in Kisangani, in the Democratic Republic of the Congo, between Ugandan and Rwandan forces. A large part of the city is destroyed.\n*2001 – Tropical Storm Allison makes landfall on the upper-Texas coastline as a strong tropical storm and dumps large amounts of rain over Houston. The storm causes $5.5 billion in damages, making Allison the costliest tropical storm in U.S. history.\n*2003 – A severe heat wave across Pakistan and India reaches its peak, as temperatures exceed 50 °C (122 °F) in the region.\n*2004 – Noël Mamère, Mayor of Bordeaux, celebrates marriage for two men for the first time in France.\n*2006 – Serbia declares independence from the State Union of Serbia and Montenegro.\n*2009 – After 65 straight days of civil disobedience, at least 31 people are killed in clashes between security forces and indigenous people near Bagua, Peru.\n*2013 – A building collapse in Philadelphia kills six and wounds 14 other people.\n*2015 – An earthquake with a moment magnitude of 6.0 struck Ranau, Sabah, Malaysia killing 18 people, including hikers and mountain guides on Mount Kinabalu, after mass landslides that occurred during the earthquake. This is the strongest earthquake to strike Malaysia since 1975.\n*2017 – Montenegro becomes the 29th member of the NATO.\n*  2017   – Six Arab countries—Bahrain, Egypt, Libya, Saudi Arabia, Yemen, and the United Arab Emirates—cut diplomatic ties with Qatar, accusing it of destabilising the region.\n\nBirths\n\n*1341 – Edmund of Langley, 1st Duke of York, English politician, Lord Warden of the Cinque Ports (d. 1402)\n*1412 – Ludovico III Gonzaga, Marquis of Mantua, Italian ruler (d. 1478)\n*1493 – Justus Jonas, German priest and academic (d. 1555)\n*1523 – Margaret of France, Duchess of Berry (d. 1573)\n*1554 – Benedetto Giustiniani, Italian clergyman (d. 1621)\n*1587 – Robert Rich, 2nd Earl of Warwick, English colonial administrator and admiral (d. 1658)\n*1596 – Peter Wtewael, Dutch Golden Age painter (d. 1660)\n*1640 – Pu Songling, Chinese author (d. 1715)\n*1646 – Elena Cornaro Piscopia, Italian mathematician and philosopher (d. 1684)\n*1660 – Sarah Churchill, Duchess of Marlborough (d. 1744)\n*1757 – Pierre Jean George Cabanis, French physiologist and philosopher (d. 1808)\n*1760 – Johan Gadolin, Finnish chemist, physicist, and mineralogist (d. 1852)\n*1771 – Ernest Augustus I of Hanover (d. 1851)\n*1781 – Christian Lobeck, German scholar and academic (d. 1860)\n*1819 – John Couch Adams, English mathematician and astronomer (d. 1892)\n*1830 – Carmine Crocco, Italian soldier (d. 1905)\n*1850 – Pat Garrett, American sheriff (d. 1908)\n*1862 – Allvar Gullstrand, Swedish ophthalmologist and optician, Nobel Prize laureate (d. 1930)\n*1868 – James Connolly, Scottish-born Irish rebel leader (d. 1916)\n*1870 – Bernard de Pourtalès, Swiss captain and sailor (d. 1935)\n*1876 – Isaac Heinemann, German-Israeli scholar and academic (d. 1957)\n*1877 – Willard Miller, Canadian-American sailor, Medal of Honor recipient (d. 1959)\n*1878 – Pancho Villa, Mexican general and politician, Governor of Chihuahua (d. 1923)\n*1879 – Robert Mayer, German-English businessman and philanthropist (d. 1985)\n*1883 – John Maynard Keynes, English economist, philosopher, and academic (d. 1946)\n*1884 – Ralph Benatzky, Czech-Swiss composer (d. 1957)\n*  1884   – Ivy Compton-Burnett, English author (d. 1969)\n*  1884   – Frederick Lorz, American runner (d. 1914)\n*1892 – Jaan Kikkas, Estonian weightlifter (d. 1944)\n*1894 – Roy Thomson, 1st Baron Thomson of Fleet, Canadian-English publisher and academic (d. 1976)\n*1895 – William Boyd, American actor and producer (d. 1972)\n*  1895   – William Roberts, English soldier and painter (d. 1980)\n*1898 – Salvatore Ferragamo, Italian shoe designer, founded Salvatore Ferragamo S.p.A. (d. 1960)\n*  1898   – Federico García Lorca, Spanish poet, playwright, and director (d. 1936)\n*1899 – Otis Barton, American diver, engineer, and actor, designed the bathysphere (d. 1992)\n*  1899   – Theippan Maung Wa, Burmese writer (d. 1942)\n*1900 – Dennis Gabor, Hungarian-English physicist and engineer, Nobel Prize laureate (d. 1979)\n*1902 – Arthur Powell Davies, American minister, author, and activist (d. 1957)\n*1905 – Wayne Boring, American illustrator (d. 1987)\n*1912 – Dean Amadon, American ornithologist and author (d. 2003)\n*  1912   – Eric Hollies, English cricketer (d. 1981)\n*1913 – Conrad Marca-Relli, American-Italian painter and academic (d. 2000)\n*1914 – Beatrice de Cardi, English archaeologist and academic (d. 2016)\n*1916 – Sid Barnes, Australian cricketer (d. 1973)\n*  1916   – Eddie Joost, American baseball player and manager (d. 2011)\n*1919 – Richard Scarry, American-Swiss author and illustrator (d. 1994)\n*1920 – Marion Motley, American football player and coach (d. 1999)\n*  1920   – Cornelius Ryan, Irish-American journalist and author (d. 1974)\n*1922 – Paul Couvret, Dutch-Australian soldier, pilot, and politician (d. 2013)\n*  1922   – Sheila Sim, English actress (d. 2016)\n*1923 – Jorge Daponte, Argentinian race car driver (d. 1963)\n*  1923   – Roger Lebel, Canadian actor (d. 1994)\n*  1923   – Daniel Pinkham, American organist and composer (d. 2006)\n*1924 – Lou Brissie, American baseball player and scout (d. 2013)\n*  1924   – Art Donovan, American football player and radio host (d. 2013)\n*1925 – Bill Hayes, American actor and singer\n*1926 – Paul Soros, Hungarian-American engineer and businessman (d. 2013)\n*1928 – Robert Lansing, American actor (d. 1994)\n*  1928   – Umberto Maglioli, Italian race car driver (d. 1999)\n*  1928   – Tony Richardson, English-American director and producer (d. 1991)\n*1929 – Denis Coe, English soldier, educator, and politician (d. 2015)\n*1930 – Alifa Rifaat, Egyptian author (d. 1996)\n*1931 – Yves Blais, Canadian businessman and politician (d. 1998)\n*  1931   – Jacques Demy, French actor, director, and screenwriter (d. 1990)\n*  1931   – Jerzy Prokopiuk, Polish anthropologist and philosopher\n*1932 – Christy Brown, Irish painter and author (d. 1981)\n*  1932   – Dave Gold, American businessman, founded the 99 Cents Only Stores (d. 2013)\n*1933 – Bata Živojinović, Serbian actor and politician (d. 2016)\n*1934 – Vilhjálmur Einarsson, Icelandic triple jumper, painter, and educator\n*  1934   – Bill Moyers, American journalist, 13th White House Press Secretary\n*1937 – Hélène Cixous, French author, poet, and critic\n*1938 – Moira Anderson, Scottish singer\n*  1938   – Karin Balzer, German hurdler\n*  1938   – Roy Higgins, Australian jockey (d. 2014)\n*1939 – Joe Clark, Canadian journalist and politician, 16th Prime Minister of Canada\n*  1939   – Margaret Drabble, English novelist, biographer, and critic\n*1941 – Martha Argerich, Argentinian pianist\n*  1941   – Erasmo Carlos, Brazilian singer-songwriter\n*  1941   – Spalding Gray, American writer, actor, and monologist (d. 2004)\n*  1941   – Robert Kraft, American businessman, founded The Kraft Group\n*  1941   – Jeff Rooker, Baron Rooker, English academic and politician, Minister of State for Immigration\n*  1941   – Gudrun Sjödén, Swedish designer\n*1942 – Teodoro Obiang Nguema Mbasogo, Equatoguinean lieutenant and politician, 2nd President of Equatorial Guinea\n*1943 – Abraham Viruthakulangara, Roman Catholic Archbishop of Nagpur, Maharashtra, India\n*1944 – Whitfield Diffie, American cryptographer and academic\n*1945 – John Carlos, American runner and football player\n*  1945   – André Lacroix, Canadian-American ice hockey player and coach\n*1946 – John Du Cann, English guitarist (d. 2001)\n*  1946   – Bob Grant, Australian rugby league player\n*  1946   – Patrick Head, English engineer and businessman, co-founded Williams F1\n*  1946   – Wanderléa, Brazilian singer and television host\n*1947 – Laurie Anderson, American singer-songwriter and violinist\n*  1947   – Tom Evans, English singer-songwriter and guitarist (d. 1983)\n*  1947   – David Hare, English director, playwright, and screenwriter\n*  1947   – Freddie Stone, American singer, guitarist, and pastor \n*1949 – Ken Follett, Welsh author\n*  1949   – Elizabeth Gloster, English lawyer and judge\n*  1949   – Alexander Scrymgeour, 12th Earl of Dundee, Scottish politician\n*1950 – Ronnie Dyson, American singer and actor (d. 1990)\n*  1950   – Abraham Sarmiento, Jr., Filipino journalist and activist (d. 1977)\n*1951 – Suze Orman, American financial adviser, author, and television host\n*1952 – Pierre Bruneau, Canadian journalist and news anchor\n*  1952   – Carole Fredericks, American singer (Fredericks Goldman Jones) (d. 2001)\n*  1952   – Nicko McBrain, English drummer and songwriter\n*1953 – Kathleen Kennedy, American film producer, co-founded Amblin Entertainment\n*1954 – Alberto Malesani, Italian footballer and manager\n*  1954   – Phil Neale, English cricketer, coach, and manager\n*  1954   – Nancy Stafford, American model and actress\n*1955 – Edino Nazareth Filho, Brazilian footballer and manager\n*1956 – Richard Butler, English singer-songwriter \n*  1956   – Kenny G, American saxophonist, songwriter, and producer\n*1957 – Charles Nolan, American fashion designer (d. 2011)\n*1958 – Avigdor Lieberman, Moldavian-Israeli soldier and politician, Deputy Prime Minister of Israel\n*  1958   – Ahmed Abdallah Mohamed Sambi, Comorian businessman and politician, President of Comoros\n*1959 – Mark Ella, Australian rugby player\n*  1959   – Werner Schildhauer, German runner\n*1960 – Boris Dugan, Estonian footballer and coach\n*  1960   – Claire Fox, English author and academic\n*1961 – Anke Behmer, German heptathlete\n*  1961   – Mary Kay Bergman, American voice actress (d. 1999)\n*  1961   – Anthony Burger, American singer and pianist (d. 2006)\n*  1961   – Aldo Costa, Italian engineer\n*  1961   – Ramesh Krishnan, Indian tennis player and coach\n*1962 – Jeff Garlin, American actor, comedian, director, and screenwriter\n*  1962   – Tõnis Lukas, Estonian historian and politician, 34th Estonian Minister of Education\n*1964 – Lisa Cholodenko, American director and screenwriter\n*  1964   – Karl Sanders, American singer-songwriter and guitarist \n*1965 – Michael E. Brown, American astronomer and author\n*  1965   – Sandrine Piau, French soprano\n*  1965   – Alfie Turcotte, American ice hockey player\n*1967 – Matt Bullard, American basketball player and sportscaster\n*  1967   – Joe DeLoach, American sprinter\n*  1967   – Ray Lankford, American baseball player\n*  1967   – Ron Livingston, American actor\n*1968 – Ed Vaizey, English lawyer and politician, Minister for Culture, Communications and Creative Industries\n*1969 – Brian McKnight, American singer-songwriter, producer, and actor\n*1970 – Martin Gélinas, Canadian ice hockey player and coach\n*1971 – Susan Lynch, Northern Irish actress\n*  1971   – Takaya Tsubobayashi, Japanese race car driver\n*  1971   – Mark Wahlberg, American model, actor, producer, and rapper \n*1972 – Yogi Adityanath, Indian priest and politician\n*  1972   – Chuck Klosterman, American journalist and author\n*  1972   – Paweł Kotla, Polish conductor and academic\n*1973 – Lamon Brewster, American boxer\n*  1973   – Daniel Gildenlöw, Swedish singer-songwriter, guitarist, and producer \n*  1973   – Gella Vandecaveye, Belgian martial artist\n*1974 – Chad Allen, American actor\n*  1974   – Mervyn Dillon, Trinidadian cricketer\n*  1974   – Scott Draper, Australian tennis player and golfer\n*  1974   – Russ Ortiz, American baseball player\n*1975 – Zydrunas Ilgauskas, Lithuanian-American basketball player\n*  1975   – Duncan Patterson, English drummer and keyboard player \n*  1975   – Sandra Stals, Belgian runner\n*1976 – Giannis Giannoulis, Canadian basketball player\n*  1976   – Torry Holt, American football player and sportscaster\n*  1976   – Aesop Rock, American rapper and producer \n*1977 – Liza Weil, American actress\n*1978 – Fernando Meira, Portuguese footballer\n*1979 – Stefanos Kotsolis, Greek footballer\n*  1979   – Matthew Scarlett, Australian footballer\n*  1979   – Pete Wentz, American singer-songwriter, bass player, actor, and fashion designer \n*  1979   – Jason White, American race car driver\n*1980 – Mike Fisher, Canadian ice hockey player\n*  1980   – Chris Flannery, Australian rugby league player\n*  1980   – Antonio García, Spanish racing driver\n*1981 – Serhat Akın, Turkish footballer\n*  1981   – Sébastien Lefebvre, Canadian singer and guitarist \n*1982 – Ryan Dallas Cook, American trombonist (d. 2005)\n*1983 – Marques Colston, American football player\n*1984 – Robert Barbieri, Canadian-Italian rugby player\n*  1984   – Eric Traoré, Senegalese footballer\n*  1984   – Yusuf Guney, Turkish singer\n*1985 – Jeremy Abbott, American figure skater\n*  1985   – Ekaterina Bychkova, Russian tennis player\n*1986 – Dave Bolland, Canadian ice hockey player\n*  1986   – Vernon Gholston, American football player\n*1987 – Marcus Thornton, American basketball player\n*1988 – Alessandro Salvi, Italian footballer\n*  1988   – Sam Slocombe, English footballer\n*1989 – Cam Atkinson, American ice hockey player\n*  1989   – Megumi Nakajima, Japanese voice actress and singer\n*1990 – Radko Gudas, Czech ice hockey defenceman\n*  1990   – Junior Hoilett, Canadian soccer player\n*  1990   – DJ Mustard, American record producer and songwriter\n*1991 – Sören Bertram, German footballer\n*1992 – Joazhiño Arroe, Peruvian footballer\n*  1992   – Sam Rainbird, Australian cricketer\n*  1992   – Emily Seebohm, Australian swimmer\n*1993 – Roger Tuivasa-Sheck, Samoan-New Zealand rugby league player \n*1995 – Troye Sivan, South African-born Australian singer, songwriter, actor, and YouTube personality\n*  1995   – Ross Wilson, English table tennis player\n*1998 – Yulia Lipnitskaya, Russian figure skater \n\nDeaths\n\n* 301 – Sima Lun, Chinese emperor (b. 249)\n* 535 – Epiphanius of Constantinople \n* 567 – Pope Theodosius I of Alexandria\n* 708 – Jacob of Edessa, Syrian bishop and author (b. 640)\n* 754 – Eoban, bishop of Utrecht\n*   754  – Saint Boniface, English missionary, bishop, and martyr (b. 675)\n* 879 – Ya'qub ibn al-Layth, Persian emir (b. 840)\n* 928 – Louis the Blind, King of Provence\n*1017 – Emperor Sanjō of Japan (b. 976)\n*1118 – Robert de Beaumont, 1st Earl of Leicester, English soldier and politician (b. 1049)\n*1296 – Edmund Crouchback, English politician, Lord Warden of the Cinque Ports (b. 1245)\n*1310 – Amalric, Prince of Tyre (b. c. 1272)\n*1316 – Louis X of France (b. 1289)\n*1383 – Dmitry of Suzdal (b. 1324)\n*1400 – Frederick I, Duke of Brunswick-Lüneburg (b. c. 1357)\n*1424 – Braccio da Montone, Italian condottiero\n*1434 – Yuri IV, Russian grand prince (b. 1374)\n*1443 – Ferdinand the Holy Prince of Portugal (b. 1402)\n*1445 – Leonel Power, English composer\n*1530 – Mercurino Gattinara, Italian statesman and jurist (b. 1465)\n*1568 – Lamoral, Count of Egmont (b. 1522)\n*1625 – Orlando Gibbons, English organist and composer (b. 1583)\n*1667 – Pietro Sforza Pallavicino, Italian cardinal and historian (b. 1607)\n*1716 – Roger Cotes, English mathematician and academic (b. 1682)\n*1722 – Johann Kuhnau, German organist and composer (b. 1660)\n*1738 – Isaac de Beausobre, French pastor and theologian (b. 1659)\n*1740 – Henry Grey, 1st Duke of Kent, English politician and courtier (b. 1671)\n*1791 – Frederick Haldimand, Swiss-Canadian general and politician, 22nd Governor of Quebec (b. 1718)\n*1816 – Giovanni Paisiello, Italian composer and educator (b. 1741)\n*1825 – Odysseas Androutsos, Greek soldier (b. 1788)\n*1826 – Carl Maria von Weber, German pianist, composer, and conductor (b. 1786)\n*1866 – John McDouall Stuart, Scottish explorer and surveyor (b. 1815)\n*1899 – Antonio Luna, Filipino general (b. 1866)\n*1900 – Stephen Crane, American poet, novelist, and short story writer (b. 1871)\n*1906 – Karl Robert Eduard von Hartmann, German philosopher and author (b. 1842)\n*1910 – O. Henry, American short story writer (b. 1862)\n*1913 – Chris von der Ahe, German-American businessman (b. 1851)\n*1916 – Herbert Kitchener, 1st Earl Kitchener, Irish-born British field marshal and politician, Secretary of State for War (b. 1850)\n*1920 – Rhoda Broughton, Welsh-English author (b. 1840)\n*1921 – Will Crooks, English trade unionist and politician (b. 1852)\n*  1921   – Georges Feydeau, French playwright (b. 1862)\n*1930 – Pascin, Bulgarian-French painter and illustrator (b. 1885)\n*1934 – William Holman, English-Australian politician, 19th Premier of New South Wales (b. 1871)\n*1947 – Nils Olaf Chrisander, Swedish-American actor and director (b. 1884)\n*1967 – Arthur Biram, Israeli philologist, philosopher, and academic (b. 1878)\n*  1967   – Harry Brown, Australian public servant (b. 1878)\n*1993 – Conway Twitty, American singer-songwriter and guitarist (b. 1933)\n*1996 – Acharya Kuber Nath Rai, Indian poet and scholar (b. 1933)\n*1997 – J. Anthony Lukas, American journalist and author (b. 1933)\n*1998 – Jeanette Nolan, American actress (b. 1911)\n*  1998   – Sam Yorty, American soldier and politician, 37th Mayor of Los Angeles (b. 1909)\n*1999 – Mel Tormé, American singer-songwriter (b. 1925)\n*2000 – Don Liddle, American baseball player (b. 1925)\n*2002 – Dee Dee Ramone, American singer-songwriter and bass player (b. 1951)\n*2003 – Jürgen Möllemann, German soldier and politician, 10th Vice-Chancellor of Germany (b. 1945)\n*  2003   – Manuel Rosenthal, French composer and conductor (b. 1904)\n*2004 – Iona Brown, English violinist and conductor (b. 1941)\n*  2004   – Ronald Reagan, American actor turned politician, 40th President of the United States (b. 1911)\n*2005 – Adolfo Aguilar Zínser, Mexican scholar and politician (b. 1949)\n*2006 – Frederick Franck, Dutch-American painter, sculptor, and author (b. 1909)\n*  2006   – Edward L. Moyers, American businessman (b. 1928)\n*2009 – Jeff Hanson, American singer-songwriter and guitarist (b. 1978)\n*2012 – Ray Bradbury, American science fiction writer and screenwriter  (b. 1920)\n*  2012   – Hal Keller, American baseball player and manager (b. 1928)\n*  2012   – Mihai Pătrașcu, Romanian-American computer scientist (b. 1982)\n*  2012   – Charlie Sutton, Australian footballer and coach (b. 1924)\n*2013 – Helen McElhone, Scottish politician (b. 1933)\n*  2013   – Stanisław Nagy, Polish cardinal (b. 1921)\n*  2013   – Ruairí Ó Brádaigh, Irish republican activist and politician (b. 1932)\n*  2013   – Michel Ostyn, Belgian physiologist and physician (b. 1924)\n*2014 – Abu Abdulrahman al-Bilawi, Iraqi commander (b. 1971)\n*  2014   – Don Davis, American songwriter and producer (b. 1938)\n*  2014   – Reiulf Steen, Norwegian journalist and politician, Norwegian Minister of Transport and Communications (b. 1933)\n*2015 – Tariq Aziz, Iraqi journalist and politician, Iraqi Minister of Foreign Affairs (b. 1936)\n*  2015   – Alan Bond, English-Australian businessman (b. 1938)\n*  2015   – Richard Johnson, English actor (b. 1927)\n*  2015   – Roger Vergé, French chef and author (b. 1930)\n*2016 – Jerome Bruner, American psychologist (b. 1915)\n*2017 – Andy Cunningham, English actor (b. 1950)\n\nHolidays and observances\n\n* Christian feast day:\n** Boniface (Roman Catholic Church)\n** Dorotheus of Tyre\n** Franco de Assergi\n** Genesius, Count of Clermont\n** Blessed Meinwerk\n** June 5 (Eastern Orthodox liturgics)\n* Arbor Day (New Zealand)\n*Constitution Day (Denmark)\n*Constitution Day (Faroe Island)\n*Father's Day (Denmark)\n*Feast of Núr, the first day of the fifth month of the Bahá'í calendar (Bahá'í Faith) (only if Bahá'í Naw-Rúz falls on March 21)\n*Indian Arrival Day (Suriname)\n*Khordad Movement Anniversary (Iran)\n*Liberation Day (Seychelles)\n*President's Day (Equatorial Guinea)\n*Teachers' Day (Romania) \n*World Environment Day (International)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "June 5" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15820" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* AD 70 – Titus and his Roman legions breach the middle wall of Jerusalem in the Siege of Jerusalem.\n* 754 – Boniface, Anglo-Saxon missionary, is killed by a band of pagans at Dokkum in Frisia.\n*1257 – Kraków, in Poland, receives city rights.\n*1283 – Battle of the Gulf of Naples: Roger of Lauria, admiral to King Peter III of Aragon, captures Charles of Salerno.\n*1625 – The city of Breda surrenders to the Spanish tercios under general Ambrosio Spinola.\n*1798 – The Battle of New Ross: The attempt to spread the United Irish Rebellion into Munster is defeated.\n*1817 – The first Great Lakes steamer, the Frontenac, is launched.\n*1829 –  captures the armed slave ship Voladora off the coast of Cuba.\n*1832 – The June Rebellion breaks out in Paris in an attempt to overthrow the monarchy of Louis Philippe.\n*1837 – Houston is incorporated by the Republic of Texas.\n*1849 – Denmark becomes a constitutional monarchy by the signing of a new constitution.\n*1851 – Harriet Beecher Stowe's anti-slavery serial, Uncle Tom's Cabin, or Life Among the Lowly, starts a ten-month run in the National Era abolitionist newspaper.\n*1862 – As the Treaty of Saigon is signed, ceding parts of southern Vietnam to France, the guerrilla leader Trương Định decides to defy Emperor Tự Đức of Vietnam and fight on against the Europeans.\n*1864 – American Civil War: Battle of Piedmont: Union forces under General David Hunter defeat a Confederate army at Piedmont, Virginia, taking nearly 1,000 prisoners.\n*1883 – The first regularly scheduled Orient Express departs Paris.\n*1888 – The Rio de la Plata earthquake takes place.\n*1900 – Second Boer War: British soldiers take Pretoria.\n*1915 – Denmark amends its constitution to allow women's suffrage.\n*1916 – Louis Brandeis is sworn in as a Justice of the United States Supreme Court; he is the first American Jew to hold such a position.\n*  1916   – World War I: The Arab Revolt against the Ottoman Empire breaks out.\n*1917 – World War I: Conscription begins in the United States as \"Army registration day\".\n*1933 – The U.S. Congress abrogates the United States' use of the gold standard by enacting a joint resolution (48 Stat. 112) nullifying the right of creditors to demand payment in gold.\n*1940 – World War II: After a brief lull in the Battle of France, the Germans renew the offensive against the remaining French divisions south of the River Somme in Operation Fall Rot (\"Case Red\").\n*1941 – World War II: Four thousand Chongqing residents are asphyxiated in a bomb shelter during the Bombing of Chongqing.\n*1942 – World War II: The United States declares war on Bulgaria, Hungary, and Romania.\n*1944 – World War II: More than 1000 British bombers drop 5,000 tons of bombs on German gun batteries on the Normandy coast in preparation for D-Day.\n*1945 – The Allied Control Council, the military occupation governing body of Germany, formally takes power.\n*1946 – A fire in the La Salle Hotel in Chicago, Illinois, kills 61 people.\n*1947 – Cold War: Marshall Plan: In a speech at Harvard University, the United States Secretary of State George Marshall calls for economic aid to war-torn Europe.\n*1949 – Thailand elects Orapin Chaiyakan, the first female member of Thailand's Parliament.\n*1956 – Elvis Presley introduces his new single, \"Hound Dog\", on The Milton Berle Show, scandalizing the audience with his suggestive hip movements.\n*1959 – The first government of Singapore is sworn in.\n*1963 – The British Secretary of State for War, John Profumo, resigns in a sex scandal known as the \"Profumo affair\".\n*  1963   – Movement of 15 Khordad: Protests against the arrest of Ayatollah Ruhollah Khomeini by the Shah of Iran, Mohammad Reza Pahlavi. In several cities, masses of angry demonstrators are confronted by tanks and paratroopers.\n*1964 – DSV Alvin is commissioned.\n*1967 – The Six-Day War begins: Israel launches surprise strikes against Egyptian air-fields in response to the mobilisation of Egyptian forces on the Israeli border.\n*1968 – Robert F. Kennedy, a U.S. presidential candidate, is shot at the Ambassador Hotel in Los Angeles, by Sirhan Sirhan, a Palestinian. Kennedy dies the next day.\n*1975 – The Suez Canal opens for the first time since the Six-Day War.\n*  1975   – The United Kingdom holds its first country-wide referendum on membership of the European Economic Community (EEC).\n*1976 – The Teton Dam in Idaho, United States, collapses.\n*1981 – The \"Morbidity and Mortality Weekly Report\" of the Centers for Disease Control and Prevention reports that five people in Los Angeles, California, have a rare form of pneumonia seen only in patients with weakened immune systems, in what turns out to be the first recognized cases of AIDS.\n*1984 – The Prime Minister of India, Indira Gandhi, orders an attack on the Golden Temple, the holiest site of the Sikh religion.\n*1989 – The Tank Man halts the progress of a column of advancing tanks for over half an hour after the Tiananmen Square protests of 1989.\n*1993 – Portions of the Holbeck Hall Hotel in Scarborough, North Yorkshire, UK, fall into the sea following a landslide.\n*1995 – The Bose–Einstein condensate is first created.\n*1997 – The Second Republic of the Congo Civil War begins.\n*1998 – A strike begins at the General Motors parts factory in Flint, Michigan, that quickly spreads to five other assembly plants. The strike lasts seven weeks.\n*2000 – The Six-Day War in Kisangani begins in Kisangani, in the Democratic Republic of the Congo, between Ugandan and Rwandan forces. A large part of the city is destroyed.\n*2001 – Tropical Storm Allison makes landfall on the upper-Texas coastline as a strong tropical storm and dumps large amounts of rain over Houston. The storm causes $5.5 billion in damages, making Allison the costliest tropical storm in U.S. history.\n*2003 – A severe heat wave across Pakistan and India reaches its peak, as temperatures exceed 50 °C (122 °F) in the region.\n*2004 – Noël Mamère, Mayor of Bordeaux, celebrates marriage for two men for the first time in France.\n*2006 – Serbia declares independence from the State Union of Serbia and Montenegro.\n*2009 – After 65 straight days of civil disobedience, at least 31 people are killed in clashes between security forces and indigenous people near Bagua, Peru.\n*2013 – A building collapse in Philadelphia kills six and wounds 14 other people.\n*2015 – An earthquake with a moment magnitude of 6.0 struck Ranau, Sabah, Malaysia killing 18 people, including hikers and mountain guides on Mount Kinabalu, after mass landslides that occurred during the earthquake. This is the strongest earthquake to strike Malaysia since 1975.\n*2017 – Montenegro becomes the 29th member of the NATO.\n*  2017   – Six Arab countries—Bahrain, Egypt, Libya, Saudi Arabia, Yemen, and the United Arab Emirates—cut diplomatic ties with Qatar, accusing it of destabilising the region.\n\nBirths\n\n*1341 – Edmund of Langley, 1st Duke of York, English politician, Lord Warden of the Cinque Ports (d. 1402)\n*1412 – Ludovico III Gonzaga, Marquis of Mantua, Italian ruler (d. 1478)\n*1493 – Justus Jonas, German priest and academic (d. 1555)\n*1523 – Margaret of France, Duchess of Berry (d. 1573)\n*1554 – Benedetto Giustiniani, Italian clergyman (d. 1621)\n*1587 – Robert Rich, 2nd Earl of Warwick, English colonial administrator and admiral (d. 1658)\n*1596 – Peter Wtewael, Dutch Golden Age painter (d. 1660)\n*1640 – Pu Songling, Chinese author (d. 1715)\n*1646 – Elena Cornaro Piscopia, Italian mathematician and philosopher (d. 1684)\n*1660 – Sarah Churchill, Duchess of Marlborough (d. 1744)\n*1757 – Pierre Jean George Cabanis, French physiologist and philosopher (d. 1808)\n*1760 – Johan Gadolin, Finnish chemist, physicist, and mineralogist (d. 1852)\n*1771 – Ernest Augustus I of Hanover (d. 1851)\n*1781 – Christian Lobeck, German scholar and academic (d. 1860)\n*1819 – John Couch Adams, English mathematician and astronomer (d. 1892)\n*1830 – Carmine Crocco, Italian soldier (d. 1905)\n*1850 – Pat Garrett, American sheriff (d. 1908)\n*1862 – Allvar Gullstrand, Swedish ophthalmologist and optician, Nobel Prize laureate (d. 1930)\n*1868 – James Connolly, Scottish-born Irish rebel leader (d. 1916)\n*1870 – Bernard de Pourtalès, Swiss captain and sailor (d. 1935)\n*1876 – Isaac Heinemann, German-Israeli scholar and academic (d. 1957)\n*1877 – Willard Miller, Canadian-American sailor, Medal of Honor recipient (d. 1959)\n*1878 – Pancho Villa, Mexican general and politician, Governor of Chihuahua (d. 1923)\n*1879 – Robert Mayer, German-English businessman and philanthropist (d. 1985)\n*1883 – John Maynard Keynes, English economist, philosopher, and academic (d. 1946)\n*1884 – Ralph Benatzky, Czech-Swiss composer (d. 1957)\n*  1884   – Ivy Compton-Burnett, English author (d. 1969)\n*  1884   – Frederick Lorz, American runner (d. 1914)\n*1892 – Jaan Kikkas, Estonian weightlifter (d. 1944)\n*1894 – Roy Thomson, 1st Baron Thomson of Fleet, Canadian-English publisher and academic (d. 1976)\n*1895 – William Boyd, American actor and producer (d. 1972)\n*  1895   – William Roberts, English soldier and painter (d. 1980)\n*1898 – Salvatore Ferragamo, Italian shoe designer, founded Salvatore Ferragamo S.p.A. (d. 1960)\n*  1898   – Federico García Lorca, Spanish poet, playwright, and director (d. 1936)\n*1899 – Otis Barton, American diver, engineer, and actor, designed the bathysphere (d. 1992)\n*  1899   – Theippan Maung Wa, Burmese writer (d. 1942)\n*1900 – Dennis Gabor, Hungarian-English physicist and engineer, Nobel Prize laureate (d. 1979)\n*1902 – Arthur Powell Davies, American minister, author, and activist (d. 1957)\n*1905 – Wayne Boring, American illustrator (d. 1987)\n*1912 – Dean Amadon, American ornithologist and author (d. 2003)\n*  1912   – Eric Hollies, English cricketer (d. 1981)\n*1913 – Conrad Marca-Relli, American-Italian painter and academic (d. 2000)\n*1914 – Beatrice de Cardi, English archaeologist and academic (d. 2016)\n*1916 – Sid Barnes, Australian cricketer (d. 1973)\n*  1916   – Eddie Joost, American baseball player and manager (d. 2011)\n*1919 – Richard Scarry, American-Swiss author and illustrator (d. 1994)\n*1920 – Marion Motley, American football player and coach (d. 1999)\n*  1920   – Cornelius Ryan, Irish-American journalist and author (d. 1974)\n*1922 – Paul Couvret, Dutch-Australian soldier, pilot, and politician (d. 2013)\n*  1922   – Sheila Sim, English actress (d. 2016)\n*1923 – Jorge Daponte, Argentinian race car driver (d. 1963)\n*  1923   – Roger Lebel, Canadian actor (d. 1994)\n*  1923   – Daniel Pinkham, American organist and composer (d. 2006)\n*1924 – Lou Brissie, American baseball player and scout (d. 2013)\n*  1924   – Art Donovan, American football player and radio host (d. 2013)\n*1925 – Bill Hayes, American actor and singer\n*1926 – Paul Soros, Hungarian-American engineer and businessman (d. 2013)\n*1928 – Robert Lansing, American actor (d. 1994)\n*  1928   – Umberto Maglioli, Italian race car driver (d. 1999)\n*  1928   – Tony Richardson, English-American director and producer (d. 1991)\n*1929 – Denis Coe, English soldier, educator, and politician (d. 2015)\n*1930 – Alifa Rifaat, Egyptian author (d. 1996)\n*1931 – Yves Blais, Canadian businessman and politician (d. 1998)\n*  1931   – Jacques Demy, French actor, director, and screenwriter (d. 1990)\n*  1931   – Jerzy Prokopiuk, Polish anthropologist and philosopher\n*1932 – Christy Brown, Irish painter and author (d. 1981)\n*  1932   – Dave Gold, American businessman, founded the 99 Cents Only Stores (d. 2013)\n*1933 – Bata Živojinović, Serbian actor and politician (d. 2016)\n*1934 – Vilhjálmur Einarsson, Icelandic triple jumper, painter, and educator\n*  1934   – Bill Moyers, American journalist, 13th White House Press Secretary\n*1937 – Hélène Cixous, French author, poet, and critic\n*1938 – Moira Anderson, Scottish singer\n*  1938   – Karin Balzer, German hurdler\n*  1938   – Roy Higgins, Australian jockey (d. 2014)\n*1939 – Joe Clark, Canadian journalist and politician, 16th Prime Minister of Canada\n*  1939   – Margaret Drabble, English novelist, biographer, and critic\n*1941 – Martha Argerich, Argentinian pianist\n*  1941   – Erasmo Carlos, Brazilian singer-songwriter\n*  1941   – Spalding Gray, American writer, actor, and monologist (d. 2004)\n*  1941   – Robert Kraft, American businessman, founded The Kraft Group\n*  1941   – Jeff Rooker, Baron Rooker, English academic and politician, Minister of State for Immigration\n*  1941   – Gudrun Sjödén, Swedish designer\n*1942 – Teodoro Obiang Nguema Mbasogo, Equatoguinean lieutenant and politician, 2nd President of Equatorial Guinea\n*1943 – Abraham Viruthakulangara, Roman Catholic Archbishop of Nagpur, Maharashtra, India\n*1944 – Whitfield Diffie, American cryptographer and academic\n*1945 – John Carlos, American runner and football player\n*  1945   – André Lacroix, Canadian-American ice hockey player and coach\n*1946 – John Du Cann, English guitarist (d. 2001)\n*  1946   – Bob Grant, Australian rugby league player\n*  1946   – Patrick Head, English engineer and businessman, co-founded Williams F1\n*  1946   – Wanderléa, Brazilian singer and television host\n*1947 – Laurie Anderson, American singer-songwriter and violinist\n*  1947   – Tom Evans, English singer-songwriter and guitarist (d. 1983)\n*  1947   – David Hare, English director, playwright, and screenwriter\n*  1947   – Freddie Stone, American singer, guitarist, and pastor \n*1949 – Ken Follett, Welsh author\n*  1949   – Elizabeth Gloster, English lawyer and judge\n*  1949   – Alexander Scrymgeour, 12th Earl of Dundee, Scottish politician\n*1950 – Ronnie Dyson, American singer and actor (d. 1990)\n*  1950   – Abraham Sarmiento, Jr., Filipino journalist and activist (d. 1977)\n*1951 – Suze Orman, American financial adviser, author, and television host\n*1952 – Pierre Bruneau, Canadian journalist and news anchor\n*  1952   – Carole Fredericks, American singer (Fredericks Goldman Jones) (d. 2001)\n*  1952   – Nicko McBrain, English drummer and songwriter\n*1953 – Kathleen Kennedy, American film producer, co-founded Amblin Entertainment\n*1954 – Alberto Malesani, Italian footballer and manager\n*  1954   – Phil Neale, English cricketer, coach, and manager\n*  1954   – Nancy Stafford, American model and actress\n*1955 – Edino Nazareth Filho, Brazilian footballer and manager\n*1956 – Richard Butler, English singer-songwriter \n*  1956   – Kenny G, American saxophonist, songwriter, and producer\n*1957 – Charles Nolan, American fashion designer (d. 2011)\n*1958 – Avigdor Lieberman, Moldavian-Israeli soldier and politician, Deputy Prime Minister of Israel\n*  1958   – Ahmed Abdallah Mohamed Sambi, Comorian businessman and politician, President of Comoros\n*1959 – Mark Ella, Australian rugby player\n*  1959   – Werner Schildhauer, German runner\n*1960 – Boris Dugan, Estonian footballer and coach\n*  1960   – Claire Fox, English author and academic\n*1961 – Anke Behmer, German heptathlete\n*  1961   – Mary Kay Bergman, American voice actress (d. 1999)\n*  1961   – Anthony Burger, American singer and pianist (d. 2006)\n*  1961   – Aldo Costa, Italian engineer\n*  1961   – Ramesh Krishnan, Indian tennis player and coach\n*1962 – Jeff Garlin, American actor, comedian, director, and screenwriter\n*  1962   – Tõnis Lukas, Estonian historian and politician, 34th Estonian Minister of Education\n*1964 – Lisa Cholodenko, American director and screenwriter\n*  1964   – Karl Sanders, American singer-songwriter and guitarist \n*1965 – Michael E. Brown, American astronomer and author\n*  1965   – Sandrine Piau, French soprano\n*  1965   – Alfie Turcotte, American ice hockey player\n*1967 – Matt Bullard, American basketball player and sportscaster\n*  1967   – Joe DeLoach, American sprinter\n*  1967   – Ray Lankford, American baseball player\n*  1967   – Ron Livingston, American actor\n*1968 – Ed Vaizey, English lawyer and politician, Minister for Culture, Communications and Creative Industries\n*1969 – Brian McKnight, American singer-songwriter, producer, and actor\n*1970 – Martin Gélinas, Canadian ice hockey player and coach\n*1971 – Susan Lynch, Northern Irish actress\n*  1971   – Takaya Tsubobayashi, Japanese race car driver\n*  1971   – Mark Wahlberg, American model, actor, producer, and rapper \n*1972 – Yogi Adityanath, Indian priest and politician\n*  1972   – Chuck Klosterman, American journalist and author\n*  1972   – Paweł Kotla, Polish conductor and academic\n*1973 – Lamon Brewster, American boxer\n*  1973   – Daniel Gildenlöw, Swedish singer-songwriter, guitarist, and producer \n*  1973   – Gella Vandecaveye, Belgian martial artist\n*1974 – Chad Allen, American actor\n*  1974   – Mervyn Dillon, Trinidadian cricketer\n*  1974   – Scott Draper, Australian tennis player and golfer\n*  1974   – Russ Ortiz, American baseball player\n*1975 – Zydrunas Ilgauskas, Lithuanian-American basketball player\n*  1975   – Duncan Patterson, English drummer and keyboard player \n*  1975   – Sandra Stals, Belgian runner\n*1976 – Giannis Giannoulis, Canadian basketball player\n*  1976   – Torry Holt, American football player and sportscaster\n*  1976   – Aesop Rock, American rapper and producer \n*1977 – Liza Weil, American actress\n*1978 – Fernando Meira, Portuguese footballer\n*1979 – Stefanos Kotsolis, Greek footballer\n*  1979   – Matthew Scarlett, Australian footballer\n*  1979   – Pete Wentz, American singer-songwriter, bass player, actor, and fashion designer \n*  1979   – Jason White, American race car driver\n*1980 – Mike Fisher, Canadian ice hockey player\n*  1980   – Chris Flannery, Australian rugby league player\n*  1980   – Antonio García, Spanish racing driver\n*1981 – Serhat Akın, Turkish footballer\n*  1981   – Sébastien Lefebvre, Canadian singer and guitarist \n*1982 – Ryan Dallas Cook, American trombonist (d. 2005)\n*1983 – Marques Colston, American football player\n*1984 – Robert Barbieri, Canadian-Italian rugby player\n*  1984   – Eric Traoré, Senegalese footballer\n*  1984   – Yusuf Guney, Turkish singer\n*1985 – Jeremy Abbott, American figure skater\n*  1985   – Ekaterina Bychkova, Russian tennis player\n*1986 – Dave Bolland, Canadian ice hockey player\n*  1986   – Vernon Gholston, American football player\n*1987 – Marcus Thornton, American basketball player\n*1988 – Alessandro Salvi, Italian footballer\n*  1988   – Sam Slocombe, English footballer\n*1989 – Cam Atkinson, American ice hockey player\n*  1989   – Megumi Nakajima, Japanese voice actress and singer\n*1990 – Radko Gudas, Czech ice hockey defenceman\n*  1990   – Junior Hoilett, Canadian soccer player\n*  1990   – DJ Mustard, American record producer and songwriter\n*1991 – Sören Bertram, German footballer\n*1992 – Joazhiño Arroe, Peruvian footballer\n*  1992   – Sam Rainbird, Australian cricketer\n*  1992   – Emily Seebohm, Australian swimmer\n*1993 – Roger Tuivasa-Sheck, Samoan-New Zealand rugby league player \n*1995 – Troye Sivan, South African-born Australian singer, songwriter, actor, and YouTube personality\n*  1995   – Ross Wilson, English table tennis player\n*1998 – Yulia Lipnitskaya, Russian figure skater \n\nDeaths\n\n* 301 – Sima Lun, Chinese emperor (b. 249)\n* 535 – Epiphanius of Constantinople \n* 567 – Pope Theodosius I of Alexandria\n* 708 – Jacob of Edessa, Syrian bishop and author (b. 640)\n* 754 – Eoban, bishop of Utrecht\n*   754  – Saint Boniface, English missionary, bishop, and martyr (b. 675)\n* 879 – Ya'qub ibn al-Layth, Persian emir (b. 840)\n* 928 – Louis the Blind, King of Provence\n*1017 – Emperor Sanjō of Japan (b. 976)\n*1118 – Robert de Beaumont, 1st Earl of Leicester, English soldier and politician (b. 1049)\n*1296 – Edmund Crouchback, English politician, Lord Warden of the Cinque Ports (b. 1245)\n*1310 – Amalric, Prince of Tyre (b. c. 1272)\n*1316 – Louis X of France (b. 1289)\n*1383 – Dmitry of Suzdal (b. 1324)\n*1400 – Frederick I, Duke of Brunswick-Lüneburg (b. c. 1357)\n*1424 – Braccio da Montone, Italian condottiero\n*1434 – Yuri IV, Russian grand prince (b. 1374)\n*1443 – Ferdinand the Holy Prince of Portugal (b. 1402)\n*1445 – Leonel Power, English composer\n*1530 – Mercurino Gattinara, Italian statesman and jurist (b. 1465)\n*1568 – Lamoral, Count of Egmont (b. 1522)\n*1625 – Orlando Gibbons, English organist and composer (b. 1583)\n*1667 – Pietro Sforza Pallavicino, Italian cardinal and historian (b. 1607)\n*1716 – Roger Cotes, English mathematician and academic (b. 1682)\n*1722 – Johann Kuhnau, German organist and composer (b. 1660)\n*1738 – Isaac de Beausobre, French pastor and theologian (b. 1659)\n*1740 – Henry Grey, 1st Duke of Kent, English politician and courtier (b. 1671)\n*1791 – Frederick Haldimand, Swiss-Canadian general and politician, 22nd Governor of Quebec (b. 1718)\n*1816 – Giovanni Paisiello, Italian composer and educator (b. 1741)\n*1825 – Odysseas Androutsos, Greek soldier (b. 1788)\n*1826 – Carl Maria von Weber, German pianist, composer, and conductor (b. 1786)\n*1866 – John McDouall Stuart, Scottish explorer and surveyor (b. 1815)\n*1899 – Antonio Luna, Filipino general (b. 1866)\n*1900 – Stephen Crane, American poet, novelist, and short story writer (b. 1871)\n*1906 – Karl Robert Eduard von Hartmann, German philosopher and author (b. 1842)\n*1910 – O. Henry, American short story writer (b. 1862)\n*1913 – Chris von der Ahe, German-American businessman (b. 1851)\n*1916 – Herbert Kitchener, 1st Earl Kitchener, Irish-born British field marshal and politician, Secretary of State for War (b. 1850)\n*1920 – Rhoda Broughton, Welsh-English author (b. 1840)\n*1921 – Will Crooks, English trade unionist and politician (b. 1852)\n*  1921   – Georges Feydeau, French playwright (b. 1862)\n*1930 – Pascin, Bulgarian-French painter and illustrator (b. 1885)\n*1934 – William Holman, English-Australian politician, 19th Premier of New South Wales (b. 1871)\n*1947 – Nils Olaf Chrisander, Swedish-American actor and director (b. 1884)\n*1967 – Arthur Biram, Israeli philologist, philosopher, and academic (b. 1878)\n*  1967   – Harry Brown, Australian public servant (b. 1878)\n*1993 – Conway Twitty, American singer-songwriter and guitarist (b. 1933)\n*1996 – Acharya Kuber Nath Rai, Indian poet and scholar (b. 1933)\n*1997 – J. Anthony Lukas, American journalist and author (b. 1933)\n*1998 – Jeanette Nolan, American actress (b. 1911)\n*  1998   – Sam Yorty, American soldier and politician, 37th Mayor of Los Angeles (b. 1909)\n*1999 – Mel Tormé, American singer-songwriter (b. 1925)\n*2000 – Don Liddle, American baseball player (b. 1925)\n*2002 – Dee Dee Ramone, American singer-songwriter and bass player (b. 1951)\n*2003 – Jürgen Möllemann, German soldier and politician, 10th Vice-Chancellor of Germany (b. 1945)\n*  2003   – Manuel Rosenthal, French composer and conductor (b. 1904)\n*2004 – Iona Brown, English violinist and conductor (b. 1941)\n*  2004   – Ronald Reagan, American actor turned politician, 40th President of the United States (b. 1911)\n*2005 – Adolfo Aguilar Zínser, Mexican scholar and politician (b. 1949)\n*2006 – Frederick Franck, Dutch-American painter, sculptor, and author (b. 1909)\n*  2006   – Edward L. Moyers, American businessman (b. 1928)\n*2009 – Jeff Hanson, American singer-songwriter and guitarist (b. 1978)\n*2012 – Ray Bradbury, American science fiction writer and screenwriter  (b. 1920)\n*  2012   – Hal Keller, American baseball player and manager (b. 1928)\n*  2012   – Mihai Pătrașcu, Romanian-American computer scientist (b. 1982)\n*  2012   – Charlie Sutton, Australian footballer and coach (b. 1924)\n*2013 – Helen McElhone, Scottish politician (b. 1933)\n*  2013   – Stanisław Nagy, Polish cardinal (b. 1921)\n*  2013   – Ruairí Ó Brádaigh, Irish republican activist and politician (b. 1932)\n*  2013   – Michel Ostyn, Belgian physiologist and physician (b. 1924)\n*2014 – Abu Abdulrahman al-Bilawi, Iraqi commander (b. 1971)\n*  2014   – Don Davis, American songwriter and producer (b. 1938)\n*  2014   – Reiulf Steen, Norwegian journalist and politician, Norwegian Minister of Transport and Communications (b. 1933)\n*2015 – Tariq Aziz, Iraqi journalist and politician, Iraqi Minister of Foreign Affairs (b. 1936)\n*  2015   – Alan Bond, English-Australian businessman (b. 1938)\n*  2015   – Richard Johnson, English actor (b. 1927)\n*  2015   – Roger Vergé, French chef and author (b. 1930)\n*2016 – Jerome Bruner, American psychologist (b. 1915)\n*2017 – Andy Cunningham, English actor (b. 1950)\n\nHolidays and observances\n\n* Christian feast day:\n** Boniface (Roman Catholic Church)\n** Dorotheus of Tyre\n** Franco de Assergi\n** Genesius, Count of Clermont\n** Blessed Meinwerk\n** June 5 (Eastern Orthodox liturgics)\n* Arbor Day (New Zealand)\n*Constitution Day (Denmark)\n*Constitution Day (Faroe Island)\n*Father's Day (Denmark)\n*Feast of Núr, the first day of the fifth month of the Bahá'í calendar (Bahá'í Faith) (only if Bahá'í Naw-Rúz falls on March 21)\n*Indian Arrival Day (Suriname)\n*Khordad Movement Anniversary (Iran)\n*Liberation Day (Seychelles)\n*President's Day (Equatorial Guinea)\n*Teachers' Day (Romania) \n*World Environment Day (International). June 5. http://en.wikipedia.org/?curid=15820."
  }
}
