{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15254",
  "eid" : "1ae39960-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778554358,
  "textBody" : "Infinitive (abbreviated ) is a grammatical term referring to certain verb forms existing in many languages, most often used as non-finite verbs. As with many linguistic concepts, there is not a single definition applicable to all languages. The word is derived from Late Latin [modus] infinitivus, a derivative of infinitus meaning \"unlimited\".\n\nIn traditional descriptions of English, the infinitive is the basic dictionary form of a verb when used non-finitely, with or without the particle to. Thus to go is an infinitive, as is go in a sentence like \"I must go there\" (but not in \"I go there\", where it is a finite verb). The form without to is called the bare infinitive, and the form with to is called the full infinitive or to-infinitive.\n\nIn many other languages the infinitive is a single word, often with a characteristic inflective ending, like morir (\"(to) die\") in Spanish, manger (\"(to) eat\") in French, portare (\"(to) carry\") in Latin, lieben (\"(to) love\") in German, etc. However some languages have no forms which can be considered to be infinitives. Many Native American languages and some languages in Africa and Australia do not have direct equivalents to infinitives or verbal nouns; in their place they use finite verb forms in ordinary clauses or various special constructions.\n\nBeing a verb, an infinitive may take objects and other complements and modifiers to form a verb phrase (called an infinitive phrase). Like other non-finite verb forms (like participles, converbs, gerunds and gerundives) infinitives do not generally have an expressed subject; thus an infinitive verb phrase also constitutes a complete non-finite clause, called an infinitive (infinitival) clause. Such phrases or clauses may play a variety of roles within sentences, often being nouns (for example being the subject of a sentence or being a complement of another verb), and sometimes being adverbs or other types of modifier. Many verb forms known as infinitives differ from gerunds (verbal nouns) in that they do not inflect for case or occur in adpositional phrases. Instead, infinitives often originate in earlier inflectional forms of verbal nouns. Unlike finite verbs, infinitives are not usually inflected for tense, person, etc. either, although some degree of inflection sometimes occurs; for example Latin has distinct active and passive infinitives.\n\nPhrases and clauses\n\nAn infinitive phrase is a verb phrase constructed with the verb in infinitive form. This consists of the verb together with its objects and other complements and modifiers. Some examples of infinitive phrases in English are given below – these may be based on either the full infinitive (introduced by the particle to) or the bare infinitive (without the particle to).\n*(to) sleep\n*(to) write ten letters\n*(to) go to the store for a pound of sugar\n\nInfinitive phrases often have an implied grammatical subject making them effectively clauses rather than phrases. Such infinitive clauses or infinitival clauses, are one of several kinds of non-finite clause. They can play various grammatical roles like a constituent of a larger clause or sentence; for example it may form a noun phrase or adverb. Infinitival clauses may be embedded within each other in complex ways, like in the sentence:\n*I want to tell you that Brett Favre is going to get married.\nHere the infinitival clause to get married is contained within the finite dependent clause that Brett Favre is going to get married; this in turn is contained within another infinitival clause, which is contained in the finite independent clause (the whole sentence).\n\nThe grammatical structure of an infinitival clause may differ from that of a corresponding finite clause. For example, in German, the infinitive form of the verb usually goes to the end of its clause, whereas a finite verb (in an independent clause) typically comes in second position.\n\nClauses with subject in the accusative case\n\nFollowing certain verbs or prepositions, infinitives commonly do have an expressed subject, e.g.  \n*I want them to eat their dinner.\n*For him to fail now would be a disappointment.\nAs these examples illustrate, the subject of the infinitive is in the objective case (them, him) in contrast to the nominative case that would be used with a finite verb, e.g. \"They ate their dinner.\" \nSuch accusative and infinitive constructions are present in Latin and Ancient Greek, as well as many modern languages.  The unusual case for the subject of an infinitive is an example of exceptional case-marking, where the infinitive clause's role being an object of a verb or preposition (want, for) overpowers the pronoun's subjective role within the clause.\n\nMarking for tense, aspect and voice \n\nIn some languages, infinitives may be marked for grammatical categories like voice, aspect, and to some extent tense. This may be done by inflection, like with the Latin perfect and passive infinitives, or by periphrasis (with the use of auxiliary verbs), like with the Latin future infinitives or the English perfect and progressive infinitives.\n\nLatin has present, perfect and future infinitives, with active and passive forms of each. For details see .\n\nEnglish has infinitive constructions which are marked (periphrastically) for aspect: perfect, progressive (continuous), or a combination of the two (perfect progressive). These can also be marked for passive voice (as can the plain infinitive):\n*(to) eat (plain infinitive, active)\n*(to) be eaten (passive)\n*(to) have eaten (perfect active) \n*(to) have been eaten (perfect passive) \n*(to) be eating (progressive active) \n*(to) be being eaten (progressive passive) \n*(to) have been eating (perfect progressive active) \n*(to) have been being eaten (perfect progressive passive, not often used)\nFurther constructions can be made with other auxiliary-like expressions, like (to) be going to eat or (to) be about to eat, which have future meaning. For more examples of the above types of construction, see .\n\nPerfect infinitives are also found in other European languages which have perfect forms with auxiliaries similarly to English. For example, avoir mangé means \"(to) have eaten\" in French.\n\nEnglish\n\nRegarding English, the term \"infinitive\" is traditionally applied to the unmarked form of the verb (the \"plain form\") when it forms a non-finite verb, whether or not introduced by the particle to. Hence sit and to sit, as used in the following sentences, would each be considered an infinitive:\n* I can sit here all day.\n* I want to sit on the other chair.\n\nThe form without to is called the bare infinitive; the form introduced by to is called the full infinitive or to-infinitive.\n\nThe other non-finite verb forms in English are the gerund or present participle (the -ing form), and the past participle – these are not considered infinitives. Moreover, the unmarked form of the verb is not considered an infinitive when it is forms a finite verb: like a present indicative (\"I sit every day\"), subjunctive (\"I suggest that he sit\"), or imperative (\"Sit down!\"). (For some irregular verbs the form of the infinitive coincides additionally with that of the past tense and/or past participle, like in the case of put.)\n\nCertain auxiliary verbs are defective in that they do not have infinitives (or any other non-finite forms). This applies to the modal verbs (can, must, etc.), as well as certain related auxiliaries like the had of had better and the used of used to. (Periphrases can be employed instead in some cases, like (to) be able to for can, and (to) have to for must.) It also applies to the auxiliary do, like used in questions, negatives and emphasis like described under do-support. (Infinitives are negated by simply preceding them with not. Of course the verb do when forming a main verb can appear in the infinitive.) However, the auxiliary verbs have (used to form the perfect) and be (used to form the passive voice and continuous aspect) both commonly appear in the infinitive: \"I should have finished by now\"; \"It's thought to have been a burial site\"; \"Let him be released\"; \"I hope to be working tomorrow.\"\n\nHuddleston and Pullum's Cambridge Grammar of the English Language (2002) does not use the notion of the \"infinitive\" (\"there is no form in the English verb paradigm called 'the infinitive'\"), only that of the infinitival clause, noting that English uses the same form of the verb, the plain form, in infinitival clauses that it uses in imperative and present-subjunctive clauses.\n\nA matter of controversy among prescriptive grammarians and style writers has been the appropriateness of separating the two words of the to-infinitive (as in \"I expect to happily sit here\"). For details of this, see split infinitive. Opposing linguistic theories typically do not consider the to-infinitive to be a distinct constituent, instead regarding the scope of the particle to to cover an entire verb phrase; thus, to buy a car is parsed like to [buy [a car, rather not like [to buy] [a car].\n\nUses of the infinitive\n\nThe bare infinitive and the to-infinitive have a variety of uses in English. The two forms are mostly in complementary distribution – certain contexts call for one, and certain contexts for the other; they are not normally interchangeable, except in occasional instances like after the verb help, where either can be used.\n\nThe main uses of infinitives (or infinitive phrases) are like follows:\n*As complements of other verbs. The bare infinitive form is a complement of the dummy auxiliary do, most modal auxiliary verbs, verbs of perception like see, watch and hear (after a direct object), and the verbs of permission or causation make, bid, let, and have (also after a direct object). The to-infinitive is used after many intransitive verbs like want, aim, like, fail, etc., and like a second complement after a direct object in the case of verbs like want, convince, aim, etc.\n*In various particular expressions, like had better and would rather (with bare infinitive), in order to, as if to, am to/is to/are to. \n*As a noun phrase, expressing its action or state in an abstract, general way, form the subject of a clause or form a predicative expression: \"To err is human\"; \"To know me is to love me\". The bare infinitive can be used in such sentences like \"What you should do is make a list.\" A common construction with the to-infinitive involves a dummy pronoun subject (it), with the infinitive phrase placed after the predicate: \"It was nice to meet you.\"\n*Adverbially, to express purpose, intent or result – the to-infinitive can have the meaning of \"in order to ...\" (I closed the door (in order to) block out any noise).\n*As a modifier of a noun or adjective. This may relate to the meaning of the noun or adjective (\"a request to see someone\"; \"keen to get on\"), or it may form a type of non-finite relative clause, like in \"the man to save us\"; \"the method to use\"; \"nice to listen to\".\n*In elliptical questions (direct or indirect): \"I don't know where to go.\"  After why the bare infinitive is used: \"Why reveal it?\"\n\nThe infinitive is also the usual dictionary form or citation form of a verb. The form listed in dictionaries is the bare infinitive, although the to-infinitive is often used in referring to verbs or in defining other verbs: \"The word 'amble' means 'to walk slowly'\"; \"How do we conjugate the verb to go?\"\n\nFor further detail and examples of the uses of infinitives in English, see Bare infinitive and To-infinitive in the article on uses of English verb forms.\n\nOther Germanic languages \n\nThe original Proto-Germanic ending of the infinitive was -an, with verbs derived from other words ending in -jan or -janan.\n\nIn German it is -en (\"sagen\"), with -eln or -ern endings on a few words based on -l or -r roots (\"segeln\", \"ändern\").  The use of zu with infinitives is similar to English to, but is less frequent than in English. German infinitives can form nouns, often expressing abstractions of the action, in which case they are of neuter gender: das Essen means the eating, but also the food.\n\nIn Dutch infinitives also end in -en (zeggen — to say), sometimes used with te similar to English to, e.g. \"Het is niet moeilijk te begrijpen\" → \"It is not hard to understand.\" The few verbs with stems ending in -a have infinitives in -n (gaan — to go, slaan — to hit). Afrikaans has lost the distinction between the infinitive and present forms of verbs, with the exception of the verbs \"wees\" (to be), which admits the present form \"is\", and the verb \"hê\" (to have), whose present form is \"het\".\n\nIn North Germanic languages the final -n was lost from the infinitive as early as 500–540 AD, reducing the suffix to -a. Later it has been further reduced to -e in Danish and some Norwegian dialects (including the written majority language bokmål). In the majority of Eastern Norwegian dialects and a few bordering Western Swedish dialects the reduction to -e was only partial, leaving some infinitives in -a and others in -e (å laga vs. å kaste). In northern parts of Norway the infinitive suffix is completely lost (å lag’ vs. å kast’) or only the -a is kept (å laga vs. å kast’). The infinitives of these languages are inflected for passive voice through the addition of -s or -st to the active form. This suffix appearance in Old Norse was a contraction of mik (“me”, forming -mk) or sik (reflexive pronoun, forming -sk) and was originally expressing reflexive actions: (hann) kallar (“(he) calls”) + -sik (“himself”) > (hann) kallask (“(he) calls himself”). The suffixes -mk and -sk later merged to -s, which evolved to -st in the western dialects. The loss or reduction of -a in active voice in Norwegian did not occur in the passive forms (-ast, -as), except for some dialects that have -es. The other North Germanic languages have the same vowel in both forms.\n\nLatin and Romance languages \n\nThe formation of the infinitive in the Romance languages reflects that in their ancestor, Latin, almost all verbs had an infinitive ending with -re (preceded by one of various thematic vowels). For example, in Italian infinitives end in -are, -ere, -rre (rare), or -ire (which is still identical to the Latin forms), and in -arsi, -ersi, -rsi, -irsi for the reflexive forms. In Spanish and Portuguese, infinitives end in -ar, -er, or -ir, while similarly in French they typically end in -re, -er, oir, and -ir. In Romanian, both short and long-form infinitives exist; the so-called \"long infinitives\" end in -are, -ere, -ire and in modern speech are used exclusively as verbal nouns. Verbs that cannot be converted into the nominal long infinitive are very rare). The \"short infinitives\" used in verbal contexts (e.g. after an auxiliary verb) have the endings -a,-ea, -e, and -i (basically removing the ending in \"-re\"). In Romanian, the infinitive is usually replaced by a clause containing the conjunction să plus the subjunctive mood. The only verb that is modal in common modern Romanian is the verb a putea, to be able to. However, in popular speech the infinitive after a putea is also increasingly replaced by the subjunctive.\n\nIn all Romance languages, infinitives can also form nouns.\n\nLatin infinitives challenged several of the generalizations about infinitives. They did inflect for voice (amare, \"to love\", amari, to be loved) and for tense (amare, \"to love\", amavisse, \"to have loved\"), and allowed for an overt expression of the subject (video Socratem currere, \"I see Socrates running\"). See .\n\nRomance languages inherited from Latin the possibility of an overt expression of the subject (as in Italian vedo Socrate correre). Moreover, the \"inflected infinitive\" (or \"personal infinitive\") found in Portuguese and Galician inflects for person and number. These are the only Indo-European languages that allow infinitives to take person and number endings. This helps to make infinitive clauses very common in these languages; for example, the English finite clause in order that you/she/we have... would be translated to Portuguese like para teres/ela ter/termos... (Portuguese is a null-subject language). The Portuguese personal infinitive has no proper tenses, only aspects (imperfect and perfect), but tenses can be expressed using periphrastic structures. For instance, even though you sing/have sung/are going to sing could be translated to apesar de cantares/teres cantado/ires cantar.\n\nOther Romance languages (including Spanish, Romanian, Catalan, and some Italian dialects) allow uninflected infinitives to combine with overt nominative subjects. For example, Spanish al abrir yo los ojos (\"when I opened my eyes\") or sin yo saberlo (\"without my knowing about it\").\n\nHellenic languages\n\nAncient Greek\n\nIn Ancient Greek the infinitive has four tenses (present, future, aorist, perfect) and three voices (active, middle, passive). Present and perfect have the same infinitive for both middle and passive, while future and aorist have separate middle and passive forms.\n\nThematic verbs form present active infinitives by adding to the stem the thematic vowel  and the infinitive ending , and contracts to , e.g. .  Athematic verbs, and perfect actives and aorist passives, add the suffix  instead, e.g. .  In the middle and passive, the present middle infinitive ending is , e.g.  and most tenses of thematic verbs add an additional  between the ending and the stem, e.g. .\n\nModern Greek\n\nThe infinitive per se does not exist in Modern Greek. To see this, consider the ancient Greek ἐθέλω γράφειν \"I want to write\". In modern Greek this become θέλω να γράψω \"I want that I write\". In modern Greek, the infinitive has thus changed form and function and is used mainly in the formation of periphrastic tense forms and not with an article or alone. Instead of the Ancient Greek infinitive system γράφειν, γράψειν, γράψαι, γεγραφέναι, Modern Greek uses only the form γράψει, a development of the ancient Greek aorist infinitive γράψαι. This form is also invariable. The modern Greek infinitive has only two forms according to voice: for example, γράψει for the active voice and γραφ(τ)εί for the passive voice (coming from the ancient passive aorist infinitive γραφῆναι).\n\nBalto-Slavic languages \n\nThe infinitive in Russian usually ends in -t’ (ть) preceded by a thematic vowel, or -ti (ти), if not preceded by one; some verbs have a stem ending in a consonant and change the t to č’, like *mogt’ → moč’ (*могть → мочь) \"can\". Some other Balto-Slavic languages have the infinitive typically ending in, for example, -ć (sometimes -c) in Polish, -t’ in Slovak, -t (formerly -ti) in Czech and Latvian (with a handful ending in -s on the latter), -ty (-ти) in Ukrainian, -ць (-ts) in Belarusian. Lithuanian infinitives end in -ti, Slovenian end on -ti or -či, and Croatian on -ti or -ći.\n\nSerbian officially retains infinitives -ti or -ći, but is more flexible than the other Slavs in breaking the infinitive through a clause. The infinitive nevertheless remains the dictionary form. \n\nBulgarian and Macedonian have lost the infinitive altogether except in a handful of frozen expressions where it is the same as the 3rd person singular aorist form. Almost all expressions where an infinitive may be used in Bulgarian are listed here; neverthess in all cases a subordinate clause is the more usual form. For that reason, the present first-person singular conjugation is the dictionary form in Bulgarian, while Macedonian uses the third person singular form of the verb in present tense.\n\nHebrew \n\nHebrew has two infinitives, the infinitive absolute and the infinitive construct. The infinitive construct is used after prepositions and is inflected with pronominal endings to indicate its subject or object: bikhtōbh hassōphēr \"when the scribe wrote\", ahare lekhtō \"after his going\". When the infinitive construct is preceded by  (lə-, li-, lā-, lo-) \"to\", it has a similar meaning to the English to-infinitive, and this is its most frequent use in Modern Hebrew. The infinitive absolute is used for verb focus and emphasis, like in  mōth yāmūth (literally \"a dying he will die\"; figuratively, \"he shall indeed/surely die\"). This usage is commonplace in the Bible, but in Modern Hebrew it is restricted to high-flown literary works.\n\nNote, however, that the to-infinitive of Hebrew is not the dictionary form; that is the third person singular perfect form.\n\nFinnish \n\nThe Finnish grammatical tradition includes many non-finite forms that are generally labeled as (numbered) infinitives although many of these are functionally converbs. To form the so-called first infinitive, the strong form of the root (without consonant gradation or epenthetic 'e') is used, and these changes occur:\n# the root is suffixed with -ta/-tä according to vowel harmony\n# consonant elision takes place if applicable, e.g. juoks+ta → juosta\n# assimilation of clusters violating sonority hierarchy if applicable, e.g. nuol+ta → nuolla, sur+ta → surra\n# 't' weakens to 'd' after diphthongs, e.g. juo+ta → juoda\n# 't' elides if intervocalic, e.g. kirjoitta+ta → kirjoittaa\n\nAs such, it is inconvenient for dictionary use, because the imperative would be closer to the root word. Nevertheless, dictionaries use the first infinitive.\n\nThere are also four other infinitives, plus a \"long\" form of the first:\n* The long first infinitive is -kse- and must have a personal suffix appended to it. It has the general meaning of \"in order to [do something], e.g. kirjoittaakseni \"in order for me to write [something]\".\n* The second infinitive is formed by replacing the final -a/-ä of the first infinitive with e. It can take the inessive and instructive cases to create forms like kirjoittaessa \"while writing\".\n* The third infinitive is formed by adding -ma to the first infinitive, which alone creates an \"agent\" form: kirjoita- becomes kirjoittama. The third infinitive is technically a noun (denoting the act of performing some verb), so case suffixes identical to those attached to ordinary Finnish nouns allow for other expressions using the third infinitive, e.g. kirjoittamalla \"by writing\".\n** A personal suffix can then be added to this form to indicate the \"agent participle\", such that kirjoittamani kirja = \"the book which I wrote\".\n* The fourth infinitive adds -minen to the first, forming a noun which has the connotation of \"the process of [doing something]\", e.g. kirjoittaminen \"[the process of] writing\". It, too, can be inflected like other Finnish nouns which end in -nen.\n* The fifth infinitive adds -maisilla- to the first, and like the long first infinitive, must take a possessive suffix. It has to do with being \"about to [do something]\" and may also imply that the act was cut off or interrupted, e.g. kirjoittamaisillasi \"you were about to write [but something interrupted you]\". This form is more commonly replaced by the third infinitive in adessive case, usually also with a possessive suffix (thus kirjoittamallasi).\nNote that all of these must change to reflect vowel harmony, so the fifth infinitive (with a third-person suffix) of hypätä \"jump\" is hyppäämäisillään \"he was about to jump\", not *hyppäämaisillaan.\n\nSeri \n\nThe Seri language of northwestern Mexico has infinitival forms which are used in two constructions (with the verb meaning 'want' and with the verb meaning 'be able'). The infinitive is formed by adding a prefix to the stem: either iha- (plus a vowel change of certain vowel-initial stems) if the complement clause is transitive, or ica- (and no vowel change) if the complement clause is intransitive. The infinitive shows agreement in number with the controlling subject. Examples are: icatax ihmiimzo 'I want to go', where icatax is the singular infinitive of the verb 'go' (singular root is -atax), and icalx hamiimcajc 'we want to go', where icalx is the plural infinitive. Examples of the transitive infinitive: ihaho 'to see it/him/her/them' (root -aho), and ihacta 'to look at it/him/her/them' (root -oocta).\n\nTranslation to languages without an infinitive \n\nIn languages without an infinitive, the infinitive is translated either as a that-clause or as a verbal noun. For example, in Literary Arabic the sentence \"I want to write a book\" is translated as either urīdu an aktuba kitāban (lit. \"I want that I write a book\", with a verb in the subjunctive mood) or urīdu kitābata kitābin (lit. \"I want the writing of a book\", with the masdar or verbal noun), and in Levantine Colloquial Arabic biddi aktub kitāb (subordinate clause with verb in subjunctive).\n\nEven in languages that have infinitives, similar constructions are sometimes necessary where English would allow the infinitive. For example, in French the sentence \"I want you to come\" translates to Je veux que vous veniez (lit. \"I want that you come\", with come being in the subjunctive mood).  However, \"I want to come\" is simply Je veux venir, using the infinitive, just as in English. In Russian, sentences such as \"I want you to leave\" do not use an infinitive. Rather, they use the conjunction чтобы \"in order to/so that\" with the past tense form (most probably remnant of subjunctive) of the verb: Я хочу, чтобы вы ушли (literally, \"I want so that you left\").",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Infinitive" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15254" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Infinitive (abbreviated ) is a grammatical term referring to certain verb forms existing in many languages, most often used as non-finite verbs. As with many linguistic concepts, there is not a single definition applicable to all languages. The word is derived from Late Latin [modus] infinitivus, a derivative of infinitus meaning \"unlimited\".\n\nIn traditional descriptions of English, the infinitive is the basic dictionary form of a verb when used non-finitely, with or without the particle to. Thus to go is an infinitive, as is go in a sentence like \"I must go there\" (but not in \"I go there\", where it is a finite verb). The form without to is called the bare infinitive, and the form with to is called the full infinitive or to-infinitive.\n\nIn many other languages the infinitive is a single word, often with a characteristic inflective ending, like morir (\"(to) die\") in Spanish, manger (\"(to) eat\") in French, portare (\"(to) carry\") in Latin, lieben (\"(to) love\") in German, etc. However some languages have no forms which can be considered to be infinitives. Many Native American languages and some languages in Africa and Australia do not have direct equivalents to infinitives or verbal nouns; in their place they use finite verb forms in ordinary clauses or various special constructions.\n\nBeing a verb, an infinitive may take objects and other complements and modifiers to form a verb phrase (called an infinitive phrase). Like other non-finite verb forms (like participles, converbs, gerunds and gerundives) infinitives do not generally have an expressed subject; thus an infinitive verb phrase also constitutes a complete non-finite clause, called an infinitive (infinitival) clause. Such phrases or clauses may play a variety of roles within sentences, often being nouns (for example being the subject of a sentence or being a complement of another verb), and sometimes being adverbs or other types of modifier. Many verb forms known as infinitives differ from gerunds (verbal nouns) in that they do not inflect for case or occur in adpositional phrases. Instead, infinitives often originate in earlier inflectional forms of verbal nouns. Unlike finite verbs, infinitives are not usually inflected for tense, person, etc. either, although some degree of inflection sometimes occurs; for example Latin has distinct active and passive infinitives.\n\nPhrases and clauses\n\nAn infinitive phrase is a verb phrase constructed with the verb in infinitive form. This consists of the verb together with its objects and other complements and modifiers. Some examples of infinitive phrases in English are given below – these may be based on either the full infinitive (introduced by the particle to) or the bare infinitive (without the particle to).\n*(to) sleep\n*(to) write ten letters\n*(to) go to the store for a pound of sugar\n\nInfinitive phrases often have an implied grammatical subject making them effectively clauses rather than phrases. Such infinitive clauses or infinitival clauses, are one of several kinds of non-finite clause. They can play various grammatical roles like a constituent of a larger clause or sentence; for example it may form a noun phrase or adverb. Infinitival clauses may be embedded within each other in complex ways, like in the sentence:\n*I want to tell you that Brett Favre is going to get married.\nHere the infinitival clause to get married is contained within the finite dependent clause that Brett Favre is going to get married; this in turn is contained within another infinitival clause, which is contained in the finite independent clause (the whole sentence).\n\nThe grammatical structure of an infinitival clause may differ from that of a corresponding finite clause. For example, in German, the infinitive form of the verb usually goes to the end of its clause, whereas a finite verb (in an independent clause) typically comes in second position.\n\nClauses with subject in the accusative case\n\nFollowing certain verbs or prepositions, infinitives commonly do have an expressed subject, e.g.  \n*I want them to eat their dinner.\n*For him to fail now would be a disappointment.\nAs these examples illustrate, the subject of the infinitive is in the objective case (them, him) in contrast to the nominative case that would be used with a finite verb, e.g. \"They ate their dinner.\" \nSuch accusative and infinitive constructions are present in Latin and Ancient Greek, as well as many modern languages.  The unusual case for the subject of an infinitive is an example of exceptional case-marking, where the infinitive clause's role being an object of a verb or preposition (want, for) overpowers the pronoun's subjective role within the clause.\n\nMarking for tense, aspect and voice \n\nIn some languages, infinitives may be marked for grammatical categories like voice, aspect, and to some extent tense. This may be done by inflection, like with the Latin perfect and passive infinitives, or by periphrasis (with the use of auxiliary verbs), like with the Latin future infinitives or the English perfect and progressive infinitives.\n\nLatin has present, perfect and future infinitives, with active and passive forms of each. For details see .\n\nEnglish has infinitive constructions which are marked (periphrastically) for aspect: perfect, progressive (continuous), or a combination of the two (perfect progressive). These can also be marked for passive voice (as can the plain infinitive):\n*(to) eat (plain infinitive, active)\n*(to) be eaten (passive)\n*(to) have eaten (perfect active) \n*(to) have been eaten (perfect passive) \n*(to) be eating (progressive active) \n*(to) be being eaten (progressive passive) \n*(to) have been eating (perfect progressive active) \n*(to) have been being eaten (perfect progressive passive, not often used)\nFurther constructions can be made with other auxiliary-like expressions, like (to) be going to eat or (to) be about to eat, which have future meaning. For more examples of the above types of construction, see .\n\nPerfect infinitives are also found in other European languages which have perfect forms with auxiliaries similarly to English. For example, avoir mangé means \"(to) have eaten\" in French.\n\nEnglish\n\nRegarding English, the term \"infinitive\" is traditionally applied to the unmarked form of the verb (the \"plain form\") when it forms a non-finite verb, whether or not introduced by the particle to. Hence sit and to sit, as used in the following sentences, would each be considered an infinitive:\n* I can sit here all day.\n* I want to sit on the other chair.\n\nThe form without to is called the bare infinitive; the form introduced by to is called the full infinitive or to-infinitive.\n\nThe other non-finite verb forms in English are the gerund or present participle (the -ing form), and the past participle – these are not considered infinitives. Moreover, the unmarked form of the verb is not considered an infinitive when it is forms a finite verb: like a present indicative (\"I sit every day\"), subjunctive (\"I suggest that he sit\"), or imperative (\"Sit down!\"). (For some irregular verbs the form of the infinitive coincides additionally with that of the past tense and/or past participle, like in the case of put.)\n\nCertain auxiliary verbs are defective in that they do not have infinitives (or any other non-finite forms). This applies to the modal verbs (can, must, etc.), as well as certain related auxiliaries like the had of had better and the used of used to. (Periphrases can be employed instead in some cases, like (to) be able to for can, and (to) have to for must.) It also applies to the auxiliary do, like used in questions, negatives and emphasis like described under do-support. (Infinitives are negated by simply preceding them with not. Of course the verb do when forming a main verb can appear in the infinitive.) However, the auxiliary verbs have (used to form the perfect) and be (used to form the passive voice and continuous aspect) both commonly appear in the infinitive: \"I should have finished by now\"; \"It's thought to have been a burial site\"; \"Let him be released\"; \"I hope to be working tomorrow.\"\n\nHuddleston and Pullum's Cambridge Grammar of the English Language (2002) does not use the notion of the \"infinitive\" (\"there is no form in the English verb paradigm called 'the infinitive'\"), only that of the infinitival clause, noting that English uses the same form of the verb, the plain form, in infinitival clauses that it uses in imperative and present-subjunctive clauses.\n\nA matter of controversy among prescriptive grammarians and style writers has been the appropriateness of separating the two words of the to-infinitive (as in \"I expect to happily sit here\"). For details of this, see split infinitive. Opposing linguistic theories typically do not consider the to-infinitive to be a distinct constituent, instead regarding the scope of the particle to to cover an entire verb phrase; thus, to buy a car is parsed like to [buy [a car, rather not like [to buy] [a car].\n\nUses of the infinitive\n\nThe bare infinitive and the to-infinitive have a variety of uses in English. The two forms are mostly in complementary distribution – certain contexts call for one, and certain contexts for the other; they are not normally interchangeable, except in occasional instances like after the verb help, where either can be used.\n\nThe main uses of infinitives (or infinitive phrases) are like follows:\n*As complements of other verbs. The bare infinitive form is a complement of the dummy auxiliary do, most modal auxiliary verbs, verbs of perception like see, watch and hear (after a direct object), and the verbs of permission or causation make, bid, let, and have (also after a direct object). The to-infinitive is used after many intransitive verbs like want, aim, like, fail, etc., and like a second complement after a direct object in the case of verbs like want, convince, aim, etc.\n*In various particular expressions, like had better and would rather (with bare infinitive), in order to, as if to, am to/is to/are to. \n*As a noun phrase, expressing its action or state in an abstract, general way, form the subject of a clause or form a predicative expression: \"To err is human\"; \"To know me is to love me\". The bare infinitive can be used in such sentences like \"What you should do is make a list.\" A common construction with the to-infinitive involves a dummy pronoun subject (it), with the infinitive phrase placed after the predicate: \"It was nice to meet you.\"\n*Adverbially, to express purpose, intent or result – the to-infinitive can have the meaning of \"in order to ...\" (I closed the door (in order to) block out any noise).\n*As a modifier of a noun or adjective. This may relate to the meaning of the noun or adjective (\"a request to see someone\"; \"keen to get on\"), or it may form a type of non-finite relative clause, like in \"the man to save us\"; \"the method to use\"; \"nice to listen to\".\n*In elliptical questions (direct or indirect): \"I don't know where to go.\"  After why the bare infinitive is used: \"Why reveal it?\"\n\nThe infinitive is also the usual dictionary form or citation form of a verb. The form listed in dictionaries is the bare infinitive, although the to-infinitive is often used in referring to verbs or in defining other verbs: \"The word 'amble' means 'to walk slowly'\"; \"How do we conjugate the verb to go?\"\n\nFor further detail and examples of the uses of infinitives in English, see Bare infinitive and To-infinitive in the article on uses of English verb forms.\n\nOther Germanic languages \n\nThe original Proto-Germanic ending of the infinitive was -an, with verbs derived from other words ending in -jan or -janan.\n\nIn German it is -en (\"sagen\"), with -eln or -ern endings on a few words based on -l or -r roots (\"segeln\", \"ändern\").  The use of zu with infinitives is similar to English to, but is less frequent than in English. German infinitives can form nouns, often expressing abstractions of the action, in which case they are of neuter gender: das Essen means the eating, but also the food.\n\nIn Dutch infinitives also end in -en (zeggen — to say), sometimes used with te similar to English to, e.g. \"Het is niet moeilijk te begrijpen\" → \"It is not hard to understand.\" The few verbs with stems ending in -a have infinitives in -n (gaan — to go, slaan — to hit). Afrikaans has lost the distinction between the infinitive and present forms of verbs, with the exception of the verbs \"wees\" (to be), which admits the present form \"is\", and the verb \"hê\" (to have), whose present form is \"het\".\n\nIn North Germanic languages the final -n was lost from the infinitive as early as 500–540 AD, reducing the suffix to -a. Later it has been further reduced to -e in Danish and some Norwegian dialects (including the written majority language bokmål). In the majority of Eastern Norwegian dialects and a few bordering Western Swedish dialects the reduction to -e was only partial, leaving some infinitives in -a and others in -e (å laga vs. å kaste). In northern parts of Norway the infinitive suffix is completely lost (å lag’ vs. å kast’) or only the -a is kept (å laga vs. å kast’). The infinitives of these languages are inflected for passive voice through the addition of -s or -st to the active form. This suffix appearance in Old Norse was a contraction of mik (“me”, forming -mk) or sik (reflexive pronoun, forming -sk) and was originally expressing reflexive actions: (hann) kallar (“(he) calls”) + -sik (“himself”) > (hann) kallask (“(he) calls himself”). The suffixes -mk and -sk later merged to -s, which evolved to -st in the western dialects. The loss or reduction of -a in active voice in Norwegian did not occur in the passive forms (-ast, -as), except for some dialects that have -es. The other North Germanic languages have the same vowel in both forms.\n\nLatin and Romance languages \n\nThe formation of the infinitive in the Romance languages reflects that in their ancestor, Latin, almost all verbs had an infinitive ending with -re (preceded by one of various thematic vowels). For example, in Italian infinitives end in -are, -ere, -rre (rare), or -ire (which is still identical to the Latin forms), and in -arsi, -ersi, -rsi, -irsi for the reflexive forms. In Spanish and Portuguese, infinitives end in -ar, -er, or -ir, while similarly in French they typically end in -re, -er, oir, and -ir. In Romanian, both short and long-form infinitives exist; the so-called \"long infinitives\" end in -are, -ere, -ire and in modern speech are used exclusively as verbal nouns. Verbs that cannot be converted into the nominal long infinitive are very rare). The \"short infinitives\" used in verbal contexts (e.g. after an auxiliary verb) have the endings -a,-ea, -e, and -i (basically removing the ending in \"-re\"). In Romanian, the infinitive is usually replaced by a clause containing the conjunction să plus the subjunctive mood. The only verb that is modal in common modern Romanian is the verb a putea, to be able to. However, in popular speech the infinitive after a putea is also increasingly replaced by the subjunctive.\n\nIn all Romance languages, infinitives can also form nouns.\n\nLatin infinitives challenged several of the generalizations about infinitives. They did inflect for voice (amare, \"to love\", amari, to be loved) and for tense (amare, \"to love\", amavisse, \"to have loved\"), and allowed for an overt expression of the subject (video Socratem currere, \"I see Socrates running\"). See .\n\nRomance languages inherited from Latin the possibility of an overt expression of the subject (as in Italian vedo Socrate correre). Moreover, the \"inflected infinitive\" (or \"personal infinitive\") found in Portuguese and Galician inflects for person and number. These are the only Indo-European languages that allow infinitives to take person and number endings. This helps to make infinitive clauses very common in these languages; for example, the English finite clause in order that you/she/we have... would be translated to Portuguese like para teres/ela ter/termos... (Portuguese is a null-subject language). The Portuguese personal infinitive has no proper tenses, only aspects (imperfect and perfect), but tenses can be expressed using periphrastic structures. For instance, even though you sing/have sung/are going to sing could be translated to apesar de cantares/teres cantado/ires cantar.\n\nOther Romance languages (including Spanish, Romanian, Catalan, and some Italian dialects) allow uninflected infinitives to combine with overt nominative subjects. For example, Spanish al abrir yo los ojos (\"when I opened my eyes\") or sin yo saberlo (\"without my knowing about it\").\n\nHellenic languages\n\nAncient Greek\n\nIn Ancient Greek the infinitive has four tenses (present, future, aorist, perfect) and three voices (active, middle, passive). Present and perfect have the same infinitive for both middle and passive, while future and aorist have separate middle and passive forms.\n\nThematic verbs form present active infinitives by adding to the stem the thematic vowel  and the infinitive ending , and contracts to , e.g. .  Athematic verbs, and perfect actives and aorist passives, add the suffix  instead, e.g. .  In the middle and passive, the present middle infinitive ending is , e.g.  and most tenses of thematic verbs add an additional  between the ending and the stem, e.g. .\n\nModern Greek\n\nThe infinitive per se does not exist in Modern Greek. To see this, consider the ancient Greek ἐθέλω γράφειν \"I want to write\". In modern Greek this become θέλω να γράψω \"I want that I write\". In modern Greek, the infinitive has thus changed form and function and is used mainly in the formation of periphrastic tense forms and not with an article or alone. Instead of the Ancient Greek infinitive system γράφειν, γράψειν, γράψαι, γεγραφέναι, Modern Greek uses only the form γράψει, a development of the ancient Greek aorist infinitive γράψαι. This form is also invariable. The modern Greek infinitive has only two forms according to voice: for example, γράψει for the active voice and γραφ(τ)εί for the passive voice (coming from the ancient passive aorist infinitive γραφῆναι).\n\nBalto-Slavic languages \n\nThe infinitive in Russian usually ends in -t’ (ть) preceded by a thematic vowel, or -ti (ти), if not preceded by one; some verbs have a stem ending in a consonant and change the t to č’, like *mogt’ → moč’ (*могть → мочь) \"can\". Some other Balto-Slavic languages have the infinitive typically ending in, for example, -ć (sometimes -c) in Polish, -t’ in Slovak, -t (formerly -ti) in Czech and Latvian (with a handful ending in -s on the latter), -ty (-ти) in Ukrainian, -ць (-ts) in Belarusian. Lithuanian infinitives end in -ti, Slovenian end on -ti or -či, and Croatian on -ti or -ći.\n\nSerbian officially retains infinitives -ti or -ći, but is more flexible than the other Slavs in breaking the infinitive through a clause. The infinitive nevertheless remains the dictionary form. \n\nBulgarian and Macedonian have lost the infinitive altogether except in a handful of frozen expressions where it is the same as the 3rd person singular aorist form. Almost all expressions where an infinitive may be used in Bulgarian are listed here; neverthess in all cases a subordinate clause is the more usual form. For that reason, the present first-person singular conjugation is the dictionary form in Bulgarian, while Macedonian uses the third person singular form of the verb in present tense.\n\nHebrew \n\nHebrew has two infinitives, the infinitive absolute and the infinitive construct. The infinitive construct is used after prepositions and is inflected with pronominal endings to indicate its subject or object: bikhtōbh hassōphēr \"when the scribe wrote\", ahare lekhtō \"after his going\". When the infinitive construct is preceded by  (lə-, li-, lā-, lo-) \"to\", it has a similar meaning to the English to-infinitive, and this is its most frequent use in Modern Hebrew. The infinitive absolute is used for verb focus and emphasis, like in  mōth yāmūth (literally \"a dying he will die\"; figuratively, \"he shall indeed/surely die\"). This usage is commonplace in the Bible, but in Modern Hebrew it is restricted to high-flown literary works.\n\nNote, however, that the to-infinitive of Hebrew is not the dictionary form; that is the third person singular perfect form.\n\nFinnish \n\nThe Finnish grammatical tradition includes many non-finite forms that are generally labeled as (numbered) infinitives although many of these are functionally converbs. To form the so-called first infinitive, the strong form of the root (without consonant gradation or epenthetic 'e') is used, and these changes occur:\n# the root is suffixed with -ta/-tä according to vowel harmony\n# consonant elision takes place if applicable, e.g. juoks+ta → juosta\n# assimilation of clusters violating sonority hierarchy if applicable, e.g. nuol+ta → nuolla, sur+ta → surra\n# 't' weakens to 'd' after diphthongs, e.g. juo+ta → juoda\n# 't' elides if intervocalic, e.g. kirjoitta+ta → kirjoittaa\n\nAs such, it is inconvenient for dictionary use, because the imperative would be closer to the root word. Nevertheless, dictionaries use the first infinitive.\n\nThere are also four other infinitives, plus a \"long\" form of the first:\n* The long first infinitive is -kse- and must have a personal suffix appended to it. It has the general meaning of \"in order to [do something], e.g. kirjoittaakseni \"in order for me to write [something]\".\n* The second infinitive is formed by replacing the final -a/-ä of the first infinitive with e. It can take the inessive and instructive cases to create forms like kirjoittaessa \"while writing\".\n* The third infinitive is formed by adding -ma to the first infinitive, which alone creates an \"agent\" form: kirjoita- becomes kirjoittama. The third infinitive is technically a noun (denoting the act of performing some verb), so case suffixes identical to those attached to ordinary Finnish nouns allow for other expressions using the third infinitive, e.g. kirjoittamalla \"by writing\".\n** A personal suffix can then be added to this form to indicate the \"agent participle\", such that kirjoittamani kirja = \"the book which I wrote\".\n* The fourth infinitive adds -minen to the first, forming a noun which has the connotation of \"the process of [doing something]\", e.g. kirjoittaminen \"[the process of] writing\". It, too, can be inflected like other Finnish nouns which end in -nen.\n* The fifth infinitive adds -maisilla- to the first, and like the long first infinitive, must take a possessive suffix. It has to do with being \"about to [do something]\" and may also imply that the act was cut off or interrupted, e.g. kirjoittamaisillasi \"you were about to write [but something interrupted you]\". This form is more commonly replaced by the third infinitive in adessive case, usually also with a possessive suffix (thus kirjoittamallasi).\nNote that all of these must change to reflect vowel harmony, so the fifth infinitive (with a third-person suffix) of hypätä \"jump\" is hyppäämäisillään \"he was about to jump\", not *hyppäämaisillaan.\n\nSeri \n\nThe Seri language of northwestern Mexico has infinitival forms which are used in two constructions (with the verb meaning 'want' and with the verb meaning 'be able'). The infinitive is formed by adding a prefix to the stem: either iha- (plus a vowel change of certain vowel-initial stems) if the complement clause is transitive, or ica- (and no vowel change) if the complement clause is intransitive. The infinitive shows agreement in number with the controlling subject. Examples are: icatax ihmiimzo 'I want to go', where icatax is the singular infinitive of the verb 'go' (singular root is -atax), and icalx hamiimcajc 'we want to go', where icalx is the plural infinitive. Examples of the transitive infinitive: ihaho 'to see it/him/her/them' (root -aho), and ihacta 'to look at it/him/her/them' (root -oocta).\n\nTranslation to languages without an infinitive \n\nIn languages without an infinitive, the infinitive is translated either as a that-clause or as a verbal noun. For example, in Literary Arabic the sentence \"I want to write a book\" is translated as either urīdu an aktuba kitāban (lit. \"I want that I write a book\", with a verb in the subjunctive mood) or urīdu kitābata kitābin (lit. \"I want the writing of a book\", with the masdar or verbal noun), and in Levantine Colloquial Arabic biddi aktub kitāb (subordinate clause with verb in subjunctive).\n\nEven in languages that have infinitives, similar constructions are sometimes necessary where English would allow the infinitive. For example, in French the sentence \"I want you to come\" translates to Je veux que vous veniez (lit. \"I want that you come\", with come being in the subjunctive mood).  However, \"I want to come\" is simply Je veux venir, using the infinitive, just as in English. In Russian, sentences such as \"I want you to leave\" do not use an infinitive. Rather, they use the conjunction чтобы \"in order to/so that\" with the past tense form (most probably remnant of subjunctive) of the verb: Я хочу, чтобы вы ушли (literally, \"I want so that you left\"). Infinitive. http://en.wikipedia.org/?curid=15254."
  }
}
