{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8815",
  "eid" : "ea9b5ea0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778473354,
  "textBody" : "In geometry, any polyhedron is associated with a second dual figure, where the vertices of one correspond to the faces of the other and the edges between pairs of vertices of one correspond to the edges between pairs of faces of the other., \"Basic notions about stellation and duality\", p. 1. Such dual figures remain combinatorial or abstract polyhedra, but not all are also geometric polyhedra. Starting with any given polyhedron, the dual of its dual is the original polyhedron.\n\nDuality preserves the symmetries of a polyhedron. Therefore, for many classes of polyhedra defined by their symmetries, the duals also belong to a symmetric class. Thus, the regular polyhedrathe (convex) Platonic solids and (star) Kepler-Poinsot polyhedraform dual pairs, where the regular tetrahedron is self-dual.  The dual of an isogonal polyhedron, having equivalent vertices, is one which is isohedral, having equivalent faces. The dual of an  isotoxal polyhedron (having equivalent edges) is also isotoxal.\n\nDuality is closely related to reciprocity or polarity, a geometric transformation that, when applied to a convex polyhedron, realizes the dual polyhedron as another convex polyhedron.\n\nKinds of duality\n\nThere are many kinds of duality. The kinds most relevant to elementary polyhedra are polar reciprocity and topological or abstract duality.\n\nPolar reciprocation\n\nThe duality of polyhedra is often defined in terms of polar reciprocation about a concentric sphere. Here, each vertex (pole) is associated with a face plane (polar plane or just polar) so that the ray from the center to the vertex is perpendicular to the plane, and the product of the distances from the center to each is equal to the square of the radius., 3.2 Duality, pp. 78–79; , Pages 3-5. (Note, Wenninger's discussion includes nonconvex polyhedra.) In coordinates, for reciprocation about the sphere\n\nx^2 + y^2 + z^2 = r^2,\n\nthe vertex\n\n(x_0, y_0, z_0)\n\nis associated with the plane\n\nx_0x + y_0y + z_0z = r^2.\n\nThe vertices of the dual are the poles reciprocal to the face planes of the original, and the faces of the dual lie in the polars reciprocal to the vertices of the original. Also, any two adjacent vertices define an edge, and these will reciprocate to two adjacent faces which intersect to define an edge of the dual. This dual pair of edges are always orthogonal (at right angles) to each other.\n\nIf r_0 is the radius of the sphere, and r_1 and r_2 respectively the distances from its centre to the pole and its polar, then:\n\nr_1 . r_2 = r_0^2\n\nFor the more symmetrical polyhedra having an obvious centroid, it is common to make the polyhedron and sphere concentric, as in the Dorman Luke construction described below.\n\nHowever, it is possible to reciprocate a polyhedron about any sphere, and the resulting form of the dual will depend on the size and position of the sphere; as the sphere is varied, so too is the dual form. The choice of center for the sphere is sufficient to define the dual up to similarity. If multiple symmetry axes are present, they will necessarily intersect at a single point, and this is usually taken to be the centroid.  Failing that, a circumscribed sphere, inscribed sphere, or midsphere (one with all edges as tangents) is commonly used.\n\nIf a polyhedron in Euclidean space has an element passing through the center of the sphere, the corresponding element of its dual will go to infinity. Since Euclidean space never reaches infinity, the projective equivalent, called extended Euclidean space, may be formed by adding the required 'plane at infinity'. Some theorists prefer to stick to Euclidean space and say that there is no dual. Meanwhile,  found a way to represent these infinite duals, in a manner suitable for making  models (of some finite portion!).\n\nThe concept of duality here is closely related to the duality in projective geometry, where lines and edges are interchanged. Projective polarity works well enough for convex polyhedra. But for non-convex figures such as star polyhedra, when we seek to rigorously define this form of polyhedral duality in terms of projective polarity, various problems appear.See for example , and .  also discusses some issues on the way to deriving his infinite duals. \nBecause of the definitional issues for geometric duality of non-convex polyhedra,  argues that any proper definition of a non-convex polyhedron should include a notion of a dual polyhedron.\n\nCanonical duals\n\nAny convex polyhedron can be distorted into a canonical form, in which a unit midsphere (or intersphere) exists tangent to every edge, and such that the average position of the points of tangency is the center of the sphere. This form is unique up to congruences.\n\nIf we reciprocate such a canonical polyhedron about its midsphere, the dual polyhedron will share the same edge-tangency points and so must also be canonical. It is the canonical dual, and the two together form a canonical dual pair., Theorem 3.1, p. 449.\n\nTopological duality\n\nEven when a pair of polyhedra cannot be obtained by reciprocation from each other, they may be called duals of each other as long as the vertices of one correspond to the faces of the other, and the edges of one correspond to the edges of the other, in an incidence-preserving way. Such pairs of polyhedra are still topologically or abstractly dual.\n\nThe vertices and edges of a convex polyhedron form a graph (the 1-skeleton of the polyhedron), embedded on a topological sphere, the surface of the polyhedron.\nThe same graph can be projected to form a Schlegel diagram on a flat plane. The graph formed by the edges and vertices of the dual polyhedron is its dual graph. More generally, for any polyhedron whose faces form a closed surface, the vertices and edges of the polyhedron form a graph embedded on this surface, and the vertices and edges of the (abstract) dual polyhedron form the dual graph.\n\nAn abstract polyhedron is a certain kind of partially ordered set (poset) of elements, such that adjacencies, or connections, between elements of the set correspond to adjacencies between elements (faces, edges, etc.) of a polyhedron. Every such poset has a dual poset, formed by reversing all of the order relations. If the poset is visualized as a Hasse diagram, the dual poset may be visualized simply by turning the Hasse diagram upside down.\nEvery geometric polyhedron corresponds to an abstract polyhedron in this way, and has an abstract dual polyhedron. However, for some types of non-convex geometric polyhedron, the dual polyhedron may not be realized geometrically.\n\nDorman Luke construction\n\nFor a uniform polyhedron, the face of the dual polyhedron may be found from the original polyhedron's vertex figure using the Dorman Luke construction., p.  117; , p. 30.\n\nAs an example, the illustration below shows the vertex figure (red) of the cuboctahedron being used to derive a face (blue) of the rhombic dodecahedron.\n\nBefore beginning the construction, the vertex figure ABCD is obtained by cutting each connected edge at (in this case) its midpoint.\n\nDorman Luke's construction then proceeds:\n\n#Draw the vertex figure ABCD\n#Draw the circumcircle (tangent to every corner A, B, C and D).\n#Draw lines tangent to the circumcircle at each corner A, B, C, D.\n#Mark the points E, F, G, H, where each tangent line meets the adjacent tangent.\n#The polygon EFGH is a face of the dual polyhedron.\n\nIn this example the size of the vertex figure was chosen so that its circumcircle lies on the intersphere of the cuboctahedron, which also becomes the intersphere of the dual rhombic dodecahedron.\n\nDorman Luke's construction can only be used where a polyhedron has such an intersphere and the vertex figure is cyclic. For instance, it can be applied to the uniform polyhedra.\n\nSelf-dual polyhedra\n\nTopologically, a self-dual polyhedron is one whose dual has exactly the same connectivity between vertices, edges and faces. Abstractly, they have the same Hasse diagram.\n \nA geometrically self-dual polyhedron is not only topologically self-dual, but its polar reciprocal about a certain point, typically its centroid, is a similar figure. For example, the dual of a regular tetrahedron is another regular tetrahedron, reflected through the origin.\n\nEvery polygon is topologically self-dual (it has the same number of vertices as edges, and these are switched by duality), but will not in general be geometrically self-dual (up to rigid motion, for instance). Every polygon has a regular form which is geometrically self-dual about its intersphere: all angles are congruent, as are all edges, so under duality these congruences swap.\n\nSimilarly, every topologically self-dual convex polyhedron can be realized by an equivalent geometrically self-dual polyhedron, its canonical polyhedron, reciprocal about the center of the midsphere.\n\nThere are infinitely many geometrically self-dual polyhedra. The simplest infinite family are the canonical pyramids of n sides. Another infinite family, elongated pyramids, consists of polyhedra that can be roughly described as a pyramid sitting on top of a prism (with the same number of sides). Adding a frustum (pyramid with the top cut off) below the prism generates another infinite family, and so on.\n\nThere are many other convex, self-dual polyhedra. For example, there are 6 different ones with 7 vertices, and 16 with 8 vertices.3D Java models at [http://dmccooey.com/polyhedra/SymmetricSelfDuals.html Symmetries of Canonical Self-Dual Polyhedra], based on paper by Gunnar Brinkmann, Brendan D. McKay, Fast generation of planar graphs PDF [http://cs.anu.edu.au/~bdm/papers/plantri-full.pdf]\n\nA self-dual non-convex icosahedron with hexagonal faces was identified by Brückner in 1900.Anthony M. Cutler and Egon Schulte; \"Regular Polyhedra of Index Two\", I; Beiträge zur Algebra und Geometrie / Contributions to Algebra and Geometry April 2011, Volume 52, Issue 1, pp 133–161.N. J. Bridge; \"Faceting the Dodecahedron\", Acta Crystallographica, Vol. A 30, Part 4 July 1974, Fig. 3c and accompanying text.Brückner, M.; Velecke und Vielflache: Theorie und Geschichte, Teubner, Leipzig, 1900. Other non-convex self-dual polyhedra have been found, under certain definitions of non-convex polyhedra and their duals.\n\nSelf-dual compound polyhedra\n\nTrivially, the compound of any polyhedron and its dual is a self-dual figure.\n\nIf a polyhedron is self-dual, then the compound of the polyhedron with its dual will comprise congruent polyhedra. The regular compound of two tetrahedra, known as the Stella octangula, is the only regular compound with this property.\n\nDual polytopes and tessellations\n\nDuality can be generalized to n-dimensional space and dual polytopes; in two dimension these are called dual polygons.\n\nThe vertices of one polytope correspond to the (n − 1)-dimensional elements, or facets, of the other, and the j points that define a (j − 1)-dimensional element will correspond to j hyperplanes that intersect to give a (n − j)-dimensional element. The dual of an n-dimensional tessellation or honeycomb can be defined similarly.\n\nIn general, the facets of a polytope's dual will be the topological duals of the polytope's vertex figures. For the polar reciprocals of the regular and uniform polytopes, the dual facets will be polar reciprocals of the original's vertex figure. For example, in four dimensions, the vertex figure of the 600-cell is the icosahedron;  the dual of the 600-cell is the 120-cell, whose facets are dodecahedra, which are the dual of the icosahedron.\n\nSelf-dual polytopes and tessellations\n\nThe primary class of self-dual polytopes are regular polytopes with palindromic Schläfli symbols. All regular polygons, {a} are self-dual, polyhedra of the form {a,a}, 4-polytopes of the form {a,b,a}, 5-polytopes of the form {a,b,b,a}, etc.\n\nThe self-dual regular polytopes are:\n\n* All regular polygons, {a}.\n* Regular tetrahedron: {3,3}\n* In general, all regular n-simplexes, {3,3,...,3}\n* The regular 24-cell in 4 dimensions, {3,4,3}.\n* The great 120-cell {5,5/2,5} and the grand stellated 120-cell {5/2,5,5/2}\nThe self-dual (infinite) regular Euclidean honeycombs are:\n* Apeirogon: {∞}\n* Square tiling: {4,4}\n* Cubic honeycomb: {4,3,4}\n* In general, all regular n-dimensional Euclidean hypercubic honeycombs: {4,3,...,3,4}.\nThe self-dual (infinite) regular hyperbolic honeycombs are:\n* Compact hyperbolic tilings: {5,5}, {6,6}, ... {p,p}.\n* Paracompact hyperbolic tiling: {∞,∞}\n* Compact hyperbolic honeycombs: {3,5,3}, {5,3,5}, and {5,3,3,5}\n* Paracompact hyperbolic honeycombs: {3,6,3}, {6,3,6}, {4,4,4}, and {3,3,4,3,3}",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dual polyhedron" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8815" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In geometry, any polyhedron is associated with a second dual figure, where the vertices of one correspond to the faces of the other and the edges between pairs of vertices of one correspond to the edges between pairs of faces of the other., \"Basic notions about stellation and duality\", p. 1. Such dual figures remain combinatorial or abstract polyhedra, but not all are also geometric polyhedra. Starting with any given polyhedron, the dual of its dual is the original polyhedron.\n\nDuality preserves the symmetries of a polyhedron. Therefore, for many classes of polyhedra defined by their symmetries, the duals also belong to a symmetric class. Thus, the regular polyhedrathe (convex) Platonic solids and (star) Kepler-Poinsot polyhedraform dual pairs, where the regular tetrahedron is self-dual.  The dual of an isogonal polyhedron, having equivalent vertices, is one which is isohedral, having equivalent faces. The dual of an  isotoxal polyhedron (having equivalent edges) is also isotoxal.\n\nDuality is closely related to reciprocity or polarity, a geometric transformation that, when applied to a convex polyhedron, realizes the dual polyhedron as another convex polyhedron.\n\nKinds of duality\n\nThere are many kinds of duality. The kinds most relevant to elementary polyhedra are polar reciprocity and topological or abstract duality.\n\nPolar reciprocation\n\nThe duality of polyhedra is often defined in terms of polar reciprocation about a concentric sphere. Here, each vertex (pole) is associated with a face plane (polar plane or just polar) so that the ray from the center to the vertex is perpendicular to the plane, and the product of the distances from the center to each is equal to the square of the radius., 3.2 Duality, pp. 78–79; , Pages 3-5. (Note, Wenninger's discussion includes nonconvex polyhedra.) In coordinates, for reciprocation about the sphere\n\nx^2 + y^2 + z^2 = r^2,\n\nthe vertex\n\n(x_0, y_0, z_0)\n\nis associated with the plane\n\nx_0x + y_0y + z_0z = r^2.\n\nThe vertices of the dual are the poles reciprocal to the face planes of the original, and the faces of the dual lie in the polars reciprocal to the vertices of the original. Also, any two adjacent vertices define an edge, and these will reciprocate to two adjacent faces which intersect to define an edge of the dual. This dual pair of edges are always orthogonal (at right angles) to each other.\n\nIf r_0 is the radius of the sphere, and r_1 and r_2 respectively the distances from its centre to the pole and its polar, then:\n\nr_1 . r_2 = r_0^2\n\nFor the more symmetrical polyhedra having an obvious centroid, it is common to make the polyhedron and sphere concentric, as in the Dorman Luke construction described below.\n\nHowever, it is possible to reciprocate a polyhedron about any sphere, and the resulting form of the dual will depend on the size and position of the sphere; as the sphere is varied, so too is the dual form. The choice of center for the sphere is sufficient to define the dual up to similarity. If multiple symmetry axes are present, they will necessarily intersect at a single point, and this is usually taken to be the centroid.  Failing that, a circumscribed sphere, inscribed sphere, or midsphere (one with all edges as tangents) is commonly used.\n\nIf a polyhedron in Euclidean space has an element passing through the center of the sphere, the corresponding element of its dual will go to infinity. Since Euclidean space never reaches infinity, the projective equivalent, called extended Euclidean space, may be formed by adding the required 'plane at infinity'. Some theorists prefer to stick to Euclidean space and say that there is no dual. Meanwhile,  found a way to represent these infinite duals, in a manner suitable for making  models (of some finite portion!).\n\nThe concept of duality here is closely related to the duality in projective geometry, where lines and edges are interchanged. Projective polarity works well enough for convex polyhedra. But for non-convex figures such as star polyhedra, when we seek to rigorously define this form of polyhedral duality in terms of projective polarity, various problems appear.See for example , and .  also discusses some issues on the way to deriving his infinite duals. \nBecause of the definitional issues for geometric duality of non-convex polyhedra,  argues that any proper definition of a non-convex polyhedron should include a notion of a dual polyhedron.\n\nCanonical duals\n\nAny convex polyhedron can be distorted into a canonical form, in which a unit midsphere (or intersphere) exists tangent to every edge, and such that the average position of the points of tangency is the center of the sphere. This form is unique up to congruences.\n\nIf we reciprocate such a canonical polyhedron about its midsphere, the dual polyhedron will share the same edge-tangency points and so must also be canonical. It is the canonical dual, and the two together form a canonical dual pair., Theorem 3.1, p. 449.\n\nTopological duality\n\nEven when a pair of polyhedra cannot be obtained by reciprocation from each other, they may be called duals of each other as long as the vertices of one correspond to the faces of the other, and the edges of one correspond to the edges of the other, in an incidence-preserving way. Such pairs of polyhedra are still topologically or abstractly dual.\n\nThe vertices and edges of a convex polyhedron form a graph (the 1-skeleton of the polyhedron), embedded on a topological sphere, the surface of the polyhedron.\nThe same graph can be projected to form a Schlegel diagram on a flat plane. The graph formed by the edges and vertices of the dual polyhedron is its dual graph. More generally, for any polyhedron whose faces form a closed surface, the vertices and edges of the polyhedron form a graph embedded on this surface, and the vertices and edges of the (abstract) dual polyhedron form the dual graph.\n\nAn abstract polyhedron is a certain kind of partially ordered set (poset) of elements, such that adjacencies, or connections, between elements of the set correspond to adjacencies between elements (faces, edges, etc.) of a polyhedron. Every such poset has a dual poset, formed by reversing all of the order relations. If the poset is visualized as a Hasse diagram, the dual poset may be visualized simply by turning the Hasse diagram upside down.\nEvery geometric polyhedron corresponds to an abstract polyhedron in this way, and has an abstract dual polyhedron. However, for some types of non-convex geometric polyhedron, the dual polyhedron may not be realized geometrically.\n\nDorman Luke construction\n\nFor a uniform polyhedron, the face of the dual polyhedron may be found from the original polyhedron's vertex figure using the Dorman Luke construction., p.  117; , p. 30.\n\nAs an example, the illustration below shows the vertex figure (red) of the cuboctahedron being used to derive a face (blue) of the rhombic dodecahedron.\n\nBefore beginning the construction, the vertex figure ABCD is obtained by cutting each connected edge at (in this case) its midpoint.\n\nDorman Luke's construction then proceeds:\n\n#Draw the vertex figure ABCD\n#Draw the circumcircle (tangent to every corner A, B, C and D).\n#Draw lines tangent to the circumcircle at each corner A, B, C, D.\n#Mark the points E, F, G, H, where each tangent line meets the adjacent tangent.\n#The polygon EFGH is a face of the dual polyhedron.\n\nIn this example the size of the vertex figure was chosen so that its circumcircle lies on the intersphere of the cuboctahedron, which also becomes the intersphere of the dual rhombic dodecahedron.\n\nDorman Luke's construction can only be used where a polyhedron has such an intersphere and the vertex figure is cyclic. For instance, it can be applied to the uniform polyhedra.\n\nSelf-dual polyhedra\n\nTopologically, a self-dual polyhedron is one whose dual has exactly the same connectivity between vertices, edges and faces. Abstractly, they have the same Hasse diagram.\n \nA geometrically self-dual polyhedron is not only topologically self-dual, but its polar reciprocal about a certain point, typically its centroid, is a similar figure. For example, the dual of a regular tetrahedron is another regular tetrahedron, reflected through the origin.\n\nEvery polygon is topologically self-dual (it has the same number of vertices as edges, and these are switched by duality), but will not in general be geometrically self-dual (up to rigid motion, for instance). Every polygon has a regular form which is geometrically self-dual about its intersphere: all angles are congruent, as are all edges, so under duality these congruences swap.\n\nSimilarly, every topologically self-dual convex polyhedron can be realized by an equivalent geometrically self-dual polyhedron, its canonical polyhedron, reciprocal about the center of the midsphere.\n\nThere are infinitely many geometrically self-dual polyhedra. The simplest infinite family are the canonical pyramids of n sides. Another infinite family, elongated pyramids, consists of polyhedra that can be roughly described as a pyramid sitting on top of a prism (with the same number of sides). Adding a frustum (pyramid with the top cut off) below the prism generates another infinite family, and so on.\n\nThere are many other convex, self-dual polyhedra. For example, there are 6 different ones with 7 vertices, and 16 with 8 vertices.3D Java models at [http://dmccooey.com/polyhedra/SymmetricSelfDuals.html Symmetries of Canonical Self-Dual Polyhedra], based on paper by Gunnar Brinkmann, Brendan D. McKay, Fast generation of planar graphs PDF [http://cs.anu.edu.au/~bdm/papers/plantri-full.pdf]\n\nA self-dual non-convex icosahedron with hexagonal faces was identified by Brückner in 1900.Anthony M. Cutler and Egon Schulte; \"Regular Polyhedra of Index Two\", I; Beiträge zur Algebra und Geometrie / Contributions to Algebra and Geometry April 2011, Volume 52, Issue 1, pp 133–161.N. J. Bridge; \"Faceting the Dodecahedron\", Acta Crystallographica, Vol. A 30, Part 4 July 1974, Fig. 3c and accompanying text.Brückner, M.; Velecke und Vielflache: Theorie und Geschichte, Teubner, Leipzig, 1900. Other non-convex self-dual polyhedra have been found, under certain definitions of non-convex polyhedra and their duals.\n\nSelf-dual compound polyhedra\n\nTrivially, the compound of any polyhedron and its dual is a self-dual figure.\n\nIf a polyhedron is self-dual, then the compound of the polyhedron with its dual will comprise congruent polyhedra. The regular compound of two tetrahedra, known as the Stella octangula, is the only regular compound with this property.\n\nDual polytopes and tessellations\n\nDuality can be generalized to n-dimensional space and dual polytopes; in two dimension these are called dual polygons.\n\nThe vertices of one polytope correspond to the (n − 1)-dimensional elements, or facets, of the other, and the j points that define a (j − 1)-dimensional element will correspond to j hyperplanes that intersect to give a (n − j)-dimensional element. The dual of an n-dimensional tessellation or honeycomb can be defined similarly.\n\nIn general, the facets of a polytope's dual will be the topological duals of the polytope's vertex figures. For the polar reciprocals of the regular and uniform polytopes, the dual facets will be polar reciprocals of the original's vertex figure. For example, in four dimensions, the vertex figure of the 600-cell is the icosahedron;  the dual of the 600-cell is the 120-cell, whose facets are dodecahedra, which are the dual of the icosahedron.\n\nSelf-dual polytopes and tessellations\n\nThe primary class of self-dual polytopes are regular polytopes with palindromic Schläfli symbols. All regular polygons, {a} are self-dual, polyhedra of the form {a,a}, 4-polytopes of the form {a,b,a}, 5-polytopes of the form {a,b,b,a}, etc.\n\nThe self-dual regular polytopes are:\n\n* All regular polygons, {a}.\n* Regular tetrahedron: {3,3}\n* In general, all regular n-simplexes, {3,3,...,3}\n* The regular 24-cell in 4 dimensions, {3,4,3}.\n* The great 120-cell {5,5/2,5} and the grand stellated 120-cell {5/2,5,5/2}\nThe self-dual (infinite) regular Euclidean honeycombs are:\n* Apeirogon: {∞}\n* Square tiling: {4,4}\n* Cubic honeycomb: {4,3,4}\n* In general, all regular n-dimensional Euclidean hypercubic honeycombs: {4,3,...,3,4}.\nThe self-dual (infinite) regular hyperbolic honeycombs are:\n* Compact hyperbolic tilings: {5,5}, {6,6}, ... {p,p}.\n* Paracompact hyperbolic tiling: {∞,∞}\n* Compact hyperbolic honeycombs: {3,5,3}, {5,3,5}, and {5,3,3,5}\n* Paracompact hyperbolic honeycombs: {3,6,3}, {6,3,6}, {4,4,4}, and {3,3,4,3,3}. Dual polyhedron. http://en.wikipedia.org/?curid=8815."
  }
}
