{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8214",
  "eid" : "e65b9210-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778466225,
  "textBody" : "The decimal numeral system (also called base-ten positional numeral system, and occasionally called denary) is the standard system for denoting integer and non-integer numbers. It is the extension to non-integer numbers of the Hindu–Arabic numeral system.The History of Arithmetic, Louis Charles Karpinski, 200pp, Rand McNally & Company, 1925. The way of denoting numbers in the decimal system is often referred to as Decimal notation.Lam Lay Yong & Ang Tian Se (2004) Fleeting Footsteps. Tracing the Conception of Arithmetic and Algebra in Ancient China, Revised Edition, World Scientific, Singapore.\n\nA decimal numeral, or just decimal, or, improperly decimal number, refers generally to the notation of a number in the decimal system, which contains a decimal separator (for example 10.00 or 3.14159). Sometimes these terms are used for any numeral in the decimal system. A decimal may also refer to any digit after the decimal separator, such as in \"3.14 is the approximation of  to two decimals\".\n\nThe numbers that may be represented in the decimal system are the decimal fractions, that is the fractions of the form , where  is an integer, and  is a nonnegative integer.\n\nThe decimal system has been extended to infinite decimals, for representing any real number, by using an infinite sequence of digits after the decimal separator (see Decimal representation). In this context, the usual decimals are sometimes called terminating decimals. A repeating decimal, is an infinite decimal, that, after some place repeats indefinitely the same sequence of digits (for example ).The viniculum (overline) in 5.123144 indicates that the '144' sequence repeats itself indefinitely, i.e. . An infinite decimal represents a rational number if and only if it is a repeating decimal or is a finite decimal.\n\nOrigin\n\nMany numeral systems of ancient civilisations use ten and its powers for representing numbers, probably because there are ten fingers on two hands and people started counting by using their fingers.\nExamples are Brahmi numerals, Greek numerals, Hebrew numerals, Roman numerals, and Chinese numerals. Very large numbers were difficult to represent in these old numeral systems, and, only the best mathematicians were able to multiply or divide large numbers. These difficulties were completely solved with the introduction of the Hindu–Arabic numeral system for representing integers. This system has been extended to represent some non-integer numbers, called decimal fractions or decimal numbers for forming the decimal numeral system.\n\nDecimal notation \n\nFor writing numbers, the decimal system uses ten decimal digits, a decimal mark, and, for negative numbers, a minus sign \"–\". The decimal digits are 0, 1, 2, 3, 4, 5, 6, 7, 8, 9;In some countries, such as Arab speaking ones, other glyphs are used for the digits the decimal separator is the dot \"\" in many countries (including English speaking ones), but may be a comma \"\" in other countries (mainly in Europe).\n\nFor representing a nonnegative number, a decimal consists of\n* either a (finite) sequence of digits such as 2017, or in full generality,\n:a_ma_{m-1}\\ldots a_0\n(in this case, the (entire) decimal represents an integer)\n* or two sequence of digits separated by a decimal mark such as 3.14159, 15.00, or in full generality\n:a_ma_{m-1}\\ldots a_0.b_1b_2\\ldots b_n\nIt is generally assumed that, if , the first digit  is not zero, but, in some circumstances, it may be useful to have one or more 0's on the left. This does not change the value represented by the decimal. For example, . Similarly, if , it may be removed, and conversely, trailing zeros may be added without changing the represented number. For example,  and . sometimes, the unnecessary zeros are used for indicating the accuracy of a measure. For example, 15.00m may indicate that the measurement error is less than one centimeter, while 15m may mean that the length is roughly fifteen meters, and that the error may exceed 10 cm.\n\nFor representing a negative number, a minus sign is placed before .\n\nThe numeral a_ma_{m-1}\\ldots a_0.b_1b_2\\ldots b_n represents the number\na_m10^m+a_{m-1}10^{m-1}+\\cdots+a_{0}10^0+\\frac{b_1}{10^1}+\\frac{b_2}{10^2}+\\cdots+\\frac{b_n}{10^n}\nTherefore, the contribution of each digit to the value of a number depends on its position in the numeral. That is, the decimal system is a positional numeral system\n\nDecimal fractions \n\nThe numbers that are represented by decimal numeral are the decimal fractions (sometimes called decimal numbers), that is, the rational numbers that may be expressed as a fraction, the denominator of which is a power of ten. For example, the numerals 0.8, 14.89, 0.00024 represent the fractions , , . More generally, a decimal with  digits after the separator represents the fraction with denominator , whose numerator is the integer obtained by removing the separator.\n\nExpressed as a fully reduced fraction, the decimal numbers are those, whose denominator is a product of a power of 2 by a power of 5. Thus the smallest denominators of decimal numbers are\n12^0\\cdot 5^0, 2\n2^1\\cdot 5^0, 42^2\\cdot 5^0, 5\n2^0\\cdot 5^1, 82^3\\cdot 5^0, 10\n2^1\\cdot 5^1, 162^4\\cdot 5^0, 25\n2^0\\cdot 5^2, \\ldots\n\nThe integer part, or integral part of a decimal is the integer written to the left of the decimal separator (see also truncation). For a nonnegative decimal, it is the largest integer that is not greater than the decimal. The part from the decimal separator to the right is the fractional part, which equals the difference between the numeral and its integer part.\n\nWhen the integral part of a numeral is zero, it may occur, typically in computing, that the integer part is not written (for example , instead of ). In normal writing, this is generally avoided because of the risk of confusion between the decimal mark and other punctuation.\n\nReal number approximation\n\nDecimal numerals do not allow an exact representation for all real numbers, so e.g. for the real number pi|. Nevertheless, they allow approximating every real number with any desired accuracy, e.g., the decimal 3.14159 approximates the real , being less than 10-5 off; and so decimals are widely used in science, engineering and everyday life.\n\nMore precisely, for every real number x, and every positive integer n, there are two decimals l and u, with at most n digits after the decimal mark, such that l ≤ x ≤ u and (u – l) = 10-n.\n\nNumbers are very often obtained as the result of a measurement. As measurements are generally afflicted with some measurement error with a known upper bound, the result of a measurement is well represented by a decimal with  digits after the decimal mark, as soon as the absolute measurement error is bounded from above by 10-n. In practice, measurement results are often given with a certain number of digits after the decimal point, which indicate the error bounds. For example, although 0.080 and 0.08 denote the same decimal number, the numeral 0.080 is to suggest a measurement with an error less than 0.001, while the numeral 0.08 indicates an absolute error bounded by 0.01. In both cases, the true value of the measured quantity could be, for example, 0.0803 or 0.0796 (see also significant figures).\n\nInfinite decimal expansion\n\nFor a real number x, let us denote [x]n greatest decimal that is not greater than x, and has n digits after the decimal mark. If dn is the last digit of [x]n, it may be shown that [x]n may be obtained simply by writing dn on the right of [x]n–1. In other words, [x]n–1 and [x]n differ only by the last digit of [x]n, and one has\n[x]n = [x]0.d1d2...dn.\nOne may increase n indefinitely, and this is a direct consequence of the definition of a limit that x is the limit of [x]n when n tends to the infinity. This is written as\nx = [x]0.d1d2...dn...,\nand is called the infinite decimal expansion of x\n\nConversely, for any integer [x]0 and any infinite sequence of digits (dn), the infinite expression   is the infinite decimal expansion of a unique real number x, except if all dn equal 9 for n large enough.\n\nIf all dn equal 9 for n large enough, the limit of the sequence of the  is the decimal fraction obtained by replacing the last dn that is not a 9, by dn – 1, and replacing all subsequent 9 by 0 (see  0.999...).\n\nIn summary, every real number that is not a decimal fraction has a unique infinite decimal expansion. Decimal fractions have exactly two infinite decimal expansions, one containing only 0 after some place, which is obtained by the above definition of [x]n, and the other containing only 9 after some place, which is obtained by replacing \"not greater\" by \"less\" in the definition of [x]n.\n\nRational numbers \n\nThe long division allows computing the infinite decimal expansion of a rational number. If the rational number is a decimal fraction, the division stops eventually, producing a decimal numeral, which may be prolongated into an infinite expansion by adding infinitely many 0. If the rational number is not a decimal fraction, the division may continue indefinitely. However, as all successive remainder are less than the divisor, there are only a finite number of possible remainders, and after some place, the same sequence of digits must be repeated indefinitely in the quotient. That is, one has a repeating decimal. For example,\n= 0.012345679012... (with 012345679 repeating).\n\nConversely, every eventually repeating sequence of digit is the infinite decimal expansion of a rational number. This is a consequence of the fact that the recurring part of a decimal representation is, in fact, an infinite geometric series which will sum to a rational number. For example,\n0.0123123123\\ldots \\frac{123}{10000} \\sum_{k\n0}^\\infty 0.001^k \\frac{123}{10000}\\ \\frac{1}{1-0.001} \n \\frac{123}{9990} = \\frac{41}{3330}\n\nDecimal computation \n\nModern computer hardware and software systems commonly use a binary representation internally (although many early computers, such as the ENIAC or the IBM 650, used decimal representation internally).Fingers or Fists? (The Choice of Decimal or Binary Representation), Werner Buchholz, Communications of the ACM, Vol. 2 #12, pp3–11, ACM Press, December 1959.\nFor external use by computer specialists, this binary representation is sometimes presented in the related octal or hexadecimal systems.\n\nFor most purposes, however, binary values are converted to or from the equivalent decimal values for presentation to or input from humans; computer programs express literals in decimal by default. (123.1, for example, is written as such in a computer program, even though many computer languages are unable to encode that number precisely.)\n\nBoth computer hardware and software also use internal representations which are effectively decimal for storing decimal values and doing arithmetic. Often this arithmetic is done on data which are encoded using some variant of binary-coded decimal, especially in database implementations, but there are other decimal representations in use (such as in the new IEEE 754 Standard for Floating-Point Arithmetic).Decimal Floating-Point: Algorism for Computers, Cowlishaw, M. F., Proceedings 16th IEEE Symposium on Computer Arithmetic, , pp104-111, IEEE Comp. Soc., June 2003\n\nDecimal arithmetic is used in computers so that decimal fractional results of adding (or subtracting) values with a fixed length of their fractional part always are computed to this same length of precision. This is especially important for financial calculations, e.g., requiring in their results integer multiples of the smallest currency unit for book keeping purposes. This is not possible in binary, because the negative powers of 10 have no finite binary fractional representation; and is generally impossible for multiplication (or division).[http://speleotrove.com/decimal/decifaq.html Decimal Arithmetic – FAQ][http://www.dec.usc.es/arith16/papers/paper-107.pdf Decimal Floating-Point: Algorism for Computers], Cowlishaw, M. F., Proceedings 16th IEEE Symposium on Computer Arithmetic ([http://www.dec.usc.es/arith16/ ARITH 16]), , pp. 104–111, IEEE Comp. Soc., June 2003 See Arbitrary-precision arithmetic for exact calculations.\n\nHistory \n\nMany ancient cultures calculated with numerals based on ten, sometimes argued due to human hands typically having ten digits. Egyptian hieroglyphs, in evidence since around 3000 BC, used a purely decimal system,Georges Ifrah: From One to Zero. A Universal History of Numbers, Penguin Books, 1988, , pp. 200–213 (Egyptian Numerals) just as the Cretan hieroglyphs (ca. 1625−1500 BC) of the Minoans whose numerals are closely based on the Egyptian model.Graham Flegg: Numbers: their history and meaning, Courier Dover Publications, 2002, , p. 50Georges Ifrah: From One to Zero. A Universal History of Numbers, Penguin Books, 1988, , pp. 213–218 (Cretan numerals) The decimal system was handed down to the consecutive Bronze Age cultures of Greece, including Linear A (ca. 18th century BC−1450 BC) and Linear B (ca. 1375−1200 BC) — the number system of classical Greece also used powers of ten, including, like the Roman numerals did, an intermediate base of 5.[http://www-gap.dcs.st-and.ac.uk/~history/HistTopics/Greek_numbers.html Greek numerals] Notably, the polymath Archimedes (ca. 287–212 BC) invented a decimal positional system in his Sand Reckoner which was based on 108 and later led the German mathematician Carl Friedrich Gauss to lament what heights science would have already reached in his days if Archimedes had fully realized the potential of his ingenious discovery.Menninger, Karl: Zahlwort und Ziffer. Eine Kulturgeschichte der Zahl, Vandenhoeck und Ruprecht, 3rd. ed., 1979, , pp. 150–153 The Hittites hieroglyphs (since 15th century BC), just like the Egyptian and early numerals in Greece, was strictly decimal.Georges Ifrah: From One to Zero. A Universal History of Numbers, Penguin Books, 1988, , pp. 218f. (The Hittite hieroglyphic system)\n\nSome ancient texts like the Vedas dating back to 1900–1700 BCE mention decimals and mathematical decimal fractions.\n\nThe Egyptian hieratic numerals, the Greek alphabet numerals, the Hebrew alphabet numerals, the Roman numerals, the Chinese numerals and early Indian Brahmi numerals are all non-positional decimal systems, and required large numbers of symbols. For instance, Egyptian numerals used different symbols for 10, 20, to 90, 100, 200, to 900, 1000, 2000, 3000, 4000, to 10,000.Lam Lay Yong et al. The Fleeting Footsteps pp 137–139\nThe world's earliest positional decimal system was the Chinese rod calculus.\n\nHistory of decimal fractions \n\nDecimal fractions were first developed and used by the Chinese in the end of 4th century BC, and then spread to the Middle East and from there to Europe. The written Chinese decimal fractions were non-positional. However, counting rod fractions were positional.Lam Lay Yong, \"The Development of Hindu–Arabic and Traditional Chinese Arithmetic\", Chinese Science, 1996 p38, Kurt Vogel notation\n\nQin Jiushao in his book Mathematical Treatise in Nine Sections (1247) denoted 0.96644 by\n\n::::\n::::     , meaning\n\n::::\n::::096644\nJean-Claude Martzloff, A History of Chinese Mathematics, Springer 1997  \n\nJ. Lennart Berggren notes that positional decimal fractions appear for the first time in a book by the Arab mathematician Abu'l-Hasan al-Uqlidisi written in the 10th century. The Jewish mathematician Immanuel Bonfils used decimal fractions around 1350, anticipating Simon Stevin, but did not develop any notation to represent them.Gandz, S.: The invention of the decimal fractions and the application of the exponential calculus by Immanuel Bonfils of Tarascon (c. 1350), Isis 25 (1936), 16–45. The Persian mathematician Jamshīd al-Kāshī claimed to have discovered decimal fractions himself in the 15th century. Al Khwarizmi introduced fraction to Islamic countries in the early 9th century, his fraction presentation was an exact copy of traditional Chinese mathematical fraction from Sunzi Suanjing. This form of fraction with numerator on top and denominator at bottom without a horizontal bar was also used by 10th century Abu'l-Hasan al-Uqlidisi and 15th century Jamshīd al-Kāshī's work \"Arithmetic Key\".Lam Lay Yong, \"A Chinese Genesis, Rewriting the history of our numeral system\", Archive for History of Exact Science 38: 101–108.\n\nA forerunner of modern European decimal notation was introduced by Simon Stevin in the 16th century.\n\nNatural languages \n\nThe ingenious method of expressing every possible number using a set of ten symbols emerged in India. Several Indian languages show a straightforward decimal system. Many Indo-Aryan and Dravidian languages have numbers between 10 and 20 expressed in a regular pattern of addition to 10.\n\nThe Hungarian language also uses a straightforward decimal system. All numbers between 10 and 20 are formed regularly (e.g. 11 is expressed as \"tizenegy\" literally \"one on ten\"), as with those between 20 and 100 (23 as \"huszonhárom\" = \"three on twenty\").\n\nA straightforward decimal rank system with a word for each order (10 , 100 , 1000 , 10,000 ), and in which 11 is expressed as ten-one and 23 as two-ten-three, and 89,345 is expressed as 8 (ten thousands)  9 (thousand)  3 (hundred)  4 (tens)  5 is found in Chinese, and in Vietnamese with a few irregularities.  Japanese, Korean, and Thai have imported the Chinese decimal system. Many other languages with a decimal system have special words for the numbers between 10 and 20, and decades. For example, in English 11 is  \"eleven\" not \"ten-one\" or \"one-teen\".\n\nIncan languages such as Quechua and Aymara have an almost straightforward decimal system, in which 11 is expressed as ten with one and 23 as two-ten with three.\n\nSome psychologists suggest irregularities of the English names of numerals may hinder children's counting ability.\n\nOther bases \n\nSome cultures do, or did, use other bases of numbers.\n* Pre-Columbian Mesoamerican cultures such as the Maya used a base-20 system (perhaps based on using all twenty fingers and toes).\n* The Yuki language in California and the Pamean languages in Mexico have octal (base-8) systems because the speakers count using the spaces between their fingers rather than the fingers themselves.\n* The existence of a non-decimal base in the earliest traces of the Germanic languages, is attested by the presence of words and glosses meaning that the count is in decimal (cognates to ten-count or tenty-wise), such would be expected if normal counting is not decimal, and unusual if it were...  Where this counting system is known, it is based on the long hundred of 120 in number, and a long thousand of 1200 in number. The descriptions like 'long' only appear after the small hundred of 100 in number appeared with the Christians. Gordon's [https://www.scribd.com/doc/49127454/Introduction-to-Old-Norse-by-E-V-Gordon Introduction to Old Norse] p 293, gives number names that belong to this system. An expression cognate to 'one hundred and eighty' is translated to 200, and the cognate to 'two hundred' is translated at 240. [http://ads.ahds.ac.uk/catalogue/adsdata/arch-352-1/dissemination/pdf/vol_123/123_395_418.pdf Goodare] details the use of the long hundred in Scotland in the Middle Ages, giving examples, calculations where the carry implies i C (i.e. one hundred) as 120, etc. That the general population were not alarmed to encounter such numbers suggests common enough use. It is also possible to avoid hundred-like numbers by using intermediate units, such as stones and pounds, rather than a long count of pounds. Goodare gives examples of numbers like vii score, where one avoids the hundred by using extended scores. There is also a paper by W.H. Stevenson, on 'Long Hundred and its uses in England'.  \n* Many or all of the Chumashan languages originally used a base-4 counting system, in which the names for numbers were structured according to multiples of 4 and 16.There is a surviving list of Ventureño language number words up to 32 written down by a Spanish priest ca. 1819. \"Chumashan Numerals\" by Madison S. Beeler, in Native American Mathematics, edited by Michael P. Closs (1986), .\n* Many languages use quinary (base-5) number systems, including Gumatj, Nunggubuyu, Kuurn Kopan NootDawson, J. \"[https://books.google.com/books?id\nOdEDAAAAMAAJ Australian Aborigines: The Languages and Customs of Several Tribes of Aborigines in the Western District of Victoria] (1881), p. xcviii. and Saraveca. Of these, Gumatj is the only true 5–25 language known, in which 25 is the higher group of 5.\n* Some Nigerians use duodecimal systems.  So did some small communities in India and Nepal, as indicated by their languages.\n* The Huli language of Papua New Guinea is reported to have base-15 numbers.  Ngui means 15, ngui ki means 15 × 2 30, and ngui ngui means 15 × 15 \n 225.\n* Umbu-Ungu, also known as Kakoli, is reported to have base-24 numbers. Tokapu means 24, tokapu talu means 24 × 2 48, and tokapu tokapu means 24 × 24 \n 576.\n* Ngiti is reported to have a base-32 number system with base-4 cycles.\n* The Ndom language of Papua New Guinea is reported to have base-6 numerals.  Mer means 6, mer an thef means 6 × 2 12, nif means 36, and nif thef means 36×2 \n 72.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Decimal" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8214" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The decimal numeral system (also called base-ten positional numeral system, and occasionally called denary) is the standard system for denoting integer and non-integer numbers. It is the extension to non-integer numbers of the Hindu–Arabic numeral system.The History of Arithmetic, Louis Charles Karpinski, 200pp, Rand McNally & Company, 1925. The way of denoting numbers in the decimal system is often referred to as Decimal notation.Lam Lay Yong & Ang Tian Se (2004) Fleeting Footsteps. Tracing the Conception of Arithmetic and Algebra in Ancient China, Revised Edition, World Scientific, Singapore.\n\nA decimal numeral, or just decimal, or, improperly decimal number, refers generally to the notation of a number in the decimal system, which contains a decimal separator (for example 10.00 or 3.14159). Sometimes these terms are used for any numeral in the decimal system. A decimal may also refer to any digit after the decimal separator, such as in \"3.14 is the approximation of  to two decimals\".\n\nThe numbers that may be represented in the decimal system are the decimal fractions, that is the fractions of the form , where  is an integer, and  is a nonnegative integer.\n\nThe decimal system has been extended to infinite decimals, for representing any real number, by using an infinite sequence of digits after the decimal separator (see Decimal representation). In this context, the usual decimals are sometimes called terminating decimals. A repeating decimal, is an infinite decimal, that, after some place repeats indefinitely the same sequence of digits (for example ).The viniculum (overline) in 5.123144 indicates that the '144' sequence repeats itself indefinitely, i.e. . An infinite decimal represents a rational number if and only if it is a repeating decimal or is a finite decimal.\n\nOrigin\n\nMany numeral systems of ancient civilisations use ten and its powers for representing numbers, probably because there are ten fingers on two hands and people started counting by using their fingers.\nExamples are Brahmi numerals, Greek numerals, Hebrew numerals, Roman numerals, and Chinese numerals. Very large numbers were difficult to represent in these old numeral systems, and, only the best mathematicians were able to multiply or divide large numbers. These difficulties were completely solved with the introduction of the Hindu–Arabic numeral system for representing integers. This system has been extended to represent some non-integer numbers, called decimal fractions or decimal numbers for forming the decimal numeral system.\n\nDecimal notation \n\nFor writing numbers, the decimal system uses ten decimal digits, a decimal mark, and, for negative numbers, a minus sign \"–\". The decimal digits are 0, 1, 2, 3, 4, 5, 6, 7, 8, 9;In some countries, such as Arab speaking ones, other glyphs are used for the digits the decimal separator is the dot \"\" in many countries (including English speaking ones), but may be a comma \"\" in other countries (mainly in Europe).\n\nFor representing a nonnegative number, a decimal consists of\n* either a (finite) sequence of digits such as 2017, or in full generality,\n:a_ma_{m-1}\\ldots a_0\n(in this case, the (entire) decimal represents an integer)\n* or two sequence of digits separated by a decimal mark such as 3.14159, 15.00, or in full generality\n:a_ma_{m-1}\\ldots a_0.b_1b_2\\ldots b_n\nIt is generally assumed that, if , the first digit  is not zero, but, in some circumstances, it may be useful to have one or more 0's on the left. This does not change the value represented by the decimal. For example, . Similarly, if , it may be removed, and conversely, trailing zeros may be added without changing the represented number. For example,  and . sometimes, the unnecessary zeros are used for indicating the accuracy of a measure. For example, 15.00m may indicate that the measurement error is less than one centimeter, while 15m may mean that the length is roughly fifteen meters, and that the error may exceed 10 cm.\n\nFor representing a negative number, a minus sign is placed before .\n\nThe numeral a_ma_{m-1}\\ldots a_0.b_1b_2\\ldots b_n represents the number\na_m10^m+a_{m-1}10^{m-1}+\\cdots+a_{0}10^0+\\frac{b_1}{10^1}+\\frac{b_2}{10^2}+\\cdots+\\frac{b_n}{10^n}\nTherefore, the contribution of each digit to the value of a number depends on its position in the numeral. That is, the decimal system is a positional numeral system\n\nDecimal fractions \n\nThe numbers that are represented by decimal numeral are the decimal fractions (sometimes called decimal numbers), that is, the rational numbers that may be expressed as a fraction, the denominator of which is a power of ten. For example, the numerals 0.8, 14.89, 0.00024 represent the fractions , , . More generally, a decimal with  digits after the separator represents the fraction with denominator , whose numerator is the integer obtained by removing the separator.\n\nExpressed as a fully reduced fraction, the decimal numbers are those, whose denominator is a product of a power of 2 by a power of 5. Thus the smallest denominators of decimal numbers are\n12^0\\cdot 5^0, 2\n2^1\\cdot 5^0, 42^2\\cdot 5^0, 5\n2^0\\cdot 5^1, 82^3\\cdot 5^0, 10\n2^1\\cdot 5^1, 162^4\\cdot 5^0, 25\n2^0\\cdot 5^2, \\ldots\n\nThe integer part, or integral part of a decimal is the integer written to the left of the decimal separator (see also truncation). For a nonnegative decimal, it is the largest integer that is not greater than the decimal. The part from the decimal separator to the right is the fractional part, which equals the difference between the numeral and its integer part.\n\nWhen the integral part of a numeral is zero, it may occur, typically in computing, that the integer part is not written (for example , instead of ). In normal writing, this is generally avoided because of the risk of confusion between the decimal mark and other punctuation.\n\nReal number approximation\n\nDecimal numerals do not allow an exact representation for all real numbers, so e.g. for the real number pi|. Nevertheless, they allow approximating every real number with any desired accuracy, e.g., the decimal 3.14159 approximates the real , being less than 10-5 off; and so decimals are widely used in science, engineering and everyday life.\n\nMore precisely, for every real number x, and every positive integer n, there are two decimals l and u, with at most n digits after the decimal mark, such that l ≤ x ≤ u and (u – l) = 10-n.\n\nNumbers are very often obtained as the result of a measurement. As measurements are generally afflicted with some measurement error with a known upper bound, the result of a measurement is well represented by a decimal with  digits after the decimal mark, as soon as the absolute measurement error is bounded from above by 10-n. In practice, measurement results are often given with a certain number of digits after the decimal point, which indicate the error bounds. For example, although 0.080 and 0.08 denote the same decimal number, the numeral 0.080 is to suggest a measurement with an error less than 0.001, while the numeral 0.08 indicates an absolute error bounded by 0.01. In both cases, the true value of the measured quantity could be, for example, 0.0803 or 0.0796 (see also significant figures).\n\nInfinite decimal expansion\n\nFor a real number x, let us denote [x]n greatest decimal that is not greater than x, and has n digits after the decimal mark. If dn is the last digit of [x]n, it may be shown that [x]n may be obtained simply by writing dn on the right of [x]n–1. In other words, [x]n–1 and [x]n differ only by the last digit of [x]n, and one has\n[x]n = [x]0.d1d2...dn.\nOne may increase n indefinitely, and this is a direct consequence of the definition of a limit that x is the limit of [x]n when n tends to the infinity. This is written as\nx = [x]0.d1d2...dn...,\nand is called the infinite decimal expansion of x\n\nConversely, for any integer [x]0 and any infinite sequence of digits (dn), the infinite expression   is the infinite decimal expansion of a unique real number x, except if all dn equal 9 for n large enough.\n\nIf all dn equal 9 for n large enough, the limit of the sequence of the  is the decimal fraction obtained by replacing the last dn that is not a 9, by dn – 1, and replacing all subsequent 9 by 0 (see  0.999...).\n\nIn summary, every real number that is not a decimal fraction has a unique infinite decimal expansion. Decimal fractions have exactly two infinite decimal expansions, one containing only 0 after some place, which is obtained by the above definition of [x]n, and the other containing only 9 after some place, which is obtained by replacing \"not greater\" by \"less\" in the definition of [x]n.\n\nRational numbers \n\nThe long division allows computing the infinite decimal expansion of a rational number. If the rational number is a decimal fraction, the division stops eventually, producing a decimal numeral, which may be prolongated into an infinite expansion by adding infinitely many 0. If the rational number is not a decimal fraction, the division may continue indefinitely. However, as all successive remainder are less than the divisor, there are only a finite number of possible remainders, and after some place, the same sequence of digits must be repeated indefinitely in the quotient. That is, one has a repeating decimal. For example,\n= 0.012345679012... (with 012345679 repeating).\n\nConversely, every eventually repeating sequence of digit is the infinite decimal expansion of a rational number. This is a consequence of the fact that the recurring part of a decimal representation is, in fact, an infinite geometric series which will sum to a rational number. For example,\n0.0123123123\\ldots \\frac{123}{10000} \\sum_{k\n0}^\\infty 0.001^k \\frac{123}{10000}\\ \\frac{1}{1-0.001} \n \\frac{123}{9990} = \\frac{41}{3330}\n\nDecimal computation \n\nModern computer hardware and software systems commonly use a binary representation internally (although many early computers, such as the ENIAC or the IBM 650, used decimal representation internally).Fingers or Fists? (The Choice of Decimal or Binary Representation), Werner Buchholz, Communications of the ACM, Vol. 2 #12, pp3–11, ACM Press, December 1959.\nFor external use by computer specialists, this binary representation is sometimes presented in the related octal or hexadecimal systems.\n\nFor most purposes, however, binary values are converted to or from the equivalent decimal values for presentation to or input from humans; computer programs express literals in decimal by default. (123.1, for example, is written as such in a computer program, even though many computer languages are unable to encode that number precisely.)\n\nBoth computer hardware and software also use internal representations which are effectively decimal for storing decimal values and doing arithmetic. Often this arithmetic is done on data which are encoded using some variant of binary-coded decimal, especially in database implementations, but there are other decimal representations in use (such as in the new IEEE 754 Standard for Floating-Point Arithmetic).Decimal Floating-Point: Algorism for Computers, Cowlishaw, M. F., Proceedings 16th IEEE Symposium on Computer Arithmetic, , pp104-111, IEEE Comp. Soc., June 2003\n\nDecimal arithmetic is used in computers so that decimal fractional results of adding (or subtracting) values with a fixed length of their fractional part always are computed to this same length of precision. This is especially important for financial calculations, e.g., requiring in their results integer multiples of the smallest currency unit for book keeping purposes. This is not possible in binary, because the negative powers of 10 have no finite binary fractional representation; and is generally impossible for multiplication (or division).[http://speleotrove.com/decimal/decifaq.html Decimal Arithmetic – FAQ][http://www.dec.usc.es/arith16/papers/paper-107.pdf Decimal Floating-Point: Algorism for Computers], Cowlishaw, M. F., Proceedings 16th IEEE Symposium on Computer Arithmetic ([http://www.dec.usc.es/arith16/ ARITH 16]), , pp. 104–111, IEEE Comp. Soc., June 2003 See Arbitrary-precision arithmetic for exact calculations.\n\nHistory \n\nMany ancient cultures calculated with numerals based on ten, sometimes argued due to human hands typically having ten digits. Egyptian hieroglyphs, in evidence since around 3000 BC, used a purely decimal system,Georges Ifrah: From One to Zero. A Universal History of Numbers, Penguin Books, 1988, , pp. 200–213 (Egyptian Numerals) just as the Cretan hieroglyphs (ca. 1625−1500 BC) of the Minoans whose numerals are closely based on the Egyptian model.Graham Flegg: Numbers: their history and meaning, Courier Dover Publications, 2002, , p. 50Georges Ifrah: From One to Zero. A Universal History of Numbers, Penguin Books, 1988, , pp. 213–218 (Cretan numerals) The decimal system was handed down to the consecutive Bronze Age cultures of Greece, including Linear A (ca. 18th century BC−1450 BC) and Linear B (ca. 1375−1200 BC) — the number system of classical Greece also used powers of ten, including, like the Roman numerals did, an intermediate base of 5.[http://www-gap.dcs.st-and.ac.uk/~history/HistTopics/Greek_numbers.html Greek numerals] Notably, the polymath Archimedes (ca. 287–212 BC) invented a decimal positional system in his Sand Reckoner which was based on 108 and later led the German mathematician Carl Friedrich Gauss to lament what heights science would have already reached in his days if Archimedes had fully realized the potential of his ingenious discovery.Menninger, Karl: Zahlwort und Ziffer. Eine Kulturgeschichte der Zahl, Vandenhoeck und Ruprecht, 3rd. ed., 1979, , pp. 150–153 The Hittites hieroglyphs (since 15th century BC), just like the Egyptian and early numerals in Greece, was strictly decimal.Georges Ifrah: From One to Zero. A Universal History of Numbers, Penguin Books, 1988, , pp. 218f. (The Hittite hieroglyphic system)\n\nSome ancient texts like the Vedas dating back to 1900–1700 BCE mention decimals and mathematical decimal fractions.\n\nThe Egyptian hieratic numerals, the Greek alphabet numerals, the Hebrew alphabet numerals, the Roman numerals, the Chinese numerals and early Indian Brahmi numerals are all non-positional decimal systems, and required large numbers of symbols. For instance, Egyptian numerals used different symbols for 10, 20, to 90, 100, 200, to 900, 1000, 2000, 3000, 4000, to 10,000.Lam Lay Yong et al. The Fleeting Footsteps pp 137–139\nThe world's earliest positional decimal system was the Chinese rod calculus.\n\nHistory of decimal fractions \n\nDecimal fractions were first developed and used by the Chinese in the end of 4th century BC, and then spread to the Middle East and from there to Europe. The written Chinese decimal fractions were non-positional. However, counting rod fractions were positional.Lam Lay Yong, \"The Development of Hindu–Arabic and Traditional Chinese Arithmetic\", Chinese Science, 1996 p38, Kurt Vogel notation\n\nQin Jiushao in his book Mathematical Treatise in Nine Sections (1247) denoted 0.96644 by\n\n::::\n::::     , meaning\n\n::::\n::::096644\nJean-Claude Martzloff, A History of Chinese Mathematics, Springer 1997  \n\nJ. Lennart Berggren notes that positional decimal fractions appear for the first time in a book by the Arab mathematician Abu'l-Hasan al-Uqlidisi written in the 10th century. The Jewish mathematician Immanuel Bonfils used decimal fractions around 1350, anticipating Simon Stevin, but did not develop any notation to represent them.Gandz, S.: The invention of the decimal fractions and the application of the exponential calculus by Immanuel Bonfils of Tarascon (c. 1350), Isis 25 (1936), 16–45. The Persian mathematician Jamshīd al-Kāshī claimed to have discovered decimal fractions himself in the 15th century. Al Khwarizmi introduced fraction to Islamic countries in the early 9th century, his fraction presentation was an exact copy of traditional Chinese mathematical fraction from Sunzi Suanjing. This form of fraction with numerator on top and denominator at bottom without a horizontal bar was also used by 10th century Abu'l-Hasan al-Uqlidisi and 15th century Jamshīd al-Kāshī's work \"Arithmetic Key\".Lam Lay Yong, \"A Chinese Genesis, Rewriting the history of our numeral system\", Archive for History of Exact Science 38: 101–108.\n\nA forerunner of modern European decimal notation was introduced by Simon Stevin in the 16th century.\n\nNatural languages \n\nThe ingenious method of expressing every possible number using a set of ten symbols emerged in India. Several Indian languages show a straightforward decimal system. Many Indo-Aryan and Dravidian languages have numbers between 10 and 20 expressed in a regular pattern of addition to 10.\n\nThe Hungarian language also uses a straightforward decimal system. All numbers between 10 and 20 are formed regularly (e.g. 11 is expressed as \"tizenegy\" literally \"one on ten\"), as with those between 20 and 100 (23 as \"huszonhárom\" = \"three on twenty\").\n\nA straightforward decimal rank system with a word for each order (10 , 100 , 1000 , 10,000 ), and in which 11 is expressed as ten-one and 23 as two-ten-three, and 89,345 is expressed as 8 (ten thousands)  9 (thousand)  3 (hundred)  4 (tens)  5 is found in Chinese, and in Vietnamese with a few irregularities.  Japanese, Korean, and Thai have imported the Chinese decimal system. Many other languages with a decimal system have special words for the numbers between 10 and 20, and decades. For example, in English 11 is  \"eleven\" not \"ten-one\" or \"one-teen\".\n\nIncan languages such as Quechua and Aymara have an almost straightforward decimal system, in which 11 is expressed as ten with one and 23 as two-ten with three.\n\nSome psychologists suggest irregularities of the English names of numerals may hinder children's counting ability.\n\nOther bases \n\nSome cultures do, or did, use other bases of numbers.\n* Pre-Columbian Mesoamerican cultures such as the Maya used a base-20 system (perhaps based on using all twenty fingers and toes).\n* The Yuki language in California and the Pamean languages in Mexico have octal (base-8) systems because the speakers count using the spaces between their fingers rather than the fingers themselves.\n* The existence of a non-decimal base in the earliest traces of the Germanic languages, is attested by the presence of words and glosses meaning that the count is in decimal (cognates to ten-count or tenty-wise), such would be expected if normal counting is not decimal, and unusual if it were...  Where this counting system is known, it is based on the long hundred of 120 in number, and a long thousand of 1200 in number. The descriptions like 'long' only appear after the small hundred of 100 in number appeared with the Christians. Gordon's [https://www.scribd.com/doc/49127454/Introduction-to-Old-Norse-by-E-V-Gordon Introduction to Old Norse] p 293, gives number names that belong to this system. An expression cognate to 'one hundred and eighty' is translated to 200, and the cognate to 'two hundred' is translated at 240. [http://ads.ahds.ac.uk/catalogue/adsdata/arch-352-1/dissemination/pdf/vol_123/123_395_418.pdf Goodare] details the use of the long hundred in Scotland in the Middle Ages, giving examples, calculations where the carry implies i C (i.e. one hundred) as 120, etc. That the general population were not alarmed to encounter such numbers suggests common enough use. It is also possible to avoid hundred-like numbers by using intermediate units, such as stones and pounds, rather than a long count of pounds. Goodare gives examples of numbers like vii score, where one avoids the hundred by using extended scores. There is also a paper by W.H. Stevenson, on 'Long Hundred and its uses in England'.  \n* Many or all of the Chumashan languages originally used a base-4 counting system, in which the names for numbers were structured according to multiples of 4 and 16.There is a surviving list of Ventureño language number words up to 32 written down by a Spanish priest ca. 1819. \"Chumashan Numerals\" by Madison S. Beeler, in Native American Mathematics, edited by Michael P. Closs (1986), .\n* Many languages use quinary (base-5) number systems, including Gumatj, Nunggubuyu, Kuurn Kopan NootDawson, J. \"[https://books.google.com/books?id\nOdEDAAAAMAAJ Australian Aborigines: The Languages and Customs of Several Tribes of Aborigines in the Western District of Victoria] (1881), p. xcviii. and Saraveca. Of these, Gumatj is the only true 5–25 language known, in which 25 is the higher group of 5.\n* Some Nigerians use duodecimal systems.  So did some small communities in India and Nepal, as indicated by their languages.\n* The Huli language of Papua New Guinea is reported to have base-15 numbers.  Ngui means 15, ngui ki means 15 × 2 30, and ngui ngui means 15 × 15 \n 225.\n* Umbu-Ungu, also known as Kakoli, is reported to have base-24 numbers. Tokapu means 24, tokapu talu means 24 × 2 48, and tokapu tokapu means 24 × 24 \n 576.\n* Ngiti is reported to have a base-32 number system with base-4 cycles.\n* The Ndom language of Papua New Guinea is reported to have base-6 numerals.  Mer means 6, mer an thef means 6 × 2 12, nif means 36, and nif thef means 36×2 \n 72. Decimal. http://en.wikipedia.org/?curid=8214."
  }
}
