{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8781",
  "eid" : "ea4e9e30-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778472851,
  "textBody" : "Dorothy Parker (August 22, 1893 – June 7, 1967) was an American poet, writer, critic, and satirist, best known for her wit, wisecracks and eye for 20th-century urban foibles.\n\nFrom a conflicted and unhappy childhood, Parker rose to acclaim, both for her literary output in publications such as The New Yorker and as a founding member of the Algonquin Round Table. Following the breakup of the circle, Parker traveled to Hollywood to pursue screenwriting. Her successes there, including two Academy Award nominations, were curtailed when her involvement in left-wing politics led to a place on the Hollywood blacklist.\n\nDismissive of her own talents, she deplored her reputation as a \"wisecracker.\" Nevertheless, both her literary output and reputation for sharp wit have endured.\n\nEarly life and education\n\nAlso known as Dot or Dottie, Parker was born Dorothy Rothschild to Jacob Henry and Eliza Annie Rothschild (née Marston)Meade 6 at 732 Ocean Avenue in Long Branch, New Jersey, where her parents had a summer beach cottage. Dorothy's mother was of Scottish descent, and her father was of German Jewish descent. Parker wrote in her essay \"My Hometown\" that her parents got her back to their Manhattan apartment shortly after Labor Day so she could be called a true New Yorker. Her mother died in West End in July 1898, when Parker was a month shy of turning five.Meade 12 Her father remarried in 1900 to a woman named Eleanor Francis Lewis.Meade 13 Parker hated her father, whom she accused of physical abuse; and likewise despised her stepmother, whom she refused to call \"mother\", \"stepmother\", or even \"Eleanor\", instead referring to her as \"the housekeeper\". She grew up on the Upper West Side and attended a Roman Catholic elementary school at the Convent of the Blessed Sacrament on West 79th Street with sister Helen, despite having a Jewish father and Protestant stepmother.Meade 14 (Mercedes de Acosta was a classmate.) Parker once joked that she was asked to leave following her characterization of the Immaculate Conception as \"spontaneous combustion\".  Her stepmother died in 1903, when Parker was nine.Meade 16 Parker later went to Miss Dana's School, a finishing school in Morristown, New Jersey.Meade 27 She graduated from Miss Dana's School in 1911, at the age of 18. Following her father's death in 1913, she played piano at a dancing school to earn a living while she worked on her verse.\n\nShe sold her first poem to Vanity Fair magazine in 1914 and some months later was hired as an editorial assistant for another Condé Nast magazine, Vogue. She moved to Vanity Fair as a staff writer after two years at Vogue.Silverstein 13\n\nIn 1917, she met and married a Wall Street stockbroker, Edwin Pond Parker IIHerrmann 78\n(1893–1933), but they were separated by his army service in World War I. She had ambivalent feelings about her Jewish heritage given the strong antisemitism of that era and joked that she married to escape her name.\n\nAlgonquin Round Table years\n\nHer career took off while she was writing theatre criticism for Vanity Fair, which she began to do in 1918 as a stand-in for the vacationing P. G. Wodehouse.Silverstein 18 At the magazine, she met Robert Benchley, who became a close friend, and Robert E. Sherwood. The trio began lunching at the Algonquin Hotel on a near-daily basis and became founding members of the Algonquin Round Table. The Round Table numbered among its members the newspaper columnists Franklin Pierce Adams and Alexander Woollcott. Through their re-printing of her lunchtime remarks and short verses, particularly in Adams' column \"The Conning Tower\", Dorothy began developing a national reputation as a wit. One of her most famous comments was made when the group was informed that famously taciturn former president Calvin Coolidge had died; Parker remarked, \"How could they tell?\"\n\nParker's caustic wit as a critic initially proved popular, but she was eventually terminated by Vanity Fair in 1920 after her criticisms began to offend powerful producers too often. In solidarity, both Benchley and Sherwood resigned in protest.Altman 156–8\n\nWhen Harold Ross founded The New Yorker in 1925, Parker and Benchley were part of a \"board of editors\" established by Ross to allay concerns of his investors. Parker's first piece for the magazine appeared in its second issue.Silverstein 32 Parker became famous for her short, viciously humorous poems, many about the perceived ludicrousness of her many (largely unsuccessful) romantic affairs and others wistfully considering the appeal of suicide.\n\nThe next 15 years were Parker's greatest period of productivity and success. In the 1920s alone she published some 300 poems and free verses in Vanity Fair, Vogue, \"The Conning Tower\" and The New Yorker as well as Life, McCall's and The New Republic.Silverstein 62–3\n\nParker published her first volume of poetry, Enough Rope, in 1926. The collection sold 47,000 copiesSilverstein 35 and garnered impressive reviews. The Nation described her verse as \"caked with a salty humor, rough with splinters of disillusion, and tarred with a bright black authenticity\".Meade 177 Although some critics, notably the New York Times reviewer, dismissed her work as \"flapper verse\",Meade 178 the volume helped cement Parker's reputation for sparkling wit. Parker released two more volumes of verse, Sunset Gun (1928) and Death and Taxes (1931), along with the short story collections Laments for the Living (1930) and After Such Pleasures (1933). Not So Deep as a Well (1936) collected much of the material previously published in Rope, Gun and Death and she re-released her fiction with a few new pieces in 1939 under the title Here Lies.\n\nShe collaborated with playwright Elmer Rice to create Close Harmony, which ran on Broadway in December 1924. The play was well received in out-of-town previews and was favorably reviewed in New York but closed after a run of just 24 performances. It did, however, become a successful touring production under the title The Lady Next Door.Meade 138\n\nSome of Parker's most popular work was published in The New Yorker in the form of acerbic book reviews under the byline \"Constant Reader\" (her response to the whimsy of A. A. Milne's The House at Pooh Corner: \"Tonstant Weader fwowed up.\"). Her reviews appeared semi-regularly from 1927 to 1933,Silverstein 38 were widely read, and were later published in a collection under the name Constant Reader in 1970.\n\nHer best-known short story, \"Big Blonde,\" published in The Bookman magazine, was awarded the O. Henry Award as the best short story of 1929.Herrmann 74 Her short stories, though often witty, were also spare and incisive, and more bittersweet than comic, her style is often described as sardonic.  The bitterness is palpable in every phrase : sweetness is conspicuous by its absence.\n\nShe eventually separated from her husband, divorcing in 1928, and had a number of affairs. Her lovers included reporter-turned-playwright Charles MacArthur and the publisher Seward Collins. Her relationship with MacArthur resulted in a pregnancy, about which Parker is alleged to have remarked, \"how like me, to put all my eggs into one bastard.\"Meade 105 She had an abortion, and fell into a depression that culminated in her first attempt at suicide.Silverstein 29\n\nIt was toward the end of this period that Parker began to become politically aware and active. What would become a lifelong commitment to activism began in 1927 with the pending executions of Sacco and Vanzetti. Parker travelled to Boston to protest the proceedings. She and fellow Round Tabler Ruth Hale were arrested, and Parker eventually pleaded guilty to a charge of \"loitering and sauntering,\" paying a $5 fine.Silverstein 44\n\nHollywood\n\nParker met Alan Campbell,Meade 238 an actor with aspirations to become a screenwriter, in 1932; they married two years later in Raton, New Mexico.  Campbell's mixed parentage mirrored Parker's; he had a Jewish mother and a Scottish father. He was bisexual—Parker later proclaimed in public that he was \"queer as a billy goat\". The pair moved to Hollywood and signed ten-week contracts with Paramount Pictures, with Campbell (who was also expected to act) earning $250 per week and Parker earning $1,000 per week. They would eventually earn $2,000 and in some instances upwards of $5,000 per week as freelancers for various studios.Silverstein 40 She and Campbell worked on more than 15 films.\n\nIn 1936, she contributed lyrics for the song \"I Wished on the Moon\", with music by Ralph Rainger. The song was introduced in The Big Broadcast of 1936 by Bing Crosby.\n\nWith Campbell and Robert Carson, she wrote the script for the 1937 film A Star Is Born, for which they were nominated for an Academy Award for Best Writing—Screenplay. She wrote additional dialogue for The Little Foxes in 1941 and received another Oscar nomination, with Frank Cavett, for 1947's Smash-Up, the Story of a Woman, starring Susan Hayward.\n\nAfter the United States entered the Second World War, Parker and Alexander Woollcott collaborated to produce an anthology of her work as part of a series published by Viking Press for servicemen stationed overseas. With an introduction by Somerset MaughamMeade 318 the volume compiled over two dozen of Parker's short stories along with selected poems from Enough Rope, Sunset Gun, and Death and Taxes. It was released in the United States in 1944 under the title The Portable Dorothy Parker.  Only three Portable series—Parker's, William Shakespeare's, and The Bible—have remained in continuous print.\n\nDuring the 1930s and 1940s, Parker became an increasingly vocal advocate of causes like civil liberties and civil rights, and a frequent critic of those in authority. She reported on the Loyalist cause in Spain for the Communist magazine The New Masses in 1937.Meade 285 At the behest of Otto Katz, a covert Soviet Comintern agent and operative of German Communist Party agent Willi Muenzenberg, Parker helped to found the Hollywood Anti-Nazi League in 1936 (which was suspected by the FBI of being a Communist Party front).Koch, Stephen, Double Lives: Stalin, Willi Munzenberg and the Seduction of the Intellectuals, New York: Enigma Books (2004), Revised Edition,  The Hollywood Anti-Nazi League's membership eventually grew to some 4,000 strong. Its often wealthy members' contributions (probably not intended to support Communism) were, in the words of David Caute,Caute, David, The Fellow Travellers: Intellectual Friends of Communism, New Haven: Yale University Press (1988),  \"able to contribute as much to [Communist] Party funds as the whole American working class\".\n\nParker also served as chair of the Joint Anti-Fascist Rescue Committee. She organized Project Rescue Ship to transport Loyalist veterans to Mexico, headed Spanish Children's Relief and lent her name to many other left-wing causes and organizations. Her former Round Table friends saw less and less of her, with her relationship with Robert Benchley being particularly strained (although they would reconcile).Altman 314 Parker met S. J. Perelman at a party in 1932, and despite a rocky start (Perelman called it \"a scarifying ordeal\")Perelman 171—they remained friends for the next 35 years, even becoming neighbors when the Perelmans helped Parker and Campbell buy a run-down farm in Bucks County, Pennsylvania.\n\nParker was listed as a Communist by the publication Red Channels in 1950. The FBI compiled a 1,000-page dossier on her because of her suspected involvement in Communism during the McCarthy era. As a result, she was placed on the Hollywood blacklist by the movie studio bosses. Her final screenplay was The Fan, a 1949 adaptation of Oscar Wilde's Lady Windermere's Fan, directed by Otto Preminger. Her marriage to Campbell was tempestuous, with tensions exacerbated by Parker's increasing alcohol consumption and Campbell's long-term affair with a married woman in Europe during World War II.Meade 327 They divorced in 1947,Meade 329 remarried in 1950,Meade 339 then separated in 1952 when Parker moved back to New York. From 1957 to 1962, she lived at the Volney Residential Hotel on Manhattan's Upper East Side and wrote book reviews for Esquire magazine. Her writing became increasingly erratic due to her continued abuse of alcohol. She returned to Hollywood in 1961, reconciled with Campbell, and collaborated with him on a number of unproduced projects until Campbell died from a drug overdose in 1963.Meade 392–3\n\nLater life and death\n\nFollowing Campbell's death, Parker returned to New York City and the Volney residential hotel. In her later years, she would come to denigrate the group that had brought her such early notoriety, the Algonquin Round Table:\n\nParker was heard occasionally on radio, including Information Please (as a guest) and Author, Author (as a regular panelist). She wrote for the Columbia Workshop, and both Ilka Chase and Tallulah Bankhead used her material for radio monologues.\n\nParker died on June 7, 1967, of a heart attack at the age of 73. In her will, she bequeathed her estate to Dr. Martin Luther King, Jr.  Following King's death, her estate was passed on to the NAACP.Silverstein 59. Her executor, Lillian Hellman, bitterly but unsuccessfully contested this disposition.Meade 413. Her ashes remained unclaimed in various places, including her attorney Paul O'Dwyer's filing cabinet, for approximately 17 years.Meade 412.\n\nPosthumous honors\n\nIn 1988, the NAACP claimed Parker's remains and designed a memorial garden for them outside its Baltimore headquarters.Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 (Kindle Location 36205). McFarland & Company, Inc., Publishers. Kindle Edition. The plaque reads,\n\nOn August 22, 1992, the 99th anniversary of Parker's birth, the United States Postal Service issued a 29¢ U.S. commemorative postage stamp in the Literary Arts series. The Algonquin Round Table, as well as the number of other literary and theatrical greats who lodged there, helped earn the Algonquin Hotel its status as a New York City Historic Landmark, designated in 1987. In 1996, the hotel was designated a National Literary Landmark by the Friends of Libraries USA based on the contributions of Parker and other members of the Round Table. The organization's bronze plaque is attached to the front of the hotel. Her birthplace was also designated a National Literary Landmark by Friends of Libraries USA in 2005 and a bronze plaque marks the spot where the home once stood.[http://dorothyparker.com/news/2009/08/plaque-unveiled-at-parker-teenage-home.htm Dorothyparker.com]\n\nIn 2014, Parker was elected to the New Jersey Hall of Fame.\n\nIn popular culture\n\nParker was the inspiration for a number of fictional characters in several plays of her day. These included \"Lily Malone\" in Philip Barry's Hotel Universe (1932), \"Mary Hilliard\" (played by Ruth Gordon) in George Oppenheimer's Here Today (1932), \"Paula Wharton\" in Gordon's 1944 play Over Twenty-one (directed by George S. Kaufman), and \"Julia Glenn\" in the Kaufman-Moss Hart collaboration Merrily We Roll Along (1934). Kaufman's representation of her in Merrily We Roll Along led Parker, once his Round Table compatriot, to despise him.Meade 241 She also appeared as \"Daisy Lester\" in Charles Brackett's 1934 novel Entirely Surrounded.Silverstein 10–11 She is mentioned in the original introductory lyrics in Cole Porter' song \"Just One of Those Things\" from the 1935 Broadway musical Jubilee, which have been retained in the standard interpretation of the song when it became part of the Great American Songbook.\n\nParker appears as a character in the novel The Dorothy Parker Murder Case by George Baxt (1984), in a series of Algonquin Round Table Mysteries by J.J. Murphy (2011– ), and in Ellen Meister's novel Farewell, Dorothy Parker (2013).Meister, Ellen (2013) Farewell, Dorothy Parker. Putnam Adult.   She is the main character in \"Love For Miss Dottie,\" a short story by Larry N Mayer, which was selected by Mary Gaitskill for the collection Best New American Voices 2009 (Harcourt).\n\nShe has been portrayed on film and television by Dolores Sutton in F. Scott Fitzgerald in Hollywood (1976), Rosemary Murphy in Julia (1977), Bebe Neuwirth in Dash and Lilly (1999) and Jennifer Jason Leigh in Mrs. Parker and the Vicious Circle (1994). Foo  Neuwirth was nominated for an Emmy Award for her performance, and Leigh received a number of awards and nominations, including a Golden Globe nomination.\n\nTelevision creator Amy Sherman-Palladino named her production company 'Dorothy Parker Drank Here Productions' in tribute to Parker.\n\nTucson actress Lesley Abrams wrote and performed the one-woman show Dorothy Parker's Last Call in 2009 in Tucson, Arizona at the Winding Road Theater Ensemble [http://www.tucsonweekly.com/tucson/shaken-not-stirred/Content?oid=1473209 \"Shaken Not Stirred\"] Retrieved 2014-07-12. and reprised the role at the Live Theatre Workshop in Tucson in 2014.[http://tucson.com/entertainment/blogs/caliente-tuned-in/last-call-an-energetic-reflection-of-dorothy-parker-s-life/article_bcad569e-fa8e-11e3-ad5f-0019bb2963f4.html \"'Last Call' an energetic reflection of Dorothy Parker's life] Retrieved 2014-07-12. The play was also selected to be part of the Capital Fringe Festival in DC in 2010.[http://dctheatrescene.com/2010/07/11/dorothy-parkers-last-call \"Dorothy Parker's Last Call\"] Retrieved 2014-07-12.\n\nIn 2014, lyrics taken from her book of poetry Not So Deep as a Well were, with the authorization of the NAACP,[http://tunes.mamabirdrecordingco.com/album/not-so-deep-as-a-well \"The composer wishes to thank the National Association for the Advancement of Colored People for authorizing the use of Dorothy Parker's works.\"] Retrieved 2015-05-21. used by Canadian singer Myriam Gendron to create a folk album of the same name.[http://www.cbc.ca/news/canada/montreal/myriam-gendron-inspired-by-dorothy-parker-poems-1.2964068 \"Myriam Gendron inspired by Dorothy Parker poems\"] Retrieved 2015-05-21.  Also in 2014, Chicago jazz bassist/singer/composer Katie Ernst issued her album Little Words, consisting of her authorized settings of seven of Parker's poems.\n\nBibliography\n\nEssays and reporting\n\n*\n\nShort stories \n\nCollections \n\n* 1922 – Men I'm Not Married To\n* 1932 – After Such Pleasures\n* 1939 – Here Lies\n\nPoetry\n\nCollections \n\n* \n* 1928 – Sunset Guns\n* 1931 – Death and Taxes",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dorothy Parker" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8781" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dorothy Parker (August 22, 1893 – June 7, 1967) was an American poet, writer, critic, and satirist, best known for her wit, wisecracks and eye for 20th-century urban foibles.\n\nFrom a conflicted and unhappy childhood, Parker rose to acclaim, both for her literary output in publications such as The New Yorker and as a founding member of the Algonquin Round Table. Following the breakup of the circle, Parker traveled to Hollywood to pursue screenwriting. Her successes there, including two Academy Award nominations, were curtailed when her involvement in left-wing politics led to a place on the Hollywood blacklist.\n\nDismissive of her own talents, she deplored her reputation as a \"wisecracker.\" Nevertheless, both her literary output and reputation for sharp wit have endured.\n\nEarly life and education\n\nAlso known as Dot or Dottie, Parker was born Dorothy Rothschild to Jacob Henry and Eliza Annie Rothschild (née Marston)Meade 6 at 732 Ocean Avenue in Long Branch, New Jersey, where her parents had a summer beach cottage. Dorothy's mother was of Scottish descent, and her father was of German Jewish descent. Parker wrote in her essay \"My Hometown\" that her parents got her back to their Manhattan apartment shortly after Labor Day so she could be called a true New Yorker. Her mother died in West End in July 1898, when Parker was a month shy of turning five.Meade 12 Her father remarried in 1900 to a woman named Eleanor Francis Lewis.Meade 13 Parker hated her father, whom she accused of physical abuse; and likewise despised her stepmother, whom she refused to call \"mother\", \"stepmother\", or even \"Eleanor\", instead referring to her as \"the housekeeper\". She grew up on the Upper West Side and attended a Roman Catholic elementary school at the Convent of the Blessed Sacrament on West 79th Street with sister Helen, despite having a Jewish father and Protestant stepmother.Meade 14 (Mercedes de Acosta was a classmate.) Parker once joked that she was asked to leave following her characterization of the Immaculate Conception as \"spontaneous combustion\".  Her stepmother died in 1903, when Parker was nine.Meade 16 Parker later went to Miss Dana's School, a finishing school in Morristown, New Jersey.Meade 27 She graduated from Miss Dana's School in 1911, at the age of 18. Following her father's death in 1913, she played piano at a dancing school to earn a living while she worked on her verse.\n\nShe sold her first poem to Vanity Fair magazine in 1914 and some months later was hired as an editorial assistant for another Condé Nast magazine, Vogue. She moved to Vanity Fair as a staff writer after two years at Vogue.Silverstein 13\n\nIn 1917, she met and married a Wall Street stockbroker, Edwin Pond Parker IIHerrmann 78\n(1893–1933), but they were separated by his army service in World War I. She had ambivalent feelings about her Jewish heritage given the strong antisemitism of that era and joked that she married to escape her name.\n\nAlgonquin Round Table years\n\nHer career took off while she was writing theatre criticism for Vanity Fair, which she began to do in 1918 as a stand-in for the vacationing P. G. Wodehouse.Silverstein 18 At the magazine, she met Robert Benchley, who became a close friend, and Robert E. Sherwood. The trio began lunching at the Algonquin Hotel on a near-daily basis and became founding members of the Algonquin Round Table. The Round Table numbered among its members the newspaper columnists Franklin Pierce Adams and Alexander Woollcott. Through their re-printing of her lunchtime remarks and short verses, particularly in Adams' column \"The Conning Tower\", Dorothy began developing a national reputation as a wit. One of her most famous comments was made when the group was informed that famously taciturn former president Calvin Coolidge had died; Parker remarked, \"How could they tell?\"\n\nParker's caustic wit as a critic initially proved popular, but she was eventually terminated by Vanity Fair in 1920 after her criticisms began to offend powerful producers too often. In solidarity, both Benchley and Sherwood resigned in protest.Altman 156–8\n\nWhen Harold Ross founded The New Yorker in 1925, Parker and Benchley were part of a \"board of editors\" established by Ross to allay concerns of his investors. Parker's first piece for the magazine appeared in its second issue.Silverstein 32 Parker became famous for her short, viciously humorous poems, many about the perceived ludicrousness of her many (largely unsuccessful) romantic affairs and others wistfully considering the appeal of suicide.\n\nThe next 15 years were Parker's greatest period of productivity and success. In the 1920s alone she published some 300 poems and free verses in Vanity Fair, Vogue, \"The Conning Tower\" and The New Yorker as well as Life, McCall's and The New Republic.Silverstein 62–3\n\nParker published her first volume of poetry, Enough Rope, in 1926. The collection sold 47,000 copiesSilverstein 35 and garnered impressive reviews. The Nation described her verse as \"caked with a salty humor, rough with splinters of disillusion, and tarred with a bright black authenticity\".Meade 177 Although some critics, notably the New York Times reviewer, dismissed her work as \"flapper verse\",Meade 178 the volume helped cement Parker's reputation for sparkling wit. Parker released two more volumes of verse, Sunset Gun (1928) and Death and Taxes (1931), along with the short story collections Laments for the Living (1930) and After Such Pleasures (1933). Not So Deep as a Well (1936) collected much of the material previously published in Rope, Gun and Death and she re-released her fiction with a few new pieces in 1939 under the title Here Lies.\n\nShe collaborated with playwright Elmer Rice to create Close Harmony, which ran on Broadway in December 1924. The play was well received in out-of-town previews and was favorably reviewed in New York but closed after a run of just 24 performances. It did, however, become a successful touring production under the title The Lady Next Door.Meade 138\n\nSome of Parker's most popular work was published in The New Yorker in the form of acerbic book reviews under the byline \"Constant Reader\" (her response to the whimsy of A. A. Milne's The House at Pooh Corner: \"Tonstant Weader fwowed up.\"). Her reviews appeared semi-regularly from 1927 to 1933,Silverstein 38 were widely read, and were later published in a collection under the name Constant Reader in 1970.\n\nHer best-known short story, \"Big Blonde,\" published in The Bookman magazine, was awarded the O. Henry Award as the best short story of 1929.Herrmann 74 Her short stories, though often witty, were also spare and incisive, and more bittersweet than comic, her style is often described as sardonic.  The bitterness is palpable in every phrase : sweetness is conspicuous by its absence.\n\nShe eventually separated from her husband, divorcing in 1928, and had a number of affairs. Her lovers included reporter-turned-playwright Charles MacArthur and the publisher Seward Collins. Her relationship with MacArthur resulted in a pregnancy, about which Parker is alleged to have remarked, \"how like me, to put all my eggs into one bastard.\"Meade 105 She had an abortion, and fell into a depression that culminated in her first attempt at suicide.Silverstein 29\n\nIt was toward the end of this period that Parker began to become politically aware and active. What would become a lifelong commitment to activism began in 1927 with the pending executions of Sacco and Vanzetti. Parker travelled to Boston to protest the proceedings. She and fellow Round Tabler Ruth Hale were arrested, and Parker eventually pleaded guilty to a charge of \"loitering and sauntering,\" paying a $5 fine.Silverstein 44\n\nHollywood\n\nParker met Alan Campbell,Meade 238 an actor with aspirations to become a screenwriter, in 1932; they married two years later in Raton, New Mexico.  Campbell's mixed parentage mirrored Parker's; he had a Jewish mother and a Scottish father. He was bisexual—Parker later proclaimed in public that he was \"queer as a billy goat\". The pair moved to Hollywood and signed ten-week contracts with Paramount Pictures, with Campbell (who was also expected to act) earning $250 per week and Parker earning $1,000 per week. They would eventually earn $2,000 and in some instances upwards of $5,000 per week as freelancers for various studios.Silverstein 40 She and Campbell worked on more than 15 films.\n\nIn 1936, she contributed lyrics for the song \"I Wished on the Moon\", with music by Ralph Rainger. The song was introduced in The Big Broadcast of 1936 by Bing Crosby.\n\nWith Campbell and Robert Carson, she wrote the script for the 1937 film A Star Is Born, for which they were nominated for an Academy Award for Best Writing—Screenplay. She wrote additional dialogue for The Little Foxes in 1941 and received another Oscar nomination, with Frank Cavett, for 1947's Smash-Up, the Story of a Woman, starring Susan Hayward.\n\nAfter the United States entered the Second World War, Parker and Alexander Woollcott collaborated to produce an anthology of her work as part of a series published by Viking Press for servicemen stationed overseas. With an introduction by Somerset MaughamMeade 318 the volume compiled over two dozen of Parker's short stories along with selected poems from Enough Rope, Sunset Gun, and Death and Taxes. It was released in the United States in 1944 under the title The Portable Dorothy Parker.  Only three Portable series—Parker's, William Shakespeare's, and The Bible—have remained in continuous print.\n\nDuring the 1930s and 1940s, Parker became an increasingly vocal advocate of causes like civil liberties and civil rights, and a frequent critic of those in authority. She reported on the Loyalist cause in Spain for the Communist magazine The New Masses in 1937.Meade 285 At the behest of Otto Katz, a covert Soviet Comintern agent and operative of German Communist Party agent Willi Muenzenberg, Parker helped to found the Hollywood Anti-Nazi League in 1936 (which was suspected by the FBI of being a Communist Party front).Koch, Stephen, Double Lives: Stalin, Willi Munzenberg and the Seduction of the Intellectuals, New York: Enigma Books (2004), Revised Edition,  The Hollywood Anti-Nazi League's membership eventually grew to some 4,000 strong. Its often wealthy members' contributions (probably not intended to support Communism) were, in the words of David Caute,Caute, David, The Fellow Travellers: Intellectual Friends of Communism, New Haven: Yale University Press (1988),  \"able to contribute as much to [Communist] Party funds as the whole American working class\".\n\nParker also served as chair of the Joint Anti-Fascist Rescue Committee. She organized Project Rescue Ship to transport Loyalist veterans to Mexico, headed Spanish Children's Relief and lent her name to many other left-wing causes and organizations. Her former Round Table friends saw less and less of her, with her relationship with Robert Benchley being particularly strained (although they would reconcile).Altman 314 Parker met S. J. Perelman at a party in 1932, and despite a rocky start (Perelman called it \"a scarifying ordeal\")Perelman 171—they remained friends for the next 35 years, even becoming neighbors when the Perelmans helped Parker and Campbell buy a run-down farm in Bucks County, Pennsylvania.\n\nParker was listed as a Communist by the publication Red Channels in 1950. The FBI compiled a 1,000-page dossier on her because of her suspected involvement in Communism during the McCarthy era. As a result, she was placed on the Hollywood blacklist by the movie studio bosses. Her final screenplay was The Fan, a 1949 adaptation of Oscar Wilde's Lady Windermere's Fan, directed by Otto Preminger. Her marriage to Campbell was tempestuous, with tensions exacerbated by Parker's increasing alcohol consumption and Campbell's long-term affair with a married woman in Europe during World War II.Meade 327 They divorced in 1947,Meade 329 remarried in 1950,Meade 339 then separated in 1952 when Parker moved back to New York. From 1957 to 1962, she lived at the Volney Residential Hotel on Manhattan's Upper East Side and wrote book reviews for Esquire magazine. Her writing became increasingly erratic due to her continued abuse of alcohol. She returned to Hollywood in 1961, reconciled with Campbell, and collaborated with him on a number of unproduced projects until Campbell died from a drug overdose in 1963.Meade 392–3\n\nLater life and death\n\nFollowing Campbell's death, Parker returned to New York City and the Volney residential hotel. In her later years, she would come to denigrate the group that had brought her such early notoriety, the Algonquin Round Table:\n\nParker was heard occasionally on radio, including Information Please (as a guest) and Author, Author (as a regular panelist). She wrote for the Columbia Workshop, and both Ilka Chase and Tallulah Bankhead used her material for radio monologues.\n\nParker died on June 7, 1967, of a heart attack at the age of 73. In her will, she bequeathed her estate to Dr. Martin Luther King, Jr.  Following King's death, her estate was passed on to the NAACP.Silverstein 59. Her executor, Lillian Hellman, bitterly but unsuccessfully contested this disposition.Meade 413. Her ashes remained unclaimed in various places, including her attorney Paul O'Dwyer's filing cabinet, for approximately 17 years.Meade 412.\n\nPosthumous honors\n\nIn 1988, the NAACP claimed Parker's remains and designed a memorial garden for them outside its Baltimore headquarters.Wilson, Scott. Resting Places: The Burial Sites of More Than 14,000 Famous Persons, 3d ed.: 2 (Kindle Location 36205). McFarland & Company, Inc., Publishers. Kindle Edition. The plaque reads,\n\nOn August 22, 1992, the 99th anniversary of Parker's birth, the United States Postal Service issued a 29¢ U.S. commemorative postage stamp in the Literary Arts series. The Algonquin Round Table, as well as the number of other literary and theatrical greats who lodged there, helped earn the Algonquin Hotel its status as a New York City Historic Landmark, designated in 1987. In 1996, the hotel was designated a National Literary Landmark by the Friends of Libraries USA based on the contributions of Parker and other members of the Round Table. The organization's bronze plaque is attached to the front of the hotel. Her birthplace was also designated a National Literary Landmark by Friends of Libraries USA in 2005 and a bronze plaque marks the spot where the home once stood.[http://dorothyparker.com/news/2009/08/plaque-unveiled-at-parker-teenage-home.htm Dorothyparker.com]\n\nIn 2014, Parker was elected to the New Jersey Hall of Fame.\n\nIn popular culture\n\nParker was the inspiration for a number of fictional characters in several plays of her day. These included \"Lily Malone\" in Philip Barry's Hotel Universe (1932), \"Mary Hilliard\" (played by Ruth Gordon) in George Oppenheimer's Here Today (1932), \"Paula Wharton\" in Gordon's 1944 play Over Twenty-one (directed by George S. Kaufman), and \"Julia Glenn\" in the Kaufman-Moss Hart collaboration Merrily We Roll Along (1934). Kaufman's representation of her in Merrily We Roll Along led Parker, once his Round Table compatriot, to despise him.Meade 241 She also appeared as \"Daisy Lester\" in Charles Brackett's 1934 novel Entirely Surrounded.Silverstein 10–11 She is mentioned in the original introductory lyrics in Cole Porter' song \"Just One of Those Things\" from the 1935 Broadway musical Jubilee, which have been retained in the standard interpretation of the song when it became part of the Great American Songbook.\n\nParker appears as a character in the novel The Dorothy Parker Murder Case by George Baxt (1984), in a series of Algonquin Round Table Mysteries by J.J. Murphy (2011– ), and in Ellen Meister's novel Farewell, Dorothy Parker (2013).Meister, Ellen (2013) Farewell, Dorothy Parker. Putnam Adult.   She is the main character in \"Love For Miss Dottie,\" a short story by Larry N Mayer, which was selected by Mary Gaitskill for the collection Best New American Voices 2009 (Harcourt).\n\nShe has been portrayed on film and television by Dolores Sutton in F. Scott Fitzgerald in Hollywood (1976), Rosemary Murphy in Julia (1977), Bebe Neuwirth in Dash and Lilly (1999) and Jennifer Jason Leigh in Mrs. Parker and the Vicious Circle (1994). Foo  Neuwirth was nominated for an Emmy Award for her performance, and Leigh received a number of awards and nominations, including a Golden Globe nomination.\n\nTelevision creator Amy Sherman-Palladino named her production company 'Dorothy Parker Drank Here Productions' in tribute to Parker.\n\nTucson actress Lesley Abrams wrote and performed the one-woman show Dorothy Parker's Last Call in 2009 in Tucson, Arizona at the Winding Road Theater Ensemble [http://www.tucsonweekly.com/tucson/shaken-not-stirred/Content?oid=1473209 \"Shaken Not Stirred\"] Retrieved 2014-07-12. and reprised the role at the Live Theatre Workshop in Tucson in 2014.[http://tucson.com/entertainment/blogs/caliente-tuned-in/last-call-an-energetic-reflection-of-dorothy-parker-s-life/article_bcad569e-fa8e-11e3-ad5f-0019bb2963f4.html \"'Last Call' an energetic reflection of Dorothy Parker's life] Retrieved 2014-07-12. The play was also selected to be part of the Capital Fringe Festival in DC in 2010.[http://dctheatrescene.com/2010/07/11/dorothy-parkers-last-call \"Dorothy Parker's Last Call\"] Retrieved 2014-07-12.\n\nIn 2014, lyrics taken from her book of poetry Not So Deep as a Well were, with the authorization of the NAACP,[http://tunes.mamabirdrecordingco.com/album/not-so-deep-as-a-well \"The composer wishes to thank the National Association for the Advancement of Colored People for authorizing the use of Dorothy Parker's works.\"] Retrieved 2015-05-21. used by Canadian singer Myriam Gendron to create a folk album of the same name.[http://www.cbc.ca/news/canada/montreal/myriam-gendron-inspired-by-dorothy-parker-poems-1.2964068 \"Myriam Gendron inspired by Dorothy Parker poems\"] Retrieved 2015-05-21.  Also in 2014, Chicago jazz bassist/singer/composer Katie Ernst issued her album Little Words, consisting of her authorized settings of seven of Parker's poems.\n\nBibliography\n\nEssays and reporting\n\n*\n\nShort stories \n\nCollections \n\n* 1922 – Men I'm Not Married To\n* 1932 – After Such Pleasures\n* 1939 – Here Lies\n\nPoetry\n\nCollections \n\n* \n* 1928 – Sunset Guns\n* 1931 – Death and Taxes. Dorothy Parker. http://en.wikipedia.org/?curid=8781."
  }
}
