{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8478",
  "eid" : "e81290e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778469102,
  "textBody" : "Doublespeak is a language that deliberately obscures, disguises, distorts, or reverses the meaning of words. Doublespeak may take the form of euphemisms (e.g., \"downsizing\" for layoffs, \"servicing the target\" for bombing), in which case it is primarily meant to make the truth sound more palatable. It may also refer to intentional ambiguity in language or to actual inversions of meaning. In such cases, doublespeak disguises the nature of the truth.  Doublespeak is most closely associated with political language.Herman 1992.\n\nOrigins and concepts \n\nThe term \"doublespeak\" originates in George Orwell's book Nineteen Eighty-Four. Although the term is not used in the book, it is a close relative of two of the book's central concepts, \"doublethink\" and \"Newspeak\".  Another variant, \"doubletalk\", also referring to deliberately ambiguous speech, did exist at the time Orwell wrote his book, but the usage of \"doublespeak\" as well as of \"doubletalk\" in the sense emphasizing ambiguity clearly postdates the publication of Nineteen Eighty-Four.   Parallels have also been drawn between doublespeak and Orwell's classic essay Politics and the English Language, which discusses the distortion of language for political purposes.\n\nEdward S. Herman, political economist and media analyst, has highlighted some examples of doublespeak and doublethink in modern society.Herman 1992, p. 25. Herman describes in his book, Beyond Hypocrisy the principal characteristics of doublespeak:\n \n\nIn his essay \"Politics and the English Language\", George Orwell observes that political language serves to distort and obfuscate reality. Orwell’s description of political speech is extremely similar to the contemporary definition of doublespeak;\n\nTheoretical approaches \n\nAlthough the theories that premise doublespeak are still indefinite, there are some theories that have parallels with the theory of doublespeak and Orwell's ideology in Nineteen Eighty-Four and might possibly provide a better understanding of where doublespeak's theories could have come from.\n\nConflict theories\n\nDue to the inherently deceptive nature of doublespeak as well as its prominent use in politics and religion, doublespeak has been linked to the sociological perspective known as conflict theories. Conflict theories detract from ideas of society being naturally in harmony, instead placing emphasis on political and material inequality as its structural features. Antonio Gramsci's concepts on cultural hegemony, in particular, suggest that the culture and values of the economic elite – the bourgeoisie – become indoctrinated as \"common sense\" to the working-class, allowing for the maintenance of the status quo through misplaced belief. Being himself one of the leaders of the Communist Party of Italy, his theories had, in turn, been strongly influenced by the German social thinker Karl Marx, and have their ideological roots grounded in Marxist theory of false consciousness and capitalist exploitation. While Gramsci's views argue that culture (beliefs, perceptions and values) allows the ruling class to maintain domination, Marx's explanation is along more economic lines, with concepts such as commodity fetishism demonstrating how the ideology of the bourgeoisie (in this case, the existence of property as a social creation rather than an \"eternal entity\") dominate over that of the working classes. \nIn both cases, both philosophers argue that one view – that of the bourgeoisie – dominates over others, hence the term conflict theories.\n\nOn the other hand, Terrence P. Moran of the US National Council of Teachers of English has compared the use of doublespeak in the mass media to laboratory experiments conducted on rats, where a batch of rats were deprived of food, before one half was fed sugar and water and the other half a saccharin solution. Both groups exhibited behavior indicating that their hunger was satisfied, but rats in the second group (which were fed saccharin solution) died from malnutrition. Moran highlights the structural nature of doublespeak, and notes that social institutions such as the mass media adopt an active, top-down approach in managing opinion. Therefore, Moran parallels doublespeak to producing an illusionary effect:\n\nContemporary writings\n\nDoublespeak might also have some connections with contemporary theories.\nEdward S. Herman and Noam Chomsky note in their book that Orwellian doublespeak is an important component of the manipulation of the English language in American media, through a process called \"dichotomization\"; a component of media propaganda involving \"deeply embedded double standards in the reporting of news\".  For example, the use of state funds by the poor and financially needy is commonly referred to as \"social welfare\" or \"handouts\", which the \"coddled\" poor \"take advantage of\". These terms, however, do not apply to other beneficiaries of government spending such as military spending.\n\nExamples of the structural nature of the use of Doublespeak have been made by modern scholars. Noam Chomsky argues in Manufacturing Consent: The Political Economy of the Mass Media that people in modern society consist of decision-makers and social participants who have to be made to agree. According to Chomsky, the media and public relations industry actively shape public opinion, working to present messages in line with their economic agenda for the purposes of controlling of the \"public mind\". Contrary to the popular belief that indoctrination is inconsistent with democracy, Chomsky goes so far as to argue that \"it's the essence of democracy\".\n\nEdward Herman's book Beyond Hypocrisy also includes a doublespeak dictionary of commonly employed media terms and phrases into plain English.\n\nHenceforth, conflict theories demonstrate the dominating ideology of the bourgeoisie and Moran's theory highlights that doublespeak produces an illusionary effect, both theories having parallels to Orwell's ideology in Nineteen Eighty-Four. Similarly, Herman's theory of doublespeak having an inherent nature to be manipulative and Chomsky's theory of \"dichotomization\" relates directly to the practice of doublespeak and how doublespeak is deliberately deceptive in nature.\n\nMain contributors\n\nWilliam Lutz\n\nWilliam D. Lutz has served as the third chairman of the Doublespeak Committee since 1975. In 1989, both his own book Doublespeak and, under his editorship, the committee's third book, Beyond Nineteen Eighty-Four, were published. Lutz was also the former editor of the now defunct Quarterly Review of Doublespeak, which examines ways that jargon has polluted the public vocabulary with phrases, words and usages of words designed to obscure the meaning of plain English. His book, Beyond Nineteen Eighty-Four, consists of 220 pages and eighteen articles contributed by long-time Committee members and others whose body of work has made important contributions to understandings about language, as well as a bibliography of 103 sources on doublespeak.\n\nLutz is one of the main contributors to the committee as well as promoting the term \"doublespeak\" to a mass audience so as to inform them of the deceptive qualities that doublespeak contains. He mentions:\n\nHe also mentions that the NCTE Committee on Public Doublespeak and their works with regards to educating the public on doublespeak is responsible for \"the rather awesome task of combating the advertisers, the politicians, and the major manipulators of public language in our society\".\n\nLutz states that it is important to highlight doublespeak to the public because \"language isn't the invention of human beings to lie, deceive, mislead, and manipulate\" and the \"purpose of language is to communicate the truth and to facilitate social groups getting together\". Thus, according to Lutz, doublespeak is a form of language that defeats the purpose of inventing language because doublespeak does not communicate the truth but seeks to do the opposite and the doublespeak committee is tasked with correcting this problem that doublespeak has created in the world of language.\n\nNCTE Committee on Public Doublespeak\n\nThe National Council of Teachers of English (NCTE) Committee on Public Doublespeak was formed in 1971, in the midst of the Watergate scandal, at a point when there was widespread skepticism about the degree of truth which characterized relationships between the public and the worlds of politics, the military, and business. NCTE passed two resolutions. One called for the Council to find means to study dishonest and inhumane uses of language and literature by advertisers, to bring offenses to public attention, and to propose classroom techniques for preparing children to cope with commercial propaganda. The other called for the Council to find means to study the relations of language to public policy, to keep track of, publicize, and combat semantic distortion by public officials, candidates for office, political commentators, and all those who transmit through the mass media. Bringing the charges of the two resolutions to life was accomplished by forming NCTE's Committee on Public Doublespeak, a body which has made significant contributions in describing the need for reform where clarity in communication has been deliberately distorted. Such structures can be applied to the field of education, where they could conceivably initiate an anti-pollution bandwagon in educational communication and educate people on how to counter doublespeak.\n\nWilliam Lutz stated that \"the doublespeak committee was formed to combat the use of public language by increasing people's awareness of what is good, clear, solid use of language and what is not.\" \"The committee does more than help students and the general public recognize what doublespeak is; it dramatizes that clarity of expression reflects clarity of thought.\"\n\nHugh Rank\n\nHugh Rank formed the Doublespeak committee and was the first chairman of this committee. Under his editorship, the committee produced a book called Language and Public Policy (1974), with the aim of informing readers of the extensive scope of doublespeak being used to deliberately mislead and deceive the audience. He highlighted the deliberate public misuses of language and provided strategies for countering doublespeak by focusing on educating people in the English language so as to help them identify when doublespeak is being put into play. He was also the founder of the Intensify/Downplay pattern that has been widely used to identify instances of Doublespeak being used.\n\nDaniel Dieterich\n\nDaniel Dieterich served as the second chairman of the Doublespeak committee after Hugh Rank in 1975. He served as editor of its second publication, Teaching about Doublespeak (1976), which carried forward the Committee's charge to inform teachers of ways of teaching students how to recognize and combat language designed to mislead and misinform.\n\nCriticism of NCTE\n\nA. M. Tibbetts is one of the main critics of the NCTE, claiming that \"the Committee's very approach to the misuse of language and what it calls 'doublespeak' may in the long run limit its usefulness\". According to him, the \"Committee's use of Orwell is both confused and confusing\". The NCTE's publications resonate with George Orwell's name, and allusions to him abound in statements on doublespeak; for example, the committee quoted Orwell's remark that \"language is often used as an instrument of social control\" in Language and Public Policy. Tibbetts argues that such a relation between NCTE and Orwell's work is contradicting because \"the Committee's attitude towards language is liberal, even radical\" while \"Orwell's attitude was conservative, even reactionary\". He also criticizes on the Committee's \"continual attack\" against linguistic \"purism\".\n\nModern uses \n\nWhereas in the early days of the practice it was considered wrong to construct words to disguise meaning, this is now an accepted and established practice. There is a thriving industry in constructing words without explicit meaning but with particular connotations for new products or companies. Doublespeak is also employed in the field of politics. Hence, education is necessary to recognize and combat against doublespeak-use effectively.\n\nIn advertising \n\nAdvertisers can use doublespeak to mask their commercial intent from users, as users' defenses against advertising become more well entrenched. Some are attempting to counter this technique, however, with a number of systems which offer diverse views and information which highlights the manipulative and dishonest methods that advertisers employ.\n\nAccording to Jacques Ellul, \"the aim is not to even modify people’s ideas on a given subject, rather, it is to achieve conformity in the way that people act.\" He demonstrates this view by offering an example from drug advertising. By using doublespeak in advertisements, aspirin production rose by almost 50 percent from over 23 million pounds in 1960 to over 35 million pounds in 1970.\n\nThe rule of parity \n\nWilliam Lutz's book The Rule of Parity illustrates how doublespeak is being employed in the advertising industry.\n\nLutz uses the example of parity products: products in which most, if not all, brands in a class or category are of similar quality. To highlight the uniqueness of their product, advertisers may choose to market it differently from their competitors. Advertising is used to create the impression of superiority. This is shown in the first rule of parity, which involves the use of the words \"better\" and \"best\". In parity claims, \"better\" means \"best\", and \"best\" means \"equal to\".\n\nLutz goes on to say that when advertisers state that their product is \"good\", it is equivalent in meaning to saying that their product is the best. If all the brands are similar, they must all be similarly good. When they claim that their product is the \"best\", they mean that the product is as good as the other superior products in its category. Using the toothpaste industry as an example, Lutz says that, because there is no dramatic difference among the products of the major toothpaste companies today, they are equal. However, if all of the different toothpastes are good and equal, there is no need to prove their claim. On the contrary, advertisers cannot market their products as \"better\" as it is a comparative term, and a claim of superiority.\n\nEducation against doublespeak\n\nEducating students has been suggested by experts to be one of the ways to counter doublespeak. Educating students in the English language is important to help them identify how doublespeak is being used to mislead and conceal information.\n\nCharles Weingartner, one of the founding members of the NCTE committee on Public Doublespeak mentioned: \"people do not know enough about the subject (the reality) to recognize that the language being used conceals, distorts, misleads\". There is a crucial need for English language teachers to educate and become experts in teaching about linguistic vulnerability. \"Teachers of English should teach our students that words are not things, but verbal tokens or signs of things that should finally be carried back to the things that they stand for to be verified. Students should be taught a healthy skepticism about the potential abuse of language but duly warned about the dangers of an unhealthy cynicism.\"\n\nAccording to William Lutz: \"Only by teaching respect and love for the language can teachers of English instill in students the sense of outrage they should experience when they encounter doublespeak.\" \"Students must first learn to use the language effectively, to understand its beauty and power.\" \"Only by using language well will we come to appreciate the perversion inherent in doublespeak.\"\n\nIntensify/downplay pattern\n\nThis pattern was formulated by Hugh Rank and is a simple tool designed to teach some basic patterns of persuasion used in political propaganda and commercial advertising. As it was formulated to educate the public on how to counter doublespeak via education, its aim was to reach the widest possible audience of citizens. It was prepared to be incorporated within a wide variety of existing programs and textbooks in English, speech, media, communications, journalism, social studies. The NCTE has endorsed this pattern as a useful way of teaching students to cope with propaganda from any source.\n\nThe function of the intensify/downplay pattern is not to dictate what should be discussed but to encourage coherent thought and systematic organization. The pattern works in two ways: intensifying and downplaying.  All people intensify and this is done via repetition, association and composition. Downplaying is commonly done via omission, diversion and confusion as they communicate in words, gestures, numbers, et cetera. Individuals can better cope with organized persuasion by recognizing the common ways whereby communication is intensified or downplayed, so as to counter doublespeak.\n\nIn politics \n\n \nDoublespeak is often used to avoid answering questions or to avoid the public's questions without directly stating that the specific politician is ignoring or rephrasing the question.\n\nDoublespeak Award\n\nDoublespeak is often used by politicians for the advancement of their agenda. The Doublespeak Award is an \"ironic tribute to public speakers who have perpetuated language that is grossly deceptive, evasive, euphemistic, confusing, or self-centered.\" It has been issued by the National Council of Teachers of English (NCTE) since 1974.  The recipients of the Doublespeak Award are usually politicians, national administration or departments. An example of this is the United States Department of Defense, which won the award three times in 1991, 1993, and 2001 respectively. For the 1991 award, the United States Department of Defense \"swept the first six places in the Doublespeak top ten\" for using euphemisms like \"servicing the target\" (bombing) and \"force packages\" (warplanes). Among the other phrases in contention were \"difficult exercise in labor relations\", meaning a strike, and \"meaningful downturn in aggregate output\", an attempt to avoid saying the word \"recession\".\n\nIn comedy\n\nDoublespeak, particularly when exaggerated, can be used as a device in satirical comedy and social commentary to ironically parody political or bureaucratic establishments intent on obfuscation or prevarication.  The television series Yes Minister is notable for its use of this device.  Oscar Wilde was an early proponent of this device and a significant influence on Orwell.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Doublespeak" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8478" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Doublespeak is a language that deliberately obscures, disguises, distorts, or reverses the meaning of words. Doublespeak may take the form of euphemisms (e.g., \"downsizing\" for layoffs, \"servicing the target\" for bombing), in which case it is primarily meant to make the truth sound more palatable. It may also refer to intentional ambiguity in language or to actual inversions of meaning. In such cases, doublespeak disguises the nature of the truth.  Doublespeak is most closely associated with political language.Herman 1992.\n\nOrigins and concepts \n\nThe term \"doublespeak\" originates in George Orwell's book Nineteen Eighty-Four. Although the term is not used in the book, it is a close relative of two of the book's central concepts, \"doublethink\" and \"Newspeak\".  Another variant, \"doubletalk\", also referring to deliberately ambiguous speech, did exist at the time Orwell wrote his book, but the usage of \"doublespeak\" as well as of \"doubletalk\" in the sense emphasizing ambiguity clearly postdates the publication of Nineteen Eighty-Four.   Parallels have also been drawn between doublespeak and Orwell's classic essay Politics and the English Language, which discusses the distortion of language for political purposes.\n\nEdward S. Herman, political economist and media analyst, has highlighted some examples of doublespeak and doublethink in modern society.Herman 1992, p. 25. Herman describes in his book, Beyond Hypocrisy the principal characteristics of doublespeak:\n \n\nIn his essay \"Politics and the English Language\", George Orwell observes that political language serves to distort and obfuscate reality. Orwell’s description of political speech is extremely similar to the contemporary definition of doublespeak;\n\nTheoretical approaches \n\nAlthough the theories that premise doublespeak are still indefinite, there are some theories that have parallels with the theory of doublespeak and Orwell's ideology in Nineteen Eighty-Four and might possibly provide a better understanding of where doublespeak's theories could have come from.\n\nConflict theories\n\nDue to the inherently deceptive nature of doublespeak as well as its prominent use in politics and religion, doublespeak has been linked to the sociological perspective known as conflict theories. Conflict theories detract from ideas of society being naturally in harmony, instead placing emphasis on political and material inequality as its structural features. Antonio Gramsci's concepts on cultural hegemony, in particular, suggest that the culture and values of the economic elite – the bourgeoisie – become indoctrinated as \"common sense\" to the working-class, allowing for the maintenance of the status quo through misplaced belief. Being himself one of the leaders of the Communist Party of Italy, his theories had, in turn, been strongly influenced by the German social thinker Karl Marx, and have their ideological roots grounded in Marxist theory of false consciousness and capitalist exploitation. While Gramsci's views argue that culture (beliefs, perceptions and values) allows the ruling class to maintain domination, Marx's explanation is along more economic lines, with concepts such as commodity fetishism demonstrating how the ideology of the bourgeoisie (in this case, the existence of property as a social creation rather than an \"eternal entity\") dominate over that of the working classes. \nIn both cases, both philosophers argue that one view – that of the bourgeoisie – dominates over others, hence the term conflict theories.\n\nOn the other hand, Terrence P. Moran of the US National Council of Teachers of English has compared the use of doublespeak in the mass media to laboratory experiments conducted on rats, where a batch of rats were deprived of food, before one half was fed sugar and water and the other half a saccharin solution. Both groups exhibited behavior indicating that their hunger was satisfied, but rats in the second group (which were fed saccharin solution) died from malnutrition. Moran highlights the structural nature of doublespeak, and notes that social institutions such as the mass media adopt an active, top-down approach in managing opinion. Therefore, Moran parallels doublespeak to producing an illusionary effect:\n\nContemporary writings\n\nDoublespeak might also have some connections with contemporary theories.\nEdward S. Herman and Noam Chomsky note in their book that Orwellian doublespeak is an important component of the manipulation of the English language in American media, through a process called \"dichotomization\"; a component of media propaganda involving \"deeply embedded double standards in the reporting of news\".  For example, the use of state funds by the poor and financially needy is commonly referred to as \"social welfare\" or \"handouts\", which the \"coddled\" poor \"take advantage of\". These terms, however, do not apply to other beneficiaries of government spending such as military spending.\n\nExamples of the structural nature of the use of Doublespeak have been made by modern scholars. Noam Chomsky argues in Manufacturing Consent: The Political Economy of the Mass Media that people in modern society consist of decision-makers and social participants who have to be made to agree. According to Chomsky, the media and public relations industry actively shape public opinion, working to present messages in line with their economic agenda for the purposes of controlling of the \"public mind\". Contrary to the popular belief that indoctrination is inconsistent with democracy, Chomsky goes so far as to argue that \"it's the essence of democracy\".\n\nEdward Herman's book Beyond Hypocrisy also includes a doublespeak dictionary of commonly employed media terms and phrases into plain English.\n\nHenceforth, conflict theories demonstrate the dominating ideology of the bourgeoisie and Moran's theory highlights that doublespeak produces an illusionary effect, both theories having parallels to Orwell's ideology in Nineteen Eighty-Four. Similarly, Herman's theory of doublespeak having an inherent nature to be manipulative and Chomsky's theory of \"dichotomization\" relates directly to the practice of doublespeak and how doublespeak is deliberately deceptive in nature.\n\nMain contributors\n\nWilliam Lutz\n\nWilliam D. Lutz has served as the third chairman of the Doublespeak Committee since 1975. In 1989, both his own book Doublespeak and, under his editorship, the committee's third book, Beyond Nineteen Eighty-Four, were published. Lutz was also the former editor of the now defunct Quarterly Review of Doublespeak, which examines ways that jargon has polluted the public vocabulary with phrases, words and usages of words designed to obscure the meaning of plain English. His book, Beyond Nineteen Eighty-Four, consists of 220 pages and eighteen articles contributed by long-time Committee members and others whose body of work has made important contributions to understandings about language, as well as a bibliography of 103 sources on doublespeak.\n\nLutz is one of the main contributors to the committee as well as promoting the term \"doublespeak\" to a mass audience so as to inform them of the deceptive qualities that doublespeak contains. He mentions:\n\nHe also mentions that the NCTE Committee on Public Doublespeak and their works with regards to educating the public on doublespeak is responsible for \"the rather awesome task of combating the advertisers, the politicians, and the major manipulators of public language in our society\".\n\nLutz states that it is important to highlight doublespeak to the public because \"language isn't the invention of human beings to lie, deceive, mislead, and manipulate\" and the \"purpose of language is to communicate the truth and to facilitate social groups getting together\". Thus, according to Lutz, doublespeak is a form of language that defeats the purpose of inventing language because doublespeak does not communicate the truth but seeks to do the opposite and the doublespeak committee is tasked with correcting this problem that doublespeak has created in the world of language.\n\nNCTE Committee on Public Doublespeak\n\nThe National Council of Teachers of English (NCTE) Committee on Public Doublespeak was formed in 1971, in the midst of the Watergate scandal, at a point when there was widespread skepticism about the degree of truth which characterized relationships between the public and the worlds of politics, the military, and business. NCTE passed two resolutions. One called for the Council to find means to study dishonest and inhumane uses of language and literature by advertisers, to bring offenses to public attention, and to propose classroom techniques for preparing children to cope with commercial propaganda. The other called for the Council to find means to study the relations of language to public policy, to keep track of, publicize, and combat semantic distortion by public officials, candidates for office, political commentators, and all those who transmit through the mass media. Bringing the charges of the two resolutions to life was accomplished by forming NCTE's Committee on Public Doublespeak, a body which has made significant contributions in describing the need for reform where clarity in communication has been deliberately distorted. Such structures can be applied to the field of education, where they could conceivably initiate an anti-pollution bandwagon in educational communication and educate people on how to counter doublespeak.\n\nWilliam Lutz stated that \"the doublespeak committee was formed to combat the use of public language by increasing people's awareness of what is good, clear, solid use of language and what is not.\" \"The committee does more than help students and the general public recognize what doublespeak is; it dramatizes that clarity of expression reflects clarity of thought.\"\n\nHugh Rank\n\nHugh Rank formed the Doublespeak committee and was the first chairman of this committee. Under his editorship, the committee produced a book called Language and Public Policy (1974), with the aim of informing readers of the extensive scope of doublespeak being used to deliberately mislead and deceive the audience. He highlighted the deliberate public misuses of language and provided strategies for countering doublespeak by focusing on educating people in the English language so as to help them identify when doublespeak is being put into play. He was also the founder of the Intensify/Downplay pattern that has been widely used to identify instances of Doublespeak being used.\n\nDaniel Dieterich\n\nDaniel Dieterich served as the second chairman of the Doublespeak committee after Hugh Rank in 1975. He served as editor of its second publication, Teaching about Doublespeak (1976), which carried forward the Committee's charge to inform teachers of ways of teaching students how to recognize and combat language designed to mislead and misinform.\n\nCriticism of NCTE\n\nA. M. Tibbetts is one of the main critics of the NCTE, claiming that \"the Committee's very approach to the misuse of language and what it calls 'doublespeak' may in the long run limit its usefulness\". According to him, the \"Committee's use of Orwell is both confused and confusing\". The NCTE's publications resonate with George Orwell's name, and allusions to him abound in statements on doublespeak; for example, the committee quoted Orwell's remark that \"language is often used as an instrument of social control\" in Language and Public Policy. Tibbetts argues that such a relation between NCTE and Orwell's work is contradicting because \"the Committee's attitude towards language is liberal, even radical\" while \"Orwell's attitude was conservative, even reactionary\". He also criticizes on the Committee's \"continual attack\" against linguistic \"purism\".\n\nModern uses \n\nWhereas in the early days of the practice it was considered wrong to construct words to disguise meaning, this is now an accepted and established practice. There is a thriving industry in constructing words without explicit meaning but with particular connotations for new products or companies. Doublespeak is also employed in the field of politics. Hence, education is necessary to recognize and combat against doublespeak-use effectively.\n\nIn advertising \n\nAdvertisers can use doublespeak to mask their commercial intent from users, as users' defenses against advertising become more well entrenched. Some are attempting to counter this technique, however, with a number of systems which offer diverse views and information which highlights the manipulative and dishonest methods that advertisers employ.\n\nAccording to Jacques Ellul, \"the aim is not to even modify people’s ideas on a given subject, rather, it is to achieve conformity in the way that people act.\" He demonstrates this view by offering an example from drug advertising. By using doublespeak in advertisements, aspirin production rose by almost 50 percent from over 23 million pounds in 1960 to over 35 million pounds in 1970.\n\nThe rule of parity \n\nWilliam Lutz's book The Rule of Parity illustrates how doublespeak is being employed in the advertising industry.\n\nLutz uses the example of parity products: products in which most, if not all, brands in a class or category are of similar quality. To highlight the uniqueness of their product, advertisers may choose to market it differently from their competitors. Advertising is used to create the impression of superiority. This is shown in the first rule of parity, which involves the use of the words \"better\" and \"best\". In parity claims, \"better\" means \"best\", and \"best\" means \"equal to\".\n\nLutz goes on to say that when advertisers state that their product is \"good\", it is equivalent in meaning to saying that their product is the best. If all the brands are similar, they must all be similarly good. When they claim that their product is the \"best\", they mean that the product is as good as the other superior products in its category. Using the toothpaste industry as an example, Lutz says that, because there is no dramatic difference among the products of the major toothpaste companies today, they are equal. However, if all of the different toothpastes are good and equal, there is no need to prove their claim. On the contrary, advertisers cannot market their products as \"better\" as it is a comparative term, and a claim of superiority.\n\nEducation against doublespeak\n\nEducating students has been suggested by experts to be one of the ways to counter doublespeak. Educating students in the English language is important to help them identify how doublespeak is being used to mislead and conceal information.\n\nCharles Weingartner, one of the founding members of the NCTE committee on Public Doublespeak mentioned: \"people do not know enough about the subject (the reality) to recognize that the language being used conceals, distorts, misleads\". There is a crucial need for English language teachers to educate and become experts in teaching about linguistic vulnerability. \"Teachers of English should teach our students that words are not things, but verbal tokens or signs of things that should finally be carried back to the things that they stand for to be verified. Students should be taught a healthy skepticism about the potential abuse of language but duly warned about the dangers of an unhealthy cynicism.\"\n\nAccording to William Lutz: \"Only by teaching respect and love for the language can teachers of English instill in students the sense of outrage they should experience when they encounter doublespeak.\" \"Students must first learn to use the language effectively, to understand its beauty and power.\" \"Only by using language well will we come to appreciate the perversion inherent in doublespeak.\"\n\nIntensify/downplay pattern\n\nThis pattern was formulated by Hugh Rank and is a simple tool designed to teach some basic patterns of persuasion used in political propaganda and commercial advertising. As it was formulated to educate the public on how to counter doublespeak via education, its aim was to reach the widest possible audience of citizens. It was prepared to be incorporated within a wide variety of existing programs and textbooks in English, speech, media, communications, journalism, social studies. The NCTE has endorsed this pattern as a useful way of teaching students to cope with propaganda from any source.\n\nThe function of the intensify/downplay pattern is not to dictate what should be discussed but to encourage coherent thought and systematic organization. The pattern works in two ways: intensifying and downplaying.  All people intensify and this is done via repetition, association and composition. Downplaying is commonly done via omission, diversion and confusion as they communicate in words, gestures, numbers, et cetera. Individuals can better cope with organized persuasion by recognizing the common ways whereby communication is intensified or downplayed, so as to counter doublespeak.\n\nIn politics \n\n \nDoublespeak is often used to avoid answering questions or to avoid the public's questions without directly stating that the specific politician is ignoring or rephrasing the question.\n\nDoublespeak Award\n\nDoublespeak is often used by politicians for the advancement of their agenda. The Doublespeak Award is an \"ironic tribute to public speakers who have perpetuated language that is grossly deceptive, evasive, euphemistic, confusing, or self-centered.\" It has been issued by the National Council of Teachers of English (NCTE) since 1974.  The recipients of the Doublespeak Award are usually politicians, national administration or departments. An example of this is the United States Department of Defense, which won the award three times in 1991, 1993, and 2001 respectively. For the 1991 award, the United States Department of Defense \"swept the first six places in the Doublespeak top ten\" for using euphemisms like \"servicing the target\" (bombing) and \"force packages\" (warplanes). Among the other phrases in contention were \"difficult exercise in labor relations\", meaning a strike, and \"meaningful downturn in aggregate output\", an attempt to avoid saying the word \"recession\".\n\nIn comedy\n\nDoublespeak, particularly when exaggerated, can be used as a device in satirical comedy and social commentary to ironically parody political or bureaucratic establishments intent on obfuscation or prevarication.  The television series Yes Minister is notable for its use of this device.  Oscar Wilde was an early proponent of this device and a significant influence on Orwell. Doublespeak. http://en.wikipedia.org/?curid=8478."
  }
}
