{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15199",
  "eid" : "1a904940-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778553812,
  "textBody" : "Papua is the largest and easternmost province of Indonesia, comprising most of Western New Guinea. Papua is bordered by the nation of Papua New Guinea to the east, and by West Papua province to the west. Since 2002, Papua province has special autonomy status, making it a special region. Its capital is Jayapura. It was formerly called Irian Jaya (and earlier West Irian or Irian Barat) and comprised all of Indonesian New Guinea. In 2002 the current name was adopted and in 2003 West Papua province was created from western parts of Papua province.\n\nNaming \n\n\"Papua\" is the official Indonesian and internationally recognised name for the province.\n\nDuring the Dutch colonial era the region was known as part of \"Dutch New Guinea\" or \"Netherlands New Guinea\". Since its annexation in 1969, it became known as \"West Irian\" or \"Irian Barat\" until 1973, and thereafter renamed \"Irian Jaya\" (roughly translated, \"Glorious Irian\") by the Suharto administration. This was the official name until the name \"Papua\" was adopted in 2002. Today, the indigenous inhabitants of this province prefer to call themselves Papuans.\n\nThe name \"West Papua\" was adopted in 1961 by the New Guinea Council until the United Nations Temporary Executive Authority (UNTEA) transferred administration to the Republic of Indonesia in 1963. \"West Papua\" has since been used by Papuans as a self-identifying term, especially by those demanding self-determination, and usually refers to the whole of the Indonesian portion of New Guinea. The other Indonesian province that shares New Guinea, West Irian Jaya, has been officially renamed as West Papua, or Papua Barat. The entire western New Guinea is often referred to as \"West Papua\" internationally – especially among networks of international solidarity with the West Papuan independence movement.\n\nGovernment \n\nThe province of Papua is governed by a directly elected governor (currently Lukas Enembe) and a regional legislature, People's Representative Council of province of Papua (Dewan Perwakilan Rakyat Papua). A government organisation that only exists in Papua is the Papuan People's Council (Majelis Rakyat Papua) Papuan People's Council), which was formed by the Indonesian Government in 2005 as a coalition of Papuan tribal chiefs, tasked with arbitration and speaking on behalf of Papuan tribal customs.\n\nIndonesian sovereignty over Papua dates back to 1969, when Indonesia conducted a referendum (referred to by the Indonesian government as the Act of Free Choice) on the self-determination of the peoples of Papua under an agreement with the United Nations to respect any result. Instead of conducting a democratic referendum amongst the general population, Indonesian security forces forcibly coerced a small number of tribal elders to vote to join Indonesia; some elders were not even made aware that a referendum was to be conducted beforehand. Nevertheless, the agreement with the UN was nominally upheld, and was recognised by the international community in spite of protests. This intensified the independence movement among indigenous West Papuans, deepening the Papua conflict, which began when the Dutch withdrew from the East Indies in 1963. The conflict has continued to the present, with Indonesian security forces being accused of numerous human rights abuses in their suppression of the independence movement. The Indonesian government maintains tight control over the region, barring foreign journalists or rights monitors from entering; those who do must do so covertly.\n\nIn 1999 it was proposed to split the province into three government-controlled sectors, sparking Papuan protests. In January 2003 President Megawati Sukarnoputri signed an order dividing Papua into three provinces: Central Irian Jaya (Irian Jaya Tengah), Papua (or East Irian Jaya, Irian Jaya Timur), and West Papua (Irian Jaya Barat). The formality of installing a local government for Jaraka in Irian Jaya Barat (West) took place in February 2003 and a governor was appointed in November; a government for Irian Jaya Tengah (Central Irian Jaya) was delayed from August 2003 due to violent local protests. The creation of this separate Central Irian Jaya Province was blocked by Indonesian courts, who declared it to be unconstitutional and in contravention of the Papua's special autonomy agreement. The previous division into two provinces was allowed to stand as an established fact.King, 2004, p. 91\n\nSpecial autonomy status \n\nThe province of Papua is one of three provinces to have obtained special autonomy status, the others being Aceh and West Papua. According to Law 21/2001 on Special Autonomy Status (UU Nomor 21 Tahun 2001 tentang Otonomi khusus Papua), the provincial government of Papua is provided with authority within all sectors of administration, except for the five strategic areas of foreign affairs, security and defense,  monetary and fiscal affairs, religion and justice. The provincial government is authorised to issue local regulations to further stipulate the implementation of the special autonomy, including regulating the authority of districts and municipalities within the province. Due to its special autonomy status, Papua province is provided with significant amount of special autonomy funds, which can be used to benefit its indigenous peoples. But the province has low fiscal capacity and it is highly dependent on unconditional transfers and the above-mentioned special autonomy fund, which accounted for about 55% of total revenues in 2008.\n\nAfter obtaining its special autonomy status, in order to allow the local population access to timber production benefits, the Papuan provincial government issued a number of decrees, enabling:\n* a Timber Logging Permit for Customary Communities, which enabled local people to carry out timber extraction in small concessions (250 to 1,000 hectares) for one year through a community-based or participatory community cooperative;\n* a Permit to Manage Customary Forests, which was a timber extraction permit for larger concessions (up to 2,000 hectares) for a maximum of 20 years;\n* logging companies had to pay compensations to local communities in addition to all other fees and taxes collected by the national government.\n\nAdministrative divisions \n\nAs of 2010 (following the separation of West Papua Province in 2003), the residual Papua Province consisted of 28 regencies (kabupaten) and one autonomous city (kota); these regencies and the city are together subdivided into 385 districts (kecamatan), and thence into \"villages\" (kelurahan and desa). In Papua, as well as in the province of West Papua, kecamatan are commonly referred to as distrik.\n\nThe regencies (kabupaten) and the city (kota) are listed below with their areas and their populations at the 2010 Census and according to the latest official (January 2014) Estimates.\n\n* The 2005 estimated population of Boven Digoel Regency is included in the figure quoted for Merauke Regency, from which Boven Digoel was divided.\n# The 2005 estimated population of this regency are included in the figures quoted for the existing regency from which the newer regency was divided in 2007 or 2008.\n\nProvincial decentralisation history\n\nIn 2000, the present area of Papua Province originally consisted of nine regencies:\n\n* Biak Numfor, Jayapura, Jayawijaya, Merauke, Mimika, Nabire, Paniai, Puncak Jaya and Yapen Waropen\n\nOn 12 November 2002, the following regencies were created:\n\n* Keerom and Sarmi Regencies were split from Jayapura Regency\n* Bintang Mountains (Pegunungan Bintan), Tolikara and Yahukimo Regencies were split from Jayawijaya Regency\n* Asmat, Boven Digoel and Mappi Regencies were split from Merauke Regency\n* Yapen Waropen Regency was split into Yapen Islands Regency (Kepulauan Yapen) and Waropen Regency\n\nOn 8 January 2004, Supiori Regency was split from Biak Numfor Regency.\n\nOn 15 March 2007, under Law No. 19/2007, the following regencies were created:\n\n* Mamberamo Raya Regency was formed from parts of Sarmi and Waropen Regencies\n* Dogiyai Regency was similarly formed from the southern districts of Nabire Regency\n\nOn 4 January 2008, five other new regencies were created by Home Affairs Minister Mardiyanto who also installed five temporary regents. These five new regencies were:\n\n* 4 formerly from part of Jayawijaya Regency:\n** Central Mamberamo Regency with five districts, with Kobakma as the regental seat. Created by the Law No. 3/2008, the first regent was David Pagawak.\n** Yalimo Regency also has five districts, with Elelim as the regental capital. Created by the Law No. 4/2008, the first regent was Elia Ibrahim Loupatty.\n** Lanny Jaya Regency with 10 districts, with Tiom as the regental capital. Created by the Law No.5/2008, the first regent was Pribadi Sukartono.\n** Nduga Regency with 8 districts, with Kenyam as the regental capital. Created by the Law No. 6/2008, the first regent was Hans Dortheus.\n* 1 formerly from part of Puncak Jaya Regency:\n** Puncak Regency also has 8 districts, with Ilaga as the regental capital. Created by the Law No. 7/2008, the first regent was Simon Alom.\n\nWithin 2008, Intan Jaya and Deiyai Regencies were split from Paniai Regency.\n\nProposed new regencies, cities and provinces\n\nOn 25 October 2013 the Indonesian House of Representatives (DPR) began reviewing draft laws on the establishment of 57 prospective regencies/cities (and 8 new provinces).Jakarta Post, 14 November 2013 This included two new provinces to be formed from parts of the existing Papua Province (and one new province from West Papua Province), as well as the creation of seventeen new regencies and two new cities (independent municipalities). The new regencies will be:\n\n* Moyo, Muara Digul and Admi Korbay\n* Gili Menawa, Balin Senter, Bogaga, Puncak Trikora, Katengban, Okika, Yalimek, Ser Yahukimo Western Mountains, Mambera Hulu, Southwest Yahukimo, East Yahukimo and North Yahukimo\n* Northwest Yapen, East Yapen, Numfor Island and Ghondumi Sisare\n\nAnd the new cities will be the municipalities of:\n* Merauke and Lembah Baliem (Baliem Valley)\n\nThe two new provinces from parts of the existing Papua province have recently been approved by Indonesia's House of Representatives:\n\n* South Papua, and\n* Central Papua\n\nAnother new province, to be split from West Papua will be Southwest Papua.\n\nSouth Papua\n\nThe proposed South Papua (Papua Selatan) Province would cover an area of 119,749 square km, which is rich in natural resources. It will encompass four existing regencies:\n\n* Asmat, Boven Digoel, Mappi and Merauke\n\nAnd will thus equate closely to the original Merauke Regency prior to the splitting of that entity in 2002. Within the existing regencies, new regencies to be added are the following:\n\n* Moyo (from Boven Digoel Regency)\n* Muara Digul and Admi Korbay (both from Mappi Regency)\n\nAnd a new municipality of Merauke City (which is scheduled to be created from Merauke Regency)\n\nCentral Papua\n\nAccording to a 20 January 2012 report in the Cenderawasih Pos Jakarta, the central government is moving forward with the creation of \"Central Papua\". At that time it was envisaged that the new province would comprise ten existing regencies:\n\n* Supiori, Biak Numfor, Yapen Islands, Waropen, Nabire, Dogiyai, Deiyai, Intan Jaya, Paniai, and Mimika\n\nThe new Central Papua Province, and the residual Papua Province, would together include the new regencies.\n\nFirst of, for Papua Proper:\n\n* Gili Menawa (from Jayapura Regency)\n* Balin Senter (from Lanny Jaya Regency and Tolikara Regency)\n* Boboga (from Tolikara Regency)\n* Puncak Trikora (from Lanny Jaya Regency)\n* Katengban (from Bintang Mountains Regency)\n* Okika (from Jayawijaya Regency), and\n* Yalimek, Ser Yahukimo Western Mountains, Mambera Hulu, Southwest Yahukimo, East Yahukimo and North Yakuhimo (all six from Yahukimo Regency)\n\nAnd a new municipality of Lembah Baliem (Baliem Valley, created from Jayawijaya Regency)\n\nAnd for Central Papua:\n\n* Northwest Yapen and East Yapen (both from Yapen Islands Regency)\n* Numfor Island (from Biak Numfor Regency), and\n* Ghondumi Sisare (from Waropen Regency)\n\nJayapura City\n\nThe city of Jayapura also has the status of an autonomous city, equal to a regency. It was founded on 7 March 1910 as Hollandia and is the capital. Since Indonesian administration the name of the city has been changed to Kotabaru, then to Sukarnopura before its current name, Jayapura. Jayapura is also the largest city of Papua Province, with a small but active tourism industry. It is built on a slope overlooking the bay. Cenderawasih University (UNCEN) campus at Abepura houses the University Museum where some of the Asmat artifacts collected by Michael Rockefeller is stored. Both Tanjung Ria beach, near the market at Hamadi – site of 22 April 1944 Allied invasion during World War II – and the site of General Douglas MacArthur's World War II headquarters at Ifar Gunung have monuments commemorating the events.\n\nGeography \n\nA central east–west mountain range dominates the geography of the island of New Guinea, over 1600 km in total length. The western section is around 600 km long and 100 km across. The province contains the highest mountains between the Himalayas and the Andes, rising up to 4884 m high, and ensuring a steady supply of rain from the tropical atmosphere. The tree line is around 4000 m elevation and the tallest peaks contain permanent equatorial glaciers, increasingly melting due to a changing climate. Various other smaller mountain ranges occur both north and west of the central ranges. Except in high elevations, most areas possess a hot humid climate throughout the year, with some seasonal variation associated with the northeast monsoon season.\n\nThe southern and northern lowlands stretch for hundreds of kilometres and include lowland rainforests, extensive wetlands, savanna grasslands, and expanses of mangrove forest. The southern lowlands are the site of Lorentz National Park, also a UNESCO World Heritage Site.\n\nThe province's largest river is the Mamberamo located in the northern part of the province. The result is a large area of lakes and rivers known as the Lakes Plains region. The Baliem Valley, home of the Dani people, is a tableland 1600 m above sea level in the midst of the central mountain range. Puncak Jaya, also known by its Dutch colonial name, \"Carstensz Pyramid\", is a limestone mountain peak 4884 m above sea level. It is the highest peak of Oceania.\n\nEthnic groups \n\nThe following are some of the most well-known ethnic groups of Papua:\n\n* Amungme\n* Asmat\n* Bauzi\n* Dani\n* Kamoro\n* Kombai\n* Korowai\n* Mee\n* Sentani\n* Yali\n* Yei\n\nThe Yei (pronounced Yay) are sometimes known as the Jei, Je, Yei-nan people.\n\nThere are approximately 2,500 speakers of the Yei language. 40% Ethno Religionists- animistic tribal religion 60% Catholics and other Christians (blended with animistic beliefs & customs):\nThe Yei language is believed to have two dialects observed by a Wycliffe, SIL language survey in 2001. At home the Yei people speak their own language but use Indonesian for trade, wider communication and at school. Most Yei are literate in Indonesian.\n\nThere are elementary schools in each village. About 10–30% of children continue in middle school. Very few go to high school. \nThe nearest high school is in Merauke city.\nThey live primarily by hunting, fishing, and gardening short and long term crops in the lowlands. The Yei diet mainly consists of rice, vegetables, fish and roasted sago.\nWith their land at an altitude of less than 100 meters above sea level, the Yei people can best be accessed by vehicle on the road from Merauke or by motorized canoe up the Maro River. There is no airstrip or airplane access other than float plane which is currently available from Merauke through MAF by about a 15-minute flight to Toray.\nThe Poo and Bupul villages have a clinic but people still use traditional medicines.\nThere is very little infrastructure in the area: no telephones or toilets. At night electricity is run from a generator. There are single side-band radios (SSBs) in Bupul, Tanas, Poo, and Erambu villages, mainly used by the police and military force. Most villages get their drinking water from the Maro River, but some get it from wells or by collecting rain.\n\nDemographics \n\nThe population of Papua province has a fertility rate of 2.9 children per woman  The population grew from the 1.9 million recorded in the 2000 Indonesia Census, to 2.9 million as recorded by the 2010 Census,http://www.thejakartapost.com/news/2010/08/23/population-growth-%E2%80%98good-papua%E2%80%99.html and is officially estimated to be at about 3.5 million in 2014. Since the early 1990s Papua has had the highest population growth rate of all Indonesian provinces at over 3% annually. This is partly a result of birth rates, but mainly due to migration from other parts of Indonesia. While indigenous Papuans formed the near-totality of the population in 1961, they are now roughly 50% of the population, the other half being composed of non-Papuan migrants coming from other parts of Indonesia. An overwhelming percentage of these migrants came as part of a government-sponsored transmigration program.\n\nThe densest population center, other than the large coastal cities that house Indonesian bureaucratic and commercial apparatus, is located in and around the town of Wamena in the Baliem Valley of the Central Highlands.\n\nReligion\n\nAccording to the 2010 census, 83.15% of the Papuans identified themselves as Christian with 65.48% being Protestant and 17.67% being Roman Catholic. 15.88% of the population was Muslim and less than 1% were Buddhist or Hindu. There is also substantial practice of animism by Papuans.\n\nEconomy \n\nIn 2011, Papuan caretaker governor Syamsul Arief Rivai claimed Papua's forests cover 42 million hectares with an estimated worth of Rp.700 trillion ($78 billion) and that if the forests were managed properly and sustainably, they could produce over 500 million cubic meters of logs per annum.\n\nThe Grasberg Mine, the world's largest gold mine and third largest copper mine,[https://www.nytimes.com/2005/12/27/international/asia/27gold.html?pagewanted=2 Jane Perlez and Raymond Bonner (2005): Below a Mountain of Wealth, a River of Waste. The New York Times, 27 December 2005.] Accessed 6 December 2011. is located in the highlands near Puncak Jaya, the highest mountain in Papua.\n\nEcology \n\nThe island has an estimated 16,000 species of plant, 124 genera of which are endemic. Papua's known forest fauna includes; marsupials (including possums, wallabies, tree-kangaroos, cuscuses); other mammals (including the endangered long-beaked echidna); bird species such as birds-of-paradise, cassowaries, parrots, and cockatoos; the world's longest lizards (Papua monitor); and the world's largest butterflies.[http://www.nationstates.net/pagedispatch/id\n655695 Dispatch – The Republic of Irian Barat]. NationStates, Accessed 15 September 2017.\n\nThe waterways and wetlands of Papua are also home to salt and freshwater crocodile, tree monitors, flying foxes, osprey, bats and other animals; while the equatorial glacier fields remain largely unexplored.\n\nProtected areas within Papua province include the World Heritage Lorentz National Park, and the Wasur National Park, a Ramsar wetland of international importance.\n\nIn February 2006, a team of scientists exploring the Foja Mountains, Sarmi, discovered new species of birds, butterflies, amphibians, and plants, including possibly the largest-flowered species of rhododendron.\n\nEcological threats include logging-induced deforestation, forest conversion for plantation agriculture (including oil palm), smallholder agricultural conversion, the introduction and potential spread of alien species such as the crab-eating macaque which preys on and competes with indigenous species, the illegal species trade, and water pollution from oil and mining operations.\n\nHarmoni Award 2016\n\nReligion Ministry has awarded Harmoni Award 2016 to Papua Regency due to religion tolerance in this area. Jayapura as a capital city of Papua Regency is also got the same award. The ministry give 10 awards, 3 award for provinces and 7 for regencies/cities.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Papua (province)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15199" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Papua is the largest and easternmost province of Indonesia, comprising most of Western New Guinea. Papua is bordered by the nation of Papua New Guinea to the east, and by West Papua province to the west. Since 2002, Papua province has special autonomy status, making it a special region. Its capital is Jayapura. It was formerly called Irian Jaya (and earlier West Irian or Irian Barat) and comprised all of Indonesian New Guinea. In 2002 the current name was adopted and in 2003 West Papua province was created from western parts of Papua province.\n\nNaming \n\n\"Papua\" is the official Indonesian and internationally recognised name for the province.\n\nDuring the Dutch colonial era the region was known as part of \"Dutch New Guinea\" or \"Netherlands New Guinea\". Since its annexation in 1969, it became known as \"West Irian\" or \"Irian Barat\" until 1973, and thereafter renamed \"Irian Jaya\" (roughly translated, \"Glorious Irian\") by the Suharto administration. This was the official name until the name \"Papua\" was adopted in 2002. Today, the indigenous inhabitants of this province prefer to call themselves Papuans.\n\nThe name \"West Papua\" was adopted in 1961 by the New Guinea Council until the United Nations Temporary Executive Authority (UNTEA) transferred administration to the Republic of Indonesia in 1963. \"West Papua\" has since been used by Papuans as a self-identifying term, especially by those demanding self-determination, and usually refers to the whole of the Indonesian portion of New Guinea. The other Indonesian province that shares New Guinea, West Irian Jaya, has been officially renamed as West Papua, or Papua Barat. The entire western New Guinea is often referred to as \"West Papua\" internationally – especially among networks of international solidarity with the West Papuan independence movement.\n\nGovernment \n\nThe province of Papua is governed by a directly elected governor (currently Lukas Enembe) and a regional legislature, People's Representative Council of province of Papua (Dewan Perwakilan Rakyat Papua). A government organisation that only exists in Papua is the Papuan People's Council (Majelis Rakyat Papua) Papuan People's Council), which was formed by the Indonesian Government in 2005 as a coalition of Papuan tribal chiefs, tasked with arbitration and speaking on behalf of Papuan tribal customs.\n\nIndonesian sovereignty over Papua dates back to 1969, when Indonesia conducted a referendum (referred to by the Indonesian government as the Act of Free Choice) on the self-determination of the peoples of Papua under an agreement with the United Nations to respect any result. Instead of conducting a democratic referendum amongst the general population, Indonesian security forces forcibly coerced a small number of tribal elders to vote to join Indonesia; some elders were not even made aware that a referendum was to be conducted beforehand. Nevertheless, the agreement with the UN was nominally upheld, and was recognised by the international community in spite of protests. This intensified the independence movement among indigenous West Papuans, deepening the Papua conflict, which began when the Dutch withdrew from the East Indies in 1963. The conflict has continued to the present, with Indonesian security forces being accused of numerous human rights abuses in their suppression of the independence movement. The Indonesian government maintains tight control over the region, barring foreign journalists or rights monitors from entering; those who do must do so covertly.\n\nIn 1999 it was proposed to split the province into three government-controlled sectors, sparking Papuan protests. In January 2003 President Megawati Sukarnoputri signed an order dividing Papua into three provinces: Central Irian Jaya (Irian Jaya Tengah), Papua (or East Irian Jaya, Irian Jaya Timur), and West Papua (Irian Jaya Barat). The formality of installing a local government for Jaraka in Irian Jaya Barat (West) took place in February 2003 and a governor was appointed in November; a government for Irian Jaya Tengah (Central Irian Jaya) was delayed from August 2003 due to violent local protests. The creation of this separate Central Irian Jaya Province was blocked by Indonesian courts, who declared it to be unconstitutional and in contravention of the Papua's special autonomy agreement. The previous division into two provinces was allowed to stand as an established fact.King, 2004, p. 91\n\nSpecial autonomy status \n\nThe province of Papua is one of three provinces to have obtained special autonomy status, the others being Aceh and West Papua. According to Law 21/2001 on Special Autonomy Status (UU Nomor 21 Tahun 2001 tentang Otonomi khusus Papua), the provincial government of Papua is provided with authority within all sectors of administration, except for the five strategic areas of foreign affairs, security and defense,  monetary and fiscal affairs, religion and justice. The provincial government is authorised to issue local regulations to further stipulate the implementation of the special autonomy, including regulating the authority of districts and municipalities within the province. Due to its special autonomy status, Papua province is provided with significant amount of special autonomy funds, which can be used to benefit its indigenous peoples. But the province has low fiscal capacity and it is highly dependent on unconditional transfers and the above-mentioned special autonomy fund, which accounted for about 55% of total revenues in 2008.\n\nAfter obtaining its special autonomy status, in order to allow the local population access to timber production benefits, the Papuan provincial government issued a number of decrees, enabling:\n* a Timber Logging Permit for Customary Communities, which enabled local people to carry out timber extraction in small concessions (250 to 1,000 hectares) for one year through a community-based or participatory community cooperative;\n* a Permit to Manage Customary Forests, which was a timber extraction permit for larger concessions (up to 2,000 hectares) for a maximum of 20 years;\n* logging companies had to pay compensations to local communities in addition to all other fees and taxes collected by the national government.\n\nAdministrative divisions \n\nAs of 2010 (following the separation of West Papua Province in 2003), the residual Papua Province consisted of 28 regencies (kabupaten) and one autonomous city (kota); these regencies and the city are together subdivided into 385 districts (kecamatan), and thence into \"villages\" (kelurahan and desa). In Papua, as well as in the province of West Papua, kecamatan are commonly referred to as distrik.\n\nThe regencies (kabupaten) and the city (kota) are listed below with their areas and their populations at the 2010 Census and according to the latest official (January 2014) Estimates.\n\n* The 2005 estimated population of Boven Digoel Regency is included in the figure quoted for Merauke Regency, from which Boven Digoel was divided.\n# The 2005 estimated population of this regency are included in the figures quoted for the existing regency from which the newer regency was divided in 2007 or 2008.\n\nProvincial decentralisation history\n\nIn 2000, the present area of Papua Province originally consisted of nine regencies:\n\n* Biak Numfor, Jayapura, Jayawijaya, Merauke, Mimika, Nabire, Paniai, Puncak Jaya and Yapen Waropen\n\nOn 12 November 2002, the following regencies were created:\n\n* Keerom and Sarmi Regencies were split from Jayapura Regency\n* Bintang Mountains (Pegunungan Bintan), Tolikara and Yahukimo Regencies were split from Jayawijaya Regency\n* Asmat, Boven Digoel and Mappi Regencies were split from Merauke Regency\n* Yapen Waropen Regency was split into Yapen Islands Regency (Kepulauan Yapen) and Waropen Regency\n\nOn 8 January 2004, Supiori Regency was split from Biak Numfor Regency.\n\nOn 15 March 2007, under Law No. 19/2007, the following regencies were created:\n\n* Mamberamo Raya Regency was formed from parts of Sarmi and Waropen Regencies\n* Dogiyai Regency was similarly formed from the southern districts of Nabire Regency\n\nOn 4 January 2008, five other new regencies were created by Home Affairs Minister Mardiyanto who also installed five temporary regents. These five new regencies were:\n\n* 4 formerly from part of Jayawijaya Regency:\n** Central Mamberamo Regency with five districts, with Kobakma as the regental seat. Created by the Law No. 3/2008, the first regent was David Pagawak.\n** Yalimo Regency also has five districts, with Elelim as the regental capital. Created by the Law No. 4/2008, the first regent was Elia Ibrahim Loupatty.\n** Lanny Jaya Regency with 10 districts, with Tiom as the regental capital. Created by the Law No.5/2008, the first regent was Pribadi Sukartono.\n** Nduga Regency with 8 districts, with Kenyam as the regental capital. Created by the Law No. 6/2008, the first regent was Hans Dortheus.\n* 1 formerly from part of Puncak Jaya Regency:\n** Puncak Regency also has 8 districts, with Ilaga as the regental capital. Created by the Law No. 7/2008, the first regent was Simon Alom.\n\nWithin 2008, Intan Jaya and Deiyai Regencies were split from Paniai Regency.\n\nProposed new regencies, cities and provinces\n\nOn 25 October 2013 the Indonesian House of Representatives (DPR) began reviewing draft laws on the establishment of 57 prospective regencies/cities (and 8 new provinces).Jakarta Post, 14 November 2013 This included two new provinces to be formed from parts of the existing Papua Province (and one new province from West Papua Province), as well as the creation of seventeen new regencies and two new cities (independent municipalities). The new regencies will be:\n\n* Moyo, Muara Digul and Admi Korbay\n* Gili Menawa, Balin Senter, Bogaga, Puncak Trikora, Katengban, Okika, Yalimek, Ser Yahukimo Western Mountains, Mambera Hulu, Southwest Yahukimo, East Yahukimo and North Yahukimo\n* Northwest Yapen, East Yapen, Numfor Island and Ghondumi Sisare\n\nAnd the new cities will be the municipalities of:\n* Merauke and Lembah Baliem (Baliem Valley)\n\nThe two new provinces from parts of the existing Papua province have recently been approved by Indonesia's House of Representatives:\n\n* South Papua, and\n* Central Papua\n\nAnother new province, to be split from West Papua will be Southwest Papua.\n\nSouth Papua\n\nThe proposed South Papua (Papua Selatan) Province would cover an area of 119,749 square km, which is rich in natural resources. It will encompass four existing regencies:\n\n* Asmat, Boven Digoel, Mappi and Merauke\n\nAnd will thus equate closely to the original Merauke Regency prior to the splitting of that entity in 2002. Within the existing regencies, new regencies to be added are the following:\n\n* Moyo (from Boven Digoel Regency)\n* Muara Digul and Admi Korbay (both from Mappi Regency)\n\nAnd a new municipality of Merauke City (which is scheduled to be created from Merauke Regency)\n\nCentral Papua\n\nAccording to a 20 January 2012 report in the Cenderawasih Pos Jakarta, the central government is moving forward with the creation of \"Central Papua\". At that time it was envisaged that the new province would comprise ten existing regencies:\n\n* Supiori, Biak Numfor, Yapen Islands, Waropen, Nabire, Dogiyai, Deiyai, Intan Jaya, Paniai, and Mimika\n\nThe new Central Papua Province, and the residual Papua Province, would together include the new regencies.\n\nFirst of, for Papua Proper:\n\n* Gili Menawa (from Jayapura Regency)\n* Balin Senter (from Lanny Jaya Regency and Tolikara Regency)\n* Boboga (from Tolikara Regency)\n* Puncak Trikora (from Lanny Jaya Regency)\n* Katengban (from Bintang Mountains Regency)\n* Okika (from Jayawijaya Regency), and\n* Yalimek, Ser Yahukimo Western Mountains, Mambera Hulu, Southwest Yahukimo, East Yahukimo and North Yakuhimo (all six from Yahukimo Regency)\n\nAnd a new municipality of Lembah Baliem (Baliem Valley, created from Jayawijaya Regency)\n\nAnd for Central Papua:\n\n* Northwest Yapen and East Yapen (both from Yapen Islands Regency)\n* Numfor Island (from Biak Numfor Regency), and\n* Ghondumi Sisare (from Waropen Regency)\n\nJayapura City\n\nThe city of Jayapura also has the status of an autonomous city, equal to a regency. It was founded on 7 March 1910 as Hollandia and is the capital. Since Indonesian administration the name of the city has been changed to Kotabaru, then to Sukarnopura before its current name, Jayapura. Jayapura is also the largest city of Papua Province, with a small but active tourism industry. It is built on a slope overlooking the bay. Cenderawasih University (UNCEN) campus at Abepura houses the University Museum where some of the Asmat artifacts collected by Michael Rockefeller is stored. Both Tanjung Ria beach, near the market at Hamadi – site of 22 April 1944 Allied invasion during World War II – and the site of General Douglas MacArthur's World War II headquarters at Ifar Gunung have monuments commemorating the events.\n\nGeography \n\nA central east–west mountain range dominates the geography of the island of New Guinea, over 1600 km in total length. The western section is around 600 km long and 100 km across. The province contains the highest mountains between the Himalayas and the Andes, rising up to 4884 m high, and ensuring a steady supply of rain from the tropical atmosphere. The tree line is around 4000 m elevation and the tallest peaks contain permanent equatorial glaciers, increasingly melting due to a changing climate. Various other smaller mountain ranges occur both north and west of the central ranges. Except in high elevations, most areas possess a hot humid climate throughout the year, with some seasonal variation associated with the northeast monsoon season.\n\nThe southern and northern lowlands stretch for hundreds of kilometres and include lowland rainforests, extensive wetlands, savanna grasslands, and expanses of mangrove forest. The southern lowlands are the site of Lorentz National Park, also a UNESCO World Heritage Site.\n\nThe province's largest river is the Mamberamo located in the northern part of the province. The result is a large area of lakes and rivers known as the Lakes Plains region. The Baliem Valley, home of the Dani people, is a tableland 1600 m above sea level in the midst of the central mountain range. Puncak Jaya, also known by its Dutch colonial name, \"Carstensz Pyramid\", is a limestone mountain peak 4884 m above sea level. It is the highest peak of Oceania.\n\nEthnic groups \n\nThe following are some of the most well-known ethnic groups of Papua:\n\n* Amungme\n* Asmat\n* Bauzi\n* Dani\n* Kamoro\n* Kombai\n* Korowai\n* Mee\n* Sentani\n* Yali\n* Yei\n\nThe Yei (pronounced Yay) are sometimes known as the Jei, Je, Yei-nan people.\n\nThere are approximately 2,500 speakers of the Yei language. 40% Ethno Religionists- animistic tribal religion 60% Catholics and other Christians (blended with animistic beliefs & customs):\nThe Yei language is believed to have two dialects observed by a Wycliffe, SIL language survey in 2001. At home the Yei people speak their own language but use Indonesian for trade, wider communication and at school. Most Yei are literate in Indonesian.\n\nThere are elementary schools in each village. About 10–30% of children continue in middle school. Very few go to high school. \nThe nearest high school is in Merauke city.\nThey live primarily by hunting, fishing, and gardening short and long term crops in the lowlands. The Yei diet mainly consists of rice, vegetables, fish and roasted sago.\nWith their land at an altitude of less than 100 meters above sea level, the Yei people can best be accessed by vehicle on the road from Merauke or by motorized canoe up the Maro River. There is no airstrip or airplane access other than float plane which is currently available from Merauke through MAF by about a 15-minute flight to Toray.\nThe Poo and Bupul villages have a clinic but people still use traditional medicines.\nThere is very little infrastructure in the area: no telephones or toilets. At night electricity is run from a generator. There are single side-band radios (SSBs) in Bupul, Tanas, Poo, and Erambu villages, mainly used by the police and military force. Most villages get their drinking water from the Maro River, but some get it from wells or by collecting rain.\n\nDemographics \n\nThe population of Papua province has a fertility rate of 2.9 children per woman  The population grew from the 1.9 million recorded in the 2000 Indonesia Census, to 2.9 million as recorded by the 2010 Census,http://www.thejakartapost.com/news/2010/08/23/population-growth-%E2%80%98good-papua%E2%80%99.html and is officially estimated to be at about 3.5 million in 2014. Since the early 1990s Papua has had the highest population growth rate of all Indonesian provinces at over 3% annually. This is partly a result of birth rates, but mainly due to migration from other parts of Indonesia. While indigenous Papuans formed the near-totality of the population in 1961, they are now roughly 50% of the population, the other half being composed of non-Papuan migrants coming from other parts of Indonesia. An overwhelming percentage of these migrants came as part of a government-sponsored transmigration program.\n\nThe densest population center, other than the large coastal cities that house Indonesian bureaucratic and commercial apparatus, is located in and around the town of Wamena in the Baliem Valley of the Central Highlands.\n\nReligion\n\nAccording to the 2010 census, 83.15% of the Papuans identified themselves as Christian with 65.48% being Protestant and 17.67% being Roman Catholic. 15.88% of the population was Muslim and less than 1% were Buddhist or Hindu. There is also substantial practice of animism by Papuans.\n\nEconomy \n\nIn 2011, Papuan caretaker governor Syamsul Arief Rivai claimed Papua's forests cover 42 million hectares with an estimated worth of Rp.700 trillion ($78 billion) and that if the forests were managed properly and sustainably, they could produce over 500 million cubic meters of logs per annum.\n\nThe Grasberg Mine, the world's largest gold mine and third largest copper mine,[https://www.nytimes.com/2005/12/27/international/asia/27gold.html?pagewanted=2 Jane Perlez and Raymond Bonner (2005): Below a Mountain of Wealth, a River of Waste. The New York Times, 27 December 2005.] Accessed 6 December 2011. is located in the highlands near Puncak Jaya, the highest mountain in Papua.\n\nEcology \n\nThe island has an estimated 16,000 species of plant, 124 genera of which are endemic. Papua's known forest fauna includes; marsupials (including possums, wallabies, tree-kangaroos, cuscuses); other mammals (including the endangered long-beaked echidna); bird species such as birds-of-paradise, cassowaries, parrots, and cockatoos; the world's longest lizards (Papua monitor); and the world's largest butterflies.[http://www.nationstates.net/pagedispatch/id\n655695 Dispatch – The Republic of Irian Barat]. NationStates, Accessed 15 September 2017.\n\nThe waterways and wetlands of Papua are also home to salt and freshwater crocodile, tree monitors, flying foxes, osprey, bats and other animals; while the equatorial glacier fields remain largely unexplored.\n\nProtected areas within Papua province include the World Heritage Lorentz National Park, and the Wasur National Park, a Ramsar wetland of international importance.\n\nIn February 2006, a team of scientists exploring the Foja Mountains, Sarmi, discovered new species of birds, butterflies, amphibians, and plants, including possibly the largest-flowered species of rhododendron.\n\nEcological threats include logging-induced deforestation, forest conversion for plantation agriculture (including oil palm), smallholder agricultural conversion, the introduction and potential spread of alien species such as the crab-eating macaque which preys on and competes with indigenous species, the illegal species trade, and water pollution from oil and mining operations.\n\nHarmoni Award 2016\n\nReligion Ministry has awarded Harmoni Award 2016 to Papua Regency due to religion tolerance in this area. Jayapura as a capital city of Papua Regency is also got the same award. The ministry give 10 awards, 3 award for provinces and 7 for regencies/cities. Papua (province). http://en.wikipedia.org/?curid=15199."
  }
}
