{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16192",
  "eid" : "245c1170-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778570247,
  "textBody" : "In the 20th and 21st centuries the Julian calendar is 13 days behind the Gregorian calendar, thus January 14 is sometimes celebrated as New Year's Day (Old New Year) by religious groups who use the Julian calendar.\n\nEvents\n\n*1301 – Andrew III of Hungary dies, ending the Árpád dynasty in Hungary.\n*1343 – Arnošt of Pardubice becomes the last bishop of Prague and, subsequently, the first Archbishop of Prague.\n*1539 – Spain annexes Cuba.\n*1639 – The \"Fundamental Orders\", the first written constitution that created a government, is adopted in Connecticut.\n*1761 – The Third Battle of Panipat is fought in India between the Afghans under Ahmad Shah Durrani and the Marathas.\n*1784 – American Revolutionary War: Ratification Day, United States - Congress ratifies the Treaty of Paris with Great Britain.\n*1814 – Treaty of Kiel: Frederick VI of Denmark cedes Norway to Sweden in return for Pomerania.\n*1822 – Greek War of Independence: Acrocorinth is captured by Theodoros Kolokotronis and Demetrios Ypsilantis.\n*1858 – Napoleon III of France escapes an assassination attempt made by Felice Orsini and his accomplices in Paris.\n*1907 – An earthquake in Kingston, Jamaica kills more than 1,000 people.\n*1911 – Roald Amundsen's South Pole expedition makes landfall on the eastern edge of the Ross Ice Shelf.\n*1939 – Norway claims Queen Maud Land in Antarctica.\n*1943 – World War II: Japan begins Operation Ke, the successful operation to evacuate its forces from Guadalcanal during the Guadalcanal Campaign.\n*  1943   – World War II: Franklin D. Roosevelt and Winston Churchill begin the Casablanca Conference to discuss strategy and study the next phase of the war.\n*  1943   – World War II: Franklin D. Roosevelt becomes the first President of the United States to travel by airplane while in office when he travels from Miami to Morocco to meet with Winston Churchill.\n*1950 – The first prototype of the MiG-17 makes its maiden flight.\n*1952 – NBC's long-running morning news program Today debuts, with host Dave Garroway.\n*1953 – Josip Broz Tito is inaugurated as the first President of Yugoslavia.\n*1954 – The Hudson Motor Car Company merges with Nash-Kelvinator Corporation forming the American Motors Corporation.\n*1957 – Kripalu Maharaj was named fifth Jagadguru (world teacher) after giving seven days of speeches before 500 Hindu scholars.\n*1960 – The Reserve Bank of Australia, the country's central bank and banknote issuing authority, is established.\n*1967 – Counterculture of the 1960s: The Human Be-In takes place in San Francisco, California's Golden Gate Park, launching the Summer of Love.\n* 1967 - The New York Times reports that the U.S. Army is conducting secret germ warfare experiments.\n*1969 – USS Enterprise fire: An accidental explosion aboard the  near Hawaii kills 27 people.\n*1972 – Queen Margrethe II of Denmark ascends the throne, the first Queen of Denmark since 1412 and the first Danish monarch not named Frederick or Christian since 1513.\n*1973 – Elvis Presley's concert Aloha from Hawaii is broadcast live via satellite, and sets the record as the most watched broadcast by an individual entertainer in television history.\n*1993 – In Poland's worst peacetime maritime disaster, ferry MS Jan Heweliusz sinks off the coast of Rügen, drowning 55 passengers and crew; nine crew-members are saved.\n*2000 – A United Nations tribunal sentences five Bosnian Croats to up to 25 years in prison for the 1993 killing of more than 100 Bosnian Muslims. \n*2004 – The national flag of the Republic of Georgia, the so-called \"five cross flag\", is restored to official use after a hiatus of some 500 years.\n*2010 – Yemen declares an open war against the terrorist group al-Qaeda.\n*2011 – Former president of Tunisia, Zine El Abidine Ben Ali flees his country to Saudi Arabia after a series of street demonstrations against his regime and corrupt policies, asking for freedom, rights and democracy, considered as the anniversary of the Tunisian Revolution and the birth of the Arab Spring.\n*2018 - Russell M. Nelson becomes the 17th President of The Church of Jesus Christ of Latter-day Saints.\n\nBirths\n\n*83 BC– Mark Antony, Roman general and politician (d. 30 BCE)\n*1131 – Valdemar I of Denmark (d. 1182)\n*1273 – Joan I of Navarre, queen regnant of Navarre, queen consort of France (d. 1305)\n*1451 – Franchinus Gaffurius, Italian composer and theorist (d. 1522)\n*1477 – Hermann of Wied, German archbishop (d. 1552)\n*1476 – Anne St Leger, Baroness de Ros, English baroness (d. 1526)\n*1507 – Catherine of Austria, Queen of Portugal (d. 1578)\n*  1507   – Luca Longhi, Italian painter (d. 1580)\n*1551 – Abu'l-Fazl ibn Mubarak,  Grand vizier of emperor Akbar (d. 1602)\n*1552 – Alberico Gentili, Italian-English academic and jurist (d. 1608)\n*1615 – John Biddle, English minister and theologian (d. 1662)\n*1683 – Gottfried Silbermann, German instrument maker (d. 1753)\n*1684 – Johann Matthias Hase, German mathematician, astronomer, and cartographer (d. 1742)\n*  1684   – Jean-Baptiste van Loo, French painter (d. 1745)\n*1699 – Jakob Adlung, German organist, historian, and theorist (d. 1762)\n*1700 – Picander, German poet and playwright (d. 1764)\n*1702 – Emperor Nakamikado of Japan (d. 1737)\n*1705 – Jean-Baptiste Charles Bouvet de Lozier, French sailor, explorer, and politician (d. 1786)\n*1741 – Benedict Arnold, American-British general (d. 1801)\n*1767 – Maria Theresa of Austria (d. 1827)\n*1780 – Henry Baldwin, American judge and politician (d. 1844)\n*1792 – Christian de Meza, Danish general (d. 1865)\n*1793 – John C. Clark, American lawyer and politician (d. 1852)\n*1798 – Johan Rudolph Thorbecke, Dutch historian, jurist, and politician, 3rd Prime Minister of the Netherlands (d. 1872)\n*1800 – Ludwig Ritter von Köchel, Austrian composer, botanist, and publisher (d. 1877)\n*1806 – Charles Hotham, English-Australian soldier and politician, 1st Governor of Victoria (d. 1855)\n*  1806   – Matthew Fontaine Maury American astronomer, oceanographer, and historian (d. 1873)\n*1818 – Zachris Topelius, Finnish author and journalist (d. 1898)\n*1819 – Dimitrie Bolintineanu, Romanian poet and politician (d. 1872)\n*1824 – Vladimir Stasov, Russian critic (d. 1906)\n*1836 – Henri Fantin-Latour, French painter and lithographer (d. 1904)\n*1841 – Berthe Morisot, French painter (d. 1895)\n*1845 – Henry Petty-Fitzmaurice, 5th Marquess of Lansdowne, English politician, 34th Governor-General of India (d. 1927)\n*1850 – Pierre Loti, French captain and author (d. 1923)\n*1856 – J. F. Archibald, Australian journalist and publisher, co-founded The Bulletin (d. 1919)\n*1861 – Mehmed VI, Ottoman sultan (d. 1926)\n*1863 – Manuel de Oliveira Gomes da Costa, Portuguese general and politician, 10th President of Portugal (d. 1929)\n*  1863   – Richard F. Outcault, American author and illustrator (d. 1928)\n*1869 – Robert Fournier-Sarlovèze, French polo player and politician (d. 1937)\n*1870 – George Pearce, Australian carpenter and politician (d. 1952)\n*1875 – Albert Schweitzer, French-Gabonese physician and philosopher, Nobel Prize laureate (d. 1965)\n*1882 – Hendrik Willem van Loon, Dutch-American historian and journalist (d. 1944)\n*1883 – Nina Ricci, Italian-French fashion designer (d. 1970)\n*1886 – Hugh Lofting, English author and poet, created Doctor Dolittle (d. 1947)\n*1887 – Hugo Steinhaus, Polish mathematician and academic (d. 1972)\n*1892 – Martin Niemöller, German pastor and theologian (d. 1984)\n*  1892   – Hal Roach, American actor, director, and producer (d. 1992)\n*  1892   – George Wilson, English footballer (d. 1961)\n*1894 – Ecaterina Teodoroiu, Romanian soldier and nurse (d. 1917)\n*1896 – John Dos Passos, American novelist, poet, and playwright (d. 1970)\n*1897 – Hasso von Manteuffel, German general and politician (d. 1978)\n*1899 – Carlos P. Romulo, Filipino soldier and politician, President of the United Nations General Assembly (d. 1985)\n*1901 – Bebe Daniels, American actress (d. 1971)\n*  1901   – Alfred Tarski, Polish-American mathematician and philosopher (d. 1983)\n*1904 – Cecil Beaton, English photographer, painter, and costume designer (d. 1980)\n*  1904   – Emily Hahn, American journalist and author (d. 1997)\n*  1904   – Babe Siebert, Canadian ice hockey player and coach (d. 1939)\n*1905 – Takeo Fukuda, Japanese politician, 67th Prime Minister of Japan (d. 1995)\n*1906 – William Bendix, American actor (d. 1964)\n*1907 – Georges-Émile Lapalme, Canadian lawyer and politician (d. 1985)\n*1908 – Russ Columbo, American singer, violinist, and actor (d. 1934)\n*1909 – Brenda Forbes, English-American actress (d. 1996)\n*  1909   – Joseph Losey, American director, producer, and screenwriter (d. 1984)\n*1911 – Anatoly Rybakov, Russian-American author (d. 1998)\n*1912 – Tillie Olsen, American short story writer (d. 2007)\n*1914 – Harold Russell, Canadian-American soldier and actor (d. 2002)\n*  1914   – Selahattin Ülkümen, Turkish diplomat (d. 2003)\n*1915 – Mark Goodson, American game show producer, created Family Feud and The Price Is Right (d. 1992) \n*1919 – Giulio Andreotti, Italian journalist and politician, 41st Prime Minister of Italy (d. 2013)\n*  1919   – Andy Rooney, American soldier, journalist, critic, and television personality (d. 2011)\n*1920 – Bertus de Harder, Dutch footballer and manager (d. 1982)\n*1921 – Murray Bookchin, American author and philosopher (d. 2006)\n*  1921   – Kenneth Bulmer, American author (d. 2005)\n*1922 – Diana Wellesley, Duchess of Wellington (d. 2010)\n*1923 – Gerald Arpino, American dancer and choreographer (d. 2008)\n*  1923   – Fred Beckey, American mountaineer and author (d. 2017)\n*1924 – Carole Cook, American actress and singer \n*1925 – Jean-Claude Beton, Algerian-French engineer and businessman, founded Orangina (d. 2013)\n*  1925   – Moscelyne Larkin, American ballerina (d. 2012)\n*  1925   – Yukio Mishima, Japanese author, poet, and playwright (d. 1970)\n*1926 – Frank Aletter, American actor (d. 2009)\n*  1926   – Warren Mitchell, English actor and screenwriter (d. 2015)\n*  1926   – Tom Tryon, American actor and author (d. 1991)\n*1927 – Zuzana Růžičková, Czech harpsichord player (d. 2017)\n*1928 – Lars Forssell, Swedish author, poet, and songwriter (d. 2007)\n*  1928   – Hans Kornberg, German-English biologist and academic \n*  1928   – Garry Winogrand, American photographer and author (d. 1984)\n*1930 – Johnny Grande, American pianist and accordion player (Bill Haley & His Comets) (d. 2006)\n*  1930   – Kenny Wheeler, Canadian-English trumpet player and composer (d. 2014)\n*1931 – Frank Costigan, Australian lawyer and politician (d. 2009)\n*  1931   – Martin Holdgate, English biologist and academic\n*1932 – Don Garlits, American race car driver and engineer\n*1933 – Stan Brakhage, American director and producer (d. 2003)\n*1934 – Richard Briers, English actor (d. 2013)\n*  1934   – Alberto Rodriguez Larreta, Argentinian race car driver (d. 1977)\n*1936 – Clarence Carter, American blues and soul singer-songwriter, musician, and record producer\n*1937 – J. Bernlef, Dutch author and poet (d. 2012)\n*  1937   – Ken Higgs, English cricketer and coach (d. 2016)\n*  1937   – Leo Kadanoff, American physicist and academic (d. 2015)\n*  1937   – Rao Gopal Rao, Indian actor, producer, and politician (d. 1994)\n*  1937   – Sonny Siebert, American baseball player\n*  1937   – Billie Jo Spears, American country singer (d. 2011) \n*1938 – Morihiro Hosokawa, Japanese journalist and politician, 79th Prime Minister of Japan\n*  1938   – Jack Jones, American singer and actor\n*  1938   – Allen Toussaint, American singer-songwriter, pianist, and producer (d. 2015)\n*1939 – Kurt Moylan, Guamanian businessman and politician, 1st Lieutenant Governor of Guam\n*1940 – Julian Bond, American academic and politician (d. 2015)\n*  1940   – Ron Kostelnik, American football player (d. 1993)\n*  1940   – Siegmund Nimsgern, German opera singer\n*  1940   – Trevor Nunn, English director and composer\n*  1940   – Vasilka Stoeva, Bulgarian discus thrower\n*1941 – Nicholas Brooks, English historian (d. 2014)\n*  1941   – Faye Dunaway, American actress and producer\n*  1941   – Gibby Gilbert, American golfer \n*  1941   – Milan Kučan, Slovenian politician, 1st President of Slovenia\n*1942 – Ian Brayshaw, Australian cricketer and footballer\n*  1942   – Dave Campbell, American baseball player and sportscaster\n*  1942   – Gerben Karstens, Dutch cyclist\n*1943 – Angelo Bagnasco, Italian cardinal\n*  1943   – Mariss Jansons, Latvian conductor\n*  1943   – Shannon Lucid, American biochemist and astronaut\n*  1943   – Holland Taylor, American actress and playwright\n*1944 – Marjoe Gortner, American actor and evangelist\n*  1944   – Graham Marsh, Australian golfer and architect\n*  1944   – Nina Totenberg, American journalist\n*1945 – Kathleen Chalfant, American actress\n*  1945   – Maina Gielgud, English ballerina and director\n*1947 – Taylor Branch, American historian and author \n*  1947   – Bev Perdue, American educator and politician, 73rd Governor of North Carolina\n*  1947   – Bill Werbeniuk, Canadian snooker player (d. 2003)\n*1948 – T Bone Burnett, American singer-songwriter, guitarist, and producer \n*  1948   – Valeri Kharlamov, Russian ice hockey player (d. 1981)\n*  1948   – John Lescroart, American author and screenwriter\n*  1948   – Muhriz of Negeri Sembilan Yamtuan Besar of Negeri Sembilan\n*  1948   – Carl Weathers, American football player and actor\n*1949 – Lawrence Kasdan, American director, producer, and screenwriter\n*  1949   – Mary Robison, American short story writer and novelist\n*  1949   – İlyas Salman, Turkish actor, director, and screenwriter\n*  1949   – Lamar Williams, American bass player (d. 1983)\n*1950 – Rambhadracharya, Indian religious leader, scholar, and author\n*  1950   – Arthur Byron Cover, American author and screenwriter\n*  1951 – O. Panneerselvam, Indian politician, 7th Chief Minister of Tamil Nadu\n*1952 – Sydney Biddle Barrows, American businesswoman and author\n*  1952   – Maureen Dowd, American journalist and author\n*  1952   – Konstantinos Iosifidis, Greek footballer and manager\n*  1952   – Călin Popescu-Tăriceanu, Romanian engineer and politician, 60th Prime Minister of Romania \n*1953 – David Clary, English chemist and academic\n*  1953   – Denzil Douglas, Caribbean educator and politician, 2nd Prime Minister of Saint Kitts and Nevis\n*  1953   – Hans Westerhoff, Dutch biologist and academic\n*1956 – Étienne Daho, Algerian-French singer-songwriter and producer\n*1957 – Anchee Min, Chinese-American painter, photographer, and author\n*1959 – Geoff Tate, German-American singer-songwriter and musician\n*1961 – Rob Hall, New Zealand mountaineer (d. 1996)\n*1962 – Michael McCaul, American lawyer and politician\n*  1962   – Patricia Morrison, American singer-songwriter and bass player \n*1963 – Steven Soderbergh, American director, producer, and screenwriter\n*1964 – Beverly Kinch, English long jumper and sprinter\n*  1964   – Shepard Smith, American television journalist\n*1965 – Marc Delissen, Dutch field hockey player, coach, and lawyer\n*  1965   – Bob Essensa, Canadian ice hockey player and coach\n*1965 – Slick Rick, English-American rapper and producer\n*1966 – Rob Flello, English lawyer and politician\n*  1966   – Marco Hietala, Finnish singer-songwriter, bass player, and producer \n*  1966   – Rene Simpson, Canadian-American tennis player (d. 2013)\n*  1966   – Dan Schneider, American TV-producer\n*1967 – Leonardo Ortolani, Italian author and illustrator, created Rat-Man\n*  1967   – Emily Watson, English actress\n*1968 – LL Cool J, American rapper and actor\n*1969 – Jason Bateman, American actor, director, and producer\n*  1969   – Martin Bicknell, English cricketer\n*  1969   – Dave Grohl, American singer-songwriter, guitarist, and drummer \n*1971 – Lasse Kjus, Norwegian skier\n*  1971   – Bert Konterman, Dutch footballer and manager\n*  1971   – Antonios Nikopolidis, Greek footballer and manager\n*1972 – Kyle Brady, American football player and sportscaster\n*  1972   – Dion Forster, South African minister, theologian, and author\n*  1972   – James Key, English engineer\n*1973 – Giancarlo Fisichella, Italian race car driver\n*  1973   – Paul Tisdale, English footballer and manager\n*1974 – David Flitcroft, English footballer and manager\n*1975 – Georgina Cates, English actress\n*1976 – Vincenzo Chianese, Italian footballer\n*1977 – Narain Karthikeyan, Indian race car driver \n*  1977   – Terry Ryan, Canadian ice hockey player\n*1979 – Karen Elson, English singer-songwriter, guitarist, and model\n*  1979   – Evans Soligo, Italian footballer\n*1980 – Clive Clarke, Irish footballer\n*  1980   – Cory Gibbs, American soccer player\n*1981 – Abdelmalek Cherrad, Algerian footballer\n*  1981   – Hyleas Fountain, American heptathlete\n*  1981   – Concepción Montaner, Spanish long jumper\n*  1981   – Chiharu Niiyama, Japanese actress and model\n*1982 – Braith Anasta, Australian rugby league player and sportscaster\n*  1982   – Marc Broussard, American singer-songwriter and guitarist\n*  1982   – Chris Heighington, Australian-English rugby league player\n*  1982   – Léo Lima, Brazilian footballer\n*  1982   – Thomas Longosiwa, Kenyan runner\n*  1982   – Víctor Valdés, Spanish footballer\n*1983 – Cesare Bovo, Italian footballer\n*  1983   – Jason Krejza, Australian cricketer\n*1984 – Erick Aybar, American baseball player\n*  1984   – Erika Matsuo, Japanese violinist\n*  1984   – Mike Pelfrey, American baseball player\n*1985 – Joel Rosario, Dominican-American jockey\n*  1985   – Shawn Sawyer, Canadian figure skater\n*1986 – Yohan Cabaye, French footballer\n*  1986   – Alessio Cossu, Italian footballer\n*1987 – Atsushi Hashimoto, Japanese actor\n* 1987 – Jess Fishlock, Welsh footballer\n*1989 – Frankie Bridge, English singer-songwriter and dancer \n*  1989   – Adam Clayton, English footballer\n*  1989   – Mattia Marchi, Italian footballer\n*  1989   – Liu Xiaodong, Chinese footballer\n*1990 – Lelisa Desisa, Ethiopian runner\n*  1990   – Áron Szilágyi, Hungarian fencer\n*1992 – Robbie Brady, Irish footballer\n*  1992   – Chieh-Yu Hsu, American tennis player\n*1993 – Daniel Bessa, Brazilian footballer\n*1994 – Kane Elgey, Australian rugby league player\n*  1994   – Abi Phillips, English singer-songwriter and actress\n*  1994   – Kai, South Korean musician & member of South Korean boy band EXO\n*1995 – Georgios Diamantakos, Greek basketball player\n*  1995   – Alex Johnston, Australian rugby league player\n\nDeaths\n\n* 769 – Cui Huan, chancellor of the Tang Dynasty \n* 927 – Wang Yanhan, king of Min (Ten Kingdoms)\n* 937 – Zhang Yanlang, Chinese official\n* 973 – Ekkehard I, Frankish monk and poet\n*1092 – Vratislaus II of Bohemia\n*1163 – Ladislaus II of Hungary (b. 1131)\n*1236 – Saint Sava, Serbian archbishop and saint (b. 1175)\n*1301 – Andrew III of Hungary (b. 1265)\n*1331 – Odoric of Pordenone, Italian priest and explorer (b. 1286)\n*1465 – Thomas Beckington, English statesman and prelate\n*1476 – John de Mowbray, 4th Duke of Norfolk (b. 1444)\n*1555 – Jacques Dubois, French anatomist (b. 1478)\n*1640 – Thomas Coventry, 1st Baron Coventry, English lawyer, judge, and politician, Attorney General for England and Wales (b. 1578)\n*1648 – Caspar Barlaeus, Dutch historian, poet, and theologian (b. 1584)\n*1676 – Francesco Cavalli, Italian organist and composer (b. 1602)\n*1679 – Jacques de Billy, French mathematician and academic (b. 1602)\n*1701 – Tokugawa Mitsukuni, Japanese daimyo (b. 1628)\n*1742 – Edmond Halley, English astronomer, geophysicist, mathematician, meteorologist, and physicist (b. 1656)\n*1753 – George Berkeley, Anglo-Irish philosopher and author (b. 1685)\n*1766 – Frederick V of Denmark (b. 1723)\n*1776 – Edward Cornwallis, English general and politician, Governor of Gibraltar (b. 1713)\n*1786 – Michael Arne, English organist and composer (b. 1741)\n*  1786   – Meshech Weare, American lawyer and politician, 1st Governor of New Hampshire (b. 1713)\n*1823 – Athanasios Kanakaris, Greek politician (b. 1760)\n*1825 – George Dance the Younger, English architect and surveyor (b. 1741)\n*1833 – Seraphim of Sarov, Russian monk and saint (b. 1759)\n*1867 – Jean-Auguste-Dominique Ingres, French painter and illustrator (b. 1780) \n*1874 – Johann Philipp Reis, German physicist and academic, invented the Reis telephone (b. 1834)\n*1883 – Napoléon Coste, French guitarist and composer (b. 1806)\n*1888 – Stephen Heller, Hungarian pianist and composer (b. 1813)\n*1889 – Ema Pukšec, Croatian soprano (b. 1834)\n*1892 – Prince Albert Victor, Duke of Clarence and Avondale (b. 1864)\n*  1892   – Alexander J. Davis, American architect (b. 1803)\n*1898 – Lewis Carroll,  English novelist, poet, and mathematician (b. 1832)\n*1901 – Mandell Creighton, English bishop and historian (b. 1843)\n*  1901   – Charles Hermite, French mathematician and theorist (b. 1822)\n*1905 – Ernst Abbe, German physicist and engineer (b. 1840)\n*1907 – Sir James Fergusson, 6th Baronet, Scottish soldier and politician, 6th Governor of New Zealand (b. 1832)\n*1908 – Holger Drachmann, Danish poet and playwright (b. 1846)\n*1915 – Richard Meux Benson, English priest and saint, founded the Society of St. John the Evangelist (b. 1824)\n*1919 – Platon, Estonian bishop and saint (b. 1869)\n*1920 – John Francis Dodge, American businessman, co-founded the Dodge Automobile Company (b. 1864)\n*1926 – August Sedláček, Czech historian and author (b. 1843)\n*1934 – Ioan Cantacuzino, Romanian physician and bacteriologist (b. 1863)\n*1937 – Jaishankar Prasad, Indian poet, author, and playwright (b. 1889)\n*1942 – Porfirio Barba-Jacob, Colombian poet and author (b. 1883)\n*1943 – Laura E. Richards, American author and poet (b. 1850)\n*1944 – Mehmet Emin Yurdakul, Turkish author and politician (b. 1869)\n*1949 – Harry Stack Sullivan, American psychiatrist and psychoanalyst (b. 1892)\n*1951 – Gregorios Xenopoulos, Greek author, journalist, and playwright (b. 1867)\n*1952 – Artur Kapp, Estonian composer and conductor (b. 1878)\n*1957 – Humphrey Bogart, American actor (b. 1899)\n*1959 – Eivind Berggrav, Norwegian bishop and translator (b. 1884)\n*1961 – Barry Fitzgerald, Irish actor (b. 1888)\n*1962 – M. Visvesvaraya, Indian engineer, scholar, and politician (b. 1860)\n*1965 – Jeanette MacDonald, American actress and singer (b. 1903)\n*1966 – Sergei Korolev, Ukrainian-Russian engineer and academic (b. 1906)\n*1968 – Dorothea Mackellar, Australian poet and author (b. 1885)\n*1970 – William Feller, Croatian-American mathematician and academic (b. 1906)\n*  1970   – Asım Gündüz, Turkish general (b. 1880)\n*1972 – Horst Assmy, German footballer (b. 1933)\n*  1972   – Frederick IX of Denmark (b. 1899)\n*1976 – Abdul Razak Hussein, Malaysian lawyer and politician, 2nd Prime Minister of Malaysia (b. 1922)\n*1977 – Anthony Eden, English soldier and politician, Prime Minister of the United Kingdom (b. 1897)\n*  1977   – Peter Finch, English-Australian actor (b. 1916)\n*  1977   – Anaïs Nin, French-American essayist and memoirist  (b. 1903)\n*1978 – Harold Abrahams, English sprinter, lawyer, and journalist (b. 1899)\n*  1978   – Kurt Gödel, Austrian-American mathematician and philosopher (b. 1906)\n*  1978   – Robert Heger, German conductor and composer (b. 1886)\n*  1978   – Blossom Rock, American actress (b. 1895)\n*1980 – Robert Ardrey, American-South African author, playwright, and screenwriter (b. 1908)\n*1981 – John O'Grady, Australian author and poet (b. 1907)\n*1981 – G. Lloyd Spencer, American lieutenant and politician (b. 1893)\n*1984 – Ray Kroc, American businessman and philanthropist (b. 1902)\n*1986 – Donna Reed, American actress (b. 1921)\n*1987 – Turgut Demirağ, Turkish director, producer, and screenwriter (b. 1921)\n*  1987   – Douglas Sirk, German-Swiss director and screenwriter (b. 1900)\n*1988 – Georgy Malenkov, Russian engineer and politician, 5th Premier of the Soviet Union (b. 1902)\n*1991 – Gordon Bryant, Australian educator and politician (b. 1914)\n*1995 – Alexander Gibson, Scottish conductor (b. 1926)\n*1996 – Onno Tunç, Turkish composer (b. 1948)\n*1997 – Dollard Ménard, Canadian general (b. 1913)\n*2000 – Leonard Weisgard, American author and illustrator (b. 1916)\n*2004 – Uta Hagen, German-American actress (b. 1919)\n*  2004   – Ron O'Neal, American actor, director, and screenwriter (b. 1937)\n*2005 – Charlotte MacLeod, Canadian-American author (b. 1922)\n*  2005   – Conroy Maddox, English painter and educator (b. 1912)\n*  2005   – Rudolph Moshammer, German fashion designer (b. 1940)\n*  2005   – Jesús Rafael Soto, Venezuelan sculptor and painter (b. 1923)\n*2006 – Henri Colpi, French director and screenwriter (b. 1921)\n*  2006   – Shelley Winters, American actress (b. 1920)\n*2007 – Vassilis Photopoulos, Greek painter, director, and set designer (b. 1934)\n*2008 – Judah Folkman, American physician, biologist, and academic (b. 1933)\n*2009 – Jan Kaplický, Czech architect, designed the Selfridges Building (b. 1937)\n*  2009   – Ricardo Montalbán, Mexican actor (b. 1920)\n*2010 – Antonio Fontán, Spanish journalist and academic (b. 1923)\n*2011 – Georgia Carroll, American singer, model and actress (b. 1919)\n*2012 – Txillardegi, Spanish linguist and politician (b. 1929)\n*  2012   – Dan Evins, American businessman, founded Cracker Barrel Old Country Store (b. 1935)\n*  2012   – Arfa Karim, Pakistani student and computer prodigy, youngest Microsoft Certified Professional in 2004 (b. 1995)\n*  2012   – Giampiero Moretti, Italian entrepreneur and racing driver (b. 1940)\n*  2012   – Rosy Varte, Armenian-French actress (b. 1923)\n*2013 – Conrad Bain, Canadian-American actor (b. 1923)\n*2014 – Jon Bing, Norwegian author, scholar, and academic (b. 1944)\n*  2014   – Juan Gelman, Argentinian poet and author (b. 1930)\n*  2014   – Milutin Dostanić, Serbian mathematician and academic (b. 1958)\n*  2014   – Flavio Testi, Italian composer and musicologist (b. 1923)\n*2015 – Bob Boyd, American basketball player and coach (b. 1930)\n*  2015   – Zhang Wannian, Chinese general (b. 1928)\n*2016 – Alan Rickman, English actor (b. 1946)\n*2017 – Zhou Youguang, Chinese sociologist, (b. 1906)\n*2018 - Spanky Manikan, Filipino veteran actor (b. 1942) \n*2018 – Cyrille Regis, French Guianan-English footballer (b. 1958) \n\nHolidays and observances\n\n* Christian feast day:\n** Barba'shmin\n** Blessed Devasahayam Pillai (Latin Church)\n** Divina Pastora (Barquisimeto)\n** Eivind Berggrav (Lutheran)\n** Felix of Nola\n** Macrina the Elder\n** Odoric of Pordenone\n** January 14 (Eastern Orthodox liturgics)\n* Day of Defenders of the Motherland (Uzbekistan) \n* Feast of the Ass (Medieval Christianity)\n* Flag Day (Georgia) \n* National Forest Conservation Day (Thailand) \n* Old New Year, and its related observance:\n**Azhyrnykhua (Abkhazia)\n**Yennayer (Berbers)\n* Ratification Day (United States)\n* Revolution and Youth Day (Tunisia) \n* Sidereal winter solstice celebrations in South and Southeast Asian cultures; marking the transition of the Sun to Capricorn, and the first day of the six months Uttarayana period. (see April 14):\n** Magh Bihu (Assam)\n** Maghe Sankranti (Nepal)\n** Maghi (Punjab, Haryana, Himachal Pradesh)\n** Makar Sankranti (India)\n** The first day of Pongal,\n** Uttarayan (Uttarakhand, Gujarat and Rajasthan)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "January 14" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16192" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In the 20th and 21st centuries the Julian calendar is 13 days behind the Gregorian calendar, thus January 14 is sometimes celebrated as New Year's Day (Old New Year) by religious groups who use the Julian calendar.\n\nEvents\n\n*1301 – Andrew III of Hungary dies, ending the Árpád dynasty in Hungary.\n*1343 – Arnošt of Pardubice becomes the last bishop of Prague and, subsequently, the first Archbishop of Prague.\n*1539 – Spain annexes Cuba.\n*1639 – The \"Fundamental Orders\", the first written constitution that created a government, is adopted in Connecticut.\n*1761 – The Third Battle of Panipat is fought in India between the Afghans under Ahmad Shah Durrani and the Marathas.\n*1784 – American Revolutionary War: Ratification Day, United States - Congress ratifies the Treaty of Paris with Great Britain.\n*1814 – Treaty of Kiel: Frederick VI of Denmark cedes Norway to Sweden in return for Pomerania.\n*1822 – Greek War of Independence: Acrocorinth is captured by Theodoros Kolokotronis and Demetrios Ypsilantis.\n*1858 – Napoleon III of France escapes an assassination attempt made by Felice Orsini and his accomplices in Paris.\n*1907 – An earthquake in Kingston, Jamaica kills more than 1,000 people.\n*1911 – Roald Amundsen's South Pole expedition makes landfall on the eastern edge of the Ross Ice Shelf.\n*1939 – Norway claims Queen Maud Land in Antarctica.\n*1943 – World War II: Japan begins Operation Ke, the successful operation to evacuate its forces from Guadalcanal during the Guadalcanal Campaign.\n*  1943   – World War II: Franklin D. Roosevelt and Winston Churchill begin the Casablanca Conference to discuss strategy and study the next phase of the war.\n*  1943   – World War II: Franklin D. Roosevelt becomes the first President of the United States to travel by airplane while in office when he travels from Miami to Morocco to meet with Winston Churchill.\n*1950 – The first prototype of the MiG-17 makes its maiden flight.\n*1952 – NBC's long-running morning news program Today debuts, with host Dave Garroway.\n*1953 – Josip Broz Tito is inaugurated as the first President of Yugoslavia.\n*1954 – The Hudson Motor Car Company merges with Nash-Kelvinator Corporation forming the American Motors Corporation.\n*1957 – Kripalu Maharaj was named fifth Jagadguru (world teacher) after giving seven days of speeches before 500 Hindu scholars.\n*1960 – The Reserve Bank of Australia, the country's central bank and banknote issuing authority, is established.\n*1967 – Counterculture of the 1960s: The Human Be-In takes place in San Francisco, California's Golden Gate Park, launching the Summer of Love.\n* 1967 - The New York Times reports that the U.S. Army is conducting secret germ warfare experiments.\n*1969 – USS Enterprise fire: An accidental explosion aboard the  near Hawaii kills 27 people.\n*1972 – Queen Margrethe II of Denmark ascends the throne, the first Queen of Denmark since 1412 and the first Danish monarch not named Frederick or Christian since 1513.\n*1973 – Elvis Presley's concert Aloha from Hawaii is broadcast live via satellite, and sets the record as the most watched broadcast by an individual entertainer in television history.\n*1993 – In Poland's worst peacetime maritime disaster, ferry MS Jan Heweliusz sinks off the coast of Rügen, drowning 55 passengers and crew; nine crew-members are saved.\n*2000 – A United Nations tribunal sentences five Bosnian Croats to up to 25 years in prison for the 1993 killing of more than 100 Bosnian Muslims. \n*2004 – The national flag of the Republic of Georgia, the so-called \"five cross flag\", is restored to official use after a hiatus of some 500 years.\n*2010 – Yemen declares an open war against the terrorist group al-Qaeda.\n*2011 – Former president of Tunisia, Zine El Abidine Ben Ali flees his country to Saudi Arabia after a series of street demonstrations against his regime and corrupt policies, asking for freedom, rights and democracy, considered as the anniversary of the Tunisian Revolution and the birth of the Arab Spring.\n*2018 - Russell M. Nelson becomes the 17th President of The Church of Jesus Christ of Latter-day Saints.\n\nBirths\n\n*83 BC– Mark Antony, Roman general and politician (d. 30 BCE)\n*1131 – Valdemar I of Denmark (d. 1182)\n*1273 – Joan I of Navarre, queen regnant of Navarre, queen consort of France (d. 1305)\n*1451 – Franchinus Gaffurius, Italian composer and theorist (d. 1522)\n*1477 – Hermann of Wied, German archbishop (d. 1552)\n*1476 – Anne St Leger, Baroness de Ros, English baroness (d. 1526)\n*1507 – Catherine of Austria, Queen of Portugal (d. 1578)\n*  1507   – Luca Longhi, Italian painter (d. 1580)\n*1551 – Abu'l-Fazl ibn Mubarak,  Grand vizier of emperor Akbar (d. 1602)\n*1552 – Alberico Gentili, Italian-English academic and jurist (d. 1608)\n*1615 – John Biddle, English minister and theologian (d. 1662)\n*1683 – Gottfried Silbermann, German instrument maker (d. 1753)\n*1684 – Johann Matthias Hase, German mathematician, astronomer, and cartographer (d. 1742)\n*  1684   – Jean-Baptiste van Loo, French painter (d. 1745)\n*1699 – Jakob Adlung, German organist, historian, and theorist (d. 1762)\n*1700 – Picander, German poet and playwright (d. 1764)\n*1702 – Emperor Nakamikado of Japan (d. 1737)\n*1705 – Jean-Baptiste Charles Bouvet de Lozier, French sailor, explorer, and politician (d. 1786)\n*1741 – Benedict Arnold, American-British general (d. 1801)\n*1767 – Maria Theresa of Austria (d. 1827)\n*1780 – Henry Baldwin, American judge and politician (d. 1844)\n*1792 – Christian de Meza, Danish general (d. 1865)\n*1793 – John C. Clark, American lawyer and politician (d. 1852)\n*1798 – Johan Rudolph Thorbecke, Dutch historian, jurist, and politician, 3rd Prime Minister of the Netherlands (d. 1872)\n*1800 – Ludwig Ritter von Köchel, Austrian composer, botanist, and publisher (d. 1877)\n*1806 – Charles Hotham, English-Australian soldier and politician, 1st Governor of Victoria (d. 1855)\n*  1806   – Matthew Fontaine Maury American astronomer, oceanographer, and historian (d. 1873)\n*1818 – Zachris Topelius, Finnish author and journalist (d. 1898)\n*1819 – Dimitrie Bolintineanu, Romanian poet and politician (d. 1872)\n*1824 – Vladimir Stasov, Russian critic (d. 1906)\n*1836 – Henri Fantin-Latour, French painter and lithographer (d. 1904)\n*1841 – Berthe Morisot, French painter (d. 1895)\n*1845 – Henry Petty-Fitzmaurice, 5th Marquess of Lansdowne, English politician, 34th Governor-General of India (d. 1927)\n*1850 – Pierre Loti, French captain and author (d. 1923)\n*1856 – J. F. Archibald, Australian journalist and publisher, co-founded The Bulletin (d. 1919)\n*1861 – Mehmed VI, Ottoman sultan (d. 1926)\n*1863 – Manuel de Oliveira Gomes da Costa, Portuguese general and politician, 10th President of Portugal (d. 1929)\n*  1863   – Richard F. Outcault, American author and illustrator (d. 1928)\n*1869 – Robert Fournier-Sarlovèze, French polo player and politician (d. 1937)\n*1870 – George Pearce, Australian carpenter and politician (d. 1952)\n*1875 – Albert Schweitzer, French-Gabonese physician and philosopher, Nobel Prize laureate (d. 1965)\n*1882 – Hendrik Willem van Loon, Dutch-American historian and journalist (d. 1944)\n*1883 – Nina Ricci, Italian-French fashion designer (d. 1970)\n*1886 – Hugh Lofting, English author and poet, created Doctor Dolittle (d. 1947)\n*1887 – Hugo Steinhaus, Polish mathematician and academic (d. 1972)\n*1892 – Martin Niemöller, German pastor and theologian (d. 1984)\n*  1892   – Hal Roach, American actor, director, and producer (d. 1992)\n*  1892   – George Wilson, English footballer (d. 1961)\n*1894 – Ecaterina Teodoroiu, Romanian soldier and nurse (d. 1917)\n*1896 – John Dos Passos, American novelist, poet, and playwright (d. 1970)\n*1897 – Hasso von Manteuffel, German general and politician (d. 1978)\n*1899 – Carlos P. Romulo, Filipino soldier and politician, President of the United Nations General Assembly (d. 1985)\n*1901 – Bebe Daniels, American actress (d. 1971)\n*  1901   – Alfred Tarski, Polish-American mathematician and philosopher (d. 1983)\n*1904 – Cecil Beaton, English photographer, painter, and costume designer (d. 1980)\n*  1904   – Emily Hahn, American journalist and author (d. 1997)\n*  1904   – Babe Siebert, Canadian ice hockey player and coach (d. 1939)\n*1905 – Takeo Fukuda, Japanese politician, 67th Prime Minister of Japan (d. 1995)\n*1906 – William Bendix, American actor (d. 1964)\n*1907 – Georges-Émile Lapalme, Canadian lawyer and politician (d. 1985)\n*1908 – Russ Columbo, American singer, violinist, and actor (d. 1934)\n*1909 – Brenda Forbes, English-American actress (d. 1996)\n*  1909   – Joseph Losey, American director, producer, and screenwriter (d. 1984)\n*1911 – Anatoly Rybakov, Russian-American author (d. 1998)\n*1912 – Tillie Olsen, American short story writer (d. 2007)\n*1914 – Harold Russell, Canadian-American soldier and actor (d. 2002)\n*  1914   – Selahattin Ülkümen, Turkish diplomat (d. 2003)\n*1915 – Mark Goodson, American game show producer, created Family Feud and The Price Is Right (d. 1992) \n*1919 – Giulio Andreotti, Italian journalist and politician, 41st Prime Minister of Italy (d. 2013)\n*  1919   – Andy Rooney, American soldier, journalist, critic, and television personality (d. 2011)\n*1920 – Bertus de Harder, Dutch footballer and manager (d. 1982)\n*1921 – Murray Bookchin, American author and philosopher (d. 2006)\n*  1921   – Kenneth Bulmer, American author (d. 2005)\n*1922 – Diana Wellesley, Duchess of Wellington (d. 2010)\n*1923 – Gerald Arpino, American dancer and choreographer (d. 2008)\n*  1923   – Fred Beckey, American mountaineer and author (d. 2017)\n*1924 – Carole Cook, American actress and singer \n*1925 – Jean-Claude Beton, Algerian-French engineer and businessman, founded Orangina (d. 2013)\n*  1925   – Moscelyne Larkin, American ballerina (d. 2012)\n*  1925   – Yukio Mishima, Japanese author, poet, and playwright (d. 1970)\n*1926 – Frank Aletter, American actor (d. 2009)\n*  1926   – Warren Mitchell, English actor and screenwriter (d. 2015)\n*  1926   – Tom Tryon, American actor and author (d. 1991)\n*1927 – Zuzana Růžičková, Czech harpsichord player (d. 2017)\n*1928 – Lars Forssell, Swedish author, poet, and songwriter (d. 2007)\n*  1928   – Hans Kornberg, German-English biologist and academic \n*  1928   – Garry Winogrand, American photographer and author (d. 1984)\n*1930 – Johnny Grande, American pianist and accordion player (Bill Haley & His Comets) (d. 2006)\n*  1930   – Kenny Wheeler, Canadian-English trumpet player and composer (d. 2014)\n*1931 – Frank Costigan, Australian lawyer and politician (d. 2009)\n*  1931   – Martin Holdgate, English biologist and academic\n*1932 – Don Garlits, American race car driver and engineer\n*1933 – Stan Brakhage, American director and producer (d. 2003)\n*1934 – Richard Briers, English actor (d. 2013)\n*  1934   – Alberto Rodriguez Larreta, Argentinian race car driver (d. 1977)\n*1936 – Clarence Carter, American blues and soul singer-songwriter, musician, and record producer\n*1937 – J. Bernlef, Dutch author and poet (d. 2012)\n*  1937   – Ken Higgs, English cricketer and coach (d. 2016)\n*  1937   – Leo Kadanoff, American physicist and academic (d. 2015)\n*  1937   – Rao Gopal Rao, Indian actor, producer, and politician (d. 1994)\n*  1937   – Sonny Siebert, American baseball player\n*  1937   – Billie Jo Spears, American country singer (d. 2011) \n*1938 – Morihiro Hosokawa, Japanese journalist and politician, 79th Prime Minister of Japan\n*  1938   – Jack Jones, American singer and actor\n*  1938   – Allen Toussaint, American singer-songwriter, pianist, and producer (d. 2015)\n*1939 – Kurt Moylan, Guamanian businessman and politician, 1st Lieutenant Governor of Guam\n*1940 – Julian Bond, American academic and politician (d. 2015)\n*  1940   – Ron Kostelnik, American football player (d. 1993)\n*  1940   – Siegmund Nimsgern, German opera singer\n*  1940   – Trevor Nunn, English director and composer\n*  1940   – Vasilka Stoeva, Bulgarian discus thrower\n*1941 – Nicholas Brooks, English historian (d. 2014)\n*  1941   – Faye Dunaway, American actress and producer\n*  1941   – Gibby Gilbert, American golfer \n*  1941   – Milan Kučan, Slovenian politician, 1st President of Slovenia\n*1942 – Ian Brayshaw, Australian cricketer and footballer\n*  1942   – Dave Campbell, American baseball player and sportscaster\n*  1942   – Gerben Karstens, Dutch cyclist\n*1943 – Angelo Bagnasco, Italian cardinal\n*  1943   – Mariss Jansons, Latvian conductor\n*  1943   – Shannon Lucid, American biochemist and astronaut\n*  1943   – Holland Taylor, American actress and playwright\n*1944 – Marjoe Gortner, American actor and evangelist\n*  1944   – Graham Marsh, Australian golfer and architect\n*  1944   – Nina Totenberg, American journalist\n*1945 – Kathleen Chalfant, American actress\n*  1945   – Maina Gielgud, English ballerina and director\n*1947 – Taylor Branch, American historian and author \n*  1947   – Bev Perdue, American educator and politician, 73rd Governor of North Carolina\n*  1947   – Bill Werbeniuk, Canadian snooker player (d. 2003)\n*1948 – T Bone Burnett, American singer-songwriter, guitarist, and producer \n*  1948   – Valeri Kharlamov, Russian ice hockey player (d. 1981)\n*  1948   – John Lescroart, American author and screenwriter\n*  1948   – Muhriz of Negeri Sembilan Yamtuan Besar of Negeri Sembilan\n*  1948   – Carl Weathers, American football player and actor\n*1949 – Lawrence Kasdan, American director, producer, and screenwriter\n*  1949   – Mary Robison, American short story writer and novelist\n*  1949   – İlyas Salman, Turkish actor, director, and screenwriter\n*  1949   – Lamar Williams, American bass player (d. 1983)\n*1950 – Rambhadracharya, Indian religious leader, scholar, and author\n*  1950   – Arthur Byron Cover, American author and screenwriter\n*  1951 – O. Panneerselvam, Indian politician, 7th Chief Minister of Tamil Nadu\n*1952 – Sydney Biddle Barrows, American businesswoman and author\n*  1952   – Maureen Dowd, American journalist and author\n*  1952   – Konstantinos Iosifidis, Greek footballer and manager\n*  1952   – Călin Popescu-Tăriceanu, Romanian engineer and politician, 60th Prime Minister of Romania \n*1953 – David Clary, English chemist and academic\n*  1953   – Denzil Douglas, Caribbean educator and politician, 2nd Prime Minister of Saint Kitts and Nevis\n*  1953   – Hans Westerhoff, Dutch biologist and academic\n*1956 – Étienne Daho, Algerian-French singer-songwriter and producer\n*1957 – Anchee Min, Chinese-American painter, photographer, and author\n*1959 – Geoff Tate, German-American singer-songwriter and musician\n*1961 – Rob Hall, New Zealand mountaineer (d. 1996)\n*1962 – Michael McCaul, American lawyer and politician\n*  1962   – Patricia Morrison, American singer-songwriter and bass player \n*1963 – Steven Soderbergh, American director, producer, and screenwriter\n*1964 – Beverly Kinch, English long jumper and sprinter\n*  1964   – Shepard Smith, American television journalist\n*1965 – Marc Delissen, Dutch field hockey player, coach, and lawyer\n*  1965   – Bob Essensa, Canadian ice hockey player and coach\n*1965 – Slick Rick, English-American rapper and producer\n*1966 – Rob Flello, English lawyer and politician\n*  1966   – Marco Hietala, Finnish singer-songwriter, bass player, and producer \n*  1966   – Rene Simpson, Canadian-American tennis player (d. 2013)\n*  1966   – Dan Schneider, American TV-producer\n*1967 – Leonardo Ortolani, Italian author and illustrator, created Rat-Man\n*  1967   – Emily Watson, English actress\n*1968 – LL Cool J, American rapper and actor\n*1969 – Jason Bateman, American actor, director, and producer\n*  1969   – Martin Bicknell, English cricketer\n*  1969   – Dave Grohl, American singer-songwriter, guitarist, and drummer \n*1971 – Lasse Kjus, Norwegian skier\n*  1971   – Bert Konterman, Dutch footballer and manager\n*  1971   – Antonios Nikopolidis, Greek footballer and manager\n*1972 – Kyle Brady, American football player and sportscaster\n*  1972   – Dion Forster, South African minister, theologian, and author\n*  1972   – James Key, English engineer\n*1973 – Giancarlo Fisichella, Italian race car driver\n*  1973   – Paul Tisdale, English footballer and manager\n*1974 – David Flitcroft, English footballer and manager\n*1975 – Georgina Cates, English actress\n*1976 – Vincenzo Chianese, Italian footballer\n*1977 – Narain Karthikeyan, Indian race car driver \n*  1977   – Terry Ryan, Canadian ice hockey player\n*1979 – Karen Elson, English singer-songwriter, guitarist, and model\n*  1979   – Evans Soligo, Italian footballer\n*1980 – Clive Clarke, Irish footballer\n*  1980   – Cory Gibbs, American soccer player\n*1981 – Abdelmalek Cherrad, Algerian footballer\n*  1981   – Hyleas Fountain, American heptathlete\n*  1981   – Concepción Montaner, Spanish long jumper\n*  1981   – Chiharu Niiyama, Japanese actress and model\n*1982 – Braith Anasta, Australian rugby league player and sportscaster\n*  1982   – Marc Broussard, American singer-songwriter and guitarist\n*  1982   – Chris Heighington, Australian-English rugby league player\n*  1982   – Léo Lima, Brazilian footballer\n*  1982   – Thomas Longosiwa, Kenyan runner\n*  1982   – Víctor Valdés, Spanish footballer\n*1983 – Cesare Bovo, Italian footballer\n*  1983   – Jason Krejza, Australian cricketer\n*1984 – Erick Aybar, American baseball player\n*  1984   – Erika Matsuo, Japanese violinist\n*  1984   – Mike Pelfrey, American baseball player\n*1985 – Joel Rosario, Dominican-American jockey\n*  1985   – Shawn Sawyer, Canadian figure skater\n*1986 – Yohan Cabaye, French footballer\n*  1986   – Alessio Cossu, Italian footballer\n*1987 – Atsushi Hashimoto, Japanese actor\n* 1987 – Jess Fishlock, Welsh footballer\n*1989 – Frankie Bridge, English singer-songwriter and dancer \n*  1989   – Adam Clayton, English footballer\n*  1989   – Mattia Marchi, Italian footballer\n*  1989   – Liu Xiaodong, Chinese footballer\n*1990 – Lelisa Desisa, Ethiopian runner\n*  1990   – Áron Szilágyi, Hungarian fencer\n*1992 – Robbie Brady, Irish footballer\n*  1992   – Chieh-Yu Hsu, American tennis player\n*1993 – Daniel Bessa, Brazilian footballer\n*1994 – Kane Elgey, Australian rugby league player\n*  1994   – Abi Phillips, English singer-songwriter and actress\n*  1994   – Kai, South Korean musician & member of South Korean boy band EXO\n*1995 – Georgios Diamantakos, Greek basketball player\n*  1995   – Alex Johnston, Australian rugby league player\n\nDeaths\n\n* 769 – Cui Huan, chancellor of the Tang Dynasty \n* 927 – Wang Yanhan, king of Min (Ten Kingdoms)\n* 937 – Zhang Yanlang, Chinese official\n* 973 – Ekkehard I, Frankish monk and poet\n*1092 – Vratislaus II of Bohemia\n*1163 – Ladislaus II of Hungary (b. 1131)\n*1236 – Saint Sava, Serbian archbishop and saint (b. 1175)\n*1301 – Andrew III of Hungary (b. 1265)\n*1331 – Odoric of Pordenone, Italian priest and explorer (b. 1286)\n*1465 – Thomas Beckington, English statesman and prelate\n*1476 – John de Mowbray, 4th Duke of Norfolk (b. 1444)\n*1555 – Jacques Dubois, French anatomist (b. 1478)\n*1640 – Thomas Coventry, 1st Baron Coventry, English lawyer, judge, and politician, Attorney General for England and Wales (b. 1578)\n*1648 – Caspar Barlaeus, Dutch historian, poet, and theologian (b. 1584)\n*1676 – Francesco Cavalli, Italian organist and composer (b. 1602)\n*1679 – Jacques de Billy, French mathematician and academic (b. 1602)\n*1701 – Tokugawa Mitsukuni, Japanese daimyo (b. 1628)\n*1742 – Edmond Halley, English astronomer, geophysicist, mathematician, meteorologist, and physicist (b. 1656)\n*1753 – George Berkeley, Anglo-Irish philosopher and author (b. 1685)\n*1766 – Frederick V of Denmark (b. 1723)\n*1776 – Edward Cornwallis, English general and politician, Governor of Gibraltar (b. 1713)\n*1786 – Michael Arne, English organist and composer (b. 1741)\n*  1786   – Meshech Weare, American lawyer and politician, 1st Governor of New Hampshire (b. 1713)\n*1823 – Athanasios Kanakaris, Greek politician (b. 1760)\n*1825 – George Dance the Younger, English architect and surveyor (b. 1741)\n*1833 – Seraphim of Sarov, Russian monk and saint (b. 1759)\n*1867 – Jean-Auguste-Dominique Ingres, French painter and illustrator (b. 1780) \n*1874 – Johann Philipp Reis, German physicist and academic, invented the Reis telephone (b. 1834)\n*1883 – Napoléon Coste, French guitarist and composer (b. 1806)\n*1888 – Stephen Heller, Hungarian pianist and composer (b. 1813)\n*1889 – Ema Pukšec, Croatian soprano (b. 1834)\n*1892 – Prince Albert Victor, Duke of Clarence and Avondale (b. 1864)\n*  1892   – Alexander J. Davis, American architect (b. 1803)\n*1898 – Lewis Carroll,  English novelist, poet, and mathematician (b. 1832)\n*1901 – Mandell Creighton, English bishop and historian (b. 1843)\n*  1901   – Charles Hermite, French mathematician and theorist (b. 1822)\n*1905 – Ernst Abbe, German physicist and engineer (b. 1840)\n*1907 – Sir James Fergusson, 6th Baronet, Scottish soldier and politician, 6th Governor of New Zealand (b. 1832)\n*1908 – Holger Drachmann, Danish poet and playwright (b. 1846)\n*1915 – Richard Meux Benson, English priest and saint, founded the Society of St. John the Evangelist (b. 1824)\n*1919 – Platon, Estonian bishop and saint (b. 1869)\n*1920 – John Francis Dodge, American businessman, co-founded the Dodge Automobile Company (b. 1864)\n*1926 – August Sedláček, Czech historian and author (b. 1843)\n*1934 – Ioan Cantacuzino, Romanian physician and bacteriologist (b. 1863)\n*1937 – Jaishankar Prasad, Indian poet, author, and playwright (b. 1889)\n*1942 – Porfirio Barba-Jacob, Colombian poet and author (b. 1883)\n*1943 – Laura E. Richards, American author and poet (b. 1850)\n*1944 – Mehmet Emin Yurdakul, Turkish author and politician (b. 1869)\n*1949 – Harry Stack Sullivan, American psychiatrist and psychoanalyst (b. 1892)\n*1951 – Gregorios Xenopoulos, Greek author, journalist, and playwright (b. 1867)\n*1952 – Artur Kapp, Estonian composer and conductor (b. 1878)\n*1957 – Humphrey Bogart, American actor (b. 1899)\n*1959 – Eivind Berggrav, Norwegian bishop and translator (b. 1884)\n*1961 – Barry Fitzgerald, Irish actor (b. 1888)\n*1962 – M. Visvesvaraya, Indian engineer, scholar, and politician (b. 1860)\n*1965 – Jeanette MacDonald, American actress and singer (b. 1903)\n*1966 – Sergei Korolev, Ukrainian-Russian engineer and academic (b. 1906)\n*1968 – Dorothea Mackellar, Australian poet and author (b. 1885)\n*1970 – William Feller, Croatian-American mathematician and academic (b. 1906)\n*  1970   – Asım Gündüz, Turkish general (b. 1880)\n*1972 – Horst Assmy, German footballer (b. 1933)\n*  1972   – Frederick IX of Denmark (b. 1899)\n*1976 – Abdul Razak Hussein, Malaysian lawyer and politician, 2nd Prime Minister of Malaysia (b. 1922)\n*1977 – Anthony Eden, English soldier and politician, Prime Minister of the United Kingdom (b. 1897)\n*  1977   – Peter Finch, English-Australian actor (b. 1916)\n*  1977   – Anaïs Nin, French-American essayist and memoirist  (b. 1903)\n*1978 – Harold Abrahams, English sprinter, lawyer, and journalist (b. 1899)\n*  1978   – Kurt Gödel, Austrian-American mathematician and philosopher (b. 1906)\n*  1978   – Robert Heger, German conductor and composer (b. 1886)\n*  1978   – Blossom Rock, American actress (b. 1895)\n*1980 – Robert Ardrey, American-South African author, playwright, and screenwriter (b. 1908)\n*1981 – John O'Grady, Australian author and poet (b. 1907)\n*1981 – G. Lloyd Spencer, American lieutenant and politician (b. 1893)\n*1984 – Ray Kroc, American businessman and philanthropist (b. 1902)\n*1986 – Donna Reed, American actress (b. 1921)\n*1987 – Turgut Demirağ, Turkish director, producer, and screenwriter (b. 1921)\n*  1987   – Douglas Sirk, German-Swiss director and screenwriter (b. 1900)\n*1988 – Georgy Malenkov, Russian engineer and politician, 5th Premier of the Soviet Union (b. 1902)\n*1991 – Gordon Bryant, Australian educator and politician (b. 1914)\n*1995 – Alexander Gibson, Scottish conductor (b. 1926)\n*1996 – Onno Tunç, Turkish composer (b. 1948)\n*1997 – Dollard Ménard, Canadian general (b. 1913)\n*2000 – Leonard Weisgard, American author and illustrator (b. 1916)\n*2004 – Uta Hagen, German-American actress (b. 1919)\n*  2004   – Ron O'Neal, American actor, director, and screenwriter (b. 1937)\n*2005 – Charlotte MacLeod, Canadian-American author (b. 1922)\n*  2005   – Conroy Maddox, English painter and educator (b. 1912)\n*  2005   – Rudolph Moshammer, German fashion designer (b. 1940)\n*  2005   – Jesús Rafael Soto, Venezuelan sculptor and painter (b. 1923)\n*2006 – Henri Colpi, French director and screenwriter (b. 1921)\n*  2006   – Shelley Winters, American actress (b. 1920)\n*2007 – Vassilis Photopoulos, Greek painter, director, and set designer (b. 1934)\n*2008 – Judah Folkman, American physician, biologist, and academic (b. 1933)\n*2009 – Jan Kaplický, Czech architect, designed the Selfridges Building (b. 1937)\n*  2009   – Ricardo Montalbán, Mexican actor (b. 1920)\n*2010 – Antonio Fontán, Spanish journalist and academic (b. 1923)\n*2011 – Georgia Carroll, American singer, model and actress (b. 1919)\n*2012 – Txillardegi, Spanish linguist and politician (b. 1929)\n*  2012   – Dan Evins, American businessman, founded Cracker Barrel Old Country Store (b. 1935)\n*  2012   – Arfa Karim, Pakistani student and computer prodigy, youngest Microsoft Certified Professional in 2004 (b. 1995)\n*  2012   – Giampiero Moretti, Italian entrepreneur and racing driver (b. 1940)\n*  2012   – Rosy Varte, Armenian-French actress (b. 1923)\n*2013 – Conrad Bain, Canadian-American actor (b. 1923)\n*2014 – Jon Bing, Norwegian author, scholar, and academic (b. 1944)\n*  2014   – Juan Gelman, Argentinian poet and author (b. 1930)\n*  2014   – Milutin Dostanić, Serbian mathematician and academic (b. 1958)\n*  2014   – Flavio Testi, Italian composer and musicologist (b. 1923)\n*2015 – Bob Boyd, American basketball player and coach (b. 1930)\n*  2015   – Zhang Wannian, Chinese general (b. 1928)\n*2016 – Alan Rickman, English actor (b. 1946)\n*2017 – Zhou Youguang, Chinese sociologist, (b. 1906)\n*2018 - Spanky Manikan, Filipino veteran actor (b. 1942) \n*2018 – Cyrille Regis, French Guianan-English footballer (b. 1958) \n\nHolidays and observances\n\n* Christian feast day:\n** Barba'shmin\n** Blessed Devasahayam Pillai (Latin Church)\n** Divina Pastora (Barquisimeto)\n** Eivind Berggrav (Lutheran)\n** Felix of Nola\n** Macrina the Elder\n** Odoric of Pordenone\n** January 14 (Eastern Orthodox liturgics)\n* Day of Defenders of the Motherland (Uzbekistan) \n* Feast of the Ass (Medieval Christianity)\n* Flag Day (Georgia) \n* National Forest Conservation Day (Thailand) \n* Old New Year, and its related observance:\n**Azhyrnykhua (Abkhazia)\n**Yennayer (Berbers)\n* Ratification Day (United States)\n* Revolution and Youth Day (Tunisia) \n* Sidereal winter solstice celebrations in South and Southeast Asian cultures; marking the transition of the Sun to Capricorn, and the first day of the six months Uttarayana period. (see April 14):\n** Magh Bihu (Assam)\n** Maghe Sankranti (Nepal)\n** Maghi (Punjab, Haryana, Himachal Pradesh)\n** Makar Sankranti (India)\n** The first day of Pongal,\n** Uttarayan (Uttarakhand, Gujarat and Rajasthan). January 14. http://en.wikipedia.org/?curid=16192."
  }
}
