{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18630",
  "eid" : "341248f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778596607,
  "textBody" : "Lilith (;  Lîlîṯ) is a figure in Jewish mythology, developed earliest in the Babylonian Talmud (3rd to 5th centuries). Lilith is often envisioned as a dangerous demon of the night, who is sexually wanton, and who steals babies in the darkness. The character is generally thought to derive in part from a historically far earlier class of female demons (lilītu) in ancient Mesopotamian religion, found in cuneiform texts of Sumer, the Akkadian Empire, Assyria, and Babylonia.\n\nIn Jewish folklore, from the satirical book Alphabet of Sirach (c. 700–1000) onwards, Lilith appears as Adam's first wife, who was created at the same time (Rosh Hashanah) and from the same dirt as Adam – compare Genesis 1:27. (This contrasts with Eve, who was created from one of Adam's ribs: Genesis 2:22.) The legend developed extensively during the Middle Ages, in the tradition of Aggadah, the Zohar, and Jewish mysticism. For example, in the 13th-century writings of Isaac ben Jacob ha-Cohen, Lilith left Adam after she refused to become subservient to him and then would not return to the Garden of Eden after she had coupled with the archangel Samael.\n\nEvidence in later Jewish materials is plentiful, but little information has survived relating to the original Sumerian, Akkadian, Assyrian and Babylonian view of these demons. While the connection is almost universally agreed upon, recent scholarship has disputed the relevance of two sources previously used to connect the Jewish lilith to an Akkadian lilītu—the Gilgamesh appendix and the Arslan Tash amulets.Freedman, David Noel, ed., Anchor Bible Dictionary, (New York: Doubleday) 1997, 1992. \"Very little information has been found relating to the Akkadian and Babylonian view of these figures. Two sources of information previously used to define Lilith are both suspect.\" (See below for discussion of the two problematic sources. \"Other scholars, such as Lowell K. Handy, agree that Lilith is derived from Mesopotamian demons but argue against finding evidence of the Hebrew Lilith in many of the epigraphical and artifactual sources frequently cited as such (e.g., the Sumerian Gilgamesh fragment, the Sumerian incantation from Arshlan-Tash).\")\n\nIn Hebrew-language texts, the term lilith or lilit (translated as \"night creatures\", \"night monster\", \"night hag\", or \"screech owl\") first occurs in a list of animals in Isaiah 34:14, either in singular or plural form according to variations in the earliest manuscripts. In the Dead Sea Scrolls 4Q510-511, the term first occurs in a list of monsters. In Jewish magical inscriptions on bowls and amulets from the 6th century CE onwards, Lilith is identified as a female demon and the first visual depictions appear.\n\nThe resulting Lilith legend continues to serve as source material in modern Western culture, literature, occultism, fantasy, and horror.\n\nEtymology\n\nThe Semitic root L-Y-L served as derivative for the Hebrew layil and Arabic layl, meaning \"night\". The Talmudic and Yiddish use of Lilith is cognate with the Hebrew.\n\nIn the Akkadian language of Assyria and Babylonia the terms lili and līlītu mean spirits. Some uses of līlītu are listed in The Assyrian Dictionary of the Oriental Institute of the University of Chicago (CAD, 1956, L.190), in Wolfram von Soden's Akkadisches Handwörterbuch (AHw, p. 553), and Reallexikon der Assyriologie (RLA, p. 47).Erich Ebeling, Bruno Meissner, Dietz Otto Edzard Reallexikon der Assyriologie Volume 9 p47,50\n\nThe Sumerian female demons lili have no etymologic relation to Akkadian lilu, \"evening\".Michael C. Astour Hellenosemitica: an ethnic and cultural study in west Semitic impact on Mycenaean. Greece 1965 Brill p138\n\nArchibald Sayce (1882)Sayce (1887)  considered that Hebrew lilit (or lilith)  and the earlier Akkadian līlītu are from proto-Semitic. Charles Fossey (1902)Fossey (1902)  has this literally translating to \"female night being/demon\", although cuneiform inscriptions from Mesopotamia exist where Līlīt and Līlītu refers to disease-bearing wind spirits. Another possibility is association not with \"night\", but with \"wind\", thus identifying the Akkadian Lil-itu as a loan from the Sumerian lil \"air\" — specifically from Ninlil, \"lady air\", goddess of the south wind (and wife of Enlil) — and itud, \"moon\".\n\nMesopotamian mythology\n\nThe spirit in the tree in the Gilgamesh cycle\n\nSamuel Noah Kramer (1932, published 1938)Kramer, S. N. Gilgamesh and the Huluppu-Tree: A Reconstructed Sumerian Text. Assyriological Studies 10. Chicago. 1938 translated ki-sikil-lil-la-ke as Lilith in \"Tablet XII\" of the Epic of Gilgamesh dated c.600 BCE. \"Tablet XII\" is not part of the Epic of Gilgamesh, but is a later Assyrian Akkadian translation of the latter part of the Sumerian poem of Gilgamesh, Enkidu, and the Netherworld.George, A. The epic of Gilgamesh: the Babylonian epic poem and other texts in Akkadian 2003 p100 Tablet XII. Appendix The last Tablet in the 'Series of Gilgamesh'  The ki-sikil-lil-la-ke is associated with a serpent and a zu bird.Kramer translates the zu as \"owl\", but most often it is translated as \"eagle\", \"vulture\", or \"bird of prey\". In Gilgamesh, Enkidu, and the Netherworld, a huluppu tree grows in Inanna's garden in Uruk, whose wood she plans to use to build a new throne. After ten years of growth, she comes to harvest it and finds a serpent living at its base, a Zu bird raising young in its crown, and that a ki-sikil-lil-la-ke made a house in its trunk. Gilgamesh is said to have killed the snake, and then the zu bird flew away to the mountains with its young, while the ki-sikil-lil-la-ke fearfully destroys its house and runs for the forest.Hurwitz (1980) [https://books.google.com/books?hlen&lr\n&id6T9Y1EhiwDUC&oi\nfnd&pgPA49#v\nonepage&q&f=false p. 49] Identification of ki-sikil-lil-la-ke as Lilith is stated in Dictionary of Deities and Demons in the Bible (1999).Manfred Hutter article in Karel van der Toorn, Bob Becking, Pieter Willem van der Horst – 1999 pp. 520–521, article cites Hutter's own 1988 work Behexung, Entsühnung und Heilung Eisenbrauns 1988. pp. 224–228 According to a new source from Late Antiquity, Lilith appears in a Mandaic magic story where she is considered to represent the branches of a tree with other demonic figures that form other parts of the tree, though this may also include multiple \"Liliths\".Müller-Kessler, C. (2002) \"A Charm against Demons of Time\", in C. Wunsch (ed.), Mining the Archives. Festschrift Christopher Walker on the Occasion of his 60th Birthday (Dresden), p. 185\n\nSuggested translations for the Tablet XII spirit in the tree include ki-sikil as \"sacred place\", lil as \"spirit\", and lil-la-ke as \"water spirit\".Roberta Sterman Sabbath Sacred tropes: Tanakh, New Testament, and Qur'an as literature and culture 2009 but also simply \"owl\", given that the lil is building a home in the trunk of the tree.Sex and gender in the ancient Near East: proceedings of the 47th Rencontre Assyriologique Internationale, Helsinki, July 2–6, 2001, Part 2 p. 481\n\nA connection between the Gilgamesh ki-sikil-lil-la-ke and the Jewish Lilith was rejected by Dietrich Opitz (1932)Opitz, D. Ausgrabungen und Forschungsreisen Ur. AfO 8: 328 and rejected on textual grounds by Sergio Ribichini (1978).Ribichini, S. Lilith nell-albero Huluppu Pp. 25 in Atti del 1° Convegno Italiano sul Vicino Oriente Antico, Rome, 1976\n\nThe bird-footed woman in the Burney Relief\n\nKramer's translation of the Gilgamesh fragment was used by Henri Frankfort (1937)Frankfort, H. The Burney Relief AfO 12: 128, 1937 and Emil Kraeling (1937)Kraeling, E. G. A Unique Babylonian Relief BASOR 67: 168. 1937 to support identification of a woman with wings and bird-feet in the Burney Relief as related to Lilith, but this has been rejected by later sources, including the British Museum, which is in current possession of the piece.\nThe terracotta plaque depicts a beautiful, naked goddess-like sylph with bird-like features who stands atop two lions and between two owls. Although once believed to be the actual image of Lilith, it is now thought to possibly represent Inanna, the Sumerian goddess of love, fertility, beauty, war, and sexual desire. The depiction of the nocturnal and predatory owls, however, have led many to believe the relief is an affirmation of Lilith’s role as a demon who flies about the underworld, delivering night terrors to those who sleep.\n\nThe Arslan Tash amulets\n\nThe Arslan Tash amulets are limestone plaques discovered in 1933 at Arslan Tash, the authenticity of which is disputed. William F. Albright, Theodor H. Gaster,Gaster, T. H. 1942. A Canaanite Magical Text. Or 11: and others, accepted the amulets as a pre-Jewish source which shows that the name Lilith already existed in the 7th century BCE but Torczyner (1947) identified the amulets as a later Jewish source.Torczyner, H. 1947. \"A Hebrew Incantation against Night-Demons from Biblical Times\". JNES 6: 18–29.\n\nIn the Bible\n\nThe only occurrence is in the Book of Isaiah 34:14, describing the desolation of Edom, where the Hebrew word lilit (or lilith) appears in a list of eight unclean animals, some of which may have demonic associations. The word lilit (or lilith) only appears once in the Hebrew Bible, while the other seven terms in the list appear more than once and thus are better documented. The reading of scholars and translators is often guided by a decision about the complete list of eight creatures as a whole.Jan De Waard Translators Handbook on Isaiah; Delitzsch IsaiahSee The animals mentioned in the Bible Henry Chichester Hart 1888, and more modern sources; also entries Brown Driver Briggs Hebrew Lexicon for tsiyyim... 'iyyim... sayir... liylith... qippowz... dayah Quoting from Isaiah 34 (NAB):\n\nHebrew text\n\nIn the Masoretic Text:\n\nIn the Dead Sea Scrolls, among the 19 fragments of Isaiah found at Qumran, the Great Isaiah Scroll (1Q1Isa) in 34:14 renders the creature as plural liliyyot (or liliyyoth).Blair J. \"De-demonising the Old Testament\" p.27Christopher R. A. Morray-Jones A transparent illusion: the dangerous vision of water in Hekhalot Vol.59 p258 2002 \"Early evidence of the belief in a plurality of liliths is provided by the Isaiah scroll from Qumran, which gives the name as liliyyot, and by the targum to Isaiah, which, in both cases, reads\" (Targum reads: \"when Lilith the Queen of [Sheba] and of Margod fell upon them.\")\n\nEberhard Schrader (1875)Jahrbuch für Protestantische Theologie 1, 1875. p128 and Moritz Abraham Levy (1885) suggest that Lilith was a goddess of the night, known also by the Jewish exiles in Babylon. Schrader's and Levy's view is therefore partly dependent on a later dating of Deutero-Isaiah to the 6th century BC, and the presence of Jews in Babylon which would coincide with the possible references to the ' in Babylonian demonology. However, this view is challenged by some modern research such as by Judit M. Blair (2009) who considers that the context indicates unclean animals.Judit M. Blair De-Demonising the Old Testament – An Investigation of Azazel, Lilit (Lilith), Deber (Dever), Qeteb (Qetev) and Reshep (Resheph) in the Hebrew Bible. Forschungen zum Alten Testament 2 Reihe, Mohr Siebeck 2009 \n\nGreek version\n\nThe Septuagint translates the reference into Greek as onokentauros, apparently for lack of a better word, since also the se'irim, \"satyrs\", earlier in the verse are translated with daimon onokentauros. The \"wild beasts of the island and the desert\" are omitted altogether, and the \"crying to his fellow\" is also done by the daimon onokentauros.34:14 καὶ συναντήσουσιν δαιμόνια ὀνοκενταύροις καὶ βοήσουσιν ἕτερος πρὸς τὸν ἕτερον ἐκεῖ ἀναπαύσονται ὀνοκένταυροι εὗρον γὰρ αὑτοῖς ἀνάπαυσιν\n\nLatin Bible\n\nThe early 5th-century Vulgate translated the same word as lamia.\n\nThe translation is, \"And demons shall meet with monsters, and one hairy one shall cry out to another; there the lamia has lain down and found rest for herself\".\n\nEnglish versions\n\nWycliffe's Bible (1395) preserves the Latin rendering lamia:\n\nThe Bishops' Bible of Matthew Parker (1568) from the Latin:\n\nDouay–Rheims Bible (1582/1610) also preserves the Latin rendering lamia:\n\nThe Geneva Bible of William Madison Whittington (1587) from the Hebrew:\n\nThen the King James Version (1611):\n\nThe \"screech owl\" translation of the King James Version is, together with the \"owl\" (', probably a water bird) in 34:11 and the \"great owl\" (', properly a snake) of 34:15, an attempt to render the passage by choosing suitable animals for difficult-to-translate Hebrew words.\n\nLater translations include:\n* night-owl (Young, 1898)\n* night-spectre (Rotherham, Emphasized Bible, 1902)\n* night monster (ASV, 1901; JPS 1917, Good News Translation, 1992; NASB, 1995)\n* vampires (Moffatt Translation, 1922; Knox Bible, 1950)\n* night hag (Revised Standard Version, 1947)\n* Lilith (Jerusalem Bible, 1966)\n* lilith (New American Bible, 1970)\n* Lilith (New Revised Standard Version, 1989)\n* Lilith (The Message (Bible), Peterson, 1993)\n* night creature (New International Version, 1978; New King James Version, 1982; New Living Translation, 1996, Today's New International Version)\n* nightjar (New World Translation of the Holy Scriptures, 1984)\n* night bird (English Standard Version, 2001)\n\nJewish tradition\n\nMajor sources in Jewish tradition regarding Lilith in chronological order include:\n* c. 40–10BCE Dead Sea Scrolls – Songs for a Sage (4Q510-511)\n* c. 200 Mishnah – not mentioned\n* c. 500 Gemara of the Talmud\n* c. 800 The Alphabet of Ben-Sira\n* c. 900 Midrash Abkir\n* c. 1260 Treatise on the Left Emanation, Spain\n* c. 1280 Zohar, Spain.\n\nDead Sea Scrolls\n\nThe Dead Sea Scrolls contain one indisputable reference to Lilith in Songs of the Sage (4Q510–511)Michael T. Davis, Brent A. Strawn Qumran studies: new approaches, new questions 2007 p47: \"two manuscripts that date to the Herodian period, with 4Q510 slightly earlier\" fragment 1:\n\nAnd I, the Instructor, proclaim His glorious splendour so as to frighten and to te[rrify] all the spirits of the destroying angels, spirits of the bastards, demons, Lilith, howlers, and [desert dwellers] ... and those which fall upon men without warning to lead them astray from a spirit of understanding and to make their heart and their ... desolate during the present dominion of wickedness and predetermined time of humiliations for the sons of lig[ht], by the guilt of the ages of [those] smitten by iniquity – not for eternal destruction, [bu]t for an era of humiliation for transgression.Bruce Chilton, Darrell Bock, Daniel M. Gurtner A Comparative Handbook to the Gospel of Mark p84\n\nAs with the Massoretic Text of Isaiah 34:14, and therefore unlike the plural liliyyot (or liliyyoth) in the Isaiah scroll 34:14, lilit in 4Q510 is singular, this liturgical text both cautions against the presence of supernatural malevolence and assumes familiarity with Lilith; distinct from the biblical text, however, this passage does not function under any socio-political agenda, but instead serves in the same capacity as An Exorcism (4Q560) and Songs to Disperse Demons (11Q11). The text is thus, to a community \"deeply involved in the realm of demonology\",Revue de Qumrân 1991 p133 an exorcism hymn.\n\nJoseph M. Baumgarten (1991) identified the unnamed woman of The Seductress (4Q184) as related to female demon.Baumgarten, J. M. \"On the Nature of the Seductress in 4Q184\", Revue de Qumran 15 (1991–2), 133–143; \"The seductress of Qumran\", Bible Review 17 no 5 (2001), 21–23; 42 However, John J. CollinsCollins, Jewish wisdom in the Hellenistic age regards this identification as \"intriguing\" but that it is \"safe to say\" that (4Q184) is based on the strange woman of Proverbs 2, 5, 7, 9:\n\nTalmud\n\nLilith does not occur in the Mishnah. There are three references to Lilith in the Babylonian Talmud in Gemara on three separate Tractates of the Mishnah:\n* \"Rab Judah citing Samuel ruled: If an abortion had the likeness of Lilith its mother is unclean by reason of the birth, for it is a child but it has wings.\" (Babylonian Talmud on Tractate Nidda 24b)Tractate Niddah in the Mishnah is the only tractate from the Order of Tohorot which has Talmud on it. The Jerusalem Talmud is incomplete here, but the Babylonian Talmud on Tractate Niddah (2a–76b) is complete.\n* \"[Expounding upon the curses of womanhood] In a Baraitha it was taught: She grows long hair like Lilith, sits when making water like a beast, and serves as a bolster for her husband.\" (Babylonian Talmud on Tractate Eruvin 100b)\n* \"R. Hanina said: One may not sleep in a house alone [in a lonely house], and whoever sleeps in a house alone is seized by Lilith.\" (Babylonian Talmud on Tractate Shabbath 151b)\n\nThe above statement by Hanina may be related to the belief that nocturnal emissions engendered the birth of demons:\n* \"R. Jeremiah b. Eleazar further stated: In all those years [130 years after his expulsion from the Garden of Eden] during which Adam was under the ban he begot ghosts and male demons and female demons [or night demons], for it is said in Scripture: And Adam lived a hundred and thirty years and begot a son in own likeness, after his own image, from which it follows that until that time he did not beget after his own image ... When he saw that through him death was ordained as punishment he spent a hundred and thirty years in fasting, severed connection with his wife for a hundred and thirty years, and wore clothes of fig on his body for a hundred and thirty years. – That statement [of R. Jeremiah] was made in reference to the semen which he emitted accidentally.\" (Babylonian Talmud on Tractate Eruvin 18b)\n\nAccording to Rabbi Hiyya God proceeded to create a second Eve for Adam, after Lilith had to return to dust (Genesis Rabbah 22:7 and 18:4).\n\nIncantation bowls\n\nAn individual Lilith, along with Bagdana \"king of the lilits\", is one of the demons to feature prominently in protective spells in the eighty surviving Jewish occult incantation bowls from Sassanid Empire Babylon (4th–6th century CE).Janet Howe Gaines Biblical Archaeology Review [http://www.bib-arch.org/e-features/lilith.asp Lilith: Seductress, Heroine or Murderer?] \"One bowl now on display at Harvard University's Semitic Museum reads, “Thou Lilith ... Hag and Snatcher, I adjure you by the Strong One of Abraham, by the ...\" These bowls were buried upside down in houses to trap the demon, and almost every Jewish house in Nippur was found to have such protective bowls buried.Descenders to the chariot: the people behind the Hekhalot literature, p. 277 James R. Davila – 2001: \"that they be used by anyone and everyone. The whole community could become the equals of the sages. Perhaps this is why nearly every house excavated in the Jewish settlement in Nippur had one or more incantation bowl buried in it.\" One bowl contains the following inscription commissioned from a Jewish occultist to protect a woman called Rashnoi and her husband from Lilith:\n\nAlphabet of Ben Sira\n\nThe pseudepigraphicalThe attribution to the sage Ben Sira is considered false, with the true author unknown. 8th–10th centuries Alphabet of Ben Sira is considered to be the oldest form of the story of Lilith as Adam's first wife. Whether this particular tradition is older is not known. Scholars tend to date the Alphabet between the 8th and 10th centuries CE. The work has been characterized as satirical.\n\nIn the text an amulet is inscribed with the names of three angels (Senoy, Sansenoy, and Semangelof) and placed around the neck of newborn boys in order to protect them from the lilin until their circumcision.Alphabet of Ben Sirah, Question #5 (23a–b) The amulets used against Lilith that were thought to derive from this tradition are, in fact, dated as being much older.Humm, Alan. [http://ccat.sas.upenn.edu/~humm/Topics/Lilith/alphabet.html Lilith in the Alphabet of Ben Sira] The concept of Eve having a predecessor is not exclusive to the Alphabet, and is not a new concept, as it can be found in Genesis Rabbah. However, the idea that Lilith was the predecessor may be exclusive to the Alphabet.\n\nThe idea in the text that Adam had a wife prior to Eve may have developed from an interpretation of the Book of Genesis and its dual creation accounts; while Genesis 2:22 describes God's creation of Eve from Adam's rib, an earlier passage, 1:27, already indicates that a woman had been made: \"So God created man in his own image, in the image of God created he him; male and female created he them.\" The Alphabet text places Lilith's creation after God's words in Genesis 2:18 that \"it is not good for man to be alone\"; in this text God forms Lilith out of the clay from which he made Adam but she and Adam bicker. Lilith claims that since she and Adam were created in the same way they were equal and she refuses to submit to him:\n\nAfter God created Adam, who was alone, He said, \"It is not good for man to be alone.\" He then created a woman for Adam, from the earth, as He had created Adam himself, and called her Lilith. Adam and Lilith immediately began to fight. She said, \"I will not lie below,\" and he said, \"I will not lie beneath you, but only on top. For you are fit only to be in the bottom position, while I am to be the superior one.\" Lilith responded, \"We are equal to each other inasmuch as we were both created from the earth.\" But they would not listen to one another. When Lilith saw this, she pronounced the Ineffable Name and flew away into the air.\n\nAdam stood in prayer before his Creator: \"Sovereign of the universe!\" he said, \"the woman you gave me has run away.\" At once, the Holy One, blessed be He, sent these three angels Senoy, Sansenoy, and Semangelof, to bring her back.\n\nSaid the Holy One to Adam, \"If she agrees to come back, what is made is good. If not, she must permit one hundred of her children to die every day.\" The angels left God and pursued Lilith, whom they overtook in the midst of the sea, in the mighty waters wherein the Egyptians were destined to drown. They told her God's word, but she did not wish to return. The angels said, \"We shall drown you in the sea.\"\n\n\"Leave me!' she said. \"I was created only to cause sickness to infants. If the infant is male, I have dominion over him for eight days after his birth, and if female, for twenty days.\"\n\nWhen the angels heard Lilith's words, they insisted she go back. But she swore to them by the name of the living and eternal God: \"Whenever I see you or your names or your forms in an amulet, I will have no power over that infant.\" She also agreed to have one hundred of her children die every day. Accordingly, every day one hundred demons perish, and for the same reason, we write the angels' names on the amulets of young children. When Lilith sees their names, she remembers her oath, and the child recovers.\n\nThe background and purpose of The Alphabet of Ben-Sira is unclear. It is a collection of stories about heroes of the Bible and Talmud, it may have been a collection of folk-tales, a refutation of Christian, Karaite, or other separatist movements; its content seems so offensive to contemporary Jews that it was even suggested that it could be an anti-Jewish satire,Segal, Eliezer. [http://www.acs.ucalgary.ca/~elsegal/Shokel/950206_Lilith.html Looking for Lilith] although, in any case, the text was accepted by the Jewish mystics of medieval Germany.\n\nThe Alphabet of Ben-Sira is the earliest surviving source of the story, and the conception that Lilith was Adam's first wife became only widely known with the 17th century Lexicon Talmudicum of German scholar Johannes Buxtorf.\n\nIn this folk tradition that arose in the early Middle Ages Lilith, a dominant female demon, became identified with Asmodeus, King of Demons, as his queen.Schwartz p.7 Asmodeus was already well known by this time because of the legends about him in the Talmud. Thus, the merging of Lilith and Asmodeus was inevitable.Schwartz p 8 The second myth of Lilith grew to include legends about another world and by some accounts this other world existed side by side with this one, Yenne Velt is Yiddish for this described \"Other World\". In this case Asmodeus and Lilith were believed to procreate demonic offspring endlessly and spread chaos at every turn.Schwartz p.8 Many disasters were blamed on both of them, causing wine to turn into vinegar, men to be impotent, women unable to give birth, and it was Lilith who was blamed for the loss of infant life. The presence of Lilith and her cohorts were considered very real at this time.\n\nTwo primary characteristics are seen in these legends about Lilith: Lilith as the incarnation of lust, causing men to be led astray, and Lilith as a child-killing witch, who strangles helpless neonates. These two aspects of the Lilith legend seemed to have evolved separately; there is hardly a tale where she encompasses both roles. But the aspect of the witch-like role that Lilith plays broadens her archetype of the destructive side of witchcraft. Such stories are commonly found among Jewish folklore.\n\nKabbalah\n\nKabbalistic mysticism attempted to establish a more exact relationship between Lilith and the Deity. With her major characteristics having been well-developed by the end of the Talmudic period, after six centuries had elapsed between the Aramaic incantation texts that mention Lilith and the early Spanish Kabbalistic writings in the 13th century, she reappears, and her life history becomes known in greater mythological detail.Patai pp. 229–230\n\nHer creation is described in many alternative versions. One mentions her creation as being before Adam's, on the fifth day, because the \"living creatures\" with whose swarms God filled the waters included none other than Lilith. A similar version, related to the earlier Talmudic passages, recounts how Lilith was fashioned with the same substance as Adam was, shortly before. A third alternative version states that God originally created Adam and Lilith in a manner that the female creature was contained in the male. Lilith's soul was lodged in the depths of the Great Abyss. When God called her, she joined Adam. After Adam's body was created a thousand souls from the Left (evil) side attempted to attach themselves to him. However, God drove them off. Adam was left lying as a body without a soul. Then a cloud descended and God commanded the earth to produce a living soul. This God breathed into Adam, who began to spring to life and his female was attached to his side. God separated the female from Adam's side. The female side was Lilith, whereupon she flew to the Cities of the Sea and attacks humankind. Yet another version claims that Lilith emerged as a divine entity that was born spontaneously, either out of the Great Supernal Abyss or out of the power of an aspect of God (the Gevurah of Din). This aspect of God, one of his ten attributes (Sefirot), at its lowest manifestation has an affinity with the realm of evil and it is out of this that Lilith merged with Samael.Patai p.230\n\nAn alternative story links Lilith with the creation of luminaries. The \"first light\", which is the light of Mercy (one of the Sefirot), appeared on the first day of creation when God said \"Let there be light\". This light became hidden and the Holiness became surrounded by a husk of evil. \"A husk (klippa) was created around the brain\" and this husk spread and brought out another husk, which was Lilith.Patai p. 231\n\nMidrash ABKIR\n\nThe first medieval source to depict Adam and Lilith in full was the Midrash A.B.K.I.R. (c. 10th century), which was followed by the Zohar and Kabbalistic writings. Adam is said to be perfect until he recognizes either his sin or Cain's fratricide that is the cause of bringing death into the world. He then separates from holy Eve, sleeps alone, and fasts for 130 years. During this time Lilith, also known as Pizna, desired his beauty and came to him against his will.\n\nTreatise on the Left Emanation\n\nThe mystical writing of two brothers Jacob and Isaac Hacohen, which predates the Zohar by a few decades, states that Samael and Lilith are in the shape of an androgynous being, double-faced, born out of the emanation of the Throne of Glory and corresponding in the spiritual realm to Adam and Eve, who were likewise born as a hermaphrodite. The two twin androgynous couples resembled each other and both \"were like the image of Above\"; that is, that they are reproduced in a visible form of an androgynous deity.\n\n19. In answer to your question concerning Lilith, I shall explain to you the essence of the matter. Concerning this point there is a received tradition from the ancient Sages who made use of the Secret Knowledge of the Lesser Palaces, which is the manipulation of demons and a ladder by which one ascends to the prophetic levels. In this tradition it is made clear that Samael and Lilith were born as one, similar to the form of Adam and Eve who were also born as one, reflecting what is above. This is the account of Lilith which was received by the Sages in the Secret Knowledge of the Palaces.Patai p.231\n\nAnother version that was also current among Kabbalistic circles in the Middle Ages establishes Lilith as the first of Samael's four wives: Lilith, Naamah, Eisheth, and Agrat bat Mahlat. Each of them are mothers of demons and have their own hosts and unclean spirits in no number.Patai p. 244 The marriage of archangel Samael and Lilith was arranged by \"Blind Dragon\", who is the counterpart of \"the dragon that is in the sea\". Blind Dragon acts as an intermediary between Lilith and Samael:\n\nBlind Dragon rides Lilith the Sinful – may she be extirpated quickly in our days, Amen! – And this Blind Dragon brings about the union between Samael and Lilith. And just as the Dragon that is in the sea (Isa. 27:1) has no eyes, likewise Blind Dragon that is above, in the likeness of a spiritual form, is without eyes, that is to say, without colors. ... (Patai 81:458) Samael is called the Slant Serpent, and Lilith is called the Tortuous Serpent.Humm, Alan. [http://ccat.sas.upenn.edu/~humm/Topics/Lilith/lilsam.html Lilith, Samael, & Blind Dragon]\n\nThe marriage of Samael and Lilith is known as the \"Angel Satan\" or the \"Other God\", but it was not allowed to last. To prevent Lilith and Samael's demonic children Lilin from filling the world, God castrated Samael. In many 17th century Kabbalistic books, this mythologem is based on the identification of \"Leviathan the Slant Serpent and Leviathan the Torturous Serpent\" and a reinterpretation of an old Talmudic myth where God castrated the male Leviathan and slew the female Leviathan in order to prevent them from mating and thereby destroying the earth.Patai p. 246 After Samael became castrated and Lilith was unable to fornicate with him, she left him to couple with men who experience nocturnal emissions. A 15th or 16th century Kabbalah text states that God has \"cooled\" the female Leviathan, meaning that he has made Lilith infertile and she is a mere fornication.\n\nThe Treatise on the Left Emanation says that there are two Liliths, the lesser being married to the great demon Asmodeus.\n\nIn answer to your question concerning Lilith, I shall explain to you the essence of the matter. Concerning this point there is a received tradition from the ancient Sages who made use of the Secret Knowledge of the Lesser Palaces, which is the manipulation of demons and a ladder by which one ascends to the prophetic levels. In this tradition, it is made clear that Samael and Lilith were born as one, similar to the form of Adam and Eve who were also born as one, reflecting what is above. This is the account of Lilith which was received by the Sages in the Secret Knowledge of the Palaces. The Matron Lilith is the mate of Samael. Both of them were born at the same hour in the image of Adam and Eve, intertwined in each other. Asmodeus the great king of the demons has as a mate the Lesser (younger) Lilith, daughter of the king whose name is Qafsefoni. The name of his mate is Mehetabel daughter of Matred, and their daughter is Lilith.R. Isaac b. Jacob Ha-Kohen. [http://ccat.sas.upenn.edu/~humm/Topics/Lilith/jacob_ha_kohen.html Lilith in Jewish Mysticism: Treatise on the Left Emanation]\n\nAnother passage charges Lilith as being a tempting serpent of Eve.\n\nAnd the Serpent, the Woman of Harlotry, incited and seduced Eve through the husks of Light which in itself is holiness. And the Serpent seduced Holy Eve, and enough said for him who understands. And all this ruination came about because Adam the first man coupled with Eve while she was in her menstrual impurity – this is the filth and the impure seed of the Serpent who mounted Eve before Adam mounted her. Behold, here it is before you: because of the sins of Adam the first man all the things mentioned came into being. For Evil Lilith, when she saw the greatness of his corruption, became strong in her husks, and came to Adam against his will, and became hot from him and bore him many demons and spirits and Lilin. (Patai81:455f)\n\nZohar\n\nReferences to Lilith in the Zohar include the following:\n\nShe wanders about at night, vexing the sons of men and causing them to defile themselves (19b)\n\nThis passage may be related to the mention of Lilith in Talmud Shabbath 151b (see above), and also to Talmud Eruvin 18b where nocturnal emissions are connected with the begettal of demons.\n\nRaphael Patai states that older sources state clearly that after Lilith's Red Sea sojourn (mentioned also in Louis Ginzberg's Legends of the Jews), she returned to Adam and begat children from him. In the Zohar, however, Lilith is said to have succeeded in begetting offspring from Adam during their short-lived sexual experience. Lilith leaves Adam in Eden, as she is not a suitable helpmate for him. She returns, later, to force herself upon him. However, before doing so she attaches herself to Cain and bears him numerous spirits and demons.\n\nAccording to Gershom Scholem, the author of the Zohar, Rabbi Moses de Leon, was aware of the folk tradition of Lilith. He was also aware of another story, possibly older, that may be conflicting.Major Trends in Jewish Mysticism, p. 174 According to the Zohar, two female spirits, Lilith and Naamah — found Adam, desired his beauty which was like that of the sun disk, and lay with him. The issue of these unions were demons and spirits called \"the plagues of humankind\".Patai p232 \"Or according to the Zohar, two female spirits, Lilith and Naamah — found him, desired his beauty which was like that of the sun disk, and lay with him. The issue of these unions were demons and spirits\" The added explanation was that it was through Adam's own sin that Lilith overcame him against his will.\n\n17th century Hebrew magical amulets\n\nA copy of Jean de Pauly's translation of the Zohar in the Ritman Library contains an inserted late 17th Century printed Hebrew sheet for use in magical amulets where the prophet Elijah confronts Lilith.\"Printed sheet, late 17th century or early 18th century, 185x130 mm.\n\nThe sheet contains two texts within borders, which are amulets, one for a male ('lazakhar'), the other one for a female ('lanekevah'). The invocations mention Adam, Eve and Lilith, 'Chavah Rishonah' (the first Eve, who is identical with Lilith), also devils or angels: Sanoy, Sansinoy, Smangeluf, Shmari'el (the guardian) and Hasdi'el (the merciful). A few lines in Yiddish are followed by the dialogue between the prophet Elijah and Lilith when he met her with her host of demons to kill the mother and take her new-born child ('to drink her blood, suck her bones and eat her flesh'). She tells Elijah that she will lose her power if someone uses her secret names, which she reveals at the end: lilith, abitu, abizu, hakash, avers hikpodu, ayalu, matrota ...\n\nIn other amulets, probably informed by The Alphabet of Ben-Sira, she is Adam's first wife. (Yalqut Reubeni, Zohar 1:34b, 3:19Humm, Alan. [http://ccat.sas.upenn.edu/~humm/Topics/Lilith/origin.html Kabbalah: Lilith's origins])\n\nTree of Life (Kabbalah)\n\nLilith is listed as one of the Qliphoth, corresponding to the Sephirah Malkuth in the Kabbalistic Tree of Life. The demon Lilith, the evil woman, is described as a beautiful woman, who transforms into a blue, butterfly-like demon, and it is associated with the power of seduction.\n\nThe Qliphah is the unbalanced power of a Sephirah. Malkuth is the lowest Sephirah, the realm of the earth, into which all the divine energy flows, and in which the divine plan is worked out. However, its unbalanced form is as Lilith, the seductress. The material world, and all of its pleasures, is the ultimate seductress, and can lead to materialism unbalanced by the spirituality of the higher spheres. This ultimately leads to a descent into animal consciousness. The balance must therefore be found between Malkuth and Kether, to find order and harmony.\n\nGreco-Roman mythology\n\nIn the Latin Vulgate Book of Isaiah 34:14, Lilith is translated lamia.\n\nAccording to Augustine Calmet, Lilith has connections with early views on vampire and sorcery:\n\nAccording to Siegmund Hurwitz the Talmudic Lilith is connected with the Greek Lamia, who, according to Hurwitz, likewise governed a class of child stealing lamia-demons. Lamia bore the title \"child killer\" and was feared for her malevolence, like Lilith. She has different conflicting origins and is described as having a human upper body from the waist up and a serpentine body from the waist down.Hurwitz p. 43 One source states simply that she is a daughter of the goddess Hecate. Another, that Lamia was subsequently cursed by the goddess Hera to have stillborn children because of her association with Zeus; alternatively, Hera slew all of Lamia's children (except Scylla) in anger that Lamia slept with her husband, Zeus. The grief caused Lamia to turn into a monster that took revenge on mothers by stealing their children and devouring them.Hurwitz p.43 Lamia had a vicious sexual appetite that matched her cannibalistic appetite for children. She was notorious for being a vampiric spirit and loved sucking men's blood.Hurwitz p.78 Her gift was the \"mark of a Sibyl\", a gift of second sight. Zeus was said to have given her the gift of sight. However, she was \"cursed\" to never be able to shut her eyes so that she would forever obsess over her dead children. Taking pity on Lamia, Zeus gave her the ability to remove and replace her eyes from their sockets.\n\nThe Empusae were a class of supernatural demons that Lamia was said to have birthed. Hecate would often send them against travelers. They consumed or scared to death any of the people where they inhabited. They bear many similarities to lilim. It has been suggested that later medieval lore of the succubi or lilim is derived from this myth.\n\nArabic mythology\n\nLilith is not found in the Quran or Hadith. The Sufi occult writer Ahmad al-Buni (d. 1225), in his Sun of the Great Knowledge (), mentions a demon called \"the mother of children\", a term also used \"in one place\"\"an eine Stelle\" Hurwitz S. Die erste Eva: Eine historische und psychologische Studie 2004 Page 160 \"8) Lilith in der arabischen Literatur: Die Karina Auch in der arabischen Literatur hat der Lilith-Mythos seinen Niederschlag gefunden.\" in the Zohar and is therefore probably derived from Jewish mythology.\n\nIn Western literature\n\nIn German literature\n\nLilith's earliest appearance in the literature of the Romantic period (1789–1832) was in Goethe's 1808 work Faust: The First Part of the Tragedy.\n\nAfter Mephistopheles offers this warning to Faust, he then, quite ironically, encourages Faust to dance with \"the Pretty Witch\". Lilith and Faust engage in a short dialogue, where Lilith recounts the days spent in Eden.\n\nIn English literature\n\nThe Pre-Raphaelite Brotherhood, which developed around 1848, were greatly influenced by Goethe's work on the theme of Lilith. In 1863, Dante Gabriel Rossetti of the Brotherhood began painting what would later be his first rendition of Lady Lilith, a painting he expected to be his \"best picture hitherto\". Symbols appearing in the painting allude to the \"femme fatale\" reputation of the Romantic Lilith: poppies (death and cold) and white roses (sterile passion). Accompanying his Lady Lilith painting from 1866, Rossetti wrote a sonnet entitled Lilith, which was first published in Swinburne's pamphlet-review (1868), Notes on the Royal Academy Exhibition.\n\nThe poem and the picture appeared together alongside Rossetti's painting Sibylla Palmifera and the sonnet Soul's Beauty. In 1881, the Lilith sonnet was renamed \"Body's Beauty\" in order to contrast it and Soul's Beauty. The two were placed sequentially in The House of Life collection (sonnets number 77 and 78).\n\nRossetti wrote in 1870:\n\nThis is in accordance with Jewish folk tradition, which associates Lilith both with long hair (a symbol of dangerous feminine seductive power in Jewish culture), and with possessing women by entering them through mirrors.\n\nThe Victorian poet Robert Browning re-envisioned Lilith in his poem \"Adam, Lilith, and Eve\". First published in 1883, the poem uses the traditional myths surrounding the triad of Adam, Eve, and Lilith. Browning depicts Lilith and Eve as being friendly and complicitous with each other, as they sit together on either side of Adam. Under the threat of death, Eve admits that she never loved Adam, while Lilith confesses that she always loved him:\n\nBrowning focused on Lilith's emotional attributes, rather than that of her ancient demon predecessors.Seidel, Kathryn Lee. [http://weberstudies.weber.edu/archive/archive%20A%20%20Vol.%201-10.3/vol.%2010.2/10.2Seidel.htm The Lilith Figure in Toni Morrison's Sula and Alice Walker's The Color Purple]\n\nScottish author George MacDonald also wrote a fantasy novel entitled Lilith, first published in 1895. MacDonald employed the character of Lilith in service to a spiritual drama about sin and redemption, in which Lilith finds a hard-won salvation. Many of the traditional characteristics of Lilith mythology are present in the author's depiction: Long dark hair, pale skin, a hatred and fear of children and babies, and an obsession with gazing at herself in a mirror. MacDonald's Lilith also has vampiric qualities: she bites people and sucks their blood for sustenance.\n\nAustralian poet and scholar Christopher John Brennan (1870–1932), included a section titled \"Lilith\" in his major work \"Poems: 1913\" (Sydney : G. B. Philip and Son, 1914). The \"Lilith\" section contains thirteen poems exploring the Lilith myth and is central to the meaning of the collection as a whole.\n\nC. L. Moore's 1940 story Fruit of Knowledge is written from Lilith's point of view. It is a re-telling of the Fall of Man as a love triangle between Lilith, Adam and Eve – with Eve's eating the forbidden fruit being in this version the result of misguided manipulations by the jealous Lilith, who had hoped to get her rival discredited and destroyed by God and thus regain Adam's love.\n\nBritish poet John Siddique's 2011 collection Full Blood has a suite of 11 poems called The Tree of Life, which features Lilith as the divine feminine aspect of God. A number of the poems feature Lilith directly, including the piece Unwritten which deals with the spiritual problem of the feminine being removed by the scribes from The Bible.\n\nLilith is also mentioned in The Lion, the Witch and the Wardrobe, by C.S.Lewis. The character Mr. Beaver ascribes the ancestry of the main antagonist, Jadis the White Witch, to Lilith.The Lion, the Witch, and Wardrobe, Collier Books (paperback, Macmillan subsidiary), 1970, pg. 77\n\nIn Armenian literature\n\nThe poem \"Lilith\" by the renowned 20th century Armenian writer Avetic Isahakyan is based on the Jewish legend. Isahakyan wrote \"Lilith\" in 1921 in Venice. His heroine was a creature who emerged from fire. Adam fell in love with Lilith, but Lilith was very indifferent, sympathy being her only feeling for the latter because Adam was a creature made of soil, not fire.\n\nIn modern occultism\n\nThe depiction of Lilith in Romanticism continues to be popular among Wiccans and in other modern Occultism. A few magical orders dedicated to the undercurrent of Lilith, featuring initiations specifically related to the arcana of the \"first mother\", exist. Two organizations that use initiations and magic associated with Lilith are the Ordo Antichristianus Illuminati and the Order of Phosphorus. Lilith appears as a succubus in Aleister Crowley's De Arte Magica. Lilith was also one of the middle names of Crowley’s first child, Nuit Ma Ahathoor Hecate Sappho Jezebel Lilith Crowley (1904–1906), and Lilith is sometimes identified with Babalon in Thelemic writings. Many early occult writers that contributed to modern day Wicca expressed special reverence for Lilith. Charles Leland associated Aradia with Lilith: Aradia, says Leland, is Herodias, who was regarded in stregheria folklore as being associated with Diana as chief of the witches. Leland further notes that Herodias is a name that comes from West Asia, where it denoted an early form of Lilith.Grimassi, Raven.[http://www.stregheria.com/Marguerite.htm Stregheria: La Vecchia Religione]Leland, Charles.[http://www.sacred-texts.com/pag/aradia/ara18.htm Aradia, Gospel of the Witches-aAppendix]\n\nGerald Gardner asserted that there was continuous historical worship of Lilith to present day, and that her name is sometimes given to the goddess being personified in the coven by the priestess. This idea was further attested by Doreen Valiente, who cited her as a presiding goddess of the Craft: \"the personification of erotic dreams, the suppressed desire for delights\". In some contemporary concepts, Lilith is viewed as the embodiment of the Goddess, a designation that is thought to be shared with what these faiths believe to be her counterparts: Inanna, Ishtar, Asherah, Anath and Isis.Grenn, Deborah J.[http://www.lilithinstitute.com/history.htm History of Lilith Institute] According to one view, Lilith was originally a Sumerian, Babylonian, or Hebrew mother goddess of childbirth, children, women, and sexuality who later became demonized due to the rise of patriarchy.Koltuv Other modern views hold that Lilith is a dark moon goddess on par with the Hindu Kali.R. Buckland \n\nMany modern theistic Satanists consider Lilith as a goddess. She is considered a goddess of independence by those Satanists and is often worshipped by women, but women are not the only people who worship her. Lilith is popular among theistic Satanists because of her association with Satan. Some Satanists believe that she is the wife of Satan and thus think of her as a mother figure. Others base their reverence towards her off of her history as a succubus and praise her as a sex goddess. http://theisticsatanism.com/rituals/standard/Lilith.html A different approach to a Satanic Lilith holds that she was once a fertility and agricultural goddess.http://religion.lilithezine.com/The_Legend_of_Lilith.html\n\nModern Kabbalah and Western mystery tradition\n\nThe western mystery tradition associates Lilith with the Qliphoth of kabbalah. Samael Aun Weor in The Pistis Sophia Unveiled writes that homosexuals are the \"henchmen of Lilith\". Likewise, women who undergo willful abortion, and those who support this practice are \"seen in the sphere of Lilith\". Dion Fortune writes, \"The Virgin Mary is reflected in Lilith\", and that Lilith is the source of \"lustful dreams\".\n\nPopular culture",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lilith" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18630" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Lilith (;  Lîlîṯ) is a figure in Jewish mythology, developed earliest in the Babylonian Talmud (3rd to 5th centuries). Lilith is often envisioned as a dangerous demon of the night, who is sexually wanton, and who steals babies in the darkness. The character is generally thought to derive in part from a historically far earlier class of female demons (lilītu) in ancient Mesopotamian religion, found in cuneiform texts of Sumer, the Akkadian Empire, Assyria, and Babylonia.\n\nIn Jewish folklore, from the satirical book Alphabet of Sirach (c. 700–1000) onwards, Lilith appears as Adam's first wife, who was created at the same time (Rosh Hashanah) and from the same dirt as Adam – compare Genesis 1:27. (This contrasts with Eve, who was created from one of Adam's ribs: Genesis 2:22.) The legend developed extensively during the Middle Ages, in the tradition of Aggadah, the Zohar, and Jewish mysticism. For example, in the 13th-century writings of Isaac ben Jacob ha-Cohen, Lilith left Adam after she refused to become subservient to him and then would not return to the Garden of Eden after she had coupled with the archangel Samael.\n\nEvidence in later Jewish materials is plentiful, but little information has survived relating to the original Sumerian, Akkadian, Assyrian and Babylonian view of these demons. While the connection is almost universally agreed upon, recent scholarship has disputed the relevance of two sources previously used to connect the Jewish lilith to an Akkadian lilītu—the Gilgamesh appendix and the Arslan Tash amulets.Freedman, David Noel, ed., Anchor Bible Dictionary, (New York: Doubleday) 1997, 1992. \"Very little information has been found relating to the Akkadian and Babylonian view of these figures. Two sources of information previously used to define Lilith are both suspect.\" (See below for discussion of the two problematic sources. \"Other scholars, such as Lowell K. Handy, agree that Lilith is derived from Mesopotamian demons but argue against finding evidence of the Hebrew Lilith in many of the epigraphical and artifactual sources frequently cited as such (e.g., the Sumerian Gilgamesh fragment, the Sumerian incantation from Arshlan-Tash).\")\n\nIn Hebrew-language texts, the term lilith or lilit (translated as \"night creatures\", \"night monster\", \"night hag\", or \"screech owl\") first occurs in a list of animals in Isaiah 34:14, either in singular or plural form according to variations in the earliest manuscripts. In the Dead Sea Scrolls 4Q510-511, the term first occurs in a list of monsters. In Jewish magical inscriptions on bowls and amulets from the 6th century CE onwards, Lilith is identified as a female demon and the first visual depictions appear.\n\nThe resulting Lilith legend continues to serve as source material in modern Western culture, literature, occultism, fantasy, and horror.\n\nEtymology\n\nThe Semitic root L-Y-L served as derivative for the Hebrew layil and Arabic layl, meaning \"night\". The Talmudic and Yiddish use of Lilith is cognate with the Hebrew.\n\nIn the Akkadian language of Assyria and Babylonia the terms lili and līlītu mean spirits. Some uses of līlītu are listed in The Assyrian Dictionary of the Oriental Institute of the University of Chicago (CAD, 1956, L.190), in Wolfram von Soden's Akkadisches Handwörterbuch (AHw, p. 553), and Reallexikon der Assyriologie (RLA, p. 47).Erich Ebeling, Bruno Meissner, Dietz Otto Edzard Reallexikon der Assyriologie Volume 9 p47,50\n\nThe Sumerian female demons lili have no etymologic relation to Akkadian lilu, \"evening\".Michael C. Astour Hellenosemitica: an ethnic and cultural study in west Semitic impact on Mycenaean. Greece 1965 Brill p138\n\nArchibald Sayce (1882)Sayce (1887)  considered that Hebrew lilit (or lilith)  and the earlier Akkadian līlītu are from proto-Semitic. Charles Fossey (1902)Fossey (1902)  has this literally translating to \"female night being/demon\", although cuneiform inscriptions from Mesopotamia exist where Līlīt and Līlītu refers to disease-bearing wind spirits. Another possibility is association not with \"night\", but with \"wind\", thus identifying the Akkadian Lil-itu as a loan from the Sumerian lil \"air\" — specifically from Ninlil, \"lady air\", goddess of the south wind (and wife of Enlil) — and itud, \"moon\".\n\nMesopotamian mythology\n\nThe spirit in the tree in the Gilgamesh cycle\n\nSamuel Noah Kramer (1932, published 1938)Kramer, S. N. Gilgamesh and the Huluppu-Tree: A Reconstructed Sumerian Text. Assyriological Studies 10. Chicago. 1938 translated ki-sikil-lil-la-ke as Lilith in \"Tablet XII\" of the Epic of Gilgamesh dated c.600 BCE. \"Tablet XII\" is not part of the Epic of Gilgamesh, but is a later Assyrian Akkadian translation of the latter part of the Sumerian poem of Gilgamesh, Enkidu, and the Netherworld.George, A. The epic of Gilgamesh: the Babylonian epic poem and other texts in Akkadian 2003 p100 Tablet XII. Appendix The last Tablet in the 'Series of Gilgamesh'  The ki-sikil-lil-la-ke is associated with a serpent and a zu bird.Kramer translates the zu as \"owl\", but most often it is translated as \"eagle\", \"vulture\", or \"bird of prey\". In Gilgamesh, Enkidu, and the Netherworld, a huluppu tree grows in Inanna's garden in Uruk, whose wood she plans to use to build a new throne. After ten years of growth, she comes to harvest it and finds a serpent living at its base, a Zu bird raising young in its crown, and that a ki-sikil-lil-la-ke made a house in its trunk. Gilgamesh is said to have killed the snake, and then the zu bird flew away to the mountains with its young, while the ki-sikil-lil-la-ke fearfully destroys its house and runs for the forest.Hurwitz (1980) [https://books.google.com/books?hlen&lr\n&id6T9Y1EhiwDUC&oi\nfnd&pgPA49#v\nonepage&q&f=false p. 49] Identification of ki-sikil-lil-la-ke as Lilith is stated in Dictionary of Deities and Demons in the Bible (1999).Manfred Hutter article in Karel van der Toorn, Bob Becking, Pieter Willem van der Horst – 1999 pp. 520–521, article cites Hutter's own 1988 work Behexung, Entsühnung und Heilung Eisenbrauns 1988. pp. 224–228 According to a new source from Late Antiquity, Lilith appears in a Mandaic magic story where she is considered to represent the branches of a tree with other demonic figures that form other parts of the tree, though this may also include multiple \"Liliths\".Müller-Kessler, C. (2002) \"A Charm against Demons of Time\", in C. Wunsch (ed.), Mining the Archives. Festschrift Christopher Walker on the Occasion of his 60th Birthday (Dresden), p. 185\n\nSuggested translations for the Tablet XII spirit in the tree include ki-sikil as \"sacred place\", lil as \"spirit\", and lil-la-ke as \"water spirit\".Roberta Sterman Sabbath Sacred tropes: Tanakh, New Testament, and Qur'an as literature and culture 2009 but also simply \"owl\", given that the lil is building a home in the trunk of the tree.Sex and gender in the ancient Near East: proceedings of the 47th Rencontre Assyriologique Internationale, Helsinki, July 2–6, 2001, Part 2 p. 481\n\nA connection between the Gilgamesh ki-sikil-lil-la-ke and the Jewish Lilith was rejected by Dietrich Opitz (1932)Opitz, D. Ausgrabungen und Forschungsreisen Ur. AfO 8: 328 and rejected on textual grounds by Sergio Ribichini (1978).Ribichini, S. Lilith nell-albero Huluppu Pp. 25 in Atti del 1° Convegno Italiano sul Vicino Oriente Antico, Rome, 1976\n\nThe bird-footed woman in the Burney Relief\n\nKramer's translation of the Gilgamesh fragment was used by Henri Frankfort (1937)Frankfort, H. The Burney Relief AfO 12: 128, 1937 and Emil Kraeling (1937)Kraeling, E. G. A Unique Babylonian Relief BASOR 67: 168. 1937 to support identification of a woman with wings and bird-feet in the Burney Relief as related to Lilith, but this has been rejected by later sources, including the British Museum, which is in current possession of the piece.\nThe terracotta plaque depicts a beautiful, naked goddess-like sylph with bird-like features who stands atop two lions and between two owls. Although once believed to be the actual image of Lilith, it is now thought to possibly represent Inanna, the Sumerian goddess of love, fertility, beauty, war, and sexual desire. The depiction of the nocturnal and predatory owls, however, have led many to believe the relief is an affirmation of Lilith’s role as a demon who flies about the underworld, delivering night terrors to those who sleep.\n\nThe Arslan Tash amulets\n\nThe Arslan Tash amulets are limestone plaques discovered in 1933 at Arslan Tash, the authenticity of which is disputed. William F. Albright, Theodor H. Gaster,Gaster, T. H. 1942. A Canaanite Magical Text. Or 11: and others, accepted the amulets as a pre-Jewish source which shows that the name Lilith already existed in the 7th century BCE but Torczyner (1947) identified the amulets as a later Jewish source.Torczyner, H. 1947. \"A Hebrew Incantation against Night-Demons from Biblical Times\". JNES 6: 18–29.\n\nIn the Bible\n\nThe only occurrence is in the Book of Isaiah 34:14, describing the desolation of Edom, where the Hebrew word lilit (or lilith) appears in a list of eight unclean animals, some of which may have demonic associations. The word lilit (or lilith) only appears once in the Hebrew Bible, while the other seven terms in the list appear more than once and thus are better documented. The reading of scholars and translators is often guided by a decision about the complete list of eight creatures as a whole.Jan De Waard Translators Handbook on Isaiah; Delitzsch IsaiahSee The animals mentioned in the Bible Henry Chichester Hart 1888, and more modern sources; also entries Brown Driver Briggs Hebrew Lexicon for tsiyyim... 'iyyim... sayir... liylith... qippowz... dayah Quoting from Isaiah 34 (NAB):\n\nHebrew text\n\nIn the Masoretic Text:\n\nIn the Dead Sea Scrolls, among the 19 fragments of Isaiah found at Qumran, the Great Isaiah Scroll (1Q1Isa) in 34:14 renders the creature as plural liliyyot (or liliyyoth).Blair J. \"De-demonising the Old Testament\" p.27Christopher R. A. Morray-Jones A transparent illusion: the dangerous vision of water in Hekhalot Vol.59 p258 2002 \"Early evidence of the belief in a plurality of liliths is provided by the Isaiah scroll from Qumran, which gives the name as liliyyot, and by the targum to Isaiah, which, in both cases, reads\" (Targum reads: \"when Lilith the Queen of [Sheba] and of Margod fell upon them.\")\n\nEberhard Schrader (1875)Jahrbuch für Protestantische Theologie 1, 1875. p128 and Moritz Abraham Levy (1885) suggest that Lilith was a goddess of the night, known also by the Jewish exiles in Babylon. Schrader's and Levy's view is therefore partly dependent on a later dating of Deutero-Isaiah to the 6th century BC, and the presence of Jews in Babylon which would coincide with the possible references to the ' in Babylonian demonology. However, this view is challenged by some modern research such as by Judit M. Blair (2009) who considers that the context indicates unclean animals.Judit M. Blair De-Demonising the Old Testament – An Investigation of Azazel, Lilit (Lilith), Deber (Dever), Qeteb (Qetev) and Reshep (Resheph) in the Hebrew Bible. Forschungen zum Alten Testament 2 Reihe, Mohr Siebeck 2009 \n\nGreek version\n\nThe Septuagint translates the reference into Greek as onokentauros, apparently for lack of a better word, since also the se'irim, \"satyrs\", earlier in the verse are translated with daimon onokentauros. The \"wild beasts of the island and the desert\" are omitted altogether, and the \"crying to his fellow\" is also done by the daimon onokentauros.34:14 καὶ συναντήσουσιν δαιμόνια ὀνοκενταύροις καὶ βοήσουσιν ἕτερος πρὸς τὸν ἕτερον ἐκεῖ ἀναπαύσονται ὀνοκένταυροι εὗρον γὰρ αὑτοῖς ἀνάπαυσιν\n\nLatin Bible\n\nThe early 5th-century Vulgate translated the same word as lamia.\n\nThe translation is, \"And demons shall meet with monsters, and one hairy one shall cry out to another; there the lamia has lain down and found rest for herself\".\n\nEnglish versions\n\nWycliffe's Bible (1395) preserves the Latin rendering lamia:\n\nThe Bishops' Bible of Matthew Parker (1568) from the Latin:\n\nDouay–Rheims Bible (1582/1610) also preserves the Latin rendering lamia:\n\nThe Geneva Bible of William Madison Whittington (1587) from the Hebrew:\n\nThen the King James Version (1611):\n\nThe \"screech owl\" translation of the King James Version is, together with the \"owl\" (', probably a water bird) in 34:11 and the \"great owl\" (', properly a snake) of 34:15, an attempt to render the passage by choosing suitable animals for difficult-to-translate Hebrew words.\n\nLater translations include:\n* night-owl (Young, 1898)\n* night-spectre (Rotherham, Emphasized Bible, 1902)\n* night monster (ASV, 1901; JPS 1917, Good News Translation, 1992; NASB, 1995)\n* vampires (Moffatt Translation, 1922; Knox Bible, 1950)\n* night hag (Revised Standard Version, 1947)\n* Lilith (Jerusalem Bible, 1966)\n* lilith (New American Bible, 1970)\n* Lilith (New Revised Standard Version, 1989)\n* Lilith (The Message (Bible), Peterson, 1993)\n* night creature (New International Version, 1978; New King James Version, 1982; New Living Translation, 1996, Today's New International Version)\n* nightjar (New World Translation of the Holy Scriptures, 1984)\n* night bird (English Standard Version, 2001)\n\nJewish tradition\n\nMajor sources in Jewish tradition regarding Lilith in chronological order include:\n* c. 40–10BCE Dead Sea Scrolls – Songs for a Sage (4Q510-511)\n* c. 200 Mishnah – not mentioned\n* c. 500 Gemara of the Talmud\n* c. 800 The Alphabet of Ben-Sira\n* c. 900 Midrash Abkir\n* c. 1260 Treatise on the Left Emanation, Spain\n* c. 1280 Zohar, Spain.\n\nDead Sea Scrolls\n\nThe Dead Sea Scrolls contain one indisputable reference to Lilith in Songs of the Sage (4Q510–511)Michael T. Davis, Brent A. Strawn Qumran studies: new approaches, new questions 2007 p47: \"two manuscripts that date to the Herodian period, with 4Q510 slightly earlier\" fragment 1:\n\nAnd I, the Instructor, proclaim His glorious splendour so as to frighten and to te[rrify] all the spirits of the destroying angels, spirits of the bastards, demons, Lilith, howlers, and [desert dwellers] ... and those which fall upon men without warning to lead them astray from a spirit of understanding and to make their heart and their ... desolate during the present dominion of wickedness and predetermined time of humiliations for the sons of lig[ht], by the guilt of the ages of [those] smitten by iniquity – not for eternal destruction, [bu]t for an era of humiliation for transgression.Bruce Chilton, Darrell Bock, Daniel M. Gurtner A Comparative Handbook to the Gospel of Mark p84\n\nAs with the Massoretic Text of Isaiah 34:14, and therefore unlike the plural liliyyot (or liliyyoth) in the Isaiah scroll 34:14, lilit in 4Q510 is singular, this liturgical text both cautions against the presence of supernatural malevolence and assumes familiarity with Lilith; distinct from the biblical text, however, this passage does not function under any socio-political agenda, but instead serves in the same capacity as An Exorcism (4Q560) and Songs to Disperse Demons (11Q11). The text is thus, to a community \"deeply involved in the realm of demonology\",Revue de Qumrân 1991 p133 an exorcism hymn.\n\nJoseph M. Baumgarten (1991) identified the unnamed woman of The Seductress (4Q184) as related to female demon.Baumgarten, J. M. \"On the Nature of the Seductress in 4Q184\", Revue de Qumran 15 (1991–2), 133–143; \"The seductress of Qumran\", Bible Review 17 no 5 (2001), 21–23; 42 However, John J. CollinsCollins, Jewish wisdom in the Hellenistic age regards this identification as \"intriguing\" but that it is \"safe to say\" that (4Q184) is based on the strange woman of Proverbs 2, 5, 7, 9:\n\nTalmud\n\nLilith does not occur in the Mishnah. There are three references to Lilith in the Babylonian Talmud in Gemara on three separate Tractates of the Mishnah:\n* \"Rab Judah citing Samuel ruled: If an abortion had the likeness of Lilith its mother is unclean by reason of the birth, for it is a child but it has wings.\" (Babylonian Talmud on Tractate Nidda 24b)Tractate Niddah in the Mishnah is the only tractate from the Order of Tohorot which has Talmud on it. The Jerusalem Talmud is incomplete here, but the Babylonian Talmud on Tractate Niddah (2a–76b) is complete.\n* \"[Expounding upon the curses of womanhood] In a Baraitha it was taught: She grows long hair like Lilith, sits when making water like a beast, and serves as a bolster for her husband.\" (Babylonian Talmud on Tractate Eruvin 100b)\n* \"R. Hanina said: One may not sleep in a house alone [in a lonely house], and whoever sleeps in a house alone is seized by Lilith.\" (Babylonian Talmud on Tractate Shabbath 151b)\n\nThe above statement by Hanina may be related to the belief that nocturnal emissions engendered the birth of demons:\n* \"R. Jeremiah b. Eleazar further stated: In all those years [130 years after his expulsion from the Garden of Eden] during which Adam was under the ban he begot ghosts and male demons and female demons [or night demons], for it is said in Scripture: And Adam lived a hundred and thirty years and begot a son in own likeness, after his own image, from which it follows that until that time he did not beget after his own image ... When he saw that through him death was ordained as punishment he spent a hundred and thirty years in fasting, severed connection with his wife for a hundred and thirty years, and wore clothes of fig on his body for a hundred and thirty years. – That statement [of R. Jeremiah] was made in reference to the semen which he emitted accidentally.\" (Babylonian Talmud on Tractate Eruvin 18b)\n\nAccording to Rabbi Hiyya God proceeded to create a second Eve for Adam, after Lilith had to return to dust (Genesis Rabbah 22:7 and 18:4).\n\nIncantation bowls\n\nAn individual Lilith, along with Bagdana \"king of the lilits\", is one of the demons to feature prominently in protective spells in the eighty surviving Jewish occult incantation bowls from Sassanid Empire Babylon (4th–6th century CE).Janet Howe Gaines Biblical Archaeology Review [http://www.bib-arch.org/e-features/lilith.asp Lilith: Seductress, Heroine or Murderer?] \"One bowl now on display at Harvard University's Semitic Museum reads, “Thou Lilith ... Hag and Snatcher, I adjure you by the Strong One of Abraham, by the ...\" These bowls were buried upside down in houses to trap the demon, and almost every Jewish house in Nippur was found to have such protective bowls buried.Descenders to the chariot: the people behind the Hekhalot literature, p. 277 James R. Davila – 2001: \"that they be used by anyone and everyone. The whole community could become the equals of the sages. Perhaps this is why nearly every house excavated in the Jewish settlement in Nippur had one or more incantation bowl buried in it.\" One bowl contains the following inscription commissioned from a Jewish occultist to protect a woman called Rashnoi and her husband from Lilith:\n\nAlphabet of Ben Sira\n\nThe pseudepigraphicalThe attribution to the sage Ben Sira is considered false, with the true author unknown. 8th–10th centuries Alphabet of Ben Sira is considered to be the oldest form of the story of Lilith as Adam's first wife. Whether this particular tradition is older is not known. Scholars tend to date the Alphabet between the 8th and 10th centuries CE. The work has been characterized as satirical.\n\nIn the text an amulet is inscribed with the names of three angels (Senoy, Sansenoy, and Semangelof) and placed around the neck of newborn boys in order to protect them from the lilin until their circumcision.Alphabet of Ben Sirah, Question #5 (23a–b) The amulets used against Lilith that were thought to derive from this tradition are, in fact, dated as being much older.Humm, Alan. [http://ccat.sas.upenn.edu/~humm/Topics/Lilith/alphabet.html Lilith in the Alphabet of Ben Sira] The concept of Eve having a predecessor is not exclusive to the Alphabet, and is not a new concept, as it can be found in Genesis Rabbah. However, the idea that Lilith was the predecessor may be exclusive to the Alphabet.\n\nThe idea in the text that Adam had a wife prior to Eve may have developed from an interpretation of the Book of Genesis and its dual creation accounts; while Genesis 2:22 describes God's creation of Eve from Adam's rib, an earlier passage, 1:27, already indicates that a woman had been made: \"So God created man in his own image, in the image of God created he him; male and female created he them.\" The Alphabet text places Lilith's creation after God's words in Genesis 2:18 that \"it is not good for man to be alone\"; in this text God forms Lilith out of the clay from which he made Adam but she and Adam bicker. Lilith claims that since she and Adam were created in the same way they were equal and she refuses to submit to him:\n\nAfter God created Adam, who was alone, He said, \"It is not good for man to be alone.\" He then created a woman for Adam, from the earth, as He had created Adam himself, and called her Lilith. Adam and Lilith immediately began to fight. She said, \"I will not lie below,\" and he said, \"I will not lie beneath you, but only on top. For you are fit only to be in the bottom position, while I am to be the superior one.\" Lilith responded, \"We are equal to each other inasmuch as we were both created from the earth.\" But they would not listen to one another. When Lilith saw this, she pronounced the Ineffable Name and flew away into the air.\n\nAdam stood in prayer before his Creator: \"Sovereign of the universe!\" he said, \"the woman you gave me has run away.\" At once, the Holy One, blessed be He, sent these three angels Senoy, Sansenoy, and Semangelof, to bring her back.\n\nSaid the Holy One to Adam, \"If she agrees to come back, what is made is good. If not, she must permit one hundred of her children to die every day.\" The angels left God and pursued Lilith, whom they overtook in the midst of the sea, in the mighty waters wherein the Egyptians were destined to drown. They told her God's word, but she did not wish to return. The angels said, \"We shall drown you in the sea.\"\n\n\"Leave me!' she said. \"I was created only to cause sickness to infants. If the infant is male, I have dominion over him for eight days after his birth, and if female, for twenty days.\"\n\nWhen the angels heard Lilith's words, they insisted she go back. But she swore to them by the name of the living and eternal God: \"Whenever I see you or your names or your forms in an amulet, I will have no power over that infant.\" She also agreed to have one hundred of her children die every day. Accordingly, every day one hundred demons perish, and for the same reason, we write the angels' names on the amulets of young children. When Lilith sees their names, she remembers her oath, and the child recovers.\n\nThe background and purpose of The Alphabet of Ben-Sira is unclear. It is a collection of stories about heroes of the Bible and Talmud, it may have been a collection of folk-tales, a refutation of Christian, Karaite, or other separatist movements; its content seems so offensive to contemporary Jews that it was even suggested that it could be an anti-Jewish satire,Segal, Eliezer. [http://www.acs.ucalgary.ca/~elsegal/Shokel/950206_Lilith.html Looking for Lilith] although, in any case, the text was accepted by the Jewish mystics of medieval Germany.\n\nThe Alphabet of Ben-Sira is the earliest surviving source of the story, and the conception that Lilith was Adam's first wife became only widely known with the 17th century Lexicon Talmudicum of German scholar Johannes Buxtorf.\n\nIn this folk tradition that arose in the early Middle Ages Lilith, a dominant female demon, became identified with Asmodeus, King of Demons, as his queen.Schwartz p.7 Asmodeus was already well known by this time because of the legends about him in the Talmud. Thus, the merging of Lilith and Asmodeus was inevitable.Schwartz p 8 The second myth of Lilith grew to include legends about another world and by some accounts this other world existed side by side with this one, Yenne Velt is Yiddish for this described \"Other World\". In this case Asmodeus and Lilith were believed to procreate demonic offspring endlessly and spread chaos at every turn.Schwartz p.8 Many disasters were blamed on both of them, causing wine to turn into vinegar, men to be impotent, women unable to give birth, and it was Lilith who was blamed for the loss of infant life. The presence of Lilith and her cohorts were considered very real at this time.\n\nTwo primary characteristics are seen in these legends about Lilith: Lilith as the incarnation of lust, causing men to be led astray, and Lilith as a child-killing witch, who strangles helpless neonates. These two aspects of the Lilith legend seemed to have evolved separately; there is hardly a tale where she encompasses both roles. But the aspect of the witch-like role that Lilith plays broadens her archetype of the destructive side of witchcraft. Such stories are commonly found among Jewish folklore.\n\nKabbalah\n\nKabbalistic mysticism attempted to establish a more exact relationship between Lilith and the Deity. With her major characteristics having been well-developed by the end of the Talmudic period, after six centuries had elapsed between the Aramaic incantation texts that mention Lilith and the early Spanish Kabbalistic writings in the 13th century, she reappears, and her life history becomes known in greater mythological detail.Patai pp. 229–230\n\nHer creation is described in many alternative versions. One mentions her creation as being before Adam's, on the fifth day, because the \"living creatures\" with whose swarms God filled the waters included none other than Lilith. A similar version, related to the earlier Talmudic passages, recounts how Lilith was fashioned with the same substance as Adam was, shortly before. A third alternative version states that God originally created Adam and Lilith in a manner that the female creature was contained in the male. Lilith's soul was lodged in the depths of the Great Abyss. When God called her, she joined Adam. After Adam's body was created a thousand souls from the Left (evil) side attempted to attach themselves to him. However, God drove them off. Adam was left lying as a body without a soul. Then a cloud descended and God commanded the earth to produce a living soul. This God breathed into Adam, who began to spring to life and his female was attached to his side. God separated the female from Adam's side. The female side was Lilith, whereupon she flew to the Cities of the Sea and attacks humankind. Yet another version claims that Lilith emerged as a divine entity that was born spontaneously, either out of the Great Supernal Abyss or out of the power of an aspect of God (the Gevurah of Din). This aspect of God, one of his ten attributes (Sefirot), at its lowest manifestation has an affinity with the realm of evil and it is out of this that Lilith merged with Samael.Patai p.230\n\nAn alternative story links Lilith with the creation of luminaries. The \"first light\", which is the light of Mercy (one of the Sefirot), appeared on the first day of creation when God said \"Let there be light\". This light became hidden and the Holiness became surrounded by a husk of evil. \"A husk (klippa) was created around the brain\" and this husk spread and brought out another husk, which was Lilith.Patai p. 231\n\nMidrash ABKIR\n\nThe first medieval source to depict Adam and Lilith in full was the Midrash A.B.K.I.R. (c. 10th century), which was followed by the Zohar and Kabbalistic writings. Adam is said to be perfect until he recognizes either his sin or Cain's fratricide that is the cause of bringing death into the world. He then separates from holy Eve, sleeps alone, and fasts for 130 years. During this time Lilith, also known as Pizna, desired his beauty and came to him against his will.\n\nTreatise on the Left Emanation\n\nThe mystical writing of two brothers Jacob and Isaac Hacohen, which predates the Zohar by a few decades, states that Samael and Lilith are in the shape of an androgynous being, double-faced, born out of the emanation of the Throne of Glory and corresponding in the spiritual realm to Adam and Eve, who were likewise born as a hermaphrodite. The two twin androgynous couples resembled each other and both \"were like the image of Above\"; that is, that they are reproduced in a visible form of an androgynous deity.\n\n19. In answer to your question concerning Lilith, I shall explain to you the essence of the matter. Concerning this point there is a received tradition from the ancient Sages who made use of the Secret Knowledge of the Lesser Palaces, which is the manipulation of demons and a ladder by which one ascends to the prophetic levels. In this tradition it is made clear that Samael and Lilith were born as one, similar to the form of Adam and Eve who were also born as one, reflecting what is above. This is the account of Lilith which was received by the Sages in the Secret Knowledge of the Palaces.Patai p.231\n\nAnother version that was also current among Kabbalistic circles in the Middle Ages establishes Lilith as the first of Samael's four wives: Lilith, Naamah, Eisheth, and Agrat bat Mahlat. Each of them are mothers of demons and have their own hosts and unclean spirits in no number.Patai p. 244 The marriage of archangel Samael and Lilith was arranged by \"Blind Dragon\", who is the counterpart of \"the dragon that is in the sea\". Blind Dragon acts as an intermediary between Lilith and Samael:\n\nBlind Dragon rides Lilith the Sinful – may she be extirpated quickly in our days, Amen! – And this Blind Dragon brings about the union between Samael and Lilith. And just as the Dragon that is in the sea (Isa. 27:1) has no eyes, likewise Blind Dragon that is above, in the likeness of a spiritual form, is without eyes, that is to say, without colors. ... (Patai 81:458) Samael is called the Slant Serpent, and Lilith is called the Tortuous Serpent.Humm, Alan. [http://ccat.sas.upenn.edu/~humm/Topics/Lilith/lilsam.html Lilith, Samael, & Blind Dragon]\n\nThe marriage of Samael and Lilith is known as the \"Angel Satan\" or the \"Other God\", but it was not allowed to last. To prevent Lilith and Samael's demonic children Lilin from filling the world, God castrated Samael. In many 17th century Kabbalistic books, this mythologem is based on the identification of \"Leviathan the Slant Serpent and Leviathan the Torturous Serpent\" and a reinterpretation of an old Talmudic myth where God castrated the male Leviathan and slew the female Leviathan in order to prevent them from mating and thereby destroying the earth.Patai p. 246 After Samael became castrated and Lilith was unable to fornicate with him, she left him to couple with men who experience nocturnal emissions. A 15th or 16th century Kabbalah text states that God has \"cooled\" the female Leviathan, meaning that he has made Lilith infertile and she is a mere fornication.\n\nThe Treatise on the Left Emanation says that there are two Liliths, the lesser being married to the great demon Asmodeus.\n\nIn answer to your question concerning Lilith, I shall explain to you the essence of the matter. Concerning this point there is a received tradition from the ancient Sages who made use of the Secret Knowledge of the Lesser Palaces, which is the manipulation of demons and a ladder by which one ascends to the prophetic levels. In this tradition, it is made clear that Samael and Lilith were born as one, similar to the form of Adam and Eve who were also born as one, reflecting what is above. This is the account of Lilith which was received by the Sages in the Secret Knowledge of the Palaces. The Matron Lilith is the mate of Samael. Both of them were born at the same hour in the image of Adam and Eve, intertwined in each other. Asmodeus the great king of the demons has as a mate the Lesser (younger) Lilith, daughter of the king whose name is Qafsefoni. The name of his mate is Mehetabel daughter of Matred, and their daughter is Lilith.R. Isaac b. Jacob Ha-Kohen. [http://ccat.sas.upenn.edu/~humm/Topics/Lilith/jacob_ha_kohen.html Lilith in Jewish Mysticism: Treatise on the Left Emanation]\n\nAnother passage charges Lilith as being a tempting serpent of Eve.\n\nAnd the Serpent, the Woman of Harlotry, incited and seduced Eve through the husks of Light which in itself is holiness. And the Serpent seduced Holy Eve, and enough said for him who understands. And all this ruination came about because Adam the first man coupled with Eve while she was in her menstrual impurity – this is the filth and the impure seed of the Serpent who mounted Eve before Adam mounted her. Behold, here it is before you: because of the sins of Adam the first man all the things mentioned came into being. For Evil Lilith, when she saw the greatness of his corruption, became strong in her husks, and came to Adam against his will, and became hot from him and bore him many demons and spirits and Lilin. (Patai81:455f)\n\nZohar\n\nReferences to Lilith in the Zohar include the following:\n\nShe wanders about at night, vexing the sons of men and causing them to defile themselves (19b)\n\nThis passage may be related to the mention of Lilith in Talmud Shabbath 151b (see above), and also to Talmud Eruvin 18b where nocturnal emissions are connected with the begettal of demons.\n\nRaphael Patai states that older sources state clearly that after Lilith's Red Sea sojourn (mentioned also in Louis Ginzberg's Legends of the Jews), she returned to Adam and begat children from him. In the Zohar, however, Lilith is said to have succeeded in begetting offspring from Adam during their short-lived sexual experience. Lilith leaves Adam in Eden, as she is not a suitable helpmate for him. She returns, later, to force herself upon him. However, before doing so she attaches herself to Cain and bears him numerous spirits and demons.\n\nAccording to Gershom Scholem, the author of the Zohar, Rabbi Moses de Leon, was aware of the folk tradition of Lilith. He was also aware of another story, possibly older, that may be conflicting.Major Trends in Jewish Mysticism, p. 174 According to the Zohar, two female spirits, Lilith and Naamah — found Adam, desired his beauty which was like that of the sun disk, and lay with him. The issue of these unions were demons and spirits called \"the plagues of humankind\".Patai p232 \"Or according to the Zohar, two female spirits, Lilith and Naamah — found him, desired his beauty which was like that of the sun disk, and lay with him. The issue of these unions were demons and spirits\" The added explanation was that it was through Adam's own sin that Lilith overcame him against his will.\n\n17th century Hebrew magical amulets\n\nA copy of Jean de Pauly's translation of the Zohar in the Ritman Library contains an inserted late 17th Century printed Hebrew sheet for use in magical amulets where the prophet Elijah confronts Lilith.\"Printed sheet, late 17th century or early 18th century, 185x130 mm.\n\nThe sheet contains two texts within borders, which are amulets, one for a male ('lazakhar'), the other one for a female ('lanekevah'). The invocations mention Adam, Eve and Lilith, 'Chavah Rishonah' (the first Eve, who is identical with Lilith), also devils or angels: Sanoy, Sansinoy, Smangeluf, Shmari'el (the guardian) and Hasdi'el (the merciful). A few lines in Yiddish are followed by the dialogue between the prophet Elijah and Lilith when he met her with her host of demons to kill the mother and take her new-born child ('to drink her blood, suck her bones and eat her flesh'). She tells Elijah that she will lose her power if someone uses her secret names, which she reveals at the end: lilith, abitu, abizu, hakash, avers hikpodu, ayalu, matrota ...\n\nIn other amulets, probably informed by The Alphabet of Ben-Sira, she is Adam's first wife. (Yalqut Reubeni, Zohar 1:34b, 3:19Humm, Alan. [http://ccat.sas.upenn.edu/~humm/Topics/Lilith/origin.html Kabbalah: Lilith's origins])\n\nTree of Life (Kabbalah)\n\nLilith is listed as one of the Qliphoth, corresponding to the Sephirah Malkuth in the Kabbalistic Tree of Life. The demon Lilith, the evil woman, is described as a beautiful woman, who transforms into a blue, butterfly-like demon, and it is associated with the power of seduction.\n\nThe Qliphah is the unbalanced power of a Sephirah. Malkuth is the lowest Sephirah, the realm of the earth, into which all the divine energy flows, and in which the divine plan is worked out. However, its unbalanced form is as Lilith, the seductress. The material world, and all of its pleasures, is the ultimate seductress, and can lead to materialism unbalanced by the spirituality of the higher spheres. This ultimately leads to a descent into animal consciousness. The balance must therefore be found between Malkuth and Kether, to find order and harmony.\n\nGreco-Roman mythology\n\nIn the Latin Vulgate Book of Isaiah 34:14, Lilith is translated lamia.\n\nAccording to Augustine Calmet, Lilith has connections with early views on vampire and sorcery:\n\nAccording to Siegmund Hurwitz the Talmudic Lilith is connected with the Greek Lamia, who, according to Hurwitz, likewise governed a class of child stealing lamia-demons. Lamia bore the title \"child killer\" and was feared for her malevolence, like Lilith. She has different conflicting origins and is described as having a human upper body from the waist up and a serpentine body from the waist down.Hurwitz p. 43 One source states simply that she is a daughter of the goddess Hecate. Another, that Lamia was subsequently cursed by the goddess Hera to have stillborn children because of her association with Zeus; alternatively, Hera slew all of Lamia's children (except Scylla) in anger that Lamia slept with her husband, Zeus. The grief caused Lamia to turn into a monster that took revenge on mothers by stealing their children and devouring them.Hurwitz p.43 Lamia had a vicious sexual appetite that matched her cannibalistic appetite for children. She was notorious for being a vampiric spirit and loved sucking men's blood.Hurwitz p.78 Her gift was the \"mark of a Sibyl\", a gift of second sight. Zeus was said to have given her the gift of sight. However, she was \"cursed\" to never be able to shut her eyes so that she would forever obsess over her dead children. Taking pity on Lamia, Zeus gave her the ability to remove and replace her eyes from their sockets.\n\nThe Empusae were a class of supernatural demons that Lamia was said to have birthed. Hecate would often send them against travelers. They consumed or scared to death any of the people where they inhabited. They bear many similarities to lilim. It has been suggested that later medieval lore of the succubi or lilim is derived from this myth.\n\nArabic mythology\n\nLilith is not found in the Quran or Hadith. The Sufi occult writer Ahmad al-Buni (d. 1225), in his Sun of the Great Knowledge (), mentions a demon called \"the mother of children\", a term also used \"in one place\"\"an eine Stelle\" Hurwitz S. Die erste Eva: Eine historische und psychologische Studie 2004 Page 160 \"8) Lilith in der arabischen Literatur: Die Karina Auch in der arabischen Literatur hat der Lilith-Mythos seinen Niederschlag gefunden.\" in the Zohar and is therefore probably derived from Jewish mythology.\n\nIn Western literature\n\nIn German literature\n\nLilith's earliest appearance in the literature of the Romantic period (1789–1832) was in Goethe's 1808 work Faust: The First Part of the Tragedy.\n\nAfter Mephistopheles offers this warning to Faust, he then, quite ironically, encourages Faust to dance with \"the Pretty Witch\". Lilith and Faust engage in a short dialogue, where Lilith recounts the days spent in Eden.\n\nIn English literature\n\nThe Pre-Raphaelite Brotherhood, which developed around 1848, were greatly influenced by Goethe's work on the theme of Lilith. In 1863, Dante Gabriel Rossetti of the Brotherhood began painting what would later be his first rendition of Lady Lilith, a painting he expected to be his \"best picture hitherto\". Symbols appearing in the painting allude to the \"femme fatale\" reputation of the Romantic Lilith: poppies (death and cold) and white roses (sterile passion). Accompanying his Lady Lilith painting from 1866, Rossetti wrote a sonnet entitled Lilith, which was first published in Swinburne's pamphlet-review (1868), Notes on the Royal Academy Exhibition.\n\nThe poem and the picture appeared together alongside Rossetti's painting Sibylla Palmifera and the sonnet Soul's Beauty. In 1881, the Lilith sonnet was renamed \"Body's Beauty\" in order to contrast it and Soul's Beauty. The two were placed sequentially in The House of Life collection (sonnets number 77 and 78).\n\nRossetti wrote in 1870:\n\nThis is in accordance with Jewish folk tradition, which associates Lilith both with long hair (a symbol of dangerous feminine seductive power in Jewish culture), and with possessing women by entering them through mirrors.\n\nThe Victorian poet Robert Browning re-envisioned Lilith in his poem \"Adam, Lilith, and Eve\". First published in 1883, the poem uses the traditional myths surrounding the triad of Adam, Eve, and Lilith. Browning depicts Lilith and Eve as being friendly and complicitous with each other, as they sit together on either side of Adam. Under the threat of death, Eve admits that she never loved Adam, while Lilith confesses that she always loved him:\n\nBrowning focused on Lilith's emotional attributes, rather than that of her ancient demon predecessors.Seidel, Kathryn Lee. [http://weberstudies.weber.edu/archive/archive%20A%20%20Vol.%201-10.3/vol.%2010.2/10.2Seidel.htm The Lilith Figure in Toni Morrison's Sula and Alice Walker's The Color Purple]\n\nScottish author George MacDonald also wrote a fantasy novel entitled Lilith, first published in 1895. MacDonald employed the character of Lilith in service to a spiritual drama about sin and redemption, in which Lilith finds a hard-won salvation. Many of the traditional characteristics of Lilith mythology are present in the author's depiction: Long dark hair, pale skin, a hatred and fear of children and babies, and an obsession with gazing at herself in a mirror. MacDonald's Lilith also has vampiric qualities: she bites people and sucks their blood for sustenance.\n\nAustralian poet and scholar Christopher John Brennan (1870–1932), included a section titled \"Lilith\" in his major work \"Poems: 1913\" (Sydney : G. B. Philip and Son, 1914). The \"Lilith\" section contains thirteen poems exploring the Lilith myth and is central to the meaning of the collection as a whole.\n\nC. L. Moore's 1940 story Fruit of Knowledge is written from Lilith's point of view. It is a re-telling of the Fall of Man as a love triangle between Lilith, Adam and Eve – with Eve's eating the forbidden fruit being in this version the result of misguided manipulations by the jealous Lilith, who had hoped to get her rival discredited and destroyed by God and thus regain Adam's love.\n\nBritish poet John Siddique's 2011 collection Full Blood has a suite of 11 poems called The Tree of Life, which features Lilith as the divine feminine aspect of God. A number of the poems feature Lilith directly, including the piece Unwritten which deals with the spiritual problem of the feminine being removed by the scribes from The Bible.\n\nLilith is also mentioned in The Lion, the Witch and the Wardrobe, by C.S.Lewis. The character Mr. Beaver ascribes the ancestry of the main antagonist, Jadis the White Witch, to Lilith.The Lion, the Witch, and Wardrobe, Collier Books (paperback, Macmillan subsidiary), 1970, pg. 77\n\nIn Armenian literature\n\nThe poem \"Lilith\" by the renowned 20th century Armenian writer Avetic Isahakyan is based on the Jewish legend. Isahakyan wrote \"Lilith\" in 1921 in Venice. His heroine was a creature who emerged from fire. Adam fell in love with Lilith, but Lilith was very indifferent, sympathy being her only feeling for the latter because Adam was a creature made of soil, not fire.\n\nIn modern occultism\n\nThe depiction of Lilith in Romanticism continues to be popular among Wiccans and in other modern Occultism. A few magical orders dedicated to the undercurrent of Lilith, featuring initiations specifically related to the arcana of the \"first mother\", exist. Two organizations that use initiations and magic associated with Lilith are the Ordo Antichristianus Illuminati and the Order of Phosphorus. Lilith appears as a succubus in Aleister Crowley's De Arte Magica. Lilith was also one of the middle names of Crowley’s first child, Nuit Ma Ahathoor Hecate Sappho Jezebel Lilith Crowley (1904–1906), and Lilith is sometimes identified with Babalon in Thelemic writings. Many early occult writers that contributed to modern day Wicca expressed special reverence for Lilith. Charles Leland associated Aradia with Lilith: Aradia, says Leland, is Herodias, who was regarded in stregheria folklore as being associated with Diana as chief of the witches. Leland further notes that Herodias is a name that comes from West Asia, where it denoted an early form of Lilith.Grimassi, Raven.[http://www.stregheria.com/Marguerite.htm Stregheria: La Vecchia Religione]Leland, Charles.[http://www.sacred-texts.com/pag/aradia/ara18.htm Aradia, Gospel of the Witches-aAppendix]\n\nGerald Gardner asserted that there was continuous historical worship of Lilith to present day, and that her name is sometimes given to the goddess being personified in the coven by the priestess. This idea was further attested by Doreen Valiente, who cited her as a presiding goddess of the Craft: \"the personification of erotic dreams, the suppressed desire for delights\". In some contemporary concepts, Lilith is viewed as the embodiment of the Goddess, a designation that is thought to be shared with what these faiths believe to be her counterparts: Inanna, Ishtar, Asherah, Anath and Isis.Grenn, Deborah J.[http://www.lilithinstitute.com/history.htm History of Lilith Institute] According to one view, Lilith was originally a Sumerian, Babylonian, or Hebrew mother goddess of childbirth, children, women, and sexuality who later became demonized due to the rise of patriarchy.Koltuv Other modern views hold that Lilith is a dark moon goddess on par with the Hindu Kali.R. Buckland \n\nMany modern theistic Satanists consider Lilith as a goddess. She is considered a goddess of independence by those Satanists and is often worshipped by women, but women are not the only people who worship her. Lilith is popular among theistic Satanists because of her association with Satan. Some Satanists believe that she is the wife of Satan and thus think of her as a mother figure. Others base their reverence towards her off of her history as a succubus and praise her as a sex goddess. http://theisticsatanism.com/rituals/standard/Lilith.html A different approach to a Satanic Lilith holds that she was once a fertility and agricultural goddess.http://religion.lilithezine.com/The_Legend_of_Lilith.html\n\nModern Kabbalah and Western mystery tradition\n\nThe western mystery tradition associates Lilith with the Qliphoth of kabbalah. Samael Aun Weor in The Pistis Sophia Unveiled writes that homosexuals are the \"henchmen of Lilith\". Likewise, women who undergo willful abortion, and those who support this practice are \"seen in the sphere of Lilith\". Dion Fortune writes, \"The Virgin Mary is reflected in Lilith\", and that Lilith is the source of \"lustful dreams\".\n\nPopular culture. Lilith. http://en.wikipedia.org/?curid=18630."
  }
}
