{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15147",
  "eid" : "1a3aaf30-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778553251,
  "textBody" : "The International Olympic Committee (IOC; French: Comité International Olympique, CIO) is international, non-governmental, non-profit organisation based in Lausanne, Switzerland which is the supreme authority of the worldwide Olympic movement.Roger Bartlett, Chris Gratton, Christer G. Rolf Encyclopedia of International Sports Studies. Routledge, 2012, p. 678 It redistributes more than 90 percent of its income to the wider sporting movement, which means that every day the equivalent of US$ 3.4 million goes to help athletes and sports organisations at all levels around the world. Its mission is enshrined in the Olympic Charter: to support the development of competitive sport by ethical and environmentally sustainable means.\n\nHistory\n\nThe IOC was created by Pierre de Coubertin, on 23 June 1894 with Demetrios Vikelas as its first president. As of June 2017, its membership consists of 95 active members, 41 honorary members, an honorary president (Jacques Rogge) and one honour member (Henry Kissinger). The IOC is the supreme authority of the worldwide modern Olympic movement.\n\nThe IOC organises the modern Olympic Games and Youth Olympic Games, held in summer and winter, every four years. The first Summer Olympics organised by the IOC was held in Athens, Greece, in 1896; the first Winter Olympics was in Chamonix, France, in 1924. Until 1992, both Summer and Winter Olympics were held in the same year. After that year, however, the IOC shifted the Winter Olympics to the even years between Summer Games, to help space the planning of the two events from one another, and improve the financial balance of the IOC, which receives greater income on Olympic years. The first Summer Youth Olympics were in Singapore in 2010 and the first Winter Youth Olympics were held in Innsbruck in 2012.\n\nIn 2009, the UN General Assembly granted the IOC Permanent Observer status. This decision enables the IOC to be directly involved in the UN Agenda and to attend UN General Assembly meetings where it can take the floor. This has provided the possibility to promote sport at a new level. In addition, in 1993, the UN General Assembly approved a Resolution that further solidified IOC–UN cooperation with the decision to revive the Olympic Truce, by adopting a Resolution entitled “Building a peaceful and better world through sport and the Olympic ideal,” which calls upon Member States to observe the Olympic Truce before every iteration of the games, and to cooperate with the IOC and the International Paralympic Committee in their efforts to use sport as a tool to promote peace, dialogue and reconciliation in areas of conflict during and beyond the period of the Olympic and Paralympic Games.\n\nDuring each proclamation at the Olympics, announcers speak in different languages, French is always spoken first followed by an English translation and the dominant language of the host nation.\n\nMission and roles\n\nThe stated mission of the International Olympic Committee (IOC) is to promote Olympic throughout the world and to lead the Olympic Movement.\n\n* To encourage and support the organisation, development and coordination of sport and sports competitions;\n* To ensure the regular celebration of the Olympic Games;\n* To cooperate with the competent public or private organisations and authorities in the endeavour to place sport at the service of humanity and thereby to promote peace;\n* To act against any form of discrimination affecting the Olympic Movement;\n* To encourage and support the promotion of women in sport at all levels and in all structures with a view to implementing the principle of equality of men and women;\n\nIOC Executive Board\n\nIOC Commissions\n\n(*) Interim Chairperson\n\nOrganization\n\nIOC Session\n\nThe IOC Session is the general meeting of the members of the IOC, held once a year in which each member has one vote. It is the IOC’s supreme organ and its decisions are final.\n\nExtraordinary Sessions may be convened by the President or upon the written request of at least one third of the members.\n\nAmong others, the powers of the Session are:\n* To adopt or amend the Olympic Charter.\n* To elect the members of the IOC, the Honorary President and the honorary members.\n* To elect the President, the Vice-Presidents and all other members of the IOC Executive Board.\n* To elect the host city of the Olympic Games.\n\nHonours\n\nIn addition to the Olympic medals for competitors, the IOC awards a number of other honours:\n* the IOC President's Trophy is the highest sports award given to athletes who have excelled in their sport and had an extraordinary career and created a lasting impact on their sport.\n* the Pierre de Coubertin medal is awarded to athletes who demonstrate a special spirit of sportsmanship in Olympic events\n* the Olympic Cup is awarded to institutions or associations with a record of merit and integrity in actively developing the Olympic Movement\n* the Olympic Order is awarded to individuals for particularly distinguished contributions to the Olympic Movement, and superseded the Olympic Certificate.\n* the Olympic Laurel is awarded to individuals for promoting education, culture, development, and peace through sport.\n\nIOC members\n\nFor most of its existence, the IOC was controlled by members who were selected by other members. Countries that had hosted the Games were allowed two members. When named, they did not become the representatives of their respective countries to the IOC, but rather the opposite, IOC members in their respective countries.\n\nCessation of membership\n\nThe membership of IOC members ceases in the following circumstances:Source: Olympic Charter, in force as from 1 September 2004.\n\n# Resignation: any IOC member may cease their membership at any time by delivering a written resignation to the President.\n# Non re-election: any IOC member ceases to be a member without further formality if they are not re-elected.\n# Age limit: any IOC member ceases to be a member at the end of the calendar year during which they reach the age of 80.\n# Failure to attend Sessions or take active part in IOC work for two consecutive years.\n# Transfer of domicile or of main center of interests to a country other than the country which was theirs at the time of their election.\n# Members elected as active athletes cease to be a member upon ceasing to be a member of the IOC Athletes' Commission.\n# Presidents and individuals holding an executive or senior leadership position within NOCs, world or continental associations of NOCs, IFs or associations of IFs, or other organisations recognised by the IOC cease to be a member upon ceasing to exercise the function they were exercising at the time of their election.\n# Expulsion: an IOC member may be expelled by decision of the Session if such member has betrayed their oath or if the Session considers that such member has neglected or knowingly jeopardised the interests of the IOC or acted in a way which is unworthy of the IOC.\n\nInternational federations recognised by IOC\n\nThere are currently 73 sport federations recognised by IOC. These are:\n* The 29 members of Association of Summer Olympic International Federations (ASOIF)\n* The 7 members of Association of International Olympic Winter Sports Federations (AIOWF)\n* The 35 members of Association of IOC Recognised International Sports Federations (ARISF)\n* And 2 of the members of SportAccord (Fédération Internationale de l'Automobile and International Softball Federation)International Softball Federation\n\nOlympic marketing\n\nDuring the first half of the 20th century the IOC ran on a small budget.\n\n As president of the IOC from 1952 to 1972, Avery Brundage rejected all attempts to link the Olympics with commercial interest. Brundage believed the lobby of corporate interests would unduly impact the IOC's decision-making. Brundage's resistance to this revenue stream meant the IOC left organising committees to negotiate their own sponsorship contracts and use the Olympic symbols. When Brundage retired the IOC had US$2 million in assets; eight years later the IOC coffers had swelled to US$45 million. This was primarily due to a shift in ideology toward expansion of the Games through corporate sponsorship and the sale of television rights. When Juan Antonio Samaranch was elected IOC president in 1980 his desire was to make the IOC financially independent. Samaranch appointed Canadian IOC member Richard Pound to lead the initiative as Chairman of the \"New Sources of Finance Commission\".\n\nIn 1982 the IOC drafted ISL Marketing a Swiss sports marketing company, to develop a global marketing programme for the Olympic Movement. ISL successfully developed the programme but was replaced by Meridian Management, a company partly owned by the IOC in the early 1990s.\n\nIn 1989, one of the staff members at ISL Marketing, Michael Payne, moved to the IOC and became the organisation's first marketing director. However ISL and subsequently Meridian, continued in the established role as the IOC's sales and marketing agents until 2002. In 2002 the IOC terminated the relationship with Meridian and took its marketing programme in-house under the Direction of Timo Lumme, the IOC's managing director of IOC Television and Marketing Services. During his 17 years with the IOC, in collaboration with ISL Marketing and subsequently Meridian Management, Payne made major contributions to the creation of a multibillion-dollar sponsorship marketing programme for the organisation which, along with improvements in TV marketing and improved financial management, helped to restore the IOC's financial viability.\n\nRevenue\n\nThe Olympic Movement generates revenue through five major programmes. The International Olympic Committee (IOC) manages broadcast partnerships and The Olympic Partner (TOP) worldwide sponsorship programme. The Organising Committees for the Olympic Games (OCOGs) manage domestic sponsorship, ticketing and licensing programmes within the host country under the direction of the IOC. The Olympic Movement generated a total of more than US$4 billion, €2.5 billion in revenue during the Olympic quadrennium from 2001 to 2004.\n\nRevenue distribution\n\nThe IOC distributes some of Olympic marketing revenue to organisations throughout the Olympic Movement to support the staging of the Olympic Games and to promote the worldwide development of sport. The IOC retains approximately 10% of Olympic marketing revenue for the operational and administrative costs of governing the Olympic Movement.IOC: [http://www.olympic.org/ioc-financing-revenue-sources-distribution?tab=distribution Revenue Sources and Distribution]\n\nOrganising Committees for the Olympic Games (OCOGs)\n\nThe IOC provides The Olympic Partner (TOP) programme contributions and Olympic broadcast revenue to the OCOGs to support the staging of the Olympic Games and Olympic Winter Games:\n* TOP programme revenue to OCOGs; the two OCOGs of each Olympic quadrennium generally share approximately 50% of TOP programme revenue and value-in-kind contributions, with approximately 30% provided to the summer OCOG and 20% provided to the winter OCOG.\n* Broadcast revenue to OCOGs; the IOC contributes 49% of the Olympic broadcast revenue for each Games to the OCOG. During the 2001–2004 Olympic quadrennium, the Salt Lake 2002 Organizing Committee received US$443 million, €395 million in broadcast revenue from the IOC, and the Athens 2004 Organizing Committee received US$732 million, €690 million.\n* Domestic programme revenue to OCOGs; the OCOGs generate substantial revenue from the domestic marketing programmes that they manage within the host country, including domestic sponsorship, ticketing and licensing.\n\nNational Olympic Committees (NOCs)\n\nThe NOCs receive financial support for the training and development of Olympic teams, Olympic athletes and Olympic hopefuls. The IOC distributes TOP programme revenue to each of the NOCs throughout the world. The IOC also contributes Olympic broadcast revenue to Olympic Solidarity, an IOC organisation that provides financial support to NOCs with the greatest need.\n\nThe continued success of the TOP programme and Olympic broadcast agreements has enabled the IOC to provide increased support for the NOCs with each Olympic quadrennium. The IOC provided approximately US$318.5 million to NOCs for the 2001–2004 quadrennium.\n\nInternational Olympic Sports Federations (IFs)\n\nThe IOC is now the largest single revenue source for the majority of IFs, with its contributions of Olympic broadcast revenue that assist the IFs in the development of their respective sports worldwide. The IOC provides financial support from Olympic broadcast revenue to the 28 IFs of Olympic summer sports and the seven IFs of Olympic winter sports after the completion of the Olympic Games and the Olympic Winter Games, respectively.\n\nThe continually increasing value of Olympic broadcast partnership has enabled the IOC to deliver substantially increased financial support to the IFs with each successive Games. The seven winter sports IFs shared US$85.8 million, €75 million in Salt Lake 2002 broadcast revenue. The contribution to the 28 summer sports IFs from Athens 2004 broadcast revenue has not yet been determined, but the contribution is expected to mark a significant increase over the US$190 million, €150 million that the IOC provided to the summer IFs following Sydney 2000.\n\nOther organisations\n\nThe IOC contributes Olympic marketing revenue to the programmes of various recognised international sports organisations, including the International Paralympic Committee, and the World Anti-Doping Agency (WADA).\n\nEnvironmental concerns\n\nThe International Olympic Committee (IOC) recognizes that the Olympic Games demand tremendous environmental resources, activities, and construction projects that could be detrimental to a host city’s environment. In 1995, IOC President Juan Antonio Samaranch stated, “the International Olympic Committee is resolved to ensure that the environment becomes the third dimension of the organization of the Olympic Games, the first and second being sport and culture.”Jagemann H. (2003). Sport and the Environment: Ways toward Achieving the Sustainable Development of Sport. Retrieved 23 October 2016 from: http://thesportjournal.org/article/sports-and-the-environment-ways-towards-achieving-the-sustainable-development-of-sport/ Acting on this statement, in 1996 the IOC added the ‘environment’ as a third pillar to its vision for Olympic games.Beyer S. (2006). The green Olympic Movement: Beijing 2008. Chinese Journal of International Law, 5:2, 423-440. The IOC requires cities bidding to host the Olympics to provide a comprehensive strategy to protect the environment in preparation for hosting, and following the conclusion of the Games.IOC. (2009). Host City Contract. Retrieved 23 October 2016 from: http://www.gamesmonitor.org.uk/files/Host%20City%20Contract.pdf This initiative was most notably acted upon in 2000, when the “Green Olympics” effort was developed by the Beijing Organizing Committee for the Beijing Olympic Games. The Beijing 2008 Summer Olympics effort to host environmentally friendly games resulted in over 160 projects meeting the goal of “green” games through improved air quality and water quality, implementation of sustainable energy sources, improved waste management, and environmental education. These projects included industrial plant relocation or closure, furnace replacement, introduction of new emission standards, and more strict traffic control.Chen Y, Jin GZ, Kumar N, Shi G. (2012). The Promise of Beijing: Evaluating the Impact of the 2008 Olympic Games on Air Quality. Journal of Environmental Economics and Management, 66, 424-433.  Most of these measures were adopted on a temporary basis, and although real improvements were realized (particularly in air quality), most of these improvements had disappeared one year following the Games.  Although these improvements were short lived, IOC’s inclusion of environmental policies in evaluating and selecting host cities demonstrates a corporate responsibility that may be built upon in years to come. Detailed frameworks for environmental sustainability have been released for the 2018 Winter Olympics, and 2020 Summer Olympics in PyeongChang, South Korea, and Tokyo, Japan, respectively.The PyeongChang Organizing Committee for the 2018 Olympic and Paralympic Winter Games. Creating a New Horizon for Sustainable 2018 PyeongChang Olympic and Paralympic Winter Games: Furthering Benefits to Human and Nature. Retrieved 23 October 2016 from: The Tokyo Organizing Committee of the Olympic and Paralympic Games. Tokyo 2020 Olympic and Paralympic Games High-level Sustainability Plan. Retrieved 23 October 2016 from: https://tokyo2020.jp/en/games/sustainability/data/sus-plan-EN.pdf\n\nInternational Olympic Committee approaches\n\nThe IOC has 4 major approaches to addressing environmental health concerns during the construction and competitions of the Olympic Games. First, the IOC Sustainability and Legacy Commission focuses on how the IOC can improve the strategies and policies associated with environmental health throughout the process of cities hosting the Olympic Games.https://www.olympic.org/sustainability-and-legacy-commission Secondly, every candidate city must provide information to the IOC on environmental health issues like air quality and environmental impact assessments. Thirdly, every host city is given the option to declare “pledges” to address specific or general environmental health concerns of hosting the Olympic Game. Fourthly, the IOC has every host city collaborate with the United Nations to work towards addressing environmental health objectives.http://www.fas.org/sgp/crs/row/R44575.pdf Ultimately, the IOC uses these four major approaches in an attempt to minimize the negative environmental health concerns of a host city.\n\nVenue construction effects on air\n\nCities hosting the Olympic Games have two primary concerns: traffic congestion and air pollution, both of which can result in compromised air quality during and after Olympic venue construction.Qiao Q, Zhang C, Huang B, Piper JDA. (2011). Evaluating the environmental quality impact of the 2008 Beijing Olympic Games: magnetic monitoring of street dust in Beijing Olympic Park. Geophysical Journal International, Vol. 187; 1222.  Research at the Beijing Olympic Games identified particulate matter - measured in terms of PM10 (the amount of aerodynamic diameter of particle≤10 μm in a given amount of air) - as a top priority that should be taken into consideration.Chena DS,  Chenga SY,  Liub L,  Chenc T, Guoa XR. (2007). An integrated MM5–CMAQ modeling approach for assessing transboundary PM10 contribution to the host city of 2008 Olympic summer games—Beijing, China. Atmospheric environment. Vol. 41; 1237-1250.Wang X et. al. (2009).  Evaluating the air quality impacts of the 2008 Beijing Olympic Games: On-road emission factors and black carbon profiles. Atmospheric environment. Vol. 43; 4535-4543. The particulate matter in the air, along with other airborne pollutants, cause both serious health problems, such as asthma, and contribute to the deterioration of urban ecosystems. Black Carbon is released into the air from incomplete combustion of carbonaceous fluids contributing to global climate change and human health effects. The black carbon concentrations are highly impacted by the truck traffic due to the traffic congestion during the massive construction. Additionally, secondary pollutants like CO, NOx, SO2, benzene, toluene, ethylbenzene, and xylenes (BTEX) are also released during the venue construction, resulting in harmful effects to the environment.Wang T et. al. (2010). Air quality during the 2008 Beijing Olympics: secondary pollutants and regional impact. Atmos. Chem. Phys. Vol. 10; 7603–7615.\n\nMethods to measure particulates in the air\n\nEnvironmental magnetic methods have been established as a successful way of measuring the degree of pollution in air, water and soil. Environmental magnetism is sensitive to particle size, and has proven effective even at low detection levels. For these reasons, it is becoming more widely used.\n\nMeasures undertaken to improve the air quality\n\nVarious air quality measures are undertaken before and after the Olympics Games. Research studies demonstrate that the primary method to reduce concentrations of air pollutants is traffic control, including barring heavy vehicles from the roads. For the Beijing Olympics, vehicles not meeting the Euro 1 emission standards were also banned from the roads, and the odd-even rule was implemented in the Beijing administrative area. Additional air quality improvement measures include replacing coal with natural gas, suspending construction and/or imposing strict dust control on construction sites, closing or relocating the polluting industrial plants, building long subway lines, using cleaner fluid in power plants, and reducing the activity by some of the polluting factories. These were several air quality improvement measures implemented by the Beijing government. There, levels of primary and secondary pollutants were reduced, and good air quality was recorded during the Beijing Olympics on most of the days.\n\nVenue construction effects on soil\n\nSoil contamination can occur during the process of constructing the Olympic venues. In the case of the 2006 Winter Olympic Games in Torino, Italy, negative environmental impacts were observed, including impacts on soil. Before the Games, researchers studied four areas which the Games would likely affect: a floodplain, a highway, the motorway connecting the city to Lyon, France, and a landfill. They performed an extensive analysis in the types of chemicals found in the soils in these areas both before and after the Games. Their findings revealed an increase in the number of metals in the topsoils post-Games, and indicated that soil was capable, as part of an ecosystem, of negating, or “buffering,” the effects of many heavy metals. However, their findings also revealed that this was not the case for all metals, and that mercury, lead, and arsenic may have been transferred into the food chain on a massive scale.\nOne of the promises made to Londoners when they won the right to host the 2012 Olympic Games was that the Olympic Park would be a “blueprint for sustainable living.” However, residents of the allotments of Manor Road were relocated, due to the building of the Olympic stadium, and would later disagree that the Olympics had had any positive effect on their lives. Allotments, originally, were intended to provide low-income residents with a plot of land on which to grow their own food, thus receiving the dual health benefits of a supply of fresh food and outdoor work. Many of these sites were lost as a result of the Olympic venue construction, most notably the Manor Road site. Residents were promised that the allotments would be returned, and they eventually were. However, the soil quality would never be the same. Crops tended by allotment residents were the result of years of careful cultivation, and thus, those years of care and attention were destroyed by a bulldozer. Further, allotment residents were exposed to radioactive waste for five months prior to moving, during the excavation of the site for the Games. Other local residents, construction workers, and onsite archeologists faced similar exposures and risks.Sadd D. (2012). Not all Olympic ‘events’ are good for the health just ask the previous occupants of the Manor Road. Allotments Perspectives in Public Health. Vol. 132; 2, 62-63.[SIC]\nIn contrast, the Sydney Olympic Games of 2000 provided an opportunity to improve a highly contaminated area known as the Homebush Bay site. A study commissioned by the New South Wales Government Olympic Coordination Authority, which was responsible for the Games’ site preparation, looked at soil contamination prior to the Games. The work assessed soils that had been previously impacted by waste and identified areas that could pose a risk to the environment. Soil metal concentrations were found to be high enough to potentially contaminate groundwater. After risk areas were identified, a remediation strategy was developed. Contaminated soil was consolidated into four containment areas within the site, which left the remaining areas available for recreational use. Also, the contained waste materials no longer posed a threat to surrounding aquifers. Sydney’s winning Olympic bid provided a catalyst to undertake the “greenest” single urban remediation ever attempted in Australia.Suh J-Y, Birch G. F., Hughes K., Matthai C. (2004) Spatial distribution and source of heavy metals in reclaimed lands of Homebush Bay: the venue of the 2000 Olympic Games, Sydney, New South Wales. Australian Journal of Earth Sciences. Vol. 51: 53-66.\n\nVenue construction effects on water\n\nThe Olympic Games can affect water quality in the surrounding region in several ways, including water runoff and the transfer of polluting substances from the air to water sources through rainfall. Harmful particulates come from both natural substances (such as plant matter crushed by higher volumes of pedestrian and vehicle traffic) and man-made substances (such as exhaust from vehicles or industry). Contaminants from these two categories lead to elevated amounts of toxins in street dust. Street dust then reaches water sources through runoff, facilitating the transfer of toxins to environments and communities that rely on these water sources. For example, one method of measuring the runoff contamination of water sources involves magnetism. Magnetism measurement systems allow specialists to measure the differences in mineral magnetic parameters in samples of water, air, and vegetation. Unlike traditional methods of measuring pollutants, magnetism is relatively inexpensive, and can identify smaller particle sizes.Qiao, 1223.\nAnother method used to assess the amount and effects of water pollutants is to measure the amount of PM2.5 in rainfall. Measuring PM2.5 (the amount of aerodynamic diameter of particle≤2.5 μm in a given amount of air) is a common metric for assessing air quality. Comparing PM2.5 levels between air and rainfall samples allows scientists to determine the amount of air pollution being transferred to water sources. Pollutants in rainfall quickly and directly affect pollution in groundwater sources.Ouyang W et. al. The washing effect of precipitation on particulate matter and the pollution dynamics of rainwater in downtown Beijing. Science of the Total Environment. Vol. 505; 306-314. 1 February 2015. In 2013, researchers in Beijing found a significant relationship between the amount of PM2.5 concentrations in the air and in rainfall. Studies showed that rainfall had a significant “washing” effect on PM2.5 in the air, transferring a large portion of these pollutants from the air to water sources.Ouyang W. 313. In this way, Beijing’s notorious air pollution has a direct and significant impact on rainfall, and therefore, on water resources throughout the region.\n\nControversies\n\nAmateurism and professionalism\n\nPierre de Coubertin, founder of the IOC, was influenced by the ethos of the aristocracy as exemplified in the English public schools. The public schools subscribed to the belief that sport formed an important part of education and there was a prevailing concept of fairness in which practicing or training was considered cheating. As class structure evolved through the 20th century, the definition of the amateur athlete as an aristocratic gentleman became outdated. The advent of the state-sponsored \"full-time amateur athlete\" of the Eastern Bloc countries further eroded the ideology of the pure amateur, as it put the self-financed amateurs of the Western countries at a disadvantage. The Soviet Union entered teams of athletes who were all nominally students, soldiers, or working in a profession, but many of whom were in reality paid by the state to train on a full-time basis. Nevertheless, the IOC held to the traditional rules regarding amateurism.\n\nNear the end of the 1960s, the Canadian Amateur Hockey Association (CAHA) felt their amateur players could no longer be competitive against the Soviet team's full-time athletes and the other constantly improving European teams. They pushed for the ability to use players from professional leagues but met opposition from the IIHF and IOC. Avery Brundage, president of the IOC from 1952 to 1972, was opposed to the idea of amateur and professional players competing together. At the IIHF Congress in 1969, the IIHF decided to allow Canada to use nine non-NHL professional hockey players, [http://www.iihf.com/iihf-home/the-iihf/100-year-anniversary/100-top-stories/story-17.html Story #17–Protesting amateur rules, Canada leaves international hockey]. at the 1970 World Championships in Montreal and Winnipeg, Manitoba, Canada., [http://www.iihf.com/iihf-home/the-iihf/100-year-anniversary/100-top-stories/story-40.html Story #40–Finally, Canada to host the World Championship]. The decision was reversed in January 1970 after Brundage said that ice hockey's status as an Olympic sport would be in jeopardy if the change was made. In response, Canada withdrew from international ice hockey competition and officials stated that they would not return until \"open competition\" was instituted.\n\nBeginning in the 1970s, amateurism requirements were gradually phased out of the Olympic Charter. After the 1988 Games, the IOC decided to make all professional athletes eligible for the Olympics, subject to the approval of the IFs.\n\n1976 Winter Olympics (Denver, Colorado)\n\nThe cities of Denver, Colorado, United States; Sion, Switzerland; Tampere, Finland; and Vancouver (with the Garibaldi mountains), Canada, made bids for the Games.\n\nThe games were originally awarded to Denver on 12 May 1970, but a 300% rise in costs and worries about environmental impact led to Colorado voters' rejection on 7 November 1972, by a 3 to 2 margin, of a $5 million bond issue to finance the games with public funds.\n\nDenver officially withdrew on 15 November, and the IOC then offered the games to Whistler, British Columbia, Canada, but they too declined owing to a change of government following elections.  Whistler would go on to be associated with neighbouring Vancouver's successful bid for the 2010 games.\n\nSalt Lake City, Utah, a 1972 Winter Olympics final candidate who would eventually host the 2002 Winter Olympics, offered itself as a potential host after the withdrawal of Denver. The IOC, still reeling from the Denver rejection, declined and selected Innsbruck to host the 1976 Winter Olympics, which had hosted the 1964 Winter Olympics games twelve years earlier, on 5 February 1973.\n\nSalt Lake bid scandal\n\nA scandal broke on 10 December 1998, when Swiss IOC member Marc Hodler, head of the coordination committee overseeing the organisation of the 2002 games, announced that several members of the IOC had taken bribes. Soon four independent investigations were underway: by the IOC, the United States Olympic Committee (USOC), the SLOC, and the United States Department of Justice.\n\nBefore any of the investigations could even get under way, both Welch and Johnson resigned their posts as the head of the SLOC. Many others soon followed. The Department of Justice filed charges against the two: fifteen charges of bribery and fraud. Johnson and Welch were eventually acquitted of all criminal charges in December 2003.\n\nAs a result of the investigation, ten members of the IOC were expelled and another ten were sanctioned. This was the first expulsion or sanction for corruption in the more than a century the IOC had existed. Although nothing strictly illegal had been done, it was felt that the acceptance of the gifts was morally dubious. Stricter rules were adopted for future bids, and caps were put into place as to how much IOC members could accept from bid cities. Additionally, new term and age limits were put into place for IOC membership, and fifteen former Olympic athletes were added to the committee.\n\nOther controversies: 2006–2013\n\nIn 2006, a report ordered by the Nagano region's governor said the Japanese city provided millions of dollars in an \"illegitimate and excessive level of hospitality\" to IOC members, including $4.4 million spent on entertainment alone. Earlier reports put the figure at approximately $14 million. The precise figures are unknown since Nagano, after the IOC asked that the entertainment expenditures not be made public, destroyed the financial records.\n\nInternational groups attempted to pressure the IOC to reject Beijing's bid in protest of the state of human rights in the People's Republic of China. One Chinese dissident who expressed similar sentiments was arrested and sentenced to two years in prison for calling on the IOC to do just that at the same time that IOC inspectors were touring the city. Amnesty International expressed concern in 2006 regarding the Olympic Games to be held in China in 2008, likewise expressing concerns over the human rights situation. The second principle in the Fundamental Principles of Olympism, Olympic Charter states that The goal of Olympism is to place sport at the service of the harmonious development of man, with a view to promoting a peaceful society concerned with the preservation of human dignity.[http://multimedia.olympic.org/pdf/en_report_122.pdf \"Olympic Charter, in force as from 1 September 2004\", International Olympic Committee]  Amnesty International considers the policies and practices of the People's Republic as failing to meet that principle, and urged the IOC to press China to immediately enact human rights reform.[http://web.amnesty.org/library/index/engASA170462006?open&of=eng-CHN \"People’s Republic of China: The Olympics countdown – failing to keep human rights promises\" Amnesty International, 21 September 2006] \n\nIn August 2008, the IOC issued DMCA take down notices on Tibetan Protest videos of the Beijing Olympics hosted on YouTube.IOC backs off DMCA take-down for Tibet protest  YouTube and the Electronic Frontier Foundation (EFF) both pushed back against the IOC, which then withdrew their complaint.\n\nIn 2010, the International Olympic Committee was nominated for the Public Eye Awards. This award seeks to present \"shame-on-you-awards to the nastiest corporate players of the year\".\n\nBefore the start of the 2012 Olympic Games, the IOC decided not to hold a minute of silence to honor the 11 Israeli Olympians who were killed 40 years prior in the Munich Massacre. Jacques Rogge, the then-IOC President, said it would be \"inappropriate\" to do so. Speaking of the decision, Israeli Olympian Shaul Ladany, who had survived the Munich Massacre, commented: \"I do not understand. I do not understand, and I do not accept it\".\n\nIn February 2013, the IOC did not include wrestling as one of its core Olympic sports for the Summer Olympic program for the 2020 Olympics. This decision was poorly received by the sporting and wrestling community. Wrestling was still part of the program at the 2016 Summer Olympics in Rio de Janeiro. This decision was later overturned, and wrestling will be a part of the 2020 Olympic Games in Tokyo.\n\nAs planned, the alpine ski run and luge racing area of 2022 Beijing Olympic Winter Games will be built in the core area of Beijing Songshan National Reserves. A great number of valuable species such as Lonicera oblata and Cypripedium shanxiense S. C. Chen are found here and many of them can not be conserved through ex situ conservation. Many Chinese professionals of biology and environmentalists deemed that if the Olympic venues are developed in such area, the rare species and integrated ecological environment will be catastrophically collapsed. Chinese government intended to remove such area out from the range of the natural reserves and chose some other area with few rare species as the reserves. Besides, the comments regarding the strict compliance with laws and protection of Songshan National Reserves are widely deleted or restricted in China. All these actions have been criticized by some media and the professionals of biology in China.\n\nRussian doping scandal\n\nMedia attention began growing in December 2014 when German broadcaster ARD reported on state-sponsored doping in Russia, comparing it to doping in East Germany. In November 2015, the World Anti-Doping Agency (WADA) published a report and the International Association of Athletics Federations (IAAF) suspended Russia indefinitely from world track and field events. The United Kingdom Anti-Doping agency later assisted WADA with testing in Russia. In June 2016, they reported that they were unable to fully carry out their work and noted intimidation by armed Federal Security Service (FSB) agents.\nAfter a Russian former lab director made allegations about the 2014 Winter Olympics in Sochi, WADA commissioned an independent investigation led by Richard McLaren. McLaren's investigation found corroborating evidence, concluding in a report published in July 2016 that the Ministry of Sport and the FSB had operated a \"state-directed failsafe system\" using a \"disappearing positive [test] methodology\" (DPM) from \"at least late 2011 to August 2015\".\n\nIn response to these findings, WADA announced that RUSADA should be regarded as non-compliant with respect to the World Anti-Doping Code and recommended that Russia be banned from competing at the 2016 Summer Olympics. The International Olympic Commission (IOC) rejected the recommendation, stating that the IOC and each sport's international federation would make decisions on each athlete's individual basis. One day prior to the opening ceremony, 270 athletes were cleared to compete under the Russian flag, while 167 were removed because of doping. In contrast, the entire Kuwaiti team was banned from competing under their own flag (for a non-doping related matter).\n\nThe IOC's decision on 24 July 2016 was criticised by athletes and writers. It received support from the European Olympic Committees, which said that Russia is \"a valued member\". Cam Cole of Canada's National Post said that the IOC had \"caved, as it always does, defaulting to whatever compromise it could safely adopt without offending a superpower.\" Expressing disappointment, a member of the IOC Athletes' Commission, Hayley Wickenheiser, wrote, \"I ask myself if we were not dealing with Russia would this decision to ban a nation [have] been an easier one? I fear the answer is yes.\" Writing for Deutsche Welle in Germany, Olivia Gerstenberger said that Bach had \"flunked\" his first serious test, adding, \"With this decision, the credibility of the organization is shattered once more, while that of state-sponsored doping actually receives a minor boost.\" Bild (Germany) described Bach as \"Putin's poodle\". Paul Hayward, chief sports writer of The Daily Telegraph (UK), remarked, \"The white flag of capitulation flies over the International Olympic Committee. Russia's deep political reach should have told us this would happen.\n\nLeaders of thirteen national anti-doping organisations wrote that the IOC had \"violated the athletes' fundamental rights to participate in Games that meet the stringent requirements of the World Anti-Doping Code\" and \"[demonstrated that] it lacks the independence required to keep commercial and political interests from influencing the tough decisions necessary to protect clean sport.\" WADA's former chief investigation, Jack Robertson, said \"The anti-doping code is now just suggestions to follow or not\" and that \"WADA handed the IOC that excuse [not enough time before the Olympics] by sitting on the allegations for close to a year.\" McLaren was dissatisfied with the IOC's handling of his report, saying \"It was about state-sponsored doping and the mis-recording of doping results and they turned the focus into individual athletes and whether they should compete. [...] it was a complete turning upside down of what was in the report and passing over responsibility to all the different international federations.\"\n\nIn contrast to the IOC, the International Paralympic Committee voted unanimously to ban the entire Russian team from the 2016 Summer Paralympics, having found evidence that the DPM was also in operation at the 2014 Winter Paralympics.\n\nOn 5 December 2017, the IOC announced that the Russian Olympic Committee had been suspended effective immediately from the 2018 Winter Olympics. Athletes who had no previous drug violations and a consistent history of drug testing were to be allowed to compete under the Olympic Flag as an \"Olympic Athlete from Russia\" (OAR). Under the terms of the decree, Russian government officials were barred from the Games, and neither the country's flag nor anthem would be present. The Olympic Flag and Olympic Anthem will be used instead, and on 20 December 2017 the IOC proposed an alternate logo for the uniforms (seen at right). IOC President Thomas Bach said that \"after following due process [the IOC] has issued proportional sanctions for this systematic manipulation while protecting the clean athletes.\"\n\nOn 1 February 2018, the Court of Arbitration for Sport partially overturned IOC's doping suspensions. For 28 of 42 suspended athletes, their appeals were upheld, the sanctions annulled and their individual results achieved in Sochi 2014 were reinstated.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "International Olympic Committee" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15147" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The International Olympic Committee (IOC; French: Comité International Olympique, CIO) is international, non-governmental, non-profit organisation based in Lausanne, Switzerland which is the supreme authority of the worldwide Olympic movement.Roger Bartlett, Chris Gratton, Christer G. Rolf Encyclopedia of International Sports Studies. Routledge, 2012, p. 678 It redistributes more than 90 percent of its income to the wider sporting movement, which means that every day the equivalent of US$ 3.4 million goes to help athletes and sports organisations at all levels around the world. Its mission is enshrined in the Olympic Charter: to support the development of competitive sport by ethical and environmentally sustainable means.\n\nHistory\n\nThe IOC was created by Pierre de Coubertin, on 23 June 1894 with Demetrios Vikelas as its first president. As of June 2017, its membership consists of 95 active members, 41 honorary members, an honorary president (Jacques Rogge) and one honour member (Henry Kissinger). The IOC is the supreme authority of the worldwide modern Olympic movement.\n\nThe IOC organises the modern Olympic Games and Youth Olympic Games, held in summer and winter, every four years. The first Summer Olympics organised by the IOC was held in Athens, Greece, in 1896; the first Winter Olympics was in Chamonix, France, in 1924. Until 1992, both Summer and Winter Olympics were held in the same year. After that year, however, the IOC shifted the Winter Olympics to the even years between Summer Games, to help space the planning of the two events from one another, and improve the financial balance of the IOC, which receives greater income on Olympic years. The first Summer Youth Olympics were in Singapore in 2010 and the first Winter Youth Olympics were held in Innsbruck in 2012.\n\nIn 2009, the UN General Assembly granted the IOC Permanent Observer status. This decision enables the IOC to be directly involved in the UN Agenda and to attend UN General Assembly meetings where it can take the floor. This has provided the possibility to promote sport at a new level. In addition, in 1993, the UN General Assembly approved a Resolution that further solidified IOC–UN cooperation with the decision to revive the Olympic Truce, by adopting a Resolution entitled “Building a peaceful and better world through sport and the Olympic ideal,” which calls upon Member States to observe the Olympic Truce before every iteration of the games, and to cooperate with the IOC and the International Paralympic Committee in their efforts to use sport as a tool to promote peace, dialogue and reconciliation in areas of conflict during and beyond the period of the Olympic and Paralympic Games.\n\nDuring each proclamation at the Olympics, announcers speak in different languages, French is always spoken first followed by an English translation and the dominant language of the host nation.\n\nMission and roles\n\nThe stated mission of the International Olympic Committee (IOC) is to promote Olympic throughout the world and to lead the Olympic Movement.\n\n* To encourage and support the organisation, development and coordination of sport and sports competitions;\n* To ensure the regular celebration of the Olympic Games;\n* To cooperate with the competent public or private organisations and authorities in the endeavour to place sport at the service of humanity and thereby to promote peace;\n* To act against any form of discrimination affecting the Olympic Movement;\n* To encourage and support the promotion of women in sport at all levels and in all structures with a view to implementing the principle of equality of men and women;\n\nIOC Executive Board\n\nIOC Commissions\n\n(*) Interim Chairperson\n\nOrganization\n\nIOC Session\n\nThe IOC Session is the general meeting of the members of the IOC, held once a year in which each member has one vote. It is the IOC’s supreme organ and its decisions are final.\n\nExtraordinary Sessions may be convened by the President or upon the written request of at least one third of the members.\n\nAmong others, the powers of the Session are:\n* To adopt or amend the Olympic Charter.\n* To elect the members of the IOC, the Honorary President and the honorary members.\n* To elect the President, the Vice-Presidents and all other members of the IOC Executive Board.\n* To elect the host city of the Olympic Games.\n\nHonours\n\nIn addition to the Olympic medals for competitors, the IOC awards a number of other honours:\n* the IOC President's Trophy is the highest sports award given to athletes who have excelled in their sport and had an extraordinary career and created a lasting impact on their sport.\n* the Pierre de Coubertin medal is awarded to athletes who demonstrate a special spirit of sportsmanship in Olympic events\n* the Olympic Cup is awarded to institutions or associations with a record of merit and integrity in actively developing the Olympic Movement\n* the Olympic Order is awarded to individuals for particularly distinguished contributions to the Olympic Movement, and superseded the Olympic Certificate.\n* the Olympic Laurel is awarded to individuals for promoting education, culture, development, and peace through sport.\n\nIOC members\n\nFor most of its existence, the IOC was controlled by members who were selected by other members. Countries that had hosted the Games were allowed two members. When named, they did not become the representatives of their respective countries to the IOC, but rather the opposite, IOC members in their respective countries.\n\nCessation of membership\n\nThe membership of IOC members ceases in the following circumstances:Source: Olympic Charter, in force as from 1 September 2004.\n\n# Resignation: any IOC member may cease their membership at any time by delivering a written resignation to the President.\n# Non re-election: any IOC member ceases to be a member without further formality if they are not re-elected.\n# Age limit: any IOC member ceases to be a member at the end of the calendar year during which they reach the age of 80.\n# Failure to attend Sessions or take active part in IOC work for two consecutive years.\n# Transfer of domicile or of main center of interests to a country other than the country which was theirs at the time of their election.\n# Members elected as active athletes cease to be a member upon ceasing to be a member of the IOC Athletes' Commission.\n# Presidents and individuals holding an executive or senior leadership position within NOCs, world or continental associations of NOCs, IFs or associations of IFs, or other organisations recognised by the IOC cease to be a member upon ceasing to exercise the function they were exercising at the time of their election.\n# Expulsion: an IOC member may be expelled by decision of the Session if such member has betrayed their oath or if the Session considers that such member has neglected or knowingly jeopardised the interests of the IOC or acted in a way which is unworthy of the IOC.\n\nInternational federations recognised by IOC\n\nThere are currently 73 sport federations recognised by IOC. These are:\n* The 29 members of Association of Summer Olympic International Federations (ASOIF)\n* The 7 members of Association of International Olympic Winter Sports Federations (AIOWF)\n* The 35 members of Association of IOC Recognised International Sports Federations (ARISF)\n* And 2 of the members of SportAccord (Fédération Internationale de l'Automobile and International Softball Federation)International Softball Federation\n\nOlympic marketing\n\nDuring the first half of the 20th century the IOC ran on a small budget.\n\n As president of the IOC from 1952 to 1972, Avery Brundage rejected all attempts to link the Olympics with commercial interest. Brundage believed the lobby of corporate interests would unduly impact the IOC's decision-making. Brundage's resistance to this revenue stream meant the IOC left organising committees to negotiate their own sponsorship contracts and use the Olympic symbols. When Brundage retired the IOC had US$2 million in assets; eight years later the IOC coffers had swelled to US$45 million. This was primarily due to a shift in ideology toward expansion of the Games through corporate sponsorship and the sale of television rights. When Juan Antonio Samaranch was elected IOC president in 1980 his desire was to make the IOC financially independent. Samaranch appointed Canadian IOC member Richard Pound to lead the initiative as Chairman of the \"New Sources of Finance Commission\".\n\nIn 1982 the IOC drafted ISL Marketing a Swiss sports marketing company, to develop a global marketing programme for the Olympic Movement. ISL successfully developed the programme but was replaced by Meridian Management, a company partly owned by the IOC in the early 1990s.\n\nIn 1989, one of the staff members at ISL Marketing, Michael Payne, moved to the IOC and became the organisation's first marketing director. However ISL and subsequently Meridian, continued in the established role as the IOC's sales and marketing agents until 2002. In 2002 the IOC terminated the relationship with Meridian and took its marketing programme in-house under the Direction of Timo Lumme, the IOC's managing director of IOC Television and Marketing Services. During his 17 years with the IOC, in collaboration with ISL Marketing and subsequently Meridian Management, Payne made major contributions to the creation of a multibillion-dollar sponsorship marketing programme for the organisation which, along with improvements in TV marketing and improved financial management, helped to restore the IOC's financial viability.\n\nRevenue\n\nThe Olympic Movement generates revenue through five major programmes. The International Olympic Committee (IOC) manages broadcast partnerships and The Olympic Partner (TOP) worldwide sponsorship programme. The Organising Committees for the Olympic Games (OCOGs) manage domestic sponsorship, ticketing and licensing programmes within the host country under the direction of the IOC. The Olympic Movement generated a total of more than US$4 billion, €2.5 billion in revenue during the Olympic quadrennium from 2001 to 2004.\n\nRevenue distribution\n\nThe IOC distributes some of Olympic marketing revenue to organisations throughout the Olympic Movement to support the staging of the Olympic Games and to promote the worldwide development of sport. The IOC retains approximately 10% of Olympic marketing revenue for the operational and administrative costs of governing the Olympic Movement.IOC: [http://www.olympic.org/ioc-financing-revenue-sources-distribution?tab=distribution Revenue Sources and Distribution]\n\nOrganising Committees for the Olympic Games (OCOGs)\n\nThe IOC provides The Olympic Partner (TOP) programme contributions and Olympic broadcast revenue to the OCOGs to support the staging of the Olympic Games and Olympic Winter Games:\n* TOP programme revenue to OCOGs; the two OCOGs of each Olympic quadrennium generally share approximately 50% of TOP programme revenue and value-in-kind contributions, with approximately 30% provided to the summer OCOG and 20% provided to the winter OCOG.\n* Broadcast revenue to OCOGs; the IOC contributes 49% of the Olympic broadcast revenue for each Games to the OCOG. During the 2001–2004 Olympic quadrennium, the Salt Lake 2002 Organizing Committee received US$443 million, €395 million in broadcast revenue from the IOC, and the Athens 2004 Organizing Committee received US$732 million, €690 million.\n* Domestic programme revenue to OCOGs; the OCOGs generate substantial revenue from the domestic marketing programmes that they manage within the host country, including domestic sponsorship, ticketing and licensing.\n\nNational Olympic Committees (NOCs)\n\nThe NOCs receive financial support for the training and development of Olympic teams, Olympic athletes and Olympic hopefuls. The IOC distributes TOP programme revenue to each of the NOCs throughout the world. The IOC also contributes Olympic broadcast revenue to Olympic Solidarity, an IOC organisation that provides financial support to NOCs with the greatest need.\n\nThe continued success of the TOP programme and Olympic broadcast agreements has enabled the IOC to provide increased support for the NOCs with each Olympic quadrennium. The IOC provided approximately US$318.5 million to NOCs for the 2001–2004 quadrennium.\n\nInternational Olympic Sports Federations (IFs)\n\nThe IOC is now the largest single revenue source for the majority of IFs, with its contributions of Olympic broadcast revenue that assist the IFs in the development of their respective sports worldwide. The IOC provides financial support from Olympic broadcast revenue to the 28 IFs of Olympic summer sports and the seven IFs of Olympic winter sports after the completion of the Olympic Games and the Olympic Winter Games, respectively.\n\nThe continually increasing value of Olympic broadcast partnership has enabled the IOC to deliver substantially increased financial support to the IFs with each successive Games. The seven winter sports IFs shared US$85.8 million, €75 million in Salt Lake 2002 broadcast revenue. The contribution to the 28 summer sports IFs from Athens 2004 broadcast revenue has not yet been determined, but the contribution is expected to mark a significant increase over the US$190 million, €150 million that the IOC provided to the summer IFs following Sydney 2000.\n\nOther organisations\n\nThe IOC contributes Olympic marketing revenue to the programmes of various recognised international sports organisations, including the International Paralympic Committee, and the World Anti-Doping Agency (WADA).\n\nEnvironmental concerns\n\nThe International Olympic Committee (IOC) recognizes that the Olympic Games demand tremendous environmental resources, activities, and construction projects that could be detrimental to a host city’s environment. In 1995, IOC President Juan Antonio Samaranch stated, “the International Olympic Committee is resolved to ensure that the environment becomes the third dimension of the organization of the Olympic Games, the first and second being sport and culture.”Jagemann H. (2003). Sport and the Environment: Ways toward Achieving the Sustainable Development of Sport. Retrieved 23 October 2016 from: http://thesportjournal.org/article/sports-and-the-environment-ways-towards-achieving-the-sustainable-development-of-sport/ Acting on this statement, in 1996 the IOC added the ‘environment’ as a third pillar to its vision for Olympic games.Beyer S. (2006). The green Olympic Movement: Beijing 2008. Chinese Journal of International Law, 5:2, 423-440. The IOC requires cities bidding to host the Olympics to provide a comprehensive strategy to protect the environment in preparation for hosting, and following the conclusion of the Games.IOC. (2009). Host City Contract. Retrieved 23 October 2016 from: http://www.gamesmonitor.org.uk/files/Host%20City%20Contract.pdf This initiative was most notably acted upon in 2000, when the “Green Olympics” effort was developed by the Beijing Organizing Committee for the Beijing Olympic Games. The Beijing 2008 Summer Olympics effort to host environmentally friendly games resulted in over 160 projects meeting the goal of “green” games through improved air quality and water quality, implementation of sustainable energy sources, improved waste management, and environmental education. These projects included industrial plant relocation or closure, furnace replacement, introduction of new emission standards, and more strict traffic control.Chen Y, Jin GZ, Kumar N, Shi G. (2012). The Promise of Beijing: Evaluating the Impact of the 2008 Olympic Games on Air Quality. Journal of Environmental Economics and Management, 66, 424-433.  Most of these measures were adopted on a temporary basis, and although real improvements were realized (particularly in air quality), most of these improvements had disappeared one year following the Games.  Although these improvements were short lived, IOC’s inclusion of environmental policies in evaluating and selecting host cities demonstrates a corporate responsibility that may be built upon in years to come. Detailed frameworks for environmental sustainability have been released for the 2018 Winter Olympics, and 2020 Summer Olympics in PyeongChang, South Korea, and Tokyo, Japan, respectively.The PyeongChang Organizing Committee for the 2018 Olympic and Paralympic Winter Games. Creating a New Horizon for Sustainable 2018 PyeongChang Olympic and Paralympic Winter Games: Furthering Benefits to Human and Nature. Retrieved 23 October 2016 from: The Tokyo Organizing Committee of the Olympic and Paralympic Games. Tokyo 2020 Olympic and Paralympic Games High-level Sustainability Plan. Retrieved 23 October 2016 from: https://tokyo2020.jp/en/games/sustainability/data/sus-plan-EN.pdf\n\nInternational Olympic Committee approaches\n\nThe IOC has 4 major approaches to addressing environmental health concerns during the construction and competitions of the Olympic Games. First, the IOC Sustainability and Legacy Commission focuses on how the IOC can improve the strategies and policies associated with environmental health throughout the process of cities hosting the Olympic Games.https://www.olympic.org/sustainability-and-legacy-commission Secondly, every candidate city must provide information to the IOC on environmental health issues like air quality and environmental impact assessments. Thirdly, every host city is given the option to declare “pledges” to address specific or general environmental health concerns of hosting the Olympic Game. Fourthly, the IOC has every host city collaborate with the United Nations to work towards addressing environmental health objectives.http://www.fas.org/sgp/crs/row/R44575.pdf Ultimately, the IOC uses these four major approaches in an attempt to minimize the negative environmental health concerns of a host city.\n\nVenue construction effects on air\n\nCities hosting the Olympic Games have two primary concerns: traffic congestion and air pollution, both of which can result in compromised air quality during and after Olympic venue construction.Qiao Q, Zhang C, Huang B, Piper JDA. (2011). Evaluating the environmental quality impact of the 2008 Beijing Olympic Games: magnetic monitoring of street dust in Beijing Olympic Park. Geophysical Journal International, Vol. 187; 1222.  Research at the Beijing Olympic Games identified particulate matter - measured in terms of PM10 (the amount of aerodynamic diameter of particle≤10 μm in a given amount of air) - as a top priority that should be taken into consideration.Chena DS,  Chenga SY,  Liub L,  Chenc T, Guoa XR. (2007). An integrated MM5–CMAQ modeling approach for assessing transboundary PM10 contribution to the host city of 2008 Olympic summer games—Beijing, China. Atmospheric environment. Vol. 41; 1237-1250.Wang X et. al. (2009).  Evaluating the air quality impacts of the 2008 Beijing Olympic Games: On-road emission factors and black carbon profiles. Atmospheric environment. Vol. 43; 4535-4543. The particulate matter in the air, along with other airborne pollutants, cause both serious health problems, such as asthma, and contribute to the deterioration of urban ecosystems. Black Carbon is released into the air from incomplete combustion of carbonaceous fluids contributing to global climate change and human health effects. The black carbon concentrations are highly impacted by the truck traffic due to the traffic congestion during the massive construction. Additionally, secondary pollutants like CO, NOx, SO2, benzene, toluene, ethylbenzene, and xylenes (BTEX) are also released during the venue construction, resulting in harmful effects to the environment.Wang T et. al. (2010). Air quality during the 2008 Beijing Olympics: secondary pollutants and regional impact. Atmos. Chem. Phys. Vol. 10; 7603–7615.\n\nMethods to measure particulates in the air\n\nEnvironmental magnetic methods have been established as a successful way of measuring the degree of pollution in air, water and soil. Environmental magnetism is sensitive to particle size, and has proven effective even at low detection levels. For these reasons, it is becoming more widely used.\n\nMeasures undertaken to improve the air quality\n\nVarious air quality measures are undertaken before and after the Olympics Games. Research studies demonstrate that the primary method to reduce concentrations of air pollutants is traffic control, including barring heavy vehicles from the roads. For the Beijing Olympics, vehicles not meeting the Euro 1 emission standards were also banned from the roads, and the odd-even rule was implemented in the Beijing administrative area. Additional air quality improvement measures include replacing coal with natural gas, suspending construction and/or imposing strict dust control on construction sites, closing or relocating the polluting industrial plants, building long subway lines, using cleaner fluid in power plants, and reducing the activity by some of the polluting factories. These were several air quality improvement measures implemented by the Beijing government. There, levels of primary and secondary pollutants were reduced, and good air quality was recorded during the Beijing Olympics on most of the days.\n\nVenue construction effects on soil\n\nSoil contamination can occur during the process of constructing the Olympic venues. In the case of the 2006 Winter Olympic Games in Torino, Italy, negative environmental impacts were observed, including impacts on soil. Before the Games, researchers studied four areas which the Games would likely affect: a floodplain, a highway, the motorway connecting the city to Lyon, France, and a landfill. They performed an extensive analysis in the types of chemicals found in the soils in these areas both before and after the Games. Their findings revealed an increase in the number of metals in the topsoils post-Games, and indicated that soil was capable, as part of an ecosystem, of negating, or “buffering,” the effects of many heavy metals. However, their findings also revealed that this was not the case for all metals, and that mercury, lead, and arsenic may have been transferred into the food chain on a massive scale.\nOne of the promises made to Londoners when they won the right to host the 2012 Olympic Games was that the Olympic Park would be a “blueprint for sustainable living.” However, residents of the allotments of Manor Road were relocated, due to the building of the Olympic stadium, and would later disagree that the Olympics had had any positive effect on their lives. Allotments, originally, were intended to provide low-income residents with a plot of land on which to grow their own food, thus receiving the dual health benefits of a supply of fresh food and outdoor work. Many of these sites were lost as a result of the Olympic venue construction, most notably the Manor Road site. Residents were promised that the allotments would be returned, and they eventually were. However, the soil quality would never be the same. Crops tended by allotment residents were the result of years of careful cultivation, and thus, those years of care and attention were destroyed by a bulldozer. Further, allotment residents were exposed to radioactive waste for five months prior to moving, during the excavation of the site for the Games. Other local residents, construction workers, and onsite archeologists faced similar exposures and risks.Sadd D. (2012). Not all Olympic ‘events’ are good for the health just ask the previous occupants of the Manor Road. Allotments Perspectives in Public Health. Vol. 132; 2, 62-63.[SIC]\nIn contrast, the Sydney Olympic Games of 2000 provided an opportunity to improve a highly contaminated area known as the Homebush Bay site. A study commissioned by the New South Wales Government Olympic Coordination Authority, which was responsible for the Games’ site preparation, looked at soil contamination prior to the Games. The work assessed soils that had been previously impacted by waste and identified areas that could pose a risk to the environment. Soil metal concentrations were found to be high enough to potentially contaminate groundwater. After risk areas were identified, a remediation strategy was developed. Contaminated soil was consolidated into four containment areas within the site, which left the remaining areas available for recreational use. Also, the contained waste materials no longer posed a threat to surrounding aquifers. Sydney’s winning Olympic bid provided a catalyst to undertake the “greenest” single urban remediation ever attempted in Australia.Suh J-Y, Birch G. F., Hughes K., Matthai C. (2004) Spatial distribution and source of heavy metals in reclaimed lands of Homebush Bay: the venue of the 2000 Olympic Games, Sydney, New South Wales. Australian Journal of Earth Sciences. Vol. 51: 53-66.\n\nVenue construction effects on water\n\nThe Olympic Games can affect water quality in the surrounding region in several ways, including water runoff and the transfer of polluting substances from the air to water sources through rainfall. Harmful particulates come from both natural substances (such as plant matter crushed by higher volumes of pedestrian and vehicle traffic) and man-made substances (such as exhaust from vehicles or industry). Contaminants from these two categories lead to elevated amounts of toxins in street dust. Street dust then reaches water sources through runoff, facilitating the transfer of toxins to environments and communities that rely on these water sources. For example, one method of measuring the runoff contamination of water sources involves magnetism. Magnetism measurement systems allow specialists to measure the differences in mineral magnetic parameters in samples of water, air, and vegetation. Unlike traditional methods of measuring pollutants, magnetism is relatively inexpensive, and can identify smaller particle sizes.Qiao, 1223.\nAnother method used to assess the amount and effects of water pollutants is to measure the amount of PM2.5 in rainfall. Measuring PM2.5 (the amount of aerodynamic diameter of particle≤2.5 μm in a given amount of air) is a common metric for assessing air quality. Comparing PM2.5 levels between air and rainfall samples allows scientists to determine the amount of air pollution being transferred to water sources. Pollutants in rainfall quickly and directly affect pollution in groundwater sources.Ouyang W et. al. The washing effect of precipitation on particulate matter and the pollution dynamics of rainwater in downtown Beijing. Science of the Total Environment. Vol. 505; 306-314. 1 February 2015. In 2013, researchers in Beijing found a significant relationship between the amount of PM2.5 concentrations in the air and in rainfall. Studies showed that rainfall had a significant “washing” effect on PM2.5 in the air, transferring a large portion of these pollutants from the air to water sources.Ouyang W. 313. In this way, Beijing’s notorious air pollution has a direct and significant impact on rainfall, and therefore, on water resources throughout the region.\n\nControversies\n\nAmateurism and professionalism\n\nPierre de Coubertin, founder of the IOC, was influenced by the ethos of the aristocracy as exemplified in the English public schools. The public schools subscribed to the belief that sport formed an important part of education and there was a prevailing concept of fairness in which practicing or training was considered cheating. As class structure evolved through the 20th century, the definition of the amateur athlete as an aristocratic gentleman became outdated. The advent of the state-sponsored \"full-time amateur athlete\" of the Eastern Bloc countries further eroded the ideology of the pure amateur, as it put the self-financed amateurs of the Western countries at a disadvantage. The Soviet Union entered teams of athletes who were all nominally students, soldiers, or working in a profession, but many of whom were in reality paid by the state to train on a full-time basis. Nevertheless, the IOC held to the traditional rules regarding amateurism.\n\nNear the end of the 1960s, the Canadian Amateur Hockey Association (CAHA) felt their amateur players could no longer be competitive against the Soviet team's full-time athletes and the other constantly improving European teams. They pushed for the ability to use players from professional leagues but met opposition from the IIHF and IOC. Avery Brundage, president of the IOC from 1952 to 1972, was opposed to the idea of amateur and professional players competing together. At the IIHF Congress in 1969, the IIHF decided to allow Canada to use nine non-NHL professional hockey players, [http://www.iihf.com/iihf-home/the-iihf/100-year-anniversary/100-top-stories/story-17.html Story #17–Protesting amateur rules, Canada leaves international hockey]. at the 1970 World Championships in Montreal and Winnipeg, Manitoba, Canada., [http://www.iihf.com/iihf-home/the-iihf/100-year-anniversary/100-top-stories/story-40.html Story #40–Finally, Canada to host the World Championship]. The decision was reversed in January 1970 after Brundage said that ice hockey's status as an Olympic sport would be in jeopardy if the change was made. In response, Canada withdrew from international ice hockey competition and officials stated that they would not return until \"open competition\" was instituted.\n\nBeginning in the 1970s, amateurism requirements were gradually phased out of the Olympic Charter. After the 1988 Games, the IOC decided to make all professional athletes eligible for the Olympics, subject to the approval of the IFs.\n\n1976 Winter Olympics (Denver, Colorado)\n\nThe cities of Denver, Colorado, United States; Sion, Switzerland; Tampere, Finland; and Vancouver (with the Garibaldi mountains), Canada, made bids for the Games.\n\nThe games were originally awarded to Denver on 12 May 1970, but a 300% rise in costs and worries about environmental impact led to Colorado voters' rejection on 7 November 1972, by a 3 to 2 margin, of a $5 million bond issue to finance the games with public funds.\n\nDenver officially withdrew on 15 November, and the IOC then offered the games to Whistler, British Columbia, Canada, but they too declined owing to a change of government following elections.  Whistler would go on to be associated with neighbouring Vancouver's successful bid for the 2010 games.\n\nSalt Lake City, Utah, a 1972 Winter Olympics final candidate who would eventually host the 2002 Winter Olympics, offered itself as a potential host after the withdrawal of Denver. The IOC, still reeling from the Denver rejection, declined and selected Innsbruck to host the 1976 Winter Olympics, which had hosted the 1964 Winter Olympics games twelve years earlier, on 5 February 1973.\n\nSalt Lake bid scandal\n\nA scandal broke on 10 December 1998, when Swiss IOC member Marc Hodler, head of the coordination committee overseeing the organisation of the 2002 games, announced that several members of the IOC had taken bribes. Soon four independent investigations were underway: by the IOC, the United States Olympic Committee (USOC), the SLOC, and the United States Department of Justice.\n\nBefore any of the investigations could even get under way, both Welch and Johnson resigned their posts as the head of the SLOC. Many others soon followed. The Department of Justice filed charges against the two: fifteen charges of bribery and fraud. Johnson and Welch were eventually acquitted of all criminal charges in December 2003.\n\nAs a result of the investigation, ten members of the IOC were expelled and another ten were sanctioned. This was the first expulsion or sanction for corruption in the more than a century the IOC had existed. Although nothing strictly illegal had been done, it was felt that the acceptance of the gifts was morally dubious. Stricter rules were adopted for future bids, and caps were put into place as to how much IOC members could accept from bid cities. Additionally, new term and age limits were put into place for IOC membership, and fifteen former Olympic athletes were added to the committee.\n\nOther controversies: 2006–2013\n\nIn 2006, a report ordered by the Nagano region's governor said the Japanese city provided millions of dollars in an \"illegitimate and excessive level of hospitality\" to IOC members, including $4.4 million spent on entertainment alone. Earlier reports put the figure at approximately $14 million. The precise figures are unknown since Nagano, after the IOC asked that the entertainment expenditures not be made public, destroyed the financial records.\n\nInternational groups attempted to pressure the IOC to reject Beijing's bid in protest of the state of human rights in the People's Republic of China. One Chinese dissident who expressed similar sentiments was arrested and sentenced to two years in prison for calling on the IOC to do just that at the same time that IOC inspectors were touring the city. Amnesty International expressed concern in 2006 regarding the Olympic Games to be held in China in 2008, likewise expressing concerns over the human rights situation. The second principle in the Fundamental Principles of Olympism, Olympic Charter states that The goal of Olympism is to place sport at the service of the harmonious development of man, with a view to promoting a peaceful society concerned with the preservation of human dignity.[http://multimedia.olympic.org/pdf/en_report_122.pdf \"Olympic Charter, in force as from 1 September 2004\", International Olympic Committee]  Amnesty International considers the policies and practices of the People's Republic as failing to meet that principle, and urged the IOC to press China to immediately enact human rights reform.[http://web.amnesty.org/library/index/engASA170462006?open&of=eng-CHN \"People’s Republic of China: The Olympics countdown – failing to keep human rights promises\" Amnesty International, 21 September 2006] \n\nIn August 2008, the IOC issued DMCA take down notices on Tibetan Protest videos of the Beijing Olympics hosted on YouTube.IOC backs off DMCA take-down for Tibet protest  YouTube and the Electronic Frontier Foundation (EFF) both pushed back against the IOC, which then withdrew their complaint.\n\nIn 2010, the International Olympic Committee was nominated for the Public Eye Awards. This award seeks to present \"shame-on-you-awards to the nastiest corporate players of the year\".\n\nBefore the start of the 2012 Olympic Games, the IOC decided not to hold a minute of silence to honor the 11 Israeli Olympians who were killed 40 years prior in the Munich Massacre. Jacques Rogge, the then-IOC President, said it would be \"inappropriate\" to do so. Speaking of the decision, Israeli Olympian Shaul Ladany, who had survived the Munich Massacre, commented: \"I do not understand. I do not understand, and I do not accept it\".\n\nIn February 2013, the IOC did not include wrestling as one of its core Olympic sports for the Summer Olympic program for the 2020 Olympics. This decision was poorly received by the sporting and wrestling community. Wrestling was still part of the program at the 2016 Summer Olympics in Rio de Janeiro. This decision was later overturned, and wrestling will be a part of the 2020 Olympic Games in Tokyo.\n\nAs planned, the alpine ski run and luge racing area of 2022 Beijing Olympic Winter Games will be built in the core area of Beijing Songshan National Reserves. A great number of valuable species such as Lonicera oblata and Cypripedium shanxiense S. C. Chen are found here and many of them can not be conserved through ex situ conservation. Many Chinese professionals of biology and environmentalists deemed that if the Olympic venues are developed in such area, the rare species and integrated ecological environment will be catastrophically collapsed. Chinese government intended to remove such area out from the range of the natural reserves and chose some other area with few rare species as the reserves. Besides, the comments regarding the strict compliance with laws and protection of Songshan National Reserves are widely deleted or restricted in China. All these actions have been criticized by some media and the professionals of biology in China.\n\nRussian doping scandal\n\nMedia attention began growing in December 2014 when German broadcaster ARD reported on state-sponsored doping in Russia, comparing it to doping in East Germany. In November 2015, the World Anti-Doping Agency (WADA) published a report and the International Association of Athletics Federations (IAAF) suspended Russia indefinitely from world track and field events. The United Kingdom Anti-Doping agency later assisted WADA with testing in Russia. In June 2016, they reported that they were unable to fully carry out their work and noted intimidation by armed Federal Security Service (FSB) agents.\nAfter a Russian former lab director made allegations about the 2014 Winter Olympics in Sochi, WADA commissioned an independent investigation led by Richard McLaren. McLaren's investigation found corroborating evidence, concluding in a report published in July 2016 that the Ministry of Sport and the FSB had operated a \"state-directed failsafe system\" using a \"disappearing positive [test] methodology\" (DPM) from \"at least late 2011 to August 2015\".\n\nIn response to these findings, WADA announced that RUSADA should be regarded as non-compliant with respect to the World Anti-Doping Code and recommended that Russia be banned from competing at the 2016 Summer Olympics. The International Olympic Commission (IOC) rejected the recommendation, stating that the IOC and each sport's international federation would make decisions on each athlete's individual basis. One day prior to the opening ceremony, 270 athletes were cleared to compete under the Russian flag, while 167 were removed because of doping. In contrast, the entire Kuwaiti team was banned from competing under their own flag (for a non-doping related matter).\n\nThe IOC's decision on 24 July 2016 was criticised by athletes and writers. It received support from the European Olympic Committees, which said that Russia is \"a valued member\". Cam Cole of Canada's National Post said that the IOC had \"caved, as it always does, defaulting to whatever compromise it could safely adopt without offending a superpower.\" Expressing disappointment, a member of the IOC Athletes' Commission, Hayley Wickenheiser, wrote, \"I ask myself if we were not dealing with Russia would this decision to ban a nation [have] been an easier one? I fear the answer is yes.\" Writing for Deutsche Welle in Germany, Olivia Gerstenberger said that Bach had \"flunked\" his first serious test, adding, \"With this decision, the credibility of the organization is shattered once more, while that of state-sponsored doping actually receives a minor boost.\" Bild (Germany) described Bach as \"Putin's poodle\". Paul Hayward, chief sports writer of The Daily Telegraph (UK), remarked, \"The white flag of capitulation flies over the International Olympic Committee. Russia's deep political reach should have told us this would happen.\n\nLeaders of thirteen national anti-doping organisations wrote that the IOC had \"violated the athletes' fundamental rights to participate in Games that meet the stringent requirements of the World Anti-Doping Code\" and \"[demonstrated that] it lacks the independence required to keep commercial and political interests from influencing the tough decisions necessary to protect clean sport.\" WADA's former chief investigation, Jack Robertson, said \"The anti-doping code is now just suggestions to follow or not\" and that \"WADA handed the IOC that excuse [not enough time before the Olympics] by sitting on the allegations for close to a year.\" McLaren was dissatisfied with the IOC's handling of his report, saying \"It was about state-sponsored doping and the mis-recording of doping results and they turned the focus into individual athletes and whether they should compete. [...] it was a complete turning upside down of what was in the report and passing over responsibility to all the different international federations.\"\n\nIn contrast to the IOC, the International Paralympic Committee voted unanimously to ban the entire Russian team from the 2016 Summer Paralympics, having found evidence that the DPM was also in operation at the 2014 Winter Paralympics.\n\nOn 5 December 2017, the IOC announced that the Russian Olympic Committee had been suspended effective immediately from the 2018 Winter Olympics. Athletes who had no previous drug violations and a consistent history of drug testing were to be allowed to compete under the Olympic Flag as an \"Olympic Athlete from Russia\" (OAR). Under the terms of the decree, Russian government officials were barred from the Games, and neither the country's flag nor anthem would be present. The Olympic Flag and Olympic Anthem will be used instead, and on 20 December 2017 the IOC proposed an alternate logo for the uniforms (seen at right). IOC President Thomas Bach said that \"after following due process [the IOC] has issued proportional sanctions for this systematic manipulation while protecting the clean athletes.\"\n\nOn 1 February 2018, the Court of Arbitration for Sport partially overturned IOC's doping suspensions. For 28 of 42 suspended athletes, their appeals were upheld, the sanctions annulled and their individual results achieved in Sochi 2014 were reinstated. International Olympic Committee. http://en.wikipedia.org/?curid=15147."
  }
}
