{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5267",
  "eid" : "d38f40f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778434687,
  "textBody" : "A constellation is a group of stars that are considered to form imaginary outlines or meaningful patterns on the celestial sphere, typically representing animals, mythological people or gods, mythological creatures, or manufactured devices.  The 88 modern constellations are formally defined regions of the sky together covering the entire celestial sphere.\n\nOrigins for the earliest constellations likely goes back to prehistory, whose now unknown creators collectively used them to related important stories of either their beliefs, experiences, creation or mythology. As such, different cultures and countries often adopted their own set of constellations outlines, some that persisted into the early 20th Century. Adoption of numerous constellations have significantly changed throughout the centuries. Many have varied in size or shape, while some became popular then dropped into obscurity. Others were traditionally used only by various cultures or single nations.\n\nThe Western-traditional constellations are the forty-eight Greek classical patterns, as stated in both Aratus' work Phenomena or Ptolemy's Almagest — though their existence probably predates these constellation names by several centuries. Newer constellations in the far southern sky were added much later during the 15th to mid-18th century, when European explorers began travelling to the southern hemisphere. Twelve important constellations are assigned to the zodiac, where the Sun, Moon, and planets all follow the ecliptic. The origins of the zodiac probably date back into prehistory, whose astrological divisions became prominent around 400BCE within Babylonian or Chaldean astronomy. \n\nIn 1928, the International Astronomical Union (IAU) ratified and recognized 88 modern constellations, with contiguous boundaries defined by right ascension and declination. Therefore, any given point in a celestial coordinate system lies in one of the modern constellations. Some astronomical naming systems give the constellation where a given celestial object is found along with a designation in order to convey an approximate idea of its location in the sky. e.g. The Flamsteed designation for bright stars consists of a number and the genitive form of the constellation name.\n\nAnother type of smaller popular patterns or groupings of stars are called asterisms, and differ from the modern or former constellations by being areas with identifiable shapes or features that can be used by novice observers learning to navigate the night sky. Such asterisms often refer to several stars within a constellation or may share boundaries with several constellations. Examples of asterisms include: The Pleiades and The Hyades within the constellation of Taurus, the False Cross crossing the southern constellations of both Carina and Vela, or Venus' Mirror in the constellation of Orion.\n\nTerminology\n\nThe word \"constellation\" seems to come from the Late Latin term , which can be translated as \"set of stars\", and came into use in English during the 14th century. \nThe Ancient Greek word for constellation was . A more modern astronomical sense of the term \"constellation\" is simply as a recognisable pattern of stars whose appearance is associated with mythological characters or creatures, or  earthbound animals, or objects. It may also specifically denote the officially recognised 88 named constellations used today.\n \nColloquial usage does not draw any sharp distinction between \"constellations\" or the many smaller \"asterisms\" (pattern of stars), yet the modern accepted astronomical constellations employ such a distinction. E.g., the Pleiades and the Hyades are both asterisms, and each lie within the boundaries of the constellation of Taurus. Another example is the popular northern asterism known as the Big Dipper (US) or the Plough (UK), composed of the seven brightest stars within the area of the IAU-defined constellation of Ursa Major. The southern False Cross asterism includes portions of the constellations Carina and Vela.\n\nThe term circumpolar constellation is used for any constellation that, from a particular latitude on Earth, never sets below the horizon. From the North Pole or South Pole, all constellations south or north of the celestial equator are circumpolar constellations. Depending on the definition, equatorial constellations may include those that lie entirely between declinations 45° north and 45° south, or those that pass through the declination range of the ecliptic or zodiac ranging between 23½° north, the celestial equator, and 23½° south.\n\nAlthough stars in constellations appear near each other in the sky, they usually lie at a variety of distances away from the observer. Since stars also travel along their own orbits through the Milky Way, the constellation outlines change slowly over time. After tens to hundreds of thousands of years, their familiar outlines gradually become unrecognisable. Astronomers can predict the past or future constellation outlines by measuring their individual stars' common proper motions or cpm by accurate astrometry and their radial velocities by astronomical spectroscopy.\n\nHistory of the early constellations\n\nThe earliest direct antecedent evidence for the constellations comes from inscribed stones and clay writing tablets dug up in Mesopotamia (within modern Iraq) dating back to 3000 BC. It seems that the bulk of the Mesopotamian constellations were created within a relatively short interval from around 1300 to 1000 BC. These groupings appeared later in many of the classical Greek constellations.\n\nConstellations in the Ancient Near East \n\nThe Babylonians were the first to recognize that astronomical phenomena are periodic and apply mathematics to their predictions. The oldest Babylonian star catalogues of stars and constellations date back to the beginning in the Middle Bronze Age, most notably the Three Stars Each texts and the MUL.APIN, an expanded and revised version based on more accurate observation from around 1000 BC. However, the numerous Sumerian names in these catalogues suggest that they built on older, but otherwise unattested, Sumerian traditions of the Early Bronze Age.\n\nThe classical Zodiac is a product of a revision of the Old Babylonian system in later Neo-Babylonian astronomy 6th century BC. Knowledge of the Neo-Babylonian zodiac is also reflected in the Hebrew Bible. E. W. Bullinger interpreted the creatures appearing in the books of Ezekiel (and thence in Revelation) as the middle signs of the four quarters of the Zodiac, with the Lion as Leo, the Bull as Taurus, the Man representing Aquarius and the Eagle standing in for Scorpio. The biblical Book of Job also makes reference to a number of constellations, including  \"bier\",  \"fool\" and  \"heap\" (Job 9:9, 38:31-32), rendered as \"Arcturus, Orion and Pleiades\" by the KJV, but ‘Ayish \"the bier\" actually corresponding to Ursa Major.[http://www.blueletterbible.org/lang/lexicon/lexicon.cfm?Strongs\nH5906&t=KJV Gesenius, Hebrew Lexicon] The term Mazzaroth , a hapax legomenon in Job 38:32, may be the Hebrew word for the zodiacal constellations.\n\nThe Greeks adopted the Babylonian system in the 4th century BC. A total of twenty Ptolemaic constellations are directly continued from the Ancient Near East. Another ten have the same stars but different names.\n\nConstellations in Classical antiquity \n\nThere is only limited information on indigenous Greek constellations, with some fragmentary evidence being found in the Works and Days of Greek poet Hesiod, who mentioned the \"heavenly bodies\". Greek astronomy essentially adopted the older Babylonian system in the Hellenistic era, first introduced to Greece by Eudoxus of Cnidus in the 4th century BC. The original work of Eudoxus is lost, but it survives as a versification by Aratus, dating to the 3rd century BC. The most complete existing works dealing with the mythical origins of the constellations are by the Hellenistic writer termed pseudo-Eratosthenes and an early Roman writer styled pseudo-Hyginus. The basis of western astronomy as taught during Late Antiquity and until the Early Modern period is the Almagest by Ptolemy, written in the 2nd century.\n\nIn the Ptolemaic Kingdom, native Egyptian tradition of anthropomorphic figures representing the planets, stars and various constellations. Some of these were combined with Greek and Babylonian astronomical systems culminating in the Zodiac of Dendera, but it remains unclear when this occurred, but most were placed during the Roman period between 2nd to 4th centuries AD. The oldest known depiction of the zodiac showing all the now familiar constellations, along with some original Egyptian Constellations, Decans and Planets. Ptolemy's Almagest remained the standard definition of constellations in the medieval period both in Europe and in Islamic astronomy.\n\nConstellations in Ancient China \n\nIn ancient China astronomy has had a long tradition in accurately observing celestial phenomena.Needham, Volume 3, p.171 Template:Nonspecific Star names later categorized in the twenty-eight mansions have been found on oracle bones unearthed at Anyang, dating back to the middle Shang Dynasty. These Chinese constellations are one of the most important and also the most ancient structures in the Chinese sky, attested from the 5th century BC. Parallels to the earliest Babylonian (Sumerian) star catalogues suggest that the ancient Chinese system did not arise independently.\n\nClassical Chinese astronomy is recorded in the Han period and appears in the form of three schools, which are attributed to astronomers of the Warring States period. The constellations of the three schools were conflated into a single system by Chen Zhuo, an astronomer of the 3rd century (Three Kingdoms period). Chen Zhuo's work has been lost, but information on his system of constellations survives in Tang period records, notably by Qutan Xida. The oldest extant Chinese star chart dates to that period and was preserved as part of the Dunhuang Manuscripts. Native Chinese astronomy flourished during the Song dynasty, and during the Yuan Dynasty became increasingly influenced by medieval Islamic astronomy (see Treatise on Astrology of the Kaiyuan Era). As maps were prepared during this period on more scientific lines they were considered as more reliable.\n \nA well known map prepared during the Song Period is the Suzhou Astronomical Chart prepared with carvings of most stars on the planisphere of the Chinese Sky on a stone plate; it is done accurately based on observations and has the supernova of the year of 1054 in Taurus carved on it.\n\nInfluenced by European astronomy during the late Ming Dynasty, more stars were depicted on the charts but retaining the traditional constellations; new stars observed were incorporated as supplementary stars in old constellations in the southern sky which did not depict any of the traditional stars recorded by ancient Chinese astronomers. Further improvements were made during the later part of the Ming Dynasty by Xu Guangqi and Johann Adam Schall von Bell, the German Jesuit and was recorded in Chongzhen Lishu (Calendrical Treatise of Chongzhen Period, 1628). Traditional Chinese star maps incorporated 23 new constellations with 125 stars of the southern hemisphere of the sky based on the knowledge of western star charts; with this improvement the Chinese Sky was integrated with the World astronomy.\n\nEarly modern astronomy\n\nHistorically, the constellations can be simply divided into two regions; namely the northern and southern sky, whose origins are distinctly different. The northern skies have constellations that have mostly survived since Antiquity, whose common names are based on Classical Greek legends or those whose true origins have now been lost. Evidence of these constellations have survived in the form of star charts, whose oldest representation appears on the statue known as the Farnese Atlas, which has been suggested to be based on the star catalogue of the Greek astronomer, Hipparchus. Southern hemisphere constellations are more modern inventions, which were created as new constellations, or become substitutes for some ancient constellation. e.g. Argo Navis. Some southern constellations were to become obsolete or had extended names that became foreshortened to more usable forms e.g. Musca Australis became simply Musca.\n\nHowever, all the early constellations were never universally adopted, whose popular usage was based on the culture or individual nations. Defining each constellation and their assigned stars also significantly differed in size and shape, whose arbitrary boundaries often lead to confusion to where celestial objects were to be placed. Before the constellation boundaries were defined by the International Astronomical Union (IAU) in 1930, they appeared as simply encircled areas of sky. Today they now follow officially accepted designated lines of Right Ascension and Declination based on those defined by Benjamin Gould in Epoch 1875.0 in his star catalogue known as Uranometria Argentina.\n\nSince the invention of the optical telescope, astronomers have found the need to catalogue and position celestial bodies, whose knowledge could be used for navigational or astronomical purposes, and this required improved definitions of the constellations and their boundaries. Such changes also assigned stars within each constellation, as first accomplished in 1603 by Johann Bayer in the star atlas \"Uranometria\" using the twenty-four letters of the Greek alphabet. Subsequent star atlases defined under celestial cartography lead to the development towards today's accepted modern constellations.\n\nOrigin of the southern constellations\n\n \n\nMuch of the sky near the South Celestial Pole below the declination of about –65° was observed by people living in the Southern Hemisphere but was only partially catalogued by the ancient Babylonians, Egyptian, Greeks, Chinese, and Persian astronomers of the north. Knowledge that northern and southern star patterns differed go back into Antiquity, being mostly gained from later Classical writers about Phoenician sailors : like the African circumnavigation expedition commissioned by Egyptian Pharaoh Necho II in c. 600 BC or those of Hanno the Navigator in c. 500BC. However, much of the history of these origins were lost with the Destruction of the Library of Alexandria. \n\nA true history of southern constellation names remains neither definitive nor straight forward.  Various countries had adopted or ascribed different names or had used different stars to define them. Most these early forms of constellations remained as merely curiosities for their nobility or sponsors, but only became important to 14th to 16th Century seafarers who began journeying across the southern oceans using the stars for celestial navigation purposes. Examples of such Italian explorers who recorded the new southern constellations included : Andrea Corsali,  Antonio Pigafetta, Amerigo Vespucci.\n\nMany of the 88 IAU-recognized constellations in this region were to be adopted from in the late 16th century by Petrus Plancius and were mainly based on the observations of the Dutch navigators Pieter Dirkszoon Keyser and Frederick de Houtman who had added fifteen by the end of the sixteenth century.Knobel, E. B. (1917). On Frederick de Houtman's Catalogue of Southern Stars, and the Origin of the Southern Constellations. (Monthly Notices of the Royal Astronomical Society, Vol. 77, pp.  414–32)Dekker, Elly (1987). Early Explorations of the Southern Celestial Sky. (Annals of Science 44, pp.  439–70)Dekker, Elly (1987). On the Dispersal of Knowledge of the Southern Celestial Sky. (Der Globusfreund, 35-37, pp.  211–30)Verbunt, Frank; van Gent, Robert H. (2011). Early Star Catalogues of the Southern Sky: De Houtman, Kepler (Second and Third Classes), and Halley. (Astronomy & Astrophysics 530) Another ten were added by Petrus Plancius including: Apus, Chamaeleon, Columba, Dorado, Grus, Hydrus, Indus, Musca, Pavo, Phoenix, Triangulum Australe, Tucana, and Volans. However, most of these early constellations only formally appeared a century after their creation, when they were later depicted by German Johann Bayer in his star atlas Uranometria of 1603. Seventeen more were created in 1763 by the French astronomer Nicolas Louis de Lacaille appearing in his star catalogue, published in 1756.\n\nSome other modern proposals were unsuccessful. For example, the large classical constellation of Argo Navis was broken up into three separate parts (Carina, Puppis, and Vela) by Lacaille, for the convenience of stellar cartographers. Others included constellations by the French astronomers Pierre Lemonnier and Joseph Lalande, whose additions were once popular, but have since been dropped. For the northern constellations, an example is Quadrans, eponymous of the Quadrantid meteors, now divided between Boötes and Draco.\n\n88 modern constellations\n\nThe current list of 88 constellations recognized by the International Astronomical Union since 1922 is based on the 48 listed by Ptolemy in his Almagest in the 2nd century, with early modern modifications and additions (most importantly introducing constellations covering the parts of the southern sky unknown to Ptolemy) by Petrus Plancius (1592, 1597/98 and 1613), Johannes Hevelius (1690) and Nicolas Louis de Lacaille (1763), who named fourteen constellations and renamed a fifteenth one. De Lacaille studied the stars of the southern hemisphere from 1750 until 1754 from Cape of Good Hope, when he was said to have observed more than 10,000 stars using a  refracting telescope.\n\nIn 1922, Henry Norris Russell aided the IAU (International Astronomical Union) in dividing the celestial sphere into 88 official constellations; Prior to this, Ptolemy's list of 48 constellations with many additions made by European astronomers had prevailed. However, these divisions did not have clear borders between them. It was only in 1930 that Eugene Delporte, the Belgian astronomer created an authoritative map demarcating the areas of sky under different constellations.  Where possible, these modern constellations usually share the names of their Graeco-Roman predecessors, such as Orion, Leo or Scorpius. The aim of this system is area-mapping, i.e. the division of the celestial sphere into contiguous fields. Out of the 88 modern constellations, 36 lie predominantly in the northern sky, and the other 52 predominantly in the southern.\n\nIn 1930, the boundaries between the 88 constellations were devised by Eugène Delporte along vertical and horizontal lines of right ascension and declination. However, the data he used originated back to epoch B1875.0, which was when Benjamin A. Gould first made his proposal to designate boundaries for the celestial sphere, a suggestion upon which Delporte would base his work. The consequence of this early date is that because of the precession of the equinoxes, the borders on a modern star map, such as epoch J2000, are already somewhat skewed and no longer perfectly vertical or horizontal.A.C. Davenhall & S.K. Leggett, [http://cdsarc.u-strasbg.fr/ftp/cats/VI/49/constell.pdf \"A Catalogue of Constellation Boundary Data\"], (Centre de Donneés astronomiques de Strasbourg, February 1990). This effect will increase over the years and centuries to come.\n\nDark cloud constellations \n\nThe Great Rift, a series of dark patches in the Milky Way, is more visible and striking in the southern hemisphere than in the northern. It vividly stands out when conditions are otherwise so dark that the Milky Way's central region casts shadows on the ground. Some cultures have discerned shapes in these patches and have given names to these \"dark cloud constellations\". Members of the Inca civilization identified various dark areas or dark nebulae in the Milky Way as animals, and associated their appearance with the seasonal rains.[http://www.astronomy.pomona.edu/archeo/andes/inca.nightsky.html The Incan View of the Night Sky] Australian Aboriginal astronomy also describes dark cloud constellations, the most famous being the \"emu in the sky\" whose head is formed by the Coalsack, a dark nebula, instead of the stars.\n\nFile:Emu public.jpg|The Emu in the sky—a constellation defined by dark clouds rather than by stars. The head of the emu is the Coalsack with the Southern Cross directly above. Scorpius is to the left.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Constellation" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5267" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A constellation is a group of stars that are considered to form imaginary outlines or meaningful patterns on the celestial sphere, typically representing animals, mythological people or gods, mythological creatures, or manufactured devices.  The 88 modern constellations are formally defined regions of the sky together covering the entire celestial sphere.\n\nOrigins for the earliest constellations likely goes back to prehistory, whose now unknown creators collectively used them to related important stories of either their beliefs, experiences, creation or mythology. As such, different cultures and countries often adopted their own set of constellations outlines, some that persisted into the early 20th Century. Adoption of numerous constellations have significantly changed throughout the centuries. Many have varied in size or shape, while some became popular then dropped into obscurity. Others were traditionally used only by various cultures or single nations.\n\nThe Western-traditional constellations are the forty-eight Greek classical patterns, as stated in both Aratus' work Phenomena or Ptolemy's Almagest — though their existence probably predates these constellation names by several centuries. Newer constellations in the far southern sky were added much later during the 15th to mid-18th century, when European explorers began travelling to the southern hemisphere. Twelve important constellations are assigned to the zodiac, where the Sun, Moon, and planets all follow the ecliptic. The origins of the zodiac probably date back into prehistory, whose astrological divisions became prominent around 400BCE within Babylonian or Chaldean astronomy. \n\nIn 1928, the International Astronomical Union (IAU) ratified and recognized 88 modern constellations, with contiguous boundaries defined by right ascension and declination. Therefore, any given point in a celestial coordinate system lies in one of the modern constellations. Some astronomical naming systems give the constellation where a given celestial object is found along with a designation in order to convey an approximate idea of its location in the sky. e.g. The Flamsteed designation for bright stars consists of a number and the genitive form of the constellation name.\n\nAnother type of smaller popular patterns or groupings of stars are called asterisms, and differ from the modern or former constellations by being areas with identifiable shapes or features that can be used by novice observers learning to navigate the night sky. Such asterisms often refer to several stars within a constellation or may share boundaries with several constellations. Examples of asterisms include: The Pleiades and The Hyades within the constellation of Taurus, the False Cross crossing the southern constellations of both Carina and Vela, or Venus' Mirror in the constellation of Orion.\n\nTerminology\n\nThe word \"constellation\" seems to come from the Late Latin term , which can be translated as \"set of stars\", and came into use in English during the 14th century. \nThe Ancient Greek word for constellation was . A more modern astronomical sense of the term \"constellation\" is simply as a recognisable pattern of stars whose appearance is associated with mythological characters or creatures, or  earthbound animals, or objects. It may also specifically denote the officially recognised 88 named constellations used today.\n \nColloquial usage does not draw any sharp distinction between \"constellations\" or the many smaller \"asterisms\" (pattern of stars), yet the modern accepted astronomical constellations employ such a distinction. E.g., the Pleiades and the Hyades are both asterisms, and each lie within the boundaries of the constellation of Taurus. Another example is the popular northern asterism known as the Big Dipper (US) or the Plough (UK), composed of the seven brightest stars within the area of the IAU-defined constellation of Ursa Major. The southern False Cross asterism includes portions of the constellations Carina and Vela.\n\nThe term circumpolar constellation is used for any constellation that, from a particular latitude on Earth, never sets below the horizon. From the North Pole or South Pole, all constellations south or north of the celestial equator are circumpolar constellations. Depending on the definition, equatorial constellations may include those that lie entirely between declinations 45° north and 45° south, or those that pass through the declination range of the ecliptic or zodiac ranging between 23½° north, the celestial equator, and 23½° south.\n\nAlthough stars in constellations appear near each other in the sky, they usually lie at a variety of distances away from the observer. Since stars also travel along their own orbits through the Milky Way, the constellation outlines change slowly over time. After tens to hundreds of thousands of years, their familiar outlines gradually become unrecognisable. Astronomers can predict the past or future constellation outlines by measuring their individual stars' common proper motions or cpm by accurate astrometry and their radial velocities by astronomical spectroscopy.\n\nHistory of the early constellations\n\nThe earliest direct antecedent evidence for the constellations comes from inscribed stones and clay writing tablets dug up in Mesopotamia (within modern Iraq) dating back to 3000 BC. It seems that the bulk of the Mesopotamian constellations were created within a relatively short interval from around 1300 to 1000 BC. These groupings appeared later in many of the classical Greek constellations.\n\nConstellations in the Ancient Near East \n\nThe Babylonians were the first to recognize that astronomical phenomena are periodic and apply mathematics to their predictions. The oldest Babylonian star catalogues of stars and constellations date back to the beginning in the Middle Bronze Age, most notably the Three Stars Each texts and the MUL.APIN, an expanded and revised version based on more accurate observation from around 1000 BC. However, the numerous Sumerian names in these catalogues suggest that they built on older, but otherwise unattested, Sumerian traditions of the Early Bronze Age.\n\nThe classical Zodiac is a product of a revision of the Old Babylonian system in later Neo-Babylonian astronomy 6th century BC. Knowledge of the Neo-Babylonian zodiac is also reflected in the Hebrew Bible. E. W. Bullinger interpreted the creatures appearing in the books of Ezekiel (and thence in Revelation) as the middle signs of the four quarters of the Zodiac, with the Lion as Leo, the Bull as Taurus, the Man representing Aquarius and the Eagle standing in for Scorpio. The biblical Book of Job also makes reference to a number of constellations, including  \"bier\",  \"fool\" and  \"heap\" (Job 9:9, 38:31-32), rendered as \"Arcturus, Orion and Pleiades\" by the KJV, but ‘Ayish \"the bier\" actually corresponding to Ursa Major.[http://www.blueletterbible.org/lang/lexicon/lexicon.cfm?Strongs\nH5906&t=KJV Gesenius, Hebrew Lexicon] The term Mazzaroth , a hapax legomenon in Job 38:32, may be the Hebrew word for the zodiacal constellations.\n\nThe Greeks adopted the Babylonian system in the 4th century BC. A total of twenty Ptolemaic constellations are directly continued from the Ancient Near East. Another ten have the same stars but different names.\n\nConstellations in Classical antiquity \n\nThere is only limited information on indigenous Greek constellations, with some fragmentary evidence being found in the Works and Days of Greek poet Hesiod, who mentioned the \"heavenly bodies\". Greek astronomy essentially adopted the older Babylonian system in the Hellenistic era, first introduced to Greece by Eudoxus of Cnidus in the 4th century BC. The original work of Eudoxus is lost, but it survives as a versification by Aratus, dating to the 3rd century BC. The most complete existing works dealing with the mythical origins of the constellations are by the Hellenistic writer termed pseudo-Eratosthenes and an early Roman writer styled pseudo-Hyginus. The basis of western astronomy as taught during Late Antiquity and until the Early Modern period is the Almagest by Ptolemy, written in the 2nd century.\n\nIn the Ptolemaic Kingdom, native Egyptian tradition of anthropomorphic figures representing the planets, stars and various constellations. Some of these were combined with Greek and Babylonian astronomical systems culminating in the Zodiac of Dendera, but it remains unclear when this occurred, but most were placed during the Roman period between 2nd to 4th centuries AD. The oldest known depiction of the zodiac showing all the now familiar constellations, along with some original Egyptian Constellations, Decans and Planets. Ptolemy's Almagest remained the standard definition of constellations in the medieval period both in Europe and in Islamic astronomy.\n\nConstellations in Ancient China \n\nIn ancient China astronomy has had a long tradition in accurately observing celestial phenomena.Needham, Volume 3, p.171 Template:Nonspecific Star names later categorized in the twenty-eight mansions have been found on oracle bones unearthed at Anyang, dating back to the middle Shang Dynasty. These Chinese constellations are one of the most important and also the most ancient structures in the Chinese sky, attested from the 5th century BC. Parallels to the earliest Babylonian (Sumerian) star catalogues suggest that the ancient Chinese system did not arise independently.\n\nClassical Chinese astronomy is recorded in the Han period and appears in the form of three schools, which are attributed to astronomers of the Warring States period. The constellations of the three schools were conflated into a single system by Chen Zhuo, an astronomer of the 3rd century (Three Kingdoms period). Chen Zhuo's work has been lost, but information on his system of constellations survives in Tang period records, notably by Qutan Xida. The oldest extant Chinese star chart dates to that period and was preserved as part of the Dunhuang Manuscripts. Native Chinese astronomy flourished during the Song dynasty, and during the Yuan Dynasty became increasingly influenced by medieval Islamic astronomy (see Treatise on Astrology of the Kaiyuan Era). As maps were prepared during this period on more scientific lines they were considered as more reliable.\n \nA well known map prepared during the Song Period is the Suzhou Astronomical Chart prepared with carvings of most stars on the planisphere of the Chinese Sky on a stone plate; it is done accurately based on observations and has the supernova of the year of 1054 in Taurus carved on it.\n\nInfluenced by European astronomy during the late Ming Dynasty, more stars were depicted on the charts but retaining the traditional constellations; new stars observed were incorporated as supplementary stars in old constellations in the southern sky which did not depict any of the traditional stars recorded by ancient Chinese astronomers. Further improvements were made during the later part of the Ming Dynasty by Xu Guangqi and Johann Adam Schall von Bell, the German Jesuit and was recorded in Chongzhen Lishu (Calendrical Treatise of Chongzhen Period, 1628). Traditional Chinese star maps incorporated 23 new constellations with 125 stars of the southern hemisphere of the sky based on the knowledge of western star charts; with this improvement the Chinese Sky was integrated with the World astronomy.\n\nEarly modern astronomy\n\nHistorically, the constellations can be simply divided into two regions; namely the northern and southern sky, whose origins are distinctly different. The northern skies have constellations that have mostly survived since Antiquity, whose common names are based on Classical Greek legends or those whose true origins have now been lost. Evidence of these constellations have survived in the form of star charts, whose oldest representation appears on the statue known as the Farnese Atlas, which has been suggested to be based on the star catalogue of the Greek astronomer, Hipparchus. Southern hemisphere constellations are more modern inventions, which were created as new constellations, or become substitutes for some ancient constellation. e.g. Argo Navis. Some southern constellations were to become obsolete or had extended names that became foreshortened to more usable forms e.g. Musca Australis became simply Musca.\n\nHowever, all the early constellations were never universally adopted, whose popular usage was based on the culture or individual nations. Defining each constellation and their assigned stars also significantly differed in size and shape, whose arbitrary boundaries often lead to confusion to where celestial objects were to be placed. Before the constellation boundaries were defined by the International Astronomical Union (IAU) in 1930, they appeared as simply encircled areas of sky. Today they now follow officially accepted designated lines of Right Ascension and Declination based on those defined by Benjamin Gould in Epoch 1875.0 in his star catalogue known as Uranometria Argentina.\n\nSince the invention of the optical telescope, astronomers have found the need to catalogue and position celestial bodies, whose knowledge could be used for navigational or astronomical purposes, and this required improved definitions of the constellations and their boundaries. Such changes also assigned stars within each constellation, as first accomplished in 1603 by Johann Bayer in the star atlas \"Uranometria\" using the twenty-four letters of the Greek alphabet. Subsequent star atlases defined under celestial cartography lead to the development towards today's accepted modern constellations.\n\nOrigin of the southern constellations\n\n \n\nMuch of the sky near the South Celestial Pole below the declination of about –65° was observed by people living in the Southern Hemisphere but was only partially catalogued by the ancient Babylonians, Egyptian, Greeks, Chinese, and Persian astronomers of the north. Knowledge that northern and southern star patterns differed go back into Antiquity, being mostly gained from later Classical writers about Phoenician sailors : like the African circumnavigation expedition commissioned by Egyptian Pharaoh Necho II in c. 600 BC or those of Hanno the Navigator in c. 500BC. However, much of the history of these origins were lost with the Destruction of the Library of Alexandria. \n\nA true history of southern constellation names remains neither definitive nor straight forward.  Various countries had adopted or ascribed different names or had used different stars to define them. Most these early forms of constellations remained as merely curiosities for their nobility or sponsors, but only became important to 14th to 16th Century seafarers who began journeying across the southern oceans using the stars for celestial navigation purposes. Examples of such Italian explorers who recorded the new southern constellations included : Andrea Corsali,  Antonio Pigafetta, Amerigo Vespucci.\n\nMany of the 88 IAU-recognized constellations in this region were to be adopted from in the late 16th century by Petrus Plancius and were mainly based on the observations of the Dutch navigators Pieter Dirkszoon Keyser and Frederick de Houtman who had added fifteen by the end of the sixteenth century.Knobel, E. B. (1917). On Frederick de Houtman's Catalogue of Southern Stars, and the Origin of the Southern Constellations. (Monthly Notices of the Royal Astronomical Society, Vol. 77, pp.  414–32)Dekker, Elly (1987). Early Explorations of the Southern Celestial Sky. (Annals of Science 44, pp.  439–70)Dekker, Elly (1987). On the Dispersal of Knowledge of the Southern Celestial Sky. (Der Globusfreund, 35-37, pp.  211–30)Verbunt, Frank; van Gent, Robert H. (2011). Early Star Catalogues of the Southern Sky: De Houtman, Kepler (Second and Third Classes), and Halley. (Astronomy & Astrophysics 530) Another ten were added by Petrus Plancius including: Apus, Chamaeleon, Columba, Dorado, Grus, Hydrus, Indus, Musca, Pavo, Phoenix, Triangulum Australe, Tucana, and Volans. However, most of these early constellations only formally appeared a century after their creation, when they were later depicted by German Johann Bayer in his star atlas Uranometria of 1603. Seventeen more were created in 1763 by the French astronomer Nicolas Louis de Lacaille appearing in his star catalogue, published in 1756.\n\nSome other modern proposals were unsuccessful. For example, the large classical constellation of Argo Navis was broken up into three separate parts (Carina, Puppis, and Vela) by Lacaille, for the convenience of stellar cartographers. Others included constellations by the French astronomers Pierre Lemonnier and Joseph Lalande, whose additions were once popular, but have since been dropped. For the northern constellations, an example is Quadrans, eponymous of the Quadrantid meteors, now divided between Boötes and Draco.\n\n88 modern constellations\n\nThe current list of 88 constellations recognized by the International Astronomical Union since 1922 is based on the 48 listed by Ptolemy in his Almagest in the 2nd century, with early modern modifications and additions (most importantly introducing constellations covering the parts of the southern sky unknown to Ptolemy) by Petrus Plancius (1592, 1597/98 and 1613), Johannes Hevelius (1690) and Nicolas Louis de Lacaille (1763), who named fourteen constellations and renamed a fifteenth one. De Lacaille studied the stars of the southern hemisphere from 1750 until 1754 from Cape of Good Hope, when he was said to have observed more than 10,000 stars using a  refracting telescope.\n\nIn 1922, Henry Norris Russell aided the IAU (International Astronomical Union) in dividing the celestial sphere into 88 official constellations; Prior to this, Ptolemy's list of 48 constellations with many additions made by European astronomers had prevailed. However, these divisions did not have clear borders between them. It was only in 1930 that Eugene Delporte, the Belgian astronomer created an authoritative map demarcating the areas of sky under different constellations.  Where possible, these modern constellations usually share the names of their Graeco-Roman predecessors, such as Orion, Leo or Scorpius. The aim of this system is area-mapping, i.e. the division of the celestial sphere into contiguous fields. Out of the 88 modern constellations, 36 lie predominantly in the northern sky, and the other 52 predominantly in the southern.\n\nIn 1930, the boundaries between the 88 constellations were devised by Eugène Delporte along vertical and horizontal lines of right ascension and declination. However, the data he used originated back to epoch B1875.0, which was when Benjamin A. Gould first made his proposal to designate boundaries for the celestial sphere, a suggestion upon which Delporte would base his work. The consequence of this early date is that because of the precession of the equinoxes, the borders on a modern star map, such as epoch J2000, are already somewhat skewed and no longer perfectly vertical or horizontal.A.C. Davenhall & S.K. Leggett, [http://cdsarc.u-strasbg.fr/ftp/cats/VI/49/constell.pdf \"A Catalogue of Constellation Boundary Data\"], (Centre de Donneés astronomiques de Strasbourg, February 1990). This effect will increase over the years and centuries to come.\n\nDark cloud constellations \n\nThe Great Rift, a series of dark patches in the Milky Way, is more visible and striking in the southern hemisphere than in the northern. It vividly stands out when conditions are otherwise so dark that the Milky Way's central region casts shadows on the ground. Some cultures have discerned shapes in these patches and have given names to these \"dark cloud constellations\". Members of the Inca civilization identified various dark areas or dark nebulae in the Milky Way as animals, and associated their appearance with the seasonal rains.[http://www.astronomy.pomona.edu/archeo/andes/inca.nightsky.html The Incan View of the Night Sky] Australian Aboriginal astronomy also describes dark cloud constellations, the most famous being the \"emu in the sky\" whose head is formed by the Coalsack, a dark nebula, instead of the stars.\n\nFile:Emu public.jpg|The Emu in the sky—a constellation defined by dark clouds rather than by stars. The head of the emu is the Coalsack with the Southern Cross directly above. Scorpius is to the left. Constellation. http://en.wikipedia.org/?curid=5267."
  }
}
