{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9235",
  "eid" : "ecf924c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778477324,
  "textBody" : "Ethical egoism  is the normative ethical position that moral agents ought to do what is in their own self-interest. It differs from psychological egoism, which claims that people can only act in their self-interest. Ethical egoism also differs from rational egoism, which holds that it is rational to act in one's self-interest.Sanders, Steven M. \"Is egoism morally defensible?\" Philosophia. Springer Netherlands. Volume 18, Numbers 2–3 / July 1988\nEthical egoism holds, therefore, that actions whose consequences will benefit the doer can be considered ethical in this sense.\n\nEthical egoism contrasts with ethical altruism, which holds that moral agents have an obligation to help others. Egoism and altruism both contrast with ethical utilitarianism, which holds that a moral agent should treat one's self (also known as the subject) with no higher regard than one has for others (as egoism does, by elevating self-interests and \"the self\" to a status not granted to others). But it also holds that one should not (as altruism does) sacrifice one's own interests to help others' interests, so long as one's own interests (i.e. one's own desires or well-being) are substantially equivalent to the others' interests and well-being. Egoism, utilitarianism, and altruism are all forms of consequentialism, but egoism and altruism contrast with utilitarianism, in that egoism and altruism are both agent-focused forms of consequentialism (i.e. subject-focused or subjective). However, utilitarianism is held to be agent-neutral (i.e. objective and impartial): it does not treat the subject's (i.e. the self's, i.e. the moral \"agent's\") own interests as being more or less important than the interests, desires, or well-being of others.\n\nEthical egoism does not, however, require moral agents to harm the interests and well-being of others when making moral deliberation; e.g. what is in an agent's self-interest may be incidentally detrimental, beneficial, or neutral in its effect on others. Individualism allows for others' interest and well-being to be disregarded or not, as long as what is chosen is efficacious in satisfying the self-interest of the agent. Nor does ethical egoism necessarily entail that, in pursuing self-interest, one ought always to do what one wants to do; e.g. in the long term, the fulfillment of short-term desires may prove detrimental to the self. Fleeting pleasure, then, takes a back seat to protracted eudaimonia. In the words of James Rachels, \"Ethical egoism ... endorses selfishness, but it doesn't endorse foolishness.\"Rachels 2008, p. 534.\n\nEthical egoism is often used as the philosophical basis for support of right-libertarianism and individualist anarchism. These are political positions based partly on a belief that individuals should not coercively prevent others from exercising freedom of action.\n\nForms\n\nEthical egoism can be broadly divided into three categories: individual, personal, and universal. An individual ethical egoist would hold that all people should do whatever benefits \"my\" (the individual) self-interest; a personal ethical egoist would hold that he or she should act in his or her self-interest, but would make no claims about what anyone else ought to do; a universal ethical egoist would argue that everyone should act in ways that are in their self-interest.Waller (2005), p. 81.Waller (2005), p. 83.\n\nHistory\n\nEthical egoism was introduced by the philosopher Henry Sidgwick in his book The Methods of Ethics, written in 1874. Sidgwick compared egoism to the philosophy of utilitarianism, writing that whereas utilitarianism sought to maximize overall pleasure, egoism focused only on maximizing individual pleasure.\n\nPhilosophers before Sidgwick have also retroactively been identified as ethical egoists. One ancient example is the philosophy of Yang Zhu (4th century BC), Yangism, who views wei wo, or \"everything for myself\", as the only virtue necessary for self-cultivation. Ancient Greek philosophers like Plato, Aristotle and the Stoics were exponents of virtue ethics, and \"did not accept the formal principle that whatever the good is, we should seek only our own good, or prefer it to the good of others.\" However, the beliefs of the Cyrenaics have been referred to as a \"form of egoistic hedonism\",[http://www.iep.utm.edu/cyren/ Internet Encyclopedia of Philosophy: Cyrenaics] and while some refer to Epicurus' hedonism as a form of virtue ethics, others argue his ethics are more properly described as ethical egoism.\n\nJustifications\n\nPhilosopher James Rachels, in an essay that takes as its title the theory's name, outlines the three arguments most commonly touted in its favor:He notes, however, that \"the theory is asserted more often than it is argued for. Many of its supporters apparently think its truth is self-evident, so that arguments are not needed.\" (Rachels 2008, p. 534.)\n\n*\"The first argument,\" writes Rachels, \"has several variations, each suggesting the same general point:That is, that regarding and pursuing the interests of others is a self-defeating policy. Rachels quotes Alexander Pope in support of this: \"Thus God and nature formed the general frame/And bade self-love and social be the same.\"\n**\"Each of us is intimately familiar with our own individual wants and needs. Moreover, each of us is uniquely placed to pursue those wants and needs effectively. At the same time, we know the desires and needs of others only imperfectly, and we are not well situated to pursue them. Therefore, it is reasonable to believe that if we set out to be 'our brother's keeper,' we would often bungle the job and end up doing more mischief than good.\"\n**To give charity to someone is to degrade him, implying as it does that he is reliant on such munificence and quite unable to look out for himself. \"That,\" reckons Rachels, \"is why the recipients of 'charity' are so often resentful rather than appreciative.\"Rachels 2008, p. 534, where it is pointed out that, in the strictest egoistic terms, this is an inconsequential argument. Ethical egoism does not bother itself with how others receive charity, irrespective of how degraded it makes them feel. The same reasoning applies to the previous two bullets, which use self-interest as a means to the end of beneficence, rather than for its own purposes, as the theory would dictate.\n*Altruism, ultimately, denies an individual's value and is therefore destructive both to society and its individual components, viewing life merely as a thing to be sacrificed. Philosopher Ayn Rand is quoted as writing that, \"[i]f a man accepts the ethics of altruism, his first concern is not how to live his life but how to sacrifice it.\"Rachels 2008, p. 535, where this argument is attributed to Ayn Rand, \"a writer little heeded by professional philosophers but who nevertheless was enormously popular on college campuses in the 1960s and 1970s\". Moreover, \"[t]he basic principle of altruism is that man has no right to exist for his own sake, that service to others is the only justification for his existence, and that self-sacrifice is his highest moral duty, virtue or value.\" Rather, she writes, \"[t]he purpose of morality is to teach you, not to suffer and die, but to enjoy yourself and live.\"Rand, Ayn, \"Faith and Force: Destroyers of the Modern World,\" Philosophy: Who Needs It, p. 74; Atlas Shrugged, 1957, Random House, p. 1014; \"Faith and Force,\" p. 74.\n*All of our commonly accepted moral duties, from doing no harm unto others to speaking always the truth to keeping promises, are rooted in the one fundamental principle of self-interest.\n*It has been observed, however, that the very act of eating (especially, when there are others starving in the world) is such an act of self-interested discrimination. Ethical egoists such as Rand who readily acknowledge the (conditional) value of others to an individual, and who readily endorse empathy for others, have argued the exact reverse from Rachels, that it is altruism which discriminates: \"If the sensation of eating a cake is a value, then why is it an immoral indulgence in your stomach, but a moral goal for you to achieve in the stomach of others?\"Rand, Ayn, Atlas Shrugged, 1957, Random House. It is therefore altruism which is an arbitrary position, according to Rand.\n\nNotable proponents\n\nThe term ethical egoism has been applied retroactively to philosophers such as Bernard de Mandeville and to many other materialists of his generation, although none of them declared themselves to be egoists. Note that materialism does not necessarily imply egoism, as indicated by Karl Marx, and the many other materialists who espoused forms of collectivism. It has been argued that ethical egoism can lend itself to individualist anarchism such as that of Benjamin Tucker, or the combined anarcho-communism and egoism of Emma Goldman, both of whom were proponents of many egoist ideas put forward by Max Stirner. In this context, egoism is another way of describing the sense that the common good should be enjoyed by all. However, most notable anarchists in history have been less radical, retaining altruism and a sense of the importance of the individual that is appreciable but does not go as far as egoism. Recent trends to greater appreciation of egoism within anarchism tend to come from less classical directions such as post-left anarchy or Situationism (e.g. Raoul Vaneigem). Egoism has also been referenced by anarcho-capitalists, such as Murray Rothbard.\n\nPhilosopher Max Stirner, in his book The Ego and Its Own, was the first philosopher to call himself an egoist, though his writing makes clear that he desired not a new idea of morality (ethical egoism), but rather a rejection of morality (amoralism), as a nonexistent and limiting \"spook\"; for this, Stirner has been described as the first individualist anarchist. Other philosophers, such as Thomas Hobbes and David Gauthier, have argued that the conflicts which arise when people each pursue their own ends can be resolved for the best of each individual only if they all voluntarily forgo some of their aims—that is, one's self-interest is often best pursued by allowing others to pursue their self-interest as well so that liberty is equal among individuals. Sacrificing one's short-term self-interest to maximize one's long-term self-interest is one form of \"rational self-interest\" which is the idea behind most philosophers' advocacy of ethical egoism. Egoists have also argued that one's actual interests are not immediately obvious, and that the pursuit of self-interest involves more than merely the acquisition of some good, but the maximizing of one's chances of survival and/or happiness.\n\nPhilosopher Friedrich Nietzsche suggested that egoistic or \"life-affirming\" behavior stimulates jealousy or \"ressentiment\" in others, and that this is the psychological motive for the altruism in Christianity. Sociologist Helmut Schoeck similarly considered envy the motive of collective efforts by society to reduce the disproportionate gains of successful individuals through moral or legal constraints, with altruism being primary among these.Schoeck, Helmut, Der Neid. Eine Theorie der Gesellschaft (Envy. A Theory of Social Behaviour), 1966, 1st English ed. 1969.  In addition, Nietzsche (in Beyond Good and Evil) and Alasdair MacIntyre (in After Virtue) have pointed out that the ancient Greeks did not associate morality with altruism in the way that post-Christian Western civilization has done.\nAristotle's view is that we have duties to ourselves as well as to other people (e.g. friends) and to the polis as a whole. The same is true for Thomas Aquinas, Christian Wolff and Immanuel Kant, who claim that there are duties to ourselves as Aristotle did, although it has been argued that, for Aristotle, the duty to one's self is primary.Wheeler, Jack, \"Rand and Aristotle,\" in Den Uyl and Rasmussen, The Philosophic Thought of Ayn Rand, 1986.\n\nAyn Rand argued that there is a positive harmony of interests among free, rational humans, such that no moral agent can rationally coerce another person consistently with his own long-term self-interest. Rand argued that other people are an enormous value to an individual's well-being (through education, trade and affection), but also that this value could be fully realized only under conditions of political and economic freedom. According to Rand, voluntary trade alone can assure that human interaction is mutually beneficial.Rand, Ayn, The Virtue of Selfishness (1964). Rand's student, Leonard Peikoff has argued that the identification of one's interests itself is impossible absent the use of principles, and that self-interest cannot be consistently pursued absent a consistent adherence to certain ethical principles.Peikoff, Leonard, \"Why Should One Act on Principle?,\" The Objectivist Forum, 1988, originally delivered at the Ford Hall Forum. Recently, Rand's position has also been defended by such writers as Tara Smith, Tibor Machan, Allan Gotthelf, David Kelley, Douglas Rasmussen, Nathaniel Branden, Harry Binswanger, Andrew Bernstein, and Craig Biddle.\n\nPhilosopher David L. Norton identified himself an \"ethical individualist\", and, like Rand, saw a harmony between an individual's fidelity to his own self-actualization, or \"personal destiny\", and the achievement of society's well being.Norton, David, Personal Destinies: A Philosophy of Ethical Individualism, 1976, Princeton University Press.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ethical egoism" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9235" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ethical egoism  is the normative ethical position that moral agents ought to do what is in their own self-interest. It differs from psychological egoism, which claims that people can only act in their self-interest. Ethical egoism also differs from rational egoism, which holds that it is rational to act in one's self-interest.Sanders, Steven M. \"Is egoism morally defensible?\" Philosophia. Springer Netherlands. Volume 18, Numbers 2–3 / July 1988\nEthical egoism holds, therefore, that actions whose consequences will benefit the doer can be considered ethical in this sense.\n\nEthical egoism contrasts with ethical altruism, which holds that moral agents have an obligation to help others. Egoism and altruism both contrast with ethical utilitarianism, which holds that a moral agent should treat one's self (also known as the subject) with no higher regard than one has for others (as egoism does, by elevating self-interests and \"the self\" to a status not granted to others). But it also holds that one should not (as altruism does) sacrifice one's own interests to help others' interests, so long as one's own interests (i.e. one's own desires or well-being) are substantially equivalent to the others' interests and well-being. Egoism, utilitarianism, and altruism are all forms of consequentialism, but egoism and altruism contrast with utilitarianism, in that egoism and altruism are both agent-focused forms of consequentialism (i.e. subject-focused or subjective). However, utilitarianism is held to be agent-neutral (i.e. objective and impartial): it does not treat the subject's (i.e. the self's, i.e. the moral \"agent's\") own interests as being more or less important than the interests, desires, or well-being of others.\n\nEthical egoism does not, however, require moral agents to harm the interests and well-being of others when making moral deliberation; e.g. what is in an agent's self-interest may be incidentally detrimental, beneficial, or neutral in its effect on others. Individualism allows for others' interest and well-being to be disregarded or not, as long as what is chosen is efficacious in satisfying the self-interest of the agent. Nor does ethical egoism necessarily entail that, in pursuing self-interest, one ought always to do what one wants to do; e.g. in the long term, the fulfillment of short-term desires may prove detrimental to the self. Fleeting pleasure, then, takes a back seat to protracted eudaimonia. In the words of James Rachels, \"Ethical egoism ... endorses selfishness, but it doesn't endorse foolishness.\"Rachels 2008, p. 534.\n\nEthical egoism is often used as the philosophical basis for support of right-libertarianism and individualist anarchism. These are political positions based partly on a belief that individuals should not coercively prevent others from exercising freedom of action.\n\nForms\n\nEthical egoism can be broadly divided into three categories: individual, personal, and universal. An individual ethical egoist would hold that all people should do whatever benefits \"my\" (the individual) self-interest; a personal ethical egoist would hold that he or she should act in his or her self-interest, but would make no claims about what anyone else ought to do; a universal ethical egoist would argue that everyone should act in ways that are in their self-interest.Waller (2005), p. 81.Waller (2005), p. 83.\n\nHistory\n\nEthical egoism was introduced by the philosopher Henry Sidgwick in his book The Methods of Ethics, written in 1874. Sidgwick compared egoism to the philosophy of utilitarianism, writing that whereas utilitarianism sought to maximize overall pleasure, egoism focused only on maximizing individual pleasure.\n\nPhilosophers before Sidgwick have also retroactively been identified as ethical egoists. One ancient example is the philosophy of Yang Zhu (4th century BC), Yangism, who views wei wo, or \"everything for myself\", as the only virtue necessary for self-cultivation. Ancient Greek philosophers like Plato, Aristotle and the Stoics were exponents of virtue ethics, and \"did not accept the formal principle that whatever the good is, we should seek only our own good, or prefer it to the good of others.\" However, the beliefs of the Cyrenaics have been referred to as a \"form of egoistic hedonism\",[http://www.iep.utm.edu/cyren/ Internet Encyclopedia of Philosophy: Cyrenaics] and while some refer to Epicurus' hedonism as a form of virtue ethics, others argue his ethics are more properly described as ethical egoism.\n\nJustifications\n\nPhilosopher James Rachels, in an essay that takes as its title the theory's name, outlines the three arguments most commonly touted in its favor:He notes, however, that \"the theory is asserted more often than it is argued for. Many of its supporters apparently think its truth is self-evident, so that arguments are not needed.\" (Rachels 2008, p. 534.)\n\n*\"The first argument,\" writes Rachels, \"has several variations, each suggesting the same general point:That is, that regarding and pursuing the interests of others is a self-defeating policy. Rachels quotes Alexander Pope in support of this: \"Thus God and nature formed the general frame/And bade self-love and social be the same.\"\n**\"Each of us is intimately familiar with our own individual wants and needs. Moreover, each of us is uniquely placed to pursue those wants and needs effectively. At the same time, we know the desires and needs of others only imperfectly, and we are not well situated to pursue them. Therefore, it is reasonable to believe that if we set out to be 'our brother's keeper,' we would often bungle the job and end up doing more mischief than good.\"\n**To give charity to someone is to degrade him, implying as it does that he is reliant on such munificence and quite unable to look out for himself. \"That,\" reckons Rachels, \"is why the recipients of 'charity' are so often resentful rather than appreciative.\"Rachels 2008, p. 534, where it is pointed out that, in the strictest egoistic terms, this is an inconsequential argument. Ethical egoism does not bother itself with how others receive charity, irrespective of how degraded it makes them feel. The same reasoning applies to the previous two bullets, which use self-interest as a means to the end of beneficence, rather than for its own purposes, as the theory would dictate.\n*Altruism, ultimately, denies an individual's value and is therefore destructive both to society and its individual components, viewing life merely as a thing to be sacrificed. Philosopher Ayn Rand is quoted as writing that, \"[i]f a man accepts the ethics of altruism, his first concern is not how to live his life but how to sacrifice it.\"Rachels 2008, p. 535, where this argument is attributed to Ayn Rand, \"a writer little heeded by professional philosophers but who nevertheless was enormously popular on college campuses in the 1960s and 1970s\". Moreover, \"[t]he basic principle of altruism is that man has no right to exist for his own sake, that service to others is the only justification for his existence, and that self-sacrifice is his highest moral duty, virtue or value.\" Rather, she writes, \"[t]he purpose of morality is to teach you, not to suffer and die, but to enjoy yourself and live.\"Rand, Ayn, \"Faith and Force: Destroyers of the Modern World,\" Philosophy: Who Needs It, p. 74; Atlas Shrugged, 1957, Random House, p. 1014; \"Faith and Force,\" p. 74.\n*All of our commonly accepted moral duties, from doing no harm unto others to speaking always the truth to keeping promises, are rooted in the one fundamental principle of self-interest.\n*It has been observed, however, that the very act of eating (especially, when there are others starving in the world) is such an act of self-interested discrimination. Ethical egoists such as Rand who readily acknowledge the (conditional) value of others to an individual, and who readily endorse empathy for others, have argued the exact reverse from Rachels, that it is altruism which discriminates: \"If the sensation of eating a cake is a value, then why is it an immoral indulgence in your stomach, but a moral goal for you to achieve in the stomach of others?\"Rand, Ayn, Atlas Shrugged, 1957, Random House. It is therefore altruism which is an arbitrary position, according to Rand.\n\nNotable proponents\n\nThe term ethical egoism has been applied retroactively to philosophers such as Bernard de Mandeville and to many other materialists of his generation, although none of them declared themselves to be egoists. Note that materialism does not necessarily imply egoism, as indicated by Karl Marx, and the many other materialists who espoused forms of collectivism. It has been argued that ethical egoism can lend itself to individualist anarchism such as that of Benjamin Tucker, or the combined anarcho-communism and egoism of Emma Goldman, both of whom were proponents of many egoist ideas put forward by Max Stirner. In this context, egoism is another way of describing the sense that the common good should be enjoyed by all. However, most notable anarchists in history have been less radical, retaining altruism and a sense of the importance of the individual that is appreciable but does not go as far as egoism. Recent trends to greater appreciation of egoism within anarchism tend to come from less classical directions such as post-left anarchy or Situationism (e.g. Raoul Vaneigem). Egoism has also been referenced by anarcho-capitalists, such as Murray Rothbard.\n\nPhilosopher Max Stirner, in his book The Ego and Its Own, was the first philosopher to call himself an egoist, though his writing makes clear that he desired not a new idea of morality (ethical egoism), but rather a rejection of morality (amoralism), as a nonexistent and limiting \"spook\"; for this, Stirner has been described as the first individualist anarchist. Other philosophers, such as Thomas Hobbes and David Gauthier, have argued that the conflicts which arise when people each pursue their own ends can be resolved for the best of each individual only if they all voluntarily forgo some of their aims—that is, one's self-interest is often best pursued by allowing others to pursue their self-interest as well so that liberty is equal among individuals. Sacrificing one's short-term self-interest to maximize one's long-term self-interest is one form of \"rational self-interest\" which is the idea behind most philosophers' advocacy of ethical egoism. Egoists have also argued that one's actual interests are not immediately obvious, and that the pursuit of self-interest involves more than merely the acquisition of some good, but the maximizing of one's chances of survival and/or happiness.\n\nPhilosopher Friedrich Nietzsche suggested that egoistic or \"life-affirming\" behavior stimulates jealousy or \"ressentiment\" in others, and that this is the psychological motive for the altruism in Christianity. Sociologist Helmut Schoeck similarly considered envy the motive of collective efforts by society to reduce the disproportionate gains of successful individuals through moral or legal constraints, with altruism being primary among these.Schoeck, Helmut, Der Neid. Eine Theorie der Gesellschaft (Envy. A Theory of Social Behaviour), 1966, 1st English ed. 1969.  In addition, Nietzsche (in Beyond Good and Evil) and Alasdair MacIntyre (in After Virtue) have pointed out that the ancient Greeks did not associate morality with altruism in the way that post-Christian Western civilization has done.\nAristotle's view is that we have duties to ourselves as well as to other people (e.g. friends) and to the polis as a whole. The same is true for Thomas Aquinas, Christian Wolff and Immanuel Kant, who claim that there are duties to ourselves as Aristotle did, although it has been argued that, for Aristotle, the duty to one's self is primary.Wheeler, Jack, \"Rand and Aristotle,\" in Den Uyl and Rasmussen, The Philosophic Thought of Ayn Rand, 1986.\n\nAyn Rand argued that there is a positive harmony of interests among free, rational humans, such that no moral agent can rationally coerce another person consistently with his own long-term self-interest. Rand argued that other people are an enormous value to an individual's well-being (through education, trade and affection), but also that this value could be fully realized only under conditions of political and economic freedom. According to Rand, voluntary trade alone can assure that human interaction is mutually beneficial.Rand, Ayn, The Virtue of Selfishness (1964). Rand's student, Leonard Peikoff has argued that the identification of one's interests itself is impossible absent the use of principles, and that self-interest cannot be consistently pursued absent a consistent adherence to certain ethical principles.Peikoff, Leonard, \"Why Should One Act on Principle?,\" The Objectivist Forum, 1988, originally delivered at the Ford Hall Forum. Recently, Rand's position has also been defended by such writers as Tara Smith, Tibor Machan, Allan Gotthelf, David Kelley, Douglas Rasmussen, Nathaniel Branden, Harry Binswanger, Andrew Bernstein, and Craig Biddle.\n\nPhilosopher David L. Norton identified himself an \"ethical individualist\", and, like Rand, saw a harmony between an individual's fidelity to his own self-actualization, or \"personal destiny\", and the achievement of society's well being.Norton, David, Personal Destinies: A Philosophy of Ethical Individualism, 1976, Princeton University Press. Ethical egoism. http://en.wikipedia.org/?curid=9235."
  }
}
