{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4113",
  "eid" : "cb54c720-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778420882,
  "textBody" : "Bouldering is a form of rock climbing that is performed on small rock formations or artificial rock walls, known as boulders, without the use of ropes or harnesses. While it can be done without any equipment, most climbers use climbing shoes to help secure footholds, chalk to keep their hands dry and provide a firmer grip, and bouldering mats to prevent injuries from falls. Unlike free solo climbing, which is also performed without ropes, bouldering problems (the path that a climber takes to complete the climb) are usually less than 6 meters (20 ft.) tall. Traverses, which are a form of boulder problem, require the climber to climb horizontally from one position to another.  Artificial climbing walls allow boulderers to train indoors in areas without natural boulders. In addition, Bouldering competitions take place in both indoor and outdoor settings.See [http://www.stonecountry.co.uk/page11.html The Boulder: A Philosophy for Bouldering (Stone Country Press] , by Francis Sanzaro, for a more on bouldering movement, and its relation to other sports. I also found [https://drive.google.com/file/d/0By3ygZspcP4WcDZsYnU2alpRLUk/edit this article] from Sanzaro on bouldering philosophy and landscape, called \"[https://drive.google.com/file/d/0By3ygZspcP4WcDZsYnU2alpRLUk/edit When the Earth Enters You - Movement Aesthetics].\"\n\nThe sport originally was a method of training for roped climbs and mountaineering, so climbers could practice specific moves at a safe distance from the ground. Additionally, the sport served to build stamina and increase finger strength.  Throughout the 1900s, bouldering evolved into a separate discipline. Individual problems are assigned ratings based on difficulty. Although there have been various rating systems used throughout the history of bouldering, modern problems usually use either the V-scale or the Fontainebleau scale.\n\nThe growing popularity of bouldering has caused several environmental concerns, including soil erosion and trampled vegetation as climbers hike off-trail to reach bouldering sites. This has caused some landowners to restrict access or prohibit bouldering altogether.\n\nOutdoor bouldering \n\nThe characteristics of boulder problems depend largely on the type of rock being climbed. For example, Granite often features long cracks and slabs while Sandstone rocks are known for their steep overhangs and frequent horizontal breaks. Limestone and volcanic rock are also used for bouldering.\n\nThere are many prominent bouldering areas throughout the United States, including Hueco Tanks in Texas, Mount Evans in Colorado, and The Buttermilks in Bishop, California. Squamish, British Columbia is one of the most popular bouldering areas in Canada. Europe also hosts a number of bouldering sites, such as Fontainebleau in France, Albarracín in Spain, and various mountains throughout Switzerland. Africa's most prominent bouldering areas are the more established Rocklands in South-Africa and the new kid on the block Oukaimeden in Morocco or recently opened areas like Chimanimani in Zimbabwe. \n\nIndoor bouldering \n\nArtificial climbing walls are used to simulate boulder problems in an indoor environment, usually at climbing gyms. These walls are constructed with wooden panels, polymer cement panels, concrete shells, or precast molds of actual rock walls. Holds, usually made of plastic, are then bolted onto the wall to create problems. The walls often feature steep overhanging surfaces which force the climber to employ highly technical movements while supporting much of their weight with their upper body strength.\n\nClimbing gyms often feature multiple problems within the same section of wall. In the US the most common method Routesetters use to designate the intended problem is by placing colored tape next to each hold. For example, red tape would indicate one bouldering problem while green tape would be used to set a different problem in the same area. Across much of the rest of the world problems and grades are usually designated using a set color of plastic hold to indicate problems. For example, green may be v0-v1, blue may be v2-v3 and so on. Using colored holds to set has certain advantages, the most notable of which are that it makes it more obvious where the holds for a problem are, and that there is no chance of tape being accidentally kicked off footholds. Smaller, resource-poor climbing gyms may prefer taped problems because large, expensive holds can be used in multiple routes by marking them with more than one color of tape.\n\nCompetitions \n\nThe International Federation of Sport Climbing (IFSC) employs an indoor format– although competitions can also take place in an outdoor setting– that breaks the competition into three rounds: qualifications, semi-finals, and finals. The rounds feature different sets of four or five boulder problems, and each competitor has a fixed amount of time to attempt each problem. At the end of each round, competitors are ranked by the number of completed problems with ties settled by the total number of attempts taken to solve the problems.\n\nSome competitions only permit climbers a fixed number of attempts at each problem with a timed rest period in between.\n In an open-format competition, all climbers compete simultaneously, and are given a fixed amount of time to complete as many problems as possible. More points are awarded for more difficult problems, while points are deducted for multiple attempts on the same problem.\n\nIn 2012, the IFSC submitted a proposal to the International Olympic Committee (IOC) to include lead climbing in the 2020 Summer Olympics. The proposal was later revised to an \"overall\" competition, which would feature bouldering, lead climbing, and speed climbing. In May 2013, the IOC announced that climbing would not be added to the 2020 Olympic program.\n\nIn 2016, the International Olympic Committee (IOC) officially approved climbing as an Olympic sport \"in order to appeal to younger audiences.\" The Olympics will feature the earlier proposed overall competition. Medalists will be competing in all three categories for a best overall score.Corrigan, Kevin. http://www.climbing.com/news/climbing-officially-approved-for-2020-olympics/ N.p., 3 Aug. 2016. Web. 12 Nov. 2016.\n\nHistory \n\nRock climbing first appeared as a sport in the late-1800s. Early records describe climbers engaging in what is now referred to as bouldering, not as a separate discipline, but as a playful form of training for larger ascents The Origins of Bouldering. http://www.johngill.net. In the early 20th century, the Fontainebleau area of France established itself as a prominent climbing area, where some of the first dedicated bleausards (or \"boulderers\") emerged. One of those athletes, Pierre Allain, invented the specialized shoe used for rock climbing.\n\nIn the 1960s, American mathematician John Gill pushed the sport further and contributed several important innovations. Gill previously pursued gymnastics, a sport which had an established scale of difficulty for movements and body positions, and shifted the focus of bouldering from reaching the summit to navigating a set of holds. Gill developed a rating system that was closed-ended: B1 problems were as difficult as the most challenging roped routes of the time, B2 problems were more difficult, and B3 problems had been completed once.\n\nGill introduced chalk as a method of keeping the climber's hands dry, promoted a dynamic climbing style, and emphasized the importance of strength training to complement skill.For more on Gill's bouldering philosophy, see [http://www.stonecountry.co.uk/page11.html The Boulder: A Philosophy for Bouldering (Stone Country Press] , by Francis Sanzaro (Stone Country press, 2013). These practices had not been popular among climbers, but as Gill improved in ability and influence, his ideas became the norm.\n\nIn the 1980s, two important training tools emerged. One important training tool was bouldering mats , also referred to as \"crash pads\", which prevented injuries from falling and enabled boulderers to climb in areas that would have been too dangerous otherwise. The second important tool was indoor climbing walls, which helped spread the sport to areas without outdoor climbing and allowed serious climbers to train year-round.\n\nAs the sport grew in popularity, new bouldering areas were developed throughout Europe and the United States, and more athletes began participating in bouldering competitions. The visibility of the sport greatly increased in the early 2000s, as YouTube videos and climbing blogs helped boulderers around the world to quickly learn techniques, find hard problems, and announce newly completed projects.\n\nNotable ascents \n\n (unconfirmed):\n*Burden of Dreams - Lappnor (Finland|) - October 2016 - Grade proposed by Nalle Hukkataival after several years of trials. During these years, Hukkataival \"very quickly\" solved several 8C and 8C+ boulder problems throughout the world, including Gioia (see below). Compared to these other problems, Burden of Dreams felt \"way way harder\". \n\n:* Gioia - Varezze (ITA) - 2008 - First ascent by Italian boulderer Christian Core, who first proposed 8C, \"to play things safe\". In 2011, Adam Ondra repeated the ascent and wholeheartedly proposed the 8C+ grade, describing the boulder as one of the hardest in the world, together with Terranova (see below). \n* Terranova - Holstejn (Moravsky Kras, CZE) - 10 November 2011 - First ascent by Adam Ondra. \n\n:* The story of two worlds - Cresciano (SUI) - January 2005 - First confirmed 8C in history, by Dave Graham.\n Five years earlier, Fred Nicole had proposed 8C for Dreamtime, on the other side of the same boulder, but most repeaters downgraded it to 8b+ (see below).\n* The Game - Boulder, Colorado (USA) - 2010 - First ascent by Daniel Woods, who originally graded it . Second ascent in 2013 by Carlo Traversi, who proposed .\n* Lucid Dreaming - Bishop, California (USA) - 2010 - First ascent by Paul Robinson, who initially graded it , and later downgraded it. In 2010, together with The game (see above), this was considered to be one of the world's most challenging boulders. Second ascent by Daniel Woods, who confirmed the  grade.\n\n:* Dreamtime - Cresciano (SUI) - October 28, 2000 - First ascent by Fred Nicole, who proposed an 8C rating, making it the first unconfirmed 8C boulder in history. In 2002, Dave Graham repeated it by finding a different solution. He used a heel-hook to make the brutal start sequence easier, and downgraded the problem to easy 8b+. Most of the following repeaters, including Adam Ondra, Chris Sharma, and Daniel Woods adopted Graham's solution and agreed with him about the grade. Notable exceptions are Jan Hojer and Christian Core, who confirmed the 8C rating.[https://www.8a.nu/?IncPage\nhttps%3A%2F%2Fwww.8a.nu%2Fuser%2FProfile.aspx%3FUserId%3D16898 Hojer Comments about Dreamtime on 8a.nu]\n\n:* Midnight Lightning - Camp 4 (Yosemite National Park, USA) - 1978 - First ascent by Ron Kauk. First female ascent by Lynn Hill, 1998.\n\n Thirtynine years after its solution, it has been described as one of the world's most famous bouldering problems, together with Dreamtime (see above).\n\nEquipment \n\nUnlike other climbing sports, bouldering can be performed safely and effectively with very little equipment, an aspect which makes the discipline highly appealing, but opinions differ. While bouldering pioneer John Sherman asserted that \"The only gear really needed to go bouldering is boulders\", others suggest the use of climbing shoes and a chalkbag- a small pouch were ground-up chalk is kept- as the bare minimum, and more experienced boulderers typically bring multiple pairs of shoes, chalk, brushes, crash pads, and a skincare kit. \n\nClimbing shoes have the most direct impact on performance. Besides protecting the climber's feet from rough surfaces, climbing shoes are designed to help the climber secure footholds. Climbing shoes typically fit much tighter than other athletic footwear and often curl the toes downwards to enable precise footwork. They are manufactured in a variety of different styles to perform in different situations. For example, High-top shoes provide better protection for the ankle, while low-top shoes provide greater flexibility and freedom of movement. Stiffer shoes excel at securing small edges, whereas softer shoes provide greater sensitivity. The front of the shoe, called the \"toe box\", can be asymmetric, which performs well on overhanging rocks, or symmetric, which is better suited for vertical problems and slabs.  \n\nMost boulderers use gymnastics chalk on their hands to absorb sweat which is stored in a chalkbag which can be tied around the waist, allowing the climber to reapply chalk during the climb. Brushes are used to remove excess chalk and debris from boulders in between climbs; they are often attached to the end of a long straight object in order to reach higher holds. Crash pads, also referred to as bouldering mats, are foam cushions placed on the ground to protect climbers from falls.\n\nSafety \n\nBoulder problems are generally shorter than 20 ft from ground to top. This makes the sport significantly safer than free solo climbing, which is also performed without ropes, but with no upper limit on the height of the climb. However, minor injuries are common in bouldering, particularly sprained ankles and wrists. Two factors contribute to the frequency of injuries in bouldering: first, boulder problems typically feature more difficult moves than other climbing disciplines, making falls more common. Second, without ropes to arrest the climber's descent, every fall will cause the climber to hit the ground.\n\nTo prevent injuries, boulderers position crash pads near the boulder to provide a softer landing, as well as one or more spotters to help redirect the climber towards the pads. Upon landing, boulderers employ falling techniques similar to those used in gymnastics: spreading the impact across the entire body to avoid bone fractures, and positioning limbs to allow joints to move freely throughout the impact.\n\nTechnique \n\nAs with other forms of climbing, bouldering technique is largely centered on proper footwork. Leg muscles are significantly stronger than arm muscles; thus, proficient boulderers use their arms primarily to maintain balance and body positioning, relying on their legs to push them up the boulder. Boulderers also keep their arms straight whenever possible, allowing their bones to support their body weight rather than their muscles.\n\nBouldering movements are described as either \"static\" or \"dynamic\". Static movements are those that are performed slowly, with the climber's position controlled by maintaining contact on the boulder with the other three limbs. Dynamic movements use the climber's momentum to reach holds that would be difficult or impossible to secure statically, with an increased risk of falling if the movement is not performed accurately.\n\nGrading \n\nBouldering problems are assigned numerical difficulty ratings by routesetters and climbers. The two most widely used rating systems are the V-scale and the Fontainebleau system.\n\nThe V-scale, which originated in the United States, is an open-ended rating system with higher numbers indicating a higher degree of difficulty. The V1 rating indicates that a problem can be completed by a novice climber in good physical condition after several attempts. The scale begins at V0, and as of 2013, the highest V rating that has been assigned to a bouldering problem is V17.http://www.planetmountain.com/en/news/climbing/nalle-hukkataival-climbs-burden-of-dreams-and-proposes-worlds-first-9a-boulder-problem.html Some climbing gyms also use a VB grade to indicate beginner problems.\n\nThe Fontainebleau scale follows a similar system, with each numerical grade divided into three ratings with the letters a, b, and c. For example, Fontainebleau 7A roughly corresponds with V6, while Fontainebleau 7C+ is equivalent to V10. In both systems, grades are further differentiated by appending \"+\" to indicate a small increase in difficulty. Despite this level of specificity, ratings of individual problems are often controversial, as ability level is not the only factor that affects how difficult a problem will be for a particular climber. Height, arm length, flexibility, and other body characteristics can also be relevant.\n\nEnvironmental impact \n\nBouldering can damage vegetation that grows on rocks, such as mosses and lichens. This can occur as a result of the climber intentionally cleaning the boulder, or unintentionally from repeated use of handholds and footholds. Vegetation on the ground surrounding the boulder can also be damaged from overuse, particularly by climbers laying down crash pads. Soil erosion can occur when boulderers trample vegetation while hiking off of established trails, or when they unearth small rocks near the boulder in an effort to make the landing zone safer. The repeated use of white climbing chalk can damage the rock surface of boulders and cliffs, particularly sandstone and other porous rock types, and the scrubbing of rocks to remove chalk can also degrade the rock surface. Other environmental concerns include littering, improperly disposed feces, and graffiti. These issues have caused some land managers to prohibit bouldering, as was the case in Tea Garden, a popular bouldering area in Rocklands, South Africa.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bouldering" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4113" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Bouldering is a form of rock climbing that is performed on small rock formations or artificial rock walls, known as boulders, without the use of ropes or harnesses. While it can be done without any equipment, most climbers use climbing shoes to help secure footholds, chalk to keep their hands dry and provide a firmer grip, and bouldering mats to prevent injuries from falls. Unlike free solo climbing, which is also performed without ropes, bouldering problems (the path that a climber takes to complete the climb) are usually less than 6 meters (20 ft.) tall. Traverses, which are a form of boulder problem, require the climber to climb horizontally from one position to another.  Artificial climbing walls allow boulderers to train indoors in areas without natural boulders. In addition, Bouldering competitions take place in both indoor and outdoor settings.See [http://www.stonecountry.co.uk/page11.html The Boulder: A Philosophy for Bouldering (Stone Country Press] , by Francis Sanzaro, for a more on bouldering movement, and its relation to other sports. I also found [https://drive.google.com/file/d/0By3ygZspcP4WcDZsYnU2alpRLUk/edit this article] from Sanzaro on bouldering philosophy and landscape, called \"[https://drive.google.com/file/d/0By3ygZspcP4WcDZsYnU2alpRLUk/edit When the Earth Enters You - Movement Aesthetics].\"\n\nThe sport originally was a method of training for roped climbs and mountaineering, so climbers could practice specific moves at a safe distance from the ground. Additionally, the sport served to build stamina and increase finger strength.  Throughout the 1900s, bouldering evolved into a separate discipline. Individual problems are assigned ratings based on difficulty. Although there have been various rating systems used throughout the history of bouldering, modern problems usually use either the V-scale or the Fontainebleau scale.\n\nThe growing popularity of bouldering has caused several environmental concerns, including soil erosion and trampled vegetation as climbers hike off-trail to reach bouldering sites. This has caused some landowners to restrict access or prohibit bouldering altogether.\n\nOutdoor bouldering \n\nThe characteristics of boulder problems depend largely on the type of rock being climbed. For example, Granite often features long cracks and slabs while Sandstone rocks are known for their steep overhangs and frequent horizontal breaks. Limestone and volcanic rock are also used for bouldering.\n\nThere are many prominent bouldering areas throughout the United States, including Hueco Tanks in Texas, Mount Evans in Colorado, and The Buttermilks in Bishop, California. Squamish, British Columbia is one of the most popular bouldering areas in Canada. Europe also hosts a number of bouldering sites, such as Fontainebleau in France, Albarracín in Spain, and various mountains throughout Switzerland. Africa's most prominent bouldering areas are the more established Rocklands in South-Africa and the new kid on the block Oukaimeden in Morocco or recently opened areas like Chimanimani in Zimbabwe. \n\nIndoor bouldering \n\nArtificial climbing walls are used to simulate boulder problems in an indoor environment, usually at climbing gyms. These walls are constructed with wooden panels, polymer cement panels, concrete shells, or precast molds of actual rock walls. Holds, usually made of plastic, are then bolted onto the wall to create problems. The walls often feature steep overhanging surfaces which force the climber to employ highly technical movements while supporting much of their weight with their upper body strength.\n\nClimbing gyms often feature multiple problems within the same section of wall. In the US the most common method Routesetters use to designate the intended problem is by placing colored tape next to each hold. For example, red tape would indicate one bouldering problem while green tape would be used to set a different problem in the same area. Across much of the rest of the world problems and grades are usually designated using a set color of plastic hold to indicate problems. For example, green may be v0-v1, blue may be v2-v3 and so on. Using colored holds to set has certain advantages, the most notable of which are that it makes it more obvious where the holds for a problem are, and that there is no chance of tape being accidentally kicked off footholds. Smaller, resource-poor climbing gyms may prefer taped problems because large, expensive holds can be used in multiple routes by marking them with more than one color of tape.\n\nCompetitions \n\nThe International Federation of Sport Climbing (IFSC) employs an indoor format– although competitions can also take place in an outdoor setting– that breaks the competition into three rounds: qualifications, semi-finals, and finals. The rounds feature different sets of four or five boulder problems, and each competitor has a fixed amount of time to attempt each problem. At the end of each round, competitors are ranked by the number of completed problems with ties settled by the total number of attempts taken to solve the problems.\n\nSome competitions only permit climbers a fixed number of attempts at each problem with a timed rest period in between.\n In an open-format competition, all climbers compete simultaneously, and are given a fixed amount of time to complete as many problems as possible. More points are awarded for more difficult problems, while points are deducted for multiple attempts on the same problem.\n\nIn 2012, the IFSC submitted a proposal to the International Olympic Committee (IOC) to include lead climbing in the 2020 Summer Olympics. The proposal was later revised to an \"overall\" competition, which would feature bouldering, lead climbing, and speed climbing. In May 2013, the IOC announced that climbing would not be added to the 2020 Olympic program.\n\nIn 2016, the International Olympic Committee (IOC) officially approved climbing as an Olympic sport \"in order to appeal to younger audiences.\" The Olympics will feature the earlier proposed overall competition. Medalists will be competing in all three categories for a best overall score.Corrigan, Kevin. http://www.climbing.com/news/climbing-officially-approved-for-2020-olympics/ N.p., 3 Aug. 2016. Web. 12 Nov. 2016.\n\nHistory \n\nRock climbing first appeared as a sport in the late-1800s. Early records describe climbers engaging in what is now referred to as bouldering, not as a separate discipline, but as a playful form of training for larger ascents The Origins of Bouldering. http://www.johngill.net. In the early 20th century, the Fontainebleau area of France established itself as a prominent climbing area, where some of the first dedicated bleausards (or \"boulderers\") emerged. One of those athletes, Pierre Allain, invented the specialized shoe used for rock climbing.\n\nIn the 1960s, American mathematician John Gill pushed the sport further and contributed several important innovations. Gill previously pursued gymnastics, a sport which had an established scale of difficulty for movements and body positions, and shifted the focus of bouldering from reaching the summit to navigating a set of holds. Gill developed a rating system that was closed-ended: B1 problems were as difficult as the most challenging roped routes of the time, B2 problems were more difficult, and B3 problems had been completed once.\n\nGill introduced chalk as a method of keeping the climber's hands dry, promoted a dynamic climbing style, and emphasized the importance of strength training to complement skill.For more on Gill's bouldering philosophy, see [http://www.stonecountry.co.uk/page11.html The Boulder: A Philosophy for Bouldering (Stone Country Press] , by Francis Sanzaro (Stone Country press, 2013). These practices had not been popular among climbers, but as Gill improved in ability and influence, his ideas became the norm.\n\nIn the 1980s, two important training tools emerged. One important training tool was bouldering mats , also referred to as \"crash pads\", which prevented injuries from falling and enabled boulderers to climb in areas that would have been too dangerous otherwise. The second important tool was indoor climbing walls, which helped spread the sport to areas without outdoor climbing and allowed serious climbers to train year-round.\n\nAs the sport grew in popularity, new bouldering areas were developed throughout Europe and the United States, and more athletes began participating in bouldering competitions. The visibility of the sport greatly increased in the early 2000s, as YouTube videos and climbing blogs helped boulderers around the world to quickly learn techniques, find hard problems, and announce newly completed projects.\n\nNotable ascents \n\n (unconfirmed):\n*Burden of Dreams - Lappnor (Finland|) - October 2016 - Grade proposed by Nalle Hukkataival after several years of trials. During these years, Hukkataival \"very quickly\" solved several 8C and 8C+ boulder problems throughout the world, including Gioia (see below). Compared to these other problems, Burden of Dreams felt \"way way harder\". \n\n:* Gioia - Varezze (ITA) - 2008 - First ascent by Italian boulderer Christian Core, who first proposed 8C, \"to play things safe\". In 2011, Adam Ondra repeated the ascent and wholeheartedly proposed the 8C+ grade, describing the boulder as one of the hardest in the world, together with Terranova (see below). \n* Terranova - Holstejn (Moravsky Kras, CZE) - 10 November 2011 - First ascent by Adam Ondra. \n\n:* The story of two worlds - Cresciano (SUI) - January 2005 - First confirmed 8C in history, by Dave Graham.\n Five years earlier, Fred Nicole had proposed 8C for Dreamtime, on the other side of the same boulder, but most repeaters downgraded it to 8b+ (see below).\n* The Game - Boulder, Colorado (USA) - 2010 - First ascent by Daniel Woods, who originally graded it . Second ascent in 2013 by Carlo Traversi, who proposed .\n* Lucid Dreaming - Bishop, California (USA) - 2010 - First ascent by Paul Robinson, who initially graded it , and later downgraded it. In 2010, together with The game (see above), this was considered to be one of the world's most challenging boulders. Second ascent by Daniel Woods, who confirmed the  grade.\n\n:* Dreamtime - Cresciano (SUI) - October 28, 2000 - First ascent by Fred Nicole, who proposed an 8C rating, making it the first unconfirmed 8C boulder in history. In 2002, Dave Graham repeated it by finding a different solution. He used a heel-hook to make the brutal start sequence easier, and downgraded the problem to easy 8b+. Most of the following repeaters, including Adam Ondra, Chris Sharma, and Daniel Woods adopted Graham's solution and agreed with him about the grade. Notable exceptions are Jan Hojer and Christian Core, who confirmed the 8C rating.[https://www.8a.nu/?IncPage\nhttps%3A%2F%2Fwww.8a.nu%2Fuser%2FProfile.aspx%3FUserId%3D16898 Hojer Comments about Dreamtime on 8a.nu]\n\n:* Midnight Lightning - Camp 4 (Yosemite National Park, USA) - 1978 - First ascent by Ron Kauk. First female ascent by Lynn Hill, 1998.\n\n Thirtynine years after its solution, it has been described as one of the world's most famous bouldering problems, together with Dreamtime (see above).\n\nEquipment \n\nUnlike other climbing sports, bouldering can be performed safely and effectively with very little equipment, an aspect which makes the discipline highly appealing, but opinions differ. While bouldering pioneer John Sherman asserted that \"The only gear really needed to go bouldering is boulders\", others suggest the use of climbing shoes and a chalkbag- a small pouch were ground-up chalk is kept- as the bare minimum, and more experienced boulderers typically bring multiple pairs of shoes, chalk, brushes, crash pads, and a skincare kit. \n\nClimbing shoes have the most direct impact on performance. Besides protecting the climber's feet from rough surfaces, climbing shoes are designed to help the climber secure footholds. Climbing shoes typically fit much tighter than other athletic footwear and often curl the toes downwards to enable precise footwork. They are manufactured in a variety of different styles to perform in different situations. For example, High-top shoes provide better protection for the ankle, while low-top shoes provide greater flexibility and freedom of movement. Stiffer shoes excel at securing small edges, whereas softer shoes provide greater sensitivity. The front of the shoe, called the \"toe box\", can be asymmetric, which performs well on overhanging rocks, or symmetric, which is better suited for vertical problems and slabs.  \n\nMost boulderers use gymnastics chalk on their hands to absorb sweat which is stored in a chalkbag which can be tied around the waist, allowing the climber to reapply chalk during the climb. Brushes are used to remove excess chalk and debris from boulders in between climbs; they are often attached to the end of a long straight object in order to reach higher holds. Crash pads, also referred to as bouldering mats, are foam cushions placed on the ground to protect climbers from falls.\n\nSafety \n\nBoulder problems are generally shorter than 20 ft from ground to top. This makes the sport significantly safer than free solo climbing, which is also performed without ropes, but with no upper limit on the height of the climb. However, minor injuries are common in bouldering, particularly sprained ankles and wrists. Two factors contribute to the frequency of injuries in bouldering: first, boulder problems typically feature more difficult moves than other climbing disciplines, making falls more common. Second, without ropes to arrest the climber's descent, every fall will cause the climber to hit the ground.\n\nTo prevent injuries, boulderers position crash pads near the boulder to provide a softer landing, as well as one or more spotters to help redirect the climber towards the pads. Upon landing, boulderers employ falling techniques similar to those used in gymnastics: spreading the impact across the entire body to avoid bone fractures, and positioning limbs to allow joints to move freely throughout the impact.\n\nTechnique \n\nAs with other forms of climbing, bouldering technique is largely centered on proper footwork. Leg muscles are significantly stronger than arm muscles; thus, proficient boulderers use their arms primarily to maintain balance and body positioning, relying on their legs to push them up the boulder. Boulderers also keep their arms straight whenever possible, allowing their bones to support their body weight rather than their muscles.\n\nBouldering movements are described as either \"static\" or \"dynamic\". Static movements are those that are performed slowly, with the climber's position controlled by maintaining contact on the boulder with the other three limbs. Dynamic movements use the climber's momentum to reach holds that would be difficult or impossible to secure statically, with an increased risk of falling if the movement is not performed accurately.\n\nGrading \n\nBouldering problems are assigned numerical difficulty ratings by routesetters and climbers. The two most widely used rating systems are the V-scale and the Fontainebleau system.\n\nThe V-scale, which originated in the United States, is an open-ended rating system with higher numbers indicating a higher degree of difficulty. The V1 rating indicates that a problem can be completed by a novice climber in good physical condition after several attempts. The scale begins at V0, and as of 2013, the highest V rating that has been assigned to a bouldering problem is V17.http://www.planetmountain.com/en/news/climbing/nalle-hukkataival-climbs-burden-of-dreams-and-proposes-worlds-first-9a-boulder-problem.html Some climbing gyms also use a VB grade to indicate beginner problems.\n\nThe Fontainebleau scale follows a similar system, with each numerical grade divided into three ratings with the letters a, b, and c. For example, Fontainebleau 7A roughly corresponds with V6, while Fontainebleau 7C+ is equivalent to V10. In both systems, grades are further differentiated by appending \"+\" to indicate a small increase in difficulty. Despite this level of specificity, ratings of individual problems are often controversial, as ability level is not the only factor that affects how difficult a problem will be for a particular climber. Height, arm length, flexibility, and other body characteristics can also be relevant.\n\nEnvironmental impact \n\nBouldering can damage vegetation that grows on rocks, such as mosses and lichens. This can occur as a result of the climber intentionally cleaning the boulder, or unintentionally from repeated use of handholds and footholds. Vegetation on the ground surrounding the boulder can also be damaged from overuse, particularly by climbers laying down crash pads. Soil erosion can occur when boulderers trample vegetation while hiking off of established trails, or when they unearth small rocks near the boulder in an effort to make the landing zone safer. The repeated use of white climbing chalk can damage the rock surface of boulders and cliffs, particularly sandstone and other porous rock types, and the scrubbing of rocks to remove chalk can also degrade the rock surface. Other environmental concerns include littering, improperly disposed feces, and graffiti. These issues have caused some land managers to prohibit bouldering, as was the case in Tea Garden, a popular bouldering area in Rocklands, South Africa. Bouldering. http://en.wikipedia.org/?curid=4113."
  }
}
