{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8099",
  "eid" : "e593ae30-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778464915,
  "textBody" : "David Eric Grohl (born January 14, 1969) is an American musician, singer, songwriter, record producer and film director. He was the longest serving drummer for the grunge band Nirvana and the frontman and founder of the rock band Foo Fighters, of which he is the lead vocalist, rhythm and lead guitarist, and primary songwriter. He is the drummer and co-founder of the rock supergroup Them Crooked Vultures. He wrote the music and performed all the instruments for his short-lived side projects Late! and Probot. He has recorded and toured frequently with the rock band Queens of the Stone Age over the past decade.\n\nEarly life\n\nDavid Eric Grohl was born on January 14, 1969[http://www.fooarchive.com/news/?m\n200901 \"Happy 40th Birthday Dave Grohl!\"] , fooarchive.com,  January 14, 2009. in Warren, Ohio, the son of Virginia Jean (née Hanlon), a teacher, and James Harper Grohl (1938-2015), a newswriter. He is of German, Irish, and Slovak descent.\n\nWhen he was a child, Grohl's family moved to Springfield, Virginia. When Grohl was seven, his parents divorced, and he subsequently grew up with his mother. At the age of 12, Grohl began learning to play guitar. He grew tired of lessons and instead taught himself, and he eventually began playing in bands with friends.\n\nA year later, Grohl and his sister spent the summer in Evanston, Illinois, at their cousin Tracy's house. Tracy introduced them to punk rock by taking the pair to shows by a variety of punk bands. His first concert was Naked Raygun at The Cubby Bear in Chicago in 1982 when he was 13 years old. \"From then on we were totally punk\", Grohl recalled. \"We went home and bought Maximumrocknroll and tried to figure it all out\".\n\nIn Virginia, Grohl attended Thomas Jefferson High School as a freshman. He was elected vice president of his freshman class and in that capacity would manage to play bits of songs by punk bands like Circle Jerks and Bad Brains over the school intercom before his morning announcements. Grohl's mother decided that he should transfer to Bishop Ireton High School in Alexandria because his cannabis use was affecting his grades. He stayed there two years, beginning with a repeat of first year. After his second year, he transferred yet again, to Annandale High School.\n\nWhile in high school, Grohl played in several local bands, including a stint as guitarist in a band called Freak Baby. It was during this period that Grohl taught himself to play drums. When Freak Baby kicked out its bass player, Grohl decided to switch to drums, and the reconstituted band renamed themselves Mission Impossible. During his developing years as a drummer, Grohl cited John Bonham as his greatest influence, and eventually had Bonham's three-rings symbol tattooed on his wrist. Mission Impossible later rebranded themselves Fast before breaking up, after which Grohl joined the post-punk-influenced hardcore punk band Dain Bramage.Azerrad, p. 149\n\nMany of Grohl's early influences were at the 9:30 club, a live music venue in Washington D.C.: \"I went to the 9:30 club hundreds of times. I was always so excited to get there, and I was always bummed when it closed. I spent my teenage years at the club and saw some shows that changed my life\".\n\nGrohl said in an interview with The Guardian, \"They don't understand that when I was 15 and had Zen Arcade, that's when I decided that I loved this music. For me to do anything else for the sole reason of doing something different would be so contrived\".\n\nCareer \n\nScream (1986–1990) \n\nAt the age of seventeen, Grohl auditioned with local DC favorites Scream to fill the vacancy left by the departure of drummer Kent Stax. In order to be considered for the position, Grohl lied about his age, claiming he was 20.Lynskey, Dorian. \"[http://www.fooarchive.com/features/arena2002.htm The Man Who Fell To Earth]\". Arena. December 2002. To Grohl's surprise, the band asked him to join. After waffling for a brief period, Grohl accepted the offer. Grohl dropped out of high school in his junior year; he said, \"I was seventeen and extremely anxious to see the world, so I did it\".Azerrad, p. 150 Over the next four years, Grohl toured extensively with the band, recording a couple of live albums (their show of May 4, 1990 in Alzey, Germany being released by Tobby Holzinger as Your Choice Live Series Vol.10) and two studio albums, No More Censorship and Fumble, on which Grohl penned and sang vocals on the song \"Gods Look Down\".\n\nWhile playing in Scream, Grohl became a fan of Melvins and eventually befriended the band. During a 1990 tour stop on the West Coast, Melvins' Buzz Osborne took a couple of his friends, Kurt Cobain and Krist Novoselic, to see the band.Levin, Hannah [http://www.houstonpress.com/events/the-melvins-1334315/ \"The Melvins\"]. houstonpress.com. August 27, 2009.\n\nNirvana (1990–1994)\n\nA few months later, Scream unexpectedly disbanded mid-tour following the departure of its bassist Skeeter Thompson, who left to join The Four Horsemen. Grohl called Osborne for advice; Osborne informed him that Nirvana was looking for a drummer and gave Grohl the phone numbers of Cobain and Novoselic, who subsequently invited Grohl to Seattle to audition for Nirvana. Grohl soon joined the band full-time.\n\nAt the time that Grohl joined Nirvana, the band had already recorded several demos for the follow-up to their debut album Bleach, having spent time recording with producer Butch Vig in Wisconsin. Initially, the plan was to release the album on Sub Pop, but the band received a great deal of interest based on the demos. Grohl spent the initial months with Nirvana traveling to various labels as the band shopped for a deal, eventually signing with DGC Records. In the spring of 1991, the band entered Sound City Studios in Los Angeles to record Nevermind (as seen in Grohl's 2013 documentary Sound City).\n\nUpon its release, Nevermind (1991) exceeded all expectations and became a worldwide commercial success. At the same time, Grohl was struggling with his status in the band. While his drumming style was a significant element in the band's success, Grohl saw himself as just another in a long line of drummers. Although Grohl had been writing songs for several years, he declined to introduce most of his songs to the band as he was in awe of Cobain's songs and did not want to pollute Cobain's writing process. Instead, he compiled and recorded them himself, releasing a cassette called Pocketwatch in 1992 on indie label Simple Machines. Rather than using his own name, Grohl released the cassette under the pseudonym \"Late!\"\n\nIn the later years of Nirvana, Grohl's songwriting contributions increased. In Grohl's initial months in Seattle, Cobain overheard him working on a song called \"Color Pictures of a Marigold\", and the two subsequently worked on it together. Grohl would later record the song for the Pocketwatch cassette. Grohl stated in a 2014 episode of Sonic Highways that Cobain reacted by kissing him upon first hearing a demo of \"Alone + Easy Target\" that Grohl had recently recorded.\n\nDuring the sessions for In Utero, Nirvana decided to re-record \"Color Pictures of a Marigold\" released this version as a B-side on the \"Heart-Shaped Box\" single, titled simply \"Marigold\". Grohl also contributed the main guitar riff for \"Scentless Apprentice\". Cobain admitted in a late 1993 MTV interview that he initially thought the riff was \"kind of boneheaded\", but was gratified at how the song developed (a process captured in part in a demo on the Nirvana box set With the Lights Out). Cobain noted that he was excited at the possibility of having Novoselic and Grohl contribute more to the band's songwriting.\n\nPrior to their 1994 European tour, the band scheduled session time at Robert Lang Studios in Seattle to work on demos. For most of the three-day session, Cobain was absent, so Novoselic and Grohl worked on demos of their own songs. The duo completed several of Grohl's songs, including future Foo Fighters songs \"Exhausted\", \"Big Me\", \"February Stars\", and \"Butterflies\". On the third day of the session, Cobain finally arrived, and the band recorded a demo of a song later named \"You Know You're Right\". It was the band's final studio recording.\n\nNirvana (Cobain, Novoselic, and Grohl) were inducted into the Rock and Roll Hall of Fame on April 10, 2014.\n\n Foo Fighters (1994–present) \n\nFollowing Cobain's death in April 1994, Grohl retreated, unsure of where to go and what to do with himself. In October 1994, Grohl scheduled studio time, again at Robert Lang Studios, and quickly recorded a fifteen-track demo. With the exception of a single guitar part on \"X-Static\" played by Greg Dulli of the Afghan Whigs, Grohl performed all of the instruments himself.\n\nAt the same time, Grohl wondered if his future might be in drumming for other bands. In November, Grohl took a brief turn with Tom Petty and the Heartbreakers, including a performance on Saturday Night Live. Petty asked him to join permanently, but Grohl declined. He was also rumored as a possible replacement for Pearl Jam drummer Dave Abbruzzese and even performed with the band for a song or two at three shows during Pearl Jam's March 1995 Australian tour. However, by then, Pearl Jam had already settled on ex-Red Hot Chili Peppers drummer Jack Irons, and Grohl had other solo plans in the works.\n\nAfter passing the demo around, Grohl found himself with considerable major label interest. Nirvana's A&R rep Gary Gersh had subsequently taken over as president of Capitol Records and lured Grohl to sign with the label. Grohl did not want the effort to be considered the start of a solo career, so he recruited other band members: former Germs and touring Nirvana guitarist Pat Smear and two members of the recently disbanded Sunny Day Real Estate, William Goldsmith (drums) and Nate Mendel (bass). Rather than re-record the album, Grohl's demo was given a professional mix by Rob Schnapf and Tom Rothrock and was released in July 1995 as Foo Fighters' debut album.\n\nDuring a break between tours, the band entered the studio and recorded a cover of Gary Numan's \"Down in the Park\". In February 1996, Grohl and his then-wife Jennifer Youngblood made a brief cameo appearance on  The X-Files third-season episode \"Pusher\".\n\nAfter touring for the self-titled album for more than a year, Grohl returned home and began work on the soundtrack to the 1997 movie Touch. Grohl performed all of the instruments and vocals himself, save for vocals from Veruca Salt singer Louise Post on the title track, keyboards by Barrett Jones (who also co-produced the record) on one track, and vocals and guitar by X's John Doe on \"This Loving Thing (Lynn's Song)\". Grohl completed the recording in two weeks, and immediately joined Foo Fighters to work on their follow-up.\n\nIn the midst of the initial sessions for Foo Fighters' second album, tension emerged between Grohl and Goldsmith. According to Goldsmith, \"Dave had me do 96 takes of one song, and I had to do thirteen hours' worth of takes on another one. [...] It just seemed that everything I did wasn't good enough for him, or anyone else\". Goldsmith also believed that Capitol and producer Gil Norton wanted Grohl to drum on the album.Roberts, Michael. \"[http://bestof.miaminewtimes.com/1998-12-03/music/bring-back-that-sunny-day Bring Back that Sunny Day]\". Miami New Times. December 3, 1998. With the album seemingly complete, Grohl headed home to Virginia with a copy of the rough mixes, and found himself unhappy with the results. Grohl penned a few new songs, recording one of them, \"Walking After You\", by himself at a studio in Washington, DC. Inspired by the session, Grohl opted to move the band, without Goldsmith's knowledge, to Los Angeles to re-record most of the album with Grohl behind the kit. After the sessions were complete, Goldsmith officially announced his departure from the band.\n\nSpeaking in 2011 about the tension surrounding the departure of Goldsmith, Grohl explained that \"there were a lot of reasons it didn't work out, but there was also a part of me that was like, you know, I don't know if I'm finished playing the drums yet\". He also stated that \"I wish that I would have handled things differently\".\n\nThe effort was released in May 1997 as the band's second album, The Colour and the Shape, which eventually cemented Foo Fighters as a staple of rock radio. The album spawned several hits, including \"Everlong\", \"My Hero\", and \"Monkey Wrench\". Just prior to the album's release, former Alanis Morissette drummer Taylor Hawkins joined the band on drums. The following September, Smear (a close friend of Jennifer Youngblood) left the band, citing a need to settle down following a lifetime of touring. Smear was subsequently replaced by Grohl's former Scream bandmate Franz Stahl. Stahl departed the band prior to recording of Foo Fighters' third album and was replaced by touring guitarist Chris Shiflett, who later became a full-fledged member during the recording of One by One.\n\nGrohl's life of non-stop touring and travel continued with Foo Fighters' popularity. During his infrequent pauses he lived in Seattle and Los Angeles before returning to Alexandria, Virginia. It was there that he turned his basement into a recording studio where the 1999 album There Is Nothing Left to Lose was recorded. It was recorded following the departure from Capitol and their former president Gary Gersh; \"Grohl describes the recording experience as \"intoxicating at times. We were left completely to our own devices\". He adds, \"One of the advantages of finishing the record before we had a new label was that it was purely our creation. It was complete and not open to outside tampering\".\n\nIn 2000, the band recruited Queen guitarist Brian May to add some guitar flourish to a cover of Pink Floyd's \"Have a Cigar\", a song which Foo Fighters previously recorded as a b-side. The friendship between the two bands resulted in Grohl and Taylor Hawkins being asked to induct Queen into the Rock and Roll Hall of Fame in 2001. Grohl and Hawkins joined May and Queen drummer Roger Taylor to perform \"Tie Your Mother Down\", with Grohl standing in on vocals for Freddie Mercury. May later contributed guitar work for the song \"Tired of You\" on the ensuing Foo Fighters album, as well as on an unreleased Foo Fighters song called \"Knucklehead\".\n\nNear the end of 2001, Foo Fighters returned to the studio to work on their fourth album. After four months in the studio, with the sessions finished, Grohl accepted an invitation to join Queens of the Stone Age and helped them to record their 2002 album Songs for the Deaf. (Grohl can be seen drumming for the band in the video for the song \"No One Knows\".) After a brief tour through North America, Britain and Japan with the band and feeling rejuvenated by the effort, Grohl recalled the other band members to completely re-record their album at his studio in Virginia. The effort became their fourth album, One by One. While initially pleased with the results, in another 2005 Rolling Stone interview, Dave Grohl admitted to not liking the record: \"Four of the songs were good, and the other seven I never played again in my life. We rushed into it, and we rushed out of it\".Scaggs, Austin. [https://www.rollingstone.com/news/story/7281787/foos_reclaim_their_honor \"Foos Reclaim Their Honor\"]. Rolling Stone. April 29, 2005.\n\nOn November 23, 2002, Grohl achieved a historical milestone by replacing himself on the top of the Billboard Modern Rock chart, when \"You Know You're Right\" by Nirvana was replaced by \"All My Life\" by Foo Fighters. When \"All My Life\" ended its run, after a one-week respite, \"No One Knows\" by Queens of the Stone Age took the number one spot. Between October 26, 2002 and March 1, 2003 Grohl was in the number one spot on the Modern Rock charts for 17 of 18 successive weeks, as a member of three different groups.\n\nGrohl and Foo Fighters released their fifth album In Your Honor on June 14, 2005. Prior to starting work on the album, the band spent almost a year relocating Grohl's home-based Virginia studio to a brand new facility, dubbed Studio 606, located in a warehouse near Los Angeles. Featuring collaborations with John Paul Jones of Led Zeppelin, Josh Homme of Queens of the Stone Age and Norah Jones, the album was a departure from previous efforts, and included one rock and one acoustic disc.\n\nFoo Fighters's sixth studio album Echoes, Silence, Patience & Grace was released on September 25, 2007. It was recorded during a three-month period between March 2007 and June 2007, and its release was preceded by the first single \"The Pretender\" on September 17. The second single, \"Long Road to Ruin\", was released on December 3, 2007, followed by the third single, \"Let It Die\", June 24, 2008.\n\nOn November 3, 2009, Foo Fighters released their first Greatest Hits collection, consisting of 16 tracks including a previously unreleased acoustic version of \"Everlong\" and two new tracks \"Wheels\" and \"Word Forward\" which were produced by Nevermind's producer Butch Vig. Grohl has been quoted saying the Greatest Hits is too early and \"... can look like an obituary\". He does not feel they have written their best hits yet.\n\nThe Foo Fighters' seventh studio album, Wasting Light, was released on April 12, 2011. It is the first Foo Fighters album to reach No. 1 in the United States. Despite rumors of a hiatus, Grohl confirmed in January 2013 that the band had completed writing material for their follow-up to Wasting Light.\n\nGrohl and the Foo Fighters sometimes perform as cover band \"Chevy Metal, \"as they did in May 2015 at \"Conejo Valley Days\", a county fair in Thousand Oaks, California.\n\nOn May 19, 2012, the Foo Fighters appeared with Mick Jagger on Saturday Night Live. They performed the Jagger/Richards songs \"19th Nervous Breakdown\" and \"It's Only Rock 'n Roll\".\n\nOn November 10, 2014, the Foo Fighters released their eighth studio album, \"Sonic Highways\".\n\nOn June 12, 2015, while playing a show in Gothenburg, Sweden, Grohl fell off the stage, breaking his leg. He left temporarily and returned with a cast to finish the concert. Afterward, the band cancelled the remainder of its European tour.  To avoid having to cancel the band's upcoming North American tour, Grohl designed a large \"elevated throne\" which would allow him to perform on stage with a broken leg.  The throne was unveiled at a concert of July 4, where Grohl used the stage's video screens to show the crowd video of him falling from the stage in Gothenburg as well as X-rays of his broken leg. Beginning with the show of July 4, the Foo Fighters began selling new tour merchandise rebranding the band's North American tour as the Broken Leg Tour. Grohl later lent his throne to Axl Rose of Guns N' Roses after Rose suffered a similar injury on April 1, 2016, the band's first show with Slash and Duff McKagan in nearly 20 years.\n\nOn July 31, 2015, Grohl posted a personal reply to Fabio Zaffagnini, Marco Sabiu, and the 1,000 participants of the \"Rockin' 1000\" project in Cesena, Italy, thanking them for their combined performance of the Foo Fighters' song \"Learn to Fly\" from their 1999 album There Is Nothing Left to Lose, indicating (in broken Italian), \"... I promise [the Foo Fighters will] see you soon\". On November 3, the Foo Fighters performed in Cesena, where Dave invited some \"Rockin' 1000\" members onto the stage to perform with the band.\n\nAdditional projects and contributions \n\nApart from his main bands, Grohl has been involved in other music projects. In 1992, he played drums on Buzz Osborne's Kiss-styled solo-EP King Buzzo, where he was credited as Dale Nixon, a pseudonym that Greg Ginn adopted to play bass on Black Flag's My War. He also released the music cassette Pocketwatch under the pseudonym Late! on the now defunct indie label, Simple Machines.\n\nIn 1993, Grohl was recruited to help recreate the music of The Beatles' early years for the movie Backbeat; he played drums in an \"all-star\" lineup that included Greg Dulli of the Afghan Whigs, indie producer Don Fleming, Mike Mills of R.E.M., Thurston Moore of Sonic Youth, and Dave Pirner of Soul Asylum. A music video was filmed for the song \"Money\" while Grohl was with Nirvana on their 1994 European tour, footage of Grohl was filmed later and included.\n\nLater in 1994, Grohl played drums on two tracks for Mike Watt's Ball-Hog or Tugboat?. In early 1995, Grohl and Foo Fighters played their first US tour opening for Watt, and helped make up Watt's supporting band. Nicknamed the \"Ringspiel\" tour, Watt's band featured Grohl and William Goldsmith on drums, Eddie Vedder and Pat Smear on guitar, and Watt on bass.\n\nDuring the early 2000s, Grohl spent time in his basement studio writing and recording a number of songs for a metal project. Over the span of several years, he recruited his favorite metal vocalists from the 1980s, including Lemmy of Motörhead, Conrad \"Cronos\" Lant from Venom, King Diamond, Scott Weinrich, Snake of Voivod and Max Cavalera of Sepultura, to perform the vocals for the songs. The project was released in 2004 under the moniker Probot.D'Angelo, Joe . \"[http://www.mtv.com/news/articles/1438589/20010129/foo_fighters.jhtml \"Dave Grohl Preps A 'Death Metal Supernatural' With Probot\"]\". mtv.com. January 29, 2001.Thompson, Ben. \"[https://www.independent.co.uk/arts-entertainment/music/features/dave-grohl-release-the-probot-558523.html \"Dave Grohl: Release the Probot\"]\". independent.co.uk. April 2, 2004.\n\nAlso in 2003, Grohl stepped behind the kit to perform on Killing Joke's second self-titled album. The move surprised some Nirvana fans, given that Nirvana had been accused of stealing the opening riff of \"Come as You Are\" from Killing Joke's 1984 song \"Eighties\". However, the controversy failed to create a lasting rift between the bands. Foo Fighters covered Killing Joke's \"Requiem\" during the late 1990s, and were even joined by Killing Joke singer Jaz Coleman for a performance of the song at a show in New Zealand in 2003. Also in 2003, at the 2003 Grammy Awards, Grohl performed in an ad-hoc supergroup with Bruce Springsteen, Elvis Costello, and Steven Van Zandt for a performance in tribute of then-recently deceased singer/guitarist Joe Strummer.\n\nGrohl lent his drumming skills to other artists during the early 2000s. In 2000, he played drums and sang on a track, \"Goodbye Lament\", from Tony Iommi's album Iommi. In 2001, Grohl performed on Tenacious D's debut album, and appeared in the video for lead single \"Tribute\" as a demon. He later appeared in the duo's 2006 movie Tenacious D in The Pick of Destiny as the devil in the song \"Beelzeboss\", and performed on its soundtrack. He also performed drums for their 2012 album Rize of the Fenix. In 2002, Grohl helped Chan Marshall of Cat Power on the album You Are Free and played with Queens of the Stone Age on their album Songs for the Deaf. Grohl also toured with the band in support of the album, delaying work on the Foo Fighters' album One by One. In 2004, Grohl drummed on several tracks for Nine Inch Nails' 2005 album With Teeth. He also drummed on the song \"Bad Boyfriend\" on Garbage's 2005 album Bleed Like Me. Most recently, he recorded all the drums on Juliette and the Licks's 2006 album Four on the Floor and the song \"For Us\" from Pete Yorn's 2006 album Nightcrawler. Beyond drumming, Grohl contributed guitar to a cover of Neil Young's \"I've Been Waiting For You\" on David Bowie's 2002 album Heathen.\n\nIn June 2008, Grohl was Paul McCartney's special guest for a concert at the Anfield football stadium in Liverpool, in one of the central events of the English city's year as European Capital of Culture. Grohl joined McCartney's band singing backup vocals and playing guitar on \"Band on the Run\" and drums on \"Back in the U.S.S.R.\" and \"I Saw Her Standing There\". Grohl also performed with McCartney at the 51st Grammy Awards, again playing drums on \"I Saw Her Standing There\". Grohl also helped pay tribute to McCartney at the 2010 Kennedy Center Honors along with No Doubt, Norah Jones, Steven Tyler, James Taylor, and Mavis Staples. He sang a duet version of \"Maybe I'm Amazed\" with Norah Jones on December 5, 2010.\n\nGrohl played drums on the tracks \"Run with the Wolves\" and \"Stand Up\" on The Prodigy's 2009 album Invaders Must Die.\n\nIn July 2009, it was revealed that Grohl was recording with Josh Homme and John Paul Jones as Them Crooked Vultures. The trio performed their first show together on August 9, 2009, at Metro in Chicago. The band played their first UK gig on August 26, 2009, with a surprise appearance at Brixton Academy in London, supporting the Arctic Monkeys. The band released their debut album Them Crooked Vultures on November 16, 2009 in the UK and November 17, 2009 in the US.\n\nOn February 6, 2010, Grohl performed with his band Them Crooked Vultures the songs \"Mind Eraser, No Chaser\" and \"New Fang\" as musical guests on Saturday Night Live Dave Grohl appeared as an old punk rock drummer reuniting the group \"Crisis of Conformity\" after 25 years in a skit later on in the episode.\n\nIn mid-2010, Dave Grohl added his name to the list of contributing rock star voice cameos for Cartoon Network's heavy metal parody/tribute show, Metalocalypse. He voiced the controversial Syrian dictator, Abdule Malik in the season 3 finale, Doublebookedklok.\n\nOn October 23, 2010, Grohl performed with Tenacious D at Blizzcon. He appeared as the drummer for the entire concert, and a year later he returned with Foo Fighters and played another set there, this time as guitarist and vocalist.\n\nAlso in 2010, Grohl helped write and performed on drums for \"Watch This\" with guitarist Slash and Duff McKagan on Slash's self-titled album that also included many other famous artists.\n\nIn October 2011, Grohl temporarily joined Cage the Elephant as a replacement on tour after drummer Jared Champion's appendix burst.\n\nGrohl directed a documentary entitled Sound City which is about the Van Nuys studio of the same name where Nevermind was recorded that shut down its music operations in 2011.\n\nOn November 6, 2012, following the departure of Joey Castillo from Queens of the Stone Age, Grohl has been confirmed as the drummer for the band on the upcoming album.\n\nAt the 12-12-12 Sandy benefit concert Paul McCartney joined Grohl and the surviving members of Nirvana (Krist Novoselic and touring guitarist Pat Smear) to perform \"Cut Me Some Slack\", a song later recorded for the Sound City soundtrack. In what was regarded as a Nirvana reunion with McCartney as a stand-in for Kurt Cobain, this was the first time in eighteen years that the three had played alongside each other.\n\nIn February 2013, Grohl filled in as host of Chelsea Lately for a week. Guests included Elton John, who disclosed on the E! show that he would appear with Grohl on the next Queens of the Stone Age album. Grohl had previously hosted the show during the first week of December 2012 as part of \"Celebrity Guest Host Week\".\n\nGrohl delivered a keynote speech at the 2013 SXSW conference in Austin Texas, US on the morning of March 14. Lasting just under an hour, the speech covered Grohl's musical life from his youth through to his role with the Foo Fighters and emphasized the importance of each individual's voice, regardless of who the individual is: \"There is no right or wrong—there is only your voice... What matters most is that it’s your voice. Cherish it. Respect it. Nurture it. Challenge it. Respect it\". Grohl also admitted during the speech that Psy's \"Gangnam Style\" was one of his favorite songs of \"the past decade\". He also referenced Edgar Winter's instrumental \"Frankenstein\" as being the song that made him want to become a musician.\n\nOn November 6, 2013, Dave Grohl played drums at the 2013 CMA Awards replacing drummer Chris Fryar for Country Music band Zac Brown Band. The band debuted their new song \"Day for the Dead\". Grohl also produced Zac Brown Band's EP The Grohl Sessions, Vol. 1.\n\nGrohl also featured on drums for new indie hip hop band RDGLDGRN. He worked with them closely on their EP. The group asked fellow Northern Virginia native Dave Grohl, who was filming his Sound City documentary, to drum on \"I Love Lamp\". Grohl agreed and played drums for the entire record, with the exception of \"Million Fans\", which features a sampled breakbeat.\n\nGrohl, a fan of the theatrical Swedish metal band Ghost (also known as Ghost B.C. especially in America) produced their album If You Have Ghost. He was also featured in a number of songs on the album. Grohl played rhythm guitar for the song If You Have Ghosts (a cover of a Roky Erickson song), and drums on I'm a Marionette (an ABBA cover) as well as Waiting for the Night (a Depeche Mode cover). According to a member of Ghost, Grohl has appeared live in concert with the band wearing the same identity concealing outfit that the rest of the band usually wears.\n\nOn May 20, 2015, David Letterman selected Grohl and The Foo Fighters to play \"Everlong\" as the last musical guest on the final episode of Late Show with David Letterman. Letterman stated that he considered \"Everlong\" to be his favorite song and that he and the band were \"joined at the hip\" ever since the band canceled tour dates to play his first show back from heart bypass surgery at his request.\n\nIn September, the all-star covers album by the Alice Cooper-led Hollywood Vampires supergroup was released and features Grohl playing drums on the medley \"One/Jump into The Fire\".\n\nOn December 1, 2015 Grohl appeared on an episode of The Muppets where he competed in a \"drum off\" with Animal.\n\nPersonal life \n\nGrohl was married to photographer Jennifer Youngblood from 1994 to 1997. On August 2, 2003, he married Jordyn Blum. Together, they have three daughters: Violet Maye (born April 15, 2006), Harper Willow (born April 17, 2009), and Ophelia Saint (born August 1, 2014).\n\nIn 2012, Grohl was estimated to be the third wealthiest drummer in the world, behind Ringo Starr and Phil Collins, with a fortune of $260 million. Also, because of drumming and songwriting, Grohl is considered by Ken Micallef, co-author of Classic Rock Drummers, to be one of the most influential rock musicians of the past 20 years.\n\nGrohl dropped out of high school at the beginning of the 11th grade. He still does not know how to read sheet music and writes his music only by ear.\n\nAdvocacy, philanthropy and views \n\nGrohl has been vocal in his views on drug misuse, contributing to a 2009 anti-drug video for the BBC. \"I have never done cocaine, ever in my life. I have never done heroin, I have never done speed,\" he said in a 2008 interview, adding that he stopped smoking cannabis and taking LSD at the age of 20. In the BBC video, he said, \"I've seen people die. It ain't easy being young, but that stuff doesn't make it any easier\".\n\nIn May 2006, Grohl sent a note of support to the two trapped miners in the Beaconsfield mine collapse in Tasmania, Australia. In the initial days following the collapse, one of the men requested an iPod with the Foo Fighters album In Your Honor, to be sent down to them through a small hole. Grohl's note read, in part, \"Though I'm halfway around the world right now, my heart is with you both, and I want you to know that when you come home, there's two tickets to any Foos show, anywhere, and two cold beers waiting for yous. Deal?\" In October 2006, one of the miners took up his offer, joining Grohl for a drink after a Foo Fighters acoustic concert at the Sydney Opera House. Grohl wrote an instrumental piece for the meeting, which he pledged he would include on the band's next album. The song, titled \"Ballad of the Beaconsfield Miners\", appears on Foo Fighters' 2007 release Echoes, Silence, Patience & Grace, and features Kaki King.\n\nGrohl is an advocate for LGBT rights. He has worn a White Knot ribbon to various events to promote whiteknot.org. When questioned about the knot, he responded, \"You know what that's about? I believe in love and I believe in equality and I believe in marriage equality\". Grohl's gay rights activism dates back to the early 1990s, when he and the other members of Nirvana performed at a benefit to raise money to fight Oregon Ballot Measure 9. \"Measure 9 goes against American traditions of mutual respect and freedom, and Nirvana wants to do their part to end bigotry and narrow-mindedness everywhere,\" the group stated. The ballot measure was ultimately defeated on November 3, 1992. Grohl has also participated in two counter-protests against the Westboro Baptist Church for their anti-gay stance, once by performing \"Keep It Clean\" on the back of a flatbed truck and most recently by Rickrolling them.\n\nGrohl is a Democrat. He supported President Barack Obama, and performed \"My Hero\" in September at the 2012 Democratic National Convention in Charlotte, North Carolina.\n\nHonors \n\nIn August 2009, Grohl was given the key to the city of Warren, Ohio and performed the songs \"Everlong\", \"Times Like These\", and \"My Hero\". A roadway in downtown Warren named \"David Grohl Alley\" has been dedicated to him with murals by local artists.\n\nDave Grohl's hometown of Warren, Ohio unveiled gigantic 409 kg drumsticks in 2012 to honor him. According to The Hollywood Reporter, the massive pair broke the Guinness World Record. The record-breaking drumsticks were shown to the public for the first time on July 7 during a concert at the Warren Amphitheater.\n\nOn November 11, 2014, Grohl joined Bruce Springsteen and Zac Brown on stage at the Concert for Valor in Washington, D.C. to support U.S. troops and veterans.\n\nGrohl's first solo Rolling Stone cover story appeared on December 4, 2014.\n\nLegal issues \n\nIn 2000, while on tour with Foo Fighters in Australia, Grohl was arrested by Australian police while driving a scooter for driving under the influence following a concert on the Gold Coast in Queensland. He was fined $400 and had his Australian driving permit revoked for three months. Following the incident, Grohl stated, \"So, people, I guess if there's anything to learn here, it's: don't drive after a few beers, even if you feel entirely capable like I did\".\n\nDiscography \n\nFilmography",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dave Grohl" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8099" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "David Eric Grohl (born January 14, 1969) is an American musician, singer, songwriter, record producer and film director. He was the longest serving drummer for the grunge band Nirvana and the frontman and founder of the rock band Foo Fighters, of which he is the lead vocalist, rhythm and lead guitarist, and primary songwriter. He is the drummer and co-founder of the rock supergroup Them Crooked Vultures. He wrote the music and performed all the instruments for his short-lived side projects Late! and Probot. He has recorded and toured frequently with the rock band Queens of the Stone Age over the past decade.\n\nEarly life\n\nDavid Eric Grohl was born on January 14, 1969[http://www.fooarchive.com/news/?m\n200901 \"Happy 40th Birthday Dave Grohl!\"] , fooarchive.com,  January 14, 2009. in Warren, Ohio, the son of Virginia Jean (née Hanlon), a teacher, and James Harper Grohl (1938-2015), a newswriter. He is of German, Irish, and Slovak descent.\n\nWhen he was a child, Grohl's family moved to Springfield, Virginia. When Grohl was seven, his parents divorced, and he subsequently grew up with his mother. At the age of 12, Grohl began learning to play guitar. He grew tired of lessons and instead taught himself, and he eventually began playing in bands with friends.\n\nA year later, Grohl and his sister spent the summer in Evanston, Illinois, at their cousin Tracy's house. Tracy introduced them to punk rock by taking the pair to shows by a variety of punk bands. His first concert was Naked Raygun at The Cubby Bear in Chicago in 1982 when he was 13 years old. \"From then on we were totally punk\", Grohl recalled. \"We went home and bought Maximumrocknroll and tried to figure it all out\".\n\nIn Virginia, Grohl attended Thomas Jefferson High School as a freshman. He was elected vice president of his freshman class and in that capacity would manage to play bits of songs by punk bands like Circle Jerks and Bad Brains over the school intercom before his morning announcements. Grohl's mother decided that he should transfer to Bishop Ireton High School in Alexandria because his cannabis use was affecting his grades. He stayed there two years, beginning with a repeat of first year. After his second year, he transferred yet again, to Annandale High School.\n\nWhile in high school, Grohl played in several local bands, including a stint as guitarist in a band called Freak Baby. It was during this period that Grohl taught himself to play drums. When Freak Baby kicked out its bass player, Grohl decided to switch to drums, and the reconstituted band renamed themselves Mission Impossible. During his developing years as a drummer, Grohl cited John Bonham as his greatest influence, and eventually had Bonham's three-rings symbol tattooed on his wrist. Mission Impossible later rebranded themselves Fast before breaking up, after which Grohl joined the post-punk-influenced hardcore punk band Dain Bramage.Azerrad, p. 149\n\nMany of Grohl's early influences were at the 9:30 club, a live music venue in Washington D.C.: \"I went to the 9:30 club hundreds of times. I was always so excited to get there, and I was always bummed when it closed. I spent my teenage years at the club and saw some shows that changed my life\".\n\nGrohl said in an interview with The Guardian, \"They don't understand that when I was 15 and had Zen Arcade, that's when I decided that I loved this music. For me to do anything else for the sole reason of doing something different would be so contrived\".\n\nCareer \n\nScream (1986–1990) \n\nAt the age of seventeen, Grohl auditioned with local DC favorites Scream to fill the vacancy left by the departure of drummer Kent Stax. In order to be considered for the position, Grohl lied about his age, claiming he was 20.Lynskey, Dorian. \"[http://www.fooarchive.com/features/arena2002.htm The Man Who Fell To Earth]\". Arena. December 2002. To Grohl's surprise, the band asked him to join. After waffling for a brief period, Grohl accepted the offer. Grohl dropped out of high school in his junior year; he said, \"I was seventeen and extremely anxious to see the world, so I did it\".Azerrad, p. 150 Over the next four years, Grohl toured extensively with the band, recording a couple of live albums (their show of May 4, 1990 in Alzey, Germany being released by Tobby Holzinger as Your Choice Live Series Vol.10) and two studio albums, No More Censorship and Fumble, on which Grohl penned and sang vocals on the song \"Gods Look Down\".\n\nWhile playing in Scream, Grohl became a fan of Melvins and eventually befriended the band. During a 1990 tour stop on the West Coast, Melvins' Buzz Osborne took a couple of his friends, Kurt Cobain and Krist Novoselic, to see the band.Levin, Hannah [http://www.houstonpress.com/events/the-melvins-1334315/ \"The Melvins\"]. houstonpress.com. August 27, 2009.\n\nNirvana (1990–1994)\n\nA few months later, Scream unexpectedly disbanded mid-tour following the departure of its bassist Skeeter Thompson, who left to join The Four Horsemen. Grohl called Osborne for advice; Osborne informed him that Nirvana was looking for a drummer and gave Grohl the phone numbers of Cobain and Novoselic, who subsequently invited Grohl to Seattle to audition for Nirvana. Grohl soon joined the band full-time.\n\nAt the time that Grohl joined Nirvana, the band had already recorded several demos for the follow-up to their debut album Bleach, having spent time recording with producer Butch Vig in Wisconsin. Initially, the plan was to release the album on Sub Pop, but the band received a great deal of interest based on the demos. Grohl spent the initial months with Nirvana traveling to various labels as the band shopped for a deal, eventually signing with DGC Records. In the spring of 1991, the band entered Sound City Studios in Los Angeles to record Nevermind (as seen in Grohl's 2013 documentary Sound City).\n\nUpon its release, Nevermind (1991) exceeded all expectations and became a worldwide commercial success. At the same time, Grohl was struggling with his status in the band. While his drumming style was a significant element in the band's success, Grohl saw himself as just another in a long line of drummers. Although Grohl had been writing songs for several years, he declined to introduce most of his songs to the band as he was in awe of Cobain's songs and did not want to pollute Cobain's writing process. Instead, he compiled and recorded them himself, releasing a cassette called Pocketwatch in 1992 on indie label Simple Machines. Rather than using his own name, Grohl released the cassette under the pseudonym \"Late!\"\n\nIn the later years of Nirvana, Grohl's songwriting contributions increased. In Grohl's initial months in Seattle, Cobain overheard him working on a song called \"Color Pictures of a Marigold\", and the two subsequently worked on it together. Grohl would later record the song for the Pocketwatch cassette. Grohl stated in a 2014 episode of Sonic Highways that Cobain reacted by kissing him upon first hearing a demo of \"Alone + Easy Target\" that Grohl had recently recorded.\n\nDuring the sessions for In Utero, Nirvana decided to re-record \"Color Pictures of a Marigold\" released this version as a B-side on the \"Heart-Shaped Box\" single, titled simply \"Marigold\". Grohl also contributed the main guitar riff for \"Scentless Apprentice\". Cobain admitted in a late 1993 MTV interview that he initially thought the riff was \"kind of boneheaded\", but was gratified at how the song developed (a process captured in part in a demo on the Nirvana box set With the Lights Out). Cobain noted that he was excited at the possibility of having Novoselic and Grohl contribute more to the band's songwriting.\n\nPrior to their 1994 European tour, the band scheduled session time at Robert Lang Studios in Seattle to work on demos. For most of the three-day session, Cobain was absent, so Novoselic and Grohl worked on demos of their own songs. The duo completed several of Grohl's songs, including future Foo Fighters songs \"Exhausted\", \"Big Me\", \"February Stars\", and \"Butterflies\". On the third day of the session, Cobain finally arrived, and the band recorded a demo of a song later named \"You Know You're Right\". It was the band's final studio recording.\n\nNirvana (Cobain, Novoselic, and Grohl) were inducted into the Rock and Roll Hall of Fame on April 10, 2014.\n\n Foo Fighters (1994–present) \n\nFollowing Cobain's death in April 1994, Grohl retreated, unsure of where to go and what to do with himself. In October 1994, Grohl scheduled studio time, again at Robert Lang Studios, and quickly recorded a fifteen-track demo. With the exception of a single guitar part on \"X-Static\" played by Greg Dulli of the Afghan Whigs, Grohl performed all of the instruments himself.\n\nAt the same time, Grohl wondered if his future might be in drumming for other bands. In November, Grohl took a brief turn with Tom Petty and the Heartbreakers, including a performance on Saturday Night Live. Petty asked him to join permanently, but Grohl declined. He was also rumored as a possible replacement for Pearl Jam drummer Dave Abbruzzese and even performed with the band for a song or two at three shows during Pearl Jam's March 1995 Australian tour. However, by then, Pearl Jam had already settled on ex-Red Hot Chili Peppers drummer Jack Irons, and Grohl had other solo plans in the works.\n\nAfter passing the demo around, Grohl found himself with considerable major label interest. Nirvana's A&R rep Gary Gersh had subsequently taken over as president of Capitol Records and lured Grohl to sign with the label. Grohl did not want the effort to be considered the start of a solo career, so he recruited other band members: former Germs and touring Nirvana guitarist Pat Smear and two members of the recently disbanded Sunny Day Real Estate, William Goldsmith (drums) and Nate Mendel (bass). Rather than re-record the album, Grohl's demo was given a professional mix by Rob Schnapf and Tom Rothrock and was released in July 1995 as Foo Fighters' debut album.\n\nDuring a break between tours, the band entered the studio and recorded a cover of Gary Numan's \"Down in the Park\". In February 1996, Grohl and his then-wife Jennifer Youngblood made a brief cameo appearance on  The X-Files third-season episode \"Pusher\".\n\nAfter touring for the self-titled album for more than a year, Grohl returned home and began work on the soundtrack to the 1997 movie Touch. Grohl performed all of the instruments and vocals himself, save for vocals from Veruca Salt singer Louise Post on the title track, keyboards by Barrett Jones (who also co-produced the record) on one track, and vocals and guitar by X's John Doe on \"This Loving Thing (Lynn's Song)\". Grohl completed the recording in two weeks, and immediately joined Foo Fighters to work on their follow-up.\n\nIn the midst of the initial sessions for Foo Fighters' second album, tension emerged between Grohl and Goldsmith. According to Goldsmith, \"Dave had me do 96 takes of one song, and I had to do thirteen hours' worth of takes on another one. [...] It just seemed that everything I did wasn't good enough for him, or anyone else\". Goldsmith also believed that Capitol and producer Gil Norton wanted Grohl to drum on the album.Roberts, Michael. \"[http://bestof.miaminewtimes.com/1998-12-03/music/bring-back-that-sunny-day Bring Back that Sunny Day]\". Miami New Times. December 3, 1998. With the album seemingly complete, Grohl headed home to Virginia with a copy of the rough mixes, and found himself unhappy with the results. Grohl penned a few new songs, recording one of them, \"Walking After You\", by himself at a studio in Washington, DC. Inspired by the session, Grohl opted to move the band, without Goldsmith's knowledge, to Los Angeles to re-record most of the album with Grohl behind the kit. After the sessions were complete, Goldsmith officially announced his departure from the band.\n\nSpeaking in 2011 about the tension surrounding the departure of Goldsmith, Grohl explained that \"there were a lot of reasons it didn't work out, but there was also a part of me that was like, you know, I don't know if I'm finished playing the drums yet\". He also stated that \"I wish that I would have handled things differently\".\n\nThe effort was released in May 1997 as the band's second album, The Colour and the Shape, which eventually cemented Foo Fighters as a staple of rock radio. The album spawned several hits, including \"Everlong\", \"My Hero\", and \"Monkey Wrench\". Just prior to the album's release, former Alanis Morissette drummer Taylor Hawkins joined the band on drums. The following September, Smear (a close friend of Jennifer Youngblood) left the band, citing a need to settle down following a lifetime of touring. Smear was subsequently replaced by Grohl's former Scream bandmate Franz Stahl. Stahl departed the band prior to recording of Foo Fighters' third album and was replaced by touring guitarist Chris Shiflett, who later became a full-fledged member during the recording of One by One.\n\nGrohl's life of non-stop touring and travel continued with Foo Fighters' popularity. During his infrequent pauses he lived in Seattle and Los Angeles before returning to Alexandria, Virginia. It was there that he turned his basement into a recording studio where the 1999 album There Is Nothing Left to Lose was recorded. It was recorded following the departure from Capitol and their former president Gary Gersh; \"Grohl describes the recording experience as \"intoxicating at times. We were left completely to our own devices\". He adds, \"One of the advantages of finishing the record before we had a new label was that it was purely our creation. It was complete and not open to outside tampering\".\n\nIn 2000, the band recruited Queen guitarist Brian May to add some guitar flourish to a cover of Pink Floyd's \"Have a Cigar\", a song which Foo Fighters previously recorded as a b-side. The friendship between the two bands resulted in Grohl and Taylor Hawkins being asked to induct Queen into the Rock and Roll Hall of Fame in 2001. Grohl and Hawkins joined May and Queen drummer Roger Taylor to perform \"Tie Your Mother Down\", with Grohl standing in on vocals for Freddie Mercury. May later contributed guitar work for the song \"Tired of You\" on the ensuing Foo Fighters album, as well as on an unreleased Foo Fighters song called \"Knucklehead\".\n\nNear the end of 2001, Foo Fighters returned to the studio to work on their fourth album. After four months in the studio, with the sessions finished, Grohl accepted an invitation to join Queens of the Stone Age and helped them to record their 2002 album Songs for the Deaf. (Grohl can be seen drumming for the band in the video for the song \"No One Knows\".) After a brief tour through North America, Britain and Japan with the band and feeling rejuvenated by the effort, Grohl recalled the other band members to completely re-record their album at his studio in Virginia. The effort became their fourth album, One by One. While initially pleased with the results, in another 2005 Rolling Stone interview, Dave Grohl admitted to not liking the record: \"Four of the songs were good, and the other seven I never played again in my life. We rushed into it, and we rushed out of it\".Scaggs, Austin. [https://www.rollingstone.com/news/story/7281787/foos_reclaim_their_honor \"Foos Reclaim Their Honor\"]. Rolling Stone. April 29, 2005.\n\nOn November 23, 2002, Grohl achieved a historical milestone by replacing himself on the top of the Billboard Modern Rock chart, when \"You Know You're Right\" by Nirvana was replaced by \"All My Life\" by Foo Fighters. When \"All My Life\" ended its run, after a one-week respite, \"No One Knows\" by Queens of the Stone Age took the number one spot. Between October 26, 2002 and March 1, 2003 Grohl was in the number one spot on the Modern Rock charts for 17 of 18 successive weeks, as a member of three different groups.\n\nGrohl and Foo Fighters released their fifth album In Your Honor on June 14, 2005. Prior to starting work on the album, the band spent almost a year relocating Grohl's home-based Virginia studio to a brand new facility, dubbed Studio 606, located in a warehouse near Los Angeles. Featuring collaborations with John Paul Jones of Led Zeppelin, Josh Homme of Queens of the Stone Age and Norah Jones, the album was a departure from previous efforts, and included one rock and one acoustic disc.\n\nFoo Fighters's sixth studio album Echoes, Silence, Patience & Grace was released on September 25, 2007. It was recorded during a three-month period between March 2007 and June 2007, and its release was preceded by the first single \"The Pretender\" on September 17. The second single, \"Long Road to Ruin\", was released on December 3, 2007, followed by the third single, \"Let It Die\", June 24, 2008.\n\nOn November 3, 2009, Foo Fighters released their first Greatest Hits collection, consisting of 16 tracks including a previously unreleased acoustic version of \"Everlong\" and two new tracks \"Wheels\" and \"Word Forward\" which were produced by Nevermind's producer Butch Vig. Grohl has been quoted saying the Greatest Hits is too early and \"... can look like an obituary\". He does not feel they have written their best hits yet.\n\nThe Foo Fighters' seventh studio album, Wasting Light, was released on April 12, 2011. It is the first Foo Fighters album to reach No. 1 in the United States. Despite rumors of a hiatus, Grohl confirmed in January 2013 that the band had completed writing material for their follow-up to Wasting Light.\n\nGrohl and the Foo Fighters sometimes perform as cover band \"Chevy Metal, \"as they did in May 2015 at \"Conejo Valley Days\", a county fair in Thousand Oaks, California.\n\nOn May 19, 2012, the Foo Fighters appeared with Mick Jagger on Saturday Night Live. They performed the Jagger/Richards songs \"19th Nervous Breakdown\" and \"It's Only Rock 'n Roll\".\n\nOn November 10, 2014, the Foo Fighters released their eighth studio album, \"Sonic Highways\".\n\nOn June 12, 2015, while playing a show in Gothenburg, Sweden, Grohl fell off the stage, breaking his leg. He left temporarily and returned with a cast to finish the concert. Afterward, the band cancelled the remainder of its European tour.  To avoid having to cancel the band's upcoming North American tour, Grohl designed a large \"elevated throne\" which would allow him to perform on stage with a broken leg.  The throne was unveiled at a concert of July 4, where Grohl used the stage's video screens to show the crowd video of him falling from the stage in Gothenburg as well as X-rays of his broken leg. Beginning with the show of July 4, the Foo Fighters began selling new tour merchandise rebranding the band's North American tour as the Broken Leg Tour. Grohl later lent his throne to Axl Rose of Guns N' Roses after Rose suffered a similar injury on April 1, 2016, the band's first show with Slash and Duff McKagan in nearly 20 years.\n\nOn July 31, 2015, Grohl posted a personal reply to Fabio Zaffagnini, Marco Sabiu, and the 1,000 participants of the \"Rockin' 1000\" project in Cesena, Italy, thanking them for their combined performance of the Foo Fighters' song \"Learn to Fly\" from their 1999 album There Is Nothing Left to Lose, indicating (in broken Italian), \"... I promise [the Foo Fighters will] see you soon\". On November 3, the Foo Fighters performed in Cesena, where Dave invited some \"Rockin' 1000\" members onto the stage to perform with the band.\n\nAdditional projects and contributions \n\nApart from his main bands, Grohl has been involved in other music projects. In 1992, he played drums on Buzz Osborne's Kiss-styled solo-EP King Buzzo, where he was credited as Dale Nixon, a pseudonym that Greg Ginn adopted to play bass on Black Flag's My War. He also released the music cassette Pocketwatch under the pseudonym Late! on the now defunct indie label, Simple Machines.\n\nIn 1993, Grohl was recruited to help recreate the music of The Beatles' early years for the movie Backbeat; he played drums in an \"all-star\" lineup that included Greg Dulli of the Afghan Whigs, indie producer Don Fleming, Mike Mills of R.E.M., Thurston Moore of Sonic Youth, and Dave Pirner of Soul Asylum. A music video was filmed for the song \"Money\" while Grohl was with Nirvana on their 1994 European tour, footage of Grohl was filmed later and included.\n\nLater in 1994, Grohl played drums on two tracks for Mike Watt's Ball-Hog or Tugboat?. In early 1995, Grohl and Foo Fighters played their first US tour opening for Watt, and helped make up Watt's supporting band. Nicknamed the \"Ringspiel\" tour, Watt's band featured Grohl and William Goldsmith on drums, Eddie Vedder and Pat Smear on guitar, and Watt on bass.\n\nDuring the early 2000s, Grohl spent time in his basement studio writing and recording a number of songs for a metal project. Over the span of several years, he recruited his favorite metal vocalists from the 1980s, including Lemmy of Motörhead, Conrad \"Cronos\" Lant from Venom, King Diamond, Scott Weinrich, Snake of Voivod and Max Cavalera of Sepultura, to perform the vocals for the songs. The project was released in 2004 under the moniker Probot.D'Angelo, Joe . \"[http://www.mtv.com/news/articles/1438589/20010129/foo_fighters.jhtml \"Dave Grohl Preps A 'Death Metal Supernatural' With Probot\"]\". mtv.com. January 29, 2001.Thompson, Ben. \"[https://www.independent.co.uk/arts-entertainment/music/features/dave-grohl-release-the-probot-558523.html \"Dave Grohl: Release the Probot\"]\". independent.co.uk. April 2, 2004.\n\nAlso in 2003, Grohl stepped behind the kit to perform on Killing Joke's second self-titled album. The move surprised some Nirvana fans, given that Nirvana had been accused of stealing the opening riff of \"Come as You Are\" from Killing Joke's 1984 song \"Eighties\". However, the controversy failed to create a lasting rift between the bands. Foo Fighters covered Killing Joke's \"Requiem\" during the late 1990s, and were even joined by Killing Joke singer Jaz Coleman for a performance of the song at a show in New Zealand in 2003. Also in 2003, at the 2003 Grammy Awards, Grohl performed in an ad-hoc supergroup with Bruce Springsteen, Elvis Costello, and Steven Van Zandt for a performance in tribute of then-recently deceased singer/guitarist Joe Strummer.\n\nGrohl lent his drumming skills to other artists during the early 2000s. In 2000, he played drums and sang on a track, \"Goodbye Lament\", from Tony Iommi's album Iommi. In 2001, Grohl performed on Tenacious D's debut album, and appeared in the video for lead single \"Tribute\" as a demon. He later appeared in the duo's 2006 movie Tenacious D in The Pick of Destiny as the devil in the song \"Beelzeboss\", and performed on its soundtrack. He also performed drums for their 2012 album Rize of the Fenix. In 2002, Grohl helped Chan Marshall of Cat Power on the album You Are Free and played with Queens of the Stone Age on their album Songs for the Deaf. Grohl also toured with the band in support of the album, delaying work on the Foo Fighters' album One by One. In 2004, Grohl drummed on several tracks for Nine Inch Nails' 2005 album With Teeth. He also drummed on the song \"Bad Boyfriend\" on Garbage's 2005 album Bleed Like Me. Most recently, he recorded all the drums on Juliette and the Licks's 2006 album Four on the Floor and the song \"For Us\" from Pete Yorn's 2006 album Nightcrawler. Beyond drumming, Grohl contributed guitar to a cover of Neil Young's \"I've Been Waiting For You\" on David Bowie's 2002 album Heathen.\n\nIn June 2008, Grohl was Paul McCartney's special guest for a concert at the Anfield football stadium in Liverpool, in one of the central events of the English city's year as European Capital of Culture. Grohl joined McCartney's band singing backup vocals and playing guitar on \"Band on the Run\" and drums on \"Back in the U.S.S.R.\" and \"I Saw Her Standing There\". Grohl also performed with McCartney at the 51st Grammy Awards, again playing drums on \"I Saw Her Standing There\". Grohl also helped pay tribute to McCartney at the 2010 Kennedy Center Honors along with No Doubt, Norah Jones, Steven Tyler, James Taylor, and Mavis Staples. He sang a duet version of \"Maybe I'm Amazed\" with Norah Jones on December 5, 2010.\n\nGrohl played drums on the tracks \"Run with the Wolves\" and \"Stand Up\" on The Prodigy's 2009 album Invaders Must Die.\n\nIn July 2009, it was revealed that Grohl was recording with Josh Homme and John Paul Jones as Them Crooked Vultures. The trio performed their first show together on August 9, 2009, at Metro in Chicago. The band played their first UK gig on August 26, 2009, with a surprise appearance at Brixton Academy in London, supporting the Arctic Monkeys. The band released their debut album Them Crooked Vultures on November 16, 2009 in the UK and November 17, 2009 in the US.\n\nOn February 6, 2010, Grohl performed with his band Them Crooked Vultures the songs \"Mind Eraser, No Chaser\" and \"New Fang\" as musical guests on Saturday Night Live Dave Grohl appeared as an old punk rock drummer reuniting the group \"Crisis of Conformity\" after 25 years in a skit later on in the episode.\n\nIn mid-2010, Dave Grohl added his name to the list of contributing rock star voice cameos for Cartoon Network's heavy metal parody/tribute show, Metalocalypse. He voiced the controversial Syrian dictator, Abdule Malik in the season 3 finale, Doublebookedklok.\n\nOn October 23, 2010, Grohl performed with Tenacious D at Blizzcon. He appeared as the drummer for the entire concert, and a year later he returned with Foo Fighters and played another set there, this time as guitarist and vocalist.\n\nAlso in 2010, Grohl helped write and performed on drums for \"Watch This\" with guitarist Slash and Duff McKagan on Slash's self-titled album that also included many other famous artists.\n\nIn October 2011, Grohl temporarily joined Cage the Elephant as a replacement on tour after drummer Jared Champion's appendix burst.\n\nGrohl directed a documentary entitled Sound City which is about the Van Nuys studio of the same name where Nevermind was recorded that shut down its music operations in 2011.\n\nOn November 6, 2012, following the departure of Joey Castillo from Queens of the Stone Age, Grohl has been confirmed as the drummer for the band on the upcoming album.\n\nAt the 12-12-12 Sandy benefit concert Paul McCartney joined Grohl and the surviving members of Nirvana (Krist Novoselic and touring guitarist Pat Smear) to perform \"Cut Me Some Slack\", a song later recorded for the Sound City soundtrack. In what was regarded as a Nirvana reunion with McCartney as a stand-in for Kurt Cobain, this was the first time in eighteen years that the three had played alongside each other.\n\nIn February 2013, Grohl filled in as host of Chelsea Lately for a week. Guests included Elton John, who disclosed on the E! show that he would appear with Grohl on the next Queens of the Stone Age album. Grohl had previously hosted the show during the first week of December 2012 as part of \"Celebrity Guest Host Week\".\n\nGrohl delivered a keynote speech at the 2013 SXSW conference in Austin Texas, US on the morning of March 14. Lasting just under an hour, the speech covered Grohl's musical life from his youth through to his role with the Foo Fighters and emphasized the importance of each individual's voice, regardless of who the individual is: \"There is no right or wrong—there is only your voice... What matters most is that it’s your voice. Cherish it. Respect it. Nurture it. Challenge it. Respect it\". Grohl also admitted during the speech that Psy's \"Gangnam Style\" was one of his favorite songs of \"the past decade\". He also referenced Edgar Winter's instrumental \"Frankenstein\" as being the song that made him want to become a musician.\n\nOn November 6, 2013, Dave Grohl played drums at the 2013 CMA Awards replacing drummer Chris Fryar for Country Music band Zac Brown Band. The band debuted their new song \"Day for the Dead\". Grohl also produced Zac Brown Band's EP The Grohl Sessions, Vol. 1.\n\nGrohl also featured on drums for new indie hip hop band RDGLDGRN. He worked with them closely on their EP. The group asked fellow Northern Virginia native Dave Grohl, who was filming his Sound City documentary, to drum on \"I Love Lamp\". Grohl agreed and played drums for the entire record, with the exception of \"Million Fans\", which features a sampled breakbeat.\n\nGrohl, a fan of the theatrical Swedish metal band Ghost (also known as Ghost B.C. especially in America) produced their album If You Have Ghost. He was also featured in a number of songs on the album. Grohl played rhythm guitar for the song If You Have Ghosts (a cover of a Roky Erickson song), and drums on I'm a Marionette (an ABBA cover) as well as Waiting for the Night (a Depeche Mode cover). According to a member of Ghost, Grohl has appeared live in concert with the band wearing the same identity concealing outfit that the rest of the band usually wears.\n\nOn May 20, 2015, David Letterman selected Grohl and The Foo Fighters to play \"Everlong\" as the last musical guest on the final episode of Late Show with David Letterman. Letterman stated that he considered \"Everlong\" to be his favorite song and that he and the band were \"joined at the hip\" ever since the band canceled tour dates to play his first show back from heart bypass surgery at his request.\n\nIn September, the all-star covers album by the Alice Cooper-led Hollywood Vampires supergroup was released and features Grohl playing drums on the medley \"One/Jump into The Fire\".\n\nOn December 1, 2015 Grohl appeared on an episode of The Muppets where he competed in a \"drum off\" with Animal.\n\nPersonal life \n\nGrohl was married to photographer Jennifer Youngblood from 1994 to 1997. On August 2, 2003, he married Jordyn Blum. Together, they have three daughters: Violet Maye (born April 15, 2006), Harper Willow (born April 17, 2009), and Ophelia Saint (born August 1, 2014).\n\nIn 2012, Grohl was estimated to be the third wealthiest drummer in the world, behind Ringo Starr and Phil Collins, with a fortune of $260 million. Also, because of drumming and songwriting, Grohl is considered by Ken Micallef, co-author of Classic Rock Drummers, to be one of the most influential rock musicians of the past 20 years.\n\nGrohl dropped out of high school at the beginning of the 11th grade. He still does not know how to read sheet music and writes his music only by ear.\n\nAdvocacy, philanthropy and views \n\nGrohl has been vocal in his views on drug misuse, contributing to a 2009 anti-drug video for the BBC. \"I have never done cocaine, ever in my life. I have never done heroin, I have never done speed,\" he said in a 2008 interview, adding that he stopped smoking cannabis and taking LSD at the age of 20. In the BBC video, he said, \"I've seen people die. It ain't easy being young, but that stuff doesn't make it any easier\".\n\nIn May 2006, Grohl sent a note of support to the two trapped miners in the Beaconsfield mine collapse in Tasmania, Australia. In the initial days following the collapse, one of the men requested an iPod with the Foo Fighters album In Your Honor, to be sent down to them through a small hole. Grohl's note read, in part, \"Though I'm halfway around the world right now, my heart is with you both, and I want you to know that when you come home, there's two tickets to any Foos show, anywhere, and two cold beers waiting for yous. Deal?\" In October 2006, one of the miners took up his offer, joining Grohl for a drink after a Foo Fighters acoustic concert at the Sydney Opera House. Grohl wrote an instrumental piece for the meeting, which he pledged he would include on the band's next album. The song, titled \"Ballad of the Beaconsfield Miners\", appears on Foo Fighters' 2007 release Echoes, Silence, Patience & Grace, and features Kaki King.\n\nGrohl is an advocate for LGBT rights. He has worn a White Knot ribbon to various events to promote whiteknot.org. When questioned about the knot, he responded, \"You know what that's about? I believe in love and I believe in equality and I believe in marriage equality\". Grohl's gay rights activism dates back to the early 1990s, when he and the other members of Nirvana performed at a benefit to raise money to fight Oregon Ballot Measure 9. \"Measure 9 goes against American traditions of mutual respect and freedom, and Nirvana wants to do their part to end bigotry and narrow-mindedness everywhere,\" the group stated. The ballot measure was ultimately defeated on November 3, 1992. Grohl has also participated in two counter-protests against the Westboro Baptist Church for their anti-gay stance, once by performing \"Keep It Clean\" on the back of a flatbed truck and most recently by Rickrolling them.\n\nGrohl is a Democrat. He supported President Barack Obama, and performed \"My Hero\" in September at the 2012 Democratic National Convention in Charlotte, North Carolina.\n\nHonors \n\nIn August 2009, Grohl was given the key to the city of Warren, Ohio and performed the songs \"Everlong\", \"Times Like These\", and \"My Hero\". A roadway in downtown Warren named \"David Grohl Alley\" has been dedicated to him with murals by local artists.\n\nDave Grohl's hometown of Warren, Ohio unveiled gigantic 409 kg drumsticks in 2012 to honor him. According to The Hollywood Reporter, the massive pair broke the Guinness World Record. The record-breaking drumsticks were shown to the public for the first time on July 7 during a concert at the Warren Amphitheater.\n\nOn November 11, 2014, Grohl joined Bruce Springsteen and Zac Brown on stage at the Concert for Valor in Washington, D.C. to support U.S. troops and veterans.\n\nGrohl's first solo Rolling Stone cover story appeared on December 4, 2014.\n\nLegal issues \n\nIn 2000, while on tour with Foo Fighters in Australia, Grohl was arrested by Australian police while driving a scooter for driving under the influence following a concert on the Gold Coast in Queensland. He was fined $400 and had his Australian driving permit revoked for three months. Following the incident, Grohl stated, \"So, people, I guess if there's anything to learn here, it's: don't drive after a few beers, even if you feel entirely capable like I did\".\n\nDiscography \n\nFilmography. Dave Grohl. http://en.wikipedia.org/?curid=8099."
  }
}
