{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10825",
  "eid" : "f7f15f00-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778495728,
  "textBody" : "The Free Democratic Party (, FDP) is a liberal and classical liberal political party in Germany. The FDP is led by Christian Lindner.\n\nThe FDP was founded in 1948 by members of the former liberal political parties existing in Germany before World War II, the German Democratic Party and the German People's Party.  For most of the Federal Republic's history, it has held the balance of power in the Bundestag.  It was a junior coalition partner to either the CDU/CSU (1949–56, 1961–66, 1982–98, and 2009–13) or the Social Democratic Party of Germany (1969–82).\n\nHowever, in the 2013 federal election the FDP failed to win any directly elected seats in the Bundestag, and came up short of the 5 percent threshold to qualify for list representation.  The FDP was therefore left without representation in the Bundestag for the first time in its history. In the federal election of 2017, the FDP regained its representation in the Bundestag, receiving 10.6% of the vote.\n\nThe FDP strongly supports human rights, civil liberties, and internationalism. The party is traditionally considered centre-right. Since the 1980s, the party has firmly pushed economic liberalism, and has aligned itself closely to the promotion of free markets and privatisation. It is a member of the Liberal International and Alliance of Liberals and Democrats for Europe (ALDE).\n\nHistory\n\nSoon after World War II, the Soviet Union forced the creation of political parties. In July 1945 William Kulice and Eugen Schiffer called for the establishment of a pan-German Party, whose constitution the Allies hesitantly approved only in the Soviet occupation zone as the Liberal Democratic Party of Germany. In September 1945, citizens in Hamburg established the Party of Free Democrats (PFD) as a bourgeois Left Party and the first Liberal Party in the Western zones. In the first state elections in Hamburg in October 1946 the party won 18.2 percent of the vote. The FDP secured between 7.8 and 29.9 percent of the 1946 vote in Greater Berlin (East) and Saxony, the only states in Soviet-occupied territories that held free parliamentary elections. However, it had to support the policies of the Socialist Unity Party of Germany (SED) and join the National Front of the GDR as a \"bloc party\". Following the FDP's success, liberal parties were founded across the states. The FDP won Hesse's 1950 state election with 31.8 percent, the best result in its history, through appealing to East Germans displaced by the war by including them on their ticket.\n\nFounding of the party\n\nThe Democratic Party of Germany (DPD) was established in Rothenburg ob der Tauber on 17 March 1947 as a pan-German Party. Its leaders were Theodor Heuss and Wilhelm Külz. However, the project failed as a result of disputes over Külz's political direction.\n\nThe Free Democratic Party was established on 11–12 December 1948 in Heppenheim, in Hesse, as an association of all 13 regional liberal party organizations in the three Western zones of occupation. The proposed name, Liberal Democratic Party (LDP), was rejected by the delegates, who voted 64 to 25 in favour of the name Free Democratic Party (FDP).\n\nThe party's first chairman was Theodor Heuss; his deputy was Franz Blücher. The place for the party's foundation was chosen deliberately: it was at the Heppenheim Assembly that the moderate liberals had met in October 1847 before the March Revolution. \nSome regard the \"Heppenheim Assembly\", which was held at the Halber Mond (Half Moon) Hotel on 10 October 1847, as a meeting of leading liberals that was the beginning of the German Revolution of 1848-49.\n\nUp to the 1950s, several of the FDP's regional organizations were to the right of the CDU/CSU, which initially had ideas of some sort of Christian socialism, and even former office-holders of the Third Reich were courted with national, patriotic values.\n\nThe FDP was founded on 11 December 1948 through the merger of nine regional liberal parties formed in 1945 from the remnants of the pre-1933 German People's Party (DVP) and the German Democratic Party (DDP), which had been active in the Weimar Republic.These nine regionally organised liberal parties were the Bremian Democratic People's Party (BDV) in the state of Bremen, the Democratic Party of Southern and Middle Baden (DemP) in the State of South Baden, the Democratic Party (DP) in the State of Rhineland-Palatinate, the Democratic People's Party of Northern Württemberg-Northern Baden (DVP) in the State of Württemberg-Baden, the Democratic People's Party of Southern Württemberg-Hohenzollern (DVP) in the State of Württemberg-Hohenzollern, the united Free Democratic Party (F.D.P.) of the British zone of occupation, the Free Democratic Party (F.D.P.) in the Free State of Bavaria, the Liberal Democratic Party (LDP) in the State of Hesse, and the Liberal Democratic Party (LDP) of Berlin (West). Cf. Almut Leh and Alexander von Plato, Ein unglaublicher Frühling: erfahrene Geschichte im Nachkriegsdeutschland 1945 - 1948,  Bundeszentrale für Politische Bildung (ed.), Bonn: Bundeszentrale für Politische Bildung, 1997, p. 77.  The FDP's first Chairman, Theodor Heuss, was formerly a member of the DDP and after the war of the Democratic People's Party (DVP).\n\n1949–69: The reconstruction of Germany\n\nIn the first elections to the Bundestag on 14 August 1949, the FDP won a vote share of 11.9 percent (with 12 direct mandates, particularly in Baden-Württemberg and Hesse), and thus obtained 52 of 402 seats. In September of the same year the FDP chairman Theodor Heuss was elected the first President of the Federal Republic of Germany. In his 1954 re-election, he received the best election result to date of a President with 871 of 1018 votes (85.6 percent) of the Federal Assembly. Adenauer was also elected on the proposal of the new German President with an extremely narrow majority as the first Chancellor. The FDP participated with the CDU/CSU and the DP in Adenauer's coalition cabinet: they had three ministers: Franz Blücher (Vice-Chancellor), Thomas Dehler (Justice) and Eberhard Wildermuth (housing).\n\nOn the most important economic, social and German national issues, the FDP agreed with their coalition partners, the CDU/CSU. However, the FDP recommended to the bourgeois voters a secular party that refused the religious schools and  accused the opposition parties of clericalization. The FDP said they were known also as a consistent representative of the market economy, while the CDU was then dominated nominally from the Ahlen Programme, which allowed a Third Way between capitalism and socialism. Ludwig Erhard, the \"father\" of the social market economy, had his followers in the early years of the Federal Republic in the Union rather than in the FDP.\n\nThe FDP voted in parliament at the end of 1950 against the CDU- and SPD- introduced de-nazification process. At their party conference in Munich in 1951 they demanded the release of all \"so-called war criminals\" and welcomed the establishment of the \"Association of German soldiers\" of former Wehrmacht and SS members, to advance the integration of the nationalist forces in democracy. The 1953 Naumann-Affair, named after Werner Naumann, identifies old Nazis trying to infiltrate the party, which had many right-wing and nationalist members in Hesse, North Rhine-Westphalia and Lower Saxony. After the British occupation authorities had arrested seven prominent members of the Naumann circle, the FDP federal board installed a commission of inquiry, chaired by Thomas Dehler, which particularly sharply criticized the situation in the North Rhine-Westphalian FDP. In the following years, the right wing lost power, and the extreme right increasingly sought areas of activity outside the FDP. In the 1953 federal election the FDP received 9.5 percent of the party votes, 10.8 percent of the primary vote (with 14 direct mandates, particularly in Hamburg, Lower Saxony, Hesse, Württemberg and Bavaria) and 48 of 487 seats.\n\nIn the second term of the Bundestag, the South German Liberal democrats gained influence in the party. Thomas Dehler, a representative of a more left-liberal course took over as party and parliamentary leader. The former Minister of Justice Dehler, who in 1933 suffered persecution by the Nazis, was known for his rhetorical focus. Generally the various regional associations were independent and translated so different from country to country accents in liberal politics. After the FDP had left in early 1956, the coalition with the CDU in North Rhine-Westphalia and made with SPD and center a new state government, were a total of 16 members of parliament, including the four federal ministers from the FDP and founded the short-lived Free People's Party, which then up was involved to the end of the legislature instead of FDP in the Federal Government. The FDP first took it to the opposition.\n\nOnly one of the smaller post-war parties, the FDP survived despite many problems. In 1957 federal elections they still reached 7.7 percent of the vote to 1990 and their last direct mandate with which they had held 41 of 497 seats in the Bundestag. However, they still remained in opposition, because the Union won an absolute majority. In the following example, the FDP sat for a nuclear-free zone in Central Europe.\n\nEven before the election Dehler was assigned as party chairman. At the federal party in Berlin at the end January 1957 relieved him Reinhold Maier. Dehler's role as Group Chairman took over after the election of the national set very Erich Mende. Mende was also chairman of the party.\n\nIn the 1961 federal elections, it achieved 12.8 percent nationwide, the best result until then, and the FDP entered a coalition with the CDU again. Although it was committed before the election to continuing to sit in any case in a government together with Adenauer, Chancellor Adenauer was again, however, to withdraw under the proviso, after two years. These events led to the FDP being nicknamed the Umfallerpartei (\"pushover party\").[https://books.google.co.uk/books?idOThqlaLQjFIC&lpg\nPA65&otsV0g4UTCK6k&dq\n%E2%80%9EUmfaller-Partei%E2%80%9C%201961&pgPA65#v\nonepage&q%E2%80%9EUmfaller-Partei%E2%80%9C%201961&f\nfalse Die Bundesrepublik Deutschland: eine Bilanz nach 60 Jahren], Hans-Peter Schwarz, Böhlau Verlag Köln Weimar, 2008, page 66\n\nIn the Spiegel Affair, the FDP withdrew their ministers from the federal government. Although the coalition was renewed again under Adenauer in 1962, the FDP withdrew again on the condition in October 1963. This occurred even under the new Chancellor, Ludwig Erhard. This was for Erich Mende turn the occasion to go into the cabinet: he took the rather unimportant Federal Ministry for All-German Affairs.\n\nIn the 1965 federal elections the FDP gained 9.5 percent. The coalition with the CDU in 1966 broke on the subject of tax increases and it was followed by a grand coalition between the CDU and the SPD. The opposition also pioneered a course change to: The former foreign policy and the attitude to the eastern territories were discussed. The new chairman elected delegates in 1968 Walter Scheel, a European-oriented liberals, although it came from the national liberal camp, but with Willi Weyer and Hans-Dietrich Genscher led the new center of the party. This center strove to make the FDP coalition support both major parties. Here, the Liberals approached to by their reorientation in East Germany and politics especially of the SPD.\n\n1969–82: Social changes and crises\n\nOn 21 October 1969 began the period after the election of a Social-Liberal coalition with the SPD and the German Chancellor Willy Brandt. Walter Scheel was he who initiated the foreign policy reversal. Despite a very small majority he and Willy Brandt sat by the controversial New Ostpolitik. This policy was within the FDP quite controversial, especially since after the entry into the Federal Government defeats in state elections in North Rhine-Westphalia, Lower Saxony and Saarland on 14 June 1970 followed. In Hanover and Saarbrücken, the party left the parliament.\n\nAfter the federal party congress in Bonn, just a week later supported the policy of the party leadership and Scheel had confirmed in office, founded by Siegfried party rights Zoglmann 11 July 1970 a \"non-partisan\" organization called the National-Liberal action on the Hohensyburgstraße - to fall with the goal of ending the left-liberal course of the party and Scheel. However, this was not. Zoglmann supported in October 1970 a disapproval resolution of opposition to Treasury Secretary Alexander Möller, Erich Mende, Heinz Starke, and did the same. A little later all three declared their withdrawal from the FDP; Mende and Strong joined the CDU in, Zoglmann later founded the German Union, which does not make it past the status of a splinter party.\n\nThe foreign policy and the socio-political changes were made in 1971 by the Freiburg theses, which were as Rowohlt Paperback sold more than 100,000 times, on a theoretical basis, the FDP is committed to \"social liberalism\" and social reforms. Walter Scheel was first foreign minister and vice chancellor, 1974, he was then second-liberal President and paving the way for inner-party the previous interior minister Hans-Dietrich Genscher free.\n\nFrom 1969 to 1974 the FDP supported the SPD Chancellor Willy Brandt, who was succeeded by Helmut Schmidt. Already by the end of the 70s there did not seem to be enough similarities between the FDP and the SPD to form a new coalition, but the CDU / CSU chancellor candidate of Franz Josef Strauss in 1980 pushed the parties to run together again. The FDP's policies, however, began to drift apart from the SPD's, especially when it came to the economy. Within the SPD, there was strong grassroots opposition to Chancellor Helmut Schmidt's policies on the Nato Double-Track Decision. However, within the FDP, the conflicts and contrasts were always greater.\n\n1982–98: joined Kohl government, with economic transition and reunification\n\nOn 1 October 1982, FDP elected, together with the CDU / CSU parliamentary group of the CDU, party chairman Helmut Kohl as the new Chancellor. The coalition change resulted in severe internal conflicts, and the FDP then lost about 20 percent of its 86,500 members, as reflected in the general election in 1983 by a drop from 10.6 percent to 7.0 percent. The members went mostly to the SPD, the Greens and newly formed splinter parties, such as the left-liberal party Liberal Democrats (LD). The exiting members included the former FDP General Secretary and later EU Commissioner Günter Verheugen. At the party convention in November 1982, the Schleswig-Holstein state chairman Uwe Ronneburger challenged Hans-Dietrich Genscher as party chairman. Ronneburger received 186 of the votes - about 40 percent - and was just narrowly defeated by Genscher.\n\nYoung FDP members who did not agree with the politics of the FDP youth organization Young Democrats had founded in 1980 the Young Liberals (JuLis). For a time there were two youth organizations side by side, until the JuLis became the new official youth wing of the FDP. The Young Democrats split from the FDP and were left as a party-independent youth organization.\n\nAt the time of reunification, the FDP's objective was a special economic zone in the former East Germany, but could not prevail against the CDU / CSU, as this would prevent any loss of votes in the five new federal states in the general election in 1990.\n\nIn all federal election campaigns since the 1980s, the party sided with the CDU and CSU, the main conservative parties in Germany.  Following German reunification in 1990, the FDP merged with the Association of Free Democrats, a grouping of liberals from East Germany and the Liberal Democratic Party of Germany.\n\nDuring the political upheavals of 1989/1990 in the GDR new liberal parties emerged, like the FDP East Germany or the German Forum Party. They formed the Liberal Democratic Party, who had previously acted as a block party on the side of the SED and with Manfred Gerlach also the last Council of State of the GDR presented, the Alliance of Free Democrats, (BFD). Within the FDP came in the following years to considerable internal discussions about dealing with the former block party. Even before the reunification of Germany united on a joint congress in Hanover, the West German FDP united with the other parties to form the first all-German party. Both party factions brought the FDP a great, albeit short-lived, increase in membership. In the first all-German Bundestag elections, the CDU/CSU/FDP center-right coalition was confirmed, the FDP received 11.0 percent of the valid votes (79 seats) and won (in Halle (Saale)) the first direct mandate since 1957.\n\nDuring the 1990s, the FDP won between 6.2 and 11 percent of the vote in Bundestag elections. It last participated in the federal government by representing the junior partner in the government of Chancellor Helmut Kohl of the CDU.\n\nIn 1998, the CDU/CSU - FDP coalition lost the federal election, which ended the FDP's nearly 30-year reign in government. In its 2002 campaign the FDP made an exception to its party policy of siding with the CDU/CSU when it adopted equidistance to the CDU and SPD. From 1998 until 2009 the FDP remained in the opposition until it became part of a new center-right coalition government.\n\n2005 federal election\n\nIn the 2005 general election the party won 9.8 percent of the vote and 61 federal deputies, an unpredicted improvement from prior opinion polls. It is believed that this was partly due to tactical voting by CDU and Christian Social Union of Bavaria (CSU) alliance supporters who hoped for stronger market-oriented economic reforms than the CDU/CSU alliance called for. However, because the CDU did worse than predicted, the FDP and the CDU/CSU alliance were unable to form a coalition government. At other times, for example after the 2002 federal election, a coalition between the FDP and CDU/CSU was impossible primarily because of the weak results of the FDP.\n\nThe CDU/CSU parties had achieved the 3rd worst performance in German postwar history with only 35.2 percent of the votes. Therefore, the FDP wasn't able to form a coalition with its preferred partners, the CDU/CSU parties. As a result, the party was considered as a potential member of two other political coalitions, following the election. One possibility was a partnership between the FDP, the Social Democratic Party of Germany (SPD) and the Alliance 90/The Greens, known as a \"traffic light coalition\", named after the colors of the three parties. This coalition was ruled out, because the FDP considered the Social Democrats and the Greens insufficiently committed to market-oriented economic reform. The other possibility was a CDU-FDP-Green coalition, known as a \"Jamaica coalition\" because of the colours of the three parties. This coalition wasn't concluded either, since the Greens ruled out participation in any coalition with the CDU/CSU. Instead, the CDU formed a Grand coalition with the SPD, and the FDP entered the opposition. FDP leader Guido Westerwelle became the unofficial leader of the opposition by virtue of the FDP's position as the largest opposition party in the Bundestag.\n\nIn the 2009 European parliament elections, the FDP received 11% of the national vote (2,888,084 votes in total) and returned 12 MEPs.\n\n2009 federal election\n\nIn the national vote on 27 September 2009 the FDP increased its share of the vote by 4.8 percentage points to 14.6%, an all-time record so far. This percentage was enough to offset a decline in the CDU/CSU's vote compared to 2005, to create a CDU-FDP governing coalition in the Bundestag with a 53% majority of seats.  On election night, party leader Westerwelle said his party would work to ensure that civil liberties were respected and that Germany got an \"equitable tax system and better education opportunities\".[http://www.dw-world.de/dw/article/0,,4728511,00.html Merkel to head new center-right government] Deutsche Welle 27 September 2009.\n\nThe party also made gains in the two state elections held at the same time, acquiring sufficient seats for a CDU-FDP coalition in the northernmost state, Schleswig-Holstein, and gaining enough votes in left leaning Brandenburg to clear the 5% hurdle to enter that state's parliament.\n\nHowever, after reaching its best ever election result in 2009, the FDP's support collapsed. The party’s policy pledges were put on hold by Merkel as the recession of 2009 unfolded and with the onset of the European debt crisis in 2010.Brian Parkin and Tony Czuczka (23 September 2013), [https://www.bloomberg.com/news/2013-09-22/german-king-makers-fdp-face-parliamentary-exile-after-64-years.html German ‘King Makers’ FDP Face Parliamentary Exile] Bloomberg News. By the end of 2010, the party's support had dropped to as low as 5%. The FDP retained their seats in the state elections in North Rhine-Westphalia, which was held six months after the federal election, but out of the seven state elections that have been held since 2009, the FDP have lost all their seats in five of them due to failing to cross the 5% threshold.\n\nSupport for the party further eroded amid infighting and an internal rebellion over euro-area bailouts during the debt crisis.Leon Mangasarian (17 September 2013), [https://www.bloomberg.com/news/2013-09-16/merkel-s-fdp-ally-begs-for-her-party-s-votes-in-survival-fight.html Merkel's FDP Ally Begs for Her Party’s Votes in Survival Fight] Bloomberg News.\n\nWesterwelle stepped down as party leader in 2011 after the party was wiped out in both Saxony-Anhalt and Rhineland-Palatinate, as well as losing half its seats in Baden-Württemberg. He was replaced on 13 May 2011 by Philipp Rösler. The change in leadership failed to revive the FDP's fortunes, however, and in the next series of state elections, the party lost all its seats in Bremen, Mecklenburg-Vorpommern, and Berlin. In Berlin, the party lost nearly 75% of the support they had had in the previous election.\n\nIn March 2012, the FDP lost all their seats in Saarland. However, this was averted in the Schleswig-Holstein state elections, when they achieved 8% of the vote, which was a severe loss of seats but still over the 5% threshold. In the snap elections in North Rhine-Westphalia a week later, the FDP not only crossed the threshold, but also increased its share of the votes to 2 percentage points higher than in the previous state election. This was attributed to the local leadership of Christian Lindner.\n\n2013 federal election\n\nThe FDP last won a directly elected seat in 1990—the only time it has won a directly elected seat since 1957. The party's inability to win directly elected seats came back to haunt it at the 2013 election, in which it came up just short of the 5% threshold. With no directly elected seats, the FDP was shut out of the Bundestag for the first time since 1949. After the previous chairman Philipp Rösler then resigned, Christian Lindner took over the leadership of the party.\n\n2014  election\n\nIn the 2014 European parliament elections, the FDP received 3.36% of the national vote (986,253 votes in total) and returned 3 MEPs. In the Brandenburg state election, 2014 the party experienced a 5.8% down-swing and lost all their representatives in the Brandenburg state parliament. In the Saxony state election, 2014, the party experienced a 5.2% down-swing, again losing all of its seats. In the Thuringian state election, 2014 a similar phenomenon was repeated with the party falling below the 5% threshold following a 5.1% drop in popular vote.\n\n2015-present\n\nThe party managed to enter parliament in the Bremen state election, 2015 with the party receiving 6.5% of the vote and gaining 6 seats. However, it failed to get into government as a coalition between the Social Democrats and the Greens was created. In the Mecklenburg-Vorpommern state election, 2016 the party failed to get into parliament despite increasing its vote share by 0.3%. The party did manage to get into parliament in Baden-Württemberg, gaining 3% of the vote and a total of 12 seats. This represents a five-seat improvement over their previous results. In the Berlin state election, 2016 the party gained 4.9% of the vote and 12 seats but still failed to get into government. A red-red-green coalition was instead formed relegating the FDP to the opposition. In the Rhineland-Palatinate state election, 2016, the party managed to enter parliament receiving 6.2% of the vote and 7 seats. It also managed to enter government under a traffic light coalition. In Saxony-Anhalt state election, 2016 the party narrowly missed the 5% threshold, receiving 4.9% of the vote and therefore receiving zero seats despite a 1% swing in their favour.\n\nThe North Rhine-Westphalia state election, 2017 was widely considered a test of the party's future as their chairman Christian Lindner was also leading the party in that state. The party experienced a 4% swing in its favour gaining 6 seats and entering into a coalition with the CDU with a bare majority. In the Saarland state election, 2017 the party again failed to gain any seats despite a 1% swing in their favour. The party gained 3 seats and increased its vote share by 3.2% in the Schleswig-Holstein state election, 2017. This success was often credited to their state chairman Wolfgang Kubicki. They also managed to re-enter the government under a Jamaica coalition, and reentered the Bundestag in the federal election later that year with 10.7% of second votes.\n\nIdeology\n\nThe FDP adheres to a classical liberal ideology, advocating liberalism in both the economic sphere and social sphere.  The current guidelines of the FDP are enshrined in the \"Principles of Wiesbaden\". A key objective of the FDP is the \"strengthening of freedom and individual responsibility\".\n\nThroughout its history, the FDP's policies have shifted between emphasis on social liberalism and economic liberalism.  Since the 1980s, the FDP has maintained a consistent pro-business stance. The FDP supports strong competition laws and a minimum standard of welfare protection for every citizen. In addition, the FDP endorses changes to social welfare and health care systems with laws that would require every employed citizen to invest in a private social security account. The party supports a bracket income tax system, as opposed to the current 'linear' system, and, in the long term, a flat tax. The FDP aims for the introduction of a citizen's dividend, which collects all the tax-financed social welfare and social security funds of the state.\n\nThe FDP supports LGBT rights; former party leader Guido Westerwelle was openly gay. Yet the party's group in parliament voted against an oppositional motion for gay marriage, in order not to threaten the coalition with the Christian Democrats.\n\nThe FDP describes itself as a pro-European party, although the minority national-liberal faction is Eurosceptic.  The FDP wants a politically integrated EU with a Common Foreign and Security Policy, but supported a referendum on the Treaty of Lisbon.\n\nPolicies \n\nThe basic concept of the FDP is liberalism, which it has traditionally represented in Germany. Its fundamental ideal is therefore in the freedom of man, especially before state power. The focus of the FDP on the Political Compass is described as almost unaffected by economic and market liberalism. Regarding the political compass:\n\nThe current FDP guidelines are anchored in the 'Karlsruhe Freiheitsthesen'. These were decided upon at the 63rd Annual Federal Parliamentary Conference on 22 April 2012 in Karlsruhe.\n\nEconomic Policy \n\nThe economic policy of the FDP is based on liberal and social market economy.\n\nIt calls for a state regulatory policy which creates the appropriate framework for this but does not distort the market through excessive state interventionism.\n\nThe main objective is to create jobs by improving the investment in the economy. This will be achieved through bureaucracy reduction, privatization, deregulation, reduction of subsidies and a reform of the collective bargaining. The party sees  globalization as an opportunity creator.\n\nThe government debt is to be reduced. A balanced budget without new debt is something to strive for.\n\nIn the tax policy, a simpler tax law is called for. The Income Tax model provides for a Stufentarif. In the long term, a so-called flat tax is strived for. Tax cuts are designed to increase the purchasing power of workers and stimulate the economy.\n\nThe FDP rejects the nationwide minimum wage. On the other hand, wage ceilings are to be introduced which pay attention to the specific characteristics of the respective regions and industries.\n\nSocial policy \n\nIn social policy, the introduction of a Consolidated Welfare payments, in which all tax-financed social aid of the state is combined. This is a based of Negative Income Tax. It would have a work obligation like those found in present regulation.\n\nA common denominator of the Free Democrats is the critical attitude toward an overpowering of the state and to conservative or egalitarian corporate designs. According to the motto \"As much state as necessary, as little state as possible\", the FDP tries to limit the interference of the state with the life of the individual as far as possible. Therefore, it also rejects all elements of a monitoring country. A connecting element is the idea of \"creating and safeguarding the freedom of the individual\". Thus, it contributed almost all social liberalisations realized in the Federal Republic.\n\nHealth policy \n\nIn the field of health policy, the FDP argues for a reduction of bureaucratic Regulations. Also the physical self-determination is particularly emphasized. For example, each human being should also have the right in the context of medical treatment to freely determine his biology. In addition, the FDP aims to legalize cannabis.\n\nFamily policy \n\nThe FDP is committed to the legal equality of different forms of living together. Marriage between husband and wife should not be preferred to other forms of living together. Same-sex couples are to be given the same rights as heterosexual pairs — for example, the common right of adoption. The opening of marriage for same-sex couples is demanded. The income splitting should be retained. The expansion of kindergarten places is to be strengthened nationwide.\n\nElection results\n\nFederal Parliament (Bundestag)\n\nBelow are charts of the results that the Free Democratic Party has secured in each election to the federal Bundestag.  Timelines showing the number of seats and percentage of party list votes won are on the right.\n\nImageSize = width:525 height:150\nPlotArea = width:500 height:125 left:25 bottom:20\nAlignBars = justify\n\nColors =\n  id:FDP value:rgb(0.9999,0.926,0)\n\nDateFormat = yyyy\nPeriod = from:0 till:100\nTimeAxis = orientation:vertical\nScaleMajor = unit:year increment:10 start:0\n\nPlotData=\n bar:Seats color:FDP  width:24 mark:(line,white) align:left fontsize:S\n bar:1949  color:FDP  from:start till:52  text:52  align:center\n bar:1953  color:FDP  from:start till:48  text:48  align:center\n bar:1957  color:FDP  from:start till:41  text:41  align:center\n bar:1961  color:FDP  from:start till:67  text:67  align:center\n bar:1965  color:FDP  from:start till:49  text:49  align:center\n bar:1969  color:FDP  from:start till:30  text:30  align:center\n bar:1972  color:FDP  from:start till:41  text:41  align:center\n bar:1976  color:FDP  from:start till:39  text:39  align:center\n bar:1980  color:FDP  from:start till:53  text:53  align:center\n bar:1983  color:FDP  from:start till:34  text:34  align:center\n bar:1987  color:FDP  from:start till:46  text:46  align:center\n bar:1990  color:FDP  from:start till:79  text:79  align:center\n bar:1994  color:FDP  from:start till:47  text:47  align:center\n bar:1998  color:FDP  from:start till:43  text:43  align:center\n bar:2002  color:FDP  from:start till:47  text:47  align:center\n bar:2005  color:FDP  from:start till:61  text:61  align:center\n bar:2009  color:FDP  from:start till:93  text:93  align:center\n bar:2013  color:FDP  from:start till:0   text:0   align:center\n bar:2017  color:FDP  from:start till:80  text:80  align:center\n\nImageSize = width:525 height:150\nPlotArea = width:500 height:125 left:25 bottom:20\nAlignBars = justify\n\nColors =\n  id:FDP value:rgb(0.9999,0.926,0)\n\nDateFormat = yyyy\nPeriod = from:0 till:200\nTimeAxis = orientation:vertical\nScaleMajor = unit:year increment:50 start:0\n\nPlotData=\n bar:Vote% color:FDP  width:24 mark:(line,white) align:left fontsize:S\n bar:1949  color:FDP  from:start till:119 text:11.9 align:center\n bar:1953  color:FDP  from:start till:95  text:9.5  align:center\n bar:1957  color:FDP  from:start till:77  text:7.7  align:center\n bar:1961  color:FDP  from:start till:128 text:12.8 align:center\n bar:1965  color:FDP  from:start till:95  text:9.5  align:center\n bar:1969  color:FDP  from:start till:58  text:5.8  align:center\n bar:1972  color:FDP  from:start till:84  text:8.4  align:center\n bar:1976  color:FDP  from:start till:79  text:7.9  align:center\n bar:1980  color:FDP  from:start till:106 text:10.6 align:center\n bar:1983  color:FDP  from:start till:69  text:6.9  align:center\n bar:1987  color:FDP  from:start till:91  text:9.1  align:center\n bar:1990  color:FDP  from:start till:110 text:11.0 align:center\n bar:1994  color:FDP  from:start till:69  text:6.9  align:center\n bar:1998  color:FDP  from:start till:62  text:6.2  align:center\n bar:2002  color:FDP  from:start till:74  text:7.4  align:center\n bar:2005  color:FDP  from:start till:98  text:9.8  align:center\n bar:2009  color:FDP  from:start till:146 text:14.6 align:center\n bar:2013  color:FDP  from:start till:48  text:4.8  align:center\n bar:2017  color:FDP  from:start till:107 text:10.7 align:center\n\nEuropean Parliament\n\nState Parliaments\n\nLeadership\n\nParty chairmen\n\nLeaders in the Bundestag",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Free Democratic Party (Germany)" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10825" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Free Democratic Party (, FDP) is a liberal and classical liberal political party in Germany. The FDP is led by Christian Lindner.\n\nThe FDP was founded in 1948 by members of the former liberal political parties existing in Germany before World War II, the German Democratic Party and the German People's Party.  For most of the Federal Republic's history, it has held the balance of power in the Bundestag.  It was a junior coalition partner to either the CDU/CSU (1949–56, 1961–66, 1982–98, and 2009–13) or the Social Democratic Party of Germany (1969–82).\n\nHowever, in the 2013 federal election the FDP failed to win any directly elected seats in the Bundestag, and came up short of the 5 percent threshold to qualify for list representation.  The FDP was therefore left without representation in the Bundestag for the first time in its history. In the federal election of 2017, the FDP regained its representation in the Bundestag, receiving 10.6% of the vote.\n\nThe FDP strongly supports human rights, civil liberties, and internationalism. The party is traditionally considered centre-right. Since the 1980s, the party has firmly pushed economic liberalism, and has aligned itself closely to the promotion of free markets and privatisation. It is a member of the Liberal International and Alliance of Liberals and Democrats for Europe (ALDE).\n\nHistory\n\nSoon after World War II, the Soviet Union forced the creation of political parties. In July 1945 William Kulice and Eugen Schiffer called for the establishment of a pan-German Party, whose constitution the Allies hesitantly approved only in the Soviet occupation zone as the Liberal Democratic Party of Germany. In September 1945, citizens in Hamburg established the Party of Free Democrats (PFD) as a bourgeois Left Party and the first Liberal Party in the Western zones. In the first state elections in Hamburg in October 1946 the party won 18.2 percent of the vote. The FDP secured between 7.8 and 29.9 percent of the 1946 vote in Greater Berlin (East) and Saxony, the only states in Soviet-occupied territories that held free parliamentary elections. However, it had to support the policies of the Socialist Unity Party of Germany (SED) and join the National Front of the GDR as a \"bloc party\". Following the FDP's success, liberal parties were founded across the states. The FDP won Hesse's 1950 state election with 31.8 percent, the best result in its history, through appealing to East Germans displaced by the war by including them on their ticket.\n\nFounding of the party\n\nThe Democratic Party of Germany (DPD) was established in Rothenburg ob der Tauber on 17 March 1947 as a pan-German Party. Its leaders were Theodor Heuss and Wilhelm Külz. However, the project failed as a result of disputes over Külz's political direction.\n\nThe Free Democratic Party was established on 11–12 December 1948 in Heppenheim, in Hesse, as an association of all 13 regional liberal party organizations in the three Western zones of occupation. The proposed name, Liberal Democratic Party (LDP), was rejected by the delegates, who voted 64 to 25 in favour of the name Free Democratic Party (FDP).\n\nThe party's first chairman was Theodor Heuss; his deputy was Franz Blücher. The place for the party's foundation was chosen deliberately: it was at the Heppenheim Assembly that the moderate liberals had met in October 1847 before the March Revolution. \nSome regard the \"Heppenheim Assembly\", which was held at the Halber Mond (Half Moon) Hotel on 10 October 1847, as a meeting of leading liberals that was the beginning of the German Revolution of 1848-49.\n\nUp to the 1950s, several of the FDP's regional organizations were to the right of the CDU/CSU, which initially had ideas of some sort of Christian socialism, and even former office-holders of the Third Reich were courted with national, patriotic values.\n\nThe FDP was founded on 11 December 1948 through the merger of nine regional liberal parties formed in 1945 from the remnants of the pre-1933 German People's Party (DVP) and the German Democratic Party (DDP), which had been active in the Weimar Republic.These nine regionally organised liberal parties were the Bremian Democratic People's Party (BDV) in the state of Bremen, the Democratic Party of Southern and Middle Baden (DemP) in the State of South Baden, the Democratic Party (DP) in the State of Rhineland-Palatinate, the Democratic People's Party of Northern Württemberg-Northern Baden (DVP) in the State of Württemberg-Baden, the Democratic People's Party of Southern Württemberg-Hohenzollern (DVP) in the State of Württemberg-Hohenzollern, the united Free Democratic Party (F.D.P.) of the British zone of occupation, the Free Democratic Party (F.D.P.) in the Free State of Bavaria, the Liberal Democratic Party (LDP) in the State of Hesse, and the Liberal Democratic Party (LDP) of Berlin (West). Cf. Almut Leh and Alexander von Plato, Ein unglaublicher Frühling: erfahrene Geschichte im Nachkriegsdeutschland 1945 - 1948,  Bundeszentrale für Politische Bildung (ed.), Bonn: Bundeszentrale für Politische Bildung, 1997, p. 77.  The FDP's first Chairman, Theodor Heuss, was formerly a member of the DDP and after the war of the Democratic People's Party (DVP).\n\n1949–69: The reconstruction of Germany\n\nIn the first elections to the Bundestag on 14 August 1949, the FDP won a vote share of 11.9 percent (with 12 direct mandates, particularly in Baden-Württemberg and Hesse), and thus obtained 52 of 402 seats. In September of the same year the FDP chairman Theodor Heuss was elected the first President of the Federal Republic of Germany. In his 1954 re-election, he received the best election result to date of a President with 871 of 1018 votes (85.6 percent) of the Federal Assembly. Adenauer was also elected on the proposal of the new German President with an extremely narrow majority as the first Chancellor. The FDP participated with the CDU/CSU and the DP in Adenauer's coalition cabinet: they had three ministers: Franz Blücher (Vice-Chancellor), Thomas Dehler (Justice) and Eberhard Wildermuth (housing).\n\nOn the most important economic, social and German national issues, the FDP agreed with their coalition partners, the CDU/CSU. However, the FDP recommended to the bourgeois voters a secular party that refused the religious schools and  accused the opposition parties of clericalization. The FDP said they were known also as a consistent representative of the market economy, while the CDU was then dominated nominally from the Ahlen Programme, which allowed a Third Way between capitalism and socialism. Ludwig Erhard, the \"father\" of the social market economy, had his followers in the early years of the Federal Republic in the Union rather than in the FDP.\n\nThe FDP voted in parliament at the end of 1950 against the CDU- and SPD- introduced de-nazification process. At their party conference in Munich in 1951 they demanded the release of all \"so-called war criminals\" and welcomed the establishment of the \"Association of German soldiers\" of former Wehrmacht and SS members, to advance the integration of the nationalist forces in democracy. The 1953 Naumann-Affair, named after Werner Naumann, identifies old Nazis trying to infiltrate the party, which had many right-wing and nationalist members in Hesse, North Rhine-Westphalia and Lower Saxony. After the British occupation authorities had arrested seven prominent members of the Naumann circle, the FDP federal board installed a commission of inquiry, chaired by Thomas Dehler, which particularly sharply criticized the situation in the North Rhine-Westphalian FDP. In the following years, the right wing lost power, and the extreme right increasingly sought areas of activity outside the FDP. In the 1953 federal election the FDP received 9.5 percent of the party votes, 10.8 percent of the primary vote (with 14 direct mandates, particularly in Hamburg, Lower Saxony, Hesse, Württemberg and Bavaria) and 48 of 487 seats.\n\nIn the second term of the Bundestag, the South German Liberal democrats gained influence in the party. Thomas Dehler, a representative of a more left-liberal course took over as party and parliamentary leader. The former Minister of Justice Dehler, who in 1933 suffered persecution by the Nazis, was known for his rhetorical focus. Generally the various regional associations were independent and translated so different from country to country accents in liberal politics. After the FDP had left in early 1956, the coalition with the CDU in North Rhine-Westphalia and made with SPD and center a new state government, were a total of 16 members of parliament, including the four federal ministers from the FDP and founded the short-lived Free People's Party, which then up was involved to the end of the legislature instead of FDP in the Federal Government. The FDP first took it to the opposition.\n\nOnly one of the smaller post-war parties, the FDP survived despite many problems. In 1957 federal elections they still reached 7.7 percent of the vote to 1990 and their last direct mandate with which they had held 41 of 497 seats in the Bundestag. However, they still remained in opposition, because the Union won an absolute majority. In the following example, the FDP sat for a nuclear-free zone in Central Europe.\n\nEven before the election Dehler was assigned as party chairman. At the federal party in Berlin at the end January 1957 relieved him Reinhold Maier. Dehler's role as Group Chairman took over after the election of the national set very Erich Mende. Mende was also chairman of the party.\n\nIn the 1961 federal elections, it achieved 12.8 percent nationwide, the best result until then, and the FDP entered a coalition with the CDU again. Although it was committed before the election to continuing to sit in any case in a government together with Adenauer, Chancellor Adenauer was again, however, to withdraw under the proviso, after two years. These events led to the FDP being nicknamed the Umfallerpartei (\"pushover party\").[https://books.google.co.uk/books?idOThqlaLQjFIC&lpg\nPA65&otsV0g4UTCK6k&dq\n%E2%80%9EUmfaller-Partei%E2%80%9C%201961&pgPA65#v\nonepage&q%E2%80%9EUmfaller-Partei%E2%80%9C%201961&f\nfalse Die Bundesrepublik Deutschland: eine Bilanz nach 60 Jahren], Hans-Peter Schwarz, Böhlau Verlag Köln Weimar, 2008, page 66\n\nIn the Spiegel Affair, the FDP withdrew their ministers from the federal government. Although the coalition was renewed again under Adenauer in 1962, the FDP withdrew again on the condition in October 1963. This occurred even under the new Chancellor, Ludwig Erhard. This was for Erich Mende turn the occasion to go into the cabinet: he took the rather unimportant Federal Ministry for All-German Affairs.\n\nIn the 1965 federal elections the FDP gained 9.5 percent. The coalition with the CDU in 1966 broke on the subject of tax increases and it was followed by a grand coalition between the CDU and the SPD. The opposition also pioneered a course change to: The former foreign policy and the attitude to the eastern territories were discussed. The new chairman elected delegates in 1968 Walter Scheel, a European-oriented liberals, although it came from the national liberal camp, but with Willi Weyer and Hans-Dietrich Genscher led the new center of the party. This center strove to make the FDP coalition support both major parties. Here, the Liberals approached to by their reorientation in East Germany and politics especially of the SPD.\n\n1969–82: Social changes and crises\n\nOn 21 October 1969 began the period after the election of a Social-Liberal coalition with the SPD and the German Chancellor Willy Brandt. Walter Scheel was he who initiated the foreign policy reversal. Despite a very small majority he and Willy Brandt sat by the controversial New Ostpolitik. This policy was within the FDP quite controversial, especially since after the entry into the Federal Government defeats in state elections in North Rhine-Westphalia, Lower Saxony and Saarland on 14 June 1970 followed. In Hanover and Saarbrücken, the party left the parliament.\n\nAfter the federal party congress in Bonn, just a week later supported the policy of the party leadership and Scheel had confirmed in office, founded by Siegfried party rights Zoglmann 11 July 1970 a \"non-partisan\" organization called the National-Liberal action on the Hohensyburgstraße - to fall with the goal of ending the left-liberal course of the party and Scheel. However, this was not. Zoglmann supported in October 1970 a disapproval resolution of opposition to Treasury Secretary Alexander Möller, Erich Mende, Heinz Starke, and did the same. A little later all three declared their withdrawal from the FDP; Mende and Strong joined the CDU in, Zoglmann later founded the German Union, which does not make it past the status of a splinter party.\n\nThe foreign policy and the socio-political changes were made in 1971 by the Freiburg theses, which were as Rowohlt Paperback sold more than 100,000 times, on a theoretical basis, the FDP is committed to \"social liberalism\" and social reforms. Walter Scheel was first foreign minister and vice chancellor, 1974, he was then second-liberal President and paving the way for inner-party the previous interior minister Hans-Dietrich Genscher free.\n\nFrom 1969 to 1974 the FDP supported the SPD Chancellor Willy Brandt, who was succeeded by Helmut Schmidt. Already by the end of the 70s there did not seem to be enough similarities between the FDP and the SPD to form a new coalition, but the CDU / CSU chancellor candidate of Franz Josef Strauss in 1980 pushed the parties to run together again. The FDP's policies, however, began to drift apart from the SPD's, especially when it came to the economy. Within the SPD, there was strong grassroots opposition to Chancellor Helmut Schmidt's policies on the Nato Double-Track Decision. However, within the FDP, the conflicts and contrasts were always greater.\n\n1982–98: joined Kohl government, with economic transition and reunification\n\nOn 1 October 1982, FDP elected, together with the CDU / CSU parliamentary group of the CDU, party chairman Helmut Kohl as the new Chancellor. The coalition change resulted in severe internal conflicts, and the FDP then lost about 20 percent of its 86,500 members, as reflected in the general election in 1983 by a drop from 10.6 percent to 7.0 percent. The members went mostly to the SPD, the Greens and newly formed splinter parties, such as the left-liberal party Liberal Democrats (LD). The exiting members included the former FDP General Secretary and later EU Commissioner Günter Verheugen. At the party convention in November 1982, the Schleswig-Holstein state chairman Uwe Ronneburger challenged Hans-Dietrich Genscher as party chairman. Ronneburger received 186 of the votes - about 40 percent - and was just narrowly defeated by Genscher.\n\nYoung FDP members who did not agree with the politics of the FDP youth organization Young Democrats had founded in 1980 the Young Liberals (JuLis). For a time there were two youth organizations side by side, until the JuLis became the new official youth wing of the FDP. The Young Democrats split from the FDP and were left as a party-independent youth organization.\n\nAt the time of reunification, the FDP's objective was a special economic zone in the former East Germany, but could not prevail against the CDU / CSU, as this would prevent any loss of votes in the five new federal states in the general election in 1990.\n\nIn all federal election campaigns since the 1980s, the party sided with the CDU and CSU, the main conservative parties in Germany.  Following German reunification in 1990, the FDP merged with the Association of Free Democrats, a grouping of liberals from East Germany and the Liberal Democratic Party of Germany.\n\nDuring the political upheavals of 1989/1990 in the GDR new liberal parties emerged, like the FDP East Germany or the German Forum Party. They formed the Liberal Democratic Party, who had previously acted as a block party on the side of the SED and with Manfred Gerlach also the last Council of State of the GDR presented, the Alliance of Free Democrats, (BFD). Within the FDP came in the following years to considerable internal discussions about dealing with the former block party. Even before the reunification of Germany united on a joint congress in Hanover, the West German FDP united with the other parties to form the first all-German party. Both party factions brought the FDP a great, albeit short-lived, increase in membership. In the first all-German Bundestag elections, the CDU/CSU/FDP center-right coalition was confirmed, the FDP received 11.0 percent of the valid votes (79 seats) and won (in Halle (Saale)) the first direct mandate since 1957.\n\nDuring the 1990s, the FDP won between 6.2 and 11 percent of the vote in Bundestag elections. It last participated in the federal government by representing the junior partner in the government of Chancellor Helmut Kohl of the CDU.\n\nIn 1998, the CDU/CSU - FDP coalition lost the federal election, which ended the FDP's nearly 30-year reign in government. In its 2002 campaign the FDP made an exception to its party policy of siding with the CDU/CSU when it adopted equidistance to the CDU and SPD. From 1998 until 2009 the FDP remained in the opposition until it became part of a new center-right coalition government.\n\n2005 federal election\n\nIn the 2005 general election the party won 9.8 percent of the vote and 61 federal deputies, an unpredicted improvement from prior opinion polls. It is believed that this was partly due to tactical voting by CDU and Christian Social Union of Bavaria (CSU) alliance supporters who hoped for stronger market-oriented economic reforms than the CDU/CSU alliance called for. However, because the CDU did worse than predicted, the FDP and the CDU/CSU alliance were unable to form a coalition government. At other times, for example after the 2002 federal election, a coalition between the FDP and CDU/CSU was impossible primarily because of the weak results of the FDP.\n\nThe CDU/CSU parties had achieved the 3rd worst performance in German postwar history with only 35.2 percent of the votes. Therefore, the FDP wasn't able to form a coalition with its preferred partners, the CDU/CSU parties. As a result, the party was considered as a potential member of two other political coalitions, following the election. One possibility was a partnership between the FDP, the Social Democratic Party of Germany (SPD) and the Alliance 90/The Greens, known as a \"traffic light coalition\", named after the colors of the three parties. This coalition was ruled out, because the FDP considered the Social Democrats and the Greens insufficiently committed to market-oriented economic reform. The other possibility was a CDU-FDP-Green coalition, known as a \"Jamaica coalition\" because of the colours of the three parties. This coalition wasn't concluded either, since the Greens ruled out participation in any coalition with the CDU/CSU. Instead, the CDU formed a Grand coalition with the SPD, and the FDP entered the opposition. FDP leader Guido Westerwelle became the unofficial leader of the opposition by virtue of the FDP's position as the largest opposition party in the Bundestag.\n\nIn the 2009 European parliament elections, the FDP received 11% of the national vote (2,888,084 votes in total) and returned 12 MEPs.\n\n2009 federal election\n\nIn the national vote on 27 September 2009 the FDP increased its share of the vote by 4.8 percentage points to 14.6%, an all-time record so far. This percentage was enough to offset a decline in the CDU/CSU's vote compared to 2005, to create a CDU-FDP governing coalition in the Bundestag with a 53% majority of seats.  On election night, party leader Westerwelle said his party would work to ensure that civil liberties were respected and that Germany got an \"equitable tax system and better education opportunities\".[http://www.dw-world.de/dw/article/0,,4728511,00.html Merkel to head new center-right government] Deutsche Welle 27 September 2009.\n\nThe party also made gains in the two state elections held at the same time, acquiring sufficient seats for a CDU-FDP coalition in the northernmost state, Schleswig-Holstein, and gaining enough votes in left leaning Brandenburg to clear the 5% hurdle to enter that state's parliament.\n\nHowever, after reaching its best ever election result in 2009, the FDP's support collapsed. The party’s policy pledges were put on hold by Merkel as the recession of 2009 unfolded and with the onset of the European debt crisis in 2010.Brian Parkin and Tony Czuczka (23 September 2013), [https://www.bloomberg.com/news/2013-09-22/german-king-makers-fdp-face-parliamentary-exile-after-64-years.html German ‘King Makers’ FDP Face Parliamentary Exile] Bloomberg News. By the end of 2010, the party's support had dropped to as low as 5%. The FDP retained their seats in the state elections in North Rhine-Westphalia, which was held six months after the federal election, but out of the seven state elections that have been held since 2009, the FDP have lost all their seats in five of them due to failing to cross the 5% threshold.\n\nSupport for the party further eroded amid infighting and an internal rebellion over euro-area bailouts during the debt crisis.Leon Mangasarian (17 September 2013), [https://www.bloomberg.com/news/2013-09-16/merkel-s-fdp-ally-begs-for-her-party-s-votes-in-survival-fight.html Merkel's FDP Ally Begs for Her Party’s Votes in Survival Fight] Bloomberg News.\n\nWesterwelle stepped down as party leader in 2011 after the party was wiped out in both Saxony-Anhalt and Rhineland-Palatinate, as well as losing half its seats in Baden-Württemberg. He was replaced on 13 May 2011 by Philipp Rösler. The change in leadership failed to revive the FDP's fortunes, however, and in the next series of state elections, the party lost all its seats in Bremen, Mecklenburg-Vorpommern, and Berlin. In Berlin, the party lost nearly 75% of the support they had had in the previous election.\n\nIn March 2012, the FDP lost all their seats in Saarland. However, this was averted in the Schleswig-Holstein state elections, when they achieved 8% of the vote, which was a severe loss of seats but still over the 5% threshold. In the snap elections in North Rhine-Westphalia a week later, the FDP not only crossed the threshold, but also increased its share of the votes to 2 percentage points higher than in the previous state election. This was attributed to the local leadership of Christian Lindner.\n\n2013 federal election\n\nThe FDP last won a directly elected seat in 1990—the only time it has won a directly elected seat since 1957. The party's inability to win directly elected seats came back to haunt it at the 2013 election, in which it came up just short of the 5% threshold. With no directly elected seats, the FDP was shut out of the Bundestag for the first time since 1949. After the previous chairman Philipp Rösler then resigned, Christian Lindner took over the leadership of the party.\n\n2014  election\n\nIn the 2014 European parliament elections, the FDP received 3.36% of the national vote (986,253 votes in total) and returned 3 MEPs. In the Brandenburg state election, 2014 the party experienced a 5.8% down-swing and lost all their representatives in the Brandenburg state parliament. In the Saxony state election, 2014, the party experienced a 5.2% down-swing, again losing all of its seats. In the Thuringian state election, 2014 a similar phenomenon was repeated with the party falling below the 5% threshold following a 5.1% drop in popular vote.\n\n2015-present\n\nThe party managed to enter parliament in the Bremen state election, 2015 with the party receiving 6.5% of the vote and gaining 6 seats. However, it failed to get into government as a coalition between the Social Democrats and the Greens was created. In the Mecklenburg-Vorpommern state election, 2016 the party failed to get into parliament despite increasing its vote share by 0.3%. The party did manage to get into parliament in Baden-Württemberg, gaining 3% of the vote and a total of 12 seats. This represents a five-seat improvement over their previous results. In the Berlin state election, 2016 the party gained 4.9% of the vote and 12 seats but still failed to get into government. A red-red-green coalition was instead formed relegating the FDP to the opposition. In the Rhineland-Palatinate state election, 2016, the party managed to enter parliament receiving 6.2% of the vote and 7 seats. It also managed to enter government under a traffic light coalition. In Saxony-Anhalt state election, 2016 the party narrowly missed the 5% threshold, receiving 4.9% of the vote and therefore receiving zero seats despite a 1% swing in their favour.\n\nThe North Rhine-Westphalia state election, 2017 was widely considered a test of the party's future as their chairman Christian Lindner was also leading the party in that state. The party experienced a 4% swing in its favour gaining 6 seats and entering into a coalition with the CDU with a bare majority. In the Saarland state election, 2017 the party again failed to gain any seats despite a 1% swing in their favour. The party gained 3 seats and increased its vote share by 3.2% in the Schleswig-Holstein state election, 2017. This success was often credited to their state chairman Wolfgang Kubicki. They also managed to re-enter the government under a Jamaica coalition, and reentered the Bundestag in the federal election later that year with 10.7% of second votes.\n\nIdeology\n\nThe FDP adheres to a classical liberal ideology, advocating liberalism in both the economic sphere and social sphere.  The current guidelines of the FDP are enshrined in the \"Principles of Wiesbaden\". A key objective of the FDP is the \"strengthening of freedom and individual responsibility\".\n\nThroughout its history, the FDP's policies have shifted between emphasis on social liberalism and economic liberalism.  Since the 1980s, the FDP has maintained a consistent pro-business stance. The FDP supports strong competition laws and a minimum standard of welfare protection for every citizen. In addition, the FDP endorses changes to social welfare and health care systems with laws that would require every employed citizen to invest in a private social security account. The party supports a bracket income tax system, as opposed to the current 'linear' system, and, in the long term, a flat tax. The FDP aims for the introduction of a citizen's dividend, which collects all the tax-financed social welfare and social security funds of the state.\n\nThe FDP supports LGBT rights; former party leader Guido Westerwelle was openly gay. Yet the party's group in parliament voted against an oppositional motion for gay marriage, in order not to threaten the coalition with the Christian Democrats.\n\nThe FDP describes itself as a pro-European party, although the minority national-liberal faction is Eurosceptic.  The FDP wants a politically integrated EU with a Common Foreign and Security Policy, but supported a referendum on the Treaty of Lisbon.\n\nPolicies \n\nThe basic concept of the FDP is liberalism, which it has traditionally represented in Germany. Its fundamental ideal is therefore in the freedom of man, especially before state power. The focus of the FDP on the Political Compass is described as almost unaffected by economic and market liberalism. Regarding the political compass:\n\nThe current FDP guidelines are anchored in the 'Karlsruhe Freiheitsthesen'. These were decided upon at the 63rd Annual Federal Parliamentary Conference on 22 April 2012 in Karlsruhe.\n\nEconomic Policy \n\nThe economic policy of the FDP is based on liberal and social market economy.\n\nIt calls for a state regulatory policy which creates the appropriate framework for this but does not distort the market through excessive state interventionism.\n\nThe main objective is to create jobs by improving the investment in the economy. This will be achieved through bureaucracy reduction, privatization, deregulation, reduction of subsidies and a reform of the collective bargaining. The party sees  globalization as an opportunity creator.\n\nThe government debt is to be reduced. A balanced budget without new debt is something to strive for.\n\nIn the tax policy, a simpler tax law is called for. The Income Tax model provides for a Stufentarif. In the long term, a so-called flat tax is strived for. Tax cuts are designed to increase the purchasing power of workers and stimulate the economy.\n\nThe FDP rejects the nationwide minimum wage. On the other hand, wage ceilings are to be introduced which pay attention to the specific characteristics of the respective regions and industries.\n\nSocial policy \n\nIn social policy, the introduction of a Consolidated Welfare payments, in which all tax-financed social aid of the state is combined. This is a based of Negative Income Tax. It would have a work obligation like those found in present regulation.\n\nA common denominator of the Free Democrats is the critical attitude toward an overpowering of the state and to conservative or egalitarian corporate designs. According to the motto \"As much state as necessary, as little state as possible\", the FDP tries to limit the interference of the state with the life of the individual as far as possible. Therefore, it also rejects all elements of a monitoring country. A connecting element is the idea of \"creating and safeguarding the freedom of the individual\". Thus, it contributed almost all social liberalisations realized in the Federal Republic.\n\nHealth policy \n\nIn the field of health policy, the FDP argues for a reduction of bureaucratic Regulations. Also the physical self-determination is particularly emphasized. For example, each human being should also have the right in the context of medical treatment to freely determine his biology. In addition, the FDP aims to legalize cannabis.\n\nFamily policy \n\nThe FDP is committed to the legal equality of different forms of living together. Marriage between husband and wife should not be preferred to other forms of living together. Same-sex couples are to be given the same rights as heterosexual pairs — for example, the common right of adoption. The opening of marriage for same-sex couples is demanded. The income splitting should be retained. The expansion of kindergarten places is to be strengthened nationwide.\n\nElection results\n\nFederal Parliament (Bundestag)\n\nBelow are charts of the results that the Free Democratic Party has secured in each election to the federal Bundestag.  Timelines showing the number of seats and percentage of party list votes won are on the right.\n\nImageSize = width:525 height:150\nPlotArea = width:500 height:125 left:25 bottom:20\nAlignBars = justify\n\nColors =\n  id:FDP value:rgb(0.9999,0.926,0)\n\nDateFormat = yyyy\nPeriod = from:0 till:100\nTimeAxis = orientation:vertical\nScaleMajor = unit:year increment:10 start:0\n\nPlotData=\n bar:Seats color:FDP  width:24 mark:(line,white) align:left fontsize:S\n bar:1949  color:FDP  from:start till:52  text:52  align:center\n bar:1953  color:FDP  from:start till:48  text:48  align:center\n bar:1957  color:FDP  from:start till:41  text:41  align:center\n bar:1961  color:FDP  from:start till:67  text:67  align:center\n bar:1965  color:FDP  from:start till:49  text:49  align:center\n bar:1969  color:FDP  from:start till:30  text:30  align:center\n bar:1972  color:FDP  from:start till:41  text:41  align:center\n bar:1976  color:FDP  from:start till:39  text:39  align:center\n bar:1980  color:FDP  from:start till:53  text:53  align:center\n bar:1983  color:FDP  from:start till:34  text:34  align:center\n bar:1987  color:FDP  from:start till:46  text:46  align:center\n bar:1990  color:FDP  from:start till:79  text:79  align:center\n bar:1994  color:FDP  from:start till:47  text:47  align:center\n bar:1998  color:FDP  from:start till:43  text:43  align:center\n bar:2002  color:FDP  from:start till:47  text:47  align:center\n bar:2005  color:FDP  from:start till:61  text:61  align:center\n bar:2009  color:FDP  from:start till:93  text:93  align:center\n bar:2013  color:FDP  from:start till:0   text:0   align:center\n bar:2017  color:FDP  from:start till:80  text:80  align:center\n\nImageSize = width:525 height:150\nPlotArea = width:500 height:125 left:25 bottom:20\nAlignBars = justify\n\nColors =\n  id:FDP value:rgb(0.9999,0.926,0)\n\nDateFormat = yyyy\nPeriod = from:0 till:200\nTimeAxis = orientation:vertical\nScaleMajor = unit:year increment:50 start:0\n\nPlotData=\n bar:Vote% color:FDP  width:24 mark:(line,white) align:left fontsize:S\n bar:1949  color:FDP  from:start till:119 text:11.9 align:center\n bar:1953  color:FDP  from:start till:95  text:9.5  align:center\n bar:1957  color:FDP  from:start till:77  text:7.7  align:center\n bar:1961  color:FDP  from:start till:128 text:12.8 align:center\n bar:1965  color:FDP  from:start till:95  text:9.5  align:center\n bar:1969  color:FDP  from:start till:58  text:5.8  align:center\n bar:1972  color:FDP  from:start till:84  text:8.4  align:center\n bar:1976  color:FDP  from:start till:79  text:7.9  align:center\n bar:1980  color:FDP  from:start till:106 text:10.6 align:center\n bar:1983  color:FDP  from:start till:69  text:6.9  align:center\n bar:1987  color:FDP  from:start till:91  text:9.1  align:center\n bar:1990  color:FDP  from:start till:110 text:11.0 align:center\n bar:1994  color:FDP  from:start till:69  text:6.9  align:center\n bar:1998  color:FDP  from:start till:62  text:6.2  align:center\n bar:2002  color:FDP  from:start till:74  text:7.4  align:center\n bar:2005  color:FDP  from:start till:98  text:9.8  align:center\n bar:2009  color:FDP  from:start till:146 text:14.6 align:center\n bar:2013  color:FDP  from:start till:48  text:4.8  align:center\n bar:2017  color:FDP  from:start till:107 text:10.7 align:center\n\nEuropean Parliament\n\nState Parliaments\n\nLeadership\n\nParty chairmen\n\nLeaders in the Bundestag. Free Democratic Party (Germany). http://en.wikipedia.org/?curid=10825."
  }
}
