{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18967",
  "eid" : "3693eac0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778600812,
  "textBody" : "The flowering plants, also known as angiosperms, Angiospermae or Magnoliophyta, are the most diverse group of land plants, with 416 families, approximately 13,164 known genera and c. 295,383 known species. Like gymnosperms, angiosperms are seed-producing plants. However, they are distinguished from gymnosperms by characteristics including flowers, endosperm within the seeds, and the production of fruits that contain the seeds. Etymologically, angiosperm means a plant that produces seeds within an enclosure; in other words, a fruiting plant. The term comes from the Greek words angeion (\"case\" or \"casing\") and sperma (\"seed\").\n\nThe ancestors of flowering plants diverged from gymnosperms in the Triassic Period, 245 to 202 million years ago (mya), and the first flowering plants are known from 160 mya. They diversified extensively during the Lower Cretaceous, became widespread by 120 mya, and replaced conifers as the dominant trees from 100 to 60 mya.\n\nDescription \n\nAngiosperm derived characteristics\n\nAngiosperms differ from other seed plants in several ways, described in the table below. These distinguishing characteristics taken together have made the angiosperms the most diverse and numerous land plants and the most commercially important group to humans.\n\nVascular anatomy\n\nThe amount and complexity of tissue-formation in flowering plants exceeds that of gymnosperms. The vascular bundles of the stem are arranged such that the xylem and phloem form concentric rings.\n\nIn the dicotyledons, the bundles in the very young stem are arranged in an open ring, separating a central pith from an outer cortex. In each bundle, separating the xylem and phloem, is a layer of meristem or active formative tissue known as cambium. By the formation of a layer of cambium between the bundles (interfascicular cambium), a complete ring is formed, and a regular periodical increase in thickness results from the development of xylem on the inside and phloem on the outside. The soft phloem becomes crushed, but the hard wood persists and forms the bulk of the stem and branches of the woody perennial. Owing to differences in the character of the elements produced at the beginning and end of the season, the wood is marked out in transverse section into concentric rings, one for each season of growth, called annual rings.\n\nAmong the monocotyledons, the bundles are more numerous in the young stem and are scattered through the ground tissue. They contain no cambium and once formed the stem increases in diameter only in exceptional cases.\n\nReproductive anatomy \n\nThe characteristic feature of angiosperms is the flower. Flowers show remarkable variation in form and elaboration, and provide the most trustworthy external characteristics for establishing relationships among angiosperm species. The function of the flower is to ensure fertilization of the ovule and development of fruit containing seeds. The floral apparatus may arise terminally on a shoot or from the axil of a leaf (where the petiole attaches to the stem). Occasionally, as in violets, a flower arises singly in the axil of an ordinary foliage-leaf. More typically, the flower-bearing portion of the plant is sharply distinguished from the foliage-bearing or vegetative portion, and forms a more or less elaborate branch-system called an inflorescence.\n\nThere are two kinds of reproductive cells produced by flowers. Microspores, which will divide to become pollen grains, are the \"male\" cells and are borne in the stamens (or microsporophylls). The \"female\" cells called megaspores, which will divide to become the egg cell (megagametogenesis), are contained in the ovule and enclosed in the carpel (or megasporophyll).\n\nThe flower may consist only of these parts, as in willow, where each flower comprises only a few stamens or two carpels. Usually, other structures are present and serve to protect the sporophylls and to form an envelope attractive to pollinators. The individual members of these surrounding structures are known as sepals and petals (or tepals in flowers such as Magnolia where sepals and petals are not distinguishable from each other). The outer series (calyx of sepals) is usually green and leaf-like, and functions to protect the rest of the flower, especially the bud. The inner series (corolla of petals) is, in general, white or brightly colored, and is more delicate in structure. It functions to attract insect or bird pollinators. Attraction is effected by color, scent, and nectar, which may be secreted in some part of the flower. The characteristics that attract pollinators account for the popularity of flowers and flowering plants among humans.\n\nWhile the majority of flowers are perfect or hermaphrodite (having both pollen and ovule producing parts in the same flower structure), flowering plants have developed numerous morphological and physiological mechanisms to reduce or prevent self-fertilization. Heteromorphic flowers have short carpels and long stamens, or vice versa, so animal pollinators cannot easily transfer pollen to the pistil (receptive part of the carpel). Homomorphic flowers may employ a biochemical (physiological) mechanism called self-incompatibility to discriminate between self and non-self pollen grains. In other species, the male and female parts are morphologically separated, developing on different flowers.\n\nTaxonomy \n\nHistory of classification\n\nThe botanical term \"Angiosperm\", from the Ancient Greek αγγείον, angeíon (bottle, vessel) and σπέρμα, (seed), was coined in the form Angiospermae by Paul Hermann in 1690, as the name of one of his primary divisions of the plant kingdom. This included flowering plants possessing seeds enclosed in capsules, distinguished from his Gymnospermae, or flowering plants with achenial or schizo-carpic fruits, the whole fruit or each of its pieces being here regarded as a seed and naked. The term and its antonym were maintained by Carl Linnaeus with the same sense, but with restricted application, in the names of the orders of his class Didynamia. Its use with any approach to its modern scope became possible only after 1827, when Robert Brown established the existence of truly naked ovules in the Cycadeae and Coniferae,Brown R., Character and description of Kingia, a new genus of plants found on the southwest coast of New Holland: with observations on the structure of its unimpregnated ovulum; and on the female flower of Cycadeae and Coniferae, in: King P.P. (Ed.) Narrative of a Survey of the Intertropical and western coasts of Australia, performed between years 1818 and 1822. John Murray, London, 1827, vol. 2., pp. 534–565, [https://books.google.com/books?idRjdCAAAAIAAJ&hl\n&pgPA534#v\nonepage&q&f=false]. and applied to them the name Gymnosperms. From that time onward, as long as these Gymnosperms were, as was usual, reckoned as dicotyledonous flowering plants, the term Angiosperm was used antithetically by botanical writers, with varying scope, as a group-name for other dicotyledonous plants.\n\nIn 1851, Hofmeister discovered the changes occurring in the embryo-sac of flowering plants, and determined the correct relationships of these to the Cryptogamia. This fixed the position of Gymnosperms as a class distinct from Dicotyledons, and the term Angiosperm then gradually came to be accepted as the suitable designation for the whole of the flowering plants other than Gymnosperms, including the classes of Dicotyledons and Monocotyledons. This is the sense in which the term is used today.\n\nIn most taxonomies, the flowering plants are treated as a coherent group. The most popular descriptive name has been Angiospermae (Angiosperms), with Anthophyta (\"flowering plants\") a second choice. These names are not linked to any rank. The Wettstein system and the Engler system use the name Angiospermae, at the assigned rank of subdivision. The Reveal system treated flowering plants as subdivision Magnoliophytina (Frohne & U. Jensen ex Reveal, Phytologia 79: 70 1996), but later split it to Magnoliopsida, Liliopsida, and Rosopsida. The Takhtajan system and Cronquist system treat this group at the rank of division, leading to the name Magnoliophyta (from the family name Magnoliaceae). The Dahlgren system and Thorne system (1992) treat this group at the rank of class, leading to the name Magnoliopsida. The APG system of 1998, and the later 2003 and 2009 revisions, treat the flowering plants as a clade called angiosperms without a formal botanical name. However, a formal classification was published alongside the 2009 revision in which the flowering plants form the Subclass Magnoliidae.\n\nThe internal classification of this group has undergone considerable revision. The Cronquist system, proposed by Arthur Cronquist in 1968 and published in its full form in 1981, is still widely used but is no longer believed to accurately reflect phylogeny. A consensus about how the flowering plants should be arranged has recently begun to emerge through the work of the Angiosperm Phylogeny Group (APG), which published an influential reclassification of the angiosperms in 1998. Updates incorporating more recent research were published as the APG II system in 2003, the APG III system in 2009, and the APG IV system in 2016.\n\nTraditionally, the flowering plants are divided into two groups,\n\n* Dicotyledoneae or Magnoliopsida\n* Monocotyledoneae or Liliopsida\n\nwhich in the Cronquist system are called Magnoliopsida (at the rank of class, formed from the family name Magnoliaceae) and Liliopsida (at the rank of class, formed from the family name Liliaceae). Other descriptive names allowed by Article 16 of the ICBN include Dicotyledones or Dicotyledoneae, and Monocotyledones or Monocotyledoneae, which have a long history of use. In English a member of either group may be called a dicotyledon (plural dicotyledons) and monocotyledon (plural monocotyledons), or abbreviated, as dicot (plural dicots) and monocot (plural monocots). These names derive from the observation that the dicots most often have two cotyledons, or embryonic leaves, within each seed. The monocots usually have only one, but the rule is not absolute either way. From a broad diagnostic point of view, the number of cotyledons is neither a particularly handy nor a reliable character.\n\nRecent studies, as by the APG, show that the monocots form a monophyletic group (clade) but that the dicots do not (they are paraphyletic). Nevertheless, the majority of dicot species do form a monophyletic group, called the eudicots or tricolpates. Of the remaining dicot species, most belong to a third major clade known as the magnoliids, containing about 9,000 species. The rest include a paraphyletic grouping of early branching taxa known collectively as the basal angiosperms, plus the families Ceratophyllaceae and Chloranthaceae.\n\nModern classification\n\nThere are eight groups of living angiosperms:\n\n* Basal angiosperms (ANA: Amborella, Nymphaeales, Austrobaileyales)\n** Amborella, a single species of shrub from New Caledonia;\n** Nymphaeales, about 80 species,, [http://www.amjbot.org/cgi/content/full/91/10/1437/F2 Figure 2] water lilies and Hydatellaceae;\n** Austrobaileyales, about 100 species of woody plants from various parts of the world\n* Core angiosperms (Mesangiospermae)\n** Chloranthales, several dozen species of aromatic plants with toothed leaves;\n** Magnoliids, about 9,000 species, characterized by trimerous flowers, pollen with one pore, and usually branching-veined leaves—for example magnolias, bay laurel, and black pepper;\n** Monocots, about 70,000 species, characterized by trimerous flowers, a single cotyledon, pollen with one pore, and usually parallel-veined leaves—for example grasses, orchids, and palms;\n** Ceratophyllum, about 6 species of aquatic plants, perhaps most familiar as aquarium plants;\n** Eudicots, about 175,000 species, characterized by 4- or 5-merous flowers, pollen with three pores, and usually branching-veined leaves—for example sunflowers, petunia, buttercup, apples, and oaks.\n\nThe exact relationship between these eight groups is not yet clear, although there is agreement that the first three groups to diverge from the ancestral angiosperm were Amborellales, Nymphaeales, and Austrobaileyales. The term basal angiosperms refers to these three groups. Among the remaining five groups (core angiosperms), the relationship between the three broadest of these groups (magnoliids, monocots, and eudicots) remains unclear. Zeng and colleagues (Fig. 1) describe four competing schemes. Of these, eudicots and monocots are the largest and most diversified, with ~ 75% and 20% of angiosperm species, respectively. Some analyses make the magnoliids the first to diverge, others the monocots. Ceratophyllum seems to group with the eudicots rather than with the monocots. The 2016 Angiosperm Phylogeny Group revision (APG IV) retained the overall higher order relationship described in APG III.\n\n1. Phylogeny of the flowering plants, as of APG III (2009).\n\n2. Example of alternative phylogeny (2010)\n\n3. APG IV (2016)\n\nEvolution\n\nFossilized spores suggest that higher plants (embryophytes) have lived on land for at least 475 million years. Early land plants reproduced sexually with flagellated, swimming sperm, like the green algae from which they evolved. An adaptation to terrestrialization was the development of upright meiosporangia for dispersal by spores to new habitats. This feature is lacking in the descendants of their nearest algal relatives, the Charophycean green algae. A later terrestrial adaptation took place with retention of the delicate, avascular sexual stage, the gametophyte, within the tissues of the vascular sporophyte. This occurred by spore germination within sporangia rather than spore release, as in non-seed plants. A current example of how this might have happened can be seen in the precocious spore germination in Selaginella, the spike-moss. The result for the ancestors of angiosperms was enclosing them in a case, the seed. The first seed bearing plants, like the ginkgo, and conifers (such as pines and firs), did not produce flowers. The pollen grains (male gametophytes) of Ginkgo and cycads produce a pair of flagellated, mobile sperm cells that \"swim\" down the developing pollen tube to the female and her eggs.\n\nThe apparently sudden appearance of nearly modern flowers in the fossil record initially posed such a problem for the theory of evolution that Charles Darwin called it an \"abominable mystery\". However, the fossil record has considerably grown since the time of Darwin, and recently discovered angiosperm fossils such as Archaefructus, along with further discoveries of fossil gymnosperms, suggest how angiosperm characteristics may have been acquired in a series of steps. Several groups of extinct gymnosperms, in particular seed ferns, have been proposed as the ancestors of flowering plants, but there is no continuous fossil evidence showing exactly how flowers evolved. Some older fossils, such as the upper Triassic Sanmiguelia, have been suggested. Based on current evidence, some propose that the ancestors of the angiosperms diverged from an unknown group of gymnosperms in the Triassic period (245–202 million years ago). Fossil angiosperm-like pollen from the Middle Triassic (247.2–242.0 Ma) suggests an older date for their origin.  A close relationship between angiosperms and gnetophytes, proposed on the basis of morphological evidence, has more recently been disputed on the basis of molecular evidence that suggest gnetophytes are instead more closely related to other gymnosperms.\n\nThe evolution of seed plants and later angiosperms appears to be the result of two distinct rounds of whole genome duplication events. These occurred at  and . Another possible whole genome duplication event at   perhaps created the ancestral line that led to all modern flowering plants. That event was studied by sequencing the genome of an ancient flowering plant, Amborella trichopoda, and directly addresses Darwin's \"abominable mystery.\"\n\nThe earliest known macrofossil confidently identified as an angiosperm, Archaefructus liaoningensis, is dated to about 125 million years BP (the Cretaceous period), whereas pollen considered to be of angiosperm origin takes the fossil record back to about 130 million years BP. However, one study has suggested that the early-middle Jurassic plant Schmeissneria, traditionally considered a type of ginkgo, may be the earliest known angiosperm, or at least a close relative. In addition, circumstantial chemical evidence has been found for the existence of angiosperms as early as 250 million years ago. Oleanane, a secondary metabolite produced by many flowering plants, has been found in Permian deposits of that age together with fossils of gigantopterids.[http://www.sciencedaily.com/releases/2001/04/010403071438.htm Oily Fossils Provide Clues To The Evolution Of Flowers] — ScienceDaily (April 5, 2001) Gigantopterids are a group of extinct seed plants that share many morphological traits with flowering plants, although they are not known to have been flowering plants themselves.\n\nIn 2013 flowers encased in amber were found and dated 100 million years before present. The amber had frozen the act of sexual reproduction in the process of taking place. Microscopic images showed tubes growing out of pollen and penetrating the flower's stigma. The pollen was sticky, suggesting it was carried by insects.\n\nRecent DNA analysis based on molecular systematics[https://www.pbs.org/wgbh/nova/transcripts/3405_flower.html NOVA — Transcripts — First Flower] — PBS Airdate: April 17, 2007\n showed that Amborella trichopoda, found on the Pacific island of New Caledonia, belongs to a sister group of the other flowering plants, and morphological studies[http://www.eurekalert.org/pub_releases/2006-05/uoca-spp051506.php South Pacific plant may be missing link in evolution of flowering plants] — Public release date: 17 May 2006 suggest that it has features that may have been characteristic of the earliest flowering plants.\n\nThe orders Amborellales, Nymphaeales, and Austrobaileyales diverged as separate lineages from the remaining angiosperm clade at a very early stage in flowering plant evolution.\n\nThe great angiosperm radiation, when a great diversity of angiosperms appears in the fossil record, occurred in the mid-Cretaceous (approximately 100 million years ago). However, a study in 2007 estimated that the division of the five most recent (the genus Ceratophyllum, the family Chloranthaceae, the eudicots, the magnoliids, and the monocots) of the eight main groups occurred around 140 million years ago.\nBy the late Cretaceous, angiosperms appear to have dominated environments formerly occupied by ferns and cycadophytes, but large canopy-forming trees replaced conifers as the dominant trees only close to the end of the Cretaceous 66 million years ago or even later, at the beginning of the Tertiary. The radiation of herbaceous angiosperms occurred much later. Yet, many fossil plants recognizable as belonging to modern families (including beech, oak, maple, and magnolia) had already appeared by the late Cretaceous.\n\nIt has been proposed that the swift rise of angiosperms to dominance was facilitated by a reduction in their genome size. During the early Cretaceous period, only angiosperms underwent rapid genome downsizing, while genome sizes of ferns and gymnosperms remained unchanged.  Smaller genomes–and smaller nuclei–allow for faster rates of cell division and smaller cells.  Thus, species with smaller genomes can pack more, smaller cells–in particular veins and stomata–into a given leaf volume.  Genome downsizing therefore facilitated higher rates of leaf gas exchange (transpiration and photosynthesis) and faster rates of growth.  This would have countered some of the negative physiological effects of genome duplications, facilitated increased uptake of carbon dioxide despite concurrent declines in atmospheric CO2 concentrations, and allowed the flowering plants to outcompete other land plants.\n\nIt is generally assumed that the function of flowers, from the start, was to involve mobile animals in their reproduction processes. That is, pollen can be scattered even if the flower is not brightly colored or oddly shaped in a way that attracts animals; however, by expending the energy required to create such traits, angiosperms can enlist the aid of animals and, thus, reproduce more efficiently.\n\nIsland genetics provides one proposed explanation for the sudden, fully developed appearance of flowering plants. Island genetics is believed to be a common source of speciation in general, especially when it comes to radical adaptations that seem to have required inferior transitional forms. Flowering plants may have evolved in an isolated setting like an island or island chain, where the plants bearing them were able to develop a highly specialized relationship with some specific animal (a wasp, for example). Such a relationship, with a hypothetical wasp carrying pollen from one plant to another much the way fig wasps do today, could result in the development of a high degree of specialization in both the plant(s) and their partners. Note that the wasp example is not incidental; bees, which, it is postulated, evolved specifically due to mutualistic plant relationships, are descended from wasps.\n\nAnimals are also involved in the distribution of seeds. Fruit, which is formed by the enlargement of flower parts, is frequently a seed-dispersal tool that attracts animals to eat or otherwise disturb it, incidentally scattering the seeds it contains (see frugivory). Although many such mutualistic relationships remain too fragile to survive competition and to spread widely, flowering proved to be an unusually effective means of reproduction, spreading (whatever its origin) to become the dominant form of land plant life.\n\nFlower ontogeny uses a combination of genes normally responsible for forming new shoots.[http://unisci.com/stories/20012/0615015.htm Age-Old Question On Evolution Of Flowers Answered] — 15-Jun-2001 The most primitive flowers probably had a variable number of flower parts, often separate from (but in contact with) each other. The flowers tended to grow in a spiral pattern, to be bisexual (in plants, this means both male and female parts on the same flower), and to be dominated by the ovary (female part). As flowers evolved, some variations developed parts fused together, with a much more specific number and design, and with either specific sexes per flower or plant or at least \"ovary-inferior\".\n\nFlower evolution continues to the present day; modern flowers have been so profoundly influenced by humans that some of them cannot be pollinated in nature. Many modern domesticated flower species were formerly simple weeds, which sprouted only when the ground was disturbed. Some of them tended to grow with human crops, perhaps already having symbiotic companion plant relationships with them, and the prettiest did not get plucked because of their beauty, developing a dependence upon and special adaptation to human affection.[http://www.livescience.com/295-human-affection-altered-evolution-flowers.html Human Affection Altered Evolution of Flowers] — By Robert Roy Britt, LiveScience Senior Writer (posted: 26 May 2005 06:53 am ET)\n\nA few paleontologists have also proposed that flowering plants, or angiosperms, might have evolved due to interactions with dinosaurs. One of the idea's strongest proponents is Robert T. Bakker. He proposes that herbivorous dinosaurs, with their eating habits, provided a selective pressure on plants, for which adaptations either succeeded in deterring or coping with predation by herbivores.\n\nIn August 2017, scientists presented a detailed description and 3D model image of what the first flower possibly looked like, and presented the hypothesis that it may have lived about 140 million years ago.\n\nA Bayesian analysis of 52 angiosperm taxa suggested that the crown group of angisperms evolved between  and .Foster CSP, Ho SYW (2017) Strategies for partitioning clock models in phylogenomic dating: Application to the angiosperm evolutionary timescale. Genome Biol Evol\n\nFlowering plant diversity\n\nThe number of species of flowering plants is estimated to be in the range of 250,000 to 400,000. This compares to around 12,000 species of moss or 11,000 species of pteridophytes,Raven, Peter H., Ray F. Evert, & Susan E. Eichhorn, 2005. Biology of Plants, 7th edition. (New York: W. H. Freeman and Company). . showing that the flowering plants are much more diverse. The number of families in APG (1998) was 462. In APG II (2003) it is not settled; at maximum it is 457, but within this number there are 55 optional segregates, so that the minimum number of families in this system is 402. In APG III (2009) there are 415 families.\n\nThe diversity of flowering plants is not evenly distributed. Nearly all species belong to the eudicot (75%), monocot (23%), and magnoliid (2%) clades. The remaining 5 clades contain a little over 250 species in total; i.e. less than 0.1% of flowering plant diversity, divided among 9 families. The 43 most-diverse of 443 families of flowering plants by species, in their APG circumscriptions, are\n# Asteraceae or Compositae (daisy family): 22,750 species;\n# Orchidaceae (orchid family): 21,950;\n# Fabaceae or Leguminosae (bean family): 19,400;\n# Rubiaceae (madder family): 13,150;\n# Poaceae or Gramineae (grass family): 10,035;\n# Lamiaceae or Labiatae (mint family): 7,175;\n# Euphorbiaceae (spurge family): 5,735;\n# Melastomataceae or Melastomaceae (melastome family): 5,005;\n# Myrtaceae (myrtle family): 4,625;\n# Apocynaceae (dogbane family): 4,555;\n# Cyperaceae (sedge family): 4,350;\n# Malvaceae (mallow family): 4,225;\n# Araceae (arum family): 4,025;\n# Ericaceae (heath family): 3,995;\n# Gesneriaceae (gesneriad family): 3,870;\n# Apiaceae or Umbelliferae (parsley family): 3,780;\n# Brassicaceae or Cruciferae (cabbage family): 3,710:\n# Piperaceae (pepper family): 3,600;\n# Bromeliaceae (bromeliad family): 3,540;\n# Acanthaceae (acanthus family): 3,500;\n# Rosaceae (rose family): 2,830;\n# Boraginaceae (borage family): 2,740;\n# Urticaceae (nettle family): 2,625;\n# Ranunculaceae (buttercup family): 2,525;\n# Lauraceae (laurel family): 2,500;\n# Solanaceae (nightshade family): 2,460;\n# Campanulaceae (bellflower family): 2,380;\n# Arecaceae (palm family): 2,361;\n# Annonaceae (custard apple family): 2,220;\n# Caryophyllaceae (pink family): 2,200;\n# Orobanchaceae (broomrape family): 2,060;\n# Amaranthaceae (amaranth family): 2,050;\n# Iridaceae (iris family): 2,025;\n# Aizoaceae or Ficoidaceae (ice plant family): 2,020;\n# Rutaceae (rue family): 1,815;\n# Phyllanthaceae (phyllanthus family): 1,745;\n# Scrophulariaceae (figwort family): 1,700;\n# Gentianaceae (gentian family): 1,650;\n# Convolvulaceae (bindweed family): 1,600;\n# Proteaceae (protea family): 1,600;\n# Sapindaceae (soapberry family): 1,580;\n# Cactaceae (cactus family): 1,500;\n# Araliaceae (Aralia or ivy family): 1,450.\nOf these, the Orchidaceae, Poaceae, Cyperaceae, Bromeliaceae, Arecaceae, and Iridaceae are monocot families; Piperaceae, Lauraceae, and Annonaceae are magnoliid dicots; the rest of the families are eudicots.\n\nReproduction \n\nFertilization and embryogenesis\n\nDouble fertilization refers to a process in which two sperm cells fertilize cells in the ovule. This process begins when a pollen grain adheres to the stigma of the pistil (female reproductive structure), germinates, and grows a long pollen tube. While this pollen tube is growing, a haploid generative cell travels down the tube behind the tube nucleus. The generative cell divides by mitosis to produce two haploid (n) sperm cells. As the pollen tube grows, it makes its way from the stigma, down the style and into the ovary. Here the pollen tube reaches the micropyle of the ovule and digests its way into one of the synergids, releasing its contents (which include the sperm cells). The synergid that the cells were released into degenerates and one sperm makes its way to fertilize the egg cell, producing a diploid (2n) zygote. The second sperm cell fuses with both central cell nuclei, producing a triploid (3n) cell. As the zygote develops into an embryo, the triploid cell develops into the endosperm, which serves as the embryo's food supply. The ovary will now develop into a fruit and the ovule will develop into a seed.\n\nFruit and seed\n\nAs the development of embryo and endosperm proceeds within the embryo sac, the sac wall enlarges and combines with the nucellus (which is likewise enlarging) and the integument to form the seed coat. The ovary wall develops to form the fruit or pericarp, whose form is closely associated with type of seed dispersal system.\n\nFrequently, the influence of fertilization is felt beyond the ovary, and other parts of the flower take part in the formation of the fruit, e.g., the floral receptacle in the apple, strawberry, and others.\n\nThe character of the seed coat bears a definite relation to that of the fruit. They protect the embryo and aid in dissemination; they may also directly promote germination. Among plants with indehiscent fruits, in general, the fruit provides protection for the embryo and secures dissemination. In this case, the seed coat is only slightly developed. If the fruit is dehiscent and the seed is exposed, in general, the seed-coat is well developed, and must discharge the functions otherwise executed by the fruit.\n\nMeiosis\n\nFlowering plants generate gametes using a specialized cell division called meiosis.  Meiosis takes place in the ovule (a structure within the ovary that is located within the pistil at the center of the flower) (see diagram labeled \"Angiosperm lifecycle\").  A diploid cell (megaspore mother cell) in the ovule undergoes meiosis (involving two successive cell divisions) to produce four cells (megaspores) with haploid nuclei.Snustad DP, Simmons MJ (2008). Principles of Genetics (5th ed.). Wiley. .  One of these four cells (megaspore) then undergoes three successive mitotic divisions to produce an immature embryo sac (megagametophyte) with eight haploid nuclei.  Next, these nuclei are segregated into separate cells by cytokinesis to producing 3 antipodal cells, 2 synergid cells and an egg cell.  Two polar nuclei are left in the central cell of the embryo sac.\n\nPollen is also produced by meiosis in the male anther (microsporangium).  During meiosis, a diploid microspore mother cell undergoes two successive meiotic divisions to produce 4 haploid cells (microspores or male gametes). Each of these microspores, after further mitoses, becomes a pollen grain (microgametophyte) containing two haploid generative (sperm) cells and a tube nucleus.  When a pollen grain makes contact with the female stigma, the pollen grain forms a pollen tube that grows down the style into the ovary.  In the act of fertilization, a male sperm nucleus fuses with the female egg nucleus to form a diploid zygote that can then develop into an embryo within the newly forming seed.  Upon germination of the seed, a new plant can grow and mature.\n\nThe adaptive function of meiosis is currently a matter of debate.  A key event during meiosis in a diploid cell is the pairing of homologous chromosomes and homologous recombination (the exchange of genetic information) between homologous chromosomes.  This process promotes the production of increased genetic diversity among progeny and the recombinational repair of damages in the DNA to be passed on to progeny.  To explain the adaptive function of meiosis in flowering plants, some authors emphasize diversity and others emphasize DNA repair.\n\nApomixis\n\nApomixis (reproduction via asexually formed seeds) is found naturally in about 2.2% of angiosperm genera   One type of apomixis, gametophytic apomixis found in a dandelion species   involves formation of an unreduced embryo sac due to incomplete meiosis (apomeiosis) and development of an embryo from the unreduced egg inside the embryo sac, without fertilization (parthenogenesis).\n\nUses \n\nAgriculture is almost entirely dependent on angiosperms, which provide virtually all plant-based food, and also provide a significant amount of livestock feed. Of all the families of plants, the Poaceae, or grass family (providing grains), is by far the most important, providing the bulk of all feedstocks (rice, maize, wheat, barley, rye, oats, pearl millet, sugar cane, sorghum). The Fabaceae, or legume family, comes in second place. Also of high importance are the Solanaceae, or nightshade family (potatoes, tomatoes, and peppers, among others); the Cucurbitaceae, or gourd family (including pumpkins and melons); the Brassicaceae, or mustard plant family (including rapeseed and the innumerable varieties of the cabbage species Brassica oleracea); and the Apiaceae, or parsley family. Many of our fruits come from the Rutaceae, or rue family (including oranges, lemons, grapefruits, etc.), and the Rosaceae, or rose family (including apples, pears, cherries, apricots, plums, etc.).\n\nIn some parts of the world, certain single species assume paramount importance because of their variety of uses, for example the coconut (Cocos nucifera) on Pacific atolls, and the olive (Olea europaea) in the Mediterranean region.\n\nFlowering plants also provide economic resources in the form of wood, paper, fiber (cotton, flax, and hemp, among others), medicines (digitalis, camphor), decorative and landscaping plants, and many other uses. The main area in which they are surpassed by other plants — namely, coniferous trees (Pinales), which are non-flowering (gymnosperms) — is timber and paper production.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Flowering plant" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18967" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The flowering plants, also known as angiosperms, Angiospermae or Magnoliophyta, are the most diverse group of land plants, with 416 families, approximately 13,164 known genera and c. 295,383 known species. Like gymnosperms, angiosperms are seed-producing plants. However, they are distinguished from gymnosperms by characteristics including flowers, endosperm within the seeds, and the production of fruits that contain the seeds. Etymologically, angiosperm means a plant that produces seeds within an enclosure; in other words, a fruiting plant. The term comes from the Greek words angeion (\"case\" or \"casing\") and sperma (\"seed\").\n\nThe ancestors of flowering plants diverged from gymnosperms in the Triassic Period, 245 to 202 million years ago (mya), and the first flowering plants are known from 160 mya. They diversified extensively during the Lower Cretaceous, became widespread by 120 mya, and replaced conifers as the dominant trees from 100 to 60 mya.\n\nDescription \n\nAngiosperm derived characteristics\n\nAngiosperms differ from other seed plants in several ways, described in the table below. These distinguishing characteristics taken together have made the angiosperms the most diverse and numerous land plants and the most commercially important group to humans.\n\nVascular anatomy\n\nThe amount and complexity of tissue-formation in flowering plants exceeds that of gymnosperms. The vascular bundles of the stem are arranged such that the xylem and phloem form concentric rings.\n\nIn the dicotyledons, the bundles in the very young stem are arranged in an open ring, separating a central pith from an outer cortex. In each bundle, separating the xylem and phloem, is a layer of meristem or active formative tissue known as cambium. By the formation of a layer of cambium between the bundles (interfascicular cambium), a complete ring is formed, and a regular periodical increase in thickness results from the development of xylem on the inside and phloem on the outside. The soft phloem becomes crushed, but the hard wood persists and forms the bulk of the stem and branches of the woody perennial. Owing to differences in the character of the elements produced at the beginning and end of the season, the wood is marked out in transverse section into concentric rings, one for each season of growth, called annual rings.\n\nAmong the monocotyledons, the bundles are more numerous in the young stem and are scattered through the ground tissue. They contain no cambium and once formed the stem increases in diameter only in exceptional cases.\n\nReproductive anatomy \n\nThe characteristic feature of angiosperms is the flower. Flowers show remarkable variation in form and elaboration, and provide the most trustworthy external characteristics for establishing relationships among angiosperm species. The function of the flower is to ensure fertilization of the ovule and development of fruit containing seeds. The floral apparatus may arise terminally on a shoot or from the axil of a leaf (where the petiole attaches to the stem). Occasionally, as in violets, a flower arises singly in the axil of an ordinary foliage-leaf. More typically, the flower-bearing portion of the plant is sharply distinguished from the foliage-bearing or vegetative portion, and forms a more or less elaborate branch-system called an inflorescence.\n\nThere are two kinds of reproductive cells produced by flowers. Microspores, which will divide to become pollen grains, are the \"male\" cells and are borne in the stamens (or microsporophylls). The \"female\" cells called megaspores, which will divide to become the egg cell (megagametogenesis), are contained in the ovule and enclosed in the carpel (or megasporophyll).\n\nThe flower may consist only of these parts, as in willow, where each flower comprises only a few stamens or two carpels. Usually, other structures are present and serve to protect the sporophylls and to form an envelope attractive to pollinators. The individual members of these surrounding structures are known as sepals and petals (or tepals in flowers such as Magnolia where sepals and petals are not distinguishable from each other). The outer series (calyx of sepals) is usually green and leaf-like, and functions to protect the rest of the flower, especially the bud. The inner series (corolla of petals) is, in general, white or brightly colored, and is more delicate in structure. It functions to attract insect or bird pollinators. Attraction is effected by color, scent, and nectar, which may be secreted in some part of the flower. The characteristics that attract pollinators account for the popularity of flowers and flowering plants among humans.\n\nWhile the majority of flowers are perfect or hermaphrodite (having both pollen and ovule producing parts in the same flower structure), flowering plants have developed numerous morphological and physiological mechanisms to reduce or prevent self-fertilization. Heteromorphic flowers have short carpels and long stamens, or vice versa, so animal pollinators cannot easily transfer pollen to the pistil (receptive part of the carpel). Homomorphic flowers may employ a biochemical (physiological) mechanism called self-incompatibility to discriminate between self and non-self pollen grains. In other species, the male and female parts are morphologically separated, developing on different flowers.\n\nTaxonomy \n\nHistory of classification\n\nThe botanical term \"Angiosperm\", from the Ancient Greek αγγείον, angeíon (bottle, vessel) and σπέρμα, (seed), was coined in the form Angiospermae by Paul Hermann in 1690, as the name of one of his primary divisions of the plant kingdom. This included flowering plants possessing seeds enclosed in capsules, distinguished from his Gymnospermae, or flowering plants with achenial or schizo-carpic fruits, the whole fruit or each of its pieces being here regarded as a seed and naked. The term and its antonym were maintained by Carl Linnaeus with the same sense, but with restricted application, in the names of the orders of his class Didynamia. Its use with any approach to its modern scope became possible only after 1827, when Robert Brown established the existence of truly naked ovules in the Cycadeae and Coniferae,Brown R., Character and description of Kingia, a new genus of plants found on the southwest coast of New Holland: with observations on the structure of its unimpregnated ovulum; and on the female flower of Cycadeae and Coniferae, in: King P.P. (Ed.) Narrative of a Survey of the Intertropical and western coasts of Australia, performed between years 1818 and 1822. John Murray, London, 1827, vol. 2., pp. 534–565, [https://books.google.com/books?idRjdCAAAAIAAJ&hl\n&pgPA534#v\nonepage&q&f=false]. and applied to them the name Gymnosperms. From that time onward, as long as these Gymnosperms were, as was usual, reckoned as dicotyledonous flowering plants, the term Angiosperm was used antithetically by botanical writers, with varying scope, as a group-name for other dicotyledonous plants.\n\nIn 1851, Hofmeister discovered the changes occurring in the embryo-sac of flowering plants, and determined the correct relationships of these to the Cryptogamia. This fixed the position of Gymnosperms as a class distinct from Dicotyledons, and the term Angiosperm then gradually came to be accepted as the suitable designation for the whole of the flowering plants other than Gymnosperms, including the classes of Dicotyledons and Monocotyledons. This is the sense in which the term is used today.\n\nIn most taxonomies, the flowering plants are treated as a coherent group. The most popular descriptive name has been Angiospermae (Angiosperms), with Anthophyta (\"flowering plants\") a second choice. These names are not linked to any rank. The Wettstein system and the Engler system use the name Angiospermae, at the assigned rank of subdivision. The Reveal system treated flowering plants as subdivision Magnoliophytina (Frohne & U. Jensen ex Reveal, Phytologia 79: 70 1996), but later split it to Magnoliopsida, Liliopsida, and Rosopsida. The Takhtajan system and Cronquist system treat this group at the rank of division, leading to the name Magnoliophyta (from the family name Magnoliaceae). The Dahlgren system and Thorne system (1992) treat this group at the rank of class, leading to the name Magnoliopsida. The APG system of 1998, and the later 2003 and 2009 revisions, treat the flowering plants as a clade called angiosperms without a formal botanical name. However, a formal classification was published alongside the 2009 revision in which the flowering plants form the Subclass Magnoliidae.\n\nThe internal classification of this group has undergone considerable revision. The Cronquist system, proposed by Arthur Cronquist in 1968 and published in its full form in 1981, is still widely used but is no longer believed to accurately reflect phylogeny. A consensus about how the flowering plants should be arranged has recently begun to emerge through the work of the Angiosperm Phylogeny Group (APG), which published an influential reclassification of the angiosperms in 1998. Updates incorporating more recent research were published as the APG II system in 2003, the APG III system in 2009, and the APG IV system in 2016.\n\nTraditionally, the flowering plants are divided into two groups,\n\n* Dicotyledoneae or Magnoliopsida\n* Monocotyledoneae or Liliopsida\n\nwhich in the Cronquist system are called Magnoliopsida (at the rank of class, formed from the family name Magnoliaceae) and Liliopsida (at the rank of class, formed from the family name Liliaceae). Other descriptive names allowed by Article 16 of the ICBN include Dicotyledones or Dicotyledoneae, and Monocotyledones or Monocotyledoneae, which have a long history of use. In English a member of either group may be called a dicotyledon (plural dicotyledons) and monocotyledon (plural monocotyledons), or abbreviated, as dicot (plural dicots) and monocot (plural monocots). These names derive from the observation that the dicots most often have two cotyledons, or embryonic leaves, within each seed. The monocots usually have only one, but the rule is not absolute either way. From a broad diagnostic point of view, the number of cotyledons is neither a particularly handy nor a reliable character.\n\nRecent studies, as by the APG, show that the monocots form a monophyletic group (clade) but that the dicots do not (they are paraphyletic). Nevertheless, the majority of dicot species do form a monophyletic group, called the eudicots or tricolpates. Of the remaining dicot species, most belong to a third major clade known as the magnoliids, containing about 9,000 species. The rest include a paraphyletic grouping of early branching taxa known collectively as the basal angiosperms, plus the families Ceratophyllaceae and Chloranthaceae.\n\nModern classification\n\nThere are eight groups of living angiosperms:\n\n* Basal angiosperms (ANA: Amborella, Nymphaeales, Austrobaileyales)\n** Amborella, a single species of shrub from New Caledonia;\n** Nymphaeales, about 80 species,, [http://www.amjbot.org/cgi/content/full/91/10/1437/F2 Figure 2] water lilies and Hydatellaceae;\n** Austrobaileyales, about 100 species of woody plants from various parts of the world\n* Core angiosperms (Mesangiospermae)\n** Chloranthales, several dozen species of aromatic plants with toothed leaves;\n** Magnoliids, about 9,000 species, characterized by trimerous flowers, pollen with one pore, and usually branching-veined leaves—for example magnolias, bay laurel, and black pepper;\n** Monocots, about 70,000 species, characterized by trimerous flowers, a single cotyledon, pollen with one pore, and usually parallel-veined leaves—for example grasses, orchids, and palms;\n** Ceratophyllum, about 6 species of aquatic plants, perhaps most familiar as aquarium plants;\n** Eudicots, about 175,000 species, characterized by 4- or 5-merous flowers, pollen with three pores, and usually branching-veined leaves—for example sunflowers, petunia, buttercup, apples, and oaks.\n\nThe exact relationship between these eight groups is not yet clear, although there is agreement that the first three groups to diverge from the ancestral angiosperm were Amborellales, Nymphaeales, and Austrobaileyales. The term basal angiosperms refers to these three groups. Among the remaining five groups (core angiosperms), the relationship between the three broadest of these groups (magnoliids, monocots, and eudicots) remains unclear. Zeng and colleagues (Fig. 1) describe four competing schemes. Of these, eudicots and monocots are the largest and most diversified, with ~ 75% and 20% of angiosperm species, respectively. Some analyses make the magnoliids the first to diverge, others the monocots. Ceratophyllum seems to group with the eudicots rather than with the monocots. The 2016 Angiosperm Phylogeny Group revision (APG IV) retained the overall higher order relationship described in APG III.\n\n1. Phylogeny of the flowering plants, as of APG III (2009).\n\n2. Example of alternative phylogeny (2010)\n\n3. APG IV (2016)\n\nEvolution\n\nFossilized spores suggest that higher plants (embryophytes) have lived on land for at least 475 million years. Early land plants reproduced sexually with flagellated, swimming sperm, like the green algae from which they evolved. An adaptation to terrestrialization was the development of upright meiosporangia for dispersal by spores to new habitats. This feature is lacking in the descendants of their nearest algal relatives, the Charophycean green algae. A later terrestrial adaptation took place with retention of the delicate, avascular sexual stage, the gametophyte, within the tissues of the vascular sporophyte. This occurred by spore germination within sporangia rather than spore release, as in non-seed plants. A current example of how this might have happened can be seen in the precocious spore germination in Selaginella, the spike-moss. The result for the ancestors of angiosperms was enclosing them in a case, the seed. The first seed bearing plants, like the ginkgo, and conifers (such as pines and firs), did not produce flowers. The pollen grains (male gametophytes) of Ginkgo and cycads produce a pair of flagellated, mobile sperm cells that \"swim\" down the developing pollen tube to the female and her eggs.\n\nThe apparently sudden appearance of nearly modern flowers in the fossil record initially posed such a problem for the theory of evolution that Charles Darwin called it an \"abominable mystery\". However, the fossil record has considerably grown since the time of Darwin, and recently discovered angiosperm fossils such as Archaefructus, along with further discoveries of fossil gymnosperms, suggest how angiosperm characteristics may have been acquired in a series of steps. Several groups of extinct gymnosperms, in particular seed ferns, have been proposed as the ancestors of flowering plants, but there is no continuous fossil evidence showing exactly how flowers evolved. Some older fossils, such as the upper Triassic Sanmiguelia, have been suggested. Based on current evidence, some propose that the ancestors of the angiosperms diverged from an unknown group of gymnosperms in the Triassic period (245–202 million years ago). Fossil angiosperm-like pollen from the Middle Triassic (247.2–242.0 Ma) suggests an older date for their origin.  A close relationship between angiosperms and gnetophytes, proposed on the basis of morphological evidence, has more recently been disputed on the basis of molecular evidence that suggest gnetophytes are instead more closely related to other gymnosperms.\n\nThe evolution of seed plants and later angiosperms appears to be the result of two distinct rounds of whole genome duplication events. These occurred at  and . Another possible whole genome duplication event at   perhaps created the ancestral line that led to all modern flowering plants. That event was studied by sequencing the genome of an ancient flowering plant, Amborella trichopoda, and directly addresses Darwin's \"abominable mystery.\"\n\nThe earliest known macrofossil confidently identified as an angiosperm, Archaefructus liaoningensis, is dated to about 125 million years BP (the Cretaceous period), whereas pollen considered to be of angiosperm origin takes the fossil record back to about 130 million years BP. However, one study has suggested that the early-middle Jurassic plant Schmeissneria, traditionally considered a type of ginkgo, may be the earliest known angiosperm, or at least a close relative. In addition, circumstantial chemical evidence has been found for the existence of angiosperms as early as 250 million years ago. Oleanane, a secondary metabolite produced by many flowering plants, has been found in Permian deposits of that age together with fossils of gigantopterids.[http://www.sciencedaily.com/releases/2001/04/010403071438.htm Oily Fossils Provide Clues To The Evolution Of Flowers] — ScienceDaily (April 5, 2001) Gigantopterids are a group of extinct seed plants that share many morphological traits with flowering plants, although they are not known to have been flowering plants themselves.\n\nIn 2013 flowers encased in amber were found and dated 100 million years before present. The amber had frozen the act of sexual reproduction in the process of taking place. Microscopic images showed tubes growing out of pollen and penetrating the flower's stigma. The pollen was sticky, suggesting it was carried by insects.\n\nRecent DNA analysis based on molecular systematics[https://www.pbs.org/wgbh/nova/transcripts/3405_flower.html NOVA — Transcripts — First Flower] — PBS Airdate: April 17, 2007\n showed that Amborella trichopoda, found on the Pacific island of New Caledonia, belongs to a sister group of the other flowering plants, and morphological studies[http://www.eurekalert.org/pub_releases/2006-05/uoca-spp051506.php South Pacific plant may be missing link in evolution of flowering plants] — Public release date: 17 May 2006 suggest that it has features that may have been characteristic of the earliest flowering plants.\n\nThe orders Amborellales, Nymphaeales, and Austrobaileyales diverged as separate lineages from the remaining angiosperm clade at a very early stage in flowering plant evolution.\n\nThe great angiosperm radiation, when a great diversity of angiosperms appears in the fossil record, occurred in the mid-Cretaceous (approximately 100 million years ago). However, a study in 2007 estimated that the division of the five most recent (the genus Ceratophyllum, the family Chloranthaceae, the eudicots, the magnoliids, and the monocots) of the eight main groups occurred around 140 million years ago.\nBy the late Cretaceous, angiosperms appear to have dominated environments formerly occupied by ferns and cycadophytes, but large canopy-forming trees replaced conifers as the dominant trees only close to the end of the Cretaceous 66 million years ago or even later, at the beginning of the Tertiary. The radiation of herbaceous angiosperms occurred much later. Yet, many fossil plants recognizable as belonging to modern families (including beech, oak, maple, and magnolia) had already appeared by the late Cretaceous.\n\nIt has been proposed that the swift rise of angiosperms to dominance was facilitated by a reduction in their genome size. During the early Cretaceous period, only angiosperms underwent rapid genome downsizing, while genome sizes of ferns and gymnosperms remained unchanged.  Smaller genomes–and smaller nuclei–allow for faster rates of cell division and smaller cells.  Thus, species with smaller genomes can pack more, smaller cells–in particular veins and stomata–into a given leaf volume.  Genome downsizing therefore facilitated higher rates of leaf gas exchange (transpiration and photosynthesis) and faster rates of growth.  This would have countered some of the negative physiological effects of genome duplications, facilitated increased uptake of carbon dioxide despite concurrent declines in atmospheric CO2 concentrations, and allowed the flowering plants to outcompete other land plants.\n\nIt is generally assumed that the function of flowers, from the start, was to involve mobile animals in their reproduction processes. That is, pollen can be scattered even if the flower is not brightly colored or oddly shaped in a way that attracts animals; however, by expending the energy required to create such traits, angiosperms can enlist the aid of animals and, thus, reproduce more efficiently.\n\nIsland genetics provides one proposed explanation for the sudden, fully developed appearance of flowering plants. Island genetics is believed to be a common source of speciation in general, especially when it comes to radical adaptations that seem to have required inferior transitional forms. Flowering plants may have evolved in an isolated setting like an island or island chain, where the plants bearing them were able to develop a highly specialized relationship with some specific animal (a wasp, for example). Such a relationship, with a hypothetical wasp carrying pollen from one plant to another much the way fig wasps do today, could result in the development of a high degree of specialization in both the plant(s) and their partners. Note that the wasp example is not incidental; bees, which, it is postulated, evolved specifically due to mutualistic plant relationships, are descended from wasps.\n\nAnimals are also involved in the distribution of seeds. Fruit, which is formed by the enlargement of flower parts, is frequently a seed-dispersal tool that attracts animals to eat or otherwise disturb it, incidentally scattering the seeds it contains (see frugivory). Although many such mutualistic relationships remain too fragile to survive competition and to spread widely, flowering proved to be an unusually effective means of reproduction, spreading (whatever its origin) to become the dominant form of land plant life.\n\nFlower ontogeny uses a combination of genes normally responsible for forming new shoots.[http://unisci.com/stories/20012/0615015.htm Age-Old Question On Evolution Of Flowers Answered] — 15-Jun-2001 The most primitive flowers probably had a variable number of flower parts, often separate from (but in contact with) each other. The flowers tended to grow in a spiral pattern, to be bisexual (in plants, this means both male and female parts on the same flower), and to be dominated by the ovary (female part). As flowers evolved, some variations developed parts fused together, with a much more specific number and design, and with either specific sexes per flower or plant or at least \"ovary-inferior\".\n\nFlower evolution continues to the present day; modern flowers have been so profoundly influenced by humans that some of them cannot be pollinated in nature. Many modern domesticated flower species were formerly simple weeds, which sprouted only when the ground was disturbed. Some of them tended to grow with human crops, perhaps already having symbiotic companion plant relationships with them, and the prettiest did not get plucked because of their beauty, developing a dependence upon and special adaptation to human affection.[http://www.livescience.com/295-human-affection-altered-evolution-flowers.html Human Affection Altered Evolution of Flowers] — By Robert Roy Britt, LiveScience Senior Writer (posted: 26 May 2005 06:53 am ET)\n\nA few paleontologists have also proposed that flowering plants, or angiosperms, might have evolved due to interactions with dinosaurs. One of the idea's strongest proponents is Robert T. Bakker. He proposes that herbivorous dinosaurs, with their eating habits, provided a selective pressure on plants, for which adaptations either succeeded in deterring or coping with predation by herbivores.\n\nIn August 2017, scientists presented a detailed description and 3D model image of what the first flower possibly looked like, and presented the hypothesis that it may have lived about 140 million years ago.\n\nA Bayesian analysis of 52 angiosperm taxa suggested that the crown group of angisperms evolved between  and .Foster CSP, Ho SYW (2017) Strategies for partitioning clock models in phylogenomic dating: Application to the angiosperm evolutionary timescale. Genome Biol Evol\n\nFlowering plant diversity\n\nThe number of species of flowering plants is estimated to be in the range of 250,000 to 400,000. This compares to around 12,000 species of moss or 11,000 species of pteridophytes,Raven, Peter H., Ray F. Evert, & Susan E. Eichhorn, 2005. Biology of Plants, 7th edition. (New York: W. H. Freeman and Company). . showing that the flowering plants are much more diverse. The number of families in APG (1998) was 462. In APG II (2003) it is not settled; at maximum it is 457, but within this number there are 55 optional segregates, so that the minimum number of families in this system is 402. In APG III (2009) there are 415 families.\n\nThe diversity of flowering plants is not evenly distributed. Nearly all species belong to the eudicot (75%), monocot (23%), and magnoliid (2%) clades. The remaining 5 clades contain a little over 250 species in total; i.e. less than 0.1% of flowering plant diversity, divided among 9 families. The 43 most-diverse of 443 families of flowering plants by species, in their APG circumscriptions, are\n# Asteraceae or Compositae (daisy family): 22,750 species;\n# Orchidaceae (orchid family): 21,950;\n# Fabaceae or Leguminosae (bean family): 19,400;\n# Rubiaceae (madder family): 13,150;\n# Poaceae or Gramineae (grass family): 10,035;\n# Lamiaceae or Labiatae (mint family): 7,175;\n# Euphorbiaceae (spurge family): 5,735;\n# Melastomataceae or Melastomaceae (melastome family): 5,005;\n# Myrtaceae (myrtle family): 4,625;\n# Apocynaceae (dogbane family): 4,555;\n# Cyperaceae (sedge family): 4,350;\n# Malvaceae (mallow family): 4,225;\n# Araceae (arum family): 4,025;\n# Ericaceae (heath family): 3,995;\n# Gesneriaceae (gesneriad family): 3,870;\n# Apiaceae or Umbelliferae (parsley family): 3,780;\n# Brassicaceae or Cruciferae (cabbage family): 3,710:\n# Piperaceae (pepper family): 3,600;\n# Bromeliaceae (bromeliad family): 3,540;\n# Acanthaceae (acanthus family): 3,500;\n# Rosaceae (rose family): 2,830;\n# Boraginaceae (borage family): 2,740;\n# Urticaceae (nettle family): 2,625;\n# Ranunculaceae (buttercup family): 2,525;\n# Lauraceae (laurel family): 2,500;\n# Solanaceae (nightshade family): 2,460;\n# Campanulaceae (bellflower family): 2,380;\n# Arecaceae (palm family): 2,361;\n# Annonaceae (custard apple family): 2,220;\n# Caryophyllaceae (pink family): 2,200;\n# Orobanchaceae (broomrape family): 2,060;\n# Amaranthaceae (amaranth family): 2,050;\n# Iridaceae (iris family): 2,025;\n# Aizoaceae or Ficoidaceae (ice plant family): 2,020;\n# Rutaceae (rue family): 1,815;\n# Phyllanthaceae (phyllanthus family): 1,745;\n# Scrophulariaceae (figwort family): 1,700;\n# Gentianaceae (gentian family): 1,650;\n# Convolvulaceae (bindweed family): 1,600;\n# Proteaceae (protea family): 1,600;\n# Sapindaceae (soapberry family): 1,580;\n# Cactaceae (cactus family): 1,500;\n# Araliaceae (Aralia or ivy family): 1,450.\nOf these, the Orchidaceae, Poaceae, Cyperaceae, Bromeliaceae, Arecaceae, and Iridaceae are monocot families; Piperaceae, Lauraceae, and Annonaceae are magnoliid dicots; the rest of the families are eudicots.\n\nReproduction \n\nFertilization and embryogenesis\n\nDouble fertilization refers to a process in which two sperm cells fertilize cells in the ovule. This process begins when a pollen grain adheres to the stigma of the pistil (female reproductive structure), germinates, and grows a long pollen tube. While this pollen tube is growing, a haploid generative cell travels down the tube behind the tube nucleus. The generative cell divides by mitosis to produce two haploid (n) sperm cells. As the pollen tube grows, it makes its way from the stigma, down the style and into the ovary. Here the pollen tube reaches the micropyle of the ovule and digests its way into one of the synergids, releasing its contents (which include the sperm cells). The synergid that the cells were released into degenerates and one sperm makes its way to fertilize the egg cell, producing a diploid (2n) zygote. The second sperm cell fuses with both central cell nuclei, producing a triploid (3n) cell. As the zygote develops into an embryo, the triploid cell develops into the endosperm, which serves as the embryo's food supply. The ovary will now develop into a fruit and the ovule will develop into a seed.\n\nFruit and seed\n\nAs the development of embryo and endosperm proceeds within the embryo sac, the sac wall enlarges and combines with the nucellus (which is likewise enlarging) and the integument to form the seed coat. The ovary wall develops to form the fruit or pericarp, whose form is closely associated with type of seed dispersal system.\n\nFrequently, the influence of fertilization is felt beyond the ovary, and other parts of the flower take part in the formation of the fruit, e.g., the floral receptacle in the apple, strawberry, and others.\n\nThe character of the seed coat bears a definite relation to that of the fruit. They protect the embryo and aid in dissemination; they may also directly promote germination. Among plants with indehiscent fruits, in general, the fruit provides protection for the embryo and secures dissemination. In this case, the seed coat is only slightly developed. If the fruit is dehiscent and the seed is exposed, in general, the seed-coat is well developed, and must discharge the functions otherwise executed by the fruit.\n\nMeiosis\n\nFlowering plants generate gametes using a specialized cell division called meiosis.  Meiosis takes place in the ovule (a structure within the ovary that is located within the pistil at the center of the flower) (see diagram labeled \"Angiosperm lifecycle\").  A diploid cell (megaspore mother cell) in the ovule undergoes meiosis (involving two successive cell divisions) to produce four cells (megaspores) with haploid nuclei.Snustad DP, Simmons MJ (2008). Principles of Genetics (5th ed.). Wiley. .  One of these four cells (megaspore) then undergoes three successive mitotic divisions to produce an immature embryo sac (megagametophyte) with eight haploid nuclei.  Next, these nuclei are segregated into separate cells by cytokinesis to producing 3 antipodal cells, 2 synergid cells and an egg cell.  Two polar nuclei are left in the central cell of the embryo sac.\n\nPollen is also produced by meiosis in the male anther (microsporangium).  During meiosis, a diploid microspore mother cell undergoes two successive meiotic divisions to produce 4 haploid cells (microspores or male gametes). Each of these microspores, after further mitoses, becomes a pollen grain (microgametophyte) containing two haploid generative (sperm) cells and a tube nucleus.  When a pollen grain makes contact with the female stigma, the pollen grain forms a pollen tube that grows down the style into the ovary.  In the act of fertilization, a male sperm nucleus fuses with the female egg nucleus to form a diploid zygote that can then develop into an embryo within the newly forming seed.  Upon germination of the seed, a new plant can grow and mature.\n\nThe adaptive function of meiosis is currently a matter of debate.  A key event during meiosis in a diploid cell is the pairing of homologous chromosomes and homologous recombination (the exchange of genetic information) between homologous chromosomes.  This process promotes the production of increased genetic diversity among progeny and the recombinational repair of damages in the DNA to be passed on to progeny.  To explain the adaptive function of meiosis in flowering plants, some authors emphasize diversity and others emphasize DNA repair.\n\nApomixis\n\nApomixis (reproduction via asexually formed seeds) is found naturally in about 2.2% of angiosperm genera   One type of apomixis, gametophytic apomixis found in a dandelion species   involves formation of an unreduced embryo sac due to incomplete meiosis (apomeiosis) and development of an embryo from the unreduced egg inside the embryo sac, without fertilization (parthenogenesis).\n\nUses \n\nAgriculture is almost entirely dependent on angiosperms, which provide virtually all plant-based food, and also provide a significant amount of livestock feed. Of all the families of plants, the Poaceae, or grass family (providing grains), is by far the most important, providing the bulk of all feedstocks (rice, maize, wheat, barley, rye, oats, pearl millet, sugar cane, sorghum). The Fabaceae, or legume family, comes in second place. Also of high importance are the Solanaceae, or nightshade family (potatoes, tomatoes, and peppers, among others); the Cucurbitaceae, or gourd family (including pumpkins and melons); the Brassicaceae, or mustard plant family (including rapeseed and the innumerable varieties of the cabbage species Brassica oleracea); and the Apiaceae, or parsley family. Many of our fruits come from the Rutaceae, or rue family (including oranges, lemons, grapefruits, etc.), and the Rosaceae, or rose family (including apples, pears, cherries, apricots, plums, etc.).\n\nIn some parts of the world, certain single species assume paramount importance because of their variety of uses, for example the coconut (Cocos nucifera) on Pacific atolls, and the olive (Olea europaea) in the Mediterranean region.\n\nFlowering plants also provide economic resources in the form of wood, paper, fiber (cotton, flax, and hemp, among others), medicines (digitalis, camphor), decorative and landscaping plants, and many other uses. The main area in which they are surpassed by other plants — namely, coniferous trees (Pinales), which are non-flowering (gymnosperms) — is timber and paper production. Flowering plant. http://en.wikipedia.org/?curid=18967."
  }
}
