{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8893",
  "eid" : "eb411480-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778474440,
  "textBody" : "Events\n\n* 875 – Charles the Bald, King of the Franks, is crowned as Holy Roman Emperor Charles II.\n*1170 – Thomas Becket, Archbishop of Canterbury, is assassinated inside Canterbury Cathedral by followers of King Henry II; he subsequently becomes a saint and martyr in the Anglican Communion and the Catholic Church.\n*1427 – The Ming army begins its withdraw from Hanoi, ending the Chinese domination of Đại Việt.\n*1503 – The Battle of Garigliano (1503) was fought between a Spanish army under Gonzalo Fernández de Córdoba and a French army commanded by Ludovico II, Marquess of Saluzzo\n*1508 – Portuguese forces under the command of Francisco de Almeida attack Khambhat at the Battle of Dabul.\n*1778 – American Revolutionary War: Three thousand British soldiers under the command of Lieutenant Colonel Archibald Campbell capture Savannah, Georgia.\n*1812 – The  under the command of Captain William Bainbridge, captures the  off the coast of Brazil after a three-hour battle.\n*1835 – The Treaty of New Echota is signed, ceding all the lands of the Cherokee east of the Mississippi River to the United States.\n*1845 – In accordance with International Boundary delimitation, the United States annexes the Republic of Texas, following the manifest destiny doctrine. The Republic of Texas, which had been independent since the Texas Revolution of 1836, is thereupon admitted as the 28th U.S. state.\n*1851 – The first American YMCA opens in Boston, Massachusetts.\n*1860 – The launch of , with her combination of screw propeller, iron hull and iron armour, renders all previous warships obsolete.\n*1874 – The military coup of Gen. Martinez Campos in Sagunto ends the failed First Spanish Republic and the monarchy is restored as Prince Alfonso is proclaimed King of Spain.\n*1876 – The Ashtabula River railroad disaster occurs, leaving 64 injured and 92 dead at Ashtabula, Ohio.\n*1890 –  Wounded Knee Massacre on Pine Ridge Indian Reservation, 300 Lakota are killed by the United States 7th Cavalry Regiment.\n*1911 – Mongolia gains independence from the Qing dynasty, enthroning 9th Jebtsundamba Khutughtu as Khagan of Mongolia.\n*  1911   – Sun Yat-sen becomes the provisional President of the Republic of China; he formally takes office on January 1, 1912.\n*1916 – A Portrait of the Artist as a Young Man, the first novel by James Joyce, was first published as a book by an American publishing house B. W. Huebschis after it had been serialized in The Egoist (1914–15).\n*1930 – Sir Muhammad Iqbal's presidential address in Allahabad introduces the two-nation theory and outlines a vision for the creation of Pakistan.\n*1934 – Japan renounces the Washington Naval Treaty of 1922 and the London Naval Treaty of 1930.\n*1937 – The Irish Free State is replaced by a new state called Ireland with the adoption of a new constitution.\n*1940 – World War II: In the Second Great Fire of London, the Luftwaffe fire-bombs London, England, killing almost 200 civilians.\n*1949 – KC2XAK of Bridgeport, Connecticut becomes the first Ultra high frequency (UHF) television station to operate a daily schedule.\n*1972 – Eastern Air Lines Flight 401 (a Lockheed L-1011 TriStar) crashes in the Florida Everglades on approach to Miami International Airport, Florida, killing 101 of the 176 people on board.\n*1975 – A bomb explodes at LaGuardia Airport in New York City, killing 11 people and injuring 74.\n*1989 – Czech writer, philosopher and dissident Václav Havel is elected the first post-communist President of Czechoslovakia.\n* 1989 – Riots break out after Hong Kong decides to forcibly repatriate Vietnamese refugees.\n*1992 – Fernando Collor de Mello, president of Brazil, tries to resign amidst corruption charges, but is then impeached.\n*1996 – Guatemala and leaders of Guatemalan National Revolutionary Unity sign a peace accord ending a 36-year civil war.\n*1997 – Hong Kong begins to kill all the city's 1.25 million chickens to stop the spread of a potentially deadly influenza strain.\n*1998 – Leaders of the Khmer Rouge apologize for the 1970s genocide in Cambodia that claimed over one million lives.\n*2003 – The last known speaker of Akkala Sami dies, rendering the language extinct.\n*2006 – UK settles its Anglo-American loan, post-WWII loan debt.\n*2011 – Samoa and Tokelau skip straight to December 31 when moving from one side of the International Date Line to another.\n*2012 – A Tupolev Tu-204 airliner crashes in a ditch between the airport fence and the M3 highway after overshooting a runway at Vnukovo International Airport in Moscow, Russia, killing five people and leaving three others critically injured.\n*2013 – A suicide bomb attack at the Volgograd-1 railway station in the southern Russian city of Volgograd kills at least 18 people and wounds 40 others.\n\n*2017 – An accidental fire started by a three-year-old boy, kills 12 people in an apartment building in the Bronx, New York.\n\nBirths\n\n* 765 – Ali al-Ridha, Arabian 8th of the Twelve Imams (d. 818)\n*1019 – King Munjong of Goryeo (d. 1083)\n*1536 – Henry VI, Burgrave of Plauen (d. 1572)\n*1550 – García de Silva Figueroa, Spanish diplomat and traveller (d. 1624)\n*1633 – Johannes Zollikofer, Swiss vicar (d. 1692)\n*1709 – Elizabeth of Russia (d. 1762)\n*1746 – Saverio Cassar, Gozitan priest and rebel leader (d. 1805)\n*1766 – Charles Macintosh, Scottish chemist and the inventor of waterproof fabric (d. 1843)\n*1796 – Johann Christian Poggendorff, German physicist and journalist (d. 1877)\n*1800 – Charles Goodyear, American chemist and engineer (d. 1860)\n*1808 – Andrew Johnson, American general and politician, 17th President of the United States (d. 1875)\n*1809 – William Ewart Gladstone, English lawyer and politician, Prime Minister of the United Kingdom (d. 1898)\n*1816 – Carl Ludwig, German physician and physiologist (d. 1895)\n*1844 – Womesh Chunder Bonnerjee, Indian barrister and was the first president of Indian National Congress. (d. 1906)\n*1855 – August Kitzberg, Estonian author and poet (d. 1927)\n*1856 – Thomas Joannes Stieltjes, Dutch-French mathematician and academic (d. 1894)\n*1859 – Venustiano Carranza, Mexican soldier and politician, 37th President of Mexico (d. 1920)\n*1874 – François Brandt, Dutch rower and bishop (d. 1949)\n*1876 – Pablo Casals, Catalan cellist and conductor (d. 1973)\n*1879 – Billy Mitchell, American general and pilot (d. 1936)\n*1881 – Jess Willard, American boxer (d. 1968)\n*1885 – Roman von Ungern-Sternberg, Austrian-Russian general (d. 1921)\n*1886 – Norman Hallows, English runner and captain (d. 1968)\n*1895 – Oswald Freisler, German lawyer and author (d. 1939)\n*1896 – David Alfaro Siqueiros, Mexican painter (d. 1974)\n*1899 – Nie Rongzhen, Chinese general and politician, Mayor of Beijing (d. 1992)\n*1902 – Nels Stewart, Canadian ice hockey player (d. 1957)\n*1903 – Candido Portinari, Brazilian painter (d. 1962)\n*1904 – Kuvempu, Indian author and poet (d. 1994)\n*1908 – Helmut Gollwitzer, German theologian and author (d. 1993)\n*  1908   – Magnus Pyke, English scientist and author (d. 1992)\n*1910 – Ronald Coase, English-American economist, author, and academic, Nobel Prize laureate  (d. 2013)\n*1911 – Klaus Fuchs, German physicist and spy (d. 1988)\n*1914 – Zainul Abedin, Bangladeshi painter and academic (d. 1976)\n*  1914   – Billy Tipton, American pianist and saxophonist (d. 1989)\n*  1914   – Albert Tucker, Australian painter and illustrator (d. 1999)\n*1915 – Bill Osmanski, American football player and coach (d. 1996)\n*  1915   – Robert Ruark, American hunter and author (d. 1965)\n*  1915   – Jo Van Fleet, American actress (d. 1996)\n*1917 – Tom Bradley, American lieutenant, lawyer, and politician, 38th Mayor of Los Angeles (d. 1998)\n*  1917   – Ramanand Sagar, Indian director and producer (d. 2005)\n*1919 – Alfred de Grazia, American political scientist and author (d. 2014)\n*  1919   – Roman Vlad, Italian pianist and composer (d. 2013)\n*1920 – Viveca Lindfors, Swedish-American actress, singer and poet (d. 1995)\n*1921 – Dobrica Ćosić, Serbian politician, 1st President of the Federal Republic of Yugoslavia (d. 2014)\n*1922 – Little Joe Cook, American singer-songwriter (d. 2014)\n*  1922   – William Gaddis, American author and academic (d. 1998)\n*1923 – Cheikh Anta Diop, Senegalese historian, anthropologist, and physicist (d. 1986)\n*  1923   – Morton Estrin, American pianist and educator (d. 2017)\n*  1923   – Dina Merrill, American actress, game show panelist, socialite, heiress, and businesswoman (d. 2017)\n*  1923   – Shlomo Venezia, Greek-Italian author and Holocaust survivor (d. 2012)\n*  1923   – Yvonne Choquet-Bruhat, French mathematician and physicist\n*1924 – Joe Allbritton, American businessman and publisher, founded the Allbritton Communications Company (d. 2012)\n*1925 – Pete Dye, American golfer and architect\n*1927 – Andy Stanfield, American sprinter (d. 1985)\n*1929 – Matt Murphy, American guitarist \n*1931 – Stasys Stonkus, Lithuanian basketball player and coach (d. 2012)\n*1932 – Inga Swenson, American actress and singer\n*1933 – Samuel Brittan, English journalist and author\n*1934 – Ed Flanders, American actor (d. 1995)\n*1936 – Mary Tyler Moore, American actress and producer (d. 2017)\n*  1936   – Ray Nitschke, American football player (d. 1998)\n*1937 – Wayne Huizenga, American businessman, founded AutoNation\n*1938 – Harvey Smith, English horse rider and sportscaster\n*  1938   – Jon Voight, American actor and producer\n*1939 – Ed Bruce, American country music singer-songwriter\n*1941 – Ray Thomas, English singer-songwriter and flute player \n*  1942   – Óscar Andrés Rodríguez Maradiaga, Honduran cardinal \n*1943 – Bill Aucoin, American talent manager (d. 2010)\n*  1943   – Molly Bang, American author and illustrator\n*  1943   – Rick Danko, Canadian singer-songwriter, bass player, and producer (d. 1999)\n*1944 – Rodney Redmond, New Zealand cricketer  \n*1945 – Birendra of Nepal, King of Nepal from 1972 to 2001 (d. 2001)\n*1946 – Marianne Faithfull, English singer-songwriter and actress\n*  1946   – Laffit Pincay, Jr., Panamanian jockey\n*1947 – Richard Crandall, American physicist and computer scientist (d. 2012)\n*  1947   – Ted Danson, American actor and producer\n*  1947   – Leonhard Lapin, Estonian architect and poet\n*  1947   – Cozy Powell, English drummer, songwriter, and producer (d. 1998)\n*  1947   – David Tanner, English rower and coach\n*  1947   – Vincent Winter, Scottish actor, director, and production manager (d. 1998)\n*1948 – Peter Robinson, Northern Irish politician, 3rd First Minister of Northern Ireland\n*1949 – David Topliss, English rugby league player and coach (d. 2008)\n*1951 – Yvonne Elliman, American singer-songwriter and actress\n*1952 – Gelsey Kirkland, American ballerina and choreographer\n*1953 – Thomas Bach, German fencer, lawyer and sports administrator; 9th President of the International Olympic Committee\n*  1953   – Alan Rusbridger, Zambia-born English journalist and academic\n*  1953   – Kate Schmidt, American javelin thrower and coach\n*  1953   – Stanley Williams, American gang leader, co-founded the Crips (d. 2005)\n*  1953   – Charlayne Woodard, American actress and playwright\n*1954 – Albrecht Böttcher, German mathematician and author\n*1956 – Katy Munger, American writer\n*1957 – Brad Grey, American screenwriter and producer (d. 2017)\n*  1957   – Oliver Hirschbiegel, German actor, director, and producer\n*  1957   – Iain Paxton, Scottish rugby player and coach\n*  1957   – Paul Rudnick, American author, playwright, and screenwriter\n*1958 – Nancy J. Currie, American colonel, engineer, and astronaut\n*1959 – Keith Crossan, Irish rugby player\n*  1959   – Patricia Clarkson, American actress\n*  1959   – Ann Demeulemeester, Belgian fashion designer\n*  1959   – Milton Ottey, Jamaican-Canadian high jumper and coach\n*  1959   – Paula Poundstone, American comedian and author\n*1960 – David Boon, Australian cricketer\n*  1960   – David Gilbert, Australian cricketer\n*  1960   – Thomas Lubanga Dyilo, Congolese militia leader, founded the Union of Congolese Patriots\n*1961 – Kevin Granata, American engineer and academic (d. 2007)\n*  1961   – Jim Reid, Scottish singer-songwriter and guitarist\n*  1961   – Richard Horton, English physician and journalist\n*1962 – Wynton Rufer, New Zealand footballer\n*  1962   – Devon White, Jamaican-American baseball player\n*1962 – Carles Puigdemont, Catalan politician and former president\n*1963 – Des Foy, English rugby player\n*  1963   – Dave McKean, English illustrator, photographer, director, and pianist\n*  1963   – Sean Payton, American football player and coach\n*  1963   – Liisa Savijarvi, Canadian skier\n*1964 – Michael Cudlitz, American actor\n*1965 – Laurent Boudouani, French boxer\n*  1965   – Dexter Holland, American singer-songwriter and guitarist \n*  1965   – Danilo Pérez, Panamanian pianist and composer\n*1966 – Stefano Eranio, Italian footballer and coach\n*  1966   – Martin Offiah, English rugby league player and sportscaster\n*1967 – Ashleigh Banfield, Canadian-American journalist\n*  1967   – Evan Seinfeld, American bass player, actor, and director\n*1968 – Ri Pun-hui, North Korean table tennis player\n*1969 – Jennifer Ehle, American actress\n*  1969   – Allan McNish, Scottish race car driver and journalist\n*1970 – Enrico Chiesa, Italian footballer and manager\n*  1970   – Aled Jones, Welsh singer and television host\n*  1970   – Glen Phillips, American singer-songwriter and guitarist (Toad the Wet Sprocket) \n*1971 – Besnik Hasi, Kosovo Albanian football manager and former player\n*1972 – Jude Law, English actor\n*1973 – Theo Epstein, American businessman\n*1974 – Mekhi Phifer, American actor and producer\n*  1974   – Richie Sexson, American baseball player and coach\n*  1974   – Ryan Shore, Canadian composer and producer\n*1975 – Shawn Hatosy, American actor\n*  1975   – Jaret Wright, American baseball player\n*1976 – Filip Kuba, Czech ice hockey player\n*  1976   – Danny McBride, American actor, producer and screenwriter\n*1977 – Jimmy Journell, American baseball player\n*1978 – Jake Berry, English lawyer and politician\n*  1978   – Matthew Carr, Australian footballer\n*  1978   – Kieron Dyer, English footballer and coach\n*  1978   – Danny Higginbotham, English footballer and journalist\n*  1978   – Steve Kemp, English drummer \n*1979 – Mitsuhiro Ishida, Japanese mixed martial artist\n*  1979   – Diego Luna, Mexican actor, director and producer\n*  1979   – Moe Oshikiri, Japanese model and actress\n*  1979   – George Parros, American ice hockey player\n*1981 – Shizuka Arakawa, Japanese figure skater and sportscaster\n*  1981   – Shaun Suisham, American football player\n*  1981   – Vjatšeslav Zahovaiko, Estonian footballer\n*1982 – Alison Brie, American actress and singer\n*  1982   – Brian Hill, Canadian swimmer\n*  1982   – Dale Morris, Australian footballer\n*  1982   – Norbert Siedler, Austrian race car driver\n*1983 – Jessica Andrews, American singer-songwriter\n*  1983   – James Kelly, Australian footballer\n*1984 – Brenton Lawrence, Australian rugby league player\n*  1984   – Reimo Tamm, Estonian basketball player\n*1986 – Joe Anyon, English footballer\n*1987 – Yuhi Sekiguchi, Japanese race car driver\n*1988 – Eric Berry, American football player\n*  1988   – Christen Press, American footballer\n*  1988   – Ágnes Szávay, Hungarian tennis player\n*1989 – Kei Nishikori, Japanese tennis player\n*1995 – Ross Lynch, American singer and actor\n\nDeaths\n\n* 721 – Empress Genmei of Japan (b. 660)\n*1125 – Agnes I, Abbess of Quedlinburg (b.c. 1090)\n*1170 – Thomas Becket, English archbishop and saint (b. 1118)\n*1208 – Emperor Zhangzong of Jin, (b. 1168)\n*1380 – Elizabeth of Poland, queen consort of Hungary (b. 1305)\n*1416 – Mathew Swetenham, bow bearer of Henry IV\n*1550 – Bhuvanaikabahu VII, King of Kotte (b. 1468)\n*1563 – Sebastian Castellio, French preacher and theologian (b. 1515)\n*1565 – Queen Munjeong of Korea (b. 1501)\n*1606 – Stephen Bocskay, Prince of Transylvania (b. 1557)\n*1634 – John Albert Vasa, Polish cardinal (b. 1612)\n*1661 – Antoine Girard de Saint-Amant, French poet (b. 1594)\n*1689 – Thomas Sydenham, English physician and author (b. 1624)\n*1720 – Maria Margarethe Kirch, German astronomer and educator (b. 1670)\n*1731 – Brook Taylor, English mathematician and theorist (b. 1685)\n*1737 – Joseph Saurin, French minister and mathematician (b. 1659)\n*1785 – Johan Herman Wessel, Norwegian-Danish poet and playwright (b. 1742)\n*1825 – Jacques-Louis David, French painter and illustrator (b. 1748)\n*1887 – Ferdinand Johann Wiedemann, Estonian-Russian linguist and botanist (b. 1805)\n*1890 – Spotted Elk, American tribal leader (b. 1826)\n*1891 – Leopold Kronecker, Polish-German mathematician and academic (b. 1823)\n*1894 – Christina Rossetti, English poet and hymn-writer (b. 1830)\n*1897 – William James Linton, English-American painter, author, and activist (b. 1812)\n*1900 – John Henry Leech, English entomologist (b. 1862)\n*1910 – Reginald Doherty, English tennis player (b. 1872)\n*1924 – Carl Spitteler, Swiss poet and academic, Nobel Prize laureate (b. 1845)\n*1925 – Félix Vallotton, Swiss/French painter (b. 1865)\n*1926 – Rainer Maria Rilke, Austrian poet and author (b. 1875)\n*1929 – Wilhelm Maybach, German engineer and businessman, founded Maybach (b. 1846)\n*1937 – Don Marquis, American journalist, author, and playwright (b. 1878)\n*1941 – Tullio Levi-Civita, Italian mathematician and scholar (b. 1873)\n*1944 – Khasan Israilov, Chechen rebel (b. 1910) \n*1949 – Tyler Dennett, American historian and author (b. 1883)\n*1952 – Fletcher Henderson, American pianist, composer, and bandleader (b. 1897)\n*1959 – Robin Milford, English soldier and composer (b. 1903)\n*1960 – Eden Phillpotts, English author and poet (b. 1862)\n*1967 – Paul Whiteman, American violinist, composer, and conductor (b. 1890)\n*1968 – Austin Farrer, English theologian and philosopher (b. 1904)\n*1970 – Marie Menken, American director and painter (b. 1909)\n*1972 – Joseph Cornell, American sculptor and director (b. 1903)\n*  1972   – Chrysostomos Papasarantopoulos, Greek priest and missionary (b. 1903)\n*1976 – Ivo Van Damme, Belgian runner (b. 1954)\n*1980 – Nadezhda Mandelstam, Russian author and educator (b. 1899)\n*1981 – Miroslav Krleža, Croatian author, poet, and playwright (b. 1893)\n*1986 – Harold Macmillan, English captain and politician, Prime Minister of the United Kingdom (b. 1894)\n*  1986   – Andrei Tarkovsky, Russian director and screenwriter (b. 1932)\n*1988 – Mike Beuttler, Egyptian race car driver (b. 1940)\n*1996 – Mireille Hartuch, French singer-songwriter and actress (b. 1906)\n*1998 – Jean-Claude Forest, French author and illustrator (b. 1930)\n*1999 – Leon Radzinowicz, Polish-English criminologist and academic (b. 1906)\n*2000 – Adele Stimmel Chase, American sculptor and painter (b. 1917)\n*2001 – Takashi Asahina, Japanese conductor (b. 1908)\n*  2003   – Bob Monkhouse, English comedian, actor, and game show host (b. 1928)\n*2004 – Julius Axelrod, American biochemist and academic, Nobel Prize laureate (b. 1912)\n*  2004   – Ken Burkhart, American baseball player and umpire (b. 1915)\n*2007 – Phil O'Donnell, Scottish footballer (b. 1972)\n*2008 – Freddie Hubbard, American trumpet player and composer (b. 1938)\n*2009 – Steven Williams, American professional wrestler (b. 1960)\n*2010 – Avi Cohen, Israeli footballer and manager (b. 1956)\n*2012 – Tony Greig, South African-Australian cricketer and sportscaster (b. 1946)\n*  2012   – Roland Griffiths-Marsh, Australian soldier and author (b. 1923)\n*  2012   – Edward Meneeley, American painter and sculptor (b. 1927)\n*  2012   – Paulo Rocha, Portuguese director and screenwriter (b. 1935)\n*  2012   – Bruce Stark, American cartoonist (b. 1933)\n*2013 – C. T. Hsia, Chinese-American critic and scholar (b. 1921)\n*  2013   – Benjamin Curtis, American guitarist, drummer, and songwriter (b. 1978)\n*  2013   – Connie Dierking, American basketball player (b. 1936)\n*  2013   – Eero Mäntyranta, Finnish skier (b. 1937)\n*  2013   – Jagadish Mohanty, Indian author and translator (b. 1951)\n*  2013   – Wojciech Kilar, Polish classical and film music composer (b. 1932)\n*2014 – Hari Harilela, Indian-Hong Kong businessman and philanthropist (b. 1922)\n*  2014   – Juanito Remulla, Sr., Filipino lawyer and politician, Governor of Cavite (b. 1933)\n*2015 – Om Prakash Malhotra, Indian general and politician, 25th Governor of Punjab (b. 1922)\n*  2015   – Pavel Srníček, Czech footballer and coach (b. 1968)\n*2016 – Keion Carpenter, American football defensive back (b. 1977)\n*  2016   – LaVell Edwards, American football head coach (b. 1930)\n\nHolidays and observances\n\n* Christian feast day:\n** David, King and prophet (Catholic, Lutheran)\n** Thomas Becket\n** Trophimus of Arles\n** December 29 (Eastern Orthodox liturgics)\n* Constitution Day (Ireland)\n* Independence Day (Mongolia)\n* The fifth day of Christmas (Western Christianity)\n* The fourth day of Kwanzaa (United States)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "December 29" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8893" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 875 – Charles the Bald, King of the Franks, is crowned as Holy Roman Emperor Charles II.\n*1170 – Thomas Becket, Archbishop of Canterbury, is assassinated inside Canterbury Cathedral by followers of King Henry II; he subsequently becomes a saint and martyr in the Anglican Communion and the Catholic Church.\n*1427 – The Ming army begins its withdraw from Hanoi, ending the Chinese domination of Đại Việt.\n*1503 – The Battle of Garigliano (1503) was fought between a Spanish army under Gonzalo Fernández de Córdoba and a French army commanded by Ludovico II, Marquess of Saluzzo\n*1508 – Portuguese forces under the command of Francisco de Almeida attack Khambhat at the Battle of Dabul.\n*1778 – American Revolutionary War: Three thousand British soldiers under the command of Lieutenant Colonel Archibald Campbell capture Savannah, Georgia.\n*1812 – The  under the command of Captain William Bainbridge, captures the  off the coast of Brazil after a three-hour battle.\n*1835 – The Treaty of New Echota is signed, ceding all the lands of the Cherokee east of the Mississippi River to the United States.\n*1845 – In accordance with International Boundary delimitation, the United States annexes the Republic of Texas, following the manifest destiny doctrine. The Republic of Texas, which had been independent since the Texas Revolution of 1836, is thereupon admitted as the 28th U.S. state.\n*1851 – The first American YMCA opens in Boston, Massachusetts.\n*1860 – The launch of , with her combination of screw propeller, iron hull and iron armour, renders all previous warships obsolete.\n*1874 – The military coup of Gen. Martinez Campos in Sagunto ends the failed First Spanish Republic and the monarchy is restored as Prince Alfonso is proclaimed King of Spain.\n*1876 – The Ashtabula River railroad disaster occurs, leaving 64 injured and 92 dead at Ashtabula, Ohio.\n*1890 –  Wounded Knee Massacre on Pine Ridge Indian Reservation, 300 Lakota are killed by the United States 7th Cavalry Regiment.\n*1911 – Mongolia gains independence from the Qing dynasty, enthroning 9th Jebtsundamba Khutughtu as Khagan of Mongolia.\n*  1911   – Sun Yat-sen becomes the provisional President of the Republic of China; he formally takes office on January 1, 1912.\n*1916 – A Portrait of the Artist as a Young Man, the first novel by James Joyce, was first published as a book by an American publishing house B. W. Huebschis after it had been serialized in The Egoist (1914–15).\n*1930 – Sir Muhammad Iqbal's presidential address in Allahabad introduces the two-nation theory and outlines a vision for the creation of Pakistan.\n*1934 – Japan renounces the Washington Naval Treaty of 1922 and the London Naval Treaty of 1930.\n*1937 – The Irish Free State is replaced by a new state called Ireland with the adoption of a new constitution.\n*1940 – World War II: In the Second Great Fire of London, the Luftwaffe fire-bombs London, England, killing almost 200 civilians.\n*1949 – KC2XAK of Bridgeport, Connecticut becomes the first Ultra high frequency (UHF) television station to operate a daily schedule.\n*1972 – Eastern Air Lines Flight 401 (a Lockheed L-1011 TriStar) crashes in the Florida Everglades on approach to Miami International Airport, Florida, killing 101 of the 176 people on board.\n*1975 – A bomb explodes at LaGuardia Airport in New York City, killing 11 people and injuring 74.\n*1989 – Czech writer, philosopher and dissident Václav Havel is elected the first post-communist President of Czechoslovakia.\n* 1989 – Riots break out after Hong Kong decides to forcibly repatriate Vietnamese refugees.\n*1992 – Fernando Collor de Mello, president of Brazil, tries to resign amidst corruption charges, but is then impeached.\n*1996 – Guatemala and leaders of Guatemalan National Revolutionary Unity sign a peace accord ending a 36-year civil war.\n*1997 – Hong Kong begins to kill all the city's 1.25 million chickens to stop the spread of a potentially deadly influenza strain.\n*1998 – Leaders of the Khmer Rouge apologize for the 1970s genocide in Cambodia that claimed over one million lives.\n*2003 – The last known speaker of Akkala Sami dies, rendering the language extinct.\n*2006 – UK settles its Anglo-American loan, post-WWII loan debt.\n*2011 – Samoa and Tokelau skip straight to December 31 when moving from one side of the International Date Line to another.\n*2012 – A Tupolev Tu-204 airliner crashes in a ditch between the airport fence and the M3 highway after overshooting a runway at Vnukovo International Airport in Moscow, Russia, killing five people and leaving three others critically injured.\n*2013 – A suicide bomb attack at the Volgograd-1 railway station in the southern Russian city of Volgograd kills at least 18 people and wounds 40 others.\n\n*2017 – An accidental fire started by a three-year-old boy, kills 12 people in an apartment building in the Bronx, New York.\n\nBirths\n\n* 765 – Ali al-Ridha, Arabian 8th of the Twelve Imams (d. 818)\n*1019 – King Munjong of Goryeo (d. 1083)\n*1536 – Henry VI, Burgrave of Plauen (d. 1572)\n*1550 – García de Silva Figueroa, Spanish diplomat and traveller (d. 1624)\n*1633 – Johannes Zollikofer, Swiss vicar (d. 1692)\n*1709 – Elizabeth of Russia (d. 1762)\n*1746 – Saverio Cassar, Gozitan priest and rebel leader (d. 1805)\n*1766 – Charles Macintosh, Scottish chemist and the inventor of waterproof fabric (d. 1843)\n*1796 – Johann Christian Poggendorff, German physicist and journalist (d. 1877)\n*1800 – Charles Goodyear, American chemist and engineer (d. 1860)\n*1808 – Andrew Johnson, American general and politician, 17th President of the United States (d. 1875)\n*1809 – William Ewart Gladstone, English lawyer and politician, Prime Minister of the United Kingdom (d. 1898)\n*1816 – Carl Ludwig, German physician and physiologist (d. 1895)\n*1844 – Womesh Chunder Bonnerjee, Indian barrister and was the first president of Indian National Congress. (d. 1906)\n*1855 – August Kitzberg, Estonian author and poet (d. 1927)\n*1856 – Thomas Joannes Stieltjes, Dutch-French mathematician and academic (d. 1894)\n*1859 – Venustiano Carranza, Mexican soldier and politician, 37th President of Mexico (d. 1920)\n*1874 – François Brandt, Dutch rower and bishop (d. 1949)\n*1876 – Pablo Casals, Catalan cellist and conductor (d. 1973)\n*1879 – Billy Mitchell, American general and pilot (d. 1936)\n*1881 – Jess Willard, American boxer (d. 1968)\n*1885 – Roman von Ungern-Sternberg, Austrian-Russian general (d. 1921)\n*1886 – Norman Hallows, English runner and captain (d. 1968)\n*1895 – Oswald Freisler, German lawyer and author (d. 1939)\n*1896 – David Alfaro Siqueiros, Mexican painter (d. 1974)\n*1899 – Nie Rongzhen, Chinese general and politician, Mayor of Beijing (d. 1992)\n*1902 – Nels Stewart, Canadian ice hockey player (d. 1957)\n*1903 – Candido Portinari, Brazilian painter (d. 1962)\n*1904 – Kuvempu, Indian author and poet (d. 1994)\n*1908 – Helmut Gollwitzer, German theologian and author (d. 1993)\n*  1908   – Magnus Pyke, English scientist and author (d. 1992)\n*1910 – Ronald Coase, English-American economist, author, and academic, Nobel Prize laureate  (d. 2013)\n*1911 – Klaus Fuchs, German physicist and spy (d. 1988)\n*1914 – Zainul Abedin, Bangladeshi painter and academic (d. 1976)\n*  1914   – Billy Tipton, American pianist and saxophonist (d. 1989)\n*  1914   – Albert Tucker, Australian painter and illustrator (d. 1999)\n*1915 – Bill Osmanski, American football player and coach (d. 1996)\n*  1915   – Robert Ruark, American hunter and author (d. 1965)\n*  1915   – Jo Van Fleet, American actress (d. 1996)\n*1917 – Tom Bradley, American lieutenant, lawyer, and politician, 38th Mayor of Los Angeles (d. 1998)\n*  1917   – Ramanand Sagar, Indian director and producer (d. 2005)\n*1919 – Alfred de Grazia, American political scientist and author (d. 2014)\n*  1919   – Roman Vlad, Italian pianist and composer (d. 2013)\n*1920 – Viveca Lindfors, Swedish-American actress, singer and poet (d. 1995)\n*1921 – Dobrica Ćosić, Serbian politician, 1st President of the Federal Republic of Yugoslavia (d. 2014)\n*1922 – Little Joe Cook, American singer-songwriter (d. 2014)\n*  1922   – William Gaddis, American author and academic (d. 1998)\n*1923 – Cheikh Anta Diop, Senegalese historian, anthropologist, and physicist (d. 1986)\n*  1923   – Morton Estrin, American pianist and educator (d. 2017)\n*  1923   – Dina Merrill, American actress, game show panelist, socialite, heiress, and businesswoman (d. 2017)\n*  1923   – Shlomo Venezia, Greek-Italian author and Holocaust survivor (d. 2012)\n*  1923   – Yvonne Choquet-Bruhat, French mathematician and physicist\n*1924 – Joe Allbritton, American businessman and publisher, founded the Allbritton Communications Company (d. 2012)\n*1925 – Pete Dye, American golfer and architect\n*1927 – Andy Stanfield, American sprinter (d. 1985)\n*1929 – Matt Murphy, American guitarist \n*1931 – Stasys Stonkus, Lithuanian basketball player and coach (d. 2012)\n*1932 – Inga Swenson, American actress and singer\n*1933 – Samuel Brittan, English journalist and author\n*1934 – Ed Flanders, American actor (d. 1995)\n*1936 – Mary Tyler Moore, American actress and producer (d. 2017)\n*  1936   – Ray Nitschke, American football player (d. 1998)\n*1937 – Wayne Huizenga, American businessman, founded AutoNation\n*1938 – Harvey Smith, English horse rider and sportscaster\n*  1938   – Jon Voight, American actor and producer\n*1939 – Ed Bruce, American country music singer-songwriter\n*1941 – Ray Thomas, English singer-songwriter and flute player \n*  1942   – Óscar Andrés Rodríguez Maradiaga, Honduran cardinal \n*1943 – Bill Aucoin, American talent manager (d. 2010)\n*  1943   – Molly Bang, American author and illustrator\n*  1943   – Rick Danko, Canadian singer-songwriter, bass player, and producer (d. 1999)\n*1944 – Rodney Redmond, New Zealand cricketer  \n*1945 – Birendra of Nepal, King of Nepal from 1972 to 2001 (d. 2001)\n*1946 – Marianne Faithfull, English singer-songwriter and actress\n*  1946   – Laffit Pincay, Jr., Panamanian jockey\n*1947 – Richard Crandall, American physicist and computer scientist (d. 2012)\n*  1947   – Ted Danson, American actor and producer\n*  1947   – Leonhard Lapin, Estonian architect and poet\n*  1947   – Cozy Powell, English drummer, songwriter, and producer (d. 1998)\n*  1947   – David Tanner, English rower and coach\n*  1947   – Vincent Winter, Scottish actor, director, and production manager (d. 1998)\n*1948 – Peter Robinson, Northern Irish politician, 3rd First Minister of Northern Ireland\n*1949 – David Topliss, English rugby league player and coach (d. 2008)\n*1951 – Yvonne Elliman, American singer-songwriter and actress\n*1952 – Gelsey Kirkland, American ballerina and choreographer\n*1953 – Thomas Bach, German fencer, lawyer and sports administrator; 9th President of the International Olympic Committee\n*  1953   – Alan Rusbridger, Zambia-born English journalist and academic\n*  1953   – Kate Schmidt, American javelin thrower and coach\n*  1953   – Stanley Williams, American gang leader, co-founded the Crips (d. 2005)\n*  1953   – Charlayne Woodard, American actress and playwright\n*1954 – Albrecht Böttcher, German mathematician and author\n*1956 – Katy Munger, American writer\n*1957 – Brad Grey, American screenwriter and producer (d. 2017)\n*  1957   – Oliver Hirschbiegel, German actor, director, and producer\n*  1957   – Iain Paxton, Scottish rugby player and coach\n*  1957   – Paul Rudnick, American author, playwright, and screenwriter\n*1958 – Nancy J. Currie, American colonel, engineer, and astronaut\n*1959 – Keith Crossan, Irish rugby player\n*  1959   – Patricia Clarkson, American actress\n*  1959   – Ann Demeulemeester, Belgian fashion designer\n*  1959   – Milton Ottey, Jamaican-Canadian high jumper and coach\n*  1959   – Paula Poundstone, American comedian and author\n*1960 – David Boon, Australian cricketer\n*  1960   – David Gilbert, Australian cricketer\n*  1960   – Thomas Lubanga Dyilo, Congolese militia leader, founded the Union of Congolese Patriots\n*1961 – Kevin Granata, American engineer and academic (d. 2007)\n*  1961   – Jim Reid, Scottish singer-songwriter and guitarist\n*  1961   – Richard Horton, English physician and journalist\n*1962 – Wynton Rufer, New Zealand footballer\n*  1962   – Devon White, Jamaican-American baseball player\n*1962 – Carles Puigdemont, Catalan politician and former president\n*1963 – Des Foy, English rugby player\n*  1963   – Dave McKean, English illustrator, photographer, director, and pianist\n*  1963   – Sean Payton, American football player and coach\n*  1963   – Liisa Savijarvi, Canadian skier\n*1964 – Michael Cudlitz, American actor\n*1965 – Laurent Boudouani, French boxer\n*  1965   – Dexter Holland, American singer-songwriter and guitarist \n*  1965   – Danilo Pérez, Panamanian pianist and composer\n*1966 – Stefano Eranio, Italian footballer and coach\n*  1966   – Martin Offiah, English rugby league player and sportscaster\n*1967 – Ashleigh Banfield, Canadian-American journalist\n*  1967   – Evan Seinfeld, American bass player, actor, and director\n*1968 – Ri Pun-hui, North Korean table tennis player\n*1969 – Jennifer Ehle, American actress\n*  1969   – Allan McNish, Scottish race car driver and journalist\n*1970 – Enrico Chiesa, Italian footballer and manager\n*  1970   – Aled Jones, Welsh singer and television host\n*  1970   – Glen Phillips, American singer-songwriter and guitarist (Toad the Wet Sprocket) \n*1971 – Besnik Hasi, Kosovo Albanian football manager and former player\n*1972 – Jude Law, English actor\n*1973 – Theo Epstein, American businessman\n*1974 – Mekhi Phifer, American actor and producer\n*  1974   – Richie Sexson, American baseball player and coach\n*  1974   – Ryan Shore, Canadian composer and producer\n*1975 – Shawn Hatosy, American actor\n*  1975   – Jaret Wright, American baseball player\n*1976 – Filip Kuba, Czech ice hockey player\n*  1976   – Danny McBride, American actor, producer and screenwriter\n*1977 – Jimmy Journell, American baseball player\n*1978 – Jake Berry, English lawyer and politician\n*  1978   – Matthew Carr, Australian footballer\n*  1978   – Kieron Dyer, English footballer and coach\n*  1978   – Danny Higginbotham, English footballer and journalist\n*  1978   – Steve Kemp, English drummer \n*1979 – Mitsuhiro Ishida, Japanese mixed martial artist\n*  1979   – Diego Luna, Mexican actor, director and producer\n*  1979   – Moe Oshikiri, Japanese model and actress\n*  1979   – George Parros, American ice hockey player\n*1981 – Shizuka Arakawa, Japanese figure skater and sportscaster\n*  1981   – Shaun Suisham, American football player\n*  1981   – Vjatšeslav Zahovaiko, Estonian footballer\n*1982 – Alison Brie, American actress and singer\n*  1982   – Brian Hill, Canadian swimmer\n*  1982   – Dale Morris, Australian footballer\n*  1982   – Norbert Siedler, Austrian race car driver\n*1983 – Jessica Andrews, American singer-songwriter\n*  1983   – James Kelly, Australian footballer\n*1984 – Brenton Lawrence, Australian rugby league player\n*  1984   – Reimo Tamm, Estonian basketball player\n*1986 – Joe Anyon, English footballer\n*1987 – Yuhi Sekiguchi, Japanese race car driver\n*1988 – Eric Berry, American football player\n*  1988   – Christen Press, American footballer\n*  1988   – Ágnes Szávay, Hungarian tennis player\n*1989 – Kei Nishikori, Japanese tennis player\n*1995 – Ross Lynch, American singer and actor\n\nDeaths\n\n* 721 – Empress Genmei of Japan (b. 660)\n*1125 – Agnes I, Abbess of Quedlinburg (b.c. 1090)\n*1170 – Thomas Becket, English archbishop and saint (b. 1118)\n*1208 – Emperor Zhangzong of Jin, (b. 1168)\n*1380 – Elizabeth of Poland, queen consort of Hungary (b. 1305)\n*1416 – Mathew Swetenham, bow bearer of Henry IV\n*1550 – Bhuvanaikabahu VII, King of Kotte (b. 1468)\n*1563 – Sebastian Castellio, French preacher and theologian (b. 1515)\n*1565 – Queen Munjeong of Korea (b. 1501)\n*1606 – Stephen Bocskay, Prince of Transylvania (b. 1557)\n*1634 – John Albert Vasa, Polish cardinal (b. 1612)\n*1661 – Antoine Girard de Saint-Amant, French poet (b. 1594)\n*1689 – Thomas Sydenham, English physician and author (b. 1624)\n*1720 – Maria Margarethe Kirch, German astronomer and educator (b. 1670)\n*1731 – Brook Taylor, English mathematician and theorist (b. 1685)\n*1737 – Joseph Saurin, French minister and mathematician (b. 1659)\n*1785 – Johan Herman Wessel, Norwegian-Danish poet and playwright (b. 1742)\n*1825 – Jacques-Louis David, French painter and illustrator (b. 1748)\n*1887 – Ferdinand Johann Wiedemann, Estonian-Russian linguist and botanist (b. 1805)\n*1890 – Spotted Elk, American tribal leader (b. 1826)\n*1891 – Leopold Kronecker, Polish-German mathematician and academic (b. 1823)\n*1894 – Christina Rossetti, English poet and hymn-writer (b. 1830)\n*1897 – William James Linton, English-American painter, author, and activist (b. 1812)\n*1900 – John Henry Leech, English entomologist (b. 1862)\n*1910 – Reginald Doherty, English tennis player (b. 1872)\n*1924 – Carl Spitteler, Swiss poet and academic, Nobel Prize laureate (b. 1845)\n*1925 – Félix Vallotton, Swiss/French painter (b. 1865)\n*1926 – Rainer Maria Rilke, Austrian poet and author (b. 1875)\n*1929 – Wilhelm Maybach, German engineer and businessman, founded Maybach (b. 1846)\n*1937 – Don Marquis, American journalist, author, and playwright (b. 1878)\n*1941 – Tullio Levi-Civita, Italian mathematician and scholar (b. 1873)\n*1944 – Khasan Israilov, Chechen rebel (b. 1910) \n*1949 – Tyler Dennett, American historian and author (b. 1883)\n*1952 – Fletcher Henderson, American pianist, composer, and bandleader (b. 1897)\n*1959 – Robin Milford, English soldier and composer (b. 1903)\n*1960 – Eden Phillpotts, English author and poet (b. 1862)\n*1967 – Paul Whiteman, American violinist, composer, and conductor (b. 1890)\n*1968 – Austin Farrer, English theologian and philosopher (b. 1904)\n*1970 – Marie Menken, American director and painter (b. 1909)\n*1972 – Joseph Cornell, American sculptor and director (b. 1903)\n*  1972   – Chrysostomos Papasarantopoulos, Greek priest and missionary (b. 1903)\n*1976 – Ivo Van Damme, Belgian runner (b. 1954)\n*1980 – Nadezhda Mandelstam, Russian author and educator (b. 1899)\n*1981 – Miroslav Krleža, Croatian author, poet, and playwright (b. 1893)\n*1986 – Harold Macmillan, English captain and politician, Prime Minister of the United Kingdom (b. 1894)\n*  1986   – Andrei Tarkovsky, Russian director and screenwriter (b. 1932)\n*1988 – Mike Beuttler, Egyptian race car driver (b. 1940)\n*1996 – Mireille Hartuch, French singer-songwriter and actress (b. 1906)\n*1998 – Jean-Claude Forest, French author and illustrator (b. 1930)\n*1999 – Leon Radzinowicz, Polish-English criminologist and academic (b. 1906)\n*2000 – Adele Stimmel Chase, American sculptor and painter (b. 1917)\n*2001 – Takashi Asahina, Japanese conductor (b. 1908)\n*  2003   – Bob Monkhouse, English comedian, actor, and game show host (b. 1928)\n*2004 – Julius Axelrod, American biochemist and academic, Nobel Prize laureate (b. 1912)\n*  2004   – Ken Burkhart, American baseball player and umpire (b. 1915)\n*2007 – Phil O'Donnell, Scottish footballer (b. 1972)\n*2008 – Freddie Hubbard, American trumpet player and composer (b. 1938)\n*2009 – Steven Williams, American professional wrestler (b. 1960)\n*2010 – Avi Cohen, Israeli footballer and manager (b. 1956)\n*2012 – Tony Greig, South African-Australian cricketer and sportscaster (b. 1946)\n*  2012   – Roland Griffiths-Marsh, Australian soldier and author (b. 1923)\n*  2012   – Edward Meneeley, American painter and sculptor (b. 1927)\n*  2012   – Paulo Rocha, Portuguese director and screenwriter (b. 1935)\n*  2012   – Bruce Stark, American cartoonist (b. 1933)\n*2013 – C. T. Hsia, Chinese-American critic and scholar (b. 1921)\n*  2013   – Benjamin Curtis, American guitarist, drummer, and songwriter (b. 1978)\n*  2013   – Connie Dierking, American basketball player (b. 1936)\n*  2013   – Eero Mäntyranta, Finnish skier (b. 1937)\n*  2013   – Jagadish Mohanty, Indian author and translator (b. 1951)\n*  2013   – Wojciech Kilar, Polish classical and film music composer (b. 1932)\n*2014 – Hari Harilela, Indian-Hong Kong businessman and philanthropist (b. 1922)\n*  2014   – Juanito Remulla, Sr., Filipino lawyer and politician, Governor of Cavite (b. 1933)\n*2015 – Om Prakash Malhotra, Indian general and politician, 25th Governor of Punjab (b. 1922)\n*  2015   – Pavel Srníček, Czech footballer and coach (b. 1968)\n*2016 – Keion Carpenter, American football defensive back (b. 1977)\n*  2016   – LaVell Edwards, American football head coach (b. 1930)\n\nHolidays and observances\n\n* Christian feast day:\n** David, King and prophet (Catholic, Lutheran)\n** Thomas Becket\n** Trophimus of Arles\n** December 29 (Eastern Orthodox liturgics)\n* Constitution Day (Ireland)\n* Independence Day (Mongolia)\n* The fifth day of Christmas (Western Christianity)\n* The fourth day of Kwanzaa (United States). December 29. http://en.wikipedia.org/?curid=8893."
  }
}
