{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18722",
  "eid" : "34881530-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778597379,
  "textBody" : "Lymphedema, also known as lymphoedema and lymphatic edema, is a condition of localized fluid retention and tissue swelling caused by a compromised lymphatic system, which normally returns interstitial fluid to the bloodstream. The condition is most frequently a complication of cancer treatment or parasitic infections, but can also be seen in number of genetic disorders. Though incurable and progressive, a number of treatments can ameliorate symptoms. Tissues with lymphedema are at high risk of infection.\n\nSigns and symptoms\n\nThe most common manifestation of lymphedema is soft tissue swelling, edema. As the disorder progresses, worsening edema and skin changes including discoloration, verrucous (wart-like) hyperplasia, hyperkeratosis, papillomatosis, dermal thickening and ulcers may be seen. Additionally, there is increased risk of infection of the superficial soft tissues, known as cellulitis.\n\nLymphedema should not be confused with edema arising from venous insufficiency, which is caused by compromise of the venous drainage rather than lymphatic drainage. However, untreated venous insufficiency can progress into a combined venous/lymphatic disorder. \n\nPrevalence\n\nLymphedema affects approximately 140 million people worldwide.\n\nCauses\n\nLymphedema may be inherited (primary) or caused by injury to the lymphatic vessels (secondary). It is most frequently seen after lymph node dissection, surgery and/or radiation therapy, in which damage to the lymphatic system is caused during the treatment of cancer, most notably breast cancer. In many patients with cancer, this condition does not develop until months or even years after therapy has concluded. Lymphedema may also be associated with accidents or certain diseases or problems that may inhibit the lymphatic system from functioning properly. In tropical areas of the world, a common cause of secondary lymphedema is filariasis, a parasitic infection. It can also be caused by adamage to the lymphatic system from infections such as cellulitis.\n\nPrimary lymphedema may be inherited or arise sporadically. Multiple syndromes are associated with primary lymphedema, including Turner Syndrome, Milroy Disease, and Klippel-Trenaunay-Weber syndrome. It generally thought to occur as a result of absent or malformed lymph nodes and/or lymphatic channels. Lymphedema may be present at birth, develop at the onset of puberty (praecox), or not become apparent for many years into adulthood (tarda). In men, lower-limb primary lymphedema is most common, occurring in one or both legs. Some cases of lymphedema may be associated with other vascular abnormalities.\n\nSecondary lymphedema affects both men and women. In women, it is most prevalent in the upper limbs after breast cancer surgery, in particular after axillary lymph node dissection, occurring in the arm on the side of the body in which the surgery is performed. Breast and trunk lymphedema can also occur but, go unrecognised as there is swelling in the area after surgery and its symptoms ( peau d' orange and/or an inverted nipple ) can be confused with post surgery fat necrosis.http://www.nhs.uk/ipgmedia/national/Lymphoedema%20Support%20Network/Assets/BreastandTruncalOedemaLSN8pages.pdf In Western countries, secondary lymphedema is most commonly due to cancer treatment. Between 38 and 89% of breast cancer patients suffer from lymphedema due to axillary lymph node dissection and/or radiation. Unilateral lymphedema occurs in up to 41% of patients after gynecologic cancer. For men, a 5-66% incidence of lymphedema has been reported in patients treated with incidence depending on whether staging or radical removal of lymph glands was done in addition to radiotherapy.\n\nHead and neck lymphedema can be caused by surgery or radiation therapy for tongue or throat cancer. It may also occur in the lower limbs or groin after surgery for colon, ovarian or uterine cancer, in which removal of lymph nodes or radiation therapy is required. Surgery or treatment for prostate, colon and testicular cancers may result in secondary lymphedema, particularly when lymph nodes have been removed or damaged.\n\nThe onset of secondary lymphedema in patients who have had cancer surgery has also been linked to aircraft flight (likely due to decreased cabin pressure or relative immobility). For cancer survivors, therefore, wearing a prescribed and properly fitted compression garment may help decrease swelling during air travel.\n\nSome cases of lower-limb lymphedema have been associated with the use of tamoxifen, due to the blood clots and deep vein thrombosis (DVT) that can be associated with this medication. Resolution of the blood clots or DVT is needed before lymphedema treatment can be initiated.\n\nCongenital lymphedema\n\nCongenital lymphedema is swelling that results from abnormalities in the lymphatic system that are present from birth. Swelling may be present in a single affected limb, several limbs, genitalia, or the face. It is sometimes diagnosed prenatally by a nuchal scan or post-natally by lymphoscintigraphy. One hereditary form of congenital lymphedema is called Milroy's disease and is caused by mutations in the VEGFR3 gene.Liem TK, Moneta GL. Chapter 24. Venous and Lymphatic Disease. In: Brunicardi FC, Andersen DK, Billiar TR, Dunn DL, Hunter JG, Matthews JB, Pollock RE, eds. Schwartz's Principles of Surgery. 9th ed. New York: McGraw-Hill; 2010. http://www.accessmedicine.com/content.aspx?aID=5014541. Congenital lymphedema is frequently syndromic and is associated with Turner syndrome, lymphedema–distichiasis syndrome, yellow nail syndrome, and Klippel–Trénaunay–Weber syndrome.Boon LM, Vikkula M. Chapter 172. Vascular Malformations. In: Goldsmith LA, Katz SI, Gilchrest BA, Paller AS, Leffell DJ, Dallas NA, eds. Fitzpatrick's Dermatology in General Medicine. 8th ed. New York: McGraw-Hill; 2012.  \n\nPrimary lymphedema has a quoted incidence of approximately 1-3 births out of every 10,000 births, with a particular female preponderance to male ratio of 3.5:1 In North America, the incidence of primary lymphedema is approximately 1.15 births out of every 100,000 births Compared to secondary lymphedema, primary lymphedema is relatively rare.L. T. Kurland and C. A. Molgaard, “The patient record in epidemiology,” Scientific American, vol. 245, no. 4, pp. 54–63, 1981.\n\nPhysiology\n\nLymph is formed from the fluid that filters out of the blood circulation and contains proteins, cellular debris, bacteria, etc. The collection of this  fluid is carried out by the initial lymph collectors that are blind-ended epithelial-lined vessels with fenestrated openings that allow fluids and particles as large as cells to enter. Once inside the lumen of the lymphatic vessels, the fluid is guided along increasingly larger vessels, first with rudimentary valves to prevent backflow, which later develop into complete valves similar to the venous valve. Once the lymph enters the fully valved lymphatic vessels, it is pumped by a rhythmic peristaltic-like action by smooth muscle cells within the lymphatic vessel walls. This peristaltic action is the primary driving force, moving lymph within its vessel walls. The regulation of the frequency and power of contraction is regulated by the sympathetic nervous system. Lymph movement can be influenced by the pressure of nearby muscle contraction, arterial pulse pressure and the vacuum created in the chest cavity during respiration, but these passive forces contribute only a minor percentage of lymph transport. The fluids collected are pumped into continually larger vessels and through lymph nodes, which remove debris and police the fluid for dangerous microbes. The lymph ends its journey in the thoracic duct or right lymphatic duct, which drain into the blood circulation.\n\nDiagnosis\n\nAccurate diagnosis and staging are fundamental to the management of lymphedema patients. A swollen limb can result from different conditions that require different treatments. Diagnosis of lymphedema is currently based on history, physical exam, limb measurements, and imaging studies such as lymphoscintigraphy and indocyanine green lymphography. However, the ideal method for lymphedema staging to guide the most appropriate treatment is controversial because of several different proposed protocols.Burnand KM, Glass DM, Mortimer PS, Peters AM. Lymphatic dysfunction in the apparently clinically normal contralateral limbs of patients with unilateral lower limb swelling. Clin Nucl Med. 2012;37(1):9-13Tiwari A, Cheng KS, Button M, Myint F, Hamilton G. Differential diagnosis, investigation, and current treatment of lower limb lymphedema. Arch Surg. 2003 Feb;138(2):152-61.\nLymphedema can occur in both the upper and lower extremities, and in some cases, the head and neck. Assessment of the extremities first begins with a visual inspection. Color, presence of hair, visible veins, size and any sores or ulcerations are noted. Lack of hair may indicate an arterial circulation problem. Given swelling, the extremities' circumference is measured for reference as time continues. In early stages of lymphedema, elevating the limb may reduce or eliminate the swelling. Palpation of the wrist or ankle can determine the degree of swelling; assessment includes a check of the pulses. The axillary or inguinal nodes may be enlarged due to the swelling. Enlargement of the nodes lasting more than three weeks may indicate infection or other illnesses such as sequela from breast cancer surgery requiring further medical attention.\n\nDiagnosis or early detection of lymphedema is difficult. The first signs may be subjective observations such as a feeling of heaviness in the affected extremity. These may be symptomatic of early stage of lymphedema where accumulation of lymph is mild and not detectable by changes in volume or circumference. As lymphedema progresses, definitive diagnosis is commonly based upon an objective measurement of differences between the affected or at-risk limb at the opposite unaffected limb, e.g. in volume or circumference. No generally accepted criterion is definitively diagnostic, although a volume difference of 200 ml between limbs or a 4-cm difference (at a single measurement site or set intervals along the limb) is often used. Bioimpedance measurement (which measures the amount of fluid in a limb) offers greater sensitivity than existing methods.\n\nChronic venous stasis changes can mimic early lymphedema, but the changes in venous stasis are more often bilateral and symmetric. Lipedema can also mimic lymphedema, however lipedema characteristically spares the feet beginning abruptly at the medial malleoli (ankle level). As a part of the initial work-up before diagnosing lymphedema, it may be necessary to exclude other potential causes of lower extremity swelling such as renal failure, hypoalbuminemia, congestive heart-failure, protein-losing nephropathy, pulmonary hypertension, obesity, pregnancy and drug-induced edema.Burkhart CN, Adigun C, Burton CS. Chapter 174. Cutaneous Changes in Peripheral Venous and Lymphatic Insufficiency. In: Wolff K, ed. Fitzpatrick's Dermatology in General Medicine. 8th ed. New York: McGraw-Hill; 2012. http://www.accessmedicine.com/content.aspx?aID=56081150. Accessed November 3, 2013.\n\nLymphedema classification\n\nAccording the Fifth WHO Expert Committee on Filariasis , the most common method of classification of lymphedema is as follows: (The same classification method can be used for both primary and secondary lymphedema)\nThe International Society of Lymphology (ISL) Staging System is based solely on subjective symptoms, making it prone to substantial observer bias. Imaging modalities have been suggested as useful adjuncts to the ISL staging to clarify the diagnosis. The lymphedema expert Dr. Ming-Huei Cheng developed a Cheng’s Lymphedema Grading tool to assess the severity of extremity lymphedema based on objective limb measurements and providing appropriate options for management.International Society of Lymphology. The diagnosis and treatment of peripheral lymphedema: 2013 consensus document of the international society of lymphology. Lymphology 2013;46: 1e11.Patel KM, Lin CY, Cheng MH: A prospective evaluation of lymphedema-specific quality-of-life outcomes following vascularized lymph node transfer. Ann Surg Oncol 2015;22:2424-243Principles and Practice of Lymphedema Surgery. Cheng MH, Chang DW, Patel KM (Editors). Elsevier Inc, Oxford, United Kingdom. . July 2015.\n\nI. Grading \n\n* Grade 1: Spontaneously reversible on elevation. Mostly pitting edema.\n* Grade 2: Non-spontaneously reversible on elevation. Mostly non-pitting edema.\n* Grade 3: Gross increase in volume and circumference of Grade 2 lymphedema, with eight stages of severity given below based on clinical assessments.\n\nII. Staging \n\nAs described by the Fifth WHO Expert Committee on Filariasis, and endorsed by the American Society of Lymphology., the staging system helps to identify the severity of lymphedema. With the assistance of medical imaging apparatus, such as MRI or CT, staging can be established by the physician, and therapeutic or medical interventions may be applied:\n* Stage 0: The lymphatic vessels have sustained some damage that is not yet apparent. Transport capacity is sufficient for the amount of lymph being removed. Lymphedema is not present.\n* Stage 1 : Swelling increases during the day and disappears overnight as the patient lies flat in bed. Tissue is still at the pitting stage: when pressed by the fingertips, the affected area indents and reverses with elevation. Usually upon waking in the morning, the limb or affected area is normal or almost normal in size. Treatment is not necessarily required at this point. \n* Stage 2: Swelling is not reversible overnight, and does not disappear without proper management. The tissue now has a spongy consistency and is considered non-pitting: when pressed by the fingertips, the affected area bounces back without indentation. Fibrosis found in Stage 2 lymphedema marks the beginning of the hardening of the limbs and increasing size.\n* Stage 3: Swelling is irreversible and usually the limb(s) or affected area become increasingly large. The tissue is hard (fibrotic) and unresponsive; some patients consider undergoing reconstructive surgery, called \"debulking\". This remains controversial, however, since the risks may outweigh the benefits and the further damage done to the lymphatic system may in fact make the lymphedema worse.\n* Stage 4: The size and circumference of the affected limb(s) become noticeably large. Bumps, lumps, or protusions (also called knobs) on the skin begin to appear.\n* Stage 5: The affected limb become grossly large; one or more deep skin folds is prevalent among patients in this stage.\n* Stage 6: Knobs of small elongated or small rounded sizes cluster together, giving mossy-like shapes on the limb. Mobility of the patient become increasingly difficult.\n* Stage 7: The patient become handicapped, and is unable to perform daily routine activities such as walking, bathing, and cooking, independently. Assistance from the family and health care system is needed.\nPresented below are upper and lower extremity lymphedema between stages 1 to 4:\nFile:Upper limb lymphedema.jpg|Severity of upper extremity lymphedema in different stages\nFile:Lower Limb Lymphedema.png|Severity of lower extremity lymphedema in different stages\n\nOther classification methods \n\nGrades\n\nLymphedema can also be categorized by its severity (usually referenced to a healthy extremity):\n* Grade 1 (mild edema): Involves the distal parts such as a forearm and hand or a lower leg and foot. The difference in circumference is less than 4 cm and other tissue changes are not yet present.\n* Grade 2 (moderate edema): Involves an entire limb or corresponding quadrant of the trunk. Difference in circumference is 4–6 cm. Tissue changes, such as pitting, are apparent. The patient may experience erysipelas.\n* Grade 3a (severe edema): Lymphedema is present in one limb and its associated trunk quadrant. Circumferential difference is greater than 6 centimeters. Significant skin alterations, such as cornification or keratosis, cysts and/or fistulae, are present. Additionally, the patient may experience repeated attacks of erysipelas.\n* Grade 3b (massive edema): The same symptoms as grade 3a, except that two or more extremities are affected.\n* Grade 4 (gigantic edema): In this stage of lymphedema, the affected extremities are huge, due to almost complete blockage of the lymph channels.\n\nTreatment\n\nTreatment varies depending on edema severity and the degree of fibrosis. Most people with lymphedema follow a daily regimen of treatment. The most common treatments are a combination of manual compression lymphatic massage, compression garments or bandaging. Complex decongestive physiotherapy is an empiric system of lymphatic massage, skin care and compressive garments. Although a combination treatment program may be ideal, any of the treatments can be done individually.\n\nComplete decongestive therapy\n\nCDT is a primary tool in lymphedema management. It consists of manual manipulation of the lymphatic ducts,http://www.lymphnet.org/pdfDocs/nlntreatment.pdf short-stretch compression bandaging, therapeutic exercise and skin care. The technique was pioneered by Emil Vodder in the 1930s for the treatment of chronic sinusitis and other immune disorders. Initially, CDT involves frequent visits to a therapist. Once the lymphedema is reduced, increased patient participation is required for ongoing care, along with the use of elastic compression garments and nonelastic directional flow foam garments.\n\nManual manipulation of the lymphatic ducts (manual lymphatic drainage or MLD) consists of gentle, rhythmic massage to stimulate lymph flow and its return to the blood circulation system. The treatment is gentle. A typical session involves drainage of the neck, trunk and involved extremity (in that order), lasting approximately 40 to 60 minutes. CDT is generally effective on nonfibrotic lymphedema and less effective on more fibrotic legs, although it helps break up fibrotic tissue.\n\nCompression\n\nGarments\n\nElastic compression garments are worn on the affected limb following complete decongestive therapy to maintain edema reduction. Inelastic garments provide containment and reduction.\n\nBandaging\n\nCompression bandaging, also called wrapping, is the application of layers of padding and short-stretch bandages to the involved areas. Short-stretch bandages are preferred over long-stretch bandages (such as those normally used to treat sprains), as the long-stretch bandages cannot produce the proper therapeutic tension necessary to safely reduce lymphedema and may in fact end up producing a tourniquet effect. During activity, whether exercise or daily activities, the short-stretch bandages enhance the pumping action of the lymph vessels by providing increased resistance. This encourages lymphatic flow and helps to soften fluid-swollen areas.\n\nA 2002 study showed patients receiving the combined modalities of manual lymphatic drainage (MLD) with complete decongestive therapy (CDT) and pneumatic pumping had a greater overall reduction in limb volume than patients receiving only MLD/CDT.\n\nIntermittent pneumatic compression therapy\n\nIntermittent pneumatic compression therapy (IPC) utilizes a multi-chambered pneumatic sleeve with overlapping cells to promote movement of lymph fluid. Pump therapy should be used in addition to other treatments such as compression bandaging and manual lymph drainage. In some cases, pump therapy helps soften fibrotic tissue and therefore potentially enable more efficient lymphatic drainage. However, reports link pump therapy to increased incidence of edema proximal to the affected limb, such as genital edema arising after pump therapy in the lower limb. IPC should be used in combination with complete decongestive therapy.\n\nExercise\n\nMost studies investigating the effects exercise in patients with lymphedema or at risk of developing lymphedema examined patients with breast-cancer-related lymphedema. In these studies, resistance training did not increase swelling in patients with pre-existing lymphedema and decreases edema in some patients, in addition to other potential beneficial effects on cardiovascular health. Moreover, resistance training and other forms of exercise were not associated with an increased risk of developing lymphedema in patients who previously received breast cancer-related treatment. Compression garments should be worn during exercise (with the possible exception of swimming in some patients). Patients who have or risk lymphedema should consult their physician or certified lymphedema therapist before beginning an exercise regimen. Resistance training is not recommended in the immediate post-operative period in patients who have undergone axillary lymph node dissection for breast cancer.\n\nFew studies examine the effects of exercise in primary lymphedema or in secondary lymphedema that is not related to breast cancer treatment.\n\nSurgery \n\nSeveral surgical procedures provide long-term solutions for patients who suffer from lymphedema. Prior to surgery, patients typically are treated by a physical or occupational therapist, trained in providing lymphedema treatment for initial conservative treatment of their lymphedema. CDT, MLD and compression bandaging are all helpful components of conservative lymphedema treatment.\n\nVascularized lymph node transfer \n\nVascularized lymph node transfers (VLNT) can be an effective treatment of the arm and upper extremity. Lymph nodes are harvested from the groin area or the supraclavicular area  with their supporting artery and vein and moved to the axilla (armpit) or the wrist area. Microsurgery techniques connect the artery and vein to blood vessels in the axilla to provide support to the lymph nodes while they develop their own blood supply over the first few weeks after surgery.\n\nThe newly transferred lymph nodes then serve as a conduit or filter to remove the excess lymphatic fluid from the arm and return it to the body's natural circulation.\n\nThis technique of lymph node transfer may be performed together with a DIEP flap breast reconstruction. This allows for both the simultaneous treatment of the arm lymphedema and the creation of a breast in one surgery. The lymph node transfer removes the excess lymphatic fluid to return form and function to the arm. In selected cases, the lymph nodes may be transferred as a group with their supporting artery and vein, but without the associated abdominal tissue for breast reconstruction.\n\nLymph node transfers are most effective in patients whose extremity circumference reduces significantly with compression wrapping, indicating most of the edema is fluid.\n\nVLNT significantly improves the fluid component of lymphedema and decrease the amount of lymphedema therapy and compression garment use required.\n\nLymphaticovenous anastomosis \n\nLymphaticovenous anastomosis (LVA) uses supermicrosurgery to connect the affected lymphatic channels directly to tiny veins located nearby. The lymphatics are tiny, typically 0.1 mm to 0.8 mm in diameter. The procedure requires the use of specialized techniques with superfine surgical suture and an adapted, high-power microscope.\n\nLVA can be an effective and long-term solution for extremity lymphedema and many patients have results that range from a moderate improvement to an almost complete resolution. LVA is most effective early in the course of the disease in patients whose extremity circumference reduces significantly with compression wrapping, indicating most of the edema is fluid. Patients who do not respond to compression are less likely to fare well with LVA, as a greater amount of their increased extremity volume consists of fibrotic tissue, protein or fat. Multiple studies showed LVAs to be effective.Granzow JW, Soderberg JM, Dauphine C.  A Novel Two-Stage Surgical Approach to Treat Chronic Lymphedema.  Breast J. 2014 Jun 19.\n\nLymphaticovenous anastomosis was introduced by B. M. O'Brien and colleagues for the treatment of obstructive lymphedema in the extremities. In 2003, supermicrosurgery pioneer Isao Koshima and colleagues improved the surgery with supermicrosurgical techniques and established the new standard in reconstructive microsurgery. Studies involving long-term follow-up after LVA for lymphedema indicated patients showed remarkable improvement compared to conservative treatment using continuous elastic stocking and occasional pumping.\n\nClinical studies involving LVA indicate immediate and long-term results showed significant reductions in volume and improvement in systems that appear to be long-lasting. A 2006 study compared two groups of breast cancer patients at high risk for lymphedema in whom LVA was used to prevent the onset of clinically evident lymphedema. Results showed a statistically significant reduction in the number of patients who went on to develop clinically significant lymphedema. Other studies showed LVA surgeries reduce the severity of lymphedema in breast cancer patients. In particular, a clinical study of 1,000 cases of lymphedema treated with microsurgery from 1973 to 2006 showed beneficial results. Clinical reports from microsurgeons and physical therapists documented more than 1,500 patients treated with LVA surgery over a span of 30 years showing significant improvement and effectiveness.\n\nIndocyanine green fluoroscopy is a safe, minimally invasive and useful tool for surgical evaluation. Microsurgeons use indocyanine green lymphography to assist in LVA surgeries.\n\nSuction assisted lipectomy\n\nPeople whose limbs no longer adequately respond to compression therapy may be candidates for suction assisted lipectomy (SAL). This procedure has been called liposuction for lymphedema and is specifically adapted to treat this advanced condition. SAL employs a different operative technique and requires significant therapy and compression garment care that must be administered by a therapist experienced in the technique.\n\nThis procedure was pioneered by Hakan Brorson in 1987. Well-controlled clinical trials conducted from 1993 to 2014 showed SAL, combined with controlled compression therapy (CCT), to be an effective lymphedema treatment without recurrence. Long-term followup (11–13 years) of patients with lymphedema showed no recurrence of swelling. Lymphatic liposuction combined with controlled compression therapy was more effective than controlled compression therapy alone.\n\nSAL has been refined in recent years by using vibrating cannulae that are finer and more effective than previous equipment. In addition, the introduction of the tourniquet and tumescent technique led to minimized blood loss.\n\nSAL uses specialized techniques that differ from conventional liposuction procedures and requires specific training.\n\nLymphatic vessel grafting \n\nWith advanced microsurgical techniques, lymph vessels can be used as grafts. A locally interrupted or obstructed lymphatic pathway, mostly after resection of lymph nodes, can be reconstructed via a bypass using lymphatic vessels. These vessels are specialized to drain lymph by active pumping forces. These grafts are connected with main lymphatic collectors in front and behind the obstruction. The technique is mostly used in arm edemas after treatment of breast cancer and in unilateral edemas of lower extremities after resection of lymph nodes and radiation. The procedure is less widely used than the other surgical procedures, mainly in Germany. The method was developed in 1980 by Ruediger Baumeister.\n\nThe method is proven effective. Follow-up studies showed significant volume reduction of the extremities even 10 years after surgery. The patients, who had been previously treated with both MLD and compression therapy, gained significant improvement in quality of life after being treated with lymphatic vessel grafting. Lymphoscintigraphic investigations showed a lasting enhancement of lymphatic transport after grafting.\n\nThe patency of lymphatic grafts was demonstrated after more than 12 years, using indirect lymphography and MRI lymphography.\n\nLow level laser therapy\n\nLow-level laser therapy (LLLT) was cleared by the US Food and Drug Administration (FDA) for the treatment of lymphedema in November 2006.[http://www.dotmed.com/news/story/3067/ dotmed.com December 27, 2006] Low Level Laser FDA Cleared for the Treatment of Lymphedema. (accessed 9 November 09)\n\nAccording to the US National Cancer Institute,\n\nStudies suggest that low-level laser therapy may be effective in reducing lymphedema in a clinically meaningful way for some women. Two cycles of laser treatment were found to be effective in reducing the volume of the affected arm, extracellular fluid, and tissue hardness in approximately one-third of patients with postmastectomy lymphedema at 3 months post-treatment. Suggested rationales for laser therapy include a potential decrease in fibrosis, stimulation of macrophages and the immune system, and a possible role in encouraging lymphangiogenesis.[http://www.cancer.gov/cancertopics/pdq/supportivecare/lymphedema/HealthProfessional/page3#Section_68 National Cancer Institute: Low-level laser therapy] accessed 9 November 09\n\nComplications\n\nWhen the lymphatic impairment becomes so great that the lymph fluid exceeds the lymphatic system's ability to transport it, an abnormal amount of protein-rich fluid collects in the tissues. Left untreated, this stagnant, protein-rich fluid causes tissue channels to increase in size and number, reducing oxygen availability. This interferes with wound healing and provides a rich culture medium for bacterial growth that can result in infections: cellulitis, lymphangitis, lymphadenitis and in severe cases, skin ulcers. It is vital for lymphedema patients to be aware of the symptoms of infection and to seek immediate treatment, since recurrent infections or cellulitis, in addition to their inherent danger, further damage the lymphatic system and set up a vicious circle.\n\nIn rare cases, lymphedema can lead to a form of cancer called lymphangiosarcoma, although the mechanism of carcinogenesis is not understood. Lymphedema-associated lymphangiosarcoma is called Stewart-Treves syndrome. Lymphangiosarcoma most frequently occurs in cases of long-standing lymphedema. The incidence of angiosarcoma is estimated to be 0.45% in patients living 5 years after radical mastectomy. Lymphedema is also associated with a low grade form of cancer called retiform hemangioendothelioma (a low grade angiosarcoma).\n\nSince lymphedema is disfiguring, causing difficulties in daily living and can lead to lifestyle becoming severely limited, it may also result in psychological distress.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lymphedema" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18722" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Lymphedema, also known as lymphoedema and lymphatic edema, is a condition of localized fluid retention and tissue swelling caused by a compromised lymphatic system, which normally returns interstitial fluid to the bloodstream. The condition is most frequently a complication of cancer treatment or parasitic infections, but can also be seen in number of genetic disorders. Though incurable and progressive, a number of treatments can ameliorate symptoms. Tissues with lymphedema are at high risk of infection.\n\nSigns and symptoms\n\nThe most common manifestation of lymphedema is soft tissue swelling, edema. As the disorder progresses, worsening edema and skin changes including discoloration, verrucous (wart-like) hyperplasia, hyperkeratosis, papillomatosis, dermal thickening and ulcers may be seen. Additionally, there is increased risk of infection of the superficial soft tissues, known as cellulitis.\n\nLymphedema should not be confused with edema arising from venous insufficiency, which is caused by compromise of the venous drainage rather than lymphatic drainage. However, untreated venous insufficiency can progress into a combined venous/lymphatic disorder. \n\nPrevalence\n\nLymphedema affects approximately 140 million people worldwide.\n\nCauses\n\nLymphedema may be inherited (primary) or caused by injury to the lymphatic vessels (secondary). It is most frequently seen after lymph node dissection, surgery and/or radiation therapy, in which damage to the lymphatic system is caused during the treatment of cancer, most notably breast cancer. In many patients with cancer, this condition does not develop until months or even years after therapy has concluded. Lymphedema may also be associated with accidents or certain diseases or problems that may inhibit the lymphatic system from functioning properly. In tropical areas of the world, a common cause of secondary lymphedema is filariasis, a parasitic infection. It can also be caused by adamage to the lymphatic system from infections such as cellulitis.\n\nPrimary lymphedema may be inherited or arise sporadically. Multiple syndromes are associated with primary lymphedema, including Turner Syndrome, Milroy Disease, and Klippel-Trenaunay-Weber syndrome. It generally thought to occur as a result of absent or malformed lymph nodes and/or lymphatic channels. Lymphedema may be present at birth, develop at the onset of puberty (praecox), or not become apparent for many years into adulthood (tarda). In men, lower-limb primary lymphedema is most common, occurring in one or both legs. Some cases of lymphedema may be associated with other vascular abnormalities.\n\nSecondary lymphedema affects both men and women. In women, it is most prevalent in the upper limbs after breast cancer surgery, in particular after axillary lymph node dissection, occurring in the arm on the side of the body in which the surgery is performed. Breast and trunk lymphedema can also occur but, go unrecognised as there is swelling in the area after surgery and its symptoms ( peau d' orange and/or an inverted nipple ) can be confused with post surgery fat necrosis.http://www.nhs.uk/ipgmedia/national/Lymphoedema%20Support%20Network/Assets/BreastandTruncalOedemaLSN8pages.pdf In Western countries, secondary lymphedema is most commonly due to cancer treatment. Between 38 and 89% of breast cancer patients suffer from lymphedema due to axillary lymph node dissection and/or radiation. Unilateral lymphedema occurs in up to 41% of patients after gynecologic cancer. For men, a 5-66% incidence of lymphedema has been reported in patients treated with incidence depending on whether staging or radical removal of lymph glands was done in addition to radiotherapy.\n\nHead and neck lymphedema can be caused by surgery or radiation therapy for tongue or throat cancer. It may also occur in the lower limbs or groin after surgery for colon, ovarian or uterine cancer, in which removal of lymph nodes or radiation therapy is required. Surgery or treatment for prostate, colon and testicular cancers may result in secondary lymphedema, particularly when lymph nodes have been removed or damaged.\n\nThe onset of secondary lymphedema in patients who have had cancer surgery has also been linked to aircraft flight (likely due to decreased cabin pressure or relative immobility). For cancer survivors, therefore, wearing a prescribed and properly fitted compression garment may help decrease swelling during air travel.\n\nSome cases of lower-limb lymphedema have been associated with the use of tamoxifen, due to the blood clots and deep vein thrombosis (DVT) that can be associated with this medication. Resolution of the blood clots or DVT is needed before lymphedema treatment can be initiated.\n\nCongenital lymphedema\n\nCongenital lymphedema is swelling that results from abnormalities in the lymphatic system that are present from birth. Swelling may be present in a single affected limb, several limbs, genitalia, or the face. It is sometimes diagnosed prenatally by a nuchal scan or post-natally by lymphoscintigraphy. One hereditary form of congenital lymphedema is called Milroy's disease and is caused by mutations in the VEGFR3 gene.Liem TK, Moneta GL. Chapter 24. Venous and Lymphatic Disease. In: Brunicardi FC, Andersen DK, Billiar TR, Dunn DL, Hunter JG, Matthews JB, Pollock RE, eds. Schwartz's Principles of Surgery. 9th ed. New York: McGraw-Hill; 2010. http://www.accessmedicine.com/content.aspx?aID=5014541. Congenital lymphedema is frequently syndromic and is associated with Turner syndrome, lymphedema–distichiasis syndrome, yellow nail syndrome, and Klippel–Trénaunay–Weber syndrome.Boon LM, Vikkula M. Chapter 172. Vascular Malformations. In: Goldsmith LA, Katz SI, Gilchrest BA, Paller AS, Leffell DJ, Dallas NA, eds. Fitzpatrick's Dermatology in General Medicine. 8th ed. New York: McGraw-Hill; 2012.  \n\nPrimary lymphedema has a quoted incidence of approximately 1-3 births out of every 10,000 births, with a particular female preponderance to male ratio of 3.5:1 In North America, the incidence of primary lymphedema is approximately 1.15 births out of every 100,000 births Compared to secondary lymphedema, primary lymphedema is relatively rare.L. T. Kurland and C. A. Molgaard, “The patient record in epidemiology,” Scientific American, vol. 245, no. 4, pp. 54–63, 1981.\n\nPhysiology\n\nLymph is formed from the fluid that filters out of the blood circulation and contains proteins, cellular debris, bacteria, etc. The collection of this  fluid is carried out by the initial lymph collectors that are blind-ended epithelial-lined vessels with fenestrated openings that allow fluids and particles as large as cells to enter. Once inside the lumen of the lymphatic vessels, the fluid is guided along increasingly larger vessels, first with rudimentary valves to prevent backflow, which later develop into complete valves similar to the venous valve. Once the lymph enters the fully valved lymphatic vessels, it is pumped by a rhythmic peristaltic-like action by smooth muscle cells within the lymphatic vessel walls. This peristaltic action is the primary driving force, moving lymph within its vessel walls. The regulation of the frequency and power of contraction is regulated by the sympathetic nervous system. Lymph movement can be influenced by the pressure of nearby muscle contraction, arterial pulse pressure and the vacuum created in the chest cavity during respiration, but these passive forces contribute only a minor percentage of lymph transport. The fluids collected are pumped into continually larger vessels and through lymph nodes, which remove debris and police the fluid for dangerous microbes. The lymph ends its journey in the thoracic duct or right lymphatic duct, which drain into the blood circulation.\n\nDiagnosis\n\nAccurate diagnosis and staging are fundamental to the management of lymphedema patients. A swollen limb can result from different conditions that require different treatments. Diagnosis of lymphedema is currently based on history, physical exam, limb measurements, and imaging studies such as lymphoscintigraphy and indocyanine green lymphography. However, the ideal method for lymphedema staging to guide the most appropriate treatment is controversial because of several different proposed protocols.Burnand KM, Glass DM, Mortimer PS, Peters AM. Lymphatic dysfunction in the apparently clinically normal contralateral limbs of patients with unilateral lower limb swelling. Clin Nucl Med. 2012;37(1):9-13Tiwari A, Cheng KS, Button M, Myint F, Hamilton G. Differential diagnosis, investigation, and current treatment of lower limb lymphedema. Arch Surg. 2003 Feb;138(2):152-61.\nLymphedema can occur in both the upper and lower extremities, and in some cases, the head and neck. Assessment of the extremities first begins with a visual inspection. Color, presence of hair, visible veins, size and any sores or ulcerations are noted. Lack of hair may indicate an arterial circulation problem. Given swelling, the extremities' circumference is measured for reference as time continues. In early stages of lymphedema, elevating the limb may reduce or eliminate the swelling. Palpation of the wrist or ankle can determine the degree of swelling; assessment includes a check of the pulses. The axillary or inguinal nodes may be enlarged due to the swelling. Enlargement of the nodes lasting more than three weeks may indicate infection or other illnesses such as sequela from breast cancer surgery requiring further medical attention.\n\nDiagnosis or early detection of lymphedema is difficult. The first signs may be subjective observations such as a feeling of heaviness in the affected extremity. These may be symptomatic of early stage of lymphedema where accumulation of lymph is mild and not detectable by changes in volume or circumference. As lymphedema progresses, definitive diagnosis is commonly based upon an objective measurement of differences between the affected or at-risk limb at the opposite unaffected limb, e.g. in volume or circumference. No generally accepted criterion is definitively diagnostic, although a volume difference of 200 ml between limbs or a 4-cm difference (at a single measurement site or set intervals along the limb) is often used. Bioimpedance measurement (which measures the amount of fluid in a limb) offers greater sensitivity than existing methods.\n\nChronic venous stasis changes can mimic early lymphedema, but the changes in venous stasis are more often bilateral and symmetric. Lipedema can also mimic lymphedema, however lipedema characteristically spares the feet beginning abruptly at the medial malleoli (ankle level). As a part of the initial work-up before diagnosing lymphedema, it may be necessary to exclude other potential causes of lower extremity swelling such as renal failure, hypoalbuminemia, congestive heart-failure, protein-losing nephropathy, pulmonary hypertension, obesity, pregnancy and drug-induced edema.Burkhart CN, Adigun C, Burton CS. Chapter 174. Cutaneous Changes in Peripheral Venous and Lymphatic Insufficiency. In: Wolff K, ed. Fitzpatrick's Dermatology in General Medicine. 8th ed. New York: McGraw-Hill; 2012. http://www.accessmedicine.com/content.aspx?aID=56081150. Accessed November 3, 2013.\n\nLymphedema classification\n\nAccording the Fifth WHO Expert Committee on Filariasis , the most common method of classification of lymphedema is as follows: (The same classification method can be used for both primary and secondary lymphedema)\nThe International Society of Lymphology (ISL) Staging System is based solely on subjective symptoms, making it prone to substantial observer bias. Imaging modalities have been suggested as useful adjuncts to the ISL staging to clarify the diagnosis. The lymphedema expert Dr. Ming-Huei Cheng developed a Cheng’s Lymphedema Grading tool to assess the severity of extremity lymphedema based on objective limb measurements and providing appropriate options for management.International Society of Lymphology. The diagnosis and treatment of peripheral lymphedema: 2013 consensus document of the international society of lymphology. Lymphology 2013;46: 1e11.Patel KM, Lin CY, Cheng MH: A prospective evaluation of lymphedema-specific quality-of-life outcomes following vascularized lymph node transfer. Ann Surg Oncol 2015;22:2424-243Principles and Practice of Lymphedema Surgery. Cheng MH, Chang DW, Patel KM (Editors). Elsevier Inc, Oxford, United Kingdom. . July 2015.\n\nI. Grading \n\n* Grade 1: Spontaneously reversible on elevation. Mostly pitting edema.\n* Grade 2: Non-spontaneously reversible on elevation. Mostly non-pitting edema.\n* Grade 3: Gross increase in volume and circumference of Grade 2 lymphedema, with eight stages of severity given below based on clinical assessments.\n\nII. Staging \n\nAs described by the Fifth WHO Expert Committee on Filariasis, and endorsed by the American Society of Lymphology., the staging system helps to identify the severity of lymphedema. With the assistance of medical imaging apparatus, such as MRI or CT, staging can be established by the physician, and therapeutic or medical interventions may be applied:\n* Stage 0: The lymphatic vessels have sustained some damage that is not yet apparent. Transport capacity is sufficient for the amount of lymph being removed. Lymphedema is not present.\n* Stage 1 : Swelling increases during the day and disappears overnight as the patient lies flat in bed. Tissue is still at the pitting stage: when pressed by the fingertips, the affected area indents and reverses with elevation. Usually upon waking in the morning, the limb or affected area is normal or almost normal in size. Treatment is not necessarily required at this point. \n* Stage 2: Swelling is not reversible overnight, and does not disappear without proper management. The tissue now has a spongy consistency and is considered non-pitting: when pressed by the fingertips, the affected area bounces back without indentation. Fibrosis found in Stage 2 lymphedema marks the beginning of the hardening of the limbs and increasing size.\n* Stage 3: Swelling is irreversible and usually the limb(s) or affected area become increasingly large. The tissue is hard (fibrotic) and unresponsive; some patients consider undergoing reconstructive surgery, called \"debulking\". This remains controversial, however, since the risks may outweigh the benefits and the further damage done to the lymphatic system may in fact make the lymphedema worse.\n* Stage 4: The size and circumference of the affected limb(s) become noticeably large. Bumps, lumps, or protusions (also called knobs) on the skin begin to appear.\n* Stage 5: The affected limb become grossly large; one or more deep skin folds is prevalent among patients in this stage.\n* Stage 6: Knobs of small elongated or small rounded sizes cluster together, giving mossy-like shapes on the limb. Mobility of the patient become increasingly difficult.\n* Stage 7: The patient become handicapped, and is unable to perform daily routine activities such as walking, bathing, and cooking, independently. Assistance from the family and health care system is needed.\nPresented below are upper and lower extremity lymphedema between stages 1 to 4:\nFile:Upper limb lymphedema.jpg|Severity of upper extremity lymphedema in different stages\nFile:Lower Limb Lymphedema.png|Severity of lower extremity lymphedema in different stages\n\nOther classification methods \n\nGrades\n\nLymphedema can also be categorized by its severity (usually referenced to a healthy extremity):\n* Grade 1 (mild edema): Involves the distal parts such as a forearm and hand or a lower leg and foot. The difference in circumference is less than 4 cm and other tissue changes are not yet present.\n* Grade 2 (moderate edema): Involves an entire limb or corresponding quadrant of the trunk. Difference in circumference is 4–6 cm. Tissue changes, such as pitting, are apparent. The patient may experience erysipelas.\n* Grade 3a (severe edema): Lymphedema is present in one limb and its associated trunk quadrant. Circumferential difference is greater than 6 centimeters. Significant skin alterations, such as cornification or keratosis, cysts and/or fistulae, are present. Additionally, the patient may experience repeated attacks of erysipelas.\n* Grade 3b (massive edema): The same symptoms as grade 3a, except that two or more extremities are affected.\n* Grade 4 (gigantic edema): In this stage of lymphedema, the affected extremities are huge, due to almost complete blockage of the lymph channels.\n\nTreatment\n\nTreatment varies depending on edema severity and the degree of fibrosis. Most people with lymphedema follow a daily regimen of treatment. The most common treatments are a combination of manual compression lymphatic massage, compression garments or bandaging. Complex decongestive physiotherapy is an empiric system of lymphatic massage, skin care and compressive garments. Although a combination treatment program may be ideal, any of the treatments can be done individually.\n\nComplete decongestive therapy\n\nCDT is a primary tool in lymphedema management. It consists of manual manipulation of the lymphatic ducts,http://www.lymphnet.org/pdfDocs/nlntreatment.pdf short-stretch compression bandaging, therapeutic exercise and skin care. The technique was pioneered by Emil Vodder in the 1930s for the treatment of chronic sinusitis and other immune disorders. Initially, CDT involves frequent visits to a therapist. Once the lymphedema is reduced, increased patient participation is required for ongoing care, along with the use of elastic compression garments and nonelastic directional flow foam garments.\n\nManual manipulation of the lymphatic ducts (manual lymphatic drainage or MLD) consists of gentle, rhythmic massage to stimulate lymph flow and its return to the blood circulation system. The treatment is gentle. A typical session involves drainage of the neck, trunk and involved extremity (in that order), lasting approximately 40 to 60 minutes. CDT is generally effective on nonfibrotic lymphedema and less effective on more fibrotic legs, although it helps break up fibrotic tissue.\n\nCompression\n\nGarments\n\nElastic compression garments are worn on the affected limb following complete decongestive therapy to maintain edema reduction. Inelastic garments provide containment and reduction.\n\nBandaging\n\nCompression bandaging, also called wrapping, is the application of layers of padding and short-stretch bandages to the involved areas. Short-stretch bandages are preferred over long-stretch bandages (such as those normally used to treat sprains), as the long-stretch bandages cannot produce the proper therapeutic tension necessary to safely reduce lymphedema and may in fact end up producing a tourniquet effect. During activity, whether exercise or daily activities, the short-stretch bandages enhance the pumping action of the lymph vessels by providing increased resistance. This encourages lymphatic flow and helps to soften fluid-swollen areas.\n\nA 2002 study showed patients receiving the combined modalities of manual lymphatic drainage (MLD) with complete decongestive therapy (CDT) and pneumatic pumping had a greater overall reduction in limb volume than patients receiving only MLD/CDT.\n\nIntermittent pneumatic compression therapy\n\nIntermittent pneumatic compression therapy (IPC) utilizes a multi-chambered pneumatic sleeve with overlapping cells to promote movement of lymph fluid. Pump therapy should be used in addition to other treatments such as compression bandaging and manual lymph drainage. In some cases, pump therapy helps soften fibrotic tissue and therefore potentially enable more efficient lymphatic drainage. However, reports link pump therapy to increased incidence of edema proximal to the affected limb, such as genital edema arising after pump therapy in the lower limb. IPC should be used in combination with complete decongestive therapy.\n\nExercise\n\nMost studies investigating the effects exercise in patients with lymphedema or at risk of developing lymphedema examined patients with breast-cancer-related lymphedema. In these studies, resistance training did not increase swelling in patients with pre-existing lymphedema and decreases edema in some patients, in addition to other potential beneficial effects on cardiovascular health. Moreover, resistance training and other forms of exercise were not associated with an increased risk of developing lymphedema in patients who previously received breast cancer-related treatment. Compression garments should be worn during exercise (with the possible exception of swimming in some patients). Patients who have or risk lymphedema should consult their physician or certified lymphedema therapist before beginning an exercise regimen. Resistance training is not recommended in the immediate post-operative period in patients who have undergone axillary lymph node dissection for breast cancer.\n\nFew studies examine the effects of exercise in primary lymphedema or in secondary lymphedema that is not related to breast cancer treatment.\n\nSurgery \n\nSeveral surgical procedures provide long-term solutions for patients who suffer from lymphedema. Prior to surgery, patients typically are treated by a physical or occupational therapist, trained in providing lymphedema treatment for initial conservative treatment of their lymphedema. CDT, MLD and compression bandaging are all helpful components of conservative lymphedema treatment.\n\nVascularized lymph node transfer \n\nVascularized lymph node transfers (VLNT) can be an effective treatment of the arm and upper extremity. Lymph nodes are harvested from the groin area or the supraclavicular area  with their supporting artery and vein and moved to the axilla (armpit) or the wrist area. Microsurgery techniques connect the artery and vein to blood vessels in the axilla to provide support to the lymph nodes while they develop their own blood supply over the first few weeks after surgery.\n\nThe newly transferred lymph nodes then serve as a conduit or filter to remove the excess lymphatic fluid from the arm and return it to the body's natural circulation.\n\nThis technique of lymph node transfer may be performed together with a DIEP flap breast reconstruction. This allows for both the simultaneous treatment of the arm lymphedema and the creation of a breast in one surgery. The lymph node transfer removes the excess lymphatic fluid to return form and function to the arm. In selected cases, the lymph nodes may be transferred as a group with their supporting artery and vein, but without the associated abdominal tissue for breast reconstruction.\n\nLymph node transfers are most effective in patients whose extremity circumference reduces significantly with compression wrapping, indicating most of the edema is fluid.\n\nVLNT significantly improves the fluid component of lymphedema and decrease the amount of lymphedema therapy and compression garment use required.\n\nLymphaticovenous anastomosis \n\nLymphaticovenous anastomosis (LVA) uses supermicrosurgery to connect the affected lymphatic channels directly to tiny veins located nearby. The lymphatics are tiny, typically 0.1 mm to 0.8 mm in diameter. The procedure requires the use of specialized techniques with superfine surgical suture and an adapted, high-power microscope.\n\nLVA can be an effective and long-term solution for extremity lymphedema and many patients have results that range from a moderate improvement to an almost complete resolution. LVA is most effective early in the course of the disease in patients whose extremity circumference reduces significantly with compression wrapping, indicating most of the edema is fluid. Patients who do not respond to compression are less likely to fare well with LVA, as a greater amount of their increased extremity volume consists of fibrotic tissue, protein or fat. Multiple studies showed LVAs to be effective.Granzow JW, Soderberg JM, Dauphine C.  A Novel Two-Stage Surgical Approach to Treat Chronic Lymphedema.  Breast J. 2014 Jun 19.\n\nLymphaticovenous anastomosis was introduced by B. M. O'Brien and colleagues for the treatment of obstructive lymphedema in the extremities. In 2003, supermicrosurgery pioneer Isao Koshima and colleagues improved the surgery with supermicrosurgical techniques and established the new standard in reconstructive microsurgery. Studies involving long-term follow-up after LVA for lymphedema indicated patients showed remarkable improvement compared to conservative treatment using continuous elastic stocking and occasional pumping.\n\nClinical studies involving LVA indicate immediate and long-term results showed significant reductions in volume and improvement in systems that appear to be long-lasting. A 2006 study compared two groups of breast cancer patients at high risk for lymphedema in whom LVA was used to prevent the onset of clinically evident lymphedema. Results showed a statistically significant reduction in the number of patients who went on to develop clinically significant lymphedema. Other studies showed LVA surgeries reduce the severity of lymphedema in breast cancer patients. In particular, a clinical study of 1,000 cases of lymphedema treated with microsurgery from 1973 to 2006 showed beneficial results. Clinical reports from microsurgeons and physical therapists documented more than 1,500 patients treated with LVA surgery over a span of 30 years showing significant improvement and effectiveness.\n\nIndocyanine green fluoroscopy is a safe, minimally invasive and useful tool for surgical evaluation. Microsurgeons use indocyanine green lymphography to assist in LVA surgeries.\n\nSuction assisted lipectomy\n\nPeople whose limbs no longer adequately respond to compression therapy may be candidates for suction assisted lipectomy (SAL). This procedure has been called liposuction for lymphedema and is specifically adapted to treat this advanced condition. SAL employs a different operative technique and requires significant therapy and compression garment care that must be administered by a therapist experienced in the technique.\n\nThis procedure was pioneered by Hakan Brorson in 1987. Well-controlled clinical trials conducted from 1993 to 2014 showed SAL, combined with controlled compression therapy (CCT), to be an effective lymphedema treatment without recurrence. Long-term followup (11–13 years) of patients with lymphedema showed no recurrence of swelling. Lymphatic liposuction combined with controlled compression therapy was more effective than controlled compression therapy alone.\n\nSAL has been refined in recent years by using vibrating cannulae that are finer and more effective than previous equipment. In addition, the introduction of the tourniquet and tumescent technique led to minimized blood loss.\n\nSAL uses specialized techniques that differ from conventional liposuction procedures and requires specific training.\n\nLymphatic vessel grafting \n\nWith advanced microsurgical techniques, lymph vessels can be used as grafts. A locally interrupted or obstructed lymphatic pathway, mostly after resection of lymph nodes, can be reconstructed via a bypass using lymphatic vessels. These vessels are specialized to drain lymph by active pumping forces. These grafts are connected with main lymphatic collectors in front and behind the obstruction. The technique is mostly used in arm edemas after treatment of breast cancer and in unilateral edemas of lower extremities after resection of lymph nodes and radiation. The procedure is less widely used than the other surgical procedures, mainly in Germany. The method was developed in 1980 by Ruediger Baumeister.\n\nThe method is proven effective. Follow-up studies showed significant volume reduction of the extremities even 10 years after surgery. The patients, who had been previously treated with both MLD and compression therapy, gained significant improvement in quality of life after being treated with lymphatic vessel grafting. Lymphoscintigraphic investigations showed a lasting enhancement of lymphatic transport after grafting.\n\nThe patency of lymphatic grafts was demonstrated after more than 12 years, using indirect lymphography and MRI lymphography.\n\nLow level laser therapy\n\nLow-level laser therapy (LLLT) was cleared by the US Food and Drug Administration (FDA) for the treatment of lymphedema in November 2006.[http://www.dotmed.com/news/story/3067/ dotmed.com December 27, 2006] Low Level Laser FDA Cleared for the Treatment of Lymphedema. (accessed 9 November 09)\n\nAccording to the US National Cancer Institute,\n\nStudies suggest that low-level laser therapy may be effective in reducing lymphedema in a clinically meaningful way for some women. Two cycles of laser treatment were found to be effective in reducing the volume of the affected arm, extracellular fluid, and tissue hardness in approximately one-third of patients with postmastectomy lymphedema at 3 months post-treatment. Suggested rationales for laser therapy include a potential decrease in fibrosis, stimulation of macrophages and the immune system, and a possible role in encouraging lymphangiogenesis.[http://www.cancer.gov/cancertopics/pdq/supportivecare/lymphedema/HealthProfessional/page3#Section_68 National Cancer Institute: Low-level laser therapy] accessed 9 November 09\n\nComplications\n\nWhen the lymphatic impairment becomes so great that the lymph fluid exceeds the lymphatic system's ability to transport it, an abnormal amount of protein-rich fluid collects in the tissues. Left untreated, this stagnant, protein-rich fluid causes tissue channels to increase in size and number, reducing oxygen availability. This interferes with wound healing and provides a rich culture medium for bacterial growth that can result in infections: cellulitis, lymphangitis, lymphadenitis and in severe cases, skin ulcers. It is vital for lymphedema patients to be aware of the symptoms of infection and to seek immediate treatment, since recurrent infections or cellulitis, in addition to their inherent danger, further damage the lymphatic system and set up a vicious circle.\n\nIn rare cases, lymphedema can lead to a form of cancer called lymphangiosarcoma, although the mechanism of carcinogenesis is not understood. Lymphedema-associated lymphangiosarcoma is called Stewart-Treves syndrome. Lymphangiosarcoma most frequently occurs in cases of long-standing lymphedema. The incidence of angiosarcoma is estimated to be 0.45% in patients living 5 years after radical mastectomy. Lymphedema is also associated with a low grade form of cancer called retiform hemangioendothelioma (a low grade angiosarcoma).\n\nSince lymphedema is disfiguring, causing difficulties in daily living and can lead to lifestyle becoming severely limited, it may also result in psychological distress. Lymphedema. http://en.wikipedia.org/?curid=18722."
  }
}
