{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13134",
  "eid" : "06cd6320-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778520658,
  "textBody" : "Geckos are lizards belonging to the infraorder Gekkota, found in warm climates throughout the world. They range from 1.6 to 60 cm (0.64 to 24 inches). Most geckos cannot blink, but they often lick their eyes to keep them clean and moist. They have a fixed lens within each iris that enlarges in darkness to let in more light.\n\nGeckos are unique among lizards in their vocalizations, which differ from species to species. They use chirping or clicking sounds in their social interactions, and sometimes when alarmed. They are the most species-rich group of lizards, with about 1,500 different species worldwide. The New Latin gekko and English \"gecko\" stem from the Indonesian-Malay gēkoq, which is imitative of sounds that some species make.[http://www.oed.com/view/Entry/77283 gecko, n.]\nOxford English Dictionary Second edition, 1989; online version September 2011. Accessed 29 October 2011. Earlier version first published in New English Dictionary, 1898.\n\nAll geckos except species in the family Eublepharidae lack eyelids; instead the outer surface of the eyeball has a transparent membrane, the cornea. Species without eyelids generally lick their own corneas when they need to clear them of dust and dirt.  \n\nNocturnal species have excellent night vision; their color vision in low light is 350 times more sensitive than human color vision. The nocturnal geckos evolved from diurnal species which had lost the eye rods. The gecko eye therefore modified its cones that increased in size into different types both single and double. Three different photopigments have been retained and are sensitive to UV, blue, and green. They also use a multifocal optical system that allows them to generate a sharp image for at least two different depths.\n\nMost gecko species can lose their tails in defense, a process called autotomy. Many species are well known for their specialised toe pads that enable them to climb smooth and vertical surfaces, and even cross indoor ceilings with ease. Geckos are well-known to people who live in warm regions of the world, where several species of geckos make their home inside human habitations. These (for example the house gecko) become part of the indoor menagerie and are often welcomed, as they feed on insects, including moths and mosquitoes. Unlike most lizards, geckos are usually nocturnal.\n\nThe largest species, the kawekaweau, is only known from a single, stuffed specimen found in the basement of a museum in Marseille, France. This gecko was 60 cm (24 in) long and it was likely endemic to New Zealand, where it lived in native forests. It was probably wiped out along with much of the native fauna of these islands in the late 19th century, when new invasive species such as rats and stoats were introduced to the country during European colonization. The smallest gecko, the Jaragua sphaero, is a mere 1.6 cm long and was discovered in 2001 on a small island off the coast of the Dominican Republic.\n\nCommon traits\n\nGeckos occur in various patterns and colors, and are among the most colorful lizards in the world. Some species can change colour and may be lighter in colour at night. Some species are parthenogenetic, which means the female is capable of reproducing without copulating with a male. This improves the gecko's ability to spread to new islands. However, in a situation where a single female gecko populates an entire island, the island will suffer from a lack of genetic variation within the geckos that inhabit it. The gecko's mating call sounds like a shortened bird chirping which attracts males, when they are nearby. Like other reptiles, geckos are ectothermic, producing very little metabolic heat. Essentially a gecko's body temperature is dependent on its environment. Also, in order to accomplish their main functions—such as locomotion, feeding, reproduction, etc.—geckos must have a relatively elevated temperature.\n\nShedding or molting\n\nAll geckos shed their skin at fairly regular intervals, with species differing in timing and method. Leopard geckos will shed at about two- to four-week intervals. The presence of moisture aids in the shedding. When shedding begins, the gecko will speed the process by detaching the loose skin from its body and eating it.http://www.geckocare.net/shedding.php\nFor young geckos, shedding will occur more frequently, at once every week. But when they fully grow, they shed once every one or two months.https://buddygenius.com/crested-geckos-shed/\n\nAdhesion ability\n\nAbout 60% of gecko species have adhesive toe pads that allow them to adhere to most surfaces without the use of liquids or surface tension. Such pads have been gained and lost repeatedly over the course of gecko evolution. Adhesive toepads evolved independently in about 11 different gecko lineages and were lost in at least 9 lineages. The spatula-shaped setae arranged in lamellae on gecko footpads enable attractive van der Waals' forces between the β-keratin lamellae/setae/spatulae structures and the surface. These van der Waals interactions involve no fluids; in theory, a boot made of synthetic setae would adhere as easily to the surface of the International Space Station as it would to a living-room wall, although adhesion varies with humidity. The setae on the feet of geckos are also self-cleaning and will usually remove any clogging dirt within a few steps.[http://www.lclark.edu/~autumn/dept/geckostory.html How Geckos Stick to Walls].\n\nTeflon, which has very low surface energy,[http://www.justanswer.com/questions/bwl6-feet-gecko-lizard-not-stick Why do the gecko's feet not stick to a teflon surface?]. is more difficult for geckos to adhere to than many other surfaces.\n\nGecko adhesion is typically improved by higher humidity, even on hydrophobic surfaces, yet is reduced under conditions of complete immersion in water. The role of water in that system is under discussion, yet recent experiments agree that the presence of molecular water layers (water molecules carry a very large dipole moment) on the setae as well as on the surface increase the surface energy of both, therefore the energy gain in getting these surfaces in contact is enlarged, which results in an increased gecko adhesion force.  Moreover, the elastic properties of the b-keratin change with water uptake. Friction experiments with gecko toes—torn parallel to surfaces—have shown to be influenced also by electrostatic forces.\n\nGecko toes seem to be \"double jointed\", but this is a misnomer and is properly called digital hyperextension. Gecko toes can hyperextend in the opposite direction from human fingers and toes. This allows them to overcome the van der Waals force by peeling their toes off surfaces from the tips inward. In essence, by this peeling action, the gecko separates spatula by spatula from the surface,  so for each spatula separation, only some nN are necessary. (The process is similar to removing scotch tape from a surface.)\n\nGeckos' toes operate well below their full attractive capabilities most of the time, because the margin for error is great depending upon the surface roughness, and therefore the number of setae in contact with that surface. \n\nUse of small van der Waals attraction force requires very large surface areas: every square millimeter of a gecko's footpad contains about 14,000 hair-like setae. Each seta has a diameter of 5 μm. Human hair varies from 18 to 180 μm, so the cross-sectional area of a human hair is equivalent to 12 to 1300 setae. Each seta is in turn tipped with between 100 and 1,000 spatulae. Each spatula is 0.2 μm long (one five-millionth of a meter), or just below the wavelength of visible light.\n\nThe setae of a typical mature 70 g gecko would be capable of supporting a weight of 133 kg: each spatula can exert an adhesive force of 5 to 25 nN. The exact value of the adhesion force of a spatula varies with the surface energy of the substrate to which it adheres. Recent studies  have moreover shown that the component of the surface energy derived from long-range forces, such as van der Waals forces, depends on the material's structure below the outermost atomic layers (up to 100 nm beneath the surface); taking that into account, the adhesive strength can be inferred.\n\nRecent studies have also revealed that apart from the setae, phospholipids—fatty substances produced naturally in their bodies—also come into play.  These lipids lubricate the setae and allow the gecko to detach its foot before the next step.\n\nThe origin of gecko adhesion likely started as simple modifications to the epidermis on the underside of the toes. This was recently discovered in the genus Gonatodes from South America. Simple elaborations of the epidermal spinules into setae have enabled Gonatodes humeralis to climb smooth surfaces and sleep on smooth leaves.\n\nBiomimetic technologies designed to mimic gecko adhesion could produce reusable self-cleaning dry adhesives with many applications. Development effort is being put into these technologies, but manufacturing synthetic setae is not a trivial material design task.\n\nSkin\n\nGecko skin does not generally bear scales but appears at a macro scale as a papillose surface which is made from hair-like protuberances developed across the entire body. These confer superhydrophobicity and the unique design of the hair confers a profound antimicrobial action. These protuberances are very small, up to 4 microns in length, and tapering to a point.\n\nTeeth\n\nGeckos are polyphyodonts and able to replace each of their 100 teeth every 3 to 4 months. Next to the full grown tooth there is a small replacement tooth developing from the odontogenic stem cell in the dental lamina.\nThe formation of the teeth is pleurodont; they are fused (ankylosed) by their sides to the inner surface of the jaw bones.\nThis formation is common in all species in the order Squamata.\n\nTaxonomy and classification\n\nThe infraorder Gekkota is divided into seven families, containing numerous genera of gecko species.\n\n*Family Pygopodidae\n*Family Carphodactylidae\n*Family Diplodactylidae\n*Family Sphaerodactylidae\n*Family Phyllodactylidae\n*Family Eublepharidae\n*Family Gekkonidae\n\nSpecies\n\nMore than 1,650 species of geckos occur worldwide, including these familiar species:\n*Coleonyx variegatus, the western banded gecko, is native to the southwestern United States and northwest Mexico.\n*Cyrtopodion brachykolon, the bent-toed gecko, is found in northwestern Pakistan; it was first described in 2007.\n*Eublepharis macularius, the leopard gecko, is the most common gecko kept as a pet; it does not have adhesive toe pads and cannot climb the glass of a vivarium.\n*Gehyra mutilata (Peropus mutilatus), the stump-toed gecko, is able to vary its color from very light to very dark to camouflage itself; this gecko is at home in the wild, as well as in residential areas.\n*Gekko gecko, the Tokay gecko, is a large, common, Southeast Asian gecko known for its aggressive temperament, loud mating calls, and bright markings.\n*Hemidactylus is genus of geckos in which there are many varieties.\n**Hemidactylus frenatus, the Common house gecko, thrives around people and human habitation structures in the tropics and subtropics worldwide.\n**Hemidactylus garnotii, the Indo-Pacific gecko, is found in houses throughout the tropics, and has become an invasive species of concern in Florida and Georgia in the US.\n**Hemidactylus mabouia, the Tropical house gecko, Afro-American house gecko or Cosmopolitan house gecko, is a species of house gecko native to sub-Saharan Africa and also currently found in North, Central and South America and the Caribbean.\n**Hemidactylus turcicus, the Mediterranean house gecko, is frequently found in and around buildings, and is an introduced species in the US.\n*Lepidodactylus lugubris, the mourning gecko, is originally an East Asian and Pacific species; it is equally at home in the wild and residential neighborhoods.\n*Pachydactylus bibroni, Bibron's gecko, is native to southern Africa; this hardy arboreal gecko is considered a household pest.\n*Phelsuma laticauda, the gold dust day gecko, is diurnal; it lives in northern Madagascar and on the Comoros. It is also an introduced species in Hawaii.\n*Ptychozoon is a genus of arboreal geckos from Southeast Asia also known as flying or parachute geckos; they have wing-like flaps from the neck to the upper leg to help them conceal themselves on trees and provide lift while jumping.\n*Rhacodactylus is genus of geckos native to New Caledonia.\n**Rhacodactylus ciliatus, the crested gecko, was believed extinct until rediscovered in 1994, and is gaining popularity as a pet.\n**Rhacodactylus leachianus, the New Caledonian giant gecko, was first described by Cuvier in 1829; it is the largest living species of gecko.\n*Sphaerodactylus ariasae, the dwarf gecko, is native to the Caribbean Islands; it is the world's smallest lizard.\n*Tarentola mauritanica, the crocodile or Moorish gecko, is commonly found in the Mediterranean region from the Iberian Peninsula and southern France to Greece and northern Africa; their most distinguishing characteristics are their pointed heads, spiked skin, and tails resembling those of a crocodile.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Gecko" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13134" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Geckos are lizards belonging to the infraorder Gekkota, found in warm climates throughout the world. They range from 1.6 to 60 cm (0.64 to 24 inches). Most geckos cannot blink, but they often lick their eyes to keep them clean and moist. They have a fixed lens within each iris that enlarges in darkness to let in more light.\n\nGeckos are unique among lizards in their vocalizations, which differ from species to species. They use chirping or clicking sounds in their social interactions, and sometimes when alarmed. They are the most species-rich group of lizards, with about 1,500 different species worldwide. The New Latin gekko and English \"gecko\" stem from the Indonesian-Malay gēkoq, which is imitative of sounds that some species make.[http://www.oed.com/view/Entry/77283 gecko, n.]\nOxford English Dictionary Second edition, 1989; online version September 2011. Accessed 29 October 2011. Earlier version first published in New English Dictionary, 1898.\n\nAll geckos except species in the family Eublepharidae lack eyelids; instead the outer surface of the eyeball has a transparent membrane, the cornea. Species without eyelids generally lick their own corneas when they need to clear them of dust and dirt.  \n\nNocturnal species have excellent night vision; their color vision in low light is 350 times more sensitive than human color vision. The nocturnal geckos evolved from diurnal species which had lost the eye rods. The gecko eye therefore modified its cones that increased in size into different types both single and double. Three different photopigments have been retained and are sensitive to UV, blue, and green. They also use a multifocal optical system that allows them to generate a sharp image for at least two different depths.\n\nMost gecko species can lose their tails in defense, a process called autotomy. Many species are well known for their specialised toe pads that enable them to climb smooth and vertical surfaces, and even cross indoor ceilings with ease. Geckos are well-known to people who live in warm regions of the world, where several species of geckos make their home inside human habitations. These (for example the house gecko) become part of the indoor menagerie and are often welcomed, as they feed on insects, including moths and mosquitoes. Unlike most lizards, geckos are usually nocturnal.\n\nThe largest species, the kawekaweau, is only known from a single, stuffed specimen found in the basement of a museum in Marseille, France. This gecko was 60 cm (24 in) long and it was likely endemic to New Zealand, where it lived in native forests. It was probably wiped out along with much of the native fauna of these islands in the late 19th century, when new invasive species such as rats and stoats were introduced to the country during European colonization. The smallest gecko, the Jaragua sphaero, is a mere 1.6 cm long and was discovered in 2001 on a small island off the coast of the Dominican Republic.\n\nCommon traits\n\nGeckos occur in various patterns and colors, and are among the most colorful lizards in the world. Some species can change colour and may be lighter in colour at night. Some species are parthenogenetic, which means the female is capable of reproducing without copulating with a male. This improves the gecko's ability to spread to new islands. However, in a situation where a single female gecko populates an entire island, the island will suffer from a lack of genetic variation within the geckos that inhabit it. The gecko's mating call sounds like a shortened bird chirping which attracts males, when they are nearby. Like other reptiles, geckos are ectothermic, producing very little metabolic heat. Essentially a gecko's body temperature is dependent on its environment. Also, in order to accomplish their main functions—such as locomotion, feeding, reproduction, etc.—geckos must have a relatively elevated temperature.\n\nShedding or molting\n\nAll geckos shed their skin at fairly regular intervals, with species differing in timing and method. Leopard geckos will shed at about two- to four-week intervals. The presence of moisture aids in the shedding. When shedding begins, the gecko will speed the process by detaching the loose skin from its body and eating it.http://www.geckocare.net/shedding.php\nFor young geckos, shedding will occur more frequently, at once every week. But when they fully grow, they shed once every one or two months.https://buddygenius.com/crested-geckos-shed/\n\nAdhesion ability\n\nAbout 60% of gecko species have adhesive toe pads that allow them to adhere to most surfaces without the use of liquids or surface tension. Such pads have been gained and lost repeatedly over the course of gecko evolution. Adhesive toepads evolved independently in about 11 different gecko lineages and were lost in at least 9 lineages. The spatula-shaped setae arranged in lamellae on gecko footpads enable attractive van der Waals' forces between the β-keratin lamellae/setae/spatulae structures and the surface. These van der Waals interactions involve no fluids; in theory, a boot made of synthetic setae would adhere as easily to the surface of the International Space Station as it would to a living-room wall, although adhesion varies with humidity. The setae on the feet of geckos are also self-cleaning and will usually remove any clogging dirt within a few steps.[http://www.lclark.edu/~autumn/dept/geckostory.html How Geckos Stick to Walls].\n\nTeflon, which has very low surface energy,[http://www.justanswer.com/questions/bwl6-feet-gecko-lizard-not-stick Why do the gecko's feet not stick to a teflon surface?]. is more difficult for geckos to adhere to than many other surfaces.\n\nGecko adhesion is typically improved by higher humidity, even on hydrophobic surfaces, yet is reduced under conditions of complete immersion in water. The role of water in that system is under discussion, yet recent experiments agree that the presence of molecular water layers (water molecules carry a very large dipole moment) on the setae as well as on the surface increase the surface energy of both, therefore the energy gain in getting these surfaces in contact is enlarged, which results in an increased gecko adhesion force.  Moreover, the elastic properties of the b-keratin change with water uptake. Friction experiments with gecko toes—torn parallel to surfaces—have shown to be influenced also by electrostatic forces.\n\nGecko toes seem to be \"double jointed\", but this is a misnomer and is properly called digital hyperextension. Gecko toes can hyperextend in the opposite direction from human fingers and toes. This allows them to overcome the van der Waals force by peeling their toes off surfaces from the tips inward. In essence, by this peeling action, the gecko separates spatula by spatula from the surface,  so for each spatula separation, only some nN are necessary. (The process is similar to removing scotch tape from a surface.)\n\nGeckos' toes operate well below their full attractive capabilities most of the time, because the margin for error is great depending upon the surface roughness, and therefore the number of setae in contact with that surface. \n\nUse of small van der Waals attraction force requires very large surface areas: every square millimeter of a gecko's footpad contains about 14,000 hair-like setae. Each seta has a diameter of 5 μm. Human hair varies from 18 to 180 μm, so the cross-sectional area of a human hair is equivalent to 12 to 1300 setae. Each seta is in turn tipped with between 100 and 1,000 spatulae. Each spatula is 0.2 μm long (one five-millionth of a meter), or just below the wavelength of visible light.\n\nThe setae of a typical mature 70 g gecko would be capable of supporting a weight of 133 kg: each spatula can exert an adhesive force of 5 to 25 nN. The exact value of the adhesion force of a spatula varies with the surface energy of the substrate to which it adheres. Recent studies  have moreover shown that the component of the surface energy derived from long-range forces, such as van der Waals forces, depends on the material's structure below the outermost atomic layers (up to 100 nm beneath the surface); taking that into account, the adhesive strength can be inferred.\n\nRecent studies have also revealed that apart from the setae, phospholipids—fatty substances produced naturally in their bodies—also come into play.  These lipids lubricate the setae and allow the gecko to detach its foot before the next step.\n\nThe origin of gecko adhesion likely started as simple modifications to the epidermis on the underside of the toes. This was recently discovered in the genus Gonatodes from South America. Simple elaborations of the epidermal spinules into setae have enabled Gonatodes humeralis to climb smooth surfaces and sleep on smooth leaves.\n\nBiomimetic technologies designed to mimic gecko adhesion could produce reusable self-cleaning dry adhesives with many applications. Development effort is being put into these technologies, but manufacturing synthetic setae is not a trivial material design task.\n\nSkin\n\nGecko skin does not generally bear scales but appears at a macro scale as a papillose surface which is made from hair-like protuberances developed across the entire body. These confer superhydrophobicity and the unique design of the hair confers a profound antimicrobial action. These protuberances are very small, up to 4 microns in length, and tapering to a point.\n\nTeeth\n\nGeckos are polyphyodonts and able to replace each of their 100 teeth every 3 to 4 months. Next to the full grown tooth there is a small replacement tooth developing from the odontogenic stem cell in the dental lamina.\nThe formation of the teeth is pleurodont; they are fused (ankylosed) by their sides to the inner surface of the jaw bones.\nThis formation is common in all species in the order Squamata.\n\nTaxonomy and classification\n\nThe infraorder Gekkota is divided into seven families, containing numerous genera of gecko species.\n\n*Family Pygopodidae\n*Family Carphodactylidae\n*Family Diplodactylidae\n*Family Sphaerodactylidae\n*Family Phyllodactylidae\n*Family Eublepharidae\n*Family Gekkonidae\n\nSpecies\n\nMore than 1,650 species of geckos occur worldwide, including these familiar species:\n*Coleonyx variegatus, the western banded gecko, is native to the southwestern United States and northwest Mexico.\n*Cyrtopodion brachykolon, the bent-toed gecko, is found in northwestern Pakistan; it was first described in 2007.\n*Eublepharis macularius, the leopard gecko, is the most common gecko kept as a pet; it does not have adhesive toe pads and cannot climb the glass of a vivarium.\n*Gehyra mutilata (Peropus mutilatus), the stump-toed gecko, is able to vary its color from very light to very dark to camouflage itself; this gecko is at home in the wild, as well as in residential areas.\n*Gekko gecko, the Tokay gecko, is a large, common, Southeast Asian gecko known for its aggressive temperament, loud mating calls, and bright markings.\n*Hemidactylus is genus of geckos in which there are many varieties.\n**Hemidactylus frenatus, the Common house gecko, thrives around people and human habitation structures in the tropics and subtropics worldwide.\n**Hemidactylus garnotii, the Indo-Pacific gecko, is found in houses throughout the tropics, and has become an invasive species of concern in Florida and Georgia in the US.\n**Hemidactylus mabouia, the Tropical house gecko, Afro-American house gecko or Cosmopolitan house gecko, is a species of house gecko native to sub-Saharan Africa and also currently found in North, Central and South America and the Caribbean.\n**Hemidactylus turcicus, the Mediterranean house gecko, is frequently found in and around buildings, and is an introduced species in the US.\n*Lepidodactylus lugubris, the mourning gecko, is originally an East Asian and Pacific species; it is equally at home in the wild and residential neighborhoods.\n*Pachydactylus bibroni, Bibron's gecko, is native to southern Africa; this hardy arboreal gecko is considered a household pest.\n*Phelsuma laticauda, the gold dust day gecko, is diurnal; it lives in northern Madagascar and on the Comoros. It is also an introduced species in Hawaii.\n*Ptychozoon is a genus of arboreal geckos from Southeast Asia also known as flying or parachute geckos; they have wing-like flaps from the neck to the upper leg to help them conceal themselves on trees and provide lift while jumping.\n*Rhacodactylus is genus of geckos native to New Caledonia.\n**Rhacodactylus ciliatus, the crested gecko, was believed extinct until rediscovered in 1994, and is gaining popularity as a pet.\n**Rhacodactylus leachianus, the New Caledonian giant gecko, was first described by Cuvier in 1829; it is the largest living species of gecko.\n*Sphaerodactylus ariasae, the dwarf gecko, is native to the Caribbean Islands; it is the world's smallest lizard.\n*Tarentola mauritanica, the crocodile or Moorish gecko, is commonly found in the Mediterranean region from the Iberian Peninsula and southern France to Greece and northern Africa; their most distinguishing characteristics are their pointed heads, spiked skin, and tails resembling those of a crocodile. Gecko. http://en.wikipedia.org/?curid=13134."
  }
}
