{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2102",
  "eid" : "bdad9980-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778397976,
  "textBody" : "The Arizona Cardinals are a professional American football franchise based in the Phoenix metropolitan area. The Cardinals compete in the National Football League (NFL) as a member of the league's National Football Conference (NFC) West division. The Cardinals were founded as the Morgan Athletic Club in 1898, and are the oldest continuously run professional football team in the United States. The Cardinals play their home games at the University of Phoenix Stadium, which is located in the northwestern suburb of Glendale, Arizona.\n\nThe team was established in Chicago in 1898 and joined the NFL as a charter member on September 17, 1920. Along with the Chicago Bears, the club is one of two NFL charter member franchises still in  operation since the league's founding. (The Green Bay Packers were an independent team until they joined the NFL in 1921.) The club then moved to St. Louis in  and played in that city through  (sometimes referred to as the \"Football Cardinals\" or the \"Big Red\" to avoid confusion with the Major League Baseball St. Louis Cardinals). Before the  season, the team moved west to Tempe, Arizona, a college suburb east of Phoenix, and played their home games for the next 18 seasons at Arizona State University's Sun Devil Stadium. In , the club began playing all home games at the newly constructed University of Phoenix Stadium in Glendale, although the team's training facility is in Tempe.\n\nThe franchise has won two NFL championships, both while it was based in Chicago. The first occurred in , but is the subject of controversy, with supporters of the Pottsville Maroons believing that Pottsville should have won the title. Their second title, and the first to be won in a championship game, came in , nearly two decades before the first Super Bowl. They returned to the title game to defend in 1948, but lost the rematch 7–0 in a snowstorm in Philadelphia.\n\nSince winning the championship in 1947, the team suffered many losing seasons, and currently holds the longest active championship drought of North American sports at 68 consecutive seasons after Major League Baseball's Chicago Cubs ended their 108 year drought in 2016. In 2012 the Cardinals became the first NFL franchise to lose 700 games since its inception. The franchise's all-time win-loss record (including regular season and playoff games) at the conclusion of the 2016 season is  ( in the regular season,  in the playoffs). They have been to the playoffs ten times and have won seven playoff games, three of which were victories during their run in the 2008–09 NFL playoffs. During that season, they won their only NFC Championship Game since the 1970 AFL–NFL merger, and reached Super Bowl XLIII (losing 27–23 to the Pittsburgh Steelers). The team has also won five division titles (, , ,  and ) since their 1947–48 NFL championship game appearances. The Cardinals are the only NFL team who have never lost a playoff game at home, with a 5–0 record: the 1947 NFL Championship Game, two postseason victories during the aforementioned 2008–09 NFL playoffs, one during the 2009–10 playoffs, and one during the 2015–16 playoffs.\n\nFrom 1988 through 2012 (except 2005, when they trained in Prescott), the Cardinals conducted their annual summer training camp at Northern Arizona University in Flagstaff. The Cardinals moved their training camp to University of Phoenix Stadium in 2013. The stadium was the site of the 2015 Pro Bowl, unlike in past years, where it was held at Aloha Stadium in Honolulu, Hawaii. The stadium also played host to Super Bowls XLII and XLIX.\n\nFranchise history\n\nChicago\n\nThe franchise's inception dates back to 1898, when a neighborhood group gathered to play in the Chicago South Side, calling themselves Morgan Athletic Club. Chicago painting and building contractor Chris O'Brien acquired the team, which he relocated to Normal Field on Racine Avenue. The team was known as Racine Normals until 1901, when O'Brien bought used jerseys from the University of Chicago. He described the faded maroon clothing as \"Cardinal red\" and the team became the Racine Street Cardinals. The team eventually became in 1920 a charter member of the American Professional Football Association (APFA), which two years later was rechristened to National Football League (NFL). The team entered the league as the Racine Cardinals, however the name was changed in 1922 to Chicago Cardinals to avoid confusion with the Horlick-Racine Legion, who entered the league the same year. Except for 1925, when they were awarded the championship after the Pottsville Maroons were suspended, the Cardinals experienced only minimal success on the playing field during their first 26 seasons in the league. During the post-World War II years, the team reached two straight NFL finals against the Philadelphia Eagles, winning in 1947 – eight months after the Charles Bidwill's death – and losing the following year. After years of bad seasons and losing fans to the cross-town rivals Chicago Bears, by the late 1950s the Cardinals were almost bankrupt, and owner Violet Bidwill Wolfner became interested in a relocation.\n\nSt. Louis\n\nDue to the formation of the rival American Football League, the NFL allowed Bidwill to relocate the team to St. Louis, Missouri, where they became the St. Louis Cardinals (locally, they were called the \"Big Red\" or the \"Football Cardinals\" in order to avoid confusion with the baseball team). During the Cardinals' 28-year stay in St. Louis, they advanced to the playoffs just three times (1974, 1975 & 1982), never hosting or winning in any appearance. The overall mediocrity of the Cardinals, combined with a then-21-year-old stadium, caused game attendance to dwindle, and owner Bill Bidwill decided to move the team to Arizona.\n\nArizona\n\nNot long after the 1987 NFL season, Bidwill agreed to move to the Phoenix metropolitan area on a handshake deal with state and local officials, and the team became the Phoenix Cardinals. The franchise changed its geographic name from Phoenix to Arizona on March 17, 1994. (Interestingly, the franchise has never played in the city of Phoenix proper.) The 1998 NFL season saw the Cardinals break two long droughts, qualifying for the playoffs for the first time in 16 years. The team got their first postseason win since 1947 by winning the Wild Card Playoffs. In 2008, the Cardinals won the NFC Championship Game  to advance to the Super Bowl for the first time in franchise history. They lost Super Bowl XLIII 27–23 to the Pittsburgh Steelers in the final seconds.\n\nAfter their historic 2008 season, the Cardinals posted a 10–6 record in 2009, their first season with 10 wins in Arizona. The Cardinals clinched their second consecutive NFC West title, and were defeated by eventual Super Bowl champion New Orleans Saints 45–14 in the divisional playoffs. The next time they would make the playoffs would be in 2014, when they ended up as a wild card. They set the best regular-season record in the team's history in Arizona at 11–5, but were defeated by the 7–8–1 NFC South champions Carolina Panthers.\n\nThe next year, the Cardinals set a franchise-best 13–3 record, and clinched their first-ever first-round playoff bye as the NFC's second seed. They defeated the Green Bay Packers 26–20 in overtime, giving quarterback Carson Palmer his first playoff victory. The Cardinals then advanced to their second NFC Championship Game in their history, but were blown out by the top-seeded 15–1 Panthers 49–15, committing seven turnovers.\n\nUniforms\n\nStarting in , the team had a logo of a cardinal bird perched on the stitches of a football.\n\nThe Cardinals moved to Arizona in , and the flag of Arizona was added to the sleeves the following year. In , the team began wearing red pants with their white jerseys, as new coach Joe Bugel wanted to emulate his former employer, the Washington Redskins, who at the time wore burgundy pants with their white jerseys (the Redskins later returned to their 1970s gold pants with all their jerseys).\n\nIn , the Cardinals participated in the NFL's 75th anniversary throwback uniform program. The jerseys were similar to those of the 1920s Chicago Cardinals, with an interlocking \"CC\" logo and three stripes on each sleeve. The uniform numbers were relocated to the right chest. The pants were khaki to simulate the color and material used in that era. The Cardinals also stripped the logos from their helmets for the two games, at Cleveland (Sept. 18) and home vs. Pittsburgh (Oct. 30).\n\nThe Cardinal head on the helmet was repeated on the white jersey from 1982 to 1995. In 1996, the state flag of Arizona was moved higher on the sleeve after the Cardinal head was eliminated, and black was removed as an accent color, instead replaced with a blue to match the predominant color of the state flag. In 2002, the Cardinals began to wear all-red and all-white combinations, and continued to do so through 2004, prior to the team's makeover.\n\nIn , the team unveiled its first major changes in a century. The cardinal-head logo was updated to look sleeker and meaner than its predecessor. Numerous fans had derisively called the previous version a \"parakeet\". Black again became an accent color after an eight-year absence, while trim lines were added to the outside shoulders, sleeves, and sides of the jerseys and pants. Both the red and white jerseys have the option of red or white pants.\n\nHoping to break a six-game losing streak, the Cardinals wore the red pants for the first time on October 29, 2006, in a game at Lambeau Field against the Green Bay Packers. The Packers won 31–14, and the Cards headed into their bye week with a 1–7 mark. Following the bye week, the Cardinals came out in an all-red combination at home against the Dallas Cowboys and lost, 27–10. Arizona did not wear the red pants for the remainder of the season and won four of their last seven games. However, the following season, in , the Cardinals again wore their red pants for their final 3 home games. They wore red pants with white jerseys in games on the road at the Cincinnati Bengals and Seattle Seahawks. They paired red pants with red jerseys, the all-red combination, for home games against the Detroit Lions, San Francisco 49ers, Cleveland Browns, and St. Louis Rams. The red pants were not worn at all in , but they were used in home games vs. Seattle, Minnesota, and St. Louis in . The red pants were paired with the white road jersey for the first time in three years during a 2010 game at Carolina, but the white jersey/red pants combination has not been used since.\n\nThe Cardinals' first home game in Arizona, in 1988, saw them play in red jerseys. Thereafter, for the next 18 years in Arizona, the Cardinals, like a few other NFL teams in warm climates, wore their white jerseys at home during the first half of the season—forcing opponents to suffer in their darker jerseys during Arizona autumns that frequently see temperatures over 100 °F (38 °C). However, this tradition did not continue when the Cardinals moved from Sun Devil Stadium to University of Phoenix Stadium in 2006, as early-season games (and some home games late in the season) were played with the roof closed. With the temperature inside at a comfortable 70 °F (21 °C), the team opted to wear red jerseys at home full-time. The Cardinals wore white jerseys at home for the first time in University of Phoenix Stadium on August 29, 2008, in a preseason game against the Denver Broncos.\n\nThe Cardinals wore white at home for the first time in a regular season game at University of Phoenix Stadium against the Houston Texans on October 11, . In October 2009, the NFL recognized Breast Cancer Awareness Month, and players wore pink-accented items, including gloves, wristbands, and shoes. The team thought the pink accents looked better with white uniforms than with red.\n\nFrom 1970 through 1983, and again in many seasons between 1989 and 2002, the Cardinals would wear white when hosting the Dallas Cowboys in order to force the Cowboys to don their \"jinxed\" blue jerseys. They have not done this since moving into University of Phoenix Stadium, however.\n\nThe  season saw the Cardinals debut a new, alternate black jersey. Prior to its introduction, the Cardinals were the only NFL team without an alternate jersey or throwback kit, save for the NFL's 75th anniversary program in 1994.\n\nSeason-by-season records\n\nSingle-season records\n\nPoints Scored: 489 ()\n\nPassing\n* Passing yards: 4,671, Carson Palmer ()\n* Passing touchdowns: 35, Carson Palmer ()\n* Passes completed: 401, Kurt Warner ()\n* Passes attempted: 598, Kurt Warner ()\n* Longest completed pass: 98 yards, Doug Russell ()/Ogden Compton ()/Jim Hart () \n* Consecutive games with a touchdown pass: 22, Kurt Warner (–)\n\nRushing\n* Rushing yards: 1,605, Ottis Anderson ()\n* Rushing attempts: 337, Edgerrin James ()\n* Rushing touchdowns: 16, David Johnson ()\n* Rushing touchdowns (Rookie): 10, Tim Hightower ()\n* Longest rushing attempt: 83 yards, John David Crow ()\n* Rushing yards per game: 100.3 yards, Ottis Anderson ()\n\nReceiving\n* Receptions: 109, Larry Fitzgerald ()\n* Receiving yards: 1,598, David Boston ()\n* Receiving touchdowns: 15, Sonny Randle ()\n\nReturns\n* Punt returns in a season: 44, Vai Sikahema ()\n* Longest punt return: 99 yards, Patrick Peterson ()\n* Longest kickoff return: 108 yards, David Johnson ()\n\nKicking\n* Field goals: 40, Neil Rackers ()\n* Points after touchdown (PAT)s converted: 53, Pat Harder ()\n\nCardinals career records\n\n* Passing yards: 34,639, Jim Hart (–)\n* Passing touchdowns: 209, Jim Hart (–)\n* Rushing yards: 7,999, Ottis Anderson (–)\n* Rushing touchdowns: 46, Ottis Anderson (–)\n* Receptions: 1,074, Larry Fitzgerald (–present)\n* Receiving yards: 13,920, Larry Fitzgerald (–present)\n* Passes intercepted: 52, Larry Wilson (–)\n* Field goals made: 282, Jim Bakken (–)\n* Points: 1,380, Jim Bakken (–)\n* Total touchdowns: 103, Larry Fitzgerald (–present)\n* Punt return average: 13.7, Charley Trippi (–)\n* Kickoff return average: 28.5, Ollie Matson (, –)\n* Yards per punt average: 44.9, Jerry Norton (–)\n* Sacks: 67, Chandler Jones (–)\n* Tackles: 785, Eric Hill (1989–1997)\n* Wins (coach): 50, Bruce Arians (2013–2017)\n\nPlayers\n\nCurrent roster\n\nRetired numbers\n\nNotes:\n* 1 Posthumously retired.\n\nPro Football Hall of Famers\n\nitalics = played a portion of career with the Cardinals and enshrined representing another team\nDierdorf, Smith, Wehrli and Wilson were members of the St. Louis Football Ring of Fame in The Dome at America's Center when the Rams played there from 1995 to 2015.\n\nRing of Honor\n\nThe Cardinals' Ring of Honor was started in  to mark the opening of University of Phoenix Stadium. It honors former Cardinal greats from all eras of the franchise's history. Following is a list of inductees and the dates that they were inducted.\n* Charles Bidwill, Owner (August 12, 2006)\n* Jimmy Conzelman, Coach (August 12, 2006)\n* Dan Dierdorf, T (October 16, 2006)\n* John \"Paddy\" Driscoll, QB (August 12, 2006)\n* Marshall Goldberg, HB (August 12, 2006)\n* Roy Green, DB/WR, (October 2, 2016)\n* Dick \"Night Train\" Lane, DB (August 12, 2006)\n* Ollie Matson, HB (August 12, 2006)\n* Ernie Nevers, FB (August 12, 2006)\n* Pat Tillman, S (November 12, 2006)\n* Charley Trippi, HB/QB (August 12, 2006)\n* Kurt Warner, QB (June 18, 2014)\n* Roger Wehrli, CB (October 14, 2007)\n* Aeneas Williams, CB (November 10, 2008)\n* Adrian Wilson, S (September 27, 2015)\n* Larry Wilson, S (September 10, 2006)\n* Jim Hart, QB (December 3, 2017)\n\nCurrent staff\n\nRadio and television\n\nThe Cardinals' flagship radio station is KMVP-FM; Dave Pasch, Ron Wolfley, and Paul Calvisi handle the radio broadcast. Spanish-language radio broadcasts are heard on the combo of KQMR/KHOV-FM \"Latino Mix\" under a contract with Univisión, signed in 2015.[http://www.mediamoves.com/2015/08/univision-arizona-radio-signs-deal-with-arizona-cardinals.html Media Moves, \"Univision Arizona radio signs deal with Arizona Cardinals\"], Media Moves 28 August 2015 Prior to 2015, they were heard on KDVA/KVVA-FM \"José FM\", as well as co-owned KBMB AM 710. The Cardinals were the first NFL team to offer all 20 preseason and regular season games on Spanish-language radio, doing so in 2000. Gabriel Trujillo and Rolando Cantú are the Spanish broadcast team. The Cardinals have the most extensive Mexican affiliate network in the NFL, with contracts with Grupo Larsa (in the state of Sonora) and Grupo Radiorama (outside Sonora) and stations in 20 cities, including Hermosillo, Guadalajara and Mexico City.\n\nAs of the 2017 season, NBC affiliate KPNX broadcasts the team's preseason games on television (which, that year, included the Hall of Fame Game broadcast by NBC), called by Pasch and Wolfley, with station anchor Paul Gerke as sideline reporter. The broadcasts are syndicated regionally to KTTU and KMSB-TV in Tucson, and KVVU-TV in Las Vegas.\n\nEnglish radio affiliates",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Arizona Cardinals" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2102" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Arizona Cardinals are a professional American football franchise based in the Phoenix metropolitan area. The Cardinals compete in the National Football League (NFL) as a member of the league's National Football Conference (NFC) West division. The Cardinals were founded as the Morgan Athletic Club in 1898, and are the oldest continuously run professional football team in the United States. The Cardinals play their home games at the University of Phoenix Stadium, which is located in the northwestern suburb of Glendale, Arizona.\n\nThe team was established in Chicago in 1898 and joined the NFL as a charter member on September 17, 1920. Along with the Chicago Bears, the club is one of two NFL charter member franchises still in  operation since the league's founding. (The Green Bay Packers were an independent team until they joined the NFL in 1921.) The club then moved to St. Louis in  and played in that city through  (sometimes referred to as the \"Football Cardinals\" or the \"Big Red\" to avoid confusion with the Major League Baseball St. Louis Cardinals). Before the  season, the team moved west to Tempe, Arizona, a college suburb east of Phoenix, and played their home games for the next 18 seasons at Arizona State University's Sun Devil Stadium. In , the club began playing all home games at the newly constructed University of Phoenix Stadium in Glendale, although the team's training facility is in Tempe.\n\nThe franchise has won two NFL championships, both while it was based in Chicago. The first occurred in , but is the subject of controversy, with supporters of the Pottsville Maroons believing that Pottsville should have won the title. Their second title, and the first to be won in a championship game, came in , nearly two decades before the first Super Bowl. They returned to the title game to defend in 1948, but lost the rematch 7–0 in a snowstorm in Philadelphia.\n\nSince winning the championship in 1947, the team suffered many losing seasons, and currently holds the longest active championship drought of North American sports at 68 consecutive seasons after Major League Baseball's Chicago Cubs ended their 108 year drought in 2016. In 2012 the Cardinals became the first NFL franchise to lose 700 games since its inception. The franchise's all-time win-loss record (including regular season and playoff games) at the conclusion of the 2016 season is  ( in the regular season,  in the playoffs). They have been to the playoffs ten times and have won seven playoff games, three of which were victories during their run in the 2008–09 NFL playoffs. During that season, they won their only NFC Championship Game since the 1970 AFL–NFL merger, and reached Super Bowl XLIII (losing 27–23 to the Pittsburgh Steelers). The team has also won five division titles (, , ,  and ) since their 1947–48 NFL championship game appearances. The Cardinals are the only NFL team who have never lost a playoff game at home, with a 5–0 record: the 1947 NFL Championship Game, two postseason victories during the aforementioned 2008–09 NFL playoffs, one during the 2009–10 playoffs, and one during the 2015–16 playoffs.\n\nFrom 1988 through 2012 (except 2005, when they trained in Prescott), the Cardinals conducted their annual summer training camp at Northern Arizona University in Flagstaff. The Cardinals moved their training camp to University of Phoenix Stadium in 2013. The stadium was the site of the 2015 Pro Bowl, unlike in past years, where it was held at Aloha Stadium in Honolulu, Hawaii. The stadium also played host to Super Bowls XLII and XLIX.\n\nFranchise history\n\nChicago\n\nThe franchise's inception dates back to 1898, when a neighborhood group gathered to play in the Chicago South Side, calling themselves Morgan Athletic Club. Chicago painting and building contractor Chris O'Brien acquired the team, which he relocated to Normal Field on Racine Avenue. The team was known as Racine Normals until 1901, when O'Brien bought used jerseys from the University of Chicago. He described the faded maroon clothing as \"Cardinal red\" and the team became the Racine Street Cardinals. The team eventually became in 1920 a charter member of the American Professional Football Association (APFA), which two years later was rechristened to National Football League (NFL). The team entered the league as the Racine Cardinals, however the name was changed in 1922 to Chicago Cardinals to avoid confusion with the Horlick-Racine Legion, who entered the league the same year. Except for 1925, when they were awarded the championship after the Pottsville Maroons were suspended, the Cardinals experienced only minimal success on the playing field during their first 26 seasons in the league. During the post-World War II years, the team reached two straight NFL finals against the Philadelphia Eagles, winning in 1947 – eight months after the Charles Bidwill's death – and losing the following year. After years of bad seasons and losing fans to the cross-town rivals Chicago Bears, by the late 1950s the Cardinals were almost bankrupt, and owner Violet Bidwill Wolfner became interested in a relocation.\n\nSt. Louis\n\nDue to the formation of the rival American Football League, the NFL allowed Bidwill to relocate the team to St. Louis, Missouri, where they became the St. Louis Cardinals (locally, they were called the \"Big Red\" or the \"Football Cardinals\" in order to avoid confusion with the baseball team). During the Cardinals' 28-year stay in St. Louis, they advanced to the playoffs just three times (1974, 1975 & 1982), never hosting or winning in any appearance. The overall mediocrity of the Cardinals, combined with a then-21-year-old stadium, caused game attendance to dwindle, and owner Bill Bidwill decided to move the team to Arizona.\n\nArizona\n\nNot long after the 1987 NFL season, Bidwill agreed to move to the Phoenix metropolitan area on a handshake deal with state and local officials, and the team became the Phoenix Cardinals. The franchise changed its geographic name from Phoenix to Arizona on March 17, 1994. (Interestingly, the franchise has never played in the city of Phoenix proper.) The 1998 NFL season saw the Cardinals break two long droughts, qualifying for the playoffs for the first time in 16 years. The team got their first postseason win since 1947 by winning the Wild Card Playoffs. In 2008, the Cardinals won the NFC Championship Game  to advance to the Super Bowl for the first time in franchise history. They lost Super Bowl XLIII 27–23 to the Pittsburgh Steelers in the final seconds.\n\nAfter their historic 2008 season, the Cardinals posted a 10–6 record in 2009, their first season with 10 wins in Arizona. The Cardinals clinched their second consecutive NFC West title, and were defeated by eventual Super Bowl champion New Orleans Saints 45–14 in the divisional playoffs. The next time they would make the playoffs would be in 2014, when they ended up as a wild card. They set the best regular-season record in the team's history in Arizona at 11–5, but were defeated by the 7–8–1 NFC South champions Carolina Panthers.\n\nThe next year, the Cardinals set a franchise-best 13–3 record, and clinched their first-ever first-round playoff bye as the NFC's second seed. They defeated the Green Bay Packers 26–20 in overtime, giving quarterback Carson Palmer his first playoff victory. The Cardinals then advanced to their second NFC Championship Game in their history, but were blown out by the top-seeded 15–1 Panthers 49–15, committing seven turnovers.\n\nUniforms\n\nStarting in , the team had a logo of a cardinal bird perched on the stitches of a football.\n\nThe Cardinals moved to Arizona in , and the flag of Arizona was added to the sleeves the following year. In , the team began wearing red pants with their white jerseys, as new coach Joe Bugel wanted to emulate his former employer, the Washington Redskins, who at the time wore burgundy pants with their white jerseys (the Redskins later returned to their 1970s gold pants with all their jerseys).\n\nIn , the Cardinals participated in the NFL's 75th anniversary throwback uniform program. The jerseys were similar to those of the 1920s Chicago Cardinals, with an interlocking \"CC\" logo and three stripes on each sleeve. The uniform numbers were relocated to the right chest. The pants were khaki to simulate the color and material used in that era. The Cardinals also stripped the logos from their helmets for the two games, at Cleveland (Sept. 18) and home vs. Pittsburgh (Oct. 30).\n\nThe Cardinal head on the helmet was repeated on the white jersey from 1982 to 1995. In 1996, the state flag of Arizona was moved higher on the sleeve after the Cardinal head was eliminated, and black was removed as an accent color, instead replaced with a blue to match the predominant color of the state flag. In 2002, the Cardinals began to wear all-red and all-white combinations, and continued to do so through 2004, prior to the team's makeover.\n\nIn , the team unveiled its first major changes in a century. The cardinal-head logo was updated to look sleeker and meaner than its predecessor. Numerous fans had derisively called the previous version a \"parakeet\". Black again became an accent color after an eight-year absence, while trim lines were added to the outside shoulders, sleeves, and sides of the jerseys and pants. Both the red and white jerseys have the option of red or white pants.\n\nHoping to break a six-game losing streak, the Cardinals wore the red pants for the first time on October 29, 2006, in a game at Lambeau Field against the Green Bay Packers. The Packers won 31–14, and the Cards headed into their bye week with a 1–7 mark. Following the bye week, the Cardinals came out in an all-red combination at home against the Dallas Cowboys and lost, 27–10. Arizona did not wear the red pants for the remainder of the season and won four of their last seven games. However, the following season, in , the Cardinals again wore their red pants for their final 3 home games. They wore red pants with white jerseys in games on the road at the Cincinnati Bengals and Seattle Seahawks. They paired red pants with red jerseys, the all-red combination, for home games against the Detroit Lions, San Francisco 49ers, Cleveland Browns, and St. Louis Rams. The red pants were not worn at all in , but they were used in home games vs. Seattle, Minnesota, and St. Louis in . The red pants were paired with the white road jersey for the first time in three years during a 2010 game at Carolina, but the white jersey/red pants combination has not been used since.\n\nThe Cardinals' first home game in Arizona, in 1988, saw them play in red jerseys. Thereafter, for the next 18 years in Arizona, the Cardinals, like a few other NFL teams in warm climates, wore their white jerseys at home during the first half of the season—forcing opponents to suffer in their darker jerseys during Arizona autumns that frequently see temperatures over 100 °F (38 °C). However, this tradition did not continue when the Cardinals moved from Sun Devil Stadium to University of Phoenix Stadium in 2006, as early-season games (and some home games late in the season) were played with the roof closed. With the temperature inside at a comfortable 70 °F (21 °C), the team opted to wear red jerseys at home full-time. The Cardinals wore white jerseys at home for the first time in University of Phoenix Stadium on August 29, 2008, in a preseason game against the Denver Broncos.\n\nThe Cardinals wore white at home for the first time in a regular season game at University of Phoenix Stadium against the Houston Texans on October 11, . In October 2009, the NFL recognized Breast Cancer Awareness Month, and players wore pink-accented items, including gloves, wristbands, and shoes. The team thought the pink accents looked better with white uniforms than with red.\n\nFrom 1970 through 1983, and again in many seasons between 1989 and 2002, the Cardinals would wear white when hosting the Dallas Cowboys in order to force the Cowboys to don their \"jinxed\" blue jerseys. They have not done this since moving into University of Phoenix Stadium, however.\n\nThe  season saw the Cardinals debut a new, alternate black jersey. Prior to its introduction, the Cardinals were the only NFL team without an alternate jersey or throwback kit, save for the NFL's 75th anniversary program in 1994.\n\nSeason-by-season records\n\nSingle-season records\n\nPoints Scored: 489 ()\n\nPassing\n* Passing yards: 4,671, Carson Palmer ()\n* Passing touchdowns: 35, Carson Palmer ()\n* Passes completed: 401, Kurt Warner ()\n* Passes attempted: 598, Kurt Warner ()\n* Longest completed pass: 98 yards, Doug Russell ()/Ogden Compton ()/Jim Hart () \n* Consecutive games with a touchdown pass: 22, Kurt Warner (–)\n\nRushing\n* Rushing yards: 1,605, Ottis Anderson ()\n* Rushing attempts: 337, Edgerrin James ()\n* Rushing touchdowns: 16, David Johnson ()\n* Rushing touchdowns (Rookie): 10, Tim Hightower ()\n* Longest rushing attempt: 83 yards, John David Crow ()\n* Rushing yards per game: 100.3 yards, Ottis Anderson ()\n\nReceiving\n* Receptions: 109, Larry Fitzgerald ()\n* Receiving yards: 1,598, David Boston ()\n* Receiving touchdowns: 15, Sonny Randle ()\n\nReturns\n* Punt returns in a season: 44, Vai Sikahema ()\n* Longest punt return: 99 yards, Patrick Peterson ()\n* Longest kickoff return: 108 yards, David Johnson ()\n\nKicking\n* Field goals: 40, Neil Rackers ()\n* Points after touchdown (PAT)s converted: 53, Pat Harder ()\n\nCardinals career records\n\n* Passing yards: 34,639, Jim Hart (–)\n* Passing touchdowns: 209, Jim Hart (–)\n* Rushing yards: 7,999, Ottis Anderson (–)\n* Rushing touchdowns: 46, Ottis Anderson (–)\n* Receptions: 1,074, Larry Fitzgerald (–present)\n* Receiving yards: 13,920, Larry Fitzgerald (–present)\n* Passes intercepted: 52, Larry Wilson (–)\n* Field goals made: 282, Jim Bakken (–)\n* Points: 1,380, Jim Bakken (–)\n* Total touchdowns: 103, Larry Fitzgerald (–present)\n* Punt return average: 13.7, Charley Trippi (–)\n* Kickoff return average: 28.5, Ollie Matson (, –)\n* Yards per punt average: 44.9, Jerry Norton (–)\n* Sacks: 67, Chandler Jones (–)\n* Tackles: 785, Eric Hill (1989–1997)\n* Wins (coach): 50, Bruce Arians (2013–2017)\n\nPlayers\n\nCurrent roster\n\nRetired numbers\n\nNotes:\n* 1 Posthumously retired.\n\nPro Football Hall of Famers\n\nitalics = played a portion of career with the Cardinals and enshrined representing another team\nDierdorf, Smith, Wehrli and Wilson were members of the St. Louis Football Ring of Fame in The Dome at America's Center when the Rams played there from 1995 to 2015.\n\nRing of Honor\n\nThe Cardinals' Ring of Honor was started in  to mark the opening of University of Phoenix Stadium. It honors former Cardinal greats from all eras of the franchise's history. Following is a list of inductees and the dates that they were inducted.\n* Charles Bidwill, Owner (August 12, 2006)\n* Jimmy Conzelman, Coach (August 12, 2006)\n* Dan Dierdorf, T (October 16, 2006)\n* John \"Paddy\" Driscoll, QB (August 12, 2006)\n* Marshall Goldberg, HB (August 12, 2006)\n* Roy Green, DB/WR, (October 2, 2016)\n* Dick \"Night Train\" Lane, DB (August 12, 2006)\n* Ollie Matson, HB (August 12, 2006)\n* Ernie Nevers, FB (August 12, 2006)\n* Pat Tillman, S (November 12, 2006)\n* Charley Trippi, HB/QB (August 12, 2006)\n* Kurt Warner, QB (June 18, 2014)\n* Roger Wehrli, CB (October 14, 2007)\n* Aeneas Williams, CB (November 10, 2008)\n* Adrian Wilson, S (September 27, 2015)\n* Larry Wilson, S (September 10, 2006)\n* Jim Hart, QB (December 3, 2017)\n\nCurrent staff\n\nRadio and television\n\nThe Cardinals' flagship radio station is KMVP-FM; Dave Pasch, Ron Wolfley, and Paul Calvisi handle the radio broadcast. Spanish-language radio broadcasts are heard on the combo of KQMR/KHOV-FM \"Latino Mix\" under a contract with Univisión, signed in 2015.[http://www.mediamoves.com/2015/08/univision-arizona-radio-signs-deal-with-arizona-cardinals.html Media Moves, \"Univision Arizona radio signs deal with Arizona Cardinals\"], Media Moves 28 August 2015 Prior to 2015, they were heard on KDVA/KVVA-FM \"José FM\", as well as co-owned KBMB AM 710. The Cardinals were the first NFL team to offer all 20 preseason and regular season games on Spanish-language radio, doing so in 2000. Gabriel Trujillo and Rolando Cantú are the Spanish broadcast team. The Cardinals have the most extensive Mexican affiliate network in the NFL, with contracts with Grupo Larsa (in the state of Sonora) and Grupo Radiorama (outside Sonora) and stations in 20 cities, including Hermosillo, Guadalajara and Mexico City.\n\nAs of the 2017 season, NBC affiliate KPNX broadcasts the team's preseason games on television (which, that year, included the Hall of Fame Game broadcast by NBC), called by Pasch and Wolfley, with station anchor Paul Gerke as sideline reporter. The broadcasts are syndicated regionally to KTTU and KMSB-TV in Tucson, and KVVU-TV in Las Vegas.\n\nEnglish radio affiliates. Arizona Cardinals. http://en.wikipedia.org/?curid=2102."
  }
}
