{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16544",
  "eid" : "26744310-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778573761,
  "textBody" : "James Logan \"Jim\" Jones Jr. (born December 19, 1943) is a retired United States Marine Corps general and a former United States National Security Advisor.\n\nDuring his military career, he served as Commander, United States European Command (COMUSEUCOM) and Supreme Allied Commander Europe (SACEUR) from 2003 to 2006 and as the 32nd Commandant of the Marine Corps from July 1999 to January 2003. Jones retired from the Marine Corps on February 1, 2007, after 40 years of service.\n\nAfter retiring from the Marine Corps, Jones remained involved in national security and foreign policy issues. In 2007, Jones served as chairman of the Congressional Independent Commission on the Security Forces of Iraq, which investigated the capabilities of the Iraqi police and armed forces. In November 2007, he was appointed by the U.S. Secretary of State as special envoy for Middle East security. He served as chairman of the Atlantic Council from June 2007 to January 2009, when he assumed the post of National Security Advisor which he held until November 2010.\n\nEarly life and education\n\nJones was born in Kansas City, Missouri, on December 19, 1943. He is the son of Charlotte Ann (née Ground) and James L. Jones Sr.,http://freepages.genealogy.rootsweb.ancestry.com/~battle/celeb/jamesjones.htm a decorated Marine in World War II who was an officer in the Observer Group and the commanding officer of its successor, the Amphibious Reconnaissance Battalion. Having spent his formative years in France, where he attended the American School of Paris, he returned to the United States graduating from Groveton High School in Fairfax County, Virginia, then attended Georgetown University Edmund A. Walsh School of Foreign Service, from which he received a Bachelor of Science degree in 1966. Jones, who is 6 ft tall, played forward on the Georgetown Hoyas men's basketball team.\n\nMilitary career\n\nIn January 1967, Jones was commissioned a second lieutenant in the U.S. Marine Corps. Upon completion of The Basic School at Marine Corps Base Quantico, Virginia, in October 1967, he was ordered to South Vietnam, where he served as a platoon and company commander with Golf Company, 2nd Battalion, 3rd Marines. While overseas, he was promoted to first lieutenant in June 1968.\n\nReturning to the United States in December 1968, Jones was assigned to Marine Corps Base Camp Pendleton, California, where he served as a company commander until May 1970. He then received orders to Marine Barracks, Washington, D.C., for duties as a company commander, serving in this assignment until July 1973. While at this post (December 1970) he was promoted to captain. From July 1973 until June 1974, he was a student at the Amphibious Warfare School, Marine Corps University, MCB Quantico, Virginia.\n\nIn November 1974, he received orders to report to the 3rd Marine Division at MCB Camp Butler, Okinawa, Japan, where he served as the commander of Company H, 2nd Battalion, 9th Marines, until December 1975.\n\nFrom January 1976 to August 1979, Jones served in the Officer Assignments Section at Headquarters Marine Corps, Washington, D.C. During this assignment, he was promoted to major in July 1977. Remaining in Washington, his next assignment was as the Marine Corps liaison officer to the United States Senate, where he served until July 1984. In this assignment, his first commander was John McCain, then a U.S. Navy captain. He was promoted to lieutenant colonel in September 1982.\n\nSenior staff and command\n\nJones was selected to attend the National War College in Washington, D.C. Following graduation in June 1985, he was assigned to command the 3rd Battalion, 9th Marines, 1st Marine Division, at Camp Pendleton, California, from July 1985 to July 1987.\n\nIn August 1987, Jones returned to Headquarters Marine Corps, where he served as senior aide to the Commandant of the Marine Corps. He was promoted to colonel in April 1988, and became the Military Secretary to the Commandant of the Marine Corps in February 1989. During August 1990, Jones was assigned as the commanding officer of the 24th Marine Expeditionary Unit (24th MEU) at Marine Corps Base Camp Lejeune, North Carolina.\n\nDuring his tour with the 24th MEU, he participated in Operation Provide Comfort in Northern Iraq and Turkey. He was advanced to brigadier general on April 23, 1992. Jones was assigned to duties as deputy director, J-3, U.S European Command, Stuttgart, Germany, on July 15, 1992. During this tour of duty, he was reassigned as chief of staff, Joint Task Force Provide Promise, for operations in Bosnia and Herzegovina and the Republic of Macedonia.\n\nReturning to the United States, he was advanced to the rank of major general in July 1994 and was assigned as commanding general, 2nd Marine Division, Marine Forces Atlantic, MCB Camp Lejeune. Jones next served as director, Expeditionary Warfare Division (N85), Office of the Chief of Naval Operations, during 1996, then as the deputy chief of staff for plans, policies, and operations, Headquarters Marine Corps, Washington, D.C. He was advanced to lieutenant general on July 18, 1996. His next assignment was as the military assistant to the Secretary of Defense.\n\nCommandant\n\nOn April 21, 1999, Jones was nominated for appointment to the grade of general and assignment as the 32nd commandant of the Marine Corps. He was promoted to general on June 30, 1999, and assumed the post on July 1, 1999. He served as commandant until January 2003, turning over the reins to General Michael Hagee.\n\nAmong other innovations during his career as Marine Corps commandant, Jones oversaw the Marine Corps' development of MARPAT camouflage uniforms, and the adoption of the Marine Corps Martial Arts Program (MCMAP). These replaced M81 Woodland uniforms and the LINE combat system, respectively.\n\nSACEUR/EUCOM\n\nJones assumed duties as the commander of U.S. European Command on January 16, 2003, and supreme allied commander Europe the following day. He was the first Marine Corps general to serve as SACEUR/EUCOM commander.\n\nThe Marine Corps had only recently begun to take on a larger share of high-level assignments in the Department of Defense. As of December 2006, Jones was one of five serving Marine Corps four-star general officers who outranked the current commandant of the Marine Corps (General James T. Conway) in terms of seniority and time in grade — the others being Chairman of the Joint Chiefs of Staff Peter Pace; former commandant Michael Hagee, commander of U.S. Strategic Command James E. Cartwright, and Assistant Commandant Robert Magnus.\n\nAs SACEUR, Jones led the Allied Command Operations (ACO), comprising NATO’s military forces in Europe, from the Supreme Headquarters Allied Powers Europe, Mons, Belgium, Jones relinquished command as SACEUR on December 7, 2006, and was succeeded by U.S. Army Gen. John Craddock.\n\nJones was reported to have declined an opportunity to succeed Gen. John P. Abizaid as commander of U.S. Central Command, and stepped down as SACEUR on December 4, 2006. He retired from the Marine Corps on February 1, 2007.\n\nAwards and decorations\n\nJones' personal decorations include (Foreign and non-U.S. personal and unit decorations are in order of precedence based on military guidelines and award date):\n\n \n\nPost-military career\n\nBusiness roles\n\nFollowing his retirement from the military, Jones became president of the Institute for 21st Century Energy, an affiliate of the US Chamber of Commerce; he also served as chair of the board of directors of the Atlantic Council of the United States from June 2007 until January 2009, when he assumed the post of National Security Advisor.  Jones also served as a member of the guiding coalition for the Project on National Security Reform, as well as chairman of the Independent Commission on the Iraqi Security Forces. He was a member of the Board of directors of The Boeing Company from June 21, 2007, to December 15, 2008, serving on the company's Audit and Finance Committees. Jones was also a member of the Board of directors of Cross Match Technologies, a privately held biometric solutions company, from October 2007 to January 2009.\n\nJones was employed on the Board of Trustees of the Center for Strategic and International Studies (CSIS), a bipartisan think-tank, from 2007 to 2008, and then began serving again in 2011. He was a member of the Board of directors of Chevron Corporation from May 28, 2008 to December 5, 2008, serving on the Board Nominating and Governance and Public Policy Committees.\n\nAccording to the first report since Jones re-entered government service in January 2009, Jones earned a salary and bonus of $900,000 from the US Chamber, as well as director fees of $330,000 from the Boeing Company and $290,000 from the Chevron Corporation.[https://www.wsj.com/articles/SB123879462053487927 \"Hedge Fund Paid Summers $5.2 Million in Past Year\"] by John D. McKinnon and F. W. Farnum, wsj.online, April 4, 2009. Retrieved 4/5/09.\n\nAfter leaving the Obama administration, Jones returned as a Fellow at the US Chamber in 2011.U.S. Chamber of Commerce (2011). [http://www.uschamber.com/press/releases/2011/march/general-james-jones-named-us-chamber-fellow General James Jones Named U.S. Chamber Fellow]. Retrieved April 3, 2011.\n\nThe board of directors of General Dynamics has elected Jones to be a director of the corporation, effective August 3, 2011. Also, on January 13, 2012, Jones joined Deloitte Consulting LLP as a senior adviser who will work with Federal and commercial consulting clients within Deloitte's Department of Defense and Intel segments. In early 2013, Jones joined OxiCool Inc's Advisory Board.http://www.prnewswire.com/news-releases/general-james-jones-joins-developer-of-green-air-conditioning-oxicool-inc-202389021.html\n\nDiplomatic roles\n\nSecretary of State Condoleezza Rice asked Jones twice to be Deputy Secretary of State after Robert Zoellick resigned. He declined.\n\nOn May 25, 2007, Congress created an Independent Commission on the Security Forces of Iraq to investigate for 120 days the capabilities of the Iraq armed forces and police.P.L. 110-28 § 1314(e)(2). Jones served as chairman of that commission and reported on Congress on September 6, 2007, noting serious deficiencies in the Iraq Interior Ministry and in the Iraq National Police.\n\nRice appointed Jones as a special envoy for Middle East security on November 28, 2007, to work with both Israelis and Palestinians on security issues.\n\nJones serves as a Senior Fellow at the Bipartisan Policy Center (BPC), where he works on a variety of national security and energy-related issues.[http://www.bipartisanpolicy.org/news/press-releases/2011/02/bipartisan-policy-center-welcomes-general-jim-jones The Bipartisan Policy Center Welcomes General Jim Jones] Jones is also a co-chair of BPC's Energy Project.\n\nNational Security Advisor\n\nOn December 1, 2008, President-elect Obama announced Jones as his selection for National Security Advisor.  The National Security Advisor is appointed by the President without confirmation by the United States Senate.\n\nThe selection surprised people because, as Michael Crowley reported, \"The two men didn't meet until Obama's foreign policy aide, Mark Lippert, arranged a 2005 sit-down, and, as of this October, Jones had only spoken to Obama twice\". Crowley speculated that Jones' record suggests he is \"someone who, unencumbered by strong ideological leanings, can evaluate ideas dispassionately whether they come from left or right\", and, \"This is probably why Obama picked him\". Jones was also picked because he is well respected and likely to possess the skills to navigate the other prestigious and powerful cabinet members.\n\nThough he didn't know Gates especially well, both men shared long experience in the national security establishment (Gates was in the Air Force and previously headed the CIA). Jones and Clinton had a more direct connection from her tenure on the Senate Armed Services Committee. The two were said to have particularly clicked at a 2005 conference on security policy in Munich. Jones hosted a small private dinner that included Clinton and South Carolina Republican Senator Lindsey Graham, among others; at the end of the convivial evening, according to one person present, Jones followed Clinton out to her car to visit in private.\n\nJones assumed the post when Obama was sworn into office on January 20, 2009. He announced his resignation as National Security Advisor on October 8, 2010, and was succeeded by Thomas E. Donilon.\n\nAdvocate for Iranian dissidents\n\nIn March 2013, Jones was quoted comparing the conditions for Iranians in a US camp in Iraq with the conditions of detention for captives held in the Guantanamo Bay detention camps.\nWhile addressing the Iranian American Cultural Society of Michigan, Jones said Guantanamo captives \"are treated far better\" than the Iranian internees. Jones criticized other aspects of the Obama administration's policy on Iran.  Foreign Policy magazine noted that Jones had not volunteered whether he had been paid for this speaking engagement.\n\nPersonal life\n\nFormer U.S. Secretary of Defense William Cohen, who hired Jones as his military assistant, said that Jones has a placid demeanor and a \"methodical approach to problems — he’s able to view issues at both the strategic and tactical level\".\n\nJones was also responsible for convincing country music artist Toby Keith that he should record and publish his popular concert hit \"Courtesy of the Red, White, & Blue (The Angry American)\".",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "James L. Jones" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16544" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "James Logan \"Jim\" Jones Jr. (born December 19, 1943) is a retired United States Marine Corps general and a former United States National Security Advisor.\n\nDuring his military career, he served as Commander, United States European Command (COMUSEUCOM) and Supreme Allied Commander Europe (SACEUR) from 2003 to 2006 and as the 32nd Commandant of the Marine Corps from July 1999 to January 2003. Jones retired from the Marine Corps on February 1, 2007, after 40 years of service.\n\nAfter retiring from the Marine Corps, Jones remained involved in national security and foreign policy issues. In 2007, Jones served as chairman of the Congressional Independent Commission on the Security Forces of Iraq, which investigated the capabilities of the Iraqi police and armed forces. In November 2007, he was appointed by the U.S. Secretary of State as special envoy for Middle East security. He served as chairman of the Atlantic Council from June 2007 to January 2009, when he assumed the post of National Security Advisor which he held until November 2010.\n\nEarly life and education\n\nJones was born in Kansas City, Missouri, on December 19, 1943. He is the son of Charlotte Ann (née Ground) and James L. Jones Sr.,http://freepages.genealogy.rootsweb.ancestry.com/~battle/celeb/jamesjones.htm a decorated Marine in World War II who was an officer in the Observer Group and the commanding officer of its successor, the Amphibious Reconnaissance Battalion. Having spent his formative years in France, where he attended the American School of Paris, he returned to the United States graduating from Groveton High School in Fairfax County, Virginia, then attended Georgetown University Edmund A. Walsh School of Foreign Service, from which he received a Bachelor of Science degree in 1966. Jones, who is 6 ft tall, played forward on the Georgetown Hoyas men's basketball team.\n\nMilitary career\n\nIn January 1967, Jones was commissioned a second lieutenant in the U.S. Marine Corps. Upon completion of The Basic School at Marine Corps Base Quantico, Virginia, in October 1967, he was ordered to South Vietnam, where he served as a platoon and company commander with Golf Company, 2nd Battalion, 3rd Marines. While overseas, he was promoted to first lieutenant in June 1968.\n\nReturning to the United States in December 1968, Jones was assigned to Marine Corps Base Camp Pendleton, California, where he served as a company commander until May 1970. He then received orders to Marine Barracks, Washington, D.C., for duties as a company commander, serving in this assignment until July 1973. While at this post (December 1970) he was promoted to captain. From July 1973 until June 1974, he was a student at the Amphibious Warfare School, Marine Corps University, MCB Quantico, Virginia.\n\nIn November 1974, he received orders to report to the 3rd Marine Division at MCB Camp Butler, Okinawa, Japan, where he served as the commander of Company H, 2nd Battalion, 9th Marines, until December 1975.\n\nFrom January 1976 to August 1979, Jones served in the Officer Assignments Section at Headquarters Marine Corps, Washington, D.C. During this assignment, he was promoted to major in July 1977. Remaining in Washington, his next assignment was as the Marine Corps liaison officer to the United States Senate, where he served until July 1984. In this assignment, his first commander was John McCain, then a U.S. Navy captain. He was promoted to lieutenant colonel in September 1982.\n\nSenior staff and command\n\nJones was selected to attend the National War College in Washington, D.C. Following graduation in June 1985, he was assigned to command the 3rd Battalion, 9th Marines, 1st Marine Division, at Camp Pendleton, California, from July 1985 to July 1987.\n\nIn August 1987, Jones returned to Headquarters Marine Corps, where he served as senior aide to the Commandant of the Marine Corps. He was promoted to colonel in April 1988, and became the Military Secretary to the Commandant of the Marine Corps in February 1989. During August 1990, Jones was assigned as the commanding officer of the 24th Marine Expeditionary Unit (24th MEU) at Marine Corps Base Camp Lejeune, North Carolina.\n\nDuring his tour with the 24th MEU, he participated in Operation Provide Comfort in Northern Iraq and Turkey. He was advanced to brigadier general on April 23, 1992. Jones was assigned to duties as deputy director, J-3, U.S European Command, Stuttgart, Germany, on July 15, 1992. During this tour of duty, he was reassigned as chief of staff, Joint Task Force Provide Promise, for operations in Bosnia and Herzegovina and the Republic of Macedonia.\n\nReturning to the United States, he was advanced to the rank of major general in July 1994 and was assigned as commanding general, 2nd Marine Division, Marine Forces Atlantic, MCB Camp Lejeune. Jones next served as director, Expeditionary Warfare Division (N85), Office of the Chief of Naval Operations, during 1996, then as the deputy chief of staff for plans, policies, and operations, Headquarters Marine Corps, Washington, D.C. He was advanced to lieutenant general on July 18, 1996. His next assignment was as the military assistant to the Secretary of Defense.\n\nCommandant\n\nOn April 21, 1999, Jones was nominated for appointment to the grade of general and assignment as the 32nd commandant of the Marine Corps. He was promoted to general on June 30, 1999, and assumed the post on July 1, 1999. He served as commandant until January 2003, turning over the reins to General Michael Hagee.\n\nAmong other innovations during his career as Marine Corps commandant, Jones oversaw the Marine Corps' development of MARPAT camouflage uniforms, and the adoption of the Marine Corps Martial Arts Program (MCMAP). These replaced M81 Woodland uniforms and the LINE combat system, respectively.\n\nSACEUR/EUCOM\n\nJones assumed duties as the commander of U.S. European Command on January 16, 2003, and supreme allied commander Europe the following day. He was the first Marine Corps general to serve as SACEUR/EUCOM commander.\n\nThe Marine Corps had only recently begun to take on a larger share of high-level assignments in the Department of Defense. As of December 2006, Jones was one of five serving Marine Corps four-star general officers who outranked the current commandant of the Marine Corps (General James T. Conway) in terms of seniority and time in grade — the others being Chairman of the Joint Chiefs of Staff Peter Pace; former commandant Michael Hagee, commander of U.S. Strategic Command James E. Cartwright, and Assistant Commandant Robert Magnus.\n\nAs SACEUR, Jones led the Allied Command Operations (ACO), comprising NATO’s military forces in Europe, from the Supreme Headquarters Allied Powers Europe, Mons, Belgium, Jones relinquished command as SACEUR on December 7, 2006, and was succeeded by U.S. Army Gen. John Craddock.\n\nJones was reported to have declined an opportunity to succeed Gen. John P. Abizaid as commander of U.S. Central Command, and stepped down as SACEUR on December 4, 2006. He retired from the Marine Corps on February 1, 2007.\n\nAwards and decorations\n\nJones' personal decorations include (Foreign and non-U.S. personal and unit decorations are in order of precedence based on military guidelines and award date):\n\n \n\nPost-military career\n\nBusiness roles\n\nFollowing his retirement from the military, Jones became president of the Institute for 21st Century Energy, an affiliate of the US Chamber of Commerce; he also served as chair of the board of directors of the Atlantic Council of the United States from June 2007 until January 2009, when he assumed the post of National Security Advisor.  Jones also served as a member of the guiding coalition for the Project on National Security Reform, as well as chairman of the Independent Commission on the Iraqi Security Forces. He was a member of the Board of directors of The Boeing Company from June 21, 2007, to December 15, 2008, serving on the company's Audit and Finance Committees. Jones was also a member of the Board of directors of Cross Match Technologies, a privately held biometric solutions company, from October 2007 to January 2009.\n\nJones was employed on the Board of Trustees of the Center for Strategic and International Studies (CSIS), a bipartisan think-tank, from 2007 to 2008, and then began serving again in 2011. He was a member of the Board of directors of Chevron Corporation from May 28, 2008 to December 5, 2008, serving on the Board Nominating and Governance and Public Policy Committees.\n\nAccording to the first report since Jones re-entered government service in January 2009, Jones earned a salary and bonus of $900,000 from the US Chamber, as well as director fees of $330,000 from the Boeing Company and $290,000 from the Chevron Corporation.[https://www.wsj.com/articles/SB123879462053487927 \"Hedge Fund Paid Summers $5.2 Million in Past Year\"] by John D. McKinnon and F. W. Farnum, wsj.online, April 4, 2009. Retrieved 4/5/09.\n\nAfter leaving the Obama administration, Jones returned as a Fellow at the US Chamber in 2011.U.S. Chamber of Commerce (2011). [http://www.uschamber.com/press/releases/2011/march/general-james-jones-named-us-chamber-fellow General James Jones Named U.S. Chamber Fellow]. Retrieved April 3, 2011.\n\nThe board of directors of General Dynamics has elected Jones to be a director of the corporation, effective August 3, 2011. Also, on January 13, 2012, Jones joined Deloitte Consulting LLP as a senior adviser who will work with Federal and commercial consulting clients within Deloitte's Department of Defense and Intel segments. In early 2013, Jones joined OxiCool Inc's Advisory Board.http://www.prnewswire.com/news-releases/general-james-jones-joins-developer-of-green-air-conditioning-oxicool-inc-202389021.html\n\nDiplomatic roles\n\nSecretary of State Condoleezza Rice asked Jones twice to be Deputy Secretary of State after Robert Zoellick resigned. He declined.\n\nOn May 25, 2007, Congress created an Independent Commission on the Security Forces of Iraq to investigate for 120 days the capabilities of the Iraq armed forces and police.P.L. 110-28 § 1314(e)(2). Jones served as chairman of that commission and reported on Congress on September 6, 2007, noting serious deficiencies in the Iraq Interior Ministry and in the Iraq National Police.\n\nRice appointed Jones as a special envoy for Middle East security on November 28, 2007, to work with both Israelis and Palestinians on security issues.\n\nJones serves as a Senior Fellow at the Bipartisan Policy Center (BPC), where he works on a variety of national security and energy-related issues.[http://www.bipartisanpolicy.org/news/press-releases/2011/02/bipartisan-policy-center-welcomes-general-jim-jones The Bipartisan Policy Center Welcomes General Jim Jones] Jones is also a co-chair of BPC's Energy Project.\n\nNational Security Advisor\n\nOn December 1, 2008, President-elect Obama announced Jones as his selection for National Security Advisor.  The National Security Advisor is appointed by the President without confirmation by the United States Senate.\n\nThe selection surprised people because, as Michael Crowley reported, \"The two men didn't meet until Obama's foreign policy aide, Mark Lippert, arranged a 2005 sit-down, and, as of this October, Jones had only spoken to Obama twice\". Crowley speculated that Jones' record suggests he is \"someone who, unencumbered by strong ideological leanings, can evaluate ideas dispassionately whether they come from left or right\", and, \"This is probably why Obama picked him\". Jones was also picked because he is well respected and likely to possess the skills to navigate the other prestigious and powerful cabinet members.\n\nThough he didn't know Gates especially well, both men shared long experience in the national security establishment (Gates was in the Air Force and previously headed the CIA). Jones and Clinton had a more direct connection from her tenure on the Senate Armed Services Committee. The two were said to have particularly clicked at a 2005 conference on security policy in Munich. Jones hosted a small private dinner that included Clinton and South Carolina Republican Senator Lindsey Graham, among others; at the end of the convivial evening, according to one person present, Jones followed Clinton out to her car to visit in private.\n\nJones assumed the post when Obama was sworn into office on January 20, 2009. He announced his resignation as National Security Advisor on October 8, 2010, and was succeeded by Thomas E. Donilon.\n\nAdvocate for Iranian dissidents\n\nIn March 2013, Jones was quoted comparing the conditions for Iranians in a US camp in Iraq with the conditions of detention for captives held in the Guantanamo Bay detention camps.\nWhile addressing the Iranian American Cultural Society of Michigan, Jones said Guantanamo captives \"are treated far better\" than the Iranian internees. Jones criticized other aspects of the Obama administration's policy on Iran.  Foreign Policy magazine noted that Jones had not volunteered whether he had been paid for this speaking engagement.\n\nPersonal life\n\nFormer U.S. Secretary of Defense William Cohen, who hired Jones as his military assistant, said that Jones has a placid demeanor and a \"methodical approach to problems — he’s able to view issues at both the strategic and tactical level\".\n\nJones was also responsible for convincing country music artist Toby Keith that he should record and publish his popular concert hit \"Courtesy of the Red, White, & Blue (The Angry American)\". James L. Jones. http://en.wikipedia.org/?curid=16544."
  }
}
