{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11004",
  "eid" : "f91c9890-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778497689,
  "textBody" : "In the mathematical  field of algebraic topology, the fundamental group is a mathematical group associated to any given pointed topological space that provides a way to determine when two paths, starting and ending at a fixed base point, can be continuously deformed into each other. It records information about the basic shape, or holes, of the topological space. The fundamental group is the first and simplest homotopy group. The fundamental group is a topological invariant: homeomorphic topological spaces have the same fundamental group.\n\nFundamental groups can be studied using the theory of covering spaces, since a fundamental group coincides with the group of deck transformations of the associated universal covering space. The abelianization of the fundamental group can be identified with the first homology group of the space. When the topological space is homeomorphic to a simplicial complex, its fundamental group can be described explicitly in terms of generators and relations.\n\nHenri Poincaré defined the fundamental group in 1895 in his paper \"Analysis situs\". Translated in  The concept emerged in the theory of Riemann surfaces, in the work of Bernhard Riemann, Poincaré, and Felix Klein. It describes the monodromy properties of complex-valued functions, as well as providing a complete topological classification of closed surfaces.\n\nIntuition \n\nStart with a space (e.g. a surface), and some point in it, and all the loops both starting and ending at this point — paths that start at this point, wander around and eventually return to the starting point. Two loops can be combined together in an obvious way: travel along the first loop, then along the second.\nTwo loops are considered equivalent if one can be deformed into the other without breaking. The set of all such loops with this method of combining and this equivalence between them is the fundamental group for that particular space.\n\nDefinition\n\nLet X be a topological space, and let x0 be a point of X. We are interested in the following set of continuous functions called loops with base point x0.\n\n\\{f:[0,1]\\to X : \\ f(0)x_0\nf(1)\\}\n\nNow the fundamental group of X with base point x0 is this set modulo homotopy h\n\n\\{f:[0,1]\\to X : \\ f(0)x_0\nf(1)\\} / h\n\nequipped with the group multiplication defined by\n\n (f * g) (t) = \\begin{cases} f(2t) & 0 \\leq t \\leq \\tfrac{1}{2} \\\\ g(2t-1) & \\tfrac{1}{2} \\leq t \\leq 1 \\end{cases}\n\nThus the loop f ∗ g first follows the loop f with \"twice the speed\" and then follows g with \"twice the speed.\" The product of two homotopy classes of loops [f] and [g] is then defined as [f ∗ g], and it can be shown that this product does not depend on the choice of representatives.\n\nWith the above product, the set of all homotopy classes of loops with base point x0 forms the fundamental group of X at the point x0 and is denoted\n\n\\pi_1(X,x_0),\n\nor simply π(X, x0). The identity element is the constant map at the basepoint, and the inverse of a loop f is the loop g defined by g(t) = f(1 − t). That is, g follows f backwards.\n\nAlthough the fundamental group in general depends on the choice of base point, it turns out that, up to isomorphism (actually, even up to inner isomorphism), this choice makes no difference as long as the space X is path-connected. For path-connected spaces, therefore, we can write π1(X) instead of π1(X, x0) without ambiguity whenever we care about the isomorphism class only.\n\nExamples \n\nTrivial fundamental group\n\nIn Euclidean space (Rn) or any convex subset of Rn, there is only one homotopy class of loops, and the fundamental group is therefore the trivial group with one element.  More generally, any contractible space has a trivial fundamental group.  A path-connected space whose fundamental group is trivial is called simply connected.\n\nInfinite cyclic fundamental group\n\nThe circle. Each homotopy class consists of all loops which wind around the circle a given number of times (which can be positive or negative, depending on the direction of winding). The product of a loop which winds around m times and another that winds around n times is a loop which winds around m + n times. So the fundamental group of the circle is isomorphic to (Z, +), the additive group of integers. This fact can be used to give proofs of the Brouwer fixed point theorem and the Borsuk–Ulam theorem in dimension 2.\n\nSince the fundamental group is a homotopy invariant, the theory of the winding number for the complex plane minus one point is the same as for the circle.\n\nIn contrast to the circle, which is the 1-sphere, for every n\\geq 2 the n-sphere is simply-connected, so it has a trivial fundamental group.\n\nFree groups of higher rank\n\nUnlike the homology groups and higher homotopy groups associated to a topological space, the fundamental group need not be abelian. For example, the fundamental group of the figure eight is the free group on two letters. More generally, the fundamental group of any graph is a free group. If the graph G is connected, then the rank of the free group is equal to the number of edges not in a spanning tree.\n\nThe fundamental group of the plane punctured at n points is also the free group with n generators. The i-th generator is the class of the loop that goes around the i-th puncture without going around any other punctures.\n\nKnot theory\n\nA somewhat more sophisticated example of a space with a non-abelian fundamental group is the complement of a trefoil knot in R3, as known, whose fundamental group is the braid group B_3.\n\nLie groups\n\nThe fundamental group of a connected Lie group is always commutative. Exercise 13.7 \n\nThe fundamental group of a compact Lie group can be computed by either of two different methods. The first method (applicable to the compact classical groups) is inductive and relies on the long exact sequence of homotopy groups for fiber bundles. Consider, for example, the case of the special unitary group \\mathrm{SU}(n), with n\\geq 2. This group acts transitively on the unit sphere S^{2n-1} inside \\mathbb C^n=\\mathbb R^{2n}. The stabilizer of a point in the sphere is isomorphic to \\mathrm{SU}(n-1). It then can be shown Proposition 13.8 that SU(n) is a fiber bundle with base S^{2n-1} and fiber \\mathrm{SU}(n-1). Since n\\geq 2, the sphere S^{2n-1} has dimension at least 3. Thus, the first and second homotopy groups of the base are trivial. The long exact sequence then shows that the fundamental groups of the fiber and the total space are isomorphic: That is:\n\\pi_1(\\mathrm{SU}(n))\\cong\\pi_1(\\mathrm{SU}(n-1)). \nSince \\mathrm{SU}(1) is the trivial group (a single point, which is simply connected), we then conclude inductively that \\mathrm{SU}(n) is simply connected for all n. A similar argument shows that \\mathrm{SO}(n) has the same fundamental group for all n\\geq 3, namely \\mathbb Z/2. Proposition 13.10\n\nThe inductive method gives the following results:\n*The special unitary groups \\mathrm{SU}(n) is simply connected for all n;\n*The special orthogonal group \\mathrm{SO}(n) has fundamental group \\mathbb Z/2 for n\\geq 3 and fundamental group \\mathbb Z for n=2;\n*The compact symplectic group \\mathrm{Sp}(n) is simply connected for all n;\n*The unitary group \\mathrm U(n) has fundamental group \\mathbb Z for all n.\n\nThe second method of computing fundamental groups applies to all connected compact Lie groups and uses the machinery of the maximal torus and the associated root system. Specifically, let T be a maximal torus in a connected compact Lie group K, and let \\mathfrak t be the Lie algebra of T. Let \\Gamma\\subset\\mathfrak t denote the kernel of the exponential mapping, and let I denote the set of integer linear combination of coroots. Then the fundamental group of K is isomorphic to the quotient \\Gamma/I. Corollary 13.18 This method shows, for example, that any connected compact Lie group for which the associated root system is of type G_2 is simply connected. Example 13.45 Thus, there is (up to isomorphism) only one connected compact Lie group having Lie algebra of type G_2; this group is simply connected and has trivial center.\n\nThe fundamental group of noncompact Lie groups can be reduced to the compact case. Section 13.3 Thus, for example, the group \\mathrm{SL}(n;\\mathbb C) is simply connected because its maximal compact subgroup \\mathrm{SU}(n) is simply connected.\n\nFunctoriality \n\nIf f : X → Y is a continuous map, x0 ∈ X and y0 ∈ Y with f(x0) = y0, then every loop in X with base point x0 can be composed with f to yield a loop in Y with base point y0. This operation is compatible with the homotopy equivalence relation and with composition of loops. The resulting group homomorphism, called the induced homomorphism, is written as π(f) or, more commonly,\n\nf_* : \\pi_1(X, x_0) \\to \\pi_1(Y,y_0).\n\nThis mapping from continuous maps to group homomorphisms is compatible with composition of maps and identity morphisms. In other words, we have a functor from the category of topological spaces with base point to the category of groups.\n\nIt turns out that this functor cannot distinguish maps which are homotopic relative to the base point: if f, g : X → Y are continuous maps with f(x0) g(x0) \n y0, and f and g are homotopic relative to {x0}, then f∗ = g∗. As a consequence, two homotopy equivalent path-connected spaces have isomorphic fundamental groups:\n\nX \\simeq Y \\Rightarrow \\pi_1(X,x_0) \\cong \\pi_1(Y,y_0).\n\nAs an important special case, if X is path-connected then any two basepoints give isomorphic fundamental groups, with isomorphism given by a choice of path between the given basepoints.\n\nThe fundamental group functor takes products to products and coproducts to coproducts. That is, if X and Y are path connected, then\n\n\\pi_1 (X\\times Y) \\cong \\pi_1(X) \\times \\pi_1(Y)\n\nand if they are also locally contractible, then\n\n\\pi_1 (X\\vee Y) \\cong \\pi_1(X) * \\pi_1(Y).\n\n(In the latter formula, \\vee denotes the wedge sum of topological spaces, and * the free product of groups.) Both formulas generalize to arbitrary products. Furthermore, the latter formula is a special case of the Seifert–van Kampen theorem which states that the fundamental group functor takes pushouts along inclusions to pushouts.\n\nFibrations\n\nA generalization of a product of spaces is given by a fibration,\n\nF \\to E \\to B. \n\nHere the total space E is a sort of \"twisted product\" of the base space B and the fiber F. In general the fundamental groups of B, E and F are terms in a long exact sequence involving higher homotopy groups. When all the spaces are connected, this has the following consequences for the fundamental groups:\n\n* π1(B) and π1(E) are isomorphic if F is simply connected\n* πn+1(B) and πn(F) are isomorphic if E is contractible.\n\nRelationship to first homology group \n\nThe fundamental groups of a topological space X are related to its first singular homology group, because a loop is also a singular 1-cycle. Mapping the homotopy class of each loop at a base point x0 to the homology class of the loop gives a homomorphism from the fundamental group π1(X, x0) to the homology group H1(X). If X is path-connected, then this homomorphism is surjective and its kernel is the commutator subgroup of π1(X, x0), and H1(X) is therefore isomorphic to the abelianization of π1(X, x0). This is a special case of the Hurewicz theorem of algebraic topology.\n\nUniversal covering space\n\nIf X is a topological space that is path connected, locally path connected and locally simply connected, then it has a simply connected universal covering space on which the fundamental group π(X,x0) acts freely by deck transformations with quotient space X.  This space can be constructed analogously to the fundamental group by taking pairs (x, γ), where x is a point in X and γ is a homotopy class of paths from x0 to x and the action of π(X, x0) is by concatenation of paths.  It is uniquely determined as a covering space.\n\nExamples\n\nCircle\n\nThe universal cover of a circle S1 is the line R, we have S1 R/Z. Thus π1(S1,x) \n Z for any base point x.\n\nTorus\n\nBy taking the Cartesian product of two instances of the previous example, we see that the universal cover of a 2-dimensional torus T2 S1 × S1 is the plane R2 and we have T2 \n R2/Z2.  Thus π1(T2,x) = Z2 for any base point x.\n\nSimilarly, the fundamental group of the n-dimensional torus Tn equals Zn.\n\nReal projective spaces\n\nFor n ≥ 1 the real n-dimensional real projective space Pn(R) is obtained by factorizing the n-dimensional sphere Sn by the central symmetry: Pn(R) = Sn/Z2. Since the n-sphere Sn is simply connected for n ≥ 2, we conclude that it is the universal cover of the real projective space.  Thus the fundamental group of Pn(R) is equal to Z2 for any n ≥ 2.\n\nLie groups\n\nLet G be a connected, simply connected compact Lie group, for example the special unitary group SU(n), and let Γ be a finite subgroup of G. Then the homogeneous space X  G/Γ has fundamental group Γ, which acts by right multiplication on the universal covering space G. Among the many variants of this construction, one of the most important is given by locally symmetric spaces X \n Γ\\G/K, where\n\n*G is a non-compact simply connected, connected Lie group (often semisimple),\n*K is a maximal compact subgroup of G\n*  Γ is a discrete countable torsion-free subgroup of G.\n\nIn this case the fundamental group is Γ and the universal covering space G/K is actually contractible (by the Cartan decomposition for Lie groups).\n\nAs an example take G  SL(2, R), K \n SO(2) and Γ any torsion-free congruence subgroup of the modular group SL(2, Z).\n\nFrom the explicit realization, it also follows that the universal covering space of a path connected topological group H is again a path connected topological group G.  Moreover, the covering map is a continuous open homomorphism of G onto H with kernel Γ, a closed discrete normal subgroup of G:\n\n 1 \\to \\Gamma \\to G \\to H \\to 1.\n\nSince G is a connected group with a continuous action by conjugation on a discrete group Γ, it must act trivially, so that Γ has to be a subgroup of the center of G.  In particular π1(H) =  Γ is an abelian group; this can also easily be seen directly without using covering spaces.  The group G is called the universal covering group of H.\n\nAs the universal covering group suggests, there is an analogy between the fundamental group of a topological group and the center of a group; this is elaborated at Lattice of covering groups.\n\nEdge-path group of a simplicial complex\n\nIf X is a connected simplicial complex, an edge-path in X is defined to be a chain of vertices connected by edges in X.  Two edge-paths are said to be edge-equivalent if one can be obtained from the other by successively switching between an edge and the two opposite edges of a triangle in X.  If v is a fixed vertex in X, an edge-loop at v is an edge-path starting and ending at v.  The edge-path group E(X, v) is defined to be the set of edge-equivalence classes of edge-loops at v, with product and inverse defined by concatenation and reversal of edge-loops.\n\nThe edge-path group is naturally isomorphic to π1(|X|, v), the fundamental group of the geometric realisation |X| of X.  Since it depends only on the 2-skeleton X2 of X (i.e. the vertices, edges and triangles of X), the groups π1(|X|,v) and π1(|X2|, v) are isomorphic.\n\nThe edge-path group can be described explicitly in terms of generators and relations.  If T is a maximal spanning tree in the 1-skeleton of X, then E(X, v) is canonically isomorphic to the group with generators (the oriented edge-paths of X not occurring in T) and relations (the edge-equivalences corresponding to triangles in X).  A similar result holds if T is replaced by any simply connected—in particular contractible—subcomplex of X.  This often gives a practical way of computing fundamental groups and can be used to show that every finitely presented group arises as the fundamental group of a finite simplicial complex.  It is also one of the classical methods used for topological surfaces, which are classified by their fundamental groups.\n\nThe universal covering space of a finite connected simplicial complex X can also be described directly as a simplicial complex using edge-paths.  Its vertices are pairs (w,γ) where w is a vertex of X and γ is an edge-equivalence class of paths from v to w.  The k-simplices containing (w,γ) correspond naturally to the k-simplices containing w.  Each new vertex u of the k-simplex gives an edge wu and hence, by concatenation, a new path γu from v to u.  The points (w,γ) and (u, γu) are the vertices of the \"transported\" simplex in the universal covering space.  The edge-path group acts naturally by concatenation, preserving the simplicial structure, and the quotient space is just X.\n\nIt is well known that this method can also be used to compute the fundamental group of an arbitrary topological space.  This was doubtless known to Eduard Čech and Jean Leray and explicitly appeared as a remark in a paper by André Weil;André Weil, On discrete subgroups of Lie groups, Annals of Mathematics 72 (1960), 369-384. various other authors such as L. Calabi, W-T. Wu and N. Berikashvili have also published proofs.  In the simplest case of a compact space X with a finite open covering in which all non-empty finite intersections of open sets in the covering are contractible, the fundamental group can be identified with the edge-path group of the simplicial complex corresponding to the nerve of the covering.\n\nRealizability \n\n*Every group can be realized as the fundamental group of a connected CW-complex of dimension 2 (or higher).  As noted above, though, only free groups can occur as fundamental groups of 1-dimensional CW-complexes (that is, graphs).\n*Every finitely presented group can be realized as the fundamental group of a compact, connected, smooth manifold of dimension 4 (or higher).  But there are severe restrictions on which groups occur as fundamental groups of low-dimensional manifolds.  For example, no free abelian group of rank 4 or higher can be realized as the fundamental group of a manifold of dimension 3 or less. It can be proved that every group can be realized as the fundamental group of a compact Hausdorff space if and only if there is no measurable cardinal.Adam Przezdziecki, Measurable cardinals and fundamental groups of compact spaces, Fundamenta Mathematicae 192 (2006), 87-92 [https://www.impan.pl/en/publishing-house/journals-and-series/fundamenta-mathematicae/all/192/1/89233/measurable-cardinals-and-fundamental-groups-of-compact-spaces]\n\nRelated concepts \n\nThe fundamental group measures the 1-dimensional hole structure of a space.  For studying \"higher-dimensional holes\", the homotopy groups are used. The elements of the n-th homotopy group of X are homotopy classes of (basepoint-preserving) maps from Sn to X.\n\nThe set of loops at a particular base point can be studied without regarding homotopic loops as equivalent.  This larger object is the loop space.\n\nFor topological groups, a different group multiplication may be assigned to the set of loops in the space, with pointwise multiplication rather than concatenation.  The resulting group is the loop group.\n\nFundamental groupoid\n\nIt is convenient to consider a path in a space X as given by a map  f : [0,r] \\to X where  r \\geqslant 0; then  f(0), f(r) are called the initial and final points of the path and  r  is also called the length of f. If also  g:[0,s] \\to X is a path such that  f(r)=g(0) then we can define a path  f\\circ g: [0,r+s] \\to X to be  f on [0,r]  and t \\mapsto  g(t-r) on  [r,r+s]. This composition makes these paths in X into a category. (In texts, this definition may be found in the books by Crowell and Fox, and by R. Brown, listed below.)\n\nThere are at least two ways of taking homotopy classes of such paths relative to the end points. Crowell and Fox use a continuous change of the length, while Topology and Groupoids uses paths f: [0,r] \\to X, g:[0,s] \\to X with the same initial and final points are equivalent if there are real numbers u,v \\geqslant 0 such that r+u=s+v and  f \\circ u, g \\circ v : [0,r+u] \\to X are homotopic rel end points. Here  f \\circ u is the path f extended by the constant u.\n\nThis construction yields not a group but a groupoid, the fundamental groupoid of the space.\n\nMore generally, one can consider the fundamental groupoid on a set A of base points, chosen according to the geometry of the situation; for example, in the case of the circle, which can be represented as the union of two connected open sets whose intersection has two components, one can choose one base point in each component.  The exposition of this theory was given in the 1968, 1988 editions of the book now available as Topology and groupoids, which also includes related accounts of covering spaces and orbit spaces.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fundamental group" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11004" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In the mathematical  field of algebraic topology, the fundamental group is a mathematical group associated to any given pointed topological space that provides a way to determine when two paths, starting and ending at a fixed base point, can be continuously deformed into each other. It records information about the basic shape, or holes, of the topological space. The fundamental group is the first and simplest homotopy group. The fundamental group is a topological invariant: homeomorphic topological spaces have the same fundamental group.\n\nFundamental groups can be studied using the theory of covering spaces, since a fundamental group coincides with the group of deck transformations of the associated universal covering space. The abelianization of the fundamental group can be identified with the first homology group of the space. When the topological space is homeomorphic to a simplicial complex, its fundamental group can be described explicitly in terms of generators and relations.\n\nHenri Poincaré defined the fundamental group in 1895 in his paper \"Analysis situs\". Translated in  The concept emerged in the theory of Riemann surfaces, in the work of Bernhard Riemann, Poincaré, and Felix Klein. It describes the monodromy properties of complex-valued functions, as well as providing a complete topological classification of closed surfaces.\n\nIntuition \n\nStart with a space (e.g. a surface), and some point in it, and all the loops both starting and ending at this point — paths that start at this point, wander around and eventually return to the starting point. Two loops can be combined together in an obvious way: travel along the first loop, then along the second.\nTwo loops are considered equivalent if one can be deformed into the other without breaking. The set of all such loops with this method of combining and this equivalence between them is the fundamental group for that particular space.\n\nDefinition\n\nLet X be a topological space, and let x0 be a point of X. We are interested in the following set of continuous functions called loops with base point x0.\n\n\\{f:[0,1]\\to X : \\ f(0)x_0\nf(1)\\}\n\nNow the fundamental group of X with base point x0 is this set modulo homotopy h\n\n\\{f:[0,1]\\to X : \\ f(0)x_0\nf(1)\\} / h\n\nequipped with the group multiplication defined by\n\n (f * g) (t) = \\begin{cases} f(2t) & 0 \\leq t \\leq \\tfrac{1}{2} \\\\ g(2t-1) & \\tfrac{1}{2} \\leq t \\leq 1 \\end{cases}\n\nThus the loop f ∗ g first follows the loop f with \"twice the speed\" and then follows g with \"twice the speed.\" The product of two homotopy classes of loops [f] and [g] is then defined as [f ∗ g], and it can be shown that this product does not depend on the choice of representatives.\n\nWith the above product, the set of all homotopy classes of loops with base point x0 forms the fundamental group of X at the point x0 and is denoted\n\n\\pi_1(X,x_0),\n\nor simply π(X, x0). The identity element is the constant map at the basepoint, and the inverse of a loop f is the loop g defined by g(t) = f(1 − t). That is, g follows f backwards.\n\nAlthough the fundamental group in general depends on the choice of base point, it turns out that, up to isomorphism (actually, even up to inner isomorphism), this choice makes no difference as long as the space X is path-connected. For path-connected spaces, therefore, we can write π1(X) instead of π1(X, x0) without ambiguity whenever we care about the isomorphism class only.\n\nExamples \n\nTrivial fundamental group\n\nIn Euclidean space (Rn) or any convex subset of Rn, there is only one homotopy class of loops, and the fundamental group is therefore the trivial group with one element.  More generally, any contractible space has a trivial fundamental group.  A path-connected space whose fundamental group is trivial is called simply connected.\n\nInfinite cyclic fundamental group\n\nThe circle. Each homotopy class consists of all loops which wind around the circle a given number of times (which can be positive or negative, depending on the direction of winding). The product of a loop which winds around m times and another that winds around n times is a loop which winds around m + n times. So the fundamental group of the circle is isomorphic to (Z, +), the additive group of integers. This fact can be used to give proofs of the Brouwer fixed point theorem and the Borsuk–Ulam theorem in dimension 2.\n\nSince the fundamental group is a homotopy invariant, the theory of the winding number for the complex plane minus one point is the same as for the circle.\n\nIn contrast to the circle, which is the 1-sphere, for every n\\geq 2 the n-sphere is simply-connected, so it has a trivial fundamental group.\n\nFree groups of higher rank\n\nUnlike the homology groups and higher homotopy groups associated to a topological space, the fundamental group need not be abelian. For example, the fundamental group of the figure eight is the free group on two letters. More generally, the fundamental group of any graph is a free group. If the graph G is connected, then the rank of the free group is equal to the number of edges not in a spanning tree.\n\nThe fundamental group of the plane punctured at n points is also the free group with n generators. The i-th generator is the class of the loop that goes around the i-th puncture without going around any other punctures.\n\nKnot theory\n\nA somewhat more sophisticated example of a space with a non-abelian fundamental group is the complement of a trefoil knot in R3, as known, whose fundamental group is the braid group B_3.\n\nLie groups\n\nThe fundamental group of a connected Lie group is always commutative. Exercise 13.7 \n\nThe fundamental group of a compact Lie group can be computed by either of two different methods. The first method (applicable to the compact classical groups) is inductive and relies on the long exact sequence of homotopy groups for fiber bundles. Consider, for example, the case of the special unitary group \\mathrm{SU}(n), with n\\geq 2. This group acts transitively on the unit sphere S^{2n-1} inside \\mathbb C^n=\\mathbb R^{2n}. The stabilizer of a point in the sphere is isomorphic to \\mathrm{SU}(n-1). It then can be shown Proposition 13.8 that SU(n) is a fiber bundle with base S^{2n-1} and fiber \\mathrm{SU}(n-1). Since n\\geq 2, the sphere S^{2n-1} has dimension at least 3. Thus, the first and second homotopy groups of the base are trivial. The long exact sequence then shows that the fundamental groups of the fiber and the total space are isomorphic: That is:\n\\pi_1(\\mathrm{SU}(n))\\cong\\pi_1(\\mathrm{SU}(n-1)). \nSince \\mathrm{SU}(1) is the trivial group (a single point, which is simply connected), we then conclude inductively that \\mathrm{SU}(n) is simply connected for all n. A similar argument shows that \\mathrm{SO}(n) has the same fundamental group for all n\\geq 3, namely \\mathbb Z/2. Proposition 13.10\n\nThe inductive method gives the following results:\n*The special unitary groups \\mathrm{SU}(n) is simply connected for all n;\n*The special orthogonal group \\mathrm{SO}(n) has fundamental group \\mathbb Z/2 for n\\geq 3 and fundamental group \\mathbb Z for n=2;\n*The compact symplectic group \\mathrm{Sp}(n) is simply connected for all n;\n*The unitary group \\mathrm U(n) has fundamental group \\mathbb Z for all n.\n\nThe second method of computing fundamental groups applies to all connected compact Lie groups and uses the machinery of the maximal torus and the associated root system. Specifically, let T be a maximal torus in a connected compact Lie group K, and let \\mathfrak t be the Lie algebra of T. Let \\Gamma\\subset\\mathfrak t denote the kernel of the exponential mapping, and let I denote the set of integer linear combination of coroots. Then the fundamental group of K is isomorphic to the quotient \\Gamma/I. Corollary 13.18 This method shows, for example, that any connected compact Lie group for which the associated root system is of type G_2 is simply connected. Example 13.45 Thus, there is (up to isomorphism) only one connected compact Lie group having Lie algebra of type G_2; this group is simply connected and has trivial center.\n\nThe fundamental group of noncompact Lie groups can be reduced to the compact case. Section 13.3 Thus, for example, the group \\mathrm{SL}(n;\\mathbb C) is simply connected because its maximal compact subgroup \\mathrm{SU}(n) is simply connected.\n\nFunctoriality \n\nIf f : X → Y is a continuous map, x0 ∈ X and y0 ∈ Y with f(x0) = y0, then every loop in X with base point x0 can be composed with f to yield a loop in Y with base point y0. This operation is compatible with the homotopy equivalence relation and with composition of loops. The resulting group homomorphism, called the induced homomorphism, is written as π(f) or, more commonly,\n\nf_* : \\pi_1(X, x_0) \\to \\pi_1(Y,y_0).\n\nThis mapping from continuous maps to group homomorphisms is compatible with composition of maps and identity morphisms. In other words, we have a functor from the category of topological spaces with base point to the category of groups.\n\nIt turns out that this functor cannot distinguish maps which are homotopic relative to the base point: if f, g : X → Y are continuous maps with f(x0) g(x0) \n y0, and f and g are homotopic relative to {x0}, then f∗ = g∗. As a consequence, two homotopy equivalent path-connected spaces have isomorphic fundamental groups:\n\nX \\simeq Y \\Rightarrow \\pi_1(X,x_0) \\cong \\pi_1(Y,y_0).\n\nAs an important special case, if X is path-connected then any two basepoints give isomorphic fundamental groups, with isomorphism given by a choice of path between the given basepoints.\n\nThe fundamental group functor takes products to products and coproducts to coproducts. That is, if X and Y are path connected, then\n\n\\pi_1 (X\\times Y) \\cong \\pi_1(X) \\times \\pi_1(Y)\n\nand if they are also locally contractible, then\n\n\\pi_1 (X\\vee Y) \\cong \\pi_1(X) * \\pi_1(Y).\n\n(In the latter formula, \\vee denotes the wedge sum of topological spaces, and * the free product of groups.) Both formulas generalize to arbitrary products. Furthermore, the latter formula is a special case of the Seifert–van Kampen theorem which states that the fundamental group functor takes pushouts along inclusions to pushouts.\n\nFibrations\n\nA generalization of a product of spaces is given by a fibration,\n\nF \\to E \\to B. \n\nHere the total space E is a sort of \"twisted product\" of the base space B and the fiber F. In general the fundamental groups of B, E and F are terms in a long exact sequence involving higher homotopy groups. When all the spaces are connected, this has the following consequences for the fundamental groups:\n\n* π1(B) and π1(E) are isomorphic if F is simply connected\n* πn+1(B) and πn(F) are isomorphic if E is contractible.\n\nRelationship to first homology group \n\nThe fundamental groups of a topological space X are related to its first singular homology group, because a loop is also a singular 1-cycle. Mapping the homotopy class of each loop at a base point x0 to the homology class of the loop gives a homomorphism from the fundamental group π1(X, x0) to the homology group H1(X). If X is path-connected, then this homomorphism is surjective and its kernel is the commutator subgroup of π1(X, x0), and H1(X) is therefore isomorphic to the abelianization of π1(X, x0). This is a special case of the Hurewicz theorem of algebraic topology.\n\nUniversal covering space\n\nIf X is a topological space that is path connected, locally path connected and locally simply connected, then it has a simply connected universal covering space on which the fundamental group π(X,x0) acts freely by deck transformations with quotient space X.  This space can be constructed analogously to the fundamental group by taking pairs (x, γ), where x is a point in X and γ is a homotopy class of paths from x0 to x and the action of π(X, x0) is by concatenation of paths.  It is uniquely determined as a covering space.\n\nExamples\n\nCircle\n\nThe universal cover of a circle S1 is the line R, we have S1 R/Z. Thus π1(S1,x) \n Z for any base point x.\n\nTorus\n\nBy taking the Cartesian product of two instances of the previous example, we see that the universal cover of a 2-dimensional torus T2 S1 × S1 is the plane R2 and we have T2 \n R2/Z2.  Thus π1(T2,x) = Z2 for any base point x.\n\nSimilarly, the fundamental group of the n-dimensional torus Tn equals Zn.\n\nReal projective spaces\n\nFor n ≥ 1 the real n-dimensional real projective space Pn(R) is obtained by factorizing the n-dimensional sphere Sn by the central symmetry: Pn(R) = Sn/Z2. Since the n-sphere Sn is simply connected for n ≥ 2, we conclude that it is the universal cover of the real projective space.  Thus the fundamental group of Pn(R) is equal to Z2 for any n ≥ 2.\n\nLie groups\n\nLet G be a connected, simply connected compact Lie group, for example the special unitary group SU(n), and let Γ be a finite subgroup of G. Then the homogeneous space X  G/Γ has fundamental group Γ, which acts by right multiplication on the universal covering space G. Among the many variants of this construction, one of the most important is given by locally symmetric spaces X \n Γ\\G/K, where\n\n*G is a non-compact simply connected, connected Lie group (often semisimple),\n*K is a maximal compact subgroup of G\n*  Γ is a discrete countable torsion-free subgroup of G.\n\nIn this case the fundamental group is Γ and the universal covering space G/K is actually contractible (by the Cartan decomposition for Lie groups).\n\nAs an example take G  SL(2, R), K \n SO(2) and Γ any torsion-free congruence subgroup of the modular group SL(2, Z).\n\nFrom the explicit realization, it also follows that the universal covering space of a path connected topological group H is again a path connected topological group G.  Moreover, the covering map is a continuous open homomorphism of G onto H with kernel Γ, a closed discrete normal subgroup of G:\n\n 1 \\to \\Gamma \\to G \\to H \\to 1.\n\nSince G is a connected group with a continuous action by conjugation on a discrete group Γ, it must act trivially, so that Γ has to be a subgroup of the center of G.  In particular π1(H) =  Γ is an abelian group; this can also easily be seen directly without using covering spaces.  The group G is called the universal covering group of H.\n\nAs the universal covering group suggests, there is an analogy between the fundamental group of a topological group and the center of a group; this is elaborated at Lattice of covering groups.\n\nEdge-path group of a simplicial complex\n\nIf X is a connected simplicial complex, an edge-path in X is defined to be a chain of vertices connected by edges in X.  Two edge-paths are said to be edge-equivalent if one can be obtained from the other by successively switching between an edge and the two opposite edges of a triangle in X.  If v is a fixed vertex in X, an edge-loop at v is an edge-path starting and ending at v.  The edge-path group E(X, v) is defined to be the set of edge-equivalence classes of edge-loops at v, with product and inverse defined by concatenation and reversal of edge-loops.\n\nThe edge-path group is naturally isomorphic to π1(|X|, v), the fundamental group of the geometric realisation |X| of X.  Since it depends only on the 2-skeleton X2 of X (i.e. the vertices, edges and triangles of X), the groups π1(|X|,v) and π1(|X2|, v) are isomorphic.\n\nThe edge-path group can be described explicitly in terms of generators and relations.  If T is a maximal spanning tree in the 1-skeleton of X, then E(X, v) is canonically isomorphic to the group with generators (the oriented edge-paths of X not occurring in T) and relations (the edge-equivalences corresponding to triangles in X).  A similar result holds if T is replaced by any simply connected—in particular contractible—subcomplex of X.  This often gives a practical way of computing fundamental groups and can be used to show that every finitely presented group arises as the fundamental group of a finite simplicial complex.  It is also one of the classical methods used for topological surfaces, which are classified by their fundamental groups.\n\nThe universal covering space of a finite connected simplicial complex X can also be described directly as a simplicial complex using edge-paths.  Its vertices are pairs (w,γ) where w is a vertex of X and γ is an edge-equivalence class of paths from v to w.  The k-simplices containing (w,γ) correspond naturally to the k-simplices containing w.  Each new vertex u of the k-simplex gives an edge wu and hence, by concatenation, a new path γu from v to u.  The points (w,γ) and (u, γu) are the vertices of the \"transported\" simplex in the universal covering space.  The edge-path group acts naturally by concatenation, preserving the simplicial structure, and the quotient space is just X.\n\nIt is well known that this method can also be used to compute the fundamental group of an arbitrary topological space.  This was doubtless known to Eduard Čech and Jean Leray and explicitly appeared as a remark in a paper by André Weil;André Weil, On discrete subgroups of Lie groups, Annals of Mathematics 72 (1960), 369-384. various other authors such as L. Calabi, W-T. Wu and N. Berikashvili have also published proofs.  In the simplest case of a compact space X with a finite open covering in which all non-empty finite intersections of open sets in the covering are contractible, the fundamental group can be identified with the edge-path group of the simplicial complex corresponding to the nerve of the covering.\n\nRealizability \n\n*Every group can be realized as the fundamental group of a connected CW-complex of dimension 2 (or higher).  As noted above, though, only free groups can occur as fundamental groups of 1-dimensional CW-complexes (that is, graphs).\n*Every finitely presented group can be realized as the fundamental group of a compact, connected, smooth manifold of dimension 4 (or higher).  But there are severe restrictions on which groups occur as fundamental groups of low-dimensional manifolds.  For example, no free abelian group of rank 4 or higher can be realized as the fundamental group of a manifold of dimension 3 or less. It can be proved that every group can be realized as the fundamental group of a compact Hausdorff space if and only if there is no measurable cardinal.Adam Przezdziecki, Measurable cardinals and fundamental groups of compact spaces, Fundamenta Mathematicae 192 (2006), 87-92 [https://www.impan.pl/en/publishing-house/journals-and-series/fundamenta-mathematicae/all/192/1/89233/measurable-cardinals-and-fundamental-groups-of-compact-spaces]\n\nRelated concepts \n\nThe fundamental group measures the 1-dimensional hole structure of a space.  For studying \"higher-dimensional holes\", the homotopy groups are used. The elements of the n-th homotopy group of X are homotopy classes of (basepoint-preserving) maps from Sn to X.\n\nThe set of loops at a particular base point can be studied without regarding homotopic loops as equivalent.  This larger object is the loop space.\n\nFor topological groups, a different group multiplication may be assigned to the set of loops in the space, with pointwise multiplication rather than concatenation.  The resulting group is the loop group.\n\nFundamental groupoid\n\nIt is convenient to consider a path in a space X as given by a map  f : [0,r] \\to X where  r \\geqslant 0; then  f(0), f(r) are called the initial and final points of the path and  r  is also called the length of f. If also  g:[0,s] \\to X is a path such that  f(r)=g(0) then we can define a path  f\\circ g: [0,r+s] \\to X to be  f on [0,r]  and t \\mapsto  g(t-r) on  [r,r+s]. This composition makes these paths in X into a category. (In texts, this definition may be found in the books by Crowell and Fox, and by R. Brown, listed below.)\n\nThere are at least two ways of taking homotopy classes of such paths relative to the end points. Crowell and Fox use a continuous change of the length, while Topology and Groupoids uses paths f: [0,r] \\to X, g:[0,s] \\to X with the same initial and final points are equivalent if there are real numbers u,v \\geqslant 0 such that r+u=s+v and  f \\circ u, g \\circ v : [0,r+u] \\to X are homotopic rel end points. Here  f \\circ u is the path f extended by the constant u.\n\nThis construction yields not a group but a groupoid, the fundamental groupoid of the space.\n\nMore generally, one can consider the fundamental groupoid on a set A of base points, chosen according to the geometry of the situation; for example, in the case of the circle, which can be represented as the union of two connected open sets whose intersection has two components, one can choose one base point in each component.  The exposition of this theory was given in the 1968, 1988 editions of the book now available as Topology and groupoids, which also includes related accounts of covering spaces and orbit spaces. Fundamental group. http://en.wikipedia.org/?curid=11004."
  }
}
