{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8970",
  "eid" : "ebd3dea0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778475402,
  "textBody" : "A diplomatic mission or foreign mission is a group of people from one state or an organisation present in another state to represent the sending state/organisation officially in the receiving state. In practice, a diplomatic mission usually denotes the resident mission, namely the embassy, which is the main office of a country's diplomatic representatives in the capital city of another country, whereas consulates are smaller diplomatic missions which are normally located outside the capital of the receiving state (but can be located in the capital, usually when the sending country has no embassy in the receiving state). As well as being a diplomatic mission to the country in which it is situated, it may also be a non-resident permanent mission to one or more other countries. There are thus resident and non-resident embassies.[https://books.google.com/books?idTdSOAAAAMAAJ&q\n%22diplomatic+mission%22+-wikipedia+%22non-resident%22&dq%22diplomatic+mission%22+-wikipedia+%22non-resident%22&hl\nen&eiBIlvTbTLGIeZhQeHgIlQ&sa\nX&oibook_result&ct\nresult&resnum3&ved\n0CDQQ6AEwAjgo Tom Nierop, Systems and Regions in Global Politics] (Wiley, John and Sons 1994 ), p. 67.\"The Russian Federation has diplomatic relations with a total of 187 countries, but some of them – mainly for financial reasons – maintain non-resident embassies in other countries\", [https://books.google.com/books?id87e5AAAAIAAJ&q\n%22diplomatic+mission%22+-wikipedia+%22non-resident%22&dq%22diplomatic+mission%22+-wikipedia+%22non-resident%22&hl\nen&eizrNuTaCUKMiHhQe6kOk-&sa\nX&oibook_result&ct\nresult&resnum6&ved\n0CEAQ6AEwBTge International Affairs], issues 4–6 (Znanye Pub. House, 2006), p. 78\"Of Chile's 109 foreign diplomatic missions in 1988, no fewer than 31 were on a non-residential basis, while 17 of the 63 missions in Santiago were non resident\" ([https://books.google.com/books?iddVmhhVHvTAMC&pg\nPA158 Deon Geldenhuys, Isolated States: A Comparative Analysis] (University of Cambridge 1990 ), p. 158).\"America's diplomatic mission to (Saudi Arabia) was changed from non-resident to permanent Minister in Jeddah\" ([https://books.google.com/books?idHFjzPLwrQuUC&pg\nPT239 Fahad M. Al-Nafjan, The Origins of Saudi-American Relations], page not numbered).\n\nNaming\n\nA permanent diplomatic mission is typically known as an embassy, and the head of the mission is known as an ambassador, or high commissioner. The term \"embassy\" is commonly used also as a section of a building in which the work of the diplomatic mission is carried out, but, strictly speaking, it is the diplomatic delegation itself that is the embassy, while the office space and the diplomatic work done is called the Chancery. Therefore, the Embassy operates in the Chancery.\n\nThe members of a diplomatic mission can reside within or outside the building that holds the mission's chancery, and their private residences enjoy the same rights as the premises of the mission as regards inviolability and protection. \n\nAll missions to the United Nations are known simply as permanent missions, while EU Member States' missions to the European Union are known as permanent representations and the head of such a mission is typically both a permanent representative and an ambassador. European Union missions abroad are known as EU delegations. Some countries have more particular naming for their missions and staff: a Vatican mission is headed by a nuncio (Latin \"envoy\") and consequently known as an apostolic nunciature. Under the rule of Muammar Gaddafi, Libya's missions used the name \"people's bureau\" and the head of the mission was a secretary.\n\nMissions between Commonwealth countries are known as high commissions and their heads are high commissioners. This is because ambassadors are exchanged between foreign countries, but since the beginning of the Commonwealth, member countries have nominally maintained that they are not foreign to one another (the same reason as the naming of the Foreign and Commonwealth Office). An ambassador represents one head of state to another and an ambassador's letters of credence are addressed by one head of state to another. Until India became a republic on 26 January 1950, all members of the Commonwealth had the same head of state, making the appointment of ambassadors between them impossible. The senior representative of a Commonwealth country to another was therefore called a high commissioner, accredited not to the head of state but to the government of the receiving country, but at the same time considered the equivalent of an ambassador. Still today, even if two Commonwealth countries have distinct heads of state (Presidents), each one's senior diplomatic representative to the other continues to be called a high commissioner, whether he or she represents a sending government or a sending head of state.[https://books.google.com/books?id\nrbzDTyinZNIC&pg=PA426 Ivor Roberts (editor), Satow's Diplomatic Practice] (Oxford University Press 2009 ), p. 426\n\nIn the past a diplomatic mission headed by a lower-ranking official (an envoy or minister resident) was known as a legation. Since the ranks of envoy and minister resident are effectively obsolete, the designation of legation is no longer used today. (See diplomatic rank.)\n\nA consulate is similar to, but not the same as a diplomatic office, but with focus on dealing with individual persons and businesses, as defined by the Vienna Convention on Consular Relations. A consulate or consulate general is generally a representative of the embassy in locales outside of the capital city. For instance, the United Kingdom has its Embassy of the United Kingdom in Washington, D.C., but also maintains seven consulates-general and four consulates elsewhere in the US. The person in charge of a consulate or consulate-general is known as a consul or consul-general, respectively. Similar services may also be provided at the embassy (to serve the region of the capital) in what is normally called a consular section.\n\nIn cases of dispute, it is common for a country to recall its head of mission as a sign of its displeasure.  This is less drastic than cutting diplomatic relations completely, and the mission will still continue operating more or less normally, but it will now be headed by a chargé d'affaires (usually the deputy chief of mission) who may have limited powers. A chargé d'affaires ad interim also heads the mission during the interim between the end of one chief of mission's term and the beginning of another.\n\nExtraterritoriality\n\nContrary to popular belief, most diplomatic missions do not enjoy full extraterritorial status and in those cases are not sovereign territory of the represented state.'[http://integrity-legal.com/legal-blog/miscellaneous/laws-and-rules-regarding-extraterritoriality/ Laws and Rules Regarding Extraterritoriality]' on integrity-legal.com: \"There is a common misconception that Embassies and Consulates have extraterritoriality. As anecdotal evidence of this misconception, people will often say things like, 'the US Embassy sits upon United States soil.' For the most part, this is not the case as extraterritoriality is not conferred upon an Embassy or Consulate, but in some situations extraterritoriality may be created by Treaty\".  Rather, the premises of diplomatic missions usually remain under the jurisdiction of the host state while being afforded special privileges (such as immunity from most local laws) by the Vienna Convention on Diplomatic Relations.  Diplomats themselves still retain full diplomatic immunity, and (as an adherent to the Vienna Convention) the host country may not enter the premises of the mission without permission of the represented country, even to put out a fire.  International rules designate an attack on an embassy as an attack on the country it represents.  The term \"extraterritoriality\" is often applied to diplomatic missions, but normally only in this broader sense.\n\nAs the host country may not enter the representing country's embassy without permission, embassies are sometimes used by refugees escaping from either the host country or a third country.  For example, North Korean nationals, who would be arrested and deported from China upon discovery, have sought sanctuary at various third-country embassies in China. Once inside the embassy, diplomatic channels can be used to solve the issue and send the refugees to another country. See the List of people who took refuge in a diplomatic mission for a list of some notable cases.\n\nNotable violations of embassy extraterritoriality include repeated invasions of the British Embassy, Beijing (1967), the Iran hostage crisis (1979–1981), and the Japanese embassy hostage crisis at the ambassador's residence in Lima, Peru (1996).\n\nRole\n\nThe Vienna Convention states:The functions of a diplomatic mission consist, inter alia, in representing the sending State in the receiving State; protecting in the receiving State the interests of the sending State and of its nationals, within the limits permitted by international law; negotiating with the Government of the receiving State; ascertaining by all lawful means conditions and developments in the receiving State, and reporting thereon to the Government of the sending State; promoting friendly relations between the sending State and the receiving State, and developing their economic, cultural and scientific relations.\n\nBetween members of the Commonwealth of Nations their diplomatic missions are not called Embassies, but High Commissions, as Commonwealth nations share a special diplomatic relationship. It is generally expected that an embassy of a Commonwealth country in a non-Commonwealth country will do its best to provide diplomatic services to citizens from other Commonwealth countries if the citizen's country does not have an embassy in that country. Canadian and Australian nationals enjoy even greater cooperation between their respective consular services, as outlined in Canada-Australia Consular Services Sharing Agreement. The same kind of procedure is also followed multilaterally by the member states of the European Union (EU). European citizens in need of consular help in a country without diplomatic or consular representation of their own country may turn to any consular or diplomatic mission of another EU member state.\n\nThe rights and immunities (such as diplomatic immunity) of diplomatic missions are codified in the Vienna Convention on Diplomatic Relations.\n\nMultiple missions in a city\n\nSome cities may host more than one mission from the same country.  An example is Rome, where many states maintain missions to Italy and another to the Holy See.  It is not customary for these missions to share premises nor diplomatic personnel. At present, only the Iraqi missions to Italy and the Holy See share premises; however, two ambassadors are appointed, one to each country. In the case of the UN's Food Agencies, the Head of Mission to the Italian Republic is usually accredited as Permanent Representative. The United States maintains a separate United States Mission to the UN Agencies in Rome whose head is the United States Ambassador to the United Nations Agencies for Food and Agriculture. Kolkata, India hosts two Bangladeshi Deputy High Commissions, one at Park Circus and another at Mirza Galib Street. This was done to reduce overcrowding inside the Deputy High Commission. At first the Park Circus was opened and later, the one at Mirza Galib Street. Now both the Deputy High Commissions issue Bangladeshi visa.\n\nNon-diplomatic offices\n\nGovernments of states not recognized by the receiving state and of territories that make no claim to be sovereign states may set up offices abroad that do not have official diplomatic status as defined by the Vienna Convention. Examples are the Taipei Economic and Cultural Representative Offices that represent the government of the Republic of China, Somaliland's Representative Offices in London, Addis Ababa, Rome, and Washington, D.C. and the Hong Kong Economic and Trade Offices that represent the government of that territory. Such offices assume some of the non-diplomatic functions of diplomatic posts, such as promoting trade interests and providing assistance to its citizens and residents. They are nevertheless not diplomatic missions, their personnel are not diplomats and do not have diplomatic visas, although there may be legislation providing for personal immunities and tax privileges, as in the case of the Hong Kong offices in London and Toronto, for example.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Diplomatic mission" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8970" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A diplomatic mission or foreign mission is a group of people from one state or an organisation present in another state to represent the sending state/organisation officially in the receiving state. In practice, a diplomatic mission usually denotes the resident mission, namely the embassy, which is the main office of a country's diplomatic representatives in the capital city of another country, whereas consulates are smaller diplomatic missions which are normally located outside the capital of the receiving state (but can be located in the capital, usually when the sending country has no embassy in the receiving state). As well as being a diplomatic mission to the country in which it is situated, it may also be a non-resident permanent mission to one or more other countries. There are thus resident and non-resident embassies.[https://books.google.com/books?idTdSOAAAAMAAJ&q\n%22diplomatic+mission%22+-wikipedia+%22non-resident%22&dq%22diplomatic+mission%22+-wikipedia+%22non-resident%22&hl\nen&eiBIlvTbTLGIeZhQeHgIlQ&sa\nX&oibook_result&ct\nresult&resnum3&ved\n0CDQQ6AEwAjgo Tom Nierop, Systems and Regions in Global Politics] (Wiley, John and Sons 1994 ), p. 67.\"The Russian Federation has diplomatic relations with a total of 187 countries, but some of them – mainly for financial reasons – maintain non-resident embassies in other countries\", [https://books.google.com/books?id87e5AAAAIAAJ&q\n%22diplomatic+mission%22+-wikipedia+%22non-resident%22&dq%22diplomatic+mission%22+-wikipedia+%22non-resident%22&hl\nen&eizrNuTaCUKMiHhQe6kOk-&sa\nX&oibook_result&ct\nresult&resnum6&ved\n0CEAQ6AEwBTge International Affairs], issues 4–6 (Znanye Pub. House, 2006), p. 78\"Of Chile's 109 foreign diplomatic missions in 1988, no fewer than 31 were on a non-residential basis, while 17 of the 63 missions in Santiago were non resident\" ([https://books.google.com/books?iddVmhhVHvTAMC&pg\nPA158 Deon Geldenhuys, Isolated States: A Comparative Analysis] (University of Cambridge 1990 ), p. 158).\"America's diplomatic mission to (Saudi Arabia) was changed from non-resident to permanent Minister in Jeddah\" ([https://books.google.com/books?idHFjzPLwrQuUC&pg\nPT239 Fahad M. Al-Nafjan, The Origins of Saudi-American Relations], page not numbered).\n\nNaming\n\nA permanent diplomatic mission is typically known as an embassy, and the head of the mission is known as an ambassador, or high commissioner. The term \"embassy\" is commonly used also as a section of a building in which the work of the diplomatic mission is carried out, but, strictly speaking, it is the diplomatic delegation itself that is the embassy, while the office space and the diplomatic work done is called the Chancery. Therefore, the Embassy operates in the Chancery.\n\nThe members of a diplomatic mission can reside within or outside the building that holds the mission's chancery, and their private residences enjoy the same rights as the premises of the mission as regards inviolability and protection. \n\nAll missions to the United Nations are known simply as permanent missions, while EU Member States' missions to the European Union are known as permanent representations and the head of such a mission is typically both a permanent representative and an ambassador. European Union missions abroad are known as EU delegations. Some countries have more particular naming for their missions and staff: a Vatican mission is headed by a nuncio (Latin \"envoy\") and consequently known as an apostolic nunciature. Under the rule of Muammar Gaddafi, Libya's missions used the name \"people's bureau\" and the head of the mission was a secretary.\n\nMissions between Commonwealth countries are known as high commissions and their heads are high commissioners. This is because ambassadors are exchanged between foreign countries, but since the beginning of the Commonwealth, member countries have nominally maintained that they are not foreign to one another (the same reason as the naming of the Foreign and Commonwealth Office). An ambassador represents one head of state to another and an ambassador's letters of credence are addressed by one head of state to another. Until India became a republic on 26 January 1950, all members of the Commonwealth had the same head of state, making the appointment of ambassadors between them impossible. The senior representative of a Commonwealth country to another was therefore called a high commissioner, accredited not to the head of state but to the government of the receiving country, but at the same time considered the equivalent of an ambassador. Still today, even if two Commonwealth countries have distinct heads of state (Presidents), each one's senior diplomatic representative to the other continues to be called a high commissioner, whether he or she represents a sending government or a sending head of state.[https://books.google.com/books?id\nrbzDTyinZNIC&pg=PA426 Ivor Roberts (editor), Satow's Diplomatic Practice] (Oxford University Press 2009 ), p. 426\n\nIn the past a diplomatic mission headed by a lower-ranking official (an envoy or minister resident) was known as a legation. Since the ranks of envoy and minister resident are effectively obsolete, the designation of legation is no longer used today. (See diplomatic rank.)\n\nA consulate is similar to, but not the same as a diplomatic office, but with focus on dealing with individual persons and businesses, as defined by the Vienna Convention on Consular Relations. A consulate or consulate general is generally a representative of the embassy in locales outside of the capital city. For instance, the United Kingdom has its Embassy of the United Kingdom in Washington, D.C., but also maintains seven consulates-general and four consulates elsewhere in the US. The person in charge of a consulate or consulate-general is known as a consul or consul-general, respectively. Similar services may also be provided at the embassy (to serve the region of the capital) in what is normally called a consular section.\n\nIn cases of dispute, it is common for a country to recall its head of mission as a sign of its displeasure.  This is less drastic than cutting diplomatic relations completely, and the mission will still continue operating more or less normally, but it will now be headed by a chargé d'affaires (usually the deputy chief of mission) who may have limited powers. A chargé d'affaires ad interim also heads the mission during the interim between the end of one chief of mission's term and the beginning of another.\n\nExtraterritoriality\n\nContrary to popular belief, most diplomatic missions do not enjoy full extraterritorial status and in those cases are not sovereign territory of the represented state.'[http://integrity-legal.com/legal-blog/miscellaneous/laws-and-rules-regarding-extraterritoriality/ Laws and Rules Regarding Extraterritoriality]' on integrity-legal.com: \"There is a common misconception that Embassies and Consulates have extraterritoriality. As anecdotal evidence of this misconception, people will often say things like, 'the US Embassy sits upon United States soil.' For the most part, this is not the case as extraterritoriality is not conferred upon an Embassy or Consulate, but in some situations extraterritoriality may be created by Treaty\".  Rather, the premises of diplomatic missions usually remain under the jurisdiction of the host state while being afforded special privileges (such as immunity from most local laws) by the Vienna Convention on Diplomatic Relations.  Diplomats themselves still retain full diplomatic immunity, and (as an adherent to the Vienna Convention) the host country may not enter the premises of the mission without permission of the represented country, even to put out a fire.  International rules designate an attack on an embassy as an attack on the country it represents.  The term \"extraterritoriality\" is often applied to diplomatic missions, but normally only in this broader sense.\n\nAs the host country may not enter the representing country's embassy without permission, embassies are sometimes used by refugees escaping from either the host country or a third country.  For example, North Korean nationals, who would be arrested and deported from China upon discovery, have sought sanctuary at various third-country embassies in China. Once inside the embassy, diplomatic channels can be used to solve the issue and send the refugees to another country. See the List of people who took refuge in a diplomatic mission for a list of some notable cases.\n\nNotable violations of embassy extraterritoriality include repeated invasions of the British Embassy, Beijing (1967), the Iran hostage crisis (1979–1981), and the Japanese embassy hostage crisis at the ambassador's residence in Lima, Peru (1996).\n\nRole\n\nThe Vienna Convention states:The functions of a diplomatic mission consist, inter alia, in representing the sending State in the receiving State; protecting in the receiving State the interests of the sending State and of its nationals, within the limits permitted by international law; negotiating with the Government of the receiving State; ascertaining by all lawful means conditions and developments in the receiving State, and reporting thereon to the Government of the sending State; promoting friendly relations between the sending State and the receiving State, and developing their economic, cultural and scientific relations.\n\nBetween members of the Commonwealth of Nations their diplomatic missions are not called Embassies, but High Commissions, as Commonwealth nations share a special diplomatic relationship. It is generally expected that an embassy of a Commonwealth country in a non-Commonwealth country will do its best to provide diplomatic services to citizens from other Commonwealth countries if the citizen's country does not have an embassy in that country. Canadian and Australian nationals enjoy even greater cooperation between their respective consular services, as outlined in Canada-Australia Consular Services Sharing Agreement. The same kind of procedure is also followed multilaterally by the member states of the European Union (EU). European citizens in need of consular help in a country without diplomatic or consular representation of their own country may turn to any consular or diplomatic mission of another EU member state.\n\nThe rights and immunities (such as diplomatic immunity) of diplomatic missions are codified in the Vienna Convention on Diplomatic Relations.\n\nMultiple missions in a city\n\nSome cities may host more than one mission from the same country.  An example is Rome, where many states maintain missions to Italy and another to the Holy See.  It is not customary for these missions to share premises nor diplomatic personnel. At present, only the Iraqi missions to Italy and the Holy See share premises; however, two ambassadors are appointed, one to each country. In the case of the UN's Food Agencies, the Head of Mission to the Italian Republic is usually accredited as Permanent Representative. The United States maintains a separate United States Mission to the UN Agencies in Rome whose head is the United States Ambassador to the United Nations Agencies for Food and Agriculture. Kolkata, India hosts two Bangladeshi Deputy High Commissions, one at Park Circus and another at Mirza Galib Street. This was done to reduce overcrowding inside the Deputy High Commission. At first the Park Circus was opened and later, the one at Mirza Galib Street. Now both the Deputy High Commissions issue Bangladeshi visa.\n\nNon-diplomatic offices\n\nGovernments of states not recognized by the receiving state and of territories that make no claim to be sovereign states may set up offices abroad that do not have official diplomatic status as defined by the Vienna Convention. Examples are the Taipei Economic and Cultural Representative Offices that represent the government of the Republic of China, Somaliland's Representative Offices in London, Addis Ababa, Rome, and Washington, D.C. and the Hong Kong Economic and Trade Offices that represent the government of that territory. Such offices assume some of the non-diplomatic functions of diplomatic posts, such as promoting trade interests and providing assistance to its citizens and residents. They are nevertheless not diplomatic missions, their personnel are not diplomats and do not have diplomatic visas, although there may be legislation providing for personal immunities and tax privileges, as in the case of the Hong Kong offices in London and Toronto, for example. Diplomatic mission. http://en.wikipedia.org/?curid=8970."
  }
}
