{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13654",
  "eid" : "0c188530-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778529539,
  "textBody" : "In thermodynamics, a heat engine is a system that converts heat or thermal energy—and chemical energy—to mechanical energy, which can then be used to do mechanical work.Fundamentals of Classical Thermodynamics, 3rd ed. p. 159, (1985) by G. J. Van Wylen and R. E. Sonntag: \"A heat engine may be defined as a device that operates in a thermodynamic cycle and does a certain amount of net positive work as a result of heat transfer from a high-temperature body and to a low-temperature body. Often the term heat engine is used in a broader sense to include all devices that produce work, either through heat transfer or combustion, even though the device does not operate in a thermodynamic cycle. The internal-combustion engine and the gas turbine are examples of such devices, and calling these heat engines is an acceptable use of the term.\"Mechanical efficiency of heat engines, p. 1 (2007) by James R. Senf: \"Heat engines are made to provide mechanical energy from thermal energy.\" It does this by bringing a working substance from a higher state temperature to a lower state temperature. A heat source generates thermal energy that brings the working substance to the high temperature state. The working substance generates work in the working body of the engine while transferring heat to the colder sink until it reaches a low temperature state. During this process some of the thermal energy is converted into work by exploiting the properties of the working substance. The working substance can be any system with a non-zero heat capacity, but it usually is a gas or liquid. During this process, a lot of heat is lost to the surroundings and so cannot be converted to work.\n\nIn general an engine converts energy to mechanical work. Heat engines distinguish themselves from other types of engines by the fact that their efficiency is fundamentally limited by Carnot's theorem.Thermal physics: entropy and free energies, by Joon Chang Lee (2002), Appendix A, p. 183: \"A heat engine absorbs energy from a heat source and then converts it into work for us.... When the engine absorbs heat energy, the absorbed heat energy comes with entropy.\" (heat energy \\Delta Q=T \\Delta S), \"When the engine performs work, on the other hand, no entropy leaves the engine. This is problematic. We would like the engine to repeat the process again and again to provide us with a steady work source. ... to do so, the working substance inside the engine must return to its initial thermodynamic condition after a cycle, which requires to remove the remaining entropy. The engine can do this only in one way. It must let part of the absorbed heat energy leave without converting it into work. Therefore the engine cannot convert all of the input energy into work!\" Although this efficiency limitation can be a drawback, an advantage of heat engines is that most forms of energy can be easily converted to heat by processes like exothermic reactions (such as combustion), absorption of light or energetic particles, friction, dissipation and resistance. Since the heat source that supplies thermal energy to the engine can thus be powered by virtually any kind of energy, heat engines are very versatile and have a wide range of applicability.\n\nHeat engines are often confused with the cycles they attempt to implement. Typically, the term \"engine\" is used for a physical device and \"cycle\" for the model.\n\nOverview\n\nIn thermodynamics, heat engines are often modeled using a standard engineering model such as the Otto cycle. The theoretical model can be refined and augmented with actual data from an operating engine, using tools such as an indicator diagram. Since very few actual implementations of heat engines exactly match their underlying thermodynamic cycles, one could say that a thermodynamic cycle is an ideal case of a mechanical engine. In any case, fully understanding an engine and its efficiency requires gaining a good understanding of the (possibly simplified or idealized) theoretical model, the practical nuances of an actual mechanical engine, and the discrepancies between the two.\n\nIn general terms, the larger the difference in temperature between the hot source and the cold sink, the larger is the potential thermal efficiency of the cycle. On Earth, the cold side of any heat engine is limited to being close to the ambient temperature of the environment, or not much lower than 300 kelvins, so most efforts to improve the thermodynamic efficiencies of various heat engines focus on increasing the temperature of the source, within material limits. The maximum theoretical efficiency of a heat engine (which no engine ever attains) is equal to the temperature difference between the hot and cold ends divided by the temperature at the hot end, all expressed as absolute temperatures (in kelvins).\n\nThe efficiency of various heat engines proposed or used today has a large range: \n* 3% (97 percent waste heat using low quality heat) for the OTEC ocean power proposal.\n* 25% for most automotive gasoline engines [http://www.fueleconomy.gov/feg/atv.shtml  Where the Energy Goes: Gasoline Vehicles], US Dept of Energy\n* 49% for a supercritical coal-fired power station such as the Avedøre Power Station, and many others\n* 60% for a steam-cooled combined cycle gas turbine.\n\nAll these processes gain their efficiency (or lack thereof) from the temperature drop across them. Significant energy may be used for auxiliary equipment, such as pumps, which effectively reduces efficiency.\n\nPower\n\nHeat engines can be characterized by their specific power, which is typically given in kilowatts per litre of engine displacement (in the U.S. also horsepower per cubic inch). The result offers an approximation of the peak power output of an engine. This is not to be confused with fuel efficiency, since high efficiency often requires a lean fuel-air ratio, and thus lower power density. A modern high-performance car engine makes in excess of 75 kW/l (1.65 hp/in3).\n\nEveryday examples\n\nExamples of everyday heat engines include the steam engine and the internal combustion engine. The stirling engine is also heat engine, as well as the drinking bird toy. All of these heat engines are powered by the expansion of heated gases. The general surroundings are the heat sink, which provides relatively cool gases that, when heated, expand rapidly to drive the mechanical motion of the engine.\n\nExamples of heat engines\n\nIt is important to note that although some cycles have a typical combustion location (internal or external), they often can be implemented with the other. For example, John Ericsson developed an external heated engine running on a cycle very much like the earlier Diesel cycle. In addition, externally heated engines can often be implemented in open or closed cycles.\n\nEarth's heat engine \n\nEarth's atmosphere and hydrosphere—Earth’s heat engine—are coupled processes that constantly even out solar heating imbalances through evaporation of surface water, convection, rainfall, winds, and ocean circulation, when distributing heat around the globe.\n\nThe Hadley system provides an example of a heat engine. The Hadley circulation is identified with rising of warm and moist air in the equatorial region with descent of colder air in the subtropics corresponding to a thermally driven direct circulation, with consequent net production of kinetic energy.\n\nPhase-change cycles\n\nIn these cycles and engines, the working fluids are gases and liquids.  The engine converts the working fluid from a gas to a liquid, from liquid to gas, or both, generating work from the fluid expansion or compression.\n* Rankine cycle (classical steam engine)\n* Regenerative cycle (steam engine more efficient than Rankine cycle)\n* Organic Rankine cycle (Coolant changing phase in temperature ranges of ice and hot liquid water)\n* Vapor to liquid cycle (Drinking bird, Injector, Minto wheel)\n* Liquid to solid cycle (Frost heaving — water changing from ice to liquid and back again can lift rock up to 60 cm.)\n* Solid to gas cycle (Dry ice cannon — Dry ice sublimes to gas.)\n\nGas-only cycles\n\nIn these cycles and engines the working fluid is always a gas (i.e., there is no phase change):\n* Carnot cycle (Carnot heat engine)\n* Ericsson cycle (Caloric Ship John Ericsson)\n* Stirling cycle (Stirling engine, thermoacoustic devices)\n* Internal combustion engine (ICE):\n** Otto cycle (e.g. Gasoline/Petrol engine)\n** Diesel cycle (e.g. Diesel engine)\n** Atkinson cycle (Atkinson engine)\n** Brayton cycle or Joule cycle originally Ericsson cycle (gas turbine)\n** Lenoir cycle (e.g., pulse jet engine)\n** Miller cycle (Miller engine)\n\nLiquid only cycle\n\nIn these cycles and engines the working fluid are always like liquid:\n* Stirling cycle (Malone engine)\n* Heat Regenerative Cyclone\n\nElectron cycles\n\n* Johnson thermoelectric energy converter\n* Thermoelectric (Peltier–Seebeck effect)\n* Thermogalvanic cell\n* Thermionic emission\n* Thermotunnel cooling\n\nMagnetic cycles\n\n* Thermo-magnetic motor (Tesla)\n\nCycles used for refrigeration\n\nA domestic refrigerator is an example of a heat pump: a heat engine in reverse. Work is used to create a heat differential. Many cycles can run in reverse to move heat from the cold side to the hot side, making the cold side cooler and the hot side hotter. Internal combustion engine versions of these cycles are, by their nature, not reversible.\n\nRefrigeration cycles include:\n* Vapor-compression refrigeration\n* Stirling cryocoolers\n* Gas-absorption refrigerator\n* Air cycle machine\n* Vuilleumier refrigeration\n* Magnetic refrigeration\n\nEvaporative heat engines\n\nThe Barton evaporation engine is a heat engine based on a cycle producing power and cooled moist air from the evaporation of water into hot dry air.\n\nMesoscopic heat engines\n\nMesoscopic heat engines are nanoscale devices that may serve the goal of processing heat fluxes and perform useful work at small scales. Potential applications include e.g. electric cooling devices.\nIn such mesoscopic heat engines, work per cycle of operation fluctuates due to thermal noise.\nThere is exact equality that relates average of exponents of work performed by any heat engine and the heat transfer from the hotter heat bath.  This relation transforms the Carnot's inequality into exact equality.\n\nEfficiency\n\nThe efficiency of a heat engine relates how much useful work is output for a given amount of heat energy input.\n\nFrom the laws of thermodynamics, after a completed cycle:\n\n W \\ = \\ Q_c \\ - \\ (-Q_h) \nwhere\n W = -\\oint PdV  is the work extracted from the engine. (It is negative since work is done by the engine.)\n Q_h = T_h\\Delta S_h  is the heat energy taken from the high temperature system. (It is negative since heat is extracted from the source, hence (-Q_h) is positive.)\n Q_c = T_c\\Delta S_c  is the heat energy delivered to the cold temperature system. (It is positive since heat is added to the sink.)\n\nIn other words, a heat engine absorbs heat energy from the high temperature heat source, converting part of it to useful work and delivering the rest to the cold temperature heat sink.\n\nIn general, the efficiency of a given heat transfer process (whether it be a refrigerator, a heat pump or an engine) is defined informally by the ratio of \"what you get out\" to \"what you put in\".\n\nIn the case of an engine, one desires to extract work and puts in a heat transfer.\n\n\\eta \\frac{-W}{-Q_h} \n \\frac{-Q_h - Q_c}{-Q_h} = 1 - \\frac{Q_c}{-Q_h}\n\nThe theoretical maximum efficiency of any heat engine depends only on the temperatures it operates between. This efficiency is usually derived using an ideal imaginary heat engine such as the Carnot heat engine, although other engines using different cycles can also attain maximum efficiency. Mathematically, this is because in reversible processes, the change in entropy of the cold reservoir is the negative of that of the hot reservoir (i.e., \\Delta S_c = -\\Delta S_h), keeping the overall change of entropy zero. Thus:\n\n\\eta_\\text{max} 1 - \\frac{T_c \\Delta S_c}{-T_h \\Delta S_h} \n 1 - \\frac{T_c}{T_h}\n\nwhere T_h is the absolute temperature of the hot source and T_c that of the cold sink, usually measured in kelvins. Note that dS_c is positive while dS_h is negative; in any reversible work-extracting process, entropy is overall not increased, but rather is moved from a hot (high-entropy) system to a cold (low-entropy one), decreasing the entropy of the heat source and increasing that of the heat sink.\n\nThe reasoning behind this being the maximal efficiency goes as follows. It is first assumed that if a more efficient heat engine than a Carnot engine is possible, then it could be driven in reverse as a heat pump. Mathematical analysis can be used to show that this assumed combination would result in a net decrease in entropy. Since, by the second law of thermodynamics, this is statistically improbable to the point of exclusion, the Carnot efficiency is a theoretical upper bound on the reliable efficiency of any process.\n\nEmpirically, no heat engine has ever been shown to run at a greater efficiency than a Carnot cycle heat engine.\n\nFigure 2 and Figure 3 show variations on Carnot cycle efficiency. Figure 2 indicates how efficiency changes with an increase in the heat addition temperature for a constant compressor inlet temperature. Figure 3 indicates how the efficiency changes with an increase in the heat rejection temperature for a constant turbine inlet temperature.\n\nEndoreversible heat engines\n\nThe most Carnot efficiency as a criterion of heat engine performance is the fact that by its nature, any maximally efficient Carnot cycle must operate at an infinitesimal temperature gradient. This is because any transfer of heat between two bodies at differing temperatures is irreversible, and therefore the Carnot efficiency expression only applies in the infinitesimal limit. The major problem with that is that the object of most heat engines is to output some sort of power, and infinitesimal power is usually not what is being sought.\n\nA different measure of ideal heat engine efficiency is given by considerations of endoreversible thermodynamics, where the cycle is identical to the Carnot cycle except in that the two processes of heat transfer are not reversible (Callen 1985):\n\n\\eta = 1 - \\sqrt{\\frac{T_c}{T_h}} (Note: Units K or °R)\n\nThis model does a better job of predicting how well real-world heat engines can do (Callen 1985, see also endoreversible thermodynamics):\n\nAs shown, the endoreversible efficiency much more closely models the observed data.\n\nHistory\n\nHeat engines have been known since antiquity but were only made into useful devices at the time of the industrial revolution in the 18th century. They continue to be developed today.\n\nHeat engine enhancements\n\nEngineers have studied the various heat engine cycles extensively in effort to improve the amount of usable work they could extract from a given power source. The Carnot cycle limit cannot be reached with any gas-based cycle, but engineers have worked out at least two ways to possibly go around that limit, and one way to get better efficiency without bending any rules.\n# Increase the temperature difference in the heat engine. The simplest way to do this is to increase the hot side temperature, which is the approach used in modern combined-cycle gas turbines. Unfortunately, physical limits (such as the melting point of the materials used to build the engine) and environmental concerns regarding NOx production restrict the maximum temperature on workable heat engines. Modern gas turbines run at temperatures as high as possible within the range of temperatures necessary to maintain acceptable NOx output . Another way of increasing efficiency is to lower the output temperature. One new method of doing so is to use mixed chemical working fluids, and then exploit the changing behavior of the mixtures. One of the most famous is the so-called Kalina cycle, which uses a 70/30 mix of ammonia and water as its working fluid. This mixture allows the cycle to generate useful power at considerably lower temperatures than most other processes.\n# Exploit the physical properties of the working fluid. The most common such exploitation is the use of water above the so-called critical point, or so-called supercritical steam. The behavior of fluids above their critical point changes radically, and with materials such as water and carbon dioxide it is possible to exploit those changes in behavior to extract greater thermodynamic efficiency from the heat engine, even if it is using a fairly conventional Brayton or Rankine cycle. A newer and very promising material for such applications is CO2. SO2 and xenon have also been considered for such applications, although SO2 is toxic.\n# Exploit the chemical properties of the working fluid. A fairly new and novel exploit is to use exotic working fluids with advantageous chemical properties. One such is nitrogen dioxide (NO2), a toxic component of smog, which has a natural dimer as di-nitrogen tetraoxide (N2O4). At low temperature, the N2O4 is compressed and then heated. The increasing temperature causes each N2O4 to break apart into two NO2 molecules. This lowers the molecular weight of the working fluid, which drastically increases the efficiency of the cycle. Once the NO2 has expanded through the turbine, it is cooled by the heat sink, which makes it recombine into N2O4. This is then fed back by the compressor for another cycle. Such species as aluminium bromide (Al2Br6), NOCl, and Ga2I6 have all been investigated for such uses. To date, their drawbacks have not warranted their use, despite the efficiency gains that can be realized.\n\nHeat engine processes\n\nEach process is one of the following:\n* isothermal (at constant temperature, maintained with heat added or removed from a heat source or sink)\n* isobaric (at constant pressure)\n* isometric/isochoric (at constant volume), also referred to as iso-volumetric\n* adiabatic (no heat is added or removed from the system during adiabatic process)\n* isentropic (reversible adiabatic process, no heat is added or removed during isentropic process)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Heat engine" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13654" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In thermodynamics, a heat engine is a system that converts heat or thermal energy—and chemical energy—to mechanical energy, which can then be used to do mechanical work.Fundamentals of Classical Thermodynamics, 3rd ed. p. 159, (1985) by G. J. Van Wylen and R. E. Sonntag: \"A heat engine may be defined as a device that operates in a thermodynamic cycle and does a certain amount of net positive work as a result of heat transfer from a high-temperature body and to a low-temperature body. Often the term heat engine is used in a broader sense to include all devices that produce work, either through heat transfer or combustion, even though the device does not operate in a thermodynamic cycle. The internal-combustion engine and the gas turbine are examples of such devices, and calling these heat engines is an acceptable use of the term.\"Mechanical efficiency of heat engines, p. 1 (2007) by James R. Senf: \"Heat engines are made to provide mechanical energy from thermal energy.\" It does this by bringing a working substance from a higher state temperature to a lower state temperature. A heat source generates thermal energy that brings the working substance to the high temperature state. The working substance generates work in the working body of the engine while transferring heat to the colder sink until it reaches a low temperature state. During this process some of the thermal energy is converted into work by exploiting the properties of the working substance. The working substance can be any system with a non-zero heat capacity, but it usually is a gas or liquid. During this process, a lot of heat is lost to the surroundings and so cannot be converted to work.\n\nIn general an engine converts energy to mechanical work. Heat engines distinguish themselves from other types of engines by the fact that their efficiency is fundamentally limited by Carnot's theorem.Thermal physics: entropy and free energies, by Joon Chang Lee (2002), Appendix A, p. 183: \"A heat engine absorbs energy from a heat source and then converts it into work for us.... When the engine absorbs heat energy, the absorbed heat energy comes with entropy.\" (heat energy \\Delta Q=T \\Delta S), \"When the engine performs work, on the other hand, no entropy leaves the engine. This is problematic. We would like the engine to repeat the process again and again to provide us with a steady work source. ... to do so, the working substance inside the engine must return to its initial thermodynamic condition after a cycle, which requires to remove the remaining entropy. The engine can do this only in one way. It must let part of the absorbed heat energy leave without converting it into work. Therefore the engine cannot convert all of the input energy into work!\" Although this efficiency limitation can be a drawback, an advantage of heat engines is that most forms of energy can be easily converted to heat by processes like exothermic reactions (such as combustion), absorption of light or energetic particles, friction, dissipation and resistance. Since the heat source that supplies thermal energy to the engine can thus be powered by virtually any kind of energy, heat engines are very versatile and have a wide range of applicability.\n\nHeat engines are often confused with the cycles they attempt to implement. Typically, the term \"engine\" is used for a physical device and \"cycle\" for the model.\n\nOverview\n\nIn thermodynamics, heat engines are often modeled using a standard engineering model such as the Otto cycle. The theoretical model can be refined and augmented with actual data from an operating engine, using tools such as an indicator diagram. Since very few actual implementations of heat engines exactly match their underlying thermodynamic cycles, one could say that a thermodynamic cycle is an ideal case of a mechanical engine. In any case, fully understanding an engine and its efficiency requires gaining a good understanding of the (possibly simplified or idealized) theoretical model, the practical nuances of an actual mechanical engine, and the discrepancies between the two.\n\nIn general terms, the larger the difference in temperature between the hot source and the cold sink, the larger is the potential thermal efficiency of the cycle. On Earth, the cold side of any heat engine is limited to being close to the ambient temperature of the environment, or not much lower than 300 kelvins, so most efforts to improve the thermodynamic efficiencies of various heat engines focus on increasing the temperature of the source, within material limits. The maximum theoretical efficiency of a heat engine (which no engine ever attains) is equal to the temperature difference between the hot and cold ends divided by the temperature at the hot end, all expressed as absolute temperatures (in kelvins).\n\nThe efficiency of various heat engines proposed or used today has a large range: \n* 3% (97 percent waste heat using low quality heat) for the OTEC ocean power proposal.\n* 25% for most automotive gasoline engines [http://www.fueleconomy.gov/feg/atv.shtml  Where the Energy Goes: Gasoline Vehicles], US Dept of Energy\n* 49% for a supercritical coal-fired power station such as the Avedøre Power Station, and many others\n* 60% for a steam-cooled combined cycle gas turbine.\n\nAll these processes gain their efficiency (or lack thereof) from the temperature drop across them. Significant energy may be used for auxiliary equipment, such as pumps, which effectively reduces efficiency.\n\nPower\n\nHeat engines can be characterized by their specific power, which is typically given in kilowatts per litre of engine displacement (in the U.S. also horsepower per cubic inch). The result offers an approximation of the peak power output of an engine. This is not to be confused with fuel efficiency, since high efficiency often requires a lean fuel-air ratio, and thus lower power density. A modern high-performance car engine makes in excess of 75 kW/l (1.65 hp/in3).\n\nEveryday examples\n\nExamples of everyday heat engines include the steam engine and the internal combustion engine. The stirling engine is also heat engine, as well as the drinking bird toy. All of these heat engines are powered by the expansion of heated gases. The general surroundings are the heat sink, which provides relatively cool gases that, when heated, expand rapidly to drive the mechanical motion of the engine.\n\nExamples of heat engines\n\nIt is important to note that although some cycles have a typical combustion location (internal or external), they often can be implemented with the other. For example, John Ericsson developed an external heated engine running on a cycle very much like the earlier Diesel cycle. In addition, externally heated engines can often be implemented in open or closed cycles.\n\nEarth's heat engine \n\nEarth's atmosphere and hydrosphere—Earth’s heat engine—are coupled processes that constantly even out solar heating imbalances through evaporation of surface water, convection, rainfall, winds, and ocean circulation, when distributing heat around the globe.\n\nThe Hadley system provides an example of a heat engine. The Hadley circulation is identified with rising of warm and moist air in the equatorial region with descent of colder air in the subtropics corresponding to a thermally driven direct circulation, with consequent net production of kinetic energy.\n\nPhase-change cycles\n\nIn these cycles and engines, the working fluids are gases and liquids.  The engine converts the working fluid from a gas to a liquid, from liquid to gas, or both, generating work from the fluid expansion or compression.\n* Rankine cycle (classical steam engine)\n* Regenerative cycle (steam engine more efficient than Rankine cycle)\n* Organic Rankine cycle (Coolant changing phase in temperature ranges of ice and hot liquid water)\n* Vapor to liquid cycle (Drinking bird, Injector, Minto wheel)\n* Liquid to solid cycle (Frost heaving — water changing from ice to liquid and back again can lift rock up to 60 cm.)\n* Solid to gas cycle (Dry ice cannon — Dry ice sublimes to gas.)\n\nGas-only cycles\n\nIn these cycles and engines the working fluid is always a gas (i.e., there is no phase change):\n* Carnot cycle (Carnot heat engine)\n* Ericsson cycle (Caloric Ship John Ericsson)\n* Stirling cycle (Stirling engine, thermoacoustic devices)\n* Internal combustion engine (ICE):\n** Otto cycle (e.g. Gasoline/Petrol engine)\n** Diesel cycle (e.g. Diesel engine)\n** Atkinson cycle (Atkinson engine)\n** Brayton cycle or Joule cycle originally Ericsson cycle (gas turbine)\n** Lenoir cycle (e.g., pulse jet engine)\n** Miller cycle (Miller engine)\n\nLiquid only cycle\n\nIn these cycles and engines the working fluid are always like liquid:\n* Stirling cycle (Malone engine)\n* Heat Regenerative Cyclone\n\nElectron cycles\n\n* Johnson thermoelectric energy converter\n* Thermoelectric (Peltier–Seebeck effect)\n* Thermogalvanic cell\n* Thermionic emission\n* Thermotunnel cooling\n\nMagnetic cycles\n\n* Thermo-magnetic motor (Tesla)\n\nCycles used for refrigeration\n\nA domestic refrigerator is an example of a heat pump: a heat engine in reverse. Work is used to create a heat differential. Many cycles can run in reverse to move heat from the cold side to the hot side, making the cold side cooler and the hot side hotter. Internal combustion engine versions of these cycles are, by their nature, not reversible.\n\nRefrigeration cycles include:\n* Vapor-compression refrigeration\n* Stirling cryocoolers\n* Gas-absorption refrigerator\n* Air cycle machine\n* Vuilleumier refrigeration\n* Magnetic refrigeration\n\nEvaporative heat engines\n\nThe Barton evaporation engine is a heat engine based on a cycle producing power and cooled moist air from the evaporation of water into hot dry air.\n\nMesoscopic heat engines\n\nMesoscopic heat engines are nanoscale devices that may serve the goal of processing heat fluxes and perform useful work at small scales. Potential applications include e.g. electric cooling devices.\nIn such mesoscopic heat engines, work per cycle of operation fluctuates due to thermal noise.\nThere is exact equality that relates average of exponents of work performed by any heat engine and the heat transfer from the hotter heat bath.  This relation transforms the Carnot's inequality into exact equality.\n\nEfficiency\n\nThe efficiency of a heat engine relates how much useful work is output for a given amount of heat energy input.\n\nFrom the laws of thermodynamics, after a completed cycle:\n\n W \\ = \\ Q_c \\ - \\ (-Q_h) \nwhere\n W = -\\oint PdV  is the work extracted from the engine. (It is negative since work is done by the engine.)\n Q_h = T_h\\Delta S_h  is the heat energy taken from the high temperature system. (It is negative since heat is extracted from the source, hence (-Q_h) is positive.)\n Q_c = T_c\\Delta S_c  is the heat energy delivered to the cold temperature system. (It is positive since heat is added to the sink.)\n\nIn other words, a heat engine absorbs heat energy from the high temperature heat source, converting part of it to useful work and delivering the rest to the cold temperature heat sink.\n\nIn general, the efficiency of a given heat transfer process (whether it be a refrigerator, a heat pump or an engine) is defined informally by the ratio of \"what you get out\" to \"what you put in\".\n\nIn the case of an engine, one desires to extract work and puts in a heat transfer.\n\n\\eta \\frac{-W}{-Q_h} \n \\frac{-Q_h - Q_c}{-Q_h} = 1 - \\frac{Q_c}{-Q_h}\n\nThe theoretical maximum efficiency of any heat engine depends only on the temperatures it operates between. This efficiency is usually derived using an ideal imaginary heat engine such as the Carnot heat engine, although other engines using different cycles can also attain maximum efficiency. Mathematically, this is because in reversible processes, the change in entropy of the cold reservoir is the negative of that of the hot reservoir (i.e., \\Delta S_c = -\\Delta S_h), keeping the overall change of entropy zero. Thus:\n\n\\eta_\\text{max} 1 - \\frac{T_c \\Delta S_c}{-T_h \\Delta S_h} \n 1 - \\frac{T_c}{T_h}\n\nwhere T_h is the absolute temperature of the hot source and T_c that of the cold sink, usually measured in kelvins. Note that dS_c is positive while dS_h is negative; in any reversible work-extracting process, entropy is overall not increased, but rather is moved from a hot (high-entropy) system to a cold (low-entropy one), decreasing the entropy of the heat source and increasing that of the heat sink.\n\nThe reasoning behind this being the maximal efficiency goes as follows. It is first assumed that if a more efficient heat engine than a Carnot engine is possible, then it could be driven in reverse as a heat pump. Mathematical analysis can be used to show that this assumed combination would result in a net decrease in entropy. Since, by the second law of thermodynamics, this is statistically improbable to the point of exclusion, the Carnot efficiency is a theoretical upper bound on the reliable efficiency of any process.\n\nEmpirically, no heat engine has ever been shown to run at a greater efficiency than a Carnot cycle heat engine.\n\nFigure 2 and Figure 3 show variations on Carnot cycle efficiency. Figure 2 indicates how efficiency changes with an increase in the heat addition temperature for a constant compressor inlet temperature. Figure 3 indicates how the efficiency changes with an increase in the heat rejection temperature for a constant turbine inlet temperature.\n\nEndoreversible heat engines\n\nThe most Carnot efficiency as a criterion of heat engine performance is the fact that by its nature, any maximally efficient Carnot cycle must operate at an infinitesimal temperature gradient. This is because any transfer of heat between two bodies at differing temperatures is irreversible, and therefore the Carnot efficiency expression only applies in the infinitesimal limit. The major problem with that is that the object of most heat engines is to output some sort of power, and infinitesimal power is usually not what is being sought.\n\nA different measure of ideal heat engine efficiency is given by considerations of endoreversible thermodynamics, where the cycle is identical to the Carnot cycle except in that the two processes of heat transfer are not reversible (Callen 1985):\n\n\\eta = 1 - \\sqrt{\\frac{T_c}{T_h}} (Note: Units K or °R)\n\nThis model does a better job of predicting how well real-world heat engines can do (Callen 1985, see also endoreversible thermodynamics):\n\nAs shown, the endoreversible efficiency much more closely models the observed data.\n\nHistory\n\nHeat engines have been known since antiquity but were only made into useful devices at the time of the industrial revolution in the 18th century. They continue to be developed today.\n\nHeat engine enhancements\n\nEngineers have studied the various heat engine cycles extensively in effort to improve the amount of usable work they could extract from a given power source. The Carnot cycle limit cannot be reached with any gas-based cycle, but engineers have worked out at least two ways to possibly go around that limit, and one way to get better efficiency without bending any rules.\n# Increase the temperature difference in the heat engine. The simplest way to do this is to increase the hot side temperature, which is the approach used in modern combined-cycle gas turbines. Unfortunately, physical limits (such as the melting point of the materials used to build the engine) and environmental concerns regarding NOx production restrict the maximum temperature on workable heat engines. Modern gas turbines run at temperatures as high as possible within the range of temperatures necessary to maintain acceptable NOx output . Another way of increasing efficiency is to lower the output temperature. One new method of doing so is to use mixed chemical working fluids, and then exploit the changing behavior of the mixtures. One of the most famous is the so-called Kalina cycle, which uses a 70/30 mix of ammonia and water as its working fluid. This mixture allows the cycle to generate useful power at considerably lower temperatures than most other processes.\n# Exploit the physical properties of the working fluid. The most common such exploitation is the use of water above the so-called critical point, or so-called supercritical steam. The behavior of fluids above their critical point changes radically, and with materials such as water and carbon dioxide it is possible to exploit those changes in behavior to extract greater thermodynamic efficiency from the heat engine, even if it is using a fairly conventional Brayton or Rankine cycle. A newer and very promising material for such applications is CO2. SO2 and xenon have also been considered for such applications, although SO2 is toxic.\n# Exploit the chemical properties of the working fluid. A fairly new and novel exploit is to use exotic working fluids with advantageous chemical properties. One such is nitrogen dioxide (NO2), a toxic component of smog, which has a natural dimer as di-nitrogen tetraoxide (N2O4). At low temperature, the N2O4 is compressed and then heated. The increasing temperature causes each N2O4 to break apart into two NO2 molecules. This lowers the molecular weight of the working fluid, which drastically increases the efficiency of the cycle. Once the NO2 has expanded through the turbine, it is cooled by the heat sink, which makes it recombine into N2O4. This is then fed back by the compressor for another cycle. Such species as aluminium bromide (Al2Br6), NOCl, and Ga2I6 have all been investigated for such uses. To date, their drawbacks have not warranted their use, despite the efficiency gains that can be realized.\n\nHeat engine processes\n\nEach process is one of the following:\n* isothermal (at constant temperature, maintained with heat added or removed from a heat source or sink)\n* isobaric (at constant pressure)\n* isometric/isochoric (at constant volume), also referred to as iso-volumetric\n* adiabatic (no heat is added or removed from the system during adiabatic process)\n* isentropic (reversible adiabatic process, no heat is added or removed during isentropic process). Heat engine. http://en.wikipedia.org/?curid=13654."
  }
}
