{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9498",
  "eid" : "ef65b7f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778481391,
  "textBody" : "Esperantujo or Esperantio () is the community of speakers of the Esperanto and their culture, as well the places and institutions where the language is used. The term is used \"as if it were a country.\"(angla) Though Ethnologue refers only to Poland as a country for Esperanto-speakers, Esperanto is to be considered as a transnational language.\n\nAlthough it does not occupy its own area of Earth's surface, it can be said to constitute the 120 countries which have their own national Esperanto association.\n\nEtymology and terminology \n\nThe word is formed analogously to country names. In Esperanto, the names of countries were traditionally formed from the ethnic name of their inhabitants plus the suffix -ujo,  for example \"France\" was Francujo, from franco (a Frenchman).\n\nThe term analogous to Francujo would be Esperantistujo (Esperantist-land). However, that would convey the idea of the physical body of people, whereas using the name of the language as the basis of the word gives it the more abstract connotation of a cultural sphere.\n\nCurrently, names of nation states are often formed with the suffix -io traditionally reserved for deriving country names from geographic features, so now Francio, and recently the form Esperantio has been used i.a. in the Pasporta Servo and the Esperanto Citizens' Community.\n\nHistory \n\nIn 1908, Doctor William Molly attempted to create an Esperanto nation in Neutral Moresnet known as \"Amikejo\" (place of friendship). What became of it is unclear, and Neutral Moresnet was annexed to Belgium in the Treaty of Versailles, 1919.http://www.moresnet.nl/english/geschiedenis_en.htm#Dr.%20Wilhelm%20Molly \n\nDuring the 1960s came a new effort of creating an Esperanto state, which this time was called Republic of Rose Island. The state island stood in Adriatic Sea near Italy.\n\nAfter World War II, during Esperanto events there was a common currency used, but the management has stopped at the end of the 20th century.\n\nIn Europe on 2 June 2001 a number of organizations (they prefer to call themselves establishments) founded the Esperanta Civito, which \"aims to be a subject of international law\" and \"aims to consolidate the relations between the Esperantists who feel themselves belonging to the diaspora language group which does not belonge to any country\". Esperanto Civito always uses the name Esperantujo (introduced by Hector Hodler in 1908), which itself is defined according to their interpretation of raumism, and the meaning therefore may differ from the traditional Esperanto understanding of the word Esperantujo.\n\nIn April 2007 there was an Esperanto Republic founded as a joke.\n\nGeography \n\nEsperantujo means any physical place as Esperanto meetings or virtual networks where they meet Esperanto speakers. Sometimes it is said that it is everywhere, where Esperanto  speakers are yet connected.\n\nThere is a German city, Herzberg am Harz, which since 12 July 2006 is called \"the Esperanto city\".[http://esperanto-urbo.de/page.php?pid=77507155 Retejo de Hercbergo] There are bilingual signs and pointers, in both German and Esperanto.\n\nJudging by the members of the World Esperanto Association, the countries where there the most Esperanto speakers are (in descending order):Jarlibro de UEA, p. 248-249. Rotterdam, the Netherlands, 2016.  . Brazil, Germany, Japan, France, the United States, China, Italy.\n\nA language learning partner application called Amikumu has been launched in 2017, allowing Esperanto speakers to find one each other.[http://www.polyglotnerd.com/blog/2016/10/24/interview-with-richard-delamore-founder-of-the-app-amikumu/ Interview with Richard Delamore, founder of the app Amikumu]\n\nPolitics \n\nAssociations \n\nThere is no governmental system in Esperantujo because it is not a true state. However, there is a social hierarchy of associations:\n\n* Universal Esperanto Association (UEA) is the principal association created in 1908, its central office is located in Rotterdam. The aim of the UEA is to promote the use of Esperanto, to strive for the solution of the language problem in international relations, to encourage all types of spiritual and material relations among people and to nurture among its members a strong sense of solidarity, and to develop in them understanding and respect for other peoples.\n* Sometimes exist associations by continent, for example the European Esperanto Union. On the same level exist UEA commissions dedicated to promote spreading of Esperanto in Africa, America (North & South), Asia, Middle-East & North Africa, and Oceania.\n* In at least 120 countries in the world exist national associations: Brazilian Esperanto League, the German Esperanto Association, Japanese Esperanto Association, Esperanto-USA and Australian Esperanto Association are examples from all continents across the world. The goals are usually to help teach the language and use of Esperanto in the country.\n* Finally, there exist local associations or Esperanto clubs where volunteers or activists offer courses to learn the language or get to know more about the culture of Esperanto. Sometimes they teach Esperanto in universities or schools.\n\nAlso there are thematic associations worldwide, which are concerned with spirituality, hobbies, science or that brings together Esperantists which share common interests.\n\nThere is also a number of global organizations, such as Sennacieca Asocio Tutmonda (SAT), or the World Esperanto Youth Organization (TEJO), which has 46 national sections.\n\nForeign relations \n\nUniversal Esperanto Association is not a governmental system; however, the association represents Esperanto worldwide. In addition to the United Nations and UNESCO,[http://ngo-db.unesco.org/d/or/en/1100039679 Pagxo pri UEA en la retejo de Unesko] the UEA has consultative relationships with UNICEF and the Council of Europe[http://www.coe.int/en/web/portfolio/self-assessment-grid Esperanto aperas en la KER-listo ene de la retejo de Konsilio de Euxropo] and general cooperative relations with the Organization of American States. UEA officially collaborate with the International Organization for Standardization (ISO) by means of an active connection to the ISO Committee on terminology (ISO/TC 37). The association is active for information on the European Union and other interstate and international organizations and conferences. UEA is a member of European Language Council, a joint forum of universities and linguistic associations to promote the knowledge of languages and cultures within and outside the European Union. Moreover, on 10 May 2011, the UEA and the International Information Center for Terminology (Infoterm) signed an Agreement on Cooperation, its objectives are inter exchange information, support each other and help out for projects, meetings, publications in the field of terminology and by which the UEA become Associate Member of Infoterm.\n\nPolitical movement \n\nIn 2003 there was a European political movement called Europe–Democracy–Esperanto created. Within it is found a European federation that brings together local associations whose statutes depends on the countries. Working language of the movement is Esperanto. The goal is \"to provide the European Union with the necessary tools to set up member rights democracy\". The international language is a tool to enable cross-border political and social dialogue and actively contribute to peace and understanding between peoples. The original idea in the first ballot was mainly to spread the existence and the use of Esperanto to the general public. However, in France voices have grown steadily: 25067 (2004) 28944 (2009) and 33115 (2014). In this country there are a number of movements which support the issue: France Équité, Europe-Liberté, and Politicat.\n\nSymbols \n\nThe Esperanto-flag is called Verda Flago (Green Flag). It consists of:\n* a rectangular shape, officially with a 2:3 ratio.\n* a green field, where the green color symbolizes hope. There is no indication that any \"official\" color was ever chosen. The color green used varies in different sources.\n* a white, square canton (upper hoist quarter), measuring exactly half the hoist, where the white color symbolizes peace and neutrality.\n* in the canton, a green five-pointed star known as Verda Stelo (Green Star), which symbolizes the five continents.\n\nThe anthem is called \"La Espero\" since 1891: it is a poem written by L. L. Zamenhof. The song is usually sung at the triumphal march composed by Félicien Menu de Ménil in 1909.\n\nThe Jubilee symbol represents the language internally, while the flag represents Esperanto movement. It contains the Latin letter E (Esperanto) and the Cyrillic letter Э (Эсперанто) symbolizing the unification of West and East.\n\nIn addition, Ludwik Lejzer Zamenhof, the initiator of the language, is often used as a symbol. Sometimes he is even called \"Uncle Zam\", referring to the cartoon incarnation of American Uncle Sam.\n\nPopulation \n\nEducation \n\nIn addition to textbooks, including the Fundamento de Esperanto by Zamenhof, the Assimil-methods and the video-methods such as Muzzy in Gondoland of the BBC and Pasporto al la tuta mondo, there are many courses for learning online. The local clubs and intensive internships are also very frequent and wealthy executives in the regions where they are active Esperanto association. Moreover, some universities teach Esperanto, and the Higher Foreign Language training (University Eötvös Loránd) delivers certificates in accordance with the Common European Framework of Reference for Languages (CEFR). More than 1600 people have such a certificate around the world: in 2014 around 470 at the level of B1, 510 at the level of B2 and 700 for C1.[http://edukado.net/ekzamenoj/ker/statistiko Statistikoj pri la atestiloj de KER-ekzamenoj en Edukado.net] The International League of Esperanto Teachers (ILEI) is also working to publish learning materials for teachers.\n\nThe [http://universitato.info/kursaro.htm University of Esperanto] offers video lectures in Esperanto, for specialties like Confronting War, Informational Technologies and Astronomy. Courses are also held during the World Esperanto Congress in the framework of the Internacia Kongresa Universitato (IKU). After that, UEA uploads the related documents on its website.[http://uea.org/dokumentoj/IKU/ Kursoj de Internacia Kongresa Universitato]\n\nScience is an appropriate department for works in Esperanto. For example, the Conference on the Application of Esperanto in Science and Technology (KAEST) occurs in November every year since 1998 in the Czech Republic and Slovakia. Personal initiatives are also common: Doctor of mathematics Ulrich Matthias created a document about the foundations of Linear Algebra[http://www.u-matthias.de/verko/lin_alg.pdf Fundamentoj de lineara algebro], Ulrich Matthias and the American group of Maine (USA) wrote a guidebook to learn the programming language Python.[http://esperanto-me.org/pitono/p01_Enhavoj.htm Instruilo por la programlingvo Pitono]\n\nIn general, Esperanto is used as a lingua franca in some websites aiming teaching of other languages, such as German,[http://deutsch.info/eo Deutsch.info instruas la germanan per Esperanto] Slovak,[http://slovake.eu/eo/ Slovake.eu instruas la slovakan per Esperanto] Swahili,[https://www.youtube.com/watch?v=ye693UXx0WG4 Svahila kurseto] cxe Jutubo Wolof[http://www.esperanto-afriko.org/Wolof%20per%20esperanto.pdf PDF-a enkonduko al la lingvo volofa] or Toki Pona.[http://www.tokipona.info/ Tokipona.info instruas Tokiponon per Esperanto]\n\nMedia \n\nSince 1889 when La Esperantisto appeared, and soon other magazines in Esperanto throughout many countries in the world. Some of them are information media of Esperanto associations (Esperanto, Sennaciulo and Kontakto). Online Esperanto magazines like Libera Folio, launched in 2003, offer independent view of the Esperanto movement, aiming to soberly and critically shed light on current development. Most of the magazines deal with current events; one of such magazines is Monato, which is read in more than 60 countries. Its articles are written by correspondents from 40 countries, which know the local situation very well.[http://www.esperanto.be/fel/mon/mon_kolo.php Kolofono de Monato] Other most popular[http://esperantorondo.blogspot.fr/2015/07/la-plej-popularaj-esperanto-gazetoj.html Vocxdonado pri la plej popularaj Esperanto-gazetoj]“Legado de esperantaj gazetoj”, en UEA en konscio de Esperantistoj, p. 39-41 Esperanto newspapers are La Ondo de Esperanto, Beletra Almanako, Literatura Foiro, and Heroldo de Esperanto. Often national associations magazines are also published in order to inform about the movement in the country, such as Le Monde de l'espéranto of Espéranto-France. There are also scientific journals, such as Scienca Revuo of Internacia Scienca Asocio Esperantista (ISAE).\n\nMuzaiko is a radio that has broadcast an all-day international program of songs, interviews and current events in Esperanto since 2011. The latest two can be downloaded as podcasts.[http://muzaiko.info/programeroj/listo-de-la-programeroj Listo de la programoj de Muzaiko.info] Besides Muzaiko, these other stations offer an hour of Esperanto-language broadcasting of various topics: Radio Libertaire, Polskie Radio, Vatican Radio, Varsovia Vento, Radio Verda and Kern.punkto.\n\nInternet \n\nSpread of the Internet has enabled more efficient communication among Esperanto speakers and slightly replaced slower media such as mail. Many massively used websites such as Facebook or Google offer Esperanto interface.[http://www.facebook.com/translations/ Traduku Fejsbukon][http://www.google.com/intl/eo/ Guglo en Esperanto] On 15 December 2009, on the occasion of the jubilee of 150th birthday of L. L. Zamenhof, Google additionally made visible the Esperanto flag as a part of their Google Doodles.[http://www.liberafolio.org/2009/google-festas-la-zamenhof-tagon/ “Google festas la Zamenhof-tagon”], artikolo el Libera Folio Media as Twitter, Telegram, Reddit or Ipernity also contain a significant number of people in this community. In addition, content-providers such as WordPress and YouTube also enable bloggers write in Esperanto. Esperanto versions of programs such as the office suite LibreOffice and Mozilla Firefox browser, or the educational program about programming Scratch are also available. Additionally, online games like Minecraft offer complete Esperanto interface.\n\nSport \n\nAlthough Esperanto is not a country, there is an Esperanto football team, which has existed since 2014 and participates in matches during World Esperanto Congresses. [https://www.youtube.com/watch?v=y9UkAf7Tm8U Intervjuo de Osmo Buller (Gxenerala Direktoro de UEA) pri la futbalmatcxo dum la 99a UK] The team is part of the N.F.-Board and not of FIFA, and have played against the teams of Armenian-originating Argentine Community in 2014 and the team from Western Sahara in 2015.\n\nEsperanto speakers and Esperantists \n\nInitially, Esperanto speakers learned the language as it was described by L. L. Zamenhof.The book Lingvaj respondoj de Ludoviko (Eldonejo Ludovikito, 1990, 7-a eld.) contains about 120 pages of answers of Zamenhof to questions of Esperanto learners between 1887 and 1912. In 1905 the Fundamento de Esperanto put together the first Esperanto textbook, an exercise book and a universal dictionary.The speech of Zamenhof during the 8th Universala Kongreso de Esperanto in Krakovo (1912)shows that he does not want to take part in the language community as the “Majstro”.\n\nThe \"Declaration about the essence of Esperantism\" (1905) defines an \"Esperantisto\" to be anyone who speaks and uses Esperanto.UEA en konscio de Esperantistoj, Zbigniew Galor and Jukka Pietiläinen, Kava-Pech, 2015, p. 14 \"Esperantism\" was defined to be a movement to promote the widespread use of Esperanto as a supplement to natural languages in international and inter-ethnic contexts. As the word \"esperantist\" is linked with this \"esperantism\" (the Esperanto movement) and as -ists and -isms are linked with ideologies, today many people who speak Esperanto prefer to be called \"Esperanto speaker\".\n\nThe monthly magazine La Ondo de Esperanto every year since 1998 proclaims an 'Esperantist of the year', who remarkably contributed to the spreading of the language during the year.\n\nEconomy \n\nBusinesses \n\nPublishing and selling books, the so-called book services, is the main market and is often the first expenditure of many Esperanto associations. Some companies are already well known: for example Vinilkosmo, which publishes and makes popular Esperanto music since 1990. Then there are initiatives such as the job-seeking website Eklaboru, created by Chuck Smith, for job offers and candidates within Esperanto associations or Esperanto meetings.\n\nCurrency \n\nIn 1907, René de Saussure proposed the spesmilo ⟨₷⟩ as an international currency.\nIt had some use before the First World War.\nThe currency Stelo was created in 1942 and has been used at meetings of the Universala Ligo and in Esperanto environments. Over the years it slowly became unusable and at the official closing of the Universala Ligo in the 1990s, the remaining star-coins were handed over to the UEA. You can buy them at the UEA's book service as souvenirs.\n\nThe current steloj are made of plastic, they are used in a number of meetings, especially among young people. The currency is maintained by Stelaro, which calculates the rates, keeps the stock, and opened branches in various e-meetings. Currently there are stelo-coins of 1 ★, 3 ★ and 10 ★. Quotes of Stars at 31 December 2014 were [25] 1 EUR = 4.189 ★.[http://stelaro.alesk.eu/ Kurzoj]\n\nCulture \n\nArchitectural heritage \n\nThere exist Zamenhof-Esperanto objects (ZEOs), scattered in numerous countries around the world, which are the things named in honor of L. L. Zamenhof or Esperanto: monuments, street names, places and so on. There also exists a UEA-committee for ZEOs.[http://www.uea.org/asocio/komisionoj/zeoj “Zamenhof/Esperanto-objektoj (ZEO-j)” en la retejo de UEA]\n\nIn addition, in several countries there are also sites dedicated to Esperanto: meetup places, workshops, seminars, festivals, Esperanto houses. These places provide attractions for Esperantists. Here are two: the Castle of Grésilion in France and the Department of Planned Languages and Esperanto Museum in Vienna (Austria).\n\nCultural heritage \n\nEsperanto literary heritage is the richest and the most diverse of any constructed language. There are over 25,000 Esperanto books (originals and translations) as well as over a hundred regularly distributed Esperanto magazines.\n\nThere is also a number of movies, which have been published in Esperanto. Moreover, Esperanto itself was used in numerous movies.\n\nCelebrations \n\nMany public holidays recognized by Esperanto speakers are celebrated international and already accepted in other countries and organizations such as UN or UNESCO. Here are the celebrations internationally proposed by the UEA since 2010:\n\nCultural events \n\nEvery year numerous meetings of Esperanto speakers in different topics around the world take place. They mobilize Esperanto-speakers which share the same will about a specific topic. The main example is the Universal Congress of Esperanto (UK), which annually organizes the UEA every summer for a week. Other events:\n* SAT-Kongreso, annually organised by Sennacieca Asocio Tutmonda;\n* International Youth Congress of Esperanto (IJK), official annual congress of TEJO;\n* Internacia Infana Kongreseto (IIK), arrangement for children between 6 and 16 years that occur simultaneously with and close to the Universal Congress of Esperanto;\n* Somera Esperanto-Studado (SES), the largest international Esperanto meeting aimed at learning of Esperanto.\n\nNext to these globally comprising meetings there are also local events such as New Year's Gathering (NR) or Esperanto Youth Week (JES), which occur during the last days of December and first days of January. These meetings seem to have been successful during the last 20 years.\n\nDue to the fact that there are a lot of Esperanto meetings around the globe, there are two websites which aim to list and share them. [http://eventoj.hu/ Eventoj.hu] describes them with a list and dates, and contains an archive until 1996, while [http://esperant.io/ Esperant.io] offers world map with the locations of future meetings.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Esperantujo" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9498" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Esperantujo or Esperantio () is the community of speakers of the Esperanto and their culture, as well the places and institutions where the language is used. The term is used \"as if it were a country.\"(angla) Though Ethnologue refers only to Poland as a country for Esperanto-speakers, Esperanto is to be considered as a transnational language.\n\nAlthough it does not occupy its own area of Earth's surface, it can be said to constitute the 120 countries which have their own national Esperanto association.\n\nEtymology and terminology \n\nThe word is formed analogously to country names. In Esperanto, the names of countries were traditionally formed from the ethnic name of their inhabitants plus the suffix -ujo,  for example \"France\" was Francujo, from franco (a Frenchman).\n\nThe term analogous to Francujo would be Esperantistujo (Esperantist-land). However, that would convey the idea of the physical body of people, whereas using the name of the language as the basis of the word gives it the more abstract connotation of a cultural sphere.\n\nCurrently, names of nation states are often formed with the suffix -io traditionally reserved for deriving country names from geographic features, so now Francio, and recently the form Esperantio has been used i.a. in the Pasporta Servo and the Esperanto Citizens' Community.\n\nHistory \n\nIn 1908, Doctor William Molly attempted to create an Esperanto nation in Neutral Moresnet known as \"Amikejo\" (place of friendship). What became of it is unclear, and Neutral Moresnet was annexed to Belgium in the Treaty of Versailles, 1919.http://www.moresnet.nl/english/geschiedenis_en.htm#Dr.%20Wilhelm%20Molly \n\nDuring the 1960s came a new effort of creating an Esperanto state, which this time was called Republic of Rose Island. The state island stood in Adriatic Sea near Italy.\n\nAfter World War II, during Esperanto events there was a common currency used, but the management has stopped at the end of the 20th century.\n\nIn Europe on 2 June 2001 a number of organizations (they prefer to call themselves establishments) founded the Esperanta Civito, which \"aims to be a subject of international law\" and \"aims to consolidate the relations between the Esperantists who feel themselves belonging to the diaspora language group which does not belonge to any country\". Esperanto Civito always uses the name Esperantujo (introduced by Hector Hodler in 1908), which itself is defined according to their interpretation of raumism, and the meaning therefore may differ from the traditional Esperanto understanding of the word Esperantujo.\n\nIn April 2007 there was an Esperanto Republic founded as a joke.\n\nGeography \n\nEsperantujo means any physical place as Esperanto meetings or virtual networks where they meet Esperanto speakers. Sometimes it is said that it is everywhere, where Esperanto  speakers are yet connected.\n\nThere is a German city, Herzberg am Harz, which since 12 July 2006 is called \"the Esperanto city\".[http://esperanto-urbo.de/page.php?pid=77507155 Retejo de Hercbergo] There are bilingual signs and pointers, in both German and Esperanto.\n\nJudging by the members of the World Esperanto Association, the countries where there the most Esperanto speakers are (in descending order):Jarlibro de UEA, p. 248-249. Rotterdam, the Netherlands, 2016.  . Brazil, Germany, Japan, France, the United States, China, Italy.\n\nA language learning partner application called Amikumu has been launched in 2017, allowing Esperanto speakers to find one each other.[http://www.polyglotnerd.com/blog/2016/10/24/interview-with-richard-delamore-founder-of-the-app-amikumu/ Interview with Richard Delamore, founder of the app Amikumu]\n\nPolitics \n\nAssociations \n\nThere is no governmental system in Esperantujo because it is not a true state. However, there is a social hierarchy of associations:\n\n* Universal Esperanto Association (UEA) is the principal association created in 1908, its central office is located in Rotterdam. The aim of the UEA is to promote the use of Esperanto, to strive for the solution of the language problem in international relations, to encourage all types of spiritual and material relations among people and to nurture among its members a strong sense of solidarity, and to develop in them understanding and respect for other peoples.\n* Sometimes exist associations by continent, for example the European Esperanto Union. On the same level exist UEA commissions dedicated to promote spreading of Esperanto in Africa, America (North & South), Asia, Middle-East & North Africa, and Oceania.\n* In at least 120 countries in the world exist national associations: Brazilian Esperanto League, the German Esperanto Association, Japanese Esperanto Association, Esperanto-USA and Australian Esperanto Association are examples from all continents across the world. The goals are usually to help teach the language and use of Esperanto in the country.\n* Finally, there exist local associations or Esperanto clubs where volunteers or activists offer courses to learn the language or get to know more about the culture of Esperanto. Sometimes they teach Esperanto in universities or schools.\n\nAlso there are thematic associations worldwide, which are concerned with spirituality, hobbies, science or that brings together Esperantists which share common interests.\n\nThere is also a number of global organizations, such as Sennacieca Asocio Tutmonda (SAT), or the World Esperanto Youth Organization (TEJO), which has 46 national sections.\n\nForeign relations \n\nUniversal Esperanto Association is not a governmental system; however, the association represents Esperanto worldwide. In addition to the United Nations and UNESCO,[http://ngo-db.unesco.org/d/or/en/1100039679 Pagxo pri UEA en la retejo de Unesko] the UEA has consultative relationships with UNICEF and the Council of Europe[http://www.coe.int/en/web/portfolio/self-assessment-grid Esperanto aperas en la KER-listo ene de la retejo de Konsilio de Euxropo] and general cooperative relations with the Organization of American States. UEA officially collaborate with the International Organization for Standardization (ISO) by means of an active connection to the ISO Committee on terminology (ISO/TC 37). The association is active for information on the European Union and other interstate and international organizations and conferences. UEA is a member of European Language Council, a joint forum of universities and linguistic associations to promote the knowledge of languages and cultures within and outside the European Union. Moreover, on 10 May 2011, the UEA and the International Information Center for Terminology (Infoterm) signed an Agreement on Cooperation, its objectives are inter exchange information, support each other and help out for projects, meetings, publications in the field of terminology and by which the UEA become Associate Member of Infoterm.\n\nPolitical movement \n\nIn 2003 there was a European political movement called Europe–Democracy–Esperanto created. Within it is found a European federation that brings together local associations whose statutes depends on the countries. Working language of the movement is Esperanto. The goal is \"to provide the European Union with the necessary tools to set up member rights democracy\". The international language is a tool to enable cross-border political and social dialogue and actively contribute to peace and understanding between peoples. The original idea in the first ballot was mainly to spread the existence and the use of Esperanto to the general public. However, in France voices have grown steadily: 25067 (2004) 28944 (2009) and 33115 (2014). In this country there are a number of movements which support the issue: France Équité, Europe-Liberté, and Politicat.\n\nSymbols \n\nThe Esperanto-flag is called Verda Flago (Green Flag). It consists of:\n* a rectangular shape, officially with a 2:3 ratio.\n* a green field, where the green color symbolizes hope. There is no indication that any \"official\" color was ever chosen. The color green used varies in different sources.\n* a white, square canton (upper hoist quarter), measuring exactly half the hoist, where the white color symbolizes peace and neutrality.\n* in the canton, a green five-pointed star known as Verda Stelo (Green Star), which symbolizes the five continents.\n\nThe anthem is called \"La Espero\" since 1891: it is a poem written by L. L. Zamenhof. The song is usually sung at the triumphal march composed by Félicien Menu de Ménil in 1909.\n\nThe Jubilee symbol represents the language internally, while the flag represents Esperanto movement. It contains the Latin letter E (Esperanto) and the Cyrillic letter Э (Эсперанто) symbolizing the unification of West and East.\n\nIn addition, Ludwik Lejzer Zamenhof, the initiator of the language, is often used as a symbol. Sometimes he is even called \"Uncle Zam\", referring to the cartoon incarnation of American Uncle Sam.\n\nPopulation \n\nEducation \n\nIn addition to textbooks, including the Fundamento de Esperanto by Zamenhof, the Assimil-methods and the video-methods such as Muzzy in Gondoland of the BBC and Pasporto al la tuta mondo, there are many courses for learning online. The local clubs and intensive internships are also very frequent and wealthy executives in the regions where they are active Esperanto association. Moreover, some universities teach Esperanto, and the Higher Foreign Language training (University Eötvös Loránd) delivers certificates in accordance with the Common European Framework of Reference for Languages (CEFR). More than 1600 people have such a certificate around the world: in 2014 around 470 at the level of B1, 510 at the level of B2 and 700 for C1.[http://edukado.net/ekzamenoj/ker/statistiko Statistikoj pri la atestiloj de KER-ekzamenoj en Edukado.net] The International League of Esperanto Teachers (ILEI) is also working to publish learning materials for teachers.\n\nThe [http://universitato.info/kursaro.htm University of Esperanto] offers video lectures in Esperanto, for specialties like Confronting War, Informational Technologies and Astronomy. Courses are also held during the World Esperanto Congress in the framework of the Internacia Kongresa Universitato (IKU). After that, UEA uploads the related documents on its website.[http://uea.org/dokumentoj/IKU/ Kursoj de Internacia Kongresa Universitato]\n\nScience is an appropriate department for works in Esperanto. For example, the Conference on the Application of Esperanto in Science and Technology (KAEST) occurs in November every year since 1998 in the Czech Republic and Slovakia. Personal initiatives are also common: Doctor of mathematics Ulrich Matthias created a document about the foundations of Linear Algebra[http://www.u-matthias.de/verko/lin_alg.pdf Fundamentoj de lineara algebro], Ulrich Matthias and the American group of Maine (USA) wrote a guidebook to learn the programming language Python.[http://esperanto-me.org/pitono/p01_Enhavoj.htm Instruilo por la programlingvo Pitono]\n\nIn general, Esperanto is used as a lingua franca in some websites aiming teaching of other languages, such as German,[http://deutsch.info/eo Deutsch.info instruas la germanan per Esperanto] Slovak,[http://slovake.eu/eo/ Slovake.eu instruas la slovakan per Esperanto] Swahili,[https://www.youtube.com/watch?v=ye693UXx0WG4 Svahila kurseto] cxe Jutubo Wolof[http://www.esperanto-afriko.org/Wolof%20per%20esperanto.pdf PDF-a enkonduko al la lingvo volofa] or Toki Pona.[http://www.tokipona.info/ Tokipona.info instruas Tokiponon per Esperanto]\n\nMedia \n\nSince 1889 when La Esperantisto appeared, and soon other magazines in Esperanto throughout many countries in the world. Some of them are information media of Esperanto associations (Esperanto, Sennaciulo and Kontakto). Online Esperanto magazines like Libera Folio, launched in 2003, offer independent view of the Esperanto movement, aiming to soberly and critically shed light on current development. Most of the magazines deal with current events; one of such magazines is Monato, which is read in more than 60 countries. Its articles are written by correspondents from 40 countries, which know the local situation very well.[http://www.esperanto.be/fel/mon/mon_kolo.php Kolofono de Monato] Other most popular[http://esperantorondo.blogspot.fr/2015/07/la-plej-popularaj-esperanto-gazetoj.html Vocxdonado pri la plej popularaj Esperanto-gazetoj]“Legado de esperantaj gazetoj”, en UEA en konscio de Esperantistoj, p. 39-41 Esperanto newspapers are La Ondo de Esperanto, Beletra Almanako, Literatura Foiro, and Heroldo de Esperanto. Often national associations magazines are also published in order to inform about the movement in the country, such as Le Monde de l'espéranto of Espéranto-France. There are also scientific journals, such as Scienca Revuo of Internacia Scienca Asocio Esperantista (ISAE).\n\nMuzaiko is a radio that has broadcast an all-day international program of songs, interviews and current events in Esperanto since 2011. The latest two can be downloaded as podcasts.[http://muzaiko.info/programeroj/listo-de-la-programeroj Listo de la programoj de Muzaiko.info] Besides Muzaiko, these other stations offer an hour of Esperanto-language broadcasting of various topics: Radio Libertaire, Polskie Radio, Vatican Radio, Varsovia Vento, Radio Verda and Kern.punkto.\n\nInternet \n\nSpread of the Internet has enabled more efficient communication among Esperanto speakers and slightly replaced slower media such as mail. Many massively used websites such as Facebook or Google offer Esperanto interface.[http://www.facebook.com/translations/ Traduku Fejsbukon][http://www.google.com/intl/eo/ Guglo en Esperanto] On 15 December 2009, on the occasion of the jubilee of 150th birthday of L. L. Zamenhof, Google additionally made visible the Esperanto flag as a part of their Google Doodles.[http://www.liberafolio.org/2009/google-festas-la-zamenhof-tagon/ “Google festas la Zamenhof-tagon”], artikolo el Libera Folio Media as Twitter, Telegram, Reddit or Ipernity also contain a significant number of people in this community. In addition, content-providers such as WordPress and YouTube also enable bloggers write in Esperanto. Esperanto versions of programs such as the office suite LibreOffice and Mozilla Firefox browser, or the educational program about programming Scratch are also available. Additionally, online games like Minecraft offer complete Esperanto interface.\n\nSport \n\nAlthough Esperanto is not a country, there is an Esperanto football team, which has existed since 2014 and participates in matches during World Esperanto Congresses. [https://www.youtube.com/watch?v=y9UkAf7Tm8U Intervjuo de Osmo Buller (Gxenerala Direktoro de UEA) pri la futbalmatcxo dum la 99a UK] The team is part of the N.F.-Board and not of FIFA, and have played against the teams of Armenian-originating Argentine Community in 2014 and the team from Western Sahara in 2015.\n\nEsperanto speakers and Esperantists \n\nInitially, Esperanto speakers learned the language as it was described by L. L. Zamenhof.The book Lingvaj respondoj de Ludoviko (Eldonejo Ludovikito, 1990, 7-a eld.) contains about 120 pages of answers of Zamenhof to questions of Esperanto learners between 1887 and 1912. In 1905 the Fundamento de Esperanto put together the first Esperanto textbook, an exercise book and a universal dictionary.The speech of Zamenhof during the 8th Universala Kongreso de Esperanto in Krakovo (1912)shows that he does not want to take part in the language community as the “Majstro”.\n\nThe \"Declaration about the essence of Esperantism\" (1905) defines an \"Esperantisto\" to be anyone who speaks and uses Esperanto.UEA en konscio de Esperantistoj, Zbigniew Galor and Jukka Pietiläinen, Kava-Pech, 2015, p. 14 \"Esperantism\" was defined to be a movement to promote the widespread use of Esperanto as a supplement to natural languages in international and inter-ethnic contexts. As the word \"esperantist\" is linked with this \"esperantism\" (the Esperanto movement) and as -ists and -isms are linked with ideologies, today many people who speak Esperanto prefer to be called \"Esperanto speaker\".\n\nThe monthly magazine La Ondo de Esperanto every year since 1998 proclaims an 'Esperantist of the year', who remarkably contributed to the spreading of the language during the year.\n\nEconomy \n\nBusinesses \n\nPublishing and selling books, the so-called book services, is the main market and is often the first expenditure of many Esperanto associations. Some companies are already well known: for example Vinilkosmo, which publishes and makes popular Esperanto music since 1990. Then there are initiatives such as the job-seeking website Eklaboru, created by Chuck Smith, for job offers and candidates within Esperanto associations or Esperanto meetings.\n\nCurrency \n\nIn 1907, René de Saussure proposed the spesmilo ⟨₷⟩ as an international currency.\nIt had some use before the First World War.\nThe currency Stelo was created in 1942 and has been used at meetings of the Universala Ligo and in Esperanto environments. Over the years it slowly became unusable and at the official closing of the Universala Ligo in the 1990s, the remaining star-coins were handed over to the UEA. You can buy them at the UEA's book service as souvenirs.\n\nThe current steloj are made of plastic, they are used in a number of meetings, especially among young people. The currency is maintained by Stelaro, which calculates the rates, keeps the stock, and opened branches in various e-meetings. Currently there are stelo-coins of 1 ★, 3 ★ and 10 ★. Quotes of Stars at 31 December 2014 were [25] 1 EUR = 4.189 ★.[http://stelaro.alesk.eu/ Kurzoj]\n\nCulture \n\nArchitectural heritage \n\nThere exist Zamenhof-Esperanto objects (ZEOs), scattered in numerous countries around the world, which are the things named in honor of L. L. Zamenhof or Esperanto: monuments, street names, places and so on. There also exists a UEA-committee for ZEOs.[http://www.uea.org/asocio/komisionoj/zeoj “Zamenhof/Esperanto-objektoj (ZEO-j)” en la retejo de UEA]\n\nIn addition, in several countries there are also sites dedicated to Esperanto: meetup places, workshops, seminars, festivals, Esperanto houses. These places provide attractions for Esperantists. Here are two: the Castle of Grésilion in France and the Department of Planned Languages and Esperanto Museum in Vienna (Austria).\n\nCultural heritage \n\nEsperanto literary heritage is the richest and the most diverse of any constructed language. There are over 25,000 Esperanto books (originals and translations) as well as over a hundred regularly distributed Esperanto magazines.\n\nThere is also a number of movies, which have been published in Esperanto. Moreover, Esperanto itself was used in numerous movies.\n\nCelebrations \n\nMany public holidays recognized by Esperanto speakers are celebrated international and already accepted in other countries and organizations such as UN or UNESCO. Here are the celebrations internationally proposed by the UEA since 2010:\n\nCultural events \n\nEvery year numerous meetings of Esperanto speakers in different topics around the world take place. They mobilize Esperanto-speakers which share the same will about a specific topic. The main example is the Universal Congress of Esperanto (UK), which annually organizes the UEA every summer for a week. Other events:\n* SAT-Kongreso, annually organised by Sennacieca Asocio Tutmonda;\n* International Youth Congress of Esperanto (IJK), official annual congress of TEJO;\n* Internacia Infana Kongreseto (IIK), arrangement for children between 6 and 16 years that occur simultaneously with and close to the Universal Congress of Esperanto;\n* Somera Esperanto-Studado (SES), the largest international Esperanto meeting aimed at learning of Esperanto.\n\nNext to these globally comprising meetings there are also local events such as New Year's Gathering (NR) or Esperanto Youth Week (JES), which occur during the last days of December and first days of January. These meetings seem to have been successful during the last 20 years.\n\nDue to the fact that there are a lot of Esperanto meetings around the globe, there are two websites which aim to list and share them. [http://eventoj.hu/ Eventoj.hu] describes them with a list and dates, and contains an archive until 1996, while [http://esperant.io/ Esperant.io] offers world map with the locations of future meetings. Esperantujo. http://en.wikipedia.org/?curid=9498."
  }
}
