{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15954",
  "eid" : "221b4930-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778566467,
  "textBody" : "Events\n\n* AD 41 – Roman Emperor Caligula, known for his eccentricity and sadistic despotism, is assassinated by his disgruntled Praetorian Guards. The Guard then proclaims Caligula's uncle Claudius as Emperor.\n*1438 – The Council of Basel suspends Pope Eugene IV.\n*1458 – Matthias Corvinus becomes king of Hungary.\n*1624 – Afonso Mendes, appointed by Pope Gregory XV as Prelate of Ethiopia, arrives at Massawa from Goa.\n*1679 – King Charles II of England dissolves the Cavalier Parliament.\n*1739 – Peshva warrior Chimnaji Appa defeats Portuguese forces and captures Tarapur Fort, India.\n*1742 – Charles VII Albert becomes Holy Roman Emperor.\n*1758 – During the Seven Years' War the leading burghers of Königsberg submit to Elizabeth of Russia, thus forming Russian Prussia (until 1763)\n*1817 – Crossing of the Andes: Many soldiers of Juan Gregorio de las Heras are captured during the Action of Picheuta.\n*1835 – Slaves in Salvador da Bahia, Brazil, stage a revolt, which is instrumental in ending slavery there 50 years later.\n*1848 – California Gold Rush: James W. Marshall finds gold at Sutter's Mill near Sacramento.\n*1857 – The University of Calcutta is formally founded as the first fully fledged university in South Asia.\n*1859 – The United Principalities of Moldavia and Wallachia (later named Romania) formed as a personal union under the rule of Domnitor Alexandru Ioan Cuza.\n*1862 – Bucharest is proclaimed the capital of Romania.\n*1900 – Second Boer War: Boers stop a British attempt to break the Siege of Ladysmith in the Battle of Spion Kop.\n*1908 – The first Boy Scout troop is organized in England by Robert Baden-Powell.\n*1915 – World War I: British Grand Fleet battle cruisers under Vice-Admiral Sir David Beatty engage Rear-Admiral Franz von Hipper's battle cruisers in the Battle of Dogger Bank.\n*1916 – In Brushaber v. Union Pacific Railroad Co., the Supreme Court of the United States declares the federal income tax constitutional.\n*1918 – The Gregorian calendar is introduced in Russia by decree of the Council of People's Commissars effective February 14(NS)\n*1933 – The 20th Amendment to the United States Constitution is ratified, changing the beginning and end of terms for all elected federal offices.\n*1939 – The deadliest earthquake in Chilean history strikes Chillán, killing approximately 28,000 people.\n*1942 – World War II: The Allies bombard Bangkok, leading Thailand, then under Japanese control, to declare war against the United States and United Kingdom.\n*1943 – World War II: Franklin D. Roosevelt and Winston Churchill conclude a conference in Casablanca.\n*1946 – The United Nations General Assembly passes its first resolution to establish the United Nations Atomic Energy Commission.\n*1960 – Algerian War: Some units of European volunteers in Algiers stage an insurrection known as the \"barricades week\", during which they seize government buildings and clash with local police.\n*1961 – Goldsboro B-52 crash: A bomber carrying two H-bombs breaks up in mid-air over North Carolina. The uranium core of one weapon remains lost.\n*1968 – Vietnam War: The 1st Australian Task Force launches Operation Coburg against the North Vietnamese Army and Viet Cong during wider fighting around Long Bình and Biên Hòa\n*1972 – Japanese Sgt. Shoichi Yokoi is found hiding in a Guam jungle, where he had been since the end of World War II.\n*1977 – Atocha massacre occurs in Madrid during the Spanish transition to democracy. \n*1978 – Soviet satellite Kosmos 954, with a nuclear reactor on board, burns up in Earth's atmosphere, scattering radioactive debris over Canada's Northwest Territories. Only 1% is recovered.\n*1984 – Apple Computer places the Macintosh personal computer on sale in the United States.\n*1989 – Notorious serial killer Ted Bundy, with over 30 known victims, is executed by the electric chair at the Florida State Prison \n*1990 – Japan launches Hiten, the country's first lunar probe, the first robotic lunar probe since the Soviet Union's Luna 24 in 1976, and the first lunar probe launched by a country other than Soviet Union or the United States.\n*2003 – The United States Department of Homeland Security officially begins operation.\n*2009 – Cyclone Klaus makes landfall near Bordeaux, France, causing 26 deaths as well as extensive disruptions to public transport and power supplies.\n*2011 – At least 35 die and 180 are injured in a bombing at Moscow's Domodedovo Airport.\n\nBirths\n\n*AD 76 – Hadrian, Roman emperor (d. 138)\n*1287  – Richard de Bury, English bishop and politician, Lord Chancellor of Great Britain (d. 1345)\n*1444 – Galeazzo Maria Sforza, Duke of Milan (d. 1476)\n*1540 – Edmund Campion, English priest and martyr (d. 1581)\n*1547 – Joanna of Austria, Grand Duchess of Tuscany, Austrian Archduchess (d. 1578)\n*1602 – Mildmay Fane, 2nd Earl of Westmorland, English politician (d. 1666)\n*1619 – Yamazaki Ansai, Japanese philosopher (d. 1682)\n*1643 – Charles Sackville, 6th Earl of Dorset, English poet and politician, Lord Chamberlain of Great Britain (d. 1706)\n*1664 – John Vanbrugh, English architect and dramatist (d. 1726)\n*1670 – William Congreve, English playwright and poet (d. 1729)\n*1674 – Thomas Tanner, English bishop (d. 1735)\n*1679 – Christian Wolff, German philosopher and academic (d. 1754)\n*1709 – Dom Bédos de Celles, French monk and organist (d. 1779)\n*1712 – Frederick the Great, Prussian king (d. 1786)\n*1732 – Pierre Beaumarchais, French playwright and financier (d. 1799)\n*1746 – Gustav III of Sweden (d. 1792)\n*1749 – Charles James Fox, English businessman and politician, Secretary of State for Foreign and Commonwealth Affairs (d. 1806)\n*1754 – Andrew Ellicott, American soldier and surveyor (d. 1820)\n*1763 – Louis Alexandre Andrault de Langeron, French-Ukrainian general and politician (d. 1831)\n*1776 – E. T. A. Hoffmann, German jurist, author, and composer (d. 1822)\n*1836 – Signe Rink, Greenland-born Danish writer and ethnologist (d. 1909)\n*1843 – Josip Stadler, Croatian archbishop (d. 1918)\n*1848 – Vasily Surikov, Russian painter (d. 1916)\n*1858 – Constance Naden, English poet and philosopher (d. 1889)\n*1862 – Edith Wharton, American novelist and short story writer (d. 1937)\n*1864 – Marguerite Durand, French actress, journalist, and activist (d. 1936)\n*1866 – Jaan Poska, Estonian lawyer and politician, 1st Estonian Minister of Foreign Affairs (d. 1920)\n*1872 – Konstantin Bogaevsky, Russian painter (d. 1943)\n*  1872   – Morris Travers, English chemist and academic (d. 1961)\n*1886 – Henry King, American actor, director, producer, and screenwriter (d. 1982)\n*1888 – Vicki Baum, Austrian author and screenwriter (d. 1960)\n*  1888   – Ernst Heinkel, German engineer and businessman, founded the Heinkel Aircraft Manufacturing Company (d. 1958)\n*1889 – Charles Hawes, American historian and author (d. 1923)\n*1891 – Walter Model, German field marshal (d. 1945)\n*1895 – Eugen Roth, German poet and songwriter (d. 1976)\n*1898 – Cliff Heathcote, American baseball player (d. 1939)\n*1900 – Theodosius Dobzhansky, Ukrainian-American geneticist and biologist (d. 1975)\n*1901 – Harry Calder, South African cricketer (d. 1995)\n*  1901   – Edward Turner, English engineer (d. 1973)\n*1902 – Ephraim Avigdor Speiser, Ukrainian-American archaeologist and scholar (d. 1965)\n*1905 – J. Howard Marshall, American lawyer and businessman (d. 1995)\n*1907 – Maurice Couve de Murville, French soldier and politician, Prime Minister of France (d. 1999)\n*1909 – Martin Lings, English author and scholar (d. 2005)\n*1910 – Doris Haddock, American political activist (d. 2010)\n*1911 – Muir Mathieson, Scottish conductor and composer (d. 1975)\n*1912 – Frederick Ashworth, American admiral (d. 2005)\n*1913 – Norman Dello Joio, American organist and composer (d. 2008)\n*  1913   – Ray Stehr, Australian rugby league player and coach (d. 1983)\n*1915 – Vítězslava Kaprálová, Czech composer and conductor (d. 1940)\n*  1915   – Robert Motherwell, American painter and academic (d. 1991)\n*1916 – Rafael Caldera, Venezuelan lawyer and politician, 65th President of Venezuela (d. 2009)\n*  1916   – Gene Mako, Hungarian-American tennis player and actor (d. 2013)\n*1917 – Ernest Borgnine, American actor (d. 2012)\n*1918 – Gottfried von Einem, Austrian pianist and composer (d. 1996)\n*  1918   – Oral Roberts, American evangelist, founded Oral Roberts University and Oral Roberts Evangelistic Association (d. 2009)\n*1919 – Coleman Francis, American actor, director, producer, and screenwriter (d. 1973)\n*  1919   – Leon Kirchner, American composer and educator (d. 2009)\n*1920 – Jimmy Forrest, American saxophonist (d. 1980)\n*  1920   – Jerry Maren, American actor \n*1922 – Daniel Boulanger, French actor and screenwriter (d. 2014)\n*  1922   – Neil Franklin, English footballer (d. 1996)\n*1924 – Brian Bevan, Australian-English rugby league player (d. 1991)\n*  1924   – C. B. Muthamma, Indian soldier and diplomat (d. 2009)\n*1925 – Gus Mortson, Canadian ice hockey player and coach (d. 2015)\n*  1925   – Maria Tallchief, American ballerina and actress (d. 2013)\n*1926 – Ruth Asawa, American sculptor (d. 2013)\n*  1926   – Georges Lautner, French director and screenwriter (d. 2013)\n*1927 – Sir Patrick Macnaghten, 11th Baronet, Scottish lieutenant (d. 2007)\n*1928 – Desmond Morris, English zoologist, ethologist, and painter\n*  1928   – Michel Serrault, French actor (d. 2007)\n*1930 – Mahmoud Farshchian, Iranian-Persian painter and academic\n*  1930   – Bernard Matthews, English farmer and businessman, founded Bernard Matthews Farms (d. 2010)\n*  1930   – John Romita Sr., American soldier and illustrator\n*1931 – Leonard Baker, American historian and author (d. 1984)\n*  1931   – Lars Hörmander, Swedish mathematician and academic (d. 2012)\n*  1931   – Ib Nørholm, Danish composer and organist\n*1934 – Stanisław Grochowiak, Polish poet and playwright (d. 1976)\n*1935 – Eric Ashton, English rugby player and coach (d. 2008)\n*  1935   – Shivabalayogi, Indian religious leader (d. 1994)\n*1938 – Julius Hemphill, American saxophonist and composer (d. 1995)\n*1939 – Ray Stevens, American singer-songwriter and actor\n*1940 – Joachim Gauck, German pastor and politician, 11th President of Germany\n*1942 – Gary Hart, American wrestler and manager (d. 2008)\n*1941 – Neil Diamond, American singer-songwriter and guitarist\n*  1941   – Aaron Neville, American singer \n*  1941   – Dan Shechtman, Israeli chemist and academic, Nobel Prize laureate\n*1943 – Subhash Ghai, Indian director, producer, and screenwriter\n*  1943   – Peter Struck, German lawyer and politician, 13th German Federal Minister of Defence (d. 2012)\n*  1943   – Sharon Tate, American model and actress (d. 1969)\n*  1943   – Tony Trimmer, English race car driver\n*1945 – John Garamendi, American football player and politician, 1st United States Deputy Secretary of the Interior\n*1946 – Michael Ontkean, Canadian actor\n*1947 – Giorgio Chinaglia, Italian footballer (d. 2012)\n*  1947   – Michio Kaku, American physicist and academic\n*  1947   – Masashi Ozaki, Japanese baseball player and golfer\n*  1947   – Warren Zevon, American singer-songwriter (d. 2003)\n*1948 – Michael Des Barres, English singer-songwriter and actor \n*1949 – John Belushi, American actor and screenwriter (d. 1982)\n*  1949   – Bill Bush, New Zealand rugby player\n*1950 – Daniel Auteuil, French actor, director, and screenwriter\n*1951 – Yakov Smirnoff, Ukrainian-American comedian and actor\n*1953 – Yuri Bashmet, Russian violinist, viola player, and conductor\n*  1953   – Moon Jae-in, 19th President of South Korea\n*1954 – Jo Gartner, Austrian race car driver (d. 1986)\n*1955 – Jim Montgomery, American swimmer\n*  1955   – Alan Sokal, American physicist and author\n*  1955   – Lynda Weinman, American businesswoman and author\n*1957 – Mark Eaton, American basketball player and sportscaster\n*1958 – Neil Allen, American baseball player and coach\n*  1958   – Jools Holland, English singer-songwriter and pianist \n*1959 – Akira Maeda, Japanese wrestler, mixed martial artist, and actor\n*  1959   – Michel Preud'homme, Belgian footballer and manager\n*  1959   – Vic Reeves, English comedian, actor, and author\n*1960 – Mária Bajzek Lukács, Hungarian author and educator\n*  1960   – Mark Reeds, Canadian-American ice hockey player and coach (d. 2015)\n*1961 – Guido Buchwald, German footballer and manager\n*  1961   – Nastassja Kinski, German-American actress and producer\n*  1961   – William Van Dijck, Belgian runner\n*1962 – Argiris Kambouris, Greek basketball player\n*1965 – Carlos Saldanha, Brazilian-American actor, director, producer, and screenwriter\n*  1965   – Pagonis Vakalopoulos, Greek footballer and manager\n*1966 – Jimeoin, English-Irish comedian, actor, producer, and screenwriter\n*1967 – Phil LaMarr, American actor, singer, and screenwriter\n*  1967   – John Myung, American bass player and songwriter\n*1968 – Mary Lou Retton, American gymnast\n*1969 – Yoo Ho-jeong, South Korean actress\n*1970 – Roberto Bonano, Argentine footballer \n*  1970   – Luke Egan, Australian surfer\n*  1970   – Neil Johnson, Zimbabwean-South African cricketer\n*  1970   – Matthew Lillard, American actor\n*1972 – Beth Hart, American blues-rock singer and piano player\n*1972 – Daniel Kawczynski, Polish-English accountant and politician\n*1974 – Ed Helms, American actor, producer, and screenwriter\n*1975 – Gianluca Basile, Italian former professional basketball player\n*  1975   – Rónald Gómez, Costa Rican footballer and manager\n*1976 – Shae-Lynn Bourne, Canadian ice dancer, coach, and choreographer\n*  1976   – Cindy Pieters, Belgian cyclist\n*1978 – Kristen Schaal, American actress, voice artist, comedian and writer \n*1979 – Leandro Desábato, Argentinian footballer\n*  1979   – Tom Kostopoulos, Canadian ice hockey player\n*1979 – Tatyana Ali, American actress and singer, daughter of boxer Muhammad Ali\n*1980 – Rocky Boiman, American football player and sportscaster\n*1981 – Michael Wolf, German ice hockey player\n*1982 – Daveed Diggs, American actor, rapper and singer\n*1983 – Davide Biondini, Italian footballer\n*  1983   – Wyatt Crockett, New Zealand rugby player\n*  1983   – Shaun Maloney, Scottish footballer\n*  1983   – Scott Speed, American race car driver\n*1984 – Scott Kazmir, American baseball player\n*  1984   – Paulo Sérgio Moreira Gonçalves, Portuguese footballer\n*1985 – Ian Henderson, English footballer\n*1986 – Cristiano Araújo, Brazilian singer-songwriter (d. 2015)\n*  1986   – Mischa Barton, English-American actress\n*  1986   – Vladislav Ivanov, Russian footballer\n*  1986   – Michael Kightly, English footballer\n*  1986   – Ricky Ullman, Israeli-American actor\n*1987 – Luis Suárez, Uruguayan footballer\n*1989 – Ki Sung-yueng, South Korean footballer\n*1990 – Mao Abe, Japanese singer-songwriter and guitarist\n*1991 – Li Xuerui, Chinese badminton player\n*1992 – Becky Downie, English gymnast\n*1993 – Albert Vete, New Zealand rugby league player\n*1997 – Samantha Yeo, Singaporean swimmer\n\nDeaths\n\n*AD 41 – Caligula, Roman emperor (b. 12)\n* 817 – Pope Stephen IV (b. 770)\n* 901 – Liu Jishu, general of the Tang Dynasty\n*1046 – Eckard II, Margrave of Meissen (b. c. 985)\n*1125 – David IV of Georgia (b. 1073)\n*1336 – Alfonso IV of Aragon (b. 1299)\n*1376 – Richard FitzAlan, 10th Earl of Arundel, English commander (b. 1306)\n*1473 – Conrad Paumann, German organist and composer (b. 1410)\n*1525 – Franciabigio, Florentine painter (b. 1482)\n*1595 – Ferdinand II, Archduke of Austria (b. 1529)\n*1626 – Samuel Argall, English captain and politician, Colonial Governor of Virginia (b. 1572)\n*1639 – Jörg Jenatsch, Swiss pastor and politician (b. 1596)\n*1666 – Johann Andreas Herbst, German composer and theorist (b. 1588)\n*1709 – George Rooke, English admiral and politician (b. 1650)\n*1769 – François de Chevert, French general (b. 1695)\n*1839 – Michele Cachia, Maltese architect and engineer (b. 1760)\n*1877 – Johann Christian Poggendorff, German physicist and journalist (b. 1796)\n*1881 – James Collinson, Victorian painter (b. 1825)\n*1882 – Levi Boone, American physician and politician, 17th Mayor of Chicago (b. 1808)\n*1883 – Friedrich von Flotow, German composer (b. 1812)\n*1895 – Lord Randolph Churchill, English lawyer and politician, Chancellor of the Exchequer (b. 1849)\n*1911 – David Graham Phillips, American journalist and author (b. 1867)\n*1918 – George Arthur Crump, American architect, designed the Pine Valley Golf Club (b. 1871)\n*1920 – Amedeo Modigliani, Italian painter and sculptor (b. 1884)\n*1924 – Anna Bayerová, Czech physician (b. 1853)\n*1932 – Alfred Yarrow, English businessman and philanthropist, founded Yarrow Shipbuilders (b. 1842)\n*1939 – Maximilian Bircher-Benner, Swiss physician, created Muesli (b. 1867)\n*1943 – John Burns, English trade union leader and politician, Secretary of State for Business, Innovation and Skills (b. 1858)\n*1948 – Maria Mandl, Austrian SS officer (b. 1912)\n*1960 – Edwin Fischer, Swiss pianist and conductor (b. 1886)\n*1961 – Alfred Carlton Gilbert, American pole vaulter and businessman, founded the A. C. Gilbert Company (b. 1884)\n*1962 – André Lhote, French sculptor and painter (b. 1885)\n*  1962   – Stanley Lord, English captain (b. 1877)\n*  1962   – Ahmet Hamdi Tanpınar, Turkish author, poet, and scholar (b. 1901)\n*1965 – Winston Churchill, English colonel and politician, Prime Minister of the United Kingdom, Nobel Prize laureate (b. 1874)\n*1966 – Homi J. Bhabha, Indian physicist and academic (b. 1909)\n*1970 – Caresse Crosby, American fashion designer and publisher, co-founded the Black Sun Press (b. 1891)\n*1971 – Bill W., American activist, co-founder of Alcoholics Anonymous (b. 1895)\n*1975 – Larry Fine, American comedian (b. 1902)\n*1982 – Alfredo Ovando Candía, Bolivian general and politician, 56th President of Bolivia (b. 1918)\n*1983 – George Cukor, American director and producer (b. 1899)\n*1986 – L. Ron Hubbard, American religious leader and author, founded the Church of Scientology (b. 1911)\n*  1986   – Gordon MacRae, American actor and singer (b. 1921)\n*1988 – Werner Fenchel, German-Danish mathematician and academic (b. 1905)\n*1989 – Ted Bundy, American serial killer (b. 1946)\n*1990 – Madge Bellamy, American actress (b. 1899)\n*1991 – John M. Kelly, Irish academic and politician, 17th Attorney General of Ireland (b. 1931)\n*  1991   – Jack Schaefer, American journalist and author (b. 1907)\n*1992 – Ken Darby, American composer and conductor (b. 1909)\n*1993 – Gustav Ernesaks, Estonian composer and conductor (b. 1908)\n*  1993   – Thurgood Marshall, American lawyer and jurist, 32nd United States Solicitor General (b. 1908)\n*1995 – David Cole, American DJ, songwriter, and producer (b. 1962)\n*1998 – Walter D. Edmonds, American journalist and author (b. 1903)\n*2001 – Gaffar Okkan, Turkish police officer and civil servant (b. 1952)\n*2002 – Peter Gzowski, Canadian journalist and broadcaster (b. 1934)\n*  2002   – Elie Hobeika, Lebanese commander and politician (b. 1956)\n*2003 – Gianni Agnelli, Italian businessman (b. 1921)\n*2004 – Leônidas, Brazilian footballer and manager (b. 1913)\n*2005 – June Bronhill, Australian soprano (b. 1929)\n*2006 – Schafik Handal, Salvadoran politician (b. 1930)\n*  2006   – Fayard Nicholas, American actor, dancer, and choreographer (b. 1914)\n*  2006   – Subramaniyam Sugirdharajan, Sri Lankan journalist and activist (b. 1970)\n*2007 – Krystyna Feldman, Polish actress (b. 1916)\n*  2007   – İsmail Cem İpekçi, Turkish journalist and politician, 45th Turkish Minister of Foreign Affairs (b. 1940)\n*  2007   – Guadalupe Larriva, Ecuadorian academic and politician (b. 1956)\n*  2007   – Emiliano Mercado del Toro, Puerto Rican-American soldier (b. 1891)\n*2008 – Lee Embree, American sergeant and photographer (b. 1915)\n*  2008   – Randy Salerno, American journalist (b. 1963)\n*2009 – Reg Gutteridge, English journalist and sportscaster (b. 1924)\n*  2009   – Kay Yow, American basketball player and coach (b. 1942)\n*2010 – Şakir Eczacıbaşı, Turkish pharmacist, photographer, and businessman (b. 1929)\n*  2010   – Pernell Roberts, American actor (b. 1928)\n*2011 – Bernd Eichinger, German director and producer (b. 1949)\n*  2011   – Gerry Ortega, Filipino environmentalist, journalist, and politician (b. 1963)\n*2012 – J. Joseph Garrahy, American soldier and politician, 69th Governor of Rhode Island (b. 1930)\n*  2012   – Patricia Neway, American soprano and actress (b. 1919)\n*2013 – Khuseyn Gakayev, Russian commander (b. 1970)\n*  2013   – Miroslav Janů, Czech footballer and manager (b. 1959)\n*  2013   – Richard G. Stern, American novelist, short story writer (b. 1928)\n*  2013   – Jim Wallwork, English sergeant and pilot (b. 1919)\n*2014 – Shulamit Aloni, Israeli lawyer and politician, 11th Israeli Minister of Education (b. 1928)\n*  2014   – Rafael Pineda Ponce, Honduran academic and politician (b. 1930)\n*2015 – Link Byfield, Canadian journalist and author (b. 1951) \n*  2015   – Otto Carius, German lieutenant and pharmacist (b. 1922)\n*  2015   – Frances Lennon, English painter and illustrator (b. 1912)\n*2016 – Fredrik Barth, German-Norwegian anthropologist and academic (b. 1928)\n*  2016   – Marvin Minsky, American computer scientist and academic (b. 1927)\n*  2016   – Henry Worsley, English colonel and explorer (b. 1960)\n*2017 – Butch Trucks, American drummer (b. 1947)\n*2018 – Mark E. Smith, British singer-songwriter (b. 1957)\n\nHolidays and observances\n\n*Christian feast day:\n**Cadoc (Wales)\n**Felician of Foligno\n**Francis de Sales\n**Pratulin Martyrs (Greek Catholic Church)\n**January 24 (Eastern Orthodox liturgics)\n*Earliest day on which Saturday of Souls can fall, while February 27 (or 28 during Leap Year) is the latest; observed 57 days before Easter. (Eastern Orthodox)\n*Feast of Our Lady of Peace (Roman Catholic Church), and its related observances:\n**Feria de Alasitas (La Paz)\n*Unification Day (Romania)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "January 24" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15954" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* AD 41 – Roman Emperor Caligula, known for his eccentricity and sadistic despotism, is assassinated by his disgruntled Praetorian Guards. The Guard then proclaims Caligula's uncle Claudius as Emperor.\n*1438 – The Council of Basel suspends Pope Eugene IV.\n*1458 – Matthias Corvinus becomes king of Hungary.\n*1624 – Afonso Mendes, appointed by Pope Gregory XV as Prelate of Ethiopia, arrives at Massawa from Goa.\n*1679 – King Charles II of England dissolves the Cavalier Parliament.\n*1739 – Peshva warrior Chimnaji Appa defeats Portuguese forces and captures Tarapur Fort, India.\n*1742 – Charles VII Albert becomes Holy Roman Emperor.\n*1758 – During the Seven Years' War the leading burghers of Königsberg submit to Elizabeth of Russia, thus forming Russian Prussia (until 1763)\n*1817 – Crossing of the Andes: Many soldiers of Juan Gregorio de las Heras are captured during the Action of Picheuta.\n*1835 – Slaves in Salvador da Bahia, Brazil, stage a revolt, which is instrumental in ending slavery there 50 years later.\n*1848 – California Gold Rush: James W. Marshall finds gold at Sutter's Mill near Sacramento.\n*1857 – The University of Calcutta is formally founded as the first fully fledged university in South Asia.\n*1859 – The United Principalities of Moldavia and Wallachia (later named Romania) formed as a personal union under the rule of Domnitor Alexandru Ioan Cuza.\n*1862 – Bucharest is proclaimed the capital of Romania.\n*1900 – Second Boer War: Boers stop a British attempt to break the Siege of Ladysmith in the Battle of Spion Kop.\n*1908 – The first Boy Scout troop is organized in England by Robert Baden-Powell.\n*1915 – World War I: British Grand Fleet battle cruisers under Vice-Admiral Sir David Beatty engage Rear-Admiral Franz von Hipper's battle cruisers in the Battle of Dogger Bank.\n*1916 – In Brushaber v. Union Pacific Railroad Co., the Supreme Court of the United States declares the federal income tax constitutional.\n*1918 – The Gregorian calendar is introduced in Russia by decree of the Council of People's Commissars effective February 14(NS)\n*1933 – The 20th Amendment to the United States Constitution is ratified, changing the beginning and end of terms for all elected federal offices.\n*1939 – The deadliest earthquake in Chilean history strikes Chillán, killing approximately 28,000 people.\n*1942 – World War II: The Allies bombard Bangkok, leading Thailand, then under Japanese control, to declare war against the United States and United Kingdom.\n*1943 – World War II: Franklin D. Roosevelt and Winston Churchill conclude a conference in Casablanca.\n*1946 – The United Nations General Assembly passes its first resolution to establish the United Nations Atomic Energy Commission.\n*1960 – Algerian War: Some units of European volunteers in Algiers stage an insurrection known as the \"barricades week\", during which they seize government buildings and clash with local police.\n*1961 – Goldsboro B-52 crash: A bomber carrying two H-bombs breaks up in mid-air over North Carolina. The uranium core of one weapon remains lost.\n*1968 – Vietnam War: The 1st Australian Task Force launches Operation Coburg against the North Vietnamese Army and Viet Cong during wider fighting around Long Bình and Biên Hòa\n*1972 – Japanese Sgt. Shoichi Yokoi is found hiding in a Guam jungle, where he had been since the end of World War II.\n*1977 – Atocha massacre occurs in Madrid during the Spanish transition to democracy. \n*1978 – Soviet satellite Kosmos 954, with a nuclear reactor on board, burns up in Earth's atmosphere, scattering radioactive debris over Canada's Northwest Territories. Only 1% is recovered.\n*1984 – Apple Computer places the Macintosh personal computer on sale in the United States.\n*1989 – Notorious serial killer Ted Bundy, with over 30 known victims, is executed by the electric chair at the Florida State Prison \n*1990 – Japan launches Hiten, the country's first lunar probe, the first robotic lunar probe since the Soviet Union's Luna 24 in 1976, and the first lunar probe launched by a country other than Soviet Union or the United States.\n*2003 – The United States Department of Homeland Security officially begins operation.\n*2009 – Cyclone Klaus makes landfall near Bordeaux, France, causing 26 deaths as well as extensive disruptions to public transport and power supplies.\n*2011 – At least 35 die and 180 are injured in a bombing at Moscow's Domodedovo Airport.\n\nBirths\n\n*AD 76 – Hadrian, Roman emperor (d. 138)\n*1287  – Richard de Bury, English bishop and politician, Lord Chancellor of Great Britain (d. 1345)\n*1444 – Galeazzo Maria Sforza, Duke of Milan (d. 1476)\n*1540 – Edmund Campion, English priest and martyr (d. 1581)\n*1547 – Joanna of Austria, Grand Duchess of Tuscany, Austrian Archduchess (d. 1578)\n*1602 – Mildmay Fane, 2nd Earl of Westmorland, English politician (d. 1666)\n*1619 – Yamazaki Ansai, Japanese philosopher (d. 1682)\n*1643 – Charles Sackville, 6th Earl of Dorset, English poet and politician, Lord Chamberlain of Great Britain (d. 1706)\n*1664 – John Vanbrugh, English architect and dramatist (d. 1726)\n*1670 – William Congreve, English playwright and poet (d. 1729)\n*1674 – Thomas Tanner, English bishop (d. 1735)\n*1679 – Christian Wolff, German philosopher and academic (d. 1754)\n*1709 – Dom Bédos de Celles, French monk and organist (d. 1779)\n*1712 – Frederick the Great, Prussian king (d. 1786)\n*1732 – Pierre Beaumarchais, French playwright and financier (d. 1799)\n*1746 – Gustav III of Sweden (d. 1792)\n*1749 – Charles James Fox, English businessman and politician, Secretary of State for Foreign and Commonwealth Affairs (d. 1806)\n*1754 – Andrew Ellicott, American soldier and surveyor (d. 1820)\n*1763 – Louis Alexandre Andrault de Langeron, French-Ukrainian general and politician (d. 1831)\n*1776 – E. T. A. Hoffmann, German jurist, author, and composer (d. 1822)\n*1836 – Signe Rink, Greenland-born Danish writer and ethnologist (d. 1909)\n*1843 – Josip Stadler, Croatian archbishop (d. 1918)\n*1848 – Vasily Surikov, Russian painter (d. 1916)\n*1858 – Constance Naden, English poet and philosopher (d. 1889)\n*1862 – Edith Wharton, American novelist and short story writer (d. 1937)\n*1864 – Marguerite Durand, French actress, journalist, and activist (d. 1936)\n*1866 – Jaan Poska, Estonian lawyer and politician, 1st Estonian Minister of Foreign Affairs (d. 1920)\n*1872 – Konstantin Bogaevsky, Russian painter (d. 1943)\n*  1872   – Morris Travers, English chemist and academic (d. 1961)\n*1886 – Henry King, American actor, director, producer, and screenwriter (d. 1982)\n*1888 – Vicki Baum, Austrian author and screenwriter (d. 1960)\n*  1888   – Ernst Heinkel, German engineer and businessman, founded the Heinkel Aircraft Manufacturing Company (d. 1958)\n*1889 – Charles Hawes, American historian and author (d. 1923)\n*1891 – Walter Model, German field marshal (d. 1945)\n*1895 – Eugen Roth, German poet and songwriter (d. 1976)\n*1898 – Cliff Heathcote, American baseball player (d. 1939)\n*1900 – Theodosius Dobzhansky, Ukrainian-American geneticist and biologist (d. 1975)\n*1901 – Harry Calder, South African cricketer (d. 1995)\n*  1901   – Edward Turner, English engineer (d. 1973)\n*1902 – Ephraim Avigdor Speiser, Ukrainian-American archaeologist and scholar (d. 1965)\n*1905 – J. Howard Marshall, American lawyer and businessman (d. 1995)\n*1907 – Maurice Couve de Murville, French soldier and politician, Prime Minister of France (d. 1999)\n*1909 – Martin Lings, English author and scholar (d. 2005)\n*1910 – Doris Haddock, American political activist (d. 2010)\n*1911 – Muir Mathieson, Scottish conductor and composer (d. 1975)\n*1912 – Frederick Ashworth, American admiral (d. 2005)\n*1913 – Norman Dello Joio, American organist and composer (d. 2008)\n*  1913   – Ray Stehr, Australian rugby league player and coach (d. 1983)\n*1915 – Vítězslava Kaprálová, Czech composer and conductor (d. 1940)\n*  1915   – Robert Motherwell, American painter and academic (d. 1991)\n*1916 – Rafael Caldera, Venezuelan lawyer and politician, 65th President of Venezuela (d. 2009)\n*  1916   – Gene Mako, Hungarian-American tennis player and actor (d. 2013)\n*1917 – Ernest Borgnine, American actor (d. 2012)\n*1918 – Gottfried von Einem, Austrian pianist and composer (d. 1996)\n*  1918   – Oral Roberts, American evangelist, founded Oral Roberts University and Oral Roberts Evangelistic Association (d. 2009)\n*1919 – Coleman Francis, American actor, director, producer, and screenwriter (d. 1973)\n*  1919   – Leon Kirchner, American composer and educator (d. 2009)\n*1920 – Jimmy Forrest, American saxophonist (d. 1980)\n*  1920   – Jerry Maren, American actor \n*1922 – Daniel Boulanger, French actor and screenwriter (d. 2014)\n*  1922   – Neil Franklin, English footballer (d. 1996)\n*1924 – Brian Bevan, Australian-English rugby league player (d. 1991)\n*  1924   – C. B. Muthamma, Indian soldier and diplomat (d. 2009)\n*1925 – Gus Mortson, Canadian ice hockey player and coach (d. 2015)\n*  1925   – Maria Tallchief, American ballerina and actress (d. 2013)\n*1926 – Ruth Asawa, American sculptor (d. 2013)\n*  1926   – Georges Lautner, French director and screenwriter (d. 2013)\n*1927 – Sir Patrick Macnaghten, 11th Baronet, Scottish lieutenant (d. 2007)\n*1928 – Desmond Morris, English zoologist, ethologist, and painter\n*  1928   – Michel Serrault, French actor (d. 2007)\n*1930 – Mahmoud Farshchian, Iranian-Persian painter and academic\n*  1930   – Bernard Matthews, English farmer and businessman, founded Bernard Matthews Farms (d. 2010)\n*  1930   – John Romita Sr., American soldier and illustrator\n*1931 – Leonard Baker, American historian and author (d. 1984)\n*  1931   – Lars Hörmander, Swedish mathematician and academic (d. 2012)\n*  1931   – Ib Nørholm, Danish composer and organist\n*1934 – Stanisław Grochowiak, Polish poet and playwright (d. 1976)\n*1935 – Eric Ashton, English rugby player and coach (d. 2008)\n*  1935   – Shivabalayogi, Indian religious leader (d. 1994)\n*1938 – Julius Hemphill, American saxophonist and composer (d. 1995)\n*1939 – Ray Stevens, American singer-songwriter and actor\n*1940 – Joachim Gauck, German pastor and politician, 11th President of Germany\n*1942 – Gary Hart, American wrestler and manager (d. 2008)\n*1941 – Neil Diamond, American singer-songwriter and guitarist\n*  1941   – Aaron Neville, American singer \n*  1941   – Dan Shechtman, Israeli chemist and academic, Nobel Prize laureate\n*1943 – Subhash Ghai, Indian director, producer, and screenwriter\n*  1943   – Peter Struck, German lawyer and politician, 13th German Federal Minister of Defence (d. 2012)\n*  1943   – Sharon Tate, American model and actress (d. 1969)\n*  1943   – Tony Trimmer, English race car driver\n*1945 – John Garamendi, American football player and politician, 1st United States Deputy Secretary of the Interior\n*1946 – Michael Ontkean, Canadian actor\n*1947 – Giorgio Chinaglia, Italian footballer (d. 2012)\n*  1947   – Michio Kaku, American physicist and academic\n*  1947   – Masashi Ozaki, Japanese baseball player and golfer\n*  1947   – Warren Zevon, American singer-songwriter (d. 2003)\n*1948 – Michael Des Barres, English singer-songwriter and actor \n*1949 – John Belushi, American actor and screenwriter (d. 1982)\n*  1949   – Bill Bush, New Zealand rugby player\n*1950 – Daniel Auteuil, French actor, director, and screenwriter\n*1951 – Yakov Smirnoff, Ukrainian-American comedian and actor\n*1953 – Yuri Bashmet, Russian violinist, viola player, and conductor\n*  1953   – Moon Jae-in, 19th President of South Korea\n*1954 – Jo Gartner, Austrian race car driver (d. 1986)\n*1955 – Jim Montgomery, American swimmer\n*  1955   – Alan Sokal, American physicist and author\n*  1955   – Lynda Weinman, American businesswoman and author\n*1957 – Mark Eaton, American basketball player and sportscaster\n*1958 – Neil Allen, American baseball player and coach\n*  1958   – Jools Holland, English singer-songwriter and pianist \n*1959 – Akira Maeda, Japanese wrestler, mixed martial artist, and actor\n*  1959   – Michel Preud'homme, Belgian footballer and manager\n*  1959   – Vic Reeves, English comedian, actor, and author\n*1960 – Mária Bajzek Lukács, Hungarian author and educator\n*  1960   – Mark Reeds, Canadian-American ice hockey player and coach (d. 2015)\n*1961 – Guido Buchwald, German footballer and manager\n*  1961   – Nastassja Kinski, German-American actress and producer\n*  1961   – William Van Dijck, Belgian runner\n*1962 – Argiris Kambouris, Greek basketball player\n*1965 – Carlos Saldanha, Brazilian-American actor, director, producer, and screenwriter\n*  1965   – Pagonis Vakalopoulos, Greek footballer and manager\n*1966 – Jimeoin, English-Irish comedian, actor, producer, and screenwriter\n*1967 – Phil LaMarr, American actor, singer, and screenwriter\n*  1967   – John Myung, American bass player and songwriter\n*1968 – Mary Lou Retton, American gymnast\n*1969 – Yoo Ho-jeong, South Korean actress\n*1970 – Roberto Bonano, Argentine footballer \n*  1970   – Luke Egan, Australian surfer\n*  1970   – Neil Johnson, Zimbabwean-South African cricketer\n*  1970   – Matthew Lillard, American actor\n*1972 – Beth Hart, American blues-rock singer and piano player\n*1972 – Daniel Kawczynski, Polish-English accountant and politician\n*1974 – Ed Helms, American actor, producer, and screenwriter\n*1975 – Gianluca Basile, Italian former professional basketball player\n*  1975   – Rónald Gómez, Costa Rican footballer and manager\n*1976 – Shae-Lynn Bourne, Canadian ice dancer, coach, and choreographer\n*  1976   – Cindy Pieters, Belgian cyclist\n*1978 – Kristen Schaal, American actress, voice artist, comedian and writer \n*1979 – Leandro Desábato, Argentinian footballer\n*  1979   – Tom Kostopoulos, Canadian ice hockey player\n*1979 – Tatyana Ali, American actress and singer, daughter of boxer Muhammad Ali\n*1980 – Rocky Boiman, American football player and sportscaster\n*1981 – Michael Wolf, German ice hockey player\n*1982 – Daveed Diggs, American actor, rapper and singer\n*1983 – Davide Biondini, Italian footballer\n*  1983   – Wyatt Crockett, New Zealand rugby player\n*  1983   – Shaun Maloney, Scottish footballer\n*  1983   – Scott Speed, American race car driver\n*1984 – Scott Kazmir, American baseball player\n*  1984   – Paulo Sérgio Moreira Gonçalves, Portuguese footballer\n*1985 – Ian Henderson, English footballer\n*1986 – Cristiano Araújo, Brazilian singer-songwriter (d. 2015)\n*  1986   – Mischa Barton, English-American actress\n*  1986   – Vladislav Ivanov, Russian footballer\n*  1986   – Michael Kightly, English footballer\n*  1986   – Ricky Ullman, Israeli-American actor\n*1987 – Luis Suárez, Uruguayan footballer\n*1989 – Ki Sung-yueng, South Korean footballer\n*1990 – Mao Abe, Japanese singer-songwriter and guitarist\n*1991 – Li Xuerui, Chinese badminton player\n*1992 – Becky Downie, English gymnast\n*1993 – Albert Vete, New Zealand rugby league player\n*1997 – Samantha Yeo, Singaporean swimmer\n\nDeaths\n\n*AD 41 – Caligula, Roman emperor (b. 12)\n* 817 – Pope Stephen IV (b. 770)\n* 901 – Liu Jishu, general of the Tang Dynasty\n*1046 – Eckard II, Margrave of Meissen (b. c. 985)\n*1125 – David IV of Georgia (b. 1073)\n*1336 – Alfonso IV of Aragon (b. 1299)\n*1376 – Richard FitzAlan, 10th Earl of Arundel, English commander (b. 1306)\n*1473 – Conrad Paumann, German organist and composer (b. 1410)\n*1525 – Franciabigio, Florentine painter (b. 1482)\n*1595 – Ferdinand II, Archduke of Austria (b. 1529)\n*1626 – Samuel Argall, English captain and politician, Colonial Governor of Virginia (b. 1572)\n*1639 – Jörg Jenatsch, Swiss pastor and politician (b. 1596)\n*1666 – Johann Andreas Herbst, German composer and theorist (b. 1588)\n*1709 – George Rooke, English admiral and politician (b. 1650)\n*1769 – François de Chevert, French general (b. 1695)\n*1839 – Michele Cachia, Maltese architect and engineer (b. 1760)\n*1877 – Johann Christian Poggendorff, German physicist and journalist (b. 1796)\n*1881 – James Collinson, Victorian painter (b. 1825)\n*1882 – Levi Boone, American physician and politician, 17th Mayor of Chicago (b. 1808)\n*1883 – Friedrich von Flotow, German composer (b. 1812)\n*1895 – Lord Randolph Churchill, English lawyer and politician, Chancellor of the Exchequer (b. 1849)\n*1911 – David Graham Phillips, American journalist and author (b. 1867)\n*1918 – George Arthur Crump, American architect, designed the Pine Valley Golf Club (b. 1871)\n*1920 – Amedeo Modigliani, Italian painter and sculptor (b. 1884)\n*1924 – Anna Bayerová, Czech physician (b. 1853)\n*1932 – Alfred Yarrow, English businessman and philanthropist, founded Yarrow Shipbuilders (b. 1842)\n*1939 – Maximilian Bircher-Benner, Swiss physician, created Muesli (b. 1867)\n*1943 – John Burns, English trade union leader and politician, Secretary of State for Business, Innovation and Skills (b. 1858)\n*1948 – Maria Mandl, Austrian SS officer (b. 1912)\n*1960 – Edwin Fischer, Swiss pianist and conductor (b. 1886)\n*1961 – Alfred Carlton Gilbert, American pole vaulter and businessman, founded the A. C. Gilbert Company (b. 1884)\n*1962 – André Lhote, French sculptor and painter (b. 1885)\n*  1962   – Stanley Lord, English captain (b. 1877)\n*  1962   – Ahmet Hamdi Tanpınar, Turkish author, poet, and scholar (b. 1901)\n*1965 – Winston Churchill, English colonel and politician, Prime Minister of the United Kingdom, Nobel Prize laureate (b. 1874)\n*1966 – Homi J. Bhabha, Indian physicist and academic (b. 1909)\n*1970 – Caresse Crosby, American fashion designer and publisher, co-founded the Black Sun Press (b. 1891)\n*1971 – Bill W., American activist, co-founder of Alcoholics Anonymous (b. 1895)\n*1975 – Larry Fine, American comedian (b. 1902)\n*1982 – Alfredo Ovando Candía, Bolivian general and politician, 56th President of Bolivia (b. 1918)\n*1983 – George Cukor, American director and producer (b. 1899)\n*1986 – L. Ron Hubbard, American religious leader and author, founded the Church of Scientology (b. 1911)\n*  1986   – Gordon MacRae, American actor and singer (b. 1921)\n*1988 – Werner Fenchel, German-Danish mathematician and academic (b. 1905)\n*1989 – Ted Bundy, American serial killer (b. 1946)\n*1990 – Madge Bellamy, American actress (b. 1899)\n*1991 – John M. Kelly, Irish academic and politician, 17th Attorney General of Ireland (b. 1931)\n*  1991   – Jack Schaefer, American journalist and author (b. 1907)\n*1992 – Ken Darby, American composer and conductor (b. 1909)\n*1993 – Gustav Ernesaks, Estonian composer and conductor (b. 1908)\n*  1993   – Thurgood Marshall, American lawyer and jurist, 32nd United States Solicitor General (b. 1908)\n*1995 – David Cole, American DJ, songwriter, and producer (b. 1962)\n*1998 – Walter D. Edmonds, American journalist and author (b. 1903)\n*2001 – Gaffar Okkan, Turkish police officer and civil servant (b. 1952)\n*2002 – Peter Gzowski, Canadian journalist and broadcaster (b. 1934)\n*  2002   – Elie Hobeika, Lebanese commander and politician (b. 1956)\n*2003 – Gianni Agnelli, Italian businessman (b. 1921)\n*2004 – Leônidas, Brazilian footballer and manager (b. 1913)\n*2005 – June Bronhill, Australian soprano (b. 1929)\n*2006 – Schafik Handal, Salvadoran politician (b. 1930)\n*  2006   – Fayard Nicholas, American actor, dancer, and choreographer (b. 1914)\n*  2006   – Subramaniyam Sugirdharajan, Sri Lankan journalist and activist (b. 1970)\n*2007 – Krystyna Feldman, Polish actress (b. 1916)\n*  2007   – İsmail Cem İpekçi, Turkish journalist and politician, 45th Turkish Minister of Foreign Affairs (b. 1940)\n*  2007   – Guadalupe Larriva, Ecuadorian academic and politician (b. 1956)\n*  2007   – Emiliano Mercado del Toro, Puerto Rican-American soldier (b. 1891)\n*2008 – Lee Embree, American sergeant and photographer (b. 1915)\n*  2008   – Randy Salerno, American journalist (b. 1963)\n*2009 – Reg Gutteridge, English journalist and sportscaster (b. 1924)\n*  2009   – Kay Yow, American basketball player and coach (b. 1942)\n*2010 – Şakir Eczacıbaşı, Turkish pharmacist, photographer, and businessman (b. 1929)\n*  2010   – Pernell Roberts, American actor (b. 1928)\n*2011 – Bernd Eichinger, German director and producer (b. 1949)\n*  2011   – Gerry Ortega, Filipino environmentalist, journalist, and politician (b. 1963)\n*2012 – J. Joseph Garrahy, American soldier and politician, 69th Governor of Rhode Island (b. 1930)\n*  2012   – Patricia Neway, American soprano and actress (b. 1919)\n*2013 – Khuseyn Gakayev, Russian commander (b. 1970)\n*  2013   – Miroslav Janů, Czech footballer and manager (b. 1959)\n*  2013   – Richard G. Stern, American novelist, short story writer (b. 1928)\n*  2013   – Jim Wallwork, English sergeant and pilot (b. 1919)\n*2014 – Shulamit Aloni, Israeli lawyer and politician, 11th Israeli Minister of Education (b. 1928)\n*  2014   – Rafael Pineda Ponce, Honduran academic and politician (b. 1930)\n*2015 – Link Byfield, Canadian journalist and author (b. 1951) \n*  2015   – Otto Carius, German lieutenant and pharmacist (b. 1922)\n*  2015   – Frances Lennon, English painter and illustrator (b. 1912)\n*2016 – Fredrik Barth, German-Norwegian anthropologist and academic (b. 1928)\n*  2016   – Marvin Minsky, American computer scientist and academic (b. 1927)\n*  2016   – Henry Worsley, English colonel and explorer (b. 1960)\n*2017 – Butch Trucks, American drummer (b. 1947)\n*2018 – Mark E. Smith, British singer-songwriter (b. 1957)\n\nHolidays and observances\n\n*Christian feast day:\n**Cadoc (Wales)\n**Felician of Foligno\n**Francis de Sales\n**Pratulin Martyrs (Greek Catholic Church)\n**January 24 (Eastern Orthodox liturgics)\n*Earliest day on which Saturday of Souls can fall, while February 27 (or 28 during Leap Year) is the latest; observed 57 days before Easter. (Eastern Orthodox)\n*Feast of Our Lady of Peace (Roman Catholic Church), and its related observances:\n**Feria de Alasitas (La Paz)\n*Unification Day (Romania). January 24. http://en.wikipedia.org/?curid=15954."
  }
}
