{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13652",
  "eid" : "0c159f00-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778529520,
  "textBody" : "Hindi (Devanagari: हिन्दी,  IAST:  Hindī), or Modern Standard Hindi (Devanagari: मानक हिन्दी,  IAST:  Mānak Hindī) is a standardised and sanskritised register of the Hindustani language. Modern Hindi and its literary tradition evolved towards the end of the 18th century.\n\nAlong with the English language, Hindi written in the Devanagari script is the official language of the Government of India. On 14 September 1949, the Constituent Assembly of India adopted Hindi written in Devanagari script as the official language of the Republic of India. To this end, several stalwarts rallied and lobbied pan-India in favor of Hindi, most notably Beohar Rajendra Simha along with Hazari Prasad Dwivedi, Kaka Kalelkar, Maithili Sharan Gupt and Seth Govind Das who even debated in Parliament on this issue. As such, on the 50th birthday of Beohar Rajendra Simha on 14 September 1949, the efforts came to fruition following adoption of Hindi as the official language. It is one of the 22 scheduled languages of the Republic of India. However, it is not the national language of India because no language was given such a status in the Indian constitution.\n\nHindi is the lingua franca of the so-called Hindi belt, and to a lesser extent the whole of India (usually in a simplified or pidginized variety such as Bazaar Hindustani or Haflong Hindi). Outside India, several other languages are recognized officially as \"Hindi\" but do not refer to the Standard Hindi language described here and instead descend from other related Indo-Aryan languages such as Awadhi and Bhojpuri. Such languages include Fiji Hindi, which is official in Fiji, and recognised regional languages in Mauritius, Trinidad and Tobago, Guyana, and Suriname.[http://www.fiji.gov.fj/getattachment/5912a2ce-0260-4df5-98b9-955360cd3aad/Click-here-to-download-the-Fiji-Constitution-(Hind.aspx रिपब्लिक ऑफ फीजी का संविधान (Constitution of the Republic of Fiji, the Hindi version)]  Apart from specialized vocabulary, Hindi is mutually intelligible with Standard Urdu, another recognized register of Hindustani.\n\nIndividually, as a linguistic variety, Hindi is the fourth most-spoken first language in the world, after Mandarin, Spanish and English.Mikael Parkvall, \"Världens 100 största språk 2007\" (The World's 100 Largest Languages in 2007), in Nationalencyklopedin. Asterisks mark the [http://www.ne.se/spr%C3%A5k/v%C3%A4rldens-100-st%C3%B6rsta-spr%C3%A5k-2010 2010 estimates]  for the top dozen languages. Alongside Urdu as Hindustani, it is the third most-spoken language in the world, after Mandarin and English.\n\nEtymology\n\nThe term Hindī originally was used to refer to inhabitants of the region east of the Indus. It was borrowed from Classical Persian Hindī (Iranian Persian Hendi), meaning \"Indian\", from the proper noun Hind \"India\".\n\nThe name Hindavī was used by Amir Khusrow in his poetry.\n\nHistory\n\nLike other Indo-Aryan languages, Hindi a direct descendant of an early form of Vedic Sanskrit, through Sauraseni Prakrit and Śauraseni Apabhraṃśa (from Sanskrit apabhraṃśa \"corrupted\"), which emerged in the 7th century A.D.\n\nModern Standard Hindi is based on the Khariboli dialect, the vernacular of Delhi and the surrounding region, which came to replace earlier prestige dialects such as Awadhi, Maithili (sometimes regarded as separate from the Hindi dialect continuum) and Braj. Urdu – another form of Hindustani – acquired linguistic prestige in the later Mughal period (1800s), and underwent significant Persian influence. In the late 19th century, a movement to develop Hindi as a standardised form of Hindustani separate from Urdu took form. In 1881, Bihar accepted Hindi as its sole official language, replacing Urdu, and thus became the first state of India to adopt Hindi.Parthasarathy, Kumar, p.120 Modern Standard Hindi is one of the youngest Indian languages in this regard.\n\nAfter independence, the government of India instituted the following conventions:\n* standardisation of grammar: In 1954, the Government of India set up a committee to prepare a grammar of Hindi; The committee's report was released in 1958 as A Basic Grammar of Modern Hindi.\n* standardisation of the orthography, using the Devanagari script, by the Central Hindi Directorate of the Ministry of Education and Culture to bring about uniformity in writing, to improve the shape of some Devanagari characters, and introducing diacritics to express sounds from other languages.\n\nThe Constituent Assembly adopted Hindi as an official language of India on 14 September 1949. Now, it is celebrated as Hindi Day.\n\nUse outside the Hindi Belt\n\nIn Northeast India a pidgin known as Haflong Hindi has developed as a lingua franca for various tribes in Assam that speak other languages natively.\n\nStatus\n\nPart XVII of the Indian Constitution deals with the official language of the Indian Commonwealth. Under Article 343, the official languages of the Union has been prescribed, which includes Hindi in Devanagari script and English:\n\n(1) The official language of the Union shall be Hindi in Devanagari script. The form of numerals to be used for the official purposes of the Union shall be the international form of Indian numerals.\n(2) Notwithstanding anything in clause (1), for a period of fifteen years from the commencement of this Constitution, the English language shall continue to be used for all the official purposes of the Union for which it was being used immediately before such commencement: Provided that the President may, during the said period, by order authorize the use of the Hindi language in addition to the English language and of the Devanagari form of numerals in addition to the international form of Indian numerals for any of the official purposes of the Union\n\nArticle 351 of the Indian constitution states\n\nIt shall be the duty of the Union to promote the spread of the Hindi language, to develop it so that it may serve as a medium of expression for all the elements of the composite culture of India and to secure its enrichment by assimilating without interfering with its genius, the forms, style and expressions used in Hindustani and in the other languages of India specified in the Eighth Schedule, and by drawing, wherever necessary or desirable, for its vocabulary, primarily on Sanskrit and secondarily on other languages. \n\nIt was envisioned that Hindi would become the sole working language of the Union Government by 1965 (per directives in Article 344 (2) and Article 351), with state governments being free to function in the language of their own choice. However, widespread resistance to the imposition of Hindi on non-native speakers, especially in South India (such as the those in Tamil Nadu) led to the passage of the Official Languages Act of 1963, which provided for the continued use of English indefinitely for all official purposes, although the constitutional directive for the Union Government to encourage the spread of Hindi was retained and has strongly influenced its policies.\n\nArticle 344 (2b)  stipulates that official language commission shall be constituted every ten years to recommend steps for progressive use of Hindi language and imposing restrictions on the use of the English language by the union government. In practice, the official language commissions are constantly endeavouring to promote Hindi but not imposing restrictions on English in official use by the union government.\n\nAt the state level, Hindi is the official language of the following Indian states: Bihar, Chhattisgarh, Haryana, Himachal Pradesh, Jharkhand, Madhya Pradesh, Rajasthan, Uttar Pradesh, and Uttarakhand. Each may also designate a \"co-official language\"; in Uttar Pradesh, for instance, depending on the political formation in power, this language is generally Urdu. Similarly, Hindi is accorded the status of official language in the following Union Territories: Andaman & Nicobar Islands, Chandigarh, Dadra & Nagar Haveli, Daman & Diu, National Capital Territory.\n\nNational language status for Hindi is a long-debated theme. In 2010, the Gujarat High Court clarified that Hindi is not the national language of India because the constitution does not mention it as such.\n\nOutside India\n\nOutside Asia, the Awadhi language (A Hindi dialect) is an official language in Fiji as per the 1997 Constitution of Fiji, where it referred to it as \"Hindustani\", however in the 2013 Constitution of Fiji, it is simply called \"Fiji Hindi\". It is spoken by 380,000 people in Fiji.\n\nHindi is also spoken by a large population of Madheshis (people having roots in north-India but have migrated to Nepal over hundreds of years) of Nepal. Apart from specialized vocabulary, Hindi is mutually intelligible with Standard Urdu, another recognized register of Hindustani. Hindi is quite easy to understand for some Pakistanis, who speak Urdu, which, like Hindi, is part of Hindustani. Apart from this, Hindi is spoken by the large Indian diaspora which hails from, or has its origin from the \"Hindi Belt\" of India. A substantially large North Indian diaspora lives in countries like The United States of America, the United Kingdom, the United Arab Emirates, Trinidad and Tobago, Guyana, Suriname, South Africa, Fiji and Mauritius, where it is natively spoken at home and among their own Hindustani-speaking communities. Outside India, Hindi speakers are 8 million in Nepal; 649,000 in United States of America; 450,170 in Mauritius; 380,000 in Fiji; 250,292 in South Africa; 150,000 in Suriname;Frawley, p. 481 100,000 in Uganda; 45,800 in United Kingdom; 20,000 in New Zealand; 20,000 in Germany; 16,000 in Trinidad and Tobago; 3,000 in Singapore.\n\nComparison with Modern Standard Urdu \n\nLinguistically, Hindi and Urdu are two registers of the same language and are mutually intelligble. Hindi is written in the Devanagari script and uses more Sanskrit words, whereas Urdu is written in the Perso-Arabic script and uses more Arabic and Persian words. Hindi is the most commonly used official language in India. Urdu is the national language and lingua franca of Pakistan and is one of 22 official languages of India.\n\nThe splitting of Hindi and Urdu into separate languages is largely motivated by politics, namely the Indo-Pakistani rivalry.\n\nScript\n\nHindi is written in the Devanagari script, an abugida. Devanagari consists of 11 vowels and 33 consonants and is written from left to right. Unlike for Sanskrit, Devanagari is not entirely phonetic for Hindi, especially failing to mark schwa dropping in spoken Standard Hindi.\n\nRomanization\n\nThe Government of India uses Hunterian transliteration as its official system of writing Hindi in the Latin script. Various other systems also exist, such as IAST, ITRANS and ISO 15919.\n\nVocabulary\n\nTraditionally, Hindi words are divided into five principal categories according to their etymology:\n\n* Tatsam (तत्सम \"same as that\") words: These are words which are spelled the same in Hindi as in Sanskrit (except for the absence of final case inflections).Masica, p. 65 They include words inherited from Sanskrit via Prakrit which have survived without modification (e.g. Hindi नाम nām / Sanskrit नाम nāma, \"name\"; Hindi कर्म karm / Sanskrit कर्म karma, \"deed, action; karma\"),Masica, p. 66 as well as forms borrowed directly from Sanskrit in more modern times (e.g. प्रार्थना prārthanā, \"prayer\").Masica, p. 67 Pronunciation, however, conforms to Hindi norms and may differ from that of classical Sanskrit. Amongst nouns, the tatsam word could be the Sanskrit non-inflected word-stem, or it could be the nominative singular form in the Sanskrit nominal declension.\n* Ardhatatsam (अर्धतत्सम \"semi-tatsama\") words: Such words are typically earlier loanwords from Sanskrit which have undergone sound changes subsequent to being borrowed. (e.g. Hindi सूरज sūraj from Sanskrit सूर्य surya)\n* Tadbhav (तद्भव \"born of that\") words: These are native Hindi words derived from Sanskrit after undergoing phonological rules (e.g. Sanskrit कर्म karma, \"deed\" becomes Sauraseni Prakrit कम्म kamma, and eventually Hindi काम kām, \"work\") and are spelled differently from Sanskrit.\n* Deshaj (देशज) words: These are words that were not borrowings but do not derive from attested Indo-Aryan words either. Belonging to this category are onomatopoetic words or ones borrowed from local non-Indo-Aryan languages.\n* Videshī (विदेशी \"foreign\") words: These include all loanwords from non-indigenous languages. The most frequent source languages in this category are Persian, Arabic, English and Portuguese. Examples are कमेटी kameṭī from English committee and साबुन sābun \"soap\" from Arabic.\n\nHindi also makes extensive use of loan translation (calqueing) and occasionally phono-semantic matching of English.\n\nPrakrit\n\nHindi has naturally inherited a large portion of its vocabulary from Śaurasenī Prākṛt, in the form of tadbhava words. This process usually involves compensatory lengthening of vowels preceding consonant clusters in Prakrit, e.g. Sanskrit tīkṣṇa > Prakrit tikkha > Hindi tīkhā.\n\nSanskrit\n\nMuch of Modern Standard Hindi's vocabulary is borrowed from Sanskrit as tatsam borrowings, especially in technical and academic fields. The formal Hindi standard, from which much of the Persian, Arabic and English vocabulary has been replaced by neologisms compounding tatsam words, is called Śuddh Hindi (pure Hindi), and is viewed as a more prestigious dialect over other more colloquial forms of Hindi.\n\nExcessive use of tatsam words sometimes creates problems for native speakers. They may have Sanskrit consonant clusters which do not exist in native Hindi, causing difficulties in pronunciation.\n\nAs a part of the process of Sanskritization, new words are coined using Sanskrit components to be used as replacements for supposedly foreign vocabulary. Usually these neologisms are calques of English words already adopted into spoken Hindi. Some terms such as dūrbhāṣ \"telephone\", literally \"far-speech\" and dūrdarśan \"television\", literally \"far-sight\" have even gained some currency in formal Hindi in the place of the English borrowings (ṭeli)fon and ṭīvī.\n\nPersian\n\nHindi also features significant Persian influence, standardised from spoken Hindustani. Early borrowings, beginning in the mid-12th century, were specific to Islam (e.g. Muhammad, islām) and so Persian was simply an intermediary for Arabic. Later, under the Delhi Sultanate and Mughal Empire, Persian became the primary administrative language in the Hindi heartland. Persian borrowings reached a heyday in the 17th century, pervading all aspects of life. Even grammatical constructs, namely the izafat, were assimilated into Hindi.\n\nPost-Partition the Indian government advocated for a policy of Sanskritization leading to a marginalization of the Persian element in Hindi. However, many Persian words (e.g. muśkil \"difficult\", bas \"enough\", havā \"air\", x(a)yāl \"thought\") have remained entrenched in spoken Modern Standard Hindi, and a larger amount are still used in Urdu poetry written in the Devanagari script.\n\nArabic\n\nArabic also shows influence in Hindi, often via Persian but sometimes directly.\n\nMedia\n\nLiterature\n\nHindi literature is broadly divided into four prominent forms or styles, being Bhakti (devotional – Kabir, Raskhan); Śṛṇgār (beauty – Keshav, Bihari); Vīgāthā (epic); and Ādhunik (modern).\n\nMedieval Hindi literature is marked by the influence of Bhakti movement and the composition of long, epic poems. It was primarily written in other varieties of Hindi, particularly Avadhi and Braj Bhasha, but to a degree also in Khariboli, the basis for Modern Standard Hindi. During the British Raj, Hindustani became the prestige dialect.\n\nChandrakanta, written by Devaki Nandan Khatri in 1888, is considered the first authentic work of prose in modern Hindi. The person who brought realism in the Hindi prose literature was Munshi Premchand, who is considered as the most revered figure in the world of Hindi fiction and progressive movement. Literary, or Sāhityik, Hindi was popularised by the writings of Swami Dayananda Saraswati, Bhartendu Harishchandra and others. The rising numbers of newspapers and magazines made Hindustani popular with the educated people.\n\nThe Dvivedī Yug (\"Age of Dwivedi\") in Hindi literature lasted from 1900 to 1918. It is named after Mahavir Prasad Dwivedi, who played a major role in establishing Modern Standard Hindi in poetry and broadening the acceptable subjects of Hindi poetry from the traditional ones of religion and romantic love.\n\nIn the 20th century, Hindi literature saw a romantic upsurge. This is known as Chāyāvād (shadow-ism) and the literary figures belonging to this school are known as Chāyāvādī. Jaishankar Prasad, Suryakant Tripathi 'Nirala', Mahadevi Varma and Sumitranandan Pant, are the four major Chāyāvādī poets.\n\nUttar Ādhunik is the post-modernist period of Hindi literature, marked by a questioning of early trends that copied the West as well as the excessive ornamentation of the Chāyāvādī movement, and by a return to simple language and natural themes.\n\nInternet\n\nThe Hindi Wikipedia was the first Indic-language wiki to reach 100,000 articles. Hindi literature, music, and film have all been disseminated via the internet. In 2015, Google reported a 94% increase in Hindi-content consumption year-on-year, adding that 21% of users in India prefer content in Hindi.\n\nMany Hindi newspapers also offer digital editions.\n\nSample text\n\nThe following is a sample text in High Hindi, of the Article 1 of the Universal Declaration of Human Rights (by the United Nations):\n;Hindi\nअनुच्छेद 1 (एक) – सभी मनुष्यों को गौरव और अधिकारों के विषय में जन्मजात स्वतन्त्रता और समानता प्राप्त हैं। उन्हें बुद्धि और अन्तरात्मा की देन प्राप्त है और परस्पर उन्हें भाईचारे के भाव से बर्ताव करना चाहिए।\n\n;Transliteration (IAST):\nAnucched 1 (ek) – Sabhī manuṣyõ ko gaurav aur adhikārõ ke viṣay mẽ janmajāt svatantratā aur samāntā prāpt hai. Unhẽ buddhi aur antarātmā kī den prāpt hai aur paraspar unhẽ bhāīcāre ke bhāv se bartāv karnā cāhie.\n\n;Transcription (IPA):\n;Gloss (word-to-word):\nArticle 1 (one) – All human-beings to dignity and rights' matter in from-birth freedom and equality acquired is. Them to reason and conscience's endowment acquired is and always them to brotherhood's spirit with behaviour to do should.\n\n;Translation (grammatical):\nArticle 1 – All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hindi" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13652" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hindi (Devanagari: हिन्दी,  IAST:  Hindī), or Modern Standard Hindi (Devanagari: मानक हिन्दी,  IAST:  Mānak Hindī) is a standardised and sanskritised register of the Hindustani language. Modern Hindi and its literary tradition evolved towards the end of the 18th century.\n\nAlong with the English language, Hindi written in the Devanagari script is the official language of the Government of India. On 14 September 1949, the Constituent Assembly of India adopted Hindi written in Devanagari script as the official language of the Republic of India. To this end, several stalwarts rallied and lobbied pan-India in favor of Hindi, most notably Beohar Rajendra Simha along with Hazari Prasad Dwivedi, Kaka Kalelkar, Maithili Sharan Gupt and Seth Govind Das who even debated in Parliament on this issue. As such, on the 50th birthday of Beohar Rajendra Simha on 14 September 1949, the efforts came to fruition following adoption of Hindi as the official language. It is one of the 22 scheduled languages of the Republic of India. However, it is not the national language of India because no language was given such a status in the Indian constitution.\n\nHindi is the lingua franca of the so-called Hindi belt, and to a lesser extent the whole of India (usually in a simplified or pidginized variety such as Bazaar Hindustani or Haflong Hindi). Outside India, several other languages are recognized officially as \"Hindi\" but do not refer to the Standard Hindi language described here and instead descend from other related Indo-Aryan languages such as Awadhi and Bhojpuri. Such languages include Fiji Hindi, which is official in Fiji, and recognised regional languages in Mauritius, Trinidad and Tobago, Guyana, and Suriname.[http://www.fiji.gov.fj/getattachment/5912a2ce-0260-4df5-98b9-955360cd3aad/Click-here-to-download-the-Fiji-Constitution-(Hind.aspx रिपब्लिक ऑफ फीजी का संविधान (Constitution of the Republic of Fiji, the Hindi version)]  Apart from specialized vocabulary, Hindi is mutually intelligible with Standard Urdu, another recognized register of Hindustani.\n\nIndividually, as a linguistic variety, Hindi is the fourth most-spoken first language in the world, after Mandarin, Spanish and English.Mikael Parkvall, \"Världens 100 största språk 2007\" (The World's 100 Largest Languages in 2007), in Nationalencyklopedin. Asterisks mark the [http://www.ne.se/spr%C3%A5k/v%C3%A4rldens-100-st%C3%B6rsta-spr%C3%A5k-2010 2010 estimates]  for the top dozen languages. Alongside Urdu as Hindustani, it is the third most-spoken language in the world, after Mandarin and English.\n\nEtymology\n\nThe term Hindī originally was used to refer to inhabitants of the region east of the Indus. It was borrowed from Classical Persian Hindī (Iranian Persian Hendi), meaning \"Indian\", from the proper noun Hind \"India\".\n\nThe name Hindavī was used by Amir Khusrow in his poetry.\n\nHistory\n\nLike other Indo-Aryan languages, Hindi a direct descendant of an early form of Vedic Sanskrit, through Sauraseni Prakrit and Śauraseni Apabhraṃśa (from Sanskrit apabhraṃśa \"corrupted\"), which emerged in the 7th century A.D.\n\nModern Standard Hindi is based on the Khariboli dialect, the vernacular of Delhi and the surrounding region, which came to replace earlier prestige dialects such as Awadhi, Maithili (sometimes regarded as separate from the Hindi dialect continuum) and Braj. Urdu – another form of Hindustani – acquired linguistic prestige in the later Mughal period (1800s), and underwent significant Persian influence. In the late 19th century, a movement to develop Hindi as a standardised form of Hindustani separate from Urdu took form. In 1881, Bihar accepted Hindi as its sole official language, replacing Urdu, and thus became the first state of India to adopt Hindi.Parthasarathy, Kumar, p.120 Modern Standard Hindi is one of the youngest Indian languages in this regard.\n\nAfter independence, the government of India instituted the following conventions:\n* standardisation of grammar: In 1954, the Government of India set up a committee to prepare a grammar of Hindi; The committee's report was released in 1958 as A Basic Grammar of Modern Hindi.\n* standardisation of the orthography, using the Devanagari script, by the Central Hindi Directorate of the Ministry of Education and Culture to bring about uniformity in writing, to improve the shape of some Devanagari characters, and introducing diacritics to express sounds from other languages.\n\nThe Constituent Assembly adopted Hindi as an official language of India on 14 September 1949. Now, it is celebrated as Hindi Day.\n\nUse outside the Hindi Belt\n\nIn Northeast India a pidgin known as Haflong Hindi has developed as a lingua franca for various tribes in Assam that speak other languages natively.\n\nStatus\n\nPart XVII of the Indian Constitution deals with the official language of the Indian Commonwealth. Under Article 343, the official languages of the Union has been prescribed, which includes Hindi in Devanagari script and English:\n\n(1) The official language of the Union shall be Hindi in Devanagari script. The form of numerals to be used for the official purposes of the Union shall be the international form of Indian numerals.\n(2) Notwithstanding anything in clause (1), for a period of fifteen years from the commencement of this Constitution, the English language shall continue to be used for all the official purposes of the Union for which it was being used immediately before such commencement: Provided that the President may, during the said period, by order authorize the use of the Hindi language in addition to the English language and of the Devanagari form of numerals in addition to the international form of Indian numerals for any of the official purposes of the Union\n\nArticle 351 of the Indian constitution states\n\nIt shall be the duty of the Union to promote the spread of the Hindi language, to develop it so that it may serve as a medium of expression for all the elements of the composite culture of India and to secure its enrichment by assimilating without interfering with its genius, the forms, style and expressions used in Hindustani and in the other languages of India specified in the Eighth Schedule, and by drawing, wherever necessary or desirable, for its vocabulary, primarily on Sanskrit and secondarily on other languages. \n\nIt was envisioned that Hindi would become the sole working language of the Union Government by 1965 (per directives in Article 344 (2) and Article 351), with state governments being free to function in the language of their own choice. However, widespread resistance to the imposition of Hindi on non-native speakers, especially in South India (such as the those in Tamil Nadu) led to the passage of the Official Languages Act of 1963, which provided for the continued use of English indefinitely for all official purposes, although the constitutional directive for the Union Government to encourage the spread of Hindi was retained and has strongly influenced its policies.\n\nArticle 344 (2b)  stipulates that official language commission shall be constituted every ten years to recommend steps for progressive use of Hindi language and imposing restrictions on the use of the English language by the union government. In practice, the official language commissions are constantly endeavouring to promote Hindi but not imposing restrictions on English in official use by the union government.\n\nAt the state level, Hindi is the official language of the following Indian states: Bihar, Chhattisgarh, Haryana, Himachal Pradesh, Jharkhand, Madhya Pradesh, Rajasthan, Uttar Pradesh, and Uttarakhand. Each may also designate a \"co-official language\"; in Uttar Pradesh, for instance, depending on the political formation in power, this language is generally Urdu. Similarly, Hindi is accorded the status of official language in the following Union Territories: Andaman & Nicobar Islands, Chandigarh, Dadra & Nagar Haveli, Daman & Diu, National Capital Territory.\n\nNational language status for Hindi is a long-debated theme. In 2010, the Gujarat High Court clarified that Hindi is not the national language of India because the constitution does not mention it as such.\n\nOutside India\n\nOutside Asia, the Awadhi language (A Hindi dialect) is an official language in Fiji as per the 1997 Constitution of Fiji, where it referred to it as \"Hindustani\", however in the 2013 Constitution of Fiji, it is simply called \"Fiji Hindi\". It is spoken by 380,000 people in Fiji.\n\nHindi is also spoken by a large population of Madheshis (people having roots in north-India but have migrated to Nepal over hundreds of years) of Nepal. Apart from specialized vocabulary, Hindi is mutually intelligible with Standard Urdu, another recognized register of Hindustani. Hindi is quite easy to understand for some Pakistanis, who speak Urdu, which, like Hindi, is part of Hindustani. Apart from this, Hindi is spoken by the large Indian diaspora which hails from, or has its origin from the \"Hindi Belt\" of India. A substantially large North Indian diaspora lives in countries like The United States of America, the United Kingdom, the United Arab Emirates, Trinidad and Tobago, Guyana, Suriname, South Africa, Fiji and Mauritius, where it is natively spoken at home and among their own Hindustani-speaking communities. Outside India, Hindi speakers are 8 million in Nepal; 649,000 in United States of America; 450,170 in Mauritius; 380,000 in Fiji; 250,292 in South Africa; 150,000 in Suriname;Frawley, p. 481 100,000 in Uganda; 45,800 in United Kingdom; 20,000 in New Zealand; 20,000 in Germany; 16,000 in Trinidad and Tobago; 3,000 in Singapore.\n\nComparison with Modern Standard Urdu \n\nLinguistically, Hindi and Urdu are two registers of the same language and are mutually intelligble. Hindi is written in the Devanagari script and uses more Sanskrit words, whereas Urdu is written in the Perso-Arabic script and uses more Arabic and Persian words. Hindi is the most commonly used official language in India. Urdu is the national language and lingua franca of Pakistan and is one of 22 official languages of India.\n\nThe splitting of Hindi and Urdu into separate languages is largely motivated by politics, namely the Indo-Pakistani rivalry.\n\nScript\n\nHindi is written in the Devanagari script, an abugida. Devanagari consists of 11 vowels and 33 consonants and is written from left to right. Unlike for Sanskrit, Devanagari is not entirely phonetic for Hindi, especially failing to mark schwa dropping in spoken Standard Hindi.\n\nRomanization\n\nThe Government of India uses Hunterian transliteration as its official system of writing Hindi in the Latin script. Various other systems also exist, such as IAST, ITRANS and ISO 15919.\n\nVocabulary\n\nTraditionally, Hindi words are divided into five principal categories according to their etymology:\n\n* Tatsam (तत्सम \"same as that\") words: These are words which are spelled the same in Hindi as in Sanskrit (except for the absence of final case inflections).Masica, p. 65 They include words inherited from Sanskrit via Prakrit which have survived without modification (e.g. Hindi नाम nām / Sanskrit नाम nāma, \"name\"; Hindi कर्म karm / Sanskrit कर्म karma, \"deed, action; karma\"),Masica, p. 66 as well as forms borrowed directly from Sanskrit in more modern times (e.g. प्रार्थना prārthanā, \"prayer\").Masica, p. 67 Pronunciation, however, conforms to Hindi norms and may differ from that of classical Sanskrit. Amongst nouns, the tatsam word could be the Sanskrit non-inflected word-stem, or it could be the nominative singular form in the Sanskrit nominal declension.\n* Ardhatatsam (अर्धतत्सम \"semi-tatsama\") words: Such words are typically earlier loanwords from Sanskrit which have undergone sound changes subsequent to being borrowed. (e.g. Hindi सूरज sūraj from Sanskrit सूर्य surya)\n* Tadbhav (तद्भव \"born of that\") words: These are native Hindi words derived from Sanskrit after undergoing phonological rules (e.g. Sanskrit कर्म karma, \"deed\" becomes Sauraseni Prakrit कम्म kamma, and eventually Hindi काम kām, \"work\") and are spelled differently from Sanskrit.\n* Deshaj (देशज) words: These are words that were not borrowings but do not derive from attested Indo-Aryan words either. Belonging to this category are onomatopoetic words or ones borrowed from local non-Indo-Aryan languages.\n* Videshī (विदेशी \"foreign\") words: These include all loanwords from non-indigenous languages. The most frequent source languages in this category are Persian, Arabic, English and Portuguese. Examples are कमेटी kameṭī from English committee and साबुन sābun \"soap\" from Arabic.\n\nHindi also makes extensive use of loan translation (calqueing) and occasionally phono-semantic matching of English.\n\nPrakrit\n\nHindi has naturally inherited a large portion of its vocabulary from Śaurasenī Prākṛt, in the form of tadbhava words. This process usually involves compensatory lengthening of vowels preceding consonant clusters in Prakrit, e.g. Sanskrit tīkṣṇa > Prakrit tikkha > Hindi tīkhā.\n\nSanskrit\n\nMuch of Modern Standard Hindi's vocabulary is borrowed from Sanskrit as tatsam borrowings, especially in technical and academic fields. The formal Hindi standard, from which much of the Persian, Arabic and English vocabulary has been replaced by neologisms compounding tatsam words, is called Śuddh Hindi (pure Hindi), and is viewed as a more prestigious dialect over other more colloquial forms of Hindi.\n\nExcessive use of tatsam words sometimes creates problems for native speakers. They may have Sanskrit consonant clusters which do not exist in native Hindi, causing difficulties in pronunciation.\n\nAs a part of the process of Sanskritization, new words are coined using Sanskrit components to be used as replacements for supposedly foreign vocabulary. Usually these neologisms are calques of English words already adopted into spoken Hindi. Some terms such as dūrbhāṣ \"telephone\", literally \"far-speech\" and dūrdarśan \"television\", literally \"far-sight\" have even gained some currency in formal Hindi in the place of the English borrowings (ṭeli)fon and ṭīvī.\n\nPersian\n\nHindi also features significant Persian influence, standardised from spoken Hindustani. Early borrowings, beginning in the mid-12th century, were specific to Islam (e.g. Muhammad, islām) and so Persian was simply an intermediary for Arabic. Later, under the Delhi Sultanate and Mughal Empire, Persian became the primary administrative language in the Hindi heartland. Persian borrowings reached a heyday in the 17th century, pervading all aspects of life. Even grammatical constructs, namely the izafat, were assimilated into Hindi.\n\nPost-Partition the Indian government advocated for a policy of Sanskritization leading to a marginalization of the Persian element in Hindi. However, many Persian words (e.g. muśkil \"difficult\", bas \"enough\", havā \"air\", x(a)yāl \"thought\") have remained entrenched in spoken Modern Standard Hindi, and a larger amount are still used in Urdu poetry written in the Devanagari script.\n\nArabic\n\nArabic also shows influence in Hindi, often via Persian but sometimes directly.\n\nMedia\n\nLiterature\n\nHindi literature is broadly divided into four prominent forms or styles, being Bhakti (devotional – Kabir, Raskhan); Śṛṇgār (beauty – Keshav, Bihari); Vīgāthā (epic); and Ādhunik (modern).\n\nMedieval Hindi literature is marked by the influence of Bhakti movement and the composition of long, epic poems. It was primarily written in other varieties of Hindi, particularly Avadhi and Braj Bhasha, but to a degree also in Khariboli, the basis for Modern Standard Hindi. During the British Raj, Hindustani became the prestige dialect.\n\nChandrakanta, written by Devaki Nandan Khatri in 1888, is considered the first authentic work of prose in modern Hindi. The person who brought realism in the Hindi prose literature was Munshi Premchand, who is considered as the most revered figure in the world of Hindi fiction and progressive movement. Literary, or Sāhityik, Hindi was popularised by the writings of Swami Dayananda Saraswati, Bhartendu Harishchandra and others. The rising numbers of newspapers and magazines made Hindustani popular with the educated people.\n\nThe Dvivedī Yug (\"Age of Dwivedi\") in Hindi literature lasted from 1900 to 1918. It is named after Mahavir Prasad Dwivedi, who played a major role in establishing Modern Standard Hindi in poetry and broadening the acceptable subjects of Hindi poetry from the traditional ones of religion and romantic love.\n\nIn the 20th century, Hindi literature saw a romantic upsurge. This is known as Chāyāvād (shadow-ism) and the literary figures belonging to this school are known as Chāyāvādī. Jaishankar Prasad, Suryakant Tripathi 'Nirala', Mahadevi Varma and Sumitranandan Pant, are the four major Chāyāvādī poets.\n\nUttar Ādhunik is the post-modernist period of Hindi literature, marked by a questioning of early trends that copied the West as well as the excessive ornamentation of the Chāyāvādī movement, and by a return to simple language and natural themes.\n\nInternet\n\nThe Hindi Wikipedia was the first Indic-language wiki to reach 100,000 articles. Hindi literature, music, and film have all been disseminated via the internet. In 2015, Google reported a 94% increase in Hindi-content consumption year-on-year, adding that 21% of users in India prefer content in Hindi.\n\nMany Hindi newspapers also offer digital editions.\n\nSample text\n\nThe following is a sample text in High Hindi, of the Article 1 of the Universal Declaration of Human Rights (by the United Nations):\n;Hindi\nअनुच्छेद 1 (एक) – सभी मनुष्यों को गौरव और अधिकारों के विषय में जन्मजात स्वतन्त्रता और समानता प्राप्त हैं। उन्हें बुद्धि और अन्तरात्मा की देन प्राप्त है और परस्पर उन्हें भाईचारे के भाव से बर्ताव करना चाहिए।\n\n;Transliteration (IAST):\nAnucched 1 (ek) – Sabhī manuṣyõ ko gaurav aur adhikārõ ke viṣay mẽ janmajāt svatantratā aur samāntā prāpt hai. Unhẽ buddhi aur antarātmā kī den prāpt hai aur paraspar unhẽ bhāīcāre ke bhāv se bartāv karnā cāhie.\n\n;Transcription (IPA):\n;Gloss (word-to-word):\nArticle 1 (one) – All human-beings to dignity and rights' matter in from-birth freedom and equality acquired is. Them to reason and conscience's endowment acquired is and always them to brotherhood's spirit with behaviour to do should.\n\n;Translation (grammatical):\nArticle 1 – All human beings are born free and equal in dignity and rights. They are endowed with reason and conscience and should act towards one another in a spirit of brotherhood. Hindi. http://en.wikipedia.org/?curid=13652."
  }
}
