{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17699",
  "eid" : "2d6a2ef0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778585439,
  "textBody" : "Argument from ignorance (from ), also known as appeal to ignorance (in which ignorance represents \"a lack of contrary evidence\") is a fallacy in informal logic. It asserts that a proposition is true because it has not yet been proven false or a proposition is false because it has not yet been proven true.  This represents a type of false dichotomy in that it excludes a third option, which is that there may have been an insufficient investigation, and therefore there is insufficient information to prove the proposition be either true or false.  Nor does it allow the admission that the choices may in fact not be two (true or false), but may be as many as four,\n# true\n# false\n# unknown between true or false\n#being unknowable (among the first three). \nIn debates, appeals to ignorance are sometimes used in an attempt to shift the burden of proof.\n\nOverview \n\nBasic argument\n\nAs described in Schreuder's Vision and Visual Perception:\n\nTo reiterate, these arguments ignore the fact, and difficulty, that some true things may never be proved, and some false things may never be disproved with absolute certainty.\nThe phrase \"the absence of evidence is not the evidence of absence\" can be used as a shorthand rebuttal to the second form of the ignorance fallacy (i.e. P has never been absolutely proved and is therefore certainly false). Most often it is directed at any conclusion derived from null results in an experiment or from the non-detection of something. In other words, where one researcher may say their experiment suggests evidence of absence, another researcher might argue that the experiment failed to detect a phenomenon for other reasons.\n\nMatters of confusion\n\nMuch confusion about arguments from ignorance can be caused when one side of a debate forgets that we often possess evidence of absence in practice. However, the confusion can be avoided by not partaking in a logical debate.\n\nThe ignorance fallacy is sometimes confused (or combined) with logically valid contrapositive arguments. Contrapositive arguments rightly utilize the transposition rule of inference in classical logic to conclude something like: To the extent that C implies E then Not-E must also imply Not-C. In other words, if a cause always leads to an effect, then absence of the expected effect is evidence of absence of the cause. For example, if the causal proposition that If it's raining outside then the streets will be wet is assumed, then it can be assumed that if the streets are not wet then it is not raining outside. The inference that it cannot be raining outside because the streets are not getting wet is exactly as true, or perhaps exactly as untrue, as the original proposition. The statements are logically equivalent.\n\nCarl Sagan explains in his book The Demon-Haunted World:\n\nFor instance, absence of evidence that it rained (i.e. water is the evidence) may be considered positive evidence that it did not rain. Again, in science, such inferences are always made to some limited (sometimes extremely high) degree of probability and in this case absence of evidence is evidence of absence when the positive evidence should have been there but is not.\n\nArguments from ignorance can easily find their way into debates over the existence of God. It is a fallacy to draw conclusions based precisely on ignorance, since this does not satisfactorily address issues of philosophic burden of proof.\n\nRelated terms\n\nContraposition and transposition \n\nContraposition is a logically valid rule of inference that allows the creation of a new proposition from the negation and reordering of an existing one. The method applies to any proposition of the type If A then B and says that negating all the variables and switching them back to front leads to a new proposition i.e. If Not-B then Not-A that is just as true as the original one and that the first implies the second and the second implies the first.\n\nTransposition is exactly the same thing as Contraposition, described in a different language.\n\nAbsence of evidence \n\nAbsence of evidence, is the lack of - any kind of evidence - that may show, indicate, suggest, or be used to 1) infer, or 2) deduce the truthfulness of an asserted fact.\n\nNegative evidence \n\nNegative evidence is sometimes used as an alternative to absence of evidence and is often meant to be synonymous with it. On the other hand, the term may also refer to evidence with a negative value, or null result equivalent to evidence of absence. It may even refer to positive evidence about something of an unpleasant nature.\n\nEvidence of absence \n\nEvidence of absence is evidence of any kind that can be used to infer or deduce the non-existence or non-presence of something. For instance, if a doctor does not find any malignant cells in a patient this null result (finding nothing) is evidence of absence of cancer, even though the doctor has not actually detected anything per se. Such inductive reasoning is important to empiricism and science, but has well established limitations. The challenge thus becomes to try to identify when a researcher has received a null result (found nothing) because the thing does not exist (evidence of absence—objectively negative result), and when one simply lacks proper means of detection (absence of evidence—false negative).\nNull result \n\nNull result is a term often used in science to indicate evidence of absence. A search for water on the ground may yield a null result (the ground is dry); therefore, it probably did not rain.\n\nRelated arguments\n\nArgument from self-knowing (auto-epistemic) \n\nArguments from self-knowing take the form:\n\n# If P were true then I would know it; in fact I do not know it; therefore P cannot be true.\n# If P were false then I would know it; in fact I do not know it; therefore P cannot be false.\n\nIn practice these arguments are often fallacious and rely on the veracity of the supporting premise. For example, the argument that If I had just sat on a wild porcupine then I would know it; in fact I do not know it; therefore I did not just sit on a wild porcupine is probably not a fallacy and depends entirely on the veracity of the leading proposition that supports it. (See Contraposition and Transposition in the Related terms section in this article.)\n\nDistinguishing absence of evidence from evidence of absence \n\nAbsence of evidence is a condition in which no valid conclusion can be inferred from the mere absence of detection, normally due to doubt in the detection method. Evidence of absence is the successful variation: a conclusion that relies on specific knowledge in conjunction with negative detection to deduce the absence of something. An example of evidence of absence is checking your pockets for spare change and finding nothing, but being confident that the search would have found it if it was there.\n\nFormal argument\n\nBy determining that a given experiment or method of detection is sensitive and reliable enough to detect the presence of X (when X is present) one can confidently exclude the possibility that X may be both undetected and present. This allows one to deduce that X cannot be present if a null result is received.\n\nThus there are only two possibilities, given a null result:\n# Nothing detected, and X is not present.\n# Nothing detected, but X is present (option eliminated by careful research design).\n\nTo the extent that option 2 can be eliminated, one can deduce that if X is not detected then X is not present and therefore the null result is evidence of absence.\n\nExamples \n\n Absence of evidence \n\n(These examples contain or represent missing information.)\n\n* Statements that begin with \"I can't prove it but ...\" are often referring to some kind absence of evidence.\n* \"There is no evidence of foul play here\" is a direct reference to the absence of evidence.\n* \"There is no evidence of aliens, and therefore, aliens do not exist\" appeals to an absence of evidence\n\nNegative results \n\n* When the doctor says that the test results were negative, it is usually good news.\n* Under \"Termites\" the inspector checked the box that read \"no\".\n\nEvidence of absence \n\n(These examples contain definite evidence that can be used to show, indicate, suggest, infer or deduce the non-existence or non-presence of something.)\n\n* A biopsy shows the absence of malignant cells.\n* One very carefully inspects the back seat of one's car and finds no adult-sized kangaroos.\n* The train schedule does not say that the train stops here at 3:00pm on a Sunday. (It could indeed happen that the train will stop here for another reason than the actual schedule, e. g. due to an incident or technical reasons, but the evidence clearly proves that the train schedule does not include a halt at this station.)\n\nArguments from ignorance \n\n(Draws a conclusion based on lack of knowledge or evidence without accounting for all possibilities)\n* \"I take the view that this lack (of enemy subversive activity in the west coast) is the most ominous sign in our whole situation. It convinces me more than perhaps any other factor that the sabotage we are to get, the Fifth Column activities are to get, are timed just like Pearl Harbor ... I believe we are just being lulled into a false sense of security.\" – Earl Warren, then California's Attorney General  (before a congressional hearing in San Francisco on 21 February 1942).\n* This example clearly states what appeal to ignorance is: \"Although we have proven that the moon is not made of spare ribs, we have not proven that its core cannot be filled with them; therefore, the moon’s core is filled with spare ribs.\"\n\nPrinciples in law \n\nThe presumption of innocence is often mentioned when discussing the argumentum ad ignorantiam. \n* The presumption of innocence, if present, effectively removes the possibility that the accused may be both guilty and unproven, from consideration in judgment, and as such the accused is considered as innocent unless proven guilty. (See decision table below)\n*# Innocent and guilt is unproven. Judged as innocent.\n*# Innocent and guilt is proven. Judged as guilty. (Jury is biased, misled, makes error; false evidence fabricated etc.)\n*# Guilty and guilt is unproven. Judged as innocent. (Presumption of innocence)\n*# Guilty and guilt is proven. Judged as guilty. (Innocent unless/until proven guilty is a summary of this and easier to remember.)\n\nOrigin of the term \n\nFrom Fallacies: classical and contemporary readings by Hans V. Hansen, Robert C. Pinto:\n\"It is generally accepted that the philosopher John Locke introduced the term in his Essay Concerning Human Understanding:\"\n:\"Another way that Men ordinarily use to drive others, and force them to submit their Judgments, and receive the Opinion in debate, is to require the Adversary to admit what they allege as a Proof, or assign a better. And this I call Argumentum ad Ignorantiam\" —John Locke",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Argument from ignorance" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17699" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Argument from ignorance (from ), also known as appeal to ignorance (in which ignorance represents \"a lack of contrary evidence\") is a fallacy in informal logic. It asserts that a proposition is true because it has not yet been proven false or a proposition is false because it has not yet been proven true.  This represents a type of false dichotomy in that it excludes a third option, which is that there may have been an insufficient investigation, and therefore there is insufficient information to prove the proposition be either true or false.  Nor does it allow the admission that the choices may in fact not be two (true or false), but may be as many as four,\n# true\n# false\n# unknown between true or false\n#being unknowable (among the first three). \nIn debates, appeals to ignorance are sometimes used in an attempt to shift the burden of proof.\n\nOverview \n\nBasic argument\n\nAs described in Schreuder's Vision and Visual Perception:\n\nTo reiterate, these arguments ignore the fact, and difficulty, that some true things may never be proved, and some false things may never be disproved with absolute certainty.\nThe phrase \"the absence of evidence is not the evidence of absence\" can be used as a shorthand rebuttal to the second form of the ignorance fallacy (i.e. P has never been absolutely proved and is therefore certainly false). Most often it is directed at any conclusion derived from null results in an experiment or from the non-detection of something. In other words, where one researcher may say their experiment suggests evidence of absence, another researcher might argue that the experiment failed to detect a phenomenon for other reasons.\n\nMatters of confusion\n\nMuch confusion about arguments from ignorance can be caused when one side of a debate forgets that we often possess evidence of absence in practice. However, the confusion can be avoided by not partaking in a logical debate.\n\nThe ignorance fallacy is sometimes confused (or combined) with logically valid contrapositive arguments. Contrapositive arguments rightly utilize the transposition rule of inference in classical logic to conclude something like: To the extent that C implies E then Not-E must also imply Not-C. In other words, if a cause always leads to an effect, then absence of the expected effect is evidence of absence of the cause. For example, if the causal proposition that If it's raining outside then the streets will be wet is assumed, then it can be assumed that if the streets are not wet then it is not raining outside. The inference that it cannot be raining outside because the streets are not getting wet is exactly as true, or perhaps exactly as untrue, as the original proposition. The statements are logically equivalent.\n\nCarl Sagan explains in his book The Demon-Haunted World:\n\nFor instance, absence of evidence that it rained (i.e. water is the evidence) may be considered positive evidence that it did not rain. Again, in science, such inferences are always made to some limited (sometimes extremely high) degree of probability and in this case absence of evidence is evidence of absence when the positive evidence should have been there but is not.\n\nArguments from ignorance can easily find their way into debates over the existence of God. It is a fallacy to draw conclusions based precisely on ignorance, since this does not satisfactorily address issues of philosophic burden of proof.\n\nRelated terms\n\nContraposition and transposition \n\nContraposition is a logically valid rule of inference that allows the creation of a new proposition from the negation and reordering of an existing one. The method applies to any proposition of the type If A then B and says that negating all the variables and switching them back to front leads to a new proposition i.e. If Not-B then Not-A that is just as true as the original one and that the first implies the second and the second implies the first.\n\nTransposition is exactly the same thing as Contraposition, described in a different language.\n\nAbsence of evidence \n\nAbsence of evidence, is the lack of - any kind of evidence - that may show, indicate, suggest, or be used to 1) infer, or 2) deduce the truthfulness of an asserted fact.\n\nNegative evidence \n\nNegative evidence is sometimes used as an alternative to absence of evidence and is often meant to be synonymous with it. On the other hand, the term may also refer to evidence with a negative value, or null result equivalent to evidence of absence. It may even refer to positive evidence about something of an unpleasant nature.\n\nEvidence of absence \n\nEvidence of absence is evidence of any kind that can be used to infer or deduce the non-existence or non-presence of something. For instance, if a doctor does not find any malignant cells in a patient this null result (finding nothing) is evidence of absence of cancer, even though the doctor has not actually detected anything per se. Such inductive reasoning is important to empiricism and science, but has well established limitations. The challenge thus becomes to try to identify when a researcher has received a null result (found nothing) because the thing does not exist (evidence of absence—objectively negative result), and when one simply lacks proper means of detection (absence of evidence—false negative).\nNull result \n\nNull result is a term often used in science to indicate evidence of absence. A search for water on the ground may yield a null result (the ground is dry); therefore, it probably did not rain.\n\nRelated arguments\n\nArgument from self-knowing (auto-epistemic) \n\nArguments from self-knowing take the form:\n\n# If P were true then I would know it; in fact I do not know it; therefore P cannot be true.\n# If P were false then I would know it; in fact I do not know it; therefore P cannot be false.\n\nIn practice these arguments are often fallacious and rely on the veracity of the supporting premise. For example, the argument that If I had just sat on a wild porcupine then I would know it; in fact I do not know it; therefore I did not just sit on a wild porcupine is probably not a fallacy and depends entirely on the veracity of the leading proposition that supports it. (See Contraposition and Transposition in the Related terms section in this article.)\n\nDistinguishing absence of evidence from evidence of absence \n\nAbsence of evidence is a condition in which no valid conclusion can be inferred from the mere absence of detection, normally due to doubt in the detection method. Evidence of absence is the successful variation: a conclusion that relies on specific knowledge in conjunction with negative detection to deduce the absence of something. An example of evidence of absence is checking your pockets for spare change and finding nothing, but being confident that the search would have found it if it was there.\n\nFormal argument\n\nBy determining that a given experiment or method of detection is sensitive and reliable enough to detect the presence of X (when X is present) one can confidently exclude the possibility that X may be both undetected and present. This allows one to deduce that X cannot be present if a null result is received.\n\nThus there are only two possibilities, given a null result:\n# Nothing detected, and X is not present.\n# Nothing detected, but X is present (option eliminated by careful research design).\n\nTo the extent that option 2 can be eliminated, one can deduce that if X is not detected then X is not present and therefore the null result is evidence of absence.\n\nExamples \n\n Absence of evidence \n\n(These examples contain or represent missing information.)\n\n* Statements that begin with \"I can't prove it but ...\" are often referring to some kind absence of evidence.\n* \"There is no evidence of foul play here\" is a direct reference to the absence of evidence.\n* \"There is no evidence of aliens, and therefore, aliens do not exist\" appeals to an absence of evidence\n\nNegative results \n\n* When the doctor says that the test results were negative, it is usually good news.\n* Under \"Termites\" the inspector checked the box that read \"no\".\n\nEvidence of absence \n\n(These examples contain definite evidence that can be used to show, indicate, suggest, infer or deduce the non-existence or non-presence of something.)\n\n* A biopsy shows the absence of malignant cells.\n* One very carefully inspects the back seat of one's car and finds no adult-sized kangaroos.\n* The train schedule does not say that the train stops here at 3:00pm on a Sunday. (It could indeed happen that the train will stop here for another reason than the actual schedule, e. g. due to an incident or technical reasons, but the evidence clearly proves that the train schedule does not include a halt at this station.)\n\nArguments from ignorance \n\n(Draws a conclusion based on lack of knowledge or evidence without accounting for all possibilities)\n* \"I take the view that this lack (of enemy subversive activity in the west coast) is the most ominous sign in our whole situation. It convinces me more than perhaps any other factor that the sabotage we are to get, the Fifth Column activities are to get, are timed just like Pearl Harbor ... I believe we are just being lulled into a false sense of security.\" – Earl Warren, then California's Attorney General  (before a congressional hearing in San Francisco on 21 February 1942).\n* This example clearly states what appeal to ignorance is: \"Although we have proven that the moon is not made of spare ribs, we have not proven that its core cannot be filled with them; therefore, the moon’s core is filled with spare ribs.\"\n\nPrinciples in law \n\nThe presumption of innocence is often mentioned when discussing the argumentum ad ignorantiam. \n* The presumption of innocence, if present, effectively removes the possibility that the accused may be both guilty and unproven, from consideration in judgment, and as such the accused is considered as innocent unless proven guilty. (See decision table below)\n*# Innocent and guilt is unproven. Judged as innocent.\n*# Innocent and guilt is proven. Judged as guilty. (Jury is biased, misled, makes error; false evidence fabricated etc.)\n*# Guilty and guilt is unproven. Judged as innocent. (Presumption of innocence)\n*# Guilty and guilt is proven. Judged as guilty. (Innocent unless/until proven guilty is a summary of this and easier to remember.)\n\nOrigin of the term \n\nFrom Fallacies: classical and contemporary readings by Hans V. Hansen, Robert C. Pinto:\n\"It is generally accepted that the philosopher John Locke introduced the term in his Essay Concerning Human Understanding:\"\n:\"Another way that Men ordinarily use to drive others, and force them to submit their Judgments, and receive the Opinion in debate, is to require the Adversary to admit what they allege as a Proof, or assign a better. And this I call Argumentum ad Ignorantiam\" —John Locke. Argument from ignorance. http://en.wikipedia.org/?curid=17699."
  }
}
