{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9678",
  "eid" : "f0f7f0b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778484027,
  "textBody" : "In mathematics, an exponential function is a function of the form\n\nin which the input variable  occurs as an exponent.  A function of the form f(x)b^{x+c}, where c is a constant, is also considered an exponential function and can be rewritten as f(x)\nab^x, with a=b^c. \n\nAs functions of a real variable, exponential functions are uniquely characterized by the fact that the growth rate of such a function (i.e., its derivative) is directly proportional to the value of the function.  The constant of proportionality of this relationship is the natural logarithm of the base b:\n\n{\\left(b^x\\right)} = b^x {\\log_e}{(b)}.}}\n\nThe constant e ≈ 2.71828... is the unique base for which the constant of proportionality is 1, so that the function's derivative is itself:\n\n{\\left(e^x\\right)} e^x {\\log_e}{(e)} \n e^x.}}\n\nSince changing the base of the exponential function merely results in the appearance of an additional constant factor, it is computationally convenient to reduce the study of exponential functions in mathematical analysis to the study of this particular function, conventionally called the \"natural exponential function\", or simply, \"the exponential function\" and denoted by\n\nThe exponential function satisfies the fundamental multiplicative identity \n\n(In fact, this identity extends to complex-valued exponents.) It can be shown that every continuous, nonzero solution of the functional equation f(x+y)=f(x)f(y) is an exponential function, f:\\mathbb{R}\\to\\mathbb{R},\\ x\\mapsto b^x, with b>0.\n\nThe argument of the exponential function can be any real or complex number or even an entirely different kind of mathematical object (e.g., a matrix).\n\nIts ubiquitous occurrence in pure and applied mathematics has led mathematician W. Rudin to opine that the exponential function is \"the most important function in mathematics\". In applied settings, exponential functions model a relationship in which a constant change in the independent variable gives the same proportional change (i.e. percentage increase or decrease) in the dependent variable.  Such a situation occurs widely in the natural and social sciences; thus, the exponential function also appears in a variety of contexts within physics, chemistry, engineering, mathematical biology, and economics. \n\nThe graph of y=e^x is upward-sloping, and increases faster as x increases. The graph always lies above the x-axis but can get arbitrarily close to it for negative x; thus, the x-axis is a horizontal asymptote. The slope of the tangent to the graph at each point is equal to its y-coordinate at that point, as implied by its derivative function (see above). Its inverse function is the natural logarithm, denoted \\log,In pure mathematics, the notation log x generally refers to the natural logarithm of x or a logarithm in general if base is immaterial. \\ln,The notation ln x is the ISO standard and is prevalent in the natural sciences and secondary education (US).  However, some mathematicians (e.g., Halmos) have criticized this notation and prefer to use log x for the natural logarithm of x. or \\log_e; because of this, some old texts refer to the exponential function as the antilogarithm.\n\nFormal definition\n\nThe exponential function \\exp:\\mathbb{C}\\to\\mathbb{C} can be characterized in a variety of equivalent ways. Most commonly, it is defined by the following power series:\n\n\\exp(z) \\sum_{k \n 0}^{\\infty} {z^k \\over k!} = 1 + z + {z^2 \\over 2} + {z^3 \\over 6} + {z^4 \\over 24} + \\cdots\n\nSince the radius of convergence of this power series is infinite, this definition is applicable to all complex numbers z.  The constant e can then be defined as e\n\\exp(1)\\sum_{k\n0}^\\infty(1/k!). \n\nThe exponential function is often defined as the unique solution of the differential equation\ny'=y,\nsuch that \n\nLess commonly, the real exponential function is defined as the solution  to the equation\nx = \\int_1^y {1 \\over t} \\mathrm{d}t\n\nThe exponential function can also be defined as the following limit:Eli Maor, e: the Story of a Number, p.156.\n\ne^x = \\lim_{n \\rightarrow \\infty} \\left(1 + \\frac{x}{n}\\right)^n.\n\nOverview\n\nThe exponential function arises whenever a quantity grows or decays at a rate proportional to its current value.  One such situation is continuously compounded interest, and in fact it was this observation that led Jacob Bernoulli in 1683 to the number\n\n\\lim_{n\\to\\infty}\\left(1 + \\frac{1}{n}\\right)^{n}\n\nnow known as .  Later, in 1697, Johann Bernoulli studied the calculus of the exponential function.\n\nIf a principal amount of 1 earns interest at an annual rate of  compounded monthly, then the interest earned each month is  times the current value, so each month the total value is multiplied by , and the value at the end of the year is .  If instead interest is compounded daily, this becomes .  Letting the number of time intervals per year grow without bound leads to the limit definition of the exponential function,\n\n\\exp(x) = \\lim_{n\\to\\infty}\\left(1 + \\frac{x}{n}\\right)^{n}\n\nfirst given by Euler.\nThis is one of a number of characterizations of the exponential function; others involve series or differential equations.\n\nFrom any of these definitions it can be shown that the exponential function obeys the basic exponentiation identity,\n\\exp(x + y) = \\exp(x) \\cdot \\exp(y)\n\nwhich justifies the notation .\n\nThe derivative (rate of change) of the exponential function is the exponential function itself. More generally, a function with a rate of change proportional to the function itself (rather than equal to it) is expressible in terms of the exponential function. This function property leads to exponential growth and exponential decay.\n\nThe exponential function extends to an entire function on the complex plane. Euler's formula relates its values at purely imaginary arguments to trigonometric functions.  The exponential function also has analogues for which the argument is a matrix, or even an element of a Banach algebra or a Lie algebra.\n\nDerivatives and differential equations\n\nThe importance of the exponential function in mathematics and the sciences stems mainly from its definition as the unique function which is equal to its derivative and is equal to 1 when . That is,\n\\frac{d}{dx}e^x e^x \\quad\\text{and}\\quad e^0\n1\n\nFunctions of the form  for constant  are the only functions that are equal to their derivative (by the Picard–Lindelöf theorem). Other ways of saying the same thing include:\n* The slope of the graph at any point is the height of the function at that point.\n* The rate of increase of the function at  is equal to the value of the function at .\n* The function solves the differential equation .\n*  is a fixed point of derivative as a functional.\n\nIf a variable's growth or decay rate is proportional to its size—as is the case in unlimited population growth (see Malthusian catastrophe), continuously compounded interest, or radioactive decay—then the variable can be written as a constant times an exponential function of time.  Explicitly for any real constant , a function  satisfies  if and only if  for some constant .\n\nFurthermore, for any differentiable function , we find, by the chain rule:\n\n{\\mathrm{d} \\over \\mathrm{d}x} e^{f(x)} = f'(x)e^{f(x)}\n\nContinued fractions for \n\nA continued fraction for  can be obtained via an identity of Euler:\n\n  e^x = 1 + \\cfrac{x}{1 - \\cfrac{x}{x + 2 - \\cfrac{2x}{x + 3 - \\cfrac{3x}{x + 4 - \\ddots}}}}\n\nThe following generalized continued fraction for  converges more quickly:[https://link.springer.com/content/pdf/bbm%3A978-94-91216-37-4%2F1 \"A.2.2 The exponential function.\" L. Lorentzen and H. Waadeland, Continued Fractions, Atlantis Studies in Mathematics, page 268.]\n  e^z = 1 + \\cfrac{2z}{2 - z + \\cfrac{z^2}{6 + \\cfrac{z^2}{10 + \\cfrac{z^2}{14 + \\ddots}}}}\n\nor, by applying the substitution :\n  e^\\frac{x}{y} = 1 + \\cfrac{2x}{2y - x + \\cfrac{x^2} {6y + \\cfrac{x^2} {10y + \\cfrac{x^2} {14y + \\ddots}}}}\n\nwith a special case for :\n  e^2 1 + \\cfrac{4}{0 + \\cfrac{2^2}{6 + \\cfrac{2^2}{10 + \\cfrac{2^2}{14 + \\ddots\\,}}}} \n 7 + \\cfrac{2}{5 + \\cfrac{1}{7 + \\cfrac{1}{9 + \\cfrac{1}{11 + \\ddots\\,}}}}\n\nThis formula also converges, though more slowly, for . For example:\n\n  e^3 1 + \\cfrac{6}{-1 + \\cfrac{3^2}{6 + \\cfrac{3^2}{10 + \\cfrac{3^2}{14 + \\ddots\\,}}}} \n 13 + \\cfrac{54}{7 + \\cfrac{9}{14 + \\cfrac{9}{18 + \\cfrac{9}{22 + \\ddots\\,}}}}\n\nComplex plane\n\nAs in the real case, the exponential function can be defined on the complex plane in several equivalent forms. The most common definition of the complex exponential function parallels the power series definition for real arguments, where the real variable is replaced by a complex one:\n\n\\exp z :\\sum_{k \n 0}^\\infty\\frac{z^k}{k!} \n\nTermwise multiplication of two copies of these power series in the Cauchy sense, permitted by Mertens' theorem, shows that the defining multiplicative property of exponential functions continues to hold for all complex arguments:\n\n\\exp(w+z)=\\exp(w)\\exp(z) for all w,z\\in\\mathbb{C}\n\nThe definition of the complex exponential function in turn leads to the appropriate definitions extending the trigonometric functions to complex arguments.\n\nIn particular, when z=it (t real), the series definition yields the expansion\n\n\\exp(it) = \\Big( 1-\\frac{t^2}{2!}+\\frac{t^4}{4!}-\\frac{t^6}{6!}+\\cdots\\Big)+i\\Big(t-\\frac{t^3}{3!}+\n\\frac{t^5}{5!}-\\frac{t^7}{7!}+\\cdots\\Big)\n\nIn this expansion, the rearrangement of the terms into real and imaginary parts is justified by the absolute convergence of the series.  The real and imaginary parts of the above expression in fact correspond to the series expansions of \\cos t and \\sin t, respectively. \n\nThis correspondence provides motivation for defining cosine and sine for all complex arguments in terms of \\exp(\\pm iz)  and the equivalent power series: \n\n\\cos z:\\frac{1}{2}\\Big[\\exp(iz)+\\exp(-iz)\\Big]\n\\sum_{k=0}^{\\infty}(-1)^k\n\\frac{z^{2k}}{(2k)!} and \\sin z:\\frac{1}{2i}\\Big[\\exp(iz)-\\exp(-iz)\\Big]\n\\sum_{k=0}^{\\infty}(-1)^k\\frac{z^{2k+1}}{(2k+1)!} for all z\\in\\mathbb{C}\n\nThe functions exp, cos, and sin so defined have infinite radii of convergence by the ratio test and are therefore entire functions (i.e., holomorphic on \\mathbb{C}).  The range of the exponential function is \\mathbb{C}\\setminus \\{0\\}, while the ranges of the complex sine and cosine functions are both \\mathbb{C} in its entirety, in accord with Picard's theorem, which asserts that the range of a nonconstant entire function is either all of \\mathbb{C}, or \\mathbb{C} excluding one lacunary value.\n\nThese definitions for the exponential and trigonometric functions lead trivially to Euler's formula:\n\n\\exp(iz)=\\cos z+i\\sin z for all z\\in\\mathbb{C}\n\nWe could alternatively define the complex exponential function based on this relationship.  If z=x+iy, where x and y are both real, then we could define its exponential as\n\n\\exp z \\exp(x+iy) :\n  (\\exp x)(\\cos y + i \\sin y)\n\nwhere exp, cos, and sin on the right-hand side of the definition sign are to be interpreted as functions of a real variable, previously defined by other means.\n\nFor t\\in\\mathbb{R} , the relationship \\overline{\\exp(it)}\\exp(-it) holds, so that |\\exp(it)|\n1 for real t and t\\mapsto\\exp(it) maps the real line (mod 2\\pi) to the unit circle.  Based on the relationship between \\exp(it) and the unit circle, it is easy to see that, restricted to real arguments, the definitions of sine and cosine given above coincide with their more elementary definitions based on geometric notions.\n\nThe complex exponential function is periodic with period 2\\pi i and \\exp(z+2\\pi i k)=\\exp z holds for all z\\in\\mathbb{C},k\\in\\mathbb{Z}. \n\nWhen its domain is extended from the real line to the complex plane, the exponential function retains the following properties:\n* e^{z + w} = e^z e^w\\,\n* e^0 = 1\\,\n* e^z \\ne 0\n* \\frac{\\mathrm{d}}{\\mathrm{d}z} e^z = e^z\n* \\left(e^z\\right)^n = e^{nz}, n \\in \\mathbb{Z}\nfor all w,z\\in\\mathbb{C}.\n\nExtending the natural logarithm to complex arguments yields the complex logarithm , which is a multivalued function.\n\nWe can then define a more general exponentiation:\nz^w = e^{w \\log z}\n\nfor all complex numbers  and . This is also a multivalued function, even when  is real. This distinction is problematic, as the multivalued functions  and  are easily confused with their single-valued equivalents when substituting a real number for . The rule about multiplying exponents for the case of positive real numbers must be modified in a multivalued context:\n, but rather  multivalued over integers \n\nSee failure of power and logarithm identities for more about problems with combining powers.\n\nThe exponential function maps any line in the complex plane to a logarithmic spiral in the complex plane with the center at the origin. Two special cases might be noted: when the original line is parallel to the real axis, the resulting spiral never closes in on itself; when the original line is parallel to the imaginary axis, the resulting spiral is a circle of some radius.\n\n Image:ExponentialAbs_real_SVG.svg| \n Image:ExponentialAbs_image_SVG.svg| \n Image:ExponentialAbs_SVG.svg| \n\nComputation of  where both  and  are complex\n\nComplex exponentiation  can be defined by converting  to polar coordinates and using the identity :\na^b \\left(re^{\\theta i}\\right)^b \n \\left(e^{\\ln(r) + \\theta i}\\right)^b = e^{\\left(\\ln(r) + \\theta i\\right)b}\n\nHowever, when  is not an integer, this function is multivalued, because  is not unique (see failure of power and logarithm identities).\n\nMatrices and Banach algebras\n\nThe power series definition of the exponential function makes sense for square matrices (for which the function is called the matrix exponential) and more generally in any Banach algebra .  In this setting, , and  is invertible with inverse  for any  in .  If , then , but this identity can fail for noncommuting  and .\n\nSome alternative definitions lead to the same function.  For instance,  can be defined as\n\\lim_{n \\to \\infty} \\left(1 + \\frac{x}{n} \\right)^n .\n\nOr  can be defined as , where  is the solution to the differential equation  with initial condition .\n\nLie algebras\n\nGiven a Lie group  and its associated Lie algebra \\mathfrak{g}, the exponential map is a map \\mathfrak{g}  satisfying similar properties. In fact, since  is the Lie algebra of the Lie group of all positive real numbers under multiplication, the ordinary exponential function for real arguments is a special case of the Lie algebra situation. Similarly, since the Lie group  of invertible  matrices has as Lie algebra , the space of all  matrices, the exponential function for square matrices is a special case of the Lie algebra exponential map.\n\nThe identity  can fail for Lie algebra elements  and  that do not commute; the Baker–Campbell–Hausdorff formula supplies the necessary correction terms.\n\nSimilar properties of  and the function \n\nThe function  is not in  (i.e., is not the quotient of two polynomials with complex coefficients).\n\nFor  distinct complex numbers }, the set } is linearly independent over .\n\nThe function  is transcendental over .\n\nexp and expm1\n\nSome calculators provide a dedicated  function designed to provide a higher precision than achievable by using  directly.[http://holyjoe.net/hp/HP_50g_AUR_v2_English_searchable.pdf Searchable PDF]\n\nBased on a proposal by William Kahan and first implemented in the Hewlett-Packard HP-41C calculator in 1979, some scientific calculators, computer algebra systems and programming languages (for example C99) support a special exponential minus 1 function alternatively named E^X-1, expm1(x), expm(x), or exp1m(x) to provide more accurate results for values of  near zero compared to using exp(x)-1 directly. This function is implemented using a different internal algorithm to avoid an intermediate result near 1, thereby allowing both the argument and the result to be near zero. Similar inverse functions named lnp1(x), ln1p(x) or log1p(x) exist as well.For a similar approach to reduce round-off errors of calculations for certain input values see trigonometric functions like versine, vercosine, coversine, covercosine, haversine, havercosine, hacoversine, hacovercosine, exsecant and excosecant.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Exponential function" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9678" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In mathematics, an exponential function is a function of the form\n\nin which the input variable  occurs as an exponent.  A function of the form f(x)b^{x+c}, where c is a constant, is also considered an exponential function and can be rewritten as f(x)\nab^x, with a=b^c. \n\nAs functions of a real variable, exponential functions are uniquely characterized by the fact that the growth rate of such a function (i.e., its derivative) is directly proportional to the value of the function.  The constant of proportionality of this relationship is the natural logarithm of the base b:\n\n{\\left(b^x\\right)} = b^x {\\log_e}{(b)}.}}\n\nThe constant e ≈ 2.71828... is the unique base for which the constant of proportionality is 1, so that the function's derivative is itself:\n\n{\\left(e^x\\right)} e^x {\\log_e}{(e)} \n e^x.}}\n\nSince changing the base of the exponential function merely results in the appearance of an additional constant factor, it is computationally convenient to reduce the study of exponential functions in mathematical analysis to the study of this particular function, conventionally called the \"natural exponential function\", or simply, \"the exponential function\" and denoted by\n\nThe exponential function satisfies the fundamental multiplicative identity \n\n(In fact, this identity extends to complex-valued exponents.) It can be shown that every continuous, nonzero solution of the functional equation f(x+y)=f(x)f(y) is an exponential function, f:\\mathbb{R}\\to\\mathbb{R},\\ x\\mapsto b^x, with b>0.\n\nThe argument of the exponential function can be any real or complex number or even an entirely different kind of mathematical object (e.g., a matrix).\n\nIts ubiquitous occurrence in pure and applied mathematics has led mathematician W. Rudin to opine that the exponential function is \"the most important function in mathematics\". In applied settings, exponential functions model a relationship in which a constant change in the independent variable gives the same proportional change (i.e. percentage increase or decrease) in the dependent variable.  Such a situation occurs widely in the natural and social sciences; thus, the exponential function also appears in a variety of contexts within physics, chemistry, engineering, mathematical biology, and economics. \n\nThe graph of y=e^x is upward-sloping, and increases faster as x increases. The graph always lies above the x-axis but can get arbitrarily close to it for negative x; thus, the x-axis is a horizontal asymptote. The slope of the tangent to the graph at each point is equal to its y-coordinate at that point, as implied by its derivative function (see above). Its inverse function is the natural logarithm, denoted \\log,In pure mathematics, the notation log x generally refers to the natural logarithm of x or a logarithm in general if base is immaterial. \\ln,The notation ln x is the ISO standard and is prevalent in the natural sciences and secondary education (US).  However, some mathematicians (e.g., Halmos) have criticized this notation and prefer to use log x for the natural logarithm of x. or \\log_e; because of this, some old texts refer to the exponential function as the antilogarithm.\n\nFormal definition\n\nThe exponential function \\exp:\\mathbb{C}\\to\\mathbb{C} can be characterized in a variety of equivalent ways. Most commonly, it is defined by the following power series:\n\n\\exp(z) \\sum_{k \n 0}^{\\infty} {z^k \\over k!} = 1 + z + {z^2 \\over 2} + {z^3 \\over 6} + {z^4 \\over 24} + \\cdots\n\nSince the radius of convergence of this power series is infinite, this definition is applicable to all complex numbers z.  The constant e can then be defined as e\n\\exp(1)\\sum_{k\n0}^\\infty(1/k!). \n\nThe exponential function is often defined as the unique solution of the differential equation\ny'=y,\nsuch that \n\nLess commonly, the real exponential function is defined as the solution  to the equation\nx = \\int_1^y {1 \\over t} \\mathrm{d}t\n\nThe exponential function can also be defined as the following limit:Eli Maor, e: the Story of a Number, p.156.\n\ne^x = \\lim_{n \\rightarrow \\infty} \\left(1 + \\frac{x}{n}\\right)^n.\n\nOverview\n\nThe exponential function arises whenever a quantity grows or decays at a rate proportional to its current value.  One such situation is continuously compounded interest, and in fact it was this observation that led Jacob Bernoulli in 1683 to the number\n\n\\lim_{n\\to\\infty}\\left(1 + \\frac{1}{n}\\right)^{n}\n\nnow known as .  Later, in 1697, Johann Bernoulli studied the calculus of the exponential function.\n\nIf a principal amount of 1 earns interest at an annual rate of  compounded monthly, then the interest earned each month is  times the current value, so each month the total value is multiplied by , and the value at the end of the year is .  If instead interest is compounded daily, this becomes .  Letting the number of time intervals per year grow without bound leads to the limit definition of the exponential function,\n\n\\exp(x) = \\lim_{n\\to\\infty}\\left(1 + \\frac{x}{n}\\right)^{n}\n\nfirst given by Euler.\nThis is one of a number of characterizations of the exponential function; others involve series or differential equations.\n\nFrom any of these definitions it can be shown that the exponential function obeys the basic exponentiation identity,\n\\exp(x + y) = \\exp(x) \\cdot \\exp(y)\n\nwhich justifies the notation .\n\nThe derivative (rate of change) of the exponential function is the exponential function itself. More generally, a function with a rate of change proportional to the function itself (rather than equal to it) is expressible in terms of the exponential function. This function property leads to exponential growth and exponential decay.\n\nThe exponential function extends to an entire function on the complex plane. Euler's formula relates its values at purely imaginary arguments to trigonometric functions.  The exponential function also has analogues for which the argument is a matrix, or even an element of a Banach algebra or a Lie algebra.\n\nDerivatives and differential equations\n\nThe importance of the exponential function in mathematics and the sciences stems mainly from its definition as the unique function which is equal to its derivative and is equal to 1 when . That is,\n\\frac{d}{dx}e^x e^x \\quad\\text{and}\\quad e^0\n1\n\nFunctions of the form  for constant  are the only functions that are equal to their derivative (by the Picard–Lindelöf theorem). Other ways of saying the same thing include:\n* The slope of the graph at any point is the height of the function at that point.\n* The rate of increase of the function at  is equal to the value of the function at .\n* The function solves the differential equation .\n*  is a fixed point of derivative as a functional.\n\nIf a variable's growth or decay rate is proportional to its size—as is the case in unlimited population growth (see Malthusian catastrophe), continuously compounded interest, or radioactive decay—then the variable can be written as a constant times an exponential function of time.  Explicitly for any real constant , a function  satisfies  if and only if  for some constant .\n\nFurthermore, for any differentiable function , we find, by the chain rule:\n\n{\\mathrm{d} \\over \\mathrm{d}x} e^{f(x)} = f'(x)e^{f(x)}\n\nContinued fractions for \n\nA continued fraction for  can be obtained via an identity of Euler:\n\n  e^x = 1 + \\cfrac{x}{1 - \\cfrac{x}{x + 2 - \\cfrac{2x}{x + 3 - \\cfrac{3x}{x + 4 - \\ddots}}}}\n\nThe following generalized continued fraction for  converges more quickly:[https://link.springer.com/content/pdf/bbm%3A978-94-91216-37-4%2F1 \"A.2.2 The exponential function.\" L. Lorentzen and H. Waadeland, Continued Fractions, Atlantis Studies in Mathematics, page 268.]\n  e^z = 1 + \\cfrac{2z}{2 - z + \\cfrac{z^2}{6 + \\cfrac{z^2}{10 + \\cfrac{z^2}{14 + \\ddots}}}}\n\nor, by applying the substitution :\n  e^\\frac{x}{y} = 1 + \\cfrac{2x}{2y - x + \\cfrac{x^2} {6y + \\cfrac{x^2} {10y + \\cfrac{x^2} {14y + \\ddots}}}}\n\nwith a special case for :\n  e^2 1 + \\cfrac{4}{0 + \\cfrac{2^2}{6 + \\cfrac{2^2}{10 + \\cfrac{2^2}{14 + \\ddots\\,}}}} \n 7 + \\cfrac{2}{5 + \\cfrac{1}{7 + \\cfrac{1}{9 + \\cfrac{1}{11 + \\ddots\\,}}}}\n\nThis formula also converges, though more slowly, for . For example:\n\n  e^3 1 + \\cfrac{6}{-1 + \\cfrac{3^2}{6 + \\cfrac{3^2}{10 + \\cfrac{3^2}{14 + \\ddots\\,}}}} \n 13 + \\cfrac{54}{7 + \\cfrac{9}{14 + \\cfrac{9}{18 + \\cfrac{9}{22 + \\ddots\\,}}}}\n\nComplex plane\n\nAs in the real case, the exponential function can be defined on the complex plane in several equivalent forms. The most common definition of the complex exponential function parallels the power series definition for real arguments, where the real variable is replaced by a complex one:\n\n\\exp z :\\sum_{k \n 0}^\\infty\\frac{z^k}{k!} \n\nTermwise multiplication of two copies of these power series in the Cauchy sense, permitted by Mertens' theorem, shows that the defining multiplicative property of exponential functions continues to hold for all complex arguments:\n\n\\exp(w+z)=\\exp(w)\\exp(z) for all w,z\\in\\mathbb{C}\n\nThe definition of the complex exponential function in turn leads to the appropriate definitions extending the trigonometric functions to complex arguments.\n\nIn particular, when z=it (t real), the series definition yields the expansion\n\n\\exp(it) = \\Big( 1-\\frac{t^2}{2!}+\\frac{t^4}{4!}-\\frac{t^6}{6!}+\\cdots\\Big)+i\\Big(t-\\frac{t^3}{3!}+\n\\frac{t^5}{5!}-\\frac{t^7}{7!}+\\cdots\\Big)\n\nIn this expansion, the rearrangement of the terms into real and imaginary parts is justified by the absolute convergence of the series.  The real and imaginary parts of the above expression in fact correspond to the series expansions of \\cos t and \\sin t, respectively. \n\nThis correspondence provides motivation for defining cosine and sine for all complex arguments in terms of \\exp(\\pm iz)  and the equivalent power series: \n\n\\cos z:\\frac{1}{2}\\Big[\\exp(iz)+\\exp(-iz)\\Big]\n\\sum_{k=0}^{\\infty}(-1)^k\n\\frac{z^{2k}}{(2k)!} and \\sin z:\\frac{1}{2i}\\Big[\\exp(iz)-\\exp(-iz)\\Big]\n\\sum_{k=0}^{\\infty}(-1)^k\\frac{z^{2k+1}}{(2k+1)!} for all z\\in\\mathbb{C}\n\nThe functions exp, cos, and sin so defined have infinite radii of convergence by the ratio test and are therefore entire functions (i.e., holomorphic on \\mathbb{C}).  The range of the exponential function is \\mathbb{C}\\setminus \\{0\\}, while the ranges of the complex sine and cosine functions are both \\mathbb{C} in its entirety, in accord with Picard's theorem, which asserts that the range of a nonconstant entire function is either all of \\mathbb{C}, or \\mathbb{C} excluding one lacunary value.\n\nThese definitions for the exponential and trigonometric functions lead trivially to Euler's formula:\n\n\\exp(iz)=\\cos z+i\\sin z for all z\\in\\mathbb{C}\n\nWe could alternatively define the complex exponential function based on this relationship.  If z=x+iy, where x and y are both real, then we could define its exponential as\n\n\\exp z \\exp(x+iy) :\n  (\\exp x)(\\cos y + i \\sin y)\n\nwhere exp, cos, and sin on the right-hand side of the definition sign are to be interpreted as functions of a real variable, previously defined by other means.\n\nFor t\\in\\mathbb{R} , the relationship \\overline{\\exp(it)}\\exp(-it) holds, so that |\\exp(it)|\n1 for real t and t\\mapsto\\exp(it) maps the real line (mod 2\\pi) to the unit circle.  Based on the relationship between \\exp(it) and the unit circle, it is easy to see that, restricted to real arguments, the definitions of sine and cosine given above coincide with their more elementary definitions based on geometric notions.\n\nThe complex exponential function is periodic with period 2\\pi i and \\exp(z+2\\pi i k)=\\exp z holds for all z\\in\\mathbb{C},k\\in\\mathbb{Z}. \n\nWhen its domain is extended from the real line to the complex plane, the exponential function retains the following properties:\n* e^{z + w} = e^z e^w\\,\n* e^0 = 1\\,\n* e^z \\ne 0\n* \\frac{\\mathrm{d}}{\\mathrm{d}z} e^z = e^z\n* \\left(e^z\\right)^n = e^{nz}, n \\in \\mathbb{Z}\nfor all w,z\\in\\mathbb{C}.\n\nExtending the natural logarithm to complex arguments yields the complex logarithm , which is a multivalued function.\n\nWe can then define a more general exponentiation:\nz^w = e^{w \\log z}\n\nfor all complex numbers  and . This is also a multivalued function, even when  is real. This distinction is problematic, as the multivalued functions  and  are easily confused with their single-valued equivalents when substituting a real number for . The rule about multiplying exponents for the case of positive real numbers must be modified in a multivalued context:\n, but rather  multivalued over integers \n\nSee failure of power and logarithm identities for more about problems with combining powers.\n\nThe exponential function maps any line in the complex plane to a logarithmic spiral in the complex plane with the center at the origin. Two special cases might be noted: when the original line is parallel to the real axis, the resulting spiral never closes in on itself; when the original line is parallel to the imaginary axis, the resulting spiral is a circle of some radius.\n\n Image:ExponentialAbs_real_SVG.svg| \n Image:ExponentialAbs_image_SVG.svg| \n Image:ExponentialAbs_SVG.svg| \n\nComputation of  where both  and  are complex\n\nComplex exponentiation  can be defined by converting  to polar coordinates and using the identity :\na^b \\left(re^{\\theta i}\\right)^b \n \\left(e^{\\ln(r) + \\theta i}\\right)^b = e^{\\left(\\ln(r) + \\theta i\\right)b}\n\nHowever, when  is not an integer, this function is multivalued, because  is not unique (see failure of power and logarithm identities).\n\nMatrices and Banach algebras\n\nThe power series definition of the exponential function makes sense for square matrices (for which the function is called the matrix exponential) and more generally in any Banach algebra .  In this setting, , and  is invertible with inverse  for any  in .  If , then , but this identity can fail for noncommuting  and .\n\nSome alternative definitions lead to the same function.  For instance,  can be defined as\n\\lim_{n \\to \\infty} \\left(1 + \\frac{x}{n} \\right)^n .\n\nOr  can be defined as , where  is the solution to the differential equation  with initial condition .\n\nLie algebras\n\nGiven a Lie group  and its associated Lie algebra \\mathfrak{g}, the exponential map is a map \\mathfrak{g}  satisfying similar properties. In fact, since  is the Lie algebra of the Lie group of all positive real numbers under multiplication, the ordinary exponential function for real arguments is a special case of the Lie algebra situation. Similarly, since the Lie group  of invertible  matrices has as Lie algebra , the space of all  matrices, the exponential function for square matrices is a special case of the Lie algebra exponential map.\n\nThe identity  can fail for Lie algebra elements  and  that do not commute; the Baker–Campbell–Hausdorff formula supplies the necessary correction terms.\n\nSimilar properties of  and the function \n\nThe function  is not in  (i.e., is not the quotient of two polynomials with complex coefficients).\n\nFor  distinct complex numbers }, the set } is linearly independent over .\n\nThe function  is transcendental over .\n\nexp and expm1\n\nSome calculators provide a dedicated  function designed to provide a higher precision than achievable by using  directly.[http://holyjoe.net/hp/HP_50g_AUR_v2_English_searchable.pdf Searchable PDF]\n\nBased on a proposal by William Kahan and first implemented in the Hewlett-Packard HP-41C calculator in 1979, some scientific calculators, computer algebra systems and programming languages (for example C99) support a special exponential minus 1 function alternatively named E^X-1, expm1(x), expm(x), or exp1m(x) to provide more accurate results for values of  near zero compared to using exp(x)-1 directly. This function is implemented using a different internal algorithm to avoid an intermediate result near 1, thereby allowing both the argument and the result to be near zero. Similar inverse functions named lnp1(x), ln1p(x) or log1p(x) exist as well.For a similar approach to reduce round-off errors of calculations for certain input values see trigonometric functions like versine, vercosine, coversine, covercosine, haversine, havercosine, hacoversine, hacovercosine, exsecant and excosecant. Exponential function. http://en.wikipedia.org/?curid=9678."
  }
}
