{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13411",
  "eid" : "091b71d0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778524525,
  "textBody" : "Hong Kong has a highly developed and sophisticated transport network, encompassing both public and private transport. Based on Hong Kong Government's Travel Characteristics Survey, over 90% of the daily journeys are on public transport, the highest rate in the world.Lam, William H.K. [2003] (2003). Advanced Modeling for Transit Operations and Service Planning. Elsevier publishing.  However, in 2014 the Transport Advisory Committee, which advises the Government on transportation issues, issued a report on the much worsened congestion problem in Hong Kong and pointed at the excessive growth of private cars during the past 10–15 years.http://www.thb.gov.hk/eng/boards/transport/land/Full_Eng_C_cover.pdf\n\nThe Octopus card, a smart electronic money payment system, was introduced in September 1997 to provide an alternative to the traditional banknotes and coins. Available for purchase in every stop of the Mass Transit Railway system, the Octopus card is a non-touch payment system which allows payment not only for public transport (such as trains, buses, trams, ferries and minibuses), but also at parking meters, convenience stores, supermarkets, fast-food restaurants and most vending machines.\n\nAutomated pedestrian transport\n\nEscalators and moving pavements\n\nHong Kong Island is dominated by steep, hilly terrain, which required the development of unusual methods of transport up and down the slopes. In Central and Western district, there is an extensive system of zero-fare escalators and moving pavements. The Mid-levels Escalator is the longest outdoor covered escalator system in the world, operating downhill until 10am for commuters going to work, and then operating uphill until midnight.\n\nThe Mid-levels Escalator consists of twenty escalators and three moving pavements. It is 800 metres long, and climbs 135 vertical metres. Total travel time is approximately 25 minutes, but most people walk while the escalator moves to shorten the travel time. Due to its vertical climb, the same distance is equivalent to several miles of zigzagging roads if travelled by car. Daily traffic exceeds 35,000 people. It has been operating since 1993 and cost HK$240,000,000 (US$30,000,000) to build.\n\nA second Mid-Levels escalator set is planned in Sai Ying Pun: the Centre Street Escalator Link.\n\nRail transport\n\nHong Kong has an extensive railway network, and the Hong Kong Government has long established that the public transit system has \"railway as its backbone\". Public transport trains are operated by the MTR Corporation. The MTR operates the metro network within inner urban Hong Kong, Kowloon Peninsula and the northern part of Hong Kong Island with newly developed areas, Tsuen Wan, Tseung Kwan O, Tung Chung, Hong Kong Disneyland, the Hong Kong International Airport, the northeastern and northwestern parts of the New Territories. The Hong Kong Tramways operates a tram service exclusively on northern Hong Kong Island. The Peak Tram connects Central, Hong Kong's central business district, with Victoria Peak.\n\nMass Transit Railway\n\nOpened in 1979, the system now includes 218.2 km (135.6 mi) of rail with 161 stations, including 93 railway stations and 68 light rail stops. The railway lines include the East Rail, Kwun Tong, Tsuen Wan, Island, Tung Chung, Tseung Kwan O, West Rail, Ma On Shan, South Island, the Airport Express and the Disneyland Resort lines. Nine of the lines provide general metro services, whereas the Airport Express provides a direct link from the Hong Kong International Airport into the city centre, and the Disneyland Resort Line exclusively takes passengers to and from Hong Kong Disneyland.\n\nThe Light Rail possesses many characteristics of a tramway, including running on streets with other traffic (at grade) on some of it's tracks and providing services for the public in the northwestern New Territories, including Tuen Mun and Yuen Long.\n\nAll trains and most MTR stations are air-conditioned.\n\nTramways\n\nThe Hong Kong Tramways is the tram system run exclusively with double deckers. The electric tram system was proposed in 1881; however nobody was willing to invest in a system at the time. In August 1901, the Second Tramway Bill was introduced and passed into law as the 1902 Tramway Ordinance. Hong Kong Tramway Electric Company Limited, a British company, was authorised to take the responsibilities in construction and daily operation. In 1904, the tram system first got into service. It was soon taken over by another company, Electric Tranction Company of Hong Kong Limited and then the name was changed to Hong Kong Tramways Company Limited in 1910.\n\nThe rail system is 13 km long,\n with a total track length of 30 km, and it runs together with other vehicles on the street. Its operation relies on the 550V direct current (d.c.) from the overhead cables, on 3'6\" gauge (1067 mm) tracks. The trams provide service to only parts of Hong Kong Island: they run on a double track along the northern coast of Hong Kong Island from Kennedy Town to Shau Kei Wan, with a single clockwise-running track of about 3 km around Happy Valley Racecourse.\n\nFunicular railways\n\nThere are four funicular railway services in Hong Kong:\n\n* The Peak Tram carries both tourists and residents to the upper levels of Hong Kong Island. It provides the most direct route to Victoria Peak and offers scenic views over Victoria Harbour and the skyscrapers of Hong Kong. It was inaugurated in 1888.\n* The Ocean Express operates within the paid area of the Ocean Park theme park. It links two parts of the park, operating entirely in a tunnel. The ride is themed, and uses multimedia effects to simulate the feeling of travelling into the depths of the sea. It was opened in 2009.\n* The Po Fook Hill Elevator serves the Po Fook Hill Ancestral Hall in Shatin.\n* The Discovery Bay Elevator serves the private housing estate Amalfi on Lantau Island.\n\nAirport people-mover system \n\nThe Hong Kong International Airport Automated People Mover is a driverless people-mover system located within the Hong Kong International Airport in Chek Lap Kok. It operates in two \"segments\". For departures, the train runs from Terminal 2 to the East Hall to the West Hall. For arrivals, the train runs only from the West Hall to the East Hall, where all passengers must disembark for immigration, customs, and baggage claim. Operation of the first segment commenced in 1998, and the operation of the second segment commenced in early-2007.\n\nThere is another system between the terminals. There is also a travellator which can be used.\n\nCross-border trains \n\nInter-city train services crossing the Hong Kong-China boundary are known as Intercity Through Trains. They are jointly operated by Hong Kong's MTR Corporation and the Ministry of Railways of the People's Republic of China. Currently, Hung Hom Station (formerly called Kowloon Station) is the only station in Hong Kong where passengers can catch these trains. Passengers have to go through immigration and customs before boarding. There are currently three through train routes:\n\n* Between Hong Kong and Beijing (Beijing-Kowloon Through Train)\n* Between Hong Kong and Shanghai (Shanghai-Kowloon Through Train)\n* Between Hong Kong and Guangzhou (Guangzhou-Kowloon Through Train)\n\nA new high-speed service, the Guangzhou-Shenzhen-Hong Kong Express Rail Link, is being built. A new train station, West Kowloon Terminus, will be built in Hong Kong to serve this new railway.\n\nRoad transport\n\nBuses\n\nBus services have a long history in Hong Kong. As of 2015, five companies operate franchised public bus services, each granted ten-year exclusive operating rights to the set of routes that they operate.http://www.td.gov.hk/en/publications_and_press_releases/press_releases/transport_department/index_t_id_2251.html Franchise buses altogether carry about one-third of the total daily public transport market of around 12,000,000 passengers, with KMB having 67% of the franchised bus market share, CityBus with 16% and New World First Bus with 13%.[http://www.censtatd.gov.hk/hkstat/sub/sp140.jsp?productCode=B1010002 \"Hong Kong Digest of Statistics\"] There are also a variety of non-franchised public buses services, including feeder bus services to railway stations operated by the railway companies, and residents' services for residential estates (particularly those in the New Territories).\n\nThe five franchised bus companies are:\n* Kowloon Motor Bus Company (1933) Limited;\n* Citybus Limited;\n* Long Win Bus Company Limited;\n* New World First Bus Services Limited; and\n* New Lantao Bus Company (1973) Limited.\n\nFounded in 1933, the Kowloon Motor Bus Company (1933) Limited (KMB) is one of the largest privately owned public bus operators in the world. KMB's fleet consist of about 3,900 buses on 400 routes and a staff of over 12,000 people. In 1979, Citybus began its operations in Hong Kong with one double-decker, providing shuttle service for the Hong Kong dockyard. It later expanded into operating a residential bus route between City One, Shatin and Kowloon Tong MTR station. New World First Bus Services Limited was established in 1998, taking over China Motor Bus's franchise to provide bus services on Hong Kong Island together with Citybus. NWFB's owner company later bought Citybus, but the two companies have basically been operating independently.\n\nPublic light buses\n\nPublic light buses (小巴) (widely referred to as minibuses, or sometimes maxicabs, a de facto share taxi) run the length and breadth of Hong Kong, through areas which the standard bus lines can not or do not reach as frequently, quickly or directly. Minibuses carry a maximum of 16 (19 for some routes since 2017) passengers; standing is not permitted.\n\nThe Hong Kong Transport Department (HKTD) allows and licenses the operation of two types of public light buses:\n# green minibuses that have route numbers, stop at designated stops (many routes have hail and ride sections along which passengers can board and exit anywhere unless it's a no-stopping zone) and which have their fares, service and frequency regulated by the HKTD; and\n# red minibuses that may or may not have regular routes, may or may not be numbered, may or may not have fixed stops and whose fares and service levels are not regulated by HKTD.[http://www.td.gov.hk/FileManager/EN/Content_275/plbpolicy.doc HKTD Public Light Bus Policy]. Accessed 11 December 2006\n\nRed minibuses often provide more convenient transport for passengers not served by green minibuses or other public buses, and are thus quite popular. Where green minibus drivers are paid fixed wages to drive their routes, red minibus drivers often rely on their fares for a living and thus are often seen to be more aggressive drivers. The prevalence of aggressive driving has resulted in the Transport Department making it mandatory for Hong Kong minibuses to be equipped with large read-out speedometers which allow passengers to track the speed at which minibus drivers operate. Currently, if minibuses exceed 80 km/h, the speedometer will sound an audible warning signal to the driver and passengers. If the minibus exceeds 100 km/h, the beeping will turn into a sustained tone. However, almost without exception; this warning signal is ignored by both driver and passengers.\n\nThe Transport Department has also regulated, after a series of minibus accidents, that all new minibuses brought into service after August 2005 must have seat belts installed, and passengers must use seat belts when they are provided.\n\nTaxis\n\n, there were 18,138 taxis in Hong Kong, operating in three distinct (but slightly overlapping) geographical areas, and distinguished by their colour. Of these, 15,250 are red urban taxis, 2,838 green New Territories taxis, and 50 blue Lantau taxis. Every day, they serve 1,100,000, 207,900, and 1,400 passengers respectively. Taxis carry an average of 1,000,000 passengers each day, occupying about 12% of the daily patronage carried by all modes of public transport in Hong Kong.\n\nMost of the taxis in Hong Kong run on LPG (liquified petroleum gas) to reduce emissions. In August 2000, a one-off grant was paid in cash to taxi owners who replaced their diesel taxi with an LPG one. Since August 2001, all newly purchased taxis run on LPG. By the end of 2003, over 99.8% of the taxi fleet in Hong Kong ran on LPG.\n\nTaxi fares are charged according to the taximeter; however, additional charges on the fare table may apply, such as road tolls and luggage fees. Urban taxis are the most expensive, while Lantau taxis are the cheapest. The standard of service among different kinds of taxis is mostly the same. The reason for having three types of taxis is to ensure service availability in less populated regions, as running in the urban centre is considered to be more profitable.\n\nPrivate cars\n\nAs of May 2015, the Census and Statistics Department of Hong Kong reports that there are 504,798 licensed vehicles in Hong Kong. In terms of private car ownership, the number of cars per capita is half that of Singapore and one-third that of Taiwan. However, the Transport Advisory Committee, which advises the government on transport policies, issued a report stating that the growth of private cars is too fast and must be contained so as to alleviate congestion problems of Hong Kong. Private cars are most popular in newly developed areas such as New Territories and Lantau and areas near the border with mainland China, as there are fewer public transportation options, and more parking spaces compared to other areas of Hong Kong.\n\nMost cars are right-hand drive models, from Japanese or European manufacturers. Hong Kong does not allow left-hand drive vehicles to be primarily registered in Hong Kong. However, Hong Kong registered vehicles may apply for secondary mainland Chinese registration plates, and these can be driven across the border to mainland China; likewise, left-hand drive cars seen in Hong Kong are usually primarily registered in mainland China and carry supplementary Hong Kong registration plates.\n\nCars are subjected to a first-time registration tax, which varies from 35% to over 100%, based on the size and value of the car. The level of vehicle taxation was increased by a law passed on 2 June 1982 to discourage private car ownership,[http://sunzi1.lib.hku.hk/newspaper/view/16_01.03/63037.pdf Legco doubts on car curbs], South China Morning Post, 3 June 1982 and also as an incentive to buy smaller, more efficient cars, as these have less tax levied on them. First-time registration tax was doubled, annual licensing fees were increased by 300%, and $0.70 duty fee was imposed on each litre of light oils.Michael Chugani, [http://sunzi1.lib.hku.hk/newspaper/view/16_01.01/62742.pdf Legco doubts on car curbs], South China Morning Post, 20 May 1982\n\nIn addition to the heavy traffic at times, parking may be problematic. Due to high urban density, there are not many filling stations; Petrol in Hong Kong averages around US$2.04 per litre, of which over half the cost is taxes. It was suggested in the news that the government had deliberately impeded the use of new environmentally friendly diesel engines by allowing only light goods vehicles to be fuelled by diesel. While it cannot be determined why exactly the government does not allow private cars to be fuelled by diesel, it has been pointed out that the government does receive a tax that is 150% of the actual fuel cost. This is mostly to discourage car ownership for environmental reasons.Mottershead, Terri. [2004] (2004). Sustainable Development in Hong Kong. HK University. \n\nThere is a waiting list for local driving tests, while a full (private car) driving licence valid for ten years costs around US$115. Residents of Hong Kong holding licences issued by other Chinese authorities and some foreign countries can get a Hong Kong driving licence exempt from tests if they can adequately show that they obtained their licence while residing in the place concerned (common proofs are school transcripts or employer's documentation). Some private car owners, known as white card drivers, provide a taxi service for a nominal fee.\n\nBicycles\n\nCycling is a popular means of transport in many parts of the New Territories, where new towns such as Shatin, Tai Po and Sheung Shui have significant cycle track networks. In the auto congested urban areas of Hong Kong and Kowloon, cycling is less common, despite the relatively flat topography of populated areas, in part because it is government policy[http://hkcyclingalliance.org/who-are-we/what-do-we-do HK Cycling Alliance] not to support cycling as part of the transportation system. In 2011, MTR Corporation announced that bicycles were permitted to be taken on all MTR rail lines.[http://hkcyclingalliance.org/getting-around-hk/trains MTR Announce Bicycles permitted on all lines]\n\nMotorcycles\n\nMotorcycles by the private users in Hong Kong urban districts are not as popular as in other South East Asian countries like Vietnam. They are mostly used for commercial and business purposes.\n\nCross-border buses\n\nA large number of buses leave various parts of Hong Kong (usually from side streets and hotel entrances) to various cities in the Pearl River Delta, Shenzhen and Guangzhou.\n\nMaritime transport\n\nFerries\n\nInternal routes\n\nMost ferry services are provided by licensed ferry operators. , there were 27 regular licensed passenger ferry services operated by 11 licensees, serving outlying islands, new towns and inner-Victoria Harbour. Two of the routes operated by the Star Ferry are franchised. Additionally, 78 \"kai-to\" ferries are licensed to serve remote coastal settlements.\n\nThe following companies operate ferry services in Hong Kong:\n\nStar Ferry:\n* Central to Tsim Sha Tsui\n* Wan Chai to Tsim Sha Tsui\n* Central to Hung Hom (termination effective 1 April 2011)\n* Wan Chai to Hung Hom (termination effective 1 April 2011)\n* Harbour Tour (Circular between Tsim Sha Tsui, Central, Wan Chai, and Hung Hom)\n\nNew World First Ferry:\n* Central to Cheung Chau \n*Central to Mui Wo\n* Peng Chau, Mui Wo, Chi Ma Wan, and Cheung Chau\n* North Point to Hung Hom\n* North Point to Kowloon City\n\nHong Kong & Kowloon Ferry:\n* Lamma Island to Central\n* Central to Peng Chau\n* Peng Chau to Hei Ling Chau\n\nChuen Kee Ferry:\n* Lamma Island(Sok Kwu Wan and Mo Tat) to Aberdeen\n\nHKR International Limited:\n* Discovery Bay Transportation Services – Discovery Bay to Central\n\nPark Island Transport Company Ltd.:\n* Ma Wan to Central\n* Ma Wan to Tsuen Wan\n\nFortune Ferry (富裕小輪)\n* North Point to Kwun Tong\n* Tuen Mun to Tai O (via Tung Chung, Sha Lo Wan)\n\nCoral Sea Ferry (珊瑚海船務)\n* Sai Wan Ho to Kwun Tong\n* Sai Wan Ho to Lei Yue Mun (Sam Ka Tsuen)\n\nTsui Wah Ferry:\n* Lamma Island (Yung Chue Wan) to Aberdeen (Via: Pak Kok Tsuen)\n* Po Toi to Stanley / Aberdeen\n* Commuting routes for Tolo Harbour, Grass Island (known as:Tap Mun) and Long Harbour (known as: Tai Tan Hoi)\n\nExternal routes\n\nIn Hong Kong, there are three piers that provides ferry services to Macau and cities in southern China:\n* The Hong Kong-Macau Ferry Terminal\n* The Hong Kong-China Ferry Terminal\n* The Skypier (For Transitting Only)\nFerry services are provided by several different ferry companies at these piers.\n\nFastferry hydrofoil and catamaran service is available at all times of the week between Hong Kong and Macau.\n\nTurboJet provides 24-hour services connecting Central and Macau at a frequency of up to every 15 to 30 minutes. It also provides these regular services:\n* Hong Kong International Airport to Shenzhen Airport / Macau / Guangzhou (Nansha Ferry Port)\n* Tsim Sha Tsui to Guangzhou\n* Macau to Shenzhen Airport / Guangzhou\n* Tsim Sha Tsui to Macau\n\nCotai Water Jet provides about 18-hour services connecting Central and Taipa or Outer Harbour, Macau at a frequency of up to every 30 to 60 minutes. It also provides these regular services:\n* Hong Kong International Airport to Macau\n* Tsim Sha Tsui to Macau\n\nChu Kong Passenger Transport (CKS) connects Hong Kong to cities in Guangdong province, including Zhuhai (Jiuzhou), Shenzhen (Shekou), Zhongshan (Zhongshan Kong), Lianhua Shan (Panyu), Jiangmen, Gongyi, Sanbu, Gaoming, Heshan, Humen, Nanhai, Shunde, Doumen.\n\nPublic Transport Statistics\n\nThe average amount of time people spend commuting with public transit in Hong Kong, for example to and from work, on a weekday is 73 min. 21% of public transit riders, ride for more than 2 hours every day. The average amount of time people wait at a stop or station for public transit is 14 min, while 19% of riders wait for over 20 minutes on average every day. The average distance people usually ride in a single trip with public transit is 11.2 km, while 31% travel for over 12 km in a single direction.  Material was copied from this source, which is available under a [https://creativecommons.org/licenses/by/4.0/ Creative Commons Attribution 4.0 International License].\n\nAir transport\n\nAeroplanes \n\nPassenger and cargo jets serve external routes to international and Mainland China destinations from Hong Kong International Airport. Cathay Pacific and Hong Kong Airlines are two of the many examples of airlines operating and based in Hong Kong.\n\nHelicopters\n\nExternally, frequent passenger flights to Macau are scheduled daily. There are also chartered services for the VIP and business community within Hong Kong.\n\nAerial lift transport\n\nCable cars\n\nThere are two cable car systems in Hong Kong:\n\n* The Ngong Ping Cable Car is a  public cableway on Lantau Island. It links Tung Chung MTR station and Ngong Ping Terminal near Po Lin Monastery. It was opened on 18 September 2006.\n* The Ocean Park theme park also possesses a  cable car system between Nam Long Shan Headland and Wong Chuk Hang. This was opened in 1977 and is inside the paid area of the Park.\n\nInfrastructure\n\nPorts and harbours\n\nThe port of Hong Kong has always been a key factor in the development and prosperity of the territory, which is strategically located on the Far East trade routes and is in the geographical centre of the fast-developing Asia-Pacific Basin. The sheltered harbour provides good access and a safe haven for vessels calling at the port from around the world.\n\nThe Victoria Harbour is one of the busiest ports in the world. An average of 220,000 ships visit the harbour each year, including both oceanliners and river vessels, carrying both goods and passengers. The container port in Hong Kong is one of the busiest in the world. The Kwai Chung Terminal operates 24 hours a day. Together with other facilities in Victoria Harbour, they handled more than  in 2005. Some 400 container liners serve Hong Kong weekly, connecting to over 500 destinations around the world.\n\nAirports\n\nHong Kong has a fully active international airport. The famous former Kai Tak International Airport retired in favour of the recently constructed Hong Kong International Airport, also known as Chek Lap Kok International Airport. The airport now serves as a transport hub for East Asia, and as the hub for Cathay Pacific, Dragonair, Hong Kong Express, Hong Kong Airlines (former CR Airways), and Air Hong Kong. Ferry services link the airport with several piers in Pearl River Delta, where immigrations and customs are exempted. Kai Tak airport was closed because of privacy reasons and also because of safety reasons; the aircraft came very close to the skyscrapers. Besides, the runway was surrounded by water.\n\nHKIA’s network to China is also expanded by the opening of SkyPier in late-September 2003, offering millions in the PRD direct access to the airport. Passengers coming to SkyPier by high-speed ferries can board buses for onward flights while arriving air passengers can board ferries at the pier for their journeys back to the PRD. Passengers travelling in both directions can bypass custom and immigration formalities, which reduces transit time. Four ports – Shekou, Shenzhen, Macau and Humen (Dongguan) – were initially served. As of August 2007, SkyPier serves Shenzhen's Shekou and Fuyong, Dongguan's Humen, Macau, Zhongshan and Zhuhai. Moreover, passengers travelling from Shekou and Macau piers can even complete airline check-in procedures with participating airlines before boarding the ferries and go straight to the boarding gate for the connecting flight at HKIA. The provision of cross boundary coach and ferry services has transformed HKIA into an inter-modal transportation hub combining air, sea and land transport.\n\n, the airport is the third busiest airport for passenger traffic, and second-busiest airport for cargo traffic in the world. It is popular with travellers – from 2001 to 2005 and 2007–2008 Hong Kong International Airport has been voted the World's Best Airport in an annual survey of several million passengers worldwide by Skytrax.\n\nAccording to the Guinness World Records, the passenger terminal of the HKIA was the world's largest airport terminal upon opening, and is at present the world's third-largest airport terminal building, with a covered area of 550,000 m² and recently increased to 570,000 m². The Airport Core Programme was the most expensive airport project in the world.\n\nShek Kong Airfield, located near Yuen Long, is a military airfield for the People's Liberation Army, which is of limited operating capabilities due to surrounding terrain. The only aircraft operating on the airfield are PLA's Z-9 helicopters, which is the license-built version of the Eurocopter Dauphin.\n\nHeliports\n\nHong Kong has three heliports. Shun Tak Heliport (ICAO: VHST) is located in the Hong Kong-Macau Ferry Terminal, by the Shun Tak Centre, in Sheung Wan, on Hong Kong Island. Another is located in southwest Kowloon, near Kowloon Station. The other is located inside Hong Kong International Airport.\n\nHeli Express operates regular helicopter service between Macao Heliport (ICAO:VMMH) on the Macau Ferry Terminal in Macau and the Shun Tak Heliport. There are around 16 flights daily. Flights take approximately 20 minutes in the eight-seater aircraft.\n\nThere are also a number of helipads across the territory, including the roof of the Peninsula Hotel (which is the only rooftop helipad in Kowloon and Hong Kong Island, excluding the rooftop heliport of Shun Tak Centre and those in hospitals) and Cheung Chau Island, between Tung Wan Beach and Kwun Yam Beach.\n\nHighways\n\nThere are a total of 1,831 km of paved highways in Hong Kong. These roads are built to British standards with a maximum of four lanes with hard shoulders.\n\nThere are nine roads classified as highways in Hong Kong and were renumbered from 1 to 9 in 2004. Routes 1 to 3 are in a north–south direction (with each crossing one of the cross-harbour tunnels) while the others are in an east–west direction:\n\n*Route 1:\n:Southern District <> Causeway Bay <> Tsim Sha Tsui <> Mong Kok <> Sha Tin\n*Route 2:\n:Eastern District <> Kwun Tong <> Wong Tai Sin <> Sha Tin\n*Route 3:\n:Central & Western District <> Tai Kok Tsui <> Sham Shui Po <> Kwai Tsing <> Tsuen Wan <> Yuen Long\n*Route 4:\n:Eastern District <> Causeway Bay <> Wan Chai <> Central & Western District\n*Route 5:\n:Kowloon City <> Wong Tai Sin <> Sham Shui Po <> Kwai Tsing <> Tsuen Wan\n*Route 7:\n:Tseung Kwan O <> Kwun Tong <> Wong Tai Sin <> Sham Shui Po <> Kwai Tsing\n*Route 8:\n:Sha Tin <> Kwai Tsing <> Lantau Island North <> Tung Chung <> Airport\n*Route 9:\n:Circular Route linking the whole New Territories ( Sha Tin, Tai Po, Northern District, Yuen Long, Tuen Mun, Tsuen Wan )\n*Route 10:\n:Tuen Mun <> Nam Tei (Divided from Route 9) <> Ha Tsuen <> Deep Bay <> Shenzhen Bay Bridge <> Shenzhen Bay Border Crossing <> Mainland China\n\nRoute 6 is a proposed highway, and is not yet built.\n\nThere are 120 CCTV cameras monitoring traffic on these highways and connecting roads which are available on demand (now TV) and on the Transport Department's website.\n\nHighways in Hong Kong use two types of barrier system for divided highways. Older roads use metal guard rails and newer roads use the British Concrete step barrier.\n\nAll signage on highways and roads in Hong Kong are bilingual (traditional Chinese below and English above). Street signs use black text on a white background. Highway and directional signage are white lettering on blue or green background.\n\nBridges and tunnels\n\nThere are 12 major vehicular tunnels in Hong Kong. They include three cross-harbour tunnels and nine road tunnels.\n\nOther road tunnels and bridges which are proposed or under construction are:\n\n* Central Kowloon Route\n* Cross Bay Link\n* Hong Kong-Zhuhai-Macau Bridge (under construction)\n* Tseung Kwan O – Lam Tin Tunnel\n* Trunk Road T2\n* Tuen Mun-Chek Lap Kok Link\n\nBus lanes\n\nThere are approximately 22 km of bus priority lanes in Hong Kong.\n\nBus termini\n\nBus termini in Hong Kong include:\n* Admiralty (East) Public Transport Interchange\n* Central (Macau Ferry) Bus Terminus\n* Pokfield Road Bus Terminus\n* Kwun Tong Ferry Bus Terminus\n* Tsim Sha Tsui Ferry Bus Terminus\n* Kowloon Station Transport Interchange\n\nThere are many other termini.\n\nPedestrian infrastructure\n\nPedestrian infrastructure in Hong Kong includes:\n* Central Elevated Walkway\n* Lek Yuen Bridge\n\nPorts of entry\n\nThis is a list of ports of entry (i.e. immigration control points) in Hong Kong.\n\n*Air\n**Hong Kong International Airport\n**Heliport at the Hong Kong-Macau Ferry Terminal\n*Land\n**Lo Wu Control Point\n**Lok Ma Chau Control Point\n**Lok Ma Chau Spur Line\n**Man Kam To Control Point\n**Sha Tau Kok Control Point\n**Shenzhen Bay Control Point\n*Railway\n**Hung Hom Terminus (also called Kowloon Terminus)\n**West Kowloon Terminus (Under Construction)\n*Sea\n**Hong Kong-Macau Ferry Terminal\n** Hong Kong-China Ferry Terminal\n**Ocean Terminal\n**Kai Tak Cruise Terminal\n**Tuen Mun Ferry Pier \n**Western Immigration Anchorage\n**Eastern Immigration Anchorage\n** Tuen Mun Immigration Anchorage",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Transport in Hong Kong" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13411" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hong Kong has a highly developed and sophisticated transport network, encompassing both public and private transport. Based on Hong Kong Government's Travel Characteristics Survey, over 90% of the daily journeys are on public transport, the highest rate in the world.Lam, William H.K. [2003] (2003). Advanced Modeling for Transit Operations and Service Planning. Elsevier publishing.  However, in 2014 the Transport Advisory Committee, which advises the Government on transportation issues, issued a report on the much worsened congestion problem in Hong Kong and pointed at the excessive growth of private cars during the past 10–15 years.http://www.thb.gov.hk/eng/boards/transport/land/Full_Eng_C_cover.pdf\n\nThe Octopus card, a smart electronic money payment system, was introduced in September 1997 to provide an alternative to the traditional banknotes and coins. Available for purchase in every stop of the Mass Transit Railway system, the Octopus card is a non-touch payment system which allows payment not only for public transport (such as trains, buses, trams, ferries and minibuses), but also at parking meters, convenience stores, supermarkets, fast-food restaurants and most vending machines.\n\nAutomated pedestrian transport\n\nEscalators and moving pavements\n\nHong Kong Island is dominated by steep, hilly terrain, which required the development of unusual methods of transport up and down the slopes. In Central and Western district, there is an extensive system of zero-fare escalators and moving pavements. The Mid-levels Escalator is the longest outdoor covered escalator system in the world, operating downhill until 10am for commuters going to work, and then operating uphill until midnight.\n\nThe Mid-levels Escalator consists of twenty escalators and three moving pavements. It is 800 metres long, and climbs 135 vertical metres. Total travel time is approximately 25 minutes, but most people walk while the escalator moves to shorten the travel time. Due to its vertical climb, the same distance is equivalent to several miles of zigzagging roads if travelled by car. Daily traffic exceeds 35,000 people. It has been operating since 1993 and cost HK$240,000,000 (US$30,000,000) to build.\n\nA second Mid-Levels escalator set is planned in Sai Ying Pun: the Centre Street Escalator Link.\n\nRail transport\n\nHong Kong has an extensive railway network, and the Hong Kong Government has long established that the public transit system has \"railway as its backbone\". Public transport trains are operated by the MTR Corporation. The MTR operates the metro network within inner urban Hong Kong, Kowloon Peninsula and the northern part of Hong Kong Island with newly developed areas, Tsuen Wan, Tseung Kwan O, Tung Chung, Hong Kong Disneyland, the Hong Kong International Airport, the northeastern and northwestern parts of the New Territories. The Hong Kong Tramways operates a tram service exclusively on northern Hong Kong Island. The Peak Tram connects Central, Hong Kong's central business district, with Victoria Peak.\n\nMass Transit Railway\n\nOpened in 1979, the system now includes 218.2 km (135.6 mi) of rail with 161 stations, including 93 railway stations and 68 light rail stops. The railway lines include the East Rail, Kwun Tong, Tsuen Wan, Island, Tung Chung, Tseung Kwan O, West Rail, Ma On Shan, South Island, the Airport Express and the Disneyland Resort lines. Nine of the lines provide general metro services, whereas the Airport Express provides a direct link from the Hong Kong International Airport into the city centre, and the Disneyland Resort Line exclusively takes passengers to and from Hong Kong Disneyland.\n\nThe Light Rail possesses many characteristics of a tramway, including running on streets with other traffic (at grade) on some of it's tracks and providing services for the public in the northwestern New Territories, including Tuen Mun and Yuen Long.\n\nAll trains and most MTR stations are air-conditioned.\n\nTramways\n\nThe Hong Kong Tramways is the tram system run exclusively with double deckers. The electric tram system was proposed in 1881; however nobody was willing to invest in a system at the time. In August 1901, the Second Tramway Bill was introduced and passed into law as the 1902 Tramway Ordinance. Hong Kong Tramway Electric Company Limited, a British company, was authorised to take the responsibilities in construction and daily operation. In 1904, the tram system first got into service. It was soon taken over by another company, Electric Tranction Company of Hong Kong Limited and then the name was changed to Hong Kong Tramways Company Limited in 1910.\n\nThe rail system is 13 km long,\n with a total track length of 30 km, and it runs together with other vehicles on the street. Its operation relies on the 550V direct current (d.c.) from the overhead cables, on 3'6\" gauge (1067 mm) tracks. The trams provide service to only parts of Hong Kong Island: they run on a double track along the northern coast of Hong Kong Island from Kennedy Town to Shau Kei Wan, with a single clockwise-running track of about 3 km around Happy Valley Racecourse.\n\nFunicular railways\n\nThere are four funicular railway services in Hong Kong:\n\n* The Peak Tram carries both tourists and residents to the upper levels of Hong Kong Island. It provides the most direct route to Victoria Peak and offers scenic views over Victoria Harbour and the skyscrapers of Hong Kong. It was inaugurated in 1888.\n* The Ocean Express operates within the paid area of the Ocean Park theme park. It links two parts of the park, operating entirely in a tunnel. The ride is themed, and uses multimedia effects to simulate the feeling of travelling into the depths of the sea. It was opened in 2009.\n* The Po Fook Hill Elevator serves the Po Fook Hill Ancestral Hall in Shatin.\n* The Discovery Bay Elevator serves the private housing estate Amalfi on Lantau Island.\n\nAirport people-mover system \n\nThe Hong Kong International Airport Automated People Mover is a driverless people-mover system located within the Hong Kong International Airport in Chek Lap Kok. It operates in two \"segments\". For departures, the train runs from Terminal 2 to the East Hall to the West Hall. For arrivals, the train runs only from the West Hall to the East Hall, where all passengers must disembark for immigration, customs, and baggage claim. Operation of the first segment commenced in 1998, and the operation of the second segment commenced in early-2007.\n\nThere is another system between the terminals. There is also a travellator which can be used.\n\nCross-border trains \n\nInter-city train services crossing the Hong Kong-China boundary are known as Intercity Through Trains. They are jointly operated by Hong Kong's MTR Corporation and the Ministry of Railways of the People's Republic of China. Currently, Hung Hom Station (formerly called Kowloon Station) is the only station in Hong Kong where passengers can catch these trains. Passengers have to go through immigration and customs before boarding. There are currently three through train routes:\n\n* Between Hong Kong and Beijing (Beijing-Kowloon Through Train)\n* Between Hong Kong and Shanghai (Shanghai-Kowloon Through Train)\n* Between Hong Kong and Guangzhou (Guangzhou-Kowloon Through Train)\n\nA new high-speed service, the Guangzhou-Shenzhen-Hong Kong Express Rail Link, is being built. A new train station, West Kowloon Terminus, will be built in Hong Kong to serve this new railway.\n\nRoad transport\n\nBuses\n\nBus services have a long history in Hong Kong. As of 2015, five companies operate franchised public bus services, each granted ten-year exclusive operating rights to the set of routes that they operate.http://www.td.gov.hk/en/publications_and_press_releases/press_releases/transport_department/index_t_id_2251.html Franchise buses altogether carry about one-third of the total daily public transport market of around 12,000,000 passengers, with KMB having 67% of the franchised bus market share, CityBus with 16% and New World First Bus with 13%.[http://www.censtatd.gov.hk/hkstat/sub/sp140.jsp?productCode=B1010002 \"Hong Kong Digest of Statistics\"] There are also a variety of non-franchised public buses services, including feeder bus services to railway stations operated by the railway companies, and residents' services for residential estates (particularly those in the New Territories).\n\nThe five franchised bus companies are:\n* Kowloon Motor Bus Company (1933) Limited;\n* Citybus Limited;\n* Long Win Bus Company Limited;\n* New World First Bus Services Limited; and\n* New Lantao Bus Company (1973) Limited.\n\nFounded in 1933, the Kowloon Motor Bus Company (1933) Limited (KMB) is one of the largest privately owned public bus operators in the world. KMB's fleet consist of about 3,900 buses on 400 routes and a staff of over 12,000 people. In 1979, Citybus began its operations in Hong Kong with one double-decker, providing shuttle service for the Hong Kong dockyard. It later expanded into operating a residential bus route between City One, Shatin and Kowloon Tong MTR station. New World First Bus Services Limited was established in 1998, taking over China Motor Bus's franchise to provide bus services on Hong Kong Island together with Citybus. NWFB's owner company later bought Citybus, but the two companies have basically been operating independently.\n\nPublic light buses\n\nPublic light buses (小巴) (widely referred to as minibuses, or sometimes maxicabs, a de facto share taxi) run the length and breadth of Hong Kong, through areas which the standard bus lines can not or do not reach as frequently, quickly or directly. Minibuses carry a maximum of 16 (19 for some routes since 2017) passengers; standing is not permitted.\n\nThe Hong Kong Transport Department (HKTD) allows and licenses the operation of two types of public light buses:\n# green minibuses that have route numbers, stop at designated stops (many routes have hail and ride sections along which passengers can board and exit anywhere unless it's a no-stopping zone) and which have their fares, service and frequency regulated by the HKTD; and\n# red minibuses that may or may not have regular routes, may or may not be numbered, may or may not have fixed stops and whose fares and service levels are not regulated by HKTD.[http://www.td.gov.hk/FileManager/EN/Content_275/plbpolicy.doc HKTD Public Light Bus Policy]. Accessed 11 December 2006\n\nRed minibuses often provide more convenient transport for passengers not served by green minibuses or other public buses, and are thus quite popular. Where green minibus drivers are paid fixed wages to drive their routes, red minibus drivers often rely on their fares for a living and thus are often seen to be more aggressive drivers. The prevalence of aggressive driving has resulted in the Transport Department making it mandatory for Hong Kong minibuses to be equipped with large read-out speedometers which allow passengers to track the speed at which minibus drivers operate. Currently, if minibuses exceed 80 km/h, the speedometer will sound an audible warning signal to the driver and passengers. If the minibus exceeds 100 km/h, the beeping will turn into a sustained tone. However, almost without exception; this warning signal is ignored by both driver and passengers.\n\nThe Transport Department has also regulated, after a series of minibus accidents, that all new minibuses brought into service after August 2005 must have seat belts installed, and passengers must use seat belts when they are provided.\n\nTaxis\n\n, there were 18,138 taxis in Hong Kong, operating in three distinct (but slightly overlapping) geographical areas, and distinguished by their colour. Of these, 15,250 are red urban taxis, 2,838 green New Territories taxis, and 50 blue Lantau taxis. Every day, they serve 1,100,000, 207,900, and 1,400 passengers respectively. Taxis carry an average of 1,000,000 passengers each day, occupying about 12% of the daily patronage carried by all modes of public transport in Hong Kong.\n\nMost of the taxis in Hong Kong run on LPG (liquified petroleum gas) to reduce emissions. In August 2000, a one-off grant was paid in cash to taxi owners who replaced their diesel taxi with an LPG one. Since August 2001, all newly purchased taxis run on LPG. By the end of 2003, over 99.8% of the taxi fleet in Hong Kong ran on LPG.\n\nTaxi fares are charged according to the taximeter; however, additional charges on the fare table may apply, such as road tolls and luggage fees. Urban taxis are the most expensive, while Lantau taxis are the cheapest. The standard of service among different kinds of taxis is mostly the same. The reason for having three types of taxis is to ensure service availability in less populated regions, as running in the urban centre is considered to be more profitable.\n\nPrivate cars\n\nAs of May 2015, the Census and Statistics Department of Hong Kong reports that there are 504,798 licensed vehicles in Hong Kong. In terms of private car ownership, the number of cars per capita is half that of Singapore and one-third that of Taiwan. However, the Transport Advisory Committee, which advises the government on transport policies, issued a report stating that the growth of private cars is too fast and must be contained so as to alleviate congestion problems of Hong Kong. Private cars are most popular in newly developed areas such as New Territories and Lantau and areas near the border with mainland China, as there are fewer public transportation options, and more parking spaces compared to other areas of Hong Kong.\n\nMost cars are right-hand drive models, from Japanese or European manufacturers. Hong Kong does not allow left-hand drive vehicles to be primarily registered in Hong Kong. However, Hong Kong registered vehicles may apply for secondary mainland Chinese registration plates, and these can be driven across the border to mainland China; likewise, left-hand drive cars seen in Hong Kong are usually primarily registered in mainland China and carry supplementary Hong Kong registration plates.\n\nCars are subjected to a first-time registration tax, which varies from 35% to over 100%, based on the size and value of the car. The level of vehicle taxation was increased by a law passed on 2 June 1982 to discourage private car ownership,[http://sunzi1.lib.hku.hk/newspaper/view/16_01.03/63037.pdf Legco doubts on car curbs], South China Morning Post, 3 June 1982 and also as an incentive to buy smaller, more efficient cars, as these have less tax levied on them. First-time registration tax was doubled, annual licensing fees were increased by 300%, and $0.70 duty fee was imposed on each litre of light oils.Michael Chugani, [http://sunzi1.lib.hku.hk/newspaper/view/16_01.01/62742.pdf Legco doubts on car curbs], South China Morning Post, 20 May 1982\n\nIn addition to the heavy traffic at times, parking may be problematic. Due to high urban density, there are not many filling stations; Petrol in Hong Kong averages around US$2.04 per litre, of which over half the cost is taxes. It was suggested in the news that the government had deliberately impeded the use of new environmentally friendly diesel engines by allowing only light goods vehicles to be fuelled by diesel. While it cannot be determined why exactly the government does not allow private cars to be fuelled by diesel, it has been pointed out that the government does receive a tax that is 150% of the actual fuel cost. This is mostly to discourage car ownership for environmental reasons.Mottershead, Terri. [2004] (2004). Sustainable Development in Hong Kong. HK University. \n\nThere is a waiting list for local driving tests, while a full (private car) driving licence valid for ten years costs around US$115. Residents of Hong Kong holding licences issued by other Chinese authorities and some foreign countries can get a Hong Kong driving licence exempt from tests if they can adequately show that they obtained their licence while residing in the place concerned (common proofs are school transcripts or employer's documentation). Some private car owners, known as white card drivers, provide a taxi service for a nominal fee.\n\nBicycles\n\nCycling is a popular means of transport in many parts of the New Territories, where new towns such as Shatin, Tai Po and Sheung Shui have significant cycle track networks. In the auto congested urban areas of Hong Kong and Kowloon, cycling is less common, despite the relatively flat topography of populated areas, in part because it is government policy[http://hkcyclingalliance.org/who-are-we/what-do-we-do HK Cycling Alliance] not to support cycling as part of the transportation system. In 2011, MTR Corporation announced that bicycles were permitted to be taken on all MTR rail lines.[http://hkcyclingalliance.org/getting-around-hk/trains MTR Announce Bicycles permitted on all lines]\n\nMotorcycles\n\nMotorcycles by the private users in Hong Kong urban districts are not as popular as in other South East Asian countries like Vietnam. They are mostly used for commercial and business purposes.\n\nCross-border buses\n\nA large number of buses leave various parts of Hong Kong (usually from side streets and hotel entrances) to various cities in the Pearl River Delta, Shenzhen and Guangzhou.\n\nMaritime transport\n\nFerries\n\nInternal routes\n\nMost ferry services are provided by licensed ferry operators. , there were 27 regular licensed passenger ferry services operated by 11 licensees, serving outlying islands, new towns and inner-Victoria Harbour. Two of the routes operated by the Star Ferry are franchised. Additionally, 78 \"kai-to\" ferries are licensed to serve remote coastal settlements.\n\nThe following companies operate ferry services in Hong Kong:\n\nStar Ferry:\n* Central to Tsim Sha Tsui\n* Wan Chai to Tsim Sha Tsui\n* Central to Hung Hom (termination effective 1 April 2011)\n* Wan Chai to Hung Hom (termination effective 1 April 2011)\n* Harbour Tour (Circular between Tsim Sha Tsui, Central, Wan Chai, and Hung Hom)\n\nNew World First Ferry:\n* Central to Cheung Chau \n*Central to Mui Wo\n* Peng Chau, Mui Wo, Chi Ma Wan, and Cheung Chau\n* North Point to Hung Hom\n* North Point to Kowloon City\n\nHong Kong & Kowloon Ferry:\n* Lamma Island to Central\n* Central to Peng Chau\n* Peng Chau to Hei Ling Chau\n\nChuen Kee Ferry:\n* Lamma Island(Sok Kwu Wan and Mo Tat) to Aberdeen\n\nHKR International Limited:\n* Discovery Bay Transportation Services – Discovery Bay to Central\n\nPark Island Transport Company Ltd.:\n* Ma Wan to Central\n* Ma Wan to Tsuen Wan\n\nFortune Ferry (富裕小輪)\n* North Point to Kwun Tong\n* Tuen Mun to Tai O (via Tung Chung, Sha Lo Wan)\n\nCoral Sea Ferry (珊瑚海船務)\n* Sai Wan Ho to Kwun Tong\n* Sai Wan Ho to Lei Yue Mun (Sam Ka Tsuen)\n\nTsui Wah Ferry:\n* Lamma Island (Yung Chue Wan) to Aberdeen (Via: Pak Kok Tsuen)\n* Po Toi to Stanley / Aberdeen\n* Commuting routes for Tolo Harbour, Grass Island (known as:Tap Mun) and Long Harbour (known as: Tai Tan Hoi)\n\nExternal routes\n\nIn Hong Kong, there are three piers that provides ferry services to Macau and cities in southern China:\n* The Hong Kong-Macau Ferry Terminal\n* The Hong Kong-China Ferry Terminal\n* The Skypier (For Transitting Only)\nFerry services are provided by several different ferry companies at these piers.\n\nFastferry hydrofoil and catamaran service is available at all times of the week between Hong Kong and Macau.\n\nTurboJet provides 24-hour services connecting Central and Macau at a frequency of up to every 15 to 30 minutes. It also provides these regular services:\n* Hong Kong International Airport to Shenzhen Airport / Macau / Guangzhou (Nansha Ferry Port)\n* Tsim Sha Tsui to Guangzhou\n* Macau to Shenzhen Airport / Guangzhou\n* Tsim Sha Tsui to Macau\n\nCotai Water Jet provides about 18-hour services connecting Central and Taipa or Outer Harbour, Macau at a frequency of up to every 30 to 60 minutes. It also provides these regular services:\n* Hong Kong International Airport to Macau\n* Tsim Sha Tsui to Macau\n\nChu Kong Passenger Transport (CKS) connects Hong Kong to cities in Guangdong province, including Zhuhai (Jiuzhou), Shenzhen (Shekou), Zhongshan (Zhongshan Kong), Lianhua Shan (Panyu), Jiangmen, Gongyi, Sanbu, Gaoming, Heshan, Humen, Nanhai, Shunde, Doumen.\n\nPublic Transport Statistics\n\nThe average amount of time people spend commuting with public transit in Hong Kong, for example to and from work, on a weekday is 73 min. 21% of public transit riders, ride for more than 2 hours every day. The average amount of time people wait at a stop or station for public transit is 14 min, while 19% of riders wait for over 20 minutes on average every day. The average distance people usually ride in a single trip with public transit is 11.2 km, while 31% travel for over 12 km in a single direction.  Material was copied from this source, which is available under a [https://creativecommons.org/licenses/by/4.0/ Creative Commons Attribution 4.0 International License].\n\nAir transport\n\nAeroplanes \n\nPassenger and cargo jets serve external routes to international and Mainland China destinations from Hong Kong International Airport. Cathay Pacific and Hong Kong Airlines are two of the many examples of airlines operating and based in Hong Kong.\n\nHelicopters\n\nExternally, frequent passenger flights to Macau are scheduled daily. There are also chartered services for the VIP and business community within Hong Kong.\n\nAerial lift transport\n\nCable cars\n\nThere are two cable car systems in Hong Kong:\n\n* The Ngong Ping Cable Car is a  public cableway on Lantau Island. It links Tung Chung MTR station and Ngong Ping Terminal near Po Lin Monastery. It was opened on 18 September 2006.\n* The Ocean Park theme park also possesses a  cable car system between Nam Long Shan Headland and Wong Chuk Hang. This was opened in 1977 and is inside the paid area of the Park.\n\nInfrastructure\n\nPorts and harbours\n\nThe port of Hong Kong has always been a key factor in the development and prosperity of the territory, which is strategically located on the Far East trade routes and is in the geographical centre of the fast-developing Asia-Pacific Basin. The sheltered harbour provides good access and a safe haven for vessels calling at the port from around the world.\n\nThe Victoria Harbour is one of the busiest ports in the world. An average of 220,000 ships visit the harbour each year, including both oceanliners and river vessels, carrying both goods and passengers. The container port in Hong Kong is one of the busiest in the world. The Kwai Chung Terminal operates 24 hours a day. Together with other facilities in Victoria Harbour, they handled more than  in 2005. Some 400 container liners serve Hong Kong weekly, connecting to over 500 destinations around the world.\n\nAirports\n\nHong Kong has a fully active international airport. The famous former Kai Tak International Airport retired in favour of the recently constructed Hong Kong International Airport, also known as Chek Lap Kok International Airport. The airport now serves as a transport hub for East Asia, and as the hub for Cathay Pacific, Dragonair, Hong Kong Express, Hong Kong Airlines (former CR Airways), and Air Hong Kong. Ferry services link the airport with several piers in Pearl River Delta, where immigrations and customs are exempted. Kai Tak airport was closed because of privacy reasons and also because of safety reasons; the aircraft came very close to the skyscrapers. Besides, the runway was surrounded by water.\n\nHKIA’s network to China is also expanded by the opening of SkyPier in late-September 2003, offering millions in the PRD direct access to the airport. Passengers coming to SkyPier by high-speed ferries can board buses for onward flights while arriving air passengers can board ferries at the pier for their journeys back to the PRD. Passengers travelling in both directions can bypass custom and immigration formalities, which reduces transit time. Four ports – Shekou, Shenzhen, Macau and Humen (Dongguan) – were initially served. As of August 2007, SkyPier serves Shenzhen's Shekou and Fuyong, Dongguan's Humen, Macau, Zhongshan and Zhuhai. Moreover, passengers travelling from Shekou and Macau piers can even complete airline check-in procedures with participating airlines before boarding the ferries and go straight to the boarding gate for the connecting flight at HKIA. The provision of cross boundary coach and ferry services has transformed HKIA into an inter-modal transportation hub combining air, sea and land transport.\n\n, the airport is the third busiest airport for passenger traffic, and second-busiest airport for cargo traffic in the world. It is popular with travellers – from 2001 to 2005 and 2007–2008 Hong Kong International Airport has been voted the World's Best Airport in an annual survey of several million passengers worldwide by Skytrax.\n\nAccording to the Guinness World Records, the passenger terminal of the HKIA was the world's largest airport terminal upon opening, and is at present the world's third-largest airport terminal building, with a covered area of 550,000 m² and recently increased to 570,000 m². The Airport Core Programme was the most expensive airport project in the world.\n\nShek Kong Airfield, located near Yuen Long, is a military airfield for the People's Liberation Army, which is of limited operating capabilities due to surrounding terrain. The only aircraft operating on the airfield are PLA's Z-9 helicopters, which is the license-built version of the Eurocopter Dauphin.\n\nHeliports\n\nHong Kong has three heliports. Shun Tak Heliport (ICAO: VHST) is located in the Hong Kong-Macau Ferry Terminal, by the Shun Tak Centre, in Sheung Wan, on Hong Kong Island. Another is located in southwest Kowloon, near Kowloon Station. The other is located inside Hong Kong International Airport.\n\nHeli Express operates regular helicopter service between Macao Heliport (ICAO:VMMH) on the Macau Ferry Terminal in Macau and the Shun Tak Heliport. There are around 16 flights daily. Flights take approximately 20 minutes in the eight-seater aircraft.\n\nThere are also a number of helipads across the territory, including the roof of the Peninsula Hotel (which is the only rooftop helipad in Kowloon and Hong Kong Island, excluding the rooftop heliport of Shun Tak Centre and those in hospitals) and Cheung Chau Island, between Tung Wan Beach and Kwun Yam Beach.\n\nHighways\n\nThere are a total of 1,831 km of paved highways in Hong Kong. These roads are built to British standards with a maximum of four lanes with hard shoulders.\n\nThere are nine roads classified as highways in Hong Kong and were renumbered from 1 to 9 in 2004. Routes 1 to 3 are in a north–south direction (with each crossing one of the cross-harbour tunnels) while the others are in an east–west direction:\n\n*Route 1:\n:Southern District <> Causeway Bay <> Tsim Sha Tsui <> Mong Kok <> Sha Tin\n*Route 2:\n:Eastern District <> Kwun Tong <> Wong Tai Sin <> Sha Tin\n*Route 3:\n:Central & Western District <> Tai Kok Tsui <> Sham Shui Po <> Kwai Tsing <> Tsuen Wan <> Yuen Long\n*Route 4:\n:Eastern District <> Causeway Bay <> Wan Chai <> Central & Western District\n*Route 5:\n:Kowloon City <> Wong Tai Sin <> Sham Shui Po <> Kwai Tsing <> Tsuen Wan\n*Route 7:\n:Tseung Kwan O <> Kwun Tong <> Wong Tai Sin <> Sham Shui Po <> Kwai Tsing\n*Route 8:\n:Sha Tin <> Kwai Tsing <> Lantau Island North <> Tung Chung <> Airport\n*Route 9:\n:Circular Route linking the whole New Territories ( Sha Tin, Tai Po, Northern District, Yuen Long, Tuen Mun, Tsuen Wan )\n*Route 10:\n:Tuen Mun <> Nam Tei (Divided from Route 9) <> Ha Tsuen <> Deep Bay <> Shenzhen Bay Bridge <> Shenzhen Bay Border Crossing <> Mainland China\n\nRoute 6 is a proposed highway, and is not yet built.\n\nThere are 120 CCTV cameras monitoring traffic on these highways and connecting roads which are available on demand (now TV) and on the Transport Department's website.\n\nHighways in Hong Kong use two types of barrier system for divided highways. Older roads use metal guard rails and newer roads use the British Concrete step barrier.\n\nAll signage on highways and roads in Hong Kong are bilingual (traditional Chinese below and English above). Street signs use black text on a white background. Highway and directional signage are white lettering on blue or green background.\n\nBridges and tunnels\n\nThere are 12 major vehicular tunnels in Hong Kong. They include three cross-harbour tunnels and nine road tunnels.\n\nOther road tunnels and bridges which are proposed or under construction are:\n\n* Central Kowloon Route\n* Cross Bay Link\n* Hong Kong-Zhuhai-Macau Bridge (under construction)\n* Tseung Kwan O – Lam Tin Tunnel\n* Trunk Road T2\n* Tuen Mun-Chek Lap Kok Link\n\nBus lanes\n\nThere are approximately 22 km of bus priority lanes in Hong Kong.\n\nBus termini\n\nBus termini in Hong Kong include:\n* Admiralty (East) Public Transport Interchange\n* Central (Macau Ferry) Bus Terminus\n* Pokfield Road Bus Terminus\n* Kwun Tong Ferry Bus Terminus\n* Tsim Sha Tsui Ferry Bus Terminus\n* Kowloon Station Transport Interchange\n\nThere are many other termini.\n\nPedestrian infrastructure\n\nPedestrian infrastructure in Hong Kong includes:\n* Central Elevated Walkway\n* Lek Yuen Bridge\n\nPorts of entry\n\nThis is a list of ports of entry (i.e. immigration control points) in Hong Kong.\n\n*Air\n**Hong Kong International Airport\n**Heliport at the Hong Kong-Macau Ferry Terminal\n*Land\n**Lo Wu Control Point\n**Lok Ma Chau Control Point\n**Lok Ma Chau Spur Line\n**Man Kam To Control Point\n**Sha Tau Kok Control Point\n**Shenzhen Bay Control Point\n*Railway\n**Hung Hom Terminus (also called Kowloon Terminus)\n**West Kowloon Terminus (Under Construction)\n*Sea\n**Hong Kong-Macau Ferry Terminal\n** Hong Kong-China Ferry Terminal\n**Ocean Terminal\n**Kai Tak Cruise Terminal\n**Tuen Mun Ferry Pier \n**Western Immigration Anchorage\n**Eastern Immigration Anchorage\n** Tuen Mun Immigration Anchorage. Transport in Hong Kong. http://en.wikipedia.org/?curid=13411."
  }
}
