{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19654",
  "eid" : "3cdb6e30-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778611347,
  "textBody" : "Events\n\n*  AD 70 – Siege of Jerusalem: Titus and his Roman legions breach the Second Wall of Jerusalem. Jewish defenders retreat to the First Wall. The Romans build a circumvallation, cutting down all trees within fifteen kilometres.\n*1381 – Beginning of the Peasants' Revolt in England.\n*1416 – The Council of Constance, called by Emperor Sigismund, a supporter of Antipope John XXIII, burns Jerome of Prague following a trial for heresy.\n*1431 – Hundred Years' War: In Rouen, France, the 19-year-old Joan of Arc is burned at the stake by an English-dominated tribunal. The Roman Catholic Church remembers this day as the celebration of Saint Joan of Arc.\n*1434 – Hussite Wars: Battle of Lipany: Effectively ending the war, Utraquist forces led by Diviš Bořek of Miletínek defeat and almost annihilate Taborite forces led by Prokop the Great.\n*1510 – During the reign of the Zhengde Emperor, Ming dynasty rebel leader Zhu Zhifan is defeated by commander Qiu Yue, ending the Prince of Anhua rebellion.\n*1536 – King Henry VIII of England marries Jane Seymour, a lady-in-waiting to his first two wives.\n*1539 – In Florida, Hernando de Soto lands at Tampa Bay with 600 soldiers with the goal of finding gold.\n*1574 – Henry III becomes King of France.\n*1588 – The last ship of the Spanish Armada sets sail from Lisbon heading for the English Channel.\n*1631 – Publication of Gazette de France, the first French newspaper.\n*1635 – Thirty Years' War: The Peace of Prague is signed.\n*1642 – From this date all honors granted by Charles I are retroactively annulled by Parliament.\n*1806 – Future U.S. President Andrew Jackson kills Charles Dickinson in a duel.\n*1814 – Napoleonic Wars: War of the Sixth Coalition: The Treaty of Paris (1814) is signed returning French borders to their 1792 extent. Napoleon is exiled to Elba.\n*1815 – The East Indiaman Arniston is wrecked during a storm at Waenhuiskrans, near Cape Agulhas, in present-day South Africa, with the loss of 372 lives.\n*1834 – Minister of Justice Joaquim António de Aguiar issues a law seizing \"all convents, monasteries, colleges, hospices and any other houses\" from the Catholic religious orders in Portugal, earning him the nickname of \"The Friar-Killer\".\n*1842 – John Francis attempts to murder Queen Victoria as she drives down Constitution Hill in London with Prince Albert.\n*1845 – The Fatel Razack coming from India, lands in the Gulf of Paria in Trinidad and Tobago carrying the first Indians to the country.\n*1854 – The Kansas–Nebraska Act becomes law establishing the US territories of Kansas and Nebraska.\n*1868 – Decoration Day (the predecessor of the modern \"Memorial Day\") is observed in the United States for the first time (by \"Commander-in-chief of the Grand Army of the Republic\" John A. Logan's proclamation on May 5).\n*1876 – Ottoman sultan Abdülaziz is deposed and succeeded by his nephew Murad V.\n*1883 – In New York City, a stampede on the recently opened Brooklyn Bridge killed twelve people.\n*1899 – Pearl Hart, a female outlaw of the Old West, robs a stage coach 30 miles southeast of Globe, Arizona.\n*1911 – At the Indianapolis Motor Speedway, the first Indianapolis 500 ends with Ray Harroun in his Marmon Wasp becoming the first winner of the 500-mile auto race.\n*1913 – The Treaty of London is signed, ending the First Balkan War; Albania becomes an independent nation.\n*1914 – The new, and then the largest, Cunard ocean liner , 45,647 tons, sets sails on her maiden voyage from Liverpool, England, to New York City.\n*1917 – Alexander I becomes king of Greece.\n*1922 – The Lincoln Memorial is dedicated in Washington, D.C..\n*1925 – May Thirtieth Movement: Shanghai Municipal Police Force shoot and kill 13 protesting workers.\n*1937 – Memorial Day massacre: Chicago police shoot and kill ten labor demonstrators.\n*1941 – World War II: Manolis Glezos and Apostolos Santas climb the Athenian Acropolis and tear down the German flag.\n*1942 – World War II: One thousand British bombers launch a 90-minute attack on Cologne, Germany.\n*1943 – The Holocaust: Josef Mengele becomes chief medical officer of the Zigeunerfamilienlager (Romani family camp) at Auschwitz concentration camp.\n*1948 – A dike along the flooding Columbia River breaks, obliterating Vanport, Oregon within minutes. Fifteen people die and tens of thousands are left homeless.\n*1958 – Memorial Day: The remains of two unidentified American servicemen, killed in action during World War II and the Korean War respectively, are buried at the Tomb of the Unknown Soldier in Arlington National Cemetery.\n*1959 – The Auckland Harbour Bridge, crossing the Waitematā Harbour in Auckland, New Zealand, is officially opened by Governor-General Charles Lyttelton, 10th Viscount Cobham.\n*1961 – The long-time Dominican dictator Rafael Trujillo is assassinated in Santo Domingo, Dominican Republic.\n*1963 – A protest against pro-Catholic discrimination during the Buddhist crisis is held outside South Vietnam's National Assembly, the first open demonstration during the eight-year rule of Ngo Dinh Diem.\n*1966 – Former Congolese Prime Minister, Évariste Kimba, and several other politicians are publicly executed in Kinshasa on the orders of President Joseph Mobutu.\n*1967 – The Nigerian Eastern Region declares independence as the Republic of Biafra, sparking a civil war.\n*1968 – Charles de Gaulle reappears publicly after his flight to Baden-Baden, Germany, and dissolves the French National Assembly by a radio appeal. Immediately after, less than one million of his supporters march on the Champs-Élysées in Paris. This is the turning point of May 1968 events in France.\n*1971 – Mariner program: Mariner 9 is launched to map 70% of the surface, and to study temporal changes in the atmosphere and surface, of Mars.\n*1972 – The Angry Brigade goes on trial over a series of 25 bombings throughout the United Kingdom.\n*  1972   – In Ben Gurion Airport (at the time: Lod Airport), Israel, members of the Japanese Red Army carry out the Lod Airport massacre, killing 24 people and injuring 78 others.\n*1974 – The Airbus A300 passenger aircraft first enters service.\n*1975 – European Space Agency is established.\n*1982 – Cold War: Spain joins NATO.\n*1989 – Tiananmen Square protests of 1989: The 33-foot high \"Goddess of Democracy\" statue is unveiled in Tiananmen Square by student demonstrators.\n*1998 – The 6.5  Afghanistan earthquake shook the Takhar Province of northern Afghanistan with a maximum Mercalli intensity of VII (Very strong), killing around 4,000–4,500.\n*  1998   – Nuclear Testing: Pakistan conducts an underground test in the Kharan Desert. It is reported to be a plutonium device with yield of 20kt TNT equivalent.\n*2003 – Depayin massacre: At least 70 people associated with the National League for Democracy are killed by government-sponsored mob in Burma. Aung San Suu Kyi fled the scene, but is arrested soon afterwards.\n*2008 – Convention on Cluster Munitions is adopted.\n*2012 – Former Liberian president Charles Taylor is sentenced to 50 years in prison for his role in atrocities committed during the Sierra Leone Civil War.\n*2013 – Nigeria passes a law banning same-sex marriage.\n\nBirths\n\n*1010 – Emperor Renzong of Song (d. 1063)\n*1201 – Theobald IV, Count of Champagne (d. 1253)\n*1423 – Georg von Peuerbach, German mathematician and astronomer (d. 1461)\n*1464 – Barbara of Brandenburg, Bohemian queen (d. 1515)\n*1580 – Fadrique de Toledo, 1st Marquis of Villanueva de Valdueza (d. 1634)\n*1599 – Samuel Bochart, French Protestant biblical scholar (d. 1667)\n*1623 – John Egerton, 2nd Earl of Bridgewater, English politician, Lord Lieutenant of Buckinghamshire (d. 1686)\n*1686 – Antonina Houbraken, Dutch illustrator (d. 1736)\n*1718 – Wills Hill, 1st Marquess of Downshire, English politician, Secretary of State for the Colonies (d. 1793)\n*1719 – Roger Newdigate, English politician (d. 1806)\n*1757 – Henry Addington, 1st Viscount Sidmouth, English politician, Prime Minister of the United Kingdom (d. 1844)\n*1768 – Étienne Marie Antoine Champion de Nansouty, French general (d. 1815)\n*  1768   – Georg Amadeus Carl Friedrich Naumann, German mineralogist and geologist (d. 1873)\n*1800 – Henri-Marie-Gaston Boisnormand de Bonnechose, French cardinal (d. 1883)\n*1814 – Mikhail Bakunin, Russian philosopher and theorist  (d. 1876)\n*  1814   – Eugène Charles Catalan, Belgian-French mathematician and academic (d. 1894)\n*1819 – William McMurdo, English general (d. 1894)\n*1820 – Pierre-Joseph-Olivier Chauveau, Canadian lawyer and politician, 1st Premier of Quebec (d. 1890)\n*1835 – Alfred Austin, English author, poet, and playwright (d. 1913)\n*1844 – Félix Arnaudin, French poet and photographer (d. 1921)\n*1845 – Amadeo I of Spain (d. 1890)\n*1846 – Peter Carl Fabergé, Russian goldsmith and jeweler (d. 1920)\n*1862 – Mirza Alakbar Sabir, Azerbaijani philosopher and poet (d. 1911)\n*1869 – Grace Andrews, American mathematician (d. 1951)\n*1874 – Ernest Duchesne, French physician (d. 1912)\n*1875 – Giovanni Gentile, Italian philosopher and academic (d. 1944)\n*1879 – Colin Blythe, English cricketer and soldier (d. 1917)\n*  1879   – Konstantin Ramul, Estonian psychologist and academic (d. 1975)\n*1881 – Georg von Küchler, German field marshal (d. 1968)\n*1882 – Wyndham Halswelle, English runner and soldier (d. 1915)\n*1883 – Sandy Pearce, Australian rugby league player (d. 1930)\n*1884 – Siegmund Glücksmann, German soldier and politician (d. 1942)\n*1885 – Villem Grünthal-Ridala, Estonian poet and linguist (d. 1942)\n*1886 – Laurent Barré, Canadian lawyer and politician (d. 1964)\n*  1886   – Randolph Bourne, American theorist and author (d. 1918)\n*1887 – Alexander Archipenko, Ukrainian-American sculptor and illustrator (d. 1964)\n*  1887   – Emil Reesen, Danish pianist, composer, and conductor (d. 1964)\n*1890 – Roger Salengro, French soldier and politician, French Minister of the Interior (d. 1936)\n*1892 – Fernando Amorsolo, Filipino painter (d. 1972)\n*1894 – Hubertus van Mook, Dutch politician, Governor-General of the Dutch East Indies (d. 1965)\n*1895 – Maurice Tate, English cricketer (d. 1956)\n*1896 – Howard Hawks, American director, producer, and screenwriter (d. 1977)\n*1897 – Frank Wise, Australian politician, 16th Premier of Western Australia (d. 1986)\n*1898 – John Gilroy, English artist and illustrator (d. 1985)\n*1899 – Irving Thalberg, American screenwriter and producer (d. 1936)\n*1901 – Alfred Karindi, Estonian pianist and composer (d. 1969)\n*  1901   – Cornelia Otis Skinner, American actress and author (d. 1979)\n*1902 – Stepin Fetchit, American actor and dancer (d. 1985)\n*1903 – Countee Cullen, American poet and author (d. 1946)\n*1906 – Bruno Gröning, Polish-German mystic and author (d. 1959)\n*1907 – Germaine Tillion, French anthropologist and academic (d. 2008)\n*1908 – Hannes Alfvén, Swedish physicist and engineer, Nobel Prize laureate (d. 1995)\n*  1908   – Mel Blanc, American voice actor (d. 1989)\n*1909 – Jacques Canetti, French music executive and talent agent (d. 1997)\n*  1909   – Freddie Frith, English motorcycle road racer (d. 1988)\n*  1909   – Benny Goodman, American clarinet player, songwriter, and bandleader (d. 1986)\n*1910 – Harry Bernstein, English-American journalist and author (d. 2011)\n*1912 – Julius Axelrod, American biochemist and academic, Nobel Prize laureate (d. 2004)\n*  1912   – Erich Bagge, German physicist and academic (d. 1996)\n*  1912   – Hugh Griffith, Welsh actor (d. 1980)\n*  1912   – Millicent Selsam, American author and academic (d. 1996)\n*  1912   – Joseph Stein, American playwright and author (d. 2010)\n*1914 – Akinoumi Setsuo, Japanese sumo wrestler, the 37th Yokozuna (d. 1979)\n*1916 – Justin Catayée, French soldier and politician (d. 1962)\n*  1916   – Mort Meskin, American illustrator (d. 1995)\n*1918 – Pita Amor, Mexican poet and author (d. 2000)\n*  1918   – Bob Evans, American businessman, founded Bob Evans Restaurants (d. 2007)\n*1919 – René Barrientos, Bolivian general and politician, 55th President of Bolivia (d. 1969)\n*1920 – Franklin J. Schaffner, Japanese-American director and producer (d. 1989)\n*1922 – Hal Clement, American author and educator (d. 2003)\n*1924 – Anthony Dryden Marshall, American CIA officer and diplomat (d. 2014)\n*1925 – John Henry Marks, English physician and author\n*1926 – Johnny Gimble, American country/western swing musician (Bob Wills and His Texas Playboys) (d. 2015)\n*1927 – Joan Birman, American mathematician\n*  1927   – Clint Walker, American actor and singer\n*  1927   – Billy Wilson, Australian rugby league player and coach (d. 1993)\n*1928 – Pro Hart, Australian painter (d. 2006)\n*  1928   – Agnès Varda, Belgian-French director, producer, and screenwriter\n*1929 – Georges Gilson, French archbishop\n*1930 – Mark Birley, English businessman, founded Annabel's (d. 2007)\n*  1930   – Robert Ryman, American painter\n*1931 – Larry Silverstein, American real estate magnate \n*1932 – Ray Cooney, English actor and playwright\n*  1932   – Pauline Oliveros, American accordion player and composer (d. 2016)\n*  1932   – Ivor Richard, Baron Richard, Welsh politician and diplomat, British Ambassador to the United Nations\n*1934 – Alexey Leonov, Russian general, pilot, and astronaut\n*  1934   – Alketas Panagoulias, Greek footballer and manager (d. 2012)\n*1935 – Ruta Lee, Canadian-American actress and dancer\n*  1935   – Guy Tardif, Canadian academic and politician (d. 2005)\n*1936 – Keir Dullea, American actor\n*1937 – Christopher Haskins, Anglo-Irish businessman, life peer, and British politician\n*  1937   – Rick Mather, American-English architect (d. 2013)\n*1938 – Billie Letts, American author and educator (d. 2014)\n*1939 – Michael J. Pollard, American actor\n*  1939   – Dieter Quester, Austrian race car driver\n*  1939   – Tim Waterstone, Scottish businessman, founded Waterstones\n*1940 – Jagmohan Dalmiya, Indian cricket administrator (d. 2015)\n*  1940   – Gilles Villemure, Canadian-American ice hockey player\n*1942 – John Gladwin, English bishop\n*  1942   – Carole Stone, English journalist and author\n*1943 – Anders Michanek Swedish motorcycle racer\n*  1943   – Gale Sayers, American football player and philanthropist\n*1944 – Lenny Davidson, English guitarist and songwriter (The Dave Clark Five)\n*  1944   – Meredith MacRae, American actress (d. 2000)\n*  1944   – Stav Prodromou, Greek-American engineer and businessman\n*1945 – Gladys Horton, American singer (d. 2011)\n*1946 – Allan Chapman, English historian and author\n*1947 – Jocelyne Bourassa, Canadian golfer\n*1948 – Johan De Muynck, Belgian former professional road racing cyclist\n*  1948   – Michael Piller, American screenwriter and producer (d. 2005)\n*  1948   – David Thorpe, Australian rules footballer\n*1949 – P.J. Carlesimo, American basketball player and coach\n*  1949   – Paul Coleridge, English lawyer and judge\n*  1949   – Bob Willis, English cricketer and sportscaster\n*1950 – Bertrand Delanoë, French politician, 14th Mayor of Paris\n*  1950   – Paresh Rawal, Indian actor, producer, and politician\n*  1950   – Joshua Rozenberg, English lawyer, journalist, and author\n*1951 – Zdravko Čolić, Bosnian Serb singer-songwriter \n*  1951   – Fernando Lugo, Paraguayan bishop and politician, President of Paraguay\n*  1951   – Stephen Tobolowsky, American actor, singer, and director\n*1952 – Daniel Grodnik, American screenwriter and producer\n*  1952   – Kerry Fraser, Canadian ice hockey player, referee, and sportscaster\n*1953 – Jim Hunter, Canadian skier\n*  1953   – Colm Meaney, Irish actor\n*1955 – Topper Headon, English drummer and songwriter (The Clash)\n*  1955   – Jacqueline McGlade, English-Canadian biologist, ecologist, and academic \n*  1955   – Caroline Swift, English lawyer and judge\n*  1955   – Colm Tóibín, Irish novelist, poet, playwright, and critic\n*1956 – Tim Lucas, American author, screenwriter, and critic\n*1957 – Michael Clayton, Australian golfer\n*1958 – Eugene Belliveau, Canadian football player\n*  1958   – Marie Fredriksson, Swedish singer-songwriter and pianist \n*  1958   – Steve Israel, American lawyer and politician\n*  1958   – Michael López-Alegría, Spanish-American captain, pilot, and astronaut\n*  1958   – Ted McGinley, American actor\n*1959 – Phil Brown, English footballer, coach, and manager\n*  1959   – Randy Ferbey, Canadian curler\n*  1959   – Frank Vanhecke, Belgian politician\n*1961 – Harry Enfield, English actor, director, and screenwriter\n*  1961   – Bob Yari, Iranian-American director and producer\n*1962 – Kevin Eastman, American author and illustrator, co-created the Teenage Mutant Ninja Turtles \n*  1962   – Richard Fuller, English lawyer and politician\n*  1962   – Tim Loughton, English businessman and politician\n*  1962   – Tonya Pinkins, American actress and singer\n*1963 – Michel Langevin, Canadian drummer and songwriter \n*  1963   – Élise Lucet, French journalist\n*  1963   – Helen Sharman, English chemist and astronaut \n*1964 – Wynonna Judd, American singer-songwriter, guitarist, and actress \n*  1964   – Andrea Montermini, Italian race car driver\n*  1964   – Tom Morello, American singer-songwriter, guitarist, and actor \n*1965 – Troy Coker, Australian rugby player\n*  1965   – Billy Donovan, American basketball player and coach\n*  1965   – Iginio Straffi, Italian animator and producer, founded Rainbow S.r.l. \n*1966 – Thomas Häßler, German footballer and manager\n*  1966   – Stephen Malkmus, American singer-songwriter and guitarist \n*1967 – Tim Burgess, English singer-songwriter \n*  1967   – Rechelle Hawkes, Australian hockey player\n*  1967   – Sven Pipien, German-American bass player \n*1968 – Jason Kenney, Canadian lawyer and politician, 40th Canadian Minister of National Defence\n*  1968   – Zacarias Moussaoui, French citizen, sentenced to life in prison related to September 11 attacks\n*1969 – Naomi Kawase, Japanese director, producer, and screenwriter\n*  1969   – Ryuhei Kitamura, Japanese director, producer, and screenwriter \n*1971 – Paul Grayson, English rugby player and coach\n*  1971   – Duncan Jones, English director, producer, and screenwriter\n*  1971   – Idina Menzel, American singer-songwriter and actress\n*  1971   – Jiří Šlégr, Czech ice hockey player and politician\n*  1971   – Adrian Vowles, Australian rugby league player and sportscaster\n*1972 – Manny Ramirez, Dominican-American baseball player and coach\n*1974 – Big L, American rapper (d. 1999)\n*  1974   – Kostas Chalkias, Greek footballer\n*  1974   – CeeLo Green, American singer-songwriter, pianist, producer, and actor \n*  1974   – David Wilkie, American ice hockey player and coach\n*1975 – Evan Eschmeyer, American basketball player\n*  1975   – Brian Fair, American singer-songwriter \n*  1975   – Andy Farrell, English rugby player and coach\n*  1975   – Marissa Mayer, American computer scientist and businesswoman\n*1976 – Radoslav Nesterović, Slovenian-Greek basketball player\n*  1976   – Magnus Norman, Swedish tennis player and coach\n*  1976   – Margaret Okayo, Kenyan runner\n*1977 – Rachael Stirling, English actress\n*  1977   – Federico Vilar, Argentinian-Italian footballer \n*1979 – Mike Bishai, Canadian ice hockey player\n*  1979   – Clint Bowyer, American race car driver\n*  1979   – Francis Lessard, Canadian ice hockey player\n*1980 – Steven Gerrard, English footballer\n*  1980   – Ilona Korstin, Russian basketball player\n*  1980   – Ryōgo Narita, Japanese author\n*1981 – Devendra Banhart, American singer-songwriter and guitarist \n*  1981   – Gianmaria Bruni, Italian race car driver\n*  1981   – Ahmad Elrich, Australian footballer\n*  1981   – Remy Ma, American rapper \n*  1981   – Lars Møller Madsen, Danish handball player\n*  1981   – Hisanori Takada, Japanese footballer\n*1982 – Eddie Griffin, American basketball player (d. 2007)\n*  1982   – James Simpson-Daniel, English rugby player\n*1984 – Sham Kwok Fai, Hong Kong footballer\n*  1984   – Matt Maguire, Australian footballer\n*  1984   – Jordan Palmer, American football player\n*  1984   – Alexander Sulzer, German ice hockey player\n*1985 – Igor Kurnosov, Russian chess player (d. 2013)\n*  1985   – Igor Lewczuk, Polish footballer\n*  1985   – Aaron Volpatti, Canadian ice hockey player\n*1986 – Nikolay Bodurov, Bulgarian footballer\n*1988 – Antonio Winterstein, New Zealand-Samoan rugby league player\n*1989 – Lesia Tsurenko, Ukrainian tennis player\n*1989 – Ailee, Korean-American singer and songwriter \n*1990 – Mustafa Akbaş, Turkish footballer\n*  1990   – Im Yoona, South Korean singer and actress\n*  1990   – Andrei Loktionov, Russian ice hockey player\n*1991 – Jonathan Fox, English swimmer\n*1994 – Ivars Punnenovs, Latvian ice hockey player\n*  1994   – Scott Laughton, Canadian ice hockey player\n*1996 – Beatriz Haddad Maia, Brazilian tennis player\n\nDeaths\n\n* 531 – Xiao Tong, prince of the Liang Dynasty (b. 501)\n* 727 – Hubertus, bishop Liège\n* 947 – Ma Xifan, king of Chu (b. 899)\n*1035 – Baldwin IV, count of Flanders (b. 980)\n*1159 – Władysław II the Exile, High Duke of Poland and Duke of Silesia (b. 1105)\n*1252 – Ferdinand III, king of Castile and León (b. 1199)\n*1347 – John Darcy, 1st Baron Darcy de Knayth, English peer (b. 1290)\n*1376 – Joan of Ponthieu, Dame of Epernon, French noblewoman \n*1416 – Jerome of Prague, Czech martyr and theologian (b. 1379)\n*1431 – Joan of Arc, French martyr and saint (b. 1412)\n*1434 – Prokop the Great, Czech general (b. 1380)\n*1469 – Lope de Barrientos, Castilian bishop (b. 1389)\n*1472 – Jacquetta of Luxembourg, daughter of Pierre de Luxembourg (b. 1416)\n*1574 – Charles IX of France (b. 1550)\n*1593 – Christopher Marlowe, English poet and playwright (b. 1564)\n*1606 – Guru Arjan Dev, fifth of the Sikh gurus (executed) (b. 1563)\n*1640 – Peter Paul Rubens, German-Belgian painter (b. 1577)\n*1696 – Henry Capell, 1st Baron Capell of Tewkesbury, English politician, Lord Lieutenant of Ireland (b. 1638)\n*1670 – John Davenport, English minister, co-founded the New Haven Colony (b. 1597)\n*1712 – Andrea Lanzani, Italian painter (b. 1645)\n*1718 – Arnold van Keppel, 1st Earl of Albemarle, Dutch-English general (b. 1670)\n*1744 – Alexander Pope, English poet, essayist, and translator (b. 1688)\n*1770 – François Boucher, French painter and set designer (b. 1703)\n*1778 – Voltaire, French philosopher and author (b. 1694)\n*  1778   – José de la Borda, French/Spanish mining magnate in colonial Mexico (b. ca. 1700)\n*1829 – Philibert Jean-Baptiste Curial, French general (b. 1774)\n*1832 – James Mackintosh, Scottish historian, jurist, and politician (b. 1765)\n*1855 – Mary Reibey, Australian businesswoman, (b. 1777)\n*1892 – Mary Hannah Gray Clarke, American author, correspondent, and poet (b. 1835)\n*1865 – John Catron, American lawyer and judge (b. 1786)\n*1901 – Victor D'Hondt, Belgian mathematician, lawyer, and jurist (b. 1841)\n*1911 – Milton Bradley, American businessman, founded the Milton Bradley Company (b. 1836)\n*1912 – Wilbur Wright, American pilot and businessman, co-founded the Wright Company (b. 1867)\n*1918 – Georgi Plekhanov, Russian philosopher and theorist (b. 1856)\n*1925 – Arthur Moeller van den Bruck, German historian and author (b. 1876)\n*1926 – Vladimir Steklov, Russian mathematician and physicist (b. 1864)\n*1934 – Tōgō Heihachirō, Japanese admiral (b. 1848)\n*1939 – Floyd Roberts, American race car driver (b. 1904)\n*1941 – Prajadhipok, Thai king (b. 1893)\n*1946 – Louis Slotin, Canadian physicist and chemist (b. 1910)\n*1947 – Georg von Trapp, Austrian captain (b. 1880)\n*1948 – József Klekl, Slovene-Hungarian priest and politician (b. 1874)\n*1949 – Emmanuel Célestin Suhard, French cardinal (b. 1874)\n*1951 – Hermann Broch, Austrian-American author (b. 1886)\n*1953 – Dooley Wilson, American actor and singer (b. 1886)\n*1955 – Bill Vukovich, American race car driver (b. 1918)\n*1957 – Piero Carini, Italian race car driver (b. 1921)\n*1960 – Boris Pasternak, Russian poet, novelist, and literary translator, Nobel Prize laureate (b. 1890)\n*1961 – Rafael Trujillo, Dominican soldier and politician, 36th President of the Dominican Republic (b. 1891)\n*1964 – Isaac Babalola Akinyele, Nigerian king (b. 1882)\n*  1964   – Eddie Sachs, American race car driver (b. 1927)\n*  1964   – Leó Szilárd, Hungarian-American physicist and engineer (b. 1898)\n*1965 – Louis Hjelmslev, Danish linguist and academic (b. 1899)\n*1967 – Claude Rains, English-American actor (b. 1889)\n*  1967   – Georg Wilhelm Pabst, Austrian director, producer, and screenwriter (b. 1885)\n*1971 – Marcel Dupré, French organist and composer (b. 1886)\n*1975 – Steve Prefontaine, American runner (b. 1951)\n*  1975   – Tatsuo Shimabuku, Japanese martial artist, founded Isshin-ryū (b. 1908)\n*  1975   – Michel Simon, Swiss-born French actor (b. 1895)  \n*1976 – Max Carey, American baseball player, coach, and manager (b. 1890)\n*  1976   – Mitsuo Fuchida, Japanese captain (b. 1902)\n*1978 – Jean Deslauriers, Canadian violinist, composer, and conductor (b. 1909)\n*1980 – Carl Radle, American bass player and producer (b. 1942)\n*1981 – Don Ashby, Canadian ice hockey player (b. 1955)\n*  1981   – Ziaur Rahman, Bangladeshi general and politician, 7th President of Bangladesh (b. 1936)\n*1982 – Albert Norden, German journalist and politician (b. 1904)\n*1986 – Perry Ellis, American fashion designer, founded his own eponymous fashion brand (b. 1940)\n*1993 – Sun Ra, American pianist, composer, and bandleader (b. 1914)\n*1994 – Ezra Taft Benson, American religious leader, 13th President of The Church of Jesus Christ of Latter-day Saints (b. 1899)\n*  1994   – Marcel Bich, Italian-French businessman, co-founded Société Bic (b. 1914)\n*  1994   – Agostino Di Bartolomei, Italian footballer (b. 1955)\n*1995 – Ted Drake, English footballer and manager (b. 1912)\n*  1995   – Lofty England, English-Austrian engineer (b. 1911)\n*  1995   – Bobby Stokes, English footballer (b. 1951)\n*1996 – Léon-Étienne Duval, French cardinal (b. 1903)\n*  1996   – Alo Mattiisen, Estonian composer (b. 1961) \n*1999 – Kalju Lepik, Estonian poet and author (b. 1920)\n*2000 – Tex Beneke, American saxophonist and bandleader (b. 1914)\n*2001 – Denis Whitaker, Canadian general and historian (b. 1915)\n*2005 – Gérald Leblanc, Acadian poet (b. 1945)\n*  2005   – Tomasz Pacyński, Polish journalist and author (b. 1958)\n*  2005   – Alma Ziegler, American baseball player and stenographer (b. 1918)\n*2006 – Shohei Imamura, Japanese director, producer, and screenwriter (b. 1926)\n*  2006   – David Lloyd, New Zealand biologist and academic (b. 1938)\n*  2006   – Robert Sterling, American actor (b. 1917)\n*2007 – Jean-Claude Brialy, Algerian-French actor and director (b. 1933)\n*  2007   – Birgit Dalland, Norwegian politician (b. 1907)\n*  2007   – Gunturu Seshendra Sarma, Indian poet and critic (b. 1927)\n*2009 – Torsten Andersson, Swedish painter and illustrator (b. 1926)\n*  2009   – Susanna Haapoja, Finnish politician (b. 1966)\n*  2009   – Ephraim Katzir, Israeli biophysicist and politician, 4th President of Israel (b. 1916)\n*2010 – Yuri Chesnokov, Russian volleyball player and coach (b. 1933)\n*  2010   – Dufferin Roblin, Canadian commander and politician, 14th Premier of Manitoba (b. 1917)\n*2011 – Isikia Savua, Fijian police officer and diplomat (b. 1952)\n*  2011   – Saleem Shahzad, Pakistani journalist (b. 1970)\n*  2011   – Marek Siemek, Polish philosopher and historian (b. 1942)\n*  2011   – Clarice Taylor, American actress (b. 1917)\n*  2011   – Rosalyn Sussman Yalow, American physicist and academic, Nobel Prize laureate (b. 1921)  \n*2012 – John Fox, American comedian, actor, and screenwriter (b. 1957)\n*  2012   – Andrew Huxley, English physiologist and biophysicist, Nobel Prize laureate (b. 1917)\n*  2012   – Gerhard Pohl, German economist and politician (b. 1937)\n*  2012   – Jack Twyman, American basketball player and sportscaster (b. 1934) \n*2013 – Jayalath Jayawardena, Sri Lankan physician and politician (b. 1953)\n*  2013   – Larry Jones, American football player and coach (b. 1933)\n*2014 – Hienadz Buraukin, Belarusian poet, journalist, and diplomat (b. 1936)\n*  2014   – Henning Carlsen, Danish director, producer, and screenwriter (b. 1927)\n*  2014   – Joan Lorring, British actress (b. 1926)\n*  2014   – Leonidas Vasilikopoulos, Greek admiral (b. 1932)\n*2015 – Beau Biden, American soldier, lawyer, and politician, 44th Attorney General of Delaware (b. 1969)\n*  2015   – Joël Champetier, Canadian author and screenwriter (b. 1957)\n*2016 – Tom Lysiak, Polish-Canadian ice hockey player (b. 1953)\n*  2016   – Rick MacLeish, Canadian ice hockey player (b. 1950)\n\nHolidays and observances\n\n*Anguilla Day, commemorates the beginning of the Anguillian Revolution in 1967. (Anguilla)\n*Canary Islands Day (Spain)\n*Christian feast day:\n**Earliest day on which Feast of the Immaculate Heart of Mary can fall, while July 3 is the latest; celebrated 20 days after Pentecost. (Catholic Church)\n**Ferdinand III of Castile\n**Isaac of Dalmatia\n**Joan of Arc \n**Joseph Marello\n**May 30 (Eastern Orthodox liturgics)\n*Indian Arrival Day (Trinidad and Tobago)\n*Lod Massacre Remembrance Day (Puerto Rico)\n*Mother's Day (Nicaragua)\n*Parliament Day (Croatia)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "May 30" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19654" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*  AD 70 – Siege of Jerusalem: Titus and his Roman legions breach the Second Wall of Jerusalem. Jewish defenders retreat to the First Wall. The Romans build a circumvallation, cutting down all trees within fifteen kilometres.\n*1381 – Beginning of the Peasants' Revolt in England.\n*1416 – The Council of Constance, called by Emperor Sigismund, a supporter of Antipope John XXIII, burns Jerome of Prague following a trial for heresy.\n*1431 – Hundred Years' War: In Rouen, France, the 19-year-old Joan of Arc is burned at the stake by an English-dominated tribunal. The Roman Catholic Church remembers this day as the celebration of Saint Joan of Arc.\n*1434 – Hussite Wars: Battle of Lipany: Effectively ending the war, Utraquist forces led by Diviš Bořek of Miletínek defeat and almost annihilate Taborite forces led by Prokop the Great.\n*1510 – During the reign of the Zhengde Emperor, Ming dynasty rebel leader Zhu Zhifan is defeated by commander Qiu Yue, ending the Prince of Anhua rebellion.\n*1536 – King Henry VIII of England marries Jane Seymour, a lady-in-waiting to his first two wives.\n*1539 – In Florida, Hernando de Soto lands at Tampa Bay with 600 soldiers with the goal of finding gold.\n*1574 – Henry III becomes King of France.\n*1588 – The last ship of the Spanish Armada sets sail from Lisbon heading for the English Channel.\n*1631 – Publication of Gazette de France, the first French newspaper.\n*1635 – Thirty Years' War: The Peace of Prague is signed.\n*1642 – From this date all honors granted by Charles I are retroactively annulled by Parliament.\n*1806 – Future U.S. President Andrew Jackson kills Charles Dickinson in a duel.\n*1814 – Napoleonic Wars: War of the Sixth Coalition: The Treaty of Paris (1814) is signed returning French borders to their 1792 extent. Napoleon is exiled to Elba.\n*1815 – The East Indiaman Arniston is wrecked during a storm at Waenhuiskrans, near Cape Agulhas, in present-day South Africa, with the loss of 372 lives.\n*1834 – Minister of Justice Joaquim António de Aguiar issues a law seizing \"all convents, monasteries, colleges, hospices and any other houses\" from the Catholic religious orders in Portugal, earning him the nickname of \"The Friar-Killer\".\n*1842 – John Francis attempts to murder Queen Victoria as she drives down Constitution Hill in London with Prince Albert.\n*1845 – The Fatel Razack coming from India, lands in the Gulf of Paria in Trinidad and Tobago carrying the first Indians to the country.\n*1854 – The Kansas–Nebraska Act becomes law establishing the US territories of Kansas and Nebraska.\n*1868 – Decoration Day (the predecessor of the modern \"Memorial Day\") is observed in the United States for the first time (by \"Commander-in-chief of the Grand Army of the Republic\" John A. Logan's proclamation on May 5).\n*1876 – Ottoman sultan Abdülaziz is deposed and succeeded by his nephew Murad V.\n*1883 – In New York City, a stampede on the recently opened Brooklyn Bridge killed twelve people.\n*1899 – Pearl Hart, a female outlaw of the Old West, robs a stage coach 30 miles southeast of Globe, Arizona.\n*1911 – At the Indianapolis Motor Speedway, the first Indianapolis 500 ends with Ray Harroun in his Marmon Wasp becoming the first winner of the 500-mile auto race.\n*1913 – The Treaty of London is signed, ending the First Balkan War; Albania becomes an independent nation.\n*1914 – The new, and then the largest, Cunard ocean liner , 45,647 tons, sets sails on her maiden voyage from Liverpool, England, to New York City.\n*1917 – Alexander I becomes king of Greece.\n*1922 – The Lincoln Memorial is dedicated in Washington, D.C..\n*1925 – May Thirtieth Movement: Shanghai Municipal Police Force shoot and kill 13 protesting workers.\n*1937 – Memorial Day massacre: Chicago police shoot and kill ten labor demonstrators.\n*1941 – World War II: Manolis Glezos and Apostolos Santas climb the Athenian Acropolis and tear down the German flag.\n*1942 – World War II: One thousand British bombers launch a 90-minute attack on Cologne, Germany.\n*1943 – The Holocaust: Josef Mengele becomes chief medical officer of the Zigeunerfamilienlager (Romani family camp) at Auschwitz concentration camp.\n*1948 – A dike along the flooding Columbia River breaks, obliterating Vanport, Oregon within minutes. Fifteen people die and tens of thousands are left homeless.\n*1958 – Memorial Day: The remains of two unidentified American servicemen, killed in action during World War II and the Korean War respectively, are buried at the Tomb of the Unknown Soldier in Arlington National Cemetery.\n*1959 – The Auckland Harbour Bridge, crossing the Waitematā Harbour in Auckland, New Zealand, is officially opened by Governor-General Charles Lyttelton, 10th Viscount Cobham.\n*1961 – The long-time Dominican dictator Rafael Trujillo is assassinated in Santo Domingo, Dominican Republic.\n*1963 – A protest against pro-Catholic discrimination during the Buddhist crisis is held outside South Vietnam's National Assembly, the first open demonstration during the eight-year rule of Ngo Dinh Diem.\n*1966 – Former Congolese Prime Minister, Évariste Kimba, and several other politicians are publicly executed in Kinshasa on the orders of President Joseph Mobutu.\n*1967 – The Nigerian Eastern Region declares independence as the Republic of Biafra, sparking a civil war.\n*1968 – Charles de Gaulle reappears publicly after his flight to Baden-Baden, Germany, and dissolves the French National Assembly by a radio appeal. Immediately after, less than one million of his supporters march on the Champs-Élysées in Paris. This is the turning point of May 1968 events in France.\n*1971 – Mariner program: Mariner 9 is launched to map 70% of the surface, and to study temporal changes in the atmosphere and surface, of Mars.\n*1972 – The Angry Brigade goes on trial over a series of 25 bombings throughout the United Kingdom.\n*  1972   – In Ben Gurion Airport (at the time: Lod Airport), Israel, members of the Japanese Red Army carry out the Lod Airport massacre, killing 24 people and injuring 78 others.\n*1974 – The Airbus A300 passenger aircraft first enters service.\n*1975 – European Space Agency is established.\n*1982 – Cold War: Spain joins NATO.\n*1989 – Tiananmen Square protests of 1989: The 33-foot high \"Goddess of Democracy\" statue is unveiled in Tiananmen Square by student demonstrators.\n*1998 – The 6.5  Afghanistan earthquake shook the Takhar Province of northern Afghanistan with a maximum Mercalli intensity of VII (Very strong), killing around 4,000–4,500.\n*  1998   – Nuclear Testing: Pakistan conducts an underground test in the Kharan Desert. It is reported to be a plutonium device with yield of 20kt TNT equivalent.\n*2003 – Depayin massacre: At least 70 people associated with the National League for Democracy are killed by government-sponsored mob in Burma. Aung San Suu Kyi fled the scene, but is arrested soon afterwards.\n*2008 – Convention on Cluster Munitions is adopted.\n*2012 – Former Liberian president Charles Taylor is sentenced to 50 years in prison for his role in atrocities committed during the Sierra Leone Civil War.\n*2013 – Nigeria passes a law banning same-sex marriage.\n\nBirths\n\n*1010 – Emperor Renzong of Song (d. 1063)\n*1201 – Theobald IV, Count of Champagne (d. 1253)\n*1423 – Georg von Peuerbach, German mathematician and astronomer (d. 1461)\n*1464 – Barbara of Brandenburg, Bohemian queen (d. 1515)\n*1580 – Fadrique de Toledo, 1st Marquis of Villanueva de Valdueza (d. 1634)\n*1599 – Samuel Bochart, French Protestant biblical scholar (d. 1667)\n*1623 – John Egerton, 2nd Earl of Bridgewater, English politician, Lord Lieutenant of Buckinghamshire (d. 1686)\n*1686 – Antonina Houbraken, Dutch illustrator (d. 1736)\n*1718 – Wills Hill, 1st Marquess of Downshire, English politician, Secretary of State for the Colonies (d. 1793)\n*1719 – Roger Newdigate, English politician (d. 1806)\n*1757 – Henry Addington, 1st Viscount Sidmouth, English politician, Prime Minister of the United Kingdom (d. 1844)\n*1768 – Étienne Marie Antoine Champion de Nansouty, French general (d. 1815)\n*  1768   – Georg Amadeus Carl Friedrich Naumann, German mineralogist and geologist (d. 1873)\n*1800 – Henri-Marie-Gaston Boisnormand de Bonnechose, French cardinal (d. 1883)\n*1814 – Mikhail Bakunin, Russian philosopher and theorist  (d. 1876)\n*  1814   – Eugène Charles Catalan, Belgian-French mathematician and academic (d. 1894)\n*1819 – William McMurdo, English general (d. 1894)\n*1820 – Pierre-Joseph-Olivier Chauveau, Canadian lawyer and politician, 1st Premier of Quebec (d. 1890)\n*1835 – Alfred Austin, English author, poet, and playwright (d. 1913)\n*1844 – Félix Arnaudin, French poet and photographer (d. 1921)\n*1845 – Amadeo I of Spain (d. 1890)\n*1846 – Peter Carl Fabergé, Russian goldsmith and jeweler (d. 1920)\n*1862 – Mirza Alakbar Sabir, Azerbaijani philosopher and poet (d. 1911)\n*1869 – Grace Andrews, American mathematician (d. 1951)\n*1874 – Ernest Duchesne, French physician (d. 1912)\n*1875 – Giovanni Gentile, Italian philosopher and academic (d. 1944)\n*1879 – Colin Blythe, English cricketer and soldier (d. 1917)\n*  1879   – Konstantin Ramul, Estonian psychologist and academic (d. 1975)\n*1881 – Georg von Küchler, German field marshal (d. 1968)\n*1882 – Wyndham Halswelle, English runner and soldier (d. 1915)\n*1883 – Sandy Pearce, Australian rugby league player (d. 1930)\n*1884 – Siegmund Glücksmann, German soldier and politician (d. 1942)\n*1885 – Villem Grünthal-Ridala, Estonian poet and linguist (d. 1942)\n*1886 – Laurent Barré, Canadian lawyer and politician (d. 1964)\n*  1886   – Randolph Bourne, American theorist and author (d. 1918)\n*1887 – Alexander Archipenko, Ukrainian-American sculptor and illustrator (d. 1964)\n*  1887   – Emil Reesen, Danish pianist, composer, and conductor (d. 1964)\n*1890 – Roger Salengro, French soldier and politician, French Minister of the Interior (d. 1936)\n*1892 – Fernando Amorsolo, Filipino painter (d. 1972)\n*1894 – Hubertus van Mook, Dutch politician, Governor-General of the Dutch East Indies (d. 1965)\n*1895 – Maurice Tate, English cricketer (d. 1956)\n*1896 – Howard Hawks, American director, producer, and screenwriter (d. 1977)\n*1897 – Frank Wise, Australian politician, 16th Premier of Western Australia (d. 1986)\n*1898 – John Gilroy, English artist and illustrator (d. 1985)\n*1899 – Irving Thalberg, American screenwriter and producer (d. 1936)\n*1901 – Alfred Karindi, Estonian pianist and composer (d. 1969)\n*  1901   – Cornelia Otis Skinner, American actress and author (d. 1979)\n*1902 – Stepin Fetchit, American actor and dancer (d. 1985)\n*1903 – Countee Cullen, American poet and author (d. 1946)\n*1906 – Bruno Gröning, Polish-German mystic and author (d. 1959)\n*1907 – Germaine Tillion, French anthropologist and academic (d. 2008)\n*1908 – Hannes Alfvén, Swedish physicist and engineer, Nobel Prize laureate (d. 1995)\n*  1908   – Mel Blanc, American voice actor (d. 1989)\n*1909 – Jacques Canetti, French music executive and talent agent (d. 1997)\n*  1909   – Freddie Frith, English motorcycle road racer (d. 1988)\n*  1909   – Benny Goodman, American clarinet player, songwriter, and bandleader (d. 1986)\n*1910 – Harry Bernstein, English-American journalist and author (d. 2011)\n*1912 – Julius Axelrod, American biochemist and academic, Nobel Prize laureate (d. 2004)\n*  1912   – Erich Bagge, German physicist and academic (d. 1996)\n*  1912   – Hugh Griffith, Welsh actor (d. 1980)\n*  1912   – Millicent Selsam, American author and academic (d. 1996)\n*  1912   – Joseph Stein, American playwright and author (d. 2010)\n*1914 – Akinoumi Setsuo, Japanese sumo wrestler, the 37th Yokozuna (d. 1979)\n*1916 – Justin Catayée, French soldier and politician (d. 1962)\n*  1916   – Mort Meskin, American illustrator (d. 1995)\n*1918 – Pita Amor, Mexican poet and author (d. 2000)\n*  1918   – Bob Evans, American businessman, founded Bob Evans Restaurants (d. 2007)\n*1919 – René Barrientos, Bolivian general and politician, 55th President of Bolivia (d. 1969)\n*1920 – Franklin J. Schaffner, Japanese-American director and producer (d. 1989)\n*1922 – Hal Clement, American author and educator (d. 2003)\n*1924 – Anthony Dryden Marshall, American CIA officer and diplomat (d. 2014)\n*1925 – John Henry Marks, English physician and author\n*1926 – Johnny Gimble, American country/western swing musician (Bob Wills and His Texas Playboys) (d. 2015)\n*1927 – Joan Birman, American mathematician\n*  1927   – Clint Walker, American actor and singer\n*  1927   – Billy Wilson, Australian rugby league player and coach (d. 1993)\n*1928 – Pro Hart, Australian painter (d. 2006)\n*  1928   – Agnès Varda, Belgian-French director, producer, and screenwriter\n*1929 – Georges Gilson, French archbishop\n*1930 – Mark Birley, English businessman, founded Annabel's (d. 2007)\n*  1930   – Robert Ryman, American painter\n*1931 – Larry Silverstein, American real estate magnate \n*1932 – Ray Cooney, English actor and playwright\n*  1932   – Pauline Oliveros, American accordion player and composer (d. 2016)\n*  1932   – Ivor Richard, Baron Richard, Welsh politician and diplomat, British Ambassador to the United Nations\n*1934 – Alexey Leonov, Russian general, pilot, and astronaut\n*  1934   – Alketas Panagoulias, Greek footballer and manager (d. 2012)\n*1935 – Ruta Lee, Canadian-American actress and dancer\n*  1935   – Guy Tardif, Canadian academic and politician (d. 2005)\n*1936 – Keir Dullea, American actor\n*1937 – Christopher Haskins, Anglo-Irish businessman, life peer, and British politician\n*  1937   – Rick Mather, American-English architect (d. 2013)\n*1938 – Billie Letts, American author and educator (d. 2014)\n*1939 – Michael J. Pollard, American actor\n*  1939   – Dieter Quester, Austrian race car driver\n*  1939   – Tim Waterstone, Scottish businessman, founded Waterstones\n*1940 – Jagmohan Dalmiya, Indian cricket administrator (d. 2015)\n*  1940   – Gilles Villemure, Canadian-American ice hockey player\n*1942 – John Gladwin, English bishop\n*  1942   – Carole Stone, English journalist and author\n*1943 – Anders Michanek Swedish motorcycle racer\n*  1943   – Gale Sayers, American football player and philanthropist\n*1944 – Lenny Davidson, English guitarist and songwriter (The Dave Clark Five)\n*  1944   – Meredith MacRae, American actress (d. 2000)\n*  1944   – Stav Prodromou, Greek-American engineer and businessman\n*1945 – Gladys Horton, American singer (d. 2011)\n*1946 – Allan Chapman, English historian and author\n*1947 – Jocelyne Bourassa, Canadian golfer\n*1948 – Johan De Muynck, Belgian former professional road racing cyclist\n*  1948   – Michael Piller, American screenwriter and producer (d. 2005)\n*  1948   – David Thorpe, Australian rules footballer\n*1949 – P.J. Carlesimo, American basketball player and coach\n*  1949   – Paul Coleridge, English lawyer and judge\n*  1949   – Bob Willis, English cricketer and sportscaster\n*1950 – Bertrand Delanoë, French politician, 14th Mayor of Paris\n*  1950   – Paresh Rawal, Indian actor, producer, and politician\n*  1950   – Joshua Rozenberg, English lawyer, journalist, and author\n*1951 – Zdravko Čolić, Bosnian Serb singer-songwriter \n*  1951   – Fernando Lugo, Paraguayan bishop and politician, President of Paraguay\n*  1951   – Stephen Tobolowsky, American actor, singer, and director\n*1952 – Daniel Grodnik, American screenwriter and producer\n*  1952   – Kerry Fraser, Canadian ice hockey player, referee, and sportscaster\n*1953 – Jim Hunter, Canadian skier\n*  1953   – Colm Meaney, Irish actor\n*1955 – Topper Headon, English drummer and songwriter (The Clash)\n*  1955   – Jacqueline McGlade, English-Canadian biologist, ecologist, and academic \n*  1955   – Caroline Swift, English lawyer and judge\n*  1955   – Colm Tóibín, Irish novelist, poet, playwright, and critic\n*1956 – Tim Lucas, American author, screenwriter, and critic\n*1957 – Michael Clayton, Australian golfer\n*1958 – Eugene Belliveau, Canadian football player\n*  1958   – Marie Fredriksson, Swedish singer-songwriter and pianist \n*  1958   – Steve Israel, American lawyer and politician\n*  1958   – Michael López-Alegría, Spanish-American captain, pilot, and astronaut\n*  1958   – Ted McGinley, American actor\n*1959 – Phil Brown, English footballer, coach, and manager\n*  1959   – Randy Ferbey, Canadian curler\n*  1959   – Frank Vanhecke, Belgian politician\n*1961 – Harry Enfield, English actor, director, and screenwriter\n*  1961   – Bob Yari, Iranian-American director and producer\n*1962 – Kevin Eastman, American author and illustrator, co-created the Teenage Mutant Ninja Turtles \n*  1962   – Richard Fuller, English lawyer and politician\n*  1962   – Tim Loughton, English businessman and politician\n*  1962   – Tonya Pinkins, American actress and singer\n*1963 – Michel Langevin, Canadian drummer and songwriter \n*  1963   – Élise Lucet, French journalist\n*  1963   – Helen Sharman, English chemist and astronaut \n*1964 – Wynonna Judd, American singer-songwriter, guitarist, and actress \n*  1964   – Andrea Montermini, Italian race car driver\n*  1964   – Tom Morello, American singer-songwriter, guitarist, and actor \n*1965 – Troy Coker, Australian rugby player\n*  1965   – Billy Donovan, American basketball player and coach\n*  1965   – Iginio Straffi, Italian animator and producer, founded Rainbow S.r.l. \n*1966 – Thomas Häßler, German footballer and manager\n*  1966   – Stephen Malkmus, American singer-songwriter and guitarist \n*1967 – Tim Burgess, English singer-songwriter \n*  1967   – Rechelle Hawkes, Australian hockey player\n*  1967   – Sven Pipien, German-American bass player \n*1968 – Jason Kenney, Canadian lawyer and politician, 40th Canadian Minister of National Defence\n*  1968   – Zacarias Moussaoui, French citizen, sentenced to life in prison related to September 11 attacks\n*1969 – Naomi Kawase, Japanese director, producer, and screenwriter\n*  1969   – Ryuhei Kitamura, Japanese director, producer, and screenwriter \n*1971 – Paul Grayson, English rugby player and coach\n*  1971   – Duncan Jones, English director, producer, and screenwriter\n*  1971   – Idina Menzel, American singer-songwriter and actress\n*  1971   – Jiří Šlégr, Czech ice hockey player and politician\n*  1971   – Adrian Vowles, Australian rugby league player and sportscaster\n*1972 – Manny Ramirez, Dominican-American baseball player and coach\n*1974 – Big L, American rapper (d. 1999)\n*  1974   – Kostas Chalkias, Greek footballer\n*  1974   – CeeLo Green, American singer-songwriter, pianist, producer, and actor \n*  1974   – David Wilkie, American ice hockey player and coach\n*1975 – Evan Eschmeyer, American basketball player\n*  1975   – Brian Fair, American singer-songwriter \n*  1975   – Andy Farrell, English rugby player and coach\n*  1975   – Marissa Mayer, American computer scientist and businesswoman\n*1976 – Radoslav Nesterović, Slovenian-Greek basketball player\n*  1976   – Magnus Norman, Swedish tennis player and coach\n*  1976   – Margaret Okayo, Kenyan runner\n*1977 – Rachael Stirling, English actress\n*  1977   – Federico Vilar, Argentinian-Italian footballer \n*1979 – Mike Bishai, Canadian ice hockey player\n*  1979   – Clint Bowyer, American race car driver\n*  1979   – Francis Lessard, Canadian ice hockey player\n*1980 – Steven Gerrard, English footballer\n*  1980   – Ilona Korstin, Russian basketball player\n*  1980   – Ryōgo Narita, Japanese author\n*1981 – Devendra Banhart, American singer-songwriter and guitarist \n*  1981   – Gianmaria Bruni, Italian race car driver\n*  1981   – Ahmad Elrich, Australian footballer\n*  1981   – Remy Ma, American rapper \n*  1981   – Lars Møller Madsen, Danish handball player\n*  1981   – Hisanori Takada, Japanese footballer\n*1982 – Eddie Griffin, American basketball player (d. 2007)\n*  1982   – James Simpson-Daniel, English rugby player\n*1984 – Sham Kwok Fai, Hong Kong footballer\n*  1984   – Matt Maguire, Australian footballer\n*  1984   – Jordan Palmer, American football player\n*  1984   – Alexander Sulzer, German ice hockey player\n*1985 – Igor Kurnosov, Russian chess player (d. 2013)\n*  1985   – Igor Lewczuk, Polish footballer\n*  1985   – Aaron Volpatti, Canadian ice hockey player\n*1986 – Nikolay Bodurov, Bulgarian footballer\n*1988 – Antonio Winterstein, New Zealand-Samoan rugby league player\n*1989 – Lesia Tsurenko, Ukrainian tennis player\n*1989 – Ailee, Korean-American singer and songwriter \n*1990 – Mustafa Akbaş, Turkish footballer\n*  1990   – Im Yoona, South Korean singer and actress\n*  1990   – Andrei Loktionov, Russian ice hockey player\n*1991 – Jonathan Fox, English swimmer\n*1994 – Ivars Punnenovs, Latvian ice hockey player\n*  1994   – Scott Laughton, Canadian ice hockey player\n*1996 – Beatriz Haddad Maia, Brazilian tennis player\n\nDeaths\n\n* 531 – Xiao Tong, prince of the Liang Dynasty (b. 501)\n* 727 – Hubertus, bishop Liège\n* 947 – Ma Xifan, king of Chu (b. 899)\n*1035 – Baldwin IV, count of Flanders (b. 980)\n*1159 – Władysław II the Exile, High Duke of Poland and Duke of Silesia (b. 1105)\n*1252 – Ferdinand III, king of Castile and León (b. 1199)\n*1347 – John Darcy, 1st Baron Darcy de Knayth, English peer (b. 1290)\n*1376 – Joan of Ponthieu, Dame of Epernon, French noblewoman \n*1416 – Jerome of Prague, Czech martyr and theologian (b. 1379)\n*1431 – Joan of Arc, French martyr and saint (b. 1412)\n*1434 – Prokop the Great, Czech general (b. 1380)\n*1469 – Lope de Barrientos, Castilian bishop (b. 1389)\n*1472 – Jacquetta of Luxembourg, daughter of Pierre de Luxembourg (b. 1416)\n*1574 – Charles IX of France (b. 1550)\n*1593 – Christopher Marlowe, English poet and playwright (b. 1564)\n*1606 – Guru Arjan Dev, fifth of the Sikh gurus (executed) (b. 1563)\n*1640 – Peter Paul Rubens, German-Belgian painter (b. 1577)\n*1696 – Henry Capell, 1st Baron Capell of Tewkesbury, English politician, Lord Lieutenant of Ireland (b. 1638)\n*1670 – John Davenport, English minister, co-founded the New Haven Colony (b. 1597)\n*1712 – Andrea Lanzani, Italian painter (b. 1645)\n*1718 – Arnold van Keppel, 1st Earl of Albemarle, Dutch-English general (b. 1670)\n*1744 – Alexander Pope, English poet, essayist, and translator (b. 1688)\n*1770 – François Boucher, French painter and set designer (b. 1703)\n*1778 – Voltaire, French philosopher and author (b. 1694)\n*  1778   – José de la Borda, French/Spanish mining magnate in colonial Mexico (b. ca. 1700)\n*1829 – Philibert Jean-Baptiste Curial, French general (b. 1774)\n*1832 – James Mackintosh, Scottish historian, jurist, and politician (b. 1765)\n*1855 – Mary Reibey, Australian businesswoman, (b. 1777)\n*1892 – Mary Hannah Gray Clarke, American author, correspondent, and poet (b. 1835)\n*1865 – John Catron, American lawyer and judge (b. 1786)\n*1901 – Victor D'Hondt, Belgian mathematician, lawyer, and jurist (b. 1841)\n*1911 – Milton Bradley, American businessman, founded the Milton Bradley Company (b. 1836)\n*1912 – Wilbur Wright, American pilot and businessman, co-founded the Wright Company (b. 1867)\n*1918 – Georgi Plekhanov, Russian philosopher and theorist (b. 1856)\n*1925 – Arthur Moeller van den Bruck, German historian and author (b. 1876)\n*1926 – Vladimir Steklov, Russian mathematician and physicist (b. 1864)\n*1934 – Tōgō Heihachirō, Japanese admiral (b. 1848)\n*1939 – Floyd Roberts, American race car driver (b. 1904)\n*1941 – Prajadhipok, Thai king (b. 1893)\n*1946 – Louis Slotin, Canadian physicist and chemist (b. 1910)\n*1947 – Georg von Trapp, Austrian captain (b. 1880)\n*1948 – József Klekl, Slovene-Hungarian priest and politician (b. 1874)\n*1949 – Emmanuel Célestin Suhard, French cardinal (b. 1874)\n*1951 – Hermann Broch, Austrian-American author (b. 1886)\n*1953 – Dooley Wilson, American actor and singer (b. 1886)\n*1955 – Bill Vukovich, American race car driver (b. 1918)\n*1957 – Piero Carini, Italian race car driver (b. 1921)\n*1960 – Boris Pasternak, Russian poet, novelist, and literary translator, Nobel Prize laureate (b. 1890)\n*1961 – Rafael Trujillo, Dominican soldier and politician, 36th President of the Dominican Republic (b. 1891)\n*1964 – Isaac Babalola Akinyele, Nigerian king (b. 1882)\n*  1964   – Eddie Sachs, American race car driver (b. 1927)\n*  1964   – Leó Szilárd, Hungarian-American physicist and engineer (b. 1898)\n*1965 – Louis Hjelmslev, Danish linguist and academic (b. 1899)\n*1967 – Claude Rains, English-American actor (b. 1889)\n*  1967   – Georg Wilhelm Pabst, Austrian director, producer, and screenwriter (b. 1885)\n*1971 – Marcel Dupré, French organist and composer (b. 1886)\n*1975 – Steve Prefontaine, American runner (b. 1951)\n*  1975   – Tatsuo Shimabuku, Japanese martial artist, founded Isshin-ryū (b. 1908)\n*  1975   – Michel Simon, Swiss-born French actor (b. 1895)  \n*1976 – Max Carey, American baseball player, coach, and manager (b. 1890)\n*  1976   – Mitsuo Fuchida, Japanese captain (b. 1902)\n*1978 – Jean Deslauriers, Canadian violinist, composer, and conductor (b. 1909)\n*1980 – Carl Radle, American bass player and producer (b. 1942)\n*1981 – Don Ashby, Canadian ice hockey player (b. 1955)\n*  1981   – Ziaur Rahman, Bangladeshi general and politician, 7th President of Bangladesh (b. 1936)\n*1982 – Albert Norden, German journalist and politician (b. 1904)\n*1986 – Perry Ellis, American fashion designer, founded his own eponymous fashion brand (b. 1940)\n*1993 – Sun Ra, American pianist, composer, and bandleader (b. 1914)\n*1994 – Ezra Taft Benson, American religious leader, 13th President of The Church of Jesus Christ of Latter-day Saints (b. 1899)\n*  1994   – Marcel Bich, Italian-French businessman, co-founded Société Bic (b. 1914)\n*  1994   – Agostino Di Bartolomei, Italian footballer (b. 1955)\n*1995 – Ted Drake, English footballer and manager (b. 1912)\n*  1995   – Lofty England, English-Austrian engineer (b. 1911)\n*  1995   – Bobby Stokes, English footballer (b. 1951)\n*1996 – Léon-Étienne Duval, French cardinal (b. 1903)\n*  1996   – Alo Mattiisen, Estonian composer (b. 1961) \n*1999 – Kalju Lepik, Estonian poet and author (b. 1920)\n*2000 – Tex Beneke, American saxophonist and bandleader (b. 1914)\n*2001 – Denis Whitaker, Canadian general and historian (b. 1915)\n*2005 – Gérald Leblanc, Acadian poet (b. 1945)\n*  2005   – Tomasz Pacyński, Polish journalist and author (b. 1958)\n*  2005   – Alma Ziegler, American baseball player and stenographer (b. 1918)\n*2006 – Shohei Imamura, Japanese director, producer, and screenwriter (b. 1926)\n*  2006   – David Lloyd, New Zealand biologist and academic (b. 1938)\n*  2006   – Robert Sterling, American actor (b. 1917)\n*2007 – Jean-Claude Brialy, Algerian-French actor and director (b. 1933)\n*  2007   – Birgit Dalland, Norwegian politician (b. 1907)\n*  2007   – Gunturu Seshendra Sarma, Indian poet and critic (b. 1927)\n*2009 – Torsten Andersson, Swedish painter and illustrator (b. 1926)\n*  2009   – Susanna Haapoja, Finnish politician (b. 1966)\n*  2009   – Ephraim Katzir, Israeli biophysicist and politician, 4th President of Israel (b. 1916)\n*2010 – Yuri Chesnokov, Russian volleyball player and coach (b. 1933)\n*  2010   – Dufferin Roblin, Canadian commander and politician, 14th Premier of Manitoba (b. 1917)\n*2011 – Isikia Savua, Fijian police officer and diplomat (b. 1952)\n*  2011   – Saleem Shahzad, Pakistani journalist (b. 1970)\n*  2011   – Marek Siemek, Polish philosopher and historian (b. 1942)\n*  2011   – Clarice Taylor, American actress (b. 1917)\n*  2011   – Rosalyn Sussman Yalow, American physicist and academic, Nobel Prize laureate (b. 1921)  \n*2012 – John Fox, American comedian, actor, and screenwriter (b. 1957)\n*  2012   – Andrew Huxley, English physiologist and biophysicist, Nobel Prize laureate (b. 1917)\n*  2012   – Gerhard Pohl, German economist and politician (b. 1937)\n*  2012   – Jack Twyman, American basketball player and sportscaster (b. 1934) \n*2013 – Jayalath Jayawardena, Sri Lankan physician and politician (b. 1953)\n*  2013   – Larry Jones, American football player and coach (b. 1933)\n*2014 – Hienadz Buraukin, Belarusian poet, journalist, and diplomat (b. 1936)\n*  2014   – Henning Carlsen, Danish director, producer, and screenwriter (b. 1927)\n*  2014   – Joan Lorring, British actress (b. 1926)\n*  2014   – Leonidas Vasilikopoulos, Greek admiral (b. 1932)\n*2015 – Beau Biden, American soldier, lawyer, and politician, 44th Attorney General of Delaware (b. 1969)\n*  2015   – Joël Champetier, Canadian author and screenwriter (b. 1957)\n*2016 – Tom Lysiak, Polish-Canadian ice hockey player (b. 1953)\n*  2016   – Rick MacLeish, Canadian ice hockey player (b. 1950)\n\nHolidays and observances\n\n*Anguilla Day, commemorates the beginning of the Anguillian Revolution in 1967. (Anguilla)\n*Canary Islands Day (Spain)\n*Christian feast day:\n**Earliest day on which Feast of the Immaculate Heart of Mary can fall, while July 3 is the latest; celebrated 20 days after Pentecost. (Catholic Church)\n**Ferdinand III of Castile\n**Isaac of Dalmatia\n**Joan of Arc \n**Joseph Marello\n**May 30 (Eastern Orthodox liturgics)\n*Indian Arrival Day (Trinidad and Tobago)\n*Lod Massacre Remembrance Day (Puerto Rico)\n*Mother's Day (Nicaragua)\n*Parliament Day (Croatia). May 30. http://en.wikipedia.org/?curid=19654."
  }
}
