{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=12276",
  "eid" : "015d2ce0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778511534,
  "textBody" : "Gheorghe \"Gică\" Hagi (; born 5 February 1965) is a Romanian former professional footballer, considered one of the best attacking midfielders in Europe during the 1980s and '90s and the greatest Romanian footballer of all time.[http://www.romania-insider.com/famous-romanians-gheorghe-hagi/5870/# \"Famous Romanians: Gheorghe Hagi\"]. Romania Insider. 11 August 2010. Galatasaray fans called him \"Comandante\" (\"The Commander\") and Romanians call him \"Regele\" (\"The King\").He is currently the manager of FC Viitorul\n\nNicknamed \"The Maradona of the Carpathians\", Hagi is considered a hero in his homeland. He was named Romanian Footballer of the Year seven times, and is regarded as one of the best football players of his generation. As a creative advanced playmaker, he was renowned for his dribbling, technique, vision, passing and finishing.[https://www.fifa.com/fifa-tournaments/players-coaches/people2354/profile.html \"Romania and Gala’s commander and king\"]. FIFA.com. Retrieved 18 November 2013\n\nHagi played for the Romania national team in three FIFA World Cups, in 1990, 1994 (where he was named in the World Cup All-Star Team) and 1998; as well as in three UEFA European Championships, in 1984, 1996 and 2000. He won a total of 125 caps for Romania, ranked second after Dorinel Munteanu, and is the joint leading goalscorer (alongside Adrian Mutu) with 35 goals.\n\nIn November 2003, to celebrate UEFA's Jubilee, Hagi was selected as the Golden Player of Romania by the Romanian Football Federation as their most outstanding player of the past 50 years. In 2004, he was named by Pelé as one of the 125 Greatest Living Footballers at a FIFA Awards Ceremony. He was listed at number 25 in World Soccer Magazines list of the 100 greatest players of the 20th century. Hagi is one of the few footballers to have played for both Spanish rival clubs Real Madrid and Barcelona.\n\nIn 2009, Hagi founded Romanian club Viitorul Constanța. He is currently both owner and chairman of the club. Hagi also established the Gheorghe Hagi football academy, one of the biggest football academies in Southeastern Europe.\n\nClub career\n\nBorn in Săcele, Hagi started his career playing for the youth teams of Farul Constanța in the 1970s, before being selected by the Romanian Football Federation to join the squad of Luceafărul București in 1980 for two years. In 1982, he returned to Constanța, but one year later, aged 18, he was prepared to make the step to a top team. He was originally directed to Universitatea Craiova, but chose Sportul Studențesc of Bucharest instead.\n\nIn late 1987, Hagi transferred to Steaua București as the team prepared for their European Super Cup final against Dynamo Kyiv. The original contract was for one game only, the final. However, after winning the trophy, where Hagi scored the only goal of the match, Steaua did not want to release him back to Sportul Studențesc and retained him. During his Steaua years (1987–1990), Hagi played 97 Liga I games, scoring 76 goals. He and the team reached the European Cup semi-final in 1988 and the final in the following year, while Hagi finished as one of the competition's top scorers in the former edition of the tournament. Hagi and Steaua were the champions of Romania in 1987, 1988 and 1989 and as well as winning the Cupa României in 1987, 1988 and 1989. His strong performances had him linked with Arrigo Sacchi's Milan and Bayern Munich, but Nicolae Ceaușescu's communist government rejected any offer.\n\nAfter the 1990 FIFA World Cup, Hagi was signed by Real Madrid. The La Liga side paid $4.3 million to Steaua București for him. Hagi played two seasons with Madrid, then was sold to Brescia.\n\nHagi began the 1992–93 season with Brescia, but after his first season, the club was relegated to Serie B. The next season, Hagi helped the club win Serie B and earn promotion back to Serie A. After performing memorably during the 1994 World Cup, Hagi was signed by Barcelona.\n\nAfter two years at Barça, Hagi signed for Turkish club Galatasaray. At Galatasaray, he was both successful and highly popular among the Turkish supporters. Hagi was an important member of a team that would win four consecutive league titles. In 2000, at age 35, Hagi had the best days of his career winning every possible trophy with Galatasaray. Gala won the 1999–2000 UEFA Cup after defeating Arsenal in the final, a match in which Hagi was sent off for punching Arsenal captain Tony Adams.http://news.bbc.co.uk/1/hi/sport/football/752751.stm This was followed by the capture of the UEFA Super Cup with a historic win against Hagi's former club Real Madrid. Both feats were firsts, and remain unmatched in Turkish football history. The mass hysteria caused by these wins in Istanbul raised Hagi's popularity even further with the fans and prompted French ex-international Luis Fernández to say, \"Hagi is like wine, the older it gets, the better he is.\"\n\nWhen he retired in 2001, Hagi remained one of the most beloved players in the Turkish and Romanian championships. Hagi is highly praised by the Galatasaray supporters. The classic chant \"I Love You Hagi\" was adopted by Gala fans since his arrival at Galatasaray.\n\nInternational career\n\nHagi made his debut for the Romania national team at age 18 in 1983 against Norway, in Oslo. He was part of the Romanian team until 2000.\n\nHagi took part at the 1990 World Cup and later led the Romanian team to its best ever international performance at the 1994 World Cup, where the team reached the quarterfinals before Sweden ended their run after winning the penalty shoot-out. Hagi scored three times in the tournament, including a memorable goal in their 3–2 surprise defeat of South American powerhouse and previous runners-up Argentina. In the first of Romania's group stage matches, against Colombia, Hagi scored one of the most memorable goals of that tournament, curling in a 40-yard lob over Colombian goalkeeper Óscar Córdoba who was caught out of position. He was named in the Team of the Tournament.\n\nFour years later, after the 1998 World Cup, Hagi decided to retire from the national team, only to change his mind after a few months and participate in UEFA Euro 2000, during which he was sent off in the quarter-final loss against eventual runners-up Italy.\n\nHagi retired from professional football in 2001, age 36, in a game called \"Gala Hagi\" on 24 April. He still holds the record as Romanian national team top scorer.\n\nCareer as coach\n\nRomania national team\n\nIn 2001, Hagi was named the manager of the Romania national team, replacing Ladislau Bölöni, who left the squad to coach Sporting Clube de Portugal. After failing to qualify the team for the World Cup, however, Hagi was sacked. His only notable achievement during the six months as Romania's manager was the win in Budapest against Hungary.\n\nBursaspor\n\nIn 2003, Hagi took over as coach of Turkish Süper Lig side Bursaspor, but left the club after a disappointing start to the season.\n\nGalatasaray\n\nHagi then became manager of Galatasaray in 2004, leading the team to the Turkish Cup in 2005 final with 5–1 as a score against fierce rivals Fenerbahçe. His contract, however, was not renewed since his team was not able to win 2004–05 Süper Lig title over Fenerbahçe during the centennial of the club.\n\nPolitehnica Timișoara\n\nSteaua București sought to hire Hagi in the summer of 2005, but Hagi's requested wage could not be met by the Romanian champions, and he became manager of Politehnica Timișoara instead. However, after a string of poor results and disagreements with management, he left the club after a few months. Constanța's main stadium used to bear his name, but the name was changed after Hagi signed with Politehnica Timișoara.\n\nSteaua București\n\nFrom June to September 2007, Hagi coached Steaua București, had a mediocre start in the internal championship mainly due to the large number of unavailable injured players, and managed to qualify the team for the second time in line to the UEFA Champions League group stages, passing two qualifying rounds. He resigned due to a long series of conflicts with club owner Gigi Becali, which also happens to be his godson. The main reason for resigning was the owner's policy of imposing players, making the team's strategy and threats. Hagi's resigned mere hours after Steaua's first Champions League match away against Slavia Prague, a 2–1 loss.\n\nGalatasaray return\n\nAfter Frank Rijkaard was sacked as coach, Hagi signed a one and a half year contract with Galatasaray on 21 October 2010. His official presentation was held on 22 October. His former teammate from Galatasaray Tugay Kerimoğlu assisted him in Istanbul, but he was sacked on 22 March 2011 after a series of poor results in the Süper Lig.\n\nStyle of play\n\nA talented left-footed attacking midfielder, Hagi's playing style was frequently compared with Diego Maradona's throughout his career, due to his technical ability as well as his temperamental character and leadership; as a youth, he was mainly inspired by compatriots Anghel Iordănescu and Ion Dumitru. A quick, highly creative, and mobile advanced playmaker, Hagi was also tactically versatile, and capable of playing in several midfield and offensive positions on either wing or through the middle, due to his ability with both feet, despite being naturally left-footed, although he had a preference for using his stronger foot; his preferred position was in a free role as a classic number 10, but he was also used as a second striker on occasion. Hagi was renowned in particular for his first touch and speed on the ball, as well as his timing, interpretation of space, bursts of acceleration, and dribbling skills, which enabled him to get past defenders; he was also highly regarded for his vision and precise passing, although he was capable of both scoring and assisting goals, and was also an accurate finisher and set-piece taker, who had a penchant for scoring goals from powerful, bending long range strikes. In spite of his small stature, Hagi possessed significant upper body strength, which, along with his control, aided him in protecting the ball from opponents, and allowed him to create space for himself or his teammates. Despite his skill and his reputation as one of the greatest number 10s of his generation, his career was marked by inconsistency at times, and he was also considered to be a controversial player, due to his rebellious and arrogant attitude, as well as his low work-rate and lack of discipline, which led him to have several disagreements with his managers, opponents, and officials.\n\nPersonal life\n\nHis son Ianis, who is also a footballer was born in Istanbul, Turkey, when he was playing for Galatasaray SK.\n\nCareer statistics\n\nClub\n\nInternational\n\n[http://www.rsssf.com/miscellaneous/hagi-intl.html \"Gheorghe Hagi – Century of International Appearances\"]. RSSSF. Retrieved 17 July 2012.[http://www.frf.ro/echipa-nationala/player/3116 Gheorghe HAGI] . FRF. Retrieved 17 July 2012.\n\nInternational goals\n\nScores and results list Romania's goal tally first\n\nManagerial statistics\n\nHonours\n\nPlayer\n\n;Steaua București\n*Romanian League: 1986–87, 1987–88, 1988–89\n*Cupa României: 1986–87, 1988–89\n*European Super Cup: 1986\n\n;Real Madrid\n*Supercopa de España: 1990\n\n;Brescia\n*Anglo-Italian Cup: 1993–94\n\n;Barcelona\n*Supercopa de España: 1994\n\n;Galatasaray\n*Süper Lig: 1996–97, 1997–98, 1998–99, 1999–2000\n*Turkish Cup: 1998–99, 1999–2000\n*Turkish Super Cup: 1996, 1997\n*UEFA Cup: 1999–00\n*UEFA Super Cup: 2000\n\nManager\n\n;Galatasaray\n*Turkish Cup: 2004–05\n\n;Viitorul Constanța\n*Liga I: 2016–17\n\nIndividual\n\n*Romanian League: Top Scorer 1985, 1986\n*European Cup: Top Scorer 1987–88\n*Romanian Footballer of the Year: 1985, 1987, 1993, 1994, 1997, 1999, 2000\n*FIFA World Cup All-Star Team: 1994\n*FIFA XI: 1998\n*World Soccer Magazines 100 Greatest Players of the 20th century: 1999 (#25)\n*UEFA Jubilee Awards – Greatest Romanian Footballer of the last 50 Years: 2003\n*FIFA 100: 2004\n*Golden Foot Legends Award: 2015\n*Romania Coach of the Year: 2015, 2017",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Gheorghe Hagi" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=12276" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Gheorghe \"Gică\" Hagi (; born 5 February 1965) is a Romanian former professional footballer, considered one of the best attacking midfielders in Europe during the 1980s and '90s and the greatest Romanian footballer of all time.[http://www.romania-insider.com/famous-romanians-gheorghe-hagi/5870/# \"Famous Romanians: Gheorghe Hagi\"]. Romania Insider. 11 August 2010. Galatasaray fans called him \"Comandante\" (\"The Commander\") and Romanians call him \"Regele\" (\"The King\").He is currently the manager of FC Viitorul\n\nNicknamed \"The Maradona of the Carpathians\", Hagi is considered a hero in his homeland. He was named Romanian Footballer of the Year seven times, and is regarded as one of the best football players of his generation. As a creative advanced playmaker, he was renowned for his dribbling, technique, vision, passing and finishing.[https://www.fifa.com/fifa-tournaments/players-coaches/people2354/profile.html \"Romania and Gala’s commander and king\"]. FIFA.com. Retrieved 18 November 2013\n\nHagi played for the Romania national team in three FIFA World Cups, in 1990, 1994 (where he was named in the World Cup All-Star Team) and 1998; as well as in three UEFA European Championships, in 1984, 1996 and 2000. He won a total of 125 caps for Romania, ranked second after Dorinel Munteanu, and is the joint leading goalscorer (alongside Adrian Mutu) with 35 goals.\n\nIn November 2003, to celebrate UEFA's Jubilee, Hagi was selected as the Golden Player of Romania by the Romanian Football Federation as their most outstanding player of the past 50 years. In 2004, he was named by Pelé as one of the 125 Greatest Living Footballers at a FIFA Awards Ceremony. He was listed at number 25 in World Soccer Magazines list of the 100 greatest players of the 20th century. Hagi is one of the few footballers to have played for both Spanish rival clubs Real Madrid and Barcelona.\n\nIn 2009, Hagi founded Romanian club Viitorul Constanța. He is currently both owner and chairman of the club. Hagi also established the Gheorghe Hagi football academy, one of the biggest football academies in Southeastern Europe.\n\nClub career\n\nBorn in Săcele, Hagi started his career playing for the youth teams of Farul Constanța in the 1970s, before being selected by the Romanian Football Federation to join the squad of Luceafărul București in 1980 for two years. In 1982, he returned to Constanța, but one year later, aged 18, he was prepared to make the step to a top team. He was originally directed to Universitatea Craiova, but chose Sportul Studențesc of Bucharest instead.\n\nIn late 1987, Hagi transferred to Steaua București as the team prepared for their European Super Cup final against Dynamo Kyiv. The original contract was for one game only, the final. However, after winning the trophy, where Hagi scored the only goal of the match, Steaua did not want to release him back to Sportul Studențesc and retained him. During his Steaua years (1987–1990), Hagi played 97 Liga I games, scoring 76 goals. He and the team reached the European Cup semi-final in 1988 and the final in the following year, while Hagi finished as one of the competition's top scorers in the former edition of the tournament. Hagi and Steaua were the champions of Romania in 1987, 1988 and 1989 and as well as winning the Cupa României in 1987, 1988 and 1989. His strong performances had him linked with Arrigo Sacchi's Milan and Bayern Munich, but Nicolae Ceaușescu's communist government rejected any offer.\n\nAfter the 1990 FIFA World Cup, Hagi was signed by Real Madrid. The La Liga side paid $4.3 million to Steaua București for him. Hagi played two seasons with Madrid, then was sold to Brescia.\n\nHagi began the 1992–93 season with Brescia, but after his first season, the club was relegated to Serie B. The next season, Hagi helped the club win Serie B and earn promotion back to Serie A. After performing memorably during the 1994 World Cup, Hagi was signed by Barcelona.\n\nAfter two years at Barça, Hagi signed for Turkish club Galatasaray. At Galatasaray, he was both successful and highly popular among the Turkish supporters. Hagi was an important member of a team that would win four consecutive league titles. In 2000, at age 35, Hagi had the best days of his career winning every possible trophy with Galatasaray. Gala won the 1999–2000 UEFA Cup after defeating Arsenal in the final, a match in which Hagi was sent off for punching Arsenal captain Tony Adams.http://news.bbc.co.uk/1/hi/sport/football/752751.stm This was followed by the capture of the UEFA Super Cup with a historic win against Hagi's former club Real Madrid. Both feats were firsts, and remain unmatched in Turkish football history. The mass hysteria caused by these wins in Istanbul raised Hagi's popularity even further with the fans and prompted French ex-international Luis Fernández to say, \"Hagi is like wine, the older it gets, the better he is.\"\n\nWhen he retired in 2001, Hagi remained one of the most beloved players in the Turkish and Romanian championships. Hagi is highly praised by the Galatasaray supporters. The classic chant \"I Love You Hagi\" was adopted by Gala fans since his arrival at Galatasaray.\n\nInternational career\n\nHagi made his debut for the Romania national team at age 18 in 1983 against Norway, in Oslo. He was part of the Romanian team until 2000.\n\nHagi took part at the 1990 World Cup and later led the Romanian team to its best ever international performance at the 1994 World Cup, where the team reached the quarterfinals before Sweden ended their run after winning the penalty shoot-out. Hagi scored three times in the tournament, including a memorable goal in their 3–2 surprise defeat of South American powerhouse and previous runners-up Argentina. In the first of Romania's group stage matches, against Colombia, Hagi scored one of the most memorable goals of that tournament, curling in a 40-yard lob over Colombian goalkeeper Óscar Córdoba who was caught out of position. He was named in the Team of the Tournament.\n\nFour years later, after the 1998 World Cup, Hagi decided to retire from the national team, only to change his mind after a few months and participate in UEFA Euro 2000, during which he was sent off in the quarter-final loss against eventual runners-up Italy.\n\nHagi retired from professional football in 2001, age 36, in a game called \"Gala Hagi\" on 24 April. He still holds the record as Romanian national team top scorer.\n\nCareer as coach\n\nRomania national team\n\nIn 2001, Hagi was named the manager of the Romania national team, replacing Ladislau Bölöni, who left the squad to coach Sporting Clube de Portugal. After failing to qualify the team for the World Cup, however, Hagi was sacked. His only notable achievement during the six months as Romania's manager was the win in Budapest against Hungary.\n\nBursaspor\n\nIn 2003, Hagi took over as coach of Turkish Süper Lig side Bursaspor, but left the club after a disappointing start to the season.\n\nGalatasaray\n\nHagi then became manager of Galatasaray in 2004, leading the team to the Turkish Cup in 2005 final with 5–1 as a score against fierce rivals Fenerbahçe. His contract, however, was not renewed since his team was not able to win 2004–05 Süper Lig title over Fenerbahçe during the centennial of the club.\n\nPolitehnica Timișoara\n\nSteaua București sought to hire Hagi in the summer of 2005, but Hagi's requested wage could not be met by the Romanian champions, and he became manager of Politehnica Timișoara instead. However, after a string of poor results and disagreements with management, he left the club after a few months. Constanța's main stadium used to bear his name, but the name was changed after Hagi signed with Politehnica Timișoara.\n\nSteaua București\n\nFrom June to September 2007, Hagi coached Steaua București, had a mediocre start in the internal championship mainly due to the large number of unavailable injured players, and managed to qualify the team for the second time in line to the UEFA Champions League group stages, passing two qualifying rounds. He resigned due to a long series of conflicts with club owner Gigi Becali, which also happens to be his godson. The main reason for resigning was the owner's policy of imposing players, making the team's strategy and threats. Hagi's resigned mere hours after Steaua's first Champions League match away against Slavia Prague, a 2–1 loss.\n\nGalatasaray return\n\nAfter Frank Rijkaard was sacked as coach, Hagi signed a one and a half year contract with Galatasaray on 21 October 2010. His official presentation was held on 22 October. His former teammate from Galatasaray Tugay Kerimoğlu assisted him in Istanbul, but he was sacked on 22 March 2011 after a series of poor results in the Süper Lig.\n\nStyle of play\n\nA talented left-footed attacking midfielder, Hagi's playing style was frequently compared with Diego Maradona's throughout his career, due to his technical ability as well as his temperamental character and leadership; as a youth, he was mainly inspired by compatriots Anghel Iordănescu and Ion Dumitru. A quick, highly creative, and mobile advanced playmaker, Hagi was also tactically versatile, and capable of playing in several midfield and offensive positions on either wing or through the middle, due to his ability with both feet, despite being naturally left-footed, although he had a preference for using his stronger foot; his preferred position was in a free role as a classic number 10, but he was also used as a second striker on occasion. Hagi was renowned in particular for his first touch and speed on the ball, as well as his timing, interpretation of space, bursts of acceleration, and dribbling skills, which enabled him to get past defenders; he was also highly regarded for his vision and precise passing, although he was capable of both scoring and assisting goals, and was also an accurate finisher and set-piece taker, who had a penchant for scoring goals from powerful, bending long range strikes. In spite of his small stature, Hagi possessed significant upper body strength, which, along with his control, aided him in protecting the ball from opponents, and allowed him to create space for himself or his teammates. Despite his skill and his reputation as one of the greatest number 10s of his generation, his career was marked by inconsistency at times, and he was also considered to be a controversial player, due to his rebellious and arrogant attitude, as well as his low work-rate and lack of discipline, which led him to have several disagreements with his managers, opponents, and officials.\n\nPersonal life\n\nHis son Ianis, who is also a footballer was born in Istanbul, Turkey, when he was playing for Galatasaray SK.\n\nCareer statistics\n\nClub\n\nInternational\n\n[http://www.rsssf.com/miscellaneous/hagi-intl.html \"Gheorghe Hagi – Century of International Appearances\"]. RSSSF. Retrieved 17 July 2012.[http://www.frf.ro/echipa-nationala/player/3116 Gheorghe HAGI] . FRF. Retrieved 17 July 2012.\n\nInternational goals\n\nScores and results list Romania's goal tally first\n\nManagerial statistics\n\nHonours\n\nPlayer\n\n;Steaua București\n*Romanian League: 1986–87, 1987–88, 1988–89\n*Cupa României: 1986–87, 1988–89\n*European Super Cup: 1986\n\n;Real Madrid\n*Supercopa de España: 1990\n\n;Brescia\n*Anglo-Italian Cup: 1993–94\n\n;Barcelona\n*Supercopa de España: 1994\n\n;Galatasaray\n*Süper Lig: 1996–97, 1997–98, 1998–99, 1999–2000\n*Turkish Cup: 1998–99, 1999–2000\n*Turkish Super Cup: 1996, 1997\n*UEFA Cup: 1999–00\n*UEFA Super Cup: 2000\n\nManager\n\n;Galatasaray\n*Turkish Cup: 2004–05\n\n;Viitorul Constanța\n*Liga I: 2016–17\n\nIndividual\n\n*Romanian League: Top Scorer 1985, 1986\n*European Cup: Top Scorer 1987–88\n*Romanian Footballer of the Year: 1985, 1987, 1993, 1994, 1997, 1999, 2000\n*FIFA World Cup All-Star Team: 1994\n*FIFA XI: 1998\n*World Soccer Magazines 100 Greatest Players of the 20th century: 1999 (#25)\n*UEFA Jubilee Awards – Greatest Romanian Footballer of the last 50 Years: 2003\n*FIFA 100: 2004\n*Golden Foot Legends Award: 2015\n*Romania Coach of the Year: 2015, 2017. Gheorghe Hagi. http://en.wikipedia.org/?curid=12276."
  }
}
