{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16971",
  "eid" : "29e0ba10-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778579505,
  "textBody" : "Kvass is a traditional Slavic fermented beverage commonly made from rye bread,   known in many Eastern European countries and especially in Ukraine and Russia as black bread. The colour of the bread used contributes to the colour of the resulting drink. It is classified as a non-alcoholic drink by Russian standards, as the alcohol content from fermentation is typically low (0.5–1.0%).[http://ostapbenderx.narod.ru/Index/20/2038.htm ГОСТ Р 52409-2005. Продукция безалкогольного и слабоалкогольного производства]  (\"GOST Р 52409-2005. Production of non-alcoholic and mildly alcoholic products\") Ian Spencer Hornsey. A history of beer and brewing, [https://books.google.com/books?id\nQqnvNsgas20C&pgPA8 page 8]. Royal Society of Chemistry, 2003. \"A similar, low alcohol (0.5–1.0%) drink, kvass … may be a 'fossil beer'\". It may be flavoured with fruits such as strawberries and raisins, or with herbs such as mint.\n\nIt is especially popular in most of the North Slavic countries, including Poland, and Serbia, but not the Czech Republic or Slovakia. It is also known in the Baltic countries Latvia, Lithuania, and Estonia. Kvass is also well known throughout Mongolia, Georgia, Azerbaijan, Tajikistan, Kazakhstan, Uzbekistan and Armenia. Many kvass vendors there sell the drink in the streets. Kvass is also popular in Harbin[http://meal.dbw.cn/system/2011/06/15/053227379.shtml 哈尔滨特色饮料“格瓦斯”竞相亮相哈洽会] and Xinjiang, China, where Russian culture has had an influence.\n\nTerminology \n\nThe word kvass is derived from Old Church Slavonic квасъ from Proto-Slavic *kvasъ ('leaven', 'fermented drink') and ultimately from Proto-Indo-European base *kwat- ('sour').http://www.palaeolexicon.com/Word/Show/19826Max Vasmer. Russisches etymologisches Wörterbuch. Winter, Heidelberg, 1953–1958 (in German). Russian translation by Oleg Trubachyov: Этимологический словарь русского языка. Progress, Moscow, 1964–1973. [http://starling.rinet.ru/cgi-bin/response.cgi?basename\n\\data\\ie\\vasmer&text_word%D0%BA%D0%B2%D0%B0%D1%81&method_word\nbeginning&ww_word=on квас]Олег Николааевич Трубачёв и др. Этимологический словарь славянских языков. Академия наук СССР, Москва, т. [http://www.proto-slavic.ru/dic-trubachev/_pdf/trubachev-dic13.pdf 13] (1987), с. 153 (Oleg Trubachyov et al. Etymological dictionary of Slavic languages. USSR Academy of Sciences, Moscow, vol. 13 (1987), p. 153; in Russian) Today the words used are almost the same: in Belarusian: , '; Chinese: , ; Latvian: '; Polish ' ('bread kvass', the adjetive being used to differentiate it from kwas, 'acid'); Russian: , '; in Ukrainian: , . Non-cognates include Lithuanian ' ('beverage', similar to Latvian '), Estonian ', and Finnish '.\n\nHistory \n\nKvass has been a common drink in Eastern Europe since at least the Middle Ages, comparable with other ancient fermented grain beverages including beer brewed from barley by the ancient Egyptians, the pombe or millet beer of Africa, the so-called rice wines of Asia, the chicha made with corn or cassava by the natives of the Americas.Anthropology, By Edward B. Taylor, [https://books.google.com/books?idbK-S4SKTsDkC&pg\nPA268 page 268]. Kvass was invented by the Slavs and became the most popular among East Slavs.[http://www.minrol.gov.pl/pol/Jakosc-zywnosci/Produkty-regionalne-i-tradycyjne/Lista-produktow-tradycyjnych/woj.-lodzkie/Kwas-chlebowy Kwas chlebowy – Tradycja, pochodzenie oraz historia produktu:] Kvass – Tradition, origin and history of the product. \n\nThe word \"kvass\" was first mentioned in the Primary Chronicle, in the description of events of the year 996, following the Christianization of the Kievan Rus'.[http://www.mgh-bibliothek.de/dokumente/a/a011458.pdf The Russian Primary Chronicle, Laurentian Text] , p.121. Translated and edited by Samuel Hazzard Cross and Olgerd P. Sherbowitz-Wetzor. Cambridge, MA: The Mediaeval Academy of America, 1953. According to the Merriam-Webster Dictionary and Oxford English Dictionary the first mention of kvass in an English text took place sometime around 1553.[http://www.merriam-webster.com/dictionary/kvass Kvass] in Merriam Webster Dictionary[http://findwords.info/term/kvass Kvass] in Oxford English Dictionary. c 1553 Chancelour Bk. Emp. Russia in Hakluyt Voy. (1886) III. 51 Their drinke is like our peny Ale, and is called Quass. In Russia, under Peter the Great, it was the most common non-alcoholic drink in every class of society.  William Tooke, describing Russian drinking habits in 1799, stated that \"The most common domestic drink is quas, a liquor prepared from pollard, meal, and bread, or from meal and malt, by an acid fermentation. It is cooling and well-tasted.\"\n\nApart from drinking kvass, families (especially the poor ones) used it as the basis of many dishes they consumed. Traditional cold summertime soups of Russian cuisine, such as okroshka, botvinya and tyurya, are based on kvas. A similar tradition is found in Romanian cuisine, where the liquid used for cooking is made by fermenting wheat or barley  bran and called borș.\n\nKvass was reported to be consumed in excess by peasants, low-class citizens, and monks; in fact, it is sometimes said that it was usual for them to drink more kvass than water. In the 19th century, the kvass industry was created and less natural versions of the drink became increasingly widespread. On the other hand, the popularity of kvass and the market competition led to the emergence of many varieties, which included herbs, fruits and berries. At that time kvass vendors called kvasnik (pl. kvasniki) were on the streets in almost every city. They often specialized in particular kinds of kvass: strawberry kvass, apple kvass, etc.\n\nWhile kvass used to be consumed widely in most Slavic countries, its popularity spread to Latvia and Lithuania. Today it forms the basis of a multimillion-dollar industry, though it has been struggling ever since the introduction of Western soft drinks in Eastern European countries. Kvass was once sold during the summer only, but is now produced, packaged, and sold year-round.[http://www.nzherald.co.nz/business/news/article.cfm?c_id\n3&objectid=10521125 Russia's patriotic kvas drinkers say no to cola-nisation.] The New Zealand Herald. BUSINESS; General. July 12, 2008.\n\nManufacturing \n\nKvass is made by the natural fermentation of bread, such as wheat, rye, or barley, and sometimes flavoured using fruit, berries, raisins, or birch sap collected in the early spring. Modern homemade kvass most often uses black or regular rye bread, usually dried (called plural suhari), baked into croutons, or fried, with the addition of sugar or fruit (e.g. apples or raisins), and with a yeast culture and zakvaska (\"kvass fermentation starter\").\n\nCommercial kvass, especially less expensive varieties, is occasionally made like many other soft drinks, using sugar, carbonated water, malt extract, and flavourings. Better brands, often made by beer rather than soft drink manufacturers, usually use a variation of the traditional process to brew their products. Kvass is commonly served unfiltered, with the yeast still in it, which adds to its unique flavour as well as its high vitamin B content.\n\nRussia \n\nAlthough the introduction of western soft drinks such as Coca-Cola and Pepsi had reduced the commercial sale of kvass in Russia, kvass has been more recently marketed as a \"patriotic\" alternative to cola, sparking a \"kvass revival\". For example, the Russian company Nikola (by coincidence its name sounds like \"not cola\" in Russian) has promoted its brand of kvass with an advertising campaign emphasizing \"anti cola-nisation.\" Moscow-based Business Analytica reported in 2008 that bottled kvass sales had tripled since 2005 and estimated that per-capita consumption of kvass in Russia would reach three liters in 2008. Between 2005 and 2007, cola's share of the Moscow soft drink market fell from 37% to 32%. Meanwhile, kvass' share more than doubled over the same time period, reaching 16% in 2007. In response, Coca-Cola launched its own brand of kvass in May 2008. This is the first time a foreign company has made an appreciable entrance into the Russian kvass market. Pepsi has also signed an agreement with a Russian kvass manufacturer to act as a distribution agent. The development of new technologies for storage and distribution, and heavy advertising, have contributed to this surge in popularity; three new major brands have been introduced since 2004.\n\nMarket shares (2014) \n\nPoland \n\nMuch like in other Eastern European countries, kvass has historical roots in Poland – mainly due to the trade between the Kingdom of Poland and Kievan Rus'. Kvass may have appeared in Poland as early as the 10th century.[http://www.sm.fki.pl/kwaschlebowy.htm Kwas chlebowy – Odrobina historii] Kvass – A little bit of history.  The production of kvass went on for several hundred years, as recipes were passed down from parent to offspring. This continued in the Polish-Lithuanian Commonwealth. It was at first commonly drunk among peasants who worked on the fields and eventually spread to the szlachta (Polish nobility). One example of this is kwas chlebowy sapieżyński kodeński, an old type of Polish kvass that is still sold as a contemporary brand.[http://www.minrol.gov.pl/pol/Jakosc-zywnosci/Produkty-regionalne-i-tradycyjne/Lista-produktow-tradycyjnych/woj.-lubelskie/Kwas-chlebowy-sapiezynski-kodenski Kwas chlebowy sapieżyński kodeński – Tradycja, pochodzenie oraz historia produktu:] Kwas chlebowy sapieżyński kodeński – Tradition, origin and history of the product.  Its origins can be traced back to the 1500s, when Jan Sapieha – a magnate of the House of Sapieha – was granted land by the Polish king. On those lands he founded the town of Kodeń. He then bought the mills and 24 villages of the surrounding areas from their previous landowners. It was then that the taste of kvass became known among the Polish szlachta, who used it for its supposed healing qualities. After the last Partition of the Polish-Lithuanian Commonwealth in 1795, Poland ceased to be an independent state. Throughout the 19th century, kvass remained popular among Poles who lived in the Russian Empire, especially the inhabitants of rural areas.\n\nProduction of the beverage in Poland on an industrial scale can be traced back to the more recent interwar period, when the Polish state regained independence as the Second Polish Republic. In interwar Poland, kvass was brewed and sold in mass numbers by magnates of the Polish drinks market like the Varsovian brewery Haberbusch i Schiele or the Karpiński company.[http://zb.eco.pl/zb/140/zdrowie.htm Alternatywa dla Coca Coli?] Information regarding kvass in Interwar Poland. Kvass was exceptionally popular in Eastern Poland,[http://www.kwaschlebowy.eu/sites/default/files/broszury/ulotka_kwas_chlebowy_0.jpg Broszura o naturalnym kwasie chlebowym] Booklet about natural kvass.  partly due to the plentiful numbers of Belarusian and Ukrainian minorities that lived there. However, with the collapse of many prewar businesses and much of the Polish industry during World War II, kvass lost popularity following the aftermath of the war. It was reintroduced industrially after the formation of the People's Republic of Poland as a satellite state of the USSR, though much like in other Slavic and Baltic countries it lost favour upon the introduction of Coca-Cola onto the Eastern European market and once again during the economic crisis of the 1980s in Poland. The collapse of the Eastern Bloc between 1989–1991 was followed by the arrival of other Western soft-drinks in former Soviet countries. Even though kvass isn't as popular as it used to be, it is gaining more and more popularity once again.\n\nAlthough not as popular in Poland nowadays as it is in Russia or Ukraine, kvass can still be found in many supermarkets and grocery shops throughout the nation where it is known in Polish as kwas chlebowy. Commercial bottled versions of the drink are the most common variant, as there are companies that specialize in manufacturing a more modern version of the drink (some variants are manufactured in Poland whilst others are imported from its neighbouring countries, Lithuania and Ukraine being the most popular source.[http://gerima.pl/index.html Gerima dystrybutor kwasu chlebowego w Polsce] Gerima – distributor of kvass in Poland.  However, recipes for a traditional version of kvass exist; some of them originate from Eastern Poland.[http://www.lubelskie.pl/?pid647 Kwas chlebowy sapieżyński kodeński] Information about traditional Polish kvass. [http://www.mniammniam.com/Kwas_chlebowy-8595p.html Przepis na domowy kwas chlebowy] Recipe for home-made kvass.  Although commercial kvass is much easier to find in Polish shops, Polish manufacturers of more natural and healthier variants of kvass have become increasingly popular both within and outside of the country's borders – one good example being a company that has made itself known not only on the Polish market, but also in Slovakia.[http://www.dzienniklodzki.pl/artykul/160252,ich-kwas-chlebowy-podbija-rynek,id,t.html?cookie\n1 Ich kwas chlebowy podbija rynek] News article about Polish manufacturers of kvass made from traditional recipes.[http://www.kwaschlebowy.eu/ Oficjalna strona firmy Eko-Natura] Official website of Polish traditional kvass manufacturer. [http://lokalnazywnosc.pl/eko-natura-producent-kwasu-chlebowego Eko-Natura – producent kwasu chlebowego] More information about Polish kvass manufacturer.  Street vendors selling fresh kvass also appear from time to time, especially during summer in cities like Zakopane, where tourists sometimes crowd the streets seeking refreshment on a hot day.\n\nLatvia and Lithuania \n\nAfter the fall of the Soviet Union in 1991, the street vendors disappeared from the streets of Latvia due to new health laws that banned its sale on the street. Economic disruptions forced many kvass factories to close. The Coca-Cola Company moved in and quickly dominated the market for soft drinks. In 1998 the local soft drink industry adapted by selling bottled kvass and launching aggressive marketing campaigns. This surge in sales was stimulated by the fact that kvass sold for about half the price of Coca-Cola. In just three years, kvass constituted as much as 30% of the soft drink market in Latvia, while the market share of Coca-Cola fell from 65% to 44%. The Coca-Cola company had losses in Latvia of about $1 million in 1999 and 2000. The situation was similar in the other Baltic countries and Russia. Coca-Cola responded by buying kvass manufacturers as well as making kvass at their own soft drink plants.[http://www.latvians.com/en/Mailer/envelope.php?2001_06_02.htm#news6 Latvian Mailer – June 2, 2001][http://www.coca-colahbc.com/country/files/en/baltics/promarket.html Coca-Cola HBC – Products and Marketing]\n\nIn Lithuania kvass is known as gira and is widely available in bottles and draft. Many restaurants in Vilnius make their own gira, which they sell on the premises. Strictly speaking, gira can be made from anything fermentable — such as caraway tea, beetroot juice, or berries — but it is made mainly from black bread or barley/rye malt.\n\nElsewhere \n\nThe only breweries in the United States that brew kvass all year round are the [http://www.beaverbrewingcompany.com/beers-2/kvas Beaver Brewing Company] in Beaver Falls, Pennsylvania, where it is made with the addition of raisins and lemons, and Kolokol kvass in Helena, Montana, using traditional ingredients (water, sugar, rye bread, yeast). Iggy's Foods, LLC, a company based in Bainbridge Island, Washington, produces a live, cultured raw-food Ginger Beet kvass made with beets, Hawaiian ginger, limes, and Himalayan sea salt. [https://thebrinery.com/ The Brinery], a wholesale fermenter in Ann Arbor, Michigan, sells beet and tomato kvass as well as seasonal varieties.\n\nIn the United Kingdom, kvass is practically unknown, as there are no cultural ties to it within the nation's history and there are no renowned kvass breweries in the country. However, with the influx of immigrants following the 2004 enlargement of the European Union, a number of stores selling cuisine and beverages from Eastern Europe cropped up throughout the UK, many of them storing kvass on their shelves.[http://www.polnews.co.uk/index.php/polskie-uslugi/1246-nowa-malgosias-polski-sklep-w-newcastle.html Polski sklep w Newcastle] News article about a Polish shop in the North East of England.\n\nIn Canada, [http://allstarsbakery.com/prod11.html All Stars Bakery] of Concord, Ontario produce kvas in the traditional method. Commercial Kvas products requiring no refrigeration on the shelf are available at various Eastern European grocery stores in Toronto and surrounding areas, such as [http://www.starskycanada.com/ Starsky Fine Foods].\n\nNutrition \n\nAs its primary ingredient is rye, kvass is a good source of vitamin B-1 and B-6, magnesium, phosphorus, amino acids, and pantothenate. It is also rich in lactic acid and simple sugars, which contributes to its pleasant, thirst-quenching taste, provides ample calories to fuel physical activity, and may improve digestion, as with other lacto-fermented foods such as yogurt and sauerkraut.\n\nCultural references \n\nThe name of Kvasir, a wise being in Norse mythology, is possibly related to kvass.Александр Николаевич Афанасьев (1865–1869). Поэтические воззрения славян на природу. Директ-медиа (2014) том. 1, стр. [https://books.google.de/books?idr-d3BAAAQBAJ&q\nквасир&ffalse 260].  (Alexander Afanasyev. The Poetic Outlook of Slavs about Nature, 1865–1869; reprinted 2014, p. 260; in Russian)Karl Joseph Simrock. Handbuch der deutschen Mythologie mit Einschluss der nordischen, 1st edition (1855), p. [https://books.google.de/books?id\nEhxBAAAAcAAJ&hlen&pg\nPA272#vonepage&f\nfalse 272] or 2nd edition (1864), p. [http://babel.hathitrust.org/cgi/pt?idhvd.32044089074793;view\n1up;seq258 244]. Bonn, Marcus.Jooseppi Julius Mikkola. Bidrag till belysning af slaviska lånord i nordiska språk. Arkiv för nordisk filologi, vol. 19 (1903), p. [http://runeberg.org/anf/1903/0339.html 331].Georges Dumézil (1974). Gods of the Ancient Northmen, p. [https://books.google.de/books?id\nrurD1yd0Ok0C&hlen&q\nkvas%20kvasir 21]. University of California Press. Jan de Vries (2000). Altnordisches etymologisches Wörterbuch, p. [https://books.google.de/books?idso8eAAAAIAAJ&pg\nPA319&hlen&q\nkvasir&f=false 336]. 4th edition, Leiden (in German)\n\nThe Russian expression  \"Перебиваться с хлеба на квас\" (literally \"to clamber from bread to kvass\") means to barely make ends meet, remotely similar to (and may be translated as) the expression \"to be on the breadline\". To better understand the Russian phrase one has to know that in poor families kvass was made from stale leftovers of rye brecanaad.Svyatoslav Loginov, [http://www.rusf.ru/loginov/books/story07.htm \"We Used to Bake Blini...\" (\"Бывало пекли блины...\")] \n\nIn Fyodor Dostoyevsky's The Brothers Karamazov, monastery kvass is mentioned in the dinner scene as being famous throughout the neighborhood.The Brothers Karamazov. Fyodor Dostoevsky. p. 85. Farrar, Straus and Giroux (June 14, 2002). . In Leo Tolstoy's The Death of Ivan Ilyich, kvass is made first thing on a holiday morning.The Death of Ivan Ilyich. Leo Tolstoy. p. 127 Penguin Classics (May 27, 2008). . In Ivan Goncharov's Oblomov and in Tolstoy's Anna Karenina, kvass is repeatedly mentioned. In Tolstoy's War and Peace, French soldiers are aware of kvass on entering Moscow, enjoying it but referring to it as \"pig's lemonade\".War and Peace. Leo Tolstoy. Book 10, chapter 29,  Pennsylvania State University translation. In Anton Chekhov's The Cherry Orchard, kvass is mentioned early in the play, \"Bring me some kvass, would you?\"The Cherry Orchard. Anton Chekhov. Translated by Tom Stoppard. Grove Press, 2009 In Sholem Aleichem's Motl, Peysi the Cantor's Son, diluted kvass is the focus of one of Motl's older brother's get-rich-quick schemes.\n\nIn Joris-Karl Huysmans' Against Nature (À rebours) the protagonist Jean Des Esseintes serves kvass, along with porter and stout, for a funeral banquet \"in memory of the host's virility, lately but only temporarily deceased.\"J.-K. Huysmans, Against Nature, trans. Robert Baldick, New York: Penguin Books, 1959.  In Jules Verne's 1896 novel Michael Strogoff, Courier of the Czar, the titular character drinks kvass when he stops to change horses at post stations on his way to Siberia. Kvass has also appeared in Russian fantasy novels, such as the 2008 Twilight Watch.\n\nSimilar beverages \n\nOther beverages from around the world that are traditionally low-alcohol and lacto-fermented include:\n\n* Tepache\n* Boza\n* Chicha\n* Ibwatu\n* Kombucha\n* Malta\n* Palm wine\n* Rivella\n* Brottrunk",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kvass" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16971" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kvass is a traditional Slavic fermented beverage commonly made from rye bread,   known in many Eastern European countries and especially in Ukraine and Russia as black bread. The colour of the bread used contributes to the colour of the resulting drink. It is classified as a non-alcoholic drink by Russian standards, as the alcohol content from fermentation is typically low (0.5–1.0%).[http://ostapbenderx.narod.ru/Index/20/2038.htm ГОСТ Р 52409-2005. Продукция безалкогольного и слабоалкогольного производства]  (\"GOST Р 52409-2005. Production of non-alcoholic and mildly alcoholic products\") Ian Spencer Hornsey. A history of beer and brewing, [https://books.google.com/books?id\nQqnvNsgas20C&pgPA8 page 8]. Royal Society of Chemistry, 2003. \"A similar, low alcohol (0.5–1.0%) drink, kvass … may be a 'fossil beer'\". It may be flavoured with fruits such as strawberries and raisins, or with herbs such as mint.\n\nIt is especially popular in most of the North Slavic countries, including Poland, and Serbia, but not the Czech Republic or Slovakia. It is also known in the Baltic countries Latvia, Lithuania, and Estonia. Kvass is also well known throughout Mongolia, Georgia, Azerbaijan, Tajikistan, Kazakhstan, Uzbekistan and Armenia. Many kvass vendors there sell the drink in the streets. Kvass is also popular in Harbin[http://meal.dbw.cn/system/2011/06/15/053227379.shtml 哈尔滨特色饮料“格瓦斯”竞相亮相哈洽会] and Xinjiang, China, where Russian culture has had an influence.\n\nTerminology \n\nThe word kvass is derived from Old Church Slavonic квасъ from Proto-Slavic *kvasъ ('leaven', 'fermented drink') and ultimately from Proto-Indo-European base *kwat- ('sour').http://www.palaeolexicon.com/Word/Show/19826Max Vasmer. Russisches etymologisches Wörterbuch. Winter, Heidelberg, 1953–1958 (in German). Russian translation by Oleg Trubachyov: Этимологический словарь русского языка. Progress, Moscow, 1964–1973. [http://starling.rinet.ru/cgi-bin/response.cgi?basename\n\\data\\ie\\vasmer&text_word%D0%BA%D0%B2%D0%B0%D1%81&method_word\nbeginning&ww_word=on квас]Олег Николааевич Трубачёв и др. Этимологический словарь славянских языков. Академия наук СССР, Москва, т. [http://www.proto-slavic.ru/dic-trubachev/_pdf/trubachev-dic13.pdf 13] (1987), с. 153 (Oleg Trubachyov et al. Etymological dictionary of Slavic languages. USSR Academy of Sciences, Moscow, vol. 13 (1987), p. 153; in Russian) Today the words used are almost the same: in Belarusian: , '; Chinese: , ; Latvian: '; Polish ' ('bread kvass', the adjetive being used to differentiate it from kwas, 'acid'); Russian: , '; in Ukrainian: , . Non-cognates include Lithuanian ' ('beverage', similar to Latvian '), Estonian ', and Finnish '.\n\nHistory \n\nKvass has been a common drink in Eastern Europe since at least the Middle Ages, comparable with other ancient fermented grain beverages including beer brewed from barley by the ancient Egyptians, the pombe or millet beer of Africa, the so-called rice wines of Asia, the chicha made with corn or cassava by the natives of the Americas.Anthropology, By Edward B. Taylor, [https://books.google.com/books?idbK-S4SKTsDkC&pg\nPA268 page 268]. Kvass was invented by the Slavs and became the most popular among East Slavs.[http://www.minrol.gov.pl/pol/Jakosc-zywnosci/Produkty-regionalne-i-tradycyjne/Lista-produktow-tradycyjnych/woj.-lodzkie/Kwas-chlebowy Kwas chlebowy – Tradycja, pochodzenie oraz historia produktu:] Kvass – Tradition, origin and history of the product. \n\nThe word \"kvass\" was first mentioned in the Primary Chronicle, in the description of events of the year 996, following the Christianization of the Kievan Rus'.[http://www.mgh-bibliothek.de/dokumente/a/a011458.pdf The Russian Primary Chronicle, Laurentian Text] , p.121. Translated and edited by Samuel Hazzard Cross and Olgerd P. Sherbowitz-Wetzor. Cambridge, MA: The Mediaeval Academy of America, 1953. According to the Merriam-Webster Dictionary and Oxford English Dictionary the first mention of kvass in an English text took place sometime around 1553.[http://www.merriam-webster.com/dictionary/kvass Kvass] in Merriam Webster Dictionary[http://findwords.info/term/kvass Kvass] in Oxford English Dictionary. c 1553 Chancelour Bk. Emp. Russia in Hakluyt Voy. (1886) III. 51 Their drinke is like our peny Ale, and is called Quass. In Russia, under Peter the Great, it was the most common non-alcoholic drink in every class of society.  William Tooke, describing Russian drinking habits in 1799, stated that \"The most common domestic drink is quas, a liquor prepared from pollard, meal, and bread, or from meal and malt, by an acid fermentation. It is cooling and well-tasted.\"\n\nApart from drinking kvass, families (especially the poor ones) used it as the basis of many dishes they consumed. Traditional cold summertime soups of Russian cuisine, such as okroshka, botvinya and tyurya, are based on kvas. A similar tradition is found in Romanian cuisine, where the liquid used for cooking is made by fermenting wheat or barley  bran and called borș.\n\nKvass was reported to be consumed in excess by peasants, low-class citizens, and monks; in fact, it is sometimes said that it was usual for them to drink more kvass than water. In the 19th century, the kvass industry was created and less natural versions of the drink became increasingly widespread. On the other hand, the popularity of kvass and the market competition led to the emergence of many varieties, which included herbs, fruits and berries. At that time kvass vendors called kvasnik (pl. kvasniki) were on the streets in almost every city. They often specialized in particular kinds of kvass: strawberry kvass, apple kvass, etc.\n\nWhile kvass used to be consumed widely in most Slavic countries, its popularity spread to Latvia and Lithuania. Today it forms the basis of a multimillion-dollar industry, though it has been struggling ever since the introduction of Western soft drinks in Eastern European countries. Kvass was once sold during the summer only, but is now produced, packaged, and sold year-round.[http://www.nzherald.co.nz/business/news/article.cfm?c_id\n3&objectid=10521125 Russia's patriotic kvas drinkers say no to cola-nisation.] The New Zealand Herald. BUSINESS; General. July 12, 2008.\n\nManufacturing \n\nKvass is made by the natural fermentation of bread, such as wheat, rye, or barley, and sometimes flavoured using fruit, berries, raisins, or birch sap collected in the early spring. Modern homemade kvass most often uses black or regular rye bread, usually dried (called plural suhari), baked into croutons, or fried, with the addition of sugar or fruit (e.g. apples or raisins), and with a yeast culture and zakvaska (\"kvass fermentation starter\").\n\nCommercial kvass, especially less expensive varieties, is occasionally made like many other soft drinks, using sugar, carbonated water, malt extract, and flavourings. Better brands, often made by beer rather than soft drink manufacturers, usually use a variation of the traditional process to brew their products. Kvass is commonly served unfiltered, with the yeast still in it, which adds to its unique flavour as well as its high vitamin B content.\n\nRussia \n\nAlthough the introduction of western soft drinks such as Coca-Cola and Pepsi had reduced the commercial sale of kvass in Russia, kvass has been more recently marketed as a \"patriotic\" alternative to cola, sparking a \"kvass revival\". For example, the Russian company Nikola (by coincidence its name sounds like \"not cola\" in Russian) has promoted its brand of kvass with an advertising campaign emphasizing \"anti cola-nisation.\" Moscow-based Business Analytica reported in 2008 that bottled kvass sales had tripled since 2005 and estimated that per-capita consumption of kvass in Russia would reach three liters in 2008. Between 2005 and 2007, cola's share of the Moscow soft drink market fell from 37% to 32%. Meanwhile, kvass' share more than doubled over the same time period, reaching 16% in 2007. In response, Coca-Cola launched its own brand of kvass in May 2008. This is the first time a foreign company has made an appreciable entrance into the Russian kvass market. Pepsi has also signed an agreement with a Russian kvass manufacturer to act as a distribution agent. The development of new technologies for storage and distribution, and heavy advertising, have contributed to this surge in popularity; three new major brands have been introduced since 2004.\n\nMarket shares (2014) \n\nPoland \n\nMuch like in other Eastern European countries, kvass has historical roots in Poland – mainly due to the trade between the Kingdom of Poland and Kievan Rus'. Kvass may have appeared in Poland as early as the 10th century.[http://www.sm.fki.pl/kwaschlebowy.htm Kwas chlebowy – Odrobina historii] Kvass – A little bit of history.  The production of kvass went on for several hundred years, as recipes were passed down from parent to offspring. This continued in the Polish-Lithuanian Commonwealth. It was at first commonly drunk among peasants who worked on the fields and eventually spread to the szlachta (Polish nobility). One example of this is kwas chlebowy sapieżyński kodeński, an old type of Polish kvass that is still sold as a contemporary brand.[http://www.minrol.gov.pl/pol/Jakosc-zywnosci/Produkty-regionalne-i-tradycyjne/Lista-produktow-tradycyjnych/woj.-lubelskie/Kwas-chlebowy-sapiezynski-kodenski Kwas chlebowy sapieżyński kodeński – Tradycja, pochodzenie oraz historia produktu:] Kwas chlebowy sapieżyński kodeński – Tradition, origin and history of the product.  Its origins can be traced back to the 1500s, when Jan Sapieha – a magnate of the House of Sapieha – was granted land by the Polish king. On those lands he founded the town of Kodeń. He then bought the mills and 24 villages of the surrounding areas from their previous landowners. It was then that the taste of kvass became known among the Polish szlachta, who used it for its supposed healing qualities. After the last Partition of the Polish-Lithuanian Commonwealth in 1795, Poland ceased to be an independent state. Throughout the 19th century, kvass remained popular among Poles who lived in the Russian Empire, especially the inhabitants of rural areas.\n\nProduction of the beverage in Poland on an industrial scale can be traced back to the more recent interwar period, when the Polish state regained independence as the Second Polish Republic. In interwar Poland, kvass was brewed and sold in mass numbers by magnates of the Polish drinks market like the Varsovian brewery Haberbusch i Schiele or the Karpiński company.[http://zb.eco.pl/zb/140/zdrowie.htm Alternatywa dla Coca Coli?] Information regarding kvass in Interwar Poland. Kvass was exceptionally popular in Eastern Poland,[http://www.kwaschlebowy.eu/sites/default/files/broszury/ulotka_kwas_chlebowy_0.jpg Broszura o naturalnym kwasie chlebowym] Booklet about natural kvass.  partly due to the plentiful numbers of Belarusian and Ukrainian minorities that lived there. However, with the collapse of many prewar businesses and much of the Polish industry during World War II, kvass lost popularity following the aftermath of the war. It was reintroduced industrially after the formation of the People's Republic of Poland as a satellite state of the USSR, though much like in other Slavic and Baltic countries it lost favour upon the introduction of Coca-Cola onto the Eastern European market and once again during the economic crisis of the 1980s in Poland. The collapse of the Eastern Bloc between 1989–1991 was followed by the arrival of other Western soft-drinks in former Soviet countries. Even though kvass isn't as popular as it used to be, it is gaining more and more popularity once again.\n\nAlthough not as popular in Poland nowadays as it is in Russia or Ukraine, kvass can still be found in many supermarkets and grocery shops throughout the nation where it is known in Polish as kwas chlebowy. Commercial bottled versions of the drink are the most common variant, as there are companies that specialize in manufacturing a more modern version of the drink (some variants are manufactured in Poland whilst others are imported from its neighbouring countries, Lithuania and Ukraine being the most popular source.[http://gerima.pl/index.html Gerima dystrybutor kwasu chlebowego w Polsce] Gerima – distributor of kvass in Poland.  However, recipes for a traditional version of kvass exist; some of them originate from Eastern Poland.[http://www.lubelskie.pl/?pid647 Kwas chlebowy sapieżyński kodeński] Information about traditional Polish kvass. [http://www.mniammniam.com/Kwas_chlebowy-8595p.html Przepis na domowy kwas chlebowy] Recipe for home-made kvass.  Although commercial kvass is much easier to find in Polish shops, Polish manufacturers of more natural and healthier variants of kvass have become increasingly popular both within and outside of the country's borders – one good example being a company that has made itself known not only on the Polish market, but also in Slovakia.[http://www.dzienniklodzki.pl/artykul/160252,ich-kwas-chlebowy-podbija-rynek,id,t.html?cookie\n1 Ich kwas chlebowy podbija rynek] News article about Polish manufacturers of kvass made from traditional recipes.[http://www.kwaschlebowy.eu/ Oficjalna strona firmy Eko-Natura] Official website of Polish traditional kvass manufacturer. [http://lokalnazywnosc.pl/eko-natura-producent-kwasu-chlebowego Eko-Natura – producent kwasu chlebowego] More information about Polish kvass manufacturer.  Street vendors selling fresh kvass also appear from time to time, especially during summer in cities like Zakopane, where tourists sometimes crowd the streets seeking refreshment on a hot day.\n\nLatvia and Lithuania \n\nAfter the fall of the Soviet Union in 1991, the street vendors disappeared from the streets of Latvia due to new health laws that banned its sale on the street. Economic disruptions forced many kvass factories to close. The Coca-Cola Company moved in and quickly dominated the market for soft drinks. In 1998 the local soft drink industry adapted by selling bottled kvass and launching aggressive marketing campaigns. This surge in sales was stimulated by the fact that kvass sold for about half the price of Coca-Cola. In just three years, kvass constituted as much as 30% of the soft drink market in Latvia, while the market share of Coca-Cola fell from 65% to 44%. The Coca-Cola company had losses in Latvia of about $1 million in 1999 and 2000. The situation was similar in the other Baltic countries and Russia. Coca-Cola responded by buying kvass manufacturers as well as making kvass at their own soft drink plants.[http://www.latvians.com/en/Mailer/envelope.php?2001_06_02.htm#news6 Latvian Mailer – June 2, 2001][http://www.coca-colahbc.com/country/files/en/baltics/promarket.html Coca-Cola HBC – Products and Marketing]\n\nIn Lithuania kvass is known as gira and is widely available in bottles and draft. Many restaurants in Vilnius make their own gira, which they sell on the premises. Strictly speaking, gira can be made from anything fermentable — such as caraway tea, beetroot juice, or berries — but it is made mainly from black bread or barley/rye malt.\n\nElsewhere \n\nThe only breweries in the United States that brew kvass all year round are the [http://www.beaverbrewingcompany.com/beers-2/kvas Beaver Brewing Company] in Beaver Falls, Pennsylvania, where it is made with the addition of raisins and lemons, and Kolokol kvass in Helena, Montana, using traditional ingredients (water, sugar, rye bread, yeast). Iggy's Foods, LLC, a company based in Bainbridge Island, Washington, produces a live, cultured raw-food Ginger Beet kvass made with beets, Hawaiian ginger, limes, and Himalayan sea salt. [https://thebrinery.com/ The Brinery], a wholesale fermenter in Ann Arbor, Michigan, sells beet and tomato kvass as well as seasonal varieties.\n\nIn the United Kingdom, kvass is practically unknown, as there are no cultural ties to it within the nation's history and there are no renowned kvass breweries in the country. However, with the influx of immigrants following the 2004 enlargement of the European Union, a number of stores selling cuisine and beverages from Eastern Europe cropped up throughout the UK, many of them storing kvass on their shelves.[http://www.polnews.co.uk/index.php/polskie-uslugi/1246-nowa-malgosias-polski-sklep-w-newcastle.html Polski sklep w Newcastle] News article about a Polish shop in the North East of England.\n\nIn Canada, [http://allstarsbakery.com/prod11.html All Stars Bakery] of Concord, Ontario produce kvas in the traditional method. Commercial Kvas products requiring no refrigeration on the shelf are available at various Eastern European grocery stores in Toronto and surrounding areas, such as [http://www.starskycanada.com/ Starsky Fine Foods].\n\nNutrition \n\nAs its primary ingredient is rye, kvass is a good source of vitamin B-1 and B-6, magnesium, phosphorus, amino acids, and pantothenate. It is also rich in lactic acid and simple sugars, which contributes to its pleasant, thirst-quenching taste, provides ample calories to fuel physical activity, and may improve digestion, as with other lacto-fermented foods such as yogurt and sauerkraut.\n\nCultural references \n\nThe name of Kvasir, a wise being in Norse mythology, is possibly related to kvass.Александр Николаевич Афанасьев (1865–1869). Поэтические воззрения славян на природу. Директ-медиа (2014) том. 1, стр. [https://books.google.de/books?idr-d3BAAAQBAJ&q\nквасир&ffalse 260].  (Alexander Afanasyev. The Poetic Outlook of Slavs about Nature, 1865–1869; reprinted 2014, p. 260; in Russian)Karl Joseph Simrock. Handbuch der deutschen Mythologie mit Einschluss der nordischen, 1st edition (1855), p. [https://books.google.de/books?id\nEhxBAAAAcAAJ&hlen&pg\nPA272#vonepage&f\nfalse 272] or 2nd edition (1864), p. [http://babel.hathitrust.org/cgi/pt?idhvd.32044089074793;view\n1up;seq258 244]. Bonn, Marcus.Jooseppi Julius Mikkola. Bidrag till belysning af slaviska lånord i nordiska språk. Arkiv för nordisk filologi, vol. 19 (1903), p. [http://runeberg.org/anf/1903/0339.html 331].Georges Dumézil (1974). Gods of the Ancient Northmen, p. [https://books.google.de/books?id\nrurD1yd0Ok0C&hlen&q\nkvas%20kvasir 21]. University of California Press. Jan de Vries (2000). Altnordisches etymologisches Wörterbuch, p. [https://books.google.de/books?idso8eAAAAIAAJ&pg\nPA319&hlen&q\nkvasir&f=false 336]. 4th edition, Leiden (in German)\n\nThe Russian expression  \"Перебиваться с хлеба на квас\" (literally \"to clamber from bread to kvass\") means to barely make ends meet, remotely similar to (and may be translated as) the expression \"to be on the breadline\". To better understand the Russian phrase one has to know that in poor families kvass was made from stale leftovers of rye brecanaad.Svyatoslav Loginov, [http://www.rusf.ru/loginov/books/story07.htm \"We Used to Bake Blini...\" (\"Бывало пекли блины...\")] \n\nIn Fyodor Dostoyevsky's The Brothers Karamazov, monastery kvass is mentioned in the dinner scene as being famous throughout the neighborhood.The Brothers Karamazov. Fyodor Dostoevsky. p. 85. Farrar, Straus and Giroux (June 14, 2002). . In Leo Tolstoy's The Death of Ivan Ilyich, kvass is made first thing on a holiday morning.The Death of Ivan Ilyich. Leo Tolstoy. p. 127 Penguin Classics (May 27, 2008). . In Ivan Goncharov's Oblomov and in Tolstoy's Anna Karenina, kvass is repeatedly mentioned. In Tolstoy's War and Peace, French soldiers are aware of kvass on entering Moscow, enjoying it but referring to it as \"pig's lemonade\".War and Peace. Leo Tolstoy. Book 10, chapter 29,  Pennsylvania State University translation. In Anton Chekhov's The Cherry Orchard, kvass is mentioned early in the play, \"Bring me some kvass, would you?\"The Cherry Orchard. Anton Chekhov. Translated by Tom Stoppard. Grove Press, 2009 In Sholem Aleichem's Motl, Peysi the Cantor's Son, diluted kvass is the focus of one of Motl's older brother's get-rich-quick schemes.\n\nIn Joris-Karl Huysmans' Against Nature (À rebours) the protagonist Jean Des Esseintes serves kvass, along with porter and stout, for a funeral banquet \"in memory of the host's virility, lately but only temporarily deceased.\"J.-K. Huysmans, Against Nature, trans. Robert Baldick, New York: Penguin Books, 1959.  In Jules Verne's 1896 novel Michael Strogoff, Courier of the Czar, the titular character drinks kvass when he stops to change horses at post stations on his way to Siberia. Kvass has also appeared in Russian fantasy novels, such as the 2008 Twilight Watch.\n\nSimilar beverages \n\nOther beverages from around the world that are traditionally low-alcohol and lacto-fermented include:\n\n* Tepache\n* Boza\n* Chicha\n* Ibwatu\n* Kombucha\n* Malta\n* Palm wine\n* Rivella\n* Brottrunk. Kvass. http://en.wikipedia.org/?curid=16971."
  }
}
