{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9450",
  "eid" : "ef1044f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778480831,
  "textBody" : "An electrical telegraph is a telegraph that uses electrical signals, usually conveyed via dedicated telecommunication lines or radio.\n\nThe electrical telegraph, or more commonly just telegraph, superseded optical semaphore telegraph systems, thus becoming the first form of electrical telecommunications. In a matter of decades after their creation in the 1830s, electrical telegraph networks permitted people and commerce to transmit messages across both continents and oceans almost instantly, with widespread social and economic impacts.\n\nHistory \n\nEarly work\n\nFrom early studies of electricity, electrical phenomena were known to travel with great speed, and many experimenters worked on the application of electricity to communications at a distance.\n\t \t\nAll the known effects of electricity - such as sparks, electrostatic attraction, chemical changes, electric shocks, and later electromagnetism - were applied to the problems of detecting controlled transmissions of electricity at various distances.\n\t\nIn 1753, an anonymous writer in the Scots Magazine suggested an electrostatic telegraph. Using one wire for each letter of the alphabet, a message could be transmitted by connecting the wire terminals in turn to an electrostatic machine, and observing the deflection of pith balls at the far end.E. A. Marland, Early Electrical Communication, Abelard-Schuman Ltd, London 1964, no ISBN, Library of Congress 64-20875, pages 17-19; Telegraphs employing electrostatic attraction were the basis of early experiments in electrical telegraphy in Europe, but were abandoned as being impractical and were never developed into a useful communication system.\n\nIn 1774, Georges-Louis Le Sage realised an early electric telegraph. The telegraph had a separate wire for each of the 26 letters of the alphabet and its range was only between two rooms of his home.Prevost, 1805, pp. 176-178\n\nIn 1800, Alessandro Volta invented the voltaic pile, allowing for a continuous current of electricity for experimentation. This became a source of a low-voltage current that could be used to produce more distinct effects, and which was far less limited than the momentary discharge of an electrostatic machine, which with Leyden jars were the only previously known man-made sources of electricity.\n\t \t\nAnother very early experiment in electrical telegraphy was an 'electrochemical telegraph' created by the German physician, anatomist and inventor Samuel Thomas von Sömmering in 1809, based on an earlier, less robust design of 1804 by Spanish polymath and scientist Francisco Salva Campillo. Both their designs employed multiple wires (up to 35) to represent almost all Latin letters and numerals. Thus, messages could be conveyed electrically up to a few kilometers (in von Sömmering's design), with each of the telegraph receiver's wires immersed in a separate glass tube of acid. An electric current was sequentially applied by the sender through the various wires representing each digit of a message; at the recipient's end the currents electrolysed the acid in the tubes in sequence, releasing streams of hydrogen bubbles next to each associated letter or numeral. The telegraph receiver's operator would watch the bubbles and could then record the transmitted message.Jones, R. Victor [http://people.seas.harvard.edu/~jones/cscie129/images/history/von_Soem.html Samuel Thomas von Sömmering's \"Space Multiplexed\" Electrochemical Telegraph (1808-10)], Harvard University website. Attributed to \"[https://books.google.com/books?idOxc7AAAAMAAJ&q\nSemaphore+to+Satellite,Published+by+the+International+Telecommunication+Union,+Geneva+1965&dqSemaphore+to+Satellite,Published+by+the+International+Telecommunication+Union,+Geneva+1965&ei\nXdL9SfrCIoOgNcChzLkK Semaphore to Satellite]\" , International Telecommunication Union, Geneva 1965. Retrieved 2009-05-01 This is in contrast to later telegraphs that used a single wire (with ground return).\n\t \t\nHans Christian Ørsted discovered in 1820 that an electric current produces a magnetic field which will deflect a compass needle. In the same year Johann Schweigger invented the galvanometer, with a coil of wire around a compass, which could be used as a sensitive indicator for an electric current. In 1821, André-Marie Ampère suggested that telegraphy could be done by a system of galvanometers, with one wire per galvanometer to indicate each letter, and said he had experimented successfully with such a system. \nIn 1824, Peter Barlow said that such a system only worked to a distance of about 200 ft, and so was impracticalM. (2014, December 10). Schweigger Multiplier – 1820. Retrieved February 07, 2018, from https://nationalmaglab.org/education/magnet-academy/history-of-electricity-magnetism/museum/schweigger-multiplier.\n\t \t\nIn 1825, William Sturgeon invented the electromagnet, with a single winding of uninsulated wire on a piece of varnished iron, which increased the magnetic force produced by electric current. Joseph Henry improved it in 1828 by placing several windings of insulated wire around the bar, creating a much more powerful electromagnet which could operate a telegraph through the high resistance of long telegraph wires. During his tenure at The Albany Academy from 1826 to 1832, Henry first demonstrated the theory of the 'magnetic telegraph' by ringing a bell through a mile of wire strung around the room.\n\t \t\nIn 1835, Joseph Henry and Edward Davy invented the critical electrical relay. Davy's relay used a magnetic needle which dipped into a mercury contact when an electric current passed through the surrounding coil. This allowed a weak current to switch a larger current to operate a powerful local electromagnet over very long distances. Davy demonstrated his telegraph system in Regent's Park in 1837 and was granted a patent on 4 July 1838. He also developed an electric relay.\n\nFirst working systems\n\nThe first working telegraph was built by the English inventor Francis Ronalds in 1816 and used static electricity.  At the family home on Hammersmith Mall, he set up a complete subterranean system in a 175 yard long trench as well as an eight mile long overhead telegraph.  The lines were connected at both ends to revolving dials marked with the letters of the alphabet and electrical impulses sent along the wire were used to transmit messages.  Offering his invention to the Admiralty in July 1816, it was rejected as “wholly unnecessary”.  His account of the scheme and the possibilities of rapid global communication in Descriptions of an Electrical Telegraph and of some other Electrical Apparatus was the first published work on electric telegraphy and even described the risk of signal retardation due to induction.  Elements of Ronalds’ design were utilised in the subsequent commercialisation of the telegraph over 20 years later.\n\nThe telegraph invented by Baron Schilling von Canstatt in 1832 had a transmitting device which consisted of a keyboard with 16 black-and-white keys. These served for switching the electric current. The receiving instrument consisted of six galvanometers with magnetic needles, suspended from silk threads. Both stations of Schilling's telegraph were connected by eight wires; six were connected with the galvanometers, one served for the return current and one for a signal bell. When at the starting station the operator pressed a key, the corresponding pointer was deflected at the receiving station. Different positions of black and white flags on different disks gave combinations which corresponded to the letters or numbers. Pavel Schilling subsequently improved its apparatus. He reduced the number of connecting wires from eight to two.\n\t \t\nOn 21 October 1832, Schilling managed a short-distance transmission of signals between two telegraphs in different rooms of his apartment. In 1836, the British government attempted to buy the design but Schilling instead accepted overtures from Nicholas I of Russia. Schilling's telegraph was tested on a 5 km experimental underground and underwater cable, laid around the building of the main Admiralty in Saint Petersburg and was approved for a telegraph between the imperial palace at Peterhof and the naval base at Kronstadt. However, the project was cancelled following Schilling's death in 1837.Huurdeman, A.A., The worldwide history of telecommunications, p.54, Wiley-IEEE, 2003  Schilling was also one of the first to put into practice the idea of the binary system of signal transmission.\n\t\nIn 1833, Carl Friedrich Gauss, together with the physics professor Wilhelm Weber in Göttingen installed a 1200 m wire above the town's roofs. Gauss combined the Poggendorff-Schweigger multiplicator with his magnetometer to build a more sensitive device, the galvanometer. To change the direction of the electric current, he constructed a commutator of his own. As a result, he was able to make the distant needle move in the direction set by the commutator on the other end of the line.\n\nAt first, Gauss and Weber used the telegraph to coordinate time, but soon they developed other signals; finally, their own alphabet. The alphabet was encoded in a binary code which was transmitted by positive or negative voltage pulses which were generated by means of moving an induction coil up and down over a permanent magnet and connecting  the coil with the transmission wires by means of the commutator. The page of Gauss' laboratory notebook containing both his code and the first message transmitted, as well as a replica of the telegraph made in the 1850s under the instructions of Weber are kept in the faculty of physics at the University of Göttingen, in Germany.\n\nGauss was convinced that this communication would be a help to his kingdom's towns. Later in the same year, instead of a Voltaic pile, Gauss used an induction pulse, enabling him to transmit seven letters a minute instead of two. The inventors and university were too poor to develop the telegraph on their own, but they received funding from Alexander von Humboldt. Carl August Steinheil in Munich was able to build a telegraph network within the city in 1835-6. He installed a telegraph line along the first German railroad in 1835.\n\nIn 1836, an American scientist, Dr. David Alter, invented the first known American electric telegraph, in Elderton, Pennsylvania, one year before the Morse telegraph. Alter demonstrated it to witnesses but never developed the idea into a practical system.Popular Science, February 1882, vol.20, no.28, p.568, Bonnier Corporation,  . When Alter was interviewed for the book Biographical and Historical Cyclopedia of Indiana and Armstrong Counties, he said: \"I may say that there is no connection at all between the telegraph of Morse and others and that of myself.... Professor Morse most probably never heard of me or my Elderton telegraph.\"\n\nSamuel Morse independently developed and patented a recording electric telegraph in 1837. Morse's assistant Alfred Vail developed an instrument that was called the register for recording the received messages. It embossed dots and dashes on a moving paper tape by a stylus which was operated by an electromagnet. Morse and Vail developed the Morse code signalling alphabet. The first telegram in the United States was sent by Morse on 11 January 1838, across 2 mi of wire at Speedwell Ironworks near Morristown, New Jersey, although it was only later, in 1844, that he sent the message \"WHAT HATH GOD WROUGHT?\" over the 44 mi from the Capitol in Washington to the old Mt. Clare Depot in Baltimore.Howe, p. 7\n\nCommercial telegraphy \n\nCooke and Wheatstone system\n\nThe first commercial electrical telegraph, the Cooke and Wheatstone telegraph, was co-developed by William Fothergill Cooke and Charles Wheatstone. In May 1837 they patented a telegraph system which used a number of needles on a board that could be moved to point to letters of the alphabet.  The patent recommended a five-needle system, but any number of needles could be used depending on the number of characters it was required to code.  A four-needle system was installed between Euston and Camden Town in London on a rail line being constructed by Robert Stephenson between London and Birmingham.  It was successfully demonstrated on 25 July 1837.[http://www.connected-earth.com/journeys/Firstgenerationtechnologies/Thetelegraph/Thetelegraphicagedawns/index.htm The telegraphic age dawns] BT Group Connected Earth Online Museum. Accessed December 2010, [https://www.webcitation.org/6EKr7FUkw archived] 10 Feb 2013 Euston needed to signal to an engine house at Camden Town to start hauling the locomotive up the incline.  As at Liverpool, the electric telegraph was in the end rejected in favour of a pneumatic system with whistles.Bowers, page 129\n\nCooke and Wheatstone had their first commercial success with a system installed on the Great Western Railway over the 13 mi from Paddington station to West Drayton in 1838, the first commercial telegraph in the world.Huurdeman, page 67  This was a five-needle, six-wire system.  The cables were originally installed underground in a steel conduit.  However, the cables soon began to fail as a result of deteriorating insulation and were replaced with uninsulated wires on poles.Huurdeman, pages 67–68Beauchamp, page 35  As an interim measure, a two-needle system was used with three of the remaining working underground wires, which despite using only two needles had a greater number of codes.Mercer, page 7  But when the line was extended to Slough in 1843, a one-needle, two-wire system was installed.Huurdeman, page 69\n\nFrom this point the use of the electric telegraph started to grow on the new railways being built from London.  The London and Blackwall Railway (another rope-hauled application) was equipped with the Cooke and Wheatstone telegraph when it opened in 1840, and many others followed.Beauchamp, page 35  The one-needle telegraph proved highly successful on British railways, and 15,000 sets were still in use at the end of the nineteenth century.  Some remained in service in the 1930s.Huurdeman, pages 67–69  In September 1845 the financier John Lewis Ricardo and Cooke formed the Electric Telegraph Company, the first public telegraphy company in the world.  This company bought out the Cooke and Wheatstone patents and solidly established the telegraph business.Nichols, John (1967). The Gentleman's magazine, Volumes 282–283. p. 545. University of California\n\nMorse system\n\nIn the United States, the Morse/Vail telegraph was quickly deployed in the two decades following the first demonstration. The overland telegraph connected the west coast of the continent to the east coast by 24 October 1861, bringing an end to the Pony Express.Today in History - October 24, [https://www.loc.gov/item/today-in-history/october-24 The Transcontinental Telegraph and the End of the Pony Express], Library of Congress, retrieved 3 February 2017.\n\nAs well as the rapid expansion of the use of the telegraphs along the railways, they soon spread into the field of mass communication with the instruments being installed in post offices. The era of mass personal communication had begun.\n\nTelegraphic improvements\n\nA continuing goal in telegraphy was to reduce the cost per message by reducing hand-work, or increasing the sending rate. There were many experiments with moving pointers, and various electrical encodings. However, most systems were too complicated and unreliable. A successful expedient to reduce the cost per message was the development of telegraphese.\n\nThe first system that didn't require skilled technicians to operate, was Charles Wheatstone's ABC system in 1840 where the letters of the alphabet were arranged around a clock-face, and the signal caused a needle to indicate the letter. This early system required the receiver to be present in real time to record the message and it reached speeds of up to 15 words a minute.\n\nIn 1846, Alexander Bain patented a chemical telegraph in Edinburgh. The signal current moved an iron pen across a moving paper tape soaked in a mixture of ammonium nitrate and potassium ferrocyanide, decomposing the chemical and producing readable blue marks in Morse code. The speed of the printing telegraph was 1000 words per hour, but messages still required translation into English by live copyists. Chemical telegraphy came to an end in the US in 1851, when the Morse group defeated the Bain patent in the US District Court.Oslin, George P. The Story of Telecommunications, Mercer University Press, 1992. 69.\n\nFor a brief period, starting with the New York-Boston line in 1848, some telegraph networks began to employ sound operators, who were trained to understand Morse code aurally. Gradually, the use of sound operators eliminated the need for telegraph receivers to include register and tape. Instead, the receiving instrument was developed into a \"sounder\", an electromagnet that was energized by a current and attracted a small iron lever. When the sounding key was opened or closed, the sounder lever struck an anvil. The Morse operator distinguished a dot and a dash by the short or long interval between the two clicks. The message was then written out in long-hand.Oslin, George P. The Story of Telecommunications. Mercer University Press, 1992. 67\n\nRoyal Earl House developed and patented a letter-printing telegraph system in 1846 which employed an alphabetic keyboard for the transmitter and automatically printed the letters on paper at the receiver, and followed this up with a steam-powered version in 1852. Advocates of printing telegraphy said it would eliminate Morse operators' errors. The House machine was used on four main American telegraph lines by 1852. The speed of the House machine was announced as 2600 words an hour.Oslin, George, P. The Story of Telecommunications, 1992. 71\n\nDavid Edward Hughes invented the printing telegraph in 1855; it used a keyboard of 26 keys for the alphabet and a spinning type wheel that determined the letter being transmitted by the length of time that had elapsed since the previous transmission. The system allowed for automatic recording on the receiving end. The system was very stable and accurate and became the accepted around the world.\n\nThe next improvement was the Baudot code of 1874. French engineer Émile Baudot patented a printing telegraph in which the signals were translated automatically into typographic characters. Each character was assigned a five-bit code, mechanically interpreted from the state of five on/off switches. Operators had to maintain a steady rhythm, and the usual speed of operation was 30 words per minute.\n\nBy this point reception had been automated, but the speed and accuracy of the transmission was still limited to the skill of the human operator. The first practical automated system was patented by Charles Wheatstone, the original inventor of the telegraph. The message (in Morse code) was typed onto a piece of perforated tape using a keyboard-like device called the 'Stick Punch'. The transmitter automatically ran the tape through and transmitted the message at the then exceptionally high speed of 70 words per minute.\n\nTeleprinters\n\nAn early successful teleprinter was invented by Frederick G. Creed. In Glasgow he created his first keyboard perforator, which used compressed air to punch the holes. He also created a reperforator (receiving perforator) and a printer. The reperforator punched incoming Morse signals on to paper tape and the printer decoded this tape to produce alphanumeric characters on plain paper. This was the origin of the Creed High Speed Automatic Printing System, which could run at an unprecedented 200 words per minute. His system was adopted by the Daily Mail for daily transmission of the newspaper contents.\n\nBy the 1930s teleprinters were being produced by Teletype in the US, Creed in Britain and Siemens in Germany.\n\nWith the invention of the teletypewriter, telegraphic encoding became fully automated. Early teletypewriters used the ITA-1 Baudot code, a five-bit code. This yielded only thirty-two codes, so it was over-defined into two \"shifts\", \"letters\" and \"figures\". An explicit, unshared shift code prefaced each set of letters and figures.\n\nBy 1935, message routing was the last great barrier to full automation. Large telegraphy providers began to develop systems that used telephone-like rotary dialling to connect teletypewriters. These machines were called \"Telex\" (TELegraph EXchange). Telex machines first performed rotary-telephone-style pulse dialling for circuit switching, and then sent data by ITA2. This \"type A\" Telex routing functionally automated message routing.\n\nThe first wide-coverage Telex network was implemented in Germany during the 1930s as a network used to communicate within the government.\n\nAt the rate of 45.45 (±0.5%) baud — considered speedy at the time — up to 25 telex channels could share a single long-distance telephone channel by using voice frequency telegraphy multiplexing, making telex the least expensive method of reliable long-distance communication.\n\nAutomatic teleprinter exchange service was introduced into Canada by CPR Telegraphs and CN Telegraph in July 1957 and in 1958, Western Union started to build a Telex network in the United States.Phillip R. Easterlin, \"Telex in New York\", Western Union Technical Review, April 1959: 45\n\nOceanic telegraph cables\n\nSoon after the first successful telegraph systems were operational, the possibility of transmitting messages across the sea by way of submarine communications cables was first mooted. One of the primary technical challenges was to sufficiently insulate the submarine cable to prevent the current from leaking out into the water. In 1842, a Scottish surgeon William Montgomerie introduced gutta-percha, the adhesive juice of the Palaquium gutta tree, to Europe. Michael Faraday and Wheatstone soon discovered the merits of gutta-percha as an insulator, and in 1845, the latter suggested that it should be employed to cover the wire which was proposed to be laid from Dover to Calais. It was tried on a wire laid across the Rhine between Deutz and Cologne. In 1849, C.V. Walker, electrician to the South Eastern Railway, submerged a two-mile wire coated with gutta-percha off the coast from Folkestone, which was tested successfully.\n\nJohn Watkins Brett, an engineer from Bristol, sought and obtained permission from Louis-Philippe in 1847 to establish telegraphic communication between France and England. The first undersea cable was laid in 1850, connecting the two countries and was followed by connections to Ireland and the Low Countries.\n\nThe Atlantic Telegraph Company was formed in London in 1856 to undertake to construct a commercial telegraph cable across the Atlantic Ocean. It was successfully completed on 18 July 1866 by the ship SS Great Eastern, captained by Sir James Anderson after many mishaps along the away.Wilson, Arthur (1994). The Living Rock: The Story of Metals Since Earliest Times and Their Impact on Civilization. p. 203. Woodhead Publishing. . Earlier transatlantic submarine cables installations were attempted in 1857, 1858 and 1865. The 1857 cable only operated intermittently for a few days or weeks before it failed. The study of underwater telegraph cables accelerated interest in mathematical analysis of very long transmission lines. The telegraph lines from Britain to India were connected in 1870 (those several companies combined to form the Eastern Telegraph Company in 1872).\n\nAustralia was first linked to the rest of the world in October 1872 by a submarine telegraph cable at Darwin.Briggs, Asa and Burke, Peter: \"A Social History of the Media: From Gutenberg to the Internet\", p110. Polity, Cambridge, 2005. This brought news reportage from the rest of the world.Conley, David and Lamble, Stephen (2006) The Daily Miracle: An introduction to Journalism,(Third Edition) Oxford University Press, Australia pp. 305-307 The telegraph across the Pacific was completed in 1902, finally encircling the world.\n\nFrom the 1850s until well into the 20th century, British submarine cable systems dominated the world system. This was set out as a formal strategic goal, which became known as the All Red Line. In 1896, there were thirty cable laying ships in the world and twenty-four of them were owned by British companies. In 1892, British companies owned and operated two-thirds of the world's cables and by 1923, their share was still 42.7 percent.Headrick, D.R., & Griset, P. (2001). Submarine telegraph cables: business and politics, 1838-1939. The Business History Review, 75(3), 543-578. During World War I, Britain's telegraph communications were almost completely uninterrupted, while it was able to quickly cut Germany's cables worldwide.\n\nThe harmonic telegraph\n\nThe most expensive aspect of a telegraph system was the installation – the laying of the wire, which was often very long. The costs would be better covered by finding a way to send more than one message at a time through the single wire, thus increasing revenue per wire. In the latter half of the 1800s, several inventors worked towards creating a method for doing just that, including: Charles Bourseul, Thomas Edison, Elisha Gray, and Alexander Graham Bell.  \nOne approach was to have oscillators of several different frequencies act as carriers of a modulated on-off signal (see frequency-division multiplexing).  These various frequencies, referred to as harmonics, could then be combined into one complex signal and sent down the single wire.  On the receiving end, the frequencies would be separated with a matching set of oscillators.  With a set of frequencies being carried down a single wire, it was realized that the human voice itself could be transmitted electrically through the wire.  This effort led to the invention of the telephone.  (While the work toward packing multiple telegraph signals onto one wire led to telephony, later advances would pack multiple voice signals onto one wire by increasing the bandwidth by modulating frequencies much higher than human hearing.  Eventually the bandwidth was widened much further by using laser light signals sent through fiber optic cables.  Fiber optic transmission can carry thousands of telegraph signals simultaneously down a single line.)\n\nEnd of the telegraph era\n\nIn the United States, Western Union discontinued all telegram and commercial messaging services on 27 January 2006,Wheen, Andrew. DOT-DASH TO DOT.COM: How Modern Telecommunications Evolved from the Telegraph to the Internet (Springer, 2011), p259 although it still offered its electronic money transfer services.\n\nIndia's state-owned telecom company, BSNL, ended its telegraph service on 14 July 2013. It was reportedly the world's last existing true electric telegraph system.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Electrical telegraph" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9450" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "An electrical telegraph is a telegraph that uses electrical signals, usually conveyed via dedicated telecommunication lines or radio.\n\nThe electrical telegraph, or more commonly just telegraph, superseded optical semaphore telegraph systems, thus becoming the first form of electrical telecommunications. In a matter of decades after their creation in the 1830s, electrical telegraph networks permitted people and commerce to transmit messages across both continents and oceans almost instantly, with widespread social and economic impacts.\n\nHistory \n\nEarly work\n\nFrom early studies of electricity, electrical phenomena were known to travel with great speed, and many experimenters worked on the application of electricity to communications at a distance.\n\t \t\nAll the known effects of electricity - such as sparks, electrostatic attraction, chemical changes, electric shocks, and later electromagnetism - were applied to the problems of detecting controlled transmissions of electricity at various distances.\n\t\nIn 1753, an anonymous writer in the Scots Magazine suggested an electrostatic telegraph. Using one wire for each letter of the alphabet, a message could be transmitted by connecting the wire terminals in turn to an electrostatic machine, and observing the deflection of pith balls at the far end.E. A. Marland, Early Electrical Communication, Abelard-Schuman Ltd, London 1964, no ISBN, Library of Congress 64-20875, pages 17-19; Telegraphs employing electrostatic attraction were the basis of early experiments in electrical telegraphy in Europe, but were abandoned as being impractical and were never developed into a useful communication system.\n\nIn 1774, Georges-Louis Le Sage realised an early electric telegraph. The telegraph had a separate wire for each of the 26 letters of the alphabet and its range was only between two rooms of his home.Prevost, 1805, pp. 176-178\n\nIn 1800, Alessandro Volta invented the voltaic pile, allowing for a continuous current of electricity for experimentation. This became a source of a low-voltage current that could be used to produce more distinct effects, and which was far less limited than the momentary discharge of an electrostatic machine, which with Leyden jars were the only previously known man-made sources of electricity.\n\t \t\nAnother very early experiment in electrical telegraphy was an 'electrochemical telegraph' created by the German physician, anatomist and inventor Samuel Thomas von Sömmering in 1809, based on an earlier, less robust design of 1804 by Spanish polymath and scientist Francisco Salva Campillo. Both their designs employed multiple wires (up to 35) to represent almost all Latin letters and numerals. Thus, messages could be conveyed electrically up to a few kilometers (in von Sömmering's design), with each of the telegraph receiver's wires immersed in a separate glass tube of acid. An electric current was sequentially applied by the sender through the various wires representing each digit of a message; at the recipient's end the currents electrolysed the acid in the tubes in sequence, releasing streams of hydrogen bubbles next to each associated letter or numeral. The telegraph receiver's operator would watch the bubbles and could then record the transmitted message.Jones, R. Victor [http://people.seas.harvard.edu/~jones/cscie129/images/history/von_Soem.html Samuel Thomas von Sömmering's \"Space Multiplexed\" Electrochemical Telegraph (1808-10)], Harvard University website. Attributed to \"[https://books.google.com/books?idOxc7AAAAMAAJ&q\nSemaphore+to+Satellite,Published+by+the+International+Telecommunication+Union,+Geneva+1965&dqSemaphore+to+Satellite,Published+by+the+International+Telecommunication+Union,+Geneva+1965&ei\nXdL9SfrCIoOgNcChzLkK Semaphore to Satellite]\" , International Telecommunication Union, Geneva 1965. Retrieved 2009-05-01 This is in contrast to later telegraphs that used a single wire (with ground return).\n\t \t\nHans Christian Ørsted discovered in 1820 that an electric current produces a magnetic field which will deflect a compass needle. In the same year Johann Schweigger invented the galvanometer, with a coil of wire around a compass, which could be used as a sensitive indicator for an electric current. In 1821, André-Marie Ampère suggested that telegraphy could be done by a system of galvanometers, with one wire per galvanometer to indicate each letter, and said he had experimented successfully with such a system. \nIn 1824, Peter Barlow said that such a system only worked to a distance of about 200 ft, and so was impracticalM. (2014, December 10). Schweigger Multiplier – 1820. Retrieved February 07, 2018, from https://nationalmaglab.org/education/magnet-academy/history-of-electricity-magnetism/museum/schweigger-multiplier.\n\t \t\nIn 1825, William Sturgeon invented the electromagnet, with a single winding of uninsulated wire on a piece of varnished iron, which increased the magnetic force produced by electric current. Joseph Henry improved it in 1828 by placing several windings of insulated wire around the bar, creating a much more powerful electromagnet which could operate a telegraph through the high resistance of long telegraph wires. During his tenure at The Albany Academy from 1826 to 1832, Henry first demonstrated the theory of the 'magnetic telegraph' by ringing a bell through a mile of wire strung around the room.\n\t \t\nIn 1835, Joseph Henry and Edward Davy invented the critical electrical relay. Davy's relay used a magnetic needle which dipped into a mercury contact when an electric current passed through the surrounding coil. This allowed a weak current to switch a larger current to operate a powerful local electromagnet over very long distances. Davy demonstrated his telegraph system in Regent's Park in 1837 and was granted a patent on 4 July 1838. He also developed an electric relay.\n\nFirst working systems\n\nThe first working telegraph was built by the English inventor Francis Ronalds in 1816 and used static electricity.  At the family home on Hammersmith Mall, he set up a complete subterranean system in a 175 yard long trench as well as an eight mile long overhead telegraph.  The lines were connected at both ends to revolving dials marked with the letters of the alphabet and electrical impulses sent along the wire were used to transmit messages.  Offering his invention to the Admiralty in July 1816, it was rejected as “wholly unnecessary”.  His account of the scheme and the possibilities of rapid global communication in Descriptions of an Electrical Telegraph and of some other Electrical Apparatus was the first published work on electric telegraphy and even described the risk of signal retardation due to induction.  Elements of Ronalds’ design were utilised in the subsequent commercialisation of the telegraph over 20 years later.\n\nThe telegraph invented by Baron Schilling von Canstatt in 1832 had a transmitting device which consisted of a keyboard with 16 black-and-white keys. These served for switching the electric current. The receiving instrument consisted of six galvanometers with magnetic needles, suspended from silk threads. Both stations of Schilling's telegraph were connected by eight wires; six were connected with the galvanometers, one served for the return current and one for a signal bell. When at the starting station the operator pressed a key, the corresponding pointer was deflected at the receiving station. Different positions of black and white flags on different disks gave combinations which corresponded to the letters or numbers. Pavel Schilling subsequently improved its apparatus. He reduced the number of connecting wires from eight to two.\n\t \t\nOn 21 October 1832, Schilling managed a short-distance transmission of signals between two telegraphs in different rooms of his apartment. In 1836, the British government attempted to buy the design but Schilling instead accepted overtures from Nicholas I of Russia. Schilling's telegraph was tested on a 5 km experimental underground and underwater cable, laid around the building of the main Admiralty in Saint Petersburg and was approved for a telegraph between the imperial palace at Peterhof and the naval base at Kronstadt. However, the project was cancelled following Schilling's death in 1837.Huurdeman, A.A., The worldwide history of telecommunications, p.54, Wiley-IEEE, 2003  Schilling was also one of the first to put into practice the idea of the binary system of signal transmission.\n\t\nIn 1833, Carl Friedrich Gauss, together with the physics professor Wilhelm Weber in Göttingen installed a 1200 m wire above the town's roofs. Gauss combined the Poggendorff-Schweigger multiplicator with his magnetometer to build a more sensitive device, the galvanometer. To change the direction of the electric current, he constructed a commutator of his own. As a result, he was able to make the distant needle move in the direction set by the commutator on the other end of the line.\n\nAt first, Gauss and Weber used the telegraph to coordinate time, but soon they developed other signals; finally, their own alphabet. The alphabet was encoded in a binary code which was transmitted by positive or negative voltage pulses which were generated by means of moving an induction coil up and down over a permanent magnet and connecting  the coil with the transmission wires by means of the commutator. The page of Gauss' laboratory notebook containing both his code and the first message transmitted, as well as a replica of the telegraph made in the 1850s under the instructions of Weber are kept in the faculty of physics at the University of Göttingen, in Germany.\n\nGauss was convinced that this communication would be a help to his kingdom's towns. Later in the same year, instead of a Voltaic pile, Gauss used an induction pulse, enabling him to transmit seven letters a minute instead of two. The inventors and university were too poor to develop the telegraph on their own, but they received funding from Alexander von Humboldt. Carl August Steinheil in Munich was able to build a telegraph network within the city in 1835-6. He installed a telegraph line along the first German railroad in 1835.\n\nIn 1836, an American scientist, Dr. David Alter, invented the first known American electric telegraph, in Elderton, Pennsylvania, one year before the Morse telegraph. Alter demonstrated it to witnesses but never developed the idea into a practical system.Popular Science, February 1882, vol.20, no.28, p.568, Bonnier Corporation,  . When Alter was interviewed for the book Biographical and Historical Cyclopedia of Indiana and Armstrong Counties, he said: \"I may say that there is no connection at all between the telegraph of Morse and others and that of myself.... Professor Morse most probably never heard of me or my Elderton telegraph.\"\n\nSamuel Morse independently developed and patented a recording electric telegraph in 1837. Morse's assistant Alfred Vail developed an instrument that was called the register for recording the received messages. It embossed dots and dashes on a moving paper tape by a stylus which was operated by an electromagnet. Morse and Vail developed the Morse code signalling alphabet. The first telegram in the United States was sent by Morse on 11 January 1838, across 2 mi of wire at Speedwell Ironworks near Morristown, New Jersey, although it was only later, in 1844, that he sent the message \"WHAT HATH GOD WROUGHT?\" over the 44 mi from the Capitol in Washington to the old Mt. Clare Depot in Baltimore.Howe, p. 7\n\nCommercial telegraphy \n\nCooke and Wheatstone system\n\nThe first commercial electrical telegraph, the Cooke and Wheatstone telegraph, was co-developed by William Fothergill Cooke and Charles Wheatstone. In May 1837 they patented a telegraph system which used a number of needles on a board that could be moved to point to letters of the alphabet.  The patent recommended a five-needle system, but any number of needles could be used depending on the number of characters it was required to code.  A four-needle system was installed between Euston and Camden Town in London on a rail line being constructed by Robert Stephenson between London and Birmingham.  It was successfully demonstrated on 25 July 1837.[http://www.connected-earth.com/journeys/Firstgenerationtechnologies/Thetelegraph/Thetelegraphicagedawns/index.htm The telegraphic age dawns] BT Group Connected Earth Online Museum. Accessed December 2010, [https://www.webcitation.org/6EKr7FUkw archived] 10 Feb 2013 Euston needed to signal to an engine house at Camden Town to start hauling the locomotive up the incline.  As at Liverpool, the electric telegraph was in the end rejected in favour of a pneumatic system with whistles.Bowers, page 129\n\nCooke and Wheatstone had their first commercial success with a system installed on the Great Western Railway over the 13 mi from Paddington station to West Drayton in 1838, the first commercial telegraph in the world.Huurdeman, page 67  This was a five-needle, six-wire system.  The cables were originally installed underground in a steel conduit.  However, the cables soon began to fail as a result of deteriorating insulation and were replaced with uninsulated wires on poles.Huurdeman, pages 67–68Beauchamp, page 35  As an interim measure, a two-needle system was used with three of the remaining working underground wires, which despite using only two needles had a greater number of codes.Mercer, page 7  But when the line was extended to Slough in 1843, a one-needle, two-wire system was installed.Huurdeman, page 69\n\nFrom this point the use of the electric telegraph started to grow on the new railways being built from London.  The London and Blackwall Railway (another rope-hauled application) was equipped with the Cooke and Wheatstone telegraph when it opened in 1840, and many others followed.Beauchamp, page 35  The one-needle telegraph proved highly successful on British railways, and 15,000 sets were still in use at the end of the nineteenth century.  Some remained in service in the 1930s.Huurdeman, pages 67–69  In September 1845 the financier John Lewis Ricardo and Cooke formed the Electric Telegraph Company, the first public telegraphy company in the world.  This company bought out the Cooke and Wheatstone patents and solidly established the telegraph business.Nichols, John (1967). The Gentleman's magazine, Volumes 282–283. p. 545. University of California\n\nMorse system\n\nIn the United States, the Morse/Vail telegraph was quickly deployed in the two decades following the first demonstration. The overland telegraph connected the west coast of the continent to the east coast by 24 October 1861, bringing an end to the Pony Express.Today in History - October 24, [https://www.loc.gov/item/today-in-history/october-24 The Transcontinental Telegraph and the End of the Pony Express], Library of Congress, retrieved 3 February 2017.\n\nAs well as the rapid expansion of the use of the telegraphs along the railways, they soon spread into the field of mass communication with the instruments being installed in post offices. The era of mass personal communication had begun.\n\nTelegraphic improvements\n\nA continuing goal in telegraphy was to reduce the cost per message by reducing hand-work, or increasing the sending rate. There were many experiments with moving pointers, and various electrical encodings. However, most systems were too complicated and unreliable. A successful expedient to reduce the cost per message was the development of telegraphese.\n\nThe first system that didn't require skilled technicians to operate, was Charles Wheatstone's ABC system in 1840 where the letters of the alphabet were arranged around a clock-face, and the signal caused a needle to indicate the letter. This early system required the receiver to be present in real time to record the message and it reached speeds of up to 15 words a minute.\n\nIn 1846, Alexander Bain patented a chemical telegraph in Edinburgh. The signal current moved an iron pen across a moving paper tape soaked in a mixture of ammonium nitrate and potassium ferrocyanide, decomposing the chemical and producing readable blue marks in Morse code. The speed of the printing telegraph was 1000 words per hour, but messages still required translation into English by live copyists. Chemical telegraphy came to an end in the US in 1851, when the Morse group defeated the Bain patent in the US District Court.Oslin, George P. The Story of Telecommunications, Mercer University Press, 1992. 69.\n\nFor a brief period, starting with the New York-Boston line in 1848, some telegraph networks began to employ sound operators, who were trained to understand Morse code aurally. Gradually, the use of sound operators eliminated the need for telegraph receivers to include register and tape. Instead, the receiving instrument was developed into a \"sounder\", an electromagnet that was energized by a current and attracted a small iron lever. When the sounding key was opened or closed, the sounder lever struck an anvil. The Morse operator distinguished a dot and a dash by the short or long interval between the two clicks. The message was then written out in long-hand.Oslin, George P. The Story of Telecommunications. Mercer University Press, 1992. 67\n\nRoyal Earl House developed and patented a letter-printing telegraph system in 1846 which employed an alphabetic keyboard for the transmitter and automatically printed the letters on paper at the receiver, and followed this up with a steam-powered version in 1852. Advocates of printing telegraphy said it would eliminate Morse operators' errors. The House machine was used on four main American telegraph lines by 1852. The speed of the House machine was announced as 2600 words an hour.Oslin, George, P. The Story of Telecommunications, 1992. 71\n\nDavid Edward Hughes invented the printing telegraph in 1855; it used a keyboard of 26 keys for the alphabet and a spinning type wheel that determined the letter being transmitted by the length of time that had elapsed since the previous transmission. The system allowed for automatic recording on the receiving end. The system was very stable and accurate and became the accepted around the world.\n\nThe next improvement was the Baudot code of 1874. French engineer Émile Baudot patented a printing telegraph in which the signals were translated automatically into typographic characters. Each character was assigned a five-bit code, mechanically interpreted from the state of five on/off switches. Operators had to maintain a steady rhythm, and the usual speed of operation was 30 words per minute.\n\nBy this point reception had been automated, but the speed and accuracy of the transmission was still limited to the skill of the human operator. The first practical automated system was patented by Charles Wheatstone, the original inventor of the telegraph. The message (in Morse code) was typed onto a piece of perforated tape using a keyboard-like device called the 'Stick Punch'. The transmitter automatically ran the tape through and transmitted the message at the then exceptionally high speed of 70 words per minute.\n\nTeleprinters\n\nAn early successful teleprinter was invented by Frederick G. Creed. In Glasgow he created his first keyboard perforator, which used compressed air to punch the holes. He also created a reperforator (receiving perforator) and a printer. The reperforator punched incoming Morse signals on to paper tape and the printer decoded this tape to produce alphanumeric characters on plain paper. This was the origin of the Creed High Speed Automatic Printing System, which could run at an unprecedented 200 words per minute. His system was adopted by the Daily Mail for daily transmission of the newspaper contents.\n\nBy the 1930s teleprinters were being produced by Teletype in the US, Creed in Britain and Siemens in Germany.\n\nWith the invention of the teletypewriter, telegraphic encoding became fully automated. Early teletypewriters used the ITA-1 Baudot code, a five-bit code. This yielded only thirty-two codes, so it was over-defined into two \"shifts\", \"letters\" and \"figures\". An explicit, unshared shift code prefaced each set of letters and figures.\n\nBy 1935, message routing was the last great barrier to full automation. Large telegraphy providers began to develop systems that used telephone-like rotary dialling to connect teletypewriters. These machines were called \"Telex\" (TELegraph EXchange). Telex machines first performed rotary-telephone-style pulse dialling for circuit switching, and then sent data by ITA2. This \"type A\" Telex routing functionally automated message routing.\n\nThe first wide-coverage Telex network was implemented in Germany during the 1930s as a network used to communicate within the government.\n\nAt the rate of 45.45 (±0.5%) baud — considered speedy at the time — up to 25 telex channels could share a single long-distance telephone channel by using voice frequency telegraphy multiplexing, making telex the least expensive method of reliable long-distance communication.\n\nAutomatic teleprinter exchange service was introduced into Canada by CPR Telegraphs and CN Telegraph in July 1957 and in 1958, Western Union started to build a Telex network in the United States.Phillip R. Easterlin, \"Telex in New York\", Western Union Technical Review, April 1959: 45\n\nOceanic telegraph cables\n\nSoon after the first successful telegraph systems were operational, the possibility of transmitting messages across the sea by way of submarine communications cables was first mooted. One of the primary technical challenges was to sufficiently insulate the submarine cable to prevent the current from leaking out into the water. In 1842, a Scottish surgeon William Montgomerie introduced gutta-percha, the adhesive juice of the Palaquium gutta tree, to Europe. Michael Faraday and Wheatstone soon discovered the merits of gutta-percha as an insulator, and in 1845, the latter suggested that it should be employed to cover the wire which was proposed to be laid from Dover to Calais. It was tried on a wire laid across the Rhine between Deutz and Cologne. In 1849, C.V. Walker, electrician to the South Eastern Railway, submerged a two-mile wire coated with gutta-percha off the coast from Folkestone, which was tested successfully.\n\nJohn Watkins Brett, an engineer from Bristol, sought and obtained permission from Louis-Philippe in 1847 to establish telegraphic communication between France and England. The first undersea cable was laid in 1850, connecting the two countries and was followed by connections to Ireland and the Low Countries.\n\nThe Atlantic Telegraph Company was formed in London in 1856 to undertake to construct a commercial telegraph cable across the Atlantic Ocean. It was successfully completed on 18 July 1866 by the ship SS Great Eastern, captained by Sir James Anderson after many mishaps along the away.Wilson, Arthur (1994). The Living Rock: The Story of Metals Since Earliest Times and Their Impact on Civilization. p. 203. Woodhead Publishing. . Earlier transatlantic submarine cables installations were attempted in 1857, 1858 and 1865. The 1857 cable only operated intermittently for a few days or weeks before it failed. The study of underwater telegraph cables accelerated interest in mathematical analysis of very long transmission lines. The telegraph lines from Britain to India were connected in 1870 (those several companies combined to form the Eastern Telegraph Company in 1872).\n\nAustralia was first linked to the rest of the world in October 1872 by a submarine telegraph cable at Darwin.Briggs, Asa and Burke, Peter: \"A Social History of the Media: From Gutenberg to the Internet\", p110. Polity, Cambridge, 2005. This brought news reportage from the rest of the world.Conley, David and Lamble, Stephen (2006) The Daily Miracle: An introduction to Journalism,(Third Edition) Oxford University Press, Australia pp. 305-307 The telegraph across the Pacific was completed in 1902, finally encircling the world.\n\nFrom the 1850s until well into the 20th century, British submarine cable systems dominated the world system. This was set out as a formal strategic goal, which became known as the All Red Line. In 1896, there were thirty cable laying ships in the world and twenty-four of them were owned by British companies. In 1892, British companies owned and operated two-thirds of the world's cables and by 1923, their share was still 42.7 percent.Headrick, D.R., & Griset, P. (2001). Submarine telegraph cables: business and politics, 1838-1939. The Business History Review, 75(3), 543-578. During World War I, Britain's telegraph communications were almost completely uninterrupted, while it was able to quickly cut Germany's cables worldwide.\n\nThe harmonic telegraph\n\nThe most expensive aspect of a telegraph system was the installation – the laying of the wire, which was often very long. The costs would be better covered by finding a way to send more than one message at a time through the single wire, thus increasing revenue per wire. In the latter half of the 1800s, several inventors worked towards creating a method for doing just that, including: Charles Bourseul, Thomas Edison, Elisha Gray, and Alexander Graham Bell.  \nOne approach was to have oscillators of several different frequencies act as carriers of a modulated on-off signal (see frequency-division multiplexing).  These various frequencies, referred to as harmonics, could then be combined into one complex signal and sent down the single wire.  On the receiving end, the frequencies would be separated with a matching set of oscillators.  With a set of frequencies being carried down a single wire, it was realized that the human voice itself could be transmitted electrically through the wire.  This effort led to the invention of the telephone.  (While the work toward packing multiple telegraph signals onto one wire led to telephony, later advances would pack multiple voice signals onto one wire by increasing the bandwidth by modulating frequencies much higher than human hearing.  Eventually the bandwidth was widened much further by using laser light signals sent through fiber optic cables.  Fiber optic transmission can carry thousands of telegraph signals simultaneously down a single line.)\n\nEnd of the telegraph era\n\nIn the United States, Western Union discontinued all telegram and commercial messaging services on 27 January 2006,Wheen, Andrew. DOT-DASH TO DOT.COM: How Modern Telecommunications Evolved from the Telegraph to the Internet (Springer, 2011), p259 although it still offered its electronic money transfer services.\n\nIndia's state-owned telecom company, BSNL, ended its telegraph service on 14 July 2013. It was reportedly the world's last existing true electric telegraph system. Electrical telegraph. http://en.wikipedia.org/?curid=9450."
  }
}
