{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9611",
  "eid" : "f05c25e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778483006,
  "textBody" : "E-commerce is a transaction of buying or selling online. Electronic commerce draws on technologies such as mobile commerce, electronic funds transfer, supply chain management, Internet marketing, online transaction processing, electronic data interchange (EDI), inventory management systems, and automated data collection systems. \n\nModern electronic commerce typically uses the World Wide Web for at least one part of the transaction's life cycle although it may also use other technologies such as e-mail. Typical e-commerce transactions include the purchase of online books (such as Amazon) and music purchases (music download in the form of digital distribution such as iTunes Store), and to a less extent, customized/personalized online liquor store inventory services. There are three areas of e-commerce: online retailing, electric markets, and online auctions. E-commerce is supported by electronic business.Wienclaw, Ruth A. (2013) \"E-Commerce.\" Research Starters: Business\n\nE-commerce businesses may also employ some or all of the followings:\n* Online shopping web sites for retail sales direct to consumers\n* Providing or participating in online marketplaces, which process third-party business-to-consumer or consumer-to-consumer sales\n* Business-to-business buying and selling;\n* Gathering and using demographic data through web contacts and social media\n* Business-to-business (B2B) electronic data interchange\n* Marketing to prospective and established customers by e-mail or fax (for example, with newsletters)\n* Engaging in pretail for launching new products and services\n* Online financial exchanges for currency exchanges or trading purposes.\n\nTimeline\n\nA timeline for the development of e-commerce:\n* 1971 or 1972: The ARPANET is used to arrange a cannabis sale between students at the Stanford Artificial Intelligence Laboratory and the Massachusetts Institute of Technology, later described as \"the seminal act of e-commerce\" in John Markoff's book What the Dormouse Said.\n* 1979: Michael Aldrich demonstrates the first online shopping system.\n* 1981: Thomson Holidays UK is the first business-to-business online shopping system to be installed.1988 Palmer.C Using IT for competitive advantage at Thomson Holidays, Long range Planning Vol 21 No.6 p26-29, Institute of Strategic Studies Journal,London- Pergamon Press [now Elsevier.B.V.] December 1988.\n* 1982: Minitel was introduced nationwide in France by France Télécom and used for online ordering.\n* 1983: California State Assembly holds first hearing on \"electronic commerce\" in Volcano, California. Testifying are CPUC, MCI Mail, Prodigy, CompuServe, Volcano Telephone, and Pacific Telesis. (Not permitted to testify is Quantum Technology, later to become AOL.)\n* 1984: Gateshead SIS/Tesco is first B2C online shopping system and Mrs Snowball, 72, is the first online home shopper \n* 1984: In April 1984, CompuServe launches the Electronic Mall in the USA and Canada. It is the first comprehensive electronic commerce service.\n* 1989: In May 1989, Sequoia Data Corp. Introduced Compumarket The first internet based system for e-commerce. Sellers and buyers could post items for sale and buyers could search the database and make purchases with a credit card. \n* 1990: Tim Berners-Lee writes the first web browser, WorldWideWeb, using a NeXT computer.\n* 1992: Book Stacks Unlimited in Cleveland opens a commercial sales website (www.books.com) selling books online with credit card processing.\n* 1993: Paget Press releases edition No. 3 of the first app store, The Electronic AppWrapper\n* 1994: Netscape releases the Navigator browser in October under the code name Mozilla. Netscape 1.0 is introduced in late 1994 with SSL encryption that made transactions secure.\n* 1994: Ipswitch IMail Server becomes the first software available online for sale and immediate download via a partnership between Ipswitch, Inc. and OpenMarket.\n* 1994: \"Ten Summoner's Tales\" by Sting becomes the first secure online purchase through NetMarket.\n* 1995: The US National Science Foundation lifts its former strict prohibition of commercial enterprise on the Internet.\n* 1995: Thursday 27 April 1995, the purchase of a book by Paul Stanfield, Product Manager for CompuServe UK, from W H Smith's shop within CompuServe's UK Shopping Centre is the UK's first national online shopping service secure transaction. The shopping service at launch featured W H Smith, Tesco, Virgin Megastores/Our Price, Great Universal Stores (GUS), Interflora, Dixons Retail, Past Times, PC World (retailer) and Innovations.\n* 1995: Jeff Bezos launches Amazon.com and the first commercial-free 24-hour, internet-only radio stations, Radio HK and NetRadio start broadcasting. eBay is founded by computer programmer Pierre Omidyar as AuctionWeb.\n* 1996: IndiaMART B2B marketplace established in India.\n* 1996: ECPlaza B2B marketplace established in Korea.\n* 1996: The use of Excalibur BBS with replicated \"Storefronts\" was an early implementation of electronic commerce started by a group of SysOps in Australia and replicated to global partner sites.\n* 1998: Electronic postal stamps can be purchased and downloaded for printing from the Web.\n* 1999: Alibaba Group is established in China. Business.com sold for US $7.5 million to eCompanies, which was purchased in 1997 for US $149,000. The peer-to-peer filesharing software Napster launches. ATG Stores launches to sell decorative items for the home online.\n* 1999:  Global e-commerce reaches $150 billion\n* 2000: Complete Idiot's Guide to e-commerce released on Amazon\n* 2000: The dot-com bust.\n* 2001: Alibaba.com achieved profitability in December 2001.\n* 2002: eBay acquires PayPal for $1.5 billion. Niche retail companies Wayfair and NetShops are founded with the concept of selling products through several targeted domains, rather than a central portal.\n* 2003: Amazon.com posts first yearly profit.\n* 2003: Bossgoo B2B marketplace established in China.\n* 2004: DHgate.com, China's first online b2b transaction platform, is established, forcing other b2b sites to move away from the \"yellow pages\" model.\n* 2007: Business.com acquired by R.H. Donnelley for $345 million.\n* 2009: Zappos.com acquired by Amazon.com for $928 million. Retail Convergence, operator of private sale website RueLaLa.com, acquired by GSI Commerce for $180 million, plus up to $170 million in earn-out payments based on performance through 2012.\n* 2010: Groupon reportedly rejects a $6 billion offer from Google. Instead, the group buying websites went ahead with an IPO on 4 November 2011. It was the largest IPO since Google.\n* 2012: Zalora Group was founded and started operations around Asia.\n* 2014: Overstock.com processes over $1 million in Bitcoin sales. India's e-commerce industry is estimated to have grown more than 30% from 2012 to $12.6 billion in 2013. US e-commerce and Online Retail sales projected to reach $294 billion, an increase of 12 percent over 2013 and 9% of all retail sales. Alibaba Group has the largest Initial public offering ever, worth $25 billion.\n* 2015: Amazon.com accounts for more than half of all e-commerce growth, selling almost 500 Million SKU's in the US.\n* 2016: Amazon.com aided more than 10,000 sellers to generate more than $1 million of annual sales .\n* 2016: Walmart buys Jet.com for $3.3 billion\n* 2017: On march Amazon.com acquired Souq.com the bigest e-commerce website in Middle East ( Egypt, KSA and UAE).\n\nBusiness application\n\nSome common applications related to electronic commerce are:\n\nGovernmental regulation\n\nIn the United States, certain electronic commerce activities are regulated by the Federal Trade Commission (FTC). These activities include but not limit to the use of commercial e-mails, online advertising and consumer privacy. The CAN-SPAM Act of 2003 establishes national standards for direct marketing over e-mail. The Federal Trade Commission Act regulates all forms of advertising, including online advertising, and states that advertising must be truthful and non-deceptive. Using its authority under Section 5 of the FTC Act, which prohibits unfair or deceptive practices, the FTC has brought a number of cases to enforce the promises in corporate privacy statements, including promises about the security of consumers' personal information. As a result, any corporate privacy policy related to e-commerce activity may be subject to enforcement by the FTC.\n\nThe Ryan Haight Online Pharmacy Consumer Protection Act of 2008, which came into law in 2008, amends the Controlled Substances Act to address online pharmacies.\n\nConflict of laws in cyberspace is a major hurdle for harmonization of legal framework for e-commerce around the world. In order to give a uniformity to e-commerce law around the world, many countries adopted the UNCITRAL Model Law on Electronic Commerce (1996).\n\nInternationally there is the International Consumer Protection and Enforcement Network (ICPEN), which was formed in 1991 from an informal network of government customer fair trade organisations. The purpose was stated as being to find ways of co-operating on tackling consumer problems connected with cross-border transactions in both goods and services, and to help ensure exchanges of information among the participants for mutual benefit and understanding. From this came Econsumer.gov, an ICPEN initiative since April 2001. It is a portal to report complaints about online and related transactions with foreign companies.\n\nThere is also Asia Pacific Economic Cooperation (APEC) was established in 1989 with the vision of achieving stability, security and prosperity for the region through free and open trade and investment. APEC has an Electronic Commerce Steering Group as well as working on common privacy regulations throughout the APEC region.\n\nIn Australia, Trade is covered under Australian Treasury Guidelines for electronic commerce and the Australian Competition and Consumer Commission regulates and offers advice on how to deal with businesses online, and offers specific advice on what happens if things go wrong.\n\nIn the United Kingdom, The Financial Services Authority (FSA)  was formerly the regulating authority for most aspects of the EU's Payment Services Directive (PSD), until its replacement in 2013 by the Prudential Regulation Authority and the Financial Conduct Authority. The UK implemented the PSD through the Payment Services Regulations 2009 (PSRs), which came into effect on 1 November 2009. The PSR affects firms providing payment services and their customers. These firms include banks, non-bank credit card issuers and non-bank merchant acquirers, e-money issuers, etc. The PSRs created a new class of regulated firms known as payment institutions (PIs), who are subject to prudential requirements. Article 87 of the PSD requires the European Commission to report on the implementation and impact of the PSD by 1 November 2012.\n\nIn India, the Information Technology Act 2000 governs the basic applicability of e-commerce.\n\nIn China, the Telecommunications Regulations of the People's Republic of China (promulgated on 25 September 2000), stipulated the Ministry of Industry and Information Technology (MIIT) as the government department regulating all telecommunications related activities, including electronic commerce. On the same day, The Administrative Measures on Internet Information Services released, is the first administrative regulation to address profit-generating activities conducted through the Internet, and lay the foundation for future regulations governing e-commerce in China. On 28 August 2004, the eleventh session of the tenth NPC Standing Committee adopted The Electronic Signature Law, which regulates data message, electronic signature authentication and legal liability issues. It is considered the first law in China's e-commerce legislation. It was a milestone in the course of improving China's electronic commerce legislation, and also marks the entering of China's rapid development stage for electronic commerce legislation.\n\nForms\n\nContemporary electronic commerce can be classified into categories. The first category is business based on types of goods sold (involves everything from ordering \"digital\" content for immediate online consumption, to ordering conventional goods and services, to \"meta\" services to facilitate other types of electronic commerce). The second category is based on the nature of the participant (B2B, B2C, C2B and C2\nC);\n\nOn the institutional level, big corporations and financial institutions use the internet to exchange financial data to facilitate domestic and international business. Data integrity and security are pressing issues for electronic commerce.\n\nAside from traditional e-commerce, the terms m-Commerce (mobile commerce) as well (around 2013) t-Commerce have also been used.\n\nGlobal trends\n\nIn 2010, the United Kingdom had the highest per capital e-commerce spending in the world. As of 2013, the Czech Republic was the European country where e-commerce delivers the biggest contribution to the enterprises´ total revenue. Almost a quarter (24%) of the country's total turnover is generated via the online channel.\n\nAmong emerging economies, China's e-commerce presence continues to expand every year. With 668 million Internet users, China's online shopping sales reached $253 billion in the first half of 2015, accounting for 10% of total Chinese consumer retail sales in that period. The Chinese retailers have been able to help consumers feel more comfortable shopping online. e-commerce transactions between China and other countries increased 32% to 2.3 trillion yuan ($375.8 billion) in 2012 and accounted for 9.6% of China's total international trade. In 2013, Alibaba had an e-commerce market share of 80% in China. In 2014, there were 600 million Internet users in China (twice as many as in the US), making it the world's biggest online market. China is also the largest e-commerce market in the world by value of sales, with an estimated  in 2016.\n\nIn 2013, Brazil's e-commerce was growing quickly with retail e-commerce sales expected to grow at a double-digit pace through 2014. By 2016, eMarketer expected retail e-commerce sales in Brazil to reach $17.3 billion. India has an Internet user base of about 460 million as of December 2017. Despite being third largest user base in world, the penetration of Internet is low compared to markets like the United States, United Kingdom or France but is growing at a much faster rate, adding around 6 million new entrants every month. In India, cash on delivery is the most preferred payment method, accumulating 75% of the e-retail activities. The India retail market is expected to rise from 2.5% in 2016 to 5% in 2020.\n\nThe rate of growth of the number of internet users in the Arab countries has been rapid – 13.1% in 2015. A significant portion of the e-commerce market in the Middle East comprises people in the 30–34 year age group. Egypt has the largest number of internet users in the region, followed by Saudi Arabia and Morocco; these constitute 3/4th of the region’s share. Yet, internet penetration is low: 35% in Egypt and 65% in Saudi Arabia.\n\nE-commerce has become an important tool for small and large businesses worldwide, not only to sell to customers, but also to engage them.\n\nIn 2012, e-commerce sales topped $1 trillion for the first time in history.\n\nMobile devices are playing an increasing role in the mix of e-commerce, this is also commonly called mobile commerce, or m-commerce. In 2014, one estimate saw purchases made on mobile devices making up 25% of the market by 2017.\n\nFor traditional businesses, one research stated that information technology and cross-border e-commerce is a good opportunity for the rapid development and growth of enterprises. Many companies have invested enormous volume of investment in mobile applications. The DeLone and McLean Model stated that three perspectives contribute to a successful e-business: information system quality, service quality and users' satisfaction. There is no limit of time and space, there are more opportunities to reach out to customers around the world, and to cut down unnecessary intermediate links, thereby reducing the cost price, and can benefit from one on one large customer data analysis, to achieve a high degree of personal customization strategic plan, in order to fully enhance the core competitiveness of the products in company.\n\nLogistics \n\nLogistics in e-commerce mainly concerns fulfillment. Online markets and retailers have to find the best possible way to fill orders and deliver products. Small companies usually control their own logistic operation because they do not have the ability to hire an outside company. Most large companies hire a fulfillment service that takes care of a company's logistic needs.\n\nImpact on markets and retailers\n\nE-commerce markets are growing at noticeable rates. The online market is expected to grow by 56% in 2015–2020. Traditional markets are only expected 2% growth during the same time. Brick and mortar retailers are struggling because of online retailer's ability to offer lower prices and higher efficiency. Many larger retailers are able to maintain a presence offline and online by linking physical and online offerings. \n\nE-commerce allows customers to overcome geographical barriers and allows them to purchase products anytime and from anywhere. Online and traditional markets have different strategies for conducting business. Traditional retailers offer fewer assortment of products because of shelf space where, online retailers often hold no inventory but send customer orders directly to the manufacture. The pricing strategies are also different for traditional and online retailers. Traditional retailers base their prices on store traffic and the cost to keep inventory. Online retailers base prices on the speed of delivery.\n\nThere are two ways for marketers to conduct business through e-commerce: fully online or online along with a brick and mortar store. Online marketers can offer lower prices, greater product selection, and high efficiency rates. Many customers prefer online markets if the products can be delivered quickly at relatively low price. However, online retailers cannot offer the physical experience that traditional retailers can. It can be difficult to judge the quality of a product without the physical experience, which may cause customers to experience product or seller uncertainty. Another issue regarding the online market is concerns about the security of online transactions. Many customers remain loyal to well-known retailers because of this issue.\n\n Security is a primary problem for e-commerce in developed and developing countries. E-commerce security is protecting business' websites and costumers from unauthorized access, use, alteration, or destruction. The type of threats include: malicious codes, unwanted programs (ad ware, spyware), phishing, hacking, and cyber vandalism. E-commerce websites use different tools to avert security threats. These tools include firewalls, encryption software, digital certificates, and passwords.\n\nImpact on supply chain management\n\nFor a long time, companies had been troubled by the gap between the benefits which supply chain technology has and the solutions to deliver those benefits. However, the emergence of e-commerce has provided a more practical and effective way of delivering the benefits of the new supply chain technologies.\n\nE-commerce has the capability to integrate all inter-company and intra-company functions, meaning that the three flows (physical flow, financial flow and information flow) of the supply chain could be also affected by e-commerce. The affections on physical flows improved the way of product and inventory movement level for companies. For the information flows, e-commerce optimised the capacity of information processing than companies used to have, and for the financial flows, e-commerce allows companies to have more efficient payment and settlement solutions.\n\nIn addition, e-commerce has a more sophisticated level of impact on supply chains: Firstly, the performance gap will be eliminated since companies can identify gaps between different levels of supply chains by electronic means of solutions; Secondly, as a result of e-commerce emergence, new capabilities such implementing ERP systems, like SAP ERP, Xero, or Megaventory, have helped companies to manage operations with customers and suppliers. Yet these new capabilities are still not fully exploited. Thirdly, technology companies would keep investing on new e-commerce software solutions as they are expecting investment return. Fourthly, e-commerce would help to solve many aspects of issues that companies may feel difficult to cope with, such as political barriers or cross-country changes. Finally, e-commerce provides companies a more efficient and effective way to collaborate with each other within the supply chain.\n\nImpact on employment \n\nE-commerce helps create new job opportunities due to information related services, software app and digital products. It also causes job losses. The areas with the greatest predicted job-loss are retail, postal, and travel agencies. The development of e-commerce will create jobs that require highly skilled workers to manage large amounts of information, customer demands, and production processes. In contrast, people with poor technical skills cannot enjoy the wages welfare. On the other hand, because e-commerce requires sufficient stocks that could be delivered to customers in time, the warehouse becomes an important element. Warehouse needs more staff to manage, supervise and organize, thus the condition of warehouse environment will be concerned by employees.\n\nImpact on customers \n\nE-commerce brings convenience for customers as they do not have to leave home and only need to browse website online, especially for buying the products which are not sold in nearby shops. It could help customers buy wider range of products and save customers’ time. Consumers also gain power through online shopping. They are able to research products and compare prices among retailers. Also, online shopping often provides sales promotion or discounts code, thus it is more price effective for customers. Moreover, e-commerce provides products’ detailed information; even the in-store staff cannot offer such detailed explanation. Customers can also review and track the order history online. \n\nHowever, e-commerce lacks human interaction for customers, especially who prefer face-to-face connection. Customers are also concerned with the security of online transactions and tend to remain loyal to well-know retailers. When the customer regret the purchase of a product, it involves returning goods and refunding process. This process is inconvenient as customers need to pack and post the goods. If the products are expensive, large or fragile, it refers to safety issues.\n\nSocial impact\n\nE-commerce has huge impact on the economy and society. E-commerce allows for the globalization of markets and created a society based on knowledge and information.\n\nB2B is rapidly growing in the world, that leads to lower cost and then improves the economic efficiency and also bring along the growth of employment.\n\n Employment growth is based on the increase of jobs in specific markets related to e-commerce, such as, new products, market research, software sales, and online service. These jobs affect many countries where e-commerce is thriving. Specific institutions (education, health, government services) may also be affected by e-commerce.\n\nE-commerce is not a new industry, technically speaking, but it is creating a new economic model. Most people agree that e-commerce will positively impact economic society in the future, but in its early stages its impacts are difficult to gauge. Some have noted that e-commerce is a sort of incorporeal revolution. E-commerce has numerous social benefits: one, the cost of running an e-commerce business is very low when compared with running a physical store; two, there is no rent to pay on expensive premises; and three, business processes are simplified and less man-hours are required to run a typical business smoothly. In the area of law, education, culture and also policy, e-commerce will continue to rise in impact. e-commerce will truly take human beings into the information society.\n\nDistribution channels\n\nE-commerce has grown in importance as companies have adopted pure-click and brick-and-click channel systems. We can distinguish pure-click and brick-and-click channel system adopted by companies.\n* Pure-click or pure-play companies are those that have launched a website without any previous existence as a firm.\n* Bricks-and-clicks companies are those existing companies that have added an online site for e-commerce.\n* Click-to-brick online retailers that later open physical locations to supplement their online efforts.\n\nExamples of new systems\n\nAccording to eMarketer research company, \"by 2017, 65.8 per cent of Britons will use smartphones\".\n\nNew mobile apps such as LINE, WeChat have grown tremendously into ecosystems where hundred of millions of users and businesses can transact with one another.\n\nRecommendation \n\nThe contemporary e-commerce trend recommends companies to shift the traditional business model where focus on \"standardized products, homogeneous market and long product life cycle\" to the new business model where focus on \"varied and customized products\". E-commerce requires the company to have the ability to satisfy multiple needs of different customers and provide them with wider range of products. \n\nWith more choices of products, the information of products for customers to select and meet their needs become crucial. In order to address the mass customization principle to the company, the use of recommender system is suggested. This system helps recommend the proper products to the customers and helps customers make the decision during the purchasing process. The recommender system could be operated through the top sellers on the website, the demographics of customers or the consumers' buying behavior. However, there are 3 main ways of recommendations: recommending products to customers directly, providing detailed products' information and showing other buyers' opinions or critiques. It is benefit for consumer experience without physical shopping. In general, recommender system is used to contact customers online and assist finding the right products they want effectively and directly.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "E-commerce" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9611" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "E-commerce is a transaction of buying or selling online. Electronic commerce draws on technologies such as mobile commerce, electronic funds transfer, supply chain management, Internet marketing, online transaction processing, electronic data interchange (EDI), inventory management systems, and automated data collection systems. \n\nModern electronic commerce typically uses the World Wide Web for at least one part of the transaction's life cycle although it may also use other technologies such as e-mail. Typical e-commerce transactions include the purchase of online books (such as Amazon) and music purchases (music download in the form of digital distribution such as iTunes Store), and to a less extent, customized/personalized online liquor store inventory services. There are three areas of e-commerce: online retailing, electric markets, and online auctions. E-commerce is supported by electronic business.Wienclaw, Ruth A. (2013) \"E-Commerce.\" Research Starters: Business\n\nE-commerce businesses may also employ some or all of the followings:\n* Online shopping web sites for retail sales direct to consumers\n* Providing or participating in online marketplaces, which process third-party business-to-consumer or consumer-to-consumer sales\n* Business-to-business buying and selling;\n* Gathering and using demographic data through web contacts and social media\n* Business-to-business (B2B) electronic data interchange\n* Marketing to prospective and established customers by e-mail or fax (for example, with newsletters)\n* Engaging in pretail for launching new products and services\n* Online financial exchanges for currency exchanges or trading purposes.\n\nTimeline\n\nA timeline for the development of e-commerce:\n* 1971 or 1972: The ARPANET is used to arrange a cannabis sale between students at the Stanford Artificial Intelligence Laboratory and the Massachusetts Institute of Technology, later described as \"the seminal act of e-commerce\" in John Markoff's book What the Dormouse Said.\n* 1979: Michael Aldrich demonstrates the first online shopping system.\n* 1981: Thomson Holidays UK is the first business-to-business online shopping system to be installed.1988 Palmer.C Using IT for competitive advantage at Thomson Holidays, Long range Planning Vol 21 No.6 p26-29, Institute of Strategic Studies Journal,London- Pergamon Press [now Elsevier.B.V.] December 1988.\n* 1982: Minitel was introduced nationwide in France by France Télécom and used for online ordering.\n* 1983: California State Assembly holds first hearing on \"electronic commerce\" in Volcano, California. Testifying are CPUC, MCI Mail, Prodigy, CompuServe, Volcano Telephone, and Pacific Telesis. (Not permitted to testify is Quantum Technology, later to become AOL.)\n* 1984: Gateshead SIS/Tesco is first B2C online shopping system and Mrs Snowball, 72, is the first online home shopper \n* 1984: In April 1984, CompuServe launches the Electronic Mall in the USA and Canada. It is the first comprehensive electronic commerce service.\n* 1989: In May 1989, Sequoia Data Corp. Introduced Compumarket The first internet based system for e-commerce. Sellers and buyers could post items for sale and buyers could search the database and make purchases with a credit card. \n* 1990: Tim Berners-Lee writes the first web browser, WorldWideWeb, using a NeXT computer.\n* 1992: Book Stacks Unlimited in Cleveland opens a commercial sales website (www.books.com) selling books online with credit card processing.\n* 1993: Paget Press releases edition No. 3 of the first app store, The Electronic AppWrapper\n* 1994: Netscape releases the Navigator browser in October under the code name Mozilla. Netscape 1.0 is introduced in late 1994 with SSL encryption that made transactions secure.\n* 1994: Ipswitch IMail Server becomes the first software available online for sale and immediate download via a partnership between Ipswitch, Inc. and OpenMarket.\n* 1994: \"Ten Summoner's Tales\" by Sting becomes the first secure online purchase through NetMarket.\n* 1995: The US National Science Foundation lifts its former strict prohibition of commercial enterprise on the Internet.\n* 1995: Thursday 27 April 1995, the purchase of a book by Paul Stanfield, Product Manager for CompuServe UK, from W H Smith's shop within CompuServe's UK Shopping Centre is the UK's first national online shopping service secure transaction. The shopping service at launch featured W H Smith, Tesco, Virgin Megastores/Our Price, Great Universal Stores (GUS), Interflora, Dixons Retail, Past Times, PC World (retailer) and Innovations.\n* 1995: Jeff Bezos launches Amazon.com and the first commercial-free 24-hour, internet-only radio stations, Radio HK and NetRadio start broadcasting. eBay is founded by computer programmer Pierre Omidyar as AuctionWeb.\n* 1996: IndiaMART B2B marketplace established in India.\n* 1996: ECPlaza B2B marketplace established in Korea.\n* 1996: The use of Excalibur BBS with replicated \"Storefronts\" was an early implementation of electronic commerce started by a group of SysOps in Australia and replicated to global partner sites.\n* 1998: Electronic postal stamps can be purchased and downloaded for printing from the Web.\n* 1999: Alibaba Group is established in China. Business.com sold for US $7.5 million to eCompanies, which was purchased in 1997 for US $149,000. The peer-to-peer filesharing software Napster launches. ATG Stores launches to sell decorative items for the home online.\n* 1999:  Global e-commerce reaches $150 billion\n* 2000: Complete Idiot's Guide to e-commerce released on Amazon\n* 2000: The dot-com bust.\n* 2001: Alibaba.com achieved profitability in December 2001.\n* 2002: eBay acquires PayPal for $1.5 billion. Niche retail companies Wayfair and NetShops are founded with the concept of selling products through several targeted domains, rather than a central portal.\n* 2003: Amazon.com posts first yearly profit.\n* 2003: Bossgoo B2B marketplace established in China.\n* 2004: DHgate.com, China's first online b2b transaction platform, is established, forcing other b2b sites to move away from the \"yellow pages\" model.\n* 2007: Business.com acquired by R.H. Donnelley for $345 million.\n* 2009: Zappos.com acquired by Amazon.com for $928 million. Retail Convergence, operator of private sale website RueLaLa.com, acquired by GSI Commerce for $180 million, plus up to $170 million in earn-out payments based on performance through 2012.\n* 2010: Groupon reportedly rejects a $6 billion offer from Google. Instead, the group buying websites went ahead with an IPO on 4 November 2011. It was the largest IPO since Google.\n* 2012: Zalora Group was founded and started operations around Asia.\n* 2014: Overstock.com processes over $1 million in Bitcoin sales. India's e-commerce industry is estimated to have grown more than 30% from 2012 to $12.6 billion in 2013. US e-commerce and Online Retail sales projected to reach $294 billion, an increase of 12 percent over 2013 and 9% of all retail sales. Alibaba Group has the largest Initial public offering ever, worth $25 billion.\n* 2015: Amazon.com accounts for more than half of all e-commerce growth, selling almost 500 Million SKU's in the US.\n* 2016: Amazon.com aided more than 10,000 sellers to generate more than $1 million of annual sales .\n* 2016: Walmart buys Jet.com for $3.3 billion\n* 2017: On march Amazon.com acquired Souq.com the bigest e-commerce website in Middle East ( Egypt, KSA and UAE).\n\nBusiness application\n\nSome common applications related to electronic commerce are:\n\nGovernmental regulation\n\nIn the United States, certain electronic commerce activities are regulated by the Federal Trade Commission (FTC). These activities include but not limit to the use of commercial e-mails, online advertising and consumer privacy. The CAN-SPAM Act of 2003 establishes national standards for direct marketing over e-mail. The Federal Trade Commission Act regulates all forms of advertising, including online advertising, and states that advertising must be truthful and non-deceptive. Using its authority under Section 5 of the FTC Act, which prohibits unfair or deceptive practices, the FTC has brought a number of cases to enforce the promises in corporate privacy statements, including promises about the security of consumers' personal information. As a result, any corporate privacy policy related to e-commerce activity may be subject to enforcement by the FTC.\n\nThe Ryan Haight Online Pharmacy Consumer Protection Act of 2008, which came into law in 2008, amends the Controlled Substances Act to address online pharmacies.\n\nConflict of laws in cyberspace is a major hurdle for harmonization of legal framework for e-commerce around the world. In order to give a uniformity to e-commerce law around the world, many countries adopted the UNCITRAL Model Law on Electronic Commerce (1996).\n\nInternationally there is the International Consumer Protection and Enforcement Network (ICPEN), which was formed in 1991 from an informal network of government customer fair trade organisations. The purpose was stated as being to find ways of co-operating on tackling consumer problems connected with cross-border transactions in both goods and services, and to help ensure exchanges of information among the participants for mutual benefit and understanding. From this came Econsumer.gov, an ICPEN initiative since April 2001. It is a portal to report complaints about online and related transactions with foreign companies.\n\nThere is also Asia Pacific Economic Cooperation (APEC) was established in 1989 with the vision of achieving stability, security and prosperity for the region through free and open trade and investment. APEC has an Electronic Commerce Steering Group as well as working on common privacy regulations throughout the APEC region.\n\nIn Australia, Trade is covered under Australian Treasury Guidelines for electronic commerce and the Australian Competition and Consumer Commission regulates and offers advice on how to deal with businesses online, and offers specific advice on what happens if things go wrong.\n\nIn the United Kingdom, The Financial Services Authority (FSA)  was formerly the regulating authority for most aspects of the EU's Payment Services Directive (PSD), until its replacement in 2013 by the Prudential Regulation Authority and the Financial Conduct Authority. The UK implemented the PSD through the Payment Services Regulations 2009 (PSRs), which came into effect on 1 November 2009. The PSR affects firms providing payment services and their customers. These firms include banks, non-bank credit card issuers and non-bank merchant acquirers, e-money issuers, etc. The PSRs created a new class of regulated firms known as payment institutions (PIs), who are subject to prudential requirements. Article 87 of the PSD requires the European Commission to report on the implementation and impact of the PSD by 1 November 2012.\n\nIn India, the Information Technology Act 2000 governs the basic applicability of e-commerce.\n\nIn China, the Telecommunications Regulations of the People's Republic of China (promulgated on 25 September 2000), stipulated the Ministry of Industry and Information Technology (MIIT) as the government department regulating all telecommunications related activities, including electronic commerce. On the same day, The Administrative Measures on Internet Information Services released, is the first administrative regulation to address profit-generating activities conducted through the Internet, and lay the foundation for future regulations governing e-commerce in China. On 28 August 2004, the eleventh session of the tenth NPC Standing Committee adopted The Electronic Signature Law, which regulates data message, electronic signature authentication and legal liability issues. It is considered the first law in China's e-commerce legislation. It was a milestone in the course of improving China's electronic commerce legislation, and also marks the entering of China's rapid development stage for electronic commerce legislation.\n\nForms\n\nContemporary electronic commerce can be classified into categories. The first category is business based on types of goods sold (involves everything from ordering \"digital\" content for immediate online consumption, to ordering conventional goods and services, to \"meta\" services to facilitate other types of electronic commerce). The second category is based on the nature of the participant (B2B, B2C, C2B and C2\nC);\n\nOn the institutional level, big corporations and financial institutions use the internet to exchange financial data to facilitate domestic and international business. Data integrity and security are pressing issues for electronic commerce.\n\nAside from traditional e-commerce, the terms m-Commerce (mobile commerce) as well (around 2013) t-Commerce have also been used.\n\nGlobal trends\n\nIn 2010, the United Kingdom had the highest per capital e-commerce spending in the world. As of 2013, the Czech Republic was the European country where e-commerce delivers the biggest contribution to the enterprises´ total revenue. Almost a quarter (24%) of the country's total turnover is generated via the online channel.\n\nAmong emerging economies, China's e-commerce presence continues to expand every year. With 668 million Internet users, China's online shopping sales reached $253 billion in the first half of 2015, accounting for 10% of total Chinese consumer retail sales in that period. The Chinese retailers have been able to help consumers feel more comfortable shopping online. e-commerce transactions between China and other countries increased 32% to 2.3 trillion yuan ($375.8 billion) in 2012 and accounted for 9.6% of China's total international trade. In 2013, Alibaba had an e-commerce market share of 80% in China. In 2014, there were 600 million Internet users in China (twice as many as in the US), making it the world's biggest online market. China is also the largest e-commerce market in the world by value of sales, with an estimated  in 2016.\n\nIn 2013, Brazil's e-commerce was growing quickly with retail e-commerce sales expected to grow at a double-digit pace through 2014. By 2016, eMarketer expected retail e-commerce sales in Brazil to reach $17.3 billion. India has an Internet user base of about 460 million as of December 2017. Despite being third largest user base in world, the penetration of Internet is low compared to markets like the United States, United Kingdom or France but is growing at a much faster rate, adding around 6 million new entrants every month. In India, cash on delivery is the most preferred payment method, accumulating 75% of the e-retail activities. The India retail market is expected to rise from 2.5% in 2016 to 5% in 2020.\n\nThe rate of growth of the number of internet users in the Arab countries has been rapid – 13.1% in 2015. A significant portion of the e-commerce market in the Middle East comprises people in the 30–34 year age group. Egypt has the largest number of internet users in the region, followed by Saudi Arabia and Morocco; these constitute 3/4th of the region’s share. Yet, internet penetration is low: 35% in Egypt and 65% in Saudi Arabia.\n\nE-commerce has become an important tool for small and large businesses worldwide, not only to sell to customers, but also to engage them.\n\nIn 2012, e-commerce sales topped $1 trillion for the first time in history.\n\nMobile devices are playing an increasing role in the mix of e-commerce, this is also commonly called mobile commerce, or m-commerce. In 2014, one estimate saw purchases made on mobile devices making up 25% of the market by 2017.\n\nFor traditional businesses, one research stated that information technology and cross-border e-commerce is a good opportunity for the rapid development and growth of enterprises. Many companies have invested enormous volume of investment in mobile applications. The DeLone and McLean Model stated that three perspectives contribute to a successful e-business: information system quality, service quality and users' satisfaction. There is no limit of time and space, there are more opportunities to reach out to customers around the world, and to cut down unnecessary intermediate links, thereby reducing the cost price, and can benefit from one on one large customer data analysis, to achieve a high degree of personal customization strategic plan, in order to fully enhance the core competitiveness of the products in company.\n\nLogistics \n\nLogistics in e-commerce mainly concerns fulfillment. Online markets and retailers have to find the best possible way to fill orders and deliver products. Small companies usually control their own logistic operation because they do not have the ability to hire an outside company. Most large companies hire a fulfillment service that takes care of a company's logistic needs.\n\nImpact on markets and retailers\n\nE-commerce markets are growing at noticeable rates. The online market is expected to grow by 56% in 2015–2020. Traditional markets are only expected 2% growth during the same time. Brick and mortar retailers are struggling because of online retailer's ability to offer lower prices and higher efficiency. Many larger retailers are able to maintain a presence offline and online by linking physical and online offerings. \n\nE-commerce allows customers to overcome geographical barriers and allows them to purchase products anytime and from anywhere. Online and traditional markets have different strategies for conducting business. Traditional retailers offer fewer assortment of products because of shelf space where, online retailers often hold no inventory but send customer orders directly to the manufacture. The pricing strategies are also different for traditional and online retailers. Traditional retailers base their prices on store traffic and the cost to keep inventory. Online retailers base prices on the speed of delivery.\n\nThere are two ways for marketers to conduct business through e-commerce: fully online or online along with a brick and mortar store. Online marketers can offer lower prices, greater product selection, and high efficiency rates. Many customers prefer online markets if the products can be delivered quickly at relatively low price. However, online retailers cannot offer the physical experience that traditional retailers can. It can be difficult to judge the quality of a product without the physical experience, which may cause customers to experience product or seller uncertainty. Another issue regarding the online market is concerns about the security of online transactions. Many customers remain loyal to well-known retailers because of this issue.\n\n Security is a primary problem for e-commerce in developed and developing countries. E-commerce security is protecting business' websites and costumers from unauthorized access, use, alteration, or destruction. The type of threats include: malicious codes, unwanted programs (ad ware, spyware), phishing, hacking, and cyber vandalism. E-commerce websites use different tools to avert security threats. These tools include firewalls, encryption software, digital certificates, and passwords.\n\nImpact on supply chain management\n\nFor a long time, companies had been troubled by the gap between the benefits which supply chain technology has and the solutions to deliver those benefits. However, the emergence of e-commerce has provided a more practical and effective way of delivering the benefits of the new supply chain technologies.\n\nE-commerce has the capability to integrate all inter-company and intra-company functions, meaning that the three flows (physical flow, financial flow and information flow) of the supply chain could be also affected by e-commerce. The affections on physical flows improved the way of product and inventory movement level for companies. For the information flows, e-commerce optimised the capacity of information processing than companies used to have, and for the financial flows, e-commerce allows companies to have more efficient payment and settlement solutions.\n\nIn addition, e-commerce has a more sophisticated level of impact on supply chains: Firstly, the performance gap will be eliminated since companies can identify gaps between different levels of supply chains by electronic means of solutions; Secondly, as a result of e-commerce emergence, new capabilities such implementing ERP systems, like SAP ERP, Xero, or Megaventory, have helped companies to manage operations with customers and suppliers. Yet these new capabilities are still not fully exploited. Thirdly, technology companies would keep investing on new e-commerce software solutions as they are expecting investment return. Fourthly, e-commerce would help to solve many aspects of issues that companies may feel difficult to cope with, such as political barriers or cross-country changes. Finally, e-commerce provides companies a more efficient and effective way to collaborate with each other within the supply chain.\n\nImpact on employment \n\nE-commerce helps create new job opportunities due to information related services, software app and digital products. It also causes job losses. The areas with the greatest predicted job-loss are retail, postal, and travel agencies. The development of e-commerce will create jobs that require highly skilled workers to manage large amounts of information, customer demands, and production processes. In contrast, people with poor technical skills cannot enjoy the wages welfare. On the other hand, because e-commerce requires sufficient stocks that could be delivered to customers in time, the warehouse becomes an important element. Warehouse needs more staff to manage, supervise and organize, thus the condition of warehouse environment will be concerned by employees.\n\nImpact on customers \n\nE-commerce brings convenience for customers as they do not have to leave home and only need to browse website online, especially for buying the products which are not sold in nearby shops. It could help customers buy wider range of products and save customers’ time. Consumers also gain power through online shopping. They are able to research products and compare prices among retailers. Also, online shopping often provides sales promotion or discounts code, thus it is more price effective for customers. Moreover, e-commerce provides products’ detailed information; even the in-store staff cannot offer such detailed explanation. Customers can also review and track the order history online. \n\nHowever, e-commerce lacks human interaction for customers, especially who prefer face-to-face connection. Customers are also concerned with the security of online transactions and tend to remain loyal to well-know retailers. When the customer regret the purchase of a product, it involves returning goods and refunding process. This process is inconvenient as customers need to pack and post the goods. If the products are expensive, large or fragile, it refers to safety issues.\n\nSocial impact\n\nE-commerce has huge impact on the economy and society. E-commerce allows for the globalization of markets and created a society based on knowledge and information.\n\nB2B is rapidly growing in the world, that leads to lower cost and then improves the economic efficiency and also bring along the growth of employment.\n\n Employment growth is based on the increase of jobs in specific markets related to e-commerce, such as, new products, market research, software sales, and online service. These jobs affect many countries where e-commerce is thriving. Specific institutions (education, health, government services) may also be affected by e-commerce.\n\nE-commerce is not a new industry, technically speaking, but it is creating a new economic model. Most people agree that e-commerce will positively impact economic society in the future, but in its early stages its impacts are difficult to gauge. Some have noted that e-commerce is a sort of incorporeal revolution. E-commerce has numerous social benefits: one, the cost of running an e-commerce business is very low when compared with running a physical store; two, there is no rent to pay on expensive premises; and three, business processes are simplified and less man-hours are required to run a typical business smoothly. In the area of law, education, culture and also policy, e-commerce will continue to rise in impact. e-commerce will truly take human beings into the information society.\n\nDistribution channels\n\nE-commerce has grown in importance as companies have adopted pure-click and brick-and-click channel systems. We can distinguish pure-click and brick-and-click channel system adopted by companies.\n* Pure-click or pure-play companies are those that have launched a website without any previous existence as a firm.\n* Bricks-and-clicks companies are those existing companies that have added an online site for e-commerce.\n* Click-to-brick online retailers that later open physical locations to supplement their online efforts.\n\nExamples of new systems\n\nAccording to eMarketer research company, \"by 2017, 65.8 per cent of Britons will use smartphones\".\n\nNew mobile apps such as LINE, WeChat have grown tremendously into ecosystems where hundred of millions of users and businesses can transact with one another.\n\nRecommendation \n\nThe contemporary e-commerce trend recommends companies to shift the traditional business model where focus on \"standardized products, homogeneous market and long product life cycle\" to the new business model where focus on \"varied and customized products\". E-commerce requires the company to have the ability to satisfy multiple needs of different customers and provide them with wider range of products. \n\nWith more choices of products, the information of products for customers to select and meet their needs become crucial. In order to address the mass customization principle to the company, the use of recommender system is suggested. This system helps recommend the proper products to the customers and helps customers make the decision during the purchasing process. The recommender system could be operated through the top sellers on the website, the demographics of customers or the consumers' buying behavior. However, there are 3 main ways of recommendations: recommending products to customers directly, providing detailed products' information and showing other buyers' opinions or critiques. It is benefit for consumer experience without physical shopping. In general, recommender system is used to contact customers online and assist finding the right products they want effectively and directly. E-commerce. http://en.wikipedia.org/?curid=9611."
  }
}
