{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19347",
  "eid" : "3a0a25c0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778606620,
  "textBody" : "Events\n\n* AD 37 – Roman emperor Caligula accepts the titles of the Principate, entitled to him by the Senate.\n* 193 – Roman Emperor Pertinax is assassinated by Praetorian Guards, who then sell the throne in an auction to Didius Julianus.\n* 364 – Roman Emperor Valentinian I appoints his brother Flavius Valens co-emperor.\n*1566 – The foundation stone of Valletta, Malta's capital city, is laid by Jean Parisot de Valette, Grand Master of the Sovereign Military Order of Malta.\n*1737 – The Marathas under Baji Rao I attack and defeat the Mughals in the Battle of Delhi\n*1776 – Juan Bautista de Anza finds the site for the Presidio of San Francisco.\n*1794 – Allies under Prince Josias of Saxe-Coburg-Saalfeld defeat French forces at Le Cateau.\n*1795 – Partitions of Poland: The Duchy of Courland and Semigallia, a northern fief of the Polish–Lithuanian Commonwealth, ceases to exist and becomes part of Imperial Russia.\n*1801 – Treaty of Florence is signed.\n*1802 – Heinrich Wilhelm Matthäus Olbers discovers 2 Pallas, the second asteroid ever to be discovered.\n*1809 – Peninsular War: France defeats Spain in the Battle of Medellín.\n*1814 – War of 1812: In the Battle of Valparaíso, two American naval vessels are captured by two Royal Navy vessels of equal strength.\n*1842 – First concert of the Vienna Philharmonic Orchestra, founded by Otto Nicolai.\n*1854 – Crimean War: France and Britain declare war on Russia.\n*1860 – First Taranaki War: The Battle of Waireka begins.\n*1862 – American Civil War: In the Battle of Glorieta Pass, Union forces stop the Confederate invasion of the New Mexico Territory. The battle began on March 26.\n*1871 – The Paris Commune is formally established in Paris.\n*1883 – Tonkin Campaign: French victory in the Battle of Gia Cuc.\n*1910 – Henri Fabre becomes the first person to fly a seaplane, the Fabre Hydravion, after taking off from a water runway near Martigues, France.\n*1920 – Palm Sunday tornado outbreak of 1920 affects the Great Lakes region and Deep South states.\n*1933 – The Imperial Airways biplane City of Liverpool is believed to be the first airliner lost to sabotage when a passenger sets a fire on board.\n*1939 – Spanish Civil War: Generalissimo Francisco Franco conquers Madrid after a three-year siege.\n*1941 – World War II: Britain's Mediterranean Fleet sinks three heavy cruisers and two destroyers of Italy's Regia Marina.\n*1942 – World War II: A British combined force permanently disables the Louis Joubert Lock in Saint-Nazaire in order to keep the German battleship Tirpitz away from the mid-ocean convoy lanes.\n*1946 – Cold War: The United States Department of State releases the Acheson–Lilienthal Report, outlining a plan for the international control of nuclear power.\n*1951 – First Indochina War: In the Battle of Mạo Khê, French Union forces, led by World War II hero Jean de Lattre de Tassigny, inflict a defeat on Việt Minh forces commanded by General Võ Nguyên Giáp.\n*1959 – The State Council of the People's Republic of China dissolves the government of Tibet.\n*1968 – Brazilian high school student Edson Luís de Lima Souto is killed by military police at a protest for cheaper meals at a restaurant for low-income students.\n*1969 – Greek poet and Nobel Prize laureate Giorgos Seferis makes a famous statement on the BBC World Service opposing the junta in Greece.\n*1970 – An earthquake strikes western Turkey at about 23:05 local time, killing 1,086 and injuring 1,260.\n*1978 – The US Supreme Court hands down 5–3 decision in Stump v. Sparkman, a controversial case involving involuntary sterilization and judicial immunity.\n*1979 – A coolant leak at the Three Mile Island's Unit 2 nuclear reactor outside Harrisburg, Pennsylvania leads to the core overheating and a partial meltdown.\n*  1979   – The British House of Commons passes a vote of no confidence against James Callaghan's government, precipitating a general election.\n*1990 – United States President George H. W. Bush posthumously awards Jesse Owens the Congressional Gold Medal.\n*1994 – In South Africa, African National Congress security guards kill dozens of Inkatha Freedom Party protesters.\n*1999 – Kosovo War: Serb paramilitary and military forces kill 146 Kosovo Albanians in Izbica.\n*2003 – In a friendly fire incident, two American A-10 Thunderbolt II aircraft attack British tanks participating in the 2003 invasion of Iraq, killing one soldier.\n*2005 – An earthquake shakes northern Sumatra with a maximum Mercalli intensity of VI (Strong), leaving 915–1,314 people dead and 340–1,146 injured.\n*2006 – Massive protests are mounted against France's First Employment Contract law, meant to reduce youth unemployment.\n\nBirths\n\n* 623 – Marwan I, Umayyad general and caliph (d. 685)\n* 931 – Liu Chengyou, emperor of Later Han (d. 951)\n*1097 – Atsiz, Abbasid caliph (d. 1156)\n*1416 – Jodha of Mandore, Ruler of Marwar (d. 1489)\n*1468 – Charles I, Duke of Savoy (d. 1490)\n*1472 – Fra Bartolomeo, Italian painter (d. 1517)\n*1483 – Raphael, Italian painter and architect (d. 1520)\n*1515 – Teresa of Ávila, Spanish nun and saint (d. 1582)\n*1522 – Albert the Warlike, German prince (d. 1557)\n*1527 – Isabella Markham, English courtier (d. 1579)\n*1591 – William Cecil, 2nd Earl of Salisbury, English earl (d. 1668)\n*1592 – John Amos Comenius, Czech bishop and educator (d. 1670)\n*1599 – Witte Corneliszoon de With, Dutch captain (d. 1658)\n*1613 – Empress Dowager Xiaozhuang of China (d. 1688)\n*1621 – Heinrich Schwemmer German composer and educator (d. 1696)\n*1638 – Frederik Ruysch, Dutch botanist and anatomist (d. 1731)\n*1652 – Samuel Sewall, English judge (d. 1730)\n*1725 – Andrew Kippis, English minister and author (d. 1795)\n*1727 – Maximilian III Joseph, Elector of Bavaria, (d. 1777)\n*1743 – Yekaterina Vorontsova-Dashkova, Russian academic and politician (d. 1810)\n*1750 – Francisco de Miranda, Venezuelan general and politician, President of Venezuela (d. 1816)\n*1760 – Thomas Clarkson, English activist (d. 1846)\n*1773 – Henri Gatien Bertrand, French general (d. 1844)\n*1793 – Henry Schoolcraft, American geographer, geologist, and ethnologist (d. 1864)\n*1795 – Georg Heinrich Pertz, German historian and author (d. 1876)\n*1806 – Thomas Hare, English lawyer and political scientist (d. 1891)\n*1811 – John Neumann, Czech-American bishop and saint (d. 1860)\n*1815 – Arsène Houssaye, French author and poet (d. 1896)\n*1818 – Wade Hampton III, American general and politician, 77th Governor of South Carolina (d. 1902)\n*1819 – Joseph Bazalgette, English architect and engineer, designed the Hammersmith Bridge and Battersea Bridge (d. 1891)\n*1828 – Melchior Anderegg, Swiss mountain guide (d. 1914)\n*1832 – Henry D. Washburn, American politician, general and explorer (d. 1871)\n*1836 – Frederick Pabst, German-American brewer, founded the Pabst Brewing Company (d. 1904)\n*1840 – Emin Pasha, German-Jewish Egyptian physician and politician (d. 1892)\n*1842 – William Harvey Carney, American sergeant, Medal of Honor recipient (d. 1908)\n*1847 – Gyula Farkas, Jewish-Hungarian mathematician and physicist (d. 1930)\n*1849 – James Darmesteter, French historian and author (d. 1894)\n*1851 – Bernardino Machado, Portuguese academic and politician, 3rd President of Portugal (d. 1944)\n*1862 – Aristide Briand, French politician, Prime Minister of France, Nobel Prize laureate (d. 1932)\n*1866 – Jimmy Ross, Scottish footballer (d. 1902)\n*1868 – Maxim Gorky, Russian novelist, short story writer, and playwright (d. 1936)\n*1871 – Willem Mengelberg, Dutch-Swiss conductor (d. 1951)\n*1873 – John Geiger, American rower (d. 1956)\n*1878 – Abraham Walkowitz, Russian-born American painter (d. 1965)\n*1879 – Terence MacSwiney, Irish republican politician and hunger striker; Lord Mayor of Cork (d. 1920)\n*1881 – Martin Sheridan, Irish-American discus thrower and jumper (d. 1918)\n*1884 – Angelos Sikelianos, Greek poet and playwright (d. 1951)\n*1886 – Gustave Mesny, French general (d. 1945)\n*1890 – Paul Whiteman, American violinist, composer, and bandleader (d. 1967)\n*1892 – Corneille Heymans, Belgian physiologist and academic, Nobel Prize laureate (d. 1968)\n*  1892   – Tom Maguire, Irish general (d. 1993)\n*1893 – Spyros Skouras, Greek-American businessman (d. 1971)\n*1894 – Ernst Lindemann, German captain (d. 1941)\n*1895 – Ángela Ruiz Robles, Spanish teacher, writer and inventor, pioneer of the electronic book (d. 1975)\n*1895 – Christian Herter, American politician, 53rd United States Secretary of State (d. 1966)\n*  1895   – Donald Grey Barnhouse, American pastor and theologian (d. 1960)\n*  1895   – Spencer W. Kimball, American religious leader, 12th President of The Church of Jesus Christ of Latter-day Saints (d. 1985)\n*1897 – Sepp Herberger, German footballer and manager (d. 1977)\n*  1897   – Tillie Voss, American football player (d. 1975)\n*1899 – Gussie Busch, American businessman (d. 1989)\n*  1899   – Harold B. Lee, American religious leader, 11th President of The Church of Jesus Christ of Latter-day Saints (d. 1973)\n*  1899   – Buck Shaw, American football player and coach (d. 1977)\n*1900 – Edward Wagenknecht, American critic and educator (d. 2004)\n*1902 – Flora Robson, English actress (d. 1984)\n*  1902   – Jaromír Vejvoda, Czech fiddler and composer (d. 1988)\n*1903 – Rudolf Serkin, Czech-American pianist and educator (d. 1991)\n*1904 – Isabel Cuchí Coll, Puerto Rican author and journalist (d. 1993) \n*1905 – Pandro S. Berman, American production manager and producer (d. 1996)\n*  1905   – Marlin Perkins, American zoologist and television host (d. 1986)\n*1906 – Murray Adaskin, Canadian violinist, composer, and conductor (d. 2002)\n*  1906   – Robert Allen, American actor (d. 1998)\n*  1906   – Dorothy Knowles, South African-English author, fencer and academic (d. 2010)\n*1907 – Lúcia Santos, Portuguese nun (d. 2005)\n*1907 – Norrey Ford, English author (d. 1985)\n*  1907   – Irving Paul Lazar, American lawyer and talent agent (d. 1993)\n*1909 – Nelson Algren, American novelist and short story writer (d. 1981)\n*1910 – Frederick Baldwin Adams, Jr., American librarian and art collector (d. 2001)\n*  1910   – Jimmie Dodd, American actor and singer-songwriter (d. 1964)\n*  1910   – Ingrid of Sweden, (d. 2000)\n*1911 – Consalvo Sanesi, Italian race car driver (d. 1998)\n*1912 – A. Bertram Chandler, English-Australian author (d. 1984)\n*  1912   – Marina Raskova, Russian pilot and navigator (d. 1943)\n*1913 – Kazuo Taoka, Japanese crime boss (d. 1981)\n*  1913   – Toko Shinoda, Japanese artist\n*1914 – Edward Anhalt, American screenwriter and producer (d. 2000)\n*  1914   – Bohumil Hrabal, Czech author (d. 1997)\n*  1914   – Kenneth Richard Norris, Australian entomologist and academic (d. 2003)\n*  1914   – Edmund Muskie, American lieutenant, lawyer, and politician, 58th United States Secretary of State (d. 1996)\n*  1914   – Everett Ruess, American explorer, poet, and painter (d. 1934)\n*1915 – Jay Livingston, American singer-songwriter (d. 2001)\n*1915 – Jeremy Hutchinson, Baron Hutchinson of Lullington, English lawyer (d. 2017)\n*1917 – Claude Bertrand, Canadian neurosurgeon and scholar (d. 2014)\n*1918 – Edward Amy, Canadian soldier (d. 2011)\n*1919 – Jacob Avshalomov, American composer and conductor (d. 2013)\n*  1919   – Tom Brooks, Australian cricket umpire (d. 2007)\n*  1919   – Vic Raschi, American baseball player and coach (d. 1988)\n*1921 – Harold Agnew, American physicist and academic (d. 2013)\n*  1921   – Dirk Bogarde, English actor and author (d. 1999)\n*  1921   – Herschel Grynszpan, German assassin of Ernst vom Rath (d. 1960)\n*  1921   – Walter Neugebauer, Croatian-German author and illustrator (d. 1992)\n*1922 – Neville Bonner, Australian politician (d. 1999)\n*  1922   – Grace Hartigan, American painter and educator (d. 2008)\n*  1922   – Joey Maxim, American boxer and actor (d. 2001)\n*  1922   – B. Neminathan, Sri Lankan politician\n*1923 – Paul C. Donnelly, American scientist and engineer (d. 2014)\n*  1923   – Thad Jones, American trumpet player and composer (d. 1986)\n*  1923   – René Vuaillat, French engineer and inventor \n*1924 – Freddie Bartholomew, American actor (d. 1992)\n*  1924   – Fred Flanagan, Australian footballer (d. 2013)\n*  1924   – Byrd Baylor, American author\n*1925 – Innokenty Smoktunovsky, Russian actor (d. 1994)\n*1926 – Cayetana Fitz-James Stuart, 18th Duchess of Alba (d. 2014)\n*  1926   – Polly Umrigar, Indian cricketer (d. 2006)\n*1927 – Theo Colborn, American zoologist and academic (d. 2014)\n*  1927   – Marianne Fredriksson, Swedish journalist and author (d. 2007)\n*  1927   – Vina Mazumdar, Indian academic and activist (d. 2013)\n*1928 – Zbigniew Brzezinski, Polish-American political activist and analyst; 10th United States National Security Advisor (d. 2017)\n*  1928   – Alexander Grothendieck, German-French mathematician and theorist (d. 2014)\n*1929 – Paul England, Australian race car driver and engineer (d. 2014)\n*1930 – Robert Ashley, American soldier and composer (d. 2014)\n*  1930   – Jerome Isaac Friedman, American physicist and academic, Nobel Prize laureate\n*  1930   – Elizabeth Bainbridge, English soprano\n*1933 – Tete Montoliu, Spanish pianist (d. 1997)\n*  1933   – Frank Murkowski, American soldier, banker, and politician, 8th Governor of Alaska\n*1934 – Lester R. Brown, American environmentalist, founded the Earth Policy Institute and Worldwatch Institute\n*  1934   – Laurie Taitt, Guyanese-English hurdler (d. 2006)\n*1935 – Frank Judd, Baron Judd, English politician, Secretary of State for International Development\n*  1935   – Michael Parkinson, English journalist and author\n*  1935   – Józef Szmidt, Polish triple jumper\n*1936 – Mario Vargas Llosa, Peruvian novelist, playwright, and essayist Nobel Prize laureate\n*1938 – Hans-Jürgen Bäsler, German footballer (d. 2002)\n*1939 – Dov Frohman, Israeli electrical engineer and business executive\n*1940 – Tony Barber, English-Australian television host\n*  1940   – Luis Cubilla, Uruguayan footballer and coach (d. 2013)\n*1941 – Alf Clausen, American composer and producer\n*  1941   – Philip Fang, Hong Kong simultaneous interpretation specialist, United Nations official (d. 2013)\n*  1941   – Jeffrey Moussaieff Masson, American author and academic\n*  1941   – Jack Simmons, English cricketer\n*  1941   – Jim Turner, American football player and sportscaster\n*1942 – Daniel Dennett, American philosopher and academic\n*  1942   – Kitanofuji Katsuaki, Japanese sumo wrestler, the 52nd Yokozuna\n*  1942   – Neil Kinnock, Welsh politician, Vice-President of the European Commission\n*  1942   – Mike Newell, English director and producer\n*  1942   – Samuel Ramey, American opera singer\n*  1942   – Jerry Sloan, American basketball player and coach\n*1943 – Richard Eyre, English director, producer, and screenwriter\n*  1943   – Conchata Ferrell, American actress\n*1944 – Rick Barry, American basketball player and sportscaster\n*  1944   – Ken Howard, American actor (d. 2016)\n*1945 – Rodrigo Duterte, Filipino politician, 16th President of the Philippines\n*  1945   – Johnny Famechon, French-Australian boxer \n*  1945   – Björn Hamilton, Swedish engineer and politician\n*1946 – Wubbo Ockels, Dutch physicist and astronaut (d. 2014)\n*  1946   – Henry Paulson, American banker and politician, 74th United States Secretary of the Treasury\n*  1946   – Alejandro Toledo, Peruvian economist and politician, 48th President of Peru\n*1947 – Greg Thompson, Canadian educator and politician, 25th Minister of Veterans Affairs\n*1948 – John Evan, English keyboard player and songwriter (Jethro Tull)\n*  1948   – Dianne Wiest, American actress\n*  1948   – Milan Williams, American keyboard player (d. 2006)\n*1949 – Ronnie Ray Smith, American sprinter (d. 2013)\n*1952 – Keith Ashfield, Canadian politician\n*  1952   – Tony Brise, English race car driver (d. 1975)\n*1953 – Melchior Ndadaye, Burundian banker and politician, 4th President of Burundi (d. 1993)\n*1954 – Donald Brown, American pianist and educator \n*1955 – John Alderdice, Baron Alderdice, Northern Irish psychiatrist and politician, 1st Speaker of the Northern Ireland Assembly\n*  1955   – Reba McEntire, American singer-songwriter, producer, and actress\n*1956 – Susan Ershler, American mountaineer and author\n*1957 – Harvey Glance, American sprinter and coach\n*1958 – Edesio Alejandro, Cuban composer\n*  1958   – Elisabeth Andreassen, Swedish-Norwegian singer\n*  1958   – Bart Conner, American gymnast and sportscaster\n*  1958   – Curt Hennig, American wrestler, manager, and sportscaster (d. 2003)\n*1959 – Laura Chinchilla, Costa Rican politician, President of Costa Rica\n*  1959   – Chris Myers, American journalist and sportscaster\n*1960 – Chris Barrie, British actor and comedian\n*  1960   – José Maria Neves, Cape Verdeian politician, Prime Minister of Cape Verde\n*  1960   – Éric-Emmanuel Schmitt, French-Belgian author and playwright\n*1961 – Byron Scott, American basketball player and coach\n*1962 – Jure Franko, Slovenian skier\n*1962 – Simon Bazalgette, English businessman\n*1963 – Jan Masiel, Polish politician\n*1964 – Karen Lumley, English politician\n*1966 – Cheryl James, American rapper and actress\n*1967 – John Ziegler, German-American radio host and director\n*1968 – Iris Chang, Chinese-American journalist and author (d. 2004)\n*  1968   – Nasser Hussain, Indian-English cricketer and sportscaster\n*1968 – Colin Brazier, English journalist\n*1969 – Rodney Atkins, American singer-songwriter and guitarist\n*  1969   – Brett Ratner, American director and producer\n*1970 – Vince Vaughn, American actor\n*  1970   – Jennifer Weiner, Jewish-American journalist and author\n*1971 – Christianne Meneses Jacobs, Nicaraguan-American journalist and educator\n*1972 – Nick Frost, English actor and screenwriter\n*  1972   – Keith Tkachuk, American ice hockey player\n*1973 – Björn Kuipers, Dutch footballer and referee\n*1975 – Fabrizio Gollin, Italian race car driver \n*  1975   – Kate Gosselin, American television personality\n*  1975   – Iván Helguera, Spanish footballer\n*1976 – Dave Keuning, American singer-songwriter and guitarist \n*1977 – Lauren Weisberger, American author\n*1978 – Nathan Cayless, Australian-NewZealand rugby league player\n*1980 – David Lee, English footballer\n*  1980   – Rasmus Seebach, Danish singer-songwriter and producer\n*  1980   – Luke Walton, American basketball player\n*1981 – Edwar Ramírez, American baseball player\n*  1981   – Julia Stiles, American actress\n*1983 – Ladji Doucouré, French sprinter and hurdler\n*1984 – Christopher Samba, Congolese footballer\n*1985 – Stefano Ferrario, Italian footballer\n*  1985   – Stanislas Wawrinka, Swiss tennis player\n*1986 – Lady Gaga, American singer-songwriter, dancer, producer, and actress\n*  1986   – J-Kwon, American rapper\n*  1986   – Bowe Bergdahl, American sergeant\n*  1986   – Barbora Záhlavová-Strýcová, Czech tennis player\n*1987 – Yohan Benalouane, French-Tunisian footballer  \n*  1987   – Simeon Jackson, Canadian soccer player\n*1988 – Ryan Kalish, American baseball player\n*1989 – David Goodwillie, Scottish footballer\n*  1989   – Lukas Jutkiewicz, English footballer\n*  1989   – Marek Suchý, Czech footballer\n*1990 – Joe Bennett, English footballer\n*  1990   – Zac Clarke, Australian footballer\n*  1990   – Zoella (Zoe Sugg), English Youtuber\n*1991 – Lisa-Maria Moser, Austrian tennis player\n*  1991   – Marie-Philip Poulin, Canadian ice hockey player\n*1992 – Sergi Gómez, Spanish footballer\n*1994 – Jackson Wang, member of South Korean boy band GOT7\n\nDeaths\n\n* 193 – Pertinax, Roman emperor (b. 126)\n* 741 – Hatsusebe, Japanese princess\n* 965 – Arnulf I, count of Flanders \n* 966 – Flodoard, Frankish canon and chronicler\n*1072 – Ordulf, Duke of Saxony (b. 1022)\n*1134 – Saint Stephen Harding, founder of the Cistercian order\n*1239 – Emperor Go-Toba of Japan (b. 1180)\n*1241 – Valdemar II of Denmark (b. 1170)\n*1254 – William de Ferrers, 5th Earl of Derby (b. 1193)\n*1285 – Pope Martin IV (b. 1220)\n*1346 – Venturino of Bergamo, Dominican preacher (b. 1304)\n*1461 – John Clifford, 9th Baron de Clifford (b. 1435)\n*1563 – Heinrich Glarean, Swiss poet and theorist (b. 1488)\n*1566 – Sigismund von Herberstein, Austrian historian and diplomat (b. 1486)\n*1583 – Magnus, Duke of Holstein (b. 1540)\n*1584 – Ivan the Terrible, Russian king (b. 1530)\n*1687 – Constantijn Huygens, Dutch poet and composer (b. 1596)\n*1794 – Marquis de Condorcet, French mathematician and philosopher (b. 1743)\n*1818 – Antonio Capuzzi, Italian violinist and composer (b. 1755)\n*1865 – Petrus Hofman Peerlkamp, Dutch scholar and critic (b. 1786)\n*1866 – Solomon Foot, American lawyer and politician (b. 1802)\n*1868 – James Brudenell, 7th Earl of Cardigan, English lieutenant and politician (b. 1797)\n*1870 – George Henry Thomas, American general (b. 1816)\n*1874 – Peter Andreas Hansen, Danish-German astronomer and mathematician (b. 1795)\n*1881 – Modest Mussorgsky, Russian pianist and composer (b. 1839)\n*1893 – Edmund Kirby Smith, American general (b. 1824)\n*1910 – Édouard Colonne, French violinist and conductor (b. 1838)\n*1917 – Albert Pinkham Ryder, American painter (b. 1847)\n*1923 – Charles Hubbard, American archer (b. 1849)\n*1927 – Joseph-Médard Émard, Canadian archbishop (b. 1853)\n*1929 – Katharine Lee Bates, American poet and songwriter (b. 1859)\n*  1929   – Lomer Gouin, Canadian lawyer and politician, 13th Premier of Quebec (b. 1861)\n*1934 – Mahmoud Mokhtar, Egyptian sculptor and educator (b. 1891)\n*1941 – Marcus Hurley, American basketball player and cyclist (b. 1883)\n*  1941   – Kavasji Jamshedji Petigara, Indian police officer (b. 1877)\n*  1941   – Virginia Woolf, English novelist, essayist, short story writer, and critic (b. 1882)\n*1942 – Miguel Hernández, Spanish poet and playwright (b. 1910)\n*1943 – Sergei Rachmaninoff, Russian pianist, composer, and conductor (b. 1873)\n*1944 – Stephen Leacock, English-Canadian political scientist and author (b. 1869)\n*1947 – Karol Świerczewski, Polish general (b. 1897)\n*1949 – Grigoraș Dinicu, Romanian violinist and composer (b. 1889)\n*1953 – Jim Thorpe, American football player and coach (b. 1887)\n*1958 – W. C. Handy, American trumpet player and composer (b. 1873)\n*1962 – Hugo Wast, Argentinian author and screenwriter (b. 1883)\n*1963 – Antonius Bouwens, Dutch target shooter (b. 1876)\n*1965 – Clemence Dane, English author and playwright (b. 1888)\n*  1965   – Jack Hoxie, American actor (b. 1885)\n*1969 – Dwight D. Eisenhower, American general and politician, 34th President of the United States (b. 1890)\n*1971 – Robert Hunter, American golfer (b. 1886)\n*1972 – Donie Bush, American baseball player, manager, and team owner (b. 1887)\n*1974 – Arthur Crudup, American singer-songwriter and guitarist (b. 1905)\n*  1974   – Dorothy Fields, American songwriter (b. 1905)\n*  1974   – Françoise Rosay, French actress (b. 1891)\n*1976 – Richard Arlen, American actor (b. 1898)\n*1977 – Eric Shipton, Sri Lankan-English mountaineer and explorer (b. 1907)\n*1980 – Dick Haymes, Argentinian-American actor and singer (b. 1918)\n*1982 – William Giauque, Canadian chemist and academic, Nobel Prize laureate (b. 1895)\n*1984 – Carmen Dragon, American conductor and composer (b. 1914)\n*1985 – Marc Chagall, Russian-French painter and poet (b. 1887)\n*1986 – Virginia Gilmore. American actress (b. 1919)\n*1987 – Maria von Trapp, Austrian-American singer (b. 1905)\n*1992 – Nikolaos Platon, Greek archaeologist and academic (b. 1909)\n*1993 – Scott Cunningham, American author (b. 1956)\n*1994 – Eugène Ionesco, Romanian-French playwright and critic (b. 1909)\n*1996 – Shin Kanemaru, Japanese politician, Deputy Prime Minister of Japan (b. 1914) \n*1999 – Franco Gasparri, Italian actor (b. 1948)\n*2000 – Anthony Powell, English soldier and author (b. 1905)\n*2001 – Moe Koffman, Canadian flute player, saxophonist, and composer (b. 1928)\n*2004 – Peter Ustinov, English-Swiss actor, director, producer, and screenwriter (b. 1921)\n*2005 – Moura Lympany, English-Monacan pianist (b. 1916)\n*  2005   – Robin Spry, Canadian director, producer, and screenwriter (b. 1939)\n*2006 – Pro Hart, Australian painter (b. 1928)\n*  2006   – Vethathiri Maharishi, Indian philosopher and author (b. 1911)\n*  2006   – Charles Schepens, Belgian-American ophthalmologist and author (b. 1912)\n*  2006   – Caspar Weinberger, American captain, lawyer, and politician, 15th United States Secretary of Defense (b. 1917)\n*2009 – Maurice Jarre, French-American composer and conductor (b. 1924)\n*2010 – June Havoc, American actress, dancer, and director (b. 1912)\n*2011 – Wenche Foss, Norwegian actress (b. 1917)\n*2012 – John Arden, English author and playwright (b. 1930)\n*  2012   – Alexander Arutiunian, Armenian pianist and composer (b. 1920)\n*  2012   – Harry Crews, American novelist, playwright, short story writer, and essayist (b. 1935)\n*2013 – George E. P. Box, English-American statistician and educator (b. 1919)\n*  2013   – Manuel García Ferré, Spanish-Argentinian director, producer, and screenwriter (b. 1929)\n*  2013   – Richard Griffiths, English actor (b. 1947)\n*  2013   – Art Malone, American race car driver (b. 1936)\n*  2013   – Hugh McCracken, American guitarist, harmonica player, and producer (b. 1942)\n*  2013   – Heinz Patzig, German footballer and manager (b. 1929)\n*  2013   – Bob Teague, American college football star and television news-reporter (b. 1929)\n*  2013   – Gus Triandos, American baseball player and scout (b. 1930)\n*  2013   – Robert Zildjian, American businessman, founded Sabian (b. 1923)\n*2014 – Jeremiah Denton, American admiral and politician (b. 1924)\n*  2014   – Lorenzo Semple, Jr., American screenwriter and producer (b. 1923)\n*  2014   – Avraham Yaski, Israeli architect and academic (b. 1927)\n*2015 – Chuck Brayton, American baseball player and coach (b. 1925)\n*  2015   – Joseph Cassidy, Canadian-English priest and academic (b. 1954)\n*  2015   – Miroslav Ondříček, Czech cinematographer (b. 1934)\n*  2015   – Gene Saks, American actor and director (b. 1921)\n*  2015   – Walter Schuck, German lieutenant and pilot (b. 1920)\n*2016 – James Noble, American actor (b. 1922)\n\nHolidays and observances\n\n*Christian feast day:\n**Stephen Harding\n**Guntram\n**Priscus\n**Pope Sixtus III\n**March 28 (Eastern Orthodox liturgics)\n*Commemoration of Sen no Rikyū (Schools of Japanese tea ceremony)\n*Serfs Emancipation Day (Tibet)\n*Teachers' Day (Czech Republic and Slovakia)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "March 28" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19347" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* AD 37 – Roman emperor Caligula accepts the titles of the Principate, entitled to him by the Senate.\n* 193 – Roman Emperor Pertinax is assassinated by Praetorian Guards, who then sell the throne in an auction to Didius Julianus.\n* 364 – Roman Emperor Valentinian I appoints his brother Flavius Valens co-emperor.\n*1566 – The foundation stone of Valletta, Malta's capital city, is laid by Jean Parisot de Valette, Grand Master of the Sovereign Military Order of Malta.\n*1737 – The Marathas under Baji Rao I attack and defeat the Mughals in the Battle of Delhi\n*1776 – Juan Bautista de Anza finds the site for the Presidio of San Francisco.\n*1794 – Allies under Prince Josias of Saxe-Coburg-Saalfeld defeat French forces at Le Cateau.\n*1795 – Partitions of Poland: The Duchy of Courland and Semigallia, a northern fief of the Polish–Lithuanian Commonwealth, ceases to exist and becomes part of Imperial Russia.\n*1801 – Treaty of Florence is signed.\n*1802 – Heinrich Wilhelm Matthäus Olbers discovers 2 Pallas, the second asteroid ever to be discovered.\n*1809 – Peninsular War: France defeats Spain in the Battle of Medellín.\n*1814 – War of 1812: In the Battle of Valparaíso, two American naval vessels are captured by two Royal Navy vessels of equal strength.\n*1842 – First concert of the Vienna Philharmonic Orchestra, founded by Otto Nicolai.\n*1854 – Crimean War: France and Britain declare war on Russia.\n*1860 – First Taranaki War: The Battle of Waireka begins.\n*1862 – American Civil War: In the Battle of Glorieta Pass, Union forces stop the Confederate invasion of the New Mexico Territory. The battle began on March 26.\n*1871 – The Paris Commune is formally established in Paris.\n*1883 – Tonkin Campaign: French victory in the Battle of Gia Cuc.\n*1910 – Henri Fabre becomes the first person to fly a seaplane, the Fabre Hydravion, after taking off from a water runway near Martigues, France.\n*1920 – Palm Sunday tornado outbreak of 1920 affects the Great Lakes region and Deep South states.\n*1933 – The Imperial Airways biplane City of Liverpool is believed to be the first airliner lost to sabotage when a passenger sets a fire on board.\n*1939 – Spanish Civil War: Generalissimo Francisco Franco conquers Madrid after a three-year siege.\n*1941 – World War II: Britain's Mediterranean Fleet sinks three heavy cruisers and two destroyers of Italy's Regia Marina.\n*1942 – World War II: A British combined force permanently disables the Louis Joubert Lock in Saint-Nazaire in order to keep the German battleship Tirpitz away from the mid-ocean convoy lanes.\n*1946 – Cold War: The United States Department of State releases the Acheson–Lilienthal Report, outlining a plan for the international control of nuclear power.\n*1951 – First Indochina War: In the Battle of Mạo Khê, French Union forces, led by World War II hero Jean de Lattre de Tassigny, inflict a defeat on Việt Minh forces commanded by General Võ Nguyên Giáp.\n*1959 – The State Council of the People's Republic of China dissolves the government of Tibet.\n*1968 – Brazilian high school student Edson Luís de Lima Souto is killed by military police at a protest for cheaper meals at a restaurant for low-income students.\n*1969 – Greek poet and Nobel Prize laureate Giorgos Seferis makes a famous statement on the BBC World Service opposing the junta in Greece.\n*1970 – An earthquake strikes western Turkey at about 23:05 local time, killing 1,086 and injuring 1,260.\n*1978 – The US Supreme Court hands down 5–3 decision in Stump v. Sparkman, a controversial case involving involuntary sterilization and judicial immunity.\n*1979 – A coolant leak at the Three Mile Island's Unit 2 nuclear reactor outside Harrisburg, Pennsylvania leads to the core overheating and a partial meltdown.\n*  1979   – The British House of Commons passes a vote of no confidence against James Callaghan's government, precipitating a general election.\n*1990 – United States President George H. W. Bush posthumously awards Jesse Owens the Congressional Gold Medal.\n*1994 – In South Africa, African National Congress security guards kill dozens of Inkatha Freedom Party protesters.\n*1999 – Kosovo War: Serb paramilitary and military forces kill 146 Kosovo Albanians in Izbica.\n*2003 – In a friendly fire incident, two American A-10 Thunderbolt II aircraft attack British tanks participating in the 2003 invasion of Iraq, killing one soldier.\n*2005 – An earthquake shakes northern Sumatra with a maximum Mercalli intensity of VI (Strong), leaving 915–1,314 people dead and 340–1,146 injured.\n*2006 – Massive protests are mounted against France's First Employment Contract law, meant to reduce youth unemployment.\n\nBirths\n\n* 623 – Marwan I, Umayyad general and caliph (d. 685)\n* 931 – Liu Chengyou, emperor of Later Han (d. 951)\n*1097 – Atsiz, Abbasid caliph (d. 1156)\n*1416 – Jodha of Mandore, Ruler of Marwar (d. 1489)\n*1468 – Charles I, Duke of Savoy (d. 1490)\n*1472 – Fra Bartolomeo, Italian painter (d. 1517)\n*1483 – Raphael, Italian painter and architect (d. 1520)\n*1515 – Teresa of Ávila, Spanish nun and saint (d. 1582)\n*1522 – Albert the Warlike, German prince (d. 1557)\n*1527 – Isabella Markham, English courtier (d. 1579)\n*1591 – William Cecil, 2nd Earl of Salisbury, English earl (d. 1668)\n*1592 – John Amos Comenius, Czech bishop and educator (d. 1670)\n*1599 – Witte Corneliszoon de With, Dutch captain (d. 1658)\n*1613 – Empress Dowager Xiaozhuang of China (d. 1688)\n*1621 – Heinrich Schwemmer German composer and educator (d. 1696)\n*1638 – Frederik Ruysch, Dutch botanist and anatomist (d. 1731)\n*1652 – Samuel Sewall, English judge (d. 1730)\n*1725 – Andrew Kippis, English minister and author (d. 1795)\n*1727 – Maximilian III Joseph, Elector of Bavaria, (d. 1777)\n*1743 – Yekaterina Vorontsova-Dashkova, Russian academic and politician (d. 1810)\n*1750 – Francisco de Miranda, Venezuelan general and politician, President of Venezuela (d. 1816)\n*1760 – Thomas Clarkson, English activist (d. 1846)\n*1773 – Henri Gatien Bertrand, French general (d. 1844)\n*1793 – Henry Schoolcraft, American geographer, geologist, and ethnologist (d. 1864)\n*1795 – Georg Heinrich Pertz, German historian and author (d. 1876)\n*1806 – Thomas Hare, English lawyer and political scientist (d. 1891)\n*1811 – John Neumann, Czech-American bishop and saint (d. 1860)\n*1815 – Arsène Houssaye, French author and poet (d. 1896)\n*1818 – Wade Hampton III, American general and politician, 77th Governor of South Carolina (d. 1902)\n*1819 – Joseph Bazalgette, English architect and engineer, designed the Hammersmith Bridge and Battersea Bridge (d. 1891)\n*1828 – Melchior Anderegg, Swiss mountain guide (d. 1914)\n*1832 – Henry D. Washburn, American politician, general and explorer (d. 1871)\n*1836 – Frederick Pabst, German-American brewer, founded the Pabst Brewing Company (d. 1904)\n*1840 – Emin Pasha, German-Jewish Egyptian physician and politician (d. 1892)\n*1842 – William Harvey Carney, American sergeant, Medal of Honor recipient (d. 1908)\n*1847 – Gyula Farkas, Jewish-Hungarian mathematician and physicist (d. 1930)\n*1849 – James Darmesteter, French historian and author (d. 1894)\n*1851 – Bernardino Machado, Portuguese academic and politician, 3rd President of Portugal (d. 1944)\n*1862 – Aristide Briand, French politician, Prime Minister of France, Nobel Prize laureate (d. 1932)\n*1866 – Jimmy Ross, Scottish footballer (d. 1902)\n*1868 – Maxim Gorky, Russian novelist, short story writer, and playwright (d. 1936)\n*1871 – Willem Mengelberg, Dutch-Swiss conductor (d. 1951)\n*1873 – John Geiger, American rower (d. 1956)\n*1878 – Abraham Walkowitz, Russian-born American painter (d. 1965)\n*1879 – Terence MacSwiney, Irish republican politician and hunger striker; Lord Mayor of Cork (d. 1920)\n*1881 – Martin Sheridan, Irish-American discus thrower and jumper (d. 1918)\n*1884 – Angelos Sikelianos, Greek poet and playwright (d. 1951)\n*1886 – Gustave Mesny, French general (d. 1945)\n*1890 – Paul Whiteman, American violinist, composer, and bandleader (d. 1967)\n*1892 – Corneille Heymans, Belgian physiologist and academic, Nobel Prize laureate (d. 1968)\n*  1892   – Tom Maguire, Irish general (d. 1993)\n*1893 – Spyros Skouras, Greek-American businessman (d. 1971)\n*1894 – Ernst Lindemann, German captain (d. 1941)\n*1895 – Ángela Ruiz Robles, Spanish teacher, writer and inventor, pioneer of the electronic book (d. 1975)\n*1895 – Christian Herter, American politician, 53rd United States Secretary of State (d. 1966)\n*  1895   – Donald Grey Barnhouse, American pastor and theologian (d. 1960)\n*  1895   – Spencer W. Kimball, American religious leader, 12th President of The Church of Jesus Christ of Latter-day Saints (d. 1985)\n*1897 – Sepp Herberger, German footballer and manager (d. 1977)\n*  1897   – Tillie Voss, American football player (d. 1975)\n*1899 – Gussie Busch, American businessman (d. 1989)\n*  1899   – Harold B. Lee, American religious leader, 11th President of The Church of Jesus Christ of Latter-day Saints (d. 1973)\n*  1899   – Buck Shaw, American football player and coach (d. 1977)\n*1900 – Edward Wagenknecht, American critic and educator (d. 2004)\n*1902 – Flora Robson, English actress (d. 1984)\n*  1902   – Jaromír Vejvoda, Czech fiddler and composer (d. 1988)\n*1903 – Rudolf Serkin, Czech-American pianist and educator (d. 1991)\n*1904 – Isabel Cuchí Coll, Puerto Rican author and journalist (d. 1993) \n*1905 – Pandro S. Berman, American production manager and producer (d. 1996)\n*  1905   – Marlin Perkins, American zoologist and television host (d. 1986)\n*1906 – Murray Adaskin, Canadian violinist, composer, and conductor (d. 2002)\n*  1906   – Robert Allen, American actor (d. 1998)\n*  1906   – Dorothy Knowles, South African-English author, fencer and academic (d. 2010)\n*1907 – Lúcia Santos, Portuguese nun (d. 2005)\n*1907 – Norrey Ford, English author (d. 1985)\n*  1907   – Irving Paul Lazar, American lawyer and talent agent (d. 1993)\n*1909 – Nelson Algren, American novelist and short story writer (d. 1981)\n*1910 – Frederick Baldwin Adams, Jr., American librarian and art collector (d. 2001)\n*  1910   – Jimmie Dodd, American actor and singer-songwriter (d. 1964)\n*  1910   – Ingrid of Sweden, (d. 2000)\n*1911 – Consalvo Sanesi, Italian race car driver (d. 1998)\n*1912 – A. Bertram Chandler, English-Australian author (d. 1984)\n*  1912   – Marina Raskova, Russian pilot and navigator (d. 1943)\n*1913 – Kazuo Taoka, Japanese crime boss (d. 1981)\n*  1913   – Toko Shinoda, Japanese artist\n*1914 – Edward Anhalt, American screenwriter and producer (d. 2000)\n*  1914   – Bohumil Hrabal, Czech author (d. 1997)\n*  1914   – Kenneth Richard Norris, Australian entomologist and academic (d. 2003)\n*  1914   – Edmund Muskie, American lieutenant, lawyer, and politician, 58th United States Secretary of State (d. 1996)\n*  1914   – Everett Ruess, American explorer, poet, and painter (d. 1934)\n*1915 – Jay Livingston, American singer-songwriter (d. 2001)\n*1915 – Jeremy Hutchinson, Baron Hutchinson of Lullington, English lawyer (d. 2017)\n*1917 – Claude Bertrand, Canadian neurosurgeon and scholar (d. 2014)\n*1918 – Edward Amy, Canadian soldier (d. 2011)\n*1919 – Jacob Avshalomov, American composer and conductor (d. 2013)\n*  1919   – Tom Brooks, Australian cricket umpire (d. 2007)\n*  1919   – Vic Raschi, American baseball player and coach (d. 1988)\n*1921 – Harold Agnew, American physicist and academic (d. 2013)\n*  1921   – Dirk Bogarde, English actor and author (d. 1999)\n*  1921   – Herschel Grynszpan, German assassin of Ernst vom Rath (d. 1960)\n*  1921   – Walter Neugebauer, Croatian-German author and illustrator (d. 1992)\n*1922 – Neville Bonner, Australian politician (d. 1999)\n*  1922   – Grace Hartigan, American painter and educator (d. 2008)\n*  1922   – Joey Maxim, American boxer and actor (d. 2001)\n*  1922   – B. Neminathan, Sri Lankan politician\n*1923 – Paul C. Donnelly, American scientist and engineer (d. 2014)\n*  1923   – Thad Jones, American trumpet player and composer (d. 1986)\n*  1923   – René Vuaillat, French engineer and inventor \n*1924 – Freddie Bartholomew, American actor (d. 1992)\n*  1924   – Fred Flanagan, Australian footballer (d. 2013)\n*  1924   – Byrd Baylor, American author\n*1925 – Innokenty Smoktunovsky, Russian actor (d. 1994)\n*1926 – Cayetana Fitz-James Stuart, 18th Duchess of Alba (d. 2014)\n*  1926   – Polly Umrigar, Indian cricketer (d. 2006)\n*1927 – Theo Colborn, American zoologist and academic (d. 2014)\n*  1927   – Marianne Fredriksson, Swedish journalist and author (d. 2007)\n*  1927   – Vina Mazumdar, Indian academic and activist (d. 2013)\n*1928 – Zbigniew Brzezinski, Polish-American political activist and analyst; 10th United States National Security Advisor (d. 2017)\n*  1928   – Alexander Grothendieck, German-French mathematician and theorist (d. 2014)\n*1929 – Paul England, Australian race car driver and engineer (d. 2014)\n*1930 – Robert Ashley, American soldier and composer (d. 2014)\n*  1930   – Jerome Isaac Friedman, American physicist and academic, Nobel Prize laureate\n*  1930   – Elizabeth Bainbridge, English soprano\n*1933 – Tete Montoliu, Spanish pianist (d. 1997)\n*  1933   – Frank Murkowski, American soldier, banker, and politician, 8th Governor of Alaska\n*1934 – Lester R. Brown, American environmentalist, founded the Earth Policy Institute and Worldwatch Institute\n*  1934   – Laurie Taitt, Guyanese-English hurdler (d. 2006)\n*1935 – Frank Judd, Baron Judd, English politician, Secretary of State for International Development\n*  1935   – Michael Parkinson, English journalist and author\n*  1935   – Józef Szmidt, Polish triple jumper\n*1936 – Mario Vargas Llosa, Peruvian novelist, playwright, and essayist Nobel Prize laureate\n*1938 – Hans-Jürgen Bäsler, German footballer (d. 2002)\n*1939 – Dov Frohman, Israeli electrical engineer and business executive\n*1940 – Tony Barber, English-Australian television host\n*  1940   – Luis Cubilla, Uruguayan footballer and coach (d. 2013)\n*1941 – Alf Clausen, American composer and producer\n*  1941   – Philip Fang, Hong Kong simultaneous interpretation specialist, United Nations official (d. 2013)\n*  1941   – Jeffrey Moussaieff Masson, American author and academic\n*  1941   – Jack Simmons, English cricketer\n*  1941   – Jim Turner, American football player and sportscaster\n*1942 – Daniel Dennett, American philosopher and academic\n*  1942   – Kitanofuji Katsuaki, Japanese sumo wrestler, the 52nd Yokozuna\n*  1942   – Neil Kinnock, Welsh politician, Vice-President of the European Commission\n*  1942   – Mike Newell, English director and producer\n*  1942   – Samuel Ramey, American opera singer\n*  1942   – Jerry Sloan, American basketball player and coach\n*1943 – Richard Eyre, English director, producer, and screenwriter\n*  1943   – Conchata Ferrell, American actress\n*1944 – Rick Barry, American basketball player and sportscaster\n*  1944   – Ken Howard, American actor (d. 2016)\n*1945 – Rodrigo Duterte, Filipino politician, 16th President of the Philippines\n*  1945   – Johnny Famechon, French-Australian boxer \n*  1945   – Björn Hamilton, Swedish engineer and politician\n*1946 – Wubbo Ockels, Dutch physicist and astronaut (d. 2014)\n*  1946   – Henry Paulson, American banker and politician, 74th United States Secretary of the Treasury\n*  1946   – Alejandro Toledo, Peruvian economist and politician, 48th President of Peru\n*1947 – Greg Thompson, Canadian educator and politician, 25th Minister of Veterans Affairs\n*1948 – John Evan, English keyboard player and songwriter (Jethro Tull)\n*  1948   – Dianne Wiest, American actress\n*  1948   – Milan Williams, American keyboard player (d. 2006)\n*1949 – Ronnie Ray Smith, American sprinter (d. 2013)\n*1952 – Keith Ashfield, Canadian politician\n*  1952   – Tony Brise, English race car driver (d. 1975)\n*1953 – Melchior Ndadaye, Burundian banker and politician, 4th President of Burundi (d. 1993)\n*1954 – Donald Brown, American pianist and educator \n*1955 – John Alderdice, Baron Alderdice, Northern Irish psychiatrist and politician, 1st Speaker of the Northern Ireland Assembly\n*  1955   – Reba McEntire, American singer-songwriter, producer, and actress\n*1956 – Susan Ershler, American mountaineer and author\n*1957 – Harvey Glance, American sprinter and coach\n*1958 – Edesio Alejandro, Cuban composer\n*  1958   – Elisabeth Andreassen, Swedish-Norwegian singer\n*  1958   – Bart Conner, American gymnast and sportscaster\n*  1958   – Curt Hennig, American wrestler, manager, and sportscaster (d. 2003)\n*1959 – Laura Chinchilla, Costa Rican politician, President of Costa Rica\n*  1959   – Chris Myers, American journalist and sportscaster\n*1960 – Chris Barrie, British actor and comedian\n*  1960   – José Maria Neves, Cape Verdeian politician, Prime Minister of Cape Verde\n*  1960   – Éric-Emmanuel Schmitt, French-Belgian author and playwright\n*1961 – Byron Scott, American basketball player and coach\n*1962 – Jure Franko, Slovenian skier\n*1962 – Simon Bazalgette, English businessman\n*1963 – Jan Masiel, Polish politician\n*1964 – Karen Lumley, English politician\n*1966 – Cheryl James, American rapper and actress\n*1967 – John Ziegler, German-American radio host and director\n*1968 – Iris Chang, Chinese-American journalist and author (d. 2004)\n*  1968   – Nasser Hussain, Indian-English cricketer and sportscaster\n*1968 – Colin Brazier, English journalist\n*1969 – Rodney Atkins, American singer-songwriter and guitarist\n*  1969   – Brett Ratner, American director and producer\n*1970 – Vince Vaughn, American actor\n*  1970   – Jennifer Weiner, Jewish-American journalist and author\n*1971 – Christianne Meneses Jacobs, Nicaraguan-American journalist and educator\n*1972 – Nick Frost, English actor and screenwriter\n*  1972   – Keith Tkachuk, American ice hockey player\n*1973 – Björn Kuipers, Dutch footballer and referee\n*1975 – Fabrizio Gollin, Italian race car driver \n*  1975   – Kate Gosselin, American television personality\n*  1975   – Iván Helguera, Spanish footballer\n*1976 – Dave Keuning, American singer-songwriter and guitarist \n*1977 – Lauren Weisberger, American author\n*1978 – Nathan Cayless, Australian-NewZealand rugby league player\n*1980 – David Lee, English footballer\n*  1980   – Rasmus Seebach, Danish singer-songwriter and producer\n*  1980   – Luke Walton, American basketball player\n*1981 – Edwar Ramírez, American baseball player\n*  1981   – Julia Stiles, American actress\n*1983 – Ladji Doucouré, French sprinter and hurdler\n*1984 – Christopher Samba, Congolese footballer\n*1985 – Stefano Ferrario, Italian footballer\n*  1985   – Stanislas Wawrinka, Swiss tennis player\n*1986 – Lady Gaga, American singer-songwriter, dancer, producer, and actress\n*  1986   – J-Kwon, American rapper\n*  1986   – Bowe Bergdahl, American sergeant\n*  1986   – Barbora Záhlavová-Strýcová, Czech tennis player\n*1987 – Yohan Benalouane, French-Tunisian footballer  \n*  1987   – Simeon Jackson, Canadian soccer player\n*1988 – Ryan Kalish, American baseball player\n*1989 – David Goodwillie, Scottish footballer\n*  1989   – Lukas Jutkiewicz, English footballer\n*  1989   – Marek Suchý, Czech footballer\n*1990 – Joe Bennett, English footballer\n*  1990   – Zac Clarke, Australian footballer\n*  1990   – Zoella (Zoe Sugg), English Youtuber\n*1991 – Lisa-Maria Moser, Austrian tennis player\n*  1991   – Marie-Philip Poulin, Canadian ice hockey player\n*1992 – Sergi Gómez, Spanish footballer\n*1994 – Jackson Wang, member of South Korean boy band GOT7\n\nDeaths\n\n* 193 – Pertinax, Roman emperor (b. 126)\n* 741 – Hatsusebe, Japanese princess\n* 965 – Arnulf I, count of Flanders \n* 966 – Flodoard, Frankish canon and chronicler\n*1072 – Ordulf, Duke of Saxony (b. 1022)\n*1134 – Saint Stephen Harding, founder of the Cistercian order\n*1239 – Emperor Go-Toba of Japan (b. 1180)\n*1241 – Valdemar II of Denmark (b. 1170)\n*1254 – William de Ferrers, 5th Earl of Derby (b. 1193)\n*1285 – Pope Martin IV (b. 1220)\n*1346 – Venturino of Bergamo, Dominican preacher (b. 1304)\n*1461 – John Clifford, 9th Baron de Clifford (b. 1435)\n*1563 – Heinrich Glarean, Swiss poet and theorist (b. 1488)\n*1566 – Sigismund von Herberstein, Austrian historian and diplomat (b. 1486)\n*1583 – Magnus, Duke of Holstein (b. 1540)\n*1584 – Ivan the Terrible, Russian king (b. 1530)\n*1687 – Constantijn Huygens, Dutch poet and composer (b. 1596)\n*1794 – Marquis de Condorcet, French mathematician and philosopher (b. 1743)\n*1818 – Antonio Capuzzi, Italian violinist and composer (b. 1755)\n*1865 – Petrus Hofman Peerlkamp, Dutch scholar and critic (b. 1786)\n*1866 – Solomon Foot, American lawyer and politician (b. 1802)\n*1868 – James Brudenell, 7th Earl of Cardigan, English lieutenant and politician (b. 1797)\n*1870 – George Henry Thomas, American general (b. 1816)\n*1874 – Peter Andreas Hansen, Danish-German astronomer and mathematician (b. 1795)\n*1881 – Modest Mussorgsky, Russian pianist and composer (b. 1839)\n*1893 – Edmund Kirby Smith, American general (b. 1824)\n*1910 – Édouard Colonne, French violinist and conductor (b. 1838)\n*1917 – Albert Pinkham Ryder, American painter (b. 1847)\n*1923 – Charles Hubbard, American archer (b. 1849)\n*1927 – Joseph-Médard Émard, Canadian archbishop (b. 1853)\n*1929 – Katharine Lee Bates, American poet and songwriter (b. 1859)\n*  1929   – Lomer Gouin, Canadian lawyer and politician, 13th Premier of Quebec (b. 1861)\n*1934 – Mahmoud Mokhtar, Egyptian sculptor and educator (b. 1891)\n*1941 – Marcus Hurley, American basketball player and cyclist (b. 1883)\n*  1941   – Kavasji Jamshedji Petigara, Indian police officer (b. 1877)\n*  1941   – Virginia Woolf, English novelist, essayist, short story writer, and critic (b. 1882)\n*1942 – Miguel Hernández, Spanish poet and playwright (b. 1910)\n*1943 – Sergei Rachmaninoff, Russian pianist, composer, and conductor (b. 1873)\n*1944 – Stephen Leacock, English-Canadian political scientist and author (b. 1869)\n*1947 – Karol Świerczewski, Polish general (b. 1897)\n*1949 – Grigoraș Dinicu, Romanian violinist and composer (b. 1889)\n*1953 – Jim Thorpe, American football player and coach (b. 1887)\n*1958 – W. C. Handy, American trumpet player and composer (b. 1873)\n*1962 – Hugo Wast, Argentinian author and screenwriter (b. 1883)\n*1963 – Antonius Bouwens, Dutch target shooter (b. 1876)\n*1965 – Clemence Dane, English author and playwright (b. 1888)\n*  1965   – Jack Hoxie, American actor (b. 1885)\n*1969 – Dwight D. Eisenhower, American general and politician, 34th President of the United States (b. 1890)\n*1971 – Robert Hunter, American golfer (b. 1886)\n*1972 – Donie Bush, American baseball player, manager, and team owner (b. 1887)\n*1974 – Arthur Crudup, American singer-songwriter and guitarist (b. 1905)\n*  1974   – Dorothy Fields, American songwriter (b. 1905)\n*  1974   – Françoise Rosay, French actress (b. 1891)\n*1976 – Richard Arlen, American actor (b. 1898)\n*1977 – Eric Shipton, Sri Lankan-English mountaineer and explorer (b. 1907)\n*1980 – Dick Haymes, Argentinian-American actor and singer (b. 1918)\n*1982 – William Giauque, Canadian chemist and academic, Nobel Prize laureate (b. 1895)\n*1984 – Carmen Dragon, American conductor and composer (b. 1914)\n*1985 – Marc Chagall, Russian-French painter and poet (b. 1887)\n*1986 – Virginia Gilmore. American actress (b. 1919)\n*1987 – Maria von Trapp, Austrian-American singer (b. 1905)\n*1992 – Nikolaos Platon, Greek archaeologist and academic (b. 1909)\n*1993 – Scott Cunningham, American author (b. 1956)\n*1994 – Eugène Ionesco, Romanian-French playwright and critic (b. 1909)\n*1996 – Shin Kanemaru, Japanese politician, Deputy Prime Minister of Japan (b. 1914) \n*1999 – Franco Gasparri, Italian actor (b. 1948)\n*2000 – Anthony Powell, English soldier and author (b. 1905)\n*2001 – Moe Koffman, Canadian flute player, saxophonist, and composer (b. 1928)\n*2004 – Peter Ustinov, English-Swiss actor, director, producer, and screenwriter (b. 1921)\n*2005 – Moura Lympany, English-Monacan pianist (b. 1916)\n*  2005   – Robin Spry, Canadian director, producer, and screenwriter (b. 1939)\n*2006 – Pro Hart, Australian painter (b. 1928)\n*  2006   – Vethathiri Maharishi, Indian philosopher and author (b. 1911)\n*  2006   – Charles Schepens, Belgian-American ophthalmologist and author (b. 1912)\n*  2006   – Caspar Weinberger, American captain, lawyer, and politician, 15th United States Secretary of Defense (b. 1917)\n*2009 – Maurice Jarre, French-American composer and conductor (b. 1924)\n*2010 – June Havoc, American actress, dancer, and director (b. 1912)\n*2011 – Wenche Foss, Norwegian actress (b. 1917)\n*2012 – John Arden, English author and playwright (b. 1930)\n*  2012   – Alexander Arutiunian, Armenian pianist and composer (b. 1920)\n*  2012   – Harry Crews, American novelist, playwright, short story writer, and essayist (b. 1935)\n*2013 – George E. P. Box, English-American statistician and educator (b. 1919)\n*  2013   – Manuel García Ferré, Spanish-Argentinian director, producer, and screenwriter (b. 1929)\n*  2013   – Richard Griffiths, English actor (b. 1947)\n*  2013   – Art Malone, American race car driver (b. 1936)\n*  2013   – Hugh McCracken, American guitarist, harmonica player, and producer (b. 1942)\n*  2013   – Heinz Patzig, German footballer and manager (b. 1929)\n*  2013   – Bob Teague, American college football star and television news-reporter (b. 1929)\n*  2013   – Gus Triandos, American baseball player and scout (b. 1930)\n*  2013   – Robert Zildjian, American businessman, founded Sabian (b. 1923)\n*2014 – Jeremiah Denton, American admiral and politician (b. 1924)\n*  2014   – Lorenzo Semple, Jr., American screenwriter and producer (b. 1923)\n*  2014   – Avraham Yaski, Israeli architect and academic (b. 1927)\n*2015 – Chuck Brayton, American baseball player and coach (b. 1925)\n*  2015   – Joseph Cassidy, Canadian-English priest and academic (b. 1954)\n*  2015   – Miroslav Ondříček, Czech cinematographer (b. 1934)\n*  2015   – Gene Saks, American actor and director (b. 1921)\n*  2015   – Walter Schuck, German lieutenant and pilot (b. 1920)\n*2016 – James Noble, American actor (b. 1922)\n\nHolidays and observances\n\n*Christian feast day:\n**Stephen Harding\n**Guntram\n**Priscus\n**Pope Sixtus III\n**March 28 (Eastern Orthodox liturgics)\n*Commemoration of Sen no Rikyū (Schools of Japanese tea ceremony)\n*Serfs Emancipation Day (Tibet)\n*Teachers' Day (Czech Republic and Slovakia). March 28. http://en.wikipedia.org/?curid=19347."
  }
}
