{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3374",
  "eid" : "c5ad2d30-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778411395,
  "textBody" : "Blood on the Tracks is the 15th studio album by American singer-songwriter Bob Dylan, released on January 20, 1975 by Columbia Records. The album marked Dylan's return to Columbia Records after a two-album stint with Asylum Records. Dylan commenced recording the album in New York City in September 1974. In December, shortly before Columbia was due to release the record, Dylan abruptly re-recorded much of the material in a studio in Minneapolis. The final album contains five tracks from New York and five from Minneapolis.\n\nBlood on the Tracks was initially received with mixed reviews, but has subsequently been acclaimed as one of Dylan's greatest albums by critics and fans. The songs have been linked to tensions in Dylan's personal life, including estrangement from his then-wife Sara. One of their children, Jakob Dylan, has described the songs as \"my parents talking\". The album has been viewed as an outstanding example of the confessional singer-songwriter's craft, and it has been called \"the truest, most honest account of a love affair from tip to stern ever put down on magnetic tape\".  In interviews, Dylan has denied that the songs on the album are autobiographical. In 2003, the album was ranked number 16 on Rolling Stone's list of the 500 greatest albums of all time, and in 2004, it was placed at number 5 on Pitchfork's list of the top 100 albums of the 1970s.\n\nThe album reached #1 on the Billboard 200 charts and #4 on the UK Albums Chart. The single \"Tangled Up in Blue\" peaked at #31 on the Billboard Hot 100 singles chart. The album remains one of Dylan's best-selling studio releases, with a double-platinum US certification by the Recording Industry Association of America (RIAA).\n\n In 2015, it was inducted into the Grammy Hall of Fame.\n\nRecording\n\nPre-production\n\nAt the conclusion of his 1974 tour with the Band, Dylan began a relationship with a Columbia Records employee, Ellen Bernstein, which Dylan biographer Clinton Heylin has described as the beginning of the end of Dylan's marriage to his wife Sara. In spring 1974, Dylan was in New York for several weeks while he attended art classes with the painter Norman Raeben. Dylan subsequently gave Raeben credit in interviews for transforming his understanding of time, and during the summer of 1974 Dylan began to write a series of songs in a red notebook which utilised his new knowledge: \n\nDylan subsequently spent time with Bernstein on his farm in Minnesota and there he completed the 17 songs from which Blood on the Tracks was formed—songs which Heylin has described as \"perhaps the finest collection of love songs of the twentieth century, songs filled with the full spectrum of emotions a marriage on the rocks can engender\".\n\nPrior to recording, Dylan previewed the songs that would constitute Blood on the Tracks for a number of friends in the music world, including David Crosby, Graham Nash, Stephen Stills, Tim Drummond, and Peter Rowan. Nash recalled that Stills disliked Dylan's private performance of his new songs; immediately after Dylan left the room, Stills remarked to Nash, \"He's a good songwriter ... but he's no musician.\"\n\nInitially, Dylan considered recording Blood on the Tracks with an electric backing group, and contacted Mike Bloomfield who had played lead guitar on Dylan's Highway 61 Revisited album. When the two met, Dylan ran through the songs he was planning to record, but he played them too quickly for Bloomfield to learn. Bloomfield later recalled the experience: \"They all began to sound the same to me; they were all in the same key; they were all long. It was one of the strangest experiences of my life. He was sort of pissed off that I didn't pick it up.\" In the end, Dylan rejected the idea of recording the album with a band, and instead substituted stripped-down acoustic arrangements for all of his songs. On August 2, 1974, Dylan signed a contract with Columbia Records. After releasing his two previous albums, Planet Waves and Before the Flood, on Asylum Records, Dylan decided his new album would benefit from the commercial muscle of the record label that had made him famous, and his new contract gave him increased control over his own masters.\n\nRecording sessions\n\nDylan commenced recording at A & R Recording Studios in New York City on September 16, 1974. Bernstein has stated \"the theme of returning ran through the sessions\", so \"it made a lot of sense to do it at A&R\". A & R Studios was the former Columbia Records \"Studio A\", where Dylan had recorded six albums in the 1960s. The musicians quickly realized that Dylan was taking a \"spontaneous\" approach to recording. The session engineer, Phil Ramone, later said that Dylan transitioned from one song to another as if they were part of a medley. Ramone noted:\n\nEric Weissberg and his band, Deliverance, originally recruited as session men, were rejected after two days of recording because they could not keep up with Dylan's pace. Dylan retained bassist Tony Brown from the band, and soon added organist Paul Griffin (who had also worked on Highway 61 Revisited) and steel guitarist Buddy Cage. After ten days and four sessionsBjorner, [http://bjorner.com/74%201-6.htm#_Toc522515522 1974 On the Road Again: Calendar] Bjorner's As the Years Passed the Door. Retrieved September 3, 2010 with the current lineup, Dylan had finished recording and mixing, and, by November, had cut a test pressing on the album. Columbia began to prepare to release the album before Christmas.\n\nDylan played the test pressing for his brother, David Zimmerman, who persuaded Dylan the album would not sell because the overall sound was too stark. Robert Christgau also heard the early version of the album and called it \"a sellout to the memory of Dylan's pre-electric period\". At his brother's urging, Dylan agreed to re-record five of the album's songs in Sound 80 in Minneapolis, with backing musicians recruited by David. The new takes were accomplished in two days at the end of December 1974. Blood on the Tracks was released into stores on January 20, 1975.\n\nAutobiographical interpretation\n\nThe songs that constitute Blood on the Tracks have been described by many Dylan critics as stemming from his personal turmoil at the time, particularly his estrangement from his then-wife Sara Dylan. One of Bob and Sara Dylan's children, Jakob Dylan, has said, \"When I'm listening to Blood On The Tracks, that's about my parents.\"\n\nDylan has denied this autobiographical interpretation, stating in a 1985 interview with Bill Flanagan, \"A lot of people thought that album pertained to me. It didn't pertain to me ... I'm not going to make an album and lean on a marriage relationship.\" Informed of the album's popularity, Dylan told Mary Travers in a radio interview in April 1975: \"A lot of people tell me they enjoy that album. It's hard for me to relate to that. I mean ... people enjoying that type of pain, you know?\" Addressing whether the album described his own personal pain, Dylan replied that he didn't write \"confessional songs\".\n\nAccording to Rolling Stone Magazine, in Dylan's lyric notebook, the working title of Simple Twist of Fate was  4th Street Affair; Dylan and Suze Rotolo lived at 161 W. 4th St. The narrator of the song memorializes an affair of ten years ago instead of singing about Dylan's marriage.[https://www.rollingstone.com /music/lists/100-greatest-bob-dylan-songs-20160524 '100 Greatest Bob Dylan Songs.'] Rolling Stone, 24 mei 2016. Simple Twist of Fate is ranked 15.\n\nIn his 2004 memoir, Chronicles, Vol. 1, Dylan stated that the songs have nothing to do with his own personal life, and that they were inspired by the short stories of Anton Chekhov.\n\nCritical reception\n\nReleased in early 1975, Blood on the Tracks initially received mixed reviews from critics. Rolling Stone published two assessments. The first, by Jonathan Cott, called it \"Dylan's magnificent new album\". The second reviewer, Jon Landau, wrote that \"the record has been made with typical shoddiness.\" In the NME, Nick Kent described \"the accompaniments [as] often so trashy they sound like mere practice takes\", while Crawdaddy magazine's Jim Cusimano found the instrumentation incompetent.\n\nAn influential review of the album was written by Dylan critic Michael Gray for the magazine Let It Rock. Gray argued that it transformed the cultural perception of Dylan, and that he was no longer defined as \"the major artist of the sixties. Instead, Dylan has legitimized his claim to a creative prowess as vital now as then—a power not bounded by the one decade he so affected.\" This view was amplified by Clinton Heylin, who wrote: \"Ten years after he turned the rock & roll brand of pop into rock ... [Dylan] renewed its legitimacy as a form capable of containing the work of a mature artist.\" In The Village Voice, Robert Christgau wrote that although the lyrics occasionally evoke romantic naiveté and bitterness, Blood on the Tracks is altogether Dylan's \"most mature and assured record\".\n\nSince its initial reception, Blood on the Tracks has been viewed by critics as one of Dylan's best albums. In Salon.com, Wyman wrote: \"Blood on the Tracks is his only flawless album and his best produced; the songs, each of them, are constructed in disciplined fashion. It is his kindest album and most dismayed, and seems in hindsight to have achieved a sublime balance between the logorrhea-plagued excesses of his mid-1960s output and the self-consciously simple compositions of his post-accident years.\" Bell, in his critical biography of Dylan, wrote that Blood on the Tracks was proof that \"Dylan had won the argument over his refusal to argue about politics. In this, he began to seem prescient.\" Bell concluded the album \"might well count as one of the best things Dylan ever did\". Novelist Rick Moody called it \"the truest, most honest account of a love affair from tip to stern ever put down on magnetic tape\".\n\nA result of the acclaim surrounding Blood on the Tracks has been that when critics have praised one of Dylan's subsequent albums they have often described it as \"his best since Blood on the Tracks\". According to music journalist Rob Sheffield, Blood on the Tracks became a benchmark album for Dylan in the years that followed because it was \"such a stunning comeback\".\n\nThe album was also included in the book 1001 Albums You Must Hear Before You Die.\n\nTrack listing\n\nOuttakes\n\nOnly one of the five New York acetate recordings that were subsequently replaced on the official album has been officially released: \"You're a Big Girl Now\", released on 1985's Biograph. Although alternate takes of \"Tangled Up in Blue\", \"Idiot Wind\", and \"If You See Her, Say Hello\" from those same sessions were released on The Bootleg Series, Vol. 1–3, these were not the same takes that were initially slotted for inclusion on the official album. That collection also includes \"Call Letter Blues\", an outtake/early version of \"Meet Me in the Morning\" with alternate lyrics. \"Up to Me\", another outtake from these sessions, was also released on 1985's Biograph. An alternate take of the song \"Shelter From the Storm\" is featured in the original soundtrack album for Jerry Maguire (1996). An alternate take of \"Meet Me in the Morning\" was released on the b-side of the Record Store Day 2012 release of \"Duquesne Whistle.\" \"Lily, Rosemary and the Jack of Hearts\" is the only song from the New York sessions which has not been officially released in any form.\n\nPersonnel\n\n(For personnel details, see Heylin, 1996 and Björner, 2014)\n\nMusicians\n\n* Bob Dylan – vocals, guitar , harmonica , organ , mandolin , production\n* Kevin Odegard – guitar \n* Chris Weber – guitar , 12-string guitar \n* Gregg Inhofer – keyboards , piano , organ \n* Billy Peterson – bass guitar \n* Bill Berg – drums \n* Tony Brown – bass guitar \n* Eric Weissberg – guitar \n* Charles Brown III – guitar \n* Buddy Cage – pedal steel guitar \n* Thomas McFaul – keyboards \n* Richard Crooks – drums \n* Peter Ostroushko – mandolin \n\nTechnical\n\n* Ron Coro – art direction\n* Pete Hamill – liner notes\n* David Oppenheim – illustrations\n* Phil Ramone – engineering\n* Paul Markinson – engineering\n* Glenn Berger – tape operator, assistant engineer\n* Paul Till – photography\n\nCharts\n\nWeekly charts\n\nSingles\n\nCertifications",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Blood on the Tracks" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3374" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Blood on the Tracks is the 15th studio album by American singer-songwriter Bob Dylan, released on January 20, 1975 by Columbia Records. The album marked Dylan's return to Columbia Records after a two-album stint with Asylum Records. Dylan commenced recording the album in New York City in September 1974. In December, shortly before Columbia was due to release the record, Dylan abruptly re-recorded much of the material in a studio in Minneapolis. The final album contains five tracks from New York and five from Minneapolis.\n\nBlood on the Tracks was initially received with mixed reviews, but has subsequently been acclaimed as one of Dylan's greatest albums by critics and fans. The songs have been linked to tensions in Dylan's personal life, including estrangement from his then-wife Sara. One of their children, Jakob Dylan, has described the songs as \"my parents talking\". The album has been viewed as an outstanding example of the confessional singer-songwriter's craft, and it has been called \"the truest, most honest account of a love affair from tip to stern ever put down on magnetic tape\".  In interviews, Dylan has denied that the songs on the album are autobiographical. In 2003, the album was ranked number 16 on Rolling Stone's list of the 500 greatest albums of all time, and in 2004, it was placed at number 5 on Pitchfork's list of the top 100 albums of the 1970s.\n\nThe album reached #1 on the Billboard 200 charts and #4 on the UK Albums Chart. The single \"Tangled Up in Blue\" peaked at #31 on the Billboard Hot 100 singles chart. The album remains one of Dylan's best-selling studio releases, with a double-platinum US certification by the Recording Industry Association of America (RIAA).\n\n In 2015, it was inducted into the Grammy Hall of Fame.\n\nRecording\n\nPre-production\n\nAt the conclusion of his 1974 tour with the Band, Dylan began a relationship with a Columbia Records employee, Ellen Bernstein, which Dylan biographer Clinton Heylin has described as the beginning of the end of Dylan's marriage to his wife Sara. In spring 1974, Dylan was in New York for several weeks while he attended art classes with the painter Norman Raeben. Dylan subsequently gave Raeben credit in interviews for transforming his understanding of time, and during the summer of 1974 Dylan began to write a series of songs in a red notebook which utilised his new knowledge: \n\nDylan subsequently spent time with Bernstein on his farm in Minnesota and there he completed the 17 songs from which Blood on the Tracks was formed—songs which Heylin has described as \"perhaps the finest collection of love songs of the twentieth century, songs filled with the full spectrum of emotions a marriage on the rocks can engender\".\n\nPrior to recording, Dylan previewed the songs that would constitute Blood on the Tracks for a number of friends in the music world, including David Crosby, Graham Nash, Stephen Stills, Tim Drummond, and Peter Rowan. Nash recalled that Stills disliked Dylan's private performance of his new songs; immediately after Dylan left the room, Stills remarked to Nash, \"He's a good songwriter ... but he's no musician.\"\n\nInitially, Dylan considered recording Blood on the Tracks with an electric backing group, and contacted Mike Bloomfield who had played lead guitar on Dylan's Highway 61 Revisited album. When the two met, Dylan ran through the songs he was planning to record, but he played them too quickly for Bloomfield to learn. Bloomfield later recalled the experience: \"They all began to sound the same to me; they were all in the same key; they were all long. It was one of the strangest experiences of my life. He was sort of pissed off that I didn't pick it up.\" In the end, Dylan rejected the idea of recording the album with a band, and instead substituted stripped-down acoustic arrangements for all of his songs. On August 2, 1974, Dylan signed a contract with Columbia Records. After releasing his two previous albums, Planet Waves and Before the Flood, on Asylum Records, Dylan decided his new album would benefit from the commercial muscle of the record label that had made him famous, and his new contract gave him increased control over his own masters.\n\nRecording sessions\n\nDylan commenced recording at A & R Recording Studios in New York City on September 16, 1974. Bernstein has stated \"the theme of returning ran through the sessions\", so \"it made a lot of sense to do it at A&R\". A & R Studios was the former Columbia Records \"Studio A\", where Dylan had recorded six albums in the 1960s. The musicians quickly realized that Dylan was taking a \"spontaneous\" approach to recording. The session engineer, Phil Ramone, later said that Dylan transitioned from one song to another as if they were part of a medley. Ramone noted:\n\nEric Weissberg and his band, Deliverance, originally recruited as session men, were rejected after two days of recording because they could not keep up with Dylan's pace. Dylan retained bassist Tony Brown from the band, and soon added organist Paul Griffin (who had also worked on Highway 61 Revisited) and steel guitarist Buddy Cage. After ten days and four sessionsBjorner, [http://bjorner.com/74%201-6.htm#_Toc522515522 1974 On the Road Again: Calendar] Bjorner's As the Years Passed the Door. Retrieved September 3, 2010 with the current lineup, Dylan had finished recording and mixing, and, by November, had cut a test pressing on the album. Columbia began to prepare to release the album before Christmas.\n\nDylan played the test pressing for his brother, David Zimmerman, who persuaded Dylan the album would not sell because the overall sound was too stark. Robert Christgau also heard the early version of the album and called it \"a sellout to the memory of Dylan's pre-electric period\". At his brother's urging, Dylan agreed to re-record five of the album's songs in Sound 80 in Minneapolis, with backing musicians recruited by David. The new takes were accomplished in two days at the end of December 1974. Blood on the Tracks was released into stores on January 20, 1975.\n\nAutobiographical interpretation\n\nThe songs that constitute Blood on the Tracks have been described by many Dylan critics as stemming from his personal turmoil at the time, particularly his estrangement from his then-wife Sara Dylan. One of Bob and Sara Dylan's children, Jakob Dylan, has said, \"When I'm listening to Blood On The Tracks, that's about my parents.\"\n\nDylan has denied this autobiographical interpretation, stating in a 1985 interview with Bill Flanagan, \"A lot of people thought that album pertained to me. It didn't pertain to me ... I'm not going to make an album and lean on a marriage relationship.\" Informed of the album's popularity, Dylan told Mary Travers in a radio interview in April 1975: \"A lot of people tell me they enjoy that album. It's hard for me to relate to that. I mean ... people enjoying that type of pain, you know?\" Addressing whether the album described his own personal pain, Dylan replied that he didn't write \"confessional songs\".\n\nAccording to Rolling Stone Magazine, in Dylan's lyric notebook, the working title of Simple Twist of Fate was  4th Street Affair; Dylan and Suze Rotolo lived at 161 W. 4th St. The narrator of the song memorializes an affair of ten years ago instead of singing about Dylan's marriage.[https://www.rollingstone.com /music/lists/100-greatest-bob-dylan-songs-20160524 '100 Greatest Bob Dylan Songs.'] Rolling Stone, 24 mei 2016. Simple Twist of Fate is ranked 15.\n\nIn his 2004 memoir, Chronicles, Vol. 1, Dylan stated that the songs have nothing to do with his own personal life, and that they were inspired by the short stories of Anton Chekhov.\n\nCritical reception\n\nReleased in early 1975, Blood on the Tracks initially received mixed reviews from critics. Rolling Stone published two assessments. The first, by Jonathan Cott, called it \"Dylan's magnificent new album\". The second reviewer, Jon Landau, wrote that \"the record has been made with typical shoddiness.\" In the NME, Nick Kent described \"the accompaniments [as] often so trashy they sound like mere practice takes\", while Crawdaddy magazine's Jim Cusimano found the instrumentation incompetent.\n\nAn influential review of the album was written by Dylan critic Michael Gray for the magazine Let It Rock. Gray argued that it transformed the cultural perception of Dylan, and that he was no longer defined as \"the major artist of the sixties. Instead, Dylan has legitimized his claim to a creative prowess as vital now as then—a power not bounded by the one decade he so affected.\" This view was amplified by Clinton Heylin, who wrote: \"Ten years after he turned the rock & roll brand of pop into rock ... [Dylan] renewed its legitimacy as a form capable of containing the work of a mature artist.\" In The Village Voice, Robert Christgau wrote that although the lyrics occasionally evoke romantic naiveté and bitterness, Blood on the Tracks is altogether Dylan's \"most mature and assured record\".\n\nSince its initial reception, Blood on the Tracks has been viewed by critics as one of Dylan's best albums. In Salon.com, Wyman wrote: \"Blood on the Tracks is his only flawless album and his best produced; the songs, each of them, are constructed in disciplined fashion. It is his kindest album and most dismayed, and seems in hindsight to have achieved a sublime balance between the logorrhea-plagued excesses of his mid-1960s output and the self-consciously simple compositions of his post-accident years.\" Bell, in his critical biography of Dylan, wrote that Blood on the Tracks was proof that \"Dylan had won the argument over his refusal to argue about politics. In this, he began to seem prescient.\" Bell concluded the album \"might well count as one of the best things Dylan ever did\". Novelist Rick Moody called it \"the truest, most honest account of a love affair from tip to stern ever put down on magnetic tape\".\n\nA result of the acclaim surrounding Blood on the Tracks has been that when critics have praised one of Dylan's subsequent albums they have often described it as \"his best since Blood on the Tracks\". According to music journalist Rob Sheffield, Blood on the Tracks became a benchmark album for Dylan in the years that followed because it was \"such a stunning comeback\".\n\nThe album was also included in the book 1001 Albums You Must Hear Before You Die.\n\nTrack listing\n\nOuttakes\n\nOnly one of the five New York acetate recordings that were subsequently replaced on the official album has been officially released: \"You're a Big Girl Now\", released on 1985's Biograph. Although alternate takes of \"Tangled Up in Blue\", \"Idiot Wind\", and \"If You See Her, Say Hello\" from those same sessions were released on The Bootleg Series, Vol. 1–3, these were not the same takes that were initially slotted for inclusion on the official album. That collection also includes \"Call Letter Blues\", an outtake/early version of \"Meet Me in the Morning\" with alternate lyrics. \"Up to Me\", another outtake from these sessions, was also released on 1985's Biograph. An alternate take of the song \"Shelter From the Storm\" is featured in the original soundtrack album for Jerry Maguire (1996). An alternate take of \"Meet Me in the Morning\" was released on the b-side of the Record Store Day 2012 release of \"Duquesne Whistle.\" \"Lily, Rosemary and the Jack of Hearts\" is the only song from the New York sessions which has not been officially released in any form.\n\nPersonnel\n\n(For personnel details, see Heylin, 1996 and Björner, 2014)\n\nMusicians\n\n* Bob Dylan – vocals, guitar , harmonica , organ , mandolin , production\n* Kevin Odegard – guitar \n* Chris Weber – guitar , 12-string guitar \n* Gregg Inhofer – keyboards , piano , organ \n* Billy Peterson – bass guitar \n* Bill Berg – drums \n* Tony Brown – bass guitar \n* Eric Weissberg – guitar \n* Charles Brown III – guitar \n* Buddy Cage – pedal steel guitar \n* Thomas McFaul – keyboards \n* Richard Crooks – drums \n* Peter Ostroushko – mandolin \n\nTechnical\n\n* Ron Coro – art direction\n* Pete Hamill – liner notes\n* David Oppenheim – illustrations\n* Phil Ramone – engineering\n* Paul Markinson – engineering\n* Glenn Berger – tape operator, assistant engineer\n* Paul Till – photography\n\nCharts\n\nWeekly charts\n\nSingles\n\nCertifications. Blood on the Tracks. http://en.wikipedia.org/?curid=3374."
  }
}
