{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13217",
  "eid" : "0728f0a0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778521258,
  "textBody" : "(plural haiku) is a very short form of Japanese poetry.  It is typically characterized by three qualities:\n\n# The essence of haiku is \"cutting\" (kiru).  This is often  represented by the juxtaposition of two images or ideas and a kireji (\"cutting word\") between them,  a kind of verbal punctuation mark which signals the moment of separation and colours the manner in which the juxtaposed elements are related.\n# Traditional haiku consist of 17 on (also known as morae though often loosely translated as \"syllables\"), in three phrases of 5, 7, and 5 on, respectively.Lanoue, David G. Issa, Cup-of-tea Poems: Selected Haiku of Kobayashi Issa, Asian Humanities (An alternative form of haiku consists of 11 on in three phrases of 3, 5, and 3 on, respectively.)\n# A kigo (seasonal reference), usually drawn from a saijiki, an extensive but defined list of such terms.\n\n are increasingly unlikely to follow the tradition of 17 on or to take nature as their subject, but the use of juxtaposition continues to be honored in both traditional and modern haiku.  There is a common, although relatively recent, perception that the images juxtaposed must be directly observed everyday objects or occurrences.Haruo Shirane [http://www.haikupoet.com/definitions/beyond_the_haiku_moment.html Beyond the Haiku Moment]\n\nIn Japanese, haiku are traditionally printed in a single vertical line while haiku in English often appear in three lines to parallel the three phrases of Japanese haiku. \n\nPreviously called hokku, haiku was given its current name by the Japanese writer Masaoka Shiki at the end of the 19th century.\n\nKiru and Kireji\n\nIn Japanese haiku a kireji, or cutting word, typically appears at the end of one of the verse's three phrases. A kireji fills a role somewhat analogous to a caesura in classical western poetry or to a volta in sonnets. Depending on which cutting word is chosen, and its position within the verse, it may briefly cut the stream of thought, suggesting a parallel between the preceding and following phrases, or it may provide a dignified ending, concluding the verse with a heightened sense of closure.\n\nThe fundamental aesthetic quality of both hokku and haiku is that it is internally sufficient, independent of context, and will bear consideration as a complete work. The kireji lends the verse structural support,[http://www.haiku.jp/haiku/nyumon_English_03.htm Brief Notes on \"Kire-ji\"], Association of Japanese Classical Haiku. Retrieved 2008-10-16. allowing it to stand as an independent poem.Steven D. Carter. Three Poets at Yuyama. Sogi and Yuyama Sangin Hyakuin, 1491, in Monumenta Nipponica, Vol. 33, No. 3. (Autumn, 1978), p.249Konishi Jin'ichi; Karen Brazell; Lewis Cook, The Art of Renga, in Journal of Japanese Studies, Vol. 2, No. 1. (Autumn, 1975), p.39 The use of kireji distinguishes haiku and hokku from second and subsequent verses of renku; which may employ semantic and syntactic disjuncture, even to the point of occasionally end-stopping a phrase with a .  However, renku typically employ kireji.Sato, Hiroaki. One Hundred Frogs: from renga to haiku to English, Weatherhill 1983, \n\nIn English, since kireji have no direct equivalent, poets sometimes use punctuation such as a dash or ellipsis, or an implied break to create a juxtaposition intended to prompt the reader to reflect on the relationship between the two parts.\n\nThe kireji in the Bashō examples \"old pond\" and \"the wind of Mt Fuji\" are both \"ya\" (). Neither the remaining Bashō example nor the Issa example contain a kireji although they do both balance a fragment in the first five on against a phrase in the remaining 12 on (it may not be apparent from the English translation of the Issa that the first five on mean \"Edo's rain\").\n\nSyllables or on in haiku\n\nIn comparison with English verse typically characterized by syllabic meter, Japanese verse counts sound units known as \"on\" or morae. Traditional haiku consist of 17 on, in three phrases of five, seven and five on respectively. Among contemporary poems teikei ( fixed form) haiku continue to use the 5-7-5 pattern while jiyuritsu ( free form) haiku do not. One of the examples below illustrates that traditional haiku masters were not always constrained by the 5-7-5 pattern.\n\nAlthough the word \"on\" is sometimes translated as \"syllable\", one on is counted for a short syllable, two for an elongated vowel or doubled consonant, and one for an \"n\" at the end of a syllable. Thus, the word \"haibun\", though counted as two syllables in English, is counted as four on in Japanese (ha-i-bu-n); and the word \"on\" itself, which English-speakers would view as a single syllable, comprises two on: the short vowel o and the moraic nasal Japanese phonology#Moraic nasal|. This is illustrated by the Issa haiku below, which contains 17 on but only 15 syllables. Conversely, some sounds, such as \"kyo\" () may look like two syllables to English speakers but are in fact a single on (as well as a single syllable) in Japanese.\n\nThe word onji (; \"sound character\") is sometimes used in referring to Japanese sound units in English although this word is no longer current in Japanese. In Japanese, each on corresponds to a kana character (or sometimes digraph) and hence ji (or \"character\") is also sometimes used as the count unit.\n\nIn 1973, the Haiku Society of America noted that the norm for writers of haiku in English was to use 17 syllables, but they also noted a trend toward shorter haiku.[http://www.hsa-haiku.org/archives/HSA_Definitions_2004.html#Old_Haiku 1973 definition of haiku] on the website of the Haiku Society of America\n\nSome translators of Japanese poetry have noted that about 12 syllables in English approximate the duration of 17 Japanese on.[http://www.hsa-haiku.org/archives/HSA_Definitions_2004.html#Haiku definition of haiku] on the website of the Haiku Society of America Also in translations four lines is more appropriate for the colloquialism of the language and is closest to natural conversational rhythm, necessary to carry the weight of the hokkuYuasa, Nobuyuki, Introduction 'The Narrow Road and Other travel sketches' by Matsuo Basho, Penguin Classics, London 1966 \n\nKigo\n\nA haiku traditionally contains a kigo, a word or phrase that symbolizes or implies the season of the poem and which is drawn from a saijiki, an extensive but prescriptive list of such words.\n\nKigo are often in the form of metonyms and can be difficult for those who lack Japanese cultural references to spot. The Bashō examples below include \"kawazu\", \"frog\" implying spring, and \"shigure\", a rain shower in late autumn or early winter. Kigo are not always included in non-Japanese haiku or by modern writers of Japanese \"free-form\" haiku.\n\nExamples\n\nThe best-known Japanese haikuHigginson, William J. The Haiku Handbook, Kodansha International, 1985, , p.9 is Bashō's \"old pond\":\n:: (transliterated into 17 hiragana)\n::furu ike ya kawazu tobikomu mizu no oto (transliterated into rōmaji)\n\nThis separates into on as:\n\nfu-ru-i-ke ya (5)\nka-wa-zu to-bi-ko-mu (7)\nmi-zu-no-o-to (5)\n\nTranslated:[http://www.bopsecrets.org/gateway/passages/basho-frog.htm Translated by William J. Higginson in Matsuo Bashō: Frog Haiku (Thirty Translations and One Commentary)], including commentary from Robert Aitken's A Zen Wave: Bashô's Haiku and Zen (revised ed., Shoemaker & Hoard, 2003)\nold pond\nfrog leaps in\nwater's sound\n\nAnother haiku by Bashō:\n::\n::hatsu shigure saru mo komino o hoshige nari[http://www.ict.ne.jp/~basho/works/winter/04.html Works of Basho, Winter] on Iga and Basho ict.ne.jp website.\n\nThis separates into on as:\n\nha-tsu shi-gu-re (5)\nsa-ru mo ko-mi-no o (7)\nho-shi-ge na-ri (5)\n\nTranslated:\n\nthe first cold shower\neven the monkey seems to want\na little coat of straw\n\nThis haiku by Bashō illustrates that he was not always constrained to a 5-7-5 on pattern. It contains 18 on in the pattern 6-7-5 (\"ō\" or  is treated as two on.)\n::\n::Fuji no kaze ya ōgi ni nosete Edo miyage[http://www.ict.ne.jp/~basho/works/summer/03.html Works of Basho, Summer] on Iga and Basho ict.ne.jp website.\n\nThis separates into \"on\" as:\n\nfu-ji no ka-ze ya (6)\no-u-gi ni no-se-te (7)\ne-do mi-ya-ge (5)\n\nTranslated:\n\nthe wind of Fuji\nI've brought on my fan\na gift from Edo\n\nThis haiku by Issa illustrates that 17 Japanese on do not always equate to 17 English syllables (\"nan\" counts as two on and \"nonda\" as three.)\n\n::\n::Edo no ame nan goku nonda hototogisu\n\nThis separates into \"on\" as,\ne-do no a-me (5)\nna-n go-ku no-n-da (7)\nho-to-to-gi-su (5)\n\nTranslated:\n\nhow many gallons\nof Edo's rain did you drink,\ncuckoo?\n\nOrigin and development\n\nFrom renga to renku to haiku\n\nHokku is the opening stanza of an orthodox collaborative linked poem, or renga, and of its later derivative, renku (or haikai no renga). By the time of Matsuo Bashō (1644–1694), the hokku had begun to appear as an independent poem, and was also incorporated in haibun (a combination of prose and hokku), and haiga (a combination of painting with hokku). In the late 19th century, Masaoka Shiki (1867–1902) renamed the standalone hokku to haiku.Higginson, William J. The Haiku Handbook, Kodansha International, 1985, , p.20 The latter term is now generally applied retrospectively to all hokku appearing independently of renku or renga, irrespective of when they were written, and the use of the term hokku to describe a stand-alone poem is considered obsolete.van den Heuvel, 1986, p.357\n\nBashō\n\nIn the 17th century, two masters arose who elevated haikai and gave it a new popularity. They were Matsuo Bashō (1644–1694) and  (1661–1738). Hokku is the first verse of the collaborative haikai or renku, but its position as the opening verse made it the most important, setting the tone for the whole composition. Even though hokku had sometimes appeared individually, they were always understood in the context of renku. The Bashō school promoted standalone hokku by including many in their anthologies, thus giving birth to what is now called \"haiku\".  Bashō also used his hokku as torque points  within his short prose sketches and longer travel diaries. This subgenre of haikai is known as haibun. His best-known work, Oku no Hosomichi, or Narrow Roads to the Interior, is counted as one of the classics of Japanese literatureYuasa, Nobuyuki. The Narrow Road to the Deep North and other travel sketches, Penguin 1966,  p.39 and has been translated into English extensively.\n\nBashō was deified by both the imperial government and Shinto religious headquarters one hundred years after his death because he raised the haikai genre from a playful game of wit to sublime poetry. He continues to be revered as a saint of poetry in Japan, and is the one name from classical Japanese literature that is familiar throughout the world.Rimer, J. Thomas. A Reader's Guide to Japanese Literature, Kodansha International 1988,  pp.69-70\n\nBuson\n\nThe next famous style of haikai to arise was that of Yosa Buson (1716–1783) and others such as Kitō, called the Tenmei style after the Tenmei Era (1781–1789) in which it was created.\n\nBuson is recognized as one of the greatest masters of haiga (an art form where painting is combined with haiku or haikai prose). His affection for painting can be seen in the painterly style of his haiku.Ross, Bruce. Haiku Moment: An Anthology of Contemporary North American Haiku, Tuttle Publishing, 1993,   p.xv\n\nIssa\n\nNo new popular style followed Buson. However, a very individualistic, and at the same time humanistic, approach to writing haiku was demonstrated by the poet Kobayashi Issa (1763–1827), whose miserable childhood, poverty, sad life, and devotion to the Pure Land sect of Buddhism are evident in his poetry. Issa made the genre immediately accessible to wider audiences.\n\nShiki\n\nMasaoka Shiki (1867–1902) was a reformer and modernizer. A prolific writer, even though chronically ill during a significant part of his life, Shiki disliked the 'stereotype' of haikai writers of the 19th century who were known by the deprecatory term tsukinami, meaning 'monthly', after the monthly or twice-monthly haikai gatherings of the end of the 18th century (in regard to this period of haikai, it came to mean 'trite' and 'hackneyed'). Shiki also criticized Bashō. Like the Japanese intellectual world in general at that time, Shiki was strongly influenced by Western culture. He favored the painterly style of Buson and particularly the European concept of plein-air painting, which he adapted to create a style of haiku as a kind of nature sketch in words, an approach called shasei (, \"sketching from life\"). He popularized his views by verse columns and essays in newspapers.\n\nHokku up to the time of Shiki, even when appearing independently, were written in the context of renku.Hiroaki Sato. One Hundred Frogs, Weatherhill, 1983,  p.113 Shiki formally separated his new style of verse from the context of collaborative poetry. Being agnostic,Henderson, Harold G. An Introduction to Haiku: An Anthology of Poems and Poets from Basho to Shiki, Doubleday Anchor Books, 1958, p.163 he also separated it from the influence of Buddhism. Further, he discarded the term \"hokku\" and proposed the term haiku as an abbreviation of the phrase \"haikai no ku\" meaning a verse of haikai,Earl Miner, Japanese Linked Poetry. Princeton University Press, 1980.  pbk. although the term predates Shiki by some two centuries, when it was used to mean any verse of haikai. Since then, \"haiku\" has been the term usually applied in both Japanese and English to all independent haiku, irrespective of their date of composition. Shiki's revisionism dealt a severe blow to renku and surviving haikai schools. The term \"hokku\" is now used chiefly in its original sense of the opening verse of a renku, and rarely to distinguish haiku written before Shiki's time.\n\nHaibun\n\nHaibun is a combination of prose and haiku, often autobiographical or written in the form of a travel journal.\n\nHaiga\n\nHaiga is a style of Japanese painting based on the aesthetics of haikai, and usually including a haiku. Today, haiga artists combine haiku with paintings, photographs and other art.\n\nKuhi\n\nThe carving of famous haiku on natural stone to make poem monuments known as kuhi () has been a popular practice for many centuries. The city of Matsuyama has more than two hundred kuhi.\n\nHaiku movement in the West\n\nThe earliest westerner known to have written haiku was the Dutchman Hendrik Doeff (1764–1837), who was the Dutch commissioner in the Dejima trading post in Nagasaki, during the first years of the 19th century.[http://kulturserver-nds.de/home/haiku-dhg/Netherlands.htm Haiku in the Netherlands and Flanders] by Max Verhart, in the German Haiku Society website One of his haiku:Otterspeer, W. Leiden Oriental connections, 1850-1940, Volume 5 of Studies in the history of Leiden University. Brill, 1989, . p360\n\nAlthough there were further attempts outside Japan to imitate the \"hokku\" in the early 20th century, there was little understanding of its principles. Early Western scholars such as Basil Hall Chamberlain (1850–1935) and William George Aston were mostly dismissive of hokku's poetic value. One of the first advocates of English-language hokku was the Japanese poet Yone Noguchi. In \"A Proposal to American Poets,\" published in the Reader magazine in February 1904, Noguchi gave a brief outline of the hokku and some of his own English efforts, ending with the exhortation, \"Pray, you try Japanese Hokku, my American poets!\"  At about the same time the poet Sadakichi Hartmann was publishing original English-language hokku, as well as other Japanese forms in both English and French.\n\nIn France, haiku was introduced by Paul-Louis Couchoud around 1906. Couchoud's articles were read by early Imagist theoretician F. S. Flint, who passed on Couchoud's ideas to other members of the proto-Imagist Poets' Club such as Ezra Pound. Amy Lowell made a trip to London to meet Pound and find out about haiku. She returned to the United States where she worked to interest others in this \"new\" form. Haiku subsequently had a considerable influence on Imagists in the 1910s, notably Pound's \"In a Station of the Metro\" of 1913, but, notwithstanding several efforts by Yone Noguchi to explain \"the hokku spirit\", there was as yet little understanding of the form and its history.\n\nBlyth\n\nR. H. Blyth was an Englishman who lived in Japan. He produced a series of works on Zen, haiku, senryū, and on other forms of Japanese and Asian literature. In 1949, with the publication in Japan of the first volume of Haiku, the four-volume work by Blyth, haiku were introduced to the post-war English-speaking world. This four-volume series (1949–52) described haiku from the pre-modern period up to and including Shiki. Blyth's History of Haiku (1964) in two volumes is regarded as a classical study of haiku. Today Blyth is best known as a major interpreter of haiku to English speakers. His works have stimulated the writing of haiku in English.\n\nYasuda\n\nThe Japanese-American scholar and translator Kenneth Yasuda published The Japanese Haiku: Its Essential Nature, History, and Possibilities in English, with Selected Examples in 1957. The book includes both translations from Japanese and original poems of his own in English, which had previously appeared in his book titled A Pepper-Pod: Classic Japanese Poems together with Original Haiku. In these books Yasuda presented a critical theory about haiku, to which he added comments on haiku poetry by early 20th-century poets and critics. His translations apply a 5–7–5 syllable count in English, with the first and third lines end-rhymed. Yasuda considered that haiku translated into English should utilize all of the poetic resources of the language.Yasuda, Kenneth, Introduction 'The Japanese Haiku' Charles Tuttle Co Rutland 1957  Yasuda's theory also includes the concept of a \"haiku moment\"  based in personal experience, and provides the motive for writing a haiku (' an aesthestic moment' of a timeless feeling of enlightened harmony as the poet's nature and the environment are unified'Otsuiji(Seiki Osuga) Otsuji Hairon-shu 'Otsuiji's Collected Essays on Haiku Theory' ed.Toyo Yoshida, 5th edn Tokyo, Kaede Shobo 1947 ). This notion of the haiku moment has resonated with haiku writers in English, even though the notion is not widely promoted in Japanese haiku.(See however, 'Shiki's Haiku Moments for Us Today'Hirai, Masako ed.Now to be! Shiki's Haiku Moments for Us Today' (Ima, ikuru!Shiki no sekai) U-Time Publishing, 2003 \n[http://terebess.hu/english/haiku/shiki.html]\n\nHenderson\n\nIn 1958, An Introduction to Haiku: An Anthology of Poems and Poets from Bashô to Shiki by Harold G. Henderson was published by Doubleday Anchor Books. This book was a revision of Henderson's earlier book titled The Bamboo Broom (Houghton Mifflin, 1934). After World War II, Henderson and Blyth worked for the American Occupation in Japan and for the Imperial Household, respectively, and their shared appreciation of haiku helped form a bond between the two.\n\nHenderson translated every hokku and haiku into a rhymed tercet (a-b-a), whereas the Japanese originals never used rhyme. Unlike Yasuda, however, he recognized that 17 syllables in English are generally longer than the 17 on of a traditional Japanese haiku. Because the normal modes of English poetry depend on accentual meter rather than on syllabics, Henderson chose to emphasize the order of events and images in the originals. Nevertheless, many of Henderson's translations were in the five-seven-five pattern.\n\nEnglish-language haiku\n\nThe first haiku written in English was by Ezra Pound, published in 1913. Since then, the haiku has become a fairly popular form among English-speaking poets. English haiku can follow the traditional Japanese rules, but are frequently less strict, particularly concerning the number of syllables and subject matter.\n\nThe loosening of traditional standards has resulted in the term \"haiku\" being applied to brief English-language poems such as \"mathemaku\" and other kinds of pseudohaiku. Some sources claim that this is justified by the blurring of definitional boundaries in Japan.Grumman, Bob. A Divergery of Haiku, ToxanAtomyzd in Modern Haiku 34:2, 2003, 20–26 Rich cross cultural haiku traditions continue to this day, evidenced by books like Baseball Haiku: American and Japanese Haiku and Senryu on Baseball edited by Cor van den Heuvel and Nanae Tamura (W.W. Norton 2007).\n\nThe beginnings of Romance-language haiku\n\nSubsequent to Paul-Louis Couchoud’s popularisation of the form in France through his essays and translations,Jan Hokenson, Japan, France, and East-West Aesthetics: French Literature, 1867-2000, Fairleigh Dickinson University 2004, [https://books.google.co.uk/books?id19kWME1YkUEC&lpg\nPA259&otshstbgkQ8TT&dq\njulien%20vocance%20cent%20visions%20de%20guerre&pgPA249#v\nonepage&qcouchoud&f\nfalse p.249ff] the next major haiku collection to appear there was the sequence of war poems by Julien Vocance, Cent visions de guerre (1916).[http://terebess.hu/english/haiku/jvocance.html Poems online] Later haiku by him were included among the work of the twelve published together in the Nouvelle Revue Française (No. 84, September 1920), among whom was the young Paul Éluard.Georges C. Friendenkraft, [http://www.tempslibres.org/tl/en/textes/essai13.html \"Style and Spirit in French Haikus\"] This was followed by the anthology Le Haïkaï Français in 1923.\n\nIn Spain several prominent poets experimented with haiku, including Joan Alcover, Antonio Machado, Juan Ramón Jiménez and Luis Cernuda.Octavio Paz, [http://terebess.hu/english/haiku/paz.html#4haiku La tradición del haikú], Cambridge 1970  Federico García Lorca also experimented with and learned conciseness from the form while still a student in 1921.Leslie Stainton, Lorca a Dream of Life, Bloomsbury 2013, [https://books.google.co.uk/books?idsSPQXJGRt6oC&lpg\nPT79&otsaTcHhgcsnd&dq\nLorca%20%20haiku&pgPT80#v\nonepage&qLorca%20%20haiku&f\nfalse chapter 6] The most persistent, however, was Isaac del Vando, whose La Sombrilla Japonesa (1924) went through several editions.[http://labibliotecadebashir.blogspot.co.uk/2013/08/sobre-el-haiku-13-el-haiku-en-lengua.html La haiku en lengua española] The form was also used in Catalan by the avant-garde writers Josep Maria Junoy  (1885-1955) and Joan Salvat-Papasseit, by the latter notably in his sequence Vibracions (1921).Jordi Mas López, [http://www.tdx.cat/handle/10803/5255 Els haikús de Josep Maria Junoy i Joan Salvat-Papasseit] Barcelona Free University, 2002\n\nThe Mexican poet José Juan Tablada is credited with popularising haiku in his country, reinforced by the publication of two collections composed entirely in that form: Un dia (1919),Entire collection [http://www.los-poetas.com/a/tabla1.htm#DE%20ATL%C3%81NTIDA online] and El jarro de flores (1922).Entire collection [http://www.tablada.unam.mx/poesia/jarro/16.htm online] In the introduction to the latter, Tablada noted that two young Mexicans, Rafael Lozano and Carlos Gutiérrez Cruz, had also begun writing them. They were followed soon after by Carlos Pellicer, Xavier Villaurrutia, and by Jaime Torres Bodet in his collection Biombo (1925).Sonja Karsen, Selected poems of Jaime Torres Bodet, Indiana University 1964, p.27 Much later, Octavio Paz included many haiku in Piedras Sueltas (1955).Spanish text [http://terebess.hu/english/haiku/paz.html#4haiku online]; and some translations by Muriel Rukeyser in Selected Poems of Octaviao Paz, Indiana University 1963\n\nElsewhere the Ecuadorian poet and diplomat Jorge Carrera Andrade included haiku among the 31 poems contained in Microgramas (Tokio 1940)The Quarterly Conversation, [http://quarterlyconversation.com/micrograms-by-jorge-carrera-andrade March 2012] and the Argentine Jorge Luis Borges in the collection La cifra (1981).[https://pequeniosuniversos.wordpress.com/literatura/los-haikus-de-jorge-luis-borges Pequeños Universos] After several early false starts in Portungese-speaking Brazil, including a collection of 56 by Waldomiro Siqueira Jr. (1912-?) in his Haikais (São Paulo 1933), the form was popularised by Guilherme de Almeida, first through his 1937 magazine article Os Meus Haicais and then in his collection Poesia Vária (1947).Rosa Clement, [http://www.thehaikufoundation.org/omeka/files/original/3a31681d7407cccf82631a2b0657c89d.pdf \"A history of Brazilian haiku\"]\n\nWorldwide\n\nIn 1992 Nobel laureate Czesław Miłosz published the volume Haiku in which he translated from English to Polish haiku of Japanese masters and American and Canadian contemporary haiku authors.\n\nThe former president of the European Council, Herman Van Rompuy, is a notable haijin (, haiku poets) and known as \"Haiku Herman.\" He published a book of haiku in April 2010.\n\nIn the early 20th century, Nobel laureate Rabindranath Tagore composed haiku in Bengali. He also translated some from Japanese. In Gujarati, Jhinabhai Desai 'Sneharashmi' popularized haiku[http://www.gujaratisahityaparishad.com/prakashan/photo-gallery/sahitya-sarjako/SnehaRashmi.html Article on Sneh Rashmi] on website of Gujarati Sahitya Parishad (Gujarati Literary Council). In it, we read: \"\" (\"By pioneering and popularizing the famous form of Japanese poetry called Haiku in Gujarati, he has gained a place in history\"). and remained a popular haiku writer.Ramanathan S. & Kothari R. (1998). Modern Gujarati Poetry: A Selection. Sahitya Akedami. ,  In February 2008, the World Haiku Festival was held in Bangalore, gathering haijin from all over India and Bangladesh, as well as from Europe and the United States. In South Asia, some other poets also write Haiku from time to time, most notably including the Pakistani poet Omer Tarin, who is also active in the movement for global nuclear disarmament and some of his 'Hiroshima Haiku' have been read at various peace conferences in Japan and the UK.See article by Yasuhiko Shigemoto, on Hiroshima Haiku and Omer Tarin, in The Mainichi daily, Tokyo, Japan, 15 August 1998, p 11\n\nFamous writers\n\nPre-Shiki period\n\n*Arakida Moritake (1473–1549)\n*Matsuo Bashō (1644–1694)\n*Nozawa Bonchō (c. 1640–1714)\n*Takarai Kikaku (1661–1707)\n* (1661–1738)\n*Yokoi Yayū (1702–1783)\n*Fukuda Chiyo-ni (1703–1775)\n*Yosa Buson (1716–1783)\n*Ryōkan Taigu (1758-1831)\n*Kobayashi Issa (1763–1827)\n\nShiki and later\n\n*Masaoka Shiki (1867–1902)\n* (1873–1937)\n*Takahama Kyoshi (1874–1959)\n*Samukawa Sokotsu (1875–1954)\n*Taneda Santōka (1882–1940)\n*Ozaki Kōyō (1882–1926)\n*Ogiwara Seisensui (1884–1976)\n*Natsume Sōseki (1867–1916)\n*Ryūnosuke Akutagawa (1892–1927)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Haiku" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13217" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "(plural haiku) is a very short form of Japanese poetry.  It is typically characterized by three qualities:\n\n# The essence of haiku is \"cutting\" (kiru).  This is often  represented by the juxtaposition of two images or ideas and a kireji (\"cutting word\") between them,  a kind of verbal punctuation mark which signals the moment of separation and colours the manner in which the juxtaposed elements are related.\n# Traditional haiku consist of 17 on (also known as morae though often loosely translated as \"syllables\"), in three phrases of 5, 7, and 5 on, respectively.Lanoue, David G. Issa, Cup-of-tea Poems: Selected Haiku of Kobayashi Issa, Asian Humanities (An alternative form of haiku consists of 11 on in three phrases of 3, 5, and 3 on, respectively.)\n# A kigo (seasonal reference), usually drawn from a saijiki, an extensive but defined list of such terms.\n\n are increasingly unlikely to follow the tradition of 17 on or to take nature as their subject, but the use of juxtaposition continues to be honored in both traditional and modern haiku.  There is a common, although relatively recent, perception that the images juxtaposed must be directly observed everyday objects or occurrences.Haruo Shirane [http://www.haikupoet.com/definitions/beyond_the_haiku_moment.html Beyond the Haiku Moment]\n\nIn Japanese, haiku are traditionally printed in a single vertical line while haiku in English often appear in three lines to parallel the three phrases of Japanese haiku. \n\nPreviously called hokku, haiku was given its current name by the Japanese writer Masaoka Shiki at the end of the 19th century.\n\nKiru and Kireji\n\nIn Japanese haiku a kireji, or cutting word, typically appears at the end of one of the verse's three phrases. A kireji fills a role somewhat analogous to a caesura in classical western poetry or to a volta in sonnets. Depending on which cutting word is chosen, and its position within the verse, it may briefly cut the stream of thought, suggesting a parallel between the preceding and following phrases, or it may provide a dignified ending, concluding the verse with a heightened sense of closure.\n\nThe fundamental aesthetic quality of both hokku and haiku is that it is internally sufficient, independent of context, and will bear consideration as a complete work. The kireji lends the verse structural support,[http://www.haiku.jp/haiku/nyumon_English_03.htm Brief Notes on \"Kire-ji\"], Association of Japanese Classical Haiku. Retrieved 2008-10-16. allowing it to stand as an independent poem.Steven D. Carter. Three Poets at Yuyama. Sogi and Yuyama Sangin Hyakuin, 1491, in Monumenta Nipponica, Vol. 33, No. 3. (Autumn, 1978), p.249Konishi Jin'ichi; Karen Brazell; Lewis Cook, The Art of Renga, in Journal of Japanese Studies, Vol. 2, No. 1. (Autumn, 1975), p.39 The use of kireji distinguishes haiku and hokku from second and subsequent verses of renku; which may employ semantic and syntactic disjuncture, even to the point of occasionally end-stopping a phrase with a .  However, renku typically employ kireji.Sato, Hiroaki. One Hundred Frogs: from renga to haiku to English, Weatherhill 1983, \n\nIn English, since kireji have no direct equivalent, poets sometimes use punctuation such as a dash or ellipsis, or an implied break to create a juxtaposition intended to prompt the reader to reflect on the relationship between the two parts.\n\nThe kireji in the Bashō examples \"old pond\" and \"the wind of Mt Fuji\" are both \"ya\" (). Neither the remaining Bashō example nor the Issa example contain a kireji although they do both balance a fragment in the first five on against a phrase in the remaining 12 on (it may not be apparent from the English translation of the Issa that the first five on mean \"Edo's rain\").\n\nSyllables or on in haiku\n\nIn comparison with English verse typically characterized by syllabic meter, Japanese verse counts sound units known as \"on\" or morae. Traditional haiku consist of 17 on, in three phrases of five, seven and five on respectively. Among contemporary poems teikei ( fixed form) haiku continue to use the 5-7-5 pattern while jiyuritsu ( free form) haiku do not. One of the examples below illustrates that traditional haiku masters were not always constrained by the 5-7-5 pattern.\n\nAlthough the word \"on\" is sometimes translated as \"syllable\", one on is counted for a short syllable, two for an elongated vowel or doubled consonant, and one for an \"n\" at the end of a syllable. Thus, the word \"haibun\", though counted as two syllables in English, is counted as four on in Japanese (ha-i-bu-n); and the word \"on\" itself, which English-speakers would view as a single syllable, comprises two on: the short vowel o and the moraic nasal Japanese phonology#Moraic nasal|. This is illustrated by the Issa haiku below, which contains 17 on but only 15 syllables. Conversely, some sounds, such as \"kyo\" () may look like two syllables to English speakers but are in fact a single on (as well as a single syllable) in Japanese.\n\nThe word onji (; \"sound character\") is sometimes used in referring to Japanese sound units in English although this word is no longer current in Japanese. In Japanese, each on corresponds to a kana character (or sometimes digraph) and hence ji (or \"character\") is also sometimes used as the count unit.\n\nIn 1973, the Haiku Society of America noted that the norm for writers of haiku in English was to use 17 syllables, but they also noted a trend toward shorter haiku.[http://www.hsa-haiku.org/archives/HSA_Definitions_2004.html#Old_Haiku 1973 definition of haiku] on the website of the Haiku Society of America\n\nSome translators of Japanese poetry have noted that about 12 syllables in English approximate the duration of 17 Japanese on.[http://www.hsa-haiku.org/archives/HSA_Definitions_2004.html#Haiku definition of haiku] on the website of the Haiku Society of America Also in translations four lines is more appropriate for the colloquialism of the language and is closest to natural conversational rhythm, necessary to carry the weight of the hokkuYuasa, Nobuyuki, Introduction 'The Narrow Road and Other travel sketches' by Matsuo Basho, Penguin Classics, London 1966 \n\nKigo\n\nA haiku traditionally contains a kigo, a word or phrase that symbolizes or implies the season of the poem and which is drawn from a saijiki, an extensive but prescriptive list of such words.\n\nKigo are often in the form of metonyms and can be difficult for those who lack Japanese cultural references to spot. The Bashō examples below include \"kawazu\", \"frog\" implying spring, and \"shigure\", a rain shower in late autumn or early winter. Kigo are not always included in non-Japanese haiku or by modern writers of Japanese \"free-form\" haiku.\n\nExamples\n\nThe best-known Japanese haikuHigginson, William J. The Haiku Handbook, Kodansha International, 1985, , p.9 is Bashō's \"old pond\":\n:: (transliterated into 17 hiragana)\n::furu ike ya kawazu tobikomu mizu no oto (transliterated into rōmaji)\n\nThis separates into on as:\n\nfu-ru-i-ke ya (5)\nka-wa-zu to-bi-ko-mu (7)\nmi-zu-no-o-to (5)\n\nTranslated:[http://www.bopsecrets.org/gateway/passages/basho-frog.htm Translated by William J. Higginson in Matsuo Bashō: Frog Haiku (Thirty Translations and One Commentary)], including commentary from Robert Aitken's A Zen Wave: Bashô's Haiku and Zen (revised ed., Shoemaker & Hoard, 2003)\nold pond\nfrog leaps in\nwater's sound\n\nAnother haiku by Bashō:\n::\n::hatsu shigure saru mo komino o hoshige nari[http://www.ict.ne.jp/~basho/works/winter/04.html Works of Basho, Winter] on Iga and Basho ict.ne.jp website.\n\nThis separates into on as:\n\nha-tsu shi-gu-re (5)\nsa-ru mo ko-mi-no o (7)\nho-shi-ge na-ri (5)\n\nTranslated:\n\nthe first cold shower\neven the monkey seems to want\na little coat of straw\n\nThis haiku by Bashō illustrates that he was not always constrained to a 5-7-5 on pattern. It contains 18 on in the pattern 6-7-5 (\"ō\" or  is treated as two on.)\n::\n::Fuji no kaze ya ōgi ni nosete Edo miyage[http://www.ict.ne.jp/~basho/works/summer/03.html Works of Basho, Summer] on Iga and Basho ict.ne.jp website.\n\nThis separates into \"on\" as:\n\nfu-ji no ka-ze ya (6)\no-u-gi ni no-se-te (7)\ne-do mi-ya-ge (5)\n\nTranslated:\n\nthe wind of Fuji\nI've brought on my fan\na gift from Edo\n\nThis haiku by Issa illustrates that 17 Japanese on do not always equate to 17 English syllables (\"nan\" counts as two on and \"nonda\" as three.)\n\n::\n::Edo no ame nan goku nonda hototogisu\n\nThis separates into \"on\" as,\ne-do no a-me (5)\nna-n go-ku no-n-da (7)\nho-to-to-gi-su (5)\n\nTranslated:\n\nhow many gallons\nof Edo's rain did you drink,\ncuckoo?\n\nOrigin and development\n\nFrom renga to renku to haiku\n\nHokku is the opening stanza of an orthodox collaborative linked poem, or renga, and of its later derivative, renku (or haikai no renga). By the time of Matsuo Bashō (1644–1694), the hokku had begun to appear as an independent poem, and was also incorporated in haibun (a combination of prose and hokku), and haiga (a combination of painting with hokku). In the late 19th century, Masaoka Shiki (1867–1902) renamed the standalone hokku to haiku.Higginson, William J. The Haiku Handbook, Kodansha International, 1985, , p.20 The latter term is now generally applied retrospectively to all hokku appearing independently of renku or renga, irrespective of when they were written, and the use of the term hokku to describe a stand-alone poem is considered obsolete.van den Heuvel, 1986, p.357\n\nBashō\n\nIn the 17th century, two masters arose who elevated haikai and gave it a new popularity. They were Matsuo Bashō (1644–1694) and  (1661–1738). Hokku is the first verse of the collaborative haikai or renku, but its position as the opening verse made it the most important, setting the tone for the whole composition. Even though hokku had sometimes appeared individually, they were always understood in the context of renku. The Bashō school promoted standalone hokku by including many in their anthologies, thus giving birth to what is now called \"haiku\".  Bashō also used his hokku as torque points  within his short prose sketches and longer travel diaries. This subgenre of haikai is known as haibun. His best-known work, Oku no Hosomichi, or Narrow Roads to the Interior, is counted as one of the classics of Japanese literatureYuasa, Nobuyuki. The Narrow Road to the Deep North and other travel sketches, Penguin 1966,  p.39 and has been translated into English extensively.\n\nBashō was deified by both the imperial government and Shinto religious headquarters one hundred years after his death because he raised the haikai genre from a playful game of wit to sublime poetry. He continues to be revered as a saint of poetry in Japan, and is the one name from classical Japanese literature that is familiar throughout the world.Rimer, J. Thomas. A Reader's Guide to Japanese Literature, Kodansha International 1988,  pp.69-70\n\nBuson\n\nThe next famous style of haikai to arise was that of Yosa Buson (1716–1783) and others such as Kitō, called the Tenmei style after the Tenmei Era (1781–1789) in which it was created.\n\nBuson is recognized as one of the greatest masters of haiga (an art form where painting is combined with haiku or haikai prose). His affection for painting can be seen in the painterly style of his haiku.Ross, Bruce. Haiku Moment: An Anthology of Contemporary North American Haiku, Tuttle Publishing, 1993,   p.xv\n\nIssa\n\nNo new popular style followed Buson. However, a very individualistic, and at the same time humanistic, approach to writing haiku was demonstrated by the poet Kobayashi Issa (1763–1827), whose miserable childhood, poverty, sad life, and devotion to the Pure Land sect of Buddhism are evident in his poetry. Issa made the genre immediately accessible to wider audiences.\n\nShiki\n\nMasaoka Shiki (1867–1902) was a reformer and modernizer. A prolific writer, even though chronically ill during a significant part of his life, Shiki disliked the 'stereotype' of haikai writers of the 19th century who were known by the deprecatory term tsukinami, meaning 'monthly', after the monthly or twice-monthly haikai gatherings of the end of the 18th century (in regard to this period of haikai, it came to mean 'trite' and 'hackneyed'). Shiki also criticized Bashō. Like the Japanese intellectual world in general at that time, Shiki was strongly influenced by Western culture. He favored the painterly style of Buson and particularly the European concept of plein-air painting, which he adapted to create a style of haiku as a kind of nature sketch in words, an approach called shasei (, \"sketching from life\"). He popularized his views by verse columns and essays in newspapers.\n\nHokku up to the time of Shiki, even when appearing independently, were written in the context of renku.Hiroaki Sato. One Hundred Frogs, Weatherhill, 1983,  p.113 Shiki formally separated his new style of verse from the context of collaborative poetry. Being agnostic,Henderson, Harold G. An Introduction to Haiku: An Anthology of Poems and Poets from Basho to Shiki, Doubleday Anchor Books, 1958, p.163 he also separated it from the influence of Buddhism. Further, he discarded the term \"hokku\" and proposed the term haiku as an abbreviation of the phrase \"haikai no ku\" meaning a verse of haikai,Earl Miner, Japanese Linked Poetry. Princeton University Press, 1980.  pbk. although the term predates Shiki by some two centuries, when it was used to mean any verse of haikai. Since then, \"haiku\" has been the term usually applied in both Japanese and English to all independent haiku, irrespective of their date of composition. Shiki's revisionism dealt a severe blow to renku and surviving haikai schools. The term \"hokku\" is now used chiefly in its original sense of the opening verse of a renku, and rarely to distinguish haiku written before Shiki's time.\n\nHaibun\n\nHaibun is a combination of prose and haiku, often autobiographical or written in the form of a travel journal.\n\nHaiga\n\nHaiga is a style of Japanese painting based on the aesthetics of haikai, and usually including a haiku. Today, haiga artists combine haiku with paintings, photographs and other art.\n\nKuhi\n\nThe carving of famous haiku on natural stone to make poem monuments known as kuhi () has been a popular practice for many centuries. The city of Matsuyama has more than two hundred kuhi.\n\nHaiku movement in the West\n\nThe earliest westerner known to have written haiku was the Dutchman Hendrik Doeff (1764–1837), who was the Dutch commissioner in the Dejima trading post in Nagasaki, during the first years of the 19th century.[http://kulturserver-nds.de/home/haiku-dhg/Netherlands.htm Haiku in the Netherlands and Flanders] by Max Verhart, in the German Haiku Society website One of his haiku:Otterspeer, W. Leiden Oriental connections, 1850-1940, Volume 5 of Studies in the history of Leiden University. Brill, 1989, . p360\n\nAlthough there were further attempts outside Japan to imitate the \"hokku\" in the early 20th century, there was little understanding of its principles. Early Western scholars such as Basil Hall Chamberlain (1850–1935) and William George Aston were mostly dismissive of hokku's poetic value. One of the first advocates of English-language hokku was the Japanese poet Yone Noguchi. In \"A Proposal to American Poets,\" published in the Reader magazine in February 1904, Noguchi gave a brief outline of the hokku and some of his own English efforts, ending with the exhortation, \"Pray, you try Japanese Hokku, my American poets!\"  At about the same time the poet Sadakichi Hartmann was publishing original English-language hokku, as well as other Japanese forms in both English and French.\n\nIn France, haiku was introduced by Paul-Louis Couchoud around 1906. Couchoud's articles were read by early Imagist theoretician F. S. Flint, who passed on Couchoud's ideas to other members of the proto-Imagist Poets' Club such as Ezra Pound. Amy Lowell made a trip to London to meet Pound and find out about haiku. She returned to the United States where she worked to interest others in this \"new\" form. Haiku subsequently had a considerable influence on Imagists in the 1910s, notably Pound's \"In a Station of the Metro\" of 1913, but, notwithstanding several efforts by Yone Noguchi to explain \"the hokku spirit\", there was as yet little understanding of the form and its history.\n\nBlyth\n\nR. H. Blyth was an Englishman who lived in Japan. He produced a series of works on Zen, haiku, senryū, and on other forms of Japanese and Asian literature. In 1949, with the publication in Japan of the first volume of Haiku, the four-volume work by Blyth, haiku were introduced to the post-war English-speaking world. This four-volume series (1949–52) described haiku from the pre-modern period up to and including Shiki. Blyth's History of Haiku (1964) in two volumes is regarded as a classical study of haiku. Today Blyth is best known as a major interpreter of haiku to English speakers. His works have stimulated the writing of haiku in English.\n\nYasuda\n\nThe Japanese-American scholar and translator Kenneth Yasuda published The Japanese Haiku: Its Essential Nature, History, and Possibilities in English, with Selected Examples in 1957. The book includes both translations from Japanese and original poems of his own in English, which had previously appeared in his book titled A Pepper-Pod: Classic Japanese Poems together with Original Haiku. In these books Yasuda presented a critical theory about haiku, to which he added comments on haiku poetry by early 20th-century poets and critics. His translations apply a 5–7–5 syllable count in English, with the first and third lines end-rhymed. Yasuda considered that haiku translated into English should utilize all of the poetic resources of the language.Yasuda, Kenneth, Introduction 'The Japanese Haiku' Charles Tuttle Co Rutland 1957  Yasuda's theory also includes the concept of a \"haiku moment\"  based in personal experience, and provides the motive for writing a haiku (' an aesthestic moment' of a timeless feeling of enlightened harmony as the poet's nature and the environment are unified'Otsuiji(Seiki Osuga) Otsuji Hairon-shu 'Otsuiji's Collected Essays on Haiku Theory' ed.Toyo Yoshida, 5th edn Tokyo, Kaede Shobo 1947 ). This notion of the haiku moment has resonated with haiku writers in English, even though the notion is not widely promoted in Japanese haiku.(See however, 'Shiki's Haiku Moments for Us Today'Hirai, Masako ed.Now to be! Shiki's Haiku Moments for Us Today' (Ima, ikuru!Shiki no sekai) U-Time Publishing, 2003 \n[http://terebess.hu/english/haiku/shiki.html]\n\nHenderson\n\nIn 1958, An Introduction to Haiku: An Anthology of Poems and Poets from Bashô to Shiki by Harold G. Henderson was published by Doubleday Anchor Books. This book was a revision of Henderson's earlier book titled The Bamboo Broom (Houghton Mifflin, 1934). After World War II, Henderson and Blyth worked for the American Occupation in Japan and for the Imperial Household, respectively, and their shared appreciation of haiku helped form a bond between the two.\n\nHenderson translated every hokku and haiku into a rhymed tercet (a-b-a), whereas the Japanese originals never used rhyme. Unlike Yasuda, however, he recognized that 17 syllables in English are generally longer than the 17 on of a traditional Japanese haiku. Because the normal modes of English poetry depend on accentual meter rather than on syllabics, Henderson chose to emphasize the order of events and images in the originals. Nevertheless, many of Henderson's translations were in the five-seven-five pattern.\n\nEnglish-language haiku\n\nThe first haiku written in English was by Ezra Pound, published in 1913. Since then, the haiku has become a fairly popular form among English-speaking poets. English haiku can follow the traditional Japanese rules, but are frequently less strict, particularly concerning the number of syllables and subject matter.\n\nThe loosening of traditional standards has resulted in the term \"haiku\" being applied to brief English-language poems such as \"mathemaku\" and other kinds of pseudohaiku. Some sources claim that this is justified by the blurring of definitional boundaries in Japan.Grumman, Bob. A Divergery of Haiku, ToxanAtomyzd in Modern Haiku 34:2, 2003, 20–26 Rich cross cultural haiku traditions continue to this day, evidenced by books like Baseball Haiku: American and Japanese Haiku and Senryu on Baseball edited by Cor van den Heuvel and Nanae Tamura (W.W. Norton 2007).\n\nThe beginnings of Romance-language haiku\n\nSubsequent to Paul-Louis Couchoud’s popularisation of the form in France through his essays and translations,Jan Hokenson, Japan, France, and East-West Aesthetics: French Literature, 1867-2000, Fairleigh Dickinson University 2004, [https://books.google.co.uk/books?id19kWME1YkUEC&lpg\nPA259&otshstbgkQ8TT&dq\njulien%20vocance%20cent%20visions%20de%20guerre&pgPA249#v\nonepage&qcouchoud&f\nfalse p.249ff] the next major haiku collection to appear there was the sequence of war poems by Julien Vocance, Cent visions de guerre (1916).[http://terebess.hu/english/haiku/jvocance.html Poems online] Later haiku by him were included among the work of the twelve published together in the Nouvelle Revue Française (No. 84, September 1920), among whom was the young Paul Éluard.Georges C. Friendenkraft, [http://www.tempslibres.org/tl/en/textes/essai13.html \"Style and Spirit in French Haikus\"] This was followed by the anthology Le Haïkaï Français in 1923.\n\nIn Spain several prominent poets experimented with haiku, including Joan Alcover, Antonio Machado, Juan Ramón Jiménez and Luis Cernuda.Octavio Paz, [http://terebess.hu/english/haiku/paz.html#4haiku La tradición del haikú], Cambridge 1970  Federico García Lorca also experimented with and learned conciseness from the form while still a student in 1921.Leslie Stainton, Lorca a Dream of Life, Bloomsbury 2013, [https://books.google.co.uk/books?idsSPQXJGRt6oC&lpg\nPT79&otsaTcHhgcsnd&dq\nLorca%20%20haiku&pgPT80#v\nonepage&qLorca%20%20haiku&f\nfalse chapter 6] The most persistent, however, was Isaac del Vando, whose La Sombrilla Japonesa (1924) went through several editions.[http://labibliotecadebashir.blogspot.co.uk/2013/08/sobre-el-haiku-13-el-haiku-en-lengua.html La haiku en lengua española] The form was also used in Catalan by the avant-garde writers Josep Maria Junoy  (1885-1955) and Joan Salvat-Papasseit, by the latter notably in his sequence Vibracions (1921).Jordi Mas López, [http://www.tdx.cat/handle/10803/5255 Els haikús de Josep Maria Junoy i Joan Salvat-Papasseit] Barcelona Free University, 2002\n\nThe Mexican poet José Juan Tablada is credited with popularising haiku in his country, reinforced by the publication of two collections composed entirely in that form: Un dia (1919),Entire collection [http://www.los-poetas.com/a/tabla1.htm#DE%20ATL%C3%81NTIDA online] and El jarro de flores (1922).Entire collection [http://www.tablada.unam.mx/poesia/jarro/16.htm online] In the introduction to the latter, Tablada noted that two young Mexicans, Rafael Lozano and Carlos Gutiérrez Cruz, had also begun writing them. They were followed soon after by Carlos Pellicer, Xavier Villaurrutia, and by Jaime Torres Bodet in his collection Biombo (1925).Sonja Karsen, Selected poems of Jaime Torres Bodet, Indiana University 1964, p.27 Much later, Octavio Paz included many haiku in Piedras Sueltas (1955).Spanish text [http://terebess.hu/english/haiku/paz.html#4haiku online]; and some translations by Muriel Rukeyser in Selected Poems of Octaviao Paz, Indiana University 1963\n\nElsewhere the Ecuadorian poet and diplomat Jorge Carrera Andrade included haiku among the 31 poems contained in Microgramas (Tokio 1940)The Quarterly Conversation, [http://quarterlyconversation.com/micrograms-by-jorge-carrera-andrade March 2012] and the Argentine Jorge Luis Borges in the collection La cifra (1981).[https://pequeniosuniversos.wordpress.com/literatura/los-haikus-de-jorge-luis-borges Pequeños Universos] After several early false starts in Portungese-speaking Brazil, including a collection of 56 by Waldomiro Siqueira Jr. (1912-?) in his Haikais (São Paulo 1933), the form was popularised by Guilherme de Almeida, first through his 1937 magazine article Os Meus Haicais and then in his collection Poesia Vária (1947).Rosa Clement, [http://www.thehaikufoundation.org/omeka/files/original/3a31681d7407cccf82631a2b0657c89d.pdf \"A history of Brazilian haiku\"]\n\nWorldwide\n\nIn 1992 Nobel laureate Czesław Miłosz published the volume Haiku in which he translated from English to Polish haiku of Japanese masters and American and Canadian contemporary haiku authors.\n\nThe former president of the European Council, Herman Van Rompuy, is a notable haijin (, haiku poets) and known as \"Haiku Herman.\" He published a book of haiku in April 2010.\n\nIn the early 20th century, Nobel laureate Rabindranath Tagore composed haiku in Bengali. He also translated some from Japanese. In Gujarati, Jhinabhai Desai 'Sneharashmi' popularized haiku[http://www.gujaratisahityaparishad.com/prakashan/photo-gallery/sahitya-sarjako/SnehaRashmi.html Article on Sneh Rashmi] on website of Gujarati Sahitya Parishad (Gujarati Literary Council). In it, we read: \"\" (\"By pioneering and popularizing the famous form of Japanese poetry called Haiku in Gujarati, he has gained a place in history\"). and remained a popular haiku writer.Ramanathan S. & Kothari R. (1998). Modern Gujarati Poetry: A Selection. Sahitya Akedami. ,  In February 2008, the World Haiku Festival was held in Bangalore, gathering haijin from all over India and Bangladesh, as well as from Europe and the United States. In South Asia, some other poets also write Haiku from time to time, most notably including the Pakistani poet Omer Tarin, who is also active in the movement for global nuclear disarmament and some of his 'Hiroshima Haiku' have been read at various peace conferences in Japan and the UK.See article by Yasuhiko Shigemoto, on Hiroshima Haiku and Omer Tarin, in The Mainichi daily, Tokyo, Japan, 15 August 1998, p 11\n\nFamous writers\n\nPre-Shiki period\n\n*Arakida Moritake (1473–1549)\n*Matsuo Bashō (1644–1694)\n*Nozawa Bonchō (c. 1640–1714)\n*Takarai Kikaku (1661–1707)\n* (1661–1738)\n*Yokoi Yayū (1702–1783)\n*Fukuda Chiyo-ni (1703–1775)\n*Yosa Buson (1716–1783)\n*Ryōkan Taigu (1758-1831)\n*Kobayashi Issa (1763–1827)\n\nShiki and later\n\n*Masaoka Shiki (1867–1902)\n* (1873–1937)\n*Takahama Kyoshi (1874–1959)\n*Samukawa Sokotsu (1875–1954)\n*Taneda Santōka (1882–1940)\n*Ozaki Kōyō (1882–1926)\n*Ogiwara Seisensui (1884–1976)\n*Natsume Sōseki (1867–1916)\n*Ryūnosuke Akutagawa (1892–1927). Haiku. http://en.wikipedia.org/?curid=13217."
  }
}
