{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1009",
  "eid" : "a8fef3d0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778363277,
  "textBody" : "Events\n\n* 238 – Gordian II loses the Battle of Carthage against the Numidian forces loyal to Maximinus Thrax and is killed. Gordian I, his father, commits suicide.\n* 240 – Shapur I becomes co-emperor of the Sasanian Empire with his father Ardashir I.\n* 467 – Anthemius is elevated to Emperor of the Western Roman Empire.\n* 627 – King Edwin of Northumbria is converted to Christianity by Paulinus, bishop of York.\n*1167 – King Karl Sverkersson of Sweden is murdered on Visingsö.\n*1204 – The Crusaders of the Fourth Crusade breach the walls of Constantinople and enter the city, which they completely occupy the following day.\n*1606 – The Union Flag is adopted as the flag of English and Scottish ships.\n*1776 – American Revolution: With the Halifax Resolves, the North Carolina Provincial Congress authorizes its Congressional delegation to vote for independence from Britain.\n*1807 – The Froberg mutiny ends when the remaining mutineers blow up the magazine of Fort Ricasoli.\n*1820 – Alexander Ypsilantis is declared leader of Filiki Eteria, a secret organization to overthrow Ottoman rule over Greece.\n*1831 – Soldiers marching on the Broughton Suspension Bridge in Manchester, England cause it to collapse.\n*1861 – American Civil War: Battle of Fort Sumter. The war begins with Confederate forces firing on Fort Sumter, in the harbor of Charleston, South Carolina.\n*1862 – American Civil War: The Andrews Raid (the Great Locomotive Chase) occurs, starting from Big Shanty, Georgia (now Kennesaw).\n*1864 – American Civil War: The Battle of Fort Pillow: Confederate forces kill most of the African American soldiers that surrendered at Fort Pillow, Tennessee.\n*1865 – American Civil War: Mobile, Alabama, falls to the Union Army.\n*1877 – The United Kingdom annexes the Transvaal.\n*1910 – , one of the last pre-dreadnought battleships built by the Austro-Hungarian Navy, is launched.\n*1917 – World War I: Canadian forces successfully complete the taking of Vimy Ridge from the Germans.\n*1927 – Shanghai massacre of 1927: Chiang Kai-shek orders the Communist Party of China members executed in Shanghai, ending the First United Front.\n*  1927   – Rocksprings, Texas was hit by an F5 tornado that destroyed 235 of the 247 buildings in the town and killed 72 townspeople and injured 205; third deadliest tornado in Texas history.\n*1928 – The Bremen, a German Junkers W 33 type aircraft, takes off for the first successful transatlantic aeroplane flight from east to west.\n*1934 – The strongest surface wind gust in the world at the time of 231 mph, is measured on the summit of Mount Washington, New Hampshire.  It has since been surpassed.\n*  1934   – The U.S. Auto-Lite strike begins, culminating in a five-day melee between Ohio National Guard troops and 6,000 strikers and picketers.\n*1937 – Sir Frank Whittle ground-tests the first jet engine designed to power an aircraft, at Rugby, England.\n*1945 – U.S. President Franklin D. Roosevelt dies in office; Vice President Harry S. Truman becomes President upon Roosevelt's death.\n*  1945   – The U.S. Ninth Army under General William H. Simpson crosses the Elbe River astride Magdeburg, and reached Tangermünde—only 50 miles from Berlin.\n*1955 – The polio vaccine, developed by Dr. Jonas Salk, is declared safe and effective.\n*1961 – The Soviet cosmonaut Yuri Gagarin becomes the first human to travel into outer space and perform the first manned orbital flight, Vostok 1.\n*1963 – The Soviet nuclear-powered submarine K-33 collides with the Finnish merchant vessel M/S Finnclipper in the Danish straits.\n*1970 – Soviet submarine K-8, carrying four nuclear torpedoes, sinks in the Bay of Biscay four days after a fire on board.\n*1980 – Samuel Doe takes control of Liberia in a coup d'état, ending over 130 years of minority Americo-Liberian rule over the country.\n*1981 – The first launch of a Space Shuttle (Columbia) takes place: The STS-1 mission.\n*1990 – Jim Gary's \"Twentieth Century Dinosaurs\" exhibition opens at the Smithsonian Institution National Museum of Natural History in Washington, D.C. He is the only sculptor ever invited to present a solo exhibition there. \n*1992 – The Euro Disney Resort officially opens with its theme park Euro Disneyland; the resort and its park's name are subsequently changed to Disneyland Paris.\n*1999 – United States President Bill Clinton is cited for contempt of court for giving \"intentionally false statements\" in a civil lawsuit; he is later fined and disbarred.\n*2002 – A suicide bomber blows herself up at the entrance to Jerusalem's Mahane Yehuda Market, killing seven people and wounding 104.\n*2007 – A suicide bomber penetrates the Green Zone and detonates in a cafeteria within a parliament building, killing Iraqi MP Mohammed Awad and wounding more than twenty other people.\n*2009 – Zimbabwe officially abandons the Zimbabwean dollar as its official currency.\n*2013 – Two suicide bombers kill three Chadian soldiers and injure dozens of civilians at a market in Kidal, Mali.\n*2014 – The Great Fire of Valparaíso ravages the Chilean city of Valparaíso, killing 16, displacing nearly 10,000, and destroying over 2,000 homes.\n*2017 – Zuma Must Fall protests resume in South Africa, with Julius Malema addressing large crowds in Pretoria.[http://weeklyxpose.co.za/2017/04/12/opposition-parties-take-their-grievance/ Weekly Xpose South Africa]\n\nBirths\n\n* 959 – En'yū, emperor of Japan (d. 991)\n*1116 – Richeza of Poland, queen of Sweden and Grand Princess of Minsk (d. 1156)\n*1432 – Anne of Austria, Landgravine of Thuringia (d. 1462)\n*1484 – Antonio da Sangallo the Younger, Italian architect, designed the Apostolic Palace and St. Peter's Basilica (d. 1546)\n*  1484   – Maharana Sangram Singh, Rana of Mewar (d. 1527)\n*1500 – Joachim Camerarius, German scholar and translator (d. 1574)\n*1526 – Muretus, French philosopher and author (d. 1585)\n*1550 – Edward de Vere, 17th Earl of Oxford, English courtier and politician, Lord Great Chamberlain (d. 1604)\n*1577 – Christian IV of Denmark (d. 1648)\n*1612 – Simone Cantarini, Italian painter and engraver (d. 1648)\n*1639 – Martin Lister, English naturalist and physician (d. 1712)\n*1656 – Benoît de Maillet, French diplomat and natural historian (d. 1738)\n*1705 – William Cookworthy, English minister and pharmacist (d. 1780)\n*1710 – Caffarelli, Italian actor and singer (d. 1783)\n*1713 – Guillaume Thomas François Raynal, French historian and author (d. 1796)\n*1716 – Felice Giardini, Italian violinist and composer (d. 1796)\n*1722 – Pietro Nardini, Italian violinist and composer (d. 1793)\n*1724 – Lyman Hall, American physician, clergyman, and politician, 16th Governor of Georgia (d. 1790)\n*1748 – Antoine Laurent de Jussieu, French botanist and author (d. 1836)\n*1777 – Henry Clay, American lawyer and politician, 9th United States Secretary of State (d. 1852)\n*1792 – John Lambton, 1st Earl of Durham, English soldier and politician, Lord Privy Seal (d. 1840)\n*1794 – Germinal Pierre Dandelin, Belgian mathematician and engineer (d. 1847)\n*1796 – George N. Briggs, American lawyer and politician, 19th Governor of Massachusetts (d. 1861)\n*1799 – Henri Druey, Swiss lawyer and politician, 2nd President of the Swiss Confederation (d. 1855)\n*1801 – Joseph Lanner, Austrian composer and conductor (d. 1843)\n*1816 – Charles Gavan Duffy, Irish-Australian politician, 8th Premier of Victoria (d. 1903)\n*1823 – Alexander Ostrovsky, Russian playwright and translator (d. 1886)\n*1839 – Nikolay Przhevalsky, Russian geographer and explorer (d. 1888)\n*1845 – Gustaf Cederström, Swedish painter (d. 1933)\n*1848 – José Gautier Benítez, Puerto Rican soldier and poet (d. 1880)\n*1851 – Edward Walter Maunder, English astronomer and author (d. 1928)\n*1852 – Ferdinand von Lindemann, German mathematician and academic (d. 1939)\n*1856 – Martin Conway, 1st Baron Conway of Allington, English mountaineer, cartographer, and politician (d. 1937)\n*1863 – Raul Pompeia, Brazilian writer (d. 1895)\n*1868 – Akiyama Saneyuki, Japanese admiral (d. 1918)\n*1869 – Henri Désiré Landru, French serial killer (d. 1922) \n*1871 – Ioannis Metaxas, Greek general and politician, 130th Prime Minister of Greece (d. 1941)\n*1874 – William B. Bankhead, American lawyer and politician, 47th Speaker of the United States House of Representatives (d. 1940)\n*1880 – Addie Joss, American baseball player and journalist (d. 1911)\n*1883 – Imogen Cunningham, American photographer and educator (d. 1976)\n*1883 – Dally Messenger, Australian rugby player, cricketer, and sailor (d. 1959)\n*1884 – Tenby Davies, Welsh runner (d. 1932)\n*  1884   – Otto Meyerhof, German physician and biochemist, Nobel Prize laureate (d. 1951)\n*1885 – Robert Delaunay, French painter (d. 1941)\n*1887 – Harold Lockwood, American actor and director (d. 1918)\n*1888 – Dan Ahearn, Irish-American long jumper and police officer (d. 1942)\n*  1888   – Cecil Kimber, English automobile engineer (d. 1945)\n*1892 – Henry Darger, American writer and artist (d. 1973)\n*1894 – Dorothy Cumming, Australian-American actress (d. 1983)\n*  1894   – Francisco Craveiro Lopes, Portuguese field marshal and politician, 13th President of Portugal (d. 1964)\n*1898 – Lily Pons, French-American soprano and actress (d. 1976)\n*1901 – Lowell Stockman, American farmer and politician (d. 1962)\n*1902 – Louis Beel, Dutch academic and politician, 36th Prime Minister of the Netherlands (d. 1977)\n*1903 – Jan Tinbergen, Dutch economist and academic, Nobel Prize laureate (d. 1994)\n*1907 – Zawgyi, Burmese poet, author, literary historian, critic, scholar and academic (d. 1990)\n*  1907   – Felix de Weldon, Austrian-American sculptor, designed the Marine Corps War Memorial (d. 2003)\n*1908 – Ida Pollock, English author and painter (d. 2013)\n*  1908   – Robert Lee Scott, Jr., American pilot and general (d. 2006)\n*1910 – Gillo Dorfles, Italian art critic, painter and philosopher\n*  1910 – Irma Rapuzzi, French politician\n*1911 – Mahmoud Younis, Egyptian engineer (d. 1976)\n*1912 – Frank Dilio, Canadian businessman (d. 1997)\n*  1912   – Hamengkubuwono IX, Indonesian politician, 2nd Vice President of Indonesia (d. 1988)\n*  1912   – Hound Dog Taylor, American singer-songwriter and guitarist (d. 1975)\n*1913 – Keiko Fukuda, Japanese-American martial artist (d. 2013)\n*1914 – Armen Alchian, American economist and academic (d. 2013)\n*1916 – Beverly Cleary, American author\n*  1916   – Russell Garcia, American-New Zealand composer and conductor (d. 2011)\n*  1916   – Benjamin Libet, American neuropsychologist and academic (d. 2007)\n*1917 – Helen Forrest, American singer and actress (d. 1999)\n*  1917   – Vinoo Mankad, Indian cricketer (d. 1978)\n*  1917   – Robert Manzon, French racing driver (d. 2015)\n*1919 – István Anhalt, Hungarian-Canadian composer and educator (d. 2012)\n*  1919   – Billy Vaughn, American musician and bandleader (d. 1991)\n*1921 – Robert Cliche, Canadian lawyer, judge, and politician (d. 1978)\n*1922 – Simon Kapwepwe, Zambian politician, 2nd Vice President of Zambia (d. 1980)\n*1923 – Ann Miller, American actress, singer, and dancer (d. 2004)\n*1924 – Raymond Barre, French economist and politician, Prime Minister of France (d. 2007)\n*  1924   – Peter Safar, Austrian physician and academic (d. 2003)\n*  1924   – Curtis Turner, American race car driver (d. 1970)\n*1925 – Evelyn Berezin, American computer scientist and engineer\n*  1925   – Ned Miller, American country music singer and songwriter (d. 2016)\n*  1925   – Oliver Postgate, English animator, puppeteer, and screenwriter (d. 2008)\n*1926 – Jane Withers, American actress \n*1927 – Thomas Hemsley, English baritone (d. 2013)\n*1928 – Hardy Krüger, German actor\n*  1928   – Jean-François Paillard, French conductor (d. 2013)\n*1929 – Elspet Gray, Scottish actress (d. 2013)\n*  1929   – Mukhran Machavariani, Georgian poet and educator (d. 2010)\n*1930 – John Landy, Australian runner and politician, 26th Governor of Victoria\n*  1930   – Bryan Magee, English philosopher and politician\n*  1930   – Manuel Neri, American sculptor and painter\n*  1930   – Michał Życzkowski, Polish technician and educator (d. 2006)\n*1931 – Leonid Derbenyov, Russian poet and songwriter (d. 1995)\n*1932 – Lakshman Kadirgamar, Sri Lankan lawyer and politician, 5th Sri Lankan Minister of Foreign Affairs (d. 2005)\n*  1932   – Jean-Pierre Marielle, French actor\n*  1932   – Tiny Tim, American singer and ukulele player (d. 1996)\n*1933 – Montserrat Caballé, Spanish soprano and actress\n*1934 – Heinz Schneiter, Swiss footballer and manager\n*1936 – Charles Napier, American actor (d. 2011)\n*  1936   – Kennedy Simmonds, Kittitian politician, 4th Prime Minister of Saint Kitts and Nevis\n*1937 – Dennis Banks, American author and activist\n*  1937   – Igor Volk, Ukrainian-Russian colonel, pilot, and astronaut\n*1939 – Alan Ayckbourn, English director and playwright\n*  1939   – Johnny Raper, Australian rugby league player and coach\n*1940 – Woodie Fryman, American baseball player (d. 2011)\n*  1940   – Herbie Hancock, American pianist, composer, and bandleader \n*1941 – Bobby Moore, English footballer and manager (d. 1993)\n*1942 – Bill Bryden, Scottish actor, director, and screenwriter\n*  1942   – Carlos Reutemann, Argentinian race car driver and politician, Governor of Santa Fe\n*  1942   – Jacob Zuma, South African politician, 4th President of South Africa\n*1943 – Sumitra Mahajan, Indian politician, 16th Speaker of the Lok Sabha\n*1944 – Lisa Jardine, English historian, author, and academic (d. 2015)\n*  1944   – John Kay, German-Canadian singer-songwriter, guitarist, and producer\n*1945 – Lee Jong-wook, South Korean physician and diplomat (d. 2006)\n*1946 – Ed O'Neill, American actor and comedian\n*  1946   – George Robertson, Baron Robertson of Port Ellen, Scottish politician and diplomat, 10th Secretary General of NATO\n*1947 – Roy M. Anderson, English epidemiologist, zoologist, and academic\n*  1947   – Martin Brasier, English palaeontologist, biologist, and academic (d. 2014)\n*  1947   – Alex Briley, American disco singer (Village People)\n*  1947   – Tom Clancy, American historian and author (d. 2013)\n*  1947   – Woody Johnson, American businessman and philanthropist\n*  1947   – Dan Lauria, American actor\n*  1947   – David Letterman, American comedian and talk show host\n*1948 – Jeremy Beadle, English television host and producer (d. 2008)\n*  1948   – Joschka Fischer, German academic and politician, Vice Chancellor of Germany\n*  1948   – Marcello Lippi, Italian footballer, manager, and coach\n*1949 – Scott Turow, American lawyer and author\n*1950 – Flavio Briatore, Italian businessman\n*  1950   – David Cassidy, American singer-songwriter and guitarist (d. 2017)\n*  1950   – Joyce Banda, 4th president of Malawi \n*  1950   – Nick Sackman, English composer and educator\n*1951 – Tom Noonan, American actor\n*1952 – Reuben Gant, American football player\n*  1952   – Leicester Rutledge, New Zealand rugby player\n*  1952   – Gary Soto, American poet, novelist, and memoirist\n*  1952   – Ralph Wiley, American journalist (d. 2004)\n*1953 – Tanino Liberatore, Italian author and illustrator\n*1954 – John Faulkner, Australian educator and politician, 52nd Australian Minister for Defence\n*  1954   – Steve Stevaert, Belgian businessman and politician, Governor of Limburg (d. 2015)\n*  1954   – Pat Travers, Canadian singer-songwriter and guitarist\n*1955 – Fabian Hamilton, English graphic designer, engineer, and politician\n*1956 – Andy Garcia, Cuban-American actor, director, and producer\n*  1956   – Herbert Grönemeyer, German singer-songwriter and actor\n*1957 – Greg Child, Australian mountaineer and author\n*  1957   – Vince Gill, American singer-songwriter and guitarist \n*  1957   – Tama Janowitz, American novelist and short story writer\n*1958 – Will Sergeant, English guitarist \n*  1958   – Klaus Tafelmeier, German javelin thrower\n*  1958   – Ginka Zagorcheva, Bulgarian hurdler\n*1959 – Howard Stableford, English radio and television host\n*1961 – Corrado Fabi, Italian race car driver\n*  1961   – Charles Mann, American football player and sportscaster\n*  1961   – Magda Szubanski, English-Australian actress, comedian and writer\n*1962 – Art Alexakis, American singer-songwriter and musician (Everclear)\n*  1962   – Carlos Sainz, Spanish race car driver\n*  1962   – Nobuhiko Takada, Japanese mixed martial artist and wrestler, founded Hustle\n*1963 – Lydia Cacho, Mexican journalist and author\n*1964 – Amy Ray, American folk-rock singer-songwriter, musician, and music producer \n*1965 – Kim Bodnia, Danish actor and director\n*  1965   – Chi Onwurah, English politician\n*  1965   – Gervais Rufyikiri, Burundian politician \n*  1965   – Mihai Stoica, Romanian footballer and manager\n*1966 – Nils-Olav Johansen, Norwegian guitarist and singer \n*  1966   – Lorenzo White, American football player\n*1967 – Sarah Cracknell, English singer-songwriter \n*1968 – Alicia Coppola, American actress\n*  1968   – Toby Gad, German songwriter and producer\n*  1968   – Adam Graves, Canadian ice hockey player\n*1969 – Jörn Lenz, German footballer and manager\n*  1969   – Lucas Radebe, South African footballer and sportscaster\n*  1969   – Michael Jackson, American football player and politician (d. 2017)\n*1970 – Sylvain Bouchard, Canadian speed skater\n*1971 – Nicholas Brendon, American actor \n*  1971   – Shannen Doherty, American actress, director, and producer\n*1972 – Paul Lo Duca, American baseball player and sportscaster\n*1973 – J. Scott Campbell, American author and illustrator\n*  1973   – Ryan Kisor, American trumpet player and composer\n*  1973   – Antonio Osuna, Mexican-American baseball player\n*  1973   – Christian Panucci, Italian footballer and manager\n*1974 – Belinda Emmett, Australian actress (d. 2006)\n*  1974   – Bryan Fletcher, Australian rugby league player and sportscaster\n*  1974   – Roman Hamrlík, Czech ice hockey player\n*  1974   – Marley Shelton, American actress\n*1974 – Sylvinho, Brazilian footballer and manager\n*1976 – Olga Kotlyarova, Russian runner\n*  1976   – Brad Miller, American basketball player\n*1977 – Giovanny Espinoza, Ecuadorian footballer\n*  1977   – Sarah Monahan, Australian actress\n*  1977   – Jason Price, Welsh footballer\n*  1977   – Glenn Rogers, Australian-Scottish cricketer\n*1978 – Guy Berryman, Scottish bass player and producer \n*  1978   – Scott Crary, American director, producer, and screenwriter\n*  1978   – Svetlana Lapina, Russian high jumper\n*  1978   – Robin Walker, English businessman and politician\n*1979 – Claire Danes, American actress \n*  1979   – Elena Grosheva, Russian gymnast\n*  1979   – Mateja Kežman, Serbian footballer\n*  1979   – Jennifer Morrison, American actress \n*  1979   – Cristian Ranalli, Italian footballer\n*  1979   – Lee Soo-young, South Korean singer\n*1980 – Sara Head, Welsh Paralympic table tennis champion\n*  1980   – Brian McFadden, Irish singer-songwriter \n*1981 – Yuriy Borzakovskiy, Russian runner\n*  1981   – Nicolás Burdisso, Argentinian footballer\n*  1981   – Grant Holt, English footballer\n*  1981   – Hisashi Iwakuma, Japanese baseball pitcher\n*1983 – Jelena Dokic, Serbian-Australian tennis player\n*  1983   – Luke Kibet, Kenyan runner\n*1984 – Aleksey Dmitrik, Russian high jumper\n*1985 – Brennan Boesch, American baseball player\n*  1985   – Hitomi Yoshizawa, Japanese singer \n*1986 – Brad Brach, American baseball pitcher  \n*  1986   – Blerim Džemaili, Swiss footballer\n*  1986   – Marcel Granollers, Spanish tennis player\n*  1986   – Jonathan Pitroipa, Burkinabé footballer\n*1987 – Brooklyn Decker, American model and actress\n*  1987   – Shawn Gore, Canadian football player\n*  1987   – Josh McCrone, Australian rugby league player\n*  1987   – Luiz Adriano, Brazilian professional footballer\n*  1987   – Brendon Urie, American singer, songwriter, musician and multi-instrumentalist\n*1988 – Ricardo Gabriel Álvarez, Argentinian footballer\n*  1988   – Stephen Brogan, English footballer\n*  1988   – Amedeo Calliari, Italian footballer\n*  1988   – Jessie James Decker, American singer-songwriter\n*1989 – Bethan Dainton, Welsh rugby union player\n*  1989   – Miguel Ángel Ponce, American-Mexican footballer\n*  1989   – Ádám Hanga, Hungarian basketball player\n*  1989   – Kaitlyn Weaver, Canadian-American ice dancer\n*  1989   – Valentin Stocker, Swiss footballer\n*1990 – Francesca Halsall, English swimmer\n*1990 – Hiroki Sakai, Japanese footballer\n*1991 – Torey Krug, American ice hockey player\n*  1991   – Oliver Norwood, English footballer\n*  1991   – Magnus Pääjärvi, Swedish ice hockey player\n*  1991   – Jazz Richards, Welsh footballer\n*  1991   – Lionel Carole, French professional footballer \n*1992 – Chad le Clos, South African swimmer\n*1993 – Jordan Archer, English-Scottish footballer\n*  1993   – Dorial Green-Beckham, American football player\n*  1993   – Ryan Nugent-Hopkins, Canadian ice hockey player\n*1994 – Isabelle Drummond, Brazilian actress and singer\n*  1994   – Saoirse Ronan, American-born Irish actress\n*  1994   – Oh Sehun, South Korean musician\n*  1994   – Eric Bailly, Ivorian professional footballer\n*  1994   – Guido Rodríguez, Argentine footballer \n*1995 – Brenda Villa, Mexican Lawyer\n*  1995 – Pedro Cachín, Argentine tennis player\n*1996 – Elizaveta Kulichkova, Russian tennis player\n\nDeaths\n\n*45 BC – Gnaeus Pompeius, Roman general and politician (b. 75 BC)\n* 238 – Gordian I, Roman emperor (b. 159)\n*   238   – Gordian II, Roman emperor (b. 192)\n* 352 – Julius I, pope of the Catholic Church\n* 434 – Maximianus, archbishop of Constantinople\n* 901 – Eudokia Baïana, Byzantine empress and wife of Leo VI\n*1125 – Vladislaus I, Duke of Bohemia (b. 1065)\n*1167 – Charles VII, king of Sweden (b. c. 1130)\n*1212 – Vsevolod the Big Nest, Grand Prince of Vladimir (b. 1154)\n*1256 – Margaret of Bourbon, Queen of Navarre, regent of Navarre (b. c. 1217)\n*1443 – Henry Chichele, English archbishop (b. 1364)\n*1500 – Leonhard of Gorizia, Count of Gorz (b. 1440)\n*1530 – Joanna La Beltraneja, Princess of Castile (b. 1462)\n*1550 – Claude, Duke of Guise (b. 1496)\n*1555 – Joanna of Castile (b. 1479)\n*1675 – Richard Bennett, English politician, colonial Governor of Virginia (b. 1609)\n*1684 – Nicola Amati, Italian instrument maker (b. 1596)\n*1687 – Ambrose Dixon, English-American soldier (b. 1619)\n*1704 – Jacques-Bénigne Bossuet, French bishop and theologian (b. 1627)\n*1748 – William Kent, English architect, designed Holkham Hall and Chiswick House (b. 1685)\n*1782 – Metastasio, Italian-Austrian poet and composer (b. 1698)\n*1788 – Carlo Antonio Campioni, French-Italian composer (b. 1719)\n*1795 – Johann Kaspar Basselet von La Rosée, Bavarian general (b. 1710)\n*1814 – Charles Burney, English composer and historian (b. 1726)\n*1817 – Charles Messier, French astronomer and academic (b. 1730)\n*1850 – Adoniram Judson, American lexicographer and missionary (b. 1788)\n*1866 – Peter Hesketh-Fleetwood, English politician, founded Fleetwood (b. 1801)\n*1872 – Nikolaos Mantzaros, Greek composer and theorist (b. 1795)\n*1878 – William M. Tweed, American lawyer and politician (b. 1823)\n*1879 – Richard Taylor, American general (b. 1826)\n*1898 – Elzéar-Alexandre Taschereau, Canadian cardinal (b. 1820)\n*1902 – Marie Alfred Cornu, French physicist and academic (b. 1842)\n*1906 – Mahesh Chandra Nyayratna Bhattacharyya, Indian scholar, academic, and philanthropist (b. 1836)\n*1912 – Clara Barton, American nurse and humanitarian, founded the American Red Cross (b. 1821)\n*1933 – Adelbert Ames, American general and politician, 30th Governor of Mississippi (b. 1835)\n*1937 – Abdülhak Hâmid Tarhan, Turkish playwright and poet (b. 1852)\n*1938 – Feodor Chaliapin, Russian opera singer (b. 1873)\n*1943 – Viktor Puskar, Estonian colonel (b. 1889)\n*1945 – Franklin D. Roosevelt, American lawyer and politician, 32nd President of the United States (b. 1882)\n*1953 – Lionel Logue, Australian actor and therapist (b. 1880)\n*1962 – Ron Flockhart, Scottish race car driver (b. 1923)\n*1966 – Sydney Allard, English racing driver and founder of the Allard car company (b. 1910)\n*1968 – Heinrich Nordhoff, German engineer (b. 1899)\n*1971 – Ed Lafitte, American baseball player and dentist (b. 1886)\n*1973 – Arthur Freed, American songwriter and producer (b. 1894)\n*1975 – Josephine Baker, French actress, activist, and humanitarian (b. 1906)\n*1977 – Philip K. Wrigley, American businessman, co-founded Lincoln Park Gun Club (b. 1894)\n*1980 – William R. Tolbert, Jr., Liberian politician, 20th President of Liberia (b. 1913)\n*1981 – Prince Yasuhiko Asaka of Japan (b. 1887)\n*  1981   – Joe Louis, American boxer and wrestler (b. 1914)\n*1983 – Carl Morton, American baseball player (b. 1944)\n*1984 – Edwin T. Layton, American admiral and cryptanalyst (b. 1903)\n*1986 – Valentin Kataev, Russian author and playwright (b. 1897)\n*1988 – Colette Deréal, French singer and actress (b. 1927)\n*  1988   – Alan Paton, South African historian and author (b. 1903)\n*1989 – Abbie Hoffman, American activist, co-founded Youth International Party (b. 1936)\n*  1989   – Sugar Ray Robinson, American boxer (b. 1921)\n*1992 – Ilario Bandini, Italian race car driver and businessman (b. 1911)\n*1997 – George Wald, American neurologist and academic, Nobel Prize laureate (b. 1906)\n*1998 – Robert Ford, Canadian poet and diplomat (b. 1915)\n*1999 – Boxcar Willie, American singer-songwriter (b. 1931)\n*2001 – Harvey Ball, American illustrator, created the smiley (b. 1921)\n*2002 – George Shevelov, Ukrainian-American linguist and philologist (b. 1908)\n*2004 – Moran Campbell, Canadian physician and academic, invented the venturi mask (b. 1925)\n*2006 – William Sloane Coffin, American minister and activist (b. 1924)\n*2007 – Kevin Crease, Australian journalist (b. 1936)\n*2008 – Cecilia Colledge, English-American figure skater and coach (b. 1920)\n*  2008   – Patrick Hillery, Irish physician and politician, 6th President of Ireland (b. 1923)\n*  2008   – Jerry Zucker, Israeli-American businessman and philanthropist (b. 1949)\n*2010 – Michel Chartrand, Canadian trade union leader (b. 1916)\n*  2010   – Werner Schroeter, German director and screenwriter (b. 1945)\n*2011 – Karim Fakhrawi, Bahraini journalist, co-founded Al-Wasat (b. 1962)\n*2012 – Mohit Chattopadhyay, Indian poet and playwright (b. 1934)\n*  2012   – Rodgers Grant, American pianist and composer (b. 1935)\n*2013 – Robert Byrne, American chess player and author (b. 1928)\n*  2013   – Johnny du Plooy, South African boxer (b. 1964)\n*  2013   – Michael France, American screenwriter (b. 1962)\n*  2013   – Brennan Manning, American priest and author (b. 1934)\n*  2013   – Annamária Szalai, Hungarian journalist and politician (b. 1961)\n*  2013   – William Y. Thompson, American historian and author (b. 1922)\n*  2013   – Ya'akov Yosef, Israeli rabbi and politician (b. 1946)\n*2014 – Pierre Autin-Grenier, French author and poet (b. 1947)\n*  2014   – Pierre-Henri Menthéour, French cyclist (b. 1960)\n*  2014   – Maurício Alves Peruchi, Brazilian footballer (b. 1990)\n*  2014   – Hal Smith, American baseball player and coach (b. 1931)\n*  2014   – Billy Standridge, American race car driver (b. 1953)\n*2015 – Paulo Brossard, Brazilian jurist and politician (b. 1924)\n*  2015   – Patrice Dominguez, Algerian-French tennis player and trainer (b. 1950)\n*  2015   – Alfred Eick, German commander (b. 1916)\n*  2015   – André Mba Obame, Gabonese politician (b. 1957)\n*2016 – Anne Jackson, American actress (b. 1925)\n*2016 – Mohammad Al Gaz Emirati politician & diplomat (b. 1930) \n*2017 – Charlie Murphy, American actor and comedian (b. 1959)\n\nHolidays and observances\n\n* Children's Day (Bolivia)\n* Christian feast day:\n** Adoniram Judson (Episcopal Church)\n** Alferius\n** Blessed Angelo Carletti di Chivasso\n** Erkembode\n** Pope Julius I\n** Zeno of Verona\n** April 12 (Eastern Orthodox liturgics)\n* Commemoration of first human in space by Yuri Gagarin:\n** Cosmonautics Day (Russia)\n** International Day of Human Space Flight \n** Yuri's Night (International observance)\n* Halifax Day (North Carolina)\n* National Redemption Day (Liberia)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "April 12" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1009" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 238 – Gordian II loses the Battle of Carthage against the Numidian forces loyal to Maximinus Thrax and is killed. Gordian I, his father, commits suicide.\n* 240 – Shapur I becomes co-emperor of the Sasanian Empire with his father Ardashir I.\n* 467 – Anthemius is elevated to Emperor of the Western Roman Empire.\n* 627 – King Edwin of Northumbria is converted to Christianity by Paulinus, bishop of York.\n*1167 – King Karl Sverkersson of Sweden is murdered on Visingsö.\n*1204 – The Crusaders of the Fourth Crusade breach the walls of Constantinople and enter the city, which they completely occupy the following day.\n*1606 – The Union Flag is adopted as the flag of English and Scottish ships.\n*1776 – American Revolution: With the Halifax Resolves, the North Carolina Provincial Congress authorizes its Congressional delegation to vote for independence from Britain.\n*1807 – The Froberg mutiny ends when the remaining mutineers blow up the magazine of Fort Ricasoli.\n*1820 – Alexander Ypsilantis is declared leader of Filiki Eteria, a secret organization to overthrow Ottoman rule over Greece.\n*1831 – Soldiers marching on the Broughton Suspension Bridge in Manchester, England cause it to collapse.\n*1861 – American Civil War: Battle of Fort Sumter. The war begins with Confederate forces firing on Fort Sumter, in the harbor of Charleston, South Carolina.\n*1862 – American Civil War: The Andrews Raid (the Great Locomotive Chase) occurs, starting from Big Shanty, Georgia (now Kennesaw).\n*1864 – American Civil War: The Battle of Fort Pillow: Confederate forces kill most of the African American soldiers that surrendered at Fort Pillow, Tennessee.\n*1865 – American Civil War: Mobile, Alabama, falls to the Union Army.\n*1877 – The United Kingdom annexes the Transvaal.\n*1910 – , one of the last pre-dreadnought battleships built by the Austro-Hungarian Navy, is launched.\n*1917 – World War I: Canadian forces successfully complete the taking of Vimy Ridge from the Germans.\n*1927 – Shanghai massacre of 1927: Chiang Kai-shek orders the Communist Party of China members executed in Shanghai, ending the First United Front.\n*  1927   – Rocksprings, Texas was hit by an F5 tornado that destroyed 235 of the 247 buildings in the town and killed 72 townspeople and injured 205; third deadliest tornado in Texas history.\n*1928 – The Bremen, a German Junkers W 33 type aircraft, takes off for the first successful transatlantic aeroplane flight from east to west.\n*1934 – The strongest surface wind gust in the world at the time of 231 mph, is measured on the summit of Mount Washington, New Hampshire.  It has since been surpassed.\n*  1934   – The U.S. Auto-Lite strike begins, culminating in a five-day melee between Ohio National Guard troops and 6,000 strikers and picketers.\n*1937 – Sir Frank Whittle ground-tests the first jet engine designed to power an aircraft, at Rugby, England.\n*1945 – U.S. President Franklin D. Roosevelt dies in office; Vice President Harry S. Truman becomes President upon Roosevelt's death.\n*  1945   – The U.S. Ninth Army under General William H. Simpson crosses the Elbe River astride Magdeburg, and reached Tangermünde—only 50 miles from Berlin.\n*1955 – The polio vaccine, developed by Dr. Jonas Salk, is declared safe and effective.\n*1961 – The Soviet cosmonaut Yuri Gagarin becomes the first human to travel into outer space and perform the first manned orbital flight, Vostok 1.\n*1963 – The Soviet nuclear-powered submarine K-33 collides with the Finnish merchant vessel M/S Finnclipper in the Danish straits.\n*1970 – Soviet submarine K-8, carrying four nuclear torpedoes, sinks in the Bay of Biscay four days after a fire on board.\n*1980 – Samuel Doe takes control of Liberia in a coup d'état, ending over 130 years of minority Americo-Liberian rule over the country.\n*1981 – The first launch of a Space Shuttle (Columbia) takes place: The STS-1 mission.\n*1990 – Jim Gary's \"Twentieth Century Dinosaurs\" exhibition opens at the Smithsonian Institution National Museum of Natural History in Washington, D.C. He is the only sculptor ever invited to present a solo exhibition there. \n*1992 – The Euro Disney Resort officially opens with its theme park Euro Disneyland; the resort and its park's name are subsequently changed to Disneyland Paris.\n*1999 – United States President Bill Clinton is cited for contempt of court for giving \"intentionally false statements\" in a civil lawsuit; he is later fined and disbarred.\n*2002 – A suicide bomber blows herself up at the entrance to Jerusalem's Mahane Yehuda Market, killing seven people and wounding 104.\n*2007 – A suicide bomber penetrates the Green Zone and detonates in a cafeteria within a parliament building, killing Iraqi MP Mohammed Awad and wounding more than twenty other people.\n*2009 – Zimbabwe officially abandons the Zimbabwean dollar as its official currency.\n*2013 – Two suicide bombers kill three Chadian soldiers and injure dozens of civilians at a market in Kidal, Mali.\n*2014 – The Great Fire of Valparaíso ravages the Chilean city of Valparaíso, killing 16, displacing nearly 10,000, and destroying over 2,000 homes.\n*2017 – Zuma Must Fall protests resume in South Africa, with Julius Malema addressing large crowds in Pretoria.[http://weeklyxpose.co.za/2017/04/12/opposition-parties-take-their-grievance/ Weekly Xpose South Africa]\n\nBirths\n\n* 959 – En'yū, emperor of Japan (d. 991)\n*1116 – Richeza of Poland, queen of Sweden and Grand Princess of Minsk (d. 1156)\n*1432 – Anne of Austria, Landgravine of Thuringia (d. 1462)\n*1484 – Antonio da Sangallo the Younger, Italian architect, designed the Apostolic Palace and St. Peter's Basilica (d. 1546)\n*  1484   – Maharana Sangram Singh, Rana of Mewar (d. 1527)\n*1500 – Joachim Camerarius, German scholar and translator (d. 1574)\n*1526 – Muretus, French philosopher and author (d. 1585)\n*1550 – Edward de Vere, 17th Earl of Oxford, English courtier and politician, Lord Great Chamberlain (d. 1604)\n*1577 – Christian IV of Denmark (d. 1648)\n*1612 – Simone Cantarini, Italian painter and engraver (d. 1648)\n*1639 – Martin Lister, English naturalist and physician (d. 1712)\n*1656 – Benoît de Maillet, French diplomat and natural historian (d. 1738)\n*1705 – William Cookworthy, English minister and pharmacist (d. 1780)\n*1710 – Caffarelli, Italian actor and singer (d. 1783)\n*1713 – Guillaume Thomas François Raynal, French historian and author (d. 1796)\n*1716 – Felice Giardini, Italian violinist and composer (d. 1796)\n*1722 – Pietro Nardini, Italian violinist and composer (d. 1793)\n*1724 – Lyman Hall, American physician, clergyman, and politician, 16th Governor of Georgia (d. 1790)\n*1748 – Antoine Laurent de Jussieu, French botanist and author (d. 1836)\n*1777 – Henry Clay, American lawyer and politician, 9th United States Secretary of State (d. 1852)\n*1792 – John Lambton, 1st Earl of Durham, English soldier and politician, Lord Privy Seal (d. 1840)\n*1794 – Germinal Pierre Dandelin, Belgian mathematician and engineer (d. 1847)\n*1796 – George N. Briggs, American lawyer and politician, 19th Governor of Massachusetts (d. 1861)\n*1799 – Henri Druey, Swiss lawyer and politician, 2nd President of the Swiss Confederation (d. 1855)\n*1801 – Joseph Lanner, Austrian composer and conductor (d. 1843)\n*1816 – Charles Gavan Duffy, Irish-Australian politician, 8th Premier of Victoria (d. 1903)\n*1823 – Alexander Ostrovsky, Russian playwright and translator (d. 1886)\n*1839 – Nikolay Przhevalsky, Russian geographer and explorer (d. 1888)\n*1845 – Gustaf Cederström, Swedish painter (d. 1933)\n*1848 – José Gautier Benítez, Puerto Rican soldier and poet (d. 1880)\n*1851 – Edward Walter Maunder, English astronomer and author (d. 1928)\n*1852 – Ferdinand von Lindemann, German mathematician and academic (d. 1939)\n*1856 – Martin Conway, 1st Baron Conway of Allington, English mountaineer, cartographer, and politician (d. 1937)\n*1863 – Raul Pompeia, Brazilian writer (d. 1895)\n*1868 – Akiyama Saneyuki, Japanese admiral (d. 1918)\n*1869 – Henri Désiré Landru, French serial killer (d. 1922) \n*1871 – Ioannis Metaxas, Greek general and politician, 130th Prime Minister of Greece (d. 1941)\n*1874 – William B. Bankhead, American lawyer and politician, 47th Speaker of the United States House of Representatives (d. 1940)\n*1880 – Addie Joss, American baseball player and journalist (d. 1911)\n*1883 – Imogen Cunningham, American photographer and educator (d. 1976)\n*1883 – Dally Messenger, Australian rugby player, cricketer, and sailor (d. 1959)\n*1884 – Tenby Davies, Welsh runner (d. 1932)\n*  1884   – Otto Meyerhof, German physician and biochemist, Nobel Prize laureate (d. 1951)\n*1885 – Robert Delaunay, French painter (d. 1941)\n*1887 – Harold Lockwood, American actor and director (d. 1918)\n*1888 – Dan Ahearn, Irish-American long jumper and police officer (d. 1942)\n*  1888   – Cecil Kimber, English automobile engineer (d. 1945)\n*1892 – Henry Darger, American writer and artist (d. 1973)\n*1894 – Dorothy Cumming, Australian-American actress (d. 1983)\n*  1894   – Francisco Craveiro Lopes, Portuguese field marshal and politician, 13th President of Portugal (d. 1964)\n*1898 – Lily Pons, French-American soprano and actress (d. 1976)\n*1901 – Lowell Stockman, American farmer and politician (d. 1962)\n*1902 – Louis Beel, Dutch academic and politician, 36th Prime Minister of the Netherlands (d. 1977)\n*1903 – Jan Tinbergen, Dutch economist and academic, Nobel Prize laureate (d. 1994)\n*1907 – Zawgyi, Burmese poet, author, literary historian, critic, scholar and academic (d. 1990)\n*  1907   – Felix de Weldon, Austrian-American sculptor, designed the Marine Corps War Memorial (d. 2003)\n*1908 – Ida Pollock, English author and painter (d. 2013)\n*  1908   – Robert Lee Scott, Jr., American pilot and general (d. 2006)\n*1910 – Gillo Dorfles, Italian art critic, painter and philosopher\n*  1910 – Irma Rapuzzi, French politician\n*1911 – Mahmoud Younis, Egyptian engineer (d. 1976)\n*1912 – Frank Dilio, Canadian businessman (d. 1997)\n*  1912   – Hamengkubuwono IX, Indonesian politician, 2nd Vice President of Indonesia (d. 1988)\n*  1912   – Hound Dog Taylor, American singer-songwriter and guitarist (d. 1975)\n*1913 – Keiko Fukuda, Japanese-American martial artist (d. 2013)\n*1914 – Armen Alchian, American economist and academic (d. 2013)\n*1916 – Beverly Cleary, American author\n*  1916   – Russell Garcia, American-New Zealand composer and conductor (d. 2011)\n*  1916   – Benjamin Libet, American neuropsychologist and academic (d. 2007)\n*1917 – Helen Forrest, American singer and actress (d. 1999)\n*  1917   – Vinoo Mankad, Indian cricketer (d. 1978)\n*  1917   – Robert Manzon, French racing driver (d. 2015)\n*1919 – István Anhalt, Hungarian-Canadian composer and educator (d. 2012)\n*  1919   – Billy Vaughn, American musician and bandleader (d. 1991)\n*1921 – Robert Cliche, Canadian lawyer, judge, and politician (d. 1978)\n*1922 – Simon Kapwepwe, Zambian politician, 2nd Vice President of Zambia (d. 1980)\n*1923 – Ann Miller, American actress, singer, and dancer (d. 2004)\n*1924 – Raymond Barre, French economist and politician, Prime Minister of France (d. 2007)\n*  1924   – Peter Safar, Austrian physician and academic (d. 2003)\n*  1924   – Curtis Turner, American race car driver (d. 1970)\n*1925 – Evelyn Berezin, American computer scientist and engineer\n*  1925   – Ned Miller, American country music singer and songwriter (d. 2016)\n*  1925   – Oliver Postgate, English animator, puppeteer, and screenwriter (d. 2008)\n*1926 – Jane Withers, American actress \n*1927 – Thomas Hemsley, English baritone (d. 2013)\n*1928 – Hardy Krüger, German actor\n*  1928   – Jean-François Paillard, French conductor (d. 2013)\n*1929 – Elspet Gray, Scottish actress (d. 2013)\n*  1929   – Mukhran Machavariani, Georgian poet and educator (d. 2010)\n*1930 – John Landy, Australian runner and politician, 26th Governor of Victoria\n*  1930   – Bryan Magee, English philosopher and politician\n*  1930   – Manuel Neri, American sculptor and painter\n*  1930   – Michał Życzkowski, Polish technician and educator (d. 2006)\n*1931 – Leonid Derbenyov, Russian poet and songwriter (d. 1995)\n*1932 – Lakshman Kadirgamar, Sri Lankan lawyer and politician, 5th Sri Lankan Minister of Foreign Affairs (d. 2005)\n*  1932   – Jean-Pierre Marielle, French actor\n*  1932   – Tiny Tim, American singer and ukulele player (d. 1996)\n*1933 – Montserrat Caballé, Spanish soprano and actress\n*1934 – Heinz Schneiter, Swiss footballer and manager\n*1936 – Charles Napier, American actor (d. 2011)\n*  1936   – Kennedy Simmonds, Kittitian politician, 4th Prime Minister of Saint Kitts and Nevis\n*1937 – Dennis Banks, American author and activist\n*  1937   – Igor Volk, Ukrainian-Russian colonel, pilot, and astronaut\n*1939 – Alan Ayckbourn, English director and playwright\n*  1939   – Johnny Raper, Australian rugby league player and coach\n*1940 – Woodie Fryman, American baseball player (d. 2011)\n*  1940   – Herbie Hancock, American pianist, composer, and bandleader \n*1941 – Bobby Moore, English footballer and manager (d. 1993)\n*1942 – Bill Bryden, Scottish actor, director, and screenwriter\n*  1942   – Carlos Reutemann, Argentinian race car driver and politician, Governor of Santa Fe\n*  1942   – Jacob Zuma, South African politician, 4th President of South Africa\n*1943 – Sumitra Mahajan, Indian politician, 16th Speaker of the Lok Sabha\n*1944 – Lisa Jardine, English historian, author, and academic (d. 2015)\n*  1944   – John Kay, German-Canadian singer-songwriter, guitarist, and producer\n*1945 – Lee Jong-wook, South Korean physician and diplomat (d. 2006)\n*1946 – Ed O'Neill, American actor and comedian\n*  1946   – George Robertson, Baron Robertson of Port Ellen, Scottish politician and diplomat, 10th Secretary General of NATO\n*1947 – Roy M. Anderson, English epidemiologist, zoologist, and academic\n*  1947   – Martin Brasier, English palaeontologist, biologist, and academic (d. 2014)\n*  1947   – Alex Briley, American disco singer (Village People)\n*  1947   – Tom Clancy, American historian and author (d. 2013)\n*  1947   – Woody Johnson, American businessman and philanthropist\n*  1947   – Dan Lauria, American actor\n*  1947   – David Letterman, American comedian and talk show host\n*1948 – Jeremy Beadle, English television host and producer (d. 2008)\n*  1948   – Joschka Fischer, German academic and politician, Vice Chancellor of Germany\n*  1948   – Marcello Lippi, Italian footballer, manager, and coach\n*1949 – Scott Turow, American lawyer and author\n*1950 – Flavio Briatore, Italian businessman\n*  1950   – David Cassidy, American singer-songwriter and guitarist (d. 2017)\n*  1950   – Joyce Banda, 4th president of Malawi \n*  1950   – Nick Sackman, English composer and educator\n*1951 – Tom Noonan, American actor\n*1952 – Reuben Gant, American football player\n*  1952   – Leicester Rutledge, New Zealand rugby player\n*  1952   – Gary Soto, American poet, novelist, and memoirist\n*  1952   – Ralph Wiley, American journalist (d. 2004)\n*1953 – Tanino Liberatore, Italian author and illustrator\n*1954 – John Faulkner, Australian educator and politician, 52nd Australian Minister for Defence\n*  1954   – Steve Stevaert, Belgian businessman and politician, Governor of Limburg (d. 2015)\n*  1954   – Pat Travers, Canadian singer-songwriter and guitarist\n*1955 – Fabian Hamilton, English graphic designer, engineer, and politician\n*1956 – Andy Garcia, Cuban-American actor, director, and producer\n*  1956   – Herbert Grönemeyer, German singer-songwriter and actor\n*1957 – Greg Child, Australian mountaineer and author\n*  1957   – Vince Gill, American singer-songwriter and guitarist \n*  1957   – Tama Janowitz, American novelist and short story writer\n*1958 – Will Sergeant, English guitarist \n*  1958   – Klaus Tafelmeier, German javelin thrower\n*  1958   – Ginka Zagorcheva, Bulgarian hurdler\n*1959 – Howard Stableford, English radio and television host\n*1961 – Corrado Fabi, Italian race car driver\n*  1961   – Charles Mann, American football player and sportscaster\n*  1961   – Magda Szubanski, English-Australian actress, comedian and writer\n*1962 – Art Alexakis, American singer-songwriter and musician (Everclear)\n*  1962   – Carlos Sainz, Spanish race car driver\n*  1962   – Nobuhiko Takada, Japanese mixed martial artist and wrestler, founded Hustle\n*1963 – Lydia Cacho, Mexican journalist and author\n*1964 – Amy Ray, American folk-rock singer-songwriter, musician, and music producer \n*1965 – Kim Bodnia, Danish actor and director\n*  1965   – Chi Onwurah, English politician\n*  1965   – Gervais Rufyikiri, Burundian politician \n*  1965   – Mihai Stoica, Romanian footballer and manager\n*1966 – Nils-Olav Johansen, Norwegian guitarist and singer \n*  1966   – Lorenzo White, American football player\n*1967 – Sarah Cracknell, English singer-songwriter \n*1968 – Alicia Coppola, American actress\n*  1968   – Toby Gad, German songwriter and producer\n*  1968   – Adam Graves, Canadian ice hockey player\n*1969 – Jörn Lenz, German footballer and manager\n*  1969   – Lucas Radebe, South African footballer and sportscaster\n*  1969   – Michael Jackson, American football player and politician (d. 2017)\n*1970 – Sylvain Bouchard, Canadian speed skater\n*1971 – Nicholas Brendon, American actor \n*  1971   – Shannen Doherty, American actress, director, and producer\n*1972 – Paul Lo Duca, American baseball player and sportscaster\n*1973 – J. Scott Campbell, American author and illustrator\n*  1973   – Ryan Kisor, American trumpet player and composer\n*  1973   – Antonio Osuna, Mexican-American baseball player\n*  1973   – Christian Panucci, Italian footballer and manager\n*1974 – Belinda Emmett, Australian actress (d. 2006)\n*  1974   – Bryan Fletcher, Australian rugby league player and sportscaster\n*  1974   – Roman Hamrlík, Czech ice hockey player\n*  1974   – Marley Shelton, American actress\n*1974 – Sylvinho, Brazilian footballer and manager\n*1976 – Olga Kotlyarova, Russian runner\n*  1976   – Brad Miller, American basketball player\n*1977 – Giovanny Espinoza, Ecuadorian footballer\n*  1977   – Sarah Monahan, Australian actress\n*  1977   – Jason Price, Welsh footballer\n*  1977   – Glenn Rogers, Australian-Scottish cricketer\n*1978 – Guy Berryman, Scottish bass player and producer \n*  1978   – Scott Crary, American director, producer, and screenwriter\n*  1978   – Svetlana Lapina, Russian high jumper\n*  1978   – Robin Walker, English businessman and politician\n*1979 – Claire Danes, American actress \n*  1979   – Elena Grosheva, Russian gymnast\n*  1979   – Mateja Kežman, Serbian footballer\n*  1979   – Jennifer Morrison, American actress \n*  1979   – Cristian Ranalli, Italian footballer\n*  1979   – Lee Soo-young, South Korean singer\n*1980 – Sara Head, Welsh Paralympic table tennis champion\n*  1980   – Brian McFadden, Irish singer-songwriter \n*1981 – Yuriy Borzakovskiy, Russian runner\n*  1981   – Nicolás Burdisso, Argentinian footballer\n*  1981   – Grant Holt, English footballer\n*  1981   – Hisashi Iwakuma, Japanese baseball pitcher\n*1983 – Jelena Dokic, Serbian-Australian tennis player\n*  1983   – Luke Kibet, Kenyan runner\n*1984 – Aleksey Dmitrik, Russian high jumper\n*1985 – Brennan Boesch, American baseball player\n*  1985   – Hitomi Yoshizawa, Japanese singer \n*1986 – Brad Brach, American baseball pitcher  \n*  1986   – Blerim Džemaili, Swiss footballer\n*  1986   – Marcel Granollers, Spanish tennis player\n*  1986   – Jonathan Pitroipa, Burkinabé footballer\n*1987 – Brooklyn Decker, American model and actress\n*  1987   – Shawn Gore, Canadian football player\n*  1987   – Josh McCrone, Australian rugby league player\n*  1987   – Luiz Adriano, Brazilian professional footballer\n*  1987   – Brendon Urie, American singer, songwriter, musician and multi-instrumentalist\n*1988 – Ricardo Gabriel Álvarez, Argentinian footballer\n*  1988   – Stephen Brogan, English footballer\n*  1988   – Amedeo Calliari, Italian footballer\n*  1988   – Jessie James Decker, American singer-songwriter\n*1989 – Bethan Dainton, Welsh rugby union player\n*  1989   – Miguel Ángel Ponce, American-Mexican footballer\n*  1989   – Ádám Hanga, Hungarian basketball player\n*  1989   – Kaitlyn Weaver, Canadian-American ice dancer\n*  1989   – Valentin Stocker, Swiss footballer\n*1990 – Francesca Halsall, English swimmer\n*1990 – Hiroki Sakai, Japanese footballer\n*1991 – Torey Krug, American ice hockey player\n*  1991   – Oliver Norwood, English footballer\n*  1991   – Magnus Pääjärvi, Swedish ice hockey player\n*  1991   – Jazz Richards, Welsh footballer\n*  1991   – Lionel Carole, French professional footballer \n*1992 – Chad le Clos, South African swimmer\n*1993 – Jordan Archer, English-Scottish footballer\n*  1993   – Dorial Green-Beckham, American football player\n*  1993   – Ryan Nugent-Hopkins, Canadian ice hockey player\n*1994 – Isabelle Drummond, Brazilian actress and singer\n*  1994   – Saoirse Ronan, American-born Irish actress\n*  1994   – Oh Sehun, South Korean musician\n*  1994   – Eric Bailly, Ivorian professional footballer\n*  1994   – Guido Rodríguez, Argentine footballer \n*1995 – Brenda Villa, Mexican Lawyer\n*  1995 – Pedro Cachín, Argentine tennis player\n*1996 – Elizaveta Kulichkova, Russian tennis player\n\nDeaths\n\n*45 BC – Gnaeus Pompeius, Roman general and politician (b. 75 BC)\n* 238 – Gordian I, Roman emperor (b. 159)\n*   238   – Gordian II, Roman emperor (b. 192)\n* 352 – Julius I, pope of the Catholic Church\n* 434 – Maximianus, archbishop of Constantinople\n* 901 – Eudokia Baïana, Byzantine empress and wife of Leo VI\n*1125 – Vladislaus I, Duke of Bohemia (b. 1065)\n*1167 – Charles VII, king of Sweden (b. c. 1130)\n*1212 – Vsevolod the Big Nest, Grand Prince of Vladimir (b. 1154)\n*1256 – Margaret of Bourbon, Queen of Navarre, regent of Navarre (b. c. 1217)\n*1443 – Henry Chichele, English archbishop (b. 1364)\n*1500 – Leonhard of Gorizia, Count of Gorz (b. 1440)\n*1530 – Joanna La Beltraneja, Princess of Castile (b. 1462)\n*1550 – Claude, Duke of Guise (b. 1496)\n*1555 – Joanna of Castile (b. 1479)\n*1675 – Richard Bennett, English politician, colonial Governor of Virginia (b. 1609)\n*1684 – Nicola Amati, Italian instrument maker (b. 1596)\n*1687 – Ambrose Dixon, English-American soldier (b. 1619)\n*1704 – Jacques-Bénigne Bossuet, French bishop and theologian (b. 1627)\n*1748 – William Kent, English architect, designed Holkham Hall and Chiswick House (b. 1685)\n*1782 – Metastasio, Italian-Austrian poet and composer (b. 1698)\n*1788 – Carlo Antonio Campioni, French-Italian composer (b. 1719)\n*1795 – Johann Kaspar Basselet von La Rosée, Bavarian general (b. 1710)\n*1814 – Charles Burney, English composer and historian (b. 1726)\n*1817 – Charles Messier, French astronomer and academic (b. 1730)\n*1850 – Adoniram Judson, American lexicographer and missionary (b. 1788)\n*1866 – Peter Hesketh-Fleetwood, English politician, founded Fleetwood (b. 1801)\n*1872 – Nikolaos Mantzaros, Greek composer and theorist (b. 1795)\n*1878 – William M. Tweed, American lawyer and politician (b. 1823)\n*1879 – Richard Taylor, American general (b. 1826)\n*1898 – Elzéar-Alexandre Taschereau, Canadian cardinal (b. 1820)\n*1902 – Marie Alfred Cornu, French physicist and academic (b. 1842)\n*1906 – Mahesh Chandra Nyayratna Bhattacharyya, Indian scholar, academic, and philanthropist (b. 1836)\n*1912 – Clara Barton, American nurse and humanitarian, founded the American Red Cross (b. 1821)\n*1933 – Adelbert Ames, American general and politician, 30th Governor of Mississippi (b. 1835)\n*1937 – Abdülhak Hâmid Tarhan, Turkish playwright and poet (b. 1852)\n*1938 – Feodor Chaliapin, Russian opera singer (b. 1873)\n*1943 – Viktor Puskar, Estonian colonel (b. 1889)\n*1945 – Franklin D. Roosevelt, American lawyer and politician, 32nd President of the United States (b. 1882)\n*1953 – Lionel Logue, Australian actor and therapist (b. 1880)\n*1962 – Ron Flockhart, Scottish race car driver (b. 1923)\n*1966 – Sydney Allard, English racing driver and founder of the Allard car company (b. 1910)\n*1968 – Heinrich Nordhoff, German engineer (b. 1899)\n*1971 – Ed Lafitte, American baseball player and dentist (b. 1886)\n*1973 – Arthur Freed, American songwriter and producer (b. 1894)\n*1975 – Josephine Baker, French actress, activist, and humanitarian (b. 1906)\n*1977 – Philip K. Wrigley, American businessman, co-founded Lincoln Park Gun Club (b. 1894)\n*1980 – William R. Tolbert, Jr., Liberian politician, 20th President of Liberia (b. 1913)\n*1981 – Prince Yasuhiko Asaka of Japan (b. 1887)\n*  1981   – Joe Louis, American boxer and wrestler (b. 1914)\n*1983 – Carl Morton, American baseball player (b. 1944)\n*1984 – Edwin T. Layton, American admiral and cryptanalyst (b. 1903)\n*1986 – Valentin Kataev, Russian author and playwright (b. 1897)\n*1988 – Colette Deréal, French singer and actress (b. 1927)\n*  1988   – Alan Paton, South African historian and author (b. 1903)\n*1989 – Abbie Hoffman, American activist, co-founded Youth International Party (b. 1936)\n*  1989   – Sugar Ray Robinson, American boxer (b. 1921)\n*1992 – Ilario Bandini, Italian race car driver and businessman (b. 1911)\n*1997 – George Wald, American neurologist and academic, Nobel Prize laureate (b. 1906)\n*1998 – Robert Ford, Canadian poet and diplomat (b. 1915)\n*1999 – Boxcar Willie, American singer-songwriter (b. 1931)\n*2001 – Harvey Ball, American illustrator, created the smiley (b. 1921)\n*2002 – George Shevelov, Ukrainian-American linguist and philologist (b. 1908)\n*2004 – Moran Campbell, Canadian physician and academic, invented the venturi mask (b. 1925)\n*2006 – William Sloane Coffin, American minister and activist (b. 1924)\n*2007 – Kevin Crease, Australian journalist (b. 1936)\n*2008 – Cecilia Colledge, English-American figure skater and coach (b. 1920)\n*  2008   – Patrick Hillery, Irish physician and politician, 6th President of Ireland (b. 1923)\n*  2008   – Jerry Zucker, Israeli-American businessman and philanthropist (b. 1949)\n*2010 – Michel Chartrand, Canadian trade union leader (b. 1916)\n*  2010   – Werner Schroeter, German director and screenwriter (b. 1945)\n*2011 – Karim Fakhrawi, Bahraini journalist, co-founded Al-Wasat (b. 1962)\n*2012 – Mohit Chattopadhyay, Indian poet and playwright (b. 1934)\n*  2012   – Rodgers Grant, American pianist and composer (b. 1935)\n*2013 – Robert Byrne, American chess player and author (b. 1928)\n*  2013   – Johnny du Plooy, South African boxer (b. 1964)\n*  2013   – Michael France, American screenwriter (b. 1962)\n*  2013   – Brennan Manning, American priest and author (b. 1934)\n*  2013   – Annamária Szalai, Hungarian journalist and politician (b. 1961)\n*  2013   – William Y. Thompson, American historian and author (b. 1922)\n*  2013   – Ya'akov Yosef, Israeli rabbi and politician (b. 1946)\n*2014 – Pierre Autin-Grenier, French author and poet (b. 1947)\n*  2014   – Pierre-Henri Menthéour, French cyclist (b. 1960)\n*  2014   – Maurício Alves Peruchi, Brazilian footballer (b. 1990)\n*  2014   – Hal Smith, American baseball player and coach (b. 1931)\n*  2014   – Billy Standridge, American race car driver (b. 1953)\n*2015 – Paulo Brossard, Brazilian jurist and politician (b. 1924)\n*  2015   – Patrice Dominguez, Algerian-French tennis player and trainer (b. 1950)\n*  2015   – Alfred Eick, German commander (b. 1916)\n*  2015   – André Mba Obame, Gabonese politician (b. 1957)\n*2016 – Anne Jackson, American actress (b. 1925)\n*2016 – Mohammad Al Gaz Emirati politician & diplomat (b. 1930) \n*2017 – Charlie Murphy, American actor and comedian (b. 1959)\n\nHolidays and observances\n\n* Children's Day (Bolivia)\n* Christian feast day:\n** Adoniram Judson (Episcopal Church)\n** Alferius\n** Blessed Angelo Carletti di Chivasso\n** Erkembode\n** Pope Julius I\n** Zeno of Verona\n** April 12 (Eastern Orthodox liturgics)\n* Commemoration of first human in space by Yuri Gagarin:\n** Cosmonautics Day (Russia)\n** International Day of Human Space Flight \n** Yuri's Night (International observance)\n* Halifax Day (North Carolina)\n* National Redemption Day (Liberia). April 12. http://en.wikipedia.org/?curid=1009."
  }
}
