{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5052",
  "eid" : "d23c5b20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778432466,
  "textBody" : "Bentley Motors Limited is a British manufacturer and marketer of luxury cars and SUVs—and a subsidiary of Volkswagen AG since 1998.\n\nHeadquartered in Crewe, England, the company was founded as Bentley Motors Limited by W. O. Bentley in 1919 in Cricklewood, North London—and became widely known for winning the 24 Hours of Le Mans in 1924, 1927, 1928, 1929, 1930, and 2003.\n\nProminent models extend from the historic sports-racing Bentley 4½ Litre and Bentley Speed Six; the more recent Bentley R Type Continental, Bentley Turbo R, and Bentley Arnage; to its current model line—including the Continental Flying Spur, Continental GT, Bentley Bentayga and the Mulsanne—which are marketed worldwide, with China as its largest market as of November 2012.\n\nToday most Bentleys are assembled at the company's Crewe factory, with a small number assembled at Volkswagen's Dresden factory, Germany, and with bodies for the Continental manufactured in Zwickau and for the Bentayga manufactured at the Volkswagen Bratislava Plant.\n\nThe joining and eventual separation of Bentley and Rolls-Royce followed a series of mergers and acquisitions, beginning with the 1931 purchase by Rolls-Royce of Bentley, then in receivership. In 1971, Rolls-Royce itself was forced into receivership and the UK government nationalised the company—splitting into two companies the aerospace division (Rolls-Royce Plc) and automotive (Rolls-Royce Motors Limited) divisions—the latter retaining the Bentley subdivision. Rolls-Royce Motors was subsequently sold to engineering conglomerate, Vickers and in 1998, Vickers sold Rolls-Royce to Volkswagen AG.\n\nIntellectual property rights to both the name Rolls-Royce as well as the company's logo had been retained not by Rolls-Royce Motors, but by aerospace company, Rolls-Royce Plc, which had continued to license both to the automotive division.  Thus the sale of \"Rolls-Royce\" to VW included the Bentley name and logos, vehicle designs, model nameplates, production and administrative facilities, the Spirit of Ecstasy and Rolls-Royce grille shape trademarks (subsequently sold to BMW by VW)—but not the rights to the Rolls-Royce name or logo.  The aerospace company, Rolls-Royce Plc, ultimately sold both to BMW AG.\n\nCricklewood (1919-1931)\n\nBefore World War I,  Walter Owen Bentley and his brother, Horace Millner Bentley, sold French DFP cars in Cricklewood, North London, but W.O, as Walter was known, always wanted to design and build his own cars. At the DFP factory, in 1913, he noticed an aluminium paperweight and thought that aluminium might be a suitable replacement for cast iron to fabricate lighter pistons. The first Bentley aluminium pistons were fitted to Sopwith Camel aero engines during World War I.\n\nIn August 1919, W.O. registered Bentley Motors Ltd. and in October he exhibited a car chassis, with dummy engine, at the London Motor Show.  Ex–Royal Flying Corps officer Clive Gallop designed an innovative four valves per cylinder engine for the chassis. By December the engine was built and running. Delivery of the first cars was scheduled for June 1920, but development took longer than estimated so the date was extended to September 1921. The durability of the first Bentley cars earned widespread acclaim and they competed in hill climbs and raced at Brooklands.\n\nBentley's first major event was the 1922 Indianapolis 500, a race dominated by specialized cars with Duesenberg racing chassis. They entered a modified road car driven by works driver, Douglas Hawkes, accompanied by riding mechanic, H. S. \"Bertie\" Browning. Hawkes completed the full 500 mi and finished 13th with an average speed of  after starting in 19th position. The team was then rushed back to England to compete in the 1922 RAC Tourist Trophy.Davidson, Donald, Schaffer, Rick, Autocourse Official History of the Indianapolis 500, page 60\n\nCaptain Woolf Barnato\n\nIn an ironic reference to his heavyweight boxer's stature, Captain Woolf Barnato was nicknamed \"Babe\". In 1925, he acquired his first Bentley, a 3-litre. With this car he won numerous Brooklands races. Just a year later he acquired the Bentley business itself.\n\nThe Bentley enterprise was always underfunded, but inspired by the 1924 Le Mans win by John Duff and Frank Clement, Barnato agreed to finance Bentley's business. Barnato had incorporated Baromans Ltd in 1922, which existed as his finance and investment vehicle. Via Baromans, Barnato initially invested in excess of £100,000, saving the business and its workforce. A financial reorganisation of the original Bentley company was carried out and all existing creditors paid off for £75,000. Existing shares were devalued from £1 each to just 1 shilling, or 5% or their original value. Barnato held 149,500 of the new shares giving him control of the company and he became chairman. Barnato injected further cash into the business: £35,000 secured by debenture in July 1927; £40,000 in 1928; £25,000 in 1929. With renewed financial input, W. O. Bentley was able to design another generation of cars.\n\nThe Bentley Boys\n\nThe Bentley Boys were a group of British motoring enthusiasts that included Barnato, Sir Henry \"Tim\" Birkin, steeple chaser George Duller, aviator Glen Kidston, automotive journalist S.C.H. \"Sammy\" Davis, and Dudley Benjafield. The Bentley Boys favoured Bentley cars. Many were independently wealthy and many had a military background.  They kept the marque's reputation for high performance alive; Bentley was noted for its four consecutive victories at the 24 Hours of Le Mans, from 1927 to 1930.\n\nIn 1929, Birkin developed the 4½-litre, lightweight Blower Bentley at Welwyn Garden City and produced five racing specials, starting with Bentley Blower No.1 which was optimised for the Brooklands racing circuit. Birkin overruled Bentley and put the model on the market before it was fully developed. As a result, it was unreliable.\n\nIn March 1930, during the Blue Train Races, Barnato raised the stakes on Rover and its Rover Light Six, having raced and beaten Le Train Bleu for the first time, to better that record with his 6½-litre Bentley Speed Six on a bet of £100. He drove against the train from Cannes to Calais, then by ferry to Dover, and finally London, travelling on public highways, and won.\n\nBarnato drove his H.J. Mulliner–bodied formal saloon in the race against the Blue Train. Two months later, on 21 May 1930, he took delivery of a Speed Six with streamlined fastback \"sportsman coupé\" by Gurney Nutting. Both cars became known as the \"Blue Train Bentleys\"; the latter is regularly mistaken for, or erroneously referred to as being, the car that raced the Blue Train, while in fact Barnato named it in memory of his race.  A painting by Terence Cuneo depicts the Gurney Nutting coupé racing along a road parallel to the Blue Train, which scenario never occurred as the road and railway did not follow the same route.\n\nCricklewood Bentleys\n\n* 1921–1929 3-litre\n* 1926–1930 4½-litre & \"Blower Bentley\"\n* 1926–1930 6½-litre\n* 1928–1930 6½-litre Speed Six\n* 1930–1931 8-litre\n* 1931 4-litre\n\nThe original model was the three-litre, but as customers put heavier bodies on the chassis, a larger 4½-litre model followed. Perhaps the most iconic model of the period is the 4½-litre \"Blower Bentley\", with its distinctive supercharger projecting forward from the bottom of the grille. Uncharacteristically fragile for a Bentley it was not the racing workhorse the 6½-litre was, though in 1930 Birkin remarkably finished second in the French Grand Prix at Pau in a stripped-down racing version of the Blower Bentley, behind Philippe Etancelin in a Bugatti Type 35.\n\nThe 4½-litre model later became famous in popular media as the vehicle of choice of James Bond in the original novels, but this has been seen only briefly in the films. John Steed in the television series The Avengers also drove a Bentley.\n\nThe new eight-litre was such a success that when Barnato's money seemed to run out in 1931 and Napier was planning to buy Bentley's business, Rolls-Royce purchased Bentley Motors to prevent it from competing with their most expensive model, the Phantom II.\n\nPerformance at Le Mans\n\n24 hours of Le Mans Grand Prix d'Endurance\n\n* 1923 4th (private entry) (3-Litre)\n* 1924 1st (3-Litre)\n* 1925 did not finish\n* 1926 did not finish\n* 1927 1st 15th 17th (3-Litre)\n* 1928 1st 5th (4½-litre)\n* 1929 1st (Speed Six); 2nd 3rd 4th: (4½-litre)\n* 1930 1st 2nd (Speed Six)\n\nBentley withdrew from motor racing just after winning at Le Mans in 1930, claiming that they had learned enough about speed and reliability.\n\nLiquidation\n\nThe Wall Street Crash of 1929 and the resulting Great Depression throttled the demand for Bentley's expensive motor cars. In July 1931, two mortgage payments were due which neither the company nor Barnato, the guarantor, were able to meet. On 10 July 1931 a receiver was appointed.\"Receiver Appointed Of Bentley Motors Limited Re Bentley Motors Limited; London Life Association Limited v. Bentley Motors Limited, And Woolf Barnato\". The Times, Saturday, 11 July 1931; p. 4; Issue 45872\n\nNapier offered to buy Bentley with the purchase to be final in November 1931. Instead, British Central Equitable Trust made a winning sealed bid of £125,000. British Central Equitable Trust later proved to be a front for Rolls-Royce Limited. Not even Bentley himself knew the identity of the purchaser until the deal was completed.\n\nBarnato received £42,000 for his shares in Bentley Motors. In 1934 he was appointed to the board of the new Bentley Motors (1931) Ltd. In the same year Bentley confirmed that it would continue racing.\n\nRolls-Royce (1931-1970)\n\nDerby\n\nRolls-Royce took over the assets of Bentley Motors (1919) Ltd and formed a subsidiary, Bentley Motors (1931) Ltd. Rolls-Royce had acquired the Bentley showrooms in Cork Street, the service station at Kingsbury, the complex at Cricklewood and the services of Bentley himself. This last was disputed by Napier in court without success. Bentley had neglected to register their trademark so Rolls-Royce immediately did so. They also sold the Cricklewood factory in 1932. Production stopped for two years, before resuming at the Rolls-Royce works in Derby. Unhappy with his role at Rolls-Royce, when his contract expired at the end of April 1935 W. O. Bentley left to join Lagonda.\n\nWhen the new Bentley 3½ litre appeared in 1933, it was a sporting variant of the Rolls-Royce 20/25, which disappointed some traditional customers yet was well received by many others. W. O. Bentley was reported as saying, \"Taking all things into consideration, I would rather own this Bentley than any other car produced under that name\". Rolls-Royce's advertisements for the  Litre called it \"the silent sports car\",Feast, Richard, The DNA of Bentley, [https://books.google.com/books?id5l0PBEg9Ta0C&pg\nPA71&sourcegbs_toc_r&cad\n4#vonepage&q&f\nfalse Chapter 5: \"Togetherness: Rolls-Royce/Bentley\"], p. 77 a slogan Rolls-Royce continued to use for Bentley cars until the 1950s.\n\nAll Bentleys produced from 1931 to 2004 used inherited or shared Rolls-Royce chassis, and adapted Rolls-Royce engines, and are described by critics as badge-engineered Rolls-Royces.\n\nDerby Bentleys\n\n* 1933–1937 3½-litre\n** 1936–1939 4¼-litre\n* 1939–1941 Mark V\n** 1939 Mark V\n\nCrewe\n\nIn preparation for war, Rolls-Royce and the British Government searched for a location for a shadow factory to ensure production of aero-engines.Pugh 2000, pp. 192-198. Crewe, with its excellent road and rail links, as well as being located in the northwest away from the aerial bombing starting in mainland Europe, was a logical choice. Crewe also had extensive open farming land. Construction of the factory started on a 60-acre area on the potato fields of Merrill's Farm in July 1938, with the first Rolls-Royce Merlin aero-engine rolling off the production line five months later. 25,000 Merlin engines  were produced and at its peak, in 1943 during World War II, the factory employed 10,000 people. With the war in Europe over and the general move towards the then new jet engines, Rolls-Royce concentrated its aero engine operations at Derby and moved motor car operations to Crewe.\n\nStandard Steel saloons\n\nUntil some time after World War II, most high-end motorcar manufacturers like Bentley and Rolls-Royce did not supply complete cars. They sold rolling chassis, near-complete from the instrument panel forward. Each chassis was delivered to the coach builder of the buyer's choice. The biggest specialist car dealerships had coachbuilders build standard designs for them which were held in stock awaiting potential buyers.\n\nTo meet post-war demand, particularly UK Government pressure to export and earn overseas currency, Rolls-Royce developed an all steel body using pressings made by Pressed Steel to create a \"standard\" ready-to-drive complete saloon car. The first steel-bodied model produced was the Bentley Mark VI:  these started to emerge from the newly reconfigured Crewe factory early in 1946.Crewe's Rolls-Royce Factory From Old Photographs by Peter Ollerhead and Tony Flood, republished electronically 2013 by Amberley Publishing of Stroud, Gloucestershire, England  Some years later, initially only for export, the Rolls-Royce Silver Dawn was introduced, a standard steel Bentley but with a Rolls-Royce radiator grille for a small extra charge, and this convention continued.\n\nChassis remained available to coachbuilders until the end of production of the Bentley S3, which was replaced for October 1965 by the chassis-less monocoque construction T series.\n\nBentley Continental\n\nThe Continental fastback coupé was aimed at the UK market, most cars, 164 plus a prototype, being right-hand drive. The chassis was produced at the Crewe factory and shared many components with the standard R type. Other than the R-Type standard steel saloon, R-Type Continentals were delivered as rolling chassis to the coachbuilder of choice. Coachwork for most of these cars was completed by H. J. Mulliner & Co. who mainly built them in fastback coupe form. Other coachwork came from Park Ward (London) who built six, later including a drophead coupe version. Franay (Paris) built five, Graber (Wichtrach, Switzerland) built three, one of them later altered by Köng (Basel, Switzerland), and Pininfarina made one. James Young (London) built in 1954 a Sports Saloon for the owner of James Young's, James Barclay.\n\nThe early R Type Continental has essentially the same engine as the standard R Type, but with modified carburation, induction and exhaust manifolds along with higher gear ratios. After July 1954 the car was fitted with an engine, having now a larger bore of 94.62 mm (3.7 in) with a total displacement of 4887 cc. The compression ratio was raised to 7.25:1.\n\nCrewe Rolls-Royce Bentleys\n\nFile:1951 Bentley MK VI HJM 2-door saloon 8160965887.jpg |\"The silent sports car\"1952 4¼-litre 2-door by H J Mulliner\nFile:Bentley S2.JPG |Bentley S-series Standard Saloon\nFile:Bentley T2 reg 1977 6750 cc.JPG|Bentley T-series Standard Saloon (l.w.b.)\n\n*Standard-steel saloon\n**1946–1952 Mark VI\n**1952–1955 R Type\n*Continental\n**1952–1955 R Type Continental\n*S-series\n**1955–1959 S1 and Continental\n**1959–1962 S2 and Continental\n**1962–1965 S3 and Continental\n*T-series\n**1965–1977 T1\n**1977–1980 T2\n*1971–1984 Corniche\n*1975–1986 Camargue\n\nVickers (1970-1998)\n\nThe problems of Bentley's owner with Rolls-Royce aero engine development, the RB211, brought about the financial collapse of its business in 1970.\n\nThe motorcar division was made a separate business, Rolls-Royce Motors Limited, which remained independent until bought by Vickers plc in August 1980. By the 1970s and early 1980s Bentley sales had fallen badly; at one point less than 5% of combined production carried the Bentley badge. Under Vickers, Bentley set about regaining its high-performance heritage, typified by the 1980 Mulsanne. Bentley's restored sporting image created a renewed interest in the name and Bentley sales as a proportion of output began to rise. By 1986 the Bentley:Rolls-Royce ratio had reached 40:60; by 1991 it achieved parity.\n\nCrewe Vickers Bentleys\n\n* 1984–1995 Continental: convertible\n** 1992–1995 Continental Turbo\n* 1980–1992 Bentley Mulsanne\n** 1984–1988 Mulsanne L: limousine\n** 1982–1985 Mulsanne Turbo\n** 1987–1992 Mulsanne S\n* 1984–1992 Eight: basic model\n* 1985–1995 Turbo R: turbocharged performance version\n* 1991–2002 Continental R: turbocharged 2-door model\n** 1994–1995 Continental S: intercooled\n** 1996–2002 Continental T\n** 1999–2003 Continental R Mulliner: performance model\n* 1992–1998 Brooklands: improved Eight\n** 1996–1998 Brooklands R: performance Brooklands\n* 1994–1995 Turbo S: limited-edition sports model\n* 1994–1995 Continental S: to order only version of Continental R with features of Turbo S incorporated\n* 1995–1997 New Turbo R: updated 96MY Turbo R with revised bumpers, single front door glazing, new door mirrors, spare in trunk, engine cover, new seat design, auto lights, auto wipers etc.\n* 1995–2003 Azure: convertible Continental R\n* 1996–2002 Continental T: short-wheelbase performance model\n* 1997–1998 Turbo RL: \"new\" Turbo R LWB (Long Wheel Base)\n* 1997–1998 Bentley Turbo RT: replacement for the Turbo RL\n** 1997–1998 RT Mulliner: Ultra exclusive performance model\n\nVolkswagen (1998-present)\n\nIn October 1997, Vickers announced that it had decided to sell Rolls-Royce Motors. BMW AG seemed to be a logical purchaser because BMW already supplied engines and other components for Bentley and Rolls-Royce branded cars and because of BMW and Vickers joint efforts in building aircraft engines. BMW made a final offer of £340m, but was outbid by Volkswagen AG, which offered £430m. Volkswagen AG acquired the vehicle designs, model nameplates, production and administrative facilities, the Spirit of Ecstasy and Rolls-Royce grille shape trademarks, but not the rights to the use of the Rolls-Royce name or logo, which are owned by Rolls-Royce Holdings plc. In 1998, BMW started supplying components for the new range of Rolls-Royce and Bentley cars—notably V8 engines for the Bentley Arnage and V12 engines for the Rolls-Royce Silver Seraph, however, the supply contract allowed BMW to terminate its supply deal with Rolls-Royce with 12 months' notice, which would not be enough time for Volkswagen to re-engineer the cars.\n\nBMW paid Rolls-Royce plc £40m to license the Rolls-Royce name and logo. After negotiations, BMW and Volkswagen AG agreed that, from 1998 to 2002, BMW would continue to supply engines and components and would allow Volkswagen temporary use of the Rolls-Royce name and logo. All BMW engine supply ended in 2003 with the end of Silver Seraph production.\n\nFrom 1 January 2003 forward, Volkswagen AG would be the sole provider of cars with the \"Bentley\" marque. BMW established a new legal entity, Rolls-Royce Motor Cars Limited, and built a new administrative headquarters and production facility for Rolls-Royce branded vehicles in Goodwood, West Sussex, England.\n\nInvestment and company development\n\nAfter acquiring the business, Volkswagen spent GBP500 million (about US$845 million) to modernise the Crewe factory and increase production capacity.\nAs of early 2010, there are about 3,500 working at Crewe, compared with about 1,500 in 1998 before being taken over by Volkswagen. It was reported that Volkswagen invested a total of nearly US$2 billion in Bentley and its revival. As a result of upgrading facilities at Crewe the bodywork now arrives fully painted at the Crewe facility for final assembly, with the parts coming from Germany—similarly Rolls-Royce body shells are painted and shipped to the UK for assembly only.\n\nIn 2002, Bentley presented Queen Elizabeth II with an official State Limousine to celebrate her Golden Jubilee. In 2003, Bentley's two-door convertible, the Bentley Azure, ceased production, and Bentley introduced a second line, Bentley Continental GT, a large luxury coupé powered by a W12 engine built in Crewe.\n\nDemand had been so great that the factory at Crewe was unable to meet orders despite an installed capacity of approximately 9,500 vehicles per year; there was a waiting list of over a year for new cars to be delivered. Consequently, part of the production of the new Flying Spur, a four-door version of the Continental GT, was assigned to the Transparent Factory (Germany), where the Volkswagen Phaeton luxury car is also assembled. This arrangement ceased at the end of 2006 after around 1,000 cars, with all car production reverting to the Crewe plant.\n\nIn April 2005, Bentley confirmed plans to produce a four-seat convertible model—the Azure, derived from the Arnage Drophead Coupé prototype—at Crewe beginning in 2006. By the autumn of 2005, the convertible version of the successful Continental GT, the Continental GTC, was also presented. These two models were successfully launched in late 2006.\n\nA limited run of a Zagato modified GT was also announced in March 2008, dubbed \"GTZ\".\n\nA new version of the Bentley Continental was introduced at the 2009 Geneva Auto Show: The Continental Supersports. This new Bentley is a supercar combining extreme power with environmentally friendly FlexFuel technology, capable of using petrol (gasoline) and biofuel (E85 ethanol).\n\nBentley sales continued to increase, and in 2005 8,627 were sold worldwide, 3,654 in the United States. In 2007, the 10,000 cars-per-year threshold was broken for the first time with sales of 10,014. For 2007, a record profit of €155 million was also announced. Bentley reported a sale of about 7,600 units in 2008. However, its global sales plunged 50 percent to 4,616 vehicles in 2009 (with the U.S. deliveries dropped 49% to 1,433 vehicles) and it suffered an operating loss of €194 million, compared with an operating profit of €10 million in 2008. As a result of the slump in sales, production at Crewe was shut down during March and April 2009. Though vehicle sales increased by 11% to 5,117 in 2010, operating loss grew by 26% to €245 million. In Autumn 2010, workers at Crewe staged a series of protests over proposal of compulsory work on Fridays and mandatory overtime during the week.\n\nVehicle sales in 2011 rose 37% to 7,003 vehicles, with the new Continental GT accounting for over one-third of total sales. The current workforce is about 4,000 people.\n\nThe business earned a profit in 2011 after two years of losses as a result of the following sales results:\n\nDeliveries, profits and staff\n\nSources Volkswagen AG Annual Reports and press releases\n\nProduction\n\nSources Volkswagen AG Annual Reports\n\nUnsold cars: During the years 2011 and 2012 production exceeded deliveries by 1,187 cars which is estimated to have trebled inventory.\n\nCrewe Volkswagen Bentleys\n\nCar models in current production\n\n* 2010–present: Mulsanne\n* 2013–present: Flying Spur\n* 2016–present: Bentayga\n* 2018–present: Continental GT (Gen 3)\n\nCar models formerly in production\n\n* 1992-2011: Bentley Brooklands\n* 1998-2003: Arnage\n* 1995-2009: Azure\n* 2003-2011: Continental GT\n* 2005-2012: Continental Flying Spur\n* 2006-2011: Continental GTC\n* 2009-2009: Continental Supersports\n* 2009-2009: Bentley Zagato GTZ\n* 2011–2018: Continental GT (Gen 2)\n* 2011–2018: Continental GT Convertible (Gen 2)\n\nSpecial edition car models\n\n* 1999: Hunaudieres Concept\n* 2002: State Limousine\n\nMotorsport\n\nA Bentley Continental GT3 entered by the M-Sport factory team won the Silverstone round of the 2014 Blancpain Endurance Series. This was Bentley's first official entry in a British race since  the 1930 RAC Tourist Trophy.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bentley" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5052" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Bentley Motors Limited is a British manufacturer and marketer of luxury cars and SUVs—and a subsidiary of Volkswagen AG since 1998.\n\nHeadquartered in Crewe, England, the company was founded as Bentley Motors Limited by W. O. Bentley in 1919 in Cricklewood, North London—and became widely known for winning the 24 Hours of Le Mans in 1924, 1927, 1928, 1929, 1930, and 2003.\n\nProminent models extend from the historic sports-racing Bentley 4½ Litre and Bentley Speed Six; the more recent Bentley R Type Continental, Bentley Turbo R, and Bentley Arnage; to its current model line—including the Continental Flying Spur, Continental GT, Bentley Bentayga and the Mulsanne—which are marketed worldwide, with China as its largest market as of November 2012.\n\nToday most Bentleys are assembled at the company's Crewe factory, with a small number assembled at Volkswagen's Dresden factory, Germany, and with bodies for the Continental manufactured in Zwickau and for the Bentayga manufactured at the Volkswagen Bratislava Plant.\n\nThe joining and eventual separation of Bentley and Rolls-Royce followed a series of mergers and acquisitions, beginning with the 1931 purchase by Rolls-Royce of Bentley, then in receivership. In 1971, Rolls-Royce itself was forced into receivership and the UK government nationalised the company—splitting into two companies the aerospace division (Rolls-Royce Plc) and automotive (Rolls-Royce Motors Limited) divisions—the latter retaining the Bentley subdivision. Rolls-Royce Motors was subsequently sold to engineering conglomerate, Vickers and in 1998, Vickers sold Rolls-Royce to Volkswagen AG.\n\nIntellectual property rights to both the name Rolls-Royce as well as the company's logo had been retained not by Rolls-Royce Motors, but by aerospace company, Rolls-Royce Plc, which had continued to license both to the automotive division.  Thus the sale of \"Rolls-Royce\" to VW included the Bentley name and logos, vehicle designs, model nameplates, production and administrative facilities, the Spirit of Ecstasy and Rolls-Royce grille shape trademarks (subsequently sold to BMW by VW)—but not the rights to the Rolls-Royce name or logo.  The aerospace company, Rolls-Royce Plc, ultimately sold both to BMW AG.\n\nCricklewood (1919-1931)\n\nBefore World War I,  Walter Owen Bentley and his brother, Horace Millner Bentley, sold French DFP cars in Cricklewood, North London, but W.O, as Walter was known, always wanted to design and build his own cars. At the DFP factory, in 1913, he noticed an aluminium paperweight and thought that aluminium might be a suitable replacement for cast iron to fabricate lighter pistons. The first Bentley aluminium pistons were fitted to Sopwith Camel aero engines during World War I.\n\nIn August 1919, W.O. registered Bentley Motors Ltd. and in October he exhibited a car chassis, with dummy engine, at the London Motor Show.  Ex–Royal Flying Corps officer Clive Gallop designed an innovative four valves per cylinder engine for the chassis. By December the engine was built and running. Delivery of the first cars was scheduled for June 1920, but development took longer than estimated so the date was extended to September 1921. The durability of the first Bentley cars earned widespread acclaim and they competed in hill climbs and raced at Brooklands.\n\nBentley's first major event was the 1922 Indianapolis 500, a race dominated by specialized cars with Duesenberg racing chassis. They entered a modified road car driven by works driver, Douglas Hawkes, accompanied by riding mechanic, H. S. \"Bertie\" Browning. Hawkes completed the full 500 mi and finished 13th with an average speed of  after starting in 19th position. The team was then rushed back to England to compete in the 1922 RAC Tourist Trophy.Davidson, Donald, Schaffer, Rick, Autocourse Official History of the Indianapolis 500, page 60\n\nCaptain Woolf Barnato\n\nIn an ironic reference to his heavyweight boxer's stature, Captain Woolf Barnato was nicknamed \"Babe\". In 1925, he acquired his first Bentley, a 3-litre. With this car he won numerous Brooklands races. Just a year later he acquired the Bentley business itself.\n\nThe Bentley enterprise was always underfunded, but inspired by the 1924 Le Mans win by John Duff and Frank Clement, Barnato agreed to finance Bentley's business. Barnato had incorporated Baromans Ltd in 1922, which existed as his finance and investment vehicle. Via Baromans, Barnato initially invested in excess of £100,000, saving the business and its workforce. A financial reorganisation of the original Bentley company was carried out and all existing creditors paid off for £75,000. Existing shares were devalued from £1 each to just 1 shilling, or 5% or their original value. Barnato held 149,500 of the new shares giving him control of the company and he became chairman. Barnato injected further cash into the business: £35,000 secured by debenture in July 1927; £40,000 in 1928; £25,000 in 1929. With renewed financial input, W. O. Bentley was able to design another generation of cars.\n\nThe Bentley Boys\n\nThe Bentley Boys were a group of British motoring enthusiasts that included Barnato, Sir Henry \"Tim\" Birkin, steeple chaser George Duller, aviator Glen Kidston, automotive journalist S.C.H. \"Sammy\" Davis, and Dudley Benjafield. The Bentley Boys favoured Bentley cars. Many were independently wealthy and many had a military background.  They kept the marque's reputation for high performance alive; Bentley was noted for its four consecutive victories at the 24 Hours of Le Mans, from 1927 to 1930.\n\nIn 1929, Birkin developed the 4½-litre, lightweight Blower Bentley at Welwyn Garden City and produced five racing specials, starting with Bentley Blower No.1 which was optimised for the Brooklands racing circuit. Birkin overruled Bentley and put the model on the market before it was fully developed. As a result, it was unreliable.\n\nIn March 1930, during the Blue Train Races, Barnato raised the stakes on Rover and its Rover Light Six, having raced and beaten Le Train Bleu for the first time, to better that record with his 6½-litre Bentley Speed Six on a bet of £100. He drove against the train from Cannes to Calais, then by ferry to Dover, and finally London, travelling on public highways, and won.\n\nBarnato drove his H.J. Mulliner–bodied formal saloon in the race against the Blue Train. Two months later, on 21 May 1930, he took delivery of a Speed Six with streamlined fastback \"sportsman coupé\" by Gurney Nutting. Both cars became known as the \"Blue Train Bentleys\"; the latter is regularly mistaken for, or erroneously referred to as being, the car that raced the Blue Train, while in fact Barnato named it in memory of his race.  A painting by Terence Cuneo depicts the Gurney Nutting coupé racing along a road parallel to the Blue Train, which scenario never occurred as the road and railway did not follow the same route.\n\nCricklewood Bentleys\n\n* 1921–1929 3-litre\n* 1926–1930 4½-litre & \"Blower Bentley\"\n* 1926–1930 6½-litre\n* 1928–1930 6½-litre Speed Six\n* 1930–1931 8-litre\n* 1931 4-litre\n\nThe original model was the three-litre, but as customers put heavier bodies on the chassis, a larger 4½-litre model followed. Perhaps the most iconic model of the period is the 4½-litre \"Blower Bentley\", with its distinctive supercharger projecting forward from the bottom of the grille. Uncharacteristically fragile for a Bentley it was not the racing workhorse the 6½-litre was, though in 1930 Birkin remarkably finished second in the French Grand Prix at Pau in a stripped-down racing version of the Blower Bentley, behind Philippe Etancelin in a Bugatti Type 35.\n\nThe 4½-litre model later became famous in popular media as the vehicle of choice of James Bond in the original novels, but this has been seen only briefly in the films. John Steed in the television series The Avengers also drove a Bentley.\n\nThe new eight-litre was such a success that when Barnato's money seemed to run out in 1931 and Napier was planning to buy Bentley's business, Rolls-Royce purchased Bentley Motors to prevent it from competing with their most expensive model, the Phantom II.\n\nPerformance at Le Mans\n\n24 hours of Le Mans Grand Prix d'Endurance\n\n* 1923 4th (private entry) (3-Litre)\n* 1924 1st (3-Litre)\n* 1925 did not finish\n* 1926 did not finish\n* 1927 1st 15th 17th (3-Litre)\n* 1928 1st 5th (4½-litre)\n* 1929 1st (Speed Six); 2nd 3rd 4th: (4½-litre)\n* 1930 1st 2nd (Speed Six)\n\nBentley withdrew from motor racing just after winning at Le Mans in 1930, claiming that they had learned enough about speed and reliability.\n\nLiquidation\n\nThe Wall Street Crash of 1929 and the resulting Great Depression throttled the demand for Bentley's expensive motor cars. In July 1931, two mortgage payments were due which neither the company nor Barnato, the guarantor, were able to meet. On 10 July 1931 a receiver was appointed.\"Receiver Appointed Of Bentley Motors Limited Re Bentley Motors Limited; London Life Association Limited v. Bentley Motors Limited, And Woolf Barnato\". The Times, Saturday, 11 July 1931; p. 4; Issue 45872\n\nNapier offered to buy Bentley with the purchase to be final in November 1931. Instead, British Central Equitable Trust made a winning sealed bid of £125,000. British Central Equitable Trust later proved to be a front for Rolls-Royce Limited. Not even Bentley himself knew the identity of the purchaser until the deal was completed.\n\nBarnato received £42,000 for his shares in Bentley Motors. In 1934 he was appointed to the board of the new Bentley Motors (1931) Ltd. In the same year Bentley confirmed that it would continue racing.\n\nRolls-Royce (1931-1970)\n\nDerby\n\nRolls-Royce took over the assets of Bentley Motors (1919) Ltd and formed a subsidiary, Bentley Motors (1931) Ltd. Rolls-Royce had acquired the Bentley showrooms in Cork Street, the service station at Kingsbury, the complex at Cricklewood and the services of Bentley himself. This last was disputed by Napier in court without success. Bentley had neglected to register their trademark so Rolls-Royce immediately did so. They also sold the Cricklewood factory in 1932. Production stopped for two years, before resuming at the Rolls-Royce works in Derby. Unhappy with his role at Rolls-Royce, when his contract expired at the end of April 1935 W. O. Bentley left to join Lagonda.\n\nWhen the new Bentley 3½ litre appeared in 1933, it was a sporting variant of the Rolls-Royce 20/25, which disappointed some traditional customers yet was well received by many others. W. O. Bentley was reported as saying, \"Taking all things into consideration, I would rather own this Bentley than any other car produced under that name\". Rolls-Royce's advertisements for the  Litre called it \"the silent sports car\",Feast, Richard, The DNA of Bentley, [https://books.google.com/books?id5l0PBEg9Ta0C&pg\nPA71&sourcegbs_toc_r&cad\n4#vonepage&q&f\nfalse Chapter 5: \"Togetherness: Rolls-Royce/Bentley\"], p. 77 a slogan Rolls-Royce continued to use for Bentley cars until the 1950s.\n\nAll Bentleys produced from 1931 to 2004 used inherited or shared Rolls-Royce chassis, and adapted Rolls-Royce engines, and are described by critics as badge-engineered Rolls-Royces.\n\nDerby Bentleys\n\n* 1933–1937 3½-litre\n** 1936–1939 4¼-litre\n* 1939–1941 Mark V\n** 1939 Mark V\n\nCrewe\n\nIn preparation for war, Rolls-Royce and the British Government searched for a location for a shadow factory to ensure production of aero-engines.Pugh 2000, pp. 192-198. Crewe, with its excellent road and rail links, as well as being located in the northwest away from the aerial bombing starting in mainland Europe, was a logical choice. Crewe also had extensive open farming land. Construction of the factory started on a 60-acre area on the potato fields of Merrill's Farm in July 1938, with the first Rolls-Royce Merlin aero-engine rolling off the production line five months later. 25,000 Merlin engines  were produced and at its peak, in 1943 during World War II, the factory employed 10,000 people. With the war in Europe over and the general move towards the then new jet engines, Rolls-Royce concentrated its aero engine operations at Derby and moved motor car operations to Crewe.\n\nStandard Steel saloons\n\nUntil some time after World War II, most high-end motorcar manufacturers like Bentley and Rolls-Royce did not supply complete cars. They sold rolling chassis, near-complete from the instrument panel forward. Each chassis was delivered to the coach builder of the buyer's choice. The biggest specialist car dealerships had coachbuilders build standard designs for them which were held in stock awaiting potential buyers.\n\nTo meet post-war demand, particularly UK Government pressure to export and earn overseas currency, Rolls-Royce developed an all steel body using pressings made by Pressed Steel to create a \"standard\" ready-to-drive complete saloon car. The first steel-bodied model produced was the Bentley Mark VI:  these started to emerge from the newly reconfigured Crewe factory early in 1946.Crewe's Rolls-Royce Factory From Old Photographs by Peter Ollerhead and Tony Flood, republished electronically 2013 by Amberley Publishing of Stroud, Gloucestershire, England  Some years later, initially only for export, the Rolls-Royce Silver Dawn was introduced, a standard steel Bentley but with a Rolls-Royce radiator grille for a small extra charge, and this convention continued.\n\nChassis remained available to coachbuilders until the end of production of the Bentley S3, which was replaced for October 1965 by the chassis-less monocoque construction T series.\n\nBentley Continental\n\nThe Continental fastback coupé was aimed at the UK market, most cars, 164 plus a prototype, being right-hand drive. The chassis was produced at the Crewe factory and shared many components with the standard R type. Other than the R-Type standard steel saloon, R-Type Continentals were delivered as rolling chassis to the coachbuilder of choice. Coachwork for most of these cars was completed by H. J. Mulliner & Co. who mainly built them in fastback coupe form. Other coachwork came from Park Ward (London) who built six, later including a drophead coupe version. Franay (Paris) built five, Graber (Wichtrach, Switzerland) built three, one of them later altered by Köng (Basel, Switzerland), and Pininfarina made one. James Young (London) built in 1954 a Sports Saloon for the owner of James Young's, James Barclay.\n\nThe early R Type Continental has essentially the same engine as the standard R Type, but with modified carburation, induction and exhaust manifolds along with higher gear ratios. After July 1954 the car was fitted with an engine, having now a larger bore of 94.62 mm (3.7 in) with a total displacement of 4887 cc. The compression ratio was raised to 7.25:1.\n\nCrewe Rolls-Royce Bentleys\n\nFile:1951 Bentley MK VI HJM 2-door saloon 8160965887.jpg |\"The silent sports car\"1952 4¼-litre 2-door by H J Mulliner\nFile:Bentley S2.JPG |Bentley S-series Standard Saloon\nFile:Bentley T2 reg 1977 6750 cc.JPG|Bentley T-series Standard Saloon (l.w.b.)\n\n*Standard-steel saloon\n**1946–1952 Mark VI\n**1952–1955 R Type\n*Continental\n**1952–1955 R Type Continental\n*S-series\n**1955–1959 S1 and Continental\n**1959–1962 S2 and Continental\n**1962–1965 S3 and Continental\n*T-series\n**1965–1977 T1\n**1977–1980 T2\n*1971–1984 Corniche\n*1975–1986 Camargue\n\nVickers (1970-1998)\n\nThe problems of Bentley's owner with Rolls-Royce aero engine development, the RB211, brought about the financial collapse of its business in 1970.\n\nThe motorcar division was made a separate business, Rolls-Royce Motors Limited, which remained independent until bought by Vickers plc in August 1980. By the 1970s and early 1980s Bentley sales had fallen badly; at one point less than 5% of combined production carried the Bentley badge. Under Vickers, Bentley set about regaining its high-performance heritage, typified by the 1980 Mulsanne. Bentley's restored sporting image created a renewed interest in the name and Bentley sales as a proportion of output began to rise. By 1986 the Bentley:Rolls-Royce ratio had reached 40:60; by 1991 it achieved parity.\n\nCrewe Vickers Bentleys\n\n* 1984–1995 Continental: convertible\n** 1992–1995 Continental Turbo\n* 1980–1992 Bentley Mulsanne\n** 1984–1988 Mulsanne L: limousine\n** 1982–1985 Mulsanne Turbo\n** 1987–1992 Mulsanne S\n* 1984–1992 Eight: basic model\n* 1985–1995 Turbo R: turbocharged performance version\n* 1991–2002 Continental R: turbocharged 2-door model\n** 1994–1995 Continental S: intercooled\n** 1996–2002 Continental T\n** 1999–2003 Continental R Mulliner: performance model\n* 1992–1998 Brooklands: improved Eight\n** 1996–1998 Brooklands R: performance Brooklands\n* 1994–1995 Turbo S: limited-edition sports model\n* 1994–1995 Continental S: to order only version of Continental R with features of Turbo S incorporated\n* 1995–1997 New Turbo R: updated 96MY Turbo R with revised bumpers, single front door glazing, new door mirrors, spare in trunk, engine cover, new seat design, auto lights, auto wipers etc.\n* 1995–2003 Azure: convertible Continental R\n* 1996–2002 Continental T: short-wheelbase performance model\n* 1997–1998 Turbo RL: \"new\" Turbo R LWB (Long Wheel Base)\n* 1997–1998 Bentley Turbo RT: replacement for the Turbo RL\n** 1997–1998 RT Mulliner: Ultra exclusive performance model\n\nVolkswagen (1998-present)\n\nIn October 1997, Vickers announced that it had decided to sell Rolls-Royce Motors. BMW AG seemed to be a logical purchaser because BMW already supplied engines and other components for Bentley and Rolls-Royce branded cars and because of BMW and Vickers joint efforts in building aircraft engines. BMW made a final offer of £340m, but was outbid by Volkswagen AG, which offered £430m. Volkswagen AG acquired the vehicle designs, model nameplates, production and administrative facilities, the Spirit of Ecstasy and Rolls-Royce grille shape trademarks, but not the rights to the use of the Rolls-Royce name or logo, which are owned by Rolls-Royce Holdings plc. In 1998, BMW started supplying components for the new range of Rolls-Royce and Bentley cars—notably V8 engines for the Bentley Arnage and V12 engines for the Rolls-Royce Silver Seraph, however, the supply contract allowed BMW to terminate its supply deal with Rolls-Royce with 12 months' notice, which would not be enough time for Volkswagen to re-engineer the cars.\n\nBMW paid Rolls-Royce plc £40m to license the Rolls-Royce name and logo. After negotiations, BMW and Volkswagen AG agreed that, from 1998 to 2002, BMW would continue to supply engines and components and would allow Volkswagen temporary use of the Rolls-Royce name and logo. All BMW engine supply ended in 2003 with the end of Silver Seraph production.\n\nFrom 1 January 2003 forward, Volkswagen AG would be the sole provider of cars with the \"Bentley\" marque. BMW established a new legal entity, Rolls-Royce Motor Cars Limited, and built a new administrative headquarters and production facility for Rolls-Royce branded vehicles in Goodwood, West Sussex, England.\n\nInvestment and company development\n\nAfter acquiring the business, Volkswagen spent GBP500 million (about US$845 million) to modernise the Crewe factory and increase production capacity.\nAs of early 2010, there are about 3,500 working at Crewe, compared with about 1,500 in 1998 before being taken over by Volkswagen. It was reported that Volkswagen invested a total of nearly US$2 billion in Bentley and its revival. As a result of upgrading facilities at Crewe the bodywork now arrives fully painted at the Crewe facility for final assembly, with the parts coming from Germany—similarly Rolls-Royce body shells are painted and shipped to the UK for assembly only.\n\nIn 2002, Bentley presented Queen Elizabeth II with an official State Limousine to celebrate her Golden Jubilee. In 2003, Bentley's two-door convertible, the Bentley Azure, ceased production, and Bentley introduced a second line, Bentley Continental GT, a large luxury coupé powered by a W12 engine built in Crewe.\n\nDemand had been so great that the factory at Crewe was unable to meet orders despite an installed capacity of approximately 9,500 vehicles per year; there was a waiting list of over a year for new cars to be delivered. Consequently, part of the production of the new Flying Spur, a four-door version of the Continental GT, was assigned to the Transparent Factory (Germany), where the Volkswagen Phaeton luxury car is also assembled. This arrangement ceased at the end of 2006 after around 1,000 cars, with all car production reverting to the Crewe plant.\n\nIn April 2005, Bentley confirmed plans to produce a four-seat convertible model—the Azure, derived from the Arnage Drophead Coupé prototype—at Crewe beginning in 2006. By the autumn of 2005, the convertible version of the successful Continental GT, the Continental GTC, was also presented. These two models were successfully launched in late 2006.\n\nA limited run of a Zagato modified GT was also announced in March 2008, dubbed \"GTZ\".\n\nA new version of the Bentley Continental was introduced at the 2009 Geneva Auto Show: The Continental Supersports. This new Bentley is a supercar combining extreme power with environmentally friendly FlexFuel technology, capable of using petrol (gasoline) and biofuel (E85 ethanol).\n\nBentley sales continued to increase, and in 2005 8,627 were sold worldwide, 3,654 in the United States. In 2007, the 10,000 cars-per-year threshold was broken for the first time with sales of 10,014. For 2007, a record profit of €155 million was also announced. Bentley reported a sale of about 7,600 units in 2008. However, its global sales plunged 50 percent to 4,616 vehicles in 2009 (with the U.S. deliveries dropped 49% to 1,433 vehicles) and it suffered an operating loss of €194 million, compared with an operating profit of €10 million in 2008. As a result of the slump in sales, production at Crewe was shut down during March and April 2009. Though vehicle sales increased by 11% to 5,117 in 2010, operating loss grew by 26% to €245 million. In Autumn 2010, workers at Crewe staged a series of protests over proposal of compulsory work on Fridays and mandatory overtime during the week.\n\nVehicle sales in 2011 rose 37% to 7,003 vehicles, with the new Continental GT accounting for over one-third of total sales. The current workforce is about 4,000 people.\n\nThe business earned a profit in 2011 after two years of losses as a result of the following sales results:\n\nDeliveries, profits and staff\n\nSources Volkswagen AG Annual Reports and press releases\n\nProduction\n\nSources Volkswagen AG Annual Reports\n\nUnsold cars: During the years 2011 and 2012 production exceeded deliveries by 1,187 cars which is estimated to have trebled inventory.\n\nCrewe Volkswagen Bentleys\n\nCar models in current production\n\n* 2010–present: Mulsanne\n* 2013–present: Flying Spur\n* 2016–present: Bentayga\n* 2018–present: Continental GT (Gen 3)\n\nCar models formerly in production\n\n* 1992-2011: Bentley Brooklands\n* 1998-2003: Arnage\n* 1995-2009: Azure\n* 2003-2011: Continental GT\n* 2005-2012: Continental Flying Spur\n* 2006-2011: Continental GTC\n* 2009-2009: Continental Supersports\n* 2009-2009: Bentley Zagato GTZ\n* 2011–2018: Continental GT (Gen 2)\n* 2011–2018: Continental GT Convertible (Gen 2)\n\nSpecial edition car models\n\n* 1999: Hunaudieres Concept\n* 2002: State Limousine\n\nMotorsport\n\nA Bentley Continental GT3 entered by the M-Sport factory team won the Silverstone round of the 2014 Blancpain Endurance Series. This was Bentley's first official entry in a British race since  the 1930 RAC Tourist Trophy. Bentley. http://en.wikipedia.org/?curid=5052."
  }
}
