{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7661",
  "eid" : "e2b916f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778460127,
  "textBody" : "The Council of Constance is the 15th-century ecumenical council recognized by the Catholic Church, held from 1414 to 1418 in the Bishopric of Constance. The council ended the Western Schism, by deposing or accepting the resignation of the remaining papal claimants and electing Pope Martin V.\n\nThe council also condemned Jan Hus as a heretic and facilitated his execution by the civil authority. It also ruled on issues of national sovereignty, the rights of pagans, and just war in response to a conflict between the Kingdom of Poland and the Order of the Teutonic Knights. The council is important for its relationship to ecclesial conciliarism and Papal supremacy.\n\nOrigin and background\n\nThe council's main purpose was to end the Papal schism which had resulted from the confusion following the Avignon Papacy. Pope Gregory XI's return to Rome in 1377, followed by his death (in 1378) and the controversial election of his successor, Pope Urban VI, resulted in the defection of a number of cardinals and the election of a rival pope based at Avignon in 1378. After thirty years of schism, the rival courts convened the Council of Pisa seeking to resolve the situation by deposing the two claimant popes and electing a new one. The council claimed that in such a situation, a council of bishops had greater authority than just one bishop, even if he were the bishop of Rome. Though the elected Antipope Alexander V and his successor, Antipope John XXIII (not to be confused with the 20th-century Pope John XXIII), gained widespread support, especially at the cost of the Avignon antipope, the schism remained, now involving not two but three claimants: Gregory XII at Rome, Benedict XIII at Avignon, and John XXIII.\n\nTherefore, many voices, including Sigismund, King of the Romans and of Hungary (and later Holy Roman Emperor), pressed for another council to resolve the issue. That council was called by John XXIII and was held from 16 November 1414 to 22 April 1418 in Constance, Germany. According to Joseph McCabe, the council was attended by roughly 29 cardinals, 100 \"learned doctors of law and divinity\", 134 abbots, and 183 bishops and archbishops.\n\nConstance\n\nSigismund arrived on Christmas Eve 1414 and exercised a profound and continuous influence on the course of the council in his capacity of imperial protector of the church. An innovation at the council was that instead of voting as individuals, the bishops voted in national blocs. The vote by nations was in great measure the initiative of the English, German, and French members. The legality of this measure, in imitation of the \"nations\" of the universities, was more than questionable, but during February 1415 it carried and thenceforth was accepted in practice, though never authorized by any formal decree of the council. The four \"nations\" consisted of England, France, Italy, and Germany, with Poles, Hungarians, Danes, and Scandinavians counted with the Germans. While the Italian representatives made up half of those in attendance, they were equal in influence to the English who sent twenty deputies and three bishops.[http://www.newadvent.org/cathen/04288a.htm Shahan, Thomas. \"Council of Constance.\" The Catholic Encyclopedia] Vol. 4. New York: Robert Appleton Company, 1908. 30 December 2015\n\nDecrees and doctrinal status\n\nMany members of the new assembly (comparatively few bishops, but many doctors of theology and of canon and civil law, procurators of bishops, deputies of universities, cathedral chapters, provosts, etc., agents and representatives of princes, etc.) strongly favored the voluntary abdication of all three popes, as did King Sigismund.\n\nAlthough the Italian bishops who had accompanied John XXIII in large numbers supported his legitimacy, he grew increasingly more suspicious of the council. Partly in response to a fierce anonymous attack on his character from an Italian source, on 2 March 1415 he promised to resign. However, on 20 March he secretly fled the city and took refuge at Schaffhausen in territory of his friend Frederick, Duke of Austria-Tyrol.\n\nThe famous decree Haec Sancta Synodus, which gave primacy to the authority of the council and thus became a source for ecclesial conciliarism, was promulgated in the fifth session, 6 April 1415:\n\nHaec Sancta Synodus marks the high-water mark of the Conciliar movement of reform.For good, brief discussions of the politics of conciliarism at and after Constance, see Black, Anthony. 1998, \"Popes and Councils\" in The New Cambridge Medieval History,  Volume VII c. 11415–c. 1500, edited by Christopher Allmand, Cambridge: Cambridge University Press, pp. 67-76; and Watts, John. 2009, The Making of Polities,  Europe 1300-1500, Cambridge: Cambridge University Press, pp. 291-301..  This decree, however, is not considered valid by the Magisterium of the Catholic Church, since it was never approved by Pope Gregory XII or his successors, and was passed by the council in a session before his confirmation. The church declared the first sessions of the Council of Constance an invalid and illicit assembly of bishops, gathered under the authority of John XXIII.\n\nThe acts of the council were not made public until 1442, at the behest of the Council of Basel; they were printed in 1500. The creation of a book on how to die was ordered by the council, and thus written in 1415 under the title Ars moriendi.\n\nEnding the Western Schism\n\nWith the support of King Sigismund, enthroned before the high altar of the cathedral of Constance, the Council of Constance recommended that all three papal claimants abdicate, and that another be chosen. In part because of the constant presence of the King, other rulers demanded that they have a say in who would be pope.\n\nGregory XII then sent representatives to Constance, whom he granted full powers to summon, open, and preside over an Ecumenical Council; he also empowered them to present his resignation to the Papacy. This would pave the way for the end of the Western Schism.\n\nThe legates were received by King Sigismund and by the assembled Bishops, and the King yielded the presidency of the proceedings to the papal legates, Cardinal Giovanni Dominici of Ragusa and Prince Carlo Malatesta. On 4 July 1415 the Bull of Gregory XII which appointed Dominici and Malatesta as his proxies at the council was formally read before the assembled Bishops. The cardinal then read a decree of Gregory XII which convoked the council and authorized its succeeding acts. Thereupon, the Bishops voted to accept the summons. Prince Malatesta immediately informed the council that he was empowered by a commission from Pope Gregory XII to resign the Papal Throne on the Pontiff's behalf. He asked the council whether they would prefer to receive the abdication at that point or at a later date. The Bishops voted to receive the Papal abdication immediately. Thereupon the commission by Gregory XII authorizing his proxy to resign the Papacy on his behalf was read and Malatesta, acting in the name of Gregory XII, pronounced the resignation of the papacy by Gregory XII and handed a written copy of the resignation to the assembly.\n\nFormer Pope Gregory XII was then created titular Cardinal Bishop of Porto and Santa Ruffina by the council, with rank immediately below the Pope (which made him the highest-ranking person in the church, since, due to his abdication, the See of Peter in Rome was vacant). Gregory XII's cardinals were accepted as true cardinals by the council, but the members of the council delayed electing a new pope for fear that a new pope would restrict further discussion of pressing issues in the church.\n\nBy the time the anti-popes were all deposed and the new Pope, Martin V, was elected, two years had passed since Gregory XII's abdication, and Gregory was already dead. The council took great care to protect the legitimacy of the succession, ratified all his acts, and a new pontiff was chosen. The new pope, Martin V, elected November 1417, soon asserted the absolute authority of the papal office.\n\nCondemnation of Jan Hus\n\nA second goal of the council was to continue the reforms begun at the Council of Pisa (1409).  These reforms were largely directed against John Wycliffe, mentioned in the opening session and condemned in the eighth on 4 May 1415, and Jan Hus, along with their followers. Jan Hus, summoned to Constance under a letter of safe conduct, was found guilty of heresy by the council and turned over to the secular court. \"This holy synod of Constance, seeing that God's church has nothing more that it can do, relinquishes Jan Hus to the judgment of the secular authority and decrees that he is to be relinquished to the secular court.\" (Council of Constance-Session 15 – 6 July 1415). The secular court sentenced him to the stake.\n\nJerome of Prague, a supporter of Jan Hus, came to Constance to offer assistance. But he was similarly arrested, judged, found guilty of heresy and turned over to the same secular court, with the same outcome as Hus. Poggio Bracciolini attended the council and related the unfairness of the process against Jerome.William Shepherd, The Life of Poggio Bracciolini, 1837, Ch. II, p. 68-81. [https://play.google.com/books/reader?idF40NAAAAQAAJ&printsec\nfrontcover&outputreader&authuser\n0&hlen&pg\nGBS.PA81 Google Play Book]\n\nPaweł Włodkowic and all the Polish representation to the Council of Constance publicly defended Jan Hus.\n\nPolish–Lithuanian–Teutonic conflict\n\nIn 1411, the First Peace of Thorn ended the Polish–Lithuanian–Teutonic War, in which the Teutonic Knights fought the Kingdom of Poland and Grand Duchy of Lithuania. However, the peace was not stable and further conflicts arose regarding demarcation of the Samogitian borders. The tensions erupted into the brief Hunger War in summer 1414. It was concluded that the disputes would be mediated by the Council of Constance.\n\nThe Polish position was defended by Paulus Vladimiri, rector of the Jagiellonian University, who challenged legality of the Teutonic crusade. He argued that a forced conversion was incompatible with free will, which was an essential component of a genuine conversion. Therefore, the Knights could only wage a defensive war if pagans violated natural rights of the Christians. Vladimiri further stipulated that infidels had rights which had to be respected, and neither the Pope nor the Holy Roman Emperor had the authority to violate them. Poles and Lithuanians also brought a group of Samogitian representatives to testify of atrocities committed by the Knights.\n\nThe Dominican theologian John of Falkenberg proved to be the fiercest opponent of the Poles. In his Liber de doctrina, Falkenberg argued that \"the Emperor has the right to slay even peaceful infidels simply because they are pagans.\" The Poles deserve death for defending infidels, and should be exterminated even more than the infidels; they should be deprived of their sovereignty and reduced to slavery.\" In Satira, he attacked Polish King Jogaila, calling him a \"mad dog\" unworthy to be king. Falkenberg was condemned and imprisoned for such libel, but was not officially accused of heresy. Other opponents included Grand Master's proctor Peter Wormditt, Dominic of San Gimignano, John Urbach, Ardecino de Porta of Novara, and Bishop of Ciudad Rodrigo Andrew Escobar. They argued that the Knights were perfectly justified in their crusade as it was a sacred duty of Christians to spread the true faith. Cardinal Pierre d'Ailly published an independent opinion that attempted to somewhat balance both Polish and Teutonic positions.\n\nThe council did not make any political decisions. It established the Diocese of Samogitia, with its seat in Medininkai and subordinated to Lithuanian dioceses, and appointed Matthias of Trakai as the first bishop. Pope Martin V appointed Polish King Jogaila and Lithuanian Grand Duke Vytautas as vicars general in Pskov and Veliky Novgorod in recognition of their Catholicism. After another round of futile negotiations, the Gollub War broke out in 1422. It ended with the Treaty of Melno. Polish-Teutonic wars continued for another hundred years.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Council of Constance" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7661" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Council of Constance is the 15th-century ecumenical council recognized by the Catholic Church, held from 1414 to 1418 in the Bishopric of Constance. The council ended the Western Schism, by deposing or accepting the resignation of the remaining papal claimants and electing Pope Martin V.\n\nThe council also condemned Jan Hus as a heretic and facilitated his execution by the civil authority. It also ruled on issues of national sovereignty, the rights of pagans, and just war in response to a conflict between the Kingdom of Poland and the Order of the Teutonic Knights. The council is important for its relationship to ecclesial conciliarism and Papal supremacy.\n\nOrigin and background\n\nThe council's main purpose was to end the Papal schism which had resulted from the confusion following the Avignon Papacy. Pope Gregory XI's return to Rome in 1377, followed by his death (in 1378) and the controversial election of his successor, Pope Urban VI, resulted in the defection of a number of cardinals and the election of a rival pope based at Avignon in 1378. After thirty years of schism, the rival courts convened the Council of Pisa seeking to resolve the situation by deposing the two claimant popes and electing a new one. The council claimed that in such a situation, a council of bishops had greater authority than just one bishop, even if he were the bishop of Rome. Though the elected Antipope Alexander V and his successor, Antipope John XXIII (not to be confused with the 20th-century Pope John XXIII), gained widespread support, especially at the cost of the Avignon antipope, the schism remained, now involving not two but three claimants: Gregory XII at Rome, Benedict XIII at Avignon, and John XXIII.\n\nTherefore, many voices, including Sigismund, King of the Romans and of Hungary (and later Holy Roman Emperor), pressed for another council to resolve the issue. That council was called by John XXIII and was held from 16 November 1414 to 22 April 1418 in Constance, Germany. According to Joseph McCabe, the council was attended by roughly 29 cardinals, 100 \"learned doctors of law and divinity\", 134 abbots, and 183 bishops and archbishops.\n\nConstance\n\nSigismund arrived on Christmas Eve 1414 and exercised a profound and continuous influence on the course of the council in his capacity of imperial protector of the church. An innovation at the council was that instead of voting as individuals, the bishops voted in national blocs. The vote by nations was in great measure the initiative of the English, German, and French members. The legality of this measure, in imitation of the \"nations\" of the universities, was more than questionable, but during February 1415 it carried and thenceforth was accepted in practice, though never authorized by any formal decree of the council. The four \"nations\" consisted of England, France, Italy, and Germany, with Poles, Hungarians, Danes, and Scandinavians counted with the Germans. While the Italian representatives made up half of those in attendance, they were equal in influence to the English who sent twenty deputies and three bishops.[http://www.newadvent.org/cathen/04288a.htm Shahan, Thomas. \"Council of Constance.\" The Catholic Encyclopedia] Vol. 4. New York: Robert Appleton Company, 1908. 30 December 2015\n\nDecrees and doctrinal status\n\nMany members of the new assembly (comparatively few bishops, but many doctors of theology and of canon and civil law, procurators of bishops, deputies of universities, cathedral chapters, provosts, etc., agents and representatives of princes, etc.) strongly favored the voluntary abdication of all three popes, as did King Sigismund.\n\nAlthough the Italian bishops who had accompanied John XXIII in large numbers supported his legitimacy, he grew increasingly more suspicious of the council. Partly in response to a fierce anonymous attack on his character from an Italian source, on 2 March 1415 he promised to resign. However, on 20 March he secretly fled the city and took refuge at Schaffhausen in territory of his friend Frederick, Duke of Austria-Tyrol.\n\nThe famous decree Haec Sancta Synodus, which gave primacy to the authority of the council and thus became a source for ecclesial conciliarism, was promulgated in the fifth session, 6 April 1415:\n\nHaec Sancta Synodus marks the high-water mark of the Conciliar movement of reform.For good, brief discussions of the politics of conciliarism at and after Constance, see Black, Anthony. 1998, \"Popes and Councils\" in The New Cambridge Medieval History,  Volume VII c. 11415–c. 1500, edited by Christopher Allmand, Cambridge: Cambridge University Press, pp. 67-76; and Watts, John. 2009, The Making of Polities,  Europe 1300-1500, Cambridge: Cambridge University Press, pp. 291-301..  This decree, however, is not considered valid by the Magisterium of the Catholic Church, since it was never approved by Pope Gregory XII or his successors, and was passed by the council in a session before his confirmation. The church declared the first sessions of the Council of Constance an invalid and illicit assembly of bishops, gathered under the authority of John XXIII.\n\nThe acts of the council were not made public until 1442, at the behest of the Council of Basel; they were printed in 1500. The creation of a book on how to die was ordered by the council, and thus written in 1415 under the title Ars moriendi.\n\nEnding the Western Schism\n\nWith the support of King Sigismund, enthroned before the high altar of the cathedral of Constance, the Council of Constance recommended that all three papal claimants abdicate, and that another be chosen. In part because of the constant presence of the King, other rulers demanded that they have a say in who would be pope.\n\nGregory XII then sent representatives to Constance, whom he granted full powers to summon, open, and preside over an Ecumenical Council; he also empowered them to present his resignation to the Papacy. This would pave the way for the end of the Western Schism.\n\nThe legates were received by King Sigismund and by the assembled Bishops, and the King yielded the presidency of the proceedings to the papal legates, Cardinal Giovanni Dominici of Ragusa and Prince Carlo Malatesta. On 4 July 1415 the Bull of Gregory XII which appointed Dominici and Malatesta as his proxies at the council was formally read before the assembled Bishops. The cardinal then read a decree of Gregory XII which convoked the council and authorized its succeeding acts. Thereupon, the Bishops voted to accept the summons. Prince Malatesta immediately informed the council that he was empowered by a commission from Pope Gregory XII to resign the Papal Throne on the Pontiff's behalf. He asked the council whether they would prefer to receive the abdication at that point or at a later date. The Bishops voted to receive the Papal abdication immediately. Thereupon the commission by Gregory XII authorizing his proxy to resign the Papacy on his behalf was read and Malatesta, acting in the name of Gregory XII, pronounced the resignation of the papacy by Gregory XII and handed a written copy of the resignation to the assembly.\n\nFormer Pope Gregory XII was then created titular Cardinal Bishop of Porto and Santa Ruffina by the council, with rank immediately below the Pope (which made him the highest-ranking person in the church, since, due to his abdication, the See of Peter in Rome was vacant). Gregory XII's cardinals were accepted as true cardinals by the council, but the members of the council delayed electing a new pope for fear that a new pope would restrict further discussion of pressing issues in the church.\n\nBy the time the anti-popes were all deposed and the new Pope, Martin V, was elected, two years had passed since Gregory XII's abdication, and Gregory was already dead. The council took great care to protect the legitimacy of the succession, ratified all his acts, and a new pontiff was chosen. The new pope, Martin V, elected November 1417, soon asserted the absolute authority of the papal office.\n\nCondemnation of Jan Hus\n\nA second goal of the council was to continue the reforms begun at the Council of Pisa (1409).  These reforms were largely directed against John Wycliffe, mentioned in the opening session and condemned in the eighth on 4 May 1415, and Jan Hus, along with their followers. Jan Hus, summoned to Constance under a letter of safe conduct, was found guilty of heresy by the council and turned over to the secular court. \"This holy synod of Constance, seeing that God's church has nothing more that it can do, relinquishes Jan Hus to the judgment of the secular authority and decrees that he is to be relinquished to the secular court.\" (Council of Constance-Session 15 – 6 July 1415). The secular court sentenced him to the stake.\n\nJerome of Prague, a supporter of Jan Hus, came to Constance to offer assistance. But he was similarly arrested, judged, found guilty of heresy and turned over to the same secular court, with the same outcome as Hus. Poggio Bracciolini attended the council and related the unfairness of the process against Jerome.William Shepherd, The Life of Poggio Bracciolini, 1837, Ch. II, p. 68-81. [https://play.google.com/books/reader?idF40NAAAAQAAJ&printsec\nfrontcover&outputreader&authuser\n0&hlen&pg\nGBS.PA81 Google Play Book]\n\nPaweł Włodkowic and all the Polish representation to the Council of Constance publicly defended Jan Hus.\n\nPolish–Lithuanian–Teutonic conflict\n\nIn 1411, the First Peace of Thorn ended the Polish–Lithuanian–Teutonic War, in which the Teutonic Knights fought the Kingdom of Poland and Grand Duchy of Lithuania. However, the peace was not stable and further conflicts arose regarding demarcation of the Samogitian borders. The tensions erupted into the brief Hunger War in summer 1414. It was concluded that the disputes would be mediated by the Council of Constance.\n\nThe Polish position was defended by Paulus Vladimiri, rector of the Jagiellonian University, who challenged legality of the Teutonic crusade. He argued that a forced conversion was incompatible with free will, which was an essential component of a genuine conversion. Therefore, the Knights could only wage a defensive war if pagans violated natural rights of the Christians. Vladimiri further stipulated that infidels had rights which had to be respected, and neither the Pope nor the Holy Roman Emperor had the authority to violate them. Poles and Lithuanians also brought a group of Samogitian representatives to testify of atrocities committed by the Knights.\n\nThe Dominican theologian John of Falkenberg proved to be the fiercest opponent of the Poles. In his Liber de doctrina, Falkenberg argued that \"the Emperor has the right to slay even peaceful infidels simply because they are pagans.\" The Poles deserve death for defending infidels, and should be exterminated even more than the infidels; they should be deprived of their sovereignty and reduced to slavery.\" In Satira, he attacked Polish King Jogaila, calling him a \"mad dog\" unworthy to be king. Falkenberg was condemned and imprisoned for such libel, but was not officially accused of heresy. Other opponents included Grand Master's proctor Peter Wormditt, Dominic of San Gimignano, John Urbach, Ardecino de Porta of Novara, and Bishop of Ciudad Rodrigo Andrew Escobar. They argued that the Knights were perfectly justified in their crusade as it was a sacred duty of Christians to spread the true faith. Cardinal Pierre d'Ailly published an independent opinion that attempted to somewhat balance both Polish and Teutonic positions.\n\nThe council did not make any political decisions. It established the Diocese of Samogitia, with its seat in Medininkai and subordinated to Lithuanian dioceses, and appointed Matthias of Trakai as the first bishop. Pope Martin V appointed Polish King Jogaila and Lithuanian Grand Duke Vytautas as vicars general in Pskov and Veliky Novgorod in recognition of their Catholicism. After another round of futile negotiations, the Gollub War broke out in 1422. It ended with the Treaty of Melno. Polish-Teutonic wars continued for another hundred years. Council of Constance. http://en.wikipedia.org/?curid=7661."
  }
}
