{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13849",
  "eid" : "0e5b9760-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778533334,
  "textBody" : "The House of Hohenzollern is a dynasty of former princes, electors, kings and emperors of Hohenzollern, Brandenburg, Prussia, the German Empire, and Romania. The family arose in the area around the town of Hechingen in Swabia during the 11th century and took their name from Hohenzollern Castle.[http://www.britannica.com/EBchecked/topic/268949/Hohenzollern-Dynasty Encyclopædia Britannica. Hohenzollern Dynasty] The first ancestor of the Hohenzollerns was mentioned in 1061. \n\nThe Hohenzollern family split into two branches, the Catholic Swabian branch and the Protestant Franconian branch,Genealogisches Handbuch des Adels, Fürstliche Häuser XIX. \"Haus Hohenzollern\". C.A. Starke Verlag, 2011, pp. 30-33. . which later became the Brandenburg-Prussian branch. The Swabian branch ruled the principalities of Hohenzollern-Hechingen and Hohenzollern-Sigmaringen until 1849, and also ruled Romania from 1866 to 1947. Members of the Franconian branch became Margrave of Brandenburg in 1415 and Duke of Prussia in 1525.\n\nThe Margraviate of Brandenburg and the Duchy of Prussia were ruled in personal union after 1618 and were called Brandenburg-Prussia. The Kingdom of Prussia was created in 1701, eventually leading to the unification of Germany and the creation of the German Empire in 1871, with the Hohenzollerns as hereditary German Emperors and Kings of Prussia.\n\nGermany's defeat in World War I in 1918 led to the German Revolution. The Hohenzollerns were overthrown and the Weimar Republic was established, thus bringing an end to the German monarchy. Georg Friedrich, Prince of Prussia is the current head of the royal Prussian line, while Karl Friedrich, Prince of Hohenzollern is the head of the princely Swabian line.\n\nCounty of Zollern\n\nZollern, from 1218 Hohenzollern, was a county of the Holy Roman Empire. Later its capital was Hechingen.  \n\nThe Hohenzollerns named their estates after Hohenzollern Castle in the Swabian Alps. The Hohenzollern Castle lies on a 855 meters high mountain called Hohenzollern. It still belongs to the family today.\n\nThe dynasty was first mentioned in 1061. According to the medieval chronicler Berthold of Reichenau, Burkhard I, Count of Zollern (de Zolorin) was born before 1025 and died in 1061.[https://books.google.com/books?idp4uHav3mZLsC&pg\nPA364&dq%22The+Hohenzollern+dynasty+is%22&hl\nen&saX&ei\nrkzpU5nZIKLZ0QW3ioDgDA&ved0CDAQ6AEwAg#v\nonepage&q%22The%20Hohenzollern%20dynasty%20is%22&f\nfalse Jeep, John. Medieval Germany: An Encyclopedia] \n\nIn 1095 Count Adalbert of Zollern founded the Benedictine monastery of Alpirsbach, situated in the Black Forest.\n\nThe Zollerns received the comital title from Emperor Henry V in 1111.[http://fmg.ac/Projects/MedLands/SWABIAN%20NOBILITY.htm#_Toc359920275 Cawley, Charles. Swabia, Nobility] \n\nAs loyal vassals of the Swabian Hohenstaufen dynasty, they were able to significantly enlarge their territory. Count Frederick III (c. 1139 – c. 1200) accompanied Emperor Frederick Barbarossa against Henry the Lion in 1180, and through his marriage was granted the Burgraviate of Nuremberg by Emperor Henry VI in 1192. In about 1185 he married Sophia of Raabs, the daughter of Conrad II, Burgrave of Nuremberg. After the death of Conrad II who left no male heirs, Frederick III was granted Nuremberg as Burgrave Frederick I.\n\nIn 1218 the burgraviate passed to Frederick's younger son Conrad I, he thereby became the ancestor of the Franconian Hohenzollern branch, which acquired the Electorate of Brandenburg in 1415.\n\nCounts of Zollern (1061–1204)\n\n* until 1061: Burkhard I\n* before 1125: Frederick I\n* between ca. 1125 and 1142: Frederick II, eldest son of Frederick I\n* between ca. 1143 and 1150-1155: Burkhard II, 2nd oldest son of Frederick I\n* between ca. 1150-1155 and 1160: Gotfried of Zimmern, 4th oldest son of Frederick I\n* before 1171 – c. 1200: Frederick III/I (son of Frederick II, also Burgrave of Nuremberg)\n\nAfter Frederick's death, his sons partitioned the family lands between themselves:\n* Frederick IV received the county of Zollern and the burgraviate of Nuremberg in 1200 from his father, thereby founding the Swabian branch of the House of Hohenzollern. The Swabian line remains Catholic.\n* Conrad III received the burgraviate of Nuremberg from his brother Frederick IV in 1218, thereby founding the Franconian branch of the House of Hohenzollern. Members of the Franconian line eventually became the Brandenburg-Prussian branch. The Franconian line later converted to Protestantism.\n\nFranconian branch\n\nThe cadet Franconian branch of the House of Hohenzollern was founded by Conrad I, Burgrave of Nuremberg (1186-1261).\n\nThe family supported the Hohenstaufen and Habsburg rulers of the Holy Roman Empire during the 12th to 15th centuries, being rewarded with several territorial grants. Beginning in the 16th century, this branch of the family became Protestant and decided on expansion through marriage and the purchase of surrounding lands. \n\nIn the first phase, the family gradually added to their lands, at first with many small acquisitions in the Franconian region of Germany:\n* Ansbach in 1331\n* Kulmbach in 1340\n\nIn the second phase, the family expanded their lands further with large acquisitions in the Brandenburg and Prussian regions of Germany and current Poland:\n* Margraviate of Brandenburg in 1417\n* Duchy of Prussia in 1618\n\nThese acquisitions eventually transformed the Hohenzollerns from a minor German princely family into one of the most important dynasties in Europe.\n\nBurgraves of Nuremberg (1192–1427)\n\n* 1192–1200/1204: Frederick I (also count of Zollern as Frederick III)\n* 1204–1218: Frederick II (son of, also count of Zollern as Frederick IV)\n* 1218–1261/1262: Conrad I/III (brother of, also count of Zollern)\n* 1262–1297: Frederick III (c. 1220–1297), son of\n* 1297–1300: John I (c. 1279–1300), son of\n* 1300–1332: Frederick IV (1287–1332), brother of\n* 1332–1357: John II (c. 1309–1357), son of\n* 1357–1397: Frederick V (before 1333–1398), son of\n\nAt Frederick V's death on 21 January 1398, his lands were partitioned between his two sons:\n\n* 1397–1420: John III/I (son of, also Margrave of Brandenburg-Kulmbach)\n* 1397–1427: Frederick VI/I/I, (brother of, also Elector and Margrave of Brandenburg, also Margrave of Brandenburg-Ansbach and Brandenburg.Kulmbach)\n\nAfter John III/I's death on 11 June 1420, the margraviates of Brandenburg-Ansbach and Brandenburg-Kulmbach were briefly reunited under Frederick VI/I/I. He ruled the Margraviate of Brandenburg-Ansbach after 1398. From 1420, he became Margrave of Brandenburg-Kulmbach. From 1411 Frederick VI became governor of Brandenburg and later Elector and Margrave of Brandenburg as Frederick I. Upon his death on 21 September 1440, his territories were divided among his sons:\n\n* Frederick II, Elector of Brandenburg\n* Albert III, Elector of Brandenburg and Margrave of Brandenburg-Ansbach\n* John II, Margrave of Brandenburg-Kulmbach\n\nIn 1427 Frederick, Elector of Brandenburg sold Nuremberg Castle and his rights as burgrave to the Imperial City of Nuremberg. The territories of Brandenburg-Ansbach and Brandenburg-Kulmbach remained possessions of the family, once parts of the Burgraviate of Nuremberg. \n\nFile:Burg Nürnberg 03.jpg|Nuremberg Castle (The Emperor's castle, left, and the Burgrave's castle, right)\nFile:Cadolzburg-burg-wseite-gesamt-v-nw.jpg|Cadolzburg Castle near Nuremberg (from 1260 seat of the Burgraves)\nFile:Heilsbronn_M%C3%BCnster_0592.jpg|Heilsbronn Abbey, which the Hohenzollerns used as the family burial place.\n\nMargraves of Brandenburg-Ansbach (1398–1791)\n\n* 1398–1440: Frederick I (also Margrave of Brandenburg-Kulmbach)\n* 1440–1486: Albert I/I/III Achilles (son of, also Margrave of Brandenburg-Kulmbach and Elector of Brandenburg)\n* 1486–1515: Frederick II/II  (son of, also Margrave of Brandenburg-Kulmbach)\n* 1515–1543: George I/I the Pious (son of, also Duke of Brandenburg-Jägerndorf)\n* 1543–1603: George Frederick I/I/I/I (son of, also Margrave of Brandenburg-Kulmbach, Duke of Brandenburg-Jägerndorf and Regent of Prussia)\n* 1603–1625: Joachim Ernst (1583–1625), son of John George of Brandenburg\n* 1625–1634: Frederick III (1616–1634), son of\n* 1634–1667: Albert II\n* 1667–1686: John Frederick (1654–1686), son of\n* 1686–1692: Christian I Albrecht\n* 1692–1703: George Frederick II/II (later Margrave of Brandenburg-Kulmbach)\n* 1703–1723: William Frederick (before 1686–1723), son of John Frederick\n* 1723–1757: Charles William (1712–1757), son of\n* 1757: Christian II Frederick (1757–1791) (son of, also Margrave of Brandenburg-Kulmbach)\n\nOn 2 December 1791, Christian II Frederick sold the sovereignty of his principalities to King Frederick William II of Prussia.\n\nMargraves of Brandenburg-Kulmbach (1398–1604), later Brandenburg-Bayreuth (1604–1791)\n\n* 1398–1420: John I (c. 1369–1420), son of Frederick V of Nuremberg\n* 1420–1440: Frederick I (also Margrave of Brandenburg-Ansbach)\n* 1440–1457: John II (1406–1464), son of\n* 1457–1486: Albert I/I/III Achilles (also Margrave of Brandenburg-Ansbach and Elector of Brandenburg)\n* 1486–1495: Siegmund (1468–1495), son of\n* 1495–1515: Frederick II/II (also Margrave of Brandenburg-Ansbach)\n* 1515–1527: Casimir (1481–1527), son of\n* 1527–1553: Albert II Alcibiades (1522–1557), son of\n* 1553–1603: George Frederick I/I/I/I (also Margrave of Brandenburg-Ansbach, Duke of Brandenburg-Jägerndorf and Regent of Prussia)\n* 1603–1655: Christian I (1581–1655), son of John George,of Brandenburg\n* 1655–1712: Christian II Ernst (1644–1712), son of Erdmann August \n* 1712–1726: George I William (1678–1726), son of \n* 1726–1735: George Frederick II/II (previously Margrave of Kulmbach)\n* 1735–1763: Frederick IV (1711–1763), son of \n* 1763–1769: Frederick V Christian (1708–1769), son of Christian Heinrich\n* 1769–1791: Charles Alexander (also Margrave of Brandenburg-Ansbach)\n\nOn 2 December 1791, Charles Alexander sold the sovereignty of his principalities to King Frederick William II of Prussia.\n\nFrom 8 January 1701 the title of Elector of Brandenburg was attached to the title of King in Prussia and, from 13 September 1772, to that of King of Prussia.\n\nDukes of Jägerndorf (1523–1622)\n\nThe Duchy of Jägerndorf (Krnov) was purchased in 1523.\n* 1541–1543: George I the Pious (also Margrave of Brandenburg-Ansbach)\n* 1543–1603: George Frederick I (also Margrave of Brandenburg-Ansbach, Margrave of Brandenburg-Kulmbach and Regent of Prussia)\n* 1603–1606: Joachim I  (also Regent of Prussia and Elector of Brandenburg)\n* 1606–1621: Johann Georg von Brandenburg\n\nThe duchy of Jägerndorf was confiscated by Emperor Ferdinand III in 1622.\n\nBrandenburg-Prussian branch\n\nMargraves of Brandenburg (1415–1619)\n\nIn 1411 Frederick VI, Burgrave of Nuremberg was appointed governor of Brandenburg in order to restore order and stability. At the Council of Constance in 1415, King Sigismund elevated Frederick to the rank of Elector and Margrave of Brandenburg as Frederick I.\n\nMargraves of Brandenburg-Küstrin (1535–1571)\n\nThe short-lived Margraviate of Brandenburg-Küstrin was set up as a secundogeniture of the House of Hohenzollern.\n\n* 1535–1571: John the Wise, Margrave of Brandenburg-Küstrin  (son of Joachim I Nestor, Elector of Brandenburg. He died without issue. The Margraviate of Brandenburg-Küstrin was absorbed in 1571 into Brandenburg.\n\nMargraves of Brandenburg-Schwedt (1688–1788)\n\nAlthough recognised as a branch of the dynasty since 1688, the Margraviate of Brandenburg-Schwedt remained subordinate to the electors, and was never an independent principality.\n* 1688–1711: Philip William, Prince in Prussia, Margrave of Brandenburg-Schwedt (son of Frederick William, Elector of Brandenburg)\n* 1731–1771: Frederick William, Prince in Prussia, Margrave of Brandenburg-Schwedt (son of)\n* 1771–1788: Frederick Henry, Prince in Prussia, Margrave of Brandenburg Schwedt (brother of)\n\nDukes of Prussia (1525–1701)\n\nIn 1525 the Duchy of Prussia was established as a fief of the King of Poland. Albert of Prussia was the last Grand Master of the Teutonic Knights and the first Duke of Prussia. He belonged to the Ansbach branch of the dynasty. The Duchy of Prussia adopted Protestantism as the official state religion. \n* 1525–1568: Albert I\n* 1568–1618: Albert II Frederick co-heir (son of)\n* 1568–1571: Joachim I/II Hector co-heir  (also Elector of Brandenburg)\n** 1578–1603: George Frederick I/I/I/I (Regent, also Margrave of Brandenburg-Ansbach, Margrave of Brandenburg-Kulmbach and Duke of Brandenburg-Jägerndorf)\n** 1603–1608: Joachim I/I/III Frederick (Regent, also Duke of Brandenburg-Jägerndorf and Elector of Brandenburg)\n** 1608–1618: John Sigismund (Regent, also Elector of Brandenburg)\n* 1618–1619: John Sigismund (Regent, also Elector of Brandenburg, after 1618 Brandenburg-Prussia)\n* 1619–1640: George William I/I (son of, also Elector of Brandenburg)\n* 1640–1688: Frederick I/III William the Great Elector (son of, also Elector of Brandenburg)\n* 1688–1701: Frederick II/IV/I (also Elector of Brandenburg and King in Prussia)\n\nFrom 1701 the title of Duke of Prussia was attached to the title of King in and of Prussia.\n\nKings in Prussia (1701–1772)\n\nIn 1701 the title of King in Prussia was granted, without the Duchy of Prussia being elevated to a Kingdom within the Holy Roman Empire. From 1701 onwards the titles of Duke of Prussia and Elector of Brandenburg were always attached to the title of King in Prussia. The Duke of Prussia adopted the title of king as Frederick I, establishing his status as a monarch whose royal territory lay outside the boundaries of the Holy Roman Empire, with the assent of Emperor Leopold I: Frederick could not be \"King of Prussia\" because part of Prussia's lands were under the suzerainty of the Crown of the Kingdom of Poland. In the age of absolutism, most monarchs were obsessed with the desire to emulate Louis XIV of France with his luxurious palace at Versailles.\n\nIn 1772 the Duchy of Prussia was elevated to a kingdom.\n\nKings of Prussia (1772–1918)\n\nFrederick William's successor, Frederick the Great gained Silesia in the Silesian Wars so that Prussia emerged as a great power. The king was strongly influenced by French culture and civilization and preferred the French language.\n\nIn 1772 the title King of Prussia was assumed. From 1772 onwards the titles of Duke of Prussia and Elector of Brandenburg were always attached to the title King of Prussia.\n\nIn 1871 the Kingdom of Prussia became a constituent member of the German Empire.\n\nGerman Emperors (1871–1918)\n\nIn 1871 the German Empire was proclaimed. With the accession of William I to the newly established imperial German throne, the titles of King of Prussia, Duke of Prussia and Elector of Brandenburg were always attached to the title of German Emperor.\n\nPrussia's Minister President Otto von Bismarck convinced William that German Emperor instead of Emperor of Germany would be appropriate. He became primus inter pares among other German sovereigns.\n\nWilliam II intended to develop a German navy capable of challenging Britain's Royal Navy. The assassination of Archduke Franz Ferdinand of Austria on 28 June 1914 set off the chain of events that led to World War I. As a result of the war, the German, Russian, Austro-Hungarian and Ottoman empires ceased to exist.\n\nIn 1918 the German empire was abolished and replaced by the Weimar Republic. After the outbreak of the German revolution in 1918, both Emperor Wilhelm II and Crown Prince Wilhelm signed the document of abdication.\n\nFile:Wilhelm1.jpg|William I (1871–1888)\nFile:FriedIII.jpg|Frederick III (1888)\nFile:Bundesarchiv Bild 146-2004-0096, Kaiser Wilhelm II..jpg|Wilhelm II (1888–1918)\n\nBrandenburg-Prussian branch since 1918 abdication\n\nIn June 1926, a referendum on expropriating the formerly ruling princes of Germany without compensation failed and as a consequence, the financial situation of the Hohenzollern family improved considerably. A settlement between the state and the family made Cecilienhof property of the state but granted a right of residence to Crown Prince Wilhelm and his wife Cecilie. The family also kept the ownership of Monbijou Palace in Berlin, Oleśnica Castle in Silesia, Rheinsberg Palace, Schwedt Palace and other property until 1945. \n\nSince the abolition of the German monarchy, no Hohenzollern claims to imperial or royal prerogatives are recognised by Germany's Basic Law for the Federal Republic of Germany of 1949, which guarantees a republic.\n\nThe communist government of the Soviet occupation zone depropriated all landowners and industrialists; the House of Hohenzollern lost almost all of its fortune, retaining a few company shares and Hohenzollern Castle in West Germany. The Polish government appropriated the Silesian property and the Dutch government seized Huis Doorn, the Emperor's seat in exile. \n\nAfter German reunification however, the family was legally able to re-claim their portable property, namely art collections and parts of the interior of their former palaces. Negotiations on the return of or compensation for these assets are not yet completed. \n\nBerlin's old City Palace is being rebuilt and is scheduled to open in 2019. The Berlin Palace and the Humboldt Forum are located in the middle of Berlin. \n\nOrder of succession\n\nThe head of the house is the titular King of Prussia and German Emperor. He also bears a historical claim to the title of Prince of Orange. Members of this line style themselves princes of Prussia. \n\nGeorg Friedrich, Prince of Prussia, the current head of the royal Prussian House of Hohenzollern, was married to Princess Sophie of Isenburg on 27 August 2011. On 20 January 2013, she gave birth to twin sons, Carl Friedrich Franz Alexander and Louis Ferdinand Christian Albrecht, in Bremen. Carl Friedrich, the elder of the two, is the heir apparent.\n\nFile:Kronprinz Wilhelm 1. Leib-Husarenregiment.jpg|William\nFile:Louis ferdinand c1930.jpg|Louis Ferdinand\nFile:Georg Friedrich Prinz von Preussen.jpg|Georg Friedrich\n\nRoyal House of Hohenzollern table\n\nSwabian branch\n\nThe senior SwabianHeraldry of the Royal Families of Europe, Jiří Louda & Michael Maclagan, 1981, pp. 178-179. branch of the House of Hohenzollern was founded by Frederick IV, Count of Zollern. The family ruled three territories with seats at, respectively, Hechingen, Sigmaringen and Haigerloch. The counts were elevated to princes in 1623. The Swabian branch of the Hohenzollerns was Roman Catholic.\n\nAffected by economic problems and internal feuds, the Hohenzollern counts from the 14th century onwards came under pressure by their neighbors, the Counts of Württemberg and the cities of the Swabian League, whose troops besieged and finally destroyed Hohenzollern Castle in 1423. Nevertheless, the Hohenzollerns retained their estates, backed by their Brandenburg cousins and the Imperial House of Habsburg. In 1535, Count Charles I of Hohenzollern (1512–1576) received the counties of Sigmaringen and Veringen as Imperial fiefs.\n\nIn 1576, when Charles I, Count of Hohenzollern died, his county was divided to form the three Swabian branches. Eitel Frederick IV took Hohenzollern with the title of Hohenzollern-Hechingen, Karl II took Sigmaringen and Veringen, and Christopher got Haigerloch. Christopher's family died out in 1634.\n\n* Eitel Frederick IV of Hohenzollern-Hechingen (1545–1605)\n* Charles II of Hohenzollern-Sigmaringen (1547–1606)\n* Christopher of Hohenzollern-Haigerloch (1552–1592)\n\nIn 1695, the remaining two Swabian branches entered into an agreement with the Margrave of Brandenburg which provided that if both branches became extinct, the principalities should fall to Brandenburg. Because of the Revolutions of 1848, Constantine, Prince of Hohenzollern-Hechingen and Karl Anton, Prince of Hohenzollern-Sigmaringen abdicated their thrones in December 1849. The principalities were ruled by the Kings of Prussia from December 1849 onward, with the Hechingen and Sigmaringen branches obtaining official treatment as cadets of the Prussian royal family.\n\nThe Hohenzollern-Hechingen branch became extinct in 1869. A descendent of this branch was Countess Sophie Chotek, morganatic wife of Archduke Franz Ferdinand of Austria-Este.\n\nFile:Sigmaringen Schloss 2015-04-29 15-52-34.jpg|Sigmaringen Castle\nFile:2011-07-17-hechingen-by-RalfR-006.jpg|The New Castle, Hechingen\nFile:Schlosskirche Haigerloch 2010.JPG|Haigerloch Castle\n\nCounts of Hohenzollern (1204–1575)\n\nIn 1204, the County of Hohenzollern was established out of the fusion of the County of Zollern and the Burgraviate of Nuremberg. The Swabian branch inherited the county of Zollern and, being descended from Frederick I of Nuremberg, were all named \"Friedrich\" down through the 11th generation. Each one's numeral is counted from the first Friedrich to rule his branch's appanage. \n\nThe most senior of these in the 12th century, Count Frederick VIII (d. 1333), had two sons, the elder of whom became Frederick IX (d. 1379), first Count of Hohenzollern, and fathered Friedrich X who left no sons when he died in 1412. \n\nBut the younger son of Friedrich VIII, called Friedrich of Strassburg, uniquely, took no numeral of his own, retaining the old title \"Count of Zollern\" and pre-deceased his brother in 1364/65. Prince Wilhelm Karl zu Isenburg's 1957 genealogical series, Europäische Stammtafeln, says Friedrich of Strassburg shared, rather, in the rule of Zollern with his elder brother until his premature death. \n\nIt appears, but is not stated, that Strassburg's son became the recognized co-ruler of his cousin Friedrich X (as compensation for having received no appanage and/or because of incapacity on the part of Friedrich X) and, as such, assumed (or is, historically, attributed) the designation Frederick XI although he actually pre-deceased Friedrich X, dying in 1401. \n\nFriedrich XI, however, left two sons who jointly succeeded their cousin-once-removed, being Count Frederick XII (d. childless 1443) and Count Eitel Friedrich I (d. 1439), the latter becoming the ancestor of all subsequent branches of the Princes of Hohenzollern.\n\n* 1204–1251/1255: Frederick IV, also Burgrave of Nuremberg as Frederick II until 1218\n\n* 1251/1255–1289: Frederick V\n* 1289–1298: Frederick VI (d. 1298), son of\n* 1298–1309: Frederick VII (d. after 1309), son of \n* 1309–1333: Frederick VIII (d. 1333), brother of \n* 1333–1377: Frederick IX\n* 1377–1401: Frederick XI\n* 1401–1426: Frederick XII\n* 1426–1439: Eitel Frederick I, brother of\n* 1433–1488: Jobst Nicholas I (1433–1488), son of\n* 1488–1512: Eitel Frederick II (c. 1452–1512), son of\n* 1512–1525: Eitel Frederick III (1494–1525), son of\n* 1525–1575: Charles I (1516–1576), son of\n\nIn the 12th century, a son of Frederick I secured the county of Hohenberg. The county remained in the possession of the family until 1486. \n\nThe influence of the Swabian line was weakened by several partitions of its lands. In the 16th century, the situation changed completely when Eitel Frederick II, a friend and adviser of the emperor Maximilian I, received the district of Haigerloch. His grandson Charles I was granted the counties of Sigmaringen and Vehringen by Charles V.\n\nCounts, later Princes of Hohenzollern-Hechingen (1576–1849)\n\nThe County of Hohenzollern-Hechingen was established in 1576 with allodial rights. It included the original County of Zollern, with the Hohenzollern Castle and the monastery at Stetten.\n\nIn December 1849, the ruling princes of both Hohenzollern-Hechingen and Hohenzollern-Sigmaringen abdicated their thrones, and their principalities were incorporated as the Prussian province of Hohenzollern. The Hechingen branch became extinct in dynastic line with Konstantin's death in 1869.\n\nCounts of Hohenzollern-Haigerloch (1576–1634 and 1681–1767)\n\nThe County of Hohenzollern-Haigerloch was established in 1576 without allodial rights.\n\n* 1576–1601 : Christopher (1552–1592), son of Charles I of Hohenzollern\n* 1601–1623 : John Christopher (1586–1620), son of \n* 1601–1634 : Charles (1588–1634)\n\nBetween 1634 and 1681, the county was temporarily integrated into the principality of Hohenzollern-Sigmaringen.\n\n* 1681–1702: Francis Anthony, Count of Hohenzollern-Haigerloch\n* 1702–1750: Ferdinand Leopold, Count of Hohenzollern-Sigmaringen\n* 1750–1767: Francis Christopher Anton, Count of Hohenzollern-Sigmaringen\n\nUpon the death of Francis Christopher Anton in 1767, the Haigerloch territory was incorporated into the principality of Hohenzollern-Sigmaringen.\n\nCounts, later Princes of Hohenzollern-Sigmaringen (1576–1849)\n\nThe County of Hohenzollern-Sigmaringen was established in 1576 with allodial rights and a seat at Sigmaringen Castle.\n\nIn December 1849, sovereignty over the principality was yielded to the Franconian branch of the family and incorporated into the Kingdom of Prussia, which accorded status as cadets of the Prussian Royal Family to the Swabian Hohenzollerns. The last ruling Prince of Hohenzollern-Sigmaringen, Karl Anton, would later serve as Minister President of Prussia between 1858 and 1862.\n\nHouse of Hohenzollern-Sigmaringen after 1849\n\nThe family continued to use the title of Prince of Hohenzollern-Sigmaringen. After the Hechingen branch became extinct in 1869, the Sigmaringen branch adopted title of Prince of Hohenzollern.\n* 1849–1885: Karl Anton\n* 1885–1905: Leopold (1835–1905), son of\n* 1905–1927: William (1864–1927), son of\n* 1927–1965: Frederick (1891–1965), son of \n* 1965–2010: Friedrich Wilhelm (1924–2010), son of \n* 2010–present: Karl Friedrich\n* heir apparent: Alexander\n\nIn 1866, Prince Charles of Hohenzollern-Sigmaringen was chosen prince of Romania, becoming King Carol I of Romania in 1881.\n\nCharles's elder brother, Leopold, Prince of Hohenzollern, was offered the Spanish throne after a revolt exiled Isabella II in 1870. Although encouraged by Bismarck to accept, Leopold declined in the face of French opposition. Nonetheless, Bismarck altered and then published the Ems telegram to create a casus belli: France declared war, but Bismarck's Germany won the Franco-Prussian War.\n\nThe head of the Sigmaringen branch (the only extant line of the Swabian branch of the dynasty) is Karl Friedrich, styled His Serene Highness The Prince of Hohenzollern. His official seat is Sigmaringen Castle.\n\nKings of the Romanians\n\nReigning (1866–1947)\n\nThe Principality of Romania was established in 1862, after the Ottoman vassal states of Wallachia and Moldavia had been united in 1859 under Alexandru Ioan Cuza as Prince of Romania in a personal union. He was deposed in 1866 by the Romanian parliament.\n\nPrince Charles of Hohenzollern-Sigmaringen was invited to become reigning Prince of Romania in 1866. In 1881 he became Carol I, King of the Romanians. Carol I had an only daughter who died young, so the younger son of his brother Leopold, Prince Ferdinand of Hohenzollern-Sigmaringen, would succeed his uncle as King of the Romanians in 1914, and his descendants, having converted to the Orthodox Church, continued to reign there until the end of the monarchy in 1947.\n\nSuccession since 1947\n\nIn 1947 the Kingdom of Romania was abolished and replaced with the People's Republic of Romania. Michael did not press his claim to the defunct Romanian throne and although he was welcomed back to the country after half a century in exile as a private citizen, with substantial former royal properties being placed at his disposal. However, his dynastic claim was not recognised by post-Communist Romanians. \n\nOn 10 May 2011, Michael severed the dynastic ties between the House of Romania and the House of Hohenzollern.\nAfter that the branch of the Hohenzollerns was dynastically represented only by the last king Michael, and his daughters. Having no sons, he declared that his dynastic heir, instead of being a male member of the Hohenzollern-Sigmaringen princely family to which he belongs patrilineally and in accordance with the last Romanian monarchical constitution, should be his eldest daughter Margareta.[https://translate.google.com/translate?hlen&sl\nro&tlen&u\nhttp%3A%2F%2Fwww.adevarul.ro%2Flocale%2Fbucuresti%2FBucuresti-_Regele_Mihai_I_anunta_ruperea_tuturor_legaturilor_istorice_si_dinastice_cu_Casa_de_Hohenzollern_0_478152444.html \"King Michael I broke ties with historical and dynastic House of Hohenzollern\" in Adevarul - News Bucharest, 10 May 2011]\n\nThe royal house is still very popularhttps://www.economist.com/blogs/eastern-approaches/2011/10/romanias-ex-monarchy Long live the ex-king and in 2014 Prime Minister Victor Ponta promised a referendum on whether or not to reinstate the monarchy if he were re-elected.http://royalcentral.co.uk/foreignroyals/romania-may-hold-a-referendum-on-the-return-of-monarchy-38884 Romania may hold a referendum on the return of Monarchy\n\nPalaces of the Prussian Hohenzollerns\n\nSome important castles and palaces of the Prussian Hohenzollerns were:\n\nFile:BurgHohenzollernInnenhof02.jpg|Hohenzollern Castle\nFile:Berlin Stadtschloss 1920er.jpg|City Palace, Berlin\nFile:Berlin Stadtschloss Luftaufnahme.jpg|City Palace, Berlin\nFile:Charlottenburg Hohenzollern 2.jpg|Charlottenburg Palace, Berlin\nFile:Königsberg Castle courtyard.jpg|Königsberg Castle, Prussia\nFile:Bundesarchiv Bild 170-237, Potsdam, Stadtschloss vom Turm der Nikolaikirche.jpg|City Palace, Potsdam\nFile:Potsdam Sanssouci 07-2017 img4.jpg|New Palace, Potsdam\nFile:Schloss Sanssouci 2014.jpg|Sanssouci in Potsdam\nFile:Marmorpalais.jpg|Marmorpalais, Potsdam\nFile:BabelsbergP1020137.jpg|Babelsberg Palace, Potsdam\nFile:Schloss Cecilienhof .jpg|Cecilienhof Palace, Potsdam\nFile:Schloss Oranienburg - Jan 2013.jpg|Oranienburg Palace\nFile:Rheinsberg Castle.jpg|Rheinsberg Palace\nFile:Wrocław Kazimierza Wielkiego 35 sm.jpg|Wrocław Palace, Silesia\nFile:3273viki Zamek w Oleśnicy. Foto Barbara Maliszewska.jpg|Oels Castle, Silesia\nFile:Schloss Stolzenfels 01 Koblenz 2015.jpg|Stolzenfels Castle, Koblenz\n\nPalaces of the Frankonian branches \n\nFile:Plassenburg oben.jpg|Plassenburg Castle at Kulmbach\nFile:Neues schloß bayreuth.JPG|The New Castle at Bayreuth\nFile:Ansbach - 2013 Mattes (73).JPG|Residenz Ansbach \nFile:Erlangen Schloss 006.JPG|Erlangen Castle \n\nCoats of arms\n\nFile:Hohenzollern Haus Wappen.svg|Quartered coat of arms of the Hohenzollerns\nFile:Zollern ZW.png|Counts of Zollern (1340)\nFile:Nürenberg ZW.png|Burgraves of Nuremberg (1340)\nFile:COA family de Burggrafen von Nürnberg (Haus Hohenzollern).svg|Burgraves of Nuremberg\nFile:Wappen Deutsches Reich - Reichswappen (Grosses).svg|The greater coat of arms of the German Emperor\nFile:Hohenzollern.jpg|The princely Swabian branch (1605)\n\nMembers of the family after abdication\n\nRoyal Prussian branch\n\n* Prince Franz Wilhelm of Prussia (1943–)\n* Prince Frederick of Prussia (1911–1966)\n* Georg Friedrich, Prince of Prussia (1976–)\n* Prince Hubertus of Prussia (1909–1950)\n* Princess Kira of Prussia (1943–2004)\n* Louis Ferdinand, Prince of Prussia (1907–1994)\n* Prince Louis Ferdinand of Prussia (1944–1977)\n* Prince Michael of Prussia (1940–2014)\n* Prince Oskar of Prussia (1959–)\n* Wilhelm, Prince of Prussia (1882-1951)\n* Prince Wilhelm of Prussia (1906–1940)\n* Prince Wilhelm-Karl of Prussia (1922–2007)\n\nPrincely Swabian branch\n\n* Alexander, Prince of Hohenzollern (1987–)\n* Princess Augusta Victoria of Hohenzollern (1890–1966)\n* Prince Ferfried of Hohenzollern (1943–)\n* Frederick, Prince of Hohenzollern (1891–1965)\n* Friedrich Wilhelm, Prince of Hohenzollern (1924–2010)\n* Prince Johann Georg of Hohenzollern (1932–2016)\n* Karl Friedrich, Prince of Hohenzollern (1952–)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "House of Hohenzollern" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13849" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The House of Hohenzollern is a dynasty of former princes, electors, kings and emperors of Hohenzollern, Brandenburg, Prussia, the German Empire, and Romania. The family arose in the area around the town of Hechingen in Swabia during the 11th century and took their name from Hohenzollern Castle.[http://www.britannica.com/EBchecked/topic/268949/Hohenzollern-Dynasty Encyclopædia Britannica. Hohenzollern Dynasty] The first ancestor of the Hohenzollerns was mentioned in 1061. \n\nThe Hohenzollern family split into two branches, the Catholic Swabian branch and the Protestant Franconian branch,Genealogisches Handbuch des Adels, Fürstliche Häuser XIX. \"Haus Hohenzollern\". C.A. Starke Verlag, 2011, pp. 30-33. . which later became the Brandenburg-Prussian branch. The Swabian branch ruled the principalities of Hohenzollern-Hechingen and Hohenzollern-Sigmaringen until 1849, and also ruled Romania from 1866 to 1947. Members of the Franconian branch became Margrave of Brandenburg in 1415 and Duke of Prussia in 1525.\n\nThe Margraviate of Brandenburg and the Duchy of Prussia were ruled in personal union after 1618 and were called Brandenburg-Prussia. The Kingdom of Prussia was created in 1701, eventually leading to the unification of Germany and the creation of the German Empire in 1871, with the Hohenzollerns as hereditary German Emperors and Kings of Prussia.\n\nGermany's defeat in World War I in 1918 led to the German Revolution. The Hohenzollerns were overthrown and the Weimar Republic was established, thus bringing an end to the German monarchy. Georg Friedrich, Prince of Prussia is the current head of the royal Prussian line, while Karl Friedrich, Prince of Hohenzollern is the head of the princely Swabian line.\n\nCounty of Zollern\n\nZollern, from 1218 Hohenzollern, was a county of the Holy Roman Empire. Later its capital was Hechingen.  \n\nThe Hohenzollerns named their estates after Hohenzollern Castle in the Swabian Alps. The Hohenzollern Castle lies on a 855 meters high mountain called Hohenzollern. It still belongs to the family today.\n\nThe dynasty was first mentioned in 1061. According to the medieval chronicler Berthold of Reichenau, Burkhard I, Count of Zollern (de Zolorin) was born before 1025 and died in 1061.[https://books.google.com/books?idp4uHav3mZLsC&pg\nPA364&dq%22The+Hohenzollern+dynasty+is%22&hl\nen&saX&ei\nrkzpU5nZIKLZ0QW3ioDgDA&ved0CDAQ6AEwAg#v\nonepage&q%22The%20Hohenzollern%20dynasty%20is%22&f\nfalse Jeep, John. Medieval Germany: An Encyclopedia] \n\nIn 1095 Count Adalbert of Zollern founded the Benedictine monastery of Alpirsbach, situated in the Black Forest.\n\nThe Zollerns received the comital title from Emperor Henry V in 1111.[http://fmg.ac/Projects/MedLands/SWABIAN%20NOBILITY.htm#_Toc359920275 Cawley, Charles. Swabia, Nobility] \n\nAs loyal vassals of the Swabian Hohenstaufen dynasty, they were able to significantly enlarge their territory. Count Frederick III (c. 1139 – c. 1200) accompanied Emperor Frederick Barbarossa against Henry the Lion in 1180, and through his marriage was granted the Burgraviate of Nuremberg by Emperor Henry VI in 1192. In about 1185 he married Sophia of Raabs, the daughter of Conrad II, Burgrave of Nuremberg. After the death of Conrad II who left no male heirs, Frederick III was granted Nuremberg as Burgrave Frederick I.\n\nIn 1218 the burgraviate passed to Frederick's younger son Conrad I, he thereby became the ancestor of the Franconian Hohenzollern branch, which acquired the Electorate of Brandenburg in 1415.\n\nCounts of Zollern (1061–1204)\n\n* until 1061: Burkhard I\n* before 1125: Frederick I\n* between ca. 1125 and 1142: Frederick II, eldest son of Frederick I\n* between ca. 1143 and 1150-1155: Burkhard II, 2nd oldest son of Frederick I\n* between ca. 1150-1155 and 1160: Gotfried of Zimmern, 4th oldest son of Frederick I\n* before 1171 – c. 1200: Frederick III/I (son of Frederick II, also Burgrave of Nuremberg)\n\nAfter Frederick's death, his sons partitioned the family lands between themselves:\n* Frederick IV received the county of Zollern and the burgraviate of Nuremberg in 1200 from his father, thereby founding the Swabian branch of the House of Hohenzollern. The Swabian line remains Catholic.\n* Conrad III received the burgraviate of Nuremberg from his brother Frederick IV in 1218, thereby founding the Franconian branch of the House of Hohenzollern. Members of the Franconian line eventually became the Brandenburg-Prussian branch. The Franconian line later converted to Protestantism.\n\nFranconian branch\n\nThe cadet Franconian branch of the House of Hohenzollern was founded by Conrad I, Burgrave of Nuremberg (1186-1261).\n\nThe family supported the Hohenstaufen and Habsburg rulers of the Holy Roman Empire during the 12th to 15th centuries, being rewarded with several territorial grants. Beginning in the 16th century, this branch of the family became Protestant and decided on expansion through marriage and the purchase of surrounding lands. \n\nIn the first phase, the family gradually added to their lands, at first with many small acquisitions in the Franconian region of Germany:\n* Ansbach in 1331\n* Kulmbach in 1340\n\nIn the second phase, the family expanded their lands further with large acquisitions in the Brandenburg and Prussian regions of Germany and current Poland:\n* Margraviate of Brandenburg in 1417\n* Duchy of Prussia in 1618\n\nThese acquisitions eventually transformed the Hohenzollerns from a minor German princely family into one of the most important dynasties in Europe.\n\nBurgraves of Nuremberg (1192–1427)\n\n* 1192–1200/1204: Frederick I (also count of Zollern as Frederick III)\n* 1204–1218: Frederick II (son of, also count of Zollern as Frederick IV)\n* 1218–1261/1262: Conrad I/III (brother of, also count of Zollern)\n* 1262–1297: Frederick III (c. 1220–1297), son of\n* 1297–1300: John I (c. 1279–1300), son of\n* 1300–1332: Frederick IV (1287–1332), brother of\n* 1332–1357: John II (c. 1309–1357), son of\n* 1357–1397: Frederick V (before 1333–1398), son of\n\nAt Frederick V's death on 21 January 1398, his lands were partitioned between his two sons:\n\n* 1397–1420: John III/I (son of, also Margrave of Brandenburg-Kulmbach)\n* 1397–1427: Frederick VI/I/I, (brother of, also Elector and Margrave of Brandenburg, also Margrave of Brandenburg-Ansbach and Brandenburg.Kulmbach)\n\nAfter John III/I's death on 11 June 1420, the margraviates of Brandenburg-Ansbach and Brandenburg-Kulmbach were briefly reunited under Frederick VI/I/I. He ruled the Margraviate of Brandenburg-Ansbach after 1398. From 1420, he became Margrave of Brandenburg-Kulmbach. From 1411 Frederick VI became governor of Brandenburg and later Elector and Margrave of Brandenburg as Frederick I. Upon his death on 21 September 1440, his territories were divided among his sons:\n\n* Frederick II, Elector of Brandenburg\n* Albert III, Elector of Brandenburg and Margrave of Brandenburg-Ansbach\n* John II, Margrave of Brandenburg-Kulmbach\n\nIn 1427 Frederick, Elector of Brandenburg sold Nuremberg Castle and his rights as burgrave to the Imperial City of Nuremberg. The territories of Brandenburg-Ansbach and Brandenburg-Kulmbach remained possessions of the family, once parts of the Burgraviate of Nuremberg. \n\nFile:Burg Nürnberg 03.jpg|Nuremberg Castle (The Emperor's castle, left, and the Burgrave's castle, right)\nFile:Cadolzburg-burg-wseite-gesamt-v-nw.jpg|Cadolzburg Castle near Nuremberg (from 1260 seat of the Burgraves)\nFile:Heilsbronn_M%C3%BCnster_0592.jpg|Heilsbronn Abbey, which the Hohenzollerns used as the family burial place.\n\nMargraves of Brandenburg-Ansbach (1398–1791)\n\n* 1398–1440: Frederick I (also Margrave of Brandenburg-Kulmbach)\n* 1440–1486: Albert I/I/III Achilles (son of, also Margrave of Brandenburg-Kulmbach and Elector of Brandenburg)\n* 1486–1515: Frederick II/II  (son of, also Margrave of Brandenburg-Kulmbach)\n* 1515–1543: George I/I the Pious (son of, also Duke of Brandenburg-Jägerndorf)\n* 1543–1603: George Frederick I/I/I/I (son of, also Margrave of Brandenburg-Kulmbach, Duke of Brandenburg-Jägerndorf and Regent of Prussia)\n* 1603–1625: Joachim Ernst (1583–1625), son of John George of Brandenburg\n* 1625–1634: Frederick III (1616–1634), son of\n* 1634–1667: Albert II\n* 1667–1686: John Frederick (1654–1686), son of\n* 1686–1692: Christian I Albrecht\n* 1692–1703: George Frederick II/II (later Margrave of Brandenburg-Kulmbach)\n* 1703–1723: William Frederick (before 1686–1723), son of John Frederick\n* 1723–1757: Charles William (1712–1757), son of\n* 1757: Christian II Frederick (1757–1791) (son of, also Margrave of Brandenburg-Kulmbach)\n\nOn 2 December 1791, Christian II Frederick sold the sovereignty of his principalities to King Frederick William II of Prussia.\n\nMargraves of Brandenburg-Kulmbach (1398–1604), later Brandenburg-Bayreuth (1604–1791)\n\n* 1398–1420: John I (c. 1369–1420), son of Frederick V of Nuremberg\n* 1420–1440: Frederick I (also Margrave of Brandenburg-Ansbach)\n* 1440–1457: John II (1406–1464), son of\n* 1457–1486: Albert I/I/III Achilles (also Margrave of Brandenburg-Ansbach and Elector of Brandenburg)\n* 1486–1495: Siegmund (1468–1495), son of\n* 1495–1515: Frederick II/II (also Margrave of Brandenburg-Ansbach)\n* 1515–1527: Casimir (1481–1527), son of\n* 1527–1553: Albert II Alcibiades (1522–1557), son of\n* 1553–1603: George Frederick I/I/I/I (also Margrave of Brandenburg-Ansbach, Duke of Brandenburg-Jägerndorf and Regent of Prussia)\n* 1603–1655: Christian I (1581–1655), son of John George,of Brandenburg\n* 1655–1712: Christian II Ernst (1644–1712), son of Erdmann August \n* 1712–1726: George I William (1678–1726), son of \n* 1726–1735: George Frederick II/II (previously Margrave of Kulmbach)\n* 1735–1763: Frederick IV (1711–1763), son of \n* 1763–1769: Frederick V Christian (1708–1769), son of Christian Heinrich\n* 1769–1791: Charles Alexander (also Margrave of Brandenburg-Ansbach)\n\nOn 2 December 1791, Charles Alexander sold the sovereignty of his principalities to King Frederick William II of Prussia.\n\nFrom 8 January 1701 the title of Elector of Brandenburg was attached to the title of King in Prussia and, from 13 September 1772, to that of King of Prussia.\n\nDukes of Jägerndorf (1523–1622)\n\nThe Duchy of Jägerndorf (Krnov) was purchased in 1523.\n* 1541–1543: George I the Pious (also Margrave of Brandenburg-Ansbach)\n* 1543–1603: George Frederick I (also Margrave of Brandenburg-Ansbach, Margrave of Brandenburg-Kulmbach and Regent of Prussia)\n* 1603–1606: Joachim I  (also Regent of Prussia and Elector of Brandenburg)\n* 1606–1621: Johann Georg von Brandenburg\n\nThe duchy of Jägerndorf was confiscated by Emperor Ferdinand III in 1622.\n\nBrandenburg-Prussian branch\n\nMargraves of Brandenburg (1415–1619)\n\nIn 1411 Frederick VI, Burgrave of Nuremberg was appointed governor of Brandenburg in order to restore order and stability. At the Council of Constance in 1415, King Sigismund elevated Frederick to the rank of Elector and Margrave of Brandenburg as Frederick I.\n\nMargraves of Brandenburg-Küstrin (1535–1571)\n\nThe short-lived Margraviate of Brandenburg-Küstrin was set up as a secundogeniture of the House of Hohenzollern.\n\n* 1535–1571: John the Wise, Margrave of Brandenburg-Küstrin  (son of Joachim I Nestor, Elector of Brandenburg. He died without issue. The Margraviate of Brandenburg-Küstrin was absorbed in 1571 into Brandenburg.\n\nMargraves of Brandenburg-Schwedt (1688–1788)\n\nAlthough recognised as a branch of the dynasty since 1688, the Margraviate of Brandenburg-Schwedt remained subordinate to the electors, and was never an independent principality.\n* 1688–1711: Philip William, Prince in Prussia, Margrave of Brandenburg-Schwedt (son of Frederick William, Elector of Brandenburg)\n* 1731–1771: Frederick William, Prince in Prussia, Margrave of Brandenburg-Schwedt (son of)\n* 1771–1788: Frederick Henry, Prince in Prussia, Margrave of Brandenburg Schwedt (brother of)\n\nDukes of Prussia (1525–1701)\n\nIn 1525 the Duchy of Prussia was established as a fief of the King of Poland. Albert of Prussia was the last Grand Master of the Teutonic Knights and the first Duke of Prussia. He belonged to the Ansbach branch of the dynasty. The Duchy of Prussia adopted Protestantism as the official state religion. \n* 1525–1568: Albert I\n* 1568–1618: Albert II Frederick co-heir (son of)\n* 1568–1571: Joachim I/II Hector co-heir  (also Elector of Brandenburg)\n** 1578–1603: George Frederick I/I/I/I (Regent, also Margrave of Brandenburg-Ansbach, Margrave of Brandenburg-Kulmbach and Duke of Brandenburg-Jägerndorf)\n** 1603–1608: Joachim I/I/III Frederick (Regent, also Duke of Brandenburg-Jägerndorf and Elector of Brandenburg)\n** 1608–1618: John Sigismund (Regent, also Elector of Brandenburg)\n* 1618–1619: John Sigismund (Regent, also Elector of Brandenburg, after 1618 Brandenburg-Prussia)\n* 1619–1640: George William I/I (son of, also Elector of Brandenburg)\n* 1640–1688: Frederick I/III William the Great Elector (son of, also Elector of Brandenburg)\n* 1688–1701: Frederick II/IV/I (also Elector of Brandenburg and King in Prussia)\n\nFrom 1701 the title of Duke of Prussia was attached to the title of King in and of Prussia.\n\nKings in Prussia (1701–1772)\n\nIn 1701 the title of King in Prussia was granted, without the Duchy of Prussia being elevated to a Kingdom within the Holy Roman Empire. From 1701 onwards the titles of Duke of Prussia and Elector of Brandenburg were always attached to the title of King in Prussia. The Duke of Prussia adopted the title of king as Frederick I, establishing his status as a monarch whose royal territory lay outside the boundaries of the Holy Roman Empire, with the assent of Emperor Leopold I: Frederick could not be \"King of Prussia\" because part of Prussia's lands were under the suzerainty of the Crown of the Kingdom of Poland. In the age of absolutism, most monarchs were obsessed with the desire to emulate Louis XIV of France with his luxurious palace at Versailles.\n\nIn 1772 the Duchy of Prussia was elevated to a kingdom.\n\nKings of Prussia (1772–1918)\n\nFrederick William's successor, Frederick the Great gained Silesia in the Silesian Wars so that Prussia emerged as a great power. The king was strongly influenced by French culture and civilization and preferred the French language.\n\nIn 1772 the title King of Prussia was assumed. From 1772 onwards the titles of Duke of Prussia and Elector of Brandenburg were always attached to the title King of Prussia.\n\nIn 1871 the Kingdom of Prussia became a constituent member of the German Empire.\n\nGerman Emperors (1871–1918)\n\nIn 1871 the German Empire was proclaimed. With the accession of William I to the newly established imperial German throne, the titles of King of Prussia, Duke of Prussia and Elector of Brandenburg were always attached to the title of German Emperor.\n\nPrussia's Minister President Otto von Bismarck convinced William that German Emperor instead of Emperor of Germany would be appropriate. He became primus inter pares among other German sovereigns.\n\nWilliam II intended to develop a German navy capable of challenging Britain's Royal Navy. The assassination of Archduke Franz Ferdinand of Austria on 28 June 1914 set off the chain of events that led to World War I. As a result of the war, the German, Russian, Austro-Hungarian and Ottoman empires ceased to exist.\n\nIn 1918 the German empire was abolished and replaced by the Weimar Republic. After the outbreak of the German revolution in 1918, both Emperor Wilhelm II and Crown Prince Wilhelm signed the document of abdication.\n\nFile:Wilhelm1.jpg|William I (1871–1888)\nFile:FriedIII.jpg|Frederick III (1888)\nFile:Bundesarchiv Bild 146-2004-0096, Kaiser Wilhelm II..jpg|Wilhelm II (1888–1918)\n\nBrandenburg-Prussian branch since 1918 abdication\n\nIn June 1926, a referendum on expropriating the formerly ruling princes of Germany without compensation failed and as a consequence, the financial situation of the Hohenzollern family improved considerably. A settlement between the state and the family made Cecilienhof property of the state but granted a right of residence to Crown Prince Wilhelm and his wife Cecilie. The family also kept the ownership of Monbijou Palace in Berlin, Oleśnica Castle in Silesia, Rheinsberg Palace, Schwedt Palace and other property until 1945. \n\nSince the abolition of the German monarchy, no Hohenzollern claims to imperial or royal prerogatives are recognised by Germany's Basic Law for the Federal Republic of Germany of 1949, which guarantees a republic.\n\nThe communist government of the Soviet occupation zone depropriated all landowners and industrialists; the House of Hohenzollern lost almost all of its fortune, retaining a few company shares and Hohenzollern Castle in West Germany. The Polish government appropriated the Silesian property and the Dutch government seized Huis Doorn, the Emperor's seat in exile. \n\nAfter German reunification however, the family was legally able to re-claim their portable property, namely art collections and parts of the interior of their former palaces. Negotiations on the return of or compensation for these assets are not yet completed. \n\nBerlin's old City Palace is being rebuilt and is scheduled to open in 2019. The Berlin Palace and the Humboldt Forum are located in the middle of Berlin. \n\nOrder of succession\n\nThe head of the house is the titular King of Prussia and German Emperor. He also bears a historical claim to the title of Prince of Orange. Members of this line style themselves princes of Prussia. \n\nGeorg Friedrich, Prince of Prussia, the current head of the royal Prussian House of Hohenzollern, was married to Princess Sophie of Isenburg on 27 August 2011. On 20 January 2013, she gave birth to twin sons, Carl Friedrich Franz Alexander and Louis Ferdinand Christian Albrecht, in Bremen. Carl Friedrich, the elder of the two, is the heir apparent.\n\nFile:Kronprinz Wilhelm 1. Leib-Husarenregiment.jpg|William\nFile:Louis ferdinand c1930.jpg|Louis Ferdinand\nFile:Georg Friedrich Prinz von Preussen.jpg|Georg Friedrich\n\nRoyal House of Hohenzollern table\n\nSwabian branch\n\nThe senior SwabianHeraldry of the Royal Families of Europe, Jiří Louda & Michael Maclagan, 1981, pp. 178-179. branch of the House of Hohenzollern was founded by Frederick IV, Count of Zollern. The family ruled three territories with seats at, respectively, Hechingen, Sigmaringen and Haigerloch. The counts were elevated to princes in 1623. The Swabian branch of the Hohenzollerns was Roman Catholic.\n\nAffected by economic problems and internal feuds, the Hohenzollern counts from the 14th century onwards came under pressure by their neighbors, the Counts of Württemberg and the cities of the Swabian League, whose troops besieged and finally destroyed Hohenzollern Castle in 1423. Nevertheless, the Hohenzollerns retained their estates, backed by their Brandenburg cousins and the Imperial House of Habsburg. In 1535, Count Charles I of Hohenzollern (1512–1576) received the counties of Sigmaringen and Veringen as Imperial fiefs.\n\nIn 1576, when Charles I, Count of Hohenzollern died, his county was divided to form the three Swabian branches. Eitel Frederick IV took Hohenzollern with the title of Hohenzollern-Hechingen, Karl II took Sigmaringen and Veringen, and Christopher got Haigerloch. Christopher's family died out in 1634.\n\n* Eitel Frederick IV of Hohenzollern-Hechingen (1545–1605)\n* Charles II of Hohenzollern-Sigmaringen (1547–1606)\n* Christopher of Hohenzollern-Haigerloch (1552–1592)\n\nIn 1695, the remaining two Swabian branches entered into an agreement with the Margrave of Brandenburg which provided that if both branches became extinct, the principalities should fall to Brandenburg. Because of the Revolutions of 1848, Constantine, Prince of Hohenzollern-Hechingen and Karl Anton, Prince of Hohenzollern-Sigmaringen abdicated their thrones in December 1849. The principalities were ruled by the Kings of Prussia from December 1849 onward, with the Hechingen and Sigmaringen branches obtaining official treatment as cadets of the Prussian royal family.\n\nThe Hohenzollern-Hechingen branch became extinct in 1869. A descendent of this branch was Countess Sophie Chotek, morganatic wife of Archduke Franz Ferdinand of Austria-Este.\n\nFile:Sigmaringen Schloss 2015-04-29 15-52-34.jpg|Sigmaringen Castle\nFile:2011-07-17-hechingen-by-RalfR-006.jpg|The New Castle, Hechingen\nFile:Schlosskirche Haigerloch 2010.JPG|Haigerloch Castle\n\nCounts of Hohenzollern (1204–1575)\n\nIn 1204, the County of Hohenzollern was established out of the fusion of the County of Zollern and the Burgraviate of Nuremberg. The Swabian branch inherited the county of Zollern and, being descended from Frederick I of Nuremberg, were all named \"Friedrich\" down through the 11th generation. Each one's numeral is counted from the first Friedrich to rule his branch's appanage. \n\nThe most senior of these in the 12th century, Count Frederick VIII (d. 1333), had two sons, the elder of whom became Frederick IX (d. 1379), first Count of Hohenzollern, and fathered Friedrich X who left no sons when he died in 1412. \n\nBut the younger son of Friedrich VIII, called Friedrich of Strassburg, uniquely, took no numeral of his own, retaining the old title \"Count of Zollern\" and pre-deceased his brother in 1364/65. Prince Wilhelm Karl zu Isenburg's 1957 genealogical series, Europäische Stammtafeln, says Friedrich of Strassburg shared, rather, in the rule of Zollern with his elder brother until his premature death. \n\nIt appears, but is not stated, that Strassburg's son became the recognized co-ruler of his cousin Friedrich X (as compensation for having received no appanage and/or because of incapacity on the part of Friedrich X) and, as such, assumed (or is, historically, attributed) the designation Frederick XI although he actually pre-deceased Friedrich X, dying in 1401. \n\nFriedrich XI, however, left two sons who jointly succeeded their cousin-once-removed, being Count Frederick XII (d. childless 1443) and Count Eitel Friedrich I (d. 1439), the latter becoming the ancestor of all subsequent branches of the Princes of Hohenzollern.\n\n* 1204–1251/1255: Frederick IV, also Burgrave of Nuremberg as Frederick II until 1218\n\n* 1251/1255–1289: Frederick V\n* 1289–1298: Frederick VI (d. 1298), son of\n* 1298–1309: Frederick VII (d. after 1309), son of \n* 1309–1333: Frederick VIII (d. 1333), brother of \n* 1333–1377: Frederick IX\n* 1377–1401: Frederick XI\n* 1401–1426: Frederick XII\n* 1426–1439: Eitel Frederick I, brother of\n* 1433–1488: Jobst Nicholas I (1433–1488), son of\n* 1488–1512: Eitel Frederick II (c. 1452–1512), son of\n* 1512–1525: Eitel Frederick III (1494–1525), son of\n* 1525–1575: Charles I (1516–1576), son of\n\nIn the 12th century, a son of Frederick I secured the county of Hohenberg. The county remained in the possession of the family until 1486. \n\nThe influence of the Swabian line was weakened by several partitions of its lands. In the 16th century, the situation changed completely when Eitel Frederick II, a friend and adviser of the emperor Maximilian I, received the district of Haigerloch. His grandson Charles I was granted the counties of Sigmaringen and Vehringen by Charles V.\n\nCounts, later Princes of Hohenzollern-Hechingen (1576–1849)\n\nThe County of Hohenzollern-Hechingen was established in 1576 with allodial rights. It included the original County of Zollern, with the Hohenzollern Castle and the monastery at Stetten.\n\nIn December 1849, the ruling princes of both Hohenzollern-Hechingen and Hohenzollern-Sigmaringen abdicated their thrones, and their principalities were incorporated as the Prussian province of Hohenzollern. The Hechingen branch became extinct in dynastic line with Konstantin's death in 1869.\n\nCounts of Hohenzollern-Haigerloch (1576–1634 and 1681–1767)\n\nThe County of Hohenzollern-Haigerloch was established in 1576 without allodial rights.\n\n* 1576–1601 : Christopher (1552–1592), son of Charles I of Hohenzollern\n* 1601–1623 : John Christopher (1586–1620), son of \n* 1601–1634 : Charles (1588–1634)\n\nBetween 1634 and 1681, the county was temporarily integrated into the principality of Hohenzollern-Sigmaringen.\n\n* 1681–1702: Francis Anthony, Count of Hohenzollern-Haigerloch\n* 1702–1750: Ferdinand Leopold, Count of Hohenzollern-Sigmaringen\n* 1750–1767: Francis Christopher Anton, Count of Hohenzollern-Sigmaringen\n\nUpon the death of Francis Christopher Anton in 1767, the Haigerloch territory was incorporated into the principality of Hohenzollern-Sigmaringen.\n\nCounts, later Princes of Hohenzollern-Sigmaringen (1576–1849)\n\nThe County of Hohenzollern-Sigmaringen was established in 1576 with allodial rights and a seat at Sigmaringen Castle.\n\nIn December 1849, sovereignty over the principality was yielded to the Franconian branch of the family and incorporated into the Kingdom of Prussia, which accorded status as cadets of the Prussian Royal Family to the Swabian Hohenzollerns. The last ruling Prince of Hohenzollern-Sigmaringen, Karl Anton, would later serve as Minister President of Prussia between 1858 and 1862.\n\nHouse of Hohenzollern-Sigmaringen after 1849\n\nThe family continued to use the title of Prince of Hohenzollern-Sigmaringen. After the Hechingen branch became extinct in 1869, the Sigmaringen branch adopted title of Prince of Hohenzollern.\n* 1849–1885: Karl Anton\n* 1885–1905: Leopold (1835–1905), son of\n* 1905–1927: William (1864–1927), son of\n* 1927–1965: Frederick (1891–1965), son of \n* 1965–2010: Friedrich Wilhelm (1924–2010), son of \n* 2010–present: Karl Friedrich\n* heir apparent: Alexander\n\nIn 1866, Prince Charles of Hohenzollern-Sigmaringen was chosen prince of Romania, becoming King Carol I of Romania in 1881.\n\nCharles's elder brother, Leopold, Prince of Hohenzollern, was offered the Spanish throne after a revolt exiled Isabella II in 1870. Although encouraged by Bismarck to accept, Leopold declined in the face of French opposition. Nonetheless, Bismarck altered and then published the Ems telegram to create a casus belli: France declared war, but Bismarck's Germany won the Franco-Prussian War.\n\nThe head of the Sigmaringen branch (the only extant line of the Swabian branch of the dynasty) is Karl Friedrich, styled His Serene Highness The Prince of Hohenzollern. His official seat is Sigmaringen Castle.\n\nKings of the Romanians\n\nReigning (1866–1947)\n\nThe Principality of Romania was established in 1862, after the Ottoman vassal states of Wallachia and Moldavia had been united in 1859 under Alexandru Ioan Cuza as Prince of Romania in a personal union. He was deposed in 1866 by the Romanian parliament.\n\nPrince Charles of Hohenzollern-Sigmaringen was invited to become reigning Prince of Romania in 1866. In 1881 he became Carol I, King of the Romanians. Carol I had an only daughter who died young, so the younger son of his brother Leopold, Prince Ferdinand of Hohenzollern-Sigmaringen, would succeed his uncle as King of the Romanians in 1914, and his descendants, having converted to the Orthodox Church, continued to reign there until the end of the monarchy in 1947.\n\nSuccession since 1947\n\nIn 1947 the Kingdom of Romania was abolished and replaced with the People's Republic of Romania. Michael did not press his claim to the defunct Romanian throne and although he was welcomed back to the country after half a century in exile as a private citizen, with substantial former royal properties being placed at his disposal. However, his dynastic claim was not recognised by post-Communist Romanians. \n\nOn 10 May 2011, Michael severed the dynastic ties between the House of Romania and the House of Hohenzollern.\nAfter that the branch of the Hohenzollerns was dynastically represented only by the last king Michael, and his daughters. Having no sons, he declared that his dynastic heir, instead of being a male member of the Hohenzollern-Sigmaringen princely family to which he belongs patrilineally and in accordance with the last Romanian monarchical constitution, should be his eldest daughter Margareta.[https://translate.google.com/translate?hlen&sl\nro&tlen&u\nhttp%3A%2F%2Fwww.adevarul.ro%2Flocale%2Fbucuresti%2FBucuresti-_Regele_Mihai_I_anunta_ruperea_tuturor_legaturilor_istorice_si_dinastice_cu_Casa_de_Hohenzollern_0_478152444.html \"King Michael I broke ties with historical and dynastic House of Hohenzollern\" in Adevarul - News Bucharest, 10 May 2011]\n\nThe royal house is still very popularhttps://www.economist.com/blogs/eastern-approaches/2011/10/romanias-ex-monarchy Long live the ex-king and in 2014 Prime Minister Victor Ponta promised a referendum on whether or not to reinstate the monarchy if he were re-elected.http://royalcentral.co.uk/foreignroyals/romania-may-hold-a-referendum-on-the-return-of-monarchy-38884 Romania may hold a referendum on the return of Monarchy\n\nPalaces of the Prussian Hohenzollerns\n\nSome important castles and palaces of the Prussian Hohenzollerns were:\n\nFile:BurgHohenzollernInnenhof02.jpg|Hohenzollern Castle\nFile:Berlin Stadtschloss 1920er.jpg|City Palace, Berlin\nFile:Berlin Stadtschloss Luftaufnahme.jpg|City Palace, Berlin\nFile:Charlottenburg Hohenzollern 2.jpg|Charlottenburg Palace, Berlin\nFile:Königsberg Castle courtyard.jpg|Königsberg Castle, Prussia\nFile:Bundesarchiv Bild 170-237, Potsdam, Stadtschloss vom Turm der Nikolaikirche.jpg|City Palace, Potsdam\nFile:Potsdam Sanssouci 07-2017 img4.jpg|New Palace, Potsdam\nFile:Schloss Sanssouci 2014.jpg|Sanssouci in Potsdam\nFile:Marmorpalais.jpg|Marmorpalais, Potsdam\nFile:BabelsbergP1020137.jpg|Babelsberg Palace, Potsdam\nFile:Schloss Cecilienhof .jpg|Cecilienhof Palace, Potsdam\nFile:Schloss Oranienburg - Jan 2013.jpg|Oranienburg Palace\nFile:Rheinsberg Castle.jpg|Rheinsberg Palace\nFile:Wrocław Kazimierza Wielkiego 35 sm.jpg|Wrocław Palace, Silesia\nFile:3273viki Zamek w Oleśnicy. Foto Barbara Maliszewska.jpg|Oels Castle, Silesia\nFile:Schloss Stolzenfels 01 Koblenz 2015.jpg|Stolzenfels Castle, Koblenz\n\nPalaces of the Frankonian branches \n\nFile:Plassenburg oben.jpg|Plassenburg Castle at Kulmbach\nFile:Neues schloß bayreuth.JPG|The New Castle at Bayreuth\nFile:Ansbach - 2013 Mattes (73).JPG|Residenz Ansbach \nFile:Erlangen Schloss 006.JPG|Erlangen Castle \n\nCoats of arms\n\nFile:Hohenzollern Haus Wappen.svg|Quartered coat of arms of the Hohenzollerns\nFile:Zollern ZW.png|Counts of Zollern (1340)\nFile:Nürenberg ZW.png|Burgraves of Nuremberg (1340)\nFile:COA family de Burggrafen von Nürnberg (Haus Hohenzollern).svg|Burgraves of Nuremberg\nFile:Wappen Deutsches Reich - Reichswappen (Grosses).svg|The greater coat of arms of the German Emperor\nFile:Hohenzollern.jpg|The princely Swabian branch (1605)\n\nMembers of the family after abdication\n\nRoyal Prussian branch\n\n* Prince Franz Wilhelm of Prussia (1943–)\n* Prince Frederick of Prussia (1911–1966)\n* Georg Friedrich, Prince of Prussia (1976–)\n* Prince Hubertus of Prussia (1909–1950)\n* Princess Kira of Prussia (1943–2004)\n* Louis Ferdinand, Prince of Prussia (1907–1994)\n* Prince Louis Ferdinand of Prussia (1944–1977)\n* Prince Michael of Prussia (1940–2014)\n* Prince Oskar of Prussia (1959–)\n* Wilhelm, Prince of Prussia (1882-1951)\n* Prince Wilhelm of Prussia (1906–1940)\n* Prince Wilhelm-Karl of Prussia (1922–2007)\n\nPrincely Swabian branch\n\n* Alexander, Prince of Hohenzollern (1987–)\n* Princess Augusta Victoria of Hohenzollern (1890–1966)\n* Prince Ferfried of Hohenzollern (1943–)\n* Frederick, Prince of Hohenzollern (1891–1965)\n* Friedrich Wilhelm, Prince of Hohenzollern (1924–2010)\n* Prince Johann Georg of Hohenzollern (1932–2016)\n* Karl Friedrich, Prince of Hohenzollern (1952–). House of Hohenzollern. http://en.wikipedia.org/?curid=13849."
  }
}
