{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13774",
  "eid" : "0d25d680-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778531304,
  "textBody" : "Houston ( ) is the most populous city in the U.S. state of Texas and the fourth-most populous city in the United States, with a census-estimated 2016 population of 2.303 million within a land area of . It is the largest city in the Southern United States, and the seat of Harris County. Located in Southeast Texas near the Gulf of Mexico, it is the principal city of the Greater Houston metro area, which is the fifth-most populated MSA in the United States.\n\nHouston was founded on August 30, 1836, near the banks of Buffalo Bayou (now known as Allen's Landing) and incorporated as a city on June 5, 1837. The city was named after former General Sam Houston, who was president of the Republic of Texas and had commanded and won at the Battle of San Jacinto 25 mi east of where the city was established. The burgeoning port and railroad industry, combined with oil discovery in 1901 and Houston's replacement of Galveston as Texas's primary port following a devastating hurricane, has induced continual surges in the city's population. In the mid-20th century, Houston became the home of the Texas Medical Center—the world's largest concentration of healthcare and research institutions—and NASA's Johnson Space Center, where the Mission Control Center is located.\n\nHouston's economy has a broad industrial base in energy, manufacturing, aeronautics, and transportation. Leading in health care sectors and building oilfield equipment, Houston has the second most Fortune 500 headquarters of any U.S. municipality within its city limits (after New York City).[http://money.cnn.com/magazines/fortune/fortune500/2011/cities/ Fortune 500 2010: Cities] Accessed May 25, 2011 The Port of Houston ranks first in the United States in international waterborne tonnage handled and second in total cargo tonnage handled. Nicknamed the \"Space City\", Houston is a global city, with strengths in business, international trade, entertainment, culture, media, fashion, science, sports, technology, education, medicine, and research. The city has a population from various ethnic and religious backgrounds and a large and growing international community. Houston is the most diverse city in Texas and has been described as the most racially and ethnically diverse major metropolis in the U.S. It is home to many cultural institutions and exhibits, which attract more than 7 million visitors a year to the Museum District. Houston has an active visual and performing arts scene in the Theater District and offers year-round resident companies in all major performing arts.\" \", Greater Houston Partnership. Retrieved on March 21, 2009. \n\nHistory\n\nOn August 26, 1836, two real estate entrepreneurs from New York, Augustus Chapman Allen and John Kirby Allen, purchased 6642 acre of land along Buffalo Bayou with the intent of founding a city.Fernandez,\n Manny. [https://www.nytimes.com/2017/09/03/us/houston-highway-resilience-snapshots.html Over 21 Miles of Highway, Snapshots of a Resilient Houston], New York Times, September 3, 2017. According to historian, David McComb, \"[T]he brothers, on August 26, 1836, bought from Elizabeth E. Parrott, wife of T.F.L. Parrott and widow of John Austin, the south half of the lower league [2,214 acres of land] granted to her by her late husband. They paid $5,000 total, but only $1,000 of this in cash; notes made up the remainder.\" The Allen brothers decided to name the city after Sam Houston, the popular general at the Battle of San Jacinto, who was elected President of Texas in September 1836. The great majority of slaves in Texas came with their owners from the older slave states. Sizable numbers, however, came through the domestic slave trade. New Orleans was the center of this trade in the Deep South, but slave dealers were in Houston. Thousands of enslaved blacks lived near the city before the Civil War. Many of them near the city worked on sugar and cotton plantations, while most of those in the city limits had domestic and artisan jobs.\nHouston was granted incorporation on June 5, 1837, with James S. Holman becoming its first mayor. In the same year, Houston became the county seat of Harrisburg County (now Harris County) and the temporary capital of the Republic of Texas. In 1840, the community established a chamber of commerce in part to promote shipping and waterborne business at the newly created port on Buffalo Bayou.[http://www.houstontx.gov/savvy/archives/sum06/sum06_heritage.htm John Perry, \"Born on the Bayou: city's murky start\"] , City Savvy Online Edition. Published Summer 2006. Retrieved on February 6, 2007.\n\nBy 1860, Houston had emerged as a commercial and railroad hub for the export of cotton. Railroad spurs from the Texas inland converged in Houston, where they met rail lines to the ports of Galveston and Beaumont. During the American Civil War, Houston served as a headquarters for General John Bankhead Magruder, who used the city as an organization point for the Battle of Galveston. After the Civil War, Houston businessmen initiated efforts to widen the city's extensive system of bayous so the city could accept more commerce between downtown and the nearby port of Galveston. By 1890, Houston was the railroad center of Texas.\n\nIn 1900, after Galveston was struck by a devastating hurricane, efforts to make Houston into a viable deep-water port were accelerated.[http://www.tsl.state.tx.us/governors/rising/sayers-galv.html J.H.W. Stele to Sayers, September 11–12, 1900]. Texas State Library & Archives Commission, Retrieved on August 31, 2007 The following year, the discovery of oil at the Spindletop oil field near Beaumont prompted the development of the Texas petroleum industry. In 1902, President Theodore Roosevelt approved a $1-million improvement project for the Houston Ship Channel. By 1910, the city's population had reached 78,800, almost doubling from a decade before. African Americans formed a large part of the city's population, numbering 23,929 people, which was nearly one-third of the residents.\n\nPresident Woodrow Wilson opened the deep-water Port of Houston in 1914, seven years after digging began. By 1930, Houston had become Texas' most populous city and Harris County the most populous county. In 1940, the Census Bureau reported Houston's population as 77.5% white and 22.4% black.\n\nWhen World War II started, tonnage levels at the port decreased and shipping activities were suspended; however, the war did provide economic benefits for the city. Petrochemical refineries and manufacturing plants were constructed along the ship channel because of the demand for petroleum and synthetic rubber products by the defense industry during the war. Ellington Field, initially built during World War I, was revitalized as an advanced training center for bombardiers and navigators. The Brown Shipbuilding Company was founded in 1942 to build ships for the U.S. Navy during World War II. Due to the boom in defense jobs, thousands of new workers migrated to the city, both blacks and whites competing for the higher-paying jobs. President Roosevelt had established a policy of nondiscrimination for defense contractors, and blacks gained some opportunities, especially in shipbuilding, although not without resistance from whites and increasing social tensions that erupted into occasional violence. Economic gains of blacks who entered defense industries continued in the postwar years.\"Race, Roosevelt, and Wartime Production: Fair Employment in World War II Labor Markets\", William J. Collins, The American Economic Review, Vol. 91, No. 1 (March 2001), pp. 272–286, Published by: American Economic Association, Stable URL: https://www.jstor.org/stable/2677909\n\nIn 1945, the M.D. Anderson Foundation formed the Texas Medical Center. After the war, Houston's economy reverted to being primarily port-driven. In 1948, the city annexed several unincorporated areas, more than doubling its size. Houston proper began to spread across the region.\n\nIn 1950, the availability of air conditioning provided impetus for many companies to relocate to Houston, where wages were lower than those in the North; this resulted in an economic boom and produced a key shift in the city's economy toward the energy sector.[http://www.oldhouseweb.com/stories/Detailed/725.shtml \"How Air Conditioning Changed America\"], The Old House Web, Retrieved on April 4, 2007[http://www.hgs.org/en/articles/printview.asp?26 \"A Short History\"] , Houston Geological Auxiliary, Retrieved on April 4, 2007 \n\nThe increased production of the expanded shipbuilding industry during World War II spurred Houston's growth, as did the establishment in 1961 of NASA's \"Manned Spacecraft Center\" (renamed the Lyndon B. Johnson Space Center in 1973). This was the stimulus for the development of the city's aerospace industry. The Astrodome, nicknamed the \"Eighth Wonder of the World\", opened in 1965 as the world's first indoor domed sports stadium.\n\nDuring the late 1970s, Houston had a population boom as people from the Rust Belt states moved to Texas in large numbers. The new residents came for numerous employment opportunities in the petroleum industry, created as a result of the Arab oil embargo. With the increase in professional jobs, Houston has become a destination for many college-educated persons, including African Americans in a reverse Great Migration from northern areas.\n\nIn 1997, Houstonians elected Lee P. Brown as the city's first African American mayor.\n\nIn June 2001, Tropical Storm Allison dumped up to 40 in of rain on parts of Houston, causing what was then the worst flooding in the city's history. The storm cost billions of dollars in damage and killed 20 people in Texas. By December of that same year, Houston-based energy company Enron collapsed into the third-largest ever U.S. bankruptcy during an investigation surrounding fabricated partnerships that were allegedly used to hide debt and inflate profits.\n\nIn August 2005, Houston became a shelter to more than 150,000 people from New Orleans, who evacuated from Hurricane Katrina. One month later, about 2.5 million Houston-area residents evacuated when Hurricane Rita approached the Gulf Coast, leaving little damage to the Houston area. This was the largest urban evacuation in the history of the United States.[http://www.house.gov/brady/2007_appropriations.shtml 8th Congressional District of Texas 2007 Appropriations Project Requests] . Congressman Kevin Brady, 8th District of Texas. Retrieved on January 10, 2007. In September 2008, Houston was hit by Hurricane Ike. As many as 40% of residents refused to leave Galveston Island because they feared the type of traffic problems that had happened after Hurricane Rita.\n\nDuring the floods in 2015 and 2016, parts of the city were covered in several inches of water.\n\nIn 2017, Houston hosted Super Bowl LI. This is the third Super Bowl for the city, with the previous games being held in 1974 and 2004.\n\nIn late August 2017, Hurricane Harvey caused severe flooding in the Houston area, with some areas receiving over 50 in of rain. Winds reached up to 145 miles per hour, and rainfall exceeded 50 inches in several areas locally, breaking the national record for rainfall. The damage for the Houston area is estimated at up to $125 billion U.S. dollars, and it is considered to be one of the worst natural disasters in the history of the United States,\" \", CNN News. Retrieved on August 25, 2017. with the death toll exceeding 70 people. On January 31, 2018, Houston City Council agreed to forgive large water bills thousands of households faced in the aftermath of Hurricane Harvey, as Houston Public Works found 6,362 homeowners' accounts doubled at least. \n\nGeography\n\nHouston is located 165 mi east of Austin,Lomax, John Nova. \"[http://www.texasmonthly.com/story/texas This Is Texas].\" Texas Monthly. February 2013. Retrieved on April 30, 2013. \"No, the rightful standard-bearer of our state—the city with the greatest number of people, of cultural happenings, of medical facilities, of gangbuster enterprises—is located 165 miles to the east of Texas's pink-granite dome.\" – The first part is discussing Houston. The \"pink granite dome\" is the Texas State Capitol in Austin. 112 mi west of the Louisiana border, and 250 mi south of Dallas.Martin, Roland. \" [http://www.cnn.com/2012/01/06/opinion/opinion-texas-football-roland-martin/index.html?hpthp_bn1 Football power in Texas has shifted to Houston].\" CNN. January 6, 2012. Retrieved on January 7, 2012. According to the United States Census Bureau, the city has a total area of ; this comprises  of land and  covered by water.[http://quickfacts.census.gov/qfd/states/48/4835000.html Houston (city) QuickFacts from the US Census Bureau] . U.S. Census Bureau. Retrieved on February 28, 2009. The Piney Woods are north of Houston. Most of Houston is located on the gulf coastal plain, and its vegetation is classified as temperate grassland and forest. Much of the city was built on forested land, marshes, swamp, or prairie and are all still visible in surrounding areas. The flatness of the local terrain, when combined with urban sprawl, has made flooding a recurring problem for the city.[http://www.crwr.utexas.edu/gis/gishyd98/class/trmproj/ahrens/prepro.htm Flood Forecasting for the Buffalo Bayou Using CRWR-PrePro and HEC-HMS] . Center for Research in Water Resources, The University of Texas at Austin Retrieved on January 10, 2007. Downtown stands about 50 ft above sea level,[http://www.topoquest.com/map.asp?lat\n29.75737&lon-95.36387&size\nm&u4&datum\nnad27&layerDRG&s\n100 Downtown Houston, Texas]. TopoQuest.com Retrieved on July 5, 2008. and the highest point in far northwest Houston is about 125 ft in elevation.[http://www.topoquest.com/map.asp?lat29.96645&lon\n-95.56326&sizel&datum\nnad83&layerDRG&s\n100 USGS Satsuma (TX) Topo Map]. TopoQuest.com. 2008. Retrieved on July 5, 2008. Note: The boundaries of the City of Houston are shown as \"HOUSTON CORP BDY\" along the dotted line.[http://www.houstontx.gov/superneighborhoods/profiles/SN_1.htm Super Neighborhood# 1-Willowbrook] . City of Houston. Retrieved on May 15, 2012. The city once relied on groundwater for its needs, but land subsidence forced the city to turn to ground-level water sources such as Lake Houston, Lake Conroe, and Lake Livingston. . United States Geological Survey. Retrieved on January 11, 2007. The city owns surface water rights for 1.20 billion gallons of water a day in addition to 150 million gallons a day of groundwater.\n\nHouston has four major bayous passing through the city that accept water from the extensive drainage system. Buffalo Bayou runs through downtown and the Houston Ship Channel, and has three tributaries: White Oak Bayou, which runs through the Houston Heights community northwest of Downtown and then towards Downtown; Brays Bayou, which runs along the Texas Medical Center; and Sims Bayou, which runs through the south of Houston and downtown Houston. The ship channel continues past Galveston and then into the Gulf of Mexico.\n\nGeology\n\nHouston is flat marshy area where an extensive drainage system has been built. The adjoining prairie land drains into the city which is prone to flooding. Underpinning Houston's land surface are unconsolidated clays, clay shales, and poorly cemented sands up to several miles deep. The region's geology developed from river deposits formed from the erosion of the Rocky Mountains. These sediments consist of a series of sands and clays deposited on decaying organic marine matter, that over time, transformed into oil and natural gas. Beneath the layers of sediment is a water-deposited layer of halite, a rock salt. The porous layers were compressed over time and forced upward. As it pushed upward, the salt dragged surrounding sediments into salt dome formations, often trapping oil and gas that seeped from the surrounding porous sands. The thick, rich, sometimes black, surface soil is suitable for rice farming in suburban outskirts where the city continues to grow.[https://tshaonline.org/handbook/online/articles/hch07 Harris County]. Handbook of Texas Online. Retrieved on January 10, 2007.[https://tshaonline.org/handbook/online/articles/afr01 RICE CULTURE]. Handbook of Texas Online. Retrieved on January 10, 2007.\n\nThe Houston area has over 150 active faults (estimated to be 300 active faults) with an aggregate length of up to 310 mi,Earl R. Verbeek, Karl W. Ratzlaff, Uel S. Clanton. \"[http://pubs.usgs.gov/mf-maps/mf1136/mf1136/ Faults in Parts of North-Central and Western Houston Metropolitan Area, Texas]\", United States Geological Survey, September 16, 2005. Retrieved on December 14, 2006.Sachin D. Shah and Jennifer Lanning-Rush. [http://pubs.usgs.gov/sim/2005/2874/ Principal Faults in the Houston, Texas, Metropolitan Area], U.S. Geological Survey. Retrieved on February 23, 2012. including the Long Point–Eureka Heights fault system which runs through the center of the city. No significant historically recorded earthquakes have occurred in Houston, but researchers do not discount the possibility of such quakes having occurred in the deeper past, nor occurring in the future. Land in some areas southeast of Houston is sinking because water has been pumped out of the ground for many years. It may be associated with slip along the faults; however, the slippage is slow and not considered an earthquake, where stationary faults must slip suddenly enough to create seismic waves.[https://web.archive.org/web/20070715065340/http://www.ig.utexas.edu/research/projects/eq/faq/tx.htm Texas Earthquakes], University of Texas Institute for Geophysics, July 2001. Retrieved on August 29, 2007. These faults also tend to move at a smooth rate in what is termed \"fault creep\", which further reduces the risk of an earthquake.\n\nClimate\n\nHouston's climate is classified as humid subtropical (Cfa in the Köppen climate classification system), typical of Southern United States. The city features very hot, humid summers, and generally mild winters. While not located in \"Tornado Alley\", like much of the rest of Texas, spring supercell thunderstorms sometimes bring tornadoes to the area. Prevailing winds are from the south and southeast during most of the year, which bring heat and moisture from the nearby Gulf of Mexico.\n\nDuring the summer, temperatures commonly reach over 90 °F, with an average of 106.5 days per year, including a majority from June to September, with a high of 90 °F or above and 4.6 days at or over 100 °F. However, humidity usually yields a higher heat index. Summer mornings average over 90% relative humidity.\"[https://web.archive.org/web/20011101082154/http://lwf.ncdc.noaa.gov/oa/climate/online/ccd/avgrh.html Average Relative Humidity (%)]\", National Climatic Data Center. Retrieved on February 23, 2012. Although sea breezes are present, they don't offer substantial relief, except in the southeastern areas of the city closer to the Gulf.Afternoon thunderstorms are common.[https://web.archive.org/web/20070209115107/http://www.met.utah.edu/jhorel/html/wx/climate/windavg.html Wind – Average Speed (mph)]. Department of Meteorology, University of Utah. 1993. Retrieved on January 10, 2007 To cope with the strong humidity and heat, people use air conditioning in nearly every vehicle and building. In 1980, Houston was described as the \"most air-conditioned place on earth\".[https://web.archive.org/web/20070206075059/http://www.nbm.org/blueprints/90s/summer92/contents/contents.htm A Moment in Building]. BLUEPRINTS, Volume X, Number 3, Summer 1992. National Building Museum. Retrieved on January 11, 2007. Officially, the hottest temperature ever recorded in Houston is 109 °F, which was reached both on September 4, 2000, and August 28, 2011.\n\nHouston has mild winters. In January, the normal mean temperature at Intercontinental Airport is , while that station has an average of 13 days with a low at or below freezing. Snowfall is rare. Recent snow events in Houston include a storm on December 24, 2004 when 1 in of snow accumulated in parts of the metro area.National Weather Service Forecast Office, Houston/Galveston, Texas.  Retrieved on December 1, 2006. There was also snowfall on December 7, 2017, when Houston received  of snowfall.Shayanian, Sara (December 8, 2017). \"[https://www.upi.com/Top_News/US/2017/12/08/Texas-hit-with-snow-as-winter-weather-system-aims-for-Northeast/4591512735568/ Texas hit with snow as winter weather system aims for Northeast]\". United Press International.Berger, Eric; Latson, Jennifer; Leahy, Jennifer (December 10, 2017). \"[http://www.chron.com/news/houston-texas/article/Snow-surprises-Houston-area-residents-1612825.php Snow surprises Houston-area residents]\". Houston Chronicle.Matthews, Blake (December 8, 2017). \"[http://www.khou.com/news/local/record-snow-blankets-houston-and-texas/497922280 Record snow blankets Houston and Texas]\". KHOU-TV. Snowfalls of at least  on both December 10, 2008, and December 4, 2009, marked the first time measurable snowfall had occurred in two consecutive years in the city's recorded history. Houston has seen snowfall 38 times between 1985 and 2018. On February 14 and February 15, 1895, Houston received 20 in of snow, its largest snowfall from one storm on record.\"[http://abc13.com/amp/weather/snow-in-houston----it-happens-more-than-you-think/2753082/ Snow in Houston: It Happens More Than You Think]\". KTRK-TV. December 8, 2017. The coldest temperature officially recorded in Houston was 5 °F on January 18, 1930. \n\nHouston has historically received an ample amount of rainfall, averaging about  annually based on records between 1981 and 2010. Localized flooding often occurs, owing to the extremely flat topography and widespread typical clay-silt prairie soils, which do not drain quickly. As of August 27, 2017, Houston and its surrounding areas received intense flash flooding due to Hurricane Harvey. Overall, there have been more casualties and property loss from floods in Houston, than any other locality in the US.https://www.theguardian.com/environment/2017/jun/16/texas-flooding-houston-climate-change-disaster\n\nHouston has excessive ozone levels and is routinely ranked among the most ozone-polluted cities in the United States.\"[http://www.lung.org/assets/documents/publications/state-of-the-air/state-of-the-air-report-2005.pdf State of the Air 2005, National and Regional Analysis] \", American Lung Association, page 26, March 25, 2005. Retrieved on February 17, 2006. Ground-level ozone, or smog, is Houston's predominant air pollution problem, with the American Lung Association rating the metropolitan area's ozone level twelfth on the \"Most Polluted Cities by Ozone\" in 2017, after major cities such as Los Angeles, Phoenix, New York City and Denver. The industries located along the ship channel are a major cause of the city's air pollution.\"[http://www.cleanhouston.org/air/index.htm Summary of the Issues] \", Citizens League for Environmental Action Now, August 1, 2004. Retrieved on February 17, 2006. The rankings are in terms of peak-based standards, focusing strictly on the worst days of the year; the average ozone levels in Houston are lower than what is seen in most other areas of the country, as dominant winds ensure clean, marine air from the Gulf. \n\nCityscape\n\nHouston was incorporated in 1837 under the ward system of representation. The ward designation is the progenitor of the 11 current-day geographically oriented Houston City Council districts. Locations in Houston are generally classified as either being inside or outside the Interstate 610 Loop. The inside encompasses the central business district and many pre–World War II residential neighborhoods. More recently, high-density residential areas have been developed within the loop. The city's outlying areas, suburbs, and enclaves are located outside the loop. Beltway 8 encircles the city another 5 mi farther out.\n\nThough Houston is the largest city in the United States without formal zoning regulations, it has developed similarly to other Sun Belt cities because the city's land use regulations and legal covenants have played a similar role. Regulations include mandatory lot size for single-family houses and requirements that parking be available to tenants and customers. Such restrictions have had mixed results. Though some have blamed the city's low density, urban sprawl, and lack of pedestrian-friendliness on these policies, the city's land use has also been credited with having significant affordable housing, sparing Houston the worst effects of the 2008 real estate crisis. The city issued 42,697 building permits in 2008 and was ranked first in the list of healthiest housing markets for 2009.\n\nVoters rejected efforts to have separate residential and commercial land-use districts in 1948, 1962, and 1993. Consequently, rather than a single central business district as the center of the city's employment, multiple districts have grown throughout the city in addition to downtown which include Uptown, Texas Medical Center, Midtown, Greenway Plaza, Memorial City, Energy Corridor, Westchase, and Greenspoint.\n\nArchitecture\n\nHouston has the fourth-tallest skyline in North America (after New York City, Chicago, and Toronto) and 36th-tallest in the world as of 2018.https://tudl0867.home.xs4all.nl/skylines.html A seven-mile (11 km) system of tunnels and skywalks links downtown buildings containing shops and restaurants, enabling pedestrians to avoid summer heat and rain while walking between buildings.\n\nIn the 1960s, Downtown Houston consisted of a collection of midrise office structures. Downtown was on the threshold of an energy industryled boom in 1970. A succession of skyscrapers was built throughout the 1970s—many by real estate developer Gerald D. Hines—culminating with Houston's tallest skyscraper, the 75-floor, 1002 ft-tall JPMorgan Chase Tower (formerly the Texas Commerce Tower), completed in 1982. It is the tallest structure in Texas, 15th tallest building in the United States, and the 85th-tallest skyscraper in the world, based on highest architectural feature. In 1983, the 71-floor, 992 ft-tall Wells Fargo Plaza (formerly Allied Bank Plaza) was completed, becoming the second-tallest building in Houston and Texas. Based on highest architectural feature, it is the 17th-tallest in the United States and the 95th-tallest in the world. In 2007, downtown Houston had over 43 million square feet (4,000,000 m²) of office space.[http://www.houstondowntown.com/Home/GeneralInfo/About/FastFacts1/ Fast Facts, Downtown Houston] . Houstondowntown.com 2006. Retrieved on January 10, 2007.\n\nCentered on Post Oak Boulevard and Westheimer Road, the Uptown District boomed during the 1970s and early 1980s when a collection of midrise office buildings, hotels, and retail developments appeared along Interstate 610 West. Uptown became one of the most prominent instances of an edge city. The tallest building in Uptown is the 64-floor, 901 ft-tall, Philip Johnson and John Burgee designed landmark Williams Tower (known as the Transco Tower until 1999). At the time of construction, it was believed to be the world's tallest skyscraper outside a central business district. The new 20-story Skanska building and BBVA Compass Plaza are the newest office buildings built in Uptown after 30 years. The Uptown District is also home to buildings designed by noted architects I. M. Pei, César Pelli, and Philip Johnson. In the late 1990s and early 2000s, a mini-boom of midrise and highrise residential tower construction occurred, with several over 30 stories tall.[http://www.uptown-houston.com/economic/market/residential.html Residential Real Estate]. Uptown-houston.com Retrieved on January 11, 2007.  Since 2000 more than 30 high-rise buildings have gone up in Houston; all told, 72 high-rises tower over the city, which adds up to about 8,300 units. In 2002, Uptown had more than 23 million square feet (2,100,000 m²) of office space with 16 million square feet (1,500,000 m²) of class A office space.[http://www.uptown-houston.com/economic/market/office.html Commercial Real Estate]. Uptown-houston.com Retrieved on January 10, 2007. \n\nFile:Niels Esperson Building.jpg|The Niels Esperson Building stood as the tallest building in Houston from 1927 to 1929.\nFile:Chase Tower, a block away.jpg|The JPMorgan Chase Tower is the tallest building in Texas and the tallest 5-sided building in the world.\nFile:Williamstower.jpg|The Williams Tower is the tallest building in the US outside a central business district.\nFile:Bank of America Center Houston 1.jpg|The Bank of America Center by Philip Johnson is an example of postmodern architecture.\nFile:JPMorgan Chase Tower, Houston, Texas.jpg|JPMorgan Chase Tower in Houston, Texas is the tallest composite building in the world.\n\nDemographics\n\nGreater Houston is the most ethnically diverse metropolitan area in the country. In the Houston region, non-Hispanic whites make up 38 percent of the population, Hispanics 36 percent, African-Americans 17 percent and Asians 9 percent.\n\nHouston is multicultural, in part because of its many academic institutions and strong industries, as well as being a major port city. Over 90 languages are spoken in the city.\"[http://www.houstontx.gov/abouthouston/houstonfacts.html Houston Facts and Figures]\", City of Houston. Retrieved on December 15, 2006. It has among the youngest populations in the nation, . East-West Gateway Council of Governments. 2006. Retrieved on January 11, 2007. Page 25 in PDF File, labeled as page 21.[http://factfinder.census.gov/servlet/ACSSAFFFacts?_event&geo_id\n16000US4835000&_geoContext01000US%7C04000US48%7C16000US4835000&_county\nHouston&_cityTownHouston&_state\n04000US48 Houston city, Texas]. 2005 American Community Survey Data Profile Highlights, United States Census Bureau. 2005. Retrieved on January 12, 2007.[http://factfinder.census.gov/servlet/GRTTable?_bmy&-geo_id\n04000US48&-_box_head_nbrR0101&-ds_name\nACS_2005_EST_G00_&-_langen&-redoLog\nfalse&-formatUS-30&-mt_name\nACS_2005_EST_G00_R0101_US30&-_sse=on United States and States R0101. Median Age of the Total Population: 2005]. 2005 American Community Survey, United States Census Bureau. 2005. Retrieved on January 12, 2007. partly due to an influx of immigrants into Texas.[http://www.dallasfed.org/assets/documents/research/pubs/fotexas/fotexas_petersen.pdf The Face of Texas Jobs, People, Business, Change] . D'Ann Petersen and Laila Assanie, Federal Reserve Bank of Dallas. October 2005. Retrieved on January 11, 2007. An estimated 400,000 illegal immigrants reside in the Houston area.\n\nAccording to the 2010 U.S. Census, whites made up 51% of Houston's population; 26% of the total population was non-Hispanic Whites. Blacks or African Americans made up 25% of Houston's population. American Indians made up 0.7% of the population. Asians made up 6% (1.7% Vietnamese, 1.3% Chinese, 1.3% Indian, 0.9% Pakistani, 0.4% Filipino, 0.3% Korean, 0.1% Japanese), while Pacific Islanders made up 0.1%. Individuals from some other race made up 15.2% of the city's population, of which 0.2% were non-Hispanic. Individuals from two or more races made up 3.3% of the city. \nAt the 2000 Census, 1,953,631 people inhabited the city, and the population density was 3,371.7 people per square mile (1,301.8/km²). The racial makeup of the city was 49.3% White, 25.3% African American, 6.3% Asian, 0.7% American Indian, 0.1% Pacific Islander, 16.5% from some other race, and 3.1% from two or more races. In addition, Hispanics made up 37.4% of Houston's population, while non-Hispanic Whites made up 30.8%, down from 62.4% in 1970.\n\nThe median income for a household in the city was $37,000, and for a family was $40,000. Males had a median income of $32,000 versus $27,000 for females. The per capita income was $20,000. About 19% of the population and 16% of families were below the poverty line. Of the total population, 26% of those under the age of 18 and 14% of those 65 and older were living below the poverty line.\n\nAccording to a 2014 study by the Pew Research Center, 73% of the population of the city identified themselves as Christians, with 50% professing attendance at a variety of churches that could be considered Protestant, and 19% professing Roman Catholic beliefs.[http://www.pewresearch.org/fact-tank/2015/07/29/major-u-s-metropolitan-areas-differ-in-their-religious-profiles/ Major U.S. metropolitan areas differ in their religious profiles], Pew Research Center while 20% claim no religious affiliation. The same study says that other religions (including Judaism, Buddhism, Islam, and Hinduism) collectively make up about 7% of the population\n\nEconomy\n\nHouston is recognized worldwide for its energy industry—particularly for oil and natural gas—as well as for biomedical research and aeronautics. Renewable energy sources—wind and solar—are also growing economic bases in the city. The Houston Ship Channel is also a large part of Houston's economic base. Because of these strengths, Houston is designated as a global city by the Globalization and World Cities Study Group and Network and global management consulting firm A.T. Kearney. The Houston area is the top U.S. market for exports, surpassing New York City in 2013, according to data released by the U.S. Department of Commerce's International Trade Administration. In 2012, the Houston–The Woodlands–Sugar Land area recorded $110.3 billion in merchandise exports.[http://www.bizjournals.com/houston/news/2013/07/11/houston-surpasses-new-york-as-top-us.html Houston surpasses New York as top U.S. export market – Houston Business Journal]. Bizjournals.com. Retrieved on July 21, 2013. Petroleum products, chemicals, and oil and gas extraction equipment accounted for roughly two-thirds of the metropolitan area's exports last year. The top three destinations for exports were Mexico, Canada, and Brazil.[http://app1.kuhf.org/articles/1373562479-Houston-Passes-New-York-to-Become-Nations-Top-Exporting-Metro-Area.html Houston Passes New York to Become Nation's Top Exporting Metro Area]. App1.kuhf.org (July 12, 2013). Retrieved on July 21, 2013.\n\nThe Houston area is a leading center for building oilfield equipment.\" \", Greater Houston Partnership. Retrieved on March 21, 2009. Much of its success as a petrochemical complex is due to its busy ship channel, the Port of Houston.\" \", The Port of Houston Authority, May 15, 2007. Retrieved on May 27, 2007. In the United States, the port ranks first in international commerce and 10th among the largest ports in the world.\"[http://www.portofhouston.com/geninfo/overview1.html General Information] \", The Port of Houston Authority, May 15, 2007. Retrieved on May 27, 2007. Unlike most places, high oil and gasoline prices are beneficial for Houston's economy, as many of its residents are employed in the energy industry. Houston is the beginning or end point of numerous oil, gas, and products pipelines:\n\nThe Houston–The Woodlands–Sugar Land MSA's gross domestic product (GDP) in 2012 was $489 billion, making it the fourth-largest of any metropolitan area in the United States and larger than Austria's, Venezuela's, or South Africa's GDP. Only 26 countries other than the United States have a gross domestic product exceeding Houston's regional gross area product (GAP). In 2010, mining (which consists almost entirely of exploration and production of oil and gas in Houston) accounted for 26.3% of Houston's GAP up sharply in response to high energy prices and a decreased worldwide surplus of oil production capacity, followed by engineering services, health services, and manufacturing.\" \", Greater Houston Partnership. Retrieved on March 21, 2009.\n\nThe University of Houston System's annual impact on the Houston area's economy equates to that of a major corporation: $1.1 billion in new funds attracted annually to the Houston area, $3.13 billion in total economic benefit, and 24,000 local jobs generated. This is in addition to the 12,500 new graduates the U.H. System produces every year who enter the workforce in Houston and throughout the state of Texas. These degree-holders tend to stay in Houston. After five years, 80.5% of graduates are still living and working in the region.\n\nIn 2006, the Houston metropolitan area ranked first in Texas and third in the U.S. within the category of \"Best Places for Business and Careers\" by Forbes magazine.Badenhausen, Kurt. \"[https://www.forbes.com/2006/05/03/06bestplaces_best-places-for-business_land.html 2006 Best Places for Business and Careers]\", Forbes, May 4, 2006. Retrieved on December 15, 2006. Foreign governments have established 92 consular offices in Houston's metropolitan area, the third-highest in the nation. Forty foreign governments maintain trade and commercial offices here with 23 active foreign chambers of commerce and trade associations.\" \", Greater Houston Partnership. Retrieved on March 21, 2009. Twenty-five foreign banks representing 13 nations operate in Houston, providing financial assistance to the international community.\n\nIn 2008, Houston received top ranking on Kiplinger's Personal Finance Best Cities of 2008 list, which ranks cities on their local economy, employment opportunities, reasonable living costs, and quality of life. The city ranked fourth for highest increase in the local technological innovation over the preceding 15 years, according to Forbes magazine. In the same year, the city ranked second on the annual Fortune 500 list of company headquarters, first for Forbes magazine's Best Cities for College Graduates, and first on their list of Best Cities to Buy a Home. In 2010, the city was rated the best city for shopping, according to Forbes.\n\nIn 2012, the city was ranked number one for paycheck worth by Forbes and in late May 2013, Houston was identified as America's top city for employment creation.\n\nIn 2013, Houston was identified as the number one U.S. city for job creation by the U.S. Bureau of Statistics after it was not only the first major city to regain all the jobs lost in the preceding economic downturn, but also after the crash, more than two jobs were added for every one lost. Economist and vice president of research at the Greater Houston Partnership Patrick Jankowski attributed Houston's success to the ability of the region's real estate and energy industries to learn from historical mistakes. Furthermore, Jankowski stated that \"more than 100 foreign-owned companies relocated, expanded or started new businesses in Houston\" between 2008 and 2010, and this openness to external business boosted job creation during a period when domestic demand was problematically low. Also in 2013, Houston again appeared on Forbes list of Best Places for Business and Careers.\n\nCulture\n\nLocated in the American South, Houston is a diverse city with a large and growing international community. The Houston Metropolitan area is home to an estimated 1.1 million (21.4 percent) residents who were born outside the United States, with nearly two-thirds of the area's foreign-born population from south of the United States–Mexico border. Additionally, more than one in five foreign-born residents are from Asia. The city is home to the nation's third-largest concentration of consular offices, representing 86 countries.\n\nMany annual events celebrate the diverse cultures of Houston. The largest and longest-running is the annual Houston Livestock Show and Rodeo, held over 20 days from early to late March, and is the largest annual livestock show and rodeo in the world. Another large celebration is the annual night-time Houston Pride Parade, held at the end of June. Other annual events include the Houston Greek Festival,[http://www.greekfestival.org/ The Original Greek Festival, Houston, Texas]. 2006. Retrieved on January 10, 2007. Warning: Automatic sound file. Art Car Parade, the Houston Auto Show, the Houston International Festival,[http://www.ifest.org/ The Houston International Festival] . 2007. Retrieved on January 10, 2007. and the Bayou City Art Festival, which is considered to be one of the top five art festivals in the United States.\n\nHouston received the official nickname of \"Space City\" in 1967 because it is the location of NASA's Lyndon B. Johnson Space Center. Other nicknames often used by locals include \"Bayou City\", \"Clutch City\", \"Magnolia City\", and \"H-Town\".\n\nArts and theater\n\nThe Houston Theater District, located downtown, is home to nine major performing arts organizations and six performance halls. It is the second-largest concentration of theater seats in a downtown area in the United States.Ramsey, Cody. \"[http://www.texasmonthly.com/content/texas-tidbits-19 In a state of big, Houston is at the top]\", Texas Monthly, September 2002. Retrieved February 16, 2014.\"[https://web.archive.org/web/20061209083929/http://www.houstontheaterdistrict.org/en/cms/?68 About Houston Theater District]\", Houston Theater District. Retrieved on December 16, 2006. Archived at the Internet Archive Wayback Machine. Houston is one of few United States cities with permanent, professional, resident companies in all major performing arts disciplines: opera (Houston Grand Opera), ballet (Houston Ballet), music (Houston Symphony Orchestra), and theater (The Alley Theatre, Theatre Under the Stars).\"[https://web.archive.org/web/20061212043351/http://www.houstontheaterdistrict.org/en/cms/?12 Performing Arts Venues]\", Houston Theater District. Retrieved on December 16, 2006. Archived at the Internet Archive Wayback Machine. Houston is also home to folk artists, art groups and various small progressive arts organizations.\"[http://www.artcarmuseum.com/History/history.htm A Brief History of the Art Car Museum]\", ArtCar Museum of Houston. Retrieved on December 16, 2006. Houston attracts many touring Broadway acts, concerts, shows, and exhibitions for a variety of interests.[https://web.archive.org/web/20061230024248/http://www.quilts.com/home/news/index.php 2006 fall edition of International Quilt Festival attracts 53,546 to Houston]. Quilts., Inc. Press release published November 30, 2006. Retrieved on January 12, 2007. Facilities in the Theater District include the Jones Hall—home of the Houston Symphony Orchestra and Society for the Performing Arts—and the Hobby Center for the Performing Arts.\n\nThe Museum District's cultural institutions and exhibits attract more than 7 million visitors a year.[http://www.visithoustontexas.com/visitors/listing.details.php?id=23096 Houston Museum District] . Greater Houston Convention and Visitors Bureau. Retrieved on February 18, 2007. Notable facilities include The Museum of Fine Arts, Houston Museum of Natural Science, the Contemporary Arts Museum Houston, the Station Museum of Contemporary Art, Holocaust Museum Houston, and the Houston Zoo.[http://www.texasmonthly.com/promotions/cadillac/breakthroughs2/museums/ Houston Museum District Day]. Texas Monthly. 2006. Retrieved on January 10, 2007.[http://www.camh.org/ Home Page]. Contemporary Arts Museum Houston. Retrieved on January 10, 2007.\n[http://www.visithoustontexas.com/visitors/parks_and_outdoors/listing.details.php?id=23096 Houston Museum District] . Greater Houston Convention and Visitors Bureau. Retrieved on January 10, 2007. Located near the Museum District are The Menil Collection, Rothko Chapel, and the Byzantine Fresco Chapel Museum.\n\nBayou Bend is a 14 acre facility of the Museum of Fine Arts that houses one of America's most prominent collections of decorative art, paintings, and furniture. Bayou Bend is the former home of Houston philanthropist Ima Hogg.\n\nThe National Museum of Funeral History is located in Houston near the George Bush Intercontinental Airport. The museum houses the original Popemobile used by Pope John Paul II in the 1980s along with numerous hearses, embalming displays, and information on famous funerals.\n\nVenues across Houston regularly host local and touring rock, blues, country, dubstep, and Tejano musical acts. While Houston has never been widely known for its music scene, Houston hip-hop has become a significant, independent music scene that is influential nationwide.\n\nTourism and recreation\n\nThe Theater District is a 17-block area in the center of downtown Houston that is home to the Bayou Place entertainment complex, restaurants, movies, plazas, and parks. Bayou Place is a large multilevel building containing full-service restaurants, bars, live music, billiards, and Sundance Cinema. The Bayou Music Center stages live concerts, stage plays, and stand-up comedy.\nSpace Center Houston is the official visitors' center of NASA's Lyndon B. Johnson Space Center. The Space Center has many interactive exhibits including moon rocks, a shuttle simulator, and presentations about the history of NASA's manned space flight program. Other tourist attractions include the Galleria (Texas's largest shopping mall, located in the Uptown District), Old Market Square, the Downtown Aquarium, and Sam Houston Race Park.\n\nOf worthy mention are Houston's current Chinatown and the Mahatma Gandhi District. Both areas offer a picturesque view of Houston's multicultural makeup. Restaurants, bakeries, traditional-clothing boutiques, and specialty shops can be found in both areas.\n\nHouston is home to 337 parks, including Hermann Park, Terry Hershey Park, Lake Houston Park, Memorial Park, Tranquility Park, Sesquicentennial Park, Discovery Green, and Sam Houston Park. Within Hermann Park are the Houston Zoo and the Houston Museum of Natural Science. Sam Houston Park contains restored and reconstructed homes which were originally built between 1823 and 1905.[http://www.heritagesociety.org/ths.html The Heritage Society: Walk into Houston's Past] . The Heritage Society. Retrieved on January 10, 2007. A proposal has been made to open the city's first botanic garden at Herman Brown Park.Huber, Kathy. \"[http://www.chron.com/life/gardening/article/Houston-botanic-garden-slowly-becoming-reality-1896890.php Houston botanic garden slowly becoming reality].\" Houston Chronicle. Monday October 30, 2006. Retrieved on November 14, 2011.\n\nOf the 10 most populous U.S. cities, Houston has the most total area of parks and green space, 56405 acre.Continental Magazine, March 2008. p.67. The city also has over 200 additional green spaces—totaling over 19600 acre that are managed by the city—including the Houston Arboretum and Nature Center. The Lee and Joe Jamail Skatepark is a public skatepark owned and operated by the city of Houston, and is one of the largest skateparks in Texas consisting of a 30,000-ft2 (2,800 m2)in-ground facility. The Gerald D. Hines Waterwall Park—located in the Uptown District of the city—serves as a popular tourist attraction and for weddings and various celebrations. A 2011 study by Walk Score ranked Houston the 23rd most walkable of the 50 largest cities in the United States. Wet'n'Wild SplashTown is a water park located north of Houston.\n\nThe Bayport Cruise Terminal on the Houston Ship Channel is port of call for both Princess Cruises and Norwegian Cruise Line.\n\nSports\n\nHouston has sports teams for every major professional league except the National Hockey League. The Houston Astros are a Major League Baseball  expansion team formed in 1962 (known as the \"Colt .45s\" until 1965) that won the World Series in 2017 and previously appeared in 2005. It is the only MLB team to have won pennants in both modern leagues. The Houston Rockets are a National Basketball Association  franchise based in the city since 1971. They have won two NBA Championships: in 1994 and 1995 under star players Hakeem Olajuwon, Otis Thorpe, Clyde Drexler, Vernon Maxwell, and Kenny Smith. The Houston Texans are a National Football League  expansion team formed in 2002. The Houston Dynamo is a Major League Soccer  franchise that has been based in Houston since 2006, winning two MLS Cup titles in 2006 and 2007. The Houston Dash team plays in the National Women's Soccer League. The Scrap Yard Dawgs, a women's professional softball team, weare expected to play in the National Pro Fastpitch from 2016. They're the 2017 NPF champions. The Houston SaberCats are a Rugby team that plays in the Major League Rugby. Minute Maid Park (home of the Astros) and Toyota Center (home of the Rockets), are located in downtown Houston. Houston has the NFL's first retractable-roof stadium with natural grass, NRG Stadium (home of the Texans). Minute Maid Park is also a retractable-roof stadium. Toyota Center also has the largest screen for an indoor arena in the United States built to coincide with the arena's hosting of the 2013 NBA All-Star Game. BBVA Compass Stadium is a soccer-specific stadium for the Houston Dynamo, the Texas Southern Tigers football team, and Houston Dash, located in East Downtown. In addition, NRG Astrodome was the first indoor stadium in the world, built in 1965. Other sports facilities include Hofheinz Pavilion (Houston Cougars basketball), Rice Stadium (Rice Owls football), and Reliant Arena. TDECU Stadium is where the University of Houston Houston Cougars football team plays.\nHouston has hosted several major sports events: the 1968, 1986 and 2004 Major League Baseball All-Star Games; the 1989, 2006 and 2013 NBA All-Star Games; Super Bowl VIII and Super Bowl XXXVIII, as well as hosting the 2005 World Series and 1981, 1986, 1994 and 1995 NBA Finals, winning the latter two. NRG Stadium hosted Super Bowl LI on February 5, 2017.\n\nThe city has hosted several major professional and college sporting events, including the annual Houston Open golf tournament. Houston hosts the annual Houston College Classic baseball tournament every February and the Texas Bowl in December.\n\nThe Grand Prix of Houston, an annual auto race on the IndyCar Series circuit is held on a 1.7-mile temporary street circuit in Reliant Park. The October 2013 event was held using a tweaked version of the 2006–2007 course. The event has a 5-year race contract through 2017 with IndyCar. In motorcycling, the Astrodome hosted an AMA Supercross Championship round from 1974 to 2003 and the NRG Stadium since 2003.\n\nGovernment and politics\n\nThe city of Houston has a strong mayoral form of municipal government. Houston is a home rule city and all municipal elections in the state of Texas are nonpartisan. The city's elected officials are the mayor, city controller and 16 members of the Houston City Council. The current mayor of Houston is Sylvester Turner, a Democrat elected on a nonpartisan ballot. Houston's mayor serves as the city's chief administrator, executive officer, and official representative, and is responsible for the general management of the city and for seeing that all laws and ordinances are enforced.\n\nThe original city council line-up of 14 members (nine district-based and five at-large positions) was based on a U.S. Justice Department mandate which took effect in 1979. At-large council members represent the entire city. Under the city charter, once the population in the city limits exceeded 2.1 million residents, two additional districts were to be added. The city of Houston's official 2010 census count was 600 shy of the required number; however, as the city was expected to grow beyond 2.1 million shortly thereafter, the two additional districts were added for, and the positions filled during, the August 2011 elections.\n\nThe city controller is elected independently of the mayor and council. The controller's duties are to certify available funds prior to committing such funds and processing disbursements. The city's fiscal year begins on July 1 and ends on June 30. Chris Brown is the city controller, serving his first term as of January 2016.\n\nAs the result of a 2015 referendum in Houston, a mayor is elected for a four-year term, and can be elected to as many as two consecutive terms.Houston voters lengthen term limits for city officials \"[http://www.chron.com/politics/election/local/article/Voters-lengthen-term-limits-for-city-officials-6609018.php]. Retrieved on January 10, 2015. The term limits were spearheaded in 1991 by conservative political activist Clymer Wright. During 1991–2015, the city controller and city council members were subjected to a two-year, three-term limitation – the 2015 referendum amended term limits to two four-year terms. As of 2017 some councilmembers who served two terms and won a final term will have served eight years in office, whereas a freshman councilmember who won a position in 2013 can serve up to two additional terms under the previous term limit law – a select few will have at least 10 years of incumbency once their term expires.\n\nHouston is considered to be a politically divided city whose balance of power often sways between Republicans and Democrats. Much of the city's wealthier areas vote Republican while the city's working class and minority areas vote Democratic. According to the 2005 Houston Area Survey, 68 percent of non-Hispanic whites in Harris County are declared or favor Republicans while 89 percent of non-Hispanic blacks in the area are declared or favor Democrats. About 62 percent of Hispanics (of any race) in the area are declared or favor Democrats.Klineberg, Stephen. [https://wayback.archive-it.org/all/20090227010353/http://cohesion.rice.edu/CentersAndInst/HAS/emplibrary/REPORT-2005.pdf Houston Area Survey 1982–2005], Page 40. The city has often been known to be the most politically diverse city in Texas, a state known for being generally conservative. As a result, the city is often a contested area in statewide elections. In 2009, Houston became the first US city with a population over 1 million citizens to elect a gay mayor, by electing Annise Parker.\n\nCrime\n\nHouston had 303 homicides in 2015 and 302 homicides in 2016. Officials predicted there would be 323 homicides in 2016. Instead, there was no increase in Houston's homicide rate between 2015 and 2016.\n\nHouston's murder rate ranked 46th of U.S. cities with a population over 250,000 in 2005 (per capita rate of 16.3 murders per 100,000 population).\" ,\" Morgan Quitno. Retrieved on November 29, 2006. In 2010, the city's murder rate (per capita rate of 11.8 murders per 100,000 population) was ranked sixth among U.S. cities with a population of over 750,000 (behind New York City, Chicago, Detroit, Dallas, and Philadelphia)FBI Uniform 2010 (prov.) Crime Report Table 4 \"[https://www.fbi.gov/about-us/cjis/ucr/crime-in-the-u.s/2010/preliminary-annual-ucr-jan-dec-2010/data-tables/table-4/table-4/view]. Retrieved on July 6, 2011. according to the Federal Bureau of Investigation (FBI). Murders fell by 37 percent from January to June 2011, compared with the same period in 2010. Houston's total crime rate including violent and nonviolent crimes decreased by 11 percent.Lee, Renee C. \"[http://www.chron.com/disp/story.mpl/metropolitan/7669040.html New FBI stats suggest crime's in decline in Houston]\", Houston Chronicle, July 26, 2011, p. B2. Retrieved July 26, 2006. The FBI's Uniform Crime Report (UCR) indicates a downward trend of violent crime in Houston over the ten- and twenty-year periods ending in 2016, which is consistent with national trends. This trend toward lower rates of violent crime in Houston includes the murder rate, though it had seen a four-year uptick that lasted through 2015. Houston's violent crime rate is 8.6% percent higher in 2016 from the previous year. However, from 2006 to 2016, violent crime is still down 12 percent in Houston. \n\nHouston is a significant hub for trafficking of cocaine, cannabis, heroin, MDMA, and methamphetamine due to its size and proximity to major illegal drug exporting nations.\"[http://www.usdoj.gov/ndic/pubs32/32771/distribution.htm Distribution – Houston High Intensity Drug Trafficking Area Drug Market Analysis 2009].\" U.S. Department of Justice. Retrieved on August 11, 2009. Houston is one of the country's largest hubs for human trafficking.\n\nIn the early 1970s, Houston, Pasadena and several coastal towns were the site of the Houston mass murders, which at the time were the deadliest case of serial killing in American history.\n\nEducation\n\nSeventeen school districts exist within the city of Houston. The Houston independent School District (HISD) is the seventh-largest school district in the United States and the largest in Texas.\"[http://www.eschoolnews.com/2006/02/21/houston-isd-automates-lunch/ Houston ISD automates lunch]\", eSchool News online, February 21, 2006. Retrieved on December 16, 2006. HISD has 112 campuses that serve as magnet or vanguard schools—specializing in such disciplines as health professions, visual and performing arts, and the sciences. There are also many charter schools that are run separately from school districts. In addition, some public school districts also have their own charter schools.\n\nThe Houston area encompasses more than 300 private schools,[http://www.houston-texas-online.com/privateschools.html Private Schools]. Houston-Texas-Online. 2004. Retrieved on January 10, 2007.[http://www.houstonareaweb.com/private_schools/ Houston Private Schools]. HoustonAreaWeb.com. Retrieved on January 10, 2007.[https://web.archive.org/web/20080101054600/http://www.hlsr.com/ed/sa/sa_p.aspx School Art Participation]. Houston Livestock Show and Rodeo. Retrieved on January 10, 2007. Archived at the Internet Archive Wayback Machine. many of which are accredited by Texas Private School Accreditation Commission recognized agencies. The Houston Area independent schools offer education from a variety of different religious as well as secular viewpoints.[http://houstonprivateschools.org/index.cfm?CFID15996033&CFTOKEN\n41756059&MenuItemID96&MenuGroup\nHome%20New About HAIS] . Houston Area independent schools. 2007. Retrieved on March 27, 2007. The Houston area Catholic schools are operated by the Archdiocese of Galveston-Houston.\n\nColleges and universities\n\nFour distinct state universities are located in Houston. The University of Houston is a nationally recognized Tier One research university, and is the flagship institution of the University of Houston System. The  university in Texas, the University of Houston has nearly 44,000 students on its 667-acre campus in southeast Houston. The University of Houston–Clear Lake and the University of Houston–Downtown are  universities; they are not branch campuses of the University of Houston. Located in the historic community of Third Ward is Texas Southern University, one of the largest and most comprehensive historically black universities in the United States. Texas Southern University is also the first state university in Houston.\n\nSeveral private institutions of higher learning—ranging from liberal arts colleges, such as the University of St. Thomas, Houston's only Catholic university, to Rice University, the most selective university in Texas—are located within the city. Houston Baptist University, affiliated with the Baptist General Convention of Texas, offers bachelor's and graduate degrees. It was founded in 1960 and is located in the Sharpstown area in Southwest Houston.\n\nThree community college districts exist with campuses in and around Houston. The Houston Community College System serves most of Houston. The northwestern through northeastern parts of the city are served by various campuses of the Lone Star College System, while the southeastern portion of Houston is served by San Jacinto College, and a northeastern portion is served by Lee College.\"[http://www.lee.edu/about/ About Lee College].\" Lee College. Retrieved on May 6, 2013. The Houston Community College and Lone Star College systems are within the 10 largest institutions of higher learning in the United States.\n\nMedia\n\nThe primary network-affiliated television stations are KPRC-TV (NBC), KHOU-TV (CBS), KTRK-TV (ABC), KRIV (Fox), KIAH (The CW), and KTXH (MyNetworkTV). KTRK-TV, KRIV and KTXH operate as owned-and-operated stations of their networks.\n\nThe Houston–The Woodlands–Sugar Land metropolitan area is served by one public television station and one public radio station. KUHT (Houston Public Media) is a PBS member station and is the first public television station in the United States. Houston Public Radio is listener-funded and comprises one NPR member station, KUHF (News 88.7). The University of Houston System owns and holds broadcasting licenses to KUHT and KUHF. The stations broadcast from the Melcher Center for Public Broadcasting, located on the campus of the University of Houston.\n\nHouston is served by the Houston Chronicle, its only major daily newspaper with wide distribution. The Hearst Corporation, which owns and operates the Houston Chronicle, bought the assets of the Houston Post—its long-time rival and main competition—when Houston Post ceased operations in 1995. The Houston Post was owned by the family of former Lieutenant Governor Bill Hobby of Houston. The only other major publication to serve the city is the Houston Press—a free alternative weekly with a weekly readership of more than 300,000.\n\nInfrastructure\n\nHealthcare\n\nHouston is the seat of the internationally renowned Texas Medical Center, which contains the world's largest concentration of research and healthcare institutions. All 49 member institutions of the Texas Medical Center are non-profit organizations. They provide patient and preventive care, research, education, and local, national, and international community well-being.\nEmploying more than 73,600 people, institutions at the medical center include 13 hospitals and two specialty institutions, two medical schools, four nursing schools, and schools of dentistry, public health, pharmacy, and virtually all health-related careers. It is where one of the first—and still the largest—air emergency service, Life Flight, was created, and a very successful inter-institutional transplant program was developed. More heart surgeries are performed at the Texas Medical Center than anywhere else in the world.\n\nSome of the academic and research health institutions at the center include MD Anderson Cancer Center, Baylor College of Medicine, UT Health Science Center, Memorial Hermann Hospital, Houston Methodist Hospital, Texas Children's Hospital, and University of Houston College of Pharmacy.\n\nThe Baylor College of Medicine has annually been considered within the top ten medical schools in the nation; likewise, the MD Anderson Cancer Center has consistently ranked as one of the top two U.S. hospitals specializing in cancer care by U.S. News & World Report since 1990. The Menninger Clinic, a renowned psychiatric treatment center, is affiliated with Baylor College of Medicine and the Houston Methodist Hospital System. With hospital locations nationwide and headquarters in Houston, the Triumph Healthcare hospital system is the third largest long term acute care provider nationally.\n\nTransportation\n\nAccording to the 1990 U.S. Census, 71.7% of Houston (city) commuters drove alone to work. By 2009, the percentage of Houston (city) workers who drove to work alone rose to 75.6%. In 2016, the American Community Survey estimated modal shares for Houston (city) commuters of 77.2% for driving alone, 11.4% for carpooling, 3.6% for riding transit, 2.1% for walking, and .5% for cycling.\n\nHighways\n\n \nHouston's freeway system comprises  of freeways and expressways in a ten-county metropolitan area. , Greater Houston Partnership. Retrieved on March 21, 2009. However, the Texas Transportation Institute's annual Urban Mobility Report found that Houston had the fourth-worst congestion in the country with commuters spending an average of 58 hours in traffic in 2009.\n\nHouston's highway system has a hub-and-spoke freeway structure serviced by multiple loops. The innermost loop is Interstate 610, which encircles downtown, the medical center, and many core neighborhoods with around a 8 mi diameter. Beltway 8 and its freeway core, the Sam Houston Tollway, form the middle loop at a diameter of roughly 23 mi. A proposed highway project, State Highway 99 (Grand Parkway), will form a third loop outside Houston, totaling 180 miles in length and making an almost-complete circumference, with the exception of crossing the ship channel. As of June 2014, two of eleven segments of State Highway 99 have been completed to the west of Houston, and three northern segments totaling 38 miles. In addition to the Sam Houston Tollway loop mentioned above, the Harris County Toll Road Authority currently operates four spoke tollways: The Katy Managed Lanes of Interstate 10, the Hardy Toll Road, the Westpark Tollway, and the Fort Bend Parkway Extension. Other spoke roads either planned or under construction include Crosby Freeway, and the future Alvin Freeway.\n\nHouston's freeway system is monitored by Houston TranStar—a partnership of four government agencies that are responsible for providing transportation and emergency management services to the region.[http://www.houstontranstar.org/about_transtar/ About Houston TranStar]. Houston TranStar. 2008. Retrieved on February 17, 2008.\n\nTransit systems\n\nThe Metropolitan Transit Authority of Harris County (METRO) provides public transportation in the form of buses, light rail, and lift vans.\n\nMETRO began light rail service on January 1, 2004, with the inaugural track (\"Red Line\") running about 8 mi from the University of  (UHD), which traverses through the Texas Medical Center and terminates at NRG Park. METRO is currently in the design phase of a 10-year expansion plan that will add five more lines. and expand the current Red Line. Amtrak, the national passenger rail system, provides service three times a week to Houston via the  (Los Angeles–New Orleans), which stops at the Houston Amtrak Station on the north side of the downtown area. The station saw 14,891 boardings and alightings in fiscal year 2008. In 2012, there was a 25 percent increase in ridership to 20,327 passengers embarking from the Houston Amtrak Station.\n\nCycling\n\nHouston has the largest number of bike commuters in Texas with over 160 miles of dedicated bikeways. The city is currently in the process of expanding its on and off street bikeway network. A bicycle sharing system known as Houston B-Cycle currently operates 29 different stations in downtown and neighboring areas.\n\nAirports\n\nHouston is served by three airports, two of which are commercial that served 52 million passengers in 2007 and managed by the Houston Airport System. The Federal Aviation Administration and the state of Texas selected the \"Houston Airport System as Airport of the Year\" for 2005, largely because of its multi-year, $3.1 billion airport improvement program for both major airports in Houston.\n\nThe primary city airport is George Bush Intercontinental Airport (IAH), the tenth-busiest in the United States for total passengers, and forty third-busiest worldwide. Bush Intercontinental currently ranks fourth in the United States for non-stop domestic and international service with 182 destinations.[http://www.fly2houston.com/iahAbout About George Bush Intercontinental Airport] . Houston Airport System. Retrieved on January 11, 2007. In 2006, the United States Department of Transportation named IAH the fastest-growing of the top ten airports in the United States. The Houston Air Route Traffic Control Center stands on the George Bush Intercontinental Airport grounds.\n\nHouston was the headquarters of Continental Airlines until its 2010 merger with United Airlines with headquarters in Chicago; regulatory approval for the merger was granted in October of that year. Bush Intercontinental became United Airlines' largest airline hub. The airline retained a significant operational presence in Houston while offering more than 700 daily departures from the city.[http://www.fly2houston.com/iahAbout Facts and Figures] . Houston Airport System. 2007. Retrieved on February 28, 2007. In early 2007, Bush Intercontinental Airport was named a model \"port of entry\" for international travelers by U.S. Customs and Border Protection.\n\nThe second-largest commercial airport is William P. Hobby Airport (named Houston International Airport until 1967) which operates primarily short- to medium-haul domestic flights. However, in 2015 Southwest Airlines launched service from a new international terminal at Hobby airport to several destinations in Mexico, Central America, and the Caribbean. These were the first international flights flown from Hobby since 1969. Houston's aviation history is showcased in the 1940 Air Terminal Museum located in the old terminal building on the west side of the airport. Hobby Airport has been recognized with two awards for being one of the top five performing airports in the world and for customer service by Airports Council International.\n\nHouston's third municipal airport is Ellington Airport (a former U.S. Air Force base) used by military, government, NASA, and general aviation sectors.\n\nSister cities\n\nThe Houston Office of Protocol and International Affairs is the city's liaison to Houston's sister cities and to the national governing organization, Sister Cities International. Through their official city-to-city relationships, these volunteer associations promote people-to-people diplomacy and encourage citizens to develop mutual trust and understanding through commercial, cultural, educational, and humanitarian exchanges.\n\n*Abu Dhabi (United Arab Emirates) – 2001\n* Baku (Azerbaijan) – 1976\n* Basrah (Iraq) – 2015\n* Chiba (Japan) – 1973\n* Grampian Region, Aberdeen (United Kingdom) – 1979\n* Guayaquil (Ecuador) – 1987\n* Huelva (Spain) – 1969\n* Istanbul (Turkey) – 1986\n* Karachi (Pakistan) – 2009\n* Leipzig (Germany) – 1993\n* Luanda (Angola) – 2003\n*Nice (France) – 1973\n* Perth (Australia) – 1983\n* Shenzhen (China) – 1986\n* Stavanger (Norway) – 1980\n* Taipei (Taiwan) – 1963\n* Tampico (Mexico) – 2003\n* Tyumen (Russia) – 1995\n* Wuhan (China) – 2016",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Houston" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13774" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Houston ( ) is the most populous city in the U.S. state of Texas and the fourth-most populous city in the United States, with a census-estimated 2016 population of 2.303 million within a land area of . It is the largest city in the Southern United States, and the seat of Harris County. Located in Southeast Texas near the Gulf of Mexico, it is the principal city of the Greater Houston metro area, which is the fifth-most populated MSA in the United States.\n\nHouston was founded on August 30, 1836, near the banks of Buffalo Bayou (now known as Allen's Landing) and incorporated as a city on June 5, 1837. The city was named after former General Sam Houston, who was president of the Republic of Texas and had commanded and won at the Battle of San Jacinto 25 mi east of where the city was established. The burgeoning port and railroad industry, combined with oil discovery in 1901 and Houston's replacement of Galveston as Texas's primary port following a devastating hurricane, has induced continual surges in the city's population. In the mid-20th century, Houston became the home of the Texas Medical Center—the world's largest concentration of healthcare and research institutions—and NASA's Johnson Space Center, where the Mission Control Center is located.\n\nHouston's economy has a broad industrial base in energy, manufacturing, aeronautics, and transportation. Leading in health care sectors and building oilfield equipment, Houston has the second most Fortune 500 headquarters of any U.S. municipality within its city limits (after New York City).[http://money.cnn.com/magazines/fortune/fortune500/2011/cities/ Fortune 500 2010: Cities] Accessed May 25, 2011 The Port of Houston ranks first in the United States in international waterborne tonnage handled and second in total cargo tonnage handled. Nicknamed the \"Space City\", Houston is a global city, with strengths in business, international trade, entertainment, culture, media, fashion, science, sports, technology, education, medicine, and research. The city has a population from various ethnic and religious backgrounds and a large and growing international community. Houston is the most diverse city in Texas and has been described as the most racially and ethnically diverse major metropolis in the U.S. It is home to many cultural institutions and exhibits, which attract more than 7 million visitors a year to the Museum District. Houston has an active visual and performing arts scene in the Theater District and offers year-round resident companies in all major performing arts.\" \", Greater Houston Partnership. Retrieved on March 21, 2009. \n\nHistory\n\nOn August 26, 1836, two real estate entrepreneurs from New York, Augustus Chapman Allen and John Kirby Allen, purchased 6642 acre of land along Buffalo Bayou with the intent of founding a city.Fernandez,\n Manny. [https://www.nytimes.com/2017/09/03/us/houston-highway-resilience-snapshots.html Over 21 Miles of Highway, Snapshots of a Resilient Houston], New York Times, September 3, 2017. According to historian, David McComb, \"[T]he brothers, on August 26, 1836, bought from Elizabeth E. Parrott, wife of T.F.L. Parrott and widow of John Austin, the south half of the lower league [2,214 acres of land] granted to her by her late husband. They paid $5,000 total, but only $1,000 of this in cash; notes made up the remainder.\" The Allen brothers decided to name the city after Sam Houston, the popular general at the Battle of San Jacinto, who was elected President of Texas in September 1836. The great majority of slaves in Texas came with their owners from the older slave states. Sizable numbers, however, came through the domestic slave trade. New Orleans was the center of this trade in the Deep South, but slave dealers were in Houston. Thousands of enslaved blacks lived near the city before the Civil War. Many of them near the city worked on sugar and cotton plantations, while most of those in the city limits had domestic and artisan jobs.\nHouston was granted incorporation on June 5, 1837, with James S. Holman becoming its first mayor. In the same year, Houston became the county seat of Harrisburg County (now Harris County) and the temporary capital of the Republic of Texas. In 1840, the community established a chamber of commerce in part to promote shipping and waterborne business at the newly created port on Buffalo Bayou.[http://www.houstontx.gov/savvy/archives/sum06/sum06_heritage.htm John Perry, \"Born on the Bayou: city's murky start\"] , City Savvy Online Edition. Published Summer 2006. Retrieved on February 6, 2007.\n\nBy 1860, Houston had emerged as a commercial and railroad hub for the export of cotton. Railroad spurs from the Texas inland converged in Houston, where they met rail lines to the ports of Galveston and Beaumont. During the American Civil War, Houston served as a headquarters for General John Bankhead Magruder, who used the city as an organization point for the Battle of Galveston. After the Civil War, Houston businessmen initiated efforts to widen the city's extensive system of bayous so the city could accept more commerce between downtown and the nearby port of Galveston. By 1890, Houston was the railroad center of Texas.\n\nIn 1900, after Galveston was struck by a devastating hurricane, efforts to make Houston into a viable deep-water port were accelerated.[http://www.tsl.state.tx.us/governors/rising/sayers-galv.html J.H.W. Stele to Sayers, September 11–12, 1900]. Texas State Library & Archives Commission, Retrieved on August 31, 2007 The following year, the discovery of oil at the Spindletop oil field near Beaumont prompted the development of the Texas petroleum industry. In 1902, President Theodore Roosevelt approved a $1-million improvement project for the Houston Ship Channel. By 1910, the city's population had reached 78,800, almost doubling from a decade before. African Americans formed a large part of the city's population, numbering 23,929 people, which was nearly one-third of the residents.\n\nPresident Woodrow Wilson opened the deep-water Port of Houston in 1914, seven years after digging began. By 1930, Houston had become Texas' most populous city and Harris County the most populous county. In 1940, the Census Bureau reported Houston's population as 77.5% white and 22.4% black.\n\nWhen World War II started, tonnage levels at the port decreased and shipping activities were suspended; however, the war did provide economic benefits for the city. Petrochemical refineries and manufacturing plants were constructed along the ship channel because of the demand for petroleum and synthetic rubber products by the defense industry during the war. Ellington Field, initially built during World War I, was revitalized as an advanced training center for bombardiers and navigators. The Brown Shipbuilding Company was founded in 1942 to build ships for the U.S. Navy during World War II. Due to the boom in defense jobs, thousands of new workers migrated to the city, both blacks and whites competing for the higher-paying jobs. President Roosevelt had established a policy of nondiscrimination for defense contractors, and blacks gained some opportunities, especially in shipbuilding, although not without resistance from whites and increasing social tensions that erupted into occasional violence. Economic gains of blacks who entered defense industries continued in the postwar years.\"Race, Roosevelt, and Wartime Production: Fair Employment in World War II Labor Markets\", William J. Collins, The American Economic Review, Vol. 91, No. 1 (March 2001), pp. 272–286, Published by: American Economic Association, Stable URL: https://www.jstor.org/stable/2677909\n\nIn 1945, the M.D. Anderson Foundation formed the Texas Medical Center. After the war, Houston's economy reverted to being primarily port-driven. In 1948, the city annexed several unincorporated areas, more than doubling its size. Houston proper began to spread across the region.\n\nIn 1950, the availability of air conditioning provided impetus for many companies to relocate to Houston, where wages were lower than those in the North; this resulted in an economic boom and produced a key shift in the city's economy toward the energy sector.[http://www.oldhouseweb.com/stories/Detailed/725.shtml \"How Air Conditioning Changed America\"], The Old House Web, Retrieved on April 4, 2007[http://www.hgs.org/en/articles/printview.asp?26 \"A Short History\"] , Houston Geological Auxiliary, Retrieved on April 4, 2007 \n\nThe increased production of the expanded shipbuilding industry during World War II spurred Houston's growth, as did the establishment in 1961 of NASA's \"Manned Spacecraft Center\" (renamed the Lyndon B. Johnson Space Center in 1973). This was the stimulus for the development of the city's aerospace industry. The Astrodome, nicknamed the \"Eighth Wonder of the World\", opened in 1965 as the world's first indoor domed sports stadium.\n\nDuring the late 1970s, Houston had a population boom as people from the Rust Belt states moved to Texas in large numbers. The new residents came for numerous employment opportunities in the petroleum industry, created as a result of the Arab oil embargo. With the increase in professional jobs, Houston has become a destination for many college-educated persons, including African Americans in a reverse Great Migration from northern areas.\n\nIn 1997, Houstonians elected Lee P. Brown as the city's first African American mayor.\n\nIn June 2001, Tropical Storm Allison dumped up to 40 in of rain on parts of Houston, causing what was then the worst flooding in the city's history. The storm cost billions of dollars in damage and killed 20 people in Texas. By December of that same year, Houston-based energy company Enron collapsed into the third-largest ever U.S. bankruptcy during an investigation surrounding fabricated partnerships that were allegedly used to hide debt and inflate profits.\n\nIn August 2005, Houston became a shelter to more than 150,000 people from New Orleans, who evacuated from Hurricane Katrina. One month later, about 2.5 million Houston-area residents evacuated when Hurricane Rita approached the Gulf Coast, leaving little damage to the Houston area. This was the largest urban evacuation in the history of the United States.[http://www.house.gov/brady/2007_appropriations.shtml 8th Congressional District of Texas 2007 Appropriations Project Requests] . Congressman Kevin Brady, 8th District of Texas. Retrieved on January 10, 2007. In September 2008, Houston was hit by Hurricane Ike. As many as 40% of residents refused to leave Galveston Island because they feared the type of traffic problems that had happened after Hurricane Rita.\n\nDuring the floods in 2015 and 2016, parts of the city were covered in several inches of water.\n\nIn 2017, Houston hosted Super Bowl LI. This is the third Super Bowl for the city, with the previous games being held in 1974 and 2004.\n\nIn late August 2017, Hurricane Harvey caused severe flooding in the Houston area, with some areas receiving over 50 in of rain. Winds reached up to 145 miles per hour, and rainfall exceeded 50 inches in several areas locally, breaking the national record for rainfall. The damage for the Houston area is estimated at up to $125 billion U.S. dollars, and it is considered to be one of the worst natural disasters in the history of the United States,\" \", CNN News. Retrieved on August 25, 2017. with the death toll exceeding 70 people. On January 31, 2018, Houston City Council agreed to forgive large water bills thousands of households faced in the aftermath of Hurricane Harvey, as Houston Public Works found 6,362 homeowners' accounts doubled at least. \n\nGeography\n\nHouston is located 165 mi east of Austin,Lomax, John Nova. \"[http://www.texasmonthly.com/story/texas This Is Texas].\" Texas Monthly. February 2013. Retrieved on April 30, 2013. \"No, the rightful standard-bearer of our state—the city with the greatest number of people, of cultural happenings, of medical facilities, of gangbuster enterprises—is located 165 miles to the east of Texas's pink-granite dome.\" – The first part is discussing Houston. The \"pink granite dome\" is the Texas State Capitol in Austin. 112 mi west of the Louisiana border, and 250 mi south of Dallas.Martin, Roland. \" [http://www.cnn.com/2012/01/06/opinion/opinion-texas-football-roland-martin/index.html?hpthp_bn1 Football power in Texas has shifted to Houston].\" CNN. January 6, 2012. Retrieved on January 7, 2012. According to the United States Census Bureau, the city has a total area of ; this comprises  of land and  covered by water.[http://quickfacts.census.gov/qfd/states/48/4835000.html Houston (city) QuickFacts from the US Census Bureau] . U.S. Census Bureau. Retrieved on February 28, 2009. The Piney Woods are north of Houston. Most of Houston is located on the gulf coastal plain, and its vegetation is classified as temperate grassland and forest. Much of the city was built on forested land, marshes, swamp, or prairie and are all still visible in surrounding areas. The flatness of the local terrain, when combined with urban sprawl, has made flooding a recurring problem for the city.[http://www.crwr.utexas.edu/gis/gishyd98/class/trmproj/ahrens/prepro.htm Flood Forecasting for the Buffalo Bayou Using CRWR-PrePro and HEC-HMS] . Center for Research in Water Resources, The University of Texas at Austin Retrieved on January 10, 2007. Downtown stands about 50 ft above sea level,[http://www.topoquest.com/map.asp?lat\n29.75737&lon-95.36387&size\nm&u4&datum\nnad27&layerDRG&s\n100 Downtown Houston, Texas]. TopoQuest.com Retrieved on July 5, 2008. and the highest point in far northwest Houston is about 125 ft in elevation.[http://www.topoquest.com/map.asp?lat29.96645&lon\n-95.56326&sizel&datum\nnad83&layerDRG&s\n100 USGS Satsuma (TX) Topo Map]. TopoQuest.com. 2008. Retrieved on July 5, 2008. Note: The boundaries of the City of Houston are shown as \"HOUSTON CORP BDY\" along the dotted line.[http://www.houstontx.gov/superneighborhoods/profiles/SN_1.htm Super Neighborhood# 1-Willowbrook] . City of Houston. Retrieved on May 15, 2012. The city once relied on groundwater for its needs, but land subsidence forced the city to turn to ground-level water sources such as Lake Houston, Lake Conroe, and Lake Livingston. . United States Geological Survey. Retrieved on January 11, 2007. The city owns surface water rights for 1.20 billion gallons of water a day in addition to 150 million gallons a day of groundwater.\n\nHouston has four major bayous passing through the city that accept water from the extensive drainage system. Buffalo Bayou runs through downtown and the Houston Ship Channel, and has three tributaries: White Oak Bayou, which runs through the Houston Heights community northwest of Downtown and then towards Downtown; Brays Bayou, which runs along the Texas Medical Center; and Sims Bayou, which runs through the south of Houston and downtown Houston. The ship channel continues past Galveston and then into the Gulf of Mexico.\n\nGeology\n\nHouston is flat marshy area where an extensive drainage system has been built. The adjoining prairie land drains into the city which is prone to flooding. Underpinning Houston's land surface are unconsolidated clays, clay shales, and poorly cemented sands up to several miles deep. The region's geology developed from river deposits formed from the erosion of the Rocky Mountains. These sediments consist of a series of sands and clays deposited on decaying organic marine matter, that over time, transformed into oil and natural gas. Beneath the layers of sediment is a water-deposited layer of halite, a rock salt. The porous layers were compressed over time and forced upward. As it pushed upward, the salt dragged surrounding sediments into salt dome formations, often trapping oil and gas that seeped from the surrounding porous sands. The thick, rich, sometimes black, surface soil is suitable for rice farming in suburban outskirts where the city continues to grow.[https://tshaonline.org/handbook/online/articles/hch07 Harris County]. Handbook of Texas Online. Retrieved on January 10, 2007.[https://tshaonline.org/handbook/online/articles/afr01 RICE CULTURE]. Handbook of Texas Online. Retrieved on January 10, 2007.\n\nThe Houston area has over 150 active faults (estimated to be 300 active faults) with an aggregate length of up to 310 mi,Earl R. Verbeek, Karl W. Ratzlaff, Uel S. Clanton. \"[http://pubs.usgs.gov/mf-maps/mf1136/mf1136/ Faults in Parts of North-Central and Western Houston Metropolitan Area, Texas]\", United States Geological Survey, September 16, 2005. Retrieved on December 14, 2006.Sachin D. Shah and Jennifer Lanning-Rush. [http://pubs.usgs.gov/sim/2005/2874/ Principal Faults in the Houston, Texas, Metropolitan Area], U.S. Geological Survey. Retrieved on February 23, 2012. including the Long Point–Eureka Heights fault system which runs through the center of the city. No significant historically recorded earthquakes have occurred in Houston, but researchers do not discount the possibility of such quakes having occurred in the deeper past, nor occurring in the future. Land in some areas southeast of Houston is sinking because water has been pumped out of the ground for many years. It may be associated with slip along the faults; however, the slippage is slow and not considered an earthquake, where stationary faults must slip suddenly enough to create seismic waves.[https://web.archive.org/web/20070715065340/http://www.ig.utexas.edu/research/projects/eq/faq/tx.htm Texas Earthquakes], University of Texas Institute for Geophysics, July 2001. Retrieved on August 29, 2007. These faults also tend to move at a smooth rate in what is termed \"fault creep\", which further reduces the risk of an earthquake.\n\nClimate\n\nHouston's climate is classified as humid subtropical (Cfa in the Köppen climate classification system), typical of Southern United States. The city features very hot, humid summers, and generally mild winters. While not located in \"Tornado Alley\", like much of the rest of Texas, spring supercell thunderstorms sometimes bring tornadoes to the area. Prevailing winds are from the south and southeast during most of the year, which bring heat and moisture from the nearby Gulf of Mexico.\n\nDuring the summer, temperatures commonly reach over 90 °F, with an average of 106.5 days per year, including a majority from June to September, with a high of 90 °F or above and 4.6 days at or over 100 °F. However, humidity usually yields a higher heat index. Summer mornings average over 90% relative humidity.\"[https://web.archive.org/web/20011101082154/http://lwf.ncdc.noaa.gov/oa/climate/online/ccd/avgrh.html Average Relative Humidity (%)]\", National Climatic Data Center. Retrieved on February 23, 2012. Although sea breezes are present, they don't offer substantial relief, except in the southeastern areas of the city closer to the Gulf.Afternoon thunderstorms are common.[https://web.archive.org/web/20070209115107/http://www.met.utah.edu/jhorel/html/wx/climate/windavg.html Wind – Average Speed (mph)]. Department of Meteorology, University of Utah. 1993. Retrieved on January 10, 2007 To cope with the strong humidity and heat, people use air conditioning in nearly every vehicle and building. In 1980, Houston was described as the \"most air-conditioned place on earth\".[https://web.archive.org/web/20070206075059/http://www.nbm.org/blueprints/90s/summer92/contents/contents.htm A Moment in Building]. BLUEPRINTS, Volume X, Number 3, Summer 1992. National Building Museum. Retrieved on January 11, 2007. Officially, the hottest temperature ever recorded in Houston is 109 °F, which was reached both on September 4, 2000, and August 28, 2011.\n\nHouston has mild winters. In January, the normal mean temperature at Intercontinental Airport is , while that station has an average of 13 days with a low at or below freezing. Snowfall is rare. Recent snow events in Houston include a storm on December 24, 2004 when 1 in of snow accumulated in parts of the metro area.National Weather Service Forecast Office, Houston/Galveston, Texas.  Retrieved on December 1, 2006. There was also snowfall on December 7, 2017, when Houston received  of snowfall.Shayanian, Sara (December 8, 2017). \"[https://www.upi.com/Top_News/US/2017/12/08/Texas-hit-with-snow-as-winter-weather-system-aims-for-Northeast/4591512735568/ Texas hit with snow as winter weather system aims for Northeast]\". United Press International.Berger, Eric; Latson, Jennifer; Leahy, Jennifer (December 10, 2017). \"[http://www.chron.com/news/houston-texas/article/Snow-surprises-Houston-area-residents-1612825.php Snow surprises Houston-area residents]\". Houston Chronicle.Matthews, Blake (December 8, 2017). \"[http://www.khou.com/news/local/record-snow-blankets-houston-and-texas/497922280 Record snow blankets Houston and Texas]\". KHOU-TV. Snowfalls of at least  on both December 10, 2008, and December 4, 2009, marked the first time measurable snowfall had occurred in two consecutive years in the city's recorded history. Houston has seen snowfall 38 times between 1985 and 2018. On February 14 and February 15, 1895, Houston received 20 in of snow, its largest snowfall from one storm on record.\"[http://abc13.com/amp/weather/snow-in-houston----it-happens-more-than-you-think/2753082/ Snow in Houston: It Happens More Than You Think]\". KTRK-TV. December 8, 2017. The coldest temperature officially recorded in Houston was 5 °F on January 18, 1930. \n\nHouston has historically received an ample amount of rainfall, averaging about  annually based on records between 1981 and 2010. Localized flooding often occurs, owing to the extremely flat topography and widespread typical clay-silt prairie soils, which do not drain quickly. As of August 27, 2017, Houston and its surrounding areas received intense flash flooding due to Hurricane Harvey. Overall, there have been more casualties and property loss from floods in Houston, than any other locality in the US.https://www.theguardian.com/environment/2017/jun/16/texas-flooding-houston-climate-change-disaster\n\nHouston has excessive ozone levels and is routinely ranked among the most ozone-polluted cities in the United States.\"[http://www.lung.org/assets/documents/publications/state-of-the-air/state-of-the-air-report-2005.pdf State of the Air 2005, National and Regional Analysis] \", American Lung Association, page 26, March 25, 2005. Retrieved on February 17, 2006. Ground-level ozone, or smog, is Houston's predominant air pollution problem, with the American Lung Association rating the metropolitan area's ozone level twelfth on the \"Most Polluted Cities by Ozone\" in 2017, after major cities such as Los Angeles, Phoenix, New York City and Denver. The industries located along the ship channel are a major cause of the city's air pollution.\"[http://www.cleanhouston.org/air/index.htm Summary of the Issues] \", Citizens League for Environmental Action Now, August 1, 2004. Retrieved on February 17, 2006. The rankings are in terms of peak-based standards, focusing strictly on the worst days of the year; the average ozone levels in Houston are lower than what is seen in most other areas of the country, as dominant winds ensure clean, marine air from the Gulf. \n\nCityscape\n\nHouston was incorporated in 1837 under the ward system of representation. The ward designation is the progenitor of the 11 current-day geographically oriented Houston City Council districts. Locations in Houston are generally classified as either being inside or outside the Interstate 610 Loop. The inside encompasses the central business district and many pre–World War II residential neighborhoods. More recently, high-density residential areas have been developed within the loop. The city's outlying areas, suburbs, and enclaves are located outside the loop. Beltway 8 encircles the city another 5 mi farther out.\n\nThough Houston is the largest city in the United States without formal zoning regulations, it has developed similarly to other Sun Belt cities because the city's land use regulations and legal covenants have played a similar role. Regulations include mandatory lot size for single-family houses and requirements that parking be available to tenants and customers. Such restrictions have had mixed results. Though some have blamed the city's low density, urban sprawl, and lack of pedestrian-friendliness on these policies, the city's land use has also been credited with having significant affordable housing, sparing Houston the worst effects of the 2008 real estate crisis. The city issued 42,697 building permits in 2008 and was ranked first in the list of healthiest housing markets for 2009.\n\nVoters rejected efforts to have separate residential and commercial land-use districts in 1948, 1962, and 1993. Consequently, rather than a single central business district as the center of the city's employment, multiple districts have grown throughout the city in addition to downtown which include Uptown, Texas Medical Center, Midtown, Greenway Plaza, Memorial City, Energy Corridor, Westchase, and Greenspoint.\n\nArchitecture\n\nHouston has the fourth-tallest skyline in North America (after New York City, Chicago, and Toronto) and 36th-tallest in the world as of 2018.https://tudl0867.home.xs4all.nl/skylines.html A seven-mile (11 km) system of tunnels and skywalks links downtown buildings containing shops and restaurants, enabling pedestrians to avoid summer heat and rain while walking between buildings.\n\nIn the 1960s, Downtown Houston consisted of a collection of midrise office structures. Downtown was on the threshold of an energy industryled boom in 1970. A succession of skyscrapers was built throughout the 1970s—many by real estate developer Gerald D. Hines—culminating with Houston's tallest skyscraper, the 75-floor, 1002 ft-tall JPMorgan Chase Tower (formerly the Texas Commerce Tower), completed in 1982. It is the tallest structure in Texas, 15th tallest building in the United States, and the 85th-tallest skyscraper in the world, based on highest architectural feature. In 1983, the 71-floor, 992 ft-tall Wells Fargo Plaza (formerly Allied Bank Plaza) was completed, becoming the second-tallest building in Houston and Texas. Based on highest architectural feature, it is the 17th-tallest in the United States and the 95th-tallest in the world. In 2007, downtown Houston had over 43 million square feet (4,000,000 m²) of office space.[http://www.houstondowntown.com/Home/GeneralInfo/About/FastFacts1/ Fast Facts, Downtown Houston] . Houstondowntown.com 2006. Retrieved on January 10, 2007.\n\nCentered on Post Oak Boulevard and Westheimer Road, the Uptown District boomed during the 1970s and early 1980s when a collection of midrise office buildings, hotels, and retail developments appeared along Interstate 610 West. Uptown became one of the most prominent instances of an edge city. The tallest building in Uptown is the 64-floor, 901 ft-tall, Philip Johnson and John Burgee designed landmark Williams Tower (known as the Transco Tower until 1999). At the time of construction, it was believed to be the world's tallest skyscraper outside a central business district. The new 20-story Skanska building and BBVA Compass Plaza are the newest office buildings built in Uptown after 30 years. The Uptown District is also home to buildings designed by noted architects I. M. Pei, César Pelli, and Philip Johnson. In the late 1990s and early 2000s, a mini-boom of midrise and highrise residential tower construction occurred, with several over 30 stories tall.[http://www.uptown-houston.com/economic/market/residential.html Residential Real Estate]. Uptown-houston.com Retrieved on January 11, 2007.  Since 2000 more than 30 high-rise buildings have gone up in Houston; all told, 72 high-rises tower over the city, which adds up to about 8,300 units. In 2002, Uptown had more than 23 million square feet (2,100,000 m²) of office space with 16 million square feet (1,500,000 m²) of class A office space.[http://www.uptown-houston.com/economic/market/office.html Commercial Real Estate]. Uptown-houston.com Retrieved on January 10, 2007. \n\nFile:Niels Esperson Building.jpg|The Niels Esperson Building stood as the tallest building in Houston from 1927 to 1929.\nFile:Chase Tower, a block away.jpg|The JPMorgan Chase Tower is the tallest building in Texas and the tallest 5-sided building in the world.\nFile:Williamstower.jpg|The Williams Tower is the tallest building in the US outside a central business district.\nFile:Bank of America Center Houston 1.jpg|The Bank of America Center by Philip Johnson is an example of postmodern architecture.\nFile:JPMorgan Chase Tower, Houston, Texas.jpg|JPMorgan Chase Tower in Houston, Texas is the tallest composite building in the world.\n\nDemographics\n\nGreater Houston is the most ethnically diverse metropolitan area in the country. In the Houston region, non-Hispanic whites make up 38 percent of the population, Hispanics 36 percent, African-Americans 17 percent and Asians 9 percent.\n\nHouston is multicultural, in part because of its many academic institutions and strong industries, as well as being a major port city. Over 90 languages are spoken in the city.\"[http://www.houstontx.gov/abouthouston/houstonfacts.html Houston Facts and Figures]\", City of Houston. Retrieved on December 15, 2006. It has among the youngest populations in the nation, . East-West Gateway Council of Governments. 2006. Retrieved on January 11, 2007. Page 25 in PDF File, labeled as page 21.[http://factfinder.census.gov/servlet/ACSSAFFFacts?_event&geo_id\n16000US4835000&_geoContext01000US%7C04000US48%7C16000US4835000&_county\nHouston&_cityTownHouston&_state\n04000US48 Houston city, Texas]. 2005 American Community Survey Data Profile Highlights, United States Census Bureau. 2005. Retrieved on January 12, 2007.[http://factfinder.census.gov/servlet/GRTTable?_bmy&-geo_id\n04000US48&-_box_head_nbrR0101&-ds_name\nACS_2005_EST_G00_&-_langen&-redoLog\nfalse&-formatUS-30&-mt_name\nACS_2005_EST_G00_R0101_US30&-_sse=on United States and States R0101. Median Age of the Total Population: 2005]. 2005 American Community Survey, United States Census Bureau. 2005. Retrieved on January 12, 2007. partly due to an influx of immigrants into Texas.[http://www.dallasfed.org/assets/documents/research/pubs/fotexas/fotexas_petersen.pdf The Face of Texas Jobs, People, Business, Change] . D'Ann Petersen and Laila Assanie, Federal Reserve Bank of Dallas. October 2005. Retrieved on January 11, 2007. An estimated 400,000 illegal immigrants reside in the Houston area.\n\nAccording to the 2010 U.S. Census, whites made up 51% of Houston's population; 26% of the total population was non-Hispanic Whites. Blacks or African Americans made up 25% of Houston's population. American Indians made up 0.7% of the population. Asians made up 6% (1.7% Vietnamese, 1.3% Chinese, 1.3% Indian, 0.9% Pakistani, 0.4% Filipino, 0.3% Korean, 0.1% Japanese), while Pacific Islanders made up 0.1%. Individuals from some other race made up 15.2% of the city's population, of which 0.2% were non-Hispanic. Individuals from two or more races made up 3.3% of the city. \nAt the 2000 Census, 1,953,631 people inhabited the city, and the population density was 3,371.7 people per square mile (1,301.8/km²). The racial makeup of the city was 49.3% White, 25.3% African American, 6.3% Asian, 0.7% American Indian, 0.1% Pacific Islander, 16.5% from some other race, and 3.1% from two or more races. In addition, Hispanics made up 37.4% of Houston's population, while non-Hispanic Whites made up 30.8%, down from 62.4% in 1970.\n\nThe median income for a household in the city was $37,000, and for a family was $40,000. Males had a median income of $32,000 versus $27,000 for females. The per capita income was $20,000. About 19% of the population and 16% of families were below the poverty line. Of the total population, 26% of those under the age of 18 and 14% of those 65 and older were living below the poverty line.\n\nAccording to a 2014 study by the Pew Research Center, 73% of the population of the city identified themselves as Christians, with 50% professing attendance at a variety of churches that could be considered Protestant, and 19% professing Roman Catholic beliefs.[http://www.pewresearch.org/fact-tank/2015/07/29/major-u-s-metropolitan-areas-differ-in-their-religious-profiles/ Major U.S. metropolitan areas differ in their religious profiles], Pew Research Center while 20% claim no religious affiliation. The same study says that other religions (including Judaism, Buddhism, Islam, and Hinduism) collectively make up about 7% of the population\n\nEconomy\n\nHouston is recognized worldwide for its energy industry—particularly for oil and natural gas—as well as for biomedical research and aeronautics. Renewable energy sources—wind and solar—are also growing economic bases in the city. The Houston Ship Channel is also a large part of Houston's economic base. Because of these strengths, Houston is designated as a global city by the Globalization and World Cities Study Group and Network and global management consulting firm A.T. Kearney. The Houston area is the top U.S. market for exports, surpassing New York City in 2013, according to data released by the U.S. Department of Commerce's International Trade Administration. In 2012, the Houston–The Woodlands–Sugar Land area recorded $110.3 billion in merchandise exports.[http://www.bizjournals.com/houston/news/2013/07/11/houston-surpasses-new-york-as-top-us.html Houston surpasses New York as top U.S. export market – Houston Business Journal]. Bizjournals.com. Retrieved on July 21, 2013. Petroleum products, chemicals, and oil and gas extraction equipment accounted for roughly two-thirds of the metropolitan area's exports last year. The top three destinations for exports were Mexico, Canada, and Brazil.[http://app1.kuhf.org/articles/1373562479-Houston-Passes-New-York-to-Become-Nations-Top-Exporting-Metro-Area.html Houston Passes New York to Become Nation's Top Exporting Metro Area]. App1.kuhf.org (July 12, 2013). Retrieved on July 21, 2013.\n\nThe Houston area is a leading center for building oilfield equipment.\" \", Greater Houston Partnership. Retrieved on March 21, 2009. Much of its success as a petrochemical complex is due to its busy ship channel, the Port of Houston.\" \", The Port of Houston Authority, May 15, 2007. Retrieved on May 27, 2007. In the United States, the port ranks first in international commerce and 10th among the largest ports in the world.\"[http://www.portofhouston.com/geninfo/overview1.html General Information] \", The Port of Houston Authority, May 15, 2007. Retrieved on May 27, 2007. Unlike most places, high oil and gasoline prices are beneficial for Houston's economy, as many of its residents are employed in the energy industry. Houston is the beginning or end point of numerous oil, gas, and products pipelines:\n\nThe Houston–The Woodlands–Sugar Land MSA's gross domestic product (GDP) in 2012 was $489 billion, making it the fourth-largest of any metropolitan area in the United States and larger than Austria's, Venezuela's, or South Africa's GDP. Only 26 countries other than the United States have a gross domestic product exceeding Houston's regional gross area product (GAP). In 2010, mining (which consists almost entirely of exploration and production of oil and gas in Houston) accounted for 26.3% of Houston's GAP up sharply in response to high energy prices and a decreased worldwide surplus of oil production capacity, followed by engineering services, health services, and manufacturing.\" \", Greater Houston Partnership. Retrieved on March 21, 2009.\n\nThe University of Houston System's annual impact on the Houston area's economy equates to that of a major corporation: $1.1 billion in new funds attracted annually to the Houston area, $3.13 billion in total economic benefit, and 24,000 local jobs generated. This is in addition to the 12,500 new graduates the U.H. System produces every year who enter the workforce in Houston and throughout the state of Texas. These degree-holders tend to stay in Houston. After five years, 80.5% of graduates are still living and working in the region.\n\nIn 2006, the Houston metropolitan area ranked first in Texas and third in the U.S. within the category of \"Best Places for Business and Careers\" by Forbes magazine.Badenhausen, Kurt. \"[https://www.forbes.com/2006/05/03/06bestplaces_best-places-for-business_land.html 2006 Best Places for Business and Careers]\", Forbes, May 4, 2006. Retrieved on December 15, 2006. Foreign governments have established 92 consular offices in Houston's metropolitan area, the third-highest in the nation. Forty foreign governments maintain trade and commercial offices here with 23 active foreign chambers of commerce and trade associations.\" \", Greater Houston Partnership. Retrieved on March 21, 2009. Twenty-five foreign banks representing 13 nations operate in Houston, providing financial assistance to the international community.\n\nIn 2008, Houston received top ranking on Kiplinger's Personal Finance Best Cities of 2008 list, which ranks cities on their local economy, employment opportunities, reasonable living costs, and quality of life. The city ranked fourth for highest increase in the local technological innovation over the preceding 15 years, according to Forbes magazine. In the same year, the city ranked second on the annual Fortune 500 list of company headquarters, first for Forbes magazine's Best Cities for College Graduates, and first on their list of Best Cities to Buy a Home. In 2010, the city was rated the best city for shopping, according to Forbes.\n\nIn 2012, the city was ranked number one for paycheck worth by Forbes and in late May 2013, Houston was identified as America's top city for employment creation.\n\nIn 2013, Houston was identified as the number one U.S. city for job creation by the U.S. Bureau of Statistics after it was not only the first major city to regain all the jobs lost in the preceding economic downturn, but also after the crash, more than two jobs were added for every one lost. Economist and vice president of research at the Greater Houston Partnership Patrick Jankowski attributed Houston's success to the ability of the region's real estate and energy industries to learn from historical mistakes. Furthermore, Jankowski stated that \"more than 100 foreign-owned companies relocated, expanded or started new businesses in Houston\" between 2008 and 2010, and this openness to external business boosted job creation during a period when domestic demand was problematically low. Also in 2013, Houston again appeared on Forbes list of Best Places for Business and Careers.\n\nCulture\n\nLocated in the American South, Houston is a diverse city with a large and growing international community. The Houston Metropolitan area is home to an estimated 1.1 million (21.4 percent) residents who were born outside the United States, with nearly two-thirds of the area's foreign-born population from south of the United States–Mexico border. Additionally, more than one in five foreign-born residents are from Asia. The city is home to the nation's third-largest concentration of consular offices, representing 86 countries.\n\nMany annual events celebrate the diverse cultures of Houston. The largest and longest-running is the annual Houston Livestock Show and Rodeo, held over 20 days from early to late March, and is the largest annual livestock show and rodeo in the world. Another large celebration is the annual night-time Houston Pride Parade, held at the end of June. Other annual events include the Houston Greek Festival,[http://www.greekfestival.org/ The Original Greek Festival, Houston, Texas]. 2006. Retrieved on January 10, 2007. Warning: Automatic sound file. Art Car Parade, the Houston Auto Show, the Houston International Festival,[http://www.ifest.org/ The Houston International Festival] . 2007. Retrieved on January 10, 2007. and the Bayou City Art Festival, which is considered to be one of the top five art festivals in the United States.\n\nHouston received the official nickname of \"Space City\" in 1967 because it is the location of NASA's Lyndon B. Johnson Space Center. Other nicknames often used by locals include \"Bayou City\", \"Clutch City\", \"Magnolia City\", and \"H-Town\".\n\nArts and theater\n\nThe Houston Theater District, located downtown, is home to nine major performing arts organizations and six performance halls. It is the second-largest concentration of theater seats in a downtown area in the United States.Ramsey, Cody. \"[http://www.texasmonthly.com/content/texas-tidbits-19 In a state of big, Houston is at the top]\", Texas Monthly, September 2002. Retrieved February 16, 2014.\"[https://web.archive.org/web/20061209083929/http://www.houstontheaterdistrict.org/en/cms/?68 About Houston Theater District]\", Houston Theater District. Retrieved on December 16, 2006. Archived at the Internet Archive Wayback Machine. Houston is one of few United States cities with permanent, professional, resident companies in all major performing arts disciplines: opera (Houston Grand Opera), ballet (Houston Ballet), music (Houston Symphony Orchestra), and theater (The Alley Theatre, Theatre Under the Stars).\"[https://web.archive.org/web/20061212043351/http://www.houstontheaterdistrict.org/en/cms/?12 Performing Arts Venues]\", Houston Theater District. Retrieved on December 16, 2006. Archived at the Internet Archive Wayback Machine. Houston is also home to folk artists, art groups and various small progressive arts organizations.\"[http://www.artcarmuseum.com/History/history.htm A Brief History of the Art Car Museum]\", ArtCar Museum of Houston. Retrieved on December 16, 2006. Houston attracts many touring Broadway acts, concerts, shows, and exhibitions for a variety of interests.[https://web.archive.org/web/20061230024248/http://www.quilts.com/home/news/index.php 2006 fall edition of International Quilt Festival attracts 53,546 to Houston]. Quilts., Inc. Press release published November 30, 2006. Retrieved on January 12, 2007. Facilities in the Theater District include the Jones Hall—home of the Houston Symphony Orchestra and Society for the Performing Arts—and the Hobby Center for the Performing Arts.\n\nThe Museum District's cultural institutions and exhibits attract more than 7 million visitors a year.[http://www.visithoustontexas.com/visitors/listing.details.php?id=23096 Houston Museum District] . Greater Houston Convention and Visitors Bureau. Retrieved on February 18, 2007. Notable facilities include The Museum of Fine Arts, Houston Museum of Natural Science, the Contemporary Arts Museum Houston, the Station Museum of Contemporary Art, Holocaust Museum Houston, and the Houston Zoo.[http://www.texasmonthly.com/promotions/cadillac/breakthroughs2/museums/ Houston Museum District Day]. Texas Monthly. 2006. Retrieved on January 10, 2007.[http://www.camh.org/ Home Page]. Contemporary Arts Museum Houston. Retrieved on January 10, 2007.\n[http://www.visithoustontexas.com/visitors/parks_and_outdoors/listing.details.php?id=23096 Houston Museum District] . Greater Houston Convention and Visitors Bureau. Retrieved on January 10, 2007. Located near the Museum District are The Menil Collection, Rothko Chapel, and the Byzantine Fresco Chapel Museum.\n\nBayou Bend is a 14 acre facility of the Museum of Fine Arts that houses one of America's most prominent collections of decorative art, paintings, and furniture. Bayou Bend is the former home of Houston philanthropist Ima Hogg.\n\nThe National Museum of Funeral History is located in Houston near the George Bush Intercontinental Airport. The museum houses the original Popemobile used by Pope John Paul II in the 1980s along with numerous hearses, embalming displays, and information on famous funerals.\n\nVenues across Houston regularly host local and touring rock, blues, country, dubstep, and Tejano musical acts. While Houston has never been widely known for its music scene, Houston hip-hop has become a significant, independent music scene that is influential nationwide.\n\nTourism and recreation\n\nThe Theater District is a 17-block area in the center of downtown Houston that is home to the Bayou Place entertainment complex, restaurants, movies, plazas, and parks. Bayou Place is a large multilevel building containing full-service restaurants, bars, live music, billiards, and Sundance Cinema. The Bayou Music Center stages live concerts, stage plays, and stand-up comedy.\nSpace Center Houston is the official visitors' center of NASA's Lyndon B. Johnson Space Center. The Space Center has many interactive exhibits including moon rocks, a shuttle simulator, and presentations about the history of NASA's manned space flight program. Other tourist attractions include the Galleria (Texas's largest shopping mall, located in the Uptown District), Old Market Square, the Downtown Aquarium, and Sam Houston Race Park.\n\nOf worthy mention are Houston's current Chinatown and the Mahatma Gandhi District. Both areas offer a picturesque view of Houston's multicultural makeup. Restaurants, bakeries, traditional-clothing boutiques, and specialty shops can be found in both areas.\n\nHouston is home to 337 parks, including Hermann Park, Terry Hershey Park, Lake Houston Park, Memorial Park, Tranquility Park, Sesquicentennial Park, Discovery Green, and Sam Houston Park. Within Hermann Park are the Houston Zoo and the Houston Museum of Natural Science. Sam Houston Park contains restored and reconstructed homes which were originally built between 1823 and 1905.[http://www.heritagesociety.org/ths.html The Heritage Society: Walk into Houston's Past] . The Heritage Society. Retrieved on January 10, 2007. A proposal has been made to open the city's first botanic garden at Herman Brown Park.Huber, Kathy. \"[http://www.chron.com/life/gardening/article/Houston-botanic-garden-slowly-becoming-reality-1896890.php Houston botanic garden slowly becoming reality].\" Houston Chronicle. Monday October 30, 2006. Retrieved on November 14, 2011.\n\nOf the 10 most populous U.S. cities, Houston has the most total area of parks and green space, 56405 acre.Continental Magazine, March 2008. p.67. The city also has over 200 additional green spaces—totaling over 19600 acre that are managed by the city—including the Houston Arboretum and Nature Center. The Lee and Joe Jamail Skatepark is a public skatepark owned and operated by the city of Houston, and is one of the largest skateparks in Texas consisting of a 30,000-ft2 (2,800 m2)in-ground facility. The Gerald D. Hines Waterwall Park—located in the Uptown District of the city—serves as a popular tourist attraction and for weddings and various celebrations. A 2011 study by Walk Score ranked Houston the 23rd most walkable of the 50 largest cities in the United States. Wet'n'Wild SplashTown is a water park located north of Houston.\n\nThe Bayport Cruise Terminal on the Houston Ship Channel is port of call for both Princess Cruises and Norwegian Cruise Line.\n\nSports\n\nHouston has sports teams for every major professional league except the National Hockey League. The Houston Astros are a Major League Baseball  expansion team formed in 1962 (known as the \"Colt .45s\" until 1965) that won the World Series in 2017 and previously appeared in 2005. It is the only MLB team to have won pennants in both modern leagues. The Houston Rockets are a National Basketball Association  franchise based in the city since 1971. They have won two NBA Championships: in 1994 and 1995 under star players Hakeem Olajuwon, Otis Thorpe, Clyde Drexler, Vernon Maxwell, and Kenny Smith. The Houston Texans are a National Football League  expansion team formed in 2002. The Houston Dynamo is a Major League Soccer  franchise that has been based in Houston since 2006, winning two MLS Cup titles in 2006 and 2007. The Houston Dash team plays in the National Women's Soccer League. The Scrap Yard Dawgs, a women's professional softball team, weare expected to play in the National Pro Fastpitch from 2016. They're the 2017 NPF champions. The Houston SaberCats are a Rugby team that plays in the Major League Rugby. Minute Maid Park (home of the Astros) and Toyota Center (home of the Rockets), are located in downtown Houston. Houston has the NFL's first retractable-roof stadium with natural grass, NRG Stadium (home of the Texans). Minute Maid Park is also a retractable-roof stadium. Toyota Center also has the largest screen for an indoor arena in the United States built to coincide with the arena's hosting of the 2013 NBA All-Star Game. BBVA Compass Stadium is a soccer-specific stadium for the Houston Dynamo, the Texas Southern Tigers football team, and Houston Dash, located in East Downtown. In addition, NRG Astrodome was the first indoor stadium in the world, built in 1965. Other sports facilities include Hofheinz Pavilion (Houston Cougars basketball), Rice Stadium (Rice Owls football), and Reliant Arena. TDECU Stadium is where the University of Houston Houston Cougars football team plays.\nHouston has hosted several major sports events: the 1968, 1986 and 2004 Major League Baseball All-Star Games; the 1989, 2006 and 2013 NBA All-Star Games; Super Bowl VIII and Super Bowl XXXVIII, as well as hosting the 2005 World Series and 1981, 1986, 1994 and 1995 NBA Finals, winning the latter two. NRG Stadium hosted Super Bowl LI on February 5, 2017.\n\nThe city has hosted several major professional and college sporting events, including the annual Houston Open golf tournament. Houston hosts the annual Houston College Classic baseball tournament every February and the Texas Bowl in December.\n\nThe Grand Prix of Houston, an annual auto race on the IndyCar Series circuit is held on a 1.7-mile temporary street circuit in Reliant Park. The October 2013 event was held using a tweaked version of the 2006–2007 course. The event has a 5-year race contract through 2017 with IndyCar. In motorcycling, the Astrodome hosted an AMA Supercross Championship round from 1974 to 2003 and the NRG Stadium since 2003.\n\nGovernment and politics\n\nThe city of Houston has a strong mayoral form of municipal government. Houston is a home rule city and all municipal elections in the state of Texas are nonpartisan. The city's elected officials are the mayor, city controller and 16 members of the Houston City Council. The current mayor of Houston is Sylvester Turner, a Democrat elected on a nonpartisan ballot. Houston's mayor serves as the city's chief administrator, executive officer, and official representative, and is responsible for the general management of the city and for seeing that all laws and ordinances are enforced.\n\nThe original city council line-up of 14 members (nine district-based and five at-large positions) was based on a U.S. Justice Department mandate which took effect in 1979. At-large council members represent the entire city. Under the city charter, once the population in the city limits exceeded 2.1 million residents, two additional districts were to be added. The city of Houston's official 2010 census count was 600 shy of the required number; however, as the city was expected to grow beyond 2.1 million shortly thereafter, the two additional districts were added for, and the positions filled during, the August 2011 elections.\n\nThe city controller is elected independently of the mayor and council. The controller's duties are to certify available funds prior to committing such funds and processing disbursements. The city's fiscal year begins on July 1 and ends on June 30. Chris Brown is the city controller, serving his first term as of January 2016.\n\nAs the result of a 2015 referendum in Houston, a mayor is elected for a four-year term, and can be elected to as many as two consecutive terms.Houston voters lengthen term limits for city officials \"[http://www.chron.com/politics/election/local/article/Voters-lengthen-term-limits-for-city-officials-6609018.php]. Retrieved on January 10, 2015. The term limits were spearheaded in 1991 by conservative political activist Clymer Wright. During 1991–2015, the city controller and city council members were subjected to a two-year, three-term limitation – the 2015 referendum amended term limits to two four-year terms. As of 2017 some councilmembers who served two terms and won a final term will have served eight years in office, whereas a freshman councilmember who won a position in 2013 can serve up to two additional terms under the previous term limit law – a select few will have at least 10 years of incumbency once their term expires.\n\nHouston is considered to be a politically divided city whose balance of power often sways between Republicans and Democrats. Much of the city's wealthier areas vote Republican while the city's working class and minority areas vote Democratic. According to the 2005 Houston Area Survey, 68 percent of non-Hispanic whites in Harris County are declared or favor Republicans while 89 percent of non-Hispanic blacks in the area are declared or favor Democrats. About 62 percent of Hispanics (of any race) in the area are declared or favor Democrats.Klineberg, Stephen. [https://wayback.archive-it.org/all/20090227010353/http://cohesion.rice.edu/CentersAndInst/HAS/emplibrary/REPORT-2005.pdf Houston Area Survey 1982–2005], Page 40. The city has often been known to be the most politically diverse city in Texas, a state known for being generally conservative. As a result, the city is often a contested area in statewide elections. In 2009, Houston became the first US city with a population over 1 million citizens to elect a gay mayor, by electing Annise Parker.\n\nCrime\n\nHouston had 303 homicides in 2015 and 302 homicides in 2016. Officials predicted there would be 323 homicides in 2016. Instead, there was no increase in Houston's homicide rate between 2015 and 2016.\n\nHouston's murder rate ranked 46th of U.S. cities with a population over 250,000 in 2005 (per capita rate of 16.3 murders per 100,000 population).\" ,\" Morgan Quitno. Retrieved on November 29, 2006. In 2010, the city's murder rate (per capita rate of 11.8 murders per 100,000 population) was ranked sixth among U.S. cities with a population of over 750,000 (behind New York City, Chicago, Detroit, Dallas, and Philadelphia)FBI Uniform 2010 (prov.) Crime Report Table 4 \"[https://www.fbi.gov/about-us/cjis/ucr/crime-in-the-u.s/2010/preliminary-annual-ucr-jan-dec-2010/data-tables/table-4/table-4/view]. Retrieved on July 6, 2011. according to the Federal Bureau of Investigation (FBI). Murders fell by 37 percent from January to June 2011, compared with the same period in 2010. Houston's total crime rate including violent and nonviolent crimes decreased by 11 percent.Lee, Renee C. \"[http://www.chron.com/disp/story.mpl/metropolitan/7669040.html New FBI stats suggest crime's in decline in Houston]\", Houston Chronicle, July 26, 2011, p. B2. Retrieved July 26, 2006. The FBI's Uniform Crime Report (UCR) indicates a downward trend of violent crime in Houston over the ten- and twenty-year periods ending in 2016, which is consistent with national trends. This trend toward lower rates of violent crime in Houston includes the murder rate, though it had seen a four-year uptick that lasted through 2015. Houston's violent crime rate is 8.6% percent higher in 2016 from the previous year. However, from 2006 to 2016, violent crime is still down 12 percent in Houston. \n\nHouston is a significant hub for trafficking of cocaine, cannabis, heroin, MDMA, and methamphetamine due to its size and proximity to major illegal drug exporting nations.\"[http://www.usdoj.gov/ndic/pubs32/32771/distribution.htm Distribution – Houston High Intensity Drug Trafficking Area Drug Market Analysis 2009].\" U.S. Department of Justice. Retrieved on August 11, 2009. Houston is one of the country's largest hubs for human trafficking.\n\nIn the early 1970s, Houston, Pasadena and several coastal towns were the site of the Houston mass murders, which at the time were the deadliest case of serial killing in American history.\n\nEducation\n\nSeventeen school districts exist within the city of Houston. The Houston independent School District (HISD) is the seventh-largest school district in the United States and the largest in Texas.\"[http://www.eschoolnews.com/2006/02/21/houston-isd-automates-lunch/ Houston ISD automates lunch]\", eSchool News online, February 21, 2006. Retrieved on December 16, 2006. HISD has 112 campuses that serve as magnet or vanguard schools—specializing in such disciplines as health professions, visual and performing arts, and the sciences. There are also many charter schools that are run separately from school districts. In addition, some public school districts also have their own charter schools.\n\nThe Houston area encompasses more than 300 private schools,[http://www.houston-texas-online.com/privateschools.html Private Schools]. Houston-Texas-Online. 2004. Retrieved on January 10, 2007.[http://www.houstonareaweb.com/private_schools/ Houston Private Schools]. HoustonAreaWeb.com. Retrieved on January 10, 2007.[https://web.archive.org/web/20080101054600/http://www.hlsr.com/ed/sa/sa_p.aspx School Art Participation]. Houston Livestock Show and Rodeo. Retrieved on January 10, 2007. Archived at the Internet Archive Wayback Machine. many of which are accredited by Texas Private School Accreditation Commission recognized agencies. The Houston Area independent schools offer education from a variety of different religious as well as secular viewpoints.[http://houstonprivateschools.org/index.cfm?CFID15996033&CFTOKEN\n41756059&MenuItemID96&MenuGroup\nHome%20New About HAIS] . Houston Area independent schools. 2007. Retrieved on March 27, 2007. The Houston area Catholic schools are operated by the Archdiocese of Galveston-Houston.\n\nColleges and universities\n\nFour distinct state universities are located in Houston. The University of Houston is a nationally recognized Tier One research university, and is the flagship institution of the University of Houston System. The  university in Texas, the University of Houston has nearly 44,000 students on its 667-acre campus in southeast Houston. The University of Houston–Clear Lake and the University of Houston–Downtown are  universities; they are not branch campuses of the University of Houston. Located in the historic community of Third Ward is Texas Southern University, one of the largest and most comprehensive historically black universities in the United States. Texas Southern University is also the first state university in Houston.\n\nSeveral private institutions of higher learning—ranging from liberal arts colleges, such as the University of St. Thomas, Houston's only Catholic university, to Rice University, the most selective university in Texas—are located within the city. Houston Baptist University, affiliated with the Baptist General Convention of Texas, offers bachelor's and graduate degrees. It was founded in 1960 and is located in the Sharpstown area in Southwest Houston.\n\nThree community college districts exist with campuses in and around Houston. The Houston Community College System serves most of Houston. The northwestern through northeastern parts of the city are served by various campuses of the Lone Star College System, while the southeastern portion of Houston is served by San Jacinto College, and a northeastern portion is served by Lee College.\"[http://www.lee.edu/about/ About Lee College].\" Lee College. Retrieved on May 6, 2013. The Houston Community College and Lone Star College systems are within the 10 largest institutions of higher learning in the United States.\n\nMedia\n\nThe primary network-affiliated television stations are KPRC-TV (NBC), KHOU-TV (CBS), KTRK-TV (ABC), KRIV (Fox), KIAH (The CW), and KTXH (MyNetworkTV). KTRK-TV, KRIV and KTXH operate as owned-and-operated stations of their networks.\n\nThe Houston–The Woodlands–Sugar Land metropolitan area is served by one public television station and one public radio station. KUHT (Houston Public Media) is a PBS member station and is the first public television station in the United States. Houston Public Radio is listener-funded and comprises one NPR member station, KUHF (News 88.7). The University of Houston System owns and holds broadcasting licenses to KUHT and KUHF. The stations broadcast from the Melcher Center for Public Broadcasting, located on the campus of the University of Houston.\n\nHouston is served by the Houston Chronicle, its only major daily newspaper with wide distribution. The Hearst Corporation, which owns and operates the Houston Chronicle, bought the assets of the Houston Post—its long-time rival and main competition—when Houston Post ceased operations in 1995. The Houston Post was owned by the family of former Lieutenant Governor Bill Hobby of Houston. The only other major publication to serve the city is the Houston Press—a free alternative weekly with a weekly readership of more than 300,000.\n\nInfrastructure\n\nHealthcare\n\nHouston is the seat of the internationally renowned Texas Medical Center, which contains the world's largest concentration of research and healthcare institutions. All 49 member institutions of the Texas Medical Center are non-profit organizations. They provide patient and preventive care, research, education, and local, national, and international community well-being.\nEmploying more than 73,600 people, institutions at the medical center include 13 hospitals and two specialty institutions, two medical schools, four nursing schools, and schools of dentistry, public health, pharmacy, and virtually all health-related careers. It is where one of the first—and still the largest—air emergency service, Life Flight, was created, and a very successful inter-institutional transplant program was developed. More heart surgeries are performed at the Texas Medical Center than anywhere else in the world.\n\nSome of the academic and research health institutions at the center include MD Anderson Cancer Center, Baylor College of Medicine, UT Health Science Center, Memorial Hermann Hospital, Houston Methodist Hospital, Texas Children's Hospital, and University of Houston College of Pharmacy.\n\nThe Baylor College of Medicine has annually been considered within the top ten medical schools in the nation; likewise, the MD Anderson Cancer Center has consistently ranked as one of the top two U.S. hospitals specializing in cancer care by U.S. News & World Report since 1990. The Menninger Clinic, a renowned psychiatric treatment center, is affiliated with Baylor College of Medicine and the Houston Methodist Hospital System. With hospital locations nationwide and headquarters in Houston, the Triumph Healthcare hospital system is the third largest long term acute care provider nationally.\n\nTransportation\n\nAccording to the 1990 U.S. Census, 71.7% of Houston (city) commuters drove alone to work. By 2009, the percentage of Houston (city) workers who drove to work alone rose to 75.6%. In 2016, the American Community Survey estimated modal shares for Houston (city) commuters of 77.2% for driving alone, 11.4% for carpooling, 3.6% for riding transit, 2.1% for walking, and .5% for cycling.\n\nHighways\n\n \nHouston's freeway system comprises  of freeways and expressways in a ten-county metropolitan area. , Greater Houston Partnership. Retrieved on March 21, 2009. However, the Texas Transportation Institute's annual Urban Mobility Report found that Houston had the fourth-worst congestion in the country with commuters spending an average of 58 hours in traffic in 2009.\n\nHouston's highway system has a hub-and-spoke freeway structure serviced by multiple loops. The innermost loop is Interstate 610, which encircles downtown, the medical center, and many core neighborhoods with around a 8 mi diameter. Beltway 8 and its freeway core, the Sam Houston Tollway, form the middle loop at a diameter of roughly 23 mi. A proposed highway project, State Highway 99 (Grand Parkway), will form a third loop outside Houston, totaling 180 miles in length and making an almost-complete circumference, with the exception of crossing the ship channel. As of June 2014, two of eleven segments of State Highway 99 have been completed to the west of Houston, and three northern segments totaling 38 miles. In addition to the Sam Houston Tollway loop mentioned above, the Harris County Toll Road Authority currently operates four spoke tollways: The Katy Managed Lanes of Interstate 10, the Hardy Toll Road, the Westpark Tollway, and the Fort Bend Parkway Extension. Other spoke roads either planned or under construction include Crosby Freeway, and the future Alvin Freeway.\n\nHouston's freeway system is monitored by Houston TranStar—a partnership of four government agencies that are responsible for providing transportation and emergency management services to the region.[http://www.houstontranstar.org/about_transtar/ About Houston TranStar]. Houston TranStar. 2008. Retrieved on February 17, 2008.\n\nTransit systems\n\nThe Metropolitan Transit Authority of Harris County (METRO) provides public transportation in the form of buses, light rail, and lift vans.\n\nMETRO began light rail service on January 1, 2004, with the inaugural track (\"Red Line\") running about 8 mi from the University of  (UHD), which traverses through the Texas Medical Center and terminates at NRG Park. METRO is currently in the design phase of a 10-year expansion plan that will add five more lines. and expand the current Red Line. Amtrak, the national passenger rail system, provides service three times a week to Houston via the  (Los Angeles–New Orleans), which stops at the Houston Amtrak Station on the north side of the downtown area. The station saw 14,891 boardings and alightings in fiscal year 2008. In 2012, there was a 25 percent increase in ridership to 20,327 passengers embarking from the Houston Amtrak Station.\n\nCycling\n\nHouston has the largest number of bike commuters in Texas with over 160 miles of dedicated bikeways. The city is currently in the process of expanding its on and off street bikeway network. A bicycle sharing system known as Houston B-Cycle currently operates 29 different stations in downtown and neighboring areas.\n\nAirports\n\nHouston is served by three airports, two of which are commercial that served 52 million passengers in 2007 and managed by the Houston Airport System. The Federal Aviation Administration and the state of Texas selected the \"Houston Airport System as Airport of the Year\" for 2005, largely because of its multi-year, $3.1 billion airport improvement program for both major airports in Houston.\n\nThe primary city airport is George Bush Intercontinental Airport (IAH), the tenth-busiest in the United States for total passengers, and forty third-busiest worldwide. Bush Intercontinental currently ranks fourth in the United States for non-stop domestic and international service with 182 destinations.[http://www.fly2houston.com/iahAbout About George Bush Intercontinental Airport] . Houston Airport System. Retrieved on January 11, 2007. In 2006, the United States Department of Transportation named IAH the fastest-growing of the top ten airports in the United States. The Houston Air Route Traffic Control Center stands on the George Bush Intercontinental Airport grounds.\n\nHouston was the headquarters of Continental Airlines until its 2010 merger with United Airlines with headquarters in Chicago; regulatory approval for the merger was granted in October of that year. Bush Intercontinental became United Airlines' largest airline hub. The airline retained a significant operational presence in Houston while offering more than 700 daily departures from the city.[http://www.fly2houston.com/iahAbout Facts and Figures] . Houston Airport System. 2007. Retrieved on February 28, 2007. In early 2007, Bush Intercontinental Airport was named a model \"port of entry\" for international travelers by U.S. Customs and Border Protection.\n\nThe second-largest commercial airport is William P. Hobby Airport (named Houston International Airport until 1967) which operates primarily short- to medium-haul domestic flights. However, in 2015 Southwest Airlines launched service from a new international terminal at Hobby airport to several destinations in Mexico, Central America, and the Caribbean. These were the first international flights flown from Hobby since 1969. Houston's aviation history is showcased in the 1940 Air Terminal Museum located in the old terminal building on the west side of the airport. Hobby Airport has been recognized with two awards for being one of the top five performing airports in the world and for customer service by Airports Council International.\n\nHouston's third municipal airport is Ellington Airport (a former U.S. Air Force base) used by military, government, NASA, and general aviation sectors.\n\nSister cities\n\nThe Houston Office of Protocol and International Affairs is the city's liaison to Houston's sister cities and to the national governing organization, Sister Cities International. Through their official city-to-city relationships, these volunteer associations promote people-to-people diplomacy and encourage citizens to develop mutual trust and understanding through commercial, cultural, educational, and humanitarian exchanges.\n\n*Abu Dhabi (United Arab Emirates) – 2001\n* Baku (Azerbaijan) – 1976\n* Basrah (Iraq) – 2015\n* Chiba (Japan) – 1973\n* Grampian Region, Aberdeen (United Kingdom) – 1979\n* Guayaquil (Ecuador) – 1987\n* Huelva (Spain) – 1969\n* Istanbul (Turkey) – 1986\n* Karachi (Pakistan) – 2009\n* Leipzig (Germany) – 1993\n* Luanda (Angola) – 2003\n*Nice (France) – 1973\n* Perth (Australia) – 1983\n* Shenzhen (China) – 1986\n* Stavanger (Norway) – 1980\n* Taipei (Taiwan) – 1963\n* Tampico (Mexico) – 2003\n* Tyumen (Russia) – 1995\n* Wuhan (China) – 2016. Houston. http://en.wikipedia.org/?curid=13774."
  }
}
