{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8145",
  "eid" : "e5e15900-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778465424,
  "textBody" : "Events\n\n* 533 – Vandalic War: Byzantine general Belisarius defeats the Vandals, commanded by King Gelimer, at the Battle of Tricamarum.\n* 687 – Pope Sergius I is elected.\n*1161 – Jin–Song wars: Military officers conspire against the emperor Wanyan Liang of the Jin dynasty after a military defeat at the Battle of Caishi, and assassinate the emperor at his camp.\n*1167 – Sicilian Chancellor Stephen du Perche moves the royal court to Messina to prevent a rebellion.\n*1256 – Mongol forces under the command of Hulagu Khan enter and destroy the Hashshashin stronghold at Alamut Castle (in present-day Iran) as part of their offensive on Islamic southwest Asia.\n*1467 – Stephen III of Moldavia defeats Matthias Corvinus of Hungary, with the latter being injured thrice, at the Battle of Baia.\n*1651 – Castle Cornet in Guernsey, the last stronghold which had supported the King in the Third English Civil War, surrenders.\n*1778 – American Revolutionary War: British and French fleets clash in the Battle of St. Lucia.\n*1791 – The United States Bill of Rights becomes law when ratified by the Virginia General Assembly.\n*1864 – American Civil War: Battle of Nashville: The Army of the Cumberland finishes the Army of Tennessee as a combat unit.\n*1890 – Hunkpapa Lakota leader Sitting Bull is killed on Standing Rock Indian Reservation, leading to the Wounded Knee Massacre. \n*1895 – Houston received 20 in snow, its largest snowfall from one storm on record.\n*1905 – The Pushkin House is established in Saint Petersburg, Russia, to preserve the cultural heritage of Alexander Pushkin.\n*1906 – The London Underground's Great Northern, Piccadilly and Brompton Railway opens.\n*1914 – World War I: The Serbian Army recaptures Belgrade from the invading Austro-Hungarian Army.\n*  1914   – A gas explosion at Mitsubishi Hōjō coal mine, in Kyushu, Japan, kills 687.\n*1917 – World War I: An armistice between Russia and the Central Powers is signed.\n*1933 – The Twenty-first Amendment to the United States Constitution officially becomes effective, repealing the Eighteenth Amendment that prohibited the sale, manufacture, and transportation of alcohol.\n*1939 – Gone with the Wind (highest inflation adjusted grossing film) receives its premiere at Loew's Grand Theatre in Atlanta, Georgia, United States.\n*1941 – The Holocaust in Ukraine: German troops murder over 15,000 Jews at Drobytsky Yar, a ravine southeast of the city of Kharkiv.\n*1942 – World War II: The Battle of Mount Austen, the Galloping Horse, and the Sea Horse begins during the Guadalcanal Campaign.\n*1943 – World War II: The Battle of Arawe begins during the New Britain campaign.\n*1945 – Occupation of Japan/Shinto Directive: General Douglas MacArthur orders that Shinto be abolished as the state religion of Japan.\n*1960 – Richard Pavlick is arrested for plotting to assassinate U.S. President-Elect John F. Kennedy.\n*  1960   – King Mahendra of Nepal suspends the country's constitution, dissolves parliament, dismisses the cabinet, and imposes direct rule.\n*1961 – Adolf Eichmann is sentenced to death after being found guilty by an Israeli court of 15 criminal charges, including charges of crimes against humanity, crimes against the Jewish people, and membership of an outlawed organization.\n*1965 – Project Gemini: Gemini 6A, crewed by Wally Schirra and Thomas Stafford, is launched from Cape Kennedy, Florida. Four orbits later, it achieves the first space rendezvous, with Gemini 7.\n*1970 – Soviet spacecraft Venera 7 successfully lands on Venus. It is the first successful soft landing on another planet\n*  1970   – A South Korean ferry, Namyong Ho, capsizes in the Korea Strait, killing more than 300 people.\n*1973 – John Paul Getty III, grandson of American billionaire J. Paul Getty, is found alive near Naples, Italy, after being kidnapped by an Italian gang on July 10.\n*  1973   – The American Psychiatric Association votes 13–0 to remove homosexuality from its official list of psychiatric disorders, the DSM-II.\n*1978 – U.S. President Jimmy Carter announces that the United States will recognize the People's Republic of China and sever diplomatic relations with Taiwan\n*1981 – A suicide car bombing targeting the Iraqi embassy in Beirut, Lebanon, levels the embassy and kills 61 people, including Iraq's ambassador to Lebanon. The attack is considered the first modern suicide bombing.\n*1989 – Second Optional Protocol to the International Covenant on Civil and Political Rights relating the abolition of capital punishment is adopted.\n*1993 – The Troubles: The Downing Street Declaration is issued by British Prime Minister John Major and Irish Taoiseach Albert Reynolds.\n*1997 – Tajikistan Airlines Flight 3183 crashes in the desert near Sharjah, United Arab Emirates, killing 85.\n*2000 – The third reactor at the Chernobyl Nuclear Power Plant is shut down.\n*2001 – The Leaning Tower of Pisa reopens after 11 years and $27,000,000 spent to stabilize it, without fixing its famous lean.\n*2005 – Introduction of the Lockheed Martin F-22 Raptor into USAF active service.\n*2010 – A boat carrying 90 asylum seekers crashes into rocks off the coast of Christmas Island, Australia, killing 48 people.\n*2013 – The South Sudanese Civil War begins when opposition leaders Dr. Riek Machar, Pagan Amum and Rebecca Nyandeng vote to boycott the meeting of the National Liberation Council at Nyakuron.\n*2014 – Man Haron Monis takes 18 hostages inside a café in Martin Place for 16 hours in Sydney. Monis and two hostages are killed when police raid the café the following morning.\n*2017 – a moment magnitude of 6.5 struck the Java Island in the city of Tasikmalaya. 4 confirmed deaths, 36 injured, and 200 displaced.\n\nBirths\n\n* AD 37 – Nero, Roman emperor (d. 68)\n* 130 – Lucius Verus, Roman emperor (d. 169)\n*1242 – Prince Munetaka, Japanese shogun (d. 1274)\n*1447 – Albert IV, Duke of Bavaria (d. 1508)\n*1567 – Christoph Demantius, German composer, poet, and theorist (d. 1643)\n*1610 – David Teniers the Younger, Flemish painter (d. 1690)\n*1657 – Michel Richard Delalande, French organist and composer (d. 1726)\n*1686 – Jean-Joseph Fiocco, Flemish violinist and composer (d. 1746)\n*1789 – Carlos Soublette, Venezuelan general and politician, 11th President of Venezuela (d. 1870)\n*1832 – Gustave Eiffel, French architect and engineer, co-designed the Eiffel Tower (d. 1923)\n*1837 – E. W. Bullinger, English minister, scholar, and theologian (d. 1913)\n*1852 – Henri Becquerel, French physicist and chemist, Nobel Prize laureate (d. 1908)\n*1859 – L. L. Zamenhof, Polish linguist and ophthalmologist, created Esperanto (d. 1917)\n*1860 – Niels Ryberg Finsen, Faroese-Danish physician and educator, Nobel Prize laureate (d. 1904)\n*  1860   – Abner Powell, American baseball player and manager (d. 1953)\n*1861 – Charles Duryea, American engineer and businessman, co-founded the Duryea Motor Wagon Company (d. 1938)\n*  1861   – Pehr Evind Svinhufvud, Finnish lawyer, judge, and politician, 3rd President of Finland (d. 1944)\n*1863 – Arthur Dehon Little, American chemist and engineer (d. 1935)\n*1869 – Leon Marchlewski, Polish chemist and academic (d. 1946)\n*1875 – Emilio Jacinto, Filipino journalist and activist (d. 1899)\n*1878 – Hans Carossa, German author and poet (d. 1956)\n*1885 – Leonid Pitamic, Slovenian lawyer, philosopher, and academic (d. 1971)\n*1888 – Maxwell Anderson, American journalist and playwright (d. 1959)\n*1890 – Harry Babcock, American pole vaulter (d. 1965)\n*1891 – A.P. Carter, American country singer-songwriter and musician (d. 1960)\n*1892 – J. Paul Getty, American-English businessman and art collector, founded Getty Oil (d. 1976)\n*1894 – Vibert Douglas, Canadian astrophysicist and astronomer (d. 1988)\n*  1894   – Josef Imbach, Swiss sprinter (d. 1964)\n*1896 – Betty Smith, American author and playwright (d. 1972)\n*1899 – Harold Abrahams, English sprinter, lawyer, and journalist (d. 1978)\n*1902 – Robert F. Bradford, American lawyer and politician, 57th Governor of Massachusetts (d. 1983)\n*1903 – Tamanishiki San'emon, Japanese sumo wrestler, the 32nd Yokozuna (d. 1938)\n*1907 – Gordon Douglas, American actor, director, and screenwriter (d. 1993)\n*  1907   – Oscar Niemeyer, Brazilian architect, designed the United Nations Headquarters and the Cathedral of Brasília (d. 2012)\n*1908 – Swami Ranganathananda, Indian monk, scholar, and author (d. 2005)\n*1909 – Sattar Bahlulzade, Azerbaijani-Russian painter (d. 1974)\n*1910 – John Hammond, American record producer and critic (d. 1987)\n*1911 – Nicholas P. Dallis, American psychiatrist and illustrator (d. 1991)\n*  1911   – Stan Kenton, American pianist and composer (d. 1979)\n*1913 – Roger Gaudry, Canadian chemist and businessman (d. 2001)\n*  1913   – Muriel Rukeyser, American poet, academic, and activist (d. 1980)\n*1916 – Miguel Arraes, Brazilian lawyer and politician, Governor of Pernambuco (d. 2005)\n*  1916   – Buddy Cole, American pianist and conductor (d. 1964)\n*  1916   – Maurice Wilkins, New Zealand-English physicist and biologist, Nobel Prize laureate (d. 2004)\n*1917 – Shan-ul-Haq Haqqee, Indian-Pakistani linguist and lexicographer (d. 2005)\n*1918 – Jeff Chandler, American actor (d. 1961)\n*  1918   – Chihiro Iwasaki, Japanese painter and illustrator (d. 1974)\n*1919 – Max Yasgur, American dairy farmer and host of the Woodstock Music & Art Fair (d. 1973)\n*1920 – Gamal al-Banna, Egyptian author and scholar (d. 2013)\n*  1920   – Kurt Schaffenberger, German-American sergeant and illustrator (d. 2002)\n*1921 – Alan Freed, American radio host (d. 1965)\n*1923 – Pierre Cossette, American producer and manager (d. 2009)\n*  1923   – Freeman Dyson, English-American physicist and mathematician\n*  1923   – Uziel Gal, German-Israeli engineer, designed the Uzi gun (d. 2002)\n*  1923   – Valentin Varennikov, Russian general and politician (d. 2009)\n*1924 – Frank W. J. Olver, English-American mathematician and academic (d. 2013)\n*  1924   – Ruhi Sarıalp, Turkish triple jumper and educator (d. 2001)\n*1925 – Kasey Rogers, American actress and author (d. 2006)\n*1928 – Ernest Ashworth, American singer-songwriter (d. 2009)\n*  1928   – Ida Haendel, Polish-English violinist and educator\n*  1928   – Friedensreich Hundertwasser, Austrian-New Zealand painter and architect (d. 2000)\n*1930 – Edna O'Brien, Irish novelist, playwright, poet and short story writer\n*1931 – Klaus Rifbjerg, Danish author and poet (d. 2015)\n*1932 – Jesse Belvin, American singer-songwriter and pianist (d. 1960)\n*  1932   – John Meurig Thomas, Welsh chemist and academic\n*1933 – Bapu, Indian director and screenwriter (d. 2014)\n*  1933   – Tim Conway, American actor, producer, and screenwriter\n*  1933   – Donald Woods, South African journalist and activist (d. 2001)\n*1936 – Joe D'Amato, Italian director and producer (d. 1999)\n*1938 – Michael Bogdanov, Welsh director and screenwriter\n*  1938   – Bob Foster, American boxer and police officer (d. 2015)\n*  1938   – Billy Shaw, American football player\n*1939 – Cindy Birdsong, American singer-songwriter \n*1940 – Nick Buoniconti, American football player and sportscaster\n*1942 – Kathleen Blanco, American educator and politician, 54th Governor of Louisiana\n*  1942   – Dave Clark, English drummer, songwriter, and producer \n*1943 – Lucien den Arend, Dutch sculptor\n*1944 – Jim Leyland, American baseball player and manager\n*  1944   – Chico Mendes, Brazilian trade union leader and activist (d. 1988)\n*1945 – Ivor Crewe, English political scientist and academic\n*1946 – Carmine Appice, American drummer and songwriter\n*  1946   – Art Howe, American baseball player and manager\n*1949 – Don Johnson, American actor\n*  1949   – Brian Roper, English economist and academic\n*1950 – Melanie Chartoff, American actress and comedian \n*  1950   – Sylvester James Gates, American theoretical physicist and professor \n*1951 – George Donikian, Australian journalist\n*  1951   – Joe Jordan, Scottish footballer and manager\n*  1951   – Tim Webster, Australian journalist and sportscaster\n*1952 – Rudi Protrudi, American singer-songwriter and producer  \n*  1952   – Allan Simonsen, Danish footballer and manager\n*  1952   – Julie Taymor, American director, producer, and screenwriter\n*1953 – John R. Allen, American general and diplomat\n*  1953   – J. M. DeMatteis, American author\n*  1953   – Robert Charles Wilson, American-Canadian author\n*1954 – Oliver Heald, English lawyer and politician, Solicitor General for England and Wales\n*  1954   – Mark Warner, American businessman and politician, 69th Governor of Virginia\n*1955 – Hector Sants, English banker\n*  1955   – Paul Simonon, English singer-songwriter and bass player \n*1956 – Tony Leon, South African lawyer and politician\n*1957 – Mario Marois, Canadian ice hockey player and sportscaster\n*  1957   – Mike McAlary, American journalist and author (d. 1998)\n*  1957   – Laura Molina, American singer, guitarist, actress, and painter\n*  1957   – Tim Reynolds, German-American singer-songwriter and guitarist \n*1958 – Carlo J. Caparas, Filipino director and producer\n*  1958   – Richard Kastle, American classical pianist\n*1959 – Greg Matthews, Australian cricketer\n*  1959   – Alan Whetton, New Zealand rugby player\n*  1959   – Gary Whetton, New Zealand rugby player\n*1960 – Walter Werzowa, Austrian composer and producer\n*1961 – Karin Resetarits, Austrian journalist and politician\n*1962 – Tim Gaines, American bass player \n*  1962   – Simon Hodgkinson, English rugby player and coach\n*1963 – Norman J. Grossfeld, American screenwriter and producer\n*  1963   – Helen Slater, American actress \n*  1963   – David Wingate, American basketball player\n*1964 – Paul Kaye, British Actor\n*1966 – Carl Hooper, Guyanese cricketer and coach\n*1967 – David Howells, English footballer and coach\n*  1967   – Mo Vaughn, American baseball player\n*1969 – Chantal Petitclerc, Canadian wheelchair racer\n*  1969   – Adam Setliff, American discus thrower and lawyer\n*1970 – Frankie Dettori, Italian jockey\n*  1970   – Lawrence Funderburke, American basketball player\n*  1970   – Michael Shanks, Canadian actor, screenwriter and director\n*1971 – Clint Lowery, American singer-songwriter, guitarist, and producer \n*1972 – Rodney Harrison, American football player and sportscaster\n*  1972   – Stuart Townsend, Irish actor \n*1973 – Surya Bonaly, French figure skater\n*  1973   – Ryoo Seung-wan, South Korean actor, director, and screenwriter\n*1974 – Gareth Archer, English rugby player\n*1976 – Baichung Bhutia, Indian footballer and manager\n*  1976   – Aaron Miles, American baseball player and coach\n*  1976   – Todd Tichenor, American baseball player and umpire\n*1977 – Mehmet Aurélio, Brazilian-Turkish footballer and manager\n*  1977   – Geoff Stults, American actor and producer\n*1978 – Ned Brower, American drummer \n*  1978   – Mark Jansen, Dutch guitarist and songwriter \n*  1978   – Jerome McDougle, American football player\n*1979 – Adam Brody, American actor\n*  1979   – Eric Young, Canadian-American wrestler\n*1980 – Sergio Pizzorno, English singer-songwriter and guitarist \n*  1980   – Manuel Wilhelm, German rugby player\n*1981 – Michelle Dockery, English actress \n*  1981   – Brendan Fletcher, Canadian actor and screenwriter\n*  1981   – Andy González, Puerto Rican-American baseball player\n*  1981   – Thomas Herrion, American football player (d. 2005)\n*  1981   – Roman Pavlyuchenko, Russian footballer\n*1982 – Charlie Cox, English actor\n*  1982   – Borja García, Spanish race car driver\n*  1982   – Tatiana Perebiynis, Ukrainian tennis player\n*1983 – Delon Armitage, Trinidadian-English rugby player\n*  1983   – Camilla Luddington, English actress\n*  1983   – Ronnie Radke, American singer-songwriter, guitarist, and producer  \n*1984 – Martyn Bernard, English high jumper\n*1985 – Diogo Fernandes, Brazilian footballer\n*1986 – Kim Junsu, South Korean singer-songwriter and dancer\n*  1986   – Iveta Mazáčová, Czech sprinter\n*  1986   – Keylor Navas, Costa Rican footballer\n*  1986   – Snejana Onopka, Ukrainian model\n*1988 – Steven N'Zonzi, French footballer\n*1992 – Jesse Lingard, English footballer\n*1997 – Zach Banks, American race car driver\n*  1997   – Magdalena Fręch, Polish tennis player\n\nDeaths\n\n* 933 – Li Siyuan, Emperor Mingzong of Later Tang\n*1025 – Basil II, Byzantine emperor (b. 958)\n*1072 – Alp Arslan, Turkish sultan (b. 1029)\n*1161 – Wanyan Liang, Jurchen emperor (b. 1122)\n*1230 – Ottokar I of Bohemia (b. 1155)\n*1283 – Philip I, Latin Emperor (b. 1243)\n*1343 – Hasan Kucek, Chobanid prince (b. c. 1319)\n*1467 – Jöns Bengtsson Oxenstierna, archbishop and Regent of Sweden (b. 1417)\n*1574 – Selim II, Ottoman sultan (b. 1524)\n*1598 – Philips of Marnix, Lord of Saint-Aldegonde (b. 1540)\n*1621 – Charles d'Albert, duc de Luynes, French courtier, Constable of France (b. 1578)\n*1673 – Margaret Cavendish, Duchess of Newcastle-upon-Tyne (b. 1623)\n*1675 – Johannes Vermeer, Dutch painter and educator (b. 1632)\n*1683 – Izaak Walton, English author (b. 1593)\n*1688 – Gaspar Fagel, Dutch lawyer and politician (b. 1634)\n*  1688   – Louis Victor de Rochechouart de Mortemart, French noble (b. 1636)\n*1715 – George Hickes, English minister and scholar (b. 1642)\n*1753 – Richard Boyle, 3rd Earl of Burlington, English architect and politician, designed Chiswick House (b. 1694)\n*1792 – Joseph Martin Kraus, Swedish pianist, violinist, and composer (b. 1756)\n*1812 – Shneur Zalman, Russian rabbi, author and founder of Chabad (b. 1745)\n*1855 – Jacques Charles François Sturm, French mathematician and academic (b. 1803)\n*1878 – Alfred Bird, English chemist and businessman, invented baking powder (b. 1811)\n*1890 – Sitting Bull, American tribal chief (b. 1831)\n*1943 – Fats Waller, American singer-songwriter and pianist (b. 1904)\n*1944 – Glenn Miller, American bandleader and composer (b. 1904)\n*1947 – Arthur Machen, Welsh journalist and author (b. 1863)\n*  1947   – Crawford Vaughan, Australian politician, 27th Premier of South Australia (b. 1874)\n*1950 – Vallabhbhai Patel, Indian lawyer and politician, 1st Deputy Prime Minister of India (b. 1875)\n*1958 – Wolfgang Pauli, Austrian-Swiss physicist and academic, Nobel Prize laureate (b. 1900)\n*1962 – Charles Laughton, English-American actor, director, and producer (b. 1899)\n*1965 – M. Balasundaram, Sri Lankan journalist, lawyer, and politician (b. 1903)\n*1966 – Keith Arbuthnott, 15th Viscount of Arbuthnott, Indian-Scottish general and politician, Lord Lieutenant of Kincardineshire (b. 1897)\n*  1966   – Walt Disney, American animator, director, producer, and screenwriter, co-founded The Walt Disney Company (b. 1901)\n*1968 – Antonio Barrette, Canadian politician, 18th Premier of Quebec (b. 1899)\n*  1968   – Jess Willard, American boxer and actor (b. 1881)\n*1969 – Karl Theodor Bleek, German lawyer and politician, 12th Mayor of Marburg (b. 1898)\n*1971 – Paul Lévy, French mathematician and theorist (b. 1886)\n*1974 – Anatole Litvak, Russian-American director, producer, and screenwriter (b. 1902)\n*1977 – Wilfred Kitching, English 7th General of The Salvation Army (b. 1893)\n*1978 – Chill Wills, American actor (b. 1903)\n*1984 – Jan Peerce, American tenor and actor (b. 1904)\n*1985 – Seewoosagur Ramgoolam, Mauritian physician and politician, 1st Prime Minister of Mauritius (b. 1900)\n*1986 – Serge Lifar, Russian-French ballet dancer and choreographer\n*1989 – Edward Underdown, English actor and jockey (b. 1908)\n*1991 – Vasily Zaytsev, Russian captain (b. 1915)\n*1993 – William Dale Phillips, American chemist and engineer (b. 1925)\n*2000 – Haris Brkić, Bosnian-Serbian basketball player (b. 1974)\n*2003 – Vincent Apap, Maltese sculptor (b. 1909)\n*  2003   – George Fisher, American cartoonist (b. 1923)\n*  2003   – Keith Magnuson, Canadian ice hockey player and coach (b. 1947)\n*2004 – Vassal Gadoengin, Nauruan educator and politician, Speaker of the Nauru Parliament (b. 1943)\n*2005 – Heinrich Gross, Austrian physician and psychiatrist (b. 1914)\n*  2005   – Stan Leonard, Canadian golfer (b. 1915)\n*  2005   – William Proxmire, American soldier, journalist, and politician (b. 1915)\n*  2005   – Darrell Russell, American football player (b. 1976)\n*2006 – Clay Regazzoni, Swiss race car driver (b. 1939)\n*  2006   – Mary Stolz, American journalist and author (b. 1920)\n*2007 – Julia Carson, American lawyer and politician (b. 1938)\n*2008 – León Febres Cordero, Ecuadorian engineer and politician, 46th President of Ecuador (b. 1931)\n*2009 – Oral Roberts, American evangelist, founded the Oral Roberts Evangelistic Association (b. 1918)\n*2010 – Blake Edwards, American director, producer, and screenwriter (b. 1922)\n*  2010   – Bob Feller, American baseball player and sportscaster (b. 1918)\n*  2010   – Eugene Victor Wolfenstein, American psychoanalyst and theorist (b. 1940)\n*2011 – Bob Brookmeyer, American trombone player and composer (b. 1929)\n*  2011   – Christopher Hitchens, English-American essayist, literary critic, and journalist (b. 1949)\n*2012 – Owoye Andrew Azazi, Nigerian general (b. 1952)\n*  2012   – Patrick Ibrahim Yakowa, Nigerian politician, 18th Governor of Kaduna State (b. 1948)\n*  2012   – Olga Zubarry, Argentinian actress (b. 1929)\n*2013 – Harold Camping, American evangelist, author, radio host (b. 1921)\n*  2013   – Joan Fontaine, British-American actress (b. 1917)\n*  2013   – Dyron Nix, American basketball player (b. 1967)\n*2014 – Donald Metcalf, Australian physiologist and immunologist (b. 1929)\n*  2014   – Fausto Zapata,  Mexican journalist, lawyer, and politician, Governor of San Luis Potosí (b. 1940)\n*2015 – Harry Zvi Tabor, English-Israeli physicist and engineer (b. 1917)\n* 2017 – Heinz Wolff, scientist and TV presenter (b. 1928)\n* 2017 – Calestous Juma, academic (b. 1953)\n\nHolidays and observances\n\n*Bill of Rights Day (United States)\n**2nd Amendment Day (South Carolina)\n*Christian feast day:\n**Drina Martyrs\n**Drostan (Aberdeen Breviary)\n**John Horden and Robert McDonald (Episcopal Church (USA))\n**Maria Crocifissa di Rosa\n**Mesmin\n**Valerian of Abbenza\n**Virginia Centurione Bracelli\n**December 15 (Eastern Orthodox liturgics)\n*Homecoming Day (Alderney)\n*International Tea Day\n*Kingdom Day (Netherlands), moves to December 16 if the 15th is on a Sunday\n*Zamenhof Day (International Esperanto Community)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "December 15" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8145" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 533 – Vandalic War: Byzantine general Belisarius defeats the Vandals, commanded by King Gelimer, at the Battle of Tricamarum.\n* 687 – Pope Sergius I is elected.\n*1161 – Jin–Song wars: Military officers conspire against the emperor Wanyan Liang of the Jin dynasty after a military defeat at the Battle of Caishi, and assassinate the emperor at his camp.\n*1167 – Sicilian Chancellor Stephen du Perche moves the royal court to Messina to prevent a rebellion.\n*1256 – Mongol forces under the command of Hulagu Khan enter and destroy the Hashshashin stronghold at Alamut Castle (in present-day Iran) as part of their offensive on Islamic southwest Asia.\n*1467 – Stephen III of Moldavia defeats Matthias Corvinus of Hungary, with the latter being injured thrice, at the Battle of Baia.\n*1651 – Castle Cornet in Guernsey, the last stronghold which had supported the King in the Third English Civil War, surrenders.\n*1778 – American Revolutionary War: British and French fleets clash in the Battle of St. Lucia.\n*1791 – The United States Bill of Rights becomes law when ratified by the Virginia General Assembly.\n*1864 – American Civil War: Battle of Nashville: The Army of the Cumberland finishes the Army of Tennessee as a combat unit.\n*1890 – Hunkpapa Lakota leader Sitting Bull is killed on Standing Rock Indian Reservation, leading to the Wounded Knee Massacre. \n*1895 – Houston received 20 in snow, its largest snowfall from one storm on record.\n*1905 – The Pushkin House is established in Saint Petersburg, Russia, to preserve the cultural heritage of Alexander Pushkin.\n*1906 – The London Underground's Great Northern, Piccadilly and Brompton Railway opens.\n*1914 – World War I: The Serbian Army recaptures Belgrade from the invading Austro-Hungarian Army.\n*  1914   – A gas explosion at Mitsubishi Hōjō coal mine, in Kyushu, Japan, kills 687.\n*1917 – World War I: An armistice between Russia and the Central Powers is signed.\n*1933 – The Twenty-first Amendment to the United States Constitution officially becomes effective, repealing the Eighteenth Amendment that prohibited the sale, manufacture, and transportation of alcohol.\n*1939 – Gone with the Wind (highest inflation adjusted grossing film) receives its premiere at Loew's Grand Theatre in Atlanta, Georgia, United States.\n*1941 – The Holocaust in Ukraine: German troops murder over 15,000 Jews at Drobytsky Yar, a ravine southeast of the city of Kharkiv.\n*1942 – World War II: The Battle of Mount Austen, the Galloping Horse, and the Sea Horse begins during the Guadalcanal Campaign.\n*1943 – World War II: The Battle of Arawe begins during the New Britain campaign.\n*1945 – Occupation of Japan/Shinto Directive: General Douglas MacArthur orders that Shinto be abolished as the state religion of Japan.\n*1960 – Richard Pavlick is arrested for plotting to assassinate U.S. President-Elect John F. Kennedy.\n*  1960   – King Mahendra of Nepal suspends the country's constitution, dissolves parliament, dismisses the cabinet, and imposes direct rule.\n*1961 – Adolf Eichmann is sentenced to death after being found guilty by an Israeli court of 15 criminal charges, including charges of crimes against humanity, crimes against the Jewish people, and membership of an outlawed organization.\n*1965 – Project Gemini: Gemini 6A, crewed by Wally Schirra and Thomas Stafford, is launched from Cape Kennedy, Florida. Four orbits later, it achieves the first space rendezvous, with Gemini 7.\n*1970 – Soviet spacecraft Venera 7 successfully lands on Venus. It is the first successful soft landing on another planet\n*  1970   – A South Korean ferry, Namyong Ho, capsizes in the Korea Strait, killing more than 300 people.\n*1973 – John Paul Getty III, grandson of American billionaire J. Paul Getty, is found alive near Naples, Italy, after being kidnapped by an Italian gang on July 10.\n*  1973   – The American Psychiatric Association votes 13–0 to remove homosexuality from its official list of psychiatric disorders, the DSM-II.\n*1978 – U.S. President Jimmy Carter announces that the United States will recognize the People's Republic of China and sever diplomatic relations with Taiwan\n*1981 – A suicide car bombing targeting the Iraqi embassy in Beirut, Lebanon, levels the embassy and kills 61 people, including Iraq's ambassador to Lebanon. The attack is considered the first modern suicide bombing.\n*1989 – Second Optional Protocol to the International Covenant on Civil and Political Rights relating the abolition of capital punishment is adopted.\n*1993 – The Troubles: The Downing Street Declaration is issued by British Prime Minister John Major and Irish Taoiseach Albert Reynolds.\n*1997 – Tajikistan Airlines Flight 3183 crashes in the desert near Sharjah, United Arab Emirates, killing 85.\n*2000 – The third reactor at the Chernobyl Nuclear Power Plant is shut down.\n*2001 – The Leaning Tower of Pisa reopens after 11 years and $27,000,000 spent to stabilize it, without fixing its famous lean.\n*2005 – Introduction of the Lockheed Martin F-22 Raptor into USAF active service.\n*2010 – A boat carrying 90 asylum seekers crashes into rocks off the coast of Christmas Island, Australia, killing 48 people.\n*2013 – The South Sudanese Civil War begins when opposition leaders Dr. Riek Machar, Pagan Amum and Rebecca Nyandeng vote to boycott the meeting of the National Liberation Council at Nyakuron.\n*2014 – Man Haron Monis takes 18 hostages inside a café in Martin Place for 16 hours in Sydney. Monis and two hostages are killed when police raid the café the following morning.\n*2017 – a moment magnitude of 6.5 struck the Java Island in the city of Tasikmalaya. 4 confirmed deaths, 36 injured, and 200 displaced.\n\nBirths\n\n* AD 37 – Nero, Roman emperor (d. 68)\n* 130 – Lucius Verus, Roman emperor (d. 169)\n*1242 – Prince Munetaka, Japanese shogun (d. 1274)\n*1447 – Albert IV, Duke of Bavaria (d. 1508)\n*1567 – Christoph Demantius, German composer, poet, and theorist (d. 1643)\n*1610 – David Teniers the Younger, Flemish painter (d. 1690)\n*1657 – Michel Richard Delalande, French organist and composer (d. 1726)\n*1686 – Jean-Joseph Fiocco, Flemish violinist and composer (d. 1746)\n*1789 – Carlos Soublette, Venezuelan general and politician, 11th President of Venezuela (d. 1870)\n*1832 – Gustave Eiffel, French architect and engineer, co-designed the Eiffel Tower (d. 1923)\n*1837 – E. W. Bullinger, English minister, scholar, and theologian (d. 1913)\n*1852 – Henri Becquerel, French physicist and chemist, Nobel Prize laureate (d. 1908)\n*1859 – L. L. Zamenhof, Polish linguist and ophthalmologist, created Esperanto (d. 1917)\n*1860 – Niels Ryberg Finsen, Faroese-Danish physician and educator, Nobel Prize laureate (d. 1904)\n*  1860   – Abner Powell, American baseball player and manager (d. 1953)\n*1861 – Charles Duryea, American engineer and businessman, co-founded the Duryea Motor Wagon Company (d. 1938)\n*  1861   – Pehr Evind Svinhufvud, Finnish lawyer, judge, and politician, 3rd President of Finland (d. 1944)\n*1863 – Arthur Dehon Little, American chemist and engineer (d. 1935)\n*1869 – Leon Marchlewski, Polish chemist and academic (d. 1946)\n*1875 – Emilio Jacinto, Filipino journalist and activist (d. 1899)\n*1878 – Hans Carossa, German author and poet (d. 1956)\n*1885 – Leonid Pitamic, Slovenian lawyer, philosopher, and academic (d. 1971)\n*1888 – Maxwell Anderson, American journalist and playwright (d. 1959)\n*1890 – Harry Babcock, American pole vaulter (d. 1965)\n*1891 – A.P. Carter, American country singer-songwriter and musician (d. 1960)\n*1892 – J. Paul Getty, American-English businessman and art collector, founded Getty Oil (d. 1976)\n*1894 – Vibert Douglas, Canadian astrophysicist and astronomer (d. 1988)\n*  1894   – Josef Imbach, Swiss sprinter (d. 1964)\n*1896 – Betty Smith, American author and playwright (d. 1972)\n*1899 – Harold Abrahams, English sprinter, lawyer, and journalist (d. 1978)\n*1902 – Robert F. Bradford, American lawyer and politician, 57th Governor of Massachusetts (d. 1983)\n*1903 – Tamanishiki San'emon, Japanese sumo wrestler, the 32nd Yokozuna (d. 1938)\n*1907 – Gordon Douglas, American actor, director, and screenwriter (d. 1993)\n*  1907   – Oscar Niemeyer, Brazilian architect, designed the United Nations Headquarters and the Cathedral of Brasília (d. 2012)\n*1908 – Swami Ranganathananda, Indian monk, scholar, and author (d. 2005)\n*1909 – Sattar Bahlulzade, Azerbaijani-Russian painter (d. 1974)\n*1910 – John Hammond, American record producer and critic (d. 1987)\n*1911 – Nicholas P. Dallis, American psychiatrist and illustrator (d. 1991)\n*  1911   – Stan Kenton, American pianist and composer (d. 1979)\n*1913 – Roger Gaudry, Canadian chemist and businessman (d. 2001)\n*  1913   – Muriel Rukeyser, American poet, academic, and activist (d. 1980)\n*1916 – Miguel Arraes, Brazilian lawyer and politician, Governor of Pernambuco (d. 2005)\n*  1916   – Buddy Cole, American pianist and conductor (d. 1964)\n*  1916   – Maurice Wilkins, New Zealand-English physicist and biologist, Nobel Prize laureate (d. 2004)\n*1917 – Shan-ul-Haq Haqqee, Indian-Pakistani linguist and lexicographer (d. 2005)\n*1918 – Jeff Chandler, American actor (d. 1961)\n*  1918   – Chihiro Iwasaki, Japanese painter and illustrator (d. 1974)\n*1919 – Max Yasgur, American dairy farmer and host of the Woodstock Music & Art Fair (d. 1973)\n*1920 – Gamal al-Banna, Egyptian author and scholar (d. 2013)\n*  1920   – Kurt Schaffenberger, German-American sergeant and illustrator (d. 2002)\n*1921 – Alan Freed, American radio host (d. 1965)\n*1923 – Pierre Cossette, American producer and manager (d. 2009)\n*  1923   – Freeman Dyson, English-American physicist and mathematician\n*  1923   – Uziel Gal, German-Israeli engineer, designed the Uzi gun (d. 2002)\n*  1923   – Valentin Varennikov, Russian general and politician (d. 2009)\n*1924 – Frank W. J. Olver, English-American mathematician and academic (d. 2013)\n*  1924   – Ruhi Sarıalp, Turkish triple jumper and educator (d. 2001)\n*1925 – Kasey Rogers, American actress and author (d. 2006)\n*1928 – Ernest Ashworth, American singer-songwriter (d. 2009)\n*  1928   – Ida Haendel, Polish-English violinist and educator\n*  1928   – Friedensreich Hundertwasser, Austrian-New Zealand painter and architect (d. 2000)\n*1930 – Edna O'Brien, Irish novelist, playwright, poet and short story writer\n*1931 – Klaus Rifbjerg, Danish author and poet (d. 2015)\n*1932 – Jesse Belvin, American singer-songwriter and pianist (d. 1960)\n*  1932   – John Meurig Thomas, Welsh chemist and academic\n*1933 – Bapu, Indian director and screenwriter (d. 2014)\n*  1933   – Tim Conway, American actor, producer, and screenwriter\n*  1933   – Donald Woods, South African journalist and activist (d. 2001)\n*1936 – Joe D'Amato, Italian director and producer (d. 1999)\n*1938 – Michael Bogdanov, Welsh director and screenwriter\n*  1938   – Bob Foster, American boxer and police officer (d. 2015)\n*  1938   – Billy Shaw, American football player\n*1939 – Cindy Birdsong, American singer-songwriter \n*1940 – Nick Buoniconti, American football player and sportscaster\n*1942 – Kathleen Blanco, American educator and politician, 54th Governor of Louisiana\n*  1942   – Dave Clark, English drummer, songwriter, and producer \n*1943 – Lucien den Arend, Dutch sculptor\n*1944 – Jim Leyland, American baseball player and manager\n*  1944   – Chico Mendes, Brazilian trade union leader and activist (d. 1988)\n*1945 – Ivor Crewe, English political scientist and academic\n*1946 – Carmine Appice, American drummer and songwriter\n*  1946   – Art Howe, American baseball player and manager\n*1949 – Don Johnson, American actor\n*  1949   – Brian Roper, English economist and academic\n*1950 – Melanie Chartoff, American actress and comedian \n*  1950   – Sylvester James Gates, American theoretical physicist and professor \n*1951 – George Donikian, Australian journalist\n*  1951   – Joe Jordan, Scottish footballer and manager\n*  1951   – Tim Webster, Australian journalist and sportscaster\n*1952 – Rudi Protrudi, American singer-songwriter and producer  \n*  1952   – Allan Simonsen, Danish footballer and manager\n*  1952   – Julie Taymor, American director, producer, and screenwriter\n*1953 – John R. Allen, American general and diplomat\n*  1953   – J. M. DeMatteis, American author\n*  1953   – Robert Charles Wilson, American-Canadian author\n*1954 – Oliver Heald, English lawyer and politician, Solicitor General for England and Wales\n*  1954   – Mark Warner, American businessman and politician, 69th Governor of Virginia\n*1955 – Hector Sants, English banker\n*  1955   – Paul Simonon, English singer-songwriter and bass player \n*1956 – Tony Leon, South African lawyer and politician\n*1957 – Mario Marois, Canadian ice hockey player and sportscaster\n*  1957   – Mike McAlary, American journalist and author (d. 1998)\n*  1957   – Laura Molina, American singer, guitarist, actress, and painter\n*  1957   – Tim Reynolds, German-American singer-songwriter and guitarist \n*1958 – Carlo J. Caparas, Filipino director and producer\n*  1958   – Richard Kastle, American classical pianist\n*1959 – Greg Matthews, Australian cricketer\n*  1959   – Alan Whetton, New Zealand rugby player\n*  1959   – Gary Whetton, New Zealand rugby player\n*1960 – Walter Werzowa, Austrian composer and producer\n*1961 – Karin Resetarits, Austrian journalist and politician\n*1962 – Tim Gaines, American bass player \n*  1962   – Simon Hodgkinson, English rugby player and coach\n*1963 – Norman J. Grossfeld, American screenwriter and producer\n*  1963   – Helen Slater, American actress \n*  1963   – David Wingate, American basketball player\n*1964 – Paul Kaye, British Actor\n*1966 – Carl Hooper, Guyanese cricketer and coach\n*1967 – David Howells, English footballer and coach\n*  1967   – Mo Vaughn, American baseball player\n*1969 – Chantal Petitclerc, Canadian wheelchair racer\n*  1969   – Adam Setliff, American discus thrower and lawyer\n*1970 – Frankie Dettori, Italian jockey\n*  1970   – Lawrence Funderburke, American basketball player\n*  1970   – Michael Shanks, Canadian actor, screenwriter and director\n*1971 – Clint Lowery, American singer-songwriter, guitarist, and producer \n*1972 – Rodney Harrison, American football player and sportscaster\n*  1972   – Stuart Townsend, Irish actor \n*1973 – Surya Bonaly, French figure skater\n*  1973   – Ryoo Seung-wan, South Korean actor, director, and screenwriter\n*1974 – Gareth Archer, English rugby player\n*1976 – Baichung Bhutia, Indian footballer and manager\n*  1976   – Aaron Miles, American baseball player and coach\n*  1976   – Todd Tichenor, American baseball player and umpire\n*1977 – Mehmet Aurélio, Brazilian-Turkish footballer and manager\n*  1977   – Geoff Stults, American actor and producer\n*1978 – Ned Brower, American drummer \n*  1978   – Mark Jansen, Dutch guitarist and songwriter \n*  1978   – Jerome McDougle, American football player\n*1979 – Adam Brody, American actor\n*  1979   – Eric Young, Canadian-American wrestler\n*1980 – Sergio Pizzorno, English singer-songwriter and guitarist \n*  1980   – Manuel Wilhelm, German rugby player\n*1981 – Michelle Dockery, English actress \n*  1981   – Brendan Fletcher, Canadian actor and screenwriter\n*  1981   – Andy González, Puerto Rican-American baseball player\n*  1981   – Thomas Herrion, American football player (d. 2005)\n*  1981   – Roman Pavlyuchenko, Russian footballer\n*1982 – Charlie Cox, English actor\n*  1982   – Borja García, Spanish race car driver\n*  1982   – Tatiana Perebiynis, Ukrainian tennis player\n*1983 – Delon Armitage, Trinidadian-English rugby player\n*  1983   – Camilla Luddington, English actress\n*  1983   – Ronnie Radke, American singer-songwriter, guitarist, and producer  \n*1984 – Martyn Bernard, English high jumper\n*1985 – Diogo Fernandes, Brazilian footballer\n*1986 – Kim Junsu, South Korean singer-songwriter and dancer\n*  1986   – Iveta Mazáčová, Czech sprinter\n*  1986   – Keylor Navas, Costa Rican footballer\n*  1986   – Snejana Onopka, Ukrainian model\n*1988 – Steven N'Zonzi, French footballer\n*1992 – Jesse Lingard, English footballer\n*1997 – Zach Banks, American race car driver\n*  1997   – Magdalena Fręch, Polish tennis player\n\nDeaths\n\n* 933 – Li Siyuan, Emperor Mingzong of Later Tang\n*1025 – Basil II, Byzantine emperor (b. 958)\n*1072 – Alp Arslan, Turkish sultan (b. 1029)\n*1161 – Wanyan Liang, Jurchen emperor (b. 1122)\n*1230 – Ottokar I of Bohemia (b. 1155)\n*1283 – Philip I, Latin Emperor (b. 1243)\n*1343 – Hasan Kucek, Chobanid prince (b. c. 1319)\n*1467 – Jöns Bengtsson Oxenstierna, archbishop and Regent of Sweden (b. 1417)\n*1574 – Selim II, Ottoman sultan (b. 1524)\n*1598 – Philips of Marnix, Lord of Saint-Aldegonde (b. 1540)\n*1621 – Charles d'Albert, duc de Luynes, French courtier, Constable of France (b. 1578)\n*1673 – Margaret Cavendish, Duchess of Newcastle-upon-Tyne (b. 1623)\n*1675 – Johannes Vermeer, Dutch painter and educator (b. 1632)\n*1683 – Izaak Walton, English author (b. 1593)\n*1688 – Gaspar Fagel, Dutch lawyer and politician (b. 1634)\n*  1688   – Louis Victor de Rochechouart de Mortemart, French noble (b. 1636)\n*1715 – George Hickes, English minister and scholar (b. 1642)\n*1753 – Richard Boyle, 3rd Earl of Burlington, English architect and politician, designed Chiswick House (b. 1694)\n*1792 – Joseph Martin Kraus, Swedish pianist, violinist, and composer (b. 1756)\n*1812 – Shneur Zalman, Russian rabbi, author and founder of Chabad (b. 1745)\n*1855 – Jacques Charles François Sturm, French mathematician and academic (b. 1803)\n*1878 – Alfred Bird, English chemist and businessman, invented baking powder (b. 1811)\n*1890 – Sitting Bull, American tribal chief (b. 1831)\n*1943 – Fats Waller, American singer-songwriter and pianist (b. 1904)\n*1944 – Glenn Miller, American bandleader and composer (b. 1904)\n*1947 – Arthur Machen, Welsh journalist and author (b. 1863)\n*  1947   – Crawford Vaughan, Australian politician, 27th Premier of South Australia (b. 1874)\n*1950 – Vallabhbhai Patel, Indian lawyer and politician, 1st Deputy Prime Minister of India (b. 1875)\n*1958 – Wolfgang Pauli, Austrian-Swiss physicist and academic, Nobel Prize laureate (b. 1900)\n*1962 – Charles Laughton, English-American actor, director, and producer (b. 1899)\n*1965 – M. Balasundaram, Sri Lankan journalist, lawyer, and politician (b. 1903)\n*1966 – Keith Arbuthnott, 15th Viscount of Arbuthnott, Indian-Scottish general and politician, Lord Lieutenant of Kincardineshire (b. 1897)\n*  1966   – Walt Disney, American animator, director, producer, and screenwriter, co-founded The Walt Disney Company (b. 1901)\n*1968 – Antonio Barrette, Canadian politician, 18th Premier of Quebec (b. 1899)\n*  1968   – Jess Willard, American boxer and actor (b. 1881)\n*1969 – Karl Theodor Bleek, German lawyer and politician, 12th Mayor of Marburg (b. 1898)\n*1971 – Paul Lévy, French mathematician and theorist (b. 1886)\n*1974 – Anatole Litvak, Russian-American director, producer, and screenwriter (b. 1902)\n*1977 – Wilfred Kitching, English 7th General of The Salvation Army (b. 1893)\n*1978 – Chill Wills, American actor (b. 1903)\n*1984 – Jan Peerce, American tenor and actor (b. 1904)\n*1985 – Seewoosagur Ramgoolam, Mauritian physician and politician, 1st Prime Minister of Mauritius (b. 1900)\n*1986 – Serge Lifar, Russian-French ballet dancer and choreographer\n*1989 – Edward Underdown, English actor and jockey (b. 1908)\n*1991 – Vasily Zaytsev, Russian captain (b. 1915)\n*1993 – William Dale Phillips, American chemist and engineer (b. 1925)\n*2000 – Haris Brkić, Bosnian-Serbian basketball player (b. 1974)\n*2003 – Vincent Apap, Maltese sculptor (b. 1909)\n*  2003   – George Fisher, American cartoonist (b. 1923)\n*  2003   – Keith Magnuson, Canadian ice hockey player and coach (b. 1947)\n*2004 – Vassal Gadoengin, Nauruan educator and politician, Speaker of the Nauru Parliament (b. 1943)\n*2005 – Heinrich Gross, Austrian physician and psychiatrist (b. 1914)\n*  2005   – Stan Leonard, Canadian golfer (b. 1915)\n*  2005   – William Proxmire, American soldier, journalist, and politician (b. 1915)\n*  2005   – Darrell Russell, American football player (b. 1976)\n*2006 – Clay Regazzoni, Swiss race car driver (b. 1939)\n*  2006   – Mary Stolz, American journalist and author (b. 1920)\n*2007 – Julia Carson, American lawyer and politician (b. 1938)\n*2008 – León Febres Cordero, Ecuadorian engineer and politician, 46th President of Ecuador (b. 1931)\n*2009 – Oral Roberts, American evangelist, founded the Oral Roberts Evangelistic Association (b. 1918)\n*2010 – Blake Edwards, American director, producer, and screenwriter (b. 1922)\n*  2010   – Bob Feller, American baseball player and sportscaster (b. 1918)\n*  2010   – Eugene Victor Wolfenstein, American psychoanalyst and theorist (b. 1940)\n*2011 – Bob Brookmeyer, American trombone player and composer (b. 1929)\n*  2011   – Christopher Hitchens, English-American essayist, literary critic, and journalist (b. 1949)\n*2012 – Owoye Andrew Azazi, Nigerian general (b. 1952)\n*  2012   – Patrick Ibrahim Yakowa, Nigerian politician, 18th Governor of Kaduna State (b. 1948)\n*  2012   – Olga Zubarry, Argentinian actress (b. 1929)\n*2013 – Harold Camping, American evangelist, author, radio host (b. 1921)\n*  2013   – Joan Fontaine, British-American actress (b. 1917)\n*  2013   – Dyron Nix, American basketball player (b. 1967)\n*2014 – Donald Metcalf, Australian physiologist and immunologist (b. 1929)\n*  2014   – Fausto Zapata,  Mexican journalist, lawyer, and politician, Governor of San Luis Potosí (b. 1940)\n*2015 – Harry Zvi Tabor, English-Israeli physicist and engineer (b. 1917)\n* 2017 – Heinz Wolff, scientist and TV presenter (b. 1928)\n* 2017 – Calestous Juma, academic (b. 1953)\n\nHolidays and observances\n\n*Bill of Rights Day (United States)\n**2nd Amendment Day (South Carolina)\n*Christian feast day:\n**Drina Martyrs\n**Drostan (Aberdeen Breviary)\n**John Horden and Robert McDonald (Episcopal Church (USA))\n**Maria Crocifissa di Rosa\n**Mesmin\n**Valerian of Abbenza\n**Virginia Centurione Bracelli\n**December 15 (Eastern Orthodox liturgics)\n*Homecoming Day (Alderney)\n*International Tea Day\n*Kingdom Day (Netherlands), moves to December 16 if the 15th is on a Sunday\n*Zamenhof Day (International Esperanto Community). December 15. http://en.wikipedia.org/?curid=8145."
  }
}
