{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8400",
  "eid" : "e79fd1e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778468350,
  "textBody" : "The duodecimal system (also known as base 12 or dozenal) is a positional notation numeral system using twelve as its base. In this system, the number ten may be written by a rotated \"2\" (2) and the number eleven by a rotated \"3\" (3). This notation was introduced by Sir Isaac Pitman.Pitman, Isaac (ed.): A triple (twelve gross) Gems of Wisdom. London 1860 These digit forms are available as Unicode characters on computerized systems since June 2015 as ↊ (Code point 218A) and ↋ (Code point 218B), respectively. Other notations use \"A\", \"T\", or \"X\" for ten and \"B\" or \"E\" for eleven. The number twelve (that is, the number written as \"12\" in the base ten numerical system) is instead written as \"10\" in duodecimal (meaning \"1 dozen and 0 units\", instead of \"1 ten and 0 units\"), whereas the digit string \"12\" means \"1 dozen and 2 units\" (i.e. the same number that in decimal is written as \"14\"). Similarly, in duodecimal \"100\" means \"1 gross\", \"1000\" means \"1 great gross\", and \"0.1\" means \"1 twelfth\" (instead of their decimal meanings \"1 hundred\", \"1 thousand\", and \"1 tenth\").\n\nThe number twelve, a superior highly composite number, is the smallest number with four non-trivial factors (2, 3, 4, 6), and the smallest to include as factors all four numbers (1 to 4) within the subitizing range. As a result of this increased factorability of the radix and its divisibility by a wide range of the most elemental numbers (whereas ten has only two non-trivial factors: 2 and 5, and not 3, 4, or 6), duodecimal representations fit more easily than decimal ones into many common patterns, as evidenced by the higher regularity observable in the duodecimal multiplication table. As a result, duodecimal has been described as the optimal number system. Of its factors, 2 and 3 are prime, which means the reciprocals of all 3-smooth numbers (such as 2, 3, 4, 6, 8, 9, 12, 16, 18, 24, 27, 32, 36, ...) have a terminating representation in duodecimal. In particular, the five most elementary fractions (, , ,  and ) all have a short terminating representation in duodecimal (0.6, 0.4, 0.8, 0.3 and 0.9, respectively), and twelve is the smallest radix with this feature (because it is the least common multiple of 3 and 4). This all makes it a more convenient number system for computing fractions than most other number systems in common use, such as the decimal, vigesimal, binary, octal and hexadecimal systems. Although the trigesimal and sexagesimal systems (where the reciprocals of all 5-smooth numbers terminate) do even better in this respect, this is at the cost of unwieldy multiplication tables and a much larger number of symbols to memorize.\n\nOrigin \n\nIn this section, numerals are based on decimal places. For example, 10 means ten, 12 means twelve.\n\nLanguages using duodecimal number systems are uncommon. Languages in the Nigerian Middle Belt such as Janji, Gbiri-Niragu (Gure-Kahugu), Piti, and the Nimbia dialect of Gwandara; the Chepang language of Nepal and the Mahl language of Minicoy Island in India are known to use duodecimal numerals. \n\nGermanic languages have special words for 11 and 12, such as eleven and twelve in English.  However, they are considered to come from Proto-Germanic *ainlif and *twalif (respectively one left and two left), both of which were decimal.\n\nHistorically, units of time in many civilizations are duodecimal. There are twelve signs of the zodiac, twelve months in a year, and the Babylonians had twelve hours in a day (although at some point this was changed to 24). Traditional Chinese calendars, clocks, and compasses are based on the twelve Earthly Branches. There are 12 inches in an imperial foot, 12 troy ounces in a troy pound, 12 old British pence in a shilling, 24 (12×2) hours in a day, and many other items counted by the dozen, gross (144, square of 12) or great gross (1728, cube of 12). The Romans used a fraction system based on 12, including the uncia which became both the English words ounce and inch.  Pre-decimalisation, Ireland and the United Kingdom used a mixed duodecimal-vigesimal currency system (12 pence = 1 shilling, 20 shillings or 240 pence to the pound sterling or Irish pound), and Charlemagne established a monetary system that also had a mixed base of twelve and twenty, the remnants of which persist in many places.\n\nThe importance of 12 has been attributed to the number of lunar cycles in a year, and also to the fact that humans have 12 finger bones (phalanges) on one hand (three on each of four fingers). It is possible to count to 12 with the thumb acting as a pointer, touching each finger bone in turn. A traditional finger counting system still in use in many regions of Asia works in this way, and could help to explain the occurrence of numeral systems based on 12 and 60 besides those based on 10, 20 and 5. In this system, the one (usually right) hand counts repeatedly to 12, displaying the number of iterations on the other (usually left), until five dozens, i. e. the 60, are full.. Translated from the French by David Bellos, E.F. Harding, Sophie Wood and Ian Monk.\n\nNotations and pronunciations \n\nTransdecimal symbols\n\nIn a duodecimal place system twelve is written as 10, but there are numerous proposals for how to write ten and eleven. The simplified notations use only basic and easy to access letters such as T and E (for ten and eleven), X and Z, t and e, d and k, others use A and B or a and b as in the hexadecimal system. Some employ Greek letters such as δ (standing for Greek δέκα 'ten') and ε (for Greek ένδεκα 'eleven'), or τ and ε. Frank Emerson Andrews, an early American advocate for duodecimal, suggested and used in his book New Numbers an X (from the Roman numeral for ten) and a script E (ℰ, ).\n\nThe Dozenal Society of Great Britain proposes a rotated digit two 2 (↊, ) for ten and a reversed or rotated digit three 3 (↋, ) for eleven. This notation was introduced by Sir Isaac Pitman.\n\nUntil 2015, the Dozenal Society of America (DSA) used  and , the symbols devised by William Addison Dwiggins. After the Pitman digits (↊,  and ↋, ) were added to Unicode in 2015, the DSA took a vote and then began publishing content using the Pitman digits instead. They still use the letters X and E as the equivalent in ASCII text.\n\nOther proposals are more creative or aesthetic, for example, Edna Kramer in her 1951 book The Main Stream of Mathematics used a six-pointed asterisk (sextile) ⚹ for ten and a hash (or octothorpe) # for eleven. The symbols were chosen because they are available in typewriters and already present in telephone dials. This notation was used in publications of the Dozenal Society of America in the period 1974–2008. Many don't use any of the Hindu-Arabic symbols, under the principle of \"separate identity.\"\n\nBase notation\n\nThere are also varying proposals of how to distinguish a duodecimal number from a decimal one, or one in a different base. They include italicizing duodecimal numbers ( 54 64 ), adding a \"Humphrey  point\" (a semicolon \";\" instead of a decimal point \".\" ) to duodecimal numbers ( 54; \n 64. ) ( 54;0 64.0 ), or some combination of the two. More also add extra marking to one or more bases. Others use subscript or affixed labels to indicate the base, allowing for more than decimal and duodecimal to be represented:\n\nThis allows one to write \"54z 64d,\" \"54twelve \n 64ten\" or \"doz 54 = dec 64.\" In programming, binary, octal, and hexadecimal often use a similar scheme: a binary number starts with 0b, octal with 0o, and hexadecimal with 0x.\n\nPronunciation \n\nThe Dozenal Society of America suggests the pronunciation of ten and eleven as \"dek\" and \"el\", each order has its own name and the prefix e- is added for fractions. The symbol corresponding to the decimal point or decimal comma, separating the whole number part from the fractional part, is the semicolon \";\". The overall system is:\n\nMultiple digits in this are pronounced differently. 12 is \"one do two\", 30 is \"three do\", 100 is \"one gro\", BA9 (ET9) is \"el gro dek do nine\", B8,65A,300 (E8,65T,300) is \"el do eight bi-mo, six gro five do dek mo, three gro\", and so on.\n\nAdvocacy and \"dozenalism\"\n\nThe case for the duodecimal system was put forth at length in F. Emerson Andrews' 1935 book New Numbers: How Acceptance of a Duodecimal Base Would Simplify Mathematics. Emerson noted that, due to the prevalence of factors of twelve in many traditional units of weight and measure, many of the computational advantages claimed for the metric system could be realized either by the adoption of ten-based weights and measure or by the adoption of the duodecimal number system.\n\nThe Dozenal Society of America and the Dozenal Society of Great Britain promote widespread adoption of the base-twelve system. They use the word \"dozenal\" instead of \"duodecimal\" because the latter comes from Latin roots that express twelve in base-ten terminology.\n\nIt should be noted that the etymology of 'dozenal' is itself also an expression based on base-ten terminology since 'dozen' is a direct derivation of the French word 'douzaine' which is a derivative of the French word for twelve, douze which is related to the old French word 'doze' from Latin 'duodecim'. It has been suggested by some members of the Dozenal Society of America and Duodecimal Society of Great Britain that a more apt word would be 'uncial'. This is a derivation of the Latin word 'uncia' which means one-twelfth and is the base-twelve analogue of the Latin word 'decima' meaning one-tenth. In the same manner as decimal comes from the Latin word for one-tenth decima, (Latin for ten was decem), the direct analogue for a base-twelve system is uncial. An early use of this word can be found in Vol 1 Issue 2 of [http://www.dozenal.org/drupal/sites_bck/default/files/DuodecimalBulletinIssue012-web_0.pdf The Duodecimal Bulletin] of the DSA dated June 1945 in which a submission on page 9 by a Pvt William S. Crosby titled \"The Uncial Jottings of a Harried Infantryman\", he includes the same argument for the word 'uncial'. Although not accepted by either of these two 'Uncial' societies, the use is beginning to grow.\n\nThe renowned mathematician and mental calculator Alexander Craig Aitken was an outspoken advocate of the advantages and superiority of duodecimal over decimal:\n\nIn Jorge Luis Borges' short story Tlön, Uqbar, Orbis Tertius Herbert Ashe, a melancholy English engineer, working for the Southern Argentine Railway company, is converting a duodecimal number system to a hexadecimal system. He leaves behind on his death in 1937 a manuscript Orbis Tertius that posthumously identifies him as one of the anonymous authors of the encyclopaedia of Tlön.\n\nIn Leo Frankowski's Conrad Stargard novels, Conrad introduces a duodecimal system of arithmetic at the suggestion of a merchant, who is accustomed to buying and selling goods in dozens and grosses, rather than tens or hundreds. He then invents an entire system of weights and measures in base twelve, including a clock with twelve hours in a day, rather than twenty-four hours.\n\nIn Lee Carroll's Kryon: Alchemy of the Human Spirit, a chapter is dedicated to the advantages of the duodecimal system. The duodecimal system is supposedly suggested by Kryon (a fictional entity believed in by New Age circles) for all-round use, aiming at better and more natural representation of nature of the Universe through mathematics. An individual article \"Mathematica\" by James D. Watt (included in the above publication) exposes a few of the unusual symmetry connections between the duodecimal system and the golden ratio, as well as provides numerous number symmetry-based arguments for the universal nature of the base-12 number system.\n\nIn \"Little Twelvetoes\", American television series Schoolhouse Rock! portrayed an alien child using base-twelve arithmetic, using \"dek\", \"el\" and \"doh\" as names for ten, eleven and twelve, and Andrews' script-X and script-E for the digit symbols.[https://web.archive.org/web/20100206052053/http://www.schoolhouserock.tv/Little.html \"Little Twelvetoes\"]\n\nIn computing \n\nIn March 2013, a proposal was submitted to include the digit forms for ten and eleven propagated by the Dozenal Societies of Great Britain and America in the Unicode Standard. Of these, the British forms were accepted for encoding as characters at code points   (↊) and   (↋) They have been included in the Unicode 8.0 release in June 2015.\n\nUnicode points  and   seem to be reserved for the Dwiggins digits (stylized X and E).\n\nFew fonts support these new characters, but [http://christtrekker.users.sourceforge.net/fnt/abibas.shtml Abibas], EB Garamond, Everson Mono, Squarish Sans CT, and Symbola do.\n\nAlso, the turned digits two and three are available in LaTeX as \\textturntwo and \\textturnthree.\n\nDuodecimal clock \n\n* [http://www.dozenalsociety.org.uk/apps/dozenalclock.html Dozenal Clock by Joshua Harkey]\n* [http://dozenal.ae-web.ca/ Dozenal Clock with four hands and a digital display, in several variants, by Paul Rapoport]\n\nDuodecimal metric systems \n\nSystems of measurement proposed by dozenalists include:\n* Tom Pendlebury's TGM system\n* Takashi Suga's Universal Unit System\n\nComparison to other numeral systems \n\nThe number 12 has six factors, which are 1, 2, 3, 4, 6, and 12, of which 2 and 3 are prime.  The decimal system has only four factors, which are 1, 2, 5, and 10, of which 2 and 5 are prime. Vigesimal (base 20) adds two factors to those of ten, namely 4 and 20, but no additional prime factor. Although twenty has 6 factors, 2 of them prime, similarly to twelve, it is also a much larger base, and so the digit set and the multiplication table are much larger. Binary has only two factors, 1 and 2, the latter being prime. Hexadecimal (base 16) has five factors, adding 4, 8 and 16 to those of 2, but no additional prime. Trigesimal (base 30) is the smallest system that has three different prime factors (all of the three smallest primes: 2, 3 and 5) and it has eight factors in total (1, 2, 3, 5, 6, 10, 15, and 30). Sexagesimal—which the ancient Sumerians and Babylonians among others actually used—adds the four convenient factors 4, 12, 20, and 60 to this but no new prime factors. The smallest system that has four different prime factors is base 210 and the pattern follows the primorials. In all base systems, there are similarities to the representation of multiples of numbers which are one less than the base.\n\nConversion tables to and from decimal \n\nTo convert numbers between bases, one can use the general conversion algorithm (see the relevant section under positional notation). Alternatively, one can use digit-conversion tables. The ones provided below can be used to convert any duodecimal number between 0.01 and ƐƐƐ,ƐƐƐ.ƐƐ to decimal, or any decimal number between 0.01 and 999,999.99 to duodecimal. To use them, the given number must first be decomposed into a sum of numbers with only one significant digit each. For example:\n\n123,456.78 = 100,000 + 20,000 + 3,000 + 400 + 50 + 6 + 0.7 + 0.08\n\nThis decomposition works the same no matter what base the number is expressed in. Just isolate each non-zero digit, padding them with as many zeros as necessary to preserve their respective place values. If the digits in the given number include zeroes (for example, 102,304.05), these are, of course, left out in the digit decomposition (102,304.05 = 100,000 + 2,000 + 300 + 4 + 0.05). Then the digit conversion tables can be used to obtain the equivalent value in the target base for each digit. If the given number is in duodecimal and the target base is decimal, we get:\n\n(duodecimal) 100,000 + 20,000 + 3,000 + 400 + 50 + 6 + 0.7 + 0.08 = (decimal) 248,832 + 41,472 + 5,184 + 576 + 60 + 6 + 0.58333333333... + 0.05555555555...\n\nNow, because the summands are already converted to base ten, the usual decimal arithmetic is used to perform the addition and recompose the number, arriving at the conversion result:\n\n Duodecimal  ----->  Decimal\n \n   100,000     =    248,832\n    20,000     =     41,472\n     3,000     =      5,184\n       400     =        576\n        50     =         60\n  +      6     =   +      6\n         0.7   =          0.58333333333...\n         0.08  =          0.05555555555...\n --------------------------------------------\n   123,456.78  =    296,130.63888888888...\n\nThat is, (duodecimal) 123,456.78 equals (decimal) 296,130.63 ≈ 296,130.64\n\nIf the given number is in decimal and the target base is duodecimal, the method is basically same. Using the digit conversion tables:\n\n(decimal) 100,000 + 20,000 + 3,000 + 400 + 50 + 6 + 0.7 + 0.08 = (duodecimal) 49,ᘔ54 + Ɛ,6ᘔ8 + 1,8ᘔ0 + 294 + 42 + 6 + 0.84972497249724972497... + 0.0Ɛ62...\n\nHowever, in order to do this sum and recompose the number, now the addition tables for the duodecimal system have to be used, instead of the addition tables for decimal most people are already familiar with, because the summands are now in base twelve and so the arithmetic with them has to be in duodecimal as well. In decimal, 6 + 6 equals 12, but in duodecimal it equals 10; so, if using decimal arithmetic with duodecimal numbers one would arrive at an incorrect result. Doing the arithmetic properly in duodecimal, one gets the result:\n\n   Decimal  ----->  Duodecimal\n \n   100,000     =     49,ᘔ54\n    20,000     =      Ɛ,6ᘔ8\n     3,000     =      1,8ᘔ0\n       400     =        294\n        50     =         42\n  +      6     =   +      6\n         0.7   =          0.84972497249724972497...\n         0.08  =          0.0Ɛ62...\n --------------------------------------------------------\n   123,456.78  =     5Ɛ,540.943ᘔ...\n\nThat is, (decimal) 123,456.78 equals (duodecimal) 5Ɛ,540.9... ≈ 5Ɛ,540.94\n\nDuodecimal to decimal digit conversion \n\nDecimal to duodecimal digit conversion \n\nConversion of powers \n\nSome properties \n\n(In this section, all numbers are written with duodecimal)\n\nAll squares end with square digits (i.e. end with 0, 1, 4 or 9), if n is divisible by both 2 and 3, then n2 ends with 0, if n is not divisible by 2 or 3, then n2 ends with 1, if n is divisible by 2 but not by 3, then n2 ends with 4, if n is not divisible by 2 but by 3, then n2 ends with 9. If the unit digit of n2 is 0, then the dozens digit of n2 is either 0 or 3, if the unit digit of n2 is 1, then the dozens digit of n2 is even, if the unit digit of n2 is 4, then the dozen digit of n2 is 0, 1, 4, 5, 8 or 9, if the unit digit of n2 is 9, then the dozen digit of n2 is either 0 or 6. (More specially, all squares of (primes ≥ 5) end with 1)\n\nThe digital root of a square is 1, 3, 4, 5 or Ɛ.\n\nNo repdigits with more than one digit are squares, in fact, a square cannot end with three same digits except 000.\n\nNo four-digit palindrome numbers are squares.\n\nA cube can end with all digits except 2, 6 and ᘔ (in fact, no perfect powers end with 2, 6 or ᘔ), if n is not congruent to 2 mod 4, then n3 ends with the same digit as n; if n is congruent to 2 mod 4, then n3 ends with the digit (the last digit of n +- 6).\n\nThe digital root of a cube can be any number.\n\nIf k≥2, then nk+2 ends with the same digit as nk.\n\nExcept for 6 and 24, all even perfect numbers end with 54.\n\nThe digital root of an even perfect number is 1, 4, 6 or ᘔ.\n\nThe unit digits of powers of 2 are 1, 2, 4, 8, 4, 8, 4, 8, 4, ... (periodic with period 2)\n\nThe unit digits of powers of 3 are 1, 3, 9, 3, 9, 3, 9, 3, 9, ... (periodic with period 2)\n\nThe unit digits of powers of 5 are 1, 5, 1, 5, 1, 5, 1, 5, 1, ... (periodic with period 2)\n\nThe unit digits of powers of 7 are 1, 7, 1, 7, 1, 7, 1, 7, 1, ... (periodic with period 2)\n\nThe unit digits of powers of Ɛ are 1, Ɛ, 1, Ɛ, 1, Ɛ, 1, Ɛ, 1, ... (periodic with period 2)\n\nThe final two digits of powers of 2 are 01, 02, 04, 08, 14, 28, 54, ᘔ8, 94, 68, 14, 28, 54, ᘔ8, 94, 68, 14, ... (periodic with period 6)\n\nThe final two digits of powers of 3 are 01, 03, 09, 23, 69, 83, 09, 23, 69, 83, 09, 23, 69, ... (periodic with period 4)\n\nThe final two digits of powers of 5 are 01, 05, 21, ᘔ5, 41, 85, 61, 65, 81, 45, ᘔ1, 25, 01, 05, 21, ᘔ5, 41, ... (periodic with period 10)\n\nThe final two digits of powers of 7 are 01, 07, 41, 47, 81, 87, 01, 07, 41, 47, 81, 87, 01, ... (periodic with period 6)\n\nThe final two digits of powers of Ɛ are 01, 0Ɛ, ᘔ1, 2Ɛ, 81, 4Ɛ, 61, 6Ɛ, 41, 8Ɛ, 21, ᘔƐ, 01, 0Ɛ, ᘔ1, 2Ɛ, 81, ... (periodic with period 10)\n\nThe digital roots of powers of 2 are 1, 2, 4, 8, 5, ᘔ, 9, 7, 3, 6, 1, 2, 4, 8, 5, ᘔ, 9, 7, 3, 6, 1, ... (periodic with period ᘔ)\n\nThe digital roots of powers of 3 are 1, 3, 9, 5, 4, 1, 3, 9, 5, 4, 1, ... (periodic with period 5)\n\nThe digital roots of powers of 5 are 1, 5, 3, 4, 9, 1, 5, 3, 4, 9, 1, ... (periodic with period 5)\n\nThe digital roots of powers of 7 are 1, 7, 5, 2, 3, ᘔ, 4, 6, 9, 8, 1, 7, 5, 2, 3, ᘔ, 4, 6, 9, 8, 1, ... (periodic with period ᘔ)\n\nThe digital roots of powers of Ɛ are 1, Ɛ, Ɛ, Ɛ, Ɛ, Ɛ, ... (periodic with period 1)\n\nThe period of the unit digit of powers of a number coprime to 10 is at most 2, the final two digit is at most 20, the final three digits is 200, the final four digits is 2000, ..., the final n digits is 2×10n−1 (n≥2).\n\nThe unit digit of a Fibonacci number can be any digit except 6 (interestingly, if the unit digit of a Fibonacci number is 0, then the dozens digit of this number must also be 0, thus, all Fibonacci numbers divisible by 6 are also divisible by 100), and the unit digit of a Lucas number cannot be 0 or 9 (thus, no Lucas number is divisible by 10).\n\nThe unit digits of Fibonacci numbers are 0, 1, 1, 2, 3, 5, 8, 1, 9, ᘔ, 7, 5, 0, 5, 5, ᘔ, 3, 1, 4, 5, 9, 2, Ɛ, 1, 0, 1, 1, 2, 3, 5, ... (periodic with period 20)\n\nThe unit digits of Lucas numbers are 2, 1, 3, 4, 7, Ɛ, 6, 5, Ɛ, 4, 3, 7, ᘔ, 5, 3, 8, Ɛ, 7, 6, 1, 7, 8, 3, Ɛ, 2, 1, 3, 4, 7, Ɛ, ... (periodic with period 20)\n\nThe final two digits of Fibonacci numbers are 00, 01, 01, 02, 03, 05, 08, 11, 19, 2ᘔ, 47, 75, 00, 75, 75, 2ᘔ, ᘔ3, 11, Ɛ4, 05, Ɛ9, 02, ƐƐ, 01, 00, 01, 01, 02, 03, 05, ... (periodic with period 20)\n\nThe final two digits of Lucas numbers are 02, 01, 03, 04, 07, 0Ɛ, 16, 25, 3Ɛ, 64, ᘔ3, 47, 2ᘔ, 75, ᘔ3, 58, 3Ɛ, 97, 16, Ɛ1, 07, Ɛ8, 03, ƐƐ, 02, 01, 03, 04, 07, 0Ɛ, ... (periodic with period 20)\n\nThe digital roots of Fibonacci numbers are 0, 1, 1, 2, 3, 5, 8, 2, ᘔ, 1, Ɛ, 1, 1, 2, 3, 5, ... (periodic with period ᘔ)\n\nThe digital roots of Lucas numbers are 2, 1, 3, 4, 7, Ɛ, 7, 7, 3, ᘔ, 2, 1, 3, 4, 7, Ɛ, ... (periodic with period ᘔ)\n\nThe period of the unit digit of Fibonacci numbers is 20, the final two digits is also 20, the final three digits is 200, the final four digits is 2000, ..., the final n digits is 2×10n−1 (n≥2).\n\nAll prime numbers end with prime digits or 1 (i.e. end with 1, 2, 3, 5, 7 or Ɛ), more generally, except for 2 and 3, all prime numbers end with 1, 5, 7 or Ɛ (1 and all prime digits that do not divide 10).\n\nThe density of primes end with 1 is a relatively low, but the density of primes end with 5, 7 and Ɛ are nearly equal. (since all prime squares except 4 and 9 end with 1, no prime squares end with 5, 7 or Ɛ)\n\nExcept (3, 5), all twin primes end with (5, 7) or (Ɛ, 1).\n\nAll palindrome primes except 11 has an odd number of digits, since all even-digit palindrome numbers are divisible by 11.\n\nAll lucky numbers end with digit 1, 3, 7 or 9.\n\nExcept for 3, all Fermat primes end with 5.\n\nExcept for 3, all Mersenne primes end with 7.\n\nExcept for 2 and 3, all Sophie Germain primes end with 5 or Ɛ.\n\nExcept for 5 and 7, all safe primes end with Ɛ.\n\nA prime p is Gaussian prime if and only if p ends with 7 or Ɛ (or p=3).\n\nA prime p is Eisenstein prime if and only if p ends with 5 or Ɛ (or p=2).\n\nAll full reptend primes end with 5 or 7. (in fact, for all primes p ≥ 5, (p-1)/(the period length of 1/p) is odd if and only if p is end with 5 or 7, since 10 is a quadratic nonresidue mod p if and only if p is end with 5 or 7)\n\nIf p is a safe prime other than 5, 7 and Ɛ, then the period length of 1/p is (p-1)/2. (this is not true for all primes ends with Ɛ (other than Ɛ itself), the first counterexample is p = 2ƐƐ, where the period length of 1/p is only 37)\n\nThe only two base 10 Wieferich primes 10 are 1685 and 5Ɛ685, note that both of the numbers end with 685, and it is conjectured that all base 10 Wieferich primes end with 685.\n\nMost numbers that end with 2 are nontotient (in fact, all nontotients 2).\n\nAll orders of non-cyclic simple group end with 0.\n\nSome special numbers \n\n(In this section, all numbers are written with duodecimal, using X for ten and E for eleven)\n\nIn duodecimal, as in decimal, there are special numbers that exhibit digit patterns when, for example, multiplied by small integers:\n\n 2497 * 1 = 2497\n 2497 * 2 = 4972\n 2497 * 3 = 7249\n 2497 * 4 = 9724\n 2497 * 5 = EEEE\n\n 186X35 * 1 = 186X35\n 186X35 * 2 = 35186X\n 186X35 * 3 = 5186X3\n 186X35 * 4 = 6X3518\n 186X35 * 5 = 86X351\n 186X35 * 6 = X35186\n 186X35 * 7 = EEEEEE\n\n 8579214E36429X7 * 1 = 8579214E36429X7\n 8579214E36429X7 * 2 = 14E36429X7085792\n 8579214E36429X7 * 3 = 214E36429X708579\n 8579214E36429X7 * 4 = 29X708579214E364\n 8579214E36429X7 * 5 = 36429X708579214E\n 8579214E36429X7 * 6 = 429X708579214E36\n 8579214E36429X7 * 7 = 4E36429X70857921\n 8579214E36429X7 * 8 = 579214E36429X708\n 8579214E36429X7 * 9 = 6429X708579214E3\n 8579214E36429X7 * X = 708579214E36429X\n 8579214E36429X7 * E = 79214E36429X7085\n 8579214E36429X7 * 10 = 8579214E36429X70\n 8579214E36429X7 * 11 = 9214E36429X70857\n 8579214E36429X7 * 12 = 9X708579214E3642\n 8579214E36429X7 * 13 = X708579214E36429\n 8579214E36429X7 * 14 = E36429X708579214\n 8579214E36429X7 * 15 = EEEEEEEEEEEEEEEE\n\n 123456789XE * 1 = 123456789XE\n 123456789XE * 2 = 2468E13579X\n 123456789XE * 3 = 36X147E2589\n 123456789XE * 4 = 4915X26E378\n 123456789XE * 5 = 5E4X3928167\n 123456789XE * 6 = 718293X4E56\n 123456789XE * 7 = 83E72X61945\n 123456789XE * 8 = 962E851X734\n 123456789XE * 9 = X8641E97523\n 123456789XE * X = EX987654312\n 123456789XE * E = 111111111101\n\n 123456789E * 1 = 123456789E (miss digit X)\n 123456789E * 2 = 2468E1357X (miss digit 9)\n 123456789E * 3 = 36X147E259 (miss digit 8)\n 123456789E * 4 = 4915X26E38 (miss digit 7)\n 123456789E * 5 = 5E4X392817 (miss digit 6)\n 123456789E * 6 = 718293X4E6 (miss digit 5)\n 123456789E * 7 = 83E72X6195 (miss digit 4)\n 123456789E * 8 = 962E851X74 (miss digit 3)\n 123456789E * 9 = X8641E9753 (miss digit 2)\n 123456789E * X = EX98765432 (miss digit 1)\n 123456789E * E = 11111111111\n\n 275 * 5 = 1111\n 275 * X = 2222\n 275 * 13 = 3333\n 275 * 18 = 4444\n 275 * 21 = 5555\n 275 * 26 = 6666\n 275 * 2E = 7777\n 275 * 34 = 8888\n 275 * 39 = 9999\n 275 * 42 = XXXX\n 275 * 47 = EEEE\n\n 1X537 * 7 = 111111\n 1X537 * 12 = 222222\n 1X537 * 19 = 333333\n 1X537 * 24 = 444444\n 1X537 * 2E = 555555\n 1X537 * 36 = 666666\n 1X537 * 41 = 777777\n 1X537 * 48 = 888888\n 1X537 * 53 = 999999\n 1X537 * 5X = XXXXXX\n 1X537 * 65 = EEEEEE\n\n 123456789E * E = 11111111111\n 123456789E * 1X = 22222222222\n 123456789E * 29 = 33333333333\n 123456789E * 38 = 44444444444\n 123456789E * 47 = 55555555555\n 123456789E * 56 = 66666666666\n 123456789E * 65 = 77777777777\n 123456789E * 74 = 88888888888\n 123456789E * 83 = 99999999999\n 123456789E * 92 = XXXXXXXXXXX\n 123456789E * X1 = EEEEEEEEEEE\n\n 92X79E43715865 * 15 = 1111111111111111\n 92X79E43715865 * 2X = 2222222222222222\n 92X79E43715865 * 43 = 3333333333333333\n 92X79E43715865 * 58 = 4444444444444444\n 92X79E43715865 * 71 = 5555555555555555\n 92X79E43715865 * 86 = 6666666666666666\n 92X79E43715865 * 9E = 7777777777777777\n 92X79E43715865 * E4 = 8888888888888888\n 92X79E43715865 * 109 = 9999999999999999\n 92X79E43715865 * 122 = XXXXXXXXXXXXXXXX\n 92X79E43715865 * 137 = EEEEEEEEEEEEEEEE\n\n 8327 * 17 = 111111\n 8327 * 32 = 222222\n 8327 * 49 = 333333\n 8327 * 64 = 444444\n 8327 * 7E = 555555\n 8327 * 96 = 666666\n 8327 * E1 = 777777\n 8327 * 108 = 888888\n 8327 * 123 = 999999\n 8327 * 13X = XXXXXX\n 8327 * 155 = EEEEEE\n\n 112233445566778899XE * EE = 1111111111111111111111\n 112233445566778899XE * 1EX = 2222222222222222222222\n 112233445566778899XE * 2E9 = 3333333333333333333333\n 112233445566778899XE * 3E8 = 4444444444444444444444\n 112233445566778899XE * 4E7 = 5555555555555555555555\n 112233445566778899XE * 5E6 = 6666666666666666666666\n 112233445566778899XE * 6E5 = 7777777777777777777777\n 112233445566778899XE * 7E4 = 8888888888888888888888\n 112233445566778899XE * 8E3 = 9999999999999999999999\n 112233445566778899XE * 9E2 = XXXXXXXXXXXXXXXXXXXXXX\n 112233445566778899XE * XE1 = EEEEEEEEEEEEEEEEEEEEEE\n\n 1^2 01, 0 + 1 \n 1\n E^2 X1, X + 1 \n E\n 56^2 2630, 26 + 30 \n 56\n 66^2 3630, 36 + 30 \n 66\n EE^2 EX01, EX + 01 \n EE\n 444^2 170294, 170 + 294 \n 444\n 778^2 4X4294, 4X4 + 294 \n 778\n EEE^2 EEX001, EEX + 001 \n EEE\n 12XX^2 1661144, 166 + 1144 \n 12XX\n 1640^2 2401400, 240 + 1400 \n 1640\n 2046^2 4161830, 416 + 1830 \n 2046\n 2929^2 7802169, 780 + 2169 \n 2929\n 3333^2 X862469, X86 + 2469 \n 3333\n 4973^2 1E062X69, 1E06 + 2X69 \n 4973\n 5E60^2 2E603000, 2E60 + 3000 \n 5E60\n\n 2^2 + 5^2 = 25\n X^2 + 5^2 = X5\n 5^3 + 7^3 + 7^3 = 577\n 6^3 + 6^3 + 8^3 = 668\n X^3 + 8^3 + 3^3 = X83\n 1^5 + 4^5 + 7^5 + 6^5 + 5^5 = 14765\n 9^5 + 3^5 + 8^5 + X^5 + 4^5 = 938X4\n 3^6 + 6^6 + 9^6 + 8^6 + 6^6 + 2^6 = 369862\n X^6 + 2^6 + 3^6 + 9^6 + 4^6 + X^6 = X2394X\n\n 14 = (1 * 4)^2\n 20 = (2^2 + 0^2)!\n 21 = (2^2 + 1^2)^2\n 24 = 2^2 + 4!\n 30 = ((3 + 0)!)^2\n 43 = 4! + 3^3\n 48 = 4^3 - 8\n 84 = (8 + sqrt(4))^2\n X1 = (X + 1)^2\n X5 = (X - 5)^3\n X8 = (X - 8)^7\n XE = X + E^2\n 121 = (12 - 1)^2\n 169 = (1 * (6 + 9))^2\n 230 = (30 / 2)^2\n\n           1 * X + 1 = E\n          12 * X + 2 = EX\n         123 * X + 3 = EX9\n        1234 * X + 4 = EX98\n       12345 * X + 5 = EX987\n      123456 * X + 6 = EX9876\n     1234567 * X + 7 = EX98765\n    12345678 * X + 8 = EX987654\n   123456789 * X + 9 = EX9876543\n  123456789X * X + X = EX98765432\n 123456789XE * X + E = EX987654321\n\n           0 * E + 1 = 1\n           1 * E + 2 = 11\n          12 * E + 3 = 111\n         123 * E + 4 = 1111\n        1234 * E + 5 = 11111\n       12345 * E + 6 = 111111\n      123456 * E + 7 = 1111111\n     1234567 * E + 8 = 11111111\n    12345678 * E + 9 = 111111111\n   123456789 * E + X = 1111111111\n  123456789X * E + E = 11111111111\n 123456789XE * E + 10 = 111111111111\n\n            1^2 = 1\n           11^2 = 121\n          111^2 = 12321\n         1111^2 = 1234321\n        11111^2 = 123454321\n       111111^2 = 12345654321\n      1111111^2 = 1234567654321\n     11111111^2 = 123456787654321\n    111111111^2 = 12345678987654321\n   1111111111^2 = 123456789X987654321\n  11111111111^2 = 123456789XEX987654321\n 111111111111^2 123456789E00EX987654321 ((1_n)^2 is not palindrome number if n >\n 10)\n\n            E^2 = X1\n           EE^2 = EX01\n          EEE^2 = EEX001\n         EEEE^2 = EEEX0001\n        EEEEE^2 = EEEEX00001\n       EEEEEE^2 = EEEEEX000001\n      EEEEEEE^2 = EEEEEEX0000001\n     EEEEEEEE^2 = EEEEEEEX00000001\n    EEEEEEEEE^2 = EEEEEEEEX000000001\n   EEEEEEEEEE^2 = EEEEEEEEEX0000000001\n  EEEEEEEEEEE^2 = EEEEEEEEEEX00000000001\n EEEEEEEEEEEE^2 = EEEEEEEEEEEX000000000001\n\n 10XE * 1 = 10XE\n 10XE * 2 = 219X\n 10XE * 3 = 3289\n 10XE * 4 = 4378\n 10XE * 5 = 5467\n 10XE * 6 = 6556\n 10XE * 7 = 7645\n 10XE * 8 = 8734\n 10XE * 9 = 9823\n 10XE * X = X912\n 10XE * E = EX01\n\n 10EXE * 1 = 10EXE\n 10EXE * 2 = 21E9X\n 10EXE * 3 = 32E89\n 10EXE * 4 = 43E78\n 10EXE * 5 = 54E67\n 10EXE * 6 = 65E56\n 10EXE * 7 = 76E45\n 10EXE * 8 = 87E34\n 10EXE * 9 = 98E23\n 10EXE * X = X9E12\n 10EXE * E = EXE01\n\n 1 / E = 0.111111111111 ...\n 1 / 11 = 0.0E 0E 0E 0E 0E 0E ...\n 1 / EE = 0.01 01 01 01 01 01 ...\n 1 / 101 = 0.00EE 00EE 00EE ...\n 1 / E1 = 0.010EXE 010EXE ...\n 1 / 111 = 0.00E 00E 00E 00E ...\n 1 / X1 = 0.0123456789E 0123456789E ...\n 1 / 121 = 0.00X28466482X0 EE1937557391E ...\n\n 1 / XE1 = 0.00112233445566778899XE 00112233445566778899XE ...\n 1 / XEE1 = 0.000111222333444555666777888999XXE 000111222333444555666777888999XXE ...\n 1 / XEEE1 = 0.0000111122223333444455556666777788889999XXXE 0000111122223333444455556666777788889999XXXE ...\n\n 1 / EXEE = 0.00 01 01 02 03 05 08 11 19 2X 47 ...\n 1 / EEXEEE = 0.000 001 001 002 003 005 008 011 019 02X 047 075 100 175 275 42X 6X3 ...\n 1 / EEEXEEEE = 0.0000 0001 0001 0002 0003 0005 0008 0011 0019 002X 0047 0075 0100 0175 0275 042X 06X3 0E11 15E4 ...\n\n 1 / EXE01 = 0.0000101111212222323333434444545555656666767777878888989999X9XXXXEE 0000101111212222323333434444545555656666767777878888989999X9XXXXEE ...\n\n 1 / EX01 = 0.00 01 02 03 04 05 06 07 08 09 0X 0E 10 11 12 13 14 15 16 17 18 19 1X 1E 20 21 22 23 24 25 26 27 28 29 2X 2E 30 31 32 33 34 35 36 37 38 39 3X 3E 40 41 42 43 44 45 46 47 48 49 4X 4E 50 51 52 53 54 55 56 57 58 59 5X 5E 60 61 62 63 64 65 66 67 68 69 6X 6E 70 71 72 73 74 75 76 77 78 79 7X 7E 80 81 82 83 84 85 86 87 88 89 8X 8E 90 91 92 93 94 95 96 97 98 99 9X 9E X0 X1 X2 X3 X4 X5 X6 X7 X8 X9 XX XE E0 E1 E2 E3 E4 E5 E6 E7 E8 E9 EE 00 01 02 03 04 05 06 07 08 09 0X 0E 10 11 12 13 14 15 16 17 18 19 1X 1E 20 21 22 23 24 25 26 27 28 29 2X 2E 30 31 32 33 34 35 36 37 38 39 3X 3E 40 41 42 43 44 45 46 47 48 49 4X 4E 50 51 52 53 54 55 56 57 58 59 5X 5E 60 61 62 63 64 65 66 67 68 69 6X 6E 70 71 72 73 74 75 76 77 78 79 7X 7E 80 81 82 83 84 85 86 87 88 89 8X 8E 90 91 92 93 94 95 96 97 98 99 9X 9E X0 X1 X2 X3 X4 X5 X6 X7 X8 X9 XX XE E0 E1 E2 E3 E4 E5 E6 E7 E8 E9 EE ...\n\n 1 / EEX001 = 0.000 001 002 003 004 005 006 007 008 009 00X 00E 010 011 012 013 014 ...\n 1 / EEEX0001 = 0.0000 0001 0002 0003 0004 0005 0006 0007 0008 0009 000X 000E 0010 0011 0012 0013 0014 ...\n\n 1 / EX = 0.01 02 04 08 14 28 54 X8\n                                  194\n                                    368\n                                      714\n                                       1228\n                                         2454 ... (powers of 2)\n\n 1 / E9 = 0.01 03 09 23 69\n                         183\n                           509\n                            1323\n                              3969 ... (powers of 3)\n\n 1 / E8 = 0.01 04 14 54\n                      194\n                        714\n                         2454 ... (powers of 4)\n\n 1 / XE = 0.0112358\n                  11\n                   19\n                    2X\n                     47\n                      75\n                      100\n                       175\n                        275\n                         42X\n                          6X3\n                           E11\n                           15E4 ... (Fibonacci numbers)\n\n 1 / 9E = 0.0125\n               10\n                25\n                 5X\n                 121\n                  2X0\n                   6X1\n                   1462 ... (Pell numbers)\n\n 1 / 5E = 0.02 04 08 14 28 54 X8\n                               194\n                                 368\n                                   714\n                                    1228\n                                      2454 ... (powers of 2)\n\n 1 / 3E = 0.03 09 23 69\n                      183\n                        509\n                         1323\n                           3969 ... (powers of 3)\n\n 1 / 2E = 0.04 14 54\n                   194\n                     714\n                      2454 ... (powers of 4)\n\n                                      148421\n                                     28\n                                    54\n                                   X8\n                                 194\n                                368\n                               714\n                             1228\n 1 / 1E = (powers of 2) ... 2454\n\n                                  23931\n                                 69\n                               183\n                              509\n                            1323\n 1 / 2E = (power of 3) ... 3969\n\n                                 1441\n                                54\n                              194\n                             714\n 1 / 3E = (power of 4) ... 2454\n\n                                                11853211\n                                               19\n                                              2X\n                                             47\n                                            75\n                                          100\n                                         175\n                                        275\n                                       42X\n                                      6X3\n                                     E11\n 1 / 10E = (Fibonacci numbers) ... 15E4\n\n                                      10521\n                                     25\n                                    5X\n                                  121\n                                 2X0\n                                6X1\n 1 / 11E = (Pell numbers) ... 1462\n\n ab * 5 * 25 = abab\n ab * 7 * 17 * 111 = ababab\n ab * 5 * 25 * 75 * 175 = abababab\n abc * 7 * 11 * 17 = abcabc\n abcd * 75 * 175 = abcdabcd\n\nPrime numbers and divisibility rules\n\n(In this section, all numbers are written with duodecimal)\n\nA natural number (i.e. 1, 2, 3, 4, 5, 6, etc.) is called a prime number (or a prime) if it has exactly two positive divisors, 1 and the number itself. Natural numbers greater than 1 that are not prime are called composite.\n\nThe first 1ᘔ5 prime numbers (all the prime numbers less than 1000) are:\n\n2, 3, 5, 7, Ɛ, 11, 15, 17, 1Ɛ, 25, 27, 31, 35, 37, 3Ɛ, 45, 4Ɛ, 51, 57, 5Ɛ, 61, 67, 6Ɛ, 75, 81, 85, 87, 8Ɛ, 91, 95, ᘔ7, ᘔƐ, Ɛ5, Ɛ7, 105, 107, 111, 117, 11Ɛ, 125, 12Ɛ, 131, 13Ɛ, 141, 145, 147, 157, 167, 16Ɛ, 171, 175, 17Ɛ, 181, 18Ɛ, 195, 19Ɛ, 1ᘔ5, 1ᘔ7, 1Ɛ1, 1Ɛ5, 1Ɛ7, 205, 217, 21Ɛ, 221, 225, 237, 241, 24Ɛ, 251, 255, 25Ɛ, 267, 271, 277, 27Ɛ, 285, 291, 295, 2ᘔ1, 2ᘔƐ, 2Ɛ1, 2ƐƐ, 301, 307, 30Ɛ, 315, 321, 325, 327, 32Ɛ, 33Ɛ, 347, 34Ɛ, 357, 35Ɛ, 365, 375, 377, 391, 397, 3ᘔ5, 3ᘔƐ, 3Ɛ5, 3Ɛ7, 401, 40Ɛ, 415, 41Ɛ, 421, 427, 431, 435, 437, 447, 455, 457, 45Ɛ, 465, 46Ɛ, 471, 481, 485, 48Ɛ, 497, 4ᘔ5, 4Ɛ1, 4ƐƐ, 507, 511, 517, 51Ɛ, 527, 531, 535, 541, 545, 557, 565, 575, 577, 585, 587, 58Ɛ, 591, 59Ɛ, 5Ɛ1, 5Ɛ5, 5Ɛ7, 5ƐƐ, 611, 615, 617, 61Ɛ, 637, 63Ɛ, 647, 655, 661, 665, 66Ɛ, 675, 687, 68Ɛ, 695, 69Ɛ, 6ᘔ7, 6Ɛ1, 701, 705, 70Ɛ, 711, 71Ɛ, 721, 727, 735, 737, 745, 747, 751, 767, 76Ɛ, 771, 775, 77Ɛ, 785, 791, 797, 7ᘔ1, 7ƐƐ, 801, 80Ɛ, 817, 825, 82Ɛ, 835, 841, 851, 855, 85Ɛ, 865, 867, 871, 881, 88Ɛ, 8ᘔ5, 8ᘔ7, 8ᘔƐ, 8Ɛ5, 8Ɛ7, 901, 905, 907, 90Ɛ, 91Ɛ, 921, 927, 955, 95Ɛ, 965, 971, 987, 995, 9ᘔ7, 9ᘔƐ, 9Ɛ1, 9Ɛ5, 9ƐƐ, ᘔ07, ᘔ0Ɛ, ᘔ11, ᘔ17, ᘔ27, ᘔ35, ᘔ37, ᘔ3Ɛ, ᘔ41, ᘔ45, ᘔ4Ɛ, ᘔ5Ɛ, ᘔ6Ɛ, ᘔ77, ᘔ87, ᘔ91, ᘔ95, ᘔ9Ɛ, ᘔᘔ7, ᘔᘔƐ, ᘔƐ7, ᘔƐƐ, Ɛ11, Ɛ15, Ɛ1Ɛ, Ɛ21, Ɛ25, Ɛ2Ɛ, Ɛ31, Ɛ37, Ɛ45, Ɛ61, Ɛ67, Ɛ6Ɛ, Ɛ71, Ɛ91, Ɛ95, Ɛ97, Ɛᘔ5, ƐƐ5, ƐƐ7\n\nExcept 2 and 3, all primes end in 1, 5, 7 or Ɛ. The first k such that all of 10k, 10k + 1, 10k + 2, ..., 10k + Ɛ are all composite is 38, i.e. all of  380, 381, 382, ..., 38Ɛ are composite.\n\nThe density of primes end with 1 is a relatively low, but the density of primes end with 5, 7 and Ɛ are nearly equal. (i.e. for a given natural number N, the numbers of primes end with 1 less than N is usually smaller than the number of primes end with 5 (or 7, or Ɛ) less than N)\n\nThere are 2ᘔ primes between 1 and 100, 23 primes between 101 and 200, 1ᘔ primes between 201 and 300, 1ᘔ primes between 301 and 400, 1Ɛ primes between 401 and 500, 1ᘔ primes between 501 and 600, 16 primes between 601 and 700, 1ᘔ primes between 701 and 800, 18 primes between 801 and 900, 16 primes between 901 and ᘔ00, 1ᘔ primes between ᘔ01 and Ɛ00, 17 primes between Ɛ01 and 1000.\n\nThis section focuses on duodecimal divisibility rules.\n\n;1\nAny integer is divisible by 1.\n\n;2\nIf a number is divisible by 2 then the unit digit of that number will be 0, 2, 4, 6, 8 or ᘔ.\n\n;3\nIf a number is divisible by 3 then the unit digit of that number will be 0, 3, 6 or 9.\n\n;4\nIf a number is divisible by 4 then the unit digit of that number will be 0, 4 or 8.\n\n;5\nTo test for divisibility by 5, double the units digit and subtract the result from the number formed by the rest of the digits. If the result is divisible by 5 then the given number is divisible by 5.\n\nThis rule comes from 21(5*5)\n\nExamples: \n13        rule > |1-2*3| \n 5 which is divisible by 5.\n2Ɛᘔ5    rule > |2Ɛᘔ-2*5| \n 2Ɛ0(5*70) which is divisible by 5(or apply the rule on 2Ɛ0).\n\nOR\n\nTo test for divisibility by 5, subtract the units digit and triple of the result to the number formed by the rest of the digits. If the result is divisible by 5 then the given number is divisible by 5.\n\nThis rule comes from 13(5*3)\n\nExamples: \n13        rule > |3-3*1| \n 0 which is divisible by 5.\n2Ɛᘔ5    rule > |5-3*2Ɛᘔ| \n 8Ɛ1(5*195) which is divisible by 5(or apply the rule on 8Ɛ1).\n\nOR\n\nForm the alternating sum of blocks of two from right to left. If the result is divisible by 5 then the given number is divisible by 5.\n\nThis rule comes from 101, since 101 = 5*25, thus this rule can be also tested for the divisibility by 25.\n\nExample:\n\n97,374,627 > 27-46+37-97 \n -7Ɛ which is divisible by 5.\n\n;6\nIf a number is divisible by 6 then the unit digit of that number will be 0 or 6.\n\n;7\nTo test for divisibility by 7, triple the units digit and add the result to the number formed by the rest of the digits. If the result is divisible by 7 then the given number is divisible by 7.\n\nThis rule comes from 2Ɛ(7*5)\n\nExamples:\n12     rule > |3*2+1| \n 7 which is divisible by 7.\n271Ɛ    rule > |3*Ɛ+271| \n 29ᘔ(7*4ᘔ) which is divisible by 7(or apply the rule on 29ᘔ).\n\nOR\n\nTo test for divisibility by 7, subtract the units digit and double the result from the number formed by the rest of the digits. If the result is divisible by 7 then the given number is divisible by 7.\n\nThis rule comes from 12(7*2)\n\nExamples:\n12     rule > |2-2*1| \n 0 which is divisible by 7.\n271Ɛ    rule > |Ɛ-2*271| \n 513(7*89) which is divisible by 7(or apply the rule on 513).\n\nOR\n\nTo test for divisibility by 7, 4 times the units digit and subtract the result from the number formed by the rest of the digits. If the result is divisible by 7 then the given number is divisible by 7.\n\nThis rule comes from 41(7*7)\n\nExamples:\n12     rule > |4*2-1| \n 7 which is divisible by 7.\n271Ɛ    rule > |4*Ɛ-271| \n 235(7*3Ɛ) which is divisible by 7(or apply the rule on 235).\n\nOR\n\nForm the alternating sum of blocks of three from right to left. If the result is divisible by 7 then the given number is divisible by 7.\n\nThis rule comes from 1001, since 1001 = 7*11*17, thus this rule can be also tested for the divisibility by 11 and 17.\n\nExample:\n\n386,967,443 > 443-967+386 \n -168 which is divisible by 7.\n\n;8\nIf the 2-digit number formed by the last 2 digits of the given number is divisible by 8 then the given number is divisible by 8.\n\nExample: 1Ɛ48, 4120\n      rule => since 48(8*7) divisible by 8, then 1Ɛ48 is divisible by 8.\n      rule => since 20(8*3) divisible by 8, then 4120 is divisible by 8.\n\n;9\nIf the 2-digit number formed by the last 2 digits of the given number is divisible by 9 then the given number is divisible by 9.\n\nExample: 7423, 8330\n      rule => since 23(9*3) divisible by 9, then 7423 is divisible by 9.\n      rule => since 30(9*4) divisible by 9, then 8330 is divisible by 9.\n\n;ᘔ\nIf the number is divisible by 2 and 5 then the number is divisible by ᘔ.\n\n;Ɛ\nIf the sum of the digits of a number is divisible by Ɛ then the number is divisible by Ɛ (the equivalent of casting out nines in decimal).\n\nExample: 29, 61Ɛ13\n      rule > 2+9 \n Ɛ which is divisible by Ɛ, then 29 is divisible by Ɛ.\n      rule > 6+1+Ɛ+1+3 \n 1ᘔ which is divisible by Ɛ, then 61Ɛ13 is divisible by Ɛ.\n\n;10\nIf a number is divisible by 10 then the unit digit of that number will be 0.\n\n;11\nSum the alternate digits and subtract the sums. If the result is divisible by 11 the number is divisible by 11 (the equivalent of divisibility by eleven in decimal).\n\nExample: 66, 9427\n      rule > |6-6| \n 0 which is divisible by 11, then 66 is divisible by 11.\n      rule > |(9+2)-(4+7)| \n |ᘔ-ᘔ| = 0 which is divisible by 11, then 9427 is divisible by 11.\n\n;12\nIf the number is divisible by 2 and 7 then the number is divisible by 12.\n\n;13\nIf the number is divisible by 3 and 5 then the number is divisible by 13.\n\n;14\nIf the 2-digit number formed by the last 2 digits of the given number is divisible by 14 then the given number is divisible by 14.\n\nFractions and irrational numbers\n\nFractions\n\nDuodecimal fractions may be simple:\n*  = 0.6\n*  = 0.4\n*  = 0.3\n*  = 0.2\n*  = 0.16\n*  = 0.14\n*  = 0.1  (note that this is a twelfth,  is a tenth)\n*  = 0.09 (note that this is a sixteenth,  is a fourteenth)\n\nor complicated:\n*   = 0.249724972497... recurring (rounded to 0.24ᘔ)\n*   = 0.186ᘔ35186ᘔ35... recurring (rounded to 0.187)\n*   = 0.1249724972497... recurring (rounded to 0.125)\n*   = 0.111111111111... recurring (rounded to 0.111)\n*  = 0.0Ɛ0Ɛ0Ɛ0Ɛ0Ɛ0Ɛ... recurring (rounded to 0.0Ɛ1)\n*  = 0.0ᘔ35186ᘔ35186... recurring (rounded to 0.0ᘔ3)\n*  = 0.0972497249724... recurring (rounded to 0.097)\n\nAs explained in recurring decimals, whenever an irreducible fraction is written in radix point notation in any base, the fraction can be expressed exactly (terminates) if and only if all the prime factors of its denominator are also prime factors of the base. Thus, in base-ten ( 2×5) system, fractions whose denominators are made up solely of multiples of 2 and 5 terminate:   \n ,    and  \n  can be expressed exactly as 0.125, 0.05 and 0.002 respectively.  and , however, recur (0.333... and 0.142857142857...). In the duodecimal (= 2×2×3) system,  is exact;  and  recur because they include 5 as a factor;  is exact; and  recurs, just as it does in decimal.\n\nThe number of denominators which give terminating fractions within a given number of digits, say n, in a base b is the number of factors (divisors) of bn, the nth power of the base b (although this includes the divisor 1, which does not produce fractions when used as the denominator). The number of factors of bn is given using its prime factorization.\n\nFor decimal, 10n = 2n * 5n. The number of divisors is found by adding one to each exponent of each prime and multiplying the resulting quantities together.\nFactors of 10n (n+1)(n+1) \n (n+1)2.\n\nFor example, the number 8 is a factor of 103 (1000), so 1/8 and other fractions with a denominator of 8 can not require more than 3 fractional decimal digits to terminate. 5/8 = 0.625ten\n\nFor duodecimal, 12n 22n * 3n. This has (2n+1)(n+1) divisors. The sample denominator of 8 is a factor of a gross (122 \n 144), so eighths can not need more than two duodecimal fractional places to terminate. 5/8 = 0.76twelve\n\nBecause both ten and twelve have two unique prime factors, the number of divisors of bn for b = 10 or 12 grows quadratically with the exponent n (in other words, of the order of n2).\n\nRecurring digits \n\nThe Dozenal Society of America argues that factors of 3 are more commonly encountered in real-life division problems than factors of 5.http://www.dozenal.org/articles/DSA-DozenalFAQs.pdf Thus, in practical applications, the nuisance of repeating decimals is encountered less often when duodecimal notation is used. Advocates of duodecimal systems argue that this is particularly true of financial calculations, in which the twelve months of the year often enter into calculations.\n\nHowever, when recurring fractions do occur in duodecimal notation, they are less likely to have a very short period than in decimal notation, because 12 (twelve) is between two prime numbers, 11 (eleven) and 13 (thirteen), whereas ten is adjacent to the composite number 9. Nonetheless, having a shorter or longer period doesn't help the main inconvenience that one does not get a finite representation for such fractions in the given base (so rounding, which introduces inexactitude, is necessary to handle them in calculations), and overall one is more likely to have to deal with infinite recurring digits when fractions are expressed in decimal than in duodecimal, because one out of every three consecutive numbers contains the prime factor 3 in its factorization, whereas only one out of every five contains the prime factor 5. All other prime factors, except 2, are not shared by either ten or twelve, so they do not\ninfluence the relative likeliness of encountering recurring digits (any irreducible fraction that contains any of these other factors in its denominator will recur in either base). Also, the prime factor 2 appears twice in the factorization of twelve, whereas only once in the factorization of ten; which means that most fractions whose denominators are powers of two will have a shorter, more convenient terminating representation in duodecimal than in decimal representation (e.g. 1/(22) 0.25 ten \n 0.3 twelve; 1/(23) 0.125 ten \n 0.16 twelve; 1/(24) 0.0625 ten \n 0.09 twelve; 1/(25) 0.03125 ten \n 0.046 twelve; etc.).\n\nValues in bold indicate that value is exact.\n\nThe duodecimal period length of 1/n are\n0, 0, 0, 0, 4, 0, 6, 0, 0, 4, 1, 0, 2, 6, 4, 0, 16, 0, 6, 4, 6, 1, 11, 0, 20, 2, 0, 6, 4, 4, 30, 0, 1, 16, 12, 0, 9, 6, 2, 4, 40, 6, 42, 1, 4, 11, 23, 0, 42, 20, 16, 2, 52, 0, 4, 6, 6, 4, 29, 4, 15, 30, 6, 0, 4, 1, 66, 16, 11, 12, 35, 0, ... \n\nThe duodecimal period length of 1/(nth prime) are\n0, 0, 4, 6, 1, 2, 16, 6, 11, 4, 30, 9, 40, 42, 23, 52, 29, 15, 66, 35, 36, 26, 41, 8, 16, 100, 102, 53, 54, 112, 126, 65, 136, 138, 148, 150, 3, 162, 83, 172, 89, 90, 95, 24, 196, 66, 14, 222, 113, 114, 8, 119, 120, 125, 256, 131, 268, 54, 138, 280, ... \n\nSmallest prime with duodecimal period n are\n11, 13, 157, 5, 22621, 7, 659, 89, 37, 19141, 23, 20593, 477517, 211, 61, 17, 2693651, 1657, 29043636306420266077, 85403261, 8177824843189, 57154490053, 47, 193, 303551, 79, 306829, 673, 59, 31, 373, 153953, 886381, 2551, 71, 73, ... \n\nIrrational numbers \n\nAs for irrational numbers, none of them have a finite representation in any of the rational-based positional number systems (such as the decimal and duodecimal ones); this is because a rational-based positional number system is essentially nothing but a way of expressing quantities as a sum of fractions whose denominators are powers of the base, and by definition no finite sum of rational numbers can ever result in an irrational number. For example, 123.456 = 1 × 102 + 2 × 101 + 3 × 100 + 4 × 1/101 + 5 × 1/102 + 6 × 1/103 (this is also the reason why fractions that contain prime factors in their denominator not in common with those of the base do not have a terminating representation in that base). Moreover, the infinite series of digits of an irrational number does not exhibit a strictly repeating pattern; instead, the different digits often succeed in a seemingly random fashion. The following chart compares the first few digits of the decimal and duodecimal representation of several of the most important algebraic and transcendental irrational numbers. Some of these numbers may be perceived as having fortuitous patterns, making them easier to memorize, when represented in one base or the other.\n\nThe first few digits of the decimal and duodecimal representation of another important number, the Euler–Mascheroni constant (the status of which as a rational or irrational number is not yet known), are:",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Duodecimal" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8400" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The duodecimal system (also known as base 12 or dozenal) is a positional notation numeral system using twelve as its base. In this system, the number ten may be written by a rotated \"2\" (2) and the number eleven by a rotated \"3\" (3). This notation was introduced by Sir Isaac Pitman.Pitman, Isaac (ed.): A triple (twelve gross) Gems of Wisdom. London 1860 These digit forms are available as Unicode characters on computerized systems since June 2015 as ↊ (Code point 218A) and ↋ (Code point 218B), respectively. Other notations use \"A\", \"T\", or \"X\" for ten and \"B\" or \"E\" for eleven. The number twelve (that is, the number written as \"12\" in the base ten numerical system) is instead written as \"10\" in duodecimal (meaning \"1 dozen and 0 units\", instead of \"1 ten and 0 units\"), whereas the digit string \"12\" means \"1 dozen and 2 units\" (i.e. the same number that in decimal is written as \"14\"). Similarly, in duodecimal \"100\" means \"1 gross\", \"1000\" means \"1 great gross\", and \"0.1\" means \"1 twelfth\" (instead of their decimal meanings \"1 hundred\", \"1 thousand\", and \"1 tenth\").\n\nThe number twelve, a superior highly composite number, is the smallest number with four non-trivial factors (2, 3, 4, 6), and the smallest to include as factors all four numbers (1 to 4) within the subitizing range. As a result of this increased factorability of the radix and its divisibility by a wide range of the most elemental numbers (whereas ten has only two non-trivial factors: 2 and 5, and not 3, 4, or 6), duodecimal representations fit more easily than decimal ones into many common patterns, as evidenced by the higher regularity observable in the duodecimal multiplication table. As a result, duodecimal has been described as the optimal number system. Of its factors, 2 and 3 are prime, which means the reciprocals of all 3-smooth numbers (such as 2, 3, 4, 6, 8, 9, 12, 16, 18, 24, 27, 32, 36, ...) have a terminating representation in duodecimal. In particular, the five most elementary fractions (, , ,  and ) all have a short terminating representation in duodecimal (0.6, 0.4, 0.8, 0.3 and 0.9, respectively), and twelve is the smallest radix with this feature (because it is the least common multiple of 3 and 4). This all makes it a more convenient number system for computing fractions than most other number systems in common use, such as the decimal, vigesimal, binary, octal and hexadecimal systems. Although the trigesimal and sexagesimal systems (where the reciprocals of all 5-smooth numbers terminate) do even better in this respect, this is at the cost of unwieldy multiplication tables and a much larger number of symbols to memorize.\n\nOrigin \n\nIn this section, numerals are based on decimal places. For example, 10 means ten, 12 means twelve.\n\nLanguages using duodecimal number systems are uncommon. Languages in the Nigerian Middle Belt such as Janji, Gbiri-Niragu (Gure-Kahugu), Piti, and the Nimbia dialect of Gwandara; the Chepang language of Nepal and the Mahl language of Minicoy Island in India are known to use duodecimal numerals. \n\nGermanic languages have special words for 11 and 12, such as eleven and twelve in English.  However, they are considered to come from Proto-Germanic *ainlif and *twalif (respectively one left and two left), both of which were decimal.\n\nHistorically, units of time in many civilizations are duodecimal. There are twelve signs of the zodiac, twelve months in a year, and the Babylonians had twelve hours in a day (although at some point this was changed to 24). Traditional Chinese calendars, clocks, and compasses are based on the twelve Earthly Branches. There are 12 inches in an imperial foot, 12 troy ounces in a troy pound, 12 old British pence in a shilling, 24 (12×2) hours in a day, and many other items counted by the dozen, gross (144, square of 12) or great gross (1728, cube of 12). The Romans used a fraction system based on 12, including the uncia which became both the English words ounce and inch.  Pre-decimalisation, Ireland and the United Kingdom used a mixed duodecimal-vigesimal currency system (12 pence = 1 shilling, 20 shillings or 240 pence to the pound sterling or Irish pound), and Charlemagne established a monetary system that also had a mixed base of twelve and twenty, the remnants of which persist in many places.\n\nThe importance of 12 has been attributed to the number of lunar cycles in a year, and also to the fact that humans have 12 finger bones (phalanges) on one hand (three on each of four fingers). It is possible to count to 12 with the thumb acting as a pointer, touching each finger bone in turn. A traditional finger counting system still in use in many regions of Asia works in this way, and could help to explain the occurrence of numeral systems based on 12 and 60 besides those based on 10, 20 and 5. In this system, the one (usually right) hand counts repeatedly to 12, displaying the number of iterations on the other (usually left), until five dozens, i. e. the 60, are full.. Translated from the French by David Bellos, E.F. Harding, Sophie Wood and Ian Monk.\n\nNotations and pronunciations \n\nTransdecimal symbols\n\nIn a duodecimal place system twelve is written as 10, but there are numerous proposals for how to write ten and eleven. The simplified notations use only basic and easy to access letters such as T and E (for ten and eleven), X and Z, t and e, d and k, others use A and B or a and b as in the hexadecimal system. Some employ Greek letters such as δ (standing for Greek δέκα 'ten') and ε (for Greek ένδεκα 'eleven'), or τ and ε. Frank Emerson Andrews, an early American advocate for duodecimal, suggested and used in his book New Numbers an X (from the Roman numeral for ten) and a script E (ℰ, ).\n\nThe Dozenal Society of Great Britain proposes a rotated digit two 2 (↊, ) for ten and a reversed or rotated digit three 3 (↋, ) for eleven. This notation was introduced by Sir Isaac Pitman.\n\nUntil 2015, the Dozenal Society of America (DSA) used  and , the symbols devised by William Addison Dwiggins. After the Pitman digits (↊,  and ↋, ) were added to Unicode in 2015, the DSA took a vote and then began publishing content using the Pitman digits instead. They still use the letters X and E as the equivalent in ASCII text.\n\nOther proposals are more creative or aesthetic, for example, Edna Kramer in her 1951 book The Main Stream of Mathematics used a six-pointed asterisk (sextile) ⚹ for ten and a hash (or octothorpe) # for eleven. The symbols were chosen because they are available in typewriters and already present in telephone dials. This notation was used in publications of the Dozenal Society of America in the period 1974–2008. Many don't use any of the Hindu-Arabic symbols, under the principle of \"separate identity.\"\n\nBase notation\n\nThere are also varying proposals of how to distinguish a duodecimal number from a decimal one, or one in a different base. They include italicizing duodecimal numbers ( 54 64 ), adding a \"Humphrey  point\" (a semicolon \";\" instead of a decimal point \".\" ) to duodecimal numbers ( 54; \n 64. ) ( 54;0 64.0 ), or some combination of the two. More also add extra marking to one or more bases. Others use subscript or affixed labels to indicate the base, allowing for more than decimal and duodecimal to be represented:\n\nThis allows one to write \"54z 64d,\" \"54twelve \n 64ten\" or \"doz 54 = dec 64.\" In programming, binary, octal, and hexadecimal often use a similar scheme: a binary number starts with 0b, octal with 0o, and hexadecimal with 0x.\n\nPronunciation \n\nThe Dozenal Society of America suggests the pronunciation of ten and eleven as \"dek\" and \"el\", each order has its own name and the prefix e- is added for fractions. The symbol corresponding to the decimal point or decimal comma, separating the whole number part from the fractional part, is the semicolon \";\". The overall system is:\n\nMultiple digits in this are pronounced differently. 12 is \"one do two\", 30 is \"three do\", 100 is \"one gro\", BA9 (ET9) is \"el gro dek do nine\", B8,65A,300 (E8,65T,300) is \"el do eight bi-mo, six gro five do dek mo, three gro\", and so on.\n\nAdvocacy and \"dozenalism\"\n\nThe case for the duodecimal system was put forth at length in F. Emerson Andrews' 1935 book New Numbers: How Acceptance of a Duodecimal Base Would Simplify Mathematics. Emerson noted that, due to the prevalence of factors of twelve in many traditional units of weight and measure, many of the computational advantages claimed for the metric system could be realized either by the adoption of ten-based weights and measure or by the adoption of the duodecimal number system.\n\nThe Dozenal Society of America and the Dozenal Society of Great Britain promote widespread adoption of the base-twelve system. They use the word \"dozenal\" instead of \"duodecimal\" because the latter comes from Latin roots that express twelve in base-ten terminology.\n\nIt should be noted that the etymology of 'dozenal' is itself also an expression based on base-ten terminology since 'dozen' is a direct derivation of the French word 'douzaine' which is a derivative of the French word for twelve, douze which is related to the old French word 'doze' from Latin 'duodecim'. It has been suggested by some members of the Dozenal Society of America and Duodecimal Society of Great Britain that a more apt word would be 'uncial'. This is a derivation of the Latin word 'uncia' which means one-twelfth and is the base-twelve analogue of the Latin word 'decima' meaning one-tenth. In the same manner as decimal comes from the Latin word for one-tenth decima, (Latin for ten was decem), the direct analogue for a base-twelve system is uncial. An early use of this word can be found in Vol 1 Issue 2 of [http://www.dozenal.org/drupal/sites_bck/default/files/DuodecimalBulletinIssue012-web_0.pdf The Duodecimal Bulletin] of the DSA dated June 1945 in which a submission on page 9 by a Pvt William S. Crosby titled \"The Uncial Jottings of a Harried Infantryman\", he includes the same argument for the word 'uncial'. Although not accepted by either of these two 'Uncial' societies, the use is beginning to grow.\n\nThe renowned mathematician and mental calculator Alexander Craig Aitken was an outspoken advocate of the advantages and superiority of duodecimal over decimal:\n\nIn Jorge Luis Borges' short story Tlön, Uqbar, Orbis Tertius Herbert Ashe, a melancholy English engineer, working for the Southern Argentine Railway company, is converting a duodecimal number system to a hexadecimal system. He leaves behind on his death in 1937 a manuscript Orbis Tertius that posthumously identifies him as one of the anonymous authors of the encyclopaedia of Tlön.\n\nIn Leo Frankowski's Conrad Stargard novels, Conrad introduces a duodecimal system of arithmetic at the suggestion of a merchant, who is accustomed to buying and selling goods in dozens and grosses, rather than tens or hundreds. He then invents an entire system of weights and measures in base twelve, including a clock with twelve hours in a day, rather than twenty-four hours.\n\nIn Lee Carroll's Kryon: Alchemy of the Human Spirit, a chapter is dedicated to the advantages of the duodecimal system. The duodecimal system is supposedly suggested by Kryon (a fictional entity believed in by New Age circles) for all-round use, aiming at better and more natural representation of nature of the Universe through mathematics. An individual article \"Mathematica\" by James D. Watt (included in the above publication) exposes a few of the unusual symmetry connections between the duodecimal system and the golden ratio, as well as provides numerous number symmetry-based arguments for the universal nature of the base-12 number system.\n\nIn \"Little Twelvetoes\", American television series Schoolhouse Rock! portrayed an alien child using base-twelve arithmetic, using \"dek\", \"el\" and \"doh\" as names for ten, eleven and twelve, and Andrews' script-X and script-E for the digit symbols.[https://web.archive.org/web/20100206052053/http://www.schoolhouserock.tv/Little.html \"Little Twelvetoes\"]\n\nIn computing \n\nIn March 2013, a proposal was submitted to include the digit forms for ten and eleven propagated by the Dozenal Societies of Great Britain and America in the Unicode Standard. Of these, the British forms were accepted for encoding as characters at code points   (↊) and   (↋) They have been included in the Unicode 8.0 release in June 2015.\n\nUnicode points  and   seem to be reserved for the Dwiggins digits (stylized X and E).\n\nFew fonts support these new characters, but [http://christtrekker.users.sourceforge.net/fnt/abibas.shtml Abibas], EB Garamond, Everson Mono, Squarish Sans CT, and Symbola do.\n\nAlso, the turned digits two and three are available in LaTeX as \\textturntwo and \\textturnthree.\n\nDuodecimal clock \n\n* [http://www.dozenalsociety.org.uk/apps/dozenalclock.html Dozenal Clock by Joshua Harkey]\n* [http://dozenal.ae-web.ca/ Dozenal Clock with four hands and a digital display, in several variants, by Paul Rapoport]\n\nDuodecimal metric systems \n\nSystems of measurement proposed by dozenalists include:\n* Tom Pendlebury's TGM system\n* Takashi Suga's Universal Unit System\n\nComparison to other numeral systems \n\nThe number 12 has six factors, which are 1, 2, 3, 4, 6, and 12, of which 2 and 3 are prime.  The decimal system has only four factors, which are 1, 2, 5, and 10, of which 2 and 5 are prime. Vigesimal (base 20) adds two factors to those of ten, namely 4 and 20, but no additional prime factor. Although twenty has 6 factors, 2 of them prime, similarly to twelve, it is also a much larger base, and so the digit set and the multiplication table are much larger. Binary has only two factors, 1 and 2, the latter being prime. Hexadecimal (base 16) has five factors, adding 4, 8 and 16 to those of 2, but no additional prime. Trigesimal (base 30) is the smallest system that has three different prime factors (all of the three smallest primes: 2, 3 and 5) and it has eight factors in total (1, 2, 3, 5, 6, 10, 15, and 30). Sexagesimal—which the ancient Sumerians and Babylonians among others actually used—adds the four convenient factors 4, 12, 20, and 60 to this but no new prime factors. The smallest system that has four different prime factors is base 210 and the pattern follows the primorials. In all base systems, there are similarities to the representation of multiples of numbers which are one less than the base.\n\nConversion tables to and from decimal \n\nTo convert numbers between bases, one can use the general conversion algorithm (see the relevant section under positional notation). Alternatively, one can use digit-conversion tables. The ones provided below can be used to convert any duodecimal number between 0.01 and ƐƐƐ,ƐƐƐ.ƐƐ to decimal, or any decimal number between 0.01 and 999,999.99 to duodecimal. To use them, the given number must first be decomposed into a sum of numbers with only one significant digit each. For example:\n\n123,456.78 = 100,000 + 20,000 + 3,000 + 400 + 50 + 6 + 0.7 + 0.08\n\nThis decomposition works the same no matter what base the number is expressed in. Just isolate each non-zero digit, padding them with as many zeros as necessary to preserve their respective place values. If the digits in the given number include zeroes (for example, 102,304.05), these are, of course, left out in the digit decomposition (102,304.05 = 100,000 + 2,000 + 300 + 4 + 0.05). Then the digit conversion tables can be used to obtain the equivalent value in the target base for each digit. If the given number is in duodecimal and the target base is decimal, we get:\n\n(duodecimal) 100,000 + 20,000 + 3,000 + 400 + 50 + 6 + 0.7 + 0.08 = (decimal) 248,832 + 41,472 + 5,184 + 576 + 60 + 6 + 0.58333333333... + 0.05555555555...\n\nNow, because the summands are already converted to base ten, the usual decimal arithmetic is used to perform the addition and recompose the number, arriving at the conversion result:\n\n Duodecimal  ----->  Decimal\n \n   100,000     =    248,832\n    20,000     =     41,472\n     3,000     =      5,184\n       400     =        576\n        50     =         60\n  +      6     =   +      6\n         0.7   =          0.58333333333...\n         0.08  =          0.05555555555...\n --------------------------------------------\n   123,456.78  =    296,130.63888888888...\n\nThat is, (duodecimal) 123,456.78 equals (decimal) 296,130.63 ≈ 296,130.64\n\nIf the given number is in decimal and the target base is duodecimal, the method is basically same. Using the digit conversion tables:\n\n(decimal) 100,000 + 20,000 + 3,000 + 400 + 50 + 6 + 0.7 + 0.08 = (duodecimal) 49,ᘔ54 + Ɛ,6ᘔ8 + 1,8ᘔ0 + 294 + 42 + 6 + 0.84972497249724972497... + 0.0Ɛ62...\n\nHowever, in order to do this sum and recompose the number, now the addition tables for the duodecimal system have to be used, instead of the addition tables for decimal most people are already familiar with, because the summands are now in base twelve and so the arithmetic with them has to be in duodecimal as well. In decimal, 6 + 6 equals 12, but in duodecimal it equals 10; so, if using decimal arithmetic with duodecimal numbers one would arrive at an incorrect result. Doing the arithmetic properly in duodecimal, one gets the result:\n\n   Decimal  ----->  Duodecimal\n \n   100,000     =     49,ᘔ54\n    20,000     =      Ɛ,6ᘔ8\n     3,000     =      1,8ᘔ0\n       400     =        294\n        50     =         42\n  +      6     =   +      6\n         0.7   =          0.84972497249724972497...\n         0.08  =          0.0Ɛ62...\n --------------------------------------------------------\n   123,456.78  =     5Ɛ,540.943ᘔ...\n\nThat is, (decimal) 123,456.78 equals (duodecimal) 5Ɛ,540.9... ≈ 5Ɛ,540.94\n\nDuodecimal to decimal digit conversion \n\nDecimal to duodecimal digit conversion \n\nConversion of powers \n\nSome properties \n\n(In this section, all numbers are written with duodecimal)\n\nAll squares end with square digits (i.e. end with 0, 1, 4 or 9), if n is divisible by both 2 and 3, then n2 ends with 0, if n is not divisible by 2 or 3, then n2 ends with 1, if n is divisible by 2 but not by 3, then n2 ends with 4, if n is not divisible by 2 but by 3, then n2 ends with 9. If the unit digit of n2 is 0, then the dozens digit of n2 is either 0 or 3, if the unit digit of n2 is 1, then the dozens digit of n2 is even, if the unit digit of n2 is 4, then the dozen digit of n2 is 0, 1, 4, 5, 8 or 9, if the unit digit of n2 is 9, then the dozen digit of n2 is either 0 or 6. (More specially, all squares of (primes ≥ 5) end with 1)\n\nThe digital root of a square is 1, 3, 4, 5 or Ɛ.\n\nNo repdigits with more than one digit are squares, in fact, a square cannot end with three same digits except 000.\n\nNo four-digit palindrome numbers are squares.\n\nA cube can end with all digits except 2, 6 and ᘔ (in fact, no perfect powers end with 2, 6 or ᘔ), if n is not congruent to 2 mod 4, then n3 ends with the same digit as n; if n is congruent to 2 mod 4, then n3 ends with the digit (the last digit of n +- 6).\n\nThe digital root of a cube can be any number.\n\nIf k≥2, then nk+2 ends with the same digit as nk.\n\nExcept for 6 and 24, all even perfect numbers end with 54.\n\nThe digital root of an even perfect number is 1, 4, 6 or ᘔ.\n\nThe unit digits of powers of 2 are 1, 2, 4, 8, 4, 8, 4, 8, 4, ... (periodic with period 2)\n\nThe unit digits of powers of 3 are 1, 3, 9, 3, 9, 3, 9, 3, 9, ... (periodic with period 2)\n\nThe unit digits of powers of 5 are 1, 5, 1, 5, 1, 5, 1, 5, 1, ... (periodic with period 2)\n\nThe unit digits of powers of 7 are 1, 7, 1, 7, 1, 7, 1, 7, 1, ... (periodic with period 2)\n\nThe unit digits of powers of Ɛ are 1, Ɛ, 1, Ɛ, 1, Ɛ, 1, Ɛ, 1, ... (periodic with period 2)\n\nThe final two digits of powers of 2 are 01, 02, 04, 08, 14, 28, 54, ᘔ8, 94, 68, 14, 28, 54, ᘔ8, 94, 68, 14, ... (periodic with period 6)\n\nThe final two digits of powers of 3 are 01, 03, 09, 23, 69, 83, 09, 23, 69, 83, 09, 23, 69, ... (periodic with period 4)\n\nThe final two digits of powers of 5 are 01, 05, 21, ᘔ5, 41, 85, 61, 65, 81, 45, ᘔ1, 25, 01, 05, 21, ᘔ5, 41, ... (periodic with period 10)\n\nThe final two digits of powers of 7 are 01, 07, 41, 47, 81, 87, 01, 07, 41, 47, 81, 87, 01, ... (periodic with period 6)\n\nThe final two digits of powers of Ɛ are 01, 0Ɛ, ᘔ1, 2Ɛ, 81, 4Ɛ, 61, 6Ɛ, 41, 8Ɛ, 21, ᘔƐ, 01, 0Ɛ, ᘔ1, 2Ɛ, 81, ... (periodic with period 10)\n\nThe digital roots of powers of 2 are 1, 2, 4, 8, 5, ᘔ, 9, 7, 3, 6, 1, 2, 4, 8, 5, ᘔ, 9, 7, 3, 6, 1, ... (periodic with period ᘔ)\n\nThe digital roots of powers of 3 are 1, 3, 9, 5, 4, 1, 3, 9, 5, 4, 1, ... (periodic with period 5)\n\nThe digital roots of powers of 5 are 1, 5, 3, 4, 9, 1, 5, 3, 4, 9, 1, ... (periodic with period 5)\n\nThe digital roots of powers of 7 are 1, 7, 5, 2, 3, ᘔ, 4, 6, 9, 8, 1, 7, 5, 2, 3, ᘔ, 4, 6, 9, 8, 1, ... (periodic with period ᘔ)\n\nThe digital roots of powers of Ɛ are 1, Ɛ, Ɛ, Ɛ, Ɛ, Ɛ, ... (periodic with period 1)\n\nThe period of the unit digit of powers of a number coprime to 10 is at most 2, the final two digit is at most 20, the final three digits is 200, the final four digits is 2000, ..., the final n digits is 2×10n−1 (n≥2).\n\nThe unit digit of a Fibonacci number can be any digit except 6 (interestingly, if the unit digit of a Fibonacci number is 0, then the dozens digit of this number must also be 0, thus, all Fibonacci numbers divisible by 6 are also divisible by 100), and the unit digit of a Lucas number cannot be 0 or 9 (thus, no Lucas number is divisible by 10).\n\nThe unit digits of Fibonacci numbers are 0, 1, 1, 2, 3, 5, 8, 1, 9, ᘔ, 7, 5, 0, 5, 5, ᘔ, 3, 1, 4, 5, 9, 2, Ɛ, 1, 0, 1, 1, 2, 3, 5, ... (periodic with period 20)\n\nThe unit digits of Lucas numbers are 2, 1, 3, 4, 7, Ɛ, 6, 5, Ɛ, 4, 3, 7, ᘔ, 5, 3, 8, Ɛ, 7, 6, 1, 7, 8, 3, Ɛ, 2, 1, 3, 4, 7, Ɛ, ... (periodic with period 20)\n\nThe final two digits of Fibonacci numbers are 00, 01, 01, 02, 03, 05, 08, 11, 19, 2ᘔ, 47, 75, 00, 75, 75, 2ᘔ, ᘔ3, 11, Ɛ4, 05, Ɛ9, 02, ƐƐ, 01, 00, 01, 01, 02, 03, 05, ... (periodic with period 20)\n\nThe final two digits of Lucas numbers are 02, 01, 03, 04, 07, 0Ɛ, 16, 25, 3Ɛ, 64, ᘔ3, 47, 2ᘔ, 75, ᘔ3, 58, 3Ɛ, 97, 16, Ɛ1, 07, Ɛ8, 03, ƐƐ, 02, 01, 03, 04, 07, 0Ɛ, ... (periodic with period 20)\n\nThe digital roots of Fibonacci numbers are 0, 1, 1, 2, 3, 5, 8, 2, ᘔ, 1, Ɛ, 1, 1, 2, 3, 5, ... (periodic with period ᘔ)\n\nThe digital roots of Lucas numbers are 2, 1, 3, 4, 7, Ɛ, 7, 7, 3, ᘔ, 2, 1, 3, 4, 7, Ɛ, ... (periodic with period ᘔ)\n\nThe period of the unit digit of Fibonacci numbers is 20, the final two digits is also 20, the final three digits is 200, the final four digits is 2000, ..., the final n digits is 2×10n−1 (n≥2).\n\nAll prime numbers end with prime digits or 1 (i.e. end with 1, 2, 3, 5, 7 or Ɛ), more generally, except for 2 and 3, all prime numbers end with 1, 5, 7 or Ɛ (1 and all prime digits that do not divide 10).\n\nThe density of primes end with 1 is a relatively low, but the density of primes end with 5, 7 and Ɛ are nearly equal. (since all prime squares except 4 and 9 end with 1, no prime squares end with 5, 7 or Ɛ)\n\nExcept (3, 5), all twin primes end with (5, 7) or (Ɛ, 1).\n\nAll palindrome primes except 11 has an odd number of digits, since all even-digit palindrome numbers are divisible by 11.\n\nAll lucky numbers end with digit 1, 3, 7 or 9.\n\nExcept for 3, all Fermat primes end with 5.\n\nExcept for 3, all Mersenne primes end with 7.\n\nExcept for 2 and 3, all Sophie Germain primes end with 5 or Ɛ.\n\nExcept for 5 and 7, all safe primes end with Ɛ.\n\nA prime p is Gaussian prime if and only if p ends with 7 or Ɛ (or p=3).\n\nA prime p is Eisenstein prime if and only if p ends with 5 or Ɛ (or p=2).\n\nAll full reptend primes end with 5 or 7. (in fact, for all primes p ≥ 5, (p-1)/(the period length of 1/p) is odd if and only if p is end with 5 or 7, since 10 is a quadratic nonresidue mod p if and only if p is end with 5 or 7)\n\nIf p is a safe prime other than 5, 7 and Ɛ, then the period length of 1/p is (p-1)/2. (this is not true for all primes ends with Ɛ (other than Ɛ itself), the first counterexample is p = 2ƐƐ, where the period length of 1/p is only 37)\n\nThe only two base 10 Wieferich primes 10 are 1685 and 5Ɛ685, note that both of the numbers end with 685, and it is conjectured that all base 10 Wieferich primes end with 685.\n\nMost numbers that end with 2 are nontotient (in fact, all nontotients 2).\n\nAll orders of non-cyclic simple group end with 0.\n\nSome special numbers \n\n(In this section, all numbers are written with duodecimal, using X for ten and E for eleven)\n\nIn duodecimal, as in decimal, there are special numbers that exhibit digit patterns when, for example, multiplied by small integers:\n\n 2497 * 1 = 2497\n 2497 * 2 = 4972\n 2497 * 3 = 7249\n 2497 * 4 = 9724\n 2497 * 5 = EEEE\n\n 186X35 * 1 = 186X35\n 186X35 * 2 = 35186X\n 186X35 * 3 = 5186X3\n 186X35 * 4 = 6X3518\n 186X35 * 5 = 86X351\n 186X35 * 6 = X35186\n 186X35 * 7 = EEEEEE\n\n 8579214E36429X7 * 1 = 8579214E36429X7\n 8579214E36429X7 * 2 = 14E36429X7085792\n 8579214E36429X7 * 3 = 214E36429X708579\n 8579214E36429X7 * 4 = 29X708579214E364\n 8579214E36429X7 * 5 = 36429X708579214E\n 8579214E36429X7 * 6 = 429X708579214E36\n 8579214E36429X7 * 7 = 4E36429X70857921\n 8579214E36429X7 * 8 = 579214E36429X708\n 8579214E36429X7 * 9 = 6429X708579214E3\n 8579214E36429X7 * X = 708579214E36429X\n 8579214E36429X7 * E = 79214E36429X7085\n 8579214E36429X7 * 10 = 8579214E36429X70\n 8579214E36429X7 * 11 = 9214E36429X70857\n 8579214E36429X7 * 12 = 9X708579214E3642\n 8579214E36429X7 * 13 = X708579214E36429\n 8579214E36429X7 * 14 = E36429X708579214\n 8579214E36429X7 * 15 = EEEEEEEEEEEEEEEE\n\n 123456789XE * 1 = 123456789XE\n 123456789XE * 2 = 2468E13579X\n 123456789XE * 3 = 36X147E2589\n 123456789XE * 4 = 4915X26E378\n 123456789XE * 5 = 5E4X3928167\n 123456789XE * 6 = 718293X4E56\n 123456789XE * 7 = 83E72X61945\n 123456789XE * 8 = 962E851X734\n 123456789XE * 9 = X8641E97523\n 123456789XE * X = EX987654312\n 123456789XE * E = 111111111101\n\n 123456789E * 1 = 123456789E (miss digit X)\n 123456789E * 2 = 2468E1357X (miss digit 9)\n 123456789E * 3 = 36X147E259 (miss digit 8)\n 123456789E * 4 = 4915X26E38 (miss digit 7)\n 123456789E * 5 = 5E4X392817 (miss digit 6)\n 123456789E * 6 = 718293X4E6 (miss digit 5)\n 123456789E * 7 = 83E72X6195 (miss digit 4)\n 123456789E * 8 = 962E851X74 (miss digit 3)\n 123456789E * 9 = X8641E9753 (miss digit 2)\n 123456789E * X = EX98765432 (miss digit 1)\n 123456789E * E = 11111111111\n\n 275 * 5 = 1111\n 275 * X = 2222\n 275 * 13 = 3333\n 275 * 18 = 4444\n 275 * 21 = 5555\n 275 * 26 = 6666\n 275 * 2E = 7777\n 275 * 34 = 8888\n 275 * 39 = 9999\n 275 * 42 = XXXX\n 275 * 47 = EEEE\n\n 1X537 * 7 = 111111\n 1X537 * 12 = 222222\n 1X537 * 19 = 333333\n 1X537 * 24 = 444444\n 1X537 * 2E = 555555\n 1X537 * 36 = 666666\n 1X537 * 41 = 777777\n 1X537 * 48 = 888888\n 1X537 * 53 = 999999\n 1X537 * 5X = XXXXXX\n 1X537 * 65 = EEEEEE\n\n 123456789E * E = 11111111111\n 123456789E * 1X = 22222222222\n 123456789E * 29 = 33333333333\n 123456789E * 38 = 44444444444\n 123456789E * 47 = 55555555555\n 123456789E * 56 = 66666666666\n 123456789E * 65 = 77777777777\n 123456789E * 74 = 88888888888\n 123456789E * 83 = 99999999999\n 123456789E * 92 = XXXXXXXXXXX\n 123456789E * X1 = EEEEEEEEEEE\n\n 92X79E43715865 * 15 = 1111111111111111\n 92X79E43715865 * 2X = 2222222222222222\n 92X79E43715865 * 43 = 3333333333333333\n 92X79E43715865 * 58 = 4444444444444444\n 92X79E43715865 * 71 = 5555555555555555\n 92X79E43715865 * 86 = 6666666666666666\n 92X79E43715865 * 9E = 7777777777777777\n 92X79E43715865 * E4 = 8888888888888888\n 92X79E43715865 * 109 = 9999999999999999\n 92X79E43715865 * 122 = XXXXXXXXXXXXXXXX\n 92X79E43715865 * 137 = EEEEEEEEEEEEEEEE\n\n 8327 * 17 = 111111\n 8327 * 32 = 222222\n 8327 * 49 = 333333\n 8327 * 64 = 444444\n 8327 * 7E = 555555\n 8327 * 96 = 666666\n 8327 * E1 = 777777\n 8327 * 108 = 888888\n 8327 * 123 = 999999\n 8327 * 13X = XXXXXX\n 8327 * 155 = EEEEEE\n\n 112233445566778899XE * EE = 1111111111111111111111\n 112233445566778899XE * 1EX = 2222222222222222222222\n 112233445566778899XE * 2E9 = 3333333333333333333333\n 112233445566778899XE * 3E8 = 4444444444444444444444\n 112233445566778899XE * 4E7 = 5555555555555555555555\n 112233445566778899XE * 5E6 = 6666666666666666666666\n 112233445566778899XE * 6E5 = 7777777777777777777777\n 112233445566778899XE * 7E4 = 8888888888888888888888\n 112233445566778899XE * 8E3 = 9999999999999999999999\n 112233445566778899XE * 9E2 = XXXXXXXXXXXXXXXXXXXXXX\n 112233445566778899XE * XE1 = EEEEEEEEEEEEEEEEEEEEEE\n\n 1^2 01, 0 + 1 \n 1\n E^2 X1, X + 1 \n E\n 56^2 2630, 26 + 30 \n 56\n 66^2 3630, 36 + 30 \n 66\n EE^2 EX01, EX + 01 \n EE\n 444^2 170294, 170 + 294 \n 444\n 778^2 4X4294, 4X4 + 294 \n 778\n EEE^2 EEX001, EEX + 001 \n EEE\n 12XX^2 1661144, 166 + 1144 \n 12XX\n 1640^2 2401400, 240 + 1400 \n 1640\n 2046^2 4161830, 416 + 1830 \n 2046\n 2929^2 7802169, 780 + 2169 \n 2929\n 3333^2 X862469, X86 + 2469 \n 3333\n 4973^2 1E062X69, 1E06 + 2X69 \n 4973\n 5E60^2 2E603000, 2E60 + 3000 \n 5E60\n\n 2^2 + 5^2 = 25\n X^2 + 5^2 = X5\n 5^3 + 7^3 + 7^3 = 577\n 6^3 + 6^3 + 8^3 = 668\n X^3 + 8^3 + 3^3 = X83\n 1^5 + 4^5 + 7^5 + 6^5 + 5^5 = 14765\n 9^5 + 3^5 + 8^5 + X^5 + 4^5 = 938X4\n 3^6 + 6^6 + 9^6 + 8^6 + 6^6 + 2^6 = 369862\n X^6 + 2^6 + 3^6 + 9^6 + 4^6 + X^6 = X2394X\n\n 14 = (1 * 4)^2\n 20 = (2^2 + 0^2)!\n 21 = (2^2 + 1^2)^2\n 24 = 2^2 + 4!\n 30 = ((3 + 0)!)^2\n 43 = 4! + 3^3\n 48 = 4^3 - 8\n 84 = (8 + sqrt(4))^2\n X1 = (X + 1)^2\n X5 = (X - 5)^3\n X8 = (X - 8)^7\n XE = X + E^2\n 121 = (12 - 1)^2\n 169 = (1 * (6 + 9))^2\n 230 = (30 / 2)^2\n\n           1 * X + 1 = E\n          12 * X + 2 = EX\n         123 * X + 3 = EX9\n        1234 * X + 4 = EX98\n       12345 * X + 5 = EX987\n      123456 * X + 6 = EX9876\n     1234567 * X + 7 = EX98765\n    12345678 * X + 8 = EX987654\n   123456789 * X + 9 = EX9876543\n  123456789X * X + X = EX98765432\n 123456789XE * X + E = EX987654321\n\n           0 * E + 1 = 1\n           1 * E + 2 = 11\n          12 * E + 3 = 111\n         123 * E + 4 = 1111\n        1234 * E + 5 = 11111\n       12345 * E + 6 = 111111\n      123456 * E + 7 = 1111111\n     1234567 * E + 8 = 11111111\n    12345678 * E + 9 = 111111111\n   123456789 * E + X = 1111111111\n  123456789X * E + E = 11111111111\n 123456789XE * E + 10 = 111111111111\n\n            1^2 = 1\n           11^2 = 121\n          111^2 = 12321\n         1111^2 = 1234321\n        11111^2 = 123454321\n       111111^2 = 12345654321\n      1111111^2 = 1234567654321\n     11111111^2 = 123456787654321\n    111111111^2 = 12345678987654321\n   1111111111^2 = 123456789X987654321\n  11111111111^2 = 123456789XEX987654321\n 111111111111^2 123456789E00EX987654321 ((1_n)^2 is not palindrome number if n >\n 10)\n\n            E^2 = X1\n           EE^2 = EX01\n          EEE^2 = EEX001\n         EEEE^2 = EEEX0001\n        EEEEE^2 = EEEEX00001\n       EEEEEE^2 = EEEEEX000001\n      EEEEEEE^2 = EEEEEEX0000001\n     EEEEEEEE^2 = EEEEEEEX00000001\n    EEEEEEEEE^2 = EEEEEEEEX000000001\n   EEEEEEEEEE^2 = EEEEEEEEEX0000000001\n  EEEEEEEEEEE^2 = EEEEEEEEEEX00000000001\n EEEEEEEEEEEE^2 = EEEEEEEEEEEX000000000001\n\n 10XE * 1 = 10XE\n 10XE * 2 = 219X\n 10XE * 3 = 3289\n 10XE * 4 = 4378\n 10XE * 5 = 5467\n 10XE * 6 = 6556\n 10XE * 7 = 7645\n 10XE * 8 = 8734\n 10XE * 9 = 9823\n 10XE * X = X912\n 10XE * E = EX01\n\n 10EXE * 1 = 10EXE\n 10EXE * 2 = 21E9X\n 10EXE * 3 = 32E89\n 10EXE * 4 = 43E78\n 10EXE * 5 = 54E67\n 10EXE * 6 = 65E56\n 10EXE * 7 = 76E45\n 10EXE * 8 = 87E34\n 10EXE * 9 = 98E23\n 10EXE * X = X9E12\n 10EXE * E = EXE01\n\n 1 / E = 0.111111111111 ...\n 1 / 11 = 0.0E 0E 0E 0E 0E 0E ...\n 1 / EE = 0.01 01 01 01 01 01 ...\n 1 / 101 = 0.00EE 00EE 00EE ...\n 1 / E1 = 0.010EXE 010EXE ...\n 1 / 111 = 0.00E 00E 00E 00E ...\n 1 / X1 = 0.0123456789E 0123456789E ...\n 1 / 121 = 0.00X28466482X0 EE1937557391E ...\n\n 1 / XE1 = 0.00112233445566778899XE 00112233445566778899XE ...\n 1 / XEE1 = 0.000111222333444555666777888999XXE 000111222333444555666777888999XXE ...\n 1 / XEEE1 = 0.0000111122223333444455556666777788889999XXXE 0000111122223333444455556666777788889999XXXE ...\n\n 1 / EXEE = 0.00 01 01 02 03 05 08 11 19 2X 47 ...\n 1 / EEXEEE = 0.000 001 001 002 003 005 008 011 019 02X 047 075 100 175 275 42X 6X3 ...\n 1 / EEEXEEEE = 0.0000 0001 0001 0002 0003 0005 0008 0011 0019 002X 0047 0075 0100 0175 0275 042X 06X3 0E11 15E4 ...\n\n 1 / EXE01 = 0.0000101111212222323333434444545555656666767777878888989999X9XXXXEE 0000101111212222323333434444545555656666767777878888989999X9XXXXEE ...\n\n 1 / EX01 = 0.00 01 02 03 04 05 06 07 08 09 0X 0E 10 11 12 13 14 15 16 17 18 19 1X 1E 20 21 22 23 24 25 26 27 28 29 2X 2E 30 31 32 33 34 35 36 37 38 39 3X 3E 40 41 42 43 44 45 46 47 48 49 4X 4E 50 51 52 53 54 55 56 57 58 59 5X 5E 60 61 62 63 64 65 66 67 68 69 6X 6E 70 71 72 73 74 75 76 77 78 79 7X 7E 80 81 82 83 84 85 86 87 88 89 8X 8E 90 91 92 93 94 95 96 97 98 99 9X 9E X0 X1 X2 X3 X4 X5 X6 X7 X8 X9 XX XE E0 E1 E2 E3 E4 E5 E6 E7 E8 E9 EE 00 01 02 03 04 05 06 07 08 09 0X 0E 10 11 12 13 14 15 16 17 18 19 1X 1E 20 21 22 23 24 25 26 27 28 29 2X 2E 30 31 32 33 34 35 36 37 38 39 3X 3E 40 41 42 43 44 45 46 47 48 49 4X 4E 50 51 52 53 54 55 56 57 58 59 5X 5E 60 61 62 63 64 65 66 67 68 69 6X 6E 70 71 72 73 74 75 76 77 78 79 7X 7E 80 81 82 83 84 85 86 87 88 89 8X 8E 90 91 92 93 94 95 96 97 98 99 9X 9E X0 X1 X2 X3 X4 X5 X6 X7 X8 X9 XX XE E0 E1 E2 E3 E4 E5 E6 E7 E8 E9 EE ...\n\n 1 / EEX001 = 0.000 001 002 003 004 005 006 007 008 009 00X 00E 010 011 012 013 014 ...\n 1 / EEEX0001 = 0.0000 0001 0002 0003 0004 0005 0006 0007 0008 0009 000X 000E 0010 0011 0012 0013 0014 ...\n\n 1 / EX = 0.01 02 04 08 14 28 54 X8\n                                  194\n                                    368\n                                      714\n                                       1228\n                                         2454 ... (powers of 2)\n\n 1 / E9 = 0.01 03 09 23 69\n                         183\n                           509\n                            1323\n                              3969 ... (powers of 3)\n\n 1 / E8 = 0.01 04 14 54\n                      194\n                        714\n                         2454 ... (powers of 4)\n\n 1 / XE = 0.0112358\n                  11\n                   19\n                    2X\n                     47\n                      75\n                      100\n                       175\n                        275\n                         42X\n                          6X3\n                           E11\n                           15E4 ... (Fibonacci numbers)\n\n 1 / 9E = 0.0125\n               10\n                25\n                 5X\n                 121\n                  2X0\n                   6X1\n                   1462 ... (Pell numbers)\n\n 1 / 5E = 0.02 04 08 14 28 54 X8\n                               194\n                                 368\n                                   714\n                                    1228\n                                      2454 ... (powers of 2)\n\n 1 / 3E = 0.03 09 23 69\n                      183\n                        509\n                         1323\n                           3969 ... (powers of 3)\n\n 1 / 2E = 0.04 14 54\n                   194\n                     714\n                      2454 ... (powers of 4)\n\n                                      148421\n                                     28\n                                    54\n                                   X8\n                                 194\n                                368\n                               714\n                             1228\n 1 / 1E = (powers of 2) ... 2454\n\n                                  23931\n                                 69\n                               183\n                              509\n                            1323\n 1 / 2E = (power of 3) ... 3969\n\n                                 1441\n                                54\n                              194\n                             714\n 1 / 3E = (power of 4) ... 2454\n\n                                                11853211\n                                               19\n                                              2X\n                                             47\n                                            75\n                                          100\n                                         175\n                                        275\n                                       42X\n                                      6X3\n                                     E11\n 1 / 10E = (Fibonacci numbers) ... 15E4\n\n                                      10521\n                                     25\n                                    5X\n                                  121\n                                 2X0\n                                6X1\n 1 / 11E = (Pell numbers) ... 1462\n\n ab * 5 * 25 = abab\n ab * 7 * 17 * 111 = ababab\n ab * 5 * 25 * 75 * 175 = abababab\n abc * 7 * 11 * 17 = abcabc\n abcd * 75 * 175 = abcdabcd\n\nPrime numbers and divisibility rules\n\n(In this section, all numbers are written with duodecimal)\n\nA natural number (i.e. 1, 2, 3, 4, 5, 6, etc.) is called a prime number (or a prime) if it has exactly two positive divisors, 1 and the number itself. Natural numbers greater than 1 that are not prime are called composite.\n\nThe first 1ᘔ5 prime numbers (all the prime numbers less than 1000) are:\n\n2, 3, 5, 7, Ɛ, 11, 15, 17, 1Ɛ, 25, 27, 31, 35, 37, 3Ɛ, 45, 4Ɛ, 51, 57, 5Ɛ, 61, 67, 6Ɛ, 75, 81, 85, 87, 8Ɛ, 91, 95, ᘔ7, ᘔƐ, Ɛ5, Ɛ7, 105, 107, 111, 117, 11Ɛ, 125, 12Ɛ, 131, 13Ɛ, 141, 145, 147, 157, 167, 16Ɛ, 171, 175, 17Ɛ, 181, 18Ɛ, 195, 19Ɛ, 1ᘔ5, 1ᘔ7, 1Ɛ1, 1Ɛ5, 1Ɛ7, 205, 217, 21Ɛ, 221, 225, 237, 241, 24Ɛ, 251, 255, 25Ɛ, 267, 271, 277, 27Ɛ, 285, 291, 295, 2ᘔ1, 2ᘔƐ, 2Ɛ1, 2ƐƐ, 301, 307, 30Ɛ, 315, 321, 325, 327, 32Ɛ, 33Ɛ, 347, 34Ɛ, 357, 35Ɛ, 365, 375, 377, 391, 397, 3ᘔ5, 3ᘔƐ, 3Ɛ5, 3Ɛ7, 401, 40Ɛ, 415, 41Ɛ, 421, 427, 431, 435, 437, 447, 455, 457, 45Ɛ, 465, 46Ɛ, 471, 481, 485, 48Ɛ, 497, 4ᘔ5, 4Ɛ1, 4ƐƐ, 507, 511, 517, 51Ɛ, 527, 531, 535, 541, 545, 557, 565, 575, 577, 585, 587, 58Ɛ, 591, 59Ɛ, 5Ɛ1, 5Ɛ5, 5Ɛ7, 5ƐƐ, 611, 615, 617, 61Ɛ, 637, 63Ɛ, 647, 655, 661, 665, 66Ɛ, 675, 687, 68Ɛ, 695, 69Ɛ, 6ᘔ7, 6Ɛ1, 701, 705, 70Ɛ, 711, 71Ɛ, 721, 727, 735, 737, 745, 747, 751, 767, 76Ɛ, 771, 775, 77Ɛ, 785, 791, 797, 7ᘔ1, 7ƐƐ, 801, 80Ɛ, 817, 825, 82Ɛ, 835, 841, 851, 855, 85Ɛ, 865, 867, 871, 881, 88Ɛ, 8ᘔ5, 8ᘔ7, 8ᘔƐ, 8Ɛ5, 8Ɛ7, 901, 905, 907, 90Ɛ, 91Ɛ, 921, 927, 955, 95Ɛ, 965, 971, 987, 995, 9ᘔ7, 9ᘔƐ, 9Ɛ1, 9Ɛ5, 9ƐƐ, ᘔ07, ᘔ0Ɛ, ᘔ11, ᘔ17, ᘔ27, ᘔ35, ᘔ37, ᘔ3Ɛ, ᘔ41, ᘔ45, ᘔ4Ɛ, ᘔ5Ɛ, ᘔ6Ɛ, ᘔ77, ᘔ87, ᘔ91, ᘔ95, ᘔ9Ɛ, ᘔᘔ7, ᘔᘔƐ, ᘔƐ7, ᘔƐƐ, Ɛ11, Ɛ15, Ɛ1Ɛ, Ɛ21, Ɛ25, Ɛ2Ɛ, Ɛ31, Ɛ37, Ɛ45, Ɛ61, Ɛ67, Ɛ6Ɛ, Ɛ71, Ɛ91, Ɛ95, Ɛ97, Ɛᘔ5, ƐƐ5, ƐƐ7\n\nExcept 2 and 3, all primes end in 1, 5, 7 or Ɛ. The first k such that all of 10k, 10k + 1, 10k + 2, ..., 10k + Ɛ are all composite is 38, i.e. all of  380, 381, 382, ..., 38Ɛ are composite.\n\nThe density of primes end with 1 is a relatively low, but the density of primes end with 5, 7 and Ɛ are nearly equal. (i.e. for a given natural number N, the numbers of primes end with 1 less than N is usually smaller than the number of primes end with 5 (or 7, or Ɛ) less than N)\n\nThere are 2ᘔ primes between 1 and 100, 23 primes between 101 and 200, 1ᘔ primes between 201 and 300, 1ᘔ primes between 301 and 400, 1Ɛ primes between 401 and 500, 1ᘔ primes between 501 and 600, 16 primes between 601 and 700, 1ᘔ primes between 701 and 800, 18 primes between 801 and 900, 16 primes between 901 and ᘔ00, 1ᘔ primes between ᘔ01 and Ɛ00, 17 primes between Ɛ01 and 1000.\n\nThis section focuses on duodecimal divisibility rules.\n\n;1\nAny integer is divisible by 1.\n\n;2\nIf a number is divisible by 2 then the unit digit of that number will be 0, 2, 4, 6, 8 or ᘔ.\n\n;3\nIf a number is divisible by 3 then the unit digit of that number will be 0, 3, 6 or 9.\n\n;4\nIf a number is divisible by 4 then the unit digit of that number will be 0, 4 or 8.\n\n;5\nTo test for divisibility by 5, double the units digit and subtract the result from the number formed by the rest of the digits. If the result is divisible by 5 then the given number is divisible by 5.\n\nThis rule comes from 21(5*5)\n\nExamples: \n13        rule > |1-2*3| \n 5 which is divisible by 5.\n2Ɛᘔ5    rule > |2Ɛᘔ-2*5| \n 2Ɛ0(5*70) which is divisible by 5(or apply the rule on 2Ɛ0).\n\nOR\n\nTo test for divisibility by 5, subtract the units digit and triple of the result to the number formed by the rest of the digits. If the result is divisible by 5 then the given number is divisible by 5.\n\nThis rule comes from 13(5*3)\n\nExamples: \n13        rule > |3-3*1| \n 0 which is divisible by 5.\n2Ɛᘔ5    rule > |5-3*2Ɛᘔ| \n 8Ɛ1(5*195) which is divisible by 5(or apply the rule on 8Ɛ1).\n\nOR\n\nForm the alternating sum of blocks of two from right to left. If the result is divisible by 5 then the given number is divisible by 5.\n\nThis rule comes from 101, since 101 = 5*25, thus this rule can be also tested for the divisibility by 25.\n\nExample:\n\n97,374,627 > 27-46+37-97 \n -7Ɛ which is divisible by 5.\n\n;6\nIf a number is divisible by 6 then the unit digit of that number will be 0 or 6.\n\n;7\nTo test for divisibility by 7, triple the units digit and add the result to the number formed by the rest of the digits. If the result is divisible by 7 then the given number is divisible by 7.\n\nThis rule comes from 2Ɛ(7*5)\n\nExamples:\n12     rule > |3*2+1| \n 7 which is divisible by 7.\n271Ɛ    rule > |3*Ɛ+271| \n 29ᘔ(7*4ᘔ) which is divisible by 7(or apply the rule on 29ᘔ).\n\nOR\n\nTo test for divisibility by 7, subtract the units digit and double the result from the number formed by the rest of the digits. If the result is divisible by 7 then the given number is divisible by 7.\n\nThis rule comes from 12(7*2)\n\nExamples:\n12     rule > |2-2*1| \n 0 which is divisible by 7.\n271Ɛ    rule > |Ɛ-2*271| \n 513(7*89) which is divisible by 7(or apply the rule on 513).\n\nOR\n\nTo test for divisibility by 7, 4 times the units digit and subtract the result from the number formed by the rest of the digits. If the result is divisible by 7 then the given number is divisible by 7.\n\nThis rule comes from 41(7*7)\n\nExamples:\n12     rule > |4*2-1| \n 7 which is divisible by 7.\n271Ɛ    rule > |4*Ɛ-271| \n 235(7*3Ɛ) which is divisible by 7(or apply the rule on 235).\n\nOR\n\nForm the alternating sum of blocks of three from right to left. If the result is divisible by 7 then the given number is divisible by 7.\n\nThis rule comes from 1001, since 1001 = 7*11*17, thus this rule can be also tested for the divisibility by 11 and 17.\n\nExample:\n\n386,967,443 > 443-967+386 \n -168 which is divisible by 7.\n\n;8\nIf the 2-digit number formed by the last 2 digits of the given number is divisible by 8 then the given number is divisible by 8.\n\nExample: 1Ɛ48, 4120\n      rule => since 48(8*7) divisible by 8, then 1Ɛ48 is divisible by 8.\n      rule => since 20(8*3) divisible by 8, then 4120 is divisible by 8.\n\n;9\nIf the 2-digit number formed by the last 2 digits of the given number is divisible by 9 then the given number is divisible by 9.\n\nExample: 7423, 8330\n      rule => since 23(9*3) divisible by 9, then 7423 is divisible by 9.\n      rule => since 30(9*4) divisible by 9, then 8330 is divisible by 9.\n\n;ᘔ\nIf the number is divisible by 2 and 5 then the number is divisible by ᘔ.\n\n;Ɛ\nIf the sum of the digits of a number is divisible by Ɛ then the number is divisible by Ɛ (the equivalent of casting out nines in decimal).\n\nExample: 29, 61Ɛ13\n      rule > 2+9 \n Ɛ which is divisible by Ɛ, then 29 is divisible by Ɛ.\n      rule > 6+1+Ɛ+1+3 \n 1ᘔ which is divisible by Ɛ, then 61Ɛ13 is divisible by Ɛ.\n\n;10\nIf a number is divisible by 10 then the unit digit of that number will be 0.\n\n;11\nSum the alternate digits and subtract the sums. If the result is divisible by 11 the number is divisible by 11 (the equivalent of divisibility by eleven in decimal).\n\nExample: 66, 9427\n      rule > |6-6| \n 0 which is divisible by 11, then 66 is divisible by 11.\n      rule > |(9+2)-(4+7)| \n |ᘔ-ᘔ| = 0 which is divisible by 11, then 9427 is divisible by 11.\n\n;12\nIf the number is divisible by 2 and 7 then the number is divisible by 12.\n\n;13\nIf the number is divisible by 3 and 5 then the number is divisible by 13.\n\n;14\nIf the 2-digit number formed by the last 2 digits of the given number is divisible by 14 then the given number is divisible by 14.\n\nFractions and irrational numbers\n\nFractions\n\nDuodecimal fractions may be simple:\n*  = 0.6\n*  = 0.4\n*  = 0.3\n*  = 0.2\n*  = 0.16\n*  = 0.14\n*  = 0.1  (note that this is a twelfth,  is a tenth)\n*  = 0.09 (note that this is a sixteenth,  is a fourteenth)\n\nor complicated:\n*   = 0.249724972497... recurring (rounded to 0.24ᘔ)\n*   = 0.186ᘔ35186ᘔ35... recurring (rounded to 0.187)\n*   = 0.1249724972497... recurring (rounded to 0.125)\n*   = 0.111111111111... recurring (rounded to 0.111)\n*  = 0.0Ɛ0Ɛ0Ɛ0Ɛ0Ɛ0Ɛ... recurring (rounded to 0.0Ɛ1)\n*  = 0.0ᘔ35186ᘔ35186... recurring (rounded to 0.0ᘔ3)\n*  = 0.0972497249724... recurring (rounded to 0.097)\n\nAs explained in recurring decimals, whenever an irreducible fraction is written in radix point notation in any base, the fraction can be expressed exactly (terminates) if and only if all the prime factors of its denominator are also prime factors of the base. Thus, in base-ten ( 2×5) system, fractions whose denominators are made up solely of multiples of 2 and 5 terminate:   \n ,    and  \n  can be expressed exactly as 0.125, 0.05 and 0.002 respectively.  and , however, recur (0.333... and 0.142857142857...). In the duodecimal (= 2×2×3) system,  is exact;  and  recur because they include 5 as a factor;  is exact; and  recurs, just as it does in decimal.\n\nThe number of denominators which give terminating fractions within a given number of digits, say n, in a base b is the number of factors (divisors) of bn, the nth power of the base b (although this includes the divisor 1, which does not produce fractions when used as the denominator). The number of factors of bn is given using its prime factorization.\n\nFor decimal, 10n = 2n * 5n. The number of divisors is found by adding one to each exponent of each prime and multiplying the resulting quantities together.\nFactors of 10n (n+1)(n+1) \n (n+1)2.\n\nFor example, the number 8 is a factor of 103 (1000), so 1/8 and other fractions with a denominator of 8 can not require more than 3 fractional decimal digits to terminate. 5/8 = 0.625ten\n\nFor duodecimal, 12n 22n * 3n. This has (2n+1)(n+1) divisors. The sample denominator of 8 is a factor of a gross (122 \n 144), so eighths can not need more than two duodecimal fractional places to terminate. 5/8 = 0.76twelve\n\nBecause both ten and twelve have two unique prime factors, the number of divisors of bn for b = 10 or 12 grows quadratically with the exponent n (in other words, of the order of n2).\n\nRecurring digits \n\nThe Dozenal Society of America argues that factors of 3 are more commonly encountered in real-life division problems than factors of 5.http://www.dozenal.org/articles/DSA-DozenalFAQs.pdf Thus, in practical applications, the nuisance of repeating decimals is encountered less often when duodecimal notation is used. Advocates of duodecimal systems argue that this is particularly true of financial calculations, in which the twelve months of the year often enter into calculations.\n\nHowever, when recurring fractions do occur in duodecimal notation, they are less likely to have a very short period than in decimal notation, because 12 (twelve) is between two prime numbers, 11 (eleven) and 13 (thirteen), whereas ten is adjacent to the composite number 9. Nonetheless, having a shorter or longer period doesn't help the main inconvenience that one does not get a finite representation for such fractions in the given base (so rounding, which introduces inexactitude, is necessary to handle them in calculations), and overall one is more likely to have to deal with infinite recurring digits when fractions are expressed in decimal than in duodecimal, because one out of every three consecutive numbers contains the prime factor 3 in its factorization, whereas only one out of every five contains the prime factor 5. All other prime factors, except 2, are not shared by either ten or twelve, so they do not\ninfluence the relative likeliness of encountering recurring digits (any irreducible fraction that contains any of these other factors in its denominator will recur in either base). Also, the prime factor 2 appears twice in the factorization of twelve, whereas only once in the factorization of ten; which means that most fractions whose denominators are powers of two will have a shorter, more convenient terminating representation in duodecimal than in decimal representation (e.g. 1/(22) 0.25 ten \n 0.3 twelve; 1/(23) 0.125 ten \n 0.16 twelve; 1/(24) 0.0625 ten \n 0.09 twelve; 1/(25) 0.03125 ten \n 0.046 twelve; etc.).\n\nValues in bold indicate that value is exact.\n\nThe duodecimal period length of 1/n are\n0, 0, 0, 0, 4, 0, 6, 0, 0, 4, 1, 0, 2, 6, 4, 0, 16, 0, 6, 4, 6, 1, 11, 0, 20, 2, 0, 6, 4, 4, 30, 0, 1, 16, 12, 0, 9, 6, 2, 4, 40, 6, 42, 1, 4, 11, 23, 0, 42, 20, 16, 2, 52, 0, 4, 6, 6, 4, 29, 4, 15, 30, 6, 0, 4, 1, 66, 16, 11, 12, 35, 0, ... \n\nThe duodecimal period length of 1/(nth prime) are\n0, 0, 4, 6, 1, 2, 16, 6, 11, 4, 30, 9, 40, 42, 23, 52, 29, 15, 66, 35, 36, 26, 41, 8, 16, 100, 102, 53, 54, 112, 126, 65, 136, 138, 148, 150, 3, 162, 83, 172, 89, 90, 95, 24, 196, 66, 14, 222, 113, 114, 8, 119, 120, 125, 256, 131, 268, 54, 138, 280, ... \n\nSmallest prime with duodecimal period n are\n11, 13, 157, 5, 22621, 7, 659, 89, 37, 19141, 23, 20593, 477517, 211, 61, 17, 2693651, 1657, 29043636306420266077, 85403261, 8177824843189, 57154490053, 47, 193, 303551, 79, 306829, 673, 59, 31, 373, 153953, 886381, 2551, 71, 73, ... \n\nIrrational numbers \n\nAs for irrational numbers, none of them have a finite representation in any of the rational-based positional number systems (such as the decimal and duodecimal ones); this is because a rational-based positional number system is essentially nothing but a way of expressing quantities as a sum of fractions whose denominators are powers of the base, and by definition no finite sum of rational numbers can ever result in an irrational number. For example, 123.456 = 1 × 102 + 2 × 101 + 3 × 100 + 4 × 1/101 + 5 × 1/102 + 6 × 1/103 (this is also the reason why fractions that contain prime factors in their denominator not in common with those of the base do not have a terminating representation in that base). Moreover, the infinite series of digits of an irrational number does not exhibit a strictly repeating pattern; instead, the different digits often succeed in a seemingly random fashion. The following chart compares the first few digits of the decimal and duodecimal representation of several of the most important algebraic and transcendental irrational numbers. Some of these numbers may be perceived as having fortuitous patterns, making them easier to memorize, when represented in one base or the other.\n\nThe first few digits of the decimal and duodecimal representation of another important number, the Euler–Mascheroni constant (the status of which as a rational or irrational number is not yet known), are:. Duodecimal. http://en.wikipedia.org/?curid=8400."
  }
}
