{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11252",
  "eid" : "fab512e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778500366,
  "textBody" : "(; English: Family or Tribe of the Irish) is a liberal-conservative and Christian democratic political party in Ireland. Fine Gael is currently the governing and largest party in Ireland in terms of members of the  and Irish members of European Parliament.[http://www.angus-reid.com/polls/view/33360/double_digit_lead_for_irelandaas_fine_gael Angus Reid Global Monitor]  Retrieved 10 May 2009. The party has a membership of 35,000,Fine Gael. [http://www.finegael.ie/your-fine-gael/ Your Fine Gael] . Retrieved 23 October 2011. and is the senior partner governing in a minority coalition with several independent politicians, with party leader Leo Varadkar serving as . Varadkar succeeded Enda Kenny as party leader on 2 June 2017 and as Taoiseach on 14 June; Kenny had been leader since 2002, and Taoiseach since 2011. \n\nFine Gael was founded on 8 September 1933 following the merger of its parent party Cumann na nGaedheal, the National Centre Party and the National Guard (popularly known as the \"Blueshirts\", a name still used colloquially to refer to the party). Its origins lie in the struggle for Irish independence and the pro-Treaty side in the Irish Civil War and Michael Collins, in particular, is often identified as the founder of the movement.\n\nFine Gael is generally considered to be more of a proponent of market liberalism than its traditional rival, Fianna Fáil. However, apart from brief minority governments (as in 1987), Fine Gael has rarely governed Ireland without a coalition that also included the Labour Party, a social-democratic, centre-left party. Fine Gael describes itself as a \"party of the progressive centre\" which it defines as acting \"in a way that is right for Ireland, regardless of dogma or ideology\". It lists its core values as equality of opportunity, free enterprise and reward, security, integrity and hope. It is strongly in favour of the European Union and opposed to physical force Irish republicanism. The party's youth wing, Young Fine Gael, was formed in 1977, and has approximately four thousand members. Fine Gael is a founding member of the European People's Party and a member of the Centrist Democrat International.\n\nHistory\n\nThe following is timeline of participation in governments and positions on proposed constitutional referenda:\n* 1933: Fine Gael is formed through the merger of Cumann na nGaedheal with two smaller groups, the National Centre Party and the National Guard, commonly known as the Blueshirts.\n* 1937: It campaigns against the enactment of a new constitution proposed by Fianna Fáil advocating a no vote in the referendum, however the new constitution was approved by a majority of voters.\n* 1948–51: It forms part of Ireland’s first coalition government also including the Labour Party, Clann na Poblachta, Clann na Talmhan and the National Labour Party.\n* 1954–57: It takes part in a three-party coalition government with the Labour Party and Clann na Talmhan.\n* 1959: It opposed a proposal to amend the constitution to scrap proportional representation (PR-STV) with single member constituencies, advocating a no vote in the referendum, the amendment was rejected by voters.\n* 1968: It opposed two proposals to amend the constitution advocating no votes for both proposals, a proposal to permit greater malapportionment in favour of rural areas which was rejected by voters and another proposal to amend the constitution to scrap proportional representation (PR-STV) with single member constituencies, which was again rejected by voters, this time by a significantly larger margin than 1959.\n* 1972: It supported the campaign for a yes vote in the referendum to join the European Communities, voters approved of this proposal in the referendum.\n* 1973: It supported the campaign for a yes vote for two constitutional amendments, a proposal to reduce to minimum voting age from 21 to 18 and a proposal to remove the “special position” of the Roman Catholic Church from the constitution in order to make Ireland a secular state. Both amendments were approved by voters in referenda.\n* 1973–77: It takes part in a two-party coalition government with the Labour Party.\n* 1979: It supported the campaign for a yes vote for two constitutional amendments, one proposal to reverse a 1977 finding that certain orders made by the adoption board were unconstitutional, and a proposal to extend the voting franchise for Seanad Éireann (the upper house). Both amendments were approved by voters in referenda.\n* 1981–82(March): It takes part in a two-party minority coalition government with the Labour Party.\n* 1982(December)-87: It takes part in a two-party coalition government with the Labour Party.\n* 1983: It was divided on the referendum on the Eighth amendment, a bill originally introduced by the Fianna Fáil minority government of 1982 to introduce a constitutional ban on abortion, though the Fine Gael party leader at the time, Garret FitzGerald, personally advocated a no vote, the amendment was approved by voters in the referendum.\n* 1984: It proposed and supported the campaign for a yes vote for a constitutional amendment to extend the voting franchise to allow votes for non-citizens who are residents. This amendment was approved by voters in the referendum.\n* 1986: It proposed and supported the campaign for a yes for a constitutional amendment to make divorce constitutional. This amendment was rejected by voters in the referendum.\n* 1987: It supported the campaign for a yes vote for a constitutional amendment permitting the state to ratify the Single European Act. This amendment was approved by voters in the referendum.\n* 1992: It supported the campaign for a yes vote for a constitutional amendment permitting the state to ratify the Maastricht Treaty. This amendment was approved by voters in the referendum.\n* 1994–97: It takes part in a three-party coalition government with the Labour Party and Democratic Left.\n* 1995–97: It proposed and supported the campaign for a yes vote for three constitutional amendments between 1995 and 1997. An amendment in 1995 to make divorce constitutional. An amendment in 1996 to reverse a 1965 Supreme Court ruling by allowed a court to refuse someone bail if it suspected a person would commit a serious criminal offence while at liberty. An amendment in 1997 to reverse a 1992 Supreme Court ruling that meetings of the cabinet were absolutely confidential. All three amendments were approved by voters in their respective referenda.\n* 1998–99: It supported the campaign for a yes vote for three constitutional amendments, two amendments in 1998 to permit the state to ratify the Amsterdam Treaty and another to permit the state to ratify the Good Friday Agreement. An amendment in 1999 providing constitutional recognition to local government and that elections to local councils must held at least every five years. All three amendments were approved by voters in their respective referenda.\n* 2001–02: It supported the campaign for a yes vote for seven constitutional amendments and opposed one proposed constitutional amendment between 2001 and 2004. It supported all three amendments in 2001, an amendment to extend the pre-existing legislative ban of death penalty to a constitutional ban, an amendment to permit the state to ratify the Statute of the International Criminal Court and amendment to permit the state to ratify the Nice Treaty. All of the amendments proposed in 2001 were approved by voters except the one regarding the NIce Treaty, voters reversed this decision approving the Nice Treaty in a second referendum in 2002, also supported by Fine Gael. The other amendment proposed in 2002 was an attempt to strengthen the constitutional ban on abortion by making abortion in the X-Case unconstitutional, this was opposed by Fine Gael who advocated a no vote, and rejected by voters in the referendum.\n* 2004–09: It supported a constitutional amendment in 2004 to abolish unrestricted jus soli right to Irish nationality, this amendment was approved by voters in the referendum. It supported an amendment in 2008 to permit the state to ratify the Lisbon Treaty, this was rejected in the referendum, voters reversed this decision approving the Lisbon Treaty in a second referendum in 2009, also supported by Fine Gael.\n* 2011: It becomes the largest party in Dáil Éireann for the first time (or since 1932 including Cumann na nGaedhel) as a result of the 2011 general election.\n* 2011–15: It proposed and supported the campaign for a yes vote for eight constitutional amendments between 2011 and 2015. Two amendments in 2011, one to relax the prohibition on the reduction of the salaries of Irish judges which was approved by voters in the referendum and one to reverse a 2002 Supreme Court ruling which prevented Oireachtas inquiries from making findings critical of individuals which was not approved by voters in its respective referendum. Two amendments in 2012, one to permit the state to ratify the European Fiscal Compact and one relating to children's rights and the right and duty of the state to take child protection measures, both of these 2012 proposals were approved by voters in their respective referenda. Two amendments in 2013, one which proposed to abolish Seanad Éireann (the upper house of Ireland’s parliament) which was rejected by voters in the referendum and one which mandates of a new Court of Appeal above the High Court and below the Supreme Court, this proposal was accepted by voters in the referendum. Two amendments in 2015, one to reduce the age a person can be a presidential candidate from 35 to 21 which was rejected by voters and another amendment to explicitly constitutional prohibit restrictions on marriage based on sex, this was approved by voters in the respective referendum.\n* 2011-16: It takes part in a two-party majority coalition government with the Labour Party, effectively a grand coalition as for the period of the 31st Dáil they were the two largest parties. (see Government of the 31st Dáil)\n* 2016-: It takes parts in a minority coalition government with some non-party TDs, made possible by a confidence and supply agreement with Fianna Fáíl, which agreed to abstain in confidence votes. (see Government of the 32nd Dáil)\n* 2017: Fine Gael leadership election, 2017\n\nIdeology and policies\n\nLaw and order party\n\nAlthough Ireland's political spectrum was traditionally divided along Civil War lines, rather than the traditional European left–right spectrum, Fine Gael is described generally as a centrist to centre-right party, with a focus on \"law and order\", enterprise and reward, and \"fiscal rectitude\".[http://www.ucc.ie/yfg/OLDSITE/International.html] Fine Gael is a party of fiscal rectitude. Retrieved on 19 January 2010. As the descendant of the pro-Treaty factions in the Irish Civil War, Fine Gael has a strong affinity with Michael Collins and his legacy. He remains a symbol for the party, and the anniversary of his death is commemorated each year in August.The Hogan Stand (21 September 2005). [http://www.hoganstand.com/general/Identity/extras/heritage/stories/mcollins.htm Michael Collins' view of life in Achill Gaeltacht] . Retrieved on 31 October 2007.\n\nEconomically liberal\n\nFine Gael has, since its inception, portrayed itself as a party of fiscal rectitude and minimal government interference in economics, advocating pro-enterprise policies. In that they followed the line of the previous pro-Treaty government that believed in minimal state intervention, low taxes and social expenditures.Political Parties in the Republic of Ireland by Michael Gallagher. Manchester University Press, 1985. ISBN, 0719017971, 9780719017971. p. 43 Newly elected politicians for the party in the Dáil have strongly advocated liberal economic policies. Lucinda Creighton (who has since left the party) and Leo Varadkar in particular have been seen as strong advocates of a neoliberal approach to Ireland's economic woes and unemployment problems. Varadkar in particular has been a strong proponent of small, indigenous business, advocating that smaller firms should benefit from the government's recapitalisation program Its former finance spokesman Richard Bruton's proposals have been seen as approaching problems from a pro-enterprise point of view. Its fairer budget website in 2011 suggested that its solutions are \"tough but fair\". Other solutions conform generally to conservative governments' policies throughout Europe, focusing on cutting numbers in the public sector, while maintaining investment in infrastructure.\n\nFine Gael's proposals have sometimes been criticised mostly by smaller political groupings in Ireland, and by some of the trade unions, who have raised the idea that the party's solutions are more conscious of business interests than the interests of the worker. The SIPTU trade union has stated its opposition to the Taoiseach Enda Kenny's assertion, in response to Ireland's economic crisis, that the national wage agreement should be suspended. Kenny's comments had support however and the party attributes its significant rise in polls in 2008 to this.\nIn spite of this opposition to Fine Gael from the left of the Irish political spectrum, the party, due to Dáil arithmetic, has never entered into national government without the backing of the Labour Party.\n\nEconomic policies\n\nFine Gael's Simon Coveney launched what the party termed a radical re-organisation of the Irish Semi-State Company sector. Styled the New Economy and Recovery Authority (or NewERA), Coveney said that it is an economic stimulus plan that will \"reshape the Irish economy for the challenges of the 21st century\".FG's New Era policy commentated on by RTÉ – http://www.rte.ie/news/2009/0326/economy.html, RTÉ Website, 26 April 2010 Requiring an €18.2 billion investment in Energy, Communications and Water infrastructure over a four-year period, it was promoted as a way to enhance energy security and digital reputation of Ireland. A very broad ranging document, it proposes the combined management of a portfolio of semi-state assets, and the sale of all other, non-essential services. The release of equity through the sale of the various state resources, including electricity generation services belonging to the ESB, Bord na Móna and Bord Gáis, in combination with use of money in the National Pensions Reserve Fund, is the means by which Fine Gael is proposing to fund its national stimulus package.FG Launches 11bn Euro Stimulus Plan – http://www.rte.ie/news/2009/0326/economy2-business.html, RTÉ Website, 26 April 2010\n\nThe plan is seen at being the basis of a Fine Gael program for government. Seen as being the longer term contribution to Fine Gael's economic plan, it has been publicised in combination with a more short term policy proposal from FG TD, Dr. Leo Varadkar. This document, termed \"Hope for a Lost Generation\", promises to bring 30,000 young Irish people off the Live Register in a year by combining a National Internship Program, a Second Chance Education Scheme, an Apprenticeship Guarantee and Community Work Program, as well as instituting a German style, Workshare program.FG Hope for a Lost Generation Document – , Young Fine Gael website, 26 April 2010\n\nCommentary on the FG's economic proposals has generally been positive from some economic commentators including Eddie Hobbs and David McWilliams who have praised the proposals stating that they have considerable potential. Eamon Gilmore's Labour Party has launched policies which are seen to be broadly consistent with the FG platform.Gilmore's Economic Policies and Fine gael – , The Sunday Post, 26 April 2010\n\nConstitutional reform policies\n\nFine Gael is seen as being a constitutional party, with members and public representatives always showing considerable deference to the institutional organs of the Irish state. The party leadership has been eager to be seen to engage in an ongoing constitutional debate in Ireland on the topic of political reform. The debate which has been monitored by the Irish Times in its Renewing the Republic opinion pieces, has largely centred on the make up of the Oireachtas, the Irish parliament. Fine Gael's Phil Hogan TD, now a European Commissioner, has published the party's proposals for political and constitutional reform. In a policy document entitled New Politics, Hogan suggested creating a country with \"a smaller, more dynamic and more responsive political system,\" reducing the size of the Dáil by 20, changing the way the Dáil works, and in a controversial move, abolishing the Irish senate, Seanad Éireann.\n\nAiming to carry out the parties proposals through a series of constitutional referendums, the proposals were echoed by then Labour leader Eamon Gilmore, when he proposed his own constitutional \"crusade\" at his 2010 party conference, shortly after.Commentary of Gilmore conference speech and Labour consistency with FG policy – , 26 April 2010\n\nSocial policies\n\nFine Gael was traditionally conservative on social matters for most of the twentieth century, due to the conservative Christian ethos of Irish society during this time. Its members are variously influenced by Christian democracy, liberalism and social democracy on issues of social policy. Under Garret FitzGerald, the party's more liberal or pluralist wing gained prominence. Proposals to allow divorce were put by referendum by two Fine Gael–led governments, in 1986 under FitzGerald, and in 1995 under John Bruton, passing very narrowly on this second attempt.\n\nFine Gael supported civil unions for same-sex couples from 2003, voting for the Civil Partnership and Certain Rights and Obligations of Cohabitants Bill 2010, and the party approved a motion at its 2012 Ard Fheis to prioritise the consideration of same-sex marriage in the upcoming constitutional convention. In 2013 party leader and Taoiseach Enda Kenny announced his support for same-sex marriage. The Fine Gael led government held a referendum on the subject on 22 May 2015. The referendum passed. The electorate voted to extend full marriage rights to same sex couples, with 62.1% in favour and 37.9% opposed. The party has run advertisements in GCN (Gay Community News) advertising its commitments to same-sex couples.\n\nHealth policies\n\nThe Irish health system, being administered centrally by the Health Service Executive, is seen to be poor by comparison to other countries in Europe, ranking outside expected levels at 25th according to the Euro Health Consumer Index 2006.\nFine Gael wants Ireland to break with the system of private health insurance, public medical cards and what it calls the two tiers of the health system and has launched a campaign to see the system reformed. Speaking in favour of the campaign, Fine Gael then health spokesman James Reilly stated \"Over the last 10 years the health service has become a shambles. We regularly have over 350 people on trolleys in A&E, waiting lists that go on for months, outpatient waiting lists that go on for years and cancelled operations across the country...\"\n\nFine Gael launched its FairCare campaign and website in April 2009, which stated that the health service would be reformed away from a costly ineffective endeavour, into a publicly regulated system where compulsory universal health insurance would replace the existing provisions.\n\nThis strategy was criticised by Fianna Fáil's then Minister for Children, Barry Andrews. The spokesperson for family law and children, Alan Shatter TD, robustly defended its proposals as the only means of reducing public expenditure, and providing a service in Ireland more akin to the Canadian, Dutch and German health systems.\n\nAbortion\n\nAs a Christian democratic party, Fine Gael was historically pro-life (supportive of the child in the womb and the mother). It has however frequently disagreed with various pro-life organisations in Ireland. In 1983, having initially supported the proposal, it came out in opposition to the Eighth Amendment to the Irish Constitution that was being submitted in a referendum in 1983. Under then leader and Taoiseach Dr Garret FitzGerald it campaigned for a 'No' vote, arguing, on the advice of the Attorney General of Ireland Peter Sutherland, that the wording, which had been drafted under the previous government, when analysed was ambiguous and open to many interpretations. This referendum resulted in the Eighth Amendment to the Irish constitution, giving the unborn child a qualifiedThrough the words \"as far as practicable\". Attorney General v X, [1992] IESC 1; [1992] 1 IR 1. Also reflected in A, B, C v Ireland. equal right to life to that of the mother. Its stance conflicted with that of the Pro-Life Amendment Campaign (PLAC) and the Roman Catholic bishops, and Fianna Fáil, the largest party in the State at the time, but then in opposition.\n\nThe party also campaigned against the Twenty-fifth Amendment to the Constitution in 2002, which proposed to remove suicide as a grounds for granting a termination of a pregnancy. Suicide had been ruled as a ground, under the 8th amendment, in the X Case judgement of the Irish Supreme Court. The amendment was rejected by Irish voters.\n\nIn 2013 it proposed, and supported, the enactment of the Protection of Life During Pregnancy Act, 2013, which implemented in statute law the X case ruling of the Irish Supreme Court, granting access to a termination of a pregnancy where there is a real and substantial risk to the life, not the health, of the mother, including a threat of suicide.\n The enactment of the Act was criticised by various pro-life groups and the Roman Catholic bishops, but supported by a majority of the electorate in polls, with many indicating they wished to see a more liberal law on abortion.\n\nToday, the party is divided on repealing the Eighth Amendment. Kenny had pledged that his party's Oireachtas members will be given a free vote on the issue.Current leader Leo Varadkar is in favour of holding a referendum on repealing the Eighth Amendment, and several Fine Gael TDs, notably Kate O'Connell, are prominent supporters of the pro-choice side.\n\nPro-European\n\nFine Gael is among the most pro-European integration parties in Ireland, having supported the European Constitution,National Forum on Europe (26 October 2006). [http://www.forumoneurope.ie/eng/index.asp?docID\n1099 Enda Kenny calls for Unified EU Approach to Immigration] . Retrieved on 31 October 2007. the Lisbon Treaty, and advocating participation in European common defence.National Forum on Europe (3 April 2003). [http://www.forumoneurope.ie/index.asp?locID210&docID\n485 Should we back a pledge to defend others if they come under attack?] . Retrieved on 31 October 2007 Under Enda Kenny, the party has questioned Irish neutrality, with Kenny claiming that \"the truth is, Ireland is not neutral. We are merely unaligned.\" The party's youth wing, Young Fine Gael, passed a motion in 2016 calling on the government to apply for membership of NATO.\n\nEuropean affiliations\n\nFine Gael is a founding member of the European People's Party (EPP), the largest European political party comprising conservative and Christian democratic national-level parties from across Europe. Fine Gael's MEPs sit with the EPP Group in the European Parliament, and FG parliamentarians also sit with the EPP Groups in the Parliamentary Assembly of the Council of Europe and Committee of the Regions. Young Fine Gael is a member of the Youth of the European People's Party (YEPP).\n\nIt is inferred from Fine Gael's relationship to European counterparts via membership of the European People's Party that FG belongs on the centre-right. The party conforms generally with European political parties that identify themselves as being Christian democratic.[http://eastwesteurope08.wordpress.com/2008/01/25/fine-gaels-european-strategy/ Fine Gael’s European Strategy – EAST WEST EUROPE | Ireland and the Wider Europe, 2008]  Some younger parliamentarians are identified with the centre-right. The Irish Times supplement described front bench member Leo Varadkar TD as having explicitly centre-right views.\n\nElectoral performance\n\nAt the 2011 general election, Fine Gael gained 25 seats bringing them to a total of 76. The party ran candidates in all 43 constituencies, and had candidates elected in every constituency except Dublin North-West.\n\nFine Gael won 19 seats in Seanad Éireann following the 2011 election, a gain of four from the previous election in 2007.\n\nAt the 2009 Local elections held on 5 June 2009, Fine Gael won 556 seats, surpassing Fianna Fáil which won 407 seats, and making Fine Gael the largest party of local government nationally. They gained 88 seats from their 2004 result.\n\nAt 2009 European Parliament election held on the same day as the Local elections, which saw a reduction in the number seats from 13 to 12 for Ireland, the party won four seats, retaining the largest number of seats of an Irish party in the European Parliament. This was a loss of one seat from its 2004 result.\n\nWhile Fine Gael was responsible for the initial nomination of the uncontested, first President of Ireland, Douglas Hyde, a Fine Gael candidate has never won an election to the office of president. The most recent Fine Gael presidential candidate, Gay Mitchell, finished fourth in the 2011 presidential election, with 6.4% of the vote. In 2004, Fine Gael supported the re-election of President Mary McAleese.\n\nIn the 2016 general election the outgoing government consisting of Fine Gael and its partner the Labour Party was defeated. The previous government had the largest majority in the history of the state with a combined 113 seats out of the 166-seat Dáil Éireann. The aftermath of the general election resulted in months of negotiations for an agreement of government. A deal was reached with the main opposition and traditional rival Fianna Fáil to facilitate a minority Fine Gael-led government. Fine Gael now governs Ireland alone with eight Independent members of the Dáil.\n\nUnder Leo Varadkar's leadership, Fine Gael continue to do well in opinion polls, remaining marginally ahead of Fianna Fáil in terms of popularity.\n\nPlanning and Payment Tribunals\n\nThe Moriarty Tribunal has sat since 1997 and has investigated the granting of a mobile phone license to Esat Telecom by Michael Lowry when he was Fine Gael Minister for Transport, Energy and Communications in the Rainbow Coalition of the mid-1990s. Lowry resigned from the Cabinet after it was revealed at the Moriarty Tribunal that businessman Ben Dunne had paid for an IR£395,000 extension to Lowry's Tipperary home. Lowry, now an independent TD, supported the Fianna Fáil–Green Party government in Dáil Éireann until March 2011.\n\nIt was also revealed in December 1996 that Fine Gael had received some £180,000 from Ben Dunne in the period 1987 to 1993. This was composed of £100,000 in 1993, £50,000 in 1992 and £30,000 in 1989. In addition, Michael Noonan received £3,000 in 1992 towards his election campaign, Ivan Yates received £5,000, Michael Lowry received £5,000 and Sean Barrett received £1,000 in the earlier 1987 election. John Bruton said he had received £1,000 from Dunne in 1982 towards his election campaign, and Dunne had also given £15,000 to the Labour Party during the 1990 Presidential election campaign.\n\nFollowing revelations at the Moriarty Tribunal on 16 February 1999, in relation to Charles Haughey and his relationship with AIB, former Taoiseach Garret Fitzgerald confirmed that AIB and Ansbacher wrote off debts of almost £200,000 that he owed in 1993, when he was in financial difficulties because of the collapse of the aircraft leasing company, GPA, in which he was a shareholder. The write-off occurred after Dr Fitzgerald left politics and Dr. Fitzgerald also said he believed his then Fine Gael colleague, Peter Sutherland, who was chairman of AIB at the time, was unaware of the situation.\n\nLeadership\n\nThe current leader of the Fine Gael party is Leo Varadkar, who, as well as being Ireland's youngest ever Taoiseach, is the country's first openly gay leader and the first leader to come from an immigrant background.  The position of deputy leader has been held since 2017 by Simon Coveney TD, the Minister for Foreign Affairs and Trade.\n\nParty leader\n\nThe following are the terms of office as party leader and as Taoiseach (bolded) if applicable:\n\nDeputy leader\n\nSeanad leader\n\nGeneral election results\n\nFront bench\n\nYoung Fine Gael\n\nYoung Fine Gael (YFG) is the youth movement of Fine Gael. It was founded in 1976 by the then leader Garret FitzGerald. It caters for young people under 30 with an interest in Fine Gael and politics, in cities, towns and third level colleges throughout Ireland. YFG has 4,000 members nationwide.RTÉ News. 2007 General Election. . Retrieved on 1 July 2009 YFG is led by its national executive consisting of ten members elected on a regional basis, and on a national panel.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fine Gael" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11252" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "(; English: Family or Tribe of the Irish) is a liberal-conservative and Christian democratic political party in Ireland. Fine Gael is currently the governing and largest party in Ireland in terms of members of the  and Irish members of European Parliament.[http://www.angus-reid.com/polls/view/33360/double_digit_lead_for_irelandaas_fine_gael Angus Reid Global Monitor]  Retrieved 10 May 2009. The party has a membership of 35,000,Fine Gael. [http://www.finegael.ie/your-fine-gael/ Your Fine Gael] . Retrieved 23 October 2011. and is the senior partner governing in a minority coalition with several independent politicians, with party leader Leo Varadkar serving as . Varadkar succeeded Enda Kenny as party leader on 2 June 2017 and as Taoiseach on 14 June; Kenny had been leader since 2002, and Taoiseach since 2011. \n\nFine Gael was founded on 8 September 1933 following the merger of its parent party Cumann na nGaedheal, the National Centre Party and the National Guard (popularly known as the \"Blueshirts\", a name still used colloquially to refer to the party). Its origins lie in the struggle for Irish independence and the pro-Treaty side in the Irish Civil War and Michael Collins, in particular, is often identified as the founder of the movement.\n\nFine Gael is generally considered to be more of a proponent of market liberalism than its traditional rival, Fianna Fáil. However, apart from brief minority governments (as in 1987), Fine Gael has rarely governed Ireland without a coalition that also included the Labour Party, a social-democratic, centre-left party. Fine Gael describes itself as a \"party of the progressive centre\" which it defines as acting \"in a way that is right for Ireland, regardless of dogma or ideology\". It lists its core values as equality of opportunity, free enterprise and reward, security, integrity and hope. It is strongly in favour of the European Union and opposed to physical force Irish republicanism. The party's youth wing, Young Fine Gael, was formed in 1977, and has approximately four thousand members. Fine Gael is a founding member of the European People's Party and a member of the Centrist Democrat International.\n\nHistory\n\nThe following is timeline of participation in governments and positions on proposed constitutional referenda:\n* 1933: Fine Gael is formed through the merger of Cumann na nGaedheal with two smaller groups, the National Centre Party and the National Guard, commonly known as the Blueshirts.\n* 1937: It campaigns against the enactment of a new constitution proposed by Fianna Fáil advocating a no vote in the referendum, however the new constitution was approved by a majority of voters.\n* 1948–51: It forms part of Ireland’s first coalition government also including the Labour Party, Clann na Poblachta, Clann na Talmhan and the National Labour Party.\n* 1954–57: It takes part in a three-party coalition government with the Labour Party and Clann na Talmhan.\n* 1959: It opposed a proposal to amend the constitution to scrap proportional representation (PR-STV) with single member constituencies, advocating a no vote in the referendum, the amendment was rejected by voters.\n* 1968: It opposed two proposals to amend the constitution advocating no votes for both proposals, a proposal to permit greater malapportionment in favour of rural areas which was rejected by voters and another proposal to amend the constitution to scrap proportional representation (PR-STV) with single member constituencies, which was again rejected by voters, this time by a significantly larger margin than 1959.\n* 1972: It supported the campaign for a yes vote in the referendum to join the European Communities, voters approved of this proposal in the referendum.\n* 1973: It supported the campaign for a yes vote for two constitutional amendments, a proposal to reduce to minimum voting age from 21 to 18 and a proposal to remove the “special position” of the Roman Catholic Church from the constitution in order to make Ireland a secular state. Both amendments were approved by voters in referenda.\n* 1973–77: It takes part in a two-party coalition government with the Labour Party.\n* 1979: It supported the campaign for a yes vote for two constitutional amendments, one proposal to reverse a 1977 finding that certain orders made by the adoption board were unconstitutional, and a proposal to extend the voting franchise for Seanad Éireann (the upper house). Both amendments were approved by voters in referenda.\n* 1981–82(March): It takes part in a two-party minority coalition government with the Labour Party.\n* 1982(December)-87: It takes part in a two-party coalition government with the Labour Party.\n* 1983: It was divided on the referendum on the Eighth amendment, a bill originally introduced by the Fianna Fáil minority government of 1982 to introduce a constitutional ban on abortion, though the Fine Gael party leader at the time, Garret FitzGerald, personally advocated a no vote, the amendment was approved by voters in the referendum.\n* 1984: It proposed and supported the campaign for a yes vote for a constitutional amendment to extend the voting franchise to allow votes for non-citizens who are residents. This amendment was approved by voters in the referendum.\n* 1986: It proposed and supported the campaign for a yes for a constitutional amendment to make divorce constitutional. This amendment was rejected by voters in the referendum.\n* 1987: It supported the campaign for a yes vote for a constitutional amendment permitting the state to ratify the Single European Act. This amendment was approved by voters in the referendum.\n* 1992: It supported the campaign for a yes vote for a constitutional amendment permitting the state to ratify the Maastricht Treaty. This amendment was approved by voters in the referendum.\n* 1994–97: It takes part in a three-party coalition government with the Labour Party and Democratic Left.\n* 1995–97: It proposed and supported the campaign for a yes vote for three constitutional amendments between 1995 and 1997. An amendment in 1995 to make divorce constitutional. An amendment in 1996 to reverse a 1965 Supreme Court ruling by allowed a court to refuse someone bail if it suspected a person would commit a serious criminal offence while at liberty. An amendment in 1997 to reverse a 1992 Supreme Court ruling that meetings of the cabinet were absolutely confidential. All three amendments were approved by voters in their respective referenda.\n* 1998–99: It supported the campaign for a yes vote for three constitutional amendments, two amendments in 1998 to permit the state to ratify the Amsterdam Treaty and another to permit the state to ratify the Good Friday Agreement. An amendment in 1999 providing constitutional recognition to local government and that elections to local councils must held at least every five years. All three amendments were approved by voters in their respective referenda.\n* 2001–02: It supported the campaign for a yes vote for seven constitutional amendments and opposed one proposed constitutional amendment between 2001 and 2004. It supported all three amendments in 2001, an amendment to extend the pre-existing legislative ban of death penalty to a constitutional ban, an amendment to permit the state to ratify the Statute of the International Criminal Court and amendment to permit the state to ratify the Nice Treaty. All of the amendments proposed in 2001 were approved by voters except the one regarding the NIce Treaty, voters reversed this decision approving the Nice Treaty in a second referendum in 2002, also supported by Fine Gael. The other amendment proposed in 2002 was an attempt to strengthen the constitutional ban on abortion by making abortion in the X-Case unconstitutional, this was opposed by Fine Gael who advocated a no vote, and rejected by voters in the referendum.\n* 2004–09: It supported a constitutional amendment in 2004 to abolish unrestricted jus soli right to Irish nationality, this amendment was approved by voters in the referendum. It supported an amendment in 2008 to permit the state to ratify the Lisbon Treaty, this was rejected in the referendum, voters reversed this decision approving the Lisbon Treaty in a second referendum in 2009, also supported by Fine Gael.\n* 2011: It becomes the largest party in Dáil Éireann for the first time (or since 1932 including Cumann na nGaedhel) as a result of the 2011 general election.\n* 2011–15: It proposed and supported the campaign for a yes vote for eight constitutional amendments between 2011 and 2015. Two amendments in 2011, one to relax the prohibition on the reduction of the salaries of Irish judges which was approved by voters in the referendum and one to reverse a 2002 Supreme Court ruling which prevented Oireachtas inquiries from making findings critical of individuals which was not approved by voters in its respective referendum. Two amendments in 2012, one to permit the state to ratify the European Fiscal Compact and one relating to children's rights and the right and duty of the state to take child protection measures, both of these 2012 proposals were approved by voters in their respective referenda. Two amendments in 2013, one which proposed to abolish Seanad Éireann (the upper house of Ireland’s parliament) which was rejected by voters in the referendum and one which mandates of a new Court of Appeal above the High Court and below the Supreme Court, this proposal was accepted by voters in the referendum. Two amendments in 2015, one to reduce the age a person can be a presidential candidate from 35 to 21 which was rejected by voters and another amendment to explicitly constitutional prohibit restrictions on marriage based on sex, this was approved by voters in the respective referendum.\n* 2011-16: It takes part in a two-party majority coalition government with the Labour Party, effectively a grand coalition as for the period of the 31st Dáil they were the two largest parties. (see Government of the 31st Dáil)\n* 2016-: It takes parts in a minority coalition government with some non-party TDs, made possible by a confidence and supply agreement with Fianna Fáíl, which agreed to abstain in confidence votes. (see Government of the 32nd Dáil)\n* 2017: Fine Gael leadership election, 2017\n\nIdeology and policies\n\nLaw and order party\n\nAlthough Ireland's political spectrum was traditionally divided along Civil War lines, rather than the traditional European left–right spectrum, Fine Gael is described generally as a centrist to centre-right party, with a focus on \"law and order\", enterprise and reward, and \"fiscal rectitude\".[http://www.ucc.ie/yfg/OLDSITE/International.html] Fine Gael is a party of fiscal rectitude. Retrieved on 19 January 2010. As the descendant of the pro-Treaty factions in the Irish Civil War, Fine Gael has a strong affinity with Michael Collins and his legacy. He remains a symbol for the party, and the anniversary of his death is commemorated each year in August.The Hogan Stand (21 September 2005). [http://www.hoganstand.com/general/Identity/extras/heritage/stories/mcollins.htm Michael Collins' view of life in Achill Gaeltacht] . Retrieved on 31 October 2007.\n\nEconomically liberal\n\nFine Gael has, since its inception, portrayed itself as a party of fiscal rectitude and minimal government interference in economics, advocating pro-enterprise policies. In that they followed the line of the previous pro-Treaty government that believed in minimal state intervention, low taxes and social expenditures.Political Parties in the Republic of Ireland by Michael Gallagher. Manchester University Press, 1985. ISBN, 0719017971, 9780719017971. p. 43 Newly elected politicians for the party in the Dáil have strongly advocated liberal economic policies. Lucinda Creighton (who has since left the party) and Leo Varadkar in particular have been seen as strong advocates of a neoliberal approach to Ireland's economic woes and unemployment problems. Varadkar in particular has been a strong proponent of small, indigenous business, advocating that smaller firms should benefit from the government's recapitalisation program Its former finance spokesman Richard Bruton's proposals have been seen as approaching problems from a pro-enterprise point of view. Its fairer budget website in 2011 suggested that its solutions are \"tough but fair\". Other solutions conform generally to conservative governments' policies throughout Europe, focusing on cutting numbers in the public sector, while maintaining investment in infrastructure.\n\nFine Gael's proposals have sometimes been criticised mostly by smaller political groupings in Ireland, and by some of the trade unions, who have raised the idea that the party's solutions are more conscious of business interests than the interests of the worker. The SIPTU trade union has stated its opposition to the Taoiseach Enda Kenny's assertion, in response to Ireland's economic crisis, that the national wage agreement should be suspended. Kenny's comments had support however and the party attributes its significant rise in polls in 2008 to this.\nIn spite of this opposition to Fine Gael from the left of the Irish political spectrum, the party, due to Dáil arithmetic, has never entered into national government without the backing of the Labour Party.\n\nEconomic policies\n\nFine Gael's Simon Coveney launched what the party termed a radical re-organisation of the Irish Semi-State Company sector. Styled the New Economy and Recovery Authority (or NewERA), Coveney said that it is an economic stimulus plan that will \"reshape the Irish economy for the challenges of the 21st century\".FG's New Era policy commentated on by RTÉ – http://www.rte.ie/news/2009/0326/economy.html, RTÉ Website, 26 April 2010 Requiring an €18.2 billion investment in Energy, Communications and Water infrastructure over a four-year period, it was promoted as a way to enhance energy security and digital reputation of Ireland. A very broad ranging document, it proposes the combined management of a portfolio of semi-state assets, and the sale of all other, non-essential services. The release of equity through the sale of the various state resources, including electricity generation services belonging to the ESB, Bord na Móna and Bord Gáis, in combination with use of money in the National Pensions Reserve Fund, is the means by which Fine Gael is proposing to fund its national stimulus package.FG Launches 11bn Euro Stimulus Plan – http://www.rte.ie/news/2009/0326/economy2-business.html, RTÉ Website, 26 April 2010\n\nThe plan is seen at being the basis of a Fine Gael program for government. Seen as being the longer term contribution to Fine Gael's economic plan, it has been publicised in combination with a more short term policy proposal from FG TD, Dr. Leo Varadkar. This document, termed \"Hope for a Lost Generation\", promises to bring 30,000 young Irish people off the Live Register in a year by combining a National Internship Program, a Second Chance Education Scheme, an Apprenticeship Guarantee and Community Work Program, as well as instituting a German style, Workshare program.FG Hope for a Lost Generation Document – , Young Fine Gael website, 26 April 2010\n\nCommentary on the FG's economic proposals has generally been positive from some economic commentators including Eddie Hobbs and David McWilliams who have praised the proposals stating that they have considerable potential. Eamon Gilmore's Labour Party has launched policies which are seen to be broadly consistent with the FG platform.Gilmore's Economic Policies and Fine gael – , The Sunday Post, 26 April 2010\n\nConstitutional reform policies\n\nFine Gael is seen as being a constitutional party, with members and public representatives always showing considerable deference to the institutional organs of the Irish state. The party leadership has been eager to be seen to engage in an ongoing constitutional debate in Ireland on the topic of political reform. The debate which has been monitored by the Irish Times in its Renewing the Republic opinion pieces, has largely centred on the make up of the Oireachtas, the Irish parliament. Fine Gael's Phil Hogan TD, now a European Commissioner, has published the party's proposals for political and constitutional reform. In a policy document entitled New Politics, Hogan suggested creating a country with \"a smaller, more dynamic and more responsive political system,\" reducing the size of the Dáil by 20, changing the way the Dáil works, and in a controversial move, abolishing the Irish senate, Seanad Éireann.\n\nAiming to carry out the parties proposals through a series of constitutional referendums, the proposals were echoed by then Labour leader Eamon Gilmore, when he proposed his own constitutional \"crusade\" at his 2010 party conference, shortly after.Commentary of Gilmore conference speech and Labour consistency with FG policy – , 26 April 2010\n\nSocial policies\n\nFine Gael was traditionally conservative on social matters for most of the twentieth century, due to the conservative Christian ethos of Irish society during this time. Its members are variously influenced by Christian democracy, liberalism and social democracy on issues of social policy. Under Garret FitzGerald, the party's more liberal or pluralist wing gained prominence. Proposals to allow divorce were put by referendum by two Fine Gael–led governments, in 1986 under FitzGerald, and in 1995 under John Bruton, passing very narrowly on this second attempt.\n\nFine Gael supported civil unions for same-sex couples from 2003, voting for the Civil Partnership and Certain Rights and Obligations of Cohabitants Bill 2010, and the party approved a motion at its 2012 Ard Fheis to prioritise the consideration of same-sex marriage in the upcoming constitutional convention. In 2013 party leader and Taoiseach Enda Kenny announced his support for same-sex marriage. The Fine Gael led government held a referendum on the subject on 22 May 2015. The referendum passed. The electorate voted to extend full marriage rights to same sex couples, with 62.1% in favour and 37.9% opposed. The party has run advertisements in GCN (Gay Community News) advertising its commitments to same-sex couples.\n\nHealth policies\n\nThe Irish health system, being administered centrally by the Health Service Executive, is seen to be poor by comparison to other countries in Europe, ranking outside expected levels at 25th according to the Euro Health Consumer Index 2006.\nFine Gael wants Ireland to break with the system of private health insurance, public medical cards and what it calls the two tiers of the health system and has launched a campaign to see the system reformed. Speaking in favour of the campaign, Fine Gael then health spokesman James Reilly stated \"Over the last 10 years the health service has become a shambles. We regularly have over 350 people on trolleys in A&E, waiting lists that go on for months, outpatient waiting lists that go on for years and cancelled operations across the country...\"\n\nFine Gael launched its FairCare campaign and website in April 2009, which stated that the health service would be reformed away from a costly ineffective endeavour, into a publicly regulated system where compulsory universal health insurance would replace the existing provisions.\n\nThis strategy was criticised by Fianna Fáil's then Minister for Children, Barry Andrews. The spokesperson for family law and children, Alan Shatter TD, robustly defended its proposals as the only means of reducing public expenditure, and providing a service in Ireland more akin to the Canadian, Dutch and German health systems.\n\nAbortion\n\nAs a Christian democratic party, Fine Gael was historically pro-life (supportive of the child in the womb and the mother). It has however frequently disagreed with various pro-life organisations in Ireland. In 1983, having initially supported the proposal, it came out in opposition to the Eighth Amendment to the Irish Constitution that was being submitted in a referendum in 1983. Under then leader and Taoiseach Dr Garret FitzGerald it campaigned for a 'No' vote, arguing, on the advice of the Attorney General of Ireland Peter Sutherland, that the wording, which had been drafted under the previous government, when analysed was ambiguous and open to many interpretations. This referendum resulted in the Eighth Amendment to the Irish constitution, giving the unborn child a qualifiedThrough the words \"as far as practicable\". Attorney General v X, [1992] IESC 1; [1992] 1 IR 1. Also reflected in A, B, C v Ireland. equal right to life to that of the mother. Its stance conflicted with that of the Pro-Life Amendment Campaign (PLAC) and the Roman Catholic bishops, and Fianna Fáil, the largest party in the State at the time, but then in opposition.\n\nThe party also campaigned against the Twenty-fifth Amendment to the Constitution in 2002, which proposed to remove suicide as a grounds for granting a termination of a pregnancy. Suicide had been ruled as a ground, under the 8th amendment, in the X Case judgement of the Irish Supreme Court. The amendment was rejected by Irish voters.\n\nIn 2013 it proposed, and supported, the enactment of the Protection of Life During Pregnancy Act, 2013, which implemented in statute law the X case ruling of the Irish Supreme Court, granting access to a termination of a pregnancy where there is a real and substantial risk to the life, not the health, of the mother, including a threat of suicide.\n The enactment of the Act was criticised by various pro-life groups and the Roman Catholic bishops, but supported by a majority of the electorate in polls, with many indicating they wished to see a more liberal law on abortion.\n\nToday, the party is divided on repealing the Eighth Amendment. Kenny had pledged that his party's Oireachtas members will be given a free vote on the issue.Current leader Leo Varadkar is in favour of holding a referendum on repealing the Eighth Amendment, and several Fine Gael TDs, notably Kate O'Connell, are prominent supporters of the pro-choice side.\n\nPro-European\n\nFine Gael is among the most pro-European integration parties in Ireland, having supported the European Constitution,National Forum on Europe (26 October 2006). [http://www.forumoneurope.ie/eng/index.asp?docID\n1099 Enda Kenny calls for Unified EU Approach to Immigration] . Retrieved on 31 October 2007. the Lisbon Treaty, and advocating participation in European common defence.National Forum on Europe (3 April 2003). [http://www.forumoneurope.ie/index.asp?locID210&docID\n485 Should we back a pledge to defend others if they come under attack?] . Retrieved on 31 October 2007 Under Enda Kenny, the party has questioned Irish neutrality, with Kenny claiming that \"the truth is, Ireland is not neutral. We are merely unaligned.\" The party's youth wing, Young Fine Gael, passed a motion in 2016 calling on the government to apply for membership of NATO.\n\nEuropean affiliations\n\nFine Gael is a founding member of the European People's Party (EPP), the largest European political party comprising conservative and Christian democratic national-level parties from across Europe. Fine Gael's MEPs sit with the EPP Group in the European Parliament, and FG parliamentarians also sit with the EPP Groups in the Parliamentary Assembly of the Council of Europe and Committee of the Regions. Young Fine Gael is a member of the Youth of the European People's Party (YEPP).\n\nIt is inferred from Fine Gael's relationship to European counterparts via membership of the European People's Party that FG belongs on the centre-right. The party conforms generally with European political parties that identify themselves as being Christian democratic.[http://eastwesteurope08.wordpress.com/2008/01/25/fine-gaels-european-strategy/ Fine Gael’s European Strategy – EAST WEST EUROPE | Ireland and the Wider Europe, 2008]  Some younger parliamentarians are identified with the centre-right. The Irish Times supplement described front bench member Leo Varadkar TD as having explicitly centre-right views.\n\nElectoral performance\n\nAt the 2011 general election, Fine Gael gained 25 seats bringing them to a total of 76. The party ran candidates in all 43 constituencies, and had candidates elected in every constituency except Dublin North-West.\n\nFine Gael won 19 seats in Seanad Éireann following the 2011 election, a gain of four from the previous election in 2007.\n\nAt the 2009 Local elections held on 5 June 2009, Fine Gael won 556 seats, surpassing Fianna Fáil which won 407 seats, and making Fine Gael the largest party of local government nationally. They gained 88 seats from their 2004 result.\n\nAt 2009 European Parliament election held on the same day as the Local elections, which saw a reduction in the number seats from 13 to 12 for Ireland, the party won four seats, retaining the largest number of seats of an Irish party in the European Parliament. This was a loss of one seat from its 2004 result.\n\nWhile Fine Gael was responsible for the initial nomination of the uncontested, first President of Ireland, Douglas Hyde, a Fine Gael candidate has never won an election to the office of president. The most recent Fine Gael presidential candidate, Gay Mitchell, finished fourth in the 2011 presidential election, with 6.4% of the vote. In 2004, Fine Gael supported the re-election of President Mary McAleese.\n\nIn the 2016 general election the outgoing government consisting of Fine Gael and its partner the Labour Party was defeated. The previous government had the largest majority in the history of the state with a combined 113 seats out of the 166-seat Dáil Éireann. The aftermath of the general election resulted in months of negotiations for an agreement of government. A deal was reached with the main opposition and traditional rival Fianna Fáil to facilitate a minority Fine Gael-led government. Fine Gael now governs Ireland alone with eight Independent members of the Dáil.\n\nUnder Leo Varadkar's leadership, Fine Gael continue to do well in opinion polls, remaining marginally ahead of Fianna Fáil in terms of popularity.\n\nPlanning and Payment Tribunals\n\nThe Moriarty Tribunal has sat since 1997 and has investigated the granting of a mobile phone license to Esat Telecom by Michael Lowry when he was Fine Gael Minister for Transport, Energy and Communications in the Rainbow Coalition of the mid-1990s. Lowry resigned from the Cabinet after it was revealed at the Moriarty Tribunal that businessman Ben Dunne had paid for an IR£395,000 extension to Lowry's Tipperary home. Lowry, now an independent TD, supported the Fianna Fáil–Green Party government in Dáil Éireann until March 2011.\n\nIt was also revealed in December 1996 that Fine Gael had received some £180,000 from Ben Dunne in the period 1987 to 1993. This was composed of £100,000 in 1993, £50,000 in 1992 and £30,000 in 1989. In addition, Michael Noonan received £3,000 in 1992 towards his election campaign, Ivan Yates received £5,000, Michael Lowry received £5,000 and Sean Barrett received £1,000 in the earlier 1987 election. John Bruton said he had received £1,000 from Dunne in 1982 towards his election campaign, and Dunne had also given £15,000 to the Labour Party during the 1990 Presidential election campaign.\n\nFollowing revelations at the Moriarty Tribunal on 16 February 1999, in relation to Charles Haughey and his relationship with AIB, former Taoiseach Garret Fitzgerald confirmed that AIB and Ansbacher wrote off debts of almost £200,000 that he owed in 1993, when he was in financial difficulties because of the collapse of the aircraft leasing company, GPA, in which he was a shareholder. The write-off occurred after Dr Fitzgerald left politics and Dr. Fitzgerald also said he believed his then Fine Gael colleague, Peter Sutherland, who was chairman of AIB at the time, was unaware of the situation.\n\nLeadership\n\nThe current leader of the Fine Gael party is Leo Varadkar, who, as well as being Ireland's youngest ever Taoiseach, is the country's first openly gay leader and the first leader to come from an immigrant background.  The position of deputy leader has been held since 2017 by Simon Coveney TD, the Minister for Foreign Affairs and Trade.\n\nParty leader\n\nThe following are the terms of office as party leader and as Taoiseach (bolded) if applicable:\n\nDeputy leader\n\nSeanad leader\n\nGeneral election results\n\nFront bench\n\nYoung Fine Gael\n\nYoung Fine Gael (YFG) is the youth movement of Fine Gael. It was founded in 1976 by the then leader Garret FitzGerald. It caters for young people under 30 with an interest in Fine Gael and politics, in cities, towns and third level colleges throughout Ireland. YFG has 4,000 members nationwide.RTÉ News. 2007 General Election. . Retrieved on 1 July 2009 YFG is led by its national executive consisting of ten members elected on a regional basis, and on a national panel. Fine Gael. http://en.wikipedia.org/?curid=11252."
  }
}
