{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19633",
  "eid" : "3c8cb1f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778610831,
  "textBody" : "Events\n\n*473 – Gundobad (nephew of Ricimer) nominates Glycerius as emperor of the Western Roman Empire.\n*724 – Empress Genshō abdicates the throne in favor of her nephew Shōmu who becomes emperor of Japan.\n*1284 – The Statute of Rhuddlan incorporates the Principality of Wales into England.\n*1575 – Indian Mughal Emperor Akbar defeats Bengali army at the Battle of Tukaroi.\n*1585 – The Olympic Theatre, designed by Andrea Palladio, is inaugurated in Vicenza.\n*1776 – American Revolutionary War: The first amphibious landing of the United States Marine Corps begins the Battle of Nassau.\n*1779 – American Revolutionary War: The Continental Army is routed at the Battle of Brier Creek near Savannah, Georgia.\n*1799 – The Russo-Ottoman siege of Corfu ends with the surrender of the French garrison.\n*1820 – The U.S. Congress passes the Missouri Compromise.\n*1845 – Florida is admitted as the 27th U.S. state.\n*1849 – The Territory of Minnesota was created. \n*1857 – Second Opium War: France and the United Kingdom declare war on China.\n*1859 – The two-day Great Slave Auction, the largest such auction in United States history, concludes.\n*1861 – Alexander II of Russia signs the Emancipation Manifesto, freeing serfs.\n*1865 – Opening of The Hongkong and Shanghai Banking Corporation, the founding member of the HSBC Group.\n*1873 – Censorship in the United States: The U.S. Congress enacts the Comstock Law, making it illegal to send any \"obscene, lewd, or lascivious\" books through the mail.\n*1875 – Georges Bizet's opera Carmen receives its première at the Opéra-Comique in Paris.\n*  1875   – The first ever organized indoor game of ice hockey is played in Montreal, Quebec, Canada as recorded in the Montreal Gazette.\n*1878 – The Russo-Turkish War ends with Bulgaria regaining its independence from the Ottoman Empire according to the Treaty of San Stefano; a few months afterwards the Congress of Berlin stripped its status to a vassal principality of the Ottoman Empire.\n*1885 – The American Telephone & Telegraph Company is incorporated in New York.\n*1904 – Kaiser Wilhelm II of Germany becomes the first person to make a sound recording of a political document, using Thomas Edison's phonograph cylinder.\n*1910 – Rockefeller Foundation: John D. Rockefeller Jr. announces his retirement from managing his businesses so that he can devote all his time to philanthropy.\n*1913 – Thousands of women march in a suffrage parade in Washington, D.C.\n*1918 – Russia signs the Treaty of Brest-Litovsk, agreeing to withdraw from World War I, and conceding German control of the Baltic States, Belarus and Ukraine. It also conceded Turkish control of Ardahan, Kars and Batumi.\n*1923 – TIME magazine is published for the first time.\n*1924 – The fourteenth-century Islamic caliphate is abolished when Caliph Abdülmecid II of the Ottoman Empire is deposed. The last remnant of the old regime gives way to the reformed Turkey of Kemal Atatürk.\n*  1924   – The Free State of Fiume is annexed by the Kingdom of Italy.\n*1931 – The United States adopts The Star-Spangled Banner as its national anthem.\n*1938 – Oil is discovered in Saudi Arabia.\n*1939 – In Bombay, Mohandas Gandhi begins a hunger strike in protest at the autocratic rule in British India.\n*1940 – Five people are killed in an arson attack on the offices of the communist newspaper Flamman in Luleå, Sweden.\n*1942 – World War II: Ten Japanese warplanes raid Broome, Western Australia, killing more than 100 people.\n*1943 – World War II: In London, 173 people are killed in a crush while trying to enter an air-raid shelter at Bethnal Green tube station.\n*1944 – The Order of Nakhimov and Order of Ushakov are instituted in USSR as the highest naval awards.\n*1945 – World War II: American and Filipino troops recapture Manila.\n*  1945   – World War II: The RAF accidentally bombs the Bezuidenhout area of The Hague, Netherlands, killing 511 people.\n*1951 – Jackie Brenston, with Ike Turner and his band, records \"Rocket 88\", often cited as \"the first rock and roll record\", at Sam Phillips's recording studios in Memphis, Tennessee.\n*1953 – A De Havilland Comet (Canadian Pacific Air Lines) crashes in Karachi, Pakistan, killing 11.\n*1958 – Nuri al-Said becomes Prime Minister of Iraq for the eighth time.\n*1969 – Apollo program: NASA launches Apollo 9 to test the lunar module.\n*1972 – Mohawk Airlines Flight 405 crashes as a result of a control malfunction and insufficient training in emergency procedures.\n*1974 – Turkish Airlines Flight 981 crashes at Ermenonville near Paris, France killing all 346 aboard.\n*1980 – The  is decommissioned and stricken from the Naval Vessel Register.\n*1985 – Arthur Scargill declares that the National Union of Mineworkers' national executive voted to end the longest-running industrial dispute in Great Britain without any peace deal over pit closures.\n*  1985   – A magnitude 8.3 earthquake strikes the Valparaíso Region of Chile, killing 177 and leaving nearly a million people homeless.\n*1986 – The Australia Act 1986 commences, causing Australia to become fully independent from the United Kingdom.\n*1991 – An amateur video captures the beating of Rodney King by Los Angeles police officers.\n*1997 – The tallest free-standing structure in the Southern Hemisphere, Sky Tower in downtown Auckland, New Zealand, opens after two-and-a-half years of construction.\n*2005 – James Roszko murders four Royal Canadian Mounted Police constables during a drug bust at his property in Rochfort Bridge, Alberta, then commits suicide. This is the deadliest peace-time incident for the RCMP since 1885 and the North-West Rebellion.\n*  2005   – Steve Fossett becomes the first person to fly an airplane non-stop around the world solo without refueling.\n*  2005   – Margaret Wilson is elected as Speaker of the New Zealand House of Representatives, beginning a period lasting until August 23, 2006 where all the highest political offices (including Elizabeth II as Head of State), were occupied by women, making New Zealand the first country for this to occur.\n*2013 – A bomb blast in Karachi, Pakistan, kills at least 45 people and injured 180 others in a predominately Shia Muslim area.\n*2017 – Nintendo releases the hybrid Nintendo Switch video game console worldwide to critical acclaim, later becoming the fastest selling console in the United States.\n\nBirths\n\n*1455 – John II of Portugal (d. 1495)\n*  1455   – Ascanio Sforza, Catholic cardinal (d. 1505)\n*1506 – Luís of Portugal, Duke of Beja (d. 1555)\n*1520 – Matthias Flacius, Croatian theologian and reformer (d. 1575)\n*1583 – Edward Herbert, 1st Baron Herbert of Cherbury, English-Welsh soldier, historian, and diplomat (d. 1648)\n*1589 – Gisbertus Voetius, Dutch minister, theologian, and academic (d. 1676)\n*1606 – Edmund Waller, English poet and politician (d. 1687)\n*1652 – Thomas Otway, English playwright and author (d. 1685)\n*1678 – Madeleine de Verchères, Canadian rebel leader (d. 1747)\n*1756 – William Godwin, English journalist and author (d. 1836)\n*1778 – Frederica of Mecklenburg-Strelitz (d. 1841)\n*1793 – William Macready, English actor and manager (d. 1873)\n*1800 – Heinrich Georg Bronn, German geologist and paleontologist (d. 1862)\n*1803 – Thomas Field Gibson, English manufacturer who aided the welfare of the Spitalfields silk weavers (d. 1889)\n*1805 – Jonas Furrer, Swiss politician (d. 1861)\n*1816 – William James Blacklock, English-Scottish painter (d. 1858)\n*1819 – Gustave de Molinari, Dutch-Belgian economist and theorist (d. 1912)\n*1825 – Shiranui Kōemon, Japanese sumo wrestler (d. 1879)\n*1831 – George Pullman, American engineer and businessman, founded the Pullman Company (d. 1897)\n*1839 – Jamsetji Tata, Indian businessman, founded Tata Group (d. 1904)\n*1841 – John Murray, Canadian-Scottish oceanographer and biologist (d. 1914)\n*1845 – Georg Cantor, Russian-German mathematician and philosopher (d. 1918)\n*1847 – Alexander Graham Bell, Scottish-American engineer and academic, invented the telephone (d. 1922)\n*1860 – John Montgomery Ward, American baseball player and manager (d. 1925)\n*1866 – Fred A. Busse, American lawyer and politician, 39th Mayor of Chicago (d. 1914)\n*1868 – Émile Chartier, French philosopher and journalist (d. 1951)\n*1869 – Henry Wood, English conductor (d. 1944)\n*1871 – Maurice Garin, Italian-French cyclist (d. 1957)\n*1873 – William Green, American union leader and politician (d. 1952)\n*1880 – Florence Auer, American actress and screenwriter (d. 1962)\n*  1880   – Yōsuke Matsuoka, Japanese politician, Japanese Minister of Foreign Affairs (d. 1946)\n*1882 – Charles Ponzi, Italian businessman (d. 1949)\n*1883 – Cyril Burt, English psychologist and geneticist (d. 1971)\n*  1883   – Paul Marais de Beauchamp, French zoologist (d. 1977)\n*1887 – Lincoln J. Beachey, American pilot (d. 1915)\n*1891 – Damaskinos of Athens, Greek archbishop (d. 1949)\n*1893 – Beatrice Wood, American illustrator and potter (d. 1998)\n*1895 – Ragnar Frisch, Norwegian economist and academic, Nobel Prize laureate (d. 1973)\n*  1895   – Matthew Ridgway, American general (d. 1993)\n*1898 – Emil Artin, Austrian-German mathematician and academic (d. 1962)\n*1900 – Edna Best, British stage and film actress, appeared on early television in 1938 (d. 1974) \n*  1900 – Ruby Dandridge, African-American film and radio actress (d. 1987) \n*1901 – Claude Choules, English-Australian soldier (d. 2011)\n*1903 – Vasily Kozlov, Belarusian general and politician (d. 1967)\n*1906 – Artur Lundkvist, Swedish poet and critic (d. 1991)\n*1911 – Jean Harlow, American actress (d. 1937)\n*  1911   – Hugues Lapointe, Canadian lawyer and politician, 22nd Lieutenant Governor of Quebec (d. 1982)\n*1913 – Margaret Bonds, American pianist and composer (d. 1972)\n*  1913   – Harold J. Stone, American actor (d. 2005)\n*1914 – Asger Jorn, Danish painter and sculptor (d. 1973)\n*1916 – Paul Halmos, Hungarian-American mathematician (d. 2006)\n*1917 – Sameera Moussa, Egyptian physicist and academic (d. 1952)\n*1918 – Arthur Kornberg, American biochemist and academic, Nobel Prize laureate (d. 2007)\n*1920 – Julius Boros, American golfer and accountant (d. 1994)\n*  1920   – James Doohan, Canadian-American actor and soldier (d. 2005)\n*  1920   – Ronald Searle, English-French soldier and illustrator (d. 2011)\n*1921 – Diana Barrymore, American actress (d. 1960)\n*1922 – Nándor Hidegkuti, Hungarian footballer and manager (d. 2002)\n*1923 – Barney Martin, American police officer and actor (d. 2005)\n*  1923   – Doc Watson, American bluegrass singer-songwriter and musician (d. 2012)\n*1924 – Tomiichi Murayama, Japanese soldier and politician, 52nd Prime Minister of Japan\n*1926 – James Merrill, American poet and playwright (d. 1995)\n*1927 – Pierre Aubert, Swiss lawyer and politician (d. 2016)\n*1930 – Ion Iliescu, Romanian engineer and politician, 2nd President of Romania\n*1934 – Peter Brooke, Baron Brooke of Sutton Mandeville, English politician, Secretary of State for Northern Ireland\n*  1934   – Jimmy Garrison, American bassist and educator (d. 1976)\n*1935 – Mal Anderson, Australian tennis player\n*  1935   – Michael Walzer, American philosopher and academic\n*  1935   – Zhelyu Zhelev, Bulgarian philosopher and politician, 2nd President of Bulgaria (d. 2015)\n*1939 – Larry Burkett, American author and radio host (d. 2003)\n*  1939   – M. L. Jaisimha, Indian cricketer (d. 1999)\n*1940 – Germán Castro Caycedo, Colombian author and journalist\n*  1940   – Perry Ellis, American fashion designer, founded Perry Ellis (d. 1986)\n*  1940   – Jean-Paul Proust, French-Monacan police officer and politician, 21st Minister of State of Monaco (d. 2010)\n*  1940   – Owen Spencer-Thomas, English minister and journalist\n*1941 – Mike Pender, English singer-songwriter and guitarist \n*1945 – George Miller, Australian director, producer, and screenwriter\n*  1945   – Hattie Winston, American actress\n*1946 – John Virgo, English snooker player and sportscaster\n*1947 – Clifton Snider, American author, poet, and critic\n*  1947   – Jennifer Warnes, American singer-songwriter and producer\n*1949 – Ron Chernow, American historian, journalist, and author\n*  1949   – Bonnie J. Dunbar, American engineer, academic, and astronaut\n*  1949   – Jesse Jefferson, American baseball player (d. 2011)\n*1951 – Andy Murray, Canadian ice hockey player and coach\n*  1951   – Heizō Takenaka, Japanese economist and politician\n*1952 – Rudy Fernandez, Filipino actor and producer (d. 2008)\n*1953 – Robyn Hitchcock, English singer-songwriter and guitarist\n*  1953   – Zico, Brazilian footballer and coach\n*1954 – Keith Fergus, American golfer\n*  1954   – John Lilley, American singer-songwriter and guitarist \n*  1954   – Édouard Lock, Moroccan-Canadian dancer and choreographer\n*1955 – Darnell Williams, English-American actor and director\n*1956 – Zbigniew Boniek, Polish footballer and manager\n*  1956   – John Fulton Reid, New Zealand cricketer\n*1957 – Stephen Budiansky, American historian, journalist, and author\n*  1957   – Thom Hoffman, Dutch actor and photographer\n*1958 – Miranda Richardson, English actress \n*1959 – Ira Glass, American radio host and producer\n*  1959   – Duško Vujošević, Montenegrin basketball player and coach\n*1960 – Neal Heaton, American baseball player and coach\n*1961 – Mary Page Keller, American actress and producer\n*  1961   – John Matteson, American biographer\n*  1961   – Perry McCarthy, English race car driver\n*  1961   – Fatima Whitbread, English javelin thrower\n*1962 – Glen E. Friedman, American photographer\n*  1962   – Jackie Joyner-Kersee, American heptathlete and long jumper\n*  1962   – Herschel Walker, American football player and mixed martial artist\n*1963 – Martín Fiz, Spanish runner\n*  1963   – Khaltmaagiin Battulga, 5th President of Mongolia\n*1964 – Raúl Alcalá, Mexican cyclist\n*  1964   – Laura Harring, Mexican-American model and actress, Miss USA 1985\n*  1964   – Glenn Kulka, Canadian ice hockey player and wrestler\n*1965 – Dragan Stojković, Serbian footballer and manager\n*1966 – Tone Lōc, American rapper, producer, and actor\n*  1966   – Timo Tolkki, Finnish guitarist, songwriter, and producer\n*1968 – Brian Cox, English keyboard player and physicist \n*  1968   – Brian Leetch, American ice hockey player\n*1970 – Julie Bowen, American actress\n*  1970   – Inzamam-ul-Haq, Pakistani cricketer and coach\n*1971 – Charlie Brooker, English journalist, producer, and author\n*  1971   – Tyler Florence, American chef and author\n*1972 – Darren Anderton, English footballer and sportscaster\n*1973 – Xavier Bettel, Luxembourger lawyer and politician, Prime Minister of Luxembourg\n*  1973   – Matthew Marsden, English actor and martial artist\n*1974 – David Faustino, American actor, producer, and screenwriter\n*1976 – Fraser Gehrig, Australian footballer\n*  1976   – Isabel Granada, Filipino-Spanish actress (d. 2017)\n*  1976   – Keit Pentus-Rosimannus, Estonian politician, 28th Estonian Minister of Foreign Affairs\n*1977 – Ronan Keating, Irish singer-songwriter and actor \n*  1977   – Stéphane Robidas, Canadian ice hockey player\n*  1977   – Buddy Valastro, American chef and television host\n*1978 – Matt Diaz, American baseball player\n*1979 – Albert Jorquera, Spanish footballer\n*1980 – Mason Unck, American football player\n*1981 – David Bailey, American basketball player\n*  1981   – Julius Malema, South African politician\n*  1981   – Emmanuel Pappoe, Ghanaian footballer\n*1982 – Jessica Biel, American actress, singer, and producer\n*  1982   – Colton Orr, Canadian ice hockey player\n*1982 –Tolu Ogunlesi, Nigerian journalist, writer\n*  1982   – Brent Tate, Australian rugby league player\n*1983 – Ashley Hansen, Australian footballer\n*  1983   – Sarah Poewe, South African swimmer\n*1984 – Valerio Bernabò, Italian rugby player\n*  1984   – Santonio Holmes, American football player\n*  1984   – Alexander Semin, Russian ice hockey player\n*1985 – Sam Morrow, Northern Irish footballer\n*1986 – Jed Collins, American football player\n*  1986   – Stacie Orrico, American singer-songwriter\n*  1986   – Mehmet Topal, Turkish footballer\n*1987 – Jesús Padilla, Mexican footballer\n*1987 – Shraddha Kapoor, Indian Actress, Singer, Designer \n*1988 – Teodora Mirčić, Serbian tennis player\n*  1988   – Michael Morrison, English footballer\n*  1988   – Jan-Arie van der Heijden, Dutch footballer\n*  1988   – Max Waller, English cricketer\n*1989 – Erwin Mulder, Dutch footballer\n*1990 – Vladimir Janković, Greek-Serbian basketball player\n*1991 – Anri Sakaguchi, Japanese actress\n*  1991   – Cho-rong, South Korean singer \n*1993 – Gabriela Cé, Brazilian tennis player\n*  1993   – Nicole Gibbs, American tennis player\n*  1993   – James Roberts, Australian rugby league player\n*1994 – Umika Kawashima, Japanese singer and actress\n*1997 – Camila Cabello, Cuban-American singer\n*1998 – Jayson Tatum, American college basketball player\n\nDeaths\n\n* 532 – Winwaloe, saint and founder of Landévennec Abbey (b. c. 460)\n*1111 – Bohemond I of Antioch (b. 1058)\n*1195 – Hugh de Puiset, bishop of Durham (b. c. 1125)\n*1239 – Vladimir IV Rurikovich, Grand Prince of Kiev (b. 1187)\n*1311 – Antony Bek, bishop of Durham\n*1323 – Andrew Harclay, 1st Earl of Carlisle, English military leader\n*1383 – Hugh III of Arborea\n*1459 – Ausiàs March, Catalan knight and poet (b. 1397)\n*1542 – Arthur Plantagenet, 1st Viscount Lisle, illegitimate son of King Edward IV of England\n*1554 – John Frederick I, Elector of Saxony (b. 1503)\n*1578 – Sebastiano Venier, Doge of Venice (b. 1496)\n*  1578   – Michael Kantakouzenos Şeytanoğlu, Ottoman Greek magnate\n*1588 – Henry XI of Legnica, Duke of Legnica (b. 1539)\n*1592 – Michael Coxcie, Flemish painter (b. 1499)\n*1605 – Pope Clement VIII (b. 1536)\n*1611 – William Douglas, 10th Earl of Angus (b. 1552)\n*1616 – Matthias de l'Obel, physician of James I (b. 1538)\n*1703 – Robert Hooke, English architect and philosopher (b. 1635)\n*1706 – Johann Pachelbel, German organist and composer (b. 1653)\n*1744 – Jean Barbeyrac, French scholar and jurist (b. 1674)\n*1765 – William Stukeley, English archaeologist and historian (b. 1687)\n*1768 – Nicola Porpora, Italian composer and educator (b. 1686)\n*1792 – Robert Adam, Scottish-English architect and politician, designed the Culzean Castle (b. 1728)\n*1850 – Oliver Cowdery, American religious leader (b. 1806)\n*1894 – Ned Williamson, American baseball player (b. 1857)\n*1901 – George Gilman, American businessman, founded The Great Atlantic & Pacific Tea Company (b. 1826)\n*1905 – Antonio Annetto Caruana, Maltese archaeologist and author (b. 1830)\n*1927 – Mikhail Artsybashev, Ukrainian author and playwright (b. 1878)\n*  1927   – J. G. Parry-Thomas, Welsh race car driver and engineer (b. 1884)\n*1929 – Katharine Wright, American educator (b. 1874)\n*1932 – Eugen d'Albert, Scottish-German pianist and composer (b. 1864)\n*1943 – George Thompson, English cricketer and umpire (b. 1877)\n*1959 – Lou Costello, American actor and comedian (b. 1906)\n*1961 – Paul Wittgenstein, Austrian-American pianist (b. 1887)\n*1966 – Joseph Fields, American playwright, director, and producer (b. 1895)\n*  1966   – William Frawley, American actor and vaudevillian (b. 1887)\n*  1966   – Alice Pearce, American actress (b. 1917)\n*1981 – Rebecca Lancefield, American microbiologist and researcher (b. 1905)\n*1982 – Firaq Gorakhpuri, Indian poet and critic (b. 1896)\n*  1982   – Georges Perec, French author and screenwriter (b. 1936)\n*1983 – Hergé, Belgian author and illustrator (b. 1907)\n*1987 – Danny Kaye, American actor, singer, and dancer (b. 1911)\n*1988 – Henryk Szeryng, Polish-Mexican violinist and composer (b. 1918)\n*  1988   – Sewall Wright, American biologist and geneticist (b. 1889)\n*1990 – Charlotte Moore Sitterly, American astronomer (b. 1898)\n*1991 – Arthur Murray, American dancer and educator (b. 1895)\n*  1991   – William Penney, Baron Penney, Gibraltar-born English mathematician, physicist, and academic (b. 1909)\n*1993 – Mel Bradford, American author and critic (b. 1934)\n*  1993   – Carlos Marcello, Tunisian-American mob boss (b. 1910)\n*  1993   – Carlos Montoya, Spanish guitarist and composer (b. 1903)\n*  1993   – Albert Sabin, Polish-American physician and virologist (b. 1906)\n*1994 – John Edward Williams, American author and academic (b. 1922)\n*1995 – Howard W. Hunter, American religious leader, 14th President of The Church of Jesus Christ of Latter-day Saints (b. 1907)\n*1996 – Marguerite Duras, French author and director (b. 1914)\n*  1996   – John Krol, American cardinal (b. 1910)\n*1998 – Fred W. Friendly, American journalist and broadcaster (b. 1915)\n*1999 – Gerhard Herzberg, German-Canadian chemist and astronomer, Nobel Prize laureate (b. 1904)\n*  1999   – Lee Philips, American actor and director (b. 1927)\n*2000 – Toni Ortelli, Italian composer and conductor (b. 1904)\n*2001 – Louis Edmonds, American actor (b. 1923)\n*  2001   – Eugene Sledge, American soldier, author, and academic (b. 1923)\n*2002 – G. M. C. Balayogi, Indian lawyer and politician, 12th Speaker of the Lok Sabha (b. 1951)\n*2003 – Horst Buchholz, German actor (b. 1933)\n*  2003   – Luis Marden, American linguist, photographer, and explorer (b. 1913)\n*  2003   – Goffredo Petrassi, Italian composer and conductor (b. 1904)\n*2005 – Max Fisher, American businessman and philanthropist (b. 1928)\n*2006 – Ivor Cutler, Scottish poet and songwriter (b. 1923)\n*  2006   – Else Fisher, Australian-Swedish dancer, choreographer, and director (b. 1918)\n*  2006   – William Herskovic, Hungarian-American humanitarian (b. 1914)\n*2007 – Osvaldo Cavandoli, Italian cartoonist (b. 1920)\n*2008 – Giuseppe Di Stefano, Italian tenor and actor (b. 1921)\n*  2008   – Norman Smith, English drummer and producer (b. 1923)\n*2009 – Gilbert Parent, Canadian educator and politician, 33rd Speaker of the Canadian House of Commons (b. 1935)\n*2010 – Keith Alexander, English footballer and manager (b. 1956)\n*  2010   – Michael Foot, English journalist and politician, Secretary of State for Employment (b. 1913)\n*2011 – May Cutler, Canadian journalist, author, and politician (b. 1923)\n*2012 – Ralph McQuarrie, American conceptual designer and illustrator (b. 1929)\n*  2012   – Ronnie Montrose, American guitarist, songwriter, and producer (b. 1947)\n*  2012   – Alex Webster, American football player and coach (b. 1931)\n*2013 – Luis Cubilla, Uruguayan footballer and manager (b. 1940)\n*  2013   – Bobby Rogers, American singer-songwriter (b. 1940)\n*2014 – Robert Ashley, American soldier and composer (b. 1930)\n*  2014   – Sherwin B. Nuland, American surgeon, author, and educator (b. 1930)\n*  2014   – William R. Pogue, American colonel, pilot, and astronaut (b. 1930)\n*  2014   – Don Shows, American football player and coach (b. 1940)\n*2015 – Ernest Braun, Austrian-English physicist and academic (b. 1925)\n*  2015   – M. Stanton Evans, American journalist and author (b. 1934)\n*2016 – Hayabusa, Japanese wrestler (b. 1968)\n*  2016   – Berta Cáceres, Honduran environmentalist (b. 1973)\n*  2016   – Martin Crowe, New Zealand cricketer and sportscaster (b. 1962)\n*  2016   – Thanat Khoman, Thai politician and diplomat, Deputy Prime Minister of Thailand (b. 1914)\n*2017 – René Préval, Haitian politician (b. 1943)\n\nHolidays and observances\n\n* Christian feast day:\n** Cunigunde of Luxembourg\n** Katharine Drexel\n** John and Charles Wesley (Episcopal Church (USA))\n** Winwaloe\n** March 3 (Eastern Orthodox liturgics)\n* Hinamatsuri or \"Girl's Day\" (Japan)\n* Liberation Day (Bulgaria)\n* Martyrs' Day (Malawi)\n* Mother's Day (Georgia)\n* Sportsmen's Day (Egypt)\n* Teacher's Day (Lebanon)\n* World Wildlife Day",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "March 3" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19633" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n*473 – Gundobad (nephew of Ricimer) nominates Glycerius as emperor of the Western Roman Empire.\n*724 – Empress Genshō abdicates the throne in favor of her nephew Shōmu who becomes emperor of Japan.\n*1284 – The Statute of Rhuddlan incorporates the Principality of Wales into England.\n*1575 – Indian Mughal Emperor Akbar defeats Bengali army at the Battle of Tukaroi.\n*1585 – The Olympic Theatre, designed by Andrea Palladio, is inaugurated in Vicenza.\n*1776 – American Revolutionary War: The first amphibious landing of the United States Marine Corps begins the Battle of Nassau.\n*1779 – American Revolutionary War: The Continental Army is routed at the Battle of Brier Creek near Savannah, Georgia.\n*1799 – The Russo-Ottoman siege of Corfu ends with the surrender of the French garrison.\n*1820 – The U.S. Congress passes the Missouri Compromise.\n*1845 – Florida is admitted as the 27th U.S. state.\n*1849 – The Territory of Minnesota was created. \n*1857 – Second Opium War: France and the United Kingdom declare war on China.\n*1859 – The two-day Great Slave Auction, the largest such auction in United States history, concludes.\n*1861 – Alexander II of Russia signs the Emancipation Manifesto, freeing serfs.\n*1865 – Opening of The Hongkong and Shanghai Banking Corporation, the founding member of the HSBC Group.\n*1873 – Censorship in the United States: The U.S. Congress enacts the Comstock Law, making it illegal to send any \"obscene, lewd, or lascivious\" books through the mail.\n*1875 – Georges Bizet's opera Carmen receives its première at the Opéra-Comique in Paris.\n*  1875   – The first ever organized indoor game of ice hockey is played in Montreal, Quebec, Canada as recorded in the Montreal Gazette.\n*1878 – The Russo-Turkish War ends with Bulgaria regaining its independence from the Ottoman Empire according to the Treaty of San Stefano; a few months afterwards the Congress of Berlin stripped its status to a vassal principality of the Ottoman Empire.\n*1885 – The American Telephone & Telegraph Company is incorporated in New York.\n*1904 – Kaiser Wilhelm II of Germany becomes the first person to make a sound recording of a political document, using Thomas Edison's phonograph cylinder.\n*1910 – Rockefeller Foundation: John D. Rockefeller Jr. announces his retirement from managing his businesses so that he can devote all his time to philanthropy.\n*1913 – Thousands of women march in a suffrage parade in Washington, D.C.\n*1918 – Russia signs the Treaty of Brest-Litovsk, agreeing to withdraw from World War I, and conceding German control of the Baltic States, Belarus and Ukraine. It also conceded Turkish control of Ardahan, Kars and Batumi.\n*1923 – TIME magazine is published for the first time.\n*1924 – The fourteenth-century Islamic caliphate is abolished when Caliph Abdülmecid II of the Ottoman Empire is deposed. The last remnant of the old regime gives way to the reformed Turkey of Kemal Atatürk.\n*  1924   – The Free State of Fiume is annexed by the Kingdom of Italy.\n*1931 – The United States adopts The Star-Spangled Banner as its national anthem.\n*1938 – Oil is discovered in Saudi Arabia.\n*1939 – In Bombay, Mohandas Gandhi begins a hunger strike in protest at the autocratic rule in British India.\n*1940 – Five people are killed in an arson attack on the offices of the communist newspaper Flamman in Luleå, Sweden.\n*1942 – World War II: Ten Japanese warplanes raid Broome, Western Australia, killing more than 100 people.\n*1943 – World War II: In London, 173 people are killed in a crush while trying to enter an air-raid shelter at Bethnal Green tube station.\n*1944 – The Order of Nakhimov and Order of Ushakov are instituted in USSR as the highest naval awards.\n*1945 – World War II: American and Filipino troops recapture Manila.\n*  1945   – World War II: The RAF accidentally bombs the Bezuidenhout area of The Hague, Netherlands, killing 511 people.\n*1951 – Jackie Brenston, with Ike Turner and his band, records \"Rocket 88\", often cited as \"the first rock and roll record\", at Sam Phillips's recording studios in Memphis, Tennessee.\n*1953 – A De Havilland Comet (Canadian Pacific Air Lines) crashes in Karachi, Pakistan, killing 11.\n*1958 – Nuri al-Said becomes Prime Minister of Iraq for the eighth time.\n*1969 – Apollo program: NASA launches Apollo 9 to test the lunar module.\n*1972 – Mohawk Airlines Flight 405 crashes as a result of a control malfunction and insufficient training in emergency procedures.\n*1974 – Turkish Airlines Flight 981 crashes at Ermenonville near Paris, France killing all 346 aboard.\n*1980 – The  is decommissioned and stricken from the Naval Vessel Register.\n*1985 – Arthur Scargill declares that the National Union of Mineworkers' national executive voted to end the longest-running industrial dispute in Great Britain without any peace deal over pit closures.\n*  1985   – A magnitude 8.3 earthquake strikes the Valparaíso Region of Chile, killing 177 and leaving nearly a million people homeless.\n*1986 – The Australia Act 1986 commences, causing Australia to become fully independent from the United Kingdom.\n*1991 – An amateur video captures the beating of Rodney King by Los Angeles police officers.\n*1997 – The tallest free-standing structure in the Southern Hemisphere, Sky Tower in downtown Auckland, New Zealand, opens after two-and-a-half years of construction.\n*2005 – James Roszko murders four Royal Canadian Mounted Police constables during a drug bust at his property in Rochfort Bridge, Alberta, then commits suicide. This is the deadliest peace-time incident for the RCMP since 1885 and the North-West Rebellion.\n*  2005   – Steve Fossett becomes the first person to fly an airplane non-stop around the world solo without refueling.\n*  2005   – Margaret Wilson is elected as Speaker of the New Zealand House of Representatives, beginning a period lasting until August 23, 2006 where all the highest political offices (including Elizabeth II as Head of State), were occupied by women, making New Zealand the first country for this to occur.\n*2013 – A bomb blast in Karachi, Pakistan, kills at least 45 people and injured 180 others in a predominately Shia Muslim area.\n*2017 – Nintendo releases the hybrid Nintendo Switch video game console worldwide to critical acclaim, later becoming the fastest selling console in the United States.\n\nBirths\n\n*1455 – John II of Portugal (d. 1495)\n*  1455   – Ascanio Sforza, Catholic cardinal (d. 1505)\n*1506 – Luís of Portugal, Duke of Beja (d. 1555)\n*1520 – Matthias Flacius, Croatian theologian and reformer (d. 1575)\n*1583 – Edward Herbert, 1st Baron Herbert of Cherbury, English-Welsh soldier, historian, and diplomat (d. 1648)\n*1589 – Gisbertus Voetius, Dutch minister, theologian, and academic (d. 1676)\n*1606 – Edmund Waller, English poet and politician (d. 1687)\n*1652 – Thomas Otway, English playwright and author (d. 1685)\n*1678 – Madeleine de Verchères, Canadian rebel leader (d. 1747)\n*1756 – William Godwin, English journalist and author (d. 1836)\n*1778 – Frederica of Mecklenburg-Strelitz (d. 1841)\n*1793 – William Macready, English actor and manager (d. 1873)\n*1800 – Heinrich Georg Bronn, German geologist and paleontologist (d. 1862)\n*1803 – Thomas Field Gibson, English manufacturer who aided the welfare of the Spitalfields silk weavers (d. 1889)\n*1805 – Jonas Furrer, Swiss politician (d. 1861)\n*1816 – William James Blacklock, English-Scottish painter (d. 1858)\n*1819 – Gustave de Molinari, Dutch-Belgian economist and theorist (d. 1912)\n*1825 – Shiranui Kōemon, Japanese sumo wrestler (d. 1879)\n*1831 – George Pullman, American engineer and businessman, founded the Pullman Company (d. 1897)\n*1839 – Jamsetji Tata, Indian businessman, founded Tata Group (d. 1904)\n*1841 – John Murray, Canadian-Scottish oceanographer and biologist (d. 1914)\n*1845 – Georg Cantor, Russian-German mathematician and philosopher (d. 1918)\n*1847 – Alexander Graham Bell, Scottish-American engineer and academic, invented the telephone (d. 1922)\n*1860 – John Montgomery Ward, American baseball player and manager (d. 1925)\n*1866 – Fred A. Busse, American lawyer and politician, 39th Mayor of Chicago (d. 1914)\n*1868 – Émile Chartier, French philosopher and journalist (d. 1951)\n*1869 – Henry Wood, English conductor (d. 1944)\n*1871 – Maurice Garin, Italian-French cyclist (d. 1957)\n*1873 – William Green, American union leader and politician (d. 1952)\n*1880 – Florence Auer, American actress and screenwriter (d. 1962)\n*  1880   – Yōsuke Matsuoka, Japanese politician, Japanese Minister of Foreign Affairs (d. 1946)\n*1882 – Charles Ponzi, Italian businessman (d. 1949)\n*1883 – Cyril Burt, English psychologist and geneticist (d. 1971)\n*  1883   – Paul Marais de Beauchamp, French zoologist (d. 1977)\n*1887 – Lincoln J. Beachey, American pilot (d. 1915)\n*1891 – Damaskinos of Athens, Greek archbishop (d. 1949)\n*1893 – Beatrice Wood, American illustrator and potter (d. 1998)\n*1895 – Ragnar Frisch, Norwegian economist and academic, Nobel Prize laureate (d. 1973)\n*  1895   – Matthew Ridgway, American general (d. 1993)\n*1898 – Emil Artin, Austrian-German mathematician and academic (d. 1962)\n*1900 – Edna Best, British stage and film actress, appeared on early television in 1938 (d. 1974) \n*  1900 – Ruby Dandridge, African-American film and radio actress (d. 1987) \n*1901 – Claude Choules, English-Australian soldier (d. 2011)\n*1903 – Vasily Kozlov, Belarusian general and politician (d. 1967)\n*1906 – Artur Lundkvist, Swedish poet and critic (d. 1991)\n*1911 – Jean Harlow, American actress (d. 1937)\n*  1911   – Hugues Lapointe, Canadian lawyer and politician, 22nd Lieutenant Governor of Quebec (d. 1982)\n*1913 – Margaret Bonds, American pianist and composer (d. 1972)\n*  1913   – Harold J. Stone, American actor (d. 2005)\n*1914 – Asger Jorn, Danish painter and sculptor (d. 1973)\n*1916 – Paul Halmos, Hungarian-American mathematician (d. 2006)\n*1917 – Sameera Moussa, Egyptian physicist and academic (d. 1952)\n*1918 – Arthur Kornberg, American biochemist and academic, Nobel Prize laureate (d. 2007)\n*1920 – Julius Boros, American golfer and accountant (d. 1994)\n*  1920   – James Doohan, Canadian-American actor and soldier (d. 2005)\n*  1920   – Ronald Searle, English-French soldier and illustrator (d. 2011)\n*1921 – Diana Barrymore, American actress (d. 1960)\n*1922 – Nándor Hidegkuti, Hungarian footballer and manager (d. 2002)\n*1923 – Barney Martin, American police officer and actor (d. 2005)\n*  1923   – Doc Watson, American bluegrass singer-songwriter and musician (d. 2012)\n*1924 – Tomiichi Murayama, Japanese soldier and politician, 52nd Prime Minister of Japan\n*1926 – James Merrill, American poet and playwright (d. 1995)\n*1927 – Pierre Aubert, Swiss lawyer and politician (d. 2016)\n*1930 – Ion Iliescu, Romanian engineer and politician, 2nd President of Romania\n*1934 – Peter Brooke, Baron Brooke of Sutton Mandeville, English politician, Secretary of State for Northern Ireland\n*  1934   – Jimmy Garrison, American bassist and educator (d. 1976)\n*1935 – Mal Anderson, Australian tennis player\n*  1935   – Michael Walzer, American philosopher and academic\n*  1935   – Zhelyu Zhelev, Bulgarian philosopher and politician, 2nd President of Bulgaria (d. 2015)\n*1939 – Larry Burkett, American author and radio host (d. 2003)\n*  1939   – M. L. Jaisimha, Indian cricketer (d. 1999)\n*1940 – Germán Castro Caycedo, Colombian author and journalist\n*  1940   – Perry Ellis, American fashion designer, founded Perry Ellis (d. 1986)\n*  1940   – Jean-Paul Proust, French-Monacan police officer and politician, 21st Minister of State of Monaco (d. 2010)\n*  1940   – Owen Spencer-Thomas, English minister and journalist\n*1941 – Mike Pender, English singer-songwriter and guitarist \n*1945 – George Miller, Australian director, producer, and screenwriter\n*  1945   – Hattie Winston, American actress\n*1946 – John Virgo, English snooker player and sportscaster\n*1947 – Clifton Snider, American author, poet, and critic\n*  1947   – Jennifer Warnes, American singer-songwriter and producer\n*1949 – Ron Chernow, American historian, journalist, and author\n*  1949   – Bonnie J. Dunbar, American engineer, academic, and astronaut\n*  1949   – Jesse Jefferson, American baseball player (d. 2011)\n*1951 – Andy Murray, Canadian ice hockey player and coach\n*  1951   – Heizō Takenaka, Japanese economist and politician\n*1952 – Rudy Fernandez, Filipino actor and producer (d. 2008)\n*1953 – Robyn Hitchcock, English singer-songwriter and guitarist\n*  1953   – Zico, Brazilian footballer and coach\n*1954 – Keith Fergus, American golfer\n*  1954   – John Lilley, American singer-songwriter and guitarist \n*  1954   – Édouard Lock, Moroccan-Canadian dancer and choreographer\n*1955 – Darnell Williams, English-American actor and director\n*1956 – Zbigniew Boniek, Polish footballer and manager\n*  1956   – John Fulton Reid, New Zealand cricketer\n*1957 – Stephen Budiansky, American historian, journalist, and author\n*  1957   – Thom Hoffman, Dutch actor and photographer\n*1958 – Miranda Richardson, English actress \n*1959 – Ira Glass, American radio host and producer\n*  1959   – Duško Vujošević, Montenegrin basketball player and coach\n*1960 – Neal Heaton, American baseball player and coach\n*1961 – Mary Page Keller, American actress and producer\n*  1961   – John Matteson, American biographer\n*  1961   – Perry McCarthy, English race car driver\n*  1961   – Fatima Whitbread, English javelin thrower\n*1962 – Glen E. Friedman, American photographer\n*  1962   – Jackie Joyner-Kersee, American heptathlete and long jumper\n*  1962   – Herschel Walker, American football player and mixed martial artist\n*1963 – Martín Fiz, Spanish runner\n*  1963   – Khaltmaagiin Battulga, 5th President of Mongolia\n*1964 – Raúl Alcalá, Mexican cyclist\n*  1964   – Laura Harring, Mexican-American model and actress, Miss USA 1985\n*  1964   – Glenn Kulka, Canadian ice hockey player and wrestler\n*1965 – Dragan Stojković, Serbian footballer and manager\n*1966 – Tone Lōc, American rapper, producer, and actor\n*  1966   – Timo Tolkki, Finnish guitarist, songwriter, and producer\n*1968 – Brian Cox, English keyboard player and physicist \n*  1968   – Brian Leetch, American ice hockey player\n*1970 – Julie Bowen, American actress\n*  1970   – Inzamam-ul-Haq, Pakistani cricketer and coach\n*1971 – Charlie Brooker, English journalist, producer, and author\n*  1971   – Tyler Florence, American chef and author\n*1972 – Darren Anderton, English footballer and sportscaster\n*1973 – Xavier Bettel, Luxembourger lawyer and politician, Prime Minister of Luxembourg\n*  1973   – Matthew Marsden, English actor and martial artist\n*1974 – David Faustino, American actor, producer, and screenwriter\n*1976 – Fraser Gehrig, Australian footballer\n*  1976   – Isabel Granada, Filipino-Spanish actress (d. 2017)\n*  1976   – Keit Pentus-Rosimannus, Estonian politician, 28th Estonian Minister of Foreign Affairs\n*1977 – Ronan Keating, Irish singer-songwriter and actor \n*  1977   – Stéphane Robidas, Canadian ice hockey player\n*  1977   – Buddy Valastro, American chef and television host\n*1978 – Matt Diaz, American baseball player\n*1979 – Albert Jorquera, Spanish footballer\n*1980 – Mason Unck, American football player\n*1981 – David Bailey, American basketball player\n*  1981   – Julius Malema, South African politician\n*  1981   – Emmanuel Pappoe, Ghanaian footballer\n*1982 – Jessica Biel, American actress, singer, and producer\n*  1982   – Colton Orr, Canadian ice hockey player\n*1982 –Tolu Ogunlesi, Nigerian journalist, writer\n*  1982   – Brent Tate, Australian rugby league player\n*1983 – Ashley Hansen, Australian footballer\n*  1983   – Sarah Poewe, South African swimmer\n*1984 – Valerio Bernabò, Italian rugby player\n*  1984   – Santonio Holmes, American football player\n*  1984   – Alexander Semin, Russian ice hockey player\n*1985 – Sam Morrow, Northern Irish footballer\n*1986 – Jed Collins, American football player\n*  1986   – Stacie Orrico, American singer-songwriter\n*  1986   – Mehmet Topal, Turkish footballer\n*1987 – Jesús Padilla, Mexican footballer\n*1987 – Shraddha Kapoor, Indian Actress, Singer, Designer \n*1988 – Teodora Mirčić, Serbian tennis player\n*  1988   – Michael Morrison, English footballer\n*  1988   – Jan-Arie van der Heijden, Dutch footballer\n*  1988   – Max Waller, English cricketer\n*1989 – Erwin Mulder, Dutch footballer\n*1990 – Vladimir Janković, Greek-Serbian basketball player\n*1991 – Anri Sakaguchi, Japanese actress\n*  1991   – Cho-rong, South Korean singer \n*1993 – Gabriela Cé, Brazilian tennis player\n*  1993   – Nicole Gibbs, American tennis player\n*  1993   – James Roberts, Australian rugby league player\n*1994 – Umika Kawashima, Japanese singer and actress\n*1997 – Camila Cabello, Cuban-American singer\n*1998 – Jayson Tatum, American college basketball player\n\nDeaths\n\n* 532 – Winwaloe, saint and founder of Landévennec Abbey (b. c. 460)\n*1111 – Bohemond I of Antioch (b. 1058)\n*1195 – Hugh de Puiset, bishop of Durham (b. c. 1125)\n*1239 – Vladimir IV Rurikovich, Grand Prince of Kiev (b. 1187)\n*1311 – Antony Bek, bishop of Durham\n*1323 – Andrew Harclay, 1st Earl of Carlisle, English military leader\n*1383 – Hugh III of Arborea\n*1459 – Ausiàs March, Catalan knight and poet (b. 1397)\n*1542 – Arthur Plantagenet, 1st Viscount Lisle, illegitimate son of King Edward IV of England\n*1554 – John Frederick I, Elector of Saxony (b. 1503)\n*1578 – Sebastiano Venier, Doge of Venice (b. 1496)\n*  1578   – Michael Kantakouzenos Şeytanoğlu, Ottoman Greek magnate\n*1588 – Henry XI of Legnica, Duke of Legnica (b. 1539)\n*1592 – Michael Coxcie, Flemish painter (b. 1499)\n*1605 – Pope Clement VIII (b. 1536)\n*1611 – William Douglas, 10th Earl of Angus (b. 1552)\n*1616 – Matthias de l'Obel, physician of James I (b. 1538)\n*1703 – Robert Hooke, English architect and philosopher (b. 1635)\n*1706 – Johann Pachelbel, German organist and composer (b. 1653)\n*1744 – Jean Barbeyrac, French scholar and jurist (b. 1674)\n*1765 – William Stukeley, English archaeologist and historian (b. 1687)\n*1768 – Nicola Porpora, Italian composer and educator (b. 1686)\n*1792 – Robert Adam, Scottish-English architect and politician, designed the Culzean Castle (b. 1728)\n*1850 – Oliver Cowdery, American religious leader (b. 1806)\n*1894 – Ned Williamson, American baseball player (b. 1857)\n*1901 – George Gilman, American businessman, founded The Great Atlantic & Pacific Tea Company (b. 1826)\n*1905 – Antonio Annetto Caruana, Maltese archaeologist and author (b. 1830)\n*1927 – Mikhail Artsybashev, Ukrainian author and playwright (b. 1878)\n*  1927   – J. G. Parry-Thomas, Welsh race car driver and engineer (b. 1884)\n*1929 – Katharine Wright, American educator (b. 1874)\n*1932 – Eugen d'Albert, Scottish-German pianist and composer (b. 1864)\n*1943 – George Thompson, English cricketer and umpire (b. 1877)\n*1959 – Lou Costello, American actor and comedian (b. 1906)\n*1961 – Paul Wittgenstein, Austrian-American pianist (b. 1887)\n*1966 – Joseph Fields, American playwright, director, and producer (b. 1895)\n*  1966   – William Frawley, American actor and vaudevillian (b. 1887)\n*  1966   – Alice Pearce, American actress (b. 1917)\n*1981 – Rebecca Lancefield, American microbiologist and researcher (b. 1905)\n*1982 – Firaq Gorakhpuri, Indian poet and critic (b. 1896)\n*  1982   – Georges Perec, French author and screenwriter (b. 1936)\n*1983 – Hergé, Belgian author and illustrator (b. 1907)\n*1987 – Danny Kaye, American actor, singer, and dancer (b. 1911)\n*1988 – Henryk Szeryng, Polish-Mexican violinist and composer (b. 1918)\n*  1988   – Sewall Wright, American biologist and geneticist (b. 1889)\n*1990 – Charlotte Moore Sitterly, American astronomer (b. 1898)\n*1991 – Arthur Murray, American dancer and educator (b. 1895)\n*  1991   – William Penney, Baron Penney, Gibraltar-born English mathematician, physicist, and academic (b. 1909)\n*1993 – Mel Bradford, American author and critic (b. 1934)\n*  1993   – Carlos Marcello, Tunisian-American mob boss (b. 1910)\n*  1993   – Carlos Montoya, Spanish guitarist and composer (b. 1903)\n*  1993   – Albert Sabin, Polish-American physician and virologist (b. 1906)\n*1994 – John Edward Williams, American author and academic (b. 1922)\n*1995 – Howard W. Hunter, American religious leader, 14th President of The Church of Jesus Christ of Latter-day Saints (b. 1907)\n*1996 – Marguerite Duras, French author and director (b. 1914)\n*  1996   – John Krol, American cardinal (b. 1910)\n*1998 – Fred W. Friendly, American journalist and broadcaster (b. 1915)\n*1999 – Gerhard Herzberg, German-Canadian chemist and astronomer, Nobel Prize laureate (b. 1904)\n*  1999   – Lee Philips, American actor and director (b. 1927)\n*2000 – Toni Ortelli, Italian composer and conductor (b. 1904)\n*2001 – Louis Edmonds, American actor (b. 1923)\n*  2001   – Eugene Sledge, American soldier, author, and academic (b. 1923)\n*2002 – G. M. C. Balayogi, Indian lawyer and politician, 12th Speaker of the Lok Sabha (b. 1951)\n*2003 – Horst Buchholz, German actor (b. 1933)\n*  2003   – Luis Marden, American linguist, photographer, and explorer (b. 1913)\n*  2003   – Goffredo Petrassi, Italian composer and conductor (b. 1904)\n*2005 – Max Fisher, American businessman and philanthropist (b. 1928)\n*2006 – Ivor Cutler, Scottish poet and songwriter (b. 1923)\n*  2006   – Else Fisher, Australian-Swedish dancer, choreographer, and director (b. 1918)\n*  2006   – William Herskovic, Hungarian-American humanitarian (b. 1914)\n*2007 – Osvaldo Cavandoli, Italian cartoonist (b. 1920)\n*2008 – Giuseppe Di Stefano, Italian tenor and actor (b. 1921)\n*  2008   – Norman Smith, English drummer and producer (b. 1923)\n*2009 – Gilbert Parent, Canadian educator and politician, 33rd Speaker of the Canadian House of Commons (b. 1935)\n*2010 – Keith Alexander, English footballer and manager (b. 1956)\n*  2010   – Michael Foot, English journalist and politician, Secretary of State for Employment (b. 1913)\n*2011 – May Cutler, Canadian journalist, author, and politician (b. 1923)\n*2012 – Ralph McQuarrie, American conceptual designer and illustrator (b. 1929)\n*  2012   – Ronnie Montrose, American guitarist, songwriter, and producer (b. 1947)\n*  2012   – Alex Webster, American football player and coach (b. 1931)\n*2013 – Luis Cubilla, Uruguayan footballer and manager (b. 1940)\n*  2013   – Bobby Rogers, American singer-songwriter (b. 1940)\n*2014 – Robert Ashley, American soldier and composer (b. 1930)\n*  2014   – Sherwin B. Nuland, American surgeon, author, and educator (b. 1930)\n*  2014   – William R. Pogue, American colonel, pilot, and astronaut (b. 1930)\n*  2014   – Don Shows, American football player and coach (b. 1940)\n*2015 – Ernest Braun, Austrian-English physicist and academic (b. 1925)\n*  2015   – M. Stanton Evans, American journalist and author (b. 1934)\n*2016 – Hayabusa, Japanese wrestler (b. 1968)\n*  2016   – Berta Cáceres, Honduran environmentalist (b. 1973)\n*  2016   – Martin Crowe, New Zealand cricketer and sportscaster (b. 1962)\n*  2016   – Thanat Khoman, Thai politician and diplomat, Deputy Prime Minister of Thailand (b. 1914)\n*2017 – René Préval, Haitian politician (b. 1943)\n\nHolidays and observances\n\n* Christian feast day:\n** Cunigunde of Luxembourg\n** Katharine Drexel\n** John and Charles Wesley (Episcopal Church (USA))\n** Winwaloe\n** March 3 (Eastern Orthodox liturgics)\n* Hinamatsuri or \"Girl's Day\" (Japan)\n* Liberation Day (Bulgaria)\n* Martyrs' Day (Malawi)\n* Mother's Day (Georgia)\n* Sportsmen's Day (Egypt)\n* Teacher's Day (Lebanon)\n* World Wildlife Day. March 3. http://en.wikipedia.org/?curid=19633."
  }
}
