{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13764",
  "eid" : "0ccd2f30-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778530723,
  "textBody" : "Hassium is a synthetic chemical element with symbol Hs and atomic number 108. It is named after the German state of Hesse. It is a synthetic element and radioactive; the most stable known isotope, 270Hs, has a half-life of approximately 10 seconds. More than 100 atoms of hassium have been synthesized to date.\n\nIn the periodic table of the elements, it is a d-block transactinide element. Hassium is a member of the 7th period and belongs to the group 8 elements: it is thus the sixth member of the 6d series of transition metals. Chemistry experiments have confirmed that hassium behaves as the heavier homologue to osmium in group 8. The chemical properties of hassium are characterized only partly, but they compare well with the chemistry of the other group 8 elements. In bulk quantities, hassium is expected to be a silvery metal that reacts readily with oxygen in the air, forming a volatile tetroxide.\n\nHistory\n\nThe synthesis of element 108 was first attempted in 1978 by a Russian research team led by Yuri Oganessian and Vladimir Utyonkov at the Joint Institute for Nuclear Research (JINR) in Dubna, using reactions that would generate the isotopes hassium-270 and hassium-264. The data was uncertain and they carried out new experiments on hassium five years later, where these two isotopes as well as hassium-263 were produced; the hassium-264 experiment was conducted again and confirmed in 1984.\n\nHassium was officially discovered in 1984 by a German research team led by Peter Armbruster and Gottfried Münzenberg at the Institute for Heavy Ion Research (Gesellschaft für Schwerionenforschung, GSI) in Darmstadt. The team bombarded a target of lead-208 with accelerated nuclei of iron-58 to produce 3 atoms of the isotope hassium-265.\n\nDue to this issue, a controversy arose over who should be recognized as the official discoverer of the element. The IUPAC/IUPAP Transfermium Working Group (TWG) recognised the GSI collaboration as official discoverers in their 1992 report. They stated that the GSI collaboration was \"more detailed and, of itself, carries conviction\", and that while the combined data from Dubna and Darmstadt confirmed that hassium had been synthesized, the major credit was awarded to the GSI. This statement came in spite of the combined data also supporting the Russian 1983 discovery claim and the TWG also acknowledging that \"very probably element 108 played a role in the Dubna experiment.\" For Part I see \n\nThe name hassium was proposed by Peter Armbruster and his colleagues, the officially recognised German discoverers, in September 1992, derived from the Latin name (Hassia) for the German state of Hesse where the institute is located. Using Mendeleev's nomenclature for unnamed and undiscovered elements, hassium should be known as eka-osmium. In 1979, during the Transfermium Wars (but before the synthesis of hassium), IUPAC published recommendations according to which the element was to be called unniloctium (with the corresponding symbol of Uno), a systematic element name as a placeholder, until the element was discovered (and the discovery then confirmed) and a permanent name was decided on. Although widely used in the chemical community on all levels, from chemistry classrooms to advanced textbooks, the recommendations were mostly ignored among scientists in the field, who either called it \"element 108\", with the symbol of E108, (108), or even simply 108, or used the proposed name \"hassium\".\n\nIn 1994 a committee of IUPAC recommended that element 108 be named hahnium (Hn) after the German physicist Otto Hahn, after an older suggestion of ottohahnium (Oh) in spite of the long-standing convention to give the discoverer the right to suggest a name, so that elements named after Hahn and Lise Meitner (meitnerium) would be next to each other, honoring their joint discovery of nuclear fission. This was because they felt that Hesse did not merit an element being named after it. After protests from the German discoverers and the American Chemical Society, IUPAC relented and the name hassium (Hs) was adopted internationally in 1997.\n\nNatural occurrence\n\nHassium is not known to occur naturally on Earth; the half-lives of all its known isotopes are short enough that no primordial hassium would have survived to the present day. This does not rule out the possibility of unknown longer-lived isotopes or nuclear isomers existing, some of which could still exist in trace quantities today if they are long-lived enough. In the early 1960s, it was predicted that long-lived deformed isomers of hassium might occur naturally on Earth in trace quantities. This was theorized in order to explain the extreme radiation damage in some minerals that could not have been caused by any known natural radioisotopes, but could have been caused by superheavy elements.\n\nIn 1963, Soviet scientist Victor Cherdyntsev, who had previously claimed the existence of primordial curium-247, claimed to have discovered element 108 (specifically, the 267Hs isotope, which supposedly had a half-life of 400 to 500 million years) in natural molybdenite and suggested the name sergenium (symbol Sg; at the time, this symbol had not yet been taken by seaborgium) for it, after the ancient city of Serik along the Silk Road in Kazakhstan where his molybdenite samples came from. His rationale for claiming that sergenium was the heavier homologue to osmium was that minerals supposedly containing sergenium formed volatile oxides when boiled in nitric acid, similarly to osmium. His findings were criticized by V. M. Kulakov on the grounds that some of the properties Cherdyntsev claimed sergenium had were inconsistent with the then-current nuclear physics.\n\nThe chief questions raised by Kulakov were that the claimed alpha decay energy of sergenium was many orders of magnitude lower than expected and the half-life given was eight orders of magnitude shorter than what would be predicted for a nuclide alpha decaying with the claimed decay energy, but at the same time a corrected half-life in the region of 1016 years would be impossible as it would imply that the samples contained about 100 milligrams of sergenium. In 2003 it was suggested that the observed alpha decay with energy 4.5 MeV could be due to a low-energy and strongly enhanced transition between different hyperdeformed states of a hassium isotope around 271Hs, thus suggesting that the existence of superheavy elements in nature was at least possible, although unlikely.\n\nIn 2004, the Joint Institute for Nuclear Research conducted a search for natural hassium. This was done underground to avoid interference and false positives from cosmic rays, but no results have been released, strongly implying that no natural hassium was found. The possible extent of primordial hassium on Earth is uncertain; it might now only exist in traces, or could even have completely decayed by now after having caused the radiation damage long ago.\n\nIn 2006, it was hypothesized that an isomer of 271Hs might have a half-life of around (2.5±0.5)×108 y, which would explain the observation of alpha particles with energies of around 4.4 MeV in some samples of molybdenite and osmiridium. This isomer of 271Hs could be produced from the beta decay of 271Bh and 271Sg, which, being homologous to rhenium and molybdenum respectively, should occur in molybdenite along with rhenium and molybdenum if they occurred in nature. Since hassium is homologous to osmium, it should also occur along with osmium in osmiridium if it occurred in nature. The decay chains of 271Bh and 271Sg are very hypothetical and the predicted half-life of this hypothetical hassium isomer is not long enough for any sufficient quantity to remain on Earth. It is possible that more 271Hs may be deposited on the Earth as the Solar System travels through the spiral arms of the Milky Way, which would also explain excesses of plutonium-239 found on the floors of the Pacific Ocean and the Gulf of Finland, but minerals enriched with 271Hs are predicted to also have excesses of uranium-235 and lead-207, and would have different proportions of elements that are formed during spontaneous fission, such as krypton, zirconium, and xenon. Thus, the occurrence of hassium in nature in minerals such as molybdenite and osmiride is theoretically possible, but highly unlikely.\n\nIsotopes\n\nHassium has no stable or naturally occurring isotopes. Several radioactive isotopes have been synthesized in the laboratory, either by fusing two atoms or by observing the decay of heavier elements. Twelve different isotopes have been reported with atomic masses from 263 to 277 (with the exceptions of 272, 274, and 276), three of which, hassium-265, hassium-267, hassium-269, have known metastable states. Most of these decay predominantly through alpha decay, but some also undergo spontaneous fission.\n\nThe lightest isotopes, which usually have shorter half-lives were synthesized by direct fusion between two lighter nuclei and as decay products. The heaviest isotope produced by direct fusion is 271Hs; heavier isotopes have only been observed as decay products of elements with larger atomic numbers. In 1999, American scientists at the University of California, Berkeley, announced that they had succeeded in synthesizing three atoms of 293Og. These parent nuclei were reported to have successively emitted three alpha particles to form hassium-273 nuclei, which were claimed to have undergone an alpha decay, emitting alpha particles with decay energies of 9.78 and 9.47 MeV and half-life 1.2 s, but their claim was retracted in 2001. The isotope was successfully produced in 2010 by the same team. The new data matched the previous (fabricated)[https://www.nytimes.com/2002/10/15/science/at-lawrence-berkeley-physicists-say-a-colleague-took-them-for-a-ride.html?scp2&sq\nvictor%20ninov&stcse&pagewanted\n1 At Lawrence Berkeley, Physicists Say a Colleague Took Them for a Ride] George Johnson, The New York Times, 15 October 2002 data.\n\n270Hs: prospects for a deformed doubly magic nucleus\n\nAccording to calculations, 108 is a proton magic number for deformed nuclei (nuclei that are far from spherical), and 162 is a neutron magic number for deformed nuclei. This means that such nuclei are permanently deformed in their ground state but have high, narrow fission barriers to further deformation and hence relatively long life-times to spontaneous fission. The spontaneous fission half-lives in this region are typically reduced by a factor of 109 in comparison with those in the vicinity of the spherical doubly magic nucleus 298Fl, caused by the narrower fission barrier for such deformed nuclei. Hence, the nucleus 270Hs has promise as a deformed doubly magic nucleus. Experimental data from the decay of the darmstadtium (Z\n110) isotopes 271Ds and 273Ds provides strong evidence for the magic nature of the N162 sub-shell. The syntheses of 269Hs, 270Hs, and 271Hs also fully support the assignment of N\n162 as a magic number. In particular, the low decay energy for 270Hs is in complete agreement with calculations.\n\nEvidence for the magicity of the Z108 proton shell can be obtained from two sources: the variation in the partial spontaneous fission half-lives for isotones and the large gap in the alpha Q value for isotonic nuclei of hassium and darmstadtium. For spontaneous fission, it is necessary to measure the half-lives for the isotonic nuclei 268Sg, 270Hs and 272Ds. Since the isotopes 268Sg and 272Ds are not currently known, and fission of 270Hs has not been measured, this method cannot yet be used to confirm the stabilizing nature of the Z108 shell. Good evidence for the magicity of the Z\n108 shell can nevertheless be found from the large differences in the alpha decay energies measured for 270Hs, 271Ds and 273Ds. More conclusive evidence would come from the determination of the decay energy for the unknown nucleus 272Ds.\n\nPredicted properties\n\nVarious calculations show that hassium should be the heaviest known group 8 element, consistent with the periodic law. Its properties should generally match those expected for a heavier homologue of osmium, with a few deviations arising from relativistic effects.\n\nPhysical and atomic\n\nThe previous members of group 8 have relatively high melting points (Fe, 1538 °C; Ru, 2334 °C; Os, 3033 °C). Much like them, hassium is predicted to be a solid at room temperature, although the melting point of hassium has not been precisely calculated. Hassium should crystallize in the hexagonal close-packed structure (c/a \n 1.59), similarly to its lighter congener osmium. Pure metallic hassium is calculated to have a bulk modulus (resistance to uniform compression) comparable to that of diamond (442 GPa). Hassium is expected to have a bulk density of 40.7 g/cm3, the highest of any of the 118 known elements and nearly twice the density of osmium, the most dense measured element, at 22.61 g/cm3.J.A. Dean (ed), Lange's Handbook of Chemistry (15th Edition), McGraw-Hill, 1999; Section 3; Table 3.2 Physical Constants of Inorganic Compounds This results from hassium's high atomic weight, the lanthanide and actinide contractions, and relativistic effects, although production of enough hassium to measure this quantity would be impractical, and the sample would quickly decay. Osmium is the densest element of the first 6 periods, and its heavier congener hassium is expected to be the densest element of the first 7 periods.\n\nThe atomic radius of hassium is expected to be around 126 pm. Due to the relativistic stabilization of the 7s orbital and destabilization of the 6d orbital, the Hs+ ion is predicted to have an electron configuration of [Rn] 5f14 6d5 7s2, giving up a 6d electron instead of a 7s electron, which is the opposite of the behavior of its lighter homologues. On the other hand, the Hs2+ ion is expected to have an electron configuration of [Rn] 5f14 6d5 7s1, analogous to that calculated for the Os2+ ion.\n\nChemical\n\nHassium is the sixth member of the 6d series of transition metals and is expected to be much like the platinum group metals.  Calculations on its ionization potentials, atomic radius, as well as radii, orbital energies, and ground levels of its ionized states are similar to that of osmium, implying that hassium's properties would resemble those of the other group 8 elements, iron, ruthenium, and osmium.[http://www-win.gsi.de/kernchemie/English/Research/Elements/Element_108_hasssium_eng.htm Element 108, hassium, Hs] Some of these properties were confirmed by gas-phase chemistry experiments. The group 8 elements portray a wide variety of oxidation states, but ruthenium and osmium readily portray their group oxidation state of +8 (the second-highest known oxidation state for any element, which is very rare for other elements) and this state becomes more stable as the group is descended. Thus hassium is expected to form a stable +8 state. Analogously to its lighter congeners, hassium is expected to also show other stable lower oxidation states, such as +6, +5, +4, +3, and +2. Indeed, hassium(IV) is expected to be more stable than hassium(VIII) in aqueous solution.\n\nThe group 8 elements show a very distinctive oxide chemistry which allows extrapolations to be made easily for hassium. All the lighter members have known or hypothetical tetroxides, MO4. Their oxidising power decreases as one descends the group. FeO4 is not known due to its extraordinarily large electron affinity (the amount of energy released when an electron is added to a neutral atom or molecule to form a negative ion) which results in the formation of the well-known oxoanion ferrate(VI), . Ruthenium tetroxide, RuO4, formed by oxidation of ruthenium(VI) in acid, readily undergoes reduction to ruthenate(VI), . Oxidation of ruthenium metal in air forms the dioxide, RuO2.G.M. Brown & J.H. Butler (1997) New method for the characterization of domain morphology of polymer blends using ruthenium tetroxide staining and low voltage scanning electron microscopy (LVSEM). Polymer 38, (15), 3937–3945. In contrast, osmium burns to form the stable tetroxide, OsO4, which complexes with the hydroxide ion to form an osmium(VIII) -ate complex, [OsO4(OH)2]2−. Therefore, eka-osmium properties for hassium should be demonstrated by the formation of a stable, very volatile tetroxide HsO4, which undergoes complexation with hydroxide to form a hassate(VIII), [HsO4(OH)2]2−. Ruthenium tetroxide and osmium tetroxide are both volatile, due to their symmetrical tetrahedral molecular geometry and their being charge-neutral; hassium tetroxide should similarly be a very volatile solid. The trend of the volatilities of the group 8 tetroxides is known to be RuO4 4 > HsO4, which completely confirms the calculated results. In particular, the calculated enthalpies of adsorption (the energy required for the adhesion of atoms, molecules, or ions from a gas, liquid, or dissolved solid to a surface) of HsO4, −(45.4 ± 1) kJ·mol−1 on quartz, agrees very well with the experimental value of −(46 ± 2) kJ·mol−1.\n\nExperimental chemistry\n\nDespite the fact that the selection of a volatile hassium compound (hassium tetroxide) for gas-phase chemical studies was clear from the beginning, the chemical characterization of hassium was considered a difficult task for a long time. Although hassium isotopes were first synthesized in 1984, it was not until 1996 that a hassium isotope long-lived enough to allow chemical studies to be performed was synthesized. Unfortunately, this hassium isotope, 269Hs, was then synthesized indirectly from the decay of 277Cn; not only are indirect synthesis methods not favourable for chemical studies, but also the reaction that produced the isotope 277Cn had a low yield (its cross-section was only 1 pb), and thus did not provide enough hassium atoms for a chemical investigation. The direct synthesis of 269Hs and 270Hs in the reaction 248Cm(26Mg,xn)274−xHs (x \n 4 or 5) appeared more promising, as the cross-section for this reaction was somewhat larger, at 7 pb. This yield was still around ten times lower than that for the reaction used for the chemical characterization of bohrium. New techniques for irradiation, separation, and detection had to be introduced before hassium could be successfully characterized chemically as a typical member of group 8 in early 2001.\n\nRuthenium and osmium have very similar chemistry due to the lanthanide contraction, but iron shows some differences from them: for example, although ruthenium and osmium form stable tetroxides in which the metal is in the +8 oxidation state, iron does not. Consequently, in preparation for the chemical characterization of hassium, researches focused on ruthenium and osmium rather than iron, as hassium was expected to also be similar to ruthenium and osmium due to the actinide contraction. Nevertheless, in the planned experiment to study hassocene (Hs(C5H5)2), ferrocene may also be used for comparison along with ruthenocene and osmocene.\n\nThe first chemistry experiments were performed using gas thermochromatography in 2001, using 172Os and 173Os as a reference. During the experiment, 5 hassium atoms were synthesized using the reaction 248Cm(26Mg,5n)269Hs. They were then thermalized and oxidized in a mixture of helium and oxygen gas to form the tetroxide.\n\n269Hs + 2 O2 → 269HsO4\n\nThe measured deposition temperature indicated that hassium(VIII) oxide is less volatile than osmium tetroxide, OsO4, and places hassium firmly in group 8. However, the enthalpy of adsorption for HsO4 measured, (−46 ± 2) kJ/mol, was significantly lower than what was predicted, (−36.7 ± 1.5) kJ/mol, indicating that OsO4 was more volatile than HsO4, contradicting earlier calculations, which implied that they should have very similar volatilities. For comparison, the value for OsO4 is (−39 ± 1) kJ/mol. It is possible that hassium tetroxide interacts differently with the different chemicals (silicon nitride and silicon dioxide) used for the detector; further research is required, including more accurate measurements of the nuclear properties of 269Hs and comparisons with RuO4 in addition to OsO4.\n\nIn 2004 scientists reacted hassium tetroxide and sodium hydroxide to form sodium hassate(VIII), a reaction well-known with osmium. This was the first acid-base reaction with a hassium compound, forming sodium hassate(VIII):[http://www.gsi.de/informationen/wti/library/scientificreport2003/files/172.pdf CALLISTO result] \n\n+ 2 NaOH → \n\nThe team from the University of Mainz were planning to study the electrodeposition of hassium atoms using the new TASCA facility at the GSI. Their aim was to use the reaction 226Ra(48Ca,4n)270Hs.[http://www-win.gsi.de/tasca08/contributions/TASCA08_Cont_Kratz.pdf Electrodeposition experiments with hassium], J. Even et al., TASCA 08, 7th Workshop Recoil Separator for Superheavy Element Chemistry October 31, 2008, GSI, Darmstadt, Germany In addition, scientists at the GSI were hoping to utilize TASCA to study the synthesis and properties of the hassium(II) compound hassocene, Hs(C5H5)2, using the reaction 226Ra(48Ca,xn). This compound is analogous to the lighter ferrocene, ruthenocene, and osmocene, and is expected to have the two cyclopentadienyl rings in an eclipsed conformation like ruthenocene and osmocene and not in a staggered conformation like ferrocene. Hassocene was chosen because it has hassium in the low formal oxidation state of +2 (although the bonding between the metal and the rings is mostly covalent in metallocenes) rather than the high +8 state which had previously been investigated, and relativistic effects were expected to be stronger in the lower oxidation state. Many metals in the periodic table form metallocenes, so that trends could be more easily determined, and the highly symmetric structure of hassocene and its low number of atoms also make relativistic calculations easier. Hassocene should be a stable and highly volatile compound.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hassium" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13764" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hassium is a synthetic chemical element with symbol Hs and atomic number 108. It is named after the German state of Hesse. It is a synthetic element and radioactive; the most stable known isotope, 270Hs, has a half-life of approximately 10 seconds. More than 100 atoms of hassium have been synthesized to date.\n\nIn the periodic table of the elements, it is a d-block transactinide element. Hassium is a member of the 7th period and belongs to the group 8 elements: it is thus the sixth member of the 6d series of transition metals. Chemistry experiments have confirmed that hassium behaves as the heavier homologue to osmium in group 8. The chemical properties of hassium are characterized only partly, but they compare well with the chemistry of the other group 8 elements. In bulk quantities, hassium is expected to be a silvery metal that reacts readily with oxygen in the air, forming a volatile tetroxide.\n\nHistory\n\nThe synthesis of element 108 was first attempted in 1978 by a Russian research team led by Yuri Oganessian and Vladimir Utyonkov at the Joint Institute for Nuclear Research (JINR) in Dubna, using reactions that would generate the isotopes hassium-270 and hassium-264. The data was uncertain and they carried out new experiments on hassium five years later, where these two isotopes as well as hassium-263 were produced; the hassium-264 experiment was conducted again and confirmed in 1984.\n\nHassium was officially discovered in 1984 by a German research team led by Peter Armbruster and Gottfried Münzenberg at the Institute for Heavy Ion Research (Gesellschaft für Schwerionenforschung, GSI) in Darmstadt. The team bombarded a target of lead-208 with accelerated nuclei of iron-58 to produce 3 atoms of the isotope hassium-265.\n\nDue to this issue, a controversy arose over who should be recognized as the official discoverer of the element. The IUPAC/IUPAP Transfermium Working Group (TWG) recognised the GSI collaboration as official discoverers in their 1992 report. They stated that the GSI collaboration was \"more detailed and, of itself, carries conviction\", and that while the combined data from Dubna and Darmstadt confirmed that hassium had been synthesized, the major credit was awarded to the GSI. This statement came in spite of the combined data also supporting the Russian 1983 discovery claim and the TWG also acknowledging that \"very probably element 108 played a role in the Dubna experiment.\" For Part I see \n\nThe name hassium was proposed by Peter Armbruster and his colleagues, the officially recognised German discoverers, in September 1992, derived from the Latin name (Hassia) for the German state of Hesse where the institute is located. Using Mendeleev's nomenclature for unnamed and undiscovered elements, hassium should be known as eka-osmium. In 1979, during the Transfermium Wars (but before the synthesis of hassium), IUPAC published recommendations according to which the element was to be called unniloctium (with the corresponding symbol of Uno), a systematic element name as a placeholder, until the element was discovered (and the discovery then confirmed) and a permanent name was decided on. Although widely used in the chemical community on all levels, from chemistry classrooms to advanced textbooks, the recommendations were mostly ignored among scientists in the field, who either called it \"element 108\", with the symbol of E108, (108), or even simply 108, or used the proposed name \"hassium\".\n\nIn 1994 a committee of IUPAC recommended that element 108 be named hahnium (Hn) after the German physicist Otto Hahn, after an older suggestion of ottohahnium (Oh) in spite of the long-standing convention to give the discoverer the right to suggest a name, so that elements named after Hahn and Lise Meitner (meitnerium) would be next to each other, honoring their joint discovery of nuclear fission. This was because they felt that Hesse did not merit an element being named after it. After protests from the German discoverers and the American Chemical Society, IUPAC relented and the name hassium (Hs) was adopted internationally in 1997.\n\nNatural occurrence\n\nHassium is not known to occur naturally on Earth; the half-lives of all its known isotopes are short enough that no primordial hassium would have survived to the present day. This does not rule out the possibility of unknown longer-lived isotopes or nuclear isomers existing, some of which could still exist in trace quantities today if they are long-lived enough. In the early 1960s, it was predicted that long-lived deformed isomers of hassium might occur naturally on Earth in trace quantities. This was theorized in order to explain the extreme radiation damage in some minerals that could not have been caused by any known natural radioisotopes, but could have been caused by superheavy elements.\n\nIn 1963, Soviet scientist Victor Cherdyntsev, who had previously claimed the existence of primordial curium-247, claimed to have discovered element 108 (specifically, the 267Hs isotope, which supposedly had a half-life of 400 to 500 million years) in natural molybdenite and suggested the name sergenium (symbol Sg; at the time, this symbol had not yet been taken by seaborgium) for it, after the ancient city of Serik along the Silk Road in Kazakhstan where his molybdenite samples came from. His rationale for claiming that sergenium was the heavier homologue to osmium was that minerals supposedly containing sergenium formed volatile oxides when boiled in nitric acid, similarly to osmium. His findings were criticized by V. M. Kulakov on the grounds that some of the properties Cherdyntsev claimed sergenium had were inconsistent with the then-current nuclear physics.\n\nThe chief questions raised by Kulakov were that the claimed alpha decay energy of sergenium was many orders of magnitude lower than expected and the half-life given was eight orders of magnitude shorter than what would be predicted for a nuclide alpha decaying with the claimed decay energy, but at the same time a corrected half-life in the region of 1016 years would be impossible as it would imply that the samples contained about 100 milligrams of sergenium. In 2003 it was suggested that the observed alpha decay with energy 4.5 MeV could be due to a low-energy and strongly enhanced transition between different hyperdeformed states of a hassium isotope around 271Hs, thus suggesting that the existence of superheavy elements in nature was at least possible, although unlikely.\n\nIn 2004, the Joint Institute for Nuclear Research conducted a search for natural hassium. This was done underground to avoid interference and false positives from cosmic rays, but no results have been released, strongly implying that no natural hassium was found. The possible extent of primordial hassium on Earth is uncertain; it might now only exist in traces, or could even have completely decayed by now after having caused the radiation damage long ago.\n\nIn 2006, it was hypothesized that an isomer of 271Hs might have a half-life of around (2.5±0.5)×108 y, which would explain the observation of alpha particles with energies of around 4.4 MeV in some samples of molybdenite and osmiridium. This isomer of 271Hs could be produced from the beta decay of 271Bh and 271Sg, which, being homologous to rhenium and molybdenum respectively, should occur in molybdenite along with rhenium and molybdenum if they occurred in nature. Since hassium is homologous to osmium, it should also occur along with osmium in osmiridium if it occurred in nature. The decay chains of 271Bh and 271Sg are very hypothetical and the predicted half-life of this hypothetical hassium isomer is not long enough for any sufficient quantity to remain on Earth. It is possible that more 271Hs may be deposited on the Earth as the Solar System travels through the spiral arms of the Milky Way, which would also explain excesses of plutonium-239 found on the floors of the Pacific Ocean and the Gulf of Finland, but minerals enriched with 271Hs are predicted to also have excesses of uranium-235 and lead-207, and would have different proportions of elements that are formed during spontaneous fission, such as krypton, zirconium, and xenon. Thus, the occurrence of hassium in nature in minerals such as molybdenite and osmiride is theoretically possible, but highly unlikely.\n\nIsotopes\n\nHassium has no stable or naturally occurring isotopes. Several radioactive isotopes have been synthesized in the laboratory, either by fusing two atoms or by observing the decay of heavier elements. Twelve different isotopes have been reported with atomic masses from 263 to 277 (with the exceptions of 272, 274, and 276), three of which, hassium-265, hassium-267, hassium-269, have known metastable states. Most of these decay predominantly through alpha decay, but some also undergo spontaneous fission.\n\nThe lightest isotopes, which usually have shorter half-lives were synthesized by direct fusion between two lighter nuclei and as decay products. The heaviest isotope produced by direct fusion is 271Hs; heavier isotopes have only been observed as decay products of elements with larger atomic numbers. In 1999, American scientists at the University of California, Berkeley, announced that they had succeeded in synthesizing three atoms of 293Og. These parent nuclei were reported to have successively emitted three alpha particles to form hassium-273 nuclei, which were claimed to have undergone an alpha decay, emitting alpha particles with decay energies of 9.78 and 9.47 MeV and half-life 1.2 s, but their claim was retracted in 2001. The isotope was successfully produced in 2010 by the same team. The new data matched the previous (fabricated)[https://www.nytimes.com/2002/10/15/science/at-lawrence-berkeley-physicists-say-a-colleague-took-them-for-a-ride.html?scp2&sq\nvictor%20ninov&stcse&pagewanted\n1 At Lawrence Berkeley, Physicists Say a Colleague Took Them for a Ride] George Johnson, The New York Times, 15 October 2002 data.\n\n270Hs: prospects for a deformed doubly magic nucleus\n\nAccording to calculations, 108 is a proton magic number for deformed nuclei (nuclei that are far from spherical), and 162 is a neutron magic number for deformed nuclei. This means that such nuclei are permanently deformed in their ground state but have high, narrow fission barriers to further deformation and hence relatively long life-times to spontaneous fission. The spontaneous fission half-lives in this region are typically reduced by a factor of 109 in comparison with those in the vicinity of the spherical doubly magic nucleus 298Fl, caused by the narrower fission barrier for such deformed nuclei. Hence, the nucleus 270Hs has promise as a deformed doubly magic nucleus. Experimental data from the decay of the darmstadtium (Z\n110) isotopes 271Ds and 273Ds provides strong evidence for the magic nature of the N162 sub-shell. The syntheses of 269Hs, 270Hs, and 271Hs also fully support the assignment of N\n162 as a magic number. In particular, the low decay energy for 270Hs is in complete agreement with calculations.\n\nEvidence for the magicity of the Z108 proton shell can be obtained from two sources: the variation in the partial spontaneous fission half-lives for isotones and the large gap in the alpha Q value for isotonic nuclei of hassium and darmstadtium. For spontaneous fission, it is necessary to measure the half-lives for the isotonic nuclei 268Sg, 270Hs and 272Ds. Since the isotopes 268Sg and 272Ds are not currently known, and fission of 270Hs has not been measured, this method cannot yet be used to confirm the stabilizing nature of the Z108 shell. Good evidence for the magicity of the Z\n108 shell can nevertheless be found from the large differences in the alpha decay energies measured for 270Hs, 271Ds and 273Ds. More conclusive evidence would come from the determination of the decay energy for the unknown nucleus 272Ds.\n\nPredicted properties\n\nVarious calculations show that hassium should be the heaviest known group 8 element, consistent with the periodic law. Its properties should generally match those expected for a heavier homologue of osmium, with a few deviations arising from relativistic effects.\n\nPhysical and atomic\n\nThe previous members of group 8 have relatively high melting points (Fe, 1538 °C; Ru, 2334 °C; Os, 3033 °C). Much like them, hassium is predicted to be a solid at room temperature, although the melting point of hassium has not been precisely calculated. Hassium should crystallize in the hexagonal close-packed structure (c/a \n 1.59), similarly to its lighter congener osmium. Pure metallic hassium is calculated to have a bulk modulus (resistance to uniform compression) comparable to that of diamond (442 GPa). Hassium is expected to have a bulk density of 40.7 g/cm3, the highest of any of the 118 known elements and nearly twice the density of osmium, the most dense measured element, at 22.61 g/cm3.J.A. Dean (ed), Lange's Handbook of Chemistry (15th Edition), McGraw-Hill, 1999; Section 3; Table 3.2 Physical Constants of Inorganic Compounds This results from hassium's high atomic weight, the lanthanide and actinide contractions, and relativistic effects, although production of enough hassium to measure this quantity would be impractical, and the sample would quickly decay. Osmium is the densest element of the first 6 periods, and its heavier congener hassium is expected to be the densest element of the first 7 periods.\n\nThe atomic radius of hassium is expected to be around 126 pm. Due to the relativistic stabilization of the 7s orbital and destabilization of the 6d orbital, the Hs+ ion is predicted to have an electron configuration of [Rn] 5f14 6d5 7s2, giving up a 6d electron instead of a 7s electron, which is the opposite of the behavior of its lighter homologues. On the other hand, the Hs2+ ion is expected to have an electron configuration of [Rn] 5f14 6d5 7s1, analogous to that calculated for the Os2+ ion.\n\nChemical\n\nHassium is the sixth member of the 6d series of transition metals and is expected to be much like the platinum group metals.  Calculations on its ionization potentials, atomic radius, as well as radii, orbital energies, and ground levels of its ionized states are similar to that of osmium, implying that hassium's properties would resemble those of the other group 8 elements, iron, ruthenium, and osmium.[http://www-win.gsi.de/kernchemie/English/Research/Elements/Element_108_hasssium_eng.htm Element 108, hassium, Hs] Some of these properties were confirmed by gas-phase chemistry experiments. The group 8 elements portray a wide variety of oxidation states, but ruthenium and osmium readily portray their group oxidation state of +8 (the second-highest known oxidation state for any element, which is very rare for other elements) and this state becomes more stable as the group is descended. Thus hassium is expected to form a stable +8 state. Analogously to its lighter congeners, hassium is expected to also show other stable lower oxidation states, such as +6, +5, +4, +3, and +2. Indeed, hassium(IV) is expected to be more stable than hassium(VIII) in aqueous solution.\n\nThe group 8 elements show a very distinctive oxide chemistry which allows extrapolations to be made easily for hassium. All the lighter members have known or hypothetical tetroxides, MO4. Their oxidising power decreases as one descends the group. FeO4 is not known due to its extraordinarily large electron affinity (the amount of energy released when an electron is added to a neutral atom or molecule to form a negative ion) which results in the formation of the well-known oxoanion ferrate(VI), . Ruthenium tetroxide, RuO4, formed by oxidation of ruthenium(VI) in acid, readily undergoes reduction to ruthenate(VI), . Oxidation of ruthenium metal in air forms the dioxide, RuO2.G.M. Brown & J.H. Butler (1997) New method for the characterization of domain morphology of polymer blends using ruthenium tetroxide staining and low voltage scanning electron microscopy (LVSEM). Polymer 38, (15), 3937–3945. In contrast, osmium burns to form the stable tetroxide, OsO4, which complexes with the hydroxide ion to form an osmium(VIII) -ate complex, [OsO4(OH)2]2−. Therefore, eka-osmium properties for hassium should be demonstrated by the formation of a stable, very volatile tetroxide HsO4, which undergoes complexation with hydroxide to form a hassate(VIII), [HsO4(OH)2]2−. Ruthenium tetroxide and osmium tetroxide are both volatile, due to their symmetrical tetrahedral molecular geometry and their being charge-neutral; hassium tetroxide should similarly be a very volatile solid. The trend of the volatilities of the group 8 tetroxides is known to be RuO4 4 > HsO4, which completely confirms the calculated results. In particular, the calculated enthalpies of adsorption (the energy required for the adhesion of atoms, molecules, or ions from a gas, liquid, or dissolved solid to a surface) of HsO4, −(45.4 ± 1) kJ·mol−1 on quartz, agrees very well with the experimental value of −(46 ± 2) kJ·mol−1.\n\nExperimental chemistry\n\nDespite the fact that the selection of a volatile hassium compound (hassium tetroxide) for gas-phase chemical studies was clear from the beginning, the chemical characterization of hassium was considered a difficult task for a long time. Although hassium isotopes were first synthesized in 1984, it was not until 1996 that a hassium isotope long-lived enough to allow chemical studies to be performed was synthesized. Unfortunately, this hassium isotope, 269Hs, was then synthesized indirectly from the decay of 277Cn; not only are indirect synthesis methods not favourable for chemical studies, but also the reaction that produced the isotope 277Cn had a low yield (its cross-section was only 1 pb), and thus did not provide enough hassium atoms for a chemical investigation. The direct synthesis of 269Hs and 270Hs in the reaction 248Cm(26Mg,xn)274−xHs (x \n 4 or 5) appeared more promising, as the cross-section for this reaction was somewhat larger, at 7 pb. This yield was still around ten times lower than that for the reaction used for the chemical characterization of bohrium. New techniques for irradiation, separation, and detection had to be introduced before hassium could be successfully characterized chemically as a typical member of group 8 in early 2001.\n\nRuthenium and osmium have very similar chemistry due to the lanthanide contraction, but iron shows some differences from them: for example, although ruthenium and osmium form stable tetroxides in which the metal is in the +8 oxidation state, iron does not. Consequently, in preparation for the chemical characterization of hassium, researches focused on ruthenium and osmium rather than iron, as hassium was expected to also be similar to ruthenium and osmium due to the actinide contraction. Nevertheless, in the planned experiment to study hassocene (Hs(C5H5)2), ferrocene may also be used for comparison along with ruthenocene and osmocene.\n\nThe first chemistry experiments were performed using gas thermochromatography in 2001, using 172Os and 173Os as a reference. During the experiment, 5 hassium atoms were synthesized using the reaction 248Cm(26Mg,5n)269Hs. They were then thermalized and oxidized in a mixture of helium and oxygen gas to form the tetroxide.\n\n269Hs + 2 O2 → 269HsO4\n\nThe measured deposition temperature indicated that hassium(VIII) oxide is less volatile than osmium tetroxide, OsO4, and places hassium firmly in group 8. However, the enthalpy of adsorption for HsO4 measured, (−46 ± 2) kJ/mol, was significantly lower than what was predicted, (−36.7 ± 1.5) kJ/mol, indicating that OsO4 was more volatile than HsO4, contradicting earlier calculations, which implied that they should have very similar volatilities. For comparison, the value for OsO4 is (−39 ± 1) kJ/mol. It is possible that hassium tetroxide interacts differently with the different chemicals (silicon nitride and silicon dioxide) used for the detector; further research is required, including more accurate measurements of the nuclear properties of 269Hs and comparisons with RuO4 in addition to OsO4.\n\nIn 2004 scientists reacted hassium tetroxide and sodium hydroxide to form sodium hassate(VIII), a reaction well-known with osmium. This was the first acid-base reaction with a hassium compound, forming sodium hassate(VIII):[http://www.gsi.de/informationen/wti/library/scientificreport2003/files/172.pdf CALLISTO result] \n\n+ 2 NaOH → \n\nThe team from the University of Mainz were planning to study the electrodeposition of hassium atoms using the new TASCA facility at the GSI. Their aim was to use the reaction 226Ra(48Ca,4n)270Hs.[http://www-win.gsi.de/tasca08/contributions/TASCA08_Cont_Kratz.pdf Electrodeposition experiments with hassium], J. Even et al., TASCA 08, 7th Workshop Recoil Separator for Superheavy Element Chemistry October 31, 2008, GSI, Darmstadt, Germany In addition, scientists at the GSI were hoping to utilize TASCA to study the synthesis and properties of the hassium(II) compound hassocene, Hs(C5H5)2, using the reaction 226Ra(48Ca,xn). This compound is analogous to the lighter ferrocene, ruthenocene, and osmocene, and is expected to have the two cyclopentadienyl rings in an eclipsed conformation like ruthenocene and osmocene and not in a staggered conformation like ferrocene. Hassocene was chosen because it has hassium in the low formal oxidation state of +2 (although the bonding between the metal and the rings is mostly covalent in metallocenes) rather than the high +8 state which had previously been investigated, and relativistic effects were expected to be stronger in the lower oxidation state. Many metals in the periodic table form metallocenes, so that trends could be more easily determined, and the highly symmetric structure of hassocene and its low number of atoms also make relativistic calculations easier. Hassocene should be a stable and highly volatile compound. Hassium. http://en.wikipedia.org/?curid=13764."
  }
}
