{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9806",
  "eid" : "f21d0fc0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778485948,
  "textBody" : "Ellis Island, in Upper New York Bay, was the gateway for over 12 million immigrants to the U.S. as the United States' busiest immigrant inspection station for over 60 years from 1892 until 1954. Ellis Island was opened January 1, 1892.  The island was greatly expanded with land reclamation between 1892 and 1934. Before that, the much smaller original island was the site of Fort Gibson and later a naval magazine. The island was made part of the Statue of Liberty National Monument in 1965 and has hosted a museum of immigration since 1990.\n\nIt was long considered part of New York, but a 1998 United States Supreme Court decision found that most of the island is in New Jersey. The south side of the island, home to the Ellis Island Immigrant Hospital, is closed to the general public and the object of restoration efforts spearheaded by Save Ellis Island.\n\nGeography and access\n\nEllis Island is in Upper New York Bay, east of Liberty State Park and north of Liberty Island, in Jersey City, New Jersey, with a small section that is part of New York City. Largely created through land reclamation, the island has a land area of , most of which is part of New Jersey. The  natural island and contiguous areas comprise the  that are part of New York.\n\nThe island has been owned and administered by the federal government of the United States since 1808 and operated by the National Park Service since 1965.\n\nSince the September 11 attacks in 2001, the island is guarded by patrols of the United States Park Police Marine Patrol Unit. Public access is by ferry from either Communipaw Terminal in Liberty State Park or from the Battery at the southern tip of Manhattan. The ferry operator, Hornblower Cruises and Events, also provides service to the nearby Statue of Liberty. A bridge built for transporting materials and personnel during restoration projects connects Ellis Island with Liberty State Park but is not open to the public. The city of New York and the private ferry operator at the time opposed proposals to use it or replace it with a pedestrian bridge.Setha Low, Dana Taplin, Suzanne Sheld (2005) [https://books.google.com/books?idcUhYBCSAYIEC&printsec\nfrontcover&sourcegbs_summary_r&cad\n0#PPP1,M1 Rethinking Urban Parks], University of Texas Press; chapter 4.\n\nMuch of the island, including the entire south side, has been closed to the public since 1954. The renovated area on the north side was again closed to the public after Hurricane Sandy in October 2012. The island was re-opened to the public and the museum partially re-opened on October 28, 2013, after major renovations.\n\nEarly history\n\nOriginally much of the west shore of Upper New York Bay consisted of large tidal flats which hosted vast oyster banks, a major source of food for the Lenape population who lived in the area prior to the arrival of Dutch settlers. There were several islands which were not completely submerged at high tide. Three of them (later to be known as Liberty Island, Black Tom Island and Ellis Island) were given the name Oyster Islands by the settlers of New Netherland, the first European colony in the region. The oyster beds remained a major source of food for nearly three centuries.[http://events.nytimes.com/2006/03/01/books/01grim.html?ftay The New York Times], March 1, 2006, accessed 2008-03-16 Landfilling to build the railyards of the Lehigh Valley Railroad and the Central Railroad of New Jersey eventually obliterated the oyster beds, engulfed one island, and brought the shoreline much closer to the others. During the colonial period, Little Oyster Island was known as Dyre's, then Bucking Island. In the 1760s, after some pirates were hanged from one of the island's scrubby trees, it became known as Gibbet Island.[http://www.libertyellisfoundation.org/ellis-timeline#1900 Ellis Island – Timeline]. The Statue of Liberty-Ellis Island Foundation, Inc. Retrieved 2016-06-22. It was acquired by Samuel Ellis, a colonial New Yorker and merchant possibly from Wales, around the time of the American Revolution. In 1785, he unsuccessfully attempted to sell the island:Moreno, Barry (2001) [http://www.schundler.net/Ellis%20Island%20Chronology%20Timeline.pdf \"Ellis Island Chronology Timeline (1674–2001)\"]. National Park Service, Ellis Island Library. Retrieved 2013-04-24. \n\nThe State of New York leased the island in 1794 and started to fortify it in 1795. Ownership was in question and legislation was passed for acquisition by condemnation in 1807 and then ceded to the United States in 1808. Shortly thereafter the War Department established a circular stone 14-gun battery, a mortar battery (possibly of six mortars), magazine, and barracks.[http://dmna.state.ny.us/forts/fortsE_L/gibsonFort.htm Fort Gibson], New York State Military Museum[http://www.northamericanforts.com/East/nycity2.html#gibson Fort Gibson at American Forts Network] This was part of what was later called the second system of U.S. fortifications. From 1808 until 1814 it was a federal arsenal. The fort was initially called Crown Fort, but by the end of the War of 1812 the battery was named Fort Gibson, after Colonel James Gibson of the 4th Regiment of Riflemen, killed in the Siege of Fort Erie during the war. Parts of the wall foundations of the fort were uncovered while excavating for the Immigrant Wall of Honor, and they are preserved with an interpretive plaque. The island remained a military post for nearly 80 years before it was selected to be a federal immigration station.\n\nImmigrant inspection station\n\nIn the 35 years before Ellis Island opened, more than eight million immigrants arriving in New York City had been processed by officials at Castle Garden Immigration Depot in Lower Manhattan, just across the bay. The federal government assumed control of immigration on April 18, 1890, and Congress appropriated $75,000 to construct America's first federal immigration station on Ellis Island. Artesian wells were dug, and fill material was hauled in from incoming ships' ballast and from construction of New York City's subway tunnels, which doubled the size of Ellis Island to over six acres. While the building was under construction, the Barge Office nearby at the Battery was used for immigrant processing.\n\nThe first station was a three-story-tall structure with outbuildings, built of Georgia Pine, containing the amenities thought to be necessary. It opened with fanfare on January 1, 1892. Three large ships landed on the first day, and 700 immigrants passed over the docks. Almost 450,000 immigrants were processed at the station during its first year. On June 15, 1897, a fire of unknown origin, possibly caused by faulty wiring, turned the wooden structures on Ellis Island into ashes. No loss of life was reported, but most of the immigration records dating back to 1855 were destroyed. About 1.5 million immigrants had been processed at the first building during its five years of use. Plans were immediately made to build a new, fireproof immigration station. During the construction period, passenger arrivals were again processed at the Barge Office. Edward Lippincott Tilton and William A. Boring won the 1897 competition to design the first phase, including the Main Building (1897–1900), Kitchen and Laundry Building (1900–01), Main Powerhouse (1900–01), and the Main Hospital Building (1900–01).\n\nThe present main structure was designed in French Renaissance Revival style and built of red brick with limestone trim. After it opened on December 17, 1900, the facilities proved barely able to handle the flood of immigrants that arrived in the years before World War I. In 1913, writer Louis Adamic came to America from Slovenia, then part of the Austro-Hungarian Empire, and described the night he and many other immigrants slept on bunk beds in a huge hall. Lacking a warm blanket, the young man \"shivered, sleepless, all night, listening to snores\" and dreams \"in perhaps a dozen different languages\". The facility was so large that the dining room could seat 1,000 people. It is reported the island’s first immigrant to be processed through was a teenager named Annie Moore from County Cork in Ireland.\n\nAfter its opening, Ellis Island was again expanded, and additional structures were built. By the time it closed on November 12, 1954, 12 million immigrants had been processed by the U.S. Bureau of Immigration. It is estimated that 10.5 million immigrants departed for points across the United States from the Central Railroad of New Jersey Terminal, just across a narrow strait.[http://www.njcu.edu/programs/jchistory/Pages/C_Pages/Central_Railroad_of_New_Jersey.html Jersey City Past and Present]  Others would have used one of the other terminals along the North River (Hudson River) at that time. At first, the majority of immigrants arriving through the station were Northern and Western Europeans (Germany, France, Switzerland, Belgium, The Netherlands, Great Britain, and the Scandinavian countries). Eventually, these groups of peoples slowed in the rates that they were coming in, and immigrants came in from Southern and Eastern Europe, including Jews. Many reasons these immigrants came to the United States included escaping political and economic oppression, as well as persecution, destitution, and violence. Other groups of peoples being processed through the station were Poles, Hungarians, Czechs, Serbs, Slovaks, Greeks, Syrians, Turks, and Armenians.\n\nPrimary inspection\n\nBetween 1905 and 1914, an average of one million immigrants per year arrived in the United States. Immigration officials reviewed about 5,000 immigrants per day during peak times at Ellis Island.Harlan D. Unrau, Ellis Island Historic Resource Study (Denver: U.S. Dept. of the Interior, National Park Service, 1984). Two-thirds of those individuals emigrated from eastern, southern and central Europe.Introduction to Immigration from 1905-1945: Immigration and Multiculturalism: Essential Primary Sources, 2006 The peak year for immigration at Ellis Island was 1907, with 1,004,756 immigrants processed. The all-time daily high occurred on April 17, 1907, when 11,747 immigrants arrived. After the Immigration Act of 1924 was passed, which greatly restricted immigration and allowed processing at overseas embassies, the only immigrants to pass through the station were those who had problems with their immigration paperwork, displaced persons, and war refugees.The Brown Quarterly, [http://brownvboard.org/sites/default/files/BQ_Vol4No1.pdf Volume 4, No. 1 (Fall 2000): Ellis Island/Immigration Issue] Today, over 100 million Americans — about one-third to 40% of the population of the United States — can trace their ancestry to immigrants who arrived in America at Ellis Island before dispersing to points all over the country.\n\nGenerally, those immigrants who were approved spent from two to five hours at Ellis Island. Arrivals were asked 29 questions including name, occupation, and the amount of money carried. It was important to the American government the new arrivals could support themselves and have money to get started. The average the government wanted the immigrants to have was between 18 and 25 dollars ($600 in 2015 adjusted for inflation). Those with visible health problems or diseases were sent home or held in the island's hospital facilities for long periods of time. More than 3,000 would-be immigrants died on Ellis Island while being held in the hospital facilities. Some unskilled workers were rejected because they were considered \"likely to become a public charge.\" About 2% were denied admission to the U.S. and sent back to their countries of origin for reasons such as having a chronic contagious disease, criminal background, or insanity.[http://www.nps.gov/stli/serv02.htm#Ellis National Park Service: Ellis Island], retrieved 2006-01-12. Ellis Island was sometimes known as \"The Island of Tears\" or \"Heartbreak Island\"Davis, Kenneth (2003), Don't Know Much About American History, HarperTrophy,  (\"Isle of Tears\" or \"Heartbreak Island\", p. 123) because of those 2% who were not admitted after the long transatlantic voyage. The Kissing Post is a wooden column outside the Registry Room, where new arrivals were greeted by their relatives and friends, typically with tears, hugs, and kisses.[http://www.ellisislandimmigrants.org/ellis_island_archives.htm Description of Kissing Post's location] [http://www.history.com/minisite.do?content_typeMinisite_Generic&content_type_id\n50231&mini_id=1459 Article and picture of Kissing Post plaque] \n\nDuring World War I, the German sabotage of the Black Tom Wharf ammunition depot damaged buildings on Ellis Island. The repairs included the Main Hall's current barrel-vaulted ceiling.\n\nMedical inspections\n\nTo support the activities of the United States Bureau of Immigration, the United States Public Health Service operated an extensive medical service at the immigrant station, called U.S. Marine Hospital Number 43, more widely known as the Ellis Island Immigrant Hospital. It was the nation's largest marine hospital. Uniformed military surgeons staffed the medical division, which was active in the hospital wards, the Barge Office at the Battery and the Main Building. They are best known for the role they played during the line inspection, in which they employed unusual techniques such as the use of the buttonhook to examine immigrants for signs of eye diseases (particularly, trachoma) and the use of a chalk mark code. Symbols were chalked on the clothing of potentially sick immigrants following the six-second medical examination. The doctors would look at the immigrants as they climbed the stairs from the baggage area to the Great Hall. Immigrants' behavior would be studied for difficulties in getting up the staircase. Some immigrants supposedly entered the country by surreptitiously wiping the chalk marks off, or by turning their clothes inside out.\n\nThe symbols used were:\n\n* B – Back\n* C – Conjunctivitis\n* TC – Trachoma\n* E – Eyes\n* F – Face\n* FT – Feet\n* G – Goiter\n* H – Heart\n* K – Hernia\n* L – Lameness\n* N – Neck\n* P – Physical and Lungs\n* PG – Pregnancy\n* S – Senility\n* SC – Scalp (Favus)\n* X – Suspected Mental defect\n* ⓧ – Definite signs of Mental defect\n\nU.S. Immigrant Inspectors used some other symbols or marks as they interrogated immigrants in the Registry Room to determine whether to admit or detain them, including:\n\n* SI – Special Inquiry\n* IV – Immigrant Visa\n* LPC – Likely or Liable to become a Public Charge\n* Med. Cert. – Medical certificate issued\n\nEugenic influence\n\nMany of the people immigrating to America hailed from Europe, with Eastern Europe and Southern European immigrants being the primary groups. During this time period, eugenic ideals gained broad popularity and made heavy impact on immigration to the United States by way of exclusion of disabled and \"morally defective\" people.\n\nEugenicists of the late 19th and early 20th century believed reproductive selection should be carried out by the state as a collective decision. For many eugenicists, this was considered a patriotic duty as they held an interest in creating a greater national race. Henry Fairfield Osborn's opening words to the New York Evening Journal in 1911 were, \"As a biologist as well as a patriot...,\" on the subject on advocating for tighter inspections of immigrants of the United States.\n\nEugenic selection occurred on two distinguishable levels:\n* State/Local levels which handles institutionalization and sterilization of those considered defective as well as the education of the public, marriage laws, and social pressures such as fitter family and better baby contests.\n* Immigration control, the screening of immigrants for defects, was notably supported by Harry Laughlin, superintendent of the Eugenics Record Office from 1910 to 1939, who stated that this was where the \"federal government must cooperate.\"\nAt the time, it was a broadly popular idea that immigration policies had ought to be based off eugenics principles in order to help create a \"superior race\" in America. To do this, defective persons needed to be screened by immigration officials and denied entry on the basis of their disability.\n\nTypes of defects screened for included:\n* Physical: people who had hereditary or acquired physical disability. These included sickness and disease, deformity, lack of limbs, being abnormally tall or short, feminization, and so forth.\n* Mental: people who showed signs or history of mental illness and intellectual disability. These included \"feeblemindedness\", \"imbecility\", depression, and other illnesses that stemmed from the brain such as epilepsy and cerebral palsy.\n* Moral: people who had moral defects at the time were, but not limited to: homosexuals and those of illicit sexuality, criminals, impoverished, and other groups associated with \"degeneracy\" that deviated from the considered norm or American society at the time.\n\nThe people with moral or mental disability were of higher concern to officials and under the law, mandatorily excluded from immigrating to the United States. Persons with physical disability were under higher inspection and could be turned way on the basis of their disability. Much of this came in part of the eugenicist belief that defects were hereditary, especially those of the moral and mental nature those these were often outwardly signified by physical deformity as well.\n\nIn 1898, a Chicago surgeon named Eugene S. Talbot (Eugene Solomon) wrote \"crime is hereditary, a tendency which is, in most cases, associated with bodily defects.\" Likewise, George Lydston, a medicine and criminal anthropology professor, argued further in 1906 that people with \"defective physique\" were not just criminally associated but that defectiveness was a primary factor \"in the causation of crime.\"\n\nBetween 1891 and 1930, Ellis Island reviewed over 25 million attempted immigrations. Of this 25 million, 700,000 were given certificates of disability or disease and of these 79,000 were barred from entry. Approximately 4.4% of immigrants between 1909 and 1930 were classified as disabled or diseased per with 11% being deported when this number spiked to 8.0% in the years of 1918-1919. One percent of immigrants were deported yearly due to medical causes.Wilson, Daniel J. [https://academic.oup.com/maghis/article-abstract/23/3/35/967400/No-Defectives-Need-Apply-Disability-and?redirectedFrom=fulltext \"'No Defectives Need Apply': Disability and Immigration\"], OAH Magazine of History, Volume 23, Issue 3, July 1, 2009, pp. 35–40. Accessed 2017-10-19. \"The Public Health Service, which ran the immigration inspections at Ellis Island and elsewhere, examined over 25 million potential immigrants between 1891 and 1930.... Only 700,000 were issued medical certificates indicating a disease or disability.... The Immigration Service, which made the final decision on entry and deportation, refused entry to approximately 79,000 of those receiving medical certificates.\"\n\nDetention and deportation station\n\nWith the passing of the Immigrant Quota Act of 1921, the number of immigrants being allowed into the United States declined greatly. The passing of the bill ended the era of mass immigration. After 1924, Ellis Island became primarily a detention and deportation processing station.\n\nDuring and immediately following World War II, Ellis Island was used to hold German merchant mariners and \"enemy aliens\"—Axis nationals detained for fear of spying, sabotage, and other fifth column activity. In December 1941, Ellis Island held 279 Japanese, 248 Germans, and 81 Italians removed from the East Coast.J. Burton, M. Farrell, F. Lord, R. Lord. Confinement and Ethnicity: An Overview of World War II Japanese American Relocation Sites [http://www.cr.nps.gov/history/online_books/anthropology74/ce17a.htm \"Department of Justice and U.S. Army Facilities: Temporary Detention Stations\"] (National Park Service)   Unlike other wartime immigration detention stations, Ellis Island was designated as a permanent holding facility and was used to hold foreign nationals throughout the war.[http://encyclopedia.densho.org/Ellis%20Island%20%28detention%20facility%29/ \"Ellis Island\"] Densho Encyclopedia (accessed 2014-06-11) A total of 7,000 Germans, Italians and Japanese would be ultimately detained at Ellis Island.  It was also a processing center for returning sick or wounded U.S. soldiers, and a Coast Guard training base. Ellis Island still managed to process tens of thousands of immigrants per year during this time, but many fewer than the hundreds of thousands per year who arrived before the war. After the war, immigration rapidly returned to earlier levels.\n\nThe Internal Security Act of 1950 barred members of communist or fascist organizations from immigrating to the United States. Ellis Island saw detention peak at 1,500, but by 1952, after changes to immigration laws and policies, only 30 detainees remained.\n\nOne of the last detainees was the Indonesian Aceh separatist Hasan di Tiro who, while a student in New York in 1953, declared himself the \"foreign minister\" of the rebellious Darul Islam movement. Due to this action, he was immediately stripped of his Indonesian citizenship, causing him to be imprisoned for a few months on Ellis Island as \"an illegal alien.\"\n\nStaff\n\nThe station's commissioners were:\n\n# 1890–1893 Colonel John B. Weber (Republican)\n# 1893–1897 Dr. Joseph H. Senner (Democrat)\n# 1898–1902 Thomas Fitchie (Republican)\n# 1902–1905 William Williams (Republican)\n# 1905–1909 Robert Watchorn (Republican)\n# 1909–1913 William Williams (Republican), 2nd term\n# 1914–1919 Dr. Frederic C. Howe (Democrat)\n# 1920–1921 Frederick A. Wallis (Democrat)\n# 1921–1923 Robert E. Tod (Republican)\n# 1923–1926 Henry C. Curran (Republican)\n# 1926–1931 Benjamin M. Day (Republican)\n# 1931–1934 Edward Corsi (Republican)\n# 1934–1940 Rudolph Reimer (Democrat)\n# 1940–1942 Byron H. Uhl (actual title: district director)\n# 1942–1949 W. Frank Watkins (district director)\n# 1949–1954 Edward J. Shaughnessy (district director)\n\nOther notable officials at Ellis Island included James R. O'Beirne (assistant commissioner, 1890–93), Edward F. McSweeney (assistant commissioner, 1893-1902), Joseph E. Murray (assistant commissioner, 1902–09), Byron Uhl (assistant commissioner, 1909-1940), Dr. George W. Stoner (chief surgeon), Augustus Frederick Sherman (chief clerk), Dr. Victor Heiser (surgeon) (surgeon), Dr. Thomas W. Salmon (surgeon), Dr. Howard Knox (surgeon), Antonio Frabasilis (interpreter), Peter Mikolainis (interpreter), Maud Mosher (matron), Fiorello H. La Guardia (interpreter), Samuel Hays, (special immigrant inspector)Roman Dobler (immigrant inspector), Philip Cowen (immigrant inspector) and Philip Forman (immigrant inspector, 1930s; chief of detention, deportation and parole, 1940s, 1950s)\n\nProminent amongst the missionaries and immigrant aid workers were Rev. Michael J. Henry and Rev. Anthony J. Grogan (Irish Catholic), Rev. Gaspare Moretto (Italian Catholic), Alma E. Mathews (Methodist), Rev. Georg Doring (German Lutheran), Rev. Joseph L'Etauche (Polish Catholic), Rev. Reuben Breed (Episcopal), Michael Lodsin (Baptist), Brigadier Thomas Johnson (Salvation Army), Ludmila K. Foxlee (YWCA), Athena Marmaroff (Woman's Christian Temperance Union), Alexander Harkavy (HIAS), and Cecilia Greenstone and Cecilia Razovsky (National Council of Jewish Women).\n\nRecords\n\nA myth persists that government officials on Ellis Island compelled immigrants to take new names against their wishes.[http://www.ancestry.com/learn/library/article.aspx?article=4675 Name Changes at Ellis Island: Fact or Fiction?]\", Ancestry.com. Retrieved 2010-09-29. In fact, no historical records bear this out. Immigration inspectors used the passenger lists they received from the steamship companies to process each foreigner. These were the sole immigration records for entering the country and were prepared not by the U.S. Bureau of Immigration but by steamship companies such as the Cunard Line, the White Star Line, the North German Lloyd Line, the Hamburg-Amerika Line, the Italian Steam Navigation Company, the Red Star Line, the Holland America Line, and the Austro-American Line.[http://149.101.23.2/graphics/aboutus/history/articles/nameessay.html US Dept of Justice]  American Names / Declaring Independence, Marian L. Smith, INS Historian, U.S. Citizenship and Immigration Services, last updated 2006-01-20, accessed 2007-05-22 The Americanization of many immigrant families' surnames was for the most part adopted by the family after the immigration process, or by the second or third generation of the family after some assimilation into American culture. However, many last names were altered slightly because of the disparity between English and other languages in the pronunciation of certain letters of the alphabet.\"[http://life.familyeducation.com/genealogy/family-tree/45352.html The Effect of Immigration on Surnames]\", FamilyEducation.com. Retrieved 2009-02-20. Excerpted from The Complete Idiot's Guide to Genealogy by Christine Rose and Kay Germain Ingalls, 2005.\n\nNotable immigrants\n\nThe first immigrant to pass through Ellis Island was Annie Moore, a 17-year-old girl from Cork, Ireland, who arrived on the ship Nevada on January 1, 1892.[http://www.ellisisland.org/search/passRecord.asp?pID604534030002&MID\n02806987110023700416& Passenger Record: Annie Moore], The Statue of Liberty – Ellis Island Foundation, Inc. Retrieved 2013-04-24. She and her two brothers were coming to America to meet their parents, who had moved to New York two years prior. She received a greeting from officials and a $10 gold coin.[http://www.history.com/minisite.do?content_typeMinisite_Generic&content_type_id\n1460&display_order1&mini_id\n1459 Ellis Island] . p. 3. www.history.com Retrieved 2013-04-24. It was the largest sum of money she had ever owned.\n\nThe last person to pass through Ellis Island was Norwegian merchant seaman Arne Peterssen in 1954.\n\nImmigration museum\n\nThe wooden structure built in 1892 to house the immigration station burned down after five years. The station's new Main Building, which now houses the Immigration Museum, was opened in 1900.\nArchitects Edward Lippincott Tilton and William Alciphron Boring received a gold medal at the 1900 Paris Exposition for the building's design and constructed the building at a cost of $1.5 million.  The architecture competition was the second under the Tarsney Act, which had permitted private architects rather than government architects in the Treasury Department's Office of the Supervising Architect to design federal buildings.Lee, Antoinette J., [https://books.google.com/books?idhjDZz87NF8AC&pg\nPA197&dq%22James+Knox+Taylor%22&sig\nACfU3U0hwyx1_8a6mNHwqC5a6zzs34_E6w#PPA197,M1 Architects to the Nation: The Rise and Decline of the Supervising Architect's Office], Oxford University Press, USA. 2000-04-20. \n\nAfter the immigration station closed in November 1954, the buildings fell into disrepair and were abandoned. Attempts at redeveloping the site were unsuccessful until its landmark status was established. On October 15, 1965, Ellis Island was proclaimed a part of Statue of Liberty National Monument. It was listed on the National Register of Historic Places on October 15, 1966.\n\nBoston-based architectural firm Finegold Alexander + Associates Inc, together with the New York architectural firm Beyer Blinder Belle, designed the restoration and adaptive use of the Beaux-Arts Main Building, one of the most symbolically important structures in American history. A construction budget of $150 million was required for this significant restoration. This money was raised by a campaign organized by the political fundraiser Wyatt A. Stewart.  The building reopened on September 10, 1990. Exhibits include Hearing Room, Peak Immigration Years, the Peopling of America, Restoring a Landmark, Silent Voices, Treasures from Home, and Ellis Island Chronicles.  There are also three theaters used for film and live performances.\n\nOn May 20, 2015, the Ellis Island Immigration Museum was officially renamed the Ellis Island National Museum of Immigration, coinciding with the opening of the new Peopling of America galleries. The expansion tells the entire story of American immigration, including before and after the Ellis Island era. The Peopling of America Center was designed by ESI Design and fabricated by Hadley Exhibits, Inc. The architectural design was done by Highland Associates, with construction executed by Phelps Construction Group.\n\nThe Wall of Honor outside of the main building contains a partial list of immigrants processed on the island. Inclusion on the list is made possible by a donation to support the facility. In 2008 the museum's library was officially named the Bob Hope Memorial Library in honor of one the station's most famous immigrants.\n\nThe Ellis Island Medal of Honor is awarded annually at ceremonies on the island.\n\nSouth side of the island\n\nThe south side of the island, home to the Ellis Island Immigrant Hospital, is closed to the general public and the object of restoration efforts spearheaded by Save Ellis Island.\n\nMany of the facilities at Ellis Island were abandoned and remain unrenovated. The entire south side, called by some the \"sad side\" of the island, is off limits to the general public. The Ellis Island Immigrant Hospital operated here from early 1902 to 1930. The foundation Save Ellis Island is spearheading preservation efforts. The New Ferry Building, built in the Art Deco style to replace an earlier one, was renovated in 2008, but remains only partially accessible to the general public.\n\nAs part of the National Park Service's Centennial Initiative, the south side of the island was to be the target of a project to restore the 28 buildings that have not yet been rehabilitated.\n\nState sovereignty dispute\n\nThe circumstances which led to an exclave of New York being located within New Jersey began in the colonial era, after the British takeover of New Netherland in 1664. An unusual clause in the colonial land grant outlined the territory that the proprietors of New Jersey would receive as being \"westward of Long Island, and Manhitas Island and bounded on the east part by the main sea, and part by Hudson's river\", rather than at the river's midpoint, as was common in other colonial charters.\n\nAttempts were made as early as 1804 to resolve the status of the state line. The City of New York claimed the right to regulate trade on all the waters. This was contested in Gibbons v. Ogden,. which decided that the regulation of interstate commerce fell under the authority of the federal government, thus influencing competition in the newly developing steam ferry service in New York Harbor.\n\nIn 1830, New Jersey planned to bring suit to clarify the border, but the case was never heard. The matter was resolved with a compact between the states, ratified by U.S. Congress in 1834, which set the boundary line between them as the middle of the Hudson River and New York Harbor. This was later confirmed by the U.S. Supreme Court in other cases which also expounded on the compact. \n\nThe federal government, which had bought the island in 1808, began expanding the island by land fill, to accommodate the immigration station opened in 1892. Land filling continued in stages until 1934.\n\nNine-tenths of the current area is artificial island that did not exist at the time of the interstate compact. New Jersey contended that the new extensions were part of New Jersey, since they were outside New York's border and were in fact within New Jersey's border. In 1956, after the 1954 closing of the U.S. immigration station, the then Mayor of Jersey City, Bernard J. Berry, commandeered a U.S. Coast Guard cutter and led a contingent of New Jersey officials on an expedition to claim the island. In 1997, the state filed suit to establish its jurisdiction, leading New York City Mayor Rudolph Giuliani to remark dramatically that his father, an Italian who immigrated through Ellis Island, never intended to go to New Jersey.Sheahan, Matthew. [http://www.knotmag.com/?article=1291 \"My Grandmother Is the Greatest\"] , Knot Magazine, May 4, 2004. The border was redrawn using information based on studies using geographic information science.\n\nThe dispute eventually reached the Supreme Court of the United States, which ruled in New Jersey v. New York  , that New Jersey had jurisdiction over all portions of the island created after the original compact was approved (effectively, more than 80% of the island's present land). This caused several immediate instances of confusion: some buildings, for instance, fell into the territory of both states. New Jersey and New York soon agreed to share jurisdiction of the island. It remains wholly a federal property, however, and these legal decisions do not result in either state taking any fiscal or physical responsibility for the maintenance, preservation, or improvement of any of the historic properties.[http://www.nps.gov/elis/planyourvisit/maps.htm National Park Service map showing portions of the island belonging to New York and New Jersey]  \n\nThe ruling had no effect on the status of Liberty Island,  of which was created by land reclamation.\n\nFor New York State tax purposes, it is assessed as Manhattan Block 1, Lot 201. Since 1998, it also has a tax number assigned by the state of New Jersey.[http://www.silive.com/opinion/editorials/index.ssf/2013/12/an_inaugural_choice_will_nj_go.html An inaugural choice: Will N.J. governor's gala really be in New York?]. \"After the 1998 court event, both states agreed to share jurisdiction, even though the islands remain a wholly federal property. To cement those claims, New York assigned Ellis Island the tax designation of Block 1, Lot 201. The state of New Jersey gave the place its own tax number.\"\n\nRenovations and plans\n\nFrank Lloyd Wright designed a key plan for the island that included housing, hotels, and large domes along the edges. The co-curator of the traveling exhibit, \"Never Built New York\" in which it is included told AM New York, \"It's pretty remarkable but at the same time it's a little bit horrifying that they could have gotten rid of Ellis Island.\"Colangelo, Lisa, \"The City of Fantastical Dreams: How NYC Might Have Been, in Queens,\" AMNY, September 25, 2017, p.A11.\n\nIn 1982 the National Parks Department embarked on an 8-year renovation. During that time, David Simonton was part of The Ellis Island Project: Documentation/Interpretation and captured stunning, black and white photos giving insight into immigrant's lives. Photographer Stephen Wilkes's series Ellis Island: Ghosts of Freedom (2006) captured the abandoned south side of Ellis Island.[http://www.artartworks.com/exhibitions/ellis-island-ghosts-of-freedom/ Ellis Island: Ghosts of Freedom] \n\nEmergency services\n\nEmergency services on Ellis Island are provided by the following emergency divisions of the National Park Service:\n* Police services and security are provided for the island by the United States Park Police.\n* Fire suppression/protection is provided by the National Park Service's Statue of Liberty/Ellis Island Division of Safety and Emergency Management Statue of Liberty Fire Brigade which consists of a crew of federal NPS firefighters who are trained and certified as Structural Firefighter I, Structural Firefighter II or Wildland Firefighters. The crew also provides fire suppression response to nearby Liberty Island. Since the nearest other National Park Service Engine Company is located in Fort Hancock in Sandy Hook, New Jersey, the Statue of Liberty Fire Brigade maintains a mutual aid agreement with the Jersey City Fire Department and the New York City Fire Department for mutual aid assistance on Ellis Island should it be required. The Statue of Liberty/ Ellis Island Division of Safety & Emergency Management staffs the fire brigade. The fire brigade is led by a Fire Captain (crew leader), two Lieutenants and has six collateral duty firefighters.\n* Emergency Medical Services are provided by National Park Services Statue of Liberty/Ellis Island Division of Safety and Emergency Management, which consists of a team of full-time NPS Emergency Medical Technicians and Certified First Responders. Patient transportation is coordinated with Jersey City Medical Center ambulances, but emergency response and patient care falls solely upon the National Park Service Emergency Medical Technicians.\n\nIn popular culture\n\nEllis Island has been a source of inspiration or used as a subject in popular culture. Its imagery or representation has been employed in literature (including novels, short stories and poetry), in song, musical composition, dance, theatre, including vaudeville, burlesque, musical comedy, revue, legitimate theatre, motion pictures (silent and sound), newsreels, and in radio and television.\n\nEarly films, including those from the silent era, which feature the station include Traffic in Souls (1913), How The Jews Care for Their Poor (educational film, 1914) The Yellow Passport (1916), My Boy (1921), Frank Capra's The Strong Man (1926), We Americans (1928), The Mating Call (1928),  This is Heaven (1929), Paddy O'Day (1935), Ellis Island (1936), Gateway (1938), Exile Express (1939), I, Jane Doe (1948), and Gambling House (1951). In The Godfather Part II, Vito Corleone immigrates via Ellis Island as a boy. The opening scene of The Brother From Another Planet is set there. The island is visited by the characters in the 2005 romantic comedy, Hitch, and is the setting for the climactic battle in X-Men.\n\nOver the decades, Ellis Island was also widely referenced or remarked on in books, such as Mrs 'Arris Goes to New York (1960) by Paul Gallico, and in popular films such as Cafe Metropole (1937) and With a Song in My Heart (1952).\n\nSome films have focused on the immigrant experience, such as the 1984 TV miniseries Ellis Island. The IMAX 3D movie [http://www.imdb.com/title/tt0112286/ Across the Sea of Time] incorporates both modern footage and historical photographs of Ellis Island. The 2006 Italian movie The Golden Door, directed by Emanuele Crialese, takes place largely on Ellis Island. Forgotten Ellis Island, a film and book, focuses on the Ellis Island Immigrant Hospital.Conway, Lorie, [https://books.google.com/books?id7dK7cIsVfmEC&printsec\nfrontcover Forgotten Ellis Island : the extraordinary story of America’s immigrant hospital], New York : Smithsonian Books : Collins, 2007.  The Immigrant is a 2013 American drama film directed by James Gray, starring Marion Cotillard, Joaquin Phoenix, and Jeremy Renner. Ellis, a short, premiered in November 2015.\n\nEllis Island as a port of entry is described in detail in Mottel the Cantor's Son by Sholom Aleichem.\n\nEllis Island: The Dream of America is a work for actors and orchestra with projected images by Peter Boyer, composed in 2001-02. The song \"The New Ground - Isle of Hope, Isle of Tears\", on the 2010 album Songs from the Heart by the group Celtic Woman, is about Annie Moore and Ellis Island.\n\nThe USPS issued a 32¢ stamp on February 3, 1998 as part of the Celebrate the Century stamp sheet series.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ellis Island" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9806" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ellis Island, in Upper New York Bay, was the gateway for over 12 million immigrants to the U.S. as the United States' busiest immigrant inspection station for over 60 years from 1892 until 1954. Ellis Island was opened January 1, 1892.  The island was greatly expanded with land reclamation between 1892 and 1934. Before that, the much smaller original island was the site of Fort Gibson and later a naval magazine. The island was made part of the Statue of Liberty National Monument in 1965 and has hosted a museum of immigration since 1990.\n\nIt was long considered part of New York, but a 1998 United States Supreme Court decision found that most of the island is in New Jersey. The south side of the island, home to the Ellis Island Immigrant Hospital, is closed to the general public and the object of restoration efforts spearheaded by Save Ellis Island.\n\nGeography and access\n\nEllis Island is in Upper New York Bay, east of Liberty State Park and north of Liberty Island, in Jersey City, New Jersey, with a small section that is part of New York City. Largely created through land reclamation, the island has a land area of , most of which is part of New Jersey. The  natural island and contiguous areas comprise the  that are part of New York.\n\nThe island has been owned and administered by the federal government of the United States since 1808 and operated by the National Park Service since 1965.\n\nSince the September 11 attacks in 2001, the island is guarded by patrols of the United States Park Police Marine Patrol Unit. Public access is by ferry from either Communipaw Terminal in Liberty State Park or from the Battery at the southern tip of Manhattan. The ferry operator, Hornblower Cruises and Events, also provides service to the nearby Statue of Liberty. A bridge built for transporting materials and personnel during restoration projects connects Ellis Island with Liberty State Park but is not open to the public. The city of New York and the private ferry operator at the time opposed proposals to use it or replace it with a pedestrian bridge.Setha Low, Dana Taplin, Suzanne Sheld (2005) [https://books.google.com/books?idcUhYBCSAYIEC&printsec\nfrontcover&sourcegbs_summary_r&cad\n0#PPP1,M1 Rethinking Urban Parks], University of Texas Press; chapter 4.\n\nMuch of the island, including the entire south side, has been closed to the public since 1954. The renovated area on the north side was again closed to the public after Hurricane Sandy in October 2012. The island was re-opened to the public and the museum partially re-opened on October 28, 2013, after major renovations.\n\nEarly history\n\nOriginally much of the west shore of Upper New York Bay consisted of large tidal flats which hosted vast oyster banks, a major source of food for the Lenape population who lived in the area prior to the arrival of Dutch settlers. There were several islands which were not completely submerged at high tide. Three of them (later to be known as Liberty Island, Black Tom Island and Ellis Island) were given the name Oyster Islands by the settlers of New Netherland, the first European colony in the region. The oyster beds remained a major source of food for nearly three centuries.[http://events.nytimes.com/2006/03/01/books/01grim.html?ftay The New York Times], March 1, 2006, accessed 2008-03-16 Landfilling to build the railyards of the Lehigh Valley Railroad and the Central Railroad of New Jersey eventually obliterated the oyster beds, engulfed one island, and brought the shoreline much closer to the others. During the colonial period, Little Oyster Island was known as Dyre's, then Bucking Island. In the 1760s, after some pirates were hanged from one of the island's scrubby trees, it became known as Gibbet Island.[http://www.libertyellisfoundation.org/ellis-timeline#1900 Ellis Island – Timeline]. The Statue of Liberty-Ellis Island Foundation, Inc. Retrieved 2016-06-22. It was acquired by Samuel Ellis, a colonial New Yorker and merchant possibly from Wales, around the time of the American Revolution. In 1785, he unsuccessfully attempted to sell the island:Moreno, Barry (2001) [http://www.schundler.net/Ellis%20Island%20Chronology%20Timeline.pdf \"Ellis Island Chronology Timeline (1674–2001)\"]. National Park Service, Ellis Island Library. Retrieved 2013-04-24. \n\nThe State of New York leased the island in 1794 and started to fortify it in 1795. Ownership was in question and legislation was passed for acquisition by condemnation in 1807 and then ceded to the United States in 1808. Shortly thereafter the War Department established a circular stone 14-gun battery, a mortar battery (possibly of six mortars), magazine, and barracks.[http://dmna.state.ny.us/forts/fortsE_L/gibsonFort.htm Fort Gibson], New York State Military Museum[http://www.northamericanforts.com/East/nycity2.html#gibson Fort Gibson at American Forts Network] This was part of what was later called the second system of U.S. fortifications. From 1808 until 1814 it was a federal arsenal. The fort was initially called Crown Fort, but by the end of the War of 1812 the battery was named Fort Gibson, after Colonel James Gibson of the 4th Regiment of Riflemen, killed in the Siege of Fort Erie during the war. Parts of the wall foundations of the fort were uncovered while excavating for the Immigrant Wall of Honor, and they are preserved with an interpretive plaque. The island remained a military post for nearly 80 years before it was selected to be a federal immigration station.\n\nImmigrant inspection station\n\nIn the 35 years before Ellis Island opened, more than eight million immigrants arriving in New York City had been processed by officials at Castle Garden Immigration Depot in Lower Manhattan, just across the bay. The federal government assumed control of immigration on April 18, 1890, and Congress appropriated $75,000 to construct America's first federal immigration station on Ellis Island. Artesian wells were dug, and fill material was hauled in from incoming ships' ballast and from construction of New York City's subway tunnels, which doubled the size of Ellis Island to over six acres. While the building was under construction, the Barge Office nearby at the Battery was used for immigrant processing.\n\nThe first station was a three-story-tall structure with outbuildings, built of Georgia Pine, containing the amenities thought to be necessary. It opened with fanfare on January 1, 1892. Three large ships landed on the first day, and 700 immigrants passed over the docks. Almost 450,000 immigrants were processed at the station during its first year. On June 15, 1897, a fire of unknown origin, possibly caused by faulty wiring, turned the wooden structures on Ellis Island into ashes. No loss of life was reported, but most of the immigration records dating back to 1855 were destroyed. About 1.5 million immigrants had been processed at the first building during its five years of use. Plans were immediately made to build a new, fireproof immigration station. During the construction period, passenger arrivals were again processed at the Barge Office. Edward Lippincott Tilton and William A. Boring won the 1897 competition to design the first phase, including the Main Building (1897–1900), Kitchen and Laundry Building (1900–01), Main Powerhouse (1900–01), and the Main Hospital Building (1900–01).\n\nThe present main structure was designed in French Renaissance Revival style and built of red brick with limestone trim. After it opened on December 17, 1900, the facilities proved barely able to handle the flood of immigrants that arrived in the years before World War I. In 1913, writer Louis Adamic came to America from Slovenia, then part of the Austro-Hungarian Empire, and described the night he and many other immigrants slept on bunk beds in a huge hall. Lacking a warm blanket, the young man \"shivered, sleepless, all night, listening to snores\" and dreams \"in perhaps a dozen different languages\". The facility was so large that the dining room could seat 1,000 people. It is reported the island’s first immigrant to be processed through was a teenager named Annie Moore from County Cork in Ireland.\n\nAfter its opening, Ellis Island was again expanded, and additional structures were built. By the time it closed on November 12, 1954, 12 million immigrants had been processed by the U.S. Bureau of Immigration. It is estimated that 10.5 million immigrants departed for points across the United States from the Central Railroad of New Jersey Terminal, just across a narrow strait.[http://www.njcu.edu/programs/jchistory/Pages/C_Pages/Central_Railroad_of_New_Jersey.html Jersey City Past and Present]  Others would have used one of the other terminals along the North River (Hudson River) at that time. At first, the majority of immigrants arriving through the station were Northern and Western Europeans (Germany, France, Switzerland, Belgium, The Netherlands, Great Britain, and the Scandinavian countries). Eventually, these groups of peoples slowed in the rates that they were coming in, and immigrants came in from Southern and Eastern Europe, including Jews. Many reasons these immigrants came to the United States included escaping political and economic oppression, as well as persecution, destitution, and violence. Other groups of peoples being processed through the station were Poles, Hungarians, Czechs, Serbs, Slovaks, Greeks, Syrians, Turks, and Armenians.\n\nPrimary inspection\n\nBetween 1905 and 1914, an average of one million immigrants per year arrived in the United States. Immigration officials reviewed about 5,000 immigrants per day during peak times at Ellis Island.Harlan D. Unrau, Ellis Island Historic Resource Study (Denver: U.S. Dept. of the Interior, National Park Service, 1984). Two-thirds of those individuals emigrated from eastern, southern and central Europe.Introduction to Immigration from 1905-1945: Immigration and Multiculturalism: Essential Primary Sources, 2006 The peak year for immigration at Ellis Island was 1907, with 1,004,756 immigrants processed. The all-time daily high occurred on April 17, 1907, when 11,747 immigrants arrived. After the Immigration Act of 1924 was passed, which greatly restricted immigration and allowed processing at overseas embassies, the only immigrants to pass through the station were those who had problems with their immigration paperwork, displaced persons, and war refugees.The Brown Quarterly, [http://brownvboard.org/sites/default/files/BQ_Vol4No1.pdf Volume 4, No. 1 (Fall 2000): Ellis Island/Immigration Issue] Today, over 100 million Americans — about one-third to 40% of the population of the United States — can trace their ancestry to immigrants who arrived in America at Ellis Island before dispersing to points all over the country.\n\nGenerally, those immigrants who were approved spent from two to five hours at Ellis Island. Arrivals were asked 29 questions including name, occupation, and the amount of money carried. It was important to the American government the new arrivals could support themselves and have money to get started. The average the government wanted the immigrants to have was between 18 and 25 dollars ($600 in 2015 adjusted for inflation). Those with visible health problems or diseases were sent home or held in the island's hospital facilities for long periods of time. More than 3,000 would-be immigrants died on Ellis Island while being held in the hospital facilities. Some unskilled workers were rejected because they were considered \"likely to become a public charge.\" About 2% were denied admission to the U.S. and sent back to their countries of origin for reasons such as having a chronic contagious disease, criminal background, or insanity.[http://www.nps.gov/stli/serv02.htm#Ellis National Park Service: Ellis Island], retrieved 2006-01-12. Ellis Island was sometimes known as \"The Island of Tears\" or \"Heartbreak Island\"Davis, Kenneth (2003), Don't Know Much About American History, HarperTrophy,  (\"Isle of Tears\" or \"Heartbreak Island\", p. 123) because of those 2% who were not admitted after the long transatlantic voyage. The Kissing Post is a wooden column outside the Registry Room, where new arrivals were greeted by their relatives and friends, typically with tears, hugs, and kisses.[http://www.ellisislandimmigrants.org/ellis_island_archives.htm Description of Kissing Post's location] [http://www.history.com/minisite.do?content_typeMinisite_Generic&content_type_id\n50231&mini_id=1459 Article and picture of Kissing Post plaque] \n\nDuring World War I, the German sabotage of the Black Tom Wharf ammunition depot damaged buildings on Ellis Island. The repairs included the Main Hall's current barrel-vaulted ceiling.\n\nMedical inspections\n\nTo support the activities of the United States Bureau of Immigration, the United States Public Health Service operated an extensive medical service at the immigrant station, called U.S. Marine Hospital Number 43, more widely known as the Ellis Island Immigrant Hospital. It was the nation's largest marine hospital. Uniformed military surgeons staffed the medical division, which was active in the hospital wards, the Barge Office at the Battery and the Main Building. They are best known for the role they played during the line inspection, in which they employed unusual techniques such as the use of the buttonhook to examine immigrants for signs of eye diseases (particularly, trachoma) and the use of a chalk mark code. Symbols were chalked on the clothing of potentially sick immigrants following the six-second medical examination. The doctors would look at the immigrants as they climbed the stairs from the baggage area to the Great Hall. Immigrants' behavior would be studied for difficulties in getting up the staircase. Some immigrants supposedly entered the country by surreptitiously wiping the chalk marks off, or by turning their clothes inside out.\n\nThe symbols used were:\n\n* B – Back\n* C – Conjunctivitis\n* TC – Trachoma\n* E – Eyes\n* F – Face\n* FT – Feet\n* G – Goiter\n* H – Heart\n* K – Hernia\n* L – Lameness\n* N – Neck\n* P – Physical and Lungs\n* PG – Pregnancy\n* S – Senility\n* SC – Scalp (Favus)\n* X – Suspected Mental defect\n* ⓧ – Definite signs of Mental defect\n\nU.S. Immigrant Inspectors used some other symbols or marks as they interrogated immigrants in the Registry Room to determine whether to admit or detain them, including:\n\n* SI – Special Inquiry\n* IV – Immigrant Visa\n* LPC – Likely or Liable to become a Public Charge\n* Med. Cert. – Medical certificate issued\n\nEugenic influence\n\nMany of the people immigrating to America hailed from Europe, with Eastern Europe and Southern European immigrants being the primary groups. During this time period, eugenic ideals gained broad popularity and made heavy impact on immigration to the United States by way of exclusion of disabled and \"morally defective\" people.\n\nEugenicists of the late 19th and early 20th century believed reproductive selection should be carried out by the state as a collective decision. For many eugenicists, this was considered a patriotic duty as they held an interest in creating a greater national race. Henry Fairfield Osborn's opening words to the New York Evening Journal in 1911 were, \"As a biologist as well as a patriot...,\" on the subject on advocating for tighter inspections of immigrants of the United States.\n\nEugenic selection occurred on two distinguishable levels:\n* State/Local levels which handles institutionalization and sterilization of those considered defective as well as the education of the public, marriage laws, and social pressures such as fitter family and better baby contests.\n* Immigration control, the screening of immigrants for defects, was notably supported by Harry Laughlin, superintendent of the Eugenics Record Office from 1910 to 1939, who stated that this was where the \"federal government must cooperate.\"\nAt the time, it was a broadly popular idea that immigration policies had ought to be based off eugenics principles in order to help create a \"superior race\" in America. To do this, defective persons needed to be screened by immigration officials and denied entry on the basis of their disability.\n\nTypes of defects screened for included:\n* Physical: people who had hereditary or acquired physical disability. These included sickness and disease, deformity, lack of limbs, being abnormally tall or short, feminization, and so forth.\n* Mental: people who showed signs or history of mental illness and intellectual disability. These included \"feeblemindedness\", \"imbecility\", depression, and other illnesses that stemmed from the brain such as epilepsy and cerebral palsy.\n* Moral: people who had moral defects at the time were, but not limited to: homosexuals and those of illicit sexuality, criminals, impoverished, and other groups associated with \"degeneracy\" that deviated from the considered norm or American society at the time.\n\nThe people with moral or mental disability were of higher concern to officials and under the law, mandatorily excluded from immigrating to the United States. Persons with physical disability were under higher inspection and could be turned way on the basis of their disability. Much of this came in part of the eugenicist belief that defects were hereditary, especially those of the moral and mental nature those these were often outwardly signified by physical deformity as well.\n\nIn 1898, a Chicago surgeon named Eugene S. Talbot (Eugene Solomon) wrote \"crime is hereditary, a tendency which is, in most cases, associated with bodily defects.\" Likewise, George Lydston, a medicine and criminal anthropology professor, argued further in 1906 that people with \"defective physique\" were not just criminally associated but that defectiveness was a primary factor \"in the causation of crime.\"\n\nBetween 1891 and 1930, Ellis Island reviewed over 25 million attempted immigrations. Of this 25 million, 700,000 were given certificates of disability or disease and of these 79,000 were barred from entry. Approximately 4.4% of immigrants between 1909 and 1930 were classified as disabled or diseased per with 11% being deported when this number spiked to 8.0% in the years of 1918-1919. One percent of immigrants were deported yearly due to medical causes.Wilson, Daniel J. [https://academic.oup.com/maghis/article-abstract/23/3/35/967400/No-Defectives-Need-Apply-Disability-and?redirectedFrom=fulltext \"'No Defectives Need Apply': Disability and Immigration\"], OAH Magazine of History, Volume 23, Issue 3, July 1, 2009, pp. 35–40. Accessed 2017-10-19. \"The Public Health Service, which ran the immigration inspections at Ellis Island and elsewhere, examined over 25 million potential immigrants between 1891 and 1930.... Only 700,000 were issued medical certificates indicating a disease or disability.... The Immigration Service, which made the final decision on entry and deportation, refused entry to approximately 79,000 of those receiving medical certificates.\"\n\nDetention and deportation station\n\nWith the passing of the Immigrant Quota Act of 1921, the number of immigrants being allowed into the United States declined greatly. The passing of the bill ended the era of mass immigration. After 1924, Ellis Island became primarily a detention and deportation processing station.\n\nDuring and immediately following World War II, Ellis Island was used to hold German merchant mariners and \"enemy aliens\"—Axis nationals detained for fear of spying, sabotage, and other fifth column activity. In December 1941, Ellis Island held 279 Japanese, 248 Germans, and 81 Italians removed from the East Coast.J. Burton, M. Farrell, F. Lord, R. Lord. Confinement and Ethnicity: An Overview of World War II Japanese American Relocation Sites [http://www.cr.nps.gov/history/online_books/anthropology74/ce17a.htm \"Department of Justice and U.S. Army Facilities: Temporary Detention Stations\"] (National Park Service)   Unlike other wartime immigration detention stations, Ellis Island was designated as a permanent holding facility and was used to hold foreign nationals throughout the war.[http://encyclopedia.densho.org/Ellis%20Island%20%28detention%20facility%29/ \"Ellis Island\"] Densho Encyclopedia (accessed 2014-06-11) A total of 7,000 Germans, Italians and Japanese would be ultimately detained at Ellis Island.  It was also a processing center for returning sick or wounded U.S. soldiers, and a Coast Guard training base. Ellis Island still managed to process tens of thousands of immigrants per year during this time, but many fewer than the hundreds of thousands per year who arrived before the war. After the war, immigration rapidly returned to earlier levels.\n\nThe Internal Security Act of 1950 barred members of communist or fascist organizations from immigrating to the United States. Ellis Island saw detention peak at 1,500, but by 1952, after changes to immigration laws and policies, only 30 detainees remained.\n\nOne of the last detainees was the Indonesian Aceh separatist Hasan di Tiro who, while a student in New York in 1953, declared himself the \"foreign minister\" of the rebellious Darul Islam movement. Due to this action, he was immediately stripped of his Indonesian citizenship, causing him to be imprisoned for a few months on Ellis Island as \"an illegal alien.\"\n\nStaff\n\nThe station's commissioners were:\n\n# 1890–1893 Colonel John B. Weber (Republican)\n# 1893–1897 Dr. Joseph H. Senner (Democrat)\n# 1898–1902 Thomas Fitchie (Republican)\n# 1902–1905 William Williams (Republican)\n# 1905–1909 Robert Watchorn (Republican)\n# 1909–1913 William Williams (Republican), 2nd term\n# 1914–1919 Dr. Frederic C. Howe (Democrat)\n# 1920–1921 Frederick A. Wallis (Democrat)\n# 1921–1923 Robert E. Tod (Republican)\n# 1923–1926 Henry C. Curran (Republican)\n# 1926–1931 Benjamin M. Day (Republican)\n# 1931–1934 Edward Corsi (Republican)\n# 1934–1940 Rudolph Reimer (Democrat)\n# 1940–1942 Byron H. Uhl (actual title: district director)\n# 1942–1949 W. Frank Watkins (district director)\n# 1949–1954 Edward J. Shaughnessy (district director)\n\nOther notable officials at Ellis Island included James R. O'Beirne (assistant commissioner, 1890–93), Edward F. McSweeney (assistant commissioner, 1893-1902), Joseph E. Murray (assistant commissioner, 1902–09), Byron Uhl (assistant commissioner, 1909-1940), Dr. George W. Stoner (chief surgeon), Augustus Frederick Sherman (chief clerk), Dr. Victor Heiser (surgeon) (surgeon), Dr. Thomas W. Salmon (surgeon), Dr. Howard Knox (surgeon), Antonio Frabasilis (interpreter), Peter Mikolainis (interpreter), Maud Mosher (matron), Fiorello H. La Guardia (interpreter), Samuel Hays, (special immigrant inspector)Roman Dobler (immigrant inspector), Philip Cowen (immigrant inspector) and Philip Forman (immigrant inspector, 1930s; chief of detention, deportation and parole, 1940s, 1950s)\n\nProminent amongst the missionaries and immigrant aid workers were Rev. Michael J. Henry and Rev. Anthony J. Grogan (Irish Catholic), Rev. Gaspare Moretto (Italian Catholic), Alma E. Mathews (Methodist), Rev. Georg Doring (German Lutheran), Rev. Joseph L'Etauche (Polish Catholic), Rev. Reuben Breed (Episcopal), Michael Lodsin (Baptist), Brigadier Thomas Johnson (Salvation Army), Ludmila K. Foxlee (YWCA), Athena Marmaroff (Woman's Christian Temperance Union), Alexander Harkavy (HIAS), and Cecilia Greenstone and Cecilia Razovsky (National Council of Jewish Women).\n\nRecords\n\nA myth persists that government officials on Ellis Island compelled immigrants to take new names against their wishes.[http://www.ancestry.com/learn/library/article.aspx?article=4675 Name Changes at Ellis Island: Fact or Fiction?]\", Ancestry.com. Retrieved 2010-09-29. In fact, no historical records bear this out. Immigration inspectors used the passenger lists they received from the steamship companies to process each foreigner. These were the sole immigration records for entering the country and were prepared not by the U.S. Bureau of Immigration but by steamship companies such as the Cunard Line, the White Star Line, the North German Lloyd Line, the Hamburg-Amerika Line, the Italian Steam Navigation Company, the Red Star Line, the Holland America Line, and the Austro-American Line.[http://149.101.23.2/graphics/aboutus/history/articles/nameessay.html US Dept of Justice]  American Names / Declaring Independence, Marian L. Smith, INS Historian, U.S. Citizenship and Immigration Services, last updated 2006-01-20, accessed 2007-05-22 The Americanization of many immigrant families' surnames was for the most part adopted by the family after the immigration process, or by the second or third generation of the family after some assimilation into American culture. However, many last names were altered slightly because of the disparity between English and other languages in the pronunciation of certain letters of the alphabet.\"[http://life.familyeducation.com/genealogy/family-tree/45352.html The Effect of Immigration on Surnames]\", FamilyEducation.com. Retrieved 2009-02-20. Excerpted from The Complete Idiot's Guide to Genealogy by Christine Rose and Kay Germain Ingalls, 2005.\n\nNotable immigrants\n\nThe first immigrant to pass through Ellis Island was Annie Moore, a 17-year-old girl from Cork, Ireland, who arrived on the ship Nevada on January 1, 1892.[http://www.ellisisland.org/search/passRecord.asp?pID604534030002&MID\n02806987110023700416& Passenger Record: Annie Moore], The Statue of Liberty – Ellis Island Foundation, Inc. Retrieved 2013-04-24. She and her two brothers were coming to America to meet their parents, who had moved to New York two years prior. She received a greeting from officials and a $10 gold coin.[http://www.history.com/minisite.do?content_typeMinisite_Generic&content_type_id\n1460&display_order1&mini_id\n1459 Ellis Island] . p. 3. www.history.com Retrieved 2013-04-24. It was the largest sum of money she had ever owned.\n\nThe last person to pass through Ellis Island was Norwegian merchant seaman Arne Peterssen in 1954.\n\nImmigration museum\n\nThe wooden structure built in 1892 to house the immigration station burned down after five years. The station's new Main Building, which now houses the Immigration Museum, was opened in 1900.\nArchitects Edward Lippincott Tilton and William Alciphron Boring received a gold medal at the 1900 Paris Exposition for the building's design and constructed the building at a cost of $1.5 million.  The architecture competition was the second under the Tarsney Act, which had permitted private architects rather than government architects in the Treasury Department's Office of the Supervising Architect to design federal buildings.Lee, Antoinette J., [https://books.google.com/books?idhjDZz87NF8AC&pg\nPA197&dq%22James+Knox+Taylor%22&sig\nACfU3U0hwyx1_8a6mNHwqC5a6zzs34_E6w#PPA197,M1 Architects to the Nation: The Rise and Decline of the Supervising Architect's Office], Oxford University Press, USA. 2000-04-20. \n\nAfter the immigration station closed in November 1954, the buildings fell into disrepair and were abandoned. Attempts at redeveloping the site were unsuccessful until its landmark status was established. On October 15, 1965, Ellis Island was proclaimed a part of Statue of Liberty National Monument. It was listed on the National Register of Historic Places on October 15, 1966.\n\nBoston-based architectural firm Finegold Alexander + Associates Inc, together with the New York architectural firm Beyer Blinder Belle, designed the restoration and adaptive use of the Beaux-Arts Main Building, one of the most symbolically important structures in American history. A construction budget of $150 million was required for this significant restoration. This money was raised by a campaign organized by the political fundraiser Wyatt A. Stewart.  The building reopened on September 10, 1990. Exhibits include Hearing Room, Peak Immigration Years, the Peopling of America, Restoring a Landmark, Silent Voices, Treasures from Home, and Ellis Island Chronicles.  There are also three theaters used for film and live performances.\n\nOn May 20, 2015, the Ellis Island Immigration Museum was officially renamed the Ellis Island National Museum of Immigration, coinciding with the opening of the new Peopling of America galleries. The expansion tells the entire story of American immigration, including before and after the Ellis Island era. The Peopling of America Center was designed by ESI Design and fabricated by Hadley Exhibits, Inc. The architectural design was done by Highland Associates, with construction executed by Phelps Construction Group.\n\nThe Wall of Honor outside of the main building contains a partial list of immigrants processed on the island. Inclusion on the list is made possible by a donation to support the facility. In 2008 the museum's library was officially named the Bob Hope Memorial Library in honor of one the station's most famous immigrants.\n\nThe Ellis Island Medal of Honor is awarded annually at ceremonies on the island.\n\nSouth side of the island\n\nThe south side of the island, home to the Ellis Island Immigrant Hospital, is closed to the general public and the object of restoration efforts spearheaded by Save Ellis Island.\n\nMany of the facilities at Ellis Island were abandoned and remain unrenovated. The entire south side, called by some the \"sad side\" of the island, is off limits to the general public. The Ellis Island Immigrant Hospital operated here from early 1902 to 1930. The foundation Save Ellis Island is spearheading preservation efforts. The New Ferry Building, built in the Art Deco style to replace an earlier one, was renovated in 2008, but remains only partially accessible to the general public.\n\nAs part of the National Park Service's Centennial Initiative, the south side of the island was to be the target of a project to restore the 28 buildings that have not yet been rehabilitated.\n\nState sovereignty dispute\n\nThe circumstances which led to an exclave of New York being located within New Jersey began in the colonial era, after the British takeover of New Netherland in 1664. An unusual clause in the colonial land grant outlined the territory that the proprietors of New Jersey would receive as being \"westward of Long Island, and Manhitas Island and bounded on the east part by the main sea, and part by Hudson's river\", rather than at the river's midpoint, as was common in other colonial charters.\n\nAttempts were made as early as 1804 to resolve the status of the state line. The City of New York claimed the right to regulate trade on all the waters. This was contested in Gibbons v. Ogden,. which decided that the regulation of interstate commerce fell under the authority of the federal government, thus influencing competition in the newly developing steam ferry service in New York Harbor.\n\nIn 1830, New Jersey planned to bring suit to clarify the border, but the case was never heard. The matter was resolved with a compact between the states, ratified by U.S. Congress in 1834, which set the boundary line between them as the middle of the Hudson River and New York Harbor. This was later confirmed by the U.S. Supreme Court in other cases which also expounded on the compact. \n\nThe federal government, which had bought the island in 1808, began expanding the island by land fill, to accommodate the immigration station opened in 1892. Land filling continued in stages until 1934.\n\nNine-tenths of the current area is artificial island that did not exist at the time of the interstate compact. New Jersey contended that the new extensions were part of New Jersey, since they were outside New York's border and were in fact within New Jersey's border. In 1956, after the 1954 closing of the U.S. immigration station, the then Mayor of Jersey City, Bernard J. Berry, commandeered a U.S. Coast Guard cutter and led a contingent of New Jersey officials on an expedition to claim the island. In 1997, the state filed suit to establish its jurisdiction, leading New York City Mayor Rudolph Giuliani to remark dramatically that his father, an Italian who immigrated through Ellis Island, never intended to go to New Jersey.Sheahan, Matthew. [http://www.knotmag.com/?article=1291 \"My Grandmother Is the Greatest\"] , Knot Magazine, May 4, 2004. The border was redrawn using information based on studies using geographic information science.\n\nThe dispute eventually reached the Supreme Court of the United States, which ruled in New Jersey v. New York  , that New Jersey had jurisdiction over all portions of the island created after the original compact was approved (effectively, more than 80% of the island's present land). This caused several immediate instances of confusion: some buildings, for instance, fell into the territory of both states. New Jersey and New York soon agreed to share jurisdiction of the island. It remains wholly a federal property, however, and these legal decisions do not result in either state taking any fiscal or physical responsibility for the maintenance, preservation, or improvement of any of the historic properties.[http://www.nps.gov/elis/planyourvisit/maps.htm National Park Service map showing portions of the island belonging to New York and New Jersey]  \n\nThe ruling had no effect on the status of Liberty Island,  of which was created by land reclamation.\n\nFor New York State tax purposes, it is assessed as Manhattan Block 1, Lot 201. Since 1998, it also has a tax number assigned by the state of New Jersey.[http://www.silive.com/opinion/editorials/index.ssf/2013/12/an_inaugural_choice_will_nj_go.html An inaugural choice: Will N.J. governor's gala really be in New York?]. \"After the 1998 court event, both states agreed to share jurisdiction, even though the islands remain a wholly federal property. To cement those claims, New York assigned Ellis Island the tax designation of Block 1, Lot 201. The state of New Jersey gave the place its own tax number.\"\n\nRenovations and plans\n\nFrank Lloyd Wright designed a key plan for the island that included housing, hotels, and large domes along the edges. The co-curator of the traveling exhibit, \"Never Built New York\" in which it is included told AM New York, \"It's pretty remarkable but at the same time it's a little bit horrifying that they could have gotten rid of Ellis Island.\"Colangelo, Lisa, \"The City of Fantastical Dreams: How NYC Might Have Been, in Queens,\" AMNY, September 25, 2017, p.A11.\n\nIn 1982 the National Parks Department embarked on an 8-year renovation. During that time, David Simonton was part of The Ellis Island Project: Documentation/Interpretation and captured stunning, black and white photos giving insight into immigrant's lives. Photographer Stephen Wilkes's series Ellis Island: Ghosts of Freedom (2006) captured the abandoned south side of Ellis Island.[http://www.artartworks.com/exhibitions/ellis-island-ghosts-of-freedom/ Ellis Island: Ghosts of Freedom] \n\nEmergency services\n\nEmergency services on Ellis Island are provided by the following emergency divisions of the National Park Service:\n* Police services and security are provided for the island by the United States Park Police.\n* Fire suppression/protection is provided by the National Park Service's Statue of Liberty/Ellis Island Division of Safety and Emergency Management Statue of Liberty Fire Brigade which consists of a crew of federal NPS firefighters who are trained and certified as Structural Firefighter I, Structural Firefighter II or Wildland Firefighters. The crew also provides fire suppression response to nearby Liberty Island. Since the nearest other National Park Service Engine Company is located in Fort Hancock in Sandy Hook, New Jersey, the Statue of Liberty Fire Brigade maintains a mutual aid agreement with the Jersey City Fire Department and the New York City Fire Department for mutual aid assistance on Ellis Island should it be required. The Statue of Liberty/ Ellis Island Division of Safety & Emergency Management staffs the fire brigade. The fire brigade is led by a Fire Captain (crew leader), two Lieutenants and has six collateral duty firefighters.\n* Emergency Medical Services are provided by National Park Services Statue of Liberty/Ellis Island Division of Safety and Emergency Management, which consists of a team of full-time NPS Emergency Medical Technicians and Certified First Responders. Patient transportation is coordinated with Jersey City Medical Center ambulances, but emergency response and patient care falls solely upon the National Park Service Emergency Medical Technicians.\n\nIn popular culture\n\nEllis Island has been a source of inspiration or used as a subject in popular culture. Its imagery or representation has been employed in literature (including novels, short stories and poetry), in song, musical composition, dance, theatre, including vaudeville, burlesque, musical comedy, revue, legitimate theatre, motion pictures (silent and sound), newsreels, and in radio and television.\n\nEarly films, including those from the silent era, which feature the station include Traffic in Souls (1913), How The Jews Care for Their Poor (educational film, 1914) The Yellow Passport (1916), My Boy (1921), Frank Capra's The Strong Man (1926), We Americans (1928), The Mating Call (1928),  This is Heaven (1929), Paddy O'Day (1935), Ellis Island (1936), Gateway (1938), Exile Express (1939), I, Jane Doe (1948), and Gambling House (1951). In The Godfather Part II, Vito Corleone immigrates via Ellis Island as a boy. The opening scene of The Brother From Another Planet is set there. The island is visited by the characters in the 2005 romantic comedy, Hitch, and is the setting for the climactic battle in X-Men.\n\nOver the decades, Ellis Island was also widely referenced or remarked on in books, such as Mrs 'Arris Goes to New York (1960) by Paul Gallico, and in popular films such as Cafe Metropole (1937) and With a Song in My Heart (1952).\n\nSome films have focused on the immigrant experience, such as the 1984 TV miniseries Ellis Island. The IMAX 3D movie [http://www.imdb.com/title/tt0112286/ Across the Sea of Time] incorporates both modern footage and historical photographs of Ellis Island. The 2006 Italian movie The Golden Door, directed by Emanuele Crialese, takes place largely on Ellis Island. Forgotten Ellis Island, a film and book, focuses on the Ellis Island Immigrant Hospital.Conway, Lorie, [https://books.google.com/books?id7dK7cIsVfmEC&printsec\nfrontcover Forgotten Ellis Island : the extraordinary story of America’s immigrant hospital], New York : Smithsonian Books : Collins, 2007.  The Immigrant is a 2013 American drama film directed by James Gray, starring Marion Cotillard, Joaquin Phoenix, and Jeremy Renner. Ellis, a short, premiered in November 2015.\n\nEllis Island as a port of entry is described in detail in Mottel the Cantor's Son by Sholom Aleichem.\n\nEllis Island: The Dream of America is a work for actors and orchestra with projected images by Peter Boyer, composed in 2001-02. The song \"The New Ground - Isle of Hope, Isle of Tears\", on the 2010 album Songs from the Heart by the group Celtic Woman, is about Annie Moore and Ellis Island.\n\nThe USPS issued a 32¢ stamp on February 3, 1998 as part of the Celebrate the Century stamp sheet series. Ellis Island. http://en.wikipedia.org/?curid=9806."
  }
}
