{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18120",
  "eid" : "30fb6c00-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778591424,
  "textBody" : "A lysosome is a membrane-bound organelle found in nearly all animal cells. They are spherical vesicles that contain hydrolytic enzymes that can break down many kinds of biomolecules. Put simply, a lysosome is a type of vesicle with specific composition, of both its membrane proteins, and proteins of its lumen.  The lumen's pH (4.5–5.0) is optimal for the enzymes involved in hydrolysis, analogous to the activity of the stomach. Besides degradation of polymers, the lysosome is involved in various cell processes, including secretion, plasma membrane repair, cell signaling, and energy metabolism.\n\nThe lysosomes also act as the waste disposal system of the cell by digesting unwanted materials in the cytoplasm, both from outside the cell and obsolete components inside the cell. Material from outside the cell is taken-up through endocytosis, while material from the inside of the cell is digested through autophagy. Their sizes can be very different—the biggest ones can be more than 10 times bigger than the smallest ones. They were discovered and named by Belgian biologist Christian de Duve, who eventually received the Nobel Prize in Physiology or Medicine in 1974.\n\nLysosomes are known to contain more than 60 different enzymes. Enzymes of the lysosomes are synthesised in the rough endoplasmic reticulum. The enzymes are imported from the Golgi apparatus in small vesicles, which fuse with larger acidic vesicles. Enzymes destined for a lysosome are specifically tagged with the molecule mannose 6-phosphate, so that they are properly sorted into acidified vesicles.\n\nSynthesis of lysosomal enzymes is controlled by nuclear genes. Mutations in the genes for these enzymes are responsible for more than 30 different human genetic disorders, which are collectively known as lysosomal storage diseases. These diseases result from an accumulation of specific substrates, due to the inability to break them down. These genetic defects are related to several neurodegenerative disorders, cancer, cardiovascular diseases, and ageing-related diseases.\n\nLysosomes should not be confused with liposomes, or with micelles.\n\nDiscovery\n\nChristian de Duve, the chairman of the Laboratory of Physiological Chemistry at the Catholic University of Louvain in Belgium, had been studying the mechanism of action of a pancreatic hormone insulin in liver cells. By 1949, he and his team had focused on the enzyme called glucose 6-phosphatase, which is the first crucial enzyme in sugar metabolism and the target of insulin. They already suspected that this enzyme played a key role in regulating blood sugar levels. However, even after a series of experiments, they failed to purify and isolate the enzyme from the cellular extracts. Therefore, they tried a more arduous procedure of cell fractionation, by which cellular components are separated based on their sizes using centrifugation.\n\nThey succeeded in detecting the enzyme activity from the microsomal fraction. This was the crucial step in the serendipitous discovery of lysosomes. To estimate this enzyme activity, they used that of standardised enzyme acid phosphatase, and found that the activity was only 10% of the expected value. One day, the enzyme activity of purified cell fractions which had been refrigerated for five days was measured. Surprisingly, the enzyme activity was increased to normal of that of the fresh sample. The result was the same no matter how many times they repeated the estimation, and led to the conclusion that a membrane-like barrier limited the accessibility of the enzyme to its substrate, and that the enzymes were able to diffuse after a few days (and react with their substrate). They described this membrane-like barrier as a \"saclike structure surrounded by a membrane and containing acid phosphatase.\"\n\nIt became clear that this enzyme from the cell fraction came from a membranous fractions, which were definitely cell organelles, and in 1955 De Duve named them \"lysosomes\" to reflect their digestive properties. The same year, Alex B. Novikoff from the University of Vermont visited de Duve's laboratory, and successfully obtained the first electron micrographs of the new organelle. Using a staining method for acid phosphatase, de Duve and Novikoff confirmed the location of the hydrolytic enzymes of lysosomes using light and electron microscopic studies. de Duve won the Nobel Prize in Physiology or Medicine in 1974 for this discovery.\n\nOriginally, De Duve had termed the organelles the \"suicide bags\" or \"suicide sacs\" of the cells, for their hypothesized role in apoptosis.Hayashi, Teru, and others. \"Subcellular Particles.\" Subcellular Particles., 1959. However, it has since been concluded that they only play a minor role in cell death.Turk, Boris, and Vito Turk. \"Lysosomes as 'Suicide Bags' in Cell Death: Myth or Reality?” The Journal of Biological Chemistry 284, no. 33 (14 August 2009): 21783–87. doi:10.1074/jbc.R109.023820.\n\nFunction and structure \n\nLysosomes contain a variety of enzymes, enabling the cell to break down various biomolecules it engulfs, including peptides, nucleic acids, carbohydrates, and lipids. The enzymes responsible for this hydrolysis require an acidic environment for optimal activity.\n\nIn addition to being able to break down polymers, lysosomes are capable of fusing with other organelles & digesting large structures or cellular debris; through cooperation with phagosomes, they are able to conduct autophagy, clearing out damaged structures. Similarly, they are able to break-down virus particles or bacteria in phagocytosis of macrophages.\n\nThe size of lysosomes varies from 0.1 μm to 1.2 μm. With a pH ranging from 4.5 to 5.0, the interior of the lysosomes is acidic compared to the slightly basic cytosol (pH 7.2).  The lysosomal membrane protects the cytosol, and therefore the rest of the cell, from the degradative enzymes within the lysosome. The cell is additionally protected from any lysosomal acid hydrolases that drain into the cytosol, as these enzymes are pH-sensitive and do not function well or at all in the alkaline environment of the cytosol. This ensures that cytosolic molecules and organelles are not destroyed in case there is leakage of the hydrolytic enzymes from the lysosome.\n\nThe lysosome maintains its pH differential by pumping in protons (H+ ions) from the cytosol across the membrane via proton pumps and chloride ion channels. Vacuolar H+-ATPases are responsible for transport of protons, while the counter transport of chloride ions is performed by ClC-7 Cl−/H+ antiporter. In this way a steady acidic environment is maintained.\n\nIt sources its versatile capacity for degradation by import of enzymes with specificity for different substrates; cathepsins are the major class of hydrolytic enzymes, while lysosomal alpha-glucosidase (GAA) is responsible for carbohydrates, and ACP2 is necessary to release phosphate groups of phospholipids.\n\nFormation \n\nMany components of animal cells are recycled by transferring them inside or embedded in sections of membrane. For instance, in endocytosis (more specifically, macropinocytosis), a portion of the cell's plasma membrane pinches off to form a vesicle that will eventually fuse with an organelle within the cell. Without active replenishment, the plasma membrane would continuously decrease in size. It is thought that lysosomes participate in this dynamic membrane exchange system and are formed by a gradual maturation process from endosomes.\n\nThe production of lysosomal proteins suggests one method of lysosome sustainment. Lysosomal protein genes are transcribed in the nucleus. mRNA transcripts exit the nucleus into the cytosol, where they are translated by ribosomes. The nascent peptide chains are translocated into the rough endoplasmic reticulum, where they are modified. Upon exiting the endoplasmic reticulum and entering the Golgi apparatus via vesicular transport, a specific lysosomal tag, mannose 6-phosphate, is added to the peptides. The presence of these tags allow for binding to mannose 6-phosphate receptors in the Golgi apparatus, a phenomenon that is crucial for proper packaging into vesicles destined for the lysosomal system.\n\nUpon leaving the Golgi apparatus, the lysosomal enzyme-filled vesicle fuses with a late endosome, a relatively acidic organelle with an approximate pH of 5.5. This acidic environment causes dissociation of the lysosomal enzymes from the mannose 6-phosphate receptors. The enzymes are packed into vesicles for further transport to established lysosomes. The late endosome itself can eventually grow into a mature lysosome, as evidenced by the transport of endosomal membrane components from the lysosomes back to the endosomes.\n\nPathogen entry \n\nAs the endpoint of endocytosis, the lysosome also acts as a safeguard in preventing pathogens from being able to reach the cytoplasm before being degraded. Pathogens often hijack endocytotic pathways such as pinocytosis in order to gain entry into the cell. The lysosome prevents easy entry into the cell by hydrolyzing the biomolecules of pathogens necessary for their replication strategies; reduced Lysosomal activity results in an increase in viral infectivity, including HIV. In addition, AB5 toxins such as cholera hijack the endosomal pathway while evading lysosomal degradation.\n\nDisease\n\nLysosomes are responsible for a group of genetically inherited disorders called lysosomal storage diseases (LSD). They are a type of inborn errors of metabolism caused by malfunction of one of the enzymes. The rate of incidence is estimated to be 1 in 5,000 live births, and the true figure expected to be higher as many cases are likely to be undiagnosed or misdiagnosed. The primary cause is deficiency of an acidic hydrolase (a hydrolase which functions best in acidic environments). Other conditions are due to defects in lysosomal membrane proteins that fail to transport the enzyme, non-enzymatic soluble lysosomal proteins. The initial effect of such disorders is accumulation of specific macromolecules or monomeric compounds inside the endosomal–autophagic–lysosomal system. This results in abnormal signaling pathways, calcium homeostasis, lipid biosynthesis and degradation and intracellular trafficking, ultimately leading to pathogenetic disorders. The organs most affected are brain, viscera, bone and cartilage.\n\nThere is no direct medical treatment to cure LSDs.. The most common LSD is Gaucher's disease, which is due to deficiency of the enzyme glucocerebrosidase. Consequently, the enzyme substrate, the fatty acid glucosylceramide accumulates, particularly in white blood cells, which in turn affects spleen, liver, kidneys, lungs, brain and bone marrow. The disease is characterized by bruises, fatigue, anaemia, low blood platelets, osteoporosis, and enlargement of the liver and spleen.\n\nMetachromatic leukodystrophy is another lysosomal storage disease that also affects sphingolipid metabolism.\n\nLysosomotropism \n\nWeak bases with lipophilic properties accumulate in acidic intracellular compartments like lysosomes. While the plasma and lysosomal membranes are permeable for neutral and uncharged species of weak bases, the charged protonated species of weak bases do not permeate biomembranes and accumulate within lysosomes. The concentration within lysosomes may reach levels 100 to 1000 fold higher than extracellular concentrations. This phenomenon is called \"lysosomotropism\", \"acid trapping\" or \"proton pump\" effect Traganos F, Darzynkiewicz Z.(1994) Lysosomal proton pump activity: supravital cell staining with acridine orange differentiates leukocyte subpopulations. Methods Cell Biol. 1994;41:185-94.  . The amount of accumulation of lysosomotropic compounds may be estimated using a cell-based mathematical model.\n\nA significant part of the clinically approved drugs are lipophilic weak bases with lysosomotropic properties. This explains a number of pharmacological properties of these drugs, such as high tissue-to-blood concentration gradients or long tissue elimination half-lifes; these properties have been found for drugs such as haloperidol, levomepromazine, and amantadine. However, high tissue concentrations and long elimination half-lives are explained also by lipophilicity and absorption of drugs to fatty tissue structures. Important lysosomal enzymes, such as acid sphingomyelinase, may be inhibited by lysosomally accumulated drugs. Such compounds are termed FIASMAs (functional inhibitor of acid sphingomyelinase) and include for example fluoxetine, sertraline, or amitriptyline.\n\nAmbroxol is a lysosomotropic drug of clinical use to treat conditions of productive cough for its mucolytic action. Ambroxol triggers the exocytosis of lysosomes via neutralization of lysosomal pH and calcium release from acidic calcium stores. Presumably for this reason, Ambroxol was also found to improve cellular function in some disease of lysosomal origin such as Parkinson's or lysosomal storage disease.\n\nControversy in botany \n\nBy scientific convention, the term lysosome is applied to these vesicular organelles only in animals, and the term vacuole is applied to those in plants, fungi and algae (some animal cells also have vacuoles). Discoveries in plant cells since the 1970s started to challenge this definition. Plant vacuoles are found to be much more diverse in structure and function than previously thought. Some vacuoles contain their own hydrolytic enzymes and perform the classic lysosomal activity, which is autophagy. These vacuoles are therefore seen as fulfilling the role of the animal lysosome. Based on de Duve's description that \"only when considered as part of a system involved directly or indirectly in intracellular digestion does the term lysosome describe a physiological unit\", some botanists strongly argued that these vacuoles are lysosomes. However, this is not universally accepted as the vacuoles are strictly not similar to lysosomes, such as in their specific enzymes and lack of phagocytic functions. Vacuoles do not have catabolic activity and do not undergo exocytosis as lysosomes do.\n\nEtymology and pronunciation\n\nThe word lysosome (,) is New Latin that uses the combining forms lyso- (referring to lysis and derived from the Latin lysis, meaning \"to loosen\", via Ancient Greek λύσις [lúsis]), and -some, from soma, \"body\", yielding \"body that lyses\" or \"lytic body\". The adjectival form is lysosomal. The forms *lyosome and *lyosomal are much rarer; they use the lyo- form of the prefix but are often treated by readers and editors as mere unthinking replications of typos, which has no doubt been true as often as not.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lysosome" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18120" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A lysosome is a membrane-bound organelle found in nearly all animal cells. They are spherical vesicles that contain hydrolytic enzymes that can break down many kinds of biomolecules. Put simply, a lysosome is a type of vesicle with specific composition, of both its membrane proteins, and proteins of its lumen.  The lumen's pH (4.5–5.0) is optimal for the enzymes involved in hydrolysis, analogous to the activity of the stomach. Besides degradation of polymers, the lysosome is involved in various cell processes, including secretion, plasma membrane repair, cell signaling, and energy metabolism.\n\nThe lysosomes also act as the waste disposal system of the cell by digesting unwanted materials in the cytoplasm, both from outside the cell and obsolete components inside the cell. Material from outside the cell is taken-up through endocytosis, while material from the inside of the cell is digested through autophagy. Their sizes can be very different—the biggest ones can be more than 10 times bigger than the smallest ones. They were discovered and named by Belgian biologist Christian de Duve, who eventually received the Nobel Prize in Physiology or Medicine in 1974.\n\nLysosomes are known to contain more than 60 different enzymes. Enzymes of the lysosomes are synthesised in the rough endoplasmic reticulum. The enzymes are imported from the Golgi apparatus in small vesicles, which fuse with larger acidic vesicles. Enzymes destined for a lysosome are specifically tagged with the molecule mannose 6-phosphate, so that they are properly sorted into acidified vesicles.\n\nSynthesis of lysosomal enzymes is controlled by nuclear genes. Mutations in the genes for these enzymes are responsible for more than 30 different human genetic disorders, which are collectively known as lysosomal storage diseases. These diseases result from an accumulation of specific substrates, due to the inability to break them down. These genetic defects are related to several neurodegenerative disorders, cancer, cardiovascular diseases, and ageing-related diseases.\n\nLysosomes should not be confused with liposomes, or with micelles.\n\nDiscovery\n\nChristian de Duve, the chairman of the Laboratory of Physiological Chemistry at the Catholic University of Louvain in Belgium, had been studying the mechanism of action of a pancreatic hormone insulin in liver cells. By 1949, he and his team had focused on the enzyme called glucose 6-phosphatase, which is the first crucial enzyme in sugar metabolism and the target of insulin. They already suspected that this enzyme played a key role in regulating blood sugar levels. However, even after a series of experiments, they failed to purify and isolate the enzyme from the cellular extracts. Therefore, they tried a more arduous procedure of cell fractionation, by which cellular components are separated based on their sizes using centrifugation.\n\nThey succeeded in detecting the enzyme activity from the microsomal fraction. This was the crucial step in the serendipitous discovery of lysosomes. To estimate this enzyme activity, they used that of standardised enzyme acid phosphatase, and found that the activity was only 10% of the expected value. One day, the enzyme activity of purified cell fractions which had been refrigerated for five days was measured. Surprisingly, the enzyme activity was increased to normal of that of the fresh sample. The result was the same no matter how many times they repeated the estimation, and led to the conclusion that a membrane-like barrier limited the accessibility of the enzyme to its substrate, and that the enzymes were able to diffuse after a few days (and react with their substrate). They described this membrane-like barrier as a \"saclike structure surrounded by a membrane and containing acid phosphatase.\"\n\nIt became clear that this enzyme from the cell fraction came from a membranous fractions, which were definitely cell organelles, and in 1955 De Duve named them \"lysosomes\" to reflect their digestive properties. The same year, Alex B. Novikoff from the University of Vermont visited de Duve's laboratory, and successfully obtained the first electron micrographs of the new organelle. Using a staining method for acid phosphatase, de Duve and Novikoff confirmed the location of the hydrolytic enzymes of lysosomes using light and electron microscopic studies. de Duve won the Nobel Prize in Physiology or Medicine in 1974 for this discovery.\n\nOriginally, De Duve had termed the organelles the \"suicide bags\" or \"suicide sacs\" of the cells, for their hypothesized role in apoptosis.Hayashi, Teru, and others. \"Subcellular Particles.\" Subcellular Particles., 1959. However, it has since been concluded that they only play a minor role in cell death.Turk, Boris, and Vito Turk. \"Lysosomes as 'Suicide Bags' in Cell Death: Myth or Reality?” The Journal of Biological Chemistry 284, no. 33 (14 August 2009): 21783–87. doi:10.1074/jbc.R109.023820.\n\nFunction and structure \n\nLysosomes contain a variety of enzymes, enabling the cell to break down various biomolecules it engulfs, including peptides, nucleic acids, carbohydrates, and lipids. The enzymes responsible for this hydrolysis require an acidic environment for optimal activity.\n\nIn addition to being able to break down polymers, lysosomes are capable of fusing with other organelles & digesting large structures or cellular debris; through cooperation with phagosomes, they are able to conduct autophagy, clearing out damaged structures. Similarly, they are able to break-down virus particles or bacteria in phagocytosis of macrophages.\n\nThe size of lysosomes varies from 0.1 μm to 1.2 μm. With a pH ranging from 4.5 to 5.0, the interior of the lysosomes is acidic compared to the slightly basic cytosol (pH 7.2).  The lysosomal membrane protects the cytosol, and therefore the rest of the cell, from the degradative enzymes within the lysosome. The cell is additionally protected from any lysosomal acid hydrolases that drain into the cytosol, as these enzymes are pH-sensitive and do not function well or at all in the alkaline environment of the cytosol. This ensures that cytosolic molecules and organelles are not destroyed in case there is leakage of the hydrolytic enzymes from the lysosome.\n\nThe lysosome maintains its pH differential by pumping in protons (H+ ions) from the cytosol across the membrane via proton pumps and chloride ion channels. Vacuolar H+-ATPases are responsible for transport of protons, while the counter transport of chloride ions is performed by ClC-7 Cl−/H+ antiporter. In this way a steady acidic environment is maintained.\n\nIt sources its versatile capacity for degradation by import of enzymes with specificity for different substrates; cathepsins are the major class of hydrolytic enzymes, while lysosomal alpha-glucosidase (GAA) is responsible for carbohydrates, and ACP2 is necessary to release phosphate groups of phospholipids.\n\nFormation \n\nMany components of animal cells are recycled by transferring them inside or embedded in sections of membrane. For instance, in endocytosis (more specifically, macropinocytosis), a portion of the cell's plasma membrane pinches off to form a vesicle that will eventually fuse with an organelle within the cell. Without active replenishment, the plasma membrane would continuously decrease in size. It is thought that lysosomes participate in this dynamic membrane exchange system and are formed by a gradual maturation process from endosomes.\n\nThe production of lysosomal proteins suggests one method of lysosome sustainment. Lysosomal protein genes are transcribed in the nucleus. mRNA transcripts exit the nucleus into the cytosol, where they are translated by ribosomes. The nascent peptide chains are translocated into the rough endoplasmic reticulum, where they are modified. Upon exiting the endoplasmic reticulum and entering the Golgi apparatus via vesicular transport, a specific lysosomal tag, mannose 6-phosphate, is added to the peptides. The presence of these tags allow for binding to mannose 6-phosphate receptors in the Golgi apparatus, a phenomenon that is crucial for proper packaging into vesicles destined for the lysosomal system.\n\nUpon leaving the Golgi apparatus, the lysosomal enzyme-filled vesicle fuses with a late endosome, a relatively acidic organelle with an approximate pH of 5.5. This acidic environment causes dissociation of the lysosomal enzymes from the mannose 6-phosphate receptors. The enzymes are packed into vesicles for further transport to established lysosomes. The late endosome itself can eventually grow into a mature lysosome, as evidenced by the transport of endosomal membrane components from the lysosomes back to the endosomes.\n\nPathogen entry \n\nAs the endpoint of endocytosis, the lysosome also acts as a safeguard in preventing pathogens from being able to reach the cytoplasm before being degraded. Pathogens often hijack endocytotic pathways such as pinocytosis in order to gain entry into the cell. The lysosome prevents easy entry into the cell by hydrolyzing the biomolecules of pathogens necessary for their replication strategies; reduced Lysosomal activity results in an increase in viral infectivity, including HIV. In addition, AB5 toxins such as cholera hijack the endosomal pathway while evading lysosomal degradation.\n\nDisease\n\nLysosomes are responsible for a group of genetically inherited disorders called lysosomal storage diseases (LSD). They are a type of inborn errors of metabolism caused by malfunction of one of the enzymes. The rate of incidence is estimated to be 1 in 5,000 live births, and the true figure expected to be higher as many cases are likely to be undiagnosed or misdiagnosed. The primary cause is deficiency of an acidic hydrolase (a hydrolase which functions best in acidic environments). Other conditions are due to defects in lysosomal membrane proteins that fail to transport the enzyme, non-enzymatic soluble lysosomal proteins. The initial effect of such disorders is accumulation of specific macromolecules or monomeric compounds inside the endosomal–autophagic–lysosomal system. This results in abnormal signaling pathways, calcium homeostasis, lipid biosynthesis and degradation and intracellular trafficking, ultimately leading to pathogenetic disorders. The organs most affected are brain, viscera, bone and cartilage.\n\nThere is no direct medical treatment to cure LSDs.. The most common LSD is Gaucher's disease, which is due to deficiency of the enzyme glucocerebrosidase. Consequently, the enzyme substrate, the fatty acid glucosylceramide accumulates, particularly in white blood cells, which in turn affects spleen, liver, kidneys, lungs, brain and bone marrow. The disease is characterized by bruises, fatigue, anaemia, low blood platelets, osteoporosis, and enlargement of the liver and spleen.\n\nMetachromatic leukodystrophy is another lysosomal storage disease that also affects sphingolipid metabolism.\n\nLysosomotropism \n\nWeak bases with lipophilic properties accumulate in acidic intracellular compartments like lysosomes. While the plasma and lysosomal membranes are permeable for neutral and uncharged species of weak bases, the charged protonated species of weak bases do not permeate biomembranes and accumulate within lysosomes. The concentration within lysosomes may reach levels 100 to 1000 fold higher than extracellular concentrations. This phenomenon is called \"lysosomotropism\", \"acid trapping\" or \"proton pump\" effect Traganos F, Darzynkiewicz Z.(1994) Lysosomal proton pump activity: supravital cell staining with acridine orange differentiates leukocyte subpopulations. Methods Cell Biol. 1994;41:185-94.  . The amount of accumulation of lysosomotropic compounds may be estimated using a cell-based mathematical model.\n\nA significant part of the clinically approved drugs are lipophilic weak bases with lysosomotropic properties. This explains a number of pharmacological properties of these drugs, such as high tissue-to-blood concentration gradients or long tissue elimination half-lifes; these properties have been found for drugs such as haloperidol, levomepromazine, and amantadine. However, high tissue concentrations and long elimination half-lives are explained also by lipophilicity and absorption of drugs to fatty tissue structures. Important lysosomal enzymes, such as acid sphingomyelinase, may be inhibited by lysosomally accumulated drugs. Such compounds are termed FIASMAs (functional inhibitor of acid sphingomyelinase) and include for example fluoxetine, sertraline, or amitriptyline.\n\nAmbroxol is a lysosomotropic drug of clinical use to treat conditions of productive cough for its mucolytic action. Ambroxol triggers the exocytosis of lysosomes via neutralization of lysosomal pH and calcium release from acidic calcium stores. Presumably for this reason, Ambroxol was also found to improve cellular function in some disease of lysosomal origin such as Parkinson's or lysosomal storage disease.\n\nControversy in botany \n\nBy scientific convention, the term lysosome is applied to these vesicular organelles only in animals, and the term vacuole is applied to those in plants, fungi and algae (some animal cells also have vacuoles). Discoveries in plant cells since the 1970s started to challenge this definition. Plant vacuoles are found to be much more diverse in structure and function than previously thought. Some vacuoles contain their own hydrolytic enzymes and perform the classic lysosomal activity, which is autophagy. These vacuoles are therefore seen as fulfilling the role of the animal lysosome. Based on de Duve's description that \"only when considered as part of a system involved directly or indirectly in intracellular digestion does the term lysosome describe a physiological unit\", some botanists strongly argued that these vacuoles are lysosomes. However, this is not universally accepted as the vacuoles are strictly not similar to lysosomes, such as in their specific enzymes and lack of phagocytic functions. Vacuoles do not have catabolic activity and do not undergo exocytosis as lysosomes do.\n\nEtymology and pronunciation\n\nThe word lysosome (,) is New Latin that uses the combining forms lyso- (referring to lysis and derived from the Latin lysis, meaning \"to loosen\", via Ancient Greek λύσις [lúsis]), and -some, from soma, \"body\", yielding \"body that lyses\" or \"lytic body\". The adjectival form is lysosomal. The forms *lyosome and *lyosomal are much rarer; they use the lyo- form of the prefix but are often treated by readers and editors as mere unthinking replications of typos, which has no doubt been true as often as not. Lysosome. http://en.wikipedia.org/?curid=18120."
  }
}
