{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14696",
  "eid" : "17269160-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778548086,
  "textBody" : "The Israeli Declaration of Independence,Hebrew: הכרזת העצמאות, Hakhrazat HaAtzma'ut/מגילת העצמאות Megilat HaAtzma'utArabic: وثيقة إعلان قيام دولة إسرائيل, Wathiqat 'iielan qiam dawlat 'iisrayiyl formally the Declaration of the Establishment of the State of Israel (), was proclaimed on 14 May 1948 (5 Iyar 5708) by David Ben-Gurion, the Executive Head of the World Zionist OrganizationThen known as the Zionist Organization. and Chairman of the Jewish Agency for Palestine. It declared the establishment of a Jewish state in Eretz-Israel, to be known as the State of Israel, which would come into effect on termination of the British Mandate at midnight that day.[https://www.nytimes.com/learning/general/onthisday/big/0514.html Zionists Proclaim New State of Israel; Truman Recognizes it and Hopes for Peace] New York Times The event is celebrated annually in Israel with a national holiday Independence Day on 5 Iyar of every year according to the Hebrew calendar.\n\nBackground\n\nThe possibility of a Jewish homeland in Palestine had been a goal of Zionist organizations since the late 19th century. The British Foreign Secretary stated in the Balfour Declaration of 1917:\n\nHis Majesty's government view with favour the establishment in Palestine of a national home for the Jewish people, and will use their best endeavours to facilitate the achievement of this object, it being clearly understood that nothing shall be done which may prejudice the civil and religious rights of existing non-Jewish communities in Palestine, or the rights and political status enjoyed by Jews in any other country.Yapp, M.E. (1987). The Making of the Modern Near East 1792–1923. Harlow, England: Longman. p. 290. .\n\nAfter World War I, the United Kingdom was given a mandate for Palestine, which it had conquered from the Ottomans during the war. In 1937 the Peel Commission suggested partitioning Mandate Palestine into an Arab state and a Jewish state, though the proposal was rejected as unworkable by the government and was at least partially to blame for the renewal of the 1936–39 Arab revolt.\n\nIn the face of increasing violence after World War II, the British handed the issue over to the recently established United Nations. The result was Resolution 181(II), a plan to partition Palestine into Independent Arab and Jewish States and the Special International Regime for the City of Jerusalem. The Jewish state was to receive around 56% of the land area of Mandate Palestine, encompassing 82% of the Jewish population, though it would be separated from Jerusalem. The plan was accepted by most of the Jewish population, but rejected by much of the Arab populace. On 29 November 1947, the resolution to recommend to the United Kingdom, as the mandatory Power for Palestine, and to all other Members of the United Nations the adoption and implementation, with regard to the future government of Palestine, of the Plan of Partition with Economic Union was put to a vote in the United Nations General Assembly.[http://domino.un.org/unispal.nsf/0/7f0af2bd897689b785256c330061d253 UNITED NATIONS General Assembly: A/RES/181(II): 29 November 1947: Resolution 181 (II): Future government of Palestine: Retrieved 26 April 2012] \nThe result was 33 to 13 in favour of the resolution, with 10 abstentions. Resolution 181(II): PART I: Future constitution and government of Palestine: A. TERMINATION OF MANDATE, PARTITION AND INDEPENDENCE: Clause 3 provides:Independent Arab and Jewish States and the Special International Regime for the City of Jerusalem, ... shall come into existence in Palestine two months after the evacuation of the armed forces of the mandatory Power has been completed but in any case not later than 1 October 1948.\n\nThe Arab countries (all of which had opposed the plan) proposed to query the International Court of Justice on the competence of the General Assembly to partition a country, but the resolution was rejected.\n\nDrafting the text\n\nThe first draft of the declaration was made by Zvi Berenson, the Histadrut trade union's legal advisor and later a justice of the Supreme Court, at the request of Pinchas Rosen. A revised second draft was made by three lawyers, A. Beham, A. Hintzheimer and Z.E. Baker, and was framed by a committee including David Remez, Pinchas Rosen, Haim-Moshe Shapira, Moshe Sharett and Aharon Zisling. A second committee meeting, which included David Ben-Gurion, Yehuda Leib Maimon, Sharett and Zisling produced the final text.Harris, J. (1998) [http://jtr.lib.virginia.edu/the-israeli-declaration-of-independence-a-camel-is-a-horse-produced-by-a-committee/ The Israeli Declaration of Independence] The Journal of the Society for Textual Reasoning, Vol. 7\n\nMinhelet HaAm Vote\n\nOn 12 May 1948, the Minhelet HaAm (, lit. People's Administration) was convened to vote on declaring independence.Tuvia Friling, S. Ilan Troen (1998) \"Proclaiming Independence: Five Days in May from Ben-Gurion's Diary\" Israel Studies, 3.1, pp170-194Zeev Maoz, Ben D. Mor (2002) Bound by Struggle: The Strategic Evolution of Enduring International Rivalries, University of Michigan Press, p137 Three of the thirteen members were missing, with Yehuda Leib Maimon and Yitzhak Gruenbaum being blocked in besieged Jerusalem, while Yitzhak-Meir Levin was in the United States.\n\nThe meeting started at 1:45 in the afternoon and ended after midnight. The decision was between accepting the American proposal for a truce, or declaring independence. The latter option was put to a vote, with six of the ten members present supporting it:\n*For: David Ben-Gurion, Moshe Sharett (Mapai); Peretz Bernstein (General Zionists); Haim-Moshe Shapira (Hapoel HaMizrachi); Mordechai Bentov, Aharon Zisling (Mapam).\n*Against: Eliezer Kaplan, David Remez (Mapai); Pinchas Rosen (New Aliyah Party); Bechor-Shalom Sheetrit (Sephardim and Oriental Communities).\n\nChaim Weizmann, chairman of the World Zionist Organization and soon to be the first President of Israel, endorsed the decision, after reportedly asking \"What are they waiting for, the idiots?\"\n\nFinal wording\n\nThe draft text was submitted for approval to a meeting of Moetzet HaAm (, lit. People's Council) at the JNF building in Tel Aviv on 14 May. The meeting started at 13:50 and ended at 15:00, an hour before the declaration was due to be made, and despite ongoing disagreements, with a unanimous vote in favour of the final text. During the process, there were two major debates, centering on the issues of borders and religion. \n\nBorders\n\nOn the border issue, the original draft had declared that the borders would be that decided by the UN partition plan. While this was supported by Rosen and Bechor-Shalom Sheetrit, it was opposed by Ben-Gurion and Zisling, with Ben-Gurion stating, \"We accepted the UN Resolution, but the Arabs did not. They are preparing to make war on us. If we defeat them and capture western Galilee or territory on both sides of the road to Jerusalem, these areas will become part of the state. Why should we obligate ourselves to accept boundaries that in any case the Arabs don't accept?\"[http://www.mfa.gov.il/MFA/MFAArchive/1990_1999/1999/4/Shelley%20Kleiman%20-%20The%20State%20of%20Israel%20Declares%20Ind The State of Israel Declares Independence] Israeli Ministry of Foreign Affairs The inclusion of the designation of borders in the text was dropped after the provisional government of Israel, the Minhelet HaAm, voted 5–4 against it. The Revisionists, committed to a Jewish state on both sides of the Jordan River (that is, including Transjordan), wanted the phrase \"within its historic borders\" included but were unsuccessful.\n\nReligion\n\nThe second major issue was over the inclusion of God in the last section of the document, with the draft using the phrase \"and placing our trust in the Almighty\". The two rabbis, Shapira and Yehuda Leib Maimon, argued for its inclusion, saying that it could not be omitted, with Shapira supporting the wording \"God of Israel\" or \"the Almighty and Redeemer of Israel\". It was strongly opposed by Zisling, a member of the secularist Mapam. In the end the phrase \"Rock of Israel\" was used, which could be interpreted as either referring to God, or the land of Eretz Israel, Ben-Gurion saying \"Each of us, in his own way, believes in the 'Rock of Israel' as he conceives it. I should like to make one request: Don't let me put this phrase to a vote.\" Although its use was still opposed by Zisling, the phrase was accepted without a vote.\n\nName\n\nThe writers also had to decide on the name for the new state. Eretz Israel, Ever (from the name Eber), Judea, and Zion were all suggested, as were Ziona, Ivriya and Herzliya.Gilbert, M. (1998) Israel: A History, London: Doubleday. p. 187.  Judea and Zion were rejected because, according to the partition plan, Jerusalem (Zion) and most of the Judean mountains would be outside the new state. Ben-Gurion put forward \"Israel\" and it passed by a vote of 6–3.  Official documents released in April 2013 by the State Archive of Israel show that days before the establishment of the State of Israel in May 1948, officials were still debating about what the new country would be called in Arabic: Palestine (Filastin), Zion (Sayoun) or Israel (Eesra’il).  Two assumptions were made: \"That an Arab state was about to be established alongside the Jewish one in keeping with the UN’s partition resolution the year before, and that the Jewish state would include a large Arab minority whose feelings needed to be taken into account\".  In the end, the officials rejected the name Palestine because they thought that would be the name of the new Arab state and could cause confusion so they opted for the most straightforward option: Israel.\n\nOther items\n\nAt the meeting on 14 May, several other members of Moetzet HaAm suggested additions to the document. Meir Vilner wanted it to denounce the British Mandate and military but Sharett said it was out of place. Meir Argov pushed to mention the Displaced Persons camps in Europe and to guarantee freedom of language. Ben-Gurion agreed with the latter but noted that Hebrew should be the main language of the state.\n\nThe debate over wording did not end completely even after the Declaration had been made. Declaration signer Meir David Loewenstein later claimed, \"It ignored our sole right to Eretz Israel, which is based on the covenant of the Lord with Abraham, our father, and repeated promises in the Tanach. It ignored the aliya of the Ramban and the students of the Vilna Gaon and the Ba'al Shem Tov, and the [rights of] Jews who lived in the 'Old Yishuv'.\"[http://www.eretzisraelforever.net/Articles/Articles_ViewArticle.asp?sAction\nview&iArticleId=1825010290 Wallish and the Declaration of Independence] The Jerusalem Post, 1998 (republished on Eretz Israel Forever)\n\nDeclaration ceremony\n\nThe ceremony was held in the Tel Aviv Museum (today known as Independence Hall) but was not widely publicised as it was feared that the British Authorities might attempt to prevent it or that the Arab armies might invade earlier than expected. An invitation was sent out by messenger on the morning of 14 May telling recipients to arrive at 15:30 and to keep the event a secret. The event started at 16:00 (a time chosen so as not to breach the sabbath) and was broadcast live as the first transmission of the new radio station Kol Yisrael.\n\nThe final draft of the declaration was typed at the Jewish National Fund building following its approval earlier in the day. Ze'ev Sherf, who stayed at the building in order to deliver the text, had forgotten to arrange transport for himself. Ultimately, he had to flag down a passing car and ask the driver (who was driving a borrowed car without a license) to take him to the ceremony. Sherf's request was initially refused but he managed to persuade the driver to take him. The car was stopped by a policeman for speeding while driving across the city though a ticket was not issued after it was explained that he was delaying the declaration of independence. Sherf arrived at the museum at 15:59.\n\nAt 16:00, Ben-Gurion opened the ceremony by banging his gavel on the table, prompting a spontaneous rendition of Hatikvah, soon to be Israel's national anthem, from the 250 guests.[http://info.jpost.com/1998/Supplements/Jubilee/2.html One Day that Shook the world]  The Jerusalem Post, 30 April 1998, by Elli Wohlgelernter On the wall behind the podium hung a picture of Theodor Herzl, the founder of modern Zionism, and two flags, later to become the official flag of Israel.\n\nAfter telling the audience \"I shall now read to you the scroll of the Establishment of the State, which has passed its first reading by the National Council\", Ben-Gurion proceeded to read out the declaration, taking 16 minutes, ending with the words \"Let us accept the Foundation Scroll of the Jewish State by rising\" and calling on Rabbi Fishman to recite the Shehecheyanu blessing.\n\nThe entire declaration ceremony was recorded and broadcast live on Kol Yisrael (Voice of Israel) radio station.\n\nSignatories\n\nAs leader of the Yishuv, David Ben-Gurion was the first person to sign. The declaration was due to be signed by all 37 members of Moetzet HaAm. However, twelve members could not attend, eleven of them trapped in besieged Jerusalem and one abroad. The remaining 25 signatories present were called up in alphabetical order to sign, leaving spaces for those absent. Although a space was left for him between the signatures of Eliyahu Dobkin and Meir Vilner, Zerach Warhaftig signed at the top of the next column, leading to speculation that Vilner's name had been left alone to isolate him, or to stress that even a communist agreed with the declaration. However, Warhaftig later denied this, stating that a space had been left for him (as he was one of the signatories trapped in Jerusalem) where a Hebraicised form of his name would have fitted alphabetically, but he insisted on signing under his actual name so as to honour his father's memory and so moved down two spaces. He and Vilner would be the last surviving signatories, and remained close for the rest of their lives. Of the signatories, two were women (Golda Meir (Meyerson/Myerson) and Rachel Cohen-Kagan).[https://www.jewishvirtuallibrary.org/jsource/History/signers.html Establishment of Israel: Signatories to the Israeli Declaration of Independence] Jewish Virtual Library, 2015\n\nWhen Herzl Rosenblum, a journalist, was called up to sign, Ben-Gurion instructed him to sign under the name Herzl Vardi, his pen name, as he wanted more Hebrew names on the document. Although Rosenblum acquiesced to Ben-Gurion's request and legally changed his name to Vardi, he later admitted to regretting not signing as Rosenblum. Several other signatories later Hebraised their names, including Meir Argov (Grabovsky), Peretz Bernstein (then Fritz Bernstein), Avraham Granot (Granovsky), Avraham Nissan (Katznelson), Moshe Kol (Kolodny), Yehuda Leib Maimon (Fishman), Golda Meir (Meyerson/Myerson), Pinchas Rosen (Felix Rosenblueth) and Moshe Sharett (Shertok). Other signatories added their own touches, including Saadia Kobashi who added the phrase \"HaLevy\", referring to the tribe of Levi.[http://www.tam.co.il/23_4_2004/magazin11.htm For this reason we congregated]  Iton Tel Aviv, 23 April 2004\n\nAfter Sharett, the last of the signatories, had put his name to paper, the audience again stood and the Israel Philharmonic Orchestra played \"Hatikvah\". Ben-Gurion concluded the event with the words \"The State of Israel is established! This meeting is adjourned!\"\n\nContext and aftermath\n\nThe declaration was signed in a context of civil war between the Arab and Jewish populations of the Mandate that had started the day after the partition vote at the UN six months earlier. Neighbouring Arab states and the Arab League were opposed to the vote and had declared they would intervene to prevent its implementation. In a cablegram on 15 May 1948 to the Secretary-General of the United Nations, the Secretary-General of the League of Arab States claimed that \"the Arab states find themselves compelled to intervene in order to restore law and order and to check further bloodshed\".[https://www.un.org/Docs/journal/asp/ws.asp?m=S/745 PDF copy of Cablegram from the Secretary-General of the League of Arab States of the 15 May 1948: Retrieved 13 December 2013] \n\nOver the next few days after the declaration, armies of Egypt, Trans-Jordan, Iraq, and Syria engaged Israeli troops inside the area of what had just ceased to be Mandatory Palestine, thereby starting the 1948 Arab–Israeli War. A truce began on 11 June, but fighting resumed on 8 July and stopped again on 18 July, before restarting in mid-October and finally ending on 24 July 1949 with the signing of the armistice agreement with Syria. By then Israel had retained its independence and increased its land area by almost 50% compared to the 1947 UN Partition Plan.\n\nFollowing the declaration, Moetzet HaAm became the Provisional State Council, which acted as the legislative body for the new state until the first elections in January 1949.\n\nMany of the signatories would play a prominent role in Israeli politics following independence; Moshe Sharett and Golda Meir both served as Prime Minister, Yitzhak Ben-Zvi became the country's second president in 1952, and several others served as ministers. David Remez was the first signatory to pass away, dying in May 1951, while Meir Vilner, the youngest signatory at just 29, was the longest living, serving in the Knesset until 1990 and dying in June 2003. Eliyahu Berligne, the oldest signatory at 82, died in 1959.\n\nEleven minutes after midnight, the United States de facto recognized the State of Israel.[http://www.ourdocuments.gov/doc.php?doc83 United states de facto Regnition of State of Israel]: 14 May 1948: Retrieved 14 December 2013 This was followed by Shah Mohammad Reza Pahlavi's Iran (which had voted against the UN partition plan), Guatemala, Iceland, Nicaragua, Romania, and Uruguay. The Soviet Union was the first nation to fully recognize Israel de jure on 17 May 1948,Ian J. Bickerton (2009) The Arab-Israeli Conflict: A History Reaktion Books, p79 followed by Poland, Czechoslovakia, Yugoslavia, Ireland, and South Africa. The United States extended official recognition after the first Israeli election, as Truman had promised on 31 January 1949.[http://www.trumanlibrary.org/whistlestop/study_collections/israel/large/documents/index.php?documentdate\n1949-01-31&documentid1-15&collectionid\nROI&pagenumber=1 Press Release, 31 January 1949. Official File, Truman Papers] Truman Library By virtue of General Assembly Resolution 273 (III), Israel was admitted to membership in the United Nations on 11 May 1949.[https://unispal.un.org/UNISPAL.NSF/0/83E8C29DB812A4E9852560E50067A5AC UNITED NATIONS: General Assembly: A/RES/273 (III): 11 May 1949: 273 (III). Admission of Israel to membership in the United Nations] \n\nIn the three years following the 1948 Palestine war, about 700,000 Jews immigrated to Israel, residing mainly along the borders and in former Arab lands.Benny Morris, Righteous Victims, chap. VI. Around 136,000 were some of the 250,000 displaced Jews of World War II.[http://www.ushmm.org/wlc/article.php?lang\nen&ModuleId10005462 Displaced Persons] Retrieved 29 October 2007 from the US Holocaust Museum. And from the 1948 Arab–Israeli War until the early 1970s, 800,000–1,000,000 Jews left, fled, or were expelled from their homes in Arab countries; 260,000 of them reached Israel between 1948 and 1951; and 600,000 by 1972.Malka Hillel Shulewitz, The Forgotten Millions: The Modern Jewish Exodus from Arab Lands, Continuum 2001, pp. 139 and 155.Ada Aharoni [http://www.hsje.org/forcedmigration.htm \"The Forced Migration of Jews from Arab Countries\"] , Historical Society of Jews from Egypt website. Accessed 1 February 2009.\n\nAt the same time, a large number of Arabs left, fled or were expelled from, what became Israel. In the Report of the Technical Committee on Refugees (Submitted to the United Nations Conciliation Commission for Palestine in Lausanne on 7 September 1949)- (A/1367/Rev.1), in paragraph 15, the estimate of the statistical expert, which the Committee believed to be as accurate as circumstances permitted, indicated that the refugees from Israel- controlled territory amounted to approximately 711,000.\n\nStatus in Israeli law\n\nParagraph 13 of the Declaration provides that the State of Israel would be based on freedom, justice and peace as envisaged by the prophets of Israel; it will ensure complete equality of social and political rights to all its inhabitants irrespective of religion, race or sex;. However, the Knesset maintains that the declaration is neither a law nor an ordinary legal document.[https://www.knesset.gov.il/lexicon/eng/megilat_eng.htm The Proclamation of Independence] Knesset website The Supreme Court has ruled that the guarantees were merely guiding principles, and that the declaration is not a constitutional law making a practical ruling on the upholding or nullification of various ordinances and statutes.[http://www.mfa.gov.il/NR/exeres/11364F53-F19B-4760-AA91-E066DDD0B29B.htm The Declaration of the Establishment of the State of Israel] Israeli Ministry of Foreign Affairs\n\nIn 1994 the Knesset amended two basic laws, Human Dignity and Liberty and Freedom of Occupation, introducing (among other changes) a statement saying \"the fundamental human rights in Israel will be honored (...) in the spirit of the principles included in the declaration of the establishment of the State of Israel.\"\n\nThe scroll\n\nAlthough Ben-Gurion had told the audience that he was reading from the scroll of independence, he was actually reading from handwritten notes because only the bottom part of the scroll had been finished by artist and calligrapher Otte Wallish by the time of the declaration (he did not complete the entire document until June). The scroll, which is bound together in three parts, is generally kept in the country's National Archives, though it is currently on display at the Israel Museum.\n\nOfficial translation\n\nTranslation of the Declaration by the Israel Ministry of Foreign Affairs.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Israeli Declaration of Independence" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14696" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Israeli Declaration of Independence,Hebrew: הכרזת העצמאות, Hakhrazat HaAtzma'ut/מגילת העצמאות Megilat HaAtzma'utArabic: وثيقة إعلان قيام دولة إسرائيل, Wathiqat 'iielan qiam dawlat 'iisrayiyl formally the Declaration of the Establishment of the State of Israel (), was proclaimed on 14 May 1948 (5 Iyar 5708) by David Ben-Gurion, the Executive Head of the World Zionist OrganizationThen known as the Zionist Organization. and Chairman of the Jewish Agency for Palestine. It declared the establishment of a Jewish state in Eretz-Israel, to be known as the State of Israel, which would come into effect on termination of the British Mandate at midnight that day.[https://www.nytimes.com/learning/general/onthisday/big/0514.html Zionists Proclaim New State of Israel; Truman Recognizes it and Hopes for Peace] New York Times The event is celebrated annually in Israel with a national holiday Independence Day on 5 Iyar of every year according to the Hebrew calendar.\n\nBackground\n\nThe possibility of a Jewish homeland in Palestine had been a goal of Zionist organizations since the late 19th century. The British Foreign Secretary stated in the Balfour Declaration of 1917:\n\nHis Majesty's government view with favour the establishment in Palestine of a national home for the Jewish people, and will use their best endeavours to facilitate the achievement of this object, it being clearly understood that nothing shall be done which may prejudice the civil and religious rights of existing non-Jewish communities in Palestine, or the rights and political status enjoyed by Jews in any other country.Yapp, M.E. (1987). The Making of the Modern Near East 1792–1923. Harlow, England: Longman. p. 290. .\n\nAfter World War I, the United Kingdom was given a mandate for Palestine, which it had conquered from the Ottomans during the war. In 1937 the Peel Commission suggested partitioning Mandate Palestine into an Arab state and a Jewish state, though the proposal was rejected as unworkable by the government and was at least partially to blame for the renewal of the 1936–39 Arab revolt.\n\nIn the face of increasing violence after World War II, the British handed the issue over to the recently established United Nations. The result was Resolution 181(II), a plan to partition Palestine into Independent Arab and Jewish States and the Special International Regime for the City of Jerusalem. The Jewish state was to receive around 56% of the land area of Mandate Palestine, encompassing 82% of the Jewish population, though it would be separated from Jerusalem. The plan was accepted by most of the Jewish population, but rejected by much of the Arab populace. On 29 November 1947, the resolution to recommend to the United Kingdom, as the mandatory Power for Palestine, and to all other Members of the United Nations the adoption and implementation, with regard to the future government of Palestine, of the Plan of Partition with Economic Union was put to a vote in the United Nations General Assembly.[http://domino.un.org/unispal.nsf/0/7f0af2bd897689b785256c330061d253 UNITED NATIONS General Assembly: A/RES/181(II): 29 November 1947: Resolution 181 (II): Future government of Palestine: Retrieved 26 April 2012] \nThe result was 33 to 13 in favour of the resolution, with 10 abstentions. Resolution 181(II): PART I: Future constitution and government of Palestine: A. TERMINATION OF MANDATE, PARTITION AND INDEPENDENCE: Clause 3 provides:Independent Arab and Jewish States and the Special International Regime for the City of Jerusalem, ... shall come into existence in Palestine two months after the evacuation of the armed forces of the mandatory Power has been completed but in any case not later than 1 October 1948.\n\nThe Arab countries (all of which had opposed the plan) proposed to query the International Court of Justice on the competence of the General Assembly to partition a country, but the resolution was rejected.\n\nDrafting the text\n\nThe first draft of the declaration was made by Zvi Berenson, the Histadrut trade union's legal advisor and later a justice of the Supreme Court, at the request of Pinchas Rosen. A revised second draft was made by three lawyers, A. Beham, A. Hintzheimer and Z.E. Baker, and was framed by a committee including David Remez, Pinchas Rosen, Haim-Moshe Shapira, Moshe Sharett and Aharon Zisling. A second committee meeting, which included David Ben-Gurion, Yehuda Leib Maimon, Sharett and Zisling produced the final text.Harris, J. (1998) [http://jtr.lib.virginia.edu/the-israeli-declaration-of-independence-a-camel-is-a-horse-produced-by-a-committee/ The Israeli Declaration of Independence] The Journal of the Society for Textual Reasoning, Vol. 7\n\nMinhelet HaAm Vote\n\nOn 12 May 1948, the Minhelet HaAm (, lit. People's Administration) was convened to vote on declaring independence.Tuvia Friling, S. Ilan Troen (1998) \"Proclaiming Independence: Five Days in May from Ben-Gurion's Diary\" Israel Studies, 3.1, pp170-194Zeev Maoz, Ben D. Mor (2002) Bound by Struggle: The Strategic Evolution of Enduring International Rivalries, University of Michigan Press, p137 Three of the thirteen members were missing, with Yehuda Leib Maimon and Yitzhak Gruenbaum being blocked in besieged Jerusalem, while Yitzhak-Meir Levin was in the United States.\n\nThe meeting started at 1:45 in the afternoon and ended after midnight. The decision was between accepting the American proposal for a truce, or declaring independence. The latter option was put to a vote, with six of the ten members present supporting it:\n*For: David Ben-Gurion, Moshe Sharett (Mapai); Peretz Bernstein (General Zionists); Haim-Moshe Shapira (Hapoel HaMizrachi); Mordechai Bentov, Aharon Zisling (Mapam).\n*Against: Eliezer Kaplan, David Remez (Mapai); Pinchas Rosen (New Aliyah Party); Bechor-Shalom Sheetrit (Sephardim and Oriental Communities).\n\nChaim Weizmann, chairman of the World Zionist Organization and soon to be the first President of Israel, endorsed the decision, after reportedly asking \"What are they waiting for, the idiots?\"\n\nFinal wording\n\nThe draft text was submitted for approval to a meeting of Moetzet HaAm (, lit. People's Council) at the JNF building in Tel Aviv on 14 May. The meeting started at 13:50 and ended at 15:00, an hour before the declaration was due to be made, and despite ongoing disagreements, with a unanimous vote in favour of the final text. During the process, there were two major debates, centering on the issues of borders and religion. \n\nBorders\n\nOn the border issue, the original draft had declared that the borders would be that decided by the UN partition plan. While this was supported by Rosen and Bechor-Shalom Sheetrit, it was opposed by Ben-Gurion and Zisling, with Ben-Gurion stating, \"We accepted the UN Resolution, but the Arabs did not. They are preparing to make war on us. If we defeat them and capture western Galilee or territory on both sides of the road to Jerusalem, these areas will become part of the state. Why should we obligate ourselves to accept boundaries that in any case the Arabs don't accept?\"[http://www.mfa.gov.il/MFA/MFAArchive/1990_1999/1999/4/Shelley%20Kleiman%20-%20The%20State%20of%20Israel%20Declares%20Ind The State of Israel Declares Independence] Israeli Ministry of Foreign Affairs The inclusion of the designation of borders in the text was dropped after the provisional government of Israel, the Minhelet HaAm, voted 5–4 against it. The Revisionists, committed to a Jewish state on both sides of the Jordan River (that is, including Transjordan), wanted the phrase \"within its historic borders\" included but were unsuccessful.\n\nReligion\n\nThe second major issue was over the inclusion of God in the last section of the document, with the draft using the phrase \"and placing our trust in the Almighty\". The two rabbis, Shapira and Yehuda Leib Maimon, argued for its inclusion, saying that it could not be omitted, with Shapira supporting the wording \"God of Israel\" or \"the Almighty and Redeemer of Israel\". It was strongly opposed by Zisling, a member of the secularist Mapam. In the end the phrase \"Rock of Israel\" was used, which could be interpreted as either referring to God, or the land of Eretz Israel, Ben-Gurion saying \"Each of us, in his own way, believes in the 'Rock of Israel' as he conceives it. I should like to make one request: Don't let me put this phrase to a vote.\" Although its use was still opposed by Zisling, the phrase was accepted without a vote.\n\nName\n\nThe writers also had to decide on the name for the new state. Eretz Israel, Ever (from the name Eber), Judea, and Zion were all suggested, as were Ziona, Ivriya and Herzliya.Gilbert, M. (1998) Israel: A History, London: Doubleday. p. 187.  Judea and Zion were rejected because, according to the partition plan, Jerusalem (Zion) and most of the Judean mountains would be outside the new state. Ben-Gurion put forward \"Israel\" and it passed by a vote of 6–3.  Official documents released in April 2013 by the State Archive of Israel show that days before the establishment of the State of Israel in May 1948, officials were still debating about what the new country would be called in Arabic: Palestine (Filastin), Zion (Sayoun) or Israel (Eesra’il).  Two assumptions were made: \"That an Arab state was about to be established alongside the Jewish one in keeping with the UN’s partition resolution the year before, and that the Jewish state would include a large Arab minority whose feelings needed to be taken into account\".  In the end, the officials rejected the name Palestine because they thought that would be the name of the new Arab state and could cause confusion so they opted for the most straightforward option: Israel.\n\nOther items\n\nAt the meeting on 14 May, several other members of Moetzet HaAm suggested additions to the document. Meir Vilner wanted it to denounce the British Mandate and military but Sharett said it was out of place. Meir Argov pushed to mention the Displaced Persons camps in Europe and to guarantee freedom of language. Ben-Gurion agreed with the latter but noted that Hebrew should be the main language of the state.\n\nThe debate over wording did not end completely even after the Declaration had been made. Declaration signer Meir David Loewenstein later claimed, \"It ignored our sole right to Eretz Israel, which is based on the covenant of the Lord with Abraham, our father, and repeated promises in the Tanach. It ignored the aliya of the Ramban and the students of the Vilna Gaon and the Ba'al Shem Tov, and the [rights of] Jews who lived in the 'Old Yishuv'.\"[http://www.eretzisraelforever.net/Articles/Articles_ViewArticle.asp?sAction\nview&iArticleId=1825010290 Wallish and the Declaration of Independence] The Jerusalem Post, 1998 (republished on Eretz Israel Forever)\n\nDeclaration ceremony\n\nThe ceremony was held in the Tel Aviv Museum (today known as Independence Hall) but was not widely publicised as it was feared that the British Authorities might attempt to prevent it or that the Arab armies might invade earlier than expected. An invitation was sent out by messenger on the morning of 14 May telling recipients to arrive at 15:30 and to keep the event a secret. The event started at 16:00 (a time chosen so as not to breach the sabbath) and was broadcast live as the first transmission of the new radio station Kol Yisrael.\n\nThe final draft of the declaration was typed at the Jewish National Fund building following its approval earlier in the day. Ze'ev Sherf, who stayed at the building in order to deliver the text, had forgotten to arrange transport for himself. Ultimately, he had to flag down a passing car and ask the driver (who was driving a borrowed car without a license) to take him to the ceremony. Sherf's request was initially refused but he managed to persuade the driver to take him. The car was stopped by a policeman for speeding while driving across the city though a ticket was not issued after it was explained that he was delaying the declaration of independence. Sherf arrived at the museum at 15:59.\n\nAt 16:00, Ben-Gurion opened the ceremony by banging his gavel on the table, prompting a spontaneous rendition of Hatikvah, soon to be Israel's national anthem, from the 250 guests.[http://info.jpost.com/1998/Supplements/Jubilee/2.html One Day that Shook the world]  The Jerusalem Post, 30 April 1998, by Elli Wohlgelernter On the wall behind the podium hung a picture of Theodor Herzl, the founder of modern Zionism, and two flags, later to become the official flag of Israel.\n\nAfter telling the audience \"I shall now read to you the scroll of the Establishment of the State, which has passed its first reading by the National Council\", Ben-Gurion proceeded to read out the declaration, taking 16 minutes, ending with the words \"Let us accept the Foundation Scroll of the Jewish State by rising\" and calling on Rabbi Fishman to recite the Shehecheyanu blessing.\n\nThe entire declaration ceremony was recorded and broadcast live on Kol Yisrael (Voice of Israel) radio station.\n\nSignatories\n\nAs leader of the Yishuv, David Ben-Gurion was the first person to sign. The declaration was due to be signed by all 37 members of Moetzet HaAm. However, twelve members could not attend, eleven of them trapped in besieged Jerusalem and one abroad. The remaining 25 signatories present were called up in alphabetical order to sign, leaving spaces for those absent. Although a space was left for him between the signatures of Eliyahu Dobkin and Meir Vilner, Zerach Warhaftig signed at the top of the next column, leading to speculation that Vilner's name had been left alone to isolate him, or to stress that even a communist agreed with the declaration. However, Warhaftig later denied this, stating that a space had been left for him (as he was one of the signatories trapped in Jerusalem) where a Hebraicised form of his name would have fitted alphabetically, but he insisted on signing under his actual name so as to honour his father's memory and so moved down two spaces. He and Vilner would be the last surviving signatories, and remained close for the rest of their lives. Of the signatories, two were women (Golda Meir (Meyerson/Myerson) and Rachel Cohen-Kagan).[https://www.jewishvirtuallibrary.org/jsource/History/signers.html Establishment of Israel: Signatories to the Israeli Declaration of Independence] Jewish Virtual Library, 2015\n\nWhen Herzl Rosenblum, a journalist, was called up to sign, Ben-Gurion instructed him to sign under the name Herzl Vardi, his pen name, as he wanted more Hebrew names on the document. Although Rosenblum acquiesced to Ben-Gurion's request and legally changed his name to Vardi, he later admitted to regretting not signing as Rosenblum. Several other signatories later Hebraised their names, including Meir Argov (Grabovsky), Peretz Bernstein (then Fritz Bernstein), Avraham Granot (Granovsky), Avraham Nissan (Katznelson), Moshe Kol (Kolodny), Yehuda Leib Maimon (Fishman), Golda Meir (Meyerson/Myerson), Pinchas Rosen (Felix Rosenblueth) and Moshe Sharett (Shertok). Other signatories added their own touches, including Saadia Kobashi who added the phrase \"HaLevy\", referring to the tribe of Levi.[http://www.tam.co.il/23_4_2004/magazin11.htm For this reason we congregated]  Iton Tel Aviv, 23 April 2004\n\nAfter Sharett, the last of the signatories, had put his name to paper, the audience again stood and the Israel Philharmonic Orchestra played \"Hatikvah\". Ben-Gurion concluded the event with the words \"The State of Israel is established! This meeting is adjourned!\"\n\nContext and aftermath\n\nThe declaration was signed in a context of civil war between the Arab and Jewish populations of the Mandate that had started the day after the partition vote at the UN six months earlier. Neighbouring Arab states and the Arab League were opposed to the vote and had declared they would intervene to prevent its implementation. In a cablegram on 15 May 1948 to the Secretary-General of the United Nations, the Secretary-General of the League of Arab States claimed that \"the Arab states find themselves compelled to intervene in order to restore law and order and to check further bloodshed\".[https://www.un.org/Docs/journal/asp/ws.asp?m=S/745 PDF copy of Cablegram from the Secretary-General of the League of Arab States of the 15 May 1948: Retrieved 13 December 2013] \n\nOver the next few days after the declaration, armies of Egypt, Trans-Jordan, Iraq, and Syria engaged Israeli troops inside the area of what had just ceased to be Mandatory Palestine, thereby starting the 1948 Arab–Israeli War. A truce began on 11 June, but fighting resumed on 8 July and stopped again on 18 July, before restarting in mid-October and finally ending on 24 July 1949 with the signing of the armistice agreement with Syria. By then Israel had retained its independence and increased its land area by almost 50% compared to the 1947 UN Partition Plan.\n\nFollowing the declaration, Moetzet HaAm became the Provisional State Council, which acted as the legislative body for the new state until the first elections in January 1949.\n\nMany of the signatories would play a prominent role in Israeli politics following independence; Moshe Sharett and Golda Meir both served as Prime Minister, Yitzhak Ben-Zvi became the country's second president in 1952, and several others served as ministers. David Remez was the first signatory to pass away, dying in May 1951, while Meir Vilner, the youngest signatory at just 29, was the longest living, serving in the Knesset until 1990 and dying in June 2003. Eliyahu Berligne, the oldest signatory at 82, died in 1959.\n\nEleven minutes after midnight, the United States de facto recognized the State of Israel.[http://www.ourdocuments.gov/doc.php?doc83 United states de facto Regnition of State of Israel]: 14 May 1948: Retrieved 14 December 2013 This was followed by Shah Mohammad Reza Pahlavi's Iran (which had voted against the UN partition plan), Guatemala, Iceland, Nicaragua, Romania, and Uruguay. The Soviet Union was the first nation to fully recognize Israel de jure on 17 May 1948,Ian J. Bickerton (2009) The Arab-Israeli Conflict: A History Reaktion Books, p79 followed by Poland, Czechoslovakia, Yugoslavia, Ireland, and South Africa. The United States extended official recognition after the first Israeli election, as Truman had promised on 31 January 1949.[http://www.trumanlibrary.org/whistlestop/study_collections/israel/large/documents/index.php?documentdate\n1949-01-31&documentid1-15&collectionid\nROI&pagenumber=1 Press Release, 31 January 1949. Official File, Truman Papers] Truman Library By virtue of General Assembly Resolution 273 (III), Israel was admitted to membership in the United Nations on 11 May 1949.[https://unispal.un.org/UNISPAL.NSF/0/83E8C29DB812A4E9852560E50067A5AC UNITED NATIONS: General Assembly: A/RES/273 (III): 11 May 1949: 273 (III). Admission of Israel to membership in the United Nations] \n\nIn the three years following the 1948 Palestine war, about 700,000 Jews immigrated to Israel, residing mainly along the borders and in former Arab lands.Benny Morris, Righteous Victims, chap. VI. Around 136,000 were some of the 250,000 displaced Jews of World War II.[http://www.ushmm.org/wlc/article.php?lang\nen&ModuleId10005462 Displaced Persons] Retrieved 29 October 2007 from the US Holocaust Museum. And from the 1948 Arab–Israeli War until the early 1970s, 800,000–1,000,000 Jews left, fled, or were expelled from their homes in Arab countries; 260,000 of them reached Israel between 1948 and 1951; and 600,000 by 1972.Malka Hillel Shulewitz, The Forgotten Millions: The Modern Jewish Exodus from Arab Lands, Continuum 2001, pp. 139 and 155.Ada Aharoni [http://www.hsje.org/forcedmigration.htm \"The Forced Migration of Jews from Arab Countries\"] , Historical Society of Jews from Egypt website. Accessed 1 February 2009.\n\nAt the same time, a large number of Arabs left, fled or were expelled from, what became Israel. In the Report of the Technical Committee on Refugees (Submitted to the United Nations Conciliation Commission for Palestine in Lausanne on 7 September 1949)- (A/1367/Rev.1), in paragraph 15, the estimate of the statistical expert, which the Committee believed to be as accurate as circumstances permitted, indicated that the refugees from Israel- controlled territory amounted to approximately 711,000.\n\nStatus in Israeli law\n\nParagraph 13 of the Declaration provides that the State of Israel would be based on freedom, justice and peace as envisaged by the prophets of Israel; it will ensure complete equality of social and political rights to all its inhabitants irrespective of religion, race or sex;. However, the Knesset maintains that the declaration is neither a law nor an ordinary legal document.[https://www.knesset.gov.il/lexicon/eng/megilat_eng.htm The Proclamation of Independence] Knesset website The Supreme Court has ruled that the guarantees were merely guiding principles, and that the declaration is not a constitutional law making a practical ruling on the upholding or nullification of various ordinances and statutes.[http://www.mfa.gov.il/NR/exeres/11364F53-F19B-4760-AA91-E066DDD0B29B.htm The Declaration of the Establishment of the State of Israel] Israeli Ministry of Foreign Affairs\n\nIn 1994 the Knesset amended two basic laws, Human Dignity and Liberty and Freedom of Occupation, introducing (among other changes) a statement saying \"the fundamental human rights in Israel will be honored (...) in the spirit of the principles included in the declaration of the establishment of the State of Israel.\"\n\nThe scroll\n\nAlthough Ben-Gurion had told the audience that he was reading from the scroll of independence, he was actually reading from handwritten notes because only the bottom part of the scroll had been finished by artist and calligrapher Otte Wallish by the time of the declaration (he did not complete the entire document until June). The scroll, which is bound together in three parts, is generally kept in the country's National Archives, though it is currently on display at the Israel Museum.\n\nOfficial translation\n\nTranslation of the Declaration by the Israel Ministry of Foreign Affairs. Israeli Declaration of Independence. http://en.wikipedia.org/?curid=14696."
  }
}
