{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18887",
  "eid" : "35cf3b30-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778599523,
  "textBody" : "Metaphilosophy (sometimes called philosophy of philosophy) is \"the investigation of the nature of philosophy\". Its subject matter includes the aims of philosophy, the boundaries of philosophy, and its methods.\n\n  Thus, while philosophy characteristically inquires into the nature of being, the reality of objects, the possibility of knowledge, the nature of truth, and so on, metaphilosophy is the self-reflective inquiry into the nature, aims, and methods of the activity that makes these kinds of inquiries, by asking what is philosophy itself, what sorts of questions it should ask, how it might pose and answer them, and what it can achieve in doing so. It is considered by some to be a subject prior and preparatory to philosophy,See for example,  while others see it as inherently a part of philosophy, or automatically a part of philosophy  while others adopt some combination of these views.  The interest in metaphilosophy led to the establishment of the journal Metaphilosophy in January 1970.\nThe journal [http://onlinelibrary.wiley.com/journal/10.1111/%28ISSN%291467-9973/homepage/ProductInformation.html describes its scope] as: \"Particular areas of interest include: the foundation, scope, function and direction of philosophy; justification of philosophical methods and arguments; the interrelations among schools or fields of philosophy (for example, the relation of logic to problems in ethics or epistemology); aspects of philosophical systems; presuppositions of philosophical schools; the relation of philosophy to other disciplines (for example, artificial intelligence, linguistics or literature); sociology of philosophy; the relevance of philosophy to social and political action; issues in the teaching of philosophy.\"\n\nAlthough the term metaphilosophy and explicit attention to metaphilosophy as a specific domain within philosophy arose in the 20th century, the topic is likely as old as philosophy itself, and can be traced back at least as far as the works of Plato and Aristotle. http://www.iep.utm.edu/con-meta/#SH1a\n\nRelationship to philosophy\n\nSome philosophers consider metaphilosophy to be a subject apart from philosophy, above or beyond it, while others object to that idea. Timothy Williamson argues that the philosophy of philosophy is \"automatically part of philosophy\", as is the philosophy of anything else. Nicholas Bunnin and Jiyuan Yu write that the separation of first- from second-order study has lost popularity as philosophers find it hard to observe the distinction. As evidenced by these contrasting opinions, debate persists as to whether the evaluation of the nature of philosophy is 'second order philosophy' or simply 'plain philosophy'.\n\nMany philosophers have expressed doubts over the value of metaphilosophy.\n\n Among them is Gilbert Ryle : \"preoccupation with questions about methods tends to distract us from prosecuting the methods themselves. We run as a rule, worse, not better, if we think a lot about our feet. So let us... not speak of it all but just do it.\"\n Quoted by \n\nTerminology\n\nThe designations metaphilosophy and philosophy of philosophy have a variety of meanings, sometimes taken to be synonyms, and sometimes seen as distinct.\n\nMorris Lazerowitz claims to have coined the term 'metaphilosophy' around 1940 and used it in print in 1942. see also the Internet Encyclopedia of Philosophy article by Nicholas Joll: [http://www.iep.utm.edu/con-meta/#SH1b Contemporary Metaphilosophy]  Lazerowitz proposed that metaphilosophy is 'the investigation of the nature of philosophy'.  Earlier uses have been found in translations from the French.e.g. Clemenceau G., In the evening of my thought (Au soir de la pensée, Paris: Plon, 1927), Houghton Mifflin company, 1929, Vol. 2, p.498: \"this teratological product of metaphilosophy\"; Gilson E., Christianity and philosophy, Pub. for the Institute of Mediaeval Studies by Sheed & Ward, 1939, p. 88 The term is derived from Greek word meta μετά (\"after\", \"beyond\", \"with\") and philosophía φιλοσοφία (\"love of wisdom\").\n\nThe term 'metaphilosophy' is used by Paul Moser in the sense of a 'second-order' or more fundamental undertaking than philosophy itself, in the manner suggested by Charles Griswold:\n\nThis usage was considered nonsense by Ludwig Wittgenstein, who rejected the analogy between metalanguage and a metaphilosophy. As expressed by Martin Heidegger:\n\nSome other philosophers treat the prefix meta as simply meaning 'about...', rather than as referring to a metatheoretical 'second-order' form of philosophy, among them Rescher and Double.  Others, such as Williamson, prefer the term 'philosophy of philosophy instead of 'metaphilosophy' as it avoids the connotation of a 'second-order' discipline that looks down on philosophy, and instead denotes something that is a part of it.  Joll suggests that to take metaphilosophy as 'the application of the methods of philosophy to philosophy itself' is too vague, while the view that sees metaphilosophy as a 'second-order' or more abstract discipline, outside philosophy, \"is narrow and tendentious\".\n\nIn the analytical tradition, the term \"metaphilosophy\" is mostly used to tag commenting and research on previous works as opposed to original contributions towards solving philosophical problems.e.g.PhilPapers\n\nWritings\n\nLudwig Wittgenstein wrote about the nature of philosophical puzzles and philosophical understanding. He suggested philosophical errors arose from confusions about the nature of philosophical inquiry. In the Philosophical Investigations, Wittgenstein wrote that there is not a metaphilosophy in the sense of a metatheory of philosophy.One might think: if philosophy speaks of the use of the word \"philosophy\" there must be a second-order philosophy. But it is not so; it is, rather, like the case of othography, which deals with the word \"orthography\"  among others without then being second order. Ludwig Wittgenstein Philosophical Investigations Blackwell Oxford 1963 para 121.\n\nC. D. Broad distinguished Critical from Speculative philosophy in his \"The Subject-matter of Philosophy, and its Relations to the special Sciences,\" in Introduction to Scientific Thought, 1923. Curt Ducasse, in Philosophy as a Science, examines several views of the nature of philosophy, and concludes that philosophy has a distinct subject matter: appraisals. Ducasse's view has been among the first to be described as 'metaphilosophy'.Dommeyer F., (1961), A Critical Examination of C. J. Ducasse's Metaphilosophy, Philosophy and Phenomenological Research, Vol. 21, (Jun., 1961), No. 4 pp. 439-455\n\nHenri Lefebvre in Metaphilosophie (1965)  argued, from a Marxian standpoint, in favor of an \"ontological break\", as a necessary methodological approach for critical social theory (whilst criticizing Louis Althusser's \"epistemological break\" with subjective Marxism, which represented a fundamental theoretical tool for the school of Marxist structuralism).\n\nPaul Moser writes that typical metaphilosophical discussion includes determining the conditions under which a claim can be said to be a philosophical one. He regards meta-ethics, the study of ethics, to be a form of metaphilosophy, as well as meta-epistemology, the study of epistemology.\n\nTopics\n\nMany sub-disciplines of philosophy have their own branch of 'metaphilosophy', examples being Meta-aesthetics, Meta-epistemology, Meta-ethics, Meta-ontology, and so forth.\n\n However, some topics within 'metaphilosophy' cut across the various subdivisions of philosophy to consider fundamentals important to all its sub-disciplines. Some of these are mentioned below.\n\nAims\n\nSome philosophers (e.g. existentialists, pragmatists) think philosophy is ultimately a practical discipline that should help us lead meaningful lives by showing us who we are, how we relate to the world around us and what we should do.  Others (e.g. analytic philosophers) see philosophy as a technical, formal, and entirely theoretical discipline, with goals such as \"the disinterested pursuit of knowledge for its own sake\".Penguin Dictionary of Philosophy Other proposed goals of philosophy include \"discover[ing] the absolutely fundamental reason of everything it investigates\",Modern Thomistic Philosophy by R Phillips \"making explicit the nature and significance of ordinary and scientific beliefs\",Collins English Dictionary and unifying and transcending the insights given by science and religion.Mastering Philosophy by Anthony Harrison-Barbet Others proposed that philosophy is a complex discipline because it has 4 or 6 different dimensions.Adler, Mortimer (1993) The Four Dimensions of Philosophy: Metaphysical-Moral-Objective-Categorical\n\nBoundaries\n\nDefining philosophy and its boundaries is itself problematic; Nigel Warburton has called it \"notoriously difficult\". There is no straightforward definition,Mastering Philosophy, by Anthony Harrison-Barbet and most interesting definitions are controversial. As Bertrand Russell wrote:\n\nWhile there is some agreement that philosophy involves general or fundamental topics,Penguin Dictionary of Philosophy: \"the most fundamental and general concepts and principles involved in thought, action and reality\"Modern Thomistic Philosophy, by R. Phillips: \"the absolutely fundamental reason of everything it investigates\",  \"the fundamental reasons or causes of all things\"\n there is no clear agreement about a series of demarcation issues, including:\n\n*that between first-order and second-order investigations. Some authors say that philosophical inquiry is second-order, having concepts, theories and presupposition as its subject matter; that it is \"thinking about thinking\", of a \"generally second-order character\"; that philosophers study, rather than use, the concepts that structure our thinking. However, the Oxford Dictionary of Philosophy warns that \"the borderline between such 'second-order' reflection, and ways of practicing the first-order discipline itself, is not always clear: philosophical problems may be tamed by the advance of a discipline, and the conduct of a discipline may be swayed by philosophical reflection\".\n*that between philosophy and empirical science. Some argue that philosophy is distinct from science in that its questions cannot be answered empirically, that is, by observation or experiment.\n\n Some analytical philosophers argue that all meaningful empirical questions are to be answered by science, not philosophy. However, some schools of contemporary philosophy such as the pragmatists and naturalistic epistemologists argue that philosophy should be linked to science and should be scientific in the broad sense of that term, \"preferring to see philosophical reflection as continuous with the best practice of any field of intellectual enquiry\".\n\n*that between philosophy and religion. Some argue that philosophy is distinct from religion in that it allows no place for faith or revelation.Penguin Encyclopedia: that philosophy does not try to answer questions by appeal to revelation, myth or religious knowledge of any kind, but uses reason, \"without reference to sensible observation and experiments\". However, philosophers and theologians such as Thomas Aquinas and Peter Damian have argued that philosophy is the \"handmaiden of theology\" (ancilla theologiae).Gracia, J.G. and Noone, T.B., A Companion to Philosophy in the Middle Ages, London 2003, p.35\n\nMethods\n\nPhilosophical method (or philosophical methodology) is the study of how to do philosophy. A common view among philosophers is that philosophy is distinguished by the ways that philosophers follow in addressing philosophical questions. There is not just one method that philosophers use to answer philosophical questions.\n\nRecently, some philosophers have cast doubt about intuition as a basic tool in philosophical inquiry, from Socrates up to contemporary philosophy of language. In Rethinking IntuitionRethinking Intuition: The Psychology of Intuition and its Role in Philosophical Inquiry ,(Studies in Epistemology and Cognitive Theory)\nMichael DePaul, William Ramsey (Editors), Rowman & Littlefield Publishers, Inc. (1998) ;  various thinkers discard intuition as a valid source of knowledge and thereby call into question 'a priori' philosophy. Experimental philosophy is a form of philosophical inquiry that makes at least partial use of empirical research—especially opinion polling—in order to address persistent philosophical questions. This is in contrast with the methods found in analytic philosophy, whereby some say a philosopher will sometimes begin by appealing to his or her intuitions on an issue and then form an argument with those intuitions as premises.Knobe (forthcoming). However, disagreement about what experimental philosophy can accomplish is widespread and several philosophers have offered criticisms. One claim is that the empirical data gathered by experimental philosophers can have an indirect effect on philosophical questions by allowing for a better understanding of the underlying psychological processes which lead to philosophical intuitions.Knobe, J. and Nichols, S. (eds.) (2008) Experimental Philosophy] §2.1, \n\nProgress\n\nA prominent question in metaphilosophy is that of whether or not philosophical progress occurs and more so, whether such progress in philosophy is even possible.Dietrich, Eric (2011). [http://commons.pacificu.edu/eip/vol12/iss2/9/ There Is No Progress in Philosophy]. Essays in Philosophy 12 (2):9. It has even been disputed, most notably by Ludwig Wittgenstein, whether genuine philosophical problems actually exist. The opposite has also been claimed, for example  by Karl Popper, who held that such problems do exist, that they are solvable, and that he had actually found definite solutions to some of them.\n\nDavid Chalmers divides inquiry into philosophical progress in metaphilosophy into three questions.\n#The Existence Question: is there progress in philosophy?\n#The Comparison Question: is there as much progress in philosophy as in science?\n#The Explanation Question: why isn’t there more progress in philosophy?",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Metaphilosophy" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18887" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Metaphilosophy (sometimes called philosophy of philosophy) is \"the investigation of the nature of philosophy\". Its subject matter includes the aims of philosophy, the boundaries of philosophy, and its methods.\n\n  Thus, while philosophy characteristically inquires into the nature of being, the reality of objects, the possibility of knowledge, the nature of truth, and so on, metaphilosophy is the self-reflective inquiry into the nature, aims, and methods of the activity that makes these kinds of inquiries, by asking what is philosophy itself, what sorts of questions it should ask, how it might pose and answer them, and what it can achieve in doing so. It is considered by some to be a subject prior and preparatory to philosophy,See for example,  while others see it as inherently a part of philosophy, or automatically a part of philosophy  while others adopt some combination of these views.  The interest in metaphilosophy led to the establishment of the journal Metaphilosophy in January 1970.\nThe journal [http://onlinelibrary.wiley.com/journal/10.1111/%28ISSN%291467-9973/homepage/ProductInformation.html describes its scope] as: \"Particular areas of interest include: the foundation, scope, function and direction of philosophy; justification of philosophical methods and arguments; the interrelations among schools or fields of philosophy (for example, the relation of logic to problems in ethics or epistemology); aspects of philosophical systems; presuppositions of philosophical schools; the relation of philosophy to other disciplines (for example, artificial intelligence, linguistics or literature); sociology of philosophy; the relevance of philosophy to social and political action; issues in the teaching of philosophy.\"\n\nAlthough the term metaphilosophy and explicit attention to metaphilosophy as a specific domain within philosophy arose in the 20th century, the topic is likely as old as philosophy itself, and can be traced back at least as far as the works of Plato and Aristotle. http://www.iep.utm.edu/con-meta/#SH1a\n\nRelationship to philosophy\n\nSome philosophers consider metaphilosophy to be a subject apart from philosophy, above or beyond it, while others object to that idea. Timothy Williamson argues that the philosophy of philosophy is \"automatically part of philosophy\", as is the philosophy of anything else. Nicholas Bunnin and Jiyuan Yu write that the separation of first- from second-order study has lost popularity as philosophers find it hard to observe the distinction. As evidenced by these contrasting opinions, debate persists as to whether the evaluation of the nature of philosophy is 'second order philosophy' or simply 'plain philosophy'.\n\nMany philosophers have expressed doubts over the value of metaphilosophy.\n\n Among them is Gilbert Ryle : \"preoccupation with questions about methods tends to distract us from prosecuting the methods themselves. We run as a rule, worse, not better, if we think a lot about our feet. So let us... not speak of it all but just do it.\"\n Quoted by \n\nTerminology\n\nThe designations metaphilosophy and philosophy of philosophy have a variety of meanings, sometimes taken to be synonyms, and sometimes seen as distinct.\n\nMorris Lazerowitz claims to have coined the term 'metaphilosophy' around 1940 and used it in print in 1942. see also the Internet Encyclopedia of Philosophy article by Nicholas Joll: [http://www.iep.utm.edu/con-meta/#SH1b Contemporary Metaphilosophy]  Lazerowitz proposed that metaphilosophy is 'the investigation of the nature of philosophy'.  Earlier uses have been found in translations from the French.e.g. Clemenceau G., In the evening of my thought (Au soir de la pensée, Paris: Plon, 1927), Houghton Mifflin company, 1929, Vol. 2, p.498: \"this teratological product of metaphilosophy\"; Gilson E., Christianity and philosophy, Pub. for the Institute of Mediaeval Studies by Sheed & Ward, 1939, p. 88 The term is derived from Greek word meta μετά (\"after\", \"beyond\", \"with\") and philosophía φιλοσοφία (\"love of wisdom\").\n\nThe term 'metaphilosophy' is used by Paul Moser in the sense of a 'second-order' or more fundamental undertaking than philosophy itself, in the manner suggested by Charles Griswold:\n\nThis usage was considered nonsense by Ludwig Wittgenstein, who rejected the analogy between metalanguage and a metaphilosophy. As expressed by Martin Heidegger:\n\nSome other philosophers treat the prefix meta as simply meaning 'about...', rather than as referring to a metatheoretical 'second-order' form of philosophy, among them Rescher and Double.  Others, such as Williamson, prefer the term 'philosophy of philosophy instead of 'metaphilosophy' as it avoids the connotation of a 'second-order' discipline that looks down on philosophy, and instead denotes something that is a part of it.  Joll suggests that to take metaphilosophy as 'the application of the methods of philosophy to philosophy itself' is too vague, while the view that sees metaphilosophy as a 'second-order' or more abstract discipline, outside philosophy, \"is narrow and tendentious\".\n\nIn the analytical tradition, the term \"metaphilosophy\" is mostly used to tag commenting and research on previous works as opposed to original contributions towards solving philosophical problems.e.g.PhilPapers\n\nWritings\n\nLudwig Wittgenstein wrote about the nature of philosophical puzzles and philosophical understanding. He suggested philosophical errors arose from confusions about the nature of philosophical inquiry. In the Philosophical Investigations, Wittgenstein wrote that there is not a metaphilosophy in the sense of a metatheory of philosophy.One might think: if philosophy speaks of the use of the word \"philosophy\" there must be a second-order philosophy. But it is not so; it is, rather, like the case of othography, which deals with the word \"orthography\"  among others without then being second order. Ludwig Wittgenstein Philosophical Investigations Blackwell Oxford 1963 para 121.\n\nC. D. Broad distinguished Critical from Speculative philosophy in his \"The Subject-matter of Philosophy, and its Relations to the special Sciences,\" in Introduction to Scientific Thought, 1923. Curt Ducasse, in Philosophy as a Science, examines several views of the nature of philosophy, and concludes that philosophy has a distinct subject matter: appraisals. Ducasse's view has been among the first to be described as 'metaphilosophy'.Dommeyer F., (1961), A Critical Examination of C. J. Ducasse's Metaphilosophy, Philosophy and Phenomenological Research, Vol. 21, (Jun., 1961), No. 4 pp. 439-455\n\nHenri Lefebvre in Metaphilosophie (1965)  argued, from a Marxian standpoint, in favor of an \"ontological break\", as a necessary methodological approach for critical social theory (whilst criticizing Louis Althusser's \"epistemological break\" with subjective Marxism, which represented a fundamental theoretical tool for the school of Marxist structuralism).\n\nPaul Moser writes that typical metaphilosophical discussion includes determining the conditions under which a claim can be said to be a philosophical one. He regards meta-ethics, the study of ethics, to be a form of metaphilosophy, as well as meta-epistemology, the study of epistemology.\n\nTopics\n\nMany sub-disciplines of philosophy have their own branch of 'metaphilosophy', examples being Meta-aesthetics, Meta-epistemology, Meta-ethics, Meta-ontology, and so forth.\n\n However, some topics within 'metaphilosophy' cut across the various subdivisions of philosophy to consider fundamentals important to all its sub-disciplines. Some of these are mentioned below.\n\nAims\n\nSome philosophers (e.g. existentialists, pragmatists) think philosophy is ultimately a practical discipline that should help us lead meaningful lives by showing us who we are, how we relate to the world around us and what we should do.  Others (e.g. analytic philosophers) see philosophy as a technical, formal, and entirely theoretical discipline, with goals such as \"the disinterested pursuit of knowledge for its own sake\".Penguin Dictionary of Philosophy Other proposed goals of philosophy include \"discover[ing] the absolutely fundamental reason of everything it investigates\",Modern Thomistic Philosophy by R Phillips \"making explicit the nature and significance of ordinary and scientific beliefs\",Collins English Dictionary and unifying and transcending the insights given by science and religion.Mastering Philosophy by Anthony Harrison-Barbet Others proposed that philosophy is a complex discipline because it has 4 or 6 different dimensions.Adler, Mortimer (1993) The Four Dimensions of Philosophy: Metaphysical-Moral-Objective-Categorical\n\nBoundaries\n\nDefining philosophy and its boundaries is itself problematic; Nigel Warburton has called it \"notoriously difficult\". There is no straightforward definition,Mastering Philosophy, by Anthony Harrison-Barbet and most interesting definitions are controversial. As Bertrand Russell wrote:\n\nWhile there is some agreement that philosophy involves general or fundamental topics,Penguin Dictionary of Philosophy: \"the most fundamental and general concepts and principles involved in thought, action and reality\"Modern Thomistic Philosophy, by R. Phillips: \"the absolutely fundamental reason of everything it investigates\",  \"the fundamental reasons or causes of all things\"\n there is no clear agreement about a series of demarcation issues, including:\n\n*that between first-order and second-order investigations. Some authors say that philosophical inquiry is second-order, having concepts, theories and presupposition as its subject matter; that it is \"thinking about thinking\", of a \"generally second-order character\"; that philosophers study, rather than use, the concepts that structure our thinking. However, the Oxford Dictionary of Philosophy warns that \"the borderline between such 'second-order' reflection, and ways of practicing the first-order discipline itself, is not always clear: philosophical problems may be tamed by the advance of a discipline, and the conduct of a discipline may be swayed by philosophical reflection\".\n*that between philosophy and empirical science. Some argue that philosophy is distinct from science in that its questions cannot be answered empirically, that is, by observation or experiment.\n\n Some analytical philosophers argue that all meaningful empirical questions are to be answered by science, not philosophy. However, some schools of contemporary philosophy such as the pragmatists and naturalistic epistemologists argue that philosophy should be linked to science and should be scientific in the broad sense of that term, \"preferring to see philosophical reflection as continuous with the best practice of any field of intellectual enquiry\".\n\n*that between philosophy and religion. Some argue that philosophy is distinct from religion in that it allows no place for faith or revelation.Penguin Encyclopedia: that philosophy does not try to answer questions by appeal to revelation, myth or religious knowledge of any kind, but uses reason, \"without reference to sensible observation and experiments\". However, philosophers and theologians such as Thomas Aquinas and Peter Damian have argued that philosophy is the \"handmaiden of theology\" (ancilla theologiae).Gracia, J.G. and Noone, T.B., A Companion to Philosophy in the Middle Ages, London 2003, p.35\n\nMethods\n\nPhilosophical method (or philosophical methodology) is the study of how to do philosophy. A common view among philosophers is that philosophy is distinguished by the ways that philosophers follow in addressing philosophical questions. There is not just one method that philosophers use to answer philosophical questions.\n\nRecently, some philosophers have cast doubt about intuition as a basic tool in philosophical inquiry, from Socrates up to contemporary philosophy of language. In Rethinking IntuitionRethinking Intuition: The Psychology of Intuition and its Role in Philosophical Inquiry ,(Studies in Epistemology and Cognitive Theory)\nMichael DePaul, William Ramsey (Editors), Rowman & Littlefield Publishers, Inc. (1998) ;  various thinkers discard intuition as a valid source of knowledge and thereby call into question 'a priori' philosophy. Experimental philosophy is a form of philosophical inquiry that makes at least partial use of empirical research—especially opinion polling—in order to address persistent philosophical questions. This is in contrast with the methods found in analytic philosophy, whereby some say a philosopher will sometimes begin by appealing to his or her intuitions on an issue and then form an argument with those intuitions as premises.Knobe (forthcoming). However, disagreement about what experimental philosophy can accomplish is widespread and several philosophers have offered criticisms. One claim is that the empirical data gathered by experimental philosophers can have an indirect effect on philosophical questions by allowing for a better understanding of the underlying psychological processes which lead to philosophical intuitions.Knobe, J. and Nichols, S. (eds.) (2008) Experimental Philosophy] §2.1, \n\nProgress\n\nA prominent question in metaphilosophy is that of whether or not philosophical progress occurs and more so, whether such progress in philosophy is even possible.Dietrich, Eric (2011). [http://commons.pacificu.edu/eip/vol12/iss2/9/ There Is No Progress in Philosophy]. Essays in Philosophy 12 (2):9. It has even been disputed, most notably by Ludwig Wittgenstein, whether genuine philosophical problems actually exist. The opposite has also been claimed, for example  by Karl Popper, who held that such problems do exist, that they are solvable, and that he had actually found definite solutions to some of them.\n\nDavid Chalmers divides inquiry into philosophical progress in metaphilosophy into three questions.\n#The Existence Question: is there progress in philosophy?\n#The Comparison Question: is there as much progress in philosophy as in science?\n#The Explanation Question: why isn’t there more progress in philosophy? Metaphilosophy. http://en.wikipedia.org/?curid=18887."
  }
}
