{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4431",
  "eid" : "cdf143f0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778425263,
  "textBody" : "Beauty  is a characteristic of an animal, idea, object, person or place that provides a perceptual experience of pleasure or satisfaction. Beauty is studied as part of aesthetics, culture, social psychology, philosophy and sociology. An \"ideal beauty\" is an entity which is admired, or possesses features widely attributed to beauty in a particular culture, for perfection.\n\nUgliness is considered to be the opposite of beauty.\n\nThe experience of \"beauty\" often involves an interpretation of some entity as being in balance and harmony with nature, which may lead to feelings of attraction and emotional well-being. Because this can be a subjective experience, it is often said that \"beauty is in the eye of the beholder.\"\n\nThere is evidence that perceptions of beauty are evolutionary determined, that things, aspects of people and landscapes considered beautiful are typically found in situations likely to give enhanced survival of the perceiving human's genes.The Oxford Handbook for Aesthetics[http://www.ted.com/talks/denis_dutton_a_darwinian_theory_of_beauty.html Denis Dutton: A Darwinian theory of beauty | Video on TED.com]\n\nAncient Greek\n\nThe classical Greek noun that best translates to the English-language words \"beauty\" or \"beautiful\" was κάλλος, kallos, and the adjective was καλός, kalos. However, kalos may and is also translated as ″good″ or ″of fine quality″ and thus has a broader meaning than mere physical or material beauty. Similarly, kallos was used differently from the English word beauty in that it first and foremost applied to humans and bears an erotic connotation.\n\nThe Koine Greek word for beautiful was ὡραῖος, hōraios,Matthew 23:27, Acts 3:10, Flavius Josephus, 12.65 an adjective etymologically coming from the word ὥρα, hōra, meaning \"hour\". In Koine Greek, beauty was thus associated with \"being of one's hour\".Euripides, Alcestis 515. Thus, a ripe fruit (of its time) was considered beautiful, whereas a young woman trying to appear older or an older woman trying to appear younger would not be considered beautiful. In Attic Greek, hōraios had many meanings, including \"youthful\" and \"ripe old age\".\n\nThe earliest Western theory of beauty can be found in the works of early Greek philosophers from the pre-Socratic period, such as Pythagoras. The Pythagorean school saw a strong connection between mathematics and beauty. In particular, they noted that objects proportioned according to the golden ratio seemed more attractive.Seife, Charles (2000). Zero: The Biography of a Dangerous Idea. Penguin. . p. 32 Ancient Greek architecture is based on this view of symmetry and proportion.\n\nPlato considered beauty to be the Idea (Form) above all other Ideas.Phaedrus Aristotle saw a relationship between the beautiful (to kalon) and virtue, arguing that \"Virtue aims at the beautiful.\"Nicomachean Ethics\n\nClassical philosophy and sculptures of men and women produced according to the Greek philosophers' tenets of ideal human beauty were rediscovered in Renaissance Europe, leading to a re-adoption of what became known as a \"classical ideal\". In terms of female human beauty, a woman whose appearance conforms to these tenets is still called a \"classical beauty\" or said to possess a \"classical beauty\", whilst the foundations laid by Greek and Roman artists have also supplied the standard for male beauty in western civilization. During the Gothic era, the classical aesthetical canon of beauty was rejected as sinful. Later, Renaissance and Humanist thinkers rejected this view, and considered beauty to be the product of rational order and harmonious proportions. Renaissance artists and architects (such as Giorgio Vasari in his \"Lives of Artists\") criticised the Gothic period as irrational and barbarian. This point of view of Gothic art lasted until Romanticism, in the 19th century.\n\nThe Age of Reason\n\nThe Age of Reason saw a rise in an interest in beauty as a philosophical subject. For example, Scottish philosopher Francis Hutcheson argued that beauty is \"unity in variety and variety in unity\".An Inquiry Into the Original of Our Ideas of Beauty and Virtue; In Two Treatises The Romantic poets, too, became highly concerned with the nature of beauty, with John Keats arguing in \"Ode on a Grecian Urn\" that\n\nBeauty is truth, truth beauty, —that is all.\nYe know on earth, and all ye need to know.\n\nThe Romantic period\n\nIn the Romantic period, Edmund Burke postulated a difference between beauty in its classical meaning and the sublime. The concept of the sublime, as explicated by Burke and Kant, suggested viewing Gothic art and architecture, though not in accordance with the classical standard of beauty, as sublime.\n\nThe 20th century and after\n\nThe 20th century saw an increasing rejection of beauty by artists and philosophers alike, culminating in postmodernism's anti-aesthetics.The Anti-Aesthetic: Essays on Postmodern Culture by Hal Foster This is despite beauty being a central concern of one of postmodernism's main influences, Friedrich Nietzsche, who argued that the Will to Power was the Will to Beauty.The Will to Power\n\nIn the aftermath of postmodernism's rejection of beauty, thinkers have returned to beauty as an important value. American analytic philosopher Guy Sircello proposed his New Theory of Beauty as an effort to reaffirm the status of beauty as an important philosophical concept.A New Theory of Beauty. Princeton Essays on the Arts, 1. Princeton, NJ: Princeton University Press, 1975.Love and Beauty. Princeton, NJ: Princeton University Press, 1989. Elaine Scarry also argues that beauty is related to justice.On Beauty and Being Just\n\nBeauty is also studied by psychologists and neuroscientists in the field of experimental aesthetics and neuroesthetics respectively. Psychological theories see beauty as a form of pleasure. Correlational findings support the view that more beautiful objects are also more pleasing. Some studies suggest that higher experienced beauty is associated with activity in the medial orbitofrontal cortex. This approach of localizing the processing of beauty in one brain region has received criticism within the field.\n\nHuman beauty\n\nThe characterization of a person as “beautiful”, whether on an individual basis or by community consensus, is often based on some combination of inner beauty, which includes psychological factors such as personality, intelligence, grace, politeness, charisma, integrity, congruence and elegance, and outer beauty (i.e. physical attractiveness) which includes physical attributes which are valued on an aesthetic basis.\n\nStandards of beauty have changed over time, based on changing cultural values. Historically, paintings show a wide range of different standards for beauty. However, humans who are relatively young, with smooth skin, well-proportioned bodies, and regular features, have traditionally been considered the most beautiful throughout history.\n\nA strong indicator of physical beauty is \"averageness\".Langlois, J.H., Roggman, L. (1990). \"Attractive faces are only average.\" Psychol. Sci. 1, 115–121Strauss, M.S. (1979). \"Abstraction of prototypical information by adults and 10-month-old infants.\" J. Exp. Psychol.: Human Learn. Mem. 5, 618–632.Rhodes, G., Tremewan, T. (1997) Averageness, exaggeration, and facial attractiveness. Psychol. Sci.  7, 105–110.Valentine, T., Darling, S., Donnelly, M. (2004). Why are average faces attractive? The effect of view and averageness on the attractiveness of the attractiveness of female faces. Psychon. Bull. Rev. 11, 482–487[http://homepage.psy.utexas.edu/HomePage/Group/LangloisLAB/averagenessbeauty.html average faces are consistently more attractive than the faces used to generate them] When images of human faces are averaged together to form a composite image, they become progressively closer to the \"ideal\" image and are perceived as more attractive. This was first noticed in 1883, when Francis Galton overlaid photographic composite images of the faces of vegetarians and criminals to see if there was a typical facial appearance for each. When doing this, he noticed that the composite images were more attractive compared to any of the individual images.Galton, F. (1878). Composite portraits, made by combining those of many different persons in a single resultant figure.  J. Anthropol. Inst.  8, 132–144. Researchers have replicated the result under more controlled conditions and found that the computer generated, mathematical average of a series of faces is rated more favorably than individual faces. It is argued that it is evolutionarily advantageous that sexual creatures are attracted to mates who possess predominantly common or average features, because it suggests the absence of genetic or acquired defects.Koeslag, J.H. (1990). \"Koinophilia groups sexual creatures into species, promotes stasis, and stabilizes social behaviour.\" J. theor. Biol. 144, 15–35Symons, D. (1979) The Evolution of Human Sexuality. Oxford: Oxford University Press.[http://www.telegraph.co.uk/science/science-news/3341719/Why-beauty-is-an-advert-for-good-genes.html Highfield, Roger. \"Why beauty is an advert for good genes\"]. The Telegraph. Retrieved February 13, 2012 There is also evidence that a preference for beautiful faces emerges early in infancy, and is probably innate,Slater, A.M., Von Der Schulenburg, C., Brown, E., et al. (1998). \"Newborn infants prefer attractive faces.\" Infant Behav. Dev.  21, 345–354.Kramer, S., Zebrowitz, L.A., San Giovanni, J.P., Sherak, B. (1995). \"Infants' preferences for attractiveness and babyfaceness.\" In Bardy, B.G., Bootsma, R.J., Guiard, Y. (Eds.) Studies in perception and action III. pp. 389–392. Hillsdale, N.J.: Erlbaum Associates.Rubenstein, A.J, Kalakanis, L., Langlois, J.H. (1999). Infant preferences for attractive faces: a cognitive explanation. Dev. Psychol. 35, 848–855.Langlois, J.H., Ritter, J.M., Roggman, L.A., Vaughn, L.S. (1991). \"Facial diversity and infant preferences for attractive faces.\" Dev. Psychol. 27, 79–84.\nand that the rules by which attractiveness is established are similar across different genders and cultures.Apicella, C.L., Little, A.C., Marlowe, F.W. (2007). \"Facial averageness and attractiveness in an isolated population of hunter-gatherers.\" Perception 36, 1813–1820.\n\nA feature of beautiful women that has been explored by researchers is a waist–hip ratio of approximately 0.70. Physiologists have shown that women with hourglass figures are more fertile than other women due to higher levels of certain female hormones, a fact that may subconsciously condition males choosing mates.\n\nPeople are influenced by the images they see in the media to determine what is or is not beautiful. Some feminists and doctors have suggested that the very thin models featured in magazines promote eating disorders, and others have argued that the predominance of white women featured in movies and advertising leads to a Eurocentric concept of beauty, feelings of inferiority in women of color,White Skin as a Measure of Beauty: The Impact of the Eurocentric Beauty Standard on Indian Women. [http://www.beautyfields.co.nz/white-skin-as-a-measure-of-beauty-the-impact-of-the-eurocentric-beauty-standard-on-indian-women/] and internalized racism.\n\nThe black is beautiful cultural movement sought to dispel this notion.\n\nFatima Lodhi, a young diversity and anti-colorism advocate from Pakistan, claims that \"Beauty comes in all shapes, shades and sizes\".http://www.indiawest.com/news/global_indian/forget-fair-and-lovely-dark-is-divine-pakistan-s-first/article_8d1f87ae-1f5d-11e5-8684-0bfe7ff82da8.html\n\nThe concept of beauty in men is known as 'bishōnen' in Japan. Bishōnen refers to males with distinctly feminine features, physical characteristics establishing the standard of beauty in Japan and typically exhibited in their pop culture idols. A multibillion-dollar industry of Japanese Aesthetic Salons exists for this reason.\n\nEffects on society\n\nBeauty presents a standard of comparison, and it can cause resentment and dissatisfaction when not achieved. People who do not fit the \"beauty ideal\" may be ostracized within their communities. The television sitcom Ugly Betty portrays the life of a girl faced with hardships due to society's unwelcoming attitudes toward those they deem unattractive. However, a person may also be targeted for harassment because of their beauty. In Malèna, a strikingly beautiful Italian woman is forced into poverty by the women of the community who refuse to give her work for fear that she may \"woo\" their husbands. The documentary Beauty in the Eyes of the Beheld explores both the societal blessings and curses of female beauty through interviews of women considered beautiful.\n\nResearchers have found that good looking students get higher grades from their teachers than students with an ordinary appearance. Some studies using mock criminal trials have shown that physically attractive \"defendants\" are less likely to be convicted—and if convicted are likely to receive lighter sentences—than less attractive ones (although the opposite effect was observed when the alleged crime was swindling, perhaps because jurors perceived the defendant's attractiveness as facilitating the crime).Amina A Memon, Aldert Vrij, Ray Bull (2003). Psychology and Law: Truthfulness, Accuracy and Credibility. John Wiley & Sons. pp. 46–47.  Studies among teens and young adults, such as those of psychiatrist and self-help author, Eva Ritvo, show that skin conditions have a profound effect on social behavior and opportunity.\n\nHow much money a person earns may also be influenced by physical beauty. One study found that people low in physical attractiveness earn 5 to 10 percent less than ordinary looking people, who in turn earn 3 to 8 percent less than those who are considered good looking.Lorenz, K. (2005). \"[http://www.cnn.com/2005/US/Careers/07/08/looks/ Do pretty people earn more?]\" CNN News, Time Warner. In the market for loans, the least attractive people are less likely to get approvals, although they are less likely to default. In the marriage market, women's looks are at a premium, but men's looks do not matter much.\n\nConversely, being very unattractive increases the individual’s propensity for criminal activity for a number of crimes ranging from burglary to theft to selling illicit drugs.\n\nDiscrimination against others based on their appearance is known as lookism.Gough, L. (2011). C. Northcote Parkinson's Parkinson's law. Oxford, U.K: Infinite Ideas Ltd. p. 36. \n\nWriters' definitions \n\nSt. Augustine said of beauty \"Beauty is indeed a good gift of God; but that the good may not think it a great good, God dispenses it even to the wicked.\"[http://www.ccel.org/ccel/schaff/npnf102.iv.XV.22.html City of God Book 15 Chapter 22] \n\nPhilosopher and novelist Umberto Eco wrote On Beauty: A history of a Western idea (2004) and On Ugliness (2007). A character in his novel The Name of the Rose declares: \"three things concur in creating beauty: first of all integrity or perfection, and for this reason we consider ugly all incomplete things; then proper proportion or consonance; and finally clarity and light\", before going on to say \"the sight of the beautiful implies peace\".",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Beauty" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4431" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Beauty  is a characteristic of an animal, idea, object, person or place that provides a perceptual experience of pleasure or satisfaction. Beauty is studied as part of aesthetics, culture, social psychology, philosophy and sociology. An \"ideal beauty\" is an entity which is admired, or possesses features widely attributed to beauty in a particular culture, for perfection.\n\nUgliness is considered to be the opposite of beauty.\n\nThe experience of \"beauty\" often involves an interpretation of some entity as being in balance and harmony with nature, which may lead to feelings of attraction and emotional well-being. Because this can be a subjective experience, it is often said that \"beauty is in the eye of the beholder.\"\n\nThere is evidence that perceptions of beauty are evolutionary determined, that things, aspects of people and landscapes considered beautiful are typically found in situations likely to give enhanced survival of the perceiving human's genes.The Oxford Handbook for Aesthetics[http://www.ted.com/talks/denis_dutton_a_darwinian_theory_of_beauty.html Denis Dutton: A Darwinian theory of beauty | Video on TED.com]\n\nAncient Greek\n\nThe classical Greek noun that best translates to the English-language words \"beauty\" or \"beautiful\" was κάλλος, kallos, and the adjective was καλός, kalos. However, kalos may and is also translated as ″good″ or ″of fine quality″ and thus has a broader meaning than mere physical or material beauty. Similarly, kallos was used differently from the English word beauty in that it first and foremost applied to humans and bears an erotic connotation.\n\nThe Koine Greek word for beautiful was ὡραῖος, hōraios,Matthew 23:27, Acts 3:10, Flavius Josephus, 12.65 an adjective etymologically coming from the word ὥρα, hōra, meaning \"hour\". In Koine Greek, beauty was thus associated with \"being of one's hour\".Euripides, Alcestis 515. Thus, a ripe fruit (of its time) was considered beautiful, whereas a young woman trying to appear older or an older woman trying to appear younger would not be considered beautiful. In Attic Greek, hōraios had many meanings, including \"youthful\" and \"ripe old age\".\n\nThe earliest Western theory of beauty can be found in the works of early Greek philosophers from the pre-Socratic period, such as Pythagoras. The Pythagorean school saw a strong connection between mathematics and beauty. In particular, they noted that objects proportioned according to the golden ratio seemed more attractive.Seife, Charles (2000). Zero: The Biography of a Dangerous Idea. Penguin. . p. 32 Ancient Greek architecture is based on this view of symmetry and proportion.\n\nPlato considered beauty to be the Idea (Form) above all other Ideas.Phaedrus Aristotle saw a relationship between the beautiful (to kalon) and virtue, arguing that \"Virtue aims at the beautiful.\"Nicomachean Ethics\n\nClassical philosophy and sculptures of men and women produced according to the Greek philosophers' tenets of ideal human beauty were rediscovered in Renaissance Europe, leading to a re-adoption of what became known as a \"classical ideal\". In terms of female human beauty, a woman whose appearance conforms to these tenets is still called a \"classical beauty\" or said to possess a \"classical beauty\", whilst the foundations laid by Greek and Roman artists have also supplied the standard for male beauty in western civilization. During the Gothic era, the classical aesthetical canon of beauty was rejected as sinful. Later, Renaissance and Humanist thinkers rejected this view, and considered beauty to be the product of rational order and harmonious proportions. Renaissance artists and architects (such as Giorgio Vasari in his \"Lives of Artists\") criticised the Gothic period as irrational and barbarian. This point of view of Gothic art lasted until Romanticism, in the 19th century.\n\nThe Age of Reason\n\nThe Age of Reason saw a rise in an interest in beauty as a philosophical subject. For example, Scottish philosopher Francis Hutcheson argued that beauty is \"unity in variety and variety in unity\".An Inquiry Into the Original of Our Ideas of Beauty and Virtue; In Two Treatises The Romantic poets, too, became highly concerned with the nature of beauty, with John Keats arguing in \"Ode on a Grecian Urn\" that\n\nBeauty is truth, truth beauty, —that is all.\nYe know on earth, and all ye need to know.\n\nThe Romantic period\n\nIn the Romantic period, Edmund Burke postulated a difference between beauty in its classical meaning and the sublime. The concept of the sublime, as explicated by Burke and Kant, suggested viewing Gothic art and architecture, though not in accordance with the classical standard of beauty, as sublime.\n\nThe 20th century and after\n\nThe 20th century saw an increasing rejection of beauty by artists and philosophers alike, culminating in postmodernism's anti-aesthetics.The Anti-Aesthetic: Essays on Postmodern Culture by Hal Foster This is despite beauty being a central concern of one of postmodernism's main influences, Friedrich Nietzsche, who argued that the Will to Power was the Will to Beauty.The Will to Power\n\nIn the aftermath of postmodernism's rejection of beauty, thinkers have returned to beauty as an important value. American analytic philosopher Guy Sircello proposed his New Theory of Beauty as an effort to reaffirm the status of beauty as an important philosophical concept.A New Theory of Beauty. Princeton Essays on the Arts, 1. Princeton, NJ: Princeton University Press, 1975.Love and Beauty. Princeton, NJ: Princeton University Press, 1989. Elaine Scarry also argues that beauty is related to justice.On Beauty and Being Just\n\nBeauty is also studied by psychologists and neuroscientists in the field of experimental aesthetics and neuroesthetics respectively. Psychological theories see beauty as a form of pleasure. Correlational findings support the view that more beautiful objects are also more pleasing. Some studies suggest that higher experienced beauty is associated with activity in the medial orbitofrontal cortex. This approach of localizing the processing of beauty in one brain region has received criticism within the field.\n\nHuman beauty\n\nThe characterization of a person as “beautiful”, whether on an individual basis or by community consensus, is often based on some combination of inner beauty, which includes psychological factors such as personality, intelligence, grace, politeness, charisma, integrity, congruence and elegance, and outer beauty (i.e. physical attractiveness) which includes physical attributes which are valued on an aesthetic basis.\n\nStandards of beauty have changed over time, based on changing cultural values. Historically, paintings show a wide range of different standards for beauty. However, humans who are relatively young, with smooth skin, well-proportioned bodies, and regular features, have traditionally been considered the most beautiful throughout history.\n\nA strong indicator of physical beauty is \"averageness\".Langlois, J.H., Roggman, L. (1990). \"Attractive faces are only average.\" Psychol. Sci. 1, 115–121Strauss, M.S. (1979). \"Abstraction of prototypical information by adults and 10-month-old infants.\" J. Exp. Psychol.: Human Learn. Mem. 5, 618–632.Rhodes, G., Tremewan, T. (1997) Averageness, exaggeration, and facial attractiveness. Psychol. Sci.  7, 105–110.Valentine, T., Darling, S., Donnelly, M. (2004). Why are average faces attractive? The effect of view and averageness on the attractiveness of the attractiveness of female faces. Psychon. Bull. Rev. 11, 482–487[http://homepage.psy.utexas.edu/HomePage/Group/LangloisLAB/averagenessbeauty.html average faces are consistently more attractive than the faces used to generate them] When images of human faces are averaged together to form a composite image, they become progressively closer to the \"ideal\" image and are perceived as more attractive. This was first noticed in 1883, when Francis Galton overlaid photographic composite images of the faces of vegetarians and criminals to see if there was a typical facial appearance for each. When doing this, he noticed that the composite images were more attractive compared to any of the individual images.Galton, F. (1878). Composite portraits, made by combining those of many different persons in a single resultant figure.  J. Anthropol. Inst.  8, 132–144. Researchers have replicated the result under more controlled conditions and found that the computer generated, mathematical average of a series of faces is rated more favorably than individual faces. It is argued that it is evolutionarily advantageous that sexual creatures are attracted to mates who possess predominantly common or average features, because it suggests the absence of genetic or acquired defects.Koeslag, J.H. (1990). \"Koinophilia groups sexual creatures into species, promotes stasis, and stabilizes social behaviour.\" J. theor. Biol. 144, 15–35Symons, D. (1979) The Evolution of Human Sexuality. Oxford: Oxford University Press.[http://www.telegraph.co.uk/science/science-news/3341719/Why-beauty-is-an-advert-for-good-genes.html Highfield, Roger. \"Why beauty is an advert for good genes\"]. The Telegraph. Retrieved February 13, 2012 There is also evidence that a preference for beautiful faces emerges early in infancy, and is probably innate,Slater, A.M., Von Der Schulenburg, C., Brown, E., et al. (1998). \"Newborn infants prefer attractive faces.\" Infant Behav. Dev.  21, 345–354.Kramer, S., Zebrowitz, L.A., San Giovanni, J.P., Sherak, B. (1995). \"Infants' preferences for attractiveness and babyfaceness.\" In Bardy, B.G., Bootsma, R.J., Guiard, Y. (Eds.) Studies in perception and action III. pp. 389–392. Hillsdale, N.J.: Erlbaum Associates.Rubenstein, A.J, Kalakanis, L., Langlois, J.H. (1999). Infant preferences for attractive faces: a cognitive explanation. Dev. Psychol. 35, 848–855.Langlois, J.H., Ritter, J.M., Roggman, L.A., Vaughn, L.S. (1991). \"Facial diversity and infant preferences for attractive faces.\" Dev. Psychol. 27, 79–84.\nand that the rules by which attractiveness is established are similar across different genders and cultures.Apicella, C.L., Little, A.C., Marlowe, F.W. (2007). \"Facial averageness and attractiveness in an isolated population of hunter-gatherers.\" Perception 36, 1813–1820.\n\nA feature of beautiful women that has been explored by researchers is a waist–hip ratio of approximately 0.70. Physiologists have shown that women with hourglass figures are more fertile than other women due to higher levels of certain female hormones, a fact that may subconsciously condition males choosing mates.\n\nPeople are influenced by the images they see in the media to determine what is or is not beautiful. Some feminists and doctors have suggested that the very thin models featured in magazines promote eating disorders, and others have argued that the predominance of white women featured in movies and advertising leads to a Eurocentric concept of beauty, feelings of inferiority in women of color,White Skin as a Measure of Beauty: The Impact of the Eurocentric Beauty Standard on Indian Women. [http://www.beautyfields.co.nz/white-skin-as-a-measure-of-beauty-the-impact-of-the-eurocentric-beauty-standard-on-indian-women/] and internalized racism.\n\nThe black is beautiful cultural movement sought to dispel this notion.\n\nFatima Lodhi, a young diversity and anti-colorism advocate from Pakistan, claims that \"Beauty comes in all shapes, shades and sizes\".http://www.indiawest.com/news/global_indian/forget-fair-and-lovely-dark-is-divine-pakistan-s-first/article_8d1f87ae-1f5d-11e5-8684-0bfe7ff82da8.html\n\nThe concept of beauty in men is known as 'bishōnen' in Japan. Bishōnen refers to males with distinctly feminine features, physical characteristics establishing the standard of beauty in Japan and typically exhibited in their pop culture idols. A multibillion-dollar industry of Japanese Aesthetic Salons exists for this reason.\n\nEffects on society\n\nBeauty presents a standard of comparison, and it can cause resentment and dissatisfaction when not achieved. People who do not fit the \"beauty ideal\" may be ostracized within their communities. The television sitcom Ugly Betty portrays the life of a girl faced with hardships due to society's unwelcoming attitudes toward those they deem unattractive. However, a person may also be targeted for harassment because of their beauty. In Malèna, a strikingly beautiful Italian woman is forced into poverty by the women of the community who refuse to give her work for fear that she may \"woo\" their husbands. The documentary Beauty in the Eyes of the Beheld explores both the societal blessings and curses of female beauty through interviews of women considered beautiful.\n\nResearchers have found that good looking students get higher grades from their teachers than students with an ordinary appearance. Some studies using mock criminal trials have shown that physically attractive \"defendants\" are less likely to be convicted—and if convicted are likely to receive lighter sentences—than less attractive ones (although the opposite effect was observed when the alleged crime was swindling, perhaps because jurors perceived the defendant's attractiveness as facilitating the crime).Amina A Memon, Aldert Vrij, Ray Bull (2003). Psychology and Law: Truthfulness, Accuracy and Credibility. John Wiley & Sons. pp. 46–47.  Studies among teens and young adults, such as those of psychiatrist and self-help author, Eva Ritvo, show that skin conditions have a profound effect on social behavior and opportunity.\n\nHow much money a person earns may also be influenced by physical beauty. One study found that people low in physical attractiveness earn 5 to 10 percent less than ordinary looking people, who in turn earn 3 to 8 percent less than those who are considered good looking.Lorenz, K. (2005). \"[http://www.cnn.com/2005/US/Careers/07/08/looks/ Do pretty people earn more?]\" CNN News, Time Warner. In the market for loans, the least attractive people are less likely to get approvals, although they are less likely to default. In the marriage market, women's looks are at a premium, but men's looks do not matter much.\n\nConversely, being very unattractive increases the individual’s propensity for criminal activity for a number of crimes ranging from burglary to theft to selling illicit drugs.\n\nDiscrimination against others based on their appearance is known as lookism.Gough, L. (2011). C. Northcote Parkinson's Parkinson's law. Oxford, U.K: Infinite Ideas Ltd. p. 36. \n\nWriters' definitions \n\nSt. Augustine said of beauty \"Beauty is indeed a good gift of God; but that the good may not think it a great good, God dispenses it even to the wicked.\"[http://www.ccel.org/ccel/schaff/npnf102.iv.XV.22.html City of God Book 15 Chapter 22] \n\nPhilosopher and novelist Umberto Eco wrote On Beauty: A history of a Western idea (2004) and On Ugliness (2007). A character in his novel The Name of the Rose declares: \"three things concur in creating beauty: first of all integrity or perfection, and for this reason we consider ugly all incomplete things; then proper proportion or consonance; and finally clarity and light\", before going on to say \"the sight of the beautiful implies peace\". Beauty. http://en.wikipedia.org/?curid=4431."
  }
}
