{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14457",
  "eid" : "14aa94e0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778543918,
  "textBody" : "Prince Henry of Wales  (Henry Charles Albert David; born 15 September 1984), familiarly known as Prince Harry, is a member of the British royal family. He is the younger son of Charles, Prince of Wales, and Diana, Princess of Wales, and is fifth in the line of succession to the British throne.\n\nHarry was educated at schools in the United Kingdom and spent parts of his gap year in Australia and Lesotho. He then chose a military career and underwent officer training at the Royal Military Academy Sandhurst. He was commissioned as a cornet (i.e. second lieutenant) into the Blues and Royals, serving temporarily with his brother, Prince William, and completed his training as a troop leader.\n\nIn 2007–08, he served for over ten weeks in Helmand, Afghanistan, but was pulled out after an Australian magazine revealed his presence there. He returned to Afghanistan for a 20-week deployment in 2012–13 with the Army Air Corps. He left the army in June 2015.\n\nHarry launched the Invictus Games in 2014, and remains patron of its Foundation. He also gives patronage to several other organisations, including the HALO Trust, the London Marathon Charitable Trust, and Walking With The Wounded. \n\nHe is engaged to marry American actress Meghan Markle on 19 May 2018.\n\nEarly life\n\nHarry was born in the Lindo Wing of St Mary's Hospital in Paddington, London, on 15 September 1984 at 4:20 pm as the second child of Charles, Prince of Wales, heir apparent to Queen Elizabeth II, and Diana, Princess of Wales. He was baptised with the names Henry Charles Albert David, on 21 December 1984, at St George's Chapel, Windsor Castle, by the Archbishop of Canterbury, Robert Runcie. His godparents are Prince Andrew (his paternal uncle); Lady Sarah Armstrong-Jones (his paternal cousin once removed); Carolyn Bartholomew (née Pride); Bryan Organ; Gerald Ward (former officer in the Household Cavalry); and Celia, Lady Vestey (née Knight).\n\nDiana wanted Harry and his older brother, William, to have a broader range of experiences than previous royal children and took them to venues that ranged from Disney World and McDonald's to AIDS clinics and shelters for the homeless. Harry began to accompany his parents on official visits at an early age; his first overseas tour was with his parents to Italy in 1985.\n\nHarry's parents divorced in 1996, and his mother died in a car crash in Paris the following year. Harry and William were staying with their father at Balmoral at the time, and the Prince of Wales told his sons about their mother's death. At his mother's funeral, Harry, then 12, accompanied his father, brother, paternal grandfather, and maternal uncle, Earl Spencer, in walking behind the funeral cortège from Kensington Palace to Westminster Abbey.\n\nEducation\n\nLike his father and brother, Harry was educated at independent schools. He started at Jane Mynors' nursery school and the pre-preparatory Wetherby School, both in London. Following this, he attended Ludgrove School, and, after passing the entrance exams, was admitted to Eton College. The decision to place Harry at Eton went against the Windsor family convention of sending children to Gordonstoun (Harry's grandfather, father, two uncles, and two cousins all attended); it did, however, see Harry follow in the Spencer family footsteps, as both Diana's father and brother attended Eton.\n\nIn June 2003, Harry completed his education at Eton with two A-Levels, (achieving a grade B in art and D in geography) having decided to drop history of art after AS level. He excelled in sports, particularly polo and rugby union. Passing two A-levels, Harry was eligible to apply for an officer commission in the British Army. One of Harry's former teachers, Sarah Forsyth, has asserted that Harry was a \"weak student\" and that staff at Eton conspired to help Harry cheat on examinations. Both Eton and Harry denied the claims. While a tribunal made no ruling on the cheating claim, it \"accepted the prince had received help in preparing his A-level 'expressive' project, which he needed to pass to secure his place at Sandhurst\".\n\nAfter school, Harry took a gap year, during which he spent time in Australia, working (as his father had done in his youth) on a cattle station and participating in the Young England vs Young Australia Polo Test match. He also travelled to Lesotho, where he worked with orphaned children and produced the documentary film The Forgotten Kingdom.\n\nMilitary career\n\nSandhurst, Blues and Royals, and deployment to Afghanistan\n\nHarry entered the Royal Military Academy Sandhurst on 8 May 2005, where he was known as Officer Cadet Wales, and joined the Alamein Company. Within a year, in April 2006, Harry completed his officer training and was commissioned as a Cornet (second lieutenant) in the Blues and Royals, a regiment of the Household Cavalry in the British Army. He was given the service number 564673. On 13 April 2008, when he reached two years' seniority, Harry was promoted to lieutenant.\n\nIn 2006 it was announced that Harry's unit was scheduled to be deployed in Iraq the following year and a public debate ensued as to whether he should serve there. Defence Secretary John Reid said that he should be allowed to serve on the front line of battle zones. Harry agreed saying, \"If they said 'no, you can't go front line' then I wouldn't drag my sorry ass through Sandhurst and I wouldn't be where I am now\". The Ministry of Defence and Clarence House made a joint announcement on 22 February 2007 that Harry would be deployed with his regiment to Iraq, as part of the 1st Mechanised Brigade of the 3rd Mechanised Divisiona move supported by Harry, who had stated that he would leave the army if he was told to remain in safety while his regiment went to war. He said: \"There's no way I'm going to put myself through Sandhurst and then sit on my arse back home while my boys are out fighting for their country.\" The head of the British army at the time, General Sir Richard Dannatt, said on 30 April 2007 that he had personally decided that Harry would serve with his unit in Iraq, and Harry was scheduled for deployment in May or June 2007, to patrol the Maysan Governorate. By 16 May, however, Dannatt announced that Harry would not serve in Iraq; concerns included Harry being a high-value target (as several threats by various groups had already been made against him) and the dangers the soldiers around him would face should any attempt be made on his life or if he was captured. Clarence House made public Harry's disappointment with the decision, though he said he would abide by it.\n\nIt was reported in early June 2007 that Harry had arrived in Canada to train alongside soldiers of the Canadian Forces and British Army, at CFB Suffield, near Medicine Hat, Alberta. It was said that this was in preparation for a tour of duty in Afghanistan, where Canadian and British forces were participating in the NATO-led Afghan War. This was confirmed in February the following year, when the British Ministry of Defence revealed that Harry had been secretly deployed as a Forward Air Controller to Helmand Province in Afghanistan for the previous ten weeks. The revelation came after the medianotably, German newspaper Bild and Australian magazine New Ideabreached the blackout placed over the information by the Canadian and British authorities. It was later reported that, while in Afghanistan, Harry helped Gurkha troops repel an attack from Taliban insurgents, and performed patrol duty in hostile areas. His tour made Harry the first member of the Royal Family to serve in a war zone since his uncle, Prince Andrew, flew helicopters during the Falklands War. For his service, Harry was presented with an Operational Service Medal for Afghanistan by his aunt, Princess Anne, at the Combermere Barracks in May 2008.\n\nArmy Air Corps and second deployment to Afghanistan\n\nIn October 2008, it was announced that Harry was to follow his brother, father and uncle in learning to fly military helicopters. After passing the initial aptitude test, he was to undertake a month-long course; if he passed that, he would begin full flight training in early 2009. Harry had to pass his flying assessment at the Army Air Corps Base (AAC), Middle Wallop, the result of which would determine whether he would continue on to train as a pilot of the Apache, Lynx, or Gazelle helicopter. Having reached the requisite standard, Harry attended the Defence Helicopter Flying School at RAF Shawbury, where he joined brother William.\n\nHarry was presented with his flying brevet (wings) by his father on 7 May 2010 at a ceremony at the Army Air Corps Base (AAC), Middle Wallop. Harry had let it be known that he intended to fly Apache attack helicopters if he was successful in passing the rigorous Apache training course, after which time it could be possible for him to see active military service once again on the frontline in Afghanistan. During the ceremony, he switched his Blues and Royals' Officer's Service Dress cap for that of the Army Air Corps' sky blue beret with a Blues and Royals badge.\n\nOn 10 March 2011, it was revealed that Harry had passed his Apache flying test and he was awarded his Apache Flying Badge on 14 April 2011. There was speculation that he would return to Afghanistan before the withdrawal in 2015. On 16 April 2011, it was announced that Harry had been promoted to captain.\n\nIn June 2011, Clarence House announced that on completion of his training conversion course to use Apache helicopters in the war arena, Harry would be available for deployment, including in current operations in Afghanistan, as an Apache helicopter pilot. The final decision rested with the Ministry of Defence's senior commanders, including principally the Chief of the Defence Staff in consultation with the wishes of Harry, the Prince of Wales, and the Queen. In October, Harry was transferred to a US military base in California to complete his helicopter gunship training. This final phase included live-fire training and \"environmental and judgment training\" at naval and air force facilities in California and Arizona. The majority of those completing the two-month Apache training were deployed to the front lines in Afghanistan. In the same month, it was reported that Harry was said to be a natural pilot who was top of his class in the extensive training he had undertaken at the Naval Air Facility, El Centro, California. In November 2011, Harry returned to England. He went to Wattisham Flying Station in Suffolk, in the east of England, to complete his training to fly Apache helicopters.\n\nOn 7 September 2012, Harry arrived at Camp Bastion in southern Afghanistan as part of the 100-strong 662 Squadron, 3 Regiment, Army Air Corps, to begin a four-month combat tour as a co-pilot and gunner for an Apache helicopter.  On 10 September, within days of arriving in Afghanistan, it was reported that the Taliban threatened his life. Taliban spokesman Zabiullah Mujahid spoke to Reuters and was quoted as saying: \"We are using all our strength to get rid of him, either by killing or kidnapping,\" and \"We have informed our commanders in Helmand to do whatever they can to eliminate him.\"\n\nIt was announced on 21 January 2013 that Harry was returning from a 20-week deployment in Afghanistan, where he served as an Apache co-pilot/gunner.\nOn 8 July 2013, the Ministry of Defence announced that Harry had successfully qualified as an Apache aircraft commander.\n\nHQ London District and Invictus Games \n\nOn 17 January 2014, the Ministry of Defence announced that Harry had completed his attachment to 3 Regiment Army Air Corps and would take up a staff officer role at the position of SO3 (Defence Engagement) in HQ London District. His responsibilities would include helping to co-ordinate significant projects and commemorative events involving the Army in London. He was based at Horse Guards in central London.\n\nOn 6 March 2014, Prince Harry launched Invictus Games, a Paralympic-style sporting event for injured servicemen and women, which was held on 10–14 September 2014. Prince Harry met British hopefuls for the Invictus Games at Tedworth House for the start of the selection process on 29 April 2014. On 15 May 2014, Harry attended a ticket sale launch for Invictus Games at BT Tower, where he made a public tweet on the Invictus Games' official Twitter account as the president of Invictus Games. To promote the Games, Prince Harry was interviewed by BBC Radio 2's Chris Evans along with two Invictus Games hopefuls. He said: \"This (Invictus Games) is basically my full-time job at the moment, making sure that we pull this off.\" The show aired on 31 July 2014. Harry later wrote an article in The Sunday Times about his experiences in Afghanistan: how they had inspired him to help injured personnel and how, after the trip to the Warrior Games, he had vowed to create the Invictus Games. Harry and officials attended the British Armed Forces Team announcement for Invictus Games at Potters Field Park in August 2014, and as president of the Invictus Games, Harry attended all events related to the Games from 8 to 14 September 2014.\n\nIn January 2015, it was reported that Harry would take a new role in supporting wounded service personnel by working alongside members of the London District's Personal Recovery Unit for the MOD's Defence Recovery Capability scheme to ensure that wounded personnel have adequate recovery plans. The scheme was established in partnership with Help for Heroes and the Royal British Legion, the palace confirmed weeks later.\n\nIn late January 2015, Harry visited The Battle Back Centre set up by the Royal British Legion, and Fisher House UK at the Queen Elizabeth Hospital Birmingham, which was created in the partnership between Help for Heroes, the Fisher House Foundation and the Queen Elizabeth Hospital Birmingham (QEHB) Charity. Fisher House Foundation is one of the Invictus Games' sponsors.\n\nIn February and March 2015, Harry visited Phoenix House in Catterick Garrison, North Yorkshire, a recovery centre run by Help for Heroes, and Merville Barracks in Colchester, where Chavasse VC House Personnel Recovery Centre is located, run by Help for Heroes in partnership with the Ministry of Defence and Royal British Legion.\n\nSecondment to Australian Defence Force and leaving the Army\n\nOn 17 March 2015, Kensington Palace announced that Prince Harry would leave the Armed Forces in June. Before then, he would spend four weeks throughout April and May at army barracks in Darwin, Perth and Sydney whilst seconded to the Australian Defence Force (ADF). After leaving the Army, while considering his future, he would return to work with the Ministry of Defence, supporting Case Officers in the Ministry of Defence's Recovery Capability Programme, working with both those who administer and receive physical and mental care within the London District area in a voluntary capacity.\n\nOn 6 April 2015, Prince Harry reported for duty to Australia's Chief of the Defence Force, Air Chief Marshal Mark Binskin at the Royal Military College, Duntroon in Canberra, Australia. Harry flew to Darwin later that day to start his month-long secondment to the ADF's 1st Brigade. His visit included detachments to NORFORCE as well as to an aviation unit. While in Perth, he trained with Special Air Service Regiment (SASR), participating in the SASR selection course, including a fitness test and a physical training session with SASR selection candidates. He also joined SASR members in Perth for live-fire shooting exercises with numerous Special Forces weapons at a variety of ranges and completed an insertion training exercise using a rigid-hull inflatable boat. In Sydney, he undertook urban operations training with the 2nd Commando Regiment. Training activities included remotely detonating an Improvised Explosive Device (IED) and rappelling from a building. He also spent time flying over Sydney as co-pilot of an Army Black Hawk and participated in counter-terrorism training in Sydney Harbour with Royal Australian Navy clearance divers.\n\nHarry's attachment with the ADF ended on 8 May 2015, and on 19 June 2015 his career with the Army ended.\n\nOther activities\n\nAt the age of 21, Harry was appointed a Counsellor of State and began his duties in that capacity when the Queen was attending the 2005 Commonwealth Heads of Government Meeting in Malta. The following year, he was in Lesotho to visit Mants'ase Children's Home near Mohale's Hoek, which he first toured in 2004 and, along with Prince Seeiso of Lesotho, he launched Sentebale: The Princes' Fund for Lesotho, a charity to aid children orphaned by HIV/AIDS. He has granted his patronage to organisations including WellChild, Dolen Cymru, and MapAction. To aid Sentebale, the Diana, Princess of Wales Memorial Fund and Centrepoint, Harry and his brother organised the Concert for Diana at Wembley Stadium, on 1 July 2007.\n\nSport has been a way that Harry has helped charities and other organisations, including training as a Rugby Development Officer for the Rugby Football Union in 2004 and coaching students in schools to encourage them to learn the sport. Like his brother and father, he has participated in polo matches to raise money for charitable causes.\n\nOn 6 January 2009, the Queen granted Harry and William their own royal household. It has three main staff members, supported by a small team. Sir David Manning, the former British ambassador to Washington, is a part-time adviser to the princes. Previously, William and Harry's affairs had been handled by the office of their father at Clarence House in central London. The new household released a statement announcing that they had established their own office at nearby St James's Palace to look after their public, military and charitable activities.\n In September 2009, William and Harry set up The Foundation of Prince William and Prince Harry to enable the princes to take forward their charitable ambitions.\n\nIn March 2012, Harry led an official visit to Belize as part of the Queen's Diamond Jubilee celebrations. He continued to the Bahamas and Jamaica, where the Prime Minister, Portia Simpson-Miller, was considering severing ties between Jamaica and the constitutional monarchy. He then visited Brazil to attend the GREAT Campaign, as an ambassador of the 2012 Olympics to the 2016 Rio Olympics. On 12 August 2012, Harry represented the Queen at the closing ceremony of the London 2012 Olympic Games.\n\nBetween 9 and 15 May 2013, he made an official visit to the United States. The tour promoted the rehabilitation of injured American and UK troops, publicised his own charities and supported British interests. It included engagements in Washington DC, Colorado, New York, New Jersey, and Connecticut. He watched the opening ceremony of the Warrior Games, in Colorado Springs, where injured servicemen and women competed, and met survivors of Hurricane Sandy in New Jersey.\n\nIn August 2013, he visited Angola to see HALO Trust's work there as patron of the trust's 25th Anniversary Appeal. In October 2013, he visited Australia for his first official visit to the country and attended the International Fleet Review at Sydney Harbour. He also paid a visit to the Australian SAS HQ in Perth. On his way back to the UK, he attended a charity event for Sentebale at Dubai.\n\nIn May 2014, he visited Estonia and Italy. In Estonia, he visited Freedom Square in the capital Tallinn to honour those who paid the ultimate sacrifice for their nation, and attended a reception at the Estonian Parliament and a NATO military exercise. In Italy, he attended commemorations of the 70th anniversary of the Monte Cassino battles, in which Polish, Commonwealth and British troops fought. He also unveiled the British Pavilion at Expo Milano 2015 in Rome at the MAXXI Museum. In June 2014, he visited Brazil and Chile.\n\nTo mark the World War I centenary, on 4 August 2014, he attended the unveiling of the Folkestone Memorial Arch in Kent. Subsequently, he flew to Belgium, where he met families of WWI soldiers in a reception before reading a letter from a fallen soldier in a twilight service at St Symphorien Military Cemetery in Mons. Harry and the Duke and Duchess of Cambridge planted poppies at an installation by artist Paul Cummins, titled Blood Swept Lands and Seas of Red, at the Tower of London to commemorate the war on 5 August.\n\nOn 6 November 2014, he opened the Field of Remembrance at Westminster Abbey, a task usually performed by the Duke of Edinburgh. On 7 November 2013, Prince Harry had accompanied his grandfather at the previous year's opening. On 9 November 2014, Prince Harry attended Remembrance Sunday Service at Kandahar Air Base, Afghanistan, representing the Queen.\n\nFrom 18 to 20 November 2014, he made an official visit to Oman. His original plan was to attend the National Day Parade, but due to the illness of the Sultan, the parade was cancelled and Harry's visit became semi-official. He visited the British Embassy, Nizwa Fort, Muttrah souk, and Sultan Qaboos Grand Mosque. On 20 November, he played in the Sentebale Polo Cup in Abu Dhabi in aid of Sentebale; it was hailed as the Sentebale Polo Cup. In December 2014, Prince Harry visited Lesotho with Prince Seeiso of Lesotho to see the charity's work.\n\nOn 13 March 2015, the royal family attended a commemoration service at St Paul's Cathedral marking the end of the Afghanistan campaign. Before reporting for duty to the Australian Defence Force (ADF), Prince Harry visited the Australian War Memorial in Canberra on 6 April 2015. On 7 May 2015, he made a farewell walkabout at the Sydney Opera House and visited Macquarie University Hospital, where he met Lieutenant Ali Spearing who had undergone pioneering treatment in the hospital to fit prosthetic limbs.\n\nOn 24–25 April 2015, he joined his father in Turkey to attend commemorations of the centenary of the Gallipoli Campaign. Harry made an official visit to New Zealand in May 2015, touring Wellington, Invercargill, Stewart Island, Christchurch, Linton, Whanganui, and Auckland.\n\nOn 11 June 2015, he attended the Service of Dedication and unveiling of the Bastion Memorial at the National Memorial Arboretum. On 14 July 2015, as patron of Invictus Games Foundation, he announced that the 2016 Invictus Games will take place from 8–12 May 2016 at the ESPN Wide World of Sports Complex in Orlando, Florida. On 15 September 2015, he watched the Battle of Britain Flypast at Goodwood in West Sussex. As patron of Walk of Britain, he walked with the team on 30 September and 20 October.\nHe attended a service to mark the 75th anniversary of Explosive Ordnance Disposal at St Paul's Cathedral on 22 October 2015.\n\nOn 28 October 2015, he carried out one day of engagements in the US. He launched the Invictus Games Orlando 2016 with First Lady Michelle Obama and Dr. Jill Biden at Fort Belvoir. He later attended an Invictus Games 2016 Board Meeting and a Reception to celebrate the launch at the British Ambassador's Residence. Prior to the reception, Harry met with President Barack Obama in the Oval Office.\n\nOn 26 November 2015, as patron of Sentebale, Prince Harry travelled to Lesotho to attend the opening of the Mamohato Children’s Centre. Two days later Harry played the Sentebale Royal Salute Polo Cup, at Val de Vie Estate in Cape Town, South Africa, fundraising for Sentebale.\n\nFrom 30 November to 3 December 2015, he made an official visit to South Africa. He visited Cape Town, where he met with Archbishop Emeritus Desmond Tutu and presented the Order of the Companions of Honour to the Archbishop on behalf of the Queen. On the day he visited Kruger National Park and Southern African Wildlife College, Kensington Palace released a series of pictures and videos about his conservation work tour in Africa during the summer. In Johannesburg, Harry visited the Nelson Mandela Foundation where he met with Graca Machel and toured the private archives of the Centre for Memory. He also met with President Jacob Zuma at his residence in Pretoria. On 27 December 2017, Harry was officially appointed the new President of African Parks, a conservation NGO. He previously spent three weeks in Malawi with African Parks where he joined a team of volunteers and professionals to carry out one of the largest elephant translocations in history. The effort to repopulate decimated areas due to poaching and habitat loss moved 500 elephants from Liwonde and Majete National Parks to Nkhotakota Wildlife Reserve.\n\nHe visited Nepal 19–23 March 2016. He stayed extra days till end of March 2016 to help rebuild a secondary school with Team Rubicon UK and visited a Hydropower Project in Central Nepal.\n\nAs patron of Invictus Games Foundation, he attended a day of engagements to launch the Invictus Games 2017 in Toronto on 2 May 2016, he also met with Prime Minister Justin Trudeau. From 5–13 May 2016, Harry attended the Invictus Games 2016, where he met competitors and their families, and watched all sports competitions. He gave speeches at the opening and closing ceremonies, attended a symposium on Invisible Wounds, with President George W. Bush and two veterans, and receptions for sponsors, Invictus Games Foundation and Royal Foundation. Prior the Games, on 4 May 2016, Prince Harry played in the Sentebale Royal Salute Polo Cup at Valiente Polo Farm to raise funds for his charity Sentebale. From 30 June to 1 July 2016, he, along with the Duke and Duchess of Cambridge, attended the Battle of the Somme centenary commemorations at the Thiepval Memorial in France.\n\nTo raise the awareness of HIV testing, Harry took a test live on the royal family Facebook page on 14 July 2016. He later attended the 21st International AIDS Conference in Durban, South Africa, on 21 July 2016.\n\nFrom 20 November to 4 December 2016, he visited the Caribbean on behalf of the Queen and the Foreign Office. The countries included Antigua and Barbuda, St Kitts and Nevis, St Lucia, St Vincent and the Grenadines, Grenada, Barbados and Guyana. On World Aids Day, Prince Harry and Rihanna helped publicise HIV testing by taking the test themselves.\n\nIn 2017 he met the Queen of Denmark in Amalienborg Palace.\n\nIt has been reported in the press that the prince is going to get a formal position in the Commonwealth bureaucracy.\n\nPersonal life\n\nHarry enjoys playing many sports, playing competitive polo, skiing, and motocross. He is a supporter of Arsenal Football Club. Harry is also a keen Rugby Union fan and supported England's bid to host the 2015 Rugby World Cup.\n\nHarry earned a reputation in his youth for being rebellious, leading the tabloid press to label him a \"wild child\". He was seen at age 17 smoking cannabis and partaking in underage drinking with his friends, clashing physically with paparazzi outside nightclubs, and was photographed at Highgrove House at a \"Colonial and Native\" themed costume party wearing a Nazi German Afrika Korps uniform with a swastika armband. He later issued a public statement apologising for his behaviour.\n\nIn January 2009, the British tabloid, the News of the World, revealed a video made by Harry three years earlier in which he referred to a Pakistani fellow officer cadet as \"our little Paki friend\" and called a soldier wearing a cloth on his head a \"raghead\". These terms were described by then-Leader of the Opposition David Cameron as \"unacceptable\",[http://www.telegraph.co.uk/news/newstopics/theroyalfamily/4216808/Prince-Harrys-Paki-comments-completely-unacceptable-says-David-Cameron.html \"Prince Harry's 'Paki' comments 'completely unacceptable', says David Cameron\"] The Daily Telegraph, 11 January 2009 and by The Daily Telegraph as \"racist\", with a British Muslim youth organisation calling Harry a \"thug\". Clarence House immediately issued an apology from Harry, who stated that no malice was intended in his remarks. Former British MP and Royal Marine, Rod Richards, said that such nicknames were common amongst military comrades, stating \"in the Armed Forces people often used to call me Taffy. Others were called Yankie, Oz or Kiwi or whatever. I consider Paki as an abbreviation for Pakistani. I don't think on this occasion it was intended to be offensive.\"\n\nWhile on holiday in Las Vegas in August 2012, Harry and an unknown young woman were photographed naked in a Wynn Las Vegas hotel room, reportedly during a game of strip billiards. The pictures were leaked by American celebrity website TMZ on 21 August 2012, and reported worldwide by mainstream media on 22 August 2012. The photographs were shown by the American media but British media were reluctant to publish them – royal aides suggested that Clarence House would contact the Press Complaints Commission (PCC) if the pictures were used by British publications. St James's Palace confirmed that Harry was in the photographs, saying that he was essentially a victim whose privacy had been invaded, and contacted the Press Complaints Commission upon hearing that a number of British newspapers were considering publishing the photographs. On 24 August 2012, The Sun newspaper published the photographs.\n\nPolls conducted in the United Kingdom in November 2012 showed Harry to be the third-most popular member of the royal family, after William and the Queen.\n\nJames Hewitt\n\nThere were rumours that Harry is the son of James Hewitt, with whom his mother had an affair. In response, Hewitt told the press that Harry had been born before the affair began. Hewitt's 2002 statement read:\n\nThe statement was seconded by one of Diana's police bodyguards, Ken Wharfe:\n\nMental health and counselling\n\nIn a 2017 interview with The Daily Telegraph, the prince acknowledged that he sought counselling after two years of \"total chaos\" while struggling to come to terms with the death of his mother.\n\nCourtship and engagement \n\nBachelorhood\n\nChelsy Davy, the daughter of Zimbabwean, South Africa-based businessman Charles Davy, was referred to as Harry's girlfriend in an interview conducted for his 21st birthday, and Harry said he \"would love to tell everyone how amazing she is but once I start talking about that, I have left myself open…  There is truth and there is lies and unfortunately I cannot get the truth across.\" Davy was present when Harry received his Operational Service Medal for Afghanistan and also attended Prince Harry's graduation ceremony when he received his flying wings from his father. In early 2009, it was reported that the pair had parted ways after knowing each other for five years.\n\nIn May 2012, Harry was introduced to Cressida Bonas, granddaughter of Edward Curzon, 6th Earl Howe, by his cousin Princess Eugenie. On 30 April 2014, it was announced that the couple had parted amicably.\n\nEngagement \n\nOn 8 November 2016, Kensington Palace confirmed that Prince Harry was \"a few months\" into a relationship with American actress Meghan Markle, in a statement from the prince asking for the \"abuse and harassment\" of Markle and her family to end. In September 2017, they made their first public appearance together at an official royal engagement at the opening ceremonies of the Invictus Games in Toronto.\n\nOn 27 November 2017, Clarence House and Kensington Palace both announced that Prince Harry and Markle were engaged. The engagement ring was made by Cleave & Co and consists of three diamonds, two of which were taken from the jewelry collection of his mother, Diana, Princess of Wales; the large central stone was sourced by Harry in Botswana, a place the couple have spent time together. In the couple's engagement interview, Meghan revealed they were having a quiet night at home, 'roasting chicken' when the Prince got down on one knee. \n\nThe wedding is planned for St George's Chapel, Windsor Castle, on 19 May 2018. The couple will live together at Nottingham Cottage in London, on the grounds of Kensington Palace, after the wedding. \n\nThe engagement announcement prompted much comment about the possible social significance of Meghan Markle becoming a mixed-race royal.\n\nLifetime TV network is going to film Harry & Meghan: The Royal Love Story, a story about the couple's relationship.\n\nTitles, styles, honours and arms\n\nTitles and styles\n\nHarry's full title is His Royal Highness Prince Henry of Wales, but he is familiarly known as Prince Harry. He uses part of the title—\"Wales\"—in lieu of a surname. Past precedent is that this will change on receipt of a personal substantive title, after which either title alone or Mountbatten-Windsor is used when necessary.\n \n\nHarry has continued to use Wales as his surname for military purposes and is known as Captain Harry Wales in such contexts. \n\nOn 4 June 2015, as part of the 2015 Special Honours, Harry was knighted by his grandmother, the Queen, for \"services to the sovereign\", being appointed a Knight Commander of the Royal Victorian Order (KCVO).\n\nMilitary ranks\n\n* 13 April 2006: Cornet (Second Lieutenant), The Blues and Royals\n* 13 April 2008: Lieutenant, The Blues and Royals\n* 16 April 2011: Captain, The Blues and Royals\n\nHonours\n\n;Orders\n* 4 June 2015: Knight Commander of the Royal Victorian Order (KCVO)\n\n;Medals\n* 6 February 2002: Queen Elizabeth II Golden Jubilee Medal\n* 5 May 2008: Operational Service Medal for Afghanistan\n* 6 February 2012: Queen Elizabeth II Diamond Jubilee Medal\n\nForeign honours \n\n*  12 July 2017: Numbered (1st Class) Commander of the Order of Isabella the Catholic, by King Felipe VI of Spain \n\nAppointments\n\n;Fellowships\n*  6 March 2012: Honorary Fellow of the University of the West Indies\n\nHonorary military appointments\n\n; Canada\n*  10 November 2009present: Canadian Ranger\n\n; United Kingdom\n*  3 October 2008present: Honorary Air Commandant of RAF Honington\n*  8 August 2006present: Commodore-in-Chief of Small Ships and Diving\n*  19 December 2017present: Captain General Royal Marines\n\nHumanitarian awards\n\nHarry has twice had his charitable efforts recognised by the international community. In December 2010, the German charity Ein Herz für Kinder (\"A Heart for Children\") awarded him the Golden Heart Award, in recognition of his \"charitable and humanitarian efforts\". On 7 May 2012, the Atlantic Council awarded him its Distinguished Humanitarian Leadership Award.\n\nArms\n\nAncestry\n\nHarry is a male line descendant of Elimar I, Count of Oldenburg, and a member of the House of Oldenburg, one of Europe's oldest royal houses; the cadet branch to which he belongs, known as the House of Glücksburg, was founded by his paternal ancestor Friedrich Wilhelm, Duke of Schleswig-Holstein-Sonderburg-Glücksburg. His paternal grandmother issued letters patent on 8 February 1960 declaring Harry's father to be a member of the House of Windsor. His male line ancestors include eleven counts of Oldenburg, two dukes of Schleswig-Holstein-Sonderburg, five dukes of Schleswig-Holstein-Sonderburg-Beck, a duke of Schleswig-Holstein-Sonderburg-Glücksburg, four Danish kings – Christian I, Frederick I, Christian III, Christian IX – and King George I of Greece.Michel Huberty, L'Allemagne dynastique, Volume 7, Giraud, 1994, , \n\nAncestors on Harry's father's side include most of the royal families of Europe, and on his mother's side, the Earls Spencer.Williamson, D. (1981) The Ancestry of Lady Diana Spencer Genealogist's Magazine vol. 20 (no. 6) pp. 192–199 and vol. 20 (no. 8) pp. 281–282.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Prince Harry" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14457" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Prince Henry of Wales  (Henry Charles Albert David; born 15 September 1984), familiarly known as Prince Harry, is a member of the British royal family. He is the younger son of Charles, Prince of Wales, and Diana, Princess of Wales, and is fifth in the line of succession to the British throne.\n\nHarry was educated at schools in the United Kingdom and spent parts of his gap year in Australia and Lesotho. He then chose a military career and underwent officer training at the Royal Military Academy Sandhurst. He was commissioned as a cornet (i.e. second lieutenant) into the Blues and Royals, serving temporarily with his brother, Prince William, and completed his training as a troop leader.\n\nIn 2007–08, he served for over ten weeks in Helmand, Afghanistan, but was pulled out after an Australian magazine revealed his presence there. He returned to Afghanistan for a 20-week deployment in 2012–13 with the Army Air Corps. He left the army in June 2015.\n\nHarry launched the Invictus Games in 2014, and remains patron of its Foundation. He also gives patronage to several other organisations, including the HALO Trust, the London Marathon Charitable Trust, and Walking With The Wounded. \n\nHe is engaged to marry American actress Meghan Markle on 19 May 2018.\n\nEarly life\n\nHarry was born in the Lindo Wing of St Mary's Hospital in Paddington, London, on 15 September 1984 at 4:20 pm as the second child of Charles, Prince of Wales, heir apparent to Queen Elizabeth II, and Diana, Princess of Wales. He was baptised with the names Henry Charles Albert David, on 21 December 1984, at St George's Chapel, Windsor Castle, by the Archbishop of Canterbury, Robert Runcie. His godparents are Prince Andrew (his paternal uncle); Lady Sarah Armstrong-Jones (his paternal cousin once removed); Carolyn Bartholomew (née Pride); Bryan Organ; Gerald Ward (former officer in the Household Cavalry); and Celia, Lady Vestey (née Knight).\n\nDiana wanted Harry and his older brother, William, to have a broader range of experiences than previous royal children and took them to venues that ranged from Disney World and McDonald's to AIDS clinics and shelters for the homeless. Harry began to accompany his parents on official visits at an early age; his first overseas tour was with his parents to Italy in 1985.\n\nHarry's parents divorced in 1996, and his mother died in a car crash in Paris the following year. Harry and William were staying with their father at Balmoral at the time, and the Prince of Wales told his sons about their mother's death. At his mother's funeral, Harry, then 12, accompanied his father, brother, paternal grandfather, and maternal uncle, Earl Spencer, in walking behind the funeral cortège from Kensington Palace to Westminster Abbey.\n\nEducation\n\nLike his father and brother, Harry was educated at independent schools. He started at Jane Mynors' nursery school and the pre-preparatory Wetherby School, both in London. Following this, he attended Ludgrove School, and, after passing the entrance exams, was admitted to Eton College. The decision to place Harry at Eton went against the Windsor family convention of sending children to Gordonstoun (Harry's grandfather, father, two uncles, and two cousins all attended); it did, however, see Harry follow in the Spencer family footsteps, as both Diana's father and brother attended Eton.\n\nIn June 2003, Harry completed his education at Eton with two A-Levels, (achieving a grade B in art and D in geography) having decided to drop history of art after AS level. He excelled in sports, particularly polo and rugby union. Passing two A-levels, Harry was eligible to apply for an officer commission in the British Army. One of Harry's former teachers, Sarah Forsyth, has asserted that Harry was a \"weak student\" and that staff at Eton conspired to help Harry cheat on examinations. Both Eton and Harry denied the claims. While a tribunal made no ruling on the cheating claim, it \"accepted the prince had received help in preparing his A-level 'expressive' project, which he needed to pass to secure his place at Sandhurst\".\n\nAfter school, Harry took a gap year, during which he spent time in Australia, working (as his father had done in his youth) on a cattle station and participating in the Young England vs Young Australia Polo Test match. He also travelled to Lesotho, where he worked with orphaned children and produced the documentary film The Forgotten Kingdom.\n\nMilitary career\n\nSandhurst, Blues and Royals, and deployment to Afghanistan\n\nHarry entered the Royal Military Academy Sandhurst on 8 May 2005, where he was known as Officer Cadet Wales, and joined the Alamein Company. Within a year, in April 2006, Harry completed his officer training and was commissioned as a Cornet (second lieutenant) in the Blues and Royals, a regiment of the Household Cavalry in the British Army. He was given the service number 564673. On 13 April 2008, when he reached two years' seniority, Harry was promoted to lieutenant.\n\nIn 2006 it was announced that Harry's unit was scheduled to be deployed in Iraq the following year and a public debate ensued as to whether he should serve there. Defence Secretary John Reid said that he should be allowed to serve on the front line of battle zones. Harry agreed saying, \"If they said 'no, you can't go front line' then I wouldn't drag my sorry ass through Sandhurst and I wouldn't be where I am now\". The Ministry of Defence and Clarence House made a joint announcement on 22 February 2007 that Harry would be deployed with his regiment to Iraq, as part of the 1st Mechanised Brigade of the 3rd Mechanised Divisiona move supported by Harry, who had stated that he would leave the army if he was told to remain in safety while his regiment went to war. He said: \"There's no way I'm going to put myself through Sandhurst and then sit on my arse back home while my boys are out fighting for their country.\" The head of the British army at the time, General Sir Richard Dannatt, said on 30 April 2007 that he had personally decided that Harry would serve with his unit in Iraq, and Harry was scheduled for deployment in May or June 2007, to patrol the Maysan Governorate. By 16 May, however, Dannatt announced that Harry would not serve in Iraq; concerns included Harry being a high-value target (as several threats by various groups had already been made against him) and the dangers the soldiers around him would face should any attempt be made on his life or if he was captured. Clarence House made public Harry's disappointment with the decision, though he said he would abide by it.\n\nIt was reported in early June 2007 that Harry had arrived in Canada to train alongside soldiers of the Canadian Forces and British Army, at CFB Suffield, near Medicine Hat, Alberta. It was said that this was in preparation for a tour of duty in Afghanistan, where Canadian and British forces were participating in the NATO-led Afghan War. This was confirmed in February the following year, when the British Ministry of Defence revealed that Harry had been secretly deployed as a Forward Air Controller to Helmand Province in Afghanistan for the previous ten weeks. The revelation came after the medianotably, German newspaper Bild and Australian magazine New Ideabreached the blackout placed over the information by the Canadian and British authorities. It was later reported that, while in Afghanistan, Harry helped Gurkha troops repel an attack from Taliban insurgents, and performed patrol duty in hostile areas. His tour made Harry the first member of the Royal Family to serve in a war zone since his uncle, Prince Andrew, flew helicopters during the Falklands War. For his service, Harry was presented with an Operational Service Medal for Afghanistan by his aunt, Princess Anne, at the Combermere Barracks in May 2008.\n\nArmy Air Corps and second deployment to Afghanistan\n\nIn October 2008, it was announced that Harry was to follow his brother, father and uncle in learning to fly military helicopters. After passing the initial aptitude test, he was to undertake a month-long course; if he passed that, he would begin full flight training in early 2009. Harry had to pass his flying assessment at the Army Air Corps Base (AAC), Middle Wallop, the result of which would determine whether he would continue on to train as a pilot of the Apache, Lynx, or Gazelle helicopter. Having reached the requisite standard, Harry attended the Defence Helicopter Flying School at RAF Shawbury, where he joined brother William.\n\nHarry was presented with his flying brevet (wings) by his father on 7 May 2010 at a ceremony at the Army Air Corps Base (AAC), Middle Wallop. Harry had let it be known that he intended to fly Apache attack helicopters if he was successful in passing the rigorous Apache training course, after which time it could be possible for him to see active military service once again on the frontline in Afghanistan. During the ceremony, he switched his Blues and Royals' Officer's Service Dress cap for that of the Army Air Corps' sky blue beret with a Blues and Royals badge.\n\nOn 10 March 2011, it was revealed that Harry had passed his Apache flying test and he was awarded his Apache Flying Badge on 14 April 2011. There was speculation that he would return to Afghanistan before the withdrawal in 2015. On 16 April 2011, it was announced that Harry had been promoted to captain.\n\nIn June 2011, Clarence House announced that on completion of his training conversion course to use Apache helicopters in the war arena, Harry would be available for deployment, including in current operations in Afghanistan, as an Apache helicopter pilot. The final decision rested with the Ministry of Defence's senior commanders, including principally the Chief of the Defence Staff in consultation with the wishes of Harry, the Prince of Wales, and the Queen. In October, Harry was transferred to a US military base in California to complete his helicopter gunship training. This final phase included live-fire training and \"environmental and judgment training\" at naval and air force facilities in California and Arizona. The majority of those completing the two-month Apache training were deployed to the front lines in Afghanistan. In the same month, it was reported that Harry was said to be a natural pilot who was top of his class in the extensive training he had undertaken at the Naval Air Facility, El Centro, California. In November 2011, Harry returned to England. He went to Wattisham Flying Station in Suffolk, in the east of England, to complete his training to fly Apache helicopters.\n\nOn 7 September 2012, Harry arrived at Camp Bastion in southern Afghanistan as part of the 100-strong 662 Squadron, 3 Regiment, Army Air Corps, to begin a four-month combat tour as a co-pilot and gunner for an Apache helicopter.  On 10 September, within days of arriving in Afghanistan, it was reported that the Taliban threatened his life. Taliban spokesman Zabiullah Mujahid spoke to Reuters and was quoted as saying: \"We are using all our strength to get rid of him, either by killing or kidnapping,\" and \"We have informed our commanders in Helmand to do whatever they can to eliminate him.\"\n\nIt was announced on 21 January 2013 that Harry was returning from a 20-week deployment in Afghanistan, where he served as an Apache co-pilot/gunner.\nOn 8 July 2013, the Ministry of Defence announced that Harry had successfully qualified as an Apache aircraft commander.\n\nHQ London District and Invictus Games \n\nOn 17 January 2014, the Ministry of Defence announced that Harry had completed his attachment to 3 Regiment Army Air Corps and would take up a staff officer role at the position of SO3 (Defence Engagement) in HQ London District. His responsibilities would include helping to co-ordinate significant projects and commemorative events involving the Army in London. He was based at Horse Guards in central London.\n\nOn 6 March 2014, Prince Harry launched Invictus Games, a Paralympic-style sporting event for injured servicemen and women, which was held on 10–14 September 2014. Prince Harry met British hopefuls for the Invictus Games at Tedworth House for the start of the selection process on 29 April 2014. On 15 May 2014, Harry attended a ticket sale launch for Invictus Games at BT Tower, where he made a public tweet on the Invictus Games' official Twitter account as the president of Invictus Games. To promote the Games, Prince Harry was interviewed by BBC Radio 2's Chris Evans along with two Invictus Games hopefuls. He said: \"This (Invictus Games) is basically my full-time job at the moment, making sure that we pull this off.\" The show aired on 31 July 2014. Harry later wrote an article in The Sunday Times about his experiences in Afghanistan: how they had inspired him to help injured personnel and how, after the trip to the Warrior Games, he had vowed to create the Invictus Games. Harry and officials attended the British Armed Forces Team announcement for Invictus Games at Potters Field Park in August 2014, and as president of the Invictus Games, Harry attended all events related to the Games from 8 to 14 September 2014.\n\nIn January 2015, it was reported that Harry would take a new role in supporting wounded service personnel by working alongside members of the London District's Personal Recovery Unit for the MOD's Defence Recovery Capability scheme to ensure that wounded personnel have adequate recovery plans. The scheme was established in partnership with Help for Heroes and the Royal British Legion, the palace confirmed weeks later.\n\nIn late January 2015, Harry visited The Battle Back Centre set up by the Royal British Legion, and Fisher House UK at the Queen Elizabeth Hospital Birmingham, which was created in the partnership between Help for Heroes, the Fisher House Foundation and the Queen Elizabeth Hospital Birmingham (QEHB) Charity. Fisher House Foundation is one of the Invictus Games' sponsors.\n\nIn February and March 2015, Harry visited Phoenix House in Catterick Garrison, North Yorkshire, a recovery centre run by Help for Heroes, and Merville Barracks in Colchester, where Chavasse VC House Personnel Recovery Centre is located, run by Help for Heroes in partnership with the Ministry of Defence and Royal British Legion.\n\nSecondment to Australian Defence Force and leaving the Army\n\nOn 17 March 2015, Kensington Palace announced that Prince Harry would leave the Armed Forces in June. Before then, he would spend four weeks throughout April and May at army barracks in Darwin, Perth and Sydney whilst seconded to the Australian Defence Force (ADF). After leaving the Army, while considering his future, he would return to work with the Ministry of Defence, supporting Case Officers in the Ministry of Defence's Recovery Capability Programme, working with both those who administer and receive physical and mental care within the London District area in a voluntary capacity.\n\nOn 6 April 2015, Prince Harry reported for duty to Australia's Chief of the Defence Force, Air Chief Marshal Mark Binskin at the Royal Military College, Duntroon in Canberra, Australia. Harry flew to Darwin later that day to start his month-long secondment to the ADF's 1st Brigade. His visit included detachments to NORFORCE as well as to an aviation unit. While in Perth, he trained with Special Air Service Regiment (SASR), participating in the SASR selection course, including a fitness test and a physical training session with SASR selection candidates. He also joined SASR members in Perth for live-fire shooting exercises with numerous Special Forces weapons at a variety of ranges and completed an insertion training exercise using a rigid-hull inflatable boat. In Sydney, he undertook urban operations training with the 2nd Commando Regiment. Training activities included remotely detonating an Improvised Explosive Device (IED) and rappelling from a building. He also spent time flying over Sydney as co-pilot of an Army Black Hawk and participated in counter-terrorism training in Sydney Harbour with Royal Australian Navy clearance divers.\n\nHarry's attachment with the ADF ended on 8 May 2015, and on 19 June 2015 his career with the Army ended.\n\nOther activities\n\nAt the age of 21, Harry was appointed a Counsellor of State and began his duties in that capacity when the Queen was attending the 2005 Commonwealth Heads of Government Meeting in Malta. The following year, he was in Lesotho to visit Mants'ase Children's Home near Mohale's Hoek, which he first toured in 2004 and, along with Prince Seeiso of Lesotho, he launched Sentebale: The Princes' Fund for Lesotho, a charity to aid children orphaned by HIV/AIDS. He has granted his patronage to organisations including WellChild, Dolen Cymru, and MapAction. To aid Sentebale, the Diana, Princess of Wales Memorial Fund and Centrepoint, Harry and his brother organised the Concert for Diana at Wembley Stadium, on 1 July 2007.\n\nSport has been a way that Harry has helped charities and other organisations, including training as a Rugby Development Officer for the Rugby Football Union in 2004 and coaching students in schools to encourage them to learn the sport. Like his brother and father, he has participated in polo matches to raise money for charitable causes.\n\nOn 6 January 2009, the Queen granted Harry and William their own royal household. It has three main staff members, supported by a small team. Sir David Manning, the former British ambassador to Washington, is a part-time adviser to the princes. Previously, William and Harry's affairs had been handled by the office of their father at Clarence House in central London. The new household released a statement announcing that they had established their own office at nearby St James's Palace to look after their public, military and charitable activities.\n In September 2009, William and Harry set up The Foundation of Prince William and Prince Harry to enable the princes to take forward their charitable ambitions.\n\nIn March 2012, Harry led an official visit to Belize as part of the Queen's Diamond Jubilee celebrations. He continued to the Bahamas and Jamaica, where the Prime Minister, Portia Simpson-Miller, was considering severing ties between Jamaica and the constitutional monarchy. He then visited Brazil to attend the GREAT Campaign, as an ambassador of the 2012 Olympics to the 2016 Rio Olympics. On 12 August 2012, Harry represented the Queen at the closing ceremony of the London 2012 Olympic Games.\n\nBetween 9 and 15 May 2013, he made an official visit to the United States. The tour promoted the rehabilitation of injured American and UK troops, publicised his own charities and supported British interests. It included engagements in Washington DC, Colorado, New York, New Jersey, and Connecticut. He watched the opening ceremony of the Warrior Games, in Colorado Springs, where injured servicemen and women competed, and met survivors of Hurricane Sandy in New Jersey.\n\nIn August 2013, he visited Angola to see HALO Trust's work there as patron of the trust's 25th Anniversary Appeal. In October 2013, he visited Australia for his first official visit to the country and attended the International Fleet Review at Sydney Harbour. He also paid a visit to the Australian SAS HQ in Perth. On his way back to the UK, he attended a charity event for Sentebale at Dubai.\n\nIn May 2014, he visited Estonia and Italy. In Estonia, he visited Freedom Square in the capital Tallinn to honour those who paid the ultimate sacrifice for their nation, and attended a reception at the Estonian Parliament and a NATO military exercise. In Italy, he attended commemorations of the 70th anniversary of the Monte Cassino battles, in which Polish, Commonwealth and British troops fought. He also unveiled the British Pavilion at Expo Milano 2015 in Rome at the MAXXI Museum. In June 2014, he visited Brazil and Chile.\n\nTo mark the World War I centenary, on 4 August 2014, he attended the unveiling of the Folkestone Memorial Arch in Kent. Subsequently, he flew to Belgium, where he met families of WWI soldiers in a reception before reading a letter from a fallen soldier in a twilight service at St Symphorien Military Cemetery in Mons. Harry and the Duke and Duchess of Cambridge planted poppies at an installation by artist Paul Cummins, titled Blood Swept Lands and Seas of Red, at the Tower of London to commemorate the war on 5 August.\n\nOn 6 November 2014, he opened the Field of Remembrance at Westminster Abbey, a task usually performed by the Duke of Edinburgh. On 7 November 2013, Prince Harry had accompanied his grandfather at the previous year's opening. On 9 November 2014, Prince Harry attended Remembrance Sunday Service at Kandahar Air Base, Afghanistan, representing the Queen.\n\nFrom 18 to 20 November 2014, he made an official visit to Oman. His original plan was to attend the National Day Parade, but due to the illness of the Sultan, the parade was cancelled and Harry's visit became semi-official. He visited the British Embassy, Nizwa Fort, Muttrah souk, and Sultan Qaboos Grand Mosque. On 20 November, he played in the Sentebale Polo Cup in Abu Dhabi in aid of Sentebale; it was hailed as the Sentebale Polo Cup. In December 2014, Prince Harry visited Lesotho with Prince Seeiso of Lesotho to see the charity's work.\n\nOn 13 March 2015, the royal family attended a commemoration service at St Paul's Cathedral marking the end of the Afghanistan campaign. Before reporting for duty to the Australian Defence Force (ADF), Prince Harry visited the Australian War Memorial in Canberra on 6 April 2015. On 7 May 2015, he made a farewell walkabout at the Sydney Opera House and visited Macquarie University Hospital, where he met Lieutenant Ali Spearing who had undergone pioneering treatment in the hospital to fit prosthetic limbs.\n\nOn 24–25 April 2015, he joined his father in Turkey to attend commemorations of the centenary of the Gallipoli Campaign. Harry made an official visit to New Zealand in May 2015, touring Wellington, Invercargill, Stewart Island, Christchurch, Linton, Whanganui, and Auckland.\n\nOn 11 June 2015, he attended the Service of Dedication and unveiling of the Bastion Memorial at the National Memorial Arboretum. On 14 July 2015, as patron of Invictus Games Foundation, he announced that the 2016 Invictus Games will take place from 8–12 May 2016 at the ESPN Wide World of Sports Complex in Orlando, Florida. On 15 September 2015, he watched the Battle of Britain Flypast at Goodwood in West Sussex. As patron of Walk of Britain, he walked with the team on 30 September and 20 October.\nHe attended a service to mark the 75th anniversary of Explosive Ordnance Disposal at St Paul's Cathedral on 22 October 2015.\n\nOn 28 October 2015, he carried out one day of engagements in the US. He launched the Invictus Games Orlando 2016 with First Lady Michelle Obama and Dr. Jill Biden at Fort Belvoir. He later attended an Invictus Games 2016 Board Meeting and a Reception to celebrate the launch at the British Ambassador's Residence. Prior to the reception, Harry met with President Barack Obama in the Oval Office.\n\nOn 26 November 2015, as patron of Sentebale, Prince Harry travelled to Lesotho to attend the opening of the Mamohato Children’s Centre. Two days later Harry played the Sentebale Royal Salute Polo Cup, at Val de Vie Estate in Cape Town, South Africa, fundraising for Sentebale.\n\nFrom 30 November to 3 December 2015, he made an official visit to South Africa. He visited Cape Town, where he met with Archbishop Emeritus Desmond Tutu and presented the Order of the Companions of Honour to the Archbishop on behalf of the Queen. On the day he visited Kruger National Park and Southern African Wildlife College, Kensington Palace released a series of pictures and videos about his conservation work tour in Africa during the summer. In Johannesburg, Harry visited the Nelson Mandela Foundation where he met with Graca Machel and toured the private archives of the Centre for Memory. He also met with President Jacob Zuma at his residence in Pretoria. On 27 December 2017, Harry was officially appointed the new President of African Parks, a conservation NGO. He previously spent three weeks in Malawi with African Parks where he joined a team of volunteers and professionals to carry out one of the largest elephant translocations in history. The effort to repopulate decimated areas due to poaching and habitat loss moved 500 elephants from Liwonde and Majete National Parks to Nkhotakota Wildlife Reserve.\n\nHe visited Nepal 19–23 March 2016. He stayed extra days till end of March 2016 to help rebuild a secondary school with Team Rubicon UK and visited a Hydropower Project in Central Nepal.\n\nAs patron of Invictus Games Foundation, he attended a day of engagements to launch the Invictus Games 2017 in Toronto on 2 May 2016, he also met with Prime Minister Justin Trudeau. From 5–13 May 2016, Harry attended the Invictus Games 2016, where he met competitors and their families, and watched all sports competitions. He gave speeches at the opening and closing ceremonies, attended a symposium on Invisible Wounds, with President George W. Bush and two veterans, and receptions for sponsors, Invictus Games Foundation and Royal Foundation. Prior the Games, on 4 May 2016, Prince Harry played in the Sentebale Royal Salute Polo Cup at Valiente Polo Farm to raise funds for his charity Sentebale. From 30 June to 1 July 2016, he, along with the Duke and Duchess of Cambridge, attended the Battle of the Somme centenary commemorations at the Thiepval Memorial in France.\n\nTo raise the awareness of HIV testing, Harry took a test live on the royal family Facebook page on 14 July 2016. He later attended the 21st International AIDS Conference in Durban, South Africa, on 21 July 2016.\n\nFrom 20 November to 4 December 2016, he visited the Caribbean on behalf of the Queen and the Foreign Office. The countries included Antigua and Barbuda, St Kitts and Nevis, St Lucia, St Vincent and the Grenadines, Grenada, Barbados and Guyana. On World Aids Day, Prince Harry and Rihanna helped publicise HIV testing by taking the test themselves.\n\nIn 2017 he met the Queen of Denmark in Amalienborg Palace.\n\nIt has been reported in the press that the prince is going to get a formal position in the Commonwealth bureaucracy.\n\nPersonal life\n\nHarry enjoys playing many sports, playing competitive polo, skiing, and motocross. He is a supporter of Arsenal Football Club. Harry is also a keen Rugby Union fan and supported England's bid to host the 2015 Rugby World Cup.\n\nHarry earned a reputation in his youth for being rebellious, leading the tabloid press to label him a \"wild child\". He was seen at age 17 smoking cannabis and partaking in underage drinking with his friends, clashing physically with paparazzi outside nightclubs, and was photographed at Highgrove House at a \"Colonial and Native\" themed costume party wearing a Nazi German Afrika Korps uniform with a swastika armband. He later issued a public statement apologising for his behaviour.\n\nIn January 2009, the British tabloid, the News of the World, revealed a video made by Harry three years earlier in which he referred to a Pakistani fellow officer cadet as \"our little Paki friend\" and called a soldier wearing a cloth on his head a \"raghead\". These terms were described by then-Leader of the Opposition David Cameron as \"unacceptable\",[http://www.telegraph.co.uk/news/newstopics/theroyalfamily/4216808/Prince-Harrys-Paki-comments-completely-unacceptable-says-David-Cameron.html \"Prince Harry's 'Paki' comments 'completely unacceptable', says David Cameron\"] The Daily Telegraph, 11 January 2009 and by The Daily Telegraph as \"racist\", with a British Muslim youth organisation calling Harry a \"thug\". Clarence House immediately issued an apology from Harry, who stated that no malice was intended in his remarks. Former British MP and Royal Marine, Rod Richards, said that such nicknames were common amongst military comrades, stating \"in the Armed Forces people often used to call me Taffy. Others were called Yankie, Oz or Kiwi or whatever. I consider Paki as an abbreviation for Pakistani. I don't think on this occasion it was intended to be offensive.\"\n\nWhile on holiday in Las Vegas in August 2012, Harry and an unknown young woman were photographed naked in a Wynn Las Vegas hotel room, reportedly during a game of strip billiards. The pictures were leaked by American celebrity website TMZ on 21 August 2012, and reported worldwide by mainstream media on 22 August 2012. The photographs were shown by the American media but British media were reluctant to publish them – royal aides suggested that Clarence House would contact the Press Complaints Commission (PCC) if the pictures were used by British publications. St James's Palace confirmed that Harry was in the photographs, saying that he was essentially a victim whose privacy had been invaded, and contacted the Press Complaints Commission upon hearing that a number of British newspapers were considering publishing the photographs. On 24 August 2012, The Sun newspaper published the photographs.\n\nPolls conducted in the United Kingdom in November 2012 showed Harry to be the third-most popular member of the royal family, after William and the Queen.\n\nJames Hewitt\n\nThere were rumours that Harry is the son of James Hewitt, with whom his mother had an affair. In response, Hewitt told the press that Harry had been born before the affair began. Hewitt's 2002 statement read:\n\nThe statement was seconded by one of Diana's police bodyguards, Ken Wharfe:\n\nMental health and counselling\n\nIn a 2017 interview with The Daily Telegraph, the prince acknowledged that he sought counselling after two years of \"total chaos\" while struggling to come to terms with the death of his mother.\n\nCourtship and engagement \n\nBachelorhood\n\nChelsy Davy, the daughter of Zimbabwean, South Africa-based businessman Charles Davy, was referred to as Harry's girlfriend in an interview conducted for his 21st birthday, and Harry said he \"would love to tell everyone how amazing she is but once I start talking about that, I have left myself open…  There is truth and there is lies and unfortunately I cannot get the truth across.\" Davy was present when Harry received his Operational Service Medal for Afghanistan and also attended Prince Harry's graduation ceremony when he received his flying wings from his father. In early 2009, it was reported that the pair had parted ways after knowing each other for five years.\n\nIn May 2012, Harry was introduced to Cressida Bonas, granddaughter of Edward Curzon, 6th Earl Howe, by his cousin Princess Eugenie. On 30 April 2014, it was announced that the couple had parted amicably.\n\nEngagement \n\nOn 8 November 2016, Kensington Palace confirmed that Prince Harry was \"a few months\" into a relationship with American actress Meghan Markle, in a statement from the prince asking for the \"abuse and harassment\" of Markle and her family to end. In September 2017, they made their first public appearance together at an official royal engagement at the opening ceremonies of the Invictus Games in Toronto.\n\nOn 27 November 2017, Clarence House and Kensington Palace both announced that Prince Harry and Markle were engaged. The engagement ring was made by Cleave & Co and consists of three diamonds, two of which were taken from the jewelry collection of his mother, Diana, Princess of Wales; the large central stone was sourced by Harry in Botswana, a place the couple have spent time together. In the couple's engagement interview, Meghan revealed they were having a quiet night at home, 'roasting chicken' when the Prince got down on one knee. \n\nThe wedding is planned for St George's Chapel, Windsor Castle, on 19 May 2018. The couple will live together at Nottingham Cottage in London, on the grounds of Kensington Palace, after the wedding. \n\nThe engagement announcement prompted much comment about the possible social significance of Meghan Markle becoming a mixed-race royal.\n\nLifetime TV network is going to film Harry & Meghan: The Royal Love Story, a story about the couple's relationship.\n\nTitles, styles, honours and arms\n\nTitles and styles\n\nHarry's full title is His Royal Highness Prince Henry of Wales, but he is familiarly known as Prince Harry. He uses part of the title—\"Wales\"—in lieu of a surname. Past precedent is that this will change on receipt of a personal substantive title, after which either title alone or Mountbatten-Windsor is used when necessary.\n \n\nHarry has continued to use Wales as his surname for military purposes and is known as Captain Harry Wales in such contexts. \n\nOn 4 June 2015, as part of the 2015 Special Honours, Harry was knighted by his grandmother, the Queen, for \"services to the sovereign\", being appointed a Knight Commander of the Royal Victorian Order (KCVO).\n\nMilitary ranks\n\n* 13 April 2006: Cornet (Second Lieutenant), The Blues and Royals\n* 13 April 2008: Lieutenant, The Blues and Royals\n* 16 April 2011: Captain, The Blues and Royals\n\nHonours\n\n;Orders\n* 4 June 2015: Knight Commander of the Royal Victorian Order (KCVO)\n\n;Medals\n* 6 February 2002: Queen Elizabeth II Golden Jubilee Medal\n* 5 May 2008: Operational Service Medal for Afghanistan\n* 6 February 2012: Queen Elizabeth II Diamond Jubilee Medal\n\nForeign honours \n\n*  12 July 2017: Numbered (1st Class) Commander of the Order of Isabella the Catholic, by King Felipe VI of Spain \n\nAppointments\n\n;Fellowships\n*  6 March 2012: Honorary Fellow of the University of the West Indies\n\nHonorary military appointments\n\n; Canada\n*  10 November 2009present: Canadian Ranger\n\n; United Kingdom\n*  3 October 2008present: Honorary Air Commandant of RAF Honington\n*  8 August 2006present: Commodore-in-Chief of Small Ships and Diving\n*  19 December 2017present: Captain General Royal Marines\n\nHumanitarian awards\n\nHarry has twice had his charitable efforts recognised by the international community. In December 2010, the German charity Ein Herz für Kinder (\"A Heart for Children\") awarded him the Golden Heart Award, in recognition of his \"charitable and humanitarian efforts\". On 7 May 2012, the Atlantic Council awarded him its Distinguished Humanitarian Leadership Award.\n\nArms\n\nAncestry\n\nHarry is a male line descendant of Elimar I, Count of Oldenburg, and a member of the House of Oldenburg, one of Europe's oldest royal houses; the cadet branch to which he belongs, known as the House of Glücksburg, was founded by his paternal ancestor Friedrich Wilhelm, Duke of Schleswig-Holstein-Sonderburg-Glücksburg. His paternal grandmother issued letters patent on 8 February 1960 declaring Harry's father to be a member of the House of Windsor. His male line ancestors include eleven counts of Oldenburg, two dukes of Schleswig-Holstein-Sonderburg, five dukes of Schleswig-Holstein-Sonderburg-Beck, a duke of Schleswig-Holstein-Sonderburg-Glücksburg, four Danish kings – Christian I, Frederick I, Christian III, Christian IX – and King George I of Greece.Michel Huberty, L'Allemagne dynastique, Volume 7, Giraud, 1994, , \n\nAncestors on Harry's father's side include most of the royal families of Europe, and on his mother's side, the Earls Spencer.Williamson, D. (1981) The Ancestry of Lady Diana Spencer Genealogist's Magazine vol. 20 (no. 6) pp. 192–199 and vol. 20 (no. 8) pp. 281–282. Prince Harry. http://en.wikipedia.org/?curid=14457."
  }
}
