{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7061",
  "eid" : "dfd69070-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778455287,
  "textBody" : "In the United States, a community emergency response team (CERT) can refer to\n* one of five federal programs promoted under the umbrella organization Citizen Corps, which is funded in part by the Stafford Act;\n* an implementation of the federal CERT program, administered by a local sponsoring agency, which receives Stafford grant funding, and provides standardized training and an implementation framework to community members;\n* an organization of volunteer emergency workers who have received specific training in basic disaster response skills, and who agree to supplement existing emergency responders in the event of a major disaster.\n\nSometimes programs and organizations take different names, such as Neighborhood Emergency Response Team (NERT), or Neighborhood Emergency Team (NET).\n\nThe concept of civilian auxiliaries is similar to civil defense, which has a longer history. The CERT concept differs because it includes nonmilitary emergencies, and is coordinated with all levels of emergency authorities, local to national, via an overarching incident command system.\n\nOrganization \n\nA local government agency, often a fire department, police department, or emergency management agency, agrees to sponsor CERT within its jurisdiction. The sponsoring agency liaises with, deploys and may train or supervise the training of CERT members. The sponsoring agency receives and disburses federal and state Citizen Corps grant funds allocated to its CERT program. Many sponsoring agencies employ a full-time community-service person as liaison to the CERT members. In some communities, the liaison is a volunteer and CERT member.\n\nAs people are trained and agree to join the community emergency response effort, a CERT is formed. Initial efforts may result in a team with only a few members from across the community. As the number of members grow, a single community-wide team may subdivide. Multiple CERTs are organized into a hierarchy of teams consistent with ICS principles. This follows the Incident Command System (ICS) principle of Span of control until the ideal distribution is achieved: one or more teams are formed at each neighborhood within a community.\n\nA Teen Community Emergency Response Team (TEEN CERT), or Student Emergency Response Team (SERT), can be formed from any group of teens. A Teen Cert can be formed as a school club, service organization, Venturing Crew, Explorer Post, or the training can be added to a school's graduation curriculum. Some CERTs form a club or service corporation, and recruit volunteers to perform training on behalf of the sponsoring agency. This reduces the financial and human resource burden on the sponsoring agency.\n\nWhen not responding to disasters or large emergencies, CERTs may\n* raise funds for emergency response equipment in their community;\n* provide first-aid, crowd control or other services at community events;\n* hold planning, training, or recruitment meetings; and\n* conduct or participate in disaster response exercises.\n\nSome sponsoring agencies use Citizen Corps grant funds to purchase response tools and equipment for their members and team(s) (subject to Stafford Act limitations). Most CERTs also acquire their own supplies, tools, and equipment. As community members, CERTs are aware of the specific needs of their community and equip the teams accordingly.\n\nResponse \n\nThe basic idea is to use CERT to perform the large number of tasks needed in emergencies. This frees highly trained professional responders for more technical tasks. Much of CERT training concerns the Incident Command System and organization, so CERT members fit easily into larger command structures.\n\nA team may self-activate (self-deploy) when their own neighborhood is affected by disaster. An effort is made to report their response status to the sponsoring agency. A self-activated team will size-up the loss in their neighborhood and begin performing the skills they have learned to minimize further loss of life, property, and environment. They will continue to respond safely until redirected or relieved by the sponsoring agency or professional responders on-scene.\n\nTeams in neighborhoods not affected by disaster may be deployed or activated by the sponsoring agency. The sponsoring agency may communicate with neighborhood CERT leaders through an organic communication team. In some areas the communications may be by amateur radio, FRS, GMRS or MURS radio, dedicated telephone or fire-alarm networks. In other areas, relays of bicycle-equipped runners can effectively carry messages between the teams and the local emergency operations center.\n\nThe sponsoring agency may activate and dispatch teams in order to gather or respond to intelligence about an incident. Teams may be dispatched to affected neighborhoods, or organized to support operations. CERT members may augment support staff at an Incident Command Post or Emergency Operations Center. Additional teams may also be created to guard a morgue, locate supplies and food, convey messages to and from other CERT teams and local authorities, and other duties on an as-needed basis as identified by the team leader.\n\nIn the short term, CERTs perform data gathering, especially to locate mass-casualties requiring professional response, or situations requiring professional rescues, simple fire-fighting tasks (for example, small fires, turning off gas), light search and rescue, damage evaluation of structures, triage and first aid. In the longer term, CERTs may assist in the evacuation of residents, or assist with setting up a neighborhood shelter.\n\nWhile responding, CERT members are temporary volunteer government workers. In some areas, (such as California, Hawaii and Kansas) registered, activated CERT members are eligible for worker's compensation for on-the-job injuries during declared disasters.\n\nMember roles \n\nThe Federal Emergency Management Agency (FEMA) recommends that the standard, ten-person team be comprised as follows:\n* CERT Leader. Generally, the first CERT team member arriving on the scene becomes team leader, and is the designated Incident Commander (IC) until the arrival of someone more competent. This person makes the IC initial assessment of the scene and determines the appropriate course of action for team members; assumes role of Safety Officer until assigned to another team member; assigns team member roles if not already assigned; designates triage area, treatment area, morgue, and vehicle traffic routes; coordinates and directs team operations; determines logistical needs (water, food, medical supplies, transportation, equipment, and so on.) and determines ways to meet those needs through team members or citizen volunteers on the scene; collects and writes reports on the operation and victims; and communicates and coordinates with the incident commander, local authorities, and other CERT team leaders. The team leader is identified by two pieces of crossed tape on the hard hat.\n* Safety Officer. Checks team members prior to deployment to ensure they are safe and equipped for the operation; determines safe or unsafe working environments; ensures team accountability; supervises operations (when possible) where team members and victims are at direct physical risk, and alerts team members when unsafe conditions arise.\n* Fire Suppression Team (2 people). Work under the supervision of the Team Leader to suppress small fires in designated work areas or as needed; when not accomplishing their primary mission, assist the search and rescue team or triage team; assist in evacuation and transport as needed; assist in the triage or treatment area as needed, other duties as assigned; communicate with Team Leader.\n* Search and Rescue Team (2). Work under the supervision of the Team Leader, searching for and providing rescue of victims as is prudent under the conditions; when not accomplishing their primary mission, assist the Fire Suppression Team, assist in the triage or treatment area as needed; other duties as assigned; communicate with Team Leader.\n* Medical Triage Team (2). Work under the supervision of the Team Leader, providing START triage for victims found at the scene; marking victims with category of injury per the standard operating procedures; when not accomplishing their primary mission, assist the Fire Suppression Team if needed, assist the Search and Rescue Team if needed, assist in the Medical Triage Area if needed, assist in the Treatment Area if needed, other duties as assigned; communicate with Team Leader.\n\n* Medical Treatment Team (2). Work under the supervision of the Team Leader, providing medical treatment to victims within the scope of their training. This task is normally accomplished in the Treatment Area, however, it may take place in the affected area as well. When not accomplishing their primary mission, assist the Fire Suppression Team as needed, assist the Medical Triage Team as needed; other duties as assigned; communicate with the Team Leader.\n\nBecause every CERT member in a community receives the same core instruction, any team member has the training necessary to assume any of these roles. This is important during a disaster response because not all members of a regular team may be available to respond. Hasty teams may be formed by whichever members are responding at the time. Additionally, members may need to adjust team roles due to stress, fatigue, injury, or other circumstances.\n\nTraining \n\nWhile state and local jurisdictions will implement training in the manner that best suits the community, the Citizen Corps CERT program has an established curriculum. Jurisdictions may augment the training, but are strongly encouraged to deliver the entire core content. The Citizen Corps CERT core curriculum for the basic course is composed of the following nine units (time is instructional hours):\n* Unit 1: Disaster Preparedness (2.5 hrs). Topics include (in part) identifying local disaster threats, disaster impact, mitigation and preparedness concepts, and an overview of Citizen Corps and CERT. Hands on skills include team-building exercises, and shutting off utilities.\n* Unit 2: Fire Safety (2.5 hrs). Students learn about fire chemistry, mitigation practices, hazardous materials identification, suppression options, and are introduced to the concept of size-up. Hands-on skills include using a fire extinguisher to suppress a live flame, and wearing basic protective gear. Firefighting standpipes as well as unconventional firefighting methods are also covered.\n* Unit 3: Disaster Medical Operations part 1 (2.5 hrs). Students learn to identify and treat certain life-threatening conditions in a disaster setting, as well as START triage. Hands-on skills include performing head-tilt/chin-lift, practicing bleeding control techniques, and performing triage as an exercise.\n* Unit 4: Disaster Medical Operations part 2 (2.5 hrs). Topics cover mass casualty operations, public health, assessing patients, and treating injuries. Students practice patient assessment, and various treatment techniques.\n* Unit 5: Light Search and Rescue Operations (2.5 hrs). Size-up is expanded as students learn about assessing structural damage, marking structures that have been searched, search techniques, as well as rescue techniques and cribbing. Hands-on activities include lifting and cribbing an object, and practicing rescue carries.\n* Unit 6: CERT Organization (1.5 hrs). Students are introduced to several concepts from the Incident Command System, and local team organization and communication is explained. Hands-on skills include a table-top exercise focusing on incident command and control.\n* Unit 7: Disaster Psychology (1 hr). Responder well-being and dealing with victim trauma are the topics of this unit.\n* Unit 8: Terrorism and CERT (2.5 hrs). Students learn how terrorists may choose targets, what weapons they may use, and identifying when chemical, biological, radiological, nuclear, or explosive weapons may have been deployed. Students learn about CERT roles in preparing for and responding to terrorist attacks. A table-top exercise highlights topics covered.\n* Unit 9: Course Review and Disaster Simulation (2.5 hrs). Students take a written exam, then participate in a real-time practical disaster simulation where the different skill areas are put to the test. A critique follows the exercise where students and instructors have an opportunity to learn from mistakes and highlight exemplary actions. Students may be given a certificate of completion at the conclusion of the course.\n\nCitizen Corps CERT training emphasizes safely \"doing the most good for the most people as quickly as possible\" when responding to a disaster. For this reason, cardiopulmonary resuscitation (CPR) training is not included in the core curriculum, as it is time and responder intensive in a mass-casualty incident. However, many jurisdictions encourage or require CERT members to obtain CPR training.  Many CERT programs provide or encourage members to take additional first aid training. Some CERT members may also take training to become a certified first responder or emergency medical technician.\n\nMany CERT programs also provide training in amateur radio operation, shelter operations, flood response, community relations, mass care, the incident command system (ICS), and the National Incident Management System (NIMS).\n\nEach unit of Citizen Corps CERT training is ideally delivered by professional responders or other experts in the field addressed by the unit. This is done to help build unity between CERT members and responders, keep the attention of students, and help the professional response organizations be comfortable with the training which CERT members receive.\n\nEach course of instruction is ideally facilitated by one or more instructors certified in the CERT curriculum by the state or sponsoring agency. Facilitating instructors provide continuity between units, and help ensure that the CERT core curriculum is being delivered successfully. Facilitating instructors also perform set-up and tear-down of the classroom, provide instructional materials for the course, record student attendance and other tasks which assist the professional responder in delivering their unit as efficiently as possible.\n\nCitizen Corps CERT training is provided free to interested members of the community, and is delivered in a group classroom setting. People may complete the training without obligation to join a CERT. Citizen Corps grant funds can be used to print and provide each student with a printed manual. Some sponsoring agencies use Citizen Corps grant funds to purchase disaster response tool kits. These kits are offered as an incentive to join a CERT, and must be returned to the sponsoring agency when members resign from CERT.\n\nSome sponsoring agencies require a criminal background-check of all trainees before allowing them to participate on a CERT. For example, the city of Albuquerque, New Mexico require all volunteers to pass a background check, while the city of Austin, Texas does not require a background check to take part in training classes but requires members to undergo a background check in order to receive a CERT badge and directly assist first responders during an activation of the Emergency Operations Center. However, most programs do not require a criminal background check in order to participate.\n\nThe Citizen Corps CERT curriculum (including the Train-the-Trainer course) was updated during the last half of 2008 to reflect feedback from instructors across the nation. The update is in final review, and is scheduled for release during the first quarter of 2009.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Community emergency response team" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7061" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In the United States, a community emergency response team (CERT) can refer to\n* one of five federal programs promoted under the umbrella organization Citizen Corps, which is funded in part by the Stafford Act;\n* an implementation of the federal CERT program, administered by a local sponsoring agency, which receives Stafford grant funding, and provides standardized training and an implementation framework to community members;\n* an organization of volunteer emergency workers who have received specific training in basic disaster response skills, and who agree to supplement existing emergency responders in the event of a major disaster.\n\nSometimes programs and organizations take different names, such as Neighborhood Emergency Response Team (NERT), or Neighborhood Emergency Team (NET).\n\nThe concept of civilian auxiliaries is similar to civil defense, which has a longer history. The CERT concept differs because it includes nonmilitary emergencies, and is coordinated with all levels of emergency authorities, local to national, via an overarching incident command system.\n\nOrganization \n\nA local government agency, often a fire department, police department, or emergency management agency, agrees to sponsor CERT within its jurisdiction. The sponsoring agency liaises with, deploys and may train or supervise the training of CERT members. The sponsoring agency receives and disburses federal and state Citizen Corps grant funds allocated to its CERT program. Many sponsoring agencies employ a full-time community-service person as liaison to the CERT members. In some communities, the liaison is a volunteer and CERT member.\n\nAs people are trained and agree to join the community emergency response effort, a CERT is formed. Initial efforts may result in a team with only a few members from across the community. As the number of members grow, a single community-wide team may subdivide. Multiple CERTs are organized into a hierarchy of teams consistent with ICS principles. This follows the Incident Command System (ICS) principle of Span of control until the ideal distribution is achieved: one or more teams are formed at each neighborhood within a community.\n\nA Teen Community Emergency Response Team (TEEN CERT), or Student Emergency Response Team (SERT), can be formed from any group of teens. A Teen Cert can be formed as a school club, service organization, Venturing Crew, Explorer Post, or the training can be added to a school's graduation curriculum. Some CERTs form a club or service corporation, and recruit volunteers to perform training on behalf of the sponsoring agency. This reduces the financial and human resource burden on the sponsoring agency.\n\nWhen not responding to disasters or large emergencies, CERTs may\n* raise funds for emergency response equipment in their community;\n* provide first-aid, crowd control or other services at community events;\n* hold planning, training, or recruitment meetings; and\n* conduct or participate in disaster response exercises.\n\nSome sponsoring agencies use Citizen Corps grant funds to purchase response tools and equipment for their members and team(s) (subject to Stafford Act limitations). Most CERTs also acquire their own supplies, tools, and equipment. As community members, CERTs are aware of the specific needs of their community and equip the teams accordingly.\n\nResponse \n\nThe basic idea is to use CERT to perform the large number of tasks needed in emergencies. This frees highly trained professional responders for more technical tasks. Much of CERT training concerns the Incident Command System and organization, so CERT members fit easily into larger command structures.\n\nA team may self-activate (self-deploy) when their own neighborhood is affected by disaster. An effort is made to report their response status to the sponsoring agency. A self-activated team will size-up the loss in their neighborhood and begin performing the skills they have learned to minimize further loss of life, property, and environment. They will continue to respond safely until redirected or relieved by the sponsoring agency or professional responders on-scene.\n\nTeams in neighborhoods not affected by disaster may be deployed or activated by the sponsoring agency. The sponsoring agency may communicate with neighborhood CERT leaders through an organic communication team. In some areas the communications may be by amateur radio, FRS, GMRS or MURS radio, dedicated telephone or fire-alarm networks. In other areas, relays of bicycle-equipped runners can effectively carry messages between the teams and the local emergency operations center.\n\nThe sponsoring agency may activate and dispatch teams in order to gather or respond to intelligence about an incident. Teams may be dispatched to affected neighborhoods, or organized to support operations. CERT members may augment support staff at an Incident Command Post or Emergency Operations Center. Additional teams may also be created to guard a morgue, locate supplies and food, convey messages to and from other CERT teams and local authorities, and other duties on an as-needed basis as identified by the team leader.\n\nIn the short term, CERTs perform data gathering, especially to locate mass-casualties requiring professional response, or situations requiring professional rescues, simple fire-fighting tasks (for example, small fires, turning off gas), light search and rescue, damage evaluation of structures, triage and first aid. In the longer term, CERTs may assist in the evacuation of residents, or assist with setting up a neighborhood shelter.\n\nWhile responding, CERT members are temporary volunteer government workers. In some areas, (such as California, Hawaii and Kansas) registered, activated CERT members are eligible for worker's compensation for on-the-job injuries during declared disasters.\n\nMember roles \n\nThe Federal Emergency Management Agency (FEMA) recommends that the standard, ten-person team be comprised as follows:\n* CERT Leader. Generally, the first CERT team member arriving on the scene becomes team leader, and is the designated Incident Commander (IC) until the arrival of someone more competent. This person makes the IC initial assessment of the scene and determines the appropriate course of action for team members; assumes role of Safety Officer until assigned to another team member; assigns team member roles if not already assigned; designates triage area, treatment area, morgue, and vehicle traffic routes; coordinates and directs team operations; determines logistical needs (water, food, medical supplies, transportation, equipment, and so on.) and determines ways to meet those needs through team members or citizen volunteers on the scene; collects and writes reports on the operation and victims; and communicates and coordinates with the incident commander, local authorities, and other CERT team leaders. The team leader is identified by two pieces of crossed tape on the hard hat.\n* Safety Officer. Checks team members prior to deployment to ensure they are safe and equipped for the operation; determines safe or unsafe working environments; ensures team accountability; supervises operations (when possible) where team members and victims are at direct physical risk, and alerts team members when unsafe conditions arise.\n* Fire Suppression Team (2 people). Work under the supervision of the Team Leader to suppress small fires in designated work areas or as needed; when not accomplishing their primary mission, assist the search and rescue team or triage team; assist in evacuation and transport as needed; assist in the triage or treatment area as needed, other duties as assigned; communicate with Team Leader.\n* Search and Rescue Team (2). Work under the supervision of the Team Leader, searching for and providing rescue of victims as is prudent under the conditions; when not accomplishing their primary mission, assist the Fire Suppression Team, assist in the triage or treatment area as needed; other duties as assigned; communicate with Team Leader.\n* Medical Triage Team (2). Work under the supervision of the Team Leader, providing START triage for victims found at the scene; marking victims with category of injury per the standard operating procedures; when not accomplishing their primary mission, assist the Fire Suppression Team if needed, assist the Search and Rescue Team if needed, assist in the Medical Triage Area if needed, assist in the Treatment Area if needed, other duties as assigned; communicate with Team Leader.\n\n* Medical Treatment Team (2). Work under the supervision of the Team Leader, providing medical treatment to victims within the scope of their training. This task is normally accomplished in the Treatment Area, however, it may take place in the affected area as well. When not accomplishing their primary mission, assist the Fire Suppression Team as needed, assist the Medical Triage Team as needed; other duties as assigned; communicate with the Team Leader.\n\nBecause every CERT member in a community receives the same core instruction, any team member has the training necessary to assume any of these roles. This is important during a disaster response because not all members of a regular team may be available to respond. Hasty teams may be formed by whichever members are responding at the time. Additionally, members may need to adjust team roles due to stress, fatigue, injury, or other circumstances.\n\nTraining \n\nWhile state and local jurisdictions will implement training in the manner that best suits the community, the Citizen Corps CERT program has an established curriculum. Jurisdictions may augment the training, but are strongly encouraged to deliver the entire core content. The Citizen Corps CERT core curriculum for the basic course is composed of the following nine units (time is instructional hours):\n* Unit 1: Disaster Preparedness (2.5 hrs). Topics include (in part) identifying local disaster threats, disaster impact, mitigation and preparedness concepts, and an overview of Citizen Corps and CERT. Hands on skills include team-building exercises, and shutting off utilities.\n* Unit 2: Fire Safety (2.5 hrs). Students learn about fire chemistry, mitigation practices, hazardous materials identification, suppression options, and are introduced to the concept of size-up. Hands-on skills include using a fire extinguisher to suppress a live flame, and wearing basic protective gear. Firefighting standpipes as well as unconventional firefighting methods are also covered.\n* Unit 3: Disaster Medical Operations part 1 (2.5 hrs). Students learn to identify and treat certain life-threatening conditions in a disaster setting, as well as START triage. Hands-on skills include performing head-tilt/chin-lift, practicing bleeding control techniques, and performing triage as an exercise.\n* Unit 4: Disaster Medical Operations part 2 (2.5 hrs). Topics cover mass casualty operations, public health, assessing patients, and treating injuries. Students practice patient assessment, and various treatment techniques.\n* Unit 5: Light Search and Rescue Operations (2.5 hrs). Size-up is expanded as students learn about assessing structural damage, marking structures that have been searched, search techniques, as well as rescue techniques and cribbing. Hands-on activities include lifting and cribbing an object, and practicing rescue carries.\n* Unit 6: CERT Organization (1.5 hrs). Students are introduced to several concepts from the Incident Command System, and local team organization and communication is explained. Hands-on skills include a table-top exercise focusing on incident command and control.\n* Unit 7: Disaster Psychology (1 hr). Responder well-being and dealing with victim trauma are the topics of this unit.\n* Unit 8: Terrorism and CERT (2.5 hrs). Students learn how terrorists may choose targets, what weapons they may use, and identifying when chemical, biological, radiological, nuclear, or explosive weapons may have been deployed. Students learn about CERT roles in preparing for and responding to terrorist attacks. A table-top exercise highlights topics covered.\n* Unit 9: Course Review and Disaster Simulation (2.5 hrs). Students take a written exam, then participate in a real-time practical disaster simulation where the different skill areas are put to the test. A critique follows the exercise where students and instructors have an opportunity to learn from mistakes and highlight exemplary actions. Students may be given a certificate of completion at the conclusion of the course.\n\nCitizen Corps CERT training emphasizes safely \"doing the most good for the most people as quickly as possible\" when responding to a disaster. For this reason, cardiopulmonary resuscitation (CPR) training is not included in the core curriculum, as it is time and responder intensive in a mass-casualty incident. However, many jurisdictions encourage or require CERT members to obtain CPR training.  Many CERT programs provide or encourage members to take additional first aid training. Some CERT members may also take training to become a certified first responder or emergency medical technician.\n\nMany CERT programs also provide training in amateur radio operation, shelter operations, flood response, community relations, mass care, the incident command system (ICS), and the National Incident Management System (NIMS).\n\nEach unit of Citizen Corps CERT training is ideally delivered by professional responders or other experts in the field addressed by the unit. This is done to help build unity between CERT members and responders, keep the attention of students, and help the professional response organizations be comfortable with the training which CERT members receive.\n\nEach course of instruction is ideally facilitated by one or more instructors certified in the CERT curriculum by the state or sponsoring agency. Facilitating instructors provide continuity between units, and help ensure that the CERT core curriculum is being delivered successfully. Facilitating instructors also perform set-up and tear-down of the classroom, provide instructional materials for the course, record student attendance and other tasks which assist the professional responder in delivering their unit as efficiently as possible.\n\nCitizen Corps CERT training is provided free to interested members of the community, and is delivered in a group classroom setting. People may complete the training without obligation to join a CERT. Citizen Corps grant funds can be used to print and provide each student with a printed manual. Some sponsoring agencies use Citizen Corps grant funds to purchase disaster response tool kits. These kits are offered as an incentive to join a CERT, and must be returned to the sponsoring agency when members resign from CERT.\n\nSome sponsoring agencies require a criminal background-check of all trainees before allowing them to participate on a CERT. For example, the city of Albuquerque, New Mexico require all volunteers to pass a background check, while the city of Austin, Texas does not require a background check to take part in training classes but requires members to undergo a background check in order to receive a CERT badge and directly assist first responders during an activation of the Emergency Operations Center. However, most programs do not require a criminal background check in order to participate.\n\nThe Citizen Corps CERT curriculum (including the Train-the-Trainer course) was updated during the last half of 2008 to reflect feedback from instructors across the nation. The update is in final review, and is scheduled for release during the first quarter of 2009. Community emergency response team. http://en.wikipedia.org/?curid=7061."
  }
}
