{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4119",
  "eid" : "cb636d20-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778420978,
  "textBody" : "Bock is a strong lager of German origin. Several substyles exist, including maibock (helles bock, heller bock), a paler, more hopped version generally made for consumption at spring festivals; doppelbock (double bock), a stronger and maltier version; and eisbock, a much stronger version made by partially freezing the beer and removing the ice that forms.\n\nOriginally a dark beer, a modern bock can range from light copper to brown in colour. The style is very popular, with many examples brewed internationally.\n\nHistory\n\nThe style known now as bock was a dark, malty, lightly hopped ale first brewed in the 14th century by German brewers in the Hanseatic town of Einbeck. The style from Einbeck was later adopted by Munich brewers in the 17th century and adapted to the new lager style of brewing. Due to their Bavarian accent, citizens of Munich pronounced \"Einbeck\" as \"ein Bock\" (\"a billy goat\"), and thus the beer became known as \"bock\". To this day, as a visual pun, a goat often appears on bock labels.\n\nBock is historically associated with special occasions, often religious festivals such as Christmas, Easter or Lent (the latter as '). Bocks have a long history of being brewed and consumed by Bavarian monks as a source of nutrition during times of fasting.\n\nBockfest, in Cincinnati, Ohio, is the longest running and largest bock beer festival in the world. The festival celebrates bock beer, the Cincinnati neighborhood of Over-the-Rhine, the city's German heritage, and the coming of spring.\n\nStyles of bock\n\nTraditional bock\n\nTraditional bock is a sweet, relatively strong (6.3%–7.2% by volume), lightly hopped (20-27 IBUs) lager. The beer should be clear, and colour can range from light copper to brown, with a bountiful and persistent off-white head. The aroma should be malty and toasty, possibly with hints of alcohol, but no detectable hops or fruitiness. The mouthfeel is smooth, with low to moderate carbonation and no astringency. The taste is rich and toasty, sometimes with a bit of caramel. Again, hop presence is low to undetectable, providing just enough bitterness so that the sweetness is not cloying and the aftertaste is muted. The following commercial products are indicative of the style: Einbecker Ur-Bock Dunkel, Pennsylvania Brewing St. Nick Bock, Aass Bock, Great Lakes Rockefeller Bock, Stegmaier Brewhouse Bock.\n\nMaibock\n\nThe maibock style, also known as helles bock or heller bock, is a helles lager brewed to bock strength; therefore, still as strong as traditional bock, but lighter in colour and with more hop presence. It is a fairly recent development compared to other styles of bock beers, frequently associated with springtime and the month of May. Colour can range from deep gold to light amber with a large, creamy, persistent white head, and moderate to moderately high carbonation, while alcohol content ranges from 6.3% to 7.4% by volume. The flavour is typically less malty than a traditional bock, and may be drier, hoppier, and more bitter, but still with a relatively low hop flavour, with a mild spicy or peppery quality from the hops, increased carbonation and alcohol content. The following commercial products are indicative of the style: Ayinger Maibock, Mahr’s Bock, Hacker-Pschorr Hubertus Bock, Capital Maibock, Einbecker Mai-Urbock, Hofbräu Maibock, Victory St. Boisterous, Gordon Biersch Blonde Bock, Smuttynose Maibock, Old Dominion Brewing Company Big Thaw Bock, [Brewery 85's Quittin' Time], Rogue Dead Guy Ale, Franconia Brewing Company Maibock Ale, Church Street maibock, and Tröegs Cultivator.\n\nDoppelbock\n\nDoppelbock or double bock is a stronger version of traditional bock that was first brewed in Munich by the Paulaner Friars, a Franciscan order founded by St. Francis of Paula. Historically, doppelbock was high in alcohol and sweet, thus serving as \"liquid bread\" for the Friars during times of fasting, when solid food was not permitted. Today, doppelbock is still strong—ranging from 7%–12% or more by volume. It isn't clear, with color ranging from dark gold, for the paler version, to dark brown with ruby highlights for darker version. It has a large, creamy, persistent head (although head retention may be impaired by alcohol in the stronger versions). The aroma is intensely malty, with some toasty notes, and possibly some alcohol presence as well; darker versions may have a chocolate-like or fruity aroma. The flavor is very rich and malty, with toasty notes and noticeable alcoholic strength, and little or no detectable hops (16–26 IBUs). Paler versions may have a drier finish. The monks who originally brewed doppelbock named their beer \"Salvator\" (\"Savior\"), which today is trademarked by Paulaner. Brewers of modern doppelbocks often add \"-ator\" to their beer's name as a signpost of the style; there are 200 \"-ator\" doppelbock names registered with the German patent office. The following are representative examples of the style: Predator, Paulaner Salvator, Ayinger Celebrator, Weihenstephaner Korbinian, Andechser Doppelbock Dunkel, Spaten Optimator, Augustiner Maximator, Tucher Bajuvator, Weltenburger Kloster Asam-Bock, Capital Autumnal Fire, EKU 28, Eggenberg Urbock 23º, Bell's Consecrator, Moretti La Rossa, Samuel Adams Double Bock, Tröegs Tröegenator Double Bock, Wasatch Brewery Devastator, Great Lakes Doppelrock, Abita Andygator, Wolverine State Brewing Company Predator, and Christian Moerlein Emancipator Doppelbock.\n\nEisbock\n\nEisbock is a traditional specialty beer of the Kulmbach district of Germany that is made by partially freezing a doppelbock and removing the water ice to concentrate the flavour and alcohol content, which ranges from 9% to 13% by volume.  It is clear, with a colour ranging from deep copper to dark brown in colour, often with ruby highlights. Although it can pour with a thin off-white head, head retention is frequently impaired by the higher alcohol content. The aroma is intense, with no hop presence, but frequently can contain fruity notes, especially of prunes, raisins, and plums. Mouthfeel is full and smooth, with significant alcohol, although this should not be hot or sharp. The flavour is rich and sweet, often with toasty notes, and sometimes hints of chocolate, always balanced by a significant alcohol presence. The following are representative examples of the style: Kulmbacher Reichelbräu Eisbock, Eggenberg, Schneider Aventinus Eisbock, Urbock Dunkel Eisbock, Franconia Brewing Company Ice Bock 17%.\n\nThe strongest ice-beer is produced by a Franconian company and is called Schorschbräu and is 57% ABV (current world record).\n\nWeizenbock\n\nWeizenbock is a style of bock brewed using wheat instead of barley. It was first produced in Bavaria in 1907 by G. Schneider & Sohn and was named Aventinus after a Bavarian historian. The style combines darker Munich malts and top-fermenting wheat beer yeast, brewed at the strength of a doppelbock.\n\nInternational variations\n\nEurope\n\n;Austria\nIn Austria, bockbier is traditionally brewed only around Christmas and Easter, when nearly every brewery brews its own bock.\n\n;Belgium\nA number of bock beers are produced, including  Brasserie d'Achouffe Bok and \"Leute Bok\" from the Van Steenberge brewer, brewed since 1927.  Belgium-based InBev produces Artois Bock, which is exported internationally and can be found in areas where bock is not traditionally available.\n\n;Bulgaria\nZagorka Brewery produces Stolichno Bock Beer, a 6.5% ABV beer.\n\n;Czech Republic\nOnce a year Budweiser Budvar brew the 7.5% Imperial with Saaz wet/green hops fresh from the farm and matured for 200 days for release in late spring.http://www.budweiserbudvar.co.uk/news/14\n\n;Denmark\n* Stærke Preben from Bryghuset Svaneke in Bornholm, a bock brewed with Münchner and Caramel malt, with 6.9% ABV. Named after a local brewer.\n* Hvid Bock from Fuglsang in Haderslev, with 7.6% ABV.\n\n;Hungary\nDreher Brewery produces a 7.3% ABV bock by the name of Bak, the name for billy goat in Hungarian.\n\n;Iceland\nIn Iceland, Einstök Olgerd brews an Icelandic Dopplebock at 6.7% ABV.\n\n;Netherlands\nA variation of bock called 'bokbier' is brewed extensively in the Netherlands and occasionally in Belgium. Most larger Dutch breweries, such as Heineken International, Grolsch, Amstel, Alfa Brouwerij,  Brand and Dommelsch, market at least one variety. In Holland this style is brewed seasonally by the trappist brewery La Trappe. Most bokbiers tend to be seasonal beers (traditionally, but not exclusively autumn).  Microbreweries may prefer to seasonally brew a bokbier, such as the eco-beer biobok, made in autumn by Brouwerij 't IJ in Amsterdam. The consumers' organization PINT holds a bokbierfestival every autumn at the Beurs van Berlage in Amsterdam.http://www.pintbbf.nl/\n\n;Norway\nBocks are also brewed in Norway, where they are known as \"bokkøl\" (bockbeers) and available during the whole year. Notable examples include Aass, Borg, Frydenlund and Mack.\n\n;Poland\nBocks are also brewed in Poland, where they are known as \"Koźlak\" and available during the whole year. Notable examples include Koźlak Amber, Miłosław Koźlak, Cornelius Kożlak, Perła Kożlak.\n\n;Portugal\nOne of the main beer brands in Portugal is Super Bock.\n\n;Slovenia\nThe country's biggest brewer, Laško Brewery, has produced a double bock named Striptis as part of its 'Special' line, in response to the rising interest in craft beers.\n\n;Spain\nA Spanish brewery Damm produces Bock Damm at 5.4% ABV.\n\n;Sweden\nOnly one Bock beer is brewed in Sweden: Mariestad's Old Ox, with 6.9% ABV.\n\n;United Kingdom\nBock is an unusual style in the UK. The Robert Cains brewery in Liverpool brews Cains Double Bock beer at 8% ABV, and the Dark Star Brewery, West Sussex, produce a 5.6% ABV Maibock.\n\nSouth America\n\n;Argentina\nThere are several beers brewed in Argentina which are termed bock, including Araucana Negra Bock, Quilmes Bock,  and Blest Bock.\n\n;Bolivia\nIn Bolivia, the Cerveceria Boliviana Nacional brews a beer called simply \"Cerveza Bock,\" advertised primarily for its 7% alcohol by volume strength.\n\n;Brazil\nIn Brazil, Kaiser is one of the breweries that sells bock beer, called Kaiser Bock. This beer is available only in the months of fall and winter (April to September). Usually Brazilian bocks are produced by local breweries or craft breweries, especially in the cities of German settlement in Paraná/Santa Catarina States and also in Petrópolis, state of Rio de Janeiro. Kaiser Bock is made in Ponta Grossa, 100 km from Curitiba, capital of Paraná.\n\n;Chile\nKunstmann Brewery from Valdivia produces a dark, bittersweet version of bock.  Kross brewery from Curacavi is producing a maibock (6.5% ABV).http://www.kross.cl/kross-maibock-2/p\n\n;Colombia\nInducerv S.A.S. brews a Bock (6.0% vol) under their Apóstol brand with German ingredients. The brewery is located in the city of Sabaneta, near Medellín.http://www.apostol.com.co/Cervezas/Bock/tabid/128/Default.aspx  \n\nCentral America\n\n; Panama\nCervecería Clandestina brews \"Doppelbock\", with 7.6% ABV, 25 IBU.  It has a Panamanian touch, with cacao from the islands of Bocas del Toro, and coffee from the highlands of Chiriqui.  Is silky, with a brilliant chocolate color.\n\n;Guatemala\nCervecería Centro Americana brews  \"Moza\", a bock beer with 5% ABV.\n\n;Costa Rica\nDomingo 7 brews an Amber Bock called the \"Búho\".\n\nNorth America\n\n;Canada\nBock is a popular style, made by breweries across the country, including:\n\n*Railway City Brewing Company, St.Thomas, Ontario: \"Maple Bock\" a spring seasonal with maple syrup (5.8% ABV)\n*Lake of Bays Brewing Company, Baysville, Ontario: \"Wild North: Midnight Bock\" (5.5% ABV)\n*Microbrasserie de Bellechasse (Pub de la Contrée), Buckland, Quebec: \"St-Nazaire\"\n*Microbrasserie Alchimiste, Joliette, Québec: \"Bock de Joliette\"\n*Grand River Brewery, Cambridge, Ontario: \"Dogstalker April Bock\" (6.0% ABV)\n*Les Trois Mousquetaires, Brossard, Quebec: \"GC Doppelbock\"\n*Les Trois Mousquetaires, Brossard, Quebec: \"SS Maibock\"\n*Mt. Begbie, Revelstoke, British Columbia: \"Bob's Your Dunkel,\" a fall seasonal Weizen Bock\n*Phillips Brewing Company, Victoria, British Columbia: \"Instigator,\" a seasonal doppelbock (8.5% ABV)\n*Creemore Springs Brewery, Creemore, Ontario: \"urBock,\" a Christmas season bock\n*Bushwakkers Brewpub, Regina, Saskatchewan: \"Harbinger Maibock\" and \"Procrastinator Stopelbock\"\n*Barley Days Brewery, Picton, Ontario: \"May Bock\"\n*Tree Brewing Co., British Columbia: Captivator Doppelbock\n*Amsterdam Brewing Co., Toronto, Ontario: Amsterdam Spring Bock\n*Le Saint-Bock, Quebec: Centurion\n*Vancouver Island Brewery, Victoria, British Columbia: \"Hermannator,\" a seasonal eisbock (9.5%)\n*Paddock Wood Brewing Co, Saskatoon, Saskatchewan: \"Mai Bock,\" a seasonal May Bock style (7.3%)\n*Clocktower Brewpub, Ottawa, Ontario: \"Maybock,\" a seasonal May Bock style (5.5%)\n*Half Pints Brewing Company, Winnipeg, Manitoba: \"Isolator Doppelbock\", a winter seasonal doppelbock (8.6%)\n*Fort Garry Brewing Co., Winnipeg, Manitoba: \"Munich,\" a limited production eisbock (9.5%)\n*Propeller Brewing Co., Halifax, Nova Scotia \"Spring Bock,\" a Heller Bock style\n*Big Rock Brewery, Calgary, Alberta: \"Helles Bock\" (6.66% abv)\n*Mill Street Brewery, Toronto, Ontario: \"Doppel Pils\" (6.8% abv)\n*Mill Street Brewery, Toronto, Ontario: \"Helles Bock\" (7.0% abv)\n*Pump House Brewery, Moncton, New Brunswick: \"Doppelbock,\" a seasonal doppelbock (10% abv)\n*Hoyne Brewery, Victoria, British Columbia: \"Big Bock\" (6.5% ABV)\n*Steel & Oak Brewing, New Westminster, British Columbia: \"Smoked Honey Doppelbock\" (7.9% abv)\n*King Brewery, Nobleton, Ontario: \"Spring Bock\" (6.5% ABV)\n*Rurban Brewing, Cornwall, Ontario: Spring Bock (7.2% ABV)\n*Cowbell Brewing, Blyth, Ontario: Black Currant Bock (6.5% ABV)\n*Archibald Microbrasserie, Quebec City, Quebec: Valkyrie (7% ABV)\n\n;Cayman Islands\nCayman Island Brewing (George Town, Cayman Islands): Ironshore Bock (7.5% abv)\n\n;Mexico\nBock beer is produced in Mexico around Christmas season, under the Noche Buena label with 5.9% abv\n\n;United States\nBock and its substyles are popular in all parts of the country. Shiner Bock was first brewed in Texas in 1913 and became a year-round brew in 1973. Coors Brewing Company in Golden, Colorado was well known for its bock beers that it formerly brewed every spring. The city of Cincinnati, Ohio has hosted a celebration called Bockfest since 1992 that promotes its German-style brewing history and the German culture of its Over-the-Rhine neighbourhood. A short list of American bocks include:\n\n*Great Basin Brewing Company (Sparks, Nevada) occasionally produces Rock Mai Bock.\n*Devils Backbone Brewing Company (Lexington, Virginia) produces TURBO Cougar Blond Bock Lager.\n*Sly Fox Brewery (Phoenixville, Pennsylvania) hosts an annual goat race to commemorate its bock fest.\n*Ziegenbock (owned by Anheuser-Busch), is brewed in Houston, Texas.\n*Shiner Bock (owned by Spoetzl Brewery), is brewed in Shiner, Texas.\n*Bowser Brewing Company (Great Falls, Montana) brews an occasional bock.\n*Boulevard Brewing Company, of Kansas City, Missouri produces Boss Tom's Golden Bock, named for Thomas Pendergast who was a prohibition era \"boss\" of Kansas City's political machine.\n*New Belgium Brewing Company, Fort Collins, Colorado/ Asheville, North Carolina: \"Summer Helles\" (Maibock) (5%)\n*Penn Brewery (Pittsburgh, Pennsylvania) produces two versions of St. Nikolaus Bock for the Christmas holidays every year.\n*Samuel Adams (Boston, Massachusetts) annually produces Winter Lager (5.6% ABV) \n*Anheuser Bush brews Amber Bock.\n*Genesee brews Genny Bock.\n\nAfrica\n\n;Namibia\nBock beer is produced and distributed under the Urbock label by Namibian Breweries. Like other Namibian Breweries beers, it is available in some of the neighbouring countries in Southern Africa, especially South Africa. The brewery also produces a maibock sporadically.\n\nOceania\n\n;Australia\n* \"Forefathers Willie Simpson Doppelbock Lager\" by Stone & Wood Brewing Co.\n* \"Hoppy Doppelbock\" (7.5% ABV) brewed in 2016 by 4 Pines Brewing Company in Manly, New South Wales\n* \"Original Bock\" (5.5% ABV) from Balmain Brewing Company in Balmain, New South Wales\n\n;New Zealand\n* \"Smokin' Bishop\", brewed at the Invercargill Brewery\n* \"Doppel-bock\" by Monteith's with 6% ABV",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bock" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4119" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Bock is a strong lager of German origin. Several substyles exist, including maibock (helles bock, heller bock), a paler, more hopped version generally made for consumption at spring festivals; doppelbock (double bock), a stronger and maltier version; and eisbock, a much stronger version made by partially freezing the beer and removing the ice that forms.\n\nOriginally a dark beer, a modern bock can range from light copper to brown in colour. The style is very popular, with many examples brewed internationally.\n\nHistory\n\nThe style known now as bock was a dark, malty, lightly hopped ale first brewed in the 14th century by German brewers in the Hanseatic town of Einbeck. The style from Einbeck was later adopted by Munich brewers in the 17th century and adapted to the new lager style of brewing. Due to their Bavarian accent, citizens of Munich pronounced \"Einbeck\" as \"ein Bock\" (\"a billy goat\"), and thus the beer became known as \"bock\". To this day, as a visual pun, a goat often appears on bock labels.\n\nBock is historically associated with special occasions, often religious festivals such as Christmas, Easter or Lent (the latter as '). Bocks have a long history of being brewed and consumed by Bavarian monks as a source of nutrition during times of fasting.\n\nBockfest, in Cincinnati, Ohio, is the longest running and largest bock beer festival in the world. The festival celebrates bock beer, the Cincinnati neighborhood of Over-the-Rhine, the city's German heritage, and the coming of spring.\n\nStyles of bock\n\nTraditional bock\n\nTraditional bock is a sweet, relatively strong (6.3%–7.2% by volume), lightly hopped (20-27 IBUs) lager. The beer should be clear, and colour can range from light copper to brown, with a bountiful and persistent off-white head. The aroma should be malty and toasty, possibly with hints of alcohol, but no detectable hops or fruitiness. The mouthfeel is smooth, with low to moderate carbonation and no astringency. The taste is rich and toasty, sometimes with a bit of caramel. Again, hop presence is low to undetectable, providing just enough bitterness so that the sweetness is not cloying and the aftertaste is muted. The following commercial products are indicative of the style: Einbecker Ur-Bock Dunkel, Pennsylvania Brewing St. Nick Bock, Aass Bock, Great Lakes Rockefeller Bock, Stegmaier Brewhouse Bock.\n\nMaibock\n\nThe maibock style, also known as helles bock or heller bock, is a helles lager brewed to bock strength; therefore, still as strong as traditional bock, but lighter in colour and with more hop presence. It is a fairly recent development compared to other styles of bock beers, frequently associated with springtime and the month of May. Colour can range from deep gold to light amber with a large, creamy, persistent white head, and moderate to moderately high carbonation, while alcohol content ranges from 6.3% to 7.4% by volume. The flavour is typically less malty than a traditional bock, and may be drier, hoppier, and more bitter, but still with a relatively low hop flavour, with a mild spicy or peppery quality from the hops, increased carbonation and alcohol content. The following commercial products are indicative of the style: Ayinger Maibock, Mahr’s Bock, Hacker-Pschorr Hubertus Bock, Capital Maibock, Einbecker Mai-Urbock, Hofbräu Maibock, Victory St. Boisterous, Gordon Biersch Blonde Bock, Smuttynose Maibock, Old Dominion Brewing Company Big Thaw Bock, [Brewery 85's Quittin' Time], Rogue Dead Guy Ale, Franconia Brewing Company Maibock Ale, Church Street maibock, and Tröegs Cultivator.\n\nDoppelbock\n\nDoppelbock or double bock is a stronger version of traditional bock that was first brewed in Munich by the Paulaner Friars, a Franciscan order founded by St. Francis of Paula. Historically, doppelbock was high in alcohol and sweet, thus serving as \"liquid bread\" for the Friars during times of fasting, when solid food was not permitted. Today, doppelbock is still strong—ranging from 7%–12% or more by volume. It isn't clear, with color ranging from dark gold, for the paler version, to dark brown with ruby highlights for darker version. It has a large, creamy, persistent head (although head retention may be impaired by alcohol in the stronger versions). The aroma is intensely malty, with some toasty notes, and possibly some alcohol presence as well; darker versions may have a chocolate-like or fruity aroma. The flavor is very rich and malty, with toasty notes and noticeable alcoholic strength, and little or no detectable hops (16–26 IBUs). Paler versions may have a drier finish. The monks who originally brewed doppelbock named their beer \"Salvator\" (\"Savior\"), which today is trademarked by Paulaner. Brewers of modern doppelbocks often add \"-ator\" to their beer's name as a signpost of the style; there are 200 \"-ator\" doppelbock names registered with the German patent office. The following are representative examples of the style: Predator, Paulaner Salvator, Ayinger Celebrator, Weihenstephaner Korbinian, Andechser Doppelbock Dunkel, Spaten Optimator, Augustiner Maximator, Tucher Bajuvator, Weltenburger Kloster Asam-Bock, Capital Autumnal Fire, EKU 28, Eggenberg Urbock 23º, Bell's Consecrator, Moretti La Rossa, Samuel Adams Double Bock, Tröegs Tröegenator Double Bock, Wasatch Brewery Devastator, Great Lakes Doppelrock, Abita Andygator, Wolverine State Brewing Company Predator, and Christian Moerlein Emancipator Doppelbock.\n\nEisbock\n\nEisbock is a traditional specialty beer of the Kulmbach district of Germany that is made by partially freezing a doppelbock and removing the water ice to concentrate the flavour and alcohol content, which ranges from 9% to 13% by volume.  It is clear, with a colour ranging from deep copper to dark brown in colour, often with ruby highlights. Although it can pour with a thin off-white head, head retention is frequently impaired by the higher alcohol content. The aroma is intense, with no hop presence, but frequently can contain fruity notes, especially of prunes, raisins, and plums. Mouthfeel is full and smooth, with significant alcohol, although this should not be hot or sharp. The flavour is rich and sweet, often with toasty notes, and sometimes hints of chocolate, always balanced by a significant alcohol presence. The following are representative examples of the style: Kulmbacher Reichelbräu Eisbock, Eggenberg, Schneider Aventinus Eisbock, Urbock Dunkel Eisbock, Franconia Brewing Company Ice Bock 17%.\n\nThe strongest ice-beer is produced by a Franconian company and is called Schorschbräu and is 57% ABV (current world record).\n\nWeizenbock\n\nWeizenbock is a style of bock brewed using wheat instead of barley. It was first produced in Bavaria in 1907 by G. Schneider & Sohn and was named Aventinus after a Bavarian historian. The style combines darker Munich malts and top-fermenting wheat beer yeast, brewed at the strength of a doppelbock.\n\nInternational variations\n\nEurope\n\n;Austria\nIn Austria, bockbier is traditionally brewed only around Christmas and Easter, when nearly every brewery brews its own bock.\n\n;Belgium\nA number of bock beers are produced, including  Brasserie d'Achouffe Bok and \"Leute Bok\" from the Van Steenberge brewer, brewed since 1927.  Belgium-based InBev produces Artois Bock, which is exported internationally and can be found in areas where bock is not traditionally available.\n\n;Bulgaria\nZagorka Brewery produces Stolichno Bock Beer, a 6.5% ABV beer.\n\n;Czech Republic\nOnce a year Budweiser Budvar brew the 7.5% Imperial with Saaz wet/green hops fresh from the farm and matured for 200 days for release in late spring.http://www.budweiserbudvar.co.uk/news/14\n\n;Denmark\n* Stærke Preben from Bryghuset Svaneke in Bornholm, a bock brewed with Münchner and Caramel malt, with 6.9% ABV. Named after a local brewer.\n* Hvid Bock from Fuglsang in Haderslev, with 7.6% ABV.\n\n;Hungary\nDreher Brewery produces a 7.3% ABV bock by the name of Bak, the name for billy goat in Hungarian.\n\n;Iceland\nIn Iceland, Einstök Olgerd brews an Icelandic Dopplebock at 6.7% ABV.\n\n;Netherlands\nA variation of bock called 'bokbier' is brewed extensively in the Netherlands and occasionally in Belgium. Most larger Dutch breweries, such as Heineken International, Grolsch, Amstel, Alfa Brouwerij,  Brand and Dommelsch, market at least one variety. In Holland this style is brewed seasonally by the trappist brewery La Trappe. Most bokbiers tend to be seasonal beers (traditionally, but not exclusively autumn).  Microbreweries may prefer to seasonally brew a bokbier, such as the eco-beer biobok, made in autumn by Brouwerij 't IJ in Amsterdam. The consumers' organization PINT holds a bokbierfestival every autumn at the Beurs van Berlage in Amsterdam.http://www.pintbbf.nl/\n\n;Norway\nBocks are also brewed in Norway, where they are known as \"bokkøl\" (bockbeers) and available during the whole year. Notable examples include Aass, Borg, Frydenlund and Mack.\n\n;Poland\nBocks are also brewed in Poland, where they are known as \"Koźlak\" and available during the whole year. Notable examples include Koźlak Amber, Miłosław Koźlak, Cornelius Kożlak, Perła Kożlak.\n\n;Portugal\nOne of the main beer brands in Portugal is Super Bock.\n\n;Slovenia\nThe country's biggest brewer, Laško Brewery, has produced a double bock named Striptis as part of its 'Special' line, in response to the rising interest in craft beers.\n\n;Spain\nA Spanish brewery Damm produces Bock Damm at 5.4% ABV.\n\n;Sweden\nOnly one Bock beer is brewed in Sweden: Mariestad's Old Ox, with 6.9% ABV.\n\n;United Kingdom\nBock is an unusual style in the UK. The Robert Cains brewery in Liverpool brews Cains Double Bock beer at 8% ABV, and the Dark Star Brewery, West Sussex, produce a 5.6% ABV Maibock.\n\nSouth America\n\n;Argentina\nThere are several beers brewed in Argentina which are termed bock, including Araucana Negra Bock, Quilmes Bock,  and Blest Bock.\n\n;Bolivia\nIn Bolivia, the Cerveceria Boliviana Nacional brews a beer called simply \"Cerveza Bock,\" advertised primarily for its 7% alcohol by volume strength.\n\n;Brazil\nIn Brazil, Kaiser is one of the breweries that sells bock beer, called Kaiser Bock. This beer is available only in the months of fall and winter (April to September). Usually Brazilian bocks are produced by local breweries or craft breweries, especially in the cities of German settlement in Paraná/Santa Catarina States and also in Petrópolis, state of Rio de Janeiro. Kaiser Bock is made in Ponta Grossa, 100 km from Curitiba, capital of Paraná.\n\n;Chile\nKunstmann Brewery from Valdivia produces a dark, bittersweet version of bock.  Kross brewery from Curacavi is producing a maibock (6.5% ABV).http://www.kross.cl/kross-maibock-2/p\n\n;Colombia\nInducerv S.A.S. brews a Bock (6.0% vol) under their Apóstol brand with German ingredients. The brewery is located in the city of Sabaneta, near Medellín.http://www.apostol.com.co/Cervezas/Bock/tabid/128/Default.aspx  \n\nCentral America\n\n; Panama\nCervecería Clandestina brews \"Doppelbock\", with 7.6% ABV, 25 IBU.  It has a Panamanian touch, with cacao from the islands of Bocas del Toro, and coffee from the highlands of Chiriqui.  Is silky, with a brilliant chocolate color.\n\n;Guatemala\nCervecería Centro Americana brews  \"Moza\", a bock beer with 5% ABV.\n\n;Costa Rica\nDomingo 7 brews an Amber Bock called the \"Búho\".\n\nNorth America\n\n;Canada\nBock is a popular style, made by breweries across the country, including:\n\n*Railway City Brewing Company, St.Thomas, Ontario: \"Maple Bock\" a spring seasonal with maple syrup (5.8% ABV)\n*Lake of Bays Brewing Company, Baysville, Ontario: \"Wild North: Midnight Bock\" (5.5% ABV)\n*Microbrasserie de Bellechasse (Pub de la Contrée), Buckland, Quebec: \"St-Nazaire\"\n*Microbrasserie Alchimiste, Joliette, Québec: \"Bock de Joliette\"\n*Grand River Brewery, Cambridge, Ontario: \"Dogstalker April Bock\" (6.0% ABV)\n*Les Trois Mousquetaires, Brossard, Quebec: \"GC Doppelbock\"\n*Les Trois Mousquetaires, Brossard, Quebec: \"SS Maibock\"\n*Mt. Begbie, Revelstoke, British Columbia: \"Bob's Your Dunkel,\" a fall seasonal Weizen Bock\n*Phillips Brewing Company, Victoria, British Columbia: \"Instigator,\" a seasonal doppelbock (8.5% ABV)\n*Creemore Springs Brewery, Creemore, Ontario: \"urBock,\" a Christmas season bock\n*Bushwakkers Brewpub, Regina, Saskatchewan: \"Harbinger Maibock\" and \"Procrastinator Stopelbock\"\n*Barley Days Brewery, Picton, Ontario: \"May Bock\"\n*Tree Brewing Co., British Columbia: Captivator Doppelbock\n*Amsterdam Brewing Co., Toronto, Ontario: Amsterdam Spring Bock\n*Le Saint-Bock, Quebec: Centurion\n*Vancouver Island Brewery, Victoria, British Columbia: \"Hermannator,\" a seasonal eisbock (9.5%)\n*Paddock Wood Brewing Co, Saskatoon, Saskatchewan: \"Mai Bock,\" a seasonal May Bock style (7.3%)\n*Clocktower Brewpub, Ottawa, Ontario: \"Maybock,\" a seasonal May Bock style (5.5%)\n*Half Pints Brewing Company, Winnipeg, Manitoba: \"Isolator Doppelbock\", a winter seasonal doppelbock (8.6%)\n*Fort Garry Brewing Co., Winnipeg, Manitoba: \"Munich,\" a limited production eisbock (9.5%)\n*Propeller Brewing Co., Halifax, Nova Scotia \"Spring Bock,\" a Heller Bock style\n*Big Rock Brewery, Calgary, Alberta: \"Helles Bock\" (6.66% abv)\n*Mill Street Brewery, Toronto, Ontario: \"Doppel Pils\" (6.8% abv)\n*Mill Street Brewery, Toronto, Ontario: \"Helles Bock\" (7.0% abv)\n*Pump House Brewery, Moncton, New Brunswick: \"Doppelbock,\" a seasonal doppelbock (10% abv)\n*Hoyne Brewery, Victoria, British Columbia: \"Big Bock\" (6.5% ABV)\n*Steel & Oak Brewing, New Westminster, British Columbia: \"Smoked Honey Doppelbock\" (7.9% abv)\n*King Brewery, Nobleton, Ontario: \"Spring Bock\" (6.5% ABV)\n*Rurban Brewing, Cornwall, Ontario: Spring Bock (7.2% ABV)\n*Cowbell Brewing, Blyth, Ontario: Black Currant Bock (6.5% ABV)\n*Archibald Microbrasserie, Quebec City, Quebec: Valkyrie (7% ABV)\n\n;Cayman Islands\nCayman Island Brewing (George Town, Cayman Islands): Ironshore Bock (7.5% abv)\n\n;Mexico\nBock beer is produced in Mexico around Christmas season, under the Noche Buena label with 5.9% abv\n\n;United States\nBock and its substyles are popular in all parts of the country. Shiner Bock was first brewed in Texas in 1913 and became a year-round brew in 1973. Coors Brewing Company in Golden, Colorado was well known for its bock beers that it formerly brewed every spring. The city of Cincinnati, Ohio has hosted a celebration called Bockfest since 1992 that promotes its German-style brewing history and the German culture of its Over-the-Rhine neighbourhood. A short list of American bocks include:\n\n*Great Basin Brewing Company (Sparks, Nevada) occasionally produces Rock Mai Bock.\n*Devils Backbone Brewing Company (Lexington, Virginia) produces TURBO Cougar Blond Bock Lager.\n*Sly Fox Brewery (Phoenixville, Pennsylvania) hosts an annual goat race to commemorate its bock fest.\n*Ziegenbock (owned by Anheuser-Busch), is brewed in Houston, Texas.\n*Shiner Bock (owned by Spoetzl Brewery), is brewed in Shiner, Texas.\n*Bowser Brewing Company (Great Falls, Montana) brews an occasional bock.\n*Boulevard Brewing Company, of Kansas City, Missouri produces Boss Tom's Golden Bock, named for Thomas Pendergast who was a prohibition era \"boss\" of Kansas City's political machine.\n*New Belgium Brewing Company, Fort Collins, Colorado/ Asheville, North Carolina: \"Summer Helles\" (Maibock) (5%)\n*Penn Brewery (Pittsburgh, Pennsylvania) produces two versions of St. Nikolaus Bock for the Christmas holidays every year.\n*Samuel Adams (Boston, Massachusetts) annually produces Winter Lager (5.6% ABV) \n*Anheuser Bush brews Amber Bock.\n*Genesee brews Genny Bock.\n\nAfrica\n\n;Namibia\nBock beer is produced and distributed under the Urbock label by Namibian Breweries. Like other Namibian Breweries beers, it is available in some of the neighbouring countries in Southern Africa, especially South Africa. The brewery also produces a maibock sporadically.\n\nOceania\n\n;Australia\n* \"Forefathers Willie Simpson Doppelbock Lager\" by Stone & Wood Brewing Co.\n* \"Hoppy Doppelbock\" (7.5% ABV) brewed in 2016 by 4 Pines Brewing Company in Manly, New South Wales\n* \"Original Bock\" (5.5% ABV) from Balmain Brewing Company in Balmain, New South Wales\n\n;New Zealand\n* \"Smokin' Bishop\", brewed at the Invercargill Brewery\n* \"Doppel-bock\" by Monteith's with 6% ABV. Bock. http://en.wikipedia.org/?curid=4119."
  }
}
