{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3936",
  "eid" : "c9cb19e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778418302,
  "textBody" : "Bastille Day is the common name given in English-speaking countries/lands to the French National Day, which is celebrated on the 14th of July each year. In France, it is formally called  (; The National Celebration) and commonly and legally[http://www.legifrance.gouv.fr/affichCodeArticle.do?idArticleLEGIARTI000006902611&cidTexte\nLEGITEXT000006072050 Article L. 3133-3 of French labor code]   (; the 14th of July).\n\nThe French National Day commemorates the first anniversary of Storming of the Bastille on 14 July 1789, a turning point of the French Revolution, as well as the Fête de la Fédération which celebrated the unity of the French people on 14 July 1790. Celebrations are held throughout France. The oldest and largest regular military parade in Europe is held on the morning of 14 July, on the Champs-Élysées in Paris in front of the President of the Republic, along with other French officials and foreign guests.\n\nHistory\n\nStorming of the Bastille\n\nOn 19 May 1789, Louis XVI invited the Estates-General (') to air their grievances. Of the three estates in France, the deputies of the Third Estate ('), representing the common people, decided to break away from the two others -  the Catholic clergy (', Roman Catholicism being the state religion at that time) and the nobility ('). The Third Estate took the Tennis Court Oath (', 20 June 1789), swearing not to separate until a constitution had been established. They were gradually joined by sympathising delegates of the other estates; Louis XVI started to recognise the validity of their concerns  on 27 June. The assembly renamed itself the National Constituent Assembly (') on 9 July.  \n \nJacques Necker, the finance minister, who was sympathetic to the Third Estate, was dismissed on 11 July. The people of Paris then stormed the Bastille, fearful that they and their representatives would be attacked by the royal army or by foreign regiments of mercenaries in the king's service, and seeking to gain ammunition and gunpowder for the general populace. The Bastille was a fortress-prison in Paris which had often held people jailed on the basis of lettres de cachet (literally \"signet letters\"), arbitrary royal indictments that could not be appealed and did not indicate the reason for the imprisonment. The Bastille held a large cache of ammunition and gunpowder, and was also known for holding political prisoners whose writings had displeased the royal government, and was thus a symbol of the absolutism of the monarchy. As it happened, at the time of the attack in July 1789 there were only seven inmates, none of great political significance.G A Chevallaz, Histoire générale de 1789 à nos jours, p22, publ. Payot, Lausanne 1974\n\nThe crowd was eventually reinforced by mutinous Gardes Françaises (\"French Guards\"), whose usual role was to protect public buildings. They proved a fair match for the fort's defenders, and Governor de Launay, the commander of the Bastille, capitulated and opened the gates to avoid a mutual massacre. However, possibly because of a misunderstanding, fighting resumed. According to the official documents, about 200 attackers and just one defender died in the initial fighting, but in the aftermath, de Launay and seven other defenders were killed, as was Jacques de Flesselles, the prévôt des marchands (\"provost of the merchants\"), the elected head of the city's guilds, who under the feudal monarchy also had the competences of a present-day mayor.J Isaac, L'époque révolutionnaire 1789-1851,p60, publ. Hachette, Paris 1950\n\nShortly after the storming of the Bastille, late in the evening of 4 August, after a very stormy session of the Assemblée Constituante, feudalism was abolished. On 26 August, the Declaration of the Rights of Man and of the Citizen (Déclaration des Droits de l'Homme et du Citoyen) was proclaimed (Homme with an uppercase h meaning “human”, while homme with a lowercase h means “man”).J Isaac, L'époque révolutionnaire 1789-1851, p64, publ. Hachette, Paris 1950\n\nFête de la Fédération\n\nThe ' on 14 July 1790 was a celebration of the unity of the French nation during the French Revolution. The aim of this celebration, one year after the Storming of the Bastille, was to symbolise peace. The event took place on the Champ de Mars, which was at the time far outside Paris. The place had been transformed on a voluntary[http://brouettorama.gregory-haleux.com/2017/09/12/les-journees-des-brouettes-juillet-1790/ brouettorama] (French) basis by the population of Paris, in what was recalled as the ' (\"Wheelbarrow Day\").\n\nA mass was celebrated by Talleyrand, bishop of Autun. The popular General Lafayette, as captain of the National Guard of Paris and a confidant of the king, took his oath to the constitution, followed by King Louis XVI. After the end of the official celebration, the day ended in a huge four-day popular feast and people celebrated with fireworks, as well as fine wine and running nude through the streets in order to display their great freedom.\n\nOrigin of the present celebration\n\nOn 30 June 1878, a feast was officially arranged in Paris to honour the French Republic (the event was commemorated in a painting by Claude Monet). On 14 July 1879, there was another feast, with a semi-official aspect. The day's events included a reception in the Chamber of Deputies, organised and presided over by Léon Gambetta, a military review at Longchamp, and a Republican Feast in the Pré Catelan. All through France, Le Figaro wrote, \"people feasted much to honour the storming of the Bastille\".\n\nOn 21 May 1880, Benjamin Raspail proposed a law to have \"the Republic choose the 14 July as a yearly national holiday\". The Assembly voted in favour of the proposal on 21 May and 8 June. The Senate approved it on 27 and 29 June, favouring 14 July against 4 August (which would have commemorated the end of the feudal system on 4 August 1789). The law was made official on 6 July 1880, and the Ministry of the Interior recommended to Prefects that the day should be \"celebrated with all the brilliance that the local resources allow\". Indeed, the celebrations of the new holiday in 1880 were particularly magnificent.\n\nIn the debate leading up to the adoption of the holiday, Henri Martin, chairman of the French Senate, addressed that chamber on 29 June 1880:\n\nBastille Day Military Parade\n\nThe Bastille Day Military Parade is the French military parade that has been held on the morning of 14 July each year in Paris since 1880. While previously held elsewhere within or near the capital city, since 1918 it has been held on the Champs-Élysées, with the participation of the Allies as represented in the Versailles Peace Conference, and with the exception of the period of German occupation from 1940 to 1944 (when the ceremony took place in London under the command of General Charles de Gaulle).[http://www.garnison-paris.terre.defense.gouv.fr/14juillet2008/les-coulisses/historique-du-defile.htm Défilé du 14 juillet, des origines à nos jours]  (14 July Parade, from its origins to the present) The parade passes down the Champs-Élysées from the Arc de Triomphe to the Place de la Concorde, where the President of the French Republic, his government and foreign ambassadors to France stand. This is a popular event in France, broadcast on French TV, and is the oldest and largest regular military parade in Europe. In some years, invited detachments of foreign troops take part in the parade and foreign statesmen attend as guests.\n\nSmaller military parades are held in French garrison towns, including Toulon and Belfort, with local troops.\n\nBastille Day celebrations in other countries\n\n*Belgium\n**Liège celebrates the Bastille Day each year since the end of the First World War, as Liège was decorated by the Légion d'Honneur for its unexpected resistance during the Battle of Liège.\n*Canada\n** Vancouver BC holds a celebration featuring exhibits, food and entertainment.\n* Czech Republic\n** Since 2008, Prague has hosted a French market \"\" (\"Fourteenth of July Market\") offering traditional French food and wine as well as music. The market takes place on Kampa Island, usually between 11 and 14 July.\n\n* Hungary\n** Budapest's two-day celebration is sponsored by the Institut de France.\n* India\n** Bastille Day is celebrated with great festivity in Pondicherry, a former French colony, every year. On the eve of the Bastille Day, retired soldiers parade and celebrate the day with Indian and French National Anthems. On the day, uniformed war soldiers march through the street to honor the French soldiers who were killed in the battles. One can perceive French and the Indian flag flying alongside that project the mishmash of cultures and heritages.\n* Ireland\n** The Embassy of France in Ireland organizes several events around Dublin, Cork and Limerick for Bastille Day; including evenings of French music and tasting of French food. Many members of the French community in Ireland take part in the festivities.\n*New Zealand\n** The Auckland suburb of Remuera hosts an annual French-themed Bastille Day street festival.\n* South Africa\n** Franschhoek's weekend festival has been celebrated for the last 15 years. (Franschhoek, or 'French Corner,' is situated in the Western Cape.)\n* United Kingdom\n** London has a large French contingent, and celebrates Bastille Day at various locations including Battersea Park, Camden Town and Kentish Town.\n* United States – Over 50 U.S. cities conduct annual celebrations:[http://bastilledaymap.com/ Bastille Day Map] . Interactive Map Bastille Day Locations in the U.S.\n** Baltimore has a large Bastille Day celebration each year at Petit Louis in the Roland Park area of Baltimore City.\n** Boston has a celebration annually, hosted by the French Cultural Center for 40 years.  The street festival occurs in Boston's Back Bay neighborhood, near the Cultural Center's headquarters. The celebration includes francophone musical performers, dancing, and French cuisine.\n** Chicago has hosted a variety of Bastille Day celebrations in a number of locations in the city, including Navy Pier and Oz Park.  The recent incarnations have been sponsored in part by the Chicago branch of the French-American Chamber of Commerce and by the French Consulate-General in Chicago.\n** Dallas's Bastille Day celebration, \"Bastille On Bishop\", began in 2010 and is held annually on 14 July in the Bishop Arts District of the North Oak Cliff neighborhood, southwest of downtown just across the Trinity River.  Dallas' French roots are tied to the short lived socialist Utopian community La Réunion, formed in 1855 and incorporated into the City of Dallas in 1860.\n** Houston has a celebration at La Colombe d'Or Hotel. It is hosted by the Consulate General of France in Houston, The French Alliance, the French-American Chamber of Commerce, and the Texan-French Alliance for the Arts.\n** Milwaukee's four-day street festival begins with a \"Storming of the Bastille\" with a 43-foot replica of the Eiffel Tower.\n**Minneapolis has a celebration in Uptown with wine, French food, pastries, a flea market, circus performers and bands. Also in the Twin Cities area, the local chapter of the Alliance Française has hosted an annual event for years at varying locations with a competition for the \"Best Baguette of the Twin Cities.\"\n**Montgomery, Ohio has a celebration with wine, beer, local restaurants' fare, pastries, games and bands.\n** New Orleans has multiple celebrations, the largest in the historic French Quarter.\n** New York City has numerous Bastille Day celebrations each July, including Bastille Day on 60th Street hosted by the French Institute Alliance Française between Fifth and Lexington Avenues on the Upper East Side of Manhattan, Bastille Day on Smith Street in Brooklyn, and Bastille Day in Tribeca. The Empire State Building is illuminated in blue, white and red.\n** Orlando has a boutique Bastille Day street festival that began in 2009 in the Audubon Park Garden District and involves champagne, wine, music, petanque, artists, and street performers.\n** Philadelphia's Bastille Day, held at Eastern State Penitentiary, involves Marie Antoinette throwing locally manufactured Tastykakes at the Parisian militia, as well as a re-enactment of the storming of the Bastille.[http://www.easternstate.org/bastille-day:: Eastern State Penitentiary Website]\n** Portland, Oregon has celebrated Bastille Day with crowds up to 8,000, in public festivals at various public parks, since 2001. The event is coordinated by the Alliance Française of Portland.\n** Sacramento, California conducts annual \"waiter races\" in the midtown restaurant and shopping district, with a street festival.\n**San Francisco has a large celebration in the city's historic French Quarter in downtown.\n** Seattle's Bastille Day Celebration, held at the Seattle Center, involves performances, picnics, wine and shopping.\n** St. Louis has annual festivals in both the Soulard neighborhood and the former French village of Carondelet, Missouri which include reenactments of the beheading of Marie Antoinette and Louis XVI, as well as reconstructed French fur trading posts. Carondelet also began hosting an annual saloon crawl to celebrate Bastille Day in 2017.\n\nOne-time celebrations\n\n* 1979: A concert with Jean Michel Jarre on the Place de la Concorde in Paris attracted one million people, securing an entry in the Guinness Book of Records for the largest crowd at an outdoor concert.\n* 1989: France celebrated the 200th anniversary of the French Revolution, notably with a monumental show on the Champs-Élysées in Paris, directed by French designer Jean-Paul Goude. President François Mitterrand acted as host for invited world leaders.\n* 1990: A concert with Jarre was held at La Défense near Paris.\n* 1994: The military parade was opened by Eurocorps, a newly created European army unit including German soldiers. This was the first time German troops paraded in France since 1944, as a symbol of Franco-German reconciliation.\n* 1995: A concert with Jarre was held at the Eiffel Tower in Paris.\n* 1998: Two days after the French football team became World Cup champions, huge celebrations took place nationwide.\n* 2004: To commemorate the centenary of the Entente Cordiale, the British led the military parade with the Red Arrows flying overhead.\n* 2007: To commemorate the 50th anniversary of the Treaty of Rome, the military parade was led by troops from the 26 other EU member states, all marching at the French time.\n* 2014: To commemorate the 100th anniversary of the beginning to the First World War, representatives of 80 countries who fought during this conflict were invited to the ceremony. The military parade was opened by 80 flags representing each of these countries.\n* 2017: To commemorate the 100th anniversary of the United States of America's entry into the First World War, French President Emmanuel Macron invited American President Donald Trump to celebrate a centuries-long transatlantic tie between the two countries.\n\nIncidents during Bastille Day\n\n* In 2002, Maxime Brunerie attempted to shoot French President Jacques Chirac during the Champs-Elysées parade.\n* In 2009, Paris youths set fire to more than 300 cars on Bastille Day.\n* In 2016, Mohamed Lahouaiej-Bouhlel drove a truck into crowds during celebrations in the city of Nice. 86 people were killed and 434 injured along the Promenade des Anglais.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Bastille Day" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3936" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Bastille Day is the common name given in English-speaking countries/lands to the French National Day, which is celebrated on the 14th of July each year. In France, it is formally called  (; The National Celebration) and commonly and legally[http://www.legifrance.gouv.fr/affichCodeArticle.do?idArticleLEGIARTI000006902611&cidTexte\nLEGITEXT000006072050 Article L. 3133-3 of French labor code]   (; the 14th of July).\n\nThe French National Day commemorates the first anniversary of Storming of the Bastille on 14 July 1789, a turning point of the French Revolution, as well as the Fête de la Fédération which celebrated the unity of the French people on 14 July 1790. Celebrations are held throughout France. The oldest and largest regular military parade in Europe is held on the morning of 14 July, on the Champs-Élysées in Paris in front of the President of the Republic, along with other French officials and foreign guests.\n\nHistory\n\nStorming of the Bastille\n\nOn 19 May 1789, Louis XVI invited the Estates-General (') to air their grievances. Of the three estates in France, the deputies of the Third Estate ('), representing the common people, decided to break away from the two others -  the Catholic clergy (', Roman Catholicism being the state religion at that time) and the nobility ('). The Third Estate took the Tennis Court Oath (', 20 June 1789), swearing not to separate until a constitution had been established. They were gradually joined by sympathising delegates of the other estates; Louis XVI started to recognise the validity of their concerns  on 27 June. The assembly renamed itself the National Constituent Assembly (') on 9 July.  \n \nJacques Necker, the finance minister, who was sympathetic to the Third Estate, was dismissed on 11 July. The people of Paris then stormed the Bastille, fearful that they and their representatives would be attacked by the royal army or by foreign regiments of mercenaries in the king's service, and seeking to gain ammunition and gunpowder for the general populace. The Bastille was a fortress-prison in Paris which had often held people jailed on the basis of lettres de cachet (literally \"signet letters\"), arbitrary royal indictments that could not be appealed and did not indicate the reason for the imprisonment. The Bastille held a large cache of ammunition and gunpowder, and was also known for holding political prisoners whose writings had displeased the royal government, and was thus a symbol of the absolutism of the monarchy. As it happened, at the time of the attack in July 1789 there were only seven inmates, none of great political significance.G A Chevallaz, Histoire générale de 1789 à nos jours, p22, publ. Payot, Lausanne 1974\n\nThe crowd was eventually reinforced by mutinous Gardes Françaises (\"French Guards\"), whose usual role was to protect public buildings. They proved a fair match for the fort's defenders, and Governor de Launay, the commander of the Bastille, capitulated and opened the gates to avoid a mutual massacre. However, possibly because of a misunderstanding, fighting resumed. According to the official documents, about 200 attackers and just one defender died in the initial fighting, but in the aftermath, de Launay and seven other defenders were killed, as was Jacques de Flesselles, the prévôt des marchands (\"provost of the merchants\"), the elected head of the city's guilds, who under the feudal monarchy also had the competences of a present-day mayor.J Isaac, L'époque révolutionnaire 1789-1851,p60, publ. Hachette, Paris 1950\n\nShortly after the storming of the Bastille, late in the evening of 4 August, after a very stormy session of the Assemblée Constituante, feudalism was abolished. On 26 August, the Declaration of the Rights of Man and of the Citizen (Déclaration des Droits de l'Homme et du Citoyen) was proclaimed (Homme with an uppercase h meaning “human”, while homme with a lowercase h means “man”).J Isaac, L'époque révolutionnaire 1789-1851, p64, publ. Hachette, Paris 1950\n\nFête de la Fédération\n\nThe ' on 14 July 1790 was a celebration of the unity of the French nation during the French Revolution. The aim of this celebration, one year after the Storming of the Bastille, was to symbolise peace. The event took place on the Champ de Mars, which was at the time far outside Paris. The place had been transformed on a voluntary[http://brouettorama.gregory-haleux.com/2017/09/12/les-journees-des-brouettes-juillet-1790/ brouettorama] (French) basis by the population of Paris, in what was recalled as the ' (\"Wheelbarrow Day\").\n\nA mass was celebrated by Talleyrand, bishop of Autun. The popular General Lafayette, as captain of the National Guard of Paris and a confidant of the king, took his oath to the constitution, followed by King Louis XVI. After the end of the official celebration, the day ended in a huge four-day popular feast and people celebrated with fireworks, as well as fine wine and running nude through the streets in order to display their great freedom.\n\nOrigin of the present celebration\n\nOn 30 June 1878, a feast was officially arranged in Paris to honour the French Republic (the event was commemorated in a painting by Claude Monet). On 14 July 1879, there was another feast, with a semi-official aspect. The day's events included a reception in the Chamber of Deputies, organised and presided over by Léon Gambetta, a military review at Longchamp, and a Republican Feast in the Pré Catelan. All through France, Le Figaro wrote, \"people feasted much to honour the storming of the Bastille\".\n\nOn 21 May 1880, Benjamin Raspail proposed a law to have \"the Republic choose the 14 July as a yearly national holiday\". The Assembly voted in favour of the proposal on 21 May and 8 June. The Senate approved it on 27 and 29 June, favouring 14 July against 4 August (which would have commemorated the end of the feudal system on 4 August 1789). The law was made official on 6 July 1880, and the Ministry of the Interior recommended to Prefects that the day should be \"celebrated with all the brilliance that the local resources allow\". Indeed, the celebrations of the new holiday in 1880 were particularly magnificent.\n\nIn the debate leading up to the adoption of the holiday, Henri Martin, chairman of the French Senate, addressed that chamber on 29 June 1880:\n\nBastille Day Military Parade\n\nThe Bastille Day Military Parade is the French military parade that has been held on the morning of 14 July each year in Paris since 1880. While previously held elsewhere within or near the capital city, since 1918 it has been held on the Champs-Élysées, with the participation of the Allies as represented in the Versailles Peace Conference, and with the exception of the period of German occupation from 1940 to 1944 (when the ceremony took place in London under the command of General Charles de Gaulle).[http://www.garnison-paris.terre.defense.gouv.fr/14juillet2008/les-coulisses/historique-du-defile.htm Défilé du 14 juillet, des origines à nos jours]  (14 July Parade, from its origins to the present) The parade passes down the Champs-Élysées from the Arc de Triomphe to the Place de la Concorde, where the President of the French Republic, his government and foreign ambassadors to France stand. This is a popular event in France, broadcast on French TV, and is the oldest and largest regular military parade in Europe. In some years, invited detachments of foreign troops take part in the parade and foreign statesmen attend as guests.\n\nSmaller military parades are held in French garrison towns, including Toulon and Belfort, with local troops.\n\nBastille Day celebrations in other countries\n\n*Belgium\n**Liège celebrates the Bastille Day each year since the end of the First World War, as Liège was decorated by the Légion d'Honneur for its unexpected resistance during the Battle of Liège.\n*Canada\n** Vancouver BC holds a celebration featuring exhibits, food and entertainment.\n* Czech Republic\n** Since 2008, Prague has hosted a French market \"\" (\"Fourteenth of July Market\") offering traditional French food and wine as well as music. The market takes place on Kampa Island, usually between 11 and 14 July.\n\n* Hungary\n** Budapest's two-day celebration is sponsored by the Institut de France.\n* India\n** Bastille Day is celebrated with great festivity in Pondicherry, a former French colony, every year. On the eve of the Bastille Day, retired soldiers parade and celebrate the day with Indian and French National Anthems. On the day, uniformed war soldiers march through the street to honor the French soldiers who were killed in the battles. One can perceive French and the Indian flag flying alongside that project the mishmash of cultures and heritages.\n* Ireland\n** The Embassy of France in Ireland organizes several events around Dublin, Cork and Limerick for Bastille Day; including evenings of French music and tasting of French food. Many members of the French community in Ireland take part in the festivities.\n*New Zealand\n** The Auckland suburb of Remuera hosts an annual French-themed Bastille Day street festival.\n* South Africa\n** Franschhoek's weekend festival has been celebrated for the last 15 years. (Franschhoek, or 'French Corner,' is situated in the Western Cape.)\n* United Kingdom\n** London has a large French contingent, and celebrates Bastille Day at various locations including Battersea Park, Camden Town and Kentish Town.\n* United States – Over 50 U.S. cities conduct annual celebrations:[http://bastilledaymap.com/ Bastille Day Map] . Interactive Map Bastille Day Locations in the U.S.\n** Baltimore has a large Bastille Day celebration each year at Petit Louis in the Roland Park area of Baltimore City.\n** Boston has a celebration annually, hosted by the French Cultural Center for 40 years.  The street festival occurs in Boston's Back Bay neighborhood, near the Cultural Center's headquarters. The celebration includes francophone musical performers, dancing, and French cuisine.\n** Chicago has hosted a variety of Bastille Day celebrations in a number of locations in the city, including Navy Pier and Oz Park.  The recent incarnations have been sponsored in part by the Chicago branch of the French-American Chamber of Commerce and by the French Consulate-General in Chicago.\n** Dallas's Bastille Day celebration, \"Bastille On Bishop\", began in 2010 and is held annually on 14 July in the Bishop Arts District of the North Oak Cliff neighborhood, southwest of downtown just across the Trinity River.  Dallas' French roots are tied to the short lived socialist Utopian community La Réunion, formed in 1855 and incorporated into the City of Dallas in 1860.\n** Houston has a celebration at La Colombe d'Or Hotel. It is hosted by the Consulate General of France in Houston, The French Alliance, the French-American Chamber of Commerce, and the Texan-French Alliance for the Arts.\n** Milwaukee's four-day street festival begins with a \"Storming of the Bastille\" with a 43-foot replica of the Eiffel Tower.\n**Minneapolis has a celebration in Uptown with wine, French food, pastries, a flea market, circus performers and bands. Also in the Twin Cities area, the local chapter of the Alliance Française has hosted an annual event for years at varying locations with a competition for the \"Best Baguette of the Twin Cities.\"\n**Montgomery, Ohio has a celebration with wine, beer, local restaurants' fare, pastries, games and bands.\n** New Orleans has multiple celebrations, the largest in the historic French Quarter.\n** New York City has numerous Bastille Day celebrations each July, including Bastille Day on 60th Street hosted by the French Institute Alliance Française between Fifth and Lexington Avenues on the Upper East Side of Manhattan, Bastille Day on Smith Street in Brooklyn, and Bastille Day in Tribeca. The Empire State Building is illuminated in blue, white and red.\n** Orlando has a boutique Bastille Day street festival that began in 2009 in the Audubon Park Garden District and involves champagne, wine, music, petanque, artists, and street performers.\n** Philadelphia's Bastille Day, held at Eastern State Penitentiary, involves Marie Antoinette throwing locally manufactured Tastykakes at the Parisian militia, as well as a re-enactment of the storming of the Bastille.[http://www.easternstate.org/bastille-day:: Eastern State Penitentiary Website]\n** Portland, Oregon has celebrated Bastille Day with crowds up to 8,000, in public festivals at various public parks, since 2001. The event is coordinated by the Alliance Française of Portland.\n** Sacramento, California conducts annual \"waiter races\" in the midtown restaurant and shopping district, with a street festival.\n**San Francisco has a large celebration in the city's historic French Quarter in downtown.\n** Seattle's Bastille Day Celebration, held at the Seattle Center, involves performances, picnics, wine and shopping.\n** St. Louis has annual festivals in both the Soulard neighborhood and the former French village of Carondelet, Missouri which include reenactments of the beheading of Marie Antoinette and Louis XVI, as well as reconstructed French fur trading posts. Carondelet also began hosting an annual saloon crawl to celebrate Bastille Day in 2017.\n\nOne-time celebrations\n\n* 1979: A concert with Jean Michel Jarre on the Place de la Concorde in Paris attracted one million people, securing an entry in the Guinness Book of Records for the largest crowd at an outdoor concert.\n* 1989: France celebrated the 200th anniversary of the French Revolution, notably with a monumental show on the Champs-Élysées in Paris, directed by French designer Jean-Paul Goude. President François Mitterrand acted as host for invited world leaders.\n* 1990: A concert with Jarre was held at La Défense near Paris.\n* 1994: The military parade was opened by Eurocorps, a newly created European army unit including German soldiers. This was the first time German troops paraded in France since 1944, as a symbol of Franco-German reconciliation.\n* 1995: A concert with Jarre was held at the Eiffel Tower in Paris.\n* 1998: Two days after the French football team became World Cup champions, huge celebrations took place nationwide.\n* 2004: To commemorate the centenary of the Entente Cordiale, the British led the military parade with the Red Arrows flying overhead.\n* 2007: To commemorate the 50th anniversary of the Treaty of Rome, the military parade was led by troops from the 26 other EU member states, all marching at the French time.\n* 2014: To commemorate the 100th anniversary of the beginning to the First World War, representatives of 80 countries who fought during this conflict were invited to the ceremony. The military parade was opened by 80 flags representing each of these countries.\n* 2017: To commemorate the 100th anniversary of the United States of America's entry into the First World War, French President Emmanuel Macron invited American President Donald Trump to celebrate a centuries-long transatlantic tie between the two countries.\n\nIncidents during Bastille Day\n\n* In 2002, Maxime Brunerie attempted to shoot French President Jacques Chirac during the Champs-Elysées parade.\n* In 2009, Paris youths set fire to more than 300 cars on Bastille Day.\n* In 2016, Mohamed Lahouaiej-Bouhlel drove a truck into crowds during celebrations in the city of Nice. 86 people were killed and 434 injured along the Promenade des Anglais. Bastille Day. http://en.wikipedia.org/?curid=3936."
  }
}
