{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8852",
  "eid" : "eb01e8a0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778474026,
  "textBody" : "Events\n\n* 902 – Battle of the Holme: Anglo-Saxon forces are defeated by Danish Vikings under Æthelwold (a son of Æthelred of Wessex) who is killed in battle.\n*1294 – Saint Celestine V resigns the papacy after only five months to return to his previous life as an ascetic hermit.\n*1545 – Council of Trent begins.\n*1577 – Sir Francis Drake sets sail from Plymouth, England, on his round-the-world voyage.\n*1636 – The Massachusetts Bay Colony organizes three militia regiments to defend the colony against the Pequot Indians. This organization is recognized today as the founding of the National Guard of the United States.\n*1642 – Abel Tasman is the first recorded European to sight New Zealand.\n*1643 – English Civil War: The Battle of Alton takes place in Hampshire.\n*1758 – The English transport ship Duke William sinks in the North Atlantic, killing over 360 people.\n*1769 – Dartmouth College is founded by the Reverend Eleazar Wheelock, with a royal charter from King George III, on land donated by Royal governor John Wentworth.\n*1818 – Cyril VI of Constantinople resigns from his position as Ecumenical Patriarch.\n*1862 – American Civil War: At the Battle of Fredericksburg, Confederate General Robert E. Lee defeats Union Major General Ambrose Burnside.\n*1867 – A Fenian bomb explodes in Clerkenwell, London, killing six.\n*1928 – George Gershwin's An American in Paris is first performed.\n*1937 – Second Sino-Japanese War: Battle of Nanking: The city of Nanjing, defended by the National Revolutionary Army under the command of General Tang Shengzhi, falls to the Japanese. This is followed by the Nanking Massacre, in which Japanese troops rape and slaughter hundreds of thousands of civilians.\n*1938 – The Holocaust: The Neuengamme concentration camp opens in the Bergedorf district of Hamburg, Germany.\n*1939 – World War II: Battle of the River Plate: Captain Hans Langsdorff of the German Deutschland-class cruiser (pocket battleship) Admiral Graf Spee engages with Royal Navy cruisers ,  and .\n*1943 – World War II: The Massacre of Kalavryta by German occupying forces in Greece.\n*1949 – The Knesset votes to move the capital of Israel to Jerusalem.\n*1959 – Archbishop Makarios III becomes the first President of Cyprus.\n*1960 – While Emperor Haile Selassie of Ethiopia visits Brazil, his Imperial Bodyguard seizes the capital and proclaims him deposed and his son, Crown Prince Asfa Wossen, Emperor.\n*1962 – NASA launches Relay 1, the first active repeater communications satellite in orbit.\n*1967 – Constantine II of Greece attempts an unsuccessful counter-coup against the Regime of the Colonels.\n*1968 – Brazilian President Artur da Costa e Silva issues AI-5 (Institutional Act No. 5), enabling government by decree and suspending habeas corpus.\n*1972 – Apollo program: Eugene Cernan and Harrison Schmitt begin the third and final extra-vehicular activity (EVA) or \"Moonwalk\" of Apollo 17. To date they are the last humans to set foot on the Moon.\n*1974 – Malta becomes a republic within the Commonwealth of Nations.\n*1977 – Air Indiana Flight 216 crashes near Evansville Regional Airport, killing 29, including the University of Evansville basketball team, support staff, and boosters of the team.\n*1981 – General Wojciech Jaruzelski declares martial law in Poland, largely due to the actions by Solidarity.\n*1982 – The 6.0  North Yemen earthquake shakes southwestern Yemen with a maximum Mercalli intensity of VIII (Severe), killing 2,800, and injuring 1,500.\n*1988 – PLO Chairman Yasser Arafat gives a speech at a UN General Assembly meeting in Geneva, Switzerland, after United States authorities refused to grant him a visa to visit UN headquarters in New York.\n*1989 – The Troubles: Attack on Derryard checkpoint: The Provisional Irish Republican Army launches an attack on a British Army temporary vehicle checkpoint near Rosslea, Northern Ireland. Two British soldiers are killed and two others are wounded.\n*2001 – Sansad Bhavan, the building housing the Indian Parliament, is attacked by terrorists. Twelve people are killed, including the terrorists.\n*2002 – European Union enlargement: The EU announces that Cyprus, the Czech Republic, Estonia, Hungary, Latvia, Lithuania, Malta, Poland, Slovakia, and Slovenia will become members from May 1, 2004.\n*2003 – Iraq War: Operation Red Dawn: Former Iraqi President Saddam Hussein is captured near his home town of Tikrit.\n*2006 – Convention on the Rights of Persons with Disabilities is adopted by United Nations General Assembly.\n*2007 – Treaty of Lisbon is signed by members states of European Union.\n*2011 – A murder–suicide in Liège, Belgium, kills six and wounds 125 people at a Christmas market.\n*2013 – Arapahoe High School shooting: Murder-suicide: A female student seeking the librarian is shot dead in a hallway by another student after the librarian had demoted him on the debate team. The shooter takes his own life shortly afterwards.\n\nBirths\n\n*1272 – King Frederick III of Sicily (d. 1337)\n*1363 – Jean Gerson, chancellor of the University of Paris (d. 1429)\n*1476 – Lucy Brocadelli, Dominican tertiary and stigmatic (d. 1544)\n*1484 – Paul Speratus, German Lutheran (d. 1551)\n*1491 – Martín de Azpilcueta, Spanish theologian and economist (d. 1586)\n*1499 – Justus Menius, German Lutheran pastor (d. 1558)\n*1521 – Pope Sixtus V (d. 1590)\n*1533 – Eric XIV of Sweden (d. 1577)\n*1553 – Henry IV of France (d. 1610)\n*1560 – Maximilien de Béthune, Duke of Sully, 2nd Prime Minister of France (d. 1641)\n*1585 – William Drummond of Hawthornden, Scottish poet (d. 1649)\n*1640 – Robert Plot, English chemist and academic (d. 1696)\n*1662 – Francesco Bianchini, Italian astronomer and philosopher (d. 1729)\n*1678 – Yongzheng Emperor of China (d. 1735)\n*1720 – Carlo Gozzi, Italian playwright (d. 1804)\n*1724 – Franz Aepinus, German astronomer and philosopher (d. 1802)\n*1769 – James Scarlett Abinger, English judge (d. 1844)\n*1780 – Johann Wolfgang Döbereiner, German chemist, invented the Döbereiner's lamp (d. 1849)\n*1784 – Archduke Louis of Austria (d. 1864)\n*1797 – Heinrich Heine, German journalist, poet, and critic (d. 1856)\n*1804 – Joseph Howe, Canadian journalist and politician, 5th Premier of Nova Scotia (d. 1873)\n*1814 – Ana Néri, Brazilian nurse and philanthropist (d. 1880)\n*1816 – Werner von Siemens, German engineer and businessman, founded Siemens (d. 1892)\n*1818 – Mary Todd Lincoln, 16th First Lady of the United States (d. 1882)\n*1830 – Mathilde Fibiger, Danish feminist, novelist and telegraphist (d. 1892)\n*1836 – Franz von Lenbach, German painter and academic (d. 1904)\n*1854 – Herman Bavinck, Dutch philosopher, theologian, and academic (d. 1921)\n*1856 – Svetozar Boroević, Croatian-Austrian field marshal (d. 1920)\n*1860 – Lucien Guitry, French actor (d. 1925)\n*1864 – Emil Seidel, American woodcarver and politician, 36th Mayor of Milwaukee (d. 1947)\n*1867 – Kristian Birkeland, Norwegian physicist and author (d. 1917)\n*1870 – Edward LeSaint, American actor and director (d. 1940)\n*1871 – Emily Carr, Canadian painter and author (d. 1945)\n*1874 – Josef Lhévinne, Russian pianist and educator (d. 1944)\n*1883 – Belle da Costa Greene, American librarian (d. 1950)\n*1884 – Aimilios Veakis, Greek actor, director, and playwright (d. 1951)\n*1885 – Annie Dale Biddle Andrews, American mathematician (d. 1940)\n*1887 – George Pólya, Hungarian-American mathematician and academic (d. 1985)\n*  1887   – Alvin C. York, American colonel, Medal of Honor recipient (d. 1964)\n*1897 – Albert Aalbers, Dutch architect, designed the Savoy Homann Bidakara Hotel (d. 1961)\n*  1897   – Drew Pearson, American journalist and author (d. 1969)\n*1900 – Jonel Perlea, Romanian-American conductor and educator (d. 1970)\n*1901 – Olev Roomet, Estonian singer, violinist, and bagpipe player (d. 1987)\n*1902 – Panagiotis Kanellopoulos, Greek philosopher and politician, 138th Prime Minister of Greece (d. 1986)\n*  1902   – Talcott Parsons, American sociologist and academic (d. 1979)\n*1903 – Ella Baker, American activist (d. 1986)\n*  1903   – Carlos Montoya, Spanish guitarist and composer (d. 1993)\n*1906 – Princess Marina of Greece and Denmark (d. 1968)\n*  1906   – Laurens van der Post, South African-English soldier and author (d. 1996)\n*1908 – Plinio Corrêa de Oliveira, Brazilian historian and activist (d. 1995)\n*  1908   – Van Heflin, American actor (d. 1971)\n*  1908 – Elizabeth Alexander, British geologist, academic, and physicist (d. 1958)\n*1911 – Trygve Haavelmo, Norwegian economist and mathematician, Nobel Prize laureate (d. 1999)\n*  1911   – Kenneth Patchen, American poet and painter (d. 1972)\n*1912 – Luiz Gonzaga, Brazilian singer-songwriter and accordion player (d. 1989)\n*1913 – Arnold Brown, English-Canadian missionary, 11th General of The Salvation Army (d. 2002)\n*1914 – Alan Bullock, English historian and author (d. 2004)\n*  1914   – Larry Noble, English comedian and actor (d. 1993)\n*1915 – B. J. Vorster, South African lawyer and politician, 4th State President of South Africa (d. 1983)\n*1916 – Archie Moore, American boxer (d. 1998)\n*  1916   – Leonard Weisgard, American author and illustrator (d. 2000)\n*1918 – Bill Vukovich, Serbian-American racing driver (d. 1955)\n*1919 – Hans-Joachim Marseille, German captain and pilot (d. 1942)\n*1920 – George P. Shultz, American economist and politician, 60th United States Secretary of State\n*1921 – Turgut Demirağ, Turkish film producer, director and screenwriter (d. 1987)\n*1923 – Philip Warren Anderson, American physicist and academic, Nobel Prize laureate\n*  1923   – Terence Beckett, English businessman (d. 2013)\n*  1923   – Edward Bede Clancy, Australian cardinal (d. 2014)\n*  1923   – Larry Doby, American baseball player and manager (d. 2003)\n*1925 – Dick Van Dyke, American actor, singer, and dancer\n*1926 – Carl Erskine, American major-league baseball player \n*  1926   – George Rhoden, Jamaican runner\n*1927 – James Wright, American poet and academic (d. 1980)\n*1929 – Christopher Plummer, Canadian actor and producer\n*1930 – Robert Prosky, American actor (d. 2008)\n*1933 – Doug Mohns, Canadian-American ice hockey player (d. 2014)\n*1934 – Richard D. Zanuck, American film producer (d. 2012) \n*  1934   – Antoinette Rodez Schiesler, American chemist (d. 1996)\n*1935 – Joe Christopher, Virgin Islander baseball player\n*  1935   – Kenneth Hall, American football player\n*  1935   – Lindy McDaniel, American baseball player\n*  1935   – Türkan Saylan, Turkish physician and academic (d. 2009)\n*  1935   – Arthur Summons, Australian rugby player\n*1936 – Aga Khan IV, Swiss-English businessman\n*  1936   – J. C. Martin, American baseball player and sportscaster\n*1937 – Rob Houwer, Dutch director, producer, and screenwriter\n*  1937   – Ulf G. Lindén, Swedish businessman (d. 2009)\n*1938 – Tom Shaw, American golfer\n*1940 – Sanjaya Lall, Indian economist and academic (d. 2005)\n*1941 – John Davidson, American actor and game show host\n*1942 – Howard Brenton, English playwright and screenwriter\n*  1942   – Anna Eshoo, American lawyer and politician\n*1943 – Ferguson Jenkins, Canadian baseball and basketball player\n*1944 – Hwang Jang-lee, Japanese-South Korean martial artist and actor\n*1945 – Herman Cain, American businessman and political activist \n*  1948   – Jeff Baxter, American guitarist, songwriter, and producer\n*  1948   – Lillian Board, South African-English sprinter (d. 1970)\n*  1948   – Ted Nugent, American singer-songwriter, guitarist, and actor \n*  1948   – Brian Wilson, Scottish journalist and politician, Minister of State for Foreign Affairs\n*1949 – Robert Lindsay, English actor and singer\n*  1949   – R. A. MacAvoy, American computer programmer and author\n*  1949   – Randy Owen, American country music singer-songwriter and guitarist\n*  1949   – Tom Verlaine, American singer-songwriter and guitarist\n*1950 – Linda Bellos, English businesswoman and politician\n*  1950   – Wendie Malick, American actress, model and comedian \n*  1950   – Julia Slingo, English meteorologist and academic\n*  1950   – Tom Vilsack, American lawyer and politician, 30th United States Secretary of Agriculture\n*1952 – Junkyard Dog, American football player and wrestler (d. 1998)\n*  1952   – John Francome, English jockey and sportscaster\n*  1952   – Larry Kenon, American basketball player\n*  1952   – Jean Rouaud, French author\n*1953 – Berton Averre, American guitarist and songwriter\n*  1953   – Ben Bernanke, American economist and academic\n*  1953   – Bill Castro, Dominican baseball player and coach\n*  1953   – Jim Davidson, English comedian, actor, and television host\n*  1953   – Bob Gainey, Canadian ice hockey player, coach, and manager\n*  1953   – Thomas Kurzhals, German keyboard player and songwriter (d. 2014)\n*1954 – John Anderson, American singer-songwriter and guitarist\n*  1954   – Steve Forbert, American singer-songwriter and guitarist\n*  1954   – Harsh Vardhan, Indian otolaryngologist and politician, Indian Minister of Science and Technology\n*1955 – Joseph Mahmoud, Moroccan-French runner\n*1956 – Dale Berra, American baseball player\n*  1956   – Phil Hubbard, American basketball player and coach\n*  1956   – Jean-Marie Messier, French businessman\n*1957 – Steve Buscemi, American actor and director\n*  1957   – Eric Marienthal, American saxophonist \n*1959 – Heino Enden, Estonian basketball player and coach\n*  1959   – Staffan William-Olsson, Swedish guitarist and composer \n*1960 – Richard Dent, American football player\n*1961 – Harry Gregson-Williams, English composer, conductor, and producer\n*  1961   – Irene Sáez, Venezuelan model and politician, Governor of Nueva Esparta\n*  1961   – Gary Zimmerman, American football player\n*1962 – Roger Ilegems, Belgian cyclist\n*  1962   – Jamie Raskin, American lawyer, academic, and politician\n*  1962   – Rex Ryan, American football player and coach\n*  1962   – Rob Ryan, American football player and coach\n*1964 – hide, Japanese singer-songwriter, guitarist, and producer (d. 1998)\n*1966 – Mike Tirico, American sportscaster\n*1967 – Jamie Foxx, American actor, singer, songwriter, producer, and comedian\n*  1967   – Bo Pelini, American football player and coach\n*1969 – Sergei Fedorov, Russian ice hockey player and manager\n*1970 – Tonja Buford-Bailey, American hurdler and coach\n*  1970   – Eoin Jess, Scottish footballer\n*  1970   – Gerlinde Kaltenbrunner, Austrian mountaineer\n*1971 – Naomi Long, Northern Irish engineer and politician, 54th Lord Mayor of Belfast\n*  1971   – Park Jin-young, South Korean singer-songwriter, producer, and record executive\n*  1971   – Scott Sattler, Australian rugby league player and sporstcaster\n*  1971   – Leanne Wood, Welsh academic and politician\n*1972 – Chris Grant, Australian footballer\n*  1972   – James Murdoch, Australian-American businessman, son of Rupert Murdoch\n*1974 – Sara Cox, English broadcaster (television presenter and disc jockey)\n*1975 – Bates Battaglia, American ice hockey player\n*  1975   – Tom DeLonge, American singer-songwriter, guitarist, and producer \n*  1975   – Kostas Kiassos, Greek footballer\n*  1975   – Matthew LeCroy, American baseball player and coach\n*  1975   – Bahar Mert, Turkish volleyball player\n*1976 – Josh Fogg, American baseball player\n*  1976   – Søren Friis, Danish footballer\n*  1976   – Radosław Sobolewski, Polish footballer\n*  1976   – Rama Yade, Senegalese-French politician\n*1977 – Sascha Kindred, German-English swimmer\n*1978 – Kaspars Kambala, Latvian basketball player\n*  1978   – B.J. Penn, American mixed martial artist and wrestler\n*1979 – Matjaž Smodiš, Slovenian basketball player\n*  1979   – Luke Steele, Australian singer-songwriter and musician \n*1980 – Patrik Antonius, Finnish tennis player, coach, and poker player\n*  1980   – Ryan France, English footballer\n*  1980   – Danil Haustov, Estonian swimmer\n*1981 – Amy Lee, American singer-songwriter and pianist\n*  1981   – Mathis Bailey,  American-Canadian novelist and fiction writer\n*1982 – Dan Hamhuis, Canadian ice hockey player\n*  1982   – Ayumi Kinoshita, Japanese actress and model\n*  1982   – Ricky Nolasco, American baseball player\n*  1982   – Tuka Rocha, Brazilian race car driver\n*  1982   – Koutaro Tanaka, Japanese actor\n*  1982   – Dominik Werling, German footballer\n*1983 – Matt Deis, American bass player and songwriter \n*  1983   – Otylia Jędrzejczak, Polish swimmer\n*  1983   – Janeth Jepkosgei, Kenyan runner\n*1984 – Santi Cazorla, Spanish footballer\n*  1984   – Hanna-Maria Seppälä, Finnish swimmer\n*1985 – Michael Bumpus, American football player\n*  1985   – Laurence Leboeuf, Canadian actress\n*  1985   – Alby Mathewson, New Zealand rugby player\n*1986 – Mathieu Gnanligo, Beninese sprinter\n*1988 – Rickie Fowler, American golfer\n*  1988   – Olly Lancashire, English footballer\n*  1988   – James Tamou, New Zealand-Australian rugby league player\n*1989 – Hellen Onsando Obiri, Kenyan runner\n*  1989   – Ben Ridge, Australian rugby league player\n*  1989   – Taylor Swift, American singer-songwriter, guitarist, and actress\n*1991 – Sénah Mango, Togolese footballer\n\nDeaths\n\n* 558 – Childebert I, Frankish king (b. 496)\n* 769 – Du Hongjian, Chinese politician (b. 709)\n* 838 – Pepin I of Aquitaine (b. 797)\n* 859 – Angilbert II, archbishop of Milan\n*1124 – Pope Callixtus II (b. 1065)\n*1126 – Henry IX, Duke of Bavaria (b. 1075)\n*1204 – Maimonides, Spanish rabbi and philosopher (b. 1135)\n*1250 – Frederick II, Holy Roman Emperor (b. 1194)\n*1272 – Bertold of Regensburg, German preacher\n*1404 – Albert I, Duke of Bavaria (b. 1336)\n*1466 – Donatello, Italian painter and sculptor (b. 1386)\n*1516 – Johannes Trithemius, German cryptographer and historian (b. 1462)\n*1521 – Manuel I of Portugal (b. 1469)\n*1557 – Niccolò Fontana Tartaglia, Italian mathematician and engineer (b. 1499)\n*1565 – Conrad Gessner, Swiss botanist and physician (b. 1516)\n*1621 – Katarina Stenbock, queen of Gustav I of Sweden (b. 1535)\n*1671 – Antonio Grassi, Italian Roman Catholic priest(b. 1592)\n*1716 – Charles de La Fosse, French painter (b. 1640)\n*1721 – Alexander Selkirk, Scottish sailor (b. 1676)\n*1729 – Anthony Collins, English philosopher and author (b. 1676)\n*1754 – Mahmud I, Ottoman sultan (b. 1696)\n*1758 – Noël Doiron, Canadian Acadia leader (b. 1684)\n*1769 – Christian Fürchtegott Gellert, German poet and hymn-writer  (b. 1715)\n*1783 – Pehr Wilhelm Wargentin, Swedish astronomer and demographer (b. 1717)\n*1784 – Samuel Johnson, English poet and lexicographer (b. 1709)\n*1814 – Charles-Joseph, 7th Prince of Ligne, Belgian-Austrian field marshal (b. 1735)\n*1837 – Herman of Alaska, Russian missionary and saint (b. 1756)\n*1849 – Johann Centurius Hoffmannsegg, German botanist and entomologist (b. 1766)\n*1862 – Thomas Reade Rootes Cobb, American general, lawyer, and politician (b. 1823)\n*1863 – Christian Friedrich Hebbel, German poet and playwright (b. 1813)\n*1868 – Carl Friedrich Philipp von Martius, German botanist and explorer (b. 1794)\n*1881 – August Šenoa, Croatian author and poet (b. 1838)\n*1883 – Victor de Laprade, French poet and critic (b. 1812)\n*1893 – Georg August Rudolph, German lawyer and politician, 3rd Mayor of Marburg (b. 1816)\n*1895 – Ányos Jedlik, Hungarian physicist and engineer (b. 1800)\n*1908 – Augustus Le Plongeon, French photographer and historian (b. 1825)\n*1919 – Woldemar Voigt, German physicist and academic (b. 1850)\n*1922 – Arthur Wesley Dow, American painter and photographer (b. 1857)\n*  1922   – Hannes Hafstein, Icelandic poet and politician, 1st Prime Minister of Iceland (b. 1861)\n*1924 – Samuel Gompers, English-born American labor leader, founded the American Federation of Labor (b. 1850)\n*1927 – Mehmet Nadir, Turkish mathematician and academic (b. 1856)\n*1930 – Fritz Pregl, Slovenian-Austrian chemist and physician, Nobel Prize laureate (b. 1869)\n*1931 – Gustave Le Bon, French psychologist, sociologist, and anthropologist (b. 1840)\n*1932 – Georgios Jakobides, Greek painter and sculptor (b. 1853)\n*1935 – Victor Grignard, French chemist and academic, Nobel Prize laureate (b. 1871)\n*1942 – Wlodimir Ledóchowski, Austrian-Polish religious leader, 26th Superior-General of the Society of Jesus (b. 1866)\n*  1942   – Robert Robinson Taylor, American architect (b. 1868)\n*1944 – Wassily Kandinsky, Russian-French painter and theorist (b. 1866)\n*  1944   – Lupe Vélez, Mexican actress (b. 1908)\n*1945 – Irma Grese, German concentration camp guard (b. 1923)\n*  1945   – Josef Kramer, German concentration camp commandant (b. 1906)\n*  1945   – Elisabeth Volkenrath, Polish-German concentration camp supervisor (b. 1919)\n*1947 – Henry James, American lawyer and author (b. 1879)\n*  1947   – Nicholas Roerich, Russian archaeologist, painter, and philosopher (b. 1874)\n*1950 – Abraham Wald, Hungarian mathematician and academic (b. 1902)\n*1954 – John Raymond Hubbell, American director and composer (b. 1879)\n*1955 – Egas Moniz, Portuguese psychiatrist and neurosurgeon, Nobel Prize laureate (b. 1874)\n*1960 – Dora Marsden, English author and activist (b. 1882)\n*1961 – Grandma Moses, American painter (b. 1860)\n*1962 – Harry Barris, American singer-songwriter and pianist  (b. 1905)\n*1969 – Raymond A. Spruance, American admiral and diplomat, United States Ambassador to the Philippines (b. 1886)\n*1973 – Henry Green, English author (b. 1905)\n*1974 – Yakup Kadri Karaosmanoğlu, Egyptian-Turkish journalist, author, and politician (b. 1889)\n*1975 – Cyril Delevanti, English-American actor (b. 1889)\n*1977 – Oğuz Atay, Turkish engineer and author (b. 1934)\n*1979 – Jon Hall, American actor and director (b. 1915)\n*  1979   – Behçet Necatigil, Turkish author, poet and translator (b. 1916)\n*1983 – Alexander Schmemann, Estonian-American priest and theologian (b. 1921)\n*  1983   – Nichita Stănescu, Romanian poet and critic (b. 1933)\n*1986 – Heather Angel, British-American actress (b. 1909)\n*  1986   – Ella Baker, American activist (b. 1903)\n*  1986   – Smita Patil, Indian actress and journalist (b. 1955)\n*1992 – K. C. Irving, Canadian businessman (b. 1899)\n*  1992   – Cornelius Vanderbilt Whitney, American businessman and philanthropist (b. 1899)\n*1993 – Vanessa Duriès, French author (b. 1972)\n*1995 – Ann Nolan Clark, American author and educator (b. 1896)\n*1996 – Edward Blishen, English author and educator (b. 1920)\n*1997 – Don E. Fehrenbacher, American historian, author, and academic (b. 1920)\n*2001 – Michael Bradshaw, British-Canadian actor (b. 1933)\n*2001 – Chuck Schuldiner, American singer-songwriter and guitarist (b. 1967)\n*2002 – Zal Yanovsky, Canadian singer-songwriter and guitarist (b. 1944)\n*2003 – Māris Čaklais, Latvian poet and journalist (b. 1940)\n*  2003   – William V. Roth, Jr., American lawyer and politician (b. 1921)\n*2004 – Bernarda Bryson Shahn, American painter and illustrator (b. 1903)\n*  2004   – Andre Rodgers, Bahamian baseball player (b. 1934)\n*  2004   – David Wheeler, English computer scientist and academic (b. 1927)\n*2005 – Stanley Williams, American gang leader, co-founded the Crips (b. 1953)\n*2006 – Lamar Hunt, American businessman, co-founded the American Football League and World Championship Tennis (b. 1932)\n*2007 – Mark Partridge, Rhodesian lawyer and politician (b. 1922)\n*  2007   – Floyd Red Crow Westerman, American actor and activist (b. 1936)\n*2008 – John Drake, New Zealand rugby player and journalist (b. 1959)\n*2010 – James Dibble, Australian journalist (b. 1923)\n*  2010   – Richard Holbrooke, American journalist and diplomat, 22nd United States Ambassador to the United Nations (b. 1941)\n*  2010   – Enrique Morente, Spanish singer-songwriter (b. 1942)\n*2011 – T. J. Bass, American physician and author (b. 1932)\n*  2011   – Kabir Chowdhury, Bangladeshi author and academic (b. 1923)\n*  2011   – Russell Hoban, American author and illustrator (b. 1925)\n*2012 – Ian Black, Scottish footballer (b. 1924)\n*2013 – Marcel Cellier, Swiss organist and producer (b. 1925)\n*  2013   – Vivian Kellogg, American baseball player and manager (b. 1922)\n*  2013   – Kim Kuk-tae, North Korean politician (b. 1924)\n*  2013   – Harvey Littleton, American glass artist and educator (b. 1922)\n*2014 – Ernst Albrecht, German economist and politician, 6th Prime Minister of Lower Saxony (b. 1930)\n*  2014   – William E. May, American theologian and academic (b. 1928)\n*  2014   – Phil Stern, American photographer (b. 1919)\n*  2014   – Taitetsu Unno, Japanese scholar and author (b. 1929)\n*2015 – Benedict Anderson, Chinese-American political scientist and academic (b. 1936)\n*  2015   – John Bannon, Australian academic and politician, 39th Premier of South Australia (b. 1943)\n*  2015   – Peter Ryan, Australian journalist and author (b. 1923)\n*2016 – Thomas Schelling, American economist and educator (b. 1921)\n*  2016   – David Strangway, Canadian geophysicist and university administrator (b. 1934)\n*  2016   – Alan Thicke, Canadian-American actor and composer (b. 1947)\n*2017 – Warrel Dane, American singer (b. 1961)\n\nHolidays and observances\n\n*Acadian Remembrance Day (Acadians)\n* Christian feast day:\n** Antiochus of Sulcis\n** Judoc (Joyce)\n** Lucy, and its related observances:\n***National Day, celebrates the independence of Saint Lucia from United Kingdom in 1979.\n***Saint Lucy's Day (mainly Scandinavia, some regions of Italy (for example, Sicily, Veneto and Trentino), and Malta).\n** Odile of Alsace\n** December 13 (Eastern Orthodox liturgics)\n*Martial Law Victims Remembrance Day (Poland)\n*Nanking Massacre Memorial Day (China)\n*Nusantara Day (Indonesia)\n*Republic Day (Malta)\n*Sailor's Day (Brazil)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "December 13" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8852" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 902 – Battle of the Holme: Anglo-Saxon forces are defeated by Danish Vikings under Æthelwold (a son of Æthelred of Wessex) who is killed in battle.\n*1294 – Saint Celestine V resigns the papacy after only five months to return to his previous life as an ascetic hermit.\n*1545 – Council of Trent begins.\n*1577 – Sir Francis Drake sets sail from Plymouth, England, on his round-the-world voyage.\n*1636 – The Massachusetts Bay Colony organizes three militia regiments to defend the colony against the Pequot Indians. This organization is recognized today as the founding of the National Guard of the United States.\n*1642 – Abel Tasman is the first recorded European to sight New Zealand.\n*1643 – English Civil War: The Battle of Alton takes place in Hampshire.\n*1758 – The English transport ship Duke William sinks in the North Atlantic, killing over 360 people.\n*1769 – Dartmouth College is founded by the Reverend Eleazar Wheelock, with a royal charter from King George III, on land donated by Royal governor John Wentworth.\n*1818 – Cyril VI of Constantinople resigns from his position as Ecumenical Patriarch.\n*1862 – American Civil War: At the Battle of Fredericksburg, Confederate General Robert E. Lee defeats Union Major General Ambrose Burnside.\n*1867 – A Fenian bomb explodes in Clerkenwell, London, killing six.\n*1928 – George Gershwin's An American in Paris is first performed.\n*1937 – Second Sino-Japanese War: Battle of Nanking: The city of Nanjing, defended by the National Revolutionary Army under the command of General Tang Shengzhi, falls to the Japanese. This is followed by the Nanking Massacre, in which Japanese troops rape and slaughter hundreds of thousands of civilians.\n*1938 – The Holocaust: The Neuengamme concentration camp opens in the Bergedorf district of Hamburg, Germany.\n*1939 – World War II: Battle of the River Plate: Captain Hans Langsdorff of the German Deutschland-class cruiser (pocket battleship) Admiral Graf Spee engages with Royal Navy cruisers ,  and .\n*1943 – World War II: The Massacre of Kalavryta by German occupying forces in Greece.\n*1949 – The Knesset votes to move the capital of Israel to Jerusalem.\n*1959 – Archbishop Makarios III becomes the first President of Cyprus.\n*1960 – While Emperor Haile Selassie of Ethiopia visits Brazil, his Imperial Bodyguard seizes the capital and proclaims him deposed and his son, Crown Prince Asfa Wossen, Emperor.\n*1962 – NASA launches Relay 1, the first active repeater communications satellite in orbit.\n*1967 – Constantine II of Greece attempts an unsuccessful counter-coup against the Regime of the Colonels.\n*1968 – Brazilian President Artur da Costa e Silva issues AI-5 (Institutional Act No. 5), enabling government by decree and suspending habeas corpus.\n*1972 – Apollo program: Eugene Cernan and Harrison Schmitt begin the third and final extra-vehicular activity (EVA) or \"Moonwalk\" of Apollo 17. To date they are the last humans to set foot on the Moon.\n*1974 – Malta becomes a republic within the Commonwealth of Nations.\n*1977 – Air Indiana Flight 216 crashes near Evansville Regional Airport, killing 29, including the University of Evansville basketball team, support staff, and boosters of the team.\n*1981 – General Wojciech Jaruzelski declares martial law in Poland, largely due to the actions by Solidarity.\n*1982 – The 6.0  North Yemen earthquake shakes southwestern Yemen with a maximum Mercalli intensity of VIII (Severe), killing 2,800, and injuring 1,500.\n*1988 – PLO Chairman Yasser Arafat gives a speech at a UN General Assembly meeting in Geneva, Switzerland, after United States authorities refused to grant him a visa to visit UN headquarters in New York.\n*1989 – The Troubles: Attack on Derryard checkpoint: The Provisional Irish Republican Army launches an attack on a British Army temporary vehicle checkpoint near Rosslea, Northern Ireland. Two British soldiers are killed and two others are wounded.\n*2001 – Sansad Bhavan, the building housing the Indian Parliament, is attacked by terrorists. Twelve people are killed, including the terrorists.\n*2002 – European Union enlargement: The EU announces that Cyprus, the Czech Republic, Estonia, Hungary, Latvia, Lithuania, Malta, Poland, Slovakia, and Slovenia will become members from May 1, 2004.\n*2003 – Iraq War: Operation Red Dawn: Former Iraqi President Saddam Hussein is captured near his home town of Tikrit.\n*2006 – Convention on the Rights of Persons with Disabilities is adopted by United Nations General Assembly.\n*2007 – Treaty of Lisbon is signed by members states of European Union.\n*2011 – A murder–suicide in Liège, Belgium, kills six and wounds 125 people at a Christmas market.\n*2013 – Arapahoe High School shooting: Murder-suicide: A female student seeking the librarian is shot dead in a hallway by another student after the librarian had demoted him on the debate team. The shooter takes his own life shortly afterwards.\n\nBirths\n\n*1272 – King Frederick III of Sicily (d. 1337)\n*1363 – Jean Gerson, chancellor of the University of Paris (d. 1429)\n*1476 – Lucy Brocadelli, Dominican tertiary and stigmatic (d. 1544)\n*1484 – Paul Speratus, German Lutheran (d. 1551)\n*1491 – Martín de Azpilcueta, Spanish theologian and economist (d. 1586)\n*1499 – Justus Menius, German Lutheran pastor (d. 1558)\n*1521 – Pope Sixtus V (d. 1590)\n*1533 – Eric XIV of Sweden (d. 1577)\n*1553 – Henry IV of France (d. 1610)\n*1560 – Maximilien de Béthune, Duke of Sully, 2nd Prime Minister of France (d. 1641)\n*1585 – William Drummond of Hawthornden, Scottish poet (d. 1649)\n*1640 – Robert Plot, English chemist and academic (d. 1696)\n*1662 – Francesco Bianchini, Italian astronomer and philosopher (d. 1729)\n*1678 – Yongzheng Emperor of China (d. 1735)\n*1720 – Carlo Gozzi, Italian playwright (d. 1804)\n*1724 – Franz Aepinus, German astronomer and philosopher (d. 1802)\n*1769 – James Scarlett Abinger, English judge (d. 1844)\n*1780 – Johann Wolfgang Döbereiner, German chemist, invented the Döbereiner's lamp (d. 1849)\n*1784 – Archduke Louis of Austria (d. 1864)\n*1797 – Heinrich Heine, German journalist, poet, and critic (d. 1856)\n*1804 – Joseph Howe, Canadian journalist and politician, 5th Premier of Nova Scotia (d. 1873)\n*1814 – Ana Néri, Brazilian nurse and philanthropist (d. 1880)\n*1816 – Werner von Siemens, German engineer and businessman, founded Siemens (d. 1892)\n*1818 – Mary Todd Lincoln, 16th First Lady of the United States (d. 1882)\n*1830 – Mathilde Fibiger, Danish feminist, novelist and telegraphist (d. 1892)\n*1836 – Franz von Lenbach, German painter and academic (d. 1904)\n*1854 – Herman Bavinck, Dutch philosopher, theologian, and academic (d. 1921)\n*1856 – Svetozar Boroević, Croatian-Austrian field marshal (d. 1920)\n*1860 – Lucien Guitry, French actor (d. 1925)\n*1864 – Emil Seidel, American woodcarver and politician, 36th Mayor of Milwaukee (d. 1947)\n*1867 – Kristian Birkeland, Norwegian physicist and author (d. 1917)\n*1870 – Edward LeSaint, American actor and director (d. 1940)\n*1871 – Emily Carr, Canadian painter and author (d. 1945)\n*1874 – Josef Lhévinne, Russian pianist and educator (d. 1944)\n*1883 – Belle da Costa Greene, American librarian (d. 1950)\n*1884 – Aimilios Veakis, Greek actor, director, and playwright (d. 1951)\n*1885 – Annie Dale Biddle Andrews, American mathematician (d. 1940)\n*1887 – George Pólya, Hungarian-American mathematician and academic (d. 1985)\n*  1887   – Alvin C. York, American colonel, Medal of Honor recipient (d. 1964)\n*1897 – Albert Aalbers, Dutch architect, designed the Savoy Homann Bidakara Hotel (d. 1961)\n*  1897   – Drew Pearson, American journalist and author (d. 1969)\n*1900 – Jonel Perlea, Romanian-American conductor and educator (d. 1970)\n*1901 – Olev Roomet, Estonian singer, violinist, and bagpipe player (d. 1987)\n*1902 – Panagiotis Kanellopoulos, Greek philosopher and politician, 138th Prime Minister of Greece (d. 1986)\n*  1902   – Talcott Parsons, American sociologist and academic (d. 1979)\n*1903 – Ella Baker, American activist (d. 1986)\n*  1903   – Carlos Montoya, Spanish guitarist and composer (d. 1993)\n*1906 – Princess Marina of Greece and Denmark (d. 1968)\n*  1906   – Laurens van der Post, South African-English soldier and author (d. 1996)\n*1908 – Plinio Corrêa de Oliveira, Brazilian historian and activist (d. 1995)\n*  1908   – Van Heflin, American actor (d. 1971)\n*  1908 – Elizabeth Alexander, British geologist, academic, and physicist (d. 1958)\n*1911 – Trygve Haavelmo, Norwegian economist and mathematician, Nobel Prize laureate (d. 1999)\n*  1911   – Kenneth Patchen, American poet and painter (d. 1972)\n*1912 – Luiz Gonzaga, Brazilian singer-songwriter and accordion player (d. 1989)\n*1913 – Arnold Brown, English-Canadian missionary, 11th General of The Salvation Army (d. 2002)\n*1914 – Alan Bullock, English historian and author (d. 2004)\n*  1914   – Larry Noble, English comedian and actor (d. 1993)\n*1915 – B. J. Vorster, South African lawyer and politician, 4th State President of South Africa (d. 1983)\n*1916 – Archie Moore, American boxer (d. 1998)\n*  1916   – Leonard Weisgard, American author and illustrator (d. 2000)\n*1918 – Bill Vukovich, Serbian-American racing driver (d. 1955)\n*1919 – Hans-Joachim Marseille, German captain and pilot (d. 1942)\n*1920 – George P. Shultz, American economist and politician, 60th United States Secretary of State\n*1921 – Turgut Demirağ, Turkish film producer, director and screenwriter (d. 1987)\n*1923 – Philip Warren Anderson, American physicist and academic, Nobel Prize laureate\n*  1923   – Terence Beckett, English businessman (d. 2013)\n*  1923   – Edward Bede Clancy, Australian cardinal (d. 2014)\n*  1923   – Larry Doby, American baseball player and manager (d. 2003)\n*1925 – Dick Van Dyke, American actor, singer, and dancer\n*1926 – Carl Erskine, American major-league baseball player \n*  1926   – George Rhoden, Jamaican runner\n*1927 – James Wright, American poet and academic (d. 1980)\n*1929 – Christopher Plummer, Canadian actor and producer\n*1930 – Robert Prosky, American actor (d. 2008)\n*1933 – Doug Mohns, Canadian-American ice hockey player (d. 2014)\n*1934 – Richard D. Zanuck, American film producer (d. 2012) \n*  1934   – Antoinette Rodez Schiesler, American chemist (d. 1996)\n*1935 – Joe Christopher, Virgin Islander baseball player\n*  1935   – Kenneth Hall, American football player\n*  1935   – Lindy McDaniel, American baseball player\n*  1935   – Türkan Saylan, Turkish physician and academic (d. 2009)\n*  1935   – Arthur Summons, Australian rugby player\n*1936 – Aga Khan IV, Swiss-English businessman\n*  1936   – J. C. Martin, American baseball player and sportscaster\n*1937 – Rob Houwer, Dutch director, producer, and screenwriter\n*  1937   – Ulf G. Lindén, Swedish businessman (d. 2009)\n*1938 – Tom Shaw, American golfer\n*1940 – Sanjaya Lall, Indian economist and academic (d. 2005)\n*1941 – John Davidson, American actor and game show host\n*1942 – Howard Brenton, English playwright and screenwriter\n*  1942   – Anna Eshoo, American lawyer and politician\n*1943 – Ferguson Jenkins, Canadian baseball and basketball player\n*1944 – Hwang Jang-lee, Japanese-South Korean martial artist and actor\n*1945 – Herman Cain, American businessman and political activist \n*  1948   – Jeff Baxter, American guitarist, songwriter, and producer\n*  1948   – Lillian Board, South African-English sprinter (d. 1970)\n*  1948   – Ted Nugent, American singer-songwriter, guitarist, and actor \n*  1948   – Brian Wilson, Scottish journalist and politician, Minister of State for Foreign Affairs\n*1949 – Robert Lindsay, English actor and singer\n*  1949   – R. A. MacAvoy, American computer programmer and author\n*  1949   – Randy Owen, American country music singer-songwriter and guitarist\n*  1949   – Tom Verlaine, American singer-songwriter and guitarist\n*1950 – Linda Bellos, English businesswoman and politician\n*  1950   – Wendie Malick, American actress, model and comedian \n*  1950   – Julia Slingo, English meteorologist and academic\n*  1950   – Tom Vilsack, American lawyer and politician, 30th United States Secretary of Agriculture\n*1952 – Junkyard Dog, American football player and wrestler (d. 1998)\n*  1952   – John Francome, English jockey and sportscaster\n*  1952   – Larry Kenon, American basketball player\n*  1952   – Jean Rouaud, French author\n*1953 – Berton Averre, American guitarist and songwriter\n*  1953   – Ben Bernanke, American economist and academic\n*  1953   – Bill Castro, Dominican baseball player and coach\n*  1953   – Jim Davidson, English comedian, actor, and television host\n*  1953   – Bob Gainey, Canadian ice hockey player, coach, and manager\n*  1953   – Thomas Kurzhals, German keyboard player and songwriter (d. 2014)\n*1954 – John Anderson, American singer-songwriter and guitarist\n*  1954   – Steve Forbert, American singer-songwriter and guitarist\n*  1954   – Harsh Vardhan, Indian otolaryngologist and politician, Indian Minister of Science and Technology\n*1955 – Joseph Mahmoud, Moroccan-French runner\n*1956 – Dale Berra, American baseball player\n*  1956   – Phil Hubbard, American basketball player and coach\n*  1956   – Jean-Marie Messier, French businessman\n*1957 – Steve Buscemi, American actor and director\n*  1957   – Eric Marienthal, American saxophonist \n*1959 – Heino Enden, Estonian basketball player and coach\n*  1959   – Staffan William-Olsson, Swedish guitarist and composer \n*1960 – Richard Dent, American football player\n*1961 – Harry Gregson-Williams, English composer, conductor, and producer\n*  1961   – Irene Sáez, Venezuelan model and politician, Governor of Nueva Esparta\n*  1961   – Gary Zimmerman, American football player\n*1962 – Roger Ilegems, Belgian cyclist\n*  1962   – Jamie Raskin, American lawyer, academic, and politician\n*  1962   – Rex Ryan, American football player and coach\n*  1962   – Rob Ryan, American football player and coach\n*1964 – hide, Japanese singer-songwriter, guitarist, and producer (d. 1998)\n*1966 – Mike Tirico, American sportscaster\n*1967 – Jamie Foxx, American actor, singer, songwriter, producer, and comedian\n*  1967   – Bo Pelini, American football player and coach\n*1969 – Sergei Fedorov, Russian ice hockey player and manager\n*1970 – Tonja Buford-Bailey, American hurdler and coach\n*  1970   – Eoin Jess, Scottish footballer\n*  1970   – Gerlinde Kaltenbrunner, Austrian mountaineer\n*1971 – Naomi Long, Northern Irish engineer and politician, 54th Lord Mayor of Belfast\n*  1971   – Park Jin-young, South Korean singer-songwriter, producer, and record executive\n*  1971   – Scott Sattler, Australian rugby league player and sporstcaster\n*  1971   – Leanne Wood, Welsh academic and politician\n*1972 – Chris Grant, Australian footballer\n*  1972   – James Murdoch, Australian-American businessman, son of Rupert Murdoch\n*1974 – Sara Cox, English broadcaster (television presenter and disc jockey)\n*1975 – Bates Battaglia, American ice hockey player\n*  1975   – Tom DeLonge, American singer-songwriter, guitarist, and producer \n*  1975   – Kostas Kiassos, Greek footballer\n*  1975   – Matthew LeCroy, American baseball player and coach\n*  1975   – Bahar Mert, Turkish volleyball player\n*1976 – Josh Fogg, American baseball player\n*  1976   – Søren Friis, Danish footballer\n*  1976   – Radosław Sobolewski, Polish footballer\n*  1976   – Rama Yade, Senegalese-French politician\n*1977 – Sascha Kindred, German-English swimmer\n*1978 – Kaspars Kambala, Latvian basketball player\n*  1978   – B.J. Penn, American mixed martial artist and wrestler\n*1979 – Matjaž Smodiš, Slovenian basketball player\n*  1979   – Luke Steele, Australian singer-songwriter and musician \n*1980 – Patrik Antonius, Finnish tennis player, coach, and poker player\n*  1980   – Ryan France, English footballer\n*  1980   – Danil Haustov, Estonian swimmer\n*1981 – Amy Lee, American singer-songwriter and pianist\n*  1981   – Mathis Bailey,  American-Canadian novelist and fiction writer\n*1982 – Dan Hamhuis, Canadian ice hockey player\n*  1982   – Ayumi Kinoshita, Japanese actress and model\n*  1982   – Ricky Nolasco, American baseball player\n*  1982   – Tuka Rocha, Brazilian race car driver\n*  1982   – Koutaro Tanaka, Japanese actor\n*  1982   – Dominik Werling, German footballer\n*1983 – Matt Deis, American bass player and songwriter \n*  1983   – Otylia Jędrzejczak, Polish swimmer\n*  1983   – Janeth Jepkosgei, Kenyan runner\n*1984 – Santi Cazorla, Spanish footballer\n*  1984   – Hanna-Maria Seppälä, Finnish swimmer\n*1985 – Michael Bumpus, American football player\n*  1985   – Laurence Leboeuf, Canadian actress\n*  1985   – Alby Mathewson, New Zealand rugby player\n*1986 – Mathieu Gnanligo, Beninese sprinter\n*1988 – Rickie Fowler, American golfer\n*  1988   – Olly Lancashire, English footballer\n*  1988   – James Tamou, New Zealand-Australian rugby league player\n*1989 – Hellen Onsando Obiri, Kenyan runner\n*  1989   – Ben Ridge, Australian rugby league player\n*  1989   – Taylor Swift, American singer-songwriter, guitarist, and actress\n*1991 – Sénah Mango, Togolese footballer\n\nDeaths\n\n* 558 – Childebert I, Frankish king (b. 496)\n* 769 – Du Hongjian, Chinese politician (b. 709)\n* 838 – Pepin I of Aquitaine (b. 797)\n* 859 – Angilbert II, archbishop of Milan\n*1124 – Pope Callixtus II (b. 1065)\n*1126 – Henry IX, Duke of Bavaria (b. 1075)\n*1204 – Maimonides, Spanish rabbi and philosopher (b. 1135)\n*1250 – Frederick II, Holy Roman Emperor (b. 1194)\n*1272 – Bertold of Regensburg, German preacher\n*1404 – Albert I, Duke of Bavaria (b. 1336)\n*1466 – Donatello, Italian painter and sculptor (b. 1386)\n*1516 – Johannes Trithemius, German cryptographer and historian (b. 1462)\n*1521 – Manuel I of Portugal (b. 1469)\n*1557 – Niccolò Fontana Tartaglia, Italian mathematician and engineer (b. 1499)\n*1565 – Conrad Gessner, Swiss botanist and physician (b. 1516)\n*1621 – Katarina Stenbock, queen of Gustav I of Sweden (b. 1535)\n*1671 – Antonio Grassi, Italian Roman Catholic priest(b. 1592)\n*1716 – Charles de La Fosse, French painter (b. 1640)\n*1721 – Alexander Selkirk, Scottish sailor (b. 1676)\n*1729 – Anthony Collins, English philosopher and author (b. 1676)\n*1754 – Mahmud I, Ottoman sultan (b. 1696)\n*1758 – Noël Doiron, Canadian Acadia leader (b. 1684)\n*1769 – Christian Fürchtegott Gellert, German poet and hymn-writer  (b. 1715)\n*1783 – Pehr Wilhelm Wargentin, Swedish astronomer and demographer (b. 1717)\n*1784 – Samuel Johnson, English poet and lexicographer (b. 1709)\n*1814 – Charles-Joseph, 7th Prince of Ligne, Belgian-Austrian field marshal (b. 1735)\n*1837 – Herman of Alaska, Russian missionary and saint (b. 1756)\n*1849 – Johann Centurius Hoffmannsegg, German botanist and entomologist (b. 1766)\n*1862 – Thomas Reade Rootes Cobb, American general, lawyer, and politician (b. 1823)\n*1863 – Christian Friedrich Hebbel, German poet and playwright (b. 1813)\n*1868 – Carl Friedrich Philipp von Martius, German botanist and explorer (b. 1794)\n*1881 – August Šenoa, Croatian author and poet (b. 1838)\n*1883 – Victor de Laprade, French poet and critic (b. 1812)\n*1893 – Georg August Rudolph, German lawyer and politician, 3rd Mayor of Marburg (b. 1816)\n*1895 – Ányos Jedlik, Hungarian physicist and engineer (b. 1800)\n*1908 – Augustus Le Plongeon, French photographer and historian (b. 1825)\n*1919 – Woldemar Voigt, German physicist and academic (b. 1850)\n*1922 – Arthur Wesley Dow, American painter and photographer (b. 1857)\n*  1922   – Hannes Hafstein, Icelandic poet and politician, 1st Prime Minister of Iceland (b. 1861)\n*1924 – Samuel Gompers, English-born American labor leader, founded the American Federation of Labor (b. 1850)\n*1927 – Mehmet Nadir, Turkish mathematician and academic (b. 1856)\n*1930 – Fritz Pregl, Slovenian-Austrian chemist and physician, Nobel Prize laureate (b. 1869)\n*1931 – Gustave Le Bon, French psychologist, sociologist, and anthropologist (b. 1840)\n*1932 – Georgios Jakobides, Greek painter and sculptor (b. 1853)\n*1935 – Victor Grignard, French chemist and academic, Nobel Prize laureate (b. 1871)\n*1942 – Wlodimir Ledóchowski, Austrian-Polish religious leader, 26th Superior-General of the Society of Jesus (b. 1866)\n*  1942   – Robert Robinson Taylor, American architect (b. 1868)\n*1944 – Wassily Kandinsky, Russian-French painter and theorist (b. 1866)\n*  1944   – Lupe Vélez, Mexican actress (b. 1908)\n*1945 – Irma Grese, German concentration camp guard (b. 1923)\n*  1945   – Josef Kramer, German concentration camp commandant (b. 1906)\n*  1945   – Elisabeth Volkenrath, Polish-German concentration camp supervisor (b. 1919)\n*1947 – Henry James, American lawyer and author (b. 1879)\n*  1947   – Nicholas Roerich, Russian archaeologist, painter, and philosopher (b. 1874)\n*1950 – Abraham Wald, Hungarian mathematician and academic (b. 1902)\n*1954 – John Raymond Hubbell, American director and composer (b. 1879)\n*1955 – Egas Moniz, Portuguese psychiatrist and neurosurgeon, Nobel Prize laureate (b. 1874)\n*1960 – Dora Marsden, English author and activist (b. 1882)\n*1961 – Grandma Moses, American painter (b. 1860)\n*1962 – Harry Barris, American singer-songwriter and pianist  (b. 1905)\n*1969 – Raymond A. Spruance, American admiral and diplomat, United States Ambassador to the Philippines (b. 1886)\n*1973 – Henry Green, English author (b. 1905)\n*1974 – Yakup Kadri Karaosmanoğlu, Egyptian-Turkish journalist, author, and politician (b. 1889)\n*1975 – Cyril Delevanti, English-American actor (b. 1889)\n*1977 – Oğuz Atay, Turkish engineer and author (b. 1934)\n*1979 – Jon Hall, American actor and director (b. 1915)\n*  1979   – Behçet Necatigil, Turkish author, poet and translator (b. 1916)\n*1983 – Alexander Schmemann, Estonian-American priest and theologian (b. 1921)\n*  1983   – Nichita Stănescu, Romanian poet and critic (b. 1933)\n*1986 – Heather Angel, British-American actress (b. 1909)\n*  1986   – Ella Baker, American activist (b. 1903)\n*  1986   – Smita Patil, Indian actress and journalist (b. 1955)\n*1992 – K. C. Irving, Canadian businessman (b. 1899)\n*  1992   – Cornelius Vanderbilt Whitney, American businessman and philanthropist (b. 1899)\n*1993 – Vanessa Duriès, French author (b. 1972)\n*1995 – Ann Nolan Clark, American author and educator (b. 1896)\n*1996 – Edward Blishen, English author and educator (b. 1920)\n*1997 – Don E. Fehrenbacher, American historian, author, and academic (b. 1920)\n*2001 – Michael Bradshaw, British-Canadian actor (b. 1933)\n*2001 – Chuck Schuldiner, American singer-songwriter and guitarist (b. 1967)\n*2002 – Zal Yanovsky, Canadian singer-songwriter and guitarist (b. 1944)\n*2003 – Māris Čaklais, Latvian poet and journalist (b. 1940)\n*  2003   – William V. Roth, Jr., American lawyer and politician (b. 1921)\n*2004 – Bernarda Bryson Shahn, American painter and illustrator (b. 1903)\n*  2004   – Andre Rodgers, Bahamian baseball player (b. 1934)\n*  2004   – David Wheeler, English computer scientist and academic (b. 1927)\n*2005 – Stanley Williams, American gang leader, co-founded the Crips (b. 1953)\n*2006 – Lamar Hunt, American businessman, co-founded the American Football League and World Championship Tennis (b. 1932)\n*2007 – Mark Partridge, Rhodesian lawyer and politician (b. 1922)\n*  2007   – Floyd Red Crow Westerman, American actor and activist (b. 1936)\n*2008 – John Drake, New Zealand rugby player and journalist (b. 1959)\n*2010 – James Dibble, Australian journalist (b. 1923)\n*  2010   – Richard Holbrooke, American journalist and diplomat, 22nd United States Ambassador to the United Nations (b. 1941)\n*  2010   – Enrique Morente, Spanish singer-songwriter (b. 1942)\n*2011 – T. J. Bass, American physician and author (b. 1932)\n*  2011   – Kabir Chowdhury, Bangladeshi author and academic (b. 1923)\n*  2011   – Russell Hoban, American author and illustrator (b. 1925)\n*2012 – Ian Black, Scottish footballer (b. 1924)\n*2013 – Marcel Cellier, Swiss organist and producer (b. 1925)\n*  2013   – Vivian Kellogg, American baseball player and manager (b. 1922)\n*  2013   – Kim Kuk-tae, North Korean politician (b. 1924)\n*  2013   – Harvey Littleton, American glass artist and educator (b. 1922)\n*2014 – Ernst Albrecht, German economist and politician, 6th Prime Minister of Lower Saxony (b. 1930)\n*  2014   – William E. May, American theologian and academic (b. 1928)\n*  2014   – Phil Stern, American photographer (b. 1919)\n*  2014   – Taitetsu Unno, Japanese scholar and author (b. 1929)\n*2015 – Benedict Anderson, Chinese-American political scientist and academic (b. 1936)\n*  2015   – John Bannon, Australian academic and politician, 39th Premier of South Australia (b. 1943)\n*  2015   – Peter Ryan, Australian journalist and author (b. 1923)\n*2016 – Thomas Schelling, American economist and educator (b. 1921)\n*  2016   – David Strangway, Canadian geophysicist and university administrator (b. 1934)\n*  2016   – Alan Thicke, Canadian-American actor and composer (b. 1947)\n*2017 – Warrel Dane, American singer (b. 1961)\n\nHolidays and observances\n\n*Acadian Remembrance Day (Acadians)\n* Christian feast day:\n** Antiochus of Sulcis\n** Judoc (Joyce)\n** Lucy, and its related observances:\n***National Day, celebrates the independence of Saint Lucia from United Kingdom in 1979.\n***Saint Lucy's Day (mainly Scandinavia, some regions of Italy (for example, Sicily, Veneto and Trentino), and Malta).\n** Odile of Alsace\n** December 13 (Eastern Orthodox liturgics)\n*Martial Law Victims Remembrance Day (Poland)\n*Nanking Massacre Memorial Day (China)\n*Nusantara Day (Indonesia)\n*Republic Day (Malta)\n*Sailor's Day (Brazil). December 13. http://en.wikipedia.org/?curid=8852."
  }
}
