{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19242",
  "eid" : "39219a80-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778605096,
  "textBody" : "Located in Eastern Europe, Moldova is bordered on the west and southwest by Romania and on the north, south, and east by Ukraine. Most of its territory lies between the area's two main rivers, the Dniester and the Prut. The Dniester forms a small part of Moldova's border with Ukraine in the northeast and southeast, but it mainly flows through the eastern part of the country, separating Bessarabia and Transnistria. The Prut River forms Moldova's entire western boundary with Romania. The Danube touches the Moldovan border at its southernmost tip, and forms the border for 200 m.\n\nBasic data \n\nClimate \n\nMoldova's proximity to the Black Sea gives it a mild and sunny climate.\n\nMoldova's climate is moderately continental: the summers are warm and long, with temperatures averaging about 20 °C, and the winters are relatively mild and dry, with January temperatures averaging . Annual rainfall, which ranges from around 6 cm in the north to 4 cm in the south, can vary greatly; long dry spells are not unusual. The heaviest rainfall occurs in early summer and again in October; heavy showers and thunderstorms are common. Because of the irregular terrain, heavy summer rains often cause erosion and river silting.\n\nWeather records.\nThe highest temperature ever recorded:  on July 21, 2007 (Camenca).\nThe lowest temperature ever recorded:  on January 20, 1963 (Brătuşeni, Edineţ county).\n\nChişinău's climate. (Central Moldova)\n\nBălţi's climate. (Northern Moldova)\n\nTiraspol's climate. (Central Moldova)\n\nCahul's climate. (Southern Moldova)\n\nTopography \n\nMost of Moldova's territory is a moderate hilly plateau cut deeply by many streams and rivers. Geologically, Moldova lies primarily on deep sedimentary rock that gives way to harder crystalline outcroppings only in the north. Moldova's hills are part of the Moldavian Plateau, which geologically originate from the Carpathian Mountains.\n\nThe northern landscape of Moldova is characterized by gently rolling uplands of the Dniester Hills (up to 300 m, in elevation) interlaced with small flat plains in the valleys of the numerous creeks (at 150 m elevation). These hills, which have an average altitude of 240 m and a maximum altitude of 320 m, can be divided into the Northern Moldavian Hills and the Dniester Ridge, and continue further occupying the northern part of the Chernivtsi oblast in Ukraine. The eastern slopes of the Dniester Ridge (average 250 m, max 347 m), form the high right bank of the Dniester River.\n\nThe Moldavian Plain has an average of 200 m and a maximum altitude of 250 m, and can be divided into the Bălţi Steppe and the Middle Prut Valley. Originally forested, it has been extensively de-forested for agriculture during the 19th and 20th centuries. In contrast to the region to the north and south, which is smore slant, this area is referred to as plain, although it has relief very different from that of a flatland, and vegetation different from that of the steppe.\n\nThe hills of central Moldova, the Central Moldavian Plateau, at an average elevation of about 350 to, are ridges interlaced by deep, flat valleys, ravines, and landslide-scoured depressions. Steep forest-clad slopes account for much of the terrain, where the most common trees are hornbeam, oak, linden, maple, wild pear, and wild cherry. The term Codri refers more generally to all the forests between the Carpathians and the Dniester river, and even more generally to all forests in the area of the Carpathians, yet since in Moldova most of them were preserved in the central part, Codri sometimes can colloquially refer to the remaining forests in the hills west and north of Chişinău. The Dniester Ridge border Central Moldavian Plateau to the north along the river Răut.\n\nThe plateau can be divided into 5 parts: Ciuluc-Soloneţ Hills (), alongated in the north along the right side of the Răut river, 1690 km2, Corneşti Hills (), also known as Cordi Hills (), 4740 km2, Lower Dniester Hills (), alongated to the south of the Botna river, 3040 km2, Tigheci Hills (), alongated in the south along the left side of the Prut river, 3550 km2, and between the latter and the Prut river, the Lower Prut Valley (), 1810 km2.\n\nThe country's highest point, Bălăneşti Hill, which reaches 1407 or, depending on the source, is situated in the Corneşti Hills, the western part of the Central Moldavian Plateau. Northwest of it are the Ciuluc-Soloneţ Hills (average 250 m, max 388 m). In the south, the Tigheci Hills (average 200 m, max 301 m) are a prolongation, and run to the south parallel to the Lower Prut Valley.\n\nTo the south-east, the southern part of the Central Moldavian Plateau, which averages 150 -, max 250 m, and has numerous ravines and gullies, gradually vanishs into the extensive Bugeac Plain, with most of the Budjak region already in Ukraine.\n\nTransnistria (the left bank of the Dniester) has spurs of the Podolian Plateau (, ), (average 180 m, max 275 m), which are cut into by tributaries of the Dniester River. The southern half of Transnistria, the Lower Dniester Plain, can be regarded as the western end of the Eurasian steppe, and has an average elevation of 100 m, with a maximum of 170 m. The high right bank and low left bank of the Dniester are in sharp contrast here, where visibility is not impeded by forests.\n\nAbout 75 percent of Moldova is covered by a soil type called black earth or chernozem. In the northern hills, more clay textured soils are found; in the south, red-earth soil is predominant. The soil becomes less fertile toward the south but can still support grape and sunflower production. The hills have woodland soils, while a small portion in southern Moldova is in the steppe zone, although most steppe areas today are cultivated. The lower reaches of the Prut and Dniester rivers and the southern river valleys are saline marshes.\n\nDrainage in Moldova is to the south, toward the Black Sea lowlands, and eventually into the Black Sea, but only eight rivers and creeks extend more than 100 kilometers. Moldova's main river, the Dniester, is navigable throughout almost the entire country, and in warmer winters it does not freeze over. The Prut river is a tributary of the Danube, which it joins at the far southwestern tip of the country. Over 95% of the water circulation in Moldova flows into one of the two rivers - the Prut or Dniester. Of Moldova's well-developed network of about 3,000 creeks and streams, all draining south to the Black Sea, only 246 exceed 6 mi in length, and only 8 exceed 60 mi.\n\nUnderground water, extensively used for the country's water supply, includes about 2,200 natural springs. The terrain favours construction of reservoirs of various size.\n\nExtreme points \n\n* The lowest point: An unnamed point on the bank of the Dniester River \n* The highest point: Dealul Bălăneşti \n* North extreme: Naslavcea\n* South extreme: Giurgiuleşti\n* West extreme: Criva\n* East extreme: Palanca\n \nNatural habitat \n\nMoldova's natural habitat is characterized by forest steppes, a temperate-climate habitat type composed of grassland interspersed with areas of woodland or forest. A belt of forest steppes cross Eurasia from eastern Europe to Eastern Siberia, forming a transition between temperate broadleaf and mixed forests and temperate grasslands. In the 19th century Moldova witnessed a sharp decrease in the forested areas, sacrificed for agriculture due to rich soil.\n\nEnvironment \n\nHistorical references\n\n* In the 5th century BC, Herodotus visited the countryside between the rivers Dnister and Prut and described the place as \"a plain with deep black earth, rich in grass and well irrigated\".\n* Lithuanian Prince Jogaila spoke of Moldavia as \"a rich and fructiferous country\".\n* According to the testimony of Venetian Mateus de Murano, \"the country was very well located, reach with cattle and all kinds of fruits, pastures are perfect\".\n* Rich natural resources of Moldavia always attracted nomads. Fleeing their devastating incursions, inhabitants of Moldavia left the brooded places and hid in forests. French knight Guilbert de Lannoy, who visited these places in 1421, has mentioned insignificant population of the region: \"we moved through large deserts\".\n* Counsellor of Hungarian King George Reihersdorf (middle of 16th century) was complaining of travel through \"empty, uninhabited lands\". In 1541, he produced the first geographical map (preserved to this day) of the Principality of Moldavia, with rivers Dnister and Prut shown, as well as cities and other localities, but also highlighted large steppes.\n* A map of Moldavia was drawn by the German diplomat Sigismund von Herberstein. On his map one can see woodless spaces - Bălţi steppe in the north, and Bugeac Steppe in the south.\n* In the 17th century, pilgrims Pavel Aleppskii (a Syrian deacon) and Ioan Lukianov (a Russian preast) traveled on their way to the Holy land through Moldavia. These two travellers were struck by the disastrous state of the land that used to blossom: \"It better be not ravaged, as no other such can be found, it may yield any kind\".\n* English traveller John Bell, who also visited Moldavia, and wrote about fecund soils and \"small nice towns\" situated next to Răut.\n* Russian geographer K. Laksman described Bălţi steppe in the beginning of the 19th century: \"To the north is located a steppe with almost no trees at all. To the north-west the steppe is not as woodless\".\n* Scientist K. Arseniev mentioned that the north of Bessarabia is \"a genuine mix of arid steppes with most fertile pastures, rich meadows and gardens\".\n* Travelers and scholars were amazed by the contrast between rich natural resources of Moldavia/Bălţi steppe and its low population in war torned 18th century, pitiful state of agriculture, as well as the poverty of the local population.\n* \"Desert, waste, naked steppe... The settling among limitless expanses of Bălţi steppe happened not \"in accordnace\" with logic, but \"against\" it. The life of remote ancestors of Bălţiers was full of difficulties and crosses, but they managed to resist.\"\n* \"Moldavian fields, as described by both ancient and contemporary writers, are great in their fertility, by far surpassing the richness of the mountains\" (Dimitrie Cantemir, Descriptio Moldaviae)\n* \"Will someone describe Bessarabian steppes, indeed, they do merit a description. However for this, one needs the talent of unforgettable Gogol, who has so beautifully depicted us the steppes of his homeland. And Bessarabian steppes are not less beautiful.\" (Constantin Stamati-Ciurea)\n\nCurrent issues \n\nMoldova's communist-era environmental legacy, like that of many other former Soviet republics, is one of environmental degradation. Agricultural practices such as overuse of pesticides and artificial fertilizers were intended to increase agricultural output at all costs, without regard for the consequences. As a result, Moldova's soil and groundwater were contaminated by lingering chemicals, some of which (including DDT) have been banned in the West.\n\nSuch practices continue in Moldova to the present day.  In the early 1990s, use of pesticides in Moldova averaged approximately twenty times that of other former Soviet republics and Western nations. In addition, poor farming methods, such as destroying forests to plant vineyards, have contributed to the extensive soil erosion to which the country's rugged topography is already prone.\n\nInternational environmental agreements \n\nparty to:\nAir Pollution, Air Pollution-Persistent Organic Pollutants, Biodiversity, Climate Change, Climate Change-Kyoto Protocol, Desertification, Endangered Species, Hazardous Wastes, Ozone Layer Protection, Ship Pollution, Wetlands\n\nsigned, but not ratified: none of the selected agreements",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Geography of Moldova" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19242" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Located in Eastern Europe, Moldova is bordered on the west and southwest by Romania and on the north, south, and east by Ukraine. Most of its territory lies between the area's two main rivers, the Dniester and the Prut. The Dniester forms a small part of Moldova's border with Ukraine in the northeast and southeast, but it mainly flows through the eastern part of the country, separating Bessarabia and Transnistria. The Prut River forms Moldova's entire western boundary with Romania. The Danube touches the Moldovan border at its southernmost tip, and forms the border for 200 m.\n\nBasic data \n\nClimate \n\nMoldova's proximity to the Black Sea gives it a mild and sunny climate.\n\nMoldova's climate is moderately continental: the summers are warm and long, with temperatures averaging about 20 °C, and the winters are relatively mild and dry, with January temperatures averaging . Annual rainfall, which ranges from around 6 cm in the north to 4 cm in the south, can vary greatly; long dry spells are not unusual. The heaviest rainfall occurs in early summer and again in October; heavy showers and thunderstorms are common. Because of the irregular terrain, heavy summer rains often cause erosion and river silting.\n\nWeather records.\nThe highest temperature ever recorded:  on July 21, 2007 (Camenca).\nThe lowest temperature ever recorded:  on January 20, 1963 (Brătuşeni, Edineţ county).\n\nChişinău's climate. (Central Moldova)\n\nBălţi's climate. (Northern Moldova)\n\nTiraspol's climate. (Central Moldova)\n\nCahul's climate. (Southern Moldova)\n\nTopography \n\nMost of Moldova's territory is a moderate hilly plateau cut deeply by many streams and rivers. Geologically, Moldova lies primarily on deep sedimentary rock that gives way to harder crystalline outcroppings only in the north. Moldova's hills are part of the Moldavian Plateau, which geologically originate from the Carpathian Mountains.\n\nThe northern landscape of Moldova is characterized by gently rolling uplands of the Dniester Hills (up to 300 m, in elevation) interlaced with small flat plains in the valleys of the numerous creeks (at 150 m elevation). These hills, which have an average altitude of 240 m and a maximum altitude of 320 m, can be divided into the Northern Moldavian Hills and the Dniester Ridge, and continue further occupying the northern part of the Chernivtsi oblast in Ukraine. The eastern slopes of the Dniester Ridge (average 250 m, max 347 m), form the high right bank of the Dniester River.\n\nThe Moldavian Plain has an average of 200 m and a maximum altitude of 250 m, and can be divided into the Bălţi Steppe and the Middle Prut Valley. Originally forested, it has been extensively de-forested for agriculture during the 19th and 20th centuries. In contrast to the region to the north and south, which is smore slant, this area is referred to as plain, although it has relief very different from that of a flatland, and vegetation different from that of the steppe.\n\nThe hills of central Moldova, the Central Moldavian Plateau, at an average elevation of about 350 to, are ridges interlaced by deep, flat valleys, ravines, and landslide-scoured depressions. Steep forest-clad slopes account for much of the terrain, where the most common trees are hornbeam, oak, linden, maple, wild pear, and wild cherry. The term Codri refers more generally to all the forests between the Carpathians and the Dniester river, and even more generally to all forests in the area of the Carpathians, yet since in Moldova most of them were preserved in the central part, Codri sometimes can colloquially refer to the remaining forests in the hills west and north of Chişinău. The Dniester Ridge border Central Moldavian Plateau to the north along the river Răut.\n\nThe plateau can be divided into 5 parts: Ciuluc-Soloneţ Hills (), alongated in the north along the right side of the Răut river, 1690 km2, Corneşti Hills (), also known as Cordi Hills (), 4740 km2, Lower Dniester Hills (), alongated to the south of the Botna river, 3040 km2, Tigheci Hills (), alongated in the south along the left side of the Prut river, 3550 km2, and between the latter and the Prut river, the Lower Prut Valley (), 1810 km2.\n\nThe country's highest point, Bălăneşti Hill, which reaches 1407 or, depending on the source, is situated in the Corneşti Hills, the western part of the Central Moldavian Plateau. Northwest of it are the Ciuluc-Soloneţ Hills (average 250 m, max 388 m). In the south, the Tigheci Hills (average 200 m, max 301 m) are a prolongation, and run to the south parallel to the Lower Prut Valley.\n\nTo the south-east, the southern part of the Central Moldavian Plateau, which averages 150 -, max 250 m, and has numerous ravines and gullies, gradually vanishs into the extensive Bugeac Plain, with most of the Budjak region already in Ukraine.\n\nTransnistria (the left bank of the Dniester) has spurs of the Podolian Plateau (, ), (average 180 m, max 275 m), which are cut into by tributaries of the Dniester River. The southern half of Transnistria, the Lower Dniester Plain, can be regarded as the western end of the Eurasian steppe, and has an average elevation of 100 m, with a maximum of 170 m. The high right bank and low left bank of the Dniester are in sharp contrast here, where visibility is not impeded by forests.\n\nAbout 75 percent of Moldova is covered by a soil type called black earth or chernozem. In the northern hills, more clay textured soils are found; in the south, red-earth soil is predominant. The soil becomes less fertile toward the south but can still support grape and sunflower production. The hills have woodland soils, while a small portion in southern Moldova is in the steppe zone, although most steppe areas today are cultivated. The lower reaches of the Prut and Dniester rivers and the southern river valleys are saline marshes.\n\nDrainage in Moldova is to the south, toward the Black Sea lowlands, and eventually into the Black Sea, but only eight rivers and creeks extend more than 100 kilometers. Moldova's main river, the Dniester, is navigable throughout almost the entire country, and in warmer winters it does not freeze over. The Prut river is a tributary of the Danube, which it joins at the far southwestern tip of the country. Over 95% of the water circulation in Moldova flows into one of the two rivers - the Prut or Dniester. Of Moldova's well-developed network of about 3,000 creeks and streams, all draining south to the Black Sea, only 246 exceed 6 mi in length, and only 8 exceed 60 mi.\n\nUnderground water, extensively used for the country's water supply, includes about 2,200 natural springs. The terrain favours construction of reservoirs of various size.\n\nExtreme points \n\n* The lowest point: An unnamed point on the bank of the Dniester River \n* The highest point: Dealul Bălăneşti \n* North extreme: Naslavcea\n* South extreme: Giurgiuleşti\n* West extreme: Criva\n* East extreme: Palanca\n \nNatural habitat \n\nMoldova's natural habitat is characterized by forest steppes, a temperate-climate habitat type composed of grassland interspersed with areas of woodland or forest. A belt of forest steppes cross Eurasia from eastern Europe to Eastern Siberia, forming a transition between temperate broadleaf and mixed forests and temperate grasslands. In the 19th century Moldova witnessed a sharp decrease in the forested areas, sacrificed for agriculture due to rich soil.\n\nEnvironment \n\nHistorical references\n\n* In the 5th century BC, Herodotus visited the countryside between the rivers Dnister and Prut and described the place as \"a plain with deep black earth, rich in grass and well irrigated\".\n* Lithuanian Prince Jogaila spoke of Moldavia as \"a rich and fructiferous country\".\n* According to the testimony of Venetian Mateus de Murano, \"the country was very well located, reach with cattle and all kinds of fruits, pastures are perfect\".\n* Rich natural resources of Moldavia always attracted nomads. Fleeing their devastating incursions, inhabitants of Moldavia left the brooded places and hid in forests. French knight Guilbert de Lannoy, who visited these places in 1421, has mentioned insignificant population of the region: \"we moved through large deserts\".\n* Counsellor of Hungarian King George Reihersdorf (middle of 16th century) was complaining of travel through \"empty, uninhabited lands\". In 1541, he produced the first geographical map (preserved to this day) of the Principality of Moldavia, with rivers Dnister and Prut shown, as well as cities and other localities, but also highlighted large steppes.\n* A map of Moldavia was drawn by the German diplomat Sigismund von Herberstein. On his map one can see woodless spaces - Bălţi steppe in the north, and Bugeac Steppe in the south.\n* In the 17th century, pilgrims Pavel Aleppskii (a Syrian deacon) and Ioan Lukianov (a Russian preast) traveled on their way to the Holy land through Moldavia. These two travellers were struck by the disastrous state of the land that used to blossom: \"It better be not ravaged, as no other such can be found, it may yield any kind\".\n* English traveller John Bell, who also visited Moldavia, and wrote about fecund soils and \"small nice towns\" situated next to Răut.\n* Russian geographer K. Laksman described Bălţi steppe in the beginning of the 19th century: \"To the north is located a steppe with almost no trees at all. To the north-west the steppe is not as woodless\".\n* Scientist K. Arseniev mentioned that the north of Bessarabia is \"a genuine mix of arid steppes with most fertile pastures, rich meadows and gardens\".\n* Travelers and scholars were amazed by the contrast between rich natural resources of Moldavia/Bălţi steppe and its low population in war torned 18th century, pitiful state of agriculture, as well as the poverty of the local population.\n* \"Desert, waste, naked steppe... The settling among limitless expanses of Bălţi steppe happened not \"in accordnace\" with logic, but \"against\" it. The life of remote ancestors of Bălţiers was full of difficulties and crosses, but they managed to resist.\"\n* \"Moldavian fields, as described by both ancient and contemporary writers, are great in their fertility, by far surpassing the richness of the mountains\" (Dimitrie Cantemir, Descriptio Moldaviae)\n* \"Will someone describe Bessarabian steppes, indeed, they do merit a description. However for this, one needs the talent of unforgettable Gogol, who has so beautifully depicted us the steppes of his homeland. And Bessarabian steppes are not less beautiful.\" (Constantin Stamati-Ciurea)\n\nCurrent issues \n\nMoldova's communist-era environmental legacy, like that of many other former Soviet republics, is one of environmental degradation. Agricultural practices such as overuse of pesticides and artificial fertilizers were intended to increase agricultural output at all costs, without regard for the consequences. As a result, Moldova's soil and groundwater were contaminated by lingering chemicals, some of which (including DDT) have been banned in the West.\n\nSuch practices continue in Moldova to the present day.  In the early 1990s, use of pesticides in Moldova averaged approximately twenty times that of other former Soviet republics and Western nations. In addition, poor farming methods, such as destroying forests to plant vineyards, have contributed to the extensive soil erosion to which the country's rugged topography is already prone.\n\nInternational environmental agreements \n\nparty to:\nAir Pollution, Air Pollution-Persistent Organic Pollutants, Biodiversity, Climate Change, Climate Change-Kyoto Protocol, Desertification, Endangered Species, Hazardous Wastes, Ozone Layer Protection, Ship Pollution, Wetlands\n\nsigned, but not ratified: none of the selected agreements. Geography of Moldova. http://en.wikipedia.org/?curid=19242."
  }
}
