{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13761",
  "eid" : "0cc95ea0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778530698,
  "textBody" : "A hydrofoil is a lifting surface, or foil, that operates in water. They are similar in appearance and purpose to aerofoils used by aeroplanes. Boats that use hydrofoil technology are also simply termed hydrofoils. As a hydrofoil craft gains speed, the hydrofoils lift the boat's hull out of the water, decreasing drag and allowing greater speeds.\n\nDescription\n\nThe hydrofoil usually consists of a wing like structure mounted on struts below the hull, or across the keels of a catamaran in a variety of boats (see illustration). As a hydrofoil-equipped watercraft increases in speed, the hydrofoil elements below the hull(s) develop enough lift to raise the hull out of the water, which greatly reduces hull drag. This provides a corresponding increase in speed and fuel efficiency.\n\nWider adoption of hydrofoils is prevented by the increased complexity of building and maintaining them. Hydrofoils are generally prohibitively more expensive than conventional watercraft above the certain displacement, so most hydrofoil craft are relatively small, and are mainly used as high-speed passenger ferries, where the relatively high passenger fees can offset the high cost of the craft itself. However, the design is simple enough that there are many human-powered hydrofoil designs. Amateur experimentation and development of the concept is popular.\n\nHydrodynamic mechanics\n\nSince air and water are governed by similar fluid equations—albeit with different levels of viscosity, density, and compressibility—the hydrofoil and airfoil (both types of foil) create lift in identical ways. The foil shape moves smoothly through the water, deflecting the flow downward, which, following the Euler equations, exerts an upward force on the foil.  This turning of the water creates higher pressure on the bottom of the foil and reduced pressure on the top. This pressure difference is accompanied by a velocity difference, via Bernoulli's principle, so the resulting flowfield about the foil has a higher average velocity on one side than the other.\n\nWhen used as a lifting element on a hydrofoil boat, this upward force lifts the body of the vessel, decreasing drag and increasing speed. The lifting force eventually balances with the weight of the craft, reaching a point where the hydrofoil no longer lifts out of the water but remains in equilibrium. Since wave resistance and other impeding forces such as various types of drag (physics) on the hull are eliminated as the hull lifts clear, turbulence and drag act increasingly on the much smaller surface area of the hydrofoil, and decreasingly on the hull, creating a marked increase in speed.\n\nFoil configurations\n\nEarly hydrofoils used V-shaped foils. Hydrofoils of this type are known as \"surface-piercing\" since portions of the V-shape hydrofoils rise above the water surface when foilborne. Some modern hydrofoils use fully submerged inverted T-shape foils. Fully submerged hydrofoils are less subject to the effects of wave action, and, therefore, more stable at sea and more comfortable for crew and passengers. This type of configuration, however, is not self-stabilizing. The angle of attack on the hydrofoils must be adjusted continuously to changing conditions, a control process performed by sensors, a computer, and active surfaces.\n\nHistory \n\nPrototypes \n\nItalian inventor Enrico Forlanini began work on hydrofoils in 1898 and used a \"ladder\" foil system. Forlanini obtained patents in Britain and the United States for his ideas and designs.[https://books.google.com/books?id-t0DAAAAMBAJ&pg\nPA927 \"Italian Hydroplane of Curious Type.\"] Popular Mechanics, December 1911, p. 927.\n\nBetween 1899 and 1901, British boat designer John Thornycroft worked on a series of models with a stepped hull and single bow foil. In 1909 his company built the full scale 22 ft long boat, Miranda III. Driven by a 60 hp engine, it rode on a bowfoil and flat stern. The subsequent Miranda IV was credited with a speed of 35 kn.\n\nA March 1906 Scientific American article by American hydrofoil pioneer William E. Meacham explained the basic principle of hydrofoils. Alexander Graham Bell considered the invention of the hydroplane a very significant achievement, and after reading the article began to sketch concepts of what is now called a hydrofoil boat. With his chief engineer Casey Baldwin, Bell began hydrofoil experiments in the summer of 1908. Baldwin studied the work of the Italian inventor Enrico Forlanini and began testing models based on those designs, which led to the development of hydrofoil watercraft. During Bell's world tour of 1910–1911, Bell and Baldwin met with Forlanini in Italy, where they rode in his hydrofoil boat over Lake Maggiore. Baldwin described it as being as smooth as flying.\n\nOn returning to Bell's large laboratory at his Beinn Bhreagh estate near Baddeck, Nova Scotia, they experimented with a number of designs, culminating in Bell's HD-4. Using Renault engines, a top speed of 87 km/h was achieved, accelerating rapidly, taking waves without difficulty, steering well and showing good stability. Bell's report to the United States Navy permitted him to obtain two 260 kW (350 hp) engines. On 9 September 1919 the HD-4 set a world marine speed record of 114 km/h, which stood for two decades. A full-scale replica of the HD-4 is viewable at the Alexander Graham Bell National Historic Site museum in Baddeck, Nova Scotia.\n\nIn the early 1950s an English couple built the White Hawk, a jet-powered hydrofoil water craft, in an attempt to beat the absolute water speed record.[https://books.google.com/books?id8NsDAAAAMBAJ&pg\nPA70&dq1954+Popular+Mechanics+January&hl\nen&saX&ei\nS8Q4T9XAH8aygwe0k-nnBQ&ved0CD8Q6AEwBDgK#v\nonepage&q&f=true \"Jet Hydrofoil Shoots At World Record\"] Popular Mechanics, August 1953, pp. 70-71 However, in tests, White Hawk could barely top the record breaking speed of the 1919 HD-4.  The designers had faced an engineering phenomenon that limits the top speed of even modern hydrofoils: cavitation disturbs the lift created by the foils as they move through the water at speed above 60 kn, bending the lifting foil.The World Water Speed Record by Leo Villa and Kevin Desmond, 1976\n\nFirst passenger boats \n\nGerman engineer Hanns von Schertel worked on hydrofoils prior to and during World War II in Germany. After the war, the Russians captured Schertel's team. As Germany was not authorized to build fast boats, Schertel went to Switzerland, where he established the Supramar company. In 1952, Supramar launched the first commercial hydrofoil, PT10 \"Freccia d'Oro\" (Golden Arrow), in Lake Maggiore, between Switzerland and Italy. The PT10 is of surface-piercing type, it can carry 32 passengers and travel at 35 kn. In 1968, the Bahraini born banker Hussain Najadi acquired the Supramar AG and expanded its operations into Japan, Hong Kong, Singapore, the UK, Norway and the US. General Dynamics of the United States became its licensee, and the Pentagon awarded its first R&D naval research project in the field of supercavitation. Hitachi Shipbuilding of Osaka, Japan, was another licensee of Supramar, as well as many leading ship owners and shipyards in the OECD countries.\n\nFrom 1952 to 1971, Supramar designed many models of hydrofoils: PT20, PT50, PT75, PT100 and PT150. All are of surface-piercing type, except the PT150 combining a surface-piercing foil forward with a fully submerged foil in the aft location. Over 200 of Supramar's design were built, most of them by Rodriquez in Sicily, Italy.\n\nDuring the same period the Soviet Union experimented extensively with hydrofoils, constructing hydrofoil river boats and ferries with streamlined designs during the cold war period and into the 1980s. Such vessels include the Raketa (1957) type, followed by the larger Meteor type and the smaller Voskhod type. One of the most successful Soviet designer/inventor in this area was Rostislav Alexeyev, who some consider the 'father' of the modern hydrofoil due to his 1950s era high speed hydrofoil designs. Later, circa 1970s, Alexeyev combined his hydrofoil experience with the surface effect principle to create the Ekranoplan.\n\nIn 1961, SRI International issued a study on \"The Economic Feasibility of Passenger Hydrofoil Craft in US Domestic and Foreign Commerce\". Commercial use of hydrofoils in the US first appeared in 1961 when two commuter vessels were commissioned by Harry Gale Nye, Jr.'s North American Hydrofoils to service the route from Atlantic Highlands, New Jersey to the financial district of Lower Manhattan.\n\nMilitary usage\n\nA 17-ton German craft VS-6 Hydrofoil was designed and constructed in 1940, completed in 1941 for use as a mine layer, it was tested in the Baltic Sea, producing speeds of 47 knots. Tested against a standard E-boat over the next three years it performed well but was not brought into production. Being faster it could carry a higher payload and was capable of travelling over minefields but was prone to damage and noisier.\n\nIn Canada during World War II, Baldwin worked on an experimental smoke laying hydrofoil (later called the Comox Torpedo) that was later superseded by other smoke-laying technology and an experimental target-towing hydrofoil. The forward two foil assemblies of what is believed to be the latter hydrofoil were salvaged in the mid-1960s from a derelict hulk in Baddeck, Nova Scotia by Colin MacGregor Stevens. These were donated to the Maritime Museum in Halifax, Nova Scotia. The Canadian Armed Forces built and tested a number of hydrofoils (e.g., Baddeck and two vessels named Bras d'Or), which culminated in the high-speed anti-submarine hydrofoil HMCS Bras d'Or in the late 1960s. However, the program was cancelled in the early 1970s due to a shift away from anti-submarine warfare by the Canadian military.  The Bras d'Or was a surface-piercing type that performed well during her trials, reaching a maximum speed of 63 kn.\n\nThe USSR introduced several hydrofoil-based fast attack craft into their navy, principally:\n* Sarancha class missile boat, a unique vessel built in the 1970s\n* Turya class torpedo boat, introduced in 1972 and still in service\n* Matka class missile boat, introduced in the 1980s and still in service\n* Muravey class patrol boat, introduced in the 1980s and still in service\n\nThe US Navy began experiments with hydrofoils in the mid-1950s by funding a sailing vessel that used hydrofoils to reach speeds in the 30 mph range.[https://books.google.com/books?idu-EDAAAAMBAJ&pg\nPA136&dq&hl\nen&saX&ei\nuoxET6-bFcPVgQf2s_i2BA&ved0CEcQ6AEwBjgK#v\nonepage&q&ftrue \"Sail Boat Stilts Boost Speed.\"] Popular Mechanics, February 1956, p. 136. The XCH-4 (officially, Experimental Craft, Hydrofoil No. 4), designed by William P. Carl, exceeded speeds of 65 mph and was mistaken for a seaplane due to its shape. The US Navy implemented a small number of combat hydrofoils, such as the Pegasus class, from 1977 through 1993. These hydrofoils were fast and well armed. \n\nThe Italian Navy has used six hydrofoils of the Sparviero class since the late 1970s. These were armed with a 76 mm gun and two missiles, and were capable of speeds up to 50 kn. Three similar boats were built for the Japan Maritime Self-Defense Force.\n\nSailing and sports\n\nThe French experimental sail powered hydrofoil Hydroptère is the result of a research project that involves advanced engineering skills and technologies. In September 2009, the Hydroptère set new sailcraft world speed records in the 500 m category, with a speed of  and in the one nautical mile (1.9 km) category with a speed of .\n\nAnother trimaran sailboat is the Windrider Rave.  The Rave is a commercially available 17 ft, two person, hydrofoil trimaran, capable of reaching speeds of 40 kn.  The boat was designed by Jim Brown.\n\nThe Moth dinghy has evolved into some radical foil configurations.\n\nHobie Sailboats produced a production foiling trimaran, the Hobie Trifoiler, the fastest production sailboat. Trifoilers have clocked speeds upward of thirty knots.\n\nA new kayak design, called Flyak, has hydrofoils that lift the kayak enough to significantly reduce drag, allowing speeds of up to 27 km/h. Some surfers have developed surfboards with hydrofoils called foilboards, specifically aimed at surfing big waves further out to sea.\n\nQuadrofoil Q2 is a two-seater, four-foiled hydrofoil electrical leisure watercraft. Its initial design was set in 2012 and it has been available commercially since the end of 2016. Powered by a 5.2-kWh lithium-ion battery pack and propelled by a 5.5 kW motor, it reaches the top speed of 40 km/h and has 80 km of range.   \n\nModern passenger boats \n\nSoviet-built Voskhods are one of the most successful passenger hydrofoil designs. Manufactured in Russia and Ukraine, they are in service in more than 20 countries. The most recent model, Voskhod-2M FFF, also known as Eurofoil, was built in Feodosiya for the Dutch public transport operator Connexxion.\n\nThe Boeing 929 is widely used in Asia for passenger services between the many islands of Japan, between Hong Kong and Macau and on the Korean peninsula.\n\nCurrent operation \n\nCurrent operators of hydrofoils include:\n\n* TurboJET service, which speeds passengers across the Pearl River Delta between Hong Kong and Macau in less than an hour, with an average speed of 45 knots (83 km/h), mainly using Boeing's Jetfoil. Also services Shenzhen, Guangzhou and Kowloon. Operated by Shun Tak-China Travel Ship Management Limited.\n* Voskhod and Polesye service between Tulcea and Sulina on the Danube.\n* Meteor and Polesye service in Poland between Szczecin and Świnoujście.\n* Cometa service between Nizhneangarsk and Irkutsk on the Lake Baikal.\n* Cometa service between Vladivostok and Slavyanka.\n* Polesye service between Mozyr and Turov on the Pripyat River (Belarus).\n* Meteor service between Saint Petersburg, Russia and the Peterhof Palace, a summer palace of Russian tsars.\n\n* Meteor service between Saint Petersburg, Russia and the Kronstadt, a strongly fortified Russian seaport town, located on Kotlin Island, near the head of the Gulf of Finland. It lies thirty kilometers west of Saint Petersburg. Since 2012 replaced by a catamaran Mercury.\n* Meteor, Raketa and Voskhod hydrofoil types operate all over Volga, Don and Kama Rivers in Russia. Also the Lena River and Amur River.\n* Meteor hydrofoils are operated by a number of tour operators in Croatia, mostly for packaged tours, but there are also some scheduled services to islands in Adriatic.\n* Hydrofoils are regularly operated on the three major Italian lakes by branches of the Ministry of Infrastructure and Transport: Navigazione Lago Maggiore services routes on Lake Maggiore between Locarno and Arona, Navigazione Lago di Como services routes on Lake Como, and Navigazione Lago di Garda services routes on Lake Garda. Three units of the Rodriquez RHS150 type operate on each lake, for a total of nine hydrofoils. Navigazione Lago di Como still operates the last Rodriquez RHS70 in active service in Italy.\n* Former Russian hydrofoils are used in southern Italy for connection with islands of Lazio and Campania. SNAV has five RHS200, RHS160 and RHS150 used in the connections between Naples and the islands of Capri and Ischia.\n* A regular hydrofoil service runs from Istanbul to Yalova.\n* Hellenic Seaways operate their Flying Dolphins service over many routes in the Aegean, between the Cyclades, Saronic Gulf islands such as Aegina and Poros, and Athens.\n* Meteor (2), Polesye (4) and Voskhod (3) hydrofoil types operate in Hungary. MAHART PassNave Ltd. operates scheduled hydrofoil liners between Budapest, Bratislava and Vienna, inland liners between Budapest and the Danube Bend, and theme cruises to Komárom, Solt, Kalocsa and Mohács.\n* \"Voskhod\" Flying Dolphin services are currently operated by Joy Cruises between Corfu and Paxos. They run from Corfu Port to Gaios using two hydrofoils: Ilida and Ilida II.\n* Russian hydrofoils of the Kometa type operated on the Bulgarian Black Sea Coast connecting Varna, Nesebar, Burgas, Sozopol, Primorsko, and Tsarevo, and Raketa and Meteor models served the Bulgarian Danube ports between Rousse and Vidin. Both services were discontinued in the 1990s. In 2011 the service reopened between Varna, Nesebar, Burgas and Sozopol, operated by Bulgarian Hydrofoils Ltd.\n* Vietnamese Greenline Company operates hourly shuttle service between Ho Chi Minh city, Vung Tau and Con Dao island. Hydrofoil lines using the Russian-built Meteor type also connect Hai Phong, Ha Long and Mong Cai in North Vietnam, Phan Thiet and Phu Quy Island and between Rach Gia and Phu Quoc Island in the South.\n*The service between Busan, South Korea and Fukuoka, Japan is operated by two companies. Japanese JR Kyūshū Jet Ferry operates Beetle five times a day. Korean Miraejet operates Kobee three to four times a day. All of their fleets are Boeing 929.\n*As of February 2008, all of the commercial lines in Japan use Boeing 929. The routes include:\n**Sado Kisen operates the route between Sado and Niigata.\n**Tōkai Kisen operates Seven Island, running between Tokyo and Izu Islands, via Tateyama or Yokosuka. The destinations include Izu Ōshima, Toshima, Niijima, Shikinejima, and Kōzushima. The same ship also links Atami and Izu Ōshima.\n**Kyūshū Yūsen operates the route between Fukuoka, Iki, and the two ports of Tsushima.\n**Kyūshū Shōsen operates the route between Nagasaki and the two of Gotō Islands, namely Fukuejima and Nakadōrijima.\n**Kagoshima Shōsen and Cosmo Line operate the various routes between Kagoshima and Tanegashima or Yakushima.\n* In 2012, Agriculture, Fisheries and Conservation Department (AFCD) in Hong Kong leased a 12-meter HAWC (Hydrofoil Assisted Water Craft), a catamaran, to patrol the Geo Park, a UNESCO Sanctioned Marine Park in the Sai Kung areas off Hong Kong.\n\nDiscontinued operations \n\n* Until 31 December 2013, Fast Flying Ferries operated by Connexxion provided a regular public transport service over the North Sea Canal between Amsterdam Central Station and Velsen-Zuid in the Netherlands, using Voskhod 2M hydrofoils. It was stopped due to a new speed limit.\n* Between 1981 and 1990, \"Transmediterranea\" used to operate a service of hydrofoils connecting Ceuta and Algeciras in the Strait of Gibraltar. The crossing took half an hour, in comparison to the hour and a half of conventional ferries. Due to the common extreme winds and storms that take place in winter in the Strait of Gibraltar, the service was substituted in 1990 by catamarans, which were also able to carry cars. At the peak of the year, in summer, there was a service every half an hour in each direction. This high-speed connection had a big impact on the development of Ceuta, facilitating one-day business trips to mainland Spain.\n* Between 1964 and 1991 the Sydney hydrofoils operated on Sydney Harbour between Circular Quay and Manly.\n* During 70s and 80s there were frequent services between Belgrade and Tekija in Đerdap gorge. The distance 0f 220 km was covered in 3 hours and 30 minutes downstream and 4 hours upstream.\nSee also the history of Condor Ferries, which operated six hydrofoil ferries over a 29-year period between the Channel Islands, south coast of England and Saint-Malo.\n\nDisadvantages \n\nHydrofoils had their peak in popularity in the 1960s and 70s.  Since then there has been a steady decline in their use and popularity for leisure, military and commercial passenger transport use.  There are a number of reasons for this:\n\n* Hydrofoils are sensitive to impacts with floating objects and marine animals. On hitting something, a hydrofoil boat may fall off the foils, which often creates a perception of increased danger. However, hydrofoils operating in Hong Kong, reportedly some of the most littered waters, operate relatively trouble free. The Hong Kong Marine department maintains online records of all accidents in its waters.\n* Hydrofoils have sharp edges that reside in the water while in operation. These edges can fatally injure marine animals (e.g., whales).\n*  Hydrofoils are expensive to build. A vessel like the Boeing Jetfoil currently costs about three times the price of an equivalent catamaran passenger ferry. The increased costs are not always economically justifiable by consumers.  Simpler designs such as those of Russian design and those by Rodriquez in Italy are more competitive in price and are still being produced today for operation on ferry routes.\n* It is a very conservative industry. Hydrofoils are still considered exotic by many commercial operators of high-speed craft and many will not risk trying such exotic vessels when they have no experience in operating them.  Those that do have found benefit in their operation.\n* They are technically complex and require high maintenance, which has put an end to most military hydrofoil projects. The US Navy, for example, developed some of the most technically advanced hydrofoils, but could not make the complex propulsion systems and ride control reliable. This eventually led to the suspension of their hydrofoil projects.  Most other Navy developments met the same fate. The Russian Navy still operates very large hydrofoils and have been successful—largely because they opted for simpler systems that might not have the same performance as the US designs but are more robust and reliable.  In Hong Kong, increasing maintenance cost of keeping the old jetfoils running is resulting in these vessels slowly being phased out.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hydrofoil" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13761" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A hydrofoil is a lifting surface, or foil, that operates in water. They are similar in appearance and purpose to aerofoils used by aeroplanes. Boats that use hydrofoil technology are also simply termed hydrofoils. As a hydrofoil craft gains speed, the hydrofoils lift the boat's hull out of the water, decreasing drag and allowing greater speeds.\n\nDescription\n\nThe hydrofoil usually consists of a wing like structure mounted on struts below the hull, or across the keels of a catamaran in a variety of boats (see illustration). As a hydrofoil-equipped watercraft increases in speed, the hydrofoil elements below the hull(s) develop enough lift to raise the hull out of the water, which greatly reduces hull drag. This provides a corresponding increase in speed and fuel efficiency.\n\nWider adoption of hydrofoils is prevented by the increased complexity of building and maintaining them. Hydrofoils are generally prohibitively more expensive than conventional watercraft above the certain displacement, so most hydrofoil craft are relatively small, and are mainly used as high-speed passenger ferries, where the relatively high passenger fees can offset the high cost of the craft itself. However, the design is simple enough that there are many human-powered hydrofoil designs. Amateur experimentation and development of the concept is popular.\n\nHydrodynamic mechanics\n\nSince air and water are governed by similar fluid equations—albeit with different levels of viscosity, density, and compressibility—the hydrofoil and airfoil (both types of foil) create lift in identical ways. The foil shape moves smoothly through the water, deflecting the flow downward, which, following the Euler equations, exerts an upward force on the foil.  This turning of the water creates higher pressure on the bottom of the foil and reduced pressure on the top. This pressure difference is accompanied by a velocity difference, via Bernoulli's principle, so the resulting flowfield about the foil has a higher average velocity on one side than the other.\n\nWhen used as a lifting element on a hydrofoil boat, this upward force lifts the body of the vessel, decreasing drag and increasing speed. The lifting force eventually balances with the weight of the craft, reaching a point where the hydrofoil no longer lifts out of the water but remains in equilibrium. Since wave resistance and other impeding forces such as various types of drag (physics) on the hull are eliminated as the hull lifts clear, turbulence and drag act increasingly on the much smaller surface area of the hydrofoil, and decreasingly on the hull, creating a marked increase in speed.\n\nFoil configurations\n\nEarly hydrofoils used V-shaped foils. Hydrofoils of this type are known as \"surface-piercing\" since portions of the V-shape hydrofoils rise above the water surface when foilborne. Some modern hydrofoils use fully submerged inverted T-shape foils. Fully submerged hydrofoils are less subject to the effects of wave action, and, therefore, more stable at sea and more comfortable for crew and passengers. This type of configuration, however, is not self-stabilizing. The angle of attack on the hydrofoils must be adjusted continuously to changing conditions, a control process performed by sensors, a computer, and active surfaces.\n\nHistory \n\nPrototypes \n\nItalian inventor Enrico Forlanini began work on hydrofoils in 1898 and used a \"ladder\" foil system. Forlanini obtained patents in Britain and the United States for his ideas and designs.[https://books.google.com/books?id-t0DAAAAMBAJ&pg\nPA927 \"Italian Hydroplane of Curious Type.\"] Popular Mechanics, December 1911, p. 927.\n\nBetween 1899 and 1901, British boat designer John Thornycroft worked on a series of models with a stepped hull and single bow foil. In 1909 his company built the full scale 22 ft long boat, Miranda III. Driven by a 60 hp engine, it rode on a bowfoil and flat stern. The subsequent Miranda IV was credited with a speed of 35 kn.\n\nA March 1906 Scientific American article by American hydrofoil pioneer William E. Meacham explained the basic principle of hydrofoils. Alexander Graham Bell considered the invention of the hydroplane a very significant achievement, and after reading the article began to sketch concepts of what is now called a hydrofoil boat. With his chief engineer Casey Baldwin, Bell began hydrofoil experiments in the summer of 1908. Baldwin studied the work of the Italian inventor Enrico Forlanini and began testing models based on those designs, which led to the development of hydrofoil watercraft. During Bell's world tour of 1910–1911, Bell and Baldwin met with Forlanini in Italy, where they rode in his hydrofoil boat over Lake Maggiore. Baldwin described it as being as smooth as flying.\n\nOn returning to Bell's large laboratory at his Beinn Bhreagh estate near Baddeck, Nova Scotia, they experimented with a number of designs, culminating in Bell's HD-4. Using Renault engines, a top speed of 87 km/h was achieved, accelerating rapidly, taking waves without difficulty, steering well and showing good stability. Bell's report to the United States Navy permitted him to obtain two 260 kW (350 hp) engines. On 9 September 1919 the HD-4 set a world marine speed record of 114 km/h, which stood for two decades. A full-scale replica of the HD-4 is viewable at the Alexander Graham Bell National Historic Site museum in Baddeck, Nova Scotia.\n\nIn the early 1950s an English couple built the White Hawk, a jet-powered hydrofoil water craft, in an attempt to beat the absolute water speed record.[https://books.google.com/books?id8NsDAAAAMBAJ&pg\nPA70&dq1954+Popular+Mechanics+January&hl\nen&saX&ei\nS8Q4T9XAH8aygwe0k-nnBQ&ved0CD8Q6AEwBDgK#v\nonepage&q&f=true \"Jet Hydrofoil Shoots At World Record\"] Popular Mechanics, August 1953, pp. 70-71 However, in tests, White Hawk could barely top the record breaking speed of the 1919 HD-4.  The designers had faced an engineering phenomenon that limits the top speed of even modern hydrofoils: cavitation disturbs the lift created by the foils as they move through the water at speed above 60 kn, bending the lifting foil.The World Water Speed Record by Leo Villa and Kevin Desmond, 1976\n\nFirst passenger boats \n\nGerman engineer Hanns von Schertel worked on hydrofoils prior to and during World War II in Germany. After the war, the Russians captured Schertel's team. As Germany was not authorized to build fast boats, Schertel went to Switzerland, where he established the Supramar company. In 1952, Supramar launched the first commercial hydrofoil, PT10 \"Freccia d'Oro\" (Golden Arrow), in Lake Maggiore, between Switzerland and Italy. The PT10 is of surface-piercing type, it can carry 32 passengers and travel at 35 kn. In 1968, the Bahraini born banker Hussain Najadi acquired the Supramar AG and expanded its operations into Japan, Hong Kong, Singapore, the UK, Norway and the US. General Dynamics of the United States became its licensee, and the Pentagon awarded its first R&D naval research project in the field of supercavitation. Hitachi Shipbuilding of Osaka, Japan, was another licensee of Supramar, as well as many leading ship owners and shipyards in the OECD countries.\n\nFrom 1952 to 1971, Supramar designed many models of hydrofoils: PT20, PT50, PT75, PT100 and PT150. All are of surface-piercing type, except the PT150 combining a surface-piercing foil forward with a fully submerged foil in the aft location. Over 200 of Supramar's design were built, most of them by Rodriquez in Sicily, Italy.\n\nDuring the same period the Soviet Union experimented extensively with hydrofoils, constructing hydrofoil river boats and ferries with streamlined designs during the cold war period and into the 1980s. Such vessels include the Raketa (1957) type, followed by the larger Meteor type and the smaller Voskhod type. One of the most successful Soviet designer/inventor in this area was Rostislav Alexeyev, who some consider the 'father' of the modern hydrofoil due to his 1950s era high speed hydrofoil designs. Later, circa 1970s, Alexeyev combined his hydrofoil experience with the surface effect principle to create the Ekranoplan.\n\nIn 1961, SRI International issued a study on \"The Economic Feasibility of Passenger Hydrofoil Craft in US Domestic and Foreign Commerce\". Commercial use of hydrofoils in the US first appeared in 1961 when two commuter vessels were commissioned by Harry Gale Nye, Jr.'s North American Hydrofoils to service the route from Atlantic Highlands, New Jersey to the financial district of Lower Manhattan.\n\nMilitary usage\n\nA 17-ton German craft VS-6 Hydrofoil was designed and constructed in 1940, completed in 1941 for use as a mine layer, it was tested in the Baltic Sea, producing speeds of 47 knots. Tested against a standard E-boat over the next three years it performed well but was not brought into production. Being faster it could carry a higher payload and was capable of travelling over minefields but was prone to damage and noisier.\n\nIn Canada during World War II, Baldwin worked on an experimental smoke laying hydrofoil (later called the Comox Torpedo) that was later superseded by other smoke-laying technology and an experimental target-towing hydrofoil. The forward two foil assemblies of what is believed to be the latter hydrofoil were salvaged in the mid-1960s from a derelict hulk in Baddeck, Nova Scotia by Colin MacGregor Stevens. These were donated to the Maritime Museum in Halifax, Nova Scotia. The Canadian Armed Forces built and tested a number of hydrofoils (e.g., Baddeck and two vessels named Bras d'Or), which culminated in the high-speed anti-submarine hydrofoil HMCS Bras d'Or in the late 1960s. However, the program was cancelled in the early 1970s due to a shift away from anti-submarine warfare by the Canadian military.  The Bras d'Or was a surface-piercing type that performed well during her trials, reaching a maximum speed of 63 kn.\n\nThe USSR introduced several hydrofoil-based fast attack craft into their navy, principally:\n* Sarancha class missile boat, a unique vessel built in the 1970s\n* Turya class torpedo boat, introduced in 1972 and still in service\n* Matka class missile boat, introduced in the 1980s and still in service\n* Muravey class patrol boat, introduced in the 1980s and still in service\n\nThe US Navy began experiments with hydrofoils in the mid-1950s by funding a sailing vessel that used hydrofoils to reach speeds in the 30 mph range.[https://books.google.com/books?idu-EDAAAAMBAJ&pg\nPA136&dq&hl\nen&saX&ei\nuoxET6-bFcPVgQf2s_i2BA&ved0CEcQ6AEwBjgK#v\nonepage&q&ftrue \"Sail Boat Stilts Boost Speed.\"] Popular Mechanics, February 1956, p. 136. The XCH-4 (officially, Experimental Craft, Hydrofoil No. 4), designed by William P. Carl, exceeded speeds of 65 mph and was mistaken for a seaplane due to its shape. The US Navy implemented a small number of combat hydrofoils, such as the Pegasus class, from 1977 through 1993. These hydrofoils were fast and well armed. \n\nThe Italian Navy has used six hydrofoils of the Sparviero class since the late 1970s. These were armed with a 76 mm gun and two missiles, and were capable of speeds up to 50 kn. Three similar boats were built for the Japan Maritime Self-Defense Force.\n\nSailing and sports\n\nThe French experimental sail powered hydrofoil Hydroptère is the result of a research project that involves advanced engineering skills and technologies. In September 2009, the Hydroptère set new sailcraft world speed records in the 500 m category, with a speed of  and in the one nautical mile (1.9 km) category with a speed of .\n\nAnother trimaran sailboat is the Windrider Rave.  The Rave is a commercially available 17 ft, two person, hydrofoil trimaran, capable of reaching speeds of 40 kn.  The boat was designed by Jim Brown.\n\nThe Moth dinghy has evolved into some radical foil configurations.\n\nHobie Sailboats produced a production foiling trimaran, the Hobie Trifoiler, the fastest production sailboat. Trifoilers have clocked speeds upward of thirty knots.\n\nA new kayak design, called Flyak, has hydrofoils that lift the kayak enough to significantly reduce drag, allowing speeds of up to 27 km/h. Some surfers have developed surfboards with hydrofoils called foilboards, specifically aimed at surfing big waves further out to sea.\n\nQuadrofoil Q2 is a two-seater, four-foiled hydrofoil electrical leisure watercraft. Its initial design was set in 2012 and it has been available commercially since the end of 2016. Powered by a 5.2-kWh lithium-ion battery pack and propelled by a 5.5 kW motor, it reaches the top speed of 40 km/h and has 80 km of range.   \n\nModern passenger boats \n\nSoviet-built Voskhods are one of the most successful passenger hydrofoil designs. Manufactured in Russia and Ukraine, they are in service in more than 20 countries. The most recent model, Voskhod-2M FFF, also known as Eurofoil, was built in Feodosiya for the Dutch public transport operator Connexxion.\n\nThe Boeing 929 is widely used in Asia for passenger services between the many islands of Japan, between Hong Kong and Macau and on the Korean peninsula.\n\nCurrent operation \n\nCurrent operators of hydrofoils include:\n\n* TurboJET service, which speeds passengers across the Pearl River Delta between Hong Kong and Macau in less than an hour, with an average speed of 45 knots (83 km/h), mainly using Boeing's Jetfoil. Also services Shenzhen, Guangzhou and Kowloon. Operated by Shun Tak-China Travel Ship Management Limited.\n* Voskhod and Polesye service between Tulcea and Sulina on the Danube.\n* Meteor and Polesye service in Poland between Szczecin and Świnoujście.\n* Cometa service between Nizhneangarsk and Irkutsk on the Lake Baikal.\n* Cometa service between Vladivostok and Slavyanka.\n* Polesye service between Mozyr and Turov on the Pripyat River (Belarus).\n* Meteor service between Saint Petersburg, Russia and the Peterhof Palace, a summer palace of Russian tsars.\n\n* Meteor service between Saint Petersburg, Russia and the Kronstadt, a strongly fortified Russian seaport town, located on Kotlin Island, near the head of the Gulf of Finland. It lies thirty kilometers west of Saint Petersburg. Since 2012 replaced by a catamaran Mercury.\n* Meteor, Raketa and Voskhod hydrofoil types operate all over Volga, Don and Kama Rivers in Russia. Also the Lena River and Amur River.\n* Meteor hydrofoils are operated by a number of tour operators in Croatia, mostly for packaged tours, but there are also some scheduled services to islands in Adriatic.\n* Hydrofoils are regularly operated on the three major Italian lakes by branches of the Ministry of Infrastructure and Transport: Navigazione Lago Maggiore services routes on Lake Maggiore between Locarno and Arona, Navigazione Lago di Como services routes on Lake Como, and Navigazione Lago di Garda services routes on Lake Garda. Three units of the Rodriquez RHS150 type operate on each lake, for a total of nine hydrofoils. Navigazione Lago di Como still operates the last Rodriquez RHS70 in active service in Italy.\n* Former Russian hydrofoils are used in southern Italy for connection with islands of Lazio and Campania. SNAV has five RHS200, RHS160 and RHS150 used in the connections between Naples and the islands of Capri and Ischia.\n* A regular hydrofoil service runs from Istanbul to Yalova.\n* Hellenic Seaways operate their Flying Dolphins service over many routes in the Aegean, between the Cyclades, Saronic Gulf islands such as Aegina and Poros, and Athens.\n* Meteor (2), Polesye (4) and Voskhod (3) hydrofoil types operate in Hungary. MAHART PassNave Ltd. operates scheduled hydrofoil liners between Budapest, Bratislava and Vienna, inland liners between Budapest and the Danube Bend, and theme cruises to Komárom, Solt, Kalocsa and Mohács.\n* \"Voskhod\" Flying Dolphin services are currently operated by Joy Cruises between Corfu and Paxos. They run from Corfu Port to Gaios using two hydrofoils: Ilida and Ilida II.\n* Russian hydrofoils of the Kometa type operated on the Bulgarian Black Sea Coast connecting Varna, Nesebar, Burgas, Sozopol, Primorsko, and Tsarevo, and Raketa and Meteor models served the Bulgarian Danube ports between Rousse and Vidin. Both services were discontinued in the 1990s. In 2011 the service reopened between Varna, Nesebar, Burgas and Sozopol, operated by Bulgarian Hydrofoils Ltd.\n* Vietnamese Greenline Company operates hourly shuttle service between Ho Chi Minh city, Vung Tau and Con Dao island. Hydrofoil lines using the Russian-built Meteor type also connect Hai Phong, Ha Long and Mong Cai in North Vietnam, Phan Thiet and Phu Quy Island and between Rach Gia and Phu Quoc Island in the South.\n*The service between Busan, South Korea and Fukuoka, Japan is operated by two companies. Japanese JR Kyūshū Jet Ferry operates Beetle five times a day. Korean Miraejet operates Kobee three to four times a day. All of their fleets are Boeing 929.\n*As of February 2008, all of the commercial lines in Japan use Boeing 929. The routes include:\n**Sado Kisen operates the route between Sado and Niigata.\n**Tōkai Kisen operates Seven Island, running between Tokyo and Izu Islands, via Tateyama or Yokosuka. The destinations include Izu Ōshima, Toshima, Niijima, Shikinejima, and Kōzushima. The same ship also links Atami and Izu Ōshima.\n**Kyūshū Yūsen operates the route between Fukuoka, Iki, and the two ports of Tsushima.\n**Kyūshū Shōsen operates the route between Nagasaki and the two of Gotō Islands, namely Fukuejima and Nakadōrijima.\n**Kagoshima Shōsen and Cosmo Line operate the various routes between Kagoshima and Tanegashima or Yakushima.\n* In 2012, Agriculture, Fisheries and Conservation Department (AFCD) in Hong Kong leased a 12-meter HAWC (Hydrofoil Assisted Water Craft), a catamaran, to patrol the Geo Park, a UNESCO Sanctioned Marine Park in the Sai Kung areas off Hong Kong.\n\nDiscontinued operations \n\n* Until 31 December 2013, Fast Flying Ferries operated by Connexxion provided a regular public transport service over the North Sea Canal between Amsterdam Central Station and Velsen-Zuid in the Netherlands, using Voskhod 2M hydrofoils. It was stopped due to a new speed limit.\n* Between 1981 and 1990, \"Transmediterranea\" used to operate a service of hydrofoils connecting Ceuta and Algeciras in the Strait of Gibraltar. The crossing took half an hour, in comparison to the hour and a half of conventional ferries. Due to the common extreme winds and storms that take place in winter in the Strait of Gibraltar, the service was substituted in 1990 by catamarans, which were also able to carry cars. At the peak of the year, in summer, there was a service every half an hour in each direction. This high-speed connection had a big impact on the development of Ceuta, facilitating one-day business trips to mainland Spain.\n* Between 1964 and 1991 the Sydney hydrofoils operated on Sydney Harbour between Circular Quay and Manly.\n* During 70s and 80s there were frequent services between Belgrade and Tekija in Đerdap gorge. The distance 0f 220 km was covered in 3 hours and 30 minutes downstream and 4 hours upstream.\nSee also the history of Condor Ferries, which operated six hydrofoil ferries over a 29-year period between the Channel Islands, south coast of England and Saint-Malo.\n\nDisadvantages \n\nHydrofoils had their peak in popularity in the 1960s and 70s.  Since then there has been a steady decline in their use and popularity for leisure, military and commercial passenger transport use.  There are a number of reasons for this:\n\n* Hydrofoils are sensitive to impacts with floating objects and marine animals. On hitting something, a hydrofoil boat may fall off the foils, which often creates a perception of increased danger. However, hydrofoils operating in Hong Kong, reportedly some of the most littered waters, operate relatively trouble free. The Hong Kong Marine department maintains online records of all accidents in its waters.\n* Hydrofoils have sharp edges that reside in the water while in operation. These edges can fatally injure marine animals (e.g., whales).\n*  Hydrofoils are expensive to build. A vessel like the Boeing Jetfoil currently costs about three times the price of an equivalent catamaran passenger ferry. The increased costs are not always economically justifiable by consumers.  Simpler designs such as those of Russian design and those by Rodriquez in Italy are more competitive in price and are still being produced today for operation on ferry routes.\n* It is a very conservative industry. Hydrofoils are still considered exotic by many commercial operators of high-speed craft and many will not risk trying such exotic vessels when they have no experience in operating them.  Those that do have found benefit in their operation.\n* They are technically complex and require high maintenance, which has put an end to most military hydrofoil projects. The US Navy, for example, developed some of the most technically advanced hydrofoils, but could not make the complex propulsion systems and ride control reliable. This eventually led to the suspension of their hydrofoil projects.  Most other Navy developments met the same fate. The Russian Navy still operates very large hydrofoils and have been successful—largely because they opted for simpler systems that might not have the same performance as the US designs but are more robust and reliable.  In Hong Kong, increasing maintenance cost of keeping the old jetfoils running is resulting in these vessels slowly being phased out. Hydrofoil. http://en.wikipedia.org/?curid=13761."
  }
}
