{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1697",
  "eid" : "bb5096b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778394011,
  "textBody" : "Ambergris ( or, , ), ambergrease or grey amber, is a solid, waxy, flammable substance of a dull grey or blackish colour, produced in the digestive system of sperm whales.\n\nFreshly-produced ambergris has a marine, fecal odour.  However, as it ages, it acquires a sweet, earthy scent, commonly likened to the fragrance of rubbing alcohol, without the vaporous chemical astringency. Although ambergris used to be very highly valued by perfumers as a fixative (allowing the scent to last much longer), it has now largely been replaced by synthetic ambroxan.Panten, J. and Surburg, H. 2016. Flavors and Fragrances, 3. Aromatic and Heterocyclic Compounds. Ullmann's Encyclopedia of Industrial Chemistry. 1–45.\nDogs are known to be attracted to the smell of ambergris and are therefore sometimes used by ambergris searchers. \n\nEtymology\n\nThe word ambergris comes from the Old French \"ambre gris\" or \"grey amber\", which in turn derives from the Arabic word \"ʿanbar\", meaning ambergris. The word \"amber\" comes from the same source but since the late 13th century in Europe, it has been applied almost exclusively to fossilised tree resins from the Baltic region.\n\nFormation\n\nAmbergris is formed from a secretion of the bile duct in the intestines of the sperm whale, and can be found floating on the sea or washed up on the coast. It is also sometimes found in the abdomens of dead sperm whales. Because the beaks of giant squids have been discovered within lumps of ambergris, scientists have theorized that the substance is produced by the whale's gastrointestinal tract to ease the passage of hard, sharp objects that it may have eaten. The sperm whale usually vomits these, but if one travels further down the gut, it will be covered in ambergris.\n\nAmbergris is usually passed in the fecal matter. It is speculated that an ambergris mass too large to be passed through the intestines is expelled via the mouth, leading to the reputation of ambergris as primarily coming from whale vomit. Ambergris takes years to form. Christopher Kemp, the author of Floating Gold: A Natural (and Unnatural) History of Ambergris, says that it is only produced by sperm whales, and only by an estimated one percent of them. Ambergris is rare; once expelled by a whale, it often floats for years before making landfall. The very small chance of finding ambergris, and the legal ambiguity involved led perfume makers away from ambergris.\n\nAmbergris is primarily found in the Atlantic Ocean and on the coasts of South Africa, Brazil, Madagascar, the East Indies, The Maldives, China, Japan, India, Australia, New Zealand, and the Molucca Islands. Most commercially collected ambergris comes from the Bahamas in the Caribbean, particularly New Providence.  Fossilised ambergris from 1.75 million years ago has also been found.\n\nA  lump of ambergris, found on a beach at Anglesey, Wales, was sold to a French buyer for £11,000 at an auction in Macclesfield, England, on 25 September 2015. A 13 kg piece of ambergris was found by two Omanis, washed up on a beach on the Fooshi shores of Sadah province in southern Oman, in November 2015.\n\nPhysical properties\n\nAmbergris is found in lumps of various shapes and sizes, usually weighing from 15 g (~½ oz) to 50 kg (110 pounds), sometimes more. When initially expelled by or removed from the whale, the fatty precursor of ambergris is pale white in colour (sometimes streaked with black), soft, with a strong fecal smell. Following months to years of photodegradation and oxidation in the ocean, this precursor gradually hardens, developing a dark grey or black colour, a crusty and waxy texture, and a peculiar odour that is at once sweet, earthy, marine, and animalic. Its smell has been generally described as a vastly richer and smoother version of isopropanol without its stinging harshness. In this developed condition, ambergris has a specific gravity ranging from 0.780 to 0.926. It melts at about 62 °C to a fatty, yellow resinous liquid; and at 100 C it is volatilised into a white vapour. It is soluble in ether, and in volatile and fixed oils.\n\nChemical properties\n\nAmbergris is relatively nonreactive to acid. White crystals of a terpene known as ambrein can be separated from ambergris by heating raw ambergris in alcohol, then allowing the resulting solution to cool. Breakdown of the relatively scentless ambrein through oxidation produces ambroxan and ambrinol, the main odor components of ambergris.\n\nFile:Ambrein.svg|Ambrein\nFile:Ambrox.svg|Ambroxan\nFile:Ambrinol.svg|Ambrinol\n\nAmbroxan is now produced synthetically and used extensively in the perfume industry.\n\nApplications\n\nAmbergris has been mostly known for its use in creating perfume and fragrance much like musk. Perfumes can still be found with ambergris around the world. It is collected from remains found at sea and on beaches, although its precursor originates from the sperm whale, which is a vulnerable species.\n\nAncient Egyptians burned ambergris as incense, while in modern Egypt ambergris is used for scenting cigarettes. The ancient Chinese called the substance \"dragon's spittle fragrance\". During the Black Death in Europe, people believed that carrying a ball of ambergris could help prevent them from getting the plague.  This was because the fragrance covered the smell of the air which was believed to be a cause of plague.\n\nThis substance has also been used historically as a flavoring for food and is considered an aphrodisiac in some cultures. During the Middle Ages, Europeans used ambergris as a medication for headaches, colds, epilepsy, and other ailments.\n\nLegality\n\nFrom the 18th to the mid-19th century, the whaling industry prospered. By some reports, nearly 5,000 whales, including sperm whales, were killed each year. Due to studies showing that the whale populations were being threatened, the International Whaling Commission instituted a moratorium on commercial whaling in 1982. Although ambergris is not harvested from whales, many countries also ban the trade of ambergris as part of the more general ban on the hunting and exploitation of whales.\n\nUrine, faeces and ambergris (that has been naturally excreted by a sperm whale) are waste products not considered parts or derivatives of a CITES species and are therefore not covered by the provisions of the Convention.CITES CoP16 Com. II Rec. 2 (Rev. 1), Convention on International Trade in Endangered Species of Wild Fauna and Flora, Sixteenth meeting of the Conference of the Parties Bangkok (Thailand), 3–14 March 2013\nSummary record of the second session of Committee II\n\nIllegal\n* Australia – Under federal law, the export and import of ambergris for commercial purposes is banned by the Environment Protection and Biodiversity Conservation Act 1999.  The various states and territories have additional laws regarding ambergris.\n* United States – The possession and trade of ambergris is prohibited by the Endangered Species Act of 1973.\n\nLegal\n* United Kingdom\n* France\n* Switzerland\n* New Zealand\n\nIn popular culture\n\nHistorical\n\nA serving of eggs and ambergris was reportedly King Charles II of England's favorite dish.\n\nIn literature\n\nIn chapter 91 of Herman Melville's Moby-Dick (1851), Stubb, one of the mates of the Pequod, fools the captain of a French whaler (Rose-bud) into abandoning the corpse of a sperm whale found floating in the sea. His plan is to recover the corpse himself in hopes that it contains ambergris. His hope proves well founded, and the Pequods crew recovers a valuable quantity of the substance.Moby-Dick, Chapter 91 at Wikisource. Melville devotes the following chapter to a discussion of ambergris, with special attention to the irony that \"fine ladies and gentlemen should regale themselves with an essence found in the inglorious bowels of a sick whale.\"Moby-Dick, Chapter 92 at Wikisource.\n\nIn \"A Romance of Perfume Lands or the Search for Capt. Jacob Cole\", F. S. Clifford, October 1881, the last chapter concerns one of the novel's characters discovering an area of a remote island which contains large amounts of ambergris. He hopes to use this knowledge to help make his fortune in the manufacture of perfumes.\n\nIn Chapter 17 of William Dampier's \"A New Voyage Around the World\" (1697), Dampier escapes to Nicobar Island for \"a prospect of advancing a profitable trade for ambergris...and of gaining a considerable fortune...\"\n\nIn film and TV\n\nIn the 1956 episode \"Whale Gold\" of the British television series The Buccaneers, a crew of eighteenth-century pirates led by Captain Dan Tempest (actor Robert Shaw) find large pieces of ambergris at sea and on a beach, discoveries that lead to quarrels and death due to \"whale gold fever.\"\n\nThe plot of The Avengers 1963 episode \"Killer Whale\" revolves around an ambergris smuggling operation.\n\nThe 1969 book The Lost Ones by Ian Cameron, later made into Disney's 1974 film The Island at the Top of the World depicts a dirigible trip to the 'Whale Graveyard' where they find so much ambergris that it becomes a point of contention.\n\nIn the Batman episode \"Louie's Lethal Lilac Time\" (), Louie the Lilac steals a large piece of ambergris from Bruce Wayne and Dick Grayson, to use in his illegal perfume factory.\n\nIn \"The Sixth Voyage of Sinbad the Sailor\" in \"The Arabian Nights\" by Sir Richard Burton, Sinbad finds vast quantities of Ambergris after being shipwrecked on an unknown island after setting sail from Bassorāh.\n\nIn the 2001 film Hannibal, Hannibal Lecter sends Clarice Starling a letter which he writes while intentionally wearing a hand lotion containing ambergris, correctly assuming that this would lead her to discover his location in Florence, Italy, due to lotion utilizing ambergris being legal in only a few countries.\n\nIn the 2003 film Master and Commander: The Far Side of the World, an adaptation of Patrick O'Brian's Aubrey Maturin Series, Carpenter's Mate Joseph Nagle notes that the French privateer The Acheron would be \"...loaded with gold and ambergris and all the gems of Araby\", indicating the relative rarity and considerable value of ambergris during the Age of Sail. \n\nAmbergris plays a prominent role in the plot of the 2003 Futurama episode \"Three Hundred Big Boys.\" The episode guest-stars Roseanne Barr, who appears as a hologram of herself, reading the dictionary definition of \"ambergris.\"\n\nIn The 2007 film adaption of \"Sweeney Todd\", Beadle Bamford claims he uses ambergris as a cologne.\n\nIn the 2014 episode \"Ambergris\" of the animated television program Bob's Burgers, a lump of ambergris found on the beach plays an important role, as Louise, Tina, and Gene attempt to sell the ambergris illegally for $30,000.\n\nIn video games\n\nAmbergris is a commonly traded item in Assassin's Creed: Brotherhood.\n\nAmbergris is one of the resources needed for manufacturing perfumes in the video game Anno 1701.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Ambergris" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1697" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Ambergris ( or, , ), ambergrease or grey amber, is a solid, waxy, flammable substance of a dull grey or blackish colour, produced in the digestive system of sperm whales.\n\nFreshly-produced ambergris has a marine, fecal odour.  However, as it ages, it acquires a sweet, earthy scent, commonly likened to the fragrance of rubbing alcohol, without the vaporous chemical astringency. Although ambergris used to be very highly valued by perfumers as a fixative (allowing the scent to last much longer), it has now largely been replaced by synthetic ambroxan.Panten, J. and Surburg, H. 2016. Flavors and Fragrances, 3. Aromatic and Heterocyclic Compounds. Ullmann's Encyclopedia of Industrial Chemistry. 1–45.\nDogs are known to be attracted to the smell of ambergris and are therefore sometimes used by ambergris searchers. \n\nEtymology\n\nThe word ambergris comes from the Old French \"ambre gris\" or \"grey amber\", which in turn derives from the Arabic word \"ʿanbar\", meaning ambergris. The word \"amber\" comes from the same source but since the late 13th century in Europe, it has been applied almost exclusively to fossilised tree resins from the Baltic region.\n\nFormation\n\nAmbergris is formed from a secretion of the bile duct in the intestines of the sperm whale, and can be found floating on the sea or washed up on the coast. It is also sometimes found in the abdomens of dead sperm whales. Because the beaks of giant squids have been discovered within lumps of ambergris, scientists have theorized that the substance is produced by the whale's gastrointestinal tract to ease the passage of hard, sharp objects that it may have eaten. The sperm whale usually vomits these, but if one travels further down the gut, it will be covered in ambergris.\n\nAmbergris is usually passed in the fecal matter. It is speculated that an ambergris mass too large to be passed through the intestines is expelled via the mouth, leading to the reputation of ambergris as primarily coming from whale vomit. Ambergris takes years to form. Christopher Kemp, the author of Floating Gold: A Natural (and Unnatural) History of Ambergris, says that it is only produced by sperm whales, and only by an estimated one percent of them. Ambergris is rare; once expelled by a whale, it often floats for years before making landfall. The very small chance of finding ambergris, and the legal ambiguity involved led perfume makers away from ambergris.\n\nAmbergris is primarily found in the Atlantic Ocean and on the coasts of South Africa, Brazil, Madagascar, the East Indies, The Maldives, China, Japan, India, Australia, New Zealand, and the Molucca Islands. Most commercially collected ambergris comes from the Bahamas in the Caribbean, particularly New Providence.  Fossilised ambergris from 1.75 million years ago has also been found.\n\nA  lump of ambergris, found on a beach at Anglesey, Wales, was sold to a French buyer for £11,000 at an auction in Macclesfield, England, on 25 September 2015. A 13 kg piece of ambergris was found by two Omanis, washed up on a beach on the Fooshi shores of Sadah province in southern Oman, in November 2015.\n\nPhysical properties\n\nAmbergris is found in lumps of various shapes and sizes, usually weighing from 15 g (~½ oz) to 50 kg (110 pounds), sometimes more. When initially expelled by or removed from the whale, the fatty precursor of ambergris is pale white in colour (sometimes streaked with black), soft, with a strong fecal smell. Following months to years of photodegradation and oxidation in the ocean, this precursor gradually hardens, developing a dark grey or black colour, a crusty and waxy texture, and a peculiar odour that is at once sweet, earthy, marine, and animalic. Its smell has been generally described as a vastly richer and smoother version of isopropanol without its stinging harshness. In this developed condition, ambergris has a specific gravity ranging from 0.780 to 0.926. It melts at about 62 °C to a fatty, yellow resinous liquid; and at 100 C it is volatilised into a white vapour. It is soluble in ether, and in volatile and fixed oils.\n\nChemical properties\n\nAmbergris is relatively nonreactive to acid. White crystals of a terpene known as ambrein can be separated from ambergris by heating raw ambergris in alcohol, then allowing the resulting solution to cool. Breakdown of the relatively scentless ambrein through oxidation produces ambroxan and ambrinol, the main odor components of ambergris.\n\nFile:Ambrein.svg|Ambrein\nFile:Ambrox.svg|Ambroxan\nFile:Ambrinol.svg|Ambrinol\n\nAmbroxan is now produced synthetically and used extensively in the perfume industry.\n\nApplications\n\nAmbergris has been mostly known for its use in creating perfume and fragrance much like musk. Perfumes can still be found with ambergris around the world. It is collected from remains found at sea and on beaches, although its precursor originates from the sperm whale, which is a vulnerable species.\n\nAncient Egyptians burned ambergris as incense, while in modern Egypt ambergris is used for scenting cigarettes. The ancient Chinese called the substance \"dragon's spittle fragrance\". During the Black Death in Europe, people believed that carrying a ball of ambergris could help prevent them from getting the plague.  This was because the fragrance covered the smell of the air which was believed to be a cause of plague.\n\nThis substance has also been used historically as a flavoring for food and is considered an aphrodisiac in some cultures. During the Middle Ages, Europeans used ambergris as a medication for headaches, colds, epilepsy, and other ailments.\n\nLegality\n\nFrom the 18th to the mid-19th century, the whaling industry prospered. By some reports, nearly 5,000 whales, including sperm whales, were killed each year. Due to studies showing that the whale populations were being threatened, the International Whaling Commission instituted a moratorium on commercial whaling in 1982. Although ambergris is not harvested from whales, many countries also ban the trade of ambergris as part of the more general ban on the hunting and exploitation of whales.\n\nUrine, faeces and ambergris (that has been naturally excreted by a sperm whale) are waste products not considered parts or derivatives of a CITES species and are therefore not covered by the provisions of the Convention.CITES CoP16 Com. II Rec. 2 (Rev. 1), Convention on International Trade in Endangered Species of Wild Fauna and Flora, Sixteenth meeting of the Conference of the Parties Bangkok (Thailand), 3–14 March 2013\nSummary record of the second session of Committee II\n\nIllegal\n* Australia – Under federal law, the export and import of ambergris for commercial purposes is banned by the Environment Protection and Biodiversity Conservation Act 1999.  The various states and territories have additional laws regarding ambergris.\n* United States – The possession and trade of ambergris is prohibited by the Endangered Species Act of 1973.\n\nLegal\n* United Kingdom\n* France\n* Switzerland\n* New Zealand\n\nIn popular culture\n\nHistorical\n\nA serving of eggs and ambergris was reportedly King Charles II of England's favorite dish.\n\nIn literature\n\nIn chapter 91 of Herman Melville's Moby-Dick (1851), Stubb, one of the mates of the Pequod, fools the captain of a French whaler (Rose-bud) into abandoning the corpse of a sperm whale found floating in the sea. His plan is to recover the corpse himself in hopes that it contains ambergris. His hope proves well founded, and the Pequods crew recovers a valuable quantity of the substance.Moby-Dick, Chapter 91 at Wikisource. Melville devotes the following chapter to a discussion of ambergris, with special attention to the irony that \"fine ladies and gentlemen should regale themselves with an essence found in the inglorious bowels of a sick whale.\"Moby-Dick, Chapter 92 at Wikisource.\n\nIn \"A Romance of Perfume Lands or the Search for Capt. Jacob Cole\", F. S. Clifford, October 1881, the last chapter concerns one of the novel's characters discovering an area of a remote island which contains large amounts of ambergris. He hopes to use this knowledge to help make his fortune in the manufacture of perfumes.\n\nIn Chapter 17 of William Dampier's \"A New Voyage Around the World\" (1697), Dampier escapes to Nicobar Island for \"a prospect of advancing a profitable trade for ambergris...and of gaining a considerable fortune...\"\n\nIn film and TV\n\nIn the 1956 episode \"Whale Gold\" of the British television series The Buccaneers, a crew of eighteenth-century pirates led by Captain Dan Tempest (actor Robert Shaw) find large pieces of ambergris at sea and on a beach, discoveries that lead to quarrels and death due to \"whale gold fever.\"\n\nThe plot of The Avengers 1963 episode \"Killer Whale\" revolves around an ambergris smuggling operation.\n\nThe 1969 book The Lost Ones by Ian Cameron, later made into Disney's 1974 film The Island at the Top of the World depicts a dirigible trip to the 'Whale Graveyard' where they find so much ambergris that it becomes a point of contention.\n\nIn the Batman episode \"Louie's Lethal Lilac Time\" (), Louie the Lilac steals a large piece of ambergris from Bruce Wayne and Dick Grayson, to use in his illegal perfume factory.\n\nIn \"The Sixth Voyage of Sinbad the Sailor\" in \"The Arabian Nights\" by Sir Richard Burton, Sinbad finds vast quantities of Ambergris after being shipwrecked on an unknown island after setting sail from Bassorāh.\n\nIn the 2001 film Hannibal, Hannibal Lecter sends Clarice Starling a letter which he writes while intentionally wearing a hand lotion containing ambergris, correctly assuming that this would lead her to discover his location in Florence, Italy, due to lotion utilizing ambergris being legal in only a few countries.\n\nIn the 2003 film Master and Commander: The Far Side of the World, an adaptation of Patrick O'Brian's Aubrey Maturin Series, Carpenter's Mate Joseph Nagle notes that the French privateer The Acheron would be \"...loaded with gold and ambergris and all the gems of Araby\", indicating the relative rarity and considerable value of ambergris during the Age of Sail. \n\nAmbergris plays a prominent role in the plot of the 2003 Futurama episode \"Three Hundred Big Boys.\" The episode guest-stars Roseanne Barr, who appears as a hologram of herself, reading the dictionary definition of \"ambergris.\"\n\nIn The 2007 film adaption of \"Sweeney Todd\", Beadle Bamford claims he uses ambergris as a cologne.\n\nIn the 2014 episode \"Ambergris\" of the animated television program Bob's Burgers, a lump of ambergris found on the beach plays an important role, as Louise, Tina, and Gene attempt to sell the ambergris illegally for $30,000.\n\nIn video games\n\nAmbergris is a commonly traded item in Assassin's Creed: Brotherhood.\n\nAmbergris is one of the resources needed for manufacturing perfumes in the video game Anno 1701. Ambergris. http://en.wikipedia.org/?curid=1697."
  }
}
