{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1499",
  "eid" : "ba2e0fb0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778392107,
  "textBody" : "Events\n\n* 959 - Eraclus becomes the 25th bishop of Liège.\n*1140 – Song dynasty general Yue Fei defeats an army led by Jin dynasty general Wuzhu at the Battle of Yancheng during the Jin–Song Wars.\n*1192 – Minamoto no Yoritomo becomes Seii Tai Shōgun and the de facto ruler of Japan. (Traditional Japanese date: July 12, 1192)\n*1331 – King Stefan Uroš III, after months of anarchy, surrenders to his son and rival Stefan Dušan, who succeeds as King of Serbia.\n*1415 – Henry the Navigator leads Portuguese forces to victory over the Marinids at the Battle of Ceuta.\n*1680 – Pueblo Indians capture Santa Fe from the Spanish during the Pueblo Revolt.\n*1689 – The Battle of Dunkeld in Scotland.\n*1770 – James Cook formally claims eastern Australia for Great Britain, naming it New South Wales.\n*1772 – King Gustav III completes his coup d'état by adopting a new Constitution, ending half a century of parliamentary rule in Sweden and installing himself as an enlightened despot.\n*1778 – American Revolutionary War: British forces begin besieging the French outpost at Pondichéry.\n*1791 – A Vodou ceremony, led by Dutty Boukman, turns into a violent slave rebellion, beginning the Haitian Revolution.\n*1808 – Battle of Vimeiro: British and Portuguese forces led by General Arthur Wellesley defeat French force under Major-General Jean-Andoche Junot near the village of Vimeiro, Portugal, the first Anglo-Portuguese victory of the Peninsular War.\n*1810 – Jean-Baptiste Bernadotte, Marshal of France, is elected Crown Prince of Sweden by the Swedish Riksdag of the Estates.\n*1821 – Jarvis Island is discovered by the crew of the ship, Eliza Frances.\n*1831 – Nat Turner leads black slaves and free blacks in a rebellion in Southampton County, Virginia, which will claim the lives of 55 to 65 whites.\n*1852 – Tlingit Indians destroy Fort Selkirk, Yukon Territory.\n*1863 – Lawrence, Kansas is destroyed by pro-Confederate guerrillas known as Quantrill's Raiders.\n*1883 – An F5 tornado strikes Rochester, Minnesota, leading to the creation of the Mayo Clinic.\n*1888 – The first successful adding machine in the United States is patented by William Seward Burroughs.\n*1897 – Oldsmobile, a brand of American automobiles, is founded.\n*1901 – Six hundred American school teachers, Thomasites, arrived in Manila on the USAT Thomas.\n*1911 – The Mona Lisa is stolen by Vincenzo Perugia, a Louvre employee.\n*1914 – World War I: The Battle of Charleroi, a successful German attack across the River Sambre that pre-empted a French offensive in the same area.\n*1918 – World War I: The Second Battle of the Somme begins.\n*1942 – World War II: The flag of Nazi Germany is planted atop Mount Elbrus, the highest peak of the Caucasus mountain range.\n*  1942   – World War II: The Guadalcanal Campaign: American forces defeat an attack by Imperial Japanese Army soldiers in the Battle of the Tenaru.\n*1944 – Dumbarton Oaks Conference, prelude to the United Nations, begins.\n*  1944   – World War II: Canadian and Polish units capture the strategically important town of Falaise, Calvados, France.\n*1945 – Physicist Harry Daghlian is fatally irradiated in a criticality accident during an experiment with the Demon core at Los Alamos National Laboratory.\n*1957 – The Soviet Union successfully conducts a long-range test flight of the R-7 Semyorka, the first intercontinental ballistic missile.\n*1959 – United States President Dwight D. Eisenhower signs an executive order proclaiming Hawaii the 50th state of the union. Hawaii's admission is currently commemorated by Hawaii Admission Day\n*1961 – American country music singer Patsy Cline returns to record producer Owen Bradley's studio in Nashville, Tennessee to record her vocals to Willie Nelson's \"Crazy\", which would become her signature song.\n*  1961 – Motown releases what would be its first #1 hit, \"Please Mr. Postman\" by The Marvelettes.\n*1963 – Xá Lợi Pagoda raids: The Army of the Republic of Vietnam Special Forces loyal to Ngô Đình Nhu, brother of President Ngo Dinh Diem, vandalizes Buddhist pagodas across the country, arresting thousands and leaving an estimated hundreds dead.\n*1968 – Cold War: Nicolae Ceaușescu, leader of Communist Romania, publicly condemns the Soviet-led Warsaw Pact invasion of Czechoslovakia, encouraging the Romanian population to arm itself against possible Soviet reprisals.\n*  1968   – James Anderson, Jr. posthumously receives the first Medal of Honor to be awarded to an African American U.S. Marine.\n*1971 – A bomb exploded in the Liberal Party campaign rally in Plaza Miranda, Manila, Philippines with several anti-Marcos political candidates injured.\n*1982 – Lebanese Civil War: The first troops of a multinational force lands in Beirut to oversee the Palestine Liberation Organization's withdrawal from Lebanon.\n*1983 – Philippine opposition leader Benigno Aquino, Jr. is assassinated at the Manila International Airport (now renamed Ninoy Aquino International Airport in his honor).\n*1986 – Carbon dioxide gas erupts from volcanic Lake Nyos in Cameroon, killing up to 1,800 people within a 20-kilometer range.\n*1988 – The 6.9  Nepal earthquake shakes the Nepal–India border with a maximum Mercalli intensity of VIII (Severe), leaving 709–1,450 people killed and thousands injured.\n*1991 – Latvia declares renewal of its full independence after the occupation of Soviet Union.\n*  1991   – Coup attempt against Mikhail Gorbachev collapses.\n*1993 – NASA loses contact with the Mars Observer spacecraft.\n*2000 – Tiger Woods, American professional golfer, wins the 82nd PGA Championship and becomes the first golfer since Ben Hogan in 1953 to win 3 majors in a calendar year.\n*2013 – Hundreds of people are reported killed by chemical attacks in the Ghouta region of Syria.\n*2016 – The closing ceremony of the 2016 Summer Olympics in Rio de Janeiro, Brazil, take place.\n*2017 – A solar eclipse traverses the continental United States.\n\nBirths\n\n*1165 – Philip II of France (d. 1223)\n*1481 – Jorge de Lencastre, Duke of Coimbra (d. 1550)\n*1535 – Shimazu Yoshihiro, Japanese general (d. 1619)\n*1552 – Muhammad Qadiri, Founder of the Naushahia branch of the Qadri order (d. 1654)\n*1567 – Francis de Sales, Swiss bishop and saint (d. 1622)\n*1579 – Henri, Duke of Rohan (d. 1638)\n*1597 – Roger Twysden, English historian and politician (d. 1672)\n*1625 – John Claypole, English politician (d. 1688)\n*1643 – Afonso VI of Portugal (d. 1683)\n*1660 – Hubert Gautier, French mathematician and engineer (d. 1737)\n*1665 – Giacomo F. Maraldi, French-Italian astronomer and mathematician (d. 1729)\n*1670 – James FitzJames, 1st Duke of Berwick, French general and politician, Lord Lieutenant of Hampshire (d. 1734)\n*1725 – Jean-Baptiste Greuze, French painter and educator (d. 1805)\n*1754 – William Murdoch, Scottish engineer and inventor, created gas lighting (d. 1839)\n*  1754   – Banastre Tarleton, English general and politician (d. 1833)\n*1765 – William IV of the United Kingdom  (d. 1837)\n*1789 – Augustin-Louis Cauchy, French mathematician and academic (d. 1857)\n*1798 – Jules Michelet, French historian and philosopher (d. 1874)\n*1800 – Hiram Walden, American general and politician (d. 1880)\n*1801 – Guillaume Groen van Prinsterer, Dutch historian and politician (d. 1876)\n*1813 – Jean Stas, Belgian chemist and physician (d. 1891)\n*1816 – Charles Frédéric Gerhardt, French chemist and academic (d. 1856)\n*1823 – Nathaniel Everett Green, English painter and astronomer (d. 1899)\n*1826 – Karl Gegenbaur, German anatomist and academic (d. 1903)\n*1840 – Ferdinand Hamer, Dutch bishop and missionary (d. 1900)\n*1862 – Emilio Salgari, Italian journalist and author (d. 1911)\n*1869 – William Henry Ogilvie, Scottish-Australian poet and author (d. 1963)\n*1872 – Aubrey Beardsley, English author and illustrator (d. 1898)\n*1878 – Richard Girulatis, German footballer and manager (d. 1963)\n*1879 – Claude Grahame-White, English pilot and engineer (d. 1959)\n*1884 – Chandler Egan, American golfer and architect (d. 1936)\n*1885 – Édouard Fabre, Canadian runner (d. 1939)\n*1886 – Ruth Manning-Sanders, Welsh-English author and poet (d. 1988)\n*1887 – James Paul Moody, English sailor (d. 1912)\n*1891 – Emiliano Mercado del Toro, Puerto Rican-American soldier (d. 2007)\n*1892 – Charles Vanel, French actor and director (d. 1989)\n*1894 – Christian Schad, German painter (d. 1982)\n*1895 – Blossom Rock, American actress (d. 1978)\n*1897 – Keith Arbuthnott, 15th Viscount of Arbuthnott, Scottish soldier and peer (d. 1966)\n*1902 – Angel Karaliychev, Bulgarian author (d. 1972)\n*1903 – Kostas Giannidis, Greek pianist, composer, and conductor (d. 1984)\n*1904 – Count Basie, American pianist, composer, and bandleader (d. 1984)\n*1905 – Bipin Gupta, Indian actor and producer (d. 1981)\n*1906 – Friz Freleng, American animator, director, and producer (d. 1995)\n*1907 – P. Jeevanandham, Indian lawyer and politician (d. 1963)\n*1909 – Nikolay Bogolyubov, Russian mathematician and physicist (d. 1992)\n*1912 – Toe Blake, Canadian ice hockey player and coach (d. 1995)\n*1914 – Doug Wright, English cricketer and coach (d. 1998)\n*1916 – Bill Lee, American actor and singer (d. 1980)\n*  1916   – Consuelo Velázquez, Mexican pianist and songwriter (d. 2005)\n*1917 – Leonid Hurwicz, Russian economist and mathematician (d. 2008)\n*1918 – Billy Reay, Canadian-American ice hockey player and coach (d. 2004)\n*1921 – Reuven Feuerstein, Romanian-Israeli psychologist and academic (d. 2014)\n*1922 – Albert Irvin, English soldier and painter (d. 2015)\n*1923 – Keith Allen, Canadian-American ice hockey player, coach, and manager (d. 2014)\n*1924 – Jack Buck, American sportscaster (d. 2002)\n*  1924   – Jack Weston, American actor (d. 1996)\n*1926 – Can Yücel, Turkish poet and translator (d. 1999)\n*1927 – Thomas S. Monson, American religious leader, 16th President of The Church of Jesus Christ of Latter-day Saints (d. 2018)\n*1928 – Addison Farmer, American bassist (d. 1963)\n*  1928   – Art Farmer, American trumpet player and composer (d. 1999)\n*  1928   – Bud McFadin, American football player (d. 2006)\n*1929 – Herman Badillo, Puerto Rican-American lawyer and politician (d. 2014)\n*  1929   – X. J. Kennedy, American poet, translator, anthologist, editor\n*  1929   – Ahmed Kathrada, South African politician and political prisoner (d. 2017)\n*1930 – Princess Margaret, Countess of Snowdon (d. 2002)\n*  1930   – Frank Perry, American director, producer, and screenwriter (d. 1995)\n*1932 – Menashe Kadishman, Israeli sculptor and painter (d. 2015)\n*  1932   – Melvin Van Peebles, American actor, director, and screenwriter\n*1933 – Janet Baker, English soprano and educator\n*  1933   – Michael Dacher, German mountaineer (d. 1994)\n*  1933   – Barry Norman, English author and critic (d. 2017)\n*  1933   – Erik Paaske, Danish actor and singer (d. 1992)\n*1934 – Sudhakarrao Naik, Indian lawyer and politician, 13th Chief Minister of Maharashtra (d. 2001)\n*  1934   – Paul Panhuysen, Dutch composer (d. 2015)\n*1936 – Wilt Chamberlain, American basketball player and coach (d. 1999)\n*  1936   – Radish Tordia, Georgian painter and educator\n*1937 – Donald Dewar, Scottish lawyer and politician, 1st First Minister of Scotland (d. 2000)\n*  1937   – Gustavo Noboa, Ecuadorian academic and politician, 51st President of Ecuador\n*  1937   – Robert Stone, American novelist and short story writer (d. 2015)\n*1938 – Kenny Rogers, American singer-songwriter, guitarist, producer, and actor \n*  1938   – Mike Weston, English rugby player\n*1939 – James Burton, American Hall of Fame guitarist \n*  1939   – Festus Mogae, Botswana economist and politician, 3rd President of Botswana\n*  1939   – Clarence Williams III, American actor\n*1940 – Dominick Harrod, English journalist, historian, and author (d. 2013)\n*  1940   – Endre Szemerédi, Hungarian-American mathematician and computer scientist\n*1943 – Patrick Demarchelier, French photographer\n*  1943   – Jonathan Schell, American journalist and author (d. 2014)\n*  1943   – Lucius Shepard, American author and critic (d. 2014)\n*  1943   – Hugh Wilson, American actor, director, producer, and screenwriter\n*1944 – Perry Christie, Bahamian politician, 3rd Prime Minister of the Bahamas\n*  1944   – Jackie DeShannon, American singer-songwriter\n*  1944   – Peter Weir, Australian director, producer, and screenwriter\n*1945 – Celia Brayfield, English journalist and author\n*  1945   – Jerry DaVanon, American baseball player\n*  1945   – Willie Lanier, American football player\n*  1945   – Patty McCormack, American actress \n*1947 – Carl Giammarese, American singer-songwriter and musician (The Buckinghams) \n*1949 – Loretta Devine, American actress and singer\n*  1949   – Daniel Sivan, Israeli scholar and academic\n*1950 – Patrick Juvet, Swiss singer-songwriter and model\n*1951 – Eric Goles, Chilean mathematician and computer scientist\n*  1951   – Chesley V. Morton, American businessman and politician\n*1952 – Keith Hart, Canadian firefighter, wrestler, and trainer\n*  1952   – Glenn Hughes, English singer-songwriter, bass player, and producer \n*  1952   – Jiří Paroubek, Czech soldier and politician, 6th Prime Minister of the Czech Republic\n*  1952   – Bernadette Porter, English nun and educator \n*  1952   – Joe Strummer, English singer-songwriter and guitarist (d. 2002)\n*1953 – Ivan Stang, American author, publisher, and director\n*1954 – Archie Griffin, American football player\n*  1954   – Steve Smith, American drummer (Journey)\n*  1954   – Mark Williams, New Zealand-Australian singer-songwriter\n*1956 – Kim Cattrall, English-Canadian actress \n*  1956   – Jon Tester, American farmer and politician\n*1957 – Frank Pastore, American baseball player and radio host (d. 2012)\n*1958 – Mark Williams, Australian footballer and coach\n*1959 – Anne Hobbs, English tennis player and coach\n*  1959   – Jim McMahon, American football player and coach\n*1961 – Gerardo Barbero, Argentinian chess player and coach (d. 2001)\n*  1961   – V. B. Chandrasekhar, Indian cricketer and coach\n*  1961   – Stephen Hillenburg, American marine biologist, cartoonist, and animator\n*1962 – John Korfas, Greek-American basketball player and coach\n*  1962   – Pete Weber, American bowler\n*1963 – Mohammed VI of Morocco, King of Morocco\n*  1963   – Nigel Pearson, English footballer and manager\n*1964 – Gary Elkerton, Australian surfer\n*1965 – Jim Bullinger, American baseball player\n*1966 – John Wetteland, American baseball player and coach\n*1967 – Darren Bewick, Australian footballer\n*  1967   – Charb, French journalist and cartoonist (d. 2015)\n*  1967   – Carrie-Anne Moss, Canadian actress\n*  1967   – Serj Tankian, Lebanese-born Armenian-American singer-songwriter, multi-instrumentalist, and record producer \n*1968 – Dina Carroll, English singer-songwriter\n*  1968   – Goran Ćurko, Serbian footballer\n*  1968   – Laura Trevelyan, English journalist and author\n*1969 – Bruce Anstey, New Zealand motorcycle racer\n*  1969   – Josée Chouinard, Canadian figure skater\n*1970 – Craig Counsell, American baseball player and coach\n*  1970   – Erik Dekker, Dutch cyclist and manager\n*  1970   –  Cathy Weseluck, Canadian actress\n*1971 – Mamadou Diallo, Senegalese footballer\n*  1971   – Robert Harvey, Australian footballer and coach\n*  1971   – Liam Howlett, English keyboard player, DJ, and producer \n*1973 – Sergey Brin, Russian-American computer scientist and businessman, co-founded Google\n*  1973   – Steve McKenna, Canadian ice hockey player and coach\n*1974 – Martin Andanar, Filipino journalist and radio host\n*  1974   – Paul Mellor, Australian rugby league player and referee\n*1975 – Simon Katich, Australian cricketer and manager\n*1976 – Alex Brooks, American ice hockey player and scout\n*  1976   – Jeff Cunningham, Jamaican-American soccer player\n*  1976   – Robert Miles, Australian rugby league player\n*  1976   – Ramón Vázquez, Puerto Rican-American baseball player and coach\n*1978 – Peter Buxton, English rugby player and manager\n*  1978   – Reuben Droughns, American football player and coach\n*  1978   – Lee Gronkiewicz, American baseball player and coach\n*  1978   – Alan Lee, Irish footballer and coach\n*  1978   – Jason Marquis, American baseball player\n*1979 – Kelis, American singer-songwriter, producer, chef and author\n*1980 – Burney Lamar, American race car driver\n*  1980   – Paul Menard, American race car driver\n*  1980   – Jasmin Wöhr, German tennis player\n*1981 – Jarrod Lyle, Australian golfer\n*  1981   – Cameron Winklevoss, American rower and businessman, co-founded ConnectU\n*  1981   – Tyler Winklevoss, American rower and businessman, co-founded ConnectU\n*1982 – Jason Eaton, New Zealand rugby player\n*  1982   – Omar Sachedina, Canadian television journalist, correspondent, and news anchor\n*1983 – Scott McDonald, Australian footballer\n*1984 – Neil Dexter, South African cricketer\n*  1984   – Melvin Upton, Jr., American baseball player\n*1985 – Nicolás Almagro, Spanish tennis player\n*  1985   – Aleksandra Kiryashova, Russian pole vaulter\n*1986 – Usain Bolt, Jamaican sprinter\n*  1986   – Wout Brama, Dutch footballer\n*  1986   – Koki Sakamoto, Japanese gymnast\n*1988 – Robert Lewandowski, Polish footballer\n*  1988   – Kacey Musgraves, American singer-songwriter and guitarist\n*1989 – Charlison Benschop, Dutch footballer\n*  1989   – James Davey, English rugby league player\n*  1989   – Matteo Gentili, Italian footballer\n*  1989   – Hayden Panettiere, American actress\n*  1989   – Aleix Vidal, Spanish footballer\n*1991 – Leandro Bacuna, Dutch footballer\n*1992 – Felipe Nasr, Brazilian race car driver\n*2000 – Kate Valdez, Filipina actress and singer\n\nDeaths\n\n* 672 – Emperor Kōbun of Japan (b. 648)\n* 784 – Alberic, archbishop of Utrecht\n* 913 – Tang Daoxi, Chinese general \n*1131 – King Baldwin II of Jerusalem\n*1148 – William II, Count of Nevers (b. c. 1089)\n*1157 – Alfonso VII of León and Castile (b. 1105)\n*1245 – Alexander of Hales, English theologian\n*1271 – Alphonse, Count of Poitiers (b. 1220)\n*1534 – Philippe Villiers de L'Isle-Adam, 44th Grandmaster of the Knights Hospitaller (b. 1464)\n*1568 – Jean Parisot de Valette, 49th Grandmaster of the Knights Hospitaller (b. 1495)\n*1614 – Elizabeth Báthory, Hungarian countess and serial killer (b. 1560)\n*1622 – Juan de Tassis, 2nd Count of Villamediana, Spanish poet and politician (b. 1582)\n*1627 – Jacques Mauduit, French composer and academic (b. 1557)\n*1673 – Henry Grey, 1st Earl of Stamford, English soldier (b. 1599)\n*1689 – William Cleland, Scottish poet and soldier (b. 1661)\n*1762 – Lady Mary Wortley Montagu, English author, poet, and playwright (b. 1689)\n*1763 – Charles Wyndham, 2nd Earl of Egremont, English politician, Secretary of State for the Southern Department (b. 1710)\n*1775 – Zahir al-Umar, Arabian ruler (b. 1690)\n*1796 – John McKinly, American physician and politician, 1st Governor of Delaware (b. 1721)\n*1814 – Benjamin Thompson, American-English physicist and colonel (b. 1753)\n*1835 – John MacCulloch, Scottish geologist and academic (b. 1773)\n*1836 – Claude-Louis Navier, French physicist and engineer (b. 1785)\n*1838 – Adelbert von Chamisso, German botanist and poet (b. 1781)\n*1853 – Charles Tristan, marquis de Montholon, French general (b. 1783)\n*1854 – Thomas Clayton, American lawyer and politician (b. 1777)\n*1870 – Ma Xinyi, Chinese general and politician, Viceroy of Liangjiang (b. 1821)\n*1888 – James Farnell, Australian politician, 8th Premier of New South Wales (b. 1825)\n*1905 – Alexander von Oettingen, Estonian theologian and statistician (b. 1827)\n*1910 – Bertalan Székely, Hungarian painter and academic (b. 1835)\n*1919 – Laurence Doherty, English tennis player (b. 1875)\n*1935 – John Hartley, English tennis player (b. 1849)\n*1940 – Hermann Obrecht, Swiss lawyer and politician (b. 1882)\n*  1940   – Ernest Thayer, American poet and author (b. 1863)\n*  1940   – Leon Trotsky, Russian theorist and politician, founded the Red Army (b. 1879)\n*1943 – Henrik Pontoppidan, Danish journalist and author, Nobel Prize laureate (b. 1857)\n*1947 – Ettore Bugatti, Italian-French engineer and businessman, founded Bugatti (b. 1881)\n*1951 – Constant Lambert, English composer and conductor (b. 1905)\n*1957 – Mait Metsanurk, Estonian author and playwright (b. 1879)\n*  1957   – Nels Stewart, Canadian ice hockey player (b. 1902)\n*  1957   – Harald Sverdrup, Norwegian meteorologist and oceanographer (b. 1888)\n*1960 – David B. Steinman, American engineer, designed the Mackinac Bridge (b. 1886)\n*1964 – Palmiro Togliatti, Italian journalist and politician, Italian Minister of Justice (b. 1893)\n*1971 – George Jackson, American activist and author, co-founded the Black Guerrilla Family (b. 1941)\n*1974 – Buford Pusser, American police officer (b. 1937)\n*1978 – Charles Eames, American architect, co-designed the Eames House (b. 1907)\n*1979 – Giuseppe Meazza, Italian footballer and manager (b. 1910)\n*1983 – Benigno Aquino, Jr., Filipino journalist and politician (b. 1932)\n*1988 – Teodoro de Villa Diaz, Filipino guitarist and songwriter (b. 1963)\n*  1988   – Ray Eames, American architect, co-designed the Eames House (b. 1912)\n*1989 – Raul Seixas, Brazilian singer-songwriter and producer (b. 1945)\n*1993 – Tatiana Troyanos, American soprano and actress (b. 1938)\n*1995 – Subrahmanyan Chandrasekhar, Indian-American astrophysicist and mathematician, Nobel Prize laureate (b. 1910)\n*  1995   – Chuck Stevenson, American racing driver (b. 1919)\n*2000 – Tomata du Plenty, American singer-songwriter and playwright (b. 1948)\n*  2000   – Daniel Lisulo, Zambian politician, 3rd Prime Minister of Zambia (b. 1930)\n*  2000   – Andrzej Zawada, Polish mountaineer and author (b. 1928)\n*2001 – Calum MacKay, Canadian ice hockey player (b. 1927)\n*2003 – John Coplans, British artist (b. 1920)\n*  2003   – Kathy Wilkes, English philosopher and academic (b. 1946)\n*2004 – Sachidananda Routray, Indian Oriya-language poet (b. 1916)\n*2005 – Martin Dillon, American tenor and educator (b. 1957)\n*  2005   – Robert Moog, American businessman, founded Moog Music (b. 1934)\n*  2005   – Dahlia Ravikovitch, Israeli poet and translator (b. 1936)\n*  2005   – Marcus Schmuck, Austrian mountaineer (b. 1925)\n*2006 – Paul Fentener van Vlissingen, Dutch businessman and philanthropist (b. 1941)\n*2007 – Siobhan Dowd, British author (b. 1960)\n*  2007   – Elizabeth P. Hoisington, American general (b. 1918)\n*2008 – Jerry Finn, American engineer and producer (b. 1969)\n*2009 – Rex Shelley, Singaporean engineer and author (b. 1930)\n*2010 – Rodolfo Enrique Fogwill, Argentinean sociologist and author (b. 1941)\n*2012 – Georg Leber, German soldier and politician, Federal Minister of Defence for Germany (b. 1920)\n*  2012   – J. Frank Raley Jr., American soldier and politician (b. 1926)\n*  2012   – Don Raleigh, Canadian ice hockey player and coach (b. 1926)\n*  2012   – Guy Spitaels, Belgian academic and politician, 7th Minister-President of Wallonia (b. 1931)\n*  2012   – William Thurston, American mathematician and academic (b. 1946)\n*2013 – Jean Berkey, American lawyer and politician (b. 1938)\n*  2013   – Sid Bernstein, American record producer (b. 1918)\n*  2013   – C. Gordon Fullerton, American colonel, engineer, and astronaut (b. 1936)\n*  2013   – Fred Martin, Scottish footballer (b. 1929)\n*  2013   – Enos Nkala, Zimbabwean politician, Zimbabwean Minister of Defence (b. 1932)\n*2014 – Gerry Anderson, Irish radio and television host (b. 1944)\n*  2014   – Helen Bamber, English psychotherapist and academic (b. 1925)\n*  2014   – Steven R. Nagel, American colonel, engineer, and astronaut (b. 1946)\n*  2014   – Jean Redpath, Scottish singer-songwriter (b. 1937)\n*  2014   – Albert Reynolds, Irish businessman and politician, 9th Taoiseach of Ireland (b. 1932)\n*2015 – Colin Beyer, New Zealand lawyer and businessman (b. 1938)\n*  2015   – Wang Dongxing, Chinese commander and politician (b. 1916)\n*  2015   – Jimmy Evert, American tennis player and coach (b. 1924)\n*  2017   – Bajram Rexhepi, First Kosovan Prime Ministers of UN mission administration in Kosovo . (b. 1954)\n\nHolidays and observances\n\n* Christian Feast Day:\n** Abraham of Smolensk (Eastern Orthodox Church)\n** Euprepius of Verona\n** Maximilian of Antioch\n** Our Lady of Knock\n** Pope Pius X\n** Sidonius Apollinaris\n** August 21 (Eastern Orthodox liturgics)\n* Ninoy Aquino Day (Philippines)\n* Youth Day (Morocco)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "August 21" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1499" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 959 - Eraclus becomes the 25th bishop of Liège.\n*1140 – Song dynasty general Yue Fei defeats an army led by Jin dynasty general Wuzhu at the Battle of Yancheng during the Jin–Song Wars.\n*1192 – Minamoto no Yoritomo becomes Seii Tai Shōgun and the de facto ruler of Japan. (Traditional Japanese date: July 12, 1192)\n*1331 – King Stefan Uroš III, after months of anarchy, surrenders to his son and rival Stefan Dušan, who succeeds as King of Serbia.\n*1415 – Henry the Navigator leads Portuguese forces to victory over the Marinids at the Battle of Ceuta.\n*1680 – Pueblo Indians capture Santa Fe from the Spanish during the Pueblo Revolt.\n*1689 – The Battle of Dunkeld in Scotland.\n*1770 – James Cook formally claims eastern Australia for Great Britain, naming it New South Wales.\n*1772 – King Gustav III completes his coup d'état by adopting a new Constitution, ending half a century of parliamentary rule in Sweden and installing himself as an enlightened despot.\n*1778 – American Revolutionary War: British forces begin besieging the French outpost at Pondichéry.\n*1791 – A Vodou ceremony, led by Dutty Boukman, turns into a violent slave rebellion, beginning the Haitian Revolution.\n*1808 – Battle of Vimeiro: British and Portuguese forces led by General Arthur Wellesley defeat French force under Major-General Jean-Andoche Junot near the village of Vimeiro, Portugal, the first Anglo-Portuguese victory of the Peninsular War.\n*1810 – Jean-Baptiste Bernadotte, Marshal of France, is elected Crown Prince of Sweden by the Swedish Riksdag of the Estates.\n*1821 – Jarvis Island is discovered by the crew of the ship, Eliza Frances.\n*1831 – Nat Turner leads black slaves and free blacks in a rebellion in Southampton County, Virginia, which will claim the lives of 55 to 65 whites.\n*1852 – Tlingit Indians destroy Fort Selkirk, Yukon Territory.\n*1863 – Lawrence, Kansas is destroyed by pro-Confederate guerrillas known as Quantrill's Raiders.\n*1883 – An F5 tornado strikes Rochester, Minnesota, leading to the creation of the Mayo Clinic.\n*1888 – The first successful adding machine in the United States is patented by William Seward Burroughs.\n*1897 – Oldsmobile, a brand of American automobiles, is founded.\n*1901 – Six hundred American school teachers, Thomasites, arrived in Manila on the USAT Thomas.\n*1911 – The Mona Lisa is stolen by Vincenzo Perugia, a Louvre employee.\n*1914 – World War I: The Battle of Charleroi, a successful German attack across the River Sambre that pre-empted a French offensive in the same area.\n*1918 – World War I: The Second Battle of the Somme begins.\n*1942 – World War II: The flag of Nazi Germany is planted atop Mount Elbrus, the highest peak of the Caucasus mountain range.\n*  1942   – World War II: The Guadalcanal Campaign: American forces defeat an attack by Imperial Japanese Army soldiers in the Battle of the Tenaru.\n*1944 – Dumbarton Oaks Conference, prelude to the United Nations, begins.\n*  1944   – World War II: Canadian and Polish units capture the strategically important town of Falaise, Calvados, France.\n*1945 – Physicist Harry Daghlian is fatally irradiated in a criticality accident during an experiment with the Demon core at Los Alamos National Laboratory.\n*1957 – The Soviet Union successfully conducts a long-range test flight of the R-7 Semyorka, the first intercontinental ballistic missile.\n*1959 – United States President Dwight D. Eisenhower signs an executive order proclaiming Hawaii the 50th state of the union. Hawaii's admission is currently commemorated by Hawaii Admission Day\n*1961 – American country music singer Patsy Cline returns to record producer Owen Bradley's studio in Nashville, Tennessee to record her vocals to Willie Nelson's \"Crazy\", which would become her signature song.\n*  1961 – Motown releases what would be its first #1 hit, \"Please Mr. Postman\" by The Marvelettes.\n*1963 – Xá Lợi Pagoda raids: The Army of the Republic of Vietnam Special Forces loyal to Ngô Đình Nhu, brother of President Ngo Dinh Diem, vandalizes Buddhist pagodas across the country, arresting thousands and leaving an estimated hundreds dead.\n*1968 – Cold War: Nicolae Ceaușescu, leader of Communist Romania, publicly condemns the Soviet-led Warsaw Pact invasion of Czechoslovakia, encouraging the Romanian population to arm itself against possible Soviet reprisals.\n*  1968   – James Anderson, Jr. posthumously receives the first Medal of Honor to be awarded to an African American U.S. Marine.\n*1971 – A bomb exploded in the Liberal Party campaign rally in Plaza Miranda, Manila, Philippines with several anti-Marcos political candidates injured.\n*1982 – Lebanese Civil War: The first troops of a multinational force lands in Beirut to oversee the Palestine Liberation Organization's withdrawal from Lebanon.\n*1983 – Philippine opposition leader Benigno Aquino, Jr. is assassinated at the Manila International Airport (now renamed Ninoy Aquino International Airport in his honor).\n*1986 – Carbon dioxide gas erupts from volcanic Lake Nyos in Cameroon, killing up to 1,800 people within a 20-kilometer range.\n*1988 – The 6.9  Nepal earthquake shakes the Nepal–India border with a maximum Mercalli intensity of VIII (Severe), leaving 709–1,450 people killed and thousands injured.\n*1991 – Latvia declares renewal of its full independence after the occupation of Soviet Union.\n*  1991   – Coup attempt against Mikhail Gorbachev collapses.\n*1993 – NASA loses contact with the Mars Observer spacecraft.\n*2000 – Tiger Woods, American professional golfer, wins the 82nd PGA Championship and becomes the first golfer since Ben Hogan in 1953 to win 3 majors in a calendar year.\n*2013 – Hundreds of people are reported killed by chemical attacks in the Ghouta region of Syria.\n*2016 – The closing ceremony of the 2016 Summer Olympics in Rio de Janeiro, Brazil, take place.\n*2017 – A solar eclipse traverses the continental United States.\n\nBirths\n\n*1165 – Philip II of France (d. 1223)\n*1481 – Jorge de Lencastre, Duke of Coimbra (d. 1550)\n*1535 – Shimazu Yoshihiro, Japanese general (d. 1619)\n*1552 – Muhammad Qadiri, Founder of the Naushahia branch of the Qadri order (d. 1654)\n*1567 – Francis de Sales, Swiss bishop and saint (d. 1622)\n*1579 – Henri, Duke of Rohan (d. 1638)\n*1597 – Roger Twysden, English historian and politician (d. 1672)\n*1625 – John Claypole, English politician (d. 1688)\n*1643 – Afonso VI of Portugal (d. 1683)\n*1660 – Hubert Gautier, French mathematician and engineer (d. 1737)\n*1665 – Giacomo F. Maraldi, French-Italian astronomer and mathematician (d. 1729)\n*1670 – James FitzJames, 1st Duke of Berwick, French general and politician, Lord Lieutenant of Hampshire (d. 1734)\n*1725 – Jean-Baptiste Greuze, French painter and educator (d. 1805)\n*1754 – William Murdoch, Scottish engineer and inventor, created gas lighting (d. 1839)\n*  1754   – Banastre Tarleton, English general and politician (d. 1833)\n*1765 – William IV of the United Kingdom  (d. 1837)\n*1789 – Augustin-Louis Cauchy, French mathematician and academic (d. 1857)\n*1798 – Jules Michelet, French historian and philosopher (d. 1874)\n*1800 – Hiram Walden, American general and politician (d. 1880)\n*1801 – Guillaume Groen van Prinsterer, Dutch historian and politician (d. 1876)\n*1813 – Jean Stas, Belgian chemist and physician (d. 1891)\n*1816 – Charles Frédéric Gerhardt, French chemist and academic (d. 1856)\n*1823 – Nathaniel Everett Green, English painter and astronomer (d. 1899)\n*1826 – Karl Gegenbaur, German anatomist and academic (d. 1903)\n*1840 – Ferdinand Hamer, Dutch bishop and missionary (d. 1900)\n*1862 – Emilio Salgari, Italian journalist and author (d. 1911)\n*1869 – William Henry Ogilvie, Scottish-Australian poet and author (d. 1963)\n*1872 – Aubrey Beardsley, English author and illustrator (d. 1898)\n*1878 – Richard Girulatis, German footballer and manager (d. 1963)\n*1879 – Claude Grahame-White, English pilot and engineer (d. 1959)\n*1884 – Chandler Egan, American golfer and architect (d. 1936)\n*1885 – Édouard Fabre, Canadian runner (d. 1939)\n*1886 – Ruth Manning-Sanders, Welsh-English author and poet (d. 1988)\n*1887 – James Paul Moody, English sailor (d. 1912)\n*1891 – Emiliano Mercado del Toro, Puerto Rican-American soldier (d. 2007)\n*1892 – Charles Vanel, French actor and director (d. 1989)\n*1894 – Christian Schad, German painter (d. 1982)\n*1895 – Blossom Rock, American actress (d. 1978)\n*1897 – Keith Arbuthnott, 15th Viscount of Arbuthnott, Scottish soldier and peer (d. 1966)\n*1902 – Angel Karaliychev, Bulgarian author (d. 1972)\n*1903 – Kostas Giannidis, Greek pianist, composer, and conductor (d. 1984)\n*1904 – Count Basie, American pianist, composer, and bandleader (d. 1984)\n*1905 – Bipin Gupta, Indian actor and producer (d. 1981)\n*1906 – Friz Freleng, American animator, director, and producer (d. 1995)\n*1907 – P. Jeevanandham, Indian lawyer and politician (d. 1963)\n*1909 – Nikolay Bogolyubov, Russian mathematician and physicist (d. 1992)\n*1912 – Toe Blake, Canadian ice hockey player and coach (d. 1995)\n*1914 – Doug Wright, English cricketer and coach (d. 1998)\n*1916 – Bill Lee, American actor and singer (d. 1980)\n*  1916   – Consuelo Velázquez, Mexican pianist and songwriter (d. 2005)\n*1917 – Leonid Hurwicz, Russian economist and mathematician (d. 2008)\n*1918 – Billy Reay, Canadian-American ice hockey player and coach (d. 2004)\n*1921 – Reuven Feuerstein, Romanian-Israeli psychologist and academic (d. 2014)\n*1922 – Albert Irvin, English soldier and painter (d. 2015)\n*1923 – Keith Allen, Canadian-American ice hockey player, coach, and manager (d. 2014)\n*1924 – Jack Buck, American sportscaster (d. 2002)\n*  1924   – Jack Weston, American actor (d. 1996)\n*1926 – Can Yücel, Turkish poet and translator (d. 1999)\n*1927 – Thomas S. Monson, American religious leader, 16th President of The Church of Jesus Christ of Latter-day Saints (d. 2018)\n*1928 – Addison Farmer, American bassist (d. 1963)\n*  1928   – Art Farmer, American trumpet player and composer (d. 1999)\n*  1928   – Bud McFadin, American football player (d. 2006)\n*1929 – Herman Badillo, Puerto Rican-American lawyer and politician (d. 2014)\n*  1929   – X. J. Kennedy, American poet, translator, anthologist, editor\n*  1929   – Ahmed Kathrada, South African politician and political prisoner (d. 2017)\n*1930 – Princess Margaret, Countess of Snowdon (d. 2002)\n*  1930   – Frank Perry, American director, producer, and screenwriter (d. 1995)\n*1932 – Menashe Kadishman, Israeli sculptor and painter (d. 2015)\n*  1932   – Melvin Van Peebles, American actor, director, and screenwriter\n*1933 – Janet Baker, English soprano and educator\n*  1933   – Michael Dacher, German mountaineer (d. 1994)\n*  1933   – Barry Norman, English author and critic (d. 2017)\n*  1933   – Erik Paaske, Danish actor and singer (d. 1992)\n*1934 – Sudhakarrao Naik, Indian lawyer and politician, 13th Chief Minister of Maharashtra (d. 2001)\n*  1934   – Paul Panhuysen, Dutch composer (d. 2015)\n*1936 – Wilt Chamberlain, American basketball player and coach (d. 1999)\n*  1936   – Radish Tordia, Georgian painter and educator\n*1937 – Donald Dewar, Scottish lawyer and politician, 1st First Minister of Scotland (d. 2000)\n*  1937   – Gustavo Noboa, Ecuadorian academic and politician, 51st President of Ecuador\n*  1937   – Robert Stone, American novelist and short story writer (d. 2015)\n*1938 – Kenny Rogers, American singer-songwriter, guitarist, producer, and actor \n*  1938   – Mike Weston, English rugby player\n*1939 – James Burton, American Hall of Fame guitarist \n*  1939   – Festus Mogae, Botswana economist and politician, 3rd President of Botswana\n*  1939   – Clarence Williams III, American actor\n*1940 – Dominick Harrod, English journalist, historian, and author (d. 2013)\n*  1940   – Endre Szemerédi, Hungarian-American mathematician and computer scientist\n*1943 – Patrick Demarchelier, French photographer\n*  1943   – Jonathan Schell, American journalist and author (d. 2014)\n*  1943   – Lucius Shepard, American author and critic (d. 2014)\n*  1943   – Hugh Wilson, American actor, director, producer, and screenwriter\n*1944 – Perry Christie, Bahamian politician, 3rd Prime Minister of the Bahamas\n*  1944   – Jackie DeShannon, American singer-songwriter\n*  1944   – Peter Weir, Australian director, producer, and screenwriter\n*1945 – Celia Brayfield, English journalist and author\n*  1945   – Jerry DaVanon, American baseball player\n*  1945   – Willie Lanier, American football player\n*  1945   – Patty McCormack, American actress \n*1947 – Carl Giammarese, American singer-songwriter and musician (The Buckinghams) \n*1949 – Loretta Devine, American actress and singer\n*  1949   – Daniel Sivan, Israeli scholar and academic\n*1950 – Patrick Juvet, Swiss singer-songwriter and model\n*1951 – Eric Goles, Chilean mathematician and computer scientist\n*  1951   – Chesley V. Morton, American businessman and politician\n*1952 – Keith Hart, Canadian firefighter, wrestler, and trainer\n*  1952   – Glenn Hughes, English singer-songwriter, bass player, and producer \n*  1952   – Jiří Paroubek, Czech soldier and politician, 6th Prime Minister of the Czech Republic\n*  1952   – Bernadette Porter, English nun and educator \n*  1952   – Joe Strummer, English singer-songwriter and guitarist (d. 2002)\n*1953 – Ivan Stang, American author, publisher, and director\n*1954 – Archie Griffin, American football player\n*  1954   – Steve Smith, American drummer (Journey)\n*  1954   – Mark Williams, New Zealand-Australian singer-songwriter\n*1956 – Kim Cattrall, English-Canadian actress \n*  1956   – Jon Tester, American farmer and politician\n*1957 – Frank Pastore, American baseball player and radio host (d. 2012)\n*1958 – Mark Williams, Australian footballer and coach\n*1959 – Anne Hobbs, English tennis player and coach\n*  1959   – Jim McMahon, American football player and coach\n*1961 – Gerardo Barbero, Argentinian chess player and coach (d. 2001)\n*  1961   – V. B. Chandrasekhar, Indian cricketer and coach\n*  1961   – Stephen Hillenburg, American marine biologist, cartoonist, and animator\n*1962 – John Korfas, Greek-American basketball player and coach\n*  1962   – Pete Weber, American bowler\n*1963 – Mohammed VI of Morocco, King of Morocco\n*  1963   – Nigel Pearson, English footballer and manager\n*1964 – Gary Elkerton, Australian surfer\n*1965 – Jim Bullinger, American baseball player\n*1966 – John Wetteland, American baseball player and coach\n*1967 – Darren Bewick, Australian footballer\n*  1967   – Charb, French journalist and cartoonist (d. 2015)\n*  1967   – Carrie-Anne Moss, Canadian actress\n*  1967   – Serj Tankian, Lebanese-born Armenian-American singer-songwriter, multi-instrumentalist, and record producer \n*1968 – Dina Carroll, English singer-songwriter\n*  1968   – Goran Ćurko, Serbian footballer\n*  1968   – Laura Trevelyan, English journalist and author\n*1969 – Bruce Anstey, New Zealand motorcycle racer\n*  1969   – Josée Chouinard, Canadian figure skater\n*1970 – Craig Counsell, American baseball player and coach\n*  1970   – Erik Dekker, Dutch cyclist and manager\n*  1970   –  Cathy Weseluck, Canadian actress\n*1971 – Mamadou Diallo, Senegalese footballer\n*  1971   – Robert Harvey, Australian footballer and coach\n*  1971   – Liam Howlett, English keyboard player, DJ, and producer \n*1973 – Sergey Brin, Russian-American computer scientist and businessman, co-founded Google\n*  1973   – Steve McKenna, Canadian ice hockey player and coach\n*1974 – Martin Andanar, Filipino journalist and radio host\n*  1974   – Paul Mellor, Australian rugby league player and referee\n*1975 – Simon Katich, Australian cricketer and manager\n*1976 – Alex Brooks, American ice hockey player and scout\n*  1976   – Jeff Cunningham, Jamaican-American soccer player\n*  1976   – Robert Miles, Australian rugby league player\n*  1976   – Ramón Vázquez, Puerto Rican-American baseball player and coach\n*1978 – Peter Buxton, English rugby player and manager\n*  1978   – Reuben Droughns, American football player and coach\n*  1978   – Lee Gronkiewicz, American baseball player and coach\n*  1978   – Alan Lee, Irish footballer and coach\n*  1978   – Jason Marquis, American baseball player\n*1979 – Kelis, American singer-songwriter, producer, chef and author\n*1980 – Burney Lamar, American race car driver\n*  1980   – Paul Menard, American race car driver\n*  1980   – Jasmin Wöhr, German tennis player\n*1981 – Jarrod Lyle, Australian golfer\n*  1981   – Cameron Winklevoss, American rower and businessman, co-founded ConnectU\n*  1981   – Tyler Winklevoss, American rower and businessman, co-founded ConnectU\n*1982 – Jason Eaton, New Zealand rugby player\n*  1982   – Omar Sachedina, Canadian television journalist, correspondent, and news anchor\n*1983 – Scott McDonald, Australian footballer\n*1984 – Neil Dexter, South African cricketer\n*  1984   – Melvin Upton, Jr., American baseball player\n*1985 – Nicolás Almagro, Spanish tennis player\n*  1985   – Aleksandra Kiryashova, Russian pole vaulter\n*1986 – Usain Bolt, Jamaican sprinter\n*  1986   – Wout Brama, Dutch footballer\n*  1986   – Koki Sakamoto, Japanese gymnast\n*1988 – Robert Lewandowski, Polish footballer\n*  1988   – Kacey Musgraves, American singer-songwriter and guitarist\n*1989 – Charlison Benschop, Dutch footballer\n*  1989   – James Davey, English rugby league player\n*  1989   – Matteo Gentili, Italian footballer\n*  1989   – Hayden Panettiere, American actress\n*  1989   – Aleix Vidal, Spanish footballer\n*1991 – Leandro Bacuna, Dutch footballer\n*1992 – Felipe Nasr, Brazilian race car driver\n*2000 – Kate Valdez, Filipina actress and singer\n\nDeaths\n\n* 672 – Emperor Kōbun of Japan (b. 648)\n* 784 – Alberic, archbishop of Utrecht\n* 913 – Tang Daoxi, Chinese general \n*1131 – King Baldwin II of Jerusalem\n*1148 – William II, Count of Nevers (b. c. 1089)\n*1157 – Alfonso VII of León and Castile (b. 1105)\n*1245 – Alexander of Hales, English theologian\n*1271 – Alphonse, Count of Poitiers (b. 1220)\n*1534 – Philippe Villiers de L'Isle-Adam, 44th Grandmaster of the Knights Hospitaller (b. 1464)\n*1568 – Jean Parisot de Valette, 49th Grandmaster of the Knights Hospitaller (b. 1495)\n*1614 – Elizabeth Báthory, Hungarian countess and serial killer (b. 1560)\n*1622 – Juan de Tassis, 2nd Count of Villamediana, Spanish poet and politician (b. 1582)\n*1627 – Jacques Mauduit, French composer and academic (b. 1557)\n*1673 – Henry Grey, 1st Earl of Stamford, English soldier (b. 1599)\n*1689 – William Cleland, Scottish poet and soldier (b. 1661)\n*1762 – Lady Mary Wortley Montagu, English author, poet, and playwright (b. 1689)\n*1763 – Charles Wyndham, 2nd Earl of Egremont, English politician, Secretary of State for the Southern Department (b. 1710)\n*1775 – Zahir al-Umar, Arabian ruler (b. 1690)\n*1796 – John McKinly, American physician and politician, 1st Governor of Delaware (b. 1721)\n*1814 – Benjamin Thompson, American-English physicist and colonel (b. 1753)\n*1835 – John MacCulloch, Scottish geologist and academic (b. 1773)\n*1836 – Claude-Louis Navier, French physicist and engineer (b. 1785)\n*1838 – Adelbert von Chamisso, German botanist and poet (b. 1781)\n*1853 – Charles Tristan, marquis de Montholon, French general (b. 1783)\n*1854 – Thomas Clayton, American lawyer and politician (b. 1777)\n*1870 – Ma Xinyi, Chinese general and politician, Viceroy of Liangjiang (b. 1821)\n*1888 – James Farnell, Australian politician, 8th Premier of New South Wales (b. 1825)\n*1905 – Alexander von Oettingen, Estonian theologian and statistician (b. 1827)\n*1910 – Bertalan Székely, Hungarian painter and academic (b. 1835)\n*1919 – Laurence Doherty, English tennis player (b. 1875)\n*1935 – John Hartley, English tennis player (b. 1849)\n*1940 – Hermann Obrecht, Swiss lawyer and politician (b. 1882)\n*  1940   – Ernest Thayer, American poet and author (b. 1863)\n*  1940   – Leon Trotsky, Russian theorist and politician, founded the Red Army (b. 1879)\n*1943 – Henrik Pontoppidan, Danish journalist and author, Nobel Prize laureate (b. 1857)\n*1947 – Ettore Bugatti, Italian-French engineer and businessman, founded Bugatti (b. 1881)\n*1951 – Constant Lambert, English composer and conductor (b. 1905)\n*1957 – Mait Metsanurk, Estonian author and playwright (b. 1879)\n*  1957   – Nels Stewart, Canadian ice hockey player (b. 1902)\n*  1957   – Harald Sverdrup, Norwegian meteorologist and oceanographer (b. 1888)\n*1960 – David B. Steinman, American engineer, designed the Mackinac Bridge (b. 1886)\n*1964 – Palmiro Togliatti, Italian journalist and politician, Italian Minister of Justice (b. 1893)\n*1971 – George Jackson, American activist and author, co-founded the Black Guerrilla Family (b. 1941)\n*1974 – Buford Pusser, American police officer (b. 1937)\n*1978 – Charles Eames, American architect, co-designed the Eames House (b. 1907)\n*1979 – Giuseppe Meazza, Italian footballer and manager (b. 1910)\n*1983 – Benigno Aquino, Jr., Filipino journalist and politician (b. 1932)\n*1988 – Teodoro de Villa Diaz, Filipino guitarist and songwriter (b. 1963)\n*  1988   – Ray Eames, American architect, co-designed the Eames House (b. 1912)\n*1989 – Raul Seixas, Brazilian singer-songwriter and producer (b. 1945)\n*1993 – Tatiana Troyanos, American soprano and actress (b. 1938)\n*1995 – Subrahmanyan Chandrasekhar, Indian-American astrophysicist and mathematician, Nobel Prize laureate (b. 1910)\n*  1995   – Chuck Stevenson, American racing driver (b. 1919)\n*2000 – Tomata du Plenty, American singer-songwriter and playwright (b. 1948)\n*  2000   – Daniel Lisulo, Zambian politician, 3rd Prime Minister of Zambia (b. 1930)\n*  2000   – Andrzej Zawada, Polish mountaineer and author (b. 1928)\n*2001 – Calum MacKay, Canadian ice hockey player (b. 1927)\n*2003 – John Coplans, British artist (b. 1920)\n*  2003   – Kathy Wilkes, English philosopher and academic (b. 1946)\n*2004 – Sachidananda Routray, Indian Oriya-language poet (b. 1916)\n*2005 – Martin Dillon, American tenor and educator (b. 1957)\n*  2005   – Robert Moog, American businessman, founded Moog Music (b. 1934)\n*  2005   – Dahlia Ravikovitch, Israeli poet and translator (b. 1936)\n*  2005   – Marcus Schmuck, Austrian mountaineer (b. 1925)\n*2006 – Paul Fentener van Vlissingen, Dutch businessman and philanthropist (b. 1941)\n*2007 – Siobhan Dowd, British author (b. 1960)\n*  2007   – Elizabeth P. Hoisington, American general (b. 1918)\n*2008 – Jerry Finn, American engineer and producer (b. 1969)\n*2009 – Rex Shelley, Singaporean engineer and author (b. 1930)\n*2010 – Rodolfo Enrique Fogwill, Argentinean sociologist and author (b. 1941)\n*2012 – Georg Leber, German soldier and politician, Federal Minister of Defence for Germany (b. 1920)\n*  2012   – J. Frank Raley Jr., American soldier and politician (b. 1926)\n*  2012   – Don Raleigh, Canadian ice hockey player and coach (b. 1926)\n*  2012   – Guy Spitaels, Belgian academic and politician, 7th Minister-President of Wallonia (b. 1931)\n*  2012   – William Thurston, American mathematician and academic (b. 1946)\n*2013 – Jean Berkey, American lawyer and politician (b. 1938)\n*  2013   – Sid Bernstein, American record producer (b. 1918)\n*  2013   – C. Gordon Fullerton, American colonel, engineer, and astronaut (b. 1936)\n*  2013   – Fred Martin, Scottish footballer (b. 1929)\n*  2013   – Enos Nkala, Zimbabwean politician, Zimbabwean Minister of Defence (b. 1932)\n*2014 – Gerry Anderson, Irish radio and television host (b. 1944)\n*  2014   – Helen Bamber, English psychotherapist and academic (b. 1925)\n*  2014   – Steven R. Nagel, American colonel, engineer, and astronaut (b. 1946)\n*  2014   – Jean Redpath, Scottish singer-songwriter (b. 1937)\n*  2014   – Albert Reynolds, Irish businessman and politician, 9th Taoiseach of Ireland (b. 1932)\n*2015 – Colin Beyer, New Zealand lawyer and businessman (b. 1938)\n*  2015   – Wang Dongxing, Chinese commander and politician (b. 1916)\n*  2015   – Jimmy Evert, American tennis player and coach (b. 1924)\n*  2017   – Bajram Rexhepi, First Kosovan Prime Ministers of UN mission administration in Kosovo . (b. 1954)\n\nHolidays and observances\n\n* Christian Feast Day:\n** Abraham of Smolensk (Eastern Orthodox Church)\n** Euprepius of Verona\n** Maximilian of Antioch\n** Our Lady of Knock\n** Pope Pius X\n** Sidonius Apollinaris\n** August 21 (Eastern Orthodox liturgics)\n* Ninoy Aquino Day (Philippines)\n* Youth Day (Morocco). August 21. http://en.wikipedia.org/?curid=1499."
  }
}
