{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11408",
  "eid" : "fb995860-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778501862,
  "textBody" : "Female genital mutilation (FGM), also known as female genital cutting and female circumcision, is the ritual cutting or removal of some or all of the external female genitalia. The practice is found in Africa, Asia and the Middle East, and within communities from countries in which FGM is common. UNICEF estimated in 2016 that 200 million women living today in 30 countries—27 African countries, Indonesia, Iraqi Kurdistan and Yemen—have undergone the procedures.\n\nTypically carried out by a traditional circumciser using a blade, FGM is conducted from days after birth to puberty and beyond. In half the countries for which national figures are available, most girls are cut before the age of five.For the circumcisers, blade: UNICEF 2013, 2, 44–46; for the ages: 50. Procedures differ according to the country or ethnic group. They include removal of the clitoral hood and clitoral glans; removal of the inner labia; and removal of the inner and outer labia and closure of the vulva. In this last procedure, known as infibulation, a small hole is left for the passage of urine and menstrual fluid; the vagina is opened for intercourse and opened further for childbirth.\n\nThe practice is rooted in gender inequality, attempts to control women's sexuality, and ideas about purity, modesty and beauty. It is usually initiated and carried out by women, who see it as a source of honour, and who fear that failing to have their daughters and granddaughters cut will expose the girls to social exclusion.UNICEF 2013, 15.\nNahid F. Toubia, Eiman Hussein Sharief, \"Female genital mutilation: have we made progress?\", International Journal of Gynecology & Obstetrics, 82(3), September 2003, 251–261.   Health effects depend on the procedure. They can include recurrent infections, difficulty urinating and passing menstrual flow, chronic pain, the development of cysts, an inability to get pregnant, complications during childbirth, and fatal bleeding. There are no known health benefits.WHO 2017.\n\nThere have been international efforts since the 1970s to persuade practitioners to abandon FGM, and it has been outlawed or restricted in most of the countries in which it occurs, although the laws are poorly enforced. Since 2010 the United Nations has called upon healthcare providers to stop performing all forms of the procedure, including reinfibulation after childbirth and symbolic \"nicking\" of the clitoral hood.UN 2010; Ian Askew, et al. [http://jme.bmj.com/content/42/9/619.long \"A repeat call for complete abandonment of FGM\"], BMJ Journal of Medical Ethics, 0, 2016, 1–2.    The opposition to the practice is not without its critics, particularly among anthropologists, who have raised difficult questions about cultural relativism and the universality of human rights.Bettina Shell-Duncan, \"From Health to Human Rights: Female Genital Cutting and the Politics of Intervention\", American Anthropologist, New Series, 110(2), June 2008, 225–236.  \n\nTerminology\n\nUntil the 1980s FGM was widely known in English as female circumcision, implying an equivalence in severity with male circumcision.Martha Nussbaum, Sex and Social Justice, New York: Oxford University Press, 1999, [https://books.google.com/books?id7zoaKIolT9oC&pg\nPA119 119]. From 1929 the Kenya Missionary Council referred to it as the sexual mutilation of women, following the lead of Marion Scott Stevenson, a Church of Scotland missionary.James Karanja, The Missionary Movement in Colonial Kenya: The Foundation of Africa Inland Church, Göttingen: Cuvillier Verlag, 2009, [https://books.google.com/books?idF1ezIgyomGIC&pg\nPA93 93], n. 631. References to the practice as mutilation increased throughout the 1970s.WHO 2008, 4, 22. In 1975 Rose Oldfield Hayes, an American anthropologist, used the term female genital mutilation in the title of a paper in American Ethnologist,Rose Oldfield Hayes, \"Female Genital Mutilation, Fertility Control, Women's Roles, and the Patrilineage in Modern Sudan: A Functional Analysis,\" American Ethnologist 2(4), November 1975, 617–633.  and four years later Fran Hosken, an Austrian-American feminist writer, called it mutilation in her influential The Hosken Report: Genital and Sexual Mutilation of Females.Fran Hosken, The Hosken Report: Genital and Sexual Mutilation of Females, Lexington: Women's International Network, 1994 [1979].Claire C. Robertson, \"Getting beyond the Ew! Factor: Rethinking U.S. Approaches to African Female Genital Cutting\", in Stanlie M. James and Claire C. Robertson (eds.), Genital Cutting and Transnational Sisterhood, Urbana: University of Illinois Press, 2002 (54–86), [https://books.google.com/books?id\nt_5a39rTNB8C&pgPA60 60]. The Inter-African Committee on Traditional Practices Affecting the Health of Women and Children began referring to it as female genital mutilation in 1990, and the World Health Organization (WHO) followed suit in 1991.UNICEF 2013, 6–7. Other English terms include female genital cutting (FGC) and female genital mutilation/cutting (FGM/C), preferred by those who work with practitioners.\n\nIn countries where FGM is common, the practice's many variants are reflected in dozens of terms, often alluding to purification.UNICEF 2013, 48. In the Bambara language, spoken mostly in Mali, it is known as bolokoli (\"washing your hands\")Chantal Zabus, \"The Excised Body in African Texts and Contexts,\" in Merete Falck Borch (ed.), Bodies and Voices: The Force-field of Representation and Discourse in Colonial and Postcolonial Studies, New York: Rodopi, 2008, [https://books.google.com/books?id\nxZmWF3qxHo4C&pgPA47 47]. and in the Igbo language in eastern Nigeria as isa aru or iwu aru (\"having your bath\"). A common Arabic term for purification has the root t-h-r, used for male and female circumcision (tahur and tahara).Fadwa El Guindi, \"Had This Been Your Face, Would You Leave It as Is?\" in Rogaia Mustafa Abusharaf (ed.), Female Circumcision: Multicultural Perspectives, Philadelphia: University of Pennsylvania Press, 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA30 30]. It is also known in Arabic as khafḍ or khifaḍ. Communities may refer to FGM as \"pharaonic\" for infibulation and sunna circumcision for everything else.Ellen Gruenbaum, The Female Circumcision Controversy: An Anthropological Perspective, Philadelphia: University of Pennsylvania Press, 2001, 2–3. Sunna means \"path or way\" in Arabic and refers to the tradition of Muhammad, although none of the procedures are required within Islam.Ibrahim Lethome Asmani, Maryam Sheikh Abdi, [http://www.unfpa.org/sites/default/files/pub-pdf/De-linking%20FGM%20from%20Islam%20final%20report.pdf De-linking Female Genital Mutilation/Cutting from Islam], Washington: Frontiers in Reproductive Health, USAID, 2008, 3–5. The term infibulation derives from fibula, Latin for clasp—the Ancient Romans reportedly fastened clasps through the foreskins or labia of slaves to prevent sexual intercourse. The surgical infibulation of women came to be known as pharaonic circumcision in Sudan, but as Sudanese circumcision in Egypt.Leonard J. Kouba, Judith Muasher, \"Female Circumcision in Africa: An Overview,\" African Studies Review, 28(1), March 1985 (95–1100), 96–97.  In Somalia it is known simply as qodob (\"to sew up\").Raqiya D. Abdalla, My Grandmother Called it the Three Feminine Sorrows': The Struggle of Women Against Female Circumcision in Somalia\", in Abusharaf 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA190 190].\n\nMethods\n\nThe procedures are generally performed by a traditional circumciser (cutter or exciseuse) in the girls' homes, with or without anaesthesia. The cutter is usually an older woman, but in communities where the male barber has assumed the role of health worker he will perform FGM too.UNICEF 2013, 42–44 and table 5, 181 (for cutters), 46 (for home and anaesthesia). When traditional cutters are involved, non-sterile devices are likely to be used, including knives, razors, scissors, glass, sharpened rocks and fingernails.Elizabeth Kelly, Paula J. Adams Hillard, [http://journals.lww.com/co-obgyn/Abstract/2005/10000/Female_genital_mutilation.9.aspx \"Female genital mutilation\"], Current Opinion in Obstetrics & Gynecology, 17(5), October 2005, 490–494.  According to a nurse in Uganda, quoted in 2007 in The Lancet, a cutter would use one knife on up to 30 girls at a time.Wairagala Wakabi, [http://www.thelancet.com/journals/lancet/article/PIIS0140-6736(07)60508-X/fulltext \"Africa battles to make female genital mutilation history\"], The Lancet, 369 (9567), 31 March 2007, 1069–1070.   Health professionals are often involved in Egypt, Kenya, Indonesia and Sudan. In Egypt 77 percent of FGM procedures, and in Indonesia over 50 percent, were performed by medical professionals as of 2008 and 2016.UNICEF 2013, 43–45. Women in Egypt reported in 1995 that a local anaesthetic had been used on their daughters in 60 percent of cases, a general anaesthetic in 13 percent, and neither in 25 percent (two percent were missing/don't know).UNICEF 2013, 46.\n\nClassification\n\nVariation\n\nThe WHO, UNICEF and UNFPA issued a joint statement in 1997 defining FGM as \"all procedures involving partial or total removal of the external female genitalia or other injury to the female genital organs whether for cultural or other non-therapeutic reasons\". The procedures vary considerably according to ethnicity and individual practitioners. During a 1998 survey in Niger, women responded with over 50 different terms when asked what was done to them. Translation problems are compounded by the women's confusion over which type of FGM they experienced, or even whether they experienced it.P. Stanley Yoder, Shanxiao Wang, Elise Johansen, \"Estimates of Female Genital Mutilation/Cutting in 27 African Countries and Yemen\", Studies in Family Planning, 44(2), June 2013 (189–204), 190.   Several studies have suggested that survey responses are unreliable. A 2003 study in Ghana found that in 1995 four percent said they had not undergone FGM, but in 2000 said they had, while 11 percent switched in the other direction.Elizabeth F. Jackson, et al., \"Inconsistent reporting of female genital cutting status in northern Ghana: Explanatory factors and analytical consequences\", Studies in Family Planning, 34(3), 2003, 200–210.  In Tanzania in 2005, 66 percent reported FGM, but a medical exam found that 73 percent had undergone it.Elise Klouman, Rachel Manongi, Knut-Inge Klepp, [http://onlinelibrary.wiley.com/doi/10.1111/j.1365-3156.2004.01350.x/full \"Self-reported and observed female genital cutting in rural Tanzania: Associated demographic factors, HIV and sexually transmitted infections\"], Tropical Medicine and International Health 10(1), 2005, 105–115.   In Sudan in 2006, a significant percentage of infibulated women and girls reported a less severe type.Susan Elmusharaf, Nagla Elhadi, Lars Almroth, [http://www.bmj.com/content/333/7559/124.full \"Reliability of self reported form of female genital mutilation and WHO classification: cross sectional study\"], British Medical Journal, 332(7559), 27 June 2006.   \n\nTypes\n\nStandard questionnaires from United Nations bodies ask women whether they or their daughters have undergone the following: (1) cut, no flesh removed (pricking or symbolic circumcision); (2) cut, some flesh removed; (3) sewn closed; or (4) type not determined/unsure/doesn't know. The most common procedures fall within the \"cut, some flesh removed\" category and involve complete or partial removal of the clitoral glans.[http://onlinelibrary.wiley.com/doi/10.1111/j.1728-4465.2013.00352.x/abstract Yoder 2013], 189; UNICEF 2013, 47. The World Health Organization (a UN agency) created a more detailed typology. Types I–III vary in how much tissue is removed; Type III is the UNICEF category \"sewn closed\". Type IV describes miscellaneous procedures, including symbolic circumcision.Jasmine Abdulcadir, et al., \"Female Genital Mutilation: A Visual Reference and Learning Tool for Health Care Professionals\"], Obstetrics & Gynecology, 128(5), November 2016, 958–963.  WHO 2008, 4, 23–28.\n\nType I is \"partial or total removal of the clitoris and/or the prepuce\". Type Ia (circumcision)WHO 2016, [https://www.ncbi.nlm.nih.gov/books/NBK368486/box/ch1.box1 Box 1.1 \"Types of FGM\"]. involves removal of the clitoral hood only. This is rarely performed alone. The more common procedure is Type Ib (clitoridectomy), the complete or partial removal of the clitoral glans (the visible tip of the clitoris) and clitoral hood.WHO 2008, 4. The circumciser pulls the clitoral glans with her thumb and index finger and cuts it off.\n\nType II (excision) is the complete or partial removal of the inner labia, with or without removal of the clitoral glans and outer labia. Type IIa is removal of the inner labia; Type IIb, removal of the clitoral glans and inner labia; and Type IIc, removal of the clitoral glans, inner and outer labia. Excision in French can refer to any form of FGM.\n\nType III (infibulation or pharaonic circumcision), the \"sewn closed\" category, involves the removal of the external genitalia and fusion of the wound. The inner and/or outer labia are cut away, with or without removal of the clitoral glans. Type III is found largely in northeast Africa, particularly Djibouti, Eritrea, Ethiopia, Somalia, and Sudan (although not in South Sudan). According to one 2008 estimate, over eight million women in Africa are living with Type III FGM. According to UNFPA in 2010, 20 percent of women with FGM have been infibulated.[http://www.unfpa.org/resources/promoting-gender-equality \"Frequently Asked Questions on Female Genital Mutilation/Cutting\"], United Nations Population Fund, April 2010. In Somalia \"[t]he child is made to squat on a stool or mat facing the circumciser at a height that offers her a good view of the parts to be handled. ... adult helpers grab and pull apart the legs of the girl. ... If available, this is the stage at which a local anaesthetic would be used\":\n\nThe element of speed and surprise is vital and the circumciser immediately grabs the clitoris by pinching it between her nails aiming to amputate it with a slash. The organ is then shown to the senior female relatives of the child who will decide whether the amount that has been removed is satisfactory or whether more is to be cut off. \n\nAfter the clitoris has been satisfactorily amputated ... the circumciser can proceed with the total removal of the labia minora and the paring of the inner walls of the labia majora. Since the entire skin on the inner walls of the labia majora has to be removed all the way down to the perineum, this becomes a\nmessy business. By now, the child is screaming, struggling, and bleeding profusely, which makes it difficult for the circumciser to hold with bare fingers and nails the slippery skin and parts that are to be cut or sutured together. ...\n\nHaving ensured that sufficient tissue has been removed to allow the desired fusion of the skin, the circumciser pulls together the opposite sides of the labia majora, ensuring that the raw edges where the skin has been removed are well approximated. The wound is now ready to be stitched or for thorns to be applied. If a needle and thread are being used, close tight sutures will be placed to ensure that a flap of skin covers the vulva and extends from the mons veneris to the perineum, and which, after the wound heals, will form a bridge of scar tissue that will totally occlude the vaginal introitus.Edna Adan Ismail, et al. [http://www.ednahospital.org/fgm/wp-content/uploads/FGM-Survey-in-Somaliland-Edna-Adan-Hospital-1.pdf \"Female genital mutilation survey in Somaliland\"], Edna Adan Maternity and Teaching Hospital, 2006–2013, 12.\n\nThe amputated parts might be placed in a pouch for the girl to wear.El Guindi 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA43 43]. A single hole of 2–3 mm is left for the passage of urine and menstrual fluid. The vulva is closed with surgical thread, or agave or acacia thorns, and might be covered with a poultice of raw egg, herbs and sugar. To help the tissue bond, the girl's legs are tied together, often from hip to ankle; the bindings are usually loosened after a week and removed after two to six weeks.Ismail 2016, 14. If the remaining hole is too large in the view of the girl's family, the procedure is repeated.\n\nThe vagina is opened for sexual intercourse, for the first time either by a midwife with a knife or by the woman's husband with his penis.Abdalla 2007, [https://books.google.com/books?id\n8VQxt634pfcC&pgPA190 190–191], [https://books.google.com/books?id\n8VQxt634pfcC&pg=PA198 198]. In some areas, including Somaliland, female relatives of the bride and groom might watch the opening of the vagina to check that the girl is a virgin.Ismail 2016, 14. \nThe woman is opened further for childbirth (defibulation or deinfibulation), and closed again afterwards (reinfibulation). Reinfibulation can involve cutting the vagina again to restore the pinhole size of the first infibulation. This might be performed before marriage, and after childbirth, divorce and widowhood.Asma El Dareer, Woman, Why Do You Weep: Circumcision and its Consequences, London: Zed Press, 1982, 56–64.\nAlso see Rebecca J. Cooke, Bernard M. Dickens, \"Special commentary on the issue of reinfibulation\", International Journal of Gynaecology and Obstetrics, 109(2), May 2010, 97–99.  \nGamal I. Serour, [http://www.ijgo.org/article/S0020-7292%2810%2900010-X/fulltext \"The issue of reinfibulation\"], International Journal of Gynaecology and Obstetrics, 109(2), May 2010, 93–96.   Hanny Lightfoot-Klein interviewed hundreds of women and men in Sudan in the 1980s about sexual intercourse with Type III:\n\nThe penetration of the bride's infibulation takes anywhere from 3 or 4 days to several months. Some men are unable to penetrate their wives at all (in my study over 15%), and the task is often accomplished by a midwife under conditions of great secrecy, since this reflects negatively on the man's potency. Some who are unable to penetrate their wives manage to get them pregnant in spite of the infibulation, and the woman's vaginal passage is then cut open to allow birth to take place. ... Those men who do manage to penetrate their wives do so often, or perhaps always, with the help of the \"little knife\". This creates a tear which they gradually rip more and more until the opening is sufficient to admit the penis.Hanny Lightfoot-Klein, \"The Sexual Experience and Marital Adjustment of Genitally Circumcised and Infibulated Females in The Sudan\"], The Journal of Sex Research, 26(3), 1989 (375–392), 380. ; Also see El Dareer 1982, 42–49.\n\nType IV is \"[a]ll other harmful procedures to the female genitalia for non-medical purposes\", including pricking, piercing, incising, scraping and cauterization. It includes nicking of the clitoris (symbolic circumcision), burning or scarring the genitals, and introducing substances into the vagina to tighten it.WHO 2008, 24.UNICEF 2013, 7. Labia stretching is also categorized as Type IV.WHO 2008, 27. Common in southern and eastern Africa, the practice is supposed to enhance sexual pleasure for the man and add to the sense of a woman as a closed space. From the age of eight, girls are encouraged to stretch their inner labia using sticks and massage. Girls in Uganda are told they may have difficulty giving birth without stretched labia.For the countries in which labia stretching is found (Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Tanzania, Uganda and Zimbabwe), see Nkiru Nzegwu, \"'Osunality' (or African eroticism)\" in Sylvia Tamale (ed.), African Sexualities: A Reader, Cape Town: Fahamu/Pambazuka, 2011, [https://books.google.com/books?id\nxSqIrrswbG0C&pg=PA262 262].\nFor the rest, Brigitte Bagnol and Esmeralda Mariano, \"Politics of Naming Sexual Practices\", in Tamale 2011, [https://books.google.com/books?idxSqIrrswbG0C&pg\nPA272 272–276] (272 for Uganda).\n\nA definition of FGM from the WHO in 1995 included gishiri cutting and angurya cutting, found in Nigeria and Niger. These were removed from the WHO's 2008 definition because of insufficient information about prevalence and consequences.WHO 2008, 27. Angurya cutting is excision of the hymen, usually performed seven days after birth. Gishiri cutting involves cutting the vagina's front or back wall with a blade or penknife, performed in response to infertility, obstructed labour and other conditions. In a study by Nigerian physician Mairo Usman Mandara, over 30 percent of women with gishiri cuts were found to have vesicovaginal fistulae (holes that allow urine to seep into the vagina).Mairo Usman Mandara, \"Female genital cutting in Nigeria: View of Nigerian Doctors on the Medicalization Debate\", in Bettina Shell-Duncan and Ylva Hernlund (eds.), Female \"Circumcision\" in Africa: Culture Controversy and Change, Boulder: Lynne Rienner Publishers, 2000, [https://books.google.com/books?id\nrhhRXiJIGEcC&pg=PA98 98], 100; for fistulae, 102.\nMairo Usman Mandara, \"Female genital mutilation in Nigeria\", International Journal of Gynecology & Obstetrics, 84(3), 291–298.  \n\nComplications\n\nShort-term and late\n\nFGM harms women's physical and emotional health throughout their lives.Rigmor C. Berg, et al., [http://bmjopen.bmj.com/content/4/11/e006316.full \"Effects of female genital cutting on physical health outcomes: a systematic review and meta-analysis\"], BMJ Open, 4(11), 2014: e006316.   It has no known health benefits. The short-term and late complications depend on the type of FGM, whether the practitioner has had medical training, and whether they used antibiotics and sterilized or single-use surgical instruments. In the case of Type III, other factors include how small a hole was left for the passage of urine and menstrual blood, whether surgical thread was used instead of agave or acacia thorns, and whether the procedure was performed more than once (for example, to close an opening regarded as too wide or re-open one too small).\n\nCommon short-term complications include swelling, excessive bleeding, pain, urine retention, and healing problems/wound infection. A 2015 systematic review of 56 studies that recorded immediate complications suggested that each of these occurred in more than one in ten girls and women undergoing any form of FGM, including symbolic nicking of the clitoris (Type IV), although the risks increased with Type III. The review also suggested that there was under-reporting.Rigmor C. Berg, Vigdis Underland, [http://www.kunnskapssenteret.no/en/publications/immediate-health-consequences-of-female-genital-mutilation-cutting-fgm-c \"Immediate health consequences of female genital mutilation/cutting (FGM/C)\"], Kunnskapssenteret (Norwegian Knowledge Centre for the Health Services), 2014, 4–5. Other short-term complications include fatal bleeding, anaemia, urinary infection, septicaemia, tetanus, gangrene, necrotizing fasciitis (flesh-eating disease), and endometritis.\nChristos Iavazzo, Thalia A. Sardi, Ioannis D. Gkegkes, [https://link.springer.com/article/10.1007%2Fs00404-012-2708-5 \"Female genital mutilation and infections: a systematic review of the clinical evidence\"], Archives of Gynecology and Obstetrics, 287(6), June 2013, 1137–1149.   It is not known how many girls and women die as a result of the practice, because complications may not be recognized or reported. The practitioners' use of shared instruments is thought to aid the transmission of hepatitis B, hepatitis C and HIV, although no epidemiological studies have shown this.\n\nLate complications vary depending on the type of FGM. They include the formation of scars and keloids that lead to strictures and obstruction, epidermoid cysts that may become infected, and neuroma formation (growth of nerve tissue) involving nerves that supplied the clitoris.Amish J. Dave, Aisha Sethi, Aldo Morrone, [http://www.sciencedirect.com/science/article/pii/S0733863510001439 \"Female Genital Mutilation: What Every American Dermatologist Needs to Know\"], Dermatologic Clinics, 29(1), January 2011, 103–109.   An infibulated girl may be left with an opening as small as 2–3 mm, which can cause prolonged, drop-by-drop urination, pain while urinating, and a feeling of needing to urinate all the time. Urine may collect underneath the scar, leaving the area under the skin constantly wet, which can lead to infection and the formation of small stones. The opening is larger in women who are sexually active or have given birth by vaginal delivery, but the urethra opening may still be obstructed by scar tissue. Vesicovaginal or rectovaginal fistulae can develop (holes that allow urine or faeces to seep into the vagina).Hamid Rushwan, [http://www.sciencedirect.com/science/article/pii/S1110570413000520 \"Female genital mutilation: A tragedy for women's reproductive health\"], African Journal of Urology, 19(3), September 2013, 130–133.  This and other damage to the urethra and bladder can lead to infections and incontinence, pain during sexual intercourse and infertility. Painful periods are common because of the obstruction to the menstrual flow, and blood can stagnate in the vagina and uterus. Complete obstruction of the vagina can result in hematocolpos and hematometra (where the vagina and uterus fill with menstrual blood). The swelling of the abdomen that results from the collection of fluid, together with the lack of menstruation, can lead to suspicion of pregnancy; Asma El Dareer, a Sudanese physician, reported in 1979 that a girl in Sudan with this condition was killed by her family.El Dareer 1982, 37. Also see Asma El Dareer, \"Preliminary report on a study on prevalence and epidemiology of female circumcision in Sudan today\", WHO seminar, Khartoum, 10–15 February 1979; Asma el Dareer, \"Female circumcision and its consequences for mother and child\", Yaounde, 12–15 December 1979, cited in [http://www.sciencedirect.com/science/article/pii/S1110570413000520 Rushwan 2013].\n\nPregnancy, childbirth\n\nFGM may place women at higher risk of problems during pregnancy and childbirth, which are more common with the more extensive FGM procedures. Infibulated women may try to make childbirth easier by eating less during pregnancy to reduce the baby's size. In women with vesicovaginal or rectovaginal fistulae, it is difficult to obtain clear urine samples as part of prenatal care, making the diagnosis of conditions such as pre-eclampsia harder. Cervical evaluation during labour may be impeded and labour prolonged or obstructed. Third-degree laceration (tears), anal-sphincter damage and emergency caesarean section are more common in infibulated women.Mumtaz Rashid, Mohammed H. Rashid, [http://onlinelibrary.wiley.com/doi/10.1576/toag.9.2.095.27310/pdf \"Obstetric management of women with female genital mutilation\"], The Obstetrician & Gynaecologist, 9(2), April 2007, 95–101. \n\nNeonatal mortality is increased. The WHO estimated in 2006 that an additional 10–20 babies die per 1,000 deliveries as a result of FGM. The estimate was based on a study conducted on 28,393 women attending delivery wards at 28 obstetric centres in Burkina Faso, Ghana, Kenya, Nigeria, Senegal and Sudan. In those settings all types of FGM were found to pose an increased risk of death to the baby: 15 percent higher for Type I, 32 percent for Type II, and 55 percent for Type III. The reasons for this were unclear, but may be connected to genital and urinary tract infections and the presence of scar tissue. The researchers wrote that FGM was associated with an increased risk to the mother of damage to the perineum and excessive blood loss, as well as a need to resuscitate the baby, and stillbirth, perhaps because of a long second stage of labour.Emily Banks, et al., [http://www.who.int/reproductivehealth/publications/fgm/fgm-obstetric-study-en.pdf?ua\n1 \"Female genital mutilation and obstetric outcome: WHO collaborative prospective study in six African countries\"], The Lancet, 367(9525), 3 June 2006, 1835–1841.  [http://www.who.int/mediacentre/news/releases/2006/pr30/en/index.html \"New study shows female genital mutilation exposes women and babies to significant risk at childbirth\"], World Health Organization, 2 June 2006.\n\nPsychological effects, sexual function\n\nAccording to a 2015 systematic review there is little high-quality information available on the psychological effects of FGM. Several small studies have concluded that women with FGM suffer from anxiety, depression and post-traumatic stress disorder. Feelings of shame and betrayal can develop when women leave the culture that practises FGM and learn that their condition is not the norm, but within the practising culture they may view their FGM with pride, because for them it signifies beauty, respect for tradition, chastity and hygiene. Studies on sexual function have also been small. A 2013 meta-analysis of 15 studies involving 12,671 women from seven countries concluded that women with FGM were twice as likely to report no sexual desire and 52 percent more likely to report dyspareunia (painful sexual intercourse). One third reported reduced sexual feelings.; ; S. Sibiani and A. A. Rouzi, [http://www.fertstert.org/article/S0015-0282%2808%2901813-X/fulltext \"Sexual function in women with female genital mutilation\"], Fertility and Sterility, 93(3), September 2008, 722–724. \n\nDistribution\n\nHousehold surveys\n\nAid agencies define the prevalence of FGM as the percentage of the 15–49 age group that has exerienced it.[http://onlinelibrary.wiley.com/doi/10.1111/j.1728-4465.2013.00352.x/abstract Yoder 2013], 193. These figures are based on nationally representative household surveys known as Demographic and Health Surveys (DHS), developed by Macro International and funded mainly by the United States Agency for International Development (USAID), and Multiple Indicator Cluster Surveys (MICS) conducted with financial and technical help from UNICEF. These surveys have been carried out in Africa, Asia, Latin America and elsewhere roughly every five years, since 1984 and 1995 respectively.[http://www.dhsprogram.com/What-We-Do/Survey-Types/DHS.cfm \"DHS overview\"], Demographic and Health Surveys; [http://www.childinfo.org/mics5_questionnaire.html \"Questionnaires and Indicator List\"], Multiple Indicator Cluster Surveys, UNICEF. The first to ask about FGM was the 1989–1990 DHS in northern Sudan. The first publication to estimate FGM prevalence based on DHS data (in seven countries) was by Dara Carr of Macro International in 1997.[https://www.ncbi.nlm.nih.gov/pubmed/23720002 Yoder, Wang and Johansen, 2013], 191; Dara Carr, Female genital cutting: Findings from the Demographic and Health Surveys program, Calverton, MD: Macro International Inc., 1997.\n\nType of FGM\n\nWomen are asked during the surveys: \"Was the genital area just nicked/cut without removing any flesh? Was any flesh (or something) removed from the genital area? Was your genital area sewn?\"UNICEF 2013, 134–135. Most women report \"cut, some flesh removed\" (Types I and II).UNICEF 2013, 47, table 5.2; .\n\nType I is the most common form in Egypt, and in the southern parts of Nigeria. Type III (infibulation) is concentrated in northeastern Africa, particularly Djibouti, Eritrea, Somalia and Sudan.Yoder 2008, 13–14. In surveys in 2002–2006, 30 percent of cut girls in Djibouti, 38 percent in Eritrea, and 63 percent in Somalia had experienced Type III.UNICEF 2013, 47. For the years and country profiles: Djibouti, UNICEF, December 2013; Eritrea, UNICEF, July 2013; Somalia, UNICEF, December 2013. There is also a high prevalence of infibulation among girls in Niger and Senegal,UNICEF 2013, 114. and in 2013 it was estimated that in Nigeria three percent of the 0–14 age group had been infibulated.Nigeria, UNICEF, July 2014. The type of procedure is often linked to ethnicity. In Eritrea, for example, a survey in 2002 found that all Hedareb girls had been infibulated, compared with two percent of the Tigrinya, most of whom fell into the \"cut, no flesh removed\" category.\n\nPrevalence\n\nFGM is found mostly in what Gerry Mackie called an \"intriguingly contiguous\" zone in Africa—east to west from Somalia to Senegal, and north to south from Egypt to Tanzania.Mackie and LeJeune (UNICEF) 2008, 5. Nationally representative figures are available for 27 countries in Africa, as well as Indonesia, Iraqi Kurdistan and Yemen. Over 200 million women and girls are thought to be living with FGM in those 30 countries.UNICEF Indonesia, February 2016.\n\nThe highest concentrations among the 15–49 age group are in Somalia (98 percent), Guinea (97 percent), Djibouti (93 percent), Egypt (91 percent) and Sierra Leone (90 percent).UNICEF 2014, 89–90. As of 2013, 27.2 million women had undergone FGM in Egypt, 23.8 million in Ethiopia, and 19.9 million in Nigeria.UNICEF 2013, 2. There is also a high concentration in Indonesia, where Type I (clitoridectomy) and Type IV [symbolic nicking]) are practised. The Indonesian Ministry of Health and the Indonesian Ulema Council both say that the clitoris should not be cut. The prevalence rate for the 0–11 group in Indonesia is 49 percent (13.4 million). Smaller studies or anecdotal reports suggest that FGM is also practised in Colombia, the Congo, Malaysia, Oman, Peru, Saudi Arabia, Sri Lanka, and the United Arab Emirates, by the Bedouin in Israel,UNICEF 2013, 23. in Rahmah, Jordan,Dana Charkasi, [http://www.arabwestreport.info/en/year-1999/week-32/19-female-circumcision-still-haunts-jordanian-tribe-southern-jordan \"Female circumcision still haunts Jordanian tribe in southern Jordan\"], ArabNews West, 2012. and by the Dawoodi Bohra in India.Diane Cole, [http://www.npr.org/sections/goatsandsoda/2016/02/08/466033967/unicef-estimate-of-female-genital-mutiliation-up-by-70-million \"UNICEF Estimate Of Female Genital Mutilation Up By 70 Million\"], NPR, 8 February 2016.\nPam Belluck, [https://www.nytimes.com/2017/06/10/health/genital-mutilation-muslim-dawoodi-bohra-michigan-case.html \"Michigan Case Adds U.S. Dimension to Debate on Genital Mutilation\"], The New York Times, 10 June 2017. It is also found within immigrant communities around the world.UNICEF 2013, 4.\n\nPrevalence figures for the 15–19 age group and younger show a downward trend. For example, Burkina Faso fell from 89 percent (1980) to 58 percent (2010); Egypt from 97 percent (1985) to 70 percent (2015); and Kenya from 41 percent (1984) to 11 percent (2014).UNICEF 2016, 1. From 2010 household surveys asked women about the FGM status of all their living daughters.[http://onlinelibrary.wiley.com/doi/10.1111/j.1728-4465.2013.00352.x/abstract Yoder 2013], 194; UNICEF 2013, 25. The highest concentrations among girls aged 0–14 were in Gambia (56 percent), Mauritania (54 percent), Indonesia (49 percent for 0–11) and Guinea (46 percent). The figures suggest that a girl was one third less likely in 2014 to undergo FGM than she was 30 years ago.UNICEF 2014, 2. If the rate of decline continues, the number of girls cut will nevertheless rise from 3.6 million a year in 2013 to 4.1 million in 2050 because of population growth.\n\nRural areas, wealth, education\n\nSurveys have found FGM to be more common in rural areas, less common in most countries among girls from the wealthiest homes, and (except in Sudan and Somalia) less common in girls whose mothers had access to primary or secondary/higher education. In Somalia and Sudan the situation was reversed: in Somalia the mothers' access to secondary/higher education was accompanied by a rise in prevalence of FGM in their daughters, and in Sudan access to any education was accompanied by a rise.For rural areas, UNICEF 2013, 28; for wealth, 40; for education, 41.\n\nAge, ethnicity\n\nFGM is not invariably a rite of passage between childhood and adulthood, but is often performed on much younger children.Gerry Mackie, [https://web.archive.org/web/20131029210333/http://www.polisci.ucsd.edu/~gmackie/documents/BeginningOfEndMackie2000.pdf \"Female Genital Cutting: The Beginning of the End\"], in Bettina Shell-Duncan and Ylva Hernlund (eds.), Female \"Circumcision\" in Africa: Culture Controversy and Change, Boulder: Lynne Rienner Publishers, 2000, 275. Girls are most commonly cut shortly after birth to age 15. In half the countries for which national figures were available in 2000–2010, most girls had been cut by age five.UNICEF 2013, 50. Over 80 percent (of those cut) are cut before the age of five in Nigeria, Mali, Eritrea, Ghana and Mauritania.UNICEF 2013, 47, 183. The 1997 Demographic and Health Survey in Yemen found that 76 percent of girls had been cut within two weeks of birth.[http://www.unicef-irc.org/publications/pdf/fgm_eng.pdf UNICEF 2005], 6. The percentage is reversed in Somalia, Egypt, Chad and the Central African Republic, where over 80 percent (of those cut) are cut between five and 14. Just as the type of FGM is often linked to ethnicity, so is the mean age. In Kenya, for example, the Kisi cut around age 10 and the Kamba at 16.UNICEF 2013, 51.\n\nA country's national prevalence often reflects a high sub-national prevalence among certain ethnicities, rather than a widespread practice.UNICEF 2013, 28–37. In Iraq, for example, FGM is found mostly among the Kurds in Erbil (58 percent prevalence within age group 15–49, as of 2011), Sulaymaniyah (54 percent) and Kirkuk (20 percent), giving the country a national prevalence of eight percent.[http://www.unicef.org/media/files/FGCM_Lo_res.pdf UNICEF 2013]. For eight percent in Iraq, 27, box 4.4, group 5; for the regions in Iraq, 31, map 4.6). Also see . The practice is sometimes an ethnic marker, but it may differ along national lines. For example, in the northeastern regions of Ethiopia and Kenya, which share a border with Somalia, the Somali people practise FGM at around the same rate as they do in Somalia.[http://onlinelibrary.wiley.com/doi/10.1111/j.1728-4465.2013.00352.x/abstract Yoder 2013], 196, 198. But in Guinea all Fulani women responding to a survey in 2012 said they had experienced FGM,[https://web.archive.org/web/20141220043131/http://data.unicef.org/corecode/uploads/document6/uploaded_country_profiles/corecode/30/Countries/FGMC_GIN.pdf \"Guinea\"] (2012), UNICEF statistical profile, July 2014, 2/4. against 12 percent of the Fulani in Chad, while in Nigeria the Fulani are the only large ethnic group in the country not to practise it.Chad: UNICEF 2013, 35–36; Nigeria: T. C. Okeke, et al., \"An Overview of Female Genital Mutilation in Nigeria\", Annals of Medical Health Sciences Research, 2(1), Jan–June 2012, 70–73.    FGM is practised in Nigeria by the Yoruba, Hausa, Ibo, Ijaw and Kanuri people.\n\nReasons\n\nSupport from women\n\nDahabo Musa, a Somali woman, described infibulation in a 1988 poem as the \"three feminine sorrows\": the procedure itself, the wedding night when the woman is cut open, then childbirth when she is cut again.Abdalla 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA187 187]. Despite the evident suffering, it is women who organize all forms of FGM.Olga Khazan, [https://www.theatlantic.com/international/archive/2015/04/female-genital-mutilation-cutting-anthropologist/389640/ \"Why Some Women Choose to Get Circumcised\"], The Atlantic, 8 April 2015 (interview with Bettina Shell-Duncan). Anthropologist Rose Oldfield Hayes wrote in 1975 that educated Sudanese men who did not want their daughters to be infibulated (preferring clitoridectomy) would find the girls had been sewn up after the grandmothers arranged a visit to relatives. Gerry Mackie has compared the practice to footbinding. Like FGM, footbinding was carried out on young girls, nearly universal where practised, tied to ideas about honour, chastity and appropriate marriage, and \"supported and transmitted\" by women.\n\nFGM practitioners see the procedures as marking not only ethnic boundaries but also gender difference. According to this view, male circumcision defeminizes men while FGM demasculinizes women.Rogaia Mustafa Abusharaf, \"Introduction: The Custom in Question\", in Abusharaf 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA8 8]; El Guindi 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA36 36–37]. Fuambai Ahmadu, an anthropologist and member of the Kono people of Sierra Leone, who in 1992 underwent clitoridectomy as an adult during a Sande society initiation, argued in 2000 that it is a male-centred assumption that the clitoris is important to female sexuality. African female symbolism revolves instead around the concept of the womb.Fuambai Ahmadu, \"Rites and Wrongs: An Insider/Outsider Reflects on Power and Excision,\" in Shell-Duncan and Hernlund 2000, [https://books.google.com/books?id\nrhhRXiJIGEcC&pgPA284 284–285]. Infibulation draws on that idea of enclosure and fertility. \"[G]enital cutting completes the social definition of a child's sex by eliminating external traces of androgyny,\" Janice Boddy wrote in 2007. \"The female body is then covered, closed, and its productive blood bound within; the male body is unveiled, opened and exposed.\"Janice Boddy, Civilizing Women: British Crusades in Colonial Sudan, Princeton: Princeton University Press, 2007, [https://books.google.com/books?id\nT77ui7IPNwkC&pg=PA112 112].\n\nIn communities where infibulation is common, there is a preference for women's genitals to be smooth, dry and without odour, and both women and men may find the natural vulva repulsive.Ellen Gruenbaum, \"Socio-Cultural Dynamics of Female Genital Cutting: Research Findings, Gaps, and Directions,\" Culture, Health & Sexuality, 7(5), September–October 2005, 429–441.  Men seem to enjoy the effort of penetrating an infibulation.Gruenbaum 2005, 437; Gruenbaum 2001, 140.\nJanice Boddy, Wombs and Alien Spirits: Women, Men, and the Zar Cult in Northern Sudan, Madison: University of Wisconsin Press, 1989, [https://books.google.com/books?idTK6NIp5uVwsC&pg\nPA52 52]. The local preference for dry sex causes women to introduce substances into the vagina to reduce lubrication, including leaves, tree bark, toothpaste and Vicks menthol rub.Bagnol and Mariano 2011, [https://books.google.com/books?idxSqIrrswbG0C&pg\nPA277 277–281]. The WHO includes this practice within Type IV FGM, because the added friction during intercourse can cause lacerations and increase the risk of infection.WHO 2008, 27–28. Because of the smooth appearance of an infibulated vulva, there is also a belief that infibulation increases hygiene.\n\nCommon reasons for FGM cited by women in surveys are social acceptance, religion, hygiene, preservation of virginity, marriageability and enhancement of male sexual pleasure.UNICEF 2013, 67. In a study in northern Sudan, published in 1983, only 17.4 percent of women opposed FGM (558 out of 3,210), and most preferred excision and infibulation over clitoridectomy.Asma El Dareer, [http://ije.oxfordjournals.org/content/12/2/138.abstract \"Attitudes of Sudanese People to the Practice of Female Circumcision\"], International Journal of Epidemiology, 12(2), 1983 (138–144), 140.   Attitudes are changing slowly. In Sudan in 2010, 42 percent of women who had heard of FGM said the practice should continue.UNICEF 2013, 178. In several surveys since 2006, over 50 percent of women in Mali, Guinea, Sierra Leone, Somalia, Gambia and Egypt supported FGM's continuance, while elsewhere in Africa, Iraq and Yemen most said it should end, although in several countries only by a narrow margin.\n\nSocial obligation, poor access to information\n\nAgainst the argument that women willingly choose FGM for their daughters, UNICEF calls the practice a \"self-enforcing social convention\" to which families feel they must conform to avoid uncut daughters facing social exclusion.UNICEF 2013, 15. Ellen Gruenbaum reported that, in Sudan in the 1970s, cut girls from an Arab ethnic group would mock uncut Zabarma girls with Ya, Ghalfa! (\"Hey, unclean!\"). The Zabarma girls would respond Ya, mutmura! (A mutmara was a storage pit for grain that was continually opened and closed, like an infibulated woman.) But despite throwing the insult back, the Zabarma girls would ask their mothers, \"What's the matter? Don't we have razor blades like the Arabs?\"\n\nBecause of poor access to information, and because circumcisers downplay the causal connection, women may not associate the health consequences with the procedure. Lala Baldé, president of a women's association in Medina Cherif, a village in Senegal, told Mackie in 1998 that when girls fell ill or died, it was attributed to evil spirits. When informed of the causal relationship between FGM and ill health, Mackie wrote, the women broke down and wept. He argued that surveys taken before and after this sharing of information would show very different levels of support for FGM.Mackie 2003, 147–148. The American non-profit group Tostan, founded by Molly Melching in 1991, introduced community-empowerment programmes in several countries that focus on local democracy, literacy, and education about healthcare, giving women the tools to make their own decisions.Diop et al. (UNICEF) 2008. In 1997, using the Tostan programme, Malicounda Bambara in Senegal became the first village to abandon FGM.Mackie 2000, 256ff. By 2018 over 8,000 communities in eight countries had pledged to abandon FGM and child marriage.[http://www.tostan.org/female-genital-cutting \"Female Genital Cutting\"], Tostan, accessed 6 February 2018.\n\nReligion\n\nSurveys have shown a widespread belief, particularly in Mali, Mauritania, Guinea and Egypt, that FGM is a religious requirement.UNICEF 2013, 69–71. Gruenbaum has argued that practitioners may not distinguish between religion, tradition and chastity, making it difficult to interpret the data.Gruenbaum 2001, [https://books.google.com/books?idJOXmOLBd4E4C&pg\nPA50 50]; Mackie and LeJeune (UNICEF) 2008, 8–9. FGM's origins in northeastern Africa are pre-Islamic, but the practice became associated with Islam because of that religion's focus on female chastity and seclusion. There is no mention of it in the Quran. It is praised in a few daʻīf (weak) hadith (sayings attributed to Muhammad) as noble but not required.Roald, Anne-Sofie (2003). Women in Islam: The Western Experience Routledge, 224. Asmani and Abdi (USAID) 2008, 6–13. In 2007 the Al-Azhar Supreme Council of Islamic Research in Cairo ruled that FGM had \"no basis in core Islamic law or any of its partial provisions\".UNICEF press release, 2 July 2007; UNICEF 2013, 70.\n\nThere is no mention of FGM in the Bible.Samuel Waje Kunhiyop, African Christian Ethics, Zondervan, 2008, 297: \"Nowhere in all of Scripture or in any of recorded church history is there even a hint that women were to be circumcised.\" Christian missionaries in Africa were among the first to object to FGM,Jocelyn Murray, \"The Church Missionary Society and the 'Female Circumcision' Issue in Kenya 1929–1932,\" Journal of Religion in Africa, 8(2), 1976, 92–104.  but Christian communities in Africa do practise it. A 2013 UNICEF report identified 17 African countries in which at least 10 percent of Christian women and girls aged 15 to 49 had undergone FGM; in Niger 55 percent of Christian women and girls had experienced it, compared with two percent of their Muslim counterparts.UNICEF 2013, front page and 73. The only Jewish group known to have practised it are the Beta Israel of Ethiopia. Judaism requires male circumcision, but does not allow FGM.Shaye J. D. Cohen, Why Aren't Jewish Women Circumcised? Gender and Covenant In Judaism, Berkeley: University of California Press, 2005, [https://books.google.com/books?idPmL-LogqJ-YC&pg\nPA59 59].\nAdele Berlin (ed.), \"Circumcision\", The Oxford Dictionary of the Jewish Religion, New York: Oxford University Press, 2011, [https://books.google.com/books?idhKAaJXvUaUoC&pg\nPA173 173]. FGM is also practised by animist groups, particularly in Guinea and Mali.UNICEF 2013, 175.\n\nHistory\n\nAntiquity\n\nThe practice's origins are unknown, but its east-west, north-south distribution in Africa meets in Sudan. Gerry Mackie has suggested that infibulation began there with the Meroite civilization (c. 800 BCE – c. 350 CE), before the rise of Islam, to increase confidence in paternity.Mackie 2000, 264, 267; Shell-Duncan and Hernlund 2000, [https://books.google.com/books?idrhhRXiJIGEcC&pg\nPA13 13].Also see C. G. Seligman, \"Aspects of the Hamitic problems in the Anglo-Egyptian Sudan\",The Journal of the Royal Anthropological Institute of Great Britain and Ireland, 1913, 40(3) (593–705), 639–646. \nEsther K. Hicks, Infibulation: Female Mutilation in Islamic Northeastern Africa, Transaction Publishers, 1996, [https://books.google.com/books?idogWxTnAulzEC&pg\nPA19 19ff]. According to historian Mary Knight, Spell 1117 (c. 1991–1786 BCE) of the Ancient Egyptian Coffin Texts may refer in hieroglyphs to an uncircumcised girl (m't):\n\na-m-a:X1-D53-B1\n\nThe spell was found on the sarcophagus of Sit-hedjhotep, now in the Egyptian Museum, and dates to Egypt's Middle Kingdom. (Paul F. O'Rourke argues that m't probably refers instead to a menstruating woman.)Paul F. O'Rourke, [http://www.degruyter.com/dg/viewarticle/j$002fzaes.2007.134.issue-2$002fzaes.2007.134.2.166$002fzaes.2007.134.2.166.xml \"The 'm't-Woman\"], Zeitschrift für Ägyptische Sprache und Altertumskunde, 134(2), February 2007 (166–172), 166ff (hieroglyphs), 172 (menstruating woman).  The proposed circumcision of an Egyptian girl, Tathemis, is also mentioned on a Greek papyrus, from 163 BCE, in the British Museum: \"Sometime after this, Nephoris [Tathemis's mother] defrauded me, being anxious that it was time for Tathemis to be circumcised, as is the custom among the Egyptians.\"\n\nThe examination of mummies has shown no evidence of FGM. Citing the Australian pathologist Grafton Elliot Smith, who examined hundreds of mummies in the early 20th century, Knight writes that the genital area may resemble Type III because during mummification the skin of the outer labia was pulled toward the anus to cover the pudendal cleft, possibly to prevent sexual violation. It was similarly not possible to determine whether Types I or II had been performed, because soft tissues had deteriorated or been removed by the embalmers., citing G. Elliot Smith, A Contribution to the Study of Mummification in Egypt, Cairo: L'Institut Egyptien, 1906, 30, and Marc Armand Ruffer, Studies in the Paleopathology of Egypt, Chicago: University of Chicago Press, 1921, 171.\n\nThe Greek geographer Strabo (c. 64 BCE – c. 23 CE) wrote about FGM after visiting Egypt around 25 BCE: \"This is one of the customs most zealously pursued by them [the Egyptians]: to raise every child that is born and to circumcise [peritemnein] the males and excise [ektemnein] the females ...\"Strabo, Geographica, c. 25 BCE, cited in  Philo of Alexandria (c. 20 BCE – 50 CE) also made reference to it: \"the Egyptians by the custom of their country circumcise the marriageable youth and maid in the fourteenth (year) of their age, when the male begins to get seed, and the female to have a menstrual flow.\" It is mentioned briefly in a work attributed to the Greek physician Galen (129 – c. 200 CE): \"When [the clitoris] sticks out to a great extent in their young women, Egyptians consider it appropriate to cut it out.\" Another Greek physician, Aëtius of Amida (mid-5th to mid-6th century CE), offered more detail in book 16 of his Sixteen Books on Medicine, citing the physician Philomenes. The procedure was performed in case the clitoris, or nymphê, grew too large or triggered sexual desire when rubbing against clothing. \"On this account, it seemed proper to the Egyptians to remove it before it became greatly enlarged,\" Aëtius wrote, \"especially at that time when the girls were about to be married\":\n\nThe surgery is performed in this way: Have the girl sit on a chair while a muscled young man standing behind her places his arms below the girl's thighs. Have him separate and steady her legs and whole body. Standing in front and taking hold of the clitoris with a broad-mouthed forceps in his left hand, the surgeon stretches it outward, while with the right hand, he cuts it off at the point next to the pincers of the forceps.\n\nIt is proper to let a length remain from that cut off, about the size of the membrane that's between the nostrils, so as to take away the excess material only; as I have said, the part to be removed is at that point just above the pincers of the forceps. Because the clitoris is a skinlike structure and stretches out excessively, do not cut off too much, as a urinary fistula may result from cutting such large growths too deeply.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Female genital mutilation" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11408" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Female genital mutilation (FGM), also known as female genital cutting and female circumcision, is the ritual cutting or removal of some or all of the external female genitalia. The practice is found in Africa, Asia and the Middle East, and within communities from countries in which FGM is common. UNICEF estimated in 2016 that 200 million women living today in 30 countries—27 African countries, Indonesia, Iraqi Kurdistan and Yemen—have undergone the procedures.\n\nTypically carried out by a traditional circumciser using a blade, FGM is conducted from days after birth to puberty and beyond. In half the countries for which national figures are available, most girls are cut before the age of five.For the circumcisers, blade: UNICEF 2013, 2, 44–46; for the ages: 50. Procedures differ according to the country or ethnic group. They include removal of the clitoral hood and clitoral glans; removal of the inner labia; and removal of the inner and outer labia and closure of the vulva. In this last procedure, known as infibulation, a small hole is left for the passage of urine and menstrual fluid; the vagina is opened for intercourse and opened further for childbirth.\n\nThe practice is rooted in gender inequality, attempts to control women's sexuality, and ideas about purity, modesty and beauty. It is usually initiated and carried out by women, who see it as a source of honour, and who fear that failing to have their daughters and granddaughters cut will expose the girls to social exclusion.UNICEF 2013, 15.\nNahid F. Toubia, Eiman Hussein Sharief, \"Female genital mutilation: have we made progress?\", International Journal of Gynecology & Obstetrics, 82(3), September 2003, 251–261.   Health effects depend on the procedure. They can include recurrent infections, difficulty urinating and passing menstrual flow, chronic pain, the development of cysts, an inability to get pregnant, complications during childbirth, and fatal bleeding. There are no known health benefits.WHO 2017.\n\nThere have been international efforts since the 1970s to persuade practitioners to abandon FGM, and it has been outlawed or restricted in most of the countries in which it occurs, although the laws are poorly enforced. Since 2010 the United Nations has called upon healthcare providers to stop performing all forms of the procedure, including reinfibulation after childbirth and symbolic \"nicking\" of the clitoral hood.UN 2010; Ian Askew, et al. [http://jme.bmj.com/content/42/9/619.long \"A repeat call for complete abandonment of FGM\"], BMJ Journal of Medical Ethics, 0, 2016, 1–2.    The opposition to the practice is not without its critics, particularly among anthropologists, who have raised difficult questions about cultural relativism and the universality of human rights.Bettina Shell-Duncan, \"From Health to Human Rights: Female Genital Cutting and the Politics of Intervention\", American Anthropologist, New Series, 110(2), June 2008, 225–236.  \n\nTerminology\n\nUntil the 1980s FGM was widely known in English as female circumcision, implying an equivalence in severity with male circumcision.Martha Nussbaum, Sex and Social Justice, New York: Oxford University Press, 1999, [https://books.google.com/books?id7zoaKIolT9oC&pg\nPA119 119]. From 1929 the Kenya Missionary Council referred to it as the sexual mutilation of women, following the lead of Marion Scott Stevenson, a Church of Scotland missionary.James Karanja, The Missionary Movement in Colonial Kenya: The Foundation of Africa Inland Church, Göttingen: Cuvillier Verlag, 2009, [https://books.google.com/books?idF1ezIgyomGIC&pg\nPA93 93], n. 631. References to the practice as mutilation increased throughout the 1970s.WHO 2008, 4, 22. In 1975 Rose Oldfield Hayes, an American anthropologist, used the term female genital mutilation in the title of a paper in American Ethnologist,Rose Oldfield Hayes, \"Female Genital Mutilation, Fertility Control, Women's Roles, and the Patrilineage in Modern Sudan: A Functional Analysis,\" American Ethnologist 2(4), November 1975, 617–633.  and four years later Fran Hosken, an Austrian-American feminist writer, called it mutilation in her influential The Hosken Report: Genital and Sexual Mutilation of Females.Fran Hosken, The Hosken Report: Genital and Sexual Mutilation of Females, Lexington: Women's International Network, 1994 [1979].Claire C. Robertson, \"Getting beyond the Ew! Factor: Rethinking U.S. Approaches to African Female Genital Cutting\", in Stanlie M. James and Claire C. Robertson (eds.), Genital Cutting and Transnational Sisterhood, Urbana: University of Illinois Press, 2002 (54–86), [https://books.google.com/books?id\nt_5a39rTNB8C&pgPA60 60]. The Inter-African Committee on Traditional Practices Affecting the Health of Women and Children began referring to it as female genital mutilation in 1990, and the World Health Organization (WHO) followed suit in 1991.UNICEF 2013, 6–7. Other English terms include female genital cutting (FGC) and female genital mutilation/cutting (FGM/C), preferred by those who work with practitioners.\n\nIn countries where FGM is common, the practice's many variants are reflected in dozens of terms, often alluding to purification.UNICEF 2013, 48. In the Bambara language, spoken mostly in Mali, it is known as bolokoli (\"washing your hands\")Chantal Zabus, \"The Excised Body in African Texts and Contexts,\" in Merete Falck Borch (ed.), Bodies and Voices: The Force-field of Representation and Discourse in Colonial and Postcolonial Studies, New York: Rodopi, 2008, [https://books.google.com/books?id\nxZmWF3qxHo4C&pgPA47 47]. and in the Igbo language in eastern Nigeria as isa aru or iwu aru (\"having your bath\"). A common Arabic term for purification has the root t-h-r, used for male and female circumcision (tahur and tahara).Fadwa El Guindi, \"Had This Been Your Face, Would You Leave It as Is?\" in Rogaia Mustafa Abusharaf (ed.), Female Circumcision: Multicultural Perspectives, Philadelphia: University of Pennsylvania Press, 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA30 30]. It is also known in Arabic as khafḍ or khifaḍ. Communities may refer to FGM as \"pharaonic\" for infibulation and sunna circumcision for everything else.Ellen Gruenbaum, The Female Circumcision Controversy: An Anthropological Perspective, Philadelphia: University of Pennsylvania Press, 2001, 2–3. Sunna means \"path or way\" in Arabic and refers to the tradition of Muhammad, although none of the procedures are required within Islam.Ibrahim Lethome Asmani, Maryam Sheikh Abdi, [http://www.unfpa.org/sites/default/files/pub-pdf/De-linking%20FGM%20from%20Islam%20final%20report.pdf De-linking Female Genital Mutilation/Cutting from Islam], Washington: Frontiers in Reproductive Health, USAID, 2008, 3–5. The term infibulation derives from fibula, Latin for clasp—the Ancient Romans reportedly fastened clasps through the foreskins or labia of slaves to prevent sexual intercourse. The surgical infibulation of women came to be known as pharaonic circumcision in Sudan, but as Sudanese circumcision in Egypt.Leonard J. Kouba, Judith Muasher, \"Female Circumcision in Africa: An Overview,\" African Studies Review, 28(1), March 1985 (95–1100), 96–97.  In Somalia it is known simply as qodob (\"to sew up\").Raqiya D. Abdalla, My Grandmother Called it the Three Feminine Sorrows': The Struggle of Women Against Female Circumcision in Somalia\", in Abusharaf 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA190 190].\n\nMethods\n\nThe procedures are generally performed by a traditional circumciser (cutter or exciseuse) in the girls' homes, with or without anaesthesia. The cutter is usually an older woman, but in communities where the male barber has assumed the role of health worker he will perform FGM too.UNICEF 2013, 42–44 and table 5, 181 (for cutters), 46 (for home and anaesthesia). When traditional cutters are involved, non-sterile devices are likely to be used, including knives, razors, scissors, glass, sharpened rocks and fingernails.Elizabeth Kelly, Paula J. Adams Hillard, [http://journals.lww.com/co-obgyn/Abstract/2005/10000/Female_genital_mutilation.9.aspx \"Female genital mutilation\"], Current Opinion in Obstetrics & Gynecology, 17(5), October 2005, 490–494.  According to a nurse in Uganda, quoted in 2007 in The Lancet, a cutter would use one knife on up to 30 girls at a time.Wairagala Wakabi, [http://www.thelancet.com/journals/lancet/article/PIIS0140-6736(07)60508-X/fulltext \"Africa battles to make female genital mutilation history\"], The Lancet, 369 (9567), 31 March 2007, 1069–1070.   Health professionals are often involved in Egypt, Kenya, Indonesia and Sudan. In Egypt 77 percent of FGM procedures, and in Indonesia over 50 percent, were performed by medical professionals as of 2008 and 2016.UNICEF 2013, 43–45. Women in Egypt reported in 1995 that a local anaesthetic had been used on their daughters in 60 percent of cases, a general anaesthetic in 13 percent, and neither in 25 percent (two percent were missing/don't know).UNICEF 2013, 46.\n\nClassification\n\nVariation\n\nThe WHO, UNICEF and UNFPA issued a joint statement in 1997 defining FGM as \"all procedures involving partial or total removal of the external female genitalia or other injury to the female genital organs whether for cultural or other non-therapeutic reasons\". The procedures vary considerably according to ethnicity and individual practitioners. During a 1998 survey in Niger, women responded with over 50 different terms when asked what was done to them. Translation problems are compounded by the women's confusion over which type of FGM they experienced, or even whether they experienced it.P. Stanley Yoder, Shanxiao Wang, Elise Johansen, \"Estimates of Female Genital Mutilation/Cutting in 27 African Countries and Yemen\", Studies in Family Planning, 44(2), June 2013 (189–204), 190.   Several studies have suggested that survey responses are unreliable. A 2003 study in Ghana found that in 1995 four percent said they had not undergone FGM, but in 2000 said they had, while 11 percent switched in the other direction.Elizabeth F. Jackson, et al., \"Inconsistent reporting of female genital cutting status in northern Ghana: Explanatory factors and analytical consequences\", Studies in Family Planning, 34(3), 2003, 200–210.  In Tanzania in 2005, 66 percent reported FGM, but a medical exam found that 73 percent had undergone it.Elise Klouman, Rachel Manongi, Knut-Inge Klepp, [http://onlinelibrary.wiley.com/doi/10.1111/j.1365-3156.2004.01350.x/full \"Self-reported and observed female genital cutting in rural Tanzania: Associated demographic factors, HIV and sexually transmitted infections\"], Tropical Medicine and International Health 10(1), 2005, 105–115.   In Sudan in 2006, a significant percentage of infibulated women and girls reported a less severe type.Susan Elmusharaf, Nagla Elhadi, Lars Almroth, [http://www.bmj.com/content/333/7559/124.full \"Reliability of self reported form of female genital mutilation and WHO classification: cross sectional study\"], British Medical Journal, 332(7559), 27 June 2006.   \n\nTypes\n\nStandard questionnaires from United Nations bodies ask women whether they or their daughters have undergone the following: (1) cut, no flesh removed (pricking or symbolic circumcision); (2) cut, some flesh removed; (3) sewn closed; or (4) type not determined/unsure/doesn't know. The most common procedures fall within the \"cut, some flesh removed\" category and involve complete or partial removal of the clitoral glans.[http://onlinelibrary.wiley.com/doi/10.1111/j.1728-4465.2013.00352.x/abstract Yoder 2013], 189; UNICEF 2013, 47. The World Health Organization (a UN agency) created a more detailed typology. Types I–III vary in how much tissue is removed; Type III is the UNICEF category \"sewn closed\". Type IV describes miscellaneous procedures, including symbolic circumcision.Jasmine Abdulcadir, et al., \"Female Genital Mutilation: A Visual Reference and Learning Tool for Health Care Professionals\"], Obstetrics & Gynecology, 128(5), November 2016, 958–963.  WHO 2008, 4, 23–28.\n\nType I is \"partial or total removal of the clitoris and/or the prepuce\". Type Ia (circumcision)WHO 2016, [https://www.ncbi.nlm.nih.gov/books/NBK368486/box/ch1.box1 Box 1.1 \"Types of FGM\"]. involves removal of the clitoral hood only. This is rarely performed alone. The more common procedure is Type Ib (clitoridectomy), the complete or partial removal of the clitoral glans (the visible tip of the clitoris) and clitoral hood.WHO 2008, 4. The circumciser pulls the clitoral glans with her thumb and index finger and cuts it off.\n\nType II (excision) is the complete or partial removal of the inner labia, with or without removal of the clitoral glans and outer labia. Type IIa is removal of the inner labia; Type IIb, removal of the clitoral glans and inner labia; and Type IIc, removal of the clitoral glans, inner and outer labia. Excision in French can refer to any form of FGM.\n\nType III (infibulation or pharaonic circumcision), the \"sewn closed\" category, involves the removal of the external genitalia and fusion of the wound. The inner and/or outer labia are cut away, with or without removal of the clitoral glans. Type III is found largely in northeast Africa, particularly Djibouti, Eritrea, Ethiopia, Somalia, and Sudan (although not in South Sudan). According to one 2008 estimate, over eight million women in Africa are living with Type III FGM. According to UNFPA in 2010, 20 percent of women with FGM have been infibulated.[http://www.unfpa.org/resources/promoting-gender-equality \"Frequently Asked Questions on Female Genital Mutilation/Cutting\"], United Nations Population Fund, April 2010. In Somalia \"[t]he child is made to squat on a stool or mat facing the circumciser at a height that offers her a good view of the parts to be handled. ... adult helpers grab and pull apart the legs of the girl. ... If available, this is the stage at which a local anaesthetic would be used\":\n\nThe element of speed and surprise is vital and the circumciser immediately grabs the clitoris by pinching it between her nails aiming to amputate it with a slash. The organ is then shown to the senior female relatives of the child who will decide whether the amount that has been removed is satisfactory or whether more is to be cut off. \n\nAfter the clitoris has been satisfactorily amputated ... the circumciser can proceed with the total removal of the labia minora and the paring of the inner walls of the labia majora. Since the entire skin on the inner walls of the labia majora has to be removed all the way down to the perineum, this becomes a\nmessy business. By now, the child is screaming, struggling, and bleeding profusely, which makes it difficult for the circumciser to hold with bare fingers and nails the slippery skin and parts that are to be cut or sutured together. ...\n\nHaving ensured that sufficient tissue has been removed to allow the desired fusion of the skin, the circumciser pulls together the opposite sides of the labia majora, ensuring that the raw edges where the skin has been removed are well approximated. The wound is now ready to be stitched or for thorns to be applied. If a needle and thread are being used, close tight sutures will be placed to ensure that a flap of skin covers the vulva and extends from the mons veneris to the perineum, and which, after the wound heals, will form a bridge of scar tissue that will totally occlude the vaginal introitus.Edna Adan Ismail, et al. [http://www.ednahospital.org/fgm/wp-content/uploads/FGM-Survey-in-Somaliland-Edna-Adan-Hospital-1.pdf \"Female genital mutilation survey in Somaliland\"], Edna Adan Maternity and Teaching Hospital, 2006–2013, 12.\n\nThe amputated parts might be placed in a pouch for the girl to wear.El Guindi 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA43 43]. A single hole of 2–3 mm is left for the passage of urine and menstrual fluid. The vulva is closed with surgical thread, or agave or acacia thorns, and might be covered with a poultice of raw egg, herbs and sugar. To help the tissue bond, the girl's legs are tied together, often from hip to ankle; the bindings are usually loosened after a week and removed after two to six weeks.Ismail 2016, 14. If the remaining hole is too large in the view of the girl's family, the procedure is repeated.\n\nThe vagina is opened for sexual intercourse, for the first time either by a midwife with a knife or by the woman's husband with his penis.Abdalla 2007, [https://books.google.com/books?id\n8VQxt634pfcC&pgPA190 190–191], [https://books.google.com/books?id\n8VQxt634pfcC&pg=PA198 198]. In some areas, including Somaliland, female relatives of the bride and groom might watch the opening of the vagina to check that the girl is a virgin.Ismail 2016, 14. \nThe woman is opened further for childbirth (defibulation or deinfibulation), and closed again afterwards (reinfibulation). Reinfibulation can involve cutting the vagina again to restore the pinhole size of the first infibulation. This might be performed before marriage, and after childbirth, divorce and widowhood.Asma El Dareer, Woman, Why Do You Weep: Circumcision and its Consequences, London: Zed Press, 1982, 56–64.\nAlso see Rebecca J. Cooke, Bernard M. Dickens, \"Special commentary on the issue of reinfibulation\", International Journal of Gynaecology and Obstetrics, 109(2), May 2010, 97–99.  \nGamal I. Serour, [http://www.ijgo.org/article/S0020-7292%2810%2900010-X/fulltext \"The issue of reinfibulation\"], International Journal of Gynaecology and Obstetrics, 109(2), May 2010, 93–96.   Hanny Lightfoot-Klein interviewed hundreds of women and men in Sudan in the 1980s about sexual intercourse with Type III:\n\nThe penetration of the bride's infibulation takes anywhere from 3 or 4 days to several months. Some men are unable to penetrate their wives at all (in my study over 15%), and the task is often accomplished by a midwife under conditions of great secrecy, since this reflects negatively on the man's potency. Some who are unable to penetrate their wives manage to get them pregnant in spite of the infibulation, and the woman's vaginal passage is then cut open to allow birth to take place. ... Those men who do manage to penetrate their wives do so often, or perhaps always, with the help of the \"little knife\". This creates a tear which they gradually rip more and more until the opening is sufficient to admit the penis.Hanny Lightfoot-Klein, \"The Sexual Experience and Marital Adjustment of Genitally Circumcised and Infibulated Females in The Sudan\"], The Journal of Sex Research, 26(3), 1989 (375–392), 380. ; Also see El Dareer 1982, 42–49.\n\nType IV is \"[a]ll other harmful procedures to the female genitalia for non-medical purposes\", including pricking, piercing, incising, scraping and cauterization. It includes nicking of the clitoris (symbolic circumcision), burning or scarring the genitals, and introducing substances into the vagina to tighten it.WHO 2008, 24.UNICEF 2013, 7. Labia stretching is also categorized as Type IV.WHO 2008, 27. Common in southern and eastern Africa, the practice is supposed to enhance sexual pleasure for the man and add to the sense of a woman as a closed space. From the age of eight, girls are encouraged to stretch their inner labia using sticks and massage. Girls in Uganda are told they may have difficulty giving birth without stretched labia.For the countries in which labia stretching is found (Botswana, Lesotho, Malawi, Mozambique, Namibia, South Africa, Tanzania, Uganda and Zimbabwe), see Nkiru Nzegwu, \"'Osunality' (or African eroticism)\" in Sylvia Tamale (ed.), African Sexualities: A Reader, Cape Town: Fahamu/Pambazuka, 2011, [https://books.google.com/books?id\nxSqIrrswbG0C&pg=PA262 262].\nFor the rest, Brigitte Bagnol and Esmeralda Mariano, \"Politics of Naming Sexual Practices\", in Tamale 2011, [https://books.google.com/books?idxSqIrrswbG0C&pg\nPA272 272–276] (272 for Uganda).\n\nA definition of FGM from the WHO in 1995 included gishiri cutting and angurya cutting, found in Nigeria and Niger. These were removed from the WHO's 2008 definition because of insufficient information about prevalence and consequences.WHO 2008, 27. Angurya cutting is excision of the hymen, usually performed seven days after birth. Gishiri cutting involves cutting the vagina's front or back wall with a blade or penknife, performed in response to infertility, obstructed labour and other conditions. In a study by Nigerian physician Mairo Usman Mandara, over 30 percent of women with gishiri cuts were found to have vesicovaginal fistulae (holes that allow urine to seep into the vagina).Mairo Usman Mandara, \"Female genital cutting in Nigeria: View of Nigerian Doctors on the Medicalization Debate\", in Bettina Shell-Duncan and Ylva Hernlund (eds.), Female \"Circumcision\" in Africa: Culture Controversy and Change, Boulder: Lynne Rienner Publishers, 2000, [https://books.google.com/books?id\nrhhRXiJIGEcC&pg=PA98 98], 100; for fistulae, 102.\nMairo Usman Mandara, \"Female genital mutilation in Nigeria\", International Journal of Gynecology & Obstetrics, 84(3), 291–298.  \n\nComplications\n\nShort-term and late\n\nFGM harms women's physical and emotional health throughout their lives.Rigmor C. Berg, et al., [http://bmjopen.bmj.com/content/4/11/e006316.full \"Effects of female genital cutting on physical health outcomes: a systematic review and meta-analysis\"], BMJ Open, 4(11), 2014: e006316.   It has no known health benefits. The short-term and late complications depend on the type of FGM, whether the practitioner has had medical training, and whether they used antibiotics and sterilized or single-use surgical instruments. In the case of Type III, other factors include how small a hole was left for the passage of urine and menstrual blood, whether surgical thread was used instead of agave or acacia thorns, and whether the procedure was performed more than once (for example, to close an opening regarded as too wide or re-open one too small).\n\nCommon short-term complications include swelling, excessive bleeding, pain, urine retention, and healing problems/wound infection. A 2015 systematic review of 56 studies that recorded immediate complications suggested that each of these occurred in more than one in ten girls and women undergoing any form of FGM, including symbolic nicking of the clitoris (Type IV), although the risks increased with Type III. The review also suggested that there was under-reporting.Rigmor C. Berg, Vigdis Underland, [http://www.kunnskapssenteret.no/en/publications/immediate-health-consequences-of-female-genital-mutilation-cutting-fgm-c \"Immediate health consequences of female genital mutilation/cutting (FGM/C)\"], Kunnskapssenteret (Norwegian Knowledge Centre for the Health Services), 2014, 4–5. Other short-term complications include fatal bleeding, anaemia, urinary infection, septicaemia, tetanus, gangrene, necrotizing fasciitis (flesh-eating disease), and endometritis.\nChristos Iavazzo, Thalia A. Sardi, Ioannis D. Gkegkes, [https://link.springer.com/article/10.1007%2Fs00404-012-2708-5 \"Female genital mutilation and infections: a systematic review of the clinical evidence\"], Archives of Gynecology and Obstetrics, 287(6), June 2013, 1137–1149.   It is not known how many girls and women die as a result of the practice, because complications may not be recognized or reported. The practitioners' use of shared instruments is thought to aid the transmission of hepatitis B, hepatitis C and HIV, although no epidemiological studies have shown this.\n\nLate complications vary depending on the type of FGM. They include the formation of scars and keloids that lead to strictures and obstruction, epidermoid cysts that may become infected, and neuroma formation (growth of nerve tissue) involving nerves that supplied the clitoris.Amish J. Dave, Aisha Sethi, Aldo Morrone, [http://www.sciencedirect.com/science/article/pii/S0733863510001439 \"Female Genital Mutilation: What Every American Dermatologist Needs to Know\"], Dermatologic Clinics, 29(1), January 2011, 103–109.   An infibulated girl may be left with an opening as small as 2–3 mm, which can cause prolonged, drop-by-drop urination, pain while urinating, and a feeling of needing to urinate all the time. Urine may collect underneath the scar, leaving the area under the skin constantly wet, which can lead to infection and the formation of small stones. The opening is larger in women who are sexually active or have given birth by vaginal delivery, but the urethra opening may still be obstructed by scar tissue. Vesicovaginal or rectovaginal fistulae can develop (holes that allow urine or faeces to seep into the vagina).Hamid Rushwan, [http://www.sciencedirect.com/science/article/pii/S1110570413000520 \"Female genital mutilation: A tragedy for women's reproductive health\"], African Journal of Urology, 19(3), September 2013, 130–133.  This and other damage to the urethra and bladder can lead to infections and incontinence, pain during sexual intercourse and infertility. Painful periods are common because of the obstruction to the menstrual flow, and blood can stagnate in the vagina and uterus. Complete obstruction of the vagina can result in hematocolpos and hematometra (where the vagina and uterus fill with menstrual blood). The swelling of the abdomen that results from the collection of fluid, together with the lack of menstruation, can lead to suspicion of pregnancy; Asma El Dareer, a Sudanese physician, reported in 1979 that a girl in Sudan with this condition was killed by her family.El Dareer 1982, 37. Also see Asma El Dareer, \"Preliminary report on a study on prevalence and epidemiology of female circumcision in Sudan today\", WHO seminar, Khartoum, 10–15 February 1979; Asma el Dareer, \"Female circumcision and its consequences for mother and child\", Yaounde, 12–15 December 1979, cited in [http://www.sciencedirect.com/science/article/pii/S1110570413000520 Rushwan 2013].\n\nPregnancy, childbirth\n\nFGM may place women at higher risk of problems during pregnancy and childbirth, which are more common with the more extensive FGM procedures. Infibulated women may try to make childbirth easier by eating less during pregnancy to reduce the baby's size. In women with vesicovaginal or rectovaginal fistulae, it is difficult to obtain clear urine samples as part of prenatal care, making the diagnosis of conditions such as pre-eclampsia harder. Cervical evaluation during labour may be impeded and labour prolonged or obstructed. Third-degree laceration (tears), anal-sphincter damage and emergency caesarean section are more common in infibulated women.Mumtaz Rashid, Mohammed H. Rashid, [http://onlinelibrary.wiley.com/doi/10.1576/toag.9.2.095.27310/pdf \"Obstetric management of women with female genital mutilation\"], The Obstetrician & Gynaecologist, 9(2), April 2007, 95–101. \n\nNeonatal mortality is increased. The WHO estimated in 2006 that an additional 10–20 babies die per 1,000 deliveries as a result of FGM. The estimate was based on a study conducted on 28,393 women attending delivery wards at 28 obstetric centres in Burkina Faso, Ghana, Kenya, Nigeria, Senegal and Sudan. In those settings all types of FGM were found to pose an increased risk of death to the baby: 15 percent higher for Type I, 32 percent for Type II, and 55 percent for Type III. The reasons for this were unclear, but may be connected to genital and urinary tract infections and the presence of scar tissue. The researchers wrote that FGM was associated with an increased risk to the mother of damage to the perineum and excessive blood loss, as well as a need to resuscitate the baby, and stillbirth, perhaps because of a long second stage of labour.Emily Banks, et al., [http://www.who.int/reproductivehealth/publications/fgm/fgm-obstetric-study-en.pdf?ua\n1 \"Female genital mutilation and obstetric outcome: WHO collaborative prospective study in six African countries\"], The Lancet, 367(9525), 3 June 2006, 1835–1841.  [http://www.who.int/mediacentre/news/releases/2006/pr30/en/index.html \"New study shows female genital mutilation exposes women and babies to significant risk at childbirth\"], World Health Organization, 2 June 2006.\n\nPsychological effects, sexual function\n\nAccording to a 2015 systematic review there is little high-quality information available on the psychological effects of FGM. Several small studies have concluded that women with FGM suffer from anxiety, depression and post-traumatic stress disorder. Feelings of shame and betrayal can develop when women leave the culture that practises FGM and learn that their condition is not the norm, but within the practising culture they may view their FGM with pride, because for them it signifies beauty, respect for tradition, chastity and hygiene. Studies on sexual function have also been small. A 2013 meta-analysis of 15 studies involving 12,671 women from seven countries concluded that women with FGM were twice as likely to report no sexual desire and 52 percent more likely to report dyspareunia (painful sexual intercourse). One third reported reduced sexual feelings.; ; S. Sibiani and A. A. Rouzi, [http://www.fertstert.org/article/S0015-0282%2808%2901813-X/fulltext \"Sexual function in women with female genital mutilation\"], Fertility and Sterility, 93(3), September 2008, 722–724. \n\nDistribution\n\nHousehold surveys\n\nAid agencies define the prevalence of FGM as the percentage of the 15–49 age group that has exerienced it.[http://onlinelibrary.wiley.com/doi/10.1111/j.1728-4465.2013.00352.x/abstract Yoder 2013], 193. These figures are based on nationally representative household surveys known as Demographic and Health Surveys (DHS), developed by Macro International and funded mainly by the United States Agency for International Development (USAID), and Multiple Indicator Cluster Surveys (MICS) conducted with financial and technical help from UNICEF. These surveys have been carried out in Africa, Asia, Latin America and elsewhere roughly every five years, since 1984 and 1995 respectively.[http://www.dhsprogram.com/What-We-Do/Survey-Types/DHS.cfm \"DHS overview\"], Demographic and Health Surveys; [http://www.childinfo.org/mics5_questionnaire.html \"Questionnaires and Indicator List\"], Multiple Indicator Cluster Surveys, UNICEF. The first to ask about FGM was the 1989–1990 DHS in northern Sudan. The first publication to estimate FGM prevalence based on DHS data (in seven countries) was by Dara Carr of Macro International in 1997.[https://www.ncbi.nlm.nih.gov/pubmed/23720002 Yoder, Wang and Johansen, 2013], 191; Dara Carr, Female genital cutting: Findings from the Demographic and Health Surveys program, Calverton, MD: Macro International Inc., 1997.\n\nType of FGM\n\nWomen are asked during the surveys: \"Was the genital area just nicked/cut without removing any flesh? Was any flesh (or something) removed from the genital area? Was your genital area sewn?\"UNICEF 2013, 134–135. Most women report \"cut, some flesh removed\" (Types I and II).UNICEF 2013, 47, table 5.2; .\n\nType I is the most common form in Egypt, and in the southern parts of Nigeria. Type III (infibulation) is concentrated in northeastern Africa, particularly Djibouti, Eritrea, Somalia and Sudan.Yoder 2008, 13–14. In surveys in 2002–2006, 30 percent of cut girls in Djibouti, 38 percent in Eritrea, and 63 percent in Somalia had experienced Type III.UNICEF 2013, 47. For the years and country profiles: Djibouti, UNICEF, December 2013; Eritrea, UNICEF, July 2013; Somalia, UNICEF, December 2013. There is also a high prevalence of infibulation among girls in Niger and Senegal,UNICEF 2013, 114. and in 2013 it was estimated that in Nigeria three percent of the 0–14 age group had been infibulated.Nigeria, UNICEF, July 2014. The type of procedure is often linked to ethnicity. In Eritrea, for example, a survey in 2002 found that all Hedareb girls had been infibulated, compared with two percent of the Tigrinya, most of whom fell into the \"cut, no flesh removed\" category.\n\nPrevalence\n\nFGM is found mostly in what Gerry Mackie called an \"intriguingly contiguous\" zone in Africa—east to west from Somalia to Senegal, and north to south from Egypt to Tanzania.Mackie and LeJeune (UNICEF) 2008, 5. Nationally representative figures are available for 27 countries in Africa, as well as Indonesia, Iraqi Kurdistan and Yemen. Over 200 million women and girls are thought to be living with FGM in those 30 countries.UNICEF Indonesia, February 2016.\n\nThe highest concentrations among the 15–49 age group are in Somalia (98 percent), Guinea (97 percent), Djibouti (93 percent), Egypt (91 percent) and Sierra Leone (90 percent).UNICEF 2014, 89–90. As of 2013, 27.2 million women had undergone FGM in Egypt, 23.8 million in Ethiopia, and 19.9 million in Nigeria.UNICEF 2013, 2. There is also a high concentration in Indonesia, where Type I (clitoridectomy) and Type IV [symbolic nicking]) are practised. The Indonesian Ministry of Health and the Indonesian Ulema Council both say that the clitoris should not be cut. The prevalence rate for the 0–11 group in Indonesia is 49 percent (13.4 million). Smaller studies or anecdotal reports suggest that FGM is also practised in Colombia, the Congo, Malaysia, Oman, Peru, Saudi Arabia, Sri Lanka, and the United Arab Emirates, by the Bedouin in Israel,UNICEF 2013, 23. in Rahmah, Jordan,Dana Charkasi, [http://www.arabwestreport.info/en/year-1999/week-32/19-female-circumcision-still-haunts-jordanian-tribe-southern-jordan \"Female circumcision still haunts Jordanian tribe in southern Jordan\"], ArabNews West, 2012. and by the Dawoodi Bohra in India.Diane Cole, [http://www.npr.org/sections/goatsandsoda/2016/02/08/466033967/unicef-estimate-of-female-genital-mutiliation-up-by-70-million \"UNICEF Estimate Of Female Genital Mutilation Up By 70 Million\"], NPR, 8 February 2016.\nPam Belluck, [https://www.nytimes.com/2017/06/10/health/genital-mutilation-muslim-dawoodi-bohra-michigan-case.html \"Michigan Case Adds U.S. Dimension to Debate on Genital Mutilation\"], The New York Times, 10 June 2017. It is also found within immigrant communities around the world.UNICEF 2013, 4.\n\nPrevalence figures for the 15–19 age group and younger show a downward trend. For example, Burkina Faso fell from 89 percent (1980) to 58 percent (2010); Egypt from 97 percent (1985) to 70 percent (2015); and Kenya from 41 percent (1984) to 11 percent (2014).UNICEF 2016, 1. From 2010 household surveys asked women about the FGM status of all their living daughters.[http://onlinelibrary.wiley.com/doi/10.1111/j.1728-4465.2013.00352.x/abstract Yoder 2013], 194; UNICEF 2013, 25. The highest concentrations among girls aged 0–14 were in Gambia (56 percent), Mauritania (54 percent), Indonesia (49 percent for 0–11) and Guinea (46 percent). The figures suggest that a girl was one third less likely in 2014 to undergo FGM than she was 30 years ago.UNICEF 2014, 2. If the rate of decline continues, the number of girls cut will nevertheless rise from 3.6 million a year in 2013 to 4.1 million in 2050 because of population growth.\n\nRural areas, wealth, education\n\nSurveys have found FGM to be more common in rural areas, less common in most countries among girls from the wealthiest homes, and (except in Sudan and Somalia) less common in girls whose mothers had access to primary or secondary/higher education. In Somalia and Sudan the situation was reversed: in Somalia the mothers' access to secondary/higher education was accompanied by a rise in prevalence of FGM in their daughters, and in Sudan access to any education was accompanied by a rise.For rural areas, UNICEF 2013, 28; for wealth, 40; for education, 41.\n\nAge, ethnicity\n\nFGM is not invariably a rite of passage between childhood and adulthood, but is often performed on much younger children.Gerry Mackie, [https://web.archive.org/web/20131029210333/http://www.polisci.ucsd.edu/~gmackie/documents/BeginningOfEndMackie2000.pdf \"Female Genital Cutting: The Beginning of the End\"], in Bettina Shell-Duncan and Ylva Hernlund (eds.), Female \"Circumcision\" in Africa: Culture Controversy and Change, Boulder: Lynne Rienner Publishers, 2000, 275. Girls are most commonly cut shortly after birth to age 15. In half the countries for which national figures were available in 2000–2010, most girls had been cut by age five.UNICEF 2013, 50. Over 80 percent (of those cut) are cut before the age of five in Nigeria, Mali, Eritrea, Ghana and Mauritania.UNICEF 2013, 47, 183. The 1997 Demographic and Health Survey in Yemen found that 76 percent of girls had been cut within two weeks of birth.[http://www.unicef-irc.org/publications/pdf/fgm_eng.pdf UNICEF 2005], 6. The percentage is reversed in Somalia, Egypt, Chad and the Central African Republic, where over 80 percent (of those cut) are cut between five and 14. Just as the type of FGM is often linked to ethnicity, so is the mean age. In Kenya, for example, the Kisi cut around age 10 and the Kamba at 16.UNICEF 2013, 51.\n\nA country's national prevalence often reflects a high sub-national prevalence among certain ethnicities, rather than a widespread practice.UNICEF 2013, 28–37. In Iraq, for example, FGM is found mostly among the Kurds in Erbil (58 percent prevalence within age group 15–49, as of 2011), Sulaymaniyah (54 percent) and Kirkuk (20 percent), giving the country a national prevalence of eight percent.[http://www.unicef.org/media/files/FGCM_Lo_res.pdf UNICEF 2013]. For eight percent in Iraq, 27, box 4.4, group 5; for the regions in Iraq, 31, map 4.6). Also see . The practice is sometimes an ethnic marker, but it may differ along national lines. For example, in the northeastern regions of Ethiopia and Kenya, which share a border with Somalia, the Somali people practise FGM at around the same rate as they do in Somalia.[http://onlinelibrary.wiley.com/doi/10.1111/j.1728-4465.2013.00352.x/abstract Yoder 2013], 196, 198. But in Guinea all Fulani women responding to a survey in 2012 said they had experienced FGM,[https://web.archive.org/web/20141220043131/http://data.unicef.org/corecode/uploads/document6/uploaded_country_profiles/corecode/30/Countries/FGMC_GIN.pdf \"Guinea\"] (2012), UNICEF statistical profile, July 2014, 2/4. against 12 percent of the Fulani in Chad, while in Nigeria the Fulani are the only large ethnic group in the country not to practise it.Chad: UNICEF 2013, 35–36; Nigeria: T. C. Okeke, et al., \"An Overview of Female Genital Mutilation in Nigeria\", Annals of Medical Health Sciences Research, 2(1), Jan–June 2012, 70–73.    FGM is practised in Nigeria by the Yoruba, Hausa, Ibo, Ijaw and Kanuri people.\n\nReasons\n\nSupport from women\n\nDahabo Musa, a Somali woman, described infibulation in a 1988 poem as the \"three feminine sorrows\": the procedure itself, the wedding night when the woman is cut open, then childbirth when she is cut again.Abdalla 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA187 187]. Despite the evident suffering, it is women who organize all forms of FGM.Olga Khazan, [https://www.theatlantic.com/international/archive/2015/04/female-genital-mutilation-cutting-anthropologist/389640/ \"Why Some Women Choose to Get Circumcised\"], The Atlantic, 8 April 2015 (interview with Bettina Shell-Duncan). Anthropologist Rose Oldfield Hayes wrote in 1975 that educated Sudanese men who did not want their daughters to be infibulated (preferring clitoridectomy) would find the girls had been sewn up after the grandmothers arranged a visit to relatives. Gerry Mackie has compared the practice to footbinding. Like FGM, footbinding was carried out on young girls, nearly universal where practised, tied to ideas about honour, chastity and appropriate marriage, and \"supported and transmitted\" by women.\n\nFGM practitioners see the procedures as marking not only ethnic boundaries but also gender difference. According to this view, male circumcision defeminizes men while FGM demasculinizes women.Rogaia Mustafa Abusharaf, \"Introduction: The Custom in Question\", in Abusharaf 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA8 8]; El Guindi 2007, [https://books.google.com/books?id8VQxt634pfcC&pg\nPA36 36–37]. Fuambai Ahmadu, an anthropologist and member of the Kono people of Sierra Leone, who in 1992 underwent clitoridectomy as an adult during a Sande society initiation, argued in 2000 that it is a male-centred assumption that the clitoris is important to female sexuality. African female symbolism revolves instead around the concept of the womb.Fuambai Ahmadu, \"Rites and Wrongs: An Insider/Outsider Reflects on Power and Excision,\" in Shell-Duncan and Hernlund 2000, [https://books.google.com/books?id\nrhhRXiJIGEcC&pgPA284 284–285]. Infibulation draws on that idea of enclosure and fertility. \"[G]enital cutting completes the social definition of a child's sex by eliminating external traces of androgyny,\" Janice Boddy wrote in 2007. \"The female body is then covered, closed, and its productive blood bound within; the male body is unveiled, opened and exposed.\"Janice Boddy, Civilizing Women: British Crusades in Colonial Sudan, Princeton: Princeton University Press, 2007, [https://books.google.com/books?id\nT77ui7IPNwkC&pg=PA112 112].\n\nIn communities where infibulation is common, there is a preference for women's genitals to be smooth, dry and without odour, and both women and men may find the natural vulva repulsive.Ellen Gruenbaum, \"Socio-Cultural Dynamics of Female Genital Cutting: Research Findings, Gaps, and Directions,\" Culture, Health & Sexuality, 7(5), September–October 2005, 429–441.  Men seem to enjoy the effort of penetrating an infibulation.Gruenbaum 2005, 437; Gruenbaum 2001, 140.\nJanice Boddy, Wombs and Alien Spirits: Women, Men, and the Zar Cult in Northern Sudan, Madison: University of Wisconsin Press, 1989, [https://books.google.com/books?idTK6NIp5uVwsC&pg\nPA52 52]. The local preference for dry sex causes women to introduce substances into the vagina to reduce lubrication, including leaves, tree bark, toothpaste and Vicks menthol rub.Bagnol and Mariano 2011, [https://books.google.com/books?idxSqIrrswbG0C&pg\nPA277 277–281]. The WHO includes this practice within Type IV FGM, because the added friction during intercourse can cause lacerations and increase the risk of infection.WHO 2008, 27–28. Because of the smooth appearance of an infibulated vulva, there is also a belief that infibulation increases hygiene.\n\nCommon reasons for FGM cited by women in surveys are social acceptance, religion, hygiene, preservation of virginity, marriageability and enhancement of male sexual pleasure.UNICEF 2013, 67. In a study in northern Sudan, published in 1983, only 17.4 percent of women opposed FGM (558 out of 3,210), and most preferred excision and infibulation over clitoridectomy.Asma El Dareer, [http://ije.oxfordjournals.org/content/12/2/138.abstract \"Attitudes of Sudanese People to the Practice of Female Circumcision\"], International Journal of Epidemiology, 12(2), 1983 (138–144), 140.   Attitudes are changing slowly. In Sudan in 2010, 42 percent of women who had heard of FGM said the practice should continue.UNICEF 2013, 178. In several surveys since 2006, over 50 percent of women in Mali, Guinea, Sierra Leone, Somalia, Gambia and Egypt supported FGM's continuance, while elsewhere in Africa, Iraq and Yemen most said it should end, although in several countries only by a narrow margin.\n\nSocial obligation, poor access to information\n\nAgainst the argument that women willingly choose FGM for their daughters, UNICEF calls the practice a \"self-enforcing social convention\" to which families feel they must conform to avoid uncut daughters facing social exclusion.UNICEF 2013, 15. Ellen Gruenbaum reported that, in Sudan in the 1970s, cut girls from an Arab ethnic group would mock uncut Zabarma girls with Ya, Ghalfa! (\"Hey, unclean!\"). The Zabarma girls would respond Ya, mutmura! (A mutmara was a storage pit for grain that was continually opened and closed, like an infibulated woman.) But despite throwing the insult back, the Zabarma girls would ask their mothers, \"What's the matter? Don't we have razor blades like the Arabs?\"\n\nBecause of poor access to information, and because circumcisers downplay the causal connection, women may not associate the health consequences with the procedure. Lala Baldé, president of a women's association in Medina Cherif, a village in Senegal, told Mackie in 1998 that when girls fell ill or died, it was attributed to evil spirits. When informed of the causal relationship between FGM and ill health, Mackie wrote, the women broke down and wept. He argued that surveys taken before and after this sharing of information would show very different levels of support for FGM.Mackie 2003, 147–148. The American non-profit group Tostan, founded by Molly Melching in 1991, introduced community-empowerment programmes in several countries that focus on local democracy, literacy, and education about healthcare, giving women the tools to make their own decisions.Diop et al. (UNICEF) 2008. In 1997, using the Tostan programme, Malicounda Bambara in Senegal became the first village to abandon FGM.Mackie 2000, 256ff. By 2018 over 8,000 communities in eight countries had pledged to abandon FGM and child marriage.[http://www.tostan.org/female-genital-cutting \"Female Genital Cutting\"], Tostan, accessed 6 February 2018.\n\nReligion\n\nSurveys have shown a widespread belief, particularly in Mali, Mauritania, Guinea and Egypt, that FGM is a religious requirement.UNICEF 2013, 69–71. Gruenbaum has argued that practitioners may not distinguish between religion, tradition and chastity, making it difficult to interpret the data.Gruenbaum 2001, [https://books.google.com/books?idJOXmOLBd4E4C&pg\nPA50 50]; Mackie and LeJeune (UNICEF) 2008, 8–9. FGM's origins in northeastern Africa are pre-Islamic, but the practice became associated with Islam because of that religion's focus on female chastity and seclusion. There is no mention of it in the Quran. It is praised in a few daʻīf (weak) hadith (sayings attributed to Muhammad) as noble but not required.Roald, Anne-Sofie (2003). Women in Islam: The Western Experience Routledge, 224. Asmani and Abdi (USAID) 2008, 6–13. In 2007 the Al-Azhar Supreme Council of Islamic Research in Cairo ruled that FGM had \"no basis in core Islamic law or any of its partial provisions\".UNICEF press release, 2 July 2007; UNICEF 2013, 70.\n\nThere is no mention of FGM in the Bible.Samuel Waje Kunhiyop, African Christian Ethics, Zondervan, 2008, 297: \"Nowhere in all of Scripture or in any of recorded church history is there even a hint that women were to be circumcised.\" Christian missionaries in Africa were among the first to object to FGM,Jocelyn Murray, \"The Church Missionary Society and the 'Female Circumcision' Issue in Kenya 1929–1932,\" Journal of Religion in Africa, 8(2), 1976, 92–104.  but Christian communities in Africa do practise it. A 2013 UNICEF report identified 17 African countries in which at least 10 percent of Christian women and girls aged 15 to 49 had undergone FGM; in Niger 55 percent of Christian women and girls had experienced it, compared with two percent of their Muslim counterparts.UNICEF 2013, front page and 73. The only Jewish group known to have practised it are the Beta Israel of Ethiopia. Judaism requires male circumcision, but does not allow FGM.Shaye J. D. Cohen, Why Aren't Jewish Women Circumcised? Gender and Covenant In Judaism, Berkeley: University of California Press, 2005, [https://books.google.com/books?idPmL-LogqJ-YC&pg\nPA59 59].\nAdele Berlin (ed.), \"Circumcision\", The Oxford Dictionary of the Jewish Religion, New York: Oxford University Press, 2011, [https://books.google.com/books?idhKAaJXvUaUoC&pg\nPA173 173]. FGM is also practised by animist groups, particularly in Guinea and Mali.UNICEF 2013, 175.\n\nHistory\n\nAntiquity\n\nThe practice's origins are unknown, but its east-west, north-south distribution in Africa meets in Sudan. Gerry Mackie has suggested that infibulation began there with the Meroite civilization (c. 800 BCE – c. 350 CE), before the rise of Islam, to increase confidence in paternity.Mackie 2000, 264, 267; Shell-Duncan and Hernlund 2000, [https://books.google.com/books?idrhhRXiJIGEcC&pg\nPA13 13].Also see C. G. Seligman, \"Aspects of the Hamitic problems in the Anglo-Egyptian Sudan\",The Journal of the Royal Anthropological Institute of Great Britain and Ireland, 1913, 40(3) (593–705), 639–646. \nEsther K. Hicks, Infibulation: Female Mutilation in Islamic Northeastern Africa, Transaction Publishers, 1996, [https://books.google.com/books?idogWxTnAulzEC&pg\nPA19 19ff]. According to historian Mary Knight, Spell 1117 (c. 1991–1786 BCE) of the Ancient Egyptian Coffin Texts may refer in hieroglyphs to an uncircumcised girl (m't):\n\na-m-a:X1-D53-B1\n\nThe spell was found on the sarcophagus of Sit-hedjhotep, now in the Egyptian Museum, and dates to Egypt's Middle Kingdom. (Paul F. O'Rourke argues that m't probably refers instead to a menstruating woman.)Paul F. O'Rourke, [http://www.degruyter.com/dg/viewarticle/j$002fzaes.2007.134.issue-2$002fzaes.2007.134.2.166$002fzaes.2007.134.2.166.xml \"The 'm't-Woman\"], Zeitschrift für Ägyptische Sprache und Altertumskunde, 134(2), February 2007 (166–172), 166ff (hieroglyphs), 172 (menstruating woman).  The proposed circumcision of an Egyptian girl, Tathemis, is also mentioned on a Greek papyrus, from 163 BCE, in the British Museum: \"Sometime after this, Nephoris [Tathemis's mother] defrauded me, being anxious that it was time for Tathemis to be circumcised, as is the custom among the Egyptians.\"\n\nThe examination of mummies has shown no evidence of FGM. Citing the Australian pathologist Grafton Elliot Smith, who examined hundreds of mummies in the early 20th century, Knight writes that the genital area may resemble Type III because during mummification the skin of the outer labia was pulled toward the anus to cover the pudendal cleft, possibly to prevent sexual violation. It was similarly not possible to determine whether Types I or II had been performed, because soft tissues had deteriorated or been removed by the embalmers., citing G. Elliot Smith, A Contribution to the Study of Mummification in Egypt, Cairo: L'Institut Egyptien, 1906, 30, and Marc Armand Ruffer, Studies in the Paleopathology of Egypt, Chicago: University of Chicago Press, 1921, 171.\n\nThe Greek geographer Strabo (c. 64 BCE – c. 23 CE) wrote about FGM after visiting Egypt around 25 BCE: \"This is one of the customs most zealously pursued by them [the Egyptians]: to raise every child that is born and to circumcise [peritemnein] the males and excise [ektemnein] the females ...\"Strabo, Geographica, c. 25 BCE, cited in  Philo of Alexandria (c. 20 BCE – 50 CE) also made reference to it: \"the Egyptians by the custom of their country circumcise the marriageable youth and maid in the fourteenth (year) of their age, when the male begins to get seed, and the female to have a menstrual flow.\" It is mentioned briefly in a work attributed to the Greek physician Galen (129 – c. 200 CE): \"When [the clitoris] sticks out to a great extent in their young women, Egyptians consider it appropriate to cut it out.\" Another Greek physician, Aëtius of Amida (mid-5th to mid-6th century CE), offered more detail in book 16 of his Sixteen Books on Medicine, citing the physician Philomenes. The procedure was performed in case the clitoris, or nymphê, grew too large or triggered sexual desire when rubbing against clothing. \"On this account, it seemed proper to the Egyptians to remove it before it became greatly enlarged,\" Aëtius wrote, \"especially at that time when the girls were about to be married\":\n\nThe surgery is performed in this way: Have the girl sit on a chair while a muscled young man standing behind her places his arms below the girl's thighs. Have him separate and steady her legs and whole body. Standing in front and taking hold of the clitoris with a broad-mouthed forceps in his left hand, the surgeon stretches it outward, while with the right hand, he cuts it off at the point next to the pincers of the forceps.\n\nIt is proper to let a length remain from that cut off, about the size of the membrane that's between the nostrils, so as to take away the excess material only; as I have said, the part to be removed is at that point just above the pincers of the forceps. Because the clitoris is a skinlike structure and stretches out excessively, do not cut off too much, as a urinary fistula may result from cutting such large growths too deeply. Female genital mutilation. http://en.wikipedia.org/?curid=11408."
  }
}
