{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16319",
  "eid" : "2568c680-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778572008,
  "textBody" : "John Edward Masefield, OM (; 1 June 1878 – 12 May 1967) English poet and writer, was Poet Laureate of the United Kingdom from 1930. Among his best known works are the children's novels The Midnight Folk and The Box of Delights, and the poems \"The Everlasting Mercy\" and \"Sea-Fever\".\n\nBiography\n\nEarly life\n\nMasefield was born in Ledbury in Herefordshire, to Caroline and George Masefield, a solicitor. His mother died giving birth to his sister when Masefield was only six, and he went to live with his aunt. His father died soon after following a mental breakdown.[http://www.jrank.org/literature/pages/9694/John-%28Edward%29-Masefield.html Masefield Biography] After an unhappy education at the King's School in Warwick (now known as Warwick School), where he was a boarder between 1888 and 1891, he left to board , both to train for a life at sea, and to break his addiction to reading, of which his aunt thought little. He spent several years aboard this ship and found that he could spend much of his time reading and writing. It was aboard the Conway that Masefield's love for story-telling grew. While on the ship, he listened to the stories told about sea lore. He continued to read, and felt that he was to become a writer and story teller himself.\n\nIn 1894, Masefield boarded the Gilcruix, destined for Chile – this first voyage bringing him the experience of sea sickness. He recorded his experiences while sailing through the extreme weather, his journal entries reflecting a delight in seeing flying fish, porpoises, and birds, and was awed by the beauty of nature, including a rare sighting of a nocturnal rainbow on his voyage. On reaching Chile, Masefield suffered from sunstroke and was hospitalised. He eventually returned home to England as a passenger aboard a steam ship. In 1895, Masefield returned to sea on a windjammer destined for New York City. However, the urge to become a writer and the hopelessness of life as a sailor overtook him, and in New York, he deserted ship. He lived as a vagrant for several months, drifting between odd jobs, eventually finding work as an assistant to a bar keeper, before finally returning to New York City.\n\nSometime around Christmas 1895, Masefield read the December edition of Truth, a New York periodical, which contained the poem \"The Piper of Arll\" by Duncan Campbell Scott.[http://www.canadianpoetry.ca/confederation/DCScott/labour_and_the_angel.htm#piper The Piper of Arll] Ten years later, Masefield wrote to Scott to tell him what reading that poem had meant to him: \"I had never (till that time) cared very much for poetry, but your poem impressed me deeply, and set me on fire. Since then poetry has been the one deep influence in my life, and to my love of poetry I owe all my friends, and the position I now hold.\"John Coldwell Adams, \"[http://www.canadianpoetry.ca/confederation/John%20Coldwell%20Adams/Confederation%20Voices/chapter%205.html Duncan Campbell Scott]\", Confederation Voices, Canadian Poetry, 30 March 2011.\n\nFor the next two years, Masefield was employed by the huge Alexander Smith carpet factory in Yonkers, New York, where long hours were expected and conditions were far from ideal. He purchased up to 20 books a week, and devoured both modern and classical literature. His interests at this time were diverse and his reading included works by George du Maurier, Dumas, Thomas Browne, Hazlitt, Dickens, Kipling, and R. L. Stevenson. Chaucer also became very important to him during this time, as well as poetry by Keats and Shelley. He eventually returned home to England in 1897Stapleton, M; The Cambridge Guide to English Literature, Cambridge University Press, 1983, p571 as a passenger aboard a steam ship. When Masefield was 23, he met his future wife, Constance de la Cherois Crommelin, who was 35 and of Huguenot descent. Educated in classics and English Literature, and a mathematics teacher, Constance was a good match despite the difference in age.  The couple had two children (Judith, born in 1904, and Lewis, in 1910).[http://ies.sas.ac.uk/cmps/Projects/Masefield/Society/jms2.htm John Masefield Society, A Biography]  In 1902 he was in charge of the fine art section of the Arts and Industrial Exhibition in Wolverhampton.\n\nBy the time he was 24, Masefield's poems were being published in periodicals and his first collected works, Salt-Water Ballads (1902) was published, the poem \"Sea-Fever\" appearing in this book.  Masefield then wrote the novels, Captain Margaret (1908) and Multitude and Solitude (1909).  In 1911, after a long drought of poem writing, he composed \"The Everlasting Mercy\", the first of his narrative poems, and within the next year had produced two more, \"The Widow in the Bye Street\" and \"Dauber\".  As a result, he became widely known to the public and was praised by the critics; in 1912, he was awarded the annual Edmond de Polignac prize.[http://www.publishingcentral.com/masefield/biography.html Self-published Blog on Masefield Biog]\n\nWorld War I to appointment as Poet Laureate\n\nWhen World War I began, although old enough to be exempted from military service, Masefield joined the staff of a British hospital for French soldiers, Hôpital Temporaire d'Arc-en-Barrois, Haute-Marne, France, serving briefly in 1915 as a hospital orderly, later publishing his own account of his experiences.  At about this time, Masefield moved his country retreat from Buckinghamshire to Lollingdon Farm in Cholsey, Berkshire, a setting that inspired a number of poems and sonnets under the title Lollingdon Downs, and which his family used until 1917.\n\nAfter returning home, Masefield was invited to the United States on a three-month lecture tour.  Although their primary purpose was to lecture on English Literature, he also intended to collect information on the mood and views of Americans regarding the war in Europe.  When he returned to England, he submitted a report to the British Foreign Office, and suggested that he should be allowed to write a book about the failure of the allied efforts in the Dardanelles, which possibly could be used in the United States to counter what he thought was German propaganda there. The resulting work Gallipoli was a success, encouraging the British people, lifting them somewhat from the disappointment they had felt as a result of the Allied losses in the Dardanelles.  Due to the success of his wartime writings, Masefield met with the head of British Military Intelligence in France and was asked to write an account of the Battle of the Somme.  Although Masefield had grand ideas for his book, he was denied access to the official records, and therefore, what was to be the preface was published as The Old Front Line, a description of the geography of the Somme area.\n\nIn 1918 Masefield returned to America on his second lecture tour, spending much of his time speaking and lecturing to American soldiers waiting to be sent to Europe.  These speaking engagements were very successful, and on one occasion, a battalion of black soldiers danced and sang for him after his talk.  During this tour, he matured as a public speaker and realised his ability to touch the emotions of his audience with his style of speaking, learning to speak publicly with his own heart, rather than from dry scripted speeches.  Towards the end of his trip, both Yale and Harvard Universities conferred honorary Doctorates of Letters on him.\n\nMasefield entered the 1920s as an accomplished and respected writer. His family was able to settle on Boar's Hill, a somewhat rural setting not far from Oxford, where Masefield took up beekeeping, goat-herding and poultry-keeping. He continued to meet with success, the 1923 edition of Collected Poems selling approximately 80,000 copies. He produced three poems early in this decade.  The first was Reynard The Fox (1920), a poem that has been critically compared with works of Geoffrey Chaucer, not necessarily to Masefield's credit. This was followed by Right Royal and King Cole, poems where the relationship of humanity and nature were emphasised. While Reynard is the best known of these, all met with acclaim.\n\nAfter King Cole, Masefield turned away from the long poem and back to the novel, and from 1924 till the start of World War II published 12 novels, which vary from stories of the sea (The Bird of Dawning, Victorious Troy) to social novels about modern England (The Hawbucks, The Square Peg), and from tales of an imaginary land in Central America (Sard Harker, Odtaa) to fantasies for children (The Midnight Folk, The Box of Delights). This variety in genre testifies most impressively to the breadth of his imagination, though it probably reduced his sales (which remained very respectable, however), since most readers of novels like knowing what to expect from their favourite authors. In this same period he wrote a large number of dramatic pieces. Most of these were based on Christian themes, and Masefield, to his amazement, encountered a ban on the performance of plays on biblical subjects that went back to the Reformation and had been revived a generation earlier to prevent production of Oscar Wilde's Salome. However, a compromise was reached, and in 1928 his \"The Coming of Christ\" was the first play to be performed in an English Cathedral since the Middle Ages.[http://www.publishingcentral.com/masefield/biography.html Self-published Blog on Masefield Biog – middle life ]\n\nPoetry associations\n\nIn 1921, Masefield received an Honorary Doctorate of Literature from the University of Oxford. In 1923, he organised Oxford Recitations, an annual contest whose purpose was \"to discover good speakers of verse and to encourage 'the beautiful speaking of poetry'.\" Given the numbers of contest applicants, the event's promotion of natural speech in poetical recitations, and the number of people learning how to listen to poetry, Oxford Recitations was generally deemed a success. Masefield was similarly a founding member in Scotland, in 1924, of the Scottish Association for the Speaking of Verse. He later came to question whether the Oxford events should continue as a contest, considering that they might better be run as a festival. However, in 1929, after he broke with the competitive element, Oxford Recitations came to an end. The Scottish Association for the Speaking of Verse, on the other hand, continued to develop through the influence of associated figures such as Marion Angus and Hugh MacDiarmid and exists today as the Poetry Association of Scotland.\n\nLater years and death\n\nIn 1930, on the death of Robert Bridges, a new Poet Laureate was needed. Many felt that Rudyard Kipling was a likely choice; however, upon the recommendation of Prime Minister Ramsay MacDonald, King George V appointed Masefield, who remained in office until his death in 1967. The only person to hold the office for a longer period was Alfred, Lord Tennyson. On his appointment The Times newspaper said of him: \"... his poetry could touch to beauty the plain speech of everyday life\".The Times, 1930. Although the requirements of Poet Laureate had changed, and those in the office were rarely required to write verse for special occasions, Masefield took his appointment seriously and produced a large quantity of verse. Poems composed in his official capacity were sent to The Times. Masefield's modesty was shown by inclusion of a stamped envelope with each submission so that his composition could be returned if it were found unacceptable for publication. Later he was commissioned to write a poem to be set to music by the Master of the King's Musick, Sir Edward Elgar, and performed at the unveiling of the Queen Alexandra Memorial by the King on 8 June 1932. This was the ode \"So many true Princesses who have gone\".\n\nAfter his appointment, Masefield was awarded the Order of Merit by King George V and many honorary degrees from British universities, in 1937 being elected as President of the Society of Authors. Masefield encouraged the continued development of English literature and poetry, and began the annual awarding of the Royal Medals for Poetry for a first or second published edition of poetry by a poet under the age of 35.  Additionally, his speaking engagements were calling him further away, often on much longer tours, yet he still produced significant amounts of work in a wide variety of genres. To those he had already used he now added autobiography, producing New Chum, In the Mill, and So Long to Learn. Some critics judged Masefield to be an even finer writer of prose than of verse.\n\nIt was not until about the age of 70 that Masefield slowed his pace due to illness.  In 1960, Constance died at 93, after a long illness. Although her death was heartrending, he had spent a tiring year watching the woman he loved die. He continued his duties as Poet Laureate; In Glad Thanksgiving, his last book, was published when he was 88 years old. In late 1966, Masefield developed gangrene in his ankle. This spread to his leg, and he died of the infection on 12 May 1967. According to his wishes, he was cremated and his ashes placed in Poets' Corner in Westminster Abbey. Later, the following verse was discovered, written by Masefield, addressed to his \"Heirs, Administrators, and Assigns\":\n\nLet no religious rite be done or read\nIn any place for me when I am dead,\nBut burn my body into ash, and scatter\nThe ash in secret into running water,\nOr on the windy down, and let none see;\nAnd then thank God that there's an end of me.\n[http://www.publishingcentral.com/masefield/biography.html Self-published Blog on Masefield Biog –  Later Life]\n\nThe Masefield Centre at Warwick School, which Masefield attended, and a high school in Ledbury, Herefordshire, have been named in his honour. In 1977, Folkways Records released an album of his poetry, including some read by Masefield himself.[http://www.folkways.si.edu/albumdetails.aspx?itemid=1739 John Masefield Reads His Poetry]\n\nArt song settings\n\nIn addition to the commission for Queen Alexandra's Memorial Ode with music by Elgar, many of Masefield's short poems were set as art songs by British composers of the time.For a list of settings, see: [http://www.lieder.net/lieder/m/masefield/ 'John Masefield'] at The Lied, Art Song, and Choral Texts Archive, www.recmusic.org. Retrieved 4 November 2011. Best known by far is John Ireland's \"Sea Fever\", the lasting popularity of which belies any mismatch between the urgency of the language and the slow, swung melody.Hold, Trevor (2002). Parry to Finzi: twenty English song composers, [https://books.google.com/books?idL_NS-he4Rx0C&printsec\nfrontcover&dqtrevor+hold+parry+finzi&hl\nen&eiLiW0ToLCH4Xs-gbDuZmFBg&sa\nX&oibook_result&ct\nresult&resnum1&ved\n0CDMQ6AEwAA#vonepage&q\n%22sea%20fever%22&ffalse pp 15, 193–194]. The Boydell Press. Retrieved 4 November 2011. Frederick Keel crafted several songs drawn from the Salt-Water Ballads and elsewhere. Of these, \"Trade Winds\" was particularly popular in its day,Foreman, Lewis (2011). [http://www.tandfonline.com/doi/abs/10.1080/19475020.2011.555470 'In Ruhleben camp']. First World War Studies, Vol 2, No 1 (March), pp 27–40. Retrieved 4 November 2011 . despite the tongue-twisting challenges the text presents to the singer.Conor O'Callaghan (2006). [http://www.poetryfoundation.org/poetrymagazine/article/177754 'John Masefield']. Poetry, March 2006. Retrieved 4 November 2011. Keel's defiant setting of \"Tomorrow\", written while interned at Ruhleben during World War I, was frequently programmed at the BBC Proms after the war.[http://www.bbc.co.uk/proms/archive/search/performance_find.shtml?tab\nsearch&sub_tabwork&work_id\n12685&from1890&to\n2011. 'Frederick Keel — Tomorrow' at the BBC Proms archive]. Retrieved 4 November 2011. Another memorable wartime composition is Ivor Gurney's climactic declamation of \"By a bierside\", a setting quickly set down in 1916 during a brief spell behind the lines.Dunnett, Roderick (2009). [http://www.naxos.com/mainsite/blurbs_reviews.asp?item_code8.572151&catNum\n572151&filetypeAbout%20this%20Recording&language\nEnglish# 'Ivor Gurney (1890–1937): Songs'] [CD booklet notes]. Naxos Records. Retrieved 4 November 2011.\n\nSelected works\n\nPoetry collections \n\n*[https://archive.org/details/saltwaterballads00maserich Salt-Water Ballads (1902)]*[https://books.google.com/books?ido4BfjuI8UUUC The Columbia Anthology of British Poetry (2005) By Carl Woodring, James S. Shapiro, Columbia University Press, p. 737][https://books.google.com/books?id\n43oBE1nJXaMC Cambridge Paperback Guide to Literature in English (1996) by Ian Ousby, Cambridge University Press, p. 252]\n*[https://archive.org/details/ballads00maserich Ballads (1903)]\n*Ballads and Poems (1910)\n*[https://archive.org/details/everlastingmercy00maserich The Everlasting Mercy (1911)]\n*[https://archive.org/details/widowinbyestreet00mase The Widow in the Bye Street (1912)]\n*[https://archive.org/details/dauberpoem00maserich Dauber (1912)]\n*[https://archive.org/details/storyofroundhous00ma The Story of a Round House and Other Poems (1912)]\n*[https://archive.org/details/daffodilfields00masegoog The Daffodil Fields (1913)]\n*[https://archive.org/details/philipkingandot00masegoog Philip the King and Other Poems (1914)]\n*Salt-Water Poems and Ballads (1916)\n*[https://archive.org/details/sonnetsandpoems00masegoog Sonnets and Poems (1916)]\n*[https://archive.org/stream/lollingdondownsoth00maseuoft/lollingdondownsoth00maseuoft_djvu.txt Lollingdon Downs and Other Poems with Sonnets (1917)]\n*[https://archive.org/details/rosasmasefield00maserich Rosas (1918)]\n*[https://archive.org/details/reynardfox00mase Reynard the Fox (1920)]\n*[https://archive.org/details/enslavedotherpoe00mase Enslaved and Other Poems (1920)]\n*[https://archive.org/details/kingcolebyjohn00maserich King Cole (1921)]\n*Selected Poems (1922)\n*The Dream and Other Poems (1922)\n*King Cole and Other Poems (1923)\n*The Collected Poems of John Masefield (1923)\n*Poems (1925)\n*Midsummer Night and Other Tales in Verse (1928)\n*A Letter from Pontus and Other Verse (1936)\n*The Country Scene (1937)\n*Some Verses to Some Germans (1939)\n*The Bluebells and Other Verses (1961)\n*Old Raiger and Other Verses (1964)\n*In Glad Thanksgiving (1966)\n*The West Wind (1963)\n\nNovels\n\n* [https://archive.org/details/amainsailhaul02masegoog A Mainsail Haul (1905)]\n*[https://archive.org/details/tarpaulinmuster00maserich A Tarpaulin Muster (short stories) (1907)]\n*Captain Margaret (1908)\n*Multitude and Solitude (1909)\n*Martin Hyde: The Duke's Messenger (1910)\n*Lost Endeavour (Nelson, 1910).\n* [https://archive.org/details/bookofdiscoverie00maserich A Book of Discoveries (children's novel) (1910)]\n*The Street of Today (1911)\n*Jim Davis (Wells Gardner, 1911).\n*Sard Harker (Heinemann, 1924)\n*ODTAA  (1926)\n*The Midnight Folk (children's novel) (1927)\n*The Hawbucks (1929)\n*The Bird of Dawning (Heinemann, 1933).\n*The Taking of the Gry (1934)\n*The Box of Delights: or When the Wolves Were Running (children's novel) (1935)\n*Victorious Troy: or The Harrying Angel (1935)\n*Eggs and Baker (1936)\n*The Square Peg: or The Gun Fella (1937)\n*Dead Ned (1938)\n*Live and Kicking Ned (1939)\n*Basilissa: A Tale of the Empress Theodora (1940)\n*Conquer: A Tale of the Nika Rebellion in Byzantium (1941)\n*Badon Parchments (1947)\n\nPlays\n\n*The Campden Wonder (1907)\n*The Tragedy of Pompey the Great (1910)\n*Philip the King (1914)\n*Good Friday: A Play in Verse (1916)\n*The Tragedy of Nan (Originally known as Nan)\n*The Witch (1926) (trans. from the Norwegian play Anne Pedersdotter by Hans Wiers-Jenssen)\n*Tristan and Isolt (1927)\n*The Coming of Christ (1928)\n\nNon-fiction and autobiographical\n\n* [https://archive.org/details/sealifeinnelsons00maserich Sea Life in Nelson's Time (1905)]\n*[https://archive.org/details/gallipoligun00mase Gallipoli (1916)]\n* The Old Front Line (1917)\n*[https://archive.org/details/battleofsomme00maserich The Battle of the Somme (1919)]\n* The Wanderer of Liverpool (1930)[http://blog.liverpoolmuseums.org.uk/2009/11/the-wanderer/ blog.liverpoolmuseums.org.uk]\n* The Conway: From Her Foundation to the Present Day (1933)\n* \"In the Mill\" (1941)\n* The Nine Days Wonder (The Operation Dynamo) (1941)\n* New Chum (1944) [https://books.google.com/books?idhzUOAAAAQAAJ&pg\nPA175 A Guide to Twentieth Century Literature in English (1983)] By Harry Blamires, Taylor & Francis, p. 175\n* So Long to Learn (autobiography) (1952)\n* Grace Before Ploughing (autobiography) (Heinemann, 1966)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "John Masefield" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16319" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "John Edward Masefield, OM (; 1 June 1878 – 12 May 1967) English poet and writer, was Poet Laureate of the United Kingdom from 1930. Among his best known works are the children's novels The Midnight Folk and The Box of Delights, and the poems \"The Everlasting Mercy\" and \"Sea-Fever\".\n\nBiography\n\nEarly life\n\nMasefield was born in Ledbury in Herefordshire, to Caroline and George Masefield, a solicitor. His mother died giving birth to his sister when Masefield was only six, and he went to live with his aunt. His father died soon after following a mental breakdown.[http://www.jrank.org/literature/pages/9694/John-%28Edward%29-Masefield.html Masefield Biography] After an unhappy education at the King's School in Warwick (now known as Warwick School), where he was a boarder between 1888 and 1891, he left to board , both to train for a life at sea, and to break his addiction to reading, of which his aunt thought little. He spent several years aboard this ship and found that he could spend much of his time reading and writing. It was aboard the Conway that Masefield's love for story-telling grew. While on the ship, he listened to the stories told about sea lore. He continued to read, and felt that he was to become a writer and story teller himself.\n\nIn 1894, Masefield boarded the Gilcruix, destined for Chile – this first voyage bringing him the experience of sea sickness. He recorded his experiences while sailing through the extreme weather, his journal entries reflecting a delight in seeing flying fish, porpoises, and birds, and was awed by the beauty of nature, including a rare sighting of a nocturnal rainbow on his voyage. On reaching Chile, Masefield suffered from sunstroke and was hospitalised. He eventually returned home to England as a passenger aboard a steam ship. In 1895, Masefield returned to sea on a windjammer destined for New York City. However, the urge to become a writer and the hopelessness of life as a sailor overtook him, and in New York, he deserted ship. He lived as a vagrant for several months, drifting between odd jobs, eventually finding work as an assistant to a bar keeper, before finally returning to New York City.\n\nSometime around Christmas 1895, Masefield read the December edition of Truth, a New York periodical, which contained the poem \"The Piper of Arll\" by Duncan Campbell Scott.[http://www.canadianpoetry.ca/confederation/DCScott/labour_and_the_angel.htm#piper The Piper of Arll] Ten years later, Masefield wrote to Scott to tell him what reading that poem had meant to him: \"I had never (till that time) cared very much for poetry, but your poem impressed me deeply, and set me on fire. Since then poetry has been the one deep influence in my life, and to my love of poetry I owe all my friends, and the position I now hold.\"John Coldwell Adams, \"[http://www.canadianpoetry.ca/confederation/John%20Coldwell%20Adams/Confederation%20Voices/chapter%205.html Duncan Campbell Scott]\", Confederation Voices, Canadian Poetry, 30 March 2011.\n\nFor the next two years, Masefield was employed by the huge Alexander Smith carpet factory in Yonkers, New York, where long hours were expected and conditions were far from ideal. He purchased up to 20 books a week, and devoured both modern and classical literature. His interests at this time were diverse and his reading included works by George du Maurier, Dumas, Thomas Browne, Hazlitt, Dickens, Kipling, and R. L. Stevenson. Chaucer also became very important to him during this time, as well as poetry by Keats and Shelley. He eventually returned home to England in 1897Stapleton, M; The Cambridge Guide to English Literature, Cambridge University Press, 1983, p571 as a passenger aboard a steam ship. When Masefield was 23, he met his future wife, Constance de la Cherois Crommelin, who was 35 and of Huguenot descent. Educated in classics and English Literature, and a mathematics teacher, Constance was a good match despite the difference in age.  The couple had two children (Judith, born in 1904, and Lewis, in 1910).[http://ies.sas.ac.uk/cmps/Projects/Masefield/Society/jms2.htm John Masefield Society, A Biography]  In 1902 he was in charge of the fine art section of the Arts and Industrial Exhibition in Wolverhampton.\n\nBy the time he was 24, Masefield's poems were being published in periodicals and his first collected works, Salt-Water Ballads (1902) was published, the poem \"Sea-Fever\" appearing in this book.  Masefield then wrote the novels, Captain Margaret (1908) and Multitude and Solitude (1909).  In 1911, after a long drought of poem writing, he composed \"The Everlasting Mercy\", the first of his narrative poems, and within the next year had produced two more, \"The Widow in the Bye Street\" and \"Dauber\".  As a result, he became widely known to the public and was praised by the critics; in 1912, he was awarded the annual Edmond de Polignac prize.[http://www.publishingcentral.com/masefield/biography.html Self-published Blog on Masefield Biog]\n\nWorld War I to appointment as Poet Laureate\n\nWhen World War I began, although old enough to be exempted from military service, Masefield joined the staff of a British hospital for French soldiers, Hôpital Temporaire d'Arc-en-Barrois, Haute-Marne, France, serving briefly in 1915 as a hospital orderly, later publishing his own account of his experiences.  At about this time, Masefield moved his country retreat from Buckinghamshire to Lollingdon Farm in Cholsey, Berkshire, a setting that inspired a number of poems and sonnets under the title Lollingdon Downs, and which his family used until 1917.\n\nAfter returning home, Masefield was invited to the United States on a three-month lecture tour.  Although their primary purpose was to lecture on English Literature, he also intended to collect information on the mood and views of Americans regarding the war in Europe.  When he returned to England, he submitted a report to the British Foreign Office, and suggested that he should be allowed to write a book about the failure of the allied efforts in the Dardanelles, which possibly could be used in the United States to counter what he thought was German propaganda there. The resulting work Gallipoli was a success, encouraging the British people, lifting them somewhat from the disappointment they had felt as a result of the Allied losses in the Dardanelles.  Due to the success of his wartime writings, Masefield met with the head of British Military Intelligence in France and was asked to write an account of the Battle of the Somme.  Although Masefield had grand ideas for his book, he was denied access to the official records, and therefore, what was to be the preface was published as The Old Front Line, a description of the geography of the Somme area.\n\nIn 1918 Masefield returned to America on his second lecture tour, spending much of his time speaking and lecturing to American soldiers waiting to be sent to Europe.  These speaking engagements were very successful, and on one occasion, a battalion of black soldiers danced and sang for him after his talk.  During this tour, he matured as a public speaker and realised his ability to touch the emotions of his audience with his style of speaking, learning to speak publicly with his own heart, rather than from dry scripted speeches.  Towards the end of his trip, both Yale and Harvard Universities conferred honorary Doctorates of Letters on him.\n\nMasefield entered the 1920s as an accomplished and respected writer. His family was able to settle on Boar's Hill, a somewhat rural setting not far from Oxford, where Masefield took up beekeeping, goat-herding and poultry-keeping. He continued to meet with success, the 1923 edition of Collected Poems selling approximately 80,000 copies. He produced three poems early in this decade.  The first was Reynard The Fox (1920), a poem that has been critically compared with works of Geoffrey Chaucer, not necessarily to Masefield's credit. This was followed by Right Royal and King Cole, poems where the relationship of humanity and nature were emphasised. While Reynard is the best known of these, all met with acclaim.\n\nAfter King Cole, Masefield turned away from the long poem and back to the novel, and from 1924 till the start of World War II published 12 novels, which vary from stories of the sea (The Bird of Dawning, Victorious Troy) to social novels about modern England (The Hawbucks, The Square Peg), and from tales of an imaginary land in Central America (Sard Harker, Odtaa) to fantasies for children (The Midnight Folk, The Box of Delights). This variety in genre testifies most impressively to the breadth of his imagination, though it probably reduced his sales (which remained very respectable, however), since most readers of novels like knowing what to expect from their favourite authors. In this same period he wrote a large number of dramatic pieces. Most of these were based on Christian themes, and Masefield, to his amazement, encountered a ban on the performance of plays on biblical subjects that went back to the Reformation and had been revived a generation earlier to prevent production of Oscar Wilde's Salome. However, a compromise was reached, and in 1928 his \"The Coming of Christ\" was the first play to be performed in an English Cathedral since the Middle Ages.[http://www.publishingcentral.com/masefield/biography.html Self-published Blog on Masefield Biog – middle life ]\n\nPoetry associations\n\nIn 1921, Masefield received an Honorary Doctorate of Literature from the University of Oxford. In 1923, he organised Oxford Recitations, an annual contest whose purpose was \"to discover good speakers of verse and to encourage 'the beautiful speaking of poetry'.\" Given the numbers of contest applicants, the event's promotion of natural speech in poetical recitations, and the number of people learning how to listen to poetry, Oxford Recitations was generally deemed a success. Masefield was similarly a founding member in Scotland, in 1924, of the Scottish Association for the Speaking of Verse. He later came to question whether the Oxford events should continue as a contest, considering that they might better be run as a festival. However, in 1929, after he broke with the competitive element, Oxford Recitations came to an end. The Scottish Association for the Speaking of Verse, on the other hand, continued to develop through the influence of associated figures such as Marion Angus and Hugh MacDiarmid and exists today as the Poetry Association of Scotland.\n\nLater years and death\n\nIn 1930, on the death of Robert Bridges, a new Poet Laureate was needed. Many felt that Rudyard Kipling was a likely choice; however, upon the recommendation of Prime Minister Ramsay MacDonald, King George V appointed Masefield, who remained in office until his death in 1967. The only person to hold the office for a longer period was Alfred, Lord Tennyson. On his appointment The Times newspaper said of him: \"... his poetry could touch to beauty the plain speech of everyday life\".The Times, 1930. Although the requirements of Poet Laureate had changed, and those in the office were rarely required to write verse for special occasions, Masefield took his appointment seriously and produced a large quantity of verse. Poems composed in his official capacity were sent to The Times. Masefield's modesty was shown by inclusion of a stamped envelope with each submission so that his composition could be returned if it were found unacceptable for publication. Later he was commissioned to write a poem to be set to music by the Master of the King's Musick, Sir Edward Elgar, and performed at the unveiling of the Queen Alexandra Memorial by the King on 8 June 1932. This was the ode \"So many true Princesses who have gone\".\n\nAfter his appointment, Masefield was awarded the Order of Merit by King George V and many honorary degrees from British universities, in 1937 being elected as President of the Society of Authors. Masefield encouraged the continued development of English literature and poetry, and began the annual awarding of the Royal Medals for Poetry for a first or second published edition of poetry by a poet under the age of 35.  Additionally, his speaking engagements were calling him further away, often on much longer tours, yet he still produced significant amounts of work in a wide variety of genres. To those he had already used he now added autobiography, producing New Chum, In the Mill, and So Long to Learn. Some critics judged Masefield to be an even finer writer of prose than of verse.\n\nIt was not until about the age of 70 that Masefield slowed his pace due to illness.  In 1960, Constance died at 93, after a long illness. Although her death was heartrending, he had spent a tiring year watching the woman he loved die. He continued his duties as Poet Laureate; In Glad Thanksgiving, his last book, was published when he was 88 years old. In late 1966, Masefield developed gangrene in his ankle. This spread to his leg, and he died of the infection on 12 May 1967. According to his wishes, he was cremated and his ashes placed in Poets' Corner in Westminster Abbey. Later, the following verse was discovered, written by Masefield, addressed to his \"Heirs, Administrators, and Assigns\":\n\nLet no religious rite be done or read\nIn any place for me when I am dead,\nBut burn my body into ash, and scatter\nThe ash in secret into running water,\nOr on the windy down, and let none see;\nAnd then thank God that there's an end of me.\n[http://www.publishingcentral.com/masefield/biography.html Self-published Blog on Masefield Biog –  Later Life]\n\nThe Masefield Centre at Warwick School, which Masefield attended, and a high school in Ledbury, Herefordshire, have been named in his honour. In 1977, Folkways Records released an album of his poetry, including some read by Masefield himself.[http://www.folkways.si.edu/albumdetails.aspx?itemid=1739 John Masefield Reads His Poetry]\n\nArt song settings\n\nIn addition to the commission for Queen Alexandra's Memorial Ode with music by Elgar, many of Masefield's short poems were set as art songs by British composers of the time.For a list of settings, see: [http://www.lieder.net/lieder/m/masefield/ 'John Masefield'] at The Lied, Art Song, and Choral Texts Archive, www.recmusic.org. Retrieved 4 November 2011. Best known by far is John Ireland's \"Sea Fever\", the lasting popularity of which belies any mismatch between the urgency of the language and the slow, swung melody.Hold, Trevor (2002). Parry to Finzi: twenty English song composers, [https://books.google.com/books?idL_NS-he4Rx0C&printsec\nfrontcover&dqtrevor+hold+parry+finzi&hl\nen&eiLiW0ToLCH4Xs-gbDuZmFBg&sa\nX&oibook_result&ct\nresult&resnum1&ved\n0CDMQ6AEwAA#vonepage&q\n%22sea%20fever%22&ffalse pp 15, 193–194]. The Boydell Press. Retrieved 4 November 2011. Frederick Keel crafted several songs drawn from the Salt-Water Ballads and elsewhere. Of these, \"Trade Winds\" was particularly popular in its day,Foreman, Lewis (2011). [http://www.tandfonline.com/doi/abs/10.1080/19475020.2011.555470 'In Ruhleben camp']. First World War Studies, Vol 2, No 1 (March), pp 27–40. Retrieved 4 November 2011 . despite the tongue-twisting challenges the text presents to the singer.Conor O'Callaghan (2006). [http://www.poetryfoundation.org/poetrymagazine/article/177754 'John Masefield']. Poetry, March 2006. Retrieved 4 November 2011. Keel's defiant setting of \"Tomorrow\", written while interned at Ruhleben during World War I, was frequently programmed at the BBC Proms after the war.[http://www.bbc.co.uk/proms/archive/search/performance_find.shtml?tab\nsearch&sub_tabwork&work_id\n12685&from1890&to\n2011. 'Frederick Keel — Tomorrow' at the BBC Proms archive]. Retrieved 4 November 2011. Another memorable wartime composition is Ivor Gurney's climactic declamation of \"By a bierside\", a setting quickly set down in 1916 during a brief spell behind the lines.Dunnett, Roderick (2009). [http://www.naxos.com/mainsite/blurbs_reviews.asp?item_code8.572151&catNum\n572151&filetypeAbout%20this%20Recording&language\nEnglish# 'Ivor Gurney (1890–1937): Songs'] [CD booklet notes]. Naxos Records. Retrieved 4 November 2011.\n\nSelected works\n\nPoetry collections \n\n*[https://archive.org/details/saltwaterballads00maserich Salt-Water Ballads (1902)]*[https://books.google.com/books?ido4BfjuI8UUUC The Columbia Anthology of British Poetry (2005) By Carl Woodring, James S. Shapiro, Columbia University Press, p. 737][https://books.google.com/books?id\n43oBE1nJXaMC Cambridge Paperback Guide to Literature in English (1996) by Ian Ousby, Cambridge University Press, p. 252]\n*[https://archive.org/details/ballads00maserich Ballads (1903)]\n*Ballads and Poems (1910)\n*[https://archive.org/details/everlastingmercy00maserich The Everlasting Mercy (1911)]\n*[https://archive.org/details/widowinbyestreet00mase The Widow in the Bye Street (1912)]\n*[https://archive.org/details/dauberpoem00maserich Dauber (1912)]\n*[https://archive.org/details/storyofroundhous00ma The Story of a Round House and Other Poems (1912)]\n*[https://archive.org/details/daffodilfields00masegoog The Daffodil Fields (1913)]\n*[https://archive.org/details/philipkingandot00masegoog Philip the King and Other Poems (1914)]\n*Salt-Water Poems and Ballads (1916)\n*[https://archive.org/details/sonnetsandpoems00masegoog Sonnets and Poems (1916)]\n*[https://archive.org/stream/lollingdondownsoth00maseuoft/lollingdondownsoth00maseuoft_djvu.txt Lollingdon Downs and Other Poems with Sonnets (1917)]\n*[https://archive.org/details/rosasmasefield00maserich Rosas (1918)]\n*[https://archive.org/details/reynardfox00mase Reynard the Fox (1920)]\n*[https://archive.org/details/enslavedotherpoe00mase Enslaved and Other Poems (1920)]\n*[https://archive.org/details/kingcolebyjohn00maserich King Cole (1921)]\n*Selected Poems (1922)\n*The Dream and Other Poems (1922)\n*King Cole and Other Poems (1923)\n*The Collected Poems of John Masefield (1923)\n*Poems (1925)\n*Midsummer Night and Other Tales in Verse (1928)\n*A Letter from Pontus and Other Verse (1936)\n*The Country Scene (1937)\n*Some Verses to Some Germans (1939)\n*The Bluebells and Other Verses (1961)\n*Old Raiger and Other Verses (1964)\n*In Glad Thanksgiving (1966)\n*The West Wind (1963)\n\nNovels\n\n* [https://archive.org/details/amainsailhaul02masegoog A Mainsail Haul (1905)]\n*[https://archive.org/details/tarpaulinmuster00maserich A Tarpaulin Muster (short stories) (1907)]\n*Captain Margaret (1908)\n*Multitude and Solitude (1909)\n*Martin Hyde: The Duke's Messenger (1910)\n*Lost Endeavour (Nelson, 1910).\n* [https://archive.org/details/bookofdiscoverie00maserich A Book of Discoveries (children's novel) (1910)]\n*The Street of Today (1911)\n*Jim Davis (Wells Gardner, 1911).\n*Sard Harker (Heinemann, 1924)\n*ODTAA  (1926)\n*The Midnight Folk (children's novel) (1927)\n*The Hawbucks (1929)\n*The Bird of Dawning (Heinemann, 1933).\n*The Taking of the Gry (1934)\n*The Box of Delights: or When the Wolves Were Running (children's novel) (1935)\n*Victorious Troy: or The Harrying Angel (1935)\n*Eggs and Baker (1936)\n*The Square Peg: or The Gun Fella (1937)\n*Dead Ned (1938)\n*Live and Kicking Ned (1939)\n*Basilissa: A Tale of the Empress Theodora (1940)\n*Conquer: A Tale of the Nika Rebellion in Byzantium (1941)\n*Badon Parchments (1947)\n\nPlays\n\n*The Campden Wonder (1907)\n*The Tragedy of Pompey the Great (1910)\n*Philip the King (1914)\n*Good Friday: A Play in Verse (1916)\n*The Tragedy of Nan (Originally known as Nan)\n*The Witch (1926) (trans. from the Norwegian play Anne Pedersdotter by Hans Wiers-Jenssen)\n*Tristan and Isolt (1927)\n*The Coming of Christ (1928)\n\nNon-fiction and autobiographical\n\n* [https://archive.org/details/sealifeinnelsons00maserich Sea Life in Nelson's Time (1905)]\n*[https://archive.org/details/gallipoligun00mase Gallipoli (1916)]\n* The Old Front Line (1917)\n*[https://archive.org/details/battleofsomme00maserich The Battle of the Somme (1919)]\n* The Wanderer of Liverpool (1930)[http://blog.liverpoolmuseums.org.uk/2009/11/the-wanderer/ blog.liverpoolmuseums.org.uk]\n* The Conway: From Her Foundation to the Present Day (1933)\n* \"In the Mill\" (1941)\n* The Nine Days Wonder (The Operation Dynamo) (1941)\n* New Chum (1944) [https://books.google.com/books?idhzUOAAAAQAAJ&pg\nPA175 A Guide to Twentieth Century Literature in English (1983)] By Harry Blamires, Taylor & Francis, p. 175\n* So Long to Learn (autobiography) (1952)\n* Grace Before Ploughing (autobiography) (Heinemann, 1966). John Masefield. http://en.wikipedia.org/?curid=16319."
  }
}
