{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8651",
  "eid" : "e99d0170-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778471687,
  "textBody" : "Dark matter is a hypothetical type of matter distinct from ordinary matter such as protons, neutrons, electrons, and neutrinos.\n\nDark matter has never been directly observed; however, its existence would explain a number of otherwise puzzling astronomical observations. The name refers to the fact that it does not emit or interact with observable electromagnetic radiation, such as light, and is thus invisible to the entire electromagnetic spectrum.\n\nAlthough dark matter has not been directly observed, its existence and properties are inferred from unexplained mass in gravitational lensing calculations, which affects the motions of baryonic matter and light.. It influences the universe's large-scale structure, the formation of galaxies, and affects the cosmic microwave background.\n\nThe standard model of cosmology indicates that the total mass–energy of the universe contains 4.9% ordinary matter, 26.8% dark matter and 68.3% dark energy. Thus, dark matter constitutes 84.5%Since dark energy, by convention, does not count as \"matter\", this is 26.8/(4.9 + 26.8)\n0.845 of total mass, while dark energy plus dark matter constitute 95.1% of total mass–energy content.Sean Carroll, Ph.D., Caltech, 2007, The Teaching Company, Dark Matter, Dark Energy: The Dark Side of the Universe, Guidebook Part 2 page 46, Accessed 7 October 2013, \"...dark matter: An invisible, essentially collisionless component of matter that makes up about 25 percent of the energy density of the universe... it's a different kind of particle... something not yet observed in the laboratory...\" The great majority of ordinary matter in the universe is also unseen. Visible stars and gas inside galaxies and clusters account for less than 10% of the ordinary matter contribution to the mass-energy density of the universe. The most widely accepted hypothesis on the form for dark matter is that it is composed of weakly interacting massive particles, WIMPs, that interact only through gravity and the weak force.\nThe dark matter hypothesis plays a central role in current modeling of cosmic structure formation, galaxy formation and evolution, and on explanations of the anisotropies observed in the cosmic microwave background, CMB. All these lines of evidence suggest that galaxies, galaxy clusters, and the universe as a whole contain far more matter than that which is observable via electromagnetic signals. Many experiments to detect proposed dark matter particles through non-gravitational means are under way; however, no dark matter particle has been conclusively identified.\n\nAlthough the existence of dark matter is generally accepted by most of the astronomical community, a minority of astronomers, motivated by the lack of conclusive identification of dark matter, or by observations that don't fit the model, argue for various modifications of the standard laws of general relativity, such as \nMOND, TeVeS, and conformal gravity[https://higgs.ph.ed.ac.uk/sites/default/files/Nesbet_HS14.pdf Conformal theory: New light on dark matter, dark energy, and dark galactic halos].\" (PDF) Robert K. Nesbet. IBM Almaden Research Center, 17 June 2014. that attempt to account for the observations without invoking additional matter.\n\nHistory \n\nEarly history \n\nThe hypothesis of dark matter has an elaborate history. In a talk given in 1884,[http://www.science-site.net/darkmatter.htm] Lord Kelvin estimated the number of dark bodies in the Milky Way from the observed velocity dispersion of the stars orbiting around the center of the galaxy. By using these measurements, he estimated the mass of the galaxy, which he determined to be different from the mass of visible stars. Lord Kelvin thus concluded that “many of our stars, perhaps a great majority of them, may be dark bodies.”\n\nIn 1906 Henri Poincaré in “The Milky Way and Theory of Gases” used \"dark matter,” or “matière obscure” in French in discussing Kelvin's work.\n\nThe first to suggest the existence of dark matter, using stellar velocities, was Dutch astronomer Jacobus Kapteyn in 1922. (emphasis in original) Fellow Dutchman and radio astronomy pioneer Jan Oort also hypothesized the existence of dark matter in 1932.Oort, J.H. (1932) \"The force exerted by the stellar system in the direction perpendicular to the galactic plane and some related problems,\" Bulletin of the Astronomical Institutes of the Netherlands, 6 : 249–287. Oort was studying stellar motions in the local galactic neighborhood and found that the mass in the galactic plane must be greater than what was observed, but this measurement was later determined to be erroneous.\n\nIn 1933, Swiss astrophysicist Fritz Zwicky, who studied galactic clusters while working at the California Institute of Technology, made a similar inference. See also  Zwicky applied the virial theorem to the Coma Cluster and obtained evidence of unseen mass that he called dunkle Materie 'dark matter'. Zwicky estimated its mass based on the motions of galaxies near its edge and compared that to an estimate based on its brightness and number of galaxies. He estimated that the cluster had about 400 times more mass than was visually observable. The gravity effect of the visible galaxies was far too small for such fast orbits, thus mass must be hidden from view. Based on these conclusions, Zwicky inferred that some unseen matter provided the mass and associated gravitation attraction to hold the cluster together. This was the first formal inference about the existence of dark matter.Some details of Zwicky's calculation and of more modern values are given in  Zwicky's estimates were off by more than an order of magnitude, mainly due to an obsolete value of the Hubble constant; \nthe same calculation today shows a smaller fraction, using greater values for luminous mass. However, Zwicky did correctly infer that the bulk of the matter was dark.\n\nThe first robust indications that the mass to light ratio was anything other than unity came from measurements of galaxy rotation curves. In 1939, Horace W. Babcock reported the rotation curve for the Andromeda nebula (known now as the Andromeda Galaxy), which suggested that the mass-to-luminosity ratio increases radially.Babcock, H, 1939, \"[http://ads.nao.ac.jp/cgi-bin/nph-iarticle_query?1939LicOB..19...41B&data_type\nPDF_HIGH&whole_paperYES&type\nPRINTER&filetype=.pdf The rotation of the Andromeda Nebula]\", Lick Observatory bulletin ; no. 498 He attributed it to either light absorption within the galaxy or modified dynamics in the outer portions of the spiral and not to missing matter.\n\n1970s \n\nVera Rubin and Kent Ford in the 1960s–1970s provided further strong evidence, also using galaxy rotation curves.[http://www.darkmatterphysics.com/Galactic-rotation-curves-of-spiral-galaxies.htm First observational evidence of dark matter]. Darkmatterphysics.com. Retrieved 6 August 2013. Rubin worked with a new spectrograph to measure the velocity curve of edge-on spiral galaxies with greater accuracy. This result was confirmed in 1978. An influential paper presented Rubin's results in 1980. Rubin found that most galaxies must contain about six times as much dark as visible mass; thus, by around 1980 the apparent need for dark matter was widely recognized as a major unsolved problem in astronomy.\n\nAt the same time that Rubin and Ford were exploring optical rotation curves, radio astronomers were making use of new radio telescopes to map the 21 cm line of atomic hydrogen in nearby galaxies. The radial distribution of interstellar atomic hydrogen often extends to much larger galactic radii than those accessible by optical studies, allowing the sampling of rotation curves – and thus of the total mass distribution – to a new dynamical regime. Early mapping of Andromeda with the 300-foot telescope at Green Bank  and the 250-foot dish at Jodrell Bank  already showed that the HI rotation curve did not trace the expected Keplerian decline. As more sensitive receivers became available, Morton Roberts and Robert Whitehurst  were able to trace the rotational velocity of Andromeda to 30 kpc, much beyond the optical measurements. Illustrating the advantage of tracing the gas disk at large radii, Figure 16 of that paper  combines the optical data  (the cluster of points at radii of less than 15 kpc with a single point further out) with the HI data between 20 and 30 kpc, exhibiting the flatness of the outer galaxy rotation curve; the solid curve peaking at the center is the optical surface density, while the other curve shows the cumulative mass, still rising linearly at the outermost measurement. In parallel, the use of interferometric arrays for extragalactic HI spectroscopy was being developed. In 1972, David Rogstad and Seth Shostak  published HI rotation curves of five spirals mapped with the Owens Valley interferometer; the rotation curves of all five were very flat, suggesting very large values of mass-to-light ratio in the outer parts of their extended HI disks.\n\nA stream of observations in the 1980s indicated its presence, including gravitational lensing of background objects by galaxy clusters, the temperature distribution of hot gas in galaxies and clusters, and the pattern of anisotropies in the cosmic microwave background. According to consensus among cosmologists, dark matter is composed primarily of a not yet characterized type of subatomic particle. The search for this particle, by a variety of means, is one of the major efforts in particle physics.\n\nTechnical definition \n\nIn standard cosmology, matter is anything whose energy density scales with the inverse cube of the scale factor, i.e. ρ ∝ a−3. This is in contrast to radiation, which scales to the inverse fourth power of the scale factor ρ ∝ a−4, and dark energy, which is unaffected ρ ∝ a0. This can be understood intuitively: for an ordinary particle in a square box, doubling the length of the sides of the box decreases the density (and hence energy density) by a factor of eight (23). For radiation, the decrease in energy density is greater, because an increase in spatial distance also causes a redshift. Dark energy, as an intrinsic property of space, has a constant energy density regardless of the volume under consideration.\n\nDark matter is that component of the universe which is not ordinary matter, but still obeys ρ ∝ a−3.\n\nObservational evidence \n\nGalaxy rotation curves \n\nThe arms of spiral galaxies rotate around the galactic centre. The luminous mass density of a spiral galaxy decreases as one goes from the centre to the outskirts. If luminous mass were all the matter, then we can model the galaxy as a point mass in the centre and test masses orbiting around it (similar to the solar system).This is a consequence of the shell theorem and the observation that spiral galaxies are spherically symmetric to a large extent (in 2D). From Kepler's Second Law, we expect that the rotation velocities will decrease with distance from the centre, similar to our solar system. This is not observed. Instead, the galaxy rotation curve remains flat as distant from the centre as the data is available.\n\nIf we assume the validity of Kepler's laws, then the obvious way to resolve this discrepancy is to conclude that the mass distribution in spiral galaxies is not similar to that of the solar system. In particular, there is a lot of non-luminous matter in the outskirts of the galaxy (\"dark matter\").\n\nVelocity dispersions \n\nStars in bound systems must obey the virial theorem. The theorem, together with the measured velocity distribution, can be used to measure the mass distribution in a bound system, such as elliptical galaxies or globular clusters. With some exceptions, velocity dispersion estimates of elliptical galaxies do not match the predicted velocity dispersion from the observed mass distribution, even assuming complicated distributions of stellar orbits.\n\nAs with galaxy rotation curves, the obvious way to resolve the discrepancy is to postulate the existence of non-luminous matter.\n\nGalaxy clusters \n\nGalaxy clusters are particularly important for dark matter studies since their masses can be estimated in three independent ways:\n\n* From the scatter in radial velocities of the galaxies within clusters\n* From X-rays emitted by hot gas in the clusters. From the X-ray energy spectrum and flux, the gas temperature and density can be estimated, hence giving the pressure; assuming pressure and gravity balance determines the cluster's mass profile. \n* Gravitational lensing (usually of more distant galaxies) can measure cluster masses without relying on observations of dynamics (e.g., velocity).\n\nGenerally, these three methods are in reasonable agreement that dark matter outweighs visible matter by approximately 5 to 1.\n\nGravitational lensing \n\nOne of the consequences of general relativity is that massive objects (such as a cluster of galaxies) lying between a more distant source (such as a quasar) and an observer should act as a lens to bend the light from this source. The more massive an object, the more lensing is observed.\n\nStrong lensing is the observed distortion of background galaxies into arcs when their light passes through such a gravitational lens. It has been observed around many distant clusters including Abell 1689. By measuring the distortion geometry, the mass of the intervening cluster can be obtained. In the dozens of cases where this has been done, the mass-to-light ratios obtained correspond to the dynamical dark matter measurements of clusters. Lensing can lead to multiple copies of an image. By analyzing the distribution of multiple image copies, scientists have been able to deduce and map the distribution of dark matter around the MACS J0416.1-2403 galaxy cluster.\n\nWeak gravitational lensing investigates minute distortions of galaxies, using statistical analyses from vast galaxy surveys. By examining the apparent shear deformation of the adjacent background galaxies, the mean distribution of dark matter can be characterized. The mass-to-light ratios correspond to dark matter densities predicted by other large-scale structure measurements.\n\nCosmic microwave background \n\nAlthough both dark matter and ordinary matter are \"matter\", they do not behave in the same way. In particular, in the early universe, ordinary matter was ionized and interacted strongly with radiation via Thomson scattering. Dark matter does not interact directly with radiation, but it does affect the CMB by its gravitational potential (mainly on large scales), and by its effects on the density and velocity of ordinary matter. Ordinary and dark matter perturbations therefore evolve differently with time, and leave different imprints on the cosmic microwave background (CMB).\n\nThe cosmic microwave background is very close to a perfect blackbody, but contains very small temperature anisotropies of a few parts in 100,000. A sky map of anisotropies can be decomposed into an angular power spectrum, which is observed to contain a series of \"acoustic peaks\" at near-equal spacing but different heights. \nThe series of peaks can be predicted for any assumed set of cosmological parameters by modern computer codes such as CMBFast and CAMB, and matching theory to data therefore constrains cosmological parameters.The details are technical. See  for an intermediate-level introduction. The first peak mostly shows the density of baryonic matter, while the third peak relates mostly to the density of dark matter, measuring the density of matter and the density of atoms.\n\nThe CMB anisotropy was first discovered by COBE in 1992, though this had too coarse resolution to detect\nthe acoustic peaks. \nAfter the discovery of the first acoustic peak by the balloon-borne BOOMERanG experiment in 2000, \nthe power spectrum was precisely observed by WMAP in 2003-12, and even more precisely \nby the Planck spacecraft in 2013-15. The results support the Lambda-CDM model.\n\nThe observed CMB angular power spectrum provides powerful evidence in support of dark matter, as its precise structure is well fitted by the Lambda-CDM model but difficult to reproduce with any competing model such as MOND.\n\nStructure formation \n\nStructure formation refers to the period after the Big Bang when density perturbations collapsed to form stars, galaxies, and clusters. Prior to structure formation, the Friedmann solutions to general relativity describe a homogeneous universe. Later, small anisotropies gradually grew and condensed the homogeneous universe into stars, galaxies and larger structures. Ordinary matter is affected by radiation, which is the dominant element of the universe at very early times. As a result, its density perturbations are washed out and unable to condense into structure. If there were only ordinary matter in the universe, there would not have been enough time for density perturbations to grow into the galaxies and clusters that we see today.\n\nDark matter provides a solution to this problem because it is unaffected by radiation. Therefore, its density perturbations can grow first. The resulting gravitational potential acts as an attractive potential well for ordinary matter collapsing later, speeding up the structure formation process.\n\nType Ia supernova distance measurements \n\nType Ia supernovae can be used as \"standard candles\" to measure extragalactic distances, which can in turn be used to measure how fast the universe has expanded in the past. The data indicates that the universe is expanding at an accelerating rate, the cause of which is usually ascribed to dark energy. Since observations indicate the universe is almost flat, we expect the total energy density of everything in the universe to sum to 1 (Ωtot ~ 1). The measured dark energy density is ΩΛ ~0.690; the observed ordinary (baryonic) matter energy density is Ωb \n ~0.0482 and the energy density of radiation is negligible. This leaves a missing Ωdm ~0.258 that nonetheless behaves like matter (see technical definition section above) – dark matter.\n\nSky surveys and baryon acoustic oscillations \n\nBaryon acoustic oscillations (BAO) are regular, periodic fluctuations in the density of the visible baryonic matter (normal matter) of the universe. These are predicted to arise in the Lambda-CDM model due to the early universe's acoustic oscillations in the photon-baryon fluid and can be observed in the cosmic microwave background angular power spectrum. BAOs set up a preferred length scale for baryons. As the dark matter and baryons clumped together after recombination, the effect is much weaker in the galaxy distribution in the nearby universe, but is detectable as a subtle (~ 1 percent) preference for pairs of galaxies to be separated by 147 Mpc, compared to those separated by 130 or 160 Mpc. This feature was predicted theoretically in the 1990s and then discovered in 2005, in two large galaxy redshift surveys, the Sloan Digital Sky Survey and the 2dF Galaxy Redshift Survey.\n Combining the CMB observations with BAO measurements from galaxy redshift surveys provides a precise estimate of the Hubble constant and the average matter density in the Universe. The results support the Lambda-CDM model.\n\nRedshift-space distortions \n\nLarge galaxy redshift surveys may be used to make a three-dimensional map of the galaxy distribution. These maps are slightly distorted because distances are estimated from observed redshifts; the redshift contains a contribution from the galaxy's so-called peculiar velocity in addition to the dominant Hubble expansion term. On average, superclusters are expanding but more slowly than the cosmic mean due to their gravity, while voids are expanding faster than average. In a redshift map, galaxies in front of a supercluster have excess radial velocities towards it and have redshifts slightly higher than their distance would imply, while galaxies behind the supercluster have redshifts slightly low for their distance.  This effect causes superclusters to appear \"squashed\" in the radial direction, and likewise voids are \"stretched\"; angular positions are unaffected.   \nThe effect is not detectable for any one structure since the true shape is not known, but can be measured by averaging over many structures assuming we are not at a special location in the Universe.\n\nThe effect was predicted quantitatively by Nick Kaiser in 1987, and first decisively measured in 2001 by the 2dF Galaxy Redshift Survey. Results are in agreement with the Lambda-CDM model.\n\nLyman-alpha forest \n\nIn astronomical spectroscopy, the Lyman-alpha forest is the sum of the absorption lines arising from the Lyman-alpha transition of neutral hydrogen in the spectra of distant galaxies and quasars. Lyman-alpha forest observations can also constrain cosmological models.\n These constraints agree with those obtained from WMAP data.\n\nComposition of dark matter: baryonic vs. nonbaryonic \n\nDark matter can refer to any substance which interacts predominantly via gravity with visible matter (e.g. stars and planets). Hence in principle it need not be composed of a new type of fundamental particle but could, at least in part, be made up of standard baryonic matter, such as protons or electrons. However, for the reasons outlined below, most scientists consider the dark matter to be dominated by a non-baryonic component, which is likely composed of a currently unknown fundamental particle (or similar exotic state).\n\nBaryonic matter \n\nBaryons (protons and neutrons) make up ordinary stars and planets. However, baryonic matter also encompasses less common black holes, neutron stars, faint old white dwarfs and brown dwarfs, collectively known as massive compact halo objects (MACHOs). This ordinary, but hard to see, matter could explain dark matter.\n\nHowever multiple lines of evidence suggest the majority of dark matter is not made of baryons:\n\n* Sufficient diffuse, baryonic gas or dust would be visible when backlit by stars. \n* The theory of Big Bang nucleosynthesis predicts the observed abundance of the chemical elements. If there are more baryons, then there should also be more helium, lithium and heavier elements synthesized during the Big Bang.Achim Weiss, \"[http://www.einstein-online.info/spotlights/BBN Big Bang Nucleosynthesis: Cooking up the first light elements]\" in: Einstein Online Vol. 2 (2006), 1017 Agreement with observed abundances requires that baryonic matter makes up between 4–5% of the universe's critical density. In contrast, large-scale structure and other observations indicate that the total matter density is about 30% of the critical density.\n* Astronomical searches for gravitational microlensing in the Milky Way found that at most a small fraction of the dark matter may be in dark, compact, conventional objects (MACHOs, etc.); the excluded range of object masses is from half the Earth's mass up to 30 solar masses, which covers nearly all the plausible candidates.Wyrzykowski, Lukasz et al. (2011) [https://arxiv.org/abs/1106.2925 The OGLE view of microlensing towards the Magellanic Clouds – IV. OGLE-III SMC data and final conclusions on MACHOs], MNRAS, 416, 2949 \n* Detailed analysis of the small irregularities (anisotropies) in the cosmic microwave background. Observations by WMAP and Planck indicate that around five-sixths of the total matter is in a form that interacts significantly with ordinary matter or photons only through gravitational effects.\n\nNon-baryonic matter \n\nCandidates for nonbaryonic dark matter are hypothetical particles such as axions, sterile neutrinos or WIMPs (e.g. supersymmetric particles). The three neutrino types already observed are indeed abundant, and “dark”, and matter, but because their individual masses – however uncertain they may be – are almost certainly tiny, they can only supply a small fraction of dark matter, due to limits derived from large-scale structure and high-redshift galaxies.\n\nUnlike baryonic matter, nonbaryonic matter did not contribute to the formation of the elements in the early universe (\"Big Bang nucleosynthesis\") and so its presence is revealed only via its gravitational effects, or, weak lensing. In addition, if the particles of which it is composed are supersymmetric, they can undergo annihilation interactions with themselves, possibly resulting in observable by-products such as gamma rays and neutrinos (\"indirect detection\").\n\nClassification of dark matter: cold, warm or hot \n\nDark matter can be divided into cold, warm and hot categories. These categories refer to velocity rather than an actual temperature, indicating how far corresponding objects moved due to random motions in the early universe, before they slowed due to cosmic expansion – this is an important distance called the \"free streaming length\" (FSL). Primordial density fluctuations smaller than this length get washed out as particles spread from overdense to underdense regions, while larger fluctuations are unaffected; therefore this length sets a minimum scale for later structure formation. The categories are set with respect to the size of a protogalaxy (an object that later evolves into a dwarf galaxy): dark matter particles are classified as cold, warm, or hot according as their FSL; much smaller (cold), similar (warm), or much larger (hot) than a protogalaxy.\n\nMixtures of the above are also possible: a theory of mixed dark matter was popular in the mid-1990s, but was rejected following the discovery of dark energy.\n\nCold dark matter leads to a \"bottom-up\" formation of structure while hot dark matter would result in a \"top-down\" formation scenario; the latter is excluded by high-redshift galaxy observations.\n\nAlternative definitions \n\nThese categories also correspond to fluctuation spectrum effects and the interval following the Big Bang at which each type became non-relativistic. Davis et al. wrote in 1985:\n\nAnother approximate dividing line is that \"warm\" dark matter became non-relativistic when the universe was approximately 1 year old and 1 millionth of its present size and in the radiation-dominated era (photons and neutrinos), with a photon temperature 2.7 million K. Standard physical cosmology gives the particle horizon size as 2ct (speed of light multiplied by time) in the radiation-dominated era, thus 2 light-years. A region of this size would expand to 2 million light years today (absent structure formation). The actual FSL is roughly 5 times the above length, since it continues to grow slowly as particle velocities decrease inversely with the scale factor after they become non-relativistic. In this example the FSL would correspond to 10 million light-years or 3 Mpc today, around the size containing an average large galaxy.\n\nThe 2.7 million K photon temperature gives a typical photon energy of 250 electron-volts, thereby setting a typical mass scale for \"warm\" dark matter: particles much more massive than this, such as GeV – TeV mass WIMPs, would become non-relativistic much earlier than 1 year after the Big Bang and thus have FSLs much smaller than a protogalaxy, making them \"cold\". Conversely, much lighter particles, such as neutrinos with masses of only a few eV, have FSLs much larger than a protogalaxy, thus qualifying them as \"hot\".\n\nCold dark matter \n\n\"Cold\" dark matter offers the simplest explanation for most cosmological observations. It is dark matter composed of constituents with an FSL much smaller than a protogalaxy. This is the focus for dark matter research, as hot dark matter does not seem to be capable of supporting galaxy or galaxy cluster formation, and most particle candidates slowed early.\n\nThe constituents of \"cold\" dark matter are unknown. Possibilities range from large objects like MACHOs (such as black holes) or RAMBOs (such as clusters of brown dwarfs), to new particles such as WIMPs and axions.\n\nStudies of Big Bang nucleosynthesis and gravitational lensing convinced most cosmologistsOlive, Keith A. (2003). [https://arxiv.org/abs/astro-ph/0301505 \"TASI Lectures on Dark Matter\"]. p. 21 that MACHOs cannot make up more than a small fraction of dark matter. According to A. Peter: \"... the only really plausible dark-matter candidates are new particles.\"\n\nThe 1997 DAMA/NaI experiment and its successor DAMA/LIBRA in 2013, claimed to directly detect dark matter particles passing through the Earth, but many researchers remain skeptical, as negative results from similar experiments seem incompatible with the DAMA results.\n\nMany supersymmetric models offer dark matter candidates in the form of the WIMPy Lightest Supersymmetric Particle (LSP). Separately, heavy sterile neutrinos exist in non-supersymmetric extensions to the standard model that explain the small neutrino mass through the seesaw mechanism.\n\nWarm dark matter \n\n\"Warm\" dark matter refers to particles with an FSL comparable to the size of a protogalaxy. Predictions based on warm dark matter are similar to those for cold dark matter on large scales, but with less small-scale density perturbations. This reduces the predicted abundance of dwarf galaxies and may lead to lower density of dark matter in the central parts of large galaxies; some researchers consider this to be a better fit to observations. A challenge for this model is the lack of particle candidates with the required mass ~ 300 eV to 3000 eV.\n\nNo known particles can be categorized as \"warm\" dark matter. A postulated candidate is the sterile neutrino: a heavier, slower form of neutrino that does not interact through the weak force,  unlike other neutrinos. Some modified gravity theories, such as scalar-tensor-vector gravity, require \"warm\" dark matter to make their equations work.\n\nHot dark matter \n\n\"Hot\" dark matter consists of particles whose FSL is much larger than the size of a protogalaxy. The neutrino qualifies as such particle. They were discovered independently, long before the hunt for dark matter: they were postulated in 1930, and detected in 1956. Neutrinos' mass is less than 10−6 that of an electron. Neutrinos interact with normal matter only via gravity and the weak force, making them difficult to detect (the weak force only works over a small distance, thus a neutrino triggers a weak force event only if it hits a nucleus head-on). This makes them 'weakly interacting light particles' (WILPs), as opposed to WIMPs.\n\nThe three known flavours of neutrinos are the electron, muon, and tau. Their masses are slightly different. Neutrinos oscillate among the flavours as they move. It is hard to determine an exact upper bound on the collective average mass of the three neutrinos (or for any of the three individually). For example, if the average neutrino mass were over 50 eV/c2 (less than 10−5 of the mass of an electron), the universe would collapse. CMB data and other methods indicate that their average mass probably does not exceed 0.3 eV/c2. Thus, observed neutrinos cannot explain dark matter.\n\nBecause galaxy-size density fluctuations get washed out by free-streaming, \"hot\" dark matter implies that the first objects that can form are huge supercluster-size pancakes, which then fragment into galaxies. Deep-field observations show instead that galaxies formed first, followed by clusters and superclusters as galaxies clump together.\n\nDetection of dark matter particles \n\nIf dark matter is made up of sub-atomic particles, then millions, possibly billions, of such particles must pass through every square centimeter of the Earth each second.\n Many experiments aim to test this hypothesis. Although WIMPs are popular search candidates, the Axion Dark Matter eXperiment (ADMX) searches for axions. Another candidate is heavy hidden sector particles that only interact with ordinary matter via gravity.\n\nThese experiments can be divided into two classes: direct detection experiments, which search for the scattering of dark matter particles off atomic nuclei within a detector; and indirect detection, which look for the products of dark matter particle annihilations or decays.\n\nDirect detection \n\nDirect detection experiments aim to observe low-energy recoils (typically a few keVs) of nuclei induced by interactions with particles of dark matter, which (in theory) are passing through the Earth. After such a recoil the nucleus will emit energy as e.g. scintillation light or phonons, which is then detected by sensitive apparatus. In order to do this effectively it is crucial to maintain a low background, and so such experiments operate deep underground to reduce the interference from cosmic rays. Examples of underground laboratories which house direct detection experiments include the Stawell mine, the Soudan mine, the SNOLAB underground laboratory at Sudbury, the Gran Sasso National Laboratory, the Canfranc Underground Laboratory, the Boulby Underground Laboratory, the Deep Underground Science and Engineering Laboratory and the China Jinping Underground Laboratory.\n\nThese experiments mostly use either cryogenic or noble liquid detector technologies. Cryogenic detectors operating at temperatures below 100mK, detect the heat produced when a particle hits an atom in a crystal absorber such as germanium. Noble liquid detectors detect scintillation produced by a particle collision in liquid xenon or argon. Cryogenic detector experiments include: CDMS, CRESST, EDELWEISS, EURECA. Noble liquid experiments include ZEPLIN, XENON, DEAP, ArDM, WARP, DarkSide, PandaX, and LUX, the Large Underground Xenon experiment. Both of these techniques focus strongly on their ability to distinguish background particles (which predominantly scatter off electrons) from dark matter particles (that scatter off nuclei). Other experiments include SIMPLE and PICASSO.\n\nCurrently there has been no well-established claim of dark matter detection from a direct detection experiment, leading instead to strong upper limits on the mass and interaction cross section with nucleons of such dark matter particles. The DAMA/NaI and more recent DAMA/LIBRA experimental collaborations claim to have detected an annual modulation in the rate of events in their detectors, which they claim is due to dark matter. This results from the expectation that as the Earth orbits the Sun, the velocity of the detector relative to the dark matter halo will vary by a small amount. This claim is so far unconfirmed and in contradiction with negative results from other experiments such as LUX and SuperCDMS.\n\nA special case of direct detection experiments covers those with directional sensitivity. This is a search strategy based on the motion of the Solar System around the Galactic Center. A low pressure time projection chamber makes it possible to access information on recoiling tracks and constrain WIMP-nucleus kinematics. WIMPs coming from the direction in which the Sun is travelling (roughly towards Cygnus) may then be separated from background, which should be isotropic. Directional dark matter experiments include DMTPC, DRIFT, Newage and MIMAC.\n\nIndirect detection \n\nIndirect detection experiments search for the products of the self-annihilation or decay of dark matter particles in outer space. For example, in regions of high dark matter density (e.g. the centre of our galaxy) two dark matter particles could annihilate to produce gamma rays or Standard Model particle-antiparticle pairs. Alternatively if the dark matter particle is unstable, it could decay into standard model (or other) particles. These processes could be detected indirectly through an excess of gamma rays, antiprotons or positrons emanating from high density regions in our galaxy or others. A major difficulty inherent in such searches is that there are various astrophysical sources which can mimic the signal expected from dark matter, and so multiple signals will likely be required for a conclusive discovery.\n\nA few of the dark matter particles passing through the Sun or Earth may scatter off atoms and lose energy. Thus dark matter may accumulate at the center of these bodies, increasing the chance of collision/annihilation. This could produce a distinctive signal in the form of high-energy neutrinos. Such a signal would be strong indirect proof of WIMP dark matter. High-energy neutrino telescopes such as AMANDA, IceCube and ANTARES are searching for this signal.\nThe detection by LIGO in September 2015 of gravitational waves, opens the possibility of observing dark matter in a new way, particularly if it is the form of primordial black holes.\n\nMany experimental searches have been undertaken to look for such emission from dark matter annihilation or decay, examples of which follow.\nThe Energetic Gamma Ray Experiment Telescope observed more gamma rays in 2008 than expected from the Milky Way, but scientists concluded that this was most likely due to incorrect estimation of the telescope's sensitivity.\n\nThe Fermi Gamma-ray Space Telescope is searching for similar gamma rays. In April 2012, an analysis of previously available data from its Large Area Telescope instrument produced statistical evidence of a 130 GeV signal in the gamma radiation coming from the center of the Milky Way. WIMP annihilation was seen as the most probable explanation.\n\nAt higher energies, ground-based gamma-ray telescopes have set limits on the annihilation of dark matter in dwarf spheroidal galaxies and in clusters of galaxies.\n\nThe PAMELA experiment (launched 2006) detected excess positrons. They could be from dark matter annihilation or from pulsars. No excess antiprotons were observed.\n\nIn 2013 results from the Alpha Magnetic Spectrometer on the International Space Station indicated excess high-energy cosmic rays that could be due to dark matter annihilation.\n\nCollider searches for dark matter \n\nAn alternative approach to the detection of dark matter particles in nature is to produce them in a laboratory. Experiments with the Large Hadron Collider (LHC) may be able to detect dark matter particles produced in collisions of the LHC proton beams. Because a dark matter particle should have negligible interactions with normal visible matter, it may be detected indirectly as (large amounts of) missing energy and momentum that escape the detectors, provided other (non-negligible) collision products are detected. \nConstraints on dark matter also exist from the LEP experiment using a similar principle, but probing the interaction of dark matter particles with electrons rather than quarks. It is important to note that any discovery from collider searches will need to be corroborated by discoveries in the indirect or direct detection sectors, in order to prove that the particle discovered is in fact the dark matter of our Universe.\n\nAlternative hypotheses \n\nBecause dark matter remains to be conclusively identified, many other hypotheses have emerged aiming to explain the observational phenomena that dark matter was conceived to explain. Many hypotheses suggest that the theory of general relativity may simply be incorrect in describing these phenomena. General relativity is well-tested on solar system scales, but its validity on galactic or cosmological scales has not been well proven. A suitable modification to general relativity can conceivably eliminate the need for dark matter. The most well-known theories of this class are MOND and its relativistic generalization TeVeS,For a review, see:  f(R) gravityFor a review, see:  and entropic gravity. Alternative theories abound.\n\nA problem with alternative hypotheses is that the observational evidence for dark matter comes from so many independent approaches (see the \"observational evidence\" section above). Any alternative hypothesis not only has to explain all the evidence, it also has to explain individual cases such as the Bullet Cluster, Abstract only wherein observations indicate that the location of the center of mass is far away from the center of baryonic mass. Nonetheless, there have been some scattered successes for alternative hypotheses, such as a 2016 test of gravitational lensing in entropic gravity.\n\nThe prevailing opinion among most astrophysicists is that while modifications to general relativity can conceivably explain part of the observational evidence, there is probably enough data to conclude there must be some form of dark matter.\n\nIn philosophy of science\n\nIn philosophy of science, dark matter is an example of an \"auxiliary hypothesis\", an ad hoc postulate that is added to a theory in response to observations that falsify it. It has been argued that the dark matter hypothesis is a conventionalist hypothesis, that is, a hypothesis that adds no empirical content and hence is unfalsifiable in the sense defined by Karl Popper.Merritt, David [http://www.sciencedirect.com/science/article/pii/S1355219816301563 \"Cosmology and Convention\"], Studies In History and Philosophy of Science Part B: Studies In History and Philosophy of Modern Physics, 57(1):41–52, February 2017.\n\nIn popular culture \n\nMention of dark matter is made in works of fiction. In such cases, it is usually attributed extraordinary physical or magical properties. Such descriptions are often inconsistent with the hypothesized properties of dark matter in physics and cosmology.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Dark matter" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8651" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dark matter is a hypothetical type of matter distinct from ordinary matter such as protons, neutrons, electrons, and neutrinos.\n\nDark matter has never been directly observed; however, its existence would explain a number of otherwise puzzling astronomical observations. The name refers to the fact that it does not emit or interact with observable electromagnetic radiation, such as light, and is thus invisible to the entire electromagnetic spectrum.\n\nAlthough dark matter has not been directly observed, its existence and properties are inferred from unexplained mass in gravitational lensing calculations, which affects the motions of baryonic matter and light.. It influences the universe's large-scale structure, the formation of galaxies, and affects the cosmic microwave background.\n\nThe standard model of cosmology indicates that the total mass–energy of the universe contains 4.9% ordinary matter, 26.8% dark matter and 68.3% dark energy. Thus, dark matter constitutes 84.5%Since dark energy, by convention, does not count as \"matter\", this is 26.8/(4.9 + 26.8)\n0.845 of total mass, while dark energy plus dark matter constitute 95.1% of total mass–energy content.Sean Carroll, Ph.D., Caltech, 2007, The Teaching Company, Dark Matter, Dark Energy: The Dark Side of the Universe, Guidebook Part 2 page 46, Accessed 7 October 2013, \"...dark matter: An invisible, essentially collisionless component of matter that makes up about 25 percent of the energy density of the universe... it's a different kind of particle... something not yet observed in the laboratory...\" The great majority of ordinary matter in the universe is also unseen. Visible stars and gas inside galaxies and clusters account for less than 10% of the ordinary matter contribution to the mass-energy density of the universe. The most widely accepted hypothesis on the form for dark matter is that it is composed of weakly interacting massive particles, WIMPs, that interact only through gravity and the weak force.\nThe dark matter hypothesis plays a central role in current modeling of cosmic structure formation, galaxy formation and evolution, and on explanations of the anisotropies observed in the cosmic microwave background, CMB. All these lines of evidence suggest that galaxies, galaxy clusters, and the universe as a whole contain far more matter than that which is observable via electromagnetic signals. Many experiments to detect proposed dark matter particles through non-gravitational means are under way; however, no dark matter particle has been conclusively identified.\n\nAlthough the existence of dark matter is generally accepted by most of the astronomical community, a minority of astronomers, motivated by the lack of conclusive identification of dark matter, or by observations that don't fit the model, argue for various modifications of the standard laws of general relativity, such as \nMOND, TeVeS, and conformal gravity[https://higgs.ph.ed.ac.uk/sites/default/files/Nesbet_HS14.pdf Conformal theory: New light on dark matter, dark energy, and dark galactic halos].\" (PDF) Robert K. Nesbet. IBM Almaden Research Center, 17 June 2014. that attempt to account for the observations without invoking additional matter.\n\nHistory \n\nEarly history \n\nThe hypothesis of dark matter has an elaborate history. In a talk given in 1884,[http://www.science-site.net/darkmatter.htm] Lord Kelvin estimated the number of dark bodies in the Milky Way from the observed velocity dispersion of the stars orbiting around the center of the galaxy. By using these measurements, he estimated the mass of the galaxy, which he determined to be different from the mass of visible stars. Lord Kelvin thus concluded that “many of our stars, perhaps a great majority of them, may be dark bodies.”\n\nIn 1906 Henri Poincaré in “The Milky Way and Theory of Gases” used \"dark matter,” or “matière obscure” in French in discussing Kelvin's work.\n\nThe first to suggest the existence of dark matter, using stellar velocities, was Dutch astronomer Jacobus Kapteyn in 1922. (emphasis in original) Fellow Dutchman and radio astronomy pioneer Jan Oort also hypothesized the existence of dark matter in 1932.Oort, J.H. (1932) \"The force exerted by the stellar system in the direction perpendicular to the galactic plane and some related problems,\" Bulletin of the Astronomical Institutes of the Netherlands, 6 : 249–287. Oort was studying stellar motions in the local galactic neighborhood and found that the mass in the galactic plane must be greater than what was observed, but this measurement was later determined to be erroneous.\n\nIn 1933, Swiss astrophysicist Fritz Zwicky, who studied galactic clusters while working at the California Institute of Technology, made a similar inference. See also  Zwicky applied the virial theorem to the Coma Cluster and obtained evidence of unseen mass that he called dunkle Materie 'dark matter'. Zwicky estimated its mass based on the motions of galaxies near its edge and compared that to an estimate based on its brightness and number of galaxies. He estimated that the cluster had about 400 times more mass than was visually observable. The gravity effect of the visible galaxies was far too small for such fast orbits, thus mass must be hidden from view. Based on these conclusions, Zwicky inferred that some unseen matter provided the mass and associated gravitation attraction to hold the cluster together. This was the first formal inference about the existence of dark matter.Some details of Zwicky's calculation and of more modern values are given in  Zwicky's estimates were off by more than an order of magnitude, mainly due to an obsolete value of the Hubble constant; \nthe same calculation today shows a smaller fraction, using greater values for luminous mass. However, Zwicky did correctly infer that the bulk of the matter was dark.\n\nThe first robust indications that the mass to light ratio was anything other than unity came from measurements of galaxy rotation curves. In 1939, Horace W. Babcock reported the rotation curve for the Andromeda nebula (known now as the Andromeda Galaxy), which suggested that the mass-to-luminosity ratio increases radially.Babcock, H, 1939, \"[http://ads.nao.ac.jp/cgi-bin/nph-iarticle_query?1939LicOB..19...41B&data_type\nPDF_HIGH&whole_paperYES&type\nPRINTER&filetype=.pdf The rotation of the Andromeda Nebula]\", Lick Observatory bulletin ; no. 498 He attributed it to either light absorption within the galaxy or modified dynamics in the outer portions of the spiral and not to missing matter.\n\n1970s \n\nVera Rubin and Kent Ford in the 1960s–1970s provided further strong evidence, also using galaxy rotation curves.[http://www.darkmatterphysics.com/Galactic-rotation-curves-of-spiral-galaxies.htm First observational evidence of dark matter]. Darkmatterphysics.com. Retrieved 6 August 2013. Rubin worked with a new spectrograph to measure the velocity curve of edge-on spiral galaxies with greater accuracy. This result was confirmed in 1978. An influential paper presented Rubin's results in 1980. Rubin found that most galaxies must contain about six times as much dark as visible mass; thus, by around 1980 the apparent need for dark matter was widely recognized as a major unsolved problem in astronomy.\n\nAt the same time that Rubin and Ford were exploring optical rotation curves, radio astronomers were making use of new radio telescopes to map the 21 cm line of atomic hydrogen in nearby galaxies. The radial distribution of interstellar atomic hydrogen often extends to much larger galactic radii than those accessible by optical studies, allowing the sampling of rotation curves – and thus of the total mass distribution – to a new dynamical regime. Early mapping of Andromeda with the 300-foot telescope at Green Bank  and the 250-foot dish at Jodrell Bank  already showed that the HI rotation curve did not trace the expected Keplerian decline. As more sensitive receivers became available, Morton Roberts and Robert Whitehurst  were able to trace the rotational velocity of Andromeda to 30 kpc, much beyond the optical measurements. Illustrating the advantage of tracing the gas disk at large radii, Figure 16 of that paper  combines the optical data  (the cluster of points at radii of less than 15 kpc with a single point further out) with the HI data between 20 and 30 kpc, exhibiting the flatness of the outer galaxy rotation curve; the solid curve peaking at the center is the optical surface density, while the other curve shows the cumulative mass, still rising linearly at the outermost measurement. In parallel, the use of interferometric arrays for extragalactic HI spectroscopy was being developed. In 1972, David Rogstad and Seth Shostak  published HI rotation curves of five spirals mapped with the Owens Valley interferometer; the rotation curves of all five were very flat, suggesting very large values of mass-to-light ratio in the outer parts of their extended HI disks.\n\nA stream of observations in the 1980s indicated its presence, including gravitational lensing of background objects by galaxy clusters, the temperature distribution of hot gas in galaxies and clusters, and the pattern of anisotropies in the cosmic microwave background. According to consensus among cosmologists, dark matter is composed primarily of a not yet characterized type of subatomic particle. The search for this particle, by a variety of means, is one of the major efforts in particle physics.\n\nTechnical definition \n\nIn standard cosmology, matter is anything whose energy density scales with the inverse cube of the scale factor, i.e. ρ ∝ a−3. This is in contrast to radiation, which scales to the inverse fourth power of the scale factor ρ ∝ a−4, and dark energy, which is unaffected ρ ∝ a0. This can be understood intuitively: for an ordinary particle in a square box, doubling the length of the sides of the box decreases the density (and hence energy density) by a factor of eight (23). For radiation, the decrease in energy density is greater, because an increase in spatial distance also causes a redshift. Dark energy, as an intrinsic property of space, has a constant energy density regardless of the volume under consideration.\n\nDark matter is that component of the universe which is not ordinary matter, but still obeys ρ ∝ a−3.\n\nObservational evidence \n\nGalaxy rotation curves \n\nThe arms of spiral galaxies rotate around the galactic centre. The luminous mass density of a spiral galaxy decreases as one goes from the centre to the outskirts. If luminous mass were all the matter, then we can model the galaxy as a point mass in the centre and test masses orbiting around it (similar to the solar system).This is a consequence of the shell theorem and the observation that spiral galaxies are spherically symmetric to a large extent (in 2D). From Kepler's Second Law, we expect that the rotation velocities will decrease with distance from the centre, similar to our solar system. This is not observed. Instead, the galaxy rotation curve remains flat as distant from the centre as the data is available.\n\nIf we assume the validity of Kepler's laws, then the obvious way to resolve this discrepancy is to conclude that the mass distribution in spiral galaxies is not similar to that of the solar system. In particular, there is a lot of non-luminous matter in the outskirts of the galaxy (\"dark matter\").\n\nVelocity dispersions \n\nStars in bound systems must obey the virial theorem. The theorem, together with the measured velocity distribution, can be used to measure the mass distribution in a bound system, such as elliptical galaxies or globular clusters. With some exceptions, velocity dispersion estimates of elliptical galaxies do not match the predicted velocity dispersion from the observed mass distribution, even assuming complicated distributions of stellar orbits.\n\nAs with galaxy rotation curves, the obvious way to resolve the discrepancy is to postulate the existence of non-luminous matter.\n\nGalaxy clusters \n\nGalaxy clusters are particularly important for dark matter studies since their masses can be estimated in three independent ways:\n\n* From the scatter in radial velocities of the galaxies within clusters\n* From X-rays emitted by hot gas in the clusters. From the X-ray energy spectrum and flux, the gas temperature and density can be estimated, hence giving the pressure; assuming pressure and gravity balance determines the cluster's mass profile. \n* Gravitational lensing (usually of more distant galaxies) can measure cluster masses without relying on observations of dynamics (e.g., velocity).\n\nGenerally, these three methods are in reasonable agreement that dark matter outweighs visible matter by approximately 5 to 1.\n\nGravitational lensing \n\nOne of the consequences of general relativity is that massive objects (such as a cluster of galaxies) lying between a more distant source (such as a quasar) and an observer should act as a lens to bend the light from this source. The more massive an object, the more lensing is observed.\n\nStrong lensing is the observed distortion of background galaxies into arcs when their light passes through such a gravitational lens. It has been observed around many distant clusters including Abell 1689. By measuring the distortion geometry, the mass of the intervening cluster can be obtained. In the dozens of cases where this has been done, the mass-to-light ratios obtained correspond to the dynamical dark matter measurements of clusters. Lensing can lead to multiple copies of an image. By analyzing the distribution of multiple image copies, scientists have been able to deduce and map the distribution of dark matter around the MACS J0416.1-2403 galaxy cluster.\n\nWeak gravitational lensing investigates minute distortions of galaxies, using statistical analyses from vast galaxy surveys. By examining the apparent shear deformation of the adjacent background galaxies, the mean distribution of dark matter can be characterized. The mass-to-light ratios correspond to dark matter densities predicted by other large-scale structure measurements.\n\nCosmic microwave background \n\nAlthough both dark matter and ordinary matter are \"matter\", they do not behave in the same way. In particular, in the early universe, ordinary matter was ionized and interacted strongly with radiation via Thomson scattering. Dark matter does not interact directly with radiation, but it does affect the CMB by its gravitational potential (mainly on large scales), and by its effects on the density and velocity of ordinary matter. Ordinary and dark matter perturbations therefore evolve differently with time, and leave different imprints on the cosmic microwave background (CMB).\n\nThe cosmic microwave background is very close to a perfect blackbody, but contains very small temperature anisotropies of a few parts in 100,000. A sky map of anisotropies can be decomposed into an angular power spectrum, which is observed to contain a series of \"acoustic peaks\" at near-equal spacing but different heights. \nThe series of peaks can be predicted for any assumed set of cosmological parameters by modern computer codes such as CMBFast and CAMB, and matching theory to data therefore constrains cosmological parameters.The details are technical. See  for an intermediate-level introduction. The first peak mostly shows the density of baryonic matter, while the third peak relates mostly to the density of dark matter, measuring the density of matter and the density of atoms.\n\nThe CMB anisotropy was first discovered by COBE in 1992, though this had too coarse resolution to detect\nthe acoustic peaks. \nAfter the discovery of the first acoustic peak by the balloon-borne BOOMERanG experiment in 2000, \nthe power spectrum was precisely observed by WMAP in 2003-12, and even more precisely \nby the Planck spacecraft in 2013-15. The results support the Lambda-CDM model.\n\nThe observed CMB angular power spectrum provides powerful evidence in support of dark matter, as its precise structure is well fitted by the Lambda-CDM model but difficult to reproduce with any competing model such as MOND.\n\nStructure formation \n\nStructure formation refers to the period after the Big Bang when density perturbations collapsed to form stars, galaxies, and clusters. Prior to structure formation, the Friedmann solutions to general relativity describe a homogeneous universe. Later, small anisotropies gradually grew and condensed the homogeneous universe into stars, galaxies and larger structures. Ordinary matter is affected by radiation, which is the dominant element of the universe at very early times. As a result, its density perturbations are washed out and unable to condense into structure. If there were only ordinary matter in the universe, there would not have been enough time for density perturbations to grow into the galaxies and clusters that we see today.\n\nDark matter provides a solution to this problem because it is unaffected by radiation. Therefore, its density perturbations can grow first. The resulting gravitational potential acts as an attractive potential well for ordinary matter collapsing later, speeding up the structure formation process.\n\nType Ia supernova distance measurements \n\nType Ia supernovae can be used as \"standard candles\" to measure extragalactic distances, which can in turn be used to measure how fast the universe has expanded in the past. The data indicates that the universe is expanding at an accelerating rate, the cause of which is usually ascribed to dark energy. Since observations indicate the universe is almost flat, we expect the total energy density of everything in the universe to sum to 1 (Ωtot ~ 1). The measured dark energy density is ΩΛ ~0.690; the observed ordinary (baryonic) matter energy density is Ωb \n ~0.0482 and the energy density of radiation is negligible. This leaves a missing Ωdm ~0.258 that nonetheless behaves like matter (see technical definition section above) – dark matter.\n\nSky surveys and baryon acoustic oscillations \n\nBaryon acoustic oscillations (BAO) are regular, periodic fluctuations in the density of the visible baryonic matter (normal matter) of the universe. These are predicted to arise in the Lambda-CDM model due to the early universe's acoustic oscillations in the photon-baryon fluid and can be observed in the cosmic microwave background angular power spectrum. BAOs set up a preferred length scale for baryons. As the dark matter and baryons clumped together after recombination, the effect is much weaker in the galaxy distribution in the nearby universe, but is detectable as a subtle (~ 1 percent) preference for pairs of galaxies to be separated by 147 Mpc, compared to those separated by 130 or 160 Mpc. This feature was predicted theoretically in the 1990s and then discovered in 2005, in two large galaxy redshift surveys, the Sloan Digital Sky Survey and the 2dF Galaxy Redshift Survey.\n Combining the CMB observations with BAO measurements from galaxy redshift surveys provides a precise estimate of the Hubble constant and the average matter density in the Universe. The results support the Lambda-CDM model.\n\nRedshift-space distortions \n\nLarge galaxy redshift surveys may be used to make a three-dimensional map of the galaxy distribution. These maps are slightly distorted because distances are estimated from observed redshifts; the redshift contains a contribution from the galaxy's so-called peculiar velocity in addition to the dominant Hubble expansion term. On average, superclusters are expanding but more slowly than the cosmic mean due to their gravity, while voids are expanding faster than average. In a redshift map, galaxies in front of a supercluster have excess radial velocities towards it and have redshifts slightly higher than their distance would imply, while galaxies behind the supercluster have redshifts slightly low for their distance.  This effect causes superclusters to appear \"squashed\" in the radial direction, and likewise voids are \"stretched\"; angular positions are unaffected.   \nThe effect is not detectable for any one structure since the true shape is not known, but can be measured by averaging over many structures assuming we are not at a special location in the Universe.\n\nThe effect was predicted quantitatively by Nick Kaiser in 1987, and first decisively measured in 2001 by the 2dF Galaxy Redshift Survey. Results are in agreement with the Lambda-CDM model.\n\nLyman-alpha forest \n\nIn astronomical spectroscopy, the Lyman-alpha forest is the sum of the absorption lines arising from the Lyman-alpha transition of neutral hydrogen in the spectra of distant galaxies and quasars. Lyman-alpha forest observations can also constrain cosmological models.\n These constraints agree with those obtained from WMAP data.\n\nComposition of dark matter: baryonic vs. nonbaryonic \n\nDark matter can refer to any substance which interacts predominantly via gravity with visible matter (e.g. stars and planets). Hence in principle it need not be composed of a new type of fundamental particle but could, at least in part, be made up of standard baryonic matter, such as protons or electrons. However, for the reasons outlined below, most scientists consider the dark matter to be dominated by a non-baryonic component, which is likely composed of a currently unknown fundamental particle (or similar exotic state).\n\nBaryonic matter \n\nBaryons (protons and neutrons) make up ordinary stars and planets. However, baryonic matter also encompasses less common black holes, neutron stars, faint old white dwarfs and brown dwarfs, collectively known as massive compact halo objects (MACHOs). This ordinary, but hard to see, matter could explain dark matter.\n\nHowever multiple lines of evidence suggest the majority of dark matter is not made of baryons:\n\n* Sufficient diffuse, baryonic gas or dust would be visible when backlit by stars. \n* The theory of Big Bang nucleosynthesis predicts the observed abundance of the chemical elements. If there are more baryons, then there should also be more helium, lithium and heavier elements synthesized during the Big Bang.Achim Weiss, \"[http://www.einstein-online.info/spotlights/BBN Big Bang Nucleosynthesis: Cooking up the first light elements]\" in: Einstein Online Vol. 2 (2006), 1017 Agreement with observed abundances requires that baryonic matter makes up between 4–5% of the universe's critical density. In contrast, large-scale structure and other observations indicate that the total matter density is about 30% of the critical density.\n* Astronomical searches for gravitational microlensing in the Milky Way found that at most a small fraction of the dark matter may be in dark, compact, conventional objects (MACHOs, etc.); the excluded range of object masses is from half the Earth's mass up to 30 solar masses, which covers nearly all the plausible candidates.Wyrzykowski, Lukasz et al. (2011) [https://arxiv.org/abs/1106.2925 The OGLE view of microlensing towards the Magellanic Clouds – IV. OGLE-III SMC data and final conclusions on MACHOs], MNRAS, 416, 2949 \n* Detailed analysis of the small irregularities (anisotropies) in the cosmic microwave background. Observations by WMAP and Planck indicate that around five-sixths of the total matter is in a form that interacts significantly with ordinary matter or photons only through gravitational effects.\n\nNon-baryonic matter \n\nCandidates for nonbaryonic dark matter are hypothetical particles such as axions, sterile neutrinos or WIMPs (e.g. supersymmetric particles). The three neutrino types already observed are indeed abundant, and “dark”, and matter, but because their individual masses – however uncertain they may be – are almost certainly tiny, they can only supply a small fraction of dark matter, due to limits derived from large-scale structure and high-redshift galaxies.\n\nUnlike baryonic matter, nonbaryonic matter did not contribute to the formation of the elements in the early universe (\"Big Bang nucleosynthesis\") and so its presence is revealed only via its gravitational effects, or, weak lensing. In addition, if the particles of which it is composed are supersymmetric, they can undergo annihilation interactions with themselves, possibly resulting in observable by-products such as gamma rays and neutrinos (\"indirect detection\").\n\nClassification of dark matter: cold, warm or hot \n\nDark matter can be divided into cold, warm and hot categories. These categories refer to velocity rather than an actual temperature, indicating how far corresponding objects moved due to random motions in the early universe, before they slowed due to cosmic expansion – this is an important distance called the \"free streaming length\" (FSL). Primordial density fluctuations smaller than this length get washed out as particles spread from overdense to underdense regions, while larger fluctuations are unaffected; therefore this length sets a minimum scale for later structure formation. The categories are set with respect to the size of a protogalaxy (an object that later evolves into a dwarf galaxy): dark matter particles are classified as cold, warm, or hot according as their FSL; much smaller (cold), similar (warm), or much larger (hot) than a protogalaxy.\n\nMixtures of the above are also possible: a theory of mixed dark matter was popular in the mid-1990s, but was rejected following the discovery of dark energy.\n\nCold dark matter leads to a \"bottom-up\" formation of structure while hot dark matter would result in a \"top-down\" formation scenario; the latter is excluded by high-redshift galaxy observations.\n\nAlternative definitions \n\nThese categories also correspond to fluctuation spectrum effects and the interval following the Big Bang at which each type became non-relativistic. Davis et al. wrote in 1985:\n\nAnother approximate dividing line is that \"warm\" dark matter became non-relativistic when the universe was approximately 1 year old and 1 millionth of its present size and in the radiation-dominated era (photons and neutrinos), with a photon temperature 2.7 million K. Standard physical cosmology gives the particle horizon size as 2ct (speed of light multiplied by time) in the radiation-dominated era, thus 2 light-years. A region of this size would expand to 2 million light years today (absent structure formation). The actual FSL is roughly 5 times the above length, since it continues to grow slowly as particle velocities decrease inversely with the scale factor after they become non-relativistic. In this example the FSL would correspond to 10 million light-years or 3 Mpc today, around the size containing an average large galaxy.\n\nThe 2.7 million K photon temperature gives a typical photon energy of 250 electron-volts, thereby setting a typical mass scale for \"warm\" dark matter: particles much more massive than this, such as GeV – TeV mass WIMPs, would become non-relativistic much earlier than 1 year after the Big Bang and thus have FSLs much smaller than a protogalaxy, making them \"cold\". Conversely, much lighter particles, such as neutrinos with masses of only a few eV, have FSLs much larger than a protogalaxy, thus qualifying them as \"hot\".\n\nCold dark matter \n\n\"Cold\" dark matter offers the simplest explanation for most cosmological observations. It is dark matter composed of constituents with an FSL much smaller than a protogalaxy. This is the focus for dark matter research, as hot dark matter does not seem to be capable of supporting galaxy or galaxy cluster formation, and most particle candidates slowed early.\n\nThe constituents of \"cold\" dark matter are unknown. Possibilities range from large objects like MACHOs (such as black holes) or RAMBOs (such as clusters of brown dwarfs), to new particles such as WIMPs and axions.\n\nStudies of Big Bang nucleosynthesis and gravitational lensing convinced most cosmologistsOlive, Keith A. (2003). [https://arxiv.org/abs/astro-ph/0301505 \"TASI Lectures on Dark Matter\"]. p. 21 that MACHOs cannot make up more than a small fraction of dark matter. According to A. Peter: \"... the only really plausible dark-matter candidates are new particles.\"\n\nThe 1997 DAMA/NaI experiment and its successor DAMA/LIBRA in 2013, claimed to directly detect dark matter particles passing through the Earth, but many researchers remain skeptical, as negative results from similar experiments seem incompatible with the DAMA results.\n\nMany supersymmetric models offer dark matter candidates in the form of the WIMPy Lightest Supersymmetric Particle (LSP). Separately, heavy sterile neutrinos exist in non-supersymmetric extensions to the standard model that explain the small neutrino mass through the seesaw mechanism.\n\nWarm dark matter \n\n\"Warm\" dark matter refers to particles with an FSL comparable to the size of a protogalaxy. Predictions based on warm dark matter are similar to those for cold dark matter on large scales, but with less small-scale density perturbations. This reduces the predicted abundance of dwarf galaxies and may lead to lower density of dark matter in the central parts of large galaxies; some researchers consider this to be a better fit to observations. A challenge for this model is the lack of particle candidates with the required mass ~ 300 eV to 3000 eV.\n\nNo known particles can be categorized as \"warm\" dark matter. A postulated candidate is the sterile neutrino: a heavier, slower form of neutrino that does not interact through the weak force,  unlike other neutrinos. Some modified gravity theories, such as scalar-tensor-vector gravity, require \"warm\" dark matter to make their equations work.\n\nHot dark matter \n\n\"Hot\" dark matter consists of particles whose FSL is much larger than the size of a protogalaxy. The neutrino qualifies as such particle. They were discovered independently, long before the hunt for dark matter: they were postulated in 1930, and detected in 1956. Neutrinos' mass is less than 10−6 that of an electron. Neutrinos interact with normal matter only via gravity and the weak force, making them difficult to detect (the weak force only works over a small distance, thus a neutrino triggers a weak force event only if it hits a nucleus head-on). This makes them 'weakly interacting light particles' (WILPs), as opposed to WIMPs.\n\nThe three known flavours of neutrinos are the electron, muon, and tau. Their masses are slightly different. Neutrinos oscillate among the flavours as they move. It is hard to determine an exact upper bound on the collective average mass of the three neutrinos (or for any of the three individually). For example, if the average neutrino mass were over 50 eV/c2 (less than 10−5 of the mass of an electron), the universe would collapse. CMB data and other methods indicate that their average mass probably does not exceed 0.3 eV/c2. Thus, observed neutrinos cannot explain dark matter.\n\nBecause galaxy-size density fluctuations get washed out by free-streaming, \"hot\" dark matter implies that the first objects that can form are huge supercluster-size pancakes, which then fragment into galaxies. Deep-field observations show instead that galaxies formed first, followed by clusters and superclusters as galaxies clump together.\n\nDetection of dark matter particles \n\nIf dark matter is made up of sub-atomic particles, then millions, possibly billions, of such particles must pass through every square centimeter of the Earth each second.\n Many experiments aim to test this hypothesis. Although WIMPs are popular search candidates, the Axion Dark Matter eXperiment (ADMX) searches for axions. Another candidate is heavy hidden sector particles that only interact with ordinary matter via gravity.\n\nThese experiments can be divided into two classes: direct detection experiments, which search for the scattering of dark matter particles off atomic nuclei within a detector; and indirect detection, which look for the products of dark matter particle annihilations or decays.\n\nDirect detection \n\nDirect detection experiments aim to observe low-energy recoils (typically a few keVs) of nuclei induced by interactions with particles of dark matter, which (in theory) are passing through the Earth. After such a recoil the nucleus will emit energy as e.g. scintillation light or phonons, which is then detected by sensitive apparatus. In order to do this effectively it is crucial to maintain a low background, and so such experiments operate deep underground to reduce the interference from cosmic rays. Examples of underground laboratories which house direct detection experiments include the Stawell mine, the Soudan mine, the SNOLAB underground laboratory at Sudbury, the Gran Sasso National Laboratory, the Canfranc Underground Laboratory, the Boulby Underground Laboratory, the Deep Underground Science and Engineering Laboratory and the China Jinping Underground Laboratory.\n\nThese experiments mostly use either cryogenic or noble liquid detector technologies. Cryogenic detectors operating at temperatures below 100mK, detect the heat produced when a particle hits an atom in a crystal absorber such as germanium. Noble liquid detectors detect scintillation produced by a particle collision in liquid xenon or argon. Cryogenic detector experiments include: CDMS, CRESST, EDELWEISS, EURECA. Noble liquid experiments include ZEPLIN, XENON, DEAP, ArDM, WARP, DarkSide, PandaX, and LUX, the Large Underground Xenon experiment. Both of these techniques focus strongly on their ability to distinguish background particles (which predominantly scatter off electrons) from dark matter particles (that scatter off nuclei). Other experiments include SIMPLE and PICASSO.\n\nCurrently there has been no well-established claim of dark matter detection from a direct detection experiment, leading instead to strong upper limits on the mass and interaction cross section with nucleons of such dark matter particles. The DAMA/NaI and more recent DAMA/LIBRA experimental collaborations claim to have detected an annual modulation in the rate of events in their detectors, which they claim is due to dark matter. This results from the expectation that as the Earth orbits the Sun, the velocity of the detector relative to the dark matter halo will vary by a small amount. This claim is so far unconfirmed and in contradiction with negative results from other experiments such as LUX and SuperCDMS.\n\nA special case of direct detection experiments covers those with directional sensitivity. This is a search strategy based on the motion of the Solar System around the Galactic Center. A low pressure time projection chamber makes it possible to access information on recoiling tracks and constrain WIMP-nucleus kinematics. WIMPs coming from the direction in which the Sun is travelling (roughly towards Cygnus) may then be separated from background, which should be isotropic. Directional dark matter experiments include DMTPC, DRIFT, Newage and MIMAC.\n\nIndirect detection \n\nIndirect detection experiments search for the products of the self-annihilation or decay of dark matter particles in outer space. For example, in regions of high dark matter density (e.g. the centre of our galaxy) two dark matter particles could annihilate to produce gamma rays or Standard Model particle-antiparticle pairs. Alternatively if the dark matter particle is unstable, it could decay into standard model (or other) particles. These processes could be detected indirectly through an excess of gamma rays, antiprotons or positrons emanating from high density regions in our galaxy or others. A major difficulty inherent in such searches is that there are various astrophysical sources which can mimic the signal expected from dark matter, and so multiple signals will likely be required for a conclusive discovery.\n\nA few of the dark matter particles passing through the Sun or Earth may scatter off atoms and lose energy. Thus dark matter may accumulate at the center of these bodies, increasing the chance of collision/annihilation. This could produce a distinctive signal in the form of high-energy neutrinos. Such a signal would be strong indirect proof of WIMP dark matter. High-energy neutrino telescopes such as AMANDA, IceCube and ANTARES are searching for this signal.\nThe detection by LIGO in September 2015 of gravitational waves, opens the possibility of observing dark matter in a new way, particularly if it is the form of primordial black holes.\n\nMany experimental searches have been undertaken to look for such emission from dark matter annihilation or decay, examples of which follow.\nThe Energetic Gamma Ray Experiment Telescope observed more gamma rays in 2008 than expected from the Milky Way, but scientists concluded that this was most likely due to incorrect estimation of the telescope's sensitivity.\n\nThe Fermi Gamma-ray Space Telescope is searching for similar gamma rays. In April 2012, an analysis of previously available data from its Large Area Telescope instrument produced statistical evidence of a 130 GeV signal in the gamma radiation coming from the center of the Milky Way. WIMP annihilation was seen as the most probable explanation.\n\nAt higher energies, ground-based gamma-ray telescopes have set limits on the annihilation of dark matter in dwarf spheroidal galaxies and in clusters of galaxies.\n\nThe PAMELA experiment (launched 2006) detected excess positrons. They could be from dark matter annihilation or from pulsars. No excess antiprotons were observed.\n\nIn 2013 results from the Alpha Magnetic Spectrometer on the International Space Station indicated excess high-energy cosmic rays that could be due to dark matter annihilation.\n\nCollider searches for dark matter \n\nAn alternative approach to the detection of dark matter particles in nature is to produce them in a laboratory. Experiments with the Large Hadron Collider (LHC) may be able to detect dark matter particles produced in collisions of the LHC proton beams. Because a dark matter particle should have negligible interactions with normal visible matter, it may be detected indirectly as (large amounts of) missing energy and momentum that escape the detectors, provided other (non-negligible) collision products are detected. \nConstraints on dark matter also exist from the LEP experiment using a similar principle, but probing the interaction of dark matter particles with electrons rather than quarks. It is important to note that any discovery from collider searches will need to be corroborated by discoveries in the indirect or direct detection sectors, in order to prove that the particle discovered is in fact the dark matter of our Universe.\n\nAlternative hypotheses \n\nBecause dark matter remains to be conclusively identified, many other hypotheses have emerged aiming to explain the observational phenomena that dark matter was conceived to explain. Many hypotheses suggest that the theory of general relativity may simply be incorrect in describing these phenomena. General relativity is well-tested on solar system scales, but its validity on galactic or cosmological scales has not been well proven. A suitable modification to general relativity can conceivably eliminate the need for dark matter. The most well-known theories of this class are MOND and its relativistic generalization TeVeS,For a review, see:  f(R) gravityFor a review, see:  and entropic gravity. Alternative theories abound.\n\nA problem with alternative hypotheses is that the observational evidence for dark matter comes from so many independent approaches (see the \"observational evidence\" section above). Any alternative hypothesis not only has to explain all the evidence, it also has to explain individual cases such as the Bullet Cluster, Abstract only wherein observations indicate that the location of the center of mass is far away from the center of baryonic mass. Nonetheless, there have been some scattered successes for alternative hypotheses, such as a 2016 test of gravitational lensing in entropic gravity.\n\nThe prevailing opinion among most astrophysicists is that while modifications to general relativity can conceivably explain part of the observational evidence, there is probably enough data to conclude there must be some form of dark matter.\n\nIn philosophy of science\n\nIn philosophy of science, dark matter is an example of an \"auxiliary hypothesis\", an ad hoc postulate that is added to a theory in response to observations that falsify it. It has been argued that the dark matter hypothesis is a conventionalist hypothesis, that is, a hypothesis that adds no empirical content and hence is unfalsifiable in the sense defined by Karl Popper.Merritt, David [http://www.sciencedirect.com/science/article/pii/S1355219816301563 \"Cosmology and Convention\"], Studies In History and Philosophy of Science Part B: Studies In History and Philosophy of Modern Physics, 57(1):41–52, February 2017.\n\nIn popular culture \n\nMention of dark matter is made in works of fiction. In such cases, it is usually attributed extraordinary physical or magical properties. Such descriptions are often inconsistent with the hypothesized properties of dark matter in physics and cosmology. Dark matter. http://en.wikipedia.org/?curid=8651."
  }
}
