{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14388",
  "eid" : "143d0600-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778543200,
  "textBody" : "Hephaestus (; eight spellings;  Hēphaistos) is the Greek god of blacksmiths, metalworking, carpenters, craftsmen, artisans, sculptors, metallurgy, fire, and volcanoes.Walter Burkert, Greek Religion 1985: III.2.ii; see coverage of Lemnos-based traditions and legends at Mythic Lemnos Hephaestus' Roman equivalent is Vulcan. In Greek mythology, Hephaestus was the son of Zeus and Hera, the king and queen of the gods. In another version, he was Hera's parthenogenous child, rejected by his mother because of his deformity and thrown off Mount Olympus and down to earth.\n\nAs a smithing god, Hephaestus made all the weapons of the gods in Olympus. He served as the blacksmith of the gods, and was worshipped in the manufacturing and industrial centers of Greece, particularly Athens. The cult of Hephaestus was based in Lemnos. Hephaestus' symbols are a smith's hammer, anvil, and a pair of tongs.\n\nEtymology\n\nHephaestus is probably associated with the Linear B (Mycenean Greek) inscription , A-pa-i-ti-jo, found  at Knossos; the inscription indirectly attests his worship at that time because it is believed that it reads the theophoric name Haphaistios or Haphaistion. At Google Books. At Google Books The name of the god in Greek (Hēphaistos) has a root which can be observed in  names of places of Pre-Greek origin, like PhaistosProbably Phaistos, like Athēnā. Chadwick (1976), p. 87.R. S. P. Beekes, Etymological Dictionary of Greek, Brill, 2009, p. 527. (Pa-i-to in Linear B).\n\nEpithets\n\nHephaestus is given many epithets. The meaning of each epithet is:\n* Amphigúeis \"the lame one\" ()\n* Kullopodíōn \"the halting\" ()\n* Khalkeús \"coppersmith\" ()\n* Klutotékhnēs \"renowned artificer\" ()\n* Polúmētis \"shrewd, crafty\" or \"of many devices\" ()\n* Aitnaîos \"Aetnaean\" (), owing to his workshop being supposedly located below Mount Aetna.Aelian, Hist. An. xi. 3, referenced under [http://quod.lib.umich.edu/m/moa/acl3129.0001.001/69?pageroot;size\n100;view=image Aetnaeus] in William Smith's Dictionary of Greek and Roman Biography and Mythology\n\nMythology\n\nCraft of Hephaestus\n\nHephaestus had his own palace on Olympus, containing his workshop with anvil and twenty bellows that worked at his bidding.Il. xviii. 370, &c. Hephaestus crafted much of the magnificent equipment of the gods, and almost any finely wrought metalwork imbued with powers that appears in Greek myth is said to have been forged by Hephaestus. He designed Hermes' winged helmet and sandals, the Aegis breastplate, Aphrodite's famed girdle, Agamemnon's staff of office,The provenance of the staff of office is recounted in Iliad II Achilles' armor, Heracles' bronze clappers, Helios's chariot, the shoulder of Pelops, and Eros's bow and arrows. In later accounts, Hephaestus worked with the help of the chthonic Cyclopes—among them his assistants in the forge, Brontes, Steropes and Pyracmon.Virg. Aen. viii. 416, &c.\n\nHephaestus built automatons of metal to work for him. This included tripods that walked to and from Mount Olympus. He gave to the blinded Orion his apprentice Cedalion as a guide. In some versions of the myth, Prometheus stole the fire that he gave to man from Hephaestus's forge. Hephaestus also created the gift that the gods gave to man, the woman Pandora and her pithos. Being a skilled blacksmith, Hephaestus created all the thrones in the Palace of Olympus.\n\nThe Greek myths and the Homeric poems sanctified in stories that Hephaestus had a special power to produce motion.Iliad, XVIII 372ff He made the golden and silver lions and dogs at the entrance of the palace of Alkinoos in such a way that they could bite the invaders.Iliad, VIII: Nigel Spivey (1997): The Greek art. Phaidon Press Limited, p.9 The Greeks maintained in their civilization an animistic idea that statues are in some sense alive. This kind of art and the animistic belief goes back to the Minoan period, when Daedalus, the builder of the labyrinth, made images which moved of their own accord.Diodorus Siculus, LV 76 A statue of the god was somehow the god himself, and the image on a man's tomb indicated somehow his presence.C.M.Bowra (1957).The Greek experience. The World Publishing company. p.159\n\nParentage\n\nHomer's Odyssey and Iliad have Hephaestus being born of the union of Zeus and Hera.In Homer, Odyssey viii. 312 Hephaestus addresses \"Father Zeus\"; cf. Homer, Iliad i. 578 (some scholars, such as Gantz, Early Greek Myth, p. 74, note that Hephaestus' reference to Zeus as 'father' here may be a general title), xiv. 338, xviii. 396, xxi. 332. See also Cicero, De Natura Deorum 3.22.\n\nIn another tradition, attested by Hesiod, Hera bore Hephaestus alone.Hesiod, Theogony 924ff. In Hesiod's Zeus-centered cosmology, Hera gave birth to Hephaestus as revenge for Zeus giving birth to Athena without her.\n\nSeveral later texts follow Hesiod's account, including Bibliotheke,i. 3.5 (consciously contradicting Homer) Hyginus, and the preface to Fabulae.\n\nIn the account of Attic vase painters, Hephaestus was present at the birth of Athena and wields the axe with which he split Zeus' head to free her. In the latter account, Hephaestus is there represented as older than Athena, so the mythology of Hephaestus is inconsistent in this respect.\n\nFall from Olympus\n\nIn one branch of Greek mythology, Hera ejected Hephaestus from the heavens because he was \"shrivelled of foot\". He fell into the ocean and was raised by Thetis (mother of Achilles) and the Oceanid Eurynome.Homeric Hymn to Apollo [http://www.perseus.tufts.edu/hopper/text?docPerseus%3Atext%3A1999.01.0138%3Ahymn%3D3%3Acard%3D305 316–321]; Homer, Iliad [http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.01.0134%3Abook%3D18%3Acard%3D388 395–405].\n\nIn another account, Hephaestus, attempting to rescue his mother from Zeus' advances, was flung down from the heavens by Zeus. He fell for an entire day and landed on the island of Lemnos, where he was cared for and taught to be a master craftsman by the Sintians – an ancient tribe native to that island.Homer, Iliad [http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.01.0134%3Abook%3D1%3Acard%3D568 1.590–594]; Valerius Flaccus, ii, 8.5; Apollodorus, i, 3 § 5. Apollodorus confounds the two occasions on which Hephaestus was thrown from Olympus. Later writers describe his lameness as the consequence of his second fall, while Homer makes him lame and weak from his birth.\n\nReturn to Olympus \n\nHephaestus was the only Olympian to have returned to Olympus after being exiled.\n\nIn an archaic story,Features within the narrative suggest to Kerenyi and others that it is archaic; the most complete literary account, however, is a late one, in the Roman rhetorician Libanios, according to Hedreen (2004).Guy Hedreen (2004) The Return of Hephaistos, Dionysiac Processional Ritual and the Creation of a Visual Narrative. The Journal of Hellenic Studies, 124 (2004:38–64) p. 38 and note. Hephaestus gained revenge against Hera for rejecting him by making her a magical golden throne, which, when she sat on it, did not allow her to stand up.A section \"The Binding of Hera\" is devoted to this archaic theme in Kerenyi (1951, pp 156–158), who refers to this \"ancient story\", which is one of the \"tales of guileful deeds performed by cunning gods, mostly at a time when they had not joined the family on Olympus\". The other gods begged Hephaestus to return to Olympus to let her go, but he refused, saying \"I have no mother\".\n\nAt last, Dionysus fetched him, intoxicated him with wine, and took the subdued smith back to Olympus on the back of a mule accompanied by revelers – a scene that sometimes appears on painted pottery of Attica and of Corinth.Axel Seeberg (1965) Hephaistos Rides Again. The Journal of Hellenic Studies, 85, pp. 102–109, describes and illustrates four pieces of Corinthian painted pottery with the themeA black red-figure calpis in the collection of Marsden J. Perry was painted with the return of Hephaestus (Eldridge, 1917, pp 38–54).L. G. Eldridge (1917) An Unpublished Calpis. American Journal of Archaeology, 21.1, pp 38–54 (January–March 1917). In the painted scenes, the padded dancers and phallic figures of the Dionysan throng leading the mule show that the procession was a part of the dithyrambic celebrations that were the forerunners of the satyr plays of fifth century Athens.The significance of the subject for the pre-history of Greek drama is argued by Webster (1958, pp 43 wikt:ff.|) and more recently by Hedreen (2004, pp 38–64).T.B.L. Webster (1958) Some thoughts on the pre-history of Greek drama. Bulletin of the Institute of Classical Studies, 5, pp 43 wikt:ff.|\n\nThe theme of the return of Hephaestus, popular among the Attic vase-painters whose wares were favored among the Etruscans, may have introduced this theme to Etruria.The return of Hephaestus was painted on the Etruscan tomb at the \"Grotta Campana\" near Veii was identified by Petersen (1902); the \"well-known subject\" was doubted in this instance by Harmon (1912).Petersen (1902) Über die älteste etruskische Wandmälerei, pp 149 wikt:ff.|. Rome.A. M. Harmon (1912) The Paintings of the Grotta Campana. American Journal of Archaeology, 16.1, 1–10 (January–March 1912); In the vase-painters' portrayal of the procession, Hephaestus was mounted on a mule or a horse, with Dionysus holding the bridle and carrying Hephaestus' tools (including a double-headed axe).\n\nThe traveller Pausanias reported seeing a painting in the temple of Dionysus in Athens, which had been built in the 5th century but may have been decorated at any time before the 2nd century CE. When Pausanias saw it, he said:\n\nConsorts and children\n\nAccording to most versions, Hephaestus's consort is Aphrodite, who is unfaithful to Hephaestus with a number of gods and mortals, including Ares. However, in Book XVIII of Homer's Iliad, the consort of Hephaestus is a lesser Aphrodite, Charis (\"the grace\") or Aglaia (\"the glorious\") – the youngest of the Graces, as Hesiod calls her.Hesiod, Theogony, 945\n\nIn Athens, there is a Temple of Hephaestus, the Hephaesteum (miscalled the \"Theseum\") near the agora. An Athenian founding myth tells that the city's patron goddess, Athena, refused a union with Hephaestus. Pseudo-Apollodorus records an archaic legend, which claims that Hephaestus once attempted to rape Athena, but she pushed him away, causing him to ejaculate on her thigh. Athena wiped the semen off using a tuft of wool, which she tossed into the dust, impregnating Gaia and causing her to give birth to Erichthonius, whom Athena adopted as her own child. The Roman mythographer Hyginus records a similar story in which Hephaestus demanded Zeus to let him marry Athena since he was the one who had smashed open Zeus's skull, allowing Athena to be born. Zeus agreed to this and Hephaestus and Athena were married, but, when Hephaestus was about to consummate the union, Athena vanished from the bridal bed, causing him to ejaculate on the floor, thus impregnating Gaia with Erichthonius.Hyginus made an imaginative etymology for Erichthonius, of strife (Eris) between Athena and Hephaestus and the Earth-child (chthonios).\n\nOn the island of Lemnos, Hephaestus' consort was the sea nymph Cabeiro, by whom he was the father of two metalworking gods named the Cabeiri. In Sicily, his consort was the nymph Aetna, and his sons were two gods of Sicilian geysers called Palici. With Thalia, Hephaestus was sometimes considered the father of the Palici.\n\nHephaestus fathered several children with mortals and immortals alike. One of those children was the robber Periphetes.\n\nThis is the full list of his consorts and children according to the various accounts:\n\n# Aphrodite\n# Aglaea\n## Eucleia\n## Euthenia\n## Eupheme\n## Philophrosyne\n# Aetna\n## The Palici\n# Cabeiro\n## The Cabeiri\n# Gaia\n## Erichthonius\n# Anticleia\n## Periphetes\n# by unknown mothers\n## Ardalus\n## Cercyon (possibly)\n## Olenus\n## Palaemonius, Argonauts\n## Philottus\n## Pylius\n## Spinter\n\nIn addition, the Romans claim their equivalent god, Vulcan, to have produced the following children:\n# Cacus\n# Caeculus\n\nHephaestus and Aphrodite\n\nThough married to Hephaestus, Aphrodite had an affair with Ares, the god of war. Eventually, Hephaestus discovered Aphrodite’s affair through Helios, the all-seeing Sun, and planned a trap during one of their trysts. While Aphrodite and Ares lay together in bed, Hephaestus ensnared them in an unbreakable chain-link net so small as to be invisible and dragged them to Mount Olympus to shame them in front of the other gods for retribution.\n\nThe gods laughed at the sight of these naked lovers, and Poseidon persuaded Hephaestus to free them in return for a guarantee that Ares would pay the adulterer's fine. Hephaestus states in The Odyssey that he would return Aphrodite to her father and demand back his bride price.\n\nThe Thebans told that the union of Ares and Aphrodite produced Harmonia. However, of the union of Hephaestus with Aphrodite, there was no issue unless Virgil was serious when he said that Eros was their child.Aeneid i.664 Later authors explain this statement by saying that Eros was sired by Ares but passed off to Hephaestus as his own son.\n\nHephaestus was somehow connected with the archaic, pre-Greek Phrygian and Thracian mystery cult of the Kabeiroi, who were also called the Hephaistoi, \"the Hephaestus-men\", in Lemnos. One of the three Lemnian tribes also called themselves Hephaestion and claimed direct descent from the god.\n\nHephaestus and Athena\n\nHephaestus is to the male gods as Athena is to the females, for he gives skill to mortal artists and was believed to have taught men the arts alongside Athena.Od. vi. 233, xxiii. 160. Hymn. in Vaulc. 2. &c. He was nevertheless believed to be far inferior to the sublime character of Athena. At Athens they had temples and festivals in common.See Dict of Ant. s. v. Hêphaisteia, Chalkeia. Both were believed to have great healing powers, and Lemnian earth (terra Lemnia) from the spot on which Hephaestus had fallen was believed to cure madness, the bites of snakes, and haemorrhage, and priests of Hephaestus knew how to cure wounds inflicted by snakes.Philostr. Heroic. v. 2; Eustath. ad Hom. p. 330; Dict. Cret. ii. 14.\n\nHe was represented in the temple of Athena Chalcioecus (Athena of the Bronze HouseThe Museum of Goddess Athena, [http://www.goddess-athena.org/Museum/Temples/Sparta/index.htm Sanctuary of Athena Chalkiokos at Sparta]) at Sparta, in the act of delivering his mother;Paus. iii. 17. § 3 on the chest of Cypselus, giving Achilles's armour to Thetis;v. 19. § 2 and at Athens there was the famous statue of Hephaestus by Alcamenes, in which his lameness was only subtly portrayed.Cic. de Nat. Deor. i. 30; Val. Max. viii. 11. § 3 The Greeks frequently placed small dwarf-like statues of Hephaestus near their hearths, and these figures are the oldest of all his representations.Herod. iii. 37; Aristoph. Av. 436; Callim. Hymnn. in Dian. 60 During the best period of Grecian art he was represented as a vigorous man with a beard, and is characterized by his hammer or some other crafting tool, his oval cap, and the chiton.\n\nAthena is sometimes thought to be \"the ‘soul-mate’ of [Hephaestus]. Yet a kind of cloudy mysteriousness shrouds their relationship; no single tradition was ever clearly established on this subject, and so what confronts us is a blurred image based on rumors and conflicting reports.\" Nonetheless, he \"seeks impetuously and passionately to make love to Athene: at the moment of climax she pushes him aside, and his semen falls to the earth where it impregnates Gaia.\"\n\nVolcano god\n\nHephaestus was associated by Greek colonists in southern Italy with the volcano gods Adranus (of Mount Etna) and Vulcanus of the Lipari islands. The first-century sage Apollonius of Tyana is said to have observed, \"there are many other mountains all over the earth that are on fire, and yet we should never be done with it if we assigned to them giants and gods like Hephaestus\".Life of Apollonius of Tyana, book v.16.\n\nOther mythology\n\nIn the Trojan war, Hephaestus sided with the Greeks, but was also worshiped by the Trojans and saved one of their men from being killed by Diomedes.Homer, Iliad, v, 9 wikt:ff.| Hephaestus’ favourite place in the mortal world was the island of Lemnos, where he liked to dwell among the Sintians,Od. viii. 283 wikt:ff.|Homer, Iliad, i, 593.Ovid, Fasti, viii, 82. but he also frequented other volcanic islands such as Lipara, Hiera, Imbros and Sicily, which were called his abodes or workshops.Apollonius of Rhodes, iii. 41.Callimachus, Hymn. in Dian. 47Serv. ad Aen, viii, 416.Strabo, p. 275.Pliny, Naturalis Historia, iii, 9.Valerius Flaccus, ii, 96.\n\nThe epithets and surnames by which Hephaestus is known by the poets generally allude to his skill in the plastic arts or to his figure or lameness. The Greeks frequently placed small dwarf-like statues of Hephaestus near their hearths, and these figures are the oldest of all his representations.Heroditus, iii, 37Aristophanes, Av., 436.Callimachus, Hymn. in Dian., 60.\n\nSymbolism\n\nHephaestus was sometimes portrayed as a vigorous man with a beard and was characterized by his hammer or some other crafting tool, his oval cap, and the chiton.\n\nHephaestus is described in mythological sources as \"lame\" (), and \"halting\" ().Odyssey [http://www.perseus.tufts.edu/hopper/text?docHom.+Od.+8.308 8.308]; Iliad [http://www.perseus.tufts.edu/hopper/text?doc\nHom.+Il.+18.397 18.397], etc.\nHe was depicted with crippled feet and as misshapen, either from birth or as a result of his fall from Olympus. In vase paintings, Hephaestus is usually shown lame and bent over his anvil, hard at work on a metal creation, and sometimes with his feet back-to-front: Hephaistos amphigyēeis. He walked with the aid of a stick. The Argonaut Palaimonius, \"son of Hephaestus\" (i.e. a bronze-smith) was also lame.Apollonius of Rhodes, Argonautica i.204.\n\nOther \"sons of Hephaestus\" were the Cabeiri on the island of Samothrace, who were identified with the crab (karkinos) by the lexicographer Hesychius. The adjective karkinopous (\"crab-footed\") signified \"lame\", according to Detienne and Vernant. Cited by  The Cabeiri were also lame.\n\nIn some myths, Hephaestus built himself a \"wheeled chair\" or chariot with which to move around, thus helping him overcome his lameness while demonstrating his skill to the other gods. In the Iliad 18.371, it is stated that Hephaestus built twenty bronze wheeled tripods in order assist him in moving around.\n\nHephaestus’s ugly appearance and lameness is taken by some to represent arsenicosis, an effect of high levels of arsenic exposure that would result in lameness and skin cancers. In place of less easily available tin, arsenic was added to copper in the Bronze Age to harden it; like the hatters, crazed by their exposure to mercury, who inspired Lewis Carroll's famous character of the Mad Hatter, most smiths of the Bronze Age would have suffered from chronic poisoning as a result of their livelihood. Consequently, the mythic image of the lame smith is widespread. As Hephaestus was an iron-age smith, not a bronze-age smith, the connection is one from ancient folk memory.\n\nComparative mythology\n\nParallels in other mythological systems for Hephaestus's symbolism include:\n* The Ugarit craftsman-god Kothar-wa-Khasis, who is identified from afar by his distinctive walk – possibly suggesting that he limps.Baruch Margalit, Aqhat Epic 1989:289.\n* As Herodotus was given to understand, the Egyptian craftsman-god Ptah was a dwarf, naked, and deformed.Herodotus, iii.36.\n* In Norse mythology, Weyland the Smith was a lame bronzeworker.\n\nMinor planet\n\nThe minor planet 2212 Hephaistos discovered in 1978 by Soviet astronomer Lyudmila Chernykh was named in Hephaestus' honour.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hephaestus" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14388" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hephaestus (; eight spellings;  Hēphaistos) is the Greek god of blacksmiths, metalworking, carpenters, craftsmen, artisans, sculptors, metallurgy, fire, and volcanoes.Walter Burkert, Greek Religion 1985: III.2.ii; see coverage of Lemnos-based traditions and legends at Mythic Lemnos Hephaestus' Roman equivalent is Vulcan. In Greek mythology, Hephaestus was the son of Zeus and Hera, the king and queen of the gods. In another version, he was Hera's parthenogenous child, rejected by his mother because of his deformity and thrown off Mount Olympus and down to earth.\n\nAs a smithing god, Hephaestus made all the weapons of the gods in Olympus. He served as the blacksmith of the gods, and was worshipped in the manufacturing and industrial centers of Greece, particularly Athens. The cult of Hephaestus was based in Lemnos. Hephaestus' symbols are a smith's hammer, anvil, and a pair of tongs.\n\nEtymology\n\nHephaestus is probably associated with the Linear B (Mycenean Greek) inscription , A-pa-i-ti-jo, found  at Knossos; the inscription indirectly attests his worship at that time because it is believed that it reads the theophoric name Haphaistios or Haphaistion. At Google Books. At Google Books The name of the god in Greek (Hēphaistos) has a root which can be observed in  names of places of Pre-Greek origin, like PhaistosProbably Phaistos, like Athēnā. Chadwick (1976), p. 87.R. S. P. Beekes, Etymological Dictionary of Greek, Brill, 2009, p. 527. (Pa-i-to in Linear B).\n\nEpithets\n\nHephaestus is given many epithets. The meaning of each epithet is:\n* Amphigúeis \"the lame one\" ()\n* Kullopodíōn \"the halting\" ()\n* Khalkeús \"coppersmith\" ()\n* Klutotékhnēs \"renowned artificer\" ()\n* Polúmētis \"shrewd, crafty\" or \"of many devices\" ()\n* Aitnaîos \"Aetnaean\" (), owing to his workshop being supposedly located below Mount Aetna.Aelian, Hist. An. xi. 3, referenced under [http://quod.lib.umich.edu/m/moa/acl3129.0001.001/69?pageroot;size\n100;view=image Aetnaeus] in William Smith's Dictionary of Greek and Roman Biography and Mythology\n\nMythology\n\nCraft of Hephaestus\n\nHephaestus had his own palace on Olympus, containing his workshop with anvil and twenty bellows that worked at his bidding.Il. xviii. 370, &c. Hephaestus crafted much of the magnificent equipment of the gods, and almost any finely wrought metalwork imbued with powers that appears in Greek myth is said to have been forged by Hephaestus. He designed Hermes' winged helmet and sandals, the Aegis breastplate, Aphrodite's famed girdle, Agamemnon's staff of office,The provenance of the staff of office is recounted in Iliad II Achilles' armor, Heracles' bronze clappers, Helios's chariot, the shoulder of Pelops, and Eros's bow and arrows. In later accounts, Hephaestus worked with the help of the chthonic Cyclopes—among them his assistants in the forge, Brontes, Steropes and Pyracmon.Virg. Aen. viii. 416, &c.\n\nHephaestus built automatons of metal to work for him. This included tripods that walked to and from Mount Olympus. He gave to the blinded Orion his apprentice Cedalion as a guide. In some versions of the myth, Prometheus stole the fire that he gave to man from Hephaestus's forge. Hephaestus also created the gift that the gods gave to man, the woman Pandora and her pithos. Being a skilled blacksmith, Hephaestus created all the thrones in the Palace of Olympus.\n\nThe Greek myths and the Homeric poems sanctified in stories that Hephaestus had a special power to produce motion.Iliad, XVIII 372ff He made the golden and silver lions and dogs at the entrance of the palace of Alkinoos in such a way that they could bite the invaders.Iliad, VIII: Nigel Spivey (1997): The Greek art. Phaidon Press Limited, p.9 The Greeks maintained in their civilization an animistic idea that statues are in some sense alive. This kind of art and the animistic belief goes back to the Minoan period, when Daedalus, the builder of the labyrinth, made images which moved of their own accord.Diodorus Siculus, LV 76 A statue of the god was somehow the god himself, and the image on a man's tomb indicated somehow his presence.C.M.Bowra (1957).The Greek experience. The World Publishing company. p.159\n\nParentage\n\nHomer's Odyssey and Iliad have Hephaestus being born of the union of Zeus and Hera.In Homer, Odyssey viii. 312 Hephaestus addresses \"Father Zeus\"; cf. Homer, Iliad i. 578 (some scholars, such as Gantz, Early Greek Myth, p. 74, note that Hephaestus' reference to Zeus as 'father' here may be a general title), xiv. 338, xviii. 396, xxi. 332. See also Cicero, De Natura Deorum 3.22.\n\nIn another tradition, attested by Hesiod, Hera bore Hephaestus alone.Hesiod, Theogony 924ff. In Hesiod's Zeus-centered cosmology, Hera gave birth to Hephaestus as revenge for Zeus giving birth to Athena without her.\n\nSeveral later texts follow Hesiod's account, including Bibliotheke,i. 3.5 (consciously contradicting Homer) Hyginus, and the preface to Fabulae.\n\nIn the account of Attic vase painters, Hephaestus was present at the birth of Athena and wields the axe with which he split Zeus' head to free her. In the latter account, Hephaestus is there represented as older than Athena, so the mythology of Hephaestus is inconsistent in this respect.\n\nFall from Olympus\n\nIn one branch of Greek mythology, Hera ejected Hephaestus from the heavens because he was \"shrivelled of foot\". He fell into the ocean and was raised by Thetis (mother of Achilles) and the Oceanid Eurynome.Homeric Hymn to Apollo [http://www.perseus.tufts.edu/hopper/text?docPerseus%3Atext%3A1999.01.0138%3Ahymn%3D3%3Acard%3D305 316–321]; Homer, Iliad [http://www.perseus.tufts.edu/hopper/text?doc\nPerseus%3Atext%3A1999.01.0134%3Abook%3D18%3Acard%3D388 395–405].\n\nIn another account, Hephaestus, attempting to rescue his mother from Zeus' advances, was flung down from the heavens by Zeus. He fell for an entire day and landed on the island of Lemnos, where he was cared for and taught to be a master craftsman by the Sintians – an ancient tribe native to that island.Homer, Iliad [http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.01.0134%3Abook%3D1%3Acard%3D568 1.590–594]; Valerius Flaccus, ii, 8.5; Apollodorus, i, 3 § 5. Apollodorus confounds the two occasions on which Hephaestus was thrown from Olympus. Later writers describe his lameness as the consequence of his second fall, while Homer makes him lame and weak from his birth.\n\nReturn to Olympus \n\nHephaestus was the only Olympian to have returned to Olympus after being exiled.\n\nIn an archaic story,Features within the narrative suggest to Kerenyi and others that it is archaic; the most complete literary account, however, is a late one, in the Roman rhetorician Libanios, according to Hedreen (2004).Guy Hedreen (2004) The Return of Hephaistos, Dionysiac Processional Ritual and the Creation of a Visual Narrative. The Journal of Hellenic Studies, 124 (2004:38–64) p. 38 and note. Hephaestus gained revenge against Hera for rejecting him by making her a magical golden throne, which, when she sat on it, did not allow her to stand up.A section \"The Binding of Hera\" is devoted to this archaic theme in Kerenyi (1951, pp 156–158), who refers to this \"ancient story\", which is one of the \"tales of guileful deeds performed by cunning gods, mostly at a time when they had not joined the family on Olympus\". The other gods begged Hephaestus to return to Olympus to let her go, but he refused, saying \"I have no mother\".\n\nAt last, Dionysus fetched him, intoxicated him with wine, and took the subdued smith back to Olympus on the back of a mule accompanied by revelers – a scene that sometimes appears on painted pottery of Attica and of Corinth.Axel Seeberg (1965) Hephaistos Rides Again. The Journal of Hellenic Studies, 85, pp. 102–109, describes and illustrates four pieces of Corinthian painted pottery with the themeA black red-figure calpis in the collection of Marsden J. Perry was painted with the return of Hephaestus (Eldridge, 1917, pp 38–54).L. G. Eldridge (1917) An Unpublished Calpis. American Journal of Archaeology, 21.1, pp 38–54 (January–March 1917). In the painted scenes, the padded dancers and phallic figures of the Dionysan throng leading the mule show that the procession was a part of the dithyrambic celebrations that were the forerunners of the satyr plays of fifth century Athens.The significance of the subject for the pre-history of Greek drama is argued by Webster (1958, pp 43 wikt:ff.|) and more recently by Hedreen (2004, pp 38–64).T.B.L. Webster (1958) Some thoughts on the pre-history of Greek drama. Bulletin of the Institute of Classical Studies, 5, pp 43 wikt:ff.|\n\nThe theme of the return of Hephaestus, popular among the Attic vase-painters whose wares were favored among the Etruscans, may have introduced this theme to Etruria.The return of Hephaestus was painted on the Etruscan tomb at the \"Grotta Campana\" near Veii was identified by Petersen (1902); the \"well-known subject\" was doubted in this instance by Harmon (1912).Petersen (1902) Über die älteste etruskische Wandmälerei, pp 149 wikt:ff.|. Rome.A. M. Harmon (1912) The Paintings of the Grotta Campana. American Journal of Archaeology, 16.1, 1–10 (January–March 1912); In the vase-painters' portrayal of the procession, Hephaestus was mounted on a mule or a horse, with Dionysus holding the bridle and carrying Hephaestus' tools (including a double-headed axe).\n\nThe traveller Pausanias reported seeing a painting in the temple of Dionysus in Athens, which had been built in the 5th century but may have been decorated at any time before the 2nd century CE. When Pausanias saw it, he said:\n\nConsorts and children\n\nAccording to most versions, Hephaestus's consort is Aphrodite, who is unfaithful to Hephaestus with a number of gods and mortals, including Ares. However, in Book XVIII of Homer's Iliad, the consort of Hephaestus is a lesser Aphrodite, Charis (\"the grace\") or Aglaia (\"the glorious\") – the youngest of the Graces, as Hesiod calls her.Hesiod, Theogony, 945\n\nIn Athens, there is a Temple of Hephaestus, the Hephaesteum (miscalled the \"Theseum\") near the agora. An Athenian founding myth tells that the city's patron goddess, Athena, refused a union with Hephaestus. Pseudo-Apollodorus records an archaic legend, which claims that Hephaestus once attempted to rape Athena, but she pushed him away, causing him to ejaculate on her thigh. Athena wiped the semen off using a tuft of wool, which she tossed into the dust, impregnating Gaia and causing her to give birth to Erichthonius, whom Athena adopted as her own child. The Roman mythographer Hyginus records a similar story in which Hephaestus demanded Zeus to let him marry Athena since he was the one who had smashed open Zeus's skull, allowing Athena to be born. Zeus agreed to this and Hephaestus and Athena were married, but, when Hephaestus was about to consummate the union, Athena vanished from the bridal bed, causing him to ejaculate on the floor, thus impregnating Gaia with Erichthonius.Hyginus made an imaginative etymology for Erichthonius, of strife (Eris) between Athena and Hephaestus and the Earth-child (chthonios).\n\nOn the island of Lemnos, Hephaestus' consort was the sea nymph Cabeiro, by whom he was the father of two metalworking gods named the Cabeiri. In Sicily, his consort was the nymph Aetna, and his sons were two gods of Sicilian geysers called Palici. With Thalia, Hephaestus was sometimes considered the father of the Palici.\n\nHephaestus fathered several children with mortals and immortals alike. One of those children was the robber Periphetes.\n\nThis is the full list of his consorts and children according to the various accounts:\n\n# Aphrodite\n# Aglaea\n## Eucleia\n## Euthenia\n## Eupheme\n## Philophrosyne\n# Aetna\n## The Palici\n# Cabeiro\n## The Cabeiri\n# Gaia\n## Erichthonius\n# Anticleia\n## Periphetes\n# by unknown mothers\n## Ardalus\n## Cercyon (possibly)\n## Olenus\n## Palaemonius, Argonauts\n## Philottus\n## Pylius\n## Spinter\n\nIn addition, the Romans claim their equivalent god, Vulcan, to have produced the following children:\n# Cacus\n# Caeculus\n\nHephaestus and Aphrodite\n\nThough married to Hephaestus, Aphrodite had an affair with Ares, the god of war. Eventually, Hephaestus discovered Aphrodite’s affair through Helios, the all-seeing Sun, and planned a trap during one of their trysts. While Aphrodite and Ares lay together in bed, Hephaestus ensnared them in an unbreakable chain-link net so small as to be invisible and dragged them to Mount Olympus to shame them in front of the other gods for retribution.\n\nThe gods laughed at the sight of these naked lovers, and Poseidon persuaded Hephaestus to free them in return for a guarantee that Ares would pay the adulterer's fine. Hephaestus states in The Odyssey that he would return Aphrodite to her father and demand back his bride price.\n\nThe Thebans told that the union of Ares and Aphrodite produced Harmonia. However, of the union of Hephaestus with Aphrodite, there was no issue unless Virgil was serious when he said that Eros was their child.Aeneid i.664 Later authors explain this statement by saying that Eros was sired by Ares but passed off to Hephaestus as his own son.\n\nHephaestus was somehow connected with the archaic, pre-Greek Phrygian and Thracian mystery cult of the Kabeiroi, who were also called the Hephaistoi, \"the Hephaestus-men\", in Lemnos. One of the three Lemnian tribes also called themselves Hephaestion and claimed direct descent from the god.\n\nHephaestus and Athena\n\nHephaestus is to the male gods as Athena is to the females, for he gives skill to mortal artists and was believed to have taught men the arts alongside Athena.Od. vi. 233, xxiii. 160. Hymn. in Vaulc. 2. &c. He was nevertheless believed to be far inferior to the sublime character of Athena. At Athens they had temples and festivals in common.See Dict of Ant. s. v. Hêphaisteia, Chalkeia. Both were believed to have great healing powers, and Lemnian earth (terra Lemnia) from the spot on which Hephaestus had fallen was believed to cure madness, the bites of snakes, and haemorrhage, and priests of Hephaestus knew how to cure wounds inflicted by snakes.Philostr. Heroic. v. 2; Eustath. ad Hom. p. 330; Dict. Cret. ii. 14.\n\nHe was represented in the temple of Athena Chalcioecus (Athena of the Bronze HouseThe Museum of Goddess Athena, [http://www.goddess-athena.org/Museum/Temples/Sparta/index.htm Sanctuary of Athena Chalkiokos at Sparta]) at Sparta, in the act of delivering his mother;Paus. iii. 17. § 3 on the chest of Cypselus, giving Achilles's armour to Thetis;v. 19. § 2 and at Athens there was the famous statue of Hephaestus by Alcamenes, in which his lameness was only subtly portrayed.Cic. de Nat. Deor. i. 30; Val. Max. viii. 11. § 3 The Greeks frequently placed small dwarf-like statues of Hephaestus near their hearths, and these figures are the oldest of all his representations.Herod. iii. 37; Aristoph. Av. 436; Callim. Hymnn. in Dian. 60 During the best period of Grecian art he was represented as a vigorous man with a beard, and is characterized by his hammer or some other crafting tool, his oval cap, and the chiton.\n\nAthena is sometimes thought to be \"the ‘soul-mate’ of [Hephaestus]. Yet a kind of cloudy mysteriousness shrouds their relationship; no single tradition was ever clearly established on this subject, and so what confronts us is a blurred image based on rumors and conflicting reports.\" Nonetheless, he \"seeks impetuously and passionately to make love to Athene: at the moment of climax she pushes him aside, and his semen falls to the earth where it impregnates Gaia.\"\n\nVolcano god\n\nHephaestus was associated by Greek colonists in southern Italy with the volcano gods Adranus (of Mount Etna) and Vulcanus of the Lipari islands. The first-century sage Apollonius of Tyana is said to have observed, \"there are many other mountains all over the earth that are on fire, and yet we should never be done with it if we assigned to them giants and gods like Hephaestus\".Life of Apollonius of Tyana, book v.16.\n\nOther mythology\n\nIn the Trojan war, Hephaestus sided with the Greeks, but was also worshiped by the Trojans and saved one of their men from being killed by Diomedes.Homer, Iliad, v, 9 wikt:ff.| Hephaestus’ favourite place in the mortal world was the island of Lemnos, where he liked to dwell among the Sintians,Od. viii. 283 wikt:ff.|Homer, Iliad, i, 593.Ovid, Fasti, viii, 82. but he also frequented other volcanic islands such as Lipara, Hiera, Imbros and Sicily, which were called his abodes or workshops.Apollonius of Rhodes, iii. 41.Callimachus, Hymn. in Dian. 47Serv. ad Aen, viii, 416.Strabo, p. 275.Pliny, Naturalis Historia, iii, 9.Valerius Flaccus, ii, 96.\n\nThe epithets and surnames by which Hephaestus is known by the poets generally allude to his skill in the plastic arts or to his figure or lameness. The Greeks frequently placed small dwarf-like statues of Hephaestus near their hearths, and these figures are the oldest of all his representations.Heroditus, iii, 37Aristophanes, Av., 436.Callimachus, Hymn. in Dian., 60.\n\nSymbolism\n\nHephaestus was sometimes portrayed as a vigorous man with a beard and was characterized by his hammer or some other crafting tool, his oval cap, and the chiton.\n\nHephaestus is described in mythological sources as \"lame\" (), and \"halting\" ().Odyssey [http://www.perseus.tufts.edu/hopper/text?docHom.+Od.+8.308 8.308]; Iliad [http://www.perseus.tufts.edu/hopper/text?doc\nHom.+Il.+18.397 18.397], etc.\nHe was depicted with crippled feet and as misshapen, either from birth or as a result of his fall from Olympus. In vase paintings, Hephaestus is usually shown lame and bent over his anvil, hard at work on a metal creation, and sometimes with his feet back-to-front: Hephaistos amphigyēeis. He walked with the aid of a stick. The Argonaut Palaimonius, \"son of Hephaestus\" (i.e. a bronze-smith) was also lame.Apollonius of Rhodes, Argonautica i.204.\n\nOther \"sons of Hephaestus\" were the Cabeiri on the island of Samothrace, who were identified with the crab (karkinos) by the lexicographer Hesychius. The adjective karkinopous (\"crab-footed\") signified \"lame\", according to Detienne and Vernant. Cited by  The Cabeiri were also lame.\n\nIn some myths, Hephaestus built himself a \"wheeled chair\" or chariot with which to move around, thus helping him overcome his lameness while demonstrating his skill to the other gods. In the Iliad 18.371, it is stated that Hephaestus built twenty bronze wheeled tripods in order assist him in moving around.\n\nHephaestus’s ugly appearance and lameness is taken by some to represent arsenicosis, an effect of high levels of arsenic exposure that would result in lameness and skin cancers. In place of less easily available tin, arsenic was added to copper in the Bronze Age to harden it; like the hatters, crazed by their exposure to mercury, who inspired Lewis Carroll's famous character of the Mad Hatter, most smiths of the Bronze Age would have suffered from chronic poisoning as a result of their livelihood. Consequently, the mythic image of the lame smith is widespread. As Hephaestus was an iron-age smith, not a bronze-age smith, the connection is one from ancient folk memory.\n\nComparative mythology\n\nParallels in other mythological systems for Hephaestus's symbolism include:\n* The Ugarit craftsman-god Kothar-wa-Khasis, who is identified from afar by his distinctive walk – possibly suggesting that he limps.Baruch Margalit, Aqhat Epic 1989:289.\n* As Herodotus was given to understand, the Egyptian craftsman-god Ptah was a dwarf, naked, and deformed.Herodotus, iii.36.\n* In Norse mythology, Weyland the Smith was a lame bronzeworker.\n\nMinor planet\n\nThe minor planet 2212 Hephaistos discovered in 1978 by Soviet astronomer Lyudmila Chernykh was named in Hephaestus' honour. Hephaestus. http://en.wikipedia.org/?curid=14388."
  }
}
