{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7605",
  "eid" : "e28f6ee0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778459854,
  "textBody" : "Rum and Coke, or a Cuba Libre (;, \"Free Cuba\" libre here an adjective, not a verb), is a highball cocktail consisting of cola, rum, and traditionally lime juice on ice.\n\nThe cocktail originated in the early 20th century in Cuba, after the country won independence in the Spanish–American War. It quickly became popular across Cuba and in many other countries, and has been one of the world's most popular alcoholic drinks. Traditionally, the cola ingredient is Coca-Cola (\"Coke\"), and the alcohol is a Cuban light rum such as Bacardi. However, the drink may be made with various types of rums and cola brands, and lime juice may or may not be included.\n\nHistory\n\nOrigins\n\nThe drink was created in Cuba in the early 1900s, but its exact origins are not known with certainty. It became popular shortly after 1900, when bottled Coca-Cola was first imported into Cuba from the United States. It is associated with the heavy U.S. presence in Cuba following the Spanish–American War of 1898; the drink's traditional name, \"Cuba Libre\" (Free Cuba), was the slogan of the Cuban independence movement.\n\nThe Cuba Libre is sometimes said to have been created during the Spanish-American War. However, this predates the first distribution of Coca-Cola to Cuba in 1900. A drink called a \"Cuba Libre\" was indeed known in 1898, but this was a mix of water and brown sugar.\n\nFausto Rodriguez, a Bacardi advertising executive, claimed to have been present when the drink was first poured, and produced a notarized affidavit to that effect in 1965. According to Rodriguez, this took place in August 1900, when he was a 14-year-old messenger working for a member of the U.S. Army Signal Corps in Havana. One day at a local bar, Rodriguez's employer ordered Bacardi rum mixed with Coca-Cola. This intrigued a nearby group of American soldiers, who ordered a round for themselves, giving birth to a popular new drink. Bacardi published Rodriguez's affidavit in a Life magazine ad in 1966. However, his status as a Bacardi executive has led some commenters to doubt the veracity of his story. Another story states that the drink was first created in 1902 at Havana's Restaurant La Florida to celebrate the anniversary of Cuban independence.\n\nThe drink caught on due to the pervasiveness of its ingredients. Havana was already known for its iced drinks in the 19th century, as it was one of the few warm-weather cities that had abundant stores of ice shipped down from colder regions. Bacardi and other Cuban rums also boomed after independence brought in large numbers of foreign tourists and investors, as well as new opportunities for exporting alcohol. Light rums such as Bacardi became favored for cocktails, as they were considered to mix better than harsher dark rums. Coca-Cola had been a common mixer in the United States ever since it was first bottled in 1886, and it became a ubiquitous drink in many countries after it was first exported in 1900.\n\nSpread and popularity\n\nRum and Coke quickly spread from Cuba to the United States. In the early 20th century the coctail, like Coca-Cola itself, was most popular in the Southern United States. During the Prohibition era from 1922–1933, Coca-Cola became a favored mixer for disguising the taste of low-quality rums, as well as other liquors. In 1921 H. L. Mencken jokingly wrote of a South Carolina variant called the \"jump stiddy\", which consisted of Coca-Cola mixed with denatured alcohol drained from automobile radiators. After Prohibition, rum and Coke became prevalent in the Northern and Western U.S. as well, and in high-brow as well as low-brow circles.\n\nRum and Coke achieved a new level of popularity during World War II. Starting in 1940, the United States established a series of outposts among the British West Indies to defend against the German Navy. Their presence created cross-cultural demand, with American servicemen and the locals developing tastes for each others' products. In particular, American military personnel took to Caribbean rum due to its inexpensiveness, while Coca-Cola became especially prevalent in the islands thanks to the company shipping it out with the military. Within the United States, imported rum became increasingly popular, as government quotas for industrial alcohol reduced the output of American distillers of domestic liquors. In 1943, Lord Invader's Calypso song \"Rum and Coca-Cola\" drew further attention to the drink in Trinidad. In 1945, the Andrews Sisters had a major hit with a version of the song (plagiarized by Morey Amsterdam), which further boosted the drink's popularity.\nThe drink is also featured prominently in the Canadian mockumentary television show \"Trailer Park Boys\" as one of the main characters: Julian's drink of choice.\nRecipe and variations\n\nRecipes vary somewhat in measures and additional ingredients, but the main ingredients are always rum and cola.  The International Bartenders Association recipe calls for 5 centiliters of light rum, 12 cl of cola, and 1 cl of fresh lime juice on ice. However, any amount and proportion of rum and cola may be used. Additionally, while light rum is traditional, dark rums and other varieties are also common. Different colas are also often used; in fact in Cuba, Coca-Cola has not been imported since the U.S. embargo of 1960, so the domestic TuKola is used in Cuba Libres.\n\nLime is traditionally included, though it is often left out, especially when the order is for \"rum and Coke\". Some early recipes called for lime juice to be mixed in, though others included lime only as a garnish. Other early recipes called for additional ingredients such as gin and bitters. Some sources consider lime essential for a drink to be a true Cuba Libre, which they distinguish from a mere \"rum and Coke\". However, lime is frequently included even in orders for \"rum and Coke\".\n\nWhen aged añejo rum is used, the drink is sometimes called a Cubata. Some modern recipes inspired by older ones include additional ingredients such as bitters. Some call for other colas such as Mexican Coke (which uses cane sugar instead of high-fructose corn syrup) or Moxie. More elaborate variants with additional ingredients include the Cinema Highball, which uses rum infused with buttered popcorn and mixed with cola. Another is the Mandeville Cocktail, which includes light and dark rum, cola, and citrus juice along with Pernod absynthe and grenadine.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Rum and Coke" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7605" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Rum and Coke, or a Cuba Libre (;, \"Free Cuba\" libre here an adjective, not a verb), is a highball cocktail consisting of cola, rum, and traditionally lime juice on ice.\n\nThe cocktail originated in the early 20th century in Cuba, after the country won independence in the Spanish–American War. It quickly became popular across Cuba and in many other countries, and has been one of the world's most popular alcoholic drinks. Traditionally, the cola ingredient is Coca-Cola (\"Coke\"), and the alcohol is a Cuban light rum such as Bacardi. However, the drink may be made with various types of rums and cola brands, and lime juice may or may not be included.\n\nHistory\n\nOrigins\n\nThe drink was created in Cuba in the early 1900s, but its exact origins are not known with certainty. It became popular shortly after 1900, when bottled Coca-Cola was first imported into Cuba from the United States. It is associated with the heavy U.S. presence in Cuba following the Spanish–American War of 1898; the drink's traditional name, \"Cuba Libre\" (Free Cuba), was the slogan of the Cuban independence movement.\n\nThe Cuba Libre is sometimes said to have been created during the Spanish-American War. However, this predates the first distribution of Coca-Cola to Cuba in 1900. A drink called a \"Cuba Libre\" was indeed known in 1898, but this was a mix of water and brown sugar.\n\nFausto Rodriguez, a Bacardi advertising executive, claimed to have been present when the drink was first poured, and produced a notarized affidavit to that effect in 1965. According to Rodriguez, this took place in August 1900, when he was a 14-year-old messenger working for a member of the U.S. Army Signal Corps in Havana. One day at a local bar, Rodriguez's employer ordered Bacardi rum mixed with Coca-Cola. This intrigued a nearby group of American soldiers, who ordered a round for themselves, giving birth to a popular new drink. Bacardi published Rodriguez's affidavit in a Life magazine ad in 1966. However, his status as a Bacardi executive has led some commenters to doubt the veracity of his story. Another story states that the drink was first created in 1902 at Havana's Restaurant La Florida to celebrate the anniversary of Cuban independence.\n\nThe drink caught on due to the pervasiveness of its ingredients. Havana was already known for its iced drinks in the 19th century, as it was one of the few warm-weather cities that had abundant stores of ice shipped down from colder regions. Bacardi and other Cuban rums also boomed after independence brought in large numbers of foreign tourists and investors, as well as new opportunities for exporting alcohol. Light rums such as Bacardi became favored for cocktails, as they were considered to mix better than harsher dark rums. Coca-Cola had been a common mixer in the United States ever since it was first bottled in 1886, and it became a ubiquitous drink in many countries after it was first exported in 1900.\n\nSpread and popularity\n\nRum and Coke quickly spread from Cuba to the United States. In the early 20th century the coctail, like Coca-Cola itself, was most popular in the Southern United States. During the Prohibition era from 1922–1933, Coca-Cola became a favored mixer for disguising the taste of low-quality rums, as well as other liquors. In 1921 H. L. Mencken jokingly wrote of a South Carolina variant called the \"jump stiddy\", which consisted of Coca-Cola mixed with denatured alcohol drained from automobile radiators. After Prohibition, rum and Coke became prevalent in the Northern and Western U.S. as well, and in high-brow as well as low-brow circles.\n\nRum and Coke achieved a new level of popularity during World War II. Starting in 1940, the United States established a series of outposts among the British West Indies to defend against the German Navy. Their presence created cross-cultural demand, with American servicemen and the locals developing tastes for each others' products. In particular, American military personnel took to Caribbean rum due to its inexpensiveness, while Coca-Cola became especially prevalent in the islands thanks to the company shipping it out with the military. Within the United States, imported rum became increasingly popular, as government quotas for industrial alcohol reduced the output of American distillers of domestic liquors. In 1943, Lord Invader's Calypso song \"Rum and Coca-Cola\" drew further attention to the drink in Trinidad. In 1945, the Andrews Sisters had a major hit with a version of the song (plagiarized by Morey Amsterdam), which further boosted the drink's popularity.\nThe drink is also featured prominently in the Canadian mockumentary television show \"Trailer Park Boys\" as one of the main characters: Julian's drink of choice.\nRecipe and variations\n\nRecipes vary somewhat in measures and additional ingredients, but the main ingredients are always rum and cola.  The International Bartenders Association recipe calls for 5 centiliters of light rum, 12 cl of cola, and 1 cl of fresh lime juice on ice. However, any amount and proportion of rum and cola may be used. Additionally, while light rum is traditional, dark rums and other varieties are also common. Different colas are also often used; in fact in Cuba, Coca-Cola has not been imported since the U.S. embargo of 1960, so the domestic TuKola is used in Cuba Libres.\n\nLime is traditionally included, though it is often left out, especially when the order is for \"rum and Coke\". Some early recipes called for lime juice to be mixed in, though others included lime only as a garnish. Other early recipes called for additional ingredients such as gin and bitters. Some sources consider lime essential for a drink to be a true Cuba Libre, which they distinguish from a mere \"rum and Coke\". However, lime is frequently included even in orders for \"rum and Coke\".\n\nWhen aged añejo rum is used, the drink is sometimes called a Cubata. Some modern recipes inspired by older ones include additional ingredients such as bitters. Some call for other colas such as Mexican Coke (which uses cane sugar instead of high-fructose corn syrup) or Moxie. More elaborate variants with additional ingredients include the Cinema Highball, which uses rum infused with buttered popcorn and mixed with cola. Another is the Mandeville Cocktail, which includes light and dark rum, cola, and citrus juice along with Pernod absynthe and grenadine. Rum and Coke. http://en.wikipedia.org/?curid=7605."
  }
}
