{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17877",
  "eid" : "2f076430-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778588147,
  "textBody" : "In Scottish folklore, the Loch Ness Monster or Nessie, is an aquatic being which reputedly inhabits Loch Ness in the Scottish Highlands. It is similar to other supposed lake monsters in Scotland and elsewhere, and is often described as being large in size, with a long neck and one or more humps protruding from the water. Popular interest and belief in the creature has varied since it was brought to worldwide attention in 1933. Evidence of its existence is anecdotal, with a few disputed photographs and sonar readings.\n\nThe creature commonly appears in Western media where it manifests in a variety of ways. The scientific community regards the Loch Ness Monster as a a phenomenon without biological basis, explaining sightings as hoaxes, wishful thinking, and the misidentification of mundane objects.\n\nName\n\nThe creature has been affectionately called Nessie ()Campbell, Elizabeth Montgomery & David Solomon, The Search for Morag (Tom Stacey 1972) , page 28 gives an-t-Seileag, an-Niseag, a-Mhorag for the monsters of Lochs Shiel, Ness and Morag, adding that they are feminine diminutives since the 1940s.\n\nOrigins\n\nThe word \"monster\" was reportedly applied for the first time to the creature on 2 May 1933 by Alex Campbell, water bailiff for Loch Ness and a part-time journalist, in an Inverness Courier report.The Sun 27 November 1975: I'm the man who first coined the word \"monster\" for the creature.R. Binns The Loch Ness Mystery Solved pp 11–12Inverness Courier 2 May 1933 \"Loch Ness has for generations been credited with being the home of a fearsome-looking monster\" On 4 August 1933 the Courier published a report by Londoner George Spicer that several weeks earlier, while they were driving around the loch, he and his wife saw \"the nearest approach to a dragon or pre-historic animal that I have ever seen in my life\" trundling across the road toward the loch with \"an animal\" in its mouth. Letters began appearing in the Courier, often anonymously, claiming land or water sightings by the writer, their family or acquaintances or remembered stories.R. Binns The Loch Ness Mystery Solved pp 19–27 The accounts reached the media, which described a \"monster fish\", \"sea serpent\", or \"dragon\"Daily Mirror, 11 August 1933 \"Loch Ness, which is becoming famous as the supposed abode of a dragon...\" and eventually settled on \"Loch Ness monster\".The Oxford English Dictionary gives 9 June 1933 as the first usage of the exact phrase Loch Ness monster\n\nOn 6 December 1933 the first purported photograph of the monster, taken by Hugh Gray, was published in the Daily Express;R. P. Mackal (1983) \"The Monsters of Loch Ness\" p.94 the Secretary of State for Scotland soon ordered police to prevent any attacks on it.Daily Mirror 8 December 1933 \"The Monster of Loch Ness – Official! Orders That Nobody is to Attack it\" ... A Huge Eel?\" In 1934, interest was further piqued by the \"surgeon's photograph\". That year, R. T. Gould published an account of the author's investigation and a record of reports predating 1933. Other authors have claimed sightings of the monster dating to the sixth century AD.\n\nHistory\n\nSaint Columba (565)\n\nThe earliest report of a monster in the vicinity of Loch Ness appears in the Life of St. Columba by Adomnán, written in the sixth century AD.J. A Carruth Loch Ness and its Monster, (1950) Abbey Press, Fort Augustus, cited by Tim Dinsdale (1961) Loch Ness Monster ppp 33–35 According to Adomnán, writing about a century after the events described, Irish monk Saint Columba was staying in the land of the Picts with his companions when he encountered local residents burying a man by the River Ness. They explained that the man was swimming in the river when he was attacked by a \"water beast\" which mauled him and dragged him underwater. Although they tried to rescue him in a boat, he was dead. Columba sent a follower, Luigne moccu Min, to swim across the river. The beast approached him, but Columba made the sign of the cross and said: \"Go no further. Do not touch the man. Go back at once.\"Adomnán, p. 176 (II:27). The creature stopped as if it had been \"pulled back with ropes\" and fled, and Columba's men and the Picts gave thanks for what they perceived as a miracle.\n\nBelievers in the monster point to this story, set in the River Ness rather than the loch itself, as evidence for the creature's existence as early as the sixth century.Adomnán p. 330. Sceptics question the narrative's reliability, noting that water-beast stories were extremely common in medieval hagiographies and Adomnán's tale probably recycles a common motif attached to a local landmark.R. Binns The Loch Ness Mystery Solved, pp. 52–57 According to sceptics, Adomnán's story may be independent of the modern Loch Ness Monster legend and became attached to it by believers seeking to bolster their claims.  Ronald Binns considers that this is the most serious of various alleged early sightings of the monster, but all other claimed sightings before 1933 are dubious and do not prove a monster tradition before that date.\n\nD. Mackenzie (1871 or 1872)\n\nIn October 1871 (or 1872), D. Mackenzie of Balnain reportedly saw an object resembling a log or an upturned boat \"wriggling and churning up the water\". The object moved slowly at first, disappearing at a faster speed. Mackenzie sent his story in a letter to Rupert Gould in 1934, shortly after popular interest in the monster increased.\n\nGeorge Spicer (1933)\n\nModern interest in the monster was sparked by a sighting on 22 July 1933, when George Spicer and his wife saw \"a most extraordinary form of animal\" cross the road in front of their car. They described the creature as having a large body (about 4 ft high and 25 ft long) and a long, wavy, narrow neck, slightly thicker than an elephant's trunk and as long as the 10 - width of the road. They saw no limbs.T. Dinsdale (1961) Loch Ness Monster page 42. It lurched across the road towards the loch 20 yd away, leaving a trail of broken undergrowth in its wake.\n\nIt has been claimed that sightings of the monster increased after a road was built along the loch in early 1933, bringing workers and tourists to the formerly-isolated area.R. Mackal (1976) \"The Monsters of Loch Ness\" page 85. However, Binns has described this as \"the myth of the lonely loch\", as it was far from isolated before then, due to the construction of the Caledonian Canal.  In the 1930s, the existing road by the side of the loch was given a serious upgrade (just possibly this work could have contributed to the legend, since there could have been tar barrels floating in the loch).\n\nHugh Gray (1933)\n\nHugh Gray's photograph taken near Foyers on November 12, 1933 was the first photograph alleged to depict the monster. It was slightly blurred, and it has been noted that if one looks closely the head of a dog can be seen. Gray had taken his Labrador for a walk that day, and it is suspected that the photograph depicts his dog fetching a stick from the loch.Loxton, Daniel; Prothero, Donald. (2015). Abominable Science! Origins of the Yeti, Nessie, and Other Famous Cryptids. Columbia University Press. pp. 142-144.  Others have suggested the photograph depicts an otter or a swan. The original negative was lost. However, in 1963 Maurice Burton came into \"possession of two lantern slides, contact positives from th[e] original negative\" and when projected on screen it revealed an \"otter rolling at the surface in characteristic fashion.\"Burton, Maurice. A Ring of bright water? New Scientist. 24 June 1982. p. 872\n\nArthur Grant (1934)\n\nOn January 5, 1934 a motorcyclist, Arthur Grant, claimed to have nearly hit the creature while approaching Abriachan (near the north-eastern end of the loch) at about 1 a.m. on a moonlit night.Campbell, Steuart. (1997). The Loch Ness Monster: The Evidence. Prometheus Books. p. 33.  According to Grant, it had a small head attached to a long neck; the creature saw him, and crossed the road back to the loch. Grant, a veterinary student, described it as a cross between a seal and a plesiosaur. He said he dismounted and followed it to the loch, but only saw ripples.Tim Dinsdale Loch Ness Monster pp 44–5\n\nGrant produced a sketch of the creature, it was examined by zoologist Maurice Burton who stated it was consistent with the appearance and behaviour of an otter.Burton, Maurice. A Fast Moving, Agile Beastie. New Scientist. 1 July 1982. p. 41. Regarding the long size of the creature reported by Grant; it has been suggested that this was a faulty observation due to the poor light conditions.Burton, Maurice. (1961). Loch Ness Monster: A Burst Bubble? The Illustrated London News. May, 27. p. 896 Palaeontologist Darren Naish has suggested that Grant may have seen either an otter or a seal and exaggerated his sighting over time.Naish, Darren. (2016). [https://books.google.com/books?idmN2oCwAAQBAJ&pg\nPT77&dq%22arthur+grant%22+seal&hl\nen&saX&ved\n0ahUKEwj5-ujUlfzTAhUjLcAKHflzAoE4ChC7BQg1MAM#vonepage&q\n%22arthur%20grant%22%20seal&f=false \"Hunting Monsters: Cryptozoology and the Reality Behind the Myths\"]. Arcturus.\n\n\"Surgeon's photograph\" (1934)\n\nThe \"surgeon's photograph\" is reportedly the first photo of the creature's head and neck.R. P. Mackal (1976) The Monsters of Loch Ness page 208 Supposedly taken by Robert Kenneth Wilson, a London gynaecologist, it was published in the Daily Mail on 21 April 1934.Daily Mail 21 April 1934 Wilson's refusal to have his name associated with it led to it being known as the \"surgeon's photograph\". According to Wilson, he was looking at the loch when he saw the monster, grabbed his camera and snapped four photos. Only two exposures came out clearly; the first reportedly shows a small head and back, and the second shows a similar head in a diving position. The first photo became well-known, and the second attracted little publicity because of its blurriness.\n\nAlthough for a number of years the photo was considered evidence of the monster, sceptics dismissed it as driftwood, an elephant, an otter, or a bird. The photo's scale was controversial; it is often shown cropped (making the creature seem large and the ripples like waves), while the uncropped shot shows the other end of the loch and the monster in the centre. The ripples in the photo were found to fit the size and pattern of small ripples, unlike large waves photographed up close. Analysis of the original image fostered further doubt. In 1993, the makers of the Discovery Communications documentary Loch Ness Discovered analysed the uncropped image and found a white object visible in every version of the photo (implying that it was on the negative). It was believed to be the cause of the ripples, as if the object was being towed, although the possibility of a blemish on the negative could not be ruled out. An analysis of the full photograph indicated that the object was small, about 60 to long.\n\nSince 1994, most agree that the photo was an elaborate hoax. It had been accused of being a fake in a 7 December 1975 Sunday Telegraph article which fell into obscurity.[http://www.strangemag.com/strangemag/strange21/reviews21/surgeonsphoto21.html Book review of Nessie – The Surgeon's Photograph – Exposed] Douglas Chapman. Details of how the photo was taken were published in the 1999 book, Nessie – the Surgeon's Photograph Exposed, which contains a facsimile of the 1975 Sunday Telegraph article.David S. Martin & Alastair Boyd (1999) Nessie – the Surgeon's Photograph Exposed (East Barnet: Martin and Boyd).  The creature was reportedly a toy submarine built by Christian Spurling, the son-in-law of Marmaduke Wetherell. Wetherell had been publicly ridiculed by his employer, the Daily Mail, after he found \"Nessie footprints\" which turned out to be a hoax. To get revenge on the Mail, Wetherell perpetrated his hoax with co-conspirators Spurling (sculpture specialist), Ian Wetherell (his son, who bought the material for the fake), and Maurice Chambers (an insurance agent). The toy submarine was bought from F. W. Woolworths, and its head and neck were made from wood putty. After testing it in a local pond the group went to Loch Ness, where Ian Wetherell took the photos near the Altsaigh Tea House. When they heard a water bailiff approaching, Duke Wetherell sank the model with his foot and it is \"presumably still somewhere in Loch Ness\".The Mammoth Encyclopedia of the Unsolved Chambers gave the photographic plates to Wilson, a friend of his who enjoyed \"a good practical joke\". Wilson brought the plates to Ogston's, an Inverness chemist, and gave them to George Morrison for development. He sold the first photo to the Daily Mail, who then announced that the monster had been photographed.\n\nLittle is known of the second photo; it is often ignored by researchers, who believe its quality too poor and its differences from the first photo too great to warrant analysis. It shows a head similar to the first photo, with a more turbulent wave pattern and possibly taken at a different time and location in the loch. Some believe it to be an earlier, cruder attempt at a hoax, and others (including Roy Mackal and Maurice Burton) consider it a picture of a diving bird or otter which Wilson mistook for the monster.Mackal, Roy. The Monsters of Loch Ness. According to Morrison, when the plates were developed Wilson was uninterested in the second photo; he allowed Morrison to keep the negative, and the second photo was rediscovered years later.The Loch Ness Story, revised edition, Penguin Books, 1975, pp. 44–45 When asked about the second photo by the Ness Information Service Newsletter, Spurling \" ... was vague, thought it might have been a piece of wood they were trying out as a monster, but [was] not sure.\"Ness Information Service Newsletter, 1991 issue\n\nTaylor film (1938)\n\nOn 29 May 1938, South African tourist G. E. Taylor filmed something in the loch for three minutes on 16 mm colour film. The film was obtained by popular science writer Maurice Burton, who did not show it to other researchers. A single frame was published in his 1961 book, The Elusive Monster. His analysis concluded it was a floating object, not an animal.Burton, Maurice. (1961). The Elusive Monster: An Analysis of the Evidence From Loch Ness. Hart-Davis. pp. 83-84\n\nWilliam Fraser (1938)\n\nOn 15 August 1938, William Fraser, chief constable of Inverness-shire, wrote a letter that the monster existed beyond doubt and expressed concern about a hunting party which had arrived (with a custom-made harpoon gun) determined to catch the monster \"dead or alive\". He believed his power to protect the monster from the hunters was \"very doubtful\". The letter was released by the National Archives of Scotland on 27 April 2010.\n\nSonar readings (1954)\n\nIn December 1954, sonar readings were taken by the fishing boat Rival III. Its crew noted a large object keeping pace with the vessel at a depth of 146 m. It was detected for 800 m before contact was lost and regained. Previous sonar attempts were inconclusive or negative.\n\nPeter MacNab (1955)\n\nPeter MacNab at Urquhart Castle on July 29, 1955 took a photograph that depicted two long black humps in the water. The photograph was not made public until it appeared in Constance Whyte's 1957 book on the subject. On 23 October 1958 it was published by the Weekly Scotsman. Author Ronald Binns wrote that the \"phenomenon which MacNab photographed could easily be a wave effect resulting from three trawlers travelling closely together up the loch.\"Binns, Ronald. (1983). The Loch Ness Mystery Solved. Prometheus Books. p. 102\n\nOther researchers consider the photograph a hoax.Campbell, Steuart. (1991). The Loch Ness Monster: The Evidence. Aberdeen University Press. pp. 43-44. Roy Mackal requested to use the photograph in his 1976 book. He received the original negative from MacNab, but discovered it differed from the photograph that appeared in Whyte's book. The tree at the bottom left in Whyte's was missing from the negative. It is suspected that the photograph was doctored by re-photographing a print.[http://hoaxes.org/archive/permalink/the_macnab_photograph \"The MacNab Photograph\"]. The Museum of Hoaxes.\n\nDinsdale film (1960)\n\nAeronautical engineer Tim Dinsdale filmed a hump which left a wake crossing Loch Ness in 1960. Dinsdale, who reportedly had the sighting on his final day of search, described it as reddish with a blotch on its side. He said that when he mounted his camera the object began to move, and he shot 40 feet of film. According to JARIC, the object was \"probably animate\". Others were sceptical, saying that the \"hump\" cannot be ruled out as being a boat and when the contrast is increased, a man in a boat can be seen.\n\nIn 1993 Discovery Communications produced a documentary, Loch Ness Discovered, with a digital enhancement of the Dinsdale film. A person who enhanced the film noticed a shadow in the negative which was not obvious in the developed film. By enhancing and overlaying frames, he found what appeared to be the rear body of a creature underwater: \"Before I saw the film, I thought the Loch Ness Monster was a load of rubbish. Having done the enhancement, I'm not so sure\".\n\n\"Loch Ness Muppet\" (1977)\n\nOn 21 May 1977 Anthony \"Doc\" Shiels, camping next to Urquhart Castle, took \"some of the clearest pictures of the monster until this day\". Shiels, a magician and psychic, claimed to have summoned the animal out of the water. He later described it as an \"elephant squid\", claiming the long neck shown in the photograph is actually the squid's \"trunk\" and that a white spot at the base of the neck is its eye. Due to the lack of ripples, it has been declared a hoax by a number of people and received its name because of its staged look.\n\nHolmes video (2007)\n\nOn 26 May 2007, 55-year-old laboratory technician Gordon Holmes videotaped what he said was \"this jet black thing, about 14 m long, moving fairly fast in the water.\" Adrian Shine, a marine biologist at the Loch Ness 2000 Centre in Drumnadrochit, described the footage as among \"the best footage [he had] ever seen.\" BBC Scotland broadcast the video on 29 May 2007. STV News North Tonight aired the footage on 28 May 2007 and interviewed Holmes. Shine was also interviewed, and suggested that the footage was an otter, seal or water bird.\n\nSonar image (2011)\n\nOn 24 August 2011 Loch Ness boat captain Marcus Atkinson photographed a sonar image of a , unidentified object which seemed to follow his boat for two minutes at a depth of 23 m, and ruled out the possibility of a small fish or seal. In April 2012, a scientist from the National Oceanography Centre said that the image is a bloom of algae and zooplankton.\n\nGeorge Edwards photograph (2011)\n\nOn 3 August 2012, skipper George Edwards claimed that a photo he took on 2 November 2011 shows \"Nessie\". Edwards claims to have searched for the monster for 26 years, and reportedly spent 60 hours per week on the loch aboard his boat, Nessie Hunter IV, taking tourists for rides on the lake. Edwards said, \"In my opinion, it probably looks kind of like a manatee, but not a mammal. When people see three humps, they're probably just seeing three separate monsters.\"McLaughlin, Erin, \"[http://gma.yahoo.com/blogs/abc-blogs/scottish-sailor-claims-best-picture-yet-loch-ness-100057921--abc-news-topstories.html Scottish Sailor Claims To Have Best Picture Yet Of Loch Ness Monster]\", ABC News/Yahoo! News, 16 August 2012\n\nOther researchers have questioned the photograph's authenticity, and Loch Ness researcher Steve Feltham suggested that the object in the water is a fibreglass hump used in a National Geographic Channel documentary in which Edwards had participated. Researcher Dick Raynor has questioned Edwards' claim of discovering a deeper bottom of Loch Ness, which Raynor calls \"Edwards Deep\". He found inconsistencies between Edwards' claims for the location and conditions of the photograph and the actual location and weather conditions that day. According to Raynor, Edwards told him he had faked a photograph in 1986 which he claimed was genuine in the Nat Geo documentary. Although Edwards admitted in October 2013 that his 2011 photograph was a hoax, he insisted that the 1986 photograph was genuine.\n\nDavid Elder video (2013)\n\nOn 27 August 2013, tourist David Elder presented a five-minute video of a \"mysterious wave\" in the loch. According to Elder, the wave was produced by a  \"solid black object\" just under the surface of the water. Elder, 50, from East Kilbride, South Lanarkshire, was taking a picture of a swan at the Fort Augustus pier on the south-western end of the loch, when he captured the movement. He said, \"The water was very still at the time and there were no ripples coming off the wave and no other activity on the water.\" Sceptics suggested that the wave may have been caused by a wind gust.\n\nApple Maps photograph (2014)\n\nOn 19 April 2014, it was reported that a satellite image on Apple Maps showed what appeared to be a large creature (thought by some to be the Loch Ness Monster) just below the surface of Loch Ness. At the loch's far north, the image appeared about 30 m long. Possible explanations were the wake of a boat (with the boat itself lost in image stitching or low contrast), seal-caused ripples, or floating wood.\n\nGoogle Street View (2015)\n\nGoogle commemorated the 81st anniversary of the \"surgeon's photograph\" with a Google Doodle, and added a new feature to Google Street View with which users can explore the loch above and below the water. Google reportedly spent a week at Loch Ness collecting imagery with a street-view \"trekker\" camera, attaching it to a boat to photograph above the surface and collaborating with members of the Catlin Seaview Survey to photograph underwater.\n\nSearches\n\nEdward Mountain expedition (1934)\n\nAfter reading Rupert Gould's The Loch Ness Monster and Others, Edward Mountain financed a search. Twenty men with binoculars and cameras positioned themselves around the loch from 9 am to 6 pm for five weeks, beginning on 13 July 1934. Although 21 photographs were taken, none was considered conclusive. Supervisor James Fraser remained by the loch filming on 15 September 1934; the film is now lost.R. Binns (1983) The Loch Ness Mystery Solved , pages 36–39 Zoologists and professors of natural history concluded that the film showed a seal, possibly a grey seal.The Times 5 October 1934, page 12 Loch Ness \"Monster\" Film\n\nLoch Ness Phenomena Investigation Bureau (1962–1972)\n\nThe Loch Ness Phenomena Investigation Bureau (LNPIB) was a UK-based society formed in 1962 by Norman Collins, R. S. R. Fitter, politician David James, Peter Scott and Constance WhyteHenry H. Bauer, The Enigma of Loch Ness: Making Sense of a Mystery, page 163 (University of Illinois Press, 1986).  \"to study Loch Ness to identify the creature known as the Loch Ness Monster or determine the causes of reports of it\".Rick Emmer, Loch Ness Monster: Fact or Fiction?, page 35 (Infobase Publishing, 2010).  The society's name was later shortened to the Loch Ness Investigation Bureau (LNIB), and it disbanded in 1972. The LNIB had an annual subscription charge, which covered administration. Its main activity was encouraging groups of self-funded volunteers to watch the loch from vantage points with film cameras with telescopic lenses. From 1965 to 1972 it had a caravan camp and viewing platform at Achnahannet, and sent observers to other locations up and down the loch.Tim Dinsdale (1973) The Story of the Loch Ness Monster Target Books  According to the bureau's 1969 annual report it had 1,030 members, of whom 588 were from the UK.\n\nSonar study (1967–1968)\n\nD. Gordon Tucker, chair of the Department of Electronic and Electrical Engineering at the University of Birmingham, volunteered his services as a sonar developer and expert at Loch Ness in 1968. His gesture, part of a larger effort led by the LNPIB from 1967 to 1968, involved collaboration between volunteers and professionals in a number of fields. Tucker had chosen Loch Ness as the test site for a prototype sonar transducer with a maximum range of 800 m. The device was fixed underwater at Temple Pier in Urquhart Bay and directed at the opposite shore, drawing an acoustic \"net\" across the loch through which no moving object could pass undetected. During the two-week trial in August, multiple targets were identified. One was probably a shoal of fish, but others moved in a way not typical of shoals at speeds up to 10 knots.New Scientist 40 (1968): 564-566;  \"Sonar Picks Up Stirrings in Loch Ness\"\n\nRobert Rines studies (1972, 1975, 2001, 2008)\n\nIn 1972, a group of researchers from the Academy of Applied Science led by Robert H. Rines conducted a search for the monster involving sonar examination of the loch depths for unusual activity. Rines took precautions to avoid murky water with floating wood and peat. A submersible camera with a floodlight was deployed to record images below the surface. If Rines detected anything on the sonar, he turned the light on and took pictures.\n\nOn 8 August Rines' Raytheon DE-725C sonar unit, operating at a frequency of 200 kHz and anchored at a depth of 11 m, identified a moving target (or targets) estimated by echo strength at 6 to in length. Specialists from Raytheon, Simrad (now Kongsberg Maritime), Hydroacoustics, Marty Klein of MIT and Klein Associates (a side-scan sonar producer) and Ira Dyer of MIT's Department of Ocean Engineering were on hand to examine the data. P. Skitzki of Raytheon suggested that the data indicated a  3 m protuberance projecting from one of the echoes. According to author Roy Mackal, the shape was a \"highly flexible laterally flattened tail\" or the misinterpreted return from two animals swimming together.Roy Mackal (1976) The Monsters of Loch Ness page 307, see also appendix E\n\nConcurrent with the sonar readings, the floodlit camera obtained a pair of underwater photographs. Both depicted what appeared to be a rhomboid flipper, although sceptics have dismissed the images as the bottom of the loch, air bubbles, a rock, or a fish fin. The apparent flipper was photographed in different positions, indicating movement. The first flipper photo is better-known than the second, and both were enhanced and retouched from the original negatives. According to team member Charles Wyckoff, the photos were retouched to superimpose the flipper; the original enhancement showed a considerably less-distinct object. No one is sure how the originals were altered.Loch Ness Monster: Search for the Truth, 2001\n\nBritish naturalist Peter Scott announced in 1975, on the basis of the photographs, that the creature's scientific name would be Nessiteras rhombopteryx (Greek for \"Ness inhabitant with diamond-shaped fin\"). Scott intended that the name would enable the creature to be added to the British register of protected wildlife. Scottish politician Nicholas Fairbairn called the name an anagram for \"Monster hoax by Sir Peter S\".Dinsdale, T. \"Loch Ness Monster\" (Routledge and Kegan paul 1976), p.171. Dinsdale, in the same paragraph, also says that Robert Rines, co-author of the Nature article, \"soon came up with the antidote – 'Yes, both pix are monsters – R.'\"\n\nAnother sonar contact was made, this time with two objects estimated to be about 9 m. The strobe camera photographed two large, white, lumpy objects surrounded by a flurry of bubbles. Some interpreted the objects as two plesiosaur-like animals, suggesting several large animals living in Loch Ness. This photograph has rarely been published.\n\nIn 2001, Rines' Academy of Applied Science videotaped a V-shaped wake traversing still water on a calm day. The academy also videotaped an object on the floor of the loch resembling a carcass and found marine clamshells and a fungus-like organism not normally found in freshwater lochs, a suggested connection to the sea and a possible entry for the creature.Dr. Robert H. Rines. [http://www.aas-world.org/sparks/V1-four/lochness.html Loch Ness Findings] . Academy of Applied Science.\n\nIn 2008 Rines theorised that the creature may have become extinct, citing the lack of significant sonar readings and a decline in eyewitness accounts. He undertook a final expedition, using sonar and an underwater camera in an attempt to find a carcass. Rines believed that the animals may have failed to adapt to temperature changes resulting from global warming.\n\nOperation Deepscan (1987)\n\nOperation Deepscan was conducted in 1987. Twenty-four boats equipped with echosounder equipment were deployed across the width of the loch, and simultaneously sent acoustic waves. According to BBC News the scientists had made sonar contact with an unidentified object of unusual size. The researchers returned, re-scanning the area. Analysis of the echosounder images seemed to indicate debris at the bottom of the loch, although there was motion in three of the pictures. Adrian Shine speculated, based on size, that they might be seals which had entered the loch.\n\nSonar expert Darrell Lowrance, founder of Lowrance Electronics, donated a number of echosounder units used in the operation. After examining a sonar return indicating a large, moving object at a depth of 180 m near Urquhart Bay, Lowrance said: \"There's something here that we don't understand, and there's something here that's larger than a fish, maybe some species that hasn't been detected before. I don't know.\"Mysterious Creatures (1988) by the Editors of Time-Life Books, page 90\n\nSearching for the Loch Ness Monster (2003)\n\nIn 2003, the BBC sponsored a search of the loch using 600 sonar beams and satellite tracking. The search had sufficient resolution to identify a small buoy. No animal of substantial size was found and, despite their high hopes, the scientists involved admitted that this proved the Loch Ness Monster was a myth. Searching for the Loch Ness Monster aired on BBC One.\n\nExplanations\n\nA number of explanations have been suggested to account for sightings of the creaturePaxton, C.G.M. & Shine A.J. (2016) A checklist of historical hypotheses for the Loch Ness Monster. Journal of Cryptozoology 4, 21 - 38.. They may be categorised as misidentifications of known animals, misidentifications of inanimate objects or effects, reinterpretations of Scottish folklore, hoaxes, and exotic species of large animals.\n\nMisidentification of known animals\n\nBird wakes\n\nWakes have been reported when the loch is calm, with no boats nearby. Bartender David Munro reported a wake he believed was a creature zigzagging, diving, and reappearing; there were reportedly 26 other witnesses from a nearby car park. Although some sightings describe a V-shaped wake similar to a boat's, others report something not conforming to the shape of a boat.Discovery Communications, Loch Ness Discovered, 1993\n\nEels\n\nA large eel was an early suggestion. Eels are found in Loch Ness, and an unusually large one would explain many sightings.R. P. Mackal (1976) The Monsters of Loch Ness page 216, see also chapter 9 and appendix G Dinsdale dismissed the hypotheses, because eels undulate side to side like snakes.Tim Dinsdale (1961) Loch Ness Monster page 229 Sightings in 1856 of a \"sea-serpent\" (or kelpie) in a freshwater lake near Leurbost in the Outer Hebrides were explained as those of an oversized eel, also believed common in \"Highland lakes\".\n\nElephant\n\nIn a 1979 article, California biologist Dennis Power and geographer Donald Johnson claimed that the \"surgeon's photograph\" was the top of the head, extended trunk and flared nostrils of a swimming elephant photographed elsewhere and claimed to be from Loch Ness.A Fresh Look at Nessie, New Scientist, v. 83, pp. 358–359 In 2006, palaeontologist and artist Neil Clark suggested that travelling circuses might have allowed elephants to bathe in the loch; the trunk could be the perceived head and neck, with the head and back the perceived humps. In support of this, Clark provided a painting.\n\nGreenland shark\n\nZoologist, angler and television presenter Jeremy Wade investigated the creature in 2013 as part of the series River Monsters, and concluded that it is a Greenland shark. The Greenland shark, which can reach up to 20 feet in length, inhabits the North Atlantic Ocean around Canada, Greenland, Iceland, Norway, and possibly Scotland. It is dark in colour, with a small dorsal fin. According to biologist Bruce Wright, the Greenland shark could survive in fresh water (possibly using rivers and lakes to find food) and Loch Ness has an abundance of salmon and other fish.\n\nWels catfish\n\nIn July 2015 three news outlets reported that Steve Feltham, after a vigil at the loch which was recognized by the Guinness Book of Records, theorised that the monster is an unusually-large specimen of Wels catfish (Silurus glanis) which may have been released during the late 19th century.\n\nResident animals\n\nIt is difficult to judge the size of an object in water through a telescope or binoculars with no external reference. Loch Ness has resident otters, and photos of them and deer swimming in the loch which were cited by author Ronald BinnsR. Binns (1983) The Loch Ness Mystery Solved plates 15(a)-(f) may have been misinterpreted. According to Binns, birds may be mistaken for a \"head and neck\" sighting.R. Binns (1983) The Loch Ness Mystery Solved plates 16–18\n\nMisidentifications of inanimate objects or effects\n\nTrees\n\nIn 1933, the Daily Mirror published a picture with the caption: \"This queerly-shaped tree-trunk, washed ashore at Foyers [on Loch Ness] may, it is thought, be responsible for the reported appearance of a 'Monster.Daily Mirror 17 August 1933 page 12 \nIn a 1982 series of articles for New Scientist, Maurice Burton proposed that sightings of Nessie and similar creatures may be fermenting Scots pine logs rising to the surface of the loch. A decomposing log could not initially release gases caused by decay because of its high resin level. Gas pressure would eventually rupture a resin seal at one end of the log, propelling it through the water (sometimes to the surface). According to Burton, the shape of tree logs (with their branch stumps) closely resembles descriptions of the monster.\n\nSeiches and wakes\n\nLoch Ness, because of its long, straight shape, is subject to unusual ripples affecting its surface. A seiche is a large oscillation of a lake, caused by water reverting to its natural level after being blown to one end of the lake (resulting in a standing wave); the Loch Ness oscillation period is 31.5 minutes.\n\nOptical effects\n\nWind conditions can give a choppy, matte appearance to the water with calm patches appearing dark from the shore (reflecting the mountains). In 1979 W. H. Lehn showed that atmospheric refraction could distort the shape and size of objects and animals,W. H. Lehn (1979) Science vol 205. No. 4402 pages 183–185 \"Atmospheric Refraction and Lake Monsters\" and later published a photograph of a mirage of a rock on Lake Winnipeg which resembled a head and neck.\n\nSeismic gas\n\nItalian geologist Luigi Piccardi has proposed geological explanations for ancient legends and myths. Piccardi noted that in the earliest recorded sighting of a creature (the Life of Saint Columba), the creature's emergence was accompanied \"cum ingenti fremitu\" (\"with loud roaring\"). The Loch Ness is along the Great Glen Fault, and this could be a description of an earthquake. Many reports consist only of a large disturbance on the surface of the water; this could be a release of gas through the fault, although it may be mistaken for something swimming below the surface.\n\nAccording to Ronald Binns, there is probably no one explanation of the monster. A wide range of natural phenomena have been hypothesised, including otters, swimming deer, and unusual waves. Binns wrote that an aspect of human psychology is the ability of the eye to see what it wants, and expects, to see.\n\nFolklore\n\nIn 1980 Swedish naturalist and author Bengt Sjögren wrote that present beliefs in lake monsters such as the Loch Ness Monster are associated with kelpie legends. According to Sjögren, accounts of loch monsters have changed over time; originally describing horse-like creatures, they were intended to keep children away from the loch. Sjögren wrote that the kelpie legends have developed into descriptions reflecting a modern awareness of plesiosaurs.\n\nThe kelpie as a water horse in Loch Ness was mentioned in an 1879 Scottish newspaper,Aberdeen Weekly Journal, Wednesday, 11 June 1879 \"This kelpie had been in the habit of appearing as a beautiful black horse... No sooner had the weary unsuspecting victim seated himself in the saddle than away darted the horse with more than the speed of the hurricane and plunged into the deepest part of Loch Ness, and the rider was never seen again.\" and inspired Tim Dinsdale's Project Water Horse.Tim Dinsdale (1975) Project Water Horse. The true story of the monster quest at Loch Ness (Routledge & Kegan Paul)  A study of pre-1933 Highland folklore references to kelpies, water horses and water bulls indicated that Ness was the loch most frequently cited.Watson, Roland,The Water Horses of Loch Ness (2011) \n\nHoaxes\n\nA number of hoax attempts have been made, some of which were successful. Other hoaxes were revealed rather quickly by the perpetrators or exposed after diligent research. A few examples follow.\n\nIn August 1933, Italian journalist Francesco Gasparini submitted what he said was the first news article on the Loch Ness Monster. In 1959, he reported sighting a \"strange fish\" and fabricated eyewitness accounts: \"I had the inspiration to get hold of the item about the strange fish. The idea of the monster had never dawned on me, but then I noted that the strange fish would not yield a long article, and I decided to promote the imaginary being to the rank of monster without further ado.\"\n\nIn the 1930s, big-game hunter Marmaduke Wetherell went to Loch Ness to look for the monster. Wetherell claimed to have found footprints, but when casts of the footprints were sent to scientists for analysis they turned out to be from a hippopotamus; a prankster had used a hippopotamus-foot umbrella stand.\n\nIn 1972 a team of zoologists from Yorkshire's Flamingo Park Zoo, searching for the monster, discovered a large body floating in the water. The corpse,  long and weighing as much as 1.5 tonnes, was described by the Press Association as having \"a bear's head and a brown scaly body with clawlike fins.\" The creature was placed in a van to be carried away for testing, but police seized the cadaver under an act of parliament prohibiting the removal of \"unidentified creatures\" from Loch Ness. It was later revealed that Flamingo Park education officer John Shields shaved the whiskers and otherwise disfigured a bull elephant seal which had died the week before and dumped it in Loch Ness to dupe his colleagues. On 2 July 2003, Gerald McSorely discovered a fossil, supposedly from the creature, when he tripped and fell into the loch. After examination, it was clear that the fossil had been planted.\n\nIn 2004 a Five TV documentary team, using cinematic special-effects experts, tried to convince people that there was something in the loch. They constructed an animatronic model of a plesiosaur, calling it \"Lucy\". Despite setbacks (including Lucy falling to the bottom of the loch), about 600 sightings were reported where she was placed.\n\nIn 2005, two students claimed to have found a large tooth embedded in the body of a deer on the loch shore. They publicised the find, setting up a website, but expert analysis soon revealed that the \"tooth\" was the antler of a muntjac. The tooth was a publicity stunt to promote a horror novel by Steve Alten, The Loch.\n\nExotic large-animal species\n\nPlesiosaur\n\nIn 1933 it was suggested that the creature \"bears a striking resemblance to the supposedly extinct plesiosaur\",R. J. Binns (1983) The Loch Ness Mystery Solved, page 22 a long-necked aquatic reptile which became extinct during the Cretaceous–Paleogene extinction event. A popular explanation at the time, the following arguments have been made against it:\n* Plesiosaurs were probably cold-blooded reptiles needing warm tropical waters; the average temperature of Loch Ness is only about .Rick Emmer, Loch Ness Monster: Fact or Fiction?, page 62 (Infobase Publishing, 2010).  If the plesiosaurs were warm-blooded, they would require a food supply beyond that supplied by Loch Ness.\n* In an October 2006 New Scientist article, \"Why the Loch Ness Monster is no plesiosaur\", Leslie Noè of the Sedgwick Museum in Cambridge said: \"The osteology of the neck makes it absolutely certain that the plesiosaur could not lift its head up swan-like out of the water\".\n* The loch is only about 10,000 years old, dating to the end of the last ice age. Before then, it was frozen for about 20,000 years.\n* If creatures similar to plesiosaurs lived in Loch Ness they would be seen frequently, since they would have to surface several times a day to breathe.\n\nIn response to these criticisms, Tim Dinsdale, Peter Scott and Roy Mackal postulate a trapped marine creature which evolved from a plesiosaur directly or by convergent evolution.Roy P. Mackal (1976) The Monsters of Loch Ness, page 138 Robert Rines explained that the \"horns\" in some sightings as breathing tubes (or nostrils), allowing it to breathe without breaking the surface.\n\nLong-necked giant amphibian\n\nR. T. Gould suggested a long-necked newt;The Times 9 December 1933, page 14 Roy Mackal examined the possibility, giving it the highest score (88 percent) on his list of possible candidates.R. P. Mackal (1976) The Monsters of Loch Ness, pages 138–9, 211–213\n\nInvertebrate\n\nIn 1968 F. W. (Ted) Holiday proposed that Nessie and other lake monsters, such as Morag, may be a large invertebrate such as a bristleworm; he cited the extinct Tullimonstrum as an example of the shape.Holiday, F.T. The Great Orm of Loch Ness (Faber and Faber 1968) According to Holiday, this explains the land sightings and the variable back shape; he likened it to the medieval description of dragons as \"worms\". Although this theory was considered by Mackal, he found it less convincing than eels, amphibians or plesiosaurs.R. P. Mackal (1976) The Monsters of Loch Ness pages 141–142, chapter XIV\n\nSee also\n\n* Bear Lake monster\n* Beithir\n* Bunyip\n* Chessie (sea monster)\n* Gaasyendietha\n* Jiaolong\n* Lake Tianchi Monster\n* Lake Van Monster\n* Lariosauro\n* Leviathan\n* List of reported lake monsters\n* List of topics characterised as pseudoscience\n* Living dinosaurs\n* Loch Ness Monster in popular culture\n* Manipogo\n* Memphre\n* Mokele-mbembe\n* Nahuel Huapi Lake Monster\n* Sea monster\n* Selma (lake monster)\n* Stronsay Beast\n* Wani (dragon)\n\nFootnotes\n\n;Notes\n\n;References\n\nBibliography\n\n* Bauer, Henry H. The Enigma of Loch Ness: Making Sense of a Mystery, Chicago, University of Illinois Press, 1986\n* Binns, Ronald, The Loch Ness Mystery Solved, Great Britain, Open Books, 1983,  and Star Books, 1984, \n* Burton, Maurice, The Elusive Monster: An Analysis of the Evidence from Loch Ness, London, Rupert Hart-Davis, 1961\n* Campbell, Steuart. The Loch Ness Monster – The Evidence, Buffalo, New York, Prometheus Books, 1985.\n* Dinsdale, Tim, Loch Ness Monster, London, Routledge & Kegan Paul, 1961, SBN 7100 1279 9\n* Harrison, Paul The encyclopaedia of the Loch Ness Monster, London, Robert Hale, 1999\n* Gould, R. T., The Loch Ness Monster and Others, London, Geoffrey Bles, 1934 and paperback, Lyle Stuart, 1976, \n* Holiday, F. W., The Great Orm of Loch Ness, London, Faber & Faber, 1968, SBN 571 08473 7\n* Mackal, Roy P., The Monsters of Loch Ness, London, Futura, 1976, \n* Whyte, Constance, More Than a Legend: The Story of the Loch Ness Monster, London, Hamish Hamilton, 1957\n\nDocumentary\n\n* Secrets of Loch Ness. Produced & Directed by Christopher Jeans (ITN/Channel 4/A&E Network, 1995).",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Loch Ness Monster" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17877" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In Scottish folklore, the Loch Ness Monster or Nessie, is an aquatic being which reputedly inhabits Loch Ness in the Scottish Highlands. It is similar to other supposed lake monsters in Scotland and elsewhere, and is often described as being large in size, with a long neck and one or more humps protruding from the water. Popular interest and belief in the creature has varied since it was brought to worldwide attention in 1933. Evidence of its existence is anecdotal, with a few disputed photographs and sonar readings.\n\nThe creature commonly appears in Western media where it manifests in a variety of ways. The scientific community regards the Loch Ness Monster as a a phenomenon without biological basis, explaining sightings as hoaxes, wishful thinking, and the misidentification of mundane objects.\n\nName\n\nThe creature has been affectionately called Nessie ()Campbell, Elizabeth Montgomery & David Solomon, The Search for Morag (Tom Stacey 1972) , page 28 gives an-t-Seileag, an-Niseag, a-Mhorag for the monsters of Lochs Shiel, Ness and Morag, adding that they are feminine diminutives since the 1940s.\n\nOrigins\n\nThe word \"monster\" was reportedly applied for the first time to the creature on 2 May 1933 by Alex Campbell, water bailiff for Loch Ness and a part-time journalist, in an Inverness Courier report.The Sun 27 November 1975: I'm the man who first coined the word \"monster\" for the creature.R. Binns The Loch Ness Mystery Solved pp 11–12Inverness Courier 2 May 1933 \"Loch Ness has for generations been credited with being the home of a fearsome-looking monster\" On 4 August 1933 the Courier published a report by Londoner George Spicer that several weeks earlier, while they were driving around the loch, he and his wife saw \"the nearest approach to a dragon or pre-historic animal that I have ever seen in my life\" trundling across the road toward the loch with \"an animal\" in its mouth. Letters began appearing in the Courier, often anonymously, claiming land or water sightings by the writer, their family or acquaintances or remembered stories.R. Binns The Loch Ness Mystery Solved pp 19–27 The accounts reached the media, which described a \"monster fish\", \"sea serpent\", or \"dragon\"Daily Mirror, 11 August 1933 \"Loch Ness, which is becoming famous as the supposed abode of a dragon...\" and eventually settled on \"Loch Ness monster\".The Oxford English Dictionary gives 9 June 1933 as the first usage of the exact phrase Loch Ness monster\n\nOn 6 December 1933 the first purported photograph of the monster, taken by Hugh Gray, was published in the Daily Express;R. P. Mackal (1983) \"The Monsters of Loch Ness\" p.94 the Secretary of State for Scotland soon ordered police to prevent any attacks on it.Daily Mirror 8 December 1933 \"The Monster of Loch Ness – Official! Orders That Nobody is to Attack it\" ... A Huge Eel?\" In 1934, interest was further piqued by the \"surgeon's photograph\". That year, R. T. Gould published an account of the author's investigation and a record of reports predating 1933. Other authors have claimed sightings of the monster dating to the sixth century AD.\n\nHistory\n\nSaint Columba (565)\n\nThe earliest report of a monster in the vicinity of Loch Ness appears in the Life of St. Columba by Adomnán, written in the sixth century AD.J. A Carruth Loch Ness and its Monster, (1950) Abbey Press, Fort Augustus, cited by Tim Dinsdale (1961) Loch Ness Monster ppp 33–35 According to Adomnán, writing about a century after the events described, Irish monk Saint Columba was staying in the land of the Picts with his companions when he encountered local residents burying a man by the River Ness. They explained that the man was swimming in the river when he was attacked by a \"water beast\" which mauled him and dragged him underwater. Although they tried to rescue him in a boat, he was dead. Columba sent a follower, Luigne moccu Min, to swim across the river. The beast approached him, but Columba made the sign of the cross and said: \"Go no further. Do not touch the man. Go back at once.\"Adomnán, p. 176 (II:27). The creature stopped as if it had been \"pulled back with ropes\" and fled, and Columba's men and the Picts gave thanks for what they perceived as a miracle.\n\nBelievers in the monster point to this story, set in the River Ness rather than the loch itself, as evidence for the creature's existence as early as the sixth century.Adomnán p. 330. Sceptics question the narrative's reliability, noting that water-beast stories were extremely common in medieval hagiographies and Adomnán's tale probably recycles a common motif attached to a local landmark.R. Binns The Loch Ness Mystery Solved, pp. 52–57 According to sceptics, Adomnán's story may be independent of the modern Loch Ness Monster legend and became attached to it by believers seeking to bolster their claims.  Ronald Binns considers that this is the most serious of various alleged early sightings of the monster, but all other claimed sightings before 1933 are dubious and do not prove a monster tradition before that date.\n\nD. Mackenzie (1871 or 1872)\n\nIn October 1871 (or 1872), D. Mackenzie of Balnain reportedly saw an object resembling a log or an upturned boat \"wriggling and churning up the water\". The object moved slowly at first, disappearing at a faster speed. Mackenzie sent his story in a letter to Rupert Gould in 1934, shortly after popular interest in the monster increased.\n\nGeorge Spicer (1933)\n\nModern interest in the monster was sparked by a sighting on 22 July 1933, when George Spicer and his wife saw \"a most extraordinary form of animal\" cross the road in front of their car. They described the creature as having a large body (about 4 ft high and 25 ft long) and a long, wavy, narrow neck, slightly thicker than an elephant's trunk and as long as the 10 - width of the road. They saw no limbs.T. Dinsdale (1961) Loch Ness Monster page 42. It lurched across the road towards the loch 20 yd away, leaving a trail of broken undergrowth in its wake.\n\nIt has been claimed that sightings of the monster increased after a road was built along the loch in early 1933, bringing workers and tourists to the formerly-isolated area.R. Mackal (1976) \"The Monsters of Loch Ness\" page 85. However, Binns has described this as \"the myth of the lonely loch\", as it was far from isolated before then, due to the construction of the Caledonian Canal.  In the 1930s, the existing road by the side of the loch was given a serious upgrade (just possibly this work could have contributed to the legend, since there could have been tar barrels floating in the loch).\n\nHugh Gray (1933)\n\nHugh Gray's photograph taken near Foyers on November 12, 1933 was the first photograph alleged to depict the monster. It was slightly blurred, and it has been noted that if one looks closely the head of a dog can be seen. Gray had taken his Labrador for a walk that day, and it is suspected that the photograph depicts his dog fetching a stick from the loch.Loxton, Daniel; Prothero, Donald. (2015). Abominable Science! Origins of the Yeti, Nessie, and Other Famous Cryptids. Columbia University Press. pp. 142-144.  Others have suggested the photograph depicts an otter or a swan. The original negative was lost. However, in 1963 Maurice Burton came into \"possession of two lantern slides, contact positives from th[e] original negative\" and when projected on screen it revealed an \"otter rolling at the surface in characteristic fashion.\"Burton, Maurice. A Ring of bright water? New Scientist. 24 June 1982. p. 872\n\nArthur Grant (1934)\n\nOn January 5, 1934 a motorcyclist, Arthur Grant, claimed to have nearly hit the creature while approaching Abriachan (near the north-eastern end of the loch) at about 1 a.m. on a moonlit night.Campbell, Steuart. (1997). The Loch Ness Monster: The Evidence. Prometheus Books. p. 33.  According to Grant, it had a small head attached to a long neck; the creature saw him, and crossed the road back to the loch. Grant, a veterinary student, described it as a cross between a seal and a plesiosaur. He said he dismounted and followed it to the loch, but only saw ripples.Tim Dinsdale Loch Ness Monster pp 44–5\n\nGrant produced a sketch of the creature, it was examined by zoologist Maurice Burton who stated it was consistent with the appearance and behaviour of an otter.Burton, Maurice. A Fast Moving, Agile Beastie. New Scientist. 1 July 1982. p. 41. Regarding the long size of the creature reported by Grant; it has been suggested that this was a faulty observation due to the poor light conditions.Burton, Maurice. (1961). Loch Ness Monster: A Burst Bubble? The Illustrated London News. May, 27. p. 896 Palaeontologist Darren Naish has suggested that Grant may have seen either an otter or a seal and exaggerated his sighting over time.Naish, Darren. (2016). [https://books.google.com/books?idmN2oCwAAQBAJ&pg\nPT77&dq%22arthur+grant%22+seal&hl\nen&saX&ved\n0ahUKEwj5-ujUlfzTAhUjLcAKHflzAoE4ChC7BQg1MAM#vonepage&q\n%22arthur%20grant%22%20seal&f=false \"Hunting Monsters: Cryptozoology and the Reality Behind the Myths\"]. Arcturus.\n\n\"Surgeon's photograph\" (1934)\n\nThe \"surgeon's photograph\" is reportedly the first photo of the creature's head and neck.R. P. Mackal (1976) The Monsters of Loch Ness page 208 Supposedly taken by Robert Kenneth Wilson, a London gynaecologist, it was published in the Daily Mail on 21 April 1934.Daily Mail 21 April 1934 Wilson's refusal to have his name associated with it led to it being known as the \"surgeon's photograph\". According to Wilson, he was looking at the loch when he saw the monster, grabbed his camera and snapped four photos. Only two exposures came out clearly; the first reportedly shows a small head and back, and the second shows a similar head in a diving position. The first photo became well-known, and the second attracted little publicity because of its blurriness.\n\nAlthough for a number of years the photo was considered evidence of the monster, sceptics dismissed it as driftwood, an elephant, an otter, or a bird. The photo's scale was controversial; it is often shown cropped (making the creature seem large and the ripples like waves), while the uncropped shot shows the other end of the loch and the monster in the centre. The ripples in the photo were found to fit the size and pattern of small ripples, unlike large waves photographed up close. Analysis of the original image fostered further doubt. In 1993, the makers of the Discovery Communications documentary Loch Ness Discovered analysed the uncropped image and found a white object visible in every version of the photo (implying that it was on the negative). It was believed to be the cause of the ripples, as if the object was being towed, although the possibility of a blemish on the negative could not be ruled out. An analysis of the full photograph indicated that the object was small, about 60 to long.\n\nSince 1994, most agree that the photo was an elaborate hoax. It had been accused of being a fake in a 7 December 1975 Sunday Telegraph article which fell into obscurity.[http://www.strangemag.com/strangemag/strange21/reviews21/surgeonsphoto21.html Book review of Nessie – The Surgeon's Photograph – Exposed] Douglas Chapman. Details of how the photo was taken were published in the 1999 book, Nessie – the Surgeon's Photograph Exposed, which contains a facsimile of the 1975 Sunday Telegraph article.David S. Martin & Alastair Boyd (1999) Nessie – the Surgeon's Photograph Exposed (East Barnet: Martin and Boyd).  The creature was reportedly a toy submarine built by Christian Spurling, the son-in-law of Marmaduke Wetherell. Wetherell had been publicly ridiculed by his employer, the Daily Mail, after he found \"Nessie footprints\" which turned out to be a hoax. To get revenge on the Mail, Wetherell perpetrated his hoax with co-conspirators Spurling (sculpture specialist), Ian Wetherell (his son, who bought the material for the fake), and Maurice Chambers (an insurance agent). The toy submarine was bought from F. W. Woolworths, and its head and neck were made from wood putty. After testing it in a local pond the group went to Loch Ness, where Ian Wetherell took the photos near the Altsaigh Tea House. When they heard a water bailiff approaching, Duke Wetherell sank the model with his foot and it is \"presumably still somewhere in Loch Ness\".The Mammoth Encyclopedia of the Unsolved Chambers gave the photographic plates to Wilson, a friend of his who enjoyed \"a good practical joke\". Wilson brought the plates to Ogston's, an Inverness chemist, and gave them to George Morrison for development. He sold the first photo to the Daily Mail, who then announced that the monster had been photographed.\n\nLittle is known of the second photo; it is often ignored by researchers, who believe its quality too poor and its differences from the first photo too great to warrant analysis. It shows a head similar to the first photo, with a more turbulent wave pattern and possibly taken at a different time and location in the loch. Some believe it to be an earlier, cruder attempt at a hoax, and others (including Roy Mackal and Maurice Burton) consider it a picture of a diving bird or otter which Wilson mistook for the monster.Mackal, Roy. The Monsters of Loch Ness. According to Morrison, when the plates were developed Wilson was uninterested in the second photo; he allowed Morrison to keep the negative, and the second photo was rediscovered years later.The Loch Ness Story, revised edition, Penguin Books, 1975, pp. 44–45 When asked about the second photo by the Ness Information Service Newsletter, Spurling \" ... was vague, thought it might have been a piece of wood they were trying out as a monster, but [was] not sure.\"Ness Information Service Newsletter, 1991 issue\n\nTaylor film (1938)\n\nOn 29 May 1938, South African tourist G. E. Taylor filmed something in the loch for three minutes on 16 mm colour film. The film was obtained by popular science writer Maurice Burton, who did not show it to other researchers. A single frame was published in his 1961 book, The Elusive Monster. His analysis concluded it was a floating object, not an animal.Burton, Maurice. (1961). The Elusive Monster: An Analysis of the Evidence From Loch Ness. Hart-Davis. pp. 83-84\n\nWilliam Fraser (1938)\n\nOn 15 August 1938, William Fraser, chief constable of Inverness-shire, wrote a letter that the monster existed beyond doubt and expressed concern about a hunting party which had arrived (with a custom-made harpoon gun) determined to catch the monster \"dead or alive\". He believed his power to protect the monster from the hunters was \"very doubtful\". The letter was released by the National Archives of Scotland on 27 April 2010.\n\nSonar readings (1954)\n\nIn December 1954, sonar readings were taken by the fishing boat Rival III. Its crew noted a large object keeping pace with the vessel at a depth of 146 m. It was detected for 800 m before contact was lost and regained. Previous sonar attempts were inconclusive or negative.\n\nPeter MacNab (1955)\n\nPeter MacNab at Urquhart Castle on July 29, 1955 took a photograph that depicted two long black humps in the water. The photograph was not made public until it appeared in Constance Whyte's 1957 book on the subject. On 23 October 1958 it was published by the Weekly Scotsman. Author Ronald Binns wrote that the \"phenomenon which MacNab photographed could easily be a wave effect resulting from three trawlers travelling closely together up the loch.\"Binns, Ronald. (1983). The Loch Ness Mystery Solved. Prometheus Books. p. 102\n\nOther researchers consider the photograph a hoax.Campbell, Steuart. (1991). The Loch Ness Monster: The Evidence. Aberdeen University Press. pp. 43-44. Roy Mackal requested to use the photograph in his 1976 book. He received the original negative from MacNab, but discovered it differed from the photograph that appeared in Whyte's book. The tree at the bottom left in Whyte's was missing from the negative. It is suspected that the photograph was doctored by re-photographing a print.[http://hoaxes.org/archive/permalink/the_macnab_photograph \"The MacNab Photograph\"]. The Museum of Hoaxes.\n\nDinsdale film (1960)\n\nAeronautical engineer Tim Dinsdale filmed a hump which left a wake crossing Loch Ness in 1960. Dinsdale, who reportedly had the sighting on his final day of search, described it as reddish with a blotch on its side. He said that when he mounted his camera the object began to move, and he shot 40 feet of film. According to JARIC, the object was \"probably animate\". Others were sceptical, saying that the \"hump\" cannot be ruled out as being a boat and when the contrast is increased, a man in a boat can be seen.\n\nIn 1993 Discovery Communications produced a documentary, Loch Ness Discovered, with a digital enhancement of the Dinsdale film. A person who enhanced the film noticed a shadow in the negative which was not obvious in the developed film. By enhancing and overlaying frames, he found what appeared to be the rear body of a creature underwater: \"Before I saw the film, I thought the Loch Ness Monster was a load of rubbish. Having done the enhancement, I'm not so sure\".\n\n\"Loch Ness Muppet\" (1977)\n\nOn 21 May 1977 Anthony \"Doc\" Shiels, camping next to Urquhart Castle, took \"some of the clearest pictures of the monster until this day\". Shiels, a magician and psychic, claimed to have summoned the animal out of the water. He later described it as an \"elephant squid\", claiming the long neck shown in the photograph is actually the squid's \"trunk\" and that a white spot at the base of the neck is its eye. Due to the lack of ripples, it has been declared a hoax by a number of people and received its name because of its staged look.\n\nHolmes video (2007)\n\nOn 26 May 2007, 55-year-old laboratory technician Gordon Holmes videotaped what he said was \"this jet black thing, about 14 m long, moving fairly fast in the water.\" Adrian Shine, a marine biologist at the Loch Ness 2000 Centre in Drumnadrochit, described the footage as among \"the best footage [he had] ever seen.\" BBC Scotland broadcast the video on 29 May 2007. STV News North Tonight aired the footage on 28 May 2007 and interviewed Holmes. Shine was also interviewed, and suggested that the footage was an otter, seal or water bird.\n\nSonar image (2011)\n\nOn 24 August 2011 Loch Ness boat captain Marcus Atkinson photographed a sonar image of a , unidentified object which seemed to follow his boat for two minutes at a depth of 23 m, and ruled out the possibility of a small fish or seal. In April 2012, a scientist from the National Oceanography Centre said that the image is a bloom of algae and zooplankton.\n\nGeorge Edwards photograph (2011)\n\nOn 3 August 2012, skipper George Edwards claimed that a photo he took on 2 November 2011 shows \"Nessie\". Edwards claims to have searched for the monster for 26 years, and reportedly spent 60 hours per week on the loch aboard his boat, Nessie Hunter IV, taking tourists for rides on the lake. Edwards said, \"In my opinion, it probably looks kind of like a manatee, but not a mammal. When people see three humps, they're probably just seeing three separate monsters.\"McLaughlin, Erin, \"[http://gma.yahoo.com/blogs/abc-blogs/scottish-sailor-claims-best-picture-yet-loch-ness-100057921--abc-news-topstories.html Scottish Sailor Claims To Have Best Picture Yet Of Loch Ness Monster]\", ABC News/Yahoo! News, 16 August 2012\n\nOther researchers have questioned the photograph's authenticity, and Loch Ness researcher Steve Feltham suggested that the object in the water is a fibreglass hump used in a National Geographic Channel documentary in which Edwards had participated. Researcher Dick Raynor has questioned Edwards' claim of discovering a deeper bottom of Loch Ness, which Raynor calls \"Edwards Deep\". He found inconsistencies between Edwards' claims for the location and conditions of the photograph and the actual location and weather conditions that day. According to Raynor, Edwards told him he had faked a photograph in 1986 which he claimed was genuine in the Nat Geo documentary. Although Edwards admitted in October 2013 that his 2011 photograph was a hoax, he insisted that the 1986 photograph was genuine.\n\nDavid Elder video (2013)\n\nOn 27 August 2013, tourist David Elder presented a five-minute video of a \"mysterious wave\" in the loch. According to Elder, the wave was produced by a  \"solid black object\" just under the surface of the water. Elder, 50, from East Kilbride, South Lanarkshire, was taking a picture of a swan at the Fort Augustus pier on the south-western end of the loch, when he captured the movement. He said, \"The water was very still at the time and there were no ripples coming off the wave and no other activity on the water.\" Sceptics suggested that the wave may have been caused by a wind gust.\n\nApple Maps photograph (2014)\n\nOn 19 April 2014, it was reported that a satellite image on Apple Maps showed what appeared to be a large creature (thought by some to be the Loch Ness Monster) just below the surface of Loch Ness. At the loch's far north, the image appeared about 30 m long. Possible explanations were the wake of a boat (with the boat itself lost in image stitching or low contrast), seal-caused ripples, or floating wood.\n\nGoogle Street View (2015)\n\nGoogle commemorated the 81st anniversary of the \"surgeon's photograph\" with a Google Doodle, and added a new feature to Google Street View with which users can explore the loch above and below the water. Google reportedly spent a week at Loch Ness collecting imagery with a street-view \"trekker\" camera, attaching it to a boat to photograph above the surface and collaborating with members of the Catlin Seaview Survey to photograph underwater.\n\nSearches\n\nEdward Mountain expedition (1934)\n\nAfter reading Rupert Gould's The Loch Ness Monster and Others, Edward Mountain financed a search. Twenty men with binoculars and cameras positioned themselves around the loch from 9 am to 6 pm for five weeks, beginning on 13 July 1934. Although 21 photographs were taken, none was considered conclusive. Supervisor James Fraser remained by the loch filming on 15 September 1934; the film is now lost.R. Binns (1983) The Loch Ness Mystery Solved , pages 36–39 Zoologists and professors of natural history concluded that the film showed a seal, possibly a grey seal.The Times 5 October 1934, page 12 Loch Ness \"Monster\" Film\n\nLoch Ness Phenomena Investigation Bureau (1962–1972)\n\nThe Loch Ness Phenomena Investigation Bureau (LNPIB) was a UK-based society formed in 1962 by Norman Collins, R. S. R. Fitter, politician David James, Peter Scott and Constance WhyteHenry H. Bauer, The Enigma of Loch Ness: Making Sense of a Mystery, page 163 (University of Illinois Press, 1986).  \"to study Loch Ness to identify the creature known as the Loch Ness Monster or determine the causes of reports of it\".Rick Emmer, Loch Ness Monster: Fact or Fiction?, page 35 (Infobase Publishing, 2010).  The society's name was later shortened to the Loch Ness Investigation Bureau (LNIB), and it disbanded in 1972. The LNIB had an annual subscription charge, which covered administration. Its main activity was encouraging groups of self-funded volunteers to watch the loch from vantage points with film cameras with telescopic lenses. From 1965 to 1972 it had a caravan camp and viewing platform at Achnahannet, and sent observers to other locations up and down the loch.Tim Dinsdale (1973) The Story of the Loch Ness Monster Target Books  According to the bureau's 1969 annual report it had 1,030 members, of whom 588 were from the UK.\n\nSonar study (1967–1968)\n\nD. Gordon Tucker, chair of the Department of Electronic and Electrical Engineering at the University of Birmingham, volunteered his services as a sonar developer and expert at Loch Ness in 1968. His gesture, part of a larger effort led by the LNPIB from 1967 to 1968, involved collaboration between volunteers and professionals in a number of fields. Tucker had chosen Loch Ness as the test site for a prototype sonar transducer with a maximum range of 800 m. The device was fixed underwater at Temple Pier in Urquhart Bay and directed at the opposite shore, drawing an acoustic \"net\" across the loch through which no moving object could pass undetected. During the two-week trial in August, multiple targets were identified. One was probably a shoal of fish, but others moved in a way not typical of shoals at speeds up to 10 knots.New Scientist 40 (1968): 564-566;  \"Sonar Picks Up Stirrings in Loch Ness\"\n\nRobert Rines studies (1972, 1975, 2001, 2008)\n\nIn 1972, a group of researchers from the Academy of Applied Science led by Robert H. Rines conducted a search for the monster involving sonar examination of the loch depths for unusual activity. Rines took precautions to avoid murky water with floating wood and peat. A submersible camera with a floodlight was deployed to record images below the surface. If Rines detected anything on the sonar, he turned the light on and took pictures.\n\nOn 8 August Rines' Raytheon DE-725C sonar unit, operating at a frequency of 200 kHz and anchored at a depth of 11 m, identified a moving target (or targets) estimated by echo strength at 6 to in length. Specialists from Raytheon, Simrad (now Kongsberg Maritime), Hydroacoustics, Marty Klein of MIT and Klein Associates (a side-scan sonar producer) and Ira Dyer of MIT's Department of Ocean Engineering were on hand to examine the data. P. Skitzki of Raytheon suggested that the data indicated a  3 m protuberance projecting from one of the echoes. According to author Roy Mackal, the shape was a \"highly flexible laterally flattened tail\" or the misinterpreted return from two animals swimming together.Roy Mackal (1976) The Monsters of Loch Ness page 307, see also appendix E\n\nConcurrent with the sonar readings, the floodlit camera obtained a pair of underwater photographs. Both depicted what appeared to be a rhomboid flipper, although sceptics have dismissed the images as the bottom of the loch, air bubbles, a rock, or a fish fin. The apparent flipper was photographed in different positions, indicating movement. The first flipper photo is better-known than the second, and both were enhanced and retouched from the original negatives. According to team member Charles Wyckoff, the photos were retouched to superimpose the flipper; the original enhancement showed a considerably less-distinct object. No one is sure how the originals were altered.Loch Ness Monster: Search for the Truth, 2001\n\nBritish naturalist Peter Scott announced in 1975, on the basis of the photographs, that the creature's scientific name would be Nessiteras rhombopteryx (Greek for \"Ness inhabitant with diamond-shaped fin\"). Scott intended that the name would enable the creature to be added to the British register of protected wildlife. Scottish politician Nicholas Fairbairn called the name an anagram for \"Monster hoax by Sir Peter S\".Dinsdale, T. \"Loch Ness Monster\" (Routledge and Kegan paul 1976), p.171. Dinsdale, in the same paragraph, also says that Robert Rines, co-author of the Nature article, \"soon came up with the antidote – 'Yes, both pix are monsters – R.'\"\n\nAnother sonar contact was made, this time with two objects estimated to be about 9 m. The strobe camera photographed two large, white, lumpy objects surrounded by a flurry of bubbles. Some interpreted the objects as two plesiosaur-like animals, suggesting several large animals living in Loch Ness. This photograph has rarely been published.\n\nIn 2001, Rines' Academy of Applied Science videotaped a V-shaped wake traversing still water on a calm day. The academy also videotaped an object on the floor of the loch resembling a carcass and found marine clamshells and a fungus-like organism not normally found in freshwater lochs, a suggested connection to the sea and a possible entry for the creature.Dr. Robert H. Rines. [http://www.aas-world.org/sparks/V1-four/lochness.html Loch Ness Findings] . Academy of Applied Science.\n\nIn 2008 Rines theorised that the creature may have become extinct, citing the lack of significant sonar readings and a decline in eyewitness accounts. He undertook a final expedition, using sonar and an underwater camera in an attempt to find a carcass. Rines believed that the animals may have failed to adapt to temperature changes resulting from global warming.\n\nOperation Deepscan (1987)\n\nOperation Deepscan was conducted in 1987. Twenty-four boats equipped with echosounder equipment were deployed across the width of the loch, and simultaneously sent acoustic waves. According to BBC News the scientists had made sonar contact with an unidentified object of unusual size. The researchers returned, re-scanning the area. Analysis of the echosounder images seemed to indicate debris at the bottom of the loch, although there was motion in three of the pictures. Adrian Shine speculated, based on size, that they might be seals which had entered the loch.\n\nSonar expert Darrell Lowrance, founder of Lowrance Electronics, donated a number of echosounder units used in the operation. After examining a sonar return indicating a large, moving object at a depth of 180 m near Urquhart Bay, Lowrance said: \"There's something here that we don't understand, and there's something here that's larger than a fish, maybe some species that hasn't been detected before. I don't know.\"Mysterious Creatures (1988) by the Editors of Time-Life Books, page 90\n\nSearching for the Loch Ness Monster (2003)\n\nIn 2003, the BBC sponsored a search of the loch using 600 sonar beams and satellite tracking. The search had sufficient resolution to identify a small buoy. No animal of substantial size was found and, despite their high hopes, the scientists involved admitted that this proved the Loch Ness Monster was a myth. Searching for the Loch Ness Monster aired on BBC One.\n\nExplanations\n\nA number of explanations have been suggested to account for sightings of the creaturePaxton, C.G.M. & Shine A.J. (2016) A checklist of historical hypotheses for the Loch Ness Monster. Journal of Cryptozoology 4, 21 - 38.. They may be categorised as misidentifications of known animals, misidentifications of inanimate objects or effects, reinterpretations of Scottish folklore, hoaxes, and exotic species of large animals.\n\nMisidentification of known animals\n\nBird wakes\n\nWakes have been reported when the loch is calm, with no boats nearby. Bartender David Munro reported a wake he believed was a creature zigzagging, diving, and reappearing; there were reportedly 26 other witnesses from a nearby car park. Although some sightings describe a V-shaped wake similar to a boat's, others report something not conforming to the shape of a boat.Discovery Communications, Loch Ness Discovered, 1993\n\nEels\n\nA large eel was an early suggestion. Eels are found in Loch Ness, and an unusually large one would explain many sightings.R. P. Mackal (1976) The Monsters of Loch Ness page 216, see also chapter 9 and appendix G Dinsdale dismissed the hypotheses, because eels undulate side to side like snakes.Tim Dinsdale (1961) Loch Ness Monster page 229 Sightings in 1856 of a \"sea-serpent\" (or kelpie) in a freshwater lake near Leurbost in the Outer Hebrides were explained as those of an oversized eel, also believed common in \"Highland lakes\".\n\nElephant\n\nIn a 1979 article, California biologist Dennis Power and geographer Donald Johnson claimed that the \"surgeon's photograph\" was the top of the head, extended trunk and flared nostrils of a swimming elephant photographed elsewhere and claimed to be from Loch Ness.A Fresh Look at Nessie, New Scientist, v. 83, pp. 358–359 In 2006, palaeontologist and artist Neil Clark suggested that travelling circuses might have allowed elephants to bathe in the loch; the trunk could be the perceived head and neck, with the head and back the perceived humps. In support of this, Clark provided a painting.\n\nGreenland shark\n\nZoologist, angler and television presenter Jeremy Wade investigated the creature in 2013 as part of the series River Monsters, and concluded that it is a Greenland shark. The Greenland shark, which can reach up to 20 feet in length, inhabits the North Atlantic Ocean around Canada, Greenland, Iceland, Norway, and possibly Scotland. It is dark in colour, with a small dorsal fin. According to biologist Bruce Wright, the Greenland shark could survive in fresh water (possibly using rivers and lakes to find food) and Loch Ness has an abundance of salmon and other fish.\n\nWels catfish\n\nIn July 2015 three news outlets reported that Steve Feltham, after a vigil at the loch which was recognized by the Guinness Book of Records, theorised that the monster is an unusually-large specimen of Wels catfish (Silurus glanis) which may have been released during the late 19th century.\n\nResident animals\n\nIt is difficult to judge the size of an object in water through a telescope or binoculars with no external reference. Loch Ness has resident otters, and photos of them and deer swimming in the loch which were cited by author Ronald BinnsR. Binns (1983) The Loch Ness Mystery Solved plates 15(a)-(f) may have been misinterpreted. According to Binns, birds may be mistaken for a \"head and neck\" sighting.R. Binns (1983) The Loch Ness Mystery Solved plates 16–18\n\nMisidentifications of inanimate objects or effects\n\nTrees\n\nIn 1933, the Daily Mirror published a picture with the caption: \"This queerly-shaped tree-trunk, washed ashore at Foyers [on Loch Ness] may, it is thought, be responsible for the reported appearance of a 'Monster.Daily Mirror 17 August 1933 page 12 \nIn a 1982 series of articles for New Scientist, Maurice Burton proposed that sightings of Nessie and similar creatures may be fermenting Scots pine logs rising to the surface of the loch. A decomposing log could not initially release gases caused by decay because of its high resin level. Gas pressure would eventually rupture a resin seal at one end of the log, propelling it through the water (sometimes to the surface). According to Burton, the shape of tree logs (with their branch stumps) closely resembles descriptions of the monster.\n\nSeiches and wakes\n\nLoch Ness, because of its long, straight shape, is subject to unusual ripples affecting its surface. A seiche is a large oscillation of a lake, caused by water reverting to its natural level after being blown to one end of the lake (resulting in a standing wave); the Loch Ness oscillation period is 31.5 minutes.\n\nOptical effects\n\nWind conditions can give a choppy, matte appearance to the water with calm patches appearing dark from the shore (reflecting the mountains). In 1979 W. H. Lehn showed that atmospheric refraction could distort the shape and size of objects and animals,W. H. Lehn (1979) Science vol 205. No. 4402 pages 183–185 \"Atmospheric Refraction and Lake Monsters\" and later published a photograph of a mirage of a rock on Lake Winnipeg which resembled a head and neck.\n\nSeismic gas\n\nItalian geologist Luigi Piccardi has proposed geological explanations for ancient legends and myths. Piccardi noted that in the earliest recorded sighting of a creature (the Life of Saint Columba), the creature's emergence was accompanied \"cum ingenti fremitu\" (\"with loud roaring\"). The Loch Ness is along the Great Glen Fault, and this could be a description of an earthquake. Many reports consist only of a large disturbance on the surface of the water; this could be a release of gas through the fault, although it may be mistaken for something swimming below the surface.\n\nAccording to Ronald Binns, there is probably no one explanation of the monster. A wide range of natural phenomena have been hypothesised, including otters, swimming deer, and unusual waves. Binns wrote that an aspect of human psychology is the ability of the eye to see what it wants, and expects, to see.\n\nFolklore\n\nIn 1980 Swedish naturalist and author Bengt Sjögren wrote that present beliefs in lake monsters such as the Loch Ness Monster are associated with kelpie legends. According to Sjögren, accounts of loch monsters have changed over time; originally describing horse-like creatures, they were intended to keep children away from the loch. Sjögren wrote that the kelpie legends have developed into descriptions reflecting a modern awareness of plesiosaurs.\n\nThe kelpie as a water horse in Loch Ness was mentioned in an 1879 Scottish newspaper,Aberdeen Weekly Journal, Wednesday, 11 June 1879 \"This kelpie had been in the habit of appearing as a beautiful black horse... No sooner had the weary unsuspecting victim seated himself in the saddle than away darted the horse with more than the speed of the hurricane and plunged into the deepest part of Loch Ness, and the rider was never seen again.\" and inspired Tim Dinsdale's Project Water Horse.Tim Dinsdale (1975) Project Water Horse. The true story of the monster quest at Loch Ness (Routledge & Kegan Paul)  A study of pre-1933 Highland folklore references to kelpies, water horses and water bulls indicated that Ness was the loch most frequently cited.Watson, Roland,The Water Horses of Loch Ness (2011) \n\nHoaxes\n\nA number of hoax attempts have been made, some of which were successful. Other hoaxes were revealed rather quickly by the perpetrators or exposed after diligent research. A few examples follow.\n\nIn August 1933, Italian journalist Francesco Gasparini submitted what he said was the first news article on the Loch Ness Monster. In 1959, he reported sighting a \"strange fish\" and fabricated eyewitness accounts: \"I had the inspiration to get hold of the item about the strange fish. The idea of the monster had never dawned on me, but then I noted that the strange fish would not yield a long article, and I decided to promote the imaginary being to the rank of monster without further ado.\"\n\nIn the 1930s, big-game hunter Marmaduke Wetherell went to Loch Ness to look for the monster. Wetherell claimed to have found footprints, but when casts of the footprints were sent to scientists for analysis they turned out to be from a hippopotamus; a prankster had used a hippopotamus-foot umbrella stand.\n\nIn 1972 a team of zoologists from Yorkshire's Flamingo Park Zoo, searching for the monster, discovered a large body floating in the water. The corpse,  long and weighing as much as 1.5 tonnes, was described by the Press Association as having \"a bear's head and a brown scaly body with clawlike fins.\" The creature was placed in a van to be carried away for testing, but police seized the cadaver under an act of parliament prohibiting the removal of \"unidentified creatures\" from Loch Ness. It was later revealed that Flamingo Park education officer John Shields shaved the whiskers and otherwise disfigured a bull elephant seal which had died the week before and dumped it in Loch Ness to dupe his colleagues. On 2 July 2003, Gerald McSorely discovered a fossil, supposedly from the creature, when he tripped and fell into the loch. After examination, it was clear that the fossil had been planted.\n\nIn 2004 a Five TV documentary team, using cinematic special-effects experts, tried to convince people that there was something in the loch. They constructed an animatronic model of a plesiosaur, calling it \"Lucy\". Despite setbacks (including Lucy falling to the bottom of the loch), about 600 sightings were reported where she was placed.\n\nIn 2005, two students claimed to have found a large tooth embedded in the body of a deer on the loch shore. They publicised the find, setting up a website, but expert analysis soon revealed that the \"tooth\" was the antler of a muntjac. The tooth was a publicity stunt to promote a horror novel by Steve Alten, The Loch.\n\nExotic large-animal species\n\nPlesiosaur\n\nIn 1933 it was suggested that the creature \"bears a striking resemblance to the supposedly extinct plesiosaur\",R. J. Binns (1983) The Loch Ness Mystery Solved, page 22 a long-necked aquatic reptile which became extinct during the Cretaceous–Paleogene extinction event. A popular explanation at the time, the following arguments have been made against it:\n* Plesiosaurs were probably cold-blooded reptiles needing warm tropical waters; the average temperature of Loch Ness is only about .Rick Emmer, Loch Ness Monster: Fact or Fiction?, page 62 (Infobase Publishing, 2010).  If the plesiosaurs were warm-blooded, they would require a food supply beyond that supplied by Loch Ness.\n* In an October 2006 New Scientist article, \"Why the Loch Ness Monster is no plesiosaur\", Leslie Noè of the Sedgwick Museum in Cambridge said: \"The osteology of the neck makes it absolutely certain that the plesiosaur could not lift its head up swan-like out of the water\".\n* The loch is only about 10,000 years old, dating to the end of the last ice age. Before then, it was frozen for about 20,000 years.\n* If creatures similar to plesiosaurs lived in Loch Ness they would be seen frequently, since they would have to surface several times a day to breathe.\n\nIn response to these criticisms, Tim Dinsdale, Peter Scott and Roy Mackal postulate a trapped marine creature which evolved from a plesiosaur directly or by convergent evolution.Roy P. Mackal (1976) The Monsters of Loch Ness, page 138 Robert Rines explained that the \"horns\" in some sightings as breathing tubes (or nostrils), allowing it to breathe without breaking the surface.\n\nLong-necked giant amphibian\n\nR. T. Gould suggested a long-necked newt;The Times 9 December 1933, page 14 Roy Mackal examined the possibility, giving it the highest score (88 percent) on his list of possible candidates.R. P. Mackal (1976) The Monsters of Loch Ness, pages 138–9, 211–213\n\nInvertebrate\n\nIn 1968 F. W. (Ted) Holiday proposed that Nessie and other lake monsters, such as Morag, may be a large invertebrate such as a bristleworm; he cited the extinct Tullimonstrum as an example of the shape.Holiday, F.T. The Great Orm of Loch Ness (Faber and Faber 1968) According to Holiday, this explains the land sightings and the variable back shape; he likened it to the medieval description of dragons as \"worms\". Although this theory was considered by Mackal, he found it less convincing than eels, amphibians or plesiosaurs.R. P. Mackal (1976) The Monsters of Loch Ness pages 141–142, chapter XIV\n\nSee also\n\n* Bear Lake monster\n* Beithir\n* Bunyip\n* Chessie (sea monster)\n* Gaasyendietha\n* Jiaolong\n* Lake Tianchi Monster\n* Lake Van Monster\n* Lariosauro\n* Leviathan\n* List of reported lake monsters\n* List of topics characterised as pseudoscience\n* Living dinosaurs\n* Loch Ness Monster in popular culture\n* Manipogo\n* Memphre\n* Mokele-mbembe\n* Nahuel Huapi Lake Monster\n* Sea monster\n* Selma (lake monster)\n* Stronsay Beast\n* Wani (dragon)\n\nFootnotes\n\n;Notes\n\n;References\n\nBibliography\n\n* Bauer, Henry H. The Enigma of Loch Ness: Making Sense of a Mystery, Chicago, University of Illinois Press, 1986\n* Binns, Ronald, The Loch Ness Mystery Solved, Great Britain, Open Books, 1983,  and Star Books, 1984, \n* Burton, Maurice, The Elusive Monster: An Analysis of the Evidence from Loch Ness, London, Rupert Hart-Davis, 1961\n* Campbell, Steuart. The Loch Ness Monster – The Evidence, Buffalo, New York, Prometheus Books, 1985.\n* Dinsdale, Tim, Loch Ness Monster, London, Routledge & Kegan Paul, 1961, SBN 7100 1279 9\n* Harrison, Paul The encyclopaedia of the Loch Ness Monster, London, Robert Hale, 1999\n* Gould, R. T., The Loch Ness Monster and Others, London, Geoffrey Bles, 1934 and paperback, Lyle Stuart, 1976, \n* Holiday, F. W., The Great Orm of Loch Ness, London, Faber & Faber, 1968, SBN 571 08473 7\n* Mackal, Roy P., The Monsters of Loch Ness, London, Futura, 1976, \n* Whyte, Constance, More Than a Legend: The Story of the Loch Ness Monster, London, Hamish Hamilton, 1957\n\nDocumentary\n\n* Secrets of Loch Ness. Produced & Directed by Christopher Jeans (ITN/Channel 4/A&E Network, 1995). Loch Ness Monster. http://en.wikipedia.org/?curid=17877."
  }
}
