{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9454",
  "eid" : "ef110840-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778480836,
  "textBody" : "An establishing shot in filmmaking and television production sets up, or establishes the context for a scene by showing the relationship between its important figures and objects. It is generally a long or extreme-long shot at the beginning of a scene indicating where, and sometimes when, the remainder of the scene takes place.\n\nEstablishing shots were more common during the classical era of filmmaking than they are now. Today's filmmakers tend to skip the establishing shot in order to move the scene along more quickly. In addition, the expositional nature of the shot (as described above) may be unsuitable to scenes in mysteries, where details are intentionally obscured or left out.\n\nUse of establishing shots\n\n;Location: Establishing shots may use famous landmarks to indicate the city where the action is taking place or has moved to, such as the Brandenburg Gate to identify Berlin, Empire State Building or the Statue of Liberty to identify New York City, the London Eye or Big Ben to identify London, the Sydney Opera House or the Harbour Bridge to identify Sydney, the Hollywood Sign to indicate Los Angeles, the Eiffel Tower and/or the Arc de Triomphe to identify Paris, the Shibuya Scramble Crossing to identify Tokyo, or the Las Vegas Strip to identify Las Vegas.\n\n;Time of day: Sometimes the viewer is guided in their understanding of the action. For example, an exterior shot of a building at night followed by an interior shot of people talking implies that the conversation is taking place at night inside that building - the conversation may in fact have been filmed on a studio set far from the apparent location, because of budget, permits, time limitations or convenience.\n\n;Relationship: An establishing shot might be a long shot of a room that shows all the characters from a particular scene. For example, a scene about a murder in a college lecture hall might begin with a shot that shows the entire room, including the lecturing professor and the students taking notes. A close-up shot can also be used at the beginning of a scene to establish the setting (such as, for the lecture hall scene, a shot of a pencil writing notes).\n\n;Concept: An establishing shot may also establish a concept, rather than a location. For example, opening with a martial arts drill visually establishes the theme of martial arts. A shot of rain falling could be an establishing shot, followed by more and more detailed look at the rain, culminating with individual raindrops falling. A film maker is colluding with their audience to provide a shorthand learned through a common cinematic cultural background.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Establishing shot" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9454" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "An establishing shot in filmmaking and television production sets up, or establishes the context for a scene by showing the relationship between its important figures and objects. It is generally a long or extreme-long shot at the beginning of a scene indicating where, and sometimes when, the remainder of the scene takes place.\n\nEstablishing shots were more common during the classical era of filmmaking than they are now. Today's filmmakers tend to skip the establishing shot in order to move the scene along more quickly. In addition, the expositional nature of the shot (as described above) may be unsuitable to scenes in mysteries, where details are intentionally obscured or left out.\n\nUse of establishing shots\n\n;Location: Establishing shots may use famous landmarks to indicate the city where the action is taking place or has moved to, such as the Brandenburg Gate to identify Berlin, Empire State Building or the Statue of Liberty to identify New York City, the London Eye or Big Ben to identify London, the Sydney Opera House or the Harbour Bridge to identify Sydney, the Hollywood Sign to indicate Los Angeles, the Eiffel Tower and/or the Arc de Triomphe to identify Paris, the Shibuya Scramble Crossing to identify Tokyo, or the Las Vegas Strip to identify Las Vegas.\n\n;Time of day: Sometimes the viewer is guided in their understanding of the action. For example, an exterior shot of a building at night followed by an interior shot of people talking implies that the conversation is taking place at night inside that building - the conversation may in fact have been filmed on a studio set far from the apparent location, because of budget, permits, time limitations or convenience.\n\n;Relationship: An establishing shot might be a long shot of a room that shows all the characters from a particular scene. For example, a scene about a murder in a college lecture hall might begin with a shot that shows the entire room, including the lecturing professor and the students taking notes. A close-up shot can also be used at the beginning of a scene to establish the setting (such as, for the lecture hall scene, a shot of a pencil writing notes).\n\n;Concept: An establishing shot may also establish a concept, rather than a location. For example, opening with a martial arts drill visually establishes the theme of martial arts. A shot of rain falling could be an establishing shot, followed by more and more detailed look at the rain, culminating with individual raindrops falling. A film maker is colluding with their audience to provide a shorthand learned through a common cinematic cultural background. Establishing shot. http://en.wikipedia.org/?curid=9454."
  }
}
