{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13031",
  "eid" : "062a6c60-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778519590,
  "textBody" : "The -gry puzzle is a popular word puzzle that asks for the third English word that ends with the letters -gry other than angry and hungry. Specific wording varies substantially, but the puzzle has no clear answer, as there are no other common English words that end in -gry.(Uncommon such words include aggry and puggry.) Both Webster's Third New International Dictionary of the English Language, Unabridged (Merriam-Webster, Inc., 2002, ) and the Oxford English Dictionary, Second Edition (Oxford University Press, 1989, ) contain the compound word \"aggry bead.\" To find a third word ending in -gry that is not part of a phrase, you must turn to archaic, obsolete, or uncommon words, or personal or place names.Collins English Dictionary contains aggry as a standalone word. The only -gry words playable in Scrabble are aggry, ahungry, angry, hungry and puggry.  Interpretations of the puzzle suggest it is either an answerless hoax; a trick question; a sincere question asking for an obscure word; or a corruption of more straightforward puzzle, which may have asked for words containing -gry (such as gryphon). Of these, countless trick question variants and obscure English words (or nonce words) have been proposed. The lack of a conclusive answer has ensured the enduring popularity of the puzzle, and it has become one of the most frequently asked word puzzles.\n\nThe ultimate origin and original form of the puzzle is unknown, but it was popularized in 1975, starting in the New York area, and has remained popular into the 21st century. Various similar puzzles exist, though these have straightforward answers. The most notable is \"words ending in -dous\", which has been popular since the 1880s.\n\nAnswers\n\nVarious proposed answers exist, stating that the question is one of the following:\n* A hoax – there is no answer, and its purpose (or effect) is to frustrate., reprinted in \n* A trick question, with various answers depending on precise wording.\n* A sincere question asking for an obscure word, most often proposed as , , or \n* A corruption of a more straightforward word puzzle, namely a word containing the sequence \"gry\", though not necessarily at the (tail) end, in which case the answer is  which is uncommon but in use.[http://www.facstaff.bucknell.edu/rbeard/gry.html The Third English Word Ending on \"gry\"], quotes a Rush Elkins who heard it in 1969 or 1970 at the University of Florida, in which case appearing anywhere in the word was ok, and later realized that it was gryphon.rec.puzzles, [https://groups.google.com/forum/#!topic/rec.puzzles/a7tX-zTO_yw gry words], October 1, 1995\n\nThis topic is a source of lively interest, both to lovers of word puzzles and lovers of words. Intriguingly, there are members of the latter group who have little or no interest in the puzzle, per se; the challenge is in the list (of words). For both groups, much of the appeal lies in the quest, either to trace the origin of the puzzle or compile a complete list of words ending in -gry.\n\nMore recently, the word hangry—a portmanteau of 'hungry' and 'angry'—has been used to refer to an irritable state induced by lack of food.  Oxford Dictionaries (controlled by but more lax than the Oxford English Dictionary) added hangry on 27 August 2015.http://blog.oxforddictionaries.com/press-releases/oxforddictionaries-com-quarterly-update-new-words-added-today-include-hangry-grexit-and-wine-oclock/http://time.com/4010748/oxford-dictionary-update-2015/http://www.chicagotribune.com/dining/hangry-wine-o-clock-new-food-words-oxford-dictionary-story.html\n\nHistory\n\nThere are anecdotal reports of various forms of the puzzle dating to the 1950s or earlier; the ultimate origin is presumably an oral tradition or a lost book of puzzles.\n\"[http://www.worldwidewords.org/articles/gry.htm I Spy Gry!]\", World Wide Words, Michael Quinion, page created 26 Oct. 1996, sast updated: 19 May 2001 However, the first documented evidence is from early 1975 in the New York metropolitan area, and the puzzle rapidly gained popularity in this year. The most likely source is the talk show of Bob Grant, from some program in early or mid March 1975.\n\nMerriam-Webster, publishers of the leading American dictionaries, first heard of this puzzle in a letter dated March 17, 1975, from Patricia Lasker of Brooklyn, New York. Lasker says her plant manager heard the question on an unnamed quiz show. Since that time Merriam-Webster has received about four letters each year asking the question.\n\nThe puzzle first appears in print in Anita Richterman's \"Problem Line\" column in Newsday on April 29, 1975. One \"M.Z.\" from Wantagh, New York states that the problem was asked on a TV quiz program. Richterman states that she asked a learned professor of English for help when she first received the inquiry, and he did not respond for over a month. This agrees with the Merriam-Webster report, suggesting a quiz show in early or mid March 1975.\n\nIn Anita Richterman's column on May 9, 1975, several correspondents reported that they had heard the puzzle on the Bob Grant radio talk show on WMCA in New York City. This suggests either that the earlier claims of a (TV) quiz show confused a talk show with a quiz show, or that there was another unspecified quiz show that was then repeated by Grant. The majority of readers gave the answer \"gry,\" an obsolete unit of measure invented by John Locke. It is unclear whether this was the answer given on the Grant show, or what the precise wording had been.\n\nBy fall 1975 the puzzle had reached the Delaware Valley, again apparently by radio, by which time the puzzle seems to have mutated to a form in which the missing word is an adjective that describes the state of the world.\n\nThe puzzle has had occasional bouts of popularity: after its initial popularity in 1975, it was popular in 1978, then again in 1995–1996.Stumpers-L, Good Gry-f!  How many words end in -gry?, by Glenn Kersten, December 1999: \"Fortunately, the popularity of the -gry puzzle has lessened since the boom era of 1995-1996, but SLS Reference Service still receives the question from time to time. Since the same question was a fad in 1978 (see our articles in the November and December 1978 issues of Points of Reference), it looks as though reference librarians should prepare for a 17-year cycle. Hmmm, remind you of anything? The next plague should hit reference desks in the year 2012.\"\n\nReports of earlier versions\n\nThe most credible report of an early version was given on Stumpers-L,Stumpers-L, Good Gry-f!  How many words end in -gry?, by Glenn Kersten, December 1999 which reported a trick question formulation from an eight-page pamphlet entitled Things to Think About, probably dating to the 1940s:\n\nAlternative versions \n\nTrick versions\n\n#This version only works when spoken: There are three words in English that end in \"gree.\" The first two are \"angry\" and \"hungry\", and if you've listened closely, you'll agree that I've already told you the third one.\n#*The answer is \"agree\".\n#There are three words in the English language that end with the letters 'g', 'r', and 'y'. Two are \"hungry\" and \"angry\". The third word is something everyone uses every day. Everyone knows what the third word means. What is the third word?\n#*The answer is \"energy\". The riddle says that the word ends in the letters g-r-y; it says nothing about the order of the letters. Many words end with \"-rgy\", but energy is something everyone uses every day.\n#Here is another spoken version: There are at least three words in the English language that end in \"g\" or \"y\". One of them is \"hungry\", and another one is \"angry\". There is a third word, a short one, which you probably say every day. If you are listening carefully to everything I say, you just heard me say it three times. What is it?\n\n#*The answer is \"say\". This version depends upon the listener confusing the spoken word \"or\" and the spoken letter \"r\".\n#There are three words in the English language that end in \"gry\". Two words that end in \"gry\" are \"hungry\" and \"angry\". Everyone knows what the third word means, and everyone uses them every day. If you listened very carefully, I have already stated to you what the third word is. The three words that solve this riddle are...?\n#*The answer is the three-word sentence \"I am hungry\". This version asks for three words that end in \"gry\", not three words each of which ends in \"gry\".\n#This version is a play on the use-mention ambiguity exploited by other versions: I know two words that end in \"gry\". Neither one is angry or hungry. What are they?\n\n#*The answer is \"angry\" and \"hungry\". Since these are words, they are not capable of being angry or hungry.\n#Here is a version invented by Frank Rubin on December 4, 2003: Give me three English words, commonly spoken, ending in g-r-y.\n#*There are many possible answers, such as \"Beg for mercy\", or \"Bring your money\".\n#This version also uses the use-mention ambiguity: There are three words in the English language that end g-r-y. One is angry and another is hungry. The third word is something that \"everyone\" uses. If you have listened carefully, I have already told you what it is.\n#*The answer is \"every\". First word is \"fuming\" which ends with \"g\". The word \"fuming\" is angry (when personified). Second word is \"eager\" which ends with \"r\". The word \"eager\" is hungry (when personified). Third word is \"every\" which ends with \"y\". The word \"everyone\" uses the word \"every\".\n\nMeta-puzzle versions\n\nThe remaining versions are a form of meta-puzzle, in the sense that they make no use of the actual letters \"gry\" themselves, which therefore are a red herring. The red herring only works because there is another puzzle that does use these letters (even though that puzzle has no good answer).\n\n#This version only works when spoken. Think of words ending in -gry (g-r-y). \"Angry\" and \"Hungry\" are two of them. There are only three words in \"the English language\". What is the third word? Hint: The word is something that everyone uses every day. If you have listened carefully, I have already told you what it is.\n\n#*The answer is \"language\", and the logic is as follows: There are only three words in \"the English language\"; the third word is \"language\". Since this version requires quotation marks around the phrase, \"the English language\", the written version gives away the trick.\n#Angry and hungry are two words in the English language that end in \"gry\". \"What\" is the third word. The word is something that everyone uses every day. If you have listened carefully, I have already told you what it is.\n#*The answer is \"what\". But again, the quotation marks spoil the puzzle when it is printed.\n#There are three words in the English language that end with \"gry\". Two of these are \"angry\" and \"hungry\". The third word is a very common word, and you use it often. If you have read what I have told you, you will see that I have given you the third word. What is the third word? Think very carefully.\n\n#*The answer is \"three\", the third word in the paragraph. The rest of the paragraph is a red herring.\n#There are three words in the English language that end in \"gry\". The first \"one\" is \"hungry\", the second \"one\" is \"angry\", what is the third \"one\"? If you have read this carefully I have given a clue.\n\n#*The answer is the word \"one\", which is the third \"one\". Again the quotation marks ruin the written puzzle, so this version is usually written without the quotation marks and with the word \"one\" capitalized.\n\nSimilar puzzles\n\nThere are numerous similar puzzles, giving letter sequences that rarely occur in words.The Word Circus: A Letter-perfect Book, by Richard Lederer, Dave Morice, 1998, [https://books.google.com/books?id\nwHlHFp9zG1wC&pgPA259 p. 259] The most-notable of these is the -dous puzzle of finding words ending in -dous, which was popular in the 1880s. This took various forms, sometimes simply listing all words or all common words,The Brooklyn Magazine, Volumes II, Number 2, 1885, May, [https://books.google.com/books?id9KbQAAAAMAAJ&pg\nRA2-PA85&dqdous+tremendous+stupendous+hazardous+horrendous+jeopardous p. 85] sometimes being posed as a riddle, giving the three common words, tremendous, stupendous, and hazardous, and requesting the rarer fourth, which is jeopardous. This form originated in 1883, with an A.A. of Glasgow writing to George Augustus Henry Sala in his \"Echoes of the Week\" column in the Illustrated London News.Collected in Echoes of the year Eighteen Hundred and Eighty-Three, [https://books.google.com/books?id\nx6YIAAAAQAAJ&pgPA337&dq\ndous+tremendous+stupendous p. 337]See credit of Sala in Tidbits, 1884 February 2, [https://books.google.com/books?idsj85AQAAMAAJ&pg\nPA246&dqdous+tremendous+stupendous p. 246]; reprint: [https://books.google.com/books?id\nvPgIAAAAQAAJ&pgPA327&dq\ndous+hazardous+tremendous p. 327]\nThis question has had enduring popularity,Graphite, 1909 March, \"'Dous' Sequel\", [https://books.google.com/books?idsZzmAAAAMAAJ&pg\nPA1976&dqtremendous+stupendous+dous p. 1076] even inspiring a contest,The Spatula, Volume 2, 1895, [https://books.google.com/books?idnxVOAAAAMAAJ&pg\nPA360&dqdous+tremendous+stupendous p. 360] though the words have proven less stable: today jeopardous is considered too rare, and the formerly unpopular horrendous has taken its place; this change occurred as early as 1909.Editor and Publisher, Volume 9, 1909, [https://books.google.com/books?id7yVDAQAAMAAJ&pg\nPA18-IA89&dqtremendous+stupendous+hazardous+dous p. 89] At times other words such as hybridous have been accepted. Today hazardous is typically the omitted word, and differs from the others in being a visible compound hazard + -ous. This puzzle has continued in popularity through the end of the 20th century,The Game of Words, Willard Epsy, 1971 with recent versions giving it as an alternative to the gry puzzle.The Word Circus: A Letter-perfect Book, by Richard Lederer, Dave Morice, 1998, [https://books.google.com/books?idwHlHFp9zG1wC&pg\nPA229 p. 229]\n\nAnother similar one is words ending in -cion, of which the common words are coercion, scion, and suspicion.Notes and Queries, Vol. VI, No. 10, 1889, October, [https://books.google.com/books?id\n0qYXAQAAMAAJ&pgPA365&dq\ncion p. 365]\n\nThe most similar to the gry puzzle in form is to find three words that contain the letter sequence shion, to which the answer is cushion, fashion, and parishioner;  this is typically stated by giving cushion and fashion, and requesting the third word, namely parishioner.Weeds in the Garden of Words: Further Observations on the Tangled History of the English Language, Kate Burridge, 2005, [https://books.google.com/books?id\nIq9R_9AQ19gC&pg=PA82 p. 82], p. 184 This can be modified to finding words ending with -shion, in which case the answer is the obsolete word parishion, which is a synonymous variant of parishioner. This has not been nearly as popular as the gry puzzle.\n\nSolution techniques\n\nThe standard way to solve such puzzles is to use a reverse dictionary, or to perform an exhaustive search through a dictionary, either manually, which is tedious and error-prone, or using computer tools such as grep, which requires an electronic word list. At the origin of the gry puzzle, the standard reverse dictionary in modern English was the \"Air Force Reverse Dictionary\" (formally the Normal and Reverse Word List, compiled under the direction of A. F. Brown), which did not have additional answers for gry. The most plausible answer at the time was meagry, found in the Oxford English Dictionary. A more elaborate strategy is to list words that have endings similar to gry, such as -gary, and then search a larger dictionary for obsolete variants ending in -gry, for example begry for beggary.\n\nFrom around 1980 electronic word lists became widely available on Unix systems, and searching for answers to the gry puzzle was an occasional benchmark; this also turned up gryphon in some cases, if match is not required to be at the end.USENIX Association, Software Tools User Group, Summer Conference Proceedings, Volume 2, 1983, [https://books.google.com/books?ei\n5vsyVfOxHsGaNq7hgJgJ&id47BQAAAAMAAJ&dq\ngry p. 343]: One test was to find words containing the letter sequence \"gry.\" The \"grep gry /usr/dict/words\" ran significantly faster on the Concept than on the VAX (the words found were angry, hungry, and gryphon). This is now easily done in milliseconds on modern personal computers:\n\ngrep gry$ /usr/share/dict/words  # Search for words ending in gry\ngrep gry /usr/share/dict/words  # Search for words containing gry",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "-gry puzzle" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13031" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The -gry puzzle is a popular word puzzle that asks for the third English word that ends with the letters -gry other than angry and hungry. Specific wording varies substantially, but the puzzle has no clear answer, as there are no other common English words that end in -gry.(Uncommon such words include aggry and puggry.) Both Webster's Third New International Dictionary of the English Language, Unabridged (Merriam-Webster, Inc., 2002, ) and the Oxford English Dictionary, Second Edition (Oxford University Press, 1989, ) contain the compound word \"aggry bead.\" To find a third word ending in -gry that is not part of a phrase, you must turn to archaic, obsolete, or uncommon words, or personal or place names.Collins English Dictionary contains aggry as a standalone word. The only -gry words playable in Scrabble are aggry, ahungry, angry, hungry and puggry.  Interpretations of the puzzle suggest it is either an answerless hoax; a trick question; a sincere question asking for an obscure word; or a corruption of more straightforward puzzle, which may have asked for words containing -gry (such as gryphon). Of these, countless trick question variants and obscure English words (or nonce words) have been proposed. The lack of a conclusive answer has ensured the enduring popularity of the puzzle, and it has become one of the most frequently asked word puzzles.\n\nThe ultimate origin and original form of the puzzle is unknown, but it was popularized in 1975, starting in the New York area, and has remained popular into the 21st century. Various similar puzzles exist, though these have straightforward answers. The most notable is \"words ending in -dous\", which has been popular since the 1880s.\n\nAnswers\n\nVarious proposed answers exist, stating that the question is one of the following:\n* A hoax – there is no answer, and its purpose (or effect) is to frustrate., reprinted in \n* A trick question, with various answers depending on precise wording.\n* A sincere question asking for an obscure word, most often proposed as , , or \n* A corruption of a more straightforward word puzzle, namely a word containing the sequence \"gry\", though not necessarily at the (tail) end, in which case the answer is  which is uncommon but in use.[http://www.facstaff.bucknell.edu/rbeard/gry.html The Third English Word Ending on \"gry\"], quotes a Rush Elkins who heard it in 1969 or 1970 at the University of Florida, in which case appearing anywhere in the word was ok, and later realized that it was gryphon.rec.puzzles, [https://groups.google.com/forum/#!topic/rec.puzzles/a7tX-zTO_yw gry words], October 1, 1995\n\nThis topic is a source of lively interest, both to lovers of word puzzles and lovers of words. Intriguingly, there are members of the latter group who have little or no interest in the puzzle, per se; the challenge is in the list (of words). For both groups, much of the appeal lies in the quest, either to trace the origin of the puzzle or compile a complete list of words ending in -gry.\n\nMore recently, the word hangry—a portmanteau of 'hungry' and 'angry'—has been used to refer to an irritable state induced by lack of food.  Oxford Dictionaries (controlled by but more lax than the Oxford English Dictionary) added hangry on 27 August 2015.http://blog.oxforddictionaries.com/press-releases/oxforddictionaries-com-quarterly-update-new-words-added-today-include-hangry-grexit-and-wine-oclock/http://time.com/4010748/oxford-dictionary-update-2015/http://www.chicagotribune.com/dining/hangry-wine-o-clock-new-food-words-oxford-dictionary-story.html\n\nHistory\n\nThere are anecdotal reports of various forms of the puzzle dating to the 1950s or earlier; the ultimate origin is presumably an oral tradition or a lost book of puzzles.\n\"[http://www.worldwidewords.org/articles/gry.htm I Spy Gry!]\", World Wide Words, Michael Quinion, page created 26 Oct. 1996, sast updated: 19 May 2001 However, the first documented evidence is from early 1975 in the New York metropolitan area, and the puzzle rapidly gained popularity in this year. The most likely source is the talk show of Bob Grant, from some program in early or mid March 1975.\n\nMerriam-Webster, publishers of the leading American dictionaries, first heard of this puzzle in a letter dated March 17, 1975, from Patricia Lasker of Brooklyn, New York. Lasker says her plant manager heard the question on an unnamed quiz show. Since that time Merriam-Webster has received about four letters each year asking the question.\n\nThe puzzle first appears in print in Anita Richterman's \"Problem Line\" column in Newsday on April 29, 1975. One \"M.Z.\" from Wantagh, New York states that the problem was asked on a TV quiz program. Richterman states that she asked a learned professor of English for help when she first received the inquiry, and he did not respond for over a month. This agrees with the Merriam-Webster report, suggesting a quiz show in early or mid March 1975.\n\nIn Anita Richterman's column on May 9, 1975, several correspondents reported that they had heard the puzzle on the Bob Grant radio talk show on WMCA in New York City. This suggests either that the earlier claims of a (TV) quiz show confused a talk show with a quiz show, or that there was another unspecified quiz show that was then repeated by Grant. The majority of readers gave the answer \"gry,\" an obsolete unit of measure invented by John Locke. It is unclear whether this was the answer given on the Grant show, or what the precise wording had been.\n\nBy fall 1975 the puzzle had reached the Delaware Valley, again apparently by radio, by which time the puzzle seems to have mutated to a form in which the missing word is an adjective that describes the state of the world.\n\nThe puzzle has had occasional bouts of popularity: after its initial popularity in 1975, it was popular in 1978, then again in 1995–1996.Stumpers-L, Good Gry-f!  How many words end in -gry?, by Glenn Kersten, December 1999: \"Fortunately, the popularity of the -gry puzzle has lessened since the boom era of 1995-1996, but SLS Reference Service still receives the question from time to time. Since the same question was a fad in 1978 (see our articles in the November and December 1978 issues of Points of Reference), it looks as though reference librarians should prepare for a 17-year cycle. Hmmm, remind you of anything? The next plague should hit reference desks in the year 2012.\"\n\nReports of earlier versions\n\nThe most credible report of an early version was given on Stumpers-L,Stumpers-L, Good Gry-f!  How many words end in -gry?, by Glenn Kersten, December 1999 which reported a trick question formulation from an eight-page pamphlet entitled Things to Think About, probably dating to the 1940s:\n\nAlternative versions \n\nTrick versions\n\n#This version only works when spoken: There are three words in English that end in \"gree.\" The first two are \"angry\" and \"hungry\", and if you've listened closely, you'll agree that I've already told you the third one.\n#*The answer is \"agree\".\n#There are three words in the English language that end with the letters 'g', 'r', and 'y'. Two are \"hungry\" and \"angry\". The third word is something everyone uses every day. Everyone knows what the third word means. What is the third word?\n#*The answer is \"energy\". The riddle says that the word ends in the letters g-r-y; it says nothing about the order of the letters. Many words end with \"-rgy\", but energy is something everyone uses every day.\n#Here is another spoken version: There are at least three words in the English language that end in \"g\" or \"y\". One of them is \"hungry\", and another one is \"angry\". There is a third word, a short one, which you probably say every day. If you are listening carefully to everything I say, you just heard me say it three times. What is it?\n\n#*The answer is \"say\". This version depends upon the listener confusing the spoken word \"or\" and the spoken letter \"r\".\n#There are three words in the English language that end in \"gry\". Two words that end in \"gry\" are \"hungry\" and \"angry\". Everyone knows what the third word means, and everyone uses them every day. If you listened very carefully, I have already stated to you what the third word is. The three words that solve this riddle are...?\n#*The answer is the three-word sentence \"I am hungry\". This version asks for three words that end in \"gry\", not three words each of which ends in \"gry\".\n#This version is a play on the use-mention ambiguity exploited by other versions: I know two words that end in \"gry\". Neither one is angry or hungry. What are they?\n\n#*The answer is \"angry\" and \"hungry\". Since these are words, they are not capable of being angry or hungry.\n#Here is a version invented by Frank Rubin on December 4, 2003: Give me three English words, commonly spoken, ending in g-r-y.\n#*There are many possible answers, such as \"Beg for mercy\", or \"Bring your money\".\n#This version also uses the use-mention ambiguity: There are three words in the English language that end g-r-y. One is angry and another is hungry. The third word is something that \"everyone\" uses. If you have listened carefully, I have already told you what it is.\n#*The answer is \"every\". First word is \"fuming\" which ends with \"g\". The word \"fuming\" is angry (when personified). Second word is \"eager\" which ends with \"r\". The word \"eager\" is hungry (when personified). Third word is \"every\" which ends with \"y\". The word \"everyone\" uses the word \"every\".\n\nMeta-puzzle versions\n\nThe remaining versions are a form of meta-puzzle, in the sense that they make no use of the actual letters \"gry\" themselves, which therefore are a red herring. The red herring only works because there is another puzzle that does use these letters (even though that puzzle has no good answer).\n\n#This version only works when spoken. Think of words ending in -gry (g-r-y). \"Angry\" and \"Hungry\" are two of them. There are only three words in \"the English language\". What is the third word? Hint: The word is something that everyone uses every day. If you have listened carefully, I have already told you what it is.\n\n#*The answer is \"language\", and the logic is as follows: There are only three words in \"the English language\"; the third word is \"language\". Since this version requires quotation marks around the phrase, \"the English language\", the written version gives away the trick.\n#Angry and hungry are two words in the English language that end in \"gry\". \"What\" is the third word. The word is something that everyone uses every day. If you have listened carefully, I have already told you what it is.\n#*The answer is \"what\". But again, the quotation marks spoil the puzzle when it is printed.\n#There are three words in the English language that end with \"gry\". Two of these are \"angry\" and \"hungry\". The third word is a very common word, and you use it often. If you have read what I have told you, you will see that I have given you the third word. What is the third word? Think very carefully.\n\n#*The answer is \"three\", the third word in the paragraph. The rest of the paragraph is a red herring.\n#There are three words in the English language that end in \"gry\". The first \"one\" is \"hungry\", the second \"one\" is \"angry\", what is the third \"one\"? If you have read this carefully I have given a clue.\n\n#*The answer is the word \"one\", which is the third \"one\". Again the quotation marks ruin the written puzzle, so this version is usually written without the quotation marks and with the word \"one\" capitalized.\n\nSimilar puzzles\n\nThere are numerous similar puzzles, giving letter sequences that rarely occur in words.The Word Circus: A Letter-perfect Book, by Richard Lederer, Dave Morice, 1998, [https://books.google.com/books?id\nwHlHFp9zG1wC&pgPA259 p. 259] The most-notable of these is the -dous puzzle of finding words ending in -dous, which was popular in the 1880s. This took various forms, sometimes simply listing all words or all common words,The Brooklyn Magazine, Volumes II, Number 2, 1885, May, [https://books.google.com/books?id9KbQAAAAMAAJ&pg\nRA2-PA85&dqdous+tremendous+stupendous+hazardous+horrendous+jeopardous p. 85] sometimes being posed as a riddle, giving the three common words, tremendous, stupendous, and hazardous, and requesting the rarer fourth, which is jeopardous. This form originated in 1883, with an A.A. of Glasgow writing to George Augustus Henry Sala in his \"Echoes of the Week\" column in the Illustrated London News.Collected in Echoes of the year Eighteen Hundred and Eighty-Three, [https://books.google.com/books?id\nx6YIAAAAQAAJ&pgPA337&dq\ndous+tremendous+stupendous p. 337]See credit of Sala in Tidbits, 1884 February 2, [https://books.google.com/books?idsj85AQAAMAAJ&pg\nPA246&dqdous+tremendous+stupendous p. 246]; reprint: [https://books.google.com/books?id\nvPgIAAAAQAAJ&pgPA327&dq\ndous+hazardous+tremendous p. 327]\nThis question has had enduring popularity,Graphite, 1909 March, \"'Dous' Sequel\", [https://books.google.com/books?idsZzmAAAAMAAJ&pg\nPA1976&dqtremendous+stupendous+dous p. 1076] even inspiring a contest,The Spatula, Volume 2, 1895, [https://books.google.com/books?idnxVOAAAAMAAJ&pg\nPA360&dqdous+tremendous+stupendous p. 360] though the words have proven less stable: today jeopardous is considered too rare, and the formerly unpopular horrendous has taken its place; this change occurred as early as 1909.Editor and Publisher, Volume 9, 1909, [https://books.google.com/books?id7yVDAQAAMAAJ&pg\nPA18-IA89&dqtremendous+stupendous+hazardous+dous p. 89] At times other words such as hybridous have been accepted. Today hazardous is typically the omitted word, and differs from the others in being a visible compound hazard + -ous. This puzzle has continued in popularity through the end of the 20th century,The Game of Words, Willard Epsy, 1971 with recent versions giving it as an alternative to the gry puzzle.The Word Circus: A Letter-perfect Book, by Richard Lederer, Dave Morice, 1998, [https://books.google.com/books?idwHlHFp9zG1wC&pg\nPA229 p. 229]\n\nAnother similar one is words ending in -cion, of which the common words are coercion, scion, and suspicion.Notes and Queries, Vol. VI, No. 10, 1889, October, [https://books.google.com/books?id\n0qYXAQAAMAAJ&pgPA365&dq\ncion p. 365]\n\nThe most similar to the gry puzzle in form is to find three words that contain the letter sequence shion, to which the answer is cushion, fashion, and parishioner;  this is typically stated by giving cushion and fashion, and requesting the third word, namely parishioner.Weeds in the Garden of Words: Further Observations on the Tangled History of the English Language, Kate Burridge, 2005, [https://books.google.com/books?id\nIq9R_9AQ19gC&pg=PA82 p. 82], p. 184 This can be modified to finding words ending with -shion, in which case the answer is the obsolete word parishion, which is a synonymous variant of parishioner. This has not been nearly as popular as the gry puzzle.\n\nSolution techniques\n\nThe standard way to solve such puzzles is to use a reverse dictionary, or to perform an exhaustive search through a dictionary, either manually, which is tedious and error-prone, or using computer tools such as grep, which requires an electronic word list. At the origin of the gry puzzle, the standard reverse dictionary in modern English was the \"Air Force Reverse Dictionary\" (formally the Normal and Reverse Word List, compiled under the direction of A. F. Brown), which did not have additional answers for gry. The most plausible answer at the time was meagry, found in the Oxford English Dictionary. A more elaborate strategy is to list words that have endings similar to gry, such as -gary, and then search a larger dictionary for obsolete variants ending in -gry, for example begry for beggary.\n\nFrom around 1980 electronic word lists became widely available on Unix systems, and searching for answers to the gry puzzle was an occasional benchmark; this also turned up gryphon in some cases, if match is not required to be at the end.USENIX Association, Software Tools User Group, Summer Conference Proceedings, Volume 2, 1983, [https://books.google.com/books?ei\n5vsyVfOxHsGaNq7hgJgJ&id47BQAAAAMAAJ&dq\ngry p. 343]: One test was to find words containing the letter sequence \"gry.\" The \"grep gry /usr/dict/words\" ran significantly faster on the Concept than on the VAX (the words found were angry, hungry, and gryphon). This is now easily done in milliseconds on modern personal computers:\n\ngrep gry$ /usr/share/dict/words  # Search for words ending in gry\ngrep gry /usr/share/dict/words  # Search for words containing gry. -gry puzzle. http://en.wikipedia.org/?curid=13031."
  }
}
