{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9737",
  "eid" : "f1d95000-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778485504,
  "textBody" : "Eugenics (; from Greek εὐγενής eugenes 'well-born' from εὖ eu, 'good, well' and γένος genos, 'race, stock, kin')  Database includes entries from A Greek–English Lexicon and other English dictionaries of Ancient Greek. is a set of beliefs and practices that aims at improving the genetic quality of a human population.\nThe exact definition of eugenics has been a matter of debate since the term was coined by Francis Galton in 1883.  The concept predates this coinage, with Plato suggesting applying the principles of selective breeding to humans around 400 BCE.\n\nFrederick Osborn's 1937 journal article \"Development of a Eugenic Philosophy\" framed it as a social philosophy—that is, a philosophy with implications for social order.  That definition is not universally accepted.  Osborn advocated for higher rates of sexual reproduction among people with desired traits (positive eugenics), or reduced rates of sexual reproduction and sterilization of people with less-desired or undesired traits (negative eugenics).\n\nAlternatively, gene selection rather than \"people selection\" has recently been made possible through advances in genome editing, leading to what is sometimes called new eugenics, also known as neo-eugenics, consumer eugenics, or liberal eugenics.\n\nWhile eugenic principles have been practiced as far back in world history as ancient Greece, the modern history of eugenics began in the early 20th century when a popular eugenics movement emerged in the United Kingdom and spread to many countries including the United States, Canada and most European countries. In this period, eugenic ideas were espoused across the political spectrum. Consequently, many countries adopted eugenic policies with the intent to improve the quality of their populations' genetic stock. Such programs included both \"positive\" measures, such as encouraging individuals deemed particularly \"fit\" to reproduce, and \"negative\" measures such as marriage prohibitions and forced sterilization of people deemed unfit for reproduction. People deemed unfit to reproduce often included people with mental or physical disabilities, people who scored in the low ranges of different IQ tests, criminals and deviants, and members of disfavored minority groups. The eugenics movement became negatively associated with Nazi Germany and the Holocaust when many of the defendants at the Nuremberg trials attempted to justify their human rights abuses by claiming there was little difference between the Nazi eugenics programs and the U.S. eugenics programs.\nIn the decades following World War II, with the institution of human rights, many countries gradually began to abandon eugenics policies, although some Western countries, among them the United States, continued to carry out forced sterilizations.\n\nSince the 1980s and 1990s, when new assisted reproductive technology procedures became available such as gestational surrogacy (available since 1985), preimplantation genetic diagnosis (available since 1989), and cytoplasmic transfer (first performed in 1996), fear about a possible revival of eugenics and widening of the gap between the rich and the poor has emerged.\n\nA major criticism of eugenics policies is that, regardless of whether \"negative\" or \"positive\" policies are used, they are susceptible to abuse because the criteria of selection are determined by whichever group is in political power at the time. Furthermore, negative eugenics in particular is considered by many to be a violation of basic human rights, which include the right to reproduction. Another criticism is that eugenic policies eventually lead to a loss of genetic diversity, resulting in inbreeding depression due to lower genetic variation.\n\nHistory\n\nOrigin and development\n\nThe concept of positive eugenics to produce better human beings has existed at least since Plato suggested selective mating to produce a guardian class. \n \nThe first formal negative eugenics, that is a legal provision against birth of inferior human beings, was promulgated in Western European culture by the Christian Council of Agde in 506, which forbade marriage between cousins.Giles, Frances (2010) [https://books.google.co.uk/books?id5pXmkCf3LEIC&pg\nPR2-IA10&dqEugenics+506+Agde&hl\nen&saX&ved\n0ahUKEwjX2pys46rYAhUhJsAKHXXKAeMQ6AEIJDAA#vonepage&q\nEugenics%20506%20Agde&f=falseMarriage and the Family in the Middle Ages] New York: Harper Collins. p.ii \n\nThis idea was also promoted by William Goodell (1829–1894) who advocated the castration and spaying of the insane.\n\nThe idea of a modern project of improving the human population through a statistical understanding of heredity used to encourage good breeding was originally developed by Francis Galton and, initially, was closely linked to Darwinism and his theory of natural selection.Bowler, Peter J., Evolution: The History of an Idea, 3rd Ed., University of California Press, 2003, pp. 308–310. Galton had read his half-cousin Charles Darwin's theory of evolution, which sought to explain the development of plant and animal species, and desired to apply it to humans. Based on his biographical studies, Galton believed that desirable human qualities were hereditary traits, though Darwin strongly disagreed with this elaboration of his theory. In 1883, one year after Darwin's death, Galton gave his research a name: eugenics. With the introduction of genetics, eugenics became associated with ideology of genetic determinism in which human character was due to genes, unaffected by education or living conditions. Many of the early geneticists were not Darwinians, and evolution theory was not needed for eugenics policies based on genetic determinism. Throughout its recent history, eugenics has remained controversial.\n\nEugenics became an academic discipline at many colleges and universities and received funding from many sources. Organizations were formed to win public support and sway opinion towards responsible eugenic values in parenthood, including the British Eugenics Education Society of 1907 and the American Eugenics Society of 1921. Both sought support from leading clergymen and modified their message to meet religious ideals. In 1909 the Anglican clergymen William Inge and James Peile both wrote for the British Eugenics Education Society. Inge was an invited speaker at the 1921 International Eugenics Conference, which was also endorsed by the Roman Catholic Archbishop of New York Patrick Joseph Hayes.\n\nThree International Eugenics Conferences presented a global venue for eugenists with meetings in 1912 in London, and in 1921 and 1932 in New York City. Eugenic policies were first implemented in the early 1900s in the United States. It also took root in France, Germany, and Great Britain.  Later, in the 1920s and 1930s, the eugenic policy of sterilizing certain mental patients was implemented in other countries including Belgium, Brazil, Canada, Japan and Sweden.\n\nIn addition to being practiced in a number of countries, eugenics was internationally organized through the International Federation of Eugenics Organizations. Its scientific aspects were carried on through research bodies such as the Kaiser Wilhelm Institute of Anthropology, Human Heredity, and Eugenics, the Cold Spring Harbour Carnegie Institution for Experimental Evolution, and the Eugenics Record Office. Politically, the movement advocated measures such as sterilization laws. In its moral dimension, eugenics rejected the doctrine that all human beings are born equal and redefined moral worth purely in terms of genetic fitness. Its racist elements included pursuit of a pure \"Nordic race\" or \"Aryan\" genetic pool and the eventual elimination of \"unfit\" races.\n\nEarly critics of the philosophy of eugenics included the American sociologist Lester Frank Ward, the English writer G. K. Chesterton, the German-American anthropologist Franz Boas, who argued that advocates of eugenics greatly over-estimate the influence of biology, and Scottish tuberculosis pioneer and author Halliday Sutherland. Ward's 1913 article \"[https://archive.org/details/jstor-2763324 Eugenics, Euthenics, and Eudemics]\", Chesterton's 1917 book Eugenics and Other Evils, and Boas' 1916 article \"Eugenics\" (published in The Scientific Monthly) were all harshly critical of the rapidly growing movement. Sutherland identified eugenists as a major obstacle to the eradication and cure of tuberculosis in his 1917 address \"Consumption: Its Cause and Cure\",\"Consumption: Its Cause and Cure\" An Address by Dr Halliday Sutherland on 4 September 1917, published by the Red Triangle Press. and criticism of eugenists and Neo-Malthusians in his 1921 book Birth Control led to a writ for libel from the eugenist Marie Stopes. Several biologists were also antagonistic to the eugenics movement, including Lancelot Hogben.\"Lancelot Hogben, who developed his critique of eugenics and distaste for racism in the period...he spent as Professor of Zoology at the University of Cape Town\".  Alison Bashford and Philippa Levine, The Oxford Handbook of the History of Eugenics. Oxford; Oxford University Press, 2010  (p.200) Other biologists such as J. B. S. Haldane and R. A. Fisher expressed skepticism in the belief that sterilization of \"defectives\" would lead to the disappearance of undesirable genetic traits.\"Whatever their disagreement on the numbers, Haldane, Fisher, and most geneticists could support Jennings's warning: To encourage the expectation that the sterilization of defectives will \"solve the problem of hereditary defects, close up the asylums for feebleminded and insane, do away with prisons, is only to subject society to deception\". Daniel J. Kevles, In the Name of Eugenics. University of California Press, 1985.  (p. 166).\n\nAmong institutions, the Catholic Church was an opponent of state-enforced sterilizations. Attempts by the Eugenics Education Society to persuade the British government to legalize voluntary sterilization were opposed by Catholics and by the Labour Party. The American Eugenics Society initially gained some Catholic supporters, but Catholic support declined following the 1930 papal encyclical Casti connubii. In this, Pope Pius XI explicitly condemned sterilization laws: \"Public magistrates have no direct power over the bodies of their subjects; therefore, where no crime has taken place and there is no cause present for grave punishment, they can never directly harm, or tamper with the integrity of the body, either for the reasons of eugenics or for any other reason.\"\n\nAs a social movement, eugenics reached its greatest popularity in the early decades of the 20th century, when it was practiced around the world and promoted by governments, institutions, and influential individuals. Many countries enacted various eugenics policies, including: genetic screenings, birth control, promoting differential birth rates, marriage restrictions, segregation (both racial segregation and sequestering the mentally ill), compulsory sterilization, forced abortions or forced pregnancies, ultimately culminating in genocide.\n\nNazism and the decline of eugenics\n\nThe scientific reputation of eugenics started to decline in the 1930s, a time when Ernst Rüdin used eugenics as a justification for the racial policies of Nazi Germany. Adolf Hitler had praised and incorporated eugenic ideas in Mein Kampf in 1925 and emulated eugenic legislation for the sterilization of \"defectives\" that had been pioneered in the United States once he took power. Some common early 20th century eugenics methods involved identifying and classifying individuals and their families, including the poor, mentally ill, blind, deaf, developmentally disabled, promiscuous women, homosexuals, and racial groups (such as the Roma and Jews in Nazi Germany) as \"degenerate\" or \"unfit\", and therefore led to segregation, institutionalization, sterilization, euthanasia, and even mass murder. The Nazi practice of euthanasia was carried out on hospital patients in the Aktion T4 centers such as Hartheim Castle.\n\nBy the end of World War II, many discriminatory eugenics laws were abandoned, having become associated with Nazi Germany.Lynn 2001. p. 18 \"By the middle decades of the twentieth century, eugenics had become widely accepted throughout the whole of the economically developed world, with the exception of the Soviet Union.\" H. G. Wells, who had called for \"the sterilization of failures\" in 1904, stated in his 1940 book The Rights of Man: Or What are we fighting for? that among the human rights, which he believed should be available to all people, was \"a prohibition on mutilation, sterilization, torture, and any bodily punishment\". After World War II, the practice of \"imposing measures intended to prevent births within [a national, ethnical, racial or religious] group\" fell within the definition of the new international crime of genocide, set out in the Convention on the Prevention and Punishment of the Crime of Genocide.Article 2 of the Convention defines genocide as any of the following acts committed with the intent to destroy, in whole or in part, a national, ethnic, racial or religious group, as such as:\n* Killing members of the group;\n* Causing serious bodily or mental harm to members of the group;\n* Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part;\n* Imposing measures intended to prevent births within the group;\n* Forcibly transferring children of the group to another group.\nSee the Convention on the Prevention and Punishment of the Crime of Genocide.  The Charter of Fundamental Rights of the European Union also proclaims \"the prohibition of eugenic practices, in particular those aiming at selection of persons\". In spite of the decline in discriminatory eugenics laws, some government mandated sterilizations continued into the 21st century.  During the ten years President Alberto Fujimori led Peru from 1990 to 2000, 2,000 persons were allegedly involuntarily sterilized. China maintained its one-child policy until 2015 as well as a suite of other eugenics based legislation to reduce population size and manage fertility rates of different populations. In 2007 the United Nations reported coercive sterilizations and hysterectomies in Uzbekistan. During the years 2005 to 2013, nearly one-third of the 144 California prison inmates who were sterilized did not give lawful consent to the operation.\n\nModern resurgence of interest\n\nDevelopments in genetic, genomic, and reproductive technologies at the end of the 20th century are raising numerous questions regarding the ethical status of eugenics, effectively creating a resurgence of interest in the subject.\nSome, such as UC Berkeley sociologist Troy Duster, claim that modern genetics is a back door to eugenics. This view is shared by White House Assistant Director for Forensic Sciences, Tania Simoncelli, who stated in a 2003 publication by the Population and Development Program at Hampshire College that advances in pre-implantation genetic diagnosis (PGD) are moving society to a \"new era of eugenics\", and that, unlike the Nazi eugenics, modern eugenics is consumer driven and market based, \"where children are increasingly regarded as made-to-order consumer products\". In a 2006 newspaper article, Richard Dawkins said that discussion regarding eugenics was inhibited by the shadow of Nazi misuse, to the extent that some scientists would not admit that breeding humans for certain abilities is at all possible. He believes that it is not physically different from breeding domestic animals for traits such as speed or herding skill. Dawkins felt that enough time had elapsed to at least ask just what the ethical differences were between breeding for ability versus training athletes or forcing children to take music lessons, though he could think of persuasive reasons to draw the distinction.\n\nLee Kuan Yew, the Founding Father of Singapore, started promoting eugenics as early as 1983.\n\nIn October 2015, the United Nations' International Bioethics Committee wrote that the ethical problems of human genetic engineering should not be confused with the ethical problems of the 20th century eugenics movements. However, it is still problematic because it challenges the idea of human equality and opens up new forms of discrimination and stigmatization for those who do not want, or cannot afford, the technology.\n\nTranshumanism is often associated with eugenics, although most transhumanists holding similar views nonetheless distance themselves from the term \"eugenics\" (preferring \"germinal choice\" or \"reprogenetics\") to avoid having their position confused with the discredited theories and practices of early-20th-century eugenic movements.\n\nPrenatal screening can be considered a form of contemporary eugenics because it may lead to preventing the birth of a child with undesirable traits.\n\nMeanings and types\n\nThe term eugenics and its modern field of study were first formulated by Francis Galton in 1883, drawing on the recent work of his half-cousin Charles Darwin. Galton published his observations and conclusions in his book Inquiries into Human Faculty and Its Development.\n\nThe origins of the concept began with certain interpretations of Mendelian inheritance and the theories of August Weismann. The word eugenics is derived from the Greek word eu (\"good\" or \"well\") and the suffix -genēs (\"born\"), and was coined by Galton in 1883 to replace the word \"stirpiculture\", which he had used previously but which had come to be mocked due to its perceived sexual overtones. Galton defined eugenics as \"the study of all agencies under human control which can improve or impair the racial quality of future generations\".Cited in \n\nHistorically, the term eugenics has referred to everything from prenatal care for mothers to forced sterilization and euthanasia. To population geneticists, the term has included the avoidance of inbreeding without altering allele frequencies; for example, J. B. S. Haldane wrote that \"the motor bus, by breaking up inbred village communities, was a powerful eugenic agent.\" Debate as to what exactly counts as eugenics continues today.A discussion of the shifting meanings of the term can be found in \n\nEdwin Black, journalist and author of War Against the Weak, claims eugenics is often deemed a pseudoscience because what is defined as a genetic improvement of a desired trait is often deemed a cultural choice rather than a matter that can be determined through objective scientific inquiry. The most disputed aspect of eugenics has been the definition of \"improvement\" of the human gene pool, such as what is a beneficial characteristic and what is a defect. Historically, this aspect of eugenics was tainted with scientific racism and pseudoscience.\n\nEarly eugenists were mostly concerned with factors of perceived intelligence that often correlated strongly with social class. Some of these early eugenists include Karl Pearson and Walter Weldon, who worked on this at the University College London.\n\nEugenics also had a place in medicine. In his lecture \"Darwinism, Medical Progress and Eugenics\", Karl Pearson said that everything concerning eugenics fell into the field of medicine. He basically placed the two words as equivalents. He was supported in part by the fact that Francis Galton, the father of eugenics, also had medical training.\n\nEugenic policies have been conceptually divided into two categories.  Positive eugenics is aimed at encouraging reproduction among the genetically advantaged; for example, the reproduction of the intelligent, the healthy, and the successful.  Possible approaches include financial and political stimuli, targeted demographic analyses, in vitro fertilization, egg transplants, and cloning. The movie Gattaca provides a fictional example of a dystopian society that uses eugenics to decided what you are capable of and your place in the world.  Negative eugenics aimed to eliminate, through sterilization or segregation, those deemed physically, mentally, or morally \"undesirable\". This includes abortions, sterilization, and other methods of family planning. Both positive and negative eugenics can be coercive; abortion for fit women, for example, was illegal in Nazi Germany.\n\nJon Entine claims that eugenics simply means \"good genes\" and using it as synonym for genocide is an \"all-too-common distortion of the social history of genetics policy in the United States.\" According to Entine, eugenics developed out of the Progressive Era and not \"Hitler's twisted Final Solution\".\n\nImplementation methods\n\nAccording to Richard Lynn, eugenics may be divided into two main categories based on the ways in which the methods of eugenics can be applied.Lynn 2001. Part III. The Implementation of Classical Eugenics pp. 137–244 Part IV. The New Eugenics pp. 245–320\n* Classical eugenics\n** Negative eugenics by provision of information and services, i.e. reduction of unplanned pregnancies and births.Lynn 2001. pp. 165–186\n*** Advocacy for sexual abstinence.Lynn 2001. pp. 169–170\n***  Sex education in schools.Lynn 2001. pp. 170–172\n*** School-based clinics.Lynn 2001. pp. 172–174\n*** Promoting the use of contraception.Lynn 2001. pp. 174–176\n*** Emergency contraception.Lynn 2001. pp. 176–178\n*** Research for better contraceptives.Lynn 2001. pp. 179–181\n*** Voluntary sterilization.Lynn 2001. pp. 181–182\n*** Abortion.Lynn 2001. pp. 182–185\n** Negative eugenics by incentives, coercion and compulsion.Lynn 2001. pp. 187–204\n*** Incentives for sterilization.Lynn 2001. pp. 188–189\n*** The Denver Dollar-a-day program, i.e. paying teenage mothers for not becoming pregnant again.Lynn 2001. pp. 189–190\n*** Incentives for women on welfare to use contraceptions.Lynn 2001. pp. 190–191\n*** Payments for sterilization in developing countries.Lynn 2001. pp. 191–192\n*** Curtailment of benefits to welfare mothers.Lynn 2001. pp. 194–195\n*** Compulsory sterilization of the \"mentally retarded\".Lynn 2001. pp. 196–199. Quote: \"There is, nevertheless, a good case for reviving the sterilization of the mentally retarded and criminals. It is indisputable on both empirical and theorethical ground that many of these people transmit their characteristics to their children by both genetic and environmental processes.\"\n*** Compulsory sterilization of female criminals.Lynn 2001. pp. 199–201. First quote: \"The rationale for this sentencing policy was that the judges considered these women unfit to rear children and that they should therefore be prevented from having more, at least for a few years.\" Second quote: \"In these and similar cases many people will no doubt accept that the judges were right in deciding that the women were unfit mothers and likely to cause harm to any future children and that it would be desirable to prevent further pregnancies. It is preferable for these women to be put on probation conditional on temporary sterilization than to send them to prison, which in most cases would serve little useful purpose. These judges' decisions were not made ostensibly on eugenic grounds, but they furthered the eugenic objective of preventing these women from having children, at least for a limited period. The eugenic objective should be to support these judicial sentences and to promote their use more often, together with the stipulation of longer periods of contraception and, preferably, permanent sterilization\"\n*** Compulsory sterilization of male criminals.Lynn 2001. pp. 201–203. Quote: \"A better alternative, from the point of view of reducing future criminal offending and the promotion of eugenics, would be for judges to offer convicted male criminals the alternatives of imprisonment or castration accompanied by probation.\"\n** Licences for parenthood.Lynn 2001. pp. 205–214Lynn 2001. pp. 211–213. Richard Lynn argued that to have an effective licensing program, reversible sterilization methods should be used. Those who wish to have children would obtain the licence and have the sterilization reversed. Lynn stated that the proposals made by Francis Galton, Hugh LaFollette and John Westman would not be effective from the eugenicists' viewpoint, since those without licences could still have children. The proposal by David Lykken would be only slightly effective.\n** Positive eugenics.Lynn 2001. pp. 215–224\n*** Financial incentives to have children.Lynn 2001. pp. 215–217\n*** Selective incentives for childbearing.Lynn 2001. pp. 217–219\n*** Taxation of the childless.Lynn 2001. p. 219\n*** Ethical obligations of the elite.Lynn 2001. pp. 220–221. Quote: \"While it can be confidently expected that elites would respond to financial incentives to have children and to penalties for childlessness by increasing their fertility, they might not do this to the extent that would be desired. Ideally a program of positive eugenics would increase the fertility of the elite to perhaps around four children per couple; and at the same time a complementary program of negative eugenics would reduce the fertility of those with low intelligence and psychopathic personality to zero.\n*** Eugenic immigration.Lynn 2001. pp. 222–224. Quote: \"The final strategy for the promotion of positive eugenics would consist of the acceptance of good-quality immigrants.\"\n* New eugenics\n** Artificial insemination by donor.Lynn 2001. p. 246\n** Egg donation.Lynn 2001. p. 247\n** Prenatal diagnosis of genetic disorders and pregnancy terminations of defective fetuses.Lynn 2001. pp. 248–251\n** Embryo selection.Lynn 2001. p. 252\n** Genetic engineering.Lynn 2001. p. 253\n** Gene therapy.Lynn 2001. p. 254\n** Cloning.Lynn 2001. pp. 254–255\n\nArguments\n\nEfficacy\n\nThe first major challenge to conventional eugenics based upon genetic inheritance was made in 1915 by Thomas Hunt Morgan. He demonstrated the event of genetic mutation occurring outside of inheritance involving the discovery of the hatching of a fruit fly (Drosophila melanogaster) with white eyes from a family with red-eyes. Morgan claimed that this demonstrated that major genetic changes occurred outside of inheritance and that the concept of eugenics based upon genetic inheritance was not completely scientifically accurate. Additionally, Morgan criticized the view that subjective traits, such as intelligence and criminality, were caused by heredity because he believed that the definitions of these traits varied and that accurate work in genetics could only be done when the traits being studied were accurately defined.  Despite Morgan's public rejection of eugenics, much of his genetic research was absorbed by eugenics.\n\nThe heterozygote test is used for the early detection of recessive hereditary diseases, allowing for couples to determine if they are at risk of passing genetic defects to a future child. The goal of the test is to estimate the likelihood of passing the hereditary disease to future descendants.\n\nRecessive traits can be severely reduced, but never eliminated unless the complete genetic makeup of all members of the pool was known, as aforementioned. As only very few undesirable traits, such as Huntington's disease, are dominant, it could be argued from certain perspectives that the practicality of \"eliminating\" traits is quite low.\n\nThere are examples of eugenic acts that managed to lower the prevalence of recessive diseases, although not influencing the prevalence of heterozygote carriers of those diseases. The elevated prevalence of certain genetically transmitted diseases among the Ashkenazi Jewish population (Tay–Sachs, cystic fibrosis, Canavan's disease, and Gaucher's disease), has been decreased in current populations by the application of genetic screening.\n\nPleiotropy occurs when  one gene influences multiple, seemingly unrelated phenotypic traits, an example being phenylketonuria, which is a human disease that affects multiple systems but is caused by one gene defect.  Andrzej Pękalski, from the University of Wrocław, argues that eugenics can cause harmful loss of genetic diversity if a eugenics program selects a pleiotropic gene that could possibly be associated with a positive trait.  Pekalski uses the example of a coercive government eugenics program that prohibits people with myopia from breeding but has the unintended consequence of also selecting against high intelligence since the two go together.\n\nLoss of genetic diversity\n\nEugenic policies could also lead to loss of genetic diversity, in which case a culturally accepted \"improvement\" of the gene pool could very likely—as evidenced in numerous instances in isolated island populations —result in extinction due to increased vulnerability to disease, reduced ability to adapt to environmental change, and other factors both known and unknown. A long-term, species-wide eugenics plan might lead to a scenario similar to this because the elimination of traits deemed undesirable would reduce genetic diversity by definition.(Galton 2001, 48)\n\nEdward M. Miller claims that, in any one generation, any realistic program should make only minor changes in a fraction of the gene pool, giving plenty of time to reverse direction if unintended consequences emerge, reducing the likelihood of the elimination of desirable genes. Miller also argues that any appreciable reduction in diversity is so far in the future that little concern is needed for now.\n\nWhile the science of genetics has increasingly provided means by which certain characteristics and conditions can be identified and understood, given the complexity of human genetics, culture, and psychology, at this point no agreed objective means of determining which traits might be ultimately desirable or undesirable. Some diseases such as sickle-cell disease and cystic fibrosis respectively confer immunity to malaria and resistance to cholera when a single copy of the recessive allele is contained within the genotype of the individual. Reducing the instance of sickle-cell disease genes in Africa where malaria is a common and deadly disease could indeed have extremely negative net consequences.\n\nHowever, some genetic diseases cause people to consider some elements of eugenics.\n\nEthics\n\nSocietal and political consequences of eugenics call for a place in the discussion on the ethics behind the eugenics movement. Many of the ethical concerns regarding eugenics arise from its controversial past, prompting a discussion on what place, if any, it should have in the future.  Advances in science have changed eugenics. In the past, eugenics had more to do with sterilization and enforced reproduction laws. Now, in the age of a progressively mapped genome, embryos can be tested for susceptibility to disease, gender, and genetic defects, and alternative methods of reproduction such as in vitro fertilization are becoming more common. Therefore, eugenics is no longer ex post facto regulation of the living but instead preemptive action on the unborn.\n\nWith this change, however, there are ethical concerns which lack adequate attention, and which must be addressed before eugenic policies can be properly implemented in the future.  Sterilized individuals, for example, could volunteer for the procedure, albeit under incentive or duress, or at least voice their opinion. The unborn fetus on which these new eugenic procedures are performed cannot speak out, as the fetus lacks the voice to consent or to express his or her opinion. Philosophers disagree about the proper framework for reasoning about such actions, which change the very identity and existence of future persons.\n\nOpposition\n\nA common criticism of eugenics is that \"it inevitably leads to measures that are unethical\".Lynn 2001. The Ethical Principles of Classical Eugenics – Conclusions P. 241 Quote: \"A number of the opponents of eugenics have resorted to the slippery slope argument, which states that although a number of eugenic measures are unobjectionable in themselves, they could lead to further measures that would be unethical. This argument is unpersuasive because all sorts of measures that are acceptable might, if taken to extremes, lead to other measures that are unacceptable.\" Some fear future \"eugenics wars\" as the worst-case scenario: the return of coercive state-sponsored genetic discrimination and human rights violations such as compulsory sterilization of persons with genetic defects, the killing of the institutionalized and, specifically, segregation and genocide of races perceived as inferior. Health law professor George Annas and technology law professor Lori Andrews are prominent advocates of the position that the use of these technologies could lead to such human-posthuman caste warfare.\n\nIn his 2003 book Enough: Staying Human in an Engineered Age, environmental ethicist Bill McKibben argued at length against germinal choice technology and other advanced biotechnological strategies for human enhancement. He writes that it would be morally wrong for humans to tamper with fundamental aspects of themselves (or their children) in an attempt to overcome universal human limitations, such as vulnerability to aging, maximum life span and biological constraints on physical and cognitive ability. Attempts to \"improve\" themselves through such manipulation would remove limitations that provide a necessary context for the experience of meaningful human choice. He claims that human lives would no longer seem meaningful in a world where such limitations could be overcome with technology. Even the goal of using germinal choice technology for clearly therapeutic purposes should be relinquished, since it would inevitably produce temptations to tamper with such things as cognitive capacities. He argues that it is possible for societies to benefit from renouncing particular technologies, using as examples Ming China, Tokugawa Japan and the contemporary Amish.\n\nSupport\n\nSome, for example Nathaniel C. Comfort from Johns Hopkins University, claim that the change from state-led reproductive-genetic decision-making to individual choice has moderated the worst abuses of eugenics by transferring the decision-making from the state to the patient and their family. Comfort suggests that \"the eugenic impulse drives us to eliminate disease, live longer and healthier, with greater intelligence, and a better adjustment to the conditions of society;  and the health benefits, the intellectual thrill and the profits of genetic bio-medicine are too great for us to do otherwise.\" Others, such as bioethicist Stephen Wilkinson of Keele University and Honorary Research Fellow Eve Garrard at the University of Manchester, claim that some aspects of modern genetics can be classified as eugenics, but that this classification does not inherently make modern genetics immoral. In a co-authored publication by Keele University, they stated that \"[e]ugenics doesn't seem always to be immoral, and so the fact that PGD, and other forms of selective reproduction, might sometimes technically be eugenic, isn't sufficient to show that they're wrong.\"\n\nIn their book published in 2000, From Chance to Choice: Genetics and Justice, bioethicists Allen Buchanan, Dan Brock, Norman Daniels and Daniel Wikler argued that liberal societies have an obligation to encourage as wide an adoption of eugenic enhancement technologies as possible (so long as such policies do not infringe on individuals' reproductive rights or exert undue pressures on prospective parents to use these technologies) in order to maximize public health and minimize the inequalities that may result from both natural genetic endowments and unequal access to genetic enhancements.\n\nOriginal position, a hypothetical situation developed by American philosopher John Rawls, has been used as an argument for negative eugenics.Shaw, p. 147. Quote: \"What Rawls says is that \"Over time a society is to take steps to preserve the general level of natural abilities and to prevent the diffusion of serious defects.\" The key words here are \"preserve\" and \"prevent\". Rawls clearly envisages only the use of negative eugenics as a preventative measure to ensure a good basic level of genetic health for future generations. To jump from this to \"make the later generations as genetically talented as possible,\" as Pence does, is a masterpiece of misinterpretation. This, then, is the sixth argument against positive eugenics: the Veil of Ignorance argument. Those behind the Veil in Rawls' Original Position would agree to permit negative, but not positive eugenics. This is a more complex variant of the Consent argument, as the Veil of Ignorance merely forces us to adopt a position of hypotethical consent to particular principles of justice.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Eugenics" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9737" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Eugenics (; from Greek εὐγενής eugenes 'well-born' from εὖ eu, 'good, well' and γένος genos, 'race, stock, kin')  Database includes entries from A Greek–English Lexicon and other English dictionaries of Ancient Greek. is a set of beliefs and practices that aims at improving the genetic quality of a human population.\nThe exact definition of eugenics has been a matter of debate since the term was coined by Francis Galton in 1883.  The concept predates this coinage, with Plato suggesting applying the principles of selective breeding to humans around 400 BCE.\n\nFrederick Osborn's 1937 journal article \"Development of a Eugenic Philosophy\" framed it as a social philosophy—that is, a philosophy with implications for social order.  That definition is not universally accepted.  Osborn advocated for higher rates of sexual reproduction among people with desired traits (positive eugenics), or reduced rates of sexual reproduction and sterilization of people with less-desired or undesired traits (negative eugenics).\n\nAlternatively, gene selection rather than \"people selection\" has recently been made possible through advances in genome editing, leading to what is sometimes called new eugenics, also known as neo-eugenics, consumer eugenics, or liberal eugenics.\n\nWhile eugenic principles have been practiced as far back in world history as ancient Greece, the modern history of eugenics began in the early 20th century when a popular eugenics movement emerged in the United Kingdom and spread to many countries including the United States, Canada and most European countries. In this period, eugenic ideas were espoused across the political spectrum. Consequently, many countries adopted eugenic policies with the intent to improve the quality of their populations' genetic stock. Such programs included both \"positive\" measures, such as encouraging individuals deemed particularly \"fit\" to reproduce, and \"negative\" measures such as marriage prohibitions and forced sterilization of people deemed unfit for reproduction. People deemed unfit to reproduce often included people with mental or physical disabilities, people who scored in the low ranges of different IQ tests, criminals and deviants, and members of disfavored minority groups. The eugenics movement became negatively associated with Nazi Germany and the Holocaust when many of the defendants at the Nuremberg trials attempted to justify their human rights abuses by claiming there was little difference between the Nazi eugenics programs and the U.S. eugenics programs.\nIn the decades following World War II, with the institution of human rights, many countries gradually began to abandon eugenics policies, although some Western countries, among them the United States, continued to carry out forced sterilizations.\n\nSince the 1980s and 1990s, when new assisted reproductive technology procedures became available such as gestational surrogacy (available since 1985), preimplantation genetic diagnosis (available since 1989), and cytoplasmic transfer (first performed in 1996), fear about a possible revival of eugenics and widening of the gap between the rich and the poor has emerged.\n\nA major criticism of eugenics policies is that, regardless of whether \"negative\" or \"positive\" policies are used, they are susceptible to abuse because the criteria of selection are determined by whichever group is in political power at the time. Furthermore, negative eugenics in particular is considered by many to be a violation of basic human rights, which include the right to reproduction. Another criticism is that eugenic policies eventually lead to a loss of genetic diversity, resulting in inbreeding depression due to lower genetic variation.\n\nHistory\n\nOrigin and development\n\nThe concept of positive eugenics to produce better human beings has existed at least since Plato suggested selective mating to produce a guardian class. \n \nThe first formal negative eugenics, that is a legal provision against birth of inferior human beings, was promulgated in Western European culture by the Christian Council of Agde in 506, which forbade marriage between cousins.Giles, Frances (2010) [https://books.google.co.uk/books?id5pXmkCf3LEIC&pg\nPR2-IA10&dqEugenics+506+Agde&hl\nen&saX&ved\n0ahUKEwjX2pys46rYAhUhJsAKHXXKAeMQ6AEIJDAA#vonepage&q\nEugenics%20506%20Agde&f=falseMarriage and the Family in the Middle Ages] New York: Harper Collins. p.ii \n\nThis idea was also promoted by William Goodell (1829–1894) who advocated the castration and spaying of the insane.\n\nThe idea of a modern project of improving the human population through a statistical understanding of heredity used to encourage good breeding was originally developed by Francis Galton and, initially, was closely linked to Darwinism and his theory of natural selection.Bowler, Peter J., Evolution: The History of an Idea, 3rd Ed., University of California Press, 2003, pp. 308–310. Galton had read his half-cousin Charles Darwin's theory of evolution, which sought to explain the development of plant and animal species, and desired to apply it to humans. Based on his biographical studies, Galton believed that desirable human qualities were hereditary traits, though Darwin strongly disagreed with this elaboration of his theory. In 1883, one year after Darwin's death, Galton gave his research a name: eugenics. With the introduction of genetics, eugenics became associated with ideology of genetic determinism in which human character was due to genes, unaffected by education or living conditions. Many of the early geneticists were not Darwinians, and evolution theory was not needed for eugenics policies based on genetic determinism. Throughout its recent history, eugenics has remained controversial.\n\nEugenics became an academic discipline at many colleges and universities and received funding from many sources. Organizations were formed to win public support and sway opinion towards responsible eugenic values in parenthood, including the British Eugenics Education Society of 1907 and the American Eugenics Society of 1921. Both sought support from leading clergymen and modified their message to meet religious ideals. In 1909 the Anglican clergymen William Inge and James Peile both wrote for the British Eugenics Education Society. Inge was an invited speaker at the 1921 International Eugenics Conference, which was also endorsed by the Roman Catholic Archbishop of New York Patrick Joseph Hayes.\n\nThree International Eugenics Conferences presented a global venue for eugenists with meetings in 1912 in London, and in 1921 and 1932 in New York City. Eugenic policies were first implemented in the early 1900s in the United States. It also took root in France, Germany, and Great Britain.  Later, in the 1920s and 1930s, the eugenic policy of sterilizing certain mental patients was implemented in other countries including Belgium, Brazil, Canada, Japan and Sweden.\n\nIn addition to being practiced in a number of countries, eugenics was internationally organized through the International Federation of Eugenics Organizations. Its scientific aspects were carried on through research bodies such as the Kaiser Wilhelm Institute of Anthropology, Human Heredity, and Eugenics, the Cold Spring Harbour Carnegie Institution for Experimental Evolution, and the Eugenics Record Office. Politically, the movement advocated measures such as sterilization laws. In its moral dimension, eugenics rejected the doctrine that all human beings are born equal and redefined moral worth purely in terms of genetic fitness. Its racist elements included pursuit of a pure \"Nordic race\" or \"Aryan\" genetic pool and the eventual elimination of \"unfit\" races.\n\nEarly critics of the philosophy of eugenics included the American sociologist Lester Frank Ward, the English writer G. K. Chesterton, the German-American anthropologist Franz Boas, who argued that advocates of eugenics greatly over-estimate the influence of biology, and Scottish tuberculosis pioneer and author Halliday Sutherland. Ward's 1913 article \"[https://archive.org/details/jstor-2763324 Eugenics, Euthenics, and Eudemics]\", Chesterton's 1917 book Eugenics and Other Evils, and Boas' 1916 article \"Eugenics\" (published in The Scientific Monthly) were all harshly critical of the rapidly growing movement. Sutherland identified eugenists as a major obstacle to the eradication and cure of tuberculosis in his 1917 address \"Consumption: Its Cause and Cure\",\"Consumption: Its Cause and Cure\" An Address by Dr Halliday Sutherland on 4 September 1917, published by the Red Triangle Press. and criticism of eugenists and Neo-Malthusians in his 1921 book Birth Control led to a writ for libel from the eugenist Marie Stopes. Several biologists were also antagonistic to the eugenics movement, including Lancelot Hogben.\"Lancelot Hogben, who developed his critique of eugenics and distaste for racism in the period...he spent as Professor of Zoology at the University of Cape Town\".  Alison Bashford and Philippa Levine, The Oxford Handbook of the History of Eugenics. Oxford; Oxford University Press, 2010  (p.200) Other biologists such as J. B. S. Haldane and R. A. Fisher expressed skepticism in the belief that sterilization of \"defectives\" would lead to the disappearance of undesirable genetic traits.\"Whatever their disagreement on the numbers, Haldane, Fisher, and most geneticists could support Jennings's warning: To encourage the expectation that the sterilization of defectives will \"solve the problem of hereditary defects, close up the asylums for feebleminded and insane, do away with prisons, is only to subject society to deception\". Daniel J. Kevles, In the Name of Eugenics. University of California Press, 1985.  (p. 166).\n\nAmong institutions, the Catholic Church was an opponent of state-enforced sterilizations. Attempts by the Eugenics Education Society to persuade the British government to legalize voluntary sterilization were opposed by Catholics and by the Labour Party. The American Eugenics Society initially gained some Catholic supporters, but Catholic support declined following the 1930 papal encyclical Casti connubii. In this, Pope Pius XI explicitly condemned sterilization laws: \"Public magistrates have no direct power over the bodies of their subjects; therefore, where no crime has taken place and there is no cause present for grave punishment, they can never directly harm, or tamper with the integrity of the body, either for the reasons of eugenics or for any other reason.\"\n\nAs a social movement, eugenics reached its greatest popularity in the early decades of the 20th century, when it was practiced around the world and promoted by governments, institutions, and influential individuals. Many countries enacted various eugenics policies, including: genetic screenings, birth control, promoting differential birth rates, marriage restrictions, segregation (both racial segregation and sequestering the mentally ill), compulsory sterilization, forced abortions or forced pregnancies, ultimately culminating in genocide.\n\nNazism and the decline of eugenics\n\nThe scientific reputation of eugenics started to decline in the 1930s, a time when Ernst Rüdin used eugenics as a justification for the racial policies of Nazi Germany. Adolf Hitler had praised and incorporated eugenic ideas in Mein Kampf in 1925 and emulated eugenic legislation for the sterilization of \"defectives\" that had been pioneered in the United States once he took power. Some common early 20th century eugenics methods involved identifying and classifying individuals and their families, including the poor, mentally ill, blind, deaf, developmentally disabled, promiscuous women, homosexuals, and racial groups (such as the Roma and Jews in Nazi Germany) as \"degenerate\" or \"unfit\", and therefore led to segregation, institutionalization, sterilization, euthanasia, and even mass murder. The Nazi practice of euthanasia was carried out on hospital patients in the Aktion T4 centers such as Hartheim Castle.\n\nBy the end of World War II, many discriminatory eugenics laws were abandoned, having become associated with Nazi Germany.Lynn 2001. p. 18 \"By the middle decades of the twentieth century, eugenics had become widely accepted throughout the whole of the economically developed world, with the exception of the Soviet Union.\" H. G. Wells, who had called for \"the sterilization of failures\" in 1904, stated in his 1940 book The Rights of Man: Or What are we fighting for? that among the human rights, which he believed should be available to all people, was \"a prohibition on mutilation, sterilization, torture, and any bodily punishment\". After World War II, the practice of \"imposing measures intended to prevent births within [a national, ethnical, racial or religious] group\" fell within the definition of the new international crime of genocide, set out in the Convention on the Prevention and Punishment of the Crime of Genocide.Article 2 of the Convention defines genocide as any of the following acts committed with the intent to destroy, in whole or in part, a national, ethnic, racial or religious group, as such as:\n* Killing members of the group;\n* Causing serious bodily or mental harm to members of the group;\n* Deliberately inflicting on the group conditions of life calculated to bring about its physical destruction in whole or in part;\n* Imposing measures intended to prevent births within the group;\n* Forcibly transferring children of the group to another group.\nSee the Convention on the Prevention and Punishment of the Crime of Genocide.  The Charter of Fundamental Rights of the European Union also proclaims \"the prohibition of eugenic practices, in particular those aiming at selection of persons\". In spite of the decline in discriminatory eugenics laws, some government mandated sterilizations continued into the 21st century.  During the ten years President Alberto Fujimori led Peru from 1990 to 2000, 2,000 persons were allegedly involuntarily sterilized. China maintained its one-child policy until 2015 as well as a suite of other eugenics based legislation to reduce population size and manage fertility rates of different populations. In 2007 the United Nations reported coercive sterilizations and hysterectomies in Uzbekistan. During the years 2005 to 2013, nearly one-third of the 144 California prison inmates who were sterilized did not give lawful consent to the operation.\n\nModern resurgence of interest\n\nDevelopments in genetic, genomic, and reproductive technologies at the end of the 20th century are raising numerous questions regarding the ethical status of eugenics, effectively creating a resurgence of interest in the subject.\nSome, such as UC Berkeley sociologist Troy Duster, claim that modern genetics is a back door to eugenics. This view is shared by White House Assistant Director for Forensic Sciences, Tania Simoncelli, who stated in a 2003 publication by the Population and Development Program at Hampshire College that advances in pre-implantation genetic diagnosis (PGD) are moving society to a \"new era of eugenics\", and that, unlike the Nazi eugenics, modern eugenics is consumer driven and market based, \"where children are increasingly regarded as made-to-order consumer products\". In a 2006 newspaper article, Richard Dawkins said that discussion regarding eugenics was inhibited by the shadow of Nazi misuse, to the extent that some scientists would not admit that breeding humans for certain abilities is at all possible. He believes that it is not physically different from breeding domestic animals for traits such as speed or herding skill. Dawkins felt that enough time had elapsed to at least ask just what the ethical differences were between breeding for ability versus training athletes or forcing children to take music lessons, though he could think of persuasive reasons to draw the distinction.\n\nLee Kuan Yew, the Founding Father of Singapore, started promoting eugenics as early as 1983.\n\nIn October 2015, the United Nations' International Bioethics Committee wrote that the ethical problems of human genetic engineering should not be confused with the ethical problems of the 20th century eugenics movements. However, it is still problematic because it challenges the idea of human equality and opens up new forms of discrimination and stigmatization for those who do not want, or cannot afford, the technology.\n\nTranshumanism is often associated with eugenics, although most transhumanists holding similar views nonetheless distance themselves from the term \"eugenics\" (preferring \"germinal choice\" or \"reprogenetics\") to avoid having their position confused with the discredited theories and practices of early-20th-century eugenic movements.\n\nPrenatal screening can be considered a form of contemporary eugenics because it may lead to preventing the birth of a child with undesirable traits.\n\nMeanings and types\n\nThe term eugenics and its modern field of study were first formulated by Francis Galton in 1883, drawing on the recent work of his half-cousin Charles Darwin. Galton published his observations and conclusions in his book Inquiries into Human Faculty and Its Development.\n\nThe origins of the concept began with certain interpretations of Mendelian inheritance and the theories of August Weismann. The word eugenics is derived from the Greek word eu (\"good\" or \"well\") and the suffix -genēs (\"born\"), and was coined by Galton in 1883 to replace the word \"stirpiculture\", which he had used previously but which had come to be mocked due to its perceived sexual overtones. Galton defined eugenics as \"the study of all agencies under human control which can improve or impair the racial quality of future generations\".Cited in \n\nHistorically, the term eugenics has referred to everything from prenatal care for mothers to forced sterilization and euthanasia. To population geneticists, the term has included the avoidance of inbreeding without altering allele frequencies; for example, J. B. S. Haldane wrote that \"the motor bus, by breaking up inbred village communities, was a powerful eugenic agent.\" Debate as to what exactly counts as eugenics continues today.A discussion of the shifting meanings of the term can be found in \n\nEdwin Black, journalist and author of War Against the Weak, claims eugenics is often deemed a pseudoscience because what is defined as a genetic improvement of a desired trait is often deemed a cultural choice rather than a matter that can be determined through objective scientific inquiry. The most disputed aspect of eugenics has been the definition of \"improvement\" of the human gene pool, such as what is a beneficial characteristic and what is a defect. Historically, this aspect of eugenics was tainted with scientific racism and pseudoscience.\n\nEarly eugenists were mostly concerned with factors of perceived intelligence that often correlated strongly with social class. Some of these early eugenists include Karl Pearson and Walter Weldon, who worked on this at the University College London.\n\nEugenics also had a place in medicine. In his lecture \"Darwinism, Medical Progress and Eugenics\", Karl Pearson said that everything concerning eugenics fell into the field of medicine. He basically placed the two words as equivalents. He was supported in part by the fact that Francis Galton, the father of eugenics, also had medical training.\n\nEugenic policies have been conceptually divided into two categories.  Positive eugenics is aimed at encouraging reproduction among the genetically advantaged; for example, the reproduction of the intelligent, the healthy, and the successful.  Possible approaches include financial and political stimuli, targeted demographic analyses, in vitro fertilization, egg transplants, and cloning. The movie Gattaca provides a fictional example of a dystopian society that uses eugenics to decided what you are capable of and your place in the world.  Negative eugenics aimed to eliminate, through sterilization or segregation, those deemed physically, mentally, or morally \"undesirable\". This includes abortions, sterilization, and other methods of family planning. Both positive and negative eugenics can be coercive; abortion for fit women, for example, was illegal in Nazi Germany.\n\nJon Entine claims that eugenics simply means \"good genes\" and using it as synonym for genocide is an \"all-too-common distortion of the social history of genetics policy in the United States.\" According to Entine, eugenics developed out of the Progressive Era and not \"Hitler's twisted Final Solution\".\n\nImplementation methods\n\nAccording to Richard Lynn, eugenics may be divided into two main categories based on the ways in which the methods of eugenics can be applied.Lynn 2001. Part III. The Implementation of Classical Eugenics pp. 137–244 Part IV. The New Eugenics pp. 245–320\n* Classical eugenics\n** Negative eugenics by provision of information and services, i.e. reduction of unplanned pregnancies and births.Lynn 2001. pp. 165–186\n*** Advocacy for sexual abstinence.Lynn 2001. pp. 169–170\n***  Sex education in schools.Lynn 2001. pp. 170–172\n*** School-based clinics.Lynn 2001. pp. 172–174\n*** Promoting the use of contraception.Lynn 2001. pp. 174–176\n*** Emergency contraception.Lynn 2001. pp. 176–178\n*** Research for better contraceptives.Lynn 2001. pp. 179–181\n*** Voluntary sterilization.Lynn 2001. pp. 181–182\n*** Abortion.Lynn 2001. pp. 182–185\n** Negative eugenics by incentives, coercion and compulsion.Lynn 2001. pp. 187–204\n*** Incentives for sterilization.Lynn 2001. pp. 188–189\n*** The Denver Dollar-a-day program, i.e. paying teenage mothers for not becoming pregnant again.Lynn 2001. pp. 189–190\n*** Incentives for women on welfare to use contraceptions.Lynn 2001. pp. 190–191\n*** Payments for sterilization in developing countries.Lynn 2001. pp. 191–192\n*** Curtailment of benefits to welfare mothers.Lynn 2001. pp. 194–195\n*** Compulsory sterilization of the \"mentally retarded\".Lynn 2001. pp. 196–199. Quote: \"There is, nevertheless, a good case for reviving the sterilization of the mentally retarded and criminals. It is indisputable on both empirical and theorethical ground that many of these people transmit their characteristics to their children by both genetic and environmental processes.\"\n*** Compulsory sterilization of female criminals.Lynn 2001. pp. 199–201. First quote: \"The rationale for this sentencing policy was that the judges considered these women unfit to rear children and that they should therefore be prevented from having more, at least for a few years.\" Second quote: \"In these and similar cases many people will no doubt accept that the judges were right in deciding that the women were unfit mothers and likely to cause harm to any future children and that it would be desirable to prevent further pregnancies. It is preferable for these women to be put on probation conditional on temporary sterilization than to send them to prison, which in most cases would serve little useful purpose. These judges' decisions were not made ostensibly on eugenic grounds, but they furthered the eugenic objective of preventing these women from having children, at least for a limited period. The eugenic objective should be to support these judicial sentences and to promote their use more often, together with the stipulation of longer periods of contraception and, preferably, permanent sterilization\"\n*** Compulsory sterilization of male criminals.Lynn 2001. pp. 201–203. Quote: \"A better alternative, from the point of view of reducing future criminal offending and the promotion of eugenics, would be for judges to offer convicted male criminals the alternatives of imprisonment or castration accompanied by probation.\"\n** Licences for parenthood.Lynn 2001. pp. 205–214Lynn 2001. pp. 211–213. Richard Lynn argued that to have an effective licensing program, reversible sterilization methods should be used. Those who wish to have children would obtain the licence and have the sterilization reversed. Lynn stated that the proposals made by Francis Galton, Hugh LaFollette and John Westman would not be effective from the eugenicists' viewpoint, since those without licences could still have children. The proposal by David Lykken would be only slightly effective.\n** Positive eugenics.Lynn 2001. pp. 215–224\n*** Financial incentives to have children.Lynn 2001. pp. 215–217\n*** Selective incentives for childbearing.Lynn 2001. pp. 217–219\n*** Taxation of the childless.Lynn 2001. p. 219\n*** Ethical obligations of the elite.Lynn 2001. pp. 220–221. Quote: \"While it can be confidently expected that elites would respond to financial incentives to have children and to penalties for childlessness by increasing their fertility, they might not do this to the extent that would be desired. Ideally a program of positive eugenics would increase the fertility of the elite to perhaps around four children per couple; and at the same time a complementary program of negative eugenics would reduce the fertility of those with low intelligence and psychopathic personality to zero.\n*** Eugenic immigration.Lynn 2001. pp. 222–224. Quote: \"The final strategy for the promotion of positive eugenics would consist of the acceptance of good-quality immigrants.\"\n* New eugenics\n** Artificial insemination by donor.Lynn 2001. p. 246\n** Egg donation.Lynn 2001. p. 247\n** Prenatal diagnosis of genetic disorders and pregnancy terminations of defective fetuses.Lynn 2001. pp. 248–251\n** Embryo selection.Lynn 2001. p. 252\n** Genetic engineering.Lynn 2001. p. 253\n** Gene therapy.Lynn 2001. p. 254\n** Cloning.Lynn 2001. pp. 254–255\n\nArguments\n\nEfficacy\n\nThe first major challenge to conventional eugenics based upon genetic inheritance was made in 1915 by Thomas Hunt Morgan. He demonstrated the event of genetic mutation occurring outside of inheritance involving the discovery of the hatching of a fruit fly (Drosophila melanogaster) with white eyes from a family with red-eyes. Morgan claimed that this demonstrated that major genetic changes occurred outside of inheritance and that the concept of eugenics based upon genetic inheritance was not completely scientifically accurate. Additionally, Morgan criticized the view that subjective traits, such as intelligence and criminality, were caused by heredity because he believed that the definitions of these traits varied and that accurate work in genetics could only be done when the traits being studied were accurately defined.  Despite Morgan's public rejection of eugenics, much of his genetic research was absorbed by eugenics.\n\nThe heterozygote test is used for the early detection of recessive hereditary diseases, allowing for couples to determine if they are at risk of passing genetic defects to a future child. The goal of the test is to estimate the likelihood of passing the hereditary disease to future descendants.\n\nRecessive traits can be severely reduced, but never eliminated unless the complete genetic makeup of all members of the pool was known, as aforementioned. As only very few undesirable traits, such as Huntington's disease, are dominant, it could be argued from certain perspectives that the practicality of \"eliminating\" traits is quite low.\n\nThere are examples of eugenic acts that managed to lower the prevalence of recessive diseases, although not influencing the prevalence of heterozygote carriers of those diseases. The elevated prevalence of certain genetically transmitted diseases among the Ashkenazi Jewish population (Tay–Sachs, cystic fibrosis, Canavan's disease, and Gaucher's disease), has been decreased in current populations by the application of genetic screening.\n\nPleiotropy occurs when  one gene influences multiple, seemingly unrelated phenotypic traits, an example being phenylketonuria, which is a human disease that affects multiple systems but is caused by one gene defect.  Andrzej Pękalski, from the University of Wrocław, argues that eugenics can cause harmful loss of genetic diversity if a eugenics program selects a pleiotropic gene that could possibly be associated with a positive trait.  Pekalski uses the example of a coercive government eugenics program that prohibits people with myopia from breeding but has the unintended consequence of also selecting against high intelligence since the two go together.\n\nLoss of genetic diversity\n\nEugenic policies could also lead to loss of genetic diversity, in which case a culturally accepted \"improvement\" of the gene pool could very likely—as evidenced in numerous instances in isolated island populations —result in extinction due to increased vulnerability to disease, reduced ability to adapt to environmental change, and other factors both known and unknown. A long-term, species-wide eugenics plan might lead to a scenario similar to this because the elimination of traits deemed undesirable would reduce genetic diversity by definition.(Galton 2001, 48)\n\nEdward M. Miller claims that, in any one generation, any realistic program should make only minor changes in a fraction of the gene pool, giving plenty of time to reverse direction if unintended consequences emerge, reducing the likelihood of the elimination of desirable genes. Miller also argues that any appreciable reduction in diversity is so far in the future that little concern is needed for now.\n\nWhile the science of genetics has increasingly provided means by which certain characteristics and conditions can be identified and understood, given the complexity of human genetics, culture, and psychology, at this point no agreed objective means of determining which traits might be ultimately desirable or undesirable. Some diseases such as sickle-cell disease and cystic fibrosis respectively confer immunity to malaria and resistance to cholera when a single copy of the recessive allele is contained within the genotype of the individual. Reducing the instance of sickle-cell disease genes in Africa where malaria is a common and deadly disease could indeed have extremely negative net consequences.\n\nHowever, some genetic diseases cause people to consider some elements of eugenics.\n\nEthics\n\nSocietal and political consequences of eugenics call for a place in the discussion on the ethics behind the eugenics movement. Many of the ethical concerns regarding eugenics arise from its controversial past, prompting a discussion on what place, if any, it should have in the future.  Advances in science have changed eugenics. In the past, eugenics had more to do with sterilization and enforced reproduction laws. Now, in the age of a progressively mapped genome, embryos can be tested for susceptibility to disease, gender, and genetic defects, and alternative methods of reproduction such as in vitro fertilization are becoming more common. Therefore, eugenics is no longer ex post facto regulation of the living but instead preemptive action on the unborn.\n\nWith this change, however, there are ethical concerns which lack adequate attention, and which must be addressed before eugenic policies can be properly implemented in the future.  Sterilized individuals, for example, could volunteer for the procedure, albeit under incentive or duress, or at least voice their opinion. The unborn fetus on which these new eugenic procedures are performed cannot speak out, as the fetus lacks the voice to consent or to express his or her opinion. Philosophers disagree about the proper framework for reasoning about such actions, which change the very identity and existence of future persons.\n\nOpposition\n\nA common criticism of eugenics is that \"it inevitably leads to measures that are unethical\".Lynn 2001. The Ethical Principles of Classical Eugenics – Conclusions P. 241 Quote: \"A number of the opponents of eugenics have resorted to the slippery slope argument, which states that although a number of eugenic measures are unobjectionable in themselves, they could lead to further measures that would be unethical. This argument is unpersuasive because all sorts of measures that are acceptable might, if taken to extremes, lead to other measures that are unacceptable.\" Some fear future \"eugenics wars\" as the worst-case scenario: the return of coercive state-sponsored genetic discrimination and human rights violations such as compulsory sterilization of persons with genetic defects, the killing of the institutionalized and, specifically, segregation and genocide of races perceived as inferior. Health law professor George Annas and technology law professor Lori Andrews are prominent advocates of the position that the use of these technologies could lead to such human-posthuman caste warfare.\n\nIn his 2003 book Enough: Staying Human in an Engineered Age, environmental ethicist Bill McKibben argued at length against germinal choice technology and other advanced biotechnological strategies for human enhancement. He writes that it would be morally wrong for humans to tamper with fundamental aspects of themselves (or their children) in an attempt to overcome universal human limitations, such as vulnerability to aging, maximum life span and biological constraints on physical and cognitive ability. Attempts to \"improve\" themselves through such manipulation would remove limitations that provide a necessary context for the experience of meaningful human choice. He claims that human lives would no longer seem meaningful in a world where such limitations could be overcome with technology. Even the goal of using germinal choice technology for clearly therapeutic purposes should be relinquished, since it would inevitably produce temptations to tamper with such things as cognitive capacities. He argues that it is possible for societies to benefit from renouncing particular technologies, using as examples Ming China, Tokugawa Japan and the contemporary Amish.\n\nSupport\n\nSome, for example Nathaniel C. Comfort from Johns Hopkins University, claim that the change from state-led reproductive-genetic decision-making to individual choice has moderated the worst abuses of eugenics by transferring the decision-making from the state to the patient and their family. Comfort suggests that \"the eugenic impulse drives us to eliminate disease, live longer and healthier, with greater intelligence, and a better adjustment to the conditions of society;  and the health benefits, the intellectual thrill and the profits of genetic bio-medicine are too great for us to do otherwise.\" Others, such as bioethicist Stephen Wilkinson of Keele University and Honorary Research Fellow Eve Garrard at the University of Manchester, claim that some aspects of modern genetics can be classified as eugenics, but that this classification does not inherently make modern genetics immoral. In a co-authored publication by Keele University, they stated that \"[e]ugenics doesn't seem always to be immoral, and so the fact that PGD, and other forms of selective reproduction, might sometimes technically be eugenic, isn't sufficient to show that they're wrong.\"\n\nIn their book published in 2000, From Chance to Choice: Genetics and Justice, bioethicists Allen Buchanan, Dan Brock, Norman Daniels and Daniel Wikler argued that liberal societies have an obligation to encourage as wide an adoption of eugenic enhancement technologies as possible (so long as such policies do not infringe on individuals' reproductive rights or exert undue pressures on prospective parents to use these technologies) in order to maximize public health and minimize the inequalities that may result from both natural genetic endowments and unequal access to genetic enhancements.\n\nOriginal position, a hypothetical situation developed by American philosopher John Rawls, has been used as an argument for negative eugenics.Shaw, p. 147. Quote: \"What Rawls says is that \"Over time a society is to take steps to preserve the general level of natural abilities and to prevent the diffusion of serious defects.\" The key words here are \"preserve\" and \"prevent\". Rawls clearly envisages only the use of negative eugenics as a preventative measure to ensure a good basic level of genetic health for future generations. To jump from this to \"make the later generations as genetically talented as possible,\" as Pence does, is a masterpiece of misinterpretation. This, then, is the sixth argument against positive eugenics: the Veil of Ignorance argument. Those behind the Veil in Rawls' Original Position would agree to permit negative, but not positive eugenics. This is a more complex variant of the Consent argument, as the Veil of Ignorance merely forces us to adopt a position of hypotethical consent to particular principles of justice.\". Eugenics. http://en.wikipedia.org/?curid=9737."
  }
}
