{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10243",
  "eid" : "f4811770-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778489959,
  "textBody" : "The Exxon Valdez oil spill occurred in Prince William Sound, Alaska, March 24, 1989, when Exxon Valdez, an oil tanker owned by Exxon Shipping Company, bound for Long Beach, California, struck Prince William Sound's Bligh Reef at 12:04 am local time and spilled  of crude oil over the next few days. It is considered to be one of the most devastating human-caused environmental disasters. The Valdez spill is the second largest in US waters, after the 2010 Deepwater Horizon oil spill, in terms of volume released. Prince William Sound's remote location, accessible only by helicopter, plane, or boat, made government and industry response efforts difficult and severely taxed existing response plans. The region is a habitat for salmon, sea otters, seals and seabirds. The oil, originally extracted at the Prudhoe Bay oil field, eventually covered 1300 mi of coastline, and 11000 sqmi of ocean.\n\nAccording to official reports, the ship was carrying  of oil, of which about  were spilled into the Prince William Sound. An approximate figure of 11 e6USgal was a commonly accepted estimate of the spill's volume and has been used by the State of Alaska's Exxon Valdez Oil Spill Trustee Council, the National Oceanic and Atmospheric Administration and environmental groups such as Greenpeace and the Sierra Club.\n\nMultiple factors have been identified as contributing to the incident:\n\n* Exxon Shipping Company failed to supervise the master and provide a rested and sufficient crew for Exxon Valdez. The NTSB found this was widespread throughout the industry, prompting a safety recommendation to Exxon and to the industry.\n* The third mate failed to properly maneuver the vessel, possibly due to fatigue or excessive workload.\n* Exxon Shipping Company failed to properly maintain the Raytheon Collision Avoidance System (RAYCAS) radar, which, if functional, would have indicated to the third mate an impending collision with the Bligh Reef by detecting the \"radar reflector\", placed on the next rock inland from Bligh Reef for the purpose of keeping ships on course. This cause has only been identified by Greg Palast (without evidentiary support) and is not present in the official accident report.\n\nCaptain Joseph Hazelwood, who was widely reported to have been drinking heavily that night, was not at the controls when the ship struck the reef. However, as the senior officer, he was in command of the ship even though he was asleep in his bunk. In light of the other findings, investigative reporter Greg Palast stated in 2008, \"Forget the drunken skipper fable. As to Captain Joe Hazelwood, he was below decks, sleeping off his bender. At the helm, the third mate never would have collided with Bligh Reef had he looked at his RAYCAS radar. But the radar was not turned on. In fact, the tanker's radar was left broken and disabled for more than a year before the disaster, and Exxon management knew it. It was just too expensive to fix and operate.\" Exxon blamed Captain Hazelwood for the grounding of the tanker.\n\nOther factors, according to an MIT course entitled \"Software System Safety\" by Professor Nancy G. Leveson, included:\n# Ships were not informed that the previous practice of the Coast Guard tracking ships out to Bligh Reef had ceased.\n# The oil industry promised, but never installed, state-of-the-art iceberg monitoring equipment.\n# Exxon Valdez was sailing outside the normal sea lane to avoid small icebergs thought to be in the area.\n\n# The 1989 tanker crew was half the size of the 1977 crew, worked 12- to 14-hour shifts, plus overtime. The crew was rushing to leave Valdez with a load of oil.\n# Coast Guard vessel inspections in Valdez were not performed, and the number of staff was reduced.\n# Lack of available equipment and personnel hampered the spill cleanup.\nThis disaster resulted in International Maritime Organization introducing comprehensive marine pollution prevention rules (MARPOL) through various conventions. The rules were ratified by member countries and, under International Ship Management rules, the ships are being operated with a common objective of \"safer ships and cleaner oceans\".\n\nIn 2009, Exxon Valdez Captain Joseph Hazelwood offered a \"heartfelt apology\" to the people of Alaska, suggesting he had been wrongly blamed for the disaster: \"The true story is out there for anybody who wants to look at the facts, but that's not the sexy story and that's not the easy story,\" he said. Hazelwood said he felt Alaskans always gave him a fair shake.\n\nClean-up and environmental impact \n\nChemical dispersant, a surfactant and solvent mixture, was applied to the slick by a private company on March 24 with a helicopter. But the helicopter missed the target area. Scientific data on its toxicity were either thin or incomplete. In addition, public acceptance of a new, widespread chemical treatment was lacking. Landowners, fishing groups, and conservation organizations questioned the use of chemicals on hundreds of miles of shoreline when other alternatives may have been available.\"http://www.evostc.state.ak.us/static/PDFs/deccleanuptechniques.pdf\n\nAccording to a report by David Kirby for TakePart, the main component of the Corexit formulation used during cleanup, 2-butoxyethanol, was identified as \"one of the agents that caused liver, kidney, lung, nervous system, and blood disorders among cleanup crews in Alaska following the 1989 Exxon Valdez spill.\n\nMechanical cleanup was started shortly afterwards using booms and skimmers, but the skimmers were not readily available during the first 24 hours following the spill, and thick oil and kelp tended to clog the equipment. Despite civilian insistence for a complete clean, only 10% of total oil was actually completely cleaned.  Exxon was widely  criticized for its slow response to cleaning up the disaster and John Devens, the mayor of Valdez, has said his community felt betrayed by Exxon's inadequate response to the crisis. More than 11,000 Alaska residents, along with some Exxon employees, worked throughout the region to try to restore the environment. \n\nBecause Prince William Sound contained many rocky coves where the oil collected, the decision was made to displace it with high-pressure hot water. However, this also displaced and destroyed the microbial populations on the shoreline; many of these organisms (e.g. plankton) are the basis of the coastal marine food chain, and others (e.g. certain bacteria and fungi) are capable of facilitating the biodegradation of oil.  At the time, both scientific advice and public pressure was to clean everything, but since then, a much greater understanding of natural and facilitated remediation processes has developed, due somewhat in part to the opportunity presented for study by the Exxon Valdez spill. Despite the extensive cleanup attempts, less than ten percent of the oil was recovered and a study conducted by NOAA determined that as of early 2007 more than 26 e3U.S.gal of oil remain in the sandy soil of the contaminated shoreline, declining at a rate of less than 4% per year.\n\nBoth the long-term and short-term effects of the oil spill have been studied. Immediate effects included the deaths of 100,000 to as many as 250,000 seabirds, at least 2,800 sea otters, approximately 12 river otters, 300 harbor seals, 247 bald eagles, and 22 orcas, and an unknown number of salmon and herring.\n\nIn 2003, fourteen years after the spill, a team from the University of North Carolina found that the remaining oil was lasting far longer than anticipated, which in turn had resulted in more long-term loss of many species than had been expected.  The researchers found that at only a few parts per billion, polycyclic aromatic hydrocarbons  caused a long-term increase in mortality rates.  They reported that \"species as diverse as sea otters, harlequin ducks and killer whales suffered large, long-term losses and that oiled mussel beds and other tidal shoreline habitats will take an estimated 30 years to recover.\"\n\nIn 2006, a study done by the National Marine Fisheries Service in Juneau found that about 6 mi of shoreline around Prince William Sound was still affected by the spill, with 101.6 tonnes of oil remaining in the area. Exxon Mobil denied any concerns over any remaining oil, stating that they anticipated a remaining fraction that they assert will not cause any long-term ecological impacts, according to the conclusions of the studies they had done: \"We've done 350 peer-reviewed studies of Prince William Sound, and those studies conclude that Prince William Sound has recovered, it's healthy and it's thriving.\" However, in 2007 a  NOAA study concluded that this contamination can produce chronic low-level exposure, discourage subsistence where the contamination is heavy, and decrease the \"wilderness character\" of the area.\n\nThe effects of the spill continued to be felt for many years afterwards. As of 2010 there were an estimated 23000 USgal of Valdez crude oil still in Alaska's sand and soil, breaking down at a rate estimated at less than 4% per year.\n\nOn March 24, 2014, the twenty-fifth anniversary of the spill, NOAA scientists reported that some species seem to have recovered, with the sea otter the latest creature to return to pre-spill numbers.  Scientists who have monitored the spill area for the last 25 years report that concern remains for one of two pods of local orca whales, with fears that one pod may eventually die out.  Federal scientists estimate that between 16,000 and 21,000 US gallons (61 to 79 m3) of oil remains on beaches in Prince William Sound and up to 450 miles (725 km) away. Some of the oil does not appear to have biodegraded at all.  A USGS scientist who analyses the remaining oil along the coastline states that it remains among rocks and between tide marks.  \"The oil mixes with seawater and forms an emulsion...Left out, the surface crusts over but the inside still has the consistency of mayonnaise – or mousse.\"  Alaska state senator Berta Gardner is urging Alaskan politicians to demand that the US government force ExxonMobil  to pay the final $92 million (£57 million) still owed from the court settlement.  The  major part of the money would be spent to finish cleaning up oiled beaches and attempting to restore the crippled herring population.\n\nLitigation and cleanup costs\n\nIn the case of Exxon v. Baker, an Anchorage jury awarded $287 million for actual damages and $5 billion for punitive damages. To protect itself in case the judgment was affirmed, Exxon obtained a $4.8 billion credit line from J.P. Morgan & Co.  J.P. Morgan created the first modern credit default swap in 1994, so that Morgan's would not have to hold as much money in reserve (8% of the loan under Basel I) against the risk of Exxon's default.\n\nMeanwhile, Exxon appealed the ruling, and the 9th U.S. Circuit Court of Appeals ordered the original judge, Russel Holland, to reduce the punitive damages. On December 6, 2002, the judge announced that he had reduced the damages to $4 billion, which he concluded was justified by the facts of the case and was not grossly excessive.  Exxon appealed again and the case returned to court to be considered in light of a recent Supreme Court ruling in a similar case, which caused Judge Holland to increase the punitive damages to $4.5 billion, plus interest.\n\nAfter more appeals, and oral arguments heard by the 9th Circuit Court of Appeals on January 27, 2006, the damages award was cut to $2.5 billion on December 22, 2006. The court cited recent Supreme Court rulings relative to limits on punitive damages.\n\nExxon appealed again. On May 23, 2007, the 9th Circuit Court of Appeals denied ExxonMobil's request for a third hearing and let stand its ruling that Exxon owes $2.5 billion in punitive damages. Exxon then appealed to the Supreme Court, which agreed to hear the case. On February 27, 2008, the Supreme Court heard oral arguments for 90 minutes. Justice Samuel Alito, who at the time, owned between $100,000 and $250,000 in Exxon stock, recused himself from the case. In a decision issued June 25, 2008, Justice David Souter issued the judgment of the court, vacating the $2.5 billion award and remanding the case back to the lower court, finding that the damages were excessive with respect to maritime common law. Exxon's actions were deemed \"worse than negligent but less than malicious.\" The punitive damages were further reduced to an amount of  $507.5 million. The Court's ruling was that maritime punitive damages should not exceed the compensatory damages, supported by a peculiar precedent dating back from 1818. Senate Judiciary Committee Chairman Patrick J. Leahy has decried the ruling as \"another in a line of cases where this Supreme Court has misconstrued congressional intent to benefit large corporations.\"\n\nExxon's official position was that punitive damages greater than $25 million were not justified because the spill resulted from an accident, and because Exxon spent an estimated $2 billion cleaning up the spill and a further $1 billion to settle related civil and criminal charges. Attorneys for the plaintiffs contended that Exxon bore responsibility for the accident because the company \"put a drunk in charge of a tanker in Prince William Sound.\"\n\nExxon recovered a significant portion of clean-up and legal expenses through insurance claims associated with the grounding of the Exxon Valdez. Also, in 1991, Exxon made a quiet, separate financial settlement of damages with a group of seafood producers known as the Seattle Seven for the disaster's effect on the Alaskan seafood industry. The agreement granted $63.75 million to the Seattle Seven, but stipulated that the seafood companies would have to repay almost all of any punitive damages awarded in other civil proceedings. The $5 billion in punitive damages was awarded later, and the Seattle Seven's share could have been as high as $750 million if the damages award had held. Other plaintiffs have objected to this secret arrangement, and when it came to light, Judge Holland ruled that Exxon should have told the jury at the start that an agreement had already been made, so the jury would know exactly how much Exxon would have to pay.\n\nAs of December 15, 2009, Exxon paid all owed $507.5 million punitive damages, including lawsuit costs, plus interest, which were further distributed to thousands of plaintiffs.\n\nIn October 1989, Exxon filed suit against the State of Alaska, charging that the government had interfered with Exxon's attempts to clean up the spill by refusing to approve the use of dispersant chemicals until the night of the 26th. The government disputed the claim, stating that there was a long-standing agreement to allow the use of dispersants to clean up spills, thus Exxon did not require permission to use them, and that in fact Exxon had not had enough dispersant on hand to effectively handle a spill of the size created by the Valdez. Exxon filed claims in October 1990 against the Coast Guard, asking to be reimbursed for cleanup costs and damages awarded to plaintiffs in any lawsuits filed by the State of Alaska or the Federal Government against Exxon. The company claimed that the Coast Guard was \"wholly or partially responsible\" for the spill, because they had granted mariners' licenses to the crew of the Valdez, and because they had given the Valdez permission to leave regular shipping lanes to avoid ice. They also reiterated the claim that the Coast Guard had delayed cleanup by refusing to give permission to use chemical dispersants on the spill immediately.\n\nPolitical consequences and reforms\n\nThe  Oil Spill Recovery Institute was formed after United States Congress approved it to seek a solution. Collaborating with InnoCentive they found a partial solution for the flow of oil.\n\nCoast Guard report\n\nA report by the US National Response Team summarized the event and made a number of recommendations, such as changes to the work patterns of Exxon crew in order to address the causes of the accident.\n\nOil Pollution Act of 1990\n\nIn response to the spill, the United States Congress passed the Oil Pollution Act of 1990 (OPA). The legislation included a clause that prohibits any vessel that, after March 22, 1989, has caused an oil spill of more than 1 e6USgal in any marine area, from operating in Prince William Sound.\n\nIn April 1998, the company argued in a legal action against the Federal government that the ship should be allowed back into Alaskan waters. Exxon claimed OPA was effectively a bill of attainder, a regulation that was unfairly directed at Exxon alone. In 2002, the 9th Circuit Court of Appeals ruled against Exxon. As of 2002, OPA had prevented 18 ships from entering Prince William Sound.\n\nOPA also set a schedule for the gradual phase in of a double hull design, providing an additional layer between the oil tanks and the ocean. While a double hull would likely not have prevented the Valdez disaster, a Coast Guard study estimated that it would have cut the amount of oil spilled by 60 percent.\n\nThe Exxon Valdez supertanker was towed to San Diego, arriving on July 10. Repairs began on July 30. Approximately 1600 ST of steel were removed and replaced. In June 1990 the tanker, renamed S/R Mediterranean, left harbor after $30 million of repairs. It was still sailing as of January 2010, registered in Panama. The vessel was then owned by a Hong Kong company, who operated it under the name Oriental Nicety. In August 2012, it was beached at Alang, India and dismantled.\n\nAlaska regulations\n\nIn the aftermath of the spill, Alaska governor Steve Cowper issued an executive order requiring two tugboats to escort every loaded tanker from Valdez out through Prince William Sound to Hinchinbrook Entrance. As the plan evolved in the 1990s, one of the two routine tugboats was replaced with a 210 ft Escort Response Vehicle (ERV). Tankers at Valdez are no longer single-hulled.  Congress enacted legislation requiring all tankers to be double-hulled as of 2015.\n\nEconomic and personal impact\n\nIn 1991, following the collapse of the local marine population (particularly clams, herring and seals) the Chugach Alaska Corporation, an Alaska Native Corporation, filed for Chapter 11 bankruptcy protection.  It has since recovered.\n\nAccording to several studies funded by the state of Alaska, the spill had both short-term and long-term economic effects. These included the loss of recreational sports, fisheries, reduced tourism, and an estimate of what economists call \"existence value\", which is the value to the public of a pristine Prince William Sound.1994, Victor Goldberg, The Journal of Legal Studies, Recovery for Economic Loss Following the Exxon ‘Valdez’ Oil Spill\"\n\nThe economy of the city of Cordova, Alaska was adversely affected after the spill damaged stocks of salmon and herring in the area. The village of Chenega was transformed into an emergency base and media outlet.The local villagers had to cope with a tripling of their population from 80 to 250. When asked how they felt about the situation, a village councillor noted that they were too shocked and busy to be depressed; others emphasized the human costs of leaving children unattended while their parents worked to clean up. Many Native Americans were worried that too much time was spent on the fishery and not enough on the land that supports subsidence hunting. \n\nIn 2010, a CNN report alleged that many oil spill cleanup workers involved in the Exxon Valdez response had subsequently become sick. Anchorage lawyer Dennis Mestas found that this was true of 6,722 of 11,000 worker files he was able to inspect. Access to the records was controlled by Exxon. Exxon responded in a statement to CNN:   \"After 20 years, there is no evidence suggesting that either cleanup workers or the residents of the communities affected by the Valdez spill have had any adverse health effects as a result of the spill or its cleanup.\"\n\nReactions\n\nIn 1992, Exxon released a video titled Scientists and the Alaska Oil Spill, to be distributed to schools. Dr. Michael Fry called it a piece of \"corporate propaganda\".\n\nIn December 1994, the Unabomber assassinated Burson-Marsteller executive Thomas Mosser, accusing him of having \"helped Exxon clean up its public image after the Exxon Valdez incident\". The PR company claimed not to have been contracted during the actual crisis.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Exxon Valdez oil spill" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10243" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Exxon Valdez oil spill occurred in Prince William Sound, Alaska, March 24, 1989, when Exxon Valdez, an oil tanker owned by Exxon Shipping Company, bound for Long Beach, California, struck Prince William Sound's Bligh Reef at 12:04 am local time and spilled  of crude oil over the next few days. It is considered to be one of the most devastating human-caused environmental disasters. The Valdez spill is the second largest in US waters, after the 2010 Deepwater Horizon oil spill, in terms of volume released. Prince William Sound's remote location, accessible only by helicopter, plane, or boat, made government and industry response efforts difficult and severely taxed existing response plans. The region is a habitat for salmon, sea otters, seals and seabirds. The oil, originally extracted at the Prudhoe Bay oil field, eventually covered 1300 mi of coastline, and 11000 sqmi of ocean.\n\nAccording to official reports, the ship was carrying  of oil, of which about  were spilled into the Prince William Sound. An approximate figure of 11 e6USgal was a commonly accepted estimate of the spill's volume and has been used by the State of Alaska's Exxon Valdez Oil Spill Trustee Council, the National Oceanic and Atmospheric Administration and environmental groups such as Greenpeace and the Sierra Club.\n\nMultiple factors have been identified as contributing to the incident:\n\n* Exxon Shipping Company failed to supervise the master and provide a rested and sufficient crew for Exxon Valdez. The NTSB found this was widespread throughout the industry, prompting a safety recommendation to Exxon and to the industry.\n* The third mate failed to properly maneuver the vessel, possibly due to fatigue or excessive workload.\n* Exxon Shipping Company failed to properly maintain the Raytheon Collision Avoidance System (RAYCAS) radar, which, if functional, would have indicated to the third mate an impending collision with the Bligh Reef by detecting the \"radar reflector\", placed on the next rock inland from Bligh Reef for the purpose of keeping ships on course. This cause has only been identified by Greg Palast (without evidentiary support) and is not present in the official accident report.\n\nCaptain Joseph Hazelwood, who was widely reported to have been drinking heavily that night, was not at the controls when the ship struck the reef. However, as the senior officer, he was in command of the ship even though he was asleep in his bunk. In light of the other findings, investigative reporter Greg Palast stated in 2008, \"Forget the drunken skipper fable. As to Captain Joe Hazelwood, he was below decks, sleeping off his bender. At the helm, the third mate never would have collided with Bligh Reef had he looked at his RAYCAS radar. But the radar was not turned on. In fact, the tanker's radar was left broken and disabled for more than a year before the disaster, and Exxon management knew it. It was just too expensive to fix and operate.\" Exxon blamed Captain Hazelwood for the grounding of the tanker.\n\nOther factors, according to an MIT course entitled \"Software System Safety\" by Professor Nancy G. Leveson, included:\n# Ships were not informed that the previous practice of the Coast Guard tracking ships out to Bligh Reef had ceased.\n# The oil industry promised, but never installed, state-of-the-art iceberg monitoring equipment.\n# Exxon Valdez was sailing outside the normal sea lane to avoid small icebergs thought to be in the area.\n\n# The 1989 tanker crew was half the size of the 1977 crew, worked 12- to 14-hour shifts, plus overtime. The crew was rushing to leave Valdez with a load of oil.\n# Coast Guard vessel inspections in Valdez were not performed, and the number of staff was reduced.\n# Lack of available equipment and personnel hampered the spill cleanup.\nThis disaster resulted in International Maritime Organization introducing comprehensive marine pollution prevention rules (MARPOL) through various conventions. The rules were ratified by member countries and, under International Ship Management rules, the ships are being operated with a common objective of \"safer ships and cleaner oceans\".\n\nIn 2009, Exxon Valdez Captain Joseph Hazelwood offered a \"heartfelt apology\" to the people of Alaska, suggesting he had been wrongly blamed for the disaster: \"The true story is out there for anybody who wants to look at the facts, but that's not the sexy story and that's not the easy story,\" he said. Hazelwood said he felt Alaskans always gave him a fair shake.\n\nClean-up and environmental impact \n\nChemical dispersant, a surfactant and solvent mixture, was applied to the slick by a private company on March 24 with a helicopter. But the helicopter missed the target area. Scientific data on its toxicity were either thin or incomplete. In addition, public acceptance of a new, widespread chemical treatment was lacking. Landowners, fishing groups, and conservation organizations questioned the use of chemicals on hundreds of miles of shoreline when other alternatives may have been available.\"http://www.evostc.state.ak.us/static/PDFs/deccleanuptechniques.pdf\n\nAccording to a report by David Kirby for TakePart, the main component of the Corexit formulation used during cleanup, 2-butoxyethanol, was identified as \"one of the agents that caused liver, kidney, lung, nervous system, and blood disorders among cleanup crews in Alaska following the 1989 Exxon Valdez spill.\n\nMechanical cleanup was started shortly afterwards using booms and skimmers, but the skimmers were not readily available during the first 24 hours following the spill, and thick oil and kelp tended to clog the equipment. Despite civilian insistence for a complete clean, only 10% of total oil was actually completely cleaned.  Exxon was widely  criticized for its slow response to cleaning up the disaster and John Devens, the mayor of Valdez, has said his community felt betrayed by Exxon's inadequate response to the crisis. More than 11,000 Alaska residents, along with some Exxon employees, worked throughout the region to try to restore the environment. \n\nBecause Prince William Sound contained many rocky coves where the oil collected, the decision was made to displace it with high-pressure hot water. However, this also displaced and destroyed the microbial populations on the shoreline; many of these organisms (e.g. plankton) are the basis of the coastal marine food chain, and others (e.g. certain bacteria and fungi) are capable of facilitating the biodegradation of oil.  At the time, both scientific advice and public pressure was to clean everything, but since then, a much greater understanding of natural and facilitated remediation processes has developed, due somewhat in part to the opportunity presented for study by the Exxon Valdez spill. Despite the extensive cleanup attempts, less than ten percent of the oil was recovered and a study conducted by NOAA determined that as of early 2007 more than 26 e3U.S.gal of oil remain in the sandy soil of the contaminated shoreline, declining at a rate of less than 4% per year.\n\nBoth the long-term and short-term effects of the oil spill have been studied. Immediate effects included the deaths of 100,000 to as many as 250,000 seabirds, at least 2,800 sea otters, approximately 12 river otters, 300 harbor seals, 247 bald eagles, and 22 orcas, and an unknown number of salmon and herring.\n\nIn 2003, fourteen years after the spill, a team from the University of North Carolina found that the remaining oil was lasting far longer than anticipated, which in turn had resulted in more long-term loss of many species than had been expected.  The researchers found that at only a few parts per billion, polycyclic aromatic hydrocarbons  caused a long-term increase in mortality rates.  They reported that \"species as diverse as sea otters, harlequin ducks and killer whales suffered large, long-term losses and that oiled mussel beds and other tidal shoreline habitats will take an estimated 30 years to recover.\"\n\nIn 2006, a study done by the National Marine Fisheries Service in Juneau found that about 6 mi of shoreline around Prince William Sound was still affected by the spill, with 101.6 tonnes of oil remaining in the area. Exxon Mobil denied any concerns over any remaining oil, stating that they anticipated a remaining fraction that they assert will not cause any long-term ecological impacts, according to the conclusions of the studies they had done: \"We've done 350 peer-reviewed studies of Prince William Sound, and those studies conclude that Prince William Sound has recovered, it's healthy and it's thriving.\" However, in 2007 a  NOAA study concluded that this contamination can produce chronic low-level exposure, discourage subsistence where the contamination is heavy, and decrease the \"wilderness character\" of the area.\n\nThe effects of the spill continued to be felt for many years afterwards. As of 2010 there were an estimated 23000 USgal of Valdez crude oil still in Alaska's sand and soil, breaking down at a rate estimated at less than 4% per year.\n\nOn March 24, 2014, the twenty-fifth anniversary of the spill, NOAA scientists reported that some species seem to have recovered, with the sea otter the latest creature to return to pre-spill numbers.  Scientists who have monitored the spill area for the last 25 years report that concern remains for one of two pods of local orca whales, with fears that one pod may eventually die out.  Federal scientists estimate that between 16,000 and 21,000 US gallons (61 to 79 m3) of oil remains on beaches in Prince William Sound and up to 450 miles (725 km) away. Some of the oil does not appear to have biodegraded at all.  A USGS scientist who analyses the remaining oil along the coastline states that it remains among rocks and between tide marks.  \"The oil mixes with seawater and forms an emulsion...Left out, the surface crusts over but the inside still has the consistency of mayonnaise – or mousse.\"  Alaska state senator Berta Gardner is urging Alaskan politicians to demand that the US government force ExxonMobil  to pay the final $92 million (£57 million) still owed from the court settlement.  The  major part of the money would be spent to finish cleaning up oiled beaches and attempting to restore the crippled herring population.\n\nLitigation and cleanup costs\n\nIn the case of Exxon v. Baker, an Anchorage jury awarded $287 million for actual damages and $5 billion for punitive damages. To protect itself in case the judgment was affirmed, Exxon obtained a $4.8 billion credit line from J.P. Morgan & Co.  J.P. Morgan created the first modern credit default swap in 1994, so that Morgan's would not have to hold as much money in reserve (8% of the loan under Basel I) against the risk of Exxon's default.\n\nMeanwhile, Exxon appealed the ruling, and the 9th U.S. Circuit Court of Appeals ordered the original judge, Russel Holland, to reduce the punitive damages. On December 6, 2002, the judge announced that he had reduced the damages to $4 billion, which he concluded was justified by the facts of the case and was not grossly excessive.  Exxon appealed again and the case returned to court to be considered in light of a recent Supreme Court ruling in a similar case, which caused Judge Holland to increase the punitive damages to $4.5 billion, plus interest.\n\nAfter more appeals, and oral arguments heard by the 9th Circuit Court of Appeals on January 27, 2006, the damages award was cut to $2.5 billion on December 22, 2006. The court cited recent Supreme Court rulings relative to limits on punitive damages.\n\nExxon appealed again. On May 23, 2007, the 9th Circuit Court of Appeals denied ExxonMobil's request for a third hearing and let stand its ruling that Exxon owes $2.5 billion in punitive damages. Exxon then appealed to the Supreme Court, which agreed to hear the case. On February 27, 2008, the Supreme Court heard oral arguments for 90 minutes. Justice Samuel Alito, who at the time, owned between $100,000 and $250,000 in Exxon stock, recused himself from the case. In a decision issued June 25, 2008, Justice David Souter issued the judgment of the court, vacating the $2.5 billion award and remanding the case back to the lower court, finding that the damages were excessive with respect to maritime common law. Exxon's actions were deemed \"worse than negligent but less than malicious.\" The punitive damages were further reduced to an amount of  $507.5 million. The Court's ruling was that maritime punitive damages should not exceed the compensatory damages, supported by a peculiar precedent dating back from 1818. Senate Judiciary Committee Chairman Patrick J. Leahy has decried the ruling as \"another in a line of cases where this Supreme Court has misconstrued congressional intent to benefit large corporations.\"\n\nExxon's official position was that punitive damages greater than $25 million were not justified because the spill resulted from an accident, and because Exxon spent an estimated $2 billion cleaning up the spill and a further $1 billion to settle related civil and criminal charges. Attorneys for the plaintiffs contended that Exxon bore responsibility for the accident because the company \"put a drunk in charge of a tanker in Prince William Sound.\"\n\nExxon recovered a significant portion of clean-up and legal expenses through insurance claims associated with the grounding of the Exxon Valdez. Also, in 1991, Exxon made a quiet, separate financial settlement of damages with a group of seafood producers known as the Seattle Seven for the disaster's effect on the Alaskan seafood industry. The agreement granted $63.75 million to the Seattle Seven, but stipulated that the seafood companies would have to repay almost all of any punitive damages awarded in other civil proceedings. The $5 billion in punitive damages was awarded later, and the Seattle Seven's share could have been as high as $750 million if the damages award had held. Other plaintiffs have objected to this secret arrangement, and when it came to light, Judge Holland ruled that Exxon should have told the jury at the start that an agreement had already been made, so the jury would know exactly how much Exxon would have to pay.\n\nAs of December 15, 2009, Exxon paid all owed $507.5 million punitive damages, including lawsuit costs, plus interest, which were further distributed to thousands of plaintiffs.\n\nIn October 1989, Exxon filed suit against the State of Alaska, charging that the government had interfered with Exxon's attempts to clean up the spill by refusing to approve the use of dispersant chemicals until the night of the 26th. The government disputed the claim, stating that there was a long-standing agreement to allow the use of dispersants to clean up spills, thus Exxon did not require permission to use them, and that in fact Exxon had not had enough dispersant on hand to effectively handle a spill of the size created by the Valdez. Exxon filed claims in October 1990 against the Coast Guard, asking to be reimbursed for cleanup costs and damages awarded to plaintiffs in any lawsuits filed by the State of Alaska or the Federal Government against Exxon. The company claimed that the Coast Guard was \"wholly or partially responsible\" for the spill, because they had granted mariners' licenses to the crew of the Valdez, and because they had given the Valdez permission to leave regular shipping lanes to avoid ice. They also reiterated the claim that the Coast Guard had delayed cleanup by refusing to give permission to use chemical dispersants on the spill immediately.\n\nPolitical consequences and reforms\n\nThe  Oil Spill Recovery Institute was formed after United States Congress approved it to seek a solution. Collaborating with InnoCentive they found a partial solution for the flow of oil.\n\nCoast Guard report\n\nA report by the US National Response Team summarized the event and made a number of recommendations, such as changes to the work patterns of Exxon crew in order to address the causes of the accident.\n\nOil Pollution Act of 1990\n\nIn response to the spill, the United States Congress passed the Oil Pollution Act of 1990 (OPA). The legislation included a clause that prohibits any vessel that, after March 22, 1989, has caused an oil spill of more than 1 e6USgal in any marine area, from operating in Prince William Sound.\n\nIn April 1998, the company argued in a legal action against the Federal government that the ship should be allowed back into Alaskan waters. Exxon claimed OPA was effectively a bill of attainder, a regulation that was unfairly directed at Exxon alone. In 2002, the 9th Circuit Court of Appeals ruled against Exxon. As of 2002, OPA had prevented 18 ships from entering Prince William Sound.\n\nOPA also set a schedule for the gradual phase in of a double hull design, providing an additional layer between the oil tanks and the ocean. While a double hull would likely not have prevented the Valdez disaster, a Coast Guard study estimated that it would have cut the amount of oil spilled by 60 percent.\n\nThe Exxon Valdez supertanker was towed to San Diego, arriving on July 10. Repairs began on July 30. Approximately 1600 ST of steel were removed and replaced. In June 1990 the tanker, renamed S/R Mediterranean, left harbor after $30 million of repairs. It was still sailing as of January 2010, registered in Panama. The vessel was then owned by a Hong Kong company, who operated it under the name Oriental Nicety. In August 2012, it was beached at Alang, India and dismantled.\n\nAlaska regulations\n\nIn the aftermath of the spill, Alaska governor Steve Cowper issued an executive order requiring two tugboats to escort every loaded tanker from Valdez out through Prince William Sound to Hinchinbrook Entrance. As the plan evolved in the 1990s, one of the two routine tugboats was replaced with a 210 ft Escort Response Vehicle (ERV). Tankers at Valdez are no longer single-hulled.  Congress enacted legislation requiring all tankers to be double-hulled as of 2015.\n\nEconomic and personal impact\n\nIn 1991, following the collapse of the local marine population (particularly clams, herring and seals) the Chugach Alaska Corporation, an Alaska Native Corporation, filed for Chapter 11 bankruptcy protection.  It has since recovered.\n\nAccording to several studies funded by the state of Alaska, the spill had both short-term and long-term economic effects. These included the loss of recreational sports, fisheries, reduced tourism, and an estimate of what economists call \"existence value\", which is the value to the public of a pristine Prince William Sound.1994, Victor Goldberg, The Journal of Legal Studies, Recovery for Economic Loss Following the Exxon ‘Valdez’ Oil Spill\"\n\nThe economy of the city of Cordova, Alaska was adversely affected after the spill damaged stocks of salmon and herring in the area. The village of Chenega was transformed into an emergency base and media outlet.The local villagers had to cope with a tripling of their population from 80 to 250. When asked how they felt about the situation, a village councillor noted that they were too shocked and busy to be depressed; others emphasized the human costs of leaving children unattended while their parents worked to clean up. Many Native Americans were worried that too much time was spent on the fishery and not enough on the land that supports subsidence hunting. \n\nIn 2010, a CNN report alleged that many oil spill cleanup workers involved in the Exxon Valdez response had subsequently become sick. Anchorage lawyer Dennis Mestas found that this was true of 6,722 of 11,000 worker files he was able to inspect. Access to the records was controlled by Exxon. Exxon responded in a statement to CNN:   \"After 20 years, there is no evidence suggesting that either cleanup workers or the residents of the communities affected by the Valdez spill have had any adverse health effects as a result of the spill or its cleanup.\"\n\nReactions\n\nIn 1992, Exxon released a video titled Scientists and the Alaska Oil Spill, to be distributed to schools. Dr. Michael Fry called it a piece of \"corporate propaganda\".\n\nIn December 1994, the Unabomber assassinated Burson-Marsteller executive Thomas Mosser, accusing him of having \"helped Exxon clean up its public image after the Exxon Valdez incident\". The PR company claimed not to have been contracted during the actual crisis. Exxon Valdez oil spill. http://en.wikipedia.org/?curid=10243."
  }
}
