{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7689",
  "eid" : "e2d77460-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778460326,
  "textBody" : "The Cirth (; plural of certh, in Sindarin meaning runes) are a semi-artificial script, with letters shaped on those of actual runic alphabets, invented by J. R. R. Tolkien for the constructed languages he devised and used in his works. Cirth is written with a capital letter when referring to the writing system; the runes themselves can be called cirth.\n\nIn the fictional history of Middle-earth, the original Certhas Daeron was created by the elf Daeron, and was later expanded into what was known as the Angerthas Daeron. Although the Cirth were later largely replaced by the Tengwar, they were adopted by Dwarves to write down their Khuzdul language (Angerthas Moria and Angerthas Erebor) because their straight lines were better suited to carving than the curved strokes of the Tengwar. Cirth was also adapted, in its oldest and simplest form, by various peoples including Men and even Orcs.\n\nEarliest Cirth\n\nDuring the Chaining of Melkor, the Sindar of Beleriand began developing an alphabet for their language. Its letters were entirely made for carving on wood, stone or metal, hence their angular forms and straight lines. These letters were named cirth (sing. certh). The corresponding Quenya words are certar and certa. The assignment of values was unsystematic. The form of a certh consisted of a stem and a branch. The attachment of the branch was, if on one side only, usually made on the right side. The reverse was not infrequent, but had no phonetic significance.Two basic principles were followed:\n* adding a stroke to a branch added voice;\n* placing the branch on both sides of the stem added voice and nasality.\nThe original display of Cirth should have been this:\n\nNotes on Earliest Cirth\n\n# The original value of this certh wasn't given by Tolkien, but he mentions that it took the value \"hw\" after  became \"m\" while he doesn't give us the early certh for \"m\". We can infer that this was the certh for \"m\" judging by both its 'labial' shape, and the symmetrical shape used for nasals.\n# This certh will later have the value \"m\". Its original value can't be guessed, but judging from the 'labial' shape, it could be \"w\".\n# The sound of these cirth was interchangeable.\n# This certh will later have the value \"ss\". It must have had another unknown value before.\n\nThe known ancient cirth don't cover all the sounds of Sindarin, since we are missing \"rh\", \"lh\", \"mh\", \"y\", \"œ\". Perhaps they were used for the Old Sindarin tongue, and many of the above-mentioned sounds indeed didn't exist in that language. However still frequent sounds \"w\" and \"a\" are missing. This indicates that some ancient, unknown cirth could have existed, but didn't make it to the later systems; a fuller table therefore can't be reconstructed.As for the vowel usage, perhaps the certh for \"u\" possibly was used for \"w\" (like in early Latin orthography). The certh for \"a\" can't be guessed, so maybe this sound was meant (like in some Tengwar Modes for Quenya). More possibly it was one of some other cirth that did not survive.Long vowels were evidently indicated by doubling.[http://tolkiengateway.net/wiki/Cirth#Structure \"Structure\"] on Tolkien Gateway wiki.\n\nCerthas Daeron\n\nThe elf Daeron, minstrel of king Thingol of Doriath reorganised the cirth and added new ones, being somehow inspired by Fëanor's Tengwar (therefore this mustn't have occurred before the return of the Noldor) and made the extension of the cirth known as Certhas Daeron (where \"Certhas\" means \"runic alphabet\"[http://www.tolkiengateway.net/wiki/Certhas \"Certhas\"] on Tolkien Gateway wiki.), used for inscribing names in Menegroth. The Dwarves working for Thingol liked them and adopted them, making them known also in the East.Unlike the previous system, the reversal of the certh had a phonemic significance: reversed cirth were softer versions of their originals. This also gives us another information: perhaps lenited consonants must have started to occur in Sindarin around that time.We know that at one time a sign for the sound \"mh\" was needed and the most appropriate solution was to revert the certh for \"m\" to indicate its softening, but it could not be reverted (); therefore \"m\" was given to the reversible  (which until then had a value unknown to us), \"mh\" to , and the certh  got the value of \"hw\".[http://tolkiengateway.net/wiki/Certhas_Daeron \"Certhas Daeron\"] on Tolkien Gateway wiki.\n\nAngerthas Daeron\n\nDaeron's alphabet was originally used by the Grey Elves (Sindar) in Beleriand. Later the Noldor in Eregion adopted the Cirth, added several more runes to the system and created the Angerthas Daeron (where \"Angerthas\" means \"long rune-rows\"[http://www.tolkiengateway.net/wiki/Angerthas \"Angerthas\"] on Tolkien Gateway wiki.) sometimes also referred to as Angerthas Eregion. These additional letters were used to represent sounds not found in Sindarin, but present in the tongues of other peoples. The Angerthas Daeron was used primarily for carved inscriptions. For most other forms of written communication the Tengwar were used.Here the Cirth are grouped according to their phonetic features:\n* the cirth #1–7 are labial consonants;\n* the cirth #8–12 are dental consonants;\n* the cirth #13–17 are palatal consonants and are inventions of the Noldor;\n* the cirth #18–22;33 are velar consonants;\n* the cirth #23–28 are labialized consonants, introduced by the Noldor;\n* the cirth #29–32 are liquid consonants;\n* the cirth #34–36 are hissing sibilants;\n* the cirth #39;42–52 are vowels and semi-vowels.\n\nNotes on Angerthas Daeron\n\n# The certh  (previously used for) was chosen for \"ch\", as its shape looked intermediate between the cirth  and , and it occurred phonologically between sounds and. This should not be confused with Sindarin  pronounced and here transliterated with \"kh\".\n# Tolkien gives the value to this certh (maybe in alien systems), but notes it was when used in Quenya and Sindarin.\n# This new certh was made for the value of, similar in shape to the former  (and to the tengwa hyarmen).\n\nFor the transliteration of this alphabet, meant to be used for more than one language (for Quenya and Sindarin, at least) and needing a bigger set of sounds, Tolkien thought up to a kind of general Middle-earth languages phonetic transcription, here used.\n\nAngerthas Moria\n\nDwarves first came to know the runes of the Noldor during the beginning of the Second Age. They modified them to suit the specific needs of their language, Khuzdul. The Dwarves spread their revised alphabet to Moria, where it came to be known as Angerthas Moria. The Dwarves developed both carved and pen-written forms of the runes. Travelling for trading, they spread their alphabet throughout Middle-earth: as a result, variations of Angerthas Moria were employed by other races for their languages.\n\nMany cirth here stand for sounds not occurring in Khuzdul (at least in published words of Khuzdul: of course, our corpus is very limited to judge the necessity or not, of these sounds). Here they are marked with a black star (★).\n\nNotes on Angerthas Moria\n\n# The Dwarves had two glottal consonants: and, the latter being the glottal beginning of a word with an initial vowel. Thus, in need of a reversible cirth to represent these sounds, they switched  and , giving the first the value and using the second for and its reversed counterpart  for.\n# These cirth where a halved form of , used for vowels like those in the word \"butter\".  represented a schwa sound in unstressed syllables, while  represented, a sound similar to the schwa, only in stressed syllables. When weak they were reduced to a stroke without a stem (, ).\n# This sign is to denote aspiration in voiceless stops, occurring frequently in Khuzdul.\n\n* For unknown reasons, the Dwarves also dropped the cirth ,  and for those sounds they substituted  and  which the Elves used for and.\n* Subsequently, the Dwarves used  for which had the value of by the Elves; then for the sound of, they chose the certh  which the Elves used for the sound, useless in Khuzdul.\n* They also invented the new certh , used as an alternative, simplified (and, maybe, weaker) form of . Inspired by the visual relation of those two letters, they gave  the value of to relate better with  that had, by then, the value.[http://tolkiengateway.net/wiki/Angerthas_Moria \"Angerthas Moria\"] on Tolkien Gateway wiki.\n\nAngerthas Erebor\n\nAccording to Tolkien's legendarium, after the Second Age, the Cirth were obsoleted by the Tengwar among the western races and remained in use only by Dwarves and Men. The Dwarves developed even pen-written cursive forms, since they used them exclusively in any form of writing communication, even in paper. At the beginning of the Third Age, the Dwarves were driven out of Moria. Some migrated to the Grey Mountains, some to the Iron Hills and Thráin I came to Erebor. There he founded his Dwarf-kingdom. There the Angerthas Moria was modified further and some new cirth were added, but some reverted to their Elvish usage, thus creating the Angerthas Erebor variation. This mode was used in Westron by Dwarves.[http://tolkiengateway.net/wiki/Angerthas_Erebor \"Angerthas Erebor\"] on Tolkien Gateway wiki.\n\nMany cirth here stand for sounds not occurring in Khuzdul (at least in published words of Khuzdul: of course, our corpus is very limited to judge the necessity or not, of these sounds). Here they are marked with a black star (★).\n\nCombining diacritics occur in Angerthas Erebor as well: a circumflex  used to denote long consonants, a macron below  to indicate a long vowel sound, and an underdot  to mark cirth used as numerals1.\n\n# On Tolkien's replica pages of the Book of Mazarbul some cirth are also used as numerals:  for 1,  for 2,  for 3,  for 4,  for 5.\n\nUse for English\n\nTolkien used Angerthas Erebor mode to write English with Cirth at least twice in The Lord of the Rings:\n* in the upper inscription of the title page, where it reads \"[dh]ə·​lord·​ov·​[dh]ə·​riŋs·​translatᵊd·​from·​[dh]ə·​Red Book of Westmarch|red·​b[oo]k\" (the sentence follows in the bottom inscription, written in Tengwar: \"of Westmarch by John Ronald Reuel Tolkien. Herein is set forth/the history of the War of the Ring and the Return of the King as seen by the Hobbits.\");\n* in the bottom inscription of Balin's tomb, being the translation of the upper inscription, written in Khuzdul using Angerthas Moria mode.\n\nThe Book of Mazarbul shows that additional cirth were introduced in this mode (for a double  ligature, for the definite article and for the representation of six diphthongs). These were probably only to be used with English language:\n\nAdditionally,  is used for English  and  for .\n\nOther Middle-Earth runes\n\nThe Cirth is not the only runic writing system devised by Tolkien for Middle Earth. In fact, he invented a great number of runic alphabets, of which only a few others have been published. Many of them were included in the \"Appendix on Runes\" in The History of Middle-Earth, vol. VII, The Treason of Isengard, edited by Christopher Tolkien.\n\nRunes from The Hobbit\n\nAccording to Tolkien, the earliest Cirth became known to many peoples of Middle-earth like Men, Dwarves or Orcs. The people of Dale and the Rohirrim maintained a simple form of these characters — hence the \"branching runes\" that appear on the stone floor of the Meduseld in Rohan.\n\nIt is speculated that the runes used in The Hobbit are indeed the form of Cirth used by the Men of Dale, although Tolkien himself wrote that the letters used for Thror's Map are a form of our ancient runes used to transliterate actual Dwarf-runes.\n\nThese runes – used only to write in English – are indeed nearly identical to those of Fuþorc but their sound may change according to their position, just as the Latin letters do. And, in fact, Tolkien's writing mode for these runes is mainly orthographic.\nIt has one rune for each letter, regardless of pronunciation (for example the rune  can sound in the word  or in the word  or even in the word  and in the digraph ).\nA few sounds are instead written with the same rune regardless of the letter (e.g. the sound is always written with the rune  either if in English it is written  as in ,  as in , or  as in ). The letters that are subject to this phonemic spelling are  and .\nIn addition, there are also some runes which stand for particular English digraphs and diphthongs.\n\nHere the runes used in The Hobbit are represented along with their English transliteration and Fuþorc equivalent:\n\nTwo other runes, not attested in The Hobbit, were added by Tolkien in order to represent additional English sounds:\n\n* The runes marked with an asterisk are not attested in real-life fuþorc. These are completely new characters invented by Tolkien himself. These were included in Unicode 7.0 (see below).\n\nNotes\n\nIt must be noticed that Tolkien always wrote the English digraph  (representing the sound, or, like in ) in runes as .\nThere is no rune to transliterate : the digraph  (representing the sound, like in ) is always rendered in runes as .\n\nThis table could be helpful for the transcription of  and  in runes:[http://www.forodrim.org/daeron/runes-eng.pdf \"Tolkien English Runes\"]\n\nGondolinic Runes\n\nNot all the runes mentioned in The Hobbit are Dwarf-runes. The swords found in the Trolls' cave (which were from the ancient kingdom of Gondolin) bore runes that Gandalf could not read. In fact, the swords Glamdring and Orcrist, forged in Gondolin,  bore a type of letters known as Gondolinic runes. They seem to have been obsoleted and forgotten by the Third Age, and this is supported by the fact that only Elrond could read the inscriptions of the swords.\nTolkien devised this runic alphabet in a very early stage of his shaping of Middle-earth, but they are known to us only from a slip of paper written by J.R.R. Tolkien, a photocopy of which Christopher Tolkien sent to Paul Nolan Hyde in February 1992, who published it, together with an extensive analysis, in the 1992 Summer issue of Mythlore, no. 69.http://www.mythsoc.org/mythlore/mythlore-69.htmhttp://www.oocities.org/tyalie/runegond.html\nThe system provides sounds not found in the known Elven languages of the First Age, but perhaps it was designed for notating a variety of languages. However, the consonants seem to be, more or less, the same found in Welsh phonology, a theory supported by the fact that Tolkien was heavily influenced by Welsh when creating Elven languages.[http://www.bbc.com/news/uk-wales-south-east-wales-13472344 BBC article] on Tolkien's Welsh influences.\n\nConcept and creation\n\nMany letters have shapes also found in the historical runic alphabets, but their sound values are only similar in a few of the vowels. Rather, the system of assignment of sound values is much more systematic in the Cirth than in the historical runes (e.g., voiced variants of a voiceless sound are expressed by an additional stroke). A similar system has been proposed for a few historical runes but is in any case much more obscure.[http://tolkiengateway.net/wiki/Cirth#Inspiration \"Inspiration\"] on Tolkien Gateway wiki.\n\nThe division between the older Cirth of Daeron and their adaptation by Dwarves and Men has been interpreted as a parallel drawn by Tolkien to the development of the Fuþorc to the Younger Fuþark. The original Elvish Cirth \"as supposed products of a superior culture\" are focused on logical arrangement and a close connection between form and value whereas the adaptations by mortal races introduced irregularities. Similar to the Germanic tribes who had no written literature and used only simple runes before their conversion to Christianity, the Sindar Elves of Beleriand with their Cirth were introduced to the more elaborate Tengwar of Fëanor when the Noldor Elves returned to Middle-earth from the lands of the divine Valar.\n\nUnicode\n\nEquivalents for most but not all cirth can be found in the Runic block of Unicode.\n\nThree J. R. R. Tolkien-specific letters were added in June, 2014 with the release of Unicode 7.0:\n\n*\n*\n*\n\nA formal Unicode proposal to encode Cirth as a separate script was made in September 1997 by Michael Everson.\nNo action was taken by the Unicode Technical Committee (UTC) but Cirth appears in the Roadmap to the SMP.\n\nConScript Unicode Registry\n\nUnicode Private Use Area layouts for Cirth are defined at the ConScript Unicode Registry (CSUR) and the Under-ConScript Unicode Registry (UCSUR).\n\nTwo different layouts are defined by the CSUR/UCSUR:\n* 1997-11-03 proposal implemented by fonts like GNU Unifont and Code2000.\n* 2000-04-22 discussion paper implemented by fonts like Constructium and Fairfax.\n\nWithout proper rendering support, you may see question marks, boxes, or other symbols below instead of Cirth.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Cirth" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7689" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Cirth (; plural of certh, in Sindarin meaning runes) are a semi-artificial script, with letters shaped on those of actual runic alphabets, invented by J. R. R. Tolkien for the constructed languages he devised and used in his works. Cirth is written with a capital letter when referring to the writing system; the runes themselves can be called cirth.\n\nIn the fictional history of Middle-earth, the original Certhas Daeron was created by the elf Daeron, and was later expanded into what was known as the Angerthas Daeron. Although the Cirth were later largely replaced by the Tengwar, they were adopted by Dwarves to write down their Khuzdul language (Angerthas Moria and Angerthas Erebor) because their straight lines were better suited to carving than the curved strokes of the Tengwar. Cirth was also adapted, in its oldest and simplest form, by various peoples including Men and even Orcs.\n\nEarliest Cirth\n\nDuring the Chaining of Melkor, the Sindar of Beleriand began developing an alphabet for their language. Its letters were entirely made for carving on wood, stone or metal, hence their angular forms and straight lines. These letters were named cirth (sing. certh). The corresponding Quenya words are certar and certa. The assignment of values was unsystematic. The form of a certh consisted of a stem and a branch. The attachment of the branch was, if on one side only, usually made on the right side. The reverse was not infrequent, but had no phonetic significance.Two basic principles were followed:\n* adding a stroke to a branch added voice;\n* placing the branch on both sides of the stem added voice and nasality.\nThe original display of Cirth should have been this:\n\nNotes on Earliest Cirth\n\n# The original value of this certh wasn't given by Tolkien, but he mentions that it took the value \"hw\" after  became \"m\" while he doesn't give us the early certh for \"m\". We can infer that this was the certh for \"m\" judging by both its 'labial' shape, and the symmetrical shape used for nasals.\n# This certh will later have the value \"m\". Its original value can't be guessed, but judging from the 'labial' shape, it could be \"w\".\n# The sound of these cirth was interchangeable.\n# This certh will later have the value \"ss\". It must have had another unknown value before.\n\nThe known ancient cirth don't cover all the sounds of Sindarin, since we are missing \"rh\", \"lh\", \"mh\", \"y\", \"œ\". Perhaps they were used for the Old Sindarin tongue, and many of the above-mentioned sounds indeed didn't exist in that language. However still frequent sounds \"w\" and \"a\" are missing. This indicates that some ancient, unknown cirth could have existed, but didn't make it to the later systems; a fuller table therefore can't be reconstructed.As for the vowel usage, perhaps the certh for \"u\" possibly was used for \"w\" (like in early Latin orthography). The certh for \"a\" can't be guessed, so maybe this sound was meant (like in some Tengwar Modes for Quenya). More possibly it was one of some other cirth that did not survive.Long vowels were evidently indicated by doubling.[http://tolkiengateway.net/wiki/Cirth#Structure \"Structure\"] on Tolkien Gateway wiki.\n\nCerthas Daeron\n\nThe elf Daeron, minstrel of king Thingol of Doriath reorganised the cirth and added new ones, being somehow inspired by Fëanor's Tengwar (therefore this mustn't have occurred before the return of the Noldor) and made the extension of the cirth known as Certhas Daeron (where \"Certhas\" means \"runic alphabet\"[http://www.tolkiengateway.net/wiki/Certhas \"Certhas\"] on Tolkien Gateway wiki.), used for inscribing names in Menegroth. The Dwarves working for Thingol liked them and adopted them, making them known also in the East.Unlike the previous system, the reversal of the certh had a phonemic significance: reversed cirth were softer versions of their originals. This also gives us another information: perhaps lenited consonants must have started to occur in Sindarin around that time.We know that at one time a sign for the sound \"mh\" was needed and the most appropriate solution was to revert the certh for \"m\" to indicate its softening, but it could not be reverted (); therefore \"m\" was given to the reversible  (which until then had a value unknown to us), \"mh\" to , and the certh  got the value of \"hw\".[http://tolkiengateway.net/wiki/Certhas_Daeron \"Certhas Daeron\"] on Tolkien Gateway wiki.\n\nAngerthas Daeron\n\nDaeron's alphabet was originally used by the Grey Elves (Sindar) in Beleriand. Later the Noldor in Eregion adopted the Cirth, added several more runes to the system and created the Angerthas Daeron (where \"Angerthas\" means \"long rune-rows\"[http://www.tolkiengateway.net/wiki/Angerthas \"Angerthas\"] on Tolkien Gateway wiki.) sometimes also referred to as Angerthas Eregion. These additional letters were used to represent sounds not found in Sindarin, but present in the tongues of other peoples. The Angerthas Daeron was used primarily for carved inscriptions. For most other forms of written communication the Tengwar were used.Here the Cirth are grouped according to their phonetic features:\n* the cirth #1–7 are labial consonants;\n* the cirth #8–12 are dental consonants;\n* the cirth #13–17 are palatal consonants and are inventions of the Noldor;\n* the cirth #18–22;33 are velar consonants;\n* the cirth #23–28 are labialized consonants, introduced by the Noldor;\n* the cirth #29–32 are liquid consonants;\n* the cirth #34–36 are hissing sibilants;\n* the cirth #39;42–52 are vowels and semi-vowels.\n\nNotes on Angerthas Daeron\n\n# The certh  (previously used for) was chosen for \"ch\", as its shape looked intermediate between the cirth  and , and it occurred phonologically between sounds and. This should not be confused with Sindarin  pronounced and here transliterated with \"kh\".\n# Tolkien gives the value to this certh (maybe in alien systems), but notes it was when used in Quenya and Sindarin.\n# This new certh was made for the value of, similar in shape to the former  (and to the tengwa hyarmen).\n\nFor the transliteration of this alphabet, meant to be used for more than one language (for Quenya and Sindarin, at least) and needing a bigger set of sounds, Tolkien thought up to a kind of general Middle-earth languages phonetic transcription, here used.\n\nAngerthas Moria\n\nDwarves first came to know the runes of the Noldor during the beginning of the Second Age. They modified them to suit the specific needs of their language, Khuzdul. The Dwarves spread their revised alphabet to Moria, where it came to be known as Angerthas Moria. The Dwarves developed both carved and pen-written forms of the runes. Travelling for trading, they spread their alphabet throughout Middle-earth: as a result, variations of Angerthas Moria were employed by other races for their languages.\n\nMany cirth here stand for sounds not occurring in Khuzdul (at least in published words of Khuzdul: of course, our corpus is very limited to judge the necessity or not, of these sounds). Here they are marked with a black star (★).\n\nNotes on Angerthas Moria\n\n# The Dwarves had two glottal consonants: and, the latter being the glottal beginning of a word with an initial vowel. Thus, in need of a reversible cirth to represent these sounds, they switched  and , giving the first the value and using the second for and its reversed counterpart  for.\n# These cirth where a halved form of , used for vowels like those in the word \"butter\".  represented a schwa sound in unstressed syllables, while  represented, a sound similar to the schwa, only in stressed syllables. When weak they were reduced to a stroke without a stem (, ).\n# This sign is to denote aspiration in voiceless stops, occurring frequently in Khuzdul.\n\n* For unknown reasons, the Dwarves also dropped the cirth ,  and for those sounds they substituted  and  which the Elves used for and.\n* Subsequently, the Dwarves used  for which had the value of by the Elves; then for the sound of, they chose the certh  which the Elves used for the sound, useless in Khuzdul.\n* They also invented the new certh , used as an alternative, simplified (and, maybe, weaker) form of . Inspired by the visual relation of those two letters, they gave  the value of to relate better with  that had, by then, the value.[http://tolkiengateway.net/wiki/Angerthas_Moria \"Angerthas Moria\"] on Tolkien Gateway wiki.\n\nAngerthas Erebor\n\nAccording to Tolkien's legendarium, after the Second Age, the Cirth were obsoleted by the Tengwar among the western races and remained in use only by Dwarves and Men. The Dwarves developed even pen-written cursive forms, since they used them exclusively in any form of writing communication, even in paper. At the beginning of the Third Age, the Dwarves were driven out of Moria. Some migrated to the Grey Mountains, some to the Iron Hills and Thráin I came to Erebor. There he founded his Dwarf-kingdom. There the Angerthas Moria was modified further and some new cirth were added, but some reverted to their Elvish usage, thus creating the Angerthas Erebor variation. This mode was used in Westron by Dwarves.[http://tolkiengateway.net/wiki/Angerthas_Erebor \"Angerthas Erebor\"] on Tolkien Gateway wiki.\n\nMany cirth here stand for sounds not occurring in Khuzdul (at least in published words of Khuzdul: of course, our corpus is very limited to judge the necessity or not, of these sounds). Here they are marked with a black star (★).\n\nCombining diacritics occur in Angerthas Erebor as well: a circumflex  used to denote long consonants, a macron below  to indicate a long vowel sound, and an underdot  to mark cirth used as numerals1.\n\n# On Tolkien's replica pages of the Book of Mazarbul some cirth are also used as numerals:  for 1,  for 2,  for 3,  for 4,  for 5.\n\nUse for English\n\nTolkien used Angerthas Erebor mode to write English with Cirth at least twice in The Lord of the Rings:\n* in the upper inscription of the title page, where it reads \"[dh]ə·​lord·​ov·​[dh]ə·​riŋs·​translatᵊd·​from·​[dh]ə·​Red Book of Westmarch|red·​b[oo]k\" (the sentence follows in the bottom inscription, written in Tengwar: \"of Westmarch by John Ronald Reuel Tolkien. Herein is set forth/the history of the War of the Ring and the Return of the King as seen by the Hobbits.\");\n* in the bottom inscription of Balin's tomb, being the translation of the upper inscription, written in Khuzdul using Angerthas Moria mode.\n\nThe Book of Mazarbul shows that additional cirth were introduced in this mode (for a double  ligature, for the definite article and for the representation of six diphthongs). These were probably only to be used with English language:\n\nAdditionally,  is used for English  and  for .\n\nOther Middle-Earth runes\n\nThe Cirth is not the only runic writing system devised by Tolkien for Middle Earth. In fact, he invented a great number of runic alphabets, of which only a few others have been published. Many of them were included in the \"Appendix on Runes\" in The History of Middle-Earth, vol. VII, The Treason of Isengard, edited by Christopher Tolkien.\n\nRunes from The Hobbit\n\nAccording to Tolkien, the earliest Cirth became known to many peoples of Middle-earth like Men, Dwarves or Orcs. The people of Dale and the Rohirrim maintained a simple form of these characters — hence the \"branching runes\" that appear on the stone floor of the Meduseld in Rohan.\n\nIt is speculated that the runes used in The Hobbit are indeed the form of Cirth used by the Men of Dale, although Tolkien himself wrote that the letters used for Thror's Map are a form of our ancient runes used to transliterate actual Dwarf-runes.\n\nThese runes – used only to write in English – are indeed nearly identical to those of Fuþorc but their sound may change according to their position, just as the Latin letters do. And, in fact, Tolkien's writing mode for these runes is mainly orthographic.\nIt has one rune for each letter, regardless of pronunciation (for example the rune  can sound in the word  or in the word  or even in the word  and in the digraph ).\nA few sounds are instead written with the same rune regardless of the letter (e.g. the sound is always written with the rune  either if in English it is written  as in ,  as in , or  as in ). The letters that are subject to this phonemic spelling are  and .\nIn addition, there are also some runes which stand for particular English digraphs and diphthongs.\n\nHere the runes used in The Hobbit are represented along with their English transliteration and Fuþorc equivalent:\n\nTwo other runes, not attested in The Hobbit, were added by Tolkien in order to represent additional English sounds:\n\n* The runes marked with an asterisk are not attested in real-life fuþorc. These are completely new characters invented by Tolkien himself. These were included in Unicode 7.0 (see below).\n\nNotes\n\nIt must be noticed that Tolkien always wrote the English digraph  (representing the sound, or, like in ) in runes as .\nThere is no rune to transliterate : the digraph  (representing the sound, like in ) is always rendered in runes as .\n\nThis table could be helpful for the transcription of  and  in runes:[http://www.forodrim.org/daeron/runes-eng.pdf \"Tolkien English Runes\"]\n\nGondolinic Runes\n\nNot all the runes mentioned in The Hobbit are Dwarf-runes. The swords found in the Trolls' cave (which were from the ancient kingdom of Gondolin) bore runes that Gandalf could not read. In fact, the swords Glamdring and Orcrist, forged in Gondolin,  bore a type of letters known as Gondolinic runes. They seem to have been obsoleted and forgotten by the Third Age, and this is supported by the fact that only Elrond could read the inscriptions of the swords.\nTolkien devised this runic alphabet in a very early stage of his shaping of Middle-earth, but they are known to us only from a slip of paper written by J.R.R. Tolkien, a photocopy of which Christopher Tolkien sent to Paul Nolan Hyde in February 1992, who published it, together with an extensive analysis, in the 1992 Summer issue of Mythlore, no. 69.http://www.mythsoc.org/mythlore/mythlore-69.htmhttp://www.oocities.org/tyalie/runegond.html\nThe system provides sounds not found in the known Elven languages of the First Age, but perhaps it was designed for notating a variety of languages. However, the consonants seem to be, more or less, the same found in Welsh phonology, a theory supported by the fact that Tolkien was heavily influenced by Welsh when creating Elven languages.[http://www.bbc.com/news/uk-wales-south-east-wales-13472344 BBC article] on Tolkien's Welsh influences.\n\nConcept and creation\n\nMany letters have shapes also found in the historical runic alphabets, but their sound values are only similar in a few of the vowels. Rather, the system of assignment of sound values is much more systematic in the Cirth than in the historical runes (e.g., voiced variants of a voiceless sound are expressed by an additional stroke). A similar system has been proposed for a few historical runes but is in any case much more obscure.[http://tolkiengateway.net/wiki/Cirth#Inspiration \"Inspiration\"] on Tolkien Gateway wiki.\n\nThe division between the older Cirth of Daeron and their adaptation by Dwarves and Men has been interpreted as a parallel drawn by Tolkien to the development of the Fuþorc to the Younger Fuþark. The original Elvish Cirth \"as supposed products of a superior culture\" are focused on logical arrangement and a close connection between form and value whereas the adaptations by mortal races introduced irregularities. Similar to the Germanic tribes who had no written literature and used only simple runes before their conversion to Christianity, the Sindar Elves of Beleriand with their Cirth were introduced to the more elaborate Tengwar of Fëanor when the Noldor Elves returned to Middle-earth from the lands of the divine Valar.\n\nUnicode\n\nEquivalents for most but not all cirth can be found in the Runic block of Unicode.\n\nThree J. R. R. Tolkien-specific letters were added in June, 2014 with the release of Unicode 7.0:\n\n*\n*\n*\n\nA formal Unicode proposal to encode Cirth as a separate script was made in September 1997 by Michael Everson.\nNo action was taken by the Unicode Technical Committee (UTC) but Cirth appears in the Roadmap to the SMP.\n\nConScript Unicode Registry\n\nUnicode Private Use Area layouts for Cirth are defined at the ConScript Unicode Registry (CSUR) and the Under-ConScript Unicode Registry (UCSUR).\n\nTwo different layouts are defined by the CSUR/UCSUR:\n* 1997-11-03 proposal implemented by fonts like GNU Unifont and Code2000.\n* 2000-04-22 discussion paper implemented by fonts like Constructium and Fairfax.\n\nWithout proper rendering support, you may see question marks, boxes, or other symbols below instead of Cirth. Cirth. http://en.wikipedia.org/?curid=7689."
  }
}
