{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11253",
  "eid" : "fab735c0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778500380,
  "textBody" : "Dr. Fu Manchu is a fictional villain character introduced in a series of novels by British author Sax Rohmer during the first half of the twentieth century. The character was also featured extensively in cinema, television, radio, comic strips, and comic books for over 90 years, and has become an archetype of the evil criminal genius and mad scientist, while lending the name to the Fu Manchu moustache.\n\nCharacters\n\nDr. Fu Manchu\n\nSupervillain Fu Manchu's murderous plots are marked by the extensive use of arcane methods; he disdains guns or explosives, preferring dacoits, thuggees, and members of other secret societies as his agents armed with knives, or using \"pythons and cobras ... fungi and my tiny allies, the bacilli ... my black spiders\" and other peculiar animals or natural chemical weapons.\n\nIn the 1933 novel, The Bride of Fu Manchu, Fu Manchu claims to hold doctorates from four Western universities. In the 1959 novel, Emperor Fu Manchu, he reveals he attended Heidelberg University, the Sorbonne, and the University of Edinburgh (in the film The Mask of Fu Manchu, on the other hand, he states proudly that \"I am a doctor of philosophy from Edinburgh, a doctor of law from Christ's College, a doctor of medicine from Harvard. My friends, out of courtesy, call me 'Doctor'\"). At the time of their first encounter (1911), Dr. Petrie believed that Fu Manchu was around 70 years old. This would have placed Fu Manchu in the West studying for his first doctorate in the 1860s or 1870s.\n\nAccording to Cay Van Ash, Rohmer's biographer and former assistant who became the first author to continue the series after Rohmer's death, \"Fu Manchu\" was a title of honour, which meant \"the Warlike Manchu\". Van Ash speculates that Fu Manchu had been a member of the imperial family of China who backed the losing side in the Boxer Rebellion. In the earliest books, Fu Manchu is an agent of the secret society, the Si-Fan, and acts as the mastermind behind a wave of assassinations targeting Western imperialists. In later books, he vies for control of the Si-Fan, which is more concerned with routing fascist dictators and halting the spread of communism. The Si-Fan is largely funded through criminal activities, particularly the drug trade and human trafficking (\"white slavery\"). Dr. Fu Manchu has extended his already considerable lifespan by use of the elixir of life, a formula he spent decades trying to perfect.\n\nSir Denis Nayland Smith and Dr. Petrie \n\nOpposing Fu Manchu in the early stories are Denis Nayland Smith and Dr. Petrie. They are in the Holmes and Watson tradition, with Dr. Petrie narrating the stories while Nayland Smith carries the fight, combating Fu Manchu more by dogged determination than intellectual brilliance (except in extremis). Nayland Smith and Fu Manchu share a grudging respect for one another, as each believes a man must keep his word even to an enemy.\n\nIn the first three books, Nayland Smith is a colonial police commissioner in Burma granted a roving commission which allows him to exercise authority over any group that can help him in his mission. He resembles Sherlock Holmes in physical description and acerbic manner, but not in deductive genius. He has been criticized as being a racist and jingoistic character, especially in the early entries in the series, and gives voice to anti-Asian sentiments. When Rohmer revived the series in the early 1930s, Smith (who has been knighted) is Assistant Commissioner of Scotland Yard. He later resigns this post and accepts a position with British Intelligence. Several books have him placed on special assignment with the FBI.\n\nActors who played Nayland Smith:\n*O. P. Heggie in The Mysterious Dr. Fu Manchu (1929) and The Return of Dr. Fu Manchu (1930)\n*Lewis Stone in The Mask of Fu Manchu (1932)\n*Hanley Stafford in The Shadow of Fu Manchu (1939-1940)\n*William Royle in Drums of Fu Manchu (1940)\n*Lester Matthews in The Adventures of Dr. Fu Manchu  (1956)\n*Nigel Green in The Face of Fu Manchu (1965)\n*Douglas Wilmer in The Brides of Fu Manchu (1966) and The Vengeance of Fu Manchu (1967)\n*Richard Greene in The Blood of Fu Manchu (1968) and The Castle of Fu Manchu (1969)\n*Peter Sellers in The Fiendish Plot of Dr. Fu Manchu (1980)\n\nActors who played Dr. Petrie:\n*Neil Hamilton in The Mysterious Dr. Fu Manchu (1929) and The Return of Dr. Fu Manchu (1930)\n*Gale Gordon in The Shadow of Fu Manchu (1939-1940)\n*Olaf Hytten in Drums of Fu Manchu (1940)\n*Clark Howat in The Adventures of Dr. Fu Manchu (1956)\n*Howard Marion Crawford in The Face of Fu Manchu (1965), The Brides of Fu Manchu (1966), The Vengeance of Fu Manchu (1967), The Blood of Fu Manchu (1968) and The Castle of Fu Manchu (1969)\n\nKâramanèh \n\nProminent among Fu Manchu's agents was the \"seductively lovely\" Kâramanèh. Her real name is unknown. She was sold to the Si-Fan by Egyptian slave traders while still a child. Kara falls in love with the narrator of the first three books in the series, Dr. Petrie. She rescues Petrie and Nayland Smith many times. Eventually the couple are united and she wins her freedom. They marry and have a daughter, Fleurette, who figures in later novels. Author Lin Carter later created a son for Dr. Petrie and Kara, but this is not considered canonical.\n\nFah lo Suee \n\nFu Manchu's daughter, Fah lo Suee, is a devious mastermind in her own right, frequently plotting to usurp her father's position in the Si-Fan and aiding his enemies within and outside of the organization. Her real name is unknown; Fah lo Suee was a childhood term of endearment. She was introduced anonymously while still a teenager in the third book in the series and plays a larger role in several of the titles of the 1930s and 1940s. She was known for a time as Koreani after being brainwashed by her father, but her memory was later restored. She is infamous for taking on false identities, like her father, among them Madame Ingomar and Queen Mamaloi. In film, she has been portrayed by numerous actresses over the years. Her character is usually renamed in film adaptations because of difficulties with pronunciation. Anna May Wong played Ling Moy in 1931's Daughter of the Dragon. Myrna Loy portrayed the similarly named Fah lo See in 1932's The Mask of Fu Manchu. Gloria Franklin had the role of Fah lo Suee in 1940's Drums of Fu Manchu. Laurette Luez played Karamaneh in 1956's The Adventures of Dr. Fu Manchu, but the character owed more to Fah lo Suee than Rohmer's depiction of Karamaneh. Tsai Chin portrayed Fu Manchu's daughter, Lin Tang in the five Christopher Lee films of the 1960s.\n\nControversy\n\nAfter the 1932 release of MGM's adaptation of The Mask of Fu Manchu, which featured the Asian villain telling an assembled group of \"Asians\" (consisting of caricatural Indians, Persians and Arabs) that they must \"kill the white men and take their women\", the\nChinese embassy in Washington, D.C. issued a formal complaint against the film.Christopher Frayling, quoted in \"Fu Manchu\", in Newman, Kim (ed.),The BFI Companion to Horror. London, Cassell,1996, (pp.131-2) . \n\nFollowing the 1940 release of Republic Pictures' serial adaptation of Drums of Fu Manchu, the United States Department of State requested the studio make no further films with the character as China was an ally against Japan. Likewise, Rohmer's publisher, Doubleday, refused to publish further additions to the best-selling series for the duration of World War II once the United States entered the conflict. BBC Radio and Broadway investors subsequently rejected Rohmer's proposals for an original Fu Manchu radio serial and stage show during the 1940s.\n\nThe re-release of The Mask of Fu Manchu in 1972 was met with protest from the Japanese American Citizens League, who stated that \"the movie was offensive and demeaning to Asian Americans.\"Gregory William Mank, Hollywood Cauldron: 13 Horror Films from the Genres's Golden Age\nMcFarland, 2001 (pp.53–89 ) \n\nRohmer responded to charges that his work demonised Asians in Master of Villainy, a biography co-written by his wife:\n\nIt was Rohmer's contention that he based Fu Manchu and other \"Yellow Peril\" mysteries on real Chinese crime figures he met as a newspaper reporter covering Limehouse activities.\n\nIn May 2013, General Motors cancelled an advertisement after complaints that a phrase it contained, \"the land of Fu Manchu\", was offensive.[http://www.scmp.com/news/world/article/1227375/exclusive-general-motors-pulls-racist-chevrolet-ad-over-ching-ching-chop] GM pulls 'racist' Chevrolet 'ching-ching, chop suey' ad\n\nCharacterizing Fu Manchu as an overtly racist creation has been criticized in the book Lord of Strange Deaths: The Fiendish World of Sax Rohmer. In a review of the book in The Independent, Fu Manchu is contextualized: \"These magnificently absurd books, glowing with a crazed exoticism, are really far less polar, less black-and-white, less white-and-yellow, than they first seem.\"\n\nCultural impact \n\nThe character of Fu Manchu became a stereotype often associated with the Yellow Peril. Fu Manchu has inspired numerous other characters, and is the model for most villains in later \"Yellow Peril\" thrillers. Examples include Pao Tcheou, Ming the Merciless from Flash Gordon, Dr Goo-Fee from Fearless Fly, L'Ombre Jaune (\"The Yellow Shadow\" aka Monsieur Ming) from Bob Morane, Li Chang Yen from The Big Four, James Bond adversary Dr No, The Celestial Toymaker from the Doctor Who story of the same name, Huang Hua from A Matter of Time, Dr Benton Quest's archenemy Dr Zin from the Jonny Quest television series, Dr Yen-Lo from The Manchurian Candidate, Lo-Pan from Big Trouble in Little China, Marvel Comics foes the Mandarin and the Yellow Claw, DC Comics' Rā's al Ghūl, Wo Fat from the CBS TV series Hawaii Five-O, \"The Craw\" in more than one episode of Get Smart, Ancient Wu from the video game True Crime: Streets of LA, and \"Fu Fang\" in The Real Ghostbusters NOW Comics. Fu Manchu and his daughter are the inspiration for the character Hark and his daughter Anna Hark in the comic book series Planetary.\n\nHe was also parodied by Kenneth Williams in the radio show Round the Horne as the criminal mastermind Dr Chu En Ginsberg MA, accompanied by his common-as-muck concubine Lotus Blossom, played by a cockney Hugh Paddick. Appearing in ten-minute sketches within the show, he was the villain for Kenneth Horne's master spy in adventures such as \"The Man with the Golden Thunderball\", which also spoofed James Bond.\n\nFu Manchu was parodied in the character of Fiendish Dr. Wu in the 2009 action-comedy film Black Dynamite, in which the executor of an evil plan against African-Americans is an insidious, moustache-sporting Kung Fu master.\n\nWhile not of Asian descent, \"Egyptian\" arch-villain \"Kathulos\" (then revealed to be a surviving Atlantean) of Robert E. Howard's Skull-Face novella is inspired by Fu Manchu. \"Comrade Li\" in Peter George's Commander-1 (1965) is essentially the same type of villain—a suave philosopher steeped in ancient Chinese learning, despite his name having a thin veneer of Communism or Marxism. His cold-blooded machinations bring about a nuclear holocaust in which nearly all of humanity perishes (including China, which he sought to make great) and he eventually meets a suitably gruesome and ignominious end.\n\nFred Fu Manchu, a \"famous Chinese bamboo saxophonist\", was a recurring character on The Goon Show, a 1950s British radio comedy programme. He was featured in the episode \"The Terrible Revenge of Fred Fu Manchu\" in 1955 (announced as \"Fred Fu-Manchu and his Bamboo Saxophone\"), and made minor appearances in other episodes (including \"China Story\", \"The Siege of Fort Night\", and in \"The Lost Emperor\" as \"Doctor Fred Fu Manchu, oriental tattooist\"). The character was created and performed by Spike Milligan, who used it to mock British xenophobia and self-satisfaction, the traits that summoned the original Fu Manchu into existence, and not as a slur against Asians.\n\nFu Manchu is also one of the earliest known examples of an evil scientist or archenemy, with Professor Moriarty, Doctor Jack Quartz (from Nick Carter), and Monsieur Zenith (from Sexton Blake) being among the few predecessors. The style of facial hair associated with him in film adaptations has become known as the Fu Manchu moustache, although Rohmer's writings described the character as wearing no such adornment.\n\nIn 1977, Trebor produced a \"Fu Munchews\" sweet.\n\nBooks \n\n* The Mystery of Dr. Fu-Manchu (1913) (US Title: The Insidious Dr. Fu-Manchu).\n* The Return of Dr Fu-Manchu (1916) (UK Title: The Devil Doctor)\n* The Hand of Fu-Manchu (1917) (UK Title: The Si-Fan Mysteries)\n* Daughter of Fu Manchu (1931)\n* The Mask of Fu Manchu (1932)\n* Fu Manchu's Bride (1933) (UK Title: The Bride of Fu Manchu)\n* The Trail of Fu Manchu (1934)\n* President Fu Manchu (1936)\n* The Drums of Fu Manchu (1939)\n* The Island of Fu Manchu (1941)\n* Shadow of Fu Manchu (1948)\n* Re-Enter Fu Manchu (1957)  (UK Title: Re-Enter Dr. Fu Manchu)\n* Emperor Fu Manchu (1959) was Rohmer's last novel.\n* The Wrath of Fu Manchu (1973) was a posthumous anthology containing the title novella, first published in 1952, and three later short stories: \"The Eyes of Fu Manchu\" (1957), \"The Word of Fu Manchu\" (1958), and \"The Mind of Fu Manchu\" (1959).\n* Ten Years Beyond Baker Street (1984). The first of two authorised continuation novels by Cay Van Ash, Sax Rohmer's former assistant and biographer. Set in early 1914, it sees Fu Manchu come into conflict with Sherlock Holmes.\n* The Fires of Fu Manchu (1987). The second authorized continuation novel by Cay Van Ash. The novel is set in 1917 and documents Smith and Petrie's encounter with Fu Manchu during the First World War culminating in Smith's knighthood. A third Van Ash title, The Seal of Fu Manchu was underway when Van Ash died in 1994. The incomplete manuscript is believed to be lost.\n* The Terror of Fu Manchu (2009). The first of three authorized continuation novels by William Patrick Maynard. The novel expands on the continuity established in Van Ash's books and sees Dr Petrie teaming with both Nayland Smith and a Rohmer character from outside the series, Gaston Max, in an adventure set on the eve of the First World War.\n* The Destiny of Fu Manchu (2012). The second authorized continuation novel by William Patrick Maynard. The novel is set between Rohmer's The Drums of Fu Manchu and The Island of Fu Manchu on the eve of the Second World War and follows the continuity established in the author's first novel.\n* The Triumph of Fu Manchu (announced). The third authorized continuation novel by William Patrick Maynard. The novel is set between Rohmer's The Trail of Fu Manchu and President Fu Manchu.\n* The League of Dragons by George Alec Effinger was an unpublished, unauthorized novel involving a young Sherlock Holmes matching wits with Fu Manchu in the nineteenth century. Chapters have been published in the anthologies, Sherlock Holmes in Orbit (1995) and My Sherlock Holmes (2003). This lost university adventure of Holmes is narrated by Conan Doyle's character Reginald Musgrave.\n\nFu Manchu also made appearances in the following non-Fu Manchu books:\n* \"Sex Slaves of the Dragon Tong\" and \"Part of the Game\" are a pair of related short stories by F. Paul Wilson appearing in his collection, Aftershocks and Others: 19 Oddities (2009) and feature anonymous appearances by Dr Fu Manchu and characters from Little Orphan Annie.\n* Fu Manchu also appears anonymously in several stories in August Derleth's Solar Pons detective series. Derleth's successor, Basil Copper, also made use of the character.\n* Fu Manchu is the name of the Chinese ambassador in Kurt Vonnegut's Slapstick (1976).\n* It is revealed that Chiun, the Master of Sinanju has worked for the Devil Doctor, as have previous generations of Masters in The Destroyer novel No. 83 Skull Duggery.\n* Fu Manchu also appears in the background to Ben Aaronovitch's Rivers of London series. In this depiction, Fu Manchu was a charlatan and con man rather than a super-villain, and in fact he was a Canadian married to a Chinese wife and only pretending to be Chinese himself; the grand criminal schemes attributed to him were mere myths, concocted either by himself or by sensationalist press and publicity-seeking police officers, the latter partly motivated by anti-Chinese prejudice.\n\nIn other media \n\nFilm \n\nFu Manchu first appeared on the big screen in the 1923 British silent film serial The Mystery of Dr. Fu Manchu starring Harry Agar Lyons. Lyons returned to the role the next year in The Further Mysteries of Dr. Fu Manchu.\n\nIn 1929 Fu Manchu made his American film debut in Paramount's early talkie, The Mysterious Dr. Fu Manchu starring Warner Oland, best known for his later portrayal of Charlie Chan in the 1930s. Oland repeated the role in 1930's The Return of Dr. Fu Manchu and 1931's Daughter of the Dragon as well as in the short, Murder Will Out as part of the omnibus film, Paramount on Parade where the Devil Doctor confronts both Philo Vance and Sherlock Holmes.\n\nThe most infamous incarnation of the character was MGM's The Mask of Fu Manchu (1932) starring Boris Karloff and Myrna Loy. The film's tone has long been considered racist and offensive, but that only added to its cult status alongside its campy humour and Grand Guignol sets and torture sequences. The film was suppressed for many years, but has since received critical re-evaluation and been released on DVD uncut.\n\nFu Manchu returned to the serial format in 1940 in Republic Pictures' Drums of Fu Manchu, a 15-episode serial considered to be one of the best the studio ever made. It was later edited and released as a feature film in 1943.\n\nOther than an obscure, unauthorised 1946 Spanish spoof El Otro Fu Manchu, the Devil Doctor was absent from the big screen for 25 years, until producer Harry Alan Towers began a series starring Christopher Lee in 1965. Towers and Lee would make five Fu Manchu films through the end of the decade: The Face of Fu Manchu (1965), The Brides of Fu Manchu (1966), The Vengeance of Fu Manchu (1967), The Blood of Fu Manchu (1968), and finally The Castle of Fu Manchu (1969).\n\nThe character's last authorised film appearance was in the 1980 Peter Sellers spoof, The Fiendish Plot of Dr. Fu Manchu with Sellers featured in a double role as both Fu Manchu and Nayland Smith. The film bore little resemblance to any prior film or the original books. In the film, Fu Manchu claims he was known as \"Fred\" at public school, a reference to the character of \"The Terrible Revenge of Fred Fumanchu\" from a 1955 The Goon Show which had co-starred Sellers.p.210 Lewis, Roger The Life and Death of Peter Sellers Random House, 1995 \n\nJess Franco, who had directed The Blood of Fu Manchu and The Castle of Fu Manchu, also directed The Girl From Rio, the second of three Harry Alan Towers films based on Rohmer's female Fu Manchu character, Sumuru. He later directed an unauthorised 1986 Spanish film featuring Fu Manchu's daughter, Esclavas del Crimen.\n\nIn the 2007 film Grindhouse, Nicolas Cage makes an uncredited comedic cameo appearance as Fu Manchu, during the \"trailer\" for the fake movie Werewolf Women of the SS.\n\nTelevision \n\nIn 1956, the television arm of Republic Pictures produced a 13-episode syndicated series, The Adventures of Dr. Fu Manchu starring Glen Gordon as Dr. Fu Manchu, Lester Matthews as Sir Denis Nayland Smith, and Clark Howat as Dr. John Petrie. The title sequence depicted Smith and Fu Manchu in a game of chess as the announcer stated that \"the Devil is said to play for men's souls. So does Dr. Fu Manchu, Evil Incarnate.\" At the conclusion of each episode, after Nayland Smith and Petrie had foiled Fu Manchu's latest fiendish scheme, Fu Manchu would be seen breaking a black chess piece in a fit of frustration (black king's bishop, always the same bit of film, repeated) just before the closing credits rolled. It was directed by noted serial director Franklin Adreon as well as William Witney.  Fu Manchu was never allowed to succeed in this TV series. Unlike the Holmes/Watson type relationship of the films, the series featured Smith as a law enforcement officer and Petrie as a staff member for the Surgeon General.\n\nMusic \n\n*American Stoner Rock band Fu Manchu formed in Southern California in 1985. \n\n*Desmond Dekker reggae 1969 'fu man chu' \n\n*The Rockin' Ramrods had a 1965 song titled \"Don't Fool With Fu Manchu\"\n*Quebec rock singer Robert Charlebois included an epic three-part song titled \"Fu Man Chu\" on his 1972 album Charlebois\n*Russian hardbass artist XS Project has a song named \"[https://g.co/kgs/UMQfTV Fu Manchu]\"\n\nRadio \n\nFu Manchu's earliest radio appearances were on the Collier Hour 1927–31 on the Blue Network. This was a radio programme designed to promote Collier's magazine and presented weekly dramatisations of the current issue's stories and serials. Fu was voiced by Arthur Hughes. A self-titled show on CBS followed in 1932–33. John C. Daly, and later Harold Huber, played Fu.\n\nAdditionally, there were \"pirate\" broadcasts from the Continent into Britain, from Radio Luxembourg and Radio Lyons in 1936 through 1937. Frank Cochrane voiced Fu Manchu. The BBC produced a competing series, The Peculiar Case of the Poppy Club starting in 1939. That same year The Shadow of Fu Manchu aired in the United States as a thrice weekly serial dramatising the first nine novels.Cox, Jim, Radio Crime Fighters. Jefferson, North Carolina: McFarland & Company, 2002. \n\nComic strips \n\nFu Manchu was first brought to newspaper comic strips in a black and white daily strip drawn by Leo O'Mealia (1884-1960) and ran from 1931 to 1933. The strips were adaptations of the first two Fu Manchu novels and part of the third. Unlike most other illustrators, O'Mealia drew Fu Manchu as a clean-shaven man with an abnormally large cranium. The strips were copyrighted by \"Sax Rohmer and The Bell Syndicate, Inc\". Two of the Fu Manchu strips were reprinted in the 1989 book Fu Manchu : two complete adventures.Sax Rohmer, Leo O'Mealia and Tom Mason,Fu Manchu : two complete adventures. Newbury Park, CA :Malibu Graphics, 1989. \n\nComic books\n\n* Fu Manchu made his first comic book appearance in Detective Comics #17, and continued, as one feature among many in the anthology series, until No. 28. These were reprints of the earlier Leo O'Mealia strips. Original Fu stories in comics had to wait for Avon's one-shot The Mask of Dr. Fu Manchu in 1951. A similar British one-shot The Island of Fu Manchu was published in 1956.\n* In the 1970s, Fu Manchu appeared as the father of the character Shang-Chi in the series Shang-Chi, Master of Kung Fu. However Marvel Comics cancelled the book in 1982, and issues over licensing the character and concepts from the novels (such as his daughter) have hampered Marvel's ability to both collect the series in trade paperback format and reference Fu Manchu as Shang-Chi's father. As such, the character is either never mentioned by name, or by alias (\"Mr. Han\"). Though Fu Manchu himself was killed off in #118 of his son's comic, he has since been (partially) resurrected by an evil terror group known as the Shadow Council in the series Secret Avengers.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fu Manchu" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11253" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Dr. Fu Manchu is a fictional villain character introduced in a series of novels by British author Sax Rohmer during the first half of the twentieth century. The character was also featured extensively in cinema, television, radio, comic strips, and comic books for over 90 years, and has become an archetype of the evil criminal genius and mad scientist, while lending the name to the Fu Manchu moustache.\n\nCharacters\n\nDr. Fu Manchu\n\nSupervillain Fu Manchu's murderous plots are marked by the extensive use of arcane methods; he disdains guns or explosives, preferring dacoits, thuggees, and members of other secret societies as his agents armed with knives, or using \"pythons and cobras ... fungi and my tiny allies, the bacilli ... my black spiders\" and other peculiar animals or natural chemical weapons.\n\nIn the 1933 novel, The Bride of Fu Manchu, Fu Manchu claims to hold doctorates from four Western universities. In the 1959 novel, Emperor Fu Manchu, he reveals he attended Heidelberg University, the Sorbonne, and the University of Edinburgh (in the film The Mask of Fu Manchu, on the other hand, he states proudly that \"I am a doctor of philosophy from Edinburgh, a doctor of law from Christ's College, a doctor of medicine from Harvard. My friends, out of courtesy, call me 'Doctor'\"). At the time of their first encounter (1911), Dr. Petrie believed that Fu Manchu was around 70 years old. This would have placed Fu Manchu in the West studying for his first doctorate in the 1860s or 1870s.\n\nAccording to Cay Van Ash, Rohmer's biographer and former assistant who became the first author to continue the series after Rohmer's death, \"Fu Manchu\" was a title of honour, which meant \"the Warlike Manchu\". Van Ash speculates that Fu Manchu had been a member of the imperial family of China who backed the losing side in the Boxer Rebellion. In the earliest books, Fu Manchu is an agent of the secret society, the Si-Fan, and acts as the mastermind behind a wave of assassinations targeting Western imperialists. In later books, he vies for control of the Si-Fan, which is more concerned with routing fascist dictators and halting the spread of communism. The Si-Fan is largely funded through criminal activities, particularly the drug trade and human trafficking (\"white slavery\"). Dr. Fu Manchu has extended his already considerable lifespan by use of the elixir of life, a formula he spent decades trying to perfect.\n\nSir Denis Nayland Smith and Dr. Petrie \n\nOpposing Fu Manchu in the early stories are Denis Nayland Smith and Dr. Petrie. They are in the Holmes and Watson tradition, with Dr. Petrie narrating the stories while Nayland Smith carries the fight, combating Fu Manchu more by dogged determination than intellectual brilliance (except in extremis). Nayland Smith and Fu Manchu share a grudging respect for one another, as each believes a man must keep his word even to an enemy.\n\nIn the first three books, Nayland Smith is a colonial police commissioner in Burma granted a roving commission which allows him to exercise authority over any group that can help him in his mission. He resembles Sherlock Holmes in physical description and acerbic manner, but not in deductive genius. He has been criticized as being a racist and jingoistic character, especially in the early entries in the series, and gives voice to anti-Asian sentiments. When Rohmer revived the series in the early 1930s, Smith (who has been knighted) is Assistant Commissioner of Scotland Yard. He later resigns this post and accepts a position with British Intelligence. Several books have him placed on special assignment with the FBI.\n\nActors who played Nayland Smith:\n*O. P. Heggie in The Mysterious Dr. Fu Manchu (1929) and The Return of Dr. Fu Manchu (1930)\n*Lewis Stone in The Mask of Fu Manchu (1932)\n*Hanley Stafford in The Shadow of Fu Manchu (1939-1940)\n*William Royle in Drums of Fu Manchu (1940)\n*Lester Matthews in The Adventures of Dr. Fu Manchu  (1956)\n*Nigel Green in The Face of Fu Manchu (1965)\n*Douglas Wilmer in The Brides of Fu Manchu (1966) and The Vengeance of Fu Manchu (1967)\n*Richard Greene in The Blood of Fu Manchu (1968) and The Castle of Fu Manchu (1969)\n*Peter Sellers in The Fiendish Plot of Dr. Fu Manchu (1980)\n\nActors who played Dr. Petrie:\n*Neil Hamilton in The Mysterious Dr. Fu Manchu (1929) and The Return of Dr. Fu Manchu (1930)\n*Gale Gordon in The Shadow of Fu Manchu (1939-1940)\n*Olaf Hytten in Drums of Fu Manchu (1940)\n*Clark Howat in The Adventures of Dr. Fu Manchu (1956)\n*Howard Marion Crawford in The Face of Fu Manchu (1965), The Brides of Fu Manchu (1966), The Vengeance of Fu Manchu (1967), The Blood of Fu Manchu (1968) and The Castle of Fu Manchu (1969)\n\nKâramanèh \n\nProminent among Fu Manchu's agents was the \"seductively lovely\" Kâramanèh. Her real name is unknown. She was sold to the Si-Fan by Egyptian slave traders while still a child. Kara falls in love with the narrator of the first three books in the series, Dr. Petrie. She rescues Petrie and Nayland Smith many times. Eventually the couple are united and she wins her freedom. They marry and have a daughter, Fleurette, who figures in later novels. Author Lin Carter later created a son for Dr. Petrie and Kara, but this is not considered canonical.\n\nFah lo Suee \n\nFu Manchu's daughter, Fah lo Suee, is a devious mastermind in her own right, frequently plotting to usurp her father's position in the Si-Fan and aiding his enemies within and outside of the organization. Her real name is unknown; Fah lo Suee was a childhood term of endearment. She was introduced anonymously while still a teenager in the third book in the series and plays a larger role in several of the titles of the 1930s and 1940s. She was known for a time as Koreani after being brainwashed by her father, but her memory was later restored. She is infamous for taking on false identities, like her father, among them Madame Ingomar and Queen Mamaloi. In film, she has been portrayed by numerous actresses over the years. Her character is usually renamed in film adaptations because of difficulties with pronunciation. Anna May Wong played Ling Moy in 1931's Daughter of the Dragon. Myrna Loy portrayed the similarly named Fah lo See in 1932's The Mask of Fu Manchu. Gloria Franklin had the role of Fah lo Suee in 1940's Drums of Fu Manchu. Laurette Luez played Karamaneh in 1956's The Adventures of Dr. Fu Manchu, but the character owed more to Fah lo Suee than Rohmer's depiction of Karamaneh. Tsai Chin portrayed Fu Manchu's daughter, Lin Tang in the five Christopher Lee films of the 1960s.\n\nControversy\n\nAfter the 1932 release of MGM's adaptation of The Mask of Fu Manchu, which featured the Asian villain telling an assembled group of \"Asians\" (consisting of caricatural Indians, Persians and Arabs) that they must \"kill the white men and take their women\", the\nChinese embassy in Washington, D.C. issued a formal complaint against the film.Christopher Frayling, quoted in \"Fu Manchu\", in Newman, Kim (ed.),The BFI Companion to Horror. London, Cassell,1996, (pp.131-2) . \n\nFollowing the 1940 release of Republic Pictures' serial adaptation of Drums of Fu Manchu, the United States Department of State requested the studio make no further films with the character as China was an ally against Japan. Likewise, Rohmer's publisher, Doubleday, refused to publish further additions to the best-selling series for the duration of World War II once the United States entered the conflict. BBC Radio and Broadway investors subsequently rejected Rohmer's proposals for an original Fu Manchu radio serial and stage show during the 1940s.\n\nThe re-release of The Mask of Fu Manchu in 1972 was met with protest from the Japanese American Citizens League, who stated that \"the movie was offensive and demeaning to Asian Americans.\"Gregory William Mank, Hollywood Cauldron: 13 Horror Films from the Genres's Golden Age\nMcFarland, 2001 (pp.53–89 ) \n\nRohmer responded to charges that his work demonised Asians in Master of Villainy, a biography co-written by his wife:\n\nIt was Rohmer's contention that he based Fu Manchu and other \"Yellow Peril\" mysteries on real Chinese crime figures he met as a newspaper reporter covering Limehouse activities.\n\nIn May 2013, General Motors cancelled an advertisement after complaints that a phrase it contained, \"the land of Fu Manchu\", was offensive.[http://www.scmp.com/news/world/article/1227375/exclusive-general-motors-pulls-racist-chevrolet-ad-over-ching-ching-chop] GM pulls 'racist' Chevrolet 'ching-ching, chop suey' ad\n\nCharacterizing Fu Manchu as an overtly racist creation has been criticized in the book Lord of Strange Deaths: The Fiendish World of Sax Rohmer. In a review of the book in The Independent, Fu Manchu is contextualized: \"These magnificently absurd books, glowing with a crazed exoticism, are really far less polar, less black-and-white, less white-and-yellow, than they first seem.\"\n\nCultural impact \n\nThe character of Fu Manchu became a stereotype often associated with the Yellow Peril. Fu Manchu has inspired numerous other characters, and is the model for most villains in later \"Yellow Peril\" thrillers. Examples include Pao Tcheou, Ming the Merciless from Flash Gordon, Dr Goo-Fee from Fearless Fly, L'Ombre Jaune (\"The Yellow Shadow\" aka Monsieur Ming) from Bob Morane, Li Chang Yen from The Big Four, James Bond adversary Dr No, The Celestial Toymaker from the Doctor Who story of the same name, Huang Hua from A Matter of Time, Dr Benton Quest's archenemy Dr Zin from the Jonny Quest television series, Dr Yen-Lo from The Manchurian Candidate, Lo-Pan from Big Trouble in Little China, Marvel Comics foes the Mandarin and the Yellow Claw, DC Comics' Rā's al Ghūl, Wo Fat from the CBS TV series Hawaii Five-O, \"The Craw\" in more than one episode of Get Smart, Ancient Wu from the video game True Crime: Streets of LA, and \"Fu Fang\" in The Real Ghostbusters NOW Comics. Fu Manchu and his daughter are the inspiration for the character Hark and his daughter Anna Hark in the comic book series Planetary.\n\nHe was also parodied by Kenneth Williams in the radio show Round the Horne as the criminal mastermind Dr Chu En Ginsberg MA, accompanied by his common-as-muck concubine Lotus Blossom, played by a cockney Hugh Paddick. Appearing in ten-minute sketches within the show, he was the villain for Kenneth Horne's master spy in adventures such as \"The Man with the Golden Thunderball\", which also spoofed James Bond.\n\nFu Manchu was parodied in the character of Fiendish Dr. Wu in the 2009 action-comedy film Black Dynamite, in which the executor of an evil plan against African-Americans is an insidious, moustache-sporting Kung Fu master.\n\nWhile not of Asian descent, \"Egyptian\" arch-villain \"Kathulos\" (then revealed to be a surviving Atlantean) of Robert E. Howard's Skull-Face novella is inspired by Fu Manchu. \"Comrade Li\" in Peter George's Commander-1 (1965) is essentially the same type of villain—a suave philosopher steeped in ancient Chinese learning, despite his name having a thin veneer of Communism or Marxism. His cold-blooded machinations bring about a nuclear holocaust in which nearly all of humanity perishes (including China, which he sought to make great) and he eventually meets a suitably gruesome and ignominious end.\n\nFred Fu Manchu, a \"famous Chinese bamboo saxophonist\", was a recurring character on The Goon Show, a 1950s British radio comedy programme. He was featured in the episode \"The Terrible Revenge of Fred Fu Manchu\" in 1955 (announced as \"Fred Fu-Manchu and his Bamboo Saxophone\"), and made minor appearances in other episodes (including \"China Story\", \"The Siege of Fort Night\", and in \"The Lost Emperor\" as \"Doctor Fred Fu Manchu, oriental tattooist\"). The character was created and performed by Spike Milligan, who used it to mock British xenophobia and self-satisfaction, the traits that summoned the original Fu Manchu into existence, and not as a slur against Asians.\n\nFu Manchu is also one of the earliest known examples of an evil scientist or archenemy, with Professor Moriarty, Doctor Jack Quartz (from Nick Carter), and Monsieur Zenith (from Sexton Blake) being among the few predecessors. The style of facial hair associated with him in film adaptations has become known as the Fu Manchu moustache, although Rohmer's writings described the character as wearing no such adornment.\n\nIn 1977, Trebor produced a \"Fu Munchews\" sweet.\n\nBooks \n\n* The Mystery of Dr. Fu-Manchu (1913) (US Title: The Insidious Dr. Fu-Manchu).\n* The Return of Dr Fu-Manchu (1916) (UK Title: The Devil Doctor)\n* The Hand of Fu-Manchu (1917) (UK Title: The Si-Fan Mysteries)\n* Daughter of Fu Manchu (1931)\n* The Mask of Fu Manchu (1932)\n* Fu Manchu's Bride (1933) (UK Title: The Bride of Fu Manchu)\n* The Trail of Fu Manchu (1934)\n* President Fu Manchu (1936)\n* The Drums of Fu Manchu (1939)\n* The Island of Fu Manchu (1941)\n* Shadow of Fu Manchu (1948)\n* Re-Enter Fu Manchu (1957)  (UK Title: Re-Enter Dr. Fu Manchu)\n* Emperor Fu Manchu (1959) was Rohmer's last novel.\n* The Wrath of Fu Manchu (1973) was a posthumous anthology containing the title novella, first published in 1952, and three later short stories: \"The Eyes of Fu Manchu\" (1957), \"The Word of Fu Manchu\" (1958), and \"The Mind of Fu Manchu\" (1959).\n* Ten Years Beyond Baker Street (1984). The first of two authorised continuation novels by Cay Van Ash, Sax Rohmer's former assistant and biographer. Set in early 1914, it sees Fu Manchu come into conflict with Sherlock Holmes.\n* The Fires of Fu Manchu (1987). The second authorized continuation novel by Cay Van Ash. The novel is set in 1917 and documents Smith and Petrie's encounter with Fu Manchu during the First World War culminating in Smith's knighthood. A third Van Ash title, The Seal of Fu Manchu was underway when Van Ash died in 1994. The incomplete manuscript is believed to be lost.\n* The Terror of Fu Manchu (2009). The first of three authorized continuation novels by William Patrick Maynard. The novel expands on the continuity established in Van Ash's books and sees Dr Petrie teaming with both Nayland Smith and a Rohmer character from outside the series, Gaston Max, in an adventure set on the eve of the First World War.\n* The Destiny of Fu Manchu (2012). The second authorized continuation novel by William Patrick Maynard. The novel is set between Rohmer's The Drums of Fu Manchu and The Island of Fu Manchu on the eve of the Second World War and follows the continuity established in the author's first novel.\n* The Triumph of Fu Manchu (announced). The third authorized continuation novel by William Patrick Maynard. The novel is set between Rohmer's The Trail of Fu Manchu and President Fu Manchu.\n* The League of Dragons by George Alec Effinger was an unpublished, unauthorized novel involving a young Sherlock Holmes matching wits with Fu Manchu in the nineteenth century. Chapters have been published in the anthologies, Sherlock Holmes in Orbit (1995) and My Sherlock Holmes (2003). This lost university adventure of Holmes is narrated by Conan Doyle's character Reginald Musgrave.\n\nFu Manchu also made appearances in the following non-Fu Manchu books:\n* \"Sex Slaves of the Dragon Tong\" and \"Part of the Game\" are a pair of related short stories by F. Paul Wilson appearing in his collection, Aftershocks and Others: 19 Oddities (2009) and feature anonymous appearances by Dr Fu Manchu and characters from Little Orphan Annie.\n* Fu Manchu also appears anonymously in several stories in August Derleth's Solar Pons detective series. Derleth's successor, Basil Copper, also made use of the character.\n* Fu Manchu is the name of the Chinese ambassador in Kurt Vonnegut's Slapstick (1976).\n* It is revealed that Chiun, the Master of Sinanju has worked for the Devil Doctor, as have previous generations of Masters in The Destroyer novel No. 83 Skull Duggery.\n* Fu Manchu also appears in the background to Ben Aaronovitch's Rivers of London series. In this depiction, Fu Manchu was a charlatan and con man rather than a super-villain, and in fact he was a Canadian married to a Chinese wife and only pretending to be Chinese himself; the grand criminal schemes attributed to him were mere myths, concocted either by himself or by sensationalist press and publicity-seeking police officers, the latter partly motivated by anti-Chinese prejudice.\n\nIn other media \n\nFilm \n\nFu Manchu first appeared on the big screen in the 1923 British silent film serial The Mystery of Dr. Fu Manchu starring Harry Agar Lyons. Lyons returned to the role the next year in The Further Mysteries of Dr. Fu Manchu.\n\nIn 1929 Fu Manchu made his American film debut in Paramount's early talkie, The Mysterious Dr. Fu Manchu starring Warner Oland, best known for his later portrayal of Charlie Chan in the 1930s. Oland repeated the role in 1930's The Return of Dr. Fu Manchu and 1931's Daughter of the Dragon as well as in the short, Murder Will Out as part of the omnibus film, Paramount on Parade where the Devil Doctor confronts both Philo Vance and Sherlock Holmes.\n\nThe most infamous incarnation of the character was MGM's The Mask of Fu Manchu (1932) starring Boris Karloff and Myrna Loy. The film's tone has long been considered racist and offensive, but that only added to its cult status alongside its campy humour and Grand Guignol sets and torture sequences. The film was suppressed for many years, but has since received critical re-evaluation and been released on DVD uncut.\n\nFu Manchu returned to the serial format in 1940 in Republic Pictures' Drums of Fu Manchu, a 15-episode serial considered to be one of the best the studio ever made. It was later edited and released as a feature film in 1943.\n\nOther than an obscure, unauthorised 1946 Spanish spoof El Otro Fu Manchu, the Devil Doctor was absent from the big screen for 25 years, until producer Harry Alan Towers began a series starring Christopher Lee in 1965. Towers and Lee would make five Fu Manchu films through the end of the decade: The Face of Fu Manchu (1965), The Brides of Fu Manchu (1966), The Vengeance of Fu Manchu (1967), The Blood of Fu Manchu (1968), and finally The Castle of Fu Manchu (1969).\n\nThe character's last authorised film appearance was in the 1980 Peter Sellers spoof, The Fiendish Plot of Dr. Fu Manchu with Sellers featured in a double role as both Fu Manchu and Nayland Smith. The film bore little resemblance to any prior film or the original books. In the film, Fu Manchu claims he was known as \"Fred\" at public school, a reference to the character of \"The Terrible Revenge of Fred Fumanchu\" from a 1955 The Goon Show which had co-starred Sellers.p.210 Lewis, Roger The Life and Death of Peter Sellers Random House, 1995 \n\nJess Franco, who had directed The Blood of Fu Manchu and The Castle of Fu Manchu, also directed The Girl From Rio, the second of three Harry Alan Towers films based on Rohmer's female Fu Manchu character, Sumuru. He later directed an unauthorised 1986 Spanish film featuring Fu Manchu's daughter, Esclavas del Crimen.\n\nIn the 2007 film Grindhouse, Nicolas Cage makes an uncredited comedic cameo appearance as Fu Manchu, during the \"trailer\" for the fake movie Werewolf Women of the SS.\n\nTelevision \n\nIn 1956, the television arm of Republic Pictures produced a 13-episode syndicated series, The Adventures of Dr. Fu Manchu starring Glen Gordon as Dr. Fu Manchu, Lester Matthews as Sir Denis Nayland Smith, and Clark Howat as Dr. John Petrie. The title sequence depicted Smith and Fu Manchu in a game of chess as the announcer stated that \"the Devil is said to play for men's souls. So does Dr. Fu Manchu, Evil Incarnate.\" At the conclusion of each episode, after Nayland Smith and Petrie had foiled Fu Manchu's latest fiendish scheme, Fu Manchu would be seen breaking a black chess piece in a fit of frustration (black king's bishop, always the same bit of film, repeated) just before the closing credits rolled. It was directed by noted serial director Franklin Adreon as well as William Witney.  Fu Manchu was never allowed to succeed in this TV series. Unlike the Holmes/Watson type relationship of the films, the series featured Smith as a law enforcement officer and Petrie as a staff member for the Surgeon General.\n\nMusic \n\n*American Stoner Rock band Fu Manchu formed in Southern California in 1985. \n\n*Desmond Dekker reggae 1969 'fu man chu' \n\n*The Rockin' Ramrods had a 1965 song titled \"Don't Fool With Fu Manchu\"\n*Quebec rock singer Robert Charlebois included an epic three-part song titled \"Fu Man Chu\" on his 1972 album Charlebois\n*Russian hardbass artist XS Project has a song named \"[https://g.co/kgs/UMQfTV Fu Manchu]\"\n\nRadio \n\nFu Manchu's earliest radio appearances were on the Collier Hour 1927–31 on the Blue Network. This was a radio programme designed to promote Collier's magazine and presented weekly dramatisations of the current issue's stories and serials. Fu was voiced by Arthur Hughes. A self-titled show on CBS followed in 1932–33. John C. Daly, and later Harold Huber, played Fu.\n\nAdditionally, there were \"pirate\" broadcasts from the Continent into Britain, from Radio Luxembourg and Radio Lyons in 1936 through 1937. Frank Cochrane voiced Fu Manchu. The BBC produced a competing series, The Peculiar Case of the Poppy Club starting in 1939. That same year The Shadow of Fu Manchu aired in the United States as a thrice weekly serial dramatising the first nine novels.Cox, Jim, Radio Crime Fighters. Jefferson, North Carolina: McFarland & Company, 2002. \n\nComic strips \n\nFu Manchu was first brought to newspaper comic strips in a black and white daily strip drawn by Leo O'Mealia (1884-1960) and ran from 1931 to 1933. The strips were adaptations of the first two Fu Manchu novels and part of the third. Unlike most other illustrators, O'Mealia drew Fu Manchu as a clean-shaven man with an abnormally large cranium. The strips were copyrighted by \"Sax Rohmer and The Bell Syndicate, Inc\". Two of the Fu Manchu strips were reprinted in the 1989 book Fu Manchu : two complete adventures.Sax Rohmer, Leo O'Mealia and Tom Mason,Fu Manchu : two complete adventures. Newbury Park, CA :Malibu Graphics, 1989. \n\nComic books\n\n* Fu Manchu made his first comic book appearance in Detective Comics #17, and continued, as one feature among many in the anthology series, until No. 28. These were reprints of the earlier Leo O'Mealia strips. Original Fu stories in comics had to wait for Avon's one-shot The Mask of Dr. Fu Manchu in 1951. A similar British one-shot The Island of Fu Manchu was published in 1956.\n* In the 1970s, Fu Manchu appeared as the father of the character Shang-Chi in the series Shang-Chi, Master of Kung Fu. However Marvel Comics cancelled the book in 1982, and issues over licensing the character and concepts from the novels (such as his daughter) have hampered Marvel's ability to both collect the series in trade paperback format and reference Fu Manchu as Shang-Chi's father. As such, the character is either never mentioned by name, or by alias (\"Mr. Han\"). Though Fu Manchu himself was killed off in #118 of his son's comic, he has since been (partially) resurrected by an evil terror group known as the Shadow Council in the series Secret Avengers. Fu Manchu. http://en.wikipedia.org/?curid=11253."
  }
}
