{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7811",
  "eid" : "e37e3bb0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778461419,
  "textBody" : "Cernunnos is the conventional name given in Celtic studies to depictions of the \"horned god\" of Celtic polytheism. Cernunnos was a Celtic god of fertility, life, animals, wealth, and the underworld. The name itself is only attested once, on the 1st-century Pillar of the Boatmen, but he appears all over Gaul, and among the Celtiberians. Cernunnos is depicted with the antlers of a stag, sometimes carries a purse filled with coin, often seated cross-legged and often associated with animals and holding or wearing torcs, are known from over 50 examples in the Gallo-Roman period, mostly in north-eastern Gaul.Green, Miranda, Celtic Art, Reading the Messages, p. 147, 1996, The Everyman Art Library,  \n\nNot much is known about the god from literary sources, and details about his name, his followers or his significance in Celtic religion are unknown. Speculative interpretations identify him as a god of nature, life or fertility. \n\nName\n\nThe theonym [C]ernunnos appears on the Pillar of the Boatmen, a Gallo-Roman monument dating to the early 1st century CE, to label a god depicted with stag's antlers in their early stage of annual growth. A. Kingsley Porter, \"A Sculpture at Tandragee,\" Burlington Magazine 65 (1934), p. 227, pointing out the relative maturation of the antlers. Both antlers have torcs hanging from them.\n\nThe name has been compared to a divine epithet Carnonos in a Celtic inscription written in Greek characters at Montagnac, Hérault (as καρνονου, karnonou, in the dative case).Xavier Delamarre, Dictionnaire de la langue gauloise (Éditions Errance, 2003), pp. 106–107.\nA Gallo-Latin adjective carnuātus, \"horned,\" is also found. Equivalent to Latin cornutus, \"horned\"; Delamarre, citing J. Vendryes, Revue Celtique 42 (1925) 221–222.\n\nThe Proto-Celtic form of the theonym is reconstructed as either *Cerno-on-os or *Carno-on-os. The augmentative -on- is characteristic of theonyms, as in Maponos, Epona, Matronae, and Sirona.Delamarre, citing M. Lejeune, Lepontica (Paris 1971), p. 325.\nMaier (2010) states that the etymology of Cernunnos is unknown, as the Celtic word for \"horn\" has an a (as in Carnonos).Bernard Maier, Dictionary of Celtic Religion and Culture (Alfred Kröner, 1994; Boydell, 2000), p. 69 [https://books.google.com/books?id\n7AvdTqwucfwC&pgPA69&dq\n%22the+etymology+of+whose+name+is+unclear%22&hlen&ei\n2E3ETPjlFcWOnwfrmpHZCQ&saX&oi\nbook_result&ctresult&resnum\n1&ved0CC0Q6AEwAA#v\nonepage&q%22the%20etymology%20of%20whose%20name%20is%20unclear%22&f\nfalse online.]\n\nGaulish karnon \"horn\"is cognate with Latin cornu and Germanic *hurnaz, English horn, ultimately from Proto-Indo-European '.Pokorny (1959) \"k̑er-, k̑erə-; k̑rā-, k̑erei-, k̑ereu\"[http://www.utexas.edu/cola/centers/lrc/ielex/X/P0929.html]\nThe etymon karn- \"horn\" appears in both Gaulish and Galatian branches of Continental Celtic. Hesychius of Alexandria glosses the Galatian word karnon (κάρνον) as \"Gallic trumpet\", that is, the Celtic military horn listed as the carnyx (κάρνυξ) by Eustathius of Thessalonica, who notes the instrument's animal-shaped bell.Delamarre; Greek text and English translation of the passage from Eustathius' Homeric commentaries given by Edward Wigan, \"Account of a Collection of Roman Gold Coins,\" Numismatic Chronicle 5 (1865), p. 11 [https://books.google.com/books?id0VwUAAAAYAAJ&pg\nPA11&dqcarnyx+Eustathius&hl\nen&eiyEPDTMPmA4SfnAf__a3UCQ&sa\nX&oibook_result&ct\nresult&resnum2&ved\n0CCsQ6AEwAQ#vonepage&q\ncarnyx%20Eustathius&f=false online.] The root also appears in the names of Celtic polities, most prominent among them the Carnutes, meaning something like \"the Horned Ones,\"Also Carni and Carnonacae. and in several personal names found in inscriptions.Such as Carnarus, Carnatus, Carneolus, Carnius and Carnicus; Altay Coşkun with Jürgen Zeidler, \"'Cover Names' and Nomenclature in Late Roman Gaul: The Evidence of the Bordelaise Poet Ausonius\" (2003), p. 33.\n\nEpigraphic evidence\n\nThe name Cernunnos occurs only on the \"Pillar of the Boatmen\" (Pilier des nautes),Koch, Celtic Culture, p. 396 [https://books.google.com/books?idf899xH_quaMC&pg\nPA396&dqCernunnos+inauthor:Koch&hl\nen&eiCj7ETMaaO8yRnwfE6dz1CQ&sa\nX&oibook_result&ct\nresult&resnum1&ved\n0CCgQ6AEwAA#vonepage&q\nCernunnos%20inauthor%3AKoch&f=false online.] now displayed in the Musée National du Moyen Age in Paris. Constructed by Gaulish sailors probably in 14 CE,Based on the inscription (CIL XIII. 03026), on the accession of the emperor Tiberius. it was discovered in 1710 within the foundations of the cathedral of Notre-Dame de Paris, site of ancient Lutetia, the civitas capital of the Celtic Parisii. The distinctive stone pillar is an important monument of Gallo-Roman religion. Its low reliefs depict and label by name several Roman deities such as Jupiter, Vulcan, and Castor and Pollux, along with Gallic deities such as Esus, Smertrios, and Tarvos Trigaranus. The name Cernunnos can be read clearly on 18th century drawings of the inscriptions, but the initial letter has been obscured since, so that today only a reading [_]ernunnos can be verifiedPhyllis Fray Bober, Cernunnos: Origin and Transformation of a Celtic Divinity,\nAmerican Journal of Archaeology, Vol. 55, No. 1 (Jan., 1951), pp. 13-51\nhttps://www.jstor.org/stable/501179\n\nAdditional evidence is given by one inscription on a metal plaque from Steinsel-Rëlent in Luxembourg, in the territory of the Celtic Treveri. This inscriptionAE 1987, 0772 = AE 1989, 00542. read Deo Ceruninco, \"to the God Cerunincos\", assumed to be the same deity. The Gaulish inscription from MontagnacRIG 1, number G-224. reads αλλετ[ει]νος καρνονου αλ[ι]σο[ντ]εας (Alletinos [dedicated this] to Carnonos of Alisontea), with the last word possibly a place name based on Alisia, \"service-tree\" or \"rock\" (compare Alesia, Gaulish Alisiia).Delamarre, Dictionnaire pp. 38–39. See also Pierre-Yves Lambert, La langue gauloise (Éditions Errance, 2003), pp. 53 and 58.\n\nIconography\n\nThe god labelled [C]ernunnos on the Pillar of the Boatmen is depicted with stag's antlers in their early stage of annual growth.  Both antlers have torcs hanging from them. The lower part of the relief is lost, but the dimensions suggest that the god was sitting cross-legged, providing a direct parallel to the antlered figure on the Gundestrup cauldron.\n\nIn spite of the name Cernunnos being attested nowhere else, it is commonly used in Celtological literature as describing all comparable depictions of horned/antlered deities.\n\nThis \"Cernunnos\" type in Celtic iconography is often portrayed with animals, in particular the stag, and also frequently associated with the ram-horned serpent, and less frequently bulls (at Rheims), dogs and rats. Because of his frequent association with creatures, scholars often describe Cernunnos as the \"Lord of the Animals\" or the \"Lord of Wild Things\", and Miranda Green describes him as a \"peaceful god of nature and fruitfulness\".Green, Miranda (1992) Animals in Celtic Life and Myth, p. 228.\n\nThe Pilier des nautes links him with sailors and with commerce, suggesting that he was also associated with material wealth as does the coin pouch from the Cernunnos of Rheims (Marne, Champagne, France)—in antiquity, Durocortorum, the civitas capital of the Remi tribe—and the stag vomiting coins from Niedercorn-Turbelslach (Luxembourg) in the lands of the Treveri. The god may have symbolized the fecundity of the stag-inhabited forest.\n\nOther examples of \"Cernunnos\" images include a petroglyph in Val Camonica in Cisalpine Gaul. The antlered human figure has been dated as early as the 7th century BCE or as late as the 4th.Webster, \"Creolizing the Roman Provinces,\" p. 221, especially note 103. An antlered child appears on a relief from Vendeuvres, flanked by serpents and holding a purse and a torc.Anne Ross, \"Chain Symbolism in Pagan Celtic Religion,\" Speculum 34 (1959), p. 42. The best known image appears on the Gundestrup cauldron found on Jutland, dating to the 1st century BCE, thought to depict Celtic subject matter though usually regarded as of Thracian workmanship.\n\nAmong the Celtiberians, horned or antlered figures of the Cernunnos type include a \"Janus-like\" god from Candelario (Salamanca) with two faces and two small horns; a horned god from the hills of Ríotinto (Huelva); and a possible representation of the deity Vestius Aloniecus near his altars in Lourizán (Pontevedra). The horns are taken to represent \"aggressive power, genetic vigor and fecundity.\"Francisco Marco Simón, \"Religion and Religious Practices of the Ancient Celts of the Iberian Peninsula,\" e-Keltoi: Journal of Interdisciplinary Celtic Studies 6 (2005), p. 310.\n\nDivine representations of the Cernunnos type are exceptions to the often-expressed view that the Celts only began to picture their gods in human form after the Roman conquest of Gaul.Webster, \"Creolizing the Roman Provinces,\" p. 221.\nThe Celtic \"horned god\", while well attested in iconography, cannot be identified in description of Celtic religion in Roman ethnography and does not appear to have been given any interpretatio romana, perhaps due to being too distinctive to be translatable into the Roman pantheon.Jane Webster, \"Creolizing the Roman Provinces,\" American Journal of Archaeology 105 (2001), p. 222; distinctiveness of Cernunnos also in William Van Andringa, \"Religions and the Integration of Cities in the Empire in the Second Century AD: The Creation of a Common Religious Language,\" in A Companion to Roman Religion (Blackwell, 2007), pp. 87–88.\nWhile Cernunnos was never assimilated, scholars have sometimes compared him functionally to Greek and Roman divine figures such as Mercury,David M. Robinson and Elizabeth Pierce Belgen, \"Archaeological Notes and Discussions,\" American Journal of Archaeology 41 (1937), p. 132. Actaeon, specialized forms of Jupiter, and Dis Pater, the latter of whom Julius Caesar said was considered the ancestor of the Gauls.Phyllis Fray Bober, “Cernunnos: Origin and Transformation of a Celtic Divinity,” American Journal of Archaeology 55 (1951), p. 15ff.\n\nPossible reflexes in Insular Celtic\n\nThere have been attempts to find the cern root in the name of Conall Cernach, the foster brother of the Irish hero CuchulainnPorter, A Sculpture at Tandragee, p. 227. in the Ulster Cycle. In this line of interpretation, Cernach is taken as an epithet with a wide semantic field — \"angular; victorious; bearing a prominent growth\" — and Conall is seen as \"the same figure\" as the ancient Cernunnos.John Koch. (2006) Cernunnos [in] Celtic Culture: A Historical Encyclopedia, p. 396. ABC-Clio.\n\nThere is even greater evidence available to connect Conall Cernach to Cernunnos than the similarity in the names. A brief passage involving Conall in an eighth-century story entitled Táin Bó Fraích (“The Cattle Raid on Fraech”) has been questioned before for its anti-climatic conclusion to an epic Celtic tale. Anne Ross. (1967, 1996). Pagan Celtic Britain: Studies in Iconography and Tradition. Academy Chicago Publishers. In this passage Conall Cernach is portrayed as a hero and mighty warrior who assists the protagonist Fraech in rescuing his wife and son, and in reclaiming for Fraech his cattle. The fort that Conall must penetrate is guarded by a mighty serpent. The supposed anti-climax of this tale is when the fearsome serpent, instead of attacking Conall, darts to Conall’s waist and girdles him as a belt. Rather than killing the serpent, Conall allows it to live, and then proceeds to attack and rob the fort of its great treasures the serpent previously protected.\n\nCernunnos, as the conjectured Gaulish manifestation of the Roman Dis Pater, is considered to share the latter’s attributes of ruling over the hidden treasures of the underworld. Subterranean treasures were commonly linked in Medieval Bestiaries to the serpent,Charbonneau-Lassay, Louis. (1940). The Bestiary of Christ. France: Desclée, De Brouwer, & Cie. the occupant of the underground, or otherworld, and the keeper of its treasures and mysteries. This aspect of Cernunnos is depicted on a stone statue from a well in Sommerécourt, Haute-Marne, France, and on a bronze figurine from Autun. Both statue and figurine portray Cernunnos with the two ram-headed serpents encircling his waist. This is more than just a small similarity to the instance of the serpent that guarded the treasure of the fort in Táin Bó Fraích surrendering to Conall Cernach and becoming his belt. Cernunno’s connections to the deity Mars serve to underline Conall’s role as hero-warrior in the tale.\n\nThe anti-climatic nature of the eighth-century Irish tale then gains significant clarity in the light of the relationship between a horned or antler-bearing deity, warrior, or progenitor, and the chthonic dwelling, treasure-guarding serpent that encircled the waist of the one it chose to protect. This universal Celtic concept comes down to us as a mere echo of its ancient self through centuries of the Christianization of Ireland. The Gaelic Cernunnos may now possibly only be found in the slight similarity of a name and the peculiarity of a single passage from a Middle Ages Irish epic.\n\nPossible connection to Saint Ciarán\n\nSome see the qualities of Cernunnos subsumed into the life of Saint Ciarán of Saighir, one of the Twelve Apostles of Ireland. When he was building his first tiny cell, as his hagiograph goes, his first disciple and monk was a boar that had been rendered gentle by God. This was followed by a fox, a badger, a wolf and a stag.\n\nNeopaganism\n\nIn Wicca and other forms of Neopaganism a Horned God is revered; this divinity syncretises a number of horned or antlered gods from various cultures, including Cernunnos. The Horned God reflects the seasons of the year in an annual cycle of life, death and rebirth.Farrar, Stewart & Janet, Eight Sabbats for Witches\n \nIn the tradition of Gardnerian Wicca, the Horned God is sometimes specifically referred to as Cernunnos, or sometimes also as Kernunno.The Rebirth of Witchcraft, Doreen Valiente, page 52-53",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Cernunnos" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7811" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Cernunnos is the conventional name given in Celtic studies to depictions of the \"horned god\" of Celtic polytheism. Cernunnos was a Celtic god of fertility, life, animals, wealth, and the underworld. The name itself is only attested once, on the 1st-century Pillar of the Boatmen, but he appears all over Gaul, and among the Celtiberians. Cernunnos is depicted with the antlers of a stag, sometimes carries a purse filled with coin, often seated cross-legged and often associated with animals and holding or wearing torcs, are known from over 50 examples in the Gallo-Roman period, mostly in north-eastern Gaul.Green, Miranda, Celtic Art, Reading the Messages, p. 147, 1996, The Everyman Art Library,  \n\nNot much is known about the god from literary sources, and details about his name, his followers or his significance in Celtic religion are unknown. Speculative interpretations identify him as a god of nature, life or fertility. \n\nName\n\nThe theonym [C]ernunnos appears on the Pillar of the Boatmen, a Gallo-Roman monument dating to the early 1st century CE, to label a god depicted with stag's antlers in their early stage of annual growth. A. Kingsley Porter, \"A Sculpture at Tandragee,\" Burlington Magazine 65 (1934), p. 227, pointing out the relative maturation of the antlers. Both antlers have torcs hanging from them.\n\nThe name has been compared to a divine epithet Carnonos in a Celtic inscription written in Greek characters at Montagnac, Hérault (as καρνονου, karnonou, in the dative case).Xavier Delamarre, Dictionnaire de la langue gauloise (Éditions Errance, 2003), pp. 106–107.\nA Gallo-Latin adjective carnuātus, \"horned,\" is also found. Equivalent to Latin cornutus, \"horned\"; Delamarre, citing J. Vendryes, Revue Celtique 42 (1925) 221–222.\n\nThe Proto-Celtic form of the theonym is reconstructed as either *Cerno-on-os or *Carno-on-os. The augmentative -on- is characteristic of theonyms, as in Maponos, Epona, Matronae, and Sirona.Delamarre, citing M. Lejeune, Lepontica (Paris 1971), p. 325.\nMaier (2010) states that the etymology of Cernunnos is unknown, as the Celtic word for \"horn\" has an a (as in Carnonos).Bernard Maier, Dictionary of Celtic Religion and Culture (Alfred Kröner, 1994; Boydell, 2000), p. 69 [https://books.google.com/books?id\n7AvdTqwucfwC&pgPA69&dq\n%22the+etymology+of+whose+name+is+unclear%22&hlen&ei\n2E3ETPjlFcWOnwfrmpHZCQ&saX&oi\nbook_result&ctresult&resnum\n1&ved0CC0Q6AEwAA#v\nonepage&q%22the%20etymology%20of%20whose%20name%20is%20unclear%22&f\nfalse online.]\n\nGaulish karnon \"horn\"is cognate with Latin cornu and Germanic *hurnaz, English horn, ultimately from Proto-Indo-European '.Pokorny (1959) \"k̑er-, k̑erə-; k̑rā-, k̑erei-, k̑ereu\"[http://www.utexas.edu/cola/centers/lrc/ielex/X/P0929.html]\nThe etymon karn- \"horn\" appears in both Gaulish and Galatian branches of Continental Celtic. Hesychius of Alexandria glosses the Galatian word karnon (κάρνον) as \"Gallic trumpet\", that is, the Celtic military horn listed as the carnyx (κάρνυξ) by Eustathius of Thessalonica, who notes the instrument's animal-shaped bell.Delamarre; Greek text and English translation of the passage from Eustathius' Homeric commentaries given by Edward Wigan, \"Account of a Collection of Roman Gold Coins,\" Numismatic Chronicle 5 (1865), p. 11 [https://books.google.com/books?id0VwUAAAAYAAJ&pg\nPA11&dqcarnyx+Eustathius&hl\nen&eiyEPDTMPmA4SfnAf__a3UCQ&sa\nX&oibook_result&ct\nresult&resnum2&ved\n0CCsQ6AEwAQ#vonepage&q\ncarnyx%20Eustathius&f=false online.] The root also appears in the names of Celtic polities, most prominent among them the Carnutes, meaning something like \"the Horned Ones,\"Also Carni and Carnonacae. and in several personal names found in inscriptions.Such as Carnarus, Carnatus, Carneolus, Carnius and Carnicus; Altay Coşkun with Jürgen Zeidler, \"'Cover Names' and Nomenclature in Late Roman Gaul: The Evidence of the Bordelaise Poet Ausonius\" (2003), p. 33.\n\nEpigraphic evidence\n\nThe name Cernunnos occurs only on the \"Pillar of the Boatmen\" (Pilier des nautes),Koch, Celtic Culture, p. 396 [https://books.google.com/books?idf899xH_quaMC&pg\nPA396&dqCernunnos+inauthor:Koch&hl\nen&eiCj7ETMaaO8yRnwfE6dz1CQ&sa\nX&oibook_result&ct\nresult&resnum1&ved\n0CCgQ6AEwAA#vonepage&q\nCernunnos%20inauthor%3AKoch&f=false online.] now displayed in the Musée National du Moyen Age in Paris. Constructed by Gaulish sailors probably in 14 CE,Based on the inscription (CIL XIII. 03026), on the accession of the emperor Tiberius. it was discovered in 1710 within the foundations of the cathedral of Notre-Dame de Paris, site of ancient Lutetia, the civitas capital of the Celtic Parisii. The distinctive stone pillar is an important monument of Gallo-Roman religion. Its low reliefs depict and label by name several Roman deities such as Jupiter, Vulcan, and Castor and Pollux, along with Gallic deities such as Esus, Smertrios, and Tarvos Trigaranus. The name Cernunnos can be read clearly on 18th century drawings of the inscriptions, but the initial letter has been obscured since, so that today only a reading [_]ernunnos can be verifiedPhyllis Fray Bober, Cernunnos: Origin and Transformation of a Celtic Divinity,\nAmerican Journal of Archaeology, Vol. 55, No. 1 (Jan., 1951), pp. 13-51\nhttps://www.jstor.org/stable/501179\n\nAdditional evidence is given by one inscription on a metal plaque from Steinsel-Rëlent in Luxembourg, in the territory of the Celtic Treveri. This inscriptionAE 1987, 0772 = AE 1989, 00542. read Deo Ceruninco, \"to the God Cerunincos\", assumed to be the same deity. The Gaulish inscription from MontagnacRIG 1, number G-224. reads αλλετ[ει]νος καρνονου αλ[ι]σο[ντ]εας (Alletinos [dedicated this] to Carnonos of Alisontea), with the last word possibly a place name based on Alisia, \"service-tree\" or \"rock\" (compare Alesia, Gaulish Alisiia).Delamarre, Dictionnaire pp. 38–39. See also Pierre-Yves Lambert, La langue gauloise (Éditions Errance, 2003), pp. 53 and 58.\n\nIconography\n\nThe god labelled [C]ernunnos on the Pillar of the Boatmen is depicted with stag's antlers in their early stage of annual growth.  Both antlers have torcs hanging from them. The lower part of the relief is lost, but the dimensions suggest that the god was sitting cross-legged, providing a direct parallel to the antlered figure on the Gundestrup cauldron.\n\nIn spite of the name Cernunnos being attested nowhere else, it is commonly used in Celtological literature as describing all comparable depictions of horned/antlered deities.\n\nThis \"Cernunnos\" type in Celtic iconography is often portrayed with animals, in particular the stag, and also frequently associated with the ram-horned serpent, and less frequently bulls (at Rheims), dogs and rats. Because of his frequent association with creatures, scholars often describe Cernunnos as the \"Lord of the Animals\" or the \"Lord of Wild Things\", and Miranda Green describes him as a \"peaceful god of nature and fruitfulness\".Green, Miranda (1992) Animals in Celtic Life and Myth, p. 228.\n\nThe Pilier des nautes links him with sailors and with commerce, suggesting that he was also associated with material wealth as does the coin pouch from the Cernunnos of Rheims (Marne, Champagne, France)—in antiquity, Durocortorum, the civitas capital of the Remi tribe—and the stag vomiting coins from Niedercorn-Turbelslach (Luxembourg) in the lands of the Treveri. The god may have symbolized the fecundity of the stag-inhabited forest.\n\nOther examples of \"Cernunnos\" images include a petroglyph in Val Camonica in Cisalpine Gaul. The antlered human figure has been dated as early as the 7th century BCE or as late as the 4th.Webster, \"Creolizing the Roman Provinces,\" p. 221, especially note 103. An antlered child appears on a relief from Vendeuvres, flanked by serpents and holding a purse and a torc.Anne Ross, \"Chain Symbolism in Pagan Celtic Religion,\" Speculum 34 (1959), p. 42. The best known image appears on the Gundestrup cauldron found on Jutland, dating to the 1st century BCE, thought to depict Celtic subject matter though usually regarded as of Thracian workmanship.\n\nAmong the Celtiberians, horned or antlered figures of the Cernunnos type include a \"Janus-like\" god from Candelario (Salamanca) with two faces and two small horns; a horned god from the hills of Ríotinto (Huelva); and a possible representation of the deity Vestius Aloniecus near his altars in Lourizán (Pontevedra). The horns are taken to represent \"aggressive power, genetic vigor and fecundity.\"Francisco Marco Simón, \"Religion and Religious Practices of the Ancient Celts of the Iberian Peninsula,\" e-Keltoi: Journal of Interdisciplinary Celtic Studies 6 (2005), p. 310.\n\nDivine representations of the Cernunnos type are exceptions to the often-expressed view that the Celts only began to picture their gods in human form after the Roman conquest of Gaul.Webster, \"Creolizing the Roman Provinces,\" p. 221.\nThe Celtic \"horned god\", while well attested in iconography, cannot be identified in description of Celtic religion in Roman ethnography and does not appear to have been given any interpretatio romana, perhaps due to being too distinctive to be translatable into the Roman pantheon.Jane Webster, \"Creolizing the Roman Provinces,\" American Journal of Archaeology 105 (2001), p. 222; distinctiveness of Cernunnos also in William Van Andringa, \"Religions and the Integration of Cities in the Empire in the Second Century AD: The Creation of a Common Religious Language,\" in A Companion to Roman Religion (Blackwell, 2007), pp. 87–88.\nWhile Cernunnos was never assimilated, scholars have sometimes compared him functionally to Greek and Roman divine figures such as Mercury,David M. Robinson and Elizabeth Pierce Belgen, \"Archaeological Notes and Discussions,\" American Journal of Archaeology 41 (1937), p. 132. Actaeon, specialized forms of Jupiter, and Dis Pater, the latter of whom Julius Caesar said was considered the ancestor of the Gauls.Phyllis Fray Bober, “Cernunnos: Origin and Transformation of a Celtic Divinity,” American Journal of Archaeology 55 (1951), p. 15ff.\n\nPossible reflexes in Insular Celtic\n\nThere have been attempts to find the cern root in the name of Conall Cernach, the foster brother of the Irish hero CuchulainnPorter, A Sculpture at Tandragee, p. 227. in the Ulster Cycle. In this line of interpretation, Cernach is taken as an epithet with a wide semantic field — \"angular; victorious; bearing a prominent growth\" — and Conall is seen as \"the same figure\" as the ancient Cernunnos.John Koch. (2006) Cernunnos [in] Celtic Culture: A Historical Encyclopedia, p. 396. ABC-Clio.\n\nThere is even greater evidence available to connect Conall Cernach to Cernunnos than the similarity in the names. A brief passage involving Conall in an eighth-century story entitled Táin Bó Fraích (“The Cattle Raid on Fraech”) has been questioned before for its anti-climatic conclusion to an epic Celtic tale. Anne Ross. (1967, 1996). Pagan Celtic Britain: Studies in Iconography and Tradition. Academy Chicago Publishers. In this passage Conall Cernach is portrayed as a hero and mighty warrior who assists the protagonist Fraech in rescuing his wife and son, and in reclaiming for Fraech his cattle. The fort that Conall must penetrate is guarded by a mighty serpent. The supposed anti-climax of this tale is when the fearsome serpent, instead of attacking Conall, darts to Conall’s waist and girdles him as a belt. Rather than killing the serpent, Conall allows it to live, and then proceeds to attack and rob the fort of its great treasures the serpent previously protected.\n\nCernunnos, as the conjectured Gaulish manifestation of the Roman Dis Pater, is considered to share the latter’s attributes of ruling over the hidden treasures of the underworld. Subterranean treasures were commonly linked in Medieval Bestiaries to the serpent,Charbonneau-Lassay, Louis. (1940). The Bestiary of Christ. France: Desclée, De Brouwer, & Cie. the occupant of the underground, or otherworld, and the keeper of its treasures and mysteries. This aspect of Cernunnos is depicted on a stone statue from a well in Sommerécourt, Haute-Marne, France, and on a bronze figurine from Autun. Both statue and figurine portray Cernunnos with the two ram-headed serpents encircling his waist. This is more than just a small similarity to the instance of the serpent that guarded the treasure of the fort in Táin Bó Fraích surrendering to Conall Cernach and becoming his belt. Cernunno’s connections to the deity Mars serve to underline Conall’s role as hero-warrior in the tale.\n\nThe anti-climatic nature of the eighth-century Irish tale then gains significant clarity in the light of the relationship between a horned or antler-bearing deity, warrior, or progenitor, and the chthonic dwelling, treasure-guarding serpent that encircled the waist of the one it chose to protect. This universal Celtic concept comes down to us as a mere echo of its ancient self through centuries of the Christianization of Ireland. The Gaelic Cernunnos may now possibly only be found in the slight similarity of a name and the peculiarity of a single passage from a Middle Ages Irish epic.\n\nPossible connection to Saint Ciarán\n\nSome see the qualities of Cernunnos subsumed into the life of Saint Ciarán of Saighir, one of the Twelve Apostles of Ireland. When he was building his first tiny cell, as his hagiograph goes, his first disciple and monk was a boar that had been rendered gentle by God. This was followed by a fox, a badger, a wolf and a stag.\n\nNeopaganism\n\nIn Wicca and other forms of Neopaganism a Horned God is revered; this divinity syncretises a number of horned or antlered gods from various cultures, including Cernunnos. The Horned God reflects the seasons of the year in an annual cycle of life, death and rebirth.Farrar, Stewart & Janet, Eight Sabbats for Witches\n \nIn the tradition of Gardnerian Wicca, the Horned God is sometimes specifically referred to as Cernunnos, or sometimes also as Kernunno.The Rebirth of Witchcraft, Doreen Valiente, page 52-53. Cernunnos. http://en.wikipedia.org/?curid=7811."
  }
}
