{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=7283",
  "eid" : "e0d36700-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778456944,
  "textBody" : "Controversy is a state of prolonged public dispute or debate, usually concerning a matter of conflicting opinion or point of view. The word was coined from the Latin controversia, as a composite of controversus – \"turned in an opposite direction,\" from contra – \"against\" – and vertere – to turn, or versus (see verse), hence, \"to turn against.\"\n\nThe most applicable or well known controversial subjects, topics or areas are politics, religion, philosophy, parenting and sex.U.S. News & World Report, Volume 117, [https://books.google.com/books?id6D4vAAAAYAAJ Issues 10–17], 1994 quotation: Kenneth L. Karst (1995) [https://books.google.com/books?id\nsDaVhSJOgIYC&pg=PA37 Law's Promise, Law's Expression] p.137 quotation: Susan Spencer, Margo Collins, Albert J. Rivero (2004) The eighteenth-century novel: Volume 4 p.6  History is similarly controversial. Other prominent areas of controversy are economics, science, finances, culture, education, the military, society, celebrities, organisation, the media, age, gender, and race. Controversy in matters of theology has traditionally been particularly heated, giving rise to the phrase odium theologicum. Controversial issues are held as potentially divisive in a given society, because they can lead to tension and ill will, and as a result they are often considered taboo to be discussed in the light of company in many cultures.\n\nLegal controversy\n\nIn the theory of law, a controversy differs from a legal case; while legal cases include all suits, criminal as well as civil, a controversy is a purely civil proceeding.\n\nFor example, the Case or Controversy Clause of Article Three of the United States Constitution (Section 2, Clause 1) states that \"the judicial Power shall extend ... to Controversies to which the United States shall be a Party\". This clause has been deemed to impose a requirement that United States federal courts are not permitted to hear cases that do not pose an actual controversy—that is, an actual dispute between adverse parties which is capable of being resolved by the [court]. In addition to setting out the scope of the jurisdiction of the federal judiciary, it also prohibits courts from issuing advisory opinions, or from hearing cases that are either unripe, meaning that the controversy has not arisen yet, or moot, meaning that the controversy has already been  resolved.\n\nBenford's law\n\nBenford's law of controversy, as expressed by the astrophysicist and science fiction author Gregory Benford in 1980, states: Passion is inversely proportional to the amount of real information available. In other words, it claims that the less factual information is available on a topic, the more controversy can arise around that topic – and the more facts are available, the less controversy can arise. Thus, for example, controversies in physics would be limited to subject areas where experiments cannot be carried out yet, whereas controversies would be inherent to politics, where communities must frequently decide on courses of action based on insufficient information.\n\nPsychological bases\n\nControversies are frequently thought to be a result of a lack of confidence on the part of the disputants – as implied by Benford's law of controversy, which only talks about lack of information (\"passion is inversely proportional to the amount of real information available\"). For example, in analyses of the political controversy over anthropogenic climate change, which is exceptionally virulent in the United States, it has been proposed that those who are opposed to the scientific consensus do so because they don't have enough information about the topic. A study of 1540 US adults found instead that levels of scientific literacy correlated with the strength of opinion on climate change, but not on which side of the debate that they stood.\n\nThe puzzling phenomenon of two individuals being able to reach different conclusions after being exposed to the same facts has been frequently explained (particularly by Daniel Kahneman) by reference to a 'bounded rationality' – in other words, that most judgments are made using fast acting heuristics that work well in every day situations, but are not amenable to decision making about complex subjects such as climate change. Anchoring has been particularly identified as relevant in climate change controversies  as individuals are found to be more positively inclined to believe in climate change if the outside temperature is higher, if they have been primed to think about heat, and if they are primed with higher temperatures when thinking about the future temperature increases from climate change.\n\nIn other controversies – such as that around the HPV vaccine, the same evidence seemed to license inference to radically different conclusions. Kahan et al. explained this by the cognitive biases of biased assimilation and a credibility heuristic.\n\nSimilar effects on reasoning are also seen in non-scientific controversies, for example in the gun control debate in the United States. As with other controversies, it has been suggested that exposure to empirical facts would be sufficient to resolve the debate once and for all. In computer simulations of cultural communities, beliefs were found to polarize within isolated sub-groups, based on the mistaken belief of the community's unhindered access to ground truth. Such confidence in the group to find the ground truth is explicable through the success of wisdom of the crowd based inferences, however, if there is no access to the ground truth, as there was not in this model, the method will fail.\n\nBayesian decision theory allows these failures of rationality to be described as part of a statistically optimized system for decision making. Experiments and computational models in multisensory integration have shown that sensory input from different senses is integrated in a statistically optimal way, in addition, it appears that the kind of inferences used to infer single sources for multiple sensory inputs uses a Bayesian inference about the causal origin of the sensory stimuli. As such, it appears neurobiologically plausible that the brain implements decision-making procedures that are close to optimal for Bayesian inference.\n\nBrocas and Carrillo propose a model to make decisions based on noisy sensory inputs, beliefs about the state of the world are modified by Bayesian updating, and then decisions are made based on beliefs passing a threshold. They show that this model, when optimized for single-step decision making, produces belief anchoring and polarization of opinions – exactly as described in the global warming controversy context – in spite of identical evidence presented, the pre-existing beliefs (or evidence presented first) has an overwhelming effect on the beliefs formed. In addition, the preferences of the agent (the particular rewards that they value) also cause the beliefs formed to change – this explains the biased assimilation (also known as confirmation bias) shown above. This model allows the production of controversy to be seen as a consequence of a decision maker optimized for single-step decision making, rather than as a result of limited reasoning in the bounded rationality of Daniel Kahneman.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Controversy" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=7283" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Controversy is a state of prolonged public dispute or debate, usually concerning a matter of conflicting opinion or point of view. The word was coined from the Latin controversia, as a composite of controversus – \"turned in an opposite direction,\" from contra – \"against\" – and vertere – to turn, or versus (see verse), hence, \"to turn against.\"\n\nThe most applicable or well known controversial subjects, topics or areas are politics, religion, philosophy, parenting and sex.U.S. News & World Report, Volume 117, [https://books.google.com/books?id6D4vAAAAYAAJ Issues 10–17], 1994 quotation: Kenneth L. Karst (1995) [https://books.google.com/books?id\nsDaVhSJOgIYC&pg=PA37 Law's Promise, Law's Expression] p.137 quotation: Susan Spencer, Margo Collins, Albert J. Rivero (2004) The eighteenth-century novel: Volume 4 p.6  History is similarly controversial. Other prominent areas of controversy are economics, science, finances, culture, education, the military, society, celebrities, organisation, the media, age, gender, and race. Controversy in matters of theology has traditionally been particularly heated, giving rise to the phrase odium theologicum. Controversial issues are held as potentially divisive in a given society, because they can lead to tension and ill will, and as a result they are often considered taboo to be discussed in the light of company in many cultures.\n\nLegal controversy\n\nIn the theory of law, a controversy differs from a legal case; while legal cases include all suits, criminal as well as civil, a controversy is a purely civil proceeding.\n\nFor example, the Case or Controversy Clause of Article Three of the United States Constitution (Section 2, Clause 1) states that \"the judicial Power shall extend ... to Controversies to which the United States shall be a Party\". This clause has been deemed to impose a requirement that United States federal courts are not permitted to hear cases that do not pose an actual controversy—that is, an actual dispute between adverse parties which is capable of being resolved by the [court]. In addition to setting out the scope of the jurisdiction of the federal judiciary, it also prohibits courts from issuing advisory opinions, or from hearing cases that are either unripe, meaning that the controversy has not arisen yet, or moot, meaning that the controversy has already been  resolved.\n\nBenford's law\n\nBenford's law of controversy, as expressed by the astrophysicist and science fiction author Gregory Benford in 1980, states: Passion is inversely proportional to the amount of real information available. In other words, it claims that the less factual information is available on a topic, the more controversy can arise around that topic – and the more facts are available, the less controversy can arise. Thus, for example, controversies in physics would be limited to subject areas where experiments cannot be carried out yet, whereas controversies would be inherent to politics, where communities must frequently decide on courses of action based on insufficient information.\n\nPsychological bases\n\nControversies are frequently thought to be a result of a lack of confidence on the part of the disputants – as implied by Benford's law of controversy, which only talks about lack of information (\"passion is inversely proportional to the amount of real information available\"). For example, in analyses of the political controversy over anthropogenic climate change, which is exceptionally virulent in the United States, it has been proposed that those who are opposed to the scientific consensus do so because they don't have enough information about the topic. A study of 1540 US adults found instead that levels of scientific literacy correlated with the strength of opinion on climate change, but not on which side of the debate that they stood.\n\nThe puzzling phenomenon of two individuals being able to reach different conclusions after being exposed to the same facts has been frequently explained (particularly by Daniel Kahneman) by reference to a 'bounded rationality' – in other words, that most judgments are made using fast acting heuristics that work well in every day situations, but are not amenable to decision making about complex subjects such as climate change. Anchoring has been particularly identified as relevant in climate change controversies  as individuals are found to be more positively inclined to believe in climate change if the outside temperature is higher, if they have been primed to think about heat, and if they are primed with higher temperatures when thinking about the future temperature increases from climate change.\n\nIn other controversies – such as that around the HPV vaccine, the same evidence seemed to license inference to radically different conclusions. Kahan et al. explained this by the cognitive biases of biased assimilation and a credibility heuristic.\n\nSimilar effects on reasoning are also seen in non-scientific controversies, for example in the gun control debate in the United States. As with other controversies, it has been suggested that exposure to empirical facts would be sufficient to resolve the debate once and for all. In computer simulations of cultural communities, beliefs were found to polarize within isolated sub-groups, based on the mistaken belief of the community's unhindered access to ground truth. Such confidence in the group to find the ground truth is explicable through the success of wisdom of the crowd based inferences, however, if there is no access to the ground truth, as there was not in this model, the method will fail.\n\nBayesian decision theory allows these failures of rationality to be described as part of a statistically optimized system for decision making. Experiments and computational models in multisensory integration have shown that sensory input from different senses is integrated in a statistically optimal way, in addition, it appears that the kind of inferences used to infer single sources for multiple sensory inputs uses a Bayesian inference about the causal origin of the sensory stimuli. As such, it appears neurobiologically plausible that the brain implements decision-making procedures that are close to optimal for Bayesian inference.\n\nBrocas and Carrillo propose a model to make decisions based on noisy sensory inputs, beliefs about the state of the world are modified by Bayesian updating, and then decisions are made based on beliefs passing a threshold. They show that this model, when optimized for single-step decision making, produces belief anchoring and polarization of opinions – exactly as described in the global warming controversy context – in spite of identical evidence presented, the pre-existing beliefs (or evidence presented first) has an overwhelming effect on the beliefs formed. In addition, the preferences of the agent (the particular rewards that they value) also cause the beliefs formed to change – this explains the biased assimilation (also known as confirmation bias) shown above. This model allows the production of controversy to be seen as a consequence of a decision maker optimized for single-step decision making, rather than as a result of limited reasoning in the bounded rationality of Daniel Kahneman. Controversy. http://en.wikipedia.org/?curid=7283."
  }
}
