{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=3758",
  "eid" : "c89afe50-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778416309,
  "textBody" : "Berkelium is a transuranic radioactive chemical element with symbol Bk and atomic number 97. It is a member of the actinide and transuranium element series. It is named after the city of Berkeley, California, the location of the Lawrence Berkeley National Laboratory (then the University of California Radiation Laboratory) where it was discovered in December 1949. Berkelium was the fifth transuranium element discovered after neptunium, plutonium, curium and americium.\n\nThe major isotope of berkelium, 249Bk, is synthesized in minute quantities in dedicated high-flux nuclear reactors, mainly at the Oak Ridge National Laboratory in Tennessee, USA, and at the Research Institute of Atomic Reactors in Dimitrovgrad, Russia. The production of the second-most important isotope 247Bk involves the irradiation of the rare isotope 244Cm with high-energy alpha particles.\n\nJust over one gram of berkelium has been produced in the United States since 1967. There is no practical application of berkelium outside scientific research which is mostly directed at the synthesis of heavier transuranic elements and transactinides. A 22 milligram batch of berkelium-249 was prepared during a 250-day irradiation period and then purified for a further 90 days at Oak Ridge in 2009. This sample was used to synthesize the new element tennessine for the first time in 2009 at the Joint Institute for Nuclear Research, Russia, after it was bombarded with calcium-48 ions for 150 days. This was the culmination of the Russia–US collaboration on the synthesis of the heaviest elements on the periodic table.\n\nBerkelium is a soft, silvery-white, radioactive metal. The berkelium-249 isotope emits low-energy electrons and thus is relatively safe to handle. It decays with a half-life of 330 days to californium-249, which is a strong emitter of ionizing alpha particles. This gradual transformation is an important consideration when studying the properties of elemental berkelium and its chemical compounds, since the formation of californium brings not only chemical contamination, but also free-radical effects and self-heating from the emitted alpha particles.\n\nCharacteristics\n\nPhysical\n\nBerkelium is a soft, silvery-white, radioactive actinide metal. In the periodic table, it is located to the right of the actinide curium, to the left of the actinide californium and below the lanthanide terbium with which it shares many similarities in physical and chemical properties. Its density of 14.78 g/cm3 lies between those of curium (13.52 g/cm3) and californium (15.1 g/cm3), as does its melting point of 986 °C, below that of curium (1340 °C) but higher than that of californium (900 °C). Berkelium is relatively soft and has one of the lowest bulk moduli among the actinides, at about 20 GPa (2 Pa).\n\nBerkelium(III) ions shows two sharp fluorescence peaks at 652 nanometers (red light) and 742 nanometers (deep red – near infrared) due to internal transitions at the f-electron shell. The relative intensity of these peaks depends on the excitation power and temperature of the sample. This emission can be observed, for example, after dispersing berkelium ions in a silicate glass, by melting the glass in presence of berkelium oxide or halide.Rita Cornelis, Joe Caruso, Helen Crews, Klaus Heumann [https://books.google.com/books?id1PmjurlE6KkC&pg\nPA553 Handbook of elemental speciation II: species in the environment, food, medicine & occupational health. Volume 2 of Handbook of Elemental Speciation], John Wiley and Sons, 2005,  p. 553\n\nBetween 70 K and room temperature, berkelium behaves as a Curie–Weiss paramagnetic material with an effective magnetic moment of 9.69 Bohr magnetons (µB) and a Curie temperature of 101 K. This magnetic moment is almost equal to the theoretical value of 9.72 µB calculated within the simple atomic L-S coupling model. Upon cooling to about 34 K, berkelium undergoes a transition to an antiferromagnetic state. Enthalpy of dissolution in hydrochloric acid at standard conditions is −600 kJ/mol−1, from which the standard enthalpy change of formation (ΔfH°) of aqueous Bk3+ ions is obtained as −601 kJ/mol−1. The standard potential Bk3+/Bk0 is −2.01 V. The ionization potential of a neutral berkelium atom is 6.23 eV.\n\nAllotropes\n\nAt ambient conditions, berkelium assumes its most stable α form which has a hexagonal symmetry, space group P63/mmc, lattice parameters of 341 pm and 1107 pm. The crystal has a double-hexagonal close packing structure with the layer sequence ABAC and so is isotypic (having a similar structure) with α-lanthanum and α-forms of actinides beyond curium. This crystal structure changes with pressure and temperature. When compressed at room temperature to 7 GPa, α-berkelium transforms to the beta modification, which has a face-centered cubic (fcc) symmetry and space group Fmm. This transition occurs without change in volume, but the enthalpy increases by 3.66 kJ/mol. Upon further compression to 25 GPa, berkelium transforms to an orthorhombic γ-berkelium structure similar to that of α-uranium. This transition is accompanied by a 12% volume decrease and delocalization of the electrons at the 5f electron shell. No further phase transitions are observed up to 57 GPa.Young, David A. [https://books.google.com/books?id\nF2HVYh6wLBcC&pg=PA228 Phase diagrams of the elements], University of California Press, 1991,  p. 228\n\nUpon heating, α-berkelium transforms into another phase with an fcc lattice (but slightly different from β-berkelium), space group Fmm and the lattice constant of 500 pm; this fcc structure is equivalent to the closest packing with the sequence ABC. This phase is metastable and will gradually revert to the original α-berkelium phase at room temperature. The temperature of the phase transition is believed to be quite close to the melting point.\n\nChemical\n\nLike all actinides, berkelium dissolves in various aqueous inorganic acids, liberating gaseous hydrogen and converting into the berkelium(III) state. This trivalent oxidation state (+3) is the most stable, especially in aqueous solutions, but tetravalent (+4) and possibly divalent (+2) berkelium compounds are also known. The existence of divalent berkelium salts is uncertain and has only been reported in mixed lanthanum chloride-strontium chloride melts. A similar behavior is observed for the lanthanide analogue of berkelium, terbium. Aqueous solutions of Bk3+ ions are green in most acids. The color of Bk4+ ions is yellow in hydrochloric acid and orange-yellow in sulfuric acid. Berkelium does not react rapidly with oxygen at room temperature, possibly due to the formation of a protective oxide layer surface. However, it reacts with molten metals, hydrogen, halogens, chalcogens and pnictogens to form various binary compounds.\n\nIsotopes\n\nAbout twenty isotopes and six nuclear isomers (excited states of an isotope) of berkelium have been characterized with the mass numbers ranging from 235 to 254. All of them are radioactive. The longest half-lives are observed for 247Bk (1,380 years), 248Bk (over 300 years) and 249Bk (330 days); the half-lives of the other isotopes range from microseconds to several days. The isotope which is the easiest to synthesize is berkelium-249. This emits mostly soft β-particles which are inconvenient for detection. Its alpha radiation is rather weak – 1.45% with respect to the β-radiation – but is sometimes used to detect this isotope. The second important berkelium isotope, berkelium-247, is an alpha-emitter, as are most actinide isotopes.\n\nOccurrence\n\nAll berkelium isotopes have a half-life far too short to be primordial. Therefore, any primordial berkelium, that is, berkelium present on the Earth during its formation, has decayed by now.\n\nOn Earth, berkelium is mostly concentrated in certain areas, which were used for the atmospheric nuclear weapons tests between 1945 and 1980, as well as at the sites of nuclear incidents, such as the Chernobyl disaster, Three Mile Island accident and 1968 Thule Air Base B-52 crash. Analysis of the debris at the testing site of the first U.S. hydrogen bomb, Ivy Mike, (1 November 1952, Enewetak Atoll), revealed high concentrations of various actinides, including berkelium. For reasons of military secrecy, this result was published only in 1956.\n\nNuclear reactors produce mostly, among the berkelium isotopes, berkelium-249. During the storage and before the fuel disposal, most of it beta decays to californium-249. The latter has a half-life of 351 years, which is relatively long when compared to the other isotopes produced in the reactor, and is therefore undesirable in the disposal products.\n\nThe transuranic elements from americium to fermium, including berkelium, occurred naturally in the natural nuclear fission reactor at Oklo, but no longer do so.\n\nHistory\n\nAlthough very small amounts of berkelium were possibly produced in previous nuclear experiments, it was first intentionally synthesized, isolated and identified in December 1949 by Glenn T. Seaborg, Albert Ghiorso, Stanley G. Thompson, and Kenneth Street, Jr.. They used the 60-inch cyclotron at the University of California, Berkeley. Similar to the nearly simultaneous discovery of americium (element 95) and curium (element 96) in 1944, the new elements berkelium and californium (element 98) were both produced in 1949–1950. [http://www.osti.gov/cgi-bin/rd_accomplishments/display_biblio.cgi?idACC0045&numPages\n38&fp=N Abstract]\n\nThe name choice for element 97 followed the previous tradition of the Californian group to draw an analogy between the newly discovered actinide and the lanthanide element positioned above it in the periodic table. Previously, americium was named after a continent as its analogue europium, and curium honored scientists Marie and Pierre Curie as the lanthanide above it, gadolinium, was named after the explorer of the rare earth elements Johan Gadolin. Thus the discovery report by the Berkeley group reads: \"It is suggested that element 97 be given the name berkelium (symbol Bk) after the city of Berkeley in a manner similar to that used in naming its chemical homologue terbium (atomic number 65) whose name was derived from the town of Ytterby, Sweden, where the rare earth minerals were first found.\" This tradition ended on berkelium, though, as the naming of the next discovered actinide, californium, was not related to its lanthanide analogue dysprosium, but after the discovery place.\n\nThe most difficult steps in the synthesis of berkelium were its separation from the final products and the production of sufficient quantities of americium for the target material. First, americium (241Am) nitrate solution was coated on a platinum foil, the solution was evaporated and the residue converted by annealing to americium dioxide (AmO2). This target was irradiated with 35 MeV alpha particles for 6 hours in the 60-inch cyclotron at the Lawrence Radiation Laboratory, University of California, Berkeley. The (α,2n) reaction induced by the irradiation yielded the 243Bk isotope and two free neutrons:\n\n\\mathrm{^{241}_{\\ 95}Am\\ +\\ ^{4}_{2}He\\ \\longrightarrow \\ ^{243}_{\\ 97}Bk\\ +\\ 2\\ ^{1}_{0}n}\n\nAfter the irradiation, the coating was dissolved with nitric acid and then precipitated as the hydroxide using concentrated aqueous ammonia solution. The product was centrifugated and re-dissolved in nitric acid. To separate berkelium from the unreacted americium, this solution was added to a mixture of ammonium and ammonium sulfate and heated to convert all the dissolved americium into the oxidation state +6. Unoxidized residual americium was precipitated by the addition of hydrofluoric acid as americium(III) fluoride (). This step yielded a mixture of the accompanying product curium and the expected element 97 in form of trifluorides. The mixture was converted to the corresponding hydroxides by treating it with potassium hydroxide, and after centrifugation, was dissolved in perchloric acid.\n\nFurther separation was carried out in the presence of a citric acid/ammonium buffer solution in a weakly acidic medium (pH≈3.5), using ion exchange at elevated temperature. The chromatographic separation behavior was then unknown for the element 97, but was anticipated by analogy with terbium (see elution curves). First results were disappointing as no alpha-particle emission signature could be detected from the elution product. Only the further search for characteristic X-rays and conversion electron signals resulted in the identification of a berkelium isotope. Its mass number was uncertain between 243 and 244 in the initial report, but was later established as 243.\n\nSynthesis and extraction\n\nPreparation of isotopes\n\nBerkelium is produced by bombarding lighter actinides uranium (238U) or plutonium (239Pu) with neutrons in a nuclear reactor. In a more common case of uranium fuel, plutonium is produced first by neutron capture (the so-called (n,γ) reaction or neutron fusion) followed by beta-decay:\n\n^{238}_{92}U ->[\\ce{(n,\\gamma)}] ^{239}_{92}U ->[\\beta^-][23.5 \\ \\ce{min}] ^{239}_{93}Np ->[\\beta^-][2.3565 \\ \\ce d] ^{239}_{94}Pu (the times are half-lives)\n\nPlutonium-239 is further irradiated by a source that has a high neutron flux, several times higher than a conventional nuclear reactor, such as the 85-megawatt High Flux Isotope Reactor (HFIR) at the Oak Ridge National Laboratory in Tennessee, USA. The higher flux promotes fusion reactions involving not one but several neutrons, converting 239Pu to 244Cm and then to 249Cm:\n\\begin{align}\n\\ce{^{239}_{94}Pu ->[\\ce{4(n,\\gamma)}] ^{243}_{94}Pu ->[\\beta^-][4.956 \\ \\ce h] ^{243}_{95}Am ->[\\ce{(n,\\gamma)}] ^{244}_{95}Am ->[\\beta^-][10.1 \\ \\ce h]} &\\ce{^{244}_{96}Cm}\\\\\n&\\ce{^{244}_{96}Cm ->[\\ce{5(n,\\gamma)}] ^{249}_{96}Cm}\n\\end{align}\n\nCurium-249 has a short half-life of 64 minutes, and thus its further conversion to 250Cm has a low probability. Instead, it transforms by beta-decay into 249Bk:\n^{249}_{96}Cm ->[\\overset{}{\\beta^-}][64.15 \\ \\ce{min}] ^{249}_{97}Bk ->[\\overset{}{\\beta^-}][330 \\ \\ce d] ^{249}_{98}Cf\n\nThe thus-produced 249Bk has a long half-life of 330 days and thus can capture another neutron. However, the product, 250Bk, again has a relatively short half-life of 3.212 hours and thus, does not yield any heavier berkelium isotopes. Instead decays to the californium isotope 250Cf:\n^{249}_{97}Bk ->[{(n,\\gamma)}] ^{250}_{97}Bk ->[\\beta^-][3.212 \\ \\ce h] ^{250}_{98}Cf\n\nAlthough 247Bk is the most stable isotope of berkelium, its production in nuclear reactors is very inefficient due to the long half-life of its potential progenitor curium-247, which does not allow it sufficient time to beta decay before capturing another neutron. Thus, 249Bk is the most accessible isotope of berkelium, which still, is available only in small quantities (only 0.66 grams have been produced in the US over the period 1967–1983) at a high price of the order 185 USD per microgram.Hammond C. R. \"The elements\" in \n\nThe isotope 248Bk was first obtained in 1956 by bombarding a mixture of curium isotopes with 25 MeV α-particles. Although its direct detection was hindered by strong signal interference with 245Bk, the existence of a new isotope was proven by the growth of the decay product 248Cf which had been previously characterized. The half-life of 248Bk was estimated as 23 ± 5 hours, though later 1965 work gave a half-life in excess of 300 years (which may be due to an isomeric state). Berkelium-247 was produced during the same year by irradiating 244Cm with alpha-particles:\n\\begin{array}{l}\n\\ce{^{244}_{96}Cm ->[\\ce{(\\alpha,n)}] ^{247}_{98}Cf ->[\\epsilon][3.11 \\ \\ce h] ^{247}_{97}Bk}\\\\\n\\ce{^{244}_{96}Cm ->[\\ce{(\\alpha,p)}] ^{247}_{97}Bk}\n\\end{array}\n\nBerkelium-242 was synthesized in 1979 by bombarding 235U with 11B, 238U with 10B, 232Th with 14N or 232Th with 15N. It converts by electron capture to 242Cm with a half-life of 7.0 ± 1.3 minutes. A search for an initially suspected isotope 241Bk was then unsuccessful; 241Bk has since been synthesized.\n\\begin{array}{lcl}\n\\ce",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Berkelium" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=3758" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Berkelium is a transuranic radioactive chemical element with symbol Bk and atomic number 97. It is a member of the actinide and transuranium element series. It is named after the city of Berkeley, California, the location of the Lawrence Berkeley National Laboratory (then the University of California Radiation Laboratory) where it was discovered in December 1949. Berkelium was the fifth transuranium element discovered after neptunium, plutonium, curium and americium.\n\nThe major isotope of berkelium, 249Bk, is synthesized in minute quantities in dedicated high-flux nuclear reactors, mainly at the Oak Ridge National Laboratory in Tennessee, USA, and at the Research Institute of Atomic Reactors in Dimitrovgrad, Russia. The production of the second-most important isotope 247Bk involves the irradiation of the rare isotope 244Cm with high-energy alpha particles.\n\nJust over one gram of berkelium has been produced in the United States since 1967. There is no practical application of berkelium outside scientific research which is mostly directed at the synthesis of heavier transuranic elements and transactinides. A 22 milligram batch of berkelium-249 was prepared during a 250-day irradiation period and then purified for a further 90 days at Oak Ridge in 2009. This sample was used to synthesize the new element tennessine for the first time in 2009 at the Joint Institute for Nuclear Research, Russia, after it was bombarded with calcium-48 ions for 150 days. This was the culmination of the Russia–US collaboration on the synthesis of the heaviest elements on the periodic table.\n\nBerkelium is a soft, silvery-white, radioactive metal. The berkelium-249 isotope emits low-energy electrons and thus is relatively safe to handle. It decays with a half-life of 330 days to californium-249, which is a strong emitter of ionizing alpha particles. This gradual transformation is an important consideration when studying the properties of elemental berkelium and its chemical compounds, since the formation of californium brings not only chemical contamination, but also free-radical effects and self-heating from the emitted alpha particles.\n\nCharacteristics\n\nPhysical\n\nBerkelium is a soft, silvery-white, radioactive actinide metal. In the periodic table, it is located to the right of the actinide curium, to the left of the actinide californium and below the lanthanide terbium with which it shares many similarities in physical and chemical properties. Its density of 14.78 g/cm3 lies between those of curium (13.52 g/cm3) and californium (15.1 g/cm3), as does its melting point of 986 °C, below that of curium (1340 °C) but higher than that of californium (900 °C). Berkelium is relatively soft and has one of the lowest bulk moduli among the actinides, at about 20 GPa (2 Pa).\n\nBerkelium(III) ions shows two sharp fluorescence peaks at 652 nanometers (red light) and 742 nanometers (deep red – near infrared) due to internal transitions at the f-electron shell. The relative intensity of these peaks depends on the excitation power and temperature of the sample. This emission can be observed, for example, after dispersing berkelium ions in a silicate glass, by melting the glass in presence of berkelium oxide or halide.Rita Cornelis, Joe Caruso, Helen Crews, Klaus Heumann [https://books.google.com/books?id1PmjurlE6KkC&pg\nPA553 Handbook of elemental speciation II: species in the environment, food, medicine & occupational health. Volume 2 of Handbook of Elemental Speciation], John Wiley and Sons, 2005,  p. 553\n\nBetween 70 K and room temperature, berkelium behaves as a Curie–Weiss paramagnetic material with an effective magnetic moment of 9.69 Bohr magnetons (µB) and a Curie temperature of 101 K. This magnetic moment is almost equal to the theoretical value of 9.72 µB calculated within the simple atomic L-S coupling model. Upon cooling to about 34 K, berkelium undergoes a transition to an antiferromagnetic state. Enthalpy of dissolution in hydrochloric acid at standard conditions is −600 kJ/mol−1, from which the standard enthalpy change of formation (ΔfH°) of aqueous Bk3+ ions is obtained as −601 kJ/mol−1. The standard potential Bk3+/Bk0 is −2.01 V. The ionization potential of a neutral berkelium atom is 6.23 eV.\n\nAllotropes\n\nAt ambient conditions, berkelium assumes its most stable α form which has a hexagonal symmetry, space group P63/mmc, lattice parameters of 341 pm and 1107 pm. The crystal has a double-hexagonal close packing structure with the layer sequence ABAC and so is isotypic (having a similar structure) with α-lanthanum and α-forms of actinides beyond curium. This crystal structure changes with pressure and temperature. When compressed at room temperature to 7 GPa, α-berkelium transforms to the beta modification, which has a face-centered cubic (fcc) symmetry and space group Fmm. This transition occurs without change in volume, but the enthalpy increases by 3.66 kJ/mol. Upon further compression to 25 GPa, berkelium transforms to an orthorhombic γ-berkelium structure similar to that of α-uranium. This transition is accompanied by a 12% volume decrease and delocalization of the electrons at the 5f electron shell. No further phase transitions are observed up to 57 GPa.Young, David A. [https://books.google.com/books?id\nF2HVYh6wLBcC&pg=PA228 Phase diagrams of the elements], University of California Press, 1991,  p. 228\n\nUpon heating, α-berkelium transforms into another phase with an fcc lattice (but slightly different from β-berkelium), space group Fmm and the lattice constant of 500 pm; this fcc structure is equivalent to the closest packing with the sequence ABC. This phase is metastable and will gradually revert to the original α-berkelium phase at room temperature. The temperature of the phase transition is believed to be quite close to the melting point.\n\nChemical\n\nLike all actinides, berkelium dissolves in various aqueous inorganic acids, liberating gaseous hydrogen and converting into the berkelium(III) state. This trivalent oxidation state (+3) is the most stable, especially in aqueous solutions, but tetravalent (+4) and possibly divalent (+2) berkelium compounds are also known. The existence of divalent berkelium salts is uncertain and has only been reported in mixed lanthanum chloride-strontium chloride melts. A similar behavior is observed for the lanthanide analogue of berkelium, terbium. Aqueous solutions of Bk3+ ions are green in most acids. The color of Bk4+ ions is yellow in hydrochloric acid and orange-yellow in sulfuric acid. Berkelium does not react rapidly with oxygen at room temperature, possibly due to the formation of a protective oxide layer surface. However, it reacts with molten metals, hydrogen, halogens, chalcogens and pnictogens to form various binary compounds.\n\nIsotopes\n\nAbout twenty isotopes and six nuclear isomers (excited states of an isotope) of berkelium have been characterized with the mass numbers ranging from 235 to 254. All of them are radioactive. The longest half-lives are observed for 247Bk (1,380 years), 248Bk (over 300 years) and 249Bk (330 days); the half-lives of the other isotopes range from microseconds to several days. The isotope which is the easiest to synthesize is berkelium-249. This emits mostly soft β-particles which are inconvenient for detection. Its alpha radiation is rather weak – 1.45% with respect to the β-radiation – but is sometimes used to detect this isotope. The second important berkelium isotope, berkelium-247, is an alpha-emitter, as are most actinide isotopes.\n\nOccurrence\n\nAll berkelium isotopes have a half-life far too short to be primordial. Therefore, any primordial berkelium, that is, berkelium present on the Earth during its formation, has decayed by now.\n\nOn Earth, berkelium is mostly concentrated in certain areas, which were used for the atmospheric nuclear weapons tests between 1945 and 1980, as well as at the sites of nuclear incidents, such as the Chernobyl disaster, Three Mile Island accident and 1968 Thule Air Base B-52 crash. Analysis of the debris at the testing site of the first U.S. hydrogen bomb, Ivy Mike, (1 November 1952, Enewetak Atoll), revealed high concentrations of various actinides, including berkelium. For reasons of military secrecy, this result was published only in 1956.\n\nNuclear reactors produce mostly, among the berkelium isotopes, berkelium-249. During the storage and before the fuel disposal, most of it beta decays to californium-249. The latter has a half-life of 351 years, which is relatively long when compared to the other isotopes produced in the reactor, and is therefore undesirable in the disposal products.\n\nThe transuranic elements from americium to fermium, including berkelium, occurred naturally in the natural nuclear fission reactor at Oklo, but no longer do so.\n\nHistory\n\nAlthough very small amounts of berkelium were possibly produced in previous nuclear experiments, it was first intentionally synthesized, isolated and identified in December 1949 by Glenn T. Seaborg, Albert Ghiorso, Stanley G. Thompson, and Kenneth Street, Jr.. They used the 60-inch cyclotron at the University of California, Berkeley. Similar to the nearly simultaneous discovery of americium (element 95) and curium (element 96) in 1944, the new elements berkelium and californium (element 98) were both produced in 1949–1950. [http://www.osti.gov/cgi-bin/rd_accomplishments/display_biblio.cgi?idACC0045&numPages\n38&fp=N Abstract]\n\nThe name choice for element 97 followed the previous tradition of the Californian group to draw an analogy between the newly discovered actinide and the lanthanide element positioned above it in the periodic table. Previously, americium was named after a continent as its analogue europium, and curium honored scientists Marie and Pierre Curie as the lanthanide above it, gadolinium, was named after the explorer of the rare earth elements Johan Gadolin. Thus the discovery report by the Berkeley group reads: \"It is suggested that element 97 be given the name berkelium (symbol Bk) after the city of Berkeley in a manner similar to that used in naming its chemical homologue terbium (atomic number 65) whose name was derived from the town of Ytterby, Sweden, where the rare earth minerals were first found.\" This tradition ended on berkelium, though, as the naming of the next discovered actinide, californium, was not related to its lanthanide analogue dysprosium, but after the discovery place.\n\nThe most difficult steps in the synthesis of berkelium were its separation from the final products and the production of sufficient quantities of americium for the target material. First, americium (241Am) nitrate solution was coated on a platinum foil, the solution was evaporated and the residue converted by annealing to americium dioxide (AmO2). This target was irradiated with 35 MeV alpha particles for 6 hours in the 60-inch cyclotron at the Lawrence Radiation Laboratory, University of California, Berkeley. The (α,2n) reaction induced by the irradiation yielded the 243Bk isotope and two free neutrons:\n\n\\mathrm{^{241}_{\\ 95}Am\\ +\\ ^{4}_{2}He\\ \\longrightarrow \\ ^{243}_{\\ 97}Bk\\ +\\ 2\\ ^{1}_{0}n}\n\nAfter the irradiation, the coating was dissolved with nitric acid and then precipitated as the hydroxide using concentrated aqueous ammonia solution. The product was centrifugated and re-dissolved in nitric acid. To separate berkelium from the unreacted americium, this solution was added to a mixture of ammonium and ammonium sulfate and heated to convert all the dissolved americium into the oxidation state +6. Unoxidized residual americium was precipitated by the addition of hydrofluoric acid as americium(III) fluoride (). This step yielded a mixture of the accompanying product curium and the expected element 97 in form of trifluorides. The mixture was converted to the corresponding hydroxides by treating it with potassium hydroxide, and after centrifugation, was dissolved in perchloric acid.\n\nFurther separation was carried out in the presence of a citric acid/ammonium buffer solution in a weakly acidic medium (pH≈3.5), using ion exchange at elevated temperature. The chromatographic separation behavior was then unknown for the element 97, but was anticipated by analogy with terbium (see elution curves). First results were disappointing as no alpha-particle emission signature could be detected from the elution product. Only the further search for characteristic X-rays and conversion electron signals resulted in the identification of a berkelium isotope. Its mass number was uncertain between 243 and 244 in the initial report, but was later established as 243.\n\nSynthesis and extraction\n\nPreparation of isotopes\n\nBerkelium is produced by bombarding lighter actinides uranium (238U) or plutonium (239Pu) with neutrons in a nuclear reactor. In a more common case of uranium fuel, plutonium is produced first by neutron capture (the so-called (n,γ) reaction or neutron fusion) followed by beta-decay:\n\n^{238}_{92}U ->[\\ce{(n,\\gamma)}] ^{239}_{92}U ->[\\beta^-][23.5 \\ \\ce{min}] ^{239}_{93}Np ->[\\beta^-][2.3565 \\ \\ce d] ^{239}_{94}Pu (the times are half-lives)\n\nPlutonium-239 is further irradiated by a source that has a high neutron flux, several times higher than a conventional nuclear reactor, such as the 85-megawatt High Flux Isotope Reactor (HFIR) at the Oak Ridge National Laboratory in Tennessee, USA. The higher flux promotes fusion reactions involving not one but several neutrons, converting 239Pu to 244Cm and then to 249Cm:\n\\begin{align}\n\\ce{^{239}_{94}Pu ->[\\ce{4(n,\\gamma)}] ^{243}_{94}Pu ->[\\beta^-][4.956 \\ \\ce h] ^{243}_{95}Am ->[\\ce{(n,\\gamma)}] ^{244}_{95}Am ->[\\beta^-][10.1 \\ \\ce h]} &\\ce{^{244}_{96}Cm}\\\\\n&\\ce{^{244}_{96}Cm ->[\\ce{5(n,\\gamma)}] ^{249}_{96}Cm}\n\\end{align}\n\nCurium-249 has a short half-life of 64 minutes, and thus its further conversion to 250Cm has a low probability. Instead, it transforms by beta-decay into 249Bk:\n^{249}_{96}Cm ->[\\overset{}{\\beta^-}][64.15 \\ \\ce{min}] ^{249}_{97}Bk ->[\\overset{}{\\beta^-}][330 \\ \\ce d] ^{249}_{98}Cf\n\nThe thus-produced 249Bk has a long half-life of 330 days and thus can capture another neutron. However, the product, 250Bk, again has a relatively short half-life of 3.212 hours and thus, does not yield any heavier berkelium isotopes. Instead decays to the californium isotope 250Cf:\n^{249}_{97}Bk ->[{(n,\\gamma)}] ^{250}_{97}Bk ->[\\beta^-][3.212 \\ \\ce h] ^{250}_{98}Cf\n\nAlthough 247Bk is the most stable isotope of berkelium, its production in nuclear reactors is very inefficient due to the long half-life of its potential progenitor curium-247, which does not allow it sufficient time to beta decay before capturing another neutron. Thus, 249Bk is the most accessible isotope of berkelium, which still, is available only in small quantities (only 0.66 grams have been produced in the US over the period 1967–1983) at a high price of the order 185 USD per microgram.Hammond C. R. \"The elements\" in \n\nThe isotope 248Bk was first obtained in 1956 by bombarding a mixture of curium isotopes with 25 MeV α-particles. Although its direct detection was hindered by strong signal interference with 245Bk, the existence of a new isotope was proven by the growth of the decay product 248Cf which had been previously characterized. The half-life of 248Bk was estimated as 23 ± 5 hours, though later 1965 work gave a half-life in excess of 300 years (which may be due to an isomeric state). Berkelium-247 was produced during the same year by irradiating 244Cm with alpha-particles:\n\\begin{array}{l}\n\\ce{^{244}_{96}Cm ->[\\ce{(\\alpha,n)}] ^{247}_{98}Cf ->[\\epsilon][3.11 \\ \\ce h] ^{247}_{97}Bk}\\\\\n\\ce{^{244}_{96}Cm ->[\\ce{(\\alpha,p)}] ^{247}_{97}Bk}\n\\end{array}\n\nBerkelium-242 was synthesized in 1979 by bombarding 235U with 11B, 238U with 10B, 232Th with 14N or 232Th with 15N. It converts by electron capture to 242Cm with a half-life of 7.0 ± 1.3 minutes. A search for an initially suspected isotope 241Bk was then unsuccessful; 241Bk has since been synthesized.\n\\begin{array}{lcl}\n\\ce. Berkelium. http://en.wikipedia.org/?curid=3758."
  }
}
