{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=14110",
  "eid" : "11fb7a70-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778539415,
  "textBody" : "In mathematics, the complex-valued function called a holomorphic function has one or more complex variables that is complex differentiable in a neighborhood of every point in its domain. The existence of a complex derivative in a neighborhood is a very strong condition, for it implies that any holomorphic function is actually infinitely differentiable and equal to its own Taylor series (analytic). Holomorphic functions are the central objects of study in complex analysis.\n\nThough the term analytic function is often used interchangeably with \"holomorphic function\", the word \"analytic\" is defined in a broader sense to denote any function (real, complex, or of more general type) that can be written as a convergent power series in a neighborhood of each point in its domain. The fact that all holomorphic functions are complex analytic functions, and vice versa, is a major theorem in complex analysis.[https://www.encyclopediaofmath.org/index.php/Analytic_function#Analytic_functions_of_one_complex_variable Analytic functions of one complex variable], Encyclopedia of Mathematics. (European Mathematical Society ft. Springer, 2015)\n\nHolomorphic functions are also sometimes referred to as regular functions.[http://eom.springer.de/a/a012240.htm Springer Online Reference Books], [http://mathworld.wolfram.com/RegularFunction.html Wolfram MathWorld] A holomorphic function whose domain is the whole complex plane is called an entire function. The phrase \"holomorphic at a point z0\" means not just differentiable at z0, but differentiable everywhere within some neighborhood of z0 in the complex plane.\n\nDefinition \n\nGiven a complex-valued function f of a single complex variable, the derivative of f at a point z0 in its domain is defined by the limitAhlfors, L., Complex Analysis, 3 ed. (McGraw-Hill, 1979).\n\nf'(z_0) = \\lim_{z \\to z_0} {f(z) - f(z_0) \\over z - z_0 }. \n\nThis is the same as the definition of the derivative for real functions, except that all of the quantities are complex. In particular, the limit is taken as the complex number z approaches z0, and must have the same value for any sequence of complex values for z that approach z0 on the complex plane. If the limit exists, we say that f is complex-differentiable at the point z0. This concept of complex differentiability shares several properties with real differentiability: it is linear and obeys the product rule, quotient rule, and chain rule.Henrici, P., Applied and Computational Complex Analysis (Wiley).  [Three volumes: 1974, 1977, 1986.]\n\nIf f is complex differentiable at every point z0 in an open set U, we say that f is holomorphic on U. We say that f is holomorphic at the point z0 if it is holomorphic on some neighborhood of z0.Peter Ebenfelt, Norbert Hungerbühler, Joseph J. Kohn, Ngaiming Mok, Emil J. Straube\n(2011) Complex Analysis Springer Science & Business Media We say that f is holomorphic on some non-open set A if it is holomorphic in an open set containing A.  As a pathological non-example, the function given by f(z) |z|2 is complex differentiable at exactly one point (z0 \n 0), and for this reason, it is not holomorphic at 0 because there is no open set around 0 on which f is complex differentiable. \n\nThe relationship between real differentiability and complex differentiability is the following. If a complex function  is holomorphic, then u and v have first partial derivatives with respect to x and y, and satisfy the Cauchy–Riemann equations:Markushevich, A.I.,Theory of Functions of a Complex Variable (Prentice-Hall, 1965). [Three volumes.]\n\n\\frac{\\partial u}{\\partial x} \\frac{\\partial v}{\\partial y} \\qquad \\mbox{and} \\qquad \\frac{\\partial u}{\\partial y} \n -\\frac{\\partial v}{\\partial x}\\,\n\nor, equivalently, the Wirtinger derivative of f with respect to the complex conjugate of z is zero:\n\n\\frac{\\partial f}{\\partial\\overline{z}} = 0,\n\nwhich is to say that, roughly, f is functionally independent from the complex conjugate of z.\n\nIf continuity is not given, the converse is not necessarily true. A simple converse is that if u and v have continuous first partial derivatives and satisfy the Cauchy–Riemann equations, then f is holomorphic. A more satisfying converse, which is much harder to prove, is the Looman–Menchoff theorem: if f is continuous, u and v have first partial derivatives (but not necessarily continuous), and they satisfy the Cauchy–Riemann equations, then f is holomorphic..\n\nTerminology \n\nThe word \"holomorphic\" was introduced by two of Cauchy's students, Briot (1817–1882) and Bouquet (1819–1895), and derives from the Greek ὅλος (holos) meaning \"entire\", and μορφή (morphē) meaning \"form\" or \"appearance\".\n\nToday, the term \"holomorphic function\" is sometimes preferred to \"analytic function\", as the latter is a more general concept. This is also because an important result in complex analysis is that every holomorphic function is complex analytic, a fact that does not follow obviously from the definitions. The term \"analytic\" is however also in wide use.\n\nProperties \n\nBecause complex differentiation is linear and obeys the product, quotient, and chain rules; the sums, products and compositions of holomorphic functions are holomorphic, and the quotient of two holomorphic functions is holomorphic wherever the denominator is not zero..\n\nIf one identifies C with R2, then the holomorphic functions coincide with those functions of two real variables with continuous first derivatives which solve the Cauchy–Riemann equations, a set of two partial differential equations.\n\nEvery holomorphic function can be separated into its real and imaginary parts, and each of these is a solution of Laplace's equation on R2. In other words, if we express a holomorphic function f(z) as  both u and v are harmonic functions, where v is the harmonic conjugate of u..\n\nCauchy's integral theorem implies that the contour integral of every holomorphic function along a loop vanishes:\n\n\\oint_\\gamma f(z)\\,dz = 0. \n\nHere γ is a rectifiable path in a simply connected open subset U of the complex plane C whose start point is equal to its end point, and  is a holomorphic function.\n\nCauchy's integral formula states that every function holomorphic inside a disk is completely determined by its values on the disk's boundary. Furthermore: Suppose U is an open subset of C,  is a holomorphic function and the closed disk  is completely contained in U. Let γ be the circle forming the boundary of D. Then for every a in the interior of D:\n\nf(a) = \\frac{1}{2\\pi i} \\oint_\\gamma \\frac{f(z)}{z-a}\\, dz \n\nwhere the contour integral is taken counter-clockwise.\n\nThe derivative f′(a) can be written as a contour integral using Cauchy's differentiation formula:\n\nf'(a) = {1 \\over 2\\pi i} \\oint_\\gamma {f(z) \\over (z-a)^{2}}\\, dz,\n\nfor any simple loop positively winding once around a, and\n\nf'(a) = \\lim\\limits_{\\gamma\\to a}\\frac i{2\\mathcal{A}(\\gamma)}\\oint_{\\gamma}f(z) d\\bar z,\n\nfor infinitesimal positive loops γ around a.\n\nIn regions where the first derivative is not zero, holomorphic functions are conformal in the sense that they preserve angles and the shape (but not size) of small figures.\n\nEvery holomorphic function is analytic. That is, a holomorphic function f has derivatives of every order at each point a in its domain, and it coincides with its own Taylor series at a in a neighborhood of a. In fact, f coincides with its Taylor series at a in any disk centered at that point and lying within the domain of the function.\n\nFrom an algebraic point of view, the set of holomorphic functions on an open set is a commutative ring and a complex vector space. In fact, it is a locally convex topological vector space, with the seminorms being the suprema on compact subsets.\n\nFrom a geometric perspective, a function f is holomorphic at z0 if and only if its exterior derivative df in a neighborhood U of z0 is equal to f′(z) dz for some continuous function f′. It follows from\n\n\\textstyle 0 d^2 f \n d(f^\\prime dz) = df^\\prime \\wedge dz\n\nthat df′ is also proportional to dz, implying that the derivative f′ is itself holomorphic and thus that f is infinitely differentiable. Similarly, the fact that  implies that any function f that is holomorphic on the simply connected region U is also integrable on U. (For a path γ from z0 to z lying entirely in U, define\n\n\\textstyle F_\\gamma(z) = F_0 + \\int_\\gamma f dz;\n\nin light of the Jordan curve theorem and the generalized Stokes' theorem, Fγ(z) is independent of the particular choice of path γ, and thus F(z) is a well-defined function on U having  and .)\n\nExamples \n\nAll polynomial functions in z with complex coefficients are holomorphic on C, and so are sine, cosine and the exponential function. (The trigonometric functions are in fact closely related to and can be defined via the exponential function using Euler's formula). The principal branch of the complex logarithm function is holomorphic on the set  The square root function can be defined as\n\n\\sqrt{z} = e^{\\frac{1}{2}\\log z}\n\nand is therefore holomorphic wherever the logarithm log(z) is. The function 1/z is holomorphic on \n\nAs a consequence of the Cauchy–Riemann equations, a real-valued holomorphic function must be constant. Therefore, the absolute value of z, the argument of z, the real part of z and the imaginary part of z are not holomorphic. Another typical example of a continuous function which is not holomorphic is the complex conjugate  formed by complex conjugation.\n\nSeveral variables \n\nThe definition of a holomorphic function generalizes to several complex variables in a straightforward way.  Let D denote an open subset of Cn, and let .  The function f is analytic at a point p in D if there exists an open neighborhood of p in which f is equal to a convergent power series in n complex variables.Gunning and Rossi, Analytic Functions of Several Complex Variables, p. 2.  Define f to be holomorphic if it is analytic at each point in its domain.  Osgood's lemma shows (using the multivariate Cauchy integral formula) that, for a continuous function f, this is equivalent to f being holomorphic in each variable separately (meaning that if any  coordinates are fixed, then the restriction of f is a holomorphic function of the remaining coordinate).  The much deeper Hartogs' theorem proves that the continuity hypothesis is unnecessary: f is holomorphic if and only if it is holomorphic in each variable separately.\n\nMore generally, a function of several complex variables that is square integrable over every compact subset of its domain is analytic if and only if it satisfies the Cauchy–Riemann equations in the sense of distributions.\n\nFunctions of several complex variables are in some basic ways more complicated than functions of a single complex variable.  For example, the region of convergence of a power series is not necessarily an open ball; these regions are Reinhardt domains, the simplest example of which is a polydisk.  However, they also come with some fundamental restrictions.  Unlike functions of a single complex variable, the possible domains on which there are holomorphic functions that cannot be extended to larger domains are highly limited.  Such a set is called a domain of holomorphy.\n\nExtension to functional analysis \n\nThe concept of a holomorphic function can be extended to the infinite-dimensional spaces of functional analysis. For instance, the Fréchet or Gâteaux derivative can be used to define a notion of a holomorphic function on a Banach space over the field of complex numbers.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Holomorphic function" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=14110" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In mathematics, the complex-valued function called a holomorphic function has one or more complex variables that is complex differentiable in a neighborhood of every point in its domain. The existence of a complex derivative in a neighborhood is a very strong condition, for it implies that any holomorphic function is actually infinitely differentiable and equal to its own Taylor series (analytic). Holomorphic functions are the central objects of study in complex analysis.\n\nThough the term analytic function is often used interchangeably with \"holomorphic function\", the word \"analytic\" is defined in a broader sense to denote any function (real, complex, or of more general type) that can be written as a convergent power series in a neighborhood of each point in its domain. The fact that all holomorphic functions are complex analytic functions, and vice versa, is a major theorem in complex analysis.[https://www.encyclopediaofmath.org/index.php/Analytic_function#Analytic_functions_of_one_complex_variable Analytic functions of one complex variable], Encyclopedia of Mathematics. (European Mathematical Society ft. Springer, 2015)\n\nHolomorphic functions are also sometimes referred to as regular functions.[http://eom.springer.de/a/a012240.htm Springer Online Reference Books], [http://mathworld.wolfram.com/RegularFunction.html Wolfram MathWorld] A holomorphic function whose domain is the whole complex plane is called an entire function. The phrase \"holomorphic at a point z0\" means not just differentiable at z0, but differentiable everywhere within some neighborhood of z0 in the complex plane.\n\nDefinition \n\nGiven a complex-valued function f of a single complex variable, the derivative of f at a point z0 in its domain is defined by the limitAhlfors, L., Complex Analysis, 3 ed. (McGraw-Hill, 1979).\n\nf'(z_0) = \\lim_{z \\to z_0} {f(z) - f(z_0) \\over z - z_0 }. \n\nThis is the same as the definition of the derivative for real functions, except that all of the quantities are complex. In particular, the limit is taken as the complex number z approaches z0, and must have the same value for any sequence of complex values for z that approach z0 on the complex plane. If the limit exists, we say that f is complex-differentiable at the point z0. This concept of complex differentiability shares several properties with real differentiability: it is linear and obeys the product rule, quotient rule, and chain rule.Henrici, P., Applied and Computational Complex Analysis (Wiley).  [Three volumes: 1974, 1977, 1986.]\n\nIf f is complex differentiable at every point z0 in an open set U, we say that f is holomorphic on U. We say that f is holomorphic at the point z0 if it is holomorphic on some neighborhood of z0.Peter Ebenfelt, Norbert Hungerbühler, Joseph J. Kohn, Ngaiming Mok, Emil J. Straube\n(2011) Complex Analysis Springer Science & Business Media We say that f is holomorphic on some non-open set A if it is holomorphic in an open set containing A.  As a pathological non-example, the function given by f(z) |z|2 is complex differentiable at exactly one point (z0 \n 0), and for this reason, it is not holomorphic at 0 because there is no open set around 0 on which f is complex differentiable. \n\nThe relationship between real differentiability and complex differentiability is the following. If a complex function  is holomorphic, then u and v have first partial derivatives with respect to x and y, and satisfy the Cauchy–Riemann equations:Markushevich, A.I.,Theory of Functions of a Complex Variable (Prentice-Hall, 1965). [Three volumes.]\n\n\\frac{\\partial u}{\\partial x} \\frac{\\partial v}{\\partial y} \\qquad \\mbox{and} \\qquad \\frac{\\partial u}{\\partial y} \n -\\frac{\\partial v}{\\partial x}\\,\n\nor, equivalently, the Wirtinger derivative of f with respect to the complex conjugate of z is zero:\n\n\\frac{\\partial f}{\\partial\\overline{z}} = 0,\n\nwhich is to say that, roughly, f is functionally independent from the complex conjugate of z.\n\nIf continuity is not given, the converse is not necessarily true. A simple converse is that if u and v have continuous first partial derivatives and satisfy the Cauchy–Riemann equations, then f is holomorphic. A more satisfying converse, which is much harder to prove, is the Looman–Menchoff theorem: if f is continuous, u and v have first partial derivatives (but not necessarily continuous), and they satisfy the Cauchy–Riemann equations, then f is holomorphic..\n\nTerminology \n\nThe word \"holomorphic\" was introduced by two of Cauchy's students, Briot (1817–1882) and Bouquet (1819–1895), and derives from the Greek ὅλος (holos) meaning \"entire\", and μορφή (morphē) meaning \"form\" or \"appearance\".\n\nToday, the term \"holomorphic function\" is sometimes preferred to \"analytic function\", as the latter is a more general concept. This is also because an important result in complex analysis is that every holomorphic function is complex analytic, a fact that does not follow obviously from the definitions. The term \"analytic\" is however also in wide use.\n\nProperties \n\nBecause complex differentiation is linear and obeys the product, quotient, and chain rules; the sums, products and compositions of holomorphic functions are holomorphic, and the quotient of two holomorphic functions is holomorphic wherever the denominator is not zero..\n\nIf one identifies C with R2, then the holomorphic functions coincide with those functions of two real variables with continuous first derivatives which solve the Cauchy–Riemann equations, a set of two partial differential equations.\n\nEvery holomorphic function can be separated into its real and imaginary parts, and each of these is a solution of Laplace's equation on R2. In other words, if we express a holomorphic function f(z) as  both u and v are harmonic functions, where v is the harmonic conjugate of u..\n\nCauchy's integral theorem implies that the contour integral of every holomorphic function along a loop vanishes:\n\n\\oint_\\gamma f(z)\\,dz = 0. \n\nHere γ is a rectifiable path in a simply connected open subset U of the complex plane C whose start point is equal to its end point, and  is a holomorphic function.\n\nCauchy's integral formula states that every function holomorphic inside a disk is completely determined by its values on the disk's boundary. Furthermore: Suppose U is an open subset of C,  is a holomorphic function and the closed disk  is completely contained in U. Let γ be the circle forming the boundary of D. Then for every a in the interior of D:\n\nf(a) = \\frac{1}{2\\pi i} \\oint_\\gamma \\frac{f(z)}{z-a}\\, dz \n\nwhere the contour integral is taken counter-clockwise.\n\nThe derivative f′(a) can be written as a contour integral using Cauchy's differentiation formula:\n\nf'(a) = {1 \\over 2\\pi i} \\oint_\\gamma {f(z) \\over (z-a)^{2}}\\, dz,\n\nfor any simple loop positively winding once around a, and\n\nf'(a) = \\lim\\limits_{\\gamma\\to a}\\frac i{2\\mathcal{A}(\\gamma)}\\oint_{\\gamma}f(z) d\\bar z,\n\nfor infinitesimal positive loops γ around a.\n\nIn regions where the first derivative is not zero, holomorphic functions are conformal in the sense that they preserve angles and the shape (but not size) of small figures.\n\nEvery holomorphic function is analytic. That is, a holomorphic function f has derivatives of every order at each point a in its domain, and it coincides with its own Taylor series at a in a neighborhood of a. In fact, f coincides with its Taylor series at a in any disk centered at that point and lying within the domain of the function.\n\nFrom an algebraic point of view, the set of holomorphic functions on an open set is a commutative ring and a complex vector space. In fact, it is a locally convex topological vector space, with the seminorms being the suprema on compact subsets.\n\nFrom a geometric perspective, a function f is holomorphic at z0 if and only if its exterior derivative df in a neighborhood U of z0 is equal to f′(z) dz for some continuous function f′. It follows from\n\n\\textstyle 0 d^2 f \n d(f^\\prime dz) = df^\\prime \\wedge dz\n\nthat df′ is also proportional to dz, implying that the derivative f′ is itself holomorphic and thus that f is infinitely differentiable. Similarly, the fact that  implies that any function f that is holomorphic on the simply connected region U is also integrable on U. (For a path γ from z0 to z lying entirely in U, define\n\n\\textstyle F_\\gamma(z) = F_0 + \\int_\\gamma f dz;\n\nin light of the Jordan curve theorem and the generalized Stokes' theorem, Fγ(z) is independent of the particular choice of path γ, and thus F(z) is a well-defined function on U having  and .)\n\nExamples \n\nAll polynomial functions in z with complex coefficients are holomorphic on C, and so are sine, cosine and the exponential function. (The trigonometric functions are in fact closely related to and can be defined via the exponential function using Euler's formula). The principal branch of the complex logarithm function is holomorphic on the set  The square root function can be defined as\n\n\\sqrt{z} = e^{\\frac{1}{2}\\log z}\n\nand is therefore holomorphic wherever the logarithm log(z) is. The function 1/z is holomorphic on \n\nAs a consequence of the Cauchy–Riemann equations, a real-valued holomorphic function must be constant. Therefore, the absolute value of z, the argument of z, the real part of z and the imaginary part of z are not holomorphic. Another typical example of a continuous function which is not holomorphic is the complex conjugate  formed by complex conjugation.\n\nSeveral variables \n\nThe definition of a holomorphic function generalizes to several complex variables in a straightforward way.  Let D denote an open subset of Cn, and let .  The function f is analytic at a point p in D if there exists an open neighborhood of p in which f is equal to a convergent power series in n complex variables.Gunning and Rossi, Analytic Functions of Several Complex Variables, p. 2.  Define f to be holomorphic if it is analytic at each point in its domain.  Osgood's lemma shows (using the multivariate Cauchy integral formula) that, for a continuous function f, this is equivalent to f being holomorphic in each variable separately (meaning that if any  coordinates are fixed, then the restriction of f is a holomorphic function of the remaining coordinate).  The much deeper Hartogs' theorem proves that the continuity hypothesis is unnecessary: f is holomorphic if and only if it is holomorphic in each variable separately.\n\nMore generally, a function of several complex variables that is square integrable over every compact subset of its domain is analytic if and only if it satisfies the Cauchy–Riemann equations in the sense of distributions.\n\nFunctions of several complex variables are in some basic ways more complicated than functions of a single complex variable.  For example, the region of convergence of a power series is not necessarily an open ball; these regions are Reinhardt domains, the simplest example of which is a polydisk.  However, they also come with some fundamental restrictions.  Unlike functions of a single complex variable, the possible domains on which there are holomorphic functions that cannot be extended to larger domains are highly limited.  Such a set is called a domain of holomorphy.\n\nExtension to functional analysis \n\nThe concept of a holomorphic function can be extended to the infinite-dimensional spaces of functional analysis. For instance, the Fréchet or Gâteaux derivative can be used to define a notion of a holomorphic function on a Banach space over the field of complex numbers. Holomorphic function. http://en.wikipedia.org/?curid=14110."
  }
}
