{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=16960",
  "eid" : "29dbd810-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778579473,
  "textBody" : "Kathy Acker (April 18, 1944 – November 30, 1997) was an American experimental novelist, punk poet, playwright, essayist, postmodernist and sex-positive feminist writer. She was influenced by the Black Mountain School poets, the writer William S. Burroughs, the artist and theoretician David Antin, French critical theory, feminist artists Carolee Schneeman and Eleanor Antin, and by philosophy, mysticism, and pornography.\n\nBiography\n\nThe biological daughter of Donald and Claire (née Weill) Lehman, Kathy Acker was born Karen Alexander in New York City. There is some question as to her year of birth, 1947; the Library of Congress lists her birth year as 1948, but most obituaries state that she was born in 1944. The pregnancy was unplanned; Donald Lehman abandoned the family before Karen's birth. Her stepfather's name, Albert Alexander, appears on the birth certificate. Her relationship with her domineering mother even into adulthood was fraught with hostility and anxiety because Acker felt unloved and unwanted. Her mother soon remarried, to Albert Alexander, whose surname Kathy was given, although the writer later described her mother's union with Alexander as a passionless marriage to an ineffectual man. Acker was raised in her mother and stepfather's home on New York's prosperous Upper East Side. In 1978, Claire Alexander, Karen's mother, committed suicide.\n\nIn 1966, she married Robert Acker, and changed her last name from Alexander to Acker. Although her birth name was Karen, she was known as Kathy by her friends and family. Her first work appeared in print as part of the burgeoning New York City literary underground of the mid-1970s. Like other young women struggling to be writers and artists, she worked for a few months  as a stripper, and listening to the stories of women so different from those she had known before profoundly influenced her early work, and changed her understanding of gender and power relationships.\n\nDuring the 1970s she often moved back and forth between San Diego, San Francisco and New York. She married the composer and experimental musician Peter Gordon shortly before the end of their seven year relationship. Later, she had relationships with theorist, publisher, and critic Sylvère Lotringer and then with filmmaker and film theorist Peter Wollen.\n\nIn 1996, Acker left San Francisco and moved to London to live with writer and music critic Charles Shaar Murray.\n\nShe married twice. While most of her relationships were with men she was openly bisexual.\n\nIn 1979 she won the Pushcart Prize for her short story \"New York City in 1979\". During the early 1980s she lived in London, where she wrote several of her most critically acclaimed works. After returning to the United States in the late 1980s she worked as an adjunct professor at the San Francisco Art Institute for about six years and as a visiting professor at several universities, including the University of Idaho, the University of California, San Diego, University of California, Santa Barbara, the California Institute of Arts, and Roanoke College.\n\nHealth and death\n\nIn April 1996 Acker was diagnosed with breast cancer and she elected to have a double mastectomy. In January 1997 she wrote about her loss of faith in conventional medicine in a Guardian article, \"The Gift of Disease\".\n\nIn the article she explains that after unsuccessful surgery, which left her feeling physically mutilated and emotionally debilitated, she rejected the passivity of the patient in the medical mainstream and began to seek out the advice of nutritionists, acupuncturists, psychic healers, and Chinese herbalists. She found appealing the claim that instead of being an object of knowledge, as in Western medicine, the patient becomes a seer, a seeker of wisdom, that illness becomes the teacher and the patient the student. However, after pursuing several forms of alternative medicine in England and the United States, Acker died a year and a half later from complications of cancer in a Tijuana, Mexico alternative cancer clinic.\n\nShe died in Room 101, to which her friend Alan Moore quipped, \"There's nothing that woman can't turn into a literary reference;\" Room 101, in the climax of George Orwell's Nineteen Eighty-Four, is the basement torture chamber in which the Party attempts to subject a prisoner to his or her own worst fears.\n\nEducation\n\nAt  Brandeis University she engaged in undergraduate coursework in Classics at a time when Angela Davis was also at the university. She became interested in writing novels, and moved to California to attend University of California, San Diego where David Antin, Eleanor Antin, and Jerome Rothenberg were among her teachers. She received her bachelor's degree in 1968. After moving to New York, she attended two years of graduate school at the City University of New York in Classics, specializing in Greek. She did not earn a graduate degree. During her time in New York she was employed as a file clerk, secretary, stripper, and porn performer.\n\nLiterary overview\n\nAcker was associated with the New York punk movement of the late 1970s and early 1980s. The punk aesthetic influenced her literary style.\n\nHer controversial body of work borrows heavily from the experimental styles of William S. Burroughs and Marguerite Duras. Her writing strategies at times used forms of pastiche and deployed Burroughs's cut-up technique, involving cutting-up and scrambling passages and sentences into a somewhat random remix. Acker defined her writing as existing post-nouveau roman European tradition.\n\nIn her texts, she combines biographical elements, power, sex and violence. Indeed, critics often compare her writing to that of Alain Robbe-Grillet and Jean Genet. Critics have noticed links to Gertrude Stein and photographers Cindy Sherman and Sherrie Levine. Acker's novels also exhibit a fascination with and an indebtedness to tattoos. She dedicated Empire of the Senseless to her tattooist.\n\nAcker published her first book, Politics, in 1972. Although the collection of poems and essays did not garner much critical or public attention, it did establish her reputation within the New York punk scene. In 1973, she published her first novel (under the pseudonym Black Tarantula), The Childlike Life of the Black Tarantula: Some Lives of Murderesses. The following year she published her second novel, I Dreamt I Was a Nymphomaniac: Imagining. Both works are reprinted in Portrait of an Eye.\n\nIn 1979, she received popular attention when she won a Pushcart Prize for her short story \"New York City in 1979\". She did not receive critical attention, however, until she published Great Expectations in 1982. The opening of Great Expectations is a clear re-writing of Charles Dickens's classic of the same name. It features her usual subject matter, including a semi-autobiographical account of her mother's suicide and the appropriation of several other texts, including Pierre Guyotat's violent and sexually explicit \"Eden Eden Eden\". That same year, Acker published a chapbook, entitled Hello, I'm Erica Jong.\n\nAcker wrote the script for the 1983 film Variety. Acker wrote a text on the photographer Marcus Leatherdale that was published in 1983, in an art catalogue for the Molotov Gallery, Vienna.\n\nIn 1984, Acker's first British publication, the novel Blood and Guts in High School was published soon after its publication by Grove Press in New York.\n\nThat same year, she was signed by Grove Press, one of the legendary independent publishers committed to controversial and avant-garde writing; she was one of the last writers taken on by Barney Rosset before the end of his tenure there. Most of her work was published by them, including re-issues of important earlier work. She wrote for several magazines and anthologies, including the periodicals RE/Search, Angel Exhaust, monochrom and Rapid Eye. As she neared the end of her life, her work was more well received by the conventional press; for example, The Guardian published a number of her essays, interviews and articles, among them was an interview with the Spice Girls.\n\nAcker's In Memoriam to Identity draws attention to popular analyses of Rimbaud's life and The Sound and the Fury, constructing or revealing social and literary identity. Although known in the literary world for creating a whole new style of feminist prose and for her transgressive fiction, she was also a punk and feminist icon for her devoted portrayals of subcultures, strong-willed women, and violence.\n\nNotwithstanding the increased recognition she got for Great Expectations, Blood and Guts in High School is often considered Acker's breakthrough work. Published in 1984, it is one of her most extreme explorations of sexuality and violence. Borrowing from, among other texts, Nathaniel Hawthorne's The Scarlet Letter, Blood and Guts details the experiences of Janey Smith, a sex addicted and pelvic inflammatory disease-ridden urbanite who is in love with a father who sells her into slavery. Many critics criticized it for being demeaning toward women, and Germany banned it completely. Acker published the German court judgment against Blood and Guts in High School in [https://www.amazon.com/Hannibal-Lecter-Father-Native-Agents/dp/0936756683 Hannibal Lecter, My Father].\n\nAcker published Empire of the Senseless in 1988 and considered it a turning point in her writing. While she still borrows from other texts, including Mark Twain's The Adventures of Huckleberry Finn, the appropriation is less obvious. However, one of Acker's more controversial appropriations is from William Gibson's 1984 text, Neuromancer, in which Acker equates code with the female body and its militaristic implications. The novel comes from the voices of two terrorists, Abhor, who is half human and half robot, and her lover Thivai. The story takes place in the decaying remnants of a post-revolutionary Paris. Like her other works, Empire of the Senseless includes graphic violence and sexuality.\n\nIn 1988 she published Literal Madness: Three Novels, which included three previously published works: Florida deconstructs and reduces John Huston's 1948 film noir classic Key Largo into its base sexual politics, Kathy Goes to Haiti details a young woman's relationship and sexual exploits while on vacation, and My Death My Life by Pier Paolo Pasolini provides a fictional autobiography of the Italian filmmaker in which he solves his own murder.\n\nBetween 1990 and 1993, she published four more books: In Memoriam to Identity (1990); Hannibal Lecter, My Father (1991); Portrait of an Eye: Three Novels (1992), also composed of already published works; and My Mother: Demonology (1992). Her last novel, Pussy, King of the Pirates, published in 1996, showed signs of Acker's broadening interests as it incorporates more humor, lighter fantasy and a consideration of Eastern texts and philosophy that was largely absent in her earlier works.\n\nPosthumous reputation\n\nThree volumes of her non-fiction have been published and re-published since her death. In 2002, New York University staged Discipline and Anarchy, a retrospective exhibition of her works, while in 2008 London's Institute of Contemporary Arts screened an evening of films influenced by Acker.\n\nA collection of essays on Acker's work, Lust For Life: On the Writings of Kathy Acker, edited by Carla Harryman, Avital Ronell, and Amy Scholder, was published by Verso in 2006 and includes essays by Nayland Blake, Leslie Dick, Robert Glück, Carla Harryman, Laurence Rickels, Avital Ronell, Barrett Watten, and Peter Wollen.\n\nIn 2007, Amandla Publishing re-published Acker's articles that she wrote for the New Statesman from 1989–91.  Grove Press published two unpublished early novellas in the volume Rip-Off Red, Girl Detective and The Burning Bombing of America, and a collection of selected work, Essential Acker, edited by Amy Scholder and Dennis Cooper in 2002.\n\nIn 2015, Semiotext(e) published I'm Very Into You, a book of Acker's email correspondence with media theorist McKenzie Wark, edited by Matias Viegener, her executor and head of the Kathy Acker Literary Trust. Her personal library is housed in a reading room at the University of Cologne in Germany, and her papers are divided between NYU's Fales Library and the Rubenstein Rare Book and Manuscript Library at Duke University.\n\nIn 2017, the American writer and artist Chris Kraus published After Kathy Acker: A Literary Biography, the first book-length biography of Acker's life experiences and literary strategies.\n\nPublished works\n\n* Politics (1972)\n* Childlike Life of the Black Tarantula By the Black Tarantula (1973)\n* I Dreamt I Was a Nymphomaniac: Imagining (1974)\n* Adult Life of Toulouse Lautrec (1978)\n* Florida (1978)\n* Kathy Goes To Haiti (1978)\n* N.Y.C. in 1979 (1981)\n* Great Expectations (1983)\n* Algeria : A Series of Invocations Because Nothing Else Works (1984)\n* Blood and Guts in High School (1984)\n* Don Quixote: Which Was a Dream (1986)\n* Literal Madness: Three Novels (Reprinted 1987)\n* My Death My Life by Pier Paolo Pasolini\n* Wordplays 5 : An Anthology of New American Drama (1987)\n* Empire of the Senseless (1988)\n* In Memoriam to Identity (1990)\n* Hannibal Lecter, My Father (1991)\n* My Mother: Demonology (1994)\n* The Stabbing Hand – spoken word guest appearance on alternate mix of song by Oxbow included on reissues of album Let Me Be a Woman (1995)\n* Pussycat Fever (1995)\n* Dust. Essays (1995)\n* Pussy, King of the Pirates (1996)\n* Bodies of Work : Essays (1997)\n* Portrait of an Eye: Three Novels (Reprinted 1998)\n* Redoing Childhood (2000) spoken word CD, KRS 349.\n* Rip-Off Red, Girl Detective (pub. 2002 from manuscript of 1973)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Kathy Acker" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=16960" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Kathy Acker (April 18, 1944 – November 30, 1997) was an American experimental novelist, punk poet, playwright, essayist, postmodernist and sex-positive feminist writer. She was influenced by the Black Mountain School poets, the writer William S. Burroughs, the artist and theoretician David Antin, French critical theory, feminist artists Carolee Schneeman and Eleanor Antin, and by philosophy, mysticism, and pornography.\n\nBiography\n\nThe biological daughter of Donald and Claire (née Weill) Lehman, Kathy Acker was born Karen Alexander in New York City. There is some question as to her year of birth, 1947; the Library of Congress lists her birth year as 1948, but most obituaries state that she was born in 1944. The pregnancy was unplanned; Donald Lehman abandoned the family before Karen's birth. Her stepfather's name, Albert Alexander, appears on the birth certificate. Her relationship with her domineering mother even into adulthood was fraught with hostility and anxiety because Acker felt unloved and unwanted. Her mother soon remarried, to Albert Alexander, whose surname Kathy was given, although the writer later described her mother's union with Alexander as a passionless marriage to an ineffectual man. Acker was raised in her mother and stepfather's home on New York's prosperous Upper East Side. In 1978, Claire Alexander, Karen's mother, committed suicide.\n\nIn 1966, she married Robert Acker, and changed her last name from Alexander to Acker. Although her birth name was Karen, she was known as Kathy by her friends and family. Her first work appeared in print as part of the burgeoning New York City literary underground of the mid-1970s. Like other young women struggling to be writers and artists, she worked for a few months  as a stripper, and listening to the stories of women so different from those she had known before profoundly influenced her early work, and changed her understanding of gender and power relationships.\n\nDuring the 1970s she often moved back and forth between San Diego, San Francisco and New York. She married the composer and experimental musician Peter Gordon shortly before the end of their seven year relationship. Later, she had relationships with theorist, publisher, and critic Sylvère Lotringer and then with filmmaker and film theorist Peter Wollen.\n\nIn 1996, Acker left San Francisco and moved to London to live with writer and music critic Charles Shaar Murray.\n\nShe married twice. While most of her relationships were with men she was openly bisexual.\n\nIn 1979 she won the Pushcart Prize for her short story \"New York City in 1979\". During the early 1980s she lived in London, where she wrote several of her most critically acclaimed works. After returning to the United States in the late 1980s she worked as an adjunct professor at the San Francisco Art Institute for about six years and as a visiting professor at several universities, including the University of Idaho, the University of California, San Diego, University of California, Santa Barbara, the California Institute of Arts, and Roanoke College.\n\nHealth and death\n\nIn April 1996 Acker was diagnosed with breast cancer and she elected to have a double mastectomy. In January 1997 she wrote about her loss of faith in conventional medicine in a Guardian article, \"The Gift of Disease\".\n\nIn the article she explains that after unsuccessful surgery, which left her feeling physically mutilated and emotionally debilitated, she rejected the passivity of the patient in the medical mainstream and began to seek out the advice of nutritionists, acupuncturists, psychic healers, and Chinese herbalists. She found appealing the claim that instead of being an object of knowledge, as in Western medicine, the patient becomes a seer, a seeker of wisdom, that illness becomes the teacher and the patient the student. However, after pursuing several forms of alternative medicine in England and the United States, Acker died a year and a half later from complications of cancer in a Tijuana, Mexico alternative cancer clinic.\n\nShe died in Room 101, to which her friend Alan Moore quipped, \"There's nothing that woman can't turn into a literary reference;\" Room 101, in the climax of George Orwell's Nineteen Eighty-Four, is the basement torture chamber in which the Party attempts to subject a prisoner to his or her own worst fears.\n\nEducation\n\nAt  Brandeis University she engaged in undergraduate coursework in Classics at a time when Angela Davis was also at the university. She became interested in writing novels, and moved to California to attend University of California, San Diego where David Antin, Eleanor Antin, and Jerome Rothenberg were among her teachers. She received her bachelor's degree in 1968. After moving to New York, she attended two years of graduate school at the City University of New York in Classics, specializing in Greek. She did not earn a graduate degree. During her time in New York she was employed as a file clerk, secretary, stripper, and porn performer.\n\nLiterary overview\n\nAcker was associated with the New York punk movement of the late 1970s and early 1980s. The punk aesthetic influenced her literary style.\n\nHer controversial body of work borrows heavily from the experimental styles of William S. Burroughs and Marguerite Duras. Her writing strategies at times used forms of pastiche and deployed Burroughs's cut-up technique, involving cutting-up and scrambling passages and sentences into a somewhat random remix. Acker defined her writing as existing post-nouveau roman European tradition.\n\nIn her texts, she combines biographical elements, power, sex and violence. Indeed, critics often compare her writing to that of Alain Robbe-Grillet and Jean Genet. Critics have noticed links to Gertrude Stein and photographers Cindy Sherman and Sherrie Levine. Acker's novels also exhibit a fascination with and an indebtedness to tattoos. She dedicated Empire of the Senseless to her tattooist.\n\nAcker published her first book, Politics, in 1972. Although the collection of poems and essays did not garner much critical or public attention, it did establish her reputation within the New York punk scene. In 1973, she published her first novel (under the pseudonym Black Tarantula), The Childlike Life of the Black Tarantula: Some Lives of Murderesses. The following year she published her second novel, I Dreamt I Was a Nymphomaniac: Imagining. Both works are reprinted in Portrait of an Eye.\n\nIn 1979, she received popular attention when she won a Pushcart Prize for her short story \"New York City in 1979\". She did not receive critical attention, however, until she published Great Expectations in 1982. The opening of Great Expectations is a clear re-writing of Charles Dickens's classic of the same name. It features her usual subject matter, including a semi-autobiographical account of her mother's suicide and the appropriation of several other texts, including Pierre Guyotat's violent and sexually explicit \"Eden Eden Eden\". That same year, Acker published a chapbook, entitled Hello, I'm Erica Jong.\n\nAcker wrote the script for the 1983 film Variety. Acker wrote a text on the photographer Marcus Leatherdale that was published in 1983, in an art catalogue for the Molotov Gallery, Vienna.\n\nIn 1984, Acker's first British publication, the novel Blood and Guts in High School was published soon after its publication by Grove Press in New York.\n\nThat same year, she was signed by Grove Press, one of the legendary independent publishers committed to controversial and avant-garde writing; she was one of the last writers taken on by Barney Rosset before the end of his tenure there. Most of her work was published by them, including re-issues of important earlier work. She wrote for several magazines and anthologies, including the periodicals RE/Search, Angel Exhaust, monochrom and Rapid Eye. As she neared the end of her life, her work was more well received by the conventional press; for example, The Guardian published a number of her essays, interviews and articles, among them was an interview with the Spice Girls.\n\nAcker's In Memoriam to Identity draws attention to popular analyses of Rimbaud's life and The Sound and the Fury, constructing or revealing social and literary identity. Although known in the literary world for creating a whole new style of feminist prose and for her transgressive fiction, she was also a punk and feminist icon for her devoted portrayals of subcultures, strong-willed women, and violence.\n\nNotwithstanding the increased recognition she got for Great Expectations, Blood and Guts in High School is often considered Acker's breakthrough work. Published in 1984, it is one of her most extreme explorations of sexuality and violence. Borrowing from, among other texts, Nathaniel Hawthorne's The Scarlet Letter, Blood and Guts details the experiences of Janey Smith, a sex addicted and pelvic inflammatory disease-ridden urbanite who is in love with a father who sells her into slavery. Many critics criticized it for being demeaning toward women, and Germany banned it completely. Acker published the German court judgment against Blood and Guts in High School in [https://www.amazon.com/Hannibal-Lecter-Father-Native-Agents/dp/0936756683 Hannibal Lecter, My Father].\n\nAcker published Empire of the Senseless in 1988 and considered it a turning point in her writing. While she still borrows from other texts, including Mark Twain's The Adventures of Huckleberry Finn, the appropriation is less obvious. However, one of Acker's more controversial appropriations is from William Gibson's 1984 text, Neuromancer, in which Acker equates code with the female body and its militaristic implications. The novel comes from the voices of two terrorists, Abhor, who is half human and half robot, and her lover Thivai. The story takes place in the decaying remnants of a post-revolutionary Paris. Like her other works, Empire of the Senseless includes graphic violence and sexuality.\n\nIn 1988 she published Literal Madness: Three Novels, which included three previously published works: Florida deconstructs and reduces John Huston's 1948 film noir classic Key Largo into its base sexual politics, Kathy Goes to Haiti details a young woman's relationship and sexual exploits while on vacation, and My Death My Life by Pier Paolo Pasolini provides a fictional autobiography of the Italian filmmaker in which he solves his own murder.\n\nBetween 1990 and 1993, she published four more books: In Memoriam to Identity (1990); Hannibal Lecter, My Father (1991); Portrait of an Eye: Three Novels (1992), also composed of already published works; and My Mother: Demonology (1992). Her last novel, Pussy, King of the Pirates, published in 1996, showed signs of Acker's broadening interests as it incorporates more humor, lighter fantasy and a consideration of Eastern texts and philosophy that was largely absent in her earlier works.\n\nPosthumous reputation\n\nThree volumes of her non-fiction have been published and re-published since her death. In 2002, New York University staged Discipline and Anarchy, a retrospective exhibition of her works, while in 2008 London's Institute of Contemporary Arts screened an evening of films influenced by Acker.\n\nA collection of essays on Acker's work, Lust For Life: On the Writings of Kathy Acker, edited by Carla Harryman, Avital Ronell, and Amy Scholder, was published by Verso in 2006 and includes essays by Nayland Blake, Leslie Dick, Robert Glück, Carla Harryman, Laurence Rickels, Avital Ronell, Barrett Watten, and Peter Wollen.\n\nIn 2007, Amandla Publishing re-published Acker's articles that she wrote for the New Statesman from 1989–91.  Grove Press published two unpublished early novellas in the volume Rip-Off Red, Girl Detective and The Burning Bombing of America, and a collection of selected work, Essential Acker, edited by Amy Scholder and Dennis Cooper in 2002.\n\nIn 2015, Semiotext(e) published I'm Very Into You, a book of Acker's email correspondence with media theorist McKenzie Wark, edited by Matias Viegener, her executor and head of the Kathy Acker Literary Trust. Her personal library is housed in a reading room at the University of Cologne in Germany, and her papers are divided between NYU's Fales Library and the Rubenstein Rare Book and Manuscript Library at Duke University.\n\nIn 2017, the American writer and artist Chris Kraus published After Kathy Acker: A Literary Biography, the first book-length biography of Acker's life experiences and literary strategies.\n\nPublished works\n\n* Politics (1972)\n* Childlike Life of the Black Tarantula By the Black Tarantula (1973)\n* I Dreamt I Was a Nymphomaniac: Imagining (1974)\n* Adult Life of Toulouse Lautrec (1978)\n* Florida (1978)\n* Kathy Goes To Haiti (1978)\n* N.Y.C. in 1979 (1981)\n* Great Expectations (1983)\n* Algeria : A Series of Invocations Because Nothing Else Works (1984)\n* Blood and Guts in High School (1984)\n* Don Quixote: Which Was a Dream (1986)\n* Literal Madness: Three Novels (Reprinted 1987)\n* My Death My Life by Pier Paolo Pasolini\n* Wordplays 5 : An Anthology of New American Drama (1987)\n* Empire of the Senseless (1988)\n* In Memoriam to Identity (1990)\n* Hannibal Lecter, My Father (1991)\n* My Mother: Demonology (1994)\n* The Stabbing Hand – spoken word guest appearance on alternate mix of song by Oxbow included on reissues of album Let Me Be a Woman (1995)\n* Pussycat Fever (1995)\n* Dust. Essays (1995)\n* Pussy, King of the Pirates (1996)\n* Bodies of Work : Essays (1997)\n* Portrait of an Eye: Three Novels (Reprinted 1998)\n* Redoing Childhood (2000) spoken word CD, KRS 349.\n* Rip-Off Red, Girl Detective (pub. 2002 from manuscript of 1973). Kathy Acker. http://en.wikipedia.org/?curid=16960."
  }
}
