{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13034",
  "eid" : "062d5290-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778519609,
  "textBody" : "A geyser (; orhttp://www.oxforddictionaries.com/definition/english/geyser) is a spring characterized by intermittent discharge of water ejected turbulently and accompanied by steam.\n\nAs a fairly rare phenomenon, the formation of geysers is due to particular hydrogeological conditions that exist only in a few places on Earth. Generally all geyser field sites are located near active volcanic areas, and the geyser effect is due to the proximity of magma. Generally, surface water works its way down to an average depth of around 2000 m where it contacts hot rocks. The resultant boiling of the pressurized water results in the geyser effect of hot water and steam spraying out of the geyser's surface vent (a hydrothermal explosion).\n\nAt least 1,283 geysers have erupted in Yellowstone National Park, Wyoming, United States, and an average of 465 geysers are active there in a given year.Cross, Jeff. \"How many geysers are found in Yellowstone?\" Program and Abstracts, The 11th Biennial Scientific Conference on the Greater Yellowstone Ecosystem. October 8–10, 2012, Mammoth Hot Springs Hotel, Yellowstone National Park, Wyoming.Lundquist, Laura. \"Dormant Yellowstone geyser erupts.\" The Bozeman Daily Chronicle, August 02, 2013. A geyser's eruptive activity may change or cease due to ongoing mineral deposition within the geyser plumbing, exchange of functions with nearby hot springs, earthquake influences, and human intervention.Bryan, T.S. 1995\n\nLike many other natural phenomena, geysers are not unique to planet Earth.  Jet-like eruptions, often referred to as cryogeysers, have been observed on several of the moons of the outer solar system. Due to the low ambient pressures, these eruptions consist of vapor without liquid; they are made more easily visible by particles of dust and ice carried aloft by the gas. Water vapor jets have been observed near the south pole of Saturn's moon Enceladus, while nitrogen eruptions have been observed on Neptune's moon Triton. There are also signs of carbon dioxide eruptions from the southern polar ice cap of Mars. In the latter two cases, instead of being driven by geothermal energy, the eruptions seem to rely on solar heating via a solid-state greenhouse effect.\n\nForm and function \n\nGeysers are temporary geological features. Geysers are generally associated with volcanic areas.[http://www.wyojones.com/how__geysers_form.htm How geysers form] Gregory L. As the water boils, the resulting pressure forces a superheated column of steam and water to the surface through the geyser's internal plumbing. The formation of geysers specifically requires the combination of three geologic conditions that are usually found in volcanic terrain.\n\nIntense heat \n\nThe heat needed for geyser formation comes from magma that needs to be close to the surface of the earth. The fact that geysers need heat much higher than is normally found near the earth's surface is the reason they are associated with volcanoes or volcanic areas. The pressures encountered at the areas where the water is heated make the boiling point of the water much higher than at normal atmospheric pressures.\n\nWater \n\nThe water ejected from a geyser travels underground through deep, pressurized fissures in the Earth's crust.\n\nA plumbing system \n\nIn order for the heated water to form a geyser, a plumbing system made of fractures, fissures, porous spaces, and sometimes cavities is required. This includes a reservoir to hold the water while it is being heated. Geysers are generally aligned along faults. Constrictions in the system are essential to the building up of pressure before an eruption.\n\nEruptions \n\nGeyser activity, like all hot spring activity, is caused by surface water gradually seeping down through the ground until it meets rock heated by magma. The geothermally heated water then rises back toward the surface by convection through porous and fractured rocks. Geysers differ from non-eruptive hot springs in their subterranean structure; many consist of a small vent at the surface connected to one or more narrow tubes that lead to underground reservoirs of water and pressure tight rock.\n\nAs the geyser fills, the water at the top of the column cools off, but because of the narrowness of the channel, convective cooling of the water in the reservoir is impossible. The cooler water above presses down on the hotter water beneath, not unlike the lid of a pressure cooker, allowing the water in the reservoir to become superheated, i.e. to remain liquid at temperatures well above the standard-pressure boiling point.\n\nUltimately, the temperatures near the bottom of the geyser rise to a point where boiling begins which forces steam bubbles to rise to the top of the column. As they burst through the geyser's vent, some water overflows or splashes out, reducing the weight of the column and thus the pressure on the water below. With this release of pressure, the superheated water flashes into steam, boiling violently throughout the column. The resulting froth of expanding steam and hot water then sprays out of the geyser vent.\n\nA key requirement that enables a geyser to erupt is a material called geyserite found in rocks nearby the geyser.  Geyserite—mostly silicon dioxide (SiO2), is dissolved from the rocks and gets deposited on the walls of the geyser's plumbing system and on the surface. The deposits make the channels carrying the water up to the surface pressure-tight. This allows the pressure to be carried all the way to the top and not be leaked out into the loose gravel or soil that are normally under the geyser fields.\n\nEventually the water remaining in the geyser cools back to below the boiling point and the eruption ends; heated groundwater begins seeping back into the reservoir, and the whole cycle begins again. The duration of eruptions and time between successive eruptions vary greatly from geyser to geyser; Strokkur in Iceland erupts for a few seconds every few minutes, while Grand Geyser in the United States erupts for up to 10 minutes every 8–12 hours.\n\nGeneral categorization \n\nThere are two types of geysers: fountain geysers which erupt from pools of water, typically in a series of intense, even violent, bursts; and cone geysers which erupt from cones or mounds of siliceous sinter (including geyserite), usually in steady jets that last anywhere from a few seconds to several minutes. Old Faithful, perhaps the best-known geyser at Yellowstone National Park, is an example of a cone geyser. Grand Geyser, the tallest predictable geyser on earth, (although Geysir in Iceland is taller, it is not predictable), also at Yellowstone National Park, is an example of a fountain geyser.\n\nThere are many volcanic areas in the world that have hot springs, mud pots and fumaroles, but very few have erupting geysers. The main reason for their rarity is because multiple intense transient forces must occur simultaneously for a geyser to exist. For example, even when other necessary conditions exist, if the rock structure is loose, eruptions will erode the channels and rapidly destroy any nascent geysers.\n\nAs a result, most geysers form in places where there is volcanic rhyolite rock which dissolves in hot water and forms mineral deposits called siliceous sinter, or geyserite, along the inside of the plumbing systems which are very slender. Over time, these deposits strengthen the channel walls by cementing the rock together tightly, thus enabling the geyser to persist, as mentioned in the previous section.\n\nGeysers are fragile phenomena and if conditions change, they may go dormant or extinct. Many have been destroyed simply by people throwing debris into them while others have ceased to erupt due to dewatering by geothermal power plants. However, the Great Geysir of Iceland has had periods of activity and dormancy. During its long dormant periods, eruptions were sometimes artificially induced—often on special occasions—by the addition of surfactants to the water.\n\nBiology \n\nThe specific colours of geysers derive from the fact that despite the apparently harsh conditions, life is often found in them (and also in other hot habitats) in the form of thermophilic prokaryotes. No known eukaryote can survive over 60 °C.Lethe E. Morrison, Fred W. Tanner; Studies on Thermophilic Bacteria\nBotanical Gazette, Vol. 77, No. 2 (Apr., 1924), pp. 171-185\n\nIn the 1960s, when the research of biology of geysers first appeared, scientists were generally convinced that no life can survive above around 73 °C—the upper limit for the survival of cyanobacteria, as the structure of key cellular proteins and deoxyribonucleic acid (DNA) would be destroyed. The optimal temperature for thermophilic bacteria was placed even lower, around 55 °C.\n\nHowever, the observations proved that it is actually possible for life to exist at high temperatures and that some bacteria even prefer temperatures higher than the boiling point of water. Dozens of such bacteria are known.Michael T. Madigan and Barry L. Marrs; [http://atropos.as.arizona.edu/aiz/teaching/a204/extremophile.pdf Extremophiles] atropos.as.arizona.edu Retrieved on 2008-04-01\nThermophiles prefer temperatures from 50 to, whilst hyperthermophiles grow better at temperatures as high as 80 to. As they have heat-stable enzymes that retain their activity even at high temperatures, they have been used as a source of thermostable tools, that are important in medicine and biotechnology,Vielle, C.; Zeikus, G.J. Hyperthermophilic Enzymes: Sources, Uses, and Molecular Mechanisms for Thermostability. Microbiology and Molecular Biology Reviews. 2001, 65(1), 1-34. for example in manufacturing antibiotics, plastics, detergents (by the use of heat-stable enzymes lipases, pullulanases and proteases), and fermentation products (for example ethanol is produced). Among these, the first discovered and the most important for biotechnology is Thermus aquaticus.[http://www.udel.edu/chem/bahnson/chem645/websites/Heaton/ Industrial Uses of Thermophilic Cellulase] University of Delaware, Retrieved on 2008-03-29  The fact that such bacteria exist also stretches our imagination about life on other celestial bodies, both within and beyond the solar system.\n\nMajor geyser fields and their distribution \n\nGeysers are quite rare, requiring a combination of water, heat, and fortuitous plumbing. The combination exists in few places on Earth.Glennon, J.A. and Pfaff R.M. 2003; Bryan 1995Glennon, J Allan [http://www.uweb.ucsb.edu/~glennon/geysers/world.htm \"World Geyser Fields\"]  Retrieved on 2008-04-04\n\nYellowstone National Park, U.S. \n\nYellowstone is the largest geyser locale, containing thousands of hot springs, and approximately 300 to 500 geysers. It is home to half of the world's total number of geysers in its nine geyser basins. It is located mostly in Wyoming, USA, with small portions in Montana and Idaho.[http://www.nps.gov/yell/naturescience/geysers.htm \"Yellowstone geysers\"] nps.gov Retrieved on 2008-03-20 Yellowstone includes the world's tallest active geyser (Steamboat Geyser in Norris Geyser Basin), as well as the renowned Old Faithful Geyser, Beehive Geyser, Giantess Geyser, Lion Geyser, Plume Geyser, Aurum Geyser, Castle Geyser, Sawmill Geyser, Grand Geyser, Oblong Geyser, Giant Geyser, Daisy Geyser, Grotto Geyser, the Fan & Mortar Geysers, &  the Riverside Geyser, all in the Upper Geyser Basin which alone contains nearly 180 geysers.\n\nValley of Geysers, Russia \n\nThe Valley of Geysers (\"Dolina Geyzerov\" in Russian) located in the Kamchatka Peninsula of Russia is the only geyser field in Eurasia and the second largest concentration of geysers in the world. The area was discovered and explored by Tatyana Ustinova in 1941. Approximately 200 geysers exist in the area along with many hot-water springs and perpetual spouters. The area was formed due to a vigorous volcanic activity. The peculiar way of eruptions is an important feature of these geysers. Most of the geysers erupt at angles, and only very few have the geyser cones that exist at many other of the world's geyser fields. On June 3, 2007, a massive mudflow influenced two thirds of the valley. It was then reported that a thermal lake was forming above the valley. Few days later, waters were observed to have receded somewhat, exposing some of the submerged features. Velikan Geyser, one of the field's largest, was not buried in the slide and has recently been observed to be active.\n\nEl Tatio, Chile \n\nThe name \"El Tatio\" comes from the Quechua word for oven. El Tatio is located in the high valleys on the Andes surrounded by many active volcanoes in Chile, South America at around 4200 m above mean sea level. The valley is home to approximately 80 geysers at present. It became the largest geyser field in the Southern Hemisphere after the destruction of many of the New Zealand geysers, and is the third largest geyser field in the world. The salient feature of these geysers is that the height of their eruptions is very low, the tallest being only 6 m high, but with steam columns that can be over 20 m high. The average geyser eruption height at El Tatio is about 750 mm.Glennon, J.A. and Pfaff. R.M., 2003\n\nTaupo Volcanic Zone, New Zealand \n\nThe Taupo Volcanic Zone is located on New Zealand's North Island. It is 350 km long by 50 km and lies over a subduction zone in the Earth's crust. Mount Ruapehu marks its southwestern end, while the submarine Whakatane volcano (85 km beyond White Island) is considered its northeastern limit. Many geysers in this zone were destroyed due to geothermal developments and a hydroelectric reservoir, but several dozen geysers still exist. In the beginning of the 20th century, the largest geyser ever known, the Waimangu Geyser existed in this zone. It began erupting in 1900 and erupted periodically for four years until a landslide changed the local water table. Eruptions of Waimangu would typically reach 160 m and some superbursts are known to have reached 500 m. Recent scientific work indicates that the Earth's crust below the zone may be as little as 5 km thick. Beneath this lies a film of magma 50 km and 160 km.[http://www.stuff.co.nz/4202557a11.html Central North Island sitting on magma film] Paul Easton, The Dominion Post, 15 September 2007. Retrieved 2008-04-16\n\nIceland \n\nDue to the high rate of volcanic activity in Iceland, it is home to some famous geysers in the world. Geysers and hot springs are distributed all over the island. Many of the geysers are located in Haukadalur. Geysers are known to have existed in at least a dozen other areas on the island. The Great Geysir, which first erupted in the 14th century, gave rise to the word geyser. By 1896, Geysir was almost dormant before an earthquake that year caused eruptions to begin again, occurring several times a day, but in 1916, eruptions all but ceased. Throughout much of the 20th century, eruptions, usually following earthquakes, did happen from time to time. Some man-made improvements were made to the spring and eruptions were forced with soap on special occasions. Earthquakes in June 2000 subsequently reawakened the giant for a time but it is not currently erupting regularly. The nearby Strokkur geyser erupts every 5–8 minutes to a height of some 30 m.Gardner Servian, Solveig [http://website.lineone.net/~polar.publishing/geysersoficeland.htm \"Geysers of Iceland\"] Retrieved on 2008-04-16\n\nExtinct and dormant geyser fields \n\nThere used to be two large geysers fields in Nevada—Beowawe and Steamboat Springs—but they were destroyed by the installation of nearby geothermal power plants. At the plants, geothermal drilling reduced the available heat and lowered the local water table to the point that geyser activity could no longer be sustained.\n\nMany of New Zealand’s geysers have been destroyed by humans in the last century. Several New Zealand geysers have also become dormant or extinct by natural means. The main remaining field is Whakarewarewa at Rotorua.[http://www.whakarewarewa.com/ \"Whakarewarewa, The Thermal Village\"] Retrieved 2008-04-04 Two thirds of the geysers at Orakei Korako were flooded by the Ohakuri hydroelectric dam in 1961. The Wairakei field was lost to a geothermal power plant in 1958. The Taupo Spa field was lost when the Waikato River level was deliberately altered in the 1950s. The Rotomahana field was destroyed by the Mount Tarawera eruption in 1886.\n\nMisnamed geysers \n\nThere are various other types of geysers which are different in nature compared to the normal steam-driven geysers. These geysers differ not only in their style of eruption but also in the cause that makes them erupt.\n\nArtificial geysers \n\nIn a number of places where there is geothermal activity, wells have been drilled and fitted with impermeable casements that allow them to erupt like geysers. The vents of such geysers are artificial, but are tapped into natural hydrothermal systems. These so-called artificial geysers, technically known as erupting geothermal wells, are not true geysers. Little Old Faithful Geyser, in Calistoga, California, is an example. The geyser erupts from the casing of a well drilled in the late 19th century. According to Dr. John Rinehart in his book A Guide to Geyser Gazing (1976 p. 49), a man had drilled into the geyser in search for water. He had \"simply opened up a dead geyser\".Jones, Wyoming [http://www.wyojones.com/of_califonia.htm \"Old Faithful Geyser of California\"] WyoJones' Geyser Pages Retrieved on 2008-03-31\n\nPerpetual spouter \n\nThis is a natural hot spring that spouts water constantly without stopping for recharge. Some of these are incorrectly called geysers, but because they are not periodic in nature they are not considered true geysers.WyoJones [http://www.wyojones.com/geyserdef.htm \"Thermal Feature Definitions\"] WyoJones Retrieved on 2008-04-03\n\nCommercialization \n\nGeysers are used for various activities such as electricity generation, heating and tourism. Many geothermal reserves are found all around the world. The geyser fields in Iceland are some of the most commercially viable geyser locations in the world. Since the 1920s hot water directed from the geysers has been used to heat greenhouses and to grow food that otherwise could not have been cultivated in Iceland's inhospitable climate. Steam and hot water from the geysers has also been used for heating homes since 1943 in Iceland. In 1979 the U.S. Department of Energy (DOE) actively promoted development of geothermal energy in the \"Geysers-Calistoga Known Geothermal Resource Area\" (KGRA) near Calistoga, California through a variety of research programs and the Geothermal Loan Guarantee Program. The Department is obligated by law to assess the potential environmental impacts of geothermal development.Kerry O’Banion and Charles Hall [http://www.osti.gov/bridge/servlets/purl/6817678-VCD58M/6817678.PDF Geothermal energy and the land resource: conflicts and constraints in The Geysers- Calistoga KGRA] osti.gov Retrieved on 2008-04-12\n\nCryogeysers \n\nThere are several bodies in the Solar System where jet-like eruptions, often termed cryogeysers (cryo meaning \"icy cold\"), have been observed or are believed to occur. Unlike geysers on Earth, these represent eruptions of volatiles, together with entrained dust or ice particles, without liquid.\n* Enceladus\nGeyser-like plumes of water vapour, together with ice particles and smaller amounts of other components (such as carbon dioxide, nitrogen, ammonia, hydrocarbons and silicates), have been observed erupting from vents associated with the \"tiger stripes\" in the south polar region of Saturn's moon Enceladus by the Cassini orbiter. The mechanism by which the plumes are generated remains uncertain, but they are believed to be powered at least in part by tidal heating resulting from orbital eccentricity due to a 2:1 mean-motion orbital resonance with the moon Dione. These jets are believed to be the source of Saturn's E Ring.\n* Europa\nIn December 2013, the Hubble Space Telescope detected water vapor plumes above the south polar region of Europa, one of Jupiter's Galilean moons. It is thought that Europa's lineae might be venting this water vapor into space, caused by similar processes also occurring on Enceladus.\n* Mars\nSimilar solar-heating-driven jets of gaseous carbon dioxide are believed to erupt from the south polar cap of Mars each spring. Although these eruptions have not yet been directly observed, they leave evidence in the form of dark spots and lighter fans atop the dry ice, representing sand and dust carried aloft by the eruptions, and a spider-like pattern of grooves created below the ice by the out-rushing gas.\n* Triton\nOne of the great surprises of the Voyager 2 flyby of Neptune in 1989 was the discovery of geyser-like eruptions on its moon Triton. Astronomers noticed dark plumes rising to some 8 km above the surface, and depositing material up to 150 km downwind. These plumes represent invisible jets of gaseous nitrogen, together with dust. All the geysers observed were located close to Triton's subsolar point, indicating that solar heating drives the eruptions. It is thought that the surface of Triton probably consists of a semi-transparent layer of frozen nitrogen overlying a darker substrate, which creates a kind of \"solid greenhouse effect\", heating and vaporizing nitrogen below the ice surface it until the pressure breaks the surface at the start of an eruption. Voyager's images of Triton's southern hemisphere show many streaks of dark material laid down by geyser activity.Kirk, R.L., Branch of Astrogeology [http://articles.adsabs.harvard.edu/cgi-bin/nph-iarticle_query?db_key\nAST&bibcode1990LPI....21..633K&letter\n.&classicYES&defaultprint\nYES&whole_paperYES&page\n633&epage633&send\nSend+PDF&filetype=.pdf \"Thermal Models of Insolation-driven Nitrogen Geysers on Triton\"] Harvard Retrieved 2008-04-08",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Geyser" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13034" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A geyser (; orhttp://www.oxforddictionaries.com/definition/english/geyser) is a spring characterized by intermittent discharge of water ejected turbulently and accompanied by steam.\n\nAs a fairly rare phenomenon, the formation of geysers is due to particular hydrogeological conditions that exist only in a few places on Earth. Generally all geyser field sites are located near active volcanic areas, and the geyser effect is due to the proximity of magma. Generally, surface water works its way down to an average depth of around 2000 m where it contacts hot rocks. The resultant boiling of the pressurized water results in the geyser effect of hot water and steam spraying out of the geyser's surface vent (a hydrothermal explosion).\n\nAt least 1,283 geysers have erupted in Yellowstone National Park, Wyoming, United States, and an average of 465 geysers are active there in a given year.Cross, Jeff. \"How many geysers are found in Yellowstone?\" Program and Abstracts, The 11th Biennial Scientific Conference on the Greater Yellowstone Ecosystem. October 8–10, 2012, Mammoth Hot Springs Hotel, Yellowstone National Park, Wyoming.Lundquist, Laura. \"Dormant Yellowstone geyser erupts.\" The Bozeman Daily Chronicle, August 02, 2013. A geyser's eruptive activity may change or cease due to ongoing mineral deposition within the geyser plumbing, exchange of functions with nearby hot springs, earthquake influences, and human intervention.Bryan, T.S. 1995\n\nLike many other natural phenomena, geysers are not unique to planet Earth.  Jet-like eruptions, often referred to as cryogeysers, have been observed on several of the moons of the outer solar system. Due to the low ambient pressures, these eruptions consist of vapor without liquid; they are made more easily visible by particles of dust and ice carried aloft by the gas. Water vapor jets have been observed near the south pole of Saturn's moon Enceladus, while nitrogen eruptions have been observed on Neptune's moon Triton. There are also signs of carbon dioxide eruptions from the southern polar ice cap of Mars. In the latter two cases, instead of being driven by geothermal energy, the eruptions seem to rely on solar heating via a solid-state greenhouse effect.\n\nForm and function \n\nGeysers are temporary geological features. Geysers are generally associated with volcanic areas.[http://www.wyojones.com/how__geysers_form.htm How geysers form] Gregory L. As the water boils, the resulting pressure forces a superheated column of steam and water to the surface through the geyser's internal plumbing. The formation of geysers specifically requires the combination of three geologic conditions that are usually found in volcanic terrain.\n\nIntense heat \n\nThe heat needed for geyser formation comes from magma that needs to be close to the surface of the earth. The fact that geysers need heat much higher than is normally found near the earth's surface is the reason they are associated with volcanoes or volcanic areas. The pressures encountered at the areas where the water is heated make the boiling point of the water much higher than at normal atmospheric pressures.\n\nWater \n\nThe water ejected from a geyser travels underground through deep, pressurized fissures in the Earth's crust.\n\nA plumbing system \n\nIn order for the heated water to form a geyser, a plumbing system made of fractures, fissures, porous spaces, and sometimes cavities is required. This includes a reservoir to hold the water while it is being heated. Geysers are generally aligned along faults. Constrictions in the system are essential to the building up of pressure before an eruption.\n\nEruptions \n\nGeyser activity, like all hot spring activity, is caused by surface water gradually seeping down through the ground until it meets rock heated by magma. The geothermally heated water then rises back toward the surface by convection through porous and fractured rocks. Geysers differ from non-eruptive hot springs in their subterranean structure; many consist of a small vent at the surface connected to one or more narrow tubes that lead to underground reservoirs of water and pressure tight rock.\n\nAs the geyser fills, the water at the top of the column cools off, but because of the narrowness of the channel, convective cooling of the water in the reservoir is impossible. The cooler water above presses down on the hotter water beneath, not unlike the lid of a pressure cooker, allowing the water in the reservoir to become superheated, i.e. to remain liquid at temperatures well above the standard-pressure boiling point.\n\nUltimately, the temperatures near the bottom of the geyser rise to a point where boiling begins which forces steam bubbles to rise to the top of the column. As they burst through the geyser's vent, some water overflows or splashes out, reducing the weight of the column and thus the pressure on the water below. With this release of pressure, the superheated water flashes into steam, boiling violently throughout the column. The resulting froth of expanding steam and hot water then sprays out of the geyser vent.\n\nA key requirement that enables a geyser to erupt is a material called geyserite found in rocks nearby the geyser.  Geyserite—mostly silicon dioxide (SiO2), is dissolved from the rocks and gets deposited on the walls of the geyser's plumbing system and on the surface. The deposits make the channels carrying the water up to the surface pressure-tight. This allows the pressure to be carried all the way to the top and not be leaked out into the loose gravel or soil that are normally under the geyser fields.\n\nEventually the water remaining in the geyser cools back to below the boiling point and the eruption ends; heated groundwater begins seeping back into the reservoir, and the whole cycle begins again. The duration of eruptions and time between successive eruptions vary greatly from geyser to geyser; Strokkur in Iceland erupts for a few seconds every few minutes, while Grand Geyser in the United States erupts for up to 10 minutes every 8–12 hours.\n\nGeneral categorization \n\nThere are two types of geysers: fountain geysers which erupt from pools of water, typically in a series of intense, even violent, bursts; and cone geysers which erupt from cones or mounds of siliceous sinter (including geyserite), usually in steady jets that last anywhere from a few seconds to several minutes. Old Faithful, perhaps the best-known geyser at Yellowstone National Park, is an example of a cone geyser. Grand Geyser, the tallest predictable geyser on earth, (although Geysir in Iceland is taller, it is not predictable), also at Yellowstone National Park, is an example of a fountain geyser.\n\nThere are many volcanic areas in the world that have hot springs, mud pots and fumaroles, but very few have erupting geysers. The main reason for their rarity is because multiple intense transient forces must occur simultaneously for a geyser to exist. For example, even when other necessary conditions exist, if the rock structure is loose, eruptions will erode the channels and rapidly destroy any nascent geysers.\n\nAs a result, most geysers form in places where there is volcanic rhyolite rock which dissolves in hot water and forms mineral deposits called siliceous sinter, or geyserite, along the inside of the plumbing systems which are very slender. Over time, these deposits strengthen the channel walls by cementing the rock together tightly, thus enabling the geyser to persist, as mentioned in the previous section.\n\nGeysers are fragile phenomena and if conditions change, they may go dormant or extinct. Many have been destroyed simply by people throwing debris into them while others have ceased to erupt due to dewatering by geothermal power plants. However, the Great Geysir of Iceland has had periods of activity and dormancy. During its long dormant periods, eruptions were sometimes artificially induced—often on special occasions—by the addition of surfactants to the water.\n\nBiology \n\nThe specific colours of geysers derive from the fact that despite the apparently harsh conditions, life is often found in them (and also in other hot habitats) in the form of thermophilic prokaryotes. No known eukaryote can survive over 60 °C.Lethe E. Morrison, Fred W. Tanner; Studies on Thermophilic Bacteria\nBotanical Gazette, Vol. 77, No. 2 (Apr., 1924), pp. 171-185\n\nIn the 1960s, when the research of biology of geysers first appeared, scientists were generally convinced that no life can survive above around 73 °C—the upper limit for the survival of cyanobacteria, as the structure of key cellular proteins and deoxyribonucleic acid (DNA) would be destroyed. The optimal temperature for thermophilic bacteria was placed even lower, around 55 °C.\n\nHowever, the observations proved that it is actually possible for life to exist at high temperatures and that some bacteria even prefer temperatures higher than the boiling point of water. Dozens of such bacteria are known.Michael T. Madigan and Barry L. Marrs; [http://atropos.as.arizona.edu/aiz/teaching/a204/extremophile.pdf Extremophiles] atropos.as.arizona.edu Retrieved on 2008-04-01\nThermophiles prefer temperatures from 50 to, whilst hyperthermophiles grow better at temperatures as high as 80 to. As they have heat-stable enzymes that retain their activity even at high temperatures, they have been used as a source of thermostable tools, that are important in medicine and biotechnology,Vielle, C.; Zeikus, G.J. Hyperthermophilic Enzymes: Sources, Uses, and Molecular Mechanisms for Thermostability. Microbiology and Molecular Biology Reviews. 2001, 65(1), 1-34. for example in manufacturing antibiotics, plastics, detergents (by the use of heat-stable enzymes lipases, pullulanases and proteases), and fermentation products (for example ethanol is produced). Among these, the first discovered and the most important for biotechnology is Thermus aquaticus.[http://www.udel.edu/chem/bahnson/chem645/websites/Heaton/ Industrial Uses of Thermophilic Cellulase] University of Delaware, Retrieved on 2008-03-29  The fact that such bacteria exist also stretches our imagination about life on other celestial bodies, both within and beyond the solar system.\n\nMajor geyser fields and their distribution \n\nGeysers are quite rare, requiring a combination of water, heat, and fortuitous plumbing. The combination exists in few places on Earth.Glennon, J.A. and Pfaff R.M. 2003; Bryan 1995Glennon, J Allan [http://www.uweb.ucsb.edu/~glennon/geysers/world.htm \"World Geyser Fields\"]  Retrieved on 2008-04-04\n\nYellowstone National Park, U.S. \n\nYellowstone is the largest geyser locale, containing thousands of hot springs, and approximately 300 to 500 geysers. It is home to half of the world's total number of geysers in its nine geyser basins. It is located mostly in Wyoming, USA, with small portions in Montana and Idaho.[http://www.nps.gov/yell/naturescience/geysers.htm \"Yellowstone geysers\"] nps.gov Retrieved on 2008-03-20 Yellowstone includes the world's tallest active geyser (Steamboat Geyser in Norris Geyser Basin), as well as the renowned Old Faithful Geyser, Beehive Geyser, Giantess Geyser, Lion Geyser, Plume Geyser, Aurum Geyser, Castle Geyser, Sawmill Geyser, Grand Geyser, Oblong Geyser, Giant Geyser, Daisy Geyser, Grotto Geyser, the Fan & Mortar Geysers, &  the Riverside Geyser, all in the Upper Geyser Basin which alone contains nearly 180 geysers.\n\nValley of Geysers, Russia \n\nThe Valley of Geysers (\"Dolina Geyzerov\" in Russian) located in the Kamchatka Peninsula of Russia is the only geyser field in Eurasia and the second largest concentration of geysers in the world. The area was discovered and explored by Tatyana Ustinova in 1941. Approximately 200 geysers exist in the area along with many hot-water springs and perpetual spouters. The area was formed due to a vigorous volcanic activity. The peculiar way of eruptions is an important feature of these geysers. Most of the geysers erupt at angles, and only very few have the geyser cones that exist at many other of the world's geyser fields. On June 3, 2007, a massive mudflow influenced two thirds of the valley. It was then reported that a thermal lake was forming above the valley. Few days later, waters were observed to have receded somewhat, exposing some of the submerged features. Velikan Geyser, one of the field's largest, was not buried in the slide and has recently been observed to be active.\n\nEl Tatio, Chile \n\nThe name \"El Tatio\" comes from the Quechua word for oven. El Tatio is located in the high valleys on the Andes surrounded by many active volcanoes in Chile, South America at around 4200 m above mean sea level. The valley is home to approximately 80 geysers at present. It became the largest geyser field in the Southern Hemisphere after the destruction of many of the New Zealand geysers, and is the third largest geyser field in the world. The salient feature of these geysers is that the height of their eruptions is very low, the tallest being only 6 m high, but with steam columns that can be over 20 m high. The average geyser eruption height at El Tatio is about 750 mm.Glennon, J.A. and Pfaff. R.M., 2003\n\nTaupo Volcanic Zone, New Zealand \n\nThe Taupo Volcanic Zone is located on New Zealand's North Island. It is 350 km long by 50 km and lies over a subduction zone in the Earth's crust. Mount Ruapehu marks its southwestern end, while the submarine Whakatane volcano (85 km beyond White Island) is considered its northeastern limit. Many geysers in this zone were destroyed due to geothermal developments and a hydroelectric reservoir, but several dozen geysers still exist. In the beginning of the 20th century, the largest geyser ever known, the Waimangu Geyser existed in this zone. It began erupting in 1900 and erupted periodically for four years until a landslide changed the local water table. Eruptions of Waimangu would typically reach 160 m and some superbursts are known to have reached 500 m. Recent scientific work indicates that the Earth's crust below the zone may be as little as 5 km thick. Beneath this lies a film of magma 50 km and 160 km.[http://www.stuff.co.nz/4202557a11.html Central North Island sitting on magma film] Paul Easton, The Dominion Post, 15 September 2007. Retrieved 2008-04-16\n\nIceland \n\nDue to the high rate of volcanic activity in Iceland, it is home to some famous geysers in the world. Geysers and hot springs are distributed all over the island. Many of the geysers are located in Haukadalur. Geysers are known to have existed in at least a dozen other areas on the island. The Great Geysir, which first erupted in the 14th century, gave rise to the word geyser. By 1896, Geysir was almost dormant before an earthquake that year caused eruptions to begin again, occurring several times a day, but in 1916, eruptions all but ceased. Throughout much of the 20th century, eruptions, usually following earthquakes, did happen from time to time. Some man-made improvements were made to the spring and eruptions were forced with soap on special occasions. Earthquakes in June 2000 subsequently reawakened the giant for a time but it is not currently erupting regularly. The nearby Strokkur geyser erupts every 5–8 minutes to a height of some 30 m.Gardner Servian, Solveig [http://website.lineone.net/~polar.publishing/geysersoficeland.htm \"Geysers of Iceland\"] Retrieved on 2008-04-16\n\nExtinct and dormant geyser fields \n\nThere used to be two large geysers fields in Nevada—Beowawe and Steamboat Springs—but they were destroyed by the installation of nearby geothermal power plants. At the plants, geothermal drilling reduced the available heat and lowered the local water table to the point that geyser activity could no longer be sustained.\n\nMany of New Zealand’s geysers have been destroyed by humans in the last century. Several New Zealand geysers have also become dormant or extinct by natural means. The main remaining field is Whakarewarewa at Rotorua.[http://www.whakarewarewa.com/ \"Whakarewarewa, The Thermal Village\"] Retrieved 2008-04-04 Two thirds of the geysers at Orakei Korako were flooded by the Ohakuri hydroelectric dam in 1961. The Wairakei field was lost to a geothermal power plant in 1958. The Taupo Spa field was lost when the Waikato River level was deliberately altered in the 1950s. The Rotomahana field was destroyed by the Mount Tarawera eruption in 1886.\n\nMisnamed geysers \n\nThere are various other types of geysers which are different in nature compared to the normal steam-driven geysers. These geysers differ not only in their style of eruption but also in the cause that makes them erupt.\n\nArtificial geysers \n\nIn a number of places where there is geothermal activity, wells have been drilled and fitted with impermeable casements that allow them to erupt like geysers. The vents of such geysers are artificial, but are tapped into natural hydrothermal systems. These so-called artificial geysers, technically known as erupting geothermal wells, are not true geysers. Little Old Faithful Geyser, in Calistoga, California, is an example. The geyser erupts from the casing of a well drilled in the late 19th century. According to Dr. John Rinehart in his book A Guide to Geyser Gazing (1976 p. 49), a man had drilled into the geyser in search for water. He had \"simply opened up a dead geyser\".Jones, Wyoming [http://www.wyojones.com/of_califonia.htm \"Old Faithful Geyser of California\"] WyoJones' Geyser Pages Retrieved on 2008-03-31\n\nPerpetual spouter \n\nThis is a natural hot spring that spouts water constantly without stopping for recharge. Some of these are incorrectly called geysers, but because they are not periodic in nature they are not considered true geysers.WyoJones [http://www.wyojones.com/geyserdef.htm \"Thermal Feature Definitions\"] WyoJones Retrieved on 2008-04-03\n\nCommercialization \n\nGeysers are used for various activities such as electricity generation, heating and tourism. Many geothermal reserves are found all around the world. The geyser fields in Iceland are some of the most commercially viable geyser locations in the world. Since the 1920s hot water directed from the geysers has been used to heat greenhouses and to grow food that otherwise could not have been cultivated in Iceland's inhospitable climate. Steam and hot water from the geysers has also been used for heating homes since 1943 in Iceland. In 1979 the U.S. Department of Energy (DOE) actively promoted development of geothermal energy in the \"Geysers-Calistoga Known Geothermal Resource Area\" (KGRA) near Calistoga, California through a variety of research programs and the Geothermal Loan Guarantee Program. The Department is obligated by law to assess the potential environmental impacts of geothermal development.Kerry O’Banion and Charles Hall [http://www.osti.gov/bridge/servlets/purl/6817678-VCD58M/6817678.PDF Geothermal energy and the land resource: conflicts and constraints in The Geysers- Calistoga KGRA] osti.gov Retrieved on 2008-04-12\n\nCryogeysers \n\nThere are several bodies in the Solar System where jet-like eruptions, often termed cryogeysers (cryo meaning \"icy cold\"), have been observed or are believed to occur. Unlike geysers on Earth, these represent eruptions of volatiles, together with entrained dust or ice particles, without liquid.\n* Enceladus\nGeyser-like plumes of water vapour, together with ice particles and smaller amounts of other components (such as carbon dioxide, nitrogen, ammonia, hydrocarbons and silicates), have been observed erupting from vents associated with the \"tiger stripes\" in the south polar region of Saturn's moon Enceladus by the Cassini orbiter. The mechanism by which the plumes are generated remains uncertain, but they are believed to be powered at least in part by tidal heating resulting from orbital eccentricity due to a 2:1 mean-motion orbital resonance with the moon Dione. These jets are believed to be the source of Saturn's E Ring.\n* Europa\nIn December 2013, the Hubble Space Telescope detected water vapor plumes above the south polar region of Europa, one of Jupiter's Galilean moons. It is thought that Europa's lineae might be venting this water vapor into space, caused by similar processes also occurring on Enceladus.\n* Mars\nSimilar solar-heating-driven jets of gaseous carbon dioxide are believed to erupt from the south polar cap of Mars each spring. Although these eruptions have not yet been directly observed, they leave evidence in the form of dark spots and lighter fans atop the dry ice, representing sand and dust carried aloft by the eruptions, and a spider-like pattern of grooves created below the ice by the out-rushing gas.\n* Triton\nOne of the great surprises of the Voyager 2 flyby of Neptune in 1989 was the discovery of geyser-like eruptions on its moon Triton. Astronomers noticed dark plumes rising to some 8 km above the surface, and depositing material up to 150 km downwind. These plumes represent invisible jets of gaseous nitrogen, together with dust. All the geysers observed were located close to Triton's subsolar point, indicating that solar heating drives the eruptions. It is thought that the surface of Triton probably consists of a semi-transparent layer of frozen nitrogen overlying a darker substrate, which creates a kind of \"solid greenhouse effect\", heating and vaporizing nitrogen below the ice surface it until the pressure breaks the surface at the start of an eruption. Voyager's images of Triton's southern hemisphere show many streaks of dark material laid down by geyser activity.Kirk, R.L., Branch of Astrogeology [http://articles.adsabs.harvard.edu/cgi-bin/nph-iarticle_query?db_key\nAST&bibcode1990LPI....21..633K&letter\n.&classicYES&defaultprint\nYES&whole_paperYES&page\n633&epage633&send\nSend+PDF&filetype=.pdf \"Thermal Models of Insolation-driven Nitrogen Geysers on Triton\"] Harvard Retrieved 2008-04-08. Geyser. http://en.wikipedia.org/?curid=13034."
  }
}
