{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=15697",
  "eid" : "1e2249a0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778559802,
  "textBody" : "Politics of the Bailiwick of Jersey takes place in a framework of a parliamentary representative democratic constitution.\n\nAs one of the Crown Dependencies, Jersey is autonomous and self-governing, with its own independent legal, administrative and fiscal systems.\n\nThe legislature is the Assembly of the States of Jersey.\n\nExecutive powers are mainly exercised by a Chief Minister and nine ministers, known collectively as the Council of Ministers. Other executive powers are exercised by the Connétable and Parish Assembly in each of the twelve parishes.\n\nThe Crown\n\nElizabeth II's traditional title as Head of State is Duke of Normandy. \"The Crown\" is defined by the Law Officers of the Crown as the \"Crown in right of Jersey\".http://www5.gov.je/SiteCollectionDocuments/Government%20and%20administration/R%20Attorney%20General%20Transcript%2020100702%20WM.pdf The Queen's representative and adviser in the island is the Lieutenant Governor of Jersey. He is a point of contact between Jersey ministers and the United Kingdom government and carries out executive functions in relation to immigration control, deportation, naturalisation and the issue of passports. Since 2011, the incumbent Lieutenant Governor has been Sir John McColl.\n\nThe Crown (not the government or parliament of Jersey) appoints the Lieutenant Governor, the Bailiff, Deputy Bailiff, Attorney General and Solicitor General. In practice, the process of appointment involves a panel in Jersey which select a preferred candidate whose name is communicated to the UK Ministry of Justice for approval before a formal recommendation is made to the Queen.\n\nConstitution\n\nJersey has an unwritten constitution arising from the Treaty of Paris (1259). When Henry III and the King of France came to terms over the Duchy of Normandy, all lands except the Channel Islands recognised the suzerainty of the King of France. The Channel Islands however were never absorbed into the Kingdom of England by any Act of Union and exist as \"peculiars of the Crown\".\n\nCampaigns for constitutional reform during the 19th century successfully called for: the replacement of lay Jurats with professional judges in the Royal Court to decide questions of law; the establishment of a Police Court (later known as the Magistrate's Court); the creation of a Petty Debts Court; a professional, salaried police force for St Helier in addition to the Honorary Police; and the reform of \"archaic procedure of the Royal Court for criminal trials\". In 1845, the elected office of deputy was created though this did little to redress the disparity of representation between the rural and urban parishes: in 1854 St Helier contained over half of the island's population, yet was able to elect only three out of the 14 deputies.\n\nTwo significant constitutional reforms took place during the 20th century. In 1946, the States of Jersey drew up plans for change following the German Occupation, which were examined by a Committee of the Privy Council. No change was made to the functions of the Bailiff. The twelve Jurats were removed from the assembly of the States of Jersey and replaced by twelve senators elected on an island-wide basis who would have no judicial functions. The twelve Rectors also lost their place in the States assembly. No reforms were made to the role of the Deputies in the assembly. The second major reforms took place in December 2005, when the States of Jersey Law 2005 came into force. This created a system of ministerial government to replace the previous committee-based administration.Report of the Review Panel on the Machinery of Government in Jersey (December 2000) http://www.gov.je/SiteCollectionDocuments/Government%20and%20administration/ID%20ClothierReport%20100331%20CC.pdf\n\nLegislation relating to the organisation of government includes:\n* States of Jersey Law 2005\n* Administrative Decisions (Review)(Jersey) Law 1982\n* Loi (1804) au sujet des assemblées paroissiales\n* Loi (1905) au sujet des assemblées paroissiales\n* Bailiff of Jersey (Vacancy in Office) Law 1959\n* European Communities (Jersey) Law 1973\n* Loi (1853) au sujet des centeniers et officiers de police\n* Centeniers (Terms of Office) (Jersey) Law 2007\n* Human Rights (Jersey) Law 2000\n* Judicial and Legislative Functions (Separation) (Jersey) Law 1951\n* Parish of St. Helier (Qualifications for Office) (Jersey) Law 1976\n* Police Force (Jersey) Law 1974\n* Prison (Jersey) Law 1957\n* Public Elections (Jersey) Law 2002\n* Public Finances (Jersey) Law 2005\n* Regulation of Investigatory Powers (Jersey) Law 2005\n* Royal Court (Jersey) Law 1948\n* Règlements Provisoires\n\nConstitutional reforms continue to be debated in the island.\n\nIn 2009, the States assembly rejected proposals by the Privileges and Procedures Committee to simplify the electoral system by keeping the 12 Connétables and introducing 37 deputies elected to six \"super-constituencies\". In 2010, the States assembly agreed to holding elections for all seats on a single date and to cut the number of Senators from 12 to 8.\n\nIn December 2010, a committee chaired by Lord Carswell recommended changes to the role of the Bailiff—in particular that the Bailiff should cease to the presiding officer over the States assembly.Andy Sibcy, 'Review says Bailiff should quit States', Jersey Evening Post, 6 December 2010 http://www.thisisjersey.com/2010/12/06/review-says-bailiff-should-quit-states/\n\nFollowing widespread criticisms of the system of ministerial government introduced in December 2005, the States assembly agreed in March 2011 to establish an independent electoral commission to review the make-up of the assembly and government.Minutes of the States of Jersey, 15 March 2011 http://www.statesassembly.gov.je; and see also \n\nIn April 2011, Deputy Le Claire lodged au Greffe a request for the Chief Minister to produce, for debate, a draft written \"Constitution for Jersey\";  the States assembly did not support this idea.\n\nRelations with the United Kingdom \n\nWithin the United Kingdom government, responsibility for relations between Jersey (and the other Crown dependencies) and the United Kingdom lie in the Crown Dependencies Branch within the International Directorate of the Ministry of Justice, which has a core team of three officials, with four others and four lawyers available when required.\n\nIn 2010, the House of Commons Justice Committee, conducting an inquiry into the Crown dependencies, found that the Jersey government and those of the other islands were \"with some important caveats, content with their relationship with the Ministry of Justice\". Tensions have, however, arisen from time to time. In the 1980s, there were discussions about a financial contribution from Jersey towards the United Kingdom's costs in relation to defence and international representation.See below. In March 2009, the House of Lords Constitution Committee criticised UK government proposals in the Borders, Citizenship and Immigration Bill dealing with the Common Travel Area, concluding that \"the policy-making process ... has not been informed by any real appreciation of the constitutional status of the Crown dependencies or the rights of free movement of Islanders\". In 2009, the UK cancelled the reciprocal health agreement with Jersey, though a new one came into effect in April 2011.HL Deb, 25 January 2010, c1195 https://publications.parliament.uk/pa/ld200910/ldhansrd/text/100125-0002.htm#1001252000061; HC Deb, 1 April 2011, c43WS https://publications.parliament.uk/pa/cm201011/cmhansrd/cm110401/wmstext/110401m0001.htm#11040177000049 From 2005 to 2011, there were protracted dealings between Jersey and the United Kingdom over Jersey's \"zero-ten\" tax regime and whether it would be acceptable to the European Union.Andy Sibcy, 'Zero-ten: \"UK, not Europe, the problem\"', Jersey Evening Post, 14 December 2010 http://www.thisisjersey.com/2010/12/14/zero-ten-uk-not-europe-the-problem/; Richard Murphy, 'Zero-ten: It is Europe we have to worry about', Jersey Evening Post, 16 December 2010 http://www.thisisjersey.com/2010/12/16/zero-ten-it-is-europe-we-have-to-worry-about/ ;Pierre Horsfall, 'Jersey Tax and the EU', Jersey Evening Post, 23 December 2010 http://www.thisisjersey.com/2010/12/23/jersey-tax-and-the-eu/ ; 'Zero-ten will get UK approval, hints MP', Jersey Evening Post, 4 June 2011 http://www.thisisjersey.com/2011/06/04/zero-ten-will-get-uk-approval-hints-mp/; 'Zero-ten tax clears another hurdle, Jersey Evening Post, 8 July 2011 http://www.thisisjersey.com/2011/07/08/zero-ten-tax-clears-another-hurdle/\n\nAlthough Jersey is for most day-to-day purposes entirely self-governing in relation to its internal affairs, the Crown retains residual responsibility for the \"good government\" of the island. The UK government has consistently adopted a \"non-interventionist policy\", and following the \"high degree of consensus amongst academics, legal advisers, politicians and officials\" would only intervene \"in the event of a fundamental breakdown in public order or the rule of law, endemic corruption in the government or other extreme circumstances\".\n\nInternational relations \n\nThe 1973 Kilbrandon Report stated that \"In international law the United Kingdom Government is responsible for the Islands' international relations\" and \"also responsible for the defence of the Islands\". The United Kingdom is responsible for Jersey's international relations as an aspect of the island's status as a Crown dependency. It is now normal practice for the UK to consult the Jersey government and seek their consent before entering into treaty obligations affecting the island.\n\nSince 2000, Jersey's \"external personality\" has developed, recognised in the preamble to the States of Jersey Law 2005 which refers to \"an increasing need for Jersey to participate in matters of international affairs\".http://www.jerseylaw.je/Law/display.aspx?url=lawsinforce/htm/LawFiles/2005/l-08-2005.htm#_Toc88473872 In 2007, the Chief Minister of Jersey and the UK government agreed an \"International Identity Framework\", setting out the modern relationship between the United Kingdom and Jersey. The United Kingdom now issues \"Letters of Entrustment\" to the Jersey government, which delegate power to Jersey to negotiate international agreements on its own behalf and sign treaties in Jersey's own name rather than through the United Kingdom. This development was \"strongly supported\" by the House of Commons Justice Committee in its March 2010 report on the Crown Dependencies. In January 2011 Senator Freddie Cohen was appointed as Assistant Chief Minister with responsibility for UK and International Relations (in effect, Jersey's first Foreign Minister). \n \nJersey is neither a Member State nor an Associate Member of European Union. It does, however, have a relationship with the EU governed by Protocol 3 to the UK’s Treaty of Accession in 1972.Treaty on the Functioning of the European Union, Article 355(5)(c) states \"the Treaties shall apply to the Channel Islands and the Isle of Man only to the extent necessary to ensure the implementation of the arrangements for those islands set out in the Treaty concerning the accession of new Member States to the European Economic Community and to the European Atomic Energy Community signed on 22 January 1972\".\n\nIn relation to the Council of Europe, Jersey – as a territory the United Kingdom is responsible for in international law– has been bound by the European Convention on Human Rights since the UK acceded to the treaty in 1951. The Human Rights (Jersey) Law 2000 makes Convention rights part of Jersey law and is based closely on the United Kingdom's Human Rights Act 1998.\n\nDuring the 1980s, the question of Jersey making an annual contribution towards the United Kingdom's costs of defence and international representation undertaken on behalf of Jersey was raised. In 1987, the States of Jersey made an interim payment of £8 million while the matter was discussed.Minutes of the States of Jersey, 17 March 1987. The outcome of debates within the island was that the contribution should take the form of maintaining a Territorial Army unit in Jersey. The Jersey Field Squadron (Militia), attached to the Royal Monmouthshire Royal Engineers (Militia), deploys individuals on operations in support of British Forces.\n\nSeparation debate \n\nThe question of Jersey's independence has been discussed from time to time in the Assembly of the States of Jersey. In 1999, a member of the government said that 'Independence is an option open to the Island if the circumstances should justify this' but the government 'does not believe independence is appropriate in the present circumstances and does not see the circumstances arising in the foreseeable future when it would be appropriate'.Answer by Senate Pierre Horsfall to question by Deputy Paul Le Claire, Minutes of the States Assembly, 8 June 1999 http://www.statesassembly.gov.je/display_result.asp?url=\\documents\\minutes\\35925-37231.htm In 2000, Senator Paul Le Claire called for a referendum on independence, a proposal which failed to win any significant support.; ;  The Policy and Resources Committee of the States of Jersey established the Constitutional Review Group in July 2005, chaired by Sir Philip Bailhache, with terms of reference 'to conduct a review and evaluation of the potential advantages and disadvantages for Jersey in seeking independence from the United Kingdom or other incremental change in the constitutional relationship, while retaining the Queen as Head of State'. The Group's Second Interim Report was presented to the States by the Council of Ministers in June 2008. The report concluded that 'Jersey is equipped to face the challenges of independence' but 'whether those steps should be taken is not within the remit of this paper'.\n\nProposals for Jersey independence have subsequently been discussed at an international conference held in Jersey, organised by the Jersey and Guernsey Law Review.Editorial, 'Legal ideas of political importance', Jersey Evening Post, 21 September 2010 http://www.thisisjersey.com/2010/09/21/legal-ideas-of-political-importance/; Andy Sibcy, 'Sovereignty or dependency on agenda at conference', Jersey Evening Post, 17 September 2010 http://www.thisisjersey.com/2010/09/17/sovereignty-or-dependency-on-agenda-at-conference/;  The former Bailiff, Sir Philip Bailhache has called for changes to the Channel Islands' relationship with the United Kingdom government, arguing that 'at the very least, we should be ready for independence if we are placed in a position where that course was the only sensible option'.P Bailhache, 'One or two steps from sovereignty'  [2009] Jersey and Guernsey Law Review http://www.jerseylaw.je/Publications/jerseylawreview/oct09/JLR0910_Bailhache.aspx\n\nIn October 2012 the Council of Ministers issued a \"Common policy for external relations\" that set out a number of principles for the conduct of external relations in accordance with existing undertakings and agreements. This document noted that Jersey \"is a self-governing, democratic country with the power of self-determination\" and \"that it is not Government policy to seek independence from the United Kingdom, but rather to ensure that Jersey is prepared if it were in the best interests of Islanders to do so\". On the basis of the established principles the Council of Ministers decided to \"ensure that Jersey is prepared for external change that may affect the Island’s formal relationship with the United Kingdom and/or European Union\".\n\nNational Assembly - the States of Jersey\n\n The parliamentary body responsible for adopting legislation and scrutinising the Council of Ministers is the Assembly of the States of Jersey. Forty-Nine elected members (8 Senators, 29 Deputies and 12 Connétables) sit in the unicameral assembly. There are also five non-elected, non-voting members appointed by the Crown (the Bailiff, the Lieutenant Governor, the Dean of Jersey, the Attorney General and the Solicitor General).States of Jersey Law 2005, Article 2 http://www.jerseylaw.je/Law/display.aspx?url=lawsinforce/htm/LawFiles/2005/l-08-2005.htm#_Toc88473877\n\nDecisions in the States are taken by majority vote of the elected members present and voting. The States of Jersey Law 2005 removed the Bailiff's a casting vote and the Lieutenant Governor's power of veto. Although formally organised party politics plays no role in the States of Jersey assembly, members often vote together in two main blocs – a minority of members, holding broadly progressive views and critical of the Council of Ministers versus a majority of members, of conservative ideology, who support the Council of Ministers.\n\nScrutiny panels of backbench members of the assembly have been established to examine (i) economic affairs, (ii) environment, (iii) corporate services, (iv) education and home affairs and (v) health, social security and housing. The real utility of the panels is said to be \"that of independent critique which holds ministers to account and constructively engages with policy which is deficient\".\n\nAccording to constitutional convention United Kingdom legislation may be extended to Jersey by Order in Council at the request of the Island's government. Whether an Act of the United Kingdom Parliament may expressly apply to the Island as regards matters of self-government, or whether this historic power is now in abeyance, is a matter of legal debate. The States of Jersey Law 2005 established that no United Kingdom Act or Order in Council may apply to the Bailiwick without being referred to the States of Jersey.States of Jersey Law 2005, Article 30 http://www.jerseylaw.je/Law/display.aspx?url=lawsinforce/htm/LawFiles/2005/l-08-2005.htm#_Toc88473910\n\nNational government – the Council of Ministers \n\nHistorically, Jersey had a \"committee-based system of administration embracing all public service functions and guaranteeing extensive involvement in policy-making for most members\" of the Assembly of the States of Jersey.\nThe report of a review committee chaired by Sir Cecil Clothier criticised this system of government, finding it incapable of developing high-level strategy, efficient policy-coordination or effective political leadership.Report of the Review Panel on the Machinery of Government in Jersey (December 2000) The [http://www.jerseylaw.je/Law/display.aspx?url=lawsinforce/htm/LawFiles/2005/l-08-2005.htm States of Jersey Law 2005] introduced a ministerial system of government. Executive powers are now exercised by a Chief Minister and nine ministers, known collectively as the Council of Ministers responsible to the States Assembly.\n\nThe Chief Minister is elected from amongst the elected members of the States. Ministers are then proposed both by the Chief Minister and any other elected member, the final decision being made by the States assembly.\n\nThere is no convention of Cabinet collective responsibility among members of the Council of Ministers. The Council of Ministers reaches decisions by consensus and individual ministers retain the freedom to dissent from Council decisions in public and even present their own policy to the assembly of the States in their capacity as a member of the assembly without having to resign as a minister. Ministers are, however, bound by a Code of Conduct for Ministers approved in 2006.http://www.statesassembly.gov.je/documents/reports/37251-16065-1022006.htm However, this may change as recently the Jersey Evening Post reported \"MINISTERS will be bound by collective responsibility and the Chief Minister will have the power to fire his ministerial colleagues after a package of changes to the way Jersey’s government is run were approved.\" http://jerseyeveningpost.com/news/2014/05/21/members-no-longer-allowed-to-openly-disagree/\n\nThe overall direction of government as agreed by the Council of Ministers is published periodically as a \"strategic plan\", the current one being the States of Jersey Strategic Plan 2009-2014. These plans are debated and approved by the assembly of the States of Jersey and translated into action by a series of business plans for each department.\n\nSeveral departments, each headed by a minister, are responsible for developing policy within the framework of the strategic plan and for implementing services. They include: the Chief Minister's Department; Economic Development; Education, Sport and Culture; Health and Social Services; Home Affairs; Housing; Environment; Social Security; Transport and Technical Services; and Treasury and Resources.\n\nPolitical parties\n\nIn 2000, the Clothier report noted that \"over the centuries Jersey has had many parties, by which one means only a coming together of like minds to achieve a particular objective. Once achieved, the binding purpose has disappeared and the group pursuing it has dissolved. Such a grouping is not a true political party because it lacks the cement of a common philosophy of government, having only a narrow objective to hold it together until the objective is either attained or lost\". Various parties have been formed over the years in Jersey, but since the 1950s the majority of candidates have stood for election unaffiliated to any political party.\n\n18th century \n\nHistorically, two parties dominated Jersey politics. Originating in the 1770s, the Jeannot party formed around the radical lawyer and Connétable, Jean Dumaresq, who opposed the cabal of Jurats who surrounded Lieutenant-Bailiff Charles Lemprière (whose supporters became known as the Charlot party). The Jeannots rapidly adopted the nickname of Magots (cheese mites) after their opponents boasted of aiming to crush them like mites.\n\n19th century \n\nThe Charlots and Magots contested power at elections until in 1819 the progressive Magots adopted the rose as their emblem, while the conservative Charlots wore laurel leaves. The symbolism soon became entrenched to the extent that gardens displayed their owners' allegiances, and pink or green paintwork also showed political sympathies. Still today in Jersey, the presence of established laurels or rose gardens in old houses gives a clue to the past party adherence of former owners, and the chair of the Constable of Saint Helier in the Assembly Room of the Parish Hall still sports the carved roses of a former incumbent.\n\nIn order to help control voting in Jersey, it was not unknown for citizens to find themselves taken and stranded on the Écréhous until after voting had taken place. By the time of the introduction of the secret ballot in 1891, party politics had waned.\n\nBlues and Reds contested local elections into the 1920s, but Islandwide party politics lay dormant until the post-Occupation elections under the new Constitution of 1948.\n\nAfter the Occupation \n\nThe first election under the new constitution saw a struggle for dominance between the Jersey Democratic Movement and the Jersey Progressive Party, led by Cyril Le Marquand. Having achieved the political reforms it advocated the Progressive Party soon folded as an organisation, while the Democratic Movement, incorporating the tiny Communist Party of Jersey,;  continued in existence as a campaigning social movement until the late 20th century.\n\nThe 1980s \n\nThe Jersey Green Party succeeded in having candidates elected in the 1980s.  There were difficulties in maintaining a successful party structure in a consensus government system.  Former Senator Stuart Syvret was often reported to be a Green and represents the Jersey Greens in the Green Islands Network.\n\nAfter the 2005 constitutional reforms \n\nThe prospect of ministerial government and the creation of an executive and opposition, led to the formation of two political parties – the Jersey Democratic Alliance and the Centre Party – in preparation for the 2005 elections. A group called \"Elect Jersey 2005\" worked to assist some independent candidates prepare for the elections.; ;  None of the party-affiliated candidates was successful in the October senatorial elections; three JDA members standing as independents were elected as deputies in November 2005 along with two members of the Centre Party who had similarly stood as independents.  The Centre Party was wound up in 2007.\n\nIn 2008, legislation was passed to require registration of political parties who wished to endorse candidates for election as a senator, deputy or Connétable.\n\nIn the 2008 elections for senators, the JDA fielded two candidates, two candidates stood as members of the campaign group  \"Jersey 2020\" (focusing on environmental issues) and two for \"Time4Change/Reform\": none was successful. In the subsequent deputies' elections, four JDA candidates were successful,;  but three of them subsequently left the party and continued to sit as independents. In August 2011, the JDA announced that party members would stand only as independents in the October 2011 elections. and  A branch of the 'Liberal Democrats Abroad' was formed in the island in November 2011.; \n\nOn 4 July 2014, Reform Jersey became Jersey's only political party when it was registered in the Royal Court.http://tomgruchy.blogspot.co.uk/2014/07/reform-jersey-first-political-party.html The party contested the 2014 general election where 3 of their 8 candidates were elected.http://www.vote.je\n\nLocal government\n\nJersey is divided into twelve administrative districts known as parishes. All have access to the sea and are named after the saints to whom their ancient parish churches are dedicated.\n\nThe parishes of Jersey are further divided into vingtaines (or, in St. Ouen, cueillettes), divisions which are historic and nowadays mostly used for purposes of electoral constituency in municipal elections. These elections are held to elect the members of the Parish municipality. Each parish as an Honorary Police force of elected, unpaid civilians who exercise police and prosecution powers.\n\nJersey Politicians \n\nElections in Jersey\n\nElections for Senators and Deputies occur at fixed four-yearly intervals, historically in October.States of Jersey Law 2005, Part 2 http://www.jerseylaw.je/Law/display.aspx?url=lawsinforce/htm/LawFiles/2005/l-08-2005.htm#_Toc88473875 as amended by the States of Jersey (Miscellaneous Provisions) Law 2011 From 2018, elections will be held in May every fourth year.\n\nAt a local level, the Connétables (or 'constables') are elected for four years. Other posts in parish municipalities vary in length from one to three years and elections take place at a Parish Assembly on a majority basis. It has been some time since parties contested elections at this level, other than for the position of Connétable who uniquely has a role in both the national assembly and in local government.\n\nPolitical pressure groups\n\nJersey, as a polity predominated by independents has always had a number of pressure groups. Many ad-hoc lobby groups form in response to a single issue and then dissolve once the concerns have been dealt with. However, there are a number of pressure groups actively working to influence government decisions on a number of issues. For example, in 2012 the National Trust engaged in pressure campaign against development of the Plemont headland. The Trust was supported by the majority of the islands senior politicians, including the Chief Minister, but a proposition made in the States of Jersey for the States to compulsorily purchase the headland and sell it to the Trust was defeated in a vote on 13/12/12. The outcome of the vote was 24 in favour of acquisition, 25 against, with one absent and one declaring an interest.\n\nInterest Groups\n\nThe following groups are funded by their members.\n\n*Royal Jersey Agricultural and Horticultural Society[http://www.royaljersey.co.uk/whats-on.htm/  Royal Jersey Agricultural and Horticultural Society]\n*Institute of Directors, Jersey branch\n*Jersey Chamber of Commerce[http://www.jerseychamber.com/  Jersey Chamber]\n*Progress Jersey[http://www.progressjersey.com/politics Progress Jersey]\n*Jersey Youth Reform Team\n*Jersey Rights Association\n*Same Difference\n*Save Jersey's Heritage[http://www.savejerseysheritage.org/  Save Jersey's Heritage]\n*Société Jersiaise\n*Alliance Française, Jersey branch\n*Attac, Jersey Branch[http://www.jersey.attac.org/]\n*National Trust for Jersey\n\nQuangos\n\nThe following groups are, at least, partially funded by government. Appointments are made by the States of Jersey\n\n*Jersey Finance\n*Community Relations Trust\n*Jersey Overseas Aid\n*Jersey Consumer Council\n*Jersey Legal Information Board\n* Jersey Development Company (formerly Jersey Waterfront Enterprise Board)[http://www.jerseydevelopment.je/ Jersey Development Company website]",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Politics of Jersey" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=15697" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Politics of the Bailiwick of Jersey takes place in a framework of a parliamentary representative democratic constitution.\n\nAs one of the Crown Dependencies, Jersey is autonomous and self-governing, with its own independent legal, administrative and fiscal systems.\n\nThe legislature is the Assembly of the States of Jersey.\n\nExecutive powers are mainly exercised by a Chief Minister and nine ministers, known collectively as the Council of Ministers. Other executive powers are exercised by the Connétable and Parish Assembly in each of the twelve parishes.\n\nThe Crown\n\nElizabeth II's traditional title as Head of State is Duke of Normandy. \"The Crown\" is defined by the Law Officers of the Crown as the \"Crown in right of Jersey\".http://www5.gov.je/SiteCollectionDocuments/Government%20and%20administration/R%20Attorney%20General%20Transcript%2020100702%20WM.pdf The Queen's representative and adviser in the island is the Lieutenant Governor of Jersey. He is a point of contact between Jersey ministers and the United Kingdom government and carries out executive functions in relation to immigration control, deportation, naturalisation and the issue of passports. Since 2011, the incumbent Lieutenant Governor has been Sir John McColl.\n\nThe Crown (not the government or parliament of Jersey) appoints the Lieutenant Governor, the Bailiff, Deputy Bailiff, Attorney General and Solicitor General. In practice, the process of appointment involves a panel in Jersey which select a preferred candidate whose name is communicated to the UK Ministry of Justice for approval before a formal recommendation is made to the Queen.\n\nConstitution\n\nJersey has an unwritten constitution arising from the Treaty of Paris (1259). When Henry III and the King of France came to terms over the Duchy of Normandy, all lands except the Channel Islands recognised the suzerainty of the King of France. The Channel Islands however were never absorbed into the Kingdom of England by any Act of Union and exist as \"peculiars of the Crown\".\n\nCampaigns for constitutional reform during the 19th century successfully called for: the replacement of lay Jurats with professional judges in the Royal Court to decide questions of law; the establishment of a Police Court (later known as the Magistrate's Court); the creation of a Petty Debts Court; a professional, salaried police force for St Helier in addition to the Honorary Police; and the reform of \"archaic procedure of the Royal Court for criminal trials\". In 1845, the elected office of deputy was created though this did little to redress the disparity of representation between the rural and urban parishes: in 1854 St Helier contained over half of the island's population, yet was able to elect only three out of the 14 deputies.\n\nTwo significant constitutional reforms took place during the 20th century. In 1946, the States of Jersey drew up plans for change following the German Occupation, which were examined by a Committee of the Privy Council. No change was made to the functions of the Bailiff. The twelve Jurats were removed from the assembly of the States of Jersey and replaced by twelve senators elected on an island-wide basis who would have no judicial functions. The twelve Rectors also lost their place in the States assembly. No reforms were made to the role of the Deputies in the assembly. The second major reforms took place in December 2005, when the States of Jersey Law 2005 came into force. This created a system of ministerial government to replace the previous committee-based administration.Report of the Review Panel on the Machinery of Government in Jersey (December 2000) http://www.gov.je/SiteCollectionDocuments/Government%20and%20administration/ID%20ClothierReport%20100331%20CC.pdf\n\nLegislation relating to the organisation of government includes:\n* States of Jersey Law 2005\n* Administrative Decisions (Review)(Jersey) Law 1982\n* Loi (1804) au sujet des assemblées paroissiales\n* Loi (1905) au sujet des assemblées paroissiales\n* Bailiff of Jersey (Vacancy in Office) Law 1959\n* European Communities (Jersey) Law 1973\n* Loi (1853) au sujet des centeniers et officiers de police\n* Centeniers (Terms of Office) (Jersey) Law 2007\n* Human Rights (Jersey) Law 2000\n* Judicial and Legislative Functions (Separation) (Jersey) Law 1951\n* Parish of St. Helier (Qualifications for Office) (Jersey) Law 1976\n* Police Force (Jersey) Law 1974\n* Prison (Jersey) Law 1957\n* Public Elections (Jersey) Law 2002\n* Public Finances (Jersey) Law 2005\n* Regulation of Investigatory Powers (Jersey) Law 2005\n* Royal Court (Jersey) Law 1948\n* Règlements Provisoires\n\nConstitutional reforms continue to be debated in the island.\n\nIn 2009, the States assembly rejected proposals by the Privileges and Procedures Committee to simplify the electoral system by keeping the 12 Connétables and introducing 37 deputies elected to six \"super-constituencies\". In 2010, the States assembly agreed to holding elections for all seats on a single date and to cut the number of Senators from 12 to 8.\n\nIn December 2010, a committee chaired by Lord Carswell recommended changes to the role of the Bailiff—in particular that the Bailiff should cease to the presiding officer over the States assembly.Andy Sibcy, 'Review says Bailiff should quit States', Jersey Evening Post, 6 December 2010 http://www.thisisjersey.com/2010/12/06/review-says-bailiff-should-quit-states/\n\nFollowing widespread criticisms of the system of ministerial government introduced in December 2005, the States assembly agreed in March 2011 to establish an independent electoral commission to review the make-up of the assembly and government.Minutes of the States of Jersey, 15 March 2011 http://www.statesassembly.gov.je; and see also \n\nIn April 2011, Deputy Le Claire lodged au Greffe a request for the Chief Minister to produce, for debate, a draft written \"Constitution for Jersey\";  the States assembly did not support this idea.\n\nRelations with the United Kingdom \n\nWithin the United Kingdom government, responsibility for relations between Jersey (and the other Crown dependencies) and the United Kingdom lie in the Crown Dependencies Branch within the International Directorate of the Ministry of Justice, which has a core team of three officials, with four others and four lawyers available when required.\n\nIn 2010, the House of Commons Justice Committee, conducting an inquiry into the Crown dependencies, found that the Jersey government and those of the other islands were \"with some important caveats, content with their relationship with the Ministry of Justice\". Tensions have, however, arisen from time to time. In the 1980s, there were discussions about a financial contribution from Jersey towards the United Kingdom's costs in relation to defence and international representation.See below. In March 2009, the House of Lords Constitution Committee criticised UK government proposals in the Borders, Citizenship and Immigration Bill dealing with the Common Travel Area, concluding that \"the policy-making process ... has not been informed by any real appreciation of the constitutional status of the Crown dependencies or the rights of free movement of Islanders\". In 2009, the UK cancelled the reciprocal health agreement with Jersey, though a new one came into effect in April 2011.HL Deb, 25 January 2010, c1195 https://publications.parliament.uk/pa/ld200910/ldhansrd/text/100125-0002.htm#1001252000061; HC Deb, 1 April 2011, c43WS https://publications.parliament.uk/pa/cm201011/cmhansrd/cm110401/wmstext/110401m0001.htm#11040177000049 From 2005 to 2011, there were protracted dealings between Jersey and the United Kingdom over Jersey's \"zero-ten\" tax regime and whether it would be acceptable to the European Union.Andy Sibcy, 'Zero-ten: \"UK, not Europe, the problem\"', Jersey Evening Post, 14 December 2010 http://www.thisisjersey.com/2010/12/14/zero-ten-uk-not-europe-the-problem/; Richard Murphy, 'Zero-ten: It is Europe we have to worry about', Jersey Evening Post, 16 December 2010 http://www.thisisjersey.com/2010/12/16/zero-ten-it-is-europe-we-have-to-worry-about/ ;Pierre Horsfall, 'Jersey Tax and the EU', Jersey Evening Post, 23 December 2010 http://www.thisisjersey.com/2010/12/23/jersey-tax-and-the-eu/ ; 'Zero-ten will get UK approval, hints MP', Jersey Evening Post, 4 June 2011 http://www.thisisjersey.com/2011/06/04/zero-ten-will-get-uk-approval-hints-mp/; 'Zero-ten tax clears another hurdle, Jersey Evening Post, 8 July 2011 http://www.thisisjersey.com/2011/07/08/zero-ten-tax-clears-another-hurdle/\n\nAlthough Jersey is for most day-to-day purposes entirely self-governing in relation to its internal affairs, the Crown retains residual responsibility for the \"good government\" of the island. The UK government has consistently adopted a \"non-interventionist policy\", and following the \"high degree of consensus amongst academics, legal advisers, politicians and officials\" would only intervene \"in the event of a fundamental breakdown in public order or the rule of law, endemic corruption in the government or other extreme circumstances\".\n\nInternational relations \n\nThe 1973 Kilbrandon Report stated that \"In international law the United Kingdom Government is responsible for the Islands' international relations\" and \"also responsible for the defence of the Islands\". The United Kingdom is responsible for Jersey's international relations as an aspect of the island's status as a Crown dependency. It is now normal practice for the UK to consult the Jersey government and seek their consent before entering into treaty obligations affecting the island.\n\nSince 2000, Jersey's \"external personality\" has developed, recognised in the preamble to the States of Jersey Law 2005 which refers to \"an increasing need for Jersey to participate in matters of international affairs\".http://www.jerseylaw.je/Law/display.aspx?url=lawsinforce/htm/LawFiles/2005/l-08-2005.htm#_Toc88473872 In 2007, the Chief Minister of Jersey and the UK government agreed an \"International Identity Framework\", setting out the modern relationship between the United Kingdom and Jersey. The United Kingdom now issues \"Letters of Entrustment\" to the Jersey government, which delegate power to Jersey to negotiate international agreements on its own behalf and sign treaties in Jersey's own name rather than through the United Kingdom. This development was \"strongly supported\" by the House of Commons Justice Committee in its March 2010 report on the Crown Dependencies. In January 2011 Senator Freddie Cohen was appointed as Assistant Chief Minister with responsibility for UK and International Relations (in effect, Jersey's first Foreign Minister). \n \nJersey is neither a Member State nor an Associate Member of European Union. It does, however, have a relationship with the EU governed by Protocol 3 to the UK’s Treaty of Accession in 1972.Treaty on the Functioning of the European Union, Article 355(5)(c) states \"the Treaties shall apply to the Channel Islands and the Isle of Man only to the extent necessary to ensure the implementation of the arrangements for those islands set out in the Treaty concerning the accession of new Member States to the European Economic Community and to the European Atomic Energy Community signed on 22 January 1972\".\n\nIn relation to the Council of Europe, Jersey – as a territory the United Kingdom is responsible for in international law– has been bound by the European Convention on Human Rights since the UK acceded to the treaty in 1951. The Human Rights (Jersey) Law 2000 makes Convention rights part of Jersey law and is based closely on the United Kingdom's Human Rights Act 1998.\n\nDuring the 1980s, the question of Jersey making an annual contribution towards the United Kingdom's costs of defence and international representation undertaken on behalf of Jersey was raised. In 1987, the States of Jersey made an interim payment of £8 million while the matter was discussed.Minutes of the States of Jersey, 17 March 1987. The outcome of debates within the island was that the contribution should take the form of maintaining a Territorial Army unit in Jersey. The Jersey Field Squadron (Militia), attached to the Royal Monmouthshire Royal Engineers (Militia), deploys individuals on operations in support of British Forces.\n\nSeparation debate \n\nThe question of Jersey's independence has been discussed from time to time in the Assembly of the States of Jersey. In 1999, a member of the government said that 'Independence is an option open to the Island if the circumstances should justify this' but the government 'does not believe independence is appropriate in the present circumstances and does not see the circumstances arising in the foreseeable future when it would be appropriate'.Answer by Senate Pierre Horsfall to question by Deputy Paul Le Claire, Minutes of the States Assembly, 8 June 1999 http://www.statesassembly.gov.je/display_result.asp?url=\\documents\\minutes\\35925-37231.htm In 2000, Senator Paul Le Claire called for a referendum on independence, a proposal which failed to win any significant support.; ;  The Policy and Resources Committee of the States of Jersey established the Constitutional Review Group in July 2005, chaired by Sir Philip Bailhache, with terms of reference 'to conduct a review and evaluation of the potential advantages and disadvantages for Jersey in seeking independence from the United Kingdom or other incremental change in the constitutional relationship, while retaining the Queen as Head of State'. The Group's Second Interim Report was presented to the States by the Council of Ministers in June 2008. The report concluded that 'Jersey is equipped to face the challenges of independence' but 'whether those steps should be taken is not within the remit of this paper'.\n\nProposals for Jersey independence have subsequently been discussed at an international conference held in Jersey, organised by the Jersey and Guernsey Law Review.Editorial, 'Legal ideas of political importance', Jersey Evening Post, 21 September 2010 http://www.thisisjersey.com/2010/09/21/legal-ideas-of-political-importance/; Andy Sibcy, 'Sovereignty or dependency on agenda at conference', Jersey Evening Post, 17 September 2010 http://www.thisisjersey.com/2010/09/17/sovereignty-or-dependency-on-agenda-at-conference/;  The former Bailiff, Sir Philip Bailhache has called for changes to the Channel Islands' relationship with the United Kingdom government, arguing that 'at the very least, we should be ready for independence if we are placed in a position where that course was the only sensible option'.P Bailhache, 'One or two steps from sovereignty'  [2009] Jersey and Guernsey Law Review http://www.jerseylaw.je/Publications/jerseylawreview/oct09/JLR0910_Bailhache.aspx\n\nIn October 2012 the Council of Ministers issued a \"Common policy for external relations\" that set out a number of principles for the conduct of external relations in accordance with existing undertakings and agreements. This document noted that Jersey \"is a self-governing, democratic country with the power of self-determination\" and \"that it is not Government policy to seek independence from the United Kingdom, but rather to ensure that Jersey is prepared if it were in the best interests of Islanders to do so\". On the basis of the established principles the Council of Ministers decided to \"ensure that Jersey is prepared for external change that may affect the Island’s formal relationship with the United Kingdom and/or European Union\".\n\nNational Assembly - the States of Jersey\n\n The parliamentary body responsible for adopting legislation and scrutinising the Council of Ministers is the Assembly of the States of Jersey. Forty-Nine elected members (8 Senators, 29 Deputies and 12 Connétables) sit in the unicameral assembly. There are also five non-elected, non-voting members appointed by the Crown (the Bailiff, the Lieutenant Governor, the Dean of Jersey, the Attorney General and the Solicitor General).States of Jersey Law 2005, Article 2 http://www.jerseylaw.je/Law/display.aspx?url=lawsinforce/htm/LawFiles/2005/l-08-2005.htm#_Toc88473877\n\nDecisions in the States are taken by majority vote of the elected members present and voting. The States of Jersey Law 2005 removed the Bailiff's a casting vote and the Lieutenant Governor's power of veto. Although formally organised party politics plays no role in the States of Jersey assembly, members often vote together in two main blocs – a minority of members, holding broadly progressive views and critical of the Council of Ministers versus a majority of members, of conservative ideology, who support the Council of Ministers.\n\nScrutiny panels of backbench members of the assembly have been established to examine (i) economic affairs, (ii) environment, (iii) corporate services, (iv) education and home affairs and (v) health, social security and housing. The real utility of the panels is said to be \"that of independent critique which holds ministers to account and constructively engages with policy which is deficient\".\n\nAccording to constitutional convention United Kingdom legislation may be extended to Jersey by Order in Council at the request of the Island's government. Whether an Act of the United Kingdom Parliament may expressly apply to the Island as regards matters of self-government, or whether this historic power is now in abeyance, is a matter of legal debate. The States of Jersey Law 2005 established that no United Kingdom Act or Order in Council may apply to the Bailiwick without being referred to the States of Jersey.States of Jersey Law 2005, Article 30 http://www.jerseylaw.je/Law/display.aspx?url=lawsinforce/htm/LawFiles/2005/l-08-2005.htm#_Toc88473910\n\nNational government – the Council of Ministers \n\nHistorically, Jersey had a \"committee-based system of administration embracing all public service functions and guaranteeing extensive involvement in policy-making for most members\" of the Assembly of the States of Jersey.\nThe report of a review committee chaired by Sir Cecil Clothier criticised this system of government, finding it incapable of developing high-level strategy, efficient policy-coordination or effective political leadership.Report of the Review Panel on the Machinery of Government in Jersey (December 2000) The [http://www.jerseylaw.je/Law/display.aspx?url=lawsinforce/htm/LawFiles/2005/l-08-2005.htm States of Jersey Law 2005] introduced a ministerial system of government. Executive powers are now exercised by a Chief Minister and nine ministers, known collectively as the Council of Ministers responsible to the States Assembly.\n\nThe Chief Minister is elected from amongst the elected members of the States. Ministers are then proposed both by the Chief Minister and any other elected member, the final decision being made by the States assembly.\n\nThere is no convention of Cabinet collective responsibility among members of the Council of Ministers. The Council of Ministers reaches decisions by consensus and individual ministers retain the freedom to dissent from Council decisions in public and even present their own policy to the assembly of the States in their capacity as a member of the assembly without having to resign as a minister. Ministers are, however, bound by a Code of Conduct for Ministers approved in 2006.http://www.statesassembly.gov.je/documents/reports/37251-16065-1022006.htm However, this may change as recently the Jersey Evening Post reported \"MINISTERS will be bound by collective responsibility and the Chief Minister will have the power to fire his ministerial colleagues after a package of changes to the way Jersey’s government is run were approved.\" http://jerseyeveningpost.com/news/2014/05/21/members-no-longer-allowed-to-openly-disagree/\n\nThe overall direction of government as agreed by the Council of Ministers is published periodically as a \"strategic plan\", the current one being the States of Jersey Strategic Plan 2009-2014. These plans are debated and approved by the assembly of the States of Jersey and translated into action by a series of business plans for each department.\n\nSeveral departments, each headed by a minister, are responsible for developing policy within the framework of the strategic plan and for implementing services. They include: the Chief Minister's Department; Economic Development; Education, Sport and Culture; Health and Social Services; Home Affairs; Housing; Environment; Social Security; Transport and Technical Services; and Treasury and Resources.\n\nPolitical parties\n\nIn 2000, the Clothier report noted that \"over the centuries Jersey has had many parties, by which one means only a coming together of like minds to achieve a particular objective. Once achieved, the binding purpose has disappeared and the group pursuing it has dissolved. Such a grouping is not a true political party because it lacks the cement of a common philosophy of government, having only a narrow objective to hold it together until the objective is either attained or lost\". Various parties have been formed over the years in Jersey, but since the 1950s the majority of candidates have stood for election unaffiliated to any political party.\n\n18th century \n\nHistorically, two parties dominated Jersey politics. Originating in the 1770s, the Jeannot party formed around the radical lawyer and Connétable, Jean Dumaresq, who opposed the cabal of Jurats who surrounded Lieutenant-Bailiff Charles Lemprière (whose supporters became known as the Charlot party). The Jeannots rapidly adopted the nickname of Magots (cheese mites) after their opponents boasted of aiming to crush them like mites.\n\n19th century \n\nThe Charlots and Magots contested power at elections until in 1819 the progressive Magots adopted the rose as their emblem, while the conservative Charlots wore laurel leaves. The symbolism soon became entrenched to the extent that gardens displayed their owners' allegiances, and pink or green paintwork also showed political sympathies. Still today in Jersey, the presence of established laurels or rose gardens in old houses gives a clue to the past party adherence of former owners, and the chair of the Constable of Saint Helier in the Assembly Room of the Parish Hall still sports the carved roses of a former incumbent.\n\nIn order to help control voting in Jersey, it was not unknown for citizens to find themselves taken and stranded on the Écréhous until after voting had taken place. By the time of the introduction of the secret ballot in 1891, party politics had waned.\n\nBlues and Reds contested local elections into the 1920s, but Islandwide party politics lay dormant until the post-Occupation elections under the new Constitution of 1948.\n\nAfter the Occupation \n\nThe first election under the new constitution saw a struggle for dominance between the Jersey Democratic Movement and the Jersey Progressive Party, led by Cyril Le Marquand. Having achieved the political reforms it advocated the Progressive Party soon folded as an organisation, while the Democratic Movement, incorporating the tiny Communist Party of Jersey,;  continued in existence as a campaigning social movement until the late 20th century.\n\nThe 1980s \n\nThe Jersey Green Party succeeded in having candidates elected in the 1980s.  There were difficulties in maintaining a successful party structure in a consensus government system.  Former Senator Stuart Syvret was often reported to be a Green and represents the Jersey Greens in the Green Islands Network.\n\nAfter the 2005 constitutional reforms \n\nThe prospect of ministerial government and the creation of an executive and opposition, led to the formation of two political parties – the Jersey Democratic Alliance and the Centre Party – in preparation for the 2005 elections. A group called \"Elect Jersey 2005\" worked to assist some independent candidates prepare for the elections.; ;  None of the party-affiliated candidates was successful in the October senatorial elections; three JDA members standing as independents were elected as deputies in November 2005 along with two members of the Centre Party who had similarly stood as independents.  The Centre Party was wound up in 2007.\n\nIn 2008, legislation was passed to require registration of political parties who wished to endorse candidates for election as a senator, deputy or Connétable.\n\nIn the 2008 elections for senators, the JDA fielded two candidates, two candidates stood as members of the campaign group  \"Jersey 2020\" (focusing on environmental issues) and two for \"Time4Change/Reform\": none was successful. In the subsequent deputies' elections, four JDA candidates were successful,;  but three of them subsequently left the party and continued to sit as independents. In August 2011, the JDA announced that party members would stand only as independents in the October 2011 elections. and  A branch of the 'Liberal Democrats Abroad' was formed in the island in November 2011.; \n\nOn 4 July 2014, Reform Jersey became Jersey's only political party when it was registered in the Royal Court.http://tomgruchy.blogspot.co.uk/2014/07/reform-jersey-first-political-party.html The party contested the 2014 general election where 3 of their 8 candidates were elected.http://www.vote.je\n\nLocal government\n\nJersey is divided into twelve administrative districts known as parishes. All have access to the sea and are named after the saints to whom their ancient parish churches are dedicated.\n\nThe parishes of Jersey are further divided into vingtaines (or, in St. Ouen, cueillettes), divisions which are historic and nowadays mostly used for purposes of electoral constituency in municipal elections. These elections are held to elect the members of the Parish municipality. Each parish as an Honorary Police force of elected, unpaid civilians who exercise police and prosecution powers.\n\nJersey Politicians \n\nElections in Jersey\n\nElections for Senators and Deputies occur at fixed four-yearly intervals, historically in October.States of Jersey Law 2005, Part 2 http://www.jerseylaw.je/Law/display.aspx?url=lawsinforce/htm/LawFiles/2005/l-08-2005.htm#_Toc88473875 as amended by the States of Jersey (Miscellaneous Provisions) Law 2011 From 2018, elections will be held in May every fourth year.\n\nAt a local level, the Connétables (or 'constables') are elected for four years. Other posts in parish municipalities vary in length from one to three years and elections take place at a Parish Assembly on a majority basis. It has been some time since parties contested elections at this level, other than for the position of Connétable who uniquely has a role in both the national assembly and in local government.\n\nPolitical pressure groups\n\nJersey, as a polity predominated by independents has always had a number of pressure groups. Many ad-hoc lobby groups form in response to a single issue and then dissolve once the concerns have been dealt with. However, there are a number of pressure groups actively working to influence government decisions on a number of issues. For example, in 2012 the National Trust engaged in pressure campaign against development of the Plemont headland. The Trust was supported by the majority of the islands senior politicians, including the Chief Minister, but a proposition made in the States of Jersey for the States to compulsorily purchase the headland and sell it to the Trust was defeated in a vote on 13/12/12. The outcome of the vote was 24 in favour of acquisition, 25 against, with one absent and one declaring an interest.\n\nInterest Groups\n\nThe following groups are funded by their members.\n\n*Royal Jersey Agricultural and Horticultural Society[http://www.royaljersey.co.uk/whats-on.htm/  Royal Jersey Agricultural and Horticultural Society]\n*Institute of Directors, Jersey branch\n*Jersey Chamber of Commerce[http://www.jerseychamber.com/  Jersey Chamber]\n*Progress Jersey[http://www.progressjersey.com/politics Progress Jersey]\n*Jersey Youth Reform Team\n*Jersey Rights Association\n*Same Difference\n*Save Jersey's Heritage[http://www.savejerseysheritage.org/  Save Jersey's Heritage]\n*Société Jersiaise\n*Alliance Française, Jersey branch\n*Attac, Jersey Branch[http://www.jersey.attac.org/]\n*National Trust for Jersey\n\nQuangos\n\nThe following groups are, at least, partially funded by government. Appointments are made by the States of Jersey\n\n*Jersey Finance\n*Community Relations Trust\n*Jersey Overseas Aid\n*Jersey Consumer Council\n*Jersey Legal Information Board\n* Jersey Development Company (formerly Jersey Waterfront Enterprise Board)[http://www.jerseydevelopment.je/ Jersey Development Company website]. Politics of Jersey. http://en.wikipedia.org/?curid=15697."
  }
}
