{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=9380",
  "eid" : "eeb70160-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778480246,
  "textBody" : "Politics of Eritrea takes place in a framework of a single-party presidential republican totalitarian dictatorship, whereby the Eritrean President is both head of state and head of government and a single-party state, led by the People's Front for Democracy and Justice. The popularly elected National Assembly of 150 seats, formed in 1993 shortly after independence, elected the current president, Isaias Afewerki. There have been no general elections since its official rise to power in 1993. They are governed under the constitution of 1993. A new constitution was ratified in 1997, but has not been implemented.\n\nFollowing a successful referendum on independence for the Autonomous Region of Eritrea between 23 and 25 April 1993, on 19 May of that year the Provisional Government of Eritrea (PGE) issued a Proclamation regarding the reorganization of the Government. It declared that during a four-year transition period, and sooner if possible, it would draft and ratify a constitution, prepare a law on political parties, prepare a press law, and carry out elections for a constitutional government. In March 1994, the PGE created a constitutional commission charged with drafting a constitution flexible enough to meet the current needs of a population suffering from 30 years of civil war as well as those of the future, when stability and prosperity change the political landscape.\n\nCommission members have traveled throughout the country and to Eritrean communities abroad holding meetings to explain constitutional options to the people and to solicit their input. A new constitution was promulgated in 1997 but has not yet been implemented, and general elections have been postponed. A National Assembly, composed entirely of the PFDJ, was established as a transitional legislature; elections have been postponed indefinitely following the start of the border conflict with Ethiopia.\n\nIndependent local sources of political information on Eritrean domestic politics are scarce; in September 2001 the government closed down all of the nation's privately owned print media, and outspoken critics of the government have been arrested and held without trial, according to domestic and international observers, including Human Rights Watch and Amnesty International.  In 2004 the U.S. State Department declared Eritrea a Country of Particular Concern (CPC) for its alleged record of religious persecution.\n\nAt independence, the government faced formidable challenges. Beginning with a nascent judicial system, and an education system in shambles, it has attempted to build the institutions of government from scratch, with varying success.  Since then, the impact of the border war with Ethiopia, and continued army mobilisation, has contributed to the lack of a skilled workforce.  The present government includes legislative, executive, and judicial bodies.\n\nExecutive branch\n\n|President\n|Isaias Afewerki\n|PFDJ\n|24 May 1993\n|}\nThe President nominates individuals to head the various ministries, authorities, commissions, and offices, and the National Assembly ratifies those nominations. The cabinet is the country's executive branch. It is composed of 18 ministries and chaired by the president. It implements policies, regulations, and laws and is, in theory, accountable to the National Assembly.\n\nThe Ministries are:\n\n* Agriculture\n* Defence\n* Education\n* Energy & Mines\n* Finance\n* Fisheries & Maritime Resources\n\n* Foreign Affairs\n* Health\n* Information\n* Justice\n* Labour & Human Welfare\n* Land, Water, & Environment\n\n* Local Government\n* National Development\n* Public Works\n* Tourism\n* Trade & Industry\n* Transport & Communications\n\nLegislative branch\n\nThe legislature, the National Assembly appointed in 1993, includes 75 members of the People's Front for Democracy and Justice (PFDJ) and 75 additional 'popularly elected' members. The National Assembly is the highest legal power in the government until the establishment of a democratic, constitutional government. Within the Eritrean Constitution the Legislature would remain the strongest arm of the government. The legislature sets the internal and external policies of the government, regulates implementation of those policies, approves the budget, and elects the president of the country.  Its membership has not been renewed through national elections.\n\nLower Regional Assemblies are also in each of Eritrea's six zones. These Assemblies are responsible setting a local agenda in the case that they are not overruled by the National Assembly. These Regional Assemblies are popularly elected within each region. Unlike the National Assembly however, the Regional administrator is not selected by the Regional Assembly.\n\nPolitical parties and elections\n\nEritrea is a single-party state, run by the People's Front for Democracy and Justice (PFDJ).  No other political groups are allowed to organize, although the non-implemented Constitution of 1997 provided for the existence of multi-party politics.\n\nEritrean National elections were set for 1997 and then postponed until 2001, it was then decided that because 20% of Eritrea's land was under occupation that elections would be postponed until the resolution of the conflict with Ethiopia. Local elections have continued in Eritrea. The most recent round of local government elections were held in May 2003. On further elections, the President's Chief of Staff, Yemane Ghebremeskel said, \n\nEritrean opposition groups in exile\n\n*Eritrean Islamic Jihad (EIJ) ?\n*Eritrean Liberation Front (ELF), Abdullah Muhammed\n*Eritrean Liberation Front-Revolutionary Council (ELF-RC), Ahmed Nasser (died 26 March 2014)http://www.worldbulletin.net/news/132089/prominent-eritrean-opposition-leader-dies\n*Eritrean Liberation Front-United Organization (ELF-UO), Mohammed Said Nawd\n*Eritrean People's Democratic Front (EPDF), Tewelde Ghebreselassie\n*Eritrean Solidarity Movement for National Salvation (ESMNS) Grassroots Movement led by Tesfu Atsbeha  [http://simret.net/ ESMNS official website ]\n*Democratic Movement for Libaration of Eritrean Kunama (DMLEK) ( Kernelewos)\n\nRegional issues\n\nEritrea has had rough relations with most of its neighbors in the 1990s and initiated both small-scale and large-scale battles against Sudan, Djibouti, Yemen and Ethiopia. Eritrea invaded the Hanish islands of Yemen, Sudan blamed Eritrea for attacks in Eastern Sudan, UN commission accused Eritrea for invading Ethiopia and Djibouti officials accused Eritrea for shelling towns in Djibouti in 1996.[http://www.foreignaffairs.org/sponsored_sections/country_focus/yemen/yemen_report_print.pdf Eritrea invades Yemen's hanish islands][http://news.bbc.co.uk/2/hi/africa/335911.stm Eritrea attacks Sudan][http://www.africa.upenn.edu/Hornet/irin_111299b.html Djibouti blames Eritrea for shelling Djibouti town][http://www.pca-cpa.org/showpage.asp?pag_id=1151 UN accuses Eritrea for Invading Ethiopia]\nAfter this, Eritrea has made efforts to solve relations with Sudan and Djibouti, though relations with Yemen and Ethiopia remain sour. In 2008, an attack on Djibouti led by the Eritrean Army on the tip South end of the country led to several civilians being killed, and further international tensions. Eritrea abandoned the regional bloc IGAD which is membered by the four nations and Kenya.\n\nJudicial branch\n\nThe judiciary operates independently of both the legislative and executive bodies, with a court system that extends from the village through to the regional and national levels. The structure has three tiers, the local \"community courts\", the regional courts and the national High Court.\n\nVillage judges are elected, though typically they are the village elders. A community court consists of three judges/magistrates. \"There are a total of 683 community courts across the country with the number of magistrates totaling to 2,049, i.e. 55 in the Central Region, 213 in the South, 178 in Gash-Barka, 109 in Anseba, 98 in the Northern and 30 in the Southern Red Sea regions.\" The community courts work on the basis of the area, the local rules and customs. If a dispute cannot be resolved in the community courts it can be appealed to the next level of judicial administration, the regional courts.\n\nWith regard to the legal profession, according to a 2015 source, there is not a bar association in Eritrea. The Legal Committee of the Ministry of Justice oversees the admission and requirements to practice law. Although the source goes on to state that there have been female judges, there is no indication as to how demographic groups, such as women, have fared in the legal field. \n\nAdministrative divisions\n\nEritrea is divided into 6 regions (or zobas) and subdivided into approximately 55 districts or sub-zobas. The regions are based on the hydrological properties of area. This has the dual effect of providing each administration with ample control over its agricultural capacity and eliminating historical intra-regional conflicts.\n\nThe regions are included followed by the Sub-region:\n\nForeign relations\n\nExternal issues include an undemarcated border with the Sudan, a brief war with Yemen over the Hanish Islands in 1996, and a recent border conflict with Ethiopia.\n\nThe undemarcated border with Sudan poses a problem for Eritrean external relations. After a high-level delegation to the Sudan from the Eritrean Ministry of Foreign Affairs ties are being normalized. While normalization of ties continues, Eritrea has been recognized as a broker for peace between the separate factions of the Sudanese civil war, with Hassan al-Turabi crediting Eritrea in playing a role in the peace agreement between the Southern Sudanese and the government. Additionally, the Sudanese Government and Eastern Front rebels requested that Eritrea mediate their peace talks in 2006.\n\nA dispute with Yemen over the Hanish Islands in 1996 resulted in a brief war. As part of an agreement to cease hostilities the two nations agreed to refer the issue to the Permanent Court of Arbitration at the Hague. At the conclusion of the proceedings, both nations acquiesced to the decision. Since 1996 both governments have remained wary of one another but relations are relatively normal.\n\nThe undemarcated border with Ethiopia is the primary external issue facing Eritrea. This  led to a long and bloody border war between 1998 and 2000. As a result, the United Nations Mission in Ethiopia and Eritrea (UNMEE) is occupying a 25 km by 900 km area on the border to help stabilize the region. Disagreements following the war have resulted in stalemate punctuated by periods of elevated tension and renewed threats of war. Central to the continuation of the stalemate is Ethiopia's failure to abide by the border delimitation ruling and reneging on its commitment to demarcation. The stalemate has led the President of Eritrea to write his Eleven Letters to the United Nations Security Council, which urges the UN to take action on Ethiopia. Relations between the two countries is further strained by the continued effort of the Eritrean and Ethiopian leaders in supporting each other's opposition.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Politics of Eritrea" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=9380" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Politics of Eritrea takes place in a framework of a single-party presidential republican totalitarian dictatorship, whereby the Eritrean President is both head of state and head of government and a single-party state, led by the People's Front for Democracy and Justice. The popularly elected National Assembly of 150 seats, formed in 1993 shortly after independence, elected the current president, Isaias Afewerki. There have been no general elections since its official rise to power in 1993. They are governed under the constitution of 1993. A new constitution was ratified in 1997, but has not been implemented.\n\nFollowing a successful referendum on independence for the Autonomous Region of Eritrea between 23 and 25 April 1993, on 19 May of that year the Provisional Government of Eritrea (PGE) issued a Proclamation regarding the reorganization of the Government. It declared that during a four-year transition period, and sooner if possible, it would draft and ratify a constitution, prepare a law on political parties, prepare a press law, and carry out elections for a constitutional government. In March 1994, the PGE created a constitutional commission charged with drafting a constitution flexible enough to meet the current needs of a population suffering from 30 years of civil war as well as those of the future, when stability and prosperity change the political landscape.\n\nCommission members have traveled throughout the country and to Eritrean communities abroad holding meetings to explain constitutional options to the people and to solicit their input. A new constitution was promulgated in 1997 but has not yet been implemented, and general elections have been postponed. A National Assembly, composed entirely of the PFDJ, was established as a transitional legislature; elections have been postponed indefinitely following the start of the border conflict with Ethiopia.\n\nIndependent local sources of political information on Eritrean domestic politics are scarce; in September 2001 the government closed down all of the nation's privately owned print media, and outspoken critics of the government have been arrested and held without trial, according to domestic and international observers, including Human Rights Watch and Amnesty International.  In 2004 the U.S. State Department declared Eritrea a Country of Particular Concern (CPC) for its alleged record of religious persecution.\n\nAt independence, the government faced formidable challenges. Beginning with a nascent judicial system, and an education system in shambles, it has attempted to build the institutions of government from scratch, with varying success.  Since then, the impact of the border war with Ethiopia, and continued army mobilisation, has contributed to the lack of a skilled workforce.  The present government includes legislative, executive, and judicial bodies.\n\nExecutive branch\n\n|President\n|Isaias Afewerki\n|PFDJ\n|24 May 1993\n|}\nThe President nominates individuals to head the various ministries, authorities, commissions, and offices, and the National Assembly ratifies those nominations. The cabinet is the country's executive branch. It is composed of 18 ministries and chaired by the president. It implements policies, regulations, and laws and is, in theory, accountable to the National Assembly.\n\nThe Ministries are:\n\n* Agriculture\n* Defence\n* Education\n* Energy & Mines\n* Finance\n* Fisheries & Maritime Resources\n\n* Foreign Affairs\n* Health\n* Information\n* Justice\n* Labour & Human Welfare\n* Land, Water, & Environment\n\n* Local Government\n* National Development\n* Public Works\n* Tourism\n* Trade & Industry\n* Transport & Communications\n\nLegislative branch\n\nThe legislature, the National Assembly appointed in 1993, includes 75 members of the People's Front for Democracy and Justice (PFDJ) and 75 additional 'popularly elected' members. The National Assembly is the highest legal power in the government until the establishment of a democratic, constitutional government. Within the Eritrean Constitution the Legislature would remain the strongest arm of the government. The legislature sets the internal and external policies of the government, regulates implementation of those policies, approves the budget, and elects the president of the country.  Its membership has not been renewed through national elections.\n\nLower Regional Assemblies are also in each of Eritrea's six zones. These Assemblies are responsible setting a local agenda in the case that they are not overruled by the National Assembly. These Regional Assemblies are popularly elected within each region. Unlike the National Assembly however, the Regional administrator is not selected by the Regional Assembly.\n\nPolitical parties and elections\n\nEritrea is a single-party state, run by the People's Front for Democracy and Justice (PFDJ).  No other political groups are allowed to organize, although the non-implemented Constitution of 1997 provided for the existence of multi-party politics.\n\nEritrean National elections were set for 1997 and then postponed until 2001, it was then decided that because 20% of Eritrea's land was under occupation that elections would be postponed until the resolution of the conflict with Ethiopia. Local elections have continued in Eritrea. The most recent round of local government elections were held in May 2003. On further elections, the President's Chief of Staff, Yemane Ghebremeskel said, \n\nEritrean opposition groups in exile\n\n*Eritrean Islamic Jihad (EIJ) ?\n*Eritrean Liberation Front (ELF), Abdullah Muhammed\n*Eritrean Liberation Front-Revolutionary Council (ELF-RC), Ahmed Nasser (died 26 March 2014)http://www.worldbulletin.net/news/132089/prominent-eritrean-opposition-leader-dies\n*Eritrean Liberation Front-United Organization (ELF-UO), Mohammed Said Nawd\n*Eritrean People's Democratic Front (EPDF), Tewelde Ghebreselassie\n*Eritrean Solidarity Movement for National Salvation (ESMNS) Grassroots Movement led by Tesfu Atsbeha  [http://simret.net/ ESMNS official website ]\n*Democratic Movement for Libaration of Eritrean Kunama (DMLEK) ( Kernelewos)\n\nRegional issues\n\nEritrea has had rough relations with most of its neighbors in the 1990s and initiated both small-scale and large-scale battles against Sudan, Djibouti, Yemen and Ethiopia. Eritrea invaded the Hanish islands of Yemen, Sudan blamed Eritrea for attacks in Eastern Sudan, UN commission accused Eritrea for invading Ethiopia and Djibouti officials accused Eritrea for shelling towns in Djibouti in 1996.[http://www.foreignaffairs.org/sponsored_sections/country_focus/yemen/yemen_report_print.pdf Eritrea invades Yemen's hanish islands][http://news.bbc.co.uk/2/hi/africa/335911.stm Eritrea attacks Sudan][http://www.africa.upenn.edu/Hornet/irin_111299b.html Djibouti blames Eritrea for shelling Djibouti town][http://www.pca-cpa.org/showpage.asp?pag_id=1151 UN accuses Eritrea for Invading Ethiopia]\nAfter this, Eritrea has made efforts to solve relations with Sudan and Djibouti, though relations with Yemen and Ethiopia remain sour. In 2008, an attack on Djibouti led by the Eritrean Army on the tip South end of the country led to several civilians being killed, and further international tensions. Eritrea abandoned the regional bloc IGAD which is membered by the four nations and Kenya.\n\nJudicial branch\n\nThe judiciary operates independently of both the legislative and executive bodies, with a court system that extends from the village through to the regional and national levels. The structure has three tiers, the local \"community courts\", the regional courts and the national High Court.\n\nVillage judges are elected, though typically they are the village elders. A community court consists of three judges/magistrates. \"There are a total of 683 community courts across the country with the number of magistrates totaling to 2,049, i.e. 55 in the Central Region, 213 in the South, 178 in Gash-Barka, 109 in Anseba, 98 in the Northern and 30 in the Southern Red Sea regions.\" The community courts work on the basis of the area, the local rules and customs. If a dispute cannot be resolved in the community courts it can be appealed to the next level of judicial administration, the regional courts.\n\nWith regard to the legal profession, according to a 2015 source, there is not a bar association in Eritrea. The Legal Committee of the Ministry of Justice oversees the admission and requirements to practice law. Although the source goes on to state that there have been female judges, there is no indication as to how demographic groups, such as women, have fared in the legal field. \n\nAdministrative divisions\n\nEritrea is divided into 6 regions (or zobas) and subdivided into approximately 55 districts or sub-zobas. The regions are based on the hydrological properties of area. This has the dual effect of providing each administration with ample control over its agricultural capacity and eliminating historical intra-regional conflicts.\n\nThe regions are included followed by the Sub-region:\n\nForeign relations\n\nExternal issues include an undemarcated border with the Sudan, a brief war with Yemen over the Hanish Islands in 1996, and a recent border conflict with Ethiopia.\n\nThe undemarcated border with Sudan poses a problem for Eritrean external relations. After a high-level delegation to the Sudan from the Eritrean Ministry of Foreign Affairs ties are being normalized. While normalization of ties continues, Eritrea has been recognized as a broker for peace between the separate factions of the Sudanese civil war, with Hassan al-Turabi crediting Eritrea in playing a role in the peace agreement between the Southern Sudanese and the government. Additionally, the Sudanese Government and Eastern Front rebels requested that Eritrea mediate their peace talks in 2006.\n\nA dispute with Yemen over the Hanish Islands in 1996 resulted in a brief war. As part of an agreement to cease hostilities the two nations agreed to refer the issue to the Permanent Court of Arbitration at the Hague. At the conclusion of the proceedings, both nations acquiesced to the decision. Since 1996 both governments have remained wary of one another but relations are relatively normal.\n\nThe undemarcated border with Ethiopia is the primary external issue facing Eritrea. This  led to a long and bloody border war between 1998 and 2000. As a result, the United Nations Mission in Ethiopia and Eritrea (UNMEE) is occupying a 25 km by 900 km area on the border to help stabilize the region. Disagreements following the war have resulted in stalemate punctuated by periods of elevated tension and renewed threats of war. Central to the continuation of the stalemate is Ethiopia's failure to abide by the border delimitation ruling and reneging on its commitment to demarcation. The stalemate has led the President of Eritrea to write his Eleven Letters to the United Nations Security Council, which urges the UN to take action on Ethiopia. Relations between the two countries is further strained by the continued effort of the Eritrean and Ethiopian leaders in supporting each other's opposition. Politics of Eritrea. http://en.wikipedia.org/?curid=9380."
  }
}
