{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18201",
  "eid" : "31989660-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778592454,
  "textBody" : "Lake Champlain (French: Lac Champlain) (Abenaki: Pitawbagokhttp://www.toponymie.gouv.qc.ca/ct/pdf/la%20toponymie%20des%20Abenaquis.pdf?ts0.14881141134537756) (Mohawk: Kaniatarakwà:ronte) is a natural freshwater lake in North America mainly within the borders of the United States (in the states of Vermont and New York) but partially situated across the Canada–U.S. border, in the Canadian province of Quebec.\n\nThe New York portion of the Champlain Valley includes the eastern portions of Clinton County and Essex County. Most of this area is part of the Adirondack Park. There are recreational opportunities in the park and along the relatively undeveloped coastline of Lake Champlain. The cities of Plattsburgh, New York and Burlington, Vermont are on the lake's western and eastern shores, respectively, and the village of Ticonderoga, New York is in the region's southern part. The Quebec portion is in the regional county municipalities of Le Haut-Richelieu and Brome-Missisquoi. There are a number of islands in the lake; the largest include Grand Isle, Isle La Motte, and North Hero, all part of Grand Isle County, Vermont.\n\nGeology\n\nThe Champlain Valley is the northernmost unit of a landform system known as the Great Appalachian Valley, which stretches between Quebec, Canada, to the north, and Alabama, US, to the south. The Champlain Valley is a physiographic section of the larger Saint Lawrence Valley, which in turn is part of the larger Appalachian physiographic division.\n\nLake Champlain is one of numerous large lakes scattered in an arc through Labrador, in Canada, the northern United States, and the Northwest Territories of Canada. Although it is smaller than each of the Great Lakes (Ontario, Erie, Huron, Superior, and Michigan), Lake Champlain is a large body of fresh water. Approximately 1269 km2 in area, the lake is 172 km long and 23 km across at its widest point, and has a maximum depth of approximately 400 ft. The lake varies seasonally from about 95 to above mean sea level.\n\nHydrology\n\nLake Champlain is in the Lake Champlain Valley between the Green Mountains of Vermont and the Adirondack Mountains of New York, drained northward by the 106 mi-long Richelieu River into the St. Lawrence River at Sorel-Tracy, Quebec, northeast and downstream of Montreal, Quebec. It also receives the waters from the 32 mi-long Lake George, so its basin collects waters from the northwestern slopes of the Green Mountains and the northernmost eastern peaks of the Adirondack Mountains.\n\nLake Champlain drains nearly half of Vermont, and approximately 250,000 people get their drinking water from the lake.\n\nThe lake is fed in Vermont by the LaPlatte, Lamoille, Missisquoi, Poultney, and Winooski rivers, along with Lewis Creek, Little Otter Creek, and Otter Creek. In New York, it is fed by the Ausable, Boquet, Great Chazy, La Chute, Little Ausable, Little Chazy, Salmon, and Saranac rivers, along with Putnam Creek. In Quebec, it is fed by the Pike River.\n\nIt is connected to the Hudson River by the Champlain Canal.\n\nParts of the lake freeze each winter, and in some winters the entire lake surface freezes, referred to as \"closing\". In July and August, the lake temperature reaches an average of 70 °F.\n\nChazy Reef\n\nThe Chazy Reef is an extensive Ordovician carbonate rock formation that extends from Tennessee to Quebec and Newfoundland. It occurs in prominent outcropping at Goodsell Ridge, Isle La Motte, the northernmost island in Lake Champlain.\n\nThe oldest reefs are around \"The Head\" of the south end of the island; slightly younger reefs are found at the Fisk Quarry, and the youngest (the famous coral reefs) are in fields to the north. Together, these three sites provide a unique narrative of events that took place over 450 million years ago in the ocean in the Southern Hemisphere, long before Lake Champlain's emergence 20,000 years ago.\n\nHistory\n\nThe lake has long acted as a border between indigenous nations much as it is today between the USA and Canada. The lake is located at the frontier between Abenaki and Mohawk (Iroquois Confederacy) traditional territories. The official toponym for the lake according to the orthography established by the Grand Council of Wanab-aki Nation is Pitawbagok (alternative orthographies include Petonbowk and Bitawbagok), meaning 'middle lake', 'lake in between' or 'double lake'.\n\nThe Mohawk name in modern orthography as standardized in 1993 is Kaniatarakwà:ronte, meaning bulging lake. An alternate name is Kaniá:tare tsi kahnhokà:ronte (phonetic English spelling Caniaderi Guarunte ), meaning 'door of the country' or 'lake to the country'. The lake is an important eastern gateway to Iroquois Confederacy lands.\n\nThe lake was named after the French explorer Samuel de Champlain, who encountered it in July 1609. While the ports of Burlington, Vermont, Port Henry, New York, and Plattsburgh, New York today are primarily used by small craft, ferries, and lake cruise ships, they were of substantial commercial and military importance in the 18th and 19th centuries.\n\nColonial America and the Revolutionary War\n\nNew France allocated concessions all along lake Champlain to French settlers and built forts to defend the waterways. In colonial times, Lake Champlain was used as a water (or, in winter, ice) passage between the Saint Lawrence and Hudson valleys. Travelers found it easier to journey by boats and sledges on the lake rather than go overland on unpaved and frequently mud-bound roads. The lake's northern tip at Saint-Jean-sur-Richelieu, Quebec (known as St. John in colonial times under British rule), is a short distance from Montreal, Quebec. The southern tip at Whitehall (Skenesborough in revolutionary times) is a short distance from Saratoga, Glens Falls, and Albany, New York.\n\nForts were built at Ticonderoga and Crown Point (Fort St. Frederic) to control passage on the lake in colonial times. Important battles were fought at Ticonderoga in 1758 and 1775. During the Revolutionary War, the British and Americans conducted a frenetic shipbuilding race through the spring and summer of 1776, at opposite ends of the lake, and fought a significant naval engagement on October 11 at the Battle of Valcour Island. While it was a tactical defeat for the Americans, and the small fleet led by Benedict Arnold was almost destroyed, the Americans gained a strategic victory; the British invasion was delayed long enough so the approach of winter prevented the fall of these forts until the following year. In this period, the Continental Army gained strength and was victorious at Saratoga.\n\nThe beginning of the Revolutionary War \n\nAt the start of the Revolutionary War, British forces occupied the Champlain Valley.  However, it did not take long for rebel leaders to realize the importance of controlling Lake Champlain. Early in the war, the colonial militias attempted to expel the British from Boston; however, this undertaking could not be achieved without heavy artillery.Countryman (2003), p. 103  The British forts at Ticonderoga and Crown Point, on Lake Champlain, were known to have ample supplies of artillery and were weakly manned by the British. Thus, the colonial militias devised a plan to take control of the two forts and bring the guns back to the fight in Boston.\n\nThe necessity of controlling the two forts at Ticonderoga and Crown Point placed Lake Champlain as a strategic arena during the Revolutionary War. By taking control of these forts, Americans not only gained heavy artillery, but control of a vast water highway, as well: Lake Champlain provided a direct invasion route to British Canada. However, had the British controlled the lake, they could have divided the colonies of New England and further depleted the Continental Army.\n\nThe Continental Army's first offensive action took place in May 1775, three weeks after the Battles of Lexington and Concord.  Ethan Allen, accompanied by 200 Green Mountain Boys, was ordered to capture Fort Ticonderoga and retrieve supplies for the fight in Boston. Benedict Arnold shared the command with Allen, and in early May 1775, they captured Fort Ticonderoga, Crown Point, and the southern Loyalist settlement of Skenesborough.  As a result of Allen’s offensive attack on the Champlain Valley in 1775, the American forces controlled the Lake Champlain waterway.\n\nThe Siege of Quebec: 1775–1776 \n\nThe Continental Army realized the strategic advantage of controlling Lake Champlain, as it leads directly to the heart of Quebec. Immediately after taking Forts Ticonderoga and Crown Point, the Americans began planning an attack on British Canada. The American siege of Quebec was a two-pronged assault and occurred throughout the winter of 1775–1776.  Brigadier General Richard Montgomery led the first assault up the Champlain Valley into Canada, while Benedict Arnold led a second army to Quebec via the Maine wilderness.\n\nDespite the strategic advantage of controlling a direct route to Quebec by way of the Champlain Valley, the American siege of British Canada during the winter of 1775 failed. The Continental Army mistakenly assumed they would receive support from the Canadians upon their arrival at Quebec. This was not the case, and the rebel army struggled to take Quebec with diminishing supplies, support, and harsh northern winter weather.\n\nThe Continental Army was forced to camp outside Quebec’s walls for the winter, with reinforcements from New York, Pennsylvania, Massachusetts, New Hampshire, and Connecticut allowing the soldiers to maintain their siege of the city.  The reinforcements traveled hundreds of miles up the frozen Lake Champlain and St. Lawrence River, but were too late and too few to influence a successful siege of Quebec. In May 1776, with the arrival of a British convoy carrying 10,000 British and Hessian troops to Canada, the Continental forces retreated back down the Champlain Valley to reevaluate their strategy.\n\n“I know of no better method than to secure the important posts of Ticonderoga and Crown Point, and by building a number of armed vessels to command the lakes, otherwise the forces now in Canada will be brought down upon us as quick as possible, having nothing to oppose them… They will doubtless try to construct some armed vessels and then endeavor to penetrate the country toward New York.” (Brigadier General John Sullivan to George Washington, June 24, 1776).\n\nBoth British and American forces spent the summer of 1776 building their naval fleets, at opposite ends of Lake Champlain.  By the October 1776, the Continental Army had 16 operating naval vessels on Lake Champlain, a great increase to the four small ships they had at the beginning of the summer.  General Benedict Arnold commanded the American naval fleet on Lake Champlain, which was composed of volunteers and soldiers drafted from the Northern Army. With great contrast to the Continental navy, experienced Royal Navy officers, British seamen, and Hessian artillerymen manned the British fleet on Lake Champlain.  By the end of the summer of 1776, the opposing armies were prepared to battle over the strategic advantage of controlling Lake Champlain.\n\nThe Battle of Valcour Island \n\nOn October 11, 1776, the British and American naval fleets met on the western side of Valcour Island, on Lake Champlain.  American General Benedict Arnold established the location, as it provided the Continental fleet with a natural defensive position. The British and American vessels engaged in combat for much of the day, only stopping due to the impending nightfall.\n\nAfter a long day of combat, the American fleet was in worse shape than the experienced British Navy. Upon ceasefire, Arnold called a council of war with his fellow officers, proposing to escape the British fleet via rowboats under the cover of night. As the British burned Arnold's flagship, the Royal Savage, to the east, the Americans rowed past the British lines.\n\nThe following morning, the British learned of the Americans' escape and set out after the fleeing Continental vessels. On October 13, the British fleet caught up to the struggling American ships near Split Rock Mountain.  With no hope of fighting off the powerful British navy, Arnold ordered his men to run their five vessels aground in Ferris Bay, Panton, Vermont. The depleted Continental army escaped on land back to Fort Ticonderoga and Mount Independence; however, they no longer controlled the Lake Champlain waterway.\n\nThe approaching winter of 1776–1777 restricted British movement along the recently controlled Lake Champlain. As the British abandoned Crown Point and returned to Canada for the winter, the Americans reduced their garrisons in the Champlain Valley from 13,000 to 2,500 soldiers.\n\nGeneral Burgoyne’s Campaign \n\nIn early 1777, British General John Burgoyne led 8,000 troops from Canada, down Lake Champlain, and into the Champlain Valley.  The goal of this invasion was to divide the New England colonies, thus forcing the Continental Army into a separated fight on multiple fronts.  Lake Champlain provided Burgoyne with protected passage deep into the American colonies. Burgoyne’s army reached Fort Ticonderoga and Mount Independence in late June 1777. During the night of July 5, the American forces fled Ticonderoga as the British took control of the fort. However, Burgoyne’s southern campaign did not go uncontested.\n\nOn October 7, 1777, American General Horatio Gates, who occupied Bemis Heights, met Burgoyne’s army at the Second Battle of Freeman’s Farm.  At Freeman’s Farm, Burgoyne’s army suffered its final defeat and ended their invasion south into the colonies. Ten days later, on October 17, 1777, British General Burgoyne surrendered his army at Saratoga.  This defeat was instrumental to the momentum of the Revolutionary War, as the defeat of the British army along the Champlain-Hudson waterway convinced France to ally with the American army.\n\nAftermath of 1777 \n\nFollowing the failed British campaign led by General Burgoyne, the British still maintained control over the Champlain waterway for the duration of the Revolutionary War. The British used the Champlain waterway to supply raids across the Champlain Valley from 1778 to 1780, and Lake Champlain permitted direct transportation of supplies from the British posts at the northern end of the lake.\n\nWith the end of the Revolutionary War in 1783, the British naval fleet on Lake Champlain retreated up to St. John’s. However, British troops garrisoned at Fort Dutchman's Point (North Hero, Vermont) and Fort au Fer (Champlain, New York) on Lake Champlain, did not leave until the 1796 Jay Treaty.\n\nPost-Revolutionary War period \n\nEager to take back control of Lake Champlain following the end of the Revolutionary War, Americans flocked to settle the Champlain Valley. Many individuals emigrated from Massachusetts and other New England colonies, such as Salmon Dutton, a settler of Cavendish, Vermont.Shelburne Museum's Dutton House (Shelburne, Vermont) Dutton emigrated in 1782 and worked as a surveyor, town official, and toll road owner. His home had a dooryard garden, typical of mid-19th century New England village homes, and his experience settling in the Champlain Valley depicts the industries and lifestyles surrounding Lake Champlain following the Revolutionary War.\n\nSimilar to the experience of Salmon Dutton, former colonial militia Captain Hezekiah Barnes settled in Charlotte, Vermont, in 1787.Shelburne Museum's Stagecoach Inn  Following the war, Barnes also worked as a road surveyor; he also established an inn and trading post in Charlotte, along the main trade route from Montreal down Lake Champlain. Barnes’s stagecoach inn was built in traditional Georgian style, with 10 fireplaces and a ballroom on the interior, and a wraparound porch on the outside.  In 1800, Continental Army Captain Benjamin Harrington established a distillery business in Shelburne, Vermont, which supplied his nearby inn.Shelburne Museum's Hat and Fragrance Textile Gallery Furthermore, Captain Stevens and Jeremiah Trescott built a water-powered sawmill in South Royalton, Vermont, in the late 1700s.Shelburne Museum's Sawmill These individual accounts shed light on the significance of Lake Champlain during the post-Revolutionary War period.\n\nWar of 1812\n\nDuring the War of 1812, British and American forces faced each other in the Battle of Lake Champlain, also known as the Battle of Plattsburgh, fought on September 11, 1814. This ended the final British invasion of the northern states during the War of 1812. It was fought just prior to the signing of the Treaty of Ghent, and the American victory denied the British any leverage to demand exclusive control over the Great Lakes or territorial gains against the New England states.\n\nThree US Naval ships have been named after this battle: , , and a cargo ship used during World War I.\n\nFollowing the War of 1812, the U.S. Army began construction on \"Fort Blunder\", an unnamed fortification built at the northernmost end of Lake Champlain to protect against attacks from British Canada. Its nickname came from a surveying error: the initial phase of construction on the fort turned out to be taking place on a point  north of the Canada–U.S. border. Once this error was spotted, construction was abandoned. Locals scavenged materials used in the abandoned fort for use in their homes and public buildings.\n\nBy the Webster-Ashburton Treaty of 1842, the Canada–U.S. border was adjusted northward to include the strategically important site of \"Fort Blunder\" on the US side. In 1844, work was begun to replace the remains of the 1812-era fort with a massive new Third System masonry fortification, known as Fort Montgomery. Portions of this fort are still standing.\n\nModern history\n\nIn the early 19th century, the construction of the Champlain Canal connected Lake Champlain to the Hudson River system, allowing north-south commerce by water from New York City to Montreal and Atlantic Canada.\n\nIn 1909, 65,000 people celebrated the 300th anniversary of the French discovery of the lake. Attending dignitaries included President William Howard Taft, along with representatives from France, Canada, and the United Kingdom.\n\nIn 1929, then-New York Governor Franklin Roosevelt and Vermont Governor John Weeks dedicated the first bridge to span the lake, built from Crown Point to Chimney Point. This bridge lasted until December 2009. Severe deterioration was found, and the bridge was demolished and replaced with the Lake Champlain Bridge, which opened in November 2011.\n\nOn February 19, 1932, boats were able to sail on Lake Champlain. It was the first time the lake was known to be free of ice during the winter at that time.\n\nLake Champlain briefly became the nation's sixth Great Lake on March 6, 1998, when President Clinton signed Senate Bill 927. This bill, which was led by U.S. Senator Patrick Leahy of Vermont and reauthorized the National Sea Grant Program, contained a line declaring Lake Champlain to be a Great Lake. This status enabled its neighboring states to apply for additional federal research and education funds allocated to these national resources. However, following a small uproar, the Great Lake status was rescinded on March 24 (although New York and Vermont universities continue to receive funds to monitor and study the lake).\n\n\"Champ\", Lake Champlain monster\n\nIn 1609, Samuel de Champlain wrote that he saw a lake monster 5 ft long, as thick as a man's thigh, with silver-gray scales a dagger could not penetrate. The alleged monster had  jaws with sharp and dangerous teeth. Native Americans claimed to have seen similar monsters 8 to. This mysterious creature is likely the original Lake Champlain monster. The monster has been memorialized in sports teams' names and mascots, i.e., the Vermont Lake Monsters and Champ, the mascot of the state's minor league baseball team. A Vermont Historical Society publication recounts the story and offers possible explanations for accounts of the so-called monster: \"floating logs, schools of large sturgeons diving in a row, or flocks of black birds flying close to the water.\"\n\nEcology\n\nA pollution prevention, control, and restoration plan for Lake Champlain was first endorsed in October 1996 by the governors of New York and Vermont, and the regional administrators of the United States Environmental Protection Agency (EPA). In April 2003, the plan was updated, and Quebec signed onto it. The plan is being implemented by the Lake Champlain Basin Program and its partners at the state, provincial, federal, and local levels. Renowned as a model for interstate and international cooperation, its primary goals are to reduce phosphorus inputs to Lake Champlain, reduce toxic contamination, minimize the risks to humans from water-related health hazards, and control the introduction, spread, and impact of non-native nuisance species to preserve the integrity of the Lake Champlain ecosystem.\n\nSenior staff who helped organize the Environmental Protection Agency in 1970 recall that International Paper was one of the first companies to call upon the brand new agency, because it was being pushed by both New York and Vermont with regard to a discharge of pollution into Lake Champlain.\n\nAgricultural and urban runoff from the watershed or drainage basin is the primary source of excess phosphorus, which exacerbates algae blooms in Lake Champlain. The most problematic blooms have been cyanobacteria, commonly called blue-green algae, in the northeastern part of the Lake, primarily Missisquoi Bay. [http://www.lcbp.org/publication_detail.aspx?id=213] Abstract online \n\nTo reduce phosphorus runoff to this part of the lake, Vermont and Quebec agreed to reduce their inputs by 60% and 40%, respectively, by an agreement signed in 2002. While agricultural sources (manure and fertilizers) are the primary sources of phosphorus (about 70%) in the Missisquoi basin, runoff from developed land and suburbs is estimated to contribute about 46% of the phosphorus runoff basin-wide to Lake Champlain, and agricultural lands contributed about 38%.\n\nIn 2002, the cleanup plan noted that the lake had the capacity to absorb 110 MT of phosphorus each year. In 2009, a judge noted that 218 MT were still flowing in annually, more than twice what the lake could handle. Sixty municipal and industrial sewage plants discharge processed waste from the Vermont side.\n\nIn 2008, the EPA expressed concerns to the State of Vermont that the Lake's cleanup was not progressing fast enough to meet the original cleanup goal of 2016. The state, however, cites its Clean and Clear Action Plan as a model that will produce positive results for Lake Champlain.\n\nIn 2007, Vermont banned phosphates for dishwasher use starting in 2010. This will prevent an estimated 2 - from flowing into the lake. While this represents 0.6% of the phosphate pollution, it took US$1.9 million to remove the pollutant from treated wastewater, an EPA requirement.\n\nDespite concerns about pollution, Lake Champlain is safe for swimming, fishing, and boating. It is considered a world-class fishery for salmonid species (Lake trout and Atlantic salmon) and bass. About 81 fish species live in the lake, and more than 300 bird species rely on it for habitat and as a resource during migrations.\n\nBy 2008, at least six institutions were monitoring lake water health:\n# Conservation Law Foundation, which in 2002 appointed a \"lakekeeper,\" who reviews the state's pollution controls\n# Friends of Missisquoi Bay, formed in 2003\n# Lake Champlain Committee\n# Vermont Water Resources Board, which hired a water quality expert in 2008 to write water quality standards and create wetland protection rules\n# Vermont Agency of Natural Resources, which in 2007 appointed a \"lake czar\" to oversee pollution control\n# Clean and Clear, an agency of the Vermont state government, established in 2004\n# Nature Conservancy, a non-profit group which focuses on biodiversity and ecosystem health.\n\nIn 2001, scientists estimated that farming contributed 38% of the phosphorus runoff. By 2010, results of environmentally conscious farming practices, enforced by law, had made any positive contribution to lake cleanliness. A federally funded study was started to analyze this problem and to arrive at a solution.\n\nBiologists have been trying to control lampreys in the lake since 1985 or earlier. Lampreys are native to the area but have expanded in population to such an extent that they wounded nearly all lake trout in 2006 and 70–80% of salmon. The use of pesticides against the lamprey has reduced their casualties of other fish to 35% of salmon and 31% of lake trout. The goal was 15% of salmon and 25% of lake trout.\n\nThe federal and state governments originally budgeted US$18 million for lake programs for 2010. This was later supplemented by an additional US$6.5 million from the federal government.\n\nNatural history\n\nIn 2010, the estimate of cormorant population, now classified as a nuisance species because they take so much of the lake fish, ranged from 14,000 to 16,000. A Fish and Wildlife commissioner said the ideal population would be 3,300 or about 3 per 1 km2. Cormorants had disappeared from the lake (and all northern lakes) due to the use of DDT in the 1940s and 1950s, which made their eggs more fragile and reduced breeding populations.\n\nRing-billed gulls are also considered a nuisance, and measures have been taken to reduce their population. Authorities are trying to encourage the return of black crowned night herons, cattle egrets, and great blue herons, which disappeared during the time DDT was being widely used.\n\nIn 1989, UNESCO designated the area around Lake Champlain as the Champlain-Adirondack Biosphere Reserve.\n\nInfrastructure\n\nLake crossings\n\nThe Alburgh Peninsula (also known as the Alburgh Tongue), extending south from the Quebec shore of the lake into Vermont, is accessible from the rest of the state only via Canada. This is a distinction shared with Point Roberts, Washington, and the Northwest Angle in Minnesota as well as Province Point (see below). Unlike the other three cases, this is no longer of practical significance because highway bridges across the lake provide access to the peninsula from within the United States (from three directions).\n\nRoad\n\nTwo roadways cross over the lake, connecting Vermont and New York:\n\n*Since November 2011, the Lake Champlain Bridge has crossed the lake's southern part, connecting Chimney Point in Vermont with Crown Point, New York. It replaced Champlain Bridge, which was closed in 2009 because of severe structural problems that could have resulted in a collapse.\n\nIn 2009, the bridge had been used by 3,400 drivers per day,NYT article of December 12, 2009 (page A12) and driving around the southern end of the lake added two hours to the trip. Ferry service was re-established to take some of the traffic burden. On December 28, 2009, the bridge was destroyed by a controlled demolition. A new bridge was rapidly constructed by a joint state commitment, opening on November 7, 2011.\n\n*To the north, US 2 runs from Rouses Point, New York, to Grand Isle County, Vermont, in the town of Alburgh, before continuing south along a chain of islands towards Burlington. To the east, Vermont Route 78 runs from an intersection with US 2 in Alburgh through East Alburgh to Swanton. The US 2-VT 78 route technically runs from the New York mainland to an extension of the mainland between two arms of the lake and then to the Vermont mainland, but it provides a direct route across the two main arms of the lake's northern part.\n\nFerry\n\nNorth of Ticonderoga, New York, the lake widens appreciably; ferry service is operated by the Lake Champlain Transportation Company at:\n* Charlotte, Vermont, to Essex, New York (may not travel when the lake is frozen)\n* Burlington, Vermont, to Port Kent, New York (seasonal)\n* Grand Isle, Vermont, to Cumberland Head, part of Plattsburgh, New York (year-round icebreaking service)\n\nWhile the old bridge was being demolished and the new one constructed, Lake Champlain Transportation\nCompany operated a free, 24-hour ferry from just south of the bridge to Chimney\nPoint in Vermont at the expense of the states of New York and Vermont at a cost to the states of about $10 per car.\n\nThe most southerly crossing is the Fort Ticonderoga Ferry, connecting Ticonderoga, New York with Shoreham, Vermont, just north of the historic fort.\n\nRailroad\n\nFour significant railroad crossings were built over the lake. As of 2016, only one remains.\n* The \"floating\" rail trestle from Larabees Point, Vermont to Ticonderoga, New York was operated by the Addison Branch of the Rutland Railroad. It was abandoned in 1918 due to a number of accidents which resulted in locomotives and rail cars falling into the lake.\n* The Island Line Causeway, a marble rock-landfill causeway that stretched from Colchester (on the mainland) 3 mi north and west to South Hero, Vermont. Two breaks in the causeway were spanned by a fixed iron trestle and a swing bridge that could be opened to allow boats to pass. Rutland Railroad (later Rutland Railway) operated trains over this causeway from 1901–1961. The Railway was officially abandoned in 1963, with tracks and trestles removed over the course of the 10 years that followed. The marble causeway still remains, as does the fixed iron trestle that bridges the lesser of the two gaps. The swing bridge over the navigation channel was removed in the early 1970s.\n\nNow called Colchester Park, the main three-mile (5 km) causeway has been adapted and preserved as a recreation area for cyclists, runners, and anglers. Two smaller marble rock-landfill causeways were also erected as part of this line that connected Grand Isle to North Hero, and spanned from North Hero to Alburgh.\n\n* The Alburgh, Vermont – Rouses Point, New York rail trestle. From sometime in the late 19th century until 1964, this wooden trestle carried two railroads (the Rutland Railroad and the Central Vermont Railroad) over the lake just south of the US 2 vehicular bridge. The iron swing bridge at the center (over the navigation channel) has been removed. Most of the wooden pilings remain and can be seen looking south from the US 2 bridge. Part of the trestle on the Rouses Point side has been converted for use as an access pier associated with the local marina.\n* The Swanton – Alburgh, Vermont rail trestle. Built in the same manner as at Rouses Point, it crosses the lake just south of Missisquoi Bay and the Canada–U.S. border, within yards south of the Vermont Route 78 bridge. It is still in use by the New England Central Railroad.\n\nWaterways\n\nLake Champlain has been connected to the Erie Canal via the Champlain Canal since the canal's official opening September 9, 1823, the same day as the opening of the Erie Canal from Rochester on Lake Ontario to Albany. It connects to the St. Lawrence River via the Richelieu River, with the Chambly Canal bypassing rapids on the river since 1843. Together with these waterways the lake is part of the Lakes to Locks Passage. The Lake Champlain Seaway, a project to use the lake to bring ocean-going ships from New York City to Montreal, was proposed in the late 19th century and considered as late as the 1960s, but rejected for various reasons. The lake is also part of the 740-mile Northern Forest Canoe Trail, which begins in Old Forge, New York, and ends in Fort Kent, Maine.\n\nSurroundings\n\nMajor cities\n\nBurlington, Vermont (pop. 42,217, 2010 Census) is the largest city on the lake. The 2nd and 3rd most populated cities/towns are Plattsburgh, New York, and South Burlington, Vermont, respectively. The fourth-largest community is the town of Colchester.\n\nIslands\n\nLake Champlain contains roughly 80 islands, three of which comprise four entire Vermont towns (most of Grand Isle County). The largest islands:\n\n*South Hero Island, the largest, containing the towns of Grand Isle, Vermont and South Hero, Vermont\n*North Hero Island, containing the town of North Hero, Vermont\n*Isle La Motte, containing the town of Isle La Motte, Vermont\n*Valcour Island, New York\n*Juniper Island (Lake Champlain)\n*Three Sisters\n*Four Brothers\n*Savage Island\n*Burton Island (State Park)\n*Cloak Island\n*Garden Island (Gunboat Island)\n*Crab Island, New York\n*Dameas Island\n*Hen Island\n*Butler's Island\n*Carleton's Prize\n*Young Island \n*Providence Island\n*Stave Island\n*Sunset Island\n\nLighthouses\n\n* Bluff Point Lighthouse, on Valcour Island near the New York shore, was built in 1871; it was manned by a full-time lightkeeper until 1930, making it one of the last lighthouses to be manned on the Lake\n* Cumberland Head Light, which operated until 1934, is an historic stone lighthouse located on Cumberland Head, which is privately owned\n* Isle La Motte lighthouse, on the northern end of the island was originally red, but it faded to pink over time; it is privately owned\n* Juniper Island Light is a cast iron lighthouse that dates from 1846; in 1954, it was deactivated and replaced by a steel tower; it is privately owned\n* On Point Au Roche, part of Beekmantown, New York, there is a privately owned, historic lighthouse\n* Split Rock Lighthouse is located south of Essex, New York, near a natural boundary of the territory between the Mohawk and Algonquin tribes\n\nAids to navigation\n\nAll active navigational aids on the American portion of the lake are maintained by USCG Burlington station, along with those on international Lake Memphremagog to the east.\n\nAids to navigation on the Canadian portion of the lake are maintained by the Canadian Coast Guard.\n\nParks\n\nThere are a number of parks in the Lake Champlain region in both New York and Vermont.\n\nThose on the New York side of the lake include: Point Au Roche State Park, which park grounds have hiking and cross country skiing trails, and a public beach; and the Ausable Point State Park. The Cumberland Bay State Park is located on Cumberland Head, with a campground, city beach, and sports fields.\n\nThere are various parks along the lake on the Vermont side, including Sand Bar State Park in Milton, featuring a 2000 ft natural sand beach, swimming, canoe and kayak rentals, food concession, picnic grounds and a play area. At 226 acre, Grand Isle State Park contains camping facilities, a sand volleyball court, a nature walk trail, a horseshoe pit and a play area. Button Bay State Park in Ferrisburgh features campsites, picnic areas, a nature center and a swimming pool. Burlington's Waterfront Park is a revitalized industrial area.\n\nPublic safety\n\nCoast Guard Station Burlington provides \"Search and Rescue, Law Enforcement and Ice Rescue services 24 hours a day, 365 days a year.\" Services are also provided by local, and state, and federal governments bordering on the lake, including the U.S. Border Patrol, Royal Canadian Mounted Police, Vermont State Police, New York State Police Marine Detail, and Vermont Fish and Wildlife wardens.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lake Champlain" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18201" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Lake Champlain (French: Lac Champlain) (Abenaki: Pitawbagokhttp://www.toponymie.gouv.qc.ca/ct/pdf/la%20toponymie%20des%20Abenaquis.pdf?ts0.14881141134537756) (Mohawk: Kaniatarakwà:ronte) is a natural freshwater lake in North America mainly within the borders of the United States (in the states of Vermont and New York) but partially situated across the Canada–U.S. border, in the Canadian province of Quebec.\n\nThe New York portion of the Champlain Valley includes the eastern portions of Clinton County and Essex County. Most of this area is part of the Adirondack Park. There are recreational opportunities in the park and along the relatively undeveloped coastline of Lake Champlain. The cities of Plattsburgh, New York and Burlington, Vermont are on the lake's western and eastern shores, respectively, and the village of Ticonderoga, New York is in the region's southern part. The Quebec portion is in the regional county municipalities of Le Haut-Richelieu and Brome-Missisquoi. There are a number of islands in the lake; the largest include Grand Isle, Isle La Motte, and North Hero, all part of Grand Isle County, Vermont.\n\nGeology\n\nThe Champlain Valley is the northernmost unit of a landform system known as the Great Appalachian Valley, which stretches between Quebec, Canada, to the north, and Alabama, US, to the south. The Champlain Valley is a physiographic section of the larger Saint Lawrence Valley, which in turn is part of the larger Appalachian physiographic division.\n\nLake Champlain is one of numerous large lakes scattered in an arc through Labrador, in Canada, the northern United States, and the Northwest Territories of Canada. Although it is smaller than each of the Great Lakes (Ontario, Erie, Huron, Superior, and Michigan), Lake Champlain is a large body of fresh water. Approximately 1269 km2 in area, the lake is 172 km long and 23 km across at its widest point, and has a maximum depth of approximately 400 ft. The lake varies seasonally from about 95 to above mean sea level.\n\nHydrology\n\nLake Champlain is in the Lake Champlain Valley between the Green Mountains of Vermont and the Adirondack Mountains of New York, drained northward by the 106 mi-long Richelieu River into the St. Lawrence River at Sorel-Tracy, Quebec, northeast and downstream of Montreal, Quebec. It also receives the waters from the 32 mi-long Lake George, so its basin collects waters from the northwestern slopes of the Green Mountains and the northernmost eastern peaks of the Adirondack Mountains.\n\nLake Champlain drains nearly half of Vermont, and approximately 250,000 people get their drinking water from the lake.\n\nThe lake is fed in Vermont by the LaPlatte, Lamoille, Missisquoi, Poultney, and Winooski rivers, along with Lewis Creek, Little Otter Creek, and Otter Creek. In New York, it is fed by the Ausable, Boquet, Great Chazy, La Chute, Little Ausable, Little Chazy, Salmon, and Saranac rivers, along with Putnam Creek. In Quebec, it is fed by the Pike River.\n\nIt is connected to the Hudson River by the Champlain Canal.\n\nParts of the lake freeze each winter, and in some winters the entire lake surface freezes, referred to as \"closing\". In July and August, the lake temperature reaches an average of 70 °F.\n\nChazy Reef\n\nThe Chazy Reef is an extensive Ordovician carbonate rock formation that extends from Tennessee to Quebec and Newfoundland. It occurs in prominent outcropping at Goodsell Ridge, Isle La Motte, the northernmost island in Lake Champlain.\n\nThe oldest reefs are around \"The Head\" of the south end of the island; slightly younger reefs are found at the Fisk Quarry, and the youngest (the famous coral reefs) are in fields to the north. Together, these three sites provide a unique narrative of events that took place over 450 million years ago in the ocean in the Southern Hemisphere, long before Lake Champlain's emergence 20,000 years ago.\n\nHistory\n\nThe lake has long acted as a border between indigenous nations much as it is today between the USA and Canada. The lake is located at the frontier between Abenaki and Mohawk (Iroquois Confederacy) traditional territories. The official toponym for the lake according to the orthography established by the Grand Council of Wanab-aki Nation is Pitawbagok (alternative orthographies include Petonbowk and Bitawbagok), meaning 'middle lake', 'lake in between' or 'double lake'.\n\nThe Mohawk name in modern orthography as standardized in 1993 is Kaniatarakwà:ronte, meaning bulging lake. An alternate name is Kaniá:tare tsi kahnhokà:ronte (phonetic English spelling Caniaderi Guarunte ), meaning 'door of the country' or 'lake to the country'. The lake is an important eastern gateway to Iroquois Confederacy lands.\n\nThe lake was named after the French explorer Samuel de Champlain, who encountered it in July 1609. While the ports of Burlington, Vermont, Port Henry, New York, and Plattsburgh, New York today are primarily used by small craft, ferries, and lake cruise ships, they were of substantial commercial and military importance in the 18th and 19th centuries.\n\nColonial America and the Revolutionary War\n\nNew France allocated concessions all along lake Champlain to French settlers and built forts to defend the waterways. In colonial times, Lake Champlain was used as a water (or, in winter, ice) passage between the Saint Lawrence and Hudson valleys. Travelers found it easier to journey by boats and sledges on the lake rather than go overland on unpaved and frequently mud-bound roads. The lake's northern tip at Saint-Jean-sur-Richelieu, Quebec (known as St. John in colonial times under British rule), is a short distance from Montreal, Quebec. The southern tip at Whitehall (Skenesborough in revolutionary times) is a short distance from Saratoga, Glens Falls, and Albany, New York.\n\nForts were built at Ticonderoga and Crown Point (Fort St. Frederic) to control passage on the lake in colonial times. Important battles were fought at Ticonderoga in 1758 and 1775. During the Revolutionary War, the British and Americans conducted a frenetic shipbuilding race through the spring and summer of 1776, at opposite ends of the lake, and fought a significant naval engagement on October 11 at the Battle of Valcour Island. While it was a tactical defeat for the Americans, and the small fleet led by Benedict Arnold was almost destroyed, the Americans gained a strategic victory; the British invasion was delayed long enough so the approach of winter prevented the fall of these forts until the following year. In this period, the Continental Army gained strength and was victorious at Saratoga.\n\nThe beginning of the Revolutionary War \n\nAt the start of the Revolutionary War, British forces occupied the Champlain Valley.  However, it did not take long for rebel leaders to realize the importance of controlling Lake Champlain. Early in the war, the colonial militias attempted to expel the British from Boston; however, this undertaking could not be achieved without heavy artillery.Countryman (2003), p. 103  The British forts at Ticonderoga and Crown Point, on Lake Champlain, were known to have ample supplies of artillery and were weakly manned by the British. Thus, the colonial militias devised a plan to take control of the two forts and bring the guns back to the fight in Boston.\n\nThe necessity of controlling the two forts at Ticonderoga and Crown Point placed Lake Champlain as a strategic arena during the Revolutionary War. By taking control of these forts, Americans not only gained heavy artillery, but control of a vast water highway, as well: Lake Champlain provided a direct invasion route to British Canada. However, had the British controlled the lake, they could have divided the colonies of New England and further depleted the Continental Army.\n\nThe Continental Army's first offensive action took place in May 1775, three weeks after the Battles of Lexington and Concord.  Ethan Allen, accompanied by 200 Green Mountain Boys, was ordered to capture Fort Ticonderoga and retrieve supplies for the fight in Boston. Benedict Arnold shared the command with Allen, and in early May 1775, they captured Fort Ticonderoga, Crown Point, and the southern Loyalist settlement of Skenesborough.  As a result of Allen’s offensive attack on the Champlain Valley in 1775, the American forces controlled the Lake Champlain waterway.\n\nThe Siege of Quebec: 1775–1776 \n\nThe Continental Army realized the strategic advantage of controlling Lake Champlain, as it leads directly to the heart of Quebec. Immediately after taking Forts Ticonderoga and Crown Point, the Americans began planning an attack on British Canada. The American siege of Quebec was a two-pronged assault and occurred throughout the winter of 1775–1776.  Brigadier General Richard Montgomery led the first assault up the Champlain Valley into Canada, while Benedict Arnold led a second army to Quebec via the Maine wilderness.\n\nDespite the strategic advantage of controlling a direct route to Quebec by way of the Champlain Valley, the American siege of British Canada during the winter of 1775 failed. The Continental Army mistakenly assumed they would receive support from the Canadians upon their arrival at Quebec. This was not the case, and the rebel army struggled to take Quebec with diminishing supplies, support, and harsh northern winter weather.\n\nThe Continental Army was forced to camp outside Quebec’s walls for the winter, with reinforcements from New York, Pennsylvania, Massachusetts, New Hampshire, and Connecticut allowing the soldiers to maintain their siege of the city.  The reinforcements traveled hundreds of miles up the frozen Lake Champlain and St. Lawrence River, but were too late and too few to influence a successful siege of Quebec. In May 1776, with the arrival of a British convoy carrying 10,000 British and Hessian troops to Canada, the Continental forces retreated back down the Champlain Valley to reevaluate their strategy.\n\n“I know of no better method than to secure the important posts of Ticonderoga and Crown Point, and by building a number of armed vessels to command the lakes, otherwise the forces now in Canada will be brought down upon us as quick as possible, having nothing to oppose them… They will doubtless try to construct some armed vessels and then endeavor to penetrate the country toward New York.” (Brigadier General John Sullivan to George Washington, June 24, 1776).\n\nBoth British and American forces spent the summer of 1776 building their naval fleets, at opposite ends of Lake Champlain.  By the October 1776, the Continental Army had 16 operating naval vessels on Lake Champlain, a great increase to the four small ships they had at the beginning of the summer.  General Benedict Arnold commanded the American naval fleet on Lake Champlain, which was composed of volunteers and soldiers drafted from the Northern Army. With great contrast to the Continental navy, experienced Royal Navy officers, British seamen, and Hessian artillerymen manned the British fleet on Lake Champlain.  By the end of the summer of 1776, the opposing armies were prepared to battle over the strategic advantage of controlling Lake Champlain.\n\nThe Battle of Valcour Island \n\nOn October 11, 1776, the British and American naval fleets met on the western side of Valcour Island, on Lake Champlain.  American General Benedict Arnold established the location, as it provided the Continental fleet with a natural defensive position. The British and American vessels engaged in combat for much of the day, only stopping due to the impending nightfall.\n\nAfter a long day of combat, the American fleet was in worse shape than the experienced British Navy. Upon ceasefire, Arnold called a council of war with his fellow officers, proposing to escape the British fleet via rowboats under the cover of night. As the British burned Arnold's flagship, the Royal Savage, to the east, the Americans rowed past the British lines.\n\nThe following morning, the British learned of the Americans' escape and set out after the fleeing Continental vessels. On October 13, the British fleet caught up to the struggling American ships near Split Rock Mountain.  With no hope of fighting off the powerful British navy, Arnold ordered his men to run their five vessels aground in Ferris Bay, Panton, Vermont. The depleted Continental army escaped on land back to Fort Ticonderoga and Mount Independence; however, they no longer controlled the Lake Champlain waterway.\n\nThe approaching winter of 1776–1777 restricted British movement along the recently controlled Lake Champlain. As the British abandoned Crown Point and returned to Canada for the winter, the Americans reduced their garrisons in the Champlain Valley from 13,000 to 2,500 soldiers.\n\nGeneral Burgoyne’s Campaign \n\nIn early 1777, British General John Burgoyne led 8,000 troops from Canada, down Lake Champlain, and into the Champlain Valley.  The goal of this invasion was to divide the New England colonies, thus forcing the Continental Army into a separated fight on multiple fronts.  Lake Champlain provided Burgoyne with protected passage deep into the American colonies. Burgoyne’s army reached Fort Ticonderoga and Mount Independence in late June 1777. During the night of July 5, the American forces fled Ticonderoga as the British took control of the fort. However, Burgoyne’s southern campaign did not go uncontested.\n\nOn October 7, 1777, American General Horatio Gates, who occupied Bemis Heights, met Burgoyne’s army at the Second Battle of Freeman’s Farm.  At Freeman’s Farm, Burgoyne’s army suffered its final defeat and ended their invasion south into the colonies. Ten days later, on October 17, 1777, British General Burgoyne surrendered his army at Saratoga.  This defeat was instrumental to the momentum of the Revolutionary War, as the defeat of the British army along the Champlain-Hudson waterway convinced France to ally with the American army.\n\nAftermath of 1777 \n\nFollowing the failed British campaign led by General Burgoyne, the British still maintained control over the Champlain waterway for the duration of the Revolutionary War. The British used the Champlain waterway to supply raids across the Champlain Valley from 1778 to 1780, and Lake Champlain permitted direct transportation of supplies from the British posts at the northern end of the lake.\n\nWith the end of the Revolutionary War in 1783, the British naval fleet on Lake Champlain retreated up to St. John’s. However, British troops garrisoned at Fort Dutchman's Point (North Hero, Vermont) and Fort au Fer (Champlain, New York) on Lake Champlain, did not leave until the 1796 Jay Treaty.\n\nPost-Revolutionary War period \n\nEager to take back control of Lake Champlain following the end of the Revolutionary War, Americans flocked to settle the Champlain Valley. Many individuals emigrated from Massachusetts and other New England colonies, such as Salmon Dutton, a settler of Cavendish, Vermont.Shelburne Museum's Dutton House (Shelburne, Vermont) Dutton emigrated in 1782 and worked as a surveyor, town official, and toll road owner. His home had a dooryard garden, typical of mid-19th century New England village homes, and his experience settling in the Champlain Valley depicts the industries and lifestyles surrounding Lake Champlain following the Revolutionary War.\n\nSimilar to the experience of Salmon Dutton, former colonial militia Captain Hezekiah Barnes settled in Charlotte, Vermont, in 1787.Shelburne Museum's Stagecoach Inn  Following the war, Barnes also worked as a road surveyor; he also established an inn and trading post in Charlotte, along the main trade route from Montreal down Lake Champlain. Barnes’s stagecoach inn was built in traditional Georgian style, with 10 fireplaces and a ballroom on the interior, and a wraparound porch on the outside.  In 1800, Continental Army Captain Benjamin Harrington established a distillery business in Shelburne, Vermont, which supplied his nearby inn.Shelburne Museum's Hat and Fragrance Textile Gallery Furthermore, Captain Stevens and Jeremiah Trescott built a water-powered sawmill in South Royalton, Vermont, in the late 1700s.Shelburne Museum's Sawmill These individual accounts shed light on the significance of Lake Champlain during the post-Revolutionary War period.\n\nWar of 1812\n\nDuring the War of 1812, British and American forces faced each other in the Battle of Lake Champlain, also known as the Battle of Plattsburgh, fought on September 11, 1814. This ended the final British invasion of the northern states during the War of 1812. It was fought just prior to the signing of the Treaty of Ghent, and the American victory denied the British any leverage to demand exclusive control over the Great Lakes or territorial gains against the New England states.\n\nThree US Naval ships have been named after this battle: , , and a cargo ship used during World War I.\n\nFollowing the War of 1812, the U.S. Army began construction on \"Fort Blunder\", an unnamed fortification built at the northernmost end of Lake Champlain to protect against attacks from British Canada. Its nickname came from a surveying error: the initial phase of construction on the fort turned out to be taking place on a point  north of the Canada–U.S. border. Once this error was spotted, construction was abandoned. Locals scavenged materials used in the abandoned fort for use in their homes and public buildings.\n\nBy the Webster-Ashburton Treaty of 1842, the Canada–U.S. border was adjusted northward to include the strategically important site of \"Fort Blunder\" on the US side. In 1844, work was begun to replace the remains of the 1812-era fort with a massive new Third System masonry fortification, known as Fort Montgomery. Portions of this fort are still standing.\n\nModern history\n\nIn the early 19th century, the construction of the Champlain Canal connected Lake Champlain to the Hudson River system, allowing north-south commerce by water from New York City to Montreal and Atlantic Canada.\n\nIn 1909, 65,000 people celebrated the 300th anniversary of the French discovery of the lake. Attending dignitaries included President William Howard Taft, along with representatives from France, Canada, and the United Kingdom.\n\nIn 1929, then-New York Governor Franklin Roosevelt and Vermont Governor John Weeks dedicated the first bridge to span the lake, built from Crown Point to Chimney Point. This bridge lasted until December 2009. Severe deterioration was found, and the bridge was demolished and replaced with the Lake Champlain Bridge, which opened in November 2011.\n\nOn February 19, 1932, boats were able to sail on Lake Champlain. It was the first time the lake was known to be free of ice during the winter at that time.\n\nLake Champlain briefly became the nation's sixth Great Lake on March 6, 1998, when President Clinton signed Senate Bill 927. This bill, which was led by U.S. Senator Patrick Leahy of Vermont and reauthorized the National Sea Grant Program, contained a line declaring Lake Champlain to be a Great Lake. This status enabled its neighboring states to apply for additional federal research and education funds allocated to these national resources. However, following a small uproar, the Great Lake status was rescinded on March 24 (although New York and Vermont universities continue to receive funds to monitor and study the lake).\n\n\"Champ\", Lake Champlain monster\n\nIn 1609, Samuel de Champlain wrote that he saw a lake monster 5 ft long, as thick as a man's thigh, with silver-gray scales a dagger could not penetrate. The alleged monster had  jaws with sharp and dangerous teeth. Native Americans claimed to have seen similar monsters 8 to. This mysterious creature is likely the original Lake Champlain monster. The monster has been memorialized in sports teams' names and mascots, i.e., the Vermont Lake Monsters and Champ, the mascot of the state's minor league baseball team. A Vermont Historical Society publication recounts the story and offers possible explanations for accounts of the so-called monster: \"floating logs, schools of large sturgeons diving in a row, or flocks of black birds flying close to the water.\"\n\nEcology\n\nA pollution prevention, control, and restoration plan for Lake Champlain was first endorsed in October 1996 by the governors of New York and Vermont, and the regional administrators of the United States Environmental Protection Agency (EPA). In April 2003, the plan was updated, and Quebec signed onto it. The plan is being implemented by the Lake Champlain Basin Program and its partners at the state, provincial, federal, and local levels. Renowned as a model for interstate and international cooperation, its primary goals are to reduce phosphorus inputs to Lake Champlain, reduce toxic contamination, minimize the risks to humans from water-related health hazards, and control the introduction, spread, and impact of non-native nuisance species to preserve the integrity of the Lake Champlain ecosystem.\n\nSenior staff who helped organize the Environmental Protection Agency in 1970 recall that International Paper was one of the first companies to call upon the brand new agency, because it was being pushed by both New York and Vermont with regard to a discharge of pollution into Lake Champlain.\n\nAgricultural and urban runoff from the watershed or drainage basin is the primary source of excess phosphorus, which exacerbates algae blooms in Lake Champlain. The most problematic blooms have been cyanobacteria, commonly called blue-green algae, in the northeastern part of the Lake, primarily Missisquoi Bay. [http://www.lcbp.org/publication_detail.aspx?id=213] Abstract online \n\nTo reduce phosphorus runoff to this part of the lake, Vermont and Quebec agreed to reduce their inputs by 60% and 40%, respectively, by an agreement signed in 2002. While agricultural sources (manure and fertilizers) are the primary sources of phosphorus (about 70%) in the Missisquoi basin, runoff from developed land and suburbs is estimated to contribute about 46% of the phosphorus runoff basin-wide to Lake Champlain, and agricultural lands contributed about 38%.\n\nIn 2002, the cleanup plan noted that the lake had the capacity to absorb 110 MT of phosphorus each year. In 2009, a judge noted that 218 MT were still flowing in annually, more than twice what the lake could handle. Sixty municipal and industrial sewage plants discharge processed waste from the Vermont side.\n\nIn 2008, the EPA expressed concerns to the State of Vermont that the Lake's cleanup was not progressing fast enough to meet the original cleanup goal of 2016. The state, however, cites its Clean and Clear Action Plan as a model that will produce positive results for Lake Champlain.\n\nIn 2007, Vermont banned phosphates for dishwasher use starting in 2010. This will prevent an estimated 2 - from flowing into the lake. While this represents 0.6% of the phosphate pollution, it took US$1.9 million to remove the pollutant from treated wastewater, an EPA requirement.\n\nDespite concerns about pollution, Lake Champlain is safe for swimming, fishing, and boating. It is considered a world-class fishery for salmonid species (Lake trout and Atlantic salmon) and bass. About 81 fish species live in the lake, and more than 300 bird species rely on it for habitat and as a resource during migrations.\n\nBy 2008, at least six institutions were monitoring lake water health:\n# Conservation Law Foundation, which in 2002 appointed a \"lakekeeper,\" who reviews the state's pollution controls\n# Friends of Missisquoi Bay, formed in 2003\n# Lake Champlain Committee\n# Vermont Water Resources Board, which hired a water quality expert in 2008 to write water quality standards and create wetland protection rules\n# Vermont Agency of Natural Resources, which in 2007 appointed a \"lake czar\" to oversee pollution control\n# Clean and Clear, an agency of the Vermont state government, established in 2004\n# Nature Conservancy, a non-profit group which focuses on biodiversity and ecosystem health.\n\nIn 2001, scientists estimated that farming contributed 38% of the phosphorus runoff. By 2010, results of environmentally conscious farming practices, enforced by law, had made any positive contribution to lake cleanliness. A federally funded study was started to analyze this problem and to arrive at a solution.\n\nBiologists have been trying to control lampreys in the lake since 1985 or earlier. Lampreys are native to the area but have expanded in population to such an extent that they wounded nearly all lake trout in 2006 and 70–80% of salmon. The use of pesticides against the lamprey has reduced their casualties of other fish to 35% of salmon and 31% of lake trout. The goal was 15% of salmon and 25% of lake trout.\n\nThe federal and state governments originally budgeted US$18 million for lake programs for 2010. This was later supplemented by an additional US$6.5 million from the federal government.\n\nNatural history\n\nIn 2010, the estimate of cormorant population, now classified as a nuisance species because they take so much of the lake fish, ranged from 14,000 to 16,000. A Fish and Wildlife commissioner said the ideal population would be 3,300 or about 3 per 1 km2. Cormorants had disappeared from the lake (and all northern lakes) due to the use of DDT in the 1940s and 1950s, which made their eggs more fragile and reduced breeding populations.\n\nRing-billed gulls are also considered a nuisance, and measures have been taken to reduce their population. Authorities are trying to encourage the return of black crowned night herons, cattle egrets, and great blue herons, which disappeared during the time DDT was being widely used.\n\nIn 1989, UNESCO designated the area around Lake Champlain as the Champlain-Adirondack Biosphere Reserve.\n\nInfrastructure\n\nLake crossings\n\nThe Alburgh Peninsula (also known as the Alburgh Tongue), extending south from the Quebec shore of the lake into Vermont, is accessible from the rest of the state only via Canada. This is a distinction shared with Point Roberts, Washington, and the Northwest Angle in Minnesota as well as Province Point (see below). Unlike the other three cases, this is no longer of practical significance because highway bridges across the lake provide access to the peninsula from within the United States (from three directions).\n\nRoad\n\nTwo roadways cross over the lake, connecting Vermont and New York:\n\n*Since November 2011, the Lake Champlain Bridge has crossed the lake's southern part, connecting Chimney Point in Vermont with Crown Point, New York. It replaced Champlain Bridge, which was closed in 2009 because of severe structural problems that could have resulted in a collapse.\n\nIn 2009, the bridge had been used by 3,400 drivers per day,NYT article of December 12, 2009 (page A12) and driving around the southern end of the lake added two hours to the trip. Ferry service was re-established to take some of the traffic burden. On December 28, 2009, the bridge was destroyed by a controlled demolition. A new bridge was rapidly constructed by a joint state commitment, opening on November 7, 2011.\n\n*To the north, US 2 runs from Rouses Point, New York, to Grand Isle County, Vermont, in the town of Alburgh, before continuing south along a chain of islands towards Burlington. To the east, Vermont Route 78 runs from an intersection with US 2 in Alburgh through East Alburgh to Swanton. The US 2-VT 78 route technically runs from the New York mainland to an extension of the mainland between two arms of the lake and then to the Vermont mainland, but it provides a direct route across the two main arms of the lake's northern part.\n\nFerry\n\nNorth of Ticonderoga, New York, the lake widens appreciably; ferry service is operated by the Lake Champlain Transportation Company at:\n* Charlotte, Vermont, to Essex, New York (may not travel when the lake is frozen)\n* Burlington, Vermont, to Port Kent, New York (seasonal)\n* Grand Isle, Vermont, to Cumberland Head, part of Plattsburgh, New York (year-round icebreaking service)\n\nWhile the old bridge was being demolished and the new one constructed, Lake Champlain Transportation\nCompany operated a free, 24-hour ferry from just south of the bridge to Chimney\nPoint in Vermont at the expense of the states of New York and Vermont at a cost to the states of about $10 per car.\n\nThe most southerly crossing is the Fort Ticonderoga Ferry, connecting Ticonderoga, New York with Shoreham, Vermont, just north of the historic fort.\n\nRailroad\n\nFour significant railroad crossings were built over the lake. As of 2016, only one remains.\n* The \"floating\" rail trestle from Larabees Point, Vermont to Ticonderoga, New York was operated by the Addison Branch of the Rutland Railroad. It was abandoned in 1918 due to a number of accidents which resulted in locomotives and rail cars falling into the lake.\n* The Island Line Causeway, a marble rock-landfill causeway that stretched from Colchester (on the mainland) 3 mi north and west to South Hero, Vermont. Two breaks in the causeway were spanned by a fixed iron trestle and a swing bridge that could be opened to allow boats to pass. Rutland Railroad (later Rutland Railway) operated trains over this causeway from 1901–1961. The Railway was officially abandoned in 1963, with tracks and trestles removed over the course of the 10 years that followed. The marble causeway still remains, as does the fixed iron trestle that bridges the lesser of the two gaps. The swing bridge over the navigation channel was removed in the early 1970s.\n\nNow called Colchester Park, the main three-mile (5 km) causeway has been adapted and preserved as a recreation area for cyclists, runners, and anglers. Two smaller marble rock-landfill causeways were also erected as part of this line that connected Grand Isle to North Hero, and spanned from North Hero to Alburgh.\n\n* The Alburgh, Vermont – Rouses Point, New York rail trestle. From sometime in the late 19th century until 1964, this wooden trestle carried two railroads (the Rutland Railroad and the Central Vermont Railroad) over the lake just south of the US 2 vehicular bridge. The iron swing bridge at the center (over the navigation channel) has been removed. Most of the wooden pilings remain and can be seen looking south from the US 2 bridge. Part of the trestle on the Rouses Point side has been converted for use as an access pier associated with the local marina.\n* The Swanton – Alburgh, Vermont rail trestle. Built in the same manner as at Rouses Point, it crosses the lake just south of Missisquoi Bay and the Canada–U.S. border, within yards south of the Vermont Route 78 bridge. It is still in use by the New England Central Railroad.\n\nWaterways\n\nLake Champlain has been connected to the Erie Canal via the Champlain Canal since the canal's official opening September 9, 1823, the same day as the opening of the Erie Canal from Rochester on Lake Ontario to Albany. It connects to the St. Lawrence River via the Richelieu River, with the Chambly Canal bypassing rapids on the river since 1843. Together with these waterways the lake is part of the Lakes to Locks Passage. The Lake Champlain Seaway, a project to use the lake to bring ocean-going ships from New York City to Montreal, was proposed in the late 19th century and considered as late as the 1960s, but rejected for various reasons. The lake is also part of the 740-mile Northern Forest Canoe Trail, which begins in Old Forge, New York, and ends in Fort Kent, Maine.\n\nSurroundings\n\nMajor cities\n\nBurlington, Vermont (pop. 42,217, 2010 Census) is the largest city on the lake. The 2nd and 3rd most populated cities/towns are Plattsburgh, New York, and South Burlington, Vermont, respectively. The fourth-largest community is the town of Colchester.\n\nIslands\n\nLake Champlain contains roughly 80 islands, three of which comprise four entire Vermont towns (most of Grand Isle County). The largest islands:\n\n*South Hero Island, the largest, containing the towns of Grand Isle, Vermont and South Hero, Vermont\n*North Hero Island, containing the town of North Hero, Vermont\n*Isle La Motte, containing the town of Isle La Motte, Vermont\n*Valcour Island, New York\n*Juniper Island (Lake Champlain)\n*Three Sisters\n*Four Brothers\n*Savage Island\n*Burton Island (State Park)\n*Cloak Island\n*Garden Island (Gunboat Island)\n*Crab Island, New York\n*Dameas Island\n*Hen Island\n*Butler's Island\n*Carleton's Prize\n*Young Island \n*Providence Island\n*Stave Island\n*Sunset Island\n\nLighthouses\n\n* Bluff Point Lighthouse, on Valcour Island near the New York shore, was built in 1871; it was manned by a full-time lightkeeper until 1930, making it one of the last lighthouses to be manned on the Lake\n* Cumberland Head Light, which operated until 1934, is an historic stone lighthouse located on Cumberland Head, which is privately owned\n* Isle La Motte lighthouse, on the northern end of the island was originally red, but it faded to pink over time; it is privately owned\n* Juniper Island Light is a cast iron lighthouse that dates from 1846; in 1954, it was deactivated and replaced by a steel tower; it is privately owned\n* On Point Au Roche, part of Beekmantown, New York, there is a privately owned, historic lighthouse\n* Split Rock Lighthouse is located south of Essex, New York, near a natural boundary of the territory between the Mohawk and Algonquin tribes\n\nAids to navigation\n\nAll active navigational aids on the American portion of the lake are maintained by USCG Burlington station, along with those on international Lake Memphremagog to the east.\n\nAids to navigation on the Canadian portion of the lake are maintained by the Canadian Coast Guard.\n\nParks\n\nThere are a number of parks in the Lake Champlain region in both New York and Vermont.\n\nThose on the New York side of the lake include: Point Au Roche State Park, which park grounds have hiking and cross country skiing trails, and a public beach; and the Ausable Point State Park. The Cumberland Bay State Park is located on Cumberland Head, with a campground, city beach, and sports fields.\n\nThere are various parks along the lake on the Vermont side, including Sand Bar State Park in Milton, featuring a 2000 ft natural sand beach, swimming, canoe and kayak rentals, food concession, picnic grounds and a play area. At 226 acre, Grand Isle State Park contains camping facilities, a sand volleyball court, a nature walk trail, a horseshoe pit and a play area. Button Bay State Park in Ferrisburgh features campsites, picnic areas, a nature center and a swimming pool. Burlington's Waterfront Park is a revitalized industrial area.\n\nPublic safety\n\nCoast Guard Station Burlington provides \"Search and Rescue, Law Enforcement and Ice Rescue services 24 hours a day, 365 days a year.\" Services are also provided by local, and state, and federal governments bordering on the lake, including the U.S. Border Patrol, Royal Canadian Mounted Police, Vermont State Police, New York State Police Marine Detail, and Vermont Fish and Wildlife wardens. Lake Champlain. http://en.wikipedia.org/?curid=18201."
  }
}
