{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=2494",
  "eid" : "c0a61900-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778402960,
  "textBody" : "The aurochs ( or; pl. aurochs, or rarely aurochsen, aurochses), also urus, ure (Bos primigenius), is an extinct species of large wild cattle that inhabited Europe, Asia, and North Africa. It is the ancestor of domestic cattle and the European bison, crossbred with Steppe bison. The species survived in Europe until the last recorded aurochs died in the Jaktorów Forest, Poland, in 1627.\n\nDuring the Neolithic Revolution, which occurred during the early Holocene, at least two aurochs domestication events occurred: one related to the Indian subspecies, leading to zebu cattle, and the other one related to the Eurasian subspecies, leading to taurine cattle. Other species of wild bovines were also domesticated, namely the wild water buffalo, gaur, wild yak and banteng. In modern cattle, numerous breeds share characteristics of the aurochs, such as a dark colour in the bulls with a light eel stripe along the back (the cows being lighter), or a typical aurochs-like horn shape.\n\nTaxonomy \n\nThe aurochs was variously classified as Bos primigenius, Bos taurus, or, in old sources, Bos urus. However, in 2003, the International Commission on Zoological Nomenclature \"conserved the usage of 17 specific names based on wild species, which are predated by or contemporary with those based on domestic forms\", confirming Bos primigenius for the aurochs. Taxonomists who consider domesticated cattle a subspecies of the wild aurochs should use B. primigenius taurus; those who consider domesticated cattle to be a separate species may use the name B. taurus, which the Commission has kept available for that purpose.\n\nEtymology \n\nThe words aurochs, urus, and wisent have all been used synonymously in English. However, the extinct aurochs/urus is a completely separate species from the still-extant wisent, also known as European bison. The two were often confused, and some 16th-century illustrations of aurochs and wisents have hybrid features.\nThe word urus (; plural uri) is a Latin word, but was borrowed into Latin from Germanic (cf. Old English/Old High German ūr, Old Norse úr). In German, OHG ūr was compounded with ohso \"ox\", giving ūrohso, which became early modern Aurochs. The modern form is Auerochse.\n\nThe word aurochs was borrowed from early modern German, replacing archaic urochs, also from an earlier form of German. The word is invariable in number in English, though sometimes back-formed singular auroch and innovated plural aurochses occur. The use in English of the plural form ' is nonstandard, but mentioned in The Cambridge Encyclopedia of the English Language. It is directly parallel to the German plural Ochsen (singular Ochse) and recreates by analogy the same distinction as English ox (singular) and oxen (plural).\n\nEvolution \n\nDuring the Pliocene, the colder climate caused an extension of open grassland, which led to the evolution of large grazers, such as wild bovines. Bos acutifrons is an extinct species of cattle that has been suggested as an ancestor for the aurochs.\n\nThe oldest aurochs remains have been dated to about 2 million years ago, in India. The Indian subspecies was the first to appear. During the Pleistocene, the species migrated west into the Middle East (western Asia), as well as to the east. They reached Europe about 270,000 years ago. The South Asian domestic cattle, or zebu, descended from Indian aurochs at the edge of the Thar Desert; the zebu is resistant to drought. Domestic yak, gayal, and Bali cattle do not descend from aurochs.\n\nThe first complete mitochondrial genome (16,338 base pairs) DNA sequence analysis of Bos primigenius from an archaeologically verified and exceptionally well preserved aurochs bone sample was published in 2010.\n\nThree wild subspecies of aurochs are recognised. Only the Eurasian subspecies survived until recent times.\n* The Eurasian aurochs (B. p. primigenius) once ranged across the steppes and taigas of Europe, Siberia and Central Asia, and East Asia. It is noted as part of the Pleistocene megafauna, and declined in numbers along with other megafauna species by the end of Pleistocene. The Eurasian aurochs were domesticated into modern taurine cattle breeds around the sixth millennium BC in the Middle East, and possibly also at about the same time in the Far East. Aurochs were still widespread in Europe during the time of the Roman Empire, when they were widely popular as a battle beast in Roman arenas. Excessive hunting began and continued until the species was nearly extinct. By the 13th century, aurochs existed only in small numbers in Eastern Europe, and the hunting of aurochs became a privilege of nobles, and later royal households. The aurochs were not saved from extinction, and the last recorded live aurochs, a female, died in 1627 in the Jaktorów Forest, Poland, from natural causes. Aurochs were found to have lived on the island of Sicily, having migrated via a land bridge from Italy. After the disappearance of the land bridge, Sicilian aurochs evolved to be 20% smaller than their mainland relatives due to insular dwarfism. Fossilized specimen were found in Japan, possibly herded with steppe bisons.\n* The Indian aurochs (B. p. namadicus) once inhabited India. It was the first subspecies of the aurochs to appear, at 2 million years ago, and from about 9000 years ago, it was domesticated as the zebu. Fossil remains indicate  wild Indian aurochs besides domesticated zebu cattle were in Gujarat and the Ganges area until about 4–5000 years ago. Remains from wild aurochs 4400 years old are clearly identified from Karnataka in South India.\n* The North African aurochs (B. p. africanus) once lived in the woodland and shrubland of North Africa. It descended from aurochs populations migrating from the Middle East. The North African aurochs was morphologically very similar to the Eurasian subspecies, so this taxon may exist only in a biogeographic sense. However, evidence indicates it was genetically distinct from the Eurasian subspecies. Depictions show that North African aurochs may have had a light saddle marking on its back. This subspecies may have been extinct before the Middle Ages.\n\nDescription \n\nThe appearance of the aurochs has been reconstructed from skeletal material, historical descriptions, and contemporaneous depictions, such as cave paintings, engravings, or Sigismund von Herberstein’s illustration. The work by Charles Hamilton Smith is a copy of a painting owned by a merchant in Augsburg, which may date to the 16th century. Scholars have proposed that Smith's illustration was based on a cattle/aurochs hybrid, or an aurochs-like breed. The aurochs was depicted in prehistoric cave paintings and described in Julius Caesar's The Gallic War, Book 6, Ch. 28.\n\nSize \n\nThe aurochs were one of the largest herbivores in postglacial Europe, comparable to the wisent (European bison). The size of an aurochs appears to have varied by region; in Europe, northern populations were bigger on average than those from the south. For example, during the Holocene, aurochs from Denmark and Germany had an average height at the shoulders of 155 – in bulls and  in cows, while aurochs populations in Hungary had bulls reaching 155 –. The body mass of aurochs appears to have shown some variability. Some individuals were comparable in weight to the wisent and the banteng, reaching around 700 kg, whereas those from the late-middle Pleistocene are estimated to have weighed up to 1500 kg, as much as the largest gaur (the largest extant bovid). The sexual dimorphism between bulls and cows was strongly expressed, with the cows being significantly shorter than bulls on average.\n\nHorns \n\nBecause of the massive horns, the frontal bones of aurochs were elongated and broad. The horns of the aurochs were characteristic in size, curvature, and orientation. They were curved in three directions: upwards and outwards at the base, then swinging forwards and inwards, then inwards and upwards. Aurochs horns could reach  in length and between  in diameter. The horns of bulls were larger, with the curvature more strongly expressed than in cows. The horns grew from the skull at a 60° angle to the muzzle, facing forwards.\n\nBody shape \n\nThe proportions and body shape of the aurochs were strikingly different from many modern cattle breeds. For example, the legs were considerably longer and more slender, resulting in a shoulder height that nearly equalled the trunk length. The skull, carrying the large horns, was substantially larger and more elongated than in most cattle breeds. As in other wild bovines, the body shape of the aurochs was athletic, and especially in bulls, showed a strongly expressed neck and shoulder musculature. Therefore, the fore hand was larger than the rear, similar to the wisent, but unlike many domesticated cattle. Even in carrying cows, the udder was small and hardly visible from the side; this feature is equal to that of other wild bovines.\n\nCoat colour \n\nThe coat colour of the aurochs can be reconstructed by using historical and contemporary depictions. In his letter to Conrad Gesner (1602), Anton Schneeberger describes the aurochs, a description that agrees with cave paintings in Lascaux and Chauvet. Calves were born a chestnut colour. Young bulls changed their coat colour at a few months old to a very deep brown or black, with a white eel stripe running down the spine. Cows retained the reddish-brown colour. Both sexes had a light-coloured muzzle. Some North African engravings show aurochs with a light-coloured \"saddle\" on the back, but otherwise  no evidence of variation in coat colour is seen throughout its range. A passage from Mucante (1596), describing the “wild ox” as gray, but is ambiguous and may refer to the wisent. Egyptian grave paintings show cattle with a reddish-brown coat colour in both sexes, with a light saddle, but the horn shape of these suggest that they may depict domesticated cattle. Remains of aurochs hair were not known until the early 1980s.\n\nColour of forelocks \n\nSome primitive cattle breeds display similar coat colours to the aurochs, including the black colour in bulls with a light eel stripe, a pale mouth, and similar sexual dimorphism in colour. A feature often attributed to the aurochs is blond forehead hairs. Historical descriptions tell that the aurochs had long and curly forehead hair, but none mentions a certain colour for it. Cis van Vuure (2005) says that, although the colour is present in a variety of primitive cattle breeds, it is probably a discolouration that appeared after domestication. The gene responsible for this feature has not yet been identified. Zebu breeds show lightly coloured inner sides of the legs and belly, caused by the so-called zebu-tipping gene. It has not been tested if this gene is present in remains of the wild form of the zebu, the Indian aurochs.\n\nBehaviour and ecology \n\nLike many bovids, aurochs formed herds for at least a part of the year. These probably did not number much more than 30. If aurochs had social behaviour similar to their descendents, social status was gained through displays and fights, in which cows engaged, as well as bulls. Indeed, aurochs bulls were reported to often have had severe fights. As in other wild cattle, ungulates that form unisexual herds, considerable sexual dimorphism was expressed. Ungulates that form herds containing animals of both sexes, such as horses, have more weakly developed sexual dimorphism.\n\nDuring the mating season, which probably took place during the late summer or early autumn, the bulls had severe fights, and evidence from the forest of Jaktorów shows these could lead to death. In autumn, aurochs fed up for the winter and got fatter and shinier than during the rest of the year, according to Schneeberger. Calves were born in spring. According to Schneeberger, the calf stayed at the cow's side until it was strong enough to join and keep up with the herd on the feeding grounds.\n\nCalves were vulnerable to wolves and, to an extent, bears, while healthy adult aurochs probably did not have to fear these predators. In prehistoric Europe, North Africa, and Asia, big cats, such as lions and tigers, and hyenas were additional predators that probably preyed on aurochs.\n\nHistorical descriptions, like Caesar’s Commentarii de Bello Gallico or Schneeberger, tell that aurochs were swift and fast, and could be very aggressive. According to Schneeberger, aurochs were not concerned when a man approached, but when teased or hunted, an aurochs could get very aggressive and dangerous, and throw the teasing person into the air, as he described in a 1602 letter to Gesner.\n\nHabitat and distribution \n\nNo consensus exists concerning the habitat of the aurochs. While some authors think that the habitat selection of the aurochs was comparable to the African forest buffalo, others describe the species as inhabiting open grassland and helping maintain open areas by grazing, together with other large herbivores. With its hypsodont jaw, the aurochs was probably a grazer and had a food selection very similar to domesticated cattle. It was not a browser like many deer species, nor a semi-intermediary feeder like the wisent. Comparisons of the isotope levels of Mesolithic aurochs and domestic cattle bones showed that aurochs probably inhabited wetter areas than domestic cattle. Schneeberger describes that during winter, the aurochs ate twigs and acorns in addition to grasses.\n\nAfter the beginning of the Common Era, the habitat of aurochs became more fragmented because of the steadily growing human population. During the last centuries of its existence, the aurochs was limited to remote regions, such as floodplain forests or marshes, with no competing domestic herbivores and less hunting pressure.\n\nRelationship with humans \n\nDomestication \n\nThe aurochs, which ranged throughout much of Eurasia and Northern Africa during the late Pleistocene and early Holocene, is the wild ancestor of modern cattle. Archaeological evidence shows that domestication occurred independently in the Near East and the Indian subcontinent between 10,000 and 8,000 years ago, giving rise to the two major domestic taxa observed today: humpless Bos taurus (taurine) and humped Bos indicus (zebu), respectively. This is confirmed by genetic analyses of matrilineal mitochondrial DNA sequences, which reveal a marked differentiation between modern B. taurus and B. indicus haplotypes, demonstrating their derivation from two geographically and genetically divergent wild populations. A third domestication event possibly occurred from another form of the aurochs in Africa. The sanga cattle, a zebu-like cattle with no back hump, is commonly believed to originate from crosses between humped zebus with taurine cattle breeds. However, some archaeological evidence indicates these cattle were domesticated independently in Africa and that bloodlines of taurine and zebu cattle were introduced only within the last few hundreds years.\n\nDomestication of the aurochs began in the southern Caucasus and northern Mesopotamia from about the sixth millennium BC. Genetic evidence suggests that aurochs were independently domesticated in India and possibly also in northern Africa. Domesticated cattle and aurochs are so different in size that they have been regarded as separate species; however, large ancient cattle and aurochs have more similar morphological characteristics, with significant differences only in the horns and some parts of the cranium.\n\nA mitochondrial DNA study suggests that all domesticated taurine cattle originated from about 80 wild female aurochs in the Near East.\n\nComparison of aurochs bones with those of modern cattle has provided many insights about the aurochs. Remains of the beast, from specimens believed to have weighed more than a ton, have been found in Mesolithic sites around Goldcliff, Wales.\nThough aurochs became extinct in Britain during the Bronze Age, analysis of bones from aurochs that lived about the same time as domesticated cattle traditionally suggested no genetic contribution to modern breeds. More recent work has pointed to substantial aurochs contributions to indigenous British cattle breeds, with the most material found in Kerry cattle.\n\nIndian zebu, although domesticated eight to ten thousand years ago, are related to aurochs that diverged from the Near Eastern ones some 200,000 years ago. African cattle are thought to have descended from aurochs more closely related to the Near Eastern ones. The Near East and African aurochs groups are thought to have split some 25,000 years ago, probably 15,000 years before domestication. The \"Turano-Mongolian\" type of cattle now found in northern China, Mongolia, Korea, and Japan may represent a fourth domestication event (and a third event among B. taurus–type aurochs). This group may have diverged from the Near East group some 35,000 years ago. Whether these separate genetic populations would have equated to separate subspecies is unclear.\n\nThe maximum range of the aurochs was from Europe (excluding Ireland and northern Scandinavia), to northern Africa, the Middle East, India, and Central Asia. Until at least 3,000 years ago, the aurochs was also found in eastern China, where it is recorded at the Dingjiabao Reservoir in Yangyuan County. Most remains in China are known from the area east of 105°E, but the species has also been reported from the eastern margin of the Tibetan plateau, close to the Heihe River. In Japan, excavations in various locations such as in Iwate and Tochigi prefectures have found aurochs which may have herded with steppe bisons.\n\nExtinction \n\nAlready in the times of Herodotus (fifth century BC), aurochs had disappeared from southern Greece, but remained common in the area north and east of Echedorus River close to modern Thessaloniki.\"Ηρόδοτος\" 5th century BC: Πολύμνια. Last reports of the species in the southern tip of the Balkans date to the first century BC when Varro reported that fierce wild oxen live in Dardania (southern Serbia) and Thrace.Kitchell, K.F. 2013: Animals in the Ancient Word from A to Z. By the 13th century AD, the aurochs' range was restricted to Poland, Lithuania, Moldavia, Transylvania, and East Prussia. The right to hunt large animals on any land was restricted first to nobles, and then gradually, to only the royal households. As the population of aurochs declined, hunting ceased, and the royal court used gamekeepers to provide open fields for grazing for the aurochs. The gamekeepers were exempted from local taxes in exchange for their service. Poaching aurochs was punishable by death.\n\nAccording to a Polish royal survey in 1564, the gamekeepers knew of 38 animals. The last recorded live aurochs, a female, died in 1627 in the Jaktorów Forest, Poland, from natural causes. The causes of extinction were unrestricted hunting, a narrowing of habitat due to the development of farming, and diseases transmitted by domesticated cattle.\n\nBreeding of aurochs-like cattle \n\nWhile all the wild subspecies are extinct, B. primigenius lives on in domesticated cattle, and attempts are being made to breed similar types suitable for filling the extinct subspecies' role in the wild.\n\nThe idea of breeding back the aurochs was first proposed in the 19th century by Feliks Paweł Jarocki. In the 1920s, a first attempt was undertaken by the Heck brothers in Germany with the aim of breeding an effigy (a look-alike) of the aurochs. Starting in the 1990s, grazing and rewilding projects brought new impetus to the idea and new breeding-back efforts came underway, this time with the aim of recreating an animal not only with the looks, but also with the behaviour and the ecological impact of the aurochs, to be able to fill the ecological role of the aurochs.\n\nHeck cattle \n\nIn the early 1920s, two German zoo directors (in Berlin and Munich), the brothers Heinz and Lutz Heck, began a selective breeding program to breed back the aurochs into existence from the descendant domesticated cattle. Their plan was based on the concept that a species is not extinct as long as all its genes are still present in a living population. The result is the breed called Heck cattle. It resembles what is known about the appearance of the aurochs in colour, and in some cases, also horn shape.\n\nTaurus Project \n\nThe Arbeitsgemeinschaft Biologischer Umweltschutz, a conservation group in Germany, started to crossbreed Heck cattle with southern-European primitive breeds in 1996, with the goal of increasing the aurochs-likeness of certain Heck cattle herds. These crossbreeds are called Taurus cattle. It is intended to bring in aurochs-like features that are supposedly missing in Heck cattle using Sayaguesa Cattle and Chianina, and to a lesser extent Spanish Fighting Cattle (Lidia). The same breeding program is being carried out in Latvia, in Lille Vildmose National Park in Denmark, and in the Hungarian Hortobágy National Park. The program in Hungary also includes Hungarian Grey cattle and Watusi.\n\nTauros Programme \n\nThe Dutch-based Tauros Programme, (initially TaurOs Project) is trying to DNA-sequence breeds of primitive cattle to find gene sequences that match those found in \"ancient DNA\" from aurochs samples. The modern cattle would be selectively bred to try to produce the aurochs-type genes in a single animal. Starting around 2007, Tauros Programme selected a number of primitive breeds mainly from Iberia and Italy, such as Sayaguesa cattle, Maremmana primitivo, Pajuna cattle, Limia cattle, Maronesa cattle, Tudanca cattle, and others, which already bear considerable resemblance to the aurochs in certain features. Tauros Programme started collaborations with Rewilding Europe and European Wildlife, two European organizations for ecological restoration and rewilding, and now has breeding herds not only in the Netherlands but also in Portugal, Croatia, Romania, and the Czech Republic. Numerous crossbred calves of the first, second, and third offspring generations have already been born.\n\nUruz Project \n\nA further back-breeding effort, the Uruz project, was started in 2013 by the True Nature Foundation, an organization for ecological restoration and rewilding. It differs from the other projects in that it is planning to make use of genome editing. Its preliminary plans called for the use of Sayaguesa, Maremmana primitive, or Hungarian Grey (Steppe) cattle, and Texas Longhorn with wildtype colour or Barrosã cattle. The finalised plans now call for setting up two breeding lines, Sayaguesa × Maremmana primitiva/Hungarian Steppe cattle and Watusi × Chianina, and later crossing these lines. Two Watusi × Chianina breeding herds have been set up in Boxmeer and Breda in the Netherlands, another herd using Barrosã is being set up in northern Portugal.\n\nAuerrind Project \n\nThe newest of the back-breeding efforts, the Auerrindprojekt,Wiktionary: AuerrindLorsch Abbey website: [http://www.kloster-lorsch.de/en/lauresham0/auerrinder/ “The Aurcattle project.”] Retrieved 5 June 2017. was started in 2015 as a conjoint effort of the Experimentalarchäologisches Freilichtlabor Lauresham (Lauresham Experimental-Archaeological Open-air Laboratory, run by Lorsch Abbey), the Förderkreis Große Pflanzenfresser im Kreis Bergstraße e.V. (Promoting Association Megaherbivores in Bergstraße District) and the Landschaftspflegebetrieb Hohmeyer (Landscape Preservation Company Hohmeyer). In accordance with the breeding aims, the Auerrindprojekt has already set up two breeding herds of Watusi × Chianina and one breeding herd of Sayaguesa x Podolian cattle; a second breeding herd of Sayaguesa × Podolian cattle will be started in 2017.\n\nOther projects \n\nScientists of the Polish Foundation for Recreating the Aurochs (PFOT) in Poland hope to use DNA from bones in museums to recreate the aurochs. They plan to return this animal to the forests of Poland. The project has gained the support of the Polish Ministry of the Environment. They plan research on ancient preserved DNA. Other research projects  have extracted \"ancient\" DNA over the past 20 years and their results have been published in such periodicals as Nature and PNAS. Polish scientists Ryszard Słomski and Jacek A. Modliński believe that modern genetics and biotechnology make it possible to recreate an animal almost identical to the aurochs. They say this research will lead to examining the causes of the extinction of the aurochs, and help prevent a similar occurrence with domesticated cattle.\n\nBreeding back the aurochs \n\nApproaches that aim to breed an aurochs-like phenotype do not equate to an aurochs-like genotype. In 2015, researchers mapped the draft genome of a British aurochs dated to 6,750 years before present. Researchers compared the genome to the genomes of 73 modern cattle populations and found in traditional or landrace cattle breeds of Scottish, Irish, Welsh, and English origin – such as Highland, Dexter, Kerry, Welsh Black, and White Park – carry the ancestry of the sequenced aurochs, but the other populations did not. Another study concluded that because of this genomic introgression of the aurochs into these breeds, if this reflects \"the bigger picture across the aurochs/cattle range, perhaps several subpopulations of aurochs are not extinct at all.\" The study proposed that it will be possible to consider breeding back cattle \"that are genetically akin to specific original aurochs populations, through selective cross-breeding of local cattle breeds bearing local aurochs-genome ancestry.\"\n\nCultural significance \n\nThe aurochs was an important game animal appearing in both Paleolithic European and Mesopotamian cave paintings, such as those found at Lascaux and Livernon in France. Aurochs existed into the Iron Age in Anatolia and the Near East, where it was worshiped as a sacred animal, the Lunar Bull, associated with the Great Goddess and later with Mithras. In 2012, an archaeological mission of the British Museum, led by Lebanese archaeologist Claude Doumet Serhal, discovered at the site of the old American school in Sidon, Lebanon, the remains of wild animal bones, including those of an aurochs, dating from the late-fourth to early-third millennium. A 1999 archaeological dig in Peterborough, England, uncovered the skull of an aurochs. The front part of the skull had been removed, but the horns remained attached. The supposition is that the killing of the aurochs in this instance was a sacrificial act.\n\nAlso during antiquity, the aurochs was regarded as an animal of cultural value. Aurochs are depicted on the Ishtar Gate. In the Peloponnese there is a 15th-century BC depiction on the so-called violent cup of Vaphio, of hunters trying to capture with nets three wild bulls being probably aurochs, in a possibly Cretan date palm stand. The one of the bulls throws one hunter on the ground while attacking the second with its horns. The cup despite the older perception of being Minoan seems to be Mycenaean. Greeks and Paeonians were hunting aurochs (wild oxen/bulls) and used their huge horns as trophies, cups for wine, and offers to the gods and heroes. For example, as mentioned by Samus, Philippus of Thessalonica and Antipater when Philip V of Macedon killed an aurochs on the foothills of mountain Orvilos, he offered the horns which were 105 cm long and the skin to a temple of Hercules.Douglas, N. 1927: Birds and Beasts of the Greek Anthology. Florence. Aurochs horns were often used by Romans as hunting horns. Aurochs were among those wild animals caught for fights (venationes) in arenas. Julius Caesar described aurochs in Gaul:\n\nThe Hebrew Bible contains numerous references to the untameable strength of re'em, translated as \"bullock\" or \"wild-ox\" in Jewish translations and translated rather poorly in the King James Version as \"unicorn\", but recognised from the last century by Hebrew scholars as the aurochs.\n\nWhen the aurochs became rarer, hunting it became a privilege of the nobility and a sign of a high social status. The \"Nibelungenlied\" describes Siegfried killing aurochs: \"Darnach schlug er schiere einen Wisent und einen Elch, starker Ure viere und einen grimmen Schelch\", meaning \"After that, he defeated one wisent and one elk, four aurochs, and one Schelch\" - the background of the \"Schelch\" is dubious. Aurochs horns were commonly used as drinking horns by the nobility, which led to the fact that many aurochs horn sheaths are preserved today (albeit often discoloured). The drinking horn at Corpus Christi College, Cambridge, given to the college on its foundation in 1352, probably by the college's founders, the Guilds of Corpus Christi and the Blessed Virgin Mary, is thought to come from an aurochs. A painting by Willem Kalf depicts an aurochs horn. The horns of the last aurochs bulls, which died in 1620, were ornamented with gold and are located at the Livrustkammaren in Stockholm today.\n\nSchneeberger writes that aurochs were hunted with arrows, nets, and hunting dogs. With immobilised aurochs, a ritual was practised that might be regarded as cruel nowadays: the curly hair on the forehead was cut from the skull of the living animal. Belts were made out of this hair and were believed to increase the fertility of women. When the aurochs was slaughtered, a cross-like bone (os cardis) was extracted from the heart. This bone, which is also present in domesticated cattle, contributed to the mystique of the animal and magical powers have been attributed to it.\n\nIn eastern Europe, where it survived until nearly 400 years ago, the aurochs has left traces in fixed expressions. In Russia, a drunken person behaving badly was described as \"behaving like an aurochs\", whereas in Poland, big, strong people were characterized as being \"a bloke like an aurochs\".\n\nIn Central Europe, the aurochs features in toponyms and heraldic coats of arms. For example, the names Ursenbach and Aurach am Hongar are derived from the aurochs. An aurochs head, the traditional arms of the German region Mecklenburg, figures in the coat of arms of Mecklenburg-Vorpommern. The aurochs (Romanian bour, from Latin būbalus) was also the symbol of Moldavia; nowadays, they can be found in the coat of arms of both Romania and Moldova. An aurochs head is featured on an 1858 series of Moldavian stamps, the so-called Bull's Heads (cap de bour in Romanian), renowned for their rarity and price among collectors. In Romania there are still villages named Boureni, after the Romanian word for the auroch. The horn of the aurochs is a charge of the coat of arms of Tauragė, Lithuania, (the name of Tauragė is a compound of taũras \"auroch\" and ragas \"horn\"). It is also present in the emblem of Kaunas, Lithuania, and was part of the emblem of Bukovina during its time as an Austro-Hungarian Kronland. The Swiss Canton of Uri is named after the aurochs; its yellow flag shows a black aurochs head. East Slavic surnames Turenin, Turishchev, Turov, and Turovsky originate from the Slavic name of the species tur. In Slovakia,  toponyms such as Turany, Turíčky, Turie, Turie Pole, Turík, Turová (villages), Turiec (river and region), Turská dolina (valley) and others are used. Turopolje, a large lowland floodplain south of the Sava River in Croatia, got its name from the once-abundant aurochs (Croatian: ). The ancient name of the Estonian town of Rakvere, Tarwanpe or Tarvanpea, probably derives from \"Aurochs head\" (Tarvan pea) in ancient Estonian.\n\nIn 2002, a 3.5-m-high and 7.1-m-long statue of an aurochs was erected in Rakvere, Estonia, for the town's 700th birthday. The sculpture, by artist Tauno Kangro, has become a symbol of the town.\n\nAurochs are frequently mentioned in the A Song of Ice and Fire series of fantasy novels by George R. R. Martin; in particular, roasted aurochs are sometimes served at banquets.\n\nIn the 2012 movie Beasts of the Southern Wild, the six-year-old main character imagines aurochs, though the fantasy creatures are portrayed by \"costumed\" Vietnamese Pot-bellied piglets.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Aurochs" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=2494" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The aurochs ( or; pl. aurochs, or rarely aurochsen, aurochses), also urus, ure (Bos primigenius), is an extinct species of large wild cattle that inhabited Europe, Asia, and North Africa. It is the ancestor of domestic cattle and the European bison, crossbred with Steppe bison. The species survived in Europe until the last recorded aurochs died in the Jaktorów Forest, Poland, in 1627.\n\nDuring the Neolithic Revolution, which occurred during the early Holocene, at least two aurochs domestication events occurred: one related to the Indian subspecies, leading to zebu cattle, and the other one related to the Eurasian subspecies, leading to taurine cattle. Other species of wild bovines were also domesticated, namely the wild water buffalo, gaur, wild yak and banteng. In modern cattle, numerous breeds share characteristics of the aurochs, such as a dark colour in the bulls with a light eel stripe along the back (the cows being lighter), or a typical aurochs-like horn shape.\n\nTaxonomy \n\nThe aurochs was variously classified as Bos primigenius, Bos taurus, or, in old sources, Bos urus. However, in 2003, the International Commission on Zoological Nomenclature \"conserved the usage of 17 specific names based on wild species, which are predated by or contemporary with those based on domestic forms\", confirming Bos primigenius for the aurochs. Taxonomists who consider domesticated cattle a subspecies of the wild aurochs should use B. primigenius taurus; those who consider domesticated cattle to be a separate species may use the name B. taurus, which the Commission has kept available for that purpose.\n\nEtymology \n\nThe words aurochs, urus, and wisent have all been used synonymously in English. However, the extinct aurochs/urus is a completely separate species from the still-extant wisent, also known as European bison. The two were often confused, and some 16th-century illustrations of aurochs and wisents have hybrid features.\nThe word urus (; plural uri) is a Latin word, but was borrowed into Latin from Germanic (cf. Old English/Old High German ūr, Old Norse úr). In German, OHG ūr was compounded with ohso \"ox\", giving ūrohso, which became early modern Aurochs. The modern form is Auerochse.\n\nThe word aurochs was borrowed from early modern German, replacing archaic urochs, also from an earlier form of German. The word is invariable in number in English, though sometimes back-formed singular auroch and innovated plural aurochses occur. The use in English of the plural form ' is nonstandard, but mentioned in The Cambridge Encyclopedia of the English Language. It is directly parallel to the German plural Ochsen (singular Ochse) and recreates by analogy the same distinction as English ox (singular) and oxen (plural).\n\nEvolution \n\nDuring the Pliocene, the colder climate caused an extension of open grassland, which led to the evolution of large grazers, such as wild bovines. Bos acutifrons is an extinct species of cattle that has been suggested as an ancestor for the aurochs.\n\nThe oldest aurochs remains have been dated to about 2 million years ago, in India. The Indian subspecies was the first to appear. During the Pleistocene, the species migrated west into the Middle East (western Asia), as well as to the east. They reached Europe about 270,000 years ago. The South Asian domestic cattle, or zebu, descended from Indian aurochs at the edge of the Thar Desert; the zebu is resistant to drought. Domestic yak, gayal, and Bali cattle do not descend from aurochs.\n\nThe first complete mitochondrial genome (16,338 base pairs) DNA sequence analysis of Bos primigenius from an archaeologically verified and exceptionally well preserved aurochs bone sample was published in 2010.\n\nThree wild subspecies of aurochs are recognised. Only the Eurasian subspecies survived until recent times.\n* The Eurasian aurochs (B. p. primigenius) once ranged across the steppes and taigas of Europe, Siberia and Central Asia, and East Asia. It is noted as part of the Pleistocene megafauna, and declined in numbers along with other megafauna species by the end of Pleistocene. The Eurasian aurochs were domesticated into modern taurine cattle breeds around the sixth millennium BC in the Middle East, and possibly also at about the same time in the Far East. Aurochs were still widespread in Europe during the time of the Roman Empire, when they were widely popular as a battle beast in Roman arenas. Excessive hunting began and continued until the species was nearly extinct. By the 13th century, aurochs existed only in small numbers in Eastern Europe, and the hunting of aurochs became a privilege of nobles, and later royal households. The aurochs were not saved from extinction, and the last recorded live aurochs, a female, died in 1627 in the Jaktorów Forest, Poland, from natural causes. Aurochs were found to have lived on the island of Sicily, having migrated via a land bridge from Italy. After the disappearance of the land bridge, Sicilian aurochs evolved to be 20% smaller than their mainland relatives due to insular dwarfism. Fossilized specimen were found in Japan, possibly herded with steppe bisons.\n* The Indian aurochs (B. p. namadicus) once inhabited India. It was the first subspecies of the aurochs to appear, at 2 million years ago, and from about 9000 years ago, it was domesticated as the zebu. Fossil remains indicate  wild Indian aurochs besides domesticated zebu cattle were in Gujarat and the Ganges area until about 4–5000 years ago. Remains from wild aurochs 4400 years old are clearly identified from Karnataka in South India.\n* The North African aurochs (B. p. africanus) once lived in the woodland and shrubland of North Africa. It descended from aurochs populations migrating from the Middle East. The North African aurochs was morphologically very similar to the Eurasian subspecies, so this taxon may exist only in a biogeographic sense. However, evidence indicates it was genetically distinct from the Eurasian subspecies. Depictions show that North African aurochs may have had a light saddle marking on its back. This subspecies may have been extinct before the Middle Ages.\n\nDescription \n\nThe appearance of the aurochs has been reconstructed from skeletal material, historical descriptions, and contemporaneous depictions, such as cave paintings, engravings, or Sigismund von Herberstein’s illustration. The work by Charles Hamilton Smith is a copy of a painting owned by a merchant in Augsburg, which may date to the 16th century. Scholars have proposed that Smith's illustration was based on a cattle/aurochs hybrid, or an aurochs-like breed. The aurochs was depicted in prehistoric cave paintings and described in Julius Caesar's The Gallic War, Book 6, Ch. 28.\n\nSize \n\nThe aurochs were one of the largest herbivores in postglacial Europe, comparable to the wisent (European bison). The size of an aurochs appears to have varied by region; in Europe, northern populations were bigger on average than those from the south. For example, during the Holocene, aurochs from Denmark and Germany had an average height at the shoulders of 155 – in bulls and  in cows, while aurochs populations in Hungary had bulls reaching 155 –. The body mass of aurochs appears to have shown some variability. Some individuals were comparable in weight to the wisent and the banteng, reaching around 700 kg, whereas those from the late-middle Pleistocene are estimated to have weighed up to 1500 kg, as much as the largest gaur (the largest extant bovid). The sexual dimorphism between bulls and cows was strongly expressed, with the cows being significantly shorter than bulls on average.\n\nHorns \n\nBecause of the massive horns, the frontal bones of aurochs were elongated and broad. The horns of the aurochs were characteristic in size, curvature, and orientation. They were curved in three directions: upwards and outwards at the base, then swinging forwards and inwards, then inwards and upwards. Aurochs horns could reach  in length and between  in diameter. The horns of bulls were larger, with the curvature more strongly expressed than in cows. The horns grew from the skull at a 60° angle to the muzzle, facing forwards.\n\nBody shape \n\nThe proportions and body shape of the aurochs were strikingly different from many modern cattle breeds. For example, the legs were considerably longer and more slender, resulting in a shoulder height that nearly equalled the trunk length. The skull, carrying the large horns, was substantially larger and more elongated than in most cattle breeds. As in other wild bovines, the body shape of the aurochs was athletic, and especially in bulls, showed a strongly expressed neck and shoulder musculature. Therefore, the fore hand was larger than the rear, similar to the wisent, but unlike many domesticated cattle. Even in carrying cows, the udder was small and hardly visible from the side; this feature is equal to that of other wild bovines.\n\nCoat colour \n\nThe coat colour of the aurochs can be reconstructed by using historical and contemporary depictions. In his letter to Conrad Gesner (1602), Anton Schneeberger describes the aurochs, a description that agrees with cave paintings in Lascaux and Chauvet. Calves were born a chestnut colour. Young bulls changed their coat colour at a few months old to a very deep brown or black, with a white eel stripe running down the spine. Cows retained the reddish-brown colour. Both sexes had a light-coloured muzzle. Some North African engravings show aurochs with a light-coloured \"saddle\" on the back, but otherwise  no evidence of variation in coat colour is seen throughout its range. A passage from Mucante (1596), describing the “wild ox” as gray, but is ambiguous and may refer to the wisent. Egyptian grave paintings show cattle with a reddish-brown coat colour in both sexes, with a light saddle, but the horn shape of these suggest that they may depict domesticated cattle. Remains of aurochs hair were not known until the early 1980s.\n\nColour of forelocks \n\nSome primitive cattle breeds display similar coat colours to the aurochs, including the black colour in bulls with a light eel stripe, a pale mouth, and similar sexual dimorphism in colour. A feature often attributed to the aurochs is blond forehead hairs. Historical descriptions tell that the aurochs had long and curly forehead hair, but none mentions a certain colour for it. Cis van Vuure (2005) says that, although the colour is present in a variety of primitive cattle breeds, it is probably a discolouration that appeared after domestication. The gene responsible for this feature has not yet been identified. Zebu breeds show lightly coloured inner sides of the legs and belly, caused by the so-called zebu-tipping gene. It has not been tested if this gene is present in remains of the wild form of the zebu, the Indian aurochs.\n\nBehaviour and ecology \n\nLike many bovids, aurochs formed herds for at least a part of the year. These probably did not number much more than 30. If aurochs had social behaviour similar to their descendents, social status was gained through displays and fights, in which cows engaged, as well as bulls. Indeed, aurochs bulls were reported to often have had severe fights. As in other wild cattle, ungulates that form unisexual herds, considerable sexual dimorphism was expressed. Ungulates that form herds containing animals of both sexes, such as horses, have more weakly developed sexual dimorphism.\n\nDuring the mating season, which probably took place during the late summer or early autumn, the bulls had severe fights, and evidence from the forest of Jaktorów shows these could lead to death. In autumn, aurochs fed up for the winter and got fatter and shinier than during the rest of the year, according to Schneeberger. Calves were born in spring. According to Schneeberger, the calf stayed at the cow's side until it was strong enough to join and keep up with the herd on the feeding grounds.\n\nCalves were vulnerable to wolves and, to an extent, bears, while healthy adult aurochs probably did not have to fear these predators. In prehistoric Europe, North Africa, and Asia, big cats, such as lions and tigers, and hyenas were additional predators that probably preyed on aurochs.\n\nHistorical descriptions, like Caesar’s Commentarii de Bello Gallico or Schneeberger, tell that aurochs were swift and fast, and could be very aggressive. According to Schneeberger, aurochs were not concerned when a man approached, but when teased or hunted, an aurochs could get very aggressive and dangerous, and throw the teasing person into the air, as he described in a 1602 letter to Gesner.\n\nHabitat and distribution \n\nNo consensus exists concerning the habitat of the aurochs. While some authors think that the habitat selection of the aurochs was comparable to the African forest buffalo, others describe the species as inhabiting open grassland and helping maintain open areas by grazing, together with other large herbivores. With its hypsodont jaw, the aurochs was probably a grazer and had a food selection very similar to domesticated cattle. It was not a browser like many deer species, nor a semi-intermediary feeder like the wisent. Comparisons of the isotope levels of Mesolithic aurochs and domestic cattle bones showed that aurochs probably inhabited wetter areas than domestic cattle. Schneeberger describes that during winter, the aurochs ate twigs and acorns in addition to grasses.\n\nAfter the beginning of the Common Era, the habitat of aurochs became more fragmented because of the steadily growing human population. During the last centuries of its existence, the aurochs was limited to remote regions, such as floodplain forests or marshes, with no competing domestic herbivores and less hunting pressure.\n\nRelationship with humans \n\nDomestication \n\nThe aurochs, which ranged throughout much of Eurasia and Northern Africa during the late Pleistocene and early Holocene, is the wild ancestor of modern cattle. Archaeological evidence shows that domestication occurred independently in the Near East and the Indian subcontinent between 10,000 and 8,000 years ago, giving rise to the two major domestic taxa observed today: humpless Bos taurus (taurine) and humped Bos indicus (zebu), respectively. This is confirmed by genetic analyses of matrilineal mitochondrial DNA sequences, which reveal a marked differentiation between modern B. taurus and B. indicus haplotypes, demonstrating their derivation from two geographically and genetically divergent wild populations. A third domestication event possibly occurred from another form of the aurochs in Africa. The sanga cattle, a zebu-like cattle with no back hump, is commonly believed to originate from crosses between humped zebus with taurine cattle breeds. However, some archaeological evidence indicates these cattle were domesticated independently in Africa and that bloodlines of taurine and zebu cattle were introduced only within the last few hundreds years.\n\nDomestication of the aurochs began in the southern Caucasus and northern Mesopotamia from about the sixth millennium BC. Genetic evidence suggests that aurochs were independently domesticated in India and possibly also in northern Africa. Domesticated cattle and aurochs are so different in size that they have been regarded as separate species; however, large ancient cattle and aurochs have more similar morphological characteristics, with significant differences only in the horns and some parts of the cranium.\n\nA mitochondrial DNA study suggests that all domesticated taurine cattle originated from about 80 wild female aurochs in the Near East.\n\nComparison of aurochs bones with those of modern cattle has provided many insights about the aurochs. Remains of the beast, from specimens believed to have weighed more than a ton, have been found in Mesolithic sites around Goldcliff, Wales.\nThough aurochs became extinct in Britain during the Bronze Age, analysis of bones from aurochs that lived about the same time as domesticated cattle traditionally suggested no genetic contribution to modern breeds. More recent work has pointed to substantial aurochs contributions to indigenous British cattle breeds, with the most material found in Kerry cattle.\n\nIndian zebu, although domesticated eight to ten thousand years ago, are related to aurochs that diverged from the Near Eastern ones some 200,000 years ago. African cattle are thought to have descended from aurochs more closely related to the Near Eastern ones. The Near East and African aurochs groups are thought to have split some 25,000 years ago, probably 15,000 years before domestication. The \"Turano-Mongolian\" type of cattle now found in northern China, Mongolia, Korea, and Japan may represent a fourth domestication event (and a third event among B. taurus–type aurochs). This group may have diverged from the Near East group some 35,000 years ago. Whether these separate genetic populations would have equated to separate subspecies is unclear.\n\nThe maximum range of the aurochs was from Europe (excluding Ireland and northern Scandinavia), to northern Africa, the Middle East, India, and Central Asia. Until at least 3,000 years ago, the aurochs was also found in eastern China, where it is recorded at the Dingjiabao Reservoir in Yangyuan County. Most remains in China are known from the area east of 105°E, but the species has also been reported from the eastern margin of the Tibetan plateau, close to the Heihe River. In Japan, excavations in various locations such as in Iwate and Tochigi prefectures have found aurochs which may have herded with steppe bisons.\n\nExtinction \n\nAlready in the times of Herodotus (fifth century BC), aurochs had disappeared from southern Greece, but remained common in the area north and east of Echedorus River close to modern Thessaloniki.\"Ηρόδοτος\" 5th century BC: Πολύμνια. Last reports of the species in the southern tip of the Balkans date to the first century BC when Varro reported that fierce wild oxen live in Dardania (southern Serbia) and Thrace.Kitchell, K.F. 2013: Animals in the Ancient Word from A to Z. By the 13th century AD, the aurochs' range was restricted to Poland, Lithuania, Moldavia, Transylvania, and East Prussia. The right to hunt large animals on any land was restricted first to nobles, and then gradually, to only the royal households. As the population of aurochs declined, hunting ceased, and the royal court used gamekeepers to provide open fields for grazing for the aurochs. The gamekeepers were exempted from local taxes in exchange for their service. Poaching aurochs was punishable by death.\n\nAccording to a Polish royal survey in 1564, the gamekeepers knew of 38 animals. The last recorded live aurochs, a female, died in 1627 in the Jaktorów Forest, Poland, from natural causes. The causes of extinction were unrestricted hunting, a narrowing of habitat due to the development of farming, and diseases transmitted by domesticated cattle.\n\nBreeding of aurochs-like cattle \n\nWhile all the wild subspecies are extinct, B. primigenius lives on in domesticated cattle, and attempts are being made to breed similar types suitable for filling the extinct subspecies' role in the wild.\n\nThe idea of breeding back the aurochs was first proposed in the 19th century by Feliks Paweł Jarocki. In the 1920s, a first attempt was undertaken by the Heck brothers in Germany with the aim of breeding an effigy (a look-alike) of the aurochs. Starting in the 1990s, grazing and rewilding projects brought new impetus to the idea and new breeding-back efforts came underway, this time with the aim of recreating an animal not only with the looks, but also with the behaviour and the ecological impact of the aurochs, to be able to fill the ecological role of the aurochs.\n\nHeck cattle \n\nIn the early 1920s, two German zoo directors (in Berlin and Munich), the brothers Heinz and Lutz Heck, began a selective breeding program to breed back the aurochs into existence from the descendant domesticated cattle. Their plan was based on the concept that a species is not extinct as long as all its genes are still present in a living population. The result is the breed called Heck cattle. It resembles what is known about the appearance of the aurochs in colour, and in some cases, also horn shape.\n\nTaurus Project \n\nThe Arbeitsgemeinschaft Biologischer Umweltschutz, a conservation group in Germany, started to crossbreed Heck cattle with southern-European primitive breeds in 1996, with the goal of increasing the aurochs-likeness of certain Heck cattle herds. These crossbreeds are called Taurus cattle. It is intended to bring in aurochs-like features that are supposedly missing in Heck cattle using Sayaguesa Cattle and Chianina, and to a lesser extent Spanish Fighting Cattle (Lidia). The same breeding program is being carried out in Latvia, in Lille Vildmose National Park in Denmark, and in the Hungarian Hortobágy National Park. The program in Hungary also includes Hungarian Grey cattle and Watusi.\n\nTauros Programme \n\nThe Dutch-based Tauros Programme, (initially TaurOs Project) is trying to DNA-sequence breeds of primitive cattle to find gene sequences that match those found in \"ancient DNA\" from aurochs samples. The modern cattle would be selectively bred to try to produce the aurochs-type genes in a single animal. Starting around 2007, Tauros Programme selected a number of primitive breeds mainly from Iberia and Italy, such as Sayaguesa cattle, Maremmana primitivo, Pajuna cattle, Limia cattle, Maronesa cattle, Tudanca cattle, and others, which already bear considerable resemblance to the aurochs in certain features. Tauros Programme started collaborations with Rewilding Europe and European Wildlife, two European organizations for ecological restoration and rewilding, and now has breeding herds not only in the Netherlands but also in Portugal, Croatia, Romania, and the Czech Republic. Numerous crossbred calves of the first, second, and third offspring generations have already been born.\n\nUruz Project \n\nA further back-breeding effort, the Uruz project, was started in 2013 by the True Nature Foundation, an organization for ecological restoration and rewilding. It differs from the other projects in that it is planning to make use of genome editing. Its preliminary plans called for the use of Sayaguesa, Maremmana primitive, or Hungarian Grey (Steppe) cattle, and Texas Longhorn with wildtype colour or Barrosã cattle. The finalised plans now call for setting up two breeding lines, Sayaguesa × Maremmana primitiva/Hungarian Steppe cattle and Watusi × Chianina, and later crossing these lines. Two Watusi × Chianina breeding herds have been set up in Boxmeer and Breda in the Netherlands, another herd using Barrosã is being set up in northern Portugal.\n\nAuerrind Project \n\nThe newest of the back-breeding efforts, the Auerrindprojekt,Wiktionary: AuerrindLorsch Abbey website: [http://www.kloster-lorsch.de/en/lauresham0/auerrinder/ “The Aurcattle project.”] Retrieved 5 June 2017. was started in 2015 as a conjoint effort of the Experimentalarchäologisches Freilichtlabor Lauresham (Lauresham Experimental-Archaeological Open-air Laboratory, run by Lorsch Abbey), the Förderkreis Große Pflanzenfresser im Kreis Bergstraße e.V. (Promoting Association Megaherbivores in Bergstraße District) and the Landschaftspflegebetrieb Hohmeyer (Landscape Preservation Company Hohmeyer). In accordance with the breeding aims, the Auerrindprojekt has already set up two breeding herds of Watusi × Chianina and one breeding herd of Sayaguesa x Podolian cattle; a second breeding herd of Sayaguesa × Podolian cattle will be started in 2017.\n\nOther projects \n\nScientists of the Polish Foundation for Recreating the Aurochs (PFOT) in Poland hope to use DNA from bones in museums to recreate the aurochs. They plan to return this animal to the forests of Poland. The project has gained the support of the Polish Ministry of the Environment. They plan research on ancient preserved DNA. Other research projects  have extracted \"ancient\" DNA over the past 20 years and their results have been published in such periodicals as Nature and PNAS. Polish scientists Ryszard Słomski and Jacek A. Modliński believe that modern genetics and biotechnology make it possible to recreate an animal almost identical to the aurochs. They say this research will lead to examining the causes of the extinction of the aurochs, and help prevent a similar occurrence with domesticated cattle.\n\nBreeding back the aurochs \n\nApproaches that aim to breed an aurochs-like phenotype do not equate to an aurochs-like genotype. In 2015, researchers mapped the draft genome of a British aurochs dated to 6,750 years before present. Researchers compared the genome to the genomes of 73 modern cattle populations and found in traditional or landrace cattle breeds of Scottish, Irish, Welsh, and English origin – such as Highland, Dexter, Kerry, Welsh Black, and White Park – carry the ancestry of the sequenced aurochs, but the other populations did not. Another study concluded that because of this genomic introgression of the aurochs into these breeds, if this reflects \"the bigger picture across the aurochs/cattle range, perhaps several subpopulations of aurochs are not extinct at all.\" The study proposed that it will be possible to consider breeding back cattle \"that are genetically akin to specific original aurochs populations, through selective cross-breeding of local cattle breeds bearing local aurochs-genome ancestry.\"\n\nCultural significance \n\nThe aurochs was an important game animal appearing in both Paleolithic European and Mesopotamian cave paintings, such as those found at Lascaux and Livernon in France. Aurochs existed into the Iron Age in Anatolia and the Near East, where it was worshiped as a sacred animal, the Lunar Bull, associated with the Great Goddess and later with Mithras. In 2012, an archaeological mission of the British Museum, led by Lebanese archaeologist Claude Doumet Serhal, discovered at the site of the old American school in Sidon, Lebanon, the remains of wild animal bones, including those of an aurochs, dating from the late-fourth to early-third millennium. A 1999 archaeological dig in Peterborough, England, uncovered the skull of an aurochs. The front part of the skull had been removed, but the horns remained attached. The supposition is that the killing of the aurochs in this instance was a sacrificial act.\n\nAlso during antiquity, the aurochs was regarded as an animal of cultural value. Aurochs are depicted on the Ishtar Gate. In the Peloponnese there is a 15th-century BC depiction on the so-called violent cup of Vaphio, of hunters trying to capture with nets three wild bulls being probably aurochs, in a possibly Cretan date palm stand. The one of the bulls throws one hunter on the ground while attacking the second with its horns. The cup despite the older perception of being Minoan seems to be Mycenaean. Greeks and Paeonians were hunting aurochs (wild oxen/bulls) and used their huge horns as trophies, cups for wine, and offers to the gods and heroes. For example, as mentioned by Samus, Philippus of Thessalonica and Antipater when Philip V of Macedon killed an aurochs on the foothills of mountain Orvilos, he offered the horns which were 105 cm long and the skin to a temple of Hercules.Douglas, N. 1927: Birds and Beasts of the Greek Anthology. Florence. Aurochs horns were often used by Romans as hunting horns. Aurochs were among those wild animals caught for fights (venationes) in arenas. Julius Caesar described aurochs in Gaul:\n\nThe Hebrew Bible contains numerous references to the untameable strength of re'em, translated as \"bullock\" or \"wild-ox\" in Jewish translations and translated rather poorly in the King James Version as \"unicorn\", but recognised from the last century by Hebrew scholars as the aurochs.\n\nWhen the aurochs became rarer, hunting it became a privilege of the nobility and a sign of a high social status. The \"Nibelungenlied\" describes Siegfried killing aurochs: \"Darnach schlug er schiere einen Wisent und einen Elch, starker Ure viere und einen grimmen Schelch\", meaning \"After that, he defeated one wisent and one elk, four aurochs, and one Schelch\" - the background of the \"Schelch\" is dubious. Aurochs horns were commonly used as drinking horns by the nobility, which led to the fact that many aurochs horn sheaths are preserved today (albeit often discoloured). The drinking horn at Corpus Christi College, Cambridge, given to the college on its foundation in 1352, probably by the college's founders, the Guilds of Corpus Christi and the Blessed Virgin Mary, is thought to come from an aurochs. A painting by Willem Kalf depicts an aurochs horn. The horns of the last aurochs bulls, which died in 1620, were ornamented with gold and are located at the Livrustkammaren in Stockholm today.\n\nSchneeberger writes that aurochs were hunted with arrows, nets, and hunting dogs. With immobilised aurochs, a ritual was practised that might be regarded as cruel nowadays: the curly hair on the forehead was cut from the skull of the living animal. Belts were made out of this hair and were believed to increase the fertility of women. When the aurochs was slaughtered, a cross-like bone (os cardis) was extracted from the heart. This bone, which is also present in domesticated cattle, contributed to the mystique of the animal and magical powers have been attributed to it.\n\nIn eastern Europe, where it survived until nearly 400 years ago, the aurochs has left traces in fixed expressions. In Russia, a drunken person behaving badly was described as \"behaving like an aurochs\", whereas in Poland, big, strong people were characterized as being \"a bloke like an aurochs\".\n\nIn Central Europe, the aurochs features in toponyms and heraldic coats of arms. For example, the names Ursenbach and Aurach am Hongar are derived from the aurochs. An aurochs head, the traditional arms of the German region Mecklenburg, figures in the coat of arms of Mecklenburg-Vorpommern. The aurochs (Romanian bour, from Latin būbalus) was also the symbol of Moldavia; nowadays, they can be found in the coat of arms of both Romania and Moldova. An aurochs head is featured on an 1858 series of Moldavian stamps, the so-called Bull's Heads (cap de bour in Romanian), renowned for their rarity and price among collectors. In Romania there are still villages named Boureni, after the Romanian word for the auroch. The horn of the aurochs is a charge of the coat of arms of Tauragė, Lithuania, (the name of Tauragė is a compound of taũras \"auroch\" and ragas \"horn\"). It is also present in the emblem of Kaunas, Lithuania, and was part of the emblem of Bukovina during its time as an Austro-Hungarian Kronland. The Swiss Canton of Uri is named after the aurochs; its yellow flag shows a black aurochs head. East Slavic surnames Turenin, Turishchev, Turov, and Turovsky originate from the Slavic name of the species tur. In Slovakia,  toponyms such as Turany, Turíčky, Turie, Turie Pole, Turík, Turová (villages), Turiec (river and region), Turská dolina (valley) and others are used. Turopolje, a large lowland floodplain south of the Sava River in Croatia, got its name from the once-abundant aurochs (Croatian: ). The ancient name of the Estonian town of Rakvere, Tarwanpe or Tarvanpea, probably derives from \"Aurochs head\" (Tarvan pea) in ancient Estonian.\n\nIn 2002, a 3.5-m-high and 7.1-m-long statue of an aurochs was erected in Rakvere, Estonia, for the town's 700th birthday. The sculpture, by artist Tauno Kangro, has become a symbol of the town.\n\nAurochs are frequently mentioned in the A Song of Ice and Fire series of fantasy novels by George R. R. Martin; in particular, roasted aurochs are sometimes served at banquets.\n\nIn the 2012 movie Beasts of the Southern Wild, the six-year-old main character imagines aurochs, though the fantasy creatures are portrayed by \"costumed\" Vietnamese Pot-bellied piglets. Aurochs. http://en.wikipedia.org/?curid=2494."
  }
}
