{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8539",
  "eid" : "e8a226b0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778470043,
  "textBody" : "The Devil (from Greek: διάβολος diábolos \"slanderer, accuser\") designate the personification of evil in various cultures.Jeffrey Burton Russell The Devil: Perceptions of Evil from Antiquity to Primitive Christianity Cornell University Press 1987  page 34 In Abrahamic religions he is often identified with Satan. In Christianity he is the primary opponent of God.\n\nChristianity identifies the Devil (\"Satan\") with the serpent who tempted Adam and Eve to eat the forbidden fruit, and describes him as a \"fallen angel\" who terrorizes the world through evil, is the antithesis of Truth, and shall be condemned, together with the fallen angels who follow him, to eternal fire at the Last Judgement.\n\nShaitan or Iblis is the Devil in Islam. While Iblis refers to the particular personified Devil, Shaitan can apply to any creature, that cause mischief and oppose God.\n\nSome non-Abrahamic religions contain figures similar to the Devil, such as the Buddhist demon Mara and the Zoroastrian spirit Angra Mainyu.\n\nEtymology \n\nThe Modern English word devil descends from the Middle English devel, from Old English dēofol, that in turn represents an early Germanic borrowing of Latin diabolus. This in turn was borrowed from  diábolos, \"slanderer\",[http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0057%3Aentry%3Ddia%2Fbolos διάβολος], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus from  diabállein, \"to slander\" from διά diá, \"across, through\" and βάλλειν bállein, \"to hurl\", probably akin to the Sanskrit gurate, \"he lifts up\".\n\nIn the New Testament, Satan occurs more than 30 times in passages alongside diábolos, referring to the same person or thing as Satan. \n\nAbrahamic religions \n\nJudaism \n\nIn mainstream Judaism, there is no concept of a devil as there is in mainstream Christianity and Islam. The only references to Satan in the Old Testament are in the books Zechariah and in Job.\n\nApocrypha/Deuterocanon \n\nIn the Book of Wisdom, the devil is represented as the one who brought death into the world.\"But by the envy of the devil, death came into the world\" - Book of Wisdom II. 24 The Second Book of Enoch contains references to a Watcher angel called Satanael,2 Enoch 18:3 describing him as the prince of the Grigori who was cast out of heaven\"And I threw him out from the height with his angels, and he was flying in the air continuously above the bottomless\" - 2 Enoch 29:4 and an evil spirit who knew the difference between what was \"righteous\" and \"sinful\".\"The devil is the evil spirit of the lower places, as a fugitive he made Sotona from the heavens as his name was Satanail, thus he became different from the angels, but his nature did not change his intelligence as far as his understanding of righteous and sinful things\" - 2 Enoch 31:4 A similar story is found in 1 Enoch; however, in that book, the leader of the Grigori is called Semjâzâ.\n\nIn the apocryphal literature, Satan rules over a host of angels.Martyrdom of Isaiah, 2:2; Vita Adæ et Evæ, 16) Mastema, who induced God to test Abraham through the sacrifice of Isaac, is identical with Satan in both name and nature.Book of Jubilees, xvii. 18 The Book of Enoch contains references to Sathariel, thought also  to be Sataniel and Satan'el. The similar spellings mirror that of his angelic brethren Michael, Raphael, Uriel and Gabriel, previous to his expulsion from Heaven.\n\nChristianity \n\nIn mainstream Christianity the devil is usually referred to as Satan. Some modern Christians  consider the devil to be an angel who, along with one-third of the angelic host (the demons) rebelled against God and has consequently been condemned to the Lake of Fire. He is described  as hating all humanity (or more accurately creation), opposing God, spreading lies and wreaking havoc on the souls of mankind. Other modern Christians  consider the devil in the Bible to refer figuratively to human sin and temptation and to any immoral human system.\n\nSatan is often identified  as the serpent who convinced Eve to eat the forbidden fruit; thus, Satan has often been depicted as a serpent. Though this identification is not present in the Adam and Eve narrative, this interpretation goes back at least as far as the time of the writing of the Book of Revelation, which specifically identifies Satan as being the serpent (Rev. 20:2).\n\nIn the Bible, the devil is identified with \"the dragon\" and \"the old serpent\" in the Book of Revelation 12:9, 20:2 have also been identified with Satan, as have \"the prince of this world\" in the Gospel of John 12:31, 14:30; and \"the spirit that now worketh in the children of disobedience\" in the Epistle to the Ephesians 2:2; and \"the god of this world\" in 2 Corinthians 4:4. He is also identified as the dragon in the Book of Revelation (e.g.Rev. 12:9), and the tempter of the Gospels (e.g.Mat. 4:1).\n\nThe devil is sometimes called Lucifer, particularly when describing him as an angel before his fall, although the reference in Isaiah 14:12 to Lucifer, or the Son of the Morning, is a reference to a Babylonian king.See, for example, the entries in [http://studylight.org/con/ntb/view.cgi?numberT3103 Nave's Topical Bible], the [http://studylight.org/dic/hbd/view.cgi?number\nT3937 Holman Bible Dictionary] and the [http://studylight.org/com/acc/view.cgi?bookisa&chapter\n14&verse=12#Isa14_12 Adam Clarke Commentary].\n\nBeelzebub is originally the name of a Philistine god (more specifically a certain type of Baal, from Ba‘al Zebûb, lit. \"Lord of Flies\") but is also used in the New Testament as a synonym for Satan. A corrupted version, \"Belzeboub\", appears in The Divine Comedy (Inferno XXXIV).\n\nIn other, non-mainstream, Christian beliefs (e.g. the beliefs of the Christadelphians) the word \"satan\" in the Bible is not regarded as referring to a supernatural, personal being but to any 'adversary' and figuratively refers to human sin and temptation.\n\nIslam \n\nIn Islam the Devil is referred to as Iblis or sometimes the Shaytan (Arabic: Like the usage of the word satan in the Hebrew Bible, Shaytan is also a word used to refer to beings called demons in the Christian Bible, especially the New Testament). Etymologically, Iblis means \"the desperate (of God's mercy)\" in Arabic. Thus, the name \"Iblis\" can be seen as a sobriquet given to Shaitan after falling from Grace.\n\nAccording to the Quran, God created Iblis out of fire, either, along with all of the other jinn, out of \"smokeless fire\" or identified with Jann mentioned in  created out of a \"scorching fire\" different than the regular jinn and depicted as an originally angel.Lucinda Mosher, David Marshall: Sin, Forgiveness, and Reconciliation: Christian and Muslim Perspectives. Georgetown University Press, 2016, , S. 63. The primary characteristic of the Devil, besides hubris, is that he has no power other than the power to cast evil suggestions into the hearts of men and women. The Quran says that the Devil was among the angels whom God ordered to bow down to Adam after his creation, it says in : And [mention] when We said to the angels, \"Prostrate to Adam,\" and they prostrated, except for Iblees. He was of the jinn and departed from the command of his Lord. Then will you take him and his descendants as allies other than Me while they are enemies to you? Wretched it is for the wrongdoers as an exchange. Whether Iblis was actually an angel or a Jinn whom God elevated to the angelic assembly is a matter of debate among Muslim scholars. Some scholars, such as Ibn Abbas, believed that Iblis was actually an angel whom God created out of fire. He was the most worshipful and knowledgeable of angels. Thus, when the Quran identifies Iblis as a Jinn, it means that he belonged to a class of fiery creatures called Jinn, which encompasses both heavenly Jinn (fiery angels) and earthly (ordinary) Jinn.Tafsir al-Qur'an al-adhim (Interpretation of the Great Qur'an) – Ibn Kathir – commentary of surat al baqarah Such a notion is evocative of the biblical seraphim, a rank of angels looking like burning fire.\n\nLong before Adam was created, traditions narrate, earthly jinn roamed the earth and spread corruption upon it. As a result, God sent an army of angels under the leadership of Iblis to fight them. Iblis' ego conflated after his victory on earth. He thought he was better than any other creature, and thus God's favorite. God's creation of Adam and his order to the angels to venerate him was a blow to Iblis' pride. While all the angels obeyed God and bowed down to Adam, Iblis disobeyed haughtily saying :\n\nI am better than him. You created me from fire and created him from clay.\n\nConsequently, God expelled Iblis from Heaven, with the latter promising to lure mankind into disbelief and evil as an act of revenge from their father, Adam.The Beginning and the End – Ibn Kathir – Volume I Also, some scholars call Iblis \"The Peacock of Angels\", referencing his foolish hubris.Adapted from [http://islamqa.info/ar/8976 islamqa.info]\n\nOn the other hand, other scholars believe that there are no such things as heavenly Jinn or fiery angels, and thus Iblis was not an angel, but a Jinn whom God elevated to Heaven as a reward for his worship and righteousness. According to this opinion, angels do not have free will;Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 46 they obey God's orders without questioning or complaining. As for the angels, they prostrated before Adam to show their homage and obedience to God. However, Iblis, adamant in his view that man is inferior, and unlike angels was given the ability to choose, made a choice of not obeying God. This caused him to be expelled by God, a fact that Iblis blamed on humanity. Hasan of Basra, an eminent Muslim theologian who lived in the 7th century A.D, was quoted as saying:\n\nIblis was not an angel even for the time of an eye wink. He is the origin of Jinn as Adam is of Mankind.The Beginning and the End – Ibn Kathir – Volume I, also the Koranic commentary of the same author\n\nInitially, the Devil was successful in deceiving Adam, but once his intentions became clear, Adam and Eve repented to God and were freed from their misdeeds and forgiven. God gave them a strong warning about Iblis and the fires of Hell and asked them and their children (humankind) to stay away from the deceptions of their senses caused by the Devil.\n\nIslam does not depict the Devil as enemy of God, as God is supreme over all his creations and the Iblis is just one of his creations. Iblis' single enemy is humanity. According to the verses of the Qur’an, the Devil's mission until the Qiyamah or Resurrection Day (yaum-ul-qiyama) is to deceive Adam's children (mankind). Thus he doesn't oppose God, but works within his plans as a tempter,Jean Jacques Waardenburg Islam: Historical, Social, and Political Perspectives Walter de Gruyter 2002  page 40 therefore human can master his imperfect nature and recognize good. Closer to the Jewish understanding of the Devil, evil does not originate from an external being, rather the Devil takes advantage of humans own evil inclinations.John Wiley & Sons Understanding Religious Ethics Charles Mathewes  page 249 Evil thoughts, doubt, despair and other misgivings in the humans mind, called waswasa, are therefore regarded, as evil suggestions made by the Devil or one of his minor demons, who tries to lead the person astray from good. The struggle against the mischief of Iblis and his temptations is called the \"Greater Jihad\".\n\nSufi view of the Devil \n\nSufism teaches that people should love God without expecting anything in return.Adapted from A History of God, Karen Armstrong Consequently, unrequited love is regarded by Sufis as that perfect type of love because the pining lover expects nothing in return. Thus, some Sufis see the Devil as the paradigm of love and the perfect lover.Adapted from No god but God, Reza Aslan Despite the traditional interpretation of Devil's fall from Grace as an act of excessive pride and rebellion against God, some Sufis see it as an act of self-sacrifice for God's love. The Devil refused to bow down to Adam out of his uncompromising monotheism and devotion; he refused to venerate anything or anyone but God. Al-Ghazali, a well-known medieval Sufi Muslim theologian, narrated:\n\nEncountering Iblis on the slopes of Sinai, Moses hailed him and asked, \"O Iblis, why did you not prostrate before Adam?\" Iblis replied, \"Heaven forbid that anyone worship anything but the One. […] This command was a test.\"\"The Greater Satan\", Javad Nurbakhsh\n\nThe Devil believed that God ordered him to bow down to Adam to test his love for him. The Devil should maintain his love for God at any cost. So, even if the cost of Devil's refusal to prostrate before Adam is falling from Grace, he should proceed with it out of his unconditional love for God. Abdul Karim Jili, a Muslim Sufi saint, believed that after the Day of Judgement, Hell will cease to exist, and the Devil will be back to the service of God as one of his cherished angels.Al insan Al Kamel (the perfect human), Abdul Karim Jili\n\nBahá'í Faith \n\nIn the Bahá'í Faith, a malevolent, superhuman entity such as a devil or satan is not believed to exist. These terms do, however, appear in the Bahá'í writings, where they are used as metaphors for the lower nature of man. Human beings are seen to have free will, and are thus able to turn towards God and develop spiritual qualities or turn away from God and become immersed in their self-centered desires. Individuals who follow the temptations of the self and do not develop spiritual virtues are often described in the Bahá'í writings with the word satanic. The Bahá'í writings also state that the devil is a metaphor for the \"insistent self\" or \"lower self\" which is a self-serving inclination within each individual. Those who follow their lower nature are also described as followers of \"the Evil One\".Shoghi Effendi quoted in \n\nYazidism \n\nYazidis believe that God created the world and entrusted it to the care of seven Holy beings, among whom was Melek Taus (King Peacock in English). When God ordered his Holy beings to prostrate before Adam, Melek Taus refused to carry out God's order out of his devotion to him. As a result, God made him the leader of all angels and his deputy on earth. An alternative name for the main deity in the tentatively Indo-European pantheon of the Yazidi, Melek Taus, is Shaitan.Drower, E.S. [http://www.avesta.org/yezidi/peacock.htm The Peacock Angel]. Being Some Account of Votaries of a Secret Cult and their Sanctuaries. London: John Murray, 1941. Rather than Satanic, however, Yazidism is better understood as a remnant of a pre-Islamic Middle Eastern religion, and/or a ghulat Sufi movement founded by Sheikh Adi ibn Musafir. Because Melek Taus, similar to the devil, refused to bow down before humanity, Christians and Muslims consider Melek Taus to be Satan and based on this belief, they claim that the Yazidis are devil-worshippers. In fact, there is no entity in Yazidism which represents evil in opposition to God; such dualism is rejected by Yazidis.Birgül Açikyildiz The Yezidis: The History of a Community, Culture and Religion I.B.Tauris 2014  page 74 The connection with the Devil, originally made by Muslim outsiders, attracted the interest of 19th-century European travelers and esoteric writers. The Yazidi narrative of Melek Taus bears a striking resemblance to the Islamic account of the Devil (especially the one held by some Sufis as mentioned before). Also, some Muslim scholars named the Devil the Peacock of Angels, a term almost equivalent to Melek Taus, Angel Peacock.Patrick Hughes, Thomas Patrick Hughes Dictionary of Islam Asian Educational Services 1995  page 135\n\nSimilar figures in other religions \n\nAncient Egypt \n\nApep ( or) or Apophis (; ; also spelled Apepi or Aapep) was the ancient Egyptian deity who embodied chaos (ı͗zft in Egyptian) and was thus the opponent of light and Ma'at (order/truth). He appears in art as a giant serpent. His name is reconstructed by Egyptologists as *ʻAʼpāpī, as it was written ꜥꜣpp(y) and survived in later Coptic as  Aphōph.Erman, Adolf, and Hermann Grapow, eds. 1926–1953. Wörterbuch der aegyptischen Sprache im Auftrage der deutschen Akademien. 6 vols. Leipzig: J. C. Hinrichs'schen Buchhandlungen. (Reprinted Berlin: Akademie-Verlag GmbH, 1971).\n\nThe deity Set was originally associated with both positive and negative roles: a protector of Ra on the solar boat from the Serpent of Chaos, and  a usurper who killed and mutilated his brother in order to assume the throne. However, he was later demonized and he became quite unpopular. According to Herman te Velde, the demonization of Set took place after Egypt's conquest by several foreign nations in the Third Intermediate and Late Periods. Set, who had traditionally been the god of foreigners, thus also became associated with foreign oppressors, including the Assyrian and Persian empires. It was during this time that Set was particularly vilified, and his defeat by Horus widely celebrated. Set's negative aspects were emphasized during this period. Set was the killer of Osiris, having hacked Osiris' body into pieces and dispersed it so that he could not be resurrected. The Greeks later linked Set with Typhon because both were evil forces, storm deities, and sons of the Earth that attacked the main gods.\n\nNevertheless, throughout this period, in some outlying regions of Egypt Set was still regarded as the heroic chief deity.\n\nSet has also been classed as a Trickster deity who, as a god of disorder, resorts to deception to achieve bad ends.\n\nZoroastrianism \n\nAngra Mainyu (also: Aŋra Mainiiu) is the Avestan-language name of Zoroastrianism's hypostasis of the \"destructive spirit\". The Middle Persian equivalent is Ahriman (Anglicised pronunciation:). According to the most common Zoroastrian notion, he is the twin spirit of Ahura Mazda. \n\nBuddhism \n\nMara (Sanskrit: māra; ; Tibetan Wylie: bdud; ; ; ; ),  is a tempter figure in Buddhism, distracting humans from practicing the spiritual life by making mundane things alluring, or the negative seem positive.He is the demon that tempted Gautama Buddha by trying to seduce him with the vision of beautiful women who, in various legends, are often said to be Mara's daughters.See, for instance, SN 4.25, entitled, \"Māra's Daughters\" (Bodhi, 2000, pp. 217-20), as well as Sn 835 (Saddhatissa, 1998, page 98). In each of these texts, Mara's daughters (Māradhītā) are personified by sensual Craving (taṇhā), Aversion (arati) and Passion (rāga). In Buddhist cosmology, Mara personifies unwholesome impulses, unskillfulness, the \"death\"[http://www.nirvanadhamma.com/en/articles/hidden-danger-of-existence%21/higher-realms/mara-the-god-of-death/ Mara-the god of death] of the spiritual life. \n\nMandaean \n\nAccording to Mandaeans mythology, one of the fallen lights, which created the known world, called Ruha Qadishta resembles a personified evil. She dwelled in the world of light until her \"fall\" and then gave birth to the lord of darkness named Ur. Together they create several evil demons and magicians among them Jesus the son of Ruha Qadistha, who accordingly distorted BaptismNesta H. Webster Secret Societies and Subversive Movements Book Tree 2000  page 71Kurt Rudolph Mandaeism. [Mit Fig.] BRILL 1978  page 4 and Adonai, considered to be the sun. Eventually Ruha will be rehabilitated and return to the world of light.\n\nAbsolute Dualism\n\nAbsolute dualistic worldviews, for example, present in Manichaeism, Albanenses and partly in Catharism, assert that good and evil are two strictly distinct principles and one does not originate from the other. Therefore, the deity of good is all powerful but ontologically limited to good. This deity cannot and does not want to do evil and can not create any being with free-will, which may become evil. On the other hand, the devil is regarded as the principle of absolute evil, unable to do good, thus according to absolute dualists it is unthinkable that the devil originated as a heavenly angel or something of the like.Willis Barnstone, Marvin Meyer The Gnostic Bible: Revised and Expanded Edition Shambhala Publications 2009  page 752-154\n\nOther names \n\nDemons \n\nIn some religions and traditions, these titles are separate demons; others identify these names as guises of the devil. Even when thought of as individual demons, some are often thought of being under the Devil's direct control. This identifies only those thought of as the devil; List of demons has a more general listing.\n\n* Asmodeus, Asmeday (Hebrew), Aesma-daeva (Avestan): King of Nine Hells; King genies (Shedim/Jinn)\n* Azazel, Asael (Hebrew): King of Devils\n* Baphomet, a demon supposedly worshiped by the Knights Templar\n* Beelzebub, ba'al zevuv בעל זבוב (Hebrew): Lord of the flies ()\n()\n* Belial, Beliar, Bheliar (Hebrew): without master, despicableness of the earth, Lord of Pride \n* Mastema, a devil in the Book of Jubilees\n* Lilith, a female demon in Jewish mythology.\n\nTitles \n\nA list of liturgical names for the devil may be found in Jeffrey Burton Russell, Lucifer, the Devil in the Middle Ages (Cornell University Press, 1986), p. 128, note 76 [https://books.google.com/books?id3FJtnOsqtqAC&pg\nRA1-PA128&dq%22liturgical+names+for+the+Devil%22&lr\n&as_drrb_isq&as_minm_is\n1&as_miny_is2009&as_maxm_is\n12&as_maxy_is2009&as_brr\n0&as_pt=ALLTYPES online.]\n\nThese are titles that almost always refer to devil-figures.\n\n* Angra Mainyu, Ahriman: \"malign spirit\", \"unholy spirit\"\n* Der Leibhaftige [Teufel] (German): \"[the devil] in the flesh, corporeal\"Grimm, Deutsches Wörterbuch s.v. \"leibhaftig\":\n\"gern in bezug auf den teufel: dasz er kein mensch möchte sein, sondern ein leibhaftiger teufel. volksbuch von dr. Faust […] der auch blosz der leibhaftige heiszt, so in Tirol. Fromm. 6, 445; wenn ich dén sehe, wäre es mir immer, der leibhaftige wäre da und wolle mich nehmen. J. Gotthelf Uli d. pächter (1870) 345 \n* Diabolus, Diabolos (Greek: Διάβολος)\n* The Evil One\n* Father of Lies (John 8:44), in contrast to Jesus (\"I am the truth\").\n* Iblis, the devil in Islam\n* Lord of the underworld / Lord of Hell / Lord of this World\n* Lucifer / The Morning Star (Greek and Roman): bringer of light, illuminator; the planet Venus, often portrayed as Satan's name before he fell\n* Mephistopheles\n* Old Scratch, The Stranger, Old Nick: a colloquialism for the devil, as indicated by the name of the character in the story The Devil and Tom Walker\n* Prince of Darkness / Air\n* Satan / The Adversary, Accuser, Prosecutor\n* (The ancient/old/crooked/coiling) Serpent\n* Shaitan, an Arabic name for Satan\n* Kölski (Iceland)\n* Voland (fictional character in Goethe's Faust)\n\nThe devil as Creator-deity \n\nSeveral religious authors throughout history have advanced the notion that the god of the Old Testament is consistent in character with the devil. They make the case that the Biblical God is a divine force that wreaks suffering, death and destruction and that tempts or commands humanity into committing mayhem and genocide. Tertullian accuses Marcion of Sinope, the first great heretic of Christianity in the 1st century, that he  The Church condemned his writings as heretical. John Arendzen (1909) in the Catholic Encyclopedia (1913) mentions that Eusebius accused Apelles, the 2nd-century AD Gnostic, of considering the Inspirer of Old-Testament prophecies to be not a god, but an evil angel. Hegemonius (4th century) accuses the Persian prophet Mani, founder of the Manichaean sect in the 3rd century AD, identified Jehovah as \"the devil god which created the world\"[http://www.themystica.org/mystica/articles/m/manichaenism.html Manichaeism] by Alan G. Hefner in The Mystica, undated and said that \"he who spoke with Moses, the Jews, and the priests … is the [Prince] of Darkness, … not the god of truth.\"Acta Archelai of Hegemonius, Chapter XII, c. AD 350, quoted in [http://www.fas.harvard.edu/%7Eiranian/Manicheism/Manicheism_II_Texts.pdf Translated Texts] of Manicheism, compiled by Prods Oktor Skjærvø, page 68.History of the Acta Archelai explained in the [http://www.fas.harvard.edu/%7Eiranian/Manicheism/Manicheism_I_Intro.pdf Introduction], page 11\n\nThese writings refer to the Jewish God variously as \"a demiurgus\", \"an evil angel\", \"the devil god\", \"the Prince of Darkness\", \"the source of all evil\",[http://www.newadvent.org/cathen/01267e.htm Albigenses] by Nicholas Weber in Catholic Encyclopedia, 1907 \"the Devil\",Martin Luther by Oswald Bayer in The Reformation Theologians: An Introduction to Theology in the Early Modern Period, edited by Carter Lindberg, Wiley-Blackwell, 2002 (partial text available at [https://books.google.com/books?id\nNXthK1iravwC Google Books]). See The Evil One; God as the Devil; God's Wrath, page 58..9.\n\"a demon\",The Age of Reason by Thomas Paine, 1794, Part I, Chapter VII, Examination of the Old Testament \"a cruel, wrathful, warlike tyrant\",[http://www.ebonmusings.org/atheism/atrocities.html A Book of Blood: Biblical atrocities] on Ebon Musings, undated \"Satan\"[http://www.usc.edu/dept/elab/anth/FacultyPages/williams.html Walter L. Williams] , private correspondence (quoted here with permission), 19 March 2009, referring to The Essential Teachings of Jesus and Mary by Walter L. Williams, unpublished manuscript, 24 December 2008, excerpts available at [http://www.jesusandmary.info/ The Community Of Jesus And Mary]\nand \"the first beast of the book of Revelation\".[http://www.authorhouse.com/Bookstore/ItemDetail.aspx?bookid\n32848 The Old Serpent Chained] by \"Son of man\", Author House, 2006. (Full text of book available by clicking \"Free Preview\", then \"Download the free eBook\".)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Devil" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8539" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Devil (from Greek: διάβολος diábolos \"slanderer, accuser\") designate the personification of evil in various cultures.Jeffrey Burton Russell The Devil: Perceptions of Evil from Antiquity to Primitive Christianity Cornell University Press 1987  page 34 In Abrahamic religions he is often identified with Satan. In Christianity he is the primary opponent of God.\n\nChristianity identifies the Devil (\"Satan\") with the serpent who tempted Adam and Eve to eat the forbidden fruit, and describes him as a \"fallen angel\" who terrorizes the world through evil, is the antithesis of Truth, and shall be condemned, together with the fallen angels who follow him, to eternal fire at the Last Judgement.\n\nShaitan or Iblis is the Devil in Islam. While Iblis refers to the particular personified Devil, Shaitan can apply to any creature, that cause mischief and oppose God.\n\nSome non-Abrahamic religions contain figures similar to the Devil, such as the Buddhist demon Mara and the Zoroastrian spirit Angra Mainyu.\n\nEtymology \n\nThe Modern English word devil descends from the Middle English devel, from Old English dēofol, that in turn represents an early Germanic borrowing of Latin diabolus. This in turn was borrowed from  diábolos, \"slanderer\",[http://www.perseus.tufts.edu/hopper/text?doc=Perseus%3Atext%3A1999.04.0057%3Aentry%3Ddia%2Fbolos διάβολος], Henry George Liddell, Robert Scott, A Greek-English Lexicon, on Perseus from  diabállein, \"to slander\" from διά diá, \"across, through\" and βάλλειν bállein, \"to hurl\", probably akin to the Sanskrit gurate, \"he lifts up\".\n\nIn the New Testament, Satan occurs more than 30 times in passages alongside diábolos, referring to the same person or thing as Satan. \n\nAbrahamic religions \n\nJudaism \n\nIn mainstream Judaism, there is no concept of a devil as there is in mainstream Christianity and Islam. The only references to Satan in the Old Testament are in the books Zechariah and in Job.\n\nApocrypha/Deuterocanon \n\nIn the Book of Wisdom, the devil is represented as the one who brought death into the world.\"But by the envy of the devil, death came into the world\" - Book of Wisdom II. 24 The Second Book of Enoch contains references to a Watcher angel called Satanael,2 Enoch 18:3 describing him as the prince of the Grigori who was cast out of heaven\"And I threw him out from the height with his angels, and he was flying in the air continuously above the bottomless\" - 2 Enoch 29:4 and an evil spirit who knew the difference between what was \"righteous\" and \"sinful\".\"The devil is the evil spirit of the lower places, as a fugitive he made Sotona from the heavens as his name was Satanail, thus he became different from the angels, but his nature did not change his intelligence as far as his understanding of righteous and sinful things\" - 2 Enoch 31:4 A similar story is found in 1 Enoch; however, in that book, the leader of the Grigori is called Semjâzâ.\n\nIn the apocryphal literature, Satan rules over a host of angels.Martyrdom of Isaiah, 2:2; Vita Adæ et Evæ, 16) Mastema, who induced God to test Abraham through the sacrifice of Isaac, is identical with Satan in both name and nature.Book of Jubilees, xvii. 18 The Book of Enoch contains references to Sathariel, thought also  to be Sataniel and Satan'el. The similar spellings mirror that of his angelic brethren Michael, Raphael, Uriel and Gabriel, previous to his expulsion from Heaven.\n\nChristianity \n\nIn mainstream Christianity the devil is usually referred to as Satan. Some modern Christians  consider the devil to be an angel who, along with one-third of the angelic host (the demons) rebelled against God and has consequently been condemned to the Lake of Fire. He is described  as hating all humanity (or more accurately creation), opposing God, spreading lies and wreaking havoc on the souls of mankind. Other modern Christians  consider the devil in the Bible to refer figuratively to human sin and temptation and to any immoral human system.\n\nSatan is often identified  as the serpent who convinced Eve to eat the forbidden fruit; thus, Satan has often been depicted as a serpent. Though this identification is not present in the Adam and Eve narrative, this interpretation goes back at least as far as the time of the writing of the Book of Revelation, which specifically identifies Satan as being the serpent (Rev. 20:2).\n\nIn the Bible, the devil is identified with \"the dragon\" and \"the old serpent\" in the Book of Revelation 12:9, 20:2 have also been identified with Satan, as have \"the prince of this world\" in the Gospel of John 12:31, 14:30; and \"the spirit that now worketh in the children of disobedience\" in the Epistle to the Ephesians 2:2; and \"the god of this world\" in 2 Corinthians 4:4. He is also identified as the dragon in the Book of Revelation (e.g.Rev. 12:9), and the tempter of the Gospels (e.g.Mat. 4:1).\n\nThe devil is sometimes called Lucifer, particularly when describing him as an angel before his fall, although the reference in Isaiah 14:12 to Lucifer, or the Son of the Morning, is a reference to a Babylonian king.See, for example, the entries in [http://studylight.org/con/ntb/view.cgi?numberT3103 Nave's Topical Bible], the [http://studylight.org/dic/hbd/view.cgi?number\nT3937 Holman Bible Dictionary] and the [http://studylight.org/com/acc/view.cgi?bookisa&chapter\n14&verse=12#Isa14_12 Adam Clarke Commentary].\n\nBeelzebub is originally the name of a Philistine god (more specifically a certain type of Baal, from Ba‘al Zebûb, lit. \"Lord of Flies\") but is also used in the New Testament as a synonym for Satan. A corrupted version, \"Belzeboub\", appears in The Divine Comedy (Inferno XXXIV).\n\nIn other, non-mainstream, Christian beliefs (e.g. the beliefs of the Christadelphians) the word \"satan\" in the Bible is not regarded as referring to a supernatural, personal being but to any 'adversary' and figuratively refers to human sin and temptation.\n\nIslam \n\nIn Islam the Devil is referred to as Iblis or sometimes the Shaytan (Arabic: Like the usage of the word satan in the Hebrew Bible, Shaytan is also a word used to refer to beings called demons in the Christian Bible, especially the New Testament). Etymologically, Iblis means \"the desperate (of God's mercy)\" in Arabic. Thus, the name \"Iblis\" can be seen as a sobriquet given to Shaitan after falling from Grace.\n\nAccording to the Quran, God created Iblis out of fire, either, along with all of the other jinn, out of \"smokeless fire\" or identified with Jann mentioned in  created out of a \"scorching fire\" different than the regular jinn and depicted as an originally angel.Lucinda Mosher, David Marshall: Sin, Forgiveness, and Reconciliation: Christian and Muslim Perspectives. Georgetown University Press, 2016, , S. 63. The primary characteristic of the Devil, besides hubris, is that he has no power other than the power to cast evil suggestions into the hearts of men and women. The Quran says that the Devil was among the angels whom God ordered to bow down to Adam after his creation, it says in : And [mention] when We said to the angels, \"Prostrate to Adam,\" and they prostrated, except for Iblees. He was of the jinn and departed from the command of his Lord. Then will you take him and his descendants as allies other than Me while they are enemies to you? Wretched it is for the wrongdoers as an exchange. Whether Iblis was actually an angel or a Jinn whom God elevated to the angelic assembly is a matter of debate among Muslim scholars. Some scholars, such as Ibn Abbas, believed that Iblis was actually an angel whom God created out of fire. He was the most worshipful and knowledgeable of angels. Thus, when the Quran identifies Iblis as a Jinn, it means that he belonged to a class of fiery creatures called Jinn, which encompasses both heavenly Jinn (fiery angels) and earthly (ordinary) Jinn.Tafsir al-Qur'an al-adhim (Interpretation of the Great Qur'an) – Ibn Kathir – commentary of surat al baqarah Such a notion is evocative of the biblical seraphim, a rank of angels looking like burning fire.\n\nLong before Adam was created, traditions narrate, earthly jinn roamed the earth and spread corruption upon it. As a result, God sent an army of angels under the leadership of Iblis to fight them. Iblis' ego conflated after his victory on earth. He thought he was better than any other creature, and thus God's favorite. God's creation of Adam and his order to the angels to venerate him was a blow to Iblis' pride. While all the angels obeyed God and bowed down to Adam, Iblis disobeyed haughtily saying :\n\nI am better than him. You created me from fire and created him from clay.\n\nConsequently, God expelled Iblis from Heaven, with the latter promising to lure mankind into disbelief and evil as an act of revenge from their father, Adam.The Beginning and the End – Ibn Kathir – Volume I Also, some scholars call Iblis \"The Peacock of Angels\", referencing his foolish hubris.Adapted from [http://islamqa.info/ar/8976 islamqa.info]\n\nOn the other hand, other scholars believe that there are no such things as heavenly Jinn or fiery angels, and thus Iblis was not an angel, but a Jinn whom God elevated to Heaven as a reward for his worship and righteousness. According to this opinion, angels do not have free will;Amira El-Zein Islam, Arabs, and Intelligent World of the Jinn Syracuse University Press 2009  page 46 they obey God's orders without questioning or complaining. As for the angels, they prostrated before Adam to show their homage and obedience to God. However, Iblis, adamant in his view that man is inferior, and unlike angels was given the ability to choose, made a choice of not obeying God. This caused him to be expelled by God, a fact that Iblis blamed on humanity. Hasan of Basra, an eminent Muslim theologian who lived in the 7th century A.D, was quoted as saying:\n\nIblis was not an angel even for the time of an eye wink. He is the origin of Jinn as Adam is of Mankind.The Beginning and the End – Ibn Kathir – Volume I, also the Koranic commentary of the same author\n\nInitially, the Devil was successful in deceiving Adam, but once his intentions became clear, Adam and Eve repented to God and were freed from their misdeeds and forgiven. God gave them a strong warning about Iblis and the fires of Hell and asked them and their children (humankind) to stay away from the deceptions of their senses caused by the Devil.\n\nIslam does not depict the Devil as enemy of God, as God is supreme over all his creations and the Iblis is just one of his creations. Iblis' single enemy is humanity. According to the verses of the Qur’an, the Devil's mission until the Qiyamah or Resurrection Day (yaum-ul-qiyama) is to deceive Adam's children (mankind). Thus he doesn't oppose God, but works within his plans as a tempter,Jean Jacques Waardenburg Islam: Historical, Social, and Political Perspectives Walter de Gruyter 2002  page 40 therefore human can master his imperfect nature and recognize good. Closer to the Jewish understanding of the Devil, evil does not originate from an external being, rather the Devil takes advantage of humans own evil inclinations.John Wiley & Sons Understanding Religious Ethics Charles Mathewes  page 249 Evil thoughts, doubt, despair and other misgivings in the humans mind, called waswasa, are therefore regarded, as evil suggestions made by the Devil or one of his minor demons, who tries to lead the person astray from good. The struggle against the mischief of Iblis and his temptations is called the \"Greater Jihad\".\n\nSufi view of the Devil \n\nSufism teaches that people should love God without expecting anything in return.Adapted from A History of God, Karen Armstrong Consequently, unrequited love is regarded by Sufis as that perfect type of love because the pining lover expects nothing in return. Thus, some Sufis see the Devil as the paradigm of love and the perfect lover.Adapted from No god but God, Reza Aslan Despite the traditional interpretation of Devil's fall from Grace as an act of excessive pride and rebellion against God, some Sufis see it as an act of self-sacrifice for God's love. The Devil refused to bow down to Adam out of his uncompromising monotheism and devotion; he refused to venerate anything or anyone but God. Al-Ghazali, a well-known medieval Sufi Muslim theologian, narrated:\n\nEncountering Iblis on the slopes of Sinai, Moses hailed him and asked, \"O Iblis, why did you not prostrate before Adam?\" Iblis replied, \"Heaven forbid that anyone worship anything but the One. […] This command was a test.\"\"The Greater Satan\", Javad Nurbakhsh\n\nThe Devil believed that God ordered him to bow down to Adam to test his love for him. The Devil should maintain his love for God at any cost. So, even if the cost of Devil's refusal to prostrate before Adam is falling from Grace, he should proceed with it out of his unconditional love for God. Abdul Karim Jili, a Muslim Sufi saint, believed that after the Day of Judgement, Hell will cease to exist, and the Devil will be back to the service of God as one of his cherished angels.Al insan Al Kamel (the perfect human), Abdul Karim Jili\n\nBahá'í Faith \n\nIn the Bahá'í Faith, a malevolent, superhuman entity such as a devil or satan is not believed to exist. These terms do, however, appear in the Bahá'í writings, where they are used as metaphors for the lower nature of man. Human beings are seen to have free will, and are thus able to turn towards God and develop spiritual qualities or turn away from God and become immersed in their self-centered desires. Individuals who follow the temptations of the self and do not develop spiritual virtues are often described in the Bahá'í writings with the word satanic. The Bahá'í writings also state that the devil is a metaphor for the \"insistent self\" or \"lower self\" which is a self-serving inclination within each individual. Those who follow their lower nature are also described as followers of \"the Evil One\".Shoghi Effendi quoted in \n\nYazidism \n\nYazidis believe that God created the world and entrusted it to the care of seven Holy beings, among whom was Melek Taus (King Peacock in English). When God ordered his Holy beings to prostrate before Adam, Melek Taus refused to carry out God's order out of his devotion to him. As a result, God made him the leader of all angels and his deputy on earth. An alternative name for the main deity in the tentatively Indo-European pantheon of the Yazidi, Melek Taus, is Shaitan.Drower, E.S. [http://www.avesta.org/yezidi/peacock.htm The Peacock Angel]. Being Some Account of Votaries of a Secret Cult and their Sanctuaries. London: John Murray, 1941. Rather than Satanic, however, Yazidism is better understood as a remnant of a pre-Islamic Middle Eastern religion, and/or a ghulat Sufi movement founded by Sheikh Adi ibn Musafir. Because Melek Taus, similar to the devil, refused to bow down before humanity, Christians and Muslims consider Melek Taus to be Satan and based on this belief, they claim that the Yazidis are devil-worshippers. In fact, there is no entity in Yazidism which represents evil in opposition to God; such dualism is rejected by Yazidis.Birgül Açikyildiz The Yezidis: The History of a Community, Culture and Religion I.B.Tauris 2014  page 74 The connection with the Devil, originally made by Muslim outsiders, attracted the interest of 19th-century European travelers and esoteric writers. The Yazidi narrative of Melek Taus bears a striking resemblance to the Islamic account of the Devil (especially the one held by some Sufis as mentioned before). Also, some Muslim scholars named the Devil the Peacock of Angels, a term almost equivalent to Melek Taus, Angel Peacock.Patrick Hughes, Thomas Patrick Hughes Dictionary of Islam Asian Educational Services 1995  page 135\n\nSimilar figures in other religions \n\nAncient Egypt \n\nApep ( or) or Apophis (; ; also spelled Apepi or Aapep) was the ancient Egyptian deity who embodied chaos (ı͗zft in Egyptian) and was thus the opponent of light and Ma'at (order/truth). He appears in art as a giant serpent. His name is reconstructed by Egyptologists as *ʻAʼpāpī, as it was written ꜥꜣpp(y) and survived in later Coptic as  Aphōph.Erman, Adolf, and Hermann Grapow, eds. 1926–1953. Wörterbuch der aegyptischen Sprache im Auftrage der deutschen Akademien. 6 vols. Leipzig: J. C. Hinrichs'schen Buchhandlungen. (Reprinted Berlin: Akademie-Verlag GmbH, 1971).\n\nThe deity Set was originally associated with both positive and negative roles: a protector of Ra on the solar boat from the Serpent of Chaos, and  a usurper who killed and mutilated his brother in order to assume the throne. However, he was later demonized and he became quite unpopular. According to Herman te Velde, the demonization of Set took place after Egypt's conquest by several foreign nations in the Third Intermediate and Late Periods. Set, who had traditionally been the god of foreigners, thus also became associated with foreign oppressors, including the Assyrian and Persian empires. It was during this time that Set was particularly vilified, and his defeat by Horus widely celebrated. Set's negative aspects were emphasized during this period. Set was the killer of Osiris, having hacked Osiris' body into pieces and dispersed it so that he could not be resurrected. The Greeks later linked Set with Typhon because both were evil forces, storm deities, and sons of the Earth that attacked the main gods.\n\nNevertheless, throughout this period, in some outlying regions of Egypt Set was still regarded as the heroic chief deity.\n\nSet has also been classed as a Trickster deity who, as a god of disorder, resorts to deception to achieve bad ends.\n\nZoroastrianism \n\nAngra Mainyu (also: Aŋra Mainiiu) is the Avestan-language name of Zoroastrianism's hypostasis of the \"destructive spirit\". The Middle Persian equivalent is Ahriman (Anglicised pronunciation:). According to the most common Zoroastrian notion, he is the twin spirit of Ahura Mazda. \n\nBuddhism \n\nMara (Sanskrit: māra; ; Tibetan Wylie: bdud; ; ; ; ),  is a tempter figure in Buddhism, distracting humans from practicing the spiritual life by making mundane things alluring, or the negative seem positive.He is the demon that tempted Gautama Buddha by trying to seduce him with the vision of beautiful women who, in various legends, are often said to be Mara's daughters.See, for instance, SN 4.25, entitled, \"Māra's Daughters\" (Bodhi, 2000, pp. 217-20), as well as Sn 835 (Saddhatissa, 1998, page 98). In each of these texts, Mara's daughters (Māradhītā) are personified by sensual Craving (taṇhā), Aversion (arati) and Passion (rāga). In Buddhist cosmology, Mara personifies unwholesome impulses, unskillfulness, the \"death\"[http://www.nirvanadhamma.com/en/articles/hidden-danger-of-existence%21/higher-realms/mara-the-god-of-death/ Mara-the god of death] of the spiritual life. \n\nMandaean \n\nAccording to Mandaeans mythology, one of the fallen lights, which created the known world, called Ruha Qadishta resembles a personified evil. She dwelled in the world of light until her \"fall\" and then gave birth to the lord of darkness named Ur. Together they create several evil demons and magicians among them Jesus the son of Ruha Qadistha, who accordingly distorted BaptismNesta H. Webster Secret Societies and Subversive Movements Book Tree 2000  page 71Kurt Rudolph Mandaeism. [Mit Fig.] BRILL 1978  page 4 and Adonai, considered to be the sun. Eventually Ruha will be rehabilitated and return to the world of light.\n\nAbsolute Dualism\n\nAbsolute dualistic worldviews, for example, present in Manichaeism, Albanenses and partly in Catharism, assert that good and evil are two strictly distinct principles and one does not originate from the other. Therefore, the deity of good is all powerful but ontologically limited to good. This deity cannot and does not want to do evil and can not create any being with free-will, which may become evil. On the other hand, the devil is regarded as the principle of absolute evil, unable to do good, thus according to absolute dualists it is unthinkable that the devil originated as a heavenly angel or something of the like.Willis Barnstone, Marvin Meyer The Gnostic Bible: Revised and Expanded Edition Shambhala Publications 2009  page 752-154\n\nOther names \n\nDemons \n\nIn some religions and traditions, these titles are separate demons; others identify these names as guises of the devil. Even when thought of as individual demons, some are often thought of being under the Devil's direct control. This identifies only those thought of as the devil; List of demons has a more general listing.\n\n* Asmodeus, Asmeday (Hebrew), Aesma-daeva (Avestan): King of Nine Hells; King genies (Shedim/Jinn)\n* Azazel, Asael (Hebrew): King of Devils\n* Baphomet, a demon supposedly worshiped by the Knights Templar\n* Beelzebub, ba'al zevuv בעל זבוב (Hebrew): Lord of the flies ()\n()\n* Belial, Beliar, Bheliar (Hebrew): without master, despicableness of the earth, Lord of Pride \n* Mastema, a devil in the Book of Jubilees\n* Lilith, a female demon in Jewish mythology.\n\nTitles \n\nA list of liturgical names for the devil may be found in Jeffrey Burton Russell, Lucifer, the Devil in the Middle Ages (Cornell University Press, 1986), p. 128, note 76 [https://books.google.com/books?id3FJtnOsqtqAC&pg\nRA1-PA128&dq%22liturgical+names+for+the+Devil%22&lr\n&as_drrb_isq&as_minm_is\n1&as_miny_is2009&as_maxm_is\n12&as_maxy_is2009&as_brr\n0&as_pt=ALLTYPES online.]\n\nThese are titles that almost always refer to devil-figures.\n\n* Angra Mainyu, Ahriman: \"malign spirit\", \"unholy spirit\"\n* Der Leibhaftige [Teufel] (German): \"[the devil] in the flesh, corporeal\"Grimm, Deutsches Wörterbuch s.v. \"leibhaftig\":\n\"gern in bezug auf den teufel: dasz er kein mensch möchte sein, sondern ein leibhaftiger teufel. volksbuch von dr. Faust […] der auch blosz der leibhaftige heiszt, so in Tirol. Fromm. 6, 445; wenn ich dén sehe, wäre es mir immer, der leibhaftige wäre da und wolle mich nehmen. J. Gotthelf Uli d. pächter (1870) 345 \n* Diabolus, Diabolos (Greek: Διάβολος)\n* The Evil One\n* Father of Lies (John 8:44), in contrast to Jesus (\"I am the truth\").\n* Iblis, the devil in Islam\n* Lord of the underworld / Lord of Hell / Lord of this World\n* Lucifer / The Morning Star (Greek and Roman): bringer of light, illuminator; the planet Venus, often portrayed as Satan's name before he fell\n* Mephistopheles\n* Old Scratch, The Stranger, Old Nick: a colloquialism for the devil, as indicated by the name of the character in the story The Devil and Tom Walker\n* Prince of Darkness / Air\n* Satan / The Adversary, Accuser, Prosecutor\n* (The ancient/old/crooked/coiling) Serpent\n* Shaitan, an Arabic name for Satan\n* Kölski (Iceland)\n* Voland (fictional character in Goethe's Faust)\n\nThe devil as Creator-deity \n\nSeveral religious authors throughout history have advanced the notion that the god of the Old Testament is consistent in character with the devil. They make the case that the Biblical God is a divine force that wreaks suffering, death and destruction and that tempts or commands humanity into committing mayhem and genocide. Tertullian accuses Marcion of Sinope, the first great heretic of Christianity in the 1st century, that he  The Church condemned his writings as heretical. John Arendzen (1909) in the Catholic Encyclopedia (1913) mentions that Eusebius accused Apelles, the 2nd-century AD Gnostic, of considering the Inspirer of Old-Testament prophecies to be not a god, but an evil angel. Hegemonius (4th century) accuses the Persian prophet Mani, founder of the Manichaean sect in the 3rd century AD, identified Jehovah as \"the devil god which created the world\"[http://www.themystica.org/mystica/articles/m/manichaenism.html Manichaeism] by Alan G. Hefner in The Mystica, undated and said that \"he who spoke with Moses, the Jews, and the priests … is the [Prince] of Darkness, … not the god of truth.\"Acta Archelai of Hegemonius, Chapter XII, c. AD 350, quoted in [http://www.fas.harvard.edu/%7Eiranian/Manicheism/Manicheism_II_Texts.pdf Translated Texts] of Manicheism, compiled by Prods Oktor Skjærvø, page 68.History of the Acta Archelai explained in the [http://www.fas.harvard.edu/%7Eiranian/Manicheism/Manicheism_I_Intro.pdf Introduction], page 11\n\nThese writings refer to the Jewish God variously as \"a demiurgus\", \"an evil angel\", \"the devil god\", \"the Prince of Darkness\", \"the source of all evil\",[http://www.newadvent.org/cathen/01267e.htm Albigenses] by Nicholas Weber in Catholic Encyclopedia, 1907 \"the Devil\",Martin Luther by Oswald Bayer in The Reformation Theologians: An Introduction to Theology in the Early Modern Period, edited by Carter Lindberg, Wiley-Blackwell, 2002 (partial text available at [https://books.google.com/books?id\nNXthK1iravwC Google Books]). See The Evil One; God as the Devil; God's Wrath, page 58..9.\n\"a demon\",The Age of Reason by Thomas Paine, 1794, Part I, Chapter VII, Examination of the Old Testament \"a cruel, wrathful, warlike tyrant\",[http://www.ebonmusings.org/atheism/atrocities.html A Book of Blood: Biblical atrocities] on Ebon Musings, undated \"Satan\"[http://www.usc.edu/dept/elab/anth/FacultyPages/williams.html Walter L. Williams] , private correspondence (quoted here with permission), 19 March 2009, referring to The Essential Teachings of Jesus and Mary by Walter L. Williams, unpublished manuscript, 24 December 2008, excerpts available at [http://www.jesusandmary.info/ The Community Of Jesus And Mary]\nand \"the first beast of the book of Revelation\".[http://www.authorhouse.com/Bookstore/ItemDetail.aspx?bookid\n32848 The Old Serpent Chained] by \"Son of man\", Author House, 2006. (Full text of book available by clicking \"Free Preview\", then \"Download the free eBook\".). Devil. http://en.wikipedia.org/?curid=8539."
  }
}
