{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17394",
  "eid" : "2bce8050-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778582741,
  "textBody" : "In musical notation, a key signature is a set of sharp (), flat (), and rarely, natural () symbols placed together on the staff.  Key signatures are generally written immediately after the clef at the beginning of a line of musical notation, although they can appear in other parts of a score, notably after a double barline.\n\nA key signature designates notes that are to be played higher or lower than the corresponding natural notes and applies through to the end of the piece or up to the next key signature.  A sharp symbol on a line or space in the key signature raises the notes on that line or space one semitone above the natural, and a flat lowers such notes one semitone.  Further, a symbol in the key signature affects all the notes of one letter: for instance, a sharp on the top line of the treble staff applies to Fs not only on that line, but also to Fs in the bottom space of the staff, and to any other Fs. This convention was not universal until the late Baroque and early Classical period, however; music published in the 1720s and 1730s, for example, uses key signatures showing sharps or flats on both octaves for notes which fall within the staff.\n\nAn accidental is an exception to the key signature, applying only in the measure in which it appears.\n\nAlthough a key signature may be written using any combination of sharp and flat symbols, fifteen diatonic key signatures are by far the most common, and their use is assumed in much of this article.  A piece scored using a single diatonic key signature and no accidentals contains notes of at most seven of the twelve pitch classes, which seven being determined by the particular key signature.\n\nEach major and minor key has an associated key signature that sharpens or flattens the notes which are used in its scale. However, it is not uncommon for a piece to be written with a key signature that does not match its key, for example, in some Baroque pieces,Schulenberg, David. Music of the Baroque. New York: Oxford University Press, 2001. [https://books.google.com/books?idP4x3aKvOQWAC&pg\nPA72&vq%22the+key+of+a+baroque+work%22&source\ngbs_search_r&cad1_1&sig\nACfU3U3x7lhOyyIiT-O_HsTZlZxw8FrkSA p. 72.]. \"(…) to determine the key of a Baroque work one must always analyze its tonal structure rather than rely on the key signature.\" or in transcriptions of traditional modal folk tunes.Cooper, David. The Petrie Collection of the Ancient Music of Ireland. Cork: Cork University Press, 2005. [https://books.google.com/books?idPzrfncNnr4cC&pg\nPA25-IA13&vq%22In+a+few+cases+Petrie+has+given+what+is+clearly+a+modal+melody+a+key+signature+which+suggests+that+it+is+actally+in+a+minor+key%22&source\ngbs_search_r&cad1_1&sig\nACfU3U0BqVPTuQnnaH32iLpCvrYnyT143Q p. 22]. \"In a few cases Petrie has given what is clearly a modal melody a key signature which suggests that it is actually in a minor key. For example, Banish Misfortune is presented in D minor, although it is clearly in the Dorian mode.\"\n\nLater on, this use of a key signature that is theoretically incorrect for a piece as a whole or a self-contained section of a piece became less common (in contrast to brief passages within a piece, which, as they modulate from key to key often temporarily disagree with the key signature); but it can be found at least as late as one of Beethoven's very late piano sonatas.  For example, in his Sonata No. 31 in A major, Op. 110, the first appearance of the Arioso section in the final movement is notated throughout in six flats; but it both begins and ends in A minor and has a significant modulation to C major, and both these keys theoretically require seven flats in their key signature.  (The second appearance later in the movement of this same section, a semitone lower, in G minor, uses the correct key signature of two flats.)\n\nConventions \n\nIn principle, any piece can be written with any key signature, using accidentals to correct the pattern of whole and half steps. The purpose of the key signature is to minimize the number of such accidentals required to notate the music. The sequence of sharps or flats in key signatures is generally rigid in modern music notation. This allows musicians to identify the key simply by the number of sharps or flats (which is the same in any clef), rather than their position on the staff. For example, if a key signature has only one sharp, it must be an F sharp,|url\nhttp://www.dummies.com/how-to/content/how-to-read-key-signatures.html |titleHow to Read Key Signatures|accessdate\n29 January 2014 which corresponds to a G major or an E minor key.\n\nHowever, in 20th-century music, there are occasional exceptions to this, where a piece uses an unorthodox or synthetic scale, where a key signature may be invented to reflect this.  This may consist of a number of sharps or flats that are not the normal ones (such as a signature of just C or E), or it may consist of one or more sharps combined with one or more flats (such as a signature containing both F and B).  Key signatures of this kind can be found in the music of Béla Bartók, for example.\n\nThe effect of a key signature continues throughout a piece or movement, unless explicitly cancelled by another key signature. For example, if a five-sharp key signature is placed at the beginning of a piece, every A in the piece in any octave will be played as A sharp, unless preceded by an accidental (for instance, the A in scale 2 illustrated – the next-to-last note – is played as an A even though the A in the key signature (the last sharp sign) is written an octave lower).\n\nIn a score containing more than one instrument, all the instruments are usually written with the same key signature. Exceptions include:\n* If an instrument is a transposing instrument.\n* If an instrument is a percussion instrument with indeterminate pitch.\n* Composers usually omit the key signature for timpani parts. Besides not using a key signature, timpani parts were early on also treated often as transposing instrument parts, the pitch of the high drum being written as C and, as timpani were almost always tuned a perfect fourth apart (dominant on the low drum and tonic on the high drum), the pitch of the low drum being written as G, with the actual pitches indicated at the beginning of the part, e.g. \"timpani in D–A\", if they were tuned A (low drum) and D (high drum).\n* Composers may omit the key signature for horn and occasionally trumpet parts. This is perhaps reminiscent of the early days of brass instruments, when crooks would be added to them, in order to change the length of the tubing and allow playing in different keys.\n* On occasion, in more modern works, instruments may be notated in different keys even when they are not transposing instruments, because the music is polytonal and the different parts are actually in different keys which sound together.\n\nNotational conventions \n\nThe convention for the notation of key signatures follows the circle of fifths. Starting from C major (or equivalently A minor) which has no sharps or flats, successively raising the key by a fifth adds a sharp, going clockwise round the circle of fifths. The new sharp is placed on the new key's leading note (seventh degree) for major keys or supertonic (second degree) for minor keys. Thus G major (E minor) has one sharp which is on the F; then D major (B minor) has two sharps on F and C and so on.\n\nSimilarly successively lowering the key by a fifth adds a flat, going counterclockwise around the circle of fifths. The new flat is placed on the subdominant (fourth degree) for major keys or submediant (sixth degree) for minor keys. Thus F major (D minor) has one flat which is on the B; then B major (G minor) has two flats (on B and E) and so on.\n\nPut another way: for key signatures with sharps, the first sharp is placed on F with subsequent sharps on C, G, D, A, E and B; for key signatures with flats, the first flat is placed on B with subsequent flats on E, A, D, G, C and F. There are thus 15 conventional key signatures, with up to seven sharps or flats and including the empty signature of C major (A minor).\n\nCorollaries:\n\n* Starting from a key with flats in its key signature: raising by fifths successively reduces the flats to zero at C major (A minor). Further such raising adds sharps as described above.\n* Starting from a key with sharps: lowering by fifths successively reduces those sharps to zero. Further such lowering adds flats as described above.\n* When the process of raising by a fifth (adding a sharp) produces more than five or six sharps, successive such raising generally involves changing to the enharmonic equivalent key using a flat-based signature. Typically this is at F  G, but may also be at C \n D or B = C. The same principle applies to the process of successive lowering by a fifth.\n\nThe relative minor is a minor third down from the major, regardless of whether it is a flat or a sharp key signature.\n\nThe key signatures with seven flats () and seven sharps () are rarely used because they have simpler enharmonic equivalents. For example, the key of C major (seven sharps) is more simply represented as D major (five flats). For modern practical purposes these keys are (in twelve tone equal temperament) the same, because C and D are enharmonically the same note. Pieces are written in these extreme sharp or flat keys, however: for example, Bach's Prelude and Fugue No. 3 from Book 1 of The Well-Tempered Clavier BWV 848 is in C major. The modern musical Seussical by Flaherty and Ahrens also has several songs written in these extreme keys.\n\nThe key signature may be changed at any time in a piece, usually at the beginning of a measure, simply by notating the new signature, although if the new signature has no sharps or flats, a signature of naturals, as shown, is needed to cancel the preceding signature. If a change in signature occurs at the start of a new line on the page, where a signature would normally appear anyway, the new signature is customarily repeated at the end of the previous line to make the change more conspicuous.\n\nVariants of standard conventions \n\nIn traditional use, when the key signature change goes from sharps to flats or vice versa, the old key signature is cancelled with the appropriate number of naturals before the new one is inserted; but many more recent publications (whether of newer music or newer editions of older music) dispense with the naturals and simply insert the new signature.\n\nSimilarly, when a signature with either flats or sharps in it changes to a smaller signature of the same type, strict application of tradition or convention would require that naturals first be used to cancel just those flats or sharps that are being subtracted in the new signature before the new signature itself is written; but, again, more modern usage often dispenses with these naturals.\n\nWhen the signature changes from a smaller to a larger signature of the same type, the new signature is simply written in by itself, in both traditional and newer styles.\n\nAt one time it was usual to precede the new signature with a double barline (provided the change occurred between bars and not inside a bar), even if it was not required by the structure of the music to mark sections within the movement; but more recently it has increasingly become usual to use just a single barline. The courtesy signature that appears at the end of a line immediately before a change is usually preceded by an additional barline; the line at the very end of the staff is omitted in this case.\n\nIf both naturals and a new key signature appear at a key signature change, there are also more recently variations about where a barline will be placed (in the case where the change occurs between bars). For example, in some scores by Debussy, in this situation the barline is placed after the naturals but before the new key signature. Hitherto, it would have been more usual to place all the symbols after the barline.\n\nIn key signatures of five or more sharps or of seven flats, one occasionally encounters variant positions of particular symbols in the key signatures, both of them in the bass clef.\n\nThe A which is the fifth sharp in the sharp signatures may occasionally be notated on the top line of the bass staff, whereas it is more usually found in the lowest space on that staff. An example of this can be seen in the full score of Ottorino Respighi's Pines of Rome, in the third section, \"Pines of the Janiculum\" (which is in B major), in the bass-clef instrumental parts.\n\nIn the case of seven-flat key signatures, the final F may occasionally be seen on the second-top line of the bass staff, whereas it would more usually appear below the bottom line. An example of this can be seen in Isaac Albéniz's Iberia: first movement, \"Evocación\", which is in A minor.\n\nMajor scale structure\n\nExcept for C major, key signatures appear in two varieties, \"sharp key signatures\" (\"sharp keys\") and \"flat key signatures\" (\"flat keys\"), so called because they contain only one or other.Schonbrun, Marc (2005). The Everything Music Theory Book, p.68. .\n\nScales with sharp key signatures\n\nSharp key signatures consist of a number of sharps between one and seven, applied in this order: .Bower, Michael. 2007. \"[http://www.empire.k12.ca.us/capistrano/Mike/capmusic/Key%20Signatures/key_signatures.htm All about Key Signatures]\". Modesto, CA: Capistrano School (K–12) website. (Accessed 17 March 2010).Jones, George Thaddeus. 1974. Music Theory: The Fundamental Concepts of Tonal Music Including Notation, Terminology, and Harmony, p.35. Barnes & Noble Outline Series 137. New York, Hagerstown, San Francisco, London: Barnes & Noble. . A mnemonic device often used to remember this is \"Father Charles Goes Down And Ends Battle.\"Schonbrun indeed offers this mnemonic, but makes no claim whatever about frequency of use, or indeed whether it had ever been used before Schonbrun concocted it for his book.--> The key note or tonic of a piece in a major key is immediately above the last sharp in the signature.Kennedy, Michael. 1994. \"Key-Signature\". Oxford Dictionary of Music, second edition, associate editor, Joyce Bourne. Oxford and New York: Oxford University Press. . For example, one sharp (F) in the key signature of a piece in a major key indicates the key of G major, the next note above F. (Six sharps, the last one being E (an enharmonic spelling of F) indicate the key of F major, since F has already been sharped in the key signature.) \n\nThis table shows that each scale starting on the fifth scale degree of the previous scale has one new sharp, added in the order given above.\n\nScales with flat key signatures\n\n\"Flat key signatures\" consist of one to seven flats, applied as:  The mnemonic device is then reversed for use in the flat keys: \"Battle Ends And Down Goes Charles' Father\". The major scale with one flat is F major. In all other \"flat major scales\", the tonic or key note of a piece in a major key is four notes below the last flat, which is the same as the second-to-last flat in the signature. In the major key with four flats (B E A D), for example, the penultimate flat is A, indicating a key of A major.\n\nIn this case each new scale starts a fifth below (or a fourth above) the previous one.\n\nRelationship between key signature and key \n\nA key signature is not the same as a key; key signatures are merely notational devices. They are convenient principally for diatonic or tonal music.\n\nThe key signature defines the diatonic scale that a piece of music uses without the need for accidentals. Most scales require that some notes be consistently sharped or flatted. For example, the only sharp in the G major scale is F sharp, so the key signature associated with the G major key is the one-sharp key signature. However, it is only a notational convenience; a piece with a one-sharp key signature is not necessarily in the key of G major, and likewise, a piece in G major may not always be written with a one-sharp key signature; this is particularly true in pre-Baroque music, when the concept of key had not yet evolved to its present state.\n\nIn any case, more extensive pieces often change key (modulate) during contrasting sections, and only sometimes is this change indicated with a change of key signature; if not, the passage in the second key will not have a matching key signature.\n\nThe Toccata and Fugue in D minor, BWV 538 by Bach has no key signature, leading it to be called the Dorian, but it is still in D minor; the Bs that occur in the piece are written with accidentals.\n\nAdditional terminology\n\nKeys which are associated with the same key signature are called relative keys.\n\nWhen musical modes, such as Lydian or Dorian, are written using key signatures, they are called transposed modes.\n\nExceptions \n\nExceptions to common-practice-period use may be found in Klezmer scales, such as Freygish (Phrygian). In the 20th century, composers such as Bartók and Rzewski (see below) began experimenting with unusual key signatures that departed from the standard order.\n\nBecause of the limitations of the traditional highland bagpipe scale, key signatures are often omitted from written pipe music, which otherwise would be written with two sharps, the usual \nF and C.\n (In this case the pipes are incapable of playing F and C so it is not necessary to specify the sharps.)\n\nUnusual signatures \n\nThe above 15 key signatures only express diatonic scales and are therefore sometimes called standard key signatures. Other scales are written either with a standard key signature and use accidentals as required, or with a nonstandard key signature. Examples of the latter include the E (right hand), and F and G (left hand) used for the E diminished (E octatonic) scale in Bartók's Crossed Hands (no. 99, vol. 4, Mikrokosmos), or the B, E and F used for the D Phrygian dominant scale in Frederic Rzewski's God to a Hungry Child.\n\nThe absence of a key signature does not always mean that the music is in the key of C major / A minor as each accidental may be notated explicitly as required, or the piece may be modal or atonal. An example is Bartók's Piano Sonata, which has no fixed key and is highly chromatic.\n\nThe common practice period conventions are so firmly established that some musical notation programs have been unable to show nonstandard key signatures until recently.One of the most popular musical notation programs, Finale, has only included the option to create a nonstandard key signature since their 2009 version: Finale 2009 User Manual for Windows. \"Non-Standard Key Signature.\" http://www.finalemusic.com/UserManuals/Finale2009Win/Finale.htm (accessed February 17, 2011).\n\nHistory \n\nThe use of a one-flat signature developed in the Medieval period, but signatures with more than one flat did not appear until the 16th century, and signatures with sharps not until the mid-17th century.\"Key Signature\", Harvard Dictionary of Music, 2nd ed.\n\nWhen signatures with multiple flats first came in, the order of the flats was not standardized, and often a flat appeared in two different octaves, as shown at right. In the late 15th and early 16th centuries, it was common for different voice parts in the same composition to have different signatures, a situation called a partial signature or conflicting signature. This was actually more common than complete signatures in the 15th century.\"Partial Signature\", Harvard Dictionary of Music, 2nd ed. The 16th-century motet Absolon fili mi attributed to Josquin des Prez features two voice parts with two flats, one part with three flats, and one part with four flats.\n\nBaroque music written in minor keys often was written with a key signature with fewer flats than we now associate with their keys; for example, movements in C minor often had only two flats (because the A would frequently have to be sharpened to A in the ascending melodic minor scale, as would the B).\n\nTable",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Key signature" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17394" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In musical notation, a key signature is a set of sharp (), flat (), and rarely, natural () symbols placed together on the staff.  Key signatures are generally written immediately after the clef at the beginning of a line of musical notation, although they can appear in other parts of a score, notably after a double barline.\n\nA key signature designates notes that are to be played higher or lower than the corresponding natural notes and applies through to the end of the piece or up to the next key signature.  A sharp symbol on a line or space in the key signature raises the notes on that line or space one semitone above the natural, and a flat lowers such notes one semitone.  Further, a symbol in the key signature affects all the notes of one letter: for instance, a sharp on the top line of the treble staff applies to Fs not only on that line, but also to Fs in the bottom space of the staff, and to any other Fs. This convention was not universal until the late Baroque and early Classical period, however; music published in the 1720s and 1730s, for example, uses key signatures showing sharps or flats on both octaves for notes which fall within the staff.\n\nAn accidental is an exception to the key signature, applying only in the measure in which it appears.\n\nAlthough a key signature may be written using any combination of sharp and flat symbols, fifteen diatonic key signatures are by far the most common, and their use is assumed in much of this article.  A piece scored using a single diatonic key signature and no accidentals contains notes of at most seven of the twelve pitch classes, which seven being determined by the particular key signature.\n\nEach major and minor key has an associated key signature that sharpens or flattens the notes which are used in its scale. However, it is not uncommon for a piece to be written with a key signature that does not match its key, for example, in some Baroque pieces,Schulenberg, David. Music of the Baroque. New York: Oxford University Press, 2001. [https://books.google.com/books?idP4x3aKvOQWAC&pg\nPA72&vq%22the+key+of+a+baroque+work%22&source\ngbs_search_r&cad1_1&sig\nACfU3U3x7lhOyyIiT-O_HsTZlZxw8FrkSA p. 72.]. \"(…) to determine the key of a Baroque work one must always analyze its tonal structure rather than rely on the key signature.\" or in transcriptions of traditional modal folk tunes.Cooper, David. The Petrie Collection of the Ancient Music of Ireland. Cork: Cork University Press, 2005. [https://books.google.com/books?idPzrfncNnr4cC&pg\nPA25-IA13&vq%22In+a+few+cases+Petrie+has+given+what+is+clearly+a+modal+melody+a+key+signature+which+suggests+that+it+is+actally+in+a+minor+key%22&source\ngbs_search_r&cad1_1&sig\nACfU3U0BqVPTuQnnaH32iLpCvrYnyT143Q p. 22]. \"In a few cases Petrie has given what is clearly a modal melody a key signature which suggests that it is actually in a minor key. For example, Banish Misfortune is presented in D minor, although it is clearly in the Dorian mode.\"\n\nLater on, this use of a key signature that is theoretically incorrect for a piece as a whole or a self-contained section of a piece became less common (in contrast to brief passages within a piece, which, as they modulate from key to key often temporarily disagree with the key signature); but it can be found at least as late as one of Beethoven's very late piano sonatas.  For example, in his Sonata No. 31 in A major, Op. 110, the first appearance of the Arioso section in the final movement is notated throughout in six flats; but it both begins and ends in A minor and has a significant modulation to C major, and both these keys theoretically require seven flats in their key signature.  (The second appearance later in the movement of this same section, a semitone lower, in G minor, uses the correct key signature of two flats.)\n\nConventions \n\nIn principle, any piece can be written with any key signature, using accidentals to correct the pattern of whole and half steps. The purpose of the key signature is to minimize the number of such accidentals required to notate the music. The sequence of sharps or flats in key signatures is generally rigid in modern music notation. This allows musicians to identify the key simply by the number of sharps or flats (which is the same in any clef), rather than their position on the staff. For example, if a key signature has only one sharp, it must be an F sharp,|url\nhttp://www.dummies.com/how-to/content/how-to-read-key-signatures.html |titleHow to Read Key Signatures|accessdate\n29 January 2014 which corresponds to a G major or an E minor key.\n\nHowever, in 20th-century music, there are occasional exceptions to this, where a piece uses an unorthodox or synthetic scale, where a key signature may be invented to reflect this.  This may consist of a number of sharps or flats that are not the normal ones (such as a signature of just C or E), or it may consist of one or more sharps combined with one or more flats (such as a signature containing both F and B).  Key signatures of this kind can be found in the music of Béla Bartók, for example.\n\nThe effect of a key signature continues throughout a piece or movement, unless explicitly cancelled by another key signature. For example, if a five-sharp key signature is placed at the beginning of a piece, every A in the piece in any octave will be played as A sharp, unless preceded by an accidental (for instance, the A in scale 2 illustrated – the next-to-last note – is played as an A even though the A in the key signature (the last sharp sign) is written an octave lower).\n\nIn a score containing more than one instrument, all the instruments are usually written with the same key signature. Exceptions include:\n* If an instrument is a transposing instrument.\n* If an instrument is a percussion instrument with indeterminate pitch.\n* Composers usually omit the key signature for timpani parts. Besides not using a key signature, timpani parts were early on also treated often as transposing instrument parts, the pitch of the high drum being written as C and, as timpani were almost always tuned a perfect fourth apart (dominant on the low drum and tonic on the high drum), the pitch of the low drum being written as G, with the actual pitches indicated at the beginning of the part, e.g. \"timpani in D–A\", if they were tuned A (low drum) and D (high drum).\n* Composers may omit the key signature for horn and occasionally trumpet parts. This is perhaps reminiscent of the early days of brass instruments, when crooks would be added to them, in order to change the length of the tubing and allow playing in different keys.\n* On occasion, in more modern works, instruments may be notated in different keys even when they are not transposing instruments, because the music is polytonal and the different parts are actually in different keys which sound together.\n\nNotational conventions \n\nThe convention for the notation of key signatures follows the circle of fifths. Starting from C major (or equivalently A minor) which has no sharps or flats, successively raising the key by a fifth adds a sharp, going clockwise round the circle of fifths. The new sharp is placed on the new key's leading note (seventh degree) for major keys or supertonic (second degree) for minor keys. Thus G major (E minor) has one sharp which is on the F; then D major (B minor) has two sharps on F and C and so on.\n\nSimilarly successively lowering the key by a fifth adds a flat, going counterclockwise around the circle of fifths. The new flat is placed on the subdominant (fourth degree) for major keys or submediant (sixth degree) for minor keys. Thus F major (D minor) has one flat which is on the B; then B major (G minor) has two flats (on B and E) and so on.\n\nPut another way: for key signatures with sharps, the first sharp is placed on F with subsequent sharps on C, G, D, A, E and B; for key signatures with flats, the first flat is placed on B with subsequent flats on E, A, D, G, C and F. There are thus 15 conventional key signatures, with up to seven sharps or flats and including the empty signature of C major (A minor).\n\nCorollaries:\n\n* Starting from a key with flats in its key signature: raising by fifths successively reduces the flats to zero at C major (A minor). Further such raising adds sharps as described above.\n* Starting from a key with sharps: lowering by fifths successively reduces those sharps to zero. Further such lowering adds flats as described above.\n* When the process of raising by a fifth (adding a sharp) produces more than five or six sharps, successive such raising generally involves changing to the enharmonic equivalent key using a flat-based signature. Typically this is at F  G, but may also be at C \n D or B = C. The same principle applies to the process of successive lowering by a fifth.\n\nThe relative minor is a minor third down from the major, regardless of whether it is a flat or a sharp key signature.\n\nThe key signatures with seven flats () and seven sharps () are rarely used because they have simpler enharmonic equivalents. For example, the key of C major (seven sharps) is more simply represented as D major (five flats). For modern practical purposes these keys are (in twelve tone equal temperament) the same, because C and D are enharmonically the same note. Pieces are written in these extreme sharp or flat keys, however: for example, Bach's Prelude and Fugue No. 3 from Book 1 of The Well-Tempered Clavier BWV 848 is in C major. The modern musical Seussical by Flaherty and Ahrens also has several songs written in these extreme keys.\n\nThe key signature may be changed at any time in a piece, usually at the beginning of a measure, simply by notating the new signature, although if the new signature has no sharps or flats, a signature of naturals, as shown, is needed to cancel the preceding signature. If a change in signature occurs at the start of a new line on the page, where a signature would normally appear anyway, the new signature is customarily repeated at the end of the previous line to make the change more conspicuous.\n\nVariants of standard conventions \n\nIn traditional use, when the key signature change goes from sharps to flats or vice versa, the old key signature is cancelled with the appropriate number of naturals before the new one is inserted; but many more recent publications (whether of newer music or newer editions of older music) dispense with the naturals and simply insert the new signature.\n\nSimilarly, when a signature with either flats or sharps in it changes to a smaller signature of the same type, strict application of tradition or convention would require that naturals first be used to cancel just those flats or sharps that are being subtracted in the new signature before the new signature itself is written; but, again, more modern usage often dispenses with these naturals.\n\nWhen the signature changes from a smaller to a larger signature of the same type, the new signature is simply written in by itself, in both traditional and newer styles.\n\nAt one time it was usual to precede the new signature with a double barline (provided the change occurred between bars and not inside a bar), even if it was not required by the structure of the music to mark sections within the movement; but more recently it has increasingly become usual to use just a single barline. The courtesy signature that appears at the end of a line immediately before a change is usually preceded by an additional barline; the line at the very end of the staff is omitted in this case.\n\nIf both naturals and a new key signature appear at a key signature change, there are also more recently variations about where a barline will be placed (in the case where the change occurs between bars). For example, in some scores by Debussy, in this situation the barline is placed after the naturals but before the new key signature. Hitherto, it would have been more usual to place all the symbols after the barline.\n\nIn key signatures of five or more sharps or of seven flats, one occasionally encounters variant positions of particular symbols in the key signatures, both of them in the bass clef.\n\nThe A which is the fifth sharp in the sharp signatures may occasionally be notated on the top line of the bass staff, whereas it is more usually found in the lowest space on that staff. An example of this can be seen in the full score of Ottorino Respighi's Pines of Rome, in the third section, \"Pines of the Janiculum\" (which is in B major), in the bass-clef instrumental parts.\n\nIn the case of seven-flat key signatures, the final F may occasionally be seen on the second-top line of the bass staff, whereas it would more usually appear below the bottom line. An example of this can be seen in Isaac Albéniz's Iberia: first movement, \"Evocación\", which is in A minor.\n\nMajor scale structure\n\nExcept for C major, key signatures appear in two varieties, \"sharp key signatures\" (\"sharp keys\") and \"flat key signatures\" (\"flat keys\"), so called because they contain only one or other.Schonbrun, Marc (2005). The Everything Music Theory Book, p.68. .\n\nScales with sharp key signatures\n\nSharp key signatures consist of a number of sharps between one and seven, applied in this order: .Bower, Michael. 2007. \"[http://www.empire.k12.ca.us/capistrano/Mike/capmusic/Key%20Signatures/key_signatures.htm All about Key Signatures]\". Modesto, CA: Capistrano School (K–12) website. (Accessed 17 March 2010).Jones, George Thaddeus. 1974. Music Theory: The Fundamental Concepts of Tonal Music Including Notation, Terminology, and Harmony, p.35. Barnes & Noble Outline Series 137. New York, Hagerstown, San Francisco, London: Barnes & Noble. . A mnemonic device often used to remember this is \"Father Charles Goes Down And Ends Battle.\"Schonbrun indeed offers this mnemonic, but makes no claim whatever about frequency of use, or indeed whether it had ever been used before Schonbrun concocted it for his book.--> The key note or tonic of a piece in a major key is immediately above the last sharp in the signature.Kennedy, Michael. 1994. \"Key-Signature\". Oxford Dictionary of Music, second edition, associate editor, Joyce Bourne. Oxford and New York: Oxford University Press. . For example, one sharp (F) in the key signature of a piece in a major key indicates the key of G major, the next note above F. (Six sharps, the last one being E (an enharmonic spelling of F) indicate the key of F major, since F has already been sharped in the key signature.) \n\nThis table shows that each scale starting on the fifth scale degree of the previous scale has one new sharp, added in the order given above.\n\nScales with flat key signatures\n\n\"Flat key signatures\" consist of one to seven flats, applied as:  The mnemonic device is then reversed for use in the flat keys: \"Battle Ends And Down Goes Charles' Father\". The major scale with one flat is F major. In all other \"flat major scales\", the tonic or key note of a piece in a major key is four notes below the last flat, which is the same as the second-to-last flat in the signature. In the major key with four flats (B E A D), for example, the penultimate flat is A, indicating a key of A major.\n\nIn this case each new scale starts a fifth below (or a fourth above) the previous one.\n\nRelationship between key signature and key \n\nA key signature is not the same as a key; key signatures are merely notational devices. They are convenient principally for diatonic or tonal music.\n\nThe key signature defines the diatonic scale that a piece of music uses without the need for accidentals. Most scales require that some notes be consistently sharped or flatted. For example, the only sharp in the G major scale is F sharp, so the key signature associated with the G major key is the one-sharp key signature. However, it is only a notational convenience; a piece with a one-sharp key signature is not necessarily in the key of G major, and likewise, a piece in G major may not always be written with a one-sharp key signature; this is particularly true in pre-Baroque music, when the concept of key had not yet evolved to its present state.\n\nIn any case, more extensive pieces often change key (modulate) during contrasting sections, and only sometimes is this change indicated with a change of key signature; if not, the passage in the second key will not have a matching key signature.\n\nThe Toccata and Fugue in D minor, BWV 538 by Bach has no key signature, leading it to be called the Dorian, but it is still in D minor; the Bs that occur in the piece are written with accidentals.\n\nAdditional terminology\n\nKeys which are associated with the same key signature are called relative keys.\n\nWhen musical modes, such as Lydian or Dorian, are written using key signatures, they are called transposed modes.\n\nExceptions \n\nExceptions to common-practice-period use may be found in Klezmer scales, such as Freygish (Phrygian). In the 20th century, composers such as Bartók and Rzewski (see below) began experimenting with unusual key signatures that departed from the standard order.\n\nBecause of the limitations of the traditional highland bagpipe scale, key signatures are often omitted from written pipe music, which otherwise would be written with two sharps, the usual \nF and C.\n (In this case the pipes are incapable of playing F and C so it is not necessary to specify the sharps.)\n\nUnusual signatures \n\nThe above 15 key signatures only express diatonic scales and are therefore sometimes called standard key signatures. Other scales are written either with a standard key signature and use accidentals as required, or with a nonstandard key signature. Examples of the latter include the E (right hand), and F and G (left hand) used for the E diminished (E octatonic) scale in Bartók's Crossed Hands (no. 99, vol. 4, Mikrokosmos), or the B, E and F used for the D Phrygian dominant scale in Frederic Rzewski's God to a Hungry Child.\n\nThe absence of a key signature does not always mean that the music is in the key of C major / A minor as each accidental may be notated explicitly as required, or the piece may be modal or atonal. An example is Bartók's Piano Sonata, which has no fixed key and is highly chromatic.\n\nThe common practice period conventions are so firmly established that some musical notation programs have been unable to show nonstandard key signatures until recently.One of the most popular musical notation programs, Finale, has only included the option to create a nonstandard key signature since their 2009 version: Finale 2009 User Manual for Windows. \"Non-Standard Key Signature.\" http://www.finalemusic.com/UserManuals/Finale2009Win/Finale.htm (accessed February 17, 2011).\n\nHistory \n\nThe use of a one-flat signature developed in the Medieval period, but signatures with more than one flat did not appear until the 16th century, and signatures with sharps not until the mid-17th century.\"Key Signature\", Harvard Dictionary of Music, 2nd ed.\n\nWhen signatures with multiple flats first came in, the order of the flats was not standardized, and often a flat appeared in two different octaves, as shown at right. In the late 15th and early 16th centuries, it was common for different voice parts in the same composition to have different signatures, a situation called a partial signature or conflicting signature. This was actually more common than complete signatures in the 15th century.\"Partial Signature\", Harvard Dictionary of Music, 2nd ed. The 16th-century motet Absolon fili mi attributed to Josquin des Prez features two voice parts with two flats, one part with three flats, and one part with four flats.\n\nBaroque music written in minor keys often was written with a key signature with fewer flats than we now associate with their keys; for example, movements in C minor often had only two flats (because the A would frequently have to be sharpened to A in the ascending melodic minor scale, as would the B).\n\nTable. Key signature. http://en.wikipedia.org/?curid=17394."
  }
}
