{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1541",
  "eid" : "ba6a0740-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778392500,
  "textBody" : "Events\n\n* 945 – Hugh of Provence abdicates the throne in favor of his son Lothair II who is acclaimed sole king of Italy.\n*1111 – Henry V is crowned Holy Roman Emperor.\n*1204 – Constantinople falls to the Crusaders of the Fourth Crusade, temporarily ending the Byzantine Empire. \n*1612 – Miyamoto Musashi defeats Sasaki Kojirō at Funajima island.\n*1613 – Samuel Argall captures Native American princess Pocahontas in Passapatanzy, Virginia to ransom her for some English prisoners held by her father; she is brought to Henricus as hostage.\n*1699 – Guru Gobind Singh establishes the Khalsa in Anandpur Sahib, Punjab.\n*1742 – George Frideric Handel's oratorio Messiah makes its world-premiere in Dublin, Ireland.\n*1777 – American Revolutionary War: American forces are ambushed and defeated in the Battle of Bound Brook, New Jersey.\n*1829 – The Roman Catholic Relief Act 1829 gives Roman Catholics in the United Kingdom the right to vote and to sit in Parliament.\n*1849 – Lajos Kossuth presents the Hungarian Declaration of Independence in a closed session of the National Assembly.\n*1861 – American Civil War: Fort Sumter surrenders to Confederate forces.\n*1865 – American Civil War: Raleigh, North Carolina is occupied by Union Forces.\n*1870 – The New York City Metropolitan Museum of Art is founded.\n*1873 – The Colfax massacre, in which more than 60 African Americans are murdered, takes place.\n*1902 – James C. Penney opens his first store in Kemmerer, Wyoming.\n*1909 – The military of the Ottoman Empire reverses the Ottoman countercoup of 1909 to force the overthrow of Sultan Abdul Hamid II.\n*1919 – The Provisional Government of the Republic of Korea is established.\n*  1919 – Jallianwala Bagh massacre: British troops gun down at least 379 unarmed demonstrators in Amritsar, India; at least 1200 are wounded.\n*  1919 – Eugene V. Debs is imprisoned at the Atlanta Federal Penitentiary in Atlanta, Georgia, for speaking out against the draft during World War I.\n*1941 – A Pact of neutrality between the USSR and Japan is signed.\n*1943 – World War II: The discovery of mass graves of Polish prisoners of war killed by Soviet forces in the Katyń Forest Massacre is announced, causing a diplomatic rift between the Polish government-in-exile in London from the Soviet Union, which denies responsibility.\n*  1943 – The Jefferson Memorial is dedicated in Washington, D.C., on the 200th anniversary of President Thomas Jefferson's birth.\n*1944 – Diplomatic relations between New Zealand and the Soviet Union are established.\n*1945 – World War II: German troops kill more than 1,000 political and military prisoners in Gardelegen, Germany.\n*  1945 – World War II: Soviet and Bulgarian forces capture Vienna.\n*1948 – In an ambush, 78 Jewish doctors, nurses and medical students from Hadassah Hospital, and a British soldier, are massacred by Arabs in Sheikh Jarrah.\n*1953 – CIA director Allen Dulles launches the mind-control program Project MKUltra.\n*1960 – The United States launches Transit 1-B, the world's first satellite navigation system.\n*1964 – At the Academy Awards, Sidney Poitier becomes the first African-American male to win the Best Actor award for the 1963 film Lilies of the Field.\n*1970 – An oxygen tank aboard Apollo 13 explodes, putting the crew in great danger and causing major damage to the spacecraft while en route to the Moon.\n*1972 – The Universal Postal Union decides to recognize the People's Republic of China as the only legitimate Chinese representative, effectively expelling the Republic of China administering Taiwan.\n*  1972 – Vietnam War: The Battle of An Lộc begins.\n*1974 – Western Union (in cooperation with NASA and Hughes Aircraft) launches the United States' first commercial geosynchronous communications satellite, Westar 1.\n*1975 – An attack by the Phalangist resistance kills 26 militia members of the Popular Front for the Liberation of Palestine, marking the start of the 15-year Lebanese Civil War.\n*1976 – The United States Treasury Department reintroduces the two-dollar bill as a Federal Reserve Note on Thomas Jefferson's 233rd birthday as part of the United States Bicentennial celebration.\n*1976 – Forty workers die in an explosion at the Lapua ammunition factory, the deadliest accidental disaster in modern history in Finland.\n*1987 – Portugal and the People's Republic of China sign an agreement in which Macau would be returned to China in 1999.\n*1992 – Basements throughout the Chicago Loop are flooded, forcing the Chicago Board of Trade Building and the Chicago Mercantile Exchange to close.\n*1997 – Tiger Woods becomes the youngest golfer to win the Masters Tournament.\n*2009 – Andrew Hussie publishes the first page of the webcomic Homestuck.\n*2017 – The US drops the largest ever non-nuclear weapon on Nangarhar Province, Afghanistan.\n\nBirths\n\n*1229 – Louis II, Duke of Bavaria (d. 1294)\n*1350 – Margaret III, Countess of Flanders (d. 1405)\n*1506 – Peter Faber, French priest and theologian, co-founded the Society of Jesus (d. 1546)\n*1519 – Catherine de' Medici, Italian-French wife of Henry II of France (d. 1589)\n*1570 – Guy Fawkes, English soldier, planned the Gunpowder Plot (d. 1606)\n*1573 – Christina of Holstein-Gottorp (d. 1625)\n*1593 – Thomas Wentworth, 1st Earl of Strafford, English soldier and politician, Lord Lieutenant of Ireland (d. 1641)\n*1618 – Roger de Rabutin, Comte de Bussy, French author (d. 1693)\n*1636 – Hendrik van Rheede, Dutch botanist (d. 1691)\n*1648 – Jeanne Marie Bouvier de la Motte Guyon, French mystic (d. 1717)\n*1713 – Pierre Jélyotte, French tenor (d. 1797)\n*1729 – Thomas Percy, Irish bishop and poet (d. 1811)\n*1732 – Frederick North, Lord North, English politician, Prime Minister of the United Kingdom (d. 1792)\n*1735 – Isaac Low, American merchant and politician, founded the New York Chamber of Commerce (d. 1791)\n*1743 – Thomas Jefferson, American lawyer and politician, 3rd President of the United States (d. 1826)\n*1747 – Louis Philippe II, Duke of Orléans (d. 1793)\n*1764 – Laurent de Gouvion Saint-Cyr, French general and politician, French Minister of War (d. 1830)\n*1769 – Thomas Lawrence, English painter and educator (d. 1830)\n*1771 – Richard Trevithick, Cornish-English engineer and explorer (d. 1833)\n*1780 – Alexander Mitchell, Irish engineer, invented the Screw-pile lighthouse (d. 1868)\n*1784 – Friedrich Graf von Wrangel, Prussian field marshal (d. 1877)\n*1787 – John Robertson, American lawyer and politician (d. 1873)\n*1794 – Jean Pierre Flourens, French physiologist and academic (d. 1867)\n*1802 – Leopold Fitzinger, Austrian zoologist and herpetologist (d. 1884)\n*1808 – Antonio Meucci, Italian-American engineer (d. 1889)\n*1810 – Félicien David, French composer (d. 1876)\n*1824 – William Alexander, Irish archbishop, poet, and theologian (d. 1911)\n*1825 – Thomas D'Arcy McGee, Irish-Canadian journalist and politician (d. 1868)\n*1828  – Josephine Butler, English feminist and social reformer (d. 1906)\n*1828 – Joseph Lightfoot, English bishop and theologian (d. 1889)\n*1832 – Juan Montalvo, Ecuadorian author and diplomat (d. 1889)\n*1841 – Louis-Ernest Barrias, French sculptor and academic (d. 1905)\n*1850 – Arthur Matthew Weld Downing, Irish astronomer (d. 1917)\n*1851 – Robert Abbe, American surgeon and radiologist (d. 1928)\n*  1851   – William Quan Judge, Irish occultist and theosophist (d. 1896)\n*1852 – Frank Winfield Woolworth, American businessman, founded the F. W. Woolworth Company (d. 1919)\n*1860 – James Ensor, English-Belgian painter (d. 1949)\n*1866 – Butch Cassidy, American criminal (d. 1908)\n*1872 – John Cameron, Scottish footballer and manager (d. 1935)\n*  1872   – Alexander Roda Roda, Austrian-Croatian journalist and author (d. 1945)\n*1873 – John W. Davis, American lawyer and politician, 14th United States Solicitor General (d. 1955)\n*1875 – Ray Lyman Wilbur, American physician, academic, and politician, 31st United States Secretary of the Interior (d. 1949)\n*1879 – Edward Bruce, American lawyer and painter (d. 1943)\n*1880 – Charles Christie, Canadian-American businessman, co-founded the Christie Film Company (d. 1955)\n*1885 – Vean Gregg, American baseball player (d. 1964)\n*  1885   – Juhan Kukk, Estonian politician, Head of State of Estonia (d. 1942)\n*  1885   – György Lukács, Hungarian philosopher and critic (d. 1971)\n*  1885   – Pieter Sjoerds Gerbrandy, Dutch politician (d. 1961)\n*1887 – Gordon S. Fahrni, Canadian physician and golfer (d. 1995)\n*1889 – Herbert Yardley, American cryptologist and author (d. 1958)\n*1890 – Frank Murphy, American jurist and politician, 56th United States Attorney General (d. 1949)\n*  1890   – Dadasaheb Torne, Indian director and producer (d. 1960)\n*1891 – Maurice Buckley, Australian sergeant, Victoria Cross recipient (d. 1921)\n*  1891   – Nella Larsen, Danish/African-American nurse, librarian, and author (d. 1964)\n*  1891   – Robert Scholl, German accountant and politician (d. 1973)\n*1892 – Sir Arthur Harris, 1st Baronet, English air marshal (d. 1984)\n*  1892   – Robert Watson-Watt, Scottish engineer, invented the Radar (d. 1973)\n*1894 – Arthur Fadden, Australian accountant and politician, 13th Prime Minister of Australia (d. 1973)\n*  1894   – Joie Ray, American runner (d. 1978)\n*1896 – Fred Barnett, English footballer (d. 1982)\n*1897 – Werner Voss, German lieutenant and pilot (d. 1917)\n*1899 – Alfred Mosher Butts, American architect and game designer, created Scrabble (d. 1993)\n*  1899   – Harold Osborn, American high jumper and decathlete (d. 1975)\n*1900 – Sorcha Boru, American potter and ceramic sculptor (d. 2006)\n*  1900   – Pierre Molinier, French painter and photographer (d. 1976)\n*1901 – Jacques Lacan, French psychiatrist and academic (d. 1981)\n*  1901   – Alan Watt, Australian public servant and diplomat, Australian Ambassador to Japan (d. 1988)\n*1902 – Philippe de Rothschild, French Grand Prix driver, playwright, and producer (d. 1988)\n*  1902   – Marguerite Henry, American author (d. 1997)\n*1904 – David Robinson, English businessman and philanthropist (d. 1987)\n*1905 – Rae Johnstone, Australian jockey (d. 1964)\n*1906 – Samuel Beckett, Irish novelist, poet, and playwright, Nobel Prize laureate (d. 1989)\n*  1906   – Bud Freeman, American saxophonist, composer, and bandleader (d. 1991)\n*1907 – Harold Stassen, American lawyer and politician, 25th Governor of Minnesota (d. 2001)\n*1909 – Stanislaw Ulam, Polish-American mathematician and academic (d. 1984)\n*  1909   – Eudora Welty, American short story writer and novelist (d. 2001)\n*1911 – Ico Hitrec, Croatian footballer and manager (d. 1946)\n*  1911   – Jean-Louis Lévesque, Canadian businessman and philanthropist (d. 1994)\n*  1911   – Nino Sanzogno, Italian conductor and composer (d. 1983)\n*1913 – Dave Albritton, American high jumper and coach (d. 1994)\n*  1913   – Kermit Tyler, American lieutenant and pilot (d. 2010)\n*1914 – Orhan Veli Kanık, Turkish poet and author (d. 1950)\n*1916 – Phyllis Fraser, Welsh-American actress, journalist, and publisher, co-founded Beginner Books (d. 2006)\n*1917 – Robert Orville Anderson, American businessman, founded Atlantic Richfield Oil Co. (d. 2007)\n*  1917   – Bill Clements, American soldier, engineer, and politician, 15th United States Deputy Secretary of Defense (d. 2011)\n*1919 – Roland Gaucher, French journalist and politician (d. 2007)\n*  1919   – Howard Keel, American actor and singer (d. 2004)\n*  1919   – Madalyn Murray O'Hair, American activist, founded American Atheists (d. 1995)\n*1920 – Roberto Calvi, Italian banker (d. 1982)\n*  1920   – Claude Cheysson, French lieutenant and politician, French Minister of Foreign Affairs (d. 2012)\n*  1920   – Liam Cosgrave, Irish lawyer and politician, 6th Taoiseach of Ireland (d. 2017)\n*1922 – Heinz Baas, German footballer and manager (d. 1994)\n*  1922   – John Braine, English librarian and author (d. 1986)\n*  1922   – Julius Nyerere, Tanzanian educator and politician, 1st President of Tanzania (d. 1999)\n*  1922   – Valve Pormeister, Estonian architect (d. 2002)\n*1923 – Don Adams, American actor and director (d. 2005)\n*  1923   – A. H. Halsey, English sociologist and academic (d. 2014)\n*  1923   – Stanley Tanger, American businessman and philanthropist, founded the Tanger Factory Outlet Centers (d. 2010)\n*1924 – John T. Biggers, American painter (d. 2001)\n*  1924   – Jack T. Chick, American author, illustrator, and publisher (d. 2016)\n*  1924   – Stanley Donen, American director and choreographer\n*1926 – Ellie Lambeti, Greek actress (d. 1983)\n*  1926   – John Spencer-Churchill, 11th Duke of Marlborough, English businessman (d. 2014)\n*1927 – Rosemary Haughton, English philosopher, theologian, and author\n*  1927   – Antonino Rocca, Italian-American wrestler (d. 1977)\n*  1927   – Maurice Ronet, French actor and director (d. 1983)\n*1928 – Alan Clark, English historian and politician, Minister of State for Trade (d. 1999)\n*  1928   – Gianni Marzotto, Italian race car driver and businessman (d. 2012)\n*1929 – Marilynn Smith, American golfer\n*1931 – Anita Cerquetti, Italian soprano (d. 2014)\n*  1931   – Robert Enrico, French director and screenwriter (d. 2001)\n*  1931   – Dan Gurney, American race car driver and engineer (d. 2018)\n*  1931   – Jon Stone, American composer, producer, and screenwriter (d. 1997)\n*1932 – Orlando Letelier, Chilean-American economist and politician, Chilean Minister of National Defense (d. 1976)\n*1933 – Ben Nighthorse Campbell, American soldier and politician\n*1934 – John Muckler, Canadian ice hockey player, coach, and manager\n*1936 – Col Joye, Australian singer-songwriter and guitarist\n*  1936   – Pierre Rosenberg, French historian and academic\n*1937 – Edward Fox, English actor\n*  1937   – Lanford Wilson, American playwright, co-founded the Circle Repertory Company (d. 2011)\n*1938 – Klaus Lehnertz, German pole vaulter\n*  1938   – John Weston, English poet and diplomat\n*1939 – Seamus Heaney, Irish poet and playwright, Nobel Prize laureate (d. 2013)\n*  1939   – Paul Sorvino, American actor and singer\n*1940 – Mike Beuttler, Egyptian-English race car driver (d. 1988)\n*  1940   – Lester Chambers, American singer and musician (The Chambers Brothers)\n*  1940   – J. M. G. Le Clézio, Breton French-Mauritian author and academic, Nobel Prize laureate\n*  1940   – Vladimir Cosma, French composer, conductor and violinist\n*  1940   – Jim McNab, Scottish footballer (d. 2006)\n*  1940   – Max Mosley, English race car driver and engineer, co-founded March Engineering, former president of the FIA\n*  1940   – Ruby Puryear Hearn, African-American biophysicist\n*1941 – Michael Stuart Brown, American geneticist and academic, Nobel Prize laureate\n*  1941   – Jean-Marc Reiser, French author and illustrator (d. 1983)\n*1942 – Bill Conti, American composer and conductor\n*1943 – Alan Jones, Australian rugby coach, radio host, and educator\n*  1943   – Billy Kidd, American skier\n*  1943   – Tim Krabbé, Dutch journalist and author\n*  1943   – Philip Norman, English journalist, author, and playwright\n*1944 – Franco Arese, Italian runner\n*  1944   – Charles Burnett, American actor, director, producer, and screenwriter\n*  1944   – Jack Casady, American bass guitarist (Jefferson Airplane)\n*  1944   – Susan Davis, Russian-American social worker and politician\n*1945 – Ed Caruthers, American high jumper\n*  1945   – Tony Dow, American actor\n*  1945   – Lowell George, American singer-songwriter, guitarist, and producer (d. 1979)\n*  1945   – Bob Kalsu, American football player and lieutenant (d. 1970)\n*  1945   – Judy Nunn, Australian actress and author\n*1946 – Al Green, American singer-songwriter, producer, and pastor\n*1947 – Rae Armantrout, American poet and academic\n*  1947   – Mike Chapman, Australian-English songwriter and producer\n*  1947   – Jean-Jacques Laffont, French economist and academic (d. 2004)\n*  1947   – Yves Landry. Canadian cyclist\n*1948 – Nam Hae-il, South Korean admiral\n*  1948   – Drago Jančar, Slovenian author and playwright\n*  1948   – Mikhail Shufutinsky, Soviet and Russian singer, actor, TV presenter\n*1949 – Len Cook, New Zealand-English mathematician and statistician\n*  1949   – Frank Doran, Scottish lawyer and politician\n*  1949   – Christopher Hitchens, English-American essayist, literary critic, and journalist (d. 2011)\n*  1949   – Ricardo Zunino, Argentinian race car driver\n*1950 – Ron Perlman, American actor \n*  1950   – Tommy Raudonikis, Australian rugby league player and coach\n*1951 – Leszek Borysiewicz, Welsh immunologist and academic\n*  1951   – Peabo Bryson, American singer-songwriter and producer\n*  1951   – Peter Davison, English actor\n*  1951   – Joachim Streich, German footballer and manager\n*  1951   – Max Weinberg, American drummer\n*  1952   – Sam Bush, American mandolin player\n*1952 – David Drew, English lawyer and politician\n*  1952   – Gabrielle Gourdeau, Quebec writer (d. 2006)\n*  1952   – Jonjo O'Neill, Irish jockey and trainer\n*1953 – Stephen Byers, English politician, Secretary of State for Transport\n*  1953   – Dany Laferrière, Haitian-Canadian journalist and author\n*1954 – Jimmy Destri, American keyboard player and songwriter \n*  1954   – Niels Olsen, Danish singer-songwriter and guitarist \n*  1954   – Barbara Roche, English lawyer and politician, Minister of State for Immigration\n*1955 – Steve Camp, American singer-songwriter and guitarist\n*  1955   – Muwenda Mutebi II,The reigning King of Buganda Kingdom\n*  1955   – Louis Johnson, American bass player and producer (d. 2015)\n*  1955   – Lupe Pintor, Mexican boxer\n*  1955   – Ole von Beust, German lawyer and politician, 1st Mayor of Hamburg\n*1956 – Possum Bourne, New Zealand race car driver (d. 2003)\n*  1956   – Alan Devonshire, English footballer and manager\n*  1956   – Edward Forbes Smiley III, American art thief and map dealer\n*1957 – Amy Goodman, American journalist and author\n*  1957   – Saundra Santiago, American actress\n*1960 – Lyn Brown, English social worker and politician\n*  1960   – Bob Casey, Jr., American lawyer and politician, senior senator of Pennsylvania\n*  1960   – Olaf Ludwig, German cyclist and manager\n*  1960   – Rudi Völler, German footballer and manager\n*1961 – Hiro Yamamoto, American bass player and songwriter \n*  1962   – Hillel Slovak, Israeli-American guitarist (d. 1988)\n*1963 – Garry Kasparov, Russian chess player and author\n*1964 – Davis Love III, American golfer and sportscaster\n*  1964   – Caroline Rhea, Canadian actress and comedian\n*  1964   – John Swinney, Scottish businessman and politician, Deputy First Minister of Scotland\n*1965 – Patricio Pouchulu, Argentinian architect and educator\n*1966 – Ali Boumnijel, Tunisian footballer\n*  1966   – Marc Ford, American guitarist, songwriter, and producer \n*1967 – Dana Barros, American basketball player, coach, and sportscaster\n*  1967   – Michael Eisen, American biologist and academic\n*  1967   – Olga Tañón, Puerto Rican-American singer-songwriter \n*1968 – Ted Washington, American football player\n*1969 – Dirk Muschiol, German footballer\n*1970 – Monty Brown, American football player and wrestler\n*  1970   – Gerry Creaney, Scottish footballer and manager\n*  1970   – Nick Garrett, English singer \n*  1970   – Szilveszter Csollány, Hungarian gymnast\n*  1970   – Ricardo Rincón, Mexican-American baseball player\n*  1970   – Ricky Schroder, American actor\n*1971 – Franck Esposito, French swimmer\n*  1971   – Danie Mellor, Australian painter and sculptor\n*  1971   – Bo Outlaw, American basketball player\n*  1971   – Valensia, Dutch singer-songwriter, guitarist, and producer\n*1972 – Mariusz Czerkawski, Polish ice hockey player and golfer\n*  1972   – Aaron Lewis, American singer-songwriter and guitarist \n*1974 – Valentina Cervi, Italian actress\n*  1974   – Sergei Gonchar, Russian ice hockey player\n*  1974   – Darren Turner, English race car driver\n*  1974   – David Zdrilic, Australian footballer and manager\n*1975 – Jasey-Jay Anderson, Canadian snowboarder\n*  1975   – Lou Bega, German singer-songwriter\n*  1975   – Bruce Dyer, English footballer\n*  1975   – Tatiana Navka, Russian ice dancer\n*1976 – Jonathan Brandis, American actor (d. 2003)\n*  1976   – Patrik Eliáš, Czech-American ice hockey player\n*  1976   – Glenn Howerton, American actor, producer, and screenwriter\n*1977 – Margus Tsahkna, Estonian lawyer and politician\n*1978 – Arron Asham, Canadian ice hockey player\n*  1978   – Carles Puyol, Spanish footballer\n*  1978   – Raemon Sluiter, Dutch tennis player\n*  1978   – Keydrick Vincent, American football player\n*1979 – Gréta Arn, Hungarian tennis player\n*  1979   – Baron Davis, American basketball player\n*  1979   – Tony Lundon, Irish singer-songwriter, producer, and dancer \n*  1979   – Meghann Shaughnessy, American tennis player\n*1980 – Colleen Clinkenbeard, American voice actress, director, producer, and screenwriter\n*  1980   – Jason Maguire, Irish jockey\n*  1980   – Wayne Purser, English footballer\n*  1980   – Quentin Richardson, American basketball player\n*1981 – Nat Borchers, American soccer player\n*  1981   – Gemma Doyle, Scottish politician\n*1982 – Nellie McKay, British-American singer-songwriter, musician, and actress\n*1983 – Claudio Bravo, Chilean footballer\n*  1983   – Schalk Burger, South African rugby player\n*  1983   – Nicole Cooke, Welsh cyclist\n*  1983   – Hunter Pence, American baseball player\n*1984 – Jarmo Ahjupera, Estonian footballer\n*  1984   – Anders Lindegaard, Danish footballer\n*1985 – Anna Jennings-Edquist, Australian actress, director, and playwright\n*  1985   – Algo Kärp, Estonian skier\n*1986 – Michael Bingham, American-English sprinter\n*  1986   – Lorenzo Cain, American baseball player\n*1987 – Brandon Hardesty, American actor, director, producer, and screenwriter\n*  1987   – Massimiliano Pesenti, Italian footballer\n*  1987   – Allison Weiss, American singer-songwriter\n*1988 – Anderson, Brazilian footballer\n*  1988   – Petteri Koponen, Finnish basketball player\n*  1988   – Allison Williams, American actress and singer\n*1989 – Ryan Bailey, American sprinter\n*  1989   – Dong Dong, Chinese trampolinist\n*  1989   – Nastassia Mironchyk-Ivanova, Belarusian long jumper\n*  1989   – Josh Reynolds, Australian rugby league player \n*  1989   – Vladislav Yegin, Russian ice hockey player\n*1991 – Akeem Adams, Trinidadian footballer (d. 2013)\n*  1991   – Ulises Dávila, Mexican footballer\n*  1991   – Josh Gordon, American football player\n*1992 – Denis Kudryavtsev, Russian hurdler\n*1993 – Tony Wroten, American basketball player\n*1994 – Ángelo Henríquez, Chilean footballer\n*  1994   – Elvis Merzļikins, Latvian ice hockey player\n\nDeaths\n\n* 548 – Lý Nam Đế, Vietnamese emperor (b. 503)\n* 585 – Hermenegild, Visigothic prince and saint\n* 799 – Paul the Deacon, Italian monk and historian (b. 720)\n* 814 – Krum, khan of the Bulgarian Khanate\n* 862 – Donald I, king of the Picts (b. 812)\n*1035 – Herbert I, Count of Maine\n*1093 – Vsevolod I of Kiev (b. 1030)\n*1113 – Ida of Lorraine, saint and noblewoman (b. c. 1040)\n*1138 – Simon I, Duke of Lorraine (b. 1076)\n*1213 – Guy of Thouars, regent of Brittany\n*1275 – Eleanor of England (b. 1215)\n*1367 – John Tiptoft, 2nd Baron Tibetot (b. 1313)\n*1592 – Bartolomeo Ammannati, Italian architect and sculptor (b. 1511)\n*1605 – Boris Godunov, Tsar of Russia (b. 1551)\n*1612 – Sasaki Kojirō, Japanese samurai (b. 1585)\n*1635 – Fakhr-al-Din II, Ottoman prince (b. 1572)\n*1638 – Henri, Duke of Rohan (b. 1579)\n*1641 – Richard Montagu, English bishop (b. 1577)\n*1695 – Jean de La Fontaine, French author and poet (b. 1621)\n*1716 – Arthur Herbert, 1st Earl of Torrington, English admiral and politician (b. 1648)\n*1722 – Charles Leslie, Irish priest and theologian (b. 1650)\n*1793 – Pierre Gaspard Chaumette, French botanist, lawyer, and politician (b. 1763)\n*1794 – Nicolas Chamfort, French playwright and poet (b. 1741)\n*1826 – Franz Danzi, German cellist, composer, and conductor (b. 1763)\n*1853 – Leopold Gmelin, German chemist and academic (b. 1788)\n*  1853   – James Iredell, Jr., American lawyer and politician, 23rd Governor of North Carolina (b. 1788)\n*1855 – Henry De la Beche, English geologist and palaeontologist (b. 1796)\n*1868 – Tewodros II of Ethiopia (b. 1818)\n*1880 – Robert Fortune, Scottish botanist and author (b. 1813)\n*1882 – Bruno Bauer, German historian and philosopher (b. 1809)\n*1886 – John Humphrey Noyes, American religious leader, founded the Oneida Community (b. 1811)\n*1890 – Samuel J. Randall, American captain, lawyer, and politician, 33rd Speaker of the United States House of Representatives (b. 1828)\n*1909 – Whitley Stokes, Anglo-Irish lawyer and scholar (b. 1830)\n*1910 – William Quiller Orchardson, Scottish-English painter and educator (b. 1835)\n*1911 – John McLane, Scottish-American politician, 50th Governor of New Hampshire (b. 1852)\n*  1911   – George Washington Glick, American lawyer and politician, 9th Governor of Kansas (b. 1827)\n*1912 – Takuboku Ishikawa, Japanese poet and author (b. 1886)\n*1918 – Lavr Kornilov, Russian general (b. 1870)\n*1927 – Georg Voigt, German politician, Mayor of Frankfurt (b. 1866)\n*1936 – Konstantinos Demertzis, Greek politician 129th Prime Minister of Greece (b. 1876)\n*1938 – Grey Owl, English-Canadian environmentalist and author (b. 1888)\n*1941 – Annie Jump Cannon, American astronomer and academic (b. 1863)\n*  1941   – William Twaits, Canadian soccer player (b. 1879)\n*1942 – Henk Sneevliet, Dutch politician (b. 1883)\n*  1942   – Anton Uesson, Estonian engineer and politician, 17th Mayor of Tallinn (b. 1879)\n*1944 – Cécile Chaminade, French pianist and composer (b. 1857)\n*1945 – Ernst Cassirer, Polish-American philosopher and academic (b. 1874)\n*1954 – Samuel Jones, American high jumper (b. 1880)\n*  1954   – Angus Lewis Macdonald, Canadian lawyer and politician, 12th Premier of Nova Scotia (b. 1890)\n*1956 – Emil Nolde, Danish-German painter and educator (b. 1867)\n*1959 – Eduard van Beinum, Dutch pianist, violinist, and conductor (b. 1901)\n*1961 – John A. Bennett, American soldier (b. 1935)\n*1962 – Culbert Olson, American lawyer and politician, 29th Governor of California (b. 1876)\n*1966 – Abdul Salam Arif, Iraqi colonel and politician, 2nd President of Iraq (b. 1921)\n*  1966   – Carlo Carrà, Italian painter (b. 1881)\n*  1966   – Georges Duhamel, French soldier and author (b. 1884)\n*1967 – Nicole Berger, French actress (b. 1934)\n*1969 – Alfred Karindi, Estonian pianist and composer (b. 1901)\n*1971 – Michel Brière, Canadian ice hockey player (b. 1949)\n*  1971   – Juhan Smuul, Estonian author, poet, and screenwriter (b. 1921)\n*1975 – Larry Parks, American actor and singer (b. 1914)\n*  1975   – François Tombalbaye, Chadian soldier, academic, and politician, 1st President of Chad (b. 1918)\n*1978 – Jack Chambers, Canadian painter and director (b. 1931)\n*1980 – Markus Höttinger, Austrian race car driver (b. 1956)\n*1983 – Gerry Hitchens, English footballer (b. 1934)\n*  1983   – Theodore Stephanides, Greek physician, author, and poet (b. 1896)\n*1984 – Ralph Kirkpatrick, American harp player and musicologist (b. 1911)\n*1988 – Jean Gascon, Canadian actor and director (b. 1920)\n*1992 – Maurice Sauvé, Canadian economist and politician (b. 1923)\n*  1992   – Feza Gürsey, Turkish mathematician and physicist (b. 1921)\n*1993 – Wallace Stegner, American novelist, short story writer, and essayist (b. 1909)\n*1996 – Leila Mackinlay, English author and educator (b. 1910)\n*1997 – Bryant Bowles, American soldier and activist, founded the National Association for the Advancement of White People (b. 1920)\n*  1997   – Alan Cooley, Australian public servant (b. 1920)\n*  1997   – Dorothy Frooks, American author and actress (b. 1896)\n*  1997   – Voldemar Väli, Estonian wrestler (b. 1903) \n*1998 – Patrick de Gayardon, French skydiver and base jumper (b. 1960)\n*1999 – Ortvin Sarapu, Estonian-New Zealand chess player and author (b. 1924)\n*  1999   – Willi Stoph, German engineer and politician, 2nd Prime Minister of East Germany (b. 1914)\n*2000 – Giorgio Bassani, Italian author and poet (b. 1916)\n*  2000   – Frenchy Bordagaray, American baseball player and manager (b. 1910)\n*2002 – Desmond Titterington, Northern Irish race car driver (b. 1928)\n*2004 – Caron Keating, Northern Irish television host (b. 1962)\n*2005 – Don Blasingame, American baseball player, coach, and manager (b. 1932)\n*  2005   – Johnnie Johnson, American pianist and songwriter (b. 1924)\n*  2005   – Phillip Pavia, American painter and sculptor (b. 1912)\n*  2005   – Philippe Volter, Belgian actor and director (b. 1959)\n*2006 – Bill Baker, American baseball player, coach, and umpire (b. 1911)\n*  2006   – Muriel Spark, Scottish novelist, poet, and critic (b. 1918)\n*2008 – John Archibald Wheeler, American physicist and academic (b. 1911)\n*2009 – Mark Fidrych, American baseball player (b. 1954)\n*  2009   – Bruce Snyder, American football player and coach (b. 1940)\n*2012 – William B. Buffum, American soldier and diplomat, United States Ambassador to Lebanon (b. 1921)\n*  2012   – Cecil Chaudhry, Pakistani pilot, academic, and activist (b. 1941)\n*  2012   – Shūichi Higurashi, Japanese illustrator (b. 1936)\n*  2012   – David S. Smith, American diplomat, United States Ambassador to Sweden (b. 1918)\n*  2012   – Robert Wigmore, Cook Islander politician, 14th Deputy Prime Minister of the Cook Islands (b. 1949)\n*2013 – Chi Cheng, American bass player (b. 1970)\n*  2013   – Stephen Dodgson, English composer and educator (b. 1924)\n*  2013   – Dean Drummond, American composer and conductor (b. 1949)\n*  2013   – Vincent Montana, Jr., American drummer and composer (b. 1928)\n*  2013   – Lin Yang-kang, Taiwanese politician, 29th Vice Premier of the Republic of China (b. 1927)\n*2014 – Fred Enke, American football player (b. 1924)\n*  2014   – Ernesto Laclau, Argentinian-Spanish philosopher and theorist (b. 1935)\n*  2014   – Michael Ruppert, American journalist and author (b. 1951)\n*  2014   – Rafał Sznajder, Polish fencer (b. 1972)\n*2015 – Gerald Calabrese, American basketball player and politician (b. 1925)\n*  2015   – Ronnie Carroll, Irish singer and politician (b. 1934)\n*  2015   – Thelma Coyne Long, Australian tennis player and captain (b. 1918)\n*  2015   – Eduardo Galeano, Uruguayan journalist and author (b. 1940)\n*  2015   – Günter Grass, German novelist, poet, playwright, and illustrator, Nobel Prize laureate (b. 1927)\n*  2015   – Herb Trimpe, American author and illustrator (b. 1939)\n*2016 – Nera White, American basketball player (b. 1935)\n*2017 – Dan Rooney, American football executive and former United States Ambassador to Ireland (b. 1932)\n\nHolidays and observances\n\n* Christian feast day:\n** Hermenegild\n** Pope Martin I\n** April 13 (Eastern Orthodox liturgics)\n* Jefferson's Birthday (United States)\n* Katyn Memorial Day (Poland)\n* South and Southeast Asian New Year. (see April 14)\n* Teacher's Day (Ecuador) \n* Unfairly Prosecuted Persons Day (Slovakia)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "April 13" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1541" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Events\n\n* 945 – Hugh of Provence abdicates the throne in favor of his son Lothair II who is acclaimed sole king of Italy.\n*1111 – Henry V is crowned Holy Roman Emperor.\n*1204 – Constantinople falls to the Crusaders of the Fourth Crusade, temporarily ending the Byzantine Empire. \n*1612 – Miyamoto Musashi defeats Sasaki Kojirō at Funajima island.\n*1613 – Samuel Argall captures Native American princess Pocahontas in Passapatanzy, Virginia to ransom her for some English prisoners held by her father; she is brought to Henricus as hostage.\n*1699 – Guru Gobind Singh establishes the Khalsa in Anandpur Sahib, Punjab.\n*1742 – George Frideric Handel's oratorio Messiah makes its world-premiere in Dublin, Ireland.\n*1777 – American Revolutionary War: American forces are ambushed and defeated in the Battle of Bound Brook, New Jersey.\n*1829 – The Roman Catholic Relief Act 1829 gives Roman Catholics in the United Kingdom the right to vote and to sit in Parliament.\n*1849 – Lajos Kossuth presents the Hungarian Declaration of Independence in a closed session of the National Assembly.\n*1861 – American Civil War: Fort Sumter surrenders to Confederate forces.\n*1865 – American Civil War: Raleigh, North Carolina is occupied by Union Forces.\n*1870 – The New York City Metropolitan Museum of Art is founded.\n*1873 – The Colfax massacre, in which more than 60 African Americans are murdered, takes place.\n*1902 – James C. Penney opens his first store in Kemmerer, Wyoming.\n*1909 – The military of the Ottoman Empire reverses the Ottoman countercoup of 1909 to force the overthrow of Sultan Abdul Hamid II.\n*1919 – The Provisional Government of the Republic of Korea is established.\n*  1919 – Jallianwala Bagh massacre: British troops gun down at least 379 unarmed demonstrators in Amritsar, India; at least 1200 are wounded.\n*  1919 – Eugene V. Debs is imprisoned at the Atlanta Federal Penitentiary in Atlanta, Georgia, for speaking out against the draft during World War I.\n*1941 – A Pact of neutrality between the USSR and Japan is signed.\n*1943 – World War II: The discovery of mass graves of Polish prisoners of war killed by Soviet forces in the Katyń Forest Massacre is announced, causing a diplomatic rift between the Polish government-in-exile in London from the Soviet Union, which denies responsibility.\n*  1943 – The Jefferson Memorial is dedicated in Washington, D.C., on the 200th anniversary of President Thomas Jefferson's birth.\n*1944 – Diplomatic relations between New Zealand and the Soviet Union are established.\n*1945 – World War II: German troops kill more than 1,000 political and military prisoners in Gardelegen, Germany.\n*  1945 – World War II: Soviet and Bulgarian forces capture Vienna.\n*1948 – In an ambush, 78 Jewish doctors, nurses and medical students from Hadassah Hospital, and a British soldier, are massacred by Arabs in Sheikh Jarrah.\n*1953 – CIA director Allen Dulles launches the mind-control program Project MKUltra.\n*1960 – The United States launches Transit 1-B, the world's first satellite navigation system.\n*1964 – At the Academy Awards, Sidney Poitier becomes the first African-American male to win the Best Actor award for the 1963 film Lilies of the Field.\n*1970 – An oxygen tank aboard Apollo 13 explodes, putting the crew in great danger and causing major damage to the spacecraft while en route to the Moon.\n*1972 – The Universal Postal Union decides to recognize the People's Republic of China as the only legitimate Chinese representative, effectively expelling the Republic of China administering Taiwan.\n*  1972 – Vietnam War: The Battle of An Lộc begins.\n*1974 – Western Union (in cooperation with NASA and Hughes Aircraft) launches the United States' first commercial geosynchronous communications satellite, Westar 1.\n*1975 – An attack by the Phalangist resistance kills 26 militia members of the Popular Front for the Liberation of Palestine, marking the start of the 15-year Lebanese Civil War.\n*1976 – The United States Treasury Department reintroduces the two-dollar bill as a Federal Reserve Note on Thomas Jefferson's 233rd birthday as part of the United States Bicentennial celebration.\n*1976 – Forty workers die in an explosion at the Lapua ammunition factory, the deadliest accidental disaster in modern history in Finland.\n*1987 – Portugal and the People's Republic of China sign an agreement in which Macau would be returned to China in 1999.\n*1992 – Basements throughout the Chicago Loop are flooded, forcing the Chicago Board of Trade Building and the Chicago Mercantile Exchange to close.\n*1997 – Tiger Woods becomes the youngest golfer to win the Masters Tournament.\n*2009 – Andrew Hussie publishes the first page of the webcomic Homestuck.\n*2017 – The US drops the largest ever non-nuclear weapon on Nangarhar Province, Afghanistan.\n\nBirths\n\n*1229 – Louis II, Duke of Bavaria (d. 1294)\n*1350 – Margaret III, Countess of Flanders (d. 1405)\n*1506 – Peter Faber, French priest and theologian, co-founded the Society of Jesus (d. 1546)\n*1519 – Catherine de' Medici, Italian-French wife of Henry II of France (d. 1589)\n*1570 – Guy Fawkes, English soldier, planned the Gunpowder Plot (d. 1606)\n*1573 – Christina of Holstein-Gottorp (d. 1625)\n*1593 – Thomas Wentworth, 1st Earl of Strafford, English soldier and politician, Lord Lieutenant of Ireland (d. 1641)\n*1618 – Roger de Rabutin, Comte de Bussy, French author (d. 1693)\n*1636 – Hendrik van Rheede, Dutch botanist (d. 1691)\n*1648 – Jeanne Marie Bouvier de la Motte Guyon, French mystic (d. 1717)\n*1713 – Pierre Jélyotte, French tenor (d. 1797)\n*1729 – Thomas Percy, Irish bishop and poet (d. 1811)\n*1732 – Frederick North, Lord North, English politician, Prime Minister of the United Kingdom (d. 1792)\n*1735 – Isaac Low, American merchant and politician, founded the New York Chamber of Commerce (d. 1791)\n*1743 – Thomas Jefferson, American lawyer and politician, 3rd President of the United States (d. 1826)\n*1747 – Louis Philippe II, Duke of Orléans (d. 1793)\n*1764 – Laurent de Gouvion Saint-Cyr, French general and politician, French Minister of War (d. 1830)\n*1769 – Thomas Lawrence, English painter and educator (d. 1830)\n*1771 – Richard Trevithick, Cornish-English engineer and explorer (d. 1833)\n*1780 – Alexander Mitchell, Irish engineer, invented the Screw-pile lighthouse (d. 1868)\n*1784 – Friedrich Graf von Wrangel, Prussian field marshal (d. 1877)\n*1787 – John Robertson, American lawyer and politician (d. 1873)\n*1794 – Jean Pierre Flourens, French physiologist and academic (d. 1867)\n*1802 – Leopold Fitzinger, Austrian zoologist and herpetologist (d. 1884)\n*1808 – Antonio Meucci, Italian-American engineer (d. 1889)\n*1810 – Félicien David, French composer (d. 1876)\n*1824 – William Alexander, Irish archbishop, poet, and theologian (d. 1911)\n*1825 – Thomas D'Arcy McGee, Irish-Canadian journalist and politician (d. 1868)\n*1828  – Josephine Butler, English feminist and social reformer (d. 1906)\n*1828 – Joseph Lightfoot, English bishop and theologian (d. 1889)\n*1832 – Juan Montalvo, Ecuadorian author and diplomat (d. 1889)\n*1841 – Louis-Ernest Barrias, French sculptor and academic (d. 1905)\n*1850 – Arthur Matthew Weld Downing, Irish astronomer (d. 1917)\n*1851 – Robert Abbe, American surgeon and radiologist (d. 1928)\n*  1851   – William Quan Judge, Irish occultist and theosophist (d. 1896)\n*1852 – Frank Winfield Woolworth, American businessman, founded the F. W. Woolworth Company (d. 1919)\n*1860 – James Ensor, English-Belgian painter (d. 1949)\n*1866 – Butch Cassidy, American criminal (d. 1908)\n*1872 – John Cameron, Scottish footballer and manager (d. 1935)\n*  1872   – Alexander Roda Roda, Austrian-Croatian journalist and author (d. 1945)\n*1873 – John W. Davis, American lawyer and politician, 14th United States Solicitor General (d. 1955)\n*1875 – Ray Lyman Wilbur, American physician, academic, and politician, 31st United States Secretary of the Interior (d. 1949)\n*1879 – Edward Bruce, American lawyer and painter (d. 1943)\n*1880 – Charles Christie, Canadian-American businessman, co-founded the Christie Film Company (d. 1955)\n*1885 – Vean Gregg, American baseball player (d. 1964)\n*  1885   – Juhan Kukk, Estonian politician, Head of State of Estonia (d. 1942)\n*  1885   – György Lukács, Hungarian philosopher and critic (d. 1971)\n*  1885   – Pieter Sjoerds Gerbrandy, Dutch politician (d. 1961)\n*1887 – Gordon S. Fahrni, Canadian physician and golfer (d. 1995)\n*1889 – Herbert Yardley, American cryptologist and author (d. 1958)\n*1890 – Frank Murphy, American jurist and politician, 56th United States Attorney General (d. 1949)\n*  1890   – Dadasaheb Torne, Indian director and producer (d. 1960)\n*1891 – Maurice Buckley, Australian sergeant, Victoria Cross recipient (d. 1921)\n*  1891   – Nella Larsen, Danish/African-American nurse, librarian, and author (d. 1964)\n*  1891   – Robert Scholl, German accountant and politician (d. 1973)\n*1892 – Sir Arthur Harris, 1st Baronet, English air marshal (d. 1984)\n*  1892   – Robert Watson-Watt, Scottish engineer, invented the Radar (d. 1973)\n*1894 – Arthur Fadden, Australian accountant and politician, 13th Prime Minister of Australia (d. 1973)\n*  1894   – Joie Ray, American runner (d. 1978)\n*1896 – Fred Barnett, English footballer (d. 1982)\n*1897 – Werner Voss, German lieutenant and pilot (d. 1917)\n*1899 – Alfred Mosher Butts, American architect and game designer, created Scrabble (d. 1993)\n*  1899   – Harold Osborn, American high jumper and decathlete (d. 1975)\n*1900 – Sorcha Boru, American potter and ceramic sculptor (d. 2006)\n*  1900   – Pierre Molinier, French painter and photographer (d. 1976)\n*1901 – Jacques Lacan, French psychiatrist and academic (d. 1981)\n*  1901   – Alan Watt, Australian public servant and diplomat, Australian Ambassador to Japan (d. 1988)\n*1902 – Philippe de Rothschild, French Grand Prix driver, playwright, and producer (d. 1988)\n*  1902   – Marguerite Henry, American author (d. 1997)\n*1904 – David Robinson, English businessman and philanthropist (d. 1987)\n*1905 – Rae Johnstone, Australian jockey (d. 1964)\n*1906 – Samuel Beckett, Irish novelist, poet, and playwright, Nobel Prize laureate (d. 1989)\n*  1906   – Bud Freeman, American saxophonist, composer, and bandleader (d. 1991)\n*1907 – Harold Stassen, American lawyer and politician, 25th Governor of Minnesota (d. 2001)\n*1909 – Stanislaw Ulam, Polish-American mathematician and academic (d. 1984)\n*  1909   – Eudora Welty, American short story writer and novelist (d. 2001)\n*1911 – Ico Hitrec, Croatian footballer and manager (d. 1946)\n*  1911   – Jean-Louis Lévesque, Canadian businessman and philanthropist (d. 1994)\n*  1911   – Nino Sanzogno, Italian conductor and composer (d. 1983)\n*1913 – Dave Albritton, American high jumper and coach (d. 1994)\n*  1913   – Kermit Tyler, American lieutenant and pilot (d. 2010)\n*1914 – Orhan Veli Kanık, Turkish poet and author (d. 1950)\n*1916 – Phyllis Fraser, Welsh-American actress, journalist, and publisher, co-founded Beginner Books (d. 2006)\n*1917 – Robert Orville Anderson, American businessman, founded Atlantic Richfield Oil Co. (d. 2007)\n*  1917   – Bill Clements, American soldier, engineer, and politician, 15th United States Deputy Secretary of Defense (d. 2011)\n*1919 – Roland Gaucher, French journalist and politician (d. 2007)\n*  1919   – Howard Keel, American actor and singer (d. 2004)\n*  1919   – Madalyn Murray O'Hair, American activist, founded American Atheists (d. 1995)\n*1920 – Roberto Calvi, Italian banker (d. 1982)\n*  1920   – Claude Cheysson, French lieutenant and politician, French Minister of Foreign Affairs (d. 2012)\n*  1920   – Liam Cosgrave, Irish lawyer and politician, 6th Taoiseach of Ireland (d. 2017)\n*1922 – Heinz Baas, German footballer and manager (d. 1994)\n*  1922   – John Braine, English librarian and author (d. 1986)\n*  1922   – Julius Nyerere, Tanzanian educator and politician, 1st President of Tanzania (d. 1999)\n*  1922   – Valve Pormeister, Estonian architect (d. 2002)\n*1923 – Don Adams, American actor and director (d. 2005)\n*  1923   – A. H. Halsey, English sociologist and academic (d. 2014)\n*  1923   – Stanley Tanger, American businessman and philanthropist, founded the Tanger Factory Outlet Centers (d. 2010)\n*1924 – John T. Biggers, American painter (d. 2001)\n*  1924   – Jack T. Chick, American author, illustrator, and publisher (d. 2016)\n*  1924   – Stanley Donen, American director and choreographer\n*1926 – Ellie Lambeti, Greek actress (d. 1983)\n*  1926   – John Spencer-Churchill, 11th Duke of Marlborough, English businessman (d. 2014)\n*1927 – Rosemary Haughton, English philosopher, theologian, and author\n*  1927   – Antonino Rocca, Italian-American wrestler (d. 1977)\n*  1927   – Maurice Ronet, French actor and director (d. 1983)\n*1928 – Alan Clark, English historian and politician, Minister of State for Trade (d. 1999)\n*  1928   – Gianni Marzotto, Italian race car driver and businessman (d. 2012)\n*1929 – Marilynn Smith, American golfer\n*1931 – Anita Cerquetti, Italian soprano (d. 2014)\n*  1931   – Robert Enrico, French director and screenwriter (d. 2001)\n*  1931   – Dan Gurney, American race car driver and engineer (d. 2018)\n*  1931   – Jon Stone, American composer, producer, and screenwriter (d. 1997)\n*1932 – Orlando Letelier, Chilean-American economist and politician, Chilean Minister of National Defense (d. 1976)\n*1933 – Ben Nighthorse Campbell, American soldier and politician\n*1934 – John Muckler, Canadian ice hockey player, coach, and manager\n*1936 – Col Joye, Australian singer-songwriter and guitarist\n*  1936   – Pierre Rosenberg, French historian and academic\n*1937 – Edward Fox, English actor\n*  1937   – Lanford Wilson, American playwright, co-founded the Circle Repertory Company (d. 2011)\n*1938 – Klaus Lehnertz, German pole vaulter\n*  1938   – John Weston, English poet and diplomat\n*1939 – Seamus Heaney, Irish poet and playwright, Nobel Prize laureate (d. 2013)\n*  1939   – Paul Sorvino, American actor and singer\n*1940 – Mike Beuttler, Egyptian-English race car driver (d. 1988)\n*  1940   – Lester Chambers, American singer and musician (The Chambers Brothers)\n*  1940   – J. M. G. Le Clézio, Breton French-Mauritian author and academic, Nobel Prize laureate\n*  1940   – Vladimir Cosma, French composer, conductor and violinist\n*  1940   – Jim McNab, Scottish footballer (d. 2006)\n*  1940   – Max Mosley, English race car driver and engineer, co-founded March Engineering, former president of the FIA\n*  1940   – Ruby Puryear Hearn, African-American biophysicist\n*1941 – Michael Stuart Brown, American geneticist and academic, Nobel Prize laureate\n*  1941   – Jean-Marc Reiser, French author and illustrator (d. 1983)\n*1942 – Bill Conti, American composer and conductor\n*1943 – Alan Jones, Australian rugby coach, radio host, and educator\n*  1943   – Billy Kidd, American skier\n*  1943   – Tim Krabbé, Dutch journalist and author\n*  1943   – Philip Norman, English journalist, author, and playwright\n*1944 – Franco Arese, Italian runner\n*  1944   – Charles Burnett, American actor, director, producer, and screenwriter\n*  1944   – Jack Casady, American bass guitarist (Jefferson Airplane)\n*  1944   – Susan Davis, Russian-American social worker and politician\n*1945 – Ed Caruthers, American high jumper\n*  1945   – Tony Dow, American actor\n*  1945   – Lowell George, American singer-songwriter, guitarist, and producer (d. 1979)\n*  1945   – Bob Kalsu, American football player and lieutenant (d. 1970)\n*  1945   – Judy Nunn, Australian actress and author\n*1946 – Al Green, American singer-songwriter, producer, and pastor\n*1947 – Rae Armantrout, American poet and academic\n*  1947   – Mike Chapman, Australian-English songwriter and producer\n*  1947   – Jean-Jacques Laffont, French economist and academic (d. 2004)\n*  1947   – Yves Landry. Canadian cyclist\n*1948 – Nam Hae-il, South Korean admiral\n*  1948   – Drago Jančar, Slovenian author and playwright\n*  1948   – Mikhail Shufutinsky, Soviet and Russian singer, actor, TV presenter\n*1949 – Len Cook, New Zealand-English mathematician and statistician\n*  1949   – Frank Doran, Scottish lawyer and politician\n*  1949   – Christopher Hitchens, English-American essayist, literary critic, and journalist (d. 2011)\n*  1949   – Ricardo Zunino, Argentinian race car driver\n*1950 – Ron Perlman, American actor \n*  1950   – Tommy Raudonikis, Australian rugby league player and coach\n*1951 – Leszek Borysiewicz, Welsh immunologist and academic\n*  1951   – Peabo Bryson, American singer-songwriter and producer\n*  1951   – Peter Davison, English actor\n*  1951   – Joachim Streich, German footballer and manager\n*  1951   – Max Weinberg, American drummer\n*  1952   – Sam Bush, American mandolin player\n*1952 – David Drew, English lawyer and politician\n*  1952   – Gabrielle Gourdeau, Quebec writer (d. 2006)\n*  1952   – Jonjo O'Neill, Irish jockey and trainer\n*1953 – Stephen Byers, English politician, Secretary of State for Transport\n*  1953   – Dany Laferrière, Haitian-Canadian journalist and author\n*1954 – Jimmy Destri, American keyboard player and songwriter \n*  1954   – Niels Olsen, Danish singer-songwriter and guitarist \n*  1954   – Barbara Roche, English lawyer and politician, Minister of State for Immigration\n*1955 – Steve Camp, American singer-songwriter and guitarist\n*  1955   – Muwenda Mutebi II,The reigning King of Buganda Kingdom\n*  1955   – Louis Johnson, American bass player and producer (d. 2015)\n*  1955   – Lupe Pintor, Mexican boxer\n*  1955   – Ole von Beust, German lawyer and politician, 1st Mayor of Hamburg\n*1956 – Possum Bourne, New Zealand race car driver (d. 2003)\n*  1956   – Alan Devonshire, English footballer and manager\n*  1956   – Edward Forbes Smiley III, American art thief and map dealer\n*1957 – Amy Goodman, American journalist and author\n*  1957   – Saundra Santiago, American actress\n*1960 – Lyn Brown, English social worker and politician\n*  1960   – Bob Casey, Jr., American lawyer and politician, senior senator of Pennsylvania\n*  1960   – Olaf Ludwig, German cyclist and manager\n*  1960   – Rudi Völler, German footballer and manager\n*1961 – Hiro Yamamoto, American bass player and songwriter \n*  1962   – Hillel Slovak, Israeli-American guitarist (d. 1988)\n*1963 – Garry Kasparov, Russian chess player and author\n*1964 – Davis Love III, American golfer and sportscaster\n*  1964   – Caroline Rhea, Canadian actress and comedian\n*  1964   – John Swinney, Scottish businessman and politician, Deputy First Minister of Scotland\n*1965 – Patricio Pouchulu, Argentinian architect and educator\n*1966 – Ali Boumnijel, Tunisian footballer\n*  1966   – Marc Ford, American guitarist, songwriter, and producer \n*1967 – Dana Barros, American basketball player, coach, and sportscaster\n*  1967   – Michael Eisen, American biologist and academic\n*  1967   – Olga Tañón, Puerto Rican-American singer-songwriter \n*1968 – Ted Washington, American football player\n*1969 – Dirk Muschiol, German footballer\n*1970 – Monty Brown, American football player and wrestler\n*  1970   – Gerry Creaney, Scottish footballer and manager\n*  1970   – Nick Garrett, English singer \n*  1970   – Szilveszter Csollány, Hungarian gymnast\n*  1970   – Ricardo Rincón, Mexican-American baseball player\n*  1970   – Ricky Schroder, American actor\n*1971 – Franck Esposito, French swimmer\n*  1971   – Danie Mellor, Australian painter and sculptor\n*  1971   – Bo Outlaw, American basketball player\n*  1971   – Valensia, Dutch singer-songwriter, guitarist, and producer\n*1972 – Mariusz Czerkawski, Polish ice hockey player and golfer\n*  1972   – Aaron Lewis, American singer-songwriter and guitarist \n*1974 – Valentina Cervi, Italian actress\n*  1974   – Sergei Gonchar, Russian ice hockey player\n*  1974   – Darren Turner, English race car driver\n*  1974   – David Zdrilic, Australian footballer and manager\n*1975 – Jasey-Jay Anderson, Canadian snowboarder\n*  1975   – Lou Bega, German singer-songwriter\n*  1975   – Bruce Dyer, English footballer\n*  1975   – Tatiana Navka, Russian ice dancer\n*1976 – Jonathan Brandis, American actor (d. 2003)\n*  1976   – Patrik Eliáš, Czech-American ice hockey player\n*  1976   – Glenn Howerton, American actor, producer, and screenwriter\n*1977 – Margus Tsahkna, Estonian lawyer and politician\n*1978 – Arron Asham, Canadian ice hockey player\n*  1978   – Carles Puyol, Spanish footballer\n*  1978   – Raemon Sluiter, Dutch tennis player\n*  1978   – Keydrick Vincent, American football player\n*1979 – Gréta Arn, Hungarian tennis player\n*  1979   – Baron Davis, American basketball player\n*  1979   – Tony Lundon, Irish singer-songwriter, producer, and dancer \n*  1979   – Meghann Shaughnessy, American tennis player\n*1980 – Colleen Clinkenbeard, American voice actress, director, producer, and screenwriter\n*  1980   – Jason Maguire, Irish jockey\n*  1980   – Wayne Purser, English footballer\n*  1980   – Quentin Richardson, American basketball player\n*1981 – Nat Borchers, American soccer player\n*  1981   – Gemma Doyle, Scottish politician\n*1982 – Nellie McKay, British-American singer-songwriter, musician, and actress\n*1983 – Claudio Bravo, Chilean footballer\n*  1983   – Schalk Burger, South African rugby player\n*  1983   – Nicole Cooke, Welsh cyclist\n*  1983   – Hunter Pence, American baseball player\n*1984 – Jarmo Ahjupera, Estonian footballer\n*  1984   – Anders Lindegaard, Danish footballer\n*1985 – Anna Jennings-Edquist, Australian actress, director, and playwright\n*  1985   – Algo Kärp, Estonian skier\n*1986 – Michael Bingham, American-English sprinter\n*  1986   – Lorenzo Cain, American baseball player\n*1987 – Brandon Hardesty, American actor, director, producer, and screenwriter\n*  1987   – Massimiliano Pesenti, Italian footballer\n*  1987   – Allison Weiss, American singer-songwriter\n*1988 – Anderson, Brazilian footballer\n*  1988   – Petteri Koponen, Finnish basketball player\n*  1988   – Allison Williams, American actress and singer\n*1989 – Ryan Bailey, American sprinter\n*  1989   – Dong Dong, Chinese trampolinist\n*  1989   – Nastassia Mironchyk-Ivanova, Belarusian long jumper\n*  1989   – Josh Reynolds, Australian rugby league player \n*  1989   – Vladislav Yegin, Russian ice hockey player\n*1991 – Akeem Adams, Trinidadian footballer (d. 2013)\n*  1991   – Ulises Dávila, Mexican footballer\n*  1991   – Josh Gordon, American football player\n*1992 – Denis Kudryavtsev, Russian hurdler\n*1993 – Tony Wroten, American basketball player\n*1994 – Ángelo Henríquez, Chilean footballer\n*  1994   – Elvis Merzļikins, Latvian ice hockey player\n\nDeaths\n\n* 548 – Lý Nam Đế, Vietnamese emperor (b. 503)\n* 585 – Hermenegild, Visigothic prince and saint\n* 799 – Paul the Deacon, Italian monk and historian (b. 720)\n* 814 – Krum, khan of the Bulgarian Khanate\n* 862 – Donald I, king of the Picts (b. 812)\n*1035 – Herbert I, Count of Maine\n*1093 – Vsevolod I of Kiev (b. 1030)\n*1113 – Ida of Lorraine, saint and noblewoman (b. c. 1040)\n*1138 – Simon I, Duke of Lorraine (b. 1076)\n*1213 – Guy of Thouars, regent of Brittany\n*1275 – Eleanor of England (b. 1215)\n*1367 – John Tiptoft, 2nd Baron Tibetot (b. 1313)\n*1592 – Bartolomeo Ammannati, Italian architect and sculptor (b. 1511)\n*1605 – Boris Godunov, Tsar of Russia (b. 1551)\n*1612 – Sasaki Kojirō, Japanese samurai (b. 1585)\n*1635 – Fakhr-al-Din II, Ottoman prince (b. 1572)\n*1638 – Henri, Duke of Rohan (b. 1579)\n*1641 – Richard Montagu, English bishop (b. 1577)\n*1695 – Jean de La Fontaine, French author and poet (b. 1621)\n*1716 – Arthur Herbert, 1st Earl of Torrington, English admiral and politician (b. 1648)\n*1722 – Charles Leslie, Irish priest and theologian (b. 1650)\n*1793 – Pierre Gaspard Chaumette, French botanist, lawyer, and politician (b. 1763)\n*1794 – Nicolas Chamfort, French playwright and poet (b. 1741)\n*1826 – Franz Danzi, German cellist, composer, and conductor (b. 1763)\n*1853 – Leopold Gmelin, German chemist and academic (b. 1788)\n*  1853   – James Iredell, Jr., American lawyer and politician, 23rd Governor of North Carolina (b. 1788)\n*1855 – Henry De la Beche, English geologist and palaeontologist (b. 1796)\n*1868 – Tewodros II of Ethiopia (b. 1818)\n*1880 – Robert Fortune, Scottish botanist and author (b. 1813)\n*1882 – Bruno Bauer, German historian and philosopher (b. 1809)\n*1886 – John Humphrey Noyes, American religious leader, founded the Oneida Community (b. 1811)\n*1890 – Samuel J. Randall, American captain, lawyer, and politician, 33rd Speaker of the United States House of Representatives (b. 1828)\n*1909 – Whitley Stokes, Anglo-Irish lawyer and scholar (b. 1830)\n*1910 – William Quiller Orchardson, Scottish-English painter and educator (b. 1835)\n*1911 – John McLane, Scottish-American politician, 50th Governor of New Hampshire (b. 1852)\n*  1911   – George Washington Glick, American lawyer and politician, 9th Governor of Kansas (b. 1827)\n*1912 – Takuboku Ishikawa, Japanese poet and author (b. 1886)\n*1918 – Lavr Kornilov, Russian general (b. 1870)\n*1927 – Georg Voigt, German politician, Mayor of Frankfurt (b. 1866)\n*1936 – Konstantinos Demertzis, Greek politician 129th Prime Minister of Greece (b. 1876)\n*1938 – Grey Owl, English-Canadian environmentalist and author (b. 1888)\n*1941 – Annie Jump Cannon, American astronomer and academic (b. 1863)\n*  1941   – William Twaits, Canadian soccer player (b. 1879)\n*1942 – Henk Sneevliet, Dutch politician (b. 1883)\n*  1942   – Anton Uesson, Estonian engineer and politician, 17th Mayor of Tallinn (b. 1879)\n*1944 – Cécile Chaminade, French pianist and composer (b. 1857)\n*1945 – Ernst Cassirer, Polish-American philosopher and academic (b. 1874)\n*1954 – Samuel Jones, American high jumper (b. 1880)\n*  1954   – Angus Lewis Macdonald, Canadian lawyer and politician, 12th Premier of Nova Scotia (b. 1890)\n*1956 – Emil Nolde, Danish-German painter and educator (b. 1867)\n*1959 – Eduard van Beinum, Dutch pianist, violinist, and conductor (b. 1901)\n*1961 – John A. Bennett, American soldier (b. 1935)\n*1962 – Culbert Olson, American lawyer and politician, 29th Governor of California (b. 1876)\n*1966 – Abdul Salam Arif, Iraqi colonel and politician, 2nd President of Iraq (b. 1921)\n*  1966   – Carlo Carrà, Italian painter (b. 1881)\n*  1966   – Georges Duhamel, French soldier and author (b. 1884)\n*1967 – Nicole Berger, French actress (b. 1934)\n*1969 – Alfred Karindi, Estonian pianist and composer (b. 1901)\n*1971 – Michel Brière, Canadian ice hockey player (b. 1949)\n*  1971   – Juhan Smuul, Estonian author, poet, and screenwriter (b. 1921)\n*1975 – Larry Parks, American actor and singer (b. 1914)\n*  1975   – François Tombalbaye, Chadian soldier, academic, and politician, 1st President of Chad (b. 1918)\n*1978 – Jack Chambers, Canadian painter and director (b. 1931)\n*1980 – Markus Höttinger, Austrian race car driver (b. 1956)\n*1983 – Gerry Hitchens, English footballer (b. 1934)\n*  1983   – Theodore Stephanides, Greek physician, author, and poet (b. 1896)\n*1984 – Ralph Kirkpatrick, American harp player and musicologist (b. 1911)\n*1988 – Jean Gascon, Canadian actor and director (b. 1920)\n*1992 – Maurice Sauvé, Canadian economist and politician (b. 1923)\n*  1992   – Feza Gürsey, Turkish mathematician and physicist (b. 1921)\n*1993 – Wallace Stegner, American novelist, short story writer, and essayist (b. 1909)\n*1996 – Leila Mackinlay, English author and educator (b. 1910)\n*1997 – Bryant Bowles, American soldier and activist, founded the National Association for the Advancement of White People (b. 1920)\n*  1997   – Alan Cooley, Australian public servant (b. 1920)\n*  1997   – Dorothy Frooks, American author and actress (b. 1896)\n*  1997   – Voldemar Väli, Estonian wrestler (b. 1903) \n*1998 – Patrick de Gayardon, French skydiver and base jumper (b. 1960)\n*1999 – Ortvin Sarapu, Estonian-New Zealand chess player and author (b. 1924)\n*  1999   – Willi Stoph, German engineer and politician, 2nd Prime Minister of East Germany (b. 1914)\n*2000 – Giorgio Bassani, Italian author and poet (b. 1916)\n*  2000   – Frenchy Bordagaray, American baseball player and manager (b. 1910)\n*2002 – Desmond Titterington, Northern Irish race car driver (b. 1928)\n*2004 – Caron Keating, Northern Irish television host (b. 1962)\n*2005 – Don Blasingame, American baseball player, coach, and manager (b. 1932)\n*  2005   – Johnnie Johnson, American pianist and songwriter (b. 1924)\n*  2005   – Phillip Pavia, American painter and sculptor (b. 1912)\n*  2005   – Philippe Volter, Belgian actor and director (b. 1959)\n*2006 – Bill Baker, American baseball player, coach, and umpire (b. 1911)\n*  2006   – Muriel Spark, Scottish novelist, poet, and critic (b. 1918)\n*2008 – John Archibald Wheeler, American physicist and academic (b. 1911)\n*2009 – Mark Fidrych, American baseball player (b. 1954)\n*  2009   – Bruce Snyder, American football player and coach (b. 1940)\n*2012 – William B. Buffum, American soldier and diplomat, United States Ambassador to Lebanon (b. 1921)\n*  2012   – Cecil Chaudhry, Pakistani pilot, academic, and activist (b. 1941)\n*  2012   – Shūichi Higurashi, Japanese illustrator (b. 1936)\n*  2012   – David S. Smith, American diplomat, United States Ambassador to Sweden (b. 1918)\n*  2012   – Robert Wigmore, Cook Islander politician, 14th Deputy Prime Minister of the Cook Islands (b. 1949)\n*2013 – Chi Cheng, American bass player (b. 1970)\n*  2013   – Stephen Dodgson, English composer and educator (b. 1924)\n*  2013   – Dean Drummond, American composer and conductor (b. 1949)\n*  2013   – Vincent Montana, Jr., American drummer and composer (b. 1928)\n*  2013   – Lin Yang-kang, Taiwanese politician, 29th Vice Premier of the Republic of China (b. 1927)\n*2014 – Fred Enke, American football player (b. 1924)\n*  2014   – Ernesto Laclau, Argentinian-Spanish philosopher and theorist (b. 1935)\n*  2014   – Michael Ruppert, American journalist and author (b. 1951)\n*  2014   – Rafał Sznajder, Polish fencer (b. 1972)\n*2015 – Gerald Calabrese, American basketball player and politician (b. 1925)\n*  2015   – Ronnie Carroll, Irish singer and politician (b. 1934)\n*  2015   – Thelma Coyne Long, Australian tennis player and captain (b. 1918)\n*  2015   – Eduardo Galeano, Uruguayan journalist and author (b. 1940)\n*  2015   – Günter Grass, German novelist, poet, playwright, and illustrator, Nobel Prize laureate (b. 1927)\n*  2015   – Herb Trimpe, American author and illustrator (b. 1939)\n*2016 – Nera White, American basketball player (b. 1935)\n*2017 – Dan Rooney, American football executive and former United States Ambassador to Ireland (b. 1932)\n\nHolidays and observances\n\n* Christian feast day:\n** Hermenegild\n** Pope Martin I\n** April 13 (Eastern Orthodox liturgics)\n* Jefferson's Birthday (United States)\n* Katyn Memorial Day (Poland)\n* South and Southeast Asian New Year. (see April 14)\n* Teacher's Day (Ecuador) \n* Unfairly Prosecuted Persons Day (Slovakia). April 13. http://en.wikipedia.org/?curid=1541."
  }
}
