{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6339",
  "eid" : "db10cb00-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778447280,
  "textBody" : "Cell biology or cytology or cytobiology, (from the Greek κυτος, kytos, \"vessel\") is a branch of biology that studies the different structures and functions of the cell and focuses mainly on the idea of the cell as the basic unit of life. Cell biology explains the structure, organization of the organelles they contain, their physiological properties, metabolic processes, signaling pathways, life cycle, and interactions with their environment. This is done both on a microscopic and molecular level as it encompasses prokaryotic cells and eukaryotic cells. Knowing the components of cells and how cells work is fundamental to all biological sciences; it is also essential for research in bio-medical fields such as cancer, and other diseases. Research in cell biology is closely related to genetics, biochemistry, molecular biology, immunology, and developmental biology.\n\nInternal cellular structures\n\nChemical and molecular environment\n\nThe study of the cell is done on a molecular level; however, most of the processes within the cell are made up of a mixture of small organic molecules, inorganic ions, hormones, and water. Approximately 75–85% of the cell's volume is due to water making it an indispensable solvent as a result of its polarity and structure. These molecules within the cell, which operate as substrates, provide a suitable environment for the cell to carry out metabolic reactions and signalling. The cell shape varies among the different types of organisms, and are thus then classified into two categories: eukaryotes and prokaryotes. In the case of eukaryotic cells – which are made up of animal, plant, fungi, and protozoa cells – the shapes are generally round and spherical, while for prokaryotic cells – which are composed of bacteria and archaea – the shapes are: spherical (cocci), rods (bacillus), curved (vibrio), and spirals (spirochetes). \n\nCell biology focuses more on the study of eukaryotic cells, and their signalling pathways, rather than on prokaryotes which is covered under microbiology. The main constituents of the general molecular composition of the cell includes: proteins and lipids which are either free-flowing or membrane-bound, along with different internal compartments known as organelles. This environment of the cell is made up of hydrophilic and hydrophobic regions which allows for the exchange of the above-mentioned molecules and ions. The hydrophilic regions of the cell are mainly on the inside and outside of the cell, while the hydrophobic regions are within the phospholipid bilayer of the cell membrane. The cell membrane consists of lipids and proteins, which accounts for its hydrophobicity as a result of being non-polar substances. Therefore, in order for these molecules to participate in reactions, within the cell, they need to be able to cross this membrane layer to get into the cell. They accomplish this process of gaining access to the cell via: osmotic pressure, diffusion, concentration gradients, and membrane channels. Inside of the cell are extensive internal sub-cellular membrane-bounded compartments called organelles.\n\nOrganelles \n\n* Centrosome – an associated pair of cylindrical shaped protein structures (centrioles) that organize microtubules and aid in forming the mitotic spindle during cell division in eukaryotes\n*Cell membrane (plasma membrane) – the part of the cell which separates the cells from the outside environment and protects the cell, as well as regulating what goes in and out of the cell\n*Cell wall – extra layer of protection and gives structural support (only found in plant cells)\n*Chloroplast – key organelle for photosynthesis (only found in plant cells)\n*Cilium – motile structure of eukaryotes having a cytoskeleton, the axoneme.\n*Cytoplasm – contents of the main fluid-filled space inside cells, chemical reactions also happen in this jelly-like substance.\n*Cytoskeleton – protein filaments inside cells (microfilaments, microtubules, and intermediate filaments)\n*Endoplasmic reticulum (rough) – major site of membrane protein synthesis\n*Endoplasmic reticulum (smooth) – major site of lipid synthesis\n*Endosomes – vesicles that traffic membrane and intra and extra cellular contents for recycling or degradation by lysosomes\n*Flagellum – motile structure of bacteria, archaea and eukaryotes\n*Golgi apparatus – site of protein glycosylation in the endomembrane system\n*Lipid bilayer – fundamental organizational structure of cell membranes\n*Lysosome –  acidic organelle that breaks down cellular waste products and debris into simple compounds (only found in animal cells)\n*Microvilli – increases surface area for absorption of nutrients from surrounding medium\n*Mitochondrion – major energy-producing organelle by releasing energy in the form of ATP\n*Nucleus – contains chromosomes composed of DNA, the building block of life. Nuclear Architecture is important for dictating nuclear function.\n*Organelle – term used for major subcellular structures\n*Peroxisomes – a very small organelle that uses oxygen to breakdown and detoxify long fatty acids and other molecules\n*Pili – also called fimbria is used for conjugation and sometimes movement\n*Ribosome – RNA and protein complex required for protein synthesis in cells\n*Starch grain – found in the cytoplasm of a typical plant cell, it stores chemical energy of the plant.\n*Vacuole – contain cell sap or other storage material. \n*Vesicle – small membrane-bounded spheres inside cells which transport substances.\n\nProcesses\n\nGrowth and development \n\nThe growth process of the cell does not refer to the size of the cell, but instead the density of the number of cells present in the organism at a given time. Cell growth pertains to the increase in the number of cells present in an organism as it grows and develops; as the organism gets larger so too does the number of cells present. Cells are the foundation of all organisms, they are the fundamental unit of life. The growth and development of the cell are essential for the maintenance of the host, and survival of the organisms. For this process the cell goes through the steps of the cell cycle and development which involves cell growth, DNA replication, cell division, regeneration, specialization, and cell death. The cell cycle is divided into four distinct phases, G1, S, G2, and M. The G phases – which is the cell growth phase – makes up approximately 95% of the cycle. The proliferation of cells is instigated by progenitors, the cells then differentiate to become specialized, where specialized cells of the same type aggregate to form tissues, then organs and ultimately systems. The G phases along with the S phase – DNA replication, damage and repair – are considered to be the interphase portion of the cycle. While the M phase (mitosis and cytokinesis) is the cell division portion of the cycle. The cell cycle is regulated by a series of signalling factors and complexes such as CDK's, kinases, and p53. to name a few. When the cell has completed its growth process, and if it is found to be damaged or altered it undergoes cell death, either by apoptosis or necrosis, to eliminate the threat it causes to the organism's survival.\n\nOther cellular processes\n\n*Active transport and passive transport – The movement of molecules into and out of cells.\n*Autophagy – The process whereby cells \"eat\" their own internal components or microbial invaders.\n*Adhesion – Holding together cells and tissues.\n*Cell movement – Cell migration, Chemotaxis, contraction, cilia and flagella.\n*Cell signaling – Regulation of cell behavior by signals from outside.\n*Division – By which cells reproduce either by mitosis (to produce clones of the parent cell) or Meiosis (to produce haploid gametes)\n*DNA repair – Cell death and cell senescence.\n*Metabolism – Glycolysis, respiration, photosynthesis, and chemosynthesis.\n*Signalling – The process by which the activities in the cell are regulated\n*Transcription and mRNA splicing – Gene expression.\n\nTechniques used to study cells\n\nCells may be observed under the microscope, using several different techniques; these include optical microscopy, transmission electron microscopy, scanning electron microscopy, fluorescence microscopy, correlative light-electron microscopy, and confocal microscopy.\n\nThere are several different methods used in the study of cells:\n*Cell culture is the basic technique of growing cells in a laboratory independent of an organism.\n*Immunostaining, also known as immunohistochemistry, is a specialized histological method used to localize proteins in cells or tissue slices. Unlike regular histology, which uses stains to identify cells, cellular components or protein classes, immunostaining requires the reaction of an antibody directed against the protein of interest within the tissue or cell. Through the use of proper controls and published protocols (need to add reference links here), specificity of the antibody-antigen reaction can be achieved. Once this complex is formed, it is identified via either a \"tag\" attached directly to the antibody, or added in an additional technical step. Commonly used \"tags\" include fluorophores or enzymes. In the case of the former, detection of the location of the \"immuno-stained\" protein occurs via fluorescence microscopy. With an enzymatic tag, such as horse radish peroxidase, a chemical reaction is carried out that results in a dark color in the location of the protein of interest. This darkened pattern is then detected using light microscopy.\n*Computational genomics is used to find patterns in genomic informationCristianini, N. and Hahn, M. [http://www.computational-genomics.net/ Introduction to Computational Genomics], Cambridge University Press, 2006. ( | )\n*DNA microarrays identify changes in transcript levels between different experimental conditions.\n*Gene knockdown mutates a selected gene.\n*In situ hybridization shows which cells are expressing a particular RNA transcript.\n*PCR can be used to determine how many copies of a gene are present in a cell.\n*Transfection introduces a new gene into a cell, usually an expression construct\n\nPurification of cells and their parts\nPurification may be performed using the following methods:\n*Cell fractionation\n**Release of cellular organelles by disruption of cells.\n**Separation of different organelles by centrifugation.\n*Flow cytometry\n*Immunoprecipitation\n**The binding of an antibody to a target protein \n**Collection of the target protein through elution\n*Proteins extracted from cell membranes by detergents and salts or other kinds of chemicals.\n\nCareer and related fields\n\nPractical job applications for a degree in Cell Molecular Biology includes the following.\n\n*Agriculture\n*Bioinformatics and medical informatics\n*Biomedical research\n*Biotechnology\n*Biotechnology policy\n*Brewery production\n*Business\n*Cellular agriculture\n*Clinical diagnostics\n*College and university reaching\n*Crop improvement\n*Elementary, middle and high school teaching\n*Environmental technician/consultant\n*Food production and safety\n*Forensic scientist\n*Geneticist\n\n*Genetic engineering\n*Government jobs\n*Healthcare industries\n*Health policies\n*Health law\n*Laboratory technician\n*Medical research\n*Medical school\n*Medical technology\n*Microbiologist\n*Nutrition\n*Patent law\n*Patient care\n*Pest control\n*Pharmaceutical science\n*Pharmaceutical sales representative\n*Physician assistant\n*Product quality and safety\n\n*Research assistant\n*Research coordinator\n*Research scientist\n*Research technician\n*Science administration\n*Science education\n*Science journalism\n*Science policy\n*Scientific editing\n*Scientific illustrator\n*Scientific instrumentation companies\n*Scientific supply representative\n*Teacher\n*Technical writing\n*Toxicology\n*Training and outreach in industry and government  \n\nNotable cell biologists\n\n*Jean Baptiste Carnoy\n*Peter Agre\n*Günter Blobel\n*Robert Brown\n*Geoffrey M. Cooper\n*Christian de Duve\n*Robert Hooke\n*H. Robert Horvitz\n\n*Marc Kirschner\n*Anton van Leeuwenhoek\n*Ira Mellman\n*Peter D. Mitchell\n*Rudolf Virchow\n*Paul Nurse\n*George Emil Palade\n*Keith R. Porter\n\n*Jan Evangelista Purkyně \n*Ray Rappaport\n*Michael Swann\n\n*Roger Tsien\n*Edmund Beecher Wilson\n*Kenneth R. Miller\n*Matthias Jakob Schleiden\n*Theodor Schwann\n*Yoshinori Ohsumi\n*Camillo Golgi",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Cell biology" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6339" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Cell biology or cytology or cytobiology, (from the Greek κυτος, kytos, \"vessel\") is a branch of biology that studies the different structures and functions of the cell and focuses mainly on the idea of the cell as the basic unit of life. Cell biology explains the structure, organization of the organelles they contain, their physiological properties, metabolic processes, signaling pathways, life cycle, and interactions with their environment. This is done both on a microscopic and molecular level as it encompasses prokaryotic cells and eukaryotic cells. Knowing the components of cells and how cells work is fundamental to all biological sciences; it is also essential for research in bio-medical fields such as cancer, and other diseases. Research in cell biology is closely related to genetics, biochemistry, molecular biology, immunology, and developmental biology.\n\nInternal cellular structures\n\nChemical and molecular environment\n\nThe study of the cell is done on a molecular level; however, most of the processes within the cell are made up of a mixture of small organic molecules, inorganic ions, hormones, and water. Approximately 75–85% of the cell's volume is due to water making it an indispensable solvent as a result of its polarity and structure. These molecules within the cell, which operate as substrates, provide a suitable environment for the cell to carry out metabolic reactions and signalling. The cell shape varies among the different types of organisms, and are thus then classified into two categories: eukaryotes and prokaryotes. In the case of eukaryotic cells – which are made up of animal, plant, fungi, and protozoa cells – the shapes are generally round and spherical, while for prokaryotic cells – which are composed of bacteria and archaea – the shapes are: spherical (cocci), rods (bacillus), curved (vibrio), and spirals (spirochetes). \n\nCell biology focuses more on the study of eukaryotic cells, and their signalling pathways, rather than on prokaryotes which is covered under microbiology. The main constituents of the general molecular composition of the cell includes: proteins and lipids which are either free-flowing or membrane-bound, along with different internal compartments known as organelles. This environment of the cell is made up of hydrophilic and hydrophobic regions which allows for the exchange of the above-mentioned molecules and ions. The hydrophilic regions of the cell are mainly on the inside and outside of the cell, while the hydrophobic regions are within the phospholipid bilayer of the cell membrane. The cell membrane consists of lipids and proteins, which accounts for its hydrophobicity as a result of being non-polar substances. Therefore, in order for these molecules to participate in reactions, within the cell, they need to be able to cross this membrane layer to get into the cell. They accomplish this process of gaining access to the cell via: osmotic pressure, diffusion, concentration gradients, and membrane channels. Inside of the cell are extensive internal sub-cellular membrane-bounded compartments called organelles.\n\nOrganelles \n\n* Centrosome – an associated pair of cylindrical shaped protein structures (centrioles) that organize microtubules and aid in forming the mitotic spindle during cell division in eukaryotes\n*Cell membrane (plasma membrane) – the part of the cell which separates the cells from the outside environment and protects the cell, as well as regulating what goes in and out of the cell\n*Cell wall – extra layer of protection and gives structural support (only found in plant cells)\n*Chloroplast – key organelle for photosynthesis (only found in plant cells)\n*Cilium – motile structure of eukaryotes having a cytoskeleton, the axoneme.\n*Cytoplasm – contents of the main fluid-filled space inside cells, chemical reactions also happen in this jelly-like substance.\n*Cytoskeleton – protein filaments inside cells (microfilaments, microtubules, and intermediate filaments)\n*Endoplasmic reticulum (rough) – major site of membrane protein synthesis\n*Endoplasmic reticulum (smooth) – major site of lipid synthesis\n*Endosomes – vesicles that traffic membrane and intra and extra cellular contents for recycling or degradation by lysosomes\n*Flagellum – motile structure of bacteria, archaea and eukaryotes\n*Golgi apparatus – site of protein glycosylation in the endomembrane system\n*Lipid bilayer – fundamental organizational structure of cell membranes\n*Lysosome –  acidic organelle that breaks down cellular waste products and debris into simple compounds (only found in animal cells)\n*Microvilli – increases surface area for absorption of nutrients from surrounding medium\n*Mitochondrion – major energy-producing organelle by releasing energy in the form of ATP\n*Nucleus – contains chromosomes composed of DNA, the building block of life. Nuclear Architecture is important for dictating nuclear function.\n*Organelle – term used for major subcellular structures\n*Peroxisomes – a very small organelle that uses oxygen to breakdown and detoxify long fatty acids and other molecules\n*Pili – also called fimbria is used for conjugation and sometimes movement\n*Ribosome – RNA and protein complex required for protein synthesis in cells\n*Starch grain – found in the cytoplasm of a typical plant cell, it stores chemical energy of the plant.\n*Vacuole – contain cell sap or other storage material. \n*Vesicle – small membrane-bounded spheres inside cells which transport substances.\n\nProcesses\n\nGrowth and development \n\nThe growth process of the cell does not refer to the size of the cell, but instead the density of the number of cells present in the organism at a given time. Cell growth pertains to the increase in the number of cells present in an organism as it grows and develops; as the organism gets larger so too does the number of cells present. Cells are the foundation of all organisms, they are the fundamental unit of life. The growth and development of the cell are essential for the maintenance of the host, and survival of the organisms. For this process the cell goes through the steps of the cell cycle and development which involves cell growth, DNA replication, cell division, regeneration, specialization, and cell death. The cell cycle is divided into four distinct phases, G1, S, G2, and M. The G phases – which is the cell growth phase – makes up approximately 95% of the cycle. The proliferation of cells is instigated by progenitors, the cells then differentiate to become specialized, where specialized cells of the same type aggregate to form tissues, then organs and ultimately systems. The G phases along with the S phase – DNA replication, damage and repair – are considered to be the interphase portion of the cycle. While the M phase (mitosis and cytokinesis) is the cell division portion of the cycle. The cell cycle is regulated by a series of signalling factors and complexes such as CDK's, kinases, and p53. to name a few. When the cell has completed its growth process, and if it is found to be damaged or altered it undergoes cell death, either by apoptosis or necrosis, to eliminate the threat it causes to the organism's survival.\n\nOther cellular processes\n\n*Active transport and passive transport – The movement of molecules into and out of cells.\n*Autophagy – The process whereby cells \"eat\" their own internal components or microbial invaders.\n*Adhesion – Holding together cells and tissues.\n*Cell movement – Cell migration, Chemotaxis, contraction, cilia and flagella.\n*Cell signaling – Regulation of cell behavior by signals from outside.\n*Division – By which cells reproduce either by mitosis (to produce clones of the parent cell) or Meiosis (to produce haploid gametes)\n*DNA repair – Cell death and cell senescence.\n*Metabolism – Glycolysis, respiration, photosynthesis, and chemosynthesis.\n*Signalling – The process by which the activities in the cell are regulated\n*Transcription and mRNA splicing – Gene expression.\n\nTechniques used to study cells\n\nCells may be observed under the microscope, using several different techniques; these include optical microscopy, transmission electron microscopy, scanning electron microscopy, fluorescence microscopy, correlative light-electron microscopy, and confocal microscopy.\n\nThere are several different methods used in the study of cells:\n*Cell culture is the basic technique of growing cells in a laboratory independent of an organism.\n*Immunostaining, also known as immunohistochemistry, is a specialized histological method used to localize proteins in cells or tissue slices. Unlike regular histology, which uses stains to identify cells, cellular components or protein classes, immunostaining requires the reaction of an antibody directed against the protein of interest within the tissue or cell. Through the use of proper controls and published protocols (need to add reference links here), specificity of the antibody-antigen reaction can be achieved. Once this complex is formed, it is identified via either a \"tag\" attached directly to the antibody, or added in an additional technical step. Commonly used \"tags\" include fluorophores or enzymes. In the case of the former, detection of the location of the \"immuno-stained\" protein occurs via fluorescence microscopy. With an enzymatic tag, such as horse radish peroxidase, a chemical reaction is carried out that results in a dark color in the location of the protein of interest. This darkened pattern is then detected using light microscopy.\n*Computational genomics is used to find patterns in genomic informationCristianini, N. and Hahn, M. [http://www.computational-genomics.net/ Introduction to Computational Genomics], Cambridge University Press, 2006. ( | )\n*DNA microarrays identify changes in transcript levels between different experimental conditions.\n*Gene knockdown mutates a selected gene.\n*In situ hybridization shows which cells are expressing a particular RNA transcript.\n*PCR can be used to determine how many copies of a gene are present in a cell.\n*Transfection introduces a new gene into a cell, usually an expression construct\n\nPurification of cells and their parts\nPurification may be performed using the following methods:\n*Cell fractionation\n**Release of cellular organelles by disruption of cells.\n**Separation of different organelles by centrifugation.\n*Flow cytometry\n*Immunoprecipitation\n**The binding of an antibody to a target protein \n**Collection of the target protein through elution\n*Proteins extracted from cell membranes by detergents and salts or other kinds of chemicals.\n\nCareer and related fields\n\nPractical job applications for a degree in Cell Molecular Biology includes the following.\n\n*Agriculture\n*Bioinformatics and medical informatics\n*Biomedical research\n*Biotechnology\n*Biotechnology policy\n*Brewery production\n*Business\n*Cellular agriculture\n*Clinical diagnostics\n*College and university reaching\n*Crop improvement\n*Elementary, middle and high school teaching\n*Environmental technician/consultant\n*Food production and safety\n*Forensic scientist\n*Geneticist\n\n*Genetic engineering\n*Government jobs\n*Healthcare industries\n*Health policies\n*Health law\n*Laboratory technician\n*Medical research\n*Medical school\n*Medical technology\n*Microbiologist\n*Nutrition\n*Patent law\n*Patient care\n*Pest control\n*Pharmaceutical science\n*Pharmaceutical sales representative\n*Physician assistant\n*Product quality and safety\n\n*Research assistant\n*Research coordinator\n*Research scientist\n*Research technician\n*Science administration\n*Science education\n*Science journalism\n*Science policy\n*Scientific editing\n*Scientific illustrator\n*Scientific instrumentation companies\n*Scientific supply representative\n*Teacher\n*Technical writing\n*Toxicology\n*Training and outreach in industry and government  \n\nNotable cell biologists\n\n*Jean Baptiste Carnoy\n*Peter Agre\n*Günter Blobel\n*Robert Brown\n*Geoffrey M. Cooper\n*Christian de Duve\n*Robert Hooke\n*H. Robert Horvitz\n\n*Marc Kirschner\n*Anton van Leeuwenhoek\n*Ira Mellman\n*Peter D. Mitchell\n*Rudolf Virchow\n*Paul Nurse\n*George Emil Palade\n*Keith R. Porter\n\n*Jan Evangelista Purkyně \n*Ray Rappaport\n*Michael Swann\n\n*Roger Tsien\n*Edmund Beecher Wilson\n*Kenneth R. Miller\n*Matthias Jakob Schleiden\n*Theodor Schwann\n*Yoshinori Ohsumi\n*Camillo Golgi. Cell biology. http://en.wikipedia.org/?curid=6339."
  }
}
