{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=20405",
  "eid" : "421c08f0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778620159,
  "textBody" : "Miles Dewey Davis III (May 26, 1926September 28, 1991) was an American jazz trumpeter, bandleader, and composer. He is among the most influential and acclaimed figures in the history of jazz and 20th century music. Davis adopted a variety of musical directions in his five-decade career which kept him at the forefront of a number of major stylistic developments in jazz.\n\nBorn and raised in Illinois, Davis left his studies at The Juilliard School in New York City and made his professional debut as a member of saxophonist Charlie Parker's bebop quintet from 1944 to 1948. Shortly after, he recorded the Birth of the Cool sessions for Capitol Records, which were instrumental to the development of cool jazz. In the early 1950s, Davis recorded some of the earliest hard bop music while on Prestige Records but did so haphazardly due to a heroin addiction. After a widely acclaimed comeback performance at the Newport Jazz Festival in 1955, he signed a long-term contract with Columbia Records and recorded the 1957 album 'Round About Midnight. It was his first work with saxophonist John Coltrane and bassist Paul Chambers, key members of the sextet he led into the early 1960s. During this period, he alternated between orchestral jazz collaborations with arranger Gil Evans, such as the Spanish music-influenced Sketches of Spain (1960), and band recordings, such as Milestones (1958) and Kind of Blue (1959). The latter recording remains one of the most popular jazz albums of all time, having sold over four million copies in the U.S.\n\nDavis made several line-up changes while recording Someday My Prince Will Come (1961), his 1961 Blackhawk concerts, and Seven Steps to Heaven (1963), another mainstream success that introduced bassist Ron Carter, pianist Herbie Hancock, and drummer Tony Williams. After adding saxophonist Wayne Shorter to his new quintet in 1964, Davis led them on a series of more abstract recordings often composed by the band members, helping pioneer the post-bop genre with albums such as E.S.P (1965) and Miles Smiles (1967), before transitioning into his electric period. During the 1970s, he radically experimented with rock, funk, African rhythms, emerging electronic music technology, and an ever-changing line-up of musicians, including keyboardist Joe Zawinul, drummer Al Foster, and guitarist John McLaughlin. This period, beginning with Davis' 1969 studio album In a Silent Way and concluding with the 1975 concert recording Agharta, was the most controversial in his career, alienating and challenging many in jazz.;  His million-selling 1970 record Bitches Brew helped spark a resurgence in the genre's commercial popularity with jazz fusion as the decade progressed.\n\nAfter a five-year retirement due to poor health, Davis resumed his career in the 1980s, employing younger musicians and pop music sounds on albums such as The Man with the Horn (1981) and Tutu (1986). Critics were generally unreceptive but the decade garnered the trumpeter his highest level of commercial recognition. He performed sold-out concerts worldwide while branching out into visual arts, film, and television work, before his death in 1991 from the combined effects of a stroke, pneumonia and respiratory failure. In 2006, Davis was inducted into the Rock and Roll Hall of Fame, which recognized him as \"one of the key figures in the history of jazz\". Rolling Stone described him as \"the most revered jazz trumpeter of all time, not to mention one of the most important musicians of the 20th century,\" while Gerald Early called him inarguably one of the most influential and innovative musicians of that period.\n\nEarly life\n\nMiles Dewey Davis III was born on May 26, 1926 to an affluent African-American family in Alton, Illinois, fifteen miles north of St. Louis. He had an older sister, Dorothy Mae (b. 1925), and a younger brother, Vernon (b. 1929). His mother, Cleota Mae (née Henry) of Arkansas, was a music teacher and violinist, and his father, Miles Dewey Davis, Jr., also of Arkansas, was a dentist.  They owned a 200-acre estate near Pine Bluff, Arkansas that housed a profitable pig farm where Davis and his siblings would ride horses, fish, and hunt. In 1927, the family moved to East St. Louis, Illinois, living on the second floor of a commercial building in a predominantly white neighborhood behind a dental office.  From 1932 to 1934, Davis attended John Robinson Elementary School, an all-black institution, followed by Crispus Attucks School, where he performed well in mathematics, music, and sports. As a youngster Davis developed his earliest appreciation for music, citing the blues, big bands, and gospel music.\n\nIn 1935, Davis received his first trumpet as a gift from John Eubanks, a friend of his father, and later took weekly lessons with his father's patient, teacher and musician Elwood Buchanan. His mother objected to the choice of instrument as she preferred her son take up the violin. Against the fashion of the time, Buchanan stressed the importance of playing without vibrato and encouraged him to adopt a more clear, mid-range tone; Davis claimed he would slap his knuckles every time he started using heavy vibrato. Davis would carry his clear signature tone throughout his career. He once remarked on its importance to him, saying, \"I prefer a round sound with no attitude in it, like a round voice with not too much tremolo and not too much bass. Just right in the middle. If I can't get that sound I can't play anything.\"Kahn In 1939, the family moved to 1701 Kansas Avenue in East St. Louis. For his thirteenth birthday that year Davis' father bought his son a new trumpet, and Davis began to play in local bands, earning as much as $85 a week (US$ in  dollars). Around this time Davis took additional trumpet lessons from Joseph Gustat, principal trumpeter of the St. Louis Symphony Orchestra.\n\nIn 1941, the 15-year-old Davis began at East St. Louis Lincoln High School, where he joined the school's marching band directed by Buchanan and entered music competitions. Davis claimed the contests he did not win were largely due to prejudice over his race, but said that such experiences made him a better musician. Davis proceeded to improve his understanding of music after a drummer he played with around this time suggested Davis play a passage from the previous night, yet Davis was unable to comprehend what he meant. \"That hit me ... I went and got everything, every book I could get to learn about theory\". It was at Lincoln High where Davis met his first girlfriend, Irene Birth (later Cawthon). Davis had formed his own group by this time, performing in various local venues such as Elks Club and Huff's Beer Garden with hits such as \"In the Mood\" by Glenn Miller. A portion of his earnings went towards his sister's education at Fisk University. Davis also befriended trumpeter Clark Terry, who also suggested he play without vibrato and performed together in various capacities for several years.\n\nIn 1943, at Buchanan's recommendation and Cawthon's persuasion, Davis filled a vacant spot in Eddie Randle's Rhumboogie Orchestra, also known as the Blue Devils, and eventually became its musical director which involved the scheduling of rehearsals and hiring newcomers. Davis later acknowledged his tenure as one of the most important of his career. During this time, Sonny Stitt tried to persuade him to join the Tiny Bradshaw band, then passing through town, but Davis' mother insisted that he finish his final year of high school before he could tour. He said, \"I didn't talk to her for two weeks. And I didn't go with the band either\". In January 1944, Davis finished his studies at East St. Louis Lincoln High School and graduated in absentia in June. The following month, Cawthon gave birth to a daughter, Cheryl.\n\nIn July 1944, Billy Eckstine and his big band, which featured Dizzy Gillespie, Charlie Parker, and Art Blakey, visited St. Louis for a series of performances. They needed a stand-in after third trumpeter Buddy Anderson was too ill to attend. They invited Davis, who accepted and played with the group for two weeks at Club Riviera. The experience was a profound one for Davis, after which he \"had to be in New York, where the action was\". His mother wanted him to continue with his education and study the piano or violin at Fisk University with his sister, but Davis declined.\n\nCareer \n\n1944–1948: New York City and the bebop years\n\nIn September 1944, Davis accepted his father's idea of studying at the Institute of Musical Arts, later known as the Juilliard School, in New York City. Davis passed his audition and attended classes in music theory, piano and dictation, but soon lost focus and spent much of his time in the club scene and locating Parker, despite being advised against doing so by several people he met in his search, including Coleman Hawkins.The Autobiography.  After finally locating his idol, Davis became one of the cadre of musicians who held nightly jam sessions at two Harlem nightclubs, Minton's Playhouse and Monroe's. The group included many of the future leaders of the bebop revolution such as Fats Navarro, Freddie Webster, and J. J. Johnson. Established musicians including Thelonious Monk and Kenny Clarke were also regular participants. In December 1944, Davis reunited with Cawthon and their daughter when they relocated to New York City, the three living in the same building as Parker who eventually became a roommate.\n\nIn mid-1945, Davis failed to register for the year's autumn term of study at Juilliard and dropped out after three semesters as he wished to commit to jazz performance full-time. His father advised his son to avoid sounding like everyone else and find his own style yet remained supportive and continued to send over money until Davis could earn enough on his own. Davis later criticized the school's classes for centering too much on the classical European and \"white\" repertoire, but credited the institution for his education in music theory and improving his trumpet playing technique. Davis began playing professionally, performing in several 52nd Street clubs with Hawkins and Eddie \"Lockjaw\" Davis and, on 24 April 1945, recorded his first sessions in a recording studio as part of Herbie Fields's group with Henry \"Rubberlegs\" Williams, his first of many as a sideman. Davis' first recording as leader came in 1946 with an occasional group named the Miles Davis Sextet plus Earl Coleman and Ann Hathaway—one of the rare occasions when Davis is heard accompanying singers. Davis would not record another session as leader until 1947.\n\nAfter Gillespie split from Parker's quintet in 1945, Davis took his place in October and the group performed a residency at various clubs on 52nd Street. On November 26, Davis took part in several recording sessions as part of Parker's group Reboppers that also involved Gillespie and Roach, displaying hints of the style he would become known for. During a take of Parker's signature song \"Now's the Time\", Davis takes a melodic solo, whose unbop-like quality anticipates the cool jazz period that followed. In 1946, Davis played in a big and small band led by Benny Carter in St. Louis and travels with the group for performances in California. During his time on the west coast, Davis performed with Parker who had also travelled there with Gillespie. During a stop in Los Angeles, Parker suffered from a nervous breakdown that landed him in hospital for several months, leaving Davis stranded. Davis secured a spot on Eckstine's California tour which eventually brought him back to New York City in late 1946.On this occasion, Mingus bitterly criticized Davis for abandoning his \"musical father\" (see The Autobiography). In March 1946, Davis played in studio sessions with Parker and began a collaboration with bassist Charles Mingus that summer, during which Cawthon gave birth to Davis' second child, Gregory, in East St. Louis before reuniting with Davis in New York City the following year. Davis noted that by this time \"I was still so much into the music that I was even ignoring Irene\", and was drinking and doing cocaine.\n\nFollowing the break-up of Eckstine's band in early 1947, Davis secured work by playing in a big band led by Gillespie and Illinois Jacquet, and joining a new quintet led by Parker in April that also included Roach. Together they performed live with Duke Jordan and Tommy Potter for much of the year, including several studio sessions. In one session that May, Davis penned the tune \"Cheryl\", named after his daughter. Davis' first session as a leader followed in August 1947, playing as the Miles Davis All Stars that included Parker, pianist John Lewis, and bassist Nelson Boyd; together they recorded \"Milestones\", \"Half Nelson\", and \"Sippin' at Bells\". After touring Chicago and Detroit with Parker's quintet, Davis returned to New York City in March 1948 and joined the Jazz at the Philharmonic tour which included a stop in St. Louis on April 30.\n\n1948–1950: Miles Davis Nonet and birth of the cool\n\nIn August 1948, Davis declined an offer to join Duke Ellington's orchestra as he had entered rehearsals with a new, nine-piece band with pianist and arranger Gil Evans and baritone saxophonist Gerry Mulligan, taking an active role that soon became his own project.Mulligan, Gerry. [http://www.gerrymulligan.com/wp-content/files/auto-bio.pdf I hear America singing] : \"Miles, the bandleader. He took the initiative and put the theories to work. He called the rehearsals, hired the halls, called the players, and generally cracked the whip.\" Evans' Manhattan apartment had become the meeting place for several young musicians and composers such as Davis, Roach, Lewis, and Mulligan who were unhappy with the increasingly virtuoso instrumental techniques that dominated the bebop scene. This led to the formation of The Miles Davis Nonet which featured a more unusual line-up with a French horn and tuba. The objective was to achieve a sound similar to the human voice, through carefully arranged compositions and by emphasizing a relaxed, melodic approach to the improvisations. In September, the band completed their sole engagement as the openers for Count Basie at the Royal Roost for two weeks. Davis had to persuade the venue's manager to word the advertising sign as \"Miles Davis Nonet. Arrangements by Gil Evans, John Lewis and Gerry Mulligan\". He prevailed only with the help of Monte Kay, the club's artistic director. Davis rejoined Parker's quintet soon after, but relationships within the quintet were growing tense mainly due to Parker's erratic behavior caused by his drug addiction. Early into his tenure with Parker, Davis had adopted a lifestyle of drug abstinence, a vegetarian diet, and spoke of the benefits of water and juice. Matters worsened when Davis and Roach objected to the addition of pianist Duke Jordan and preferred to hire Bud Powell. The situation culminated in December 1948 when Davis quit, claiming he was not being paid.\n\nDavis' split from Parker marked the beginning of a period when he worked mainly as a freelancer and sideman in some of the most important combos in the New York City jazz scene. His nonet remained active until the end of 1949; after landing a recording deal with Capitol Records they recorded sessions in January and April 1949, including the singles \"Move\" and \"Boplicity\" which sold little but became influential pieces of music on the \"cool\" or \"west coast\" style of jazz. The line-up changed throughout the year and included the additions of tuba player Bill Barber, alto saxophonist Lee Konitz, who had been preferred to Sonny Stitt as his style was considered too bop-oriented, pianist Al Haig, trombone players Mike Zwerin with Kai Winding, French horn players Junior Collins with Sandy Siegelstein and Gunther Schuller, and bassists Al McKibbon and Joe Shulman. One track featured singer Kenny Hagood. The presence of white musicians in the group angered some black players, many of whom were unemployed at the time, yet Davis rebuffed their criticisms. Recording sessions with the nonet for Capitol Records continued until April 1950; much of it remained unreleased until the issue of Birth of the Cool (1957), its name given to the cool jazz movement that had developed and the musical direction the group had taken.\n\nIn May 1949, Davis performed with the Tadd Dameron Quintet with Kenny Clarke and James Moody at the Paris International Jazz Festival, his first trip abroad. Davis took a strong liking for Paris and its cultural environment, where black jazz musicians, and people of color in general, were better respected than in America. The trip, he described, \"changed the way I looked at things forever\". During his time there Davis began a love affair with singer and actress Juliette Gréco which lasted for several years.\n\n1949–1955: Hard bop and the \"Blue Period\"\n\nThe early 1950s was a period of great difficulty for Davis.  Upon his return from Paris in mid-1949, he became depressed and could only secure little amounts of work which included a short engagement with Powell in October, and guest spots in New York City, Chicago, and Detroit until January 1950.  To make matters worse, Davis was falling behind in hotel rent and numerous attempts were made to repossess his car.  His heroin use became an expensive addition, and Davis, yet to reach 24 years old, \"lost my sense of discipline, lost my sense of control over my life, and started to drift\".  In August 1950, during a family trip to East St. Louis and Chicago in an attempt to improve their fortunes, Cawthon gave birth to Davis' second son, Miles IV, in Chicago.  The latter was where Davis befriended boxer Johnny Bratton and began his strong interest in the sport.  Soon after, Davis left Cawthon and his three children in New York City in the hands of his friend and jazz singer Betty Carter who allowed his family to move in with her and looked after the children.  Davis remained thankful to Carter for the rest of his life.  Davis then toured with Eckstine and Billie Holiday in their backing bands, during which he was arrested for heroin possession in Los Angeles.  The story was reported in Down Beat magazine, which caused a further reduction of work for Davis, though he was acquitted weeks later.\n\nIn January 1951, Davis' fortunes improved when he secured a one-year recording contract with Prestige Records, an independent jazz label, after owner Bob Weinstock became a fan of Davis' nonet.  Davis chose Lewis, trombone player Bennie Green, bassist Percy Heath, saxophonist Sonny Rollins, and drummer Roy Hanes; together they recorded what became a portion of Miles Davis and Horns (1956).  Davis secured further studio dates for other artists in March, June, and September 1951, and had started taking up work transcribing scores for record labels to fund his heroin addiction.  The following month, Davis recorded his second session for Prestige as band leader, the material of which was later released on The New Sounds (1951), Dig (1956), and Conception (1956).\n\nDuring his heroin addiction, Davis supported his habit partly with his music and partly by living the life of a hustler, exploiting prostitutes and receiving money from friends.  By 1953, his addiction began to impair his playing ability and his drug habit became public in a Down Beat interview with Cab Calloway, whom Davis never forgave as it brought him \"all pain and suffering\".  After learning of his father's support, Davis returned to St. Louis and stayed with him for several months to aid his recovery.  Though he continued to score heroin out of boredom, Davis caught up with Roach and Mingus in September 1953 who were on their way to Los Angeles for performances.  Davis joined them, but the trip caused numerous arguments and problems.  Davis returned to his father's home, \"determined to kick my habit ... that was the only thing on my mind\".  He locked himself inside the guest house and stayed inside \"for about seven or eight days\" until he had gone through the painful and illness-inducing withdrawals.  After the ordeal, Davis \"sat down and started thinking about how I was going to get my life back together\".\n\nAfter kicking his heroin addiction Davis stayed in Detroit for around six months, avoiding New York City where it was easy to score drugs.  Though he did take heroin during his stay, he was healthy enough to resume live performances in local venues, playing with drummer Elvin Jones and pianist Tommy Flanagan as part of Billy Mitchell's house band at the Blue Bird club.  He was also \"pimping a little\" at this time. A widely related story, attributed to Richard \"Prophet\" Jennings, was that Davis stumbled into Baker's Keyboard Lounge out of the rain, carrying his trumpet in a paper bag under his coat, walked to the bandstand and interrupted Roach and Clifford Brown in the midst of performing \"Sweet Georgia Brown\" and played \"My Funny Valentine\" before leaving.  Davis was supposedly embarrassed into getting clean by this incident.  Davis later disputed this account, stating that Roach had invited him to play and that his decision to finally quit heroin was unrelated to the incident, citing his idol boxer Sugar Ray Robinson as an inspiration to get clean and resume his career.\n\nIn February 1954 a clean Davis returned to New York City, feeling good \"for the first time in a long time\" and mentally and physically stronger, and joined a gym.  He informed Weinstock and management at Blue Note Records that he was ready to record music with a quintet, which he was granted and set the task of recording more music than before to make up for lost time.  Davis considered two albums with sessions recorded from this time, Miles Davis Quartet (1954) for Prestige and Miles Davis Volume 2 (1956) for Blue Note, as \"very important\" to him as he felt his performances were particularly strong.  Davis was paid roughly $750 (US$ in  dollars) for each album and denied to give away all his publishing rights.  By now he had abandoned the bebop style and got to know the music of pianist Ahmad Jamal, whose approach and use of space greatly influenced Davis.  When Davis returned to the studio in June 1955 to record Miles Davis Quartet and sought a new pianist, he wished for someone who played like Jamal and picked Red Garland.\n\nBetween 1951 and 1954, Davis released many records on Prestige with varied line-ups, many with Rollins and Blakey.  Such albums include Blue Haze (1956), Bags' Groove (1957), Walkin' (1957), and Miles Davis and the Modern Jazz Giants (1959), recorded after Davis' recovery from heroin addiction.  They document the evolution of Davis' style and sound, including the fixture of the Harmon mute, also known as a wah-wah mute, onto his trumpet and placed close to the microphone which became his signature sound, and more spacious, melodic, and relaxed phrasing.  Davis assumed a central position in what is known as hard bop, a contrast to bebop as hard bop included slower tempos and a less radical approach to harmony and melody, often adopting popular tunes and American standards as starting points for improvisation.  Hard bop also distanced itself from cool jazz with its harder beat and blues-inspired music.Open references to the blues in jazz playing were fairly recent. Until the middle of the 1930s, as Coleman Hawkins declared to Alan Lomax (The Land Where the Blues Began. New York: Pantheon, 1993), African-American players working in white establishments would avoid references to the blues altogether. A few critics have named Walkin (1957) the album that created the hard bop genre.\n\nIn this period, Davis gained a reputation for being distant, cold, and withdrawn, and for having a quick temper.  Davis later wrote that in 1954, Leonard \"was the most important thing in my life besides music\" and even took on his \"arrogant attitude\".  Factors that contributed to this reputation included his contempt for the critics and specialized press, and some well-publicized confrontations with the public and with fellow musicians.  A near fight with Thelonious Monk during the recording of Bags' Groove received wide exposure in the specialized press.Davis had asked Monk to \"lay off\" (stop playing) while he was soloing.  In the autobiography, Davis says that Monk \"could not play behind a horn.\" Charles Mingus reported this, and more, in his \"Open Letter to Miles Davis\".  In mid-1954, Davis reunited with Gréco for the first time since 1949 after she arrived in New York City for film prospects; the two had been in occasional contact since Davis left Paris.  Though Davis was too busy to move to Spain with Gréco, the two \"remained lovers for many years\".\n\nDavis had an operation to remove polyps from his larynx in October 1955.  Even though he was not supposed to speak at all, he had an argument with somebody and raised his voice.  This outburst damaged his vocal cords forever, giving him the characteristic raspy voice that came to be associated with him. \"[It was] in February or March 1956 that I had my first throat operation and had to disband the group while recovering.  During the course of the conversation I raised my voice to make a point and fucked up my voice.  I wasn't even supposed to talk for at least ten days, and here I was not only talking, but talking loudly.  After that incident my voice had this whisper that has been with me ever since.\"  The \"nocturnal\" quality of Davis' playing and his somber reputation, along with his whispering voice,Acquired by shouting at a record producer while still ailing after a recent operation to the throat – The Autobiography. earned him the lasting moniker of \"prince of darkness\", adding a patina of mystery to his public persona.Davis began to be referred to as \"the Prince of Darkness\" in liner notes of the records of this period, and the moniker persists to this day; see, for instance, [http://findarticles.com/p/articles/mi_hb1367/is_199111/ai_n5603401/ his obituary]  in The Nation, and countless references in DVD [https://www.amazon.com/dp/B000ALZI3I], movies [https://www.pbs.org/jazz/biography/artist_id_davis_miles.htm] and print articles [http://www.allaboutjazz.com/php/article.php?id\n29834].\n\n1955–1959: Signing to Columbia, first great quintet, and modal jazz\n\nIn July 1955, Davis' fortunes improved considerably when he landed a last minute booking at the second annual Newport Jazz Festival on July 17, with a line-up of Monk, Heath, drummer Connie Kay, and horn players Zoot Sims and Gerry Mulligan. Davis convinced organizer George Wein that he should be on the bill, and Wein complied. The performance was hailed as a triumph by critics and widened Davis' music to the larger affluent white audience, and Davis soon tied first place with Gillespie in the 1955 Down Beat reader's poll in the trumpet category. Davis noted that after his set at Newport \"things began to happen\". Among them was the start of his longtime association with Columbia Records after producer George Avakian saw Davis perform at Newport and wished to sign him. With a year remaining on his Prestige agreement, which required Davis to release four more albums, Davis secured a contract with Columbia which included a $4,000 advance (US$ in  dollars) and a condition that his recordings for the label remained unreleased until his Prestige agreement had expired.\n\nAfter recording sessions for Mingus for his newly established Debut label, and a successful gig at Café Bohemia with Rollins, Garland, Chambers, and drummer Philly Joe Jones, Davis used this line-up to record his final sessions for Prestige. It took Davis two sessions, held on 11 May and 26 October 1956, to record enough material to fulfil his contract which was released in a series of four albums: Cookin' with the Miles Davis Quintet (1957), Relaxin' with the Miles Davis Quintet (1958), Workin' with the Miles Davis Quintet (1959), and Steamin' with the Miles Davis Quintet (1961), each being instrumental in establishing Davis' quintet as one of the best on the scene.\n\nIn mid-1955, Davis recruited players for what became known as his first \"great quintet\" of Garland, Chambers, Jones, and tenor saxophonist John Coltrane, who was chosen after the unsuccessful attempt to recruit Julian \"Cannonball\" Adderley. Neither of Davis' picks were widely known at the time, nor had they received a great deal of exposure. The five debuted on record with the widely received 'Round About Midnight (1957), Davis' first for Columbia. Their live repertoire included a mix of bebop mainstays, jazz standards from the Great American Songbook and pre-bop eras, and traditional tunes. The prevailing style of the group was a development of the Davis experience in the previous years—Davis playing long, legato, and essentially melodic lines, while Coltrane, who during these years emerged as a leading figure on the musical scene, contrasted by playing high-energy solos.\n\nIn November 1956, Davis split his quintet temporarily to tour Europe as part of the Birdland All-Stars, formed of himself, the Modern Jazz Quartet, and a line-up of French and German musicians. During his stay in Paris, he reunited with Greco for the first time since 1949. He then returned home, reunited his quartet, and toured the US for two months from December 1956. The tour was met with internal friction however, as Davis had gotten tired of Jones' and Coltrane's drug addictions, causing them to turn up late to gigs or at times not at all. Davis, on the other hand, was exercising regularly and consuming alcohol in moderation, despite the occasional time he would \"snort a little coke\". Davis fired Jones and Coltrane at the tour's end in March 1957, and were replaced by saxophonist Sonny Rollins and drummer Art Taylor.\n\nIn November 1957, Davis returned to Paris where he recorded the soundtrack to Louis Malle's film Ascenseur pour l'échafaud (1958). With the aid of French session musicians Barney Wilen, Pierre Michelot, and René Urtreger, and American drummer Kenny Clarke, the group recorded the score without relying on written material and improvised as they watched the film on a screen in the studio. Davis returned to New York City in December and revived his quintet with a returning Coltrane, now clean from his drug habit, and Adderley. Now a sextet, the group recorded material in early 1958 that was released on Milestones (1958), an album that first showcased Davis' interest in modal jazz. Davis had witnessed a performance of Les Ballets Africains from Guinea which sparked his interest in such music, then new concept that called for a slower, deliberate pace of music and allowed the creation of solos out of harmony rather than chords. Such music from the ballet featured the kalimba played for long periods of time on a single chord, weaving in and out of consonance and dissonance. By May 1958, Davis had replaced Jones with drummer Jimmy Cobb and faced Garland walking out of the group, leaving Davis to play piano on \"Sid's Ahead\" on Milestones. Davis wanted a new pianist who could get into modal jazz which he found in Bill Evans, a young white musician with a classical background. Evans had a unique, impressionistic approach to the piano, and his musical ideas had a strong influence on Davis. After eight months of touring, however, Evans was burned out and left in late 1958. He was replaced by Wynton Kelly who brought a swinging, bluesy approach that contrasted with Evans' more delicate playing. The six made their recording debut on a compilation album, Jazz Track (1958).\n\n1957–1963: Collaborations with Gil Evans and Kind of Blue\n\nBy early 1957, Davis was exhausted from recording and touring with his quintet and wished to pursue new projects. During a two-week residency in Chicago in March, the 30-year-old Davis told journalists of his intention to retire at its conclusion and revealed offers he had received to become a teacher at Harvard University and a musical director at a record label. Avakian agreed that it was time for Davis to explore something different, but Davis rejected his suggestion of returning to his nonet as he took it as a step backward. Avakian then suggested that Davis work with a bigger ensemble, similar to what he had played on Music for Brass (1957), an album of orchestral and brass-arranged music led by Gunther Schuller featuring Davis as a guest soloist. Davis accepted, and wished to work with arranger and composer Gil Evans in what became a five-album collaboration from 1957 to 1962. The first, Miles Ahead (1957), showcased Davis playing a flugelhorn and a rendition \"The Maids of Cadiz\" by Léo Delibes, the first piece of European classical music that Davis recorded. Evans devised orchestral passages as transitions between each track were joined together with studio editing, turning each side of the album into a seamless piece of music.Cook, op. cit. Porgy and Bess (1959) features arrangements of pieces from George Gershwin's opera which included Chambers, Jones, and Adderley. Sketches of Spain (1960) explored Spanish music with tracks by contemporary composers Joaquín Rodrigo and Manuel de Falla with originals from Evans. Recording was met with difficulties as the classical players were unable to improvise to what Evans wished for and the jazz musicians found the arrangements too difficult. \"Solea\" features a 10-minute trumpet solo by Davis. The album was a critical success and sold over 120,000 copies in the US. Davis performed with an orchestra conducted by Evans at Carnegie Hall in May 1961 to raise money for charity. The pair's final album was Quiet Nights (1962), a collection of bossa novas released against their wishes; Evans stated it was only half an album and blamed the record company; Davis blamed producer Teo Macero, and did not speak to him for more than two years. Davis noted later that \"my best friend is Gil Evans\"; their work was featured in the boxed set Miles Davis & Gil Evans: The Complete Columbia Studio Recordings (1996) which won a Grammy Award for Best Historical Album and Best Album Notes in 1997.\n\nIn March and April 1959, Davis recorded what many critics consider his greatest album, Kind of Blue (1959). Davis named the album to describe its overall mood. He called back Bill Evans, months away from forming what would become his own seminal trio, for the album sessions, as the music had been planned around Evans' piano style. Both Davis and Evans were acquainted with the ideas of pianist George Russell regarding modal jazz; Davis from discussions with Russell and others before the Birth of the Cool sessions, and Evans from studying with Russell in 1956. Davis, however, had neglected to inform current pianist Wynton Kelly of Evans' role in the recordings; Kelly subsequently played only on the track \"Freddie Freeloader\" and was not present at the April dates for the album. \"So What\" and \"All Blues\" had been played by the sextet at performances prior to the recording sessions, but for the other three compositions, Davis and Evans prepared skeletal harmonic frameworks that the other musicians saw for the first time on the day of recording, to allow a fresher approach to their improvisations. The resulting album has proven both highly popular and enormously influential. Released in August 1959, Kind of Blue was an instant success, with widespread radio airplay and rave reviews from critics. It remains the best selling jazz album of all time; in October 2008, the album reached 4× platinum from the Recording Industry Association of America for selling over four million copies in the US alone. In 2009, the US House of Representatives voted 409–0 to pass a resolution that honored it as a national treasure.\n\nDuring the success of Kind of Blue, Davis found himself involved with the law. On August 25, 1959, during a recording session at the Birdland nightclub in New York City for the US armed services, Davis took a break outside the club. As he was escorting a blonde woman across the sidewalk to a taxi, Davis was told by patrolman Gerald Kilduff to \"move on\". Davis explained that he was working at the club and refused to move, yet Kilduff proceeded to arrest Davis and grabbed him as Davis tried to protect himself. Witnesses said the patrolman punched Davis in the stomach with his nightstick without provocation. Two detectives held the crowd back, while a third approached Davis from behind and beat him in the head. Davis was arrested and taken to jail where he was charged for assaulting an officer before he was taken to hospital where he received five stitches. Davis was released on a $525 bail (US$ in  dollars). By January 1960, Davis was acquitted of disorderly conduct and third-degree assault. Davis later stated the incident \"changed my whole life and whole attitude again, made me feel bitter and cynical again when I was starting to feel good about the things that had changed in this country\".\n\nDavis supported Kind of Blue with an extended tour with his sextet. He persuaded Coltrane to play with the group on one final European tour in the spring of 1960. Coltrane then departed to form his classic quartet, although he returned for some of the tracks on Davis' album Someday My Prince Will Come (1961). Its front cover features a photograph of his wife at that time, Frances Taylor, after Davis demanded that Columbia depict black women on his album covers. By 1961, Ebony magazine estimated Davis was earning as much as $150,000 a year (US$ in  dollars). After Coltrane, Davis tried various saxophonists, including Jimmy Heath, Sonny Stitt, and Hank Mobley. The quintet with Hank Mobley was recorded in the studio and on several live engagements at Carnegie Hall and the Black Hawk jazz club in San Francisco. Stitt's playing with the group is found on a recording made in Olympia, Paris (where Davis and Coltrane had played a few months before) and the Live in Stockholm album.\n\nIn early 1958, Davis began a relationship with Frances Taylor, a dancer whom he had first met in Los Angeles five years prior, and they married on December 21, 1960. The relationship involved numerous incidents of Davis' domestic violence towards Taylor. Davis later wrote, \"Every time I hit her, I felt bad because a lot of it really wasn't her fault but had to do with me being temperamental and jealous\". One reason for his behavior was that by early 1963, Davis had increased his abuse of alcohol and cocaine in an attempt to reduce the pain from his hip and joint pain and discomfort caused from his recent diagnosis of sickle cell anemia. He also experienced hallucinations, \"looking for this imaginary person\" in his home to the point of searching the house wielding a kitchen knife. About a week after the photograph for Davis' album E.S.P. (1965) was taken, Taylor left Davis for the last time. They remained separated until they officially divorced in February 1968.\n\n1963–1968: Second \"great quintet\"\n\nIn December 1962, Davis and his line-up of Kelly, Chambers, Cobb, and Rollins played together for the last time after the first three wished to leave and play as a trio. Rollins left to join them soon after, leaving Davis to pay over $25,000 (US$ in  dollars) to cancel upcoming gigs and quickly assemble a new group. Following auditions, he found his new band in tenor saxophonist George Coleman, bassist Ron Carter, pianist Victor Feldman, and drummer Frank Butler, and the five proceeded to record in the studio. By May 1963, Feldman and Butler were replaced by pianist Herbie Hancock and the 17-year-old drummer Tony Williams who made Davis \"excited all over again\". With this group, Davis completed the rest of what became Seven Steps to Heaven (1963) and recorded the live albums Miles Davis in Europe (1964), My Funny Valentine (1965), and Four & More (1966). The quintet played essentially the same repertoire of bebop tunes and standards that earlier Davis bands had played, but tackled them with increasing structural and rhythmic freedom and, in the case of the up-tempo material, breakneck speed.\n\nIn mid-1964, Coleman was replaced by saxophonist Sam Rivers until Davis persuaded Wayne Shorter to end his tenure with Art Blakey and join him, thus becoming what is known as Davis' second \"great quintet\" which lasted through 1968. Shorter became the group's principal composer and Davis' album E.S.P. (1965) was named after his composition recorded for it. While touring Europe, the group made their first official recording, Miles in Berlin (1965). On returning to the US in late 1964 Davis, at Jackie DeShannon's urging, was instrumental in getting rock band The Byrds signed to Columbia.\n\nBy 1965, Davis required medical attention for the pain in his hip, which had worsened since his Japanese tour the previous year. He underwent hip replacement surgery in April 1965 with bone taken from his shin, but it failed. After his third month in the hospital, Davis discharged himself and went home due to boredom. He returned to the hospital in August, however, after a fall in his home caused damage that required a second operation, with a plastic hip joint inserted. In November 1965, Davis had recovered enough to return to live performance with his quintet, which included gigs at the Plugged Nickel in Chicago, marking the return of Macero as Davis' engineer and producer after their rift over Quiet Nights had healed. Unlike their studio albums, the quintet still played primarily jazz standards and bebop tunes, although some of the titles remain the same as the tunes played by Davis' first quintet, the quick tempos and musical departure from the framework of the tune are dramatic.\n\nIn January 1966, Davis returned to the hospital with a liver infection, which required a three-month break in activity. He recovered and resumed touring, playing more dates in colleges as he had got tired of performing in more typical jazz venues. Columbia president Clive Davis noted that in 1966 his sales had declined to around 40,000–50,000 per album, compared to as many as 100,000 per release a few years before. Matters were not helped by the press reporting Davis' apparent financial troubles and imminent demise. After his appearance at the 1966 Newport Jazz Festival, Davis returned to the studio with his quintet in October 1966, which marked the first of a series of productive sessions that lasted until September 1968. During this time, Davis had entered a relationship with actress Cicely Tyson, who became a positive influence on his life and mental well-being and helped him reduce his alcohol consumption.\n\nMaterial from the 1966–1968 sessions was released on Miles Smiles (1966), Sorcerer (1967), Nefertiti (1967), Miles in the Sky (1968), and Filles de Kilimanjaro (1968). The quintet's approach to the new music became known as \"time no changes\", which referred to Davis' choice to depart from chordal sequences and adopt a more open approach with the rhythm section responding to the soloists' melodies. Through Nefertiti the studio recordings consisted primarily of originals composed by Shorter, with occasional compositions by the other sidemen. In 1967, the group began to play their live concerts in continuous sets, each tune flowing into the next, with only the melody indicating any sort of demarcation. Davis' bands continued to perform this way until his hiatus in 1975.\n\nMiles in the Sky and Filles de Kilimanjaro—which tentatively introduced electric bass, electric piano, and electric guitar on some tracks—pointed the way to the subsequent fusion phase of Davis' career. Davis also began experimenting with more rock-oriented rhythms on these records. By the time the second half of Filles de Kilimanjaro was recorded, bassist Dave Holland and pianist Chick Corea had replaced Carter and Hancock in the working band, though both Carter and Hancock occasionally contributed to future recording sessions. Davis soon began to take over the compositional duties of his sidemen.\n\n1968–1975: The electric period\n\nIn September 1968, Davis married 23-year-old model and songwriter Betty Mabry. The marriage ended in divorce the following year, yet Mabry, a familiar face in the New York City scene and aware of the emerging counterculture audience, helped introduce Davis to popular rock, soul and funk artists and trending fashions of the day. Jazz critic Leonard Feather recalled visiting Davis' apartment during this time and was shocked to see the trumpeter listen to albums by The Byrds, Aretha Franklin, and Dionne Warwick. Davis also took a liking to James Brown, Jimi Hendrix, and Sly and the Family Stone. The musical transition required that Davis adapt to electric instruments in both live performances and in the studio and make music that would appeal to the younger audience.\n\nDavis' first step in his electric period began with In a Silent Way (1969), recorded in a single studio session on February 18, 1969 with Shorter, Hancock, Holland, and Williams alongside keyboardists Chick Corea and Josef Zawinul, and guitarist John McLaughlin. The album features two side long tracks that Macero pieced together from different takes recorded at the session resembling elements of a classical sonata form. Released in July 1969, the album received a divided critical reception among jazz purists who accused Davis of \"selling out\" to the rock audience. Nevertheless, it reached number 134 on the US Billboard Top LPs chart, Davis's first album since My Funny Valentine to reach the chart. It marked the start of Davis' entry into jazz fusion. Davis' touring band of 1969–1970 of Shorter, Corea, Holland, and DeJohnette never completed a studio recording together and subsequently became known as the \"lost quintet\". In October 1969, Davis was shot at five times while in his car with one of his two lovers at the time, Marguerite Eskridge. The incident left Davis with a graze and Eskridge unharmed.\n\nFor his next album Davis gathered an even larger group of musicians in August 1969, this time with new drummer Jack DeJohnette with Airto Moreira and Bennie Maupin, to record the double album Bitches Brew (1970). The album features extended compositions, some over 20 minutes in length, that, like In a Silent Way, were never played straight through in the studio but rather formed from several takes by Macero and Davis. Bitches Brew made greater use of studio recording techniques including splicing, multitrack recording, and tape loops; the 20-minute \"Pharaoh's Dance\" contains 19 edits. Upon its release in March 1970, Bitches Brew peaked at number 35 on the Billboard Top LPs chart and, in 1976, attained gold certification for 500,000 copies shipped in the US. By 2003, it had sold one million copies.\n\nIn March 1970, Davis began to perform as the opening act for various rock acts, allowing Columbia to market Bitches Brew to a wider audience. He was so offended by Clive Davis's suggestion to perform at the Fillmore East he threatened to switch record labels, yet he reconsidered and shared a bill with the Steve Miller Band and Neil Young on March 6 and 7. Biographer Paul Tingen wrote: \"Miles's newcomer status in this environment\" led to \"mixed audience reactions, often having to play for dramatically reduced fees, and enduring the 'sell-out' accusations from the jazz world\", as well as being \"attacked by sections of the black press for supposedly genuflecting to white culture\". The 1970 tours included a spot at the 1970 Isle of Wight Festival on August 29 which saw Davis perform to an estimated 600,000 people, the largest of his career. Plans to have Davis record with Hendrix ended following the guitarist's death soon after; his funeral was the last that Davis attended. Several live albums with a transitional sextet/septet including Corea, DeJohnette, Holland, Moreira, saxophonist Steve Grossman, and keyboardist Keith Jarrett were recorded for Live at the Fillmore East (1970) and Black Beauty (1973).\n\nBy 1971, Davis had signed a new contract with Columbia that paid him $100,000 a year (US$ in  dollars) for three years including royalties. He had recorded the soundtrack for the 1970 documentary film on heavyweight boxer Jack Johnson, containing two long pieces of 25 and 26 minutes in length that features Hancock, McLaughlin, Sonny Sharrock, and drummer Billy Cobham. The music, released on Jack Johnson (1971), gained critical acclaim. During this period, Davis was committed to making music for the young African-American audience drawn to the more commercial, groove-oriented style of popular music of the time; by November 1971, DeJohnette and Moreira had been replaced in the touring ensemble by drummer Leon \"Ndugu\" Chancler and percussionists James Mtume and Don Alias. The studio and live album Live-Evil (1971) was released in the same month and Davis' ensemble—though retaining the exploratory imperative of Bitches Brew—had transformed into a much more funk-oriented group.\n\nIn 1972, composer Paul Buckmaster introduced Davis to the music of German avant-garde composer Karlheinz Stockhausen which led to a period of new creative exploration. Biographer J. K. Chambers wrote, \"The effect of Davis' study of Stockhausen could not be repressed for long ... Davis' own 'space music' shows Stockhausen's influence compositionally.\" His recordings and performances during this period were described as \"space music\" by fans, Feather, and Buckmaster, who described it as \"a lot of mood changes—heavy, dark, intense—definitely space music.\" These influences were incorporated on the studio album On the Corner (1972), blending Stockhausen and Buckmaster with funk elements which had Davis invite Buckmaster to New York City to oversee the writing and recording.\n\nUpon its release, the album's commercial success was as limited as that of Davis's albums since Bitches Brew, topping the Billboard jazz chart but only peaking at number 156 in the more heterogeneous Billboard 200. Although On the Corner elicited favorable reviews from several influential critics of popular music (including Ralph J. Gleason of Rolling Stone and Robert Christgau of The Village Voice), Davis felt that Columbia had only marketed the album to jazz traditionalists who failed to understand it: \"Columbia ... didn't push it, so it didn't do as well as we all thought it would. The music was meant to be heard by young black people, but they just treated it like any other jazz album and advertised it that way, pushed it on the jazz radio stations. Young black kids don't listen to those stations; they listen to R&B stations and some rock stations.\" In October 1972, Davis broke his ankles in a car crash, for which he took painkillers and cocaine to cope and numb the pain. Looking back at his career after the incident, Davis wrote \"everything started to blur\".\n\nAfter recording On the Corner, Davis put together a new group in 1972 with Henderson, Mtume, Carlos Garnett, guitarist Reggie Lucas, organist Lonnie Liston Smith, tabla player Badal Roy, sitarist Khalil Balakrishna, and drummer Al Foster. It was unusual in that only Smith was a major jazz instrumentalist; as a result, the music emphasized rhythmic density and shifting textures instead of individual solos. This group was recorded live for In Concert (1973), but Davis found it unsatisfactory, leading him to drop the tabla and sitar and take over keyboard duties. He also added guitarist Pete Cosey. The compilation studio album Big Fun (1974) contains four long improvisations recorded between 1969 and 1972.\n\nDavis' studio activity in the 1970s culminated in sessions throughout 1973 and 1974 for Get Up with It (1974), a compilation that included four long pieces (comprising over ninety minutes of new music) alongside four shorter recordings from 1970 and 1972. Notably, the album contained \"He Loved Him Madly\", a thirty-minute tribute to the recently deceased Duke Ellington that presaged later developments in ambient music. In the United States, it performed comparably to On the Corner, reaching number 8 on the jazz chart and number 141 on the pop chart. He then concentrated on live performance with a series of concerts that Columbia released on the double live albums Agharta (1975), Pangaea (1976), and Dark Magus (1977). The first two are recordings of two sets from February 1, 1975 in Osaka, by which time Davis was troubled with pneumonia, osteoarthritis, sickle-cell anemia, depression, bursitis, and stomach ulcers; he relied on alcohol, codeine and morphine to get through the engagements. His shows divided audiences and were routinely panned by critics which cited the trumpeter's tendency to perform with his back to the audience. Although Cosey later asserted that \"the band really advanced after the Japanese tour\", Davis was once again hospitalized for his ulcers and a hernia during a subsequent tour of the US opening for Hancock. During this period, the keyboardist had eclipsed his former employer from a commercial standpoint with such fusion efforts as Head Hunters (1973) and Thrust (1974), both of which were marketed to pop audiences in the aftermath of the On the Corner farrago and respectively peaked at number 13 on the Billboard pop chart.\n\nFollowing appearances at the 1975 Newport Jazz Festival in July and the Schaefer Music Festival in New York City on September 5, Davis began a five-year period of inactivity from music.\n\n1975–1980: Hiatus\n\nIn his autobiography, Davis openly wrote about his mental state during his break in activity, describing his Upper West Side apartment as a wreck, his heavy drug and alcohol use, and his sexual encounters with many women. In December 1975, he had regained enough strength to undergo a much needed hip replacement operation. In March 1976, Rolling Stone reported rumors of his imminent demise citing his numerous health problems during his previous tour and lifestyle. In December 1976, Davis renewed his recording contract with Columbia for three years, but the label was initially reluctant to pay his usual large advances that they had done with his previous deals. This led to Davis' lawyer to enter negotiations with United Artists Records, causing Columbia to match the offer made by the rival label and complete the deal. They then established the Miles Davis Fund, paying the trumpeter on a regular basis thereafter. Pianist Vladimir Horowitz was the only other Columbia artist that had such a status with the label. Columbia released a series of compilation albums to fulfil contractual obligations, including Water Babies (1976) and Circle in the Round (1979).\n\nIn early 1978, Davis moved in with Elena Steinberg in Norwalk, Connecticut after her friend, music reporter Julie Coryell, was granted an interview with the trumpeter and wanted him cared to health. After working on some new music, including a tune co-written by him and guitarist Barry Finnerty, Davis got Coryell's husband, fusion guitarist Larry Coryell, to develop his work which was set for recording on March 2, 1978 with a line-up formed of Coryell, keyboardists Masabumi Kikuchi and George Pavlis, bassist T. M. Stevens, and drummer Al Foster. Davis proceeded to play the arranged piece in an uptempo fashion, abandoned his trumpet for the organ, and had Macero record the session without the band's knowledge. After Coryell declined a spot in a band that Davis was beginning to put together, Davis returned to his reclusive lifestyle in New York City. Not long after, Eskridge had Davis jailed for failing to pay maintenance to their son which cost Davis $10,000 (US$ in  dollars) for release on bail. A further recording session that involved Buckmaster and Gil Evans was shelved, with Evans leaving after not receiving promised compensation. In August 1978, Davis took a step towards a comeback when he hired Mark Rothbaum, who had worked for Davis since 1972, as his new manager. In 1979, Davis placed in the yearly top-ten trumpeter poll of Down Beat.\n\nBy 1979, Davis had rekindled his relationship with actress Cicely Tyson, with whom he overcame his cocaine addiction and regained his enthusiasm for music. The two married on November 26, 1981 in a ceremony held in Bill Cosby's home in Massachusetts and officiated by politician and civil rights activist Andrew Young; the marriage ended in divorce that was finalized in 1989.\n\nIn October 1979, Davis' contract with Columbia was up for negotiations. By this time, label president Clive Davis was replaced by George Butler, who had made several visits to Davis' home during the previous two years to encourage him back into the studio to record new material. To help his situation, Davis had Buckmaster come over to collaborate on new music. Upon his arrival at Davis' home, Buckmaster organised an intervention for the trumpeter who by this time was living in squalor among pest and cockroach infestations and darkness, with his curtains constantly closed. His sister Dorothy took charge to clean his home with help from Buckmaster, Tyson, and neighbor Chaka Khan; Davis later thanked Buckmaster in helping him.\n\n1980–1985: Re-emergence\n\nDavis had not played trumpet for the better part of three years, and found the process of reclaiming embouchure difficult. His first studio appearance since his hiatus took place on May 1, 1980. A day later, Davis was hospitalised for a month over a leg infection. Davis then recorded The Man with the Horn (1981) from June 1980 to May 1981, with Macero assuming his role as producer. The album sees Davis playing mostly wah-wah with a younger, larger band. The initial large band was eventually abandoned in favor of a smaller combo featuring saxophonist Bill Evans, not to be confused with pianist Bill Evans, and bass player Marcus Miller, both of whom would be among Davis' most regular collaborators throughout the decade.\n\nThe Man with the Horn received a poor critical reception despite selling fairly well. In early June 1981, Davis returned to the stage, for the first time since 1975, for a ten-minute guest solo spot as part of Mel Lewis' band and orchestra at the Village Vanguard, New York City. This was followed by appearances with a new band, including a four-night run at Kix in Boston from 26–29 June, followed by two shows at Avery Fisher Hall on 5 July as part of the Kool Jazz Festival. Recordings from a mixture of dates from 1981, including the Kix and Avery Fisher Hall gigs, were released on We Want Miles (1982), which earned Davis a Grammy Award for Best Jazz Instrumental Performance by a Soloist.\n\nIn January 1982, while Tyson was working in Africa, Davis \"went a little wild\" with alcohol and suffered from a stroke which temporarily paralysed his right hand. Tyson returned home and cared for him; after three months of treatment with a Chinese acupuncturist Davis was able to play his trumpet, after which he took his doctor's warnings on board and began a lifestyle free of alcohol and drugs. He credits Tyson in his recovery which involved regular exercise, piano playing, and visits to spas, yet he lost weight. Tyson also encouraged Davis to pursue drawing which the trumpeter took a particular liking to and worked on art for the rest of his life.\n\nDavis resumed touring in May 1982 with a line-up that included French percussionist Mino Cinelu and guitarist John Scofield, with whom he worked closely on his studio album Star People (1983). In mid-1983, while working on the tracks for Decoy, an album mixing soul music and electronica that was released in 1984, Davis brought in producer, composer and keyboardist Robert Irving III, who had earlier collaborated with him on The Man with the Horn. With a seven-piece band, including Scofield, Evans, keyboardist and music director Irving, drummer Al Foster and bassist Darryl Jones (later of the Rolling Stones), Davis played a series of European gigs to positive receptions. In December 1984, during his stay in Denmark, Davis was awarded the Léonie Sonning Music Prize. During the event, Danish trumpeter Palle Mikkelborg had written a contemporary classical piece titled \"Aura\" for the event which impressed Davis to the point of returning to Denmark in early 1985 to record his next studio album, Aura (1989). However, Columbia was dissatisfied with the recording and delayed its release for four years.\n\nIn May 1985, one month into a tour, Davis signed a new recording deal with Warner Bros. Records which included Davis signing over his entire publishing rights. Trumpeter Wynton Marsalis publicly dismissed Davis' more recent fusion recordings as not being \"'true' jazz\", comments Davis initially shrugged off, calling Marsalis \"a nice young man, only confused.\" This changed after Marsalis appeared, unannounced, onstage in the midst of Davis' performance at the inaugural Vancouver International Jazz Festival in 1986. Marsalis whispered into Davis' ear that \"someone\" had told him to do so. Davis responded by ordering him off the stage. Davis had become increasingly irritated at Columbia's delay releasing Aura. The breaking point in the label-artist relationship appears to have come when a Columbia jazz producer requested Davis place a goodwill birthday call to Marsalis. The 1985 tour included a performance in London in July that saw Davis on stage for five hours. Jazz critic John Fordham concluded: \"The leader is clearly enjoying himself\". By 1985, Davis was a diabetic and required daily insulin injections.\n\nDavis released his final album for Columbia, You're Under Arrest, in September 1985. It included another brief stylistic detour, this time with his interpretations of Cyndi Lauper's ballad \"Time After Time\", and Michael Jackson's pop hit \"Human Nature\". Davis considered releasing an entire album of pop songs and recorded dozens of them, but the idea was scrapped. Davis noted that many of today's accepted jazz standards were in fact pop songs from Broadway theater, and that he was simply updating the \"standards\" repertoire with new material. 1985 also saw Davis guest-star on the TV show Miami Vice as pimp and minor criminal Ivory Jones in the episode titled \"Junk Love\" (first aired November 8, 1985).\n\nDavis collaborated with a number of figures from the British post-punk and new wave movements during this period, including Scritti Politti. At the invitation of producer Bill Laswell, he recorded some trumpet parts during sessions for Public Image Ltd.'s Album, according to Public Image's John Lydon in the liner notes of their Plastic Box box set. In Lydon's words, however, \"strangely enough, we didn't use [his contributions].\" According to Lydon in the Plastic Box notes, Davis favorably compared Lydon's singing voice to his trumpet sound during these sessions.\n\n1986–1991: Final years\n\nAfter taking part in the recording of the 1985 protest song \"Sun City\" as a member of Artists United Against Apartheid, Davis was featured on the instrumental \"Don't Stop Me Now\" by Toto for their album Fahrenheit (1986). For his next studio album, Davis intended to record as a collaboration with pop artist Prince, but the project was soon shelved. Instead, Davis chose to work with multi-instrumentalist Marcus Miller. The resulting album, Tutu (1986), was Davis' first to use modern studio tools including programmed synthesizers, sampling and drum loops, to create an entirely new setting for his music. Released in September 1986, its front cover features a striking portrait of Davis by Irving Penn. The album was described as the modern counterpart of Sketches of Spain and, in 1987, won Davis his second of three Grammy Awards for Best Jazz Instrumental Performance, Soloist.\n\nIn 1988, Davis had a small part as a street musician in the Christmas comedy film Scrooged, starring Bill Murray. He also collaborated with Zucchero Fornaciari recording a new version of Dune Mosse (Blue's), published in 2004 in Zu & Co. of the Italian bluesman. In November 1988, he was inducted into the Knights of Malta at a ceremony at the Alhambra Palace in Spain. Later that month, Davis cut his European tour short after he collapsed and fainted after a two-hour show in Madrid and flew home. Rumors of Davis' health were made public after the American tabloid magazine Star, in its February 21, 1989 edition, published that Davis had contracted AIDS, prompting Davis' manager Peter Shukat to issue a statement the following day to deny the claim. Shukat revealed Davis had been in hospital for a mild case of pneumonia and the removal of a benign polyp on his vocal cords, yet was resting comfortably in preparation for his 1989 tours. Davis later blamed one of his former wives or girlfriends for starting the rumor and decided against taking legal action. In 1989, Davis was interviewed on 60 Minutes by Harry Reasoner. In October 1989, Davis received a Grande Medaille de Vermeil from Paris mayor Jacques Chirac. In 1990, Davis received a Grammy Lifetime Achievement Award. In early 1991, he appeared in the Rolf de Heer film Dingo as a jazz musician. In the film's opening sequence, Davis and his band unexpectedly land on a remote airstrip in the Australian outback and proceed to perform for the surprised locals.\n\nDavis followed Tutu with Amandla (1989), another collaboration with Miller and George Duke plus the soundtracks to four films—Street Smart, Siesta, The Hot Spot (with bluesman John Lee Hooker), and Dingo. He continued to tour in the late 1980s with a band of constantly rotating personnel. Davis' last albums, both released posthumously, were the hip hop-influenced studio album Doo-Bop (1992) and Miles & Quincy Live at Montreux (1993), a collaboration with Quincy Jones for the 1991 Montreux Jazz Festival where, for the first time in three decades, Davis performed songs from Miles Ahead, Porgy and Bess and Sketches of Spain. Some listeners and critics who had been disappointed with his experimental late period were happy that his career ended in such a way.\n\nOn July 8, 1991, Davis returned to performing material from his past at the 1991 Montreux Jazz Festival with a band and orchestra conducted by Quincy Jones. The set consisted of select arrangements from his albums recorded with Gil Evans. The show was followed by a concert billed as Miles and Friends at the Grande halle de la Villette in Paris held two days later, featuring guest performances by artists he had worked with across his career, including John McLaughlin, Herbie Hancock and Josef Zawinul. During his stay in Paris, Davis was awarded the Chevalier of the Legion of Honour. Such retrospective concerts that Davis agreed to do in a short space of time led to the argument that the trumpeter knew he was dying, yet his road manager Gordon Meltzer believed Davis was unaware. A week after Paris, Davis and his group performed at the Nice Jazz Festival, followed by a show in London on July 19. Upon his return to the US, he stopped off in New York City to record material on his next album, Doo-Bop, and returned to California where he played at the Hollywood Bowl on August 25, his final live performance.\n\nDeath\n\nIn early September 1991, Davis checked into St. John's Hospital near his home in Santa Monica, California, for routine tests. During his stay, his doctors suggested he have a tracheal tube implanted to relieve his breathing following his repeated bouts of bronchial pneumonia. This provoked an outburst from Davis that led to an intracerebral hemorrhage, followed by a coma. After several days on life support, Davis' machine was turned off and he died on September 28, 1991. Davis was 65 years old. His death was officially reasoned as the combined effects of a stroke, pneumonia and respiratory failure. According to Troupe, Davis was taking azidothymidine (AZT), a type of antiretroviral drug used for the treatment of HIV and AIDS, during his treatments in hospital. A funeral service was held on October 5, 1991 at St. Peter's Church in New York City that was attended by around 500 friends, family members, and musical acquaintances, with many fans standing outside in the rain. Davis was buried in Woodlawn Cemetery in The Bronx, New York City, with one of his trumpets, close to the site of fellow jazz musician and his early idol, Duke Ellington.\n\nViews on his earlier work\n\nLate in his life, from the \"electric period\" onwards, Davis repeatedly explained his reasons for not wishing to perform his earlier works, such as Birth of the Cool or Kind of Blue. In his view, remaining stylistically static was the wrong option. He commented: \"\"So What\" or Kind of Blue, they were done in that era, the right hour, the right day, and it happened. It's over [...] What I used to play with Bill Evans, all those different modes, and substitute chords, we had the energy then and we liked it. But I have no feel for it anymore, it's more like warmed-over turkey.\"Interview with Ben Sindran, 1986. Quoted in Miles Davis and Bill Evans: Miles and Bill in Black & White, September 2001, Ashley Kahn, JazzTimes When Shirley Horn insisted in 1990 that Miles reconsider playing the ballads and modal tunes of his Kind of Blue period, he demurred. \"Nah, it hurts my lip,\" was the reason he gave.Interview to Shirley Horn. After 1990. Quoted in Miles Davis and Bill Evans: Miles and Bill in Black & White, September. 2001, Ashley Kahn, JazzTimes.\n\nOther musicians regretted Davis’ change of style, for example, Bill Evans, who was instrumental in creating Kind of Blue, said: \"I would like to hear more of the consummate melodic master, but I feel that big business and his record company have had a corrupting influence on his material. The rock and pop thing certainly draws a wider audience. It happens more and more these days that unqualified people with executive positions try to tell musicians what is good and what is bad music.\"Interview to Bill Evans. Late 1970s. Quoted in Miles Davis and Bill Evans: Miles and Bill in Black & White, September. 2001, Ashley Kahn, JazzTimes.\n\nLegacy and influence\n\nDavis is regarded as one of the most innovative, influential and respected figures in the history of music. The Guardian described him as \"a pioneer of 20th-century music, leading many of the key developments in the world of jazz.\" He has been described as “one of the great innovators in jazz\", and had the titles the Prince of Darkness and the Picasso of Jazz bestowed upon him. The Rolling Stone Encyclopedia of Rock & Roll noted: \"Miles Davis played a crucial and inevitably controversial role in every major development in jazz since the mid-'40s, and no other jazz musician has had so profound an effect on rock. Miles Davis was the most widely recognized jazz musician of his era, an outspoken social critic and an arbiter of style—in attitude and fashion—as well as music\".\n\nWilliam Ruhlmann of AllMusic wrote that \"To examine his career is to examine the history of jazz from the mid-1940s to the early 1990s, since he was in the thick of almost every important innovation and stylistic development in the music during that period [...] It can even be argued that jazz stopped evolving when Davis wasn't there to push it forward.\" As an innovative bandleader and composer, Miles Davis has influenced many notable musicians and bands from diverse genres. Miles' influence on the people who played with him has been described by music writer Christopher Smith as follows:\n\nMiles Davis's artistic interest was in the creation and manipulation of ritual space, in which gestures could be endowed with symbolic power sufficient to form a functional communicative, and hence musical, vocabulary. [...] Miles' performance tradition emphasized orality and the transmission of information and artistic insight from individual to individual. His position in that tradition, and his personality, talents, and artistic interests, impelled him to pursue a uniquely individual solution to the problems and the experiential possibilities of improvised performance.\n\nHis approach, owing largely to the African-American performance tradition that focused on individual expression, emphatic interaction, and creative response to shifting contents, had a profound impact on generations of jazz musicians.Smith, Christopher, \"A Sense of the Possible. Miles Davis and the Semiotics of Improvised Performance\", TDR, Vol. 39, No. 3 (Autumn 1995), pp. 41–55.\n\nKind of Blue remains the best selling jazz album of all time. On November 5, 2009, U.S. Representative John Conyers of Michigan sponsored a measure in the United States House of Representatives to recognize and commemorate the album on its 50th anniversary. The measure also affirms jazz as a national treasure and \"encourages the United States government to preserve and advance the art form of jazz music.\" It passed, unanimously, with a vote of 409–0 on December 15, 2009. The trumpet Davis used on the recording is displayed on the campus of the University of North Carolina at Greensboro. It was donated to the school by Arthur \"Buddy\" Gist, who met Davis in 1949 and became a close friend. The gift was the reason why the jazz program at UNCG is named the Miles Davis Jazz Studies Program.\n\nIn 1986, the New England Conservatory awarded Davis an Honorary Doctorate for his extraordinary contributions to music. Since 1960 the National Academy of Recording Arts and Sciences (NARAS) honored him with eight Grammy Awards, a Grammy Lifetime Achievement Award, and three Grammy Hall of Fame Awards.\n\nIn 2001 a two-hour documentary film by Mike Dibb entitled The Miles Davis Story (Dibb Directions/Channel 4 Television) won an International Emmy Award for arts documentary of the year.Deans, Jason, [https://www.theguardian.com/media/2001/nov/20/broadcasting \"Norton in Emmy triumph\"], The Guardian, November 20, 2001.\n\nIn 2010, Moldejazz premiered a play called Driving Miles, which focused on a landmark concert Davis performed in Molde, Norway, in 1984.\n\nMiles Ahead, is a 2015 American music film directed by Don Cheadle, co-written by Cheadle with Steven Baigelman, Stephen J. Rivele, and Christopher Wilkinson, which interprets the life and compositions of Davis. It premiered at the New York Film Festival in October 2015. Starring Cheadle, the film also features Emayatzy Corinealdi as Frances Taylor, and a cast including Ewan McGregor, Michael Stuhlbarg, and Lakeith Stanfield.\n\nAwards\n\n* Winner; Down Beat Reader's Poll Best Trumpet Player 1955\n* Winner; Down Beat Reader's Poll Best Trumpet Player 1957\n* Winner; Down Beat Reader's Poll Best Trumpet Player 1961\n* Grammy Award for Best Jazz Composition Of More Than Five Minutes Duration for Sketches of Spain (1960)\n* Grammy Award for Best Jazz Performance, Large Group Or Soloist With Large Group for Bitches Brew (1970)\n* Grammy Award for Best Jazz Instrumental Performance, Soloist for We Want Miles (1982)\n* Sonning Award for Lifetime Achievement In Music (1984; Copenhagen, Denmark)\n* Doctor of Music, honoris causa (1986; New England Conservatory)\n* Grammy Award for Best Jazz Instrumental Performance, Soloist for Tutu (1986)\n* Knight Hospitaller by the Order of St. John (1988)\n* Governor's Award from the New York State Council on the Arts (1989)\n* Grammy Award for Best Jazz Instrumental Performance, Soloist for Aura (1989)\n* Grammy Award for Best Jazz Instrumental Performance, Big Band for Aura (1989)\n* Grammy Lifetime Achievement Award (1990)\n* St. Louis Walk of Fame (May 20, 1990)\n* Australian Film Institute Award for Best Original Music Score for Dingo, shared with Michel Legrand (1991)\n* Knight of the Legion of Honor (July 16, 1991; Paris)\n* Grammy Award for Best R&B Instrumental Performance for Doo-Bop (1992)\n* Grammy Award for Best Large Jazz Ensemble Performance for Miles & Quincy Live at Montreux (1993)\n* Hollywood Walk of Fame Star (February 19, 1998)\n* Rock and Roll Hall of Fame Induction (March 13, 2006)\n* Hollywood's Rockwalk Induction (September 28, 2006)\n* RIAA Quadruple Platinum for Kind of Blue (October 7, 2008)\n\nDiscography\n\nFilmography\n\n Only one song is composed by Miles Davis in cooperation with Marcus Miller (\"Theme For Augustine\").\n Soundtrack is composed by Miles Davis in cooperation with Michel Legrand.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Miles Davis" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=20405" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Miles Dewey Davis III (May 26, 1926September 28, 1991) was an American jazz trumpeter, bandleader, and composer. He is among the most influential and acclaimed figures in the history of jazz and 20th century music. Davis adopted a variety of musical directions in his five-decade career which kept him at the forefront of a number of major stylistic developments in jazz.\n\nBorn and raised in Illinois, Davis left his studies at The Juilliard School in New York City and made his professional debut as a member of saxophonist Charlie Parker's bebop quintet from 1944 to 1948. Shortly after, he recorded the Birth of the Cool sessions for Capitol Records, which were instrumental to the development of cool jazz. In the early 1950s, Davis recorded some of the earliest hard bop music while on Prestige Records but did so haphazardly due to a heroin addiction. After a widely acclaimed comeback performance at the Newport Jazz Festival in 1955, he signed a long-term contract with Columbia Records and recorded the 1957 album 'Round About Midnight. It was his first work with saxophonist John Coltrane and bassist Paul Chambers, key members of the sextet he led into the early 1960s. During this period, he alternated between orchestral jazz collaborations with arranger Gil Evans, such as the Spanish music-influenced Sketches of Spain (1960), and band recordings, such as Milestones (1958) and Kind of Blue (1959). The latter recording remains one of the most popular jazz albums of all time, having sold over four million copies in the U.S.\n\nDavis made several line-up changes while recording Someday My Prince Will Come (1961), his 1961 Blackhawk concerts, and Seven Steps to Heaven (1963), another mainstream success that introduced bassist Ron Carter, pianist Herbie Hancock, and drummer Tony Williams. After adding saxophonist Wayne Shorter to his new quintet in 1964, Davis led them on a series of more abstract recordings often composed by the band members, helping pioneer the post-bop genre with albums such as E.S.P (1965) and Miles Smiles (1967), before transitioning into his electric period. During the 1970s, he radically experimented with rock, funk, African rhythms, emerging electronic music technology, and an ever-changing line-up of musicians, including keyboardist Joe Zawinul, drummer Al Foster, and guitarist John McLaughlin. This period, beginning with Davis' 1969 studio album In a Silent Way and concluding with the 1975 concert recording Agharta, was the most controversial in his career, alienating and challenging many in jazz.;  His million-selling 1970 record Bitches Brew helped spark a resurgence in the genre's commercial popularity with jazz fusion as the decade progressed.\n\nAfter a five-year retirement due to poor health, Davis resumed his career in the 1980s, employing younger musicians and pop music sounds on albums such as The Man with the Horn (1981) and Tutu (1986). Critics were generally unreceptive but the decade garnered the trumpeter his highest level of commercial recognition. He performed sold-out concerts worldwide while branching out into visual arts, film, and television work, before his death in 1991 from the combined effects of a stroke, pneumonia and respiratory failure. In 2006, Davis was inducted into the Rock and Roll Hall of Fame, which recognized him as \"one of the key figures in the history of jazz\". Rolling Stone described him as \"the most revered jazz trumpeter of all time, not to mention one of the most important musicians of the 20th century,\" while Gerald Early called him inarguably one of the most influential and innovative musicians of that period.\n\nEarly life\n\nMiles Dewey Davis III was born on May 26, 1926 to an affluent African-American family in Alton, Illinois, fifteen miles north of St. Louis. He had an older sister, Dorothy Mae (b. 1925), and a younger brother, Vernon (b. 1929). His mother, Cleota Mae (née Henry) of Arkansas, was a music teacher and violinist, and his father, Miles Dewey Davis, Jr., also of Arkansas, was a dentist.  They owned a 200-acre estate near Pine Bluff, Arkansas that housed a profitable pig farm where Davis and his siblings would ride horses, fish, and hunt. In 1927, the family moved to East St. Louis, Illinois, living on the second floor of a commercial building in a predominantly white neighborhood behind a dental office.  From 1932 to 1934, Davis attended John Robinson Elementary School, an all-black institution, followed by Crispus Attucks School, where he performed well in mathematics, music, and sports. As a youngster Davis developed his earliest appreciation for music, citing the blues, big bands, and gospel music.\n\nIn 1935, Davis received his first trumpet as a gift from John Eubanks, a friend of his father, and later took weekly lessons with his father's patient, teacher and musician Elwood Buchanan. His mother objected to the choice of instrument as she preferred her son take up the violin. Against the fashion of the time, Buchanan stressed the importance of playing without vibrato and encouraged him to adopt a more clear, mid-range tone; Davis claimed he would slap his knuckles every time he started using heavy vibrato. Davis would carry his clear signature tone throughout his career. He once remarked on its importance to him, saying, \"I prefer a round sound with no attitude in it, like a round voice with not too much tremolo and not too much bass. Just right in the middle. If I can't get that sound I can't play anything.\"Kahn In 1939, the family moved to 1701 Kansas Avenue in East St. Louis. For his thirteenth birthday that year Davis' father bought his son a new trumpet, and Davis began to play in local bands, earning as much as $85 a week (US$ in  dollars). Around this time Davis took additional trumpet lessons from Joseph Gustat, principal trumpeter of the St. Louis Symphony Orchestra.\n\nIn 1941, the 15-year-old Davis began at East St. Louis Lincoln High School, where he joined the school's marching band directed by Buchanan and entered music competitions. Davis claimed the contests he did not win were largely due to prejudice over his race, but said that such experiences made him a better musician. Davis proceeded to improve his understanding of music after a drummer he played with around this time suggested Davis play a passage from the previous night, yet Davis was unable to comprehend what he meant. \"That hit me ... I went and got everything, every book I could get to learn about theory\". It was at Lincoln High where Davis met his first girlfriend, Irene Birth (later Cawthon). Davis had formed his own group by this time, performing in various local venues such as Elks Club and Huff's Beer Garden with hits such as \"In the Mood\" by Glenn Miller. A portion of his earnings went towards his sister's education at Fisk University. Davis also befriended trumpeter Clark Terry, who also suggested he play without vibrato and performed together in various capacities for several years.\n\nIn 1943, at Buchanan's recommendation and Cawthon's persuasion, Davis filled a vacant spot in Eddie Randle's Rhumboogie Orchestra, also known as the Blue Devils, and eventually became its musical director which involved the scheduling of rehearsals and hiring newcomers. Davis later acknowledged his tenure as one of the most important of his career. During this time, Sonny Stitt tried to persuade him to join the Tiny Bradshaw band, then passing through town, but Davis' mother insisted that he finish his final year of high school before he could tour. He said, \"I didn't talk to her for two weeks. And I didn't go with the band either\". In January 1944, Davis finished his studies at East St. Louis Lincoln High School and graduated in absentia in June. The following month, Cawthon gave birth to a daughter, Cheryl.\n\nIn July 1944, Billy Eckstine and his big band, which featured Dizzy Gillespie, Charlie Parker, and Art Blakey, visited St. Louis for a series of performances. They needed a stand-in after third trumpeter Buddy Anderson was too ill to attend. They invited Davis, who accepted and played with the group for two weeks at Club Riviera. The experience was a profound one for Davis, after which he \"had to be in New York, where the action was\". His mother wanted him to continue with his education and study the piano or violin at Fisk University with his sister, but Davis declined.\n\nCareer \n\n1944–1948: New York City and the bebop years\n\nIn September 1944, Davis accepted his father's idea of studying at the Institute of Musical Arts, later known as the Juilliard School, in New York City. Davis passed his audition and attended classes in music theory, piano and dictation, but soon lost focus and spent much of his time in the club scene and locating Parker, despite being advised against doing so by several people he met in his search, including Coleman Hawkins.The Autobiography.  After finally locating his idol, Davis became one of the cadre of musicians who held nightly jam sessions at two Harlem nightclubs, Minton's Playhouse and Monroe's. The group included many of the future leaders of the bebop revolution such as Fats Navarro, Freddie Webster, and J. J. Johnson. Established musicians including Thelonious Monk and Kenny Clarke were also regular participants. In December 1944, Davis reunited with Cawthon and their daughter when they relocated to New York City, the three living in the same building as Parker who eventually became a roommate.\n\nIn mid-1945, Davis failed to register for the year's autumn term of study at Juilliard and dropped out after three semesters as he wished to commit to jazz performance full-time. His father advised his son to avoid sounding like everyone else and find his own style yet remained supportive and continued to send over money until Davis could earn enough on his own. Davis later criticized the school's classes for centering too much on the classical European and \"white\" repertoire, but credited the institution for his education in music theory and improving his trumpet playing technique. Davis began playing professionally, performing in several 52nd Street clubs with Hawkins and Eddie \"Lockjaw\" Davis and, on 24 April 1945, recorded his first sessions in a recording studio as part of Herbie Fields's group with Henry \"Rubberlegs\" Williams, his first of many as a sideman. Davis' first recording as leader came in 1946 with an occasional group named the Miles Davis Sextet plus Earl Coleman and Ann Hathaway—one of the rare occasions when Davis is heard accompanying singers. Davis would not record another session as leader until 1947.\n\nAfter Gillespie split from Parker's quintet in 1945, Davis took his place in October and the group performed a residency at various clubs on 52nd Street. On November 26, Davis took part in several recording sessions as part of Parker's group Reboppers that also involved Gillespie and Roach, displaying hints of the style he would become known for. During a take of Parker's signature song \"Now's the Time\", Davis takes a melodic solo, whose unbop-like quality anticipates the cool jazz period that followed. In 1946, Davis played in a big and small band led by Benny Carter in St. Louis and travels with the group for performances in California. During his time on the west coast, Davis performed with Parker who had also travelled there with Gillespie. During a stop in Los Angeles, Parker suffered from a nervous breakdown that landed him in hospital for several months, leaving Davis stranded. Davis secured a spot on Eckstine's California tour which eventually brought him back to New York City in late 1946.On this occasion, Mingus bitterly criticized Davis for abandoning his \"musical father\" (see The Autobiography). In March 1946, Davis played in studio sessions with Parker and began a collaboration with bassist Charles Mingus that summer, during which Cawthon gave birth to Davis' second child, Gregory, in East St. Louis before reuniting with Davis in New York City the following year. Davis noted that by this time \"I was still so much into the music that I was even ignoring Irene\", and was drinking and doing cocaine.\n\nFollowing the break-up of Eckstine's band in early 1947, Davis secured work by playing in a big band led by Gillespie and Illinois Jacquet, and joining a new quintet led by Parker in April that also included Roach. Together they performed live with Duke Jordan and Tommy Potter for much of the year, including several studio sessions. In one session that May, Davis penned the tune \"Cheryl\", named after his daughter. Davis' first session as a leader followed in August 1947, playing as the Miles Davis All Stars that included Parker, pianist John Lewis, and bassist Nelson Boyd; together they recorded \"Milestones\", \"Half Nelson\", and \"Sippin' at Bells\". After touring Chicago and Detroit with Parker's quintet, Davis returned to New York City in March 1948 and joined the Jazz at the Philharmonic tour which included a stop in St. Louis on April 30.\n\n1948–1950: Miles Davis Nonet and birth of the cool\n\nIn August 1948, Davis declined an offer to join Duke Ellington's orchestra as he had entered rehearsals with a new, nine-piece band with pianist and arranger Gil Evans and baritone saxophonist Gerry Mulligan, taking an active role that soon became his own project.Mulligan, Gerry. [http://www.gerrymulligan.com/wp-content/files/auto-bio.pdf I hear America singing] : \"Miles, the bandleader. He took the initiative and put the theories to work. He called the rehearsals, hired the halls, called the players, and generally cracked the whip.\" Evans' Manhattan apartment had become the meeting place for several young musicians and composers such as Davis, Roach, Lewis, and Mulligan who were unhappy with the increasingly virtuoso instrumental techniques that dominated the bebop scene. This led to the formation of The Miles Davis Nonet which featured a more unusual line-up with a French horn and tuba. The objective was to achieve a sound similar to the human voice, through carefully arranged compositions and by emphasizing a relaxed, melodic approach to the improvisations. In September, the band completed their sole engagement as the openers for Count Basie at the Royal Roost for two weeks. Davis had to persuade the venue's manager to word the advertising sign as \"Miles Davis Nonet. Arrangements by Gil Evans, John Lewis and Gerry Mulligan\". He prevailed only with the help of Monte Kay, the club's artistic director. Davis rejoined Parker's quintet soon after, but relationships within the quintet were growing tense mainly due to Parker's erratic behavior caused by his drug addiction. Early into his tenure with Parker, Davis had adopted a lifestyle of drug abstinence, a vegetarian diet, and spoke of the benefits of water and juice. Matters worsened when Davis and Roach objected to the addition of pianist Duke Jordan and preferred to hire Bud Powell. The situation culminated in December 1948 when Davis quit, claiming he was not being paid.\n\nDavis' split from Parker marked the beginning of a period when he worked mainly as a freelancer and sideman in some of the most important combos in the New York City jazz scene. His nonet remained active until the end of 1949; after landing a recording deal with Capitol Records they recorded sessions in January and April 1949, including the singles \"Move\" and \"Boplicity\" which sold little but became influential pieces of music on the \"cool\" or \"west coast\" style of jazz. The line-up changed throughout the year and included the additions of tuba player Bill Barber, alto saxophonist Lee Konitz, who had been preferred to Sonny Stitt as his style was considered too bop-oriented, pianist Al Haig, trombone players Mike Zwerin with Kai Winding, French horn players Junior Collins with Sandy Siegelstein and Gunther Schuller, and bassists Al McKibbon and Joe Shulman. One track featured singer Kenny Hagood. The presence of white musicians in the group angered some black players, many of whom were unemployed at the time, yet Davis rebuffed their criticisms. Recording sessions with the nonet for Capitol Records continued until April 1950; much of it remained unreleased until the issue of Birth of the Cool (1957), its name given to the cool jazz movement that had developed and the musical direction the group had taken.\n\nIn May 1949, Davis performed with the Tadd Dameron Quintet with Kenny Clarke and James Moody at the Paris International Jazz Festival, his first trip abroad. Davis took a strong liking for Paris and its cultural environment, where black jazz musicians, and people of color in general, were better respected than in America. The trip, he described, \"changed the way I looked at things forever\". During his time there Davis began a love affair with singer and actress Juliette Gréco which lasted for several years.\n\n1949–1955: Hard bop and the \"Blue Period\"\n\nThe early 1950s was a period of great difficulty for Davis.  Upon his return from Paris in mid-1949, he became depressed and could only secure little amounts of work which included a short engagement with Powell in October, and guest spots in New York City, Chicago, and Detroit until January 1950.  To make matters worse, Davis was falling behind in hotel rent and numerous attempts were made to repossess his car.  His heroin use became an expensive addition, and Davis, yet to reach 24 years old, \"lost my sense of discipline, lost my sense of control over my life, and started to drift\".  In August 1950, during a family trip to East St. Louis and Chicago in an attempt to improve their fortunes, Cawthon gave birth to Davis' second son, Miles IV, in Chicago.  The latter was where Davis befriended boxer Johnny Bratton and began his strong interest in the sport.  Soon after, Davis left Cawthon and his three children in New York City in the hands of his friend and jazz singer Betty Carter who allowed his family to move in with her and looked after the children.  Davis remained thankful to Carter for the rest of his life.  Davis then toured with Eckstine and Billie Holiday in their backing bands, during which he was arrested for heroin possession in Los Angeles.  The story was reported in Down Beat magazine, which caused a further reduction of work for Davis, though he was acquitted weeks later.\n\nIn January 1951, Davis' fortunes improved when he secured a one-year recording contract with Prestige Records, an independent jazz label, after owner Bob Weinstock became a fan of Davis' nonet.  Davis chose Lewis, trombone player Bennie Green, bassist Percy Heath, saxophonist Sonny Rollins, and drummer Roy Hanes; together they recorded what became a portion of Miles Davis and Horns (1956).  Davis secured further studio dates for other artists in March, June, and September 1951, and had started taking up work transcribing scores for record labels to fund his heroin addiction.  The following month, Davis recorded his second session for Prestige as band leader, the material of which was later released on The New Sounds (1951), Dig (1956), and Conception (1956).\n\nDuring his heroin addiction, Davis supported his habit partly with his music and partly by living the life of a hustler, exploiting prostitutes and receiving money from friends.  By 1953, his addiction began to impair his playing ability and his drug habit became public in a Down Beat interview with Cab Calloway, whom Davis never forgave as it brought him \"all pain and suffering\".  After learning of his father's support, Davis returned to St. Louis and stayed with him for several months to aid his recovery.  Though he continued to score heroin out of boredom, Davis caught up with Roach and Mingus in September 1953 who were on their way to Los Angeles for performances.  Davis joined them, but the trip caused numerous arguments and problems.  Davis returned to his father's home, \"determined to kick my habit ... that was the only thing on my mind\".  He locked himself inside the guest house and stayed inside \"for about seven or eight days\" until he had gone through the painful and illness-inducing withdrawals.  After the ordeal, Davis \"sat down and started thinking about how I was going to get my life back together\".\n\nAfter kicking his heroin addiction Davis stayed in Detroit for around six months, avoiding New York City where it was easy to score drugs.  Though he did take heroin during his stay, he was healthy enough to resume live performances in local venues, playing with drummer Elvin Jones and pianist Tommy Flanagan as part of Billy Mitchell's house band at the Blue Bird club.  He was also \"pimping a little\" at this time. A widely related story, attributed to Richard \"Prophet\" Jennings, was that Davis stumbled into Baker's Keyboard Lounge out of the rain, carrying his trumpet in a paper bag under his coat, walked to the bandstand and interrupted Roach and Clifford Brown in the midst of performing \"Sweet Georgia Brown\" and played \"My Funny Valentine\" before leaving.  Davis was supposedly embarrassed into getting clean by this incident.  Davis later disputed this account, stating that Roach had invited him to play and that his decision to finally quit heroin was unrelated to the incident, citing his idol boxer Sugar Ray Robinson as an inspiration to get clean and resume his career.\n\nIn February 1954 a clean Davis returned to New York City, feeling good \"for the first time in a long time\" and mentally and physically stronger, and joined a gym.  He informed Weinstock and management at Blue Note Records that he was ready to record music with a quintet, which he was granted and set the task of recording more music than before to make up for lost time.  Davis considered two albums with sessions recorded from this time, Miles Davis Quartet (1954) for Prestige and Miles Davis Volume 2 (1956) for Blue Note, as \"very important\" to him as he felt his performances were particularly strong.  Davis was paid roughly $750 (US$ in  dollars) for each album and denied to give away all his publishing rights.  By now he had abandoned the bebop style and got to know the music of pianist Ahmad Jamal, whose approach and use of space greatly influenced Davis.  When Davis returned to the studio in June 1955 to record Miles Davis Quartet and sought a new pianist, he wished for someone who played like Jamal and picked Red Garland.\n\nBetween 1951 and 1954, Davis released many records on Prestige with varied line-ups, many with Rollins and Blakey.  Such albums include Blue Haze (1956), Bags' Groove (1957), Walkin' (1957), and Miles Davis and the Modern Jazz Giants (1959), recorded after Davis' recovery from heroin addiction.  They document the evolution of Davis' style and sound, including the fixture of the Harmon mute, also known as a wah-wah mute, onto his trumpet and placed close to the microphone which became his signature sound, and more spacious, melodic, and relaxed phrasing.  Davis assumed a central position in what is known as hard bop, a contrast to bebop as hard bop included slower tempos and a less radical approach to harmony and melody, often adopting popular tunes and American standards as starting points for improvisation.  Hard bop also distanced itself from cool jazz with its harder beat and blues-inspired music.Open references to the blues in jazz playing were fairly recent. Until the middle of the 1930s, as Coleman Hawkins declared to Alan Lomax (The Land Where the Blues Began. New York: Pantheon, 1993), African-American players working in white establishments would avoid references to the blues altogether. A few critics have named Walkin (1957) the album that created the hard bop genre.\n\nIn this period, Davis gained a reputation for being distant, cold, and withdrawn, and for having a quick temper.  Davis later wrote that in 1954, Leonard \"was the most important thing in my life besides music\" and even took on his \"arrogant attitude\".  Factors that contributed to this reputation included his contempt for the critics and specialized press, and some well-publicized confrontations with the public and with fellow musicians.  A near fight with Thelonious Monk during the recording of Bags' Groove received wide exposure in the specialized press.Davis had asked Monk to \"lay off\" (stop playing) while he was soloing.  In the autobiography, Davis says that Monk \"could not play behind a horn.\" Charles Mingus reported this, and more, in his \"Open Letter to Miles Davis\".  In mid-1954, Davis reunited with Gréco for the first time since 1949 after she arrived in New York City for film prospects; the two had been in occasional contact since Davis left Paris.  Though Davis was too busy to move to Spain with Gréco, the two \"remained lovers for many years\".\n\nDavis had an operation to remove polyps from his larynx in October 1955.  Even though he was not supposed to speak at all, he had an argument with somebody and raised his voice.  This outburst damaged his vocal cords forever, giving him the characteristic raspy voice that came to be associated with him. \"[It was] in February or March 1956 that I had my first throat operation and had to disband the group while recovering.  During the course of the conversation I raised my voice to make a point and fucked up my voice.  I wasn't even supposed to talk for at least ten days, and here I was not only talking, but talking loudly.  After that incident my voice had this whisper that has been with me ever since.\"  The \"nocturnal\" quality of Davis' playing and his somber reputation, along with his whispering voice,Acquired by shouting at a record producer while still ailing after a recent operation to the throat – The Autobiography. earned him the lasting moniker of \"prince of darkness\", adding a patina of mystery to his public persona.Davis began to be referred to as \"the Prince of Darkness\" in liner notes of the records of this period, and the moniker persists to this day; see, for instance, [http://findarticles.com/p/articles/mi_hb1367/is_199111/ai_n5603401/ his obituary]  in The Nation, and countless references in DVD [https://www.amazon.com/dp/B000ALZI3I], movies [https://www.pbs.org/jazz/biography/artist_id_davis_miles.htm] and print articles [http://www.allaboutjazz.com/php/article.php?id\n29834].\n\n1955–1959: Signing to Columbia, first great quintet, and modal jazz\n\nIn July 1955, Davis' fortunes improved considerably when he landed a last minute booking at the second annual Newport Jazz Festival on July 17, with a line-up of Monk, Heath, drummer Connie Kay, and horn players Zoot Sims and Gerry Mulligan. Davis convinced organizer George Wein that he should be on the bill, and Wein complied. The performance was hailed as a triumph by critics and widened Davis' music to the larger affluent white audience, and Davis soon tied first place with Gillespie in the 1955 Down Beat reader's poll in the trumpet category. Davis noted that after his set at Newport \"things began to happen\". Among them was the start of his longtime association with Columbia Records after producer George Avakian saw Davis perform at Newport and wished to sign him. With a year remaining on his Prestige agreement, which required Davis to release four more albums, Davis secured a contract with Columbia which included a $4,000 advance (US$ in  dollars) and a condition that his recordings for the label remained unreleased until his Prestige agreement had expired.\n\nAfter recording sessions for Mingus for his newly established Debut label, and a successful gig at Café Bohemia with Rollins, Garland, Chambers, and drummer Philly Joe Jones, Davis used this line-up to record his final sessions for Prestige. It took Davis two sessions, held on 11 May and 26 October 1956, to record enough material to fulfil his contract which was released in a series of four albums: Cookin' with the Miles Davis Quintet (1957), Relaxin' with the Miles Davis Quintet (1958), Workin' with the Miles Davis Quintet (1959), and Steamin' with the Miles Davis Quintet (1961), each being instrumental in establishing Davis' quintet as one of the best on the scene.\n\nIn mid-1955, Davis recruited players for what became known as his first \"great quintet\" of Garland, Chambers, Jones, and tenor saxophonist John Coltrane, who was chosen after the unsuccessful attempt to recruit Julian \"Cannonball\" Adderley. Neither of Davis' picks were widely known at the time, nor had they received a great deal of exposure. The five debuted on record with the widely received 'Round About Midnight (1957), Davis' first for Columbia. Their live repertoire included a mix of bebop mainstays, jazz standards from the Great American Songbook and pre-bop eras, and traditional tunes. The prevailing style of the group was a development of the Davis experience in the previous years—Davis playing long, legato, and essentially melodic lines, while Coltrane, who during these years emerged as a leading figure on the musical scene, contrasted by playing high-energy solos.\n\nIn November 1956, Davis split his quintet temporarily to tour Europe as part of the Birdland All-Stars, formed of himself, the Modern Jazz Quartet, and a line-up of French and German musicians. During his stay in Paris, he reunited with Greco for the first time since 1949. He then returned home, reunited his quartet, and toured the US for two months from December 1956. The tour was met with internal friction however, as Davis had gotten tired of Jones' and Coltrane's drug addictions, causing them to turn up late to gigs or at times not at all. Davis, on the other hand, was exercising regularly and consuming alcohol in moderation, despite the occasional time he would \"snort a little coke\". Davis fired Jones and Coltrane at the tour's end in March 1957, and were replaced by saxophonist Sonny Rollins and drummer Art Taylor.\n\nIn November 1957, Davis returned to Paris where he recorded the soundtrack to Louis Malle's film Ascenseur pour l'échafaud (1958). With the aid of French session musicians Barney Wilen, Pierre Michelot, and René Urtreger, and American drummer Kenny Clarke, the group recorded the score without relying on written material and improvised as they watched the film on a screen in the studio. Davis returned to New York City in December and revived his quintet with a returning Coltrane, now clean from his drug habit, and Adderley. Now a sextet, the group recorded material in early 1958 that was released on Milestones (1958), an album that first showcased Davis' interest in modal jazz. Davis had witnessed a performance of Les Ballets Africains from Guinea which sparked his interest in such music, then new concept that called for a slower, deliberate pace of music and allowed the creation of solos out of harmony rather than chords. Such music from the ballet featured the kalimba played for long periods of time on a single chord, weaving in and out of consonance and dissonance. By May 1958, Davis had replaced Jones with drummer Jimmy Cobb and faced Garland walking out of the group, leaving Davis to play piano on \"Sid's Ahead\" on Milestones. Davis wanted a new pianist who could get into modal jazz which he found in Bill Evans, a young white musician with a classical background. Evans had a unique, impressionistic approach to the piano, and his musical ideas had a strong influence on Davis. After eight months of touring, however, Evans was burned out and left in late 1958. He was replaced by Wynton Kelly who brought a swinging, bluesy approach that contrasted with Evans' more delicate playing. The six made their recording debut on a compilation album, Jazz Track (1958).\n\n1957–1963: Collaborations with Gil Evans and Kind of Blue\n\nBy early 1957, Davis was exhausted from recording and touring with his quintet and wished to pursue new projects. During a two-week residency in Chicago in March, the 30-year-old Davis told journalists of his intention to retire at its conclusion and revealed offers he had received to become a teacher at Harvard University and a musical director at a record label. Avakian agreed that it was time for Davis to explore something different, but Davis rejected his suggestion of returning to his nonet as he took it as a step backward. Avakian then suggested that Davis work with a bigger ensemble, similar to what he had played on Music for Brass (1957), an album of orchestral and brass-arranged music led by Gunther Schuller featuring Davis as a guest soloist. Davis accepted, and wished to work with arranger and composer Gil Evans in what became a five-album collaboration from 1957 to 1962. The first, Miles Ahead (1957), showcased Davis playing a flugelhorn and a rendition \"The Maids of Cadiz\" by Léo Delibes, the first piece of European classical music that Davis recorded. Evans devised orchestral passages as transitions between each track were joined together with studio editing, turning each side of the album into a seamless piece of music.Cook, op. cit. Porgy and Bess (1959) features arrangements of pieces from George Gershwin's opera which included Chambers, Jones, and Adderley. Sketches of Spain (1960) explored Spanish music with tracks by contemporary composers Joaquín Rodrigo and Manuel de Falla with originals from Evans. Recording was met with difficulties as the classical players were unable to improvise to what Evans wished for and the jazz musicians found the arrangements too difficult. \"Solea\" features a 10-minute trumpet solo by Davis. The album was a critical success and sold over 120,000 copies in the US. Davis performed with an orchestra conducted by Evans at Carnegie Hall in May 1961 to raise money for charity. The pair's final album was Quiet Nights (1962), a collection of bossa novas released against their wishes; Evans stated it was only half an album and blamed the record company; Davis blamed producer Teo Macero, and did not speak to him for more than two years. Davis noted later that \"my best friend is Gil Evans\"; their work was featured in the boxed set Miles Davis & Gil Evans: The Complete Columbia Studio Recordings (1996) which won a Grammy Award for Best Historical Album and Best Album Notes in 1997.\n\nIn March and April 1959, Davis recorded what many critics consider his greatest album, Kind of Blue (1959). Davis named the album to describe its overall mood. He called back Bill Evans, months away from forming what would become his own seminal trio, for the album sessions, as the music had been planned around Evans' piano style. Both Davis and Evans were acquainted with the ideas of pianist George Russell regarding modal jazz; Davis from discussions with Russell and others before the Birth of the Cool sessions, and Evans from studying with Russell in 1956. Davis, however, had neglected to inform current pianist Wynton Kelly of Evans' role in the recordings; Kelly subsequently played only on the track \"Freddie Freeloader\" and was not present at the April dates for the album. \"So What\" and \"All Blues\" had been played by the sextet at performances prior to the recording sessions, but for the other three compositions, Davis and Evans prepared skeletal harmonic frameworks that the other musicians saw for the first time on the day of recording, to allow a fresher approach to their improvisations. The resulting album has proven both highly popular and enormously influential. Released in August 1959, Kind of Blue was an instant success, with widespread radio airplay and rave reviews from critics. It remains the best selling jazz album of all time; in October 2008, the album reached 4× platinum from the Recording Industry Association of America for selling over four million copies in the US alone. In 2009, the US House of Representatives voted 409–0 to pass a resolution that honored it as a national treasure.\n\nDuring the success of Kind of Blue, Davis found himself involved with the law. On August 25, 1959, during a recording session at the Birdland nightclub in New York City for the US armed services, Davis took a break outside the club. As he was escorting a blonde woman across the sidewalk to a taxi, Davis was told by patrolman Gerald Kilduff to \"move on\". Davis explained that he was working at the club and refused to move, yet Kilduff proceeded to arrest Davis and grabbed him as Davis tried to protect himself. Witnesses said the patrolman punched Davis in the stomach with his nightstick without provocation. Two detectives held the crowd back, while a third approached Davis from behind and beat him in the head. Davis was arrested and taken to jail where he was charged for assaulting an officer before he was taken to hospital where he received five stitches. Davis was released on a $525 bail (US$ in  dollars). By January 1960, Davis was acquitted of disorderly conduct and third-degree assault. Davis later stated the incident \"changed my whole life and whole attitude again, made me feel bitter and cynical again when I was starting to feel good about the things that had changed in this country\".\n\nDavis supported Kind of Blue with an extended tour with his sextet. He persuaded Coltrane to play with the group on one final European tour in the spring of 1960. Coltrane then departed to form his classic quartet, although he returned for some of the tracks on Davis' album Someday My Prince Will Come (1961). Its front cover features a photograph of his wife at that time, Frances Taylor, after Davis demanded that Columbia depict black women on his album covers. By 1961, Ebony magazine estimated Davis was earning as much as $150,000 a year (US$ in  dollars). After Coltrane, Davis tried various saxophonists, including Jimmy Heath, Sonny Stitt, and Hank Mobley. The quintet with Hank Mobley was recorded in the studio and on several live engagements at Carnegie Hall and the Black Hawk jazz club in San Francisco. Stitt's playing with the group is found on a recording made in Olympia, Paris (where Davis and Coltrane had played a few months before) and the Live in Stockholm album.\n\nIn early 1958, Davis began a relationship with Frances Taylor, a dancer whom he had first met in Los Angeles five years prior, and they married on December 21, 1960. The relationship involved numerous incidents of Davis' domestic violence towards Taylor. Davis later wrote, \"Every time I hit her, I felt bad because a lot of it really wasn't her fault but had to do with me being temperamental and jealous\". One reason for his behavior was that by early 1963, Davis had increased his abuse of alcohol and cocaine in an attempt to reduce the pain from his hip and joint pain and discomfort caused from his recent diagnosis of sickle cell anemia. He also experienced hallucinations, \"looking for this imaginary person\" in his home to the point of searching the house wielding a kitchen knife. About a week after the photograph for Davis' album E.S.P. (1965) was taken, Taylor left Davis for the last time. They remained separated until they officially divorced in February 1968.\n\n1963–1968: Second \"great quintet\"\n\nIn December 1962, Davis and his line-up of Kelly, Chambers, Cobb, and Rollins played together for the last time after the first three wished to leave and play as a trio. Rollins left to join them soon after, leaving Davis to pay over $25,000 (US$ in  dollars) to cancel upcoming gigs and quickly assemble a new group. Following auditions, he found his new band in tenor saxophonist George Coleman, bassist Ron Carter, pianist Victor Feldman, and drummer Frank Butler, and the five proceeded to record in the studio. By May 1963, Feldman and Butler were replaced by pianist Herbie Hancock and the 17-year-old drummer Tony Williams who made Davis \"excited all over again\". With this group, Davis completed the rest of what became Seven Steps to Heaven (1963) and recorded the live albums Miles Davis in Europe (1964), My Funny Valentine (1965), and Four & More (1966). The quintet played essentially the same repertoire of bebop tunes and standards that earlier Davis bands had played, but tackled them with increasing structural and rhythmic freedom and, in the case of the up-tempo material, breakneck speed.\n\nIn mid-1964, Coleman was replaced by saxophonist Sam Rivers until Davis persuaded Wayne Shorter to end his tenure with Art Blakey and join him, thus becoming what is known as Davis' second \"great quintet\" which lasted through 1968. Shorter became the group's principal composer and Davis' album E.S.P. (1965) was named after his composition recorded for it. While touring Europe, the group made their first official recording, Miles in Berlin (1965). On returning to the US in late 1964 Davis, at Jackie DeShannon's urging, was instrumental in getting rock band The Byrds signed to Columbia.\n\nBy 1965, Davis required medical attention for the pain in his hip, which had worsened since his Japanese tour the previous year. He underwent hip replacement surgery in April 1965 with bone taken from his shin, but it failed. After his third month in the hospital, Davis discharged himself and went home due to boredom. He returned to the hospital in August, however, after a fall in his home caused damage that required a second operation, with a plastic hip joint inserted. In November 1965, Davis had recovered enough to return to live performance with his quintet, which included gigs at the Plugged Nickel in Chicago, marking the return of Macero as Davis' engineer and producer after their rift over Quiet Nights had healed. Unlike their studio albums, the quintet still played primarily jazz standards and bebop tunes, although some of the titles remain the same as the tunes played by Davis' first quintet, the quick tempos and musical departure from the framework of the tune are dramatic.\n\nIn January 1966, Davis returned to the hospital with a liver infection, which required a three-month break in activity. He recovered and resumed touring, playing more dates in colleges as he had got tired of performing in more typical jazz venues. Columbia president Clive Davis noted that in 1966 his sales had declined to around 40,000–50,000 per album, compared to as many as 100,000 per release a few years before. Matters were not helped by the press reporting Davis' apparent financial troubles and imminent demise. After his appearance at the 1966 Newport Jazz Festival, Davis returned to the studio with his quintet in October 1966, which marked the first of a series of productive sessions that lasted until September 1968. During this time, Davis had entered a relationship with actress Cicely Tyson, who became a positive influence on his life and mental well-being and helped him reduce his alcohol consumption.\n\nMaterial from the 1966–1968 sessions was released on Miles Smiles (1966), Sorcerer (1967), Nefertiti (1967), Miles in the Sky (1968), and Filles de Kilimanjaro (1968). The quintet's approach to the new music became known as \"time no changes\", which referred to Davis' choice to depart from chordal sequences and adopt a more open approach with the rhythm section responding to the soloists' melodies. Through Nefertiti the studio recordings consisted primarily of originals composed by Shorter, with occasional compositions by the other sidemen. In 1967, the group began to play their live concerts in continuous sets, each tune flowing into the next, with only the melody indicating any sort of demarcation. Davis' bands continued to perform this way until his hiatus in 1975.\n\nMiles in the Sky and Filles de Kilimanjaro—which tentatively introduced electric bass, electric piano, and electric guitar on some tracks—pointed the way to the subsequent fusion phase of Davis' career. Davis also began experimenting with more rock-oriented rhythms on these records. By the time the second half of Filles de Kilimanjaro was recorded, bassist Dave Holland and pianist Chick Corea had replaced Carter and Hancock in the working band, though both Carter and Hancock occasionally contributed to future recording sessions. Davis soon began to take over the compositional duties of his sidemen.\n\n1968–1975: The electric period\n\nIn September 1968, Davis married 23-year-old model and songwriter Betty Mabry. The marriage ended in divorce the following year, yet Mabry, a familiar face in the New York City scene and aware of the emerging counterculture audience, helped introduce Davis to popular rock, soul and funk artists and trending fashions of the day. Jazz critic Leonard Feather recalled visiting Davis' apartment during this time and was shocked to see the trumpeter listen to albums by The Byrds, Aretha Franklin, and Dionne Warwick. Davis also took a liking to James Brown, Jimi Hendrix, and Sly and the Family Stone. The musical transition required that Davis adapt to electric instruments in both live performances and in the studio and make music that would appeal to the younger audience.\n\nDavis' first step in his electric period began with In a Silent Way (1969), recorded in a single studio session on February 18, 1969 with Shorter, Hancock, Holland, and Williams alongside keyboardists Chick Corea and Josef Zawinul, and guitarist John McLaughlin. The album features two side long tracks that Macero pieced together from different takes recorded at the session resembling elements of a classical sonata form. Released in July 1969, the album received a divided critical reception among jazz purists who accused Davis of \"selling out\" to the rock audience. Nevertheless, it reached number 134 on the US Billboard Top LPs chart, Davis's first album since My Funny Valentine to reach the chart. It marked the start of Davis' entry into jazz fusion. Davis' touring band of 1969–1970 of Shorter, Corea, Holland, and DeJohnette never completed a studio recording together and subsequently became known as the \"lost quintet\". In October 1969, Davis was shot at five times while in his car with one of his two lovers at the time, Marguerite Eskridge. The incident left Davis with a graze and Eskridge unharmed.\n\nFor his next album Davis gathered an even larger group of musicians in August 1969, this time with new drummer Jack DeJohnette with Airto Moreira and Bennie Maupin, to record the double album Bitches Brew (1970). The album features extended compositions, some over 20 minutes in length, that, like In a Silent Way, were never played straight through in the studio but rather formed from several takes by Macero and Davis. Bitches Brew made greater use of studio recording techniques including splicing, multitrack recording, and tape loops; the 20-minute \"Pharaoh's Dance\" contains 19 edits. Upon its release in March 1970, Bitches Brew peaked at number 35 on the Billboard Top LPs chart and, in 1976, attained gold certification for 500,000 copies shipped in the US. By 2003, it had sold one million copies.\n\nIn March 1970, Davis began to perform as the opening act for various rock acts, allowing Columbia to market Bitches Brew to a wider audience. He was so offended by Clive Davis's suggestion to perform at the Fillmore East he threatened to switch record labels, yet he reconsidered and shared a bill with the Steve Miller Band and Neil Young on March 6 and 7. Biographer Paul Tingen wrote: \"Miles's newcomer status in this environment\" led to \"mixed audience reactions, often having to play for dramatically reduced fees, and enduring the 'sell-out' accusations from the jazz world\", as well as being \"attacked by sections of the black press for supposedly genuflecting to white culture\". The 1970 tours included a spot at the 1970 Isle of Wight Festival on August 29 which saw Davis perform to an estimated 600,000 people, the largest of his career. Plans to have Davis record with Hendrix ended following the guitarist's death soon after; his funeral was the last that Davis attended. Several live albums with a transitional sextet/septet including Corea, DeJohnette, Holland, Moreira, saxophonist Steve Grossman, and keyboardist Keith Jarrett were recorded for Live at the Fillmore East (1970) and Black Beauty (1973).\n\nBy 1971, Davis had signed a new contract with Columbia that paid him $100,000 a year (US$ in  dollars) for three years including royalties. He had recorded the soundtrack for the 1970 documentary film on heavyweight boxer Jack Johnson, containing two long pieces of 25 and 26 minutes in length that features Hancock, McLaughlin, Sonny Sharrock, and drummer Billy Cobham. The music, released on Jack Johnson (1971), gained critical acclaim. During this period, Davis was committed to making music for the young African-American audience drawn to the more commercial, groove-oriented style of popular music of the time; by November 1971, DeJohnette and Moreira had been replaced in the touring ensemble by drummer Leon \"Ndugu\" Chancler and percussionists James Mtume and Don Alias. The studio and live album Live-Evil (1971) was released in the same month and Davis' ensemble—though retaining the exploratory imperative of Bitches Brew—had transformed into a much more funk-oriented group.\n\nIn 1972, composer Paul Buckmaster introduced Davis to the music of German avant-garde composer Karlheinz Stockhausen which led to a period of new creative exploration. Biographer J. K. Chambers wrote, \"The effect of Davis' study of Stockhausen could not be repressed for long ... Davis' own 'space music' shows Stockhausen's influence compositionally.\" His recordings and performances during this period were described as \"space music\" by fans, Feather, and Buckmaster, who described it as \"a lot of mood changes—heavy, dark, intense—definitely space music.\" These influences were incorporated on the studio album On the Corner (1972), blending Stockhausen and Buckmaster with funk elements which had Davis invite Buckmaster to New York City to oversee the writing and recording.\n\nUpon its release, the album's commercial success was as limited as that of Davis's albums since Bitches Brew, topping the Billboard jazz chart but only peaking at number 156 in the more heterogeneous Billboard 200. Although On the Corner elicited favorable reviews from several influential critics of popular music (including Ralph J. Gleason of Rolling Stone and Robert Christgau of The Village Voice), Davis felt that Columbia had only marketed the album to jazz traditionalists who failed to understand it: \"Columbia ... didn't push it, so it didn't do as well as we all thought it would. The music was meant to be heard by young black people, but they just treated it like any other jazz album and advertised it that way, pushed it on the jazz radio stations. Young black kids don't listen to those stations; they listen to R&B stations and some rock stations.\" In October 1972, Davis broke his ankles in a car crash, for which he took painkillers and cocaine to cope and numb the pain. Looking back at his career after the incident, Davis wrote \"everything started to blur\".\n\nAfter recording On the Corner, Davis put together a new group in 1972 with Henderson, Mtume, Carlos Garnett, guitarist Reggie Lucas, organist Lonnie Liston Smith, tabla player Badal Roy, sitarist Khalil Balakrishna, and drummer Al Foster. It was unusual in that only Smith was a major jazz instrumentalist; as a result, the music emphasized rhythmic density and shifting textures instead of individual solos. This group was recorded live for In Concert (1973), but Davis found it unsatisfactory, leading him to drop the tabla and sitar and take over keyboard duties. He also added guitarist Pete Cosey. The compilation studio album Big Fun (1974) contains four long improvisations recorded between 1969 and 1972.\n\nDavis' studio activity in the 1970s culminated in sessions throughout 1973 and 1974 for Get Up with It (1974), a compilation that included four long pieces (comprising over ninety minutes of new music) alongside four shorter recordings from 1970 and 1972. Notably, the album contained \"He Loved Him Madly\", a thirty-minute tribute to the recently deceased Duke Ellington that presaged later developments in ambient music. In the United States, it performed comparably to On the Corner, reaching number 8 on the jazz chart and number 141 on the pop chart. He then concentrated on live performance with a series of concerts that Columbia released on the double live albums Agharta (1975), Pangaea (1976), and Dark Magus (1977). The first two are recordings of two sets from February 1, 1975 in Osaka, by which time Davis was troubled with pneumonia, osteoarthritis, sickle-cell anemia, depression, bursitis, and stomach ulcers; he relied on alcohol, codeine and morphine to get through the engagements. His shows divided audiences and were routinely panned by critics which cited the trumpeter's tendency to perform with his back to the audience. Although Cosey later asserted that \"the band really advanced after the Japanese tour\", Davis was once again hospitalized for his ulcers and a hernia during a subsequent tour of the US opening for Hancock. During this period, the keyboardist had eclipsed his former employer from a commercial standpoint with such fusion efforts as Head Hunters (1973) and Thrust (1974), both of which were marketed to pop audiences in the aftermath of the On the Corner farrago and respectively peaked at number 13 on the Billboard pop chart.\n\nFollowing appearances at the 1975 Newport Jazz Festival in July and the Schaefer Music Festival in New York City on September 5, Davis began a five-year period of inactivity from music.\n\n1975–1980: Hiatus\n\nIn his autobiography, Davis openly wrote about his mental state during his break in activity, describing his Upper West Side apartment as a wreck, his heavy drug and alcohol use, and his sexual encounters with many women. In December 1975, he had regained enough strength to undergo a much needed hip replacement operation. In March 1976, Rolling Stone reported rumors of his imminent demise citing his numerous health problems during his previous tour and lifestyle. In December 1976, Davis renewed his recording contract with Columbia for three years, but the label was initially reluctant to pay his usual large advances that they had done with his previous deals. This led to Davis' lawyer to enter negotiations with United Artists Records, causing Columbia to match the offer made by the rival label and complete the deal. They then established the Miles Davis Fund, paying the trumpeter on a regular basis thereafter. Pianist Vladimir Horowitz was the only other Columbia artist that had such a status with the label. Columbia released a series of compilation albums to fulfil contractual obligations, including Water Babies (1976) and Circle in the Round (1979).\n\nIn early 1978, Davis moved in with Elena Steinberg in Norwalk, Connecticut after her friend, music reporter Julie Coryell, was granted an interview with the trumpeter and wanted him cared to health. After working on some new music, including a tune co-written by him and guitarist Barry Finnerty, Davis got Coryell's husband, fusion guitarist Larry Coryell, to develop his work which was set for recording on March 2, 1978 with a line-up formed of Coryell, keyboardists Masabumi Kikuchi and George Pavlis, bassist T. M. Stevens, and drummer Al Foster. Davis proceeded to play the arranged piece in an uptempo fashion, abandoned his trumpet for the organ, and had Macero record the session without the band's knowledge. After Coryell declined a spot in a band that Davis was beginning to put together, Davis returned to his reclusive lifestyle in New York City. Not long after, Eskridge had Davis jailed for failing to pay maintenance to their son which cost Davis $10,000 (US$ in  dollars) for release on bail. A further recording session that involved Buckmaster and Gil Evans was shelved, with Evans leaving after not receiving promised compensation. In August 1978, Davis took a step towards a comeback when he hired Mark Rothbaum, who had worked for Davis since 1972, as his new manager. In 1979, Davis placed in the yearly top-ten trumpeter poll of Down Beat.\n\nBy 1979, Davis had rekindled his relationship with actress Cicely Tyson, with whom he overcame his cocaine addiction and regained his enthusiasm for music. The two married on November 26, 1981 in a ceremony held in Bill Cosby's home in Massachusetts and officiated by politician and civil rights activist Andrew Young; the marriage ended in divorce that was finalized in 1989.\n\nIn October 1979, Davis' contract with Columbia was up for negotiations. By this time, label president Clive Davis was replaced by George Butler, who had made several visits to Davis' home during the previous two years to encourage him back into the studio to record new material. To help his situation, Davis had Buckmaster come over to collaborate on new music. Upon his arrival at Davis' home, Buckmaster organised an intervention for the trumpeter who by this time was living in squalor among pest and cockroach infestations and darkness, with his curtains constantly closed. His sister Dorothy took charge to clean his home with help from Buckmaster, Tyson, and neighbor Chaka Khan; Davis later thanked Buckmaster in helping him.\n\n1980–1985: Re-emergence\n\nDavis had not played trumpet for the better part of three years, and found the process of reclaiming embouchure difficult. His first studio appearance since his hiatus took place on May 1, 1980. A day later, Davis was hospitalised for a month over a leg infection. Davis then recorded The Man with the Horn (1981) from June 1980 to May 1981, with Macero assuming his role as producer. The album sees Davis playing mostly wah-wah with a younger, larger band. The initial large band was eventually abandoned in favor of a smaller combo featuring saxophonist Bill Evans, not to be confused with pianist Bill Evans, and bass player Marcus Miller, both of whom would be among Davis' most regular collaborators throughout the decade.\n\nThe Man with the Horn received a poor critical reception despite selling fairly well. In early June 1981, Davis returned to the stage, for the first time since 1975, for a ten-minute guest solo spot as part of Mel Lewis' band and orchestra at the Village Vanguard, New York City. This was followed by appearances with a new band, including a four-night run at Kix in Boston from 26–29 June, followed by two shows at Avery Fisher Hall on 5 July as part of the Kool Jazz Festival. Recordings from a mixture of dates from 1981, including the Kix and Avery Fisher Hall gigs, were released on We Want Miles (1982), which earned Davis a Grammy Award for Best Jazz Instrumental Performance by a Soloist.\n\nIn January 1982, while Tyson was working in Africa, Davis \"went a little wild\" with alcohol and suffered from a stroke which temporarily paralysed his right hand. Tyson returned home and cared for him; after three months of treatment with a Chinese acupuncturist Davis was able to play his trumpet, after which he took his doctor's warnings on board and began a lifestyle free of alcohol and drugs. He credits Tyson in his recovery which involved regular exercise, piano playing, and visits to spas, yet he lost weight. Tyson also encouraged Davis to pursue drawing which the trumpeter took a particular liking to and worked on art for the rest of his life.\n\nDavis resumed touring in May 1982 with a line-up that included French percussionist Mino Cinelu and guitarist John Scofield, with whom he worked closely on his studio album Star People (1983). In mid-1983, while working on the tracks for Decoy, an album mixing soul music and electronica that was released in 1984, Davis brought in producer, composer and keyboardist Robert Irving III, who had earlier collaborated with him on The Man with the Horn. With a seven-piece band, including Scofield, Evans, keyboardist and music director Irving, drummer Al Foster and bassist Darryl Jones (later of the Rolling Stones), Davis played a series of European gigs to positive receptions. In December 1984, during his stay in Denmark, Davis was awarded the Léonie Sonning Music Prize. During the event, Danish trumpeter Palle Mikkelborg had written a contemporary classical piece titled \"Aura\" for the event which impressed Davis to the point of returning to Denmark in early 1985 to record his next studio album, Aura (1989). However, Columbia was dissatisfied with the recording and delayed its release for four years.\n\nIn May 1985, one month into a tour, Davis signed a new recording deal with Warner Bros. Records which included Davis signing over his entire publishing rights. Trumpeter Wynton Marsalis publicly dismissed Davis' more recent fusion recordings as not being \"'true' jazz\", comments Davis initially shrugged off, calling Marsalis \"a nice young man, only confused.\" This changed after Marsalis appeared, unannounced, onstage in the midst of Davis' performance at the inaugural Vancouver International Jazz Festival in 1986. Marsalis whispered into Davis' ear that \"someone\" had told him to do so. Davis responded by ordering him off the stage. Davis had become increasingly irritated at Columbia's delay releasing Aura. The breaking point in the label-artist relationship appears to have come when a Columbia jazz producer requested Davis place a goodwill birthday call to Marsalis. The 1985 tour included a performance in London in July that saw Davis on stage for five hours. Jazz critic John Fordham concluded: \"The leader is clearly enjoying himself\". By 1985, Davis was a diabetic and required daily insulin injections.\n\nDavis released his final album for Columbia, You're Under Arrest, in September 1985. It included another brief stylistic detour, this time with his interpretations of Cyndi Lauper's ballad \"Time After Time\", and Michael Jackson's pop hit \"Human Nature\". Davis considered releasing an entire album of pop songs and recorded dozens of them, but the idea was scrapped. Davis noted that many of today's accepted jazz standards were in fact pop songs from Broadway theater, and that he was simply updating the \"standards\" repertoire with new material. 1985 also saw Davis guest-star on the TV show Miami Vice as pimp and minor criminal Ivory Jones in the episode titled \"Junk Love\" (first aired November 8, 1985).\n\nDavis collaborated with a number of figures from the British post-punk and new wave movements during this period, including Scritti Politti. At the invitation of producer Bill Laswell, he recorded some trumpet parts during sessions for Public Image Ltd.'s Album, according to Public Image's John Lydon in the liner notes of their Plastic Box box set. In Lydon's words, however, \"strangely enough, we didn't use [his contributions].\" According to Lydon in the Plastic Box notes, Davis favorably compared Lydon's singing voice to his trumpet sound during these sessions.\n\n1986–1991: Final years\n\nAfter taking part in the recording of the 1985 protest song \"Sun City\" as a member of Artists United Against Apartheid, Davis was featured on the instrumental \"Don't Stop Me Now\" by Toto for their album Fahrenheit (1986). For his next studio album, Davis intended to record as a collaboration with pop artist Prince, but the project was soon shelved. Instead, Davis chose to work with multi-instrumentalist Marcus Miller. The resulting album, Tutu (1986), was Davis' first to use modern studio tools including programmed synthesizers, sampling and drum loops, to create an entirely new setting for his music. Released in September 1986, its front cover features a striking portrait of Davis by Irving Penn. The album was described as the modern counterpart of Sketches of Spain and, in 1987, won Davis his second of three Grammy Awards for Best Jazz Instrumental Performance, Soloist.\n\nIn 1988, Davis had a small part as a street musician in the Christmas comedy film Scrooged, starring Bill Murray. He also collaborated with Zucchero Fornaciari recording a new version of Dune Mosse (Blue's), published in 2004 in Zu & Co. of the Italian bluesman. In November 1988, he was inducted into the Knights of Malta at a ceremony at the Alhambra Palace in Spain. Later that month, Davis cut his European tour short after he collapsed and fainted after a two-hour show in Madrid and flew home. Rumors of Davis' health were made public after the American tabloid magazine Star, in its February 21, 1989 edition, published that Davis had contracted AIDS, prompting Davis' manager Peter Shukat to issue a statement the following day to deny the claim. Shukat revealed Davis had been in hospital for a mild case of pneumonia and the removal of a benign polyp on his vocal cords, yet was resting comfortably in preparation for his 1989 tours. Davis later blamed one of his former wives or girlfriends for starting the rumor and decided against taking legal action. In 1989, Davis was interviewed on 60 Minutes by Harry Reasoner. In October 1989, Davis received a Grande Medaille de Vermeil from Paris mayor Jacques Chirac. In 1990, Davis received a Grammy Lifetime Achievement Award. In early 1991, he appeared in the Rolf de Heer film Dingo as a jazz musician. In the film's opening sequence, Davis and his band unexpectedly land on a remote airstrip in the Australian outback and proceed to perform for the surprised locals.\n\nDavis followed Tutu with Amandla (1989), another collaboration with Miller and George Duke plus the soundtracks to four films—Street Smart, Siesta, The Hot Spot (with bluesman John Lee Hooker), and Dingo. He continued to tour in the late 1980s with a band of constantly rotating personnel. Davis' last albums, both released posthumously, were the hip hop-influenced studio album Doo-Bop (1992) and Miles & Quincy Live at Montreux (1993), a collaboration with Quincy Jones for the 1991 Montreux Jazz Festival where, for the first time in three decades, Davis performed songs from Miles Ahead, Porgy and Bess and Sketches of Spain. Some listeners and critics who had been disappointed with his experimental late period were happy that his career ended in such a way.\n\nOn July 8, 1991, Davis returned to performing material from his past at the 1991 Montreux Jazz Festival with a band and orchestra conducted by Quincy Jones. The set consisted of select arrangements from his albums recorded with Gil Evans. The show was followed by a concert billed as Miles and Friends at the Grande halle de la Villette in Paris held two days later, featuring guest performances by artists he had worked with across his career, including John McLaughlin, Herbie Hancock and Josef Zawinul. During his stay in Paris, Davis was awarded the Chevalier of the Legion of Honour. Such retrospective concerts that Davis agreed to do in a short space of time led to the argument that the trumpeter knew he was dying, yet his road manager Gordon Meltzer believed Davis was unaware. A week after Paris, Davis and his group performed at the Nice Jazz Festival, followed by a show in London on July 19. Upon his return to the US, he stopped off in New York City to record material on his next album, Doo-Bop, and returned to California where he played at the Hollywood Bowl on August 25, his final live performance.\n\nDeath\n\nIn early September 1991, Davis checked into St. John's Hospital near his home in Santa Monica, California, for routine tests. During his stay, his doctors suggested he have a tracheal tube implanted to relieve his breathing following his repeated bouts of bronchial pneumonia. This provoked an outburst from Davis that led to an intracerebral hemorrhage, followed by a coma. After several days on life support, Davis' machine was turned off and he died on September 28, 1991. Davis was 65 years old. His death was officially reasoned as the combined effects of a stroke, pneumonia and respiratory failure. According to Troupe, Davis was taking azidothymidine (AZT), a type of antiretroviral drug used for the treatment of HIV and AIDS, during his treatments in hospital. A funeral service was held on October 5, 1991 at St. Peter's Church in New York City that was attended by around 500 friends, family members, and musical acquaintances, with many fans standing outside in the rain. Davis was buried in Woodlawn Cemetery in The Bronx, New York City, with one of his trumpets, close to the site of fellow jazz musician and his early idol, Duke Ellington.\n\nViews on his earlier work\n\nLate in his life, from the \"electric period\" onwards, Davis repeatedly explained his reasons for not wishing to perform his earlier works, such as Birth of the Cool or Kind of Blue. In his view, remaining stylistically static was the wrong option. He commented: \"\"So What\" or Kind of Blue, they were done in that era, the right hour, the right day, and it happened. It's over [...] What I used to play with Bill Evans, all those different modes, and substitute chords, we had the energy then and we liked it. But I have no feel for it anymore, it's more like warmed-over turkey.\"Interview with Ben Sindran, 1986. Quoted in Miles Davis and Bill Evans: Miles and Bill in Black & White, September 2001, Ashley Kahn, JazzTimes When Shirley Horn insisted in 1990 that Miles reconsider playing the ballads and modal tunes of his Kind of Blue period, he demurred. \"Nah, it hurts my lip,\" was the reason he gave.Interview to Shirley Horn. After 1990. Quoted in Miles Davis and Bill Evans: Miles and Bill in Black & White, September. 2001, Ashley Kahn, JazzTimes.\n\nOther musicians regretted Davis’ change of style, for example, Bill Evans, who was instrumental in creating Kind of Blue, said: \"I would like to hear more of the consummate melodic master, but I feel that big business and his record company have had a corrupting influence on his material. The rock and pop thing certainly draws a wider audience. It happens more and more these days that unqualified people with executive positions try to tell musicians what is good and what is bad music.\"Interview to Bill Evans. Late 1970s. Quoted in Miles Davis and Bill Evans: Miles and Bill in Black & White, September. 2001, Ashley Kahn, JazzTimes.\n\nLegacy and influence\n\nDavis is regarded as one of the most innovative, influential and respected figures in the history of music. The Guardian described him as \"a pioneer of 20th-century music, leading many of the key developments in the world of jazz.\" He has been described as “one of the great innovators in jazz\", and had the titles the Prince of Darkness and the Picasso of Jazz bestowed upon him. The Rolling Stone Encyclopedia of Rock & Roll noted: \"Miles Davis played a crucial and inevitably controversial role in every major development in jazz since the mid-'40s, and no other jazz musician has had so profound an effect on rock. Miles Davis was the most widely recognized jazz musician of his era, an outspoken social critic and an arbiter of style—in attitude and fashion—as well as music\".\n\nWilliam Ruhlmann of AllMusic wrote that \"To examine his career is to examine the history of jazz from the mid-1940s to the early 1990s, since he was in the thick of almost every important innovation and stylistic development in the music during that period [...] It can even be argued that jazz stopped evolving when Davis wasn't there to push it forward.\" As an innovative bandleader and composer, Miles Davis has influenced many notable musicians and bands from diverse genres. Miles' influence on the people who played with him has been described by music writer Christopher Smith as follows:\n\nMiles Davis's artistic interest was in the creation and manipulation of ritual space, in which gestures could be endowed with symbolic power sufficient to form a functional communicative, and hence musical, vocabulary. [...] Miles' performance tradition emphasized orality and the transmission of information and artistic insight from individual to individual. His position in that tradition, and his personality, talents, and artistic interests, impelled him to pursue a uniquely individual solution to the problems and the experiential possibilities of improvised performance.\n\nHis approach, owing largely to the African-American performance tradition that focused on individual expression, emphatic interaction, and creative response to shifting contents, had a profound impact on generations of jazz musicians.Smith, Christopher, \"A Sense of the Possible. Miles Davis and the Semiotics of Improvised Performance\", TDR, Vol. 39, No. 3 (Autumn 1995), pp. 41–55.\n\nKind of Blue remains the best selling jazz album of all time. On November 5, 2009, U.S. Representative John Conyers of Michigan sponsored a measure in the United States House of Representatives to recognize and commemorate the album on its 50th anniversary. The measure also affirms jazz as a national treasure and \"encourages the United States government to preserve and advance the art form of jazz music.\" It passed, unanimously, with a vote of 409–0 on December 15, 2009. The trumpet Davis used on the recording is displayed on the campus of the University of North Carolina at Greensboro. It was donated to the school by Arthur \"Buddy\" Gist, who met Davis in 1949 and became a close friend. The gift was the reason why the jazz program at UNCG is named the Miles Davis Jazz Studies Program.\n\nIn 1986, the New England Conservatory awarded Davis an Honorary Doctorate for his extraordinary contributions to music. Since 1960 the National Academy of Recording Arts and Sciences (NARAS) honored him with eight Grammy Awards, a Grammy Lifetime Achievement Award, and three Grammy Hall of Fame Awards.\n\nIn 2001 a two-hour documentary film by Mike Dibb entitled The Miles Davis Story (Dibb Directions/Channel 4 Television) won an International Emmy Award for arts documentary of the year.Deans, Jason, [https://www.theguardian.com/media/2001/nov/20/broadcasting \"Norton in Emmy triumph\"], The Guardian, November 20, 2001.\n\nIn 2010, Moldejazz premiered a play called Driving Miles, which focused on a landmark concert Davis performed in Molde, Norway, in 1984.\n\nMiles Ahead, is a 2015 American music film directed by Don Cheadle, co-written by Cheadle with Steven Baigelman, Stephen J. Rivele, and Christopher Wilkinson, which interprets the life and compositions of Davis. It premiered at the New York Film Festival in October 2015. Starring Cheadle, the film also features Emayatzy Corinealdi as Frances Taylor, and a cast including Ewan McGregor, Michael Stuhlbarg, and Lakeith Stanfield.\n\nAwards\n\n* Winner; Down Beat Reader's Poll Best Trumpet Player 1955\n* Winner; Down Beat Reader's Poll Best Trumpet Player 1957\n* Winner; Down Beat Reader's Poll Best Trumpet Player 1961\n* Grammy Award for Best Jazz Composition Of More Than Five Minutes Duration for Sketches of Spain (1960)\n* Grammy Award for Best Jazz Performance, Large Group Or Soloist With Large Group for Bitches Brew (1970)\n* Grammy Award for Best Jazz Instrumental Performance, Soloist for We Want Miles (1982)\n* Sonning Award for Lifetime Achievement In Music (1984; Copenhagen, Denmark)\n* Doctor of Music, honoris causa (1986; New England Conservatory)\n* Grammy Award for Best Jazz Instrumental Performance, Soloist for Tutu (1986)\n* Knight Hospitaller by the Order of St. John (1988)\n* Governor's Award from the New York State Council on the Arts (1989)\n* Grammy Award for Best Jazz Instrumental Performance, Soloist for Aura (1989)\n* Grammy Award for Best Jazz Instrumental Performance, Big Band for Aura (1989)\n* Grammy Lifetime Achievement Award (1990)\n* St. Louis Walk of Fame (May 20, 1990)\n* Australian Film Institute Award for Best Original Music Score for Dingo, shared with Michel Legrand (1991)\n* Knight of the Legion of Honor (July 16, 1991; Paris)\n* Grammy Award for Best R&B Instrumental Performance for Doo-Bop (1992)\n* Grammy Award for Best Large Jazz Ensemble Performance for Miles & Quincy Live at Montreux (1993)\n* Hollywood Walk of Fame Star (February 19, 1998)\n* Rock and Roll Hall of Fame Induction (March 13, 2006)\n* Hollywood's Rockwalk Induction (September 28, 2006)\n* RIAA Quadruple Platinum for Kind of Blue (October 7, 2008)\n\nDiscography\n\nFilmography\n\n Only one song is composed by Miles Davis in cooperation with Marcus Miller (\"Theme For Augustine\").\n Soundtrack is composed by Miles Davis in cooperation with Michel Legrand. Miles Davis. http://en.wikipedia.org/?curid=20405."
  }
}
