{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13985",
  "eid" : "10c5b990-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778537385,
  "textBody" : "Hatfield is a town and civil parish in Hertfordshire, England, in the borough of Welwyn Hatfield. It had a population of 29,616 in 2001, and 39,201 at the 2011 Census. The settlement is of Saxon origin. Hatfield House, home of the Marquess of Salisbury, forms the nucleus of the old town. From the 1930s when de Havilland opened a factory until the 1990s when British Aerospace closed it, aircraft design and manufacture employed more people there than any other industry. Hatfield was one of the post-war New Towns built around London and has much modernist architecture from the period. The University of Hertfordshire is based there. \n\nHatfield lies 20 mi north of London beside the A1(M) motorway and has direct trains to London King's Cross railway station, Finsbury Park and Moorgate. There has been a strong increase in commuters who work in London moving to the area\n\nHistory\n\nEarly history\n\nIn the Saxon period Hatfield was known as Hetfelle, but by the year 970, when King Edgar gave 5000 acre to the monastery of Ely, it had become known as Haethfeld. Hatfield is mentioned in the Domesday Book as the property of the Abbey of Ely, and unusually, the original census data which compilers of Domesday used still survives, giving us slightly more information than in the final Domesday record.Hatfield And Its People, Workers Educational Association, 13 vols., 1959–1966 No other records remain until 1226, when Henry III granted the Bishops of Ely rights to an annual four-day fair and a weekly market. The town was then called Bishop's Hatfield.\n\nHatfield House is the seat of the Cecil family, the Marquesses of Salisbury. Elizabeth Tudor was confined there for three years in what is now known as \"The Old Palace\" in Hatfield Park. Legend has it that it was here in 1558, while sitting under an oak tree in the Park, that she learned that she had become Queen following the death of her half-sister, Queen Mary I. She held her first Council in the Great Hall (The Old Palace) of Hatfield. In 1851, the route of the Great North Road (now the A1000) was altered to avoid cutting through the grounds of Hatfield House.\n\nThe town grew up around the gates of Hatfield House. Old Hatfield retains many historic buildings, notably the Old Palace, St Etheldreda's Church and Hatfield House. The Old Palace was built by the Bishop of Ely, Cardinal Morton, in 1497, during the reign of Henry VII, and the only surviving wing is still used today for Elizabethan-style banquets. St Etheldreda's Church was founded by the monks from Ely, and the first wooden church, built in 1285, was probably sited where the existing building stands overlooking the old town.\n\nAerospace industry\n\nIn 1930 the de Havilland airfield and aircraft factory was opened at Hatfield and by 1949 it had become the largest employer in the town, with almost 4,000 staff. It was taken over by Hawker Siddeley in 1960 and merged into British Aerospace in 1978.http://hatfieldaviationheritage.co.uk/hatfield-aerodrome/ In the 1930s it produced a range of small biplanes. During the Second World War it produced the Mosquito fighter bomber and developed the Vampire, the second British production jet aircraft after the Gloster Meteor. After the war, facilities were expanded and it developed the Comet airliner (the world's first production jet liner), the Trident airliner, and an early bizjet, the DH125.\n\nBritish Aerospace closed the Hatfield site in 1993 having moved the BAe 146 production line to Woodford Aerodrome. The land was used as a film set for Steven Spielberg's movie Saving Private Ryan and most of the BBC/HBO television drama Band of Brothers. It was later developed for housing, higher education, commerce and retail. Part of the former British Aerospace site was intended to be the site of a £500 million new hospital to replace the Queen Elizabeth II Hospital in Welwyn GC and a new campus for Oaklands College, but both projects were cancelled.\n\nToday, Hatfield's aviation history is remembered by the names of certain local streets and pubs (e.g. Comet Way, The Airfield, Dragon Road) as well as The Comet Hotel (now owned by Ramada) built in the 1930s. The Harrier Pub (formerly The Hilltop) is actually named after the Harrier bird, not the aircraft, hence the original pub sign showing the bird. The de Havilland Aircraft Heritage Centre, at Salisbury Hall in nearby London Colney, preserves and displays many historic de Havilland aeroplanes and related archives.\n\nNew Town\n\nThe Abercrombie Plan for London in 1944 proposed a New Town in Hatfield. It was designated in the New Towns Act 1946, forming part of the initial Hertfordshire group with nearby Stevenage, Welwyn Garden City and Letchworth. The Government allocated 2340 acre for Hatfield New Town, with a population target of 25,000.Brett, Lionel, Hatfield New Town, Report of the Hatfield Development Corporation, 1949 (By 2001 the population had reached 27,833.[http://www.hertsdirect.org/infobase/docs/pdfstore/tabKS01sett.pdf Office for National Statistics, 2001 Census, Key Statistics for HCC Settlements] ) The Hatfield Development Corporation, tasked with creating the New Town, chose to build a new town centre, rejecting Old Hatfield because it was on the wrong side of the railway, without space for expansion and \"with its intimate village character, out of scale with the town it would have to serve.\" They chose instead St Albans Road on the town's east-west bus route. A road pattern was planned that offered no temptation to through traffic to take short cuts through the town and which enabled local traffic to move rapidly.\n\nHatfield retains New Town characteristics, including much modernist architecture of the 1950s and the trees and open spaces that were outlined in the original design. As of 2017, the redevelopment of the town centre is planned.\n\nGovernance\n\nHatfield is part of Welwyn Hatfield borough council in the county of Hertfordshire. It is a civil parish and has a town council. It is twinned with the Dutch port town of Zierikzee. Hatfield is part of the Welwyn Hatfield constituency, which includes Welwyn Garden City. The MP for Welwyn Hatfield is Grant Shapps, (Conservative).\n\nClimate\n\nHatfield experiences an oceanic climate (Köppen climate classification Cfb) like most of the United Kingdom.\n\nCulture and recreation\n\nHatfield has a nine-screen Odeon cinema, a stately home (Hatfield House), a museum (Mill Green Museum), a contemporary art gallery (Art and Design Gallery), a theatre (The Weston Auditorium) and a music venue (The Forum Hertfordshire). There are shopping centres in the new town: the Galleria (indoor shopping centre), The Stable Yard (Hatfield House), and at two supermarkets (ASDA and Tesco).\n\nSport\n\nHatfield Town F.C. in Non-League football plays at Gosling Sports Park.\n\nThe town also has one public swimming pool, and four sports/leisure centres (two with indoor swimming pools).\n\nEducation\n\nHatfield contains numerous primary and secondary schools, including The Ryde School, St. Philip Howard Catholic Primary School, Onslow St Audrey's School and Bishops Hatfield Girls School and the independent day and boarding girls' school Queenswood School.\n\nThe University of Hertfordshire is based in Hatfield. A large section of the airfield site was purchased by the University and the £120 million de Havilland Campus, incorporating a £15 million Sports Village, was opened in September 2003. The university has closed its sites at Watford and Hertford; faculties situated there have been moved to the de Havilland Campus.\n\nPlaces of interest\n\n*Hatfield House.\n*Hatfield War Memorial\n*The Forum Hertfordshire (music venue) University of Hertfordshire. In 2011, the music video for Ed Sheeran’s Lego House, featuring Harry Potter’s Rupert Grint, was filmed in Hatfield. Filming took place at The Forum venue, located on University of Hertfordshire, College Lane campus. Filming of the video took place during Sheeran’s performance at the venue on 8 October 2011. Many students were involved during filming, as they made up most of the audience at the Forum that day.Logan, Ross. 2016. \"Ed Sheeran And Rupert Grint Shoot Lego House Video At Forum Hertfordshire In Hatfield\". Welwyn Hatfield Times. http://www.whtimes.co.uk/news/ed_sheeran_and_rupert_grint_shoot_lego_house_video_at_forum_hertfordshire_in_hatfield_1_1117402.\n*Mill Green Museum and watermill.\n*Art and Design Gallery (contemporary art gallery) University of Hertfordshire.\n*The Weston Auditorium (theatre and cinema) University of Hertfordshire.\n*The Galleria. [http://thegalleria.co.uk/ The Galleria]\n*Hatfield Business Park, former de Haviland plant, later Base Systems Hatfield, used as a location for Saving Private Ryan (film) and Band of Brothers (TV series).\n\nTransport\n\nHatfield is 20 mi to the north of London. It is 14 mi from London Luton Airport and also near Stansted airport. The A1(M) runs through the town, which is also close to the M25.\n\nThe East Coast railway line from London to York runs through the town, separating the old and new parts. A commuter service connects Hatfield railway station to London King's Cross. A new railway station and car park opened in late 2015. The frequent train service runs directly from Hatfield Station to London King's Cross via Finsbury Park (Victoria Underground Line), taking about 16 minutes to Finsbury Park and 21 minutes to London King's Cross on the fast trains, which run two to three times an hour. An additional train service calls at all stations to Moorgate in the City of London.\n\nThere was a fatal rail crash at Hatfield in 2000, which brought track maintenance deficiencies to public attention. A garden beside the East Coast Main Line was built as a memorial to the crash victims.\n\nNotable residents\n\nBusiness\n\n*Michael Birch (born 1970), founder of the social network BEBO, lived in Hatfield.\n*Sir Geoffrey de Havilland (1882–1965), founder of De Havilland Aircraft Company\n*Jack Olding (Henry John Douglas Olding, fl. mid-20th c.), wartime tank and tractor importer, came from Hatfield.\n\nMusic and dance\n\n*Babe Ruth, a 1970s rock band, came from Hatfield.[http://www.discogs.com/artist/Babe+Ruth Discogs Babe Ruth]; [http://www.bobbyshred.com/baberuth.html Bobby Shred's Babe Ruth Tribute Page.] \n*Colin Blunstone (born 1945) of The Zombies lived in Hatfield.\n*Martin Carthy (born 1941), folk musician, was born in Hatfield.\n*Sandra Conley (born 1943), principal dancer with the Royal Ballet.\n*Barbara Gaskin (born 1950), pop singer, No.1 with It's My Party\n*Alan Shacklock (born 1950), pop musician and record producer, lived in Hatfield.\n*Sal Solo (Christopher Scott Stevens, born 1961), rock singer, was born in Hatfield.\n*Mick Taylor (born 1949), Rolling Stones guitarist 1969–1974, grew up in Hatfield.\n*Tracey Thorn (born 1962), lead singer of Everything But The Girl, was born in Hatfield and attended Bishops Hatfield Girls School.\n\nPolitics, nobility and royalty\n\n*Robert Cecil, 1st Earl of Salisbury (c. 1563–1612), statesman\n*Robert Cecil, 3rd Marquess of Salisbury (1830–1903), Conservative politician, lived at Hatfield House and was buried at St Etheldreda Church.\n*Robert Gascoyne-Cecil, 5th Marquess of Salisbury (1893–1972), Conservative politician\n*William Lamb, 2nd Viscount Melbourne (1779–1848), prime minister, was buried at St Etheldreda Church.\n*George Stephen, 1st Baron Mount Stephen (1829–1921) lived at Brocket Hall.\n*Henry John Temple, 3rd Viscount Palmerston (1784–1865), prime minister\n*Elizabeth Tudor, later Queen Elizabeth I (1533–1603), lived at Hatfield House (Hatfield Old Palace).\n*Malcolm Wicks (1947–2012), Labour Party politician and Minister for Energy, was born in Hatfield.\n\nReligion\n\n*Walter Curle (1575–1647), Bishop of Winchester and a close supporter of William Laud, was born in Hatfield.\n*John Morton (c. 1420–1500), Cardinal and Bishop of Ely, built Hatfield Old Palace.\n\nScience and scholarship\n\n*L. H. Sumanadasa (born 1910), aviator and university founder, learned to fly at Hatfield.\n*John Tradescant the elder (c. 1570s–1638), botanist, gardener and naturalist, was head gardener at Hatfield House.\n\nSports\n\n*Samir Carruthers (born 1993), Sheffield United footballer, is from Hatfield.\n*Matthew Connolly (born 1987), QPR defender, lived and attended primary school in Hatfield.\n*Iain Dowie (born 1965), West Ham player, QPR manager & BBC pundit, was born and raised in Hatfield and studied mechanical engineering at the University of Hertfordshire.\n*Valentine Faithfull (1820–1894), first-class cricketer and clergyman, was born in Hatfield.\n*Rodney Marsh (born 1944), QPR footballer, is from Hatfield.\n*Francis Pember (1862–1954), first-class cricketer, was born in Hatfield.\n*Billy Joe Saunders (born 1989), WBO middleweight world champion boxer\n\nStage, media and film\n\n*Sanjeev Bhaskar (born 1963), comedian and broadcaster, lived in Hatfield whilst studying at the University of Hertfordshire.\n*John Cazabon (1914–1983), actor on stage, screen and radio, was born in Hatfield.\n*Pippa Haywood (born 1961), television, stage and radio actress, was born in Hatfield.\n*Diane-Louise Jordan (born 1960), television presenter, grew up in Hatfield.\n*David Kossoff (1919–2005), broadcaster and father of Paul Kossoff of the 1960s rock band Free, lived in Hatfield.\n*Derek Martin (born 1933), actor known especially for role of Charlie Slater in EastEnders\n*Gerry Northam (born 1947), radio presenter and  investigative journalist, was born in Hatfield.\n*Guy Ritchie (born 1968), film director famous for Snatch and Lock, Stock and Two Smoking Barrels, was born in Hatfield.\n\nWriting\n\n*Moniza Alvi (born 1954), poet and writer, grew up in Hatfield.\n*Barbara Cartland (1901–2000), author of romances, lived in Hatfield.\n*Geoffrey Drage (1860–1955), non-fiction writer and politician, was born in Hatfield.\n*Nathaniel Lee (c. 1653–1692), poet and playwright, was born in Hatfield, where his father was rector.\n\nNearby towns and villages\n\n*Bell Bar\n*Borehamwood\n*Brookmans Park\n*Colney Heath\n*Hertford\n*Lemsford, a village within Hatfield civil parish\n*Letty Green\n*London Colney\n*Newgate Street, a village within Hatfield civil parish\n*Potters Bar\n*St Albans\n*Stevenage\n*Watford\n*Welham Green\n*Welwyn Garden City",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Hatfield, Hertfordshire" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13985" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Hatfield is a town and civil parish in Hertfordshire, England, in the borough of Welwyn Hatfield. It had a population of 29,616 in 2001, and 39,201 at the 2011 Census. The settlement is of Saxon origin. Hatfield House, home of the Marquess of Salisbury, forms the nucleus of the old town. From the 1930s when de Havilland opened a factory until the 1990s when British Aerospace closed it, aircraft design and manufacture employed more people there than any other industry. Hatfield was one of the post-war New Towns built around London and has much modernist architecture from the period. The University of Hertfordshire is based there. \n\nHatfield lies 20 mi north of London beside the A1(M) motorway and has direct trains to London King's Cross railway station, Finsbury Park and Moorgate. There has been a strong increase in commuters who work in London moving to the area\n\nHistory\n\nEarly history\n\nIn the Saxon period Hatfield was known as Hetfelle, but by the year 970, when King Edgar gave 5000 acre to the monastery of Ely, it had become known as Haethfeld. Hatfield is mentioned in the Domesday Book as the property of the Abbey of Ely, and unusually, the original census data which compilers of Domesday used still survives, giving us slightly more information than in the final Domesday record.Hatfield And Its People, Workers Educational Association, 13 vols., 1959–1966 No other records remain until 1226, when Henry III granted the Bishops of Ely rights to an annual four-day fair and a weekly market. The town was then called Bishop's Hatfield.\n\nHatfield House is the seat of the Cecil family, the Marquesses of Salisbury. Elizabeth Tudor was confined there for three years in what is now known as \"The Old Palace\" in Hatfield Park. Legend has it that it was here in 1558, while sitting under an oak tree in the Park, that she learned that she had become Queen following the death of her half-sister, Queen Mary I. She held her first Council in the Great Hall (The Old Palace) of Hatfield. In 1851, the route of the Great North Road (now the A1000) was altered to avoid cutting through the grounds of Hatfield House.\n\nThe town grew up around the gates of Hatfield House. Old Hatfield retains many historic buildings, notably the Old Palace, St Etheldreda's Church and Hatfield House. The Old Palace was built by the Bishop of Ely, Cardinal Morton, in 1497, during the reign of Henry VII, and the only surviving wing is still used today for Elizabethan-style banquets. St Etheldreda's Church was founded by the monks from Ely, and the first wooden church, built in 1285, was probably sited where the existing building stands overlooking the old town.\n\nAerospace industry\n\nIn 1930 the de Havilland airfield and aircraft factory was opened at Hatfield and by 1949 it had become the largest employer in the town, with almost 4,000 staff. It was taken over by Hawker Siddeley in 1960 and merged into British Aerospace in 1978.http://hatfieldaviationheritage.co.uk/hatfield-aerodrome/ In the 1930s it produced a range of small biplanes. During the Second World War it produced the Mosquito fighter bomber and developed the Vampire, the second British production jet aircraft after the Gloster Meteor. After the war, facilities were expanded and it developed the Comet airliner (the world's first production jet liner), the Trident airliner, and an early bizjet, the DH125.\n\nBritish Aerospace closed the Hatfield site in 1993 having moved the BAe 146 production line to Woodford Aerodrome. The land was used as a film set for Steven Spielberg's movie Saving Private Ryan and most of the BBC/HBO television drama Band of Brothers. It was later developed for housing, higher education, commerce and retail. Part of the former British Aerospace site was intended to be the site of a £500 million new hospital to replace the Queen Elizabeth II Hospital in Welwyn GC and a new campus for Oaklands College, but both projects were cancelled.\n\nToday, Hatfield's aviation history is remembered by the names of certain local streets and pubs (e.g. Comet Way, The Airfield, Dragon Road) as well as The Comet Hotel (now owned by Ramada) built in the 1930s. The Harrier Pub (formerly The Hilltop) is actually named after the Harrier bird, not the aircraft, hence the original pub sign showing the bird. The de Havilland Aircraft Heritage Centre, at Salisbury Hall in nearby London Colney, preserves and displays many historic de Havilland aeroplanes and related archives.\n\nNew Town\n\nThe Abercrombie Plan for London in 1944 proposed a New Town in Hatfield. It was designated in the New Towns Act 1946, forming part of the initial Hertfordshire group with nearby Stevenage, Welwyn Garden City and Letchworth. The Government allocated 2340 acre for Hatfield New Town, with a population target of 25,000.Brett, Lionel, Hatfield New Town, Report of the Hatfield Development Corporation, 1949 (By 2001 the population had reached 27,833.[http://www.hertsdirect.org/infobase/docs/pdfstore/tabKS01sett.pdf Office for National Statistics, 2001 Census, Key Statistics for HCC Settlements] ) The Hatfield Development Corporation, tasked with creating the New Town, chose to build a new town centre, rejecting Old Hatfield because it was on the wrong side of the railway, without space for expansion and \"with its intimate village character, out of scale with the town it would have to serve.\" They chose instead St Albans Road on the town's east-west bus route. A road pattern was planned that offered no temptation to through traffic to take short cuts through the town and which enabled local traffic to move rapidly.\n\nHatfield retains New Town characteristics, including much modernist architecture of the 1950s and the trees and open spaces that were outlined in the original design. As of 2017, the redevelopment of the town centre is planned.\n\nGovernance\n\nHatfield is part of Welwyn Hatfield borough council in the county of Hertfordshire. It is a civil parish and has a town council. It is twinned with the Dutch port town of Zierikzee. Hatfield is part of the Welwyn Hatfield constituency, which includes Welwyn Garden City. The MP for Welwyn Hatfield is Grant Shapps, (Conservative).\n\nClimate\n\nHatfield experiences an oceanic climate (Köppen climate classification Cfb) like most of the United Kingdom.\n\nCulture and recreation\n\nHatfield has a nine-screen Odeon cinema, a stately home (Hatfield House), a museum (Mill Green Museum), a contemporary art gallery (Art and Design Gallery), a theatre (The Weston Auditorium) and a music venue (The Forum Hertfordshire). There are shopping centres in the new town: the Galleria (indoor shopping centre), The Stable Yard (Hatfield House), and at two supermarkets (ASDA and Tesco).\n\nSport\n\nHatfield Town F.C. in Non-League football plays at Gosling Sports Park.\n\nThe town also has one public swimming pool, and four sports/leisure centres (two with indoor swimming pools).\n\nEducation\n\nHatfield contains numerous primary and secondary schools, including The Ryde School, St. Philip Howard Catholic Primary School, Onslow St Audrey's School and Bishops Hatfield Girls School and the independent day and boarding girls' school Queenswood School.\n\nThe University of Hertfordshire is based in Hatfield. A large section of the airfield site was purchased by the University and the £120 million de Havilland Campus, incorporating a £15 million Sports Village, was opened in September 2003. The university has closed its sites at Watford and Hertford; faculties situated there have been moved to the de Havilland Campus.\n\nPlaces of interest\n\n*Hatfield House.\n*Hatfield War Memorial\n*The Forum Hertfordshire (music venue) University of Hertfordshire. In 2011, the music video for Ed Sheeran’s Lego House, featuring Harry Potter’s Rupert Grint, was filmed in Hatfield. Filming took place at The Forum venue, located on University of Hertfordshire, College Lane campus. Filming of the video took place during Sheeran’s performance at the venue on 8 October 2011. Many students were involved during filming, as they made up most of the audience at the Forum that day.Logan, Ross. 2016. \"Ed Sheeran And Rupert Grint Shoot Lego House Video At Forum Hertfordshire In Hatfield\". Welwyn Hatfield Times. http://www.whtimes.co.uk/news/ed_sheeran_and_rupert_grint_shoot_lego_house_video_at_forum_hertfordshire_in_hatfield_1_1117402.\n*Mill Green Museum and watermill.\n*Art and Design Gallery (contemporary art gallery) University of Hertfordshire.\n*The Weston Auditorium (theatre and cinema) University of Hertfordshire.\n*The Galleria. [http://thegalleria.co.uk/ The Galleria]\n*Hatfield Business Park, former de Haviland plant, later Base Systems Hatfield, used as a location for Saving Private Ryan (film) and Band of Brothers (TV series).\n\nTransport\n\nHatfield is 20 mi to the north of London. It is 14 mi from London Luton Airport and also near Stansted airport. The A1(M) runs through the town, which is also close to the M25.\n\nThe East Coast railway line from London to York runs through the town, separating the old and new parts. A commuter service connects Hatfield railway station to London King's Cross. A new railway station and car park opened in late 2015. The frequent train service runs directly from Hatfield Station to London King's Cross via Finsbury Park (Victoria Underground Line), taking about 16 minutes to Finsbury Park and 21 minutes to London King's Cross on the fast trains, which run two to three times an hour. An additional train service calls at all stations to Moorgate in the City of London.\n\nThere was a fatal rail crash at Hatfield in 2000, which brought track maintenance deficiencies to public attention. A garden beside the East Coast Main Line was built as a memorial to the crash victims.\n\nNotable residents\n\nBusiness\n\n*Michael Birch (born 1970), founder of the social network BEBO, lived in Hatfield.\n*Sir Geoffrey de Havilland (1882–1965), founder of De Havilland Aircraft Company\n*Jack Olding (Henry John Douglas Olding, fl. mid-20th c.), wartime tank and tractor importer, came from Hatfield.\n\nMusic and dance\n\n*Babe Ruth, a 1970s rock band, came from Hatfield.[http://www.discogs.com/artist/Babe+Ruth Discogs Babe Ruth]; [http://www.bobbyshred.com/baberuth.html Bobby Shred's Babe Ruth Tribute Page.] \n*Colin Blunstone (born 1945) of The Zombies lived in Hatfield.\n*Martin Carthy (born 1941), folk musician, was born in Hatfield.\n*Sandra Conley (born 1943), principal dancer with the Royal Ballet.\n*Barbara Gaskin (born 1950), pop singer, No.1 with It's My Party\n*Alan Shacklock (born 1950), pop musician and record producer, lived in Hatfield.\n*Sal Solo (Christopher Scott Stevens, born 1961), rock singer, was born in Hatfield.\n*Mick Taylor (born 1949), Rolling Stones guitarist 1969–1974, grew up in Hatfield.\n*Tracey Thorn (born 1962), lead singer of Everything But The Girl, was born in Hatfield and attended Bishops Hatfield Girls School.\n\nPolitics, nobility and royalty\n\n*Robert Cecil, 1st Earl of Salisbury (c. 1563–1612), statesman\n*Robert Cecil, 3rd Marquess of Salisbury (1830–1903), Conservative politician, lived at Hatfield House and was buried at St Etheldreda Church.\n*Robert Gascoyne-Cecil, 5th Marquess of Salisbury (1893–1972), Conservative politician\n*William Lamb, 2nd Viscount Melbourne (1779–1848), prime minister, was buried at St Etheldreda Church.\n*George Stephen, 1st Baron Mount Stephen (1829–1921) lived at Brocket Hall.\n*Henry John Temple, 3rd Viscount Palmerston (1784–1865), prime minister\n*Elizabeth Tudor, later Queen Elizabeth I (1533–1603), lived at Hatfield House (Hatfield Old Palace).\n*Malcolm Wicks (1947–2012), Labour Party politician and Minister for Energy, was born in Hatfield.\n\nReligion\n\n*Walter Curle (1575–1647), Bishop of Winchester and a close supporter of William Laud, was born in Hatfield.\n*John Morton (c. 1420–1500), Cardinal and Bishop of Ely, built Hatfield Old Palace.\n\nScience and scholarship\n\n*L. H. Sumanadasa (born 1910), aviator and university founder, learned to fly at Hatfield.\n*John Tradescant the elder (c. 1570s–1638), botanist, gardener and naturalist, was head gardener at Hatfield House.\n\nSports\n\n*Samir Carruthers (born 1993), Sheffield United footballer, is from Hatfield.\n*Matthew Connolly (born 1987), QPR defender, lived and attended primary school in Hatfield.\n*Iain Dowie (born 1965), West Ham player, QPR manager & BBC pundit, was born and raised in Hatfield and studied mechanical engineering at the University of Hertfordshire.\n*Valentine Faithfull (1820–1894), first-class cricketer and clergyman, was born in Hatfield.\n*Rodney Marsh (born 1944), QPR footballer, is from Hatfield.\n*Francis Pember (1862–1954), first-class cricketer, was born in Hatfield.\n*Billy Joe Saunders (born 1989), WBO middleweight world champion boxer\n\nStage, media and film\n\n*Sanjeev Bhaskar (born 1963), comedian and broadcaster, lived in Hatfield whilst studying at the University of Hertfordshire.\n*John Cazabon (1914–1983), actor on stage, screen and radio, was born in Hatfield.\n*Pippa Haywood (born 1961), television, stage and radio actress, was born in Hatfield.\n*Diane-Louise Jordan (born 1960), television presenter, grew up in Hatfield.\n*David Kossoff (1919–2005), broadcaster and father of Paul Kossoff of the 1960s rock band Free, lived in Hatfield.\n*Derek Martin (born 1933), actor known especially for role of Charlie Slater in EastEnders\n*Gerry Northam (born 1947), radio presenter and  investigative journalist, was born in Hatfield.\n*Guy Ritchie (born 1968), film director famous for Snatch and Lock, Stock and Two Smoking Barrels, was born in Hatfield.\n\nWriting\n\n*Moniza Alvi (born 1954), poet and writer, grew up in Hatfield.\n*Barbara Cartland (1901–2000), author of romances, lived in Hatfield.\n*Geoffrey Drage (1860–1955), non-fiction writer and politician, was born in Hatfield.\n*Nathaniel Lee (c. 1653–1692), poet and playwright, was born in Hatfield, where his father was rector.\n\nNearby towns and villages\n\n*Bell Bar\n*Borehamwood\n*Brookmans Park\n*Colney Heath\n*Hertford\n*Lemsford, a village within Hatfield civil parish\n*Letty Green\n*London Colney\n*Newgate Street, a village within Hatfield civil parish\n*Potters Bar\n*St Albans\n*Stevenage\n*Watford\n*Welham Green\n*Welwyn Garden City. Hatfield, Hertfordshire. http://en.wikipedia.org/?curid=13985."
  }
}
