{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18602",
  "eid" : "33d4a3b0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778596203,
  "textBody" : "Leslie Conway \"Lester\" Bangs (December 14, 1948 – April 30, 1982) was an American music journalist, critic, author, and musician. He wrote for Creem and Rolling Stone magazines and was known for his leading influence in rock music criticism;[http://www.randomhouse.com/author/results.pperl?authorid1315 Lester Bangs]. Random House. Retrieved on November 4, 2007.Lindberg, Ulf; Gudmundsson, Gestur; Michelsen, Morten; Weisethaunet, Hans (2005). [https://books.google.com/books?id\n8HAYAQAAIAAJ&q%22Lester+Bangs%22+dead+OR+died+OR+death&dq\n%22Lester+Bangs%22+dead+OR+died+OR+death&lr&cd\n23 Rock Criticism from the Beginning: Amusers, Bruisers, and Cool-Headed Cruisers]. Ed. Ulf Lindberg. Peter Lang, International Academic Publishers. p. 176. , . The music critic Jim DeRogatis called him \"America's greatest rock critic\".\n\nBiography \n\nEarly life\n\nBangs was born in Escondido, California. He was the son of Norma Belle (née Clifton) and Conway Leslie Bangs, a truck driver. Both of his parents were from Texas: his father from Enloe and his mother from Pecos County. Norma Belle was a devout Jehovah's Witness. Conway died in a fire when his son was young. When Bangs was 11, he moved with his mother to El Cajon, also in San Diego County. His interests and influences growing up were as wide-ranging as the Beats (particularly William S. Burroughs), jazz musicians like John Coltrane and Miles Davis, comic books, and science fiction.  He had a connection with the San Diego Door, an underground newspaper of the late 1960s.\n\nRolling Stone magazine\n\nIn 1969 Bangs became a freelance writer after reading an ad in Rolling Stone soliciting readers' reviews. His first piece was a negative review of the MC5 album Kick Out the Jams, which he sent to Rolling Stone with a note requesting that if the magazine were to decline to publish the review, he would be given a reason for the decision; no reply was forthcoming, as the magazine did indeed publish the review.\n\nHis 1970 review of Black Sabbath's first album in Rolling Stone was scathing, rating them as imitators of the band Cream: \n\nBangs wrote about the death of Janis Joplin in 1970 from a drug overdose: \"It's not just that this kind of early death has become a fact of life that has become disturbing, but that it's been accepted as a given so quickly.\".\n\nIn 1973, Jann Wenner fired Bangs from Rolling Stone for \"disrespecting musicians\" after a particularly harsh review of the group Canned Heat.DeRogatis, Jim. [https://books.google.com/books?idM1t_5_loZysC&pg\nPA317&dq%22Lester+Bangs%22+dead+OR+died+OR+death&cd\n8#vonepage&q\ncanned%20heat&f=false Let It Blurt. p. 95].\n\nCream magazine \n\nBangs began freelancing for Detroit-based Cream in 1970.Bustillos, Maria. [http://www.newyorker.com/books/page-turner/lester-bangs-truth-teller \"Lester Bangs: Truth-teller,\"] The New Yorker (Aug. 21, 2012). In 1971, he wrote a feature for Creem on Alice Cooper, and soon afterward he moved to the Motor City. Named Creem's editor in 1971,Harrington, Joe (2002). Sonic Cool: The Life & Death of Rock 'n' Roll (1st ed.). Milwaukee, Wisconsin: Hal Leonard. p. 226. . Bangs fell in love with Detroit, calling it \"rock's only hope,\" and remained there for five years.Holdship, Bill (January 16, 2008). [http://www2.metrotimes.com/editorial/story.asp?id\n12383 \"Sour Creem: The Life, Death and Strange Resurrection of America's Only Rock 'n' Roll Magazine\".] Metro Times (Detroit, Michigan). Retrieved 3 January 2013.\n\nDuring the early 1970s, Bangs and some other writers at Creem began using the term punk rock to designate the genre of 60s garage bands and more contemporary acts, such as MC5 and Iggy and the Stooges.Bangs, Lester (2003). Psychotic Reactions and Carburetor Dung. Anchor Books. pp. 8, 56, 57, 61, 64, 101 (reprints of articles originally published in 1971 and 1972 and referring to garage bands such as the Count Five and the Troggs as \"punk\");  p. 101 (associating Iggy and Jonathan Richman of the Modern Lovers with the Troggs and their ilk as \"punk\"); pp. 112–113 (describing the Guess Who as \"punk\"—the Guess Who had made recordings as a garage rock outfit in the mid 60s, such as their hit version of \"Shakin' All Over\" in 1965); p. 8 (general statement about \"punk rock\" (garage) as a genre: \"then punk bands started cropping up who were writing their own songs but taking the Yardbirds' sound and reducing it to this kind of goony fuzztone clatter  ... oh, it was beautiful, it was pure folklore, Old America, and sometimes I think those were the best days ever)\"; p. 225 (reprint from an article originally published in the late 70s refers to garage bands as \"punk\"Marsh, D. Creem. May 1971 (review of live show by ? & the Mysterians Marsh describing their style as \"a landmark exposition of punk rock.\").  Their writings would provide some of the conceptual framework for the later punk and new wave movements that emerged in New York, London, and elsewhere later in the decade.Punk: The Whole Story. ed. M. Blake. 2006 Mojo Magazine, 2006. In the opening article, \"Punk Rock Year Zero,\" the writer and former member of early Sex Pistols lineup Nick Kent discusses the influence of Lester Bangs on punk concept and aesthetic.Gray, M. (2004). The Clash: Return of the Last Gang in Town. Hal Leonard. p. 27 - Grey discusses how in the early 70s, while his mother was living overseas (in Detroit), she would send Mick Jones (later of the Clash) copies of Creem magazine and how writings by Bangs and others using the term punk rock influenced him. They would be quick to pick up on these new movements at their inception and provide extensive coverage of the phenomenon. Bangs was enamored of the noise music of Lou Reed,Gere, Charlie. (2005). Art, Time and Technology: Histories of the Disappearing Body. Berg. p. 110. and Creem gave significant exposure to artists such as Reed, David Bowie, Roxy Music, Captain Beefheart, Blondie, Brian Eno, and the New York Dolls years before the mainstream press. Bangs wrote the essay/interview \"Let Us Now Praise Famous Death Dwarves\" about Reed in 1975. Creem was also among the earliest publications to give sizable coverage to hard rock and metal artists, such as Motörhead, Kiss, Judas Priest, and Van Halen.\n\nFreelance career \n\nAfter leaving Creem in 1976, he wrote for The Village Voice, Penthouse, Playboy, New Musical Express, and many other publications.\n\nWriting in Stereo Review, Bangs described the album Funky Kingston, by Toots and the Maytals, as “perfection, the most exciting and diversified set of reggae tunes by a single artist yet released.”\n\nDeath\n\nBangs died in New York City on April 30, 1982, at the age of 33, of an accidental overdose of dextropropoxyphene (cough medicine), diazepam (Valium), and NyQuil.Wallace, Amy; Manitoba, Handsome Dick. [https://books.google.com/books?id\nHFKSxVpoPbMC&pgPA56&dq\n%22Lester+Bangs%22+dead+OR+died+OR+death&lr&cd\n32#vonepage&q\n%22Lester%20Bangs%22%20dead%20OR%20died%20OR%20death&f=false The Official Punk Rock Book of Lists]. Hal Leonard. p. 56.\n\nWriting style\n\nBangs's criticism was filled with cultural references, not only to rock music but also to literature and philosophy. He was known for his radical and critical style of working, apparent in this quotation:\n\nOn one occasion, while the J. Geils Band was playing in concert, Bangs climbed onto the stage, typewriter in hand, and typed a supposed review of the event, in full view of the audience.\n\nMusic\n\nBangs was also a musician in his own right. In 1976, he and Peter Laughner recorded an acoustic improvisation in the Creem office. The recording included covers/parodies of songs like \"Sister Ray\" and \"Pale Blue Eyes\", both by the Velvet Underground.\n\nIn 1977, Lester recorded, as a solo artist, a 7\" vinyl single named \"Let It Blurt/Live\", mixed by John Cale and released in 1979.\n\nIn 1977, at the famous New York City nightclub, CBGB's, while Lester was talking to guitarist Mickey Leigh, Joey Ramone's brother, the idea for a band named \"Birdland\" came to fruition. Although they both had their roots in jazz, the two wanted to create an old school rock & roll group. Leigh brought in his post-punk band, The Rattlers (David Merrill on bass; Matty Quick on drums), and cut \"Birdland with Lester Bangs\". The recording took place at the under renovation Electric Lady Studios. Bassist David Merrill, who was working on the construction of the studio, had the keys to the building and they snuck the band in on April Fool’s Day, 1979 for an impromptu and somewhat illegal late night recording session. The end result was a completely uncut and un-dubbed recording that displayed completely raw music. Birdland broke up within two months of this rare recording (in which the cassette tape from the session became the master, mixed by Ed Stasium and released by Leigh only in 1986).\n\nIn 1980 Lester Bangs traveled to Austin, Texas, and met a surf/punk rock group \"The Delinquents\". In early December of the same year, they recorded an album as \"Lester Bangs and the Delinquents\", entitled Jook Savages on the Brazos, released the following year.\n\nIn 1990 the Mekons released the EP F.U.N. 90 with Bangs' declamation in the song \"One Horse Town\".\n\nIn popular culture\n\nMusic \n\n* Bangs is mentioned (\"Hangin' out with Lester Bangs you all\") in the Ramones song \"It's Not My Place (In the 9 to 5 World)\" on the 1981 album Pleasant Dreams.\n* Bangs is mentioned in the 1987 R.E.M. song \"It's the End of the World as We Know It (And I Feel Fine)\", along with Lenny Bruce, Leonid Brezhnev, and Leonard Bernstein, all of whom share the initials 'LB'.\n* Bangs is the subject of the song by Scott B. Sympathy \"Lester Bangs Stereo Ghost\" on the 1992 album Drinking With The Poet\n* Bangs is mentioned (\"They kept alive the great casino sound, for Leslie Conway Bangs\") in the Tullycraft song \"If You Take Away the Make-Up (Then the Vampires They Will Die)\" on the 2007 album Every Scene Needs a Center.\n* Bangs is mentioned (\"The only thing I want to save is the image on your face when I show up at your prom with ghost of Lester Bangs; they yell for 'rock'!\") in the Dillinger Four song \"Our Science Is Tight\".\n\nWriting \n\n* Along with artist Dori Seda, Bangs is the subject of Bruce Sterling's 1989 alternate history short story, \"Dori Bangs\", in which the two meet and have a relationship.\n* In his 2012 biography of David Foster Wallace, D. T. Max writes, \"Wallace admired Bangs's exultant prose, which probably came closer to the way Wallace talked than any other writing.\"Every Love Story Is a Ghost Story (Little, Brown, 2012), p. 122. Wallace and his co-author Mark Costello dedicated their book Signifying Rappers to Bangs.\n\nFilm \n\n* Excerpts from an interview with Lester Bangs appeared in the last two episodes of Tony Palmer's seventeen-episode television documentary All You Need Is Love: The Story of Popular Music.\n* In the 2000 movie Almost Famous, directed by Cameron Crowe (himself a former writer for Rolling Stone), Bangs is portrayed by actor Philip Seymour Hoffman as a mentor to the film's protagonist William Miller. Hoffman himself had a drug-related death.\n* Bangs's formative years are the subject of a documentary, [http://www.grossmont.edu/english/lesterbangs/BFoR.html A Box Full of Rocks: The El Cajon Years of Lester Bangs] (director: Raul Sandelin), released in 2013.\n* Bangs is referenced in \"Ticket to Write: The Golden Age of Rock Music Journalism\" [https://www.tickettowritethem-ovie.com/] (director, Raul Sandelin; executive producer, Edward Turner), released in 2016.\n\nSelected works\n\nBy Lester Bangs\n\n* [https://www.rollingstone.com/music/albumreviews/kick-out-the-jams-19690405 Review] of The MC5's debut album, Kick Out The Jams  – Bangs' first piece for Rolling Stone\n*[https://news.google.com/newspapers?nid1299&dat\n19770829&id6vZNAAAAIBAJ&sjid\nOYsDAAAAIBAJ&pg=2945,3275749 \"Where Were You When Elvis Died?\"] Elvis Presley obituary. The Village Voice, August 29, 1977\n* [http://www.rocknroll.net/loureed/articles/mmmbangs.html \"The Greatest Album Ever Made\",] Creem magazine (1976) — about the 1975 Lou Reed album Metal Machine Music\n* [http://personal.cis.strath.ac.uk/%7Emurray/astral.html \"Stranded,\"] (1979) — about the 1968 album Astral Weeks, by Van Morrison\n* Blondie (Fireside Book, 1980)\n* Psychotic Reactions and Carburetor Dung: The Work of a Legendary Critic, collected writings, Greil Marcus, ed. Anchor Press, 1988. ()\n* Main Lines, Blood Feasts, and Bad Taste: A Lester Bangs Reader, collected writings, John Morthland, ed. Anchor Press, 2003. ()\n\nAbout Lester Bangs\n\n* Let it Blurt: The Life and Times of Lester Bangs, America's Greatest Rock Critic, biography, Jim Derogatis. Broadway Books, 2000. ().\n\nWorks citing Lester Bangs\n\n* Please Kill Me: The Uncensored Oral History of Punk, biography, Legs McNeil and Gillian McCain. Penguin Books, 1997. ().",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Lester Bangs" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18602" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Leslie Conway \"Lester\" Bangs (December 14, 1948 – April 30, 1982) was an American music journalist, critic, author, and musician. He wrote for Creem and Rolling Stone magazines and was known for his leading influence in rock music criticism;[http://www.randomhouse.com/author/results.pperl?authorid1315 Lester Bangs]. Random House. Retrieved on November 4, 2007.Lindberg, Ulf; Gudmundsson, Gestur; Michelsen, Morten; Weisethaunet, Hans (2005). [https://books.google.com/books?id\n8HAYAQAAIAAJ&q%22Lester+Bangs%22+dead+OR+died+OR+death&dq\n%22Lester+Bangs%22+dead+OR+died+OR+death&lr&cd\n23 Rock Criticism from the Beginning: Amusers, Bruisers, and Cool-Headed Cruisers]. Ed. Ulf Lindberg. Peter Lang, International Academic Publishers. p. 176. , . The music critic Jim DeRogatis called him \"America's greatest rock critic\".\n\nBiography \n\nEarly life\n\nBangs was born in Escondido, California. He was the son of Norma Belle (née Clifton) and Conway Leslie Bangs, a truck driver. Both of his parents were from Texas: his father from Enloe and his mother from Pecos County. Norma Belle was a devout Jehovah's Witness. Conway died in a fire when his son was young. When Bangs was 11, he moved with his mother to El Cajon, also in San Diego County. His interests and influences growing up were as wide-ranging as the Beats (particularly William S. Burroughs), jazz musicians like John Coltrane and Miles Davis, comic books, and science fiction.  He had a connection with the San Diego Door, an underground newspaper of the late 1960s.\n\nRolling Stone magazine\n\nIn 1969 Bangs became a freelance writer after reading an ad in Rolling Stone soliciting readers' reviews. His first piece was a negative review of the MC5 album Kick Out the Jams, which he sent to Rolling Stone with a note requesting that if the magazine were to decline to publish the review, he would be given a reason for the decision; no reply was forthcoming, as the magazine did indeed publish the review.\n\nHis 1970 review of Black Sabbath's first album in Rolling Stone was scathing, rating them as imitators of the band Cream: \n\nBangs wrote about the death of Janis Joplin in 1970 from a drug overdose: \"It's not just that this kind of early death has become a fact of life that has become disturbing, but that it's been accepted as a given so quickly.\".\n\nIn 1973, Jann Wenner fired Bangs from Rolling Stone for \"disrespecting musicians\" after a particularly harsh review of the group Canned Heat.DeRogatis, Jim. [https://books.google.com/books?idM1t_5_loZysC&pg\nPA317&dq%22Lester+Bangs%22+dead+OR+died+OR+death&cd\n8#vonepage&q\ncanned%20heat&f=false Let It Blurt. p. 95].\n\nCream magazine \n\nBangs began freelancing for Detroit-based Cream in 1970.Bustillos, Maria. [http://www.newyorker.com/books/page-turner/lester-bangs-truth-teller \"Lester Bangs: Truth-teller,\"] The New Yorker (Aug. 21, 2012). In 1971, he wrote a feature for Creem on Alice Cooper, and soon afterward he moved to the Motor City. Named Creem's editor in 1971,Harrington, Joe (2002). Sonic Cool: The Life & Death of Rock 'n' Roll (1st ed.). Milwaukee, Wisconsin: Hal Leonard. p. 226. . Bangs fell in love with Detroit, calling it \"rock's only hope,\" and remained there for five years.Holdship, Bill (January 16, 2008). [http://www2.metrotimes.com/editorial/story.asp?id\n12383 \"Sour Creem: The Life, Death and Strange Resurrection of America's Only Rock 'n' Roll Magazine\".] Metro Times (Detroit, Michigan). Retrieved 3 January 2013.\n\nDuring the early 1970s, Bangs and some other writers at Creem began using the term punk rock to designate the genre of 60s garage bands and more contemporary acts, such as MC5 and Iggy and the Stooges.Bangs, Lester (2003). Psychotic Reactions and Carburetor Dung. Anchor Books. pp. 8, 56, 57, 61, 64, 101 (reprints of articles originally published in 1971 and 1972 and referring to garage bands such as the Count Five and the Troggs as \"punk\");  p. 101 (associating Iggy and Jonathan Richman of the Modern Lovers with the Troggs and their ilk as \"punk\"); pp. 112–113 (describing the Guess Who as \"punk\"—the Guess Who had made recordings as a garage rock outfit in the mid 60s, such as their hit version of \"Shakin' All Over\" in 1965); p. 8 (general statement about \"punk rock\" (garage) as a genre: \"then punk bands started cropping up who were writing their own songs but taking the Yardbirds' sound and reducing it to this kind of goony fuzztone clatter  ... oh, it was beautiful, it was pure folklore, Old America, and sometimes I think those were the best days ever)\"; p. 225 (reprint from an article originally published in the late 70s refers to garage bands as \"punk\"Marsh, D. Creem. May 1971 (review of live show by ? & the Mysterians Marsh describing their style as \"a landmark exposition of punk rock.\").  Their writings would provide some of the conceptual framework for the later punk and new wave movements that emerged in New York, London, and elsewhere later in the decade.Punk: The Whole Story. ed. M. Blake. 2006 Mojo Magazine, 2006. In the opening article, \"Punk Rock Year Zero,\" the writer and former member of early Sex Pistols lineup Nick Kent discusses the influence of Lester Bangs on punk concept and aesthetic.Gray, M. (2004). The Clash: Return of the Last Gang in Town. Hal Leonard. p. 27 - Grey discusses how in the early 70s, while his mother was living overseas (in Detroit), she would send Mick Jones (later of the Clash) copies of Creem magazine and how writings by Bangs and others using the term punk rock influenced him. They would be quick to pick up on these new movements at their inception and provide extensive coverage of the phenomenon. Bangs was enamored of the noise music of Lou Reed,Gere, Charlie. (2005). Art, Time and Technology: Histories of the Disappearing Body. Berg. p. 110. and Creem gave significant exposure to artists such as Reed, David Bowie, Roxy Music, Captain Beefheart, Blondie, Brian Eno, and the New York Dolls years before the mainstream press. Bangs wrote the essay/interview \"Let Us Now Praise Famous Death Dwarves\" about Reed in 1975. Creem was also among the earliest publications to give sizable coverage to hard rock and metal artists, such as Motörhead, Kiss, Judas Priest, and Van Halen.\n\nFreelance career \n\nAfter leaving Creem in 1976, he wrote for The Village Voice, Penthouse, Playboy, New Musical Express, and many other publications.\n\nWriting in Stereo Review, Bangs described the album Funky Kingston, by Toots and the Maytals, as “perfection, the most exciting and diversified set of reggae tunes by a single artist yet released.”\n\nDeath\n\nBangs died in New York City on April 30, 1982, at the age of 33, of an accidental overdose of dextropropoxyphene (cough medicine), diazepam (Valium), and NyQuil.Wallace, Amy; Manitoba, Handsome Dick. [https://books.google.com/books?id\nHFKSxVpoPbMC&pgPA56&dq\n%22Lester+Bangs%22+dead+OR+died+OR+death&lr&cd\n32#vonepage&q\n%22Lester%20Bangs%22%20dead%20OR%20died%20OR%20death&f=false The Official Punk Rock Book of Lists]. Hal Leonard. p. 56.\n\nWriting style\n\nBangs's criticism was filled with cultural references, not only to rock music but also to literature and philosophy. He was known for his radical and critical style of working, apparent in this quotation:\n\nOn one occasion, while the J. Geils Band was playing in concert, Bangs climbed onto the stage, typewriter in hand, and typed a supposed review of the event, in full view of the audience.\n\nMusic\n\nBangs was also a musician in his own right. In 1976, he and Peter Laughner recorded an acoustic improvisation in the Creem office. The recording included covers/parodies of songs like \"Sister Ray\" and \"Pale Blue Eyes\", both by the Velvet Underground.\n\nIn 1977, Lester recorded, as a solo artist, a 7\" vinyl single named \"Let It Blurt/Live\", mixed by John Cale and released in 1979.\n\nIn 1977, at the famous New York City nightclub, CBGB's, while Lester was talking to guitarist Mickey Leigh, Joey Ramone's brother, the idea for a band named \"Birdland\" came to fruition. Although they both had their roots in jazz, the two wanted to create an old school rock & roll group. Leigh brought in his post-punk band, The Rattlers (David Merrill on bass; Matty Quick on drums), and cut \"Birdland with Lester Bangs\". The recording took place at the under renovation Electric Lady Studios. Bassist David Merrill, who was working on the construction of the studio, had the keys to the building and they snuck the band in on April Fool’s Day, 1979 for an impromptu and somewhat illegal late night recording session. The end result was a completely uncut and un-dubbed recording that displayed completely raw music. Birdland broke up within two months of this rare recording (in which the cassette tape from the session became the master, mixed by Ed Stasium and released by Leigh only in 1986).\n\nIn 1980 Lester Bangs traveled to Austin, Texas, and met a surf/punk rock group \"The Delinquents\". In early December of the same year, they recorded an album as \"Lester Bangs and the Delinquents\", entitled Jook Savages on the Brazos, released the following year.\n\nIn 1990 the Mekons released the EP F.U.N. 90 with Bangs' declamation in the song \"One Horse Town\".\n\nIn popular culture\n\nMusic \n\n* Bangs is mentioned (\"Hangin' out with Lester Bangs you all\") in the Ramones song \"It's Not My Place (In the 9 to 5 World)\" on the 1981 album Pleasant Dreams.\n* Bangs is mentioned in the 1987 R.E.M. song \"It's the End of the World as We Know It (And I Feel Fine)\", along with Lenny Bruce, Leonid Brezhnev, and Leonard Bernstein, all of whom share the initials 'LB'.\n* Bangs is the subject of the song by Scott B. Sympathy \"Lester Bangs Stereo Ghost\" on the 1992 album Drinking With The Poet\n* Bangs is mentioned (\"They kept alive the great casino sound, for Leslie Conway Bangs\") in the Tullycraft song \"If You Take Away the Make-Up (Then the Vampires They Will Die)\" on the 2007 album Every Scene Needs a Center.\n* Bangs is mentioned (\"The only thing I want to save is the image on your face when I show up at your prom with ghost of Lester Bangs; they yell for 'rock'!\") in the Dillinger Four song \"Our Science Is Tight\".\n\nWriting \n\n* Along with artist Dori Seda, Bangs is the subject of Bruce Sterling's 1989 alternate history short story, \"Dori Bangs\", in which the two meet and have a relationship.\n* In his 2012 biography of David Foster Wallace, D. T. Max writes, \"Wallace admired Bangs's exultant prose, which probably came closer to the way Wallace talked than any other writing.\"Every Love Story Is a Ghost Story (Little, Brown, 2012), p. 122. Wallace and his co-author Mark Costello dedicated their book Signifying Rappers to Bangs.\n\nFilm \n\n* Excerpts from an interview with Lester Bangs appeared in the last two episodes of Tony Palmer's seventeen-episode television documentary All You Need Is Love: The Story of Popular Music.\n* In the 2000 movie Almost Famous, directed by Cameron Crowe (himself a former writer for Rolling Stone), Bangs is portrayed by actor Philip Seymour Hoffman as a mentor to the film's protagonist William Miller. Hoffman himself had a drug-related death.\n* Bangs's formative years are the subject of a documentary, [http://www.grossmont.edu/english/lesterbangs/BFoR.html A Box Full of Rocks: The El Cajon Years of Lester Bangs] (director: Raul Sandelin), released in 2013.\n* Bangs is referenced in \"Ticket to Write: The Golden Age of Rock Music Journalism\" [https://www.tickettowritethem-ovie.com/] (director, Raul Sandelin; executive producer, Edward Turner), released in 2016.\n\nSelected works\n\nBy Lester Bangs\n\n* [https://www.rollingstone.com/music/albumreviews/kick-out-the-jams-19690405 Review] of The MC5's debut album, Kick Out The Jams  – Bangs' first piece for Rolling Stone\n*[https://news.google.com/newspapers?nid1299&dat\n19770829&id6vZNAAAAIBAJ&sjid\nOYsDAAAAIBAJ&pg=2945,3275749 \"Where Were You When Elvis Died?\"] Elvis Presley obituary. The Village Voice, August 29, 1977\n* [http://www.rocknroll.net/loureed/articles/mmmbangs.html \"The Greatest Album Ever Made\",] Creem magazine (1976) — about the 1975 Lou Reed album Metal Machine Music\n* [http://personal.cis.strath.ac.uk/%7Emurray/astral.html \"Stranded,\"] (1979) — about the 1968 album Astral Weeks, by Van Morrison\n* Blondie (Fireside Book, 1980)\n* Psychotic Reactions and Carburetor Dung: The Work of a Legendary Critic, collected writings, Greil Marcus, ed. Anchor Press, 1988. ()\n* Main Lines, Blood Feasts, and Bad Taste: A Lester Bangs Reader, collected writings, John Morthland, ed. Anchor Press, 2003. ()\n\nAbout Lester Bangs\n\n* Let it Blurt: The Life and Times of Lester Bangs, America's Greatest Rock Critic, biography, Jim Derogatis. Broadway Books, 2000. ().\n\nWorks citing Lester Bangs\n\n* Please Kill Me: The Uncensored Oral History of Punk, biography, Legs McNeil and Gillian McCain. Penguin Books, 1997. (). Lester Bangs. http://en.wikipedia.org/?curid=18602."
  }
}
