{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4078",
  "eid" : "cb35a660-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778420678,
  "textBody" : "The National Baseball Hall of Fame and Museum is an American history museum and hall of fame, located in Cooperstown, New York, and operated by private interests. It serves as the central point for the study of the history of baseball in the United States and beyond, displays baseball-related artifacts and exhibits, and honors those who have excelled in playing, managing, and serving the sport. The Hall's motto is \"Preserving History, Honoring Excellence, Connecting Generations.\"\n\nThe word Cooperstown is often used as shorthand (or a metonym) for the National Baseball Hall of Fame and Museum.\n\nThe Hall of Fame was established in 1939 by Stephen Carlton Clark, the owner of a local hotel. Clark had sought to bring tourists to a city hurt by the Great Depression, which reduced the local tourist trade, and Prohibition, which devastated the local hops industry. A new building was constructed, and the Hall of Fame was dedicated on June 12, 1939. (Clark's granddaughter, Jane Forbes Clark, is the current chairman of the Board of Directors.)\n\nThe erroneous claim that Civil War hero Abner Doubleday invented baseball in Cooperstown was instrumental in the early marketing of the Hall.\n\nAn expanded library and research facility opened in 1994. Dale Petroskey became the organization's president in 1999.[http://mlb.mlb.com/news/article.jsp?ymd20080325&content_id\n2458145&vkeynews_mlb&fext\n.jsp&c_id=mlb The Official Site of Major League Baseball: News: HOF president Petroskey resigns] from the Major League Baseball website\n\nIn 2002, the Hall launched Baseball As America, a traveling exhibit that toured ten American museums over six years. The Hall of Fame has since also sponsored educational programming on the Internet to bring the Hall of Fame to schoolchildren who might not visit. The Hall and Museum completed a series of renovations in spring 2005. The Hall of Fame also presents an annual exhibit at FanFest at the Major League Baseball All-Star Game.\n\nJeff Idelson replaced Petroskey as president on April 16, 2008. He had been acting as president since March 25, 2008, when Petroskey was forced to resign for having \"failed to exercise proper fiduciary responsibility\" and making \"judgments that were not in the best interest of the National Baseball Hall of Fame and Museum.\"\n\nIn 2012, Congress passed and President Barack Obama signed a law ordering the United States Mint to produce and sell commemorative, non-circulating coins to benefit the private, non-profit Hall. The bill, , was introduced in the United States House of Representatives by Rep. Richard Hanna, a Republican from New York, and passed the House on October 26, 2011. The coins, which depict baseball gloves and balls, are the first concave designs produced by the Mint. The mintage included 50,000 gold coins, 400,000 silver coins, and 750,000 clad (Nickel-Copper) coins. The Mint released them on March 27, 2014, and the gold and silver editions quickly sold out. The Hall receives money from surcharges included in the sale price: a total of $9.5 million if all the coins are sold.\n\nInductees\n\nAmong baseball fans, \"Hall of Fame\" means not only the museum and facility in Cooperstown, New York, but the pantheon of players, managers, umpires, executives, and pioneers who have been enshrined in the Hall. The first five men elected were Ty Cobb, Babe Ruth, Honus Wagner, Christy Mathewson and Walter Johnson, chosen in 1936; roughly 20 more were selected before the entire group was inducted at the Hall's 1939 opening. , 323 people had been elected to the Hall of Fame, including 226 former Major League Baseball players, 35 Negro league baseball players and executives, 22 managers, 10 umpires, and 30 pioneers, executives, and organizers. 114 members of the Hall of Fame have been inducted posthumously, including four who died after their selection was announced. Of the 35 Negro league members, 29 were inducted posthumously, including all 24 selected since the 1990s. The Hall of Fame includes one female member, Effa Manley.[http://baseballhall.org/news/personality/woman-bronze Woman in Bronze]\n\nThe newest members elected on January 24, 2018, are players Chipper Jones, Jim Thome, Vladimir Guerrero, and Trevor Hoffman. They will be officially inducted on July 29, 2018, alongside players Jack Morris and Alan Trammell.\n\nSelection process\n\nPlayers are currently inducted into the Hall of Fame through election by either the Baseball Writers' Association of America (or BBWAA), or the Veterans Committee,Following changes to the voting procedure in 2010, the official name is \"Committee to Consider Managers, Umpires, Executives and Long-Retired Players\". The term \"Veterans Committee\" comes from the former official name of \"Committee on Baseball Veterans\". Although the Hall no longer uses \"Veterans Committee\", that term is still widely used by baseball media. which now consists of four subcommittees, each of which considers and votes for candidates from a separate era of baseball. Five years after retirement, any player with 10 years of major league experience who passes a screening committee (which removes from consideration players of clearly lesser qualification) is eligible to be elected by BBWAA members with 10 years' membership or more who also have been actively covering MLB at any time in the 10 years preceding the election (the latter requirement was added for the 2016 election). From a final ballot typically including 25–40 candidates, each writer may vote for up to 10 players; until the late 1950s, voters were advised to cast votes for the maximum 10 candidates. Any player named on 75% or more of all ballots cast is elected. A player who is named on fewer than 5% of ballots is dropped from future elections. In some instances, the screening committee had restored their names to later ballots, but in the mid-1990s, dropped players were made permanently ineligible for Hall of Fame consideration, even by the Veterans Committee. A 2001 change in the election procedures restored the eligibility of these dropped players; while their names will not appear on future BBWAA ballots, they may be considered by the Veterans Committee. Players receiving 5% or more of the votes but fewer than 75% are reconsidered annually until a maximum of ten years of eligibility (lowered from fifteen years for the 2015 election).\n\nUnder special circumstances, certain players may be deemed eligible for induction even though they have not met all requirements. Addie Joss was elected in 1978, despite only playing nine seasons before he died of meningitis. Additionally, if an otherwise eligible player dies before his fifth year of retirement, then that player may be placed on the ballot at the first election at least six months after his death. Roberto Clemente's induction in 1973 set the precedent when the writers chose to put him up for consideration after his death on New Year's Eve, 1972.\n\nThe five-year waiting period was established in 1954 after an evolutionary process. In 1936 all players were eligible, including active ones. From the 1937 election until the 1945 election, there was no waiting period, so any retired player was eligible, but writers were discouraged from voting for current major leaguers. Since there was no formal rule preventing a writer from casting a ballot for an active player, the scribes did not always comply with the informal guideline; Joe DiMaggio received a vote in 1945, for example. From the 1946 election until the 1954 election, an official one-year waiting period was in effect. (DiMaggio, for example, retired after the 1951 season and was first eligible in the 1953 election.) The modern rule establishing a wait of five years was passed in 1954, although an exception was made for Joe DiMaggio because of his high level of previous support, thus permitting him to be elected within four years of his retirement.\n\nContrary to popular belief, no formal exception was made for Lou Gehrig (other than to hold a special one-man election for him): there was no waiting period at that time, and Gehrig met all other qualifications, so he would have been eligible for the next regular election after he retired during the 1939 season. However, the BBWAA decided to hold a special election at the 1939 Winter Meetings in Cincinnati, specifically to elect Gehrig (most likely because it was known that he was terminally ill, making it uncertain that he would live long enough to see another election). Nobody else was on that ballot, and the numerical results have never been made public. Since no elections were held in 1940 or 1941, the special election permitted Gehrig to enter the Hall while still alive.\n\nIf a player fails to be elected by the BBWAA within 10 years of his retirement from active play, he may be selected by the Veterans Committee. Following changes to the election process for that body made in 2010 and 2016, it is now responsible for electing all otherwise eligible candidates who are not eligible for the BBWAA ballot—both long-retired players and non-playing personnel (managers, umpires, and executives). From 2011 through 2016, each candidate could be considered once every three years;  now, the frequency depends on the era in which an individual made his greatest contributions. A more complete discussion of the new process is available below.\n\nFrom 2008 to 2010, following changes made by the Hall in July 2007, the main Veterans Committee, then made up of living Hall of Famers, voted only on players whose careers began in 1943 or later. These changes also established three separate committees to select other figures:\n* One committee voted on managers and umpires for induction in every even-numbered year. This committee voted only twice— in 2007 for induction in 2008 and in 2009 for induction in 2010.\n* One committee voted on executives and builders for induction in every even-numbered year. This committee conducted its only two votes in the same years as the managers/umpires committee.\n* The pre–World War II players committee was intended to vote every five years on players whose careers began in 1942 or earlier. It conducted its only vote as part of the election process for induction in 2009.\n\nPlayers of the Negro Leagues have also been considered at various times, beginning in 1971. In 2005 the Hall completed a study on African American players between the late 19th century and the integration of the major leagues in 1947, and conducted a special election for such players in February 2006; seventeen figures from the Negro Leagues were chosen in that election, in addition to the eighteen previously selected. Following the 2010 changes, Negro Leagues figures were primarily considered for induction alongside other figures from the 1871–1946 era, called the \"Pre-Integration Era\" by the Hall; since 2016, Negro Leagues figures are primarily considered alongside other figures from what the Hall calls the \"Early Baseball\" era (1871–1949).\n\nPredictably, the selection process catalyzes endless debate among baseball fans over the merits of various candidates. Even players elected years ago remain the subjects of discussions as to whether they deserved election. For example, Bill James' book Whatever Happened to the Hall of Fame? goes into detail about who he believes does and does not belong in the Hall of Fame.\n\nChanges to Veterans Committee process\n\nThe actions and composition of the Veterans Committee have been at times controversial, with occasional selections of contemporaries and teammates of the committee members over seemingly more worthy candidates.\n\nIn 2001, the Veterans Committee was reformed to comprise the living Hall of Fame members and other honorees. The revamped Committee held three election, in 2003 and 2007, for both players and non-players, and in 2005 for players only. No individual was elected in that time, sparking criticism among some observers who expressed doubt whether the new Veterans Committee would ever elect a player. The Committee members, most of whom were Hall members, were accused of being reluctant to elect new candidates in the hope of heightening the value of their own selection. After no one was selected for the third consecutive election in 2007, Hall of Famer Mike Schmidt noted, \"The same thing happens every year. The current members want to preserve the prestige as much as possible, and are unwilling to open the doors.\" In 2007, the committee and its selection processes were again reorganized; the main committee then included all living members of the Hall, and voted on a reduced number of candidates from among players whose careers began in 1943 or later. Separate committees, including sportswriters and broadcasters, would select umpires, managers and executives, as well as players from earlier eras.\n\nIn the first election to be held under the 2007 revisions, two managers and three executives were elected in December 2007 as part of the 2008 election process. The next Veterans Committee elections for players were held in December 2008 as part of the 2009 election process; the main committee did not select a player, while the panel for pre–World War II players elected Joe Gordon in its first and ultimately only vote. The main committee voted as part of the election process for inductions in odd-numbered years, while the pre-World War II panel would vote every five years, and the panel for umpires, managers, and executives voted as part of the election process for inductions in even-numbered years.\n\nFurther changes to the Veterans Committee process were announced by the Hall on July 26, 2010, effective with the 2011 election.\n\nAll individuals eligible for induction but not eligible for BBWAA consideration were considered on a single ballot, grouped by the following eras in which they made their greatest contributions:\n* Pre-Integration Era (1871–1946)\n* Golden Era (1947–1972)\n* Expansion Era (1973 and later)\n\nThe Hall used the BBWAA's Historical Overview Committee to formulate the ballots for each era, consisting of 12 individuals for the Expansion Era and 10 for the other eras. The Hall's board of directors selected a committee of 16 voters for each era, made up of Hall of Famers, executives, baseball historians, and media members. Each committee met and voted at the Baseball Winter Meetings once every three years. The Expansion Era committee held its first vote in 2010 for 2011 induction, with longtime general manager Pat Gillick becoming the first individual elected under the new procedure. The Golden Era committee voted in 2011 for the induction class of 2012, with Ron Santo becoming the first player elected under the new procedure. The Pre-Integration Era committee voted in 2012 for the induction class of 2013, electing three figures. Subsequent elections rotated among the three committees in that order through the 2016 election.\n\nIn July 2016, however, the Hall of Fame announced a restructuring of the timeframes to be considered, with a much greater emphasis on modern eras. Four new committees were established:\n* Today's Game (1988–present)\n* Modern Baseball (1970–1987)\n* Golden Days (1950–1969)\n* Early Baseball (1871–1949)\n\nAll committees' ballots now include 10 candidates. While there was previously a one-year waiting period after elimination from annual BBWAA consideration, there is now no waiting period. At least one committee convenes each December as part of the election process for the following calendar year's induction ceremony. The Early Baseball committee convenes only in years ending in 0 (2020, 2030). The Golden Days committee convenes only in years ending in 0 and 5 (2020, 2025). The remaining two committees convene twice every 5 years. More specifically, the Today's Game and Modern Baseball committees alternate their meetings in that order, skipping years in which either the Early Baseball or Golden Days committee meets. This means that in the next two 5-year cycles, the Today's Game committee (having met in 2016) will meet in 2018, 2021, and 2023, while the Modern Baseball committee (which met in 2017) will meet in 2019, 2022 and 2024. Additionally, the Hall of Fame has modified the criteria under which active executives can be considered for induction. All active executives age 70 or older may now have their careers reviewed as part of the Era Committee balloting process, regardless of the position they hold in an organization, and regardless of whether their body of work has been completed. Previously, active executives 65 years or older were eligible for consideration.\n\nPlayers and managers with multiple teams\n\nWhile the text on a player's or manager's plaque lists all teams for which the inductee was a member in that specific role, inductees are usually depicted wearing the cap of a specific team, though in a few cases, like umpires, they wear caps without logos. (Executives are not depicted wearing caps.) Additionally, as of 2015, inductee biographies on the Hall's website for all players and managers, and executives who were associated with specific teams, list a \"primary team\", which does not necessarily match the cap logo. The Hall selects the logo \"based on where that player makes his most indelible mark.\"\n\nAlthough the Hall always made the final decision on which logo was shown, until 2001 the Hall deferred to the wishes of players or managers whose careers were linked with multiple teams. Some examples of inductees associated with multiple teams are the following:\n*Frank Robinson: Robinson chose to have the Baltimore Orioles cap displayed on his plaque, although he had played ten seasons with the Cincinnati Reds and six seasons with Baltimore. Robinson won four pennants and two World Series with the Orioles and one pennant with Cincinnati. His second World Series ring came in the 1970 World Series against the Reds. Robinson also won an MVP award while playing for each team.\n*Catfish Hunter: Hunter chose not to have any logo on his cap when elected to the Hall of Fame in 1987. Hunter had success for both teams for which he played – the Kansas City/Oakland Athletics (his first ten seasons) and the New York Yankees (his final five seasons). Furthermore, both during and after his career he maintained good relations with both teams and their respective owners (Charles Finley and George Steinbrenner), and did not wish to slight either team by selecting the other.\n*Nolan Ryan: Born and raised in Texas, Ryan entered the Hall in 1999 wearing a Texas Rangers cap on his plaque, although he spent only five seasons with the Rangers, while raised in the Houston area and having longer and more successful tenures with the Houston Astros (nine seasons, 1980–88 and his record-setting fifth career no-hitter) and California Angels (eight seasons, 1972–79 and the first four of his seven career no-hitters). Ryan's only championship was as a member of the New York Mets in 1969. Ryan finished his career with the Rangers, reaching his 5000th strikeout and 300th win, and throwing the last two of his no-hitters. Ryan later took ownership of the Rangers when they were sold to his Rangers Baseball Express group in 2010. He sold his Rangers interest in 2013 and is now in the Astros' front office.\n*Reggie Jackson: Jackson chose to be depicted with a Yankees cap over an Athletics cap. As a member of the Kansas City/Oakland A's, Jackson played ten seasons (1967–75, '87), winning three World Series (1972, 1973, 1974) and the 1973 AL MVP Award. During his five years in New York (1977–81), Jackson won two World Series (1977–78), with his crowning achievement occurring during Game Six of the 1977 World Series, when he hit three home runs on consecutive pitches and earned his nickname \"Mr. October\".\n*Carlton Fisk: Fisk went into the hall with a Boston Red Sox cap on his plaque in 2000 despite playing with the Chicago White Sox longer and posting more significant numbers with the White Sox. Fisk's choice of the Red Sox was likely because of his being a New England native, as well as his famous \"Stay fair!\" walk-off home run in Game Six of the 1975 World Series with which he is most associated.\n*Sparky Anderson: Also in 2000, Anderson entered the Hall with a Cincinnati Reds cap on his plaque despite managing almost twice as many seasons with the Detroit Tigers (17 in Detroit; nine in Cincinnati). He chose the Reds to honor that team's former general manager Bob Howsam, who gave him his first major-league managing job. Anderson won two World Series with the Reds and one with the Tigers.\n*Dave Winfield: Winfield had spent the most years in his career with the Yankees and had great success there, but chose to go into the Hall as a member of the San Diego Padres due to his feud with Yankees owner George Steinbrenner.\n\nIn all of the above cases, the \"primary team\" is the team for which the inductee spent the largest portion of his career except for Ryan, whose primary team is listed as the Angels despite playing one fewer season for that team than for the Astros.\n\nIn 2001, the Hall of Fame decided to change the policy on cap logo selection, as a result of rumors that some teams were offering compensation, such as number retirement, money, or organizational jobs, in exchange for the cap designation. (For example, though Wade Boggs denied the claims, some media reports had said that his contract with the Tampa Bay Devil Rays required him to request depiction in the Hall of Fame as a Devil Ray.) The Hall decided that it would no longer defer to the inductee, though the player's wishes would be considered, when deciding on the logo to appear on the plaque. Newly elected members affected by the change include the following:\n*Gary Carter: Inducted in 2003, Carter was the first player to be affected by the new policy. Carter won his only championship with the 1986 New York Mets, and wanted his induction plaque to depict him wearing a Mets cap, though he had spent twelve years (1974–84, 1992) with the Montreal Expos and five (1985–89) with the Mets. The Hall of Fame decided that Carter's impact on the Montreal franchise warranted depicting him with an Expos cap.\n*Wade Boggs: Boggs's only championship was as a member of the 1996 New York Yankees, for whom he played from 1993–97, but his best career numbers were posted during his eleven years (1982–92) wearing the Boston Red Sox uniform. Boggs would eventually be depicted wearing a Boston cap for his 2005 induction.\n*Andre Dawson: Dawson's cap depicts him as a member of the Expos, his team for eleven years, despite his expressed preference to be shown as a member of the Chicago Cubs. While Dawson played only six years with the Cubs, five of his eight All-Star appearances were as a Cub, and his only MVP award came in his first year with the team in 1987.\n*Tony La Russa: Manager La Russa chose not to have a logo after managing three teams over 33 years—the Chicago White Sox, Oakland Athletics, and St. Louis Cardinals. His greatest successes were with the A's (three pennants and a World Series title in 10 years) and Cardinals (three pennants and two World Series in 16 years). Nonetheless, La Russa felt that his induction to the Hall was due to his tenures with all three teams, and stated that not including a logo meant that \"fans of all [three] clubs can celebrate this honor with me.\" La Russa's biography on the Hall's website lists his primary team as the Cardinals.\n*Greg Maddux: Although Maddux had his greatest success while with the Atlanta Braves for 11 seasons, he had two stints with the Chicago Cubs for a total of 10 seasons, including the first seven of his MLB career. Maddux believed that both fanbases were equally important in his career, and so the cap on his plaque does not feature any logo. His biography on the Hall's website lists his primary team as the Braves.\n*Randy Johnson: Johnson played for six teams in a 22-year career, but spent the bulk of it with the Seattle Mariners (10 seasons) and Arizona Diamondbacks (8 seasons). While enjoying great success with both teams, he had more significant honors with the Diamondbacks. Four of Johnson's five Cy Young Awards (consecutively from 1999 to 2002), his only championship (in 2001), his pitching triple crown (), and his perfect game () all came with the Diamondbacks. Accordingly, he and the Hall agreed his plaque should feature a Diamondbacks logo. His biography on the Hall's website lists his primary team as the Mariners.\n\nThe museum\n\nAccording to the Hall of Fame, approximately 300,000 visitors enter the museum each year, and the running total has surpassed 14 million. These visitors see only a fraction of its 40,000 artifacts, 3 million library items (such as newspaper clippings and photos) and 140,000 baseball cards.\n\nThe Hall has seen a noticeable decrease in attendance in recent years. A 2013 story on ESPN.com about the village of Cooperstown and its relation to the game partially linked the reduced attendance with Cooperstown Dreams Park, a youth baseball complex about 5 mi away in the town of Hartwick. The 22 fields at Dreams Park currently draw 17,000 players each summer for a week of intensive play; while the complex includes housing for the players, their parents and grandparents must stay elsewhere. According to the story,Prior to Dreams Park, a room might be filled for a week by several sets of tourists. Now, that room will be taken by just one family for the week, and that family may only go into Cooperstown and the Hall of Fame once. While there are other contributing factors (the recession and high gas prices among them), the Hall's attendance has tumbled since Dreams Park opened. The Hall drew 383,000 visitors in 1999. It drew 262,000 last year.\n\nFirst floor\n\n* Baseball at the Movies houses baseball movie memorabilia while a screen shows footage from those movies.\n* The Bullpen Theater is the site of daily programming at the museum (trivia games, book discussions, etc.) and is decorated with pictures of famous relief pitchers.\n* Inductee Row features images of Hall of Famers inducted from 1937–1939.\n* The Perez-Steele Art Gallery features art of all media related to baseball. Dick Perez served as an artist for various projects at the National Baseball Hall of Fame and Museum for 20 years, starting in 1981 Kashatus, William C. (2010) \"Introduction\". In Perez, Dick (2010). The Immortals: An Art Collection of Baseball's Best. Dick Perez (self-published). .\n* The Plaque Gallery, the most recognizable site at the museum, contains induction plaques of all members.\n* The Sandlot Kids Clubhouse has various interactive displays for young children.\n* Scribes and Mikemen honors J. G. Taylor Spink Award and Ford C. Frick Award winners with a photo display and has artifacts related to baseball writing and broadcasting. Floor-to-ceiling windows at the Scribes and Mikemen exhibit face an outdoor courtyard with statues of Johnny Podres and Roy Campanella (representing the Brooklyn Dodgers 1955 championship team), and an unnamed All-American Girls Professional Baseball League player. A Satchel Paige statue was unveiled and dedicated during the 2006 Induction Weekend.\n* An Education Gallery hosts school groups and, in the summer, presentations about artifacts from the museum's collection.\n\nSecond floor\n\n* The Grandstand Theater features a 12-minute multimedia film. The 200 seat theater, complete with replica stadium seats, is decorated to resemble old Comiskey Park.[http://web.baseballhalloffame.org/news/article.jsp?ymd20070221&content_id\n1047&vkey=hof_news National Baseball Hall of Fame and Museum: Hall of Fame News] \n* The Game is the major feature of the second floor. It is where the most artifacts are displayed. The Game is set up in a timeline format, starting with baseball's beginnings and culminating with the game we know today. There are several offshoots of this meandering timeline:\n** The Babe Ruth Room\n** Diamond Dreams (women in baseball)\n** ¡Viva Baseball! (a bilingual exhibit, in English and Spanish, that celebrates baseball in Latin America)\n** Pride and Passion (Negro Leagues exhibit)\n** Taking The Field (19th century baseball)\n* Whole New Ballgame, the Museum's newest permanent exhibit, opened in 2015 and is located in the Janetschek Gallery. This exhibit completes the timeline of baseball through the last 45 years into the game we know today. It features environmental video walls and new interactive elements to go along with artifacts from the Museum's collection.\n* The Today's Game exhibit is built like a baseball clubhouse, with 30 glass-enclosed locker stalls, one for each Major League franchise. In each stall there is a jersey and other items from the designated big league team, along with a brief team history. A center display case holds objects donated to the Hall of Fame from the past year or two. Fans can also look into a room designed to look like a manager's office. Outside is a display case with rotating artifacts. Currently the space is devoted to the World Baseball Classic.\n\nThird floor\n\n* Autumn Glory is devoted to post-season baseball and has, among other artifacts, replicas of World Series rings.\n* Hank Aaron: Chasing the Dream\n* A theater area continually plays the popular Abbott and Costello routine \"Who's on First?\" \n* One for the Books tells the story of baseball's most cherished records through more than 200 artifacts. The exhibit allows fans to search records dating back through baseball history via an interactive Top Ten Tower while giving visitors a look at exciting moments throughout the years via a multimedia wall.\n**BBWAA awards: Replicas of various awards distributed by the BBWAA at the end of each season, along with a list of past winners.\n** A case dedicated to Ichiro Suzuki setting the major league record for base hits in a single season, with 262 in 2004, after George Sisler had held the record for 84 years with 257.\n** A case full of World Series rings from prior years from the 1900s to present.\n** An inductee database touch-screen computer with statistics for every inductee.\n** Programs from every World Series.\n* Sacred Ground is devoted entirely to ballparks and everything about them, especially the fan experience and the business of a ballpark. The centerpiece is a computer tour of three former ballparks: Boston's South End Grounds, Chicago's Comiskey Park, and Brooklyn's Ebbets Field.\n\nUnauthorized sale of items in collection\n\nA controversy erupted in 1982, when it emerged that some historic items given to the Hall had been sold on the collectibles market. The items had been lent to the Baseball Commissioner's office, gotten mixed up with other property owned by the Commissioner's office and employees of the office, and moved to the garage of Joe Reichler, an assistant to Commissioner Bowie Kuhn, who sold the items to resolve his personal financial difficulties. Under pressure from the New York Attorney General, the Commissioner's Office made reparations, but the negative publicity damaged the Hall of Fame's reputation, and made it more difficult for it to solicit donations.\n\nNon-induction of banned players\n\nFollowing the banning of Pete Rose from MLB, the selection rules for the Baseball Hall of Fame were modified to prevent the induction of anyone on Baseball's permanent suspension list, such as Rose or Shoeless Joe Jackson. Many others have been barred from participation in MLB, but none have Hall of Fame qualifications on the level of Jackson or Rose.\n\nJackson and Rose were both banned from MLB for life for actions related to gambling on their own teams—Jackson was determined to have cooperated with those who conspired to lose the 1919 World Series intentionally, and Rose voluntarily accepted a permanent spot on the ineligible list in return for MLB's promise to make no official finding in relation to alleged betting on the Cincinnati Reds when he was their manager in the 1980s. (Baseball's Rule 21, prominently posted in every clubhouse locker room, mandates permanent banishment from the MLB for having a gambling interest of any sort on a game in which a player or manager is directly involved.) Rose later admitted that he bet on the Reds in his 2004 autobiography. Baseball fans are deeply split on the issue of whether these two should remain banned or have their punishment revoked. Writer Bill James, though he advocates Rose eventually making it into the Hall of Fame, compared the people who want to put Jackson in the Hall of Fame to \"those women who show up at murder trials wanting to marry the cute murderer\".James (1995:358)",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "National Baseball Hall of Fame and Museum" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4078" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The National Baseball Hall of Fame and Museum is an American history museum and hall of fame, located in Cooperstown, New York, and operated by private interests. It serves as the central point for the study of the history of baseball in the United States and beyond, displays baseball-related artifacts and exhibits, and honors those who have excelled in playing, managing, and serving the sport. The Hall's motto is \"Preserving History, Honoring Excellence, Connecting Generations.\"\n\nThe word Cooperstown is often used as shorthand (or a metonym) for the National Baseball Hall of Fame and Museum.\n\nThe Hall of Fame was established in 1939 by Stephen Carlton Clark, the owner of a local hotel. Clark had sought to bring tourists to a city hurt by the Great Depression, which reduced the local tourist trade, and Prohibition, which devastated the local hops industry. A new building was constructed, and the Hall of Fame was dedicated on June 12, 1939. (Clark's granddaughter, Jane Forbes Clark, is the current chairman of the Board of Directors.)\n\nThe erroneous claim that Civil War hero Abner Doubleday invented baseball in Cooperstown was instrumental in the early marketing of the Hall.\n\nAn expanded library and research facility opened in 1994. Dale Petroskey became the organization's president in 1999.[http://mlb.mlb.com/news/article.jsp?ymd20080325&content_id\n2458145&vkeynews_mlb&fext\n.jsp&c_id=mlb The Official Site of Major League Baseball: News: HOF president Petroskey resigns] from the Major League Baseball website\n\nIn 2002, the Hall launched Baseball As America, a traveling exhibit that toured ten American museums over six years. The Hall of Fame has since also sponsored educational programming on the Internet to bring the Hall of Fame to schoolchildren who might not visit. The Hall and Museum completed a series of renovations in spring 2005. The Hall of Fame also presents an annual exhibit at FanFest at the Major League Baseball All-Star Game.\n\nJeff Idelson replaced Petroskey as president on April 16, 2008. He had been acting as president since March 25, 2008, when Petroskey was forced to resign for having \"failed to exercise proper fiduciary responsibility\" and making \"judgments that were not in the best interest of the National Baseball Hall of Fame and Museum.\"\n\nIn 2012, Congress passed and President Barack Obama signed a law ordering the United States Mint to produce and sell commemorative, non-circulating coins to benefit the private, non-profit Hall. The bill, , was introduced in the United States House of Representatives by Rep. Richard Hanna, a Republican from New York, and passed the House on October 26, 2011. The coins, which depict baseball gloves and balls, are the first concave designs produced by the Mint. The mintage included 50,000 gold coins, 400,000 silver coins, and 750,000 clad (Nickel-Copper) coins. The Mint released them on March 27, 2014, and the gold and silver editions quickly sold out. The Hall receives money from surcharges included in the sale price: a total of $9.5 million if all the coins are sold.\n\nInductees\n\nAmong baseball fans, \"Hall of Fame\" means not only the museum and facility in Cooperstown, New York, but the pantheon of players, managers, umpires, executives, and pioneers who have been enshrined in the Hall. The first five men elected were Ty Cobb, Babe Ruth, Honus Wagner, Christy Mathewson and Walter Johnson, chosen in 1936; roughly 20 more were selected before the entire group was inducted at the Hall's 1939 opening. , 323 people had been elected to the Hall of Fame, including 226 former Major League Baseball players, 35 Negro league baseball players and executives, 22 managers, 10 umpires, and 30 pioneers, executives, and organizers. 114 members of the Hall of Fame have been inducted posthumously, including four who died after their selection was announced. Of the 35 Negro league members, 29 were inducted posthumously, including all 24 selected since the 1990s. The Hall of Fame includes one female member, Effa Manley.[http://baseballhall.org/news/personality/woman-bronze Woman in Bronze]\n\nThe newest members elected on January 24, 2018, are players Chipper Jones, Jim Thome, Vladimir Guerrero, and Trevor Hoffman. They will be officially inducted on July 29, 2018, alongside players Jack Morris and Alan Trammell.\n\nSelection process\n\nPlayers are currently inducted into the Hall of Fame through election by either the Baseball Writers' Association of America (or BBWAA), or the Veterans Committee,Following changes to the voting procedure in 2010, the official name is \"Committee to Consider Managers, Umpires, Executives and Long-Retired Players\". The term \"Veterans Committee\" comes from the former official name of \"Committee on Baseball Veterans\". Although the Hall no longer uses \"Veterans Committee\", that term is still widely used by baseball media. which now consists of four subcommittees, each of which considers and votes for candidates from a separate era of baseball. Five years after retirement, any player with 10 years of major league experience who passes a screening committee (which removes from consideration players of clearly lesser qualification) is eligible to be elected by BBWAA members with 10 years' membership or more who also have been actively covering MLB at any time in the 10 years preceding the election (the latter requirement was added for the 2016 election). From a final ballot typically including 25–40 candidates, each writer may vote for up to 10 players; until the late 1950s, voters were advised to cast votes for the maximum 10 candidates. Any player named on 75% or more of all ballots cast is elected. A player who is named on fewer than 5% of ballots is dropped from future elections. In some instances, the screening committee had restored their names to later ballots, but in the mid-1990s, dropped players were made permanently ineligible for Hall of Fame consideration, even by the Veterans Committee. A 2001 change in the election procedures restored the eligibility of these dropped players; while their names will not appear on future BBWAA ballots, they may be considered by the Veterans Committee. Players receiving 5% or more of the votes but fewer than 75% are reconsidered annually until a maximum of ten years of eligibility (lowered from fifteen years for the 2015 election).\n\nUnder special circumstances, certain players may be deemed eligible for induction even though they have not met all requirements. Addie Joss was elected in 1978, despite only playing nine seasons before he died of meningitis. Additionally, if an otherwise eligible player dies before his fifth year of retirement, then that player may be placed on the ballot at the first election at least six months after his death. Roberto Clemente's induction in 1973 set the precedent when the writers chose to put him up for consideration after his death on New Year's Eve, 1972.\n\nThe five-year waiting period was established in 1954 after an evolutionary process. In 1936 all players were eligible, including active ones. From the 1937 election until the 1945 election, there was no waiting period, so any retired player was eligible, but writers were discouraged from voting for current major leaguers. Since there was no formal rule preventing a writer from casting a ballot for an active player, the scribes did not always comply with the informal guideline; Joe DiMaggio received a vote in 1945, for example. From the 1946 election until the 1954 election, an official one-year waiting period was in effect. (DiMaggio, for example, retired after the 1951 season and was first eligible in the 1953 election.) The modern rule establishing a wait of five years was passed in 1954, although an exception was made for Joe DiMaggio because of his high level of previous support, thus permitting him to be elected within four years of his retirement.\n\nContrary to popular belief, no formal exception was made for Lou Gehrig (other than to hold a special one-man election for him): there was no waiting period at that time, and Gehrig met all other qualifications, so he would have been eligible for the next regular election after he retired during the 1939 season. However, the BBWAA decided to hold a special election at the 1939 Winter Meetings in Cincinnati, specifically to elect Gehrig (most likely because it was known that he was terminally ill, making it uncertain that he would live long enough to see another election). Nobody else was on that ballot, and the numerical results have never been made public. Since no elections were held in 1940 or 1941, the special election permitted Gehrig to enter the Hall while still alive.\n\nIf a player fails to be elected by the BBWAA within 10 years of his retirement from active play, he may be selected by the Veterans Committee. Following changes to the election process for that body made in 2010 and 2016, it is now responsible for electing all otherwise eligible candidates who are not eligible for the BBWAA ballot—both long-retired players and non-playing personnel (managers, umpires, and executives). From 2011 through 2016, each candidate could be considered once every three years;  now, the frequency depends on the era in which an individual made his greatest contributions. A more complete discussion of the new process is available below.\n\nFrom 2008 to 2010, following changes made by the Hall in July 2007, the main Veterans Committee, then made up of living Hall of Famers, voted only on players whose careers began in 1943 or later. These changes also established three separate committees to select other figures:\n* One committee voted on managers and umpires for induction in every even-numbered year. This committee voted only twice— in 2007 for induction in 2008 and in 2009 for induction in 2010.\n* One committee voted on executives and builders for induction in every even-numbered year. This committee conducted its only two votes in the same years as the managers/umpires committee.\n* The pre–World War II players committee was intended to vote every five years on players whose careers began in 1942 or earlier. It conducted its only vote as part of the election process for induction in 2009.\n\nPlayers of the Negro Leagues have also been considered at various times, beginning in 1971. In 2005 the Hall completed a study on African American players between the late 19th century and the integration of the major leagues in 1947, and conducted a special election for such players in February 2006; seventeen figures from the Negro Leagues were chosen in that election, in addition to the eighteen previously selected. Following the 2010 changes, Negro Leagues figures were primarily considered for induction alongside other figures from the 1871–1946 era, called the \"Pre-Integration Era\" by the Hall; since 2016, Negro Leagues figures are primarily considered alongside other figures from what the Hall calls the \"Early Baseball\" era (1871–1949).\n\nPredictably, the selection process catalyzes endless debate among baseball fans over the merits of various candidates. Even players elected years ago remain the subjects of discussions as to whether they deserved election. For example, Bill James' book Whatever Happened to the Hall of Fame? goes into detail about who he believes does and does not belong in the Hall of Fame.\n\nChanges to Veterans Committee process\n\nThe actions and composition of the Veterans Committee have been at times controversial, with occasional selections of contemporaries and teammates of the committee members over seemingly more worthy candidates.\n\nIn 2001, the Veterans Committee was reformed to comprise the living Hall of Fame members and other honorees. The revamped Committee held three election, in 2003 and 2007, for both players and non-players, and in 2005 for players only. No individual was elected in that time, sparking criticism among some observers who expressed doubt whether the new Veterans Committee would ever elect a player. The Committee members, most of whom were Hall members, were accused of being reluctant to elect new candidates in the hope of heightening the value of their own selection. After no one was selected for the third consecutive election in 2007, Hall of Famer Mike Schmidt noted, \"The same thing happens every year. The current members want to preserve the prestige as much as possible, and are unwilling to open the doors.\" In 2007, the committee and its selection processes were again reorganized; the main committee then included all living members of the Hall, and voted on a reduced number of candidates from among players whose careers began in 1943 or later. Separate committees, including sportswriters and broadcasters, would select umpires, managers and executives, as well as players from earlier eras.\n\nIn the first election to be held under the 2007 revisions, two managers and three executives were elected in December 2007 as part of the 2008 election process. The next Veterans Committee elections for players were held in December 2008 as part of the 2009 election process; the main committee did not select a player, while the panel for pre–World War II players elected Joe Gordon in its first and ultimately only vote. The main committee voted as part of the election process for inductions in odd-numbered years, while the pre-World War II panel would vote every five years, and the panel for umpires, managers, and executives voted as part of the election process for inductions in even-numbered years.\n\nFurther changes to the Veterans Committee process were announced by the Hall on July 26, 2010, effective with the 2011 election.\n\nAll individuals eligible for induction but not eligible for BBWAA consideration were considered on a single ballot, grouped by the following eras in which they made their greatest contributions:\n* Pre-Integration Era (1871–1946)\n* Golden Era (1947–1972)\n* Expansion Era (1973 and later)\n\nThe Hall used the BBWAA's Historical Overview Committee to formulate the ballots for each era, consisting of 12 individuals for the Expansion Era and 10 for the other eras. The Hall's board of directors selected a committee of 16 voters for each era, made up of Hall of Famers, executives, baseball historians, and media members. Each committee met and voted at the Baseball Winter Meetings once every three years. The Expansion Era committee held its first vote in 2010 for 2011 induction, with longtime general manager Pat Gillick becoming the first individual elected under the new procedure. The Golden Era committee voted in 2011 for the induction class of 2012, with Ron Santo becoming the first player elected under the new procedure. The Pre-Integration Era committee voted in 2012 for the induction class of 2013, electing three figures. Subsequent elections rotated among the three committees in that order through the 2016 election.\n\nIn July 2016, however, the Hall of Fame announced a restructuring of the timeframes to be considered, with a much greater emphasis on modern eras. Four new committees were established:\n* Today's Game (1988–present)\n* Modern Baseball (1970–1987)\n* Golden Days (1950–1969)\n* Early Baseball (1871–1949)\n\nAll committees' ballots now include 10 candidates. While there was previously a one-year waiting period after elimination from annual BBWAA consideration, there is now no waiting period. At least one committee convenes each December as part of the election process for the following calendar year's induction ceremony. The Early Baseball committee convenes only in years ending in 0 (2020, 2030). The Golden Days committee convenes only in years ending in 0 and 5 (2020, 2025). The remaining two committees convene twice every 5 years. More specifically, the Today's Game and Modern Baseball committees alternate their meetings in that order, skipping years in which either the Early Baseball or Golden Days committee meets. This means that in the next two 5-year cycles, the Today's Game committee (having met in 2016) will meet in 2018, 2021, and 2023, while the Modern Baseball committee (which met in 2017) will meet in 2019, 2022 and 2024. Additionally, the Hall of Fame has modified the criteria under which active executives can be considered for induction. All active executives age 70 or older may now have their careers reviewed as part of the Era Committee balloting process, regardless of the position they hold in an organization, and regardless of whether their body of work has been completed. Previously, active executives 65 years or older were eligible for consideration.\n\nPlayers and managers with multiple teams\n\nWhile the text on a player's or manager's plaque lists all teams for which the inductee was a member in that specific role, inductees are usually depicted wearing the cap of a specific team, though in a few cases, like umpires, they wear caps without logos. (Executives are not depicted wearing caps.) Additionally, as of 2015, inductee biographies on the Hall's website for all players and managers, and executives who were associated with specific teams, list a \"primary team\", which does not necessarily match the cap logo. The Hall selects the logo \"based on where that player makes his most indelible mark.\"\n\nAlthough the Hall always made the final decision on which logo was shown, until 2001 the Hall deferred to the wishes of players or managers whose careers were linked with multiple teams. Some examples of inductees associated with multiple teams are the following:\n*Frank Robinson: Robinson chose to have the Baltimore Orioles cap displayed on his plaque, although he had played ten seasons with the Cincinnati Reds and six seasons with Baltimore. Robinson won four pennants and two World Series with the Orioles and one pennant with Cincinnati. His second World Series ring came in the 1970 World Series against the Reds. Robinson also won an MVP award while playing for each team.\n*Catfish Hunter: Hunter chose not to have any logo on his cap when elected to the Hall of Fame in 1987. Hunter had success for both teams for which he played – the Kansas City/Oakland Athletics (his first ten seasons) and the New York Yankees (his final five seasons). Furthermore, both during and after his career he maintained good relations with both teams and their respective owners (Charles Finley and George Steinbrenner), and did not wish to slight either team by selecting the other.\n*Nolan Ryan: Born and raised in Texas, Ryan entered the Hall in 1999 wearing a Texas Rangers cap on his plaque, although he spent only five seasons with the Rangers, while raised in the Houston area and having longer and more successful tenures with the Houston Astros (nine seasons, 1980–88 and his record-setting fifth career no-hitter) and California Angels (eight seasons, 1972–79 and the first four of his seven career no-hitters). Ryan's only championship was as a member of the New York Mets in 1969. Ryan finished his career with the Rangers, reaching his 5000th strikeout and 300th win, and throwing the last two of his no-hitters. Ryan later took ownership of the Rangers when they were sold to his Rangers Baseball Express group in 2010. He sold his Rangers interest in 2013 and is now in the Astros' front office.\n*Reggie Jackson: Jackson chose to be depicted with a Yankees cap over an Athletics cap. As a member of the Kansas City/Oakland A's, Jackson played ten seasons (1967–75, '87), winning three World Series (1972, 1973, 1974) and the 1973 AL MVP Award. During his five years in New York (1977–81), Jackson won two World Series (1977–78), with his crowning achievement occurring during Game Six of the 1977 World Series, when he hit three home runs on consecutive pitches and earned his nickname \"Mr. October\".\n*Carlton Fisk: Fisk went into the hall with a Boston Red Sox cap on his plaque in 2000 despite playing with the Chicago White Sox longer and posting more significant numbers with the White Sox. Fisk's choice of the Red Sox was likely because of his being a New England native, as well as his famous \"Stay fair!\" walk-off home run in Game Six of the 1975 World Series with which he is most associated.\n*Sparky Anderson: Also in 2000, Anderson entered the Hall with a Cincinnati Reds cap on his plaque despite managing almost twice as many seasons with the Detroit Tigers (17 in Detroit; nine in Cincinnati). He chose the Reds to honor that team's former general manager Bob Howsam, who gave him his first major-league managing job. Anderson won two World Series with the Reds and one with the Tigers.\n*Dave Winfield: Winfield had spent the most years in his career with the Yankees and had great success there, but chose to go into the Hall as a member of the San Diego Padres due to his feud with Yankees owner George Steinbrenner.\n\nIn all of the above cases, the \"primary team\" is the team for which the inductee spent the largest portion of his career except for Ryan, whose primary team is listed as the Angels despite playing one fewer season for that team than for the Astros.\n\nIn 2001, the Hall of Fame decided to change the policy on cap logo selection, as a result of rumors that some teams were offering compensation, such as number retirement, money, or organizational jobs, in exchange for the cap designation. (For example, though Wade Boggs denied the claims, some media reports had said that his contract with the Tampa Bay Devil Rays required him to request depiction in the Hall of Fame as a Devil Ray.) The Hall decided that it would no longer defer to the inductee, though the player's wishes would be considered, when deciding on the logo to appear on the plaque. Newly elected members affected by the change include the following:\n*Gary Carter: Inducted in 2003, Carter was the first player to be affected by the new policy. Carter won his only championship with the 1986 New York Mets, and wanted his induction plaque to depict him wearing a Mets cap, though he had spent twelve years (1974–84, 1992) with the Montreal Expos and five (1985–89) with the Mets. The Hall of Fame decided that Carter's impact on the Montreal franchise warranted depicting him with an Expos cap.\n*Wade Boggs: Boggs's only championship was as a member of the 1996 New York Yankees, for whom he played from 1993–97, but his best career numbers were posted during his eleven years (1982–92) wearing the Boston Red Sox uniform. Boggs would eventually be depicted wearing a Boston cap for his 2005 induction.\n*Andre Dawson: Dawson's cap depicts him as a member of the Expos, his team for eleven years, despite his expressed preference to be shown as a member of the Chicago Cubs. While Dawson played only six years with the Cubs, five of his eight All-Star appearances were as a Cub, and his only MVP award came in his first year with the team in 1987.\n*Tony La Russa: Manager La Russa chose not to have a logo after managing three teams over 33 years—the Chicago White Sox, Oakland Athletics, and St. Louis Cardinals. His greatest successes were with the A's (three pennants and a World Series title in 10 years) and Cardinals (three pennants and two World Series in 16 years). Nonetheless, La Russa felt that his induction to the Hall was due to his tenures with all three teams, and stated that not including a logo meant that \"fans of all [three] clubs can celebrate this honor with me.\" La Russa's biography on the Hall's website lists his primary team as the Cardinals.\n*Greg Maddux: Although Maddux had his greatest success while with the Atlanta Braves for 11 seasons, he had two stints with the Chicago Cubs for a total of 10 seasons, including the first seven of his MLB career. Maddux believed that both fanbases were equally important in his career, and so the cap on his plaque does not feature any logo. His biography on the Hall's website lists his primary team as the Braves.\n*Randy Johnson: Johnson played for six teams in a 22-year career, but spent the bulk of it with the Seattle Mariners (10 seasons) and Arizona Diamondbacks (8 seasons). While enjoying great success with both teams, he had more significant honors with the Diamondbacks. Four of Johnson's five Cy Young Awards (consecutively from 1999 to 2002), his only championship (in 2001), his pitching triple crown (), and his perfect game () all came with the Diamondbacks. Accordingly, he and the Hall agreed his plaque should feature a Diamondbacks logo. His biography on the Hall's website lists his primary team as the Mariners.\n\nThe museum\n\nAccording to the Hall of Fame, approximately 300,000 visitors enter the museum each year, and the running total has surpassed 14 million. These visitors see only a fraction of its 40,000 artifacts, 3 million library items (such as newspaper clippings and photos) and 140,000 baseball cards.\n\nThe Hall has seen a noticeable decrease in attendance in recent years. A 2013 story on ESPN.com about the village of Cooperstown and its relation to the game partially linked the reduced attendance with Cooperstown Dreams Park, a youth baseball complex about 5 mi away in the town of Hartwick. The 22 fields at Dreams Park currently draw 17,000 players each summer for a week of intensive play; while the complex includes housing for the players, their parents and grandparents must stay elsewhere. According to the story,Prior to Dreams Park, a room might be filled for a week by several sets of tourists. Now, that room will be taken by just one family for the week, and that family may only go into Cooperstown and the Hall of Fame once. While there are other contributing factors (the recession and high gas prices among them), the Hall's attendance has tumbled since Dreams Park opened. The Hall drew 383,000 visitors in 1999. It drew 262,000 last year.\n\nFirst floor\n\n* Baseball at the Movies houses baseball movie memorabilia while a screen shows footage from those movies.\n* The Bullpen Theater is the site of daily programming at the museum (trivia games, book discussions, etc.) and is decorated with pictures of famous relief pitchers.\n* Inductee Row features images of Hall of Famers inducted from 1937–1939.\n* The Perez-Steele Art Gallery features art of all media related to baseball. Dick Perez served as an artist for various projects at the National Baseball Hall of Fame and Museum for 20 years, starting in 1981 Kashatus, William C. (2010) \"Introduction\". In Perez, Dick (2010). The Immortals: An Art Collection of Baseball's Best. Dick Perez (self-published). .\n* The Plaque Gallery, the most recognizable site at the museum, contains induction plaques of all members.\n* The Sandlot Kids Clubhouse has various interactive displays for young children.\n* Scribes and Mikemen honors J. G. Taylor Spink Award and Ford C. Frick Award winners with a photo display and has artifacts related to baseball writing and broadcasting. Floor-to-ceiling windows at the Scribes and Mikemen exhibit face an outdoor courtyard with statues of Johnny Podres and Roy Campanella (representing the Brooklyn Dodgers 1955 championship team), and an unnamed All-American Girls Professional Baseball League player. A Satchel Paige statue was unveiled and dedicated during the 2006 Induction Weekend.\n* An Education Gallery hosts school groups and, in the summer, presentations about artifacts from the museum's collection.\n\nSecond floor\n\n* The Grandstand Theater features a 12-minute multimedia film. The 200 seat theater, complete with replica stadium seats, is decorated to resemble old Comiskey Park.[http://web.baseballhalloffame.org/news/article.jsp?ymd20070221&content_id\n1047&vkey=hof_news National Baseball Hall of Fame and Museum: Hall of Fame News] \n* The Game is the major feature of the second floor. It is where the most artifacts are displayed. The Game is set up in a timeline format, starting with baseball's beginnings and culminating with the game we know today. There are several offshoots of this meandering timeline:\n** The Babe Ruth Room\n** Diamond Dreams (women in baseball)\n** ¡Viva Baseball! (a bilingual exhibit, in English and Spanish, that celebrates baseball in Latin America)\n** Pride and Passion (Negro Leagues exhibit)\n** Taking The Field (19th century baseball)\n* Whole New Ballgame, the Museum's newest permanent exhibit, opened in 2015 and is located in the Janetschek Gallery. This exhibit completes the timeline of baseball through the last 45 years into the game we know today. It features environmental video walls and new interactive elements to go along with artifacts from the Museum's collection.\n* The Today's Game exhibit is built like a baseball clubhouse, with 30 glass-enclosed locker stalls, one for each Major League franchise. In each stall there is a jersey and other items from the designated big league team, along with a brief team history. A center display case holds objects donated to the Hall of Fame from the past year or two. Fans can also look into a room designed to look like a manager's office. Outside is a display case with rotating artifacts. Currently the space is devoted to the World Baseball Classic.\n\nThird floor\n\n* Autumn Glory is devoted to post-season baseball and has, among other artifacts, replicas of World Series rings.\n* Hank Aaron: Chasing the Dream\n* A theater area continually plays the popular Abbott and Costello routine \"Who's on First?\" \n* One for the Books tells the story of baseball's most cherished records through more than 200 artifacts. The exhibit allows fans to search records dating back through baseball history via an interactive Top Ten Tower while giving visitors a look at exciting moments throughout the years via a multimedia wall.\n**BBWAA awards: Replicas of various awards distributed by the BBWAA at the end of each season, along with a list of past winners.\n** A case dedicated to Ichiro Suzuki setting the major league record for base hits in a single season, with 262 in 2004, after George Sisler had held the record for 84 years with 257.\n** A case full of World Series rings from prior years from the 1900s to present.\n** An inductee database touch-screen computer with statistics for every inductee.\n** Programs from every World Series.\n* Sacred Ground is devoted entirely to ballparks and everything about them, especially the fan experience and the business of a ballpark. The centerpiece is a computer tour of three former ballparks: Boston's South End Grounds, Chicago's Comiskey Park, and Brooklyn's Ebbets Field.\n\nUnauthorized sale of items in collection\n\nA controversy erupted in 1982, when it emerged that some historic items given to the Hall had been sold on the collectibles market. The items had been lent to the Baseball Commissioner's office, gotten mixed up with other property owned by the Commissioner's office and employees of the office, and moved to the garage of Joe Reichler, an assistant to Commissioner Bowie Kuhn, who sold the items to resolve his personal financial difficulties. Under pressure from the New York Attorney General, the Commissioner's Office made reparations, but the negative publicity damaged the Hall of Fame's reputation, and made it more difficult for it to solicit donations.\n\nNon-induction of banned players\n\nFollowing the banning of Pete Rose from MLB, the selection rules for the Baseball Hall of Fame were modified to prevent the induction of anyone on Baseball's permanent suspension list, such as Rose or Shoeless Joe Jackson. Many others have been barred from participation in MLB, but none have Hall of Fame qualifications on the level of Jackson or Rose.\n\nJackson and Rose were both banned from MLB for life for actions related to gambling on their own teams—Jackson was determined to have cooperated with those who conspired to lose the 1919 World Series intentionally, and Rose voluntarily accepted a permanent spot on the ineligible list in return for MLB's promise to make no official finding in relation to alleged betting on the Cincinnati Reds when he was their manager in the 1980s. (Baseball's Rule 21, prominently posted in every clubhouse locker room, mandates permanent banishment from the MLB for having a gambling interest of any sort on a game in which a player or manager is directly involved.) Rose later admitted that he bet on the Reds in his 2004 autobiography. Baseball fans are deeply split on the issue of whether these two should remain banned or have their punishment revoked. Writer Bill James, though he advocates Rose eventually making it into the Hall of Fame, compared the people who want to put Jackson in the Hall of Fame to \"those women who show up at murder trials wanting to marry the cute murderer\".James (1995:358). National Baseball Hall of Fame and Museum. http://en.wikipedia.org/?curid=4078."
  }
}
