{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=4130",
  "eid" : "cb6a9910-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778421025,
  "textBody" : "The Boeing CIM-10 Bomarc (IM-99 Weapon System prior to September 1962) was a supersonic long-range surface-to-air missile (SAM) used during the Cold War for the air defense of North America. In addition to being the first operational long-range SAM, it was the only SAM deployed by the United States Air Force.\n\nStored horizontally in a launcher shelter with movable roof, the missile was erected, fired vertically using rocket boosters to high altitude, and then tipped over into a horizontal Mach 2.5 cruise powered by ramjet engines. This lofted trajectory allowed the missile to operate at a maximum range as great as 250 miles. Controlled from the ground for most of its flight, when it reached the target area it was commanded to begin a dive, activating an onboard active radar homing seeker for terminal guidance. A radar proximity fuse detonated the warhead, either a large conventional explosive or the W40 nuclear warhead.\n\nThe Air Force originally planned for a total of 52 sites covering most of the major cities and industrial regions in the US. The US Army was deploying their own systems at the same time, and the two services fought constantly both in political circles and in the press. Development dragged on, and by the time it was ready for deployment in the late 1950s, the nuclear threat had moved from manned bombers to the intercontinental ballistic missile (ICBM), while the Army had successfully deployed their own system that filled any possible role in the 1960s, in spite of Air Force claims to the contrary.\n\nAs testing continued, the Air Force reduced its plans to sixteen sites, and then again to eight with an additional two sites in Canada. The first US site was declared operational in 1959, but with only a single working missile. Bringing the rest of the missiles into service took years, by which time the system was obsolete. Deactivations began in 1969 and by 1972 all Bomarc sites had been shut down. A small number were used as target drones, and only a few remain on display today.\n\nDesign and development\n\nIn 1946, Boeing started to study surface-to-air guided missiles under the United States Army Air Forces project MX-606. By 1950, Boeing had launched more than 100 test rockets in various configurations, all under the designator XSAM-A-1 GAPA (Ground-to-Air Pilotless Aircraft). Because these tests were very promising, Boeing received a USAF contract in 1949 to develop a pilotless interceptor (a term then used by the USAF for air-defense guided missiles) under project MX-1599. The MX-1599 missile was to be a ramjet-powered, nuclear-armed long-range surface-to-air missile to defend the Continental United States from high-flying bombers. The Michigan Aerospace Research Center (MARC) was added to the project soon afterward, and this gave the new missile its name Bomarc (for Boeing and MARC). In 1951, the USAF decided to emphasize its point of view that missiles were nothing else than pilotless aircraft by assigning aircraft designators to its missile projects, and anti-aircraft missiles received F-for-Fighter designations. The Bomarc became the F-99.Gibson 1996, pp. 200–201.\n\nTest flights of XF-99 test vehicles began in September 1952 and continued through early 1955. The XF-99 tested only the liquid-fueled booster rocket, which would accelerate the missile to ramjet ignition speed. In February 1955, tests of the XF-99A propulsion test vehicles began. These included live ramjets, but still had no guidance system or warhead. The designation YF-99A had been reserved for the operational test vehicles. In August 1955, the USAF discontinued the use of aircraft-like type designators for missiles, and the XF-99A and YF-99A became XIM-99A and YIM-99A, respectively. Originally the USAF had allocated the designation IM-69, but this was changed (possibly at Boeing's request to keep number 99) to IM-99 in October 1955. In October 1957, the first YIM-99A production-representative prototype flew with full guidance, and succeeded to pass the target within destructive range. In late 1957, Boeing received the production contract for the IM-99A Bomarc A interceptor missile, and in September 1959, the first IM-99A squadron became operational.\n\nThe IM-99A had an operational radius of 200 mi and was designed to fly at Mach 2.5–2.8 at a cruising altitude of 60000 ft. It was  long and weighed 15500 lb. Its armament was either a 1000 lb conventional warhead or a W40 nuclear warhead (7–10 kiloton yield). A liquid-fuel rocket engine boosted the Bomarc to Mach 2, when its Marquardt RJ43-MA-3 ramjet engines, fueled by 80-octane gasoline, would take over for the remainder of the flight. This was the same model of engine used to power both the Lockheed X-7, the Lockheed AQM-60 Kingfisher drone used to test air defenses, and the Lockheed D-21 launched from the back of an SR-71 .\n\nThe operational IM-99A missiles were based horizontally in semi-hardened shelters, nicknamed \"coffins\". After the launch order, the shelter's roof would slide open, and the missile raised to the vertical. After the missile was supplied with fuel for the booster rocket, it would be launched by the Aerojet General LR59-AJ-13 booster. After sufficient speed was reached, the Marquardt RJ43-MA-3 ramjets would ignite and propel the missile to its cruise speed of Mach 2.8 at an altitude of 20000 m.\n\nWhen the Bomarc was within 16 km of the target, its own Westinghouse AN/DPN-34 radar guided the missile to the interception point. The maximum range of the IM-99A was 400 km, and it was fitted with either a conventional high-explosive or a 10 kiloton W-40 nuclear fission warhead.\n\nThe Bomarc relied on the Semi-Automatic Ground Environment (SAGE), an automated control system used by NORAD for detecting, tracking and intercepting enemy bomber aircraft. SAGE allowed for remote launching of the Bomarc missiles, which were housed in a constant combat-ready basis in individual launch shelters in remote areas. At the height of the program, there were 14 Bomarc sites located in the US and two in Canada.\n\nThe liquid-fuel booster of the Bomarc A was no optimal solution. It took two minutes to fuel before launch, which could be a long time in high-speed intercepts, and its hypergolic propellants (hydrazine and nitric acid) were very dangerous to handle, leading to several serious accidents.\n\nAs soon as high-thrust solid-fuel rockets became a reality in the mid-1950s, the USAF began to develop a new solid-fueled Bomarc variant, the IM-99B Bomarc B. It used a Thiokol XM51 booster, and also had improved Marquardt RJ43-MA-7 (and finally the RJ43-MA-11) ramjets. The first IM-99B was launched in May 1959, but problems with the new propulsion system delayed the first fully successful flight until July 1960, when a supersonic KD2U-1/MQM-15A Regulus II drone was intercepted. Because the new booster took up less space in the missile, more ramjet fuel could be carried, increasing the range to 710 km. The terminal homing system was also improved, using the world's first pulse Doppler search radar, the Westinghouse AN/DPN-53. All Bomarc Bs were equipped with the W-40 nuclear warhead. In June 1961, the first IM-99B squadron became operational, and Bomarc B quickly replaced most Bomarc A missiles. On 23 March 1961, a Bomarc B successfully intercepted a Regulus II cruise missile flying at 100,000 ft, thus achieving the highest interception in the world up to that date.\n\nBoeing built 570 Bomarc missiles between 1957 and 1964, 269 CIM-10A, 301 CIM-10B.\n\nIn September 1958 Air Research & Development Command decided to transfer the Bomarc program from its testing at Cape Canaveral Air Force Station to a new facility on Santa Rosa Island, immediately south of Eglin AFB Hurlburt Field on the Gulf of Mexico. To operate the facility and to provide training and operational evaluation in the missile program, Air Defense Command established the 4751st Air Defense Wing (Missile) (4751st ADW) on 15 January 1958. The first launch from Santa Rosa took place on 15 January 1959.\n\nOperational history\n\nUnited States\n\nThe first USAF operational Bomarc squadron was the 46th Air Defense Missile Squadron (ADMS), organized on 1 January 1959 and activated on 25 March. The 46th ADMS was assigned to the New York Air Defense Sector at McGuire Air Force Base, New Jersey. The training program, under the 4751st ADW used technicians acting as instructors and was established for a four-month duration. Training included missile maintenance; SAGE operations and launch procedures, including the launch of an unarmed missile at Eglin. In September 1959 the squadron assembled at their permanent station, the Bomarc site near McGuire AFB, and trained for operational readiness. The first Bomarc-A were used at McGuire on 19 September 1959 with Kincheloe AFB getting the first operational IM-99Bs. While several of the squadrons replicated earlier fighter interceptor unit numbers, they were all new organizations with no previous historical counterpart.[http://www.radomes.org/museum/documents/McGuireAFBBOMARCNJ1960NYADShistory.html \"46th Air Defense Missile Squadron.\"] NYADS 1960 Yearbook. Retrieved 28 September 2010.\n\nADC's initial plans called for some 52 Bomarc sites around the United States with 120 missiles each but as defense budgets decreased during the 1950s the number of sites dropped substantially. Ongoing development and reliability problems didn't help, nor did Congressional debate over the missile's usefulness and necessity. In June 1959, the Air Force authorized 16 Bomarc sites with 56 missiles each; the initial five would get the IM-99A with the remainder getting the IM-99B. However, in March 1960, HQ USAF cut deployment to eight sites in the United States and two in Canada.\n\nBomarc incident\n\nWithin a year of operations, a Bomarc-A with a nuclear warhead caught fire at McGuire AFB on 7 June 1960 after its on-board helium tank exploded. While the missile's explosives did not detonate, the heat melted the warhead and released plutonium, which the fire crews spread. The Air Force and the Atomic Energy Commission cleaned up the site and covered it with concrete. This was the only major incident involving the weapon system. The site remained in operation for several years following the fire. Since its closure in 1972, the area has remained off limits, primarily due to low levels of plutonium contamination.Gambardello, Joseph A. [http://www.accessmylibrary.com/coms2/summary_0286-5763528_ITM \"Plutonium Spill Neither Gone Nor Forgotten, 40 Years Later.\"] The Philadelphia Inquirer, 1 June 2000, p. A01. Retrieved: 26 December 2009.  In 2002, the concrete at the site was removed and transported to Lakehurst Naval Air Station for transport by rail to a site for proper disposal.\n\nModification and deactivation\n\nIn 1962, the US Air Force started using modified A-models as drones; following the October 1962 tri-service redesignation of aircraft and weapons systems they became CQM-10As. Otherwise the air defense missile squadrons maintained alert while making regular trips to Santa Rosa Island for training and firing practice. After the inactivation of the 4751st ADW(M) on 1 July 1962 and transfer of Hurlburt to Tactical Air Command for air commando operations the 4751st Air Defense Squadron (Missile) remained at Hurlburt and Santa Rosa Island for training purposes.\n\nIn 1964, the liquid-fueled Bomarc-A sites and squadrons began to be deactivated. The sites at Dow and Suffolk County closed first. The remainder continued to be operational for several more years while the government started dismantling the air defense missile network. Niagara Falls was the first BOMARC B installation to close, in December 1969; the others remained on alert through 1972. In April 1972, the last Bomarc B in U.S. Air Force service was retired at McGuire and the 46th ADMS inactivated  and the base was deactivated.\n\nIn the era of the intercontinental ballistic missiles the Bomarc, designed to intercept relatively slow manned bombers, had become a useless asset. The remaining Bomarc missiles were used by all armed services as high-speed target drones for tests of other air-defense missiles. The Bomarc A and Bomarc B targets were designated as CQM-10A and CQM-10B, respectively.\n\nFollowing the accident, the McGuire complex has never been sold or converted to other uses and remains in Air Force ownership, making it the most intact site of the eight in the US. It has been nominated to the National Register of Historic Sites. Although a number of IM-99/CIM-10 Bomarcs have been placed on public display, because of concerns about the possible environmental hazards of the thoriated magnesium structure of the airframe several have been removed from public view.Young, Gord. [http://www.northbaynugget.ca/ArticleDisplay.aspx?archive\ntrue&e=1750308 \"Cold War relic on the move.\"] North Bay Nugget, 12 September 2009. Retrieved: 24 December 2009.\n\nRuss Sneddon, director of the Air Force Armament Museum, Eglin Air Force Base, Florida provided information about missing CIM-10 exhibit airframe serial 59-2016, one of the museum's original artifacts from its founding in 1975 and donated by the 4751st Air Defense Squadron at Hurlburt Field, Eglin Auxiliary Field 9, Eglin AFB. As of December 2006, the suspect missile was stored in a secure compound behind the Armaments Museum. In December 2010, the airframe was still on premises, but partly dismantled.\n\nCanada\n\nThe Bomarc Missile Program was highly controversial in Canada.\n The Progressive Conservative government of Prime Minister John Diefenbaker initially agreed to deploy the missiles, and shortly thereafter controversially scrapped the Avro Arrow, a supersonic manned interceptor aircraft, arguing that the missile program made the Arrow unnecessary.\n\nInitially, it was unclear whether the missiles would be equipped with nuclear warheads. By 1960 it became known that the missiles were to have a nuclear payload, and a debate ensued about whether Canada should accept nuclear weapons.\n Ultimately, the Diefenbaker government decided that the Bomarcs should not be equipped with nuclear warheads.\n The dispute split the Diefenbaker Cabinet, and led to the collapse of the government in 1963. The Official Opposition and Liberal Party leader Lester B. Pearson originally was against nuclear missiles, but reversed his personal position and argued in favor of accepting nuclear warheads.\n He won the 1963 election, largely on the basis of this issue, and his new Liberal government proceeded to accept nuclear-armed Bomarcs, with the first being deployed on 31 December 1963.\"Special to The Star: Canada's Bomarcs get atom warheads.\" The Toronto Daily Star, 2 January 1964, pp. 1, 4. When the nuclear warheads were deployed, Pearson's wife, Maryon, resigned her honorary membership in the anti-nuclear weapons group, Voice of Women.\n\nCanadian operational deployment of the Bomarc involved the formation of two specialized Surface/Air Missile squadrons. The first to begin operations was No. 446 SAM Squadron at RCAF Station North Bay, Ontario, which was the command and control center for both squadrons. With construction of the compound and related facilities completed in 1961, the squadron received its Bomarcs in 1961, without nuclear warheads. The squadron became fully operational from 31 December 1963, when the nuclear warheads arrived, until disbanding on 31 March 1972. All the warheads were stored separately and under control of Detachment 1 of the USAF 425th Munitions Maintenance Squadron. During operational service, the Bomarcs were maintained on stand-by, on a 24-hour basis, but were never fired, although the squadron test-fired the missiles at Eglin AFB, Florida on annual winter retreats.Nicks et al. 1997, pp. 84–85.\n\nNo. 447 SAM Squadron operating out of RCAF Station La Macaza, Quebec, was activated on 15 September 1962 although warheads were not delivered until late 1963. The squadron followed the same operational procedures as No. 446, its sister squadron. With the passage of time the operational capability of the 1950s-era Bomarc system no longer met modern requirements; the Department of National Defence deemed that the Bomarc missile defense was no longer a viable system, and ordered both squadrons to be stood down in 1972. The bunkers and ancillary facilities remain at both former sites.Nicks et al. 1997, pp. 85–87.\n\nVariants\n\n* XF-99 (experimental for booster research)\n* XF-99A/XIM-99A (experimental for ramjet research)\n* YF-99/YIM-99 (service-test)\n* IM-99A (initial production)\n* IM-99B (\"advanced\"\"IM-99A Bases Manual\". Boeing: Pilotless Aircraft Division (Seattle, Washington), 12 March 1959.)\n* CQM-10 (target drone)[http://www.nationalmuseum.af.mil/factsheets/factsheet.asp?id=2376 \"Factsheets : Boeing XF-99.\"]  Nationalmuseum.af.mil. Retrieved: 18 September 2013.\n\nOperators\n\n; / \n*Royal Canadian Air Force from 1955 to 1968 / Canadian Forces from 1968 to 1972\n446 SAM Squadron: 28 IM-99B, CFB North Bay, Ontario 1962–1972[http://www.radomes.org/cgi-bin/museum/acwinfo2x.cgi?site\n%22North+Bay+BOMARC,+ON%22&key=NorthBayBOMARCON \"446 SAM Squadron.\"] radomes.org. Retrieved: 12 September 2010.\n: Bomarc site located at \n447 SAM Squadron: 28 IM-99B, La Macaza, Quebec (La Macaza – Mont Tremblant International Airport)  1962–1972[http://www.radomes.org/cgi-bin/museum/acwinfo2x.cgi?site\n%22La+Macaza+BOMARC,+QC%22&key=LaMacazaBOMARCQC \"447 SAM Squadron.\"] radomes.org. Retrieved: 12 September 2010.\n: Bomarc site located at  (Approximately)\n;\n*United States Air Force Air (later Aerospace) Defense Command\n\n6th Air Defense Missile Squadron, 56 IM-99A\n: Activated on 1 February 1959\n: Assigned to: New York Air Defense Sector\n: Inactivated 15 December 1964\n: Stationed at: Suffolk County Air Force Base Missile Annex, New York\n:: Bomarc site located 3 miles SW at \n\n22d Air Defense Missile Squadron: 28 IM-99A/28 IM-99B\n: Activated on 15 September 1959\n: Assigned to: Washington Air Defense Sector\n: Reassigned to: 33d Air Division, 1 April 1966\n: Reassigned to: 20th Air Division, 19 November 1969\n: Inactivated: 31 October 1972\n: Stationed at: Langley AFB, Virginia\n:: Bomarc site located 3 miles WNW at \n\n26th Air Defense Missile Squadron: 28 IM-99A/28 IM-99B\n: Activated 1 March 1959\n: Assigned to: Boston Air Defense Sector\n: Reassigned to: 35th Air Division, 1 April 1966\n: Reassigned to:  21st Air Division, 19 November 1969\n: Inactivated: 30 April 1972\n: Stationed at: Otis Air Force Base BOMARC site, Massachusetts\n:: Bomarc site located 1 mile NNW at \n\n30th Air Defense Missile Squadron: 28 IM-99A\n: Activated on 1 June 1959\n: Assigned to Bangor Air Defense Sector\n: Inactivated: 15 December 1964\n: Stationed at Dow AFB, Maine\n:: Bomarc site located 4 mils NNE at \n\n35th Air Defense Missile Squadron: 56 IM-99B\n: Activated 1 June 1960\n: Assigned to Syracuse Air Defense Sector\n: Reassigned to: Detroit Air Defense Sector, 4 September 1963\n: Reassigned to: 34th Air Division, 1 April 1966\n: Reassigned to: 35th Air Division, 15 September 1969\n: Inactivated: 31 December 1969\n: Stationed at: Niagara Falls Air Force Missile Site, New York\n:: Bomarc site located at \n\n37th Air Defense Missile Squadron: 28 IM-99B\n: Activated 1 March 1960\n: Assigned to 30th Air Division\n: Reassigned to: Sault Sainte Marie Air Defense Sector, 1 April 1960\n: Reassigned to: Duluth Air Defense Sector, 1 October 1963\n: Reassigned to: 29th Air Division, 1 April 1966\n: Reassigned to:  23d Air Division, 19 November 1969\n: Inactivated 31 July 1972\n: Stationed at: Kincheloe AFB, Michigan\n:: Bomarc site located 9 miles NW at \n\n46th Air Defense Missile Squadron: 28 IM-99A/56 IM-99B\n: Activated 1 January 1959\n: Assigned to New York Air Defense Sector\n: Reassigned to: 21st Air Division, 1 April 1966\n: Reassigned to: 35th Air Division, 1 December 1957\n: Reassigned to: 21st Air Division, 19 November 1969\n: Inactivated 31 October 1972\n: Stationed at: McGuire AFB, New Jersey\n:: Bomarc site located 4 miles ESE at \n\n74th Air Defense Missile Squadron: 28 IM-99B\n: Activated 1 April 1960\n: Assigned to Duluth Air Defense Sector\n: Reassigned to: 29th Air Division, 1 April 1966\n: Reassigned to: 23d Air Division, 19 November 1969\n: Inactivated 30 April 1972\n: Stationed at: Duluth International Airport, Minnesota\n:: Bomarc site located 10 miles NE at \n\n4751st Air Defense Missile Squadron\n: Activated 15 January 1959\n: Assigned to 73d Air Division (Weapons)\n: Reassigned to: 32d Air Division, 1 October 1959\n: Reassigned to: Montgomery Air Defense Sector, 1 July 1962\n: Reassigned to:  Air Defense, Tactical Air Command, 1 September 1979\n: Inactivated 30 September 1979\n: Stationed at: Eglin Auxiliary Field #9 (Hurlburt Field), Florida\n:: Bomarc site located on Santa Rosa Island at \n:: Bomarc site located at Eglin Auxiliary Field #5 (Piccolo Field) at \n\n* Air Force Systems Command\n: Cape Canaveral Air Force Station, Florida\n:: Launch Complex 4 (LC-4) was used for Bomarc testing and development launches 2 February 1956 – 15 April 1960 (17 Launches).  \n: Vandenberg Air Force Base, California\n:: Two launch sites, BOM-1 and BOM-2 were used by the United States Navy for Bomarc launches against aerial targets.  The first launch taking place on 25 August 1966. The last two launches occurred on 14 July 1982. BOM1 49 launches; BOM2 38 launches. \n\nLocations under construction but not activated. Each site was programmed for 28 IM-99B missiles:\n* Camp Adair, Oregon \n* Charleston AFB, South Carolina\n* Ethan Allen AFB, Vermont \n* Paine Field, Washington \n* Travis AFB, California \n* Truax Field, Wisconsin \n* Vandenberg AFB, California \n\nReference for BOMARC units and locations:[http://www.radomes.org/museum/bomarc.html \"Bomarc Missile Sites.\"] radomes.org. Retrieved: 26 December 2009.\n\nFile:6th Air Defense Missile Squadron - ADC - Emblem.png|6th ADMS\nFile:22d Air Defense Missile Squadron - ADC - Emblem.png|22d ADMS\nFile:26th Air Defense Missile Squadron - ADC - Emblem.png|26th ADMS\nFile:30th Air Defense Missile Squadron - ADC - Emblem.png|30th ADMS\nFile:35th Air Defense Missile Squadron - ADC - Emblem.png|35th ADMS\nFile:37th Air Defense Missile Squadron - ADC - Emblem.png|37th ADMS\nFile:46th Air Defense Missile Squadron - ADC - Emblem.png|46th ADMS\nFile:74th Air Defense Missile Squadron - ADC - Emblem.png|74th ADMS\nFile:4751st_Air_Defense_Squadron_-_ADC_-_Emblem.png|4751st ADMS\nFile:Rcaf 446 squadorn BOMARC.png|RCAF 446 Sqdn\nFile:Rcaf 447 squadorn BOMARC.png|RCAF 447 Squdn\n\nSurviving missiles\n\nBelow is a list of museums or sites which have a Bomarc missile on display:\n* Air Force Armament Museum, Eglin Air Force Base, Florida\n* Air Force Space & Missile Museum, Cape Canaveral Air Force Station, Florida.  This pristine artifact is in sequestered storage in Hangar R on Cape Canaveral AFS and cannot be viewed by the general public.\n* Alberta Aviation Museum, Edmonton, Alberta, Canada\n* Canada Aviation and Space Museum, Ottawa, Ontario, Canada\n* Hill Aerospace Museum, Hill Air Force Base, Utah\n* Historical Electronics Museum, Linthicum, Maryland (display of AN/DPN-53, the first airborne pulse-doppler radar, used in the Bomarc)\n* Illinois Soldiers & Sailors Home, Quincy, Illinois\n* Keesler Air Force Base, Biloxi, Mississippi\n* Museum of Aviation, Robins Air Force Base, Warner Robins, Georgia\n* National Museum of Nuclear Science & History, Kirtland Air Force Base, Albuquerque, New Mexico\n* National Museum of the United States Air Force, Wright-Patterson Air Force Base, Ohio[http://www.nationalmuseum.af.mil/Visit/MuseumExhibits/FactSheets/Display/tabid/509/Article/198024/boeing-cim-10-bomarc.aspx \"Boeing CIM-10 Bomarc.\"] National Museum of the US Air Force. Retrieved: 22 August 2015\n* Octave Chanute Aerospace Museum (former Chanute Air Force Base), Rantoul, Illinois\n* Peterson Air and Space Museum, Peterson Air Force Base, Colorado\n* Strategic Air and Space Museum, Ashland, Nebraska\n* U.S. Air Force History and Traditions Museum, Lackland Air Force Base, San Antonio, Texas\n* Vandenberg Air Force Base (Space and Missile Heritage Center), California. Bomarc not for public access.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "CIM-10 Bomarc" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=4130" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Boeing CIM-10 Bomarc (IM-99 Weapon System prior to September 1962) was a supersonic long-range surface-to-air missile (SAM) used during the Cold War for the air defense of North America. In addition to being the first operational long-range SAM, it was the only SAM deployed by the United States Air Force.\n\nStored horizontally in a launcher shelter with movable roof, the missile was erected, fired vertically using rocket boosters to high altitude, and then tipped over into a horizontal Mach 2.5 cruise powered by ramjet engines. This lofted trajectory allowed the missile to operate at a maximum range as great as 250 miles. Controlled from the ground for most of its flight, when it reached the target area it was commanded to begin a dive, activating an onboard active radar homing seeker for terminal guidance. A radar proximity fuse detonated the warhead, either a large conventional explosive or the W40 nuclear warhead.\n\nThe Air Force originally planned for a total of 52 sites covering most of the major cities and industrial regions in the US. The US Army was deploying their own systems at the same time, and the two services fought constantly both in political circles and in the press. Development dragged on, and by the time it was ready for deployment in the late 1950s, the nuclear threat had moved from manned bombers to the intercontinental ballistic missile (ICBM), while the Army had successfully deployed their own system that filled any possible role in the 1960s, in spite of Air Force claims to the contrary.\n\nAs testing continued, the Air Force reduced its plans to sixteen sites, and then again to eight with an additional two sites in Canada. The first US site was declared operational in 1959, but with only a single working missile. Bringing the rest of the missiles into service took years, by which time the system was obsolete. Deactivations began in 1969 and by 1972 all Bomarc sites had been shut down. A small number were used as target drones, and only a few remain on display today.\n\nDesign and development\n\nIn 1946, Boeing started to study surface-to-air guided missiles under the United States Army Air Forces project MX-606. By 1950, Boeing had launched more than 100 test rockets in various configurations, all under the designator XSAM-A-1 GAPA (Ground-to-Air Pilotless Aircraft). Because these tests were very promising, Boeing received a USAF contract in 1949 to develop a pilotless interceptor (a term then used by the USAF for air-defense guided missiles) under project MX-1599. The MX-1599 missile was to be a ramjet-powered, nuclear-armed long-range surface-to-air missile to defend the Continental United States from high-flying bombers. The Michigan Aerospace Research Center (MARC) was added to the project soon afterward, and this gave the new missile its name Bomarc (for Boeing and MARC). In 1951, the USAF decided to emphasize its point of view that missiles were nothing else than pilotless aircraft by assigning aircraft designators to its missile projects, and anti-aircraft missiles received F-for-Fighter designations. The Bomarc became the F-99.Gibson 1996, pp. 200–201.\n\nTest flights of XF-99 test vehicles began in September 1952 and continued through early 1955. The XF-99 tested only the liquid-fueled booster rocket, which would accelerate the missile to ramjet ignition speed. In February 1955, tests of the XF-99A propulsion test vehicles began. These included live ramjets, but still had no guidance system or warhead. The designation YF-99A had been reserved for the operational test vehicles. In August 1955, the USAF discontinued the use of aircraft-like type designators for missiles, and the XF-99A and YF-99A became XIM-99A and YIM-99A, respectively. Originally the USAF had allocated the designation IM-69, but this was changed (possibly at Boeing's request to keep number 99) to IM-99 in October 1955. In October 1957, the first YIM-99A production-representative prototype flew with full guidance, and succeeded to pass the target within destructive range. In late 1957, Boeing received the production contract for the IM-99A Bomarc A interceptor missile, and in September 1959, the first IM-99A squadron became operational.\n\nThe IM-99A had an operational radius of 200 mi and was designed to fly at Mach 2.5–2.8 at a cruising altitude of 60000 ft. It was  long and weighed 15500 lb. Its armament was either a 1000 lb conventional warhead or a W40 nuclear warhead (7–10 kiloton yield). A liquid-fuel rocket engine boosted the Bomarc to Mach 2, when its Marquardt RJ43-MA-3 ramjet engines, fueled by 80-octane gasoline, would take over for the remainder of the flight. This was the same model of engine used to power both the Lockheed X-7, the Lockheed AQM-60 Kingfisher drone used to test air defenses, and the Lockheed D-21 launched from the back of an SR-71 .\n\nThe operational IM-99A missiles were based horizontally in semi-hardened shelters, nicknamed \"coffins\". After the launch order, the shelter's roof would slide open, and the missile raised to the vertical. After the missile was supplied with fuel for the booster rocket, it would be launched by the Aerojet General LR59-AJ-13 booster. After sufficient speed was reached, the Marquardt RJ43-MA-3 ramjets would ignite and propel the missile to its cruise speed of Mach 2.8 at an altitude of 20000 m.\n\nWhen the Bomarc was within 16 km of the target, its own Westinghouse AN/DPN-34 radar guided the missile to the interception point. The maximum range of the IM-99A was 400 km, and it was fitted with either a conventional high-explosive or a 10 kiloton W-40 nuclear fission warhead.\n\nThe Bomarc relied on the Semi-Automatic Ground Environment (SAGE), an automated control system used by NORAD for detecting, tracking and intercepting enemy bomber aircraft. SAGE allowed for remote launching of the Bomarc missiles, which were housed in a constant combat-ready basis in individual launch shelters in remote areas. At the height of the program, there were 14 Bomarc sites located in the US and two in Canada.\n\nThe liquid-fuel booster of the Bomarc A was no optimal solution. It took two minutes to fuel before launch, which could be a long time in high-speed intercepts, and its hypergolic propellants (hydrazine and nitric acid) were very dangerous to handle, leading to several serious accidents.\n\nAs soon as high-thrust solid-fuel rockets became a reality in the mid-1950s, the USAF began to develop a new solid-fueled Bomarc variant, the IM-99B Bomarc B. It used a Thiokol XM51 booster, and also had improved Marquardt RJ43-MA-7 (and finally the RJ43-MA-11) ramjets. The first IM-99B was launched in May 1959, but problems with the new propulsion system delayed the first fully successful flight until July 1960, when a supersonic KD2U-1/MQM-15A Regulus II drone was intercepted. Because the new booster took up less space in the missile, more ramjet fuel could be carried, increasing the range to 710 km. The terminal homing system was also improved, using the world's first pulse Doppler search radar, the Westinghouse AN/DPN-53. All Bomarc Bs were equipped with the W-40 nuclear warhead. In June 1961, the first IM-99B squadron became operational, and Bomarc B quickly replaced most Bomarc A missiles. On 23 March 1961, a Bomarc B successfully intercepted a Regulus II cruise missile flying at 100,000 ft, thus achieving the highest interception in the world up to that date.\n\nBoeing built 570 Bomarc missiles between 1957 and 1964, 269 CIM-10A, 301 CIM-10B.\n\nIn September 1958 Air Research & Development Command decided to transfer the Bomarc program from its testing at Cape Canaveral Air Force Station to a new facility on Santa Rosa Island, immediately south of Eglin AFB Hurlburt Field on the Gulf of Mexico. To operate the facility and to provide training and operational evaluation in the missile program, Air Defense Command established the 4751st Air Defense Wing (Missile) (4751st ADW) on 15 January 1958. The first launch from Santa Rosa took place on 15 January 1959.\n\nOperational history\n\nUnited States\n\nThe first USAF operational Bomarc squadron was the 46th Air Defense Missile Squadron (ADMS), organized on 1 January 1959 and activated on 25 March. The 46th ADMS was assigned to the New York Air Defense Sector at McGuire Air Force Base, New Jersey. The training program, under the 4751st ADW used technicians acting as instructors and was established for a four-month duration. Training included missile maintenance; SAGE operations and launch procedures, including the launch of an unarmed missile at Eglin. In September 1959 the squadron assembled at their permanent station, the Bomarc site near McGuire AFB, and trained for operational readiness. The first Bomarc-A were used at McGuire on 19 September 1959 with Kincheloe AFB getting the first operational IM-99Bs. While several of the squadrons replicated earlier fighter interceptor unit numbers, they were all new organizations with no previous historical counterpart.[http://www.radomes.org/museum/documents/McGuireAFBBOMARCNJ1960NYADShistory.html \"46th Air Defense Missile Squadron.\"] NYADS 1960 Yearbook. Retrieved 28 September 2010.\n\nADC's initial plans called for some 52 Bomarc sites around the United States with 120 missiles each but as defense budgets decreased during the 1950s the number of sites dropped substantially. Ongoing development and reliability problems didn't help, nor did Congressional debate over the missile's usefulness and necessity. In June 1959, the Air Force authorized 16 Bomarc sites with 56 missiles each; the initial five would get the IM-99A with the remainder getting the IM-99B. However, in March 1960, HQ USAF cut deployment to eight sites in the United States and two in Canada.\n\nBomarc incident\n\nWithin a year of operations, a Bomarc-A with a nuclear warhead caught fire at McGuire AFB on 7 June 1960 after its on-board helium tank exploded. While the missile's explosives did not detonate, the heat melted the warhead and released plutonium, which the fire crews spread. The Air Force and the Atomic Energy Commission cleaned up the site and covered it with concrete. This was the only major incident involving the weapon system. The site remained in operation for several years following the fire. Since its closure in 1972, the area has remained off limits, primarily due to low levels of plutonium contamination.Gambardello, Joseph A. [http://www.accessmylibrary.com/coms2/summary_0286-5763528_ITM \"Plutonium Spill Neither Gone Nor Forgotten, 40 Years Later.\"] The Philadelphia Inquirer, 1 June 2000, p. A01. Retrieved: 26 December 2009.  In 2002, the concrete at the site was removed and transported to Lakehurst Naval Air Station for transport by rail to a site for proper disposal.\n\nModification and deactivation\n\nIn 1962, the US Air Force started using modified A-models as drones; following the October 1962 tri-service redesignation of aircraft and weapons systems they became CQM-10As. Otherwise the air defense missile squadrons maintained alert while making regular trips to Santa Rosa Island for training and firing practice. After the inactivation of the 4751st ADW(M) on 1 July 1962 and transfer of Hurlburt to Tactical Air Command for air commando operations the 4751st Air Defense Squadron (Missile) remained at Hurlburt and Santa Rosa Island for training purposes.\n\nIn 1964, the liquid-fueled Bomarc-A sites and squadrons began to be deactivated. The sites at Dow and Suffolk County closed first. The remainder continued to be operational for several more years while the government started dismantling the air defense missile network. Niagara Falls was the first BOMARC B installation to close, in December 1969; the others remained on alert through 1972. In April 1972, the last Bomarc B in U.S. Air Force service was retired at McGuire and the 46th ADMS inactivated  and the base was deactivated.\n\nIn the era of the intercontinental ballistic missiles the Bomarc, designed to intercept relatively slow manned bombers, had become a useless asset. The remaining Bomarc missiles were used by all armed services as high-speed target drones for tests of other air-defense missiles. The Bomarc A and Bomarc B targets were designated as CQM-10A and CQM-10B, respectively.\n\nFollowing the accident, the McGuire complex has never been sold or converted to other uses and remains in Air Force ownership, making it the most intact site of the eight in the US. It has been nominated to the National Register of Historic Sites. Although a number of IM-99/CIM-10 Bomarcs have been placed on public display, because of concerns about the possible environmental hazards of the thoriated magnesium structure of the airframe several have been removed from public view.Young, Gord. [http://www.northbaynugget.ca/ArticleDisplay.aspx?archive\ntrue&e=1750308 \"Cold War relic on the move.\"] North Bay Nugget, 12 September 2009. Retrieved: 24 December 2009.\n\nRuss Sneddon, director of the Air Force Armament Museum, Eglin Air Force Base, Florida provided information about missing CIM-10 exhibit airframe serial 59-2016, one of the museum's original artifacts from its founding in 1975 and donated by the 4751st Air Defense Squadron at Hurlburt Field, Eglin Auxiliary Field 9, Eglin AFB. As of December 2006, the suspect missile was stored in a secure compound behind the Armaments Museum. In December 2010, the airframe was still on premises, but partly dismantled.\n\nCanada\n\nThe Bomarc Missile Program was highly controversial in Canada.\n The Progressive Conservative government of Prime Minister John Diefenbaker initially agreed to deploy the missiles, and shortly thereafter controversially scrapped the Avro Arrow, a supersonic manned interceptor aircraft, arguing that the missile program made the Arrow unnecessary.\n\nInitially, it was unclear whether the missiles would be equipped with nuclear warheads. By 1960 it became known that the missiles were to have a nuclear payload, and a debate ensued about whether Canada should accept nuclear weapons.\n Ultimately, the Diefenbaker government decided that the Bomarcs should not be equipped with nuclear warheads.\n The dispute split the Diefenbaker Cabinet, and led to the collapse of the government in 1963. The Official Opposition and Liberal Party leader Lester B. Pearson originally was against nuclear missiles, but reversed his personal position and argued in favor of accepting nuclear warheads.\n He won the 1963 election, largely on the basis of this issue, and his new Liberal government proceeded to accept nuclear-armed Bomarcs, with the first being deployed on 31 December 1963.\"Special to The Star: Canada's Bomarcs get atom warheads.\" The Toronto Daily Star, 2 January 1964, pp. 1, 4. When the nuclear warheads were deployed, Pearson's wife, Maryon, resigned her honorary membership in the anti-nuclear weapons group, Voice of Women.\n\nCanadian operational deployment of the Bomarc involved the formation of two specialized Surface/Air Missile squadrons. The first to begin operations was No. 446 SAM Squadron at RCAF Station North Bay, Ontario, which was the command and control center for both squadrons. With construction of the compound and related facilities completed in 1961, the squadron received its Bomarcs in 1961, without nuclear warheads. The squadron became fully operational from 31 December 1963, when the nuclear warheads arrived, until disbanding on 31 March 1972. All the warheads were stored separately and under control of Detachment 1 of the USAF 425th Munitions Maintenance Squadron. During operational service, the Bomarcs were maintained on stand-by, on a 24-hour basis, but were never fired, although the squadron test-fired the missiles at Eglin AFB, Florida on annual winter retreats.Nicks et al. 1997, pp. 84–85.\n\nNo. 447 SAM Squadron operating out of RCAF Station La Macaza, Quebec, was activated on 15 September 1962 although warheads were not delivered until late 1963. The squadron followed the same operational procedures as No. 446, its sister squadron. With the passage of time the operational capability of the 1950s-era Bomarc system no longer met modern requirements; the Department of National Defence deemed that the Bomarc missile defense was no longer a viable system, and ordered both squadrons to be stood down in 1972. The bunkers and ancillary facilities remain at both former sites.Nicks et al. 1997, pp. 85–87.\n\nVariants\n\n* XF-99 (experimental for booster research)\n* XF-99A/XIM-99A (experimental for ramjet research)\n* YF-99/YIM-99 (service-test)\n* IM-99A (initial production)\n* IM-99B (\"advanced\"\"IM-99A Bases Manual\". Boeing: Pilotless Aircraft Division (Seattle, Washington), 12 March 1959.)\n* CQM-10 (target drone)[http://www.nationalmuseum.af.mil/factsheets/factsheet.asp?id=2376 \"Factsheets : Boeing XF-99.\"]  Nationalmuseum.af.mil. Retrieved: 18 September 2013.\n\nOperators\n\n; / \n*Royal Canadian Air Force from 1955 to 1968 / Canadian Forces from 1968 to 1972\n446 SAM Squadron: 28 IM-99B, CFB North Bay, Ontario 1962–1972[http://www.radomes.org/cgi-bin/museum/acwinfo2x.cgi?site\n%22North+Bay+BOMARC,+ON%22&key=NorthBayBOMARCON \"446 SAM Squadron.\"] radomes.org. Retrieved: 12 September 2010.\n: Bomarc site located at \n447 SAM Squadron: 28 IM-99B, La Macaza, Quebec (La Macaza – Mont Tremblant International Airport)  1962–1972[http://www.radomes.org/cgi-bin/museum/acwinfo2x.cgi?site\n%22La+Macaza+BOMARC,+QC%22&key=LaMacazaBOMARCQC \"447 SAM Squadron.\"] radomes.org. Retrieved: 12 September 2010.\n: Bomarc site located at  (Approximately)\n;\n*United States Air Force Air (later Aerospace) Defense Command\n\n6th Air Defense Missile Squadron, 56 IM-99A\n: Activated on 1 February 1959\n: Assigned to: New York Air Defense Sector\n: Inactivated 15 December 1964\n: Stationed at: Suffolk County Air Force Base Missile Annex, New York\n:: Bomarc site located 3 miles SW at \n\n22d Air Defense Missile Squadron: 28 IM-99A/28 IM-99B\n: Activated on 15 September 1959\n: Assigned to: Washington Air Defense Sector\n: Reassigned to: 33d Air Division, 1 April 1966\n: Reassigned to: 20th Air Division, 19 November 1969\n: Inactivated: 31 October 1972\n: Stationed at: Langley AFB, Virginia\n:: Bomarc site located 3 miles WNW at \n\n26th Air Defense Missile Squadron: 28 IM-99A/28 IM-99B\n: Activated 1 March 1959\n: Assigned to: Boston Air Defense Sector\n: Reassigned to: 35th Air Division, 1 April 1966\n: Reassigned to:  21st Air Division, 19 November 1969\n: Inactivated: 30 April 1972\n: Stationed at: Otis Air Force Base BOMARC site, Massachusetts\n:: Bomarc site located 1 mile NNW at \n\n30th Air Defense Missile Squadron: 28 IM-99A\n: Activated on 1 June 1959\n: Assigned to Bangor Air Defense Sector\n: Inactivated: 15 December 1964\n: Stationed at Dow AFB, Maine\n:: Bomarc site located 4 mils NNE at \n\n35th Air Defense Missile Squadron: 56 IM-99B\n: Activated 1 June 1960\n: Assigned to Syracuse Air Defense Sector\n: Reassigned to: Detroit Air Defense Sector, 4 September 1963\n: Reassigned to: 34th Air Division, 1 April 1966\n: Reassigned to: 35th Air Division, 15 September 1969\n: Inactivated: 31 December 1969\n: Stationed at: Niagara Falls Air Force Missile Site, New York\n:: Bomarc site located at \n\n37th Air Defense Missile Squadron: 28 IM-99B\n: Activated 1 March 1960\n: Assigned to 30th Air Division\n: Reassigned to: Sault Sainte Marie Air Defense Sector, 1 April 1960\n: Reassigned to: Duluth Air Defense Sector, 1 October 1963\n: Reassigned to: 29th Air Division, 1 April 1966\n: Reassigned to:  23d Air Division, 19 November 1969\n: Inactivated 31 July 1972\n: Stationed at: Kincheloe AFB, Michigan\n:: Bomarc site located 9 miles NW at \n\n46th Air Defense Missile Squadron: 28 IM-99A/56 IM-99B\n: Activated 1 January 1959\n: Assigned to New York Air Defense Sector\n: Reassigned to: 21st Air Division, 1 April 1966\n: Reassigned to: 35th Air Division, 1 December 1957\n: Reassigned to: 21st Air Division, 19 November 1969\n: Inactivated 31 October 1972\n: Stationed at: McGuire AFB, New Jersey\n:: Bomarc site located 4 miles ESE at \n\n74th Air Defense Missile Squadron: 28 IM-99B\n: Activated 1 April 1960\n: Assigned to Duluth Air Defense Sector\n: Reassigned to: 29th Air Division, 1 April 1966\n: Reassigned to: 23d Air Division, 19 November 1969\n: Inactivated 30 April 1972\n: Stationed at: Duluth International Airport, Minnesota\n:: Bomarc site located 10 miles NE at \n\n4751st Air Defense Missile Squadron\n: Activated 15 January 1959\n: Assigned to 73d Air Division (Weapons)\n: Reassigned to: 32d Air Division, 1 October 1959\n: Reassigned to: Montgomery Air Defense Sector, 1 July 1962\n: Reassigned to:  Air Defense, Tactical Air Command, 1 September 1979\n: Inactivated 30 September 1979\n: Stationed at: Eglin Auxiliary Field #9 (Hurlburt Field), Florida\n:: Bomarc site located on Santa Rosa Island at \n:: Bomarc site located at Eglin Auxiliary Field #5 (Piccolo Field) at \n\n* Air Force Systems Command\n: Cape Canaveral Air Force Station, Florida\n:: Launch Complex 4 (LC-4) was used for Bomarc testing and development launches 2 February 1956 – 15 April 1960 (17 Launches).  \n: Vandenberg Air Force Base, California\n:: Two launch sites, BOM-1 and BOM-2 were used by the United States Navy for Bomarc launches against aerial targets.  The first launch taking place on 25 August 1966. The last two launches occurred on 14 July 1982. BOM1 49 launches; BOM2 38 launches. \n\nLocations under construction but not activated. Each site was programmed for 28 IM-99B missiles:\n* Camp Adair, Oregon \n* Charleston AFB, South Carolina\n* Ethan Allen AFB, Vermont \n* Paine Field, Washington \n* Travis AFB, California \n* Truax Field, Wisconsin \n* Vandenberg AFB, California \n\nReference for BOMARC units and locations:[http://www.radomes.org/museum/bomarc.html \"Bomarc Missile Sites.\"] radomes.org. Retrieved: 26 December 2009.\n\nFile:6th Air Defense Missile Squadron - ADC - Emblem.png|6th ADMS\nFile:22d Air Defense Missile Squadron - ADC - Emblem.png|22d ADMS\nFile:26th Air Defense Missile Squadron - ADC - Emblem.png|26th ADMS\nFile:30th Air Defense Missile Squadron - ADC - Emblem.png|30th ADMS\nFile:35th Air Defense Missile Squadron - ADC - Emblem.png|35th ADMS\nFile:37th Air Defense Missile Squadron - ADC - Emblem.png|37th ADMS\nFile:46th Air Defense Missile Squadron - ADC - Emblem.png|46th ADMS\nFile:74th Air Defense Missile Squadron - ADC - Emblem.png|74th ADMS\nFile:4751st_Air_Defense_Squadron_-_ADC_-_Emblem.png|4751st ADMS\nFile:Rcaf 446 squadorn BOMARC.png|RCAF 446 Sqdn\nFile:Rcaf 447 squadorn BOMARC.png|RCAF 447 Squdn\n\nSurviving missiles\n\nBelow is a list of museums or sites which have a Bomarc missile on display:\n* Air Force Armament Museum, Eglin Air Force Base, Florida\n* Air Force Space & Missile Museum, Cape Canaveral Air Force Station, Florida.  This pristine artifact is in sequestered storage in Hangar R on Cape Canaveral AFS and cannot be viewed by the general public.\n* Alberta Aviation Museum, Edmonton, Alberta, Canada\n* Canada Aviation and Space Museum, Ottawa, Ontario, Canada\n* Hill Aerospace Museum, Hill Air Force Base, Utah\n* Historical Electronics Museum, Linthicum, Maryland (display of AN/DPN-53, the first airborne pulse-doppler radar, used in the Bomarc)\n* Illinois Soldiers & Sailors Home, Quincy, Illinois\n* Keesler Air Force Base, Biloxi, Mississippi\n* Museum of Aviation, Robins Air Force Base, Warner Robins, Georgia\n* National Museum of Nuclear Science & History, Kirtland Air Force Base, Albuquerque, New Mexico\n* National Museum of the United States Air Force, Wright-Patterson Air Force Base, Ohio[http://www.nationalmuseum.af.mil/Visit/MuseumExhibits/FactSheets/Display/tabid/509/Article/198024/boeing-cim-10-bomarc.aspx \"Boeing CIM-10 Bomarc.\"] National Museum of the US Air Force. Retrieved: 22 August 2015\n* Octave Chanute Aerospace Museum (former Chanute Air Force Base), Rantoul, Illinois\n* Peterson Air and Space Museum, Peterson Air Force Base, Colorado\n* Strategic Air and Space Museum, Ashland, Nebraska\n* U.S. Air Force History and Traditions Museum, Lackland Air Force Base, San Antonio, Texas\n* Vandenberg Air Force Base (Space and Missile Heritage Center), California. Bomarc not for public access. CIM-10 Bomarc. http://en.wikipedia.org/?curid=4130."
  }
}
