{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=5306",
  "eid" : "d3c32230-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778435027,
  "textBody" : "In a chemical reaction, chemical equilibrium is the state in which both reactants and products are present in concentrations which have no further tendency to change with time. Usually, this state results when the forward reaction proceeds at the same rate as the reverse reaction. The reaction rates of the forward and backward reactions are generally not zero, but equal. Thus, there are no net changes in the concentrations of the reactant(s) and product(s). Such a state is known as dynamic equilibrium.\n\nHistorical introduction \n\nThe concept of chemical equilibrium was developed after Berthollet (1803) found that some chemical reactions are reversible. On pp. 404–407, Berthellot mentions that when he accompanied Napoleon on his expedition to Egypt, he (Berthellot) visited Lake Natron and found sodium carbonate along its shores.  He realized that this was a product of the reverse of the usual reaction Na2CO3 + CaCl2 → 2NaCl + CaCO3↓ and therefore that the final state of a reaction was a state of equilibrium between two opposing processes.  From p. 405: \" … la décomposition du muriate de soude continue donc jusqu'à ce qu'il se soit formé assez de muriate de chaux, parce que l'acide muriatique devant se partager entre les deux bases en raison de leur action, il arrive un terme où leurs forces se balancent.\" ( … the decomposition of the sodium chloride thus continues until enough calcium chloride is formed, because the hydrochloric acid must be shared between the two bases in the ratio of their action [i.e., capacity to react]; it reaches an end [point] at which their forces are balanced.) For any reaction mixture to exist at equilibrium, the rates of the forward and backward (reverse) reactions are equal. In the following chemical equation with arrows pointing both ways to indicate equilibrium,The notation \\rightleftarrows was proposed in 1884 by the Dutch chemist Jacobus Henricus van 't Hoff. See:  Van 't Hoff called reactions that didn't proceed to completion \"limited reactions\".  From pp. 4–5:  \"Or M. Pfaundler a relié ces deux phénomênes … s'accomplit en même temps dans deux sens opposés.\" (Now Mr. Pfaundler has joined these two phenomena in a single concept by considering the observed limit as the result of two opposing reactions, driving the one in the example cited to the formation of sea salt [i.e., NaCl] and nitric acid, [and] the other to hydrochloric acid and sodium nitrate.  This consideration, which experiment validates, justifies the expression \"chemical equilibrium\", which is used to characterize the final state of limited reactions.  I would propose to translate this expression by the following symbol:  \nHCl + NO3 Na  \\rightleftarrows  NO3 H + Cl Na . \nI thus replace, in this case, the = sign in the chemical equation by the sign \\rightleftarrows, which in reality doesn't express just equality but shows also the direction of the reaction.  This clearly expresses that a chemical action occurs simultaneously in two opposing directions.) A and B are reactant chemical species, S and T are product species, and α, β, σ, and τ are the stoichiometric coefficients of the respective reactants and products:\nα A + β B  σ S + τ T\n\nThe equilibrium concentration position of a reaction is said to lie \"far to the right\" if, at equilibrium, nearly all the reactants are consumed. Conversely the equilibrium position is said to be \"far to the left\" if hardly any product is formed from the reactants.\n\nGuldberg and Waage (1865), building on Berthollet’s ideas, proposed the law of mass action:\n\n\\mbox{forward reaction rate} = k_{+} \\mathrm{A}^\\alpha\\mathrm{B}^\\beta \\,\\!\n\\mbox{backward reaction rate} = k_{-} \\mathrm{S}^\\sigma\\mathrm{T}^\\tau \\,\\!\n\nwhere A, B, S and T are active masses and k+ and k− are rate constants. Since at equilibrium forward and backward rates are equal:\n\n k_+ \\left\\{ \\mathrm A \\right\\}^\\alpha \\left\\{\\mathrm B \\right\\}^\\beta = k_{-} \\left\\{\\mathrm S \\right\\}^\\sigma\\left\\{\\mathrm T \\right\\}^\\tau \\,\n\nand the ratio of the rate constants is also a constant, now known as an equilibrium constant.\nK_c\\frac{k_+}{k_-}\n\\frac{\\{\\mathrm S\\}^\\sigma \\{\\mathrm T\\}^\\tau } {\\{\\mathrm A\\}^\\alpha \\{\\mathrm B\\}^\\beta}\n\nBy convention the products form the numerator.\nHowever, the law of mass action is valid only for concerted one-step reactions that proceed through a single transition state and is not valid in general because rate equations do not, in general, follow the stoichiometry of the reaction as Guldberg and Waage had proposed (see, for example, nucleophilic aliphatic substitution by SN1 or reaction of hydrogen and bromine to form hydrogen bromide). Equality of forward and backward reaction rates, however, is a necessary condition for chemical equilibrium, though it is not sufficient to explain why equilibrium occurs.\n\nDespite the failure of this derivation, the equilibrium constant for a reaction is indeed a constant, independent of the activities of the various species involved, though it does depend on temperature as observed by the van 't Hoff equation. Adding a catalyst will affect both the forward reaction and the reverse reaction in the same way and will not have an effect on the equilibrium constant. The catalyst will speed up both reactions thereby increasing the speed at which equilibrium is reached.\n\nAlthough the macroscopic equilibrium concentrations are constant in time, reactions do occur at the molecular level. For example, in the case of acetic acid dissolved in water and forming acetate and hydronium ions,\nCH3CO2H + H2O ⇌  + H3O+\na proton may hop from one molecule of acetic acid on to a water molecule and then on to an acetate anion to form another molecule of acetic acid and leaving the number of acetic acid molecules unchanged. This is an example of dynamic equilibrium. Equilibria, like the rest of thermodynamics, are statistical phenomena, averages of microscopic behavior.\n\nLe Châtelier's principle (1884) gives an idea of the behavior of an equilibrium system when changes to its reaction conditions occur. If a dynamic equilibrium is disturbed by changing the conditions, the position of equilibrium moves to partially reverse the change. For example, adding more S from the outside will cause an excess of products, and the system will try to counteract this by increasing the reverse reaction and pushing the equilibrium point backward (though the equilibrium constant will stay the same).\n\nIf mineral acid is added to the acetic acid mixture, increasing the concentration of hydronium ion, the amount of dissociation must decrease as the reaction is driven to the left in accordance with this principle. This can also be deduced from the equilibrium constant expression for the reaction:\nK=\\frac \\ce{\\{CH3CO2^-\\}\\{H3O+\\}} \\ce{\\{CH3CO2H\\}}\nIf {H3O+} increases {CH3CO2H} must increase and  must decrease. The H2O is left out, as it is the solvent and its concentration remains high and nearly constant.\n\nA quantitative version is given by the reaction quotient.\n\nJ. W. Gibbs suggested in 1873 that equilibrium is attained when the Gibbs free energy of the system is at its minimum value (assuming the reaction is carried out at constant temperature and pressure). What this means is that the derivative of the Gibbs energy with respect to reaction coordinate (a measure of the extent of reaction that has occurred, ranging from zero for all reactants to a maximum for all products) vanishes, signalling a stationary point. This derivative is called the reaction Gibbs energy (or energy change) and corresponds to the difference between the chemical potentials of reactants and products at the composition of the reaction mixture. This criterion is both necessary and sufficient. If a mixture is not at equilibrium, the liberation of the excess Gibbs energy (or Helmholtz energy at constant volume reactions) is the \"driving force\" for the composition of the mixture to change until equilibrium is reached. The equilibrium constant can be related to the standard Gibbs free energy change for the reaction by the equation\n\n\\Delta_rG^\\ominus = -RT \\ln K_\\mathrm{eq}\n\nwhere R is the universal gas constant and T the temperature.\n\nWhen the reactants are dissolved in a medium of high ionic strength the quotient of activity coefficients may be taken to be constant. In that case the concentration quotient, Kc,\nK_\\mathrm{c}=\\frac{[\\mathrm S]^\\sigma [\\mathrm T]^\\tau } {[\\mathrm A]^\\alpha [\\mathrm B]^\\beta}\nwhere [A] is the concentration of A, etc., is independent of the analytical concentration of the reactants. For this reason, equilibrium constants for solutions are usually determined in media of high ionic strength. Kc varies with ionic strength, temperature and pressure (or volume). Likewise Kp for gases depends on partial pressure. These constants are easier to measure and encountered in high-school chemistry courses.\n\nThermodynamics\n\nAt constant temperature and pressure, one must consider the Gibbs free energy, G, while at constant temperature and volume, one must consider the Helmholtz free energy: A, for the reaction; and at constant internal energy and volume, one must consider the entropy for the reaction: S.\n\nThe constant volume case is important in geochemistry and atmospheric chemistry where pressure variations are significant. Note that, if reactants and products were in standard state (completely pure), then there would be no reversibility and no equilibrium. Indeed, they would necessarily occupy disjoint volumes of space. The mixing of the products and reactants contributes a large entropy (known as entropy of mixing) to states containing equal mixture of products and reactants. The standard Gibbs energy change, together with the Gibbs energy of mixing, determine the equilibrium state.\n\nIn this article only the constant pressure case is considered. The relation between the Gibbs free energy and the equilibrium constant can be found by considering chemical potentials.\n\nAt constant temperature and pressure, the Gibbs free energy, G, for the reaction depends only on the extent of reaction: ξ (Greek letter xi), and can only decrease according to the second law of thermodynamics. It means that the derivative of G with ξ must be negative if the reaction happens; at the equilibrium the derivative being equal to zero.\n\\left(\\frac {dG}{d\\xi}\\right)_{T,p} = 0~:equilibrium\n\nIn order to meet the thermodynamic condition for equilibrium, the Gibbs energy must be stationary, meaning that the derivative of G with respect to the extent of reaction: ξ, must be zero. It can be shown that in this case, the sum of chemical potentials of the products is equal to the sum of those corresponding to the reactants. Therefore, the sum of the Gibbs energies of the reactants must be the equal to the sum of the Gibbs energies of the products.\n \\alpha \\mu_\\mathrm{A} + \\beta \\mu_\\mathrm{B} = \\sigma \\mu_\\mathrm{S} + \\tau \\mu_\\mathrm{T} \\,\n\nwhere μ is in this case a partial molar Gibbs energy, a chemical potential. The chemical potential of a reagent A is a function of the activity, {A} of that reagent.\n\n \\mu_\\mathrm{A} = \\mu_{A}^{\\ominus} + RT \\ln\\{\\mathrm{A}\\} \\,\n(where μ is the standard chemical potential).\n\nThe definition of the Gibbs energy equation interacts with the fundamental thermodynamic relation to produce\n\n dG Vdp-SdT+\\sum_{i\n1}^k \\mu_i dN_i .\n\nInserting dNi = νi dξ into the above equation gives a Stoichiometric coefficient ( \\nu_i~) and a differential that denotes the reaction occurring once (dξ). At constant pressure and temperature the above equations can be written as\n\n\\left(\\frac {dG}{d\\xi}\\right)_{T,p} \\sum_{i\n1}^k \\mu_i \\nu_i = \\Delta_\\mathrm{r}G_{T,p} which is the \"Gibbs free energy change for the reaction .\n\nThis results in:\n\n \\Delta_\\mathrm{r}G_{T,p} = \\sigma \\mu_\\mathrm{S} + \\tau \\mu_\\mathrm{T} - \\alpha \\mu_\\mathrm{A} - \\beta \\mu_\\mathrm{B} \\,.\n\nBy substituting the chemical potentials:\n\n \\Delta_\\mathrm{r}G_{T,p} = ( \\sigma \\mu_\\mathrm{S}^{\\ominus} + \\tau \\mu_\\mathrm{T}^{\\ominus} ) - ( \\alpha \\mu_\\mathrm{A}^{\\ominus} + \\beta \\mu_\\mathrm{B}^{\\ominus} ) + ( \\sigma RT \\ln\\{\\mathrm{S}\\} + \\tau RT \\ln\\{\\mathrm{T}\\} ) - ( \\alpha RT \\ln\\{\\mathrm{A}\\} + \\beta RT \\ln \\{\\mathrm{B}\\} ) ,\n\nthe relationship becomes:\n\n \\Delta_\\mathrm{r}G_{T,p}\\sum_{i\n1}^k \\mu_i^\\ominus \\nu_i + RT \\ln \\frac{\\{\\mathrm{S}\\}^\\sigma \\{\\mathrm{T}\\}^\\tau} {\\{\\mathrm{A}\\}^\\alpha \\{\\mathrm{B}\\}^\\beta} \n\\sum_{i1}^k \\mu_i^\\ominus \\nu_i \n \\Delta_\\mathrm{r}G^{\\ominus}:\nwhich is the standard Gibbs energy change for the reaction that can be calculated using thermodynamical tables.\nThe reaction quotient is defined as:\n Q_\\mathrm{r} =  \\frac{\\{\\mathrm{S}\\}^\\sigma \\{\\mathrm{T}\\}^\\tau} {\\{\\mathrm{A}\\}^\\alpha \\{\\mathrm{B}\\}^\\beta}  \n\nTherefore,\n\\left(\\frac {dG}{d\\xi}\\right)_{T,p} \\Delta_\\mathrm{r}G_{T,p}\n \\Delta_\\mathrm{r}G^{\\ominus} + RT \\ln Q_\\mathrm{r} \n\nAt equilibrium:\n\\left(\\frac {dG}{d\\xi}\\right)_{T,p} \\Delta_\\mathrm{r}G_{T,p} \n 0 \n\nleading to:\n\n 0 = \\Delta_\\mathrm{r}G^{\\ominus} + RT \\ln K_\\mathrm{eq} \nand\n \\Delta_\\mathrm{r}G^{\\ominus} = -RT \\ln K_\\mathrm{eq} \n\nObtaining the value of the standard Gibbs energy change, allows the calculation of the equilibrium constant.\n\nAddition of reactants or products\n\nFor a reactional system at equilibrium: Qr  Keq; ξ \n ξeq.\n*If are modified activities of constituents, the value of the reaction quotient changes and becomes different from the equilibrium constant: Qr ≠ Keq\n\n:\\left(\\frac {dG}{d\\xi}\\right)_{T,p} = \\Delta_\\mathrm{r}G^{\\ominus} + RT \\ln Q_\\mathrm{r}~\n\nand\n\n:\\Delta_\\mathrm{r}G^{\\ominus} = - RT \\ln K_{eq}~\n\nthen\n\n:\\left(\\frac {dG}{d\\xi}\\right)_{T,p} = RT \\ln \\left(\\frac {Q_\\mathrm{r}}{K_\\mathrm{eq}}\\right)~\n\n*If activity of a reagent i increases\n\n:Q_\\mathrm{r} = \\frac{\\prod (a_j)^{\\nu_j}}{\\prod(a_i)^{\\nu_i}}~, the reaction quotient decreases.\nthen\n\n:Q_\\mathrm{r} and\\left(\\frac {dG}{d\\xi}\\right)_{T,p} \nThe reaction will shift to the right (i.e. in the forward direction, and thus more products will form).\n\n*If activity of a product j increases\nthen\n\n:Q_\\mathrm{r} > K_\\mathrm{eq}~and\\left(\\frac {dG}{d\\xi}\\right)_{T,p} >0~\nThe reaction will shift to the left (i.e. in the reverse direction, and thus less products will form).\n\nNote that activities and equilibrium constants are dimensionless numbers.\n\nTreatment of activity\n\nThe expression for the equilibrium constant can be rewritten as the product of a concentration quotient, Kc and an activity coefficient quotient, Γ.\nK=\\frac{[\\mathrm{S}] ^\\sigma [\\mathrm{T}]^\\tau ... } {[\\mathrm{A}]^\\alpha [\\mathrm{B}]^\\beta ...}\n\\times \\frac ^\\sigma {\\gamma_\\mathrm{T}}^\\tau ... } ^\\alpha {\\gamma_\\mathrm{B}}^\\beta ...} = K_\\mathrm{c} \\Gamma\n\n[A] is the concentration of reagent A, etc. It is possible in principle to obtain values of the activity coefficients, γ. For solutions, equations such as the Debye–Hückel equation or extensions such as Davies equation Specific ion interaction theory or Pitzer equations may be used.Software (below). However this is not always possible. It is common practice to assume that Γ is a constant, and to use the concentration quotient in place of the thermodynamic equilibrium constant. It is also general practice to use the term equilibrium constant instead of the more accurate concentration quotient. This practice will be followed here.\n\nFor reactions in the gas phase partial pressure is used in place of concentration and fugacity coefficient in place of activity coefficient. In the real world, for example, when making ammonia in industry, fugacity coefficients must be taken into account. Fugacity, f, is the product of partial pressure and fugacity coefficient. The chemical potential of a species in the gas phase is given by\n\\mu \\mu^{\\ominus} + RT \\ln \\left( \\frac{f}{\\mathrm{bar}} \\right) \n \\mu^{\\ominus} + RT \\ln \\left( \\frac{p}{\\mathrm{bar}} \\right) + RT \\ln \\gamma \nso the general expression defining an equilibrium constant is valid for both solution and gas phases.\n\nConcentration quotients\n\nIn aqueous solution, equilibrium constants are usually determined in the presence of an \"inert\" electrolyte such as sodium nitrate NaNO3 or potassium perchlorate KClO4. The ionic strength of a solution is given by\n I \\frac12\\sum_{i\n1}^N c_i z_i^2 \nwhere ci and zi stand for the concentration and ionic charge of ion type i, and the sum is taken over all the N types of charged species in solution. When the concentration of dissolved salt is much higher than the analytical concentrations of the reagents, the ions originating from the dissolved salt determine the ionic strength, and the ionic strength is effectively constant. Since activity coefficients depend on ionic strength the activity coefficients of the species are effectively independent of concentration. Thus, the assumption that Γ is constant is justified. The concentration quotient is a simple multiple of the equilibrium constant.\n K_\\mathrm{c} = \\frac{K}{\\Gamma} \nHowever, Kc will vary with ionic strength. If it is measured at a series of different ionic strengths the value can be extrapolated to zero ionic strength. The concentration quotient obtained in this manner is known, paradoxically, as a thermodynamic equilibrium constant.\n\nTo use a published value of an equilibrium constant in conditions of ionic strength different from the conditions used in its determination, the value should be adjustedSoftware (below).\n\nMetastable mixtures\n\nA mixture may appear to have no tendency to change, though it is not at equilibrium. For example, a mixture of SO2 and O2 is metastable as there is a kinetic barrier to formation of the product, SO3.\n2 SO2 + O2  2 SO3\n\nThe barrier can be overcome when a catalyst is also present in the mixture as in the contact process, but the catalyst does not affect the equilibrium concentrations.\n\nLikewise, the formation of bicarbonate from carbon dioxide and water is very slow under normal conditions\nCO2 + 2 H2O   + H3O+\nbut almost instantaneous in the presence of the catalytic enzyme carbonic anhydrase.\n\nPure substances\n\nWhen pure substances (liquids or solids) are involved in equilibria their activities do not appear in the equilibrium constant because their numerical values are considered one.\n\nApplying the general formula for an equilibrium constant to the specific case of a dilute solution of acetic acid in water one obtains\nCH3CO2H + H2O  CH3CO2− + H3O+\n\nK_\\mathrm{c}=\\frac \\mathrm{[{CH_3CO_2}^-][{H_3O}^+]} \\mathrm{[{CH_3CO_2H}][{H_2O}]}\n\nFor all but very concentrated solutions, the water can be considered a \"pure\" liquid, and therefore it has an activity of one. The equilibrium constant expression is therefore usually written as\nK\\frac \\mathrm{[{CH_3CO_2}^-][{H_3O}^+]} \\mathrm{[{CH_3CO_2H}]} \n K_\\mathrm{c}.\n\nA particular case is the self-ionization of water itself\n\n2 H2O  H3O+ + OH−\n\nBecause water is the solvent, and has an activity of one, the self-ionization constant of water is defined as\n\nK_\\mathrm{w} = \\mathrm{[H^+][OH^-]}\n\nIt is perfectly legitimate to write [H+] for the hydronium ion concentration, since the state of solvation of the proton is constant (in dilute solutions) and so does not affect the equilibrium concentrations. Kw varies with variation in ionic strength and/or temperature.\n\nThe concentrations of H+ and OH− are not independent quantities. Most commonly [OH−] is replaced by Kw[H+]−1 in equilibrium constant expressions which would otherwise include  hydroxide ion.\n\nSolids also do not appear in the equilibrium constant expression, if they are considered to be pure and thus their activities taken to be one. An example is the Boudouard reaction:\n\n2 CO  CO2 + C\n\nfor which the equation (without solid carbon) is written as:\n\nK_\\mathrm{c}=\\frac \\mathrm{[CO_2]} \\mathrm{[CO]^2}\n\nMultiple equilibria\n\nConsider the case of a dibasic acid H2A. When dissolved in water, the mixture will contain H2A, HA− and A2−. This equilibrium can be split into two steps in each of which one proton is liberated.\n\\begin{array}{rl}\n\\ce{H2A <> {HA^-} + {H+}} : & K_1\n\\frac \\ce{[HA-][H+]} \\ce{[H2A]} \\\\\n\\ce{HA- <> {A^{2-}} + {H+}} : & K_2\n\\frac \\ce{[A^{2-}][H+]} \\ce{[HA-]}\n\\end{array}\nK1 and K2 are examples of stepwise equilibrium constants. The overall equilibrium constant, βD, is product of the stepwise constants.\n{H2A} <> {A^{2-}} + {2H+}:\\beta_\\ce{D} \n \\frac \\ce{[A^{2-}][H^+]^2} \\ce{[H_2A]}=K_1K_2\nNote that these constants are dissociation constants because the products on the right hand side of the equilibrium expression are dissociation products. In many systems, it is preferable to use association constants.\n\\begin{array}{ll}\n\\ce + {H+} <> HA-}:&\\beta_1\n\\frac \\ce{[HA^-]} \\ce{[A^{2-}][H+]} \\\\\n\\ce + {2H+} <> H2A}:&\\beta_2\n\\frac \\ce{[H2A]} \\ce{[A^{2-}][H+]^2}\n\\end{array}\nβ1 and β2 are examples of association constants. Clearly  and ;  and \nFor multiple equilibrium systems, also see: theory of Response reactions.\n\nEffect of temperature\n\nThe effect of changing temperature on an equilibrium constant is given by the van 't Hoff equation\n\\frac {d\\ln K} {dT} = \\frac{\\Delta H_\\mathrm{m}^\\ominus} {RT^2}\nThus, for exothermic reactions (ΔH is negative), K decreases with an increase in temperature, but, for endothermic reactions, (ΔH is positive) K increases with an increase temperature. An alternative formulation is\n\\frac {d\\ln K} {d(T^{-1})} = -\\frac{\\Delta H_\\mathrm{m}^\\ominus} {R}\nAt first sight this appears to offer a means of obtaining the standard molar enthalpy of the reaction by studying the variation of K with temperature. In practice, however, the method is unreliable because error propagation almost always gives very large errors on the values calculated in this way.\n\nEffect of electric and magnetic fields\n\nThe effect of electric field on equilibrium has been studied by Manfred Eigen among others.\n\nTypes of equilibrium\n\n* In the gas phase: rocket engines\n* The industrial synthesis such as ammonia in the Haber–Bosch process (depicted right) takes place through a succession of equilibrium steps including adsorption processes\n* Atmospheric chemistry\n* Seawater and other natural waters: chemical oceanography\n* Distribution between two phases\n** log D distribution coefficient: important for pharmaceuticals where lipophilicity is a significant property of a drug\n** Liquid–liquid extraction, Ion exchange, Chromatography\n** Solubility product\n** Uptake and release of oxygen by hemoglobin in blood\n* Acid–base equilibria: acid dissociation constant, hydrolysis, buffer solutions, indicators, acid–base homeostasis\n* Metal–ligand complexation: sequestering agents, chelation therapy, MRI contrast reagents, Schlenk equilibrium\n* Adduct formation: host–guest chemistry, supramolecular chemistry, molecular recognition, dinitrogen tetroxide\n* In certain oscillating reactions, the approach to equilibrium is not asymptotically but in the form of a damped oscillation .\n* The related Nernst equation in electrochemistry gives the difference in electrode potential as a function of redox concentrations.\n* When molecules on each side of the equilibrium are able to further react irreversibly in secondary reactions, the final product ratio is determined according to the Curtin–Hammett principle.\n\nIn these applications, terms such as stability constant, formation constant, binding constant, affinity constant, association/dissociation constant are used. In biochemistry, it is common to give units for binding constants, which serve to define the concentration units used when the constant’s value was determined.\n\nComposition of a mixture\n\nWhen the only equilibrium is that of the formation of a 1:1 adduct as the composition of a mixture, there are any number of ways that the composition of a mixture can be calculated. For example, see ICE table for a traditional method of calculating the pH of a solution of a weak acid.\n\nThere are three approaches to the general calculation of the composition of a mixture at equilibrium.\n\n#The most basic approach is to manipulate the various equilibrium constants until the desired concentrations are expressed in terms of measured equilibrium constants (equivalent to measuring chemical potentials) and initial conditions.\n#Minimize the Gibbs energy of the system.\n# Satisfy the equation of mass balance. The equations of mass balance are simply statements that demonstrate that the total concentration of each reactant must be constant by the law of conservation of mass.\n\nMass-balance equations\n\nIn general, the calculations are rather complicated or complex. For instance, in the case of a dibasic acid, H2A dissolved in water the two reactants can be specified as the conjugate base, A2−, and the proton, H+. The following equations of mass-balance could apply equally well to a base such as 1,2-diaminoethane, in which case the base itself is designated as the reactant A:\nT_\\mathrm{A} = \\mathrm{[A] + [HA] +[H_2A]} \\,\nT_\\mathrm{H} = \\mathrm{[H] + [HA] + 2[H_2A] - [OH]} \\,\n\nWith TA the total concentration of species A. Note that it is customary to omit the ionic charges when writing and using these equations.\n\nWhen the equilibrium constants are known and the total concentrations are specified there are two equations in two unknown \"free concentrations\" [A] and [H]. This follows from the fact that [HA]  β1[A][H], [H2A] \n β2[A][H]2 and [OH] = Kw[H]−1\n\n T_\\mathrm{A} = \\mathrm{[A]} + \\beta_1\\mathrm{[A][H]} + \\beta_2\\mathrm{[A][H]}^2 \\,\n T_\\mathrm{H} = \\mathrm{[H]} + \\beta_1\\mathrm{[A][H]} + 2\\beta_2\\mathrm{[A][H]}^2 - K_w[\\mathrm H]^{-1} \\,\n\nso the concentrations of the \"complexes\" are calculated from the free concentrations and the equilibrium constants.\nGeneral expressions applicable to all systems with two reagents, A and B would be\nT_\\mathrm{A}=[\\mathrm A]+\\sum_i p_i \\beta_i[\\mathrm A]^{p_i}[\\mathrm B]^{q_i}\nT_\\mathrm{B}=[\\mathrm B]+\\sum_i q_i \\beta_i[\\mathrm A]^{p_i}[\\mathrm B]^{q_i}\n\nIt is easy to see how this can be extended to three or more reagents.\n\nPolybasic acids\n\nThe composition of solutions containing reactants A and H is easy to calculate as a function of p[H]. When [H] is known, the free concentration [A] is calculated from the mass-balance equation in A.\n\nThe diagram alongside, shows an example of the hydrolysis of the aluminium Lewis acid Al3+(aq)The diagram was created with the program [http://www.hyperquad.co.uk/hyss.htm HySS] shows the species concentrations for a 5 × 10−6 M solution of an aluminium salt as a function of pH. Each concentration is shown as a percentage of the total aluminium.\n\nSolution and precipitation\n\nThe diagram above illustrates the point that a precipitate that is not one of the main species in the solution equilibrium may be formed. At pH just below 5.5 the main species present in a 5 μM solution of Al3+ are aluminium hydroxides Al(OH)2+,  and , but on raising the pH Al(OH)3 precipitates from the solution. This occurs because Al(OH)3 has a very large lattice energy. As the pH rises more and more Al(OH)3 comes out of solution. This is an example of Le Châtelier's principle in action: Increasing the concentration of the hydroxide ion causes more aluminium hydroxide to precipitate, which removes hydroxide from the solution. When the hydroxide concentration becomes sufficiently high the soluble aluminate, , is formed.\n\nAnother common instance where precipitation occurs is when a metal cation interacts with an anionic ligand to form an electrically neutral complex. If the complex is hydrophobic, it will precipitate out of water. This occurs with the nickel ion Ni2+ and dimethylglyoxime, (dmgH2): in this case the lattice energy of the solid is not particularly large, but it greatly exceeds the energy of solvation of the molecule Ni(dmgH)2.\n\nMinimization of Gibbs energy\n\nAt equilibrium, at a specified temperature and pressure, the Gibbs energy G is at a minimum:\n\ndG\\sum_{j\n1}^m \\mu_j\\,dN_j = 0\n\nFor a closed system, no particles may enter or leave, although they may combine in various ways. The total number of atoms of each element will remain constant. This means that the minimization above must be subjected to the constraints:\n\n\\sum_{j1}^m a_{ij}N_j\nb_i^0\n\nwhere aij is the number of atoms of element i in molecule j and b is the total number of atoms of element i, which is a constant, since the system is closed. If there are a total of k types of atoms in the system, then there will be k such equations. If ions are involved, an additional row is added to the aij matrix specifying the respective charge on each molecule which will sum to zero.\n\nThis is a standard problem in optimisation, known as constrained minimisation. The most common method of solving it is using the method of Lagrange multipliers, also known as undetermined multipliers (though other methods may be used).\n\nDefine:\n\n\\mathcal{G}G + \\sum_{i\n1}^k\\lambda_i\\left(\\sum_{j1}^m a_{ij}N_j-b_i^0\\right)\n0\n\nwhere the λi are the Lagrange multipliers, one for each element. This allows each of the Nj and λj to be treated independently, and it can be shown using the tools of multivariate calculus that the equilibrium condition is given by\n\n0 \\frac{\\partial \\mathcal{G}}{\\partial N_j} \n \\mu_j + \\sum_{i=1}^k \\lambda_i a_{ij} \n0 \\frac{\\partial \\mathcal{G}}{\\partial \\lambda_i} \n \\sum_{j=1}^m a_{ij}N_j-b_i^0\n\n(For proof see Lagrange multipliers.) This is a set of (m + k) equations in (m + k) unknowns (the Nj and the λi) and may, therefore, be solved for the equilibrium concentrations Nj as long as the chemical potentials are known as functions of the concentrations at the given temperature and pressure. (See Thermodynamic databases for pure substances.) Note that the second equation is just the initial constraints for minimization.\n\nThis method of calculating equilibrium chemical concentrations is useful for systems with a large number of different molecules. The use of k atomic element conservation equations for the mass constraint is straightforward, and replaces the use of the stoichiometric coefficient equations.. The results are consistent with those specified by chemical equations. For example, if equilibrium is specified by a single chemical equation: ,\n\n\\sum_{j0}^m \\nu_j R_j\n0\n\nwhere νj is the stochiometric coefficient for the j th molecule (negative for reactants, positive for products) and Rj is the symbol for the j th molecule, a properly balanced equation will obey:\n\n\\sum_{j1}^m a_{ij} \\nu_j \n0\n\nMultiplying the first equilibrium condition by νj yields\n\n0 \\sum_{j\n1}^m \\nu_j \\mu_j +  \\sum_{j1}^m \\sum_{i\n1}^k \\nu_j \\lambda_i a_{ij} \\sum_{j\n1}^m \\nu_j \\mu_j   \n\nAs above, defining ΔG\n\n\\Delta G\\sum_{j\n1}^m \\nu_j \\mu_j \\sum_{j\n1}^m \\nu_j (\\mu_j^{\\ominus} + RT \\ln(\\{R_j\\})) \\Delta G^{\\ominus} + RT \\ln\\left(\\prod_{j\n1}^m \\{R_j\\}^{\\nu_j}\\right) =  \\Delta G^{\\ominus} + RT \\ln(Q_r)\n\nwhich will be zero at equilibrium.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Chemical equilibrium" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=5306" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In a chemical reaction, chemical equilibrium is the state in which both reactants and products are present in concentrations which have no further tendency to change with time. Usually, this state results when the forward reaction proceeds at the same rate as the reverse reaction. The reaction rates of the forward and backward reactions are generally not zero, but equal. Thus, there are no net changes in the concentrations of the reactant(s) and product(s). Such a state is known as dynamic equilibrium.\n\nHistorical introduction \n\nThe concept of chemical equilibrium was developed after Berthollet (1803) found that some chemical reactions are reversible. On pp. 404–407, Berthellot mentions that when he accompanied Napoleon on his expedition to Egypt, he (Berthellot) visited Lake Natron and found sodium carbonate along its shores.  He realized that this was a product of the reverse of the usual reaction Na2CO3 + CaCl2 → 2NaCl + CaCO3↓ and therefore that the final state of a reaction was a state of equilibrium between two opposing processes.  From p. 405: \" … la décomposition du muriate de soude continue donc jusqu'à ce qu'il se soit formé assez de muriate de chaux, parce que l'acide muriatique devant se partager entre les deux bases en raison de leur action, il arrive un terme où leurs forces se balancent.\" ( … the decomposition of the sodium chloride thus continues until enough calcium chloride is formed, because the hydrochloric acid must be shared between the two bases in the ratio of their action [i.e., capacity to react]; it reaches an end [point] at which their forces are balanced.) For any reaction mixture to exist at equilibrium, the rates of the forward and backward (reverse) reactions are equal. In the following chemical equation with arrows pointing both ways to indicate equilibrium,The notation \\rightleftarrows was proposed in 1884 by the Dutch chemist Jacobus Henricus van 't Hoff. See:  Van 't Hoff called reactions that didn't proceed to completion \"limited reactions\".  From pp. 4–5:  \"Or M. Pfaundler a relié ces deux phénomênes … s'accomplit en même temps dans deux sens opposés.\" (Now Mr. Pfaundler has joined these two phenomena in a single concept by considering the observed limit as the result of two opposing reactions, driving the one in the example cited to the formation of sea salt [i.e., NaCl] and nitric acid, [and] the other to hydrochloric acid and sodium nitrate.  This consideration, which experiment validates, justifies the expression \"chemical equilibrium\", which is used to characterize the final state of limited reactions.  I would propose to translate this expression by the following symbol:  \nHCl + NO3 Na  \\rightleftarrows  NO3 H + Cl Na . \nI thus replace, in this case, the = sign in the chemical equation by the sign \\rightleftarrows, which in reality doesn't express just equality but shows also the direction of the reaction.  This clearly expresses that a chemical action occurs simultaneously in two opposing directions.) A and B are reactant chemical species, S and T are product species, and α, β, σ, and τ are the stoichiometric coefficients of the respective reactants and products:\nα A + β B  σ S + τ T\n\nThe equilibrium concentration position of a reaction is said to lie \"far to the right\" if, at equilibrium, nearly all the reactants are consumed. Conversely the equilibrium position is said to be \"far to the left\" if hardly any product is formed from the reactants.\n\nGuldberg and Waage (1865), building on Berthollet’s ideas, proposed the law of mass action:\n\n\\mbox{forward reaction rate} = k_{+} \\mathrm{A}^\\alpha\\mathrm{B}^\\beta \\,\\!\n\\mbox{backward reaction rate} = k_{-} \\mathrm{S}^\\sigma\\mathrm{T}^\\tau \\,\\!\n\nwhere A, B, S and T are active masses and k+ and k− are rate constants. Since at equilibrium forward and backward rates are equal:\n\n k_+ \\left\\{ \\mathrm A \\right\\}^\\alpha \\left\\{\\mathrm B \\right\\}^\\beta = k_{-} \\left\\{\\mathrm S \\right\\}^\\sigma\\left\\{\\mathrm T \\right\\}^\\tau \\,\n\nand the ratio of the rate constants is also a constant, now known as an equilibrium constant.\nK_c\\frac{k_+}{k_-}\n\\frac{\\{\\mathrm S\\}^\\sigma \\{\\mathrm T\\}^\\tau } {\\{\\mathrm A\\}^\\alpha \\{\\mathrm B\\}^\\beta}\n\nBy convention the products form the numerator.\nHowever, the law of mass action is valid only for concerted one-step reactions that proceed through a single transition state and is not valid in general because rate equations do not, in general, follow the stoichiometry of the reaction as Guldberg and Waage had proposed (see, for example, nucleophilic aliphatic substitution by SN1 or reaction of hydrogen and bromine to form hydrogen bromide). Equality of forward and backward reaction rates, however, is a necessary condition for chemical equilibrium, though it is not sufficient to explain why equilibrium occurs.\n\nDespite the failure of this derivation, the equilibrium constant for a reaction is indeed a constant, independent of the activities of the various species involved, though it does depend on temperature as observed by the van 't Hoff equation. Adding a catalyst will affect both the forward reaction and the reverse reaction in the same way and will not have an effect on the equilibrium constant. The catalyst will speed up both reactions thereby increasing the speed at which equilibrium is reached.\n\nAlthough the macroscopic equilibrium concentrations are constant in time, reactions do occur at the molecular level. For example, in the case of acetic acid dissolved in water and forming acetate and hydronium ions,\nCH3CO2H + H2O ⇌  + H3O+\na proton may hop from one molecule of acetic acid on to a water molecule and then on to an acetate anion to form another molecule of acetic acid and leaving the number of acetic acid molecules unchanged. This is an example of dynamic equilibrium. Equilibria, like the rest of thermodynamics, are statistical phenomena, averages of microscopic behavior.\n\nLe Châtelier's principle (1884) gives an idea of the behavior of an equilibrium system when changes to its reaction conditions occur. If a dynamic equilibrium is disturbed by changing the conditions, the position of equilibrium moves to partially reverse the change. For example, adding more S from the outside will cause an excess of products, and the system will try to counteract this by increasing the reverse reaction and pushing the equilibrium point backward (though the equilibrium constant will stay the same).\n\nIf mineral acid is added to the acetic acid mixture, increasing the concentration of hydronium ion, the amount of dissociation must decrease as the reaction is driven to the left in accordance with this principle. This can also be deduced from the equilibrium constant expression for the reaction:\nK=\\frac \\ce{\\{CH3CO2^-\\}\\{H3O+\\}} \\ce{\\{CH3CO2H\\}}\nIf {H3O+} increases {CH3CO2H} must increase and  must decrease. The H2O is left out, as it is the solvent and its concentration remains high and nearly constant.\n\nA quantitative version is given by the reaction quotient.\n\nJ. W. Gibbs suggested in 1873 that equilibrium is attained when the Gibbs free energy of the system is at its minimum value (assuming the reaction is carried out at constant temperature and pressure). What this means is that the derivative of the Gibbs energy with respect to reaction coordinate (a measure of the extent of reaction that has occurred, ranging from zero for all reactants to a maximum for all products) vanishes, signalling a stationary point. This derivative is called the reaction Gibbs energy (or energy change) and corresponds to the difference between the chemical potentials of reactants and products at the composition of the reaction mixture. This criterion is both necessary and sufficient. If a mixture is not at equilibrium, the liberation of the excess Gibbs energy (or Helmholtz energy at constant volume reactions) is the \"driving force\" for the composition of the mixture to change until equilibrium is reached. The equilibrium constant can be related to the standard Gibbs free energy change for the reaction by the equation\n\n\\Delta_rG^\\ominus = -RT \\ln K_\\mathrm{eq}\n\nwhere R is the universal gas constant and T the temperature.\n\nWhen the reactants are dissolved in a medium of high ionic strength the quotient of activity coefficients may be taken to be constant. In that case the concentration quotient, Kc,\nK_\\mathrm{c}=\\frac{[\\mathrm S]^\\sigma [\\mathrm T]^\\tau } {[\\mathrm A]^\\alpha [\\mathrm B]^\\beta}\nwhere [A] is the concentration of A, etc., is independent of the analytical concentration of the reactants. For this reason, equilibrium constants for solutions are usually determined in media of high ionic strength. Kc varies with ionic strength, temperature and pressure (or volume). Likewise Kp for gases depends on partial pressure. These constants are easier to measure and encountered in high-school chemistry courses.\n\nThermodynamics\n\nAt constant temperature and pressure, one must consider the Gibbs free energy, G, while at constant temperature and volume, one must consider the Helmholtz free energy: A, for the reaction; and at constant internal energy and volume, one must consider the entropy for the reaction: S.\n\nThe constant volume case is important in geochemistry and atmospheric chemistry where pressure variations are significant. Note that, if reactants and products were in standard state (completely pure), then there would be no reversibility and no equilibrium. Indeed, they would necessarily occupy disjoint volumes of space. The mixing of the products and reactants contributes a large entropy (known as entropy of mixing) to states containing equal mixture of products and reactants. The standard Gibbs energy change, together with the Gibbs energy of mixing, determine the equilibrium state.\n\nIn this article only the constant pressure case is considered. The relation between the Gibbs free energy and the equilibrium constant can be found by considering chemical potentials.\n\nAt constant temperature and pressure, the Gibbs free energy, G, for the reaction depends only on the extent of reaction: ξ (Greek letter xi), and can only decrease according to the second law of thermodynamics. It means that the derivative of G with ξ must be negative if the reaction happens; at the equilibrium the derivative being equal to zero.\n\\left(\\frac {dG}{d\\xi}\\right)_{T,p} = 0~:equilibrium\n\nIn order to meet the thermodynamic condition for equilibrium, the Gibbs energy must be stationary, meaning that the derivative of G with respect to the extent of reaction: ξ, must be zero. It can be shown that in this case, the sum of chemical potentials of the products is equal to the sum of those corresponding to the reactants. Therefore, the sum of the Gibbs energies of the reactants must be the equal to the sum of the Gibbs energies of the products.\n \\alpha \\mu_\\mathrm{A} + \\beta \\mu_\\mathrm{B} = \\sigma \\mu_\\mathrm{S} + \\tau \\mu_\\mathrm{T} \\,\n\nwhere μ is in this case a partial molar Gibbs energy, a chemical potential. The chemical potential of a reagent A is a function of the activity, {A} of that reagent.\n\n \\mu_\\mathrm{A} = \\mu_{A}^{\\ominus} + RT \\ln\\{\\mathrm{A}\\} \\,\n(where μ is the standard chemical potential).\n\nThe definition of the Gibbs energy equation interacts with the fundamental thermodynamic relation to produce\n\n dG Vdp-SdT+\\sum_{i\n1}^k \\mu_i dN_i .\n\nInserting dNi = νi dξ into the above equation gives a Stoichiometric coefficient ( \\nu_i~) and a differential that denotes the reaction occurring once (dξ). At constant pressure and temperature the above equations can be written as\n\n\\left(\\frac {dG}{d\\xi}\\right)_{T,p} \\sum_{i\n1}^k \\mu_i \\nu_i = \\Delta_\\mathrm{r}G_{T,p} which is the \"Gibbs free energy change for the reaction .\n\nThis results in:\n\n \\Delta_\\mathrm{r}G_{T,p} = \\sigma \\mu_\\mathrm{S} + \\tau \\mu_\\mathrm{T} - \\alpha \\mu_\\mathrm{A} - \\beta \\mu_\\mathrm{B} \\,.\n\nBy substituting the chemical potentials:\n\n \\Delta_\\mathrm{r}G_{T,p} = ( \\sigma \\mu_\\mathrm{S}^{\\ominus} + \\tau \\mu_\\mathrm{T}^{\\ominus} ) - ( \\alpha \\mu_\\mathrm{A}^{\\ominus} + \\beta \\mu_\\mathrm{B}^{\\ominus} ) + ( \\sigma RT \\ln\\{\\mathrm{S}\\} + \\tau RT \\ln\\{\\mathrm{T}\\} ) - ( \\alpha RT \\ln\\{\\mathrm{A}\\} + \\beta RT \\ln \\{\\mathrm{B}\\} ) ,\n\nthe relationship becomes:\n\n \\Delta_\\mathrm{r}G_{T,p}\\sum_{i\n1}^k \\mu_i^\\ominus \\nu_i + RT \\ln \\frac{\\{\\mathrm{S}\\}^\\sigma \\{\\mathrm{T}\\}^\\tau} {\\{\\mathrm{A}\\}^\\alpha \\{\\mathrm{B}\\}^\\beta} \n\\sum_{i1}^k \\mu_i^\\ominus \\nu_i \n \\Delta_\\mathrm{r}G^{\\ominus}:\nwhich is the standard Gibbs energy change for the reaction that can be calculated using thermodynamical tables.\nThe reaction quotient is defined as:\n Q_\\mathrm{r} =  \\frac{\\{\\mathrm{S}\\}^\\sigma \\{\\mathrm{T}\\}^\\tau} {\\{\\mathrm{A}\\}^\\alpha \\{\\mathrm{B}\\}^\\beta}  \n\nTherefore,\n\\left(\\frac {dG}{d\\xi}\\right)_{T,p} \\Delta_\\mathrm{r}G_{T,p}\n \\Delta_\\mathrm{r}G^{\\ominus} + RT \\ln Q_\\mathrm{r} \n\nAt equilibrium:\n\\left(\\frac {dG}{d\\xi}\\right)_{T,p} \\Delta_\\mathrm{r}G_{T,p} \n 0 \n\nleading to:\n\n 0 = \\Delta_\\mathrm{r}G^{\\ominus} + RT \\ln K_\\mathrm{eq} \nand\n \\Delta_\\mathrm{r}G^{\\ominus} = -RT \\ln K_\\mathrm{eq} \n\nObtaining the value of the standard Gibbs energy change, allows the calculation of the equilibrium constant.\n\nAddition of reactants or products\n\nFor a reactional system at equilibrium: Qr  Keq; ξ \n ξeq.\n*If are modified activities of constituents, the value of the reaction quotient changes and becomes different from the equilibrium constant: Qr ≠ Keq\n\n:\\left(\\frac {dG}{d\\xi}\\right)_{T,p} = \\Delta_\\mathrm{r}G^{\\ominus} + RT \\ln Q_\\mathrm{r}~\n\nand\n\n:\\Delta_\\mathrm{r}G^{\\ominus} = - RT \\ln K_{eq}~\n\nthen\n\n:\\left(\\frac {dG}{d\\xi}\\right)_{T,p} = RT \\ln \\left(\\frac {Q_\\mathrm{r}}{K_\\mathrm{eq}}\\right)~\n\n*If activity of a reagent i increases\n\n:Q_\\mathrm{r} = \\frac{\\prod (a_j)^{\\nu_j}}{\\prod(a_i)^{\\nu_i}}~, the reaction quotient decreases.\nthen\n\n:Q_\\mathrm{r} and\\left(\\frac {dG}{d\\xi}\\right)_{T,p} \nThe reaction will shift to the right (i.e. in the forward direction, and thus more products will form).\n\n*If activity of a product j increases\nthen\n\n:Q_\\mathrm{r} > K_\\mathrm{eq}~and\\left(\\frac {dG}{d\\xi}\\right)_{T,p} >0~\nThe reaction will shift to the left (i.e. in the reverse direction, and thus less products will form).\n\nNote that activities and equilibrium constants are dimensionless numbers.\n\nTreatment of activity\n\nThe expression for the equilibrium constant can be rewritten as the product of a concentration quotient, Kc and an activity coefficient quotient, Γ.\nK=\\frac{[\\mathrm{S}] ^\\sigma [\\mathrm{T}]^\\tau ... } {[\\mathrm{A}]^\\alpha [\\mathrm{B}]^\\beta ...}\n\\times \\frac ^\\sigma {\\gamma_\\mathrm{T}}^\\tau ... } ^\\alpha {\\gamma_\\mathrm{B}}^\\beta ...} = K_\\mathrm{c} \\Gamma\n\n[A] is the concentration of reagent A, etc. It is possible in principle to obtain values of the activity coefficients, γ. For solutions, equations such as the Debye–Hückel equation or extensions such as Davies equation Specific ion interaction theory or Pitzer equations may be used.Software (below). However this is not always possible. It is common practice to assume that Γ is a constant, and to use the concentration quotient in place of the thermodynamic equilibrium constant. It is also general practice to use the term equilibrium constant instead of the more accurate concentration quotient. This practice will be followed here.\n\nFor reactions in the gas phase partial pressure is used in place of concentration and fugacity coefficient in place of activity coefficient. In the real world, for example, when making ammonia in industry, fugacity coefficients must be taken into account. Fugacity, f, is the product of partial pressure and fugacity coefficient. The chemical potential of a species in the gas phase is given by\n\\mu \\mu^{\\ominus} + RT \\ln \\left( \\frac{f}{\\mathrm{bar}} \\right) \n \\mu^{\\ominus} + RT \\ln \\left( \\frac{p}{\\mathrm{bar}} \\right) + RT \\ln \\gamma \nso the general expression defining an equilibrium constant is valid for both solution and gas phases.\n\nConcentration quotients\n\nIn aqueous solution, equilibrium constants are usually determined in the presence of an \"inert\" electrolyte such as sodium nitrate NaNO3 or potassium perchlorate KClO4. The ionic strength of a solution is given by\n I \\frac12\\sum_{i\n1}^N c_i z_i^2 \nwhere ci and zi stand for the concentration and ionic charge of ion type i, and the sum is taken over all the N types of charged species in solution. When the concentration of dissolved salt is much higher than the analytical concentrations of the reagents, the ions originating from the dissolved salt determine the ionic strength, and the ionic strength is effectively constant. Since activity coefficients depend on ionic strength the activity coefficients of the species are effectively independent of concentration. Thus, the assumption that Γ is constant is justified. The concentration quotient is a simple multiple of the equilibrium constant.\n K_\\mathrm{c} = \\frac{K}{\\Gamma} \nHowever, Kc will vary with ionic strength. If it is measured at a series of different ionic strengths the value can be extrapolated to zero ionic strength. The concentration quotient obtained in this manner is known, paradoxically, as a thermodynamic equilibrium constant.\n\nTo use a published value of an equilibrium constant in conditions of ionic strength different from the conditions used in its determination, the value should be adjustedSoftware (below).\n\nMetastable mixtures\n\nA mixture may appear to have no tendency to change, though it is not at equilibrium. For example, a mixture of SO2 and O2 is metastable as there is a kinetic barrier to formation of the product, SO3.\n2 SO2 + O2  2 SO3\n\nThe barrier can be overcome when a catalyst is also present in the mixture as in the contact process, but the catalyst does not affect the equilibrium concentrations.\n\nLikewise, the formation of bicarbonate from carbon dioxide and water is very slow under normal conditions\nCO2 + 2 H2O   + H3O+\nbut almost instantaneous in the presence of the catalytic enzyme carbonic anhydrase.\n\nPure substances\n\nWhen pure substances (liquids or solids) are involved in equilibria their activities do not appear in the equilibrium constant because their numerical values are considered one.\n\nApplying the general formula for an equilibrium constant to the specific case of a dilute solution of acetic acid in water one obtains\nCH3CO2H + H2O  CH3CO2− + H3O+\n\nK_\\mathrm{c}=\\frac \\mathrm{[{CH_3CO_2}^-][{H_3O}^+]} \\mathrm{[{CH_3CO_2H}][{H_2O}]}\n\nFor all but very concentrated solutions, the water can be considered a \"pure\" liquid, and therefore it has an activity of one. The equilibrium constant expression is therefore usually written as\nK\\frac \\mathrm{[{CH_3CO_2}^-][{H_3O}^+]} \\mathrm{[{CH_3CO_2H}]} \n K_\\mathrm{c}.\n\nA particular case is the self-ionization of water itself\n\n2 H2O  H3O+ + OH−\n\nBecause water is the solvent, and has an activity of one, the self-ionization constant of water is defined as\n\nK_\\mathrm{w} = \\mathrm{[H^+][OH^-]}\n\nIt is perfectly legitimate to write [H+] for the hydronium ion concentration, since the state of solvation of the proton is constant (in dilute solutions) and so does not affect the equilibrium concentrations. Kw varies with variation in ionic strength and/or temperature.\n\nThe concentrations of H+ and OH− are not independent quantities. Most commonly [OH−] is replaced by Kw[H+]−1 in equilibrium constant expressions which would otherwise include  hydroxide ion.\n\nSolids also do not appear in the equilibrium constant expression, if they are considered to be pure and thus their activities taken to be one. An example is the Boudouard reaction:\n\n2 CO  CO2 + C\n\nfor which the equation (without solid carbon) is written as:\n\nK_\\mathrm{c}=\\frac \\mathrm{[CO_2]} \\mathrm{[CO]^2}\n\nMultiple equilibria\n\nConsider the case of a dibasic acid H2A. When dissolved in water, the mixture will contain H2A, HA− and A2−. This equilibrium can be split into two steps in each of which one proton is liberated.\n\\begin{array}{rl}\n\\ce{H2A <> {HA^-} + {H+}} : & K_1\n\\frac \\ce{[HA-][H+]} \\ce{[H2A]} \\\\\n\\ce{HA- <> {A^{2-}} + {H+}} : & K_2\n\\frac \\ce{[A^{2-}][H+]} \\ce{[HA-]}\n\\end{array}\nK1 and K2 are examples of stepwise equilibrium constants. The overall equilibrium constant, βD, is product of the stepwise constants.\n{H2A} <> {A^{2-}} + {2H+}:\\beta_\\ce{D} \n \\frac \\ce{[A^{2-}][H^+]^2} \\ce{[H_2A]}=K_1K_2\nNote that these constants are dissociation constants because the products on the right hand side of the equilibrium expression are dissociation products. In many systems, it is preferable to use association constants.\n\\begin{array}{ll}\n\\ce + {H+} <> HA-}:&\\beta_1\n\\frac \\ce{[HA^-]} \\ce{[A^{2-}][H+]} \\\\\n\\ce + {2H+} <> H2A}:&\\beta_2\n\\frac \\ce{[H2A]} \\ce{[A^{2-}][H+]^2}\n\\end{array}\nβ1 and β2 are examples of association constants. Clearly  and ;  and \nFor multiple equilibrium systems, also see: theory of Response reactions.\n\nEffect of temperature\n\nThe effect of changing temperature on an equilibrium constant is given by the van 't Hoff equation\n\\frac {d\\ln K} {dT} = \\frac{\\Delta H_\\mathrm{m}^\\ominus} {RT^2}\nThus, for exothermic reactions (ΔH is negative), K decreases with an increase in temperature, but, for endothermic reactions, (ΔH is positive) K increases with an increase temperature. An alternative formulation is\n\\frac {d\\ln K} {d(T^{-1})} = -\\frac{\\Delta H_\\mathrm{m}^\\ominus} {R}\nAt first sight this appears to offer a means of obtaining the standard molar enthalpy of the reaction by studying the variation of K with temperature. In practice, however, the method is unreliable because error propagation almost always gives very large errors on the values calculated in this way.\n\nEffect of electric and magnetic fields\n\nThe effect of electric field on equilibrium has been studied by Manfred Eigen among others.\n\nTypes of equilibrium\n\n* In the gas phase: rocket engines\n* The industrial synthesis such as ammonia in the Haber–Bosch process (depicted right) takes place through a succession of equilibrium steps including adsorption processes\n* Atmospheric chemistry\n* Seawater and other natural waters: chemical oceanography\n* Distribution between two phases\n** log D distribution coefficient: important for pharmaceuticals where lipophilicity is a significant property of a drug\n** Liquid–liquid extraction, Ion exchange, Chromatography\n** Solubility product\n** Uptake and release of oxygen by hemoglobin in blood\n* Acid–base equilibria: acid dissociation constant, hydrolysis, buffer solutions, indicators, acid–base homeostasis\n* Metal–ligand complexation: sequestering agents, chelation therapy, MRI contrast reagents, Schlenk equilibrium\n* Adduct formation: host–guest chemistry, supramolecular chemistry, molecular recognition, dinitrogen tetroxide\n* In certain oscillating reactions, the approach to equilibrium is not asymptotically but in the form of a damped oscillation .\n* The related Nernst equation in electrochemistry gives the difference in electrode potential as a function of redox concentrations.\n* When molecules on each side of the equilibrium are able to further react irreversibly in secondary reactions, the final product ratio is determined according to the Curtin–Hammett principle.\n\nIn these applications, terms such as stability constant, formation constant, binding constant, affinity constant, association/dissociation constant are used. In biochemistry, it is common to give units for binding constants, which serve to define the concentration units used when the constant’s value was determined.\n\nComposition of a mixture\n\nWhen the only equilibrium is that of the formation of a 1:1 adduct as the composition of a mixture, there are any number of ways that the composition of a mixture can be calculated. For example, see ICE table for a traditional method of calculating the pH of a solution of a weak acid.\n\nThere are three approaches to the general calculation of the composition of a mixture at equilibrium.\n\n#The most basic approach is to manipulate the various equilibrium constants until the desired concentrations are expressed in terms of measured equilibrium constants (equivalent to measuring chemical potentials) and initial conditions.\n#Minimize the Gibbs energy of the system.\n# Satisfy the equation of mass balance. The equations of mass balance are simply statements that demonstrate that the total concentration of each reactant must be constant by the law of conservation of mass.\n\nMass-balance equations\n\nIn general, the calculations are rather complicated or complex. For instance, in the case of a dibasic acid, H2A dissolved in water the two reactants can be specified as the conjugate base, A2−, and the proton, H+. The following equations of mass-balance could apply equally well to a base such as 1,2-diaminoethane, in which case the base itself is designated as the reactant A:\nT_\\mathrm{A} = \\mathrm{[A] + [HA] +[H_2A]} \\,\nT_\\mathrm{H} = \\mathrm{[H] + [HA] + 2[H_2A] - [OH]} \\,\n\nWith TA the total concentration of species A. Note that it is customary to omit the ionic charges when writing and using these equations.\n\nWhen the equilibrium constants are known and the total concentrations are specified there are two equations in two unknown \"free concentrations\" [A] and [H]. This follows from the fact that [HA]  β1[A][H], [H2A] \n β2[A][H]2 and [OH] = Kw[H]−1\n\n T_\\mathrm{A} = \\mathrm{[A]} + \\beta_1\\mathrm{[A][H]} + \\beta_2\\mathrm{[A][H]}^2 \\,\n T_\\mathrm{H} = \\mathrm{[H]} + \\beta_1\\mathrm{[A][H]} + 2\\beta_2\\mathrm{[A][H]}^2 - K_w[\\mathrm H]^{-1} \\,\n\nso the concentrations of the \"complexes\" are calculated from the free concentrations and the equilibrium constants.\nGeneral expressions applicable to all systems with two reagents, A and B would be\nT_\\mathrm{A}=[\\mathrm A]+\\sum_i p_i \\beta_i[\\mathrm A]^{p_i}[\\mathrm B]^{q_i}\nT_\\mathrm{B}=[\\mathrm B]+\\sum_i q_i \\beta_i[\\mathrm A]^{p_i}[\\mathrm B]^{q_i}\n\nIt is easy to see how this can be extended to three or more reagents.\n\nPolybasic acids\n\nThe composition of solutions containing reactants A and H is easy to calculate as a function of p[H]. When [H] is known, the free concentration [A] is calculated from the mass-balance equation in A.\n\nThe diagram alongside, shows an example of the hydrolysis of the aluminium Lewis acid Al3+(aq)The diagram was created with the program [http://www.hyperquad.co.uk/hyss.htm HySS] shows the species concentrations for a 5 × 10−6 M solution of an aluminium salt as a function of pH. Each concentration is shown as a percentage of the total aluminium.\n\nSolution and precipitation\n\nThe diagram above illustrates the point that a precipitate that is not one of the main species in the solution equilibrium may be formed. At pH just below 5.5 the main species present in a 5 μM solution of Al3+ are aluminium hydroxides Al(OH)2+,  and , but on raising the pH Al(OH)3 precipitates from the solution. This occurs because Al(OH)3 has a very large lattice energy. As the pH rises more and more Al(OH)3 comes out of solution. This is an example of Le Châtelier's principle in action: Increasing the concentration of the hydroxide ion causes more aluminium hydroxide to precipitate, which removes hydroxide from the solution. When the hydroxide concentration becomes sufficiently high the soluble aluminate, , is formed.\n\nAnother common instance where precipitation occurs is when a metal cation interacts with an anionic ligand to form an electrically neutral complex. If the complex is hydrophobic, it will precipitate out of water. This occurs with the nickel ion Ni2+ and dimethylglyoxime, (dmgH2): in this case the lattice energy of the solid is not particularly large, but it greatly exceeds the energy of solvation of the molecule Ni(dmgH)2.\n\nMinimization of Gibbs energy\n\nAt equilibrium, at a specified temperature and pressure, the Gibbs energy G is at a minimum:\n\ndG\\sum_{j\n1}^m \\mu_j\\,dN_j = 0\n\nFor a closed system, no particles may enter or leave, although they may combine in various ways. The total number of atoms of each element will remain constant. This means that the minimization above must be subjected to the constraints:\n\n\\sum_{j1}^m a_{ij}N_j\nb_i^0\n\nwhere aij is the number of atoms of element i in molecule j and b is the total number of atoms of element i, which is a constant, since the system is closed. If there are a total of k types of atoms in the system, then there will be k such equations. If ions are involved, an additional row is added to the aij matrix specifying the respective charge on each molecule which will sum to zero.\n\nThis is a standard problem in optimisation, known as constrained minimisation. The most common method of solving it is using the method of Lagrange multipliers, also known as undetermined multipliers (though other methods may be used).\n\nDefine:\n\n\\mathcal{G}G + \\sum_{i\n1}^k\\lambda_i\\left(\\sum_{j1}^m a_{ij}N_j-b_i^0\\right)\n0\n\nwhere the λi are the Lagrange multipliers, one for each element. This allows each of the Nj and λj to be treated independently, and it can be shown using the tools of multivariate calculus that the equilibrium condition is given by\n\n0 \\frac{\\partial \\mathcal{G}}{\\partial N_j} \n \\mu_j + \\sum_{i=1}^k \\lambda_i a_{ij} \n0 \\frac{\\partial \\mathcal{G}}{\\partial \\lambda_i} \n \\sum_{j=1}^m a_{ij}N_j-b_i^0\n\n(For proof see Lagrange multipliers.) This is a set of (m + k) equations in (m + k) unknowns (the Nj and the λi) and may, therefore, be solved for the equilibrium concentrations Nj as long as the chemical potentials are known as functions of the concentrations at the given temperature and pressure. (See Thermodynamic databases for pure substances.) Note that the second equation is just the initial constraints for minimization.\n\nThis method of calculating equilibrium chemical concentrations is useful for systems with a large number of different molecules. The use of k atomic element conservation equations for the mass constraint is straightforward, and replaces the use of the stoichiometric coefficient equations.. The results are consistent with those specified by chemical equations. For example, if equilibrium is specified by a single chemical equation: ,\n\n\\sum_{j0}^m \\nu_j R_j\n0\n\nwhere νj is the stochiometric coefficient for the j th molecule (negative for reactants, positive for products) and Rj is the symbol for the j th molecule, a properly balanced equation will obey:\n\n\\sum_{j1}^m a_{ij} \\nu_j \n0\n\nMultiplying the first equilibrium condition by νj yields\n\n0 \\sum_{j\n1}^m \\nu_j \\mu_j +  \\sum_{j1}^m \\sum_{i\n1}^k \\nu_j \\lambda_i a_{ij} \\sum_{j\n1}^m \\nu_j \\mu_j   \n\nAs above, defining ΔG\n\n\\Delta G\\sum_{j\n1}^m \\nu_j \\mu_j \\sum_{j\n1}^m \\nu_j (\\mu_j^{\\ominus} + RT \\ln(\\{R_j\\})) \\Delta G^{\\ominus} + RT \\ln\\left(\\prod_{j\n1}^m \\{R_j\\}^{\\nu_j}\\right) =  \\Delta G^{\\ominus} + RT \\ln(Q_r)\n\nwhich will be zero at equilibrium. Chemical equilibrium. http://en.wikipedia.org/?curid=5306."
  }
}
