{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11475",
  "eid" : "fbee0810-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778502417,
  "textBody" : "Fuerteventura (; literally meaning \"strong fortune\" but translated by some as \"Strong Winds\" or a corruption of the French term for \"Great Adventure\") is one of the Canary Islands, in the Atlantic Ocean and is part of the North Africa region, politically part of Spain. At , it is the second largest of the Canary Islands, after Tenerife. It was declared a biosphere reserve by UNESCO in May 2009. Its capital is Puerto del Rosario.\n\nHistory\n\nPrecolonial history \n\nThe first settlers of Fuerteventura are believed to have come from North Africa. The word Mahorero (Majorero) or Maho is still used today to describe the people of Fuerteventura and is derived from the ancient word 'mahos', a type of goatskin shoe worn by these original inhabitants. They lived in caves and semi-subterranean dwellings, some of which have been excavated, revealing remnants of early tools and pottery. In antiquity, the island was known o.a. as Planaria, in reference to the flatness of most of its terrain.\n\nIn the 11th century BC, Phoenician settlers landed in Fuerteventura and Lanzarote.\n\nSeveral Spanish and Portuguese expeditions to the islands were organized around 1340, followed by Moors and European slave traders. At the end of the Iberian conquest, the island was divided into two Guanches kingdoms, one adhering to King Guize and the other to King Ayoze. The territories of these kingdoms were called Maxorata (in the North) and Jandía (in the South) respectively. They were separated by a wall, which traversed the La Pared isthmus. Some remains have been preserved. The ancient name for the island, Erbania, is derived from this wall's name.\n\nThe conquest \n\nThe island's conquest began in earnest in 1402, commanded by Jean de Béthencourt and Gadifer de la Salle. They arrived with only 63 sailors out of the original 283, as many had deserted along the way. After arriving and settling in Lanzarote, the invaders made some first excursions to the neighboring islands. In 1404, Bethencourt and Gadifer founded Betancuria, on the West coast, the first settlement on the island. After numerous difficulties, Gadifer took charge of the invasion, while Bethencourt returned to Spain to seek the recognition and support of the Castilian king.\n\nIn 1405, de Béthencourt completed his conquest of the island, establishing its capital in Betancuria (Puerto Rosario took over the mantle as island capital in 1835). It is generally accepted that the island took its name from fuerte (strong) and ventura (wind), as mentioned by mallorcan navigator Angelino Dulcert in 1339.\n\nIn 1424 Pope Martin V, through the Betancuria Brief, edicted the establishment of the Bishopric of Fuerteventura, which encompassed all the Canary Islands save for the island of Lanzarote.[http://www.juliosanchezrodriguez.com/convertidos/07-02_Cisma.pdf El Cisma de Occidente y el Obispado de Fuerteventura] The origin of this bishopric is directly related to the events that occurred after the Great Schism (1378-1417), in that the bishop of San Marcial del Rubicón of Lanzarote (at the time, the only diocese in the Canary Islands) did not recognize the papacy of Martin V, and instead adhered to anti-Pope Benedict XIII. The Bishopric of Fuerteventura was based in the Parish of Santa María de Betancuria, bestowing upon the latter the status of Grant Cathedral. After the reabsorbtion of the Diocese of San Marcial del Rubicón by the papacy of Pope of Martin V, the Bishopric of Fuerteventura was abolished in 1431, only seven years after it was created.[http://www.juliosanchezrodriguez.com/convertidos/07-02_Cisma.pdf El Cisma de Occidente y el Obispado de Fuerteventura]\n\nThe first census recorded a population of some 1,200 inhabitants. The population increased gradually thereafter. In 1476 the territory became the Señorío Territorial de Fuerteventura, subjected to the Catholic Monarchs.[https://web.archive.org/web/20070401163550/http://www.ayuntamientotuineje.com/modules.php?nameContent&pa\nshowpage&pid59&page\n3 Se reconoce al conquistador su dominio sobre la isla.] Fuente: Ayuntamiento de Tuineje. In later years, the island was invaded by the Spanish, French and the English.\n\nColonial Fuerteventura \n\nOver time, the island endured numerous pirate raids. A Berber lead expedition invaded in 1593, sweeping as far inland as the capital. Various castles were built along the coastline, to protect against these type of attacks. The population was moved inland as a second protective measure. Because of the raids, a first Captain General was dispatched to Fuerteventura, accompanied by a number of Sergeant Majors, to defend the island in the name of the Crown. At that time Betancuria became the religious capital of the island.[https://web.archive.org/web/20070401163550/http://www.ayuntamientotuineje.com/modules.php?nameContent&pa\nshowpage&pid59&page\n3 The principal economic motor of the epoch was orchilla, cereal and cattle.] Source: Tuineje council.\n\nTwo major pirate attacks took place in 1740, within a month of each other. Two separate bands of English privateers attempted to loot the town of Tuineje. These attacks were however successfully averted by the local population and the island's militia. This successful repelling of the invaders is celebrated at a re-enactment that takes place in Gran Tarajal every year in October.\n\nThe island's garrison was officially instated in 1708. Its colonel assumed the title of Governor at Arms, a hereditary, lifelong appointment which has remained in the Sánchez-Dumpiérrez family. In time, this family increasingly garnered power over the other islands through alliances with the family of Arias de Saavedra and the Lady of Fuerteventura.[https://web.archive.org/web/20070522001858/http://www.corralejograndesplayas.com/info_general.php?id_seccion1&pagina\n3 El marqués de Vallehermoso intenta que la población se ponga a favor del poder de la corona frente al señorío.] Source: La Oliva council During the same year the Assistant Parish of La Oliva and Pájara was created, to become operational in 1711. On December 17, 1790 the Assistant Parish of Tuineje was created, which became a new parish division on June 23, 1792 under the bishop Tavira, with lands including part of the Jandía peninsular, and with a population of 1,670 inhabitants. 1780 saw the start of a barrilla plantation industry.[https://web.archive.org/web/20090110021851/http://www.ayuntamientotuineje.com/modules.php?nameContent&pa\nshowpage&pid59&page\n4 Reseña histórica] Source: Tuineje council\n\nTo the present\n\nIn 1852, a free trade zone was extended by Isabella II to the Canary Islands. Military island rule, which began in 1708, was finally dissolved in 1859, and Puerto de Cabras (now Puerto del Rosario) became the new capital.\n\nThe Canary Islands obtained self-governance in 1912. In 1927, Fuerteventura and Lanzarote became part of the province of Gran Canaria. The seat of the island's government (cabildo insular) is located in Puerto del Rosario. A total of 74,983 people lived on the island in 2003.\n\nBy the 1940s the island had an airport (just west of Puerto del Rosario on the road to Tindaya, still visible today). Mass tourism began to arrive in the mid-1960s, facilitated by the construction of Fuerteventura Airport at El Matorral and the first tourist hotels.\n\nThe island's proximity (a mere 100 km) to the West African coast and the fact that it is part of the Schengen territory make it a prime target destination for undocumented immigrants. However, many have perished while attempting the crossing.http://www.doctorswithoutborders.org/news-stories/press-release/msf-assists-immigrants-arriving-fuerteventura-island\n\nEnvironment\n\nGeography\n\nThe elongated island has an area of 1660 km2.  The island is 100 km long and 31 km wide. It is part of the province of Las Palmas. It is divided into six municipalities:\n*Antigua\n*Betancuria\n*La Oliva\n*Pájara\n*Puerto del Rosario\n*Tuineje\n100 individual settlements are distributed through these municipalities. A nearby islet, Islote de Lobos, is part of the municipality of La Oliva.\n\nLocated just 100 km off the coast of north Africa, it is the second biggest of the islands, after Tenerife, and has the longest white sand beaches in the archipelago. The island is a destination for sun, beach and watersports enthusiasts. It lies at the same latitude as Florida and Mexico and temperatures rarely fall below 18 °C or rise above 32 °C. It counts 152 separate beaches along its seaboard — 50 km of white sand and 25 km of black volcanic shingle.\n\nGeology\n\nFuerteventura is the oldest island in the Canary Islands dating back 20 million years to a volcanic eruption from the Canary hotspot. The majority of the island was created about 5 million years ago and since then has been eroded by wind and precipitation. On the seabed off the West coast of the island rests an enormous slab of bedrock 22 km long and 11 km wide, which appears to have slid off the island largely intact at some point in prehistory, similar to the predicted future collapse of Cumbre Vieja, a geological fault on another Canary Island, La Palma. The last volcanic activity in Fuerteventura occurred between 4,000 and 5,000 years ago.\n\nThe highest point in Fuerteventura is Pico de la Zarza (807 m) in the Southwestern part of the island. Geographical features include Istmo de la Pared which is 5 km wide and is the narrowest part of Fuerteventura. The island is divided into two parts, the northern portion which is Maxorata and the southwestern part called the Jandía peninsula.\n\nBeaches\n\nFuerteventura was chosen among 500 European destinations by the Quality Coast International Certification Program of the European Coastal and Marine Union as one of the most attractive tourist destinations for visitors interested in cultural heritage, environment and sustainability.[http://www.qualitycoast.info/brochure/qc2012.pdf Fuerteventura as sustainable tourism destination]\n\nClimate\n\nThe climate on Fuerteventura is pleasant throughout the year. The island is hence referred to as the island of eternal spring. The sea regulates air temperature, diverting hot Sahara winds away from the island. The island's name in English translates as \"strong fortune\" or \"strong wind\", the Spanish word for wind being viento. During the winter months, temperatures average a high of 22 °C and a low of around 15 °C, whereas during the summer a mean high of 28 °C and a low of 20 °C can be expected. Precipitation is about 147 mm per year, most of which falls in autumn and winter. December is the month with highest rainfall.\n\nA sandstorm known as the Calima (similar to the Sirocco wind, which blows to the North of the Sahara, to Europe) may blow from the Sahara Desert to the Northwest, and can cause high temperatures, low visibility and drying air. Temperatures during this phenomenon rise temporarily by approximately 10 degrees Celsius. The wind brings in fine red dust, The fine white sand is not blown in from Sahara, It is made up of dead coral reef and local seabed upheaval. visibility can drop to between 100 to or even lower and can even bring African locusts to the island.\n\nWildlife\n\nThe island is home to one of the two surviving populations of the threatened Canarian Egyptian vulture. It is also inhabited by many wild dogs and cats. On the barren, rocky land there are Barbary ground squirrels and geckos. Fuerteventura also hosts several migratory and nesting birds. The island has significant populations of the collared dove, common swifts and several finch species especially in the vicinity of holiday developments.\n\nDespite its arid climate, the island is also home to a surprisingly large insect fauna. Butterflies which commonly occur on the island include the clouded yellow (Colias hyale) and the bath white (Pontia daplidice) which feeds on xerophytic cruciferae. The island is also home to the monarch butterfly (Danaus plexippus) and its close African relative Danaus chrysippus. Around holiday developments such as Caleta de Fuste, water is relatively abundant, and dragonfly species including the blue emperor, Anax imperator and the scarlet darter, Crocothemis erythraea can be found. The islands sand dunes and shoreline are home to a number of bee and wasp species including the large Eumenid caterpillar hunting wasp, Delta dimidiatipenne and the striking blue banded bee, (Amegilla canifrons).\n\nHawkmoths also occur on the island. One of the more notable species is Hyles tithymali which feeds on endemic spurges such as Euphorbia regis-jubae. Acherontia atropos, the deaths-head hawkmoth also occurs on the island presumably feeding on members of the Solanaceae, for example, Datura innoxia and Nicotiana glauca which are common weeds in the vicinity of human habitation.\n\nNatural symbols \n\nThe official natural symbols associated with Fuerteventura are Chlamydotis undulata fuertaventurae (hubara or houbara) and Euphorbia handiensis (Cardón de Jandía).[http://www.gobcan.es/boc/1991/061/001.html Ley 7/1991, de 30 de abril, de símbolos de la naturaleza para las Islas Canarias]\n\nFile:Chlamydotis undulata fuertaventurae 3.jpg|Chlamydotis undulata fuertaventurae\nFile:Euphorbia handiensis 02 ies.jpg|Euphorbia handiensis\n\nDemographics \n\nPopulation \n\nThe island has a population of 74,983. Throughout its long history, Fuerteventura has suffered from a population decline due to the economic situation and the climate, which have made it into a desert island. However, the development of tourism during the 1980s has caused the population to grow year on year since then, doubling it in a little less than a decade.\n\nIn 2005, with 86,642 registered inhabitants, the Fuerteventura population was formed by the following:\n* Born on the island: 30,364\n* Born on another Canary Island: 13,175\n* Born elsewhere in Spain: 20,938\n* Born in other countries: 22,165\n\nComparing this data with the 2001 census shows that the number of permanent residents born on the island has increased by just 3,000. The number who have moved in from abroad has increased by 22,910, making this the biggest contributor to population growth in recent years.[https://web.archive.org/web/20070421075723/http://www.gobiernodecanarias.org/istac/publicaciones/pdfs/2006_005.pdf The total population in 2001 was 60,273 inhabitants.] Source: Instituto Canario de Estadística (ISTAC)\n\nEducation \n\nThe island has 116 schools,[https://web.archive.org/web/20070101162743/http://www.gobiernodecanarias.org/istac/estadisticas/educacion/no_universitaria/centros_2003_1.html 2003-2004 data. Only two of the centres are private.] Source: Instituto Canario de Estadística (ISTAC) with a total of 14,337 pupils.[https://web.archive.org/web/20090116041450/http://www.gobiernodecanarias.org/istac/estadisticas/educacion/no_universitaria/alnouniv_2003_1.html 2003-2004 data. Puerto del Rosario has 6,468 alumni of Enseñanzas de Régimen General. Tuineje is the second largest with 2,647] Source: Instituto Canario de Estadística (ISTAC) Of these, 45 are primary schools, ten are secondary schools, six are for Baccalaureate students and four are vocational colleges.[https://web.archive.org/web/20070101162743/http://www.gobiernodecanarias.org/istac/estadisticas/educacion/no_universitaria/centros_2003_1.html 2003-2004 data. Most of these centres are in Puerto del Rosario. At the other extreme, Betancuria only has 3 infant schools and 3 primary schools.] Source: Instituto Canario de Estadística (ISTAC)\n\nFuerteventura also has a centre linked with the National University of Distance Education, offering courses in many subjects including economics, business studies, law, history and tourism.[http://apliweb.uned.es/casociados/mostrar_centro.asp?cod=059000 The centre is directed by Esteban Rodríguez Pérez.]  Source: Universidad Nacional de Educación a Distancia (UNED)\n\nState administration \n\nFuerteventura is governed by the Island Department of the Government of Spain, which holds the rank of a Government Subdepartment. The government building is located in the centre of the capital city, in front of the parish church of the Virgin of Rosario, the patron saint of Puerto del Rosario municipality.\n\nThis institution is charged with representing the Government of Spain on the island, and managing all the functions that are not under control of the Canarian Government. This includes the following public services:\n* Island Security Forces (National Police and Guardia Civil)\n* Puerto del Rosario port and Fuerteventura Airport\n* Tax Agency\n* Customs\n* the Maritime and Coastguard department\n* Driving licences, Traffic and Highways\n* Immigration - the Immigration Detention Centre and residential permits\n* Social Security\n* Red Cross\n* Seprona (the Nature Protection Service)\n* Passports\n\nSince 30 June 2007, the island's governor has been Eustaquio Juan Santana Gil.Orden MAPU/2145/2007, 12 July (BOE 16 July 2007) 4\n\nIsland Council of Fuerteventura (Cabildo)\n\nThe councils, formed as part of the Councils Act of 1912, administer the Canary Islands and have two principal functions. On one hand, they perform services for the Autonomous Community, and on the other, they are the local government centre for the island. In the 2003 elections, Mario Cabrera González was elected as president representing the Canarian Coalition, with 31.02% of the votes, followed by the Spanish Socialist Workers' Party with 27.53%, represented by the Vice President Domingo Fuentes Curbelo.\n\nMunicipalities \n\nThe island is divided into six municipalities with their respective city councils which form part of the FECAM (Federation of Canarian Municipalities). They are governed by the basic legislation of the local regime and their respective organic rules. The populations of the municipalities are as follows:(Population data from INE 2009)\n* Antigua (10,371)\n* Betancuria (680)\n* La Oliva (21,996)\n* Pájara (20,821)\n* Puerto del Rosario (35,667)\n* Tuineje (13,632)\nIn turn, these municipalities are organised into two associations: the Mancomunidad de Municipios del Centro-Norte de Fuerteventura formed from La Oliva and Puerto del Rosario, and the remaining municipalities make up the Mancomunidad de Municipios del Centro-Sur de Fuerteventura.[http://www.dgal.map.es/cgi-bin/webapb/webdriver?MIvalmancomunidades&n_prov\nPalmas,+The associations provinces of Las Palmas.] Source: Ministerio de Administraciones Públicas\n\nEconomy\n\nThe economy of Fuerteventura is mainly based on tourism. Primary tourist areas are located around the existing towns of Corralejo in the north and Morro Jable in Jandia, plus the purely tourist development of Caleta de Fuste, south of Puerto del Rosario. Other main industries are fishing and agriculture (cereals and vegetables). The famous Majorero cheese is locally made from the milk of the indigenous majorera goat.\n\nIn 2009, Fuerteventura recorded the highest EU regional unemployment rate at a NUTS3 level, at 29.2 percent.Eurostat. \n\nTourism\n\nThe first tourist hotel was built in 1965 followed by the construction of Fuerteventura Airport at El Matorral, heralding the dawn of a new era for the island. Fuerteventura, with its 3,000 sunshine hours a year, was placed firmly on the world stage as a major European holiday destination.\nWhile having fully developed tourist facilities, the island has not experienced the overdevelopment found on some other islands and consequently caters for visitors attracted by its rugged natural beauty. Nonetheless, it remains a popular destination for predominantly but not exclusively German, British, French and Italian tourists.\n\nThe summer Trade Winds and winter swells of the Atlantic make this a year-round surfers' paradise, with more exposed areas on the north and west shores such as Corralejo and El Cotillo proving most popular. Wind surfing takes places at locations around the island. Sailors, scuba divers and big-game fishermen are all drawn to these clear blue Atlantic waters where whales, dolphins, marlin and turtles are all common sights. With many hills present throughout the Island, hikers are also attracted to this Island.\n\nExcellent sandy beaches are found in many locations. Western beaches, such as those around El Cotillo, can experience strong surf. The beaches adjoining the extensive sand dunes east of Corralejo are popular, as are the more protected extensive sandy shores of the Playa de Sotavento de Jandia on the southeastern coast between Costa Calma and the Morro Jable. Naked sun bathing and swimming are the norm almost on all beaches.\n\nMuch of the interior, with its large plains, lavascapes and volcanic mountains, consists of protected areas, although there are organised tours and vehicular access across them.\n\nArt and culture \n\nTraditional holidays \n\nLike the rest of the Canaries, Carnival is traditionally one of the biggest festivals celebrated on the island. It is celebrated in different ways in all the towns during February and March. These festivities have a different theme each year. They include activities such as parades and galas to choose the carnival king.\n\nConcerts and festivals \n\nThere are many concerts and festivals held in the auditoriums, such as the Festival of Canarian Music. They are also held in smaller venues across the island, featuring bands such as Estopa, Van Gogh's Ear, and King Afrhica.\n\n*Lebrancho Rock: in 2004, the Town Hall of Puerto del Rosario started this initiative for the growing number of local bands who had been performing in the area for years but had not had the chance to play at the same event.\n*Fuertemusica: like Lebrancho Rock, this festival aims to encourage the local or emerging groups. It started in the same year. This festival is mainly for groups that are already known in the music world. It takes place in El Cotillo.\n*In the municipality of Betancuria (more specifically in the village of Vega de Rio Palmas) held every year the festivities in honor of the Virgen de la Peña, patron saint of the island of Fuerteventura, the most representative is the pilgrimage in which are involved people from all corners of the island. The holiday is celebrated on the third Saturday of September.\n\nFestival Internacional de Cometas/International Kite Festival is held on the second week of November each year centering on the Corralejo Beaches. It attracts kitefliers and kite surfers from all over Europe. It is popular because the winds are warm and constant and the beaches become filled with hundreds of colourful kites of all shapes and sizes.\n\nAuditoriums \n\nFuerteventura has three auditoriums. These are used for all types of performing art. They are also used for non-artistic purposes, such as conferences, charity galas and political meetings.\n\n* The Isle of Fuerteventura Auditorium\n* Gran Tarajal Auditorium\n* Corralejo Auditorium\n\nCentral library \n\nThe Central Library of the Island is located in Antigua's city centre, in the public university. In addition to providing the traditional library services, it has an 180-seat multipurpose room, air conditioning, a wifi zone, and a multimedia room used for seminars, presentations, film festivals etc.\n\nMuseums and exhibition spaces \n\nThe island has several museums with different themes and plenty of exhibition spaces, both public and private. These include:\n\n* The Antigua Windmill Craft Centre\n* The Salt Museum\n* The Atalayita Archeological Interpretation Centre\n\nSculpture park \n\nIn addition to the museums, the capital Puerto del Rosario has an open-air sculpture park consisting of around 100 sculptures by different artists scattered across the city. Most of them were created for the International Symposium of Sculpture celebrated annually since 2001. During the festival, artists come from all over the world to erect their sculptures in the open air, in full view of passers by.\n\nMain sights\n\nSites of interest include Corralejo and El Jable to the north which are made up of fine sand dunes whilst the south is filled with long beaches and remote bays. The constant winds blowing onto the beaches provide a paradise for windsurfing. Surfing is common on the west and north coasts where there are large waves. Windsurfing is common around Corralejo and Playas de Sotavento and wave sailing (windsurfing on the waves) on the coast along the northern half of the island. El Cotillo is a small fishing village in the north-west of the Island famous for a very long beach to the south of the village and few very calm beaches to the north. The northern beaches frequented by snorkeling enthusiasts and sun worshippers alike are referred to as lakes by the locals. \n\nAt Cofete on the western side of Jandía a remote and imposing house - Villa Winter - looks out to sea across wide and generally empty beaches. It was reputedly built by a Mr Winter on land given by Generalisimo Franco. Despite being one of the most beautiful parts of Fuerteventura Cofete has very little touristic facilities.\n\nFor a time, the beaches were home to a popular accidental attraction. On 18 January 1994 the once-beautiful and proud United States Lines ocean liner SS American Star (former America, USS West Point, Australis) was beached in Playa de Garcey during a severe storm. Within a year, she broke in two and later lost her stern. By 2007 the rest of the severely deteriorated ship had collapsed onto her port side, gradually keeling over further and almost completely submerged. By 2008-2012, most of the remains finally slipped below the surface.\n\nFood \n\nThe cuisine is fairly basic due to the customs and climate conditions. They share this simplicity with the other Canary islands, and similarly to them, they use a large quantity of fish. They also use whatever they can grow in the near-barren land. This includes papas arrugadas, a dish of wrinkled potatoes usually served with mojo, which is a hot pepper sauce or with puchero canario, a meat stew.\n\nSeafood is prepared in many ways traditionally, such as pejines (salted fish),Little sun-dried salted fish roasted or burned in a dish with a little alcohol. jareas,Octopus, gilt-head bream or other fish washed and placed in the sun to dry. or sancocho (a type of stew) made from fish, generally the grouper,Groupers are a group of 20 genera in the subfamily Epinephelinae of perciformes. They have a robust body, with a large head resulting in globulous eyes and large mandibles. corvina or sama, boiled after salting, and served with mojo, potatoes, or gofio (a type of grain). People are also very keen on the mussels and limpets collected on the island's coasts.\n\nThey also use meat such as beef and pork to make different dishes or simply to for braising, but their main meat is goat, both from the kids and from the older animals. They eat the goat roasted or stewed. Goats are not only useful for their meat - the Fuerteventurans also use the milk to make the cheese majorero, which has won many prizes. The majorero is mostly made of goats milk, and occasionally it is up to 15% ewes milk. It is cured in pimento oil or gofio meal. Majorero and palmero cheese are the only two Canarian cheeses with protected denomination of origin.\n\nSport \n\nMany sports are commonly played in Fuerteventura, both in the open air and in sports centres across the island.\n\nNative sports \n\nThese are the Canarian sports found on the island:\n\nCanarian wrestling \n\nThe wrestling takes place in a ring of sand called the terrero. Inside it, the two contestants try to knock each other over. Fuerteventura has 14 terreros distributed through all the towns except Betancuria.\n\n* Antigua: Terrero de Antigua.\n* La Oliva: Terrero Venancio Guerra and Terrero de Villaverde.\n* Pájara: Terrero Miguel Díaz La Lajita, Terrero de Morro Jable a Terrero de Pájara.\n* Puerto del Rosario: Terrero de Casillas del Angel, Terrero Manuel Nieves, Terrero de Puerto Cabras, Terrero de Tefía a Terrero de Tetir.\n* Tuineje: Terrero de Gran Tarajal, Terrero de Tamasite, and Terrero Pedro Sánchez in Tarajalejo.\n\nThe island also has a school wrestling league organized by the council and a programme to promote this sport in clubs. Twelve wrestling schools participate in this, based in Antigua, Costa Calma, El Matorral, La Lajita, Lajares, Las Playitas, Morro Jable, Puerto del Rosario, Tefía, Tetir, Unión Sur and Villaverde.\n\nJuego del Palo \n\nJuego del Palo is a Canarian martial art which literally translates as game of the stick. It is played by two players both armed with sticks. They aim to defeat each other without making contact with their opponent's body. The origin of this game is unclear. All we know is that it is based on a method of combat used by the precolonial Canarian people.\n\nFuerteventura has the following Palo clubs:[http://www.juegodelpalocanario.org/modules/cjaycontent/index.php?id=15 Relación de clubes federados.] Fuente: Federación del Juego del Palo Canario\n* Club-Escuela Dunas de Corralejo.\n* Club-Escuela Huriamen de Villaverde.\n* Club-Escuela Puerto Cabras.\n* Club-Escuela Sorinque de Gran Tarajal.\n\nCanarian boules \n\nThis is a similar game to the French Pétanque which is actually played very little on the island, although there are a few teams and courts. Basically the game consists of scoring points by throwing a ball to get it as near as possible to an object called a mingue or boliche. It is played on a rectangular sand or earth pitch which is 18 to(-) long and  wide.\n\nhttp://www.playaboule.com/Simple_petanque_rules.aspx\n\nWatersports \n\nThe sea and climate conditions make the island the perfect place for a huge variety of watersports.\n\nSurfing, windsurfing and kitesurfing \n\nMany types of surfing are popular on the island, including traditional surfing, windsurfing (where the board is propelled by a sail) and most recently kitesurfing. The island has many schools and courses dedicated to teaching these sports.\n\nThe sports where Fuerteventura has the most impact internationally are windsurfing and kitesurfing, mainly due to the International Windsurfing and Kiteboarding Championship. This has run since 1985 and is held at Playas de Sotavento in Pájara municipality. Many important wind and kitesurfing figures compete in this championship, such as the several-times world windsurfing champion Björn Dunkerbeck and Gisela Pulido, the very young kiteboarding champion from Tarifa.\n\nMany Canarian windsurfers are on the Canarian Waveriders circuit, which has been based in Corralejo since 2005.\n\nDiving \n\nDiving schools are just as frequent as surfing ones, all around the coast of Fuerteventura. Unlike the other islands of the archipelago, Fuerteventura has a shelf which at some points goes up to 30 km, making it an ideal place to practice this sport.\n\nTwo of the most useful points for diving are the coast off Playa del Matorral in the South, and the zone between Lobos Island and Corralejo in the north. It is here in Corralejo that the International Sea and Submarine Photography Festival takes places, known as Fimarsub Corralejo - Lobos. During the festival there are beginners' lessons, professional dives, lessons in underwater photography, screenings and other events related to the sport.\n\nSwimming \n\nThere are many swimming pools on the island but the most obvious place to swim is in the open sea. There is an annual swim from Lobos Island to Fuerteventura, held every year since 1999. The event attracts amateur swimmers from all over the Canaries and Spain, and also swimming professionals such as David Meca and Maarten Van der Weijden, the paralympist Jesús Collado Alarcón who won gold medals for 100m backstroke and butterfly in Athens 2004, and Xavi Torres Ramis, the paralympic champion in Barcelona '92, Sydney and Atlanta.\n\nSailing \n\nThe island holds competitions involving different types of boat, such as the lateen and the Optimist. An interesting event is the Tour of Fuerteventura by Kayak, which is organised as a series of stages rather than a competition, and is an easy way to explore the island.\n\nFishing \n\nThe most notable competition here is the Gran Tarajal Fishing Open.\n\nOther sports \n\nSince 2004 the Marcha Ciclotourista has been held in La Oliva and the Criterium Ciclista has been held in Corralejo (also part of the La Oliva municipality) since 2005. Participants include Euskaltel-Euskadi, T-Mobile and a team from Orbea. These competitions have contributed to local interest in the sport and the first professional local team, the Fuerteventura-Canarias, was formed, initially run by Óscar Guerrero, director of Kaiku, although they have not competed for the past few seasons.\n\nThere are various motocross circuits on the island, including Los Alares in Antigua and Isla de Fuerteventura in Puerto del Rosario municipality. They hold regular trials, some of which form part of the Canarian Regional Motocross Championship. Throughout the year there are gravel rally races. Two are part of the Canarian Dirt Rally Championship. These are the Antiguan Rally and the La Oliva Rally.\n\nThe island's main football clubs are CD Union Puerto and CD Cotillo, who play in Group XII of the Spanish Tercera División.\n\nThe resort Playitas on the south coast is since around 2008 equipped with a 50 m swimming pool and has become a destination for triathlon training camps for Europeans. An annual race called Challenge Fuerteventura is held there on the half ironman distance.\n\nPeople \n\n* Manuel Velázquez Cabrera: born in Tiscamanita in 1863, the politician and lawyer who created the island's council.\n* Juan Ismael: the painter, cartoonist and poet born in La Oliva in 1907, considered one of the great Canarian surrealists.\n* Eustaquio Gopar: born in Tuineje in 1866. He was one of the Spanish soldiers involved in the Siege of Baler together with Major Rafael Alonso Mederos, who died of beri-beri during the siege. On his return Eustaquio became mayor over his native people. He held this post both during the republic and under Franco.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Fuerteventura" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11475" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Fuerteventura (; literally meaning \"strong fortune\" but translated by some as \"Strong Winds\" or a corruption of the French term for \"Great Adventure\") is one of the Canary Islands, in the Atlantic Ocean and is part of the North Africa region, politically part of Spain. At , it is the second largest of the Canary Islands, after Tenerife. It was declared a biosphere reserve by UNESCO in May 2009. Its capital is Puerto del Rosario.\n\nHistory\n\nPrecolonial history \n\nThe first settlers of Fuerteventura are believed to have come from North Africa. The word Mahorero (Majorero) or Maho is still used today to describe the people of Fuerteventura and is derived from the ancient word 'mahos', a type of goatskin shoe worn by these original inhabitants. They lived in caves and semi-subterranean dwellings, some of which have been excavated, revealing remnants of early tools and pottery. In antiquity, the island was known o.a. as Planaria, in reference to the flatness of most of its terrain.\n\nIn the 11th century BC, Phoenician settlers landed in Fuerteventura and Lanzarote.\n\nSeveral Spanish and Portuguese expeditions to the islands were organized around 1340, followed by Moors and European slave traders. At the end of the Iberian conquest, the island was divided into two Guanches kingdoms, one adhering to King Guize and the other to King Ayoze. The territories of these kingdoms were called Maxorata (in the North) and Jandía (in the South) respectively. They were separated by a wall, which traversed the La Pared isthmus. Some remains have been preserved. The ancient name for the island, Erbania, is derived from this wall's name.\n\nThe conquest \n\nThe island's conquest began in earnest in 1402, commanded by Jean de Béthencourt and Gadifer de la Salle. They arrived with only 63 sailors out of the original 283, as many had deserted along the way. After arriving and settling in Lanzarote, the invaders made some first excursions to the neighboring islands. In 1404, Bethencourt and Gadifer founded Betancuria, on the West coast, the first settlement on the island. After numerous difficulties, Gadifer took charge of the invasion, while Bethencourt returned to Spain to seek the recognition and support of the Castilian king.\n\nIn 1405, de Béthencourt completed his conquest of the island, establishing its capital in Betancuria (Puerto Rosario took over the mantle as island capital in 1835). It is generally accepted that the island took its name from fuerte (strong) and ventura (wind), as mentioned by mallorcan navigator Angelino Dulcert in 1339.\n\nIn 1424 Pope Martin V, through the Betancuria Brief, edicted the establishment of the Bishopric of Fuerteventura, which encompassed all the Canary Islands save for the island of Lanzarote.[http://www.juliosanchezrodriguez.com/convertidos/07-02_Cisma.pdf El Cisma de Occidente y el Obispado de Fuerteventura] The origin of this bishopric is directly related to the events that occurred after the Great Schism (1378-1417), in that the bishop of San Marcial del Rubicón of Lanzarote (at the time, the only diocese in the Canary Islands) did not recognize the papacy of Martin V, and instead adhered to anti-Pope Benedict XIII. The Bishopric of Fuerteventura was based in the Parish of Santa María de Betancuria, bestowing upon the latter the status of Grant Cathedral. After the reabsorbtion of the Diocese of San Marcial del Rubicón by the papacy of Pope of Martin V, the Bishopric of Fuerteventura was abolished in 1431, only seven years after it was created.[http://www.juliosanchezrodriguez.com/convertidos/07-02_Cisma.pdf El Cisma de Occidente y el Obispado de Fuerteventura]\n\nThe first census recorded a population of some 1,200 inhabitants. The population increased gradually thereafter. In 1476 the territory became the Señorío Territorial de Fuerteventura, subjected to the Catholic Monarchs.[https://web.archive.org/web/20070401163550/http://www.ayuntamientotuineje.com/modules.php?nameContent&pa\nshowpage&pid59&page\n3 Se reconoce al conquistador su dominio sobre la isla.] Fuente: Ayuntamiento de Tuineje. In later years, the island was invaded by the Spanish, French and the English.\n\nColonial Fuerteventura \n\nOver time, the island endured numerous pirate raids. A Berber lead expedition invaded in 1593, sweeping as far inland as the capital. Various castles were built along the coastline, to protect against these type of attacks. The population was moved inland as a second protective measure. Because of the raids, a first Captain General was dispatched to Fuerteventura, accompanied by a number of Sergeant Majors, to defend the island in the name of the Crown. At that time Betancuria became the religious capital of the island.[https://web.archive.org/web/20070401163550/http://www.ayuntamientotuineje.com/modules.php?nameContent&pa\nshowpage&pid59&page\n3 The principal economic motor of the epoch was orchilla, cereal and cattle.] Source: Tuineje council.\n\nTwo major pirate attacks took place in 1740, within a month of each other. Two separate bands of English privateers attempted to loot the town of Tuineje. These attacks were however successfully averted by the local population and the island's militia. This successful repelling of the invaders is celebrated at a re-enactment that takes place in Gran Tarajal every year in October.\n\nThe island's garrison was officially instated in 1708. Its colonel assumed the title of Governor at Arms, a hereditary, lifelong appointment which has remained in the Sánchez-Dumpiérrez family. In time, this family increasingly garnered power over the other islands through alliances with the family of Arias de Saavedra and the Lady of Fuerteventura.[https://web.archive.org/web/20070522001858/http://www.corralejograndesplayas.com/info_general.php?id_seccion1&pagina\n3 El marqués de Vallehermoso intenta que la población se ponga a favor del poder de la corona frente al señorío.] Source: La Oliva council During the same year the Assistant Parish of La Oliva and Pájara was created, to become operational in 1711. On December 17, 1790 the Assistant Parish of Tuineje was created, which became a new parish division on June 23, 1792 under the bishop Tavira, with lands including part of the Jandía peninsular, and with a population of 1,670 inhabitants. 1780 saw the start of a barrilla plantation industry.[https://web.archive.org/web/20090110021851/http://www.ayuntamientotuineje.com/modules.php?nameContent&pa\nshowpage&pid59&page\n4 Reseña histórica] Source: Tuineje council\n\nTo the present\n\nIn 1852, a free trade zone was extended by Isabella II to the Canary Islands. Military island rule, which began in 1708, was finally dissolved in 1859, and Puerto de Cabras (now Puerto del Rosario) became the new capital.\n\nThe Canary Islands obtained self-governance in 1912. In 1927, Fuerteventura and Lanzarote became part of the province of Gran Canaria. The seat of the island's government (cabildo insular) is located in Puerto del Rosario. A total of 74,983 people lived on the island in 2003.\n\nBy the 1940s the island had an airport (just west of Puerto del Rosario on the road to Tindaya, still visible today). Mass tourism began to arrive in the mid-1960s, facilitated by the construction of Fuerteventura Airport at El Matorral and the first tourist hotels.\n\nThe island's proximity (a mere 100 km) to the West African coast and the fact that it is part of the Schengen territory make it a prime target destination for undocumented immigrants. However, many have perished while attempting the crossing.http://www.doctorswithoutborders.org/news-stories/press-release/msf-assists-immigrants-arriving-fuerteventura-island\n\nEnvironment\n\nGeography\n\nThe elongated island has an area of 1660 km2.  The island is 100 km long and 31 km wide. It is part of the province of Las Palmas. It is divided into six municipalities:\n*Antigua\n*Betancuria\n*La Oliva\n*Pájara\n*Puerto del Rosario\n*Tuineje\n100 individual settlements are distributed through these municipalities. A nearby islet, Islote de Lobos, is part of the municipality of La Oliva.\n\nLocated just 100 km off the coast of north Africa, it is the second biggest of the islands, after Tenerife, and has the longest white sand beaches in the archipelago. The island is a destination for sun, beach and watersports enthusiasts. It lies at the same latitude as Florida and Mexico and temperatures rarely fall below 18 °C or rise above 32 °C. It counts 152 separate beaches along its seaboard — 50 km of white sand and 25 km of black volcanic shingle.\n\nGeology\n\nFuerteventura is the oldest island in the Canary Islands dating back 20 million years to a volcanic eruption from the Canary hotspot. The majority of the island was created about 5 million years ago and since then has been eroded by wind and precipitation. On the seabed off the West coast of the island rests an enormous slab of bedrock 22 km long and 11 km wide, which appears to have slid off the island largely intact at some point in prehistory, similar to the predicted future collapse of Cumbre Vieja, a geological fault on another Canary Island, La Palma. The last volcanic activity in Fuerteventura occurred between 4,000 and 5,000 years ago.\n\nThe highest point in Fuerteventura is Pico de la Zarza (807 m) in the Southwestern part of the island. Geographical features include Istmo de la Pared which is 5 km wide and is the narrowest part of Fuerteventura. The island is divided into two parts, the northern portion which is Maxorata and the southwestern part called the Jandía peninsula.\n\nBeaches\n\nFuerteventura was chosen among 500 European destinations by the Quality Coast International Certification Program of the European Coastal and Marine Union as one of the most attractive tourist destinations for visitors interested in cultural heritage, environment and sustainability.[http://www.qualitycoast.info/brochure/qc2012.pdf Fuerteventura as sustainable tourism destination]\n\nClimate\n\nThe climate on Fuerteventura is pleasant throughout the year. The island is hence referred to as the island of eternal spring. The sea regulates air temperature, diverting hot Sahara winds away from the island. The island's name in English translates as \"strong fortune\" or \"strong wind\", the Spanish word for wind being viento. During the winter months, temperatures average a high of 22 °C and a low of around 15 °C, whereas during the summer a mean high of 28 °C and a low of 20 °C can be expected. Precipitation is about 147 mm per year, most of which falls in autumn and winter. December is the month with highest rainfall.\n\nA sandstorm known as the Calima (similar to the Sirocco wind, which blows to the North of the Sahara, to Europe) may blow from the Sahara Desert to the Northwest, and can cause high temperatures, low visibility and drying air. Temperatures during this phenomenon rise temporarily by approximately 10 degrees Celsius. The wind brings in fine red dust, The fine white sand is not blown in from Sahara, It is made up of dead coral reef and local seabed upheaval. visibility can drop to between 100 to or even lower and can even bring African locusts to the island.\n\nWildlife\n\nThe island is home to one of the two surviving populations of the threatened Canarian Egyptian vulture. It is also inhabited by many wild dogs and cats. On the barren, rocky land there are Barbary ground squirrels and geckos. Fuerteventura also hosts several migratory and nesting birds. The island has significant populations of the collared dove, common swifts and several finch species especially in the vicinity of holiday developments.\n\nDespite its arid climate, the island is also home to a surprisingly large insect fauna. Butterflies which commonly occur on the island include the clouded yellow (Colias hyale) and the bath white (Pontia daplidice) which feeds on xerophytic cruciferae. The island is also home to the monarch butterfly (Danaus plexippus) and its close African relative Danaus chrysippus. Around holiday developments such as Caleta de Fuste, water is relatively abundant, and dragonfly species including the blue emperor, Anax imperator and the scarlet darter, Crocothemis erythraea can be found. The islands sand dunes and shoreline are home to a number of bee and wasp species including the large Eumenid caterpillar hunting wasp, Delta dimidiatipenne and the striking blue banded bee, (Amegilla canifrons).\n\nHawkmoths also occur on the island. One of the more notable species is Hyles tithymali which feeds on endemic spurges such as Euphorbia regis-jubae. Acherontia atropos, the deaths-head hawkmoth also occurs on the island presumably feeding on members of the Solanaceae, for example, Datura innoxia and Nicotiana glauca which are common weeds in the vicinity of human habitation.\n\nNatural symbols \n\nThe official natural symbols associated with Fuerteventura are Chlamydotis undulata fuertaventurae (hubara or houbara) and Euphorbia handiensis (Cardón de Jandía).[http://www.gobcan.es/boc/1991/061/001.html Ley 7/1991, de 30 de abril, de símbolos de la naturaleza para las Islas Canarias]\n\nFile:Chlamydotis undulata fuertaventurae 3.jpg|Chlamydotis undulata fuertaventurae\nFile:Euphorbia handiensis 02 ies.jpg|Euphorbia handiensis\n\nDemographics \n\nPopulation \n\nThe island has a population of 74,983. Throughout its long history, Fuerteventura has suffered from a population decline due to the economic situation and the climate, which have made it into a desert island. However, the development of tourism during the 1980s has caused the population to grow year on year since then, doubling it in a little less than a decade.\n\nIn 2005, with 86,642 registered inhabitants, the Fuerteventura population was formed by the following:\n* Born on the island: 30,364\n* Born on another Canary Island: 13,175\n* Born elsewhere in Spain: 20,938\n* Born in other countries: 22,165\n\nComparing this data with the 2001 census shows that the number of permanent residents born on the island has increased by just 3,000. The number who have moved in from abroad has increased by 22,910, making this the biggest contributor to population growth in recent years.[https://web.archive.org/web/20070421075723/http://www.gobiernodecanarias.org/istac/publicaciones/pdfs/2006_005.pdf The total population in 2001 was 60,273 inhabitants.] Source: Instituto Canario de Estadística (ISTAC)\n\nEducation \n\nThe island has 116 schools,[https://web.archive.org/web/20070101162743/http://www.gobiernodecanarias.org/istac/estadisticas/educacion/no_universitaria/centros_2003_1.html 2003-2004 data. Only two of the centres are private.] Source: Instituto Canario de Estadística (ISTAC) with a total of 14,337 pupils.[https://web.archive.org/web/20090116041450/http://www.gobiernodecanarias.org/istac/estadisticas/educacion/no_universitaria/alnouniv_2003_1.html 2003-2004 data. Puerto del Rosario has 6,468 alumni of Enseñanzas de Régimen General. Tuineje is the second largest with 2,647] Source: Instituto Canario de Estadística (ISTAC) Of these, 45 are primary schools, ten are secondary schools, six are for Baccalaureate students and four are vocational colleges.[https://web.archive.org/web/20070101162743/http://www.gobiernodecanarias.org/istac/estadisticas/educacion/no_universitaria/centros_2003_1.html 2003-2004 data. Most of these centres are in Puerto del Rosario. At the other extreme, Betancuria only has 3 infant schools and 3 primary schools.] Source: Instituto Canario de Estadística (ISTAC)\n\nFuerteventura also has a centre linked with the National University of Distance Education, offering courses in many subjects including economics, business studies, law, history and tourism.[http://apliweb.uned.es/casociados/mostrar_centro.asp?cod=059000 The centre is directed by Esteban Rodríguez Pérez.]  Source: Universidad Nacional de Educación a Distancia (UNED)\n\nState administration \n\nFuerteventura is governed by the Island Department of the Government of Spain, which holds the rank of a Government Subdepartment. The government building is located in the centre of the capital city, in front of the parish church of the Virgin of Rosario, the patron saint of Puerto del Rosario municipality.\n\nThis institution is charged with representing the Government of Spain on the island, and managing all the functions that are not under control of the Canarian Government. This includes the following public services:\n* Island Security Forces (National Police and Guardia Civil)\n* Puerto del Rosario port and Fuerteventura Airport\n* Tax Agency\n* Customs\n* the Maritime and Coastguard department\n* Driving licences, Traffic and Highways\n* Immigration - the Immigration Detention Centre and residential permits\n* Social Security\n* Red Cross\n* Seprona (the Nature Protection Service)\n* Passports\n\nSince 30 June 2007, the island's governor has been Eustaquio Juan Santana Gil.Orden MAPU/2145/2007, 12 July (BOE 16 July 2007) 4\n\nIsland Council of Fuerteventura (Cabildo)\n\nThe councils, formed as part of the Councils Act of 1912, administer the Canary Islands and have two principal functions. On one hand, they perform services for the Autonomous Community, and on the other, they are the local government centre for the island. In the 2003 elections, Mario Cabrera González was elected as president representing the Canarian Coalition, with 31.02% of the votes, followed by the Spanish Socialist Workers' Party with 27.53%, represented by the Vice President Domingo Fuentes Curbelo.\n\nMunicipalities \n\nThe island is divided into six municipalities with their respective city councils which form part of the FECAM (Federation of Canarian Municipalities). They are governed by the basic legislation of the local regime and their respective organic rules. The populations of the municipalities are as follows:(Population data from INE 2009)\n* Antigua (10,371)\n* Betancuria (680)\n* La Oliva (21,996)\n* Pájara (20,821)\n* Puerto del Rosario (35,667)\n* Tuineje (13,632)\nIn turn, these municipalities are organised into two associations: the Mancomunidad de Municipios del Centro-Norte de Fuerteventura formed from La Oliva and Puerto del Rosario, and the remaining municipalities make up the Mancomunidad de Municipios del Centro-Sur de Fuerteventura.[http://www.dgal.map.es/cgi-bin/webapb/webdriver?MIvalmancomunidades&n_prov\nPalmas,+The associations provinces of Las Palmas.] Source: Ministerio de Administraciones Públicas\n\nEconomy\n\nThe economy of Fuerteventura is mainly based on tourism. Primary tourist areas are located around the existing towns of Corralejo in the north and Morro Jable in Jandia, plus the purely tourist development of Caleta de Fuste, south of Puerto del Rosario. Other main industries are fishing and agriculture (cereals and vegetables). The famous Majorero cheese is locally made from the milk of the indigenous majorera goat.\n\nIn 2009, Fuerteventura recorded the highest EU regional unemployment rate at a NUTS3 level, at 29.2 percent.Eurostat. \n\nTourism\n\nThe first tourist hotel was built in 1965 followed by the construction of Fuerteventura Airport at El Matorral, heralding the dawn of a new era for the island. Fuerteventura, with its 3,000 sunshine hours a year, was placed firmly on the world stage as a major European holiday destination.\nWhile having fully developed tourist facilities, the island has not experienced the overdevelopment found on some other islands and consequently caters for visitors attracted by its rugged natural beauty. Nonetheless, it remains a popular destination for predominantly but not exclusively German, British, French and Italian tourists.\n\nThe summer Trade Winds and winter swells of the Atlantic make this a year-round surfers' paradise, with more exposed areas on the north and west shores such as Corralejo and El Cotillo proving most popular. Wind surfing takes places at locations around the island. Sailors, scuba divers and big-game fishermen are all drawn to these clear blue Atlantic waters where whales, dolphins, marlin and turtles are all common sights. With many hills present throughout the Island, hikers are also attracted to this Island.\n\nExcellent sandy beaches are found in many locations. Western beaches, such as those around El Cotillo, can experience strong surf. The beaches adjoining the extensive sand dunes east of Corralejo are popular, as are the more protected extensive sandy shores of the Playa de Sotavento de Jandia on the southeastern coast between Costa Calma and the Morro Jable. Naked sun bathing and swimming are the norm almost on all beaches.\n\nMuch of the interior, with its large plains, lavascapes and volcanic mountains, consists of protected areas, although there are organised tours and vehicular access across them.\n\nArt and culture \n\nTraditional holidays \n\nLike the rest of the Canaries, Carnival is traditionally one of the biggest festivals celebrated on the island. It is celebrated in different ways in all the towns during February and March. These festivities have a different theme each year. They include activities such as parades and galas to choose the carnival king.\n\nConcerts and festivals \n\nThere are many concerts and festivals held in the auditoriums, such as the Festival of Canarian Music. They are also held in smaller venues across the island, featuring bands such as Estopa, Van Gogh's Ear, and King Afrhica.\n\n*Lebrancho Rock: in 2004, the Town Hall of Puerto del Rosario started this initiative for the growing number of local bands who had been performing in the area for years but had not had the chance to play at the same event.\n*Fuertemusica: like Lebrancho Rock, this festival aims to encourage the local or emerging groups. It started in the same year. This festival is mainly for groups that are already known in the music world. It takes place in El Cotillo.\n*In the municipality of Betancuria (more specifically in the village of Vega de Rio Palmas) held every year the festivities in honor of the Virgen de la Peña, patron saint of the island of Fuerteventura, the most representative is the pilgrimage in which are involved people from all corners of the island. The holiday is celebrated on the third Saturday of September.\n\nFestival Internacional de Cometas/International Kite Festival is held on the second week of November each year centering on the Corralejo Beaches. It attracts kitefliers and kite surfers from all over Europe. It is popular because the winds are warm and constant and the beaches become filled with hundreds of colourful kites of all shapes and sizes.\n\nAuditoriums \n\nFuerteventura has three auditoriums. These are used for all types of performing art. They are also used for non-artistic purposes, such as conferences, charity galas and political meetings.\n\n* The Isle of Fuerteventura Auditorium\n* Gran Tarajal Auditorium\n* Corralejo Auditorium\n\nCentral library \n\nThe Central Library of the Island is located in Antigua's city centre, in the public university. In addition to providing the traditional library services, it has an 180-seat multipurpose room, air conditioning, a wifi zone, and a multimedia room used for seminars, presentations, film festivals etc.\n\nMuseums and exhibition spaces \n\nThe island has several museums with different themes and plenty of exhibition spaces, both public and private. These include:\n\n* The Antigua Windmill Craft Centre\n* The Salt Museum\n* The Atalayita Archeological Interpretation Centre\n\nSculpture park \n\nIn addition to the museums, the capital Puerto del Rosario has an open-air sculpture park consisting of around 100 sculptures by different artists scattered across the city. Most of them were created for the International Symposium of Sculpture celebrated annually since 2001. During the festival, artists come from all over the world to erect their sculptures in the open air, in full view of passers by.\n\nMain sights\n\nSites of interest include Corralejo and El Jable to the north which are made up of fine sand dunes whilst the south is filled with long beaches and remote bays. The constant winds blowing onto the beaches provide a paradise for windsurfing. Surfing is common on the west and north coasts where there are large waves. Windsurfing is common around Corralejo and Playas de Sotavento and wave sailing (windsurfing on the waves) on the coast along the northern half of the island. El Cotillo is a small fishing village in the north-west of the Island famous for a very long beach to the south of the village and few very calm beaches to the north. The northern beaches frequented by snorkeling enthusiasts and sun worshippers alike are referred to as lakes by the locals. \n\nAt Cofete on the western side of Jandía a remote and imposing house - Villa Winter - looks out to sea across wide and generally empty beaches. It was reputedly built by a Mr Winter on land given by Generalisimo Franco. Despite being one of the most beautiful parts of Fuerteventura Cofete has very little touristic facilities.\n\nFor a time, the beaches were home to a popular accidental attraction. On 18 January 1994 the once-beautiful and proud United States Lines ocean liner SS American Star (former America, USS West Point, Australis) was beached in Playa de Garcey during a severe storm. Within a year, she broke in two and later lost her stern. By 2007 the rest of the severely deteriorated ship had collapsed onto her port side, gradually keeling over further and almost completely submerged. By 2008-2012, most of the remains finally slipped below the surface.\n\nFood \n\nThe cuisine is fairly basic due to the customs and climate conditions. They share this simplicity with the other Canary islands, and similarly to them, they use a large quantity of fish. They also use whatever they can grow in the near-barren land. This includes papas arrugadas, a dish of wrinkled potatoes usually served with mojo, which is a hot pepper sauce or with puchero canario, a meat stew.\n\nSeafood is prepared in many ways traditionally, such as pejines (salted fish),Little sun-dried salted fish roasted or burned in a dish with a little alcohol. jareas,Octopus, gilt-head bream or other fish washed and placed in the sun to dry. or sancocho (a type of stew) made from fish, generally the grouper,Groupers are a group of 20 genera in the subfamily Epinephelinae of perciformes. They have a robust body, with a large head resulting in globulous eyes and large mandibles. corvina or sama, boiled after salting, and served with mojo, potatoes, or gofio (a type of grain). People are also very keen on the mussels and limpets collected on the island's coasts.\n\nThey also use meat such as beef and pork to make different dishes or simply to for braising, but their main meat is goat, both from the kids and from the older animals. They eat the goat roasted or stewed. Goats are not only useful for their meat - the Fuerteventurans also use the milk to make the cheese majorero, which has won many prizes. The majorero is mostly made of goats milk, and occasionally it is up to 15% ewes milk. It is cured in pimento oil or gofio meal. Majorero and palmero cheese are the only two Canarian cheeses with protected denomination of origin.\n\nSport \n\nMany sports are commonly played in Fuerteventura, both in the open air and in sports centres across the island.\n\nNative sports \n\nThese are the Canarian sports found on the island:\n\nCanarian wrestling \n\nThe wrestling takes place in a ring of sand called the terrero. Inside it, the two contestants try to knock each other over. Fuerteventura has 14 terreros distributed through all the towns except Betancuria.\n\n* Antigua: Terrero de Antigua.\n* La Oliva: Terrero Venancio Guerra and Terrero de Villaverde.\n* Pájara: Terrero Miguel Díaz La Lajita, Terrero de Morro Jable a Terrero de Pájara.\n* Puerto del Rosario: Terrero de Casillas del Angel, Terrero Manuel Nieves, Terrero de Puerto Cabras, Terrero de Tefía a Terrero de Tetir.\n* Tuineje: Terrero de Gran Tarajal, Terrero de Tamasite, and Terrero Pedro Sánchez in Tarajalejo.\n\nThe island also has a school wrestling league organized by the council and a programme to promote this sport in clubs. Twelve wrestling schools participate in this, based in Antigua, Costa Calma, El Matorral, La Lajita, Lajares, Las Playitas, Morro Jable, Puerto del Rosario, Tefía, Tetir, Unión Sur and Villaverde.\n\nJuego del Palo \n\nJuego del Palo is a Canarian martial art which literally translates as game of the stick. It is played by two players both armed with sticks. They aim to defeat each other without making contact with their opponent's body. The origin of this game is unclear. All we know is that it is based on a method of combat used by the precolonial Canarian people.\n\nFuerteventura has the following Palo clubs:[http://www.juegodelpalocanario.org/modules/cjaycontent/index.php?id=15 Relación de clubes federados.] Fuente: Federación del Juego del Palo Canario\n* Club-Escuela Dunas de Corralejo.\n* Club-Escuela Huriamen de Villaverde.\n* Club-Escuela Puerto Cabras.\n* Club-Escuela Sorinque de Gran Tarajal.\n\nCanarian boules \n\nThis is a similar game to the French Pétanque which is actually played very little on the island, although there are a few teams and courts. Basically the game consists of scoring points by throwing a ball to get it as near as possible to an object called a mingue or boliche. It is played on a rectangular sand or earth pitch which is 18 to(-) long and  wide.\n\nhttp://www.playaboule.com/Simple_petanque_rules.aspx\n\nWatersports \n\nThe sea and climate conditions make the island the perfect place for a huge variety of watersports.\n\nSurfing, windsurfing and kitesurfing \n\nMany types of surfing are popular on the island, including traditional surfing, windsurfing (where the board is propelled by a sail) and most recently kitesurfing. The island has many schools and courses dedicated to teaching these sports.\n\nThe sports where Fuerteventura has the most impact internationally are windsurfing and kitesurfing, mainly due to the International Windsurfing and Kiteboarding Championship. This has run since 1985 and is held at Playas de Sotavento in Pájara municipality. Many important wind and kitesurfing figures compete in this championship, such as the several-times world windsurfing champion Björn Dunkerbeck and Gisela Pulido, the very young kiteboarding champion from Tarifa.\n\nMany Canarian windsurfers are on the Canarian Waveriders circuit, which has been based in Corralejo since 2005.\n\nDiving \n\nDiving schools are just as frequent as surfing ones, all around the coast of Fuerteventura. Unlike the other islands of the archipelago, Fuerteventura has a shelf which at some points goes up to 30 km, making it an ideal place to practice this sport.\n\nTwo of the most useful points for diving are the coast off Playa del Matorral in the South, and the zone between Lobos Island and Corralejo in the north. It is here in Corralejo that the International Sea and Submarine Photography Festival takes places, known as Fimarsub Corralejo - Lobos. During the festival there are beginners' lessons, professional dives, lessons in underwater photography, screenings and other events related to the sport.\n\nSwimming \n\nThere are many swimming pools on the island but the most obvious place to swim is in the open sea. There is an annual swim from Lobos Island to Fuerteventura, held every year since 1999. The event attracts amateur swimmers from all over the Canaries and Spain, and also swimming professionals such as David Meca and Maarten Van der Weijden, the paralympist Jesús Collado Alarcón who won gold medals for 100m backstroke and butterfly in Athens 2004, and Xavi Torres Ramis, the paralympic champion in Barcelona '92, Sydney and Atlanta.\n\nSailing \n\nThe island holds competitions involving different types of boat, such as the lateen and the Optimist. An interesting event is the Tour of Fuerteventura by Kayak, which is organised as a series of stages rather than a competition, and is an easy way to explore the island.\n\nFishing \n\nThe most notable competition here is the Gran Tarajal Fishing Open.\n\nOther sports \n\nSince 2004 the Marcha Ciclotourista has been held in La Oliva and the Criterium Ciclista has been held in Corralejo (also part of the La Oliva municipality) since 2005. Participants include Euskaltel-Euskadi, T-Mobile and a team from Orbea. These competitions have contributed to local interest in the sport and the first professional local team, the Fuerteventura-Canarias, was formed, initially run by Óscar Guerrero, director of Kaiku, although they have not competed for the past few seasons.\n\nThere are various motocross circuits on the island, including Los Alares in Antigua and Isla de Fuerteventura in Puerto del Rosario municipality. They hold regular trials, some of which form part of the Canarian Regional Motocross Championship. Throughout the year there are gravel rally races. Two are part of the Canarian Dirt Rally Championship. These are the Antiguan Rally and the La Oliva Rally.\n\nThe island's main football clubs are CD Union Puerto and CD Cotillo, who play in Group XII of the Spanish Tercera División.\n\nThe resort Playitas on the south coast is since around 2008 equipped with a 50 m swimming pool and has become a destination for triathlon training camps for Europeans. An annual race called Challenge Fuerteventura is held there on the half ironman distance.\n\nPeople \n\n* Manuel Velázquez Cabrera: born in Tiscamanita in 1863, the politician and lawyer who created the island's council.\n* Juan Ismael: the painter, cartoonist and poet born in La Oliva in 1907, considered one of the great Canarian surrealists.\n* Eustaquio Gopar: born in Tuineje in 1866. He was one of the Spanish soldiers involved in the Siege of Baler together with Major Rafael Alonso Mederos, who died of beri-beri during the siege. On his return Eustaquio became mayor over his native people. He held this post both during the republic and under Franco. Fuerteventura. http://en.wikipedia.org/?curid=11475."
  }
}
