{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=11122",
  "eid" : "f9c4e680-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778498792,
  "textBody" : "Freeciv is a single, and multiplayer, turn-based strategy game for workstations and personal computers inspired by the proprietary Sid Meier's Civilization series. It is available for most desktop computer operating systems and available in an online browser based version. Released under the GNU General Public License, Freeciv is free and open source software. The game's default settings are closest to Civilization II, in both gameplay and graphics (including the units and the isometric grid).\n\nPlayers take the role of tribal leaders in 4000 B.C. who must guide their peoples through the centuries. Over time, new technologies are discovered, which allow the construction of new city buildings and the deployment of new units. Players can wage war on one another or form diplomatic relationships.\n\nThe game ends when one civilization has eradicated all others or accomplished the goal of space colonization, or at a given deadline. If more than one civilization remains at the deadline, the player with the highest score wins. Points are awarded for the size of a civilization, its wealth, and cultural and scientific advances.\n\nHistory \n\nAt the computer science department at Aarhus University, three students, avid players of XPilot and of Sid Meier's Civilization, which was a stand-alone PC game for MS-DOS, decided to find out whether the two could be fused into an X-based multiplayer Civilization-like strategy game. The students—Peter Unold, Claus Leth Gregersen and Allan Ove Kjeldbjerg—started development in November 1995; the first playable version was released in January 1996, with bugfixing and small enhancements until April. The rules of the game were close to Civilization, while the client/server architecture was basically that of XPilot.\n\nFor the developers, Freeciv 1.0 was a successful proof of concept, but a rather boring game, so they went back to XPilot.\nOther players and developers took over; they made the game available on many other operating systems, including Linux, Solaris, Ultrix, Amiga OS, and Microsoft Windows.\nLinux distributions started to include Freeciv.\n\nThe main development goal remained to make a Civilization-like game playable over the Internet, with participants on different continents, even when connected with 14400 bit/s modems.\nFreeciv achieved this by using an asynchronous client-server protocol: during each turn, human users play concurrently, and their actions are sent to the server for processing without awaiting the results.\nThis kept the game playable with network latency up to a few hundreds of milliseconds.\n \nIn 1998, computer players were added; they could soon beat newcomers to the game with ease, using only minor forms of cheating.  Computer players are implemented directly in the server; they do not play concurrently with human players, but separately, in between turns.\n\nThe game grew in popularity. A public server was installed on which games could be played around the clock; it retained the games and published a post-game analysis webpage with per-player statistics and an animated map replay.\n\nSubsequent 1.x releases improved the GUI, improved the gameplay, and added many small features.\nOver time, the winning strategy proved to be city smallpox, sprawling the map with many small cities as fast as possible; whoever could develop fastest would win the game, and growing and developing individual cities wasn't worthwhile.\n\nIn practice, from around 2002, experienced players would form teams at the start of the game; a fork of Freeciv included specific features for team play.\n  \nVersion 2.0, released in 2005, introduced several important changes: it became beneficial to develop only a few large cities, full trade routes, and advanced technologies by re-balancing various costs and benefits; and the introduction of team playing features and advanced diplomacy made coop gaming more attractive.\n\nDeveloping one's empire now necessitated a careful plan for city development, including phases of rapture, in which city populations grow quickly, under relatively peaceful conditions; hence, games were almost always played in teams and typically took longer to finish when compared to 1.x games.\n\nIn 2006, TCP and UDP port number 5556 was assigned to Freeciv by IANA.\n\nIn 2017, after being hosted on Gna! for 15 years, Freeciv moved its source repository to GitHub.[https://web.archive.org/web/20170307021144/http://gna.org/projects/freeciv Freeciv project] at Gna! (archived March 3, 2017)\n\nDesign \n\nFreeciv is very configurable, down to the specific rules, so it can be played in Freeciv (default) mode, Civilization mode, Civilization II mode, or a custom mode. One or several players act as game administrators and can configure the game rules. Typically modified rules are:\n\n* Number of players required before the game can be started. The maximum number of players is 126 in the latest version of Freeciv.\n* Speed of technological development\n* Whether there should be computer controlled players\n* Whether (computer controlled) barbarians should invade player settlements\n* How close cities can be built to one another\n* How continents and islands are generated and distributed over the map\n* The map size, where the maximum map size is 2,048,000 map tiles (128,000 before 2.4.0)\n* Map topology (rectangular or hexagonal tiling; whether it wraps horizontally and/or vertically)\n\nIn order to play a game of Freeciv, a user must start up a Freeciv client and connect it to a Freeciv server. Initially, the server is in pre-game phase; in this phase, clients can connect and game configuration parameters can be changed. At some point, the server may be ordered to start a game; in response, it creates game players (nations) and the game map, and assigns every player to either a Freeciv client or a computer player, as specified by the configuration. From that point on, the game will run until it ends or is terminated; the server can never get back into pre-game state.\n\nThe user can also start a game directly from the client: this automatically starts a Freeciv server, connects to it and starts the game.\n\nFeatures \n\nFreeciv's graphics system is configurable: originally, map display was always in overhead mode (like in Civ I), isometric mode (like in Civ II) and optionally hexagonal tiling (like in Civ V) were added later. In both modes, look can be further customized by switching to an alternative set of graphics (called a tileset). The sounds can be replaced as well.\n\nFreeciv supports human-to-human multiplayer gameplay and artificial intelligence (AI) computer players. While the game is turn based, human players move simultaneously. The AI players move separately, partly at the start of a turn, partly at the end.\n\nIn releases before 2.0, AI players could not engage in diplomatic relationships with human players. Under the current releases, AI players will engage in a very predictable, rules-based diplomacy.\n\nVersion 2.2.0 included a map editor, termed Civworld. It can create new scenarios, as well as edit the map currently being played. Basic scripting is available with Freeciv, but is not available in Civworld. Version 2.3 increased the limit of players from 30 to 126.\n\nThere are different clients available SDL, GTK+ (version3) and Xaw3D A Qt client was added in version 2.5. The Freeciv interface is available in over 30 different languages.\n\nThe addition of Gaelic was covered on BBC TV.\n\nPorts and variants \n\nOriginally developed on IRIX, Freeciv has been ported to many different operating systems: it is distributed with many Linux distributions, offers installers for Microsoft Windows, and has been known to run on Mac OS X, MorphOS, Solaris, Ultrix, QNX, OS/2, Cygwin, AmigaOS, AROS, RISC OS, Maemo, ZETA, SkyOS, various BSDs, and smartphones and tablets running Android.\n\nAs of version 2.4, Mac OS X, and as of version 2.3, Windows versions older than Windows XP SP3 are no longer supported. Freeciv is available in the PortableApps format.\n\nFreeciv WebGL 3D and Freeciv-web \n\nFreeciv-web is a version of Freeciv playable online in any modern web browser. It supports 2D isometric graphics or 3D graphics using WebGL. The 3D version is referred to as Freeciv WebGL 3D. The game is a fork of the Freeciv project, with the goal of redesigning the desktop game into a version which can be played online. Freeciv-web introduced several new features, such as play-by-email support freely available to anyone online, and support for playing the game on any real-world map location by choosing a map using Mapbox, which is not available in commercial games in the genre. The game's default settings are closest to Civilization II, both in gameplay and graphics (including the units and the isometric grid). The proposal to create a web-version of Freeciv was made 6 April 2007 on the Freeciv mailing lists, and documented on the Freeciv.org wiki. Freeciv-web was originally created by Andreas Røsdal, but is now maintained by several Freeciv developers on Github.\n\nFreeciv-web is free and open source software. The Freeciv C server is released under the GNU General Public License, while the Freeciv-web client is released under the GNU Affero General Public License. Freeciv-web supports human-to-human multiplayer gameplay and artificial intelligence (AI) computer players. Its features are similar to the Freeciv C client, although not all of the user-interface has been ported from the C client yet.\n\nFreeciv-web can be played online at play.freeciv.org.  All the features required to play a full game of Freeciv are in place, including rendering of an isometric map, technology research, and many dialogs for managing cities, units and other players. The game also supports scenario-games, and includes maps of the world, North America, France, Italy, Japan and the Iberian peninsula. While the game is turn based, human players move simultaneously. The AI players move separately, partly at the start of a turn, partly at the end.\n\nLongturn variants \n\nFreeciv Longturn is a specialized extension of Freeciv featuring daylong game turns with large amounts of human opponents per map, allowing for optimal timing to build up strategic plans and readapt them to the circumstances of each turn. Matches can last anytime from a few weeks to months, and commonly involve 20 to 30 players in each one. \n\nLongturn's first game, now called LT0, started around 2004 on the Polish Civilization fanpage civ.org.pl. It was decided that the game is a bit too slow paced, so a new \"3X movement\" ruleset was devised – basically, all units had their movement points and vision radius tripled. As of September 2014, the latest game was LT33. Changes to settings or rulesets are discussed in the Longturn forum.\n\nGreatturn was a similar concept on another server. Since 2017 Freeciv-web offers a similar One turn per day variant.\n\nReception and impact \n\nIn 2000 CNN placed Freeciv among the \"Top 10 Linux games for the holidays\".[https://web.archive.org/web/20041206174427/http://archives.cnn.com/2000/TECH/computing/12/20/linux.games.idg/index.html Top 10 Linux games for the holidays] by Lee Anderson on cnn.com (December 20, 2000, archived) In 2005, in a O'Reilly article on \"Open Source Mac Gaming\", Freeciv was recommended.[http://archive.oreilly.com/pub/post/open_source_mac_gaming.html Open Source Mac Gaming] by Robert Daeley on O'Reilly Media, Inc. (2005) In 2008 APCMag.com named Freeciv among the Top 5 best (free) open source games. Linux Format selected it as \"HotPick\" in April 2010 and in October 2014.[https://archive.org/stream/Linux_Format_130_April_2010/#page/n71/mode/2up/search/hotgames Linux Format 130 April 2010] page 72[https://archive.org/stream/Linux_Format_189_October_2014/#page/n65/mode/2up/search/hotgames Linux Format 189 October 2014] page 65\n\nFreeciv was described as an example in The Art of Unix Programming by Eric S. Raymond.\nStudies and courses have used Freeciv as a platform for experimenting with the design and programming of intelligent agents.  In 2016 Freeciv was used as a challenge after Chess and Go for a commercial AI.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Freeciv" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=11122" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Freeciv is a single, and multiplayer, turn-based strategy game for workstations and personal computers inspired by the proprietary Sid Meier's Civilization series. It is available for most desktop computer operating systems and available in an online browser based version. Released under the GNU General Public License, Freeciv is free and open source software. The game's default settings are closest to Civilization II, in both gameplay and graphics (including the units and the isometric grid).\n\nPlayers take the role of tribal leaders in 4000 B.C. who must guide their peoples through the centuries. Over time, new technologies are discovered, which allow the construction of new city buildings and the deployment of new units. Players can wage war on one another or form diplomatic relationships.\n\nThe game ends when one civilization has eradicated all others or accomplished the goal of space colonization, or at a given deadline. If more than one civilization remains at the deadline, the player with the highest score wins. Points are awarded for the size of a civilization, its wealth, and cultural and scientific advances.\n\nHistory \n\nAt the computer science department at Aarhus University, three students, avid players of XPilot and of Sid Meier's Civilization, which was a stand-alone PC game for MS-DOS, decided to find out whether the two could be fused into an X-based multiplayer Civilization-like strategy game. The students—Peter Unold, Claus Leth Gregersen and Allan Ove Kjeldbjerg—started development in November 1995; the first playable version was released in January 1996, with bugfixing and small enhancements until April. The rules of the game were close to Civilization, while the client/server architecture was basically that of XPilot.\n\nFor the developers, Freeciv 1.0 was a successful proof of concept, but a rather boring game, so they went back to XPilot.\nOther players and developers took over; they made the game available on many other operating systems, including Linux, Solaris, Ultrix, Amiga OS, and Microsoft Windows.\nLinux distributions started to include Freeciv.\n\nThe main development goal remained to make a Civilization-like game playable over the Internet, with participants on different continents, even when connected with 14400 bit/s modems.\nFreeciv achieved this by using an asynchronous client-server protocol: during each turn, human users play concurrently, and their actions are sent to the server for processing without awaiting the results.\nThis kept the game playable with network latency up to a few hundreds of milliseconds.\n \nIn 1998, computer players were added; they could soon beat newcomers to the game with ease, using only minor forms of cheating.  Computer players are implemented directly in the server; they do not play concurrently with human players, but separately, in between turns.\n\nThe game grew in popularity. A public server was installed on which games could be played around the clock; it retained the games and published a post-game analysis webpage with per-player statistics and an animated map replay.\n\nSubsequent 1.x releases improved the GUI, improved the gameplay, and added many small features.\nOver time, the winning strategy proved to be city smallpox, sprawling the map with many small cities as fast as possible; whoever could develop fastest would win the game, and growing and developing individual cities wasn't worthwhile.\n\nIn practice, from around 2002, experienced players would form teams at the start of the game; a fork of Freeciv included specific features for team play.\n  \nVersion 2.0, released in 2005, introduced several important changes: it became beneficial to develop only a few large cities, full trade routes, and advanced technologies by re-balancing various costs and benefits; and the introduction of team playing features and advanced diplomacy made coop gaming more attractive.\n\nDeveloping one's empire now necessitated a careful plan for city development, including phases of rapture, in which city populations grow quickly, under relatively peaceful conditions; hence, games were almost always played in teams and typically took longer to finish when compared to 1.x games.\n\nIn 2006, TCP and UDP port number 5556 was assigned to Freeciv by IANA.\n\nIn 2017, after being hosted on Gna! for 15 years, Freeciv moved its source repository to GitHub.[https://web.archive.org/web/20170307021144/http://gna.org/projects/freeciv Freeciv project] at Gna! (archived March 3, 2017)\n\nDesign \n\nFreeciv is very configurable, down to the specific rules, so it can be played in Freeciv (default) mode, Civilization mode, Civilization II mode, or a custom mode. One or several players act as game administrators and can configure the game rules. Typically modified rules are:\n\n* Number of players required before the game can be started. The maximum number of players is 126 in the latest version of Freeciv.\n* Speed of technological development\n* Whether there should be computer controlled players\n* Whether (computer controlled) barbarians should invade player settlements\n* How close cities can be built to one another\n* How continents and islands are generated and distributed over the map\n* The map size, where the maximum map size is 2,048,000 map tiles (128,000 before 2.4.0)\n* Map topology (rectangular or hexagonal tiling; whether it wraps horizontally and/or vertically)\n\nIn order to play a game of Freeciv, a user must start up a Freeciv client and connect it to a Freeciv server. Initially, the server is in pre-game phase; in this phase, clients can connect and game configuration parameters can be changed. At some point, the server may be ordered to start a game; in response, it creates game players (nations) and the game map, and assigns every player to either a Freeciv client or a computer player, as specified by the configuration. From that point on, the game will run until it ends or is terminated; the server can never get back into pre-game state.\n\nThe user can also start a game directly from the client: this automatically starts a Freeciv server, connects to it and starts the game.\n\nFeatures \n\nFreeciv's graphics system is configurable: originally, map display was always in overhead mode (like in Civ I), isometric mode (like in Civ II) and optionally hexagonal tiling (like in Civ V) were added later. In both modes, look can be further customized by switching to an alternative set of graphics (called a tileset). The sounds can be replaced as well.\n\nFreeciv supports human-to-human multiplayer gameplay and artificial intelligence (AI) computer players. While the game is turn based, human players move simultaneously. The AI players move separately, partly at the start of a turn, partly at the end.\n\nIn releases before 2.0, AI players could not engage in diplomatic relationships with human players. Under the current releases, AI players will engage in a very predictable, rules-based diplomacy.\n\nVersion 2.2.0 included a map editor, termed Civworld. It can create new scenarios, as well as edit the map currently being played. Basic scripting is available with Freeciv, but is not available in Civworld. Version 2.3 increased the limit of players from 30 to 126.\n\nThere are different clients available SDL, GTK+ (version3) and Xaw3D A Qt client was added in version 2.5. The Freeciv interface is available in over 30 different languages.\n\nThe addition of Gaelic was covered on BBC TV.\n\nPorts and variants \n\nOriginally developed on IRIX, Freeciv has been ported to many different operating systems: it is distributed with many Linux distributions, offers installers for Microsoft Windows, and has been known to run on Mac OS X, MorphOS, Solaris, Ultrix, QNX, OS/2, Cygwin, AmigaOS, AROS, RISC OS, Maemo, ZETA, SkyOS, various BSDs, and smartphones and tablets running Android.\n\nAs of version 2.4, Mac OS X, and as of version 2.3, Windows versions older than Windows XP SP3 are no longer supported. Freeciv is available in the PortableApps format.\n\nFreeciv WebGL 3D and Freeciv-web \n\nFreeciv-web is a version of Freeciv playable online in any modern web browser. It supports 2D isometric graphics or 3D graphics using WebGL. The 3D version is referred to as Freeciv WebGL 3D. The game is a fork of the Freeciv project, with the goal of redesigning the desktop game into a version which can be played online. Freeciv-web introduced several new features, such as play-by-email support freely available to anyone online, and support for playing the game on any real-world map location by choosing a map using Mapbox, which is not available in commercial games in the genre. The game's default settings are closest to Civilization II, both in gameplay and graphics (including the units and the isometric grid). The proposal to create a web-version of Freeciv was made 6 April 2007 on the Freeciv mailing lists, and documented on the Freeciv.org wiki. Freeciv-web was originally created by Andreas Røsdal, but is now maintained by several Freeciv developers on Github.\n\nFreeciv-web is free and open source software. The Freeciv C server is released under the GNU General Public License, while the Freeciv-web client is released under the GNU Affero General Public License. Freeciv-web supports human-to-human multiplayer gameplay and artificial intelligence (AI) computer players. Its features are similar to the Freeciv C client, although not all of the user-interface has been ported from the C client yet.\n\nFreeciv-web can be played online at play.freeciv.org.  All the features required to play a full game of Freeciv are in place, including rendering of an isometric map, technology research, and many dialogs for managing cities, units and other players. The game also supports scenario-games, and includes maps of the world, North America, France, Italy, Japan and the Iberian peninsula. While the game is turn based, human players move simultaneously. The AI players move separately, partly at the start of a turn, partly at the end.\n\nLongturn variants \n\nFreeciv Longturn is a specialized extension of Freeciv featuring daylong game turns with large amounts of human opponents per map, allowing for optimal timing to build up strategic plans and readapt them to the circumstances of each turn. Matches can last anytime from a few weeks to months, and commonly involve 20 to 30 players in each one. \n\nLongturn's first game, now called LT0, started around 2004 on the Polish Civilization fanpage civ.org.pl. It was decided that the game is a bit too slow paced, so a new \"3X movement\" ruleset was devised – basically, all units had their movement points and vision radius tripled. As of September 2014, the latest game was LT33. Changes to settings or rulesets are discussed in the Longturn forum.\n\nGreatturn was a similar concept on another server. Since 2017 Freeciv-web offers a similar One turn per day variant.\n\nReception and impact \n\nIn 2000 CNN placed Freeciv among the \"Top 10 Linux games for the holidays\".[https://web.archive.org/web/20041206174427/http://archives.cnn.com/2000/TECH/computing/12/20/linux.games.idg/index.html Top 10 Linux games for the holidays] by Lee Anderson on cnn.com (December 20, 2000, archived) In 2005, in a O'Reilly article on \"Open Source Mac Gaming\", Freeciv was recommended.[http://archive.oreilly.com/pub/post/open_source_mac_gaming.html Open Source Mac Gaming] by Robert Daeley on O'Reilly Media, Inc. (2005) In 2008 APCMag.com named Freeciv among the Top 5 best (free) open source games. Linux Format selected it as \"HotPick\" in April 2010 and in October 2014.[https://archive.org/stream/Linux_Format_130_April_2010/#page/n71/mode/2up/search/hotgames Linux Format 130 April 2010] page 72[https://archive.org/stream/Linux_Format_189_October_2014/#page/n65/mode/2up/search/hotgames Linux Format 189 October 2014] page 65\n\nFreeciv was described as an example in The Art of Unix Programming by Eric S. Raymond.\nStudies and courses have used Freeciv as a platform for experimenting with the design and programming of intelligent agents.  In 2016 Freeciv was used as a challenge after Chess and Go for a commercial AI. Freeciv. http://en.wikipedia.org/?curid=11122."
  }
}
