{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=17351",
  "eid" : "2b79d0a0-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778582186,
  "textBody" : "Khwaja Ahmad Abbas (7 June 1914 – 1 June 1987), popularly known as K. A. Abbas, was an Indian film director, screenwriter, novelist, and a journalist in the Urdu, Hindi and English languages. He won four National Film Awards in India, and internationally his films won the Palme d'Or (Grand Prize) at the Cannes Film Festival (out of three Palme d'Or nominations) and the Crystal Globe at the Karlovy Vary International Film Festival. As a director and screenwriter, Khwaja Ahmad Abbas is considered one of the pioneers of Indian parallel or neo-realistic cinema, and as a screenwriter he is also known for writing Raj Kapoor's best films.\n\nAs a director, he made a number of important Hindi-Urdu films. Dharti Ke Lal (1946), about the Bengal famine of 1943, was one of Indian cinema's first social-realist films, and opened up the overseas market for Indian films in the Soviet Union. Pardesi (1957) was nominated for the Palme d'Or at the Cannes Film Festival. Shehar Aur Sapna (1963) won the National Film Award for Best Feature Film, while Saat Hindustani (1969) and Do Boond Pani (1972) both won the National Film Awards for Best Feature Film on National Integration.\n\nAs a screenwriter, he penned a number of neo-realistic films, such as Dharti Ke Lal (which he directed), Neecha Nagar (1946) which won the Palme d'Or at the first Cannes Film Festival, Naya Sansar (1941), Jagte Raho (1956), and Saat Hindustani (which he also directed). He is also known for writing the best of Raj Kapoor's films, including the Palme d'Or nominated Awaara (1951), as well as Shree 420 (1955), Mera Naam Joker (1970), Bobby (1973) and Henna (1991).[http://www.filmreference.com/Writers-and-Production-Artists-A-Ba/Abbas-K-A.html K. A. Abbas - Films as writer:, Films as director:] filmreference.com\n\nHis column ‘Last Page’ holds the distinction of being one of the longest-running columns in the history of Indian journalism. The column began in 1935, in Bombay Chronicle, and moved to the Blitz after the Chronicles closure, where it continued until his death in 1987. He was awarded the Padma Shri by the Government of India in 1969.\n\nBiography\n\nEarly life and education\n\nKhwaja Ahmad Abbas was born in Panipat, Haryana. He was born in the home of celebrated Urdu poet, Khwaja Altaf Hussain Hali, a student of Mirza Ghalib. His grandfather Khwaja Gulam Abbas was one of the chief rebels of the 1857 Rebellion movement, and the first martyr of Panipat to be blown from the mouth of a cannon. Abbas's father Ghulam-Us-Sibtain graduated from Aligarh Muslim University, was a tutor of a prince and a prosperous businessman, who modernised the preparation of Unani medicines. Abbas's mother, 'Masroor Khatoon', was the daughter of Sajjad Husain, an enlightened educationist. Abbas took his early education in 'Hali Muslim High School', which was established by his great grand father Hali. He had his early education till 7th in Panipat. He was instructed to read the Arabic text of the Quran and his childhood dreams swung at the compulsive behest of his father. Abbas completed his matriculation at the age of fifteen. He did his B.A. with English literature in 1933 and LL.B. in 1935 from Aligarh Muslim University.\n\nCareer\n\nAbbas began his career as a journalist, when he joined 'National Call', a New Delhi based newspaper after finishing his B.A.. Later while studying law in 1934, started 'Aligarh Opinion', India's first university students' weekly during the pre-independence period.\n\nAfter completing his education at Aligarh Muslim University, Abbas joined the Bombay Chronicle in 1935. He occasionally served a film critic, but after the film critic of the paper died, he was made the editor of the film section.\n\nHe entered films as a part-time publicist for Bombay Talkies in 1936, a production house owned by Himanshu Rai and Devika Rani, to whom he sold his first screenplay Naya Sansar (1941).[http://www.a2zpeople.com/about.asp?nm=Abbas,%20Khwaja%20Ahmad Portail d'informations Ce site est en vente!]  \n\nWhile at the Bombay Chronicle, (1935–1947), he started a weekly column called 'Last Page', which he continued when he joined the Blitz magazine. \"The Last Page\", (‘Azad Kalam’ in the Urdu edition), thus became the longest-running political column in India's history (1935–87). A collection of these columns was later published as two books. He continued to write for The Blitz and Mirror till his last days.\n\nMeanwhile, he had started writing scripts for other directors, Neecha Nagar for Chetan Anand and Dr. Kotnis Ki Amar Kahani for V. Shantaram.\n\nIn 1945, he made his directorial debut with a film based on the Bengal famine of 1943, Dharti Ke Lal (Children of the Earth) for the Indian People's Theatre Association (IPTA). In 1951, he founded his own production company called Naya Sansar, which consistently produced films that were socially relevant including, Anhonee, Munna, Rahi (1953), based on a Mulk Raj Anand story, was on the plight of workers on tea plantations, the National Film Award winner, Shehar Aur Sapna (1964) and Saat Hindustani (1969), which won the Nargis Dutt Award for Best Feature Film on National Integration and is also remembered as Bollywood icon Amitabh Bachchan's debut film.\n\nA prolific writer, and novelist, during his illustrious career spanning five decades, Abbas wrote over 73 books in English, Hindi and Urdu.[http://www.dawn.com/weekly/books/archive/021013/books6.htm AUTHOR: Khwaja Ahmad Abbas (1914-87): Communicator of repute -DAWN - Books and Authors; 13 October 2002]   Abbas was considered a leading light of the Urdu short story. His best known fictional work remains 'Inquilab', based Communal violence, which made him a household name in Indian literature. Like Inquilab, many of his works were translated into many Indian, and foreign languages, like Russian, German, Italian, French and Arabic.\n\nAbbas interviewed several renowned personalities in literary and non-literary fields, including the Russian Prime Minister Khrushchov, American President Roosevelt, Charlie Chaplin, Mao-Tse-Tung and Yuri Gagarin.\n\nHe went on to write scripts for Jagte Raho, and most of the prominent Raj Kapoor films including Awaara, Shri 420, Mera Naam Joker, Bobby and Henna.\n\nHis autobiography, I Am not an Island: An Experiment in Autobiography, was first published in 1977 and later released in 2010.\n\nCensorship case\n\nIn 1968, Abbas made a documentary film called Char Shaher Ek Kahani (A Tale of Four Cities).http://www.abbaska.com/filmography/char-shaher-ek-kahani-tale-four-cities The film depicted the contrast between the luxurious life of the rich in the four cities of Calcutta, Bombay, Madras and Delhi and that of the squalor and poverty of the poor. He approached the Central Board of Film Certification in order to obtain a 'U' (Unrestricted Public Exhibition) certificate. Abbas was however informed by the regional office of the Board that film was not eligible to be granted a 'U' certificate but was suitable for exhibition only for adults. His appeal to the revising committee of the Central Board of Film Certification led to the decision of the censors being upheld.https://indiankanoon.org/doc/1719619/\n\nKhwaja Ahmad Abbas further appealed to the Central Government but the government decided to grant the film a 'U' certificate provided certain scenes were cut. Following this, Abbas approached the Supreme Court of India by filing a writ petition under Article 32 of the Indian Constitution. He claimed that his fundamental right of free speech and expression was denied by the Central Government's refusal to grant the film a 'U' certificate. Abbas also challenged the constitutional validity of pre-censorship on films.http://www.thehindu.com/opinion/lead/udta-punjab-row-a-case-for-cutting-out-the-censor/article14418623.ece\n\nHowever the Supreme Court of India upheld the constitutional validity pre-censorship on films.\nhttp://www.livemint.com/Sundayapp/6ZZM8m9pHkZ2ECPvOee1jN/Film-censorship-and-the-courts.htmlhttp://www.ebc-india.com/lawyer/articles/71v1a10.htm\n\nAwards and honours\n\nFilms \n\n* 1942: BFJA Awards: Best Screenplay: Naya Sansar (1941)[http://www.bfjaawards.com/legacy/pastwin/194205.htm 5th Annual BFJA Awards - Awards For The Year 1941] BFJA Awards Official website.  \n* 1946: Wrote screenplay for Neecha Nagar, which became the only Indian film to win the Palme d'Or (Golden Palm) at the Cannes Film Festival.\n* 1951: Wrote screenplay for Awaara, which was nominated for the Palme d'Or at the Cannes Film Festival.\n* 1956: Wrote screenplay for Jagte Raho, which won the Crystal Globe Grand Prix at the Karlovy Vary International Film Festival in 1957, and the Certificate of Merit at the fourth National Film Awards.[http://iffi.nic.in/Dff2011/Frm4thNFAAward.aspx?PdfName\n4NFA.pdf 4th National film Awards]\n* 1958 Cannes Film Festival: Pardesi nominated for Palme d'Or (Golden Palm)[http://www.imdb.com/name/nm0007815/awards Khwaja Ahmad Abbas - Awards - IMDb] IMBD Awards\n* 1960: All India Certificate of Merit for the Second Best Children's Film - Idd Mubarak\n* 1964: National Film Award for Best Feature Film: Shehar Aur Sapna\n* 1964: Maharashtra State Award: Fakira\n* 1965: International Film Festival Awards (Santa Barbara, USA)): Hamara Ghar[http://www.ourkarnataka.com/Articles/mathapati/abbas_mathapati.htm Abba Mahapati]\n* 1966: Jury Member: 16th Berlin International Film Festival\n* 1970: Nargis Dutt Award for Best Feature Film on National Integration at National Film Awards: Saat Hindustani\n* 1972: Nargis Dutt Award for Best Feature Film on National Integration at National Film Awards: Do Boond Pani\n* 1980: Gold Award for direction: The Naxalites\n\nLiterary\n\nHaryana State Robe of Honour for literary achievements in 1969, the prestigious Ghalib Award for his contribution to Urdu prose literature in 1983[http://www.ghalibinstitute.com/awards.htm Ghalib Award]  \n\nVorosky Literary Award of the Soviet Union in 1984, Urdu Akademi Delhi Special Award 1984, Maharashtra State Urdu Akademi Award in 1985 and the Soviet Award for his contribution to the cause of Indo-Soviet Friendship in 1985.\n\nFilmography\n\n \n* Naya Sansar (1941) – Screenplay, Story\n* Dharti Ke Lal (1946) – Screenwriter, Director, Producer\n* Dr. Kotnis Ki Amar Kahani (1946) – Screenwriter, Story\n* Neecha Nagar (1946) – Screenwriter\n* Aaj Aur Kal (1947) - Director\n* Awara (1951) - Screenwriter, Dialogue\n* Anhonee (1952) - Screenwriter, Dialogue, Story, Director, Producer\n* Rahi 1953 - Director\n* Munna (1954) – Screenwriter, Director, Producer\n* Shree 420 (1955) – Screenwriter, Dialogue, Story\n* Jagte Raho (1956) - Screenwriter\n* Pardesi (1957)– Screenwriter, Director\n* Char Dil Char Rahen (1959) – Screenwriter, Dialogue, Director\n* Eid Mubarak (1960) Documentary / Short - Director\n* Gir Game Sanctuary (1961) Documentary - Director\n* Flight to Assam (1961) - Director\n* Gyara Hazar Ladkian (1962) - Director\n* Teen Gharaney (1963) - Director\n* Shehar Aur Sapna (1964) – Director, Screenwriter\n* Hamara Ghar (1964) - Director\n* Tomorrow Shall Be Better (1965) Documentary - Director\n* Aasman Mahal (1965) – Director\n* Bambai Raat Ki Bahon Mein (1967) - Writer, Director, Producer \n* Dharti Ki Pukaar (1967) Short Film - Director\n* Chaar Shaher Ek Kahani (1968) Documentary - Director\n* Saat Hindustani (1969) – Director, Producer\n* Mera Naam Joker (1970) – Screenwriter, Story\n* Do Boond Pani (1971) - Director \n* Bharat Darshan (1972) Documentary - Director\n* Luv Kush (1972)  Short film - Director\n* Bobby (1973) – Screenwriter, Story\n* Kal Ki Baat (1973) Short Film - Director\n* Achanak (1973) - Screenwriter\n* Juhu (1973) (TV) - Director\n* Faslah (1974) – Director, Producer\n* Papa Miya of Aligarh (1975) Documentary - Director\n* Phir Bolo Aaye Sant Kabir (1976) Documentary - Director\n* Dr. Iqbal (1978) - Documentary - Director\n* The Naxalites (1980) – Screenwriter, Director\n* Hindustan Hamara (1983) Documentary / Short - Director\n* Love in Goa (1983) - Screenwriter\n* Nanga Fakir (1984) (TV) - Director\n* Ek Aadmi (1988) - Director\n* Akanksha (1989) (TV) – Dialogue, Screenplay\n* Henna (1991) – Story\n\nBooks\n\nHe \"published more than seventy books in English, Urdu and Hindi\",M.K. Naik, \"Abbas, Khwaja Ahmad (1914-1987)\" in Eugene Benson (ed.), Encyclopedia of Post-Colonial Literatures in English, Routledge (2004), p. 2 including:\n* Outside India: The Adventures of a Roving Reporter, Hali Pub. House, Delhi, 1939.\n* An Indian looks at America (The Rampart library of good reading), 1943.\n* An Indian looks at America, Thacker, Bombay, 1943.\n* Tomorrow is ours! A novel of the India of Today; Bombay, Popular Book Depot, 1943.\n* \"Let India fight for freedom\", Bombay, Sound magazine (Publication dept.), 1943.\n* Defeat for death: A story without names, Padmaja Publications 1944.\n* \"...and One Did Not Come Back!\", Sound magazine, 1944\n* A report to Gandhiji: A survey of Indian and world events during the 21 months of Gandhiji's incarceration, 1944\n* Invitation to Immortality: a one-act play, Bombay: Padma Pub., 1944.\n* Not all Lies. Delhi: Rajkamal Pub., 1945.\n* Blood and stones and other stories. Bombay: Hind Kitabs, 1947\n* Rice and other stories, Kutub, 1947\n* Kashmir fights for freedom, 1948\n* I Write as I Feel, Hind Kitabs, Bombay, 1948\n* Cages of freedom and other stories, Bombay, Hind Kitabs Ltd., 1952.\n* China can make it: Eye-witness account of the amazing industrial progress in new China, 1952.\n* In the Image of Mao Tse-Tung, Peoples Publishing House, 1953\n* INQILAB. First Great Novel of the Indian Revolution, Jaico Publishing House, 1958\n* Face To Face with Khrushchov, Rajpal & Sons, 1960\n* Till We Reach the Stars. The Story of Yuri Gagarin, Asia Pub. House, 1961\n* The Black sun and Other stories, Jaico Publishing House, 1963.\n* Raat ki bahon mein, Hindi, Radhakr̥ishṇa Prakashan, 1965.\n* Indira Gandhi; return of the red rose, Hind Pocket Books, New Delhi, 1966.\n* Divided heart, Paradise Publications, 1968\n* When Night Falls, 1968.\n* Chabili, Hindi, Allahabad, Mitra Prakashan, 1968.\n* The most beautiful woman in the world, Paradise Publications, 1968\n* Salma aur Samundar, Urdu/Hindi, New Delhi, Komala Pocket Books, 1969.\n* Mera Naam Joker, 1970\n* Maria, Delhi, Hind Pocket Books, 1971.\n* Teen Pahiye, Urdu/Hindi, Delhi, Rajpal & Sons, 1971.\n* Bobby, Urdu/Hindi, 1973\n* Boy meets Girl, Sterling Publishers, 1973\n* That Woman: Her Seven Years in Power; New Delhi, Indian Book Co., 1973\n* Jawaharlal Nehru: Portrait of an integrated Indian; New Delhi, NCERT, 1974.\n* Fasilah\", Urud/Hindi, Hind Pocket Books, Delhi, 1974\n* Distant dream, New Delhi, Sterling Pub., 1975.\n* The walls of glass: A novel, 1977\n* Barrister-at-law: A play about the early life of Mahatma Gandhi, New Delhi, Orient Paperbacks, 1977.\n* Men and women: Specially selected long and short stories, 1977\n* Mad, mad, mad world of Indian films, 1977\n* I Am not an Island: An Experiment in Autobiography, New Delhi, 1977.\n* Four Friends, Arnold-Heinemann, New Delhi, 1977.\n* 20 March 1977: a day like any other day, Vikas Publishing House, New Delhi, 1978.\n* Janata in a jam?, 1978.\n* The Naxalites, Lok Publications, 1979.\n* Bread, beauty, and revolution: being a chronological selection from the Last pages, 1947 to 1981, Marwah Publications, New Delhi, 1982.\n* Nili Sari aur Doosri Kahaniyan̲, Urdu, Maktabah-e-Jamia, New Delhi, 1982.\n* The gun and other stories, Arnold-Heinemann, New Delhi, 1985.\n* The Thirteenth Victim, Amar Prakashan, 1986.\n* The World Is My Village: A Novel With An Index, Ajanta, 1984. \n* Bombay My Bombay: A Love Story of the City, Ajanta Publications/Ajanta Books International, 1987. \n* Indira Gandhi: The Last Post; Bombay, Ramdas G. Bhatkal, 1989\n* Defeat for death: a story without names. Baroda: Padmaja Pub., 1994\n* How Films Are Made, National Book Trust, 1999, \n* Soney Chandi ke Butt, Urdu, Alhamra, 2001, \n* \nFor detailed listing :[http://www.worldcatlibraries.org/search?qau%3AKhwaja+Ahmad+Abbas&sd\ndesc&fqap%3AKhwaja+Ahmad+Abbas&qt\nfacet_ap%3A Results for 'au:Khwaja Ahmad Abbas' > 'Khwaja Ahmad Abbas' [WorldCat.org,[http://www.lib.washington.edu/subject/SouthAsia/guides/pre1947.html South Asian literature in English, Pre-independence era] \n\nBooks on Khwaja Ahmad Abbas\n\n* Ahmad Hasib - The Novels of Khwaja Ahmad Abbas, Seema. 1987\n* Hemendra Singh Chandalia - Ethos of Khwaja Ahmad Abbas, novelist, film-maker, and journalist: A study in social realism, Bohra Prakashan (1996)\n* Raj Narain Raz - Khawaja Ahmed Abbas-Ifkar. Guftar, Kirdar, Haryana Urdu Akademi http://haryanaurdu.nic.in/publication2.htm\n* Vasudev and Lenglet, eds., Indian Cinema Super-bazaar, Vikas, New Delhi, 1978.\n\nArticles on Khwaja Ahmad Abbas\n\n* Dr. R.G. Mathapati, [http://www.ourkarnataka.com/Articles/mathapati/abbas_mathapati.htm \"Abbas: An Island\"]\n* Indian Film Culture (New Delhi), no. 4, September 1964.\n* Film World, vol. 1, no. 10, October 1978.\n* Ghish, S., [http://www.filmreference.com/Writers-and-Production-Artists-A-Ba/Abbas-K-A.html \"K. A. Abbas: A Man in Tune with History\"], Screen (Bombay), 19 June 1987.\n* [http://www.ejumpcut.org/archive/onlinessays/JC33folder/KAAbbas.html Obituary] in Jump Cut (Berkeley, California), no. 33, February 1988.\n* [http://www.dawn.com/weekly/books/archive/021013/books6.htmAnwar Abbas, Communicator of repute], The Dawn, 13 October 2002.\n* Shoba S. Rajgopal, [http://bad.eserver.org/issues/2004/71/rajgopal.html The Legacy of Ajitha]\n* Ismat Chughtai, \"Bachu\", Urdu\n* V. P. Sathe, \"K.A. Abbas, The Crusader\", Filmfare, 16–30 June 1987",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Khwaja Ahmad Abbas" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=17351" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Khwaja Ahmad Abbas (7 June 1914 – 1 June 1987), popularly known as K. A. Abbas, was an Indian film director, screenwriter, novelist, and a journalist in the Urdu, Hindi and English languages. He won four National Film Awards in India, and internationally his films won the Palme d'Or (Grand Prize) at the Cannes Film Festival (out of three Palme d'Or nominations) and the Crystal Globe at the Karlovy Vary International Film Festival. As a director and screenwriter, Khwaja Ahmad Abbas is considered one of the pioneers of Indian parallel or neo-realistic cinema, and as a screenwriter he is also known for writing Raj Kapoor's best films.\n\nAs a director, he made a number of important Hindi-Urdu films. Dharti Ke Lal (1946), about the Bengal famine of 1943, was one of Indian cinema's first social-realist films, and opened up the overseas market for Indian films in the Soviet Union. Pardesi (1957) was nominated for the Palme d'Or at the Cannes Film Festival. Shehar Aur Sapna (1963) won the National Film Award for Best Feature Film, while Saat Hindustani (1969) and Do Boond Pani (1972) both won the National Film Awards for Best Feature Film on National Integration.\n\nAs a screenwriter, he penned a number of neo-realistic films, such as Dharti Ke Lal (which he directed), Neecha Nagar (1946) which won the Palme d'Or at the first Cannes Film Festival, Naya Sansar (1941), Jagte Raho (1956), and Saat Hindustani (which he also directed). He is also known for writing the best of Raj Kapoor's films, including the Palme d'Or nominated Awaara (1951), as well as Shree 420 (1955), Mera Naam Joker (1970), Bobby (1973) and Henna (1991).[http://www.filmreference.com/Writers-and-Production-Artists-A-Ba/Abbas-K-A.html K. A. Abbas - Films as writer:, Films as director:] filmreference.com\n\nHis column ‘Last Page’ holds the distinction of being one of the longest-running columns in the history of Indian journalism. The column began in 1935, in Bombay Chronicle, and moved to the Blitz after the Chronicles closure, where it continued until his death in 1987. He was awarded the Padma Shri by the Government of India in 1969.\n\nBiography\n\nEarly life and education\n\nKhwaja Ahmad Abbas was born in Panipat, Haryana. He was born in the home of celebrated Urdu poet, Khwaja Altaf Hussain Hali, a student of Mirza Ghalib. His grandfather Khwaja Gulam Abbas was one of the chief rebels of the 1857 Rebellion movement, and the first martyr of Panipat to be blown from the mouth of a cannon. Abbas's father Ghulam-Us-Sibtain graduated from Aligarh Muslim University, was a tutor of a prince and a prosperous businessman, who modernised the preparation of Unani medicines. Abbas's mother, 'Masroor Khatoon', was the daughter of Sajjad Husain, an enlightened educationist. Abbas took his early education in 'Hali Muslim High School', which was established by his great grand father Hali. He had his early education till 7th in Panipat. He was instructed to read the Arabic text of the Quran and his childhood dreams swung at the compulsive behest of his father. Abbas completed his matriculation at the age of fifteen. He did his B.A. with English literature in 1933 and LL.B. in 1935 from Aligarh Muslim University.\n\nCareer\n\nAbbas began his career as a journalist, when he joined 'National Call', a New Delhi based newspaper after finishing his B.A.. Later while studying law in 1934, started 'Aligarh Opinion', India's first university students' weekly during the pre-independence period.\n\nAfter completing his education at Aligarh Muslim University, Abbas joined the Bombay Chronicle in 1935. He occasionally served a film critic, but after the film critic of the paper died, he was made the editor of the film section.\n\nHe entered films as a part-time publicist for Bombay Talkies in 1936, a production house owned by Himanshu Rai and Devika Rani, to whom he sold his first screenplay Naya Sansar (1941).[http://www.a2zpeople.com/about.asp?nm=Abbas,%20Khwaja%20Ahmad Portail d'informations Ce site est en vente!]  \n\nWhile at the Bombay Chronicle, (1935–1947), he started a weekly column called 'Last Page', which he continued when he joined the Blitz magazine. \"The Last Page\", (‘Azad Kalam’ in the Urdu edition), thus became the longest-running political column in India's history (1935–87). A collection of these columns was later published as two books. He continued to write for The Blitz and Mirror till his last days.\n\nMeanwhile, he had started writing scripts for other directors, Neecha Nagar for Chetan Anand and Dr. Kotnis Ki Amar Kahani for V. Shantaram.\n\nIn 1945, he made his directorial debut with a film based on the Bengal famine of 1943, Dharti Ke Lal (Children of the Earth) for the Indian People's Theatre Association (IPTA). In 1951, he founded his own production company called Naya Sansar, which consistently produced films that were socially relevant including, Anhonee, Munna, Rahi (1953), based on a Mulk Raj Anand story, was on the plight of workers on tea plantations, the National Film Award winner, Shehar Aur Sapna (1964) and Saat Hindustani (1969), which won the Nargis Dutt Award for Best Feature Film on National Integration and is also remembered as Bollywood icon Amitabh Bachchan's debut film.\n\nA prolific writer, and novelist, during his illustrious career spanning five decades, Abbas wrote over 73 books in English, Hindi and Urdu.[http://www.dawn.com/weekly/books/archive/021013/books6.htm AUTHOR: Khwaja Ahmad Abbas (1914-87): Communicator of repute -DAWN - Books and Authors; 13 October 2002]   Abbas was considered a leading light of the Urdu short story. His best known fictional work remains 'Inquilab', based Communal violence, which made him a household name in Indian literature. Like Inquilab, many of his works were translated into many Indian, and foreign languages, like Russian, German, Italian, French and Arabic.\n\nAbbas interviewed several renowned personalities in literary and non-literary fields, including the Russian Prime Minister Khrushchov, American President Roosevelt, Charlie Chaplin, Mao-Tse-Tung and Yuri Gagarin.\n\nHe went on to write scripts for Jagte Raho, and most of the prominent Raj Kapoor films including Awaara, Shri 420, Mera Naam Joker, Bobby and Henna.\n\nHis autobiography, I Am not an Island: An Experiment in Autobiography, was first published in 1977 and later released in 2010.\n\nCensorship case\n\nIn 1968, Abbas made a documentary film called Char Shaher Ek Kahani (A Tale of Four Cities).http://www.abbaska.com/filmography/char-shaher-ek-kahani-tale-four-cities The film depicted the contrast between the luxurious life of the rich in the four cities of Calcutta, Bombay, Madras and Delhi and that of the squalor and poverty of the poor. He approached the Central Board of Film Certification in order to obtain a 'U' (Unrestricted Public Exhibition) certificate. Abbas was however informed by the regional office of the Board that film was not eligible to be granted a 'U' certificate but was suitable for exhibition only for adults. His appeal to the revising committee of the Central Board of Film Certification led to the decision of the censors being upheld.https://indiankanoon.org/doc/1719619/\n\nKhwaja Ahmad Abbas further appealed to the Central Government but the government decided to grant the film a 'U' certificate provided certain scenes were cut. Following this, Abbas approached the Supreme Court of India by filing a writ petition under Article 32 of the Indian Constitution. He claimed that his fundamental right of free speech and expression was denied by the Central Government's refusal to grant the film a 'U' certificate. Abbas also challenged the constitutional validity of pre-censorship on films.http://www.thehindu.com/opinion/lead/udta-punjab-row-a-case-for-cutting-out-the-censor/article14418623.ece\n\nHowever the Supreme Court of India upheld the constitutional validity pre-censorship on films.\nhttp://www.livemint.com/Sundayapp/6ZZM8m9pHkZ2ECPvOee1jN/Film-censorship-and-the-courts.htmlhttp://www.ebc-india.com/lawyer/articles/71v1a10.htm\n\nAwards and honours\n\nFilms \n\n* 1942: BFJA Awards: Best Screenplay: Naya Sansar (1941)[http://www.bfjaawards.com/legacy/pastwin/194205.htm 5th Annual BFJA Awards - Awards For The Year 1941] BFJA Awards Official website.  \n* 1946: Wrote screenplay for Neecha Nagar, which became the only Indian film to win the Palme d'Or (Golden Palm) at the Cannes Film Festival.\n* 1951: Wrote screenplay for Awaara, which was nominated for the Palme d'Or at the Cannes Film Festival.\n* 1956: Wrote screenplay for Jagte Raho, which won the Crystal Globe Grand Prix at the Karlovy Vary International Film Festival in 1957, and the Certificate of Merit at the fourth National Film Awards.[http://iffi.nic.in/Dff2011/Frm4thNFAAward.aspx?PdfName\n4NFA.pdf 4th National film Awards]\n* 1958 Cannes Film Festival: Pardesi nominated for Palme d'Or (Golden Palm)[http://www.imdb.com/name/nm0007815/awards Khwaja Ahmad Abbas - Awards - IMDb] IMBD Awards\n* 1960: All India Certificate of Merit for the Second Best Children's Film - Idd Mubarak\n* 1964: National Film Award for Best Feature Film: Shehar Aur Sapna\n* 1964: Maharashtra State Award: Fakira\n* 1965: International Film Festival Awards (Santa Barbara, USA)): Hamara Ghar[http://www.ourkarnataka.com/Articles/mathapati/abbas_mathapati.htm Abba Mahapati]\n* 1966: Jury Member: 16th Berlin International Film Festival\n* 1970: Nargis Dutt Award for Best Feature Film on National Integration at National Film Awards: Saat Hindustani\n* 1972: Nargis Dutt Award for Best Feature Film on National Integration at National Film Awards: Do Boond Pani\n* 1980: Gold Award for direction: The Naxalites\n\nLiterary\n\nHaryana State Robe of Honour for literary achievements in 1969, the prestigious Ghalib Award for his contribution to Urdu prose literature in 1983[http://www.ghalibinstitute.com/awards.htm Ghalib Award]  \n\nVorosky Literary Award of the Soviet Union in 1984, Urdu Akademi Delhi Special Award 1984, Maharashtra State Urdu Akademi Award in 1985 and the Soviet Award for his contribution to the cause of Indo-Soviet Friendship in 1985.\n\nFilmography\n\n \n* Naya Sansar (1941) – Screenplay, Story\n* Dharti Ke Lal (1946) – Screenwriter, Director, Producer\n* Dr. Kotnis Ki Amar Kahani (1946) – Screenwriter, Story\n* Neecha Nagar (1946) – Screenwriter\n* Aaj Aur Kal (1947) - Director\n* Awara (1951) - Screenwriter, Dialogue\n* Anhonee (1952) - Screenwriter, Dialogue, Story, Director, Producer\n* Rahi 1953 - Director\n* Munna (1954) – Screenwriter, Director, Producer\n* Shree 420 (1955) – Screenwriter, Dialogue, Story\n* Jagte Raho (1956) - Screenwriter\n* Pardesi (1957)– Screenwriter, Director\n* Char Dil Char Rahen (1959) – Screenwriter, Dialogue, Director\n* Eid Mubarak (1960) Documentary / Short - Director\n* Gir Game Sanctuary (1961) Documentary - Director\n* Flight to Assam (1961) - Director\n* Gyara Hazar Ladkian (1962) - Director\n* Teen Gharaney (1963) - Director\n* Shehar Aur Sapna (1964) – Director, Screenwriter\n* Hamara Ghar (1964) - Director\n* Tomorrow Shall Be Better (1965) Documentary - Director\n* Aasman Mahal (1965) – Director\n* Bambai Raat Ki Bahon Mein (1967) - Writer, Director, Producer \n* Dharti Ki Pukaar (1967) Short Film - Director\n* Chaar Shaher Ek Kahani (1968) Documentary - Director\n* Saat Hindustani (1969) – Director, Producer\n* Mera Naam Joker (1970) – Screenwriter, Story\n* Do Boond Pani (1971) - Director \n* Bharat Darshan (1972) Documentary - Director\n* Luv Kush (1972)  Short film - Director\n* Bobby (1973) – Screenwriter, Story\n* Kal Ki Baat (1973) Short Film - Director\n* Achanak (1973) - Screenwriter\n* Juhu (1973) (TV) - Director\n* Faslah (1974) – Director, Producer\n* Papa Miya of Aligarh (1975) Documentary - Director\n* Phir Bolo Aaye Sant Kabir (1976) Documentary - Director\n* Dr. Iqbal (1978) - Documentary - Director\n* The Naxalites (1980) – Screenwriter, Director\n* Hindustan Hamara (1983) Documentary / Short - Director\n* Love in Goa (1983) - Screenwriter\n* Nanga Fakir (1984) (TV) - Director\n* Ek Aadmi (1988) - Director\n* Akanksha (1989) (TV) – Dialogue, Screenplay\n* Henna (1991) – Story\n\nBooks\n\nHe \"published more than seventy books in English, Urdu and Hindi\",M.K. Naik, \"Abbas, Khwaja Ahmad (1914-1987)\" in Eugene Benson (ed.), Encyclopedia of Post-Colonial Literatures in English, Routledge (2004), p. 2 including:\n* Outside India: The Adventures of a Roving Reporter, Hali Pub. House, Delhi, 1939.\n* An Indian looks at America (The Rampart library of good reading), 1943.\n* An Indian looks at America, Thacker, Bombay, 1943.\n* Tomorrow is ours! A novel of the India of Today; Bombay, Popular Book Depot, 1943.\n* \"Let India fight for freedom\", Bombay, Sound magazine (Publication dept.), 1943.\n* Defeat for death: A story without names, Padmaja Publications 1944.\n* \"...and One Did Not Come Back!\", Sound magazine, 1944\n* A report to Gandhiji: A survey of Indian and world events during the 21 months of Gandhiji's incarceration, 1944\n* Invitation to Immortality: a one-act play, Bombay: Padma Pub., 1944.\n* Not all Lies. Delhi: Rajkamal Pub., 1945.\n* Blood and stones and other stories. Bombay: Hind Kitabs, 1947\n* Rice and other stories, Kutub, 1947\n* Kashmir fights for freedom, 1948\n* I Write as I Feel, Hind Kitabs, Bombay, 1948\n* Cages of freedom and other stories, Bombay, Hind Kitabs Ltd., 1952.\n* China can make it: Eye-witness account of the amazing industrial progress in new China, 1952.\n* In the Image of Mao Tse-Tung, Peoples Publishing House, 1953\n* INQILAB. First Great Novel of the Indian Revolution, Jaico Publishing House, 1958\n* Face To Face with Khrushchov, Rajpal & Sons, 1960\n* Till We Reach the Stars. The Story of Yuri Gagarin, Asia Pub. House, 1961\n* The Black sun and Other stories, Jaico Publishing House, 1963.\n* Raat ki bahon mein, Hindi, Radhakr̥ishṇa Prakashan, 1965.\n* Indira Gandhi; return of the red rose, Hind Pocket Books, New Delhi, 1966.\n* Divided heart, Paradise Publications, 1968\n* When Night Falls, 1968.\n* Chabili, Hindi, Allahabad, Mitra Prakashan, 1968.\n* The most beautiful woman in the world, Paradise Publications, 1968\n* Salma aur Samundar, Urdu/Hindi, New Delhi, Komala Pocket Books, 1969.\n* Mera Naam Joker, 1970\n* Maria, Delhi, Hind Pocket Books, 1971.\n* Teen Pahiye, Urdu/Hindi, Delhi, Rajpal & Sons, 1971.\n* Bobby, Urdu/Hindi, 1973\n* Boy meets Girl, Sterling Publishers, 1973\n* That Woman: Her Seven Years in Power; New Delhi, Indian Book Co., 1973\n* Jawaharlal Nehru: Portrait of an integrated Indian; New Delhi, NCERT, 1974.\n* Fasilah\", Urud/Hindi, Hind Pocket Books, Delhi, 1974\n* Distant dream, New Delhi, Sterling Pub., 1975.\n* The walls of glass: A novel, 1977\n* Barrister-at-law: A play about the early life of Mahatma Gandhi, New Delhi, Orient Paperbacks, 1977.\n* Men and women: Specially selected long and short stories, 1977\n* Mad, mad, mad world of Indian films, 1977\n* I Am not an Island: An Experiment in Autobiography, New Delhi, 1977.\n* Four Friends, Arnold-Heinemann, New Delhi, 1977.\n* 20 March 1977: a day like any other day, Vikas Publishing House, New Delhi, 1978.\n* Janata in a jam?, 1978.\n* The Naxalites, Lok Publications, 1979.\n* Bread, beauty, and revolution: being a chronological selection from the Last pages, 1947 to 1981, Marwah Publications, New Delhi, 1982.\n* Nili Sari aur Doosri Kahaniyan̲, Urdu, Maktabah-e-Jamia, New Delhi, 1982.\n* The gun and other stories, Arnold-Heinemann, New Delhi, 1985.\n* The Thirteenth Victim, Amar Prakashan, 1986.\n* The World Is My Village: A Novel With An Index, Ajanta, 1984. \n* Bombay My Bombay: A Love Story of the City, Ajanta Publications/Ajanta Books International, 1987. \n* Indira Gandhi: The Last Post; Bombay, Ramdas G. Bhatkal, 1989\n* Defeat for death: a story without names. Baroda: Padmaja Pub., 1994\n* How Films Are Made, National Book Trust, 1999, \n* Soney Chandi ke Butt, Urdu, Alhamra, 2001, \n* \nFor detailed listing :[http://www.worldcatlibraries.org/search?qau%3AKhwaja+Ahmad+Abbas&sd\ndesc&fqap%3AKhwaja+Ahmad+Abbas&qt\nfacet_ap%3A Results for 'au:Khwaja Ahmad Abbas' > 'Khwaja Ahmad Abbas' [WorldCat.org,[http://www.lib.washington.edu/subject/SouthAsia/guides/pre1947.html South Asian literature in English, Pre-independence era] \n\nBooks on Khwaja Ahmad Abbas\n\n* Ahmad Hasib - The Novels of Khwaja Ahmad Abbas, Seema. 1987\n* Hemendra Singh Chandalia - Ethos of Khwaja Ahmad Abbas, novelist, film-maker, and journalist: A study in social realism, Bohra Prakashan (1996)\n* Raj Narain Raz - Khawaja Ahmed Abbas-Ifkar. Guftar, Kirdar, Haryana Urdu Akademi http://haryanaurdu.nic.in/publication2.htm\n* Vasudev and Lenglet, eds., Indian Cinema Super-bazaar, Vikas, New Delhi, 1978.\n\nArticles on Khwaja Ahmad Abbas\n\n* Dr. R.G. Mathapati, [http://www.ourkarnataka.com/Articles/mathapati/abbas_mathapati.htm \"Abbas: An Island\"]\n* Indian Film Culture (New Delhi), no. 4, September 1964.\n* Film World, vol. 1, no. 10, October 1978.\n* Ghish, S., [http://www.filmreference.com/Writers-and-Production-Artists-A-Ba/Abbas-K-A.html \"K. A. Abbas: A Man in Tune with History\"], Screen (Bombay), 19 June 1987.\n* [http://www.ejumpcut.org/archive/onlinessays/JC33folder/KAAbbas.html Obituary] in Jump Cut (Berkeley, California), no. 33, February 1988.\n* [http://www.dawn.com/weekly/books/archive/021013/books6.htmAnwar Abbas, Communicator of repute], The Dawn, 13 October 2002.\n* Shoba S. Rajgopal, [http://bad.eserver.org/issues/2004/71/rajgopal.html The Legacy of Ajitha]\n* Ismat Chughtai, \"Bachu\", Urdu\n* V. P. Sathe, \"K.A. Abbas, The Crusader\", Filmfare, 16–30 June 1987. Khwaja Ahmad Abbas. http://en.wikipedia.org/?curid=17351."
  }
}
