{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=13451",
  "eid" : "099bc560-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778525366,
  "textBody" : "A horror film is a movie that seeks to elicit a physiological reaction, such as an elevated heartbeat, through the use of fear and shocking one’s audiences. Initially often inspired by literature from authors like Edgar Allan Poe, Bram Stoker and Mary Shelley, horror has existed as a film genre for more than a century. The macabre and the supernatural are frequent themes. Horror may also overlap with the fantasy, supernatural fiction and thriller genres.\n\nHorror films often aim to evoke viewers' nightmares, fears, revulsions and terror of the unknown. Plots within the horror genre often involve the intrusion of an evil force, event, or personage into the everyday world. Prevalent elements include ghosts, aliens, vampires, werewolves, demons, satanism, gore, torture, vicious animals, evil witches, monsters, zombies, cannibals, psychopaths, natural or man-made disasters, and serial killers.\n\nSome subgenres of horror film include action horror, comedy horror, body horror, disaster horror, holiday horror, horror drama, psychological horror, science fiction horror, slasher horror, supernatural horror, gothic horror, natural horror, zombie horror, first-person horror and teen horror.\n\nHistory\n\n1889–1900s\n\nThe first depictions of supernatural events appear in several of the silent shorts created by the film pioneer Georges Méliès in the late 1890s, the best known being Le Manoir du Diable, which is sometimes credited as being the first horror film. Another of his horror projects was La Caverne maudite (1898) (a.k.a. The Cave of the Demons, literally \"the accursed cave\"). Japan made early forays into the horror genre with Bake Jizo (Jizo the Spook) and Shinin no Sosei (Resurrection of a Corpse), both made in 1898. The era featured a slew of literary adaptations, adapting the works of Poe and Dante, among others. In 1908, Selig Polyscope Company produced Dr. Jekyll and Mr. Hyde.\n\n1910s–1920s\n\nUnited States\n\nIn 1910, Edison Studios produced the first filmed version of Frankenstein. The macabre nature of the source materials used made the films synonymous with the horror film genre.\n\nThough the word \"horror\" to describe the film genre would not be used until the 1930s (when Universal Pictures released their initial monster films), earlier American productions often relied on horror themes. Some notable examples include The Hunchback of Notre Dame (1923), The Phantom of the Opera (1925), The Cat and the Canary (1927), The Unknown (1927), and The Man Who Laughs (1928). Many of these early films were considered dark melodramas because of their stock characters and emotion-heavy plots that focused on romance, violence, suspense, and sentimentality.\n\nThe trend of inserting an element of macabre into American pre-horror melodramas continued into the 1920s. Directors known for relying on macabre in their films during the 1920s were Maurice Tourneur, Rex Ingram, and Tod Browning. Ingram's The Magician (1926) contains one of the first examples of a \"mad doctor\" and is said to have had a large influence on James Whale's version of Frankenstein. The Unholy Three (1925) is an example of Browning's use of macabre and unique style of morbidity; he remade the film in 1930 as a talkie, though The Terror (1928) was the first horror film with sound.\n\nGermany\n\nBefore and during the Weimar Republic era, German Expressionist filmmakers would significantly influence later productions. Paul Wegener's The Student of Prague (1913) and The Golem trilogy (1915–20), as well as Robert Wiene's The Cabinet of Dr. Caligari (1920), Arthur Robison's Warning Shadows (1923), and Paul Leni's Waxworks (1924), were influential films at the time. The first vampire-themed movie, Nosferatu (1922), was made during this period; it was an unauthorized adaptation of Bram Stoker's Dracula.\n\nSweden, Denmark and France\n\nOther European countries also, contributed to the genre during this period. Victor Sjöström's The Phantom Carriage (Sweden, 1920) is a cautionary tale about a supernatural legend, Benjamin Christensen's Häxan (Denmark/Sweden, 1922) is a documentary-style, horror film, about witchcraft and superstition, and in 1928, Frenchman, Jean Epstein produced an influential film, The Fall of the House of Usher, based on the Poe tale.\n\n1930s–1940s\n\nDuring the early period of talking pictures, Universal Pictures began a successful Gothic horror film series. Tod Browning's Dracula (1931) was quickly followed by James Whale's Frankenstein (1931) and The Old Dark House (1932), both featuring monstrous mute antagonists. Some of these films blended science fiction with Gothic horror, such as Whale's The Invisible Man (1933) and featured a mad scientist, mirroring earlier German films. Frankenstein was the first in a series of remakes which lasted for years. The Mummy (1932) introduced Egyptology as a theme; Make-up artist Jack Pierce was responsible for the iconic image of the monster, and others in the series. Universal's horror cycle continued into the 1940s with B movies including The Wolf Man (1941), as well as a number of films uniting several of the most common monsters.The American Horror Film by Reynold Humpries\n\nOther studios followed Universal's lead. The once controversial Freaks (1932), based on the short story \"Spurs\", was made by MGM, though the studio disowned the completed film, and it remained banned, in the United Kingdom, for thirty years.Derek Malcolm [https://www.theguardian.com/film/1999/apr/15/derekmalcolmscenturyoffilm.derekmalcolm \"Tod Browning: Freaks\"], The Guardian, 15 April 1999; A Century of Films, London: IB Tauris, 2000, p.66-67. Dr. Jekyll and Mr. Hyde (Paramount, 1931) is remembered for its innovative use of photographic filters to create Jekyll's transformation before the camera.David J. Skal, The Monster Show: a Cultural History of Horror, New York: Faber, p.142. With the progression of the genre, actors like Boris Karloff and Bela Lugosi were beginning to build entire careers in horror. Both appeared in three of Val Lewton's atmospheric B movies for RKO in the mid-1940s, including The Body Snatcher (1945).\n\n1950s–1960s\n\nWith advances in technology, the tone of horror films shifted from the Gothic towards contemporary concerns. Two subgenres began to emerge: the Doomsday film and the Demonic film.Charles Derry, Dark Dreams: A Psychological History of the Modern Horror Film; A S Barnes & Co, 1977. Low-budget productions featured humanity overcoming threats such as alien invasions and deadly mutations to people, plants and insects. Japan's experience with Hiroshima and Nagasaki bore the well-known Godzilla (1954) and its sequels, featuring mutation from the effects of nuclear radiation.\n\nHollywood directors and producers found ample opportunity for audience exploitation through gimmicks. House of Wax (1953) used the advent of 3-D film to draw audiences, while The Tingler used electric seat buzzers in 1959. Filmmakers continued to merge elements of science fiction and horror over the following decades. Considered a \"pulp masterpiece\"Geoff Andrew, \"The Incredible Shrinking Man\", in John Pym (ed.) Time Out Film Guide 2009, London: Penguin, 2008, p.506. of the era was The Incredible Shrinking Man (1957), based on Richard Matheson's existentialist novel. The film conveyed the fears of living in the Atomic Age and the terror of social alienation.\n\nDuring the later 1950s, the United Kingdom emerged as a major producer of horror films. The Hammer company focused on the genre for the first time, enjoying huge international success from films involving classic horror characters which were shown in color for the first time. Drawing on Universal's precedent, many films produced were Frankenstein and Dracula remakes, followed by many sequels. Christopher Lee starred in a number of Hammer Horror films, including The Curse of Frankenstein (1957), which Professor Patricia MacCormac called the \"first really gory horror film, showing blood and guts in colour\". Other British companies contributed to a boom in horror film production in the United Kingdom during the 1960s and 1970s.\n\nReleased in May 1960, the British psychological thriller Peeping Tom (1960) by Michael Powell is a progenitor of the contemporary \"slasher film\".Mark D. Eckel (2014). \"When the Lights Go Down\". p. 167. WestBow Press. Alfred Hitchcock cemented the subgenre with Psycho released later that year. France continued the mad scientist theme, while Italian horror films became internationally notable. American International Pictures (AIP) made a series of Edgar Allan Poe–themed films.\n\nFilms in the era used the supernatural premise to express the horror of the demonic. The Innocents (1961) based on the Henry James novel The Turn of the Screw. Meanwhile, ghosts were a dominant theme in Japanese horror, in such films as Kwaidan, Onibaba (both 1964) and Kuroneko (1968).\n\nRosemary's Baby (1968) is an American psychological horror film written and directed by Roman Polanski, based on the bestselling 1967 novel of the same name by Ira Levin. Another influential American horror film of this period was George A. Romero's Night of the Living Dead (1968). Produced and directed by Romero on a budget of $114,000, it grossed $30 million internationally. An Armageddon film about zombies, it began to combine psychological insights with gore. Distancing the era from earlier gothic trends, late 1960s films brought horror into everyday life. Low-budget splatter films from the likes of Herschell Gordon Lewis also gained prominence.\n\n1970s–1980s\n\nThe financial successes of the low-budget gore films of the ensuing years, and the critical and popular success of Rosemary's Baby, led to the release of more films with occult themes during the 1970s. The Exorcist (1973), the first of these movies, was a significant commercial success and was followed by scores of horror films in which a demon entity is represented as the supernatural evil, often by impregnating women or possessing children.\n\n\"Evil children\" and reincarnation became popular subjects. Robert Wise's film Audrey Rose (1977) for example, deals with a man who claims that his daughter is the reincarnation of another dead person. Alice, Sweet Alice (1977), is another Catholic-themed horror slasher about a little girl's murder and her sister being the prime suspect. Another popular occult horror movie was The Omen (1976), where a man realizes that his five-year-old adopted son is the Antichrist. Invincible to human intervention, Demons became villains in many horror films with a postmodern style and a dystopian worldview. Another example is The Sentinel (1977), in which a fashion model discovers that her new brownstone residence may actually be a portal to Hell.\n\nDuring the 1970s, Italian filmmakers Mario Bava, Riccardo Freda, Antonio Margheriti and Dario Argento developed giallo horror films that became classics and influenced the genre in other countries. Representative films include: Black Sunday, Blood and Black Lace, Castle of Blood, Twitch of the Death Nerve, The Bird with the Crystal Plumage, Deep Red and Suspiria.\n\nDon't Look Now (1973), a independent British-Italian film directed by Nicolas Roeg, was also notable. Its focus on the psychology of grief was unusually strong for a film featuring a supernatural horror plot. Another notable film is The Wicker Man (1973), a British mystery horror film dealing with the practice of ancient pagan rituals in the modern era. It was written by Anthony Shaffer and directed by Robin Hardy.\n\nThe ideas of the 1960s began to influence horror films, as the youth involved in the counterculture began exploring the medium. Wes Craven's The Hills Have Eyes (1977) and The Last House on the Left (1972) along with Tobe Hooper's The Texas Chain Saw Massacre (1974) (based on the Ed Gein case) recalled the Vietnam War; while George A. Romero satirized the consumer society in his zombie sequel, Dawn of the Dead (1978). Meanwhile, the subgenre of comedy horror re-emerged in the cinema with The Abominable Dr. Phibes (1971), Young Frankenstein (1974), The Rocky Horror Picture Show (1975), and An American Werewolf in London (1981) among others.\n\nAlso in the 1970s, the works of the horror author Stephen King began to be adapted for the screen, beginning with Brian De Palma's adaptation of Carrie (1976), King's first published novel, for which the two female leads (Sissy Spacek and Piper Laurie) gained Oscar nominations. Next, was his third published novel, The Shining (1980), directed by Stanley Kubrick, which was a sleeper at the box office. At first, many critics and viewers had negative feedback toward The Shining. However, the film is now known as one of Hollywood's most classic horror films.\n\nThis psychological horror film has a variety of themes; \"evil children\", alcoholism, telepathy and insanity. This type of film is an example of how Hollywood's idea of horror started to evolve. Murder and violence were no longer the main themes of horror films. During the 1970s and 1980s, psychological and supernatural horror started to take over cinema. Another classic Hollywood horror film is Tobe Hooper's Poltergeist (1982). Poltergeist is ranked the 20th scariest movie ever made by the Chicago Film Critics Association. Both The Shining and Poltergeist involve horror being based on real-estate values. The evil and horror throughout the films come from where the movies are taking place.The American Horror Film by Reynold HumphriesAmerican Horror Film edited by Stefen Hantke\n\nThe Amityville Horror is a 1979 supernatural horror film directed by Stuart Rosenberg, based on Jay Anson's 1977 book of the same name. It stars James Brolin and Margot Kidder as a young couple who purchase a home they come to find haunted by combative supernatural forces. The Changeling is a 1980 Canadian psychological horror film directed by Peter Medak.\n\nA cycle of slasher films was made during the 1970s and 1980s. John Carpenter created Halloween (1978), Sean S. Cunningham made Friday the 13th (1980), Wes Craven directed A Nightmare on Elm Street (1984), and Clive Barker made Hellraiser (1987). This subgenre would be mined by dozens of increasingly violent movies throughout the subsequent decades, and Halloween became a successful independent film. Another notable 1970s slasher film is Bob Clark's Black Christmas (1974). Sleepaway Camp (1983) is known for its twist ending, which is considered by some to be one of the most shocking endings among horror films. My Bloody Valentine (1981) is a slasher film dealing with Valentine's Day fiction. The boom in slasher films provided enough material for numerous comedic spoofs of the genre including Saturday the 14th (1981), Student Bodies (1981), National Lampoon's Class Reunion (1983), and Hysterical (1983).\n\nSome films explored urban legends such as \"The babysitter and the man upstairs\".\nA notable example is When a Stranger Calls (1979), an American psychological horror film directed by Fred Walton starring Carol Kane and Charles Durning.\n\nSteven Spielberg's Jaws (1975) began a new wave of killer animal stories, such as Orca (1977) and Up from the Depths (1979). Jaws is often credited as being one of the first films to use traditionally B movie elements such as horror and mild gore in a big-budget Hollywood film. In 1979, Don Coscarelli's Phantasm was the first of the Phantasm franchise.\n\nAlien (1979), a British-American science-fiction horror film directed by Ridley Scott was very successful, receiving both critical acclaim and being a box office success. John Carpenter's movie The Thing (1982) was also a mix of horror and sci-fi, but it was neither a box-office nor critical hit, but soon became a cult classic. However, nearly 20 years after its release, it was praised for using ahead-of-its-time special effects and paranoia.\n\nThe 1980s saw a wave of gory \"B movie\" horror films – although most of them were poorly reviewed by critics, many became cult classics and later saw success with critics. A significant example is Sam Raimi's Evil Dead movies, which were low-budget gorefests but had a very original plotline which was later praised by critics.\n\nVampire horror was also popular in the 1980s, including cult vampire classics such as Fright Night (1985), The Lost Boys (1987), and Near Dark (also 1987). In 1984, Joe Dante's seminal monster comedy Gremlins became a box office hit with critics and audiences, and inspired a trend of \"little monster\" films such as Critters and Ghoulies.\n\nDavid Cronenberg's films such as Shivers (1975), Rabid (1977), The Brood (1979), The Dead Zone (1983), The Fly (1986) dealt with \"body horror\" and \"mad scientist\" themes.\n\nSeveral science fiction action horror movies were released in the 1980s, notably Aliens (1986) and Predator (1987). Notable comedy horror films of the 1980s include Re-Animator (1985) and Night of the Creeps (1986).  \n\nDay of the Dead is a 1985 horror film written and directed by George A. Romero and the third film in Romero's Night of the Living Dead series.\n\nHenry: Portrait of a Serial Killer is a 1986 psychological horror crime film directed and co-written by John McNaughton about the random crime spree of a serial killer who seemingly operates with impunity. Pumpkinhead (1988) is a dark fantasy horror film, which is the directorial debut of special effects artist Stan Winston.\n\nChild's Play (1988), Night of the Demons (1988) and Pet Sematary (1989) are notable supernatural horror films of the late 1980s.\n\n1990s\n\nIn the first half of the 1990s, the genre still contained many of the themes from the 1980s. The slasher films A Nightmare on Elm Street, Friday the 13th, Halloween and Child's Play all saw sequels in the 1990s, most of which met with varied amounts of success at the box office, but all were panned by critics, with the exception of Wes Craven's New Nightmare (1994) and the hugely successful Silence of the Lambs (1991). The latter, which stars  Jodie Foster and Anthony Hopkins, is considered a major horror movie of all times.http://www.bbc.com/news/entertainment-arts-16344420  Misery (1990) also deals with  a psychopath, and the film received critical acclaim for Kathy Bates's performance as the psychopathic Annie Wilkes.\n\nNew Nightmare, with In the Mouth of Madness (1995), The Dark Half (1993), and Candyman (1992), were part of a mini-movement of self-reflexive or metafictional horror films. Each film touched upon the relationship between fictional horror and real-world horror. Candyman, for example, examined the link between an invented urban legend and the realistic horror of the racism that produced its villain. In the Mouth of Madness took a more literal approach, as its protagonist actually hopped from the real world into a novel created by the madman he was hired to track down. This reflective style became more overt and ironic with the arrival of Scream (1996).\n\nIn Interview with the Vampire (1994), the \"Theatre de Vampires\" (and the film itself, to some degree) invoked the Grand Guignol style, perhaps to further remove the undead performers from humanity, morality and class. The horror movie soon continued its search for new and effective frights. In the 1985 novel The Vampire Lestat by the author Anne Rice (who penned Interview...s screenplay and the 1976 novel of the same name) suggests that its antihero Lestat inspired and nurtured the Grand Guignol style and theatre.\n\nTwo main problems pushed horror backward during this period: firstly, the horror genre wore itself out with the proliferation of nonstop slasher and gore films in the eighties. Secondly, the adolescent audience which feasted on the blood and morbidity of the previous decade grew up, and the replacement audience for films of an imaginative nature were being captured instead by the explosion of science-fiction and fantasy films, courtesy of the special effects possibilities with advances made in computer-generated imagery.  Examples of these CGI include movies like Species (1995), Anaconda (1997), Mimic (1997), Blade (1998), Deep Rising (1998), House on Haunted Hill (1999), Sleepy Hollow (1999), and The Haunting (1999).\n\nTo re-connect with its audience, horror became more self-mockingly ironic and outright parodic, especially in the latter half of the 1990s. Peter Jackson's Braindead (1992) (known as Dead Alive in the United States) took the splatter film to ridiculous excesses for comic effect. Wes Craven's Scream (written by Kevin Williamson) movies, starting in 1996, featured teenagers who were fully aware of, and often made reference to, the history of horror movies, and mixed ironic humour with the shocks (despite Scream 2 and Scream 3 utilising less use of the humour of the original, until Scream 4 in 2011, and rather more references to horror film conventions). Along with I Know What You Did Last Summer (1997) (also written by Williamson) and Urban Legend (1998), they re-ignited the dormant slasher film genre.\n\nEvent Horizon (1997) is a British-American science fiction horror film directed by Paul W. S. Anderson. The Sixth Sense (1999) is a supernatural horror film written and directed by M. Night Shyamalan, which tells the story of Cole Sear (Haley Joel Osment), a troubled, isolated boy who is able to see and talk to the dead, and an equally troubled child psychologist named Malcolm Crowe (Bruce Willis) who tries to help him.\n\nHouse on Haunted Hill is a 1999 horror film directed by William Malone which follows a group of strangers who are invited to a party at an abandoned asylum, where they are offered $1 million each by an amusement park mogul if they are able to survive the night. It is a remake of the 1959 film of the same title. Other horror films of the late 1990s include Cube (1997), The Faculty (1998), Disturbing Behavior (1998), Stir of Echoes (1999), Stigmata (1999), Existenz (1999).\n\nMonster horror was quite popular in the 1990s. Tremors (1990) is\nthe first installment of the Tremors franchise. Lake Placid (1999) is another monster horror film, written by David E. Kelley and directed by Steve Miner. \n\nAnother successful horror film is Audition, a 1999 Japanese film based on the novel of the same name, directed by Takashi Miike. Around this period, Japanese horror started becoming popular in English speaking countries.\n\nThe film The Last Broadcast (1998) served as inspiration for the highly successful The Blair Witch Project (1999), which popularized the found footage horror subgenre. The theme of witchcraft was also addressed in The Witches (1990), starring  Anjelica Huston and The Craft (1996), a supernatural horror film directed by Andrew Fleming. Wolf is a 1994  romantic horror film following the transformation of a man (Jack Nicholson) into a werewolf.\n\n2000s\n\nThe decade started, with, among other films, Scary Movie (2000), a comedy horror directed by Keenen Ivory Wayans, which is a parody of the horror, slasher and mystery genres. The film received mixed reviews from critics. By contrast, Valentine (2001) was a conventional horror film. It had some success at the box office, but was derided by critics for being formulaic and relying on foregone horror film conventions. The Others (2001) was hugely successful, winning and being further nominated for many awards. It is a 2001 Spanish-American supernatural gothic horror film with elements of psychological horror. It was written, directed, and scored by Alejandro Amenábar. It stars Nicole Kidman and Fionnula Flanagan.  \n\nFranchise films such as Jason X (2001) and Freddy vs. Jason (2003) also made a stand in theaters. Final Destination (2000) marked a successful revival of teen-centered horror and spawned five installments. Jeepers Creepers series was also successful. Films such as Hollow Man (2000), Cabin Fever (2002), House of 1000 Corpses (2003) (the latter an exploitation horror film written, co-scored and directed by Rob Zombie in his directorial debut) and the previous mentions helped bring the genre back to Restricted ratings in theaters. Van Helsing (2004) and Underworld series had huge box office success, despite mostly negative reviews by critics.  Ginger Snaps (2000) is a Canadian film dealing with the tragic transformation of a teenage girl who is bitten by a werewolf. Signs (2002) revived the science fiction alien theme. The Descent, a 2005 British adventure horror film written and directed by Neil Marshall was also successful. Another notable film is Drag Me to Hell, a 2009 American supernatural horror film co-written and directed by Sam Raimi. The Strangers (2008) deals with unprovoked stranger-on-stranger violence. The House of the Devil (2009) is inspired by the \"satanic panic\" of the 1980s. Trick 'r Treat is a 2007 anthology horror film written and directed by Michael Dougherty and produced by Bryan Singer. Black Water (2007) is British-Australian natural horror film.\n\nSeveral horror film adaptations from comic books and video games were produced. 30 Days of Night (2007) is based on the comic book miniseries of the same name. The story focuses on an Alaskan town beset by vampires as it enters into a thirty-day long polar night. Comic book adaptations like the Blade series, Constantine (2005), and Hellboy (2004) also became box office successes. The Resident Evil video game franchise was adapted into a film released in March 2002, and  several sequels followed.  Other video game adaptations like Doom (2005) and Silent Hill (2006) also had moderate box office success. \n\nSome pronounced trends have marked horror films. Films from non-English language countries  have become successful. The Devil's Backbone (2001) is such an example. It is a 2001 Spanish-Mexican gothic horror film directed by Guillermo del Toro, and written by del Toro, David Muñoz, and Antonio Trashorras. A French horror film Brotherhood of the Wolf (2001) became the second-highest-grossing French language film in the United States in the last two decades. The Swedish film Let the Right One In (2008) was also successful. REC is  a 2007 Spanish zombie horror film, co-written and directed by Jaume Balagueró and Paco Plaza. Martyrs (2008), a French-Canadian horror film, was controversial upon its release, receiving polarizing reviews. Another notable film is The Orphanage (2007), a Spanish horror film and the debut feature of Spanish filmmaker J. A. Bayona. A Tale of Two Sisters is a 2003 South Korean psychological drama horror film written and directed by Kim Jee-woon.\n\nAnother trend is the emergence of psychology to scare audiences, rather than gore. The Others (2001) proved to be a successful example of a psychological horror film. A minimalist approach which was equal parts Val Lewton's theory of \"less is more\", usually employing the low-budget techniques utilized on The Blair Witch Project (1999), has been evident, particularly in the emergence of Asian horror movies which have been remade into successful Americanized versions, such as The Ring (2002), The Grudge (2004), Dark Water (2005), and Pulse (2006). In March 2008, China banned the movies from its market.[http://www.shanghaidaily.com/article/shdaily_opinion.asp?id353593&type\nOpinion China Bans Horror Movies] – Shanghai Daily, March 2008. Credo (2008) and Triangle (2009) are two British psychological horror films. What Lies Beneath (2000) is a supernatural horror film directed by Robert Zemeckis, starring Harrison Ford and Michelle Pfeiffer as a couple who experience a strange haunting of their home. Orphan (2009) is a notable psychological horror film.\n\nThe films I Am Legend (2007), Quarantine (2008), Zombieland (2009), and 28 Days Later (2002) featured an update of the apocalyptic and aggressive zombie genre. The latter film spawned a sequel: 28 Weeks Later (2007). An updated remake of Dawn of the Dead (2004) soon appeared as well as the zombie comedy Shaun of the Dead (2004) and Spanish -Cuban comedy zombie film Juan of the Dead (2012). This resurgence led George A. Romero to return to his Living Dead series with Land of the Dead (2005), Diary of the Dead (2007) and Survival of the Dead (2009).[http://www.morehorror.com/New-Survival-of-The-Dead-Poster-by-charlie-adlard-and-Trailer-with-George-A-Ramero-Commentary63102 George A. Romero's Survival of The Dead]: More Horror News, 6 May 2010.  Cannibals were present in horror films such as  Dahmer (2002), Wrong Turn (2003), Tooth and Nail (2007) and Dying Breed (2008).\n\nThe Australian film Wolf Creek (2005) written, co-produced, and directed by Greg McLean revolves around three backpackers who find themselves taken captive and after a brief escape, hunted down by Mick Taylor in the Australian outback. The film was ambiguously marketed as being \"based on true events\"; the plot bore elements reminiscent of the real-life murders of tourists by Ivan Milat in the 1990s, and Bradley Murdoch in 2001; and contained more extreme violence. An extension of this trend was the emergence of a type of horror with emphasis on depictions of torture, suffering and violent deaths, (variously referred to as \"horror porn\", \"torture porn\", \"splatterporn\" and \"gore-nography\") with films such as Ghost Ship (2002), The Collector (2009), Saw (2004), Hostel (2005), and their respective sequels, frequently singled out as examples of emergence of this subgenre.[https://www.nytimes.com/2007/06/11/movies/11hostel.html Box Office for Horror Movies Is Weak: Verging on Horrible]: RAK Times, 11 June 2007. The Saw film series holds the Guinness World Record of the highest-grossing horror franchise in history. Finally, with the arrival of Paranormal Activity (2007), which was well received by critics and an excellent reception at the box office, minimalist horror approach started by The Blair Witch Project was reaffirmed. Cloverfield (2008) is another found footage horror film. The Mist (2007) is a science-fiction horror film based on the 1980 novella of the same name by Stephen King. Antichrist (2009) is an English-language Danish experimental horror film written and directed by Lars von Trier, and starring Willem Dafoe and Charlotte Gainsbourg. The Exorcism of Emily Rose is a 2005 legal drama horror film directed by Scott Derrickson, loosely based on the story of Anneliese Michel. The Children (2008) is British horror film focusing on the mayhem created by several children. \n\nRemakes of earlier horror movies became routine in the 2000s. In addition to the remake of Dawn of the Dead (2004), as well as the remake of both Herschell Gordon Lewis' cult classic 2001 Maniacs (2003) and the remake of Tobe Hooper's classic The Texas Chainsaw Massacre (2003), there was also the 2007 Rob Zombie-written and -directed remake of John Carpenter's Halloween.[http://www.msnbc.msn.com/id/9805698/ I Spit on Your Horror Movie Remakes] – MSNBC 2005 opinion piece on horror remakes The film focused more on Michael's backstory than the original did, devoting the first half of the film to Michael's childhood. It was critically panned by most,[http://www.rottentomatoes.com/m/halloween/ Halloween – Rotten Tomatoes]. Rotten Tomatoes. Retrieved 7 September 2007.[http://www.metacritic.com/film/titles/halloween2007 Halloween (2007): Reviews]. Metacritic. Retrieved 7 September 2007. but was a success in its theatrical run, spurring its own sequel. This film helped to start a \"reimagining\" riot in horror filmmakers. Among the many remakes or \"reimaginings\" of other popular horror films and franchises are films such as Thirteen Ghosts (2001), The Texas Chainsaw Massacre (2003), The Hills Have Eyes (2006), Friday the 13th (2009), Children of the Corn (2009), Halloween (2007),  Prom Night (2008), The Omen (2006), Carrie (2002), The Wicker Man (2006), Day of the Dead (2008), Night of the Demons (2009), My Bloody Valentine (2009), Willard (2003), Black Christmas (2006), The Amityville Horror (2005), April Fool's Day (2008), The Fog (2005), The Hitcher (2007), It's Alive (2009), When a Stranger Calls (2006),\nThe Last House on the Left (2009).\n\n2010s\n\nRemakes remain popular, with films such as A Nightmare on Elm Street (2010), The Crazies (2010), I Spit on Your Grave (2010), Don't Be Afraid of the Dark (2010),\nFright Night (2011), Maniac (2012), and\nPoltergeist (2015). The 1976 film Carrie saw its second remake in 2013, which is the third film adaptation of Stephen King's 1974 novel of the same name. Child's Play saw a sequel with Curse of Chucky (2013), while Halloween, Friday the 13th, and Hellraiser all had reboots in the works. The 2013 Evil Dead is the fourth installment in the Evil Dead franchise, and serves as a soft reboot of the original 1981 film and as a continuation to the original film trilogy.\n\nSerialized, found footage style web videos featuring Slender Man became popular on YouTube in the beginning of the decade. Such series included TribeTwelve, EverymanHybrid, and Marble Hornets, the latter of which has been adapted into a feature film. The character as well as the multiple series is credited with reinvigorating interest in found footage as well as urban folklore. Horror has become prominent on television with The Walking Dead, American Horror Story, and The Strain. Also, many popular horror films have had successful television series made: Psycho spawned Bates Motel, The Silence of the Lambs spawned Hannibal, and both Scream and Friday the 13th had TV series in development.\n\nYou're Next (2011) and The Cabin in the Woods (2012) led to a return to the slasher genre; the latter was intended also as a critical satire of torture porn. The Green Inferno (2015) pays homage to the controversial horror film Cannibal Holocaust (1980). Australian psychological horror The Babadook (2014) was met with critical acclaim. It Follows (2014) subverted traditional horror tropes of sexuality and slasher films and enjoyed commercial and critical success. The Conjuring deal with the paranormal. Sinister (2012) is a British-American supernatural horror film directed by Scott Derrickson and written by Derrickson and C. Robert Cargill. Another notable  supernatural horror film is Insidious (2010). The Witch (2015) is a historical period supernatural horror film written and directed by Robert Eggers in his directorial debut, which follows a Puritan family encountering forces of evil in the woods beyond their New England farm. Get Out (2017) received universal acclaim from critics and audiences alike. Adapted from the Stephen King novel, It (2017) set a box office record for horror films by grossing $123.1 million on opening weekend in the United States and nearly $185 million globally.https://www.forbes.com/sites/scottmendelson/2017/09/11/it-box-office-pennywise-is-bigger-than-jesus-with-a-123m-weekend/#5ce38d455c85 Gerald's Game (2017) is a psychological horror film based on Stephen King's novel of the same name. Other horror films include Frozen (2010), The Innkeepers (2011), Oculus (2013), Mama (2013), Green Room (2015), The Invitation (2015), Hush (2016), Lights Out (2016), Don't Breathe (2016).\n\nThe success of non-English language films continued with the Swedish film Marianne (2011), while Let the Right One In (2008)  was the subject of a Hollywood remake, Let Me In (2010). South Korean horror produced I Saw the Devil (2010) and Train to Busan (2016). Raw is a 2016 French-Belgian horror drama written and directed by Julia Ducournau, and starring Garance Marillier.\n\nSubgenres\n\n* Action horror – A subgenre combining the intrusion of an evil force, event, or personage of horror movies with the weapon fights and frenetic chases of the action genre. Themes or elements often prevalent in typical action-horror films include gore, demons, aliens, vicious animals, vampires and, most commonly, zombies. This category also fuses the fantasy genre. Examples include: Aliens, Predator, Dog Soldiers, From Dusk till Dawn, I Saw the Devil, Priest, Feast and Train to Busan.\n* Horror adventure - A film that blends expeditions, exploration, exotic places and other adventure elements in a horror setting. Examples include: King Kong, The Descent, Silent Hill, Jaws, Cannibal Holocaust.\n* Comedy horror – Combines elements of comedy and horror fiction. The comedy horror genre often crosses over with the black comedy genre and are occasionally also horror films with a lower rating aimed at a family audience. The short story The Legend of Sleepy Hollow by Washington Irving is cited as \"the first great comedy-horror story\". Examples of comedy horror films include: An American Werewolf in London, Beetlejuice, Jennifer's Body, Teeth, Nina Forever, Slither, Army of Darkness, Zombieland, Scary Movie and Idle Hands. Gremlins and Ghostbusters were examples of comedy horror films aimed at a family audience.\n* Body horror – In which the horror is principally derived from the graphic destruction or degeneration of the body. Other types of body horror include unnatural movements, or the anatomically incorrect placement of limbs to create 'monsters' out of human body parts. David Cronenberg is one of the notable directors of the genre. Body horror films include: Starry Eyes, Videodrome, Dead Ringers, Contracted, The Thing, The Fly and American Mary.\n* Horror drama – A film that focuses on imperiled characters dealing with realistic emotional struggles, often involving dysfunctional family relations, in a horror setting. The film's horror elements often serve as a backdrop to an unraveling dramatic plot. Examples include: Dark Water, The Exorcism of Emily Rose, Lights Out, The Babadook, It, Let the Right One In, Antichrist, Excision, Mama, Mirrors and Audition.\n* Holiday horror – A film which depicts horror events which are set during a holiday or holiday season. It often involves a psychopathic killer stalking a sequence of victims in a violent manner. It is set during Christmas, Halloween, Valentine's Day, April Fools' Day, or Thanksgiving. Examples include: Silent Night, Deadly Night, Black Christmas, Halloween, My Bloody Valentine, Home Sweet Home, April Fool's Day, Valentine, Trick 'r Treat and All Through the House.\n* Psychological horror – Relies on characters' fears, guilt, beliefs, eerie sound effects, relevant music, emotional instability and at times, the supernatural and ghosts, to build tension, scare and further the plot. Notable psychological horror films include: Repulsion, Rosemary's Baby, The Shining, May, Credo, Black Swan, The Changeling, The Uninvited and Get Out.\n* Science fiction horror – Often revolves around subjects that include but are not limited to killer aliens, mad scientists, and/or experiments gone wrong. Examples include: Frankenstein, Species, Mimic, Alien, The Thing, The Blob, Apollo 18, Event Horizon and Resident Evil.\n* Slasher film – Often revolves around a serial killer who systematically murders people through violent means. Examples include: Psycho, The Texas Chain Saw Massacre, Halloween, Friday the 13th, Black Christmas, A Nightmare on Elm Street, Child's Play (1988), and Scream.\n* Splatter film – These films deliberately focus on graphic portrayals of gore and graphic violence. Through the use of special effects and excessive blood and guts, they tend to display an overt interest in the vulnerability of the human body and the theatricality of its mutilation. Examples of splatter horror films include: Inside, Train, The Human Centipede, Hostel, Saw, Blood Feast, Storm Warning and Maniac.\n* Supernatural horror – Includes menacing ghosts, demons, or other depictions of supernatural occurrences. Supernatural horror films often combine elements of religion into the plot. Common themes include vengeful ghosts, witches, the devil, and demonic possession. Examples include: The Ring, The Grudge, The Amityville Horror, It, The Omen, The Exorcist, Paranormal Activity, The Blair Witch Project, The Conjuring, Silent Hill, Sinister\n* Gothic horror – Gothic horror is a type of story that contains elements of goth and horror. At times it may have romance that unfolds in the setting of a horror tale, usually suspenseful. Some of the earliest horror movies were of this subgenre. Examples include: Dracula, Sleepy Hollow, The Others, The Phantom of the Opera, Kill, Baby, Kill, Nosferatu, and Crimson Peak.\n* Natural horror – A subgenre of horror films \"featuring nature running amok in the form of mutated beasts, carnivorous insects, and normally harmless animals or plants turned into cold-blooded killers.\" This genre may sometimes overlap with the science fiction and action and adventure genres. Examples include: The Birds, Jaws, Piranha, Bats, Lake Placid, Rogue, Alligator, Black Water\n* Zombie film – Zombie films feature creatures who are usually portrayed as either reanimated corpses or mindless human beings. Distinct subgenres have evolved, such as the zombie comedy, which may or may not retain a significant horror theme, and often crosses into black comedy. Examples include: White Zombie, Night of the Living Dead, Dawn of the Dead, REC, 28 Days Later, Deadgirl, Dead Snow, Night of the Creeps and Messiah of Evil.\n*Found footage horror: A film \"technique\" sometimes referred to as a subgenre which involves giving the audience a first person view of the story that is discovered from an original recording source within the plot. Recording film in this way merges the audience with the character’s experiences inducing suspense, shock, and bafflement.refMcRobert, Neil. \"Mimesis of Media: Found Footage Cinema and the Horror of the Real.\" Gothic Studies, vol. 17, no. 2, Nov. 2015, pp. 137-150. EBSCOhost, doi:10.7227/GS.17.2.9 Examples of first-person horror include The Blair Witch Project (1999), Paranormal Activity (2007), Cloverfield (2008), and Devil's Due (2014) Reyes, Xavier Aldana. \"Reel Evil: A Critical Reassessment of Found Footage Horror.\" Gothic Studies, vol. 17, no. 2, Nov. 2015, pp. 122-136. EBSCOhost, doi:10.7227/GS.17.2.8.\n*Teen horror – A horror subgenre that victimizes teenagers while usually promoting strong, anti-conformity teenage leads, appealing to young generations. This subgenre often depicts themes of sex, under-aged drinking, and gore. It was most popular in 1964-1965.Miller C, Van Riper A. Marketing, Monsters, and Music: Teensploitation Horror Films. Journal of American Culture [serial online]. June 2015;38(2):130-141. Available from: Academic Search Complete, Ipswich, MA. Accessed 21 March 2017.\n\nInfluences\n\nInfluences on society\n\nHorror films' evolution throughout the years has given society a new approach to resourcefully utilize their benefits. The horror film style has changed over time, but in 1996 Scream set off a \"chain of copycats\", leading to a new variety of teenage, horror movies. This new approach to horror films began to gradually earn more and more revenue as seen in the progress of Scream movies; the first movie earned $6 million and the third movie earned $101 million. The importance that horror films have gained in the public and producers’ eyes is one obvious effect on our society.\n\nHorror films' income expansion is only the first sign of the influences of horror flicks. The role of women and how women see themselves in the movie industry has been altered by the horror genre. Early horror films such as My Bloody Valentine (1981), Halloween (1978), and Friday the 13th (1980) were produced mostly for male audiences in order to \"feed the fantasies of young men\". This idea is no longer prevalent in horror films, as women have become not only the main audience and fans of horror films but also the main protagonists of contemporary horror films. Movie makers have also begun to integrate topics more broadly associated with other genres into their films in order to grow audience appeal.\n\nMany early horror films created high social and legal controversy. In the US, the Motion Picture Production Code was in force between 1930 and 1968, although it was strictly enforced only from 1934 to the late 1950s. The Code set guidelines of what was morally acceptable to show in movies, and, as such, it restrained movies containing  controversial themes, severe violence, explicit sexuality or nudity. The gradual abandonment of the Code, and eventually its formal repeal in 1968 (when it was replaced by the MPAA film rating system) offered more freedom to the movie industry. Nevertheless, controversy continued to surround horror movies, and many continued to face censorship issues in many countries. An example of such film is the 1978 I Spit on Your Grave, an  American rape-and-revenge exploitation horror film written, co-produced, directed, and edited by Meir Zarchi. The film was received negatively by critics, but it attracted a great deal of national and international attention due to its explicit scenes of rape, murder and prolonged nudity which led it to be banned in many countries, including  Ireland, Norway, Iceland, and West Germany. Many of these countries have in later years removed the ban, but the film remains prohibited in Ireland.https://www.irishtimes.com/news/re-release-of-i-spit-on-your-grave-banned-by-film-body-1.653261\n\nInfluences internationally\n\nWhile horror is only one genre of film, the influence it presents to the international community is large. Horror movies tend to be a vessel for showing eras of audiences issues across the globe visually and in the most effective manner. Jeanne Hall, a film theorist, agrees with the use of horror films in easing the process of understanding issues by making use of their optical elements. The use of horror films to help audiences understand international prior historical events occurs, for example, to show the horridness of the Vietnam War, the Holocaust and the worldwide AIDS epidemic. However, horror movies do not always present positive endings. In fact, in many occurrences the manipulation of horror presents cultural definitions that are not accurate, yet set an example to which a person relates to that specific cultural from then on in their life.\n\nThe visual interpretations of films can be lost in the translation of their elements from one culture to another like in the adaptation of the Japanese film Ju on into the American film The Grudge. The cultural components from Japan were slowly \"siphoned away\" to make the film more relatable to a western audience. This deterioration that can occur in an international remake happens by over-presenting negative cultural assumptions that, as time passes, sets a common ideal about that particular culture in each individual. Holm's discussion of The Grudge remakes presents this idea by stating, \"It is, instead, to note that The Grudge films make use of an un-theorized notion of Japan... that seek to directly represent the country.\"",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Horror film" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=13451" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "A horror film is a movie that seeks to elicit a physiological reaction, such as an elevated heartbeat, through the use of fear and shocking one’s audiences. Initially often inspired by literature from authors like Edgar Allan Poe, Bram Stoker and Mary Shelley, horror has existed as a film genre for more than a century. The macabre and the supernatural are frequent themes. Horror may also overlap with the fantasy, supernatural fiction and thriller genres.\n\nHorror films often aim to evoke viewers' nightmares, fears, revulsions and terror of the unknown. Plots within the horror genre often involve the intrusion of an evil force, event, or personage into the everyday world. Prevalent elements include ghosts, aliens, vampires, werewolves, demons, satanism, gore, torture, vicious animals, evil witches, monsters, zombies, cannibals, psychopaths, natural or man-made disasters, and serial killers.\n\nSome subgenres of horror film include action horror, comedy horror, body horror, disaster horror, holiday horror, horror drama, psychological horror, science fiction horror, slasher horror, supernatural horror, gothic horror, natural horror, zombie horror, first-person horror and teen horror.\n\nHistory\n\n1889–1900s\n\nThe first depictions of supernatural events appear in several of the silent shorts created by the film pioneer Georges Méliès in the late 1890s, the best known being Le Manoir du Diable, which is sometimes credited as being the first horror film. Another of his horror projects was La Caverne maudite (1898) (a.k.a. The Cave of the Demons, literally \"the accursed cave\"). Japan made early forays into the horror genre with Bake Jizo (Jizo the Spook) and Shinin no Sosei (Resurrection of a Corpse), both made in 1898. The era featured a slew of literary adaptations, adapting the works of Poe and Dante, among others. In 1908, Selig Polyscope Company produced Dr. Jekyll and Mr. Hyde.\n\n1910s–1920s\n\nUnited States\n\nIn 1910, Edison Studios produced the first filmed version of Frankenstein. The macabre nature of the source materials used made the films synonymous with the horror film genre.\n\nThough the word \"horror\" to describe the film genre would not be used until the 1930s (when Universal Pictures released their initial monster films), earlier American productions often relied on horror themes. Some notable examples include The Hunchback of Notre Dame (1923), The Phantom of the Opera (1925), The Cat and the Canary (1927), The Unknown (1927), and The Man Who Laughs (1928). Many of these early films were considered dark melodramas because of their stock characters and emotion-heavy plots that focused on romance, violence, suspense, and sentimentality.\n\nThe trend of inserting an element of macabre into American pre-horror melodramas continued into the 1920s. Directors known for relying on macabre in their films during the 1920s were Maurice Tourneur, Rex Ingram, and Tod Browning. Ingram's The Magician (1926) contains one of the first examples of a \"mad doctor\" and is said to have had a large influence on James Whale's version of Frankenstein. The Unholy Three (1925) is an example of Browning's use of macabre and unique style of morbidity; he remade the film in 1930 as a talkie, though The Terror (1928) was the first horror film with sound.\n\nGermany\n\nBefore and during the Weimar Republic era, German Expressionist filmmakers would significantly influence later productions. Paul Wegener's The Student of Prague (1913) and The Golem trilogy (1915–20), as well as Robert Wiene's The Cabinet of Dr. Caligari (1920), Arthur Robison's Warning Shadows (1923), and Paul Leni's Waxworks (1924), were influential films at the time. The first vampire-themed movie, Nosferatu (1922), was made during this period; it was an unauthorized adaptation of Bram Stoker's Dracula.\n\nSweden, Denmark and France\n\nOther European countries also, contributed to the genre during this period. Victor Sjöström's The Phantom Carriage (Sweden, 1920) is a cautionary tale about a supernatural legend, Benjamin Christensen's Häxan (Denmark/Sweden, 1922) is a documentary-style, horror film, about witchcraft and superstition, and in 1928, Frenchman, Jean Epstein produced an influential film, The Fall of the House of Usher, based on the Poe tale.\n\n1930s–1940s\n\nDuring the early period of talking pictures, Universal Pictures began a successful Gothic horror film series. Tod Browning's Dracula (1931) was quickly followed by James Whale's Frankenstein (1931) and The Old Dark House (1932), both featuring monstrous mute antagonists. Some of these films blended science fiction with Gothic horror, such as Whale's The Invisible Man (1933) and featured a mad scientist, mirroring earlier German films. Frankenstein was the first in a series of remakes which lasted for years. The Mummy (1932) introduced Egyptology as a theme; Make-up artist Jack Pierce was responsible for the iconic image of the monster, and others in the series. Universal's horror cycle continued into the 1940s with B movies including The Wolf Man (1941), as well as a number of films uniting several of the most common monsters.The American Horror Film by Reynold Humpries\n\nOther studios followed Universal's lead. The once controversial Freaks (1932), based on the short story \"Spurs\", was made by MGM, though the studio disowned the completed film, and it remained banned, in the United Kingdom, for thirty years.Derek Malcolm [https://www.theguardian.com/film/1999/apr/15/derekmalcolmscenturyoffilm.derekmalcolm \"Tod Browning: Freaks\"], The Guardian, 15 April 1999; A Century of Films, London: IB Tauris, 2000, p.66-67. Dr. Jekyll and Mr. Hyde (Paramount, 1931) is remembered for its innovative use of photographic filters to create Jekyll's transformation before the camera.David J. Skal, The Monster Show: a Cultural History of Horror, New York: Faber, p.142. With the progression of the genre, actors like Boris Karloff and Bela Lugosi were beginning to build entire careers in horror. Both appeared in three of Val Lewton's atmospheric B movies for RKO in the mid-1940s, including The Body Snatcher (1945).\n\n1950s–1960s\n\nWith advances in technology, the tone of horror films shifted from the Gothic towards contemporary concerns. Two subgenres began to emerge: the Doomsday film and the Demonic film.Charles Derry, Dark Dreams: A Psychological History of the Modern Horror Film; A S Barnes & Co, 1977. Low-budget productions featured humanity overcoming threats such as alien invasions and deadly mutations to people, plants and insects. Japan's experience with Hiroshima and Nagasaki bore the well-known Godzilla (1954) and its sequels, featuring mutation from the effects of nuclear radiation.\n\nHollywood directors and producers found ample opportunity for audience exploitation through gimmicks. House of Wax (1953) used the advent of 3-D film to draw audiences, while The Tingler used electric seat buzzers in 1959. Filmmakers continued to merge elements of science fiction and horror over the following decades. Considered a \"pulp masterpiece\"Geoff Andrew, \"The Incredible Shrinking Man\", in John Pym (ed.) Time Out Film Guide 2009, London: Penguin, 2008, p.506. of the era was The Incredible Shrinking Man (1957), based on Richard Matheson's existentialist novel. The film conveyed the fears of living in the Atomic Age and the terror of social alienation.\n\nDuring the later 1950s, the United Kingdom emerged as a major producer of horror films. The Hammer company focused on the genre for the first time, enjoying huge international success from films involving classic horror characters which were shown in color for the first time. Drawing on Universal's precedent, many films produced were Frankenstein and Dracula remakes, followed by many sequels. Christopher Lee starred in a number of Hammer Horror films, including The Curse of Frankenstein (1957), which Professor Patricia MacCormac called the \"first really gory horror film, showing blood and guts in colour\". Other British companies contributed to a boom in horror film production in the United Kingdom during the 1960s and 1970s.\n\nReleased in May 1960, the British psychological thriller Peeping Tom (1960) by Michael Powell is a progenitor of the contemporary \"slasher film\".Mark D. Eckel (2014). \"When the Lights Go Down\". p. 167. WestBow Press. Alfred Hitchcock cemented the subgenre with Psycho released later that year. France continued the mad scientist theme, while Italian horror films became internationally notable. American International Pictures (AIP) made a series of Edgar Allan Poe–themed films.\n\nFilms in the era used the supernatural premise to express the horror of the demonic. The Innocents (1961) based on the Henry James novel The Turn of the Screw. Meanwhile, ghosts were a dominant theme in Japanese horror, in such films as Kwaidan, Onibaba (both 1964) and Kuroneko (1968).\n\nRosemary's Baby (1968) is an American psychological horror film written and directed by Roman Polanski, based on the bestselling 1967 novel of the same name by Ira Levin. Another influential American horror film of this period was George A. Romero's Night of the Living Dead (1968). Produced and directed by Romero on a budget of $114,000, it grossed $30 million internationally. An Armageddon film about zombies, it began to combine psychological insights with gore. Distancing the era from earlier gothic trends, late 1960s films brought horror into everyday life. Low-budget splatter films from the likes of Herschell Gordon Lewis also gained prominence.\n\n1970s–1980s\n\nThe financial successes of the low-budget gore films of the ensuing years, and the critical and popular success of Rosemary's Baby, led to the release of more films with occult themes during the 1970s. The Exorcist (1973), the first of these movies, was a significant commercial success and was followed by scores of horror films in which a demon entity is represented as the supernatural evil, often by impregnating women or possessing children.\n\n\"Evil children\" and reincarnation became popular subjects. Robert Wise's film Audrey Rose (1977) for example, deals with a man who claims that his daughter is the reincarnation of another dead person. Alice, Sweet Alice (1977), is another Catholic-themed horror slasher about a little girl's murder and her sister being the prime suspect. Another popular occult horror movie was The Omen (1976), where a man realizes that his five-year-old adopted son is the Antichrist. Invincible to human intervention, Demons became villains in many horror films with a postmodern style and a dystopian worldview. Another example is The Sentinel (1977), in which a fashion model discovers that her new brownstone residence may actually be a portal to Hell.\n\nDuring the 1970s, Italian filmmakers Mario Bava, Riccardo Freda, Antonio Margheriti and Dario Argento developed giallo horror films that became classics and influenced the genre in other countries. Representative films include: Black Sunday, Blood and Black Lace, Castle of Blood, Twitch of the Death Nerve, The Bird with the Crystal Plumage, Deep Red and Suspiria.\n\nDon't Look Now (1973), a independent British-Italian film directed by Nicolas Roeg, was also notable. Its focus on the psychology of grief was unusually strong for a film featuring a supernatural horror plot. Another notable film is The Wicker Man (1973), a British mystery horror film dealing with the practice of ancient pagan rituals in the modern era. It was written by Anthony Shaffer and directed by Robin Hardy.\n\nThe ideas of the 1960s began to influence horror films, as the youth involved in the counterculture began exploring the medium. Wes Craven's The Hills Have Eyes (1977) and The Last House on the Left (1972) along with Tobe Hooper's The Texas Chain Saw Massacre (1974) (based on the Ed Gein case) recalled the Vietnam War; while George A. Romero satirized the consumer society in his zombie sequel, Dawn of the Dead (1978). Meanwhile, the subgenre of comedy horror re-emerged in the cinema with The Abominable Dr. Phibes (1971), Young Frankenstein (1974), The Rocky Horror Picture Show (1975), and An American Werewolf in London (1981) among others.\n\nAlso in the 1970s, the works of the horror author Stephen King began to be adapted for the screen, beginning with Brian De Palma's adaptation of Carrie (1976), King's first published novel, for which the two female leads (Sissy Spacek and Piper Laurie) gained Oscar nominations. Next, was his third published novel, The Shining (1980), directed by Stanley Kubrick, which was a sleeper at the box office. At first, many critics and viewers had negative feedback toward The Shining. However, the film is now known as one of Hollywood's most classic horror films.\n\nThis psychological horror film has a variety of themes; \"evil children\", alcoholism, telepathy and insanity. This type of film is an example of how Hollywood's idea of horror started to evolve. Murder and violence were no longer the main themes of horror films. During the 1970s and 1980s, psychological and supernatural horror started to take over cinema. Another classic Hollywood horror film is Tobe Hooper's Poltergeist (1982). Poltergeist is ranked the 20th scariest movie ever made by the Chicago Film Critics Association. Both The Shining and Poltergeist involve horror being based on real-estate values. The evil and horror throughout the films come from where the movies are taking place.The American Horror Film by Reynold HumphriesAmerican Horror Film edited by Stefen Hantke\n\nThe Amityville Horror is a 1979 supernatural horror film directed by Stuart Rosenberg, based on Jay Anson's 1977 book of the same name. It stars James Brolin and Margot Kidder as a young couple who purchase a home they come to find haunted by combative supernatural forces. The Changeling is a 1980 Canadian psychological horror film directed by Peter Medak.\n\nA cycle of slasher films was made during the 1970s and 1980s. John Carpenter created Halloween (1978), Sean S. Cunningham made Friday the 13th (1980), Wes Craven directed A Nightmare on Elm Street (1984), and Clive Barker made Hellraiser (1987). This subgenre would be mined by dozens of increasingly violent movies throughout the subsequent decades, and Halloween became a successful independent film. Another notable 1970s slasher film is Bob Clark's Black Christmas (1974). Sleepaway Camp (1983) is known for its twist ending, which is considered by some to be one of the most shocking endings among horror films. My Bloody Valentine (1981) is a slasher film dealing with Valentine's Day fiction. The boom in slasher films provided enough material for numerous comedic spoofs of the genre including Saturday the 14th (1981), Student Bodies (1981), National Lampoon's Class Reunion (1983), and Hysterical (1983).\n\nSome films explored urban legends such as \"The babysitter and the man upstairs\".\nA notable example is When a Stranger Calls (1979), an American psychological horror film directed by Fred Walton starring Carol Kane and Charles Durning.\n\nSteven Spielberg's Jaws (1975) began a new wave of killer animal stories, such as Orca (1977) and Up from the Depths (1979). Jaws is often credited as being one of the first films to use traditionally B movie elements such as horror and mild gore in a big-budget Hollywood film. In 1979, Don Coscarelli's Phantasm was the first of the Phantasm franchise.\n\nAlien (1979), a British-American science-fiction horror film directed by Ridley Scott was very successful, receiving both critical acclaim and being a box office success. John Carpenter's movie The Thing (1982) was also a mix of horror and sci-fi, but it was neither a box-office nor critical hit, but soon became a cult classic. However, nearly 20 years after its release, it was praised for using ahead-of-its-time special effects and paranoia.\n\nThe 1980s saw a wave of gory \"B movie\" horror films – although most of them were poorly reviewed by critics, many became cult classics and later saw success with critics. A significant example is Sam Raimi's Evil Dead movies, which were low-budget gorefests but had a very original plotline which was later praised by critics.\n\nVampire horror was also popular in the 1980s, including cult vampire classics such as Fright Night (1985), The Lost Boys (1987), and Near Dark (also 1987). In 1984, Joe Dante's seminal monster comedy Gremlins became a box office hit with critics and audiences, and inspired a trend of \"little monster\" films such as Critters and Ghoulies.\n\nDavid Cronenberg's films such as Shivers (1975), Rabid (1977), The Brood (1979), The Dead Zone (1983), The Fly (1986) dealt with \"body horror\" and \"mad scientist\" themes.\n\nSeveral science fiction action horror movies were released in the 1980s, notably Aliens (1986) and Predator (1987). Notable comedy horror films of the 1980s include Re-Animator (1985) and Night of the Creeps (1986).  \n\nDay of the Dead is a 1985 horror film written and directed by George A. Romero and the third film in Romero's Night of the Living Dead series.\n\nHenry: Portrait of a Serial Killer is a 1986 psychological horror crime film directed and co-written by John McNaughton about the random crime spree of a serial killer who seemingly operates with impunity. Pumpkinhead (1988) is a dark fantasy horror film, which is the directorial debut of special effects artist Stan Winston.\n\nChild's Play (1988), Night of the Demons (1988) and Pet Sematary (1989) are notable supernatural horror films of the late 1980s.\n\n1990s\n\nIn the first half of the 1990s, the genre still contained many of the themes from the 1980s. The slasher films A Nightmare on Elm Street, Friday the 13th, Halloween and Child's Play all saw sequels in the 1990s, most of which met with varied amounts of success at the box office, but all were panned by critics, with the exception of Wes Craven's New Nightmare (1994) and the hugely successful Silence of the Lambs (1991). The latter, which stars  Jodie Foster and Anthony Hopkins, is considered a major horror movie of all times.http://www.bbc.com/news/entertainment-arts-16344420  Misery (1990) also deals with  a psychopath, and the film received critical acclaim for Kathy Bates's performance as the psychopathic Annie Wilkes.\n\nNew Nightmare, with In the Mouth of Madness (1995), The Dark Half (1993), and Candyman (1992), were part of a mini-movement of self-reflexive or metafictional horror films. Each film touched upon the relationship between fictional horror and real-world horror. Candyman, for example, examined the link between an invented urban legend and the realistic horror of the racism that produced its villain. In the Mouth of Madness took a more literal approach, as its protagonist actually hopped from the real world into a novel created by the madman he was hired to track down. This reflective style became more overt and ironic with the arrival of Scream (1996).\n\nIn Interview with the Vampire (1994), the \"Theatre de Vampires\" (and the film itself, to some degree) invoked the Grand Guignol style, perhaps to further remove the undead performers from humanity, morality and class. The horror movie soon continued its search for new and effective frights. In the 1985 novel The Vampire Lestat by the author Anne Rice (who penned Interview...s screenplay and the 1976 novel of the same name) suggests that its antihero Lestat inspired and nurtured the Grand Guignol style and theatre.\n\nTwo main problems pushed horror backward during this period: firstly, the horror genre wore itself out with the proliferation of nonstop slasher and gore films in the eighties. Secondly, the adolescent audience which feasted on the blood and morbidity of the previous decade grew up, and the replacement audience for films of an imaginative nature were being captured instead by the explosion of science-fiction and fantasy films, courtesy of the special effects possibilities with advances made in computer-generated imagery.  Examples of these CGI include movies like Species (1995), Anaconda (1997), Mimic (1997), Blade (1998), Deep Rising (1998), House on Haunted Hill (1999), Sleepy Hollow (1999), and The Haunting (1999).\n\nTo re-connect with its audience, horror became more self-mockingly ironic and outright parodic, especially in the latter half of the 1990s. Peter Jackson's Braindead (1992) (known as Dead Alive in the United States) took the splatter film to ridiculous excesses for comic effect. Wes Craven's Scream (written by Kevin Williamson) movies, starting in 1996, featured teenagers who were fully aware of, and often made reference to, the history of horror movies, and mixed ironic humour with the shocks (despite Scream 2 and Scream 3 utilising less use of the humour of the original, until Scream 4 in 2011, and rather more references to horror film conventions). Along with I Know What You Did Last Summer (1997) (also written by Williamson) and Urban Legend (1998), they re-ignited the dormant slasher film genre.\n\nEvent Horizon (1997) is a British-American science fiction horror film directed by Paul W. S. Anderson. The Sixth Sense (1999) is a supernatural horror film written and directed by M. Night Shyamalan, which tells the story of Cole Sear (Haley Joel Osment), a troubled, isolated boy who is able to see and talk to the dead, and an equally troubled child psychologist named Malcolm Crowe (Bruce Willis) who tries to help him.\n\nHouse on Haunted Hill is a 1999 horror film directed by William Malone which follows a group of strangers who are invited to a party at an abandoned asylum, where they are offered $1 million each by an amusement park mogul if they are able to survive the night. It is a remake of the 1959 film of the same title. Other horror films of the late 1990s include Cube (1997), The Faculty (1998), Disturbing Behavior (1998), Stir of Echoes (1999), Stigmata (1999), Existenz (1999).\n\nMonster horror was quite popular in the 1990s. Tremors (1990) is\nthe first installment of the Tremors franchise. Lake Placid (1999) is another monster horror film, written by David E. Kelley and directed by Steve Miner. \n\nAnother successful horror film is Audition, a 1999 Japanese film based on the novel of the same name, directed by Takashi Miike. Around this period, Japanese horror started becoming popular in English speaking countries.\n\nThe film The Last Broadcast (1998) served as inspiration for the highly successful The Blair Witch Project (1999), which popularized the found footage horror subgenre. The theme of witchcraft was also addressed in The Witches (1990), starring  Anjelica Huston and The Craft (1996), a supernatural horror film directed by Andrew Fleming. Wolf is a 1994  romantic horror film following the transformation of a man (Jack Nicholson) into a werewolf.\n\n2000s\n\nThe decade started, with, among other films, Scary Movie (2000), a comedy horror directed by Keenen Ivory Wayans, which is a parody of the horror, slasher and mystery genres. The film received mixed reviews from critics. By contrast, Valentine (2001) was a conventional horror film. It had some success at the box office, but was derided by critics for being formulaic and relying on foregone horror film conventions. The Others (2001) was hugely successful, winning and being further nominated for many awards. It is a 2001 Spanish-American supernatural gothic horror film with elements of psychological horror. It was written, directed, and scored by Alejandro Amenábar. It stars Nicole Kidman and Fionnula Flanagan.  \n\nFranchise films such as Jason X (2001) and Freddy vs. Jason (2003) also made a stand in theaters. Final Destination (2000) marked a successful revival of teen-centered horror and spawned five installments. Jeepers Creepers series was also successful. Films such as Hollow Man (2000), Cabin Fever (2002), House of 1000 Corpses (2003) (the latter an exploitation horror film written, co-scored and directed by Rob Zombie in his directorial debut) and the previous mentions helped bring the genre back to Restricted ratings in theaters. Van Helsing (2004) and Underworld series had huge box office success, despite mostly negative reviews by critics.  Ginger Snaps (2000) is a Canadian film dealing with the tragic transformation of a teenage girl who is bitten by a werewolf. Signs (2002) revived the science fiction alien theme. The Descent, a 2005 British adventure horror film written and directed by Neil Marshall was also successful. Another notable film is Drag Me to Hell, a 2009 American supernatural horror film co-written and directed by Sam Raimi. The Strangers (2008) deals with unprovoked stranger-on-stranger violence. The House of the Devil (2009) is inspired by the \"satanic panic\" of the 1980s. Trick 'r Treat is a 2007 anthology horror film written and directed by Michael Dougherty and produced by Bryan Singer. Black Water (2007) is British-Australian natural horror film.\n\nSeveral horror film adaptations from comic books and video games were produced. 30 Days of Night (2007) is based on the comic book miniseries of the same name. The story focuses on an Alaskan town beset by vampires as it enters into a thirty-day long polar night. Comic book adaptations like the Blade series, Constantine (2005), and Hellboy (2004) also became box office successes. The Resident Evil video game franchise was adapted into a film released in March 2002, and  several sequels followed.  Other video game adaptations like Doom (2005) and Silent Hill (2006) also had moderate box office success. \n\nSome pronounced trends have marked horror films. Films from non-English language countries  have become successful. The Devil's Backbone (2001) is such an example. It is a 2001 Spanish-Mexican gothic horror film directed by Guillermo del Toro, and written by del Toro, David Muñoz, and Antonio Trashorras. A French horror film Brotherhood of the Wolf (2001) became the second-highest-grossing French language film in the United States in the last two decades. The Swedish film Let the Right One In (2008) was also successful. REC is  a 2007 Spanish zombie horror film, co-written and directed by Jaume Balagueró and Paco Plaza. Martyrs (2008), a French-Canadian horror film, was controversial upon its release, receiving polarizing reviews. Another notable film is The Orphanage (2007), a Spanish horror film and the debut feature of Spanish filmmaker J. A. Bayona. A Tale of Two Sisters is a 2003 South Korean psychological drama horror film written and directed by Kim Jee-woon.\n\nAnother trend is the emergence of psychology to scare audiences, rather than gore. The Others (2001) proved to be a successful example of a psychological horror film. A minimalist approach which was equal parts Val Lewton's theory of \"less is more\", usually employing the low-budget techniques utilized on The Blair Witch Project (1999), has been evident, particularly in the emergence of Asian horror movies which have been remade into successful Americanized versions, such as The Ring (2002), The Grudge (2004), Dark Water (2005), and Pulse (2006). In March 2008, China banned the movies from its market.[http://www.shanghaidaily.com/article/shdaily_opinion.asp?id353593&type\nOpinion China Bans Horror Movies] – Shanghai Daily, March 2008. Credo (2008) and Triangle (2009) are two British psychological horror films. What Lies Beneath (2000) is a supernatural horror film directed by Robert Zemeckis, starring Harrison Ford and Michelle Pfeiffer as a couple who experience a strange haunting of their home. Orphan (2009) is a notable psychological horror film.\n\nThe films I Am Legend (2007), Quarantine (2008), Zombieland (2009), and 28 Days Later (2002) featured an update of the apocalyptic and aggressive zombie genre. The latter film spawned a sequel: 28 Weeks Later (2007). An updated remake of Dawn of the Dead (2004) soon appeared as well as the zombie comedy Shaun of the Dead (2004) and Spanish -Cuban comedy zombie film Juan of the Dead (2012). This resurgence led George A. Romero to return to his Living Dead series with Land of the Dead (2005), Diary of the Dead (2007) and Survival of the Dead (2009).[http://www.morehorror.com/New-Survival-of-The-Dead-Poster-by-charlie-adlard-and-Trailer-with-George-A-Ramero-Commentary63102 George A. Romero's Survival of The Dead]: More Horror News, 6 May 2010.  Cannibals were present in horror films such as  Dahmer (2002), Wrong Turn (2003), Tooth and Nail (2007) and Dying Breed (2008).\n\nThe Australian film Wolf Creek (2005) written, co-produced, and directed by Greg McLean revolves around three backpackers who find themselves taken captive and after a brief escape, hunted down by Mick Taylor in the Australian outback. The film was ambiguously marketed as being \"based on true events\"; the plot bore elements reminiscent of the real-life murders of tourists by Ivan Milat in the 1990s, and Bradley Murdoch in 2001; and contained more extreme violence. An extension of this trend was the emergence of a type of horror with emphasis on depictions of torture, suffering and violent deaths, (variously referred to as \"horror porn\", \"torture porn\", \"splatterporn\" and \"gore-nography\") with films such as Ghost Ship (2002), The Collector (2009), Saw (2004), Hostel (2005), and their respective sequels, frequently singled out as examples of emergence of this subgenre.[https://www.nytimes.com/2007/06/11/movies/11hostel.html Box Office for Horror Movies Is Weak: Verging on Horrible]: RAK Times, 11 June 2007. The Saw film series holds the Guinness World Record of the highest-grossing horror franchise in history. Finally, with the arrival of Paranormal Activity (2007), which was well received by critics and an excellent reception at the box office, minimalist horror approach started by The Blair Witch Project was reaffirmed. Cloverfield (2008) is another found footage horror film. The Mist (2007) is a science-fiction horror film based on the 1980 novella of the same name by Stephen King. Antichrist (2009) is an English-language Danish experimental horror film written and directed by Lars von Trier, and starring Willem Dafoe and Charlotte Gainsbourg. The Exorcism of Emily Rose is a 2005 legal drama horror film directed by Scott Derrickson, loosely based on the story of Anneliese Michel. The Children (2008) is British horror film focusing on the mayhem created by several children. \n\nRemakes of earlier horror movies became routine in the 2000s. In addition to the remake of Dawn of the Dead (2004), as well as the remake of both Herschell Gordon Lewis' cult classic 2001 Maniacs (2003) and the remake of Tobe Hooper's classic The Texas Chainsaw Massacre (2003), there was also the 2007 Rob Zombie-written and -directed remake of John Carpenter's Halloween.[http://www.msnbc.msn.com/id/9805698/ I Spit on Your Horror Movie Remakes] – MSNBC 2005 opinion piece on horror remakes The film focused more on Michael's backstory than the original did, devoting the first half of the film to Michael's childhood. It was critically panned by most,[http://www.rottentomatoes.com/m/halloween/ Halloween – Rotten Tomatoes]. Rotten Tomatoes. Retrieved 7 September 2007.[http://www.metacritic.com/film/titles/halloween2007 Halloween (2007): Reviews]. Metacritic. Retrieved 7 September 2007. but was a success in its theatrical run, spurring its own sequel. This film helped to start a \"reimagining\" riot in horror filmmakers. Among the many remakes or \"reimaginings\" of other popular horror films and franchises are films such as Thirteen Ghosts (2001), The Texas Chainsaw Massacre (2003), The Hills Have Eyes (2006), Friday the 13th (2009), Children of the Corn (2009), Halloween (2007),  Prom Night (2008), The Omen (2006), Carrie (2002), The Wicker Man (2006), Day of the Dead (2008), Night of the Demons (2009), My Bloody Valentine (2009), Willard (2003), Black Christmas (2006), The Amityville Horror (2005), April Fool's Day (2008), The Fog (2005), The Hitcher (2007), It's Alive (2009), When a Stranger Calls (2006),\nThe Last House on the Left (2009).\n\n2010s\n\nRemakes remain popular, with films such as A Nightmare on Elm Street (2010), The Crazies (2010), I Spit on Your Grave (2010), Don't Be Afraid of the Dark (2010),\nFright Night (2011), Maniac (2012), and\nPoltergeist (2015). The 1976 film Carrie saw its second remake in 2013, which is the third film adaptation of Stephen King's 1974 novel of the same name. Child's Play saw a sequel with Curse of Chucky (2013), while Halloween, Friday the 13th, and Hellraiser all had reboots in the works. The 2013 Evil Dead is the fourth installment in the Evil Dead franchise, and serves as a soft reboot of the original 1981 film and as a continuation to the original film trilogy.\n\nSerialized, found footage style web videos featuring Slender Man became popular on YouTube in the beginning of the decade. Such series included TribeTwelve, EverymanHybrid, and Marble Hornets, the latter of which has been adapted into a feature film. The character as well as the multiple series is credited with reinvigorating interest in found footage as well as urban folklore. Horror has become prominent on television with The Walking Dead, American Horror Story, and The Strain. Also, many popular horror films have had successful television series made: Psycho spawned Bates Motel, The Silence of the Lambs spawned Hannibal, and both Scream and Friday the 13th had TV series in development.\n\nYou're Next (2011) and The Cabin in the Woods (2012) led to a return to the slasher genre; the latter was intended also as a critical satire of torture porn. The Green Inferno (2015) pays homage to the controversial horror film Cannibal Holocaust (1980). Australian psychological horror The Babadook (2014) was met with critical acclaim. It Follows (2014) subverted traditional horror tropes of sexuality and slasher films and enjoyed commercial and critical success. The Conjuring deal with the paranormal. Sinister (2012) is a British-American supernatural horror film directed by Scott Derrickson and written by Derrickson and C. Robert Cargill. Another notable  supernatural horror film is Insidious (2010). The Witch (2015) is a historical period supernatural horror film written and directed by Robert Eggers in his directorial debut, which follows a Puritan family encountering forces of evil in the woods beyond their New England farm. Get Out (2017) received universal acclaim from critics and audiences alike. Adapted from the Stephen King novel, It (2017) set a box office record for horror films by grossing $123.1 million on opening weekend in the United States and nearly $185 million globally.https://www.forbes.com/sites/scottmendelson/2017/09/11/it-box-office-pennywise-is-bigger-than-jesus-with-a-123m-weekend/#5ce38d455c85 Gerald's Game (2017) is a psychological horror film based on Stephen King's novel of the same name. Other horror films include Frozen (2010), The Innkeepers (2011), Oculus (2013), Mama (2013), Green Room (2015), The Invitation (2015), Hush (2016), Lights Out (2016), Don't Breathe (2016).\n\nThe success of non-English language films continued with the Swedish film Marianne (2011), while Let the Right One In (2008)  was the subject of a Hollywood remake, Let Me In (2010). South Korean horror produced I Saw the Devil (2010) and Train to Busan (2016). Raw is a 2016 French-Belgian horror drama written and directed by Julia Ducournau, and starring Garance Marillier.\n\nSubgenres\n\n* Action horror – A subgenre combining the intrusion of an evil force, event, or personage of horror movies with the weapon fights and frenetic chases of the action genre. Themes or elements often prevalent in typical action-horror films include gore, demons, aliens, vicious animals, vampires and, most commonly, zombies. This category also fuses the fantasy genre. Examples include: Aliens, Predator, Dog Soldiers, From Dusk till Dawn, I Saw the Devil, Priest, Feast and Train to Busan.\n* Horror adventure - A film that blends expeditions, exploration, exotic places and other adventure elements in a horror setting. Examples include: King Kong, The Descent, Silent Hill, Jaws, Cannibal Holocaust.\n* Comedy horror – Combines elements of comedy and horror fiction. The comedy horror genre often crosses over with the black comedy genre and are occasionally also horror films with a lower rating aimed at a family audience. The short story The Legend of Sleepy Hollow by Washington Irving is cited as \"the first great comedy-horror story\". Examples of comedy horror films include: An American Werewolf in London, Beetlejuice, Jennifer's Body, Teeth, Nina Forever, Slither, Army of Darkness, Zombieland, Scary Movie and Idle Hands. Gremlins and Ghostbusters were examples of comedy horror films aimed at a family audience.\n* Body horror – In which the horror is principally derived from the graphic destruction or degeneration of the body. Other types of body horror include unnatural movements, or the anatomically incorrect placement of limbs to create 'monsters' out of human body parts. David Cronenberg is one of the notable directors of the genre. Body horror films include: Starry Eyes, Videodrome, Dead Ringers, Contracted, The Thing, The Fly and American Mary.\n* Horror drama – A film that focuses on imperiled characters dealing with realistic emotional struggles, often involving dysfunctional family relations, in a horror setting. The film's horror elements often serve as a backdrop to an unraveling dramatic plot. Examples include: Dark Water, The Exorcism of Emily Rose, Lights Out, The Babadook, It, Let the Right One In, Antichrist, Excision, Mama, Mirrors and Audition.\n* Holiday horror – A film which depicts horror events which are set during a holiday or holiday season. It often involves a psychopathic killer stalking a sequence of victims in a violent manner. It is set during Christmas, Halloween, Valentine's Day, April Fools' Day, or Thanksgiving. Examples include: Silent Night, Deadly Night, Black Christmas, Halloween, My Bloody Valentine, Home Sweet Home, April Fool's Day, Valentine, Trick 'r Treat and All Through the House.\n* Psychological horror – Relies on characters' fears, guilt, beliefs, eerie sound effects, relevant music, emotional instability and at times, the supernatural and ghosts, to build tension, scare and further the plot. Notable psychological horror films include: Repulsion, Rosemary's Baby, The Shining, May, Credo, Black Swan, The Changeling, The Uninvited and Get Out.\n* Science fiction horror – Often revolves around subjects that include but are not limited to killer aliens, mad scientists, and/or experiments gone wrong. Examples include: Frankenstein, Species, Mimic, Alien, The Thing, The Blob, Apollo 18, Event Horizon and Resident Evil.\n* Slasher film – Often revolves around a serial killer who systematically murders people through violent means. Examples include: Psycho, The Texas Chain Saw Massacre, Halloween, Friday the 13th, Black Christmas, A Nightmare on Elm Street, Child's Play (1988), and Scream.\n* Splatter film – These films deliberately focus on graphic portrayals of gore and graphic violence. Through the use of special effects and excessive blood and guts, they tend to display an overt interest in the vulnerability of the human body and the theatricality of its mutilation. Examples of splatter horror films include: Inside, Train, The Human Centipede, Hostel, Saw, Blood Feast, Storm Warning and Maniac.\n* Supernatural horror – Includes menacing ghosts, demons, or other depictions of supernatural occurrences. Supernatural horror films often combine elements of religion into the plot. Common themes include vengeful ghosts, witches, the devil, and demonic possession. Examples include: The Ring, The Grudge, The Amityville Horror, It, The Omen, The Exorcist, Paranormal Activity, The Blair Witch Project, The Conjuring, Silent Hill, Sinister\n* Gothic horror – Gothic horror is a type of story that contains elements of goth and horror. At times it may have romance that unfolds in the setting of a horror tale, usually suspenseful. Some of the earliest horror movies were of this subgenre. Examples include: Dracula, Sleepy Hollow, The Others, The Phantom of the Opera, Kill, Baby, Kill, Nosferatu, and Crimson Peak.\n* Natural horror – A subgenre of horror films \"featuring nature running amok in the form of mutated beasts, carnivorous insects, and normally harmless animals or plants turned into cold-blooded killers.\" This genre may sometimes overlap with the science fiction and action and adventure genres. Examples include: The Birds, Jaws, Piranha, Bats, Lake Placid, Rogue, Alligator, Black Water\n* Zombie film – Zombie films feature creatures who are usually portrayed as either reanimated corpses or mindless human beings. Distinct subgenres have evolved, such as the zombie comedy, which may or may not retain a significant horror theme, and often crosses into black comedy. Examples include: White Zombie, Night of the Living Dead, Dawn of the Dead, REC, 28 Days Later, Deadgirl, Dead Snow, Night of the Creeps and Messiah of Evil.\n*Found footage horror: A film \"technique\" sometimes referred to as a subgenre which involves giving the audience a first person view of the story that is discovered from an original recording source within the plot. Recording film in this way merges the audience with the character’s experiences inducing suspense, shock, and bafflement.refMcRobert, Neil. \"Mimesis of Media: Found Footage Cinema and the Horror of the Real.\" Gothic Studies, vol. 17, no. 2, Nov. 2015, pp. 137-150. EBSCOhost, doi:10.7227/GS.17.2.9 Examples of first-person horror include The Blair Witch Project (1999), Paranormal Activity (2007), Cloverfield (2008), and Devil's Due (2014) Reyes, Xavier Aldana. \"Reel Evil: A Critical Reassessment of Found Footage Horror.\" Gothic Studies, vol. 17, no. 2, Nov. 2015, pp. 122-136. EBSCOhost, doi:10.7227/GS.17.2.8.\n*Teen horror – A horror subgenre that victimizes teenagers while usually promoting strong, anti-conformity teenage leads, appealing to young generations. This subgenre often depicts themes of sex, under-aged drinking, and gore. It was most popular in 1964-1965.Miller C, Van Riper A. Marketing, Monsters, and Music: Teensploitation Horror Films. Journal of American Culture [serial online]. June 2015;38(2):130-141. Available from: Academic Search Complete, Ipswich, MA. Accessed 21 March 2017.\n\nInfluences\n\nInfluences on society\n\nHorror films' evolution throughout the years has given society a new approach to resourcefully utilize their benefits. The horror film style has changed over time, but in 1996 Scream set off a \"chain of copycats\", leading to a new variety of teenage, horror movies. This new approach to horror films began to gradually earn more and more revenue as seen in the progress of Scream movies; the first movie earned $6 million and the third movie earned $101 million. The importance that horror films have gained in the public and producers’ eyes is one obvious effect on our society.\n\nHorror films' income expansion is only the first sign of the influences of horror flicks. The role of women and how women see themselves in the movie industry has been altered by the horror genre. Early horror films such as My Bloody Valentine (1981), Halloween (1978), and Friday the 13th (1980) were produced mostly for male audiences in order to \"feed the fantasies of young men\". This idea is no longer prevalent in horror films, as women have become not only the main audience and fans of horror films but also the main protagonists of contemporary horror films. Movie makers have also begun to integrate topics more broadly associated with other genres into their films in order to grow audience appeal.\n\nMany early horror films created high social and legal controversy. In the US, the Motion Picture Production Code was in force between 1930 and 1968, although it was strictly enforced only from 1934 to the late 1950s. The Code set guidelines of what was morally acceptable to show in movies, and, as such, it restrained movies containing  controversial themes, severe violence, explicit sexuality or nudity. The gradual abandonment of the Code, and eventually its formal repeal in 1968 (when it was replaced by the MPAA film rating system) offered more freedom to the movie industry. Nevertheless, controversy continued to surround horror movies, and many continued to face censorship issues in many countries. An example of such film is the 1978 I Spit on Your Grave, an  American rape-and-revenge exploitation horror film written, co-produced, directed, and edited by Meir Zarchi. The film was received negatively by critics, but it attracted a great deal of national and international attention due to its explicit scenes of rape, murder and prolonged nudity which led it to be banned in many countries, including  Ireland, Norway, Iceland, and West Germany. Many of these countries have in later years removed the ban, but the film remains prohibited in Ireland.https://www.irishtimes.com/news/re-release-of-i-spit-on-your-grave-banned-by-film-body-1.653261\n\nInfluences internationally\n\nWhile horror is only one genre of film, the influence it presents to the international community is large. Horror movies tend to be a vessel for showing eras of audiences issues across the globe visually and in the most effective manner. Jeanne Hall, a film theorist, agrees with the use of horror films in easing the process of understanding issues by making use of their optical elements. The use of horror films to help audiences understand international prior historical events occurs, for example, to show the horridness of the Vietnam War, the Holocaust and the worldwide AIDS epidemic. However, horror movies do not always present positive endings. In fact, in many occurrences the manipulation of horror presents cultural definitions that are not accurate, yet set an example to which a person relates to that specific cultural from then on in their life.\n\nThe visual interpretations of films can be lost in the translation of their elements from one culture to another like in the adaptation of the Japanese film Ju on into the American film The Grudge. The cultural components from Japan were slowly \"siphoned away\" to make the film more relatable to a western audience. This deterioration that can occur in an international remake happens by over-presenting negative cultural assumptions that, as time passes, sets a common ideal about that particular culture in each individual. Holm's discussion of The Grudge remakes presents this idea by stating, \"It is, instead, to note that The Grudge films make use of an un-theorized notion of Japan... that seek to directly represent the country.\". Horror film. http://en.wikipedia.org/?curid=13451."
  }
}
