{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=6907",
  "eid" : "debce310-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778453441,
  "textBody" : "Chakra (IAST: C̣akra, meaning \"wheel, circle\"), sometimes spelled Cakra or Cakka, is any center of subtle body believed to be a psychic-energy center in the esoteric traditions of Indian religions.[https://www.britannica.com/topic/chakra Chakra: Religion], Encyclopaedia Britannica\n\nThe concept is found particularly in the tantric traditions of Hinduism, Buddhism and Jainism. They are conceived as an energy focal point, bodily functions or psychic node in the subtle body. The Chakra theories are an elaborate part of the Kundalini system. These theories differ between the Indian religions, with esoteric Buddhist literature mentioning four Chakras, while esoteric Hindu texts stating seven. They are believed to be part of the subtle body, not the physical body, and connected by energy channels called Nadi. In the Kundalini version of yoga, breath exercises focus, in part, on mastering and channeling energy through Chakras.\n\nEtymology\n\nThe word Chakra (चक्र) derives from the Sanskrit word meaning \"wheel,\" as well as \"circle\" and \"cycle\". One of the Hindu scriptures Rigveda mentions Chakra with the meaning of \"wheel\", with ara (spokes). According to Frits Staal, Chakra has Indo-European roots, is \"related to Greek Kuklos (from which comes English cycle), Latin circus, Anglo-Saxon hveohl and English wheel.\" However, the Vedic period texts use the same word as a simile in other contexts, such as the \"wheel of time\" or \"wheel of dharma\", such as in Rigveda hymn verse 1.164.11.[https://sa.wikisource.org/wiki/ऋग्वेद:_सूक्तं_१.१६४ ऋग्वेद: सूक्तं १.१६४], verse ॥११॥, Rigveda, Wikisource\n\nIn Buddhism, the Sanskrit term cakra (Pali cakka) also means \"wheel\", but it is used in the additional sense of \"circle\" connoting rebirth in six realms of existence where a being is reborn after each death.\n\nIn Jainism, the term Chakra also means \"wheel\" and appears in various context in its ancient literature. Like other Indian religions, Chakra in esoteric theories in Jainism such as those by Buddhisagarsuri means yogic-energy centers.\n\nHistory\n\nThe term Chakra already appears in Vedic literature, the earliest stratum of Hindu scripture, but not in the sense of psychic energy centers, rather as chakravartin or the king who \"turns the wheel of his empire\" in all directions from a center, representing his influence and power. The iconography popular in representing the Chakras, states White, trace back to the five symbols of yajna, the Vedic fire altar: \"square, circle, triangle, half moon and dumpling\".\n\nThe hymn 10.136 of the Rigveda mentions a loner yogi ascetic with a female named kunamnama. Literally, it means \"she who is bent, coiled\", and it probably is either a minor goddess or one of many embedded puzzles and hidden references within the Rigveda. Some scholars, such as David Gordon White and Georg Feuerstein interpret this might be related to kundalini shakti, and a prelude to the terms such as chakra that emerged later.\n\nBreath channels (nāḍi) of Yoga practices are mentioned in the classical Upanishads of Hinduism dated to 1st millennium BCE,Trish O’Sullivan (2010), Chakras. In: D.A. Leeming, K. Madden, S. Marlan (eds.), Encyclopedia of Psychology and Religion, Springer Science + Business Media. but not psychic-energy Chakra theories. The latter, states White, were introduced about 8th-century CE in Buddhist texts as hierarchies of inner energy centers, such as in the Hevajra Tantra and Caryāgiti.White, David Gordon. [https://press.princeton.edu/chapters/i9565.pdf Yoga in Practice]. Princeton University Press 2012, pages 14-15. These are called by various terms such as cakka, padma (lotus) or pitha (mound). These medieval Buddhist texts mention only four chakras, while later Hindu texts such as the Kubjikāmata and Kaulajñānanirnaya expanded the list to many more.\n\nIn contrast to White, according to Feuerstein, early Upanishads of Hinduism do mention cakra in the sense of \"psychospiritual vortices\", along with other terms found in tantra: prana or vayu (life energy) along with nadi (energy carrying arteries). According to Galvin Flood, the ancient texts do not present chakra and kundalini-style yoga theories although these words appear in the earliest Vedic literature in many contexts. The chakra in the sense of four or more vital energy centers appear in the medieval era Hindu and Buddhist texts.\n\nOverview\n\nChakra is a part of the esoteric medieval era theories about physiology and psychic centers that emerged across Indian traditions. The theory posited that human life simultaneously exists in two parallel dimensions, one \"physical body\" (sthula sarira) and other \"psychological, emotional, mind, non-physical\" it is called the \"subtle body\" (suksma sarira). This subtle body is energy, while the physical body is mass. The psyche or mind plane corresponds to and interacts with the body plane, and the theory posits that the body and the mind mutually affect each other. The subtle body consists of nadi (energy channels) connected by nodes of psychic energy it called chakra. The theory grew into extensive elaboration, with some suggesting 88,000 cakras throughout the subtle body. The chakra it considered most important varied between various traditions, but they typically ranged between four and seven.\n\nThe important chakras are stated in Buddhist and Hindu texts to be arranged in a column along the spinal cord, from its base to the top of the head, connected by vertical channels. The tantric traditions sought to master them, awaken and energize them through various breathing exercises or with assistance of a teacher. These chakras were also symbolically mapped to specific human physiological capacity, seed syllables (bija), sounds, subtle elements (tanmatra), in some cases deities, colors and other motifs.\n\nThe chakra theories of Buddhism and Hinduism differs from the historic Chinese system of meridians in acupuncture. Unlike the latter, the chakra relates to subtle body, wherein it has a position but no definite nervous node or precise physical connection. The tantric systems envision it as a continually present, highly relevant and a means to psychic and emotional energy. It is useful in a type of yogic rituals and meditative discovery of radiant inner energy (prana flows) and mind-body connections. The meditation is aided by extensive symbology, mantras, diagrams, models (deity and mandala). The practitioner proceeds step by step from perceptible models, to increasingly abstract models where deity and external mandala are abandoned, inner self and internal mandalas are awakened.\n\nThese ideas are not unique to Buddhist and Hindu traditions. Similar and overlapping concepts emerged in other cultures in the East and the West, and these are variously called by other names such as subtle body, spirit body, esoteric anatomy, sidereal body and etheric body. According to Geoffrey Samuel and Jay Johnston, professors of Religious studies known for their studies on Yoga and esoteric traditions:\n\nContrast with classical yoga\n\nChakra and related theories have been important to the esoteric traditions, but they are not directly related to mainstream yoga. According to Edwin Bryant and other scholars, the goals of classical yoga such as spiritual liberation (freedom, self-knowledge, moksha) is \"attained entirely differently in classical yoga, and the cakra / nadi / kundalini physiology is completely peripheral to it.\"\n\nClassical traditions\n\nThe classical eastern traditions, particularly those that developed in India during the 1st millennium AD, primarily describe nadi and cakra in a \"subtle body\" context. To them, they are the parallel dimension of psyche-mind reality that is invisible yet real. In the nadi and cakra flow the prana (breath, life energy). The concept of \"life energy\" varies between the texts, ranging from simple inhalation-exhalation to far more complex association with breath-mind-emotions-sexual energy. These are envisioned as an life energy essence that flows through channels in the subtle body and meet at nodes called chakra. This essence is what vanishes when a person dies, leaving a gross body. Some of it, states this subtle body theory, is what withdraws within when one sleeps. All of it is believed to be reachable, awake-able and important for an individual's body-mind health, and how one relates to other people in one's life. This subtle body network of nadi and chakra is, according to these Indian theories, closely associated with emotions, mind, mood, feeling about oneself and feeling for others.\n\nHindu Tantra\n\nThe esoteric traditions in Hinduism mention numerous chakras, of which they state seven are most important. This, according to David Gordon White, is one among many systems found in Hindu tantric literature. These texts teach many different Chakra theories.\n\nThe Chakra methodology is extensively developed in the goddess tradition of Hinduism called Shaktism. It is an important concept along with yantras, mandalas and kundalini yoga system in its practice. Chakra in Shakta tantrism means circle, a \"energy center\" within, as well as is a term of group rituals such as in chakra-puja (worship within a circle) which may or may not involve tantra practice. The cakra-based system is a part of the meditative exercises called Laya yoga.\n\nSome sub-traditions within the Shiva-related (Shaivism) school of Hinduism also developed texts and practices on Nadi and Chakra systems. According to Geoffrey, these systems were mapped to consciousness, energy or emotion, much like Vajrayana Buddhism. These Hindu traditions also developed the yoga sub-school called the kriya yoga, or \"yoga of ritual action\", believed by its practitioners to activate Chakra and energy centers in the body.\n\nVajrayana Buddhist Tantra\n\nThe esoteric traditions in Buddhism generally teach four chakras. These are the Manipura, the Andhata, the Visuddha and the Usnisa Kamala. In another version, these four are the Nirmana, the Dharma, the Sambhoga and the Mahasukha (respectively corresponding to the Shaiva tantra school's following four of seven chakra: Svadhisthana, the Anahata, the Visuddha and the Sahasrara). However, depending on the meditational tradition, these vary between three and six.\n\nChakras play an important role in the Tibetan Buddhism in completion stage practices. It is practiced to bring the subtle winds of the body into the central channel, to realise the clear light of bliss and emptiness, and to attain Buddhahood.Geshe Gelsang Kyatos, Clear Light of Bliss.\n\nAccording to Geoffrey Samuel, the Tibetan and esoteric Buddhist traditions developed cakra and nadi as \"central to their soteriological process\". The theories were coupled with a tradition of physical exercises, now sometimes called yantra yoga, but traditionally referred to a phrul 'khor in Tibetan. This style of yoga emphasizes visualizations and internal practices, somewhat similar to the kriya yoga practices in some sub-traditions of Hinduism. The differences between the two styles, according to Geoffrey, has been that the Tibetan tradition focussed more on \"offering rituals to benign deities\" already prevalent in Tibet, while the Indic traditions focussed more on the internal practices linked to subtle body concepts. The yantra yoga at the Completion Stage of esoteric Buddhism typically followed its deity-yoga practices of the Generation Stage.\n\nThe Chakra in the Tibetan practice are considered psycho-physical centers, each associated with a cosmic Buddha.\n\nBön\n\nChakras, according to the Bon tradition, influence the quality of experience, because movement of vayu cannot be separated from experience. Each of the six major chakras is linked to experiential qualities of one of the six realms of existence.\n\nThe tsa lung practices such as those embodied in Trul khor lineages open channels so lung (the Tibetan term for vayu) may move without obstruction. Yoga opens chakras and evokes positive qualities associated with a particular chakra. In the hard drive analogy, the screen is cleared and a file is called up that contains positive, supportive qualities. A bīja (seed syllable) is used both as a password that evokes the positive quality and the armour that sustains the quality.\n\nTantric practice is said to eventually transform all experience into bliss. The practice aims to liberate from negative conditioning and leads to control over perception and cognition.\n\nQigong\n\nQigong () also relies on a similar model of the human body as an esoteric energy system, except that it involves the circulation of qì (, also ki) or life-energy.Charles Luk,  Taoist Yoga – Alchemy and Immortality, Rider and Company, London, 1970Mantak and Maneewan Chia Awaken Healing Light of the Tao (Healing Tao Books, 1993), ch.5 The qì, equivalent to the Hindu prana, flows through the energy channels called meridians, equivalent to the nadi, but two other energies are also important: jīng, or primordial essence, and shén, or spirit energy.\n\nIn the principle circuit of qì, called the microcosmic orbit, energy rises up a main meridian along the spine, but also comes back down the front torso. Throughout its cycle it enters various dantian (elixir fields) which act as furnaces, where the types of energy in the body (jing, qi and shen) are progressively refined.Yang Erzeng, Philip Clart. The Story of Han Xiangzi: the alchemical adventures of a Taoist immortal These dantian play a very similar role to that of chakras. The number of dantian varies depending on the system; the navel dantian is the most well-known, but there is usually a dantian located at the heart and between the eyebrows.Mantak and Maneewan Chia Awaken Healing Light of the Tao (Healing Tao Books, 1993), ch.13 The lower dantian at or below the navel transforms essence, or jīng, into qì. The middle dantian in the middle of the chest transforms qì into shén, or spirit, and the higher dantian at the level of the forehead (or at the top of the head), transforms shen into wuji, infinite space of void.Andy James. The Spiritual Legacy of Shaolin Temple\n\nSilat\n\nTraditional spirituality in the Malay Archipelago borrows heavily from Hindu-Buddhist concepts. In Malay and Indonesian metaphysical theory, the chakras' energy rotates outwards along diagonal lines. Defensive energy emits outwards from the centre line, while offensive energy moves inwards from the sides of the body. This can be applied to energy-healing, meditation, or martial arts. Silat practitioners learn to harmonise their movements with the chakras, thereby increasing the power and effectiveness of attacks and movements.\n\nDescription of each chakra\n\nThe more common and most studied esoteric system incorporates seven major chakras, which are arranged vertically along the axial channel (sushumna nadi in Hindu texts, Avadhuti in some Buddhist texts). It was the chakra system that was translated in early 20th century by Sir John Woodroffe (also called Arthur Avalon) in the text The Serpent Power. Avalon translated the Hindu text Sat-Cakra-Nirupana.\n\nThe Chakras are considered as meditation aids, wherein the yogi progresses from lower located Chakras to the highest Chakra blossoming in the crown of the head reflecting the journey of spiritual ascent. In both the Hindu and Buddhist traditions, the Chakra are visualized with an energy goddess residing dormant in the lowest chakra, and one of the aims is to awaken her within. In Hindu texts she is known as Kundalini, while in Buddhist texts she is called Candali or Tummo (Tibetan: gtum mo, \"fierce one\"). While both systems associate deities with their chakra-knot systems (Tibetan: rtsa 'khor), the meditational goals are different: in Hindu systems, the aim is to discover and realize the Shiva within. In Buddhist system, it is to transcend the ordinary truth and discover the truth of the Buddha, or according to the Hevajra Tantra burn the conventional Buddhas and attain the Buddhahood of Hevajra.\n\nBelow is a description of these seven chakras:\n\nSahasrara\n\nAjna\n\nVishuddha\n\nAnahata\n\nManipura\n\nSvadhishthana\n\nMuladhara\n\nOther chakras\n\nHridhiya chakra (also known as hrid chakra) is measured from centre of Anahata chakra, two fingers to the left and continue with two finger down, whereby the heart beat can be felt. Talu chakra is located at behind of Reticular Formation at Fourth Ventrical before beginning of spinal cord. There are said to be 21 minor chakras which are reflected points of the major chakras.Cross, J. R. Acupressure and Reflextherapy in the Treatment of Medical Conditions. Elsevier Health Sciences, 2001, p. 12.\n\nThere are said to be three chakras that are beyond the physical and spiritual. They are called Golata, Lalata, and Lalana and \"located on the uvula at the back of the throat, above the Ajna chakra, and within the soft upper palate\".Svoboda, Robert. Aghora II: Kundalini, p. 71.\n\nReception and similar theories in the West\n\nIn 1918, the translation of two Indian texts: the Sat-Cakra-Nirupana and the Padaka-Pancaka, by Sir John Woodroffe, alias Arthur Avalon, in a book titled The Serpent Power introduced the shakta theory of seven main chakras in the West.Woodroffe, The Serpent Power, Dover Publications, pp.317ff This book is extremely detailed and complex, and later the ideas were developed into the predominant Western view of the chakras by C. W. Leadbeater in his book The Chakras. Many of the views which directed Leadbeater's understanding of the chakras were influenced by previous theosophist authors, in particular Johann Georg Gichtel, a disciple of Jakob Böhme, and his book Theosophia Practica (1696), in which Gichtel directly refers to inner force centres, a concept reminiscent of the chakras.[http://www.archeosofica.org/en/index.php/Theosophical-Excerpts/Gichtel-and-the-Theosophia-Practica.html ] \n\nHesychasm\n\nA completely separate contemplative movement within the Eastern Orthodox Church is Hesychasm, a form of Christian meditation. Comparisons have been made between the Hesychastic centres of prayer and the position of the chakras.Mircea Eliade. Yoga, Immortality and Freedom Particular emphasis is placed upon the heart area. However, there is no talk about these centres as having any sort of metaphysical existence. Far more than in any of the cases discussed above, the centres are simply places to focus the concentration during prayer.\n\nNew Age\n\nIn Anatomy of the Spirit (1996), Caroline Myss describes the function of chakras as follows: \"Every thought and experience you've ever had in your life gets filtered through these chakra databases. Each event is recorded into your cells...\".  The chakras are described as being aligned in an ascending column from the base of the spine to the top of the head. New Age practices often associate each chakra with a certain colour. In various traditions, chakras are associated with multiple physiological functions, an aspect of consciousness, a classical element, and other distinguishing characteristics. They are visualised as lotuses or flowers with a different number of petals in every chakra.\n\nThe chakras are thought to vitalise the physical body and to be associated with interactions of a physical, emotional and mental nature. They are considered loci of life energy or prana (which New Age belief equates with shakti, qi in Chinese, ki in Japanese, koach-ha-gufHelena Blavatsky (1892). Theosophical Glossary. Krotona. in Hebrew, bios in Greek, and aether in both Greek and English), which is thought to flow among them along pathways called nadi. The function of the chakras is to spin and draw in this energy to keep the spiritual, mental, emotional and physical health of the body in balance.\n\nRudolf Steiner considered the chakra system to be dynamic and evolving. He suggested that this system has become different for modern people than it was in ancient times and that it will, in turn, be radically different in future times.http://wn.rsarchive.org/Books/GA010/English/MAC1909/GA010b_index.html Steiner described a sequence of development that begins with the upper chakras and moves down, rather than moving in the opposite direction. He gave suggestions on how to develop the chakras through disciplining thoughts, feelings, and will.Rudolf Steiner, How to Know Higher Worlds\n\nAccording to Florin Lowndes, a \"spiritual student\" can further develop and deepen or elevate thinking consciousness when taking the step from the \"ancient path\" of schooling to the \"new path\" represented by Steiner's The Philosophy of Freedom.\n\nEndocrine system\n\nChakras and their importance are posited to reside in the psyche. However, there are those who believe that chakras have a physical manifestation as well. Gary Osborn, for instance, has described the chakras as metaphysical counterparts to the endocrine glands, while Anodea Judith noted a marked similarity between the positions of the two and the roles described for each. Stephen Sturgess also links the lower six chakras to specific nerve plexuses along the spinal cord as well as glands. C.W. Leadbeater associated the Ajna chakra with the pineal gland, which is a part of the endocrine system. These associations remain speculative, however, and have yet to be empirically validated.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Chakra" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=6907" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Chakra (IAST: C̣akra, meaning \"wheel, circle\"), sometimes spelled Cakra or Cakka, is any center of subtle body believed to be a psychic-energy center in the esoteric traditions of Indian religions.[https://www.britannica.com/topic/chakra Chakra: Religion], Encyclopaedia Britannica\n\nThe concept is found particularly in the tantric traditions of Hinduism, Buddhism and Jainism. They are conceived as an energy focal point, bodily functions or psychic node in the subtle body. The Chakra theories are an elaborate part of the Kundalini system. These theories differ between the Indian religions, with esoteric Buddhist literature mentioning four Chakras, while esoteric Hindu texts stating seven. They are believed to be part of the subtle body, not the physical body, and connected by energy channels called Nadi. In the Kundalini version of yoga, breath exercises focus, in part, on mastering and channeling energy through Chakras.\n\nEtymology\n\nThe word Chakra (चक्र) derives from the Sanskrit word meaning \"wheel,\" as well as \"circle\" and \"cycle\". One of the Hindu scriptures Rigveda mentions Chakra with the meaning of \"wheel\", with ara (spokes). According to Frits Staal, Chakra has Indo-European roots, is \"related to Greek Kuklos (from which comes English cycle), Latin circus, Anglo-Saxon hveohl and English wheel.\" However, the Vedic period texts use the same word as a simile in other contexts, such as the \"wheel of time\" or \"wheel of dharma\", such as in Rigveda hymn verse 1.164.11.[https://sa.wikisource.org/wiki/ऋग्वेद:_सूक्तं_१.१६४ ऋग्वेद: सूक्तं १.१६४], verse ॥११॥, Rigveda, Wikisource\n\nIn Buddhism, the Sanskrit term cakra (Pali cakka) also means \"wheel\", but it is used in the additional sense of \"circle\" connoting rebirth in six realms of existence where a being is reborn after each death.\n\nIn Jainism, the term Chakra also means \"wheel\" and appears in various context in its ancient literature. Like other Indian religions, Chakra in esoteric theories in Jainism such as those by Buddhisagarsuri means yogic-energy centers.\n\nHistory\n\nThe term Chakra already appears in Vedic literature, the earliest stratum of Hindu scripture, but not in the sense of psychic energy centers, rather as chakravartin or the king who \"turns the wheel of his empire\" in all directions from a center, representing his influence and power. The iconography popular in representing the Chakras, states White, trace back to the five symbols of yajna, the Vedic fire altar: \"square, circle, triangle, half moon and dumpling\".\n\nThe hymn 10.136 of the Rigveda mentions a loner yogi ascetic with a female named kunamnama. Literally, it means \"she who is bent, coiled\", and it probably is either a minor goddess or one of many embedded puzzles and hidden references within the Rigveda. Some scholars, such as David Gordon White and Georg Feuerstein interpret this might be related to kundalini shakti, and a prelude to the terms such as chakra that emerged later.\n\nBreath channels (nāḍi) of Yoga practices are mentioned in the classical Upanishads of Hinduism dated to 1st millennium BCE,Trish O’Sullivan (2010), Chakras. In: D.A. Leeming, K. Madden, S. Marlan (eds.), Encyclopedia of Psychology and Religion, Springer Science + Business Media. but not psychic-energy Chakra theories. The latter, states White, were introduced about 8th-century CE in Buddhist texts as hierarchies of inner energy centers, such as in the Hevajra Tantra and Caryāgiti.White, David Gordon. [https://press.princeton.edu/chapters/i9565.pdf Yoga in Practice]. Princeton University Press 2012, pages 14-15. These are called by various terms such as cakka, padma (lotus) or pitha (mound). These medieval Buddhist texts mention only four chakras, while later Hindu texts such as the Kubjikāmata and Kaulajñānanirnaya expanded the list to many more.\n\nIn contrast to White, according to Feuerstein, early Upanishads of Hinduism do mention cakra in the sense of \"psychospiritual vortices\", along with other terms found in tantra: prana or vayu (life energy) along with nadi (energy carrying arteries). According to Galvin Flood, the ancient texts do not present chakra and kundalini-style yoga theories although these words appear in the earliest Vedic literature in many contexts. The chakra in the sense of four or more vital energy centers appear in the medieval era Hindu and Buddhist texts.\n\nOverview\n\nChakra is a part of the esoteric medieval era theories about physiology and psychic centers that emerged across Indian traditions. The theory posited that human life simultaneously exists in two parallel dimensions, one \"physical body\" (sthula sarira) and other \"psychological, emotional, mind, non-physical\" it is called the \"subtle body\" (suksma sarira). This subtle body is energy, while the physical body is mass. The psyche or mind plane corresponds to and interacts with the body plane, and the theory posits that the body and the mind mutually affect each other. The subtle body consists of nadi (energy channels) connected by nodes of psychic energy it called chakra. The theory grew into extensive elaboration, with some suggesting 88,000 cakras throughout the subtle body. The chakra it considered most important varied between various traditions, but they typically ranged between four and seven.\n\nThe important chakras are stated in Buddhist and Hindu texts to be arranged in a column along the spinal cord, from its base to the top of the head, connected by vertical channels. The tantric traditions sought to master them, awaken and energize them through various breathing exercises or with assistance of a teacher. These chakras were also symbolically mapped to specific human physiological capacity, seed syllables (bija), sounds, subtle elements (tanmatra), in some cases deities, colors and other motifs.\n\nThe chakra theories of Buddhism and Hinduism differs from the historic Chinese system of meridians in acupuncture. Unlike the latter, the chakra relates to subtle body, wherein it has a position but no definite nervous node or precise physical connection. The tantric systems envision it as a continually present, highly relevant and a means to psychic and emotional energy. It is useful in a type of yogic rituals and meditative discovery of radiant inner energy (prana flows) and mind-body connections. The meditation is aided by extensive symbology, mantras, diagrams, models (deity and mandala). The practitioner proceeds step by step from perceptible models, to increasingly abstract models where deity and external mandala are abandoned, inner self and internal mandalas are awakened.\n\nThese ideas are not unique to Buddhist and Hindu traditions. Similar and overlapping concepts emerged in other cultures in the East and the West, and these are variously called by other names such as subtle body, spirit body, esoteric anatomy, sidereal body and etheric body. According to Geoffrey Samuel and Jay Johnston, professors of Religious studies known for their studies on Yoga and esoteric traditions:\n\nContrast with classical yoga\n\nChakra and related theories have been important to the esoteric traditions, but they are not directly related to mainstream yoga. According to Edwin Bryant and other scholars, the goals of classical yoga such as spiritual liberation (freedom, self-knowledge, moksha) is \"attained entirely differently in classical yoga, and the cakra / nadi / kundalini physiology is completely peripheral to it.\"\n\nClassical traditions\n\nThe classical eastern traditions, particularly those that developed in India during the 1st millennium AD, primarily describe nadi and cakra in a \"subtle body\" context. To them, they are the parallel dimension of psyche-mind reality that is invisible yet real. In the nadi and cakra flow the prana (breath, life energy). The concept of \"life energy\" varies between the texts, ranging from simple inhalation-exhalation to far more complex association with breath-mind-emotions-sexual energy. These are envisioned as an life energy essence that flows through channels in the subtle body and meet at nodes called chakra. This essence is what vanishes when a person dies, leaving a gross body. Some of it, states this subtle body theory, is what withdraws within when one sleeps. All of it is believed to be reachable, awake-able and important for an individual's body-mind health, and how one relates to other people in one's life. This subtle body network of nadi and chakra is, according to these Indian theories, closely associated with emotions, mind, mood, feeling about oneself and feeling for others.\n\nHindu Tantra\n\nThe esoteric traditions in Hinduism mention numerous chakras, of which they state seven are most important. This, according to David Gordon White, is one among many systems found in Hindu tantric literature. These texts teach many different Chakra theories.\n\nThe Chakra methodology is extensively developed in the goddess tradition of Hinduism called Shaktism. It is an important concept along with yantras, mandalas and kundalini yoga system in its practice. Chakra in Shakta tantrism means circle, a \"energy center\" within, as well as is a term of group rituals such as in chakra-puja (worship within a circle) which may or may not involve tantra practice. The cakra-based system is a part of the meditative exercises called Laya yoga.\n\nSome sub-traditions within the Shiva-related (Shaivism) school of Hinduism also developed texts and practices on Nadi and Chakra systems. According to Geoffrey, these systems were mapped to consciousness, energy or emotion, much like Vajrayana Buddhism. These Hindu traditions also developed the yoga sub-school called the kriya yoga, or \"yoga of ritual action\", believed by its practitioners to activate Chakra and energy centers in the body.\n\nVajrayana Buddhist Tantra\n\nThe esoteric traditions in Buddhism generally teach four chakras. These are the Manipura, the Andhata, the Visuddha and the Usnisa Kamala. In another version, these four are the Nirmana, the Dharma, the Sambhoga and the Mahasukha (respectively corresponding to the Shaiva tantra school's following four of seven chakra: Svadhisthana, the Anahata, the Visuddha and the Sahasrara). However, depending on the meditational tradition, these vary between three and six.\n\nChakras play an important role in the Tibetan Buddhism in completion stage practices. It is practiced to bring the subtle winds of the body into the central channel, to realise the clear light of bliss and emptiness, and to attain Buddhahood.Geshe Gelsang Kyatos, Clear Light of Bliss.\n\nAccording to Geoffrey Samuel, the Tibetan and esoteric Buddhist traditions developed cakra and nadi as \"central to their soteriological process\". The theories were coupled with a tradition of physical exercises, now sometimes called yantra yoga, but traditionally referred to a phrul 'khor in Tibetan. This style of yoga emphasizes visualizations and internal practices, somewhat similar to the kriya yoga practices in some sub-traditions of Hinduism. The differences between the two styles, according to Geoffrey, has been that the Tibetan tradition focussed more on \"offering rituals to benign deities\" already prevalent in Tibet, while the Indic traditions focussed more on the internal practices linked to subtle body concepts. The yantra yoga at the Completion Stage of esoteric Buddhism typically followed its deity-yoga practices of the Generation Stage.\n\nThe Chakra in the Tibetan practice are considered psycho-physical centers, each associated with a cosmic Buddha.\n\nBön\n\nChakras, according to the Bon tradition, influence the quality of experience, because movement of vayu cannot be separated from experience. Each of the six major chakras is linked to experiential qualities of one of the six realms of existence.\n\nThe tsa lung practices such as those embodied in Trul khor lineages open channels so lung (the Tibetan term for vayu) may move without obstruction. Yoga opens chakras and evokes positive qualities associated with a particular chakra. In the hard drive analogy, the screen is cleared and a file is called up that contains positive, supportive qualities. A bīja (seed syllable) is used both as a password that evokes the positive quality and the armour that sustains the quality.\n\nTantric practice is said to eventually transform all experience into bliss. The practice aims to liberate from negative conditioning and leads to control over perception and cognition.\n\nQigong\n\nQigong () also relies on a similar model of the human body as an esoteric energy system, except that it involves the circulation of qì (, also ki) or life-energy.Charles Luk,  Taoist Yoga – Alchemy and Immortality, Rider and Company, London, 1970Mantak and Maneewan Chia Awaken Healing Light of the Tao (Healing Tao Books, 1993), ch.5 The qì, equivalent to the Hindu prana, flows through the energy channels called meridians, equivalent to the nadi, but two other energies are also important: jīng, or primordial essence, and shén, or spirit energy.\n\nIn the principle circuit of qì, called the microcosmic orbit, energy rises up a main meridian along the spine, but also comes back down the front torso. Throughout its cycle it enters various dantian (elixir fields) which act as furnaces, where the types of energy in the body (jing, qi and shen) are progressively refined.Yang Erzeng, Philip Clart. The Story of Han Xiangzi: the alchemical adventures of a Taoist immortal These dantian play a very similar role to that of chakras. The number of dantian varies depending on the system; the navel dantian is the most well-known, but there is usually a dantian located at the heart and between the eyebrows.Mantak and Maneewan Chia Awaken Healing Light of the Tao (Healing Tao Books, 1993), ch.13 The lower dantian at or below the navel transforms essence, or jīng, into qì. The middle dantian in the middle of the chest transforms qì into shén, or spirit, and the higher dantian at the level of the forehead (or at the top of the head), transforms shen into wuji, infinite space of void.Andy James. The Spiritual Legacy of Shaolin Temple\n\nSilat\n\nTraditional spirituality in the Malay Archipelago borrows heavily from Hindu-Buddhist concepts. In Malay and Indonesian metaphysical theory, the chakras' energy rotates outwards along diagonal lines. Defensive energy emits outwards from the centre line, while offensive energy moves inwards from the sides of the body. This can be applied to energy-healing, meditation, or martial arts. Silat practitioners learn to harmonise their movements with the chakras, thereby increasing the power and effectiveness of attacks and movements.\n\nDescription of each chakra\n\nThe more common and most studied esoteric system incorporates seven major chakras, which are arranged vertically along the axial channel (sushumna nadi in Hindu texts, Avadhuti in some Buddhist texts). It was the chakra system that was translated in early 20th century by Sir John Woodroffe (also called Arthur Avalon) in the text The Serpent Power. Avalon translated the Hindu text Sat-Cakra-Nirupana.\n\nThe Chakras are considered as meditation aids, wherein the yogi progresses from lower located Chakras to the highest Chakra blossoming in the crown of the head reflecting the journey of spiritual ascent. In both the Hindu and Buddhist traditions, the Chakra are visualized with an energy goddess residing dormant in the lowest chakra, and one of the aims is to awaken her within. In Hindu texts she is known as Kundalini, while in Buddhist texts she is called Candali or Tummo (Tibetan: gtum mo, \"fierce one\"). While both systems associate deities with their chakra-knot systems (Tibetan: rtsa 'khor), the meditational goals are different: in Hindu systems, the aim is to discover and realize the Shiva within. In Buddhist system, it is to transcend the ordinary truth and discover the truth of the Buddha, or according to the Hevajra Tantra burn the conventional Buddhas and attain the Buddhahood of Hevajra.\n\nBelow is a description of these seven chakras:\n\nSahasrara\n\nAjna\n\nVishuddha\n\nAnahata\n\nManipura\n\nSvadhishthana\n\nMuladhara\n\nOther chakras\n\nHridhiya chakra (also known as hrid chakra) is measured from centre of Anahata chakra, two fingers to the left and continue with two finger down, whereby the heart beat can be felt. Talu chakra is located at behind of Reticular Formation at Fourth Ventrical before beginning of spinal cord. There are said to be 21 minor chakras which are reflected points of the major chakras.Cross, J. R. Acupressure and Reflextherapy in the Treatment of Medical Conditions. Elsevier Health Sciences, 2001, p. 12.\n\nThere are said to be three chakras that are beyond the physical and spiritual. They are called Golata, Lalata, and Lalana and \"located on the uvula at the back of the throat, above the Ajna chakra, and within the soft upper palate\".Svoboda, Robert. Aghora II: Kundalini, p. 71.\n\nReception and similar theories in the West\n\nIn 1918, the translation of two Indian texts: the Sat-Cakra-Nirupana and the Padaka-Pancaka, by Sir John Woodroffe, alias Arthur Avalon, in a book titled The Serpent Power introduced the shakta theory of seven main chakras in the West.Woodroffe, The Serpent Power, Dover Publications, pp.317ff This book is extremely detailed and complex, and later the ideas were developed into the predominant Western view of the chakras by C. W. Leadbeater in his book The Chakras. Many of the views which directed Leadbeater's understanding of the chakras were influenced by previous theosophist authors, in particular Johann Georg Gichtel, a disciple of Jakob Böhme, and his book Theosophia Practica (1696), in which Gichtel directly refers to inner force centres, a concept reminiscent of the chakras.[http://www.archeosofica.org/en/index.php/Theosophical-Excerpts/Gichtel-and-the-Theosophia-Practica.html ] \n\nHesychasm\n\nA completely separate contemplative movement within the Eastern Orthodox Church is Hesychasm, a form of Christian meditation. Comparisons have been made between the Hesychastic centres of prayer and the position of the chakras.Mircea Eliade. Yoga, Immortality and Freedom Particular emphasis is placed upon the heart area. However, there is no talk about these centres as having any sort of metaphysical existence. Far more than in any of the cases discussed above, the centres are simply places to focus the concentration during prayer.\n\nNew Age\n\nIn Anatomy of the Spirit (1996), Caroline Myss describes the function of chakras as follows: \"Every thought and experience you've ever had in your life gets filtered through these chakra databases. Each event is recorded into your cells...\".  The chakras are described as being aligned in an ascending column from the base of the spine to the top of the head. New Age practices often associate each chakra with a certain colour. In various traditions, chakras are associated with multiple physiological functions, an aspect of consciousness, a classical element, and other distinguishing characteristics. They are visualised as lotuses or flowers with a different number of petals in every chakra.\n\nThe chakras are thought to vitalise the physical body and to be associated with interactions of a physical, emotional and mental nature. They are considered loci of life energy or prana (which New Age belief equates with shakti, qi in Chinese, ki in Japanese, koach-ha-gufHelena Blavatsky (1892). Theosophical Glossary. Krotona. in Hebrew, bios in Greek, and aether in both Greek and English), which is thought to flow among them along pathways called nadi. The function of the chakras is to spin and draw in this energy to keep the spiritual, mental, emotional and physical health of the body in balance.\n\nRudolf Steiner considered the chakra system to be dynamic and evolving. He suggested that this system has become different for modern people than it was in ancient times and that it will, in turn, be radically different in future times.http://wn.rsarchive.org/Books/GA010/English/MAC1909/GA010b_index.html Steiner described a sequence of development that begins with the upper chakras and moves down, rather than moving in the opposite direction. He gave suggestions on how to develop the chakras through disciplining thoughts, feelings, and will.Rudolf Steiner, How to Know Higher Worlds\n\nAccording to Florin Lowndes, a \"spiritual student\" can further develop and deepen or elevate thinking consciousness when taking the step from the \"ancient path\" of schooling to the \"new path\" represented by Steiner's The Philosophy of Freedom.\n\nEndocrine system\n\nChakras and their importance are posited to reside in the psyche. However, there are those who believe that chakras have a physical manifestation as well. Gary Osborn, for instance, has described the chakras as metaphysical counterparts to the endocrine glands, while Anodea Judith noted a marked similarity between the positions of the two and the roles described for each. Stephen Sturgess also links the lower six chakras to specific nerve plexuses along the spinal cord as well as glands. C.W. Leadbeater associated the Ajna chakra with the pineal gland, which is a part of the endocrine system. These associations remain speculative, however, and have yet to be empirically validated. Chakra. http://en.wikipedia.org/?curid=6907."
  }
}
