{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=18896",
  "eid" : "35f86e10-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778599793,
  "textBody" : "Human spaceflight (also referred to as crewed spaceflight or manned spaceflight) is space travel with a crew or passengers aboard the spacecraft. Spacecraft carrying people may be operated directly, by human crew, or it may be either remotely operated from ground stations on Earth or be autonomous, able to carry out a specific mission with no human involvement.\n\nThe first human spaceflight was launched by the Soviet Union on 12 April 1961 as a part of the Vostok program, with cosmonaut Yuri Gagarin aboard. Humans have been continuously present in space for  on the International Space Station.  All early human spaceflight was crewed, where at least some of the passengers acted to carry out tasks of piloting or operating the spacecraft.  After 2015, several human-capable spacecraft are being explicitly designed with the ability to operate autonomously.\n\nSince the retirement of the US Space Shuttle in 2011, only Russia and China have maintained human spaceflight capability with the Soyuz program and Shenzhou program. Currently, all expeditions to the International Space Station use Soyuz vehicles, which remain attached to the station to allow quick return if needed. The United States is developing commercial crew transportation to facilitate domestic access to ISS and low Earth orbit, as well as the Orion vehicle for beyond-low Earth orbit applications.\n\nWhile spaceflight has typically been a government-directed activity, commercial spaceflight has gradually been taking on a greater role. The first private human spaceflight took place on 21 June 2004, when SpaceShipOne conducted a suborbital flight, and a number of non-governmental companies have been working to develop a space tourism industry. NASA has also played a role to stimulate private spaceflight through programs such as Commercial Orbital Transportation Services (COTS) and Commercial Crew Development (CCDev). With its 2011 budget proposals released in 2010, the Obama administration moved towards a model where commercial companies would supply NASA with transportation services of both people and cargo transport to low Earth orbit. The vehicles used for these services could then serve both NASA and potential commercial customers. Commercial resupply of ISS began two years after the retirement of the Shuttle, and commercial crew launches could begin by 2018.\n\nHistory \n\nCold War era \n\n \n\nHuman spaceflight capability was first developed during the Cold War between the United States and the Soviet Union (USSR), which developed the first intercontinental ballistic missile rockets to deliver nuclear weapons. These rockets were large enough to be adapted to carry the first artificial satellites into low Earth orbit. After the first satellites were launched in 1957 and 1958, the US worked on Project Mercury to launch men singly into orbit, while the USSR secretly pursued the Vostok program to accomplish the same thing. The USSR launched the first human in space, Yuri Gagarin, into a single orbit in Vostok 1 on a Vostok 3KA rocket, on 12 April 1961. The US launched its first astronaut, Alan Shepard, on a suborbital flight aboard Freedom 7 on a Mercury-Redstone rocket, on 5 May 1961. Unlike Gagarin, Shepard manually controlled his spacecraft's attitude, and landed inside it. The first American in orbit was John Glenn aboard Friendship 7, launched 20 February 1962 on a Mercury-Atlas rocket. The USSR launched five more cosmonauts in Vostok capsules, including the first woman in space, Valentina Tereshkova aboard Vostok 6 on 16 June 1963. The US launched a total of two astronauts in suborbital flight and four into orbit through 1963.\n\nUS President John F. Kennedy raised the stakes of the Space Race by setting the goal of landing a man on the Moon and returning him safely by the end of the 1960s. The US started the three-man Apollo program in 1961 to accomplish this, launched by the Saturn family of launch vehicles, and the interim two-man Project Gemini in 1962, which flew 10 missions launched by Titan II rockets in 1965 and 1966. Gemini's objective was to support Apollo by developing American orbital spaceflight experience and techniques to be used in the Moon mission.\n\nMeanwhile, the USSR remained silent about their intentions to send humans to the Moon, and proceeded to stretch the limits of their single-pilot Vostok capsule into a two- or three-person Voskhod capsule to compete with Gemini. They were able to launch two orbital flights in 1964 and 1965 and achieved the first spacewalk, made by Alexei Leonov on Voskhod 2 on 8 March 1965. But Voskhod did not have Gemini's capability to maneuver in orbit, and the program was terminated. The US Gemini flights did not accomplish the first spacewalk, but overcame the early Soviet lead by performing several spacewalks and solving the problem of astronaut fatigue caused by overcoming the lack of gravity, demonstrating up to two weeks endurance in a human spaceflight, and the first space rendezvous and dockings of spacecraft.\n\nThe US succeeded in developing the Saturn V rocket necessary to send the Apollo spacecraft to the Moon, and sent Frank Borman, James Lovell, and William Anders into 10 orbits around the Moon in Apollo 8 in December 1968. In July 1969, Apollo 11 accomplished Kennedy's goal by landing Neil Armstrong and Buzz Aldrin on the Moon 21 July and returning them safely on 24 July along with Command Module pilot Michael Collins. A total of six Apollo missions landed 12 men to walk on the Moon through 1972, half of which drove electric powered vehicles on the surface. The crew of Apollo 13, Lovell, Jack Swigert, and Fred Haise, survived a catastrophic in-flight spacecraft failure and returned to Earth safely without landing on the Moon.\n\nMeanwhile, the USSR secretly pursued human lunar orbiting and landing programs. They successfully developed the three-person Soyuz spacecraft for use in the lunar programs, but failed to develop the N1 rocket necessary for a human landing, and discontinued the lunar programs in 1974. On losing the Moon race, they concentrated on the development of space stations, using the Soyuz as a ferry to take cosmonauts to and from the stations. They started with a series of Salyut sortie stations from 1971 to 1986.\n\nAfter the Apollo program, the US launched the Skylab sortie space station in 1973, manning it for 171 days with three crews aboard Apollo spacecraft. President Richard Nixon and Soviet Premier Leonid Brezhnev negotiated an easing of relations known as détente, an easing of Cold War tensions. As part of this, they negotiated the Apollo-Soyuz Test Project, in which an Apollo spacecraft carrying a special docking adapter module rendezvoused and docked with Soyuz 19 in 1975. The American and Russian crews shook hands in space, but the purpose of the flight was purely diplomatic and symbolic.\n\nNixon appointed his Vice President Spiro Agnew to head a Space Task Group in 1969 to recommend follow-on human spaceflight programs after Apollo. The group proposed an ambitious Space Transportation System based on a reusable Space Shuttle which consisted of a winged, internally fueled orbiter stage burning liquid hydrogen, launched by a similar, but larger kerosene-fueled booster stage, each equipped with airbreathing jet engines for powered return to a runway at the Kennedy Space Center launch site. Other components of the system included a permanent modular space station, reusable space tug and nuclear interplanetary ferry, leading to a human expedition to Mars as early as 1986, or as late as 2000, depending on the level of funding allocated. However, Nixon knew the American political climate would not support Congressional funding for such an ambition, and killed proposals for all but the Shuttle, possibly to be followed by the space station. Plans for the Shuttle were scaled back to reduce development risk, cost, and time, replacing the piloted flyback booster with two reusable solid rocket boosters, and the smaller orbiter would use an expendable external propellant tank to feed its hydrogen-fueled main engines. The orbiter would have to make unpowered landings.\n\nThe two nations continued to compete rather than cooperate in space, as the US turned to developing the Space Shuttle and planning the space station, dubbed Freedom. \nThe USSR launched three Almaz military sortie stations from 1973 to 1977, disguised as Salyuts. They followed Salyut with the development of Mir, the first modular, semi-permanent space station, the construction of which took place from 1986 to 1996. Mir orbited at an altitude of 354 km, at a 51.6° inclination. It was occupied for 4,592 days, and made a controlled reentry in 2001.\n\nThe Space Shuttle started flying in 1981, but the US Congress failed to approve sufficient funds to make Freedom a reality. A fleet of four shuttles was built: Columbia, Challenger, Discovery, and Atlantis. A fifth shuttle, Endeavour, was built to replace Challenger, which was destroyed in an accident during launch that killed 7 astronauts on 28 January 1986. Twenty-two Shuttle flights carried a European Space Agency sortie space station called Spacelab in the payload bay from 1983 to 1998.\n\nThe USSR copied the reusable Space Shuttle orbiter, which it called Buran. It was designed to be launched into orbit by the expendable Energia rocket, and capable of robotic orbital flight and landing. Unlike the US Shuttle, Buran had no main rocket engines, but like the Shuttle used its orbital maneuvering engines to perform its final orbital insertion. A single unmanned orbital test flight was successfully made in November 1988. A second test flight was planned by 1993, but the program was cancelled due to lack of funding and the dissolution of the Soviet Union in 1991. Two more orbiters were never completed, and the first one was destroyed in a hangar roof collapse in May 2002.\n\nUS / Russian cooperation \n\nThe dissolution of the Soviet Union in 1991 brought an end to the Cold War and opened the door to true cooperation between the US and Russia. The Soviet Soyuz and Mir programs were taken over by the Russian Federal Space Agency, now known as the Roscosmos State Corporation. The Shuttle-Mir Program included American Space Shuttles visiting the Mir space station, Russian cosmonauts flying on the Shuttle, and an American astronaut flying aboard a Soyuz spacecraft for long-duration expeditions aboard Mir.\n\nIn 1993, President Bill Clinton secured Russia's cooperation in converting the planned Space Station Freedom into the International Space Station (ISS). Construction of the station began in 1998. The station orbits at an altitude of 409 km and an inclination of 51.65°.\n\nThe Space Shuttle was retired in 2011 after 135 orbital flights, several of which helped assemble, supply, and crew the ISS. Columbia was destroyed in another accident during reentry, which killed 7 astronauts on 1 February 2003.\n\nChina \n\nAfter Russia's launch of Sputnik 1 in 1957, Chairman Mao Zedong intended to place a Chinese satellite in orbit by 1959 to celebrate the 10th anniversary of the founding of the People's Republic of China (PRC), However, China did not successfully launch its first satellite until 24 April 1970. Mao and Premier Zhou Enlai decided on 14 July 1967, that the PRC should not be left behind, and started China's own human spaceflight program. The first attempt, the Shuguang spacecraft copied from the US Gemini, was cancelled on 13 May 1972.\n \nChina later designed the Shenzhou spacecraft resembling the Russian Soyuz, and became the third nation to achieve independent human spaceflight capability by launching Yang Liwei on a 21-hour flight aboard Shenzhou 5 on 15 October 2003. China launched the Tiangong-1 space station on 29 September 2011, and two sortie missions to it: Shenzhou 9 16–29 June 2012, with China's first female astronaut Liu Yang; and Shenzhou 10, 13–26 June 2013. The station was retired on 21 March 2016 and remains in a 363 km, 42.77° inclination orbit.\n\nAbandoned programs of other nations \n\nThe European Space Agency began development in 1987 of the Hermes spaceplane, to be launched on the Ariane 5 expendable launch vehicle. The project was cancelled in 1992, when it became clear that neither cost nor performance goals could be achieved. No Hermes shuttles were ever built.\n\nJapan began development in the 1980s of the HOPE-X experimental spaceplane, to be launched on its H-IIA expendable launch vehicle. A string of failures in 1998 led to funding reduction, and the project's cancellation in 2003.\n\nUnited States post-Space Shuttle gap \n\nUnder the Bush administration, the Constellation Program included plans for retiring the Shuttle program and replacing it with the capability for spaceflight beyond low Earth orbit. In the 2011 United States federal budget, the Obama administration cancelled Constellation for being over budget and behind schedule while not innovating and investing in critical new technologies.[http://blogs.orlandosentinel.com/news_space_thewritestuff/2008/11/congressional-w.html Congressional watchdog finds NASA’s new rocket is in trouble] . Orlando Sentinel blog summary of official reports. 3 November 2008 For beyond low earth orbit human spaceflight NASA is developing the Orion spacecraft to be launched by the Space Launch System. Under the Commercial Crew Development plan, NASA will rely on transportation services provided by the private sector to reach low earth orbit, such as SpaceX's Falcon 9/Dragon V2, Sierra Nevada Corporation's Dream Chaser, or Boeing's CST-100. The period between the retirement of the shuttle in 2011 and the initial operational capability of new systems in 2017, similar to the gap between the end of Apollo in 1975 and the first space shuttle flight in 1981, is referred to by a presidential Blue Ribbon Committee as the U.S. human spaceflight gap.Klamper, Amy (8 September 2009) [http://www.space.com/7255-white-house-panel-spells-human-spaceflight-options-nasa.html White House Panel Spells Out Human Spaceflight Options for NASA]. Space News\n\nCommercial private spaceflight \n\nSince the early 2000s, a variety of private spaceflight ventures have been undertaken. Several of the companies, including Blue Origin, SpaceX, Virgin Galactic, and Sierra Nevada have explicit plans to advance human spaceflight.  , all four of those companies have development programs underway to fly commercial passengers.\n\nA commercial suborbital spacecraft aimed at the space tourism market is being developed by Virgin Galactic called SpaceshipTwo, and could reach space around 2018.David, Leonard. (11 January 2014) [http://www.space.com/24249-commercial-space-travel-blasts-off-2014.html Will Commercial Space Travel Blast Off in 2014?]. Space.com. Retrieved on 2016-11-22.\nBlue Origin has begun a multi-year test program of their New Shepard vehicle and carried out six successful uncrewed test flights in 2015–2016. Blue Origin plan to fly \"test passengers\" in Q2 2017, and initiate commercial flights in 2018.\n\nSpaceX and Boeing are both developing passenger-capable orbital space capsules as of 2015, planning to fly NASA astronauts to the International Space Station by 2018.  SpaceX will be carrying passengers on Dragon 2 launched on a Falcon 9 launch vehicle.  Boeing will be doing it with their CST-100 launched on a United Launch Alliance Atlas V launch vehicle.\nDevelopment funding for these orbital-capable technologies has been provided by a mix of government and private funds, with SpaceX providing a greater portion of total development funding for this human-carrying capability from private investment.\nThere have been no public announcements of commercial offerings for orbital flights from either company, although both companies are planning some flights with their own private, not NASA, astronauts on board.\n\nCommercial crew provision is available through the Association of Spaceflight Professionals, which provides astronaut training, research and development, domain-specific research expertise, payload testing and integration, mission planning and operations support. Notable commercial astronauts Christopher Altman and Soyeon Yi are members of the corps. Altman conducted prior training at NASA and Yi is a former astronaut with the Korea Aerospace Research Institute who conducted an orbital mission to the International Space Station.\n\nMilestones \n\nYuri Gagarin became the first human to orbit the earth on April 12, 1961.\n\nJohn Glenn became the first American to orbit the earth on February 20, 1962.\n\nJoseph A. Walker became the first human to pilot a spaceplane, the X-15 Flight 90, into space on July 19, 1963.\n\nFrank Borman, Jim Lovell, and William Anders became the first humans to travel beyond low earth orbit (LEO)  Dec 21–27, 1968, when the Apollo 8 mission took them to 10 orbits around the Moon and back.\n\nNeil Armstrong and Buzz Aldrin became the first humans to land on the Moon on July 20, 1969.\n\nSvetlana Savitskaya became the first woman to walk in space on 25 July 1984.\n\nSally Ride became the first American woman in space in 1983. Eileen Collins was the first female shuttle pilot, and with shuttle mission STS-93 in 1999 she became the first woman to command a U.S. spacecraft.\n\nThe longest single human spaceflight is that of Valeri Polyakov, who left Earth on 8 January 1994, and did not return until 22 March 1995 (a total of 437 days 17 h 58 min 16 s). Sergei Krikalyov has spent the most time of anyone in space, 803 days, 9 hours, and 39 minutes altogether. The longest period of continuous human presence in space is  on the International Space Station, exceeding the previous record of almost 10 years (or 3,634 days) held by Mir, spanning the launch of Soyuz TM-8 on 5 September 1989 to the landing of Soyuz TM-29 on 28 August 1999.\n\nYang Liwei became the first human to orbit the earth as part of the Chinese manned space program on October 15, 2003.\n\nFor many years, only the USSR (later Russia) and the United States had their own astronauts. Citizens of other nations flew in space, beginning with the flight of Vladimir Remek, a Czech, on a Soviet spacecraft on 2 March 1978, in the Interkosmos programme. , citizens from 38 nations (including space tourists) have flown in space aboard Soviet, American, Russian, and Chinese spacecraft.\n\nSpace programs \n\nHuman spaceflight programs have been conducted by the former Soviet Union and current Russian Federation, the United States, the People's Republic of China and by private spaceflight company Scaled Composites.\n\nCurrent programs\n\nSpace vehicles are spacecraft used for transportation between the Earth's surface and outer space, or between locations in outer space. The following space vehicles and spaceports are currently used for launching human spaceflights:\n* Soyuz program (USSR/Russia): spacecraft on Soyuz launch vehicle, from Baikonur Cosmodrome; 129 orbital flights since 1967, including one in-flight abort which failed to reach orbit,  \n* Shenzhou program (Chinese): spacecraft on Long March launch vehicle, from Jiuquan Satellite Launch Center; 5 flights since 2003, \n\nThe following space stations are currently maintained in Earth orbit for human occupation:\n* International Space Station (US and Russia) assembled in orbit: altitude 409 km, 51.65° inclination; crews transported by Soyuz spacecraft\n* Tiangong-2 (Chinese): altitude 392 km; crews transported by Shenzhou spacecraft\n\nNumerous private companies attempted human spaceflight programs in an effort to win the $10 million Ansari X Prize. The first private human spaceflight took place on 21 June 2004, when SpaceShipOne conducted a suborbital flight. SpaceShipOne captured the prize on 4 October 2004, when it accomplished two consecutive flights within one week. SpaceShipTwo, launching from the carrier aircraft White Knight Two, is planned to conduct regular suborbital space tourism.\n\nMost of the time, the only humans in space are those aboard the ISS, whose crew of six spends up to six months at a time in low Earth orbit.\n\nNASA and ESA use the term \"human spaceflight\" to refer to their programs of launching people into space. These endeavors have also been referred to as \"manned space missions,\" though because of gender specificity this is no longer official parlance according to NASA style guides.\n\nPlanned future programs\n\nNASA is developing a plan to land humans on Mars by the 2030s. The first step in this mission begins sometime during 2020, when NASA plans to send an uncrewed craft into deep space to retrieve an asteroid. The asteroid will be pushed into the moon’s orbit, and studied by astronauts aboard Orion, NASA’s first human spacecraft in a generation. Orion’s crew will return to Earth with samples of the asteroid and their collected data. In addition to broadening America’s space capabilities, this mission will test newly developed technology, such as solar electric propulsion, which uses solar arrays for energy and requires ten times less propellant than the conventional chemical counterpart used for powering space shuttles to orbit.\n\nSeveral other countries and space agencies have announced and begun human spaceflight programs by their own technology, Japan (JAXA), Iran (ISA) and Malaysia (MNSA).\n\nThe Indian Space Research Organisation (ISRO) has begun work on pre-project activities of a human space flight mission program.The Indian Space Research Organisation (ISRO)[http://www.isro.org/scripts/futureprogramme.aspx Future Programme]. The objective is to carry a crew of two to Low Earth Orbit (LEO) and return them safely to a predefined destination on Earth. The program is proposed to be implemented in defined phases. Currently, the pre-project activities are progressing with a focus on the development of critical technologies for subsystems such as the Crew Module (CM), Environmental Control and Life Support System (ECLSS), Crew Escape System, etc. The department has initiated pre-project activities to study technical and managerial issues related to crewed missions. The program envisages the development of a fully autonomous orbital vehicle carrying 2 or 3 crew members to about 300 km low earth orbit and their safe return.\n\nPassenger travel via spacecraft \n\nA number of spacecraft have been proposed over the decades that might facilitate spaceliner passenger travel.  Somewhat analogous to travel by airliner after the middle of the 20th century, these vehicles are proposed to transport a large number of passengers to destinations in space, or to destinations on Earth which travel through space. To date, none of these concepts have been built, although a few vehicles that carry fewer than 10 persons are currently in the flight testing phase of their development process.\n\nOne large spaceliner concept currently in early development is the SpaceX BFR which, in addition to replacing the Falcon 9 and Falcon Heavy launch vehicles in the legacy Earth-orbit market after 2020, has been proposed by SpaceX for long-distance commercial travel on Earth.  This is the transport people on point-to-point suborbital flights between two points on Earth in under one hour, also known as \"Earth-to-Earth,\" and carrying 100+ passengers.\n\n[https://www.youtube.com/watch?time_continue40&v\nzqE-ultsWt0 BFR Earth to Earth], SpaceX, 28 September 2017, accessed 23 December 2017.\n\nSmall spaceplane or small capsule suborbital spacecraft have been under development for the past decade or so and, , at least one of each type are under development.  Both Virgin Galactic and Blue Origin are in active development, with the SpaceShipTwo spaceplane and the New Shepard capsule, respectively.  Both would carry approximately a half-dozen passengers up to space for a brief time of zero gravity before returning to the same location from where the trip began.  XCOR Aerospace had been developing the Lynx single-passenger spaceplane since the 2000s(2012) [http://www.spacexc.com/en/bookings/ SXC - Buying your tickets into space!]  SXC web page, Retrieved 5 April 2013 but development was halted in 2017.[http://spacenews.com/xcor-aerospace-files-for-bankruptcy/ http://spacenews.com/xcor-aerospace-files-for-bankruptcy/]\n\nNational spacefaring attempts\n\nThis section lists all nations which have attempted human spaceflight programs. This should not to be confused with nations with citizens who have traveled into space including space tourists, flown or intended to fly by foreign country's or non-domestic private space systems – these are not counted as national spacefaring attempts in this list.\n\nSafety concerns \n\nThere are two main sources of hazard in space flight: those due to the environment of space which make it hostile to the human body, and the potential for mechanical malfunctions of the equipment required to accomplish space flight.\n\nEnvironmental hazards \n\nPlanners of human spaceflight missions face a number of safety concerns.\n\nLife support \n\nThe immediate needs for breathable air and drinkable water are addressed by the life support system of the spacecraft.\n\nMedical issues \n\n \nMedical consequences such as possible blindness and bone loss have been associated with human space flight.\n\nOn 31 December 2012, a NASA-supported study reported that spaceflight may harm the brain of astronauts and accelerate the onset of Alzheimer's disease.\n\nIn October 2015, the NASA Office of Inspector General issued a health hazards report related to space exploration, including a human mission to Mars.\n\nOn 2 November 2017, scientists reported that significant changes in the position and structure of the brain have been found in astronauts who have taken trips in space, based on MRI studies. Astronauts who took longer space trips were associated with greater brain changes.\n\nMicrogravity \n\nMedical data from astronauts in low earth orbits for long periods, dating back to the 1970s, show several adverse effects of a microgravity environment: loss of bone density, decreased muscle strength and endurance, postural instability, and reductions in aerobic capacity. Over time these deconditioning effects can impair astronauts’ performance or increase their risk of injury.\n\nIn a weightless environment, astronauts put almost no weight on the back muscles or leg muscles used for standing up, which causes them to weaken and get smaller. Astronauts can lose up to twenty per cent of their muscle mass on spaceflights lasting five to eleven days. The consequent loss of strength could be a serious problem in case of a landing emergency. Upon return to Earth from long-duration flights, astronauts are considerably weakened, and are not allowed to drive a car for twenty-one days.\n\nAstronauts experiencing weightlessness will often lose their orientation, get motion sickness, and lose their sense of direction as their bodies try to get used to a weightless environment. When they get back to Earth, or any other mass with gravity, they have to readjust to the gravity and may have problems standing up, focusing their gaze, walking and turning. Importantly, those body motor disturbances after changing from different gravities only get worse the longer the exposure to little gravity. These changes will affect operational activities including approach and landing, docking, remote manipulation, and emergencies that may happen while landing. This can be a major roadblock to mission success.\n\nIn addition, after long space flight missions, male astronauts may experience severe eyesight problems.[http://www.cnn.com/video/#/video/us/2012/02/09/pkg-zarrella-astronaut-vision.cnnCNN News (CNN-TV, 02/09/2012) – Video (02:14) – Male Astronauts Return With Eye Problems]. Cnn.com (9 February 2012). Retrieved on 2016-11-22. Such eyesight problems may be a major concern for future deep space flight missions, including a crewed mission to the planet Mars.\n\nRadiation \n\nWithout proper shielding, the crews of missions beyond low Earth orbit (LEO) might be at risk from high-energy protons emitted by solar flares. Lawrence Townsend of the University of Tennessee and others have studied the most powerful solar flare ever recorded. That flare was seen by the British astronomer Richard Carrington in September 1859. Radiation doses astronauts would receive from a Carrington-type flare could cause acute radiation sickness and possibly even death.\n\nAnother type of radiation, galactic cosmic rays, presents further challenges to human spaceflight beyond low Earth orbit.\n\nThere is also some scientific concern that extended spaceflight might slow down the body’s ability to protect itself against diseases. Some of the problems are a weakened immune system and the activation of dormant viruses in the body. Radiation can cause both short and long term consequences to the bone marrow stem cells which create the blood and immune systems. Because the interior of a spacecraft is so small, a weakened immune system and more active viruses in the body can lead to a fast spread of infection.\n\nIsolation \n\nDuring long missions, astronauts are isolated and confined into small spaces. Depression, cabin fever and other psychological problems may impact the crew's safety and mission success.\n\nAstronauts may not be able to quickly return to Earth or receive medical supplies, equipment or personnel if a medical emergency occurs. The astronauts may have to rely for long periods on their limited existing resources and medical advice from the ground.\n\nMechanical hazards \n\nSpace flight requires much higher velocities than ground or air transportation, which in turn requires the use of high energy density propellants for launch, and the dissipation of large amounts of energy, usually as heat, for safe reentry through the Earth's atmosphere.\n\nLaunch \n\nSince rockets carry the potential for fire or explosive destruction, space capsules generally employ some sort of launch escape system, consisting either of a tower-mounted solid fuel rocket to quickly carry the capsule away from the launch vehicle (employed on Mercury, Apollo, and Soyuz), or else ejection seats (employed on Vostok and Gemini) to carry astronauts out of the capsule and away for individual parachute landing. The escape tower is discarded at some point before the launch is complete, at a point where an abort can be performed using the spacecraft's engines.\n\nSuch a system is not always practical for multiple crew member vehicles (particularly spaceplanes), depending on location of egress hatch(es). When the single-hatch Vostok capsule was modified to become the 2 or 3-person Voskhod, the single-cosmonaut ejection seat could not be used, and no escape tower system was added. The two Voskhod flights in 1964 and 1965 avoided launch mishaps. The Space Shuttle carried ejection seats and escape hatches for its pilot and copilot in early flights, but these could not be used for passengers who sat below the flight deck on later flights, and so were discontinued.\n\nThe only in-flight launch abort of a crewed flight occurred on Soyuz 18a on 5 April 1975. The abort occurred after the launch escape system had been jettisoned, when the launch vehicle's spent second stage failed to separate before the third stage ignited. The vehicle strayed off course, and the crew separated the spacecraft and fired its engines to pull it away from the errant rocket. Both cosmonauts landed safely.\n\nIn the only use of a launch escape system on a crewed flight, the planned Soyuz T-10a launch on 26 September 1983 was aborted by a launch vehicle fire 90 seconds before liftoff. Both cosmonauts aboard landed safely.\n\nThe only crew fatality during launch occurred on 28 January 1986, when the Space Shuttle Challenger broke apart 73 seconds after liftoff, due to failure of a solid rocket booster seal which caused separation of the booster and failure of the external fuel tank, resulting in explosion of the fuel. All seven crew members were killed.\n\nReentry and landing \n\nThe single pilot of Soyuz 1, Vladimir Komarov was killed when his capsule's parachutes failed during an emergency landing on 24 April 1967, causing the capsule to crash.\n\nThe crew of seven aboard the Space Shuttle Columbia were killed on reentry after completing a successful mission in space on 1 February 2003. A wing leading edge reinforced carbon-carbon heat shield had been damaged by a piece of frozen external tank foam insulation which broke off and struck the wing during launch. Hot reentry gasses entered and destroyed the wing structure, leading to breakup of the orbiter vehicle.\n\nArtificial atmosphere \n\nThere are two basic choices for an artificial atmosphere: either an Earth-like mixture of oxygen in an inert gas such as nitrogen or helium, or pure oxygen, which can be used at lower than standard atmospheric pressure. A nitrogen-oxygen mixture is used in the International Space Station and Soyuz spacecraft, while low-pressure pure oxygen is commonly used in space suits for extravehicular activity.\n\nUse of a gas mixture carries risk of decompression sickness (commonly known as \"the bends\") when transitioning to or from the pure oxygen space suit environment. There have also been instances of injury and fatalities caused by suffocation in the presence of too much nitrogen and not enough oxygen.\n* In 1960, McDonnell Aircraft test pilot G.B. North passed out and was seriously injured when testing a Mercury cabin / spacesuit atmosphere system in a vacuum chamber, due to nitrogen-rich air leaking from the cabin into his space suit feed.\n This incident led NASA to decide on a pure oxygen atmosphere for the Mercury, Gemini, and Apollo spacecraft.\n* In 1981, three pad workers were killed by a nitrogen-rich atmosphere in the aft engine compartment of the Space Shuttle Columbia at the Kennedy Space Center Launch Complex 39.[https://web.archive.org/web/20010605212352/http://www-lib.ksc.nasa.gov/lib/chrono.html 1981 KSC Chronology Part 1 – pages 84, 85, 100; Part 2 – pages 181, 194, 195], NASA\n* In 1995, two pad workers were similarly killed by a nitrogen leak in a confined area of the Ariane 5 launch pad at Guiana Space Centre.[http://www.esa.int/esaCP/Pr_17_1995_p_EN.html \"Fatal accident at the Guiana Space Centre\"], ESA Portal, 5 May 1993\n\nA pure oxygen atmosphere carries risk of fire. The original design of the Apollo spacecraft used pure oxygen at greater than atmospheric pressure prior to launch. An electrical fire started in the cabin of Apollo 1 during a ground test at Cape Kennedy Air Force Station Launch Complex 34 on 27 January 1967, and spread rapidly. The high pressure (increased even higher by the fire) prevented removal of the plug door hatch cover in time to rescue the crew. All three, Gus Grissom, Ed White, and Roger Chaffee, were killed. This led NASA to use a nitrogen/oxygen atmosphere before launch, and low pressure pure oxygen only in space.\n\nReliability \n\nThe March 1966 Gemini 8 mission was aborted in orbit when an attitude control system thruster stuck in the on position, sending the craft into a dangerous spin which threatened the lives of Neil Armstrong and David Scott. Armstrong had to shut the control system off and use the reentry control system to stop the spin. The craft made an emergency reentry and the astronauts landed safely. The most probable cause was determined to be an electrical short due to a static electricity discharge, which caused the thruster to remain powered even when switched off. The control system was modified to put each thruster on its own isolated circuit.\n\nThe third lunar landing expedition Apollo 13 in April 1970, was aborted and the lives of the crew, James Lovell, Jack Swigert and Fred Haise, were threatened by failure of a cryogenic liquid oxygen tank en route to the Moon. The tank burst when electrical power was applied to internal stirring fans in the tank, causing the immediate loss of all of its contents, and also damaging the second tank, causing the loss of its remaining oxygen in a span of 130 minutes. This in turn caused loss of electrical power provided by fuel cells to the command spacecraft. The crew managed to return to Earth safely by using the lunar landing craft as a \"life boat\". The tank failure was determined to be caused by two mistakes. The tank's drain fitting had been damaged when it was dropped during factory testing. This necessitated use of its internal heaters to boil out the oxygen after a pre-launch test, which in turn damaged the fan wiring's electrical insulation, because the thermostats on the heaters did not meet the required voltage rating due to a vendor miscommunication.\n\nFatality risk \n\n, 22 crew members have died in accidents aboard spacecraft. Over 100 others have died in accidents during activity directly related to spaceflight or testing.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Human spaceflight" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=18896" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Human spaceflight (also referred to as crewed spaceflight or manned spaceflight) is space travel with a crew or passengers aboard the spacecraft. Spacecraft carrying people may be operated directly, by human crew, or it may be either remotely operated from ground stations on Earth or be autonomous, able to carry out a specific mission with no human involvement.\n\nThe first human spaceflight was launched by the Soviet Union on 12 April 1961 as a part of the Vostok program, with cosmonaut Yuri Gagarin aboard. Humans have been continuously present in space for  on the International Space Station.  All early human spaceflight was crewed, where at least some of the passengers acted to carry out tasks of piloting or operating the spacecraft.  After 2015, several human-capable spacecraft are being explicitly designed with the ability to operate autonomously.\n\nSince the retirement of the US Space Shuttle in 2011, only Russia and China have maintained human spaceflight capability with the Soyuz program and Shenzhou program. Currently, all expeditions to the International Space Station use Soyuz vehicles, which remain attached to the station to allow quick return if needed. The United States is developing commercial crew transportation to facilitate domestic access to ISS and low Earth orbit, as well as the Orion vehicle for beyond-low Earth orbit applications.\n\nWhile spaceflight has typically been a government-directed activity, commercial spaceflight has gradually been taking on a greater role. The first private human spaceflight took place on 21 June 2004, when SpaceShipOne conducted a suborbital flight, and a number of non-governmental companies have been working to develop a space tourism industry. NASA has also played a role to stimulate private spaceflight through programs such as Commercial Orbital Transportation Services (COTS) and Commercial Crew Development (CCDev). With its 2011 budget proposals released in 2010, the Obama administration moved towards a model where commercial companies would supply NASA with transportation services of both people and cargo transport to low Earth orbit. The vehicles used for these services could then serve both NASA and potential commercial customers. Commercial resupply of ISS began two years after the retirement of the Shuttle, and commercial crew launches could begin by 2018.\n\nHistory \n\nCold War era \n\n \n\nHuman spaceflight capability was first developed during the Cold War between the United States and the Soviet Union (USSR), which developed the first intercontinental ballistic missile rockets to deliver nuclear weapons. These rockets were large enough to be adapted to carry the first artificial satellites into low Earth orbit. After the first satellites were launched in 1957 and 1958, the US worked on Project Mercury to launch men singly into orbit, while the USSR secretly pursued the Vostok program to accomplish the same thing. The USSR launched the first human in space, Yuri Gagarin, into a single orbit in Vostok 1 on a Vostok 3KA rocket, on 12 April 1961. The US launched its first astronaut, Alan Shepard, on a suborbital flight aboard Freedom 7 on a Mercury-Redstone rocket, on 5 May 1961. Unlike Gagarin, Shepard manually controlled his spacecraft's attitude, and landed inside it. The first American in orbit was John Glenn aboard Friendship 7, launched 20 February 1962 on a Mercury-Atlas rocket. The USSR launched five more cosmonauts in Vostok capsules, including the first woman in space, Valentina Tereshkova aboard Vostok 6 on 16 June 1963. The US launched a total of two astronauts in suborbital flight and four into orbit through 1963.\n\nUS President John F. Kennedy raised the stakes of the Space Race by setting the goal of landing a man on the Moon and returning him safely by the end of the 1960s. The US started the three-man Apollo program in 1961 to accomplish this, launched by the Saturn family of launch vehicles, and the interim two-man Project Gemini in 1962, which flew 10 missions launched by Titan II rockets in 1965 and 1966. Gemini's objective was to support Apollo by developing American orbital spaceflight experience and techniques to be used in the Moon mission.\n\nMeanwhile, the USSR remained silent about their intentions to send humans to the Moon, and proceeded to stretch the limits of their single-pilot Vostok capsule into a two- or three-person Voskhod capsule to compete with Gemini. They were able to launch two orbital flights in 1964 and 1965 and achieved the first spacewalk, made by Alexei Leonov on Voskhod 2 on 8 March 1965. But Voskhod did not have Gemini's capability to maneuver in orbit, and the program was terminated. The US Gemini flights did not accomplish the first spacewalk, but overcame the early Soviet lead by performing several spacewalks and solving the problem of astronaut fatigue caused by overcoming the lack of gravity, demonstrating up to two weeks endurance in a human spaceflight, and the first space rendezvous and dockings of spacecraft.\n\nThe US succeeded in developing the Saturn V rocket necessary to send the Apollo spacecraft to the Moon, and sent Frank Borman, James Lovell, and William Anders into 10 orbits around the Moon in Apollo 8 in December 1968. In July 1969, Apollo 11 accomplished Kennedy's goal by landing Neil Armstrong and Buzz Aldrin on the Moon 21 July and returning them safely on 24 July along with Command Module pilot Michael Collins. A total of six Apollo missions landed 12 men to walk on the Moon through 1972, half of which drove electric powered vehicles on the surface. The crew of Apollo 13, Lovell, Jack Swigert, and Fred Haise, survived a catastrophic in-flight spacecraft failure and returned to Earth safely without landing on the Moon.\n\nMeanwhile, the USSR secretly pursued human lunar orbiting and landing programs. They successfully developed the three-person Soyuz spacecraft for use in the lunar programs, but failed to develop the N1 rocket necessary for a human landing, and discontinued the lunar programs in 1974. On losing the Moon race, they concentrated on the development of space stations, using the Soyuz as a ferry to take cosmonauts to and from the stations. They started with a series of Salyut sortie stations from 1971 to 1986.\n\nAfter the Apollo program, the US launched the Skylab sortie space station in 1973, manning it for 171 days with three crews aboard Apollo spacecraft. President Richard Nixon and Soviet Premier Leonid Brezhnev negotiated an easing of relations known as détente, an easing of Cold War tensions. As part of this, they negotiated the Apollo-Soyuz Test Project, in which an Apollo spacecraft carrying a special docking adapter module rendezvoused and docked with Soyuz 19 in 1975. The American and Russian crews shook hands in space, but the purpose of the flight was purely diplomatic and symbolic.\n\nNixon appointed his Vice President Spiro Agnew to head a Space Task Group in 1969 to recommend follow-on human spaceflight programs after Apollo. The group proposed an ambitious Space Transportation System based on a reusable Space Shuttle which consisted of a winged, internally fueled orbiter stage burning liquid hydrogen, launched by a similar, but larger kerosene-fueled booster stage, each equipped with airbreathing jet engines for powered return to a runway at the Kennedy Space Center launch site. Other components of the system included a permanent modular space station, reusable space tug and nuclear interplanetary ferry, leading to a human expedition to Mars as early as 1986, or as late as 2000, depending on the level of funding allocated. However, Nixon knew the American political climate would not support Congressional funding for such an ambition, and killed proposals for all but the Shuttle, possibly to be followed by the space station. Plans for the Shuttle were scaled back to reduce development risk, cost, and time, replacing the piloted flyback booster with two reusable solid rocket boosters, and the smaller orbiter would use an expendable external propellant tank to feed its hydrogen-fueled main engines. The orbiter would have to make unpowered landings.\n\nThe two nations continued to compete rather than cooperate in space, as the US turned to developing the Space Shuttle and planning the space station, dubbed Freedom. \nThe USSR launched three Almaz military sortie stations from 1973 to 1977, disguised as Salyuts. They followed Salyut with the development of Mir, the first modular, semi-permanent space station, the construction of which took place from 1986 to 1996. Mir orbited at an altitude of 354 km, at a 51.6° inclination. It was occupied for 4,592 days, and made a controlled reentry in 2001.\n\nThe Space Shuttle started flying in 1981, but the US Congress failed to approve sufficient funds to make Freedom a reality. A fleet of four shuttles was built: Columbia, Challenger, Discovery, and Atlantis. A fifth shuttle, Endeavour, was built to replace Challenger, which was destroyed in an accident during launch that killed 7 astronauts on 28 January 1986. Twenty-two Shuttle flights carried a European Space Agency sortie space station called Spacelab in the payload bay from 1983 to 1998.\n\nThe USSR copied the reusable Space Shuttle orbiter, which it called Buran. It was designed to be launched into orbit by the expendable Energia rocket, and capable of robotic orbital flight and landing. Unlike the US Shuttle, Buran had no main rocket engines, but like the Shuttle used its orbital maneuvering engines to perform its final orbital insertion. A single unmanned orbital test flight was successfully made in November 1988. A second test flight was planned by 1993, but the program was cancelled due to lack of funding and the dissolution of the Soviet Union in 1991. Two more orbiters were never completed, and the first one was destroyed in a hangar roof collapse in May 2002.\n\nUS / Russian cooperation \n\nThe dissolution of the Soviet Union in 1991 brought an end to the Cold War and opened the door to true cooperation between the US and Russia. The Soviet Soyuz and Mir programs were taken over by the Russian Federal Space Agency, now known as the Roscosmos State Corporation. The Shuttle-Mir Program included American Space Shuttles visiting the Mir space station, Russian cosmonauts flying on the Shuttle, and an American astronaut flying aboard a Soyuz spacecraft for long-duration expeditions aboard Mir.\n\nIn 1993, President Bill Clinton secured Russia's cooperation in converting the planned Space Station Freedom into the International Space Station (ISS). Construction of the station began in 1998. The station orbits at an altitude of 409 km and an inclination of 51.65°.\n\nThe Space Shuttle was retired in 2011 after 135 orbital flights, several of which helped assemble, supply, and crew the ISS. Columbia was destroyed in another accident during reentry, which killed 7 astronauts on 1 February 2003.\n\nChina \n\nAfter Russia's launch of Sputnik 1 in 1957, Chairman Mao Zedong intended to place a Chinese satellite in orbit by 1959 to celebrate the 10th anniversary of the founding of the People's Republic of China (PRC), However, China did not successfully launch its first satellite until 24 April 1970. Mao and Premier Zhou Enlai decided on 14 July 1967, that the PRC should not be left behind, and started China's own human spaceflight program. The first attempt, the Shuguang spacecraft copied from the US Gemini, was cancelled on 13 May 1972.\n \nChina later designed the Shenzhou spacecraft resembling the Russian Soyuz, and became the third nation to achieve independent human spaceflight capability by launching Yang Liwei on a 21-hour flight aboard Shenzhou 5 on 15 October 2003. China launched the Tiangong-1 space station on 29 September 2011, and two sortie missions to it: Shenzhou 9 16–29 June 2012, with China's first female astronaut Liu Yang; and Shenzhou 10, 13–26 June 2013. The station was retired on 21 March 2016 and remains in a 363 km, 42.77° inclination orbit.\n\nAbandoned programs of other nations \n\nThe European Space Agency began development in 1987 of the Hermes spaceplane, to be launched on the Ariane 5 expendable launch vehicle. The project was cancelled in 1992, when it became clear that neither cost nor performance goals could be achieved. No Hermes shuttles were ever built.\n\nJapan began development in the 1980s of the HOPE-X experimental spaceplane, to be launched on its H-IIA expendable launch vehicle. A string of failures in 1998 led to funding reduction, and the project's cancellation in 2003.\n\nUnited States post-Space Shuttle gap \n\nUnder the Bush administration, the Constellation Program included plans for retiring the Shuttle program and replacing it with the capability for spaceflight beyond low Earth orbit. In the 2011 United States federal budget, the Obama administration cancelled Constellation for being over budget and behind schedule while not innovating and investing in critical new technologies.[http://blogs.orlandosentinel.com/news_space_thewritestuff/2008/11/congressional-w.html Congressional watchdog finds NASA’s new rocket is in trouble] . Orlando Sentinel blog summary of official reports. 3 November 2008 For beyond low earth orbit human spaceflight NASA is developing the Orion spacecraft to be launched by the Space Launch System. Under the Commercial Crew Development plan, NASA will rely on transportation services provided by the private sector to reach low earth orbit, such as SpaceX's Falcon 9/Dragon V2, Sierra Nevada Corporation's Dream Chaser, or Boeing's CST-100. The period between the retirement of the shuttle in 2011 and the initial operational capability of new systems in 2017, similar to the gap between the end of Apollo in 1975 and the first space shuttle flight in 1981, is referred to by a presidential Blue Ribbon Committee as the U.S. human spaceflight gap.Klamper, Amy (8 September 2009) [http://www.space.com/7255-white-house-panel-spells-human-spaceflight-options-nasa.html White House Panel Spells Out Human Spaceflight Options for NASA]. Space News\n\nCommercial private spaceflight \n\nSince the early 2000s, a variety of private spaceflight ventures have been undertaken. Several of the companies, including Blue Origin, SpaceX, Virgin Galactic, and Sierra Nevada have explicit plans to advance human spaceflight.  , all four of those companies have development programs underway to fly commercial passengers.\n\nA commercial suborbital spacecraft aimed at the space tourism market is being developed by Virgin Galactic called SpaceshipTwo, and could reach space around 2018.David, Leonard. (11 January 2014) [http://www.space.com/24249-commercial-space-travel-blasts-off-2014.html Will Commercial Space Travel Blast Off in 2014?]. Space.com. Retrieved on 2016-11-22.\nBlue Origin has begun a multi-year test program of their New Shepard vehicle and carried out six successful uncrewed test flights in 2015–2016. Blue Origin plan to fly \"test passengers\" in Q2 2017, and initiate commercial flights in 2018.\n\nSpaceX and Boeing are both developing passenger-capable orbital space capsules as of 2015, planning to fly NASA astronauts to the International Space Station by 2018.  SpaceX will be carrying passengers on Dragon 2 launched on a Falcon 9 launch vehicle.  Boeing will be doing it with their CST-100 launched on a United Launch Alliance Atlas V launch vehicle.\nDevelopment funding for these orbital-capable technologies has been provided by a mix of government and private funds, with SpaceX providing a greater portion of total development funding for this human-carrying capability from private investment.\nThere have been no public announcements of commercial offerings for orbital flights from either company, although both companies are planning some flights with their own private, not NASA, astronauts on board.\n\nCommercial crew provision is available through the Association of Spaceflight Professionals, which provides astronaut training, research and development, domain-specific research expertise, payload testing and integration, mission planning and operations support. Notable commercial astronauts Christopher Altman and Soyeon Yi are members of the corps. Altman conducted prior training at NASA and Yi is a former astronaut with the Korea Aerospace Research Institute who conducted an orbital mission to the International Space Station.\n\nMilestones \n\nYuri Gagarin became the first human to orbit the earth on April 12, 1961.\n\nJohn Glenn became the first American to orbit the earth on February 20, 1962.\n\nJoseph A. Walker became the first human to pilot a spaceplane, the X-15 Flight 90, into space on July 19, 1963.\n\nFrank Borman, Jim Lovell, and William Anders became the first humans to travel beyond low earth orbit (LEO)  Dec 21–27, 1968, when the Apollo 8 mission took them to 10 orbits around the Moon and back.\n\nNeil Armstrong and Buzz Aldrin became the first humans to land on the Moon on July 20, 1969.\n\nSvetlana Savitskaya became the first woman to walk in space on 25 July 1984.\n\nSally Ride became the first American woman in space in 1983. Eileen Collins was the first female shuttle pilot, and with shuttle mission STS-93 in 1999 she became the first woman to command a U.S. spacecraft.\n\nThe longest single human spaceflight is that of Valeri Polyakov, who left Earth on 8 January 1994, and did not return until 22 March 1995 (a total of 437 days 17 h 58 min 16 s). Sergei Krikalyov has spent the most time of anyone in space, 803 days, 9 hours, and 39 minutes altogether. The longest period of continuous human presence in space is  on the International Space Station, exceeding the previous record of almost 10 years (or 3,634 days) held by Mir, spanning the launch of Soyuz TM-8 on 5 September 1989 to the landing of Soyuz TM-29 on 28 August 1999.\n\nYang Liwei became the first human to orbit the earth as part of the Chinese manned space program on October 15, 2003.\n\nFor many years, only the USSR (later Russia) and the United States had their own astronauts. Citizens of other nations flew in space, beginning with the flight of Vladimir Remek, a Czech, on a Soviet spacecraft on 2 March 1978, in the Interkosmos programme. , citizens from 38 nations (including space tourists) have flown in space aboard Soviet, American, Russian, and Chinese spacecraft.\n\nSpace programs \n\nHuman spaceflight programs have been conducted by the former Soviet Union and current Russian Federation, the United States, the People's Republic of China and by private spaceflight company Scaled Composites.\n\nCurrent programs\n\nSpace vehicles are spacecraft used for transportation between the Earth's surface and outer space, or between locations in outer space. The following space vehicles and spaceports are currently used for launching human spaceflights:\n* Soyuz program (USSR/Russia): spacecraft on Soyuz launch vehicle, from Baikonur Cosmodrome; 129 orbital flights since 1967, including one in-flight abort which failed to reach orbit,  \n* Shenzhou program (Chinese): spacecraft on Long March launch vehicle, from Jiuquan Satellite Launch Center; 5 flights since 2003, \n\nThe following space stations are currently maintained in Earth orbit for human occupation:\n* International Space Station (US and Russia) assembled in orbit: altitude 409 km, 51.65° inclination; crews transported by Soyuz spacecraft\n* Tiangong-2 (Chinese): altitude 392 km; crews transported by Shenzhou spacecraft\n\nNumerous private companies attempted human spaceflight programs in an effort to win the $10 million Ansari X Prize. The first private human spaceflight took place on 21 June 2004, when SpaceShipOne conducted a suborbital flight. SpaceShipOne captured the prize on 4 October 2004, when it accomplished two consecutive flights within one week. SpaceShipTwo, launching from the carrier aircraft White Knight Two, is planned to conduct regular suborbital space tourism.\n\nMost of the time, the only humans in space are those aboard the ISS, whose crew of six spends up to six months at a time in low Earth orbit.\n\nNASA and ESA use the term \"human spaceflight\" to refer to their programs of launching people into space. These endeavors have also been referred to as \"manned space missions,\" though because of gender specificity this is no longer official parlance according to NASA style guides.\n\nPlanned future programs\n\nNASA is developing a plan to land humans on Mars by the 2030s. The first step in this mission begins sometime during 2020, when NASA plans to send an uncrewed craft into deep space to retrieve an asteroid. The asteroid will be pushed into the moon’s orbit, and studied by astronauts aboard Orion, NASA’s first human spacecraft in a generation. Orion’s crew will return to Earth with samples of the asteroid and their collected data. In addition to broadening America’s space capabilities, this mission will test newly developed technology, such as solar electric propulsion, which uses solar arrays for energy and requires ten times less propellant than the conventional chemical counterpart used for powering space shuttles to orbit.\n\nSeveral other countries and space agencies have announced and begun human spaceflight programs by their own technology, Japan (JAXA), Iran (ISA) and Malaysia (MNSA).\n\nThe Indian Space Research Organisation (ISRO) has begun work on pre-project activities of a human space flight mission program.The Indian Space Research Organisation (ISRO)[http://www.isro.org/scripts/futureprogramme.aspx Future Programme]. The objective is to carry a crew of two to Low Earth Orbit (LEO) and return them safely to a predefined destination on Earth. The program is proposed to be implemented in defined phases. Currently, the pre-project activities are progressing with a focus on the development of critical technologies for subsystems such as the Crew Module (CM), Environmental Control and Life Support System (ECLSS), Crew Escape System, etc. The department has initiated pre-project activities to study technical and managerial issues related to crewed missions. The program envisages the development of a fully autonomous orbital vehicle carrying 2 or 3 crew members to about 300 km low earth orbit and their safe return.\n\nPassenger travel via spacecraft \n\nA number of spacecraft have been proposed over the decades that might facilitate spaceliner passenger travel.  Somewhat analogous to travel by airliner after the middle of the 20th century, these vehicles are proposed to transport a large number of passengers to destinations in space, or to destinations on Earth which travel through space. To date, none of these concepts have been built, although a few vehicles that carry fewer than 10 persons are currently in the flight testing phase of their development process.\n\nOne large spaceliner concept currently in early development is the SpaceX BFR which, in addition to replacing the Falcon 9 and Falcon Heavy launch vehicles in the legacy Earth-orbit market after 2020, has been proposed by SpaceX for long-distance commercial travel on Earth.  This is the transport people on point-to-point suborbital flights between two points on Earth in under one hour, also known as \"Earth-to-Earth,\" and carrying 100+ passengers.\n\n[https://www.youtube.com/watch?time_continue40&v\nzqE-ultsWt0 BFR Earth to Earth], SpaceX, 28 September 2017, accessed 23 December 2017.\n\nSmall spaceplane or small capsule suborbital spacecraft have been under development for the past decade or so and, , at least one of each type are under development.  Both Virgin Galactic and Blue Origin are in active development, with the SpaceShipTwo spaceplane and the New Shepard capsule, respectively.  Both would carry approximately a half-dozen passengers up to space for a brief time of zero gravity before returning to the same location from where the trip began.  XCOR Aerospace had been developing the Lynx single-passenger spaceplane since the 2000s(2012) [http://www.spacexc.com/en/bookings/ SXC - Buying your tickets into space!]  SXC web page, Retrieved 5 April 2013 but development was halted in 2017.[http://spacenews.com/xcor-aerospace-files-for-bankruptcy/ http://spacenews.com/xcor-aerospace-files-for-bankruptcy/]\n\nNational spacefaring attempts\n\nThis section lists all nations which have attempted human spaceflight programs. This should not to be confused with nations with citizens who have traveled into space including space tourists, flown or intended to fly by foreign country's or non-domestic private space systems – these are not counted as national spacefaring attempts in this list.\n\nSafety concerns \n\nThere are two main sources of hazard in space flight: those due to the environment of space which make it hostile to the human body, and the potential for mechanical malfunctions of the equipment required to accomplish space flight.\n\nEnvironmental hazards \n\nPlanners of human spaceflight missions face a number of safety concerns.\n\nLife support \n\nThe immediate needs for breathable air and drinkable water are addressed by the life support system of the spacecraft.\n\nMedical issues \n\n \nMedical consequences such as possible blindness and bone loss have been associated with human space flight.\n\nOn 31 December 2012, a NASA-supported study reported that spaceflight may harm the brain of astronauts and accelerate the onset of Alzheimer's disease.\n\nIn October 2015, the NASA Office of Inspector General issued a health hazards report related to space exploration, including a human mission to Mars.\n\nOn 2 November 2017, scientists reported that significant changes in the position and structure of the brain have been found in astronauts who have taken trips in space, based on MRI studies. Astronauts who took longer space trips were associated with greater brain changes.\n\nMicrogravity \n\nMedical data from astronauts in low earth orbits for long periods, dating back to the 1970s, show several adverse effects of a microgravity environment: loss of bone density, decreased muscle strength and endurance, postural instability, and reductions in aerobic capacity. Over time these deconditioning effects can impair astronauts’ performance or increase their risk of injury.\n\nIn a weightless environment, astronauts put almost no weight on the back muscles or leg muscles used for standing up, which causes them to weaken and get smaller. Astronauts can lose up to twenty per cent of their muscle mass on spaceflights lasting five to eleven days. The consequent loss of strength could be a serious problem in case of a landing emergency. Upon return to Earth from long-duration flights, astronauts are considerably weakened, and are not allowed to drive a car for twenty-one days.\n\nAstronauts experiencing weightlessness will often lose their orientation, get motion sickness, and lose their sense of direction as their bodies try to get used to a weightless environment. When they get back to Earth, or any other mass with gravity, they have to readjust to the gravity and may have problems standing up, focusing their gaze, walking and turning. Importantly, those body motor disturbances after changing from different gravities only get worse the longer the exposure to little gravity. These changes will affect operational activities including approach and landing, docking, remote manipulation, and emergencies that may happen while landing. This can be a major roadblock to mission success.\n\nIn addition, after long space flight missions, male astronauts may experience severe eyesight problems.[http://www.cnn.com/video/#/video/us/2012/02/09/pkg-zarrella-astronaut-vision.cnnCNN News (CNN-TV, 02/09/2012) – Video (02:14) – Male Astronauts Return With Eye Problems]. Cnn.com (9 February 2012). Retrieved on 2016-11-22. Such eyesight problems may be a major concern for future deep space flight missions, including a crewed mission to the planet Mars.\n\nRadiation \n\nWithout proper shielding, the crews of missions beyond low Earth orbit (LEO) might be at risk from high-energy protons emitted by solar flares. Lawrence Townsend of the University of Tennessee and others have studied the most powerful solar flare ever recorded. That flare was seen by the British astronomer Richard Carrington in September 1859. Radiation doses astronauts would receive from a Carrington-type flare could cause acute radiation sickness and possibly even death.\n\nAnother type of radiation, galactic cosmic rays, presents further challenges to human spaceflight beyond low Earth orbit.\n\nThere is also some scientific concern that extended spaceflight might slow down the body’s ability to protect itself against diseases. Some of the problems are a weakened immune system and the activation of dormant viruses in the body. Radiation can cause both short and long term consequences to the bone marrow stem cells which create the blood and immune systems. Because the interior of a spacecraft is so small, a weakened immune system and more active viruses in the body can lead to a fast spread of infection.\n\nIsolation \n\nDuring long missions, astronauts are isolated and confined into small spaces. Depression, cabin fever and other psychological problems may impact the crew's safety and mission success.\n\nAstronauts may not be able to quickly return to Earth or receive medical supplies, equipment or personnel if a medical emergency occurs. The astronauts may have to rely for long periods on their limited existing resources and medical advice from the ground.\n\nMechanical hazards \n\nSpace flight requires much higher velocities than ground or air transportation, which in turn requires the use of high energy density propellants for launch, and the dissipation of large amounts of energy, usually as heat, for safe reentry through the Earth's atmosphere.\n\nLaunch \n\nSince rockets carry the potential for fire or explosive destruction, space capsules generally employ some sort of launch escape system, consisting either of a tower-mounted solid fuel rocket to quickly carry the capsule away from the launch vehicle (employed on Mercury, Apollo, and Soyuz), or else ejection seats (employed on Vostok and Gemini) to carry astronauts out of the capsule and away for individual parachute landing. The escape tower is discarded at some point before the launch is complete, at a point where an abort can be performed using the spacecraft's engines.\n\nSuch a system is not always practical for multiple crew member vehicles (particularly spaceplanes), depending on location of egress hatch(es). When the single-hatch Vostok capsule was modified to become the 2 or 3-person Voskhod, the single-cosmonaut ejection seat could not be used, and no escape tower system was added. The two Voskhod flights in 1964 and 1965 avoided launch mishaps. The Space Shuttle carried ejection seats and escape hatches for its pilot and copilot in early flights, but these could not be used for passengers who sat below the flight deck on later flights, and so were discontinued.\n\nThe only in-flight launch abort of a crewed flight occurred on Soyuz 18a on 5 April 1975. The abort occurred after the launch escape system had been jettisoned, when the launch vehicle's spent second stage failed to separate before the third stage ignited. The vehicle strayed off course, and the crew separated the spacecraft and fired its engines to pull it away from the errant rocket. Both cosmonauts landed safely.\n\nIn the only use of a launch escape system on a crewed flight, the planned Soyuz T-10a launch on 26 September 1983 was aborted by a launch vehicle fire 90 seconds before liftoff. Both cosmonauts aboard landed safely.\n\nThe only crew fatality during launch occurred on 28 January 1986, when the Space Shuttle Challenger broke apart 73 seconds after liftoff, due to failure of a solid rocket booster seal which caused separation of the booster and failure of the external fuel tank, resulting in explosion of the fuel. All seven crew members were killed.\n\nReentry and landing \n\nThe single pilot of Soyuz 1, Vladimir Komarov was killed when his capsule's parachutes failed during an emergency landing on 24 April 1967, causing the capsule to crash.\n\nThe crew of seven aboard the Space Shuttle Columbia were killed on reentry after completing a successful mission in space on 1 February 2003. A wing leading edge reinforced carbon-carbon heat shield had been damaged by a piece of frozen external tank foam insulation which broke off and struck the wing during launch. Hot reentry gasses entered and destroyed the wing structure, leading to breakup of the orbiter vehicle.\n\nArtificial atmosphere \n\nThere are two basic choices for an artificial atmosphere: either an Earth-like mixture of oxygen in an inert gas such as nitrogen or helium, or pure oxygen, which can be used at lower than standard atmospheric pressure. A nitrogen-oxygen mixture is used in the International Space Station and Soyuz spacecraft, while low-pressure pure oxygen is commonly used in space suits for extravehicular activity.\n\nUse of a gas mixture carries risk of decompression sickness (commonly known as \"the bends\") when transitioning to or from the pure oxygen space suit environment. There have also been instances of injury and fatalities caused by suffocation in the presence of too much nitrogen and not enough oxygen.\n* In 1960, McDonnell Aircraft test pilot G.B. North passed out and was seriously injured when testing a Mercury cabin / spacesuit atmosphere system in a vacuum chamber, due to nitrogen-rich air leaking from the cabin into his space suit feed.\n This incident led NASA to decide on a pure oxygen atmosphere for the Mercury, Gemini, and Apollo spacecraft.\n* In 1981, three pad workers were killed by a nitrogen-rich atmosphere in the aft engine compartment of the Space Shuttle Columbia at the Kennedy Space Center Launch Complex 39.[https://web.archive.org/web/20010605212352/http://www-lib.ksc.nasa.gov/lib/chrono.html 1981 KSC Chronology Part 1 – pages 84, 85, 100; Part 2 – pages 181, 194, 195], NASA\n* In 1995, two pad workers were similarly killed by a nitrogen leak in a confined area of the Ariane 5 launch pad at Guiana Space Centre.[http://www.esa.int/esaCP/Pr_17_1995_p_EN.html \"Fatal accident at the Guiana Space Centre\"], ESA Portal, 5 May 1993\n\nA pure oxygen atmosphere carries risk of fire. The original design of the Apollo spacecraft used pure oxygen at greater than atmospheric pressure prior to launch. An electrical fire started in the cabin of Apollo 1 during a ground test at Cape Kennedy Air Force Station Launch Complex 34 on 27 January 1967, and spread rapidly. The high pressure (increased even higher by the fire) prevented removal of the plug door hatch cover in time to rescue the crew. All three, Gus Grissom, Ed White, and Roger Chaffee, were killed. This led NASA to use a nitrogen/oxygen atmosphere before launch, and low pressure pure oxygen only in space.\n\nReliability \n\nThe March 1966 Gemini 8 mission was aborted in orbit when an attitude control system thruster stuck in the on position, sending the craft into a dangerous spin which threatened the lives of Neil Armstrong and David Scott. Armstrong had to shut the control system off and use the reentry control system to stop the spin. The craft made an emergency reentry and the astronauts landed safely. The most probable cause was determined to be an electrical short due to a static electricity discharge, which caused the thruster to remain powered even when switched off. The control system was modified to put each thruster on its own isolated circuit.\n\nThe third lunar landing expedition Apollo 13 in April 1970, was aborted and the lives of the crew, James Lovell, Jack Swigert and Fred Haise, were threatened by failure of a cryogenic liquid oxygen tank en route to the Moon. The tank burst when electrical power was applied to internal stirring fans in the tank, causing the immediate loss of all of its contents, and also damaging the second tank, causing the loss of its remaining oxygen in a span of 130 minutes. This in turn caused loss of electrical power provided by fuel cells to the command spacecraft. The crew managed to return to Earth safely by using the lunar landing craft as a \"life boat\". The tank failure was determined to be caused by two mistakes. The tank's drain fitting had been damaged when it was dropped during factory testing. This necessitated use of its internal heaters to boil out the oxygen after a pre-launch test, which in turn damaged the fan wiring's electrical insulation, because the thermostats on the heaters did not meet the required voltage rating due to a vendor miscommunication.\n\nFatality risk \n\n, 22 crew members have died in accidents aboard spacecraft. Over 100 others have died in accidents during activity directly related to spaceflight or testing. Human spaceflight. http://en.wikipedia.org/?curid=18896."
  }
}
