{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=1141",
  "eid" : "a9ecd640-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778364836,
  "textBody" : "Augustin-Jean Fresnel (, ;; 10 May 1788 – 14 July 1827) was a French civil engineer and physicist whose research in optics led to the almost unanimous acceptance of the wave theory of light, excluding any remnant of Newton's corpuscular theory, from the late 1830sDarrigol, 2012, pp.220–23. until the end of the 19th century.\n\nBut he is perhaps better known for inventing the catadioptric (reflective/refractive) Fresnel lens and for pioneering the use of \"stepped\" lenses to extend the visibility of lighthouses, saving unknown numbers of lives at sea. The simpler dioptric (purely refractive) stepped lens, first proposed by Count Buffon and independently reinvented by Fresnel, is used in screen magnifiers and in condenser lenses for overhead projectors.\n\nBy expressing Huygens' principle of secondary waves and Young's principle of interference in quantitative terms, and supposing that simple colors consist of sinusoidal waves, Fresnel gave the first satisfactory explanation of diffraction by straight edges, including the first satisfactory wave-based explanation of rectilinear propagation.Darrigol, 2012, p.205. Part of his argument was a proof that the addition of sinusoidal functions of the same frequency but different phases is analogous to the addition of forces with different directions. By further supposing that light waves are purely transverse, Fresnel explained the nature of polarization and lack thereof, the mechanism of chromatic polarization (the colors produced when polarized light is passed through a slice of doubly-refractive crystal followed by a second polarizer), and the transmission and reflection coefficients at a boundary between transparent isotropic media (including Brewster's angle). Then, by generalizing the direction-speed-polarization relation for calcite, he accounted for the directions and polarizations of the refracted rays in doubly-refractive crystals of the biaxial class (those for which Huygens' secondary wavefronts are not axisymmetric). The period between the first publication of his pure-transverse-wave hypothesis and the submission of his first correct solution to the biaxial problem was less than a year. Later, he coined the terms linear polarization, circular polarization, and elliptical polarization, explained how optical rotation could be understood as a difference in propagation speeds for the two directions of circular polarization, and (by allowing the reflection coefficient to be complex) accounted for the change in polarization due to total internal reflection, as exploited in the Fresnel rhomb. Defenders of the established corpuscular theory could not match his quantitative explanations of so many phenomena on so few assumptions.\n\nFresnel's legacy is the more remarkable in view of his lifelong battle with tuberculosis, to which he succumbed at the age of 39.\n\nAlthough he did not become a public celebrity in his short lifetime, Fresnel lived just long enough to receive due recognition from his peers, including (on his deathbed) the Rumford Medal of the Royal Society of London, and his name is ubiquitous in the modern terminology of optics and waves. Inevitably, after the wave theory of light was subsumed by Maxwell's electromagnetic theory in the 1860s, some attention was diverted from the magnitude of Fresnel's contribution. In the period between Fresnel's unification of physical optics and Maxwell's wider unification, a contemporary authority, Professor Humphrey Lloyd, described Fresnel's transverse-wave theory as \"the noblest fabric which has ever adorned the domain of physical science, Newton's system of the universe alone excepted.\"\n\nEarly life \n\nFamily \n\nAugustin-Jean Fresnel (also called Augustin Jean or simply Augustin), born in Broglie, Normandy, on 10 May 1788, was the second of four sons of the architect Jacques Fresnel (1755–1805) and his wife Augustine, née Mérimée (1755–1833). In 1790, following the Revolution, Broglie became part of the département of Eure. The family moved at least twice — in 1790 to Cherbourg,Levitt, 2013, p.23.  Boutry (1948, p.590) says the family left Broglie in 1789. and in 1794Silliman, 2008, p.166. to Jacques' home town of Mathieu, where Madame Fresnel would spend 25 years as a widow,Boutry, 1948, p.590. outliving two of her sons.\n\nThe first son, Louis (1786–1809), was admitted to the École Polytechnique, became a lieutenant in the artillery, and was killed in action at Jaca, Spain, the day before his 23rd birthday. The third, Léonor (1790–1869), followed Augustin into civil engineering, succeeded him as Secretary of the Lighthouse Commission,Levitt, 2013, p.99. and helped to edit his collected works.Fresnel, 1866–70. The fourth, Fulgence Fresnel (1795–1855), became a noted linguist, diplomat, and orientalist, and occasionally assisted Augustin with negotiations.Levitt, 2013, p.72. Léonor apparently was the only one of the four who married.On Augustin, see (e.g.) Boutry, 1948, p.604. On Léonor, see also Levitt, 2013, pp.104–5.\n\nTheir mother's younger brother, Jean François \"Léonor\" Mérimée (1757–1836), father of the writer Prosper Mérimée (1803–1870), was a paint artist who turned his attention to the chemistry of painting. He became the Permanent Secretary of the École des Beaux-Arts and (until 1814) a professor at the École Polytechnique,Levitt, 2009, p.49. and was the initial point of contact between Augustin and the leading optical physicists of the day (see below).\n\nEducation \n\nThe Fresnel brothers were initially home-schooled by their mother. The sickly Augustin was considered the slow one, hardly beginning to read until the age of eight. At nine and ten he was undistinguished except for his ability to turn tree-branches into toy bows and guns that worked far too well, earning himself the title l'homme de génie (the man of genius) from his accomplices, and a united crackdown from their elders.Levitt, 2013, pp.24–5; Arago, 1857, p.402; Boutry, 1948, pp.590–91.\n\nIn 1801, Augustin was sent to the École Centrale at Caen, as company for Louis. But Augustin lifted his performance: in late 1804 he was accepted into the École Polytechnique, being placed 17th in the entrance examination, in which his solutions to geometry problems impressed the examiner, Adrien-Marie Legendre. As the surviving records of the École Polytechnique begin in 1808, we know little of Augustin's time there, except that he apparently excelled in geometry and drawing — in spite of continuing poor health — and made few if any friends. Graduating in 1806, he then enrolled at the École Nationale des Ponts et Chaussées (National School of Bridges and Roads, also known as \"ENPC\" or \"École des Ponts\"), from which he graduated in 1809, entering the service of the Corps des Ponts et Chaussées as an ingénieur ordinair aspirant (ordinary engineer in training). Directly or indirectly, he was to remain in the employment of the \"Corps des Ponts\" for the rest of his life.Levitt, 2013, pp.25–7; Boutry, 1948, pp.591–2,601.  Arago (1857, p.403) mentions only one geometry solution — apparently the one preserved in Fresnel, 1866–70, vol.2, pp.681–4.\n\nReligious formation \n\nAugustin Fresnel's parents were Roman Catholics of the Jansenist sect, characterized by an extreme Augustinian view of original sin. Religion took first place in the boys' home-schooling. In 1802, Mme Fresnel wrote to Louis concerning Augustin:\n\nAugustin remained a Jansenist.Levitt, 2013, p.24. He indeed regarded his intellectual talents as gifts from God, and considered it his duty to use them for the benefit of others. Plagued by poor health, and determined to do his duty before death thwarted him, he shunned pleasures and worked to the point of exhaustion.Silliman, 2008, p.166; Arago, 1857, p.467. According to his fellow engineer Alphonse Duleau, who helped to nurse him through his final illness, Fresnel saw the study of nature as part of the study of the power and goodness of God. He placed virtue above science and genius. Yet in his last days he needed \"strength of soul,\" not against death alone, but against \"the interruption of discoveries… of which he hoped to derive useful applications.\"\n\nJansenism is considered heretical by the Roman Catholic Church (see List of Christian heresies), and may be part of the explanation why Fresnel, in spite of his scientific achievements and his royalist credentials, never gained a permanent academic teaching post;Grattan-Guinness, 1990, pp.914–15. his only teaching appointment was at the Athénée in the winter of 1819–20.Fresnel, 1866–70, vol.1, p.xcvii. Be that as it may, the brief article on Fresnel in the old Catholic Encyclopedia does not mention his Jansenism, but describes him as \"a deeply religious man and remarkable for his keen sense of duty.\"\n\nEngineering assignments \n\nFresnel was initially posted to the western département of Vendée. There, in 1811, he anticipated what became known as the Solvay process for producing soda ash, except that recycling of the ammonia was not considered. That difference may explain why leading chemists, who learned of his discovery through his uncle Léonor, eventually thought it uneconomic.Cf. Levitt, 2013, p.29; Buchwald, 1989, pp.113–4.  The surviving correspondence on soda ash extends from August 1811 to April 1812; see Fresnel, 1866–70, vol.2, pp.810–17.\n\nAbout 1812, Fresnel was sent to Nyons, in the southern département of Drôme, to assist with the imperial highway that was to connect Spain and Italy. It is from Nyons that we have the first evidence of his interest in optics. On 15 May 1814, while work was slack due to Napoleon's defeat,Boutry, 1948, pp.593–4. Fresnel wrote a \"P.S.\" to his brother Léonor, saying in part:\n\nAt the end of 1814 he still had no information on the subject.Boutry, 1948, p.593; Arago, 1857, pp.407–8. (Concerning the name Institute, note that the French Académie des Sciences was merged with other académies to form the Institut de France in 1795. In 1816 the Académie des Sciences regained its name and autonomy, but remained part of the Institute.)\n\nIn March 1815, perceiving Napoleon's return from Elba as \"an attack on civilization\",Arago, 1857, p.405; Silliman, 2008, p.166.  Arago does not use quotation marks. Fresnel departed without leave, hastened to Toulouse and offered his services to the royalist resistance, but soon found himself on the sick list. Returning to Nyons in defeat, he was threatened and had his windows broken. During the Hundred Days he was placed on suspension, which he was eventually allowed to spend at his mother's house in Mathieu. There he used his enforced leisure to begin his optical experiments.Levitt, 2013, pp.38–9; Boutry, 1948, p.594; Arago, 1857, pp.405–6; Kipnis, 1991, p.167.\n\nContributions to physical optics \n\nHistorical context: From Newton to Biot \n\nThe appreciation of Fresnel's reconstruction of physical optics might be assisted by an overview of the fragmented state in which he found the subject. In this subsection, optical phenomena that were unexplained or whose explanations were disputed are named in bold type.\n\nThe corpuscular theory of light, favored by Isaac Newton and accepted by nearly all of Fresnel's seniors, easily explained rectilinear propagation: the corpuscles obviously moved very fast, so that their paths were very nearly straight. The wave theory, as developed by Christiaan Huygens in his Treatise on Light (1690), explained rectilinear propagation on the assumption that each point crossed by a traveling wavefront becomes the source of a secondary wavefront. Given the initial position of a traveling wavefront, any later position (according to Huygens) was the common tangent surface (envelope) of the secondary wavefronts emitted from the earlier position. As the extent of the common tangent was limited by the extent of the initial wavefront, the repeated application of Huygens' construction to a plane wavefront of limited extent (in a uniform medium) gave a straight, parallel beam. While this construction indeed predicted rectilinear propagation, it was difficult to reconcile with the common observation that wavefronts on the surface of water can bend around obstructions, and with the similar behavior of sound waves — causing Newton to maintain, to the end of his life, that if light consisted of waves it would \"bend and spread every way\" into the shadows.\n\nHuygens' theory neatly explained the law of ordinary reflection and the law of ordinary refraction (\"Snell's law\"), provided that the secondary waves traveled slower in denser media (those of higher refractive index). The corpuscular theory, with the hypothesis that the corpuscles were subject to forces acting perpendicular to surfaces, explained the same laws equally well,Darrigol, 2012, pp.93–4,103. albeit with the implication that light traveled faster in denser media; that implication was wrong, but could not be directly disproven with the technology of Newton's time or even Fresnel's time (see Fizeau–Foucault apparatus).\n\nSimilarly inconclusive was stellar aberration — that is, the apparent change in the position of a star due to the velocity of the earth across the line of sight (not to be confused with stellar parallax, which is due to the displacement of the earth across the line of sight). Identified by James Bradley in 1728, stellar aberration was widely taken as confirmation of the corpuscular theory. But it was equally compatible with the wave theory, as Euler noted in 1746 — tacitly assuming that the aether (the supposed wave-bearing medium) near the earth was not disturbed by the motion of the earth.Darrigol, 2012, pp.129–30,258.\n\nThe outstanding strength of Huygens' theory was his explanation of the birefringence (double refraction) of \"Iceland crystal\" (transparent calcite), on the assumption that the secondary waves are spherical for the ordinary refraction (which satisfies Snell's law) and spheroidal for the extraordinary refraction (which does not). In general, Huygens' common-tangent construction implies that rays are paths of least time between successive positions of the wavefront, in accordance with Fermat's principle.Young, 1855, pp.225–6,229. In the special case of isotropic media, the secondary wavefronts must be spherical, and Huygens' construction then implies that the rays are perpendicular to the wavefront; indeed, the law of ordinary refraction can be separately derived from that premise, as Ignace-Gaston Pardies did before Huygens.Darrigol, 2012, pp.62–4.\n\nAlthough Newton rejected the wave theory, he noticed its potential to explain colors, including the colors of \"thin plates\" (e.g., \"Newton's rings\", and the colors of skylight reflected in soap bubbles), on the assumption that light consists of periodic waves, with the lowest frequencies (longest wavelengths) at the red end of the spectrum, and the highest frequencies (shortest wavelengths) at the violet end. In 1672 he published a heavy hint to that effect,Darrigol, 2012, p.87. but contemporary supporters of the wave theory failed to act on it: Robert Hooke treated light as a periodic sequence of pulses but did not use frequency as the criterion of color,Darrigol, 2012, pp.53–6. while Huygens treated the waves as individual pulses without any periodicity; and Pardies died young in 1673. Newton himself tried to explain colors of thin plates using the corpuscular theory, by supposing that his corpuscles had the wavelike property of alternating between \"fits of easy transmission\" and \"fits of easy reflection\",Darrigol, 2012, pp.98–100. the distance between \"fits\" depending on color and, awkwardly, on the angle of incidence. It was not until 1801 that Thomas Young, in the Bakerian Lecture for that year, cited Newton's hint, and accounted for the colors of a thin plate as the combined effect of the front and back reflections, which reinforce or cancel each other according to the wavelength and the thickness. He similarly explained the colors of \"striated surfaces\" (e.g., gratings) as the wavelength-dependent reinforcement or cancellation of reflections from adjacent lines. Young described this reinforcement or cancellation as interference.\n\nNeither Newton nor Huygens satisfactorily explained diffraction — the blurring and fringing of shadows where, according to rectilinear propagation, they ought to be sharp. Newton, who called diffraction \"inflexion\", supposed that rays of light passing close to obstacles were bent (\"inflected\"); but his explanation was only qualitative.Darrigol, 2012, pp.101–2. Huygens' common-tangent construction, without modifications, could not accommodate diffraction at all. Two such modifications were proposed by Young in the same 1801 Bakerian Lecture: first, that the secondary waves near the edge of an obstacle could diverge into the shadow, but only weakly, due to limited reinforcement from other secondary waves; and second, that diffraction by an edge was caused by interference between two rays: one reflected off the edge, and the other inflected while passing near the edge. The latter ray would be undeviated if sufficiently far from the edge, but Young did not elaborate on that case. These were the earliest suggestions that the degree of diffraction depends on wavelength.Darrigol, 2012, pp.177–9. Later, in the 1803 Bakerian Lecture, Young ceased to regard inflection as a separate phenomenon,Young, 1855, p.188. and produced evidence that diffraction fringes inside the shadow of a narrow obstacle were due to interference: when the light from one side was blocked, the internal fringes disappeared.Young, 1855, pp.179–81. But Young was alone in such efforts until Fresnel entered the field.Darrigol, 2012, p.187.\n\nHuygens, in his investigation of double refraction, noticed something that he could not explain: when a ray passes through two similarly oriented calcite crystals at normal incidence, the ordinary ray emerging from the first crystal suffers only the ordinary refraction in the second, while the extraordinary ray emerging from the first suffers only the extraordinary refraction in the second; but when the second crystal is rotated 90° about the incident rays, the roles are interchanged, so that the ordinary ray emerging from the first crystal suffers only the extraordinary refraction in the second, and vice versa. This discovery gave Newton another reason to reject the wave theory: rays of light evidently had \"sides\". Corpuscles could have sides (or poles, as they would later be called); but waves of light could not, because (so it seemed) any such waves would need to be longitudinal (with vibrations in the direction of propagation). Newton offered an alternative \"Rule\" for the extraordinary refraction, which rode on his authority through the 18th century, although he made \"no known attempt to deduce it from any principles of optics, corpuscular or otherwise.\"\n\nIn 1808 the extraordinary refraction of calcite was investigated experimentally, with unprecedented accuracy, by Étienne-Louis Malus, and found to be consistent with Huygens' spheroid construction, not Newton's \"Rule\". Malus then sought to explain this law in corpuscular terms: from the known relation between the incident and refracted ray directions, he derived the corpuscular velocity (as a function of direction) that that would satisfy Maupertuis's \"least action\" principle. But, as Young pointed out, the existence of such a velocity law was guaranteed by Huygens' spheroid, because Huygens' construction leads to Fermat's principle, which becomes Maupertuis's principle if the ray speed is replaced by the reciprocal of the particle speed! The corpuscularists had not found a force law that would yield the alleged velocity law. Worse, it was doubtful that any such force law would satisfy the conditions of Maupertuis's principle.Young, 1855, pp.225–8; Frankel, 1974. In contrast, Young proceeded to show that \"a medium more easily compressible in one direction than in any direction perpendicular to it, as if it consisted of an infinite number of parallel plates connected by a substance somewhat less elastic\" admits spheroidal longitudinal wavefronts, as Huygens supposed.Young, 1855, pp.228–32; cf. Whewell, 1857, p.329.\n\nBut Malus, in the course of his experiments on double refraction, noticed something else: when a ray of light is reflected off a non-metallic surface at the appropriate angle, it behaves like one of the two rays emerging from a calcite crystal.Darrigol, 2012, pp.191–2. It was Malus who coined the term polarization to describe this behavior, although the polarizing angle became known as Brewster's angle after its dependence on the refractive index was determined experimentally by David Brewster in 1815. Malus also introduced the term plane of polarization. In the case of polarization by reflection, his \"plane of polarization\" was the plane of the incident and reflected rays; in modern terms, this is the plane normal to the electric vibration. In 1809, Malus further discovered that the intensity of light passing through two polarizers is proportional to the squared cosine of the angle between their planes of polarization (Malus's law),Darrigol, 2012, p.192. whether the polarizers work by reflection or double refraction, and that all birefringent crystals produce both extraordinary refraction and polarization.Young, 1855, pp.249–50. As the corpuscularists started trying to explain these things in terms of polar \"molecules\" of light, the wave-theorists had no working hypothesis on the nature of polarization, prompting Young to remark that Malus's observations \"present greater difficulties to the advocates of the undulatory theory than any other facts with which we are acquainted.\"Young, 1855, p.233.\n\nMalus died in February 1812, at the age of 36, shortly after receiving the Rumford Medal for his work on polarization.\n\nIn August 1811, François Arago reported that if a thin plate of mica was viewed against a white polarized backlight through a calcite crystal, the two images of the mica were of complementary colors (the overlap having the same color as the background). The light emerging from the mica was \"depolarized\" in the sense that there was no orientation of the calcite that made one image disappear; yet it was not ordinary (\"unpolarized\") light, for which the two images would be of the same color. Rotating the calcite around the line of sight changed the colors, though they remained complementary. Rotating the mica changed the saturation (not the hue) of the colors. This phenomenon became known as chromatic polarization. Replacing the mica with a much thicker plate of quartz, with its faces perpendicular to the optic axis (the axis of Huygens' spheroid or Malus's velocity function), produced a similar effect, except that rotating the quartz made no difference. Arago tried to explain his observations in corpuscular terms.Levitt, 2009, p.37; Darrigol, 2012, pp.193–4,290.\n\nIn 1812, as Arago pursued further qualitative experiments and other commitments, Jean-Baptiste Biot reworked the same ground using a gypsum lamina in place of the mica, and found empirical formulae for the intensities of the ordinary and extraordinary images. The formulae contained two coefficients, supposedly representing colors of rays \"affected\" and \"unaffected\" by the plate — the \"affected\" rays being of the same color mix as those reflected by amorphous thin plates of proportional, but lesser, thickness.Darrigol, 2012, pp.194–5 (ordinary intensity); Frankel, 1976, p.148 (both intensities).\n\nArago protested, declaring that he had made some of the same discoveries but had not had time to write them up. In fact the overlap between Arago's work and Biot's was minimal, because Arago's was only qualitative and sought to include other topics. But the dispute triggered a notorious falling-out between the two men.Buchwald, 1989, pp.79–88; Levitt, 2009, pp.33–57.\n\nLater that year, Biot tried to explain the observations as an oscillation of the alignment of the \"affected\" corpuscles at a frequency proportional to that of Newton's \"fits\", due to forces depending on the alignments. This theory became known as mobile polarization. To reconcile his results with a sinusoidal oscillation, Biot had to suppose that the corpuscles emerged with one of two permitted orientations, namely the extremes of the oscillation, with probabilities depending on the phase of the oscillation.Frankel, 1976, pp.149–50; Buchwald, 1989, pp.99–103; Darrigol, 2012, pp.195–6. Corpuscular optics was becoming expensive on assumptions. But in 1813, Biot reported that the case of quartz was simpler: the observable phenomenon (now called optical rotation or optical activity or sometimes rotary polarization) was a gradual rotation of the polarization direction with distance, and could be explained by a similar rotation (not oscillation) of the corpuscles.Frankel, 1976, pp.151–2; Darrigol, 2012, p.196.\n\nEarly in 1814, reviewing Biot's work on chromatic polarization, Young noted that the periodicity of the color as a function of the plate thickness — including the factor by which the period exceeded that for a reflective thin plate, and even the effect of obliquity of the plate (but not the role of polarization) — could be explained by the wave theory in terms of the different propagation times of the ordinary and extraordinary waves through the plate.Young, 1855, pp.269–72. But Young was then the only public defender of the wave theory.Frankel, 1976, p.176.\n\nIn summary, in the spring of 1814, as Fresnel tried in vain to guess what polarization was, the corpuscularists thought that they knew, while the wave-theorists (if we may use the plural) literally had no idea. Both theories claimed to explain rectilinear propagation, but the wave explanation was overwhelmingly regarded as unconvincing. The corpuscular theory could not link double refraction to specific surface forces; the wave theory could not yet link it to polarization. The corpuscular theory was weak on thin plates and silent on gratings; the wave theory was strong on both, but under-appreciated. Concerning diffraction, the corpuscular theory did not yield quantitative predictions, while the wave theory had begun to do so by considering diffraction as a manifestation of interference, but had only considered two rays at a time. Only the corpuscular theory gave even a vague insight into Brewster's angle, Malus's law, or optical rotation. Concerning chromatic polarization, the wave theory explained the periodicity far better than the corpuscular theory, but had nothing to say about the role of polarization; and its explanation of the periodicity was largely ignored.Frankel, 1976, p.155. And Arago had founded the study of chromatic polarization, only to lose the lead, controversially, to Biot. Such were the circumstances in which Arago first heard of Fresnel's interest in optics.\n\nRêveries \n\nFresnel's letters from later in 1814 reveal his interest in the wave theory, including his awareness that it explained the constancy of the speed of light and was at least compatible with stellar aberration. Eventually he compiled what he called his rêveries (musings) into an essay and submitted it via Léonor Mérimée to André-Marie Ampère, who did not respond directly.The story that Ampère lost the essay (propagated from Boutry, 1948, p.593?) is implicitly contradicted by Darrigol (2012, p.198), Buchwald (1989, p.117), Mérimée's letter to Fresnel dated 20 December 1814 (in Fresnel, 1866–70, vol.2, pp.830–31), and two footnotes in Fresnel's collected works (Fresnel, 1866–70, vol.1, pp.xxix–xxx, note 4, and p.6n). But on 19 December, Mérimée dined with Ampère and Arago, with whom he was acquainted through the École Polytechnique; and Arago promised to look at Fresnel's essay.Buchwald, 1989, pp.116–7; Fresnel, 1866–70, vol.2, p.831; Levitt, 2009, p.49.\n\nIn mid 1815, on his way home to Mathieu to serve his suspension, Fresnel met Arago in Paris and spoke of the wave theory and stellar aberration. He was informed that he was trying to break down open doors (\"il enfonçait des portes ouvertes\"), and directed to classical works on optics.Boutry, 1948, pp.594–5.\n\nDiffraction \n\nFirst attempt (1815) \n\nOn 12 July 1815, as Fresnel was about to leave Paris, Arago left him a note on a new topic:\n\nFresnel would not have ready access to these works outside Paris, and could not read English.Fresnel, 1866–70, vol.1, pp.6–7. But, in Mathieu — with a point-source of light made by focusing sunlight with a drop of honey, a crude micrometer of his own construction, and supporting apparatus made by a local locksmith — he began his own experiments.Fresnel, 1866–70, vol.1, pp.xxxi (micrometer, locksmith , supports), 6n (locksmith); Buchwald, 1989, pp.122 (honey drop), 125–6 (micrometer, with diagram); Boutry 1948, p.595 and Levitt, 2013, p.40 (locksmith, honey drop, micrometer); Darrigol 2012, pp.198–9 (locksmith, honey drop). His technique was novel: whereas earlier investigators had projected the fringes onto a screen, Fresnel soon abandoned the screen and observed the fringes in space, through a lens with the micrometer at its focus, allowing more accurate measurements while requiring less light.Buchwald, 1989, pp.122,126.\n\nLater in July, after Napoleon's final defeat, Fresnel was reinstated with the advantage of having backed the winning side. He requested a two-month leave of absence, which was readily granted because roadworks were in abeyance.Levitt, 2013, pp.39,239.\n\nOn 23 September he wrote to Arago, beginning \"I think I have found the explanation and the law of colored fringes which one notices in the shadows of bodies illuminated by a luminous point.\" In the same paragraph, however, Fresnel implicitly acknowledged doubt about the novelty of his work: noting that he would need to incur some expense in order to improve his measurements, he wanted to know \"whether this is not useless, and whether the law of diffraction has not already been established by sufficiently exact experiments.\"Kipnis, 1991, p.167; Fresnel, 1866–70, vol.1, pp.5–6. He explained that he had not yet had a chance to acquire the items on his reading lists, with the apparent exception of \"Young's book\", which he could not understand without his brother's help.Darrigol, 2012, p.198. \"Young's book\", which Fresnel distinguished from the Philosophical Transactions, is presumably A Course of Lectures on Natural Philosophy and the Mechanical Arts (2 volumes, 1807). In [https://archive.org/details/lecturescourseof01younrich vol.1], the relevant illustrations are Plate (facing p.777), including the famous two-source interference pattern (Fig.267), and Plate (facing p.787), including the hyperbolic paths of the fringes in that pattern (Fig.442) followed by sketches of other diffraction patterns and thin-plate patterns, with no visual hints on their physical causes. In [https://archive.org/details/lecturescourseof02younrich vol.2], which includes the Bakerian lectures from the Philosophical Transactions, Fig.108 (p.632) shows just one case of an undeviated direct ray intersecting a reflected ray. Not surprisingly, he had retraced many of Young's steps.\n\nIn a memoir sent to the Institute on 15 October 1815, Fresnel mapped the external and internal fringes in the shadow of a wire. He noticed, like Young before him, that the internal fringes disappeared when the light from one side was blocked, and concluded that \"the vibrations of two rays that cross each other under a very small angle can contradict each other…\"Darrigol, 2012, p.199. But, whereas Young took the disappearance of the internal fringes as confirmation of the principle of interference, Fresnel reported that it was the internal fringes that first drew his attention to the principle. To explain the diffraction pattern, Fresnel constructed the internal fringes by considering the intersections of circular wavefronts emitted from the two edges of the obstruction, and the external fringes by considering the intersections between direct waves and waves reflected off the nearer edge. For the external fringes, to obtain tolerable agreement with observation, he had to suppose that the reflected wave was inverted; and he noted that the predicted paths were hyperbolic. In the part of the memoir that most clearly surpassed Young, Fresnel explained the ordinary laws of reflection and refraction in terms of interference, noting that if two parallel rays were reflected or refracted at other than the prescribed angle, they would no longer have the same phase in a common perpendicular plane, and every vibration would be cancelled by a nearby vibration. He acknowledged that his explanation was valid provided that the surface irregularities were much smaller than the wavelength.Buchwald, 1989, pp.119,131–2; Darrigol, 2012, pp.199–201; Kipnis, 1991, pp.175–6.\n\nOn 10 November, Fresnel sent a supplementary note dealing with Newton's rings and with gratings,Darrigol, 2012, p.201. including, for the first time, transmission gratings — although in that case the interfering rays were still assumed to be \"inflected\", and the experimental verification was inadequate because it used only two threads.Fresnel, 1866–70, vol.1, pp.48–9; Kipnis, 1991, pp.176–8.\n\nAs Fresnel was not a member of the Institute, the fate of his memoir depended heavily on the report of a single member. The reporter for Fresnel's memoir turned out to be Arago (with Poinsot as the other reviewer).Frankel, 1976, p.158; Fresnel, 1866–70, vol.1, p.9n. On 8 November, Arago wrote to Fresnel:\n\nFresnel was troubled, wanting to know more precisely where he had collided with Young.Buchwald, 1989, pp.137–9. Concerning the curved paths of the \"colored bands\", Young had noted the hyperbolic paths of the fringes in the two-source interference pattern corresponding roughly to Fresnel's internal fringes, and described the hyperbolic fringes that appear on the screen within rectangular shadows.Young, 1807, vol.1, p.787 & Figs.442,445; Young, 1855, pp.180–81,184. But Arago erred in his belief that the curved paths of the fringes were fundamentally incompatible with the corpuscular theory.Kipnis, 1991, pp.204–5.  Cf. Darrigol, 2012, p.101, where the straight rays  combine to form a curved fringe (and, in the caption, \"1904\" should be \"1704\" and \"\" should be \"\").\n\nArago's letter went on to request more data on the external fringes. Fresnel complied, until he exhausted his leave and was assigned to Rennes in the département of Ille-et-Vilaine. At this point Arago interceded with Gaspard de Prony, head of the École des Ponts, who wrote to Louis-Mathieu Molé, head of the Corps des Ponts, suggesting that the progress of science and the prestige of the Corps would be enhanced if Fresnel could come to Paris for a time. He arrived in March 1816, and his leave was subsequently extended through the middle of the year.Frankel, 1976, p.158; Boutry, 1948, p.597; Levitt, 2013, pp.41–3.\n\nMeanwhile, in an experiment reported on 26 February 1816, Arago verified Fresnel's prediction that the internal fringes were shifted if the rays on one side of the obstacle passed through a thin glass lamina. Fresnel correctly attributed this phenomenon to the lower wave velocity in the glass.Buchwald, 1989, p.137; Kipnis, 1991, pp.178,207,213. Arago later used a similar argument to explain the colors in the scintillation of stars.Frankel (1976, p.156) gives the date of Arago's note on scintillation as 1814; but the sequence of events implies 1816, in agreement with Darrigol (pp.201,290).  Kipnis (1991, pp.202–3,206) proves the later date and explains the origin and propagation of the incorrect earlier date.\n\nFresnel's updated memoirFresnel, 1816. was eventually published in the March 1816 issue of Annales de Chimie et de Physique, of which Arago had recently become co-editor.Darrigol, 2012, p.201; Frankel, 1976, p.159. That issue did not actually appear until May.Kipnis, 1991, pp.166n,214n. In March, Fresnel already had competition: Biot read a memoir on diffraction by himself and his student Claude Pouillet, containing copious data and arguing that the regularity of diffraction fringes, like the regularity of Newton's rings, must be linked to Newton's \"fits\". But the new link was not rigorous, and Pouillet himself would become a distinguished early adopter of the wave theory.Kipnis, 1991, pp.212–14; Frankel, 1976, pp.159–60,173.\n\n\"Efficacious ray\", double-mirror experiment (1816) \n\nOn 24 May 1816, Fresnel wrote to Young (in French), acknowledging how little of his own memoir was new.Darrigol, 2012, p.201; letter printed in Young, 1855, pp.376–8. But in a \"supplement\" signed on 14 July and read the next day,Fresnel, 1866–70, vol.1, pp.129–70. Fresnel noted that the internal fringes were more accurately predicted by supposing that the two interfering rays came from some distance outside the edges of the obstacle. To explain this, he divided the incident wavefront at the obstacle into what we now call Fresnel zones, such that the secondary waves from each zone were spread over half a cycle when they arrived at the observation point. The zones on each side of the obstacle largely canceled out in pairs, except the first, which was represented by an \"efficacious ray\". This approach worked for the internal fringes, but the superposition of the efficacious ray and the direct ray did not work for the external fringes.Darrigol, 2012, pp.201–3.\n\nThe contribution from the \"efficacious ray\" was thought to be only partly canceled, for reasons involving the dynamics of the medium: where the wavefront was continuous, symmetry forbade oblique vibrations; but near the obstacle that truncated the wavefront, the asymmetry allowed some sideways vibration towards the geometric shadow. This argument showed that Fresnel had not (yet) fully accepted Huygens' principle, which would have permitted oblique radiation from all portions of the front.Buchwald, 1989, pp.134,144–5.\n\nIn the same supplement, Fresnel described his well-known double mirror, comprising two flat mirrors joined at an angle of slightly less than 180°, with which he produced a two-slit interference pattern from two virtual images of the same slit. A conventional double-slit experiment required a preliminary single slit to ensure that the light falling on the double slit was coherent (synchronized). In Fresnel's version, the preliminary single slit was retained, and the double slit was replaced by the double mirror — which bore no physical resemblance to the double slit and yet performed the same function. This result (which had been announced by Arago in the March issue of the Annales) made it hard to believe that the two-slit pattern had anything to do with corpuscles being deflected as they passed near the edges of the slits.Buchwald, 1989, pp.137–8; Darrigol, 2012, pp.201–2; Boutry, 1948, p.597; Fresnel, 1866–70, vol.1, pp.123–8 (Arago's announcement).\n\nBut 1816 was the \"Year Without a Summer\": crops failed; hungry farming families lined the streets of Rennes; the central government organized \"charity workhouses\" for the needy; and in October, Fresnel was sent back to Ille-et-Vilaine to supervise charity workers in addition to his regular road crew.Levitt, 2013, p.43; Boutry, 1948, p.599. According to Arago,\n\nFresnel's letters from December 1816 reveal his consequent anxiety. To Arago he complained of being \"tormented by the worries of surveillance, and the need to reprimand…\" And to Mérimée he wrote: \"I find nothing more tiresome than having to manage other men, and I admit that I have no idea what I'm doing.\"Levitt, 2013, pp.28,237.\n\nPrize memoir (1818) and sequel \n\nOn 17 March 1817, the Académie des Sciences announced that diffraction would be the topic for the biannual physics Grand Prix to be awarded in 1819.Buchwald, 1989, p.169; 2013, p.453; Levitt, 2013, p.44.  Frankel (1976, pp.160–61) and Grattan-Guinness (1990, p.867) note that the topic was first proposed on 10 February 1817. Darrigol alone (2012, p.203) says that the competition was \"opened\" on 17 March 1818. Prizes were offered in odd-numbered years for physics and in even-numbered years for mathematics (Frankel, 1974, p.224n). The deadline for entries was set at 1 August 1818 to allow time for replication of experiments. Although the wording of the problem referred to rays and inflection and did not invite wave-based solutions, Arago and Ampère encouraged Fresnel to enter.Buchwald, 1989, pp.169–71; Frankel, 1976, p.161; Fresnel, 1866–70, vol.1, pp.xxxvi–xxxvii.\n\nIn the fall of 1817, Fresnel, supported by de Prony, obtained a leave of absence from the new head of the Corp des Ponts, Louis Becquey, and returned to Paris.Fresnel, 1866–70, vol.1, p.xxxv; Levitt, 2013, p.44. He resumed his engineering duties in the spring of 1818; but from then on he was based in Paris,Silliman, 2008, p.166; Frankel, 1976, p.159. first on the Canal de l'Ourcq,Fresnel, 1866–70, vol.1, pp.xxxv,xcvi; Boutry, 1948, pp.599,601. and then (from May 1819) with the cadastre of the pavements.Fresnel, 1866–70, vol.1, p.xcvi; Arago, 1857, p.466.\n\nOn 15 January 1818, in a different context (revisited below), Fresnel showed that the addition of sinusoidal functions of the same frequency but different phases is analogous to the addition of forces with different directions. His method was similar to the phasor representation, except that the \"forces\" were plane vectors rather than complex numbers; they could be added, and multiplied by scalars, but not (yet) multiplied and divided by each other. The explanation was algebraic rather than geometric.\n\nKnowledge of this method was assumed in a preliminary note on diffraction,Printed in Fresnel, 1866–70, vol.1, pp.171–81. dated 19 April 1818 and deposited on 20 April, in which Fresnel outlined the elementary theory of diffraction as found in modern textbooks. He restated Huygens' principle in combination with the superposition principle, saying that the vibration at each point on a wavefront is the sum of the vibrations that would be sent to it at that moment by all the elements of the wavefront in any of its previous positions, all elements acting separately (see Huygens–Fresnel principle). For a wavefront partly obstructed in a previous position, the summation was to be carried out over the unobstructed portion. In directions other than the normal to the primary wavefront, the secondary waves were weakened due to obliquity, but weakened much more by destructive interference, so that the effect of obliquity alone could be ignored.Cf. Fresnel, 1866–70, vol.1, pp.174–5; Buchwald, 1989, pp.157–8. For diffraction by a straight edge, the intensity as a function of distance from the geometric shadow could then be expressed with sufficient accuracy in terms of what are now called the normalized Fresnel integrals:\n\n:C(x) \\!\\int_0^x \\!\\cos\\big(\\tfrac{1}{2}\\pi z^2\\big)\\,dz; S(x) \n \\!\\int_0^x \\!\\sin\\big(\\tfrac{1}{2}\\pi z^2\\big)\\,dz\\,.\n\nThe same note included a table of the integrals, for an upper limit ranging from  0 to 5.1 in steps of 0.1, computed with a mean error of 0.0003,Buchwald, 1989, p.167; 2013, p.454. plus a smaller table of maxima and minima of the resulting intensity.\n\nIn the final memoirFresnel, 1818. deposited on 29 July, those two tables were slightly expanded without changing the existing figures, except for a correction to the first minimum of intensity. For completeness, Fresnel repeated his solution to \"the problem of interference\", whereby sinusoidal functions are added like vectors. He acknowledged the directionality of the secondary sources and the variation in their distances from the observation point, chiefly to explain why these things make negligible difference in the context, provided of course that the secondary sources do not radiate in the retrograde direction. Then, applying his theory of interference to the secondary waves, he expressed the intensity of light diffracted by a single straight edge (half-plane) in terms of integrals which involved the dimensions of the problem, but which could be converted to the normalized forms above. With reference to the integrals, he explained the calculation of the maxima and minima of the intensity (external fringes), and noted that the calculated intensity falls very rapidly as one moves into the geometric shadow.Crew, 1900, pp.101–8 (vector-like representation), 109 (no retrograde radiation), 110–11 (directionality and distance), 118–22 (derivation of integrals), 124–5 (maxima & minima), 129–31 (geometric shadow). The last result, as Olivier Darrigol says, \"amounts to a proof of the rectilinear propagation of light in the wave theory, indeed the first proof that a modern physicist would still accept.\"Darrigol, 2012, pp.204–5.\n\nFor the experimental testing of his calculations, Fresnel used red light with a wavelength of 638nm, which he deduced from the diffraction pattern in the simple case in which light incident on a single slit was focused by a cylindrical lens. For a variety of distances from the source to the obstacle and from the obstacle to the field point, he compared the calculated and observed positions of the fringes for diffraction by a half-plane, a slit, and a narrow strip — concentrating on the minima, which were visually sharper than the maxima. For the slit and the strip, he could not use the previously computed table of maxima and minima; for each combination of dimensions, the intensity had to be expressed in terms of sums or differences of Fresnel integrals and calculated from the table of integrals, and the extrema had to be calculated anew.Crew, 1900, pp.127–8 (wavelength), 129–31 (half-plane), 132–5 (extrema, slit); Fresnel, 1866–70, vol.1, pp.350–55 (narrow strip). The agreement between calculation and measurement was better than 1.5% in almost every case.Buchwald, 1989, pp.179–82.\n\nNear the end of the memoir, Fresnel summed up the difference between Huygens' use of secondary waves and his own: whereas Huygens says there is light only where the secondary waves exactly agree, Fresnel says there is complete darkness only where the secondary waves exactly cancel out.Crew, 1900, p.144.\n\nThe judging committee comprised Laplace, Biot, and Poisson (all corpuscularists), Gay-Lussac (uncommitted), and Arago, who eventually wrote the committee's report. Although entries in the competition were supposed to be anonymous to the judges, Fresnel's must have been recognizable by the content.Worrall, 1989, p.136; Buchwald, 1989, pp.171,183; Levitt, 2013, pp.45–6. There was only one other entry, of which neither the manuscript nor any record of the author has survived.Frankel, 1976, p.162. However, Kipnis (1991, pp.222–4) offers evidence that the unsuccessful entrant was Honoré Flaugergues (1755–1830?) and that the essence of his entry is contained in a \"supplement\" published in Journal de Physique, vol.89 (September 1819), pp.161–86. That entry (identified as \"no.1\") was mentioned only in the last paragraph of the judges' report,Fresnel, 1866–70, vol.1, pp.236–7. noting that the author had shown ignorance of the relevant earlier works of Young and Fresnel, used insufficiently precise methods of observation, overlooked known phenomena, and made obvious errors. In the words of John Worrall, \"The competition facing Fresnel could hardly have been less stiff.\"Worrall, 1989, pp.139–40. We may infer that the committee had only two options: award the prize to Fresnel (\"no.2\"), or withhold it.Cf. Worrall, 1989, p.141.\n\nThe committee deliberated into the new year. Then Poisson, exploiting a case in which Fresnel's theory gave easy integrals, predicted that if a circular obstacle were illuminated by a point-source, there should be (according to the theory) a bright spot in the center of the shadow, illuminated as brightly as the exterior. This seems to have been intended as a reductio ad absurdum. Arago, undeterred, assembled an experiment with an obstacle 2mm in diameter — and there, in the center of the shadow, was Poisson's spot. The committee unanimously awarded the prize to Fresnel.Darrigol, 2012, p.205; Fresnel, 1866–70, vol.1, p.xlii.\n\nArago's verification of Poisson's counter-intuitive prediction passed into folklore as if it had decided the prize.Worrall, 1989, pp.135–8; Kipnis, 1991, p.220. That view, however, is not supported by the judges' report, which gave the matter only two sentences in the penultimate paragraph.Worrall, 1989, pp.143–5. The printed version of the report also refers to a note (E), but this note concerns further investigations that took place after the prize was decided (Worrall, 1989, pp.145–6; Fresnel, 1866–70, vol.1, pp.236,245–6). According to Kipnis (1991, pp.221–2), the real significance of Poisson's spot and its complement (at the center of the bright spot cast by a circular aperture) was that they concerned the intensities of fringes, whereas Fresnel's measurements had concerned only the positions of fringes; but, as Kipnis also notes, this issue was pursued only after the prize was decided. Neither did Fresnel's triumph immediately convert Laplace, Biot, and Poisson to the wave theory,Concerning their later views, see §Reception. for at least four reasons. First, although the professionalization of science in France had established common standards, it was one thing to acknowledge a piece of research as meeting those standards, and another thing to regard it as conclusive. Second, it was possible to interpret Fresnel's integrals as rules for combining rays. Arago even encouraged that interpretation, presumably in order to minimize resistance to Fresnel's ideas.Buchwald, 1989, pp.183–4; Darrigol, 2012, p.205. Even Biot began teaching the Huygens-Fresnel principle without committing himself to a wave basis.Kipnis, 1991, pp.219–20,224,232–3; Grattan-Guinness, 1990, p.870. Third, Fresnel's theory did not explain the mechanism of generation of secondary waves or why they had any significant angular spread; this issue particularly bothered Poisson.Buchwald, 1989, pp.188–98; Darrigol, 2012, pp.205–6; Kipnis, 1991, p.220. Fourth, the question that most exercised optical physicists at that time was not diffraction, but polarization — on which Fresnel had been working, but was yet to make his critical breakthrough.\n\nPolarization \n\nBackground: Emissionism and selectionism \n\nAn emission theory of light was one that regarded the propagation of light as the transport of some kind of matter. While the corpuscular theory was obviously an emission theory, the converse did not follow: in principle, one could be an emissionist without being a corpuscularist. This was convenient because, beyond the ordinary laws of reflection and refraction, emissionists never managed to make testable quantitative predictions from a theory of forces acting on corpuscles of light. But they did make quantitative predictions from the premises that rays were countable objects, which were conserved in their interactions with matter (except absorbent media), and which had particular orientations. According to this framework, polarization and the related phenomena of double refraction and partial reflection involved altering the orientations of the rays and/or selecting them according to orientation, and the state of polarization of a beam (a bundle of rays) was a question of how many rays were in what orientations: in a fully polarized beam, the orientations were all the same. This approach, which Jed Buchwald has called selectionism, was pioneered by Malus and diligently pursued by Biot.Buchwald, 1989, pp.50–51,63–5,103–4; 2013, pp.448–9.\n\nFresnel, in contrast, decided to introduce polarization into interference experiments.\n\nInterference of polarized light, chromatic polarization (1816–21) \n\nIn the summer of 1816, Fresnel discovered that when a birefringent crystal produced two images of a single slit, he could not obtain the usual two-slit interference pattern, even if he compensated for the different propagation times. A more general experiment, suggested by Arago, found that if the two beams of a double-slit device were separately polarized, the interference pattern appeared and disappeared as the polarization of one beam was rotated, giving full interference for parallel polarizations, but no interference for perpendicular polarizations (see Fresnel–Arago laws).Darrigol, 2012, p.206. These experiments, among others, were eventually reported in a brief memoir published in 1819 and later translated into English.\n\nIn a memoir drafted on 30 August 1816 and revised on 6 October, Fresnel reported an experiment in which he placed two matching thin laminae in a double-slit apparatus — one over each slit, with their optic axes perpendicular — and obtained two interference patterns offset in opposite directions, with perpendicular polarizations. This, in combination with the previous findings, meant that each lamina split the incident light into perpendicularly polarized components with different velocities — just like a normal (thick) birefringent crystal, and contrary to Biot's \"mobile polarization\" hypothesis.Darrigol, 2012, p.207; Frankel, 1976, pp.163–4.\n\nAccordingly, in the same memoir, Fresnel offered his first attempt at a wave theory of chromatic polarization. When polarized light passed through a crystal lamina, it was split into ordinary and extraordinary waves (with intensities described by Malus's law), and these were perpendicularly polarized and therefore did not interfere, so that no colors were produced (yet). But if they then passed through an analyzer (second polarizer), their polarizations were brought into alignment (with intensities again modified according to Malus's law), and they would interfere. This explanation, by itself, predicts that if the analyzer is rotated 90°, the ordinary and extraordinary waves simply switch roles, so that if the analyzer takes the form of a calcite crystal, the two images of the lamina should be of the same hue (this issue is revisited below). But in fact, as Arago and Biot had found, they are of complementary colors. To correct the prediction, Fresnel proposed a phase-inversion rule whereby one of the constituent waves of one of the two images suffered an additional 180° phase shift on its way through the lamina. This inversion was a weakness in the theory relative to Biot's, as Fresnel acknowledged,Frankel, 1976, p.164. although the rule specified which of the two images had the inverted wave.Buchwald, 1989, p.386. Moreover, because Fresnel had not yet worked out how to superpose sinusoidal functions with arbitrary phase differences (due to propagation at different velocities through the lamina), he could only deal with special cases.Buchwald, 1989, pp.216,384.\n\nIn a \"supplement\" signed on 15 January 1818 — the same document in which he introduced his technique for superposing sinusoidal functions — Fresnel accommodated Malus's law by proposing an underlying principle: that if polarized light is incident on a birefringent crystal with its optic axis at an angle θ to the \"plane of polarization\", the ordinary and extraordinary vibrations (as functions of time) are scaled by the factors cosθ and sinθ, respectively. Although modern readers easily interpret these factors in terms of perpendicular components of a transverse oscillation, Fresnel did not (yet) explain them that way. Hence he still needed the phase-inversion rule. He applied these principles to a case of chromatic polarization not covered by Biot's formulae, involving two successive laminae with axes separated by 45°, and obtained predictions that disagreed with Biot's experiments (except in special cases) but agreed with his own.Buchwald, 1989, pp.333–6; Darrigol, 2012, pp.207–8. (Darrigol gives the date as 1817, but the page numbers in his footnote 95 fit reference \"1818b\", not \"1817\".)\n\nFresnel applied the same principles to the standard case of chromatic polarization, in which one birefringent lamina was sliced parallel to its axis and placed between a polarizer and an analyzer. If the analyzer took the form of a thick calcite crystal with its axis in the plane of polarization, Fresnel predicted that the intensities of the ordinary and extraordinary images of the lamina were respectively proportional to\n\n:I_o = \\cos^2i\\,\\cos^2(i{-}s) + \\sin^2i\\,\\sin^2(i{-}s) + \\tfrac{1}{2}\\sin 2i\\,\\sin 2(i{-}s)\\cos\\phi\\,,\n\n:I_e = \\cos^2i\\,\\sin^2(i{-}s) + \\sin^2i\\,\\cos^2(i{-}s) - \\tfrac{1}{2}\\sin 2i\\,\\sin 2(i{-}s)\\cos\\phi\\,,\n\nwhere i is the angle from the initial plane of polarization to the optic axis of the lamina, s is the angle from the initial plane of polarization to the plane of polarization of the final ordinary image, and \\phi is the phase lag of the extraordinary wave relative to the ordinary wave due to the difference in propagation times through the lamina. The terms in \\phi are the frequency-dependent terms and explain why the lamina must be thin in order to produce discernible colors: if the lamina is too thick, \\cos\\phi will pass through too many cycles as the frequency varies through the visible range, and the eye (which divides the visible spectrum into only three bands) will not be able to resolve the cycles.\n\nFrom these equations it is easily verified that \\,I_o+I_e=1\\, for all \\phi, so that the colors are complementary. Without the phase-inversion rule, there would be a plus sign in front of the last term in the second equation, so that the \\phi-dependent term would be the same in both equations, implying (incorrectly) that the colors were of the same hue.\n\nThese equations were included in an undated note that Fresnel gave to Biot,Fresnel, 1866–70, vol.1, pp.533–7. On the provenance of the note, see p.523. In the above text, φ is an abbreviation for Fresnel's , where e and o are the numbers of cycles taken by the extraordinary and ordinary waves to travel through the lamina. to which Biot added a few lines of his own. If we substitute\n\n:U\\cos^2\\tfrac{\\phi}{2}  and  A\n\\sin^2\\tfrac{\\phi}{2}\\,,\n\nthen Fresnel's formulae can be rewritten as\n\n: \\!I_o = U\\cos^2 s + A\\cos^2(2i-s)\\,,\n:   I_e = U\\sin^2 s + A\\sin^2(2i-s)\\,,\n\nwhich are none other than Biot's empirical formulae of 1812,Buchwald, 1989, p.97; Frankel, 1976, p. 148. except that Biot interpreted U and A as the \"unaffected\" and \"affected\" selections of the rays incident on the lamina. If Biot's substitutions were accurate, they would imply that his experimental results were more fully explained by Fresnel's theory than by his own.\n\nArago delayed reporting on Fresnel's works on chromatic polarization until June 1821, when he used them in a broad attack on Biot's theory. In his written response, Biot protested that Arago's attack went beyond the proper scope of a report on the nominated works of Fresnel. But Biot also claimed that the substitutions for U and A, and therefore Fresnel's expressions for I_o and I_e, were empirically wrong because when Fresnel's intensities of spectral colors were mixed according to Newton's rules, the squared cosine and sine functions varied too smoothly to account for the observed sequence of colors. That claim drew a written reply from Fresnel, who disputed whether the colors changed as abruptly as Biot claimed, and whether the human eye could judge color with sufficient objectivity for the purpose. On the latter question, Fresnel pointed out that different observers may give different names to the same color. Furthermore, he said, a single observer can only compare colors side-by-side; and even if they are judged to be the same, the identity is of sensation, not necessarily of composition. Fresnel's oldest and strongest point — that thin crystals were subject to the same laws as thick ones and did not need or allow a separate theory — Biot left unanswered.  Arago and Fresnel were seen to have won the debate.Buchwald, 1989, pp.237–51; Levitt, 2009, pp.54–7; Frankel, 1976, pp.165–8; Darrigol, 2012, pp.208–9.\n\nMoreover, by this time Fresnel had a new, simpler derivation of his equations on chromatic polarization.\n\nBreakthrough: Pure transverse waves (1821) \n\nIn the draft memoir of 30 August 1816, Fresnel mentioned two hypotheses — one of which he attributed to Ampère — by which the non-interference of orthogonally-polarized beams could be explained if polarized light waves were partly transverse. But Fresnel could not develop either of these ideas into a comprehensive theory. According to his later account, both he and Ampère realized as early as September 1816 that the non-interference of orthogonally-polarized beams, together with the phase-inversion rule in chromatic polarization, would be most easily explained if the waves were purely transverse. But that would raise a new difficulty: as natural light seemed to be unpolarized and its waves were therefore presumed to be longitudinal, one would need to explain how the longitudinal component of vibration disappeared on polarization, and why it did not reappear when polarized light was reflected or refracted obliquely by a glass plate.Buchwald, 1989, pp.205–6,208,212.\n\nIndependently, on 12 January 1817, Young wrote to Arago (in English) noting that a transverse vibration would constitute a polarization, and that if two longitudinal waves crossed at a significant angle, they could not cancel without leaving a residual transverse vibration.Young, 1855, p.383. Young repeated this idea in an article published in a supplement to the Encyclopædia Britannica in February 1818, in which he added that Malus's law would be explained if polarization consisted in a transverse motion.\n\nThus Fresnel, by his own testimony, may not have been the first person to suspect that light waves could have a transverse component, or that polarized waves were exclusively transverse. And it was Young, not Fresnel, who first published the idea that polarization depends on the orientation of a transverse vibration. But these incomplete theories had not reconciled the nature of polarization with the apparent existence of unpolarized light; that achievement was to be Fresnel's alone.\n\nIn a note that Buchwald dates in the summer of 1818, Fresnel entertained the idea that unpolarized waves could have vibrations of the same energy and obliquity, with their orientations distributed uniformly about the wave-normal, and that the degree of polarization was the degree of non-uniformity in the distribution. Two pages later he noted, apparently for the first time in writing, that his phase-inversion rule and the non-interference of orthogonally-polarized beams would be easily explained if the vibrations of fully polarized waves were \"perpendicular to the normal to the wave\" — that is, purely transverse.Buchwald, 1989, pp.225–6; Fresnel, 1866–70, vol.1, pp.526–7,529.\n\nBut if he could account for lack of polarization by averaging out the transverse component, he did not also need to assume a longitudinal component. It was enough to suppose that light waves are purely transverse, hence always polarized in the sense of having a particular transverse orientation, and that the \"unpolarized\" state of natural or \"direct\" light is due to rapid and random variations in that orientation, in which case two coherent portions of \"unpolarized\" light will still interfere because their orientations will be synchronized.\n\nWe do now know exactly when Fresnel made this last step, because there is no relevant documentation from 1820 or early 1821Buchwald, 1989, p.226. (perhaps because he was too busy working on lighthouse-lens prototypes; see below). But he first published the idea in a paper on \"Calcul des teintes…\" (\"calculation of hues…\"), serialized in Arago's Annales for May, June, and July 1821. In the first installment, Fresnel described \"direct\" (unpolarized) light as \"the rapid succession of systems of waves polarized in all directions\",Buchwald, 1989, p.227; Fresnel, 1866–70, vol.1, p.612. and gave the modern explanation of chromatic polarization. In the second installment, he revealed the suspicion that he and Ampère had harbored since 1816, and the difficulty it raised.Buchwald, 1989, p.212; Fresnel, 1866–70, vol.1, pp.629–30. He continued:\n\nAccording to this new view, he wrote, \"the act of polarization consists not in creating transverse motions, but in decomposing them in two fixed, mutually perpendicular directions, and in separating the two components\".Buchwald, 1989, p.228; Fresnel, 1866–70, vol.1, p.636; emphasis added by Buchwald.\n\nWhile selectionists could insist on interpreting Fresnel's diffraction integrals in terms of discrete, countable rays, they could not do the same with his theory of polarization. For a selectionist, the state of polarization of a beam concerned the distribution of orientations over the population of rays, and that distribution was presumed to be static. For Fresnel, the state of polarization of a beam concerned the variation of a displacement over time. That displacement might be constrained but was not static, and rays were geometric constructions, not countable objects. The conceptual gap between the wave theory and selectionism had become unbridgeable.Cf. Buchwald, 1989, p.230.\n\nThe other difficulty posed by pure transverse waves, of course, was the apparent implication that the aether was an elastic solid (!) but, unlike other elastic solids, incapable of transmitting longitudinal waves. The wave theory was cheap on assumptions, but its latest assumption was expensive on credulity. If that assumption was to be widely entertained, its explanatory power would need to be impressive.\n\nPartial reflection (1821) \n\nIn the second installment of \"Calcul des teintes\" (June 1821), Fresnel supposed, by analogy with sound waves, that the density of the aether in a refractive medium was inversely proportional to the square of the wave velocity, and therefore directly proportional to the square of the refractive index. For reflection and refraction at the surface between two isotropic media of different indices, Fresnel decomposed the transverse vibrations into two perpendicular components, now known as the s and p components, which are parallel to the surface and the plane of incidence, respectively; in other words, the s and p components are respectively square and parallel to the plane of incidence.The s originally comes from the German senkrecht, meaning perpendicular (to the plane of incidence). For the s component, Fresnel supposed that the interaction between the two media was analogous to an elastic collision, and obtained a formula for what we now call the reflectivity: the ratio of the reflected intensity to the incident intensity. The predicted reflectivity was non-zero at all angles.Buchwald, 1989, pp.388–90; Fresnel, 1866–70, vol.1, p.643.\n\nThe third installment (July 1821) was a short \"postscript\" in which Fresnel announced that he had found, by a \"mechanical solution\", a formula for the reflectivity of the p component, which predicted that the reflectivity was zero at the Brewster angle. So polarization by reflection had been accounted for, with the proviso that the direction of vibration in Fresnel's model was perpendicular to the plane of polarization as defined by Malus. (On the ensuing controversy, see Plane of polarization.) For other angles of incidence, the technology of the time did not allow the s and p reflectivities to be measured accurately enough to test Fresnel's formulae. But the formulae could be rewritten in terms of what we now call the reflection coefficient: the signed ratio of the reflected amplitude to the incident amplitude. Then, if the plane of polarization of the incident ray was at 45° to the plane of incidence, the tangent of the corresponding angle for the reflected ray was obtainable from the ratio of the two reflection coefficients, and this angle could be measured. Fresnel measured it for a range of angles of incidence, for glass and water, and the agreement between the calculated and measured angles was better than 1.5° in all cases.Buchwald, 1989, pp.390–91; Fresnel, 1866–70, vol.1, pp.646–8.\n\nFresnel gave details of the \"mechanical solution\" in a memoir read to the Académie des Sciences on 7 January 1823. Conservation of energy was combined with continuity of the tangential vibration at the interface.Buchwald, 1989, pp.391–3; Whittaker, 1910, pp.133–5. The resulting formulae for the reflection coefficients and reflectivities became known as the Fresnel equations. The reflection coefficients for the s and p polarizations are most succinctly expressed as\n\n:r_s-\\frac{\\sin(i-r)}{\\sin(i+r)} and r_p\n\\frac{\\tan(i-r)}{\\tan(i+r)}\\,,\n\nwhere i and r are the angles of incidence and refraction.Whittaker, 1910, p.134; Fresnel, 1866–70, vol.1, pp.773,757. By allowing the coefficients to be complex, Fresnel even accounted for the different phase shifts of the s and p components due to total internal reflection.Buchwald, 1989, pp.393–4; Whittaker, 1910, pp.135–6.\n\nNowadays the Fresnel equations are extended to opaque media by using a complex refractive index. The equations are fundamental in predicting the appearance of objects under illumination — for example, in computer graphics (see Physically based rendering).\n\nCircular and elliptical polarization, optical rotation (1822) \n\nIn a memoir dated 9 December 1822, Fresnel coined the terms linear polarization (French: polarisation rectiligne) for the simple case in which the perpendicular components of vibration are in phase or 180° out of phase, circular polarization for the case in which they are of equal magnitude and a quarter-cycle (±90°) out of phase, and elliptical polarization for other cases in which the two components have a fixed amplitude ratio and a fixed phase difference. He then explained how optical rotation could be understood as a species of birefringence. Linearly-polarized light could be resolved into two circularly-polarized components rotating in opposite directions. If these components propagated at slightly different speeds, the phase difference between them — and therefore the direction of their linearly-polarized resultant — would vary continuously with distance.Buchwald, 1989, pp.230–32,442.\n\nThese concepts called for a redefinition of the distinction between polarized and unpolarized light. Before Fresnel, it was thought that polarization could vary in direction, and in degree (e.g., due to variation in the angle of reflection off a transparent body), and that it could be a function of color (chromatic polarization), but not that it could vary in kind. Hence it was thought that the degree of polarization was the degree to which the light could be suppressed by an analyzer with the appropriate orientation. Light that had been converted from linear to elliptical or circular polarization (e.g., by passage through a crystal lamina, or by total internal reflection) was described as partly or fully \"depolarized\" because of its behavior in an analyzer. After Fresnel, the defining feature of polarized light was that the perpendicular components of vibration had a fixed ratio of amplitudes and a fixed difference in phase. By that definition, elliptically or circularly polarized light is fully polarized although it cannot be fully suppressed by an analyzer alone.Cf. Buchwald, 1989, p.232. The conceptual gap between the wave theory and selectionism had widened again.\n\nTotal internal reflection (1817–23) \n\nBy 1817 it had been discovered by Brewster, but not adequately reported,Lloyd, 1834, p.368. that plane-polarized light was partly depolarized by total internal reflection if initially polarized at an acute angle to the plane of incidence. Fresnel rediscovered this effect and investigated it by including total internal reflection in a chromatic-polarization experiment. With the aid of his first theory of chromatic polarization, he found that the apparently depolarized light was a mixture of components polarized parallel and perpendicular to the plane of incidence, and that the total reflection introduced a phase difference between them.Darrigol, 2012, p.207. Choosing an appropriate angle of incidence (not yet exactly specified) gave a phase difference of 1/8 of a cycle (45°). Two such reflections from the \"parallel faces\" of \"two coupled prisms\" gave a phase difference of 1/4 of a cycle (90°). These findings were contained in a memoir submitted to the Académie on 10 November 1817 and read a fortnight later. An undated marginal note indicates that the two coupled prisms were later replaced by a single \"parallelepiped in glass\" — now known as a Fresnel rhomb.\n\nThis was the memoir whose \"supplement\", dated January 1818, contained the method of superposing sinusoidal functions and the restatement of Malus's law in terms of amplitudes. In the same supplement, Fresnel reported his discovery that optical rotation could be imitated by passing the polarized light through a Fresnel rhomb (still in the form of \"coupled prisms\"), followed by an ordinary birefringent lamina sliced parallel to its axis, with the axis at 45° to the plane of reflection of the Fresnel rhomb, followed by a second Fresnel rhomb at 90° to the first.Buchwald, 1989, pp.223,336; on the latter page, a \"prism\" means a Fresnel rhomb or equivalent.\n\nThe connection between optical rotation and birefringence was further described in 1822, in the memoir on elliptical and circular polarization. This was followed by the memoir on reflection, read in January 1823, in which Fresnel quantified the phase shifts in total internal reflection, and thence calculated the precise angle at which a Fresnel rhomb should be cut in order to convert linear polarization to circular polarization. For a refractive index of 1.51, there were two solutions: about 48.6° and 54.6°.\n\nDouble refraction \n\nBackground: Uniaxial and biaxial crystals; Biot's laws \n\nWhen light passes through a slice of calcite cut perpendicular to its optic axis, the difference between the propagation times of the ordinary and extraordinary waves has a second-order dependence on the angle of incidence. If the slice is observed in a highly convergent cone of light, that dependence becomes significant, so that a chromatic-polarization experiment will show a pattern of concentric rings. But most minerals, when observed in this manner, show a more complicated pattern of rings involving two foci and a lemniscate curve, as if they had two optic axes.Jenkins & White, 1976, pp.576–9 (§27.9, esp. Fig.27M). The two classes of minerals naturally become known as uniaxal and biaxal — or, in later literature, uniaxial and biaxial.\n\nIn 1813, Brewster observed the simple concentric pattern in \"beryl, emerald, ruby &c.\" The same pattern was later observed in calcite by Wollaston, Biot, and Seebeck.  Biot, assuming that the concentric pattern was the general case, tried to calculate the colors with his theory of chromatic polarization, and succeeded better for some minerals than for others. In 1818, Brewster belatedly explained why: seven of the twelve minerals employed by Biot had the lemniscate pattern, which Brewster had observed as early as 1812; and the minerals with the more complicated rings also had a more complicated law of refraction.Buchwald, 1989, pp.254–5,402.\n\nIn a uniform crystal, according to Huygens' theory, the secondary wavefront that expands from the origin in unit time is the ray-velocity surface — that is, the surface whose \"distance\" from the origin in any direction is the ray velocity in that direction. In calcite, this surface is two-sheeted, consisting of a sphere (for the ordinary wave) and an oblate spheroid (for the extraordinary wave) touching each other at opposite points of a common axis — touching at the north and south poles, as it were. But according to Malus's corpuscular theory of double refraction, the ray velocity was proportional to the reciprocal of that given by Huygens' theory, in which case the velocity law was of the form\n\n:v_o^{2\\!}-v_e^2 = k\\sin^2\\theta \\,,\n\nwhere v_o and v_e were the ordinary and extraordinary ray velocities according to the corpuscular theory, and \\theta was the angle between the ray and the optic axis.Cf. Buchwald, 1989, p.269. By Malus's definition, the plane of polarization of a ray was the plane of the ray and the optic axis if the ray was ordinary, or the perpendicular plane (containing the ray) if the ray was extraordinary. In Fresnel's model, the direction of vibration was normal to the plane of polarization. Hence, for the sphere (the ordinary wave), the vibration was along the lines of latitude (to continue the geographic analogy); and for the spheroid (the extraordinary wave), the vibration was along the lines of longitude.\n\nOn 29 March 1819,Grattan-Guinness, 1990, p.885. Biot presented a memoir in which he proposed simple generalizations of Malus's rules for a crystal with two axes, and reported that both generalizations seemed to be confirmed by experiment. For the velocity law, the squared sine was replaced by the product of the sines of the angles from the ray to the two axes (Biot's sine law). And for the polarization of the ordinary ray, the plane of the ray and the axis was replaced by the plane bisecting the dihedral angle between the two planes each of which contained the ray and one axis (Biot's dihedral law).Buchwald, 1989, pp.269,418. It appears that the dihedral law was also proposed separately at an earlier date (p.459, ref.1817). Biot's laws meant that a biaxial crystal with axes at a small angle, cleaved in the plane of those axes, behaved nearly like a uniaxial crystal at near-normal incidence; this was fortunate because gypsum, which had been used in chromatic-polarization experiments, is biaxial.Cf. Fresnel, 1822a, tr. Young, in Quarterly Journal of Science, Literature, and Art, Jul.–Dec.1828, at pp.[https://books.google.com/books?idN69MAAAAYAAJ&pg\nPA178 178–9].\n\nFirst memoir and supplements (1821–22) \n\nUntil Fresnel turned his attention to biaxial birefringence, it was assumed that one of the two refractions was ordinary, even in biaxial crystals.Buchwald, 1989, p.260. But, in a memoir submittedIn Fresnel's collected works (1866–70), a paper is said to have been \"presented\" (\"présenté\") if it was merely delivered to the Permanent Secretary of the Académie for witnessing or processing (cf. vol.1, p.487; vol.2, pp.261,308). In such cases this article prefers the generic word \"submitted\", to avoid the impression that the paper had a formal reading. on 19 November 1821,Printed in Fresnel, 1866–70, vol.2, pp.261–308. Fresnel reported two experiments on topaz showing that neither refraction was ordinary in the sense of satisfying Snell's law; that is, neither ray was the product of spherical secondary waves.Buchwald, 1989, pp.261–7.\n\nThe same memoir contained Fresnel's first attempt at the biaxial velocity law. For calcite, if we interchange the equatorial and polar radii of Huygens' oblate spheroid while preserving the polar direction, we obtain a prolate spheroid touching the sphere at the equator. A plane through the center/origin cuts this prolate spheroid in an ellipse whose major and minor semi-axes give the magnitudes of the extraordinary and ordinary ray velocities in the direction normal to the plane, and (said Fresnel) the directions of their respective vibrations. The direction of the optic axis is the normal to the plane for which the ellipse of intersection reduces to a circle. So, for the biaxial case, Fresnel simply replaced the prolate spheroid with a triaxial ellipsoid, which he called the \"ellipsoid of elasticity\", to be sectioned by a plane in the same way. In general there would be two planes passing through the center of the ellipsoid and cutting it in a circle, and the normals to these planes would give two optic axes. From the geometry, Fresnel deduced Biot's sine law (with the ray velocities replaced by their reciprocals).Buchwald, 1989, pp.268–72.\n\nThe \"ellipsoid of elasticity\" indeed gave the correct ray velocities, although the initial experimental verification was only approximate. But it did not give the correct directions of vibration, for the biaxial case or even for the uniaxial case, because the vibrations in Fresnel's model were tangential to the wavefront, which is not generally normal to the ray (for an extraordinary ray). This mistake was corrected in an \"extract\" that Fresnel read to the Académie a week later, on 26 November. Starting with Huygens' spheroid, Fresnel obtained the 4th-degree \"surface of elasticity\" which, when sectioned by a plane as above, would yield the wave-normal velocities for a wavefront in that plane, together with their vibration directions. For the biaxial case, he generalized the surface to allow three unequal principal dimensions. But he retained the former \"ellipsoid of elasticity\" as an approximation, from which he deduced Biot's dihedral law.Buchwald, 1989, pp.274–9.\n\nFresnel's initial derivation of the \"surface of elasticity\" had been purely geometric, and not deductively rigorous. His first attempt at a mechanical derivation, contained in a \"supplement\" dated 13 January 1822, assumed that (i) there were three mutually perpendicular directions in which a displacement produced a reaction in the same direction, (ii) the reaction was otherwise a linear function of the displacement, and (iii) the radius of the surface in any direction was the square root of the component, in that direction, of the reaction to a unit displacement in that direction. The last assumption recognized the requirement that if a wave was to maintain a fixed direction of propagation and a fixed direction of vibration, the reaction must not be outside the plane of those two directions.Buchwald, 1989, pp.279–80.\n\nIn the same supplement, Fresnel considered how he might find, for the biaxial case, the secondary wavefront that expands from the origin in unit time — that is, the surface that reduces to Huygens' sphere and spheroid in the uniaxial case. He noted that this \"wave surface\" (surface de l'onde) is tangential to all possible plane wavefronts that could have crossed the origin one unit of time ago, and he listed the mathematical conditions that it must satisfy. But he doubted the feasibility of deriving the surface from those conditions.Fresnel, 1866–70, vol.2, pp.340,361–3; Buchwald, 1989, pp.281–3. The derivation of the \"wave surface\" from its tangent planes was eventually accomplished by Ampère in 1828 (Lloyd, 1834, pp.386–7; Darrigol, 2012, p.218; Buchwald, 1989, pp.281,457).\n\nIn a \"second supplement\",Fresnel, 1866–70, vol.2, pp.369–442. Fresnel eventually exploited two related facts: (i) the \"wave surface\" was also the ray-velocity surface, which could be obtained by sectioning what he had mistakenly called the \"ellipsoid of elasticity\"; and (ii) the \"wave surface\" intersected each plane of symmetry of the ellipsoid in two curves: a circle and an ellipse. Thus he found that the \"wave surface\" is described by the 4th-degree equation\n\n:r^2\\big(a^2x^{2\\!}+ b^2y^{2\\!}+ c^2z^2\\big) - a^2\\big(b^{2\\!} + c^2\\big)x^2 - b^2\\big(c^{2\\!} + a^2\\big)y^2 - c^2\\big(a^{2\\!} + b^2\\big)z^2 + a^2b^2c^2 =\\, 0\\,,\n\nwhere \\,r^2 = x^{2\\!} + y^{2\\!} + z^2,\\, and \\,a,b,c\\, are the propagation speeds in directions normal to the coordinate axes for vibrations along the axes (the ray and wave-normal speeds being the same in those special cases).Buchwald, 1989, pp.283–5; Darrigol, 2012, pp.217–18; Fresnel, 1866–70, vol.2, pp.386–8. Later commentators put the equation in the more compact and memorable form\n\n:\\frac{x^2}{r^2-a^2} + \\frac{y^2}{r^2-b^2} + \\frac{z^2}{r^2-c^2} \\,=\\, 1\\,.\n\nEarlier in the \"second supplement\", Fresnel modeled the aether as an array of point-masses and found that the force-displacement relation was described by a symmetric matrix, confirming the existence of three mutually perpendicular axes on which the displacement produced a parallel force.Grattan-Guinness, 1990, pp.891–2; Fresnel, 1866–70, vol.2, pp.371–9. Later in the document, he noted that in a biaxial crystal, unlike a uniaxial crystal, the directions in which there is only one wave-normal velocity are not the same as those in which there is only one ray velocity.Buchwald, 1989, pp.285–6; Fresnel, 1866–70, vol.2, p.396. Nowadays we refer to the former directions as the optic axes or binormal axes, and the latter as the ray axes or biradial axes (see Birefringence).\n\nFresnel's \"second supplement\" was signed on 31 March 1822 and submitted the next day — less than a year after the publication of his pure-transverse-wave hypothesis, and just less than a year after the demonstration of his prototype eight-panel lighthouse lens (see below).\n\nSecond memoir (1822–24) \n\nFresnel still wanted a mechanical foundation for the ray-velocity surface and Biot's dihedral law. He attended to these matters in his \"second memoir\" on double refraction, published in the Recueils of the Académie des Sciences for 1824, which were not actually printed until 1827 — the year of his death. Having confirmed the three perpendicular axes on which a displacement produced a parallel reaction, and thence constructed the surface of elasticity, he showed that Biot's dihedral law is exact provided that the binormals are taken as the optic axes, and the wave-normal direction as the direction of propagation.Buchwald, 1989, pp.286–7,447.\n\nFresnel's theory of the aether was a forerunner of the theory of transverse waves in non-isotropic elastic solids. His theory was not yet dynamically rigorous; for example, it considered only the displacement of one particle while all others were fixed, and simply assumed that the relation between the stiffness and the wave-normal velocity was analogous to that for longitudinal sound waves. But it was enough to enable the wave theory to do what selectionist theory could not: generate testable formulae covering a comprehensive range of optical phenomena, from mechanical assumptions.Buchwald, 1989, p.288.\n\nPhotoelasticity, multiple-prism experiments (1822) \n\nIn 1815, Brewster reported that colors appear when a slice of isotropic material, placed between crossed polarizers, is mechanically stressed. Brewster himself immediately and correctly attributed this phenomenon to stress-induced birefringence — now known as photoelasticity.\n\nIn a memoir read in September 1822, Fresnel announced that he had verified Brewster's diagnosis more directly, by compressing a combination of glass prisms so severely that one could actually see a double image through it. In his experiment, Fresnel lined up seven 45°-90°-45° prisms, short side to short side, with their 90° angles pointing in alternating directions. Two half-prisms were added at the ends to make the whole assembly rectangular. The prisms were separated by thin films of turpentine (térébenthine) to suppress internal reflections, allowing a clear line of sight along the row. When the four prisms with similar orientations were compressed in a vise, from apex to base across the line of sight, an object viewed through the assembly produced two images with perpendicular polarizations, with an apparent spacing of 1.5mm at one metre.Whewell, 1857, pp.355–6.\n\nAt the end of that memoir, Fresnel predicted that one could use an analogous arrangement of prisms, without compression, to verify that optical rotation is a form of birefringence. If the prisms were cut from monocrystalline quartz with their optic axes aligned along the row, and with alternating directions of optical rotation, an object seen by looking along the common optic axis would give two images, which would seem unpolarized if viewed through an analyzer alone; but if viewed through a Fresnel rhomb, they would be polarized at ±45° to the plane of reflection (because they would initially be circularly polarized in opposite directions). In the memoir of December 1822, in which he introduced the term circular polarization, he reported that he had confirmed this prediction. To obtain a visible separation of the images, he needed only one 14°-152°-14° prism and two half-prisms; he merely remarked in passing that one could increase the separation by increasing the number of prisms.Fresnel, 1866–70, vol.1, pp.737–9.  Cf. Whewell, 1857, p.356–8; Jenkins & White, 1976, pp.589–90.\n\nReception \n\nFor the supplement to Riffault's translation of Thomson's System of Chemistry, Fresnel was chosen to contribute the article on light. The resulting 137-page essay, titled De la Lumière (On Light),Fresnel, 1822a. was apparently finished in June 1821 and published by February 1822.Grattan-Guinness, 1990, p.884. With sections covering the nature of light, diffraction, thin-film interference, reflection and refraction, double refraction and polarization, chromatic polarization, and modification of polarization by reflection, it made a comprehensive case for the wave theory to a readership that was not restricted to physicists.Cf. Frankel, 1976, p.169.\n\nTo examine Fresnel's first memoir and supplements on double refraction, the Académie des Sciences appointed Ampère, Arago, Fourier, and Poisson.Fresnel, 1866–70, vol.2, pp.261n,369n. Their report,Printed in Fresnel, 1866–70, vol.2, pp.459–64. of which Arago was clearly the main author, was delivered at the meeting of 19 August 1822. Then, in the words of Émile Verdet, as translated by Ivor Grattan-Guinness:\n\nWhether Laplace was announcing his conversion to the wave theory — at the age of 73 — is uncertain. Grattan-Guinness entertained the idea.Grattan-Guinness, 1990, p.898. Buchwald, noting that Arago failed to explain that the \"ellipsoid of elasticity\" did not give the correct planes of polarization, suggests that Laplace may have merely regarded Fresnel's theory as a successful generalization of Malus's ray-velocity law, embracing Biot's laws.Buchwald, 1989, pp.289–90.\n\nIn the following year, Poisson, who did not sign Arago's report, disputed the possibility of transverse waves in the aether. Starting from assumed equations of motion of a fluid medium, he noted that they did not give the correct results for partial reflection and double refraction — as if that were Fresnel's problem rather than his own — and that the predicted waves, even if they were initially transverse, became more longitudinal as they propagated. In reply Fresnel noted, inter alia, that the equations in which Poisson put so much faith did not even predict viscosity. The implication was clear: given that the behavior of light had not been satisfactorily explained except by transverse waves, it was not the responsibility of the wave-theorists to abandon transverse waves in deference to pre-conceived notions about the aether; rather, it was the responsibility of the aether modelers to produce a model that accommodated transverse waves.Frankel, 1976, pp.170–71. According to Eugene Frankel, Poisson eventually accepted the wave theory in the late 1830s.Frankel, 1976, p.173, citing Fresnel, 1866–70, vol.1, p.lxxxix, note2.  But cf. Worrall, 1989, p.140.\n\nAmong the French, Poisson's reluctance was an exception. According to Frankel, \"in Paris no debate on the issue seems to have taken place after 1825. Indeed, almost the entire generation of physicists and mathematicians who came to maturity in the 1820s — Pouillet, Savart, Lamé, Navier, Liouville, Cauchy — seem to have adopted the theory immediately.\" Fresnel's other prominent French opponent, Biot, appeared to take a neutral position in 1830, and eventually accepted the wave theory — possibly by 1846 and certainly by 1858.Frankel, 1976, pp.173–4.\n\nIn 1826, the British astronomer John Herschel addressed three questions to Fresnel concerning double refraction and partial reflection, and their relation to polarization. The resulting article by Herschel, titled simply \"Light\", was highly sympathetic to the wave theory, although not entirely free of selectionist language. It was circulating privately by 1828 and was published in the Encyclopædia Metropolitana in 1830.Buchwald, 1989, pp.291–6; Darrigol, 2012, pp.220–21,303. Meanwhile, Young's translation of Fresnel's De la Lumière was published in installments from 1827 to 1829.Fresnel, 1822a; Kipnis, 1991, pp.227–8. George Biddell Airy, the former Lucasian Professor at Cambridge and future Astronomer Royal, unreservedly accepted the wave theory by 1831.Buchwald, 1989, p.296. In 1834 he famously calculated the diffraction pattern of a circular aperture from the wave theory, thereby explaining the limited angular resolution of a perfect telescope (see Airy disk). By the end of the 1830s, the only prominent British physicist who held out against the wave theory was Brewster, whose objections included the difficulty of explaining photochemical effects and (in his opinion) dispersion.Darrigol, 2012, pp.222–3,248.\n\nA German translation of De la Lumière was published in installments in 1825 and 1828. The wave theory was adopted by Fraunhofer in the early 1820s and by Franz Ernst Neumann in the 1830s, and then began to find favor in German textbooks.Kipnis, 1991, pp.225,227; Darrigol, 2012, pp.223,245.\n\nHence, in 1850, when Foucault and Fizeau found by experiment that light travels more slowly in water than in air, in accordance with the wave explanation of refraction and contrary to the corpuscular explanation, the result came as no surprise.Darrigol, 2012, p.223.\n\nLighthouses and the Fresnel lens \n\nPrior art \n\nFresnel was not the first person to focus a lighthouse beam using a lens. That distinction apparently belongs to the London glass-cutter Thomas Rogers, who proposed the idea to Trinity House in 1788. The first Rogers lenses, 53cm in diameter and 14cm thick at the center, were installed at the Old Lower Lighthouse at Portland Bill in 1789.Levitt, 2013, p.57. Further samples followed at Howth Baily, North Foreland, and at least four other locations. But much of the light was wasted by absorption in the glass.\n\nNor was Fresnel the first to suggest replacing a convex lens with a series of concentric annular prisms, to reduce weight and absorption. In 1748, Count Buffon proposed grinding such prisms as steps in a single piece of glass. In 1790 (although secondary sources give the date as 1773 or 1788), the Marquis de Condorcet suggested that it would be easier to make the annular sections separately and assemble them on a frame; but even that was impractical at the time.Levitt, 2013, p.71. These designs were intended not for lighthouses, but for burning glasses. Brewster, however, proposed a system similar to Condorcet's in 1811, and by 1820 was advocating its use in British lighthouses.\n\nPrototypes \n\nMeanwhile, on 21 June 1819, Fresnel was temporarily seconded by the Commission des Phares (Commission of Lighthouses) on the recommendation of Arago (a member of the Commission since 1813), to review possible improvements in lighthouse illumination.Levitt, 2013, pp.51,53; Fresnel, 1866–70, vol.1, p.xcvii. The Commission had been established by Napoleon in 1811, and placed under the Corps des Ponts — Fresnel's employer.Levitt, 2013, pp.49–50.\n\nOn 29 August 1819, unaware of the Buffon-Condorcet-Brewster proposal, Fresnel presented his first report, in which he recommended what he called lentilles à échelons (lenses by steps) to replace the reflectors then in use, which reflected only about half of the incident light.Levitt, 2013, pp.56,58. One of the assembled commissioners, Jacques Charles, recalled Buffon's suggestion. Fresnel was disappointed to discover that he had again \"broken through an open door\". But, whereas Buffon's version was biconvex and in one piece, Fresnel's was plano-convex and made of multiple prisms for easier construction. With an official budget of 500 francs, Fresnel approached three manufacturers. The third, François Soleil, found a way to remove defects by reheating and remolding the glass. Arago assisted Fresnel with the design of a modified Argand lamp with concentric wicks (a concept that Fresnel attributed to Count RumfordFresnel, 1822b, p.11.), and accidentally discovered that fish glue was heat-resistant, making it suitable for use in the lens. The prototype, with a lens panel 55cm square, containing 97 polygonal (not annular) prisms, was finished in March 1820 — and so impressed the Commission that Fresnel was asked for a full eight-panel version. Completed a year later, largely at Fresnel's personal expense, this model had panels 72cm square. In a public spectacle on the evening of 13 April 1821, it was demonstrated by comparison with the most recent reflectors, which it suddenly rendered obsolete.Levitt, 2013, pp.59–66.\n\n(Fresnel acknowledged the British lenses and Buffon's invention in a memoir published in 1822.Fresnel, 1822b, pp.2–4. The date of that memoir may be the source of the claim that Fresnel's lighthouse advocacy began two years later than Brewster's; but the text makes it clear that Fresnel's involvement began no later than 1819.Fresnel, 1822b, p.1.)\n\nFresnel's innovations \n\nFresnel's next lens was a rotating apparatus with eight \"bull's-eye\" panels, made in annular arcs by Saint-Gobain, giving eight rotating beams — to be seen by mariners as a periodic flash. Above and behind each main panel was a smaller, sloping bull's-eye panel of trapezoidal outline with trapezoidal elements. This refracted the light to a sloping plane mirror, which then reflected it horizontally, 7 degrees ahead of the main beam, increasing the duration of the flash.Fresnel, 1822b, pp.13,25. Below the main panels were 128 small mirrors arranged in four rings, stacked like the slats of a louver or Venetian blind. Each ring, shaped like a frustum of a cone, reflected the light to the horizon, giving a fainter steady light between the flashes. The official test, conducted on the unfinished Arc de Triomphe on 20 August 1822, was witnessed by the Commission — and by Louis  and his entourage — from 32km away. The apparatus was stored at Bordeaux for the winter, and then reassembled at Cordouan Lighthouse under Fresnel's supervision. On 25 July 1823, the world's first lighthouse Fresnel lens was lit.Levitt, 2013, pp.72–3. It was about this time that Fresnel started coughing up blood.Levitt, 2013, p.97.\n\nIn May 1824, Fresnel was promoted to Secretary of the Commission des Phares, becoming the first member of that body to draw a salary.Levitt, 2013, p.82. He was also an examiner (not a teacher) at the École Polytechnique since 1821; but poor health, long hours during the examination season, and anxiety about judging others induced him to resign that post in late 1824, to save his energy for his lighthouse work.Grattan-Guinness, 1990, pp.914–15, citing Young, 1855, p.399; Arago, 1857, pp.467,470; Boutry, 1948, pp.601–2.\n\nIn the same year he designed the first fixed lens — for spreading light evenly around the horizon while minimizing waste above or below. This had the familiar reflecting (catoptric) rings above and below the refracting (dioptric) parts. But the curved refracting surfaces were segments of toroids about a common vertical axis, so that the dioptric panel looked like a cylindrical drum and the entire apparatus looked like a beehive.\n\nIn 1825 he unveiled the Carte des Phares (Lighthouse Map), calling for a system of 51 lighthouses plus smaller harbor lights, in a hierarchy of lens sizes (called orders, the first order being the largest), with different characteristics to facilitate recognition: a constant light (from a fixed lens), one flash per minute (from a rotating lens with eight panels), and two per minute (sixteen panels). On 1st February 1825, the second lighthouse Fresnel lens entered service: a third-order fixed lens at Dunkirk.Levitt, 2013, pp.83–4.\n\nAlso in 1825, Fresnel extended his fixed design by adding a rotating array outside the fixed array. Each panel of the rotating array refracted part of the fixed light from a horizontal fan into a narrow beam.\n\nTo reduce the loss of light in the reflecting elements, Fresnel proposed to replace each mirror with a catadioptric prism, through which the light would travel by refraction through the first surface, then total internal reflection off the second surface, then refraction through the third surface.Levitt, 2013, pp.79–80. The result was the lighthouse lens as we now know it. In 1826 he assembled a small model for use on the Canal Saint-Martin, but he did not live to see a full-sized version.\n\nThe first large catadioptric lenses were made in 1842 for the lighthouses at Gravelines and Île Vierge; these were fixed third-order lenses whose catadioptric rings (made in segments) were one metre in diameter. The first-order Skerryvore lens, installed in 1844, was only partly catadioptric; it was similar to the Cordouan lens except that the lower slats were replaced by French-made catadioptric prisms, while mirrors were retained at the top. The first fully catadioptric first-order lens, installed at Ailly in 1852, also gave eight rotating beams plus a fixed light at the bottom; but its top section had eight catadioptric panels focusing the light about 4 degrees ahead of the main beams, in order to lengthen the flashes. The first fully catadioptric lens with purely revolving beams — also of first order — was installed at Saint-Clément-des-Baleines in 1854, and marked the completion of Fresnel's original Carte des Phares.Levitt, 2013, pp.108–10, 113–16.\n\nLater developments \n\nProduction of one-piece stepped lenses (roughly as envisaged by Buffon) eventually became profitable. By the 1870s, in the United States, such lenses were made of pressed glass and used with small lights on ships and piers. Similar lenses are used in Fresnel lanterns for stage lighting. Lenses with finer steps serve as condensers in overhead projectors. Still finer steps can be found in low-cost plastic \"sheet\" magnifiers.\n\nHonors \n\nFresnel was elected to the Société Philomathique de Paris in April 1819,Kipnis, 1991, p.217. and in 1822 became one of the editors of the Société's Bulletin des Sciences.Frankel, 1976, p.172. As early as May 1817, at Arago's suggestion, Fresnel applied for membership of the Académie des Sciences, but received only one vote. The successful candidate on that occasion was Joseph Fourier. In November 1822, Fourier's elevation to Permanent Secretary of the Académie created a vacancy in the physics section, which was filled in February 1823 by Pierre Louis Dulong, with 36 votes to Fresnel's 20. But in May 1823, after another vacancy was left by the death of Jacques Charles, Fresnel's election was unanimous.Grattan-Guinness, 1990, pp.861,913–14; Arago, 1857, p.408. In 1824,Levitt, 2013, p.77. Fresnel was made a chevalier de la Légion d'honneur (Knight of the Legion of Honour).\n\nMeanwhile, in Britain, the wave theory was yet to take hold; Fresnel wrote to Thomas Young in November 1824, saying in part:\n\nBut \"the praise of English scholars\" soon followed. On 9 June 1825, Fresnel was made a Foreign Member of the Royal Society of London. In 1827 he was awarded the Society's Rumford Medal for the year 1824, \"For his Development of the Undulatory Theory as applied to the Phenomena of Polarized Light, and for his various important discoveries in Physical Optics.\"\n\nThe monument to Fresnel at his birthplace (see above) was dedicated on 14 September 1884 with a speech by , Permanent Secretary of the Académie des Sciences.  \"\" is among the 72 names embossed on the Eiffel Tower (on the south-east side, fourth from the left). In the 19th century, as every lighthouse in France acquired a Fresnel lens, every one acquired a bust of Fresnel, seemingly watching over the coastline that he had made safer.Levitt, 2013, p.233. The lunar features Promontorium Fresnel and Rimae Fresnel were later named after him.\n\nDecline and death \n\nFresnel's health, which had always been poor, deteriorated in the winter of 1822-3, increasing the urgency of his original research, and causing him to turn down an invitation from Young to write an article on double refraction for the Encyclopædia Britannica.Levitt, 2013, pp.75–6. The memoirs on circular and elliptical polarization and optical rotation, and on the detailed derivation of the Fresnel equations and their application to total internal reflection, date from this period. In the spring he recovered enough, in his own view, to supervise the lens installation at Cordouan. Soon afterwards, it became clear that his condition was tuberculosis.\n\nIn 1824 he was advised that if he wanted to live longer, he needed to scale back his activities. Perceiving his lighthouse work to be his most important duty, he resigned as an examiner at the École Polytechnique, and closed his scientific notebooks. His last note to the Académie, read on 13 June 1825, described the first radiometer and attributed the observed repulsive force to a temperature difference.Boutry, 1948, pp.601–2; Fresnel, 1866–70, vol.2, pp.667–72. Although his fundamental research ceased, his advocacy did not; as late as August or September 1826, he found the time to answer Herschel's queries on the wave theory.Fresnel, 1866–70, vol.2, pp.647–60. It was Herschel who recommended Fresnel for the Royal Society's Rumford Medal.Boutry, 1948, p.603.\n\nFresnel's cough worsened in the winter of 1826-7, leaving him too ill to return to Mathieu in the spring. In early June he was carried to Ville-d'Avray, 12km west of Paris. There his mother joined him. On 6 July, Arago arrived to deliver the Rumford Medal. Sensing Arago's distress, Fresnel whispered that \"the most beautiful crown means little, when it is laid on the grave of a friend.\" Fresnel did not have the strength to reply to the Royal Society. He died eight days later, on Bastille Day.Levitt, 2013, p.98; Arago, 1857, p.470; Boutry, 1948, pp.602–3.\n\nHe is buried at Père Lachaise Cemetery, Paris. The inscription on his headstone is partly eroded away; the legible part says, when translated, \"To the memory of Augustin Jean Fresnel, member of the Institute of France.\"\n\nPosthumous publications \n\nFresnel's \"second memoir\" on double refraction was not printed until 1827, the year of his death. Until then, the best published source on his work on double refraction was an extract of that memoir, printed in 1822.Buchwald, 1989, p.289. His final treatment of partial reflection and total internal reflection, read to the Académie in January 1823, was thought to be lost until it was rediscovered among the papers of the deceased Joseph Fourier (1768–1830), and was printed in 1831. Until then, it was known chiefly through an extract printed in 1823 and 1825. Most of Fresnel's writings on polarized light before 1821 — including his first theory of chromatic polarization (submitted 7 October 1816) and the crucial \"supplement\" of January 1818 — were not published in full until his Oeuvres complètes (\"complete works\") began to appear in 1866.Buchwald, 1989, pp.222,238,461–2. The \"supplement\" of July 1816, proposing the \"efficacious ray\" and reporting the famous double-mirror experiment, met the same fate,Grattan-Guinness, 1990, p.861. as did the \"first memoir\" on double refraction.Whittaker, 1910, p.125n.\n\nPublication of Fresnel's collected works was itself delayed by the deaths of successive editors. The task was initially entrusted to Félix Savary, who died in 1841. It was restarted twenty years later by the Ministry of Public Instruction. Of the three editors eventually named in the Oeuvres, Sénarmont died in 1862, Verdet in 1866, and Léonor Fresnel in 1869, by which time only two of the three volumes had appeared.Boutry, 1948, pp.603–4; Fresnel, 1866–70, vol.1, pp.i–vii. At the beginning of vol.3 (1870), the completion of the project is described in a long footnote by \"J. Lissajous.\"\n\nNot included in the OeuvresSilliman, 2008, p.171. are two short notes by Fresnel on magnetism, which were discovered among Ampère's manuscripts. In response to Ørsted's discovery of electromagnetism in 1820, Ampère initially supposed that the field of a permanent magnet was due to a macroscopic circulating current. Fresnel suggested instead that there was a microscopic current circulating around each particle of the magnet. In his first note, he argued that microscopic currents, unlike macroscopic currents, would explain why a hollow cylindrical magnet does not lose its magnetism when cut longitudinally. In his second note, dated 5 July 1821, he further argued that a macroscopic current had the counterfactual implication that a permanent magnet should be hot, whereas microscopic currents circulating around the molecules might avoid the heating mechanism. He was not to know that the fundamental units of permanent magnetism are even smaller than molecules (see Electron magnetic moment). The two notes, together with Ampère's acknowledgment, were eventually published in 1885.\n\nLost works \n\nFresnel's essay Rêveries of 1814 has not survived.Buchwald, 1989, p.116. While its content would have been interesting to historians, its quality may perhaps be gauged from the fact that Fresnel himself never referred to it in his maturity.Boutry, 1948, p.593. Moreover, contrary to Boutry, two footnotes in the Oeuvres allege that Fresnel himself consigned the Rêveries to oblivion (Fresnel, 1866–70, vol.1, pp.xxix–xxx, note 4, and p.6n).\n\nMore disturbing is the fate of a long article that Fresnel wrote in 1825, to be translated for the new English journal European Review. The journal failed before Fresnel's contribution could be published. Fresnel unsuccessfully tried to recover the manuscript, and the editors of his collected works were unable to find it. According to Grattan-Guinness, the article was \"apparently similar\" to the essay De la Lumière of 1821/22. But Fresnel's theories on polarization, total internal reflection, and double refraction had developed since then. Together, the circumstances suggest that the most comprehensive defense of the wave theory of light, by its most influential proponent, has been lost.\n\nUnfinished business \n\nAether drag and aether density \n\nIn 1810, Arago found experimentally that the degree of refraction of starlight does not depend on the direction of the earth's motion relative to the line of sight. In 1818, Fresnel showed that this result could be explained by the wave theory,Cf. Darrigol, 2012, pp.258–60. on the hypothesis that if an object with refractive index n moved at velocity v relative to the external aether (taken as stationary), then the velocity of light inside the object gained the additional component \\,v(1-1/n^2). He supported that hypothesis by supposing that if the density of the external aether was taken as unity, the density of the internal aether was n^2, of which the excess, namely \\,n^2{-}1\\,, was dragged along at velocity v, whence the average velocity of the internal aether was \\,v(1-1/n^2). The factor in parentheses, which Fresnel originally expressed in terms of wavelengths,Fresnel, 1866–70, vol.2, pp.627–36. became known as the Fresnel drag coefficient. (See Aether drag hypothesis.)\n\nIn his analysis of double refraction, Fresnel supposed that the different refractive indices in different directions within the same medium were due to a directional variation in elasticity, not density (because the concept of mass per unit volume is not directional). But in his treatment of partial reflection, he supposed that the different refractive indices of different media were due to different aether densities, not different elasticities. The latter decision is puzzling in the context of double refraction, but makes sense in the earlier context of aether drag.\n\nIn 1846, George Gabriel Stokes pointed out that there was no need to divide the aether inside a moving object into two portions; all of it could be considered as moving at a common velocity. Then, if the aether was conserved while its density changed in proportion to n^2, the resulting velocity of the aether inside the object was equal to Fresnel's additional velocity component.Whittaker, 1910, p.117.\n\nConversely, Fresnel could have started with the required additional velocity component, equated it to aether drag, combined that with conservation of aether, and arrived at the relation between refractive index and aether density, thereby justifying his choice in the case of partial reflection.\n\nDispersion \n\nThe analogy between light waves and transverse waves in elastic solids does not predict dispersion — that is, the frequency-dependence of the speed of propagation, which enables prisms to produce spectra and causes lenses to suffer from chromatic aberration. Fresnel, in De la Lumière and in the second supplement to his first memoir on double refraction, suggested that dispersion could be accounted for if the particles of the medium exerted forces on each other over distances that were significant fractions of a wavelength.Darrigol, 2012, p.246; Buchwald, 1989, pp.307–8; Fresnel, 1822a, tr. Young, in Quarterly Journal of Science, Literature, and Art, Jan.–Jun.1828, at pp.[https://books.google.com/books?idSbJMAAAAYAAJ&pg\nPA213 213–15].  Whittaker, 1910, p.132; Fresnel, 1866–70, vol.2, p.438. Later, more than once, Fresnel referred to the demonstration of this result as being contained in a note appended to his second memoir on double refraction. But no such note appeared in print,Lloyd, 1834, p.316. and the relevant manuscripts found after his death showed only that, around 1824, he was comparing refractive indices measured by Fraunhofer with a theoretical formula, the meaning of which was not fully explained.Fresnel, 1866–70, vol.1, p.xcvi. One obvious possibility is that the explanation was given in the missing note.\n\nIn the 1830s, Fresnel's suggestion was taken up by Cauchy, Powell, and Kelland, and it was indeed found to be tolerably consistent with the variation of refractive indices with wavelength over the visible spectrum, for a variety of transparent media (see Cauchy's equation).Whewell, 1857, pp.365–7; Darrigol, 2012, pp.246–9. These investigations were enough to show that the wave theory was at least compatible with dispersion. However, if the model of dispersion was to be accurate over a wider range of frequencies, it needed to be modified so as to take account of resonances within the medium (see Sellmeier equation).Darrigol, 2012, p.252.\n\nConical refraction \n\nThe analytical complexity of Fresnel's derivation of the ray-velocity surface was an implicit challenge to find a shorter path to the result. This was answered by James MacCullagh in 1830, and by William Rowan Hamilton in 1832.Lloyd, 1834, pp.387–8.\n\nHamilton went further, establishing two properties of the surface that Fresnel, in the short time given to him, had overlooked: (i) at each of the four points where the inner and outer sheets of the surface make contact, the surface has a tangent cone (tangential to both sheets), hence a cone of normals, indicating that a cone of wave-normal directions corresponds to a single ray-velocity vector; and (ii) around each of these points, the outer sheet has a circle of contact with a tangent plane, indicating that a cone of ray directions corresponds to a single wave-normal velocity vector. As Hamilton noted, these properties respectively imply that (i) a narrow beam propagating inside the crystal in the direction of the single ray velocity will, on exiting the crystal through a flat surface, break into a hollow cone (external conical refraction), and (ii) a narrow beam striking a flat surface of the crystal in the appropriate direction (corresponding to that of the single internal wave-normal velocity) will, on entering the crystal, break into a hollow cone (internal conical refraction).Lloyd, 1834, p.389.\n\nThus a new pair of phenomena, qualitatively different from anything previously observed or suspected, had been predicted by mathematics as consequences of Fresnel's theory. The prompt experimental confirmation of those predictions by Humphrey Lloyd brought Hamilton a prize that had never come to Fresnel: immediate fame.\n\nLegacy \n\nWithin a century after Fresnel's initial proposal, more than 10,000 lights with Fresnel lenses marked coastlines around the world.Levitt, 2013, p.19. The numbers of lives saved can only be guessed at. Concerning the other benefits, the science historian Theresa H. Levitt has remarked:\n\nIn the history of physical optics, Fresnel's successful revival of the wave theory nominates him as the pivotal figure between Newton, who held that light consisted of corpuscles, and Maxwell, who established that light waves are electromagnetic. Whereas Einstein described Maxwell's work as \"the most profound and the most fruitful that physics has experienced since the time of Newton,\" commentators of the era between Fresnel and Maxwell made similarly strong statements about Fresnel:\n\n* MacCullagh, as early as 1830, wrote that Fresnel's mechanical theory of double refraction \"would do honour to the sagacity of Newton\".\n\n* Lloyd, in his Report on the progress and present state of physical optics (1834) for the British Association for the Advancement of Science, surveyed previous knowledge of double refraction and declared:The theory of Fresnel to which I now proceed,— and which not only embraces all the known phenomena, but has even outstripped observation, and predicted consequences which were afterwards fully verified,— will, I am persuaded, be regarded as the finest generalization in physical science which has been made since the discovery of universal gravitation.Lloyd, 1834, p.382.In 1841 Lloyd published his Lectures on the Wave-theory of Light, in which he described Fresnel's transverse-wave theory as \"the noblest fabric which has ever adorned the domain of physical science, Newton's system of the universe alone excepted.\"\n\n* William Whewell, in all three editions of his History of the Inductive Sciences (1837, 1847, and 1857), at the end of Book , compared the histories of physical astronomy and physical optics and concluded:\n\nWhat Whewell called the \"true theory\" has since undergone two major revisions. The first, by Maxwell, specified the physical fields whose variations constitute the waves of light. The second, initiated by Einstein's explanation of the photoelectric effect, supposed that the energy of light waves was divided into quanta, which were eventually identified with particles called photons. But photons did not exactly correspond to Newton's corpuscles; for example, Newton's explanation of ordinary refraction required the corpuscles to travel faster in media of higher refractive index, which photons do not. Neither did photons displace waves; rather, they led to the paradox of wave–particle duality.\n\nAlthough Fresnel did not know that light waves are electromagnetic, he managed to construct the world's first coherent theory of light. In retrospect, this shows that his methods are applicable to multiple types of waves. And although light is now known to have both wavelike and particle-like aspects, it is the wavelike aspect that more easily explains the phenomena studied by Fresnel. In these respects, Fresnel's theory has stood the test of time, and Whewell's premature triumphalism contains an abiding truth.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Augustin-Jean Fresnel" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=1141" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Augustin-Jean Fresnel (, ;; 10 May 1788 – 14 July 1827) was a French civil engineer and physicist whose research in optics led to the almost unanimous acceptance of the wave theory of light, excluding any remnant of Newton's corpuscular theory, from the late 1830sDarrigol, 2012, pp.220–23. until the end of the 19th century.\n\nBut he is perhaps better known for inventing the catadioptric (reflective/refractive) Fresnel lens and for pioneering the use of \"stepped\" lenses to extend the visibility of lighthouses, saving unknown numbers of lives at sea. The simpler dioptric (purely refractive) stepped lens, first proposed by Count Buffon and independently reinvented by Fresnel, is used in screen magnifiers and in condenser lenses for overhead projectors.\n\nBy expressing Huygens' principle of secondary waves and Young's principle of interference in quantitative terms, and supposing that simple colors consist of sinusoidal waves, Fresnel gave the first satisfactory explanation of diffraction by straight edges, including the first satisfactory wave-based explanation of rectilinear propagation.Darrigol, 2012, p.205. Part of his argument was a proof that the addition of sinusoidal functions of the same frequency but different phases is analogous to the addition of forces with different directions. By further supposing that light waves are purely transverse, Fresnel explained the nature of polarization and lack thereof, the mechanism of chromatic polarization (the colors produced when polarized light is passed through a slice of doubly-refractive crystal followed by a second polarizer), and the transmission and reflection coefficients at a boundary between transparent isotropic media (including Brewster's angle). Then, by generalizing the direction-speed-polarization relation for calcite, he accounted for the directions and polarizations of the refracted rays in doubly-refractive crystals of the biaxial class (those for which Huygens' secondary wavefronts are not axisymmetric). The period between the first publication of his pure-transverse-wave hypothesis and the submission of his first correct solution to the biaxial problem was less than a year. Later, he coined the terms linear polarization, circular polarization, and elliptical polarization, explained how optical rotation could be understood as a difference in propagation speeds for the two directions of circular polarization, and (by allowing the reflection coefficient to be complex) accounted for the change in polarization due to total internal reflection, as exploited in the Fresnel rhomb. Defenders of the established corpuscular theory could not match his quantitative explanations of so many phenomena on so few assumptions.\n\nFresnel's legacy is the more remarkable in view of his lifelong battle with tuberculosis, to which he succumbed at the age of 39.\n\nAlthough he did not become a public celebrity in his short lifetime, Fresnel lived just long enough to receive due recognition from his peers, including (on his deathbed) the Rumford Medal of the Royal Society of London, and his name is ubiquitous in the modern terminology of optics and waves. Inevitably, after the wave theory of light was subsumed by Maxwell's electromagnetic theory in the 1860s, some attention was diverted from the magnitude of Fresnel's contribution. In the period between Fresnel's unification of physical optics and Maxwell's wider unification, a contemporary authority, Professor Humphrey Lloyd, described Fresnel's transverse-wave theory as \"the noblest fabric which has ever adorned the domain of physical science, Newton's system of the universe alone excepted.\"\n\nEarly life \n\nFamily \n\nAugustin-Jean Fresnel (also called Augustin Jean or simply Augustin), born in Broglie, Normandy, on 10 May 1788, was the second of four sons of the architect Jacques Fresnel (1755–1805) and his wife Augustine, née Mérimée (1755–1833). In 1790, following the Revolution, Broglie became part of the département of Eure. The family moved at least twice — in 1790 to Cherbourg,Levitt, 2013, p.23.  Boutry (1948, p.590) says the family left Broglie in 1789. and in 1794Silliman, 2008, p.166. to Jacques' home town of Mathieu, where Madame Fresnel would spend 25 years as a widow,Boutry, 1948, p.590. outliving two of her sons.\n\nThe first son, Louis (1786–1809), was admitted to the École Polytechnique, became a lieutenant in the artillery, and was killed in action at Jaca, Spain, the day before his 23rd birthday. The third, Léonor (1790–1869), followed Augustin into civil engineering, succeeded him as Secretary of the Lighthouse Commission,Levitt, 2013, p.99. and helped to edit his collected works.Fresnel, 1866–70. The fourth, Fulgence Fresnel (1795–1855), became a noted linguist, diplomat, and orientalist, and occasionally assisted Augustin with negotiations.Levitt, 2013, p.72. Léonor apparently was the only one of the four who married.On Augustin, see (e.g.) Boutry, 1948, p.604. On Léonor, see also Levitt, 2013, pp.104–5.\n\nTheir mother's younger brother, Jean François \"Léonor\" Mérimée (1757–1836), father of the writer Prosper Mérimée (1803–1870), was a paint artist who turned his attention to the chemistry of painting. He became the Permanent Secretary of the École des Beaux-Arts and (until 1814) a professor at the École Polytechnique,Levitt, 2009, p.49. and was the initial point of contact between Augustin and the leading optical physicists of the day (see below).\n\nEducation \n\nThe Fresnel brothers were initially home-schooled by their mother. The sickly Augustin was considered the slow one, hardly beginning to read until the age of eight. At nine and ten he was undistinguished except for his ability to turn tree-branches into toy bows and guns that worked far too well, earning himself the title l'homme de génie (the man of genius) from his accomplices, and a united crackdown from their elders.Levitt, 2013, pp.24–5; Arago, 1857, p.402; Boutry, 1948, pp.590–91.\n\nIn 1801, Augustin was sent to the École Centrale at Caen, as company for Louis. But Augustin lifted his performance: in late 1804 he was accepted into the École Polytechnique, being placed 17th in the entrance examination, in which his solutions to geometry problems impressed the examiner, Adrien-Marie Legendre. As the surviving records of the École Polytechnique begin in 1808, we know little of Augustin's time there, except that he apparently excelled in geometry and drawing — in spite of continuing poor health — and made few if any friends. Graduating in 1806, he then enrolled at the École Nationale des Ponts et Chaussées (National School of Bridges and Roads, also known as \"ENPC\" or \"École des Ponts\"), from which he graduated in 1809, entering the service of the Corps des Ponts et Chaussées as an ingénieur ordinair aspirant (ordinary engineer in training). Directly or indirectly, he was to remain in the employment of the \"Corps des Ponts\" for the rest of his life.Levitt, 2013, pp.25–7; Boutry, 1948, pp.591–2,601.  Arago (1857, p.403) mentions only one geometry solution — apparently the one preserved in Fresnel, 1866–70, vol.2, pp.681–4.\n\nReligious formation \n\nAugustin Fresnel's parents were Roman Catholics of the Jansenist sect, characterized by an extreme Augustinian view of original sin. Religion took first place in the boys' home-schooling. In 1802, Mme Fresnel wrote to Louis concerning Augustin:\n\nAugustin remained a Jansenist.Levitt, 2013, p.24. He indeed regarded his intellectual talents as gifts from God, and considered it his duty to use them for the benefit of others. Plagued by poor health, and determined to do his duty before death thwarted him, he shunned pleasures and worked to the point of exhaustion.Silliman, 2008, p.166; Arago, 1857, p.467. According to his fellow engineer Alphonse Duleau, who helped to nurse him through his final illness, Fresnel saw the study of nature as part of the study of the power and goodness of God. He placed virtue above science and genius. Yet in his last days he needed \"strength of soul,\" not against death alone, but against \"the interruption of discoveries… of which he hoped to derive useful applications.\"\n\nJansenism is considered heretical by the Roman Catholic Church (see List of Christian heresies), and may be part of the explanation why Fresnel, in spite of his scientific achievements and his royalist credentials, never gained a permanent academic teaching post;Grattan-Guinness, 1990, pp.914–15. his only teaching appointment was at the Athénée in the winter of 1819–20.Fresnel, 1866–70, vol.1, p.xcvii. Be that as it may, the brief article on Fresnel in the old Catholic Encyclopedia does not mention his Jansenism, but describes him as \"a deeply religious man and remarkable for his keen sense of duty.\"\n\nEngineering assignments \n\nFresnel was initially posted to the western département of Vendée. There, in 1811, he anticipated what became known as the Solvay process for producing soda ash, except that recycling of the ammonia was not considered. That difference may explain why leading chemists, who learned of his discovery through his uncle Léonor, eventually thought it uneconomic.Cf. Levitt, 2013, p.29; Buchwald, 1989, pp.113–4.  The surviving correspondence on soda ash extends from August 1811 to April 1812; see Fresnel, 1866–70, vol.2, pp.810–17.\n\nAbout 1812, Fresnel was sent to Nyons, in the southern département of Drôme, to assist with the imperial highway that was to connect Spain and Italy. It is from Nyons that we have the first evidence of his interest in optics. On 15 May 1814, while work was slack due to Napoleon's defeat,Boutry, 1948, pp.593–4. Fresnel wrote a \"P.S.\" to his brother Léonor, saying in part:\n\nAt the end of 1814 he still had no information on the subject.Boutry, 1948, p.593; Arago, 1857, pp.407–8. (Concerning the name Institute, note that the French Académie des Sciences was merged with other académies to form the Institut de France in 1795. In 1816 the Académie des Sciences regained its name and autonomy, but remained part of the Institute.)\n\nIn March 1815, perceiving Napoleon's return from Elba as \"an attack on civilization\",Arago, 1857, p.405; Silliman, 2008, p.166.  Arago does not use quotation marks. Fresnel departed without leave, hastened to Toulouse and offered his services to the royalist resistance, but soon found himself on the sick list. Returning to Nyons in defeat, he was threatened and had his windows broken. During the Hundred Days he was placed on suspension, which he was eventually allowed to spend at his mother's house in Mathieu. There he used his enforced leisure to begin his optical experiments.Levitt, 2013, pp.38–9; Boutry, 1948, p.594; Arago, 1857, pp.405–6; Kipnis, 1991, p.167.\n\nContributions to physical optics \n\nHistorical context: From Newton to Biot \n\nThe appreciation of Fresnel's reconstruction of physical optics might be assisted by an overview of the fragmented state in which he found the subject. In this subsection, optical phenomena that were unexplained or whose explanations were disputed are named in bold type.\n\nThe corpuscular theory of light, favored by Isaac Newton and accepted by nearly all of Fresnel's seniors, easily explained rectilinear propagation: the corpuscles obviously moved very fast, so that their paths were very nearly straight. The wave theory, as developed by Christiaan Huygens in his Treatise on Light (1690), explained rectilinear propagation on the assumption that each point crossed by a traveling wavefront becomes the source of a secondary wavefront. Given the initial position of a traveling wavefront, any later position (according to Huygens) was the common tangent surface (envelope) of the secondary wavefronts emitted from the earlier position. As the extent of the common tangent was limited by the extent of the initial wavefront, the repeated application of Huygens' construction to a plane wavefront of limited extent (in a uniform medium) gave a straight, parallel beam. While this construction indeed predicted rectilinear propagation, it was difficult to reconcile with the common observation that wavefronts on the surface of water can bend around obstructions, and with the similar behavior of sound waves — causing Newton to maintain, to the end of his life, that if light consisted of waves it would \"bend and spread every way\" into the shadows.\n\nHuygens' theory neatly explained the law of ordinary reflection and the law of ordinary refraction (\"Snell's law\"), provided that the secondary waves traveled slower in denser media (those of higher refractive index). The corpuscular theory, with the hypothesis that the corpuscles were subject to forces acting perpendicular to surfaces, explained the same laws equally well,Darrigol, 2012, pp.93–4,103. albeit with the implication that light traveled faster in denser media; that implication was wrong, but could not be directly disproven with the technology of Newton's time or even Fresnel's time (see Fizeau–Foucault apparatus).\n\nSimilarly inconclusive was stellar aberration — that is, the apparent change in the position of a star due to the velocity of the earth across the line of sight (not to be confused with stellar parallax, which is due to the displacement of the earth across the line of sight). Identified by James Bradley in 1728, stellar aberration was widely taken as confirmation of the corpuscular theory. But it was equally compatible with the wave theory, as Euler noted in 1746 — tacitly assuming that the aether (the supposed wave-bearing medium) near the earth was not disturbed by the motion of the earth.Darrigol, 2012, pp.129–30,258.\n\nThe outstanding strength of Huygens' theory was his explanation of the birefringence (double refraction) of \"Iceland crystal\" (transparent calcite), on the assumption that the secondary waves are spherical for the ordinary refraction (which satisfies Snell's law) and spheroidal for the extraordinary refraction (which does not). In general, Huygens' common-tangent construction implies that rays are paths of least time between successive positions of the wavefront, in accordance with Fermat's principle.Young, 1855, pp.225–6,229. In the special case of isotropic media, the secondary wavefronts must be spherical, and Huygens' construction then implies that the rays are perpendicular to the wavefront; indeed, the law of ordinary refraction can be separately derived from that premise, as Ignace-Gaston Pardies did before Huygens.Darrigol, 2012, pp.62–4.\n\nAlthough Newton rejected the wave theory, he noticed its potential to explain colors, including the colors of \"thin plates\" (e.g., \"Newton's rings\", and the colors of skylight reflected in soap bubbles), on the assumption that light consists of periodic waves, with the lowest frequencies (longest wavelengths) at the red end of the spectrum, and the highest frequencies (shortest wavelengths) at the violet end. In 1672 he published a heavy hint to that effect,Darrigol, 2012, p.87. but contemporary supporters of the wave theory failed to act on it: Robert Hooke treated light as a periodic sequence of pulses but did not use frequency as the criterion of color,Darrigol, 2012, pp.53–6. while Huygens treated the waves as individual pulses without any periodicity; and Pardies died young in 1673. Newton himself tried to explain colors of thin plates using the corpuscular theory, by supposing that his corpuscles had the wavelike property of alternating between \"fits of easy transmission\" and \"fits of easy reflection\",Darrigol, 2012, pp.98–100. the distance between \"fits\" depending on color and, awkwardly, on the angle of incidence. It was not until 1801 that Thomas Young, in the Bakerian Lecture for that year, cited Newton's hint, and accounted for the colors of a thin plate as the combined effect of the front and back reflections, which reinforce or cancel each other according to the wavelength and the thickness. He similarly explained the colors of \"striated surfaces\" (e.g., gratings) as the wavelength-dependent reinforcement or cancellation of reflections from adjacent lines. Young described this reinforcement or cancellation as interference.\n\nNeither Newton nor Huygens satisfactorily explained diffraction — the blurring and fringing of shadows where, according to rectilinear propagation, they ought to be sharp. Newton, who called diffraction \"inflexion\", supposed that rays of light passing close to obstacles were bent (\"inflected\"); but his explanation was only qualitative.Darrigol, 2012, pp.101–2. Huygens' common-tangent construction, without modifications, could not accommodate diffraction at all. Two such modifications were proposed by Young in the same 1801 Bakerian Lecture: first, that the secondary waves near the edge of an obstacle could diverge into the shadow, but only weakly, due to limited reinforcement from other secondary waves; and second, that diffraction by an edge was caused by interference between two rays: one reflected off the edge, and the other inflected while passing near the edge. The latter ray would be undeviated if sufficiently far from the edge, but Young did not elaborate on that case. These were the earliest suggestions that the degree of diffraction depends on wavelength.Darrigol, 2012, pp.177–9. Later, in the 1803 Bakerian Lecture, Young ceased to regard inflection as a separate phenomenon,Young, 1855, p.188. and produced evidence that diffraction fringes inside the shadow of a narrow obstacle were due to interference: when the light from one side was blocked, the internal fringes disappeared.Young, 1855, pp.179–81. But Young was alone in such efforts until Fresnel entered the field.Darrigol, 2012, p.187.\n\nHuygens, in his investigation of double refraction, noticed something that he could not explain: when a ray passes through two similarly oriented calcite crystals at normal incidence, the ordinary ray emerging from the first crystal suffers only the ordinary refraction in the second, while the extraordinary ray emerging from the first suffers only the extraordinary refraction in the second; but when the second crystal is rotated 90° about the incident rays, the roles are interchanged, so that the ordinary ray emerging from the first crystal suffers only the extraordinary refraction in the second, and vice versa. This discovery gave Newton another reason to reject the wave theory: rays of light evidently had \"sides\". Corpuscles could have sides (or poles, as they would later be called); but waves of light could not, because (so it seemed) any such waves would need to be longitudinal (with vibrations in the direction of propagation). Newton offered an alternative \"Rule\" for the extraordinary refraction, which rode on his authority through the 18th century, although he made \"no known attempt to deduce it from any principles of optics, corpuscular or otherwise.\"\n\nIn 1808 the extraordinary refraction of calcite was investigated experimentally, with unprecedented accuracy, by Étienne-Louis Malus, and found to be consistent with Huygens' spheroid construction, not Newton's \"Rule\". Malus then sought to explain this law in corpuscular terms: from the known relation between the incident and refracted ray directions, he derived the corpuscular velocity (as a function of direction) that that would satisfy Maupertuis's \"least action\" principle. But, as Young pointed out, the existence of such a velocity law was guaranteed by Huygens' spheroid, because Huygens' construction leads to Fermat's principle, which becomes Maupertuis's principle if the ray speed is replaced by the reciprocal of the particle speed! The corpuscularists had not found a force law that would yield the alleged velocity law. Worse, it was doubtful that any such force law would satisfy the conditions of Maupertuis's principle.Young, 1855, pp.225–8; Frankel, 1974. In contrast, Young proceeded to show that \"a medium more easily compressible in one direction than in any direction perpendicular to it, as if it consisted of an infinite number of parallel plates connected by a substance somewhat less elastic\" admits spheroidal longitudinal wavefronts, as Huygens supposed.Young, 1855, pp.228–32; cf. Whewell, 1857, p.329.\n\nBut Malus, in the course of his experiments on double refraction, noticed something else: when a ray of light is reflected off a non-metallic surface at the appropriate angle, it behaves like one of the two rays emerging from a calcite crystal.Darrigol, 2012, pp.191–2. It was Malus who coined the term polarization to describe this behavior, although the polarizing angle became known as Brewster's angle after its dependence on the refractive index was determined experimentally by David Brewster in 1815. Malus also introduced the term plane of polarization. In the case of polarization by reflection, his \"plane of polarization\" was the plane of the incident and reflected rays; in modern terms, this is the plane normal to the electric vibration. In 1809, Malus further discovered that the intensity of light passing through two polarizers is proportional to the squared cosine of the angle between their planes of polarization (Malus's law),Darrigol, 2012, p.192. whether the polarizers work by reflection or double refraction, and that all birefringent crystals produce both extraordinary refraction and polarization.Young, 1855, pp.249–50. As the corpuscularists started trying to explain these things in terms of polar \"molecules\" of light, the wave-theorists had no working hypothesis on the nature of polarization, prompting Young to remark that Malus's observations \"present greater difficulties to the advocates of the undulatory theory than any other facts with which we are acquainted.\"Young, 1855, p.233.\n\nMalus died in February 1812, at the age of 36, shortly after receiving the Rumford Medal for his work on polarization.\n\nIn August 1811, François Arago reported that if a thin plate of mica was viewed against a white polarized backlight through a calcite crystal, the two images of the mica were of complementary colors (the overlap having the same color as the background). The light emerging from the mica was \"depolarized\" in the sense that there was no orientation of the calcite that made one image disappear; yet it was not ordinary (\"unpolarized\") light, for which the two images would be of the same color. Rotating the calcite around the line of sight changed the colors, though they remained complementary. Rotating the mica changed the saturation (not the hue) of the colors. This phenomenon became known as chromatic polarization. Replacing the mica with a much thicker plate of quartz, with its faces perpendicular to the optic axis (the axis of Huygens' spheroid or Malus's velocity function), produced a similar effect, except that rotating the quartz made no difference. Arago tried to explain his observations in corpuscular terms.Levitt, 2009, p.37; Darrigol, 2012, pp.193–4,290.\n\nIn 1812, as Arago pursued further qualitative experiments and other commitments, Jean-Baptiste Biot reworked the same ground using a gypsum lamina in place of the mica, and found empirical formulae for the intensities of the ordinary and extraordinary images. The formulae contained two coefficients, supposedly representing colors of rays \"affected\" and \"unaffected\" by the plate — the \"affected\" rays being of the same color mix as those reflected by amorphous thin plates of proportional, but lesser, thickness.Darrigol, 2012, pp.194–5 (ordinary intensity); Frankel, 1976, p.148 (both intensities).\n\nArago protested, declaring that he had made some of the same discoveries but had not had time to write them up. In fact the overlap between Arago's work and Biot's was minimal, because Arago's was only qualitative and sought to include other topics. But the dispute triggered a notorious falling-out between the two men.Buchwald, 1989, pp.79–88; Levitt, 2009, pp.33–57.\n\nLater that year, Biot tried to explain the observations as an oscillation of the alignment of the \"affected\" corpuscles at a frequency proportional to that of Newton's \"fits\", due to forces depending on the alignments. This theory became known as mobile polarization. To reconcile his results with a sinusoidal oscillation, Biot had to suppose that the corpuscles emerged with one of two permitted orientations, namely the extremes of the oscillation, with probabilities depending on the phase of the oscillation.Frankel, 1976, pp.149–50; Buchwald, 1989, pp.99–103; Darrigol, 2012, pp.195–6. Corpuscular optics was becoming expensive on assumptions. But in 1813, Biot reported that the case of quartz was simpler: the observable phenomenon (now called optical rotation or optical activity or sometimes rotary polarization) was a gradual rotation of the polarization direction with distance, and could be explained by a similar rotation (not oscillation) of the corpuscles.Frankel, 1976, pp.151–2; Darrigol, 2012, p.196.\n\nEarly in 1814, reviewing Biot's work on chromatic polarization, Young noted that the periodicity of the color as a function of the plate thickness — including the factor by which the period exceeded that for a reflective thin plate, and even the effect of obliquity of the plate (but not the role of polarization) — could be explained by the wave theory in terms of the different propagation times of the ordinary and extraordinary waves through the plate.Young, 1855, pp.269–72. But Young was then the only public defender of the wave theory.Frankel, 1976, p.176.\n\nIn summary, in the spring of 1814, as Fresnel tried in vain to guess what polarization was, the corpuscularists thought that they knew, while the wave-theorists (if we may use the plural) literally had no idea. Both theories claimed to explain rectilinear propagation, but the wave explanation was overwhelmingly regarded as unconvincing. The corpuscular theory could not link double refraction to specific surface forces; the wave theory could not yet link it to polarization. The corpuscular theory was weak on thin plates and silent on gratings; the wave theory was strong on both, but under-appreciated. Concerning diffraction, the corpuscular theory did not yield quantitative predictions, while the wave theory had begun to do so by considering diffraction as a manifestation of interference, but had only considered two rays at a time. Only the corpuscular theory gave even a vague insight into Brewster's angle, Malus's law, or optical rotation. Concerning chromatic polarization, the wave theory explained the periodicity far better than the corpuscular theory, but had nothing to say about the role of polarization; and its explanation of the periodicity was largely ignored.Frankel, 1976, p.155. And Arago had founded the study of chromatic polarization, only to lose the lead, controversially, to Biot. Such were the circumstances in which Arago first heard of Fresnel's interest in optics.\n\nRêveries \n\nFresnel's letters from later in 1814 reveal his interest in the wave theory, including his awareness that it explained the constancy of the speed of light and was at least compatible with stellar aberration. Eventually he compiled what he called his rêveries (musings) into an essay and submitted it via Léonor Mérimée to André-Marie Ampère, who did not respond directly.The story that Ampère lost the essay (propagated from Boutry, 1948, p.593?) is implicitly contradicted by Darrigol (2012, p.198), Buchwald (1989, p.117), Mérimée's letter to Fresnel dated 20 December 1814 (in Fresnel, 1866–70, vol.2, pp.830–31), and two footnotes in Fresnel's collected works (Fresnel, 1866–70, vol.1, pp.xxix–xxx, note 4, and p.6n). But on 19 December, Mérimée dined with Ampère and Arago, with whom he was acquainted through the École Polytechnique; and Arago promised to look at Fresnel's essay.Buchwald, 1989, pp.116–7; Fresnel, 1866–70, vol.2, p.831; Levitt, 2009, p.49.\n\nIn mid 1815, on his way home to Mathieu to serve his suspension, Fresnel met Arago in Paris and spoke of the wave theory and stellar aberration. He was informed that he was trying to break down open doors (\"il enfonçait des portes ouvertes\"), and directed to classical works on optics.Boutry, 1948, pp.594–5.\n\nDiffraction \n\nFirst attempt (1815) \n\nOn 12 July 1815, as Fresnel was about to leave Paris, Arago left him a note on a new topic:\n\nFresnel would not have ready access to these works outside Paris, and could not read English.Fresnel, 1866–70, vol.1, pp.6–7. But, in Mathieu — with a point-source of light made by focusing sunlight with a drop of honey, a crude micrometer of his own construction, and supporting apparatus made by a local locksmith — he began his own experiments.Fresnel, 1866–70, vol.1, pp.xxxi (micrometer, locksmith , supports), 6n (locksmith); Buchwald, 1989, pp.122 (honey drop), 125–6 (micrometer, with diagram); Boutry 1948, p.595 and Levitt, 2013, p.40 (locksmith, honey drop, micrometer); Darrigol 2012, pp.198–9 (locksmith, honey drop). His technique was novel: whereas earlier investigators had projected the fringes onto a screen, Fresnel soon abandoned the screen and observed the fringes in space, through a lens with the micrometer at its focus, allowing more accurate measurements while requiring less light.Buchwald, 1989, pp.122,126.\n\nLater in July, after Napoleon's final defeat, Fresnel was reinstated with the advantage of having backed the winning side. He requested a two-month leave of absence, which was readily granted because roadworks were in abeyance.Levitt, 2013, pp.39,239.\n\nOn 23 September he wrote to Arago, beginning \"I think I have found the explanation and the law of colored fringes which one notices in the shadows of bodies illuminated by a luminous point.\" In the same paragraph, however, Fresnel implicitly acknowledged doubt about the novelty of his work: noting that he would need to incur some expense in order to improve his measurements, he wanted to know \"whether this is not useless, and whether the law of diffraction has not already been established by sufficiently exact experiments.\"Kipnis, 1991, p.167; Fresnel, 1866–70, vol.1, pp.5–6. He explained that he had not yet had a chance to acquire the items on his reading lists, with the apparent exception of \"Young's book\", which he could not understand without his brother's help.Darrigol, 2012, p.198. \"Young's book\", which Fresnel distinguished from the Philosophical Transactions, is presumably A Course of Lectures on Natural Philosophy and the Mechanical Arts (2 volumes, 1807). In [https://archive.org/details/lecturescourseof01younrich vol.1], the relevant illustrations are Plate (facing p.777), including the famous two-source interference pattern (Fig.267), and Plate (facing p.787), including the hyperbolic paths of the fringes in that pattern (Fig.442) followed by sketches of other diffraction patterns and thin-plate patterns, with no visual hints on their physical causes. In [https://archive.org/details/lecturescourseof02younrich vol.2], which includes the Bakerian lectures from the Philosophical Transactions, Fig.108 (p.632) shows just one case of an undeviated direct ray intersecting a reflected ray. Not surprisingly, he had retraced many of Young's steps.\n\nIn a memoir sent to the Institute on 15 October 1815, Fresnel mapped the external and internal fringes in the shadow of a wire. He noticed, like Young before him, that the internal fringes disappeared when the light from one side was blocked, and concluded that \"the vibrations of two rays that cross each other under a very small angle can contradict each other…\"Darrigol, 2012, p.199. But, whereas Young took the disappearance of the internal fringes as confirmation of the principle of interference, Fresnel reported that it was the internal fringes that first drew his attention to the principle. To explain the diffraction pattern, Fresnel constructed the internal fringes by considering the intersections of circular wavefronts emitted from the two edges of the obstruction, and the external fringes by considering the intersections between direct waves and waves reflected off the nearer edge. For the external fringes, to obtain tolerable agreement with observation, he had to suppose that the reflected wave was inverted; and he noted that the predicted paths were hyperbolic. In the part of the memoir that most clearly surpassed Young, Fresnel explained the ordinary laws of reflection and refraction in terms of interference, noting that if two parallel rays were reflected or refracted at other than the prescribed angle, they would no longer have the same phase in a common perpendicular plane, and every vibration would be cancelled by a nearby vibration. He acknowledged that his explanation was valid provided that the surface irregularities were much smaller than the wavelength.Buchwald, 1989, pp.119,131–2; Darrigol, 2012, pp.199–201; Kipnis, 1991, pp.175–6.\n\nOn 10 November, Fresnel sent a supplementary note dealing with Newton's rings and with gratings,Darrigol, 2012, p.201. including, for the first time, transmission gratings — although in that case the interfering rays were still assumed to be \"inflected\", and the experimental verification was inadequate because it used only two threads.Fresnel, 1866–70, vol.1, pp.48–9; Kipnis, 1991, pp.176–8.\n\nAs Fresnel was not a member of the Institute, the fate of his memoir depended heavily on the report of a single member. The reporter for Fresnel's memoir turned out to be Arago (with Poinsot as the other reviewer).Frankel, 1976, p.158; Fresnel, 1866–70, vol.1, p.9n. On 8 November, Arago wrote to Fresnel:\n\nFresnel was troubled, wanting to know more precisely where he had collided with Young.Buchwald, 1989, pp.137–9. Concerning the curved paths of the \"colored bands\", Young had noted the hyperbolic paths of the fringes in the two-source interference pattern corresponding roughly to Fresnel's internal fringes, and described the hyperbolic fringes that appear on the screen within rectangular shadows.Young, 1807, vol.1, p.787 & Figs.442,445; Young, 1855, pp.180–81,184. But Arago erred in his belief that the curved paths of the fringes were fundamentally incompatible with the corpuscular theory.Kipnis, 1991, pp.204–5.  Cf. Darrigol, 2012, p.101, where the straight rays  combine to form a curved fringe (and, in the caption, \"1904\" should be \"1704\" and \"\" should be \"\").\n\nArago's letter went on to request more data on the external fringes. Fresnel complied, until he exhausted his leave and was assigned to Rennes in the département of Ille-et-Vilaine. At this point Arago interceded with Gaspard de Prony, head of the École des Ponts, who wrote to Louis-Mathieu Molé, head of the Corps des Ponts, suggesting that the progress of science and the prestige of the Corps would be enhanced if Fresnel could come to Paris for a time. He arrived in March 1816, and his leave was subsequently extended through the middle of the year.Frankel, 1976, p.158; Boutry, 1948, p.597; Levitt, 2013, pp.41–3.\n\nMeanwhile, in an experiment reported on 26 February 1816, Arago verified Fresnel's prediction that the internal fringes were shifted if the rays on one side of the obstacle passed through a thin glass lamina. Fresnel correctly attributed this phenomenon to the lower wave velocity in the glass.Buchwald, 1989, p.137; Kipnis, 1991, pp.178,207,213. Arago later used a similar argument to explain the colors in the scintillation of stars.Frankel (1976, p.156) gives the date of Arago's note on scintillation as 1814; but the sequence of events implies 1816, in agreement with Darrigol (pp.201,290).  Kipnis (1991, pp.202–3,206) proves the later date and explains the origin and propagation of the incorrect earlier date.\n\nFresnel's updated memoirFresnel, 1816. was eventually published in the March 1816 issue of Annales de Chimie et de Physique, of which Arago had recently become co-editor.Darrigol, 2012, p.201; Frankel, 1976, p.159. That issue did not actually appear until May.Kipnis, 1991, pp.166n,214n. In March, Fresnel already had competition: Biot read a memoir on diffraction by himself and his student Claude Pouillet, containing copious data and arguing that the regularity of diffraction fringes, like the regularity of Newton's rings, must be linked to Newton's \"fits\". But the new link was not rigorous, and Pouillet himself would become a distinguished early adopter of the wave theory.Kipnis, 1991, pp.212–14; Frankel, 1976, pp.159–60,173.\n\n\"Efficacious ray\", double-mirror experiment (1816) \n\nOn 24 May 1816, Fresnel wrote to Young (in French), acknowledging how little of his own memoir was new.Darrigol, 2012, p.201; letter printed in Young, 1855, pp.376–8. But in a \"supplement\" signed on 14 July and read the next day,Fresnel, 1866–70, vol.1, pp.129–70. Fresnel noted that the internal fringes were more accurately predicted by supposing that the two interfering rays came from some distance outside the edges of the obstacle. To explain this, he divided the incident wavefront at the obstacle into what we now call Fresnel zones, such that the secondary waves from each zone were spread over half a cycle when they arrived at the observation point. The zones on each side of the obstacle largely canceled out in pairs, except the first, which was represented by an \"efficacious ray\". This approach worked for the internal fringes, but the superposition of the efficacious ray and the direct ray did not work for the external fringes.Darrigol, 2012, pp.201–3.\n\nThe contribution from the \"efficacious ray\" was thought to be only partly canceled, for reasons involving the dynamics of the medium: where the wavefront was continuous, symmetry forbade oblique vibrations; but near the obstacle that truncated the wavefront, the asymmetry allowed some sideways vibration towards the geometric shadow. This argument showed that Fresnel had not (yet) fully accepted Huygens' principle, which would have permitted oblique radiation from all portions of the front.Buchwald, 1989, pp.134,144–5.\n\nIn the same supplement, Fresnel described his well-known double mirror, comprising two flat mirrors joined at an angle of slightly less than 180°, with which he produced a two-slit interference pattern from two virtual images of the same slit. A conventional double-slit experiment required a preliminary single slit to ensure that the light falling on the double slit was coherent (synchronized). In Fresnel's version, the preliminary single slit was retained, and the double slit was replaced by the double mirror — which bore no physical resemblance to the double slit and yet performed the same function. This result (which had been announced by Arago in the March issue of the Annales) made it hard to believe that the two-slit pattern had anything to do with corpuscles being deflected as they passed near the edges of the slits.Buchwald, 1989, pp.137–8; Darrigol, 2012, pp.201–2; Boutry, 1948, p.597; Fresnel, 1866–70, vol.1, pp.123–8 (Arago's announcement).\n\nBut 1816 was the \"Year Without a Summer\": crops failed; hungry farming families lined the streets of Rennes; the central government organized \"charity workhouses\" for the needy; and in October, Fresnel was sent back to Ille-et-Vilaine to supervise charity workers in addition to his regular road crew.Levitt, 2013, p.43; Boutry, 1948, p.599. According to Arago,\n\nFresnel's letters from December 1816 reveal his consequent anxiety. To Arago he complained of being \"tormented by the worries of surveillance, and the need to reprimand…\" And to Mérimée he wrote: \"I find nothing more tiresome than having to manage other men, and I admit that I have no idea what I'm doing.\"Levitt, 2013, pp.28,237.\n\nPrize memoir (1818) and sequel \n\nOn 17 March 1817, the Académie des Sciences announced that diffraction would be the topic for the biannual physics Grand Prix to be awarded in 1819.Buchwald, 1989, p.169; 2013, p.453; Levitt, 2013, p.44.  Frankel (1976, pp.160–61) and Grattan-Guinness (1990, p.867) note that the topic was first proposed on 10 February 1817. Darrigol alone (2012, p.203) says that the competition was \"opened\" on 17 March 1818. Prizes were offered in odd-numbered years for physics and in even-numbered years for mathematics (Frankel, 1974, p.224n). The deadline for entries was set at 1 August 1818 to allow time for replication of experiments. Although the wording of the problem referred to rays and inflection and did not invite wave-based solutions, Arago and Ampère encouraged Fresnel to enter.Buchwald, 1989, pp.169–71; Frankel, 1976, p.161; Fresnel, 1866–70, vol.1, pp.xxxvi–xxxvii.\n\nIn the fall of 1817, Fresnel, supported by de Prony, obtained a leave of absence from the new head of the Corp des Ponts, Louis Becquey, and returned to Paris.Fresnel, 1866–70, vol.1, p.xxxv; Levitt, 2013, p.44. He resumed his engineering duties in the spring of 1818; but from then on he was based in Paris,Silliman, 2008, p.166; Frankel, 1976, p.159. first on the Canal de l'Ourcq,Fresnel, 1866–70, vol.1, pp.xxxv,xcvi; Boutry, 1948, pp.599,601. and then (from May 1819) with the cadastre of the pavements.Fresnel, 1866–70, vol.1, p.xcvi; Arago, 1857, p.466.\n\nOn 15 January 1818, in a different context (revisited below), Fresnel showed that the addition of sinusoidal functions of the same frequency but different phases is analogous to the addition of forces with different directions. His method was similar to the phasor representation, except that the \"forces\" were plane vectors rather than complex numbers; they could be added, and multiplied by scalars, but not (yet) multiplied and divided by each other. The explanation was algebraic rather than geometric.\n\nKnowledge of this method was assumed in a preliminary note on diffraction,Printed in Fresnel, 1866–70, vol.1, pp.171–81. dated 19 April 1818 and deposited on 20 April, in which Fresnel outlined the elementary theory of diffraction as found in modern textbooks. He restated Huygens' principle in combination with the superposition principle, saying that the vibration at each point on a wavefront is the sum of the vibrations that would be sent to it at that moment by all the elements of the wavefront in any of its previous positions, all elements acting separately (see Huygens–Fresnel principle). For a wavefront partly obstructed in a previous position, the summation was to be carried out over the unobstructed portion. In directions other than the normal to the primary wavefront, the secondary waves were weakened due to obliquity, but weakened much more by destructive interference, so that the effect of obliquity alone could be ignored.Cf. Fresnel, 1866–70, vol.1, pp.174–5; Buchwald, 1989, pp.157–8. For diffraction by a straight edge, the intensity as a function of distance from the geometric shadow could then be expressed with sufficient accuracy in terms of what are now called the normalized Fresnel integrals:\n\n:C(x) \\!\\int_0^x \\!\\cos\\big(\\tfrac{1}{2}\\pi z^2\\big)\\,dz; S(x) \n \\!\\int_0^x \\!\\sin\\big(\\tfrac{1}{2}\\pi z^2\\big)\\,dz\\,.\n\nThe same note included a table of the integrals, for an upper limit ranging from  0 to 5.1 in steps of 0.1, computed with a mean error of 0.0003,Buchwald, 1989, p.167; 2013, p.454. plus a smaller table of maxima and minima of the resulting intensity.\n\nIn the final memoirFresnel, 1818. deposited on 29 July, those two tables were slightly expanded without changing the existing figures, except for a correction to the first minimum of intensity. For completeness, Fresnel repeated his solution to \"the problem of interference\", whereby sinusoidal functions are added like vectors. He acknowledged the directionality of the secondary sources and the variation in their distances from the observation point, chiefly to explain why these things make negligible difference in the context, provided of course that the secondary sources do not radiate in the retrograde direction. Then, applying his theory of interference to the secondary waves, he expressed the intensity of light diffracted by a single straight edge (half-plane) in terms of integrals which involved the dimensions of the problem, but which could be converted to the normalized forms above. With reference to the integrals, he explained the calculation of the maxima and minima of the intensity (external fringes), and noted that the calculated intensity falls very rapidly as one moves into the geometric shadow.Crew, 1900, pp.101–8 (vector-like representation), 109 (no retrograde radiation), 110–11 (directionality and distance), 118–22 (derivation of integrals), 124–5 (maxima & minima), 129–31 (geometric shadow). The last result, as Olivier Darrigol says, \"amounts to a proof of the rectilinear propagation of light in the wave theory, indeed the first proof that a modern physicist would still accept.\"Darrigol, 2012, pp.204–5.\n\nFor the experimental testing of his calculations, Fresnel used red light with a wavelength of 638nm, which he deduced from the diffraction pattern in the simple case in which light incident on a single slit was focused by a cylindrical lens. For a variety of distances from the source to the obstacle and from the obstacle to the field point, he compared the calculated and observed positions of the fringes for diffraction by a half-plane, a slit, and a narrow strip — concentrating on the minima, which were visually sharper than the maxima. For the slit and the strip, he could not use the previously computed table of maxima and minima; for each combination of dimensions, the intensity had to be expressed in terms of sums or differences of Fresnel integrals and calculated from the table of integrals, and the extrema had to be calculated anew.Crew, 1900, pp.127–8 (wavelength), 129–31 (half-plane), 132–5 (extrema, slit); Fresnel, 1866–70, vol.1, pp.350–55 (narrow strip). The agreement between calculation and measurement was better than 1.5% in almost every case.Buchwald, 1989, pp.179–82.\n\nNear the end of the memoir, Fresnel summed up the difference between Huygens' use of secondary waves and his own: whereas Huygens says there is light only where the secondary waves exactly agree, Fresnel says there is complete darkness only where the secondary waves exactly cancel out.Crew, 1900, p.144.\n\nThe judging committee comprised Laplace, Biot, and Poisson (all corpuscularists), Gay-Lussac (uncommitted), and Arago, who eventually wrote the committee's report. Although entries in the competition were supposed to be anonymous to the judges, Fresnel's must have been recognizable by the content.Worrall, 1989, p.136; Buchwald, 1989, pp.171,183; Levitt, 2013, pp.45–6. There was only one other entry, of which neither the manuscript nor any record of the author has survived.Frankel, 1976, p.162. However, Kipnis (1991, pp.222–4) offers evidence that the unsuccessful entrant was Honoré Flaugergues (1755–1830?) and that the essence of his entry is contained in a \"supplement\" published in Journal de Physique, vol.89 (September 1819), pp.161–86. That entry (identified as \"no.1\") was mentioned only in the last paragraph of the judges' report,Fresnel, 1866–70, vol.1, pp.236–7. noting that the author had shown ignorance of the relevant earlier works of Young and Fresnel, used insufficiently precise methods of observation, overlooked known phenomena, and made obvious errors. In the words of John Worrall, \"The competition facing Fresnel could hardly have been less stiff.\"Worrall, 1989, pp.139–40. We may infer that the committee had only two options: award the prize to Fresnel (\"no.2\"), or withhold it.Cf. Worrall, 1989, p.141.\n\nThe committee deliberated into the new year. Then Poisson, exploiting a case in which Fresnel's theory gave easy integrals, predicted that if a circular obstacle were illuminated by a point-source, there should be (according to the theory) a bright spot in the center of the shadow, illuminated as brightly as the exterior. This seems to have been intended as a reductio ad absurdum. Arago, undeterred, assembled an experiment with an obstacle 2mm in diameter — and there, in the center of the shadow, was Poisson's spot. The committee unanimously awarded the prize to Fresnel.Darrigol, 2012, p.205; Fresnel, 1866–70, vol.1, p.xlii.\n\nArago's verification of Poisson's counter-intuitive prediction passed into folklore as if it had decided the prize.Worrall, 1989, pp.135–8; Kipnis, 1991, p.220. That view, however, is not supported by the judges' report, which gave the matter only two sentences in the penultimate paragraph.Worrall, 1989, pp.143–5. The printed version of the report also refers to a note (E), but this note concerns further investigations that took place after the prize was decided (Worrall, 1989, pp.145–6; Fresnel, 1866–70, vol.1, pp.236,245–6). According to Kipnis (1991, pp.221–2), the real significance of Poisson's spot and its complement (at the center of the bright spot cast by a circular aperture) was that they concerned the intensities of fringes, whereas Fresnel's measurements had concerned only the positions of fringes; but, as Kipnis also notes, this issue was pursued only after the prize was decided. Neither did Fresnel's triumph immediately convert Laplace, Biot, and Poisson to the wave theory,Concerning their later views, see §Reception. for at least four reasons. First, although the professionalization of science in France had established common standards, it was one thing to acknowledge a piece of research as meeting those standards, and another thing to regard it as conclusive. Second, it was possible to interpret Fresnel's integrals as rules for combining rays. Arago even encouraged that interpretation, presumably in order to minimize resistance to Fresnel's ideas.Buchwald, 1989, pp.183–4; Darrigol, 2012, p.205. Even Biot began teaching the Huygens-Fresnel principle without committing himself to a wave basis.Kipnis, 1991, pp.219–20,224,232–3; Grattan-Guinness, 1990, p.870. Third, Fresnel's theory did not explain the mechanism of generation of secondary waves or why they had any significant angular spread; this issue particularly bothered Poisson.Buchwald, 1989, pp.188–98; Darrigol, 2012, pp.205–6; Kipnis, 1991, p.220. Fourth, the question that most exercised optical physicists at that time was not diffraction, but polarization — on which Fresnel had been working, but was yet to make his critical breakthrough.\n\nPolarization \n\nBackground: Emissionism and selectionism \n\nAn emission theory of light was one that regarded the propagation of light as the transport of some kind of matter. While the corpuscular theory was obviously an emission theory, the converse did not follow: in principle, one could be an emissionist without being a corpuscularist. This was convenient because, beyond the ordinary laws of reflection and refraction, emissionists never managed to make testable quantitative predictions from a theory of forces acting on corpuscles of light. But they did make quantitative predictions from the premises that rays were countable objects, which were conserved in their interactions with matter (except absorbent media), and which had particular orientations. According to this framework, polarization and the related phenomena of double refraction and partial reflection involved altering the orientations of the rays and/or selecting them according to orientation, and the state of polarization of a beam (a bundle of rays) was a question of how many rays were in what orientations: in a fully polarized beam, the orientations were all the same. This approach, which Jed Buchwald has called selectionism, was pioneered by Malus and diligently pursued by Biot.Buchwald, 1989, pp.50–51,63–5,103–4; 2013, pp.448–9.\n\nFresnel, in contrast, decided to introduce polarization into interference experiments.\n\nInterference of polarized light, chromatic polarization (1816–21) \n\nIn the summer of 1816, Fresnel discovered that when a birefringent crystal produced two images of a single slit, he could not obtain the usual two-slit interference pattern, even if he compensated for the different propagation times. A more general experiment, suggested by Arago, found that if the two beams of a double-slit device were separately polarized, the interference pattern appeared and disappeared as the polarization of one beam was rotated, giving full interference for parallel polarizations, but no interference for perpendicular polarizations (see Fresnel–Arago laws).Darrigol, 2012, p.206. These experiments, among others, were eventually reported in a brief memoir published in 1819 and later translated into English.\n\nIn a memoir drafted on 30 August 1816 and revised on 6 October, Fresnel reported an experiment in which he placed two matching thin laminae in a double-slit apparatus — one over each slit, with their optic axes perpendicular — and obtained two interference patterns offset in opposite directions, with perpendicular polarizations. This, in combination with the previous findings, meant that each lamina split the incident light into perpendicularly polarized components with different velocities — just like a normal (thick) birefringent crystal, and contrary to Biot's \"mobile polarization\" hypothesis.Darrigol, 2012, p.207; Frankel, 1976, pp.163–4.\n\nAccordingly, in the same memoir, Fresnel offered his first attempt at a wave theory of chromatic polarization. When polarized light passed through a crystal lamina, it was split into ordinary and extraordinary waves (with intensities described by Malus's law), and these were perpendicularly polarized and therefore did not interfere, so that no colors were produced (yet). But if they then passed through an analyzer (second polarizer), their polarizations were brought into alignment (with intensities again modified according to Malus's law), and they would interfere. This explanation, by itself, predicts that if the analyzer is rotated 90°, the ordinary and extraordinary waves simply switch roles, so that if the analyzer takes the form of a calcite crystal, the two images of the lamina should be of the same hue (this issue is revisited below). But in fact, as Arago and Biot had found, they are of complementary colors. To correct the prediction, Fresnel proposed a phase-inversion rule whereby one of the constituent waves of one of the two images suffered an additional 180° phase shift on its way through the lamina. This inversion was a weakness in the theory relative to Biot's, as Fresnel acknowledged,Frankel, 1976, p.164. although the rule specified which of the two images had the inverted wave.Buchwald, 1989, p.386. Moreover, because Fresnel had not yet worked out how to superpose sinusoidal functions with arbitrary phase differences (due to propagation at different velocities through the lamina), he could only deal with special cases.Buchwald, 1989, pp.216,384.\n\nIn a \"supplement\" signed on 15 January 1818 — the same document in which he introduced his technique for superposing sinusoidal functions — Fresnel accommodated Malus's law by proposing an underlying principle: that if polarized light is incident on a birefringent crystal with its optic axis at an angle θ to the \"plane of polarization\", the ordinary and extraordinary vibrations (as functions of time) are scaled by the factors cosθ and sinθ, respectively. Although modern readers easily interpret these factors in terms of perpendicular components of a transverse oscillation, Fresnel did not (yet) explain them that way. Hence he still needed the phase-inversion rule. He applied these principles to a case of chromatic polarization not covered by Biot's formulae, involving two successive laminae with axes separated by 45°, and obtained predictions that disagreed with Biot's experiments (except in special cases) but agreed with his own.Buchwald, 1989, pp.333–6; Darrigol, 2012, pp.207–8. (Darrigol gives the date as 1817, but the page numbers in his footnote 95 fit reference \"1818b\", not \"1817\".)\n\nFresnel applied the same principles to the standard case of chromatic polarization, in which one birefringent lamina was sliced parallel to its axis and placed between a polarizer and an analyzer. If the analyzer took the form of a thick calcite crystal with its axis in the plane of polarization, Fresnel predicted that the intensities of the ordinary and extraordinary images of the lamina were respectively proportional to\n\n:I_o = \\cos^2i\\,\\cos^2(i{-}s) + \\sin^2i\\,\\sin^2(i{-}s) + \\tfrac{1}{2}\\sin 2i\\,\\sin 2(i{-}s)\\cos\\phi\\,,\n\n:I_e = \\cos^2i\\,\\sin^2(i{-}s) + \\sin^2i\\,\\cos^2(i{-}s) - \\tfrac{1}{2}\\sin 2i\\,\\sin 2(i{-}s)\\cos\\phi\\,,\n\nwhere i is the angle from the initial plane of polarization to the optic axis of the lamina, s is the angle from the initial plane of polarization to the plane of polarization of the final ordinary image, and \\phi is the phase lag of the extraordinary wave relative to the ordinary wave due to the difference in propagation times through the lamina. The terms in \\phi are the frequency-dependent terms and explain why the lamina must be thin in order to produce discernible colors: if the lamina is too thick, \\cos\\phi will pass through too many cycles as the frequency varies through the visible range, and the eye (which divides the visible spectrum into only three bands) will not be able to resolve the cycles.\n\nFrom these equations it is easily verified that \\,I_o+I_e=1\\, for all \\phi, so that the colors are complementary. Without the phase-inversion rule, there would be a plus sign in front of the last term in the second equation, so that the \\phi-dependent term would be the same in both equations, implying (incorrectly) that the colors were of the same hue.\n\nThese equations were included in an undated note that Fresnel gave to Biot,Fresnel, 1866–70, vol.1, pp.533–7. On the provenance of the note, see p.523. In the above text, φ is an abbreviation for Fresnel's , where e and o are the numbers of cycles taken by the extraordinary and ordinary waves to travel through the lamina. to which Biot added a few lines of his own. If we substitute\n\n:U\\cos^2\\tfrac{\\phi}{2}  and  A\n\\sin^2\\tfrac{\\phi}{2}\\,,\n\nthen Fresnel's formulae can be rewritten as\n\n: \\!I_o = U\\cos^2 s + A\\cos^2(2i-s)\\,,\n:   I_e = U\\sin^2 s + A\\sin^2(2i-s)\\,,\n\nwhich are none other than Biot's empirical formulae of 1812,Buchwald, 1989, p.97; Frankel, 1976, p. 148. except that Biot interpreted U and A as the \"unaffected\" and \"affected\" selections of the rays incident on the lamina. If Biot's substitutions were accurate, they would imply that his experimental results were more fully explained by Fresnel's theory than by his own.\n\nArago delayed reporting on Fresnel's works on chromatic polarization until June 1821, when he used them in a broad attack on Biot's theory. In his written response, Biot protested that Arago's attack went beyond the proper scope of a report on the nominated works of Fresnel. But Biot also claimed that the substitutions for U and A, and therefore Fresnel's expressions for I_o and I_e, were empirically wrong because when Fresnel's intensities of spectral colors were mixed according to Newton's rules, the squared cosine and sine functions varied too smoothly to account for the observed sequence of colors. That claim drew a written reply from Fresnel, who disputed whether the colors changed as abruptly as Biot claimed, and whether the human eye could judge color with sufficient objectivity for the purpose. On the latter question, Fresnel pointed out that different observers may give different names to the same color. Furthermore, he said, a single observer can only compare colors side-by-side; and even if they are judged to be the same, the identity is of sensation, not necessarily of composition. Fresnel's oldest and strongest point — that thin crystals were subject to the same laws as thick ones and did not need or allow a separate theory — Biot left unanswered.  Arago and Fresnel were seen to have won the debate.Buchwald, 1989, pp.237–51; Levitt, 2009, pp.54–7; Frankel, 1976, pp.165–8; Darrigol, 2012, pp.208–9.\n\nMoreover, by this time Fresnel had a new, simpler derivation of his equations on chromatic polarization.\n\nBreakthrough: Pure transverse waves (1821) \n\nIn the draft memoir of 30 August 1816, Fresnel mentioned two hypotheses — one of which he attributed to Ampère — by which the non-interference of orthogonally-polarized beams could be explained if polarized light waves were partly transverse. But Fresnel could not develop either of these ideas into a comprehensive theory. According to his later account, both he and Ampère realized as early as September 1816 that the non-interference of orthogonally-polarized beams, together with the phase-inversion rule in chromatic polarization, would be most easily explained if the waves were purely transverse. But that would raise a new difficulty: as natural light seemed to be unpolarized and its waves were therefore presumed to be longitudinal, one would need to explain how the longitudinal component of vibration disappeared on polarization, and why it did not reappear when polarized light was reflected or refracted obliquely by a glass plate.Buchwald, 1989, pp.205–6,208,212.\n\nIndependently, on 12 January 1817, Young wrote to Arago (in English) noting that a transverse vibration would constitute a polarization, and that if two longitudinal waves crossed at a significant angle, they could not cancel without leaving a residual transverse vibration.Young, 1855, p.383. Young repeated this idea in an article published in a supplement to the Encyclopædia Britannica in February 1818, in which he added that Malus's law would be explained if polarization consisted in a transverse motion.\n\nThus Fresnel, by his own testimony, may not have been the first person to suspect that light waves could have a transverse component, or that polarized waves were exclusively transverse. And it was Young, not Fresnel, who first published the idea that polarization depends on the orientation of a transverse vibration. But these incomplete theories had not reconciled the nature of polarization with the apparent existence of unpolarized light; that achievement was to be Fresnel's alone.\n\nIn a note that Buchwald dates in the summer of 1818, Fresnel entertained the idea that unpolarized waves could have vibrations of the same energy and obliquity, with their orientations distributed uniformly about the wave-normal, and that the degree of polarization was the degree of non-uniformity in the distribution. Two pages later he noted, apparently for the first time in writing, that his phase-inversion rule and the non-interference of orthogonally-polarized beams would be easily explained if the vibrations of fully polarized waves were \"perpendicular to the normal to the wave\" — that is, purely transverse.Buchwald, 1989, pp.225–6; Fresnel, 1866–70, vol.1, pp.526–7,529.\n\nBut if he could account for lack of polarization by averaging out the transverse component, he did not also need to assume a longitudinal component. It was enough to suppose that light waves are purely transverse, hence always polarized in the sense of having a particular transverse orientation, and that the \"unpolarized\" state of natural or \"direct\" light is due to rapid and random variations in that orientation, in which case two coherent portions of \"unpolarized\" light will still interfere because their orientations will be synchronized.\n\nWe do now know exactly when Fresnel made this last step, because there is no relevant documentation from 1820 or early 1821Buchwald, 1989, p.226. (perhaps because he was too busy working on lighthouse-lens prototypes; see below). But he first published the idea in a paper on \"Calcul des teintes…\" (\"calculation of hues…\"), serialized in Arago's Annales for May, June, and July 1821. In the first installment, Fresnel described \"direct\" (unpolarized) light as \"the rapid succession of systems of waves polarized in all directions\",Buchwald, 1989, p.227; Fresnel, 1866–70, vol.1, p.612. and gave the modern explanation of chromatic polarization. In the second installment, he revealed the suspicion that he and Ampère had harbored since 1816, and the difficulty it raised.Buchwald, 1989, p.212; Fresnel, 1866–70, vol.1, pp.629–30. He continued:\n\nAccording to this new view, he wrote, \"the act of polarization consists not in creating transverse motions, but in decomposing them in two fixed, mutually perpendicular directions, and in separating the two components\".Buchwald, 1989, p.228; Fresnel, 1866–70, vol.1, p.636; emphasis added by Buchwald.\n\nWhile selectionists could insist on interpreting Fresnel's diffraction integrals in terms of discrete, countable rays, they could not do the same with his theory of polarization. For a selectionist, the state of polarization of a beam concerned the distribution of orientations over the population of rays, and that distribution was presumed to be static. For Fresnel, the state of polarization of a beam concerned the variation of a displacement over time. That displacement might be constrained but was not static, and rays were geometric constructions, not countable objects. The conceptual gap between the wave theory and selectionism had become unbridgeable.Cf. Buchwald, 1989, p.230.\n\nThe other difficulty posed by pure transverse waves, of course, was the apparent implication that the aether was an elastic solid (!) but, unlike other elastic solids, incapable of transmitting longitudinal waves. The wave theory was cheap on assumptions, but its latest assumption was expensive on credulity. If that assumption was to be widely entertained, its explanatory power would need to be impressive.\n\nPartial reflection (1821) \n\nIn the second installment of \"Calcul des teintes\" (June 1821), Fresnel supposed, by analogy with sound waves, that the density of the aether in a refractive medium was inversely proportional to the square of the wave velocity, and therefore directly proportional to the square of the refractive index. For reflection and refraction at the surface between two isotropic media of different indices, Fresnel decomposed the transverse vibrations into two perpendicular components, now known as the s and p components, which are parallel to the surface and the plane of incidence, respectively; in other words, the s and p components are respectively square and parallel to the plane of incidence.The s originally comes from the German senkrecht, meaning perpendicular (to the plane of incidence). For the s component, Fresnel supposed that the interaction between the two media was analogous to an elastic collision, and obtained a formula for what we now call the reflectivity: the ratio of the reflected intensity to the incident intensity. The predicted reflectivity was non-zero at all angles.Buchwald, 1989, pp.388–90; Fresnel, 1866–70, vol.1, p.643.\n\nThe third installment (July 1821) was a short \"postscript\" in which Fresnel announced that he had found, by a \"mechanical solution\", a formula for the reflectivity of the p component, which predicted that the reflectivity was zero at the Brewster angle. So polarization by reflection had been accounted for, with the proviso that the direction of vibration in Fresnel's model was perpendicular to the plane of polarization as defined by Malus. (On the ensuing controversy, see Plane of polarization.) For other angles of incidence, the technology of the time did not allow the s and p reflectivities to be measured accurately enough to test Fresnel's formulae. But the formulae could be rewritten in terms of what we now call the reflection coefficient: the signed ratio of the reflected amplitude to the incident amplitude. Then, if the plane of polarization of the incident ray was at 45° to the plane of incidence, the tangent of the corresponding angle for the reflected ray was obtainable from the ratio of the two reflection coefficients, and this angle could be measured. Fresnel measured it for a range of angles of incidence, for glass and water, and the agreement between the calculated and measured angles was better than 1.5° in all cases.Buchwald, 1989, pp.390–91; Fresnel, 1866–70, vol.1, pp.646–8.\n\nFresnel gave details of the \"mechanical solution\" in a memoir read to the Académie des Sciences on 7 January 1823. Conservation of energy was combined with continuity of the tangential vibration at the interface.Buchwald, 1989, pp.391–3; Whittaker, 1910, pp.133–5. The resulting formulae for the reflection coefficients and reflectivities became known as the Fresnel equations. The reflection coefficients for the s and p polarizations are most succinctly expressed as\n\n:r_s-\\frac{\\sin(i-r)}{\\sin(i+r)} and r_p\n\\frac{\\tan(i-r)}{\\tan(i+r)}\\,,\n\nwhere i and r are the angles of incidence and refraction.Whittaker, 1910, p.134; Fresnel, 1866–70, vol.1, pp.773,757. By allowing the coefficients to be complex, Fresnel even accounted for the different phase shifts of the s and p components due to total internal reflection.Buchwald, 1989, pp.393–4; Whittaker, 1910, pp.135–6.\n\nNowadays the Fresnel equations are extended to opaque media by using a complex refractive index. The equations are fundamental in predicting the appearance of objects under illumination — for example, in computer graphics (see Physically based rendering).\n\nCircular and elliptical polarization, optical rotation (1822) \n\nIn a memoir dated 9 December 1822, Fresnel coined the terms linear polarization (French: polarisation rectiligne) for the simple case in which the perpendicular components of vibration are in phase or 180° out of phase, circular polarization for the case in which they are of equal magnitude and a quarter-cycle (±90°) out of phase, and elliptical polarization for other cases in which the two components have a fixed amplitude ratio and a fixed phase difference. He then explained how optical rotation could be understood as a species of birefringence. Linearly-polarized light could be resolved into two circularly-polarized components rotating in opposite directions. If these components propagated at slightly different speeds, the phase difference between them — and therefore the direction of their linearly-polarized resultant — would vary continuously with distance.Buchwald, 1989, pp.230–32,442.\n\nThese concepts called for a redefinition of the distinction between polarized and unpolarized light. Before Fresnel, it was thought that polarization could vary in direction, and in degree (e.g., due to variation in the angle of reflection off a transparent body), and that it could be a function of color (chromatic polarization), but not that it could vary in kind. Hence it was thought that the degree of polarization was the degree to which the light could be suppressed by an analyzer with the appropriate orientation. Light that had been converted from linear to elliptical or circular polarization (e.g., by passage through a crystal lamina, or by total internal reflection) was described as partly or fully \"depolarized\" because of its behavior in an analyzer. After Fresnel, the defining feature of polarized light was that the perpendicular components of vibration had a fixed ratio of amplitudes and a fixed difference in phase. By that definition, elliptically or circularly polarized light is fully polarized although it cannot be fully suppressed by an analyzer alone.Cf. Buchwald, 1989, p.232. The conceptual gap between the wave theory and selectionism had widened again.\n\nTotal internal reflection (1817–23) \n\nBy 1817 it had been discovered by Brewster, but not adequately reported,Lloyd, 1834, p.368. that plane-polarized light was partly depolarized by total internal reflection if initially polarized at an acute angle to the plane of incidence. Fresnel rediscovered this effect and investigated it by including total internal reflection in a chromatic-polarization experiment. With the aid of his first theory of chromatic polarization, he found that the apparently depolarized light was a mixture of components polarized parallel and perpendicular to the plane of incidence, and that the total reflection introduced a phase difference between them.Darrigol, 2012, p.207. Choosing an appropriate angle of incidence (not yet exactly specified) gave a phase difference of 1/8 of a cycle (45°). Two such reflections from the \"parallel faces\" of \"two coupled prisms\" gave a phase difference of 1/4 of a cycle (90°). These findings were contained in a memoir submitted to the Académie on 10 November 1817 and read a fortnight later. An undated marginal note indicates that the two coupled prisms were later replaced by a single \"parallelepiped in glass\" — now known as a Fresnel rhomb.\n\nThis was the memoir whose \"supplement\", dated January 1818, contained the method of superposing sinusoidal functions and the restatement of Malus's law in terms of amplitudes. In the same supplement, Fresnel reported his discovery that optical rotation could be imitated by passing the polarized light through a Fresnel rhomb (still in the form of \"coupled prisms\"), followed by an ordinary birefringent lamina sliced parallel to its axis, with the axis at 45° to the plane of reflection of the Fresnel rhomb, followed by a second Fresnel rhomb at 90° to the first.Buchwald, 1989, pp.223,336; on the latter page, a \"prism\" means a Fresnel rhomb or equivalent.\n\nThe connection between optical rotation and birefringence was further described in 1822, in the memoir on elliptical and circular polarization. This was followed by the memoir on reflection, read in January 1823, in which Fresnel quantified the phase shifts in total internal reflection, and thence calculated the precise angle at which a Fresnel rhomb should be cut in order to convert linear polarization to circular polarization. For a refractive index of 1.51, there were two solutions: about 48.6° and 54.6°.\n\nDouble refraction \n\nBackground: Uniaxial and biaxial crystals; Biot's laws \n\nWhen light passes through a slice of calcite cut perpendicular to its optic axis, the difference between the propagation times of the ordinary and extraordinary waves has a second-order dependence on the angle of incidence. If the slice is observed in a highly convergent cone of light, that dependence becomes significant, so that a chromatic-polarization experiment will show a pattern of concentric rings. But most minerals, when observed in this manner, show a more complicated pattern of rings involving two foci and a lemniscate curve, as if they had two optic axes.Jenkins & White, 1976, pp.576–9 (§27.9, esp. Fig.27M). The two classes of minerals naturally become known as uniaxal and biaxal — or, in later literature, uniaxial and biaxial.\n\nIn 1813, Brewster observed the simple concentric pattern in \"beryl, emerald, ruby &c.\" The same pattern was later observed in calcite by Wollaston, Biot, and Seebeck.  Biot, assuming that the concentric pattern was the general case, tried to calculate the colors with his theory of chromatic polarization, and succeeded better for some minerals than for others. In 1818, Brewster belatedly explained why: seven of the twelve minerals employed by Biot had the lemniscate pattern, which Brewster had observed as early as 1812; and the minerals with the more complicated rings also had a more complicated law of refraction.Buchwald, 1989, pp.254–5,402.\n\nIn a uniform crystal, according to Huygens' theory, the secondary wavefront that expands from the origin in unit time is the ray-velocity surface — that is, the surface whose \"distance\" from the origin in any direction is the ray velocity in that direction. In calcite, this surface is two-sheeted, consisting of a sphere (for the ordinary wave) and an oblate spheroid (for the extraordinary wave) touching each other at opposite points of a common axis — touching at the north and south poles, as it were. But according to Malus's corpuscular theory of double refraction, the ray velocity was proportional to the reciprocal of that given by Huygens' theory, in which case the velocity law was of the form\n\n:v_o^{2\\!}-v_e^2 = k\\sin^2\\theta \\,,\n\nwhere v_o and v_e were the ordinary and extraordinary ray velocities according to the corpuscular theory, and \\theta was the angle between the ray and the optic axis.Cf. Buchwald, 1989, p.269. By Malus's definition, the plane of polarization of a ray was the plane of the ray and the optic axis if the ray was ordinary, or the perpendicular plane (containing the ray) if the ray was extraordinary. In Fresnel's model, the direction of vibration was normal to the plane of polarization. Hence, for the sphere (the ordinary wave), the vibration was along the lines of latitude (to continue the geographic analogy); and for the spheroid (the extraordinary wave), the vibration was along the lines of longitude.\n\nOn 29 March 1819,Grattan-Guinness, 1990, p.885. Biot presented a memoir in which he proposed simple generalizations of Malus's rules for a crystal with two axes, and reported that both generalizations seemed to be confirmed by experiment. For the velocity law, the squared sine was replaced by the product of the sines of the angles from the ray to the two axes (Biot's sine law). And for the polarization of the ordinary ray, the plane of the ray and the axis was replaced by the plane bisecting the dihedral angle between the two planes each of which contained the ray and one axis (Biot's dihedral law).Buchwald, 1989, pp.269,418. It appears that the dihedral law was also proposed separately at an earlier date (p.459, ref.1817). Biot's laws meant that a biaxial crystal with axes at a small angle, cleaved in the plane of those axes, behaved nearly like a uniaxial crystal at near-normal incidence; this was fortunate because gypsum, which had been used in chromatic-polarization experiments, is biaxial.Cf. Fresnel, 1822a, tr. Young, in Quarterly Journal of Science, Literature, and Art, Jul.–Dec.1828, at pp.[https://books.google.com/books?idN69MAAAAYAAJ&pg\nPA178 178–9].\n\nFirst memoir and supplements (1821–22) \n\nUntil Fresnel turned his attention to biaxial birefringence, it was assumed that one of the two refractions was ordinary, even in biaxial crystals.Buchwald, 1989, p.260. But, in a memoir submittedIn Fresnel's collected works (1866–70), a paper is said to have been \"presented\" (\"présenté\") if it was merely delivered to the Permanent Secretary of the Académie for witnessing or processing (cf. vol.1, p.487; vol.2, pp.261,308). In such cases this article prefers the generic word \"submitted\", to avoid the impression that the paper had a formal reading. on 19 November 1821,Printed in Fresnel, 1866–70, vol.2, pp.261–308. Fresnel reported two experiments on topaz showing that neither refraction was ordinary in the sense of satisfying Snell's law; that is, neither ray was the product of spherical secondary waves.Buchwald, 1989, pp.261–7.\n\nThe same memoir contained Fresnel's first attempt at the biaxial velocity law. For calcite, if we interchange the equatorial and polar radii of Huygens' oblate spheroid while preserving the polar direction, we obtain a prolate spheroid touching the sphere at the equator. A plane through the center/origin cuts this prolate spheroid in an ellipse whose major and minor semi-axes give the magnitudes of the extraordinary and ordinary ray velocities in the direction normal to the plane, and (said Fresnel) the directions of their respective vibrations. The direction of the optic axis is the normal to the plane for which the ellipse of intersection reduces to a circle. So, for the biaxial case, Fresnel simply replaced the prolate spheroid with a triaxial ellipsoid, which he called the \"ellipsoid of elasticity\", to be sectioned by a plane in the same way. In general there would be two planes passing through the center of the ellipsoid and cutting it in a circle, and the normals to these planes would give two optic axes. From the geometry, Fresnel deduced Biot's sine law (with the ray velocities replaced by their reciprocals).Buchwald, 1989, pp.268–72.\n\nThe \"ellipsoid of elasticity\" indeed gave the correct ray velocities, although the initial experimental verification was only approximate. But it did not give the correct directions of vibration, for the biaxial case or even for the uniaxial case, because the vibrations in Fresnel's model were tangential to the wavefront, which is not generally normal to the ray (for an extraordinary ray). This mistake was corrected in an \"extract\" that Fresnel read to the Académie a week later, on 26 November. Starting with Huygens' spheroid, Fresnel obtained the 4th-degree \"surface of elasticity\" which, when sectioned by a plane as above, would yield the wave-normal velocities for a wavefront in that plane, together with their vibration directions. For the biaxial case, he generalized the surface to allow three unequal principal dimensions. But he retained the former \"ellipsoid of elasticity\" as an approximation, from which he deduced Biot's dihedral law.Buchwald, 1989, pp.274–9.\n\nFresnel's initial derivation of the \"surface of elasticity\" had been purely geometric, and not deductively rigorous. His first attempt at a mechanical derivation, contained in a \"supplement\" dated 13 January 1822, assumed that (i) there were three mutually perpendicular directions in which a displacement produced a reaction in the same direction, (ii) the reaction was otherwise a linear function of the displacement, and (iii) the radius of the surface in any direction was the square root of the component, in that direction, of the reaction to a unit displacement in that direction. The last assumption recognized the requirement that if a wave was to maintain a fixed direction of propagation and a fixed direction of vibration, the reaction must not be outside the plane of those two directions.Buchwald, 1989, pp.279–80.\n\nIn the same supplement, Fresnel considered how he might find, for the biaxial case, the secondary wavefront that expands from the origin in unit time — that is, the surface that reduces to Huygens' sphere and spheroid in the uniaxial case. He noted that this \"wave surface\" (surface de l'onde) is tangential to all possible plane wavefronts that could have crossed the origin one unit of time ago, and he listed the mathematical conditions that it must satisfy. But he doubted the feasibility of deriving the surface from those conditions.Fresnel, 1866–70, vol.2, pp.340,361–3; Buchwald, 1989, pp.281–3. The derivation of the \"wave surface\" from its tangent planes was eventually accomplished by Ampère in 1828 (Lloyd, 1834, pp.386–7; Darrigol, 2012, p.218; Buchwald, 1989, pp.281,457).\n\nIn a \"second supplement\",Fresnel, 1866–70, vol.2, pp.369–442. Fresnel eventually exploited two related facts: (i) the \"wave surface\" was also the ray-velocity surface, which could be obtained by sectioning what he had mistakenly called the \"ellipsoid of elasticity\"; and (ii) the \"wave surface\" intersected each plane of symmetry of the ellipsoid in two curves: a circle and an ellipse. Thus he found that the \"wave surface\" is described by the 4th-degree equation\n\n:r^2\\big(a^2x^{2\\!}+ b^2y^{2\\!}+ c^2z^2\\big) - a^2\\big(b^{2\\!} + c^2\\big)x^2 - b^2\\big(c^{2\\!} + a^2\\big)y^2 - c^2\\big(a^{2\\!} + b^2\\big)z^2 + a^2b^2c^2 =\\, 0\\,,\n\nwhere \\,r^2 = x^{2\\!} + y^{2\\!} + z^2,\\, and \\,a,b,c\\, are the propagation speeds in directions normal to the coordinate axes for vibrations along the axes (the ray and wave-normal speeds being the same in those special cases).Buchwald, 1989, pp.283–5; Darrigol, 2012, pp.217–18; Fresnel, 1866–70, vol.2, pp.386–8. Later commentators put the equation in the more compact and memorable form\n\n:\\frac{x^2}{r^2-a^2} + \\frac{y^2}{r^2-b^2} + \\frac{z^2}{r^2-c^2} \\,=\\, 1\\,.\n\nEarlier in the \"second supplement\", Fresnel modeled the aether as an array of point-masses and found that the force-displacement relation was described by a symmetric matrix, confirming the existence of three mutually perpendicular axes on which the displacement produced a parallel force.Grattan-Guinness, 1990, pp.891–2; Fresnel, 1866–70, vol.2, pp.371–9. Later in the document, he noted that in a biaxial crystal, unlike a uniaxial crystal, the directions in which there is only one wave-normal velocity are not the same as those in which there is only one ray velocity.Buchwald, 1989, pp.285–6; Fresnel, 1866–70, vol.2, p.396. Nowadays we refer to the former directions as the optic axes or binormal axes, and the latter as the ray axes or biradial axes (see Birefringence).\n\nFresnel's \"second supplement\" was signed on 31 March 1822 and submitted the next day — less than a year after the publication of his pure-transverse-wave hypothesis, and just less than a year after the demonstration of his prototype eight-panel lighthouse lens (see below).\n\nSecond memoir (1822–24) \n\nFresnel still wanted a mechanical foundation for the ray-velocity surface and Biot's dihedral law. He attended to these matters in his \"second memoir\" on double refraction, published in the Recueils of the Académie des Sciences for 1824, which were not actually printed until 1827 — the year of his death. Having confirmed the three perpendicular axes on which a displacement produced a parallel reaction, and thence constructed the surface of elasticity, he showed that Biot's dihedral law is exact provided that the binormals are taken as the optic axes, and the wave-normal direction as the direction of propagation.Buchwald, 1989, pp.286–7,447.\n\nFresnel's theory of the aether was a forerunner of the theory of transverse waves in non-isotropic elastic solids. His theory was not yet dynamically rigorous; for example, it considered only the displacement of one particle while all others were fixed, and simply assumed that the relation between the stiffness and the wave-normal velocity was analogous to that for longitudinal sound waves. But it was enough to enable the wave theory to do what selectionist theory could not: generate testable formulae covering a comprehensive range of optical phenomena, from mechanical assumptions.Buchwald, 1989, p.288.\n\nPhotoelasticity, multiple-prism experiments (1822) \n\nIn 1815, Brewster reported that colors appear when a slice of isotropic material, placed between crossed polarizers, is mechanically stressed. Brewster himself immediately and correctly attributed this phenomenon to stress-induced birefringence — now known as photoelasticity.\n\nIn a memoir read in September 1822, Fresnel announced that he had verified Brewster's diagnosis more directly, by compressing a combination of glass prisms so severely that one could actually see a double image through it. In his experiment, Fresnel lined up seven 45°-90°-45° prisms, short side to short side, with their 90° angles pointing in alternating directions. Two half-prisms were added at the ends to make the whole assembly rectangular. The prisms were separated by thin films of turpentine (térébenthine) to suppress internal reflections, allowing a clear line of sight along the row. When the four prisms with similar orientations were compressed in a vise, from apex to base across the line of sight, an object viewed through the assembly produced two images with perpendicular polarizations, with an apparent spacing of 1.5mm at one metre.Whewell, 1857, pp.355–6.\n\nAt the end of that memoir, Fresnel predicted that one could use an analogous arrangement of prisms, without compression, to verify that optical rotation is a form of birefringence. If the prisms were cut from monocrystalline quartz with their optic axes aligned along the row, and with alternating directions of optical rotation, an object seen by looking along the common optic axis would give two images, which would seem unpolarized if viewed through an analyzer alone; but if viewed through a Fresnel rhomb, they would be polarized at ±45° to the plane of reflection (because they would initially be circularly polarized in opposite directions). In the memoir of December 1822, in which he introduced the term circular polarization, he reported that he had confirmed this prediction. To obtain a visible separation of the images, he needed only one 14°-152°-14° prism and two half-prisms; he merely remarked in passing that one could increase the separation by increasing the number of prisms.Fresnel, 1866–70, vol.1, pp.737–9.  Cf. Whewell, 1857, p.356–8; Jenkins & White, 1976, pp.589–90.\n\nReception \n\nFor the supplement to Riffault's translation of Thomson's System of Chemistry, Fresnel was chosen to contribute the article on light. The resulting 137-page essay, titled De la Lumière (On Light),Fresnel, 1822a. was apparently finished in June 1821 and published by February 1822.Grattan-Guinness, 1990, p.884. With sections covering the nature of light, diffraction, thin-film interference, reflection and refraction, double refraction and polarization, chromatic polarization, and modification of polarization by reflection, it made a comprehensive case for the wave theory to a readership that was not restricted to physicists.Cf. Frankel, 1976, p.169.\n\nTo examine Fresnel's first memoir and supplements on double refraction, the Académie des Sciences appointed Ampère, Arago, Fourier, and Poisson.Fresnel, 1866–70, vol.2, pp.261n,369n. Their report,Printed in Fresnel, 1866–70, vol.2, pp.459–64. of which Arago was clearly the main author, was delivered at the meeting of 19 August 1822. Then, in the words of Émile Verdet, as translated by Ivor Grattan-Guinness:\n\nWhether Laplace was announcing his conversion to the wave theory — at the age of 73 — is uncertain. Grattan-Guinness entertained the idea.Grattan-Guinness, 1990, p.898. Buchwald, noting that Arago failed to explain that the \"ellipsoid of elasticity\" did not give the correct planes of polarization, suggests that Laplace may have merely regarded Fresnel's theory as a successful generalization of Malus's ray-velocity law, embracing Biot's laws.Buchwald, 1989, pp.289–90.\n\nIn the following year, Poisson, who did not sign Arago's report, disputed the possibility of transverse waves in the aether. Starting from assumed equations of motion of a fluid medium, he noted that they did not give the correct results for partial reflection and double refraction — as if that were Fresnel's problem rather than his own — and that the predicted waves, even if they were initially transverse, became more longitudinal as they propagated. In reply Fresnel noted, inter alia, that the equations in which Poisson put so much faith did not even predict viscosity. The implication was clear: given that the behavior of light had not been satisfactorily explained except by transverse waves, it was not the responsibility of the wave-theorists to abandon transverse waves in deference to pre-conceived notions about the aether; rather, it was the responsibility of the aether modelers to produce a model that accommodated transverse waves.Frankel, 1976, pp.170–71. According to Eugene Frankel, Poisson eventually accepted the wave theory in the late 1830s.Frankel, 1976, p.173, citing Fresnel, 1866–70, vol.1, p.lxxxix, note2.  But cf. Worrall, 1989, p.140.\n\nAmong the French, Poisson's reluctance was an exception. According to Frankel, \"in Paris no debate on the issue seems to have taken place after 1825. Indeed, almost the entire generation of physicists and mathematicians who came to maturity in the 1820s — Pouillet, Savart, Lamé, Navier, Liouville, Cauchy — seem to have adopted the theory immediately.\" Fresnel's other prominent French opponent, Biot, appeared to take a neutral position in 1830, and eventually accepted the wave theory — possibly by 1846 and certainly by 1858.Frankel, 1976, pp.173–4.\n\nIn 1826, the British astronomer John Herschel addressed three questions to Fresnel concerning double refraction and partial reflection, and their relation to polarization. The resulting article by Herschel, titled simply \"Light\", was highly sympathetic to the wave theory, although not entirely free of selectionist language. It was circulating privately by 1828 and was published in the Encyclopædia Metropolitana in 1830.Buchwald, 1989, pp.291–6; Darrigol, 2012, pp.220–21,303. Meanwhile, Young's translation of Fresnel's De la Lumière was published in installments from 1827 to 1829.Fresnel, 1822a; Kipnis, 1991, pp.227–8. George Biddell Airy, the former Lucasian Professor at Cambridge and future Astronomer Royal, unreservedly accepted the wave theory by 1831.Buchwald, 1989, p.296. In 1834 he famously calculated the diffraction pattern of a circular aperture from the wave theory, thereby explaining the limited angular resolution of a perfect telescope (see Airy disk). By the end of the 1830s, the only prominent British physicist who held out against the wave theory was Brewster, whose objections included the difficulty of explaining photochemical effects and (in his opinion) dispersion.Darrigol, 2012, pp.222–3,248.\n\nA German translation of De la Lumière was published in installments in 1825 and 1828. The wave theory was adopted by Fraunhofer in the early 1820s and by Franz Ernst Neumann in the 1830s, and then began to find favor in German textbooks.Kipnis, 1991, pp.225,227; Darrigol, 2012, pp.223,245.\n\nHence, in 1850, when Foucault and Fizeau found by experiment that light travels more slowly in water than in air, in accordance with the wave explanation of refraction and contrary to the corpuscular explanation, the result came as no surprise.Darrigol, 2012, p.223.\n\nLighthouses and the Fresnel lens \n\nPrior art \n\nFresnel was not the first person to focus a lighthouse beam using a lens. That distinction apparently belongs to the London glass-cutter Thomas Rogers, who proposed the idea to Trinity House in 1788. The first Rogers lenses, 53cm in diameter and 14cm thick at the center, were installed at the Old Lower Lighthouse at Portland Bill in 1789.Levitt, 2013, p.57. Further samples followed at Howth Baily, North Foreland, and at least four other locations. But much of the light was wasted by absorption in the glass.\n\nNor was Fresnel the first to suggest replacing a convex lens with a series of concentric annular prisms, to reduce weight and absorption. In 1748, Count Buffon proposed grinding such prisms as steps in a single piece of glass. In 1790 (although secondary sources give the date as 1773 or 1788), the Marquis de Condorcet suggested that it would be easier to make the annular sections separately and assemble them on a frame; but even that was impractical at the time.Levitt, 2013, p.71. These designs were intended not for lighthouses, but for burning glasses. Brewster, however, proposed a system similar to Condorcet's in 1811, and by 1820 was advocating its use in British lighthouses.\n\nPrototypes \n\nMeanwhile, on 21 June 1819, Fresnel was temporarily seconded by the Commission des Phares (Commission of Lighthouses) on the recommendation of Arago (a member of the Commission since 1813), to review possible improvements in lighthouse illumination.Levitt, 2013, pp.51,53; Fresnel, 1866–70, vol.1, p.xcvii. The Commission had been established by Napoleon in 1811, and placed under the Corps des Ponts — Fresnel's employer.Levitt, 2013, pp.49–50.\n\nOn 29 August 1819, unaware of the Buffon-Condorcet-Brewster proposal, Fresnel presented his first report, in which he recommended what he called lentilles à échelons (lenses by steps) to replace the reflectors then in use, which reflected only about half of the incident light.Levitt, 2013, pp.56,58. One of the assembled commissioners, Jacques Charles, recalled Buffon's suggestion. Fresnel was disappointed to discover that he had again \"broken through an open door\". But, whereas Buffon's version was biconvex and in one piece, Fresnel's was plano-convex and made of multiple prisms for easier construction. With an official budget of 500 francs, Fresnel approached three manufacturers. The third, François Soleil, found a way to remove defects by reheating and remolding the glass. Arago assisted Fresnel with the design of a modified Argand lamp with concentric wicks (a concept that Fresnel attributed to Count RumfordFresnel, 1822b, p.11.), and accidentally discovered that fish glue was heat-resistant, making it suitable for use in the lens. The prototype, with a lens panel 55cm square, containing 97 polygonal (not annular) prisms, was finished in March 1820 — and so impressed the Commission that Fresnel was asked for a full eight-panel version. Completed a year later, largely at Fresnel's personal expense, this model had panels 72cm square. In a public spectacle on the evening of 13 April 1821, it was demonstrated by comparison with the most recent reflectors, which it suddenly rendered obsolete.Levitt, 2013, pp.59–66.\n\n(Fresnel acknowledged the British lenses and Buffon's invention in a memoir published in 1822.Fresnel, 1822b, pp.2–4. The date of that memoir may be the source of the claim that Fresnel's lighthouse advocacy began two years later than Brewster's; but the text makes it clear that Fresnel's involvement began no later than 1819.Fresnel, 1822b, p.1.)\n\nFresnel's innovations \n\nFresnel's next lens was a rotating apparatus with eight \"bull's-eye\" panels, made in annular arcs by Saint-Gobain, giving eight rotating beams — to be seen by mariners as a periodic flash. Above and behind each main panel was a smaller, sloping bull's-eye panel of trapezoidal outline with trapezoidal elements. This refracted the light to a sloping plane mirror, which then reflected it horizontally, 7 degrees ahead of the main beam, increasing the duration of the flash.Fresnel, 1822b, pp.13,25. Below the main panels were 128 small mirrors arranged in four rings, stacked like the slats of a louver or Venetian blind. Each ring, shaped like a frustum of a cone, reflected the light to the horizon, giving a fainter steady light between the flashes. The official test, conducted on the unfinished Arc de Triomphe on 20 August 1822, was witnessed by the Commission — and by Louis  and his entourage — from 32km away. The apparatus was stored at Bordeaux for the winter, and then reassembled at Cordouan Lighthouse under Fresnel's supervision. On 25 July 1823, the world's first lighthouse Fresnel lens was lit.Levitt, 2013, pp.72–3. It was about this time that Fresnel started coughing up blood.Levitt, 2013, p.97.\n\nIn May 1824, Fresnel was promoted to Secretary of the Commission des Phares, becoming the first member of that body to draw a salary.Levitt, 2013, p.82. He was also an examiner (not a teacher) at the École Polytechnique since 1821; but poor health, long hours during the examination season, and anxiety about judging others induced him to resign that post in late 1824, to save his energy for his lighthouse work.Grattan-Guinness, 1990, pp.914–15, citing Young, 1855, p.399; Arago, 1857, pp.467,470; Boutry, 1948, pp.601–2.\n\nIn the same year he designed the first fixed lens — for spreading light evenly around the horizon while minimizing waste above or below. This had the familiar reflecting (catoptric) rings above and below the refracting (dioptric) parts. But the curved refracting surfaces were segments of toroids about a common vertical axis, so that the dioptric panel looked like a cylindrical drum and the entire apparatus looked like a beehive.\n\nIn 1825 he unveiled the Carte des Phares (Lighthouse Map), calling for a system of 51 lighthouses plus smaller harbor lights, in a hierarchy of lens sizes (called orders, the first order being the largest), with different characteristics to facilitate recognition: a constant light (from a fixed lens), one flash per minute (from a rotating lens with eight panels), and two per minute (sixteen panels). On 1st February 1825, the second lighthouse Fresnel lens entered service: a third-order fixed lens at Dunkirk.Levitt, 2013, pp.83–4.\n\nAlso in 1825, Fresnel extended his fixed design by adding a rotating array outside the fixed array. Each panel of the rotating array refracted part of the fixed light from a horizontal fan into a narrow beam.\n\nTo reduce the loss of light in the reflecting elements, Fresnel proposed to replace each mirror with a catadioptric prism, through which the light would travel by refraction through the first surface, then total internal reflection off the second surface, then refraction through the third surface.Levitt, 2013, pp.79–80. The result was the lighthouse lens as we now know it. In 1826 he assembled a small model for use on the Canal Saint-Martin, but he did not live to see a full-sized version.\n\nThe first large catadioptric lenses were made in 1842 for the lighthouses at Gravelines and Île Vierge; these were fixed third-order lenses whose catadioptric rings (made in segments) were one metre in diameter. The first-order Skerryvore lens, installed in 1844, was only partly catadioptric; it was similar to the Cordouan lens except that the lower slats were replaced by French-made catadioptric prisms, while mirrors were retained at the top. The first fully catadioptric first-order lens, installed at Ailly in 1852, also gave eight rotating beams plus a fixed light at the bottom; but its top section had eight catadioptric panels focusing the light about 4 degrees ahead of the main beams, in order to lengthen the flashes. The first fully catadioptric lens with purely revolving beams — also of first order — was installed at Saint-Clément-des-Baleines in 1854, and marked the completion of Fresnel's original Carte des Phares.Levitt, 2013, pp.108–10, 113–16.\n\nLater developments \n\nProduction of one-piece stepped lenses (roughly as envisaged by Buffon) eventually became profitable. By the 1870s, in the United States, such lenses were made of pressed glass and used with small lights on ships and piers. Similar lenses are used in Fresnel lanterns for stage lighting. Lenses with finer steps serve as condensers in overhead projectors. Still finer steps can be found in low-cost plastic \"sheet\" magnifiers.\n\nHonors \n\nFresnel was elected to the Société Philomathique de Paris in April 1819,Kipnis, 1991, p.217. and in 1822 became one of the editors of the Société's Bulletin des Sciences.Frankel, 1976, p.172. As early as May 1817, at Arago's suggestion, Fresnel applied for membership of the Académie des Sciences, but received only one vote. The successful candidate on that occasion was Joseph Fourier. In November 1822, Fourier's elevation to Permanent Secretary of the Académie created a vacancy in the physics section, which was filled in February 1823 by Pierre Louis Dulong, with 36 votes to Fresnel's 20. But in May 1823, after another vacancy was left by the death of Jacques Charles, Fresnel's election was unanimous.Grattan-Guinness, 1990, pp.861,913–14; Arago, 1857, p.408. In 1824,Levitt, 2013, p.77. Fresnel was made a chevalier de la Légion d'honneur (Knight of the Legion of Honour).\n\nMeanwhile, in Britain, the wave theory was yet to take hold; Fresnel wrote to Thomas Young in November 1824, saying in part:\n\nBut \"the praise of English scholars\" soon followed. On 9 June 1825, Fresnel was made a Foreign Member of the Royal Society of London. In 1827 he was awarded the Society's Rumford Medal for the year 1824, \"For his Development of the Undulatory Theory as applied to the Phenomena of Polarized Light, and for his various important discoveries in Physical Optics.\"\n\nThe monument to Fresnel at his birthplace (see above) was dedicated on 14 September 1884 with a speech by , Permanent Secretary of the Académie des Sciences.  \"\" is among the 72 names embossed on the Eiffel Tower (on the south-east side, fourth from the left). In the 19th century, as every lighthouse in France acquired a Fresnel lens, every one acquired a bust of Fresnel, seemingly watching over the coastline that he had made safer.Levitt, 2013, p.233. The lunar features Promontorium Fresnel and Rimae Fresnel were later named after him.\n\nDecline and death \n\nFresnel's health, which had always been poor, deteriorated in the winter of 1822-3, increasing the urgency of his original research, and causing him to turn down an invitation from Young to write an article on double refraction for the Encyclopædia Britannica.Levitt, 2013, pp.75–6. The memoirs on circular and elliptical polarization and optical rotation, and on the detailed derivation of the Fresnel equations and their application to total internal reflection, date from this period. In the spring he recovered enough, in his own view, to supervise the lens installation at Cordouan. Soon afterwards, it became clear that his condition was tuberculosis.\n\nIn 1824 he was advised that if he wanted to live longer, he needed to scale back his activities. Perceiving his lighthouse work to be his most important duty, he resigned as an examiner at the École Polytechnique, and closed his scientific notebooks. His last note to the Académie, read on 13 June 1825, described the first radiometer and attributed the observed repulsive force to a temperature difference.Boutry, 1948, pp.601–2; Fresnel, 1866–70, vol.2, pp.667–72. Although his fundamental research ceased, his advocacy did not; as late as August or September 1826, he found the time to answer Herschel's queries on the wave theory.Fresnel, 1866–70, vol.2, pp.647–60. It was Herschel who recommended Fresnel for the Royal Society's Rumford Medal.Boutry, 1948, p.603.\n\nFresnel's cough worsened in the winter of 1826-7, leaving him too ill to return to Mathieu in the spring. In early June he was carried to Ville-d'Avray, 12km west of Paris. There his mother joined him. On 6 July, Arago arrived to deliver the Rumford Medal. Sensing Arago's distress, Fresnel whispered that \"the most beautiful crown means little, when it is laid on the grave of a friend.\" Fresnel did not have the strength to reply to the Royal Society. He died eight days later, on Bastille Day.Levitt, 2013, p.98; Arago, 1857, p.470; Boutry, 1948, pp.602–3.\n\nHe is buried at Père Lachaise Cemetery, Paris. The inscription on his headstone is partly eroded away; the legible part says, when translated, \"To the memory of Augustin Jean Fresnel, member of the Institute of France.\"\n\nPosthumous publications \n\nFresnel's \"second memoir\" on double refraction was not printed until 1827, the year of his death. Until then, the best published source on his work on double refraction was an extract of that memoir, printed in 1822.Buchwald, 1989, p.289. His final treatment of partial reflection and total internal reflection, read to the Académie in January 1823, was thought to be lost until it was rediscovered among the papers of the deceased Joseph Fourier (1768–1830), and was printed in 1831. Until then, it was known chiefly through an extract printed in 1823 and 1825. Most of Fresnel's writings on polarized light before 1821 — including his first theory of chromatic polarization (submitted 7 October 1816) and the crucial \"supplement\" of January 1818 — were not published in full until his Oeuvres complètes (\"complete works\") began to appear in 1866.Buchwald, 1989, pp.222,238,461–2. The \"supplement\" of July 1816, proposing the \"efficacious ray\" and reporting the famous double-mirror experiment, met the same fate,Grattan-Guinness, 1990, p.861. as did the \"first memoir\" on double refraction.Whittaker, 1910, p.125n.\n\nPublication of Fresnel's collected works was itself delayed by the deaths of successive editors. The task was initially entrusted to Félix Savary, who died in 1841. It was restarted twenty years later by the Ministry of Public Instruction. Of the three editors eventually named in the Oeuvres, Sénarmont died in 1862, Verdet in 1866, and Léonor Fresnel in 1869, by which time only two of the three volumes had appeared.Boutry, 1948, pp.603–4; Fresnel, 1866–70, vol.1, pp.i–vii. At the beginning of vol.3 (1870), the completion of the project is described in a long footnote by \"J. Lissajous.\"\n\nNot included in the OeuvresSilliman, 2008, p.171. are two short notes by Fresnel on magnetism, which were discovered among Ampère's manuscripts. In response to Ørsted's discovery of electromagnetism in 1820, Ampère initially supposed that the field of a permanent magnet was due to a macroscopic circulating current. Fresnel suggested instead that there was a microscopic current circulating around each particle of the magnet. In his first note, he argued that microscopic currents, unlike macroscopic currents, would explain why a hollow cylindrical magnet does not lose its magnetism when cut longitudinally. In his second note, dated 5 July 1821, he further argued that a macroscopic current had the counterfactual implication that a permanent magnet should be hot, whereas microscopic currents circulating around the molecules might avoid the heating mechanism. He was not to know that the fundamental units of permanent magnetism are even smaller than molecules (see Electron magnetic moment). The two notes, together with Ampère's acknowledgment, were eventually published in 1885.\n\nLost works \n\nFresnel's essay Rêveries of 1814 has not survived.Buchwald, 1989, p.116. While its content would have been interesting to historians, its quality may perhaps be gauged from the fact that Fresnel himself never referred to it in his maturity.Boutry, 1948, p.593. Moreover, contrary to Boutry, two footnotes in the Oeuvres allege that Fresnel himself consigned the Rêveries to oblivion (Fresnel, 1866–70, vol.1, pp.xxix–xxx, note 4, and p.6n).\n\nMore disturbing is the fate of a long article that Fresnel wrote in 1825, to be translated for the new English journal European Review. The journal failed before Fresnel's contribution could be published. Fresnel unsuccessfully tried to recover the manuscript, and the editors of his collected works were unable to find it. According to Grattan-Guinness, the article was \"apparently similar\" to the essay De la Lumière of 1821/22. But Fresnel's theories on polarization, total internal reflection, and double refraction had developed since then. Together, the circumstances suggest that the most comprehensive defense of the wave theory of light, by its most influential proponent, has been lost.\n\nUnfinished business \n\nAether drag and aether density \n\nIn 1810, Arago found experimentally that the degree of refraction of starlight does not depend on the direction of the earth's motion relative to the line of sight. In 1818, Fresnel showed that this result could be explained by the wave theory,Cf. Darrigol, 2012, pp.258–60. on the hypothesis that if an object with refractive index n moved at velocity v relative to the external aether (taken as stationary), then the velocity of light inside the object gained the additional component \\,v(1-1/n^2). He supported that hypothesis by supposing that if the density of the external aether was taken as unity, the density of the internal aether was n^2, of which the excess, namely \\,n^2{-}1\\,, was dragged along at velocity v, whence the average velocity of the internal aether was \\,v(1-1/n^2). The factor in parentheses, which Fresnel originally expressed in terms of wavelengths,Fresnel, 1866–70, vol.2, pp.627–36. became known as the Fresnel drag coefficient. (See Aether drag hypothesis.)\n\nIn his analysis of double refraction, Fresnel supposed that the different refractive indices in different directions within the same medium were due to a directional variation in elasticity, not density (because the concept of mass per unit volume is not directional). But in his treatment of partial reflection, he supposed that the different refractive indices of different media were due to different aether densities, not different elasticities. The latter decision is puzzling in the context of double refraction, but makes sense in the earlier context of aether drag.\n\nIn 1846, George Gabriel Stokes pointed out that there was no need to divide the aether inside a moving object into two portions; all of it could be considered as moving at a common velocity. Then, if the aether was conserved while its density changed in proportion to n^2, the resulting velocity of the aether inside the object was equal to Fresnel's additional velocity component.Whittaker, 1910, p.117.\n\nConversely, Fresnel could have started with the required additional velocity component, equated it to aether drag, combined that with conservation of aether, and arrived at the relation between refractive index and aether density, thereby justifying his choice in the case of partial reflection.\n\nDispersion \n\nThe analogy between light waves and transverse waves in elastic solids does not predict dispersion — that is, the frequency-dependence of the speed of propagation, which enables prisms to produce spectra and causes lenses to suffer from chromatic aberration. Fresnel, in De la Lumière and in the second supplement to his first memoir on double refraction, suggested that dispersion could be accounted for if the particles of the medium exerted forces on each other over distances that were significant fractions of a wavelength.Darrigol, 2012, p.246; Buchwald, 1989, pp.307–8; Fresnel, 1822a, tr. Young, in Quarterly Journal of Science, Literature, and Art, Jan.–Jun.1828, at pp.[https://books.google.com/books?idSbJMAAAAYAAJ&pg\nPA213 213–15].  Whittaker, 1910, p.132; Fresnel, 1866–70, vol.2, p.438. Later, more than once, Fresnel referred to the demonstration of this result as being contained in a note appended to his second memoir on double refraction. But no such note appeared in print,Lloyd, 1834, p.316. and the relevant manuscripts found after his death showed only that, around 1824, he was comparing refractive indices measured by Fraunhofer with a theoretical formula, the meaning of which was not fully explained.Fresnel, 1866–70, vol.1, p.xcvi. One obvious possibility is that the explanation was given in the missing note.\n\nIn the 1830s, Fresnel's suggestion was taken up by Cauchy, Powell, and Kelland, and it was indeed found to be tolerably consistent with the variation of refractive indices with wavelength over the visible spectrum, for a variety of transparent media (see Cauchy's equation).Whewell, 1857, pp.365–7; Darrigol, 2012, pp.246–9. These investigations were enough to show that the wave theory was at least compatible with dispersion. However, if the model of dispersion was to be accurate over a wider range of frequencies, it needed to be modified so as to take account of resonances within the medium (see Sellmeier equation).Darrigol, 2012, p.252.\n\nConical refraction \n\nThe analytical complexity of Fresnel's derivation of the ray-velocity surface was an implicit challenge to find a shorter path to the result. This was answered by James MacCullagh in 1830, and by William Rowan Hamilton in 1832.Lloyd, 1834, pp.387–8.\n\nHamilton went further, establishing two properties of the surface that Fresnel, in the short time given to him, had overlooked: (i) at each of the four points where the inner and outer sheets of the surface make contact, the surface has a tangent cone (tangential to both sheets), hence a cone of normals, indicating that a cone of wave-normal directions corresponds to a single ray-velocity vector; and (ii) around each of these points, the outer sheet has a circle of contact with a tangent plane, indicating that a cone of ray directions corresponds to a single wave-normal velocity vector. As Hamilton noted, these properties respectively imply that (i) a narrow beam propagating inside the crystal in the direction of the single ray velocity will, on exiting the crystal through a flat surface, break into a hollow cone (external conical refraction), and (ii) a narrow beam striking a flat surface of the crystal in the appropriate direction (corresponding to that of the single internal wave-normal velocity) will, on entering the crystal, break into a hollow cone (internal conical refraction).Lloyd, 1834, p.389.\n\nThus a new pair of phenomena, qualitatively different from anything previously observed or suspected, had been predicted by mathematics as consequences of Fresnel's theory. The prompt experimental confirmation of those predictions by Humphrey Lloyd brought Hamilton a prize that had never come to Fresnel: immediate fame.\n\nLegacy \n\nWithin a century after Fresnel's initial proposal, more than 10,000 lights with Fresnel lenses marked coastlines around the world.Levitt, 2013, p.19. The numbers of lives saved can only be guessed at. Concerning the other benefits, the science historian Theresa H. Levitt has remarked:\n\nIn the history of physical optics, Fresnel's successful revival of the wave theory nominates him as the pivotal figure between Newton, who held that light consisted of corpuscles, and Maxwell, who established that light waves are electromagnetic. Whereas Einstein described Maxwell's work as \"the most profound and the most fruitful that physics has experienced since the time of Newton,\" commentators of the era between Fresnel and Maxwell made similarly strong statements about Fresnel:\n\n* MacCullagh, as early as 1830, wrote that Fresnel's mechanical theory of double refraction \"would do honour to the sagacity of Newton\".\n\n* Lloyd, in his Report on the progress and present state of physical optics (1834) for the British Association for the Advancement of Science, surveyed previous knowledge of double refraction and declared:The theory of Fresnel to which I now proceed,— and which not only embraces all the known phenomena, but has even outstripped observation, and predicted consequences which were afterwards fully verified,— will, I am persuaded, be regarded as the finest generalization in physical science which has been made since the discovery of universal gravitation.Lloyd, 1834, p.382.In 1841 Lloyd published his Lectures on the Wave-theory of Light, in which he described Fresnel's transverse-wave theory as \"the noblest fabric which has ever adorned the domain of physical science, Newton's system of the universe alone excepted.\"\n\n* William Whewell, in all three editions of his History of the Inductive Sciences (1837, 1847, and 1857), at the end of Book , compared the histories of physical astronomy and physical optics and concluded:\n\nWhat Whewell called the \"true theory\" has since undergone two major revisions. The first, by Maxwell, specified the physical fields whose variations constitute the waves of light. The second, initiated by Einstein's explanation of the photoelectric effect, supposed that the energy of light waves was divided into quanta, which were eventually identified with particles called photons. But photons did not exactly correspond to Newton's corpuscles; for example, Newton's explanation of ordinary refraction required the corpuscles to travel faster in media of higher refractive index, which photons do not. Neither did photons displace waves; rather, they led to the paradox of wave–particle duality.\n\nAlthough Fresnel did not know that light waves are electromagnetic, he managed to construct the world's first coherent theory of light. In retrospect, this shows that his methods are applicable to multiple types of waves. And although light is now known to have both wavelike and particle-like aspects, it is the wavelike aspect that more easily explains the phenomena studied by Fresnel. In these respects, Fresnel's theory has stood the test of time, and Whewell's premature triumphalism contains an abiding truth. Augustin-Jean Fresnel. http://en.wikipedia.org/?curid=1141."
  }
}
