{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=8968",
  "eid" : "ebd25800-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778475392,
  "textBody" : "Devanagari ( ; ,  , a compound of \"deva\"  and \"nāgarī\" ; Hindi pronunciation:), also called Nagari (Nāgarī, ),Kathleen Kuiper (2010), The Culture of India, New York: The Rosen Publishing Group, , page 83 is an abugida (alphasyllabary) used in India and Nepal. It is written from left to right, has a strong preference for symmetrical rounded shapes within squared outlines, and is recognisable by a horizontal line that runs along the top of full letters. In a cursory look, the Devanagari script appears different from other Indic scripts such as Bengali-Assamese, Odia, or Gurmukhi, but a closer examination reveals they are very similar except for angles and structural emphasis.George Cardona and Danesh Jain (2003), The Indo-Aryan Languages, Routledge, , pages 72-74; Quote: \"(...) has a strong preference for symmertrical shapes, especially squared outlines and right angles (...)\".\n\nThe Nagari script has roots in the ancient Brāhmī script family.George Cardona and Danesh Jain (2003), The Indo-Aryan Languages, Routledge, , pages 68-69 Some of the earliest epigraphical evidence attesting to the developing Sanskrit Nagari script in ancient India, in a form similar to Devanagari, is from the 1st to 4th century CE inscriptions discovered in Gujarat., Rudradaman’s inscription from 1st through 4th century CE found in Gujarat, India, Stanford University Archives, pages 30-45, particularly Devanagari inscription on Jayadaman's coins pages 33-34 The Nagari script was in regular use by the 7th century CE and it was fully developed by about the end of first millennium. The use of Sanskrit in Nagari script in medieval India is attested by numerous pillar and cave temple inscriptions, including the 11th-century Udayagiri inscriptions in Madhya Pradesh,Michael Willis (2001), Inscriptions from Udayagiri: locating domains of devotion, patronage and power in the eleventh century, South Asian Studies, 17(1), pages 41-53 and an inscribed brick found in Uttar Pradesh, dated to be from 1217 CE, which is now held at the British Museum.[https://www.britishmuseum.org/explore/highlights/highlight_objects/asia/b/brick_with_sanskrit_inscriptio.aspx Brick with Sanskrit inscription in Nagari script], 1217 CE, found in Uttar Pradesh, India (British Museum) The script's proto- and related versions have been discovered in ancient relics outside of India, such as in Sri Lanka, Myanmar and Indonesia; while in East Asia, Siddha Matrika script considered as the closest precursor to Nagari was in use by Buddhists.Wayan Ardika (2009), Form, Macht, Differenz: Motive und Felder ethnologischen Forschens (Editors: Elfriede Hermann et al.), Universitätsverlag Göttingen, , pages 251-252; Quote: \"Nagari script and Sanskrit language in the inscription at Blangjong suggests that Indian culture was already influencing Bali (Indonesia) by the 10th century CE.\" Nagari has been the primus inter pares of the Indic scripts.George Cardona and Danesh Jain (2003), The Indo-Aryan Languages, Routledge, , pages 75-77 It has long been used traditionally by religiously educated people in South Asia to record and transmit information, existing throughout the land in parallel with a wide variety of local scripts (such as Modi, Kaithi, and Mahajani) used for administration, commerce, and other daily uses.\n\nThe Devanagari script is used for over 120 languages,[http://scriptsource.org/cms/scripts/page.php?item_id\nscript_detail&keyDeva Devanagari (Nagari)], Script Features and Description, SIL International (2013), United States making it one of the most used and adopted writing systems in the world. Among the languages using it – as either their only script or one of their scripts – are Awadhi, Bhili, Bhojpuri, Bodo, Chhattisgarhi, Dogri, Garhwali, Haryanvi, Hindi,[http://www.omniglot.com/writing/hindi.htm Hindi], Omniglot Encyclopedia of Writing Systems and Languages Kashmiri, Konkani, Magahi, Maithili, Marathi, Mundari, Nepalbhasa, Nepali, Pali, Rajasthani, Sanskrit, Santali and Sindhi. The Devanagari script is closely related to the Nandinagari script commonly found in numerous ancient manuscripts of South India,George Cardona and Danesh Jain (2003), The Indo-Aryan Languages, Routledge, , page 75Reinhold Grünendahl (2001), South Indian Scripts in Sanskrit Manuscripts and Prints, Otto Harrassowitz Verlag, , pages xxii, 201-210 and it is distantly related to a number of southeast Asian scripts.\n\nDevanagari script has forty-seven primary characters, of which fourteen are vowels and thirty-three are consonants. The ancient Nagari script for Sanskrit had two additional consonantal characters. The script has no distinction similar to the capital and small letters of the Latin alphabet.Akira Nakanishi, Writing systems of the World, , page 48 Generally the orthography of the script reflects the pronunciation of the language.\n\nOrigins\n\nDevanagari is part of the Brahmic family of scripts of  India, Nepal, Tibet, and South-East Asia. It is a descendant of the Gupta script, along with Siddham and Sharada. Variants of script called Nāgarī, recognisably close to Devanagari, are first attested from the 1st century CE Rudradaman inscriptions in Sanskrit, while the modern standardised form of Devanagari was in use by about 1000 CE.Richard Salomon (2014), Indian Epigraphy, Oxford University Press, , pages 40-42Krishna Chandra Sagar (1993), Foreign Influence on Ancient India, South Asia Books, , page 137 Medieval inscriptions suggest widespread diffusion of the Nagari-related scripts, with biscripts presenting local script along with the adoption of Nagari scripts. For example, the mid 8th-century Pattadakal pillar in Karnataka has text in both Siddha Matrika script, and an early Telugu-Kannada script; while, the Kangra Jvalamukhi inscription in Himachal Pradesh is written in both Sharada and Devanagari scripts.Richard Salomon (2014), Indian Epigraphy, Oxford University Press, , page 71\n\nThe 7th-century Tibetan king Srong-tsan-gambo ordered that all foreign books be transcribed into the Tibetan language.  He sent his ambassador Tonmi Sambota to India to acquire alphabet and writing methods; returning with Sanskrit Nagari script from Kashmir corresponding to 24 Tibetan sounds and innovating new symbols for 6 local sounds.William Woodville Rockhill, , United States National Museum, page 671 Other closely related scripts such as Siddham Matrka was in use in Indonesia, Vietnam, Japan and other parts of East Asia by between 7th- to 10th-century.David Quinter (2015), From Outcasts to Emperors: Shingon Ritsu and the Mañjuśrī Cult in Medieval Japan, Brill, , pages 63-65 with discussion on Uṣṇīṣa Vijaya Dhāraṇī SūtraRichard Salomon (2014), Indian Epigraphy, Oxford University Press, , pages 157-160 Sharada remained in parallel use in Kashmir. An early version of Devanagari is visible in the Kutila inscription of Bareilly dated to Vikram Samvat 1049 (i.e. 992 CE), which demonstrates the emergence of the horizontal bar to group letters belonging to a word. One of the oldest surviving Sanskrit text from early post-Maurya period available consists of 1,413 Nagari pages of a commentary by Patanjali, with a composition date of about 150 BCE, the surviving copy transcribed about 14th century CE.Michael Witzel (2006), in Between the Empires : Society in India 300 BCE to 400 CE (Editor: Patrick Olivelle), Oxford University Press, , pages 477-480 with footnote 60;Original manuscript, dates in Saka Samvat, and uncertainties associated with it: [https://archive.org/stream/vykaraamahbhshy00kielgoog#page/n8/mode/2up Mahabhasya of Patanjali], F Kielhorn\n\n' is the Sanskrit feminine of ' \"relating or belonging to a town or city, urban\". It is a phrasing with lipi (\"script\") as ' \"script relating to a city\", or \"spoken in city\".Monier Williams Online Dictionary, [http://www.sanskrit-lexicon.uni-koeln.de/scans/MWScan/tamil/index.html nagara], Cologne Sanskrit Digital Lexicon, Germany\n\nThe use of the name ' is relatively recent, and the older term ' is still common. The rapid spread of the term ' may be related to the almost exclusive use of this script to publish Sanskrit texts in print since the 1870s.\n\nPrinciple\n\nAs a Brahmic abugida, the fundamental principle of Devanagari is that each letter represents a consonant, which carries an inherent schwa vowel. This is usually written in Latin as a, though it is represented as [ə] in the International Phonetic Alphabet. The letter  is read ka, the two letters  are kana, the three  are kanaya, etc. Other vowels, or the absence of vowels, require modification of these consonants or their own letters:\n\n* A final consonant is marked with the diacritic  called the virāma in Sanskrit, halant in Hindi, and occasionally a \"killer stroke\" in English. This cancels the inherent vowel, so that from  knaya is derived  knay. The halant is often used for consonant clusters when typesetting conjunct ligatures is not feasible.\n* Consonant clusters are written with ligatures ( \"conjuncts\"). For example, the three consonants , , and , (k, n, y), when written consecutively without virāma form , as shown above. Alternatively, they may be joined as clusters to form  knaya,  kanya, or  knya. This system was originally created for use with the Middle Indo-Aryan languages, which have a very limited number of clusters (the only clusters allowed are geminate consonants and clusters involving homorganic nasal stops).  When applied to Sanskrit, however, it added a great deal of complexity to the script, due to the large variety of clusters in this language (up to five consonants, e.g. rtsny).  Much of this complexity is required at least on occasion in the modern Indo-Aryan languages, due to the large number of clusters allowed and especially due to borrowings from Sanskrit.\n* Vowels other than the inherent a are written with diacritics (termed matras). For example, using  ka, the following forms can be derived:  ke,  ku,  kī,  kā, etc.\n* For vowels as an independent syllable (in writing, unattached to a preceding consonant), either at the beginning of a word or (in Hindi) after another vowel, there are full-letter forms. For example, while the vowel ū is written with the diacritic  in  kū, it has its own letter  in  ūka and (in Hindi but not Sanskrit)  kaū.\n\nSuch a letter or ligature, with its diacritics, is called an ' \"syllable\". For example,  kanaya is written with what are counted as three akshara, whereas  knya and  ku are each written with one.\n\nWhen handwriting, letters are usually written without the distinctive horizontal bar, which is added only once the word is completed.\n\nLetters\n\nThe letter order of Devanagari, like nearly all Brahmic scripts, is based on phonetic principles that consider both the manner and place of articulation of the consonants and vowels they represent. This arrangement is usually referred to as the ' \"garland of letters\". The format of Devanagari for Sanskrit serves as the prototype for its application, with minor variations or additions, to other languages.\n\nVowels\n\nThe vowels and their arrangement are:\n\n# Arranged with the vowels are two consonantal diacritics, the final nasal anusvāra  ' and the final fricative visarga  ' (called  ' and  ).  notes of the anusvāra in Sanskrit that \"there is some controversy as to whether it represents a homorganic nasal stop [...], a nasalised vowel, a nasalised semivowel, or all these according to context\". The visarga represents post-vocalic voiceless glottal fricative, in Sanskrit an allophone of , or less commonly , usually in word-final position. Some traditions of recitation append an echo of the vowel after the breath: .  considers the visarga along with letters  ' and  ' for the \"largely predictable\" velar and palatal nasals to be examples of \"phonetic overkill in the system\".\n# Another diacritic is the candrabindu/anunāsika  .  describes it as a \"more emphatic form\" of the , \"sometimes [...] used to mark a true [vowel] nasalization\". In a New Indo-Aryan language such as Hindi the distinction is formal: the ' indicates vowel nasalisation while the ' indicates a homorganic nasal preceding another consonant: e.g.  \"laughter\",  \"the Ganges\". When an akshara has a vowel diacritic above the top line, that leaves no room for the candra (\"moon\") stroke candrabindu, which is dispensed with in favour of the lone dot:  \"am\", but  \"are\". Some writers and typesetters dispense with the \"moon\" stroke altogether, using only the dot in all situations.\n# The avagraha   (usually transliterated with an apostrophe) is a Sanskrit punctuation mark for the elision of a vowel in sandhi:  ' ( ← ' + ') \"this one\". An original long vowel lost to coalescence is sometimes marked with a double avagraha:  ' ( ← ' + ') \"always, the self\". In Hindi,  states that its \"main function is to show that a vowel is sustained in a cry or a shout\":  '. In Madhyadeshi Languages like Bhojpuri, Awadhi, Maithili, etc. which have \"quite a number of verbal forms [that] end in that inherent vowel\", the avagraha is used to mark the non-elision of word-final inherent a, which otherwise is a modern orthographic convention:  ' \"sit\" versus  '\n# The syllabic consonants , , and ' are specific to Sanskrit and not included in the ' of other languages. The sound represented by ' has also been lost in the modern languages, and its pronunciation now ranges from (Hindi) to (Marathi).\n#  ' is not an actual phoneme of Sanskrit, but rather a graphic convention included among the vowels in order to maintain the symmetry of short–long pairs of letters.\n# There are non-regular formations of  ru and  rū.\n# There are two more vowels in Marathi as well as Konkani,  and , that respectively represent [], similar to the RP English pronunciation of  in ‘act’, and [], similar to the RP pronunciation of  in ‘cot’. These vowels are sometimes used in Hindi too. IAST transliteration is not defined. In ISO 15919, the transliteration is ê and ô, respectively.\n\nConsonants\n\nThe table below shows the consonant letters (in combination with inherent vowel a) and their arrangement. To the right of the Devanagari letter it shows the Latin script transliteration using International Alphabet of Sanskrit Transliteration, and the phonetic value (IPA) in Hindi.\n\n* Rounding this out where applicable is  ' /}} (also in IPA), the intervocalic lateral flap allophone of the voiced retroflex stop in Vedic Sanskrit, which is a phoneme in languages such as Marathi, Konkani, and Rajasthani.Masica (1991:97)\n* Beyond the Sanskritic set, new shapes have rarely been formulated.  offers the following, \"In any case, according to some, all possible sounds had already been described and provided for in this system, as Sanskrit was the original and perfect language. Hence it was difficult to provide for or even to conceive other sounds, unknown to the phoneticians of Sanskrit\". Where foreign borrowings and internal developments did inevitably accrue and arise in New Indo-Aryan languages, they have been ignored in writing, or dealt through means such as diacritics and ligatures (ignored in recitation).\n** The most prolific diacritic has been the subscript dot (nuqtā) . Hindi uses it for the Persian, Arabic and English sounds  qa /q/,  xa /x/,  ġa /ɣ/,  za /z/,  zha /ʒ/, and  fa /f/, and for the allophonic developments  ' /ɽ/ and  ' /ɽʱ/. (Although  ' could also exist, it is not used in Hindi.)\n** Sindhi's and Saraiki's  implosives are accommodated with a line attached below: , , , .\n** Aspirated sonorants may be represented as conjuncts/ligatures with  ha:  mha,  nha,  ',  vha,  lha,  ',  rha.\n**  notes Marwari as using  for ' (while  represents).\nFor a list of the 297 (33×9) possible Sanskrit consonant-(short) vowel phonemes, see Āryabhaṭa numeration.\n\nSchwa syncope in consonants\n\nIn many Indo-Aryan languages, the schwa ('ə') implicit in each consonant of the script is \"obligatorily deleted\" at the end of words and in certain other contexts, unlike in Marathi or Sanskrit. This phenomenon has been termed the \"schwa syncope rule\" or the \"schwa deletion rule\" of Hindi. One formalisation of this rule has been summarised as . In other words, when a schwa-succeeded consonant is followed by a vowel-succeeded consonant, the schwa inherent in the first consonant is deleted. However, this formalisation is inexact and incomplete (it sometimes deletes a schwa when it should not and, at other times, it fails to delete it when it should) and can cause errors. Schwa deletion is computationally important because it is essential to building text-to-speech software for Hindi.\n\nAs a result of schwa syncope, the Hindi pronunciation of many words differs from that expected from a literal Sanskrit-style rendering of Devanagari. For instance,  is rām (not rāma),  is rac'nā (not racanā),  is vēd (not vēda) and  is nam'kīn (not namakīna). The name of the script itself is pronounced dev'nāgrī (not devanāgarī).\n\nCorrect schwa deletion is also critical because, in some cases, the same Devanagari letter sequence is pronounced two different ways in Hindi depending on context, and failure to delete the appropriate schwas can change the sense of the word. For instance, the letter sequence  is pronounced differently in  (harkat, meaning movement or activity) and  (saraknā, meaning to slide). Similarly, the sequence  in  (the heart started beating) and in  (beats of the heart) is identical prior to the nasalisation in the second usage. Yet, it is pronounced dhaṛaknē in the first and dhaṛkanē in the second. While native speakers correctly pronounce the sequences differently in different contexts, non-native speakers and voice-synthesis software can make them \"sound very unnatural\", making it \"extremely difficult for the listener\" to grasp the intended meaning.\n\nAllophony of 'v' and 'w' in Hindi\n\n (the voiced labiodental fricative) and (the voiced labio-velar approximant) are both allophones of the single phoneme represented by the letter  in Hindi Devanagari. More specifically, they are conditional allophones, i.e. rules apply on whether  is pronounced as or depending on context. Native Hindi speakers pronounce  as in vrat (, fast) and in pakvān (, food dish), perceiving them as a single phoneme and without being aware of the allophone distinctions they are systematically making. However, this specific allophony can become obvious when speakers switch languages. Non-native speakers of Hindi might pronounce  in  as, i.e. as wrat instead of the more correct vrat. This results in a minor intelligibility problem because wrat can easily be confused for aurat, which means woman, instead of the intended fast (abstaining from food), in Hindi.\n\nCompounds\n\nTable: Compounds. Vowels in their independent form on the left and in their corresponding dependent form (vowel sign) combined with the consonant  on the right.  is without any added vowel sign, where the vowel  is inherent. ISO 15919Difference between ISO 15919 & IAST transliteration is on the top two rows.\n\nA vowel combines with a consonant to form their compound letter. For example, the vowel  () combines with the consonant  () to form the compound  (), with halant removed and added vowel sign which is indicated by diacritics. The vowel  () combines with the consonant  () to form the compound  () with halant removed. But, the compound letter series of ... () is without any added vowel sign, as the vowel अ (a) is inherent.\n\nConjuncts\n\nYou will be able to see the conjuncts only if your system has a Unicode font installed that includes the required conjunct glyphs (such as one of the TDIL fonts, see the list of fonts below. Keep in mind that there is significant variation in the number of conjuncts a font supports: [http://svayambhava.blogspot.ca/p/siddhanta-devanagariunicode-open-type.html Siddhanta] (a newer version of the Chandas font), for example, is one of the most comprehensive and covers more than 4300 ligatures whereas [https://fonts.google.com/specimen/Hind Hind], a decent font for modern use, has a coverage in the hundreds. Unicode-compatible fonts use the \"virama\" or \"halant\" character (्) between characters to indicate when they should be ligatured, so as a general rule, if you see a halant in the middle of a word, it is likely a conjunct that is not supported by current font.\n\nAs mentioned, successive consonants lacking a vowel in between them may physically join together as a conjunct or ligature. Conjuncts are used mostly with loan words. Native words typically use the basic consonant and native speakers know to suppress the vowel. For example, the native Hindi word karnā is written  (ka-ra-nā).Saloman, Richard (2007) “Typological Observations on the Indic Scripts” in The Indic Scripts: Paleographic and Linguistic Perspecticves D.K. Printworld Ltd., New Delhi. . p. 33. The government of these clusters ranges from widely to narrowly applicable rules, with special exceptions within. While standardised for the most part, there are certain variations in clustering, of which the Unicode used on this page is just one scheme. The following are a number of rules:\n* 24 out of the 36 consonants contain a vertical right stroke ( kha,  gha,  ṇa etc.). As first or middle fragments/members of a cluster, they lose that stroke. e.g.  +  \n  tva,  +  \n  ṇḍha,  +  \n  stha. In Unicode, these consonants without their vertical stems are called half forms.   ś(a) appears as a different, simple ribbon-shaped fragment preceding  va,  na,  ca,  la, and  ra, causing these second members to be shifted down and reduced in size. Thus  śva,  śna,  śca  śla, and  śra.\n*  r(a) as a first member takes the form of a curved upward dash above the final character or its ā-diacritic. e.g.  rva,  rvā,  rspa,  rspā. As a final member with  ṭa  ṭha  ḍa  ḍha  ṛa  cha it is two lines below the character, pointed downwards and apart. Thus  ṭra  ṭhra  ḍra  ḍhra  ṛra  chra. Elsewhere as a final member it is a diagonal stroke extending leftwards and down. e.g. .  ta is shifted up to make  tra.\n* As first members, remaining characters lacking vertical strokes such as  d(a) and  h(a) may have their second member, reduced in size and lacking its horizontal stroke, placed underneath.  k(a),  ch(a), and  ph(a) shorten their right hooks and join them directly to the following member.\n* The conjuncts for ' and ' are not clearly derived from the letters making up their components. The conjunct for ' is  ( + ) and for ' it is  ( + ).\n\nThe \"Biconsonantal conjuncts\" table below shows all the 1296 possible symbols for the biconsonantal clusters formed by collating the 36 fundamental symbols of Sanskrit as listed in . Scroll your cursor over the conjuncts to reveal their romanisations (in ISO 15919The romanization shown is identical to IAST, except that  (which is not used in Sanskrit) has the ISO romanization ḷ, which in IAST is the dental vowel l.) and IPA transcriptions. Note that there will be variation in the conjuncts that are actually used in any given language written in Devanagari and many of them would not be viable combinations in any language.\n\nConjuncts can be constructed of more than two consonants, and the theoretical number of possible combinations increases exponentially. However, longer conjuncts are increasingly constrained by the languages' phonology and the actual number of conjuncts observed drops sharply. Ulrich Stiel includes a five-consonant cluster in the top 360 most frequent conjuncts found in Classical Sanskrit; the complete list appears below. Presented as they are here, many of these conjuncts may seem a little absurd, but keep in mind that when writing in Devanagari, conjuncts very often span a syllable boundary. That is, not all conjuncts are possible at the beginning (or end) of a syllable or word; many will only occur in the middle of multisyllablic words where the coda consonants of one syllable are conjoined with the onset consonants of the following syllable.\n\nBiconsonantal conjuncts\n\nTop 360 Most Frequent Conjuncts in Sanskrit\n\nक\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nग\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nङ\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nच\n* \n* \n* \n* \n* \n* \n\nज\n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nञ\n* \n* \n* \n* \n* \n* \n* \n\nट\n* \n* \n* \n* \n* \n* \n* \n\nड\n* \n* \n* \n* \n* \n* \n\nण\n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nत\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nद\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nन\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nप\n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nब\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nम\n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nय\n* \n* \n\nर\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nल\n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nव\n* \n* \n\nश\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nष\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nस\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nह\n* \n* \n* \n* \n* \n* \n* \n\nAccent marks\n\nThe pitch accent of Vedic Sanskrit is written with various symbols depending on shakha. In the Rigveda, anudātta is written with a bar below the line (), svarita with a stroke above the line () while udātta is unmarked.\n\nPunctuation\n\nThe end of a sentence or half-verse may be marked with the \"\" symbol (called a danda, meaning \"bar\", or called a ', meaning \"full stop/pause\"). The end of a full verse may be marked with a double-danda, a \"\" symbol. A comma (called an ', meaning \"short stop/pause\") is used to denote a natural pause in speech.Unicode Consortium, The Unicode Standard, Version 3.0, Volume 1, , Addison-Wesley, pages 221-223[http://www.ijetr.org/finalpdf/1386305476.pdf Transliteration from Hindi Script to Meetei Mayek] Watham and Vimal (2013), IJETR, page 550 Other punctuation marks such as colon, semi-colon, exclamation mark, dash, and question mark are currently in use in Devanagari script, matching their use in European languages.Michael Shapiro (2014), The Devanagari Writing System in A Primer of Modern Standard Hindi, Motilal Banarsidass, , page 26\n\nOld forms\n\nThe following letter variants are also in use, particularly in older texts.\n\nNumerals\n\nFonts\n\nA variety of unicode fonts are in use for Devanagari. These include, but are not limited to, Akshar,[http://salrc.uchicago.edu/resources/fonts/available/hindi/akshar.shtml Akshar Unicode] South Asia Language Resource, University of Chicago (2009) [http://software.sil.org/annapurna/ Annapurna],[http://software.sil.org/annapurna/ Annapurna SIL Unicode], SIL International (2013) Arial,[http://salrc.uchicago.edu/resources/fonts/available/hindi/arialunicode.shtml Arial Unicode] South Asia Language Resource, University of Chicago (2009) CDAC-Gist Surekh,[http://salrc.uchicago.edu/resources/fonts/available/hindi/surekh.shtml CDAC-GIST Surekh Unicode] South Asia Language Resource, University of Chicago (2009) CDAC-Gist Yogesh,[http://salrc.uchicago.edu/resources/fonts/available/hindi/yogesh.shtml CDAC-GIST Yogesh] South Asia Language Resource, University of Chicago (2009) [http://www.sanskritweb.net/cakram/ Chandas], Gargi,[http://salrc.uchicago.edu/resources/fonts/available/hindi/gargi.shtml Gargi] South Asia Language Resource, University of Chicago (2009) [https://www.gnome-look.org/content/show.php/Gurumaa+Hindi+Unicode+Font+(GPL)?content16645 Gurumaa],[http://kde-look.org/content/show.php?content\n16645 Gurumaa Unicode - a sans font] KDE (2012) Jaipur,[http://salrc.uchicago.edu/resources/fonts/available/hindi/jaipur.shtml Jaipur] South Asia Language Resource, University of Chicago (2009) Jana,[http://salrc.uchicago.edu/resources/fonts/available/hindi/janahindi.shtml Jana] South Asia Language Resource, University of Chicago (2009) Kalimati,[http://salrc.uchicago.edu/resources/fonts/available/hindi/kalimati.shtml Kalimati] South Asia Language Resource, University of Chicago (2009) Kanjirowa,[http://salrc.uchicago.edu/resources/fonts/available/hindi/kanjirowa.shtml Kanjirowa] South Asia Language Resource, University of Chicago (2009) [https://fedorahosted.org/lohit/ Lohit Devanagari], Mangal,[http://salrc.uchicago.edu/resources/fonts/available/hindi/mangal.shtml Mangal] South Asia Language Resource, University of Chicago (2009) Raghu,[http://salrc.uchicago.edu/resources/fonts/available/hindi/raghindi.shtml Raghu] South Asia Language Resource, University of Chicago (2009) [http://www.omkarananda-ashram.org/Sanskrit/itranslator2003.htm Sanskrit2003],[http://salrc.uchicago.edu/resources/fonts/available/hindi/sanskrit2003.shtml Sanskrit Ashram] South Asia Language Resource, University of Chicago (2009) [http://www.sanskritweb.net/itrans/#S99FONTS Santipur OT], [http://svayambhava.blogspot.in/p/siddhanta-devanagariunicode-open-type.html Siddhanta], Thyaka,[http://salrc.uchicago.edu/resources/fonts/available/hindi/thyakarabison.shtml Thyaka] South Asia Language Resource, University of Chicago (2009) and [http://www.sanskritweb.net/cakram/ Uttara].[http://isites.harvard.edu/icb/icb.do?keywordk21214&pageid\nicb.page104271 Sanskrit Devanagari Fonts] Harvard University (2010); see [http://www.sanskritweb.net/cakram/ Chanda and Uttara ttf] 2010 archive (Accessed: July 8, 2015)\n\nThe form of Devanagari fonts vary with function. According to Harvard College for Sanskrit studies, \"Uttara [companion to Chandas] is the best in terms of ligatures but, because it is designed for Vedic as well, requires so much vertical space that it is not well suited for the \"user interface font\" (though an excellent choice for the \"original field\" font). Santipur OT is a beautiful font reflecting a very early [medieval era] typesetting style for Devanagari. Sanskrit 2003[http://www.unicode.org/charts/PDF/U0900.pdf Devanagari font]  Unicode Standard 8.0 (2015) is a good all-around font and has more ligatures than most fonts, though students will probably find the spacing of the CDAC-Gist Surekh font makes for quicker comprehension and reading.\"\n\nGoogle Fonts project now has a number of [https://fonts.google.com/?subset=devanagari new unicode fonts for Devanagari] in a variety of typefaces in Serif, Sans-Serif, Display and Handwriting categories.\n\nTransliteration\n\nThere are several methods of Romanisation or transliteration from Devanagari to the Roman script.\n\nHunterian system\n\nThe Hunterian system is the \"national system of romanisation in India\" and the one officially adopted by the Government of India.\n\nISO 15919\n\nA standard transliteration convention was codified in the ISO 15919 standard of 2001. It uses diacritics to map the much larger set of Brahmic graphemes to the Latin script. The Devanagari-specific portion is nearly identical to the academic standard for Sanskrit, IAST.\n\nIAST\n\nThe International Alphabet of Sanskrit Transliteration (IAST) is the academic standard for the romanisation of Sanskrit. IAST is the de facto standard used in printed publications, like books, magazines, and electronic texts with Unicode fonts. It is based on a standard established by the Congress of Orientalists at Athens in 1912. The ISO 15919 standard of 2001 codified the transliteration convention to include an expanded standard for sister scripts of Devanagari.[http://scriptsource.org/cms/scripts/page.php?item_id\nscript_detail_sort&key=Deva Devanagari IAST conventions] Script Source (2009), SIL International, United States\n\nThe National Library at Kolkata romanisation, intended for the romanisation of all Indic scripts, is an extension of IAST.\n\nHarvard-Kyoto\n\nCompared to IAST, Harvard-Kyoto looks much simpler. It does not contain all the diacritic marks that IAST contains. It was designed to simplify the task of putting large amount of Sanskrit textual material into machine readable form, and the inventors stated that it reduces the effort needed in transliteration of Sanskrit texts on the keyboard. This makes typing in Harvard-Kyoto much easier than IAST. Harvard-Kyoto uses capital letters that can be difficult to read in the middle of words.\n\nITRANS\n\nITRANS is a lossless transliteration scheme of Devanagari into ASCII that is widely used on Usenet. It is an extension of the Harvard-Kyoto scheme. In ITRANS, the word devanāgarī is written \"devanaagarii\" or \"devanAgarI\". ITRANS is associated with an application of the same name that enables typesetting in Indic scripts. The user inputs in Roman letters and the ITRANS pre-processor translates the Roman letters into Devanagari (or other Indic languages). The latest version of ITRANS is version 5.30 released in July, 2001. It is similar to Velthius system and was created by Avinash Chopde to help print various Indic scripts with personal computers.[http://indology.info/email/members/wujastyk/ Transliteration of Devanāgarī] D. Wujastyk (1996)\n\nVelthuis \n\nThe disadvantage of the above ASCII schemes is case-sensitivity, implying that transliterated names may not be capitalised. This difficulty is avoided with the system developed in 1996 by Frans Velthuis for TeX, loosely based on IAST, in which case is irrelevant.\n\nALA-LC Romanisation\n\nALA-LC romanisation is a transliteration scheme approved by the Library of Congress and the American Library Association, and widely used in North American libraries. Transliteration tables are based on languages, so there is a table for Hindi, one for Sanskrit and Prakrit, etc.\n\nWX\n\nWX is a Roman transliteration scheme for Indian languages, widely used among the natural language processing community in India. It originated at IIT Kanpur for computational processing of Indian languages. The salient features of this transliteration scheme are as follows.\n* Every consonant and every vowel has a single mapping into Roman. Hence it is a prefix code, advantageous from computation point of view.\n* Lower-case letters are used for unaspirated consonants and short vowels, while capital letters are used for aspirated consonants and long vowels. While the retroflex stops are mapped to 't, T, d, D, N', the dentals are mapped to 'w, W, x, X, n'. Hence the name 'WX', a reminder of this idiosyncratic mapping.\n\nEncodings\n\nISCII\n\nISCII is an 8-bit encoding. The lower 128 codepoints are plain ASCII, the upper 128 codepoints are ISCII-specific.\n\nIt has been designed for representing not only Devanagari but also various other Indic scripts as well as a Latin-based script with diacritic marks used for transliteration of the Indic scripts.\n\nISCII has largely been superseded by Unicode, which has, however, attempted to preserve the ISCII layout for its Indic language blocks.\n\nUnicode\n\nThe Unicode Standard defines three blocks for Devanagari: Devanagari (U+0900–U+097F), Devanagari Extended (U+A8E0–U+A8FF), and Vedic Extensions (U+1CD0–U+1CFF).\n\nDevanagari keyboard layouts\n\nInScript is the standard keyboard layout for Devanagari. It is inbuilt in all modern major operating systems. Microsoft Windows supports the InScript layout (using the Mangal font), which can be used to input unicode Devanagari characters. InScript is also available in some touchscreen mobile phones.\n\nInScript layout\n\nA Devanagari INSCRIPT bilingual keyboard.\n\nTypewriter\n\nThis layout was used on manual typewriters when computers were not available or were uncommon. For backward compatibility some typing tools like Indic IME still provide this layout.\n\nPhonetic\n\nSuch tools work on phonetic transliteration. The user writes in Roman and the IME automatically converts it into Devanagari. Some popular phonetic typing tools are Baraha IME and Google IME.\n\nThe Mac OS X operating system includes two different keyboard layouts for Devanagari: one is much like INSCRIPT/KDE Linux, the other is a phonetic layout called \"Devanagari QWERTY\".\n\nAny one of Unicode fonts input system is fine for Indic language Wikipedia and other wikiprojects, including Hindi, Bhojpuri, Marathi, Nepali Wikipedia. Some people use inscript. Majority uses either Google phonetic transliteration or input facility Universal Language Selector provided on Wikipedia. On Indic language wikiprojects Phonetic facility provided initially was java-based later supported by Narayam extension for phonetic input facility. Currently Indic language Wiki projects are supported by Universal Language Selector (ULS), that offers both phonetic keyboard (Aksharantaran, Marathi: , Hindi: ) and InScript keyboard (Marathi: ).\n\nThe Ubuntu Linux operating system supports several keyboard layouts for Devanagari, including Harvard-Kyoto, WX notation, Bolanagari and phonetic.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Devanagari" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=8968" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "Devanagari ( ; ,  , a compound of \"deva\"  and \"nāgarī\" ; Hindi pronunciation:), also called Nagari (Nāgarī, ),Kathleen Kuiper (2010), The Culture of India, New York: The Rosen Publishing Group, , page 83 is an abugida (alphasyllabary) used in India and Nepal. It is written from left to right, has a strong preference for symmetrical rounded shapes within squared outlines, and is recognisable by a horizontal line that runs along the top of full letters. In a cursory look, the Devanagari script appears different from other Indic scripts such as Bengali-Assamese, Odia, or Gurmukhi, but a closer examination reveals they are very similar except for angles and structural emphasis.George Cardona and Danesh Jain (2003), The Indo-Aryan Languages, Routledge, , pages 72-74; Quote: \"(...) has a strong preference for symmertrical shapes, especially squared outlines and right angles (...)\".\n\nThe Nagari script has roots in the ancient Brāhmī script family.George Cardona and Danesh Jain (2003), The Indo-Aryan Languages, Routledge, , pages 68-69 Some of the earliest epigraphical evidence attesting to the developing Sanskrit Nagari script in ancient India, in a form similar to Devanagari, is from the 1st to 4th century CE inscriptions discovered in Gujarat., Rudradaman’s inscription from 1st through 4th century CE found in Gujarat, India, Stanford University Archives, pages 30-45, particularly Devanagari inscription on Jayadaman's coins pages 33-34 The Nagari script was in regular use by the 7th century CE and it was fully developed by about the end of first millennium. The use of Sanskrit in Nagari script in medieval India is attested by numerous pillar and cave temple inscriptions, including the 11th-century Udayagiri inscriptions in Madhya Pradesh,Michael Willis (2001), Inscriptions from Udayagiri: locating domains of devotion, patronage and power in the eleventh century, South Asian Studies, 17(1), pages 41-53 and an inscribed brick found in Uttar Pradesh, dated to be from 1217 CE, which is now held at the British Museum.[https://www.britishmuseum.org/explore/highlights/highlight_objects/asia/b/brick_with_sanskrit_inscriptio.aspx Brick with Sanskrit inscription in Nagari script], 1217 CE, found in Uttar Pradesh, India (British Museum) The script's proto- and related versions have been discovered in ancient relics outside of India, such as in Sri Lanka, Myanmar and Indonesia; while in East Asia, Siddha Matrika script considered as the closest precursor to Nagari was in use by Buddhists.Wayan Ardika (2009), Form, Macht, Differenz: Motive und Felder ethnologischen Forschens (Editors: Elfriede Hermann et al.), Universitätsverlag Göttingen, , pages 251-252; Quote: \"Nagari script and Sanskrit language in the inscription at Blangjong suggests that Indian culture was already influencing Bali (Indonesia) by the 10th century CE.\" Nagari has been the primus inter pares of the Indic scripts.George Cardona and Danesh Jain (2003), The Indo-Aryan Languages, Routledge, , pages 75-77 It has long been used traditionally by religiously educated people in South Asia to record and transmit information, existing throughout the land in parallel with a wide variety of local scripts (such as Modi, Kaithi, and Mahajani) used for administration, commerce, and other daily uses.\n\nThe Devanagari script is used for over 120 languages,[http://scriptsource.org/cms/scripts/page.php?item_id\nscript_detail&keyDeva Devanagari (Nagari)], Script Features and Description, SIL International (2013), United States making it one of the most used and adopted writing systems in the world. Among the languages using it – as either their only script or one of their scripts – are Awadhi, Bhili, Bhojpuri, Bodo, Chhattisgarhi, Dogri, Garhwali, Haryanvi, Hindi,[http://www.omniglot.com/writing/hindi.htm Hindi], Omniglot Encyclopedia of Writing Systems and Languages Kashmiri, Konkani, Magahi, Maithili, Marathi, Mundari, Nepalbhasa, Nepali, Pali, Rajasthani, Sanskrit, Santali and Sindhi. The Devanagari script is closely related to the Nandinagari script commonly found in numerous ancient manuscripts of South India,George Cardona and Danesh Jain (2003), The Indo-Aryan Languages, Routledge, , page 75Reinhold Grünendahl (2001), South Indian Scripts in Sanskrit Manuscripts and Prints, Otto Harrassowitz Verlag, , pages xxii, 201-210 and it is distantly related to a number of southeast Asian scripts.\n\nDevanagari script has forty-seven primary characters, of which fourteen are vowels and thirty-three are consonants. The ancient Nagari script for Sanskrit had two additional consonantal characters. The script has no distinction similar to the capital and small letters of the Latin alphabet.Akira Nakanishi, Writing systems of the World, , page 48 Generally the orthography of the script reflects the pronunciation of the language.\n\nOrigins\n\nDevanagari is part of the Brahmic family of scripts of  India, Nepal, Tibet, and South-East Asia. It is a descendant of the Gupta script, along with Siddham and Sharada. Variants of script called Nāgarī, recognisably close to Devanagari, are first attested from the 1st century CE Rudradaman inscriptions in Sanskrit, while the modern standardised form of Devanagari was in use by about 1000 CE.Richard Salomon (2014), Indian Epigraphy, Oxford University Press, , pages 40-42Krishna Chandra Sagar (1993), Foreign Influence on Ancient India, South Asia Books, , page 137 Medieval inscriptions suggest widespread diffusion of the Nagari-related scripts, with biscripts presenting local script along with the adoption of Nagari scripts. For example, the mid 8th-century Pattadakal pillar in Karnataka has text in both Siddha Matrika script, and an early Telugu-Kannada script; while, the Kangra Jvalamukhi inscription in Himachal Pradesh is written in both Sharada and Devanagari scripts.Richard Salomon (2014), Indian Epigraphy, Oxford University Press, , page 71\n\nThe 7th-century Tibetan king Srong-tsan-gambo ordered that all foreign books be transcribed into the Tibetan language.  He sent his ambassador Tonmi Sambota to India to acquire alphabet and writing methods; returning with Sanskrit Nagari script from Kashmir corresponding to 24 Tibetan sounds and innovating new symbols for 6 local sounds.William Woodville Rockhill, , United States National Museum, page 671 Other closely related scripts such as Siddham Matrka was in use in Indonesia, Vietnam, Japan and other parts of East Asia by between 7th- to 10th-century.David Quinter (2015), From Outcasts to Emperors: Shingon Ritsu and the Mañjuśrī Cult in Medieval Japan, Brill, , pages 63-65 with discussion on Uṣṇīṣa Vijaya Dhāraṇī SūtraRichard Salomon (2014), Indian Epigraphy, Oxford University Press, , pages 157-160 Sharada remained in parallel use in Kashmir. An early version of Devanagari is visible in the Kutila inscription of Bareilly dated to Vikram Samvat 1049 (i.e. 992 CE), which demonstrates the emergence of the horizontal bar to group letters belonging to a word. One of the oldest surviving Sanskrit text from early post-Maurya period available consists of 1,413 Nagari pages of a commentary by Patanjali, with a composition date of about 150 BCE, the surviving copy transcribed about 14th century CE.Michael Witzel (2006), in Between the Empires : Society in India 300 BCE to 400 CE (Editor: Patrick Olivelle), Oxford University Press, , pages 477-480 with footnote 60;Original manuscript, dates in Saka Samvat, and uncertainties associated with it: [https://archive.org/stream/vykaraamahbhshy00kielgoog#page/n8/mode/2up Mahabhasya of Patanjali], F Kielhorn\n\n' is the Sanskrit feminine of ' \"relating or belonging to a town or city, urban\". It is a phrasing with lipi (\"script\") as ' \"script relating to a city\", or \"spoken in city\".Monier Williams Online Dictionary, [http://www.sanskrit-lexicon.uni-koeln.de/scans/MWScan/tamil/index.html nagara], Cologne Sanskrit Digital Lexicon, Germany\n\nThe use of the name ' is relatively recent, and the older term ' is still common. The rapid spread of the term ' may be related to the almost exclusive use of this script to publish Sanskrit texts in print since the 1870s.\n\nPrinciple\n\nAs a Brahmic abugida, the fundamental principle of Devanagari is that each letter represents a consonant, which carries an inherent schwa vowel. This is usually written in Latin as a, though it is represented as [ə] in the International Phonetic Alphabet. The letter  is read ka, the two letters  are kana, the three  are kanaya, etc. Other vowels, or the absence of vowels, require modification of these consonants or their own letters:\n\n* A final consonant is marked with the diacritic  called the virāma in Sanskrit, halant in Hindi, and occasionally a \"killer stroke\" in English. This cancels the inherent vowel, so that from  knaya is derived  knay. The halant is often used for consonant clusters when typesetting conjunct ligatures is not feasible.\n* Consonant clusters are written with ligatures ( \"conjuncts\"). For example, the three consonants , , and , (k, n, y), when written consecutively without virāma form , as shown above. Alternatively, they may be joined as clusters to form  knaya,  kanya, or  knya. This system was originally created for use with the Middle Indo-Aryan languages, which have a very limited number of clusters (the only clusters allowed are geminate consonants and clusters involving homorganic nasal stops).  When applied to Sanskrit, however, it added a great deal of complexity to the script, due to the large variety of clusters in this language (up to five consonants, e.g. rtsny).  Much of this complexity is required at least on occasion in the modern Indo-Aryan languages, due to the large number of clusters allowed and especially due to borrowings from Sanskrit.\n* Vowels other than the inherent a are written with diacritics (termed matras). For example, using  ka, the following forms can be derived:  ke,  ku,  kī,  kā, etc.\n* For vowels as an independent syllable (in writing, unattached to a preceding consonant), either at the beginning of a word or (in Hindi) after another vowel, there are full-letter forms. For example, while the vowel ū is written with the diacritic  in  kū, it has its own letter  in  ūka and (in Hindi but not Sanskrit)  kaū.\n\nSuch a letter or ligature, with its diacritics, is called an ' \"syllable\". For example,  kanaya is written with what are counted as three akshara, whereas  knya and  ku are each written with one.\n\nWhen handwriting, letters are usually written without the distinctive horizontal bar, which is added only once the word is completed.\n\nLetters\n\nThe letter order of Devanagari, like nearly all Brahmic scripts, is based on phonetic principles that consider both the manner and place of articulation of the consonants and vowels they represent. This arrangement is usually referred to as the ' \"garland of letters\". The format of Devanagari for Sanskrit serves as the prototype for its application, with minor variations or additions, to other languages.\n\nVowels\n\nThe vowels and their arrangement are:\n\n# Arranged with the vowels are two consonantal diacritics, the final nasal anusvāra  ' and the final fricative visarga  ' (called  ' and  ).  notes of the anusvāra in Sanskrit that \"there is some controversy as to whether it represents a homorganic nasal stop [...], a nasalised vowel, a nasalised semivowel, or all these according to context\". The visarga represents post-vocalic voiceless glottal fricative, in Sanskrit an allophone of , or less commonly , usually in word-final position. Some traditions of recitation append an echo of the vowel after the breath: .  considers the visarga along with letters  ' and  ' for the \"largely predictable\" velar and palatal nasals to be examples of \"phonetic overkill in the system\".\n# Another diacritic is the candrabindu/anunāsika  .  describes it as a \"more emphatic form\" of the , \"sometimes [...] used to mark a true [vowel] nasalization\". In a New Indo-Aryan language such as Hindi the distinction is formal: the ' indicates vowel nasalisation while the ' indicates a homorganic nasal preceding another consonant: e.g.  \"laughter\",  \"the Ganges\". When an akshara has a vowel diacritic above the top line, that leaves no room for the candra (\"moon\") stroke candrabindu, which is dispensed with in favour of the lone dot:  \"am\", but  \"are\". Some writers and typesetters dispense with the \"moon\" stroke altogether, using only the dot in all situations.\n# The avagraha   (usually transliterated with an apostrophe) is a Sanskrit punctuation mark for the elision of a vowel in sandhi:  ' ( ← ' + ') \"this one\". An original long vowel lost to coalescence is sometimes marked with a double avagraha:  ' ( ← ' + ') \"always, the self\". In Hindi,  states that its \"main function is to show that a vowel is sustained in a cry or a shout\":  '. In Madhyadeshi Languages like Bhojpuri, Awadhi, Maithili, etc. which have \"quite a number of verbal forms [that] end in that inherent vowel\", the avagraha is used to mark the non-elision of word-final inherent a, which otherwise is a modern orthographic convention:  ' \"sit\" versus  '\n# The syllabic consonants , , and ' are specific to Sanskrit and not included in the ' of other languages. The sound represented by ' has also been lost in the modern languages, and its pronunciation now ranges from (Hindi) to (Marathi).\n#  ' is not an actual phoneme of Sanskrit, but rather a graphic convention included among the vowels in order to maintain the symmetry of short–long pairs of letters.\n# There are non-regular formations of  ru and  rū.\n# There are two more vowels in Marathi as well as Konkani,  and , that respectively represent [], similar to the RP English pronunciation of  in ‘act’, and [], similar to the RP pronunciation of  in ‘cot’. These vowels are sometimes used in Hindi too. IAST transliteration is not defined. In ISO 15919, the transliteration is ê and ô, respectively.\n\nConsonants\n\nThe table below shows the consonant letters (in combination with inherent vowel a) and their arrangement. To the right of the Devanagari letter it shows the Latin script transliteration using International Alphabet of Sanskrit Transliteration, and the phonetic value (IPA) in Hindi.\n\n* Rounding this out where applicable is  ' /}} (also in IPA), the intervocalic lateral flap allophone of the voiced retroflex stop in Vedic Sanskrit, which is a phoneme in languages such as Marathi, Konkani, and Rajasthani.Masica (1991:97)\n* Beyond the Sanskritic set, new shapes have rarely been formulated.  offers the following, \"In any case, according to some, all possible sounds had already been described and provided for in this system, as Sanskrit was the original and perfect language. Hence it was difficult to provide for or even to conceive other sounds, unknown to the phoneticians of Sanskrit\". Where foreign borrowings and internal developments did inevitably accrue and arise in New Indo-Aryan languages, they have been ignored in writing, or dealt through means such as diacritics and ligatures (ignored in recitation).\n** The most prolific diacritic has been the subscript dot (nuqtā) . Hindi uses it for the Persian, Arabic and English sounds  qa /q/,  xa /x/,  ġa /ɣ/,  za /z/,  zha /ʒ/, and  fa /f/, and for the allophonic developments  ' /ɽ/ and  ' /ɽʱ/. (Although  ' could also exist, it is not used in Hindi.)\n** Sindhi's and Saraiki's  implosives are accommodated with a line attached below: , , , .\n** Aspirated sonorants may be represented as conjuncts/ligatures with  ha:  mha,  nha,  ',  vha,  lha,  ',  rha.\n**  notes Marwari as using  for ' (while  represents).\nFor a list of the 297 (33×9) possible Sanskrit consonant-(short) vowel phonemes, see Āryabhaṭa numeration.\n\nSchwa syncope in consonants\n\nIn many Indo-Aryan languages, the schwa ('ə') implicit in each consonant of the script is \"obligatorily deleted\" at the end of words and in certain other contexts, unlike in Marathi or Sanskrit. This phenomenon has been termed the \"schwa syncope rule\" or the \"schwa deletion rule\" of Hindi. One formalisation of this rule has been summarised as . In other words, when a schwa-succeeded consonant is followed by a vowel-succeeded consonant, the schwa inherent in the first consonant is deleted. However, this formalisation is inexact and incomplete (it sometimes deletes a schwa when it should not and, at other times, it fails to delete it when it should) and can cause errors. Schwa deletion is computationally important because it is essential to building text-to-speech software for Hindi.\n\nAs a result of schwa syncope, the Hindi pronunciation of many words differs from that expected from a literal Sanskrit-style rendering of Devanagari. For instance,  is rām (not rāma),  is rac'nā (not racanā),  is vēd (not vēda) and  is nam'kīn (not namakīna). The name of the script itself is pronounced dev'nāgrī (not devanāgarī).\n\nCorrect schwa deletion is also critical because, in some cases, the same Devanagari letter sequence is pronounced two different ways in Hindi depending on context, and failure to delete the appropriate schwas can change the sense of the word. For instance, the letter sequence  is pronounced differently in  (harkat, meaning movement or activity) and  (saraknā, meaning to slide). Similarly, the sequence  in  (the heart started beating) and in  (beats of the heart) is identical prior to the nasalisation in the second usage. Yet, it is pronounced dhaṛaknē in the first and dhaṛkanē in the second. While native speakers correctly pronounce the sequences differently in different contexts, non-native speakers and voice-synthesis software can make them \"sound very unnatural\", making it \"extremely difficult for the listener\" to grasp the intended meaning.\n\nAllophony of 'v' and 'w' in Hindi\n\n (the voiced labiodental fricative) and (the voiced labio-velar approximant) are both allophones of the single phoneme represented by the letter  in Hindi Devanagari. More specifically, they are conditional allophones, i.e. rules apply on whether  is pronounced as or depending on context. Native Hindi speakers pronounce  as in vrat (, fast) and in pakvān (, food dish), perceiving them as a single phoneme and without being aware of the allophone distinctions they are systematically making. However, this specific allophony can become obvious when speakers switch languages. Non-native speakers of Hindi might pronounce  in  as, i.e. as wrat instead of the more correct vrat. This results in a minor intelligibility problem because wrat can easily be confused for aurat, which means woman, instead of the intended fast (abstaining from food), in Hindi.\n\nCompounds\n\nTable: Compounds. Vowels in their independent form on the left and in their corresponding dependent form (vowel sign) combined with the consonant  on the right.  is without any added vowel sign, where the vowel  is inherent. ISO 15919Difference between ISO 15919 & IAST transliteration is on the top two rows.\n\nA vowel combines with a consonant to form their compound letter. For example, the vowel  () combines with the consonant  () to form the compound  (), with halant removed and added vowel sign which is indicated by diacritics. The vowel  () combines with the consonant  () to form the compound  () with halant removed. But, the compound letter series of ... () is without any added vowel sign, as the vowel अ (a) is inherent.\n\nConjuncts\n\nYou will be able to see the conjuncts only if your system has a Unicode font installed that includes the required conjunct glyphs (such as one of the TDIL fonts, see the list of fonts below. Keep in mind that there is significant variation in the number of conjuncts a font supports: [http://svayambhava.blogspot.ca/p/siddhanta-devanagariunicode-open-type.html Siddhanta] (a newer version of the Chandas font), for example, is one of the most comprehensive and covers more than 4300 ligatures whereas [https://fonts.google.com/specimen/Hind Hind], a decent font for modern use, has a coverage in the hundreds. Unicode-compatible fonts use the \"virama\" or \"halant\" character (्) between characters to indicate when they should be ligatured, so as a general rule, if you see a halant in the middle of a word, it is likely a conjunct that is not supported by current font.\n\nAs mentioned, successive consonants lacking a vowel in between them may physically join together as a conjunct or ligature. Conjuncts are used mostly with loan words. Native words typically use the basic consonant and native speakers know to suppress the vowel. For example, the native Hindi word karnā is written  (ka-ra-nā).Saloman, Richard (2007) “Typological Observations on the Indic Scripts” in The Indic Scripts: Paleographic and Linguistic Perspecticves D.K. Printworld Ltd., New Delhi. . p. 33. The government of these clusters ranges from widely to narrowly applicable rules, with special exceptions within. While standardised for the most part, there are certain variations in clustering, of which the Unicode used on this page is just one scheme. The following are a number of rules:\n* 24 out of the 36 consonants contain a vertical right stroke ( kha,  gha,  ṇa etc.). As first or middle fragments/members of a cluster, they lose that stroke. e.g.  +  \n  tva,  +  \n  ṇḍha,  +  \n  stha. In Unicode, these consonants without their vertical stems are called half forms.   ś(a) appears as a different, simple ribbon-shaped fragment preceding  va,  na,  ca,  la, and  ra, causing these second members to be shifted down and reduced in size. Thus  śva,  śna,  śca  śla, and  śra.\n*  r(a) as a first member takes the form of a curved upward dash above the final character or its ā-diacritic. e.g.  rva,  rvā,  rspa,  rspā. As a final member with  ṭa  ṭha  ḍa  ḍha  ṛa  cha it is two lines below the character, pointed downwards and apart. Thus  ṭra  ṭhra  ḍra  ḍhra  ṛra  chra. Elsewhere as a final member it is a diagonal stroke extending leftwards and down. e.g. .  ta is shifted up to make  tra.\n* As first members, remaining characters lacking vertical strokes such as  d(a) and  h(a) may have their second member, reduced in size and lacking its horizontal stroke, placed underneath.  k(a),  ch(a), and  ph(a) shorten their right hooks and join them directly to the following member.\n* The conjuncts for ' and ' are not clearly derived from the letters making up their components. The conjunct for ' is  ( + ) and for ' it is  ( + ).\n\nThe \"Biconsonantal conjuncts\" table below shows all the 1296 possible symbols for the biconsonantal clusters formed by collating the 36 fundamental symbols of Sanskrit as listed in . Scroll your cursor over the conjuncts to reveal their romanisations (in ISO 15919The romanization shown is identical to IAST, except that  (which is not used in Sanskrit) has the ISO romanization ḷ, which in IAST is the dental vowel l.) and IPA transcriptions. Note that there will be variation in the conjuncts that are actually used in any given language written in Devanagari and many of them would not be viable combinations in any language.\n\nConjuncts can be constructed of more than two consonants, and the theoretical number of possible combinations increases exponentially. However, longer conjuncts are increasingly constrained by the languages' phonology and the actual number of conjuncts observed drops sharply. Ulrich Stiel includes a five-consonant cluster in the top 360 most frequent conjuncts found in Classical Sanskrit; the complete list appears below. Presented as they are here, many of these conjuncts may seem a little absurd, but keep in mind that when writing in Devanagari, conjuncts very often span a syllable boundary. That is, not all conjuncts are possible at the beginning (or end) of a syllable or word; many will only occur in the middle of multisyllablic words where the coda consonants of one syllable are conjoined with the onset consonants of the following syllable.\n\nBiconsonantal conjuncts\n\nTop 360 Most Frequent Conjuncts in Sanskrit\n\nक\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nग\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nङ\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nच\n* \n* \n* \n* \n* \n* \n\nज\n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nञ\n* \n* \n* \n* \n* \n* \n* \n\nट\n* \n* \n* \n* \n* \n* \n* \n\nड\n* \n* \n* \n* \n* \n* \n\nण\n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nत\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nद\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nन\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nप\n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nब\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nम\n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nय\n* \n* \n\nर\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nल\n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nव\n* \n* \n\nश\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nष\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nस\n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n* \n\nह\n* \n* \n* \n* \n* \n* \n* \n\nAccent marks\n\nThe pitch accent of Vedic Sanskrit is written with various symbols depending on shakha. In the Rigveda, anudātta is written with a bar below the line (), svarita with a stroke above the line () while udātta is unmarked.\n\nPunctuation\n\nThe end of a sentence or half-verse may be marked with the \"\" symbol (called a danda, meaning \"bar\", or called a ', meaning \"full stop/pause\"). The end of a full verse may be marked with a double-danda, a \"\" symbol. A comma (called an ', meaning \"short stop/pause\") is used to denote a natural pause in speech.Unicode Consortium, The Unicode Standard, Version 3.0, Volume 1, , Addison-Wesley, pages 221-223[http://www.ijetr.org/finalpdf/1386305476.pdf Transliteration from Hindi Script to Meetei Mayek] Watham and Vimal (2013), IJETR, page 550 Other punctuation marks such as colon, semi-colon, exclamation mark, dash, and question mark are currently in use in Devanagari script, matching their use in European languages.Michael Shapiro (2014), The Devanagari Writing System in A Primer of Modern Standard Hindi, Motilal Banarsidass, , page 26\n\nOld forms\n\nThe following letter variants are also in use, particularly in older texts.\n\nNumerals\n\nFonts\n\nA variety of unicode fonts are in use for Devanagari. These include, but are not limited to, Akshar,[http://salrc.uchicago.edu/resources/fonts/available/hindi/akshar.shtml Akshar Unicode] South Asia Language Resource, University of Chicago (2009) [http://software.sil.org/annapurna/ Annapurna],[http://software.sil.org/annapurna/ Annapurna SIL Unicode], SIL International (2013) Arial,[http://salrc.uchicago.edu/resources/fonts/available/hindi/arialunicode.shtml Arial Unicode] South Asia Language Resource, University of Chicago (2009) CDAC-Gist Surekh,[http://salrc.uchicago.edu/resources/fonts/available/hindi/surekh.shtml CDAC-GIST Surekh Unicode] South Asia Language Resource, University of Chicago (2009) CDAC-Gist Yogesh,[http://salrc.uchicago.edu/resources/fonts/available/hindi/yogesh.shtml CDAC-GIST Yogesh] South Asia Language Resource, University of Chicago (2009) [http://www.sanskritweb.net/cakram/ Chandas], Gargi,[http://salrc.uchicago.edu/resources/fonts/available/hindi/gargi.shtml Gargi] South Asia Language Resource, University of Chicago (2009) [https://www.gnome-look.org/content/show.php/Gurumaa+Hindi+Unicode+Font+(GPL)?content16645 Gurumaa],[http://kde-look.org/content/show.php?content\n16645 Gurumaa Unicode - a sans font] KDE (2012) Jaipur,[http://salrc.uchicago.edu/resources/fonts/available/hindi/jaipur.shtml Jaipur] South Asia Language Resource, University of Chicago (2009) Jana,[http://salrc.uchicago.edu/resources/fonts/available/hindi/janahindi.shtml Jana] South Asia Language Resource, University of Chicago (2009) Kalimati,[http://salrc.uchicago.edu/resources/fonts/available/hindi/kalimati.shtml Kalimati] South Asia Language Resource, University of Chicago (2009) Kanjirowa,[http://salrc.uchicago.edu/resources/fonts/available/hindi/kanjirowa.shtml Kanjirowa] South Asia Language Resource, University of Chicago (2009) [https://fedorahosted.org/lohit/ Lohit Devanagari], Mangal,[http://salrc.uchicago.edu/resources/fonts/available/hindi/mangal.shtml Mangal] South Asia Language Resource, University of Chicago (2009) Raghu,[http://salrc.uchicago.edu/resources/fonts/available/hindi/raghindi.shtml Raghu] South Asia Language Resource, University of Chicago (2009) [http://www.omkarananda-ashram.org/Sanskrit/itranslator2003.htm Sanskrit2003],[http://salrc.uchicago.edu/resources/fonts/available/hindi/sanskrit2003.shtml Sanskrit Ashram] South Asia Language Resource, University of Chicago (2009) [http://www.sanskritweb.net/itrans/#S99FONTS Santipur OT], [http://svayambhava.blogspot.in/p/siddhanta-devanagariunicode-open-type.html Siddhanta], Thyaka,[http://salrc.uchicago.edu/resources/fonts/available/hindi/thyakarabison.shtml Thyaka] South Asia Language Resource, University of Chicago (2009) and [http://www.sanskritweb.net/cakram/ Uttara].[http://isites.harvard.edu/icb/icb.do?keywordk21214&pageid\nicb.page104271 Sanskrit Devanagari Fonts] Harvard University (2010); see [http://www.sanskritweb.net/cakram/ Chanda and Uttara ttf] 2010 archive (Accessed: July 8, 2015)\n\nThe form of Devanagari fonts vary with function. According to Harvard College for Sanskrit studies, \"Uttara [companion to Chandas] is the best in terms of ligatures but, because it is designed for Vedic as well, requires so much vertical space that it is not well suited for the \"user interface font\" (though an excellent choice for the \"original field\" font). Santipur OT is a beautiful font reflecting a very early [medieval era] typesetting style for Devanagari. Sanskrit 2003[http://www.unicode.org/charts/PDF/U0900.pdf Devanagari font]  Unicode Standard 8.0 (2015) is a good all-around font and has more ligatures than most fonts, though students will probably find the spacing of the CDAC-Gist Surekh font makes for quicker comprehension and reading.\"\n\nGoogle Fonts project now has a number of [https://fonts.google.com/?subset=devanagari new unicode fonts for Devanagari] in a variety of typefaces in Serif, Sans-Serif, Display and Handwriting categories.\n\nTransliteration\n\nThere are several methods of Romanisation or transliteration from Devanagari to the Roman script.\n\nHunterian system\n\nThe Hunterian system is the \"national system of romanisation in India\" and the one officially adopted by the Government of India.\n\nISO 15919\n\nA standard transliteration convention was codified in the ISO 15919 standard of 2001. It uses diacritics to map the much larger set of Brahmic graphemes to the Latin script. The Devanagari-specific portion is nearly identical to the academic standard for Sanskrit, IAST.\n\nIAST\n\nThe International Alphabet of Sanskrit Transliteration (IAST) is the academic standard for the romanisation of Sanskrit. IAST is the de facto standard used in printed publications, like books, magazines, and electronic texts with Unicode fonts. It is based on a standard established by the Congress of Orientalists at Athens in 1912. The ISO 15919 standard of 2001 codified the transliteration convention to include an expanded standard for sister scripts of Devanagari.[http://scriptsource.org/cms/scripts/page.php?item_id\nscript_detail_sort&key=Deva Devanagari IAST conventions] Script Source (2009), SIL International, United States\n\nThe National Library at Kolkata romanisation, intended for the romanisation of all Indic scripts, is an extension of IAST.\n\nHarvard-Kyoto\n\nCompared to IAST, Harvard-Kyoto looks much simpler. It does not contain all the diacritic marks that IAST contains. It was designed to simplify the task of putting large amount of Sanskrit textual material into machine readable form, and the inventors stated that it reduces the effort needed in transliteration of Sanskrit texts on the keyboard. This makes typing in Harvard-Kyoto much easier than IAST. Harvard-Kyoto uses capital letters that can be difficult to read in the middle of words.\n\nITRANS\n\nITRANS is a lossless transliteration scheme of Devanagari into ASCII that is widely used on Usenet. It is an extension of the Harvard-Kyoto scheme. In ITRANS, the word devanāgarī is written \"devanaagarii\" or \"devanAgarI\". ITRANS is associated with an application of the same name that enables typesetting in Indic scripts. The user inputs in Roman letters and the ITRANS pre-processor translates the Roman letters into Devanagari (or other Indic languages). The latest version of ITRANS is version 5.30 released in July, 2001. It is similar to Velthius system and was created by Avinash Chopde to help print various Indic scripts with personal computers.[http://indology.info/email/members/wujastyk/ Transliteration of Devanāgarī] D. Wujastyk (1996)\n\nVelthuis \n\nThe disadvantage of the above ASCII schemes is case-sensitivity, implying that transliterated names may not be capitalised. This difficulty is avoided with the system developed in 1996 by Frans Velthuis for TeX, loosely based on IAST, in which case is irrelevant.\n\nALA-LC Romanisation\n\nALA-LC romanisation is a transliteration scheme approved by the Library of Congress and the American Library Association, and widely used in North American libraries. Transliteration tables are based on languages, so there is a table for Hindi, one for Sanskrit and Prakrit, etc.\n\nWX\n\nWX is a Roman transliteration scheme for Indian languages, widely used among the natural language processing community in India. It originated at IIT Kanpur for computational processing of Indian languages. The salient features of this transliteration scheme are as follows.\n* Every consonant and every vowel has a single mapping into Roman. Hence it is a prefix code, advantageous from computation point of view.\n* Lower-case letters are used for unaspirated consonants and short vowels, while capital letters are used for aspirated consonants and long vowels. While the retroflex stops are mapped to 't, T, d, D, N', the dentals are mapped to 'w, W, x, X, n'. Hence the name 'WX', a reminder of this idiosyncratic mapping.\n\nEncodings\n\nISCII\n\nISCII is an 8-bit encoding. The lower 128 codepoints are plain ASCII, the upper 128 codepoints are ISCII-specific.\n\nIt has been designed for representing not only Devanagari but also various other Indic scripts as well as a Latin-based script with diacritic marks used for transliteration of the Indic scripts.\n\nISCII has largely been superseded by Unicode, which has, however, attempted to preserve the ISCII layout for its Indic language blocks.\n\nUnicode\n\nThe Unicode Standard defines three blocks for Devanagari: Devanagari (U+0900–U+097F), Devanagari Extended (U+A8E0–U+A8FF), and Vedic Extensions (U+1CD0–U+1CFF).\n\nDevanagari keyboard layouts\n\nInScript is the standard keyboard layout for Devanagari. It is inbuilt in all modern major operating systems. Microsoft Windows supports the InScript layout (using the Mangal font), which can be used to input unicode Devanagari characters. InScript is also available in some touchscreen mobile phones.\n\nInScript layout\n\nA Devanagari INSCRIPT bilingual keyboard.\n\nTypewriter\n\nThis layout was used on manual typewriters when computers were not available or were uncommon. For backward compatibility some typing tools like Indic IME still provide this layout.\n\nPhonetic\n\nSuch tools work on phonetic transliteration. The user writes in Roman and the IME automatically converts it into Devanagari. Some popular phonetic typing tools are Baraha IME and Google IME.\n\nThe Mac OS X operating system includes two different keyboard layouts for Devanagari: one is much like INSCRIPT/KDE Linux, the other is a phonetic layout called \"Devanagari QWERTY\".\n\nAny one of Unicode fonts input system is fine for Indic language Wikipedia and other wikiprojects, including Hindi, Bhojpuri, Marathi, Nepali Wikipedia. Some people use inscript. Majority uses either Google phonetic transliteration or input facility Universal Language Selector provided on Wikipedia. On Indic language wikiprojects Phonetic facility provided initially was java-based later supported by Narayam extension for phonetic input facility. Currently Indic language Wiki projects are supported by Universal Language Selector (ULS), that offers both phonetic keyboard (Aksharantaran, Marathi: , Hindi: ) and InScript keyboard (Marathi: ).\n\nThe Ubuntu Linux operating system supports several keyboard layouts for Devanagari, including Harvard-Kyoto, WX notation, Bolanagari and phonetic. Devanagari. http://en.wikipedia.org/?curid=8968."
  }
}
