{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=19623",
  "eid" : "3c755960-52b2-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778610678,
  "textBody" : "The Mitsubishi A6M \"Zero\" is a long-range fighter aircraft manufactured by Mitsubishi Aircraft Company, a part of Mitsubishi Heavy Industries, and operated by the Imperial Japanese Navy from 1940 to 1945. The A6M was designated as the , or the Mitsubishi A6M Rei-sen. The A6M was usually referred to by its pilots as the \"Reisen\" (zero fighter), \"0\" being the last digit of the imperial year 2600 (1940) when it entered service with the Imperial Navy. The official Allied reporting name was \"Zeke\", although the use of the name \"Zero\" was later adopted by the Allies as well.\n\nThe Zero was considered the most capable carrier-based fighter in the world when it was introduced early in World War II, combining excellent maneuverability and very long range.Hawks, Chuck. [http://www.chuckhawks.com/best_fighter_planes.htm \"The Best Fighter Planes of World War II\"]. chuckhawks.com. Retrieved: 18 January 2007. The Imperial Japanese Navy Air Service (IJNAS) also frequently used it as a land-based fighter.\n\nIn early combat operations, the Zero gained a legendary reputation as a dogfighter,Young 2013, p. 36. achieving an outstanding kill ratio of 12 to 1,Thompson with Smith 2008, p. 231. but by mid-1942 a combination of new tactics and the introduction of better equipment enabled Allied pilots to engage the Zero on generally equal terms.Mersky, Peter B. (Cmdr. USNR). [http://www.ibiblio.org/hyperwar/USMC/USMC-C-Aces/index.html \"Time of the Aces: Marine Pilots in the Solomons, 1942–1944.\"] ibiblio.org. Retrieved: 18 January 2007. By 1943, the Zero became less effective against newer Allied fighters because of inherent design weaknesses and the failure to develop more powerful aircraft engines. The Allied fighters gained greater firepower, armor, and speed, and approached the Zero's maneuverability, and the Mitsubishi A6M was outdated by 1944. However, the Zero continued to serve in a front line role until the end of the war because design delays, and production difficulties, hampered the introduction of newer Japanese aircraft. The Zero was also adapted for use in kamikaze operations during the final year of the war in the Pacific.Willmott 1980, pp. 40–41. Japan produced more Zeros than any other model of combat aircraft during the course of the war.Angelucci and Matricardi 1978, p. 138.\n\nDesign and development\n\nThe Mitsubishi A5M fighter was just entering service in early 1937, when the Imperial Japanese Navy started looking for its eventual replacement. On October 5, 1937, they issued \"Planning Requirements for the Prototype 12-shi Carrier-based Fighter\", sending it to Nakajima and Mitsubishi. Both firms started preliminary design work while they awaited more definitive requirements to be handed over in a few months.\n\nBased on the experiences of the A5M in China, the IJN sent out updated requirements in October calling for a speed of 600 km/h and a climb to 3000 m in 3.5 minutes. With drop tanks, they wanted an endurance of two hours at normal power, or six to eight hours at economical cruising speed. Armament was to consist of two 20 mm cannons, two 7.7 mm (.303 in) machine guns and two 30 kg or 60 kg bombs. A complete radio set was to be mounted in all aircraft, along with a radio direction finder for long-range navigation. The maneuverability was to be at least equal to that of the A5M, while the wingspan had to be less than 12 m (39 ft) to allow for use on aircraft carriers. All this was to be achieved with available engines, a significant design limitation.\n\nNakajima's team considered the new requirements unachievable and pulled out of the competition in January. Mitsubishi's chief designer, Jiro Horikoshi, thought that the requirements could be met, but only if the aircraft were made as light as possible. Every possible weight-saving measure was incorporated into the design. Most of the aircraft was built of a new top-secret aluminium alloy developed by Sumitomo Metal Industries in 1936. Called \"extra super duralumin\" (ESD), it was lighter, stronger and more ductile than other alloys (e.g. 24S alloy) used at the time, but was prone to corrosive attack, which made it brittle.Yoshio, Baba.[https://www.jstage.jst.go.jp/article/jilm1951/39/5/39_5_378/_article/cited-by \"Extra super duralumin and successive aluminum alloys for aircraft.\"] Journal of Japan Institute of Light Metals (Sumitomo Light Metal Ind. Ltd., Japan), Volume 39, Issue 5, pp. 378–395. Retrieved: 22 November 2015. This detrimental effect was countered with an anti-corrosion coating applied after fabrication. No armour protection was provided for the pilot, engine or other critical points of the aircraft, and self-sealing fuel tanks, which were becoming common at the time, were not used. This made the Zero lighter, more maneuverable, and the longest-ranged single-engine fighter of World War II, which made it capable of searching out an enemy hundreds of kilometres away, bringing them to battle, then returning to its base or aircraft carrier.  However, that tradeoff in weight and construction also made it prone to catching fire and exploding when struck by enemy rounds.Tillman 1979,  pp. 5, 6, 96.\n\nWith its low-wing cantilever monoplane layout, retractable, wide-set conventional landing gear and enclosed cockpit, the Zero was one of the most modern carrier based aircraft in the world at the time of its introduction. It had a fairly high-lift, low-speed wing with very low wing loading. This, combined with its light weight, resulted in a very low stalling speed of well below 60 kn. This was the main reason for its phenomenal maneuverability, allowing it to out-turn any Allied fighter of the time. Early models were fitted with servo tabs on the ailerons after pilots complained that control forces became too heavy at speeds above 300 km/h.  They were discontinued on later models after it was found that the lightened control forces were causing pilots to overstress the wings during vigorous maneuvers.Yoshimura 1996, p. 108.\n\nIt has been claimed that the Zero's design showed a clear influence from British and American fighter aircraft and components exported to Japan in the 1930s, and in particular on the American side, the Vought V-143 fighter. Chance Vought had sold the prototype for this aircraft and its plans to Japan in 1937. Eugene Wilson, president of Vought, claimed that when shown a captured Zero in 1943, he found that \"There on the floor was the Vought V 142  or just the spitting image of it, Japanese-made\", while the \"power-plant installation was distinctly Chance Vought, the wheel stowage into the wing roots came from Northrop, and the Japanese designers had even copied the Navy inspection stamp from Pratt & Whitney type parts.\"Fernandez 1983, pp. 107–108. While the sale of the V-143 was fully legal,Angelucci and Bowers 1987, p. 436. Wilson later acknowledged the conflicts of interest that can arise whenever military technology is exported. Counterclaims maintain that there was no significant relationship between the V-143 (which was an unsuccessful design that had been rejected by the U.S. Army Air Corps and several export customers) and the Zero, with only a superficial similarity in layout.\n\nThe Zero resembled the 1937 British Gloster F.5/34. Performance of the Gloster F.5/34 was comparable to that of early model Zeros, with its dimensions and appearance remarkably close to the Zero.http://www.faqs.org/docs/air/avzero.html#m6  Gloster had a relationship with the Japanese between the wars, with Nakajima building the carrier-based plane, the Gloster Gambet, under license.James 1987, p. 159 However allegations about the Zero being a copy have been discredited by some authors.Air International October 1973, pp. 199–200.\n\nName\n\nThe A6M is usually known as the \"Zero\" from its Japanese Navy type designation, Type 0 carrier fighter (Rei shiki Kanjō sentōki, 零式艦上戦闘機), taken from the last digit of the Imperial year 2600 (1940) when it entered service. In Japan, it was unofficially referred to as both Rei-sen and Zero-sen; Japanese pilots most commonly called it Zero-sen, where sen is the first syllable of sentōki, Japanese for \"fighter plane\".Parshall and Tully 2007, p. 79.\n\nIn the official designation \"A6M\", the \"A\" signified a carrier-based fighter, \"6\" meant that it was the sixth such model built for the Imperial Navy, and \"M\" indicated Mitsubishi as the manufacturer.\n\nThe official Allied code name was \"Zeke\", in keeping with the practice of giving male names to Japanese fighters, female names to bombers, bird names to gliders, and tree names to trainers. \"Zeke\" was part of the first batch of \"hillbilly\" code names assigned by Captain Frank T. McCoy of Nashville, Tennessee (assigned to the Allied Technical Air Intelligence Unit (ATAIU) at Eagle Farm Airport in Australia), who wanted quick, distinctive, easy-to-remember names.  The Allied code for Japanese aircraft was introduced in 1942, and McCoy chose \"Zeke\" for the \"Zero\".  Later, two variants of the fighter received their own code names. The Nakajima A6M2-N floatplane version of the Zero was called \"Rufe\", and the A6M3-32 variant was initially called \"Hap\". General \"Hap\" Arnold, commander of the USAAF, objected to that name, however, so it was changed to \"Hamp\". Captured examples were examined in New Guinea and the Allies realized that it was a variant of the Zero, so it was finally renamed \"Zeke 32\".\n\nOperational history\n\nThe first Zeros (pre-series of 15 A6M2) went into operation with the 12th Rengo Kōkūtai in July 1940.Matricardi 2006, p. 88. On 13 September 1940, the Zeros scored their first air-to-air victories when 13 A6M2s led by Lieutenant Saburo Shindo attacked 27 Soviet-built Polikarpov I-15s and I-16s of the Chinese Nationalist Air Force, shooting down all the fighters without loss to themselves. By the time they were redeployed a year later, the Zeros had shot down 99 Chinese aircraftGlancey 2006, p. 170. (266 according to other sources).\n\nAt the time of the attack on Pearl Harbor, 521 Zeros were active in the Pacific, 328 in first-line units.Francillon 1979, p. 365. The carrier-borne Model 21 was the type encountered by the Americans. Its tremendous range of over  allowed it to range farther from its carrier than expected, appearing over distant battlefronts and giving Allied commanders the impression that there were several times as many Zeros as actually existed.Gunston 1980, p. 162.\n\nThe Zero quickly gained a fearsome reputation. Thanks to a combination of unsurpassed maneuverability — even when compared to other contemporary Axis fighters — and excellent firepower, it easily disposed the motley collection of Allied aircraft sent against it in the Pacific in 1941.Young 2013, p. 5.Nijboer 2009, p. 4. It proved a difficult opponent even for the Supermarine Spitfire. \"The RAF pilots were trained in methods that were excellent against German and Italian equipment but suicide against the acrobatic Japs\", as Lt.Gen. Claire Lee Chennault had to notice.Smith 2015, pp. 146–149. Although not as fast as the British fighter, the Mitsubishi fighter could out-turn the Spitfire with ease, sustain a climb at a very steep angle, and stay in the air for three times as long.Spick 1997, p. 165.\n\nAllied pilots soon developed tactics to cope with the Zero. Due to its extreme agility, engaging a Zero in a traditional, turning dogfight was likely to be fatal.Spick 1983, p. 118. It was better to swoop down from above in a high-speed pass, fire a quick burst, then climb quickly back up to altitude. (A short burst of fire from heavy machine guns or cannon was often enough to bring down the fragile Zero.) Such \"boom-and-zoom\" tactics were used successfully in the China Burma India Theater (CBI) by the \"Flying Tigers\" of the American Volunteer Group (AVG) against similarly maneuverable Japanese Army aircraft such as the Nakajima Ki-27 Nate and Nakajima Ki-43 Oscar. AVG pilots were trained by their commander Claire Chennault to exploit the advantages of their P-40s, which were very sturdy, heavily armed, generally faster in a dive and level flight at low altitude, with a good rate of roll.Rossi, J. R. [http://www.flyingtigersavg.22web.net/tiger2.htm \"Chuck Older's Tale: Hammerhead Stalls and Snap Rolls, Written in the mid-1980s.\"] AFG: American Volunteer Group, The Flying Tigers, 1998. Retrieved: 5 July 2011.\n\nAnother important maneuver was Lieutenant Commander John S. \"Jimmy\" Thach's \"Thach Weave\", in which two fighters would fly about 60 m apart. If a Zero latched onto the tail of one of the fighters, the two aircraft would turn toward each other. If the Zero followed his original target through the turn, he would come into a position to be fired on by the target's wingman. This tactic was first used to good effect during the Battle of Midway and later over the Solomon Islands.\n\nMany highly experienced Japanese aviators were lost in combat, resulting in a progressive decline in quality, which became a significant factor in Allied successes.  Unexpected heavy losses of pilots at the Battles of the Coral Sea and Midway dealt the Japanese carrier air force a blow from which it never fully recovered.Holmes 2011, p. 314.Thruelsen 1976, pp. 173, 174.\n\nThroughout the Battle of Midway Allied pilots expressed a high level of dissatisfaction with the Grumman F4F Wildcat. The Commanding Officer of  noted:  They were astounded by the Zero's superiority:Young 2013, pp. 6, 51, 82. \n\nIn contrast, Allied fighters were designed with ruggedness and pilot protection in mind. The Japanese ace Saburō Sakai described how the toughness of early Grumman aircraft was a factor in preventing the Zero from attaining total domination: \n\nWhen the powerfully armed Lockheed P-38 Lightning, armed with four \"light barrel\" AN/M2 .50 cal. Browning machine guns and one 20 mm autocannon, and the Grumman F6F Hellcat and Vought F4U Corsair, each with six AN/M2 heavy calibre Browning guns, appeared in the Pacific theater, the A6M, with its low-powered engine and lighter armament, was hard-pressed to remain competitive. In combat with an F6F or F4U, the only positive thing that could be said of the Zero at this stage of the war was that, in the hands of a skillful pilot, it could maneuver as well as most of its opponents. Nonetheless, in competent hands, the Zero could still be deadly.\n\nDue to shortages of high-powered aviation engines and problems with planned successor models, the Zero remained in production until 1945, with over 11,000 of all variants produced.\n\nAllied analysis\n\nAmerican opinions\n\nThe American military discovered many of the A6M's unique attributes when they recovered a largely intact specimen of an A6M2, the Akutan Zero, on Akutan Island in the Aleutians. During an air raid over Dutch Harbor on June 4, 1942, one A6M fighter was hit by ground-based anti-aircraft fire. Losing oil, Flight Petty Officer Tadayoshi Koga attempted an emergency landing on Akutan Island about 20 miles northeast of Dutch Harbor, but his Zero flipped over on soft ground in a sudden crash-landing.  Koga died instantly of head injuries (his neck was broken by the tremendous impact), but the relatively-undamaged fighter was found over a month later by an American salvage team and was shipped to Naval Air Station North Island, where testing flights of the repaired A6M revealed both strengths and deficiencies in design and performance.Wilcox 1942, p. 86.Jablonski 1979 \n\nThe experts who evaluated the captured Zero found that the plane weighed about  fully loaded, some  lighter than the Grumman F4F Wildcat, the standard United States Navy fighter of the time. The A6M's airframe was \"built like a fine watch\"; the Zero was constructed with flush rivets, and even the guns were flush with the wings. The instrument panel was a \"marvel of simplicity ... with no superfluities to distract [the pilot].\" What most impressed the experts was that the Zero's fuselage and wings were constructed in one piece, unlike the American method that built them separately and joined the two parts together. The Japanese method was much slower, but resulted in a very strong structure and improved close maneuverability.\n\nAmerican test pilots found that the Zero's controls were \"very light\" at 320 km/h, but stiffened at faster speeds (above 348 km/h, or 216 mph) to safeguard against wing failure.Green and Swanborough 2001  The Zero could not keep up with Allied aircraft in high-speed maneuvers, and its low \"never exceed speed\" (VNE) made it vulnerable in a dive. While stable on the ground despite its light weight, the aircraft was designed purely for the attack role, emphasizing long range, maneuverability, and firepower at the expense of protection of its pilot. Most lacked self-sealing tanks and armor plating.\n\nBritish opinions\n\nCaptain Eric Brown, the Chief Naval Test Pilot of the Royal Navy, recalled being impressed by the Zero during tests of captured aircraft. \"I don't think I have ever flown a fighter that could match the rate of turn of the Zero. The Zero had ruled the roost totally and was the finest fighter in the world until mid-1943.\"\n\nVariants\n\nA6M1, Type 0 Prototypes\n\nThe first two A6M1 prototypes were completed in March 1939, powered by the 580 kW (780 hp) Mitsubishi Zuisei 13 engine with a two-blade propeller. It first flew on 1 April, and passed testing within a remarkably short period. By September, it had already been accepted for Navy testing as the A6M1 Type 0 Carrier Fighter, with the only notable change being a switch to a three-bladed propeller to cure a vibration problem.\n\nA6M2a Type 0 Model 11\n\nWhile the navy was testing the first two prototypes, they suggested that the third be fitted with the 700 kW Nakajima Sakae 12 engine instead. Mitsubishi had its own engine of this class in the form of the Kinsei, so they were somewhat reluctant to use the Sakae. Nevertheless, when the first A6M2 was completed in January 1940, the Sakae's extra power pushed the performance of the Zero well past the original specifications.\n\nThe new version was so promising that the Navy had 15 built and shipped to China before they had completed testing. They arrived in Manchuria in July 1940, and first saw combat over Chungking in August. There they proved to be completely untouchable by the Polikarpov I-16s and I-153s that had been such a problem for the A5Ms when in service. In one encounter, 13 Zeros shot down 27 I-15s and I-16s in under three minutes without loss. After hearing of these reports, the navy immediately ordered the A6M2 into production as the Type 0 Carrier Fighter, Model 11.\nReports of the Zero's performance filtered back to the US slowly. There they were dismissed by most military officials, who thought it was impossible for the Japanese to build such an aircraft.\n\nA6M2b Type 0 Model 21\n\n \nAfter the delivery of the 65th aircraft, a further change was worked into the production lines, which introduced folding wingtips to allow them to fit on aircraft carriers. The resulting Model 21 would become one of the most produced versions early in the war. A feature was the improved range with 520 l wing tank and 320 l drop tank. When the lines switched to updated models, 740 Model 21s had been completed by Mitsubishi, and another 800 by Nakajima. Two other versions of the Model 21 were built in small numbers, the Nakajima-built A6M2-N \"Rufe\" floatplane (based on the Model 11 with a slightly modified tail), and the A6M2-K two-seat trainer of which a total of 508 were built by Hitachi and the Sasebo Naval Air Arsenal.Francillon 1979, p. 399.\n\nA6M3 Type 0 Model 32\n\nIn 1941, Nakajima introduced the Sakae 21 engine, which used a two-speed supercharger for better altitude performance, and increased power to 840 kW. A prototype Zero with the new engine was first flown on July 15, 1941.Nohara 1993, p. 76.\n\nThe new Sakae was slightly heavier and somewhat longer due to the larger supercharger, which moved the center of gravity too far forward on the existing airframe. To correct for this, the engine mountings were cut back by 185 mm to move the engine toward the cockpit. This had the side effect of reducing the size of the main fuselage fuel tank (located between the engine and the cockpit) from 518 l to 470 l. The cowling was redesigned to enlarge the cowl flaps, revise the oil cooler air intake, and move the carburetor air intake to the upper half of the cowling.Nohara 1993, p. 51.Reisen no Tsuioku (Model Art 883), 2013, p. 75.\n\nThe wings were redesigned to reduce span, eliminate the folding tips, and square off the wingtips. The inboard edge of the aileron was moved outboard by one rib, and the wing fuel tanks were enlarged accordingly to 420 l. The two 20 mm wing cannon were upgraded from the Type 99 Mark l to the Type 99 Mark II, which required a bulge in the sheet metal of the wing below each cannon. The wings also included larger ammunition boxes and thus allowing 100 rounds per cannon.\n\nThe Sakae 21 engine and other changes increased maximum speed by only 11 km/h compared to the Model 21, but sacrificed nearly 1000 km of range.  Nevertheless, the navy accepted the type and it entered production in April 1942.\n\nThe shorter wing span led to better roll, and the reduced drag allowed the diving speed to be increased to 670 km/h. On the downside, turning and range, which were the strengths of the Model 21, suffered due to smaller ailerons, decreased lift and greater fuel consumption. The shorter range proved a significant limitation during the Solomons Campaign, during which Zeros based at Rabaul had to travel nearly to their maximum range to reach Guadalcanal and return.Mechanic of World Aircraft Vol. 5, Koujinsha, 1994, pp. 220–221. Consequently, the Model 32 was unsuited to that campaignNohara 1993, pp. 76–77. and was used mainly for shorter range offensive missions and interception.\n\nThe appearance of the redesigned A6M3-32 prompted the US to assign the Model 32 a new code name, \"Hap\". This name was short-lived, as a protest from USAAF Commanding General Henry \"Hap\" Arnold forced a change to \"Hamp\". Soon after, it was realized that it was simply a new model of the \"Zeke\" and was termed \"Zeke 32\".\n\nThis variant was flown by only a small number of units, and only 343 were built.\n\nA6M3 Type 0 Model 22\n\nIn order to correct the deficiencies of the Model 32, a new version with folding wingtips and redesigned wing was introduced. The fuel tanks were moved to the outer wings, fuel lines for a 330 l drop tank were installed under each wing and the internal fuel capacity was increased to 570 l. More important, it regained back its capabilities for long operating ranges, similar to the previous A6M2 Model 21, which was vastly shortened by the Model 32.\n\nHowever, before the new design type was accepted formally by the Navy, the A6M3 Model 22 already stood ready for service in December 1942. Approximately 560 aircraft of the new type had been produced in the meantime by Mitsubishi Jukogyo K.K.Nohara 1993, p. 78.\n\nAccording to a theory, the very late production Model 22 might have had wings similar to the shortened, rounded-tip wing of the Model 52.Mikesh 1994. p. 90. One plane of such arrangement was photographed at Lakunai Airfield (\"Rabaul East\") in the second half of 1943, and has been published widely in a number of Japanese books. While the engine cowling is the same of previous Model 32 and 22, the theory proposes that the plane is an early production Model 52.Famous Airplanes of the World 9, 1993 p. 33. \n\nThe Model 32, 22, 22 kou, 52, 52 kou and 52 otsu were all powered by the Nakajima 栄 (Sakae) 21型 engine. That engine kept its designation in spite of changes in the exhaust system for the Model 52.\n\nA6M4 Type 0 Model 41/42\n\nMitsubishi is unable to state with certainty that it ever used the designation \"A6M4\" or model numbers for it.  However, \"A6M4\" does appear in a translation of a captured Japanese memo from a Naval Air Technical Arsenal, titled Quarterly Report on Research Experiments, dated 1 October 1942. It mentions a \"cross-section of the A6M4 intercooler\" then being designed.  Some researchers believe \"A6M4\" was applied to one or two prototype planes fitted with an experimental turbo-supercharged Sakae engine designed for high altitude.Mikesh 1981, p. 32. Mitsubishi's involvement in the project was probably quite limited or nil; the unmodified Sakae engine was made by Nakajima.  The design and testing of the turbo-supercharger was the responsibility of the First Naval Air [Technical] Arsenal (, ') at Yokosuka.\"Quarterly Report on Research Experiments\", Vol. 1, 30 March 1945. CINCPAC-CINCPOA Bulletin, Special Translation No. 52, No. 67–45, p. 14 D. At least one photo of a prototype plane exists.  It shows a turbo unit mounted in the forward left fuselage.\n\nLack of suitable alloys for use in the manufacture of a turbo-supercharger and its related ducting caused numerous ruptures, resulting in fires and poor performance. Consequently, further development of a turbo-supercharged A6M was cancelled.  The lack of acceptance by the navy suggests that the navy did not bestow model number 41 or 42 formally, although it appears that the arsenal did use the designation \"A6M4\". The prototype engines nevertheless provided useful experience for future engine designs.[http://www.j-aircraft.com/a6mresearch/a6m4.htm \"A6M4\".] J-Aircraft.com. Retrieved: 13 October 2010.\n\nA6M5 Type 0 Model 52\n\nSometimes considered as the most effective variant,Mikesh 1994, p. 53. the Model 52 was developed to again shorten the wings to increase speed and dispense with the folding wing mechanism. In addition, ailerons, aileron trim tab and flaps were revised.Nohara 1993, p. 80.Sekai no Kessaku Ki Vol. 9, pp. 57–59. Produced first by Mitsubishi, most Model 52s were made by Nakajima.  The prototype was made in June 1943 by modifying an A6M3 and was first flown in August 1943.Sekai no Kessaku Ki Vol. 9, Bunrindou, 1993, p. 21. The first Model 52 is said in the handling manualSummary of Provisional Handling Instructions, February 1944, English translation. to have production number 3904,Mikesh 1994, p. 115. which apparently refers to the prototype.\n\nResearch by Mr. Bunzo Komine published by Mr. Kenji Miyazaki states that aircraft 3904 through 4103 had the same exhaust system and cowl flaps as on the Model 22.\"Reisen Mushimegane\", Fumetsu no Reisen, Maru, 2007. This is partially corroborated by two wrecks researched by Mr. Stan Gajda and Mr. L. G. Halls, production number 4007 and 4043, respectively.Gajda, Stan. [http://www.j-aircraft.org/smf/index.php?topic9730.0 \"The transitional Zero: New evidence that supports the theory.\"] j-aircraft, 28 July 2010. Retrieved: 30 November 2015.Halls, L.G. [http://www.j-aircraft.org/smf/index.php?topic\n9974.0 \"\t The \"Hybrid\" Zero: More Evidence.\"] j-aircraft, 9 September 2010. Retrieved: 30 November 2015.Lansdale, Jim. [http://www.j-aircraft.org/smf/index.php?topic9048.0 \"Transitional model of the Mitsubishi ReiSen 52 (A6M5): Part II.\"] j-aircraft, 21 March 2010. Retrieved: 30 November 2015. (The upper cowling was slightly redesigned from that of the Model 22.)\nAn early production A6M5 Zero with non separated exhaust, with an A6M3 Model 22 in the background.\nA new exhaust system provided an increment of thrust by aiming the stacks aft and distributing them around the forward fuselage.  The new exhaust system required \"notched\" cowl flaps and heat shields just aft of the stacks. (Note, however, that the handling manual translation states that the new style of exhaust commenced with number 3904.  Whether this is correct, indicates retrofitting intentions, refers to the prototype but not to all subsequent planes, or is in error is not clear.)  From production number 4274, the wing fuel tanks received carbon dioxide fire extinguishers.Sekai no Kessaku Ki, Vol. 9. pp. 57–59.A6M5 Summary of Provisional Handling Instructions, February 1944 (translated) at 4-4.  From number 4354, the radio became the Model 3, aerial Mark 1, and at that point it is said the antenna mast was shortened slightly.A6M5 Summary of Provisional Handling Instructions, February 1944 (translated). p. 4-4. Through production number 4550, the lowest exhaust stacks were approximately the same length as those immediately above them.  This caused hot exhaust to burn the forward edge of the landing gear doors and heat the tires.  Therefore, from number 4551 Mitsubishi began to install shorter bottom stacks.Nohara 1993, p. 79.  Nakajima manufactured the Model 52 at its Koizumi plant in Gunma Prefecture.Sekai no Kessaku Ki, Vol. 9 Bunrindou 1993, p. 23. The A6M5 had a maximum speed of 565 km/h) at  and reached that altitude in 7:01 minutes.Sekai no Kessaku Ki, Vol. 9, Bunrindou, 1993, p. 24.\n\nSubsequent variants included:\n* A6M5a, Model 52甲 (Kō, a) – Starting at Mitsubishi number 4651, an armament change substituted the belt-fed Type 99-2 Mark 4 cannon, with 125 rounds per gun, in place of the drum-fed Type 99-2 Mark 3 cannon that carried 100 rounds per gun. Hence, the bulge in the underside of the wing for each cannon's ammunition drum was deleted and the ejection port for spent cartridge cases was moved.  Thicker wing skinning was installed to permit higher diving speeds.Sekai no Kessaku Ki, Vol. 9, Bunrindou, 1993, p. 22.\n* A6M5b, Model 52乙 (Otsu, b) – Armament change: The 7.7 mm (.303 in) Type 97 gun (750 m/s muzzle velocity and 600 m/1,970 ft range) in the right forward fuselage was replaced by a 13.2 mm Type 3 Browning-derived gun (790 m/s muzzle velocity and 900 m/2,950 ft range, with a rate of fire of 800 rounds per minute) with 240 rounds. The larger weapon required an enlarged opening, creating a distinctive asymmetric appearance to the top of the cowling, and a revised gas outlet near the windscreen. In addition, each wing cannon received a fairing at the wing leading edge. A plate of armored glass 45 mm thick was fitted to the windscreen. A larger propeller spinner was fitted, suggesting a change to the propeller.Sekai no Kessaku Ki, Vol. 9, Bunrindou. p. 77.  The type of ventral drop tank was changed, it now had fins and was suspended on a slanted pipe.  The first of this variant was completed in April 1944 and it was produced until October 1944.Nohara 1993, p. 82.\n* A6M5c, Model 52丙 (Hei, c) – Armament change: One 13.2 mm (.51 in) Type 3 machine gun was added in each wing outboard of the cannon, and the 7.7 mm gun on the left side of the cowl was deleted.  Four racks for rockets or small bombs were installed outboard of the 13 mm gun in each wing.  Engine change: Some sources state that the hei had a Sakae 31 engineMechanic of World Aircraft, Vol.5, Koujinsha, p. 220-221.  In addition, a 55 mm thick piece of armored glass was installed at the headrest and a plate of armor was installed behind the seat.  The mounting of the central 300L drop tank changed to a four-post design.Sekai no Kessaku Ki, Vol. 9, Bunrindou, pp. 46–49.  Wing skin was thickened further. The first of this variant was completed in September 1944.  Because of the gain in weight, this variant was used mainly for intercepting B-29s and special attack.Sekai no Kessaku Ki, Vol. 9 Bunrindou 1993 at 22.\n* A6M5-S (A6M5 Yakan Sentōki) – Armament change: To intercept B-29s and other night-flying aircraft, an air arsenal converted some Model 52s to night fighters.Sekai no Kessaku Ki, Vol. 9, Bunrindou, 1993, p. 23.  They were armed with one 20 mm Type 99 cannon behind the pilot, aimed upward, similar in intent to the Luftwaffe's Schräge Musik installation.Graham, Rob. [http://www.j-aircraft.com/a6mresearch/zeronf.htm \"FAQ: Zero Night Fighter.\"] j-aircraft.com. Retrieved: 30 November 2015.  However, lack of radar prevented them from being very effective.\n\nSome Model 21 and 52 aircraft were converted to \"bakusen\" (fighter-bombers) by mounting a bomb rack and 250 kg bomb in place of the centerline drop tank.\n\nPerhaps seven Model 52 planes were ostensibly converted into A6M5-K two-seat trainers.Francillon 1979, p. 399. Mass production was contemplated by Hitachi, but not undertaken.Nohara 1993, p. 84.\n\nA6M6c Type 0 Model 53c\n\nThis was similar to the A6M5c, but with self-sealing wing tanks and a Nakajima Sakae 31a engine featuring water-methanol engine boost.\n\nA6M7 Type 0 Model 62\n\nSimilar to the A6M6 but intended for attack or Kamikaze role.\n\nA6M8 Type 0 Model 64\n\nSimilar to the A6M6 but with the Sakae (now out of production) replaced by the Mitsubishi Kinsei 62 engine with , 60% more powerful than the engine of the A6M2. This resulted in an extensively modified cowling and nose for the aircraft. The carburetor intake was much larger, a long duct like that on the Nakajima B6N Tenzan was added, and a large spinner—like that on the Yokosuka D4Y Suisei with the Kinsei 62—was mounted. The larger cowling meant deletion of the fuselage-mounted machine gun, but armament was otherwise unchanged from the Model 52 Hei (2 x 20 mm cannon; 2 x 13 mm/.51 in MG). In addition, the Model 64 was modified to carry two 150 l  drop tanks on either wing in order to permit the mounting of a 250 kg bomb on the underside of the fuselage. Two prototypes were completed in April 1945 but the chaotic situation of Japanese industry and the end of the war obstructed the start of the ambitious program of production for 6,300 machines, none being completed.Francillon 1970, pp. 374–375.\n\nProduction\n\nNot included:\n* A second A6M1 was completed on 17 March 1939,FAOTW, 1996, p. 137. but was written off without explanation after completing the company's flight test program in July 1940.Francillon 1979, pp. 364–365.\n\nTrainer\n\nTotal production\n\nOperators\n\n;\n* Imperial Japanese Navy Air Service\n;\n* Royal Thai Air Force\n* Royal Thai Navy\n\nPost-war\n\n;\n* Indonesian Air Force\n;\n* Republic of China Air Force\n\nSurviving aircraft\n\nLike many surviving World War II Japanese aircraft, most surviving Zeros are made up of parts from multiple airframes. As a result, some are referred to by conflicting manufacturer serial numbers. In other cases, such as those recovered after decades in a wrecked condition, they have been reconstructed to the point that the majority of their structure is made up of modern parts. All of this means the identities of survivors can be difficult to confirm.\n\nMost flying Zeros have had their engines replaced with similar American units. Only one, the Planes of Fame Museum's A6M5, has the original Sakae engine.Seaman, Richard. [http://www.richard-seaman.com/Aircraft/AirShows/Chino2004/Sampler/index.html \"Aircraft air shows.\"] richard-seaman.com. Retrieved: 13 October 2010.\n\nThe rarity of flyable Zeros accounts for the use of single-seat North American T-6 Texans, with heavily modified fuselages and painted in Japanese markings, as substitutes for Zeros in the films Tora! Tora! Tora!, The Final Countdown, and many other television and film depictions of the aircraft, such as Baa Baa Black Sheep (renamed Black Sheep Squadron). One Model 52 was used during the production of Pearl Harbor.\n\nAustralia \n\n* 840 – On display at the Australian Aviation Heritage Centre in Winnellie, Northern Territory. Wreckage of the forward fuselage, inboard wings, engine, and propeller.\n* 5784 – On display at the Australian War Memorial in Canberra, Australian Capital Territory. A restored A6M2-21 \"V-173\" was retrieved as a wreck after the war and later found to have been flown by Saburō Sakai at Lae.\n\nChina \n\n* Unknown serial number – Beijing Military MuseumSmith 2015, p. 141.\n\nGermany \n\n* Replica – On display at the Technik Museum Speyer in Speyer, Rhineland-Palatinate. Replica of the fuselage section on display at IWM London.\n\nIndonesia\n\n* Unknown serial number – The Museum Dirgantara Mandala in Yogyakarta has an A6M in its collection.\n\nJapan \n\n* 1493 – On display at the Kawaguchiko Motor Museum in Fujikawaguchiko, Yamanashi.\n* 4168/4240/4241 – On display at the Yūshūkan in Chiyoda, Tokyo.\n* 4685 – On display at Hamamatsu Air Base in Hamamatsu, Shizuoka.\n* 4708 – On display at the Mitsubishi Heavy Industries Museum in Komaki, Aichi.\n* 31870 – A two-seater on display at the National Museum of Nature and Science in Taito, Tokyo.\n* 62343 – On display at the Chiran Peace Museum for Kamikaze Pilots in Chiran, Kagoshima.\n* 82729 – On display at the Yamato Museum in Kure, Hiroshima.\n* 91518 – On display at the Kawaguchiko Motor Museum in Fujikawaguchiko, Yamanashi.\n* 92717 – On display at the Kawaguchiko Motor Museum in Fujikawaguchiko, Yamanashi.\n* Replica – On display at MCAS Iwakuni in Iwakuni, Yamaguchi.\n* Replica – Owned by businessman Masahide Ishizuka in Kanoya, Kagoshima. Airworthy, with a Pratt & Whitney R-1830 engine.\n\nNew Zealand \n\n* 3835/3844 – On display at the Auckland War Memorial Museum in Auckland, Auckland Region.\n\nUnited Kingdom \n\n* 196 – On display at the Imperial War Museum London in London, Greater London. Forward fuselage displayed.\n* 3685 – On display at the Imperial War Museum Duxford in Duxford, Cambridgeshire. Fuselage displayed in unrestored condition.\n\nUnited States \n\n* 1303 – In storage at the Flying Heritage Collection in Everett, Washington.\n* 2266 – A small amount of wreckage from the Zero that crashed in the Niihau Incident is on display at the Pacific Aviation Museum in Honolulu, Hawaii.\n* 3618 – In storage at Fantasy of Flight in Polk City, Florida.\n* 3852 – Owned by the Flying Heritage Collection in Everett, Washington. This aircraft was recovered from Babo Airfield, Indonesia, and restored — first in Russia, then in California, and finally in Washington state — before being delivered to the Flying Heritage Collection. It has a P&W engine installed.\n* 4043 – In storage at Fantasy of Flight in Polk City, Florida. Along with several other Zeros, this aircraft was recovered by the Australian War Memorial Museum in the early 1970s from Rabaul in the South Pacific. The markings suggest that it was in service after June 1943 and further investigation suggests that it has cockpit features associated with the Nakajima-built Model 52b. If this is correct, it is most likely one of the 123 aircraft lost by the Japanese during the assault of Rabaul. The aircraft was shipped in pieces to the attraction and it was eventually made up for display as a crashed aircraft. Much of the aircraft is usable for patterns and some of its parts can be restored to one day make this a basis for a flyable aircraft.\n* 4340 – On display at the National Air and Space Museum in Washington, D.C.\n* 4400 – In storage at the Flying Heritage Collection in Everett, Washington.\n* 5356/5451 – On display at the Pacific Aviation Museum in Honolulu, Hawaii. This aircraft was formerly flown by the Commemorative Air Force after being restored by Robert Diemert.\n* 5357 – Owned by the Planes of Fame Air Museum in Chino, California. This aircraft, 61-120, is the only airworthy example powered with an original Sakae radial engine.\n* 5450 – On display at the National Naval Aviation Museum in Pensacola, Florida.\n* 23186 – On display at the San Diego Air and Space Museum in San Diego, California. This aircraft is on loan from the National Air and Space Museum. The museum previously had another Zero in its collection, msn 4323, but it was destroyed in a fire on 22 February 1978.\n* 51553 – On display at the National Museum of the United States Air Force in Dayton, Ohio. It was restored by Century Aviation.\n* Replica – Owned by Warren Pietsch at the Texas Flying Legends Museum in Houston, Texas. This aircraft, known as the \"Blayd\" Zero, is a reconstruction based on templating original Zero components recovered from the South Pacific. To be considered a \"restoration\" and not a reproduction, the builders used a small fraction of parts from the original Zero landing gear in the reconstruction.[http://www.pacificwrecks.com/restore/canada/blayd.html \"Blayd Corporation.\"] pacificwrecks.com. Retrieved: 29 January 2007.[http://www.j-aircraft.com/research/zero.htm \"Examination of Blayd Zero Artifacts.\"] j-aircraft.com. Retrieved: 29 January 2007. It was built as a A6M2 Model 21.[http://www.texasflyinglegends.org/last-samurai-zero \"Last Samurai A6M2 Model 21 Zero.\"]  Texas Flying Legends Museum. Retrieved: 8 December 2013.Pietsch, Warren. [https://www.youtube.com/watch?v\nXl3Vanoq_sU \"Museum Secrets.\"] Texas Flying Legends Museum. Retrieved: 30 November 2015.  This aircraft was damaged in a ground accident on March 15, 2016, when a Goodyear FG-1D Corsair taxiing behind it overran the tail of the Zero, with the Corsair's propeller shredding roughly the last third of the Zero's fuselage and its control surfaces.\n* Replica – Owned by the Southern California Wing of the Commemorative Air Force in Camarillo, California. This aircraft is an A6M3 that was recovered from Babo Airfield, Indonesia, in 1991. It was partially restored from several A6M3s in Russia, then brought to the United States for restoration. The aircraft was re-registered in 1998 and displayed at the Museum of Flying in Santa Monica, California. It uses a Pratt & Whitney R1830 engine.\n*Replica – Under rebuild by Legend Flyers in Everett, Washington. This aircraft uses a small amount of parts from 3148.\n\nSpecifications (A6M2 Type 0 Model 21)\n\nNotable appearances in media",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Mitsubishi A6M Zero" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=19623" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "The Mitsubishi A6M \"Zero\" is a long-range fighter aircraft manufactured by Mitsubishi Aircraft Company, a part of Mitsubishi Heavy Industries, and operated by the Imperial Japanese Navy from 1940 to 1945. The A6M was designated as the , or the Mitsubishi A6M Rei-sen. The A6M was usually referred to by its pilots as the \"Reisen\" (zero fighter), \"0\" being the last digit of the imperial year 2600 (1940) when it entered service with the Imperial Navy. The official Allied reporting name was \"Zeke\", although the use of the name \"Zero\" was later adopted by the Allies as well.\n\nThe Zero was considered the most capable carrier-based fighter in the world when it was introduced early in World War II, combining excellent maneuverability and very long range.Hawks, Chuck. [http://www.chuckhawks.com/best_fighter_planes.htm \"The Best Fighter Planes of World War II\"]. chuckhawks.com. Retrieved: 18 January 2007. The Imperial Japanese Navy Air Service (IJNAS) also frequently used it as a land-based fighter.\n\nIn early combat operations, the Zero gained a legendary reputation as a dogfighter,Young 2013, p. 36. achieving an outstanding kill ratio of 12 to 1,Thompson with Smith 2008, p. 231. but by mid-1942 a combination of new tactics and the introduction of better equipment enabled Allied pilots to engage the Zero on generally equal terms.Mersky, Peter B. (Cmdr. USNR). [http://www.ibiblio.org/hyperwar/USMC/USMC-C-Aces/index.html \"Time of the Aces: Marine Pilots in the Solomons, 1942–1944.\"] ibiblio.org. Retrieved: 18 January 2007. By 1943, the Zero became less effective against newer Allied fighters because of inherent design weaknesses and the failure to develop more powerful aircraft engines. The Allied fighters gained greater firepower, armor, and speed, and approached the Zero's maneuverability, and the Mitsubishi A6M was outdated by 1944. However, the Zero continued to serve in a front line role until the end of the war because design delays, and production difficulties, hampered the introduction of newer Japanese aircraft. The Zero was also adapted for use in kamikaze operations during the final year of the war in the Pacific.Willmott 1980, pp. 40–41. Japan produced more Zeros than any other model of combat aircraft during the course of the war.Angelucci and Matricardi 1978, p. 138.\n\nDesign and development\n\nThe Mitsubishi A5M fighter was just entering service in early 1937, when the Imperial Japanese Navy started looking for its eventual replacement. On October 5, 1937, they issued \"Planning Requirements for the Prototype 12-shi Carrier-based Fighter\", sending it to Nakajima and Mitsubishi. Both firms started preliminary design work while they awaited more definitive requirements to be handed over in a few months.\n\nBased on the experiences of the A5M in China, the IJN sent out updated requirements in October calling for a speed of 600 km/h and a climb to 3000 m in 3.5 minutes. With drop tanks, they wanted an endurance of two hours at normal power, or six to eight hours at economical cruising speed. Armament was to consist of two 20 mm cannons, two 7.7 mm (.303 in) machine guns and two 30 kg or 60 kg bombs. A complete radio set was to be mounted in all aircraft, along with a radio direction finder for long-range navigation. The maneuverability was to be at least equal to that of the A5M, while the wingspan had to be less than 12 m (39 ft) to allow for use on aircraft carriers. All this was to be achieved with available engines, a significant design limitation.\n\nNakajima's team considered the new requirements unachievable and pulled out of the competition in January. Mitsubishi's chief designer, Jiro Horikoshi, thought that the requirements could be met, but only if the aircraft were made as light as possible. Every possible weight-saving measure was incorporated into the design. Most of the aircraft was built of a new top-secret aluminium alloy developed by Sumitomo Metal Industries in 1936. Called \"extra super duralumin\" (ESD), it was lighter, stronger and more ductile than other alloys (e.g. 24S alloy) used at the time, but was prone to corrosive attack, which made it brittle.Yoshio, Baba.[https://www.jstage.jst.go.jp/article/jilm1951/39/5/39_5_378/_article/cited-by \"Extra super duralumin and successive aluminum alloys for aircraft.\"] Journal of Japan Institute of Light Metals (Sumitomo Light Metal Ind. Ltd., Japan), Volume 39, Issue 5, pp. 378–395. Retrieved: 22 November 2015. This detrimental effect was countered with an anti-corrosion coating applied after fabrication. No armour protection was provided for the pilot, engine or other critical points of the aircraft, and self-sealing fuel tanks, which were becoming common at the time, were not used. This made the Zero lighter, more maneuverable, and the longest-ranged single-engine fighter of World War II, which made it capable of searching out an enemy hundreds of kilometres away, bringing them to battle, then returning to its base or aircraft carrier.  However, that tradeoff in weight and construction also made it prone to catching fire and exploding when struck by enemy rounds.Tillman 1979,  pp. 5, 6, 96.\n\nWith its low-wing cantilever monoplane layout, retractable, wide-set conventional landing gear and enclosed cockpit, the Zero was one of the most modern carrier based aircraft in the world at the time of its introduction. It had a fairly high-lift, low-speed wing with very low wing loading. This, combined with its light weight, resulted in a very low stalling speed of well below 60 kn. This was the main reason for its phenomenal maneuverability, allowing it to out-turn any Allied fighter of the time. Early models were fitted with servo tabs on the ailerons after pilots complained that control forces became too heavy at speeds above 300 km/h.  They were discontinued on later models after it was found that the lightened control forces were causing pilots to overstress the wings during vigorous maneuvers.Yoshimura 1996, p. 108.\n\nIt has been claimed that the Zero's design showed a clear influence from British and American fighter aircraft and components exported to Japan in the 1930s, and in particular on the American side, the Vought V-143 fighter. Chance Vought had sold the prototype for this aircraft and its plans to Japan in 1937. Eugene Wilson, president of Vought, claimed that when shown a captured Zero in 1943, he found that \"There on the floor was the Vought V 142  or just the spitting image of it, Japanese-made\", while the \"power-plant installation was distinctly Chance Vought, the wheel stowage into the wing roots came from Northrop, and the Japanese designers had even copied the Navy inspection stamp from Pratt & Whitney type parts.\"Fernandez 1983, pp. 107–108. While the sale of the V-143 was fully legal,Angelucci and Bowers 1987, p. 436. Wilson later acknowledged the conflicts of interest that can arise whenever military technology is exported. Counterclaims maintain that there was no significant relationship between the V-143 (which was an unsuccessful design that had been rejected by the U.S. Army Air Corps and several export customers) and the Zero, with only a superficial similarity in layout.\n\nThe Zero resembled the 1937 British Gloster F.5/34. Performance of the Gloster F.5/34 was comparable to that of early model Zeros, with its dimensions and appearance remarkably close to the Zero.http://www.faqs.org/docs/air/avzero.html#m6  Gloster had a relationship with the Japanese between the wars, with Nakajima building the carrier-based plane, the Gloster Gambet, under license.James 1987, p. 159 However allegations about the Zero being a copy have been discredited by some authors.Air International October 1973, pp. 199–200.\n\nName\n\nThe A6M is usually known as the \"Zero\" from its Japanese Navy type designation, Type 0 carrier fighter (Rei shiki Kanjō sentōki, 零式艦上戦闘機), taken from the last digit of the Imperial year 2600 (1940) when it entered service. In Japan, it was unofficially referred to as both Rei-sen and Zero-sen; Japanese pilots most commonly called it Zero-sen, where sen is the first syllable of sentōki, Japanese for \"fighter plane\".Parshall and Tully 2007, p. 79.\n\nIn the official designation \"A6M\", the \"A\" signified a carrier-based fighter, \"6\" meant that it was the sixth such model built for the Imperial Navy, and \"M\" indicated Mitsubishi as the manufacturer.\n\nThe official Allied code name was \"Zeke\", in keeping with the practice of giving male names to Japanese fighters, female names to bombers, bird names to gliders, and tree names to trainers. \"Zeke\" was part of the first batch of \"hillbilly\" code names assigned by Captain Frank T. McCoy of Nashville, Tennessee (assigned to the Allied Technical Air Intelligence Unit (ATAIU) at Eagle Farm Airport in Australia), who wanted quick, distinctive, easy-to-remember names.  The Allied code for Japanese aircraft was introduced in 1942, and McCoy chose \"Zeke\" for the \"Zero\".  Later, two variants of the fighter received their own code names. The Nakajima A6M2-N floatplane version of the Zero was called \"Rufe\", and the A6M3-32 variant was initially called \"Hap\". General \"Hap\" Arnold, commander of the USAAF, objected to that name, however, so it was changed to \"Hamp\". Captured examples were examined in New Guinea and the Allies realized that it was a variant of the Zero, so it was finally renamed \"Zeke 32\".\n\nOperational history\n\nThe first Zeros (pre-series of 15 A6M2) went into operation with the 12th Rengo Kōkūtai in July 1940.Matricardi 2006, p. 88. On 13 September 1940, the Zeros scored their first air-to-air victories when 13 A6M2s led by Lieutenant Saburo Shindo attacked 27 Soviet-built Polikarpov I-15s and I-16s of the Chinese Nationalist Air Force, shooting down all the fighters without loss to themselves. By the time they were redeployed a year later, the Zeros had shot down 99 Chinese aircraftGlancey 2006, p. 170. (266 according to other sources).\n\nAt the time of the attack on Pearl Harbor, 521 Zeros were active in the Pacific, 328 in first-line units.Francillon 1979, p. 365. The carrier-borne Model 21 was the type encountered by the Americans. Its tremendous range of over  allowed it to range farther from its carrier than expected, appearing over distant battlefronts and giving Allied commanders the impression that there were several times as many Zeros as actually existed.Gunston 1980, p. 162.\n\nThe Zero quickly gained a fearsome reputation. Thanks to a combination of unsurpassed maneuverability — even when compared to other contemporary Axis fighters — and excellent firepower, it easily disposed the motley collection of Allied aircraft sent against it in the Pacific in 1941.Young 2013, p. 5.Nijboer 2009, p. 4. It proved a difficult opponent even for the Supermarine Spitfire. \"The RAF pilots were trained in methods that were excellent against German and Italian equipment but suicide against the acrobatic Japs\", as Lt.Gen. Claire Lee Chennault had to notice.Smith 2015, pp. 146–149. Although not as fast as the British fighter, the Mitsubishi fighter could out-turn the Spitfire with ease, sustain a climb at a very steep angle, and stay in the air for three times as long.Spick 1997, p. 165.\n\nAllied pilots soon developed tactics to cope with the Zero. Due to its extreme agility, engaging a Zero in a traditional, turning dogfight was likely to be fatal.Spick 1983, p. 118. It was better to swoop down from above in a high-speed pass, fire a quick burst, then climb quickly back up to altitude. (A short burst of fire from heavy machine guns or cannon was often enough to bring down the fragile Zero.) Such \"boom-and-zoom\" tactics were used successfully in the China Burma India Theater (CBI) by the \"Flying Tigers\" of the American Volunteer Group (AVG) against similarly maneuverable Japanese Army aircraft such as the Nakajima Ki-27 Nate and Nakajima Ki-43 Oscar. AVG pilots were trained by their commander Claire Chennault to exploit the advantages of their P-40s, which were very sturdy, heavily armed, generally faster in a dive and level flight at low altitude, with a good rate of roll.Rossi, J. R. [http://www.flyingtigersavg.22web.net/tiger2.htm \"Chuck Older's Tale: Hammerhead Stalls and Snap Rolls, Written in the mid-1980s.\"] AFG: American Volunteer Group, The Flying Tigers, 1998. Retrieved: 5 July 2011.\n\nAnother important maneuver was Lieutenant Commander John S. \"Jimmy\" Thach's \"Thach Weave\", in which two fighters would fly about 60 m apart. If a Zero latched onto the tail of one of the fighters, the two aircraft would turn toward each other. If the Zero followed his original target through the turn, he would come into a position to be fired on by the target's wingman. This tactic was first used to good effect during the Battle of Midway and later over the Solomon Islands.\n\nMany highly experienced Japanese aviators were lost in combat, resulting in a progressive decline in quality, which became a significant factor in Allied successes.  Unexpected heavy losses of pilots at the Battles of the Coral Sea and Midway dealt the Japanese carrier air force a blow from which it never fully recovered.Holmes 2011, p. 314.Thruelsen 1976, pp. 173, 174.\n\nThroughout the Battle of Midway Allied pilots expressed a high level of dissatisfaction with the Grumman F4F Wildcat. The Commanding Officer of  noted:  They were astounded by the Zero's superiority:Young 2013, pp. 6, 51, 82. \n\nIn contrast, Allied fighters were designed with ruggedness and pilot protection in mind. The Japanese ace Saburō Sakai described how the toughness of early Grumman aircraft was a factor in preventing the Zero from attaining total domination: \n\nWhen the powerfully armed Lockheed P-38 Lightning, armed with four \"light barrel\" AN/M2 .50 cal. Browning machine guns and one 20 mm autocannon, and the Grumman F6F Hellcat and Vought F4U Corsair, each with six AN/M2 heavy calibre Browning guns, appeared in the Pacific theater, the A6M, with its low-powered engine and lighter armament, was hard-pressed to remain competitive. In combat with an F6F or F4U, the only positive thing that could be said of the Zero at this stage of the war was that, in the hands of a skillful pilot, it could maneuver as well as most of its opponents. Nonetheless, in competent hands, the Zero could still be deadly.\n\nDue to shortages of high-powered aviation engines and problems with planned successor models, the Zero remained in production until 1945, with over 11,000 of all variants produced.\n\nAllied analysis\n\nAmerican opinions\n\nThe American military discovered many of the A6M's unique attributes when they recovered a largely intact specimen of an A6M2, the Akutan Zero, on Akutan Island in the Aleutians. During an air raid over Dutch Harbor on June 4, 1942, one A6M fighter was hit by ground-based anti-aircraft fire. Losing oil, Flight Petty Officer Tadayoshi Koga attempted an emergency landing on Akutan Island about 20 miles northeast of Dutch Harbor, but his Zero flipped over on soft ground in a sudden crash-landing.  Koga died instantly of head injuries (his neck was broken by the tremendous impact), but the relatively-undamaged fighter was found over a month later by an American salvage team and was shipped to Naval Air Station North Island, where testing flights of the repaired A6M revealed both strengths and deficiencies in design and performance.Wilcox 1942, p. 86.Jablonski 1979 \n\nThe experts who evaluated the captured Zero found that the plane weighed about  fully loaded, some  lighter than the Grumman F4F Wildcat, the standard United States Navy fighter of the time. The A6M's airframe was \"built like a fine watch\"; the Zero was constructed with flush rivets, and even the guns were flush with the wings. The instrument panel was a \"marvel of simplicity ... with no superfluities to distract [the pilot].\" What most impressed the experts was that the Zero's fuselage and wings were constructed in one piece, unlike the American method that built them separately and joined the two parts together. The Japanese method was much slower, but resulted in a very strong structure and improved close maneuverability.\n\nAmerican test pilots found that the Zero's controls were \"very light\" at 320 km/h, but stiffened at faster speeds (above 348 km/h, or 216 mph) to safeguard against wing failure.Green and Swanborough 2001  The Zero could not keep up with Allied aircraft in high-speed maneuvers, and its low \"never exceed speed\" (VNE) made it vulnerable in a dive. While stable on the ground despite its light weight, the aircraft was designed purely for the attack role, emphasizing long range, maneuverability, and firepower at the expense of protection of its pilot. Most lacked self-sealing tanks and armor plating.\n\nBritish opinions\n\nCaptain Eric Brown, the Chief Naval Test Pilot of the Royal Navy, recalled being impressed by the Zero during tests of captured aircraft. \"I don't think I have ever flown a fighter that could match the rate of turn of the Zero. The Zero had ruled the roost totally and was the finest fighter in the world until mid-1943.\"\n\nVariants\n\nA6M1, Type 0 Prototypes\n\nThe first two A6M1 prototypes were completed in March 1939, powered by the 580 kW (780 hp) Mitsubishi Zuisei 13 engine with a two-blade propeller. It first flew on 1 April, and passed testing within a remarkably short period. By September, it had already been accepted for Navy testing as the A6M1 Type 0 Carrier Fighter, with the only notable change being a switch to a three-bladed propeller to cure a vibration problem.\n\nA6M2a Type 0 Model 11\n\nWhile the navy was testing the first two prototypes, they suggested that the third be fitted with the 700 kW Nakajima Sakae 12 engine instead. Mitsubishi had its own engine of this class in the form of the Kinsei, so they were somewhat reluctant to use the Sakae. Nevertheless, when the first A6M2 was completed in January 1940, the Sakae's extra power pushed the performance of the Zero well past the original specifications.\n\nThe new version was so promising that the Navy had 15 built and shipped to China before they had completed testing. They arrived in Manchuria in July 1940, and first saw combat over Chungking in August. There they proved to be completely untouchable by the Polikarpov I-16s and I-153s that had been such a problem for the A5Ms when in service. In one encounter, 13 Zeros shot down 27 I-15s and I-16s in under three minutes without loss. After hearing of these reports, the navy immediately ordered the A6M2 into production as the Type 0 Carrier Fighter, Model 11.\nReports of the Zero's performance filtered back to the US slowly. There they were dismissed by most military officials, who thought it was impossible for the Japanese to build such an aircraft.\n\nA6M2b Type 0 Model 21\n\n \nAfter the delivery of the 65th aircraft, a further change was worked into the production lines, which introduced folding wingtips to allow them to fit on aircraft carriers. The resulting Model 21 would become one of the most produced versions early in the war. A feature was the improved range with 520 l wing tank and 320 l drop tank. When the lines switched to updated models, 740 Model 21s had been completed by Mitsubishi, and another 800 by Nakajima. Two other versions of the Model 21 were built in small numbers, the Nakajima-built A6M2-N \"Rufe\" floatplane (based on the Model 11 with a slightly modified tail), and the A6M2-K two-seat trainer of which a total of 508 were built by Hitachi and the Sasebo Naval Air Arsenal.Francillon 1979, p. 399.\n\nA6M3 Type 0 Model 32\n\nIn 1941, Nakajima introduced the Sakae 21 engine, which used a two-speed supercharger for better altitude performance, and increased power to 840 kW. A prototype Zero with the new engine was first flown on July 15, 1941.Nohara 1993, p. 76.\n\nThe new Sakae was slightly heavier and somewhat longer due to the larger supercharger, which moved the center of gravity too far forward on the existing airframe. To correct for this, the engine mountings were cut back by 185 mm to move the engine toward the cockpit. This had the side effect of reducing the size of the main fuselage fuel tank (located between the engine and the cockpit) from 518 l to 470 l. The cowling was redesigned to enlarge the cowl flaps, revise the oil cooler air intake, and move the carburetor air intake to the upper half of the cowling.Nohara 1993, p. 51.Reisen no Tsuioku (Model Art 883), 2013, p. 75.\n\nThe wings were redesigned to reduce span, eliminate the folding tips, and square off the wingtips. The inboard edge of the aileron was moved outboard by one rib, and the wing fuel tanks were enlarged accordingly to 420 l. The two 20 mm wing cannon were upgraded from the Type 99 Mark l to the Type 99 Mark II, which required a bulge in the sheet metal of the wing below each cannon. The wings also included larger ammunition boxes and thus allowing 100 rounds per cannon.\n\nThe Sakae 21 engine and other changes increased maximum speed by only 11 km/h compared to the Model 21, but sacrificed nearly 1000 km of range.  Nevertheless, the navy accepted the type and it entered production in April 1942.\n\nThe shorter wing span led to better roll, and the reduced drag allowed the diving speed to be increased to 670 km/h. On the downside, turning and range, which were the strengths of the Model 21, suffered due to smaller ailerons, decreased lift and greater fuel consumption. The shorter range proved a significant limitation during the Solomons Campaign, during which Zeros based at Rabaul had to travel nearly to their maximum range to reach Guadalcanal and return.Mechanic of World Aircraft Vol. 5, Koujinsha, 1994, pp. 220–221. Consequently, the Model 32 was unsuited to that campaignNohara 1993, pp. 76–77. and was used mainly for shorter range offensive missions and interception.\n\nThe appearance of the redesigned A6M3-32 prompted the US to assign the Model 32 a new code name, \"Hap\". This name was short-lived, as a protest from USAAF Commanding General Henry \"Hap\" Arnold forced a change to \"Hamp\". Soon after, it was realized that it was simply a new model of the \"Zeke\" and was termed \"Zeke 32\".\n\nThis variant was flown by only a small number of units, and only 343 were built.\n\nA6M3 Type 0 Model 22\n\nIn order to correct the deficiencies of the Model 32, a new version with folding wingtips and redesigned wing was introduced. The fuel tanks were moved to the outer wings, fuel lines for a 330 l drop tank were installed under each wing and the internal fuel capacity was increased to 570 l. More important, it regained back its capabilities for long operating ranges, similar to the previous A6M2 Model 21, which was vastly shortened by the Model 32.\n\nHowever, before the new design type was accepted formally by the Navy, the A6M3 Model 22 already stood ready for service in December 1942. Approximately 560 aircraft of the new type had been produced in the meantime by Mitsubishi Jukogyo K.K.Nohara 1993, p. 78.\n\nAccording to a theory, the very late production Model 22 might have had wings similar to the shortened, rounded-tip wing of the Model 52.Mikesh 1994. p. 90. One plane of such arrangement was photographed at Lakunai Airfield (\"Rabaul East\") in the second half of 1943, and has been published widely in a number of Japanese books. While the engine cowling is the same of previous Model 32 and 22, the theory proposes that the plane is an early production Model 52.Famous Airplanes of the World 9, 1993 p. 33. \n\nThe Model 32, 22, 22 kou, 52, 52 kou and 52 otsu were all powered by the Nakajima 栄 (Sakae) 21型 engine. That engine kept its designation in spite of changes in the exhaust system for the Model 52.\n\nA6M4 Type 0 Model 41/42\n\nMitsubishi is unable to state with certainty that it ever used the designation \"A6M4\" or model numbers for it.  However, \"A6M4\" does appear in a translation of a captured Japanese memo from a Naval Air Technical Arsenal, titled Quarterly Report on Research Experiments, dated 1 October 1942. It mentions a \"cross-section of the A6M4 intercooler\" then being designed.  Some researchers believe \"A6M4\" was applied to one or two prototype planes fitted with an experimental turbo-supercharged Sakae engine designed for high altitude.Mikesh 1981, p. 32. Mitsubishi's involvement in the project was probably quite limited or nil; the unmodified Sakae engine was made by Nakajima.  The design and testing of the turbo-supercharger was the responsibility of the First Naval Air [Technical] Arsenal (, ') at Yokosuka.\"Quarterly Report on Research Experiments\", Vol. 1, 30 March 1945. CINCPAC-CINCPOA Bulletin, Special Translation No. 52, No. 67–45, p. 14 D. At least one photo of a prototype plane exists.  It shows a turbo unit mounted in the forward left fuselage.\n\nLack of suitable alloys for use in the manufacture of a turbo-supercharger and its related ducting caused numerous ruptures, resulting in fires and poor performance. Consequently, further development of a turbo-supercharged A6M was cancelled.  The lack of acceptance by the navy suggests that the navy did not bestow model number 41 or 42 formally, although it appears that the arsenal did use the designation \"A6M4\". The prototype engines nevertheless provided useful experience for future engine designs.[http://www.j-aircraft.com/a6mresearch/a6m4.htm \"A6M4\".] J-Aircraft.com. Retrieved: 13 October 2010.\n\nA6M5 Type 0 Model 52\n\nSometimes considered as the most effective variant,Mikesh 1994, p. 53. the Model 52 was developed to again shorten the wings to increase speed and dispense with the folding wing mechanism. In addition, ailerons, aileron trim tab and flaps were revised.Nohara 1993, p. 80.Sekai no Kessaku Ki Vol. 9, pp. 57–59. Produced first by Mitsubishi, most Model 52s were made by Nakajima.  The prototype was made in June 1943 by modifying an A6M3 and was first flown in August 1943.Sekai no Kessaku Ki Vol. 9, Bunrindou, 1993, p. 21. The first Model 52 is said in the handling manualSummary of Provisional Handling Instructions, February 1944, English translation. to have production number 3904,Mikesh 1994, p. 115. which apparently refers to the prototype.\n\nResearch by Mr. Bunzo Komine published by Mr. Kenji Miyazaki states that aircraft 3904 through 4103 had the same exhaust system and cowl flaps as on the Model 22.\"Reisen Mushimegane\", Fumetsu no Reisen, Maru, 2007. This is partially corroborated by two wrecks researched by Mr. Stan Gajda and Mr. L. G. Halls, production number 4007 and 4043, respectively.Gajda, Stan. [http://www.j-aircraft.org/smf/index.php?topic9730.0 \"The transitional Zero: New evidence that supports the theory.\"] j-aircraft, 28 July 2010. Retrieved: 30 November 2015.Halls, L.G. [http://www.j-aircraft.org/smf/index.php?topic\n9974.0 \"\t The \"Hybrid\" Zero: More Evidence.\"] j-aircraft, 9 September 2010. Retrieved: 30 November 2015.Lansdale, Jim. [http://www.j-aircraft.org/smf/index.php?topic9048.0 \"Transitional model of the Mitsubishi ReiSen 52 (A6M5): Part II.\"] j-aircraft, 21 March 2010. Retrieved: 30 November 2015. (The upper cowling was slightly redesigned from that of the Model 22.)\nAn early production A6M5 Zero with non separated exhaust, with an A6M3 Model 22 in the background.\nA new exhaust system provided an increment of thrust by aiming the stacks aft and distributing them around the forward fuselage.  The new exhaust system required \"notched\" cowl flaps and heat shields just aft of the stacks. (Note, however, that the handling manual translation states that the new style of exhaust commenced with number 3904.  Whether this is correct, indicates retrofitting intentions, refers to the prototype but not to all subsequent planes, or is in error is not clear.)  From production number 4274, the wing fuel tanks received carbon dioxide fire extinguishers.Sekai no Kessaku Ki, Vol. 9. pp. 57–59.A6M5 Summary of Provisional Handling Instructions, February 1944 (translated) at 4-4.  From number 4354, the radio became the Model 3, aerial Mark 1, and at that point it is said the antenna mast was shortened slightly.A6M5 Summary of Provisional Handling Instructions, February 1944 (translated). p. 4-4. Through production number 4550, the lowest exhaust stacks were approximately the same length as those immediately above them.  This caused hot exhaust to burn the forward edge of the landing gear doors and heat the tires.  Therefore, from number 4551 Mitsubishi began to install shorter bottom stacks.Nohara 1993, p. 79.  Nakajima manufactured the Model 52 at its Koizumi plant in Gunma Prefecture.Sekai no Kessaku Ki, Vol. 9 Bunrindou 1993, p. 23. The A6M5 had a maximum speed of 565 km/h) at  and reached that altitude in 7:01 minutes.Sekai no Kessaku Ki, Vol. 9, Bunrindou, 1993, p. 24.\n\nSubsequent variants included:\n* A6M5a, Model 52甲 (Kō, a) – Starting at Mitsubishi number 4651, an armament change substituted the belt-fed Type 99-2 Mark 4 cannon, with 125 rounds per gun, in place of the drum-fed Type 99-2 Mark 3 cannon that carried 100 rounds per gun. Hence, the bulge in the underside of the wing for each cannon's ammunition drum was deleted and the ejection port for spent cartridge cases was moved.  Thicker wing skinning was installed to permit higher diving speeds.Sekai no Kessaku Ki, Vol. 9, Bunrindou, 1993, p. 22.\n* A6M5b, Model 52乙 (Otsu, b) – Armament change: The 7.7 mm (.303 in) Type 97 gun (750 m/s muzzle velocity and 600 m/1,970 ft range) in the right forward fuselage was replaced by a 13.2 mm Type 3 Browning-derived gun (790 m/s muzzle velocity and 900 m/2,950 ft range, with a rate of fire of 800 rounds per minute) with 240 rounds. The larger weapon required an enlarged opening, creating a distinctive asymmetric appearance to the top of the cowling, and a revised gas outlet near the windscreen. In addition, each wing cannon received a fairing at the wing leading edge. A plate of armored glass 45 mm thick was fitted to the windscreen. A larger propeller spinner was fitted, suggesting a change to the propeller.Sekai no Kessaku Ki, Vol. 9, Bunrindou. p. 77.  The type of ventral drop tank was changed, it now had fins and was suspended on a slanted pipe.  The first of this variant was completed in April 1944 and it was produced until October 1944.Nohara 1993, p. 82.\n* A6M5c, Model 52丙 (Hei, c) – Armament change: One 13.2 mm (.51 in) Type 3 machine gun was added in each wing outboard of the cannon, and the 7.7 mm gun on the left side of the cowl was deleted.  Four racks for rockets or small bombs were installed outboard of the 13 mm gun in each wing.  Engine change: Some sources state that the hei had a Sakae 31 engineMechanic of World Aircraft, Vol.5, Koujinsha, p. 220-221.  In addition, a 55 mm thick piece of armored glass was installed at the headrest and a plate of armor was installed behind the seat.  The mounting of the central 300L drop tank changed to a four-post design.Sekai no Kessaku Ki, Vol. 9, Bunrindou, pp. 46–49.  Wing skin was thickened further. The first of this variant was completed in September 1944.  Because of the gain in weight, this variant was used mainly for intercepting B-29s and special attack.Sekai no Kessaku Ki, Vol. 9 Bunrindou 1993 at 22.\n* A6M5-S (A6M5 Yakan Sentōki) – Armament change: To intercept B-29s and other night-flying aircraft, an air arsenal converted some Model 52s to night fighters.Sekai no Kessaku Ki, Vol. 9, Bunrindou, 1993, p. 23.  They were armed with one 20 mm Type 99 cannon behind the pilot, aimed upward, similar in intent to the Luftwaffe's Schräge Musik installation.Graham, Rob. [http://www.j-aircraft.com/a6mresearch/zeronf.htm \"FAQ: Zero Night Fighter.\"] j-aircraft.com. Retrieved: 30 November 2015.  However, lack of radar prevented them from being very effective.\n\nSome Model 21 and 52 aircraft were converted to \"bakusen\" (fighter-bombers) by mounting a bomb rack and 250 kg bomb in place of the centerline drop tank.\n\nPerhaps seven Model 52 planes were ostensibly converted into A6M5-K two-seat trainers.Francillon 1979, p. 399. Mass production was contemplated by Hitachi, but not undertaken.Nohara 1993, p. 84.\n\nA6M6c Type 0 Model 53c\n\nThis was similar to the A6M5c, but with self-sealing wing tanks and a Nakajima Sakae 31a engine featuring water-methanol engine boost.\n\nA6M7 Type 0 Model 62\n\nSimilar to the A6M6 but intended for attack or Kamikaze role.\n\nA6M8 Type 0 Model 64\n\nSimilar to the A6M6 but with the Sakae (now out of production) replaced by the Mitsubishi Kinsei 62 engine with , 60% more powerful than the engine of the A6M2. This resulted in an extensively modified cowling and nose for the aircraft. The carburetor intake was much larger, a long duct like that on the Nakajima B6N Tenzan was added, and a large spinner—like that on the Yokosuka D4Y Suisei with the Kinsei 62—was mounted. The larger cowling meant deletion of the fuselage-mounted machine gun, but armament was otherwise unchanged from the Model 52 Hei (2 x 20 mm cannon; 2 x 13 mm/.51 in MG). In addition, the Model 64 was modified to carry two 150 l  drop tanks on either wing in order to permit the mounting of a 250 kg bomb on the underside of the fuselage. Two prototypes were completed in April 1945 but the chaotic situation of Japanese industry and the end of the war obstructed the start of the ambitious program of production for 6,300 machines, none being completed.Francillon 1970, pp. 374–375.\n\nProduction\n\nNot included:\n* A second A6M1 was completed on 17 March 1939,FAOTW, 1996, p. 137. but was written off without explanation after completing the company's flight test program in July 1940.Francillon 1979, pp. 364–365.\n\nTrainer\n\nTotal production\n\nOperators\n\n;\n* Imperial Japanese Navy Air Service\n;\n* Royal Thai Air Force\n* Royal Thai Navy\n\nPost-war\n\n;\n* Indonesian Air Force\n;\n* Republic of China Air Force\n\nSurviving aircraft\n\nLike many surviving World War II Japanese aircraft, most surviving Zeros are made up of parts from multiple airframes. As a result, some are referred to by conflicting manufacturer serial numbers. In other cases, such as those recovered after decades in a wrecked condition, they have been reconstructed to the point that the majority of their structure is made up of modern parts. All of this means the identities of survivors can be difficult to confirm.\n\nMost flying Zeros have had their engines replaced with similar American units. Only one, the Planes of Fame Museum's A6M5, has the original Sakae engine.Seaman, Richard. [http://www.richard-seaman.com/Aircraft/AirShows/Chino2004/Sampler/index.html \"Aircraft air shows.\"] richard-seaman.com. Retrieved: 13 October 2010.\n\nThe rarity of flyable Zeros accounts for the use of single-seat North American T-6 Texans, with heavily modified fuselages and painted in Japanese markings, as substitutes for Zeros in the films Tora! Tora! Tora!, The Final Countdown, and many other television and film depictions of the aircraft, such as Baa Baa Black Sheep (renamed Black Sheep Squadron). One Model 52 was used during the production of Pearl Harbor.\n\nAustralia \n\n* 840 – On display at the Australian Aviation Heritage Centre in Winnellie, Northern Territory. Wreckage of the forward fuselage, inboard wings, engine, and propeller.\n* 5784 – On display at the Australian War Memorial in Canberra, Australian Capital Territory. A restored A6M2-21 \"V-173\" was retrieved as a wreck after the war and later found to have been flown by Saburō Sakai at Lae.\n\nChina \n\n* Unknown serial number – Beijing Military MuseumSmith 2015, p. 141.\n\nGermany \n\n* Replica – On display at the Technik Museum Speyer in Speyer, Rhineland-Palatinate. Replica of the fuselage section on display at IWM London.\n\nIndonesia\n\n* Unknown serial number – The Museum Dirgantara Mandala in Yogyakarta has an A6M in its collection.\n\nJapan \n\n* 1493 – On display at the Kawaguchiko Motor Museum in Fujikawaguchiko, Yamanashi.\n* 4168/4240/4241 – On display at the Yūshūkan in Chiyoda, Tokyo.\n* 4685 – On display at Hamamatsu Air Base in Hamamatsu, Shizuoka.\n* 4708 – On display at the Mitsubishi Heavy Industries Museum in Komaki, Aichi.\n* 31870 – A two-seater on display at the National Museum of Nature and Science in Taito, Tokyo.\n* 62343 – On display at the Chiran Peace Museum for Kamikaze Pilots in Chiran, Kagoshima.\n* 82729 – On display at the Yamato Museum in Kure, Hiroshima.\n* 91518 – On display at the Kawaguchiko Motor Museum in Fujikawaguchiko, Yamanashi.\n* 92717 – On display at the Kawaguchiko Motor Museum in Fujikawaguchiko, Yamanashi.\n* Replica – On display at MCAS Iwakuni in Iwakuni, Yamaguchi.\n* Replica – Owned by businessman Masahide Ishizuka in Kanoya, Kagoshima. Airworthy, with a Pratt & Whitney R-1830 engine.\n\nNew Zealand \n\n* 3835/3844 – On display at the Auckland War Memorial Museum in Auckland, Auckland Region.\n\nUnited Kingdom \n\n* 196 – On display at the Imperial War Museum London in London, Greater London. Forward fuselage displayed.\n* 3685 – On display at the Imperial War Museum Duxford in Duxford, Cambridgeshire. Fuselage displayed in unrestored condition.\n\nUnited States \n\n* 1303 – In storage at the Flying Heritage Collection in Everett, Washington.\n* 2266 – A small amount of wreckage from the Zero that crashed in the Niihau Incident is on display at the Pacific Aviation Museum in Honolulu, Hawaii.\n* 3618 – In storage at Fantasy of Flight in Polk City, Florida.\n* 3852 – Owned by the Flying Heritage Collection in Everett, Washington. This aircraft was recovered from Babo Airfield, Indonesia, and restored — first in Russia, then in California, and finally in Washington state — before being delivered to the Flying Heritage Collection. It has a P&W engine installed.\n* 4043 – In storage at Fantasy of Flight in Polk City, Florida. Along with several other Zeros, this aircraft was recovered by the Australian War Memorial Museum in the early 1970s from Rabaul in the South Pacific. The markings suggest that it was in service after June 1943 and further investigation suggests that it has cockpit features associated with the Nakajima-built Model 52b. If this is correct, it is most likely one of the 123 aircraft lost by the Japanese during the assault of Rabaul. The aircraft was shipped in pieces to the attraction and it was eventually made up for display as a crashed aircraft. Much of the aircraft is usable for patterns and some of its parts can be restored to one day make this a basis for a flyable aircraft.\n* 4340 – On display at the National Air and Space Museum in Washington, D.C.\n* 4400 – In storage at the Flying Heritage Collection in Everett, Washington.\n* 5356/5451 – On display at the Pacific Aviation Museum in Honolulu, Hawaii. This aircraft was formerly flown by the Commemorative Air Force after being restored by Robert Diemert.\n* 5357 – Owned by the Planes of Fame Air Museum in Chino, California. This aircraft, 61-120, is the only airworthy example powered with an original Sakae radial engine.\n* 5450 – On display at the National Naval Aviation Museum in Pensacola, Florida.\n* 23186 – On display at the San Diego Air and Space Museum in San Diego, California. This aircraft is on loan from the National Air and Space Museum. The museum previously had another Zero in its collection, msn 4323, but it was destroyed in a fire on 22 February 1978.\n* 51553 – On display at the National Museum of the United States Air Force in Dayton, Ohio. It was restored by Century Aviation.\n* Replica – Owned by Warren Pietsch at the Texas Flying Legends Museum in Houston, Texas. This aircraft, known as the \"Blayd\" Zero, is a reconstruction based on templating original Zero components recovered from the South Pacific. To be considered a \"restoration\" and not a reproduction, the builders used a small fraction of parts from the original Zero landing gear in the reconstruction.[http://www.pacificwrecks.com/restore/canada/blayd.html \"Blayd Corporation.\"] pacificwrecks.com. Retrieved: 29 January 2007.[http://www.j-aircraft.com/research/zero.htm \"Examination of Blayd Zero Artifacts.\"] j-aircraft.com. Retrieved: 29 January 2007. It was built as a A6M2 Model 21.[http://www.texasflyinglegends.org/last-samurai-zero \"Last Samurai A6M2 Model 21 Zero.\"]  Texas Flying Legends Museum. Retrieved: 8 December 2013.Pietsch, Warren. [https://www.youtube.com/watch?v\nXl3Vanoq_sU \"Museum Secrets.\"] Texas Flying Legends Museum. Retrieved: 30 November 2015.  This aircraft was damaged in a ground accident on March 15, 2016, when a Goodyear FG-1D Corsair taxiing behind it overran the tail of the Zero, with the Corsair's propeller shredding roughly the last third of the Zero's fuselage and its control surfaces.\n* Replica – Owned by the Southern California Wing of the Commemorative Air Force in Camarillo, California. This aircraft is an A6M3 that was recovered from Babo Airfield, Indonesia, in 1991. It was partially restored from several A6M3s in Russia, then brought to the United States for restoration. The aircraft was re-registered in 1998 and displayed at the Museum of Flying in Santa Monica, California. It uses a Pratt & Whitney R1830 engine.\n*Replica – Under rebuild by Legend Flyers in Everett, Washington. This aircraft uses a small amount of parts from 3148.\n\nSpecifications (A6M2 Type 0 Model 21)\n\nNotable appearances in media. Mitsubishi A6M Zero. http://en.wikipedia.org/?curid=19623."
  }
}
