{
  "datasourceIdentifier" : "awesome wiki export",
  "backlink" : "http://en.wikipedia.org/?curid=10616",
  "eid" : "f676a5e0-52b1-11e8-ad1f-273b2f3b71fa",
  "loadTime" : 1525778493246,
  "textBody" : "In law, frivolous litigation is the practice of starting or carrying on lawsuits that, due to their lack of legal merit, have little to no chance of being won. The term does not include cases that may be lost due to other matters not related to legal merit. While colloquially, a person may term a lawsuit to be frivolous if he or she personally finds a claim to be absurd, in legal usage \"frivolous litigation\" consists of a claim or defense that is presented where the party (or the party's legal counsel) had reason to know that the claim or defense was manifestly insufficient or futile. The fact that a claim is lost does not imply that it was frivolous.\n\nFrivolous litigation may be based on absurd legal theories, may involve a superabundance or repetition of motions or additional suits, may be uncivil or harassing to the court, or may claim extreme remedies. A claim or defense may be frivolous because it had no underlying justification in fact, or because it was not presented with an argument for a reasonable extension or reinterpretation of the law.  A claim may be deemed frivolous because existing laws unequivocally prohibit such a claim, such as a so-called Good Samaritan law.\n\nIn the United States, Rule 11 of the Federal Rules of Civil Procedure and similar state rules require that an attorney perform a due diligence investigation concerning the factual basis for any claim or defense. Jurisdictions differ on whether a claim or defense can be frivolous if the attorney acted in good faith. Because such a defense or claim wastes the court's and the other parties' time, resources and legal fees, sanctions may be imposed by a court upon the party or the lawyer who presents the frivolous defense or claim. The law firm may also be sanctioned, or even held in contempt.\n\nFederal statutes and rules of court penalizing frivolous litigation\n\nIn the U.S. Tax Court, frivolous arguments may result in a penalty of up to $25,000 under . Similarly, section 7482 of the Internal Revenue Code provides that the U.S. Supreme Court and the U.S. Courts of Appeals may impose penalties in which the taxpayer's appeal of a U.S. Tax Court decision was \"maintained primarily for delay\" or where \"the taxpayer's position in the appeal is frivolous or groundless.\"See paragraph (4) of subsection (c) of . A common example, as shown below, is an argument based on tax protestor claims.\n\nIn a noncriminal case in a U.S. District Court, a litigant (or a litigant's attorney) who presents any pleading, written motion or other paper to the court is required, under Rule 11 of the Federal Rules of Civil Procedure, to certify that, to the best of the presenter's knowledge and belief, the legal contentions \"are warranted by existing law or by a nonfrivolous argument for the extension, modification, or reversal of existing law or the establishment of new law\".Rule 11(b)(2), Federal Rules of Civil Procedure. Monetary civil penalties for violation of this rule may in some cases be imposed on the litigant or the attorney under Rule 11.Rule 11(c), Federal Rules of Civil Procedure.\n\nIn one case, the Seventh Circuit Court issued an order giving such an attorney \"14 days to show cause why he should not be fined $10,000 for his frivolous arguments\".United States v. Patridge, 507 F.3d 1092, 2007-2 U.S. Tax Cas. (CCH) paragr. 50,806 (7th Cir. 2007), cert. denied, 552 U.S. 1280, 128 S.Ct. 1721 (2008). A similar rule penalizing frivolous litigation applies in U.S. Bankruptcy Court under Rule 9011.Rule 9011(b)(2) and Rule 9011(c), Federal Rules of Bankruptcy Procedure.\n\nThe U.S. Congress has enacted section 1912 of Title 28 of the U.S.C. providing that in the U.S. Supreme Court and in the U.S. Courts of Appeals where litigation by the losing party has caused damage to the prevailing party, the court may impose a requirement that the losing party pay the prevailing party for those damages.See .\n\nLitigants who represent themselves (in forma pauperis and pro se) sometimes make frivolous arguments due to their limited knowledge of the law and procedure. The particular tendency of prisoners to bring baseless lawsuits led to passage of the Prison Litigation Reform Act of 1995, which limits the ability of prisoners to bring actions without payment. \n\nCourt treatment of frivolous arguments\n\nAn example of a Court's treatment of frivolous arguments is found in the case of Crain v. Commissioner, [http://www.openjurist.org/737/f2d/1417 737 F.2d 1417] (1984), from the United States Court of Appeals for the Fifth Circuit:\n\n:Glenn Crain appeals from the dismissal of his Tax Court petition challenging the constitutional authority of that body and defying the jurisdiction of the Internal Revenue Service to levy taxes on his income. Crain asserts that he \"is not subject to the jurisdiction, taxation, nor regulation of the state,\" that the \"Internal Revenue Service, Incorporated\" lacks authority to exercise the judicial power of the United States, that the Tax Court is unconstitutionally attempting to exercise Article III powers, and that jurisdiction over his person has never been affirmatively proven.\n\n:We perceive no need to refute these arguments with somber reasoning and copious citation of precedent; to do so might suggest that these arguments have some colorable merit. The constitutionality of our income tax system—including the role played within that system by the Internal Revenue Service and the Tax Court—has long been established. We affirm the dismissal of Crain's spurious \"petition\" and the assessment of a penalty imposed by the Tax Court for instituting a frivolous proceeding. .\n\n:The government asks us to assess penalties against Crain for bringing this frivolous appeal, as is authorized by Fed. R. App. P. 38. In Parker v. C. I. R., [http://www.openjurist.org/724/f2d/469/parker-v-commissioner-of-internal-revenue 724 F. 2d 469], 472 (5th Cir. 1984), we sounded \"a cautionary note to those who would persistently raise arguments against the income tax which have been put to rest for years. The full range of sanctions in Rule 38 hereafter shall be summoned in response to a totally frivolous appeal.\"\n\n:We are sensitive to the need for the courts to remain open to all who seek in good faith to invoke the protection of law. An appeal that lacks merit is not always—or often—frivolous. However, we are not obliged to suffer in silence the filing of baseless, insupportable appeals presenting no colorable claims of error and designed only to delay, obstruct, or incapacitate the operations of the courts or any other governmental authority. Crain's present appeal is of this sort. It is a hodgepodge of unsupported assertions, irrelevant platitudes, and legalistic gibberish. The government should not have been put to the trouble of responding to such spurious arguments, nor this court to the trouble of \"adjudicating\" this meritless appeal.\n\n:Accordingly, we grant the government's request. The United States shall recover from appellant Crain twice its cost of this appeal. Additionally, we assess against Crain a damage award of $2000 in favor of the appellee United States.Crain v. Commissioner, 737 F.2d 1417, 84-2 U.S. Tax Cas. (CCH) paragr. 9721 (5th Cir. 1984) (per curiam).\n\nImpact upon filing attorney\n\nFiling a claim that is ultimately deemed frivolous can be highly damaging to the attorney so filing. Attorney Daniel Evans writes:\n\nWashington v. Alaimo\n\nIn Washington v. Alaimo[https://scholar.google.ca/scholar_case?case1617214866373867821&hl\nen&as_sdt2&as_vis\n1&oischolarr&sa\nX&einrNMUOe4NqaL0QH98oHoBg&ved\n0CB4QgAMoADAA 934 F. Supp. 1395 (S.D. Ga. 1996)]. the court listed more than seventy-five frivolous \"motions\" (a request for a court to issue an order), all of which required the attention of the Court, including the following:\n* \"Motion to Behoove an Inquisition\"\n* \"Motion for Judex Delegatus\"\n* \"Motion for Restoration of Sanity\"\n* \"Motion for Deinstitutionalization\"\n* \"Motion for Publicity\"\n* \"Motion to Vacate Jurisdiction\"\n* \"Motion for Cesset processus\"\n* \"Motion for Nunc pro tunc\"\n* \"Motion for Psychoanalysis\"\n* \"Motion to Impeach Judge Alaimo\"\n* \"Motion to Renounce Citizenship\"\n* \"Motion to Exhume Body of Alex Hodgson\"\n* \"Motion to Invoke and Execute Rule 15[https://www.law.cornell.edu/rules/frcp/rule_15 Rule 15], Federal Rules of Civil Procedure.—Retroactive Note: The Court's School Days are Over\"\n* \"Motion for Skin Change Operation\"\n* \"Motion for Catered Food Services\"\n\nWashington, an inmate from Georgia, was eventually prohibited from filing any future lawsuits or motions in any district court unless he first posted a contempt bond of $1,500. To be deemed frivolous, a litigant's arguments must strike beyond the pale.Weblogger Chris Pearson quotes more extensively from Washington v. Alaimo in \n\nPearson v. Chung\n\nIn Pearson v. Chung, Roy Pearson, a Washington, D.C. judge, sued a dry cleaning business for $67 million for allegedly losing a pair of his pants. This case has been cited as an example of frivolous litigation. According to Pearson, the dry cleaners lost his pants (which he brought in for a $10.50 alteration) and refused his demands for a large refund. Pearson believed that a sign saying \"Satisfaction Guaranteed\" in the window of the shop legally entitled him to a refund for the cost of the pants, estimated at $1,000. The $54 million total also included $2.0 million in \"mental distress\" and $15,000 which he estimated to be the cost of renting a car every weekend to go to another dry cleaners. The court ultimately ruled against Pearson, whose judgeship was subsequently not renewed due to this case and several other actions he filed during his divorce, which were found to demonstrate a lack of \"judicial temperament.\"\n\nJonathan Lee Riches\n\nIn 2010, federal prosecutors asked a judge to help them stop Jonathan Lee Riches from filing any more lawsuits, arguing that his frequent filings were frivolous.\n\nGloria Dawn Ironbox\n\nIn July 2013, the Human Rights Tribunal of Ontario dismissed a complaint laid by a man posing as Gloria Dawn Ironbox, a fictional feminist attorney on television series Family Guy. The claimant alleged that the a marketing scheme by A&W Restaurants was \"heteronormative\", \"phallocentric\" and promoted \"cross-sectional hegemony.\" Citing feelings of distress and alienation over the lack of \"LGBT\" representation in A&W naming conventions, he demanded $50,000 in damages for injury to dignity and self-respect as well as an order requiring A&W to adopt naming conventions which include non-traditional families. One such product the claimant demanded was the \"Pillow Biter\", described by the claimant as \"a large, dark slab of meat stuffed firmly between two, white, clenched buns.\"\n\nSirgiorgio Sanford Clardy\n\nIn January 2014, Sirgiorgio Sanford Clardy, who is serving a 100-year prison sentence for a beating of a prostitute and her customer, has filed \"a $100 million lawsuit against Nike\", for which Clardy claims the shoe manufacturer is partially responsible. Clardy says that \"Nike should have placed a label in his Jordan shoes warning consumers that they could be used as a dangerous weapon. He was wearing a pair when he repeatedly stomped the face of a john who was trying to leave a Portland hotel without paying Clardy's prostitute in June 2012. According to The Oregonian, this lawsuit has gained \"considerable attention across the nation and the world.\"\n\nRomine v. Stanton\n\nIn March 2016, James Romine, an independent video game developer who founded Digital Homicide Studios sued a well known video game critic Jim Sterling (James Stanton) for criticizing the games published under his studios' name. Seeking for $10 million in damages for \"assault, liable, and slander\" to Romine's business. He claimed that Stanton's coverage of his studio's game The Slaughtering Grounds as \"Worst Game of 2014 Contender\" was not protected under fair use law because he did not believe it was \"fair\" criticism. An additional lawsuit for $18 million was filed against 100 users on the Steam gaming platform for criticizing their games and business practices, which he had interpreted as \"harassment\". The judge issued a subpoena against Valve Corporation to disclose the identities of those 100 users. This resulted in Valve removing all published games from Digital Homicide Studios. It also didn't help that Romine filed the lawsuit as an individual and not as a corporation, and that such criticism is protected under the right to freedom of speech. The case was dismissed  with prejudice in February 2017. This case is also an example of abuse of DMCA takedown requests on YouTube.",
  "entityProperties" : [ {
    "name" : "title",
    "type" : "String",
    "values" : [ "Frivolous litigation" ],
    "synthetic" : false
  }, {
    "name" : "url",
    "type" : "String",
    "values" : [ "http://en.wikipedia.org/?curid=10616" ],
    "synthetic" : false
  } ],
  "classifications" : [ "xml-export" ],
  "technicalAttributes" : {
    "technicalAttributes" : null,
    "aggregatedText" : "In law, frivolous litigation is the practice of starting or carrying on lawsuits that, due to their lack of legal merit, have little to no chance of being won. The term does not include cases that may be lost due to other matters not related to legal merit. While colloquially, a person may term a lawsuit to be frivolous if he or she personally finds a claim to be absurd, in legal usage \"frivolous litigation\" consists of a claim or defense that is presented where the party (or the party's legal counsel) had reason to know that the claim or defense was manifestly insufficient or futile. The fact that a claim is lost does not imply that it was frivolous.\n\nFrivolous litigation may be based on absurd legal theories, may involve a superabundance or repetition of motions or additional suits, may be uncivil or harassing to the court, or may claim extreme remedies. A claim or defense may be frivolous because it had no underlying justification in fact, or because it was not presented with an argument for a reasonable extension or reinterpretation of the law.  A claim may be deemed frivolous because existing laws unequivocally prohibit such a claim, such as a so-called Good Samaritan law.\n\nIn the United States, Rule 11 of the Federal Rules of Civil Procedure and similar state rules require that an attorney perform a due diligence investigation concerning the factual basis for any claim or defense. Jurisdictions differ on whether a claim or defense can be frivolous if the attorney acted in good faith. Because such a defense or claim wastes the court's and the other parties' time, resources and legal fees, sanctions may be imposed by a court upon the party or the lawyer who presents the frivolous defense or claim. The law firm may also be sanctioned, or even held in contempt.\n\nFederal statutes and rules of court penalizing frivolous litigation\n\nIn the U.S. Tax Court, frivolous arguments may result in a penalty of up to $25,000 under . Similarly, section 7482 of the Internal Revenue Code provides that the U.S. Supreme Court and the U.S. Courts of Appeals may impose penalties in which the taxpayer's appeal of a U.S. Tax Court decision was \"maintained primarily for delay\" or where \"the taxpayer's position in the appeal is frivolous or groundless.\"See paragraph (4) of subsection (c) of . A common example, as shown below, is an argument based on tax protestor claims.\n\nIn a noncriminal case in a U.S. District Court, a litigant (or a litigant's attorney) who presents any pleading, written motion or other paper to the court is required, under Rule 11 of the Federal Rules of Civil Procedure, to certify that, to the best of the presenter's knowledge and belief, the legal contentions \"are warranted by existing law or by a nonfrivolous argument for the extension, modification, or reversal of existing law or the establishment of new law\".Rule 11(b)(2), Federal Rules of Civil Procedure. Monetary civil penalties for violation of this rule may in some cases be imposed on the litigant or the attorney under Rule 11.Rule 11(c), Federal Rules of Civil Procedure.\n\nIn one case, the Seventh Circuit Court issued an order giving such an attorney \"14 days to show cause why he should not be fined $10,000 for his frivolous arguments\".United States v. Patridge, 507 F.3d 1092, 2007-2 U.S. Tax Cas. (CCH) paragr. 50,806 (7th Cir. 2007), cert. denied, 552 U.S. 1280, 128 S.Ct. 1721 (2008). A similar rule penalizing frivolous litigation applies in U.S. Bankruptcy Court under Rule 9011.Rule 9011(b)(2) and Rule 9011(c), Federal Rules of Bankruptcy Procedure.\n\nThe U.S. Congress has enacted section 1912 of Title 28 of the U.S.C. providing that in the U.S. Supreme Court and in the U.S. Courts of Appeals where litigation by the losing party has caused damage to the prevailing party, the court may impose a requirement that the losing party pay the prevailing party for those damages.See .\n\nLitigants who represent themselves (in forma pauperis and pro se) sometimes make frivolous arguments due to their limited knowledge of the law and procedure. The particular tendency of prisoners to bring baseless lawsuits led to passage of the Prison Litigation Reform Act of 1995, which limits the ability of prisoners to bring actions without payment. \n\nCourt treatment of frivolous arguments\n\nAn example of a Court's treatment of frivolous arguments is found in the case of Crain v. Commissioner, [http://www.openjurist.org/737/f2d/1417 737 F.2d 1417] (1984), from the United States Court of Appeals for the Fifth Circuit:\n\n:Glenn Crain appeals from the dismissal of his Tax Court petition challenging the constitutional authority of that body and defying the jurisdiction of the Internal Revenue Service to levy taxes on his income. Crain asserts that he \"is not subject to the jurisdiction, taxation, nor regulation of the state,\" that the \"Internal Revenue Service, Incorporated\" lacks authority to exercise the judicial power of the United States, that the Tax Court is unconstitutionally attempting to exercise Article III powers, and that jurisdiction over his person has never been affirmatively proven.\n\n:We perceive no need to refute these arguments with somber reasoning and copious citation of precedent; to do so might suggest that these arguments have some colorable merit. The constitutionality of our income tax system—including the role played within that system by the Internal Revenue Service and the Tax Court—has long been established. We affirm the dismissal of Crain's spurious \"petition\" and the assessment of a penalty imposed by the Tax Court for instituting a frivolous proceeding. .\n\n:The government asks us to assess penalties against Crain for bringing this frivolous appeal, as is authorized by Fed. R. App. P. 38. In Parker v. C. I. R., [http://www.openjurist.org/724/f2d/469/parker-v-commissioner-of-internal-revenue 724 F. 2d 469], 472 (5th Cir. 1984), we sounded \"a cautionary note to those who would persistently raise arguments against the income tax which have been put to rest for years. The full range of sanctions in Rule 38 hereafter shall be summoned in response to a totally frivolous appeal.\"\n\n:We are sensitive to the need for the courts to remain open to all who seek in good faith to invoke the protection of law. An appeal that lacks merit is not always—or often—frivolous. However, we are not obliged to suffer in silence the filing of baseless, insupportable appeals presenting no colorable claims of error and designed only to delay, obstruct, or incapacitate the operations of the courts or any other governmental authority. Crain's present appeal is of this sort. It is a hodgepodge of unsupported assertions, irrelevant platitudes, and legalistic gibberish. The government should not have been put to the trouble of responding to such spurious arguments, nor this court to the trouble of \"adjudicating\" this meritless appeal.\n\n:Accordingly, we grant the government's request. The United States shall recover from appellant Crain twice its cost of this appeal. Additionally, we assess against Crain a damage award of $2000 in favor of the appellee United States.Crain v. Commissioner, 737 F.2d 1417, 84-2 U.S. Tax Cas. (CCH) paragr. 9721 (5th Cir. 1984) (per curiam).\n\nImpact upon filing attorney\n\nFiling a claim that is ultimately deemed frivolous can be highly damaging to the attorney so filing. Attorney Daniel Evans writes:\n\nWashington v. Alaimo\n\nIn Washington v. Alaimo[https://scholar.google.ca/scholar_case?case1617214866373867821&hl\nen&as_sdt2&as_vis\n1&oischolarr&sa\nX&einrNMUOe4NqaL0QH98oHoBg&ved\n0CB4QgAMoADAA 934 F. Supp. 1395 (S.D. Ga. 1996)]. the court listed more than seventy-five frivolous \"motions\" (a request for a court to issue an order), all of which required the attention of the Court, including the following:\n* \"Motion to Behoove an Inquisition\"\n* \"Motion for Judex Delegatus\"\n* \"Motion for Restoration of Sanity\"\n* \"Motion for Deinstitutionalization\"\n* \"Motion for Publicity\"\n* \"Motion to Vacate Jurisdiction\"\n* \"Motion for Cesset processus\"\n* \"Motion for Nunc pro tunc\"\n* \"Motion for Psychoanalysis\"\n* \"Motion to Impeach Judge Alaimo\"\n* \"Motion to Renounce Citizenship\"\n* \"Motion to Exhume Body of Alex Hodgson\"\n* \"Motion to Invoke and Execute Rule 15[https://www.law.cornell.edu/rules/frcp/rule_15 Rule 15], Federal Rules of Civil Procedure.—Retroactive Note: The Court's School Days are Over\"\n* \"Motion for Skin Change Operation\"\n* \"Motion for Catered Food Services\"\n\nWashington, an inmate from Georgia, was eventually prohibited from filing any future lawsuits or motions in any district court unless he first posted a contempt bond of $1,500. To be deemed frivolous, a litigant's arguments must strike beyond the pale.Weblogger Chris Pearson quotes more extensively from Washington v. Alaimo in \n\nPearson v. Chung\n\nIn Pearson v. Chung, Roy Pearson, a Washington, D.C. judge, sued a dry cleaning business for $67 million for allegedly losing a pair of his pants. This case has been cited as an example of frivolous litigation. According to Pearson, the dry cleaners lost his pants (which he brought in for a $10.50 alteration) and refused his demands for a large refund. Pearson believed that a sign saying \"Satisfaction Guaranteed\" in the window of the shop legally entitled him to a refund for the cost of the pants, estimated at $1,000. The $54 million total also included $2.0 million in \"mental distress\" and $15,000 which he estimated to be the cost of renting a car every weekend to go to another dry cleaners. The court ultimately ruled against Pearson, whose judgeship was subsequently not renewed due to this case and several other actions he filed during his divorce, which were found to demonstrate a lack of \"judicial temperament.\"\n\nJonathan Lee Riches\n\nIn 2010, federal prosecutors asked a judge to help them stop Jonathan Lee Riches from filing any more lawsuits, arguing that his frequent filings were frivolous.\n\nGloria Dawn Ironbox\n\nIn July 2013, the Human Rights Tribunal of Ontario dismissed a complaint laid by a man posing as Gloria Dawn Ironbox, a fictional feminist attorney on television series Family Guy. The claimant alleged that the a marketing scheme by A&W Restaurants was \"heteronormative\", \"phallocentric\" and promoted \"cross-sectional hegemony.\" Citing feelings of distress and alienation over the lack of \"LGBT\" representation in A&W naming conventions, he demanded $50,000 in damages for injury to dignity and self-respect as well as an order requiring A&W to adopt naming conventions which include non-traditional families. One such product the claimant demanded was the \"Pillow Biter\", described by the claimant as \"a large, dark slab of meat stuffed firmly between two, white, clenched buns.\"\n\nSirgiorgio Sanford Clardy\n\nIn January 2014, Sirgiorgio Sanford Clardy, who is serving a 100-year prison sentence for a beating of a prostitute and her customer, has filed \"a $100 million lawsuit against Nike\", for which Clardy claims the shoe manufacturer is partially responsible. Clardy says that \"Nike should have placed a label in his Jordan shoes warning consumers that they could be used as a dangerous weapon. He was wearing a pair when he repeatedly stomped the face of a john who was trying to leave a Portland hotel without paying Clardy's prostitute in June 2012. According to The Oregonian, this lawsuit has gained \"considerable attention across the nation and the world.\"\n\nRomine v. Stanton\n\nIn March 2016, James Romine, an independent video game developer who founded Digital Homicide Studios sued a well known video game critic Jim Sterling (James Stanton) for criticizing the games published under his studios' name. Seeking for $10 million in damages for \"assault, liable, and slander\" to Romine's business. He claimed that Stanton's coverage of his studio's game The Slaughtering Grounds as \"Worst Game of 2014 Contender\" was not protected under fair use law because he did not believe it was \"fair\" criticism. An additional lawsuit for $18 million was filed against 100 users on the Steam gaming platform for criticizing their games and business practices, which he had interpreted as \"harassment\". The judge issued a subpoena against Valve Corporation to disclose the identities of those 100 users. This resulted in Valve removing all published games from Digital Homicide Studios. It also didn't help that Romine filed the lawsuit as an individual and not as a corporation, and that such criticism is protected under the right to freedom of speech. The case was dismissed  with prejudice in February 2017. This case is also an example of abuse of DMCA takedown requests on YouTube. Frivolous litigation. http://en.wikipedia.org/?curid=10616."
  }
}
